{"id":"320323014_Through_predators'_eyes_Phenotype-environment_associations_in_shore_crab_coloration_at_different_spatial_scales","abstract":"Phenotype–environment associations in coloration often involve camouflage, enabling organisms to blend into their environment and thereby reducing predatory attacks. The nature of any associations may vary among receivers with different visual systems and at different spatial scales, but these effects have rarely been investigated together. We studied shore crabs (Carcinus maenas), at seven intertidal sites in the south-west UK. We used image analysis and vision modelling to examine the relationships with predator vision (bird/fish), crab maturity (adult/juvenile) and habitat spatial scale (meso/micro) on shore crab coloration, in order to establish links between crab appearance and habitat. We show that crabs are likely to be more colourful to tetrachromatic birds than to dichromatic fish, while fish may see the crabs as being lighter and with larger patterns. Adult crabs had more uniform coloration, whereas juveniles showed more variable colour patterns. At the mesoscale, rock pool and mussel habitats harboured crabs with more variable coloration, whereas crabs from mudflats were more uniform. Comparisons at the microscale revealed a wide range of carapace variation, including divergent crab patterning on red and green algal beds. Our findings have implications for the evolution of camouflage under multi-species predation risk in heterogeneous environments in nature.","authors":["Ossi Nokelainen","Nik Hubbard","Alice E. Lown","Louisa Wood"],"meta":["September 2017Biological Journal of the Linnean Society 122(4)","DOI:10.1093/biolinnean/blx101","Project: Camouflage"],"references":["317715215_Repeated_evolution_of_camouflage_in_speciose_desert_rodents","303304514_Color_Change_Phenotypic_Plasticity_and_Camouflage","291832454_Microhabitat_choice_in_island_lizards_enhances_camouflage_against_avian_predators","281644702_Use_of_Hyperspectral_Imagery_to_Assess_Cryptic_Color_Matching_in_Sargassum_Associated_Crabs","281627757_A_whiter_shade_of_male_Color_background_matching_as_a_function_of_size_and_sex_in_the_yellow_shore_crab_Hemigrapsus_oregonensis_Dana_1851","281457084_Interactions_between_background_matching_and_disruptive_colouration_Experiments_using_human_predators_and_virtual_crabs","280966721_Phenotype_-_Environment_matching_in_sand_fleas","313702160_The_colours_of_animals","291787267_The_Law_Which_Underlies_Protective_Coloration","281763511_Animal_Camouflage_Mechanisms_and_Function"]}