{"id":"320385872_Successful_implementation_of_Virtual_Environment_for_Radiotherapy_Training_VERT_in_Medical_Physics_education_The_University_of_Sydney's_initial_experience_and_recommendations","abstract":"This report outlines the University of Sydney’s initial experience with the Virtual Environment for Radiotherapy Training (VERT) system in the Master of Medical Physics program. VERT is a commercially available system, simulating linear accelerators, patient computed tomography (CT) sets, plans and treatment delivery. It was purpose built for radiation therapy (RT) education and offers learners the opportunity to gain knowledge and skills within an interactive, risk-free environment. The integration of VERT into the RT physics module of the Master of Medical Physics program was intended to enhance student knowledge and skills relevant to the curriculum’s learning objectives, and to alleviate some of the burden associated with student access to clinical equipment. Three VERT practical sessions were implemented: “RT treatment planning systems”, “(CT) Anatomy for physicists” and “Linear accelerator measurements”. Our experience and student evaluations were positive and demonstrated the viability of VERT for medical physics (MP) student education. We anticipate that integration of VERT into MP teaching is a valuable addition to traditional methods and can aid MP students’ understanding and readiness for practice. Additional evaluations should be conducted to ascertain VERT’s role in delivering efficient quantity and quality of MP education, and its potential in alleviating burdens placed on clinical departments.","authors":["Yobelli Jimenez","Christian Rønn Hansen","Prabhjot Juneja","David I. Thwaites"],"meta":["October 2017Australasian physical & engineering sciences in medicine / supported by the Australasian College of Physical Scientists in Medicine and the Australasian Association of Physical Sciences in Medicine 40(1)","DOI:10.1007/s13246-017-0592-9","Project: Virtual Environment for Radiotherapy Training"],"references":["274631104_Strategic_approaches_to_simulation-based_education_A_case_study_from_Australia","271725218_Multicentre_knowledge_sharing_and_planningdose_audit_on_flattening_filter_free_beams_for_SBRT_lung","262984688_The_use_of_a_virtual_reality_simulator_to_explore_and_understand_the_impact_of_Linac_mis-calibrations","259167619_Competency_based_Assessment_Using_a_Virtual_Environment_for_Radiotherapy","7613777_Features_and_uses_of_high-fidelity_medical_simulations_that_lead_to_effective_learning_A_BEME_systematic_review","5461883_Virtual_reality_training_for_radiotherapy_becomes_a_reality","292682248_How_to_use_VERT_for_interactive_CT_anatomy_for_post-registration_training","281931741_A_virtual_radiation_therapy_workflow_training_simulation","242013495_VERT_Virtual_Environment_for_Radiotherapy_Training","225305257_Virtual_reality_simulation_training_for_health_professions_trainees_in_gastrointestinal_endoscopy"]}