{"id":"320382404_A_single_quadtree-based_algorithm_for_top-_k_spatial_keyword_query","abstract":"Recent years have witnessed the generation of a massive amount of spatial–textual data. In view of this, a new type of query coined spatial keyword query has been proposed to deal with the location-based services with additional keyword constraint. This paper studies one of the most popular spatial keyword queries called Top-k Spatial Keyword Query(TkSKQ). Explicitly speaking, given a set of objects, a TkSKQ finds the k objects that are closest to the querier with each of these k objects satisfying all the keywords specified by the query. This kind of query is of paramount importance in a variety of application domains such as location-based recommendation and advertisement.\nThe state-of-art algorithm for processing a TkSKQ is highly sensitive to the number of query keywords specified in the query such that its performance degrades significantly with an increase in the number of keywords. To remedy this drawback, this paper proposes a novel mechanism that utilizes an additional keyword list to enhance the efficiency of the existing solution. Based on this indexing technique, our algorithm needs only traverse a single quadtree when processing a TkSKQ. Moreover, we study how to prioritize the keywords in the vocabulary so as to optimize the performance of our technique. Furthermore, we deal with a generalized version of the TkSKQ problem, called HkSKQ. A similar technique can also be useful for solving HkSKQ. Experimental results on both synthetic and real data reveal the superiority of our proposed scheme.","authors":["Hsiang-Jen Hong","Ge-Ming Chiu","Wan-Yu Tsai"],"meta":["October 2017Pervasive and Mobile Computing 42","DOI:10.1016/j.pmcj.2017.09.009"],"references":["301246915_Skype_top-k_spatial-keyword_publishsubscribe_over_sliding_window","220515739_Signature_Files_An_Access_Method_for_Documents_and_Its_Analytical_Performance_Evaluation","317071132_Direction-Aware_Why-Not_Spatial_Keyword_Top-k_Queries","308188875_Efficient_Group_Top-k_Spatial_Keyword_Query_Processing","305246688_Inverted_Linear_Quadtree_Efficient_Top_K_Spatial_Keyword_Search","304456571_Answering_why-not_spatial_keyword_top-k_queries_via_keyword_adaption","283708398_Efficient_Collective_Spatial_Keyword_Query_Processing_on_Road_Networks","283104163_AP-Tree_Efficiently_support_continuous_spatial-keyword_queries_over_stream","283022049_Answering_why-not_questions_on_spatial_keyword_top-k_queries","282939672_Temporal_Spatial-Keyword_Top-k_publishsubscribe","257457500_A_framework_for_efficient_spatial_web_object_retrieval","224250175_Joint_Top-K_Spatial_Keyword_Query_Processing","224171012_IR-Tree_An_Efficient_Index_for_Geographic_Document_Search","220538881_Efficient_Retrieval_of_the_Top-k_Most_Relevant_Spatial_Web_Objects","220225469_Distance_Browsing_in_Spatial_Databases","3186937_PROBE_Spatial_Data_Modeling_and_Query_Processing_in_an_Image_Database_Application"]}