{"id":"320365031_Data-Driven_Learning_Framework_for_Associating_Weather_Conditions_and_Wind_Turbine_Failures","abstract":"The need for cost effective operation and maintenance (O&M) strategies in wind farms has risen significantly with the growing wind energy sector. In order to decrease costs, current practice in wind farm O&M is switching from corrective and preventive strategies to rather predictive ones. Anticipating wind turbine (WT) failures requires sophisticated models to understand the complex WT component degradation processes and to facilitate maintenance decision making. Environmental conditions and their impact on WT reliability play a significant role in these processes and need to be investigated profoundly. This paper is presenting a framework to assess and correlate weather conditions and their effects on WT component failures. Two approaches, using (a) supervised and (b) unsupervised data mining techniques are applied to pre-process the weather and failure data. An apriori rule mining algorithm is employed subsequently, in order to obtain logical interconnections between the failure occurrences and the environmental data, for both approaches. The framework is tested using a large historical failure database of modern wind turbines. The results show the relation between environmental parameters such as relative humidity, ambient temperature, wind speed and the failures of five major WT components: gearbox, generator, frequency converter, pitch and yaw system. Additionally, the performance of each technique, associating weather conditions and WT component failures, is assessed.","authors":["Maik Reder","Nurseda Yildirim","Julio J. Melero"],"meta":["January 2018Reliability Engineering [?] System Safety 169:554","DOI:10.1016/j.ress.2017.10.004","Projects: AWESOME – Advanced Wind Energy Systems Operation and Maintenance ExpertiseReliability Models and Failure Prediciton Algorithms for Wind Turbine Components"],"references":["271913505_Case_Study_of_Weather_Maintenance_in_Wind_Power_Generation"]}