{"id":"320371308_SUCCESS_FACTORS_AFFECTING_THE_HEALTHCARE_PROFESSIONALS_TO_UTILIZE_CLOUD_COMPUTING_SERVICES","abstract":"Integrating the new technologies to improve the healthcare services can be seen as one of the research trends nowadays, as earlier studies have recommended the potential of emerging technologies in enhancing healthcare service practices by means of providing more opportunities to carry out activities essential for prevention, diagnosis, monitoring, and treatment of the disease. Involving the cloud computing services in healthcare domain can offer a way for handling and maintaining health data by making use of software applications hosted on the Internet, in which the healthcare workers can access and manage patient’s health records anywhere and at any time. This provides them the flexibility to track and monitor the patients remotely. To ensure successful cloud computing adoption and utilization, a pre-examination on the context of usage should be applied in order to collect the real needs to guarantee getting all the possible benefits of this technology. In Iraq, the health records of public hospitals consist of various types of data which continue to increase in velocity, volume, and variety progressively. This has led to several major issues to the health sectors from two perspectives, data complexity and low IT integrity. For that reason, managing and maintaining all these health data are essential to healthcare organizations. In this paper, we collected the success factors that may influence the healthcare professionals to utilize cloud computing services for the health sector in Iraq. This is done by conducting an interview with 30 physicians and technicians from four hospitals in Iraq, then a literature survey was carried out to verify that all the gathered factors are within the circumstance of healthcare. It has been found that eight factors may affect the perspective of healthcare professionals to utilize cloud computing services. Finally, a conceptual model was developed based on the findings.","authors":["Ahmed Meri","Mohammad Khatim Hasan","Nurhizam Safie Mohd Satar"],"meta":["December 2017","DOI:10.17576/apjitm-2017-0602-04","Projects: cloud technology in healthcareModelling a Cloud Computing Utilization for Health Information Systems"],"references":["320371297_The_Impact_of_Organizational_Structure_and_System_Settings_on_the_Healthcare_Individuals'_Perception_to_Utilize_Cloud_Services_A_Theoretical_Literature_Survey","320371288_Towards_Utilizing_Cloud_Health_Information_Systems_A_Proposed_Model","316185239_Assessing_the_Determinants_of_Cloud_Computing_Services_for_Utilizing_Health_Information_Systems_A_Case_Study","304821901_Pervasive_eHealth_services_a_security_and_privacy_risk_awareness_survey","349901590_Writing_Interview_Protocols_and_Conducting_Interviews_Tips_for_Students_New_to_the_Field_of_Qualitative_Research","320150103_Business_Model_Innovation_in_Software_Product_Industry","309536071_Pervasive_eHealth_services_a_security_and_privacy_risk_awareness_survey","308250037_Retail_logistics","308083679_Security_and_Privacy_Preserving_Approaches_in_the_eHealth_Clouds_with_Disaster_Recovery_Plan","307981421_Investigating_the_structural_linkage_between_IT_capability_and_organizational_agility_A_study_on_Indian_financial_enterprises"]}