{"id":"320396752_Simulation_Game_as_a_Reference_to_Smart_City_Management","abstract":"The purpose of this research is to know exactly what a ‘Smart City’ and its aspects are. Furthermore, to ensure this ‘Smart City’ aspects and their problems can be implemented in a game, so the game will be able to teach people about missed problem solving solutions. This research paper will discuss about the influence gained from playing a game upon city management skills, and careful planning on what must be done first, in order to maintain or increase the well-being of the citizen and the city welfare. By implementing real life applicable condition in the game which will be played by a person through a sandbox simulation style of gameplay, the player will be able to learn and experience certain types of city problems and the solutions to mitigate those problems without actually making it occur in a real city with real casualties, so it will be a safe vessel to gain new knowledge or to rediscover old effective methods, regarding city management, through a game. The results will portray, how can ‘Smart City’ aspects be implemented into a game, and how a city management simulation game can influence other people’ actions on their city management knowledge.","authors":["David Wiseli","Ryanarta Tanusetiawan","Fredy Purnomo"],"meta":["December 2017Procedia Computer Science 116:468-475","DOI:10.1016/j.procs.2017.10.053"],"references":["276155721_Governing_the_smart_city_a_review_of_the_literature_on_smart_urban_governance","270851624_A_Game-based_learning_system_for_improving_student's_learning_effectiveness_in_system_analysis_course","265425294_Digital_Games_in_Education_The_Design_of_Game-Based_Learning_Environments","265091720_Smart_Health_A_Context-Aware_Health_Paradigm_within_Smart_Cities","308049394_Smart_city_indicators_A_systematic_literature_review","286812445_IHealth_A_fuzzy_approach_for_provisioning_intelligent_health-care_system_in_smart_city","285637737_Good_video_games_and_good_learning","275084533_Programming_Environments_Environmentality_and_Citizen_Sensing_in_the_Smart_City","269836299_Smartmentality_The_Smart_City_as_Disciplinary_Strategy","261202575_Smart_City_and_the_Applications"]}