{"id":"320356932_Convergence_Rate_Analysis_of_Several_Splitting_Schemes","abstract":"Operator-splitting schemes are iterative algorithms for solving many types of numerical problems. A lot is known about these methods: they converge, and in many cases we know how quickly they converge. But when they are applied to optimization problems, there is a gap in our understanding: The theoretical speed of operator-splitting schemes is nearly always measured in the ergodic sense, but ergodic operator-splitting schemes are rarely used in practice. In this chapter, we tackle the discrepancy between theory and practice and uncover fundamental limits of a class of operator-splitting schemes. Our surprising conclusion is that the relaxed Peaceman-Rachford splitting algorithm, a version of the Alternating Direction Method of Multipliers (ADMM), is nearly as fast as the proximal point algorithm in the ergodic sense and nearly as slow as the subgradient method in the nonergodic sense. A large class of operator-splitting schemes extend from the relaxed Peaceman-Rachford splitting algorithm. Our results show that this class of operator-splitting schemes is also nearly as slow as the subgradient method. The tools we create in this chapter can also be used to prove nonergodic convergence rates of more general splitting schemes, so they are interesting in their own right.","authors":["Damek Davis","Wotao Yin"],"meta":["January 2016","DOI:10.1007/978-3-319-41589-5_4","In book: Splitting Methods in Communication, Imaging, Science, and Engineering (pp.115-163)Publisher: Springer"],"references":["274645139_A_Three-Operator_Splitting_Scheme_and_its_Optimization_Applications","269998340_On_the_convergence_rate_of_a_forward-backward_type_primal-dual_splitting_algorithm_for_convex_optimization_problems","267385735_On_non-ergodic_convergence_rate_of_Douglas-Rachford_alternating_direction_method_of_multipliers","267054708_On_the_Convergence_of_the_Proximal_Point_Algorithm_for_Convex_Minimization","315573860_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Spaces","312113257_Self_Equivalence_of_the_Alternating_Direction_Method_of_Multipliers","303561475_Two_remarks_on_the_method_of_successive_approximations","285677677_Augmented_Lagrangian_Methods_Applications_to_the_Numerical_Solution_of_Boundary-Value_Problems","277679394_A_Generalized_Proximal_Point_Algorithm_and_Its_Convergence_Rate","275978582_Infinite_Sequences_and_Series"]}