{"id":"320345887_Interactive_Example-Based_Terrain_Authoring_with_Conditional_Generative_Adversarial_Networks","abstract":"Authoring virtual terrains presents a challenge and there is a strong need for\nauthoring tools able to create realistic terrains with simple user-inputs and\nwith high user control. We propose an example-based authoring pipeline\nthat uses a set of terrain synthesizers dedicated to specific tasks. Each terrain\nsynthesizer is a Conditional Generative Adversarial Network trained\nby using real-world terrains and their sketched counterparts. The training\nsets are built automatically with a view that the terrain synthesizers learn\nthe generation from features that are easy to sketch. During the authoring\nprocess, the artist first creates a rough sketch of the main terrain features,\nsuch as rivers, valleys and ridges, and the algorithm automatically synthesizes\na terrain corresponding to the sketch using the learned features of the\ntraining samples. Moreover, an erosion synthesizer can also generate terrain\nevolution by erosion at a very low computational cost. Our framework\nallows for an easy terrain authoring and provides a high level of realism\nfor a minimum sketch cost. We show various examples of terrain synthesis\ncreated by experienced as well as inexperienced users who are able to design\na vast variety of complex terrains in a very short time.","authors":["Eric Guérin","Julie Digne","Eric Galin","Adrien Peytavie"],"meta":["November 2017ACM Transactions on Graphics 36(6)","DOI:10.1145/3130800.3130804","Project: Machine learning for computer graphics"],"references":["310610633_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","319770416_DRAW_A_Recurrent_Neural_Network_For_Image_Generation","319770355_Generative_Adversarial_Nets","319770234_Deep_multi-scale_video_prediction_beyond_mean_square_error","319770229_Auto-Encoding_Variational_Bayes","319770155_Generating_Images_from_Captions_with_Attention","316864226_Authoring_Landscapes_by_Combining_Ecosystem_and_Terrain_Erosion_Simulation","315775929_Sculpting_Mountains_Interactive_Terrain_Modeling_Based_on_Subsurface_Geology","311611060_Context_Encoders_Feature_Learning_by_Inpainting","308825079_Learning_to_generate_chairs_with_convolutional_neural_networks"]}