{"id":"320383108_From_Point_Clouds_to_Building_Information_Models_3D_Semi-Automatic_Reconstruction_of_Indoors_of_Existing_Buildings","abstract":"The creation of as-built Building Information Models requires the acquisition of the as-is state of existing buildings. Laser scanners are widely used to achieve this goal since they permit to collect information about object geometry in form of point clouds and provide a large amount of accurate data in a very fast way and with a high level of details. Unfortunately, the scan-to-BIM (Building Information Model) process remains currently largely a manual process which is time consuming and error-prone. In this paper, a semi-automatic approach is presented for the 3D reconstruction of indoors of existing buildings from point clouds. Several segmentations are performed so that point clouds corresponding to grounds, ceilings and walls are extracted. Based on these point clouds, walls and slabs of buildings are reconstructed and described in the IFC format in order to be integrated into BIM software. The assessment of the approach is proposed thanks to two datasets. The evaluation items are the degree of automation, the transferability of the approach and the geometric quality of results of the 3D reconstruction. Additionally, quality indexes are introduced to inspect the results in order to be able to detect potential errors of reconstruction.","authors":["Hélène Macher","Tania Landes","Pierre Grussenmeyer"],"meta":["October 2017Applied Sciences 7(10):1030","DOI:10.3390/app7101030","Project: Building Information Modelling"],"references":["320406175_Representation_Requirements_of_As-Is_Building_Information_Models_Generated_from_Laser_Scanned_Point_Cloud_Data","319354618_BIM-Based_Approach_to_Simulate_Building_Adaptive_Performance_and_Life_Cycle_Costs_for_an_Open_Building_Design","305303330_Object_Boundaries_and_Room_Detection_in_As-Is_BIM_Models_from_Point_Cloud_Data","303515109_Detection_of_Walls_Floors_and_Ceilings_in_Point_Cloud_Data","301914013_Automated_Semantic_Labelling_of_3D_Vector_Models_for_Scan-to-BIM","300727663_Automatic_3D_Industrial_Point_Cloud_Classification_and_Modeling","336665266_Basics_of_range-based_modelling_techniques_in_Cultural_Heritage","320388873_Constructing_As-Is_BIMs_from_Progressive_Scan_Data","311366431_Building_information_modelling_BIM_Now_and_beyond","308659019_Building_Modeling_through_Enclosure_Reasoning"]}