{"id":"320396713_User_Satisfaction_Model_for_e-Learning_Using_Smartphone","abstract":"Level of smartphone usage can be used as an indicator of technological progress of a region. This study aims to explore and make user satisfaction model for e-learning using smartphone applications in Mulawarman University. The purpose of the research is to make user satisfaction model for e-learning using smartphone, and to produce and to recommend e-learning content for research and e-learning. The components that would be evaluated in this research are focused on the following matters: User satisfaction for e-Learning using Smartphone; Service quality, Information quality, User participation, and Benefit. Where service quality consists of demeanor, responsiveness, competence and tangible. Information quality consist of completeness, relevancy, accuracy, and currency. User participation consist of training provider, user understanding and participation. Benefit consist of easier to the job and increase productivity. The research method used Path Diagram, Structural Equation Model, Lisrel and Manova Analysis. Total of respondent are 178 students which are consist of 83 females and 95 males. The statistical value in the model of e-learning user satisfaction has a highly significant correlation values and strong construction between variables, which is evidenced by the size of the construct reliability values above 0.70 and the value of its variance extracted 0.50 The model can be considered in developing an e-learning application in the future.","authors":["Ramadiani Ramadiani","Azainil Azainil","Usfandi Haryaka","Fahrul Agus"],"meta":["December 2017Procedia Computer Science 116:373-380","DOI:10.1016/j.procs.2017.10.070","Projects: Information TechnologyPolicy Evaluation Total Quality Management (TQM) School Applying International Organization For Standardization (ISO) In The City Of Samarindae-Learning"],"references":["323987828_E-LEARNING_USER_INTERFACE_ACCEPTANCE_BASED_ON_ANALYSIS_OF_USER'S_STYLE_USABILITY_AND_USER_BENEFITS","269304889_Technological_Aspects_of_E-Learning_System_in_Malaysian_Context","242926149_Information_access_behaviour_and_expectation_of_quality_Two_factors_affecting_the_satisfaction_of_users_of_clinical_hospital_information_systems","282828196_What_Makes_Users_Buy_Paid_Smartphone_Applications_Examining_App_Personal_and_Social_Influences","261313188_A_study_on_the_customer_satisfaction_and_using_intention_of_e-learning","261298536_The_study_on_exploring_the_user_satisfaction_of_easy_teaching_web_of_Taipei_by_information-seeking_and_technology_acceptance_model","233817410_User_information_satisfaction_IS_implementability_and_effectiveness","224692434_How_to_Achieve_User_Satisfaction_in_Complex_E-Learning_Environments","222151961_The_relation_between_user_satisfaction_usage_of_information_systems_and_performance","220433861_User_Satisfaction_with_Information_Seeking_on_the_Internet"]}