{"id":"320318778_Examining_the_Ability_of_Artificial_Neural_Networks_Machine_Learning_Models_to_Accurately_Predict_Complications_Following_Posterior_Lumbar_Spine_Fusion","abstract":"Study design: \nCross-sectional database study.\n\nObjective: \nTo train and validate machine learning models to identify risk factors for complications following posterior lumbar spine fusion.\n\nSummary of background data: \nMachine learning models such as artificial neural networks (ANNs) are valuable tools for analyzing and interpreting large and complex datasets. ANNs have yet to be used for risk factor analysis in orthopedic surgery.\n\nMethods: \nThe American College of Surgeons National Surgical Quality Improvement Program (ACS-NSQIP) database was queried for patients who underwent posterior lumbar spine fusion. This query returned 22,629 patients, 70% of whom were used to train our models, and 30% were used to evaluate the models. The predictive variables used included sex, age, ethnicity, diabetes, smoking, steroid use, coagulopathy, functional status, American society for anesthesiology (ASA) class ≥ 3, body mass index (BMI), pulmonary comorbidities, and cardiac comorbidities. The models were used to predict cardiac complications, wound complications, venous thromboembolism (VTE), and mortality. Using ASA class as a benchmark for prediction, area under receiver operating curves (AUC) was used to determine the accuracy of our machine learning models.\n\nResults: \nBased on AUC values, ANN and LR both outperformed ASA class for predicting all four types of complications. ANN was the most accurate for predicting cardiac complications, and LR was most accurate for predicting wound complications, VTE, and mortality, though ANN and LR had comparable AUC values for predicting all types of complications. ANN had greater sensitivity than LR for detecting wound complications and mortality.\n\nConclusions: \nMachine learning in the form of logistic regression and artificial neural networks were more accurate than benchmark ASA scores for identifying risk factors of developing complications following posterior lumbar spine fusion, suggesting they are potentially great tools for risk factor analysis in spine surgery.\n\nLevel of evidence: \n3.","authors":["Jun Sup Kim","Robert K. Merrill","Varun Arvind","Deepak Kaji"],"meta":["October 2017Spine 43(12):1","DOI:10.1097/BRS.0000000000002442"],"references":["313128305_A_Novel_Ensemble_Method_for_Imbalanced_Data_Learning_Bagging_of_Extrapolation-SMOTE_SVM","308960871_Detection_of_Clinically_Important_Colorectal_Surgical_Site_Infection_using_Bayesian_Network","308763142_Lumbar_interbody_fusion_techniques_indications_and_comparison_of_interbody_fusion_options_including_PLIF_TLIF_MI-TLIF_OLIFATP_LLIF_and_ALIF","281815237_Automated_Detection_of_Postoperative_Surgical_Site_Infections_Using_Supervised_Methods_with_Electronic_Health_Record_Data","313687778_Classifier_transfer_with_data_selection_strategies_for_online_support_vector_machine_classification_with_class_imbalance","313239244_Analysis_of_Risk_Factors_for_Major_Complications_Following_Elective_Posterior_Lumbar_Fusion","309262003_Predicting_the_Future_-_Big_Data_Machine_Learning_and_Clinical_Medicine","299538673_The_Incidence_and_Risk_Factors_for_30-Day_Unplanned_Readmissions_After_Elective_Posterior_Lumbar_Fusion","274725067_Risk_Factors_Associated_with_30-day_Readmissions_after_Instrumented_Spine_Surgery_in_14939_Patients","264632073_Quantifying_surgical_complexity_with_machine_learning_Looking_beyond_patient_factors_to_improve_surgical_models"]}