{"id":"320362356_The_trade-off_between_morphology_and_control_in_the_co-optimized_design_of_robots","abstract":"Conventionally, robot morphologies are developed through simulations and calculations, and different control methods are applied afterwards. Assuming that simulations and predictions are simplified representations of our reality, how sure can roboticists be that the chosen morphology is the most adequate for the possible control choices in the real-world? Here we study the influence of the design parameters in the creation of a robot with a Bayesian morphology-control (MC) co-optimization process. A robot autonomously creates child robots from a set of possible design parameters and uses Bayesian Optimization (BO) to infer the best locomotion behavior from real world experiments. Then, we systematically change from an MC co-optimization to a control-only (C) optimization, which better represents the traditional way that robots are developed, to explore the trade-off between these two methods. We show that although C processes can greatly improve the behavior of poor morphologies, such agents are still outperformed by MC co-optimization results with as few as 25 iterations. Our findings, on one hand, suggest that BO should be used in the design process of robots for both morphological and control parameters to reach optimal performance, and on the other hand, point to the downfall of current design methods in face of new search techniques.","authors":["Andre Rosendo","Marco von Atzigen","Fumiya Iida"],"meta":["October 2017PLoS ONE 12(10):e0186107","DOI:10.1371/journal.pone.0186107"],"references":["281389178_Morphological_Evolution_of_Physical_Robots_through_Model-Free_Phenotype_Development","280438171_Bayesian_Optimization_for_Learning_Gaits_under_Uncertainty","280044845_Evolutionary_Robotics_What_Why_and_Where_to","277323278_Robots_that_can_adapt_like_animals","317005986_Evolutionary_Developmental_Robotics_Improving_Morphology_and_Control_of_Physical_Robots","316535550_Evolutionary_developmental_robotics_Improving_morphology_and_control_of_physical_robots","311755249_Unscented_Bayesian_optimization_for_safe_robot_grasping","296947233_Gaussian_processes_in_machine_learning","283499681_A_Bayesian_Developmental_Approach_to_Robotic_Goal-Based_Imitation_Learning","277410992_From_evolutionary_computation_to_the_evolution_of_things"]}