{"id":"320360918_Reversible_Dual-Image-Based_Hiding_Scheme_Using_Block_Folding_Technique","abstract":"The concept of a dual-image based scheme in information sharing consists of concealing secret messages in two cover images; only someone who has both stego-images can extract the secret messages. In 2015, Lu et al. proposed a center-folding strategy where each secret symbol is folded into the reduced digit to reduce the distortion of the stego-image. Then, in 2016, Lu et al. used a frequency-based encoding strategy to reduce the distortion of the frequency of occurrence of the maximum absolute value. Because the folding strategy can obviously reduce the value, the proposed scheme includes the folding operation twice to further decrease the reduced digit. We use a frequency-based encoding strategy to encode a secret message and then use the block folding technique by performing the center-folding operation twice to embed secret messages. An indicator is needed to identify the sequence number of the folding operation. The proposed scheme collects several indicators to produce a combined code and hides the code in a pixel to reduce the size of the indicators. The experimental results show that the proposed method can achieve higher image quality under the same embedding rate or higher payload, which is better than other methods.","authors":["Tzu-Chuen Lu","Hui-Shih Leng"],"meta":["October 2017Symmetry 9(10):223","DOI:10.3390/sym9100223"],"references":["310780169_Reversible_data_hiding_in_dual_stego-images_using_frequency-based_encoding_strategy","326998029_A_Steganographic_Scheme_by_Fully_Exploiting_Modification_Directions","312888624_Efficient_steganographic_embedding_by_exploiting_modification_direction","275220814_Dual-image-based_reversible_data_hiding_method_using_center_folding_strategy","275059722_A_novel_reversible_image_data_hiding_scheme_based_on_pixel_value_ordering_and_dynamic_pixel_block_partition","271951936_Reversible_data_hiding_scheme_based_on_exploiting_modification_direction_with_two_steganographic_images","271732477_Pixel-based_pixel_value_ordering_predictor_for_high-fidelity_reversible_data_hiding","271555971_A_high_payload_data_embedding_scheme_using_dual_stego-images_with_reversibility","267395670_StegExpose_-_A_Tool_for_Detecting_LSB_Steganography","266204560_Dual_imaging-based_reversible_hiding_technique_using_LSB_matching"]}