{"id":"320333741_A_self-avoiding_walk_with_neural_delays_as_a_model_of_fixational_eye_movements","abstract":"Fixational eye movements show scaling behaviour of the positional mean-squared displacement with a characteristic transition from persistence to antipersistence for increasing time-lag. These statistical patterns were found to be mainly shaped by microsaccades (fast, small-amplitude movements). However, our re-analysis of fixational eye-movement data provides evidence that the slow component (physiological drift) of the eyes exhibits scaling behaviour of the mean-squared displacement that varies across human participants. These results suggest that drift is a correlated movement that interacts with microsaccades. Moreover, on the long time scale, the mean-squared displacement of the drift shows oscillations, which is also present in the displacement auto-correlation function. This finding lends support to the presence of time-delayed feedback in the control of drift movements. Based on an earlier non-linear delayed feedback model of fixational eye movements, we propose and discuss different versions of a new model that combines a self-avoiding walk with time delay. As a result, we identify a model that reproduces oscillatory correlation functions, the transition from persistence to antipersistence, and microsaccades.","authors":["Carl J. J. Herrmann","Ralf Metzler","Ralf Engbert"],"meta":["October 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-13489-8"],"references":["303459904_The_analysis_of_the_influence_of_fractal_structure_of_stimuli_on_fractal_dynamics_in_fixational_eye_movements_and_EEG_signal","301271126_Microsaccades_enable_efficient_synchrony-based_coding_in_the_retina_A_simulation_study","294283756_Persistence_in_eye_movement_during_visual_search","282036148_V1_neurons_respond_differently_to_object_motion_versus_motion_from_eye_movements","353823939_Mathematics_as_a_Laboratory_Tool_Dynamics_Delays_and_Noise","346624760_First_Steps_in_Random_Walks_From_Tools_to_Applications","313335266_Manipulation_and_Motion_of_Organelles_and_Single_Molecules_in_Living_Cells","303917036_Sharper_Stronger_Faster_Upper_Visual_Field_Representation_in_Primate_Superior_Colliculus","302200753_Fractional_Brownian_motion_fractional_noises_and_applications","279608237_Binocular_Coordination_in_Microsaccades"]}