{"id":"320310451_Simulation-Based_Optimization_for_Improving_Hospital_Performance","abstract":"Background and Objectives: Nowadays health services affect a significant part of social, economic and political parts of each country. In this case, hospitals are considered as the important and final stage of health service supply chain. Consequently, quality of health services offered by hospitals has a straight impact on the safety of individuals.\n\nMethods: The application of efficient operations research tools plays a key role according to the purpose of enhancing the performance of this vital section of health service supply chain. This paper aims at developing a design of experiments model (DOE) model based on computer simulation for the sake of optimizing important factors such as queue length, patient waiting time, departure rate and productivity. The DOE technique utilized in this paper is response surface methodology (RSM) and the proposed simulation model considers all wards and their relationships as well as their interactions together. This approach is designed and implemented in Shomal hospital located in North of Iran.\n\nFindings: By taking advantage of the RSM technique by simultaneously considering optimum resource values, beneficial results have been obtained. For instance, risk mitigation of decision-making process by evaluating and analyzing different scenarios, reduction of queue length and patient waiting time could be mentioned as some satisfactory achievements.\n\nConclusions: This research is aiming at determining optimum levels of input factors in a real system, but some data related to some unpredictable events (such as human errors while gathering data) were eliminated. In conclusion, future works may encompass other industrial cases besides applying more precise and developed DOE techniques, to mitigate the risks and limitations encountered in this study.","authors":["Majid Baqeri","Hossein Pasha Abgarmi","Samuel Yousefi","Azra Alizadeh"],"meta":["June 2017","DOI:10.15171/ijhr.2017.12"],"references":["302479582_A_simulation_model_for_emergency_medical_services_call_centers","297894173_Demand_and_capacity_modelling_for_acute_services_using_discrete_event_simulation","282774453_Role_activity_diagram-based_discrete_event_simulation_model_for_healthcare_service_delivery_processes","302479776_Multi-objective_optimization_for_a_hospital_inpatient_flow_process_via_Discrete_Event_Simulation","301356987_Response_Surface_Methodology_and_Related_Topics","299417814_Simulation_model_to_assist_the_planning_and_management_of_Health_Services","298929223_Joint_optimization_of_mean_and_standard_deviation_using_response_surface_methods","296468809_A_discrete_event_simulation_tool_to_support_and_predict_hospital_and_clinic_staffing","293639861_Discrete-Event_System_Simulation","281484835_StratBAM_A_Discrete-Event_Simulation_Model_to_Support_Strategic_Hospital_Bed_Capacity_Decisions"]}