{"id":"320339733_Multi-subpopulation_Evolutionary_Algorithms_for_Coverage_Deployment_of_UAV-networks","abstract":"The deployment of an unmanned aerial network (UAV-network) for the optimal coverage of ground nodes is an NP-hard problem. This work focuses on the application of a multi-layout multi-subpopulation genetic algorithm (MLMPGA) to solve multi-objective coverage problems of UAV-networks. The multi-objective deployment is based on a weighted fitness function that takes into account coverage, fault-tolerance, and redundancy as relevant factors to optimally place the UAVs. The proposed approach takes advantage of different subpopulations evolving with different layouts. This feature is aimed at reflecting the evolutionary concept of different species adapting to the search space conditions of the multi-objective coverage problem better than single-population genetic algorithms. The proposed multi-subpopulation genetic algorithm is evaluated and compared against single-population genetic algorithm configurations and other well-known meta-heuristic optimization algorithms, such as particle swarm optimization and hill climbing algorithm, under different numbers of ground nodes. The proposed MLMPGA achieves significantly better performance results than the other meta-heuristic algorithms, such as classical genetic algorithms, hill climbing algorithm, and particle swarm optimization, in the vast majority of our simulation scenarios.","authors":["Daniel Gutiérrez","Hissam Tawfik","S.L. Toral"],"meta":["October 2017Ad Hoc Networks 68","DOI:10.1016/j.adhoc.2017.09.005","Project: Evolutionary computation"],"references":["312254141_Help_from_the_Sky_Leveraging_UAVs_for_Disaster_Management","311158580_Placement_Optimization_of_UAV-Mounted_Mobile_Base_Stations","301205116_An_Evaluation_Methodology_for_Reliable_Simulation_Based_Studies_of_Routing_Protocols_in_VANETs","299427886_A_Survey_of_Multi-Objective_Optimization_in_Wireless_Sensor_Networks_Metrics_Algorithms_and_Open_Problems","294261061_A_Green_Strategic_Activity_Scheduling_for_UAV_Networks_A_Sub-Modular_Game_Perspective","290462901_Dynamic_Selection_of_Evolutionary_Algorithm_Operators_Based_on_Online_Learning_and_Fitness_Landscape_Metrics","301744896_Survey_on_Unmanned_Aerial_Vehicle_Networks_for_Civil_Applications_A_Communications_Viewpoint","299590295_Optimal_Relay_Placement_in_Multi-hop_Wireless_Networks","286595407_Node_Placement_in_WMNs_Using_WMN-GA_System_Considering_Uniform_and_Normal_Distribution_of_Mesh_Clients","285757700_Multi-UAV-Aided_Networks_Aerial-Ground_Cooperative_Vehicular_Networking_Architecture"]}