{"id":"320461932_SDL_Saliency-Based_Dictionary_Learning_Framework_for_Image_Similarity","abstract":"In image classification, obtaining adequate data to learn a robust classifier has often proven to be difficult in several scenarios. Classification of histological tissue images for health care analysis is a notable application in this context due to the necessity of surgery, biopsy or autopsy. To adequately exploit limited training data in classification, we propose a saliency guided dictionary learning method and subsequently an image similarity technique for histo-pathological image classification. Salient object detection from images aids in the identification of discriminative image features. We leverage the saliency values for the local image regions to learn a dictionary and respective sparse codes for an image, such that the more salient features are reconstructed with smaller error. The dictionary learned from an image gives a compact representation of the image itself and is capable of representing images with similar content, with comparable sparse codes. We employ this idea to design a similarity measure between a pair of images, where local image features of one image, are encoded with the dictionary learned from the other and vice versa. To effectively utilize the learned dictionary, we take into account the contribution of each dictionary atom in the sparse codes to generate a global image representation for image comparison. The efficacy of the proposed method was evaluated using three tissue datasets that consist of mammalian kidney, lung and spleen tissue, breast cancer and colon cancer tissue images. From the experiments, we observe that our methods outperform the state of the art with an increase of 14.2% in the average classification accuracy over all datasets.","authors":["Rituparna Sarkar","Scott T. Acton"],"meta":["October 2017IEEE Transactions on Image Processing PP(99):1-1","DOI:10.1109/TIP.2017.2763829"],"references":["303998214_Multi-class_texture_analysis_in_colorectal_cancer_histology","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","313510386_Classification_and_clustering_via_dictionary_learning_with_structured_incoherence_and_shared_features","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","307516159_Slide_Saliency_guided_image_dictionary_and_image_similarity_evaluation","305869551_SSPARED_Saliency_and_sparse_code_analysis_for_rare_event_detection_in_video","283471881_Image_classification_by_multi-kernel_dictionary_learning","283465956_A_meta-algorithm_for_classification_by_feature_nomination","282707871_Nearest_Neighbor_Pattern_Classification","281327886_Histograms_of_Oriented_Gradients_for_Human_Detection"]}