{"id":"320432816_Translanguaging_as_a_socially_just_pedagogy","abstract":"South African higher education relies primarily on English as the medium of education. This is a result of the colonial history of the country, yet it disadvantages a large section of South African students who undertake their education in a language that is not their first language. It also reproduces the monolingual norm and anglonormativity. This can be read as a social justice issue, since students are impacted negatively by discrimination through language. Indeed, recent protest movements, particularly Rhodes Must Fall, have highlighted language as a critical issue in the “decolonisation” of the university curriculum. This article presents translanguaging pedagogy as a way to address this issue; it analyses the implementation of translanguaging pedagogies in an introductory course at the University of Cape Town in 2015 and 2016. Through an analysis of lecturer reflections, classroom practice and assessments, it highlights how translanguaging pedagogies can empower students who are disempowered by English monolingualism and it demonstrates how students respond positively to these pedagogies. The article makes the argument that multilingual pedagogies are a necessary response to the current crisis in South African higher education.","authors":["Ellen Hurst-Harosh","Msakha Mona"],"meta":["January 2017Education as Change 21(2):126-148","DOI:10.17159/1947-9417/2017/2015"],"references":["316220074_Language_and_Power_in_Post-Colonial_Schooling_Ideologies_in_Practice","315698177_Linguistic_Human_Rights_a_Prerequisite_for_Bilingualism","283698904_Navigating_language_strategies_transitions_and_the_'colonial_wound'_in_South_African_education","277886444_Translanguaging_as_a_vehicle_for_epistemic_access_cases_for_reading_comprehension_and_multilingual_interactions","308389897_The_changing_racial_profile_of_academic_staff_at_South_African_Higher_Education_Institutions_HEIs_2005-2013","301954250_Existential_Education_and_the_Quest_for_a_new_Humanism","300462370_Examining_Ugandan_and_Malawian_Language_of_Instruction_Policies_From_a_Linguistic_Human_Rights_Perspective","292252158_Promoting_concept_literacy_through_multilingual_glossaries_A_translanguaging_approach","288542406_Education_Indigenous_Knowledges_and_Development_in_the_Global_South_Contesting_Knowledges_for_a_Sustainable_Future","287247603_Translingual_Practice_Global_Englishes_and_Cosmopolitan_Relations"]}