{"id":"320417940_Fingerprint_Pattern_Classification_Using_Convolution_Neural_Network","abstract":"Biometrics technology determines the correct identity of a person by extracting human biological or behavioral characteristic data. As the possibility of hacking increases with the development of IT technology, interest in biometrics and authentication technology is greatly increasing. Currently, the most popular authentication technology is fingerprint recognition. For the sake of efficiency, fingerprint recognition is divided into two stages. In the first step, the inputted fingerprint image is subjected to a complicated preprocessing stage, and the fingerprint image is then classified. In the second step, the feature points of the classified fingerprints are extracted and compared with the fingerprint feature points stored in a database. Human beings can easily classify fingerprint patterns without complicated image processing. In this paper, we propose the use of a convolution neural network model combined with an ensemble model and a batch normalization technique after minimizing the number of the quality improvement processes required for a fingerprint image, which operates more similarly to human perception.","authors":["Wang-Su Jeon","Sang-Yong Rhee"],"meta":["October 2017International Journal of Fuzzy Logic and Intelligent Systems 17(3):170-176","DOI:10.5391/IJFIS.2017.17.3.170"],"references":["319101467_An_Ensemble_Classification_Algorithm_Based_on_Information_Entropy_for_Data_Streams","320507893_On_the_use_of_convolutional_neural_networks_for_robust_classification_of_multiple_fingerprint_captures","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","304454034_Design_of_Fingerprints_Identification_Based_on_RBFNN_Using_Image_Processing_Techniques","290127641_A_Study_on_the_Dynamic_Binary_Fingerprint_Recognition_Method_using_Artificial_Intelligence","265852659_Fingerprint_Classification_Based_on_Depth_Neural_Network","265385906_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition"]}