{"id":"320473480_Mastering_the_game_of_Go_without_human_knowledge","abstract":"A long-standing goal of artificial intelligence is an algorithm that learns, tabula rasa, superhuman proficiency in challenging domains. Recently, AlphaGo became the first program to defeat a world champion in the game of Go. The tree search in AlphaGo evaluated positions and selected moves using deep neural networks. These neural networks were trained by supervised learning from human expert moves, and by reinforcement learning from self-play. Here we introduce an algorithm based solely on reinforcement learning, without human data, guidance or domain knowledge beyond game rules. AlphaGo becomes its own teacher: a neural network is trained to predict AlphaGo's own move selections and also the winner of AlphaGo's games. This neural network improves the strength of the tree search, resulting in higher quality move selection and stronger self-play in the next iteration. Starting tabula rasa, our new program AlphaGo Zero achieved superhuman performance, winning 100-0 against the previously published, champion-defeating AlphaGo. © 2017 Macmillan Publishers Limited, part of Springer Nature. All rights reserved.","authors":["David Silver","Julian Schrittwieser","Karen Simonyan","Ioannis Antonoglou"],"meta":["October 2017Nature 550(7676):354-359","DOI:10.1038/nature24270"],"references":["319856813_In-Datacenter_Performance_Analysis_of_a_Tensor_Processing_Unit","317613363_In-Datacenter_Performance_Analysis_of_a_Tensor_Processing_Unit","314648499_Residual_Networks_for_Computer_Go","314115623_Stabilising_Experience_Replay_for_Deep_Multi-Agent_Reinforcement_Learning","336699177_Reinforcement_Learning_and_Simulation_Based_Search_in_the_Game_of_Go","324355404_Dynamic_Programming_and_Markov_Processes","324295686_Dynamic_Programming_and_Markov_Processes","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313163124_Some_studies_in_machine_learning_using_the_game_of_checkers","312990324_Td-gammon_a_self-Teaching_backgammon_program_achieves_master-level_play"]}