{"id":"320491120_Training_Computational_Thinking_Game-Based_Unplugged_and_Plugged-in_Activities_in_Primary_School","abstract":"Computational thinking (CT) denotes the idea of developing a generic solution to a problem by decomposing it, identifying relevant variables and patterns, and deriving an algorithmic solution procedure. As a general problem solving strategy, it has been suggested a fundamental cognitive competence to be acquired in education-comparable to literacy and numeracy. However, integrating CT into general curricula has been challenging. Therefore, the current project aims at developing an extra-curricular training of CT for primary school students. From a literature review we identified seven concepts central to CT: i) sequencing, ii) loops, iii) parallelism, iv) events, v) conditionals, vi) operators, and vii) data/variables. In our targeted educational training program, we will specifically address these concepts (which are shared concepts between CT and programming / computer science education) in 2-step procedures using corresponding game-based unplugged and plugged-in activities. Playful unplugged activities, such as a treasure hunt board game for the concept of using variables as placeholders for information, shall allow students getting a first grip on CT processes by actively engaging them. In the game, a treasure is to be hunted by completing a series of arithmetic operations, in which players have to handle different variables (e.g., dice faces, scores, etc.). Building on this unplugged activity, a related plugged-in scenario is a programmable simulation of rain drops filling a glass. While raindrop and glass volume are constants, the fill level of the glass may be the variable to manipulate. In both kinds of activities we aim at clarifying the association between CT-based solving real-life problems and aspects of different STEM disciplines. The series of unplugged and plugged-in activities are integrated into a gamified approach suitable for primary school children, employing badges for mastering specific CT processes to increase students' engagement and for giving feedback about their learning progress. The instructional design will integrate principles of constructionism, game-based and project-based learning, such that students will construct knowledge through playing and interacting with interdisciplinary educational scenarios. The course will be empirically evaluated with 3rd and 4th graders in primary schools. Thereby, the idea of evidence-based instruction is pursued to ensure efficiency and validity of our training.","authors":["Katerina Tsarava","Korbinian Moeller","Niels Pinkwart","Martin Butz"],"meta":["October 2017","Conference: 11th European Conference on Game-Based Learning ECGBL 2017At: Graz, Austria","Project: Computational Thinking: Cognitive Correlates, Assessment & Curriculum Design"],"references":["321940359_TACCLE_3_O5_An_overview_of_the_most_relevant_literature_on_coding_and_computational_thinking_with_emphasis_on_the_relevant_issues_for_teachers","304344980_Toward_a_Unified_Sub-symbolic_Computational_Theory_of_Cognition","303668799_Computational_Thinking_for_All_Pedagogical_Approaches_to_Embedding_21st_Century_Problem_Solving_in_K-12_Classrooms","284139559_Computing_our_future_Computer_programming_and_coding_-_Priorities_school_curricula_and_initiatives_across_Europe","281714025_Dr_Scratch_Automatic_Analysis_of_Scratch_Projects_to_Assess_and_Foster_Computational_Thinking","272480816_Game_elements_improve_performance_in_a_working_memory_training_task","265889024_Influence_of_Game_Quests_on_Pupils'_Enjoyment_and_Goal-pursuing_in_Math_Learning","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","293328392_Foundations_of_Game-Based_Learning","264543793_Restart_The_Resurgence_of_Computer_Science_in_UK_Schools"]}