{"id":"320441910_A_successive_difference-of-convex_approximation_method_for_a_class_of_nonconvex_nonsmooth_optimization_problems","abstract":"We consider a class of nonconvex nonsmooth optimization problems whose objective is the sum of a nonnegative smooth function and a bunch of nonnegative proper closed possibly nonsmooth functions (whose proximal mappings are easy to compute), some of which are further composed with linear maps. This kind of problems arises naturally in various applications when different regularizers are introduced for inducing simultaneous structures in the solutions. Solving these problems, however, can be challenging because of the coupled nonsmooth functions: the corresponding proximal mapping can be hard to compute so that standard first-order methods such as the proximal gradient algorithm cannot be applied efficiently. In this paper, we propose a successive difference-of-convex approximation method for solving this kind of problems. In this algorithm, we approximate the nonsmooth functions by their Moreau envelopes in each iteration. Making use of the simple observation that Moreau envelopes of nonnegative proper closed functions are continuous difference-of-convex functions, we can then approximately minimize the approximation function by first-order methods with suitable majorization techniques. These first-order methods can be implemented efficiently thanks to the fact that the proximal mapping of each nonsmooth function is easy to compute. Under suitable assumptions, we prove that the sequence generated by our method is bounded and clusters at a stationary point of the objective. We also discuss how our method can be applied to concrete applications such as nonconvex fused regularized optimization problems and simultaneously structured matrix optimization problems, and illustrate the performance numerically for these two specific applications.","authors":["Tianxiang Liu","Ting Kei Pong","Akiko Takeda"],"meta":["October 2017Mathematical Programming 176(1-2)","DOI:10.1007/s10107-018-1327-8"],"references":["313096992_Efficient_DC_Algorithm_for_Constrained_Sparse_Optimization","281649518_Convex_Fused_Lasso_Denoising_with_Non-Convex_Regularization_and_its_use_for_Pulse_Detection","281101658_Penalty_Decomposition_Methods_for_Rank_Minimization","346368826_Convex_Analysis","318999668_Difference-of-Convex_Learning_Directional_Stationarity_Optimality_and_Sparsity","315573860_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Spaces","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","303351702_Differentiability_of_the_metric_projection_in_finite-dimensional_Euclidean_space","287001125_Better_approximation_and_faster_algorithm_using_the_proximal_average","284578956_Sparse_Recovery_via_Partial_Regularization_Models_Theory_and_Algorithms"]}