{"id":"320496225_Assembly_system_design_in_the_Industry_40_era_a_general_framework","abstract":"Assembly system design defines proper configurations and efficient management strategies to maximize the assembly system performances. Beyond assembly line balancing and scheduling, several other dimensions of this problem have to be considered. Furthermore, the assembly system design has to consider the industrial environment in which the system operates. The latest industrial revolution, namely Industry 4.0, leverages Internet connected and sensorized machines to manufacture customer-designed products. This paper proposes an original framework which investigates the impact of Industry 4.0 principles on assembly system design. The traditional dimensions of this problem are described along with the industrial environment evolution over the last three centuries. Concerning the latest industrial revolution, the technology innovations which enabled the manufacturing process digitalization are presented. The application of these enabling technologies to the assembly domain results in a new generation of assembly systems, the here defined assembly system 4.0. Finally, the distinctive characteristics of these novel systems are proposed and described in detail.","authors":["Marco Bortolini","Emilio Ferrari","Mauro Gamberi","Francesco Pilati"],"meta":["July 2017IFAC-PapersOnLine 50(1):5700-5705","DOI:10.1016/j.ifacol.2017.08.1121"],"references":["269709304_A_Cyber-Physical_Systems_architecture_for_Industry_40-based_manufacturing_systems","257337095_Additive_manufacturing_and_its_societal_impact_A_literature_review","318774897_Design_of_flexible_assembly_line_to_minimize_equipment_cost","306069049_Including_Material_Exposure_and_Part_Attributes_in_the_Manual_Assembly_Line_Balancing_Problem","287611575_The_Global_Manufacturing_Revolution_Product-Process-Business_Integration_and_Reconfigurable_Systems","285473642_Extracting_value_from_chaos","275281668_Packaging_strategy_definition_for_sales_kits_within_an_assembly_system","267125464_Machine_Learning_The_Art_and_Science_of_Algorithms_That_Make_Sense_of_Data","264522406_Offshoring_and_Reshoring_An_Update_on_the_Manufacturing_Location_Decision","264335460_Offshoring_Reshoring_and_the_Manufacturing_Location_Decision"]}