{"id":"320458620_Dynamic_Mental_Model_Construction_A_Knowledge-in-Pieces-Based_Explanation_for_Computing_Students'_Erratic_Performance_on_Recursion","abstract":"The Knowledge in Pieces (KiP) framework offers a powerful perspective to understand the dynamic nature of knowledge and knowledge development. However, there is still much we do not know about the mechanisms underlying the moment-to-moment knowledge construction process. The purpose of this study was to explore the ways in which contextual knowledge elements support that process. According to KiP, a knowledge element, once activated, becomes part of the context that shapes the activation, configuration, and operation of other elements. Based on this assumption, we hypothesized that when the structural and operational characteristics of these contextual knowledge elements are compatible with those of the target concept, the contextual knowledge elements can support the knowledge construction process. This hypothesis was investigated in the domain of recursion, a fundamental but challenging programming concept. Sixty undergraduate computer science students completed four recursion evaluation tasks with varying likelihood to induce compatible contextual elements. Results showed that students performed better on high-compatibility tasks than on low-compatibility tasks at both the group level and individual level. Further qualitative analysis identified the knowledge elements involved and elaborated and refined the explanatory model for the contextual support effect.","authors":["Jie Chao","David Frank Feldon","James P. Cohoon"],"meta":["October 2017Journal of the Learning Sciences 27(2)","DOI:10.1080/10508406.2017.1392309","Project: Big Data: Large Scale Research on Engineering Design Based on Big Learner Data by a CAD Tool"],"references":["313599207_Phenomenological_primitives_in_introductory_computer_science_students'_understanding_of_recursion","317953655_Designing_and_conducting_mixed_methods_research","316823197_The_relation_between_assessment_practices_and_outcomes_of_studies_the_case_of_research_on_prior_knowledge","314721145_Mental_models_of_recursion","300672247_Drawing_with_Recursion","291596997_Most_difficult_topics_in_CS1","281085528_Can_Advance_Organizers_Influence_Meaningful_Learning","275933714_Scripts_Plans_Goals_and_Understanding_An_Inquiry_into_Human_Knowledge_Structures","272157782_Mental_Models_of_Recursion","270819070_Introduction_to_Meaurement_Theory"]}