{"id":"320430770_SISTEMA_DE_PROCEDIMIENTOS_DIDACTICOS_PARA_LA_FORMACION_INVESTIGATIVA_EN_CIENCIA_DE_LA_COMPUTACION","abstract":"The investigation starts from the scientific problem: insufficient understanding of the problematic situations, which are manifested in the limited analysis and designs of the investigations, not favoring the future professional performance of the students of Bachelor in Computer Science; being considered as research object, the process of research training in the degree course in Computer Science, and as a field of action, the dynamics of this process. The objective was to develop a system of didactic procedures, based on a model of the dynamics of the process of research training in the degree course in Computer Science, which will favor the future performance of the professionals of the mentioned race. The main contributions were the aforementioned model and the system of didactic procedures. The relevance and scientific feasibility of the results were satisfactorily evaluated through two socialization workshops with specialists from the Universidad de Oriente and the Central University of Las Villas, the partial application of the didactic procedures system in the third year of the course and the exemplification of said system in the subject Software Engineering. The scientific novelty consisted in having based a didactic logic for the formative dynamics of the investigation in Computer Science, which is constituted in a necessary condition for the development of a computational research thinking, when establishing the relevance of the investigative methods, in its passing through the systems: user, intermediary and computational information, as well as explaining the transit through the interpretive, translational and evaluative levels of digital hermeneutics.","authors":["Miriam Ekaterine","Ramírez Fergusson"],"meta":["December 2016","Thesis for: Licenciatura en Ciencia de la ComputaciónAdvisor: DraC. Isabel Alonso Berenguer × Dr.C. Alexander Gorina Sánchez×","Project: Formación investigativa en carreras de las ciencias computacionales"],"references":[]}