{"id":"320492086_Grounding_of_HTN_Planning_Domain","abstract":"Many Artificial Intelligence techniques have been developed for intelligent and autonomous systems to act and make rational decisions based on perceptions of the world state. Among these techniques, HTN (Hierarchical Task Network) planning is one of the most used in practice. HTN planning is based on expressive languages allowing to specify complex expert knowledge for real world domains. At the same time, many preprocessing techniques for classical planning were proposed to speed up the search. One of these technique, named grounding, consists in enumerating and instantiating all the possible actions from the planning problem descriptions. This technique has proven its effectiveness. Therefore, combining the expressiveness of HTN planning with the efficiency of the grounding preprocessing techniques used in classical planning is a very challenging issue. In this paper, we propose a generic algorithm to ground the domain representation for HTN planning. We show experimentally that grounding process improves the performances of state of the art HTN planners on a range of planning problems from the International Planning Competition (IPC).","authors":["Abdeldjalil Ramoul","Damien Pellier","Humbert Fiorino","Sylvie Pesty"],"meta":["October 2017International Journal of Artificial Intelligence Tools 26(05):1760021","DOI:10.1142/S0218213017600211","Project: HTN Planning"],"references":["310460443_HTN_Planning_Approach_Using_Fully_Instantiated_Problems","282439405_Mixed-Initiative_Planning_and_Execution_for_Multiple_Drones_in_Search_and_Rescue_Missions","267079760_Merge-and-Shrink_Abstraction_A_Method_for_Generating_Lower_Bounds_in_Factored_State_Spaces","227312702_Combining_rough_decisions_for_intelligent_text_mining_using_Dempster's_rule","226427912_Constraint_satisfaction_techniques_in_planning_and_scheduling","272360451_HTN_planning_Overview_comparison_and_beyond","262152871_The_GoDeL_planning_system_A_more_perfect_union_of_domain-independent_and_hierarchical_planning","259230090_Automating_the_evaluation_of_planning_systems","256660334_Planning_as_satisfiability_Heuristics","238756296_Project_Planning_Using_a_Hierarchic_Non-Linear_Planner"]}