{"id":"320487648_Capacity_acquisition_for_the_single-item_lot_sizing_problem_under_energy_constraints","abstract":"We study a single-item lot sizing problem integrated with some energy constraints, called energy-LSP in the rest of the paper. We consider a production system composed of identical and capacitated machines in parallel. One has to decide how many machines to start and how much to produce to serve the demand and/or to replenish the inventory. In addition to the production capacity limit in each period, induced by the machines on, we have a limit on the energy that can be consumed by the start-ups of the machines and the production of units. We first provide a mixed integer programming formulation for the problem in the general case. We then develop efficient polynomial time algorithms running in O(Tlog T), with T the length of the planning horizon, for several subproblems: (i) energy-LSP where all energy parameters are set to 0, (ii) energy-LSP where only the machine start-ups consume energy, (iii) energy-LSP where only the production of units consumes energy. We show that, in all these special cases, energy-LSP can be seen as an extension of the integrated capacity acquisition and lot sizing problem. This allows us, as by-product of our approach, to significantly improve the existing result proposed for the capacity acquisition problem without energy constraint nor subcontracting.","authors":["Christophe Rapine","Bernard Penz","Céline Gicquel","Ayse Akbalik"],"meta":["October 2017Omega 81","DOI:10.1016/j.omega.2017.10.004"],"references":["305036101_Lot-sizing_in_a_multi-stage_flow_line_production_system_with_energy_consideration","282628154_Energy-efficient_scheduling_in_manufacturing_companies_A_review_and_research_framework","277938725_An_Approach_for_Energy-oriented_Production_Control_Using_Energy_Flexibility","270575016_Energy_Efficient_Manufacturing_from_Machine_Tools_to_Manufacturing_Systems","307555596_Systematic_literature_review_of_decision_support_models_for_energy-efficient_production_planning","305825471_A_survey_of_industrial_applications_of_Demand_Response","289684679_Production_Planning_Optimization_of_an_Ethylene_Plant_Considering_Process_Operation_and_Energy_Utilization","273838252_Including_energy_in_supply_chain_planning_at_a_pulp_company","266048119_Production_Planning_by_Mixed_Integer_Programming","265373478_The_Deterministic_Dynamic_Product_Cycling_Problem"]}