{"id":"320429339_Epistemic_gameplay_and_discovery_in_computational_model-based_inquiry_activities","abstract":"In computational modeling activities, learners are expected to discover the inner workings of scientific and mathematical systems: First elaborating their understandings of a given system through constructing a computer model, then “debugging” that knowledge by testing and refining the model. While such activities have been shown to support science learning, difficulties building and using computational models are common and reduce learning benefits. Drawing from Collins and Ferguson (Educ Psychol 28(1):25–42, 1993), we conjecture that a major cause for such difficulties is a misalignment between the epistemic games (modeling strategies) learners play, and the epistemic forms (model types) a given modeling environment is designed to support. To investigate, we analyzed data from a study in which ten groups of U. S. fifth graders (n = 28) worked to create stop motion animations and agent-based computational models (ABMs) to discover the particulate nature of matter. Content analyses revealed that (1) groups that made progress—that is, that developed increasingly mechanistic, explanatory models—focused on elements, movement, and interactions when developing their models, a strategy well-aligned with both animation and ABM; (2) groups that did not make progress focused on sequences of phases, a strategy well-aligned with animation but not with ABM; and (3) struggling groups progressed when they received guidance about modeling strategies, but not when they received guidance about model content. We present summary analyses and three vignettes to illustrate these findings, and share implications for research and curricular design.","authors":["Michelle Hoda Wilkerson","Rebecca Shareff","Vasiliki Laina","Brian Gravel"],"meta":["February 2018Instructional Science 46(1)","DOI:10.1007/s11251-017-9430-4","Project: SiMSAM (Simulation, Measurement, and Stop Action Moviemaking)"],"references":["303463820_Identifying_middle_school_students'_challenges_in_computational_thinking-based_science_learning","301666783_Development_of_Mechanistic_Reasoning_and_Multilevel_Explanations_of_Ecology_in_Third_Grade_Using_Agent-Based_Models_MECHANISTIC_REASONING_and_AGENT-BASED_MODELS","275024323_Balancing_curricular_and_pedagogical_needs_in_computational_construction_kits_Lessons_from_the_DeltaTick_Project","269420538_A_Framework_for_Model-Based_Inquiry_Through_Agent-Based_Programming","263351729_SiMSAM_An_integrated_toolkit_to_bridge_student_scientific_and_mathematical_ideas_using_computational_media","263351604_Exploring_Shifts_in_Middle_School_Learners'_Modeling_Activity_While_Generating_Drawings_Animations_and_Computational_Simulations_of_Molecular_Diffusion","277519209_Understanding_Complex_Systems_Some_Core_Challenges","272177757_The_Next_Generation_Science_Standards_For_States_By_States","268441182_Developing_New_Notations_for_a_Learnable_Mathematics_in_the_Computational_Era","263499977_Model_construction_as_a_learning_activity_A_design_space_and_review"]}