{"id":"320453789_A_generalized_simulation_development_approach_for_predicting_refugee_destinations","abstract":"In recent years, global forced displacement has reached record levels, with 22.5 million refugees worldwide. Forecasting refugee movements is important, as accurate predictions can help save refugee lives by allowing governments and NGOs to conduct a better informed allocation of humanitarian resources. Here, we propose a generalized simulation development approach to predict the destinations of refugee movements in conflict regions. In this approach, we synthesize data from UNHCR, ACLED and Bing Maps to construct agent-based simulations of refugee movements. We apply our approach to develop, run and validate refugee movement simulations set in three major African conflicts, estimating the distribution of incoming refugees across destination camps, given the expected total number of refugees in the conflict. Our simulations consistently predict more than 75% of the refugee destinations correctly after the first 12 days, and consistently outperform alternative naive forecasting techniques. Using our approach, we are also able to reproduce key trends in refugee arrival rates found in the UNHCR data.","authors":["Diana Suleimenova","David Bell","Derek Groen"],"meta":["October 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-13828-9"],"references":["349106032_Evaluation_of_existing_migration_forecasting_methods_and_models_Report_for_the_Migration_Advisory_Committee","317485902_A_Serious_Video_Game_To_Support_Decision_Making_On_Refugee_Aid_Deployment_Policy","302923196_Everything_you_need_to_know_about_agent-based_modelling_and_simulation","294731916_Decision-Making_in_Agent-Based_Models_of_Migration_State_of_the_Art_and_Challenges","291553871_Climate_Shocks_and_Migration_An_Agent-Based_Modeling_Approach","327914768_Modeling_Social_Pressures_Toward_Political_Instability","312572549_An_agent-based_approach_to_human_migration_movement","312571291_Agent-based_modeling_and_strategic_group_formation_A_refugee_case_study","303746241_Simulating_Refugee_Movements_Where_Would_You_Go","287708685_A_methodology_for_environment_and_agent_development_to_model_population_displacement"]}