{"id":"320408587_Parallel_ant_colony_optimization_on_multi-core_SIMD_CPUs","abstract":"Ant colony optimization (ACO) is a population-based metaheuristic for solving hard combinatorial optimization problems. Many studies are dedicated to accelerating ACO by parallel hardware, especially by graphics processing units (GPUs). However, due to the irregular (random) pattern of ACO algorithms in data access and control flow, the performance of GPU-based approaches is constrained by hardware limitations. CPU-based SIMD computing for ACOs is rarely investigated in previous literatures, and how well multicore-SIMD CPU-based parallel ACOs could perform remains unknown. In this paper, we present and evaluate a model of vector parallel ACO for multi-core SIMD CPU architecture. In the proposed model, each ant is mapped with a CPU core and the tour construction of each ant is accelerated by vector instructions. Furthermore, based on the model, we propose a new fitness proportionate selection approach named Vector-based Roulette Wheel (VRW) in the tour construction stage. In this approach, the fitness values are grouped into SIMD lanes and the prefix sum is computed in vector-parallel mode. The proposed algorithm is tested on standard TSP instances ranging from 198 to 4461 cities and shows a speedup factor of 57.8x compared to the single-threaded CPU counterpart. More significantly, we compare our approach with high performance GPU-based ACOs, and the results demonstrate the strong potential of CPU-based parallel ACOs.","authors":["Yi Zhou","Fazhi He","Neng Hou","Yimin Qiu"],"meta":["October 2017Future Generation Computer Systems 79","DOI:10.1016/j.future.2017.09.073"],"references":["318252923_An_efficient_approach_to_directly_compute_the_exact_Hausdorff_distance_for_3D_point_sets","316449270_Collaborative_CAD_Synchronization_Based_on_a_Symmetric_and_Consistent_Modeling_Procedure","345687044_A_parallel_and_robust_object_tracking_approach_synthesizing_adaptive_Bayesian_learning_and_improved_incremental_subspace_learning","322794868_Robust_Visual_Tracking_Based_on_Convolutional_Features_with_Illumination_and_Occlusion_Handing","319561650_A_correlative_classifiers_approach_based_on_particle_filter_and_sample_set_for_tracking_occluded_target","316548177_LSSTCS_An_Efficient_Particle_Swarm_Optimization_for_Large-Scale_HardwareSoftware_Co-Design_System","314511139_A_Novel_HardwareSoftware_Partitioning_Method_Based_on_Position_Disturbed_Particle_Swarm_Optimization_with_Invasive_Weed_Optimization","314167739_Dynamic_strategy_based_parallel_ant_colony_optimization_on_GPUs_for_TSPs","313407655_A_local_start_search_algorithm_to_compute_exact_Hausdorff_Distance_for_arbitrary_point_sets","310818280_A_string-wise_CRDT_algorithm_for_smart_and_large-scale_collaborative_editing_systems"]}