{"id":"320442325_Popularity_of_arXivorg_within_Computer_Science","abstract":"It may seem surprising that, out of all areas of science, computer scientists have been slow to post electronic versions of papers on sites like arXiv.org. Instead, computer scientists have tended to place papers on our individual home pages, but this loses the benefits of aggregation, namely notification and browsing. But this is changing. More and more computer scientists are now using the arXiv. At the same time, there is ongoing discussion and controversy about how prepublication affects peer review, especially for double-blind conferences. This discussion is often carried out with precious little evidence of how popular prepublication is. We measure what percentage of papers in computer science are placed on the arXiv, by cross-referencing published papers in DBLP with e-prints on arXiv. We found: * Usage of arXiv.org has risen dramatically among the most selective conferences in computer science. In 2017, fully 23% of papers had e-prints on arXiv, compared to only 1% ten years ago. * Areas of computer science vary widely in e-print prevalence. In theoretical computer science and machine learning, over 60% of published papers are on arXiv, while other areas are essentially zero. In most areas, arXiv usage is rising. * Many researchers use arXiv for posting preprints. Of the 2017 published papers with arXiv e-prints, 56% were preprints that were posted before or during peer review. Our paper describes these results as well as policy implications for researchers and practitioners.","authors":["Charles Sutton","Linan Gong"],"meta":["October 2017"],"references":["280784422_Open_Scholarship_and_Peer_Review_a_Time_for_Experimentation","237842963_arXiv_E-Prints_and_the_Journal_of_Record_An_Analysis_of_Roles_and_Relationships","319525039_Effectiveness_of_Anonymization_in_Double-Blind_Review","267989407_A_New_Computer_Science_Publishing_Model","221653893_Efficient_clustering_of_high-dimensional_data_sets_with_application_to_reference_matching","51936449_It_was_twenty_years_ago_today","37608945_The_Internet_and_Unrefereed_Scholarly_Publishing","2431092_Automating_the_Construction_of_Internet_Portals_with_Machine_Learning","1847863_CoRR_A_Computing_Research_Repository"]}