{"id":"320493357_Scalable_Conformance_Checking_of_Business_Processes","abstract":"Given a process model representing the expected behavior of a business process and an event log recording its actual execution, the problem of business process conformance checking is that of detecting and describing the differences between the process model and the log. A desirable feature is to produce a minimal yet complete set of behavioral differences. Existing conformance checking techniques that achieve these properties do not scale up to real-life process models and logs. This paper presents an approach that addresses this shortcoming by exploiting automata-based techniques. A log is converted into a deterministic automaton in a lossless manner, the input process model is converted into another minimal automaton, and a minimal error-correcting synchronized product of both automata is calculated using an A* heuristic. The resulting automaton is used to extract alignments between traces of the model and traces of the log, or statements describing behavior observed in the log but not captured in the model. An evaluation on synthetic and real-life models and logs shows that the proposed approach outperforms a state-of-the-art method for complete conformance checking.","authors":["Daniel Reißner","Raffaele Conforti","Marlon Dumas","Marcello La Rosa"],"meta":["October 2017","DOI:10.1007/978-3-319-69462-7_38","Conference: OTM Confederated International Conferences \"On the Move to Meaningful Internet Systems\""],"references":["320499090_Interactive_and_Incremental_Business_Process_Model_Repair","318134440_Aligning_Modeled_and_Observed_Behavior_A_Compromise_Between_Computation_Complexity_and_Quality","317568126_Aligning_Modeled_and_Observed_Behavior_A_Compromise_Between_Complexity_and_Quality","313682640_Complete_and_Interpretable_Conformance_Checking_of_Business_Processes","312694996_Automated_Discovery_of_Structured_Process_Models_Discover_Structured_vs_Discover_and_Structure","309081021_Filtering_out_Infrequent_Behavior_from_Process_Event_Logs","308602640_Impact-Driven_Process_Model_Repair","308266226_Efficient_Alignment_Between_Event_Logs_and_Process_Models","305038898_Scalable_process_discovery_and_conformance_checking","312596001_Memory-Efficient_Alignment_of_Observed_and_Modeled_Behavior"]}