{"id":"320445800_Moving_Beyond_Syntax_Lessons_from_20_Years_of_Blocks_Programing_in_AgentSheets","abstract":"The blocks programming community has been preoccupied with identifying syntactic obstacles that keep novices from learning to program. Unfortunately, this focus is now holding back research from systematically investigating various technological affordances that can make programming more accessible. Employing approaches from program analysis, program visualization, and real-time interfaces can push blocks programming beyond syntax towards the support of semantics and even pragmatics. Syntactic support could be compared to checking spelling and grammar in word processing. Spell checking is relatively simple to implement and immediately useful, but provides essentially no support to create meaningful text. Over the last 25 years, I have worked to empower students to create their own games, simulations, and robots. In this time I have explored, combined, and evaluated a number of programming paradigms. Every paradigm including data flow, programming by example, and programming through analogies brings its own set of affordances and obstacles. Twenty years ago, AgentSheets combined four key affordances of blocks programming, and since then has evolved into a highly accessible Computational Thinking Tool. This article describes the journey to overcome first syntactic, then semantic, and most recently pragmatic, obstacles in computer science education.","authors":["Alexander Repenning"],"meta":["July 2017","DOI:10.18293/VLSS2017-010"],"references":["317644528_Assessment_Design_Patterns_for_Computational_Thinking_Practices_in_Secondary_Computer_Science_A_First_Look","316940359_Drops_and_Kinks_Modeling_the_Retention_of_Flow_for_Hour_of_Code_Style_Tutorials","314291049_Employing_Retention_of_Flow_to_Improve_Online_Tutorials","311489150_Retention_of_Flow_Evaluating_a_Computer_Science_Education_Week_Activity","309916650_Computational_thinking_tools","304825202_Piloting_Computer_Science_Education_Week_in_Mexico","319395347_Can_principles_of_cognition_lower_the_barriers_to_programming","308602299_Blocks_at_your_fingertips_Blurring_the_line_between_blocks_and_text_in_GP","301463451_A_Pilot_Computer_Science_and_Programming_Course_for_Primary_School_Students","289637867_Launching_Swiss_Computer_Science_Education_Week"]}