{"id":"320486667_Maximum_Value_Matters_Finding_Hot_Topics_in_Scholarly_Fields","abstract":"Finding hot topics in scholarly fields can help researchers to keep up with the latest concepts, trends, and inventions in their field of interest. Due to the rarity of complete large-scale scholarly data, earlier studies target this problem based on manual topic extraction from a limited number of domains, with their focus solely on a single feature such as coauthorship, citation relations, and etc. Given the compromised effectiveness of such predictions, in this paper we use a real scholarly dataset from Microsoft Academic Graph, which provides more than 12000 topics in the field of Computer Science (CS), including 1200 venues, 14.4 million authors, 30 million papers and their citation relations over the period of 1950 till now. Aiming to find the topics that will trend in CS area, we innovatively formalize a hot topic prediction problem where, with joint consideration of both inter- and intra-topical influence, 17 different scientific features are extracted for comprehensive description of topic status. By leveraging all those 17 features, we observe good accuracy of topic scale forecasting after 5 and 10 years with R2 values of 0.9893 and 0.9646, respectively. Interestingly, our prediction suggests that the maximum value matters in finding hot topics in scholarly fields, primarily from three aspects: (1) the maximum value of each factor, such as authors' maximum h-index and largest citation number, provides three times the amount of information than the average value in prediction; (2) the mutual influence between the most correlated topics serve as the most telling factor in long-term topic trend prediction, interpreting that those currently exhibiting the maximum growth rates will drive the correlated topics to be hot in the future; (3) we predict in the next 5 years the top 100 fastest growing (maximum growth rate) topics that will potentially get the major attention in CS area.","authors":["Jinghao Zhao","Hao Wu","Fengyu Deng","Wentian Bao"],"meta":["October 2017"],"references":["301313915_Topic_discovery_and_future_trend_forecasting_for_texts","260439659_Predicting_Scientific_Success_Based_on_Coauthorship_Networks","259578232_Modeling_and_Predicting_Popularity_Dynamics_via_Reinforced_Poisson_Processes","311317375_Social-Relational_Topic_Model_for_Social_Networks","303688129_A_methodology_for_identifying_attributes_of_academic_excellence_based_on_a_2080_Pareto_distribution","293014743_Can_Scientific_Impact_Be_Predicted","290275167_Discovering_dedicators_with_topic-based_semantic_social_networks","280687718_Greedy_Function_Approximation_A_Gradient_Boosting_Machine","265604722_Topic_formation_and_development_a_core-group_evolving_process","262171521_Towards_Topic_Trend_Prediction_on_a_Topic_Evolution_Model_with_Social_Connection"]}