{"id":"320486483_Unsupervised_Sentence_Representations_as_Word_Information_Series_Revisiting_TF--IDF","abstract":"Sentence representation at the semantic level is a challenging task for Natural Language Processing and Artificial Intelligence. Despite the advances in word embeddings (i.e. word vector representations), capturing sentence meaning is an open question due to complexities of semantic interactions among words. In this paper, we present an embedding method, which is aimed at learning unsupervised sentence representations from unlabeled text. We propose an unsupervised method that models a sentence as a weighted series of word embeddings. The weights of the word embeddings are fitted by using Shannon's word entropies provided by the Term Frequency--Inverse Document Frequency (TF--IDF) transform. The hyperparameters of the model can be selected according to the properties of data (e.g. sentence length and textual gender). Hyperparameter selection involves word embedding methods and dimensionalities, as well as weighting schemata. Our method offers advantages over existing methods: identifiable modules, short-term training, online inference of (unseen) sentence representations, as well as independence from domain, external knowledge and language resources. Results showed that our model outperformed the state of the art in well-known Semantic Textual Similarity (STS) benchmarks. Moreover, our model reached state-of-the-art performance when compared to supervised and knowledge-based STS systems.","authors":["Ignacio Arroyo-Fernández","Carlos-Francisco Méndez-Cruz","Gerardo Sierra","Juan-Manuel Torres-Moreno"],"meta":["October 2017Computer Speech & Language 56","DOI:10.1016/j.csl.2019.01.005","Project: Generalized methodology for distributional models acquisition in Natural Language Processing tasks"],"references":["341434195_Syntactic_Indexes_for_Text_Retrieval","322795602_LIPN-IIMAS_at_SemEval-2017_Task_1_Subword_Embeddings_Attention_Recurrent_Neural_Networks_and_Cross_Word_Alignment_for_Semantic_Textual_Similarity","318084717_SemEval-2017_Task_1_Semantic_Textual_Similarity_-_Multilingual_and_Cross-lingual_Focused_Evaluation","315796338_CompiLIG_at_SemEval-2017_Task_1_Cross-Language_Plagiarism_Detection_Methods_for_Semantic_Textual_Similarity","314283206_Unsupervised_Learning_of_Sentence_Embeddings_using_Compositional_n-Gram_Features","313621629_Back_to_Basics_for_Monolingual_Alignment_Exploiting_Word_Similarity_and_Contextual_Evidence","311990865_Charagram_Embedding_Words_and_Sentences_via_Character_n-grams","318654791_Learning_Distributed_Sentence_Representations_for_Story_Segmentation","317646318_Statistical_Language_Learning","314649674_A_hybrid_ensemble_pruning_approach_based_on_consensus_clustering_and_multi-objective_evolutionary_algorithm_for_sentiment_classification"]}