{"id":"320546761_A_proposal_for_teaching_ScratchJr_programming_environment_in_preservice_kindergarten_teachers","abstract":"This paper reports the design and evaluation of semester-scale teaching intervention addressing the teaching of Scratch programming environment followed by pre-service kindergarten students. The overall aim of this course was to assist students in utilizing computational thinking and programming as an instructional tool within other subject areas (i.e. mathematics and physics). The methodology used is the research based design, which is interventional and recursive in nature. The observations of the researchers, the recordings of students' actions, as well as their projects, were used to draw conclusions, to identify strengths or weaknesses of the teaching intervention implemented and to assess its efficacy regarding a computer course structure using the educational environment ScratchJr. We argue that the teaching of ScratchJr can assist teachers in utilizing Computational Thinking and programming as an instructional tool within other subject areas (i.e. mathematics and physics).","authors":["Michail Kalogiannakis","Stamatios J Papadakis"],"meta":["August 2017","Conference: 12th Conference of the European Science Education Research Association (ESERA), «Research, practice and collaboration in science education»At: Dublin, Ireland","Project: Teaching programming in novices"],"references":["310741044_ICT_Teachers'_Acceptance_of_Scratch_as_Algorithm_Visualization_Software","305390965_Developing_fundamental_programming_concepts_and_computational_thinking_with_ScratchJr_in_preschool_education_A_case_study","282538886_Constructing_the_ScratchJr_programming_language_in_the_early_childhood_classroom","244457271_Design_Experiments_in_Educational_Research","308846015_Starting_from_scratch_Developing_a_pre-service_teacher_training_program_in_computational_thinking","262253499_Designing_ScratchJr_support_for_early_childhood_learning_through_computer_programming","235362971_The_Basics_of_Qualitative_Research"]}