{"id":"320515341_Risk_Factors_for_Social_Networking_Site_Scam_Victimization_Among_Malaysian_Students","abstract":"Social networking sites (SNSs) can provide cybercriminals with various opportunities, including gathering of user data and login credentials to enable fraud, and directing of users toward online locations that may install malware onto their devices. The techniques employed by such cybercriminals can include clickbait (text or video), advertisement of nonexistent but potentially desirable products, and hoax competitions/giveaways. This study aimed to identify risk factors associated with falling victim to these malicious techniques. An online survey was completed by 295 Malaysian undergraduate students, finding that more than one-third had fallen victim to SNS scams. Logistic regression analysis identified several victimization risk factors including having higher scores in impulsivity (specifically cognitive complexity), using fewer devices for SNSs, and having been on an SNS for a longer duration. No reliable model was found for vulnerability to hoax valuable gift giveaways and \"friend view application\" advertising specifically, but vulnerability to video clickbait was predicted by lower extraversion scores, higher levels of openness to experience, using fewer devices, and being on an SNS for a longer duration. Other personality traits were not associated with either overall victimization susceptibility or increased risk of falling victim to the specific techniques. However, age approached significance within both the video clickbait and overall victimization models. These findings suggest that routine activity theory may be particularly beneficial in understanding and preventing SNSs scam victimization.","authors":["Grainne Kirwan","Chris Fullwood","Brendan Rooney"],"meta":["October 2017Cyberpsychology, Behavior, and Social Networking 21(2)","DOI:10.1089/cyber.2016.0714"],"references":["283706812_Psychological_and_Functional_Vulnerability_Predicts_Fraud_Cases_in_Older_Adults_Results_of_a_Longitudinal_Study","263609148_The_online_dating_romance_scam_causes_and_consequences_of_victimhood","282526294_Mass-Marketing_Fraud_A_Growing_Concern","273899154_No_laughing_matter"]}