{"id":"320564486_Using_Machine_Learning_to_Replicate_Chaotic_Attractors_and_Calculate_Lyapunov_Exponents_from_Data","abstract":"We use recent advances in the machine learning area known as 'reservoir computing' to formulate a method for model-free estimation from data of the Lyapunov exponents of a chaotic process. The technique uses a limited time series of measurements as input to a high-dimensional dynamical system called a 'reservoir'. After the reservoir's response to the data is recorded, linear regression is used to learn a large set of parameters, called the 'output weights'. The learned output weights are then used to form a modified autonomous reservoir designed to be capable of producing arbitrarily long time series whose ergodic properties approximate those of the input signal. When successful, we say that the autonomous reservoir reproduces the attractor's 'climate'. Since the reservoir equations and output weights are known, we can compute derivatives needed to determine the Lyapunov exponents of the autonomous reservoir, which we then use as estimates of the Lyapunov exponents for the original input generating system. We illustrate the effectiveness of our technique with two examples, the Lorenz system, and the Kuramoto-Sivashinsky (KS) equation. In particular, we use the Lorenz system to show that achieving climate reproduction may require tuning of the reservoir parameters. For the case of the KS equation, we note that as the system's spatial size is increased, the number of Lyapunov exponents increases, thus yielding a challenging test of our method, which we find the method successfully passes.","authors":["Jaideep Pathak","Zhixin Lu","Brian Ramon Hunt","Michelle Girvan"],"meta":["October 2017Chaos (Woodbury, N.Y.) 27(12)","DOI:10.1063/1.5010300","Project: Attractor Reconstruction by Machine Learning through Generalized Synchronization"],"references":["292074166_Mastering_the_game_of_Go_with_deep_neural_networks_and_tree_search","231139201_Dynamic_localization_of_Lyapunov_vectors_in_spacetime_chaos","315793836_Reservoir_observers_Model-free_inference_of_unmeasured_variables_in_chaotic_systems","267480780_Linear_Regression_Analysis_Theory_and_Computing","260637318_Deep_Neural_Networks_for_Acoustic_Modeling_in_Speech_Recognition_The_Shared_Views_of_Four_Research_Groups","258310796_The_problem_of_spurious_Lyapunov_exponents_in_time_series_analysis_and_its_solution_by_covariant_Lyapunov_vectors","255928276_Spurious_Lyapunov_Exponents_in_Attractor_Reconstruction","245896484_Detecting_Strange_Attractors_in_Turbulence","235982903_Persistent_Propagation_of_Concentration_Waves_in_Dissipative_Media_Far_from_Thermal_Equilibrium","232775845_Relation_between_fractal_dimension_and_spatial_correlation_length_for_extensive_chaos"]}