{"id":"320507815_Investigating_high-achieving_students'_code-writing_abilities_through_the_SOLO_taxonomy","abstract":"Computer Science Educationalists have implemented educational taxonomies which enhance the pedagogy for introductory programming modules. The SOLO taxonomy has been applied to measure students’ cognitive abilities in programming by classifying students’ exam answers. However, SOLO provides a generic framework that can be applied in different disciplines, including Computer Science, and this can lead to ambiguity and inconsistent classification. In this paper, we investigate high-achieving students’ coding abilities and whether they tend to manifest specific SOLO categories. We address the challenges of interpreting SOLO and the limitations of code-writing problems by analysing three specific programming problems (Array Creation, Linear Search and Recursion) and solutions to those problems presented by a group of nine students. Results for the first programming problem show that six students’ responses fell into the highest possible category (Multistructural) and the remaining three were categorised in the second highest category (Unistructural). For the second problem, eight students’ responses fell into the Multistructural category, while only one response was categorised as Unistructural. For the third problem, two students provided Multistructural solutions and five students’ solutions were Unistructural, but two further students showed a lack of understanding program constructs in their solutions, which were then categorised as Prestructural.","authors":["Ayman Qahmash","Mike Joy","Adam Boddison"],"meta":["July 2017","Conference: Psychology of Programming Interest GroupAt: Delft"],"references":["235920619_Using_SOLO_taxonomy_to_explore_students'_mental_models_of_the_programming_variable_and_the_assignment_statement","313099966_The_Power_of_the_Solo_Model_to_Address_Fundamental_Measurement_Issues","303427123_Assessing_Problem-Based_Learning_in_a_Software_Engineering_Curriculum_Using_Bloom's_Taxonomy_and_the_IEEE_Software_Engineering_Body_of_Knowledge","270607054_Not_seeing_the_forest_for_the_trees","262315106_Applying_the_revised_Bloom's_taxonomy_of_the_cognitive_domain_to_linux_system_administration_assessments","247700504_Teaching_for_quality_learning_at_university_2_ed_Buckingham","247699381_Taxonomy_o_f_Educational_Objectives_Cognitive_Domain","242400296_A_Revision_of_Bloom's_Taxonomy_An_Overview","235465787_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives","224892207_Social_Research_Methods"]}