{"id":"320581541_Habitat-dependent_niche_partitioning_between_colour_morphs_of_the_algal-dwelling_shrimp_Hippolyte_obliquimanus","abstract":"Trait-based differences among individuals are common and particularly important for polymorphic species in which alternative morphs exploit the same habitat types but occupy different trophic niches. The shrimp Hippolyte obliquimanus inhabits shallow-water vegetated habitats, particularly the seasonal and physically complex brown alga Sargassum furcatum and the less-structured but temporally stable red weed Galaxaura marginata. Two main colour morphs can be found in these habitats: homogeneous colour-changing shrimp that are able to match to their background and show little mobility, and transparent shrimp with coloured stripes, which cannot match their background, show lower habitat fidelity and are more evenly distributed between algal habitats. We used carbon and nitrogen stable isotopes and Bayesian mixing models to test whether morph-specific patterns of habitat use observed for H. obliquimanus living in Sargassum and Galaxaura meadows also influence trophic niche segregation. We observed morph-specific trophic differences that varied with habitat, with narrower niche space and lower niche overlap between morphs in Galaxaura meadows, and broader niche space and higher niche overlap between morphs in Sargassum habitat. Niche segregation between morphs occurred only in Galaxaura, where available resources are presumably less abundant than in Sargassum and the strength of competition between morphs is higher. Resource availability and habitat stability are likely driving dietary niche segregation between shrimp morphs, which can ultimately affect population dynamics and community composition in a spatially heterogeneous and seasonal habitat.","authors":["Rafael C. Duarte","Augusto Flores","Catarina Vinagre","Miguel C. Leal"],"meta":["October 2017Marine Biology 164(11)","DOI:10.1007/s00227-017-3247-1","Project: Colour polymorphism and its function in Hippolyte obliquimanus: camouflage and resource use diversification"],"references":["309278862_Shape_colour_plasticity_and_habitat_use_indicate_morph-specific_camouflage_strategies_in_a_marine_shrimp","308255702_Swimming_with_the_giant_Coexistence_patterns_of_a_new_redfin_minnow_Pseudobarbus_skeltoni_from_a_global_biodiversity_hot_spot","306085738_The_ecology_of_multiple_colour_defences","301283057_Trophic_niche_divergence_among_colour_morphs_that_exhibit_alternative_mating_tactics","297653871_Morph-specific_habitat_and_sex_distribution_in_the_caridean_shrimp_Hippolyte_obliquimanus","283355492_Wing_morphology_is_linked_to_stable_isotope_composition_of_nitrogen_and_carbon_in_ground_beetles_Coleoptera_Carabidae","282890531_Sympatric_ecological_divergence_associated_with_a_color_polymorphism","318393770_R_A_Language_and_Environment_for_Statistical_Computing","318393758_R_A_Language_and_Environment_for_Statistical_Computing","280778721_Converting_isotope_values_to_diet_composition_The_use_of_mixing_models"]}