{"id":"320587527_The_topology_of_evolutionary_novelty_and_innovation_in_macroevolution","abstract":"Sewall Wright's fitness landscape introduced the concept of evolutionary spaces in 1932. George Gaylord Simpson modified this to an adaptive, phenotypic landscape in 1944 and since then evolutionary spaces have played an important role in evolutionary theory through fitness and adaptive landscapes, phenotypic and functional trait spaces, morphospaces and related concepts. Although the topology of such spaces is highly variable, from locally Euclidean to pre-topological, evolutionary change has often been interpreted as a search through a pre-existing space of possibilities, with novelty arising by accessing previously inaccessible or difficult to reach regions of a space. Here I discuss the nature of evolutionary novelty and innovation within the context of evolutionary spaces, and argue that the primacy of search as a conceptual metaphor ignores the generation of new spaces as well as other changes that have played important evolutionary roles.\nThis article is part of the themed issue ‘Process and pattern in innovations from cells to societies’.","authors":["Douglas Erwin"],"meta":["December 2017Philosophical Transactions of The Royal Society B Biological Sciences 372(1735):20160422","DOI:10.1098/rstb.2016.0422"],"references":["320591371_Innovation_An_emerging_focus_from_cells_to_societies","347773931_Theoretical_Morphology_The_Concept_and_its_Applications","346681973_Convergent_Evolution_Limited_Forms_Most_Beautiful","346632009_The_Origins_of_Evolutionary_Innovations_A_Theory_of_Transformative_Change_in_Living_Systems","332503768_The_Major_Features_of_Evolution","328615987_Understanding_Change_Models_Methodologies_and_Metaphors","320586387_Cognitive_innovations_and_the_evolutionary_biology_of_expertise","320429203_Developmental_push_or_environmental_pull_The_causes_of_macroevolutionary_dynamics","317334515_THE_SKELETON_SPACE_A_FINITE_SET_OF_ORGANIC_DESIGNS","313141739_Growth_patterns_in_the_Ceratopsia"]}