{"id":"320582621_VGGFace2_A_dataset_for_recognising_faces_across_pose_and_age","abstract":"In this paper, we introduce a new large-scale face dataset named VGGFace2. The dataset contains 3.31 million images of 9131 subjects, with an average of 362.6 images for each subject. Images are downloaded from Google Image Search and have large variations in pose, age, illumination, ethnicity and profession (e.g. actors, athletes, politicians). The dataset was collected with three goals in mind: (i) to have both a large number of identities and also a large number of images for each identity; (ii) to cover a large range of pose, age and ethnicity; and (iii) to minimize the label noise. We describe how the dataset was collected, in particular the automated and manual filtering stages to ensure a high accuracy for the images of each identity. To assess face recognition performance using the new dataset, we train ResNet-50 (with and without Squeeze-and-Excitation blocks) Convolutional Neural Networks on VGGFace2, on MS- Celeb-1M, and on their union, and show that training on VGGFace2 leads to improved recognition performance over pose and age. Finally, using the models trained on these datasets, we demonstrate state-of-the-art performance on the IJB-A and IJB-B face recognition benchmarks, exceeding the previous state-of-the-art by a large margin. Datasets and models are publicly available.","authors":["Qiong Cao","Li Shen","Weidi Xie","Omkar M. Parkhi"],"meta":["October 2017"],"references":["318982014_Unsupervised_Domain_Adaptation_for_Face_Recognition_in_Unlabeled_Videos","317062266_The_Do's_and_Don'ts_for_CNN-based_Face_Verification","309729697_UMDFaces_An_Annotated_Face_Dataset_for_Training_Deep_Networks","305683616_MS-Celeb-1M_A_Dataset_and_Benchmark_for_Large-Scale_Face_Recognition","322060524_Unsupervised_Domain_Adaptation_for_Face_Recognition_in_Unlabeled_Videos","320968189_Neural_Aggregation_Network_for_Video_Face_Recognition","319501512_Squeeze-and-Excitation_Networks","319285079_IARPA_Janus_Benchmark-B_Face_Dataset","318035763_Template_Adaptation_for_Face_Verification_and_Identification","311609513_The_MegaFace_Benchmark_1_Million_Faces_for_Recognition_at_Scale"]}