{"id":"320533852_Mobile_Game-Based_Learning_with_a_Mobile_App_Motivational_Effects_and_Learning_Performance","abstract":"Goal: The use of mobile game-based learning with a mobile app in higher education aims to provide an interesting learning method which is acceptable and workable for university students in different majors and different gender to improve their English vocabulary acquisition. Objective: To analyze how, and to what extent, mobile game-based learning influences the participants’ learning performance and learning motivational effects. Experimental Setting: A mobile application game was employed to learn English vocabulary for a hundred university freshmen students from one private university in Northern Taiwan during the spring semester, 2016. Method: A pre-questionnaire and pre-test were carried out before the participants started using the app game for learning. A post-test and post-questionnaire were completed and analyzed after the 2-week experiment. Results: This paper reveals that mobile game-based learning is a workable and acceptable learning method for both female and male university students from different faculties. The results indicate that language teachers could benefit from collecting mobile educational applications and implementing the teaching via technology model into ubiquitous learning activities. The improvement between the pre-test and post-test showed the students’ positive learning performance.","authors":["Yulan Huang","Dian-Fu Chang","Berlin Wu"],"meta":["October 2017Journal of Advanced Computational Intelligence and Intelligent Informatics 21(6):963-970","DOI:10.20965/jaciii.2017.p0963"],"references":["316476756_Fuzzy_Detecting_The_Effect_Of_Mobile_Game-Based_Learning_For_University_Students","312225073_Testing_the_patterns_of_time_spent_and_leaning_effects_between_resilient_and_underachieved_groups","303443477_Mobile_and_ubiquitous_learning_in_higher_education_settings_A_systematic_review_of_empirical_studies","317219635_Mobile_Learning_A_Handbook_for_Developers_Educators_and_Learners","310755900_A_pedagogical_framework_for_mobile_learning_Categorizing_educational_applications_of_mobile_technologies_into_four_types","303110836_Game-based_Learning_and_21st_century_skills_A_review_of_recent_research","294889385_Learning_vocabulary_in_a_foreign_language_A_computer_software_based_model_attempt","290350560_Trustees'_and_investors'_behavior_in_the_first_two_rounds_of_a_trust_game_Overview_and_a_partial_explanation_based_on_cooperative_game_theory","286612517_Introduction_to_Games-Based_Learning","286543475_Applications_of_Modern_HCIs_in_Adaptive_Mobile_Learning"]}