{"id":"320582718_Impact_of_Processing-Resource_Sharing_on_the_Placement_of_Chained_Virtual_Network_Functions","abstract":"Network Function Virtualization (NFV) provides higher flexibility for network operators and reduces the complexity in network service deployment. Using NFV, Virtual Network Functions (VNF) can be located in various network nodes and chained together in a Service Chain (SC) to provide a specific service. Consolidating multiple VNFs in a smaller number of locations would allow to decrease capital expenditures. However, excessive consolidation of VNFs might cause additional latency penalties due to processing-resource sharing, and this is undesirable, as SCs are bounded by service-specific latency requirements. In this paper, we identify two different types of penalties (referred as \"costs\") related to the processingresource sharing among multiple VNFs: the context switching costs and the upscaling costs. Context switching costs arise when multiple CPU processes (e.g., supporting different VNFs) share the same CPU and thus repeated loading/saving of their context is required. Upscaling costs are incurred by VNFs requiring multi-core implementations, since they suffer a penalty due to the load-balancing needs among CPU cores. These costs affect how the chained VNFs are placed in the network to meet the performance requirement of the SCs. We evaluate their impact while considering SCs with different bandwidth and latency requirements in a scenario of VNF consolidation.","authors":["Marco Savi","Massimo Tornatore","Giacomo Verticale"],"meta":["October 2021IEEE Transactions on Cloud Computing 9(4):1479-1492","DOI:10.1109/TCC.2019.2914387"],"references":["335780402_Dynamic_and_Application-Aware_Provisioning_of_Chained_Virtual_Security_Network_Functions","311313588_A_Dynamic_Programming_Algorithm_for_Joint_VNF_Placement_and_Chaining","328378266_Joint_Placement_and_Routing_of_Network_Function_Chains_in_Data_Centers","328377782_Demystifying_the_Performance_Interference_of_Co-Located_Virtual_Network_Functions","328375132_Adaptive_VNF_Scaling_and_Flow_Routing_with_Proactive_Demand_Prediction","326569713_Optimal_Service_Function_Tree_Embedding_for_NFV_Enabled_Multicast","326562636_Efficient_Sharing_and_Fine-Grained_Scheduling_of_Virtualized_GPU_Resources","318800268_VNF_placement_with_replication_for_Loac_balancing_in_NFV_networks","312560673_VNF_Placement_in_Hybrid_NFV_Environment_Modeling_and_Genetic_Algorithms","309724901_Quokka_Latency-Aware_Middlebox_Scheduling_with_Dynamic_Resource_Allocation"]}