{"id":"320585007_Siamese_Networks_For_Chromosome_Classification","abstract":"Karyotyping is the process of pairing and ordering 23 pairs of human chromosomes from cell images on the basis of size, centromere position, and banding pattern. Karyotyping during metaphase is often used by clinical cytogeneticists to analyze human chromosomes for diagnostic purposes. It requires experience, domain expertise and considerable manual effort to efficiently perform karyotyping and diagnosis of various disorders. Therefore, automation or even partial automation is highly desirable to assist technicians and reduce the cognitive load necessary for karyotyping. With these motivations, in this paper, we attempt to develop methods for chromosome classification by borrowing the latest ideas from deep learning. More specifically, we perform straightening on chromosomes and feed them\ninto Siamese Networks to push the embeddings of samples coming from similar labels closer. Further, we propose to perform balanced sampling from the pairwise dataset while selecting dissimilar training pairs for Siamese Networks, and an MLP based prediction on top of the embeddings obtained from the trained Siamese Networks. We perform our experiments on a real world dataset of healthy patients collected from a hospital and exhaustively compare the effect of different straightening techniques, by applying them to chromosome images prior to classification. Results demonstrate that the proposed methods speed up both training and prediction by 83 and 3 folds, respectively; while surpassing the performance of a very competitive baseline created utilizing deep convolutional neural networks.","authors":["Swati --","Gaurav Gupta","Mohit Yadav","Monika Sharma"],"meta":["October 2017","DOI:10.1109/ICCVW.2017.17","Conference: BIC, ICCV 2017"],"references":["319285251_Crowdsourcing_for_Chromosome_Segmentation_and_Deep_Classification","313879359_Crowd_Sourcing_Image_Segmentation_with_iaSTAPLE","308280501_A_survey_of_neural_network_based_automated_systems_for_human_chromosome_classification","305881526_Matching_Networks_for_One_Shot_Learning","305196650_Going_deeper_with_convolutions","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","315096921_Prototypical_Networks_for_Few-shot_Learning","312273619_Dicentric_Chromosome_Image_Classification_Using_Fourier_Domain_Based_Shape_Descriptors_and_Support_Vector_Machine","311249150_Crowdsourcing_in_Computer_Vision","303615164_Automated_Cytogenetics_in_the_Study_of_Mutagenesis_and_Cancer"]}