{"id":"320546665_Pre-service_kindergarten_teachers_acceptance_of_ScratchJr_as_a_tool_for_learning_and_teaching_computational_thinking_and_Science_education","abstract":"The innovative educational programming environment called ScratchJr offers young children the possibility to program their own interactive stories and games. This study aims to investigate the acceptance of ScratchJr by pre-service kindergarten teachers as a tool to produce interactive, multimedia, learning content for science teaching as well as a tool for learning and teaching Computational Thinking. Also, the effects of using ScratchJr for future teachers' attitudes in terms of perceived ease of use and perceived usefulness are explored. The study was conducted during winter semester of the academic year 2016-2017 at a university department of early childhood education in Greece. The results show not only that the use of ScratchJr has a statistically significant increase in preservice kindergarten teachers' self-efficacy in Computational Thinking but also that they are willing to use it in their future daily practice for science education. Also, the study reveals that pre-service teachers have positive acceptance scores in terms of usefulness and ease of use of ScratchJr. Additionally, no significant difference between the acceptance scores of the participants in terms of programming background, and their studies in high school they graduated from as indicators of programming experience was found. Preliminary analysis of the data shows that ScratchJr is an appropriate educational environment for pre-service kindergarten teachers to learn programming basics as well as a platform for the development of educational resources to support the learning of science teaching.","authors":["Michail Kalogiannakis","Stamatios J Papadakis"],"meta":["August 2017","Conference: 12th Conference of the European Science Education Research Association (ESERA), «Research, practice and collaboration in science education»At: Dublin, Ireland","Project: Teaching programming in novices"],"references":["311474810_Influence_of_the_familiarization_with_scratch_on_future_teachers'_opinions_and_attitudes_about_programming_and_ICT_in_education","310741044_ICT_Teachers'_Acceptance_of_Scratch_as_Algorithm_Visualization_Software","305390965_Developing_fundamental_programming_concepts_and_computational_thinking_with_ScratchJr_in_preschool_education_A_case_study","260021793_Computational_Thinking_for_Physics_Programming_Models_of_Physics_Phenomenon_in_Elementary_School","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","308846015_Starting_from_scratch_Developing_a_pre-service_teacher_training_program_in_computational_thinking","301429317_Should_your_8-year-old_learn_coding"]}