{"id":"320593301_The_Use_of_Computational_Thinking_in_Digital_Fabrication_Projects_-_A_Case_Study_From_the_Cognitive_Perspective","abstract":"Existing literature presents many cases of computational thinking analysis through the perspective of a skill set for 21st century. However it is important to go deeper and understand how computational thinking activities fosters the cognitive development of the young, especially if we want them to have \"a significant advantage in problem solving\", becoming innovative thinkers [1]. To be innovative it is necessary that a person use sophisticated cognitive structures to reason over abstractions and deal with hypothesis. These are the characteristics of the formal operational thinking [2]. Therefore, this paper is about the use of formal thinking on computational thinking activities over a digital fabrication project developed in a Brazilian makerspace (POALab FabLab). Using a Case Study we want to show that computational thinking and digital fabrication projects demand the use of formal thinking and, since that, the importance of designing learning activities for makerspaces taking in mind the possibilities of cognitive development.","authors":["Karen Selbach Borges","Crediné Menezes","Léa da Cruz Fagundes"],"meta":["October 2017","DOI:10.1109/FIE.2017.8190654","Conference: Frontiers in Education 2017","Project: EDUCAÇÃO ORIENTADA À INOVAÇÃO: Desenvolvimento de projetos em espaços maker como forma de estimular o pensamento formal"],"references":["303792583_Computational_Thinking_The_Skill_Set_of_the_21st_Century","262261443_Maker_Movement_Spreads_Innovation_One_Project_at_a_Time","258134754_Computational_Thinking_in_K-12_A_Review_of_the_State_of_the_Field","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","234810765_Computational_thinking_for_youth_in_practice","228328529_Mindstorms_Children_Computers_and_Powerful_Ideas","35137674_The_Effectiveness_of_Concrete_and_Formal_Instructional_Procedures_with_Concrete_and_Formal_Operational_Students"]}