{"id":"320578843_The_contribution_that_empirical_studies_performed_in_industry_make_to_the_findings_of_systematic_reviews_A_tertiary_study","abstract":"Context\nSystematic reviews can provide useful knowledge for software engineering practice, by aggregating and synthesising empirical studies related to a specific topic.\n\nObjective\nWe sought to assess how far the findings of systematic reviews addressing practice-oriented topics have been derived from empirical studies that were performed in industry or that used industry data.\n\nMethod\nWe drew upon and augmented the data obtained from a tertiary study that performed a systematic review of systematic reviews published in the period up to the end of 2015, seeking to identify those with findings that are relevant for teaching and practice. For the supplementary analysis reported here, we then examined the profiles of the primary studies as reported in each systematic review.\n\nResults\nWe identified 48 systematic reviews as candidates for further analysis. The many differences that arise between systematic reviews, together with the incompleteness of reporting for these, mean that our counts should be treated as indicative rather than definitive. However, even when allowing for problems of classification, the findings from the majority of these systematic reviews were predominantly derived from using primary studies conducted in industry. There was also an emphasis upon the use of case studies, and a number of the systematic reviews also made some use of weaker ‘experience’ or even ‘opinion’ papers.\n\nConclusions\nPrimary studies from industry play an important role as inputs to systematic reviews. Using more rigorous industry-based primary studies can give greater authority to the findings of the systematic reviews, and should help with the creation of a corpus of sound empirical data to support evidence-informed decisions.","authors":["David Budgen","Pearl Brereton","Nikki Williams","Sarah Drummond"],"meta":["October 2017Information and Software Technology 94","DOI:10.1016/j.infsof.2017.10.012"],"references":["273328689_The_kanban_approach_between_agility_and_leanness_a_systematic_review","264888784_Empirical_evidence_on_the_link_between_object-oriented_measures_and_external_quality_attributes_a_systematic_literature_review"]}