{"id":"320578612_Autonomous_SLAM_based_humanoid_navigation_in_a_cluttered_environment_while_transporting_a_heavy_load","abstract":"Although in recent years there have been quite a few studies aimed at the navigation of robots in cluttered environments, few of these have addressed the problem of robots navigating while moving a large or heavy objects. This is especially useful when transporting loads with variable weights and shapes without having to change the robot hardware. Inspired by the wide use of makeshift carts by humans, we tackle, in this work, the problem of a humanoid robot navigating in a cluttered environment while displacing a heavy load that lies on a cart-like object. We present a complete navigation scheme, from the incremental construction of a map of the environment and the computation of collision-free trajectories to the control to execute these trajectories. Our contributions are as follows: (1) a whole-body control scheme that makes the humanoid use its hands and arms to control the motions of the cart–load system (e.g. tight turns) (2) a sensorless approach to automatically select the appropriate primitive set according to the load weight (3) a motion planning algorithm to find an obstacle-free trajectory using the appropriate primitive set and the constructed map of the environment as input (4) an efficient filtering technique to remove the cart from the field of view of the robot while improving the general performances of the SLAM algorithms and (5) a continuous and consistent odometry data formed by fusing the visual and the robot odometry information. We present experiments conducted on a real Nao robot, equipped with an RGB-D sensor mounted on its head, pushing a cart with different loads. Our experiments show that the payload can be significantly increased without changing the robot's main hardware, and therefore enacting the capacity of humanoid robots in real-life situations.","authors":["Antoine Rioux","Wael Suleiman"],"meta":["October 2017Robotics and Autonomous Systems 99","DOI:10.1016/j.robot.2017.10.001","Project: Humanoid robot control and collaborative tasks"],"references":["321815531_Control_strategy_and_implementation_for_a_humanoid_robot_pushing_a_heavy_load_on_a_rolling_cart","312115207_External_force_observer_for_medium-sized_humanoid_robots","308861864_Humanoid_navigation_and_heavy_load_transportation_in_a_cluttered_environment","286570999_Online_global_loop_closure_detection_for_large-scale_multi-session_graph-based_SLAM","274504328_Hierarchical_quadratic_programming_Fast_online_humanoid-robot_motion_generation","308819536_Continuous_humanoid_locomotion_over_uneven_terrain_using_stereo_fusion","271118872_Realization_of_Cooperative_Transportation_by_Regrasping_Car-like_Mobile_Robots","268236012_qpOASES_A_parametric_active-set_algorithm_for_quadratic_programming","264960433_On_Curves_of_Minimal_Length_with_a_Constraint_on_Average_Curvature_and_with_Prescribed_Initial_and_Terminal_Positions_and_Tangents","257523133_OctoMap_An_efficient_probabilistic_3D_mapping_framework_based_on_octrees","235004208_Real-Time_Navigation_in_3D_Environments_Based_on_Depth_Camera_Data","228616404_Pivoting_a_Large_Object_Whole-Body_Manipulation_by_a_Humanoid_Robot","224625775_A_Humanoid_Robot_Carrying_a_Heavy_Object","224557295_Mechatronic_design_of_NAO_humanoid","224339782_Wheelchair_Support_by_a_Humanoid_Through_Integrating_Environment_Recognition_Whole-body_Control_and_Human-Interface_Behind_the_User"]}