{"id":"320566732_Improving_Face_Detection_Performance_by_Skin_Detection_Post-Processing","abstract":"Face detection is already incorporated in many biometrics and surveillance applications. Therefore, the reduction of false detections is a priority in those systems. However, face detection is still challenging. Many factors, such as pose variation and complex backgrounds, contribute to false detections. Besides, the fidelity of a true detection, measured by precision rate, is a concern in content-based information retrieval. Following those issues, combinations of methods are developed focusing on balancing the trade-off between hit-rate and miss-rate. In this paper, we present an approach that improves face detection based on a post-processing of skin features. Our method enhanced the performance of weak detectors using a straightforward and low complex skin percentage threshold constraint. Furthermore, we also present a statistical analysis comparing our approach and two face detectors, under two different conditions for skin detection training, using a robust dataset for testing. The experimental results showed a significant drop in the number of false positives, reducing in 53%, while the precision rate was elevated in almost 5% when the Viola-Jones approach was used as face detector.","authors":["Oeslle Lucena","Ítalo de Pontes Oliveira","Luciana Veloso","Eanes Torres Pereira"],"meta":["October 2017","DOI:10.1109/SIBGRAPI.2017.46","Conference: Conference on Graphics, Patterns and Images (SIBGRAPI'17)At: Niterói, RJ, Brazil"],"references":["273177025_Biometric_Antispoofing_Methods_A_Survey_in_Face_Recognition","314668304_Face_detection_method_based_on_histogram_of_sparse_code_in_tree_deformable_model","304410335_A_hybrid_skin_color_detection_using_HSV_and_YCgCr_color_space_for_face_detection","304290212_Face_detection_based_on_improved_skin_model_and_local_iterated_conditional_modes","291145220_Skin_color_modeling_for_face_detection_and_segmentation_a_review_and_a_new_approach","285673977_Faces_detection_method_based_on_skin_color_modeling","275156849_A_Survey_on_Face_Detection_in_the_wild_past_present_and_future","271482535_An_empirical_study_of_selection_of_the_appropriate_color_space_for_skin_detection_A_case_of_face_detection_in_color_images","266298783_FDDB_A_Benchmark_for_Face_Detection_in_Unconstrained_Settings","261044138_Rejecting_pseudo-faces_using_the_likelihood_of_facial_features_and_skin"]}