{"id":"320694078_What_makes_CLIL_leadership_effective_A_case_study","abstract":"The swift growth of Content and Language Integrated Learning (CLIL) has caused a diversification of CLIL models designed to fit specific contexts. Although variation across programmes is inevitable, exploring the main factors for the effective implementation of CLIL may help avoid the risk of promoting inefficient practices. The main purpose of this article is to examine how three schools have implemented successful CLIL programmes in the Catalan context by analysing, from a leadership perspective, the perceptions and practices of the schools' principals, English department heads, and CLIL teachers. We applied a case study approach. The results elicited from surveys, interviews, and classroom observations reveal that these CLIL programmes benefitted from clear design, teacher training, collaboration, administrative support, and continued exposure of students to the target language. Participants perceived that distributed leadership facilitated the implementation of the programmes. Implications for CLIL programme leaders in similar contexts may be drawn from the study. © The Author 2017. Published by Oxford University Press; all rights reserved.","authors":["David Soler","Maria Gonzalez-Davies","Anna Inesta"],"meta":["October 2017ELT Journal 71(4):478-490","DOI:10.1093/elt/ccw093"],"references":["287451810_CLIL_A_Suit_for_All_Seasons","284690356_Outcomes_and_processes_in_Content_and_Language_Integrated_Learning_CLIL_current_research_from_Europe","259436609_Content_and_Language_Integrated_Learning_A_research_agenda","237523726_Teacher_beliefs_in_a_CLIL_education_project","344903480_Discourse_in_Content_and_Language_Integrated_Learning_CLIL_Classrooms","315713752_Content_and_Language_Integrated_Learning","311669890_A_Regional_Assessment_of_Bilingual_Programmes_in_Primary_and_Secondary_Schools_the_Teachers'_Views","292760467_CLIL_in_Catalonia_An_overview_of_research_studies","290829114_CLIL_counterweights_recognising_and_decreasing_disjuncture_in_CLIL","273370436_Reviewing_the_puzzle_of_CLIL","231963626_Managing_innovation_in_English_language_education","231877381_Content-Based_Instruction_Perspectives_on_Curriculum_Planning"]}