{"id":"320609271_Supervisor_Localization_of_Discrete-Event_Systems_with_Infinite_Behavior","abstract":"Recently we developed supervisor localization, a top-down approach to distributed control of discrete-event systems (DES) with finite behavior. Its essence is the allocation of monolithic (global) control action among the local control strategies of individual agents. In this report, we extend supervisor localization to study the distributed control of DES with infinite behavior. Specifically, we first employ Thistle and Wonham's supervisory control theory for DES with infinite behavior to compute a safety supervisor (for safety specifications) and a liveness supervisor (for liveness specifications), and then design a suitable localization procedure to decompose the safety supervisor into a set of safety local controllers, one for each controllable event, and decompose the liveness supervisor into a set of liveness local controllers, two for each controllable event. The localization procedure for decomposing the liveness supervisor is novel; in particular, a local controller is responsible for disabling the corresponding controllable event on only part of the states of the liveness supervisor, and consequently, the derived local controller in general has states number no more than that computed by considering the disablement on all the states. Moreover, we prove that the derived local controllers achieve the same controlled behavior with the safety and liveness supervisors. We finally illustrate the result by a Small Factory example.","authors":["Renyuan Zhang","Kai Cai"],"meta":["October 2017"],"references":["272040743_New_results_on_supervisor_localization_with_case_studies","263144492_Supervisor_localization_for_large_discrete-event_systems_Case_study_production_cell","251396842_Supervisory_control_of_discrete_event_processes","243093139_Control_of_Infinite_Behavior_of_Finite_Automata","238326942_Supervision_of_infinite_behavior_of_discrete-event_systems","228690561_Supervisor_Localization_A_Top-Down_Approach_to_Distributed_Control_of_Discrete-Event_Systems","224390685_Control_of_Discrete_Event_Systems_Modeled_with_Deterministic_Buchi_Automata","282000266_Supervisor_Localization_of_Discrete-Event_Systems_under_Partial_Observation","260662336_On_supervisory_control_of_sequential_behaviors","236635233_Supervision_Localization_of_Timed_Discrete-Event_Systems","232716899_Efficient_Model_Checking_in_Fragments_of_the_Propositional_Mu-Calculus","227117452_On_control_of_systems_modelled_as_deterministic_Rabin_automata","224682805_Control_of_discrete_event_processes_with_forced_events","220259754_Effective_Control_Synthesis_for_Partially_Observed_Discrete-Event_Systems","220071276_Proving_the_Correctness_of_Multiprocess_Programs","3020151_Some_Tractable_Supervisor_Control_Problems_for_Discrete_Event_Systems_Modeled_by_Buchi_Automata"]}