{"id":"320620760_Combining_the_Previous_Measure_of_Evidence_to_Educational_Entrance_Examination","abstract":"Background and Objective: Educational entrance examination refers to the extent in selecting the student to enroll through admission into educational institution. It has an entire procedure administered to achieve from primary to higher education. However, not many researches were conducted using mathematical theory of evidence. This study aims to investigate the examination process about the admission into educational institutions using mathematical theory of evidence. Materials and Methods: The assessment on student始s\nentrance examination through the effectiveness of Dempster-Shafer theory can be viewed with its significant contribution by combining the previous measure of evidence. Eight student始s entrance examination results were proposed. Results: The result reveals that there were some significant findings in assessing the student始s entrance examination using mathematical theory of evidence. Those were obtained degrees of belief of Computer Science with 76.4% for student 1, Computer Science with 64.2% for student 2, Computer Science with\n75.4% for student 3, Computer Science with 80.3% for student 4, Computer Science with 67.4% for student 5, Computer Science with 57.1% for student 6, Islamic Studies with 26.3% for student 7, Computer Science with 62.5% for student 8. Conclusion: In this research, mathematical theory of evidence has been successfully developed to assess student始s entrance examination and displaying the result of identification process.","authors":["Andino Maseleno","Miftachul Huda","Maragustam Siregar","Roslee Ahmad"],"meta":["October 2017Journal of Artificial Intelligence 10(3):85-90","DOI:10.3923/jai.2017.85.90","Project: Learning Enhancement in Digital Age"],"references":["319159429_Empowering_Civic_Responsibility_Insights_From_Service_Learning","312491934_Smartphones_usage_in_the_classrooms_Learning_aid_or_interference","320584074_Exploring_Innovative_Learning_Environment_ILE_Big_Data_Era"]}