{"id":"320600284_Local_Feature-Based_Attribute_Profiles_for_Optical_Remote_Sensing_Image_Classification","abstract":"This paper introduces an extension of morphological attribute profiles (APs) by extracting their local features. The so-called local feature-based APs (LFAPs) are expected to provide a better characterization of each APs' filtered pixel (i.e., APs' sample) within its neighborhood, and hence better deal with local texture information from the image content. In this paper, LFAPs are constructed by extracting some simple first-order statistical features of the local patch around each APs' sample such as mean, standard deviation, and range. Then, the final feature vector characterizing each image pixel is formed by combining all local features extracted from APs of that pixel. In addition, since the self-dual APs (SDAPs) have been proved to outperform the APs in recent years, a similar process will be applied to form the local feature-based SDAPs (LFSDAPs). In order to evaluate the effectiveness of LFAPs and LFSDAPs, supervised classification using both the random forest and the support vector machine classifiers is performed on the very high resolution Reykjavik image as well as the hyperspectral Pavia University data. Experimental results show that LFAPs (respectively, LFSDAPs) can considerably improve the classification accuracy of the standard APs (respectively, SDAPs) and the recently proposed histogram-based APs.","authors":["Minh-Tan Pham","Sébastien Lefèvre","Erchan Aptoula"],"meta":["October 2017IEEE Transactions on Geoscience and Remote Sensing PP(99):1-14","DOI:10.1109/TGRS.2017.2761402"],"references":["302341151_Textural_Features_for_Image_Classification","301715647_Texture_Retrieval_from_VHR_Optical_Remote_Sensed_Images_Using_the_Local_Extrema_Descriptor_with_Application_to_Vineyard_Parcel_Detection","296480325_Generalized_Differential_Morphological_Profiles_for_Remote_Sensing_Image_Classification","313527206_A_completed_modeling_of_local_binary_pattern_operator_for_texture_classification","309693690_Deep_Learning_With_Attribute_Profiles_for_Hyperspectral_Image_Classification","307881957_LIBSVM_A_library_for_support_vector_machines","305524097_Extinction_Profiles_for_the_Classification_of_Remote_Sensing_Data","295562388_Remote_Sensing_Image_Classification_Using_Attribute_Filters_Defined_Over_the_Tree_of_Shapes","292345991_PW-COG_An_Effective_Texture_Descriptor_for_VHR_Satellite_Imagery_Using_a_Pointwise_Approach_on_Covariance_Matrix_of_Oriented_Gradients","290899011_A_Review_of_Modern_Approaches_to_Classification_of_Remote_Sensing_Data"]}