{"id":"320674521_A_Novel_Educational_Proposal_and_Strategies_Toward_Promoting_Cloud_Computing_Big_Data_and_Human-Computer_Interaction_in_Engineering_Colleges_and_Universities","abstract":"Cloud computing is an important name in current Information Technology domain and responsible for the development in many perspectives. The advancement of information processing, management, delivery to software-related matter may be solved with cloud platforms. The virtualization of hardware, software, applications, etc., is in many ways dedicated for solid information infrastructure building and side by side solid information technology management. The related field of cloud computing is Big Data, which is responsible for managing large amount of data only rather software, hardware, etc. The application of Big Data is also called as Big Data Management. The complex and huge data generation results this domain and helps in data and information solutions in most of the organizations, institutions, associations, etc. Apart from these two, another important technology is human–computer interaction and partially related with the earlier mentioned technologies. It is worthy to note that these tools and technologies become common name in today’s world, but the educational opportunities are very much limited in India. The university and college level education as a full-fledged domain or specialization is more or less absent. This paper talks about cloud computing, Big Data, HCI as an overview including its current educational scenario with special focus on possible degrees, etc., in Indian context.","authors":["P.K. Paul","Mrinal Kanti Ghose"],"meta":["January 2018","DOI:10.1007/978-981-10-4286-7_10","In book: Advances in Smart Grid and Renewable Energy (pp.93-102)"],"references":["249360041_India_in_the_knowledge_economy_-_An_electronic_paradigm","243530314_The_Scope_and_Importance_of_Human_Interruption_in_Human-Computer_Interaction_Design","336091196_Research_and_Training_in_Higher_Education_The_State_of_the_Art","313005544_Modeling_and_simulation_of_scalable_cloud_computing_environments_and_the_cloudSim_Toolkit_challenges_and_opportunities","311344281_A_survey_on_security_issues_in_service_delivery_models_of_cloud_computing","284677266_A_Survey_on_Security_Issues_in_Service_Delivery_Models_of_Cloud_Computing","249033570_The_Problem_of_Computer_Conferencing_for_Distance-based_Universities","248961216_Research_and_Training_in_Higher_Education_The_State_of_the_Art","238123586_The_Scope_and_Importance_of_Human_Interruption_in_HCI_design"]}