{"id":"320660645_Two-dimensional_active_raypath_separation_using_examination_of_the_roots_of_the_spectrum_polynomial","abstract":"The application of the root multiple signal classification algorithm for raypath separation was motivated by the dramatic reduction in processing time of the multiple-signal classification algorithm. However, the algorithm provides classification only in the direction of the arrival domain and fails to separate raypaths arriving at the array with similar directions of arrival. Moreover, for many applications in shallow water (such as ocean acoustic tomography and active sonar), the emitted signal is known and can be used as a priori information to improve the resolution. Thus, in this study, a two-dimensional active wideband classification algorithm is developed using the examination of the roots of the spectrum polynomial in the angle versus time domain. A two-step strategy is developed to enable extension to the two-dimensional case. The results of simulations confirm that the proposed algorithm achieves almost identical resolution as the existing two-dimensional algorithms while offering a significant reduction in computation time.","authors":["Longyu Jiang","Runguo He","Yaping Hong","Jiasong Wu"],"meta":["October 2017The Journal of the Acoustical Society of America 142(4):EL408-EL414","DOI:10.1121/1.5008434","Project: Array processing based on high-order statistics"],"references":["314027311_Raypath_Separation_With_a_High-Resolution_Algorithm_in_a_Shallow-Water_Waveguide","228931279_A_nonreciprocal_implementation_of_time_reversal_in_the_ocean","224255652_Raypath_Separation_with_High_Resolution_Processing","23997373_The_structure_of_raylike_arrivals_in_a_shallow-water_waveguide","232637881_High_resolution_spatio-temporal_analysis_by_an_active_array","224738724_Improving_the_resolution_performance_of_eigenstructure-based_direction-finding_algorithms","222215471_The_root-MUSIC_algorithm_for_direction_finding_with_interpolated_arrays","3315611_Wideband_array_processing_using_a_two-sided_correlation_transformation","3016535_Multiple_Emitter_Location_and_Signal_Parameter_Estimation"]}