{"id":"320674387_Computers_from_Plants_We_Never_Made_Speculations","abstract":"Plants are highly intelligent organisms. They continuously make distributed processing of sensory information, concurrent decision making and parallel actuation. The plants are efficient green computers per se. Outside in nature, the plants are programmed and hardwired to perform a narrow range of tasks aimed to maximize the plants’ ecological distribution, survival and reproduction. To ‘persuade’ plants to solve tasks outside their usual range of activities, we must either choose problem domains which homomorphic to the plants natural domains or modify biophysical properties of plants to make them organic electronic devices. We discuss possible designs and prototypes of computing systems that could be based on morphological development of roots, interaction of roots, and analog electrical computation with plants, and plant-derived electronic components. In morphological plant processors data are represented by initial configuration of roots and configurations of sources of attractants and repellents; results of computation are represented by topology of the roots’ network. Computation is implemented by the roots following gradients of attractants and repellents, as well as interacting with each other. Problems solvable by plant roots, in principle, include shortest-path, minimum spanning tree, Voronoi diagram, \\(\\alpha \\)-shapes, convex subdivision of concave polygons. Electrical properties of plants can be modified by loading the plants with functional nanoparticles or coating parts of plants of conductive polymers. Thus, we are in position to make living variable resistors, capacitors, operational amplifiers, multipliers, potentiometers and fixed-function generators. The electrically modified plants can implement summation, integration with respect to time, inversion, multiplication, exponentiation, logarithm, division. Mathematical and engineering problems to be solved can be represented in plant root networks of resistive or reaction elements. Developments in plant-based computing architectures will trigger emergence of a unique community of biologists, electronic engineering and computer scientists working together to produce living electronic devices which future green computers will be made of.","authors":["Andrew Adamatzky","Simon Lawrence Harding","Victor Erokhin","Richard Mayne"],"meta":["January 2018","DOI:10.1007/978-3-319-67997-6_17","In book: Inspired by Nature (pp.357-387)","Project: Controlled self-assembly of bioactive compounds in confined space at nanolevel: at air-water interface, in thin solid films and nanocarriers"],"references":["309438417_First_steps_towards_the_realization_of_a_double_layer_perceptron_based_on_organic_memristive_devices","344122710_Physarum_Machines_Computers_from_Slime_Mould","334532082_Robust_Soldier_Crab_Ball_Gate","321619105_Collision-Based_Computing","321542774_Advances_in_Physarum_Machines_Sensing_and_Computing_with_Slime_Mould","320674006_Discovering_Boolean_Gates_in_Slime_Mould","316698268_Reaction-Diffusion_Computers","314592990_Physarum_in_Hybrid_Electronic_Devices","309191985_On_plant_roots_logical_gates","306420521_Spectrophotometric_characterization_of_organic_memristive_devices","305119335_Discovering_Boolean_Gates_in_Slime_Mould","306314610_Emerging_Memristor-Based_Logic_Circuit_Design_Approaches_A_Review","305786054_Vision_in_Plants_via_Plant-Specific_Ocelli","305673760_Organic_Memristor_Based_Elements_for_Bio-inspired_Computing","305382946_On_hybridising_lettuce_seedlings_with_nanoparticles_and_the_resultant_effects_on_the_organisms'_electrical_characteristics"]}