{"id":"320695296_A_review_of_intrinsic_motivation_elements_in_gamified_online_learning","abstract":"The advent of information and communication technology provides the opportunity and convenience to anyone to be able to follow online-based learning, so that teaching and learning can be arranged without limits of space and time. Today, online-based learning is offered by many higher education institutions and commercial industries. A variety of strategies to increase student motivation approach on online-based learning has been studied, one of them by using gamification approach. Previous researches were found to adopt motivational theories to stimulate the intrinsic and extrinsic level of gamification approach in education, According to the promise of gamification to enhance the intrinsic motivation of students based on elements of motivation through online-based learning, in this research, we focus on examining; 1) How the application of gamification in online-based learning is, 2) what game design elements that exist in the gamified-based online learning are, and 3) how to increase student motivation in gamified-online learning based on intrinsic motivation elements. The results of our study showed that gamification on online based learning increased, both regarding to utilization, approaches, methods, testing and determination of game design elements are used. Gamification also gave positive impact on student motivation in learning, although it depended on various factors and conditions. We provided reviews and examples based on the literature for the designer in determining the game design elements based on intrinsic motivation elements in the online-based learning.","authors":["Rujianto Eko Saputro","Sazilah Salam","Mohd Hafiz Zakaria"],"meta":["October 2017Journal of Theoretical and Applied Information Technology 95(19):4934-4948","Project: Gamification in MOOC"],"references":["316988514_Assessing_the_efficacy_of_incorporating_game_dynamics_in_a_learning_management_system","311879391_How_gamification_motivates_An_experimental_study_of_the_effects_of_specific_game_design_elements_on_psychological_need_satisfaction","311313403_The_effects_of_Gamification_on_engineering_lab_activities","309050128_Engaging_Engineering_Students_with_Gamification","309006949_Studying_student_differentiation_in_gamified_education_A_long-term_study","308624327_Designing_game-like_activities_to_engage_adult_learners_in_higher_education","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","313814733_Enhancing_online_distance_education_in_small_rural_US_schools_a_hybrid_learner-centred_model","311093965_Individualising_gamification_An_investigation_of_the_impact_of_learning_styles_and_personality_traits_on_the_efficacy_of_gamification_using_a_prediction_market","309222253_Effects_of_Gamified_Quiz_to_Student's_Motivation_and_Score"]}