{"id":"320677744_A_Comparison_Study_of_Different_Community_Detection_Approaches_and_Its_Potential_Applications_for_Online_Networks","abstract":"The incredible rising of online networks show that these networks are complex and involving massive data. Giving a very strong interest to set of techniques developed for mining these networks. One of the fundamental applications for it is the community detection. It helps to understand and model the network structure which has been a fundamental problem in several fields. Community detection is one of the fundamental applications that provide a solution discipline where systems are often represented as graphs. Community detection is of great importance in sociology, biology and computer science. This problem is very hard and not yet satisfactorily solved, despite the huge effort of a large interdisciplinary community of scientists working on it over the past few years. It helps to understand and model the network structure, can be useful in various applications such as rating prediction, link and Top-N recommendation, trend analysis and also be the main provider engine for recommender systems. Several community detection approaches have been proposed and applied to many domains in the literature. This paper presents a comparison study of two different existing community detection approaches and also discusses some of its vital applications for online networks.","authors":["Mohamed Farrag","Laila El Fangary","Mona Mohamed Nasr","Chaimaa Salama"],"meta":["October 2017","DOI:10.9790/9622-0710053645"],"references":["295395520_Community_detection_in_social_networks","267422362_Graph_Mining_and_Communities_Detection","264124767_Community_detection_in_large-scale_networks_A_survey_and_empirical_evaluation","259389399_A_Survey_on_Using_Data_Mining_Techniques_for_Online_Social_Network_Analysis","248519014_An_Information_Flow_Model_for_Conflict_and_Fission_in_Small_Groups1","224872278_Percolation_Computation_in_Complex_Networks","221273619_Detecting_Highly_Overlapping_Communities_with_Model-Based_Overlapping_Seed_Expansion","306387975_Clique_and_Constraint_Models_for_Maximum_Common_Connected_Subgraph_Problems","287378049_Social_media_mining_An_introduction","222523851_Detect_overlapping_and_hierarchical_community_structure_in_networks"]}