{"id":"320655241_An_Evolutionary_Software_Project_Management_Maturity_Model_for_Mauritius","abstract":"Software project management is a relatively recent discipline that emerged during the second half of the 20th century (Kwak, 2003). Many of the software project management methodologies available today were developed in Western/European countries and research showed that there was a need to formalise a software project management framework for developing countries, in particular Africa (Muriithi & Crawford, 2003). Based on surveys and discussions with software professionals, a methodology for software project management is being proposed. The methodology is based on a maturity model as Mauritius is faced with a shortage in skilled professionals. So far, few organisations in Mauritius have been found to be using software project management methodologies developed in Western/European countries. Most maturity models, for example Capability Maturity Model Integration (CMMI) and Kerzner’s maturity model, have five maturity levels. The trend is towards the development of maturity models that have fewer maturity levels. For example, the Organisational Project Management Maturity Model (OPM3) and Prince 2 Maturity Model have been developed with three maturity levels.","authors":["Aneerav Sukhoo","Andries Barnard","Mm Eloff","John Andrew van der Poll"],"meta":["January 2007","DOI:10.28945/3158","Conference: InSITE 2007: Informing Science + IT Education Conference"],"references":["320663984_An_Assessment_of_Software_Project_Management_Maturity_in_Mauritius","320655984_Accommodating_Soft_Skills_in_Software_Project_Management","220437105_IT_project_uncertainty_planning_and_success_An_empirical_investigation_from_Kuwait","297684861_Project_Management_Software","256520348_Project_management_The_promise_for_developing_countries","223015389_Approaches_to_project_management_in_Africa_Implications_for_international_development_projects","220630323_Key_Issues_for_Global_it_Sourcing_Country_and_Individual_Factors"]}