{"id":"320623347_Developing_a_Regional_Classifier_to_Track_Patient_Needs_in_Medical_Literature_Using_Spiral_Timelines_on_a_Geographical_Map","abstract":"Research clues can be expressed as coherent chains of keywords grouped by theme. Capturing clues to research from the vast and expanding medical literature is valuable. Yet, it is difficult to automatically create clear visualizations of research clues despite the presence of many competing summarization tools. In this paper, we propose a linear classifier based on a spiral, which we call a regional classifier. The study emphasizes the development of visualization methods and the process of finding a specific research clue to track patient needs reported in medical literature. When timelines are combined with a spiral geographical map, they show a geometric shape that helps to reveal the clues from different spatial viewpoints and periodical constraints. Our evaluation showed that the regional classifier produces better visual effects than support vector machine classifiers. It covers important concepts of each theme and is able to represent the relationships among papers in a way that captures continuous developments and changes in key themes.","authors":["Chunlei Tang","Haohan Zhang","Kenneth H. Lai","Yuxuan She"],"meta":["November 2017","DOI:10.1109/BIBM.2017.8217771","Conference: The 2017 IEEE International Conference on Bioinformatics and Biomedicine (BIBM)At: Kansas City, MO, USAVolume: ISBN 978-1-5090-3050-7","Project: Lifestyle Checklist"],"references":["298808287_Mapping_the_Structure_and_Evolution_of_Chemistry_Research","220873204_Creating_a_Gold_Standard_for_Sentence_Clustering_in_Multi-Document_Summarization","8919472_Searching_for_intellectual_turning_points_Progressive_knowledge_domain_visualization","298713414_Describing_Patients'_Needs_in_the_context_of_Research_Priorities_in_patients_with_Multiple_myeloma_or_M_Waldenstrom_A_truly_patient-driven_study","239283184_Indicators_in_a_research_institute_A_multi-level_classification_of_scientific_journals","221345245_Dynamic_Topic_Models","221299876_Evolutionary_timeline_summarization_a_balanced_optimization_framework_via_iterative_substitution","220818563_Interactive_Visualization_of_Spatiotemporal_Patterns_Using_Spirals_on_a_Geographical_Map"]}