{"id":"320655361_Accommodating_Soft_Skills_in_Software_Project_Management","abstract":"Software project management probably is a sector that has witnessed the highest rate of project failure in the world. This is not the case with project management concerned with other disciplines due to better management of their inherent strengths and weaknesses. Hard skills, often described as a science and comprising processes, tools and techniques applied to projects are the main focus of many project management methodologies. Extensive research has been carried out in the project management domain with greater focus on hard skills. Soft skills described as an art, are very often ignored during software project management. Such skills, acquired through experience, are concerned with managing and working with people, ensuring customer satisfaction and creating a conducive environment for the project team to deliver high quality products within budget and on time and exceeding stakeholder expectations. This paper summarizes the soft skills that can possibly improve the success rate of software projects. These projects, if not managed properly can lead to escalation of budget and time schedules beyond expectations. Deterioration of quality may be inevitable while deploying efforts to deal with cost overrun and schedule extension. Research in the field of soft skills required has been carried out at the University of Arkansas. The results show that IT organizations are conscious of the need for soft skills. Furthermore, a number of organizations, like Polaris, Sun Microsystems and Mastek have found it necessary to include soft skills in their training agenda.","authors":["Aneerav Sukhoo","Andries Barnard","Mm Eloff","John Andrew Van der Poll"],"meta":["January 2005","DOI:10.28945/2923","Conference: InSITE 2005: Informing Science + IT Education Conference"],"references":["324006462_Soft_Skills_for_Professional_Development","319574149_The_Project_Management_Lifecycle","304377436_Emotional_Intelligence_Why_It_Can_Matter_More_Than_IQ","297684861_Project_Management_Software","235362280_Working_With_Emotional_Intelligence","235279325_Self-development_the_nine_basic_skills_for_business_success","229192098_Why_do_so_many_major_IT_projects_fail","13008182_Measuring_organizational_change_in_human_services","12742818_What_Makes_a_Leader"]}