{"id":"320678770_SSEL-ADE_A_semi-supervised_ensemble_learning_framework_for_extracting_adverse_drug_events_from_social_media","abstract":"With the development of Web 2.0 technology, social media websites have become lucrative but under-explored data sources for extracting adverse drug events (ADEs), which is a serious health problem. Besides ADE, other semantic relation types (e.g., drug indication and beneficial effect) could hold between the drug and adverse event mentions, making ADE relation extraction - distinguishing ADE relationship from other relation types - necessary. However, conducting ADE relation extraction in social media environment is not a trivial task because of the expertise-dependent, time-consuming and costly annotation process, and the feature space's high-dimensionality attributed to intrinsic characteristics of social media data. This study aims to develop a framework for ADE relation extraction using patient-generated content in social media with better performance than that delivered by previous efforts. To achieve the objective, a general semi-supervised ensemble learning framework, SSEL-ADE, was developed. The framework exploited various lexical, semantic, and syntactic features, and integrated ensemble learning and semi-supervised learning. A series of experiments were conducted to verify the effectiveness of the proposed framework. Empirical results demonstrate the effectiveness of each component of SSEL-ADE and reveal that our proposed framework outperforms most of existing ADE relation extraction methods The SSEL-ADE can facilitate enhanced ADE relation extraction performance, thereby providing more reliable support for pharmacovigilance. Moreover, the proposed semi-supervised ensemble methods have the potential of being applied to effectively deal with other social media-based problems.","authors":["Jing Liu","Songzheng Zhao","Gang Wang"],"meta":["October 2017Artificial Intelligence in Medicine 84","DOI:10.1016/j.artmed.2017.10.003"],"references":["280124446_Big_Data_for_Health","279309110_Exploring_Spanish_health_social_media_for_detecting_drug_effects","267736011_Mining_Adverse_Drug_Reactions_from_Online_Healthcare_Forums_using_Hidden_Markov_Model","261956146_Digital_Drug_Safety_Surveillance_Monitoring_Pharmaceutical_Products_in_Twitter","5842635_Kernel_approaches_for_genic_interaction_extraction"]}