{"id":"320683324_Reporting_Systematic_Reviews_Some_Lessons_from_a_Tertiary_Study","abstract":"Context\nMany of the systematic reviews published in software engineering are related to research or methodological issues and hence are unlikely to be of direct benefit to practitioners or teachers. Those that are relevant to practice and teaching need to be presented in a form that makes their findings usable with minimum interpretation.\n\nObjective\nWe have examined a sample of the many systematic reviews that have been published over a period of six years, in order to assess how well these are reported and identify useful lessons about how this might be done.\n\nMethod\nWe undertook a tertiary study, performing a systematic review of systematic reviews. Our study found 178 systematic reviews published in a set of major software engineering journals over the period 2010–2015. Of these, 37 provided recommendations or conclusions of relevance to education and/or practice and we used the DARE criteria as well as other attributes related to the systematic review process to analyse how well they were reported.\n\nResults\nWe have derived a set of 12 ‘lessons’ that could help authors with reporting the outcomes of a systematic review in software engineering. We also provide an associated checklist for use by journal and conference referees.\n\nConclusion\nThere are several areas where better reporting is needed, including quality assessment, synthesis, and the procedures followed by the reviewers. Researchers, practitioners, teachers and journal referees would all benefit from better reporting of systematic reviews, both for clarity and also for establishing the provenance of any findings.","authors":["David Budgen","Pearl Brereton","Sarah Drummond","Nikki Williams"],"meta":["October 2017Information and Software Technology 95","DOI:10.1016/j.infsof.2017.10.017"],"references":["273328689_The_kanban_approach_between_agility_and_leanness_a_systematic_review","264888784_Empirical_evidence_on_the_link_between_object-oriented_measures_and_external_quality_attributes_a_systematic_literature_review"]}