{"id":"320642529_Adverse_Reactions_Associated_With_Cannabis_Consumption_as_Evident_From_Search_Engine_Queries","abstract":"Background: \nCannabis is one of the most widely used psychoactive substances worldwide, but adverse drug reactions (ADRs) associated with its use are difficult to study because of its prohibited status in many countries.\n\nObjective: \nInternet search engine queries have been used to investigate ADRs in pharmaceutical drugs. In this proof-of-concept study, we tested whether these queries can be used to detect the adverse reactions of cannabis use.\n\nMethods: \nWe analyzed anonymized queries from US-based users of Bing, a widely used search engine, made over a period of 6 months and compared the results with the prevalence of cannabis use as reported in the US National Survey on Drug Use in the Household (NSDUH) and with ADRs reported in the Food and Drug Administration's Adverse Drug Reporting System. Predicted prevalence of cannabis use was estimated from the fraction of people making queries about cannabis, marijuana, and 121 additional synonyms. Predicted ADRs were estimated from queries containing layperson descriptions to 195 ICD-10 symptoms list.\n\nResults: \nOur results indicated that the predicted prevalence of cannabis use at the US census regional level reaches an R(2) of .71 NSDUH data. Queries for ADRs made by people who also searched for cannabis reveal many of the known adverse effects of cannabis (eg, cough and psychotic symptoms), as well as plausible unknown reactions (eg, pyrexia).\n\nConclusions: \nThese results indicate that search engine queries can serve as an important tool for the study of adverse reactions of illicit drugs, which are difficult to study in other settings.","authors":["Elad Yom-Tov","Shaul Lev-Ran"],"meta":["October 2017JMIR Public Health and Surveillance 3(4):e77","DOI:10.2196/publichealth.8391"],"references":["316348877_Seeking_Web-Based_Information_About_Attention_Deficit_Hyperactivity_Disorder_Where_What_and_When","266497792_A_Second_Course_in_Statistics_Regression_Analysis","262927895_Gone_to_Pot_-_A_Review_of_the_Association_between_Cannabis_and_Psychosis","262846407_Adverse_Health_Effects_of_Marijuana_Use","313291303_Validation_of_New_Signal_Detection_Methods_for_Web_Query_Log_Data_Compared_to_Signal_Detection_Algorithms_Used_With_FAERS","308541644_Questions_of_Public_Health_How_What_You_Do_on_the_Internet_Will_Improve_Medicine","300742401_Receptor_and_Nonreceptor_Membrane-Mediated_Effects_of_THC_and_Cannabinoids","284887893_Early_identification_of_adverse_drug_reactions_from_search_log_data","282044558_Self-Reported_Use_of_Novel_Psychoactive_Substances_in_a_US_Nationally_Representative_Survey_Prevalence_Correlates_and_a_Call_for_New_Survey_Methods_to_Prevent_Underreporting","266564292_What_has_research_over_the_past_two_decades_revealed_about_the_adverse_health_effects_of_recreational_cannabis_use"]}