{"id":"320658375_After_decision-making_The_operationalization_of_norms_in_International_Relations","abstract":"Research on norms in International Relations (IR) includes various concepts related to how norms influence actions. These approaches focus on the decision-making process, and largely neglect the operationalization of norms. This omission leads to an analytical gap: a lack of attention to how the substance of abstract norms is transformed and constructed in the operationalization process. This article draws on the Foucauldian theme of governmentality to introduce a novel perspective on operationalizing norms. It focusses in particular on the role of techniques as understudied parts inherent to the reflexive processes of operationalization and meaning production. The article thereby contests the prevalence of fundamental norms in conventional IR theory. It demonstrates, instead, that global governance techniques do not simply translate rationalities into practice, but construct their very own normativities. These theoretical reflections are illustrated by analysing the operationalization of norms through indicators in the case of the European Union’s human rights policy.","authors":["Hendrik Huelss"],"meta":["November 2017International Theory 9(03):381-409","DOI:10.1017/S1752971917000069"],"references":["325217479_Human_Rights_Indicators_in_the_Context_of_the_European_Union","315335114_SpringerBriefs_in_Political_Science","310827604_How_to_Become_an_Influential_Actor_-_The_'Comparative_Turn'_in_OECD_Education_Policy","306177662_The_Power_of_Human_Rights_International_Norms_and_Domestic_Change","292002082_Governing_the_Present_Administering_Economic_Social_and_Personal_Life","287910780_European_Union_Peacebuilding_and_Policing_Governance_and_the_European_Security_and_Defence_Policy","283129366_Individual_Agency_and_Policy_Change_at_the_United_Nations_The_People_of_the_United_Nations","281903479_Introduction_Understanding_Public_Policy_through_Its_Instruments","280812782_The_birth_of_biopolitics_lectures_at_the_College_de_France_1978-1979_Michel_Foucault","280802694_Governmentality_Power_and_Rule_in_Modern_Society"]}