{"id":"320680295_R-adaptation_for_Shallow_Water_flows_conservation_well_balancedness_efficiency","abstract":"We investigate the potential of the so-called “relocation” mesh adaptation in terms of resolution and efficiency for the simulation of free surface flows in the near shore region. Our work is developed in three main steps. First, we consider several Arbitrary Lagrangian Eulerian (ALE) formulations of the shallow water equations on moving grids, and provide discrete analogue in the Finite Volume and Residual Distribution framework. The compliance to all the physical constraints, often in competition, is taken into account. We consider different formulations allowing to combine volume conservation (DGCL) and equilibrium (Well-Balancedness), and we clarify the relations between the so-called pre-balanced form of the equations [7]), and the classical upwinding of the bathymetry term gradients [1]. Moreover, we propose a simple remap of the bathymetry based on high accurate quadrature on the moving mesh which, while preserving an accurate representation of the initial data, also allows to retain mass conservation within an arbitrary accuracy. Second, the coupling of the resulting schemes with a mesh partial differential equation is studied. Since the flow solver is based on genuinely explicit time stepping, we investigate the efficiency of three coupling strategies in terms of cost overhead w.r.t. the flow solver. We analyze the role of the solution remap necessary to evaluate the error monitor controlling the adaptation, and propose simplified formulations allowing a reduction in computational cost. The resulting ALE algorithm is compared with the rezoning Eulerian approach with interpolation proposed e.g. in Tang and Tang [17]. An alternative cost effective Eulerian approach, still allowing a full decoupling between adaptation and flow evolution steps is also proposed. Finally, a thorough numerical evaluation of the methods discussed is performed. Numerical results on propagation, and inundation problems shows that the best compromise between accuracy and CPU time is provided by a full ALE formulation. If a loose coupling with the mesh adaptation is sought, then the cheaper Eulerian approach proposed is shown to provide results quite close to the ALE.","authors":["Luca Arpaia","Mario Ricchiuto"],"meta":["October 2017Computers & Fluids 160","DOI:10.1016/j.compfluid.2017.10.026","Project: Tsunamis in the Atlantic and the English ChaNnel Definition of the Effects through numerical Modeling"],"references":["309431178_An_interpolation-free_two-dimensional_conservative_ale_scheme_over_adaptive_unstructured_grids_for_rotorcraft_aerodynamics","280680496_A_flexible_genuinely_nonlinear_approach_for_wave_propagation_breaking_and_runup","257292092_An_ALE_Formulation_for_Explicit_Runge-Kutta_Residual_Distribution","306123655_Central_schemes_for_balance_laws_Hyperbolic_problems_Theory_numerics_applications_Vol_I_II_Magdeburg_2000","267164874_Adaptive_finite_volume_methods_for_hyperbolic_problems","263894975_A_method_for_computing_curved_meshes_via_the_linear_elasticity_analogy","260922953_Numerical_treatment_of_wave_breaking_on_unstructured_finite_volume_approximations_for_extended_Boussinesq-type_equations","260833526_A_well-balanced_stable_generalized_Riemann_problem_scheme_for_shallow_water_equations_using_adaptive_moving_unstructured_triangular_meshes","258816518_An_adaptive_moving_finite_volume_scheme_for_modeling_flood_inundation_over_dry_and_complex_topography","257592413_A_High-Order_Moving_Mesh_Kinetic_Scheme_Based_on_WENO_Reconstruction_for_Compressible_Flows_on_Unstructured_Meshes"]}