{"id":"320692629_Challenges_and_Pitfalls_on_Surveying_Evidence_in_the_Software_Engineering_Technical_Literature_an_Exploratory_Study_with_Novices","abstract":"The evidence-based software engineering approach advocates the use of evidence from empirical studies to support the decisions on the adoption of software technologies by practitioners in the software industry. To this end, many guidelines have been proposed to contribute to the execution and repeatability of literature reviews, and to the confidence of their results, especially regarding systematic literature reviews (SLR). To investigate similarities and differences, and to characterize the challenges and pitfalls of the planning and generated results of SLR research protocols dealing with the same research question and performed by similar teams of novice researchers in the context of the software engineering field. We qualitatively compared (using Jaccard and Kappa coefficients) and evaluated (using DARE) same goal SLR research protocols and outcomes undertaken by similar research teams. Seven similar SLR protocols regarding quality attributes for use cases executed in 2010 and 2012 enabled us to observe unexpected differences in their planning and execution. Even when the participants reached some agreement in the planning, the outcomes were different. The research protocols and reports allowed us to observe six challenges contributing to the divergences in the results: researchers’ inexperience in the topic, researchers’ inexperience in the method, lack of clearness and completeness of the papers, lack of a common terminology regarding the problem domain, lack of research verification procedures, and lack of commitment to the SLR. According to our findings, it is not possible to rely on results of SLRs performed by novices. Also, similarities at a starting or intermediate step during different SLR executions may not directly translate to the next steps, since non-explicit information might entail differences in the outcomes, hampering the repeatability and confidence of the SLR process and results. Although we do have expectations that the presence and follow-up of a senior researcher can contribute to increasing SLRs’ repeatability, this conclusion can only be drawn upon the existence of additional studies on this topic. Yet, systematic planning, transparency of decisions and verification procedures are key factors to guarantee the reliability of SLRs.","authors":["Talita Vieira Ribeiro","Jobson Luiz Massolar da Silva","Guilherme Horta Travassos"],"meta":["June 2018Empirical Software Engineering 23(3)","DOI:10.1007/s10664-017-9556-7"],"references":["311582945_On_the_Pragmatic_Design_of_Literature_Studies_in_Software_Engineering_An_Experience-based_Guideline","303743794_Industry-academia_collaborations_in_software_testing_experience_and_success_stories_from_Canada_and_Turkey","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","336587522_Using_systematic_reviews_and_evidence-based_software_engineering_with_masters_students","336586053_On_Searching_Relevant_Studies_in_Software_Engineering","336585489_Experiences_Conducting_Systematic_Reviews_from_Novices'_Perspective","336573400_Systematic_Mapping_Studies_in_Software_Engineering","280972002_A_conceptual_framework_of_challenges_and_solutions_for_managing_global_software_maintenance","279313441_Adoption_of_OSS_components_A_goal-oriented_approach","275156960_Guidelines_for_conducting_systematic_mapping_studies_in_software_engineering_An_update","266661825_Writing_for_synthesis_of_evidence_in_empirical_software_engineering","266658763_Outcomes_of_a_community_workshop_to_identify_and_rank_barriers_to_the_systematic_literature_review_process","264427611_Performing_Systematic_Literature_Reviews_With_Novices_An_Iterative_Approach","260734268_Repeatability_of_systematic_literature_reviews"]}