{"id":"320669646_An_ELU_Network_with_Total_Variation_for_Image_Denoising","abstract":"In this paper, we propose a novel convolutional neural network (CNN) for image denoising, which uses exponential linear unit (ELU) as the activation function. We investigate the suitability by analyzing ELU’s connection with trainable nonlinear reaction diffusion model (TNRD) and residual denoising. On the other hand, batch normalization (BN) is indispensable for residual denoising and convergence purpose. However, direct stacking of BN and ELU degrades the performance of CNN. To mitigate this issue, we design an innovative combination of activation layer and normalization layer to exploit and leverage the ELU network, and discuss the corresponding rationale. Moreover, inspired by the fact that minimizing total variation (TV) can be applied to image denoising, we propose a TV regularized L2 loss to evaluate the training effect during the iterations. Finally, we conduct extensive experiments, showing that our model outperforms some recent and popular approaches on Gaussian denoising with specific or randomized noise levels for both gray and color images.","authors":["Tianyang Wang","Zhengrui Qin","Michelle Zhu"],"meta":["October 2017","DOI:10.1007/978-3-319-70090-8_24","Conference: International Conference on Neural Information Processing"],"references":["319769813_Fast_and_Accurate_Deep_Network_Learning_by_Exponential_Linear_Units_ELUs","310610773_Non-Local_Color_Image_Denoising_with_Convolutional_Neural_Networks","329394352_Deep_residual_learning_in_CT_physics_scatter_correction_for_spectral_CT","320971178_Non-local_Color_Image_Denoising_with_Convolutional_Neural_Networks","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","319121957_Deep_residual_learning_in_CT_physics_scatter_correction_for_spectral_CT","311609041_Deep_Residual_Learning_for_Image_Recognition","310752071_Natural_image_denoising_with_convolutional_networks"]}