{"id":"320665798_A_Preliminary_Instrument_for_Measuring_Students'_Subjective_Perceptions_of_Difficulties_in_Learning_Recursion","abstract":"Contribution: Findings are provided from an initial survey to evaluate the magnitude of the recursion problem from the student point of view. Background: A major difficulty that programming students must overcome-the learning of recursion-has been addressed by many authors, using various approaches, but none have considered how students perceive this issue. Research Questions: 1) How can an instrument be developed to characterize the main difficulties students encounter, from their subjective perspective, when learning recursion? and 2) How can the quality of the developed instrument be determined? Methodology: 1) A development process was followed to create the instrument. This process included justification of the content, and a quality analysis of the instrument in terms of validity and reliability and 2) the study was on a limited number of students, so should be regarded as preliminary with respect to validity and reliability of results. Findings: 1) An initial survey indicates the magnitude of the recursion problem from the students' point of view; 2) students' perception is that neither motivation, nor their previous knowledge of theoretical concepts on recursion, are factors that affect their learning of the recursion process; and 3) for further statistical analysis, data from a simplified survey proved more valid and more reliable than that from the original survey, for the study sample examined.","authors":["Carmen Lacave","Ana Isabel Molina Díaz","Miguel A. Redondo"],"meta":["October 2017IEEE Transactions on Education PP(99):1-8","DOI:10.1109/TE.2017.2758346"],"references":["285751710_Model_Fit_and_Model_Selection_in_Structural_Equation_Modeling","282520611_Recursion_Removal_as_an_Instructional_Method_to_Enhance_the_Understanding_of_Recursion_Tracing","268278854_A_Survey_on_the_Teaching_and_Learning_of_Recursive_Programming","263916111_Evaluating_the_Use_of_Exploratory_Factor_Analysis_in_Psychological_Research","254345399_Reporting_Structural_Equation_Modeling_and_Confirmatory_Factor_Analysis_Results_A_Review","247728606_Use_of_Exploratory_Factor_Analysis_in_Published_ResearchCommon_Errors_and_Some_Comment_on_Improved_Practice","311476604_Students'_mental_models_of_recursion_at_wits","311476208_Recursion_in_gradual_steps_is_recursion_really_that_difficult","250755297_Validity_Foundational_Issues_and_Statistical_Methodology","239576855_Conceptual_models_individual_cognitive_learning_styles_in_teaching_recursion_to_novices"]}