{"id":"320761235_Employability_Capital_A_Conceptual_Framework_Tested_Through_Expert_Analysis","abstract":"Previous research attempted to identify personal resources that promote employability, that is, an individual’s chance to find and maintain employment. This has resulted in a large number of different personal resources, which are not always clearly differentiated from one another and often seem to—at least partially—overlap conceptually and/or empirically. In response, we aim at conceptual clarification and integration of what we coin “employability capital”. Based on a literature review, we developed a conceptual framework that integrates the various facets. Two types of distinctions were found: (a) an employability distinction, which differentiates between job-related, career-related, and development-related employability capital, and (b) a capital distinction, which differentiates between human capital (more specifically knowledge, skills, and attitudes) and social capital. We performed a Q-sorting study in which items of existing measurements were mapped onto the conceptual framework by subject matter experts. Overall, we found support for the conceptual framework.","authors":["Ellen Peeters","Jill Nelissen","Nele De Cuyper","Anneleen Forrier"],"meta":["October 2017Journal of Career Development 46(2):089484531773186","DOI:10.1177/0894845317731865"],"references":["264399529_The_Psychology_of_Working_A_New_Framework_for_Counseling_Practice_and_Public_Policy","263286076_Defining_perceived_employability_A_psychological_approach","258199021_The_Concept_of_Employability","304579116_Employability_skills_the_conceptual_framework_scale_development","297203397_The_Psychology_of_Working_Theory","275032633_Three_Way_Scaling_and_Clustering","271692724_Social_Capital_and_Successful_Development_Among_At-Risk_Youth","270249586_The_Psychology_of_Careers_An_Introduction_to_Vocational_Development","264656071_Career_Adaptability_An_Integrative_Construct_for_Life-Span_Life-Space_Theory","263553368_Management_of_Employability_in_The_Netherlands"]}