{"id":"320785892_Automatic_controversy_detection_in_social_media_A_content-independent_motif-based_approach","abstract":"Online social networks are becoming the primary medium by which people get informed, as they provide a forum for expressing ideas, contributing to public debates, and participating in opinion-formation processes. Among the topics discussed in Social Media, some lead to controversy.\nIdentifying controversial topics is useful for exploring the space of public discourse and understanding the issues of current interest. Thus, a number of recent studies have focused on the problem of identifying controversy in social media mostly based on the analysis of textual content or rely on global network structure. Such approaches have strong limitations due to the difficulty of understanding natural language, especially in short texts, and of investigating the global network structure.\nIn this work, we show that it is possible to detect controversy in social media by exploiting network motifs, i.e., local patterns of user interaction. The proposed approach allows for a language-independent and fine-grained analysis of user discussions and their evolution over time. Network motifs can be easily extracted both from user interactions and from the underlying social network, and they are conceptually simple to define and very efficient to compute. We assess the predictive power of motifs on a manually labeled twitter dataset. In fact, a supervised model exploiting motif patterns can achieve 85% accuracy, with an improvement of 7% compared to baseline structural, propagation-based and temporal network features. Finally, thanks to the locality of motif patterns, we show that it is possible to monitor the evolution of controversy in a conversation over time thus discovering changes in user opinion.","authors":["Mauro Coletto","Kiran Garimella","Aristides Gionis","Claudio Lucchese"],"meta":["October 2017Online Social Networks and Media 3-4:22-31","DOI:10.1016/j.osnem.2017.10.001"],"references":["302917412_Reply_trees_in_Twitter_data_analysis_and_branching_process_models","274398233_Measuring_Political_Polarization_Twitter_shows_the_two_sides_of_Venezuela","269763620_Conversation_Emotional_Modeling_in_Social_Networks","266147376_Partisan_Sharing_Facebook_Evidence_and_Societal_Consequences","262320857_Detecting_controversy_on_the_web","261201106_The_Role_of_Social_Media_in_the_Discussion_of_Controversial_Topics","258055556_The_Anatomy_of_a_Scientific_Rumor","221451360_Identifying_Controversial_Issues_and_Their_Sub-topics_in_News_Articles","220766457_Mining_Large_Networks_with_Subgraph_Counting","11063289_Network_Motifs_Simple_Building_Blocks_of_Complex_Networks","311490351_Quantifying_Controversy_in_Social_Media","305037467_Higher-order_organization_of_complex_networks","303401709_Polarized_User_and_Topic_Tracking_in_Twitter","301404085_Detecting_Disagreement_in_Conversations_using_Pseudo-Monologic_Rhetorical_Structure","266261701_Controversy_and_Sentiment_in_Online_News","262235654_Reconstruction_and_analysis_of_Twitter_conversation_graphs","254072973_When_Why_and_How_Controversy_Causes_Conversation","221101683_Robust_Sentiment_Detection_on_Twitter_from_Biased_and_Noisy_Data","45854744_Community_Detection_in_Graphs","2930322_The_Link_Prediction_Problem_for_Social_Networks"]}