{"id":"320766135_TRRUST_v2_An_expanded_reference_database_of_human_and_mouse_transcriptional_regulatory_interactions","abstract":"Transcription factors (TFs) are major trans-acting factors in transcriptional regulation. Therefore, elucidating TF-target interactions is a key step toward understanding the regulatory circuitry underlying complex traits such as human diseases. We previously published a reference TF-target interaction database for humans-TRRUST (Transcriptional Regulatory Relationships Unraveled by Sentence-based Text mining)-which was constructed using sentence-based text mining, followed by manual curation. Here, we present TRRUST v2 (www.grnpedia.org/trrust) with a significant improvement from the previous version, including a significantly increased size of the database consisting of 8444 regulatory interactions for 800 TFs in humans. More importantly, TRRUST v2 also contains a database for TF-target interactions in mice, including 6552 TF-target interactions for 828 mouse TFs. TRRUST v2 is also substantially more comprehensive and less biased than other TF-target interaction databases. We also improved the web interface, which now enables prioritization of key TFs for a physiological condition depicted by a set of user-input transcriptional responsive genes. With the significant expansion in the database size and inclusion of the new web tool for TF prioritization, we believe that TRRUST v2 will be a versatile database for the study of the transcriptional regulation involved in human diseases.","authors":["Heonjong Han","Jae-Won Cho","Sangyoung Lee","Ayoung Yun"],"meta":["October 2017Nucleic Acids Research 46(Database issue)","DOI:10.1093/nar/gkx1013"],"references":["313178542_From_sequencing_data_to_gene_functions_co-functional_network_approaches","308125827_Multimodal_assessment_of_oestrogen_receptor_mRNA_profiles_to_quantify_oestrogen_pathway_activity_in_breast_tumours","305376646_Database_resources_of_the_National_Center_for_Biotechnology_Information","283470172_MouseNet_v2_A_database_of_gene_networks_for_studying_the_laboratory_mouse_and_eight_other_model_vertebrates","279219584_TRRUST_A_reference_database_of_human_transcriptional_regulatory_interactions","277962654_TP53_transcription_factor_for_the_NEDD9HEF1Cas-L_gene_potential_targets_in_Non-Small_Cell_Lung_Cancer_treatment","268788184_Conservation_of_trans-acting_networks_during_mammalian_regulatory_evolution","258445480_Current_status_and_new_features_of_the_Consensus_Coding_Sequence_database","229426688_CITED2_functions_as_a_molecular_switch_of_cytokine-induced_proliferation_and_quiescence","306157501_Database_resources_of_the_National_Center_for_Biotechnology_Information"]}