{"id":"320722731_Distributed_Manufacturing_of_Flexible_Products_Technical_Feasibility_and_Economic_Viability","abstract":"Distributed manufacturing even at the household level is now well established with the combined use of open source designs and self-replicating rapid prototyper (RepRap) 3-D printers. Previous work has shown substantial economic consumer benefits for producing their own polymer products. Now flexible filaments are available at roughly 3-times the cost of more conventional 3-D printing materials. To provide some insight into the potential for flexible filament to be both technically feasible and economically viable for distributed digital manufacturing at the consumer level this study investigates 20 common flexible household products. The 3-D printed products were quantified by print time, electrical energy use and filament consumption by mass to determine the cost to fabricate with a commercial RepRap 3-D printer. Printed parts were inspected and when necessary tested for their targeted application to ensure technical feasibility. Then, the experimentally measured cost to DIY manufacturers was compared to low and high market prices for comparable commercially available products. In addition, the mark-up and potential for long-term price declines was estimated for flexible filaments by converting thermoplastic elastomer (TPE) pellets into filament and reground TPE from a local recycling center into filament using an open source recyclebot. This study found that commercial flexible filament is economically as well as technically feasible for providing a means of distributed home-scale manufacturing of flexible products. The results found a 75% savings when compared to the least expensive commercially equivalent products and 92% when compared to high market priced products. Roughly, 160 flexible objects must be substituted to recover the capital costs to print flexible materials. However, as previous work has shown the Lulzbot Mini 3-D printer used in this study would provide more than a 100% ROI printing one object a week from hard thermoplastics, the upgrade needed to provide flexible filament capabilities can be accomplished with 37 average substitution flexible prints. This, again easily provides a triple digit return on investment printing one product a week. Although these savings, which are created by printing objects at home are substantial, the results also have shown the savings could be further increased to 93% when the use of a pellet extruder and TPE pellets, and 99% if recycled TPE filament made with a recyclebot is used. The capital costs of a recyclebot can be recovered in the manufacturing of about 9 kg of TPE filament, which can be accomplished in less than a week, enabling improved environmental impact as well as a strong financial return for heavy 3-D printer users.","authors":["Aubrey L. Woern","Joshua M Pearce"],"meta":["October 2017","DOI:10.3390/technologies5040071"],"references":["331491939_Environmental_Impacts_of_Distributed_Manufacturing_from_3-D_Printing_of_Polymer_Components_and_Products","322174293_Tightening_the_loop_on_the_circular_economy_Coupled_distributed_recycling_and_manufacturing_with_recyclebot_and_RepRap_3-D_printing","318922042_Polymer_Recycling_and_Additive_Manufacturing_in_an_Open_Source_context_Optimization_of_processes_and_methods","318921880_Polymer_Recycling_in_an_Open-Source_Additive_Manufacturing_Context_Mechanical_Issues","318581967_Impact_of_DIY_Home_Manufacturing_with_3D_Printing_on_the_Toy_and_Game_Market","318215368_Three_Hundred_and_Sixty_Degree_Real-Time_Monitoring_of_3-D_Printing_Using_Computer_Analysis_of_Two_Camera_Views","318174889_Factors_effecting_real-time_optical_monitoring_of_fused_filament_3D_printing","317608191_Open_Source_Multi-Head_3D_Printer_for_Polymer-Metal_Composite_Component_Manufacturing","317608187_Energy_Payback_Time_of_a_Solar_Photovoltaic_Powered_Waste_Plastic_Recyclebot_System","322633752_This_home_is_a_factory_Implications_of_the_Maker_movement_on_urban_environments"]}