{"id":"320759897_Education_on_Programming_with_Robots_Examining_Students'_Experiences_and_Views","abstract":"The present study aimed to determine the success and views of students\nreceiving education on programming with robots. In the study, which was carried\nout with the mixed research method, the data were collected via a creative\nproblem-solving test, applied performance evaluation test for programming with\nrobots, a semi-structured interview form. The creative problem-solving skills\ntest was taken from PISA 2012 conducted by OECD. The study was carried out with\n9 secondary school students. In the application process, first, the students\nwere asked to fill in the creative problem-solving test. The creative\nproblem-solving test included interactive simulations in online environment and\nquestions regarding these simulations. Following this, the students were given education\non programming with robots for one week. At the end of this education, a\nperformance evaluation test regarding this education was given. Lastly, an\ninterview form was used to determine the students’ views about the activity\ncarried out. Consequently, depending on the results of the applied performance\nevaluation test, the education could be said to be beneficial. As a result of\nthe correlation test conducted, a moderate level of positive significant\nrelationship was found between the students’ creative problem-solving skills\nand their performance scores. When the students’ responses to the interview\nquestions were examined, it was revealed that the students generally had positive attitudes and that\nthe education given was motivating and entertaining and contributed to their\nlearning of programming.","authors":["Serkan Çankaya","Gürhan Durak","Eyup Yünkül"],"meta":["October 2017Turkish Online Journal of Qualitative Inquiry 8(4):428-445","DOI:10.17569/tojqi.343218"],"references":["297721040_Computer_science_CS_in_the_compulsory_education_curriculum_Implications_for_future_research","288122153_Technology_Based_Learning_in_Science_and_Technology_Education_Robotic_Applications_Fen_ve_Teknoloji_Egitiminde_Teknoloji_Tabanli_Ogrenme_Robotik_Uygulamalari","273328888_Exploring_Issues_About_Computational_Thinking_in_Higher_Education","266317586_Motivating_programming_students_by_Problem_Based_Learning_and_LEGO_robots","312430263_The_Effect_of_Lego_Mindstrom_Eve_3_Based_Design_Activities_on_Students'_Attitudes_towards_Learning_Computer_Programming_Self-efficacy_Beliefs_and_Levels_of_Academic_Achievement","293225278_Public_education_for_science_and_technology","288525740_Research_design_Qualitative_quantitative_and_mixed_methods_approaches","283895348_RoboCupJunior_for_promoting_STEM_education_21st_century_skills_and_technological_advancement_through_robotics_competition","277374591_Lowering_the_barriers_to_programming","273352192_Experiences_Incorporating_Lego_Mindstorms_Robots_in_the_Basic_Programming_Syllabus_Lessons_Learned"]}