{"id":"320771890_Feature_Selection_Optimization_Based_on_Atomic_Set_and_Genetic_Algorithm_in_Software_Product_Line","abstract":"Software product line (SPL) engineering is an effective method to improve the software development process in terms of development costs and time-to-market by using comprehensive software reuse technology. The feature model is a demand model that describes the common and variability of software product family and the relationship between features in SPL engineering. The difficulty of product configuration based on the feature model is how to choose the optimal combination of features from the complex feature model to satisfy the constraints. In order to achieve the problem of constrained feature selection optimization, we propose a method based on atomic set and a genetic algorithm to optimize feature selection. Firstly, the feature model is optimized by using the atomic set algorithm. Then, the whole constraints of the model are modeled as the evaluation function of the effective and invalid configuration in the genetic algorithm. Finally, by the genetic operations of combining the effective configuration and the invalid configuration, such as crossover, selection and mutation, it selects the best effective configuration for output.","authors":["Zhijuan Zhan","Weilin Luo","Zonghao Guo","Yumei Liu"],"meta":["June 2018Advances in Intelligent Systems and Computing","DOI:10.1007/978-3-319-69096-4_14","Conference: International Conference on Intelligent and Interactive Systems and Applications"],"references":["224259625_Optimizing_the_Product_Derivation_Process","223760542_Automated_analysis_of_feature_models_20_years_later_A_literature_review","221321173_SPLOT_-_Software_product_lines_online_tools","221001988_Decision-making_coordination_in_collaborative_product_configuration","220789605_Automated_Analysis_of_Feature_Models_Using_Atomic_Sets","215588360_Feature_Diagrams_A_Survey_and_A_Formal_Semantics","261192670_On_the_value_of_user_preferences_in_search-based_software_engineering_A_case_study_in_software_product_lines","221948417_Generic_semantics_of_feature_diagrams","220693462_Software_Product_Line_Engineering_Foundations_Principles_and_Techniques","220377540_A_genetic_algorithm_for_optimized_feature_selection_with_resource_constraints_in_software_product_lines","4277635_Automating_Product-Line_Variant_Selection_for_Mobile_Devices"]}