{"id":"320726911_Social_Network_De-anonymization_More_Adversarial_Knowledge_More_Users_Re-Identified","abstract":"Following the trend of data trading and data publishing, many online social networks have enabled potentially sensitive data to be exchanged or shared on the web. As a result, users' privacy could be exposed to malicious third parties since they are extremely vulnerable to de-anonymization attacks, i.e., the attacker links the anonymous nodes in the social network to their real identities with the help of background knowledge. Previous work in social network de-anonymization mostly focuses on designing accurate and efficient de-anonymization methods. We study this topic from a different perspective and attempt to investigate the intrinsic relation between the attacker's knowledge and the expected de-anonymization gain. One common intuition is that the more auxiliary information the attacker has, the more accurate de-anonymization becomes. However, their relation is much more sophisticated than that. To simplify the problem, we attempt to quantify background knowledge and de-anonymization gain under several assumptions. Our theoretical analysis and simulations on synthetic and real network data show that more background knowledge may not necessarily lead to more de-anonymization gain in certain cases. Though our analysis is based on a few assumptions, the findings still leave intriguing implications for the attacker to make better use of the background knowledge when performing de-anonymization, and for the data owners to better measure the privacy risk when releasing their data to third parties.","authors":["Jianwei Qian","Xiang-Yang Li","Yu Wang","Shaojie Tang"],"meta":["October 2017ACM Transactions on Internet Technology 19(3)","DOI:10.1145/3310363","Project: Social Network De-Anonymization and Privacy Inference with Knowledge Graph Model"],"references":["325830420_AccountTrade_Accountability_Against_Dishonest_Big_Data_Buyers_and_Sellers","322993280_Towards_Privacy-Preserving_Speech_Data_Publishing","316468427_Social_Network_De-Anonymization_and_Privacy_Inference_with_Knowledge_Graph_Model","304670616_Graph-Based_Privacy-Preserving_Data_Publication","304668936_De-anonymizing_Social_Networks_and_Inferring_Private_Attributes_Using_Knowledge_Graphs","328545004_Can_China_lead_the_development_of_data_trading_and_sharing_markets","328370417_Social_Network_De-anonymization_with_Overlapping_Communities_Analysis_Algorithm_and_Experiments","313609388_On_the_evolution_of_random_graphs","305526922_Subgraph_Counting_Color_Coding_Beyond_Trees","304007758_L-diversity_Privacy_beyond_k-AnonymityJ"]}