{"id":"320734672_Linked_USDL_Extension_for_Describing_Business_Services_and_Users'_Requirements_in_a_Cloud_Context","abstract":"Linked Unified Service Description Language (Linked USDL) provides a comprehensive description of a service from an operational, technical, and business perspectives. However, existing service description languages like WSDL and Linked USDL treat services as isolated components that offer functionalities but overlook aspects like how services will be used. In this paper, we extend Linked USDL to describe a marketplace of services so that provisioning service-oriented cloud-based business applications is automated. The marketplace consists of business services and specialized services acting on behalf of an infrastructure (aka IaaS). The former constitute the business application. The latter represent the environment upon which a generated business application will be deployed. To ease the technical provisioning from a user’s perspective, Linked USDL is extended with a set of vocabulary terms that describe the use to be made of marketplace’s services, such as the services with which they have to be composed, on which environment they have to be deployed. A set of experiments demonstrating the use of Linked USDL are also presented in the paper.","authors":["Hind Benfenatki","Catarina Ferreira da Silva","Aïcha-Nabila Benharkat","P. Ghodous"],"meta":["July 2017International Journal of Systems and Service-Oriented Engineering 7(3):15-31","DOI:10.4018/IJSSOE.2017070102","Project: cloud computing"],"references":["308092508_MADONA_a_method_for_automated_provisioning_of_cloud-based_component-oriented_business_applications","289804238_On_engineering_cloud_applications_-_state_of_the_art_shortcomings_analysis_and_approach","287358653_Web_Service_Composition","266657308_Consumer-centric_non-functional_properties_of_SOA-based_services","264464218_Cloud_Services_Discovery_and_Selection_Survey_and_New_Semantic-Based_System","262367379_A_request_oriented_model_for_web_services","306033327_An_ontology-based_requirement_modeling_for_interactive_software_customization","279963439_Evolution_and_overview_of_linked_USDL","279402966_TOSCA_Portable_Automated_Deployment_and_Management_of_Cloud_Applications","262402093_Cloud_computing_automation_integrating_USDL_and_TOSCA"]}