{"id":"320796712_Proving_Soundness_of_Extensional_Normal-Form_Bisimilarities","abstract":"Normal-form bisimilarity is a simple, easy-to-use behavioral equivalence that relates terms in lambda-calculi by decomposing their normal forms into bisimilar subterms. Besides, they allow for powerful up-to techniques, such as bisimulation up to context, which simplify bisimulation proofs even further. However, proving soundness of these relations becomes complicated in the presence of eta-expansion and usually relies on ad hoc proof methods which depend on the language. In this paper we propose a more systematic proof method to show that an extensional normal-form bisimilarity along with its corresponding bisimulation up to context are sound. We illustrate our technique with three calculi: the call-by-value lambda-calculus, the call-by-value lambda-calculus with the delimited-control operators shift and reset, and the call-by-value lambda-calculus with the abortive control operators call/cc and abort. In the first two cases, there was previously no sound bisimulation up to context validating the eta-law, whereas no theory of normal-form bisimulations for the calculus of abortive control has been presented before. Our results have been fully formalized in the Coq proof assistant.","authors":["Dariusz Biernacki","Serguei Lenglet","Piotr Polesiuk"],"meta":["October 2017Electronic Notes in Theoretical Computer Science 336","DOI:10.1016/j.entcs.2018.03.015"],"references":["324717223_Bisimulations_for_Delimited-Control_Operators","311475239_Reasoning_about_programs_in_continuation-passing_style","281603089_Higher-order_languages_dualities_and_bisimulation_enhancements","268163977_Bisimulations_Up-to_Beyond_First-Order_Transition_Systems","265371850_Enhancements_of_the_bisimulation_proof_method","243536627_X-calculus_models_of_programming_languages","242435377_The_Lambda_Calculus_Its_Syntax_and_Semantics","224646976_Head_Normal_Form_Bisimulation_for_Pairs_and_the_lambdamu-Calculus","222677235_On_the_Static_and_Dynamic_Extents_of_Delimited_Continuations","222450542_Hieb_R_The_revised_report_on_the_syntactic_theories_of_sequential_control_and_state_Theorectical_Computer_Science_1032_235-271"]}