{"id":"320760026_Broadening_participation_in_computing_Examining_experiences_of_girls_of_color","abstract":"In order to enhance participation in computer science for girls of color, this study examines the outcomes of a rigorous out-of-school culturally relevant computer science intervention designed to engage underrepresented students in computing. Findings demonstrated that withinrace gender differences exist in early interest in computing. Female students of color demonstrated significantly lower engagement and interest in computing, suggesting that being a member of a marginalized gender group plays a unique role and has a multiplying (negative) effect. Further, there were still significant gender differences in computing engagement after participation in one summer of the computer science intervention. Promising outcomes were revealed among a group of students who chose to enroll in the optional Advanced Placement CS A preparatory course; there were no gender differences in enrollment and completion of the course. In examining longitudinal outcomes, gender is a significant predictor of majoring in computer science in college, with male students much more likely to major in computer science than female students. These findings have important implications for addressing the gender gap in computing, including understanding how the intersection of race and gender presents unique barriers and challenges for women of color in computing, and that interventions to broaden participation in computing must address the unique experiences of women of color.","authors":["Allison Scott","Alexis Martin","Frieda Mcalear","Sonia Koshy"],"meta":["October 2017ACM Inroads 8(4):48-52","DOI:10.1145/3149921"],"references":["323402194_Is_the_Gender_Gap_Narrowing_in_Science_and_Engineering","279676094_Toward_a_Critical_Race_Theory_of_Education","229361653_Digital_Gender_Divide_or_Technologically_Empowered_Women_in_Developing_Countries_A_Typical_Case_of_Lies_Damned_Lies_and_Statistics","303206149_Inside_the_double_bind_A_synthesis_of_empirical_research","302930119_Mapping_the_margins_Intersectionality_identity_politics_and_violence_against_women_of_color","277928425_Inside_the_Double_Bind_A_Synthesis_of_Empirical_Research_on_Undergraduate_and_Graduate_Women_of_Color_in_Science_Technology_Engineering_and_Mathematics","273937428_Understanding_Everyday_Racism_An_Interdisciplinary_Theory","263537621_Mapping_the_Margins_Intersectionality_Identity_Politics_and_Violence_Against_Women_of_Color","220613020_Women_in_computing_around_the_world","220094547_Exploring_Computer_Science_A_Case_Study_of_School_Reform"]}