{"id":"320727546_Modular_Labelled_Sequent_Calculi_for_Abstract_Separation_Logics","abstract":"separation logics are a family of extensions of Hoare logic for reasoning about programs that manipulate resources such as memory locations. These logics are “abstract” because they are independent of any particular concrete resource model. Their assertion languages, called Propositional Abstract Separation Logics (PASLs), extend the logic of (Boolean) Bunched Implications (BBI) in various ways. In particular, these logics contain the connectives * and –*, denoting the composition and extension of resources, respectively.\nThis added expressive power comes at a price, since the resulting logics are all undecidable. Given their wide applicability, even a semi-decision procedure for these logics is desirable. Although several PASLs and their relationships with BBI are discussed in the literature, the proof theory of, and automated reasoning for, these logics were open problems solved by the conference version of this article, which developed a modular proof theory for various PASLs using cut-free labelled sequent calculi. This paper non-trivially improves upon this previous work by giving a general framework of calculi on which any new axiom in the logic satisfying a certain form corresponds to an inference rule in our framework, and the completeness proof is generalised to consider such axioms.\nOur base calculus handles Calcagno et al.’s original logic of separation algebras by adding sound rules for partial-determinism and cancellativity, while preserving cut-elimination. We then show that many important properties in separation logic, such as indivisible unit, disjointness, splittability, and cross-split, can be expressed in our general axiom form. Thus, our framework offers inference rules and completeness for these properties for free. Finally, we show how our calculi reduce to calculi with global label substitutions, enabling more efficient implementation.","authors":["Zhe Hou","Ranald Clouston","Rajeev Goré","Alwen Tiu"],"meta":["October 2017ACM Transactions on Computational Logic 19(2)","DOI:10.1145/3197383"],"references":["325033407_Automatic_cyclic_termination_proofs_for_recursive_procedures_in_separation_logic","318337685_Proof_Tactics_for_Assertions_in_Separation_Logic","318130157_Separation_Logic_with_One_Quantified_Variable","312589410_Labelled_Sequent_Calculi_and_Automated_Reasoning_for_Assertions_in_Separation_Logic","346088086_High-level_separation_logic_for_low-level_code","340427235_A_proof_system_for_separation_logic_with_magic_wand","340421919_Parametric_completeness_for_separation_theories","323335675_Undecidability_of_Propositional_Separation_Logic_and_Its_Neighbours","319394028_First-Order_Logic_and_Automated_Theorem_Proving","316183702_A_decision_procedure_for_satisfiability_in_separation_logic_with_inductive_predicates"]}