{"id":"320717600_Conducting_Analysis_in_Institutional_Ethnography_Guidance_and_Cautions","abstract":"Institutional ethnography (IE) is being taken up by researchers across diverse disciplines, many who do not have a background in sociology and the antecedents and influences that underpin Dorothy Smith’s distinctive IE method. Novice IEers, who often work with advisors who have not studied or conducted an IE, are at risk of straying from IE’s core epistemology and ontology. This second of a two-volume set provides a broad overview to approaching analysis once the IE design and fieldwork are well under way. The purpose of two-volume series is to offer practical guidance and cautions that have been generated from my experiences of supervising graduate students and my involvement in reviewing and examining IE work that has gone “off track.” With a particular focus on the practicalities of conducting analysis, the paper includes examples of the application of IE’s theoretical framework with techniques for approaching and managing data: mapping, indexing, and building preliminary accounts/“analytic chunks.” I suggest these techniques are useful tactics to work with data and to refine the formulation of the research problematic(s) to be explicated.","authors":["Janet Rankin"],"meta":["December 2017The International Journal of Qualitative Methods 16(1):160940691773447","DOI:10.1177/1609406917734472"],"references":["320718184_Conducting_Analysis_in_Institutional_Ethnography_Analytical_Work_Prior_to_Commencing_Data_Collection","299545475_'You_Are_Here'_an_interview_with_Dorothy_E_Smith","349766342_Beginning_in_the_Standpoint_of_Women_An_Investigation_of_the_Gap_between_Cholas_and_'Women_in_Peru'","349765502_Accessing_Treatments_Managing_the_AIDS_Epidemic_in_Ontario","344486690_Outline_of_a_Theory_of_Practice","342007126_Writing_the_Social_Critique_Theory_and_Investigations","303423061_Incorporating_texts_into_institutional_ethnographies","303421448_Policing_the_gay_community_An_inquiry_into_textually-mediated_social_relations","292799877_The_everyday_world_as_problematic_A_feminist_methodology","285028875_Institutional_ethnography_Using_interviews_to_investigate_ruling_relations"]}