{"id":"320748838_Novice_programmer's_misconception_of_programming_reflected_on_problem-solving_plans","abstract":"Understanding the misconception of students is critical in that it identifies the reasons of errors students make and allows instructors to design instructions accordingly. This study investigated the mental models of programming concepts held by pre-service teachers who were novice in programming. In an introductory programming course, students were asked to solve problems that could be solved by utilizing conditional statements. They developed solution plans pseudo-code including a simplified natural language, symbols, diagrams, and so on. Sixteen solution plans of three different types of problems were analyzed. As a result, the students’ egocentric and insufficient programming concepts were identified in terms of the misuse of variables, redundancy of codes, and weak strategic knowledge. The results revealed that the students had difficulty designing solution plans that could be executed by computers. They needed instructional supports to master how to express their solution plans in the way computers run. Problem driven instructional designs for novice students were discussed.","authors":["Kyungbin Kwon"],"meta":["October 2017International Journal of Computer Science Education in Schools 1(4):14","DOI:10.21585/ijcses.v1i4.19","Project: Computer Science Education"],"references":["281226038_Five_Cs_Framework_A_Student-centered_Approach_for_teaching_programming_courses_to_students_with_diverse_disciplinary_background","274309848_Computational_Thinking","270397806_Closing_the_gender_gap_in_an_introductory_programming_course","316845053_Evaluating_the_Effectiveness_Roles_of_Variables_in_the_Novice_Programmers_Learning","278247546_Computer_Science_Is_Not_a_Science","271728118_Effects_of_Using_Alice_and_Scratch_in_an_Introductory_Programming_Course_for_Corrective_Instruction","270819375_Expertise_in_problem_solving","263848373_Paper-and-Pencil_Programming_Strategy_toward_Computational_Thinking_for_Non-Majors_Design_Your_Solution","256732680_Categories_of_programming_knowlege_and_their_application","247126256_Pedagogical_Changes_in_the_Delivery_of_the_First-Course_in_Computer_Science_Problem_Solving"]}