{"id":"320745308_The_role_of_gamification_in_activating_primary_school_students'_intrinsic_and_extrinsic_motivation_at_a_museum","abstract":"Internationally, the increased use of digital media by museums has turned them into dynamic learning centers, as far as culture, science, and learning are concerned. Despite the promise, gamification has not yet been strongly established in the educational arena, and its relationship with learning at museums is not yet clear. The purpose of this study was to investigate the impact of a gamified mobile learning environment on primary school students' motivation and learning. The participants of the study were 35 students, ages 10-11 years old, who visited a local archaeological museum. A pre-test post-test quasi-experimental research design was adopted, with two cohorts of students. The first cohort (n=18), which served as the control group, engaged in mobile learning at the museum without gamification, whereas the second cohort (n=17) was exposed to the same content using mobile devices, but following a gamified approach. A pre-test was given to both groups to assess initial knowledge and motivation prior to the visit to the museum; students' discourse and interactions during the visit were videotaped and analyzed; at the end of the visit, students completed a post-test. The analysis of the data examined the relation between gamification and students' learning gains and motivation in each condition. Results showed that the gamified approach contributed to the increase of students' extrinsic motivation, as well as to the improvement of their historical knowledge, but did not modify their intrinsic motivation with the exception of their interest. Implications of the study are discussed.","authors":["Ioanna Ioannou","Eleni Kyza"],"meta":["October 2017","DOI:10.1145/3136907.3136925","Conference: the 16th World Conference"],"references":["272368327_Cross_Fertilization_Between_Museums_and_Schools_Science_and_Art_History_and_Multimedia","270273830_Gamification_in_Education_A_Systematic_Mapping_Study","268294104_Digital_Competition_Game_to_Improve_Programming_Skills","264977730_A_Systematic_Mapping_on_Gamification_Applied_to_Education","259821680_Improving_Participation_and_Learning_with_Gamification","225743155_Ada_and_Grace_Toward_Realistic_and_Engaging_Virtual_Museum_Guides","221518895_Gamification_Using_game_design_elements_in_non-gaming_contexts","221410834_PerZoovasive_contextual_pervasive_QR_codes_as_tool_to_provide_an_adaptive_learning_support","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","278740214_Supporting_social_interaction_a_collaborative_trading_game_on_PDA","275141351_The_Mystery_Behind_the_Code_Differentiated_Instruction_with_Quick_Response_Codes_in_Secondary_Physical_Education","251930498_Learning_Historical_and_Cultural_Contents_via_Mobile_Treasure_Hunting_in_Five-Harbor_District_of_Tainan_Taiwan","230854793_The_Gamification_of_Learning_and_Instruction_Game-based_Methods_and_Strategies_for_Training_and_Eduction","216743170_The_What_and_Why_of_Goal_Pursuits_Human_Needs_and_the_Self-Determination_of_Behavior"]}