{"id":"320748640_The_effect_of_avatar_realism_in_immersive_social_virtual_realities","abstract":"This paper investigates the effect of avatar realism on embodiment and social interactions in Virtual Reality (VR). We compared abstract avatar representations based on a wooden mannequin with high fidelity avatars generated from photogrammetry 3D scan methods. Both avatar representations were alternately applied to participating users and to the virtual counterpart in dyadic social encounters to examine the impact of avatar realism on self-embodiment and social interaction quality. Users were immersed in a virtual room via a head mounted display (HMD). Their full-body movements were tracked and mapped to respective movements of their avatars. Embodiment was induced by presenting the users' avatars to themselves in a virtual mirror. Afterwards they had to react to a non-verbal behavior of a virtual interaction partner they encountered in the virtual space. Several measures were taken to analyze the effect of the appearance of the users' avatars as well as the effect of the appearance of the others' avatars on the users. The realistic avatars were rated significantly more human-like when used as avatars for the others and evoked a stronger acceptance in terms of virtual body ownership (VBO). There also was some indication of a potential uncanny valley. Additionally, there was an indication that the appearance of the others' avatars impacts the self-perception of the users.","authors":["Marc Erich Latoschik","Daniel Roth","Dominik Gall","Jascha Achenbach"],"meta":["November 2017","DOI:10.1145/3139131.3139156","Conference: the 23rd ACM Symposium","Projects: AvatarsSocial Virtual Reality"],"references":["315897703_Alpha_IVBO_-_Construction_of_a_Scale_to_Measure_the_Illusion_of_Virtual_Body_Ownership","309706975_SIAM-C_A_Socially_Immersive_Avatar_Mediated_Communication_Platform","309579238_FakeMi_A_Fake_Mirror_System_for_Avatar_Embodiment_Studies","289952482_Avatar_Realism_and_Social_Interaction_Quality_in_Virtual_Reality","282671174_Negotiation_as_a_Challenge_Problem_for_Virtual_Humans","272020072_Avatar_Anthropomorphism_and_Illusion_of_Body_Ownership_in_VR","266686192_How_to_Build_an_Embodiment_Lab_Achieving_Body_Representation_Illusions_in_Virtual_Reality","249649165_Illusory_Ownership_of_a_Virtual_child_body_causes_overestimation_of_object_sizes_and_implicit_attitude_changes","320743786_Fast_generation_of_realistic_virtual_humans","283813583_Collaboration_in_Immersive_and_Non-immersive_Virtual_Environments"]}