{"id":"320806012_La_grange_un_cadre_conceptuel_pour_apprehender_les_bouquets_de_services_rendus_par_l'elevage_dans_les_territoires","abstract":"L’élevage et les produits animaux sont souvent examinés par domaine (environnement, économie) ou par niveau d’organisation (exploitation agricole, filière, territoire, pays) si bien qu’il est difficile d’évaluer simultanément la diversité des services et impacts issus de l’élevage dans les territoires. En cohérence avec la littérature scientifique sur les systèmes socio-écologiques, nous avons représenté l’élevage et ses produits à l’interaction de trois systèmes (écologique, technique et social). Ceci permet d’identifier la diversité des facteurs (interactions biotiques, pratiques, modes d’organisation) à l’origine des impacts et des services rendus par l’élevage. Nous en avons ensuite dérivé une représentation simplifiée, « la grange » qui permet de visualiser l’élevage (l’usage des terres, les animaux…) et ses impacts ou services sur cinq interfaces (les intrants, l’environnement et le climat, les marchés, le travail et l’emploi, et les enjeux sociaux et culturels), et les synergies/antagonismes entre services au sein d’un territoire. Nous définissons ensuite différentes formes d’élevage afin de représenter la diversité de l’élevage entre territoires, et d’identifier différentes voies d’innovation pour augmenter ses services et réduire ses impacts. Celles-ci se distinguent par l’insertion des élevages dans les systèmes alimentaires (mondialisés vs territorialisés), ainsi que par l’autonomie en intrants pour l’alimentation des animaux. Cette classification est mobilisée pour introduire les différents cas d’études analysés dans ce numéro spécial.","authors":["Michel Duru","Catherine Donnars","Julie Ryschawy","Olivier Therond"],"meta":["November 2017Productions Animales -Paris- Institut National de la Recherche Agronomique- 30(4):273-284","Project: Role, impacts and services provided by European livestock production"],"references":["328158499_Enjeux_et_atouts_des_productions_animales_sous_signe_officiel_de_qualite_pour_repondre_aux_attentes_societales","328156806_Quelles_concurrences_et_synergies_entre_cultures_et_elevage_dans_les_territoires_de_polyculture-elevage","321753623_Les_bouquets_de_services_un_concept_cle_pour_raisonner_l'avenir_des_territoires_d'elevage","321753402_L'Irlande_un_territoire_porte_par_l'elevage_laitier_dans_des_conditions_de_milieu_favorable_et_de_marches_incertains","321622541_Des_services_contrastes_rendus_par_l'elevage_dans_les_espaces_urbains_et_periurbains_europeens","321533588_La_diversite_des_services_rendus_par_les_territoires_d'elevage_herbagers_fournissant_des_produits_de_qualite_dans_des_environnements_preserves","321369556_Diversite_des_services_rendus_par_les_territoires_a_forte_densite_d'elevages_trois_cas_d'etude_en_Europe","317370686_A_new_analytical_framework_of_farming_system_and_agriculture_model_diversities_A_review","316989007_Une_expertise_scientifique_collective_analyse_les_roles_impacts_et_services_issus_des_elevages_en_Europe","326988496_An_analytical_framework_for_structuring_analysis_and_design_of_sustainable_ruminant_livestock_systems"]}