{"id":"320820236_Determining_the_Gestation_Age_through_the_automated_measurement_of_the_bi-parietal_distance_in_fetal_ultrasound_images","abstract":"The proposed method has implemented series of steps. First the ratio of existing noise is reduced depending on Wiener Filter, followed by the stage of image borders removing in order to enrich high-density primary regions and suppress remaining ones. Thresholding stage has converted the image into a binary form, then the small foreground elements are removed in a binary image, after that the Skeletonization stage is applied in order to reduce the data points, then a matrix containing all data points which are lying on the target ellipse to be drawn. Detection of the ellipse corresponding to the limits of the fetus head in the input ultrasound image is done via the Least Square Fitting (LSF) algorithm, which returns the ellipse parameters including the minor axis which corresponds to the bi-parietal distance measure. The results of auto-measurements are compared with manual measurements of a specialist to improve the effective of the proposed method.","authors":["Mariam Saii","Zaid Kraitem"],"meta":["November 2017Ain Shams Engineering Journal 9(4)","DOI:10.1016/j.asej.2017.08.008","Projects: Determining the Gestation Age through the automated measurement of the bi-parietal distance in fetal ultrasound imagesPhD Project"],"references":["254584191_Direct_Least-Squares_Ellipse_Fitting","312612660_Fetal_biometry_at_14-40_weeks'_gestation","284218535_Fetal_Anomaly_Detection_in_Ultrasound_Image","256246046_Projection_filter_Wiener_filter_and_Karhunen-Loeve_subspaces_in_digital_image_restoration","246872016_Morphological_greyscale_reconstruction_in_image_analysis_efficient_algorithms_and_applications","241362261_Detection_of_Fetal_Anatomies_from_Ultrasound_Images_using_a_Constrained_Probabilistic_Boosting_Tree","228083862_Digital_Image_Processing","222817062_Digital_image_restoration_by_Wiener_filter_in_2D_case","221417153_An_Algorithm_For_The_Least_Square-Fitting_of_Ellipses","17627202_Growth_of_Foetal_Biparietal_Diameter_During_Normal_Pregnancy"]}