{"id":"320821388_A_Unified_Game-Theoretic_Approach_to_Multiagent_Reinforcement_Learning","abstract":"To achieve general intelligence, agents must learn how to interact with others in a shared environment: this is the challenge of multiagent reinforcement learning (MARL). The simplest form is independent reinforcement learning (InRL), where each agent treats its experience as part of its (non-stationary) environment. In this paper, we first observe that policies learned using InRL can overfit to the other agents' policies during training, failing to sufficiently generalize during execution. We introduce a new metric, joint-policy correlation, to quantify this effect. We describe an algorithm for general MARL, based on approximate best responses to mixtures of policies generated using deep reinforcement learning, and empirical game-theoretic analysis to compute meta-strategies for policy selection. The algorithm generalizes previous ones such as InRL, iterated best response, double oracle, and fictitious play. Then, we present a scalable implementation which reduces the memory requirement using decoupled meta-solvers. Finally, we demonstrate the generality of the resulting policies in two partially observable settings: gridworld coordination games and poker.","authors":["Marc Lanctot","Vinicius Zambaldi","Audrunas Gruslys","Angeliki Lazaridou"],"meta":["November 2017"],"references":["320473480_Mastering_the_game_of_Go_without_human_knowledge","317586634_Coordinate_to_Cooperate_or_Compete_Abstract_goals_and_joint_intentions_in_social_interaction","340180048_Statsmodels_Econometric_and_Statistical_Modeling_with_Python","320640959_Heads-up_limit_Hold'em_Poker_is_solved","320322134_Emergent_Complexity_via_Multi-Agent_Competition","320321556_Continuous_Adaptation_via_Meta-Learning_in_Nonstationary_and_Competitive_Environments","317399486_Multi-Agent_Actor-Critic_for_Mixed_Cooperative-Competitive_Environments","316779789_Safe_and_Nested_Subgame_Solving_for_Imperfect-Information_Games","316184689_The_Reactor_A_Sample-Efficient_Actor-Critic_Architecture","314433751_Model-Agnostic_Meta-Learning_for_Fast_Adaptation_of_Deep_Networks"]}