{"id":"320891282_Discovering_More_Precise_Process_Models_from_Event_Logs_by_Filtering_Out_Chaotic_Activities","abstract":"Process Discovery is concerned with the automatic generation of a process model that describes a business process from execution data of that business process. Real life event logs can contain chaotic activities. These activities are independent of the state of the process and can, therefore, happen at rather arbitrary points in time. We show that the presence of such chaotic activities in an event log heavily impacts the quality of the process models that can be discovered with process discovery techniques. The current modus operandi for filtering activities from event logs is to simply filter out infrequent activities. We show that frequency-based filtering of activities does not solve the problems that are caused by chaotic activities. Moreover, we propose a novel technique to filter out chaotic activities from event logs. We evaluate this technique on a collection of seventeen real-life event logs that originate from both the business process management domain and the smart home environment domain. As demonstrated, the developed activity filtering methods enable the discovery of process models that are more behaviorally specific compared to process models that are discovered using standard frequency-based filtering.","authors":["Niek Tax","Natalia Sidorova","Wil Van der Aalst"],"meta":["February 2019Journal of Intelligent Information Systems 52(4)","DOI:10.1007/s10844-018-0507-6","Projects: Process Mining in Smart HomesData-Driven Value Proposition"],"references":["344474026_Process_Discovery_using_Integer_Linear_Programming","322524181_Improving_Process_Discovery_Results_by_Filtering_Outliers_Using_Conditional_Behavioural_Probabilities","319198685_Event_Abstraction_for_Process_Mining_Using_Supervised_Learning_Techniques","317230236_Mining_Process_Model_Descriptions_of_Daily_Life_Through_Event_Abstraction","314837918_RapidProM_Mine_Your_Processes_and_Not_Just_Your_Data","311819456_Sepsis_Cases_-_Event_Log","309081021_Filtering_out_Infrequent_Behavior_from_Process_Event_Logs","316261706_Fodina_A_robust_and_flexible_heuristic_process_discovery_technique","312596129_Process_Mining_Data_Science_in_Action","312486059_Process-Based_Habit_Mining_Experiments_and_Techniques"]}