{"id":"320800938_Learning_programming_from_Scratch","abstract":"The link between problem-solving and programming skills is well known. Students with higher problem-solving abilities find programming easy and they can master programming with no or little difficulties regardless of the programming environment. On the contrary, students with lower problem-solving abilities find programming difficult to understand and are often unable to master it. The before mentioned groups of students usually make up two thirds of the entire class, the top and lowest thirds, respectively. What about the \"middle third\" students? This is probably the most represented group; those are students who can master programming but with some difficulties. Visual programming language environments are tools designed to engage all students but maybe the \"middle third\" students would gain the most benefit from that approach. In this paper, we explore the educational and motivational effect of using Scratch for game-based programming on 5th-grade elementary school students based on their problem-solving abilities. Results presented here confirm the positive effect of using Scratch as the introductory programming language for game-based programming on \"middle third\" students, compared to Python as the text-based programming language.","authors":["Monika Mladenović","Divna Krpan","Sasa Mladenovic"],"meta":["July 2017Turkish Online Journal of Educational Technology 2017(November Special Issue INTE):419-427","Project: Artificial Intelligence in COMplex Problem solvIng and LEarning – AI COMPILE"],"references":["306065695_Comparing_Elementary_Students'_Programming_Success_Based_on_Programming_Environment","305704236_INTRODUCING_PROGRAMMING_TO_ELEMENTARY_STUDENTS_NOVICES_BY_USING_GAME_DEVELOPMENT_IN_PYTHON_AND_SCRATCH","283041226_Automatic_detection_of_bad_programming_habits_in_scratch_A_preliminary_study","270606116_Programming_by_choice","258134754_Computational_Thinking_in_K-12_A_Review_of_the_State_of_the_Field","300116168_Comparing_Textual_and_Block_Interfaces_in_a_Novice_Programming_Environment","277374163_EducationAlice_3","276555166_From_Scratch_to_Real_Programming","254462725_Spaghetti_for_the_main_course_Observations_on_the_naturalness_of_scenario-based_programming","252662721_An_Empirical_Investigation_of_the_Relationship_Between_Success_in_Mathematics_and_Visual_Programming_Courses"]}