{"id":"320887429_Post-radiochemotherapy_PET_radiomics_in_head_and_neck_cancer_-_The_influence_of_radiomics_implementation_on_the_reproducibility_of_local_control_tumor_models","abstract":"Purpose: \nThis study investigated an association of post-radiochemotherapy (RCT) PET radiomics with local tumor control in head and neck squamous cell carcinoma (HNSCC) and evaluated the models against two radiomics software implementations.\n\nMaterials and methods: \n649 features, available in two radiomics implementations and based on the same definitions, were extracted from HNSCC primary tumor region in 18F-FDG PET scans 3 months post definitive RCT (training cohort n = 128, validation cohort n = 50) and compared using the intraclass correlation coefficient (ICC). Local recurrence models were trained, separately for both implementations, using principal component analysis (PCA) and the least absolute shrinkage and selection operator. The reproducibility of the concordance indexes (CI) in univariable Cox regression for features preselected in PCA and the final multivariable models was investigated using respective features from the other implementation.\n\nResults: \nOnly 80 PET radiomic features yielded ICC > 0.8 in the comparison between the implementations. The change of implementation caused high variability of CI in the univariable analysis. However, both final multivariable models performed equally well in the training and validation cohorts (CI > 0.7) independent of radiomics implementation.\n\nConclusion: \nThe two post-RCT PET radiomic models, based on two different software implementations, were prognostic for local tumor control in HNSCC. However, 88% of the features was not reproducible between the implementations.","authors":["Marta Bogowicz","Ralph T.H. Leijenaar","Stephanie Tanadini-Lang","Oliver Riesterer"],"meta":["November 2017Radiotherapy and Oncology 125(3)","DOI:10.1016/j.radonc.2017.10.023"],"references":["303829534_Characterization_of_PETCT_images_using_texture_analysis_the_past_the_present_any_future","280998421_External_validation_of_a_prognostic_CT-based_radiomic_signature_in_oropharyngeal_squamous_cell_carcinoma","280872758_The_effect_of_SUV_discretization_in_quantitative_FDG-PET_Radiomics_The_need_for_standardized_methodology_in_tumor_texture_analysis","320198316_Radiomics_The_bridge_between_medical_imaging_and_personalized_medicine","319174731_Comparison_of_PET_and_CT_radiomics_for_prediction_of_local_tumor_control_in_head_and_neck_squamous_cell_carcinoma"]}