{"id":"320882912_Advances_in_Social_Media_Research_Past_Present_and_Future","abstract":"Social media comprises communication websites that facilitate relationship forming between users from diverse backgrounds, resulting in a rich social structure. User generated content encourages inquiry and decision-making. Given the relevance of social media to various stakeholders, it has received significant attention from researchers of various fields, including information systems. There exists no comprehensive review that integrates and synthesises the findings of literature on social media. This study discusses the findings of 132 papers (in selected IS journals) on social media and social networking published between 1997 and 2017. Most papers reviewed here examine the behavioural side of social media, investigate the aspect of reviews and recommendations, and study its integration for organizational purposes. Furthermore, many studies have investigated the viability of online communities/social media as a marketing medium, while others have explored various aspects of social media, including the risks associated with its use, the value that it creates, and the negative stigma attached to it within workplaces. The use of social media for information sharing during critical events as well as for seeking and/or rendering help has also been investigated in prior research. Other contexts include political and public administration, and the comparison between traditional and social media. Overall, our study identifies multiple emergent themes in the existing corpus, thereby furthering our understanding of advances in social media research. The integrated view of the extant literature that our study presents can help avoid duplication by future researchers, whilst offering fruitful lines of enquiry to help shape research for this emerging field.","authors":["Kawal Kapoor","Kuttimani Tamilmani","Nripendra Rana","Pushp Prakash Patil"],"meta":["June 2018Information Systems Frontiers 20(4)","DOI:10.1007/s10796-017-9810-y"],"references":["320221030_Content_or_Community_A_Digital_Business_Strategy_for_Content_Providers_in_the_Social_Age","317777299_Re-examining_the_Unified_Theory_of_Acceptance_and_Use_of_Technology_UTAUT_Towards_a_Revised_Theoretical_Model","322925582_An_Information_Diffusion-Based_Recommendation_Framework_for_Micro-Blogging","319381537_Content_Sharing_in_a_Social_Broadcasting_Environment_Evidence_from_Twitter","317979478_Affiliate_marketing_An_overview_and_analysis_of_emerging_literature","317155519_Social_Media_in_Marketing_A_Review_and_Analysis_of_the_Existing_Literature","315901821_An_empirical_validation_of_a_unified_model_of_electronic_government_adoption_UMEGA","313808327_Electronic_Word_of_Mouth_eWOM_in_the_Marketing_Context","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","309220134_Pay-per-click_advertising_A_literature_review"]}