{"id":"320847669_Depth_first_search_in_claw-free_graphs","abstract":"Optimization problems concerning the vertex degrees of spanning trees of connected graphs play an extremely important role in network design. Minimizing the number of leaves of the spanning trees is NP-hard, since it is a generalization of the problem of finding a hamiltonian path of the graph. Moreover, Lu and Ravi (The power of local optimization: approximation algorithms for maximum-leaf spanning tree (DRAFT), CS-96-05, Department of Computer Science, Brown University, Providence, 1996) showed that this problem does not even have a constant factor approximation, unless \\(\\hbox {P}=\\hbox {NP}\\), thus properties that guarantee the existence of a spanning tree with a small number of leaves are of special importance. In this paper we are dealing with finding spanning trees with few leaves in claw-free graphs. We prove that all claw-free graphs have a DFS-tree, such that the leaves different from the root have no common neighbour, generalizing a theorem of Kano et al. (Ars Combin 103:137–154, 2012). The result also implies a strengthening of a result of Ainouche et al. (Ars Combin 29C:110–121, 1990).","authors":["Gábor Wiener"],"meta":["March 2018Optimization Letters 12(2)","DOI:10.1007/s11590-017-1211-0"],"references":["268722378_Remarks_on_Hamiltonian_properties_of_claw-free_graphs","267431246_Spanning_trees_with_a_bounded_number_of_leaves_in_a_claw-free_graph","266991555_Handbook_of_Theoretical_Computer_Science_Vol_A_Algorithms_and_Complexity","229747899_Longest_paths_and_cycles_in_K13-free_graphs","229131388_Spanning_spiders_and_light-splitting_switches","225330670_Exact_and_Parameterized_Algorithms_for_Max_Internal_Spanning_Tree","222350911_On_a_Closure_Concept_in_Claw-Free_Graphs","220115880_On_finding_spanning_trees_with_few_leaves","46586063_Hamilton_cycles_in_5-connected_line_graphs","2643910_The_Power_of_Local_Optimization_Approximation_Algorithms_for_Maximum-leaf_Spanning_Tree_DRAFT"]}