{"id":"320884734_Skipping_the_Baby_Steps_The_Importance_of_Teaching_Practical_Programming_Before_Programming_Theory","abstract":"As programming becomes one of the most sought-after skills in today’s digital world, the demand for computer literate coders is ever-increasing. However, programming novices face many challenges when learning programming theory and syntax, showing the highest failure rates at university level. This study proposes a new syntax-based serious game solution which teaches programming novices C-Style syntax and programming theory. It aims to provide an alternative to block-based programming environment tools like Scratch and aims to better understand how novice programmers learn best today. The proposed solution focuses on two key areas which have shown the most promising results: motivation and syntax. The solution also focuses on reinforcing good programming practices to provide the novice with guidance to transition them to computer programming. The results show that the proposed application users saw an increase of 62.5% in their programming test results in comparison to 34.17% in Scratch users. Overall, the participants using the proposed tool were more positive about their experience, describing it as ‘very fun’ and ‘a very good educational experience!’. Results suggested that participants were not intimidated by the syntax where 9 out of 10 participants have said that they feel more comfortable about programming in the future. Not only that, but encouragingly, novices wanted the proposed application “to be more complex” challenging the perceptions novices have about programming. Overall, the results support the hypothesis that the proposed syntax-based application is a more motivational and effective tool in transitioning novices to computer programming.","authors":["Iveta Stripeikaitė"],"meta":["November 2017","DOI:10.1007/978-3-319-70111-0_30","Conference: Joint International Conference on Serious Games"],"references":["281714025_Dr_Scratch_Automatic_Analysis_of_Scratch_Projects_to_Assess_and_Foster_Computational_Thinking","274632820_USING_SCRATCH_IN_INTRODUCTION_TO_PROGRAMMING_COURSE_FOR_ENGINEERING_STUDENTS","266657039_Failure_rates_in_introductory_programming_revisited","3970483_Why_software_product_startups_fail_and_what_to_do_about_it_Evolution_of_software_product_development_in_startup_companies"]}