{"id":"320885815_To_Scratch_or_not_to_Scratch_A_controlled_experiment_comparing_plugged_first_and_unplugged_first_programming_lessons","abstract":"Programming education is in fashion: there are many methods, tools, books and apps to teach children programming. This gives rise to the question of how to teach programming. Do we teach the concepts with or without the use of a computer, also called plugged and unplugged respectively? This paper aims to measure what method is more effective to start with: plugged or unplugged first. Specifically, we are interested in examining which method is better in terms of (1) facilitating understanding of programming concepts, (2) motivating and supporting the students' sense of self-efficacy in programming tasks and (3) motivating the students to explore and use programming constructs in their assignments. To this end we conduct a controlled study with 35 elementary school children, in which half of the children receive four plugged lessons and the other half receives four unplugged lessons After this, both groups receive four weeks of Scratch lessons. The results show that after eight weeks there was no difference between the two groups in their mastering of programming concepts. However, the group that started with unplugged lessons was more confident of their ability to understand the concepts, i.e. demonstrated better self-efficacy beliefs. Furthermore, the children in the unplugged first group used a wider selection of Scratch blocks.","authors":["Felienne Hermans","Efthimia Aivaloglou"],"meta":["November 2017","DOI:10.1145/3137065.3137072","Conference: the 12th Workshop"],"references":["307090366_Learning_to_Program_Gender_Differences_and_Interactive_Effects_of_Students'_Motivation_Goals_and_Self-Efficacy_on_Performance","307089174_How_Kids_Code_and_How_We_Know_An_Exploratory_Study_on_the_Scratch_Repository","301429274_Programming_in_the_wild_Patterns_of_Computational_Participation_in_the_Scratch_Online_Social_Networking_Forum","292210505_The_Effects_of_Scratch-Based_Game_Activities_on_Students'_Attitudes_Self-Efficacy_and_Academic_Achievement","318126978_Teaching_Software_Engineering_Principles_to_K-12_Students_A_MOOC_on_Scratch","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","298972479_Learning_Computer_Science_Concepts_with_Scratch","276555166_From_Scratch_to_Real_Programming","271529493_Uncovering_Trajectories_of_Informal_Learning_in_Large_Online_Communities_of_Creators","267014649_Algorithms_Unplugged"]}