{"id":"320835894_Graph_Partitioning_using_Quantum_Annealing_on_the_D-Wave_System","abstract":"Graph partitioning (GP) applications are ubiquitous throughout mathematics, computer science, chemistry, physics, bio-science, machine learning, and complex systems. Post Moore's era supercomputing has provided us an opportunity to explore new approaches for traditional graph algorithms on quantum computing architectures. In this work, we explore graph partitioning using quantum annealing on the D-Wave 2X machine. Motivated by a recently proposed graph-based electronic structure theory applied to quantum molecular dynamics (QMD) simulations, graph partitioning is used for reducing the calculation of the density matrix into smaller subsystems rendering the calculation more computationally efficient. Unconstrained graph partitioning as community clustering based on the modularity metric can be naturally mapped into the Hamiltonian of the quantum annealer. On the other hand, when constraints are imposed for partitioning into equal parts and minimizing the number of cut edges between parts, a quadratic unconstrained binary optimization (QUBO) reformulation is required. This reformulation may employ the graph complement to fit the problem in the Chimera graph of the quantum annealer. Partitioning into 2 parts and k parts concurrently for arbitrary k are demonstrated with benchmark graphs, random graphs, and small material system density matrix based graphs. Results for graph partitioning using quantum and hybrid classical-quantum approaches are shown to be comparable to current \"state of the art\" methods and sometimes better.","authors":["Hayato Ushijima-Mwesigwa","Christian Negre","Susan M. Mniszewski"],"meta":["November 2017","DOI:10.1145/3149526.3149531","Conference: the Second International Workshop"],"references":["315835538_Optimizing_Adiabatic_Quantum_Program_Compilation_using_a_Graph-Theoretic_Framework","310515157_Recent_Advances_in_Graph_Partitioning","301896008_Graph_Partitioning_Methods_for_Fast_Parallel_Quantum_Molecular_Dynamics","293043091_Spanning_Tree_Calculations_on_D-Wave_2_Machines","289584806_Computational_multiqubit_tunnelling_in_programmable_quantum_annealers","280221097_Fast_clique_minor_generation_in_Chimera_qubit_connectivity_graphs","279638940_Complex_patterns_from_physical_to_social_interactions","274012375_Experimental_quantum_annealing_Case_study_involving_the_graph_isomorphism_problem","301848026_Graph-based_linear_scaling_electronic_structure_theory","285513534_The_network_model_of_porous_media_III_Dynamic_properties_of_networks_with_tube_radius_distribution"]}