{"id":"320899339_Ontology-Based_Photogrammetric_Survey_in_Underwater_Archaeology","abstract":"This work addresses the problem of underwater archaeological surveys from the point of view of knowledge. We propose an approach based on underwater photogrammetry guided by a representation of knowledge used, as structured by ontologies. Survey data feed into to ontologies and photogrammetry in order to produce graphical results. This paper focuses on the use of ontologies during the exploitation of 3D results. JAVA software dedicated to photogrammetry and archaeological survey has been mapped onto an OWL formalism. The use of procedural attachment in a dual representation (JAVA - OWL) of the involved concepts allows us to access computational facilities directly from OWL. As SWRL The use of rules illustrates very well such ‘double formalism’ as well as the use of computational capabilities of ‘rules logical expression’. We present an application that is able to read the ontology populated with a photogrammetric survey data. Once the ontology is read, it is possible to produce a 3D representation of the individuals and observing graphically the results of logical spatial queries on the ontology. This work is done on a very important underwater archaeological site in Malta named Xlendi, probably the most ancient shipwreck of the central Mediterranean Sea.","authors":["Pierre Drap","Odile Papini","Jean-Christophe Sourisseau","Timmy Gambin"],"meta":["November 2017","DOI:10.1007/978-3-319-70407-4_1","Conference: European Semantic Web Conference","Project: Phoenician Shipwreck Project"],"references":["302711627_Method_and_system_for_creating_OWL_ontology_from_java","285597379_Underwater_Photogrammetry_and_Object_Modeling_A_Case_Study_of_Xlendi_Wreck_in_Malta","273466858_Semantic_Framework_for_Mapping_Object-Oriented_Model_to_Semantic_Web_Languages","230585369_A_Practical_Guide_To_Building_OWL_Ontologies_Using_The_Prot'eg'e-OWL_Plugin_and_CO-ODE_Tools","221389740_Automatic_Mapping_of_OWL_Ontologies_into_Java","221238810_Mapping_Cultural_Metadata_Schemas_to_CIDOC_Conceptual_Reference_Model","220955249_An_Ontology_for_3D_Cultural_Objects","220920769_Sapphire_Generating_Java_Runtime_Artefacts_from_OWL_Ontologies"]}