{"id":"320861763_Scientometric_analysis_of_scientific_publications_in_CSCW","abstract":"Over the last decades, CSCW research has undergone significant structural changes and has grown steadily with manifested differences from other fields in terms of theory building, methodology, and socio-technicality. This paper provides a quantitative assessment of the scientific literature for mapping the intellectual structure of CSCW research and its scientific development over a 15-year period (2001–2015). A total of 1713 publications were subjected to examination in order to draw statistics and depict dynamic changes to shed new light upon the growth, spread, and collaboration of CSCW devoted outlets. Overall, our study characterizes top (cited and downloaded) papers, citation patterns, prominent authors and institutions, demographics, collaboration patterns, most frequent topic clusters and keywords, and social mentions by country, discipline, and professional status. The results highlight some areas of improvement for the field and a lot of well-established topics which are changing gradually with impact on citations and downloads. Statistical models reveal that the field is predominantly influenced by fundamental and highly recognized scientists and papers. A small number of papers without citations, the growth of the number of papers by year, and an average number of more than 39 citations per paper in all venues ensure the field a healthy and evolving nature. We discuss the implications of these findings in terms of the influence of CSCW on the larger field of HCI.","authors":["António Correia","Hugo Paredes","Benjamim Fonseca"],"meta":["January 2018Scientometrics 114(1):31-89","DOI:10.1007/s11192-017-2562-0"],"references":["316262886_Scientific_collaboration_patterns_vary_with_scholars'_academic_ages","316217277_ResearchGate_vs_Google_Scholar_Which_finds_more_early_citations","316118019_With_whom_do_researchers_collaborate_and_why","312405683_Citations_and_Team_Sizes","321654005_Technologies_Methods_and_Values_Changes_in_Empirical_Research_at_CSCW_1990_-_2015","317751446_Topic_scientific_community_in_science_a_combined_perspective_of_scientific_collaboration_and_topics","316092105_Do_Mendeley_reader_counts_reflect_the_scholarly_impact_of_conference_papers_An_investigation_of_computer_science_and_engineering","314429958_Standing_on_the_shoulders_of_giants_the_effect_of_outstanding_scientists_on_young_collaborators'_careers","314206410_HCI_down_under_reflecting_on_a_decade_of_the_OzCHI_conference","313200508_Moving_out_from_the_control_room_Ethnography_in_system_design"]}