{"id":"320827487_Overlapping_Community_Detection_Based_on_Structural_Centrality_in_Complex_Networks","abstract":"Community structure is an important mesoscale topological characteristic of complex networks, which is significant for understanding structural features and organizational functions in networks. Local expansion methods have been proved to be efficient and effective for community detection. However, it has been shown that there are inherent drawbacks for these methods to uncover overlapping communities. Most methods are sensitive to initial seeds and built-in parameters, while others are inadequate to reveal the pervasive overlaps. In this paper, we propose a new local expansion method for uncovering overlapping communities based on structural centrality. The key idea of our approach is to locate structural centers of communities with the structural centrality, and then expand these structural centers with a weighted strategy and a local search procedure. Experimental results both on artificial and real-world networks demonstrate that our method is effective and promising in term of finding overlapping community structures. We also show that our local expansion strategies are efficient in uncovering cohesive clusters and producing stable clustering results.","authors":["Xiaofeng Wang","Gongshen Liu","Jianhua Li"],"meta":["November 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2769484"],"references":["316472283_Percolation_Centrality_Quantifying_Graph-Theoretic_Impact_of_Nodes_during_Percolation_in_Networks","312333903_Clustering_coefficients_of_large_networks","312182253_Locating_Structural_Centers_A_Density-Based_Clustering_Method_for_Community_Detection","274493270_Description-Driven_Community_Detection","346504051_Exploring_local_community_structures_in_large_networks","304400896_Asymmetric_intimacy_and_algorithm_for_detecting_communities_in_bipartite_networks","301217640_Overlapping_Community_Detection_based_on_Network_Decomposition","299344337_Detecting_one-mode_communities_in_bipartite_networks_by_bipartite_clustering_triangular","276465756_Community_detection_using_local_neighborhood_in_complex_networks","272381987_Overlapping_community_detection_using_neighborhood_ratio_matrix"]}