{"id":"320891341_Performance_Analysis_of_Trial_and_Error_Algorithms","abstract":"Model-free decentralized optimizations and learning are receiving increasing attention from theoretical and practical perspectives. In particular, two fully decentralized learning algorithms, namely Trial and Error (TEL) and Optimal Dynamical Learning (ODL), are very appealing for a broad class of games. In fact, ODL has the property to spend a high proportion of time in an optimum state that maximizes the sum of utility of all players. And the TEL has the property to spend a high proportion of time in an optimum state that maximizes the sum of utility of all players if there is a Pure Nash Equilibrium (PNE), otherwise, it spends a high proportion of time in an optimum state that maximizes a tradeoff between the sum of utility of all players and a predefined stability function. On the other hand, estimating the mean fraction of time spent in the optimum state (as well as the mean time duration to reach it) is challenging due to the high complexity and dimension of the inherent Markov Chains. In this paper, under some specific system model, an evaluation of the above performance metrics is provided by proposing an approximation of the considered Markov chains, which allows overcoming the problem of high dimensionality. A comparison between the two algorithms is then performed which allows a better understanding of their performances.","authors":["Jérôme Gaveau","Christophe J. Le Martret","Mohamad Assaad"],"meta":["November 2017IEEE Transactions on Parallel and Distributed Systems PP(99)","DOI:10.1109/TPDS.2020.2964256"],"references":["275054848_A_Survey_on_Applications_of_Model-Free_Strategy_Learning_in_Cognitive_Wireless_Networks","273394027_Utility-Based_Resource_Allocation_for_Multi-Channel_Decentralized_Networks","260722743_Self-Organization_in_Decentralized_Networks_A_Trial_and_Error_Learning_Approach","312454318_The_evolution_of_conventions","300181036_Partitions_of_Integers","284701788_Generating_all_combinations_and_partitions","278768710_Game_Theory_and_Learning_for_Wireless_Networks_Fundamentals_and_Applications","261264584_Achieving_Pareto_Optimal_Equilibria_in_Energy_Efficient_Clustered_Ad_Hoc_Networks","260657167_Self-Organization_in_Small_Cell_Networks_A_Reinforcement_Learning_Approach","241756668_Learning_Efficient_Nash_Equilibria_in_Distributed_Systems"]}