{"id":"320828574_Medical_Education_Must_Move_From_the_Information_Age_to_the_Age_of_Artificial_Intelligence","abstract":"Changes to the medical profession require medical education reforms that will enable physicians to more effectively enter contemporary practice. Proposals for such reforms abound. Common themes include renewed emphasis on communication, teamwork, risk-management, and patient safety. These reforms are important but insufficient. They do not adequately address the most fundamental change--the practice of medicine is rapidly transitioning from the information age to the age of artificial intelligence. Employers need physicians who: work at the top of their license, have knowledge spanning the health professions and care continuum, effectively leverage data platforms, focus on analyzing outcomes and improving performance, and communicate the meaning of the probabilities generated by massive amounts of data to patients given their unique human complexities.Future medical practice will have four characteristics that must be addressed in medical education: care will be (1) provided in many locations; (2) provided by newly-constituted health care teams; and (3) based on a growing array of data from multiple sources and artificial intelligence applications; and (4) the interface between medicine and machines will need to be skillfully managed. Thus, medical education must make better use of the findings of cognitive psychology, pay more attention to the alignment of humans and machines in education, and increase the use of simulations. Medical education will need to evolve to include systematic curricular attention to the organization of professional effort among health professionals, the use of intelligence tools like machine learning and robots, and a relentless focus on improving performance and patient outcomes. [end of abstract].","authors":["Steven A. Wartman","C. Donald Combs"],"meta":["November 2017Academic medicine: journal of the Association of American Medical Colleges 93(8):1","DOI:10.1097/ACM.0000000000002044"],"references":["281311422_Intelligent_healthcare_informatics_in_big_data_era","233994432_Ensuring_Physicians'_Competence_-_Is_Maintenance_of_Certification_the_Answer","7922215_Research_in_clinical_reasoning_Past_history_and_current_trends"]}