{"id":"320857527_Principles_of_Textile_Finishing","abstract":"Principles of Textile Finishing presents the latest information on textile finishing for industry professionals and researchers who are new to the field. As these processes are versatile and varied in their applications, the book provides information on how decisions on finishes and techniques may be made subjectively or based on experience. In addition, the book presents the desired final properties of textile materials and how they differ widely from product to product, helping finishers who face significant challenges in delivering fabrics that meet the requirements of end-users be successful. Written by an author who is an expert in the field, and who has with many years of experience in industry and academia, this book provides an accessible introduction to the principles, types, and applications of textile finishes. Provides an accessible introduction to the principles, types, and applications of textile finishes. Assists industry professionals and researchers in selecting finishes that will result in fabric properties that meet the requirements of end-users. Written by an author with years of experience in industry and academia and who is an expert in the field.","authors":["Asim Kumar Roy Chowdhury"],"meta":["April 2017"],"references":["302028913_Unconventional_Natural_Dyeing_Using_Microwave_Heating_with_Cochineal_as_Natural_Dyes","299652516_Cellulase_Enzyme_in_Bio-finishing_of_Cotton-Based_Fabrics_Effects_of_Process_Parameters","302029554_Application_of_Microbial_Transglutaminases_in_Anti-Crease_Finish_of_Silk_Fabric","300082473_The_Durable_Press_Finishing_of_Silk_Fabrics_by_Using_1234-Butanetetracarboxylic_Acid","299651833_Green_Strategy_for_Development_of_Antimicrobial_Printed_Textile_Fabrics","292198902_Relative_toxicity_of_pyrolysis_products_from_upholstery_fabrics_with_and_without_backcoating","290047169_Optimisation_of_process_parameters_for_coloration_and_antibacterial_finishing_of_wool_fabric_using_natural_fungal_extract","249782638_Soil-Release_Properties_Imparted_to_Polyester_Cotton_Fabrics_by_Alkali_Treatment","233263694_Textile_Hand_A_New_Method_for_Textile_Objective_Evaluation"]}