{"id":"320840507_Presentacion_Dossier_Logistica_y_desarrollo_territorial","abstract":"La logística no sólo tiene miles de años de antigüedad favoreciendo la efectiva conexión entre la oferta y la demanda de bienes y servicios (Colin, 1996), sino que también ha sido un factor crucial en la estructuración del territorio. Actualmente, la prosperidad depende más que nunca antes de sistemas de logística fluidos, efectivos y seguros, que sean el soporte de la competitividad económica sostenible de los territorios (Savy, 1993; Savy y Veltz, 1993; Savy, 2006; Cedillo-Campos et al., 2016). Pero además, son un elemento clave de la atractividad territorial tanto para el desarrollo de actividades profesionales, como privadas de los habitantes (González-Feliu y Peris Pla, 2017). La logística ha sido también un transformador disruptivo de nuestras sociedades. A través de su aplicación militar, el mundo ha vivido grandes cambios sociales, económi-cos y territoriales (Colin, 2016). Celebres son tanto las victorias militares de Alejandro Magno y de Julio César, derivadas de una buena gestión de los recursos logísticos, como la derrota Napoleónica en el frente ruso por fallas en la previsión y gestión del abaste-cimiento de las tropas. Asimismo, es también reconocido el ordenamiento territorial romano basado en una lógica militar, precedente del desarrollo de ciudades y territorios vinculado a la cuestión de los abastecimientos y su logística (González-Feliu, 2017). De éste modo, la estrecha relación logística y territorio se observa en innumerables casos que van desde la construcción de las catedrales medievales o la ruta de la seda, hasta el desarrollo de las ciudades, entre otros. El diseño, análisis y desarrollo logístico está vinculado al desarrollo territorial. Desde un enfoque de sistemas, la proyección territorial de las actividades logísticas es un comple-mento fundamental que permite completar los ángulos de análisis necesarios para una comprensión integral de la actividad humana. De hecho, es por ello que en los últimos años la logística ha tomado un rol principal tanto a nivel local, como nacional e internacional. La fluidez logística es hoy una meta que no sería posible alcanzar sin considerar el componente territorial en donde las organizaciones desarrollan sus actividades (Cedillo-Campos et al., 2017). Por otro lado, la accesibilidad y atractividad del territorio son componentes esenciales para la planeación y el desarrollo de un territorio (van Wee, 2016). En ellas, las actividades logísticas juegan un rol principal (Savy, 2006; González-Feliu, 2012).","authors":["Jesus Gonzalez-Feliu","Miguel Gastón Cedillo-Campos"],"meta":["November 2017","Project: Cadenas de suministro y logistica del transporte"],"references":["321346728_Logistique_urbaine_durable_Prevision_et_evaluation","318400890_Impacts_of_retailing_attractiveness_on_freight_and_shopping_trip_attraction_rates","309662066_DIRECTIONS_FOR_SUSTAINABLE_PORTS_IN_LATIN_AMERICA_AND_THE_CARIBBEAN","284160950_Accessible_accessibility_research_challenges","282708783_The_challenge_of_implementing_reverselogistics_in_social_improvement_The_possibility_of_expanding_sovereignty_food_in_developing_communities"]}