{"id":"320899446_RML_and_FnO_Shaping_DBpedia_Declaratively","abstract":"dbpedia data is largely generated from extracting and parsing the wikitext from the infoboxes of Wikipedia. This generation process is handled by the dbpedia Extraction Framework (dbpedia ef). This framework currently consists of data transformations, a series of custom hard-coded steps which parse the wikitext, and schema transformations, which model the resulting rdf data. Therefore, applying changes to the resulting rdf data needs both Semantic Web expertise and development within the dbpedia ef. As such, the current dbpedia data is being shaped by a small amount of core developers. However, by describing both schema and data transformations declaratively, we shape and generate dbpedia data using solely declarations, splitting the concerns between implementation and modeling. The parsing functions development is decoupled from the dbpedia ef, and other data transformation functions can easily be integrated during dbpedia data generation. This demo showcases an interactive Web application that allows non-technical users to (re-)shape the dbpedia data and use external data transformation functions, solely by editing a mapping document via html controls.","authors":["Ben De Meester","Wouter Maroy","Anastasia Dimou","Ruben Verborgh"],"meta":["November 2017Lecture Notes in Computer Science","DOI:10.1007/978-3-319-70407-4_32","Conference: European Semantic Web Conference","Project: Function Ontology (FnO.io)"],"references":["303098520_RMLEditor_A_Graph-based_Mapping_Editor_for_Linked_Data_Mappings","303098517_VOLT_A_Provenance-Producing_Transparent_SPARQL_Proxy_for_the_On-Demand_Computation_of_Linked_Data_and_its_Application_to_Spatiotemporally_Dependent_Data","221466796_DBpedia_A_Nucleus_for_a_Web_of_Open_Data","220854008_Lecture_Notes_in_Computer_Science","220282831_Data_Cleaning_Problems_and_Current_Approaches","346929108_Declarative_Data_Transformations_for_Linked_Data_Generation_The_Case_of_DBpedia","309306439_An_Ontology_to_Semantically_Declare_and_Describe_Functions","264274087_RML_A_Generic_Language_for_Integrated_RDF_Mappings_of_Heterogeneous_Data"]}