{"id":"320919733_Penunjuk_Arah_Cerdas_Berbasis_Aturan_Fuzzy_Sebuah_Ide_Implementasi_dari_Penggunaan_Sensor_Lalu_Lintas","abstract":"Traffic congestion had been being a classic problem that metropolitan city faces commonly. Road intersection, traffic volume, indiscipline drivers are several potential of congestion on highway. This condition is a multidimensional problem that should be resolved by an amazing way. Various science domain in various expertise domain had contributed ideas to solve this problem. One is the existence of an automatic sensor for detection the number of vehicles within a certain time, estimating density of vehicle, and vehicle velocity on high way. By using fuzzy which is applied to fuzzy rules, the idea of automatic sensor utilization is realized. Fuzzy method is informatics and computer science subsidiary, which allows computer can detect natural type various of human language. Here, fuzzy rules are used to identify possible congestion that occur and further action over congestion. By using fuzzy rules, data is obtained from sensors is sent as signal to traffic lights and definitive gate has been designed in such a way. Vehicles are in the line which in a certain density will acquire two - line alternatives (smart direction), while vehicle is on other line will be continue to move to direction that is indicated by traffic lights and action of gate working, so no line occur vehicle congested in density on one line or more. Thus, system is running in accordance with vehicle density on a certain level in a line that is detected by sensor, its mean that system is not going to running constantly if not detected vehicle density.","authors":["Ditdit Nugeraha Utama","Redno Novicta Sari","Risa Sekarningtyas","M. Habibullah"],"meta":["April 2017","DOI:10.47028/j.risenologi.2017.21.7","Project: ecoDSS for Intelligent Village and City"],"references":["311669089_FWFA_Optimization_based_Decision_Support_System_for_Road_Traffic_Engineering","264983143_Research_on_Short-term_Traffic_Flow_Forecasting_for_Junction_of_Isomerism_Road_Network_based_on_Dynamic_Correlation","257745075_A_Model_of_the_Dynamic_Traffic_Road_Network","309176110_A_Water_Flow_Algorithm_based_Optimization_Model_for_Road_Traffic_Engineering"]}