{"id":"320945147_The_Industrial_Internet_IIoT_in_the_Management_Optimization_of_the_Electrical_Grid","abstract":"The “Internet of Things” is the “new revolution”[1]: During the last decades we have observing major changes in the energy industry. The increased implementation of renewable generation, together with a greater use of electronic power elements in the network, such as HVDC links and the use of FACTS, and new market requirements, introduce new challenges and a need for more intelligent assets monitoring. With this we need to optimize its use, achieving a better balance in the combination of different energy sources and thus guaranteeing the reliability of supply and quality of energy; together with the identification of new business models that allow the integration of new technologies, neutralizing cyber threats and ensure an adequate dissemination of knowledge to new generations.\n\nIn this dilemma, companies are migrating to a more digital model based fundamentally on three pillars: Communications, Big Data and Artificial Intelligence. The right combination of these three pillars will optimize the operation of the electrical system, reducing costs and polluting emissions, accelerating the adoption of non-polluting energies and renewable energies, while maximizing economic performance and a closer way of interacting with users.\n\nThe Industrial Internet of Things (IIoT) and/or Industry 4.0 has been identified as one of the technologies with most potential impact in the next ten years and which will bring new applications for Business to Business (B2B) and specifically in our Energy Sector. IIoT must be seen as an enabler for a Digital Business Transformation, new business models, processes and services will appear and utilities will have to identify new ways for capturing value from this disruption. \n\nWe are in a new tipping point in an era of energy transformation and utilities will face new threats and challenges (i.e. cybersecurity) during this journey while the have to ensure the security and continuity of supply under the quality conditions required by the regulations. \n\nStarting from conclusion from report in [1], paper develops the scheme and interactions between the different actual and new needs in the Electrical Grid, in order to improve the transmission and distribution networks so as to reduce losses and leakages that are now a major cause of inefficiencies, showing how a combination of sensing, analysis and Industrial Internet could accomplish the goals and bring a new dimension in the Monitoring & Network Control and substantial savings.\n\nAdditional information can be found in www.adneli.com","authors":["Jorge Cardenas","David Menéndez"],"meta":["November 2017"],"references":["285431462_Internet_of_things_and_India's_readiness","282842671_Powering_the_Future_Leading_the_Digital_Transformation_of_the_Power_Industry","233979824_Optical_Current_Sensors_for_High_Power_Systems_A_Review","224479655_Recent_progress_in_optical_current_sensing_techniques","2366993_Flexible_Authentication_of_XML_Documents","308912698_Battery_Capacity_of_Deferrable_Energy_Demand"]}