{"id":"320920177_Quantum_superiority_for_verifying_NP-complete_problems_with_linear_optics","abstract":"Demonstrating quantum superiority for some computational task will be a milestone for quantum technologies and would show that computational advantages are possible not only with a universal quantum computer but with simpler physical devices. Linear optics is such a simpler but powerful platform where classically-hard information processing tasks, such as Boson Sampling, can be in principle implemented. In this work, we study a fundamentally different type of computational task to achieve quantum superiority using linear optics, namely the task of verifying NP-complete problems. We focus on a protocol by Aaronson et al. (2008) that uses quantum proofs for verification. We show that the proof states can be implemented in terms of a single photon in an equal superposition over many optical modes. Similarly, the tests can be performed using linear-optical transformations consisting of a few operations: a global permutation of all modes, simple interferometers acting on at most four modes, and measurement using single-photon detectors. We also show that the protocol can tolerate experimental imperfections.","authors":["Juan Miguel Arrazola","Eleni Diamanti","Iordanis Kerenidis"],"meta":["November 2017npj Quantum Information 4(1)","DOI:10.1038/s41534-018-0103-1"],"references":["320177251_Classical_boson_sampling_algorithms_with_superior_performance_to_near-term_experiments","308913060_Achieving_quantum_supremacy_with_sparse_and_noisy_commuting_quantum_computations","301855123_Observation_of_Quantum_Fingerprinting_Beating_the_Classical_Limit","275974515_Universal_Linear_Optics","273788079_Experimental_Quantum_Fingerprinting","263507214_Quantum_Communication_with_Coherent_States_and_Linear_Optics","337797833_Quantum_Supremacy_for_Simulating_A_Translation-Invariant_Ising_Spin_Model","315905336_Efficient_quantum_communications_with_coherent_state_fingerprints_over_multiple_channels","279404189_E2386","267393976_Quantum_fingerprinting_with_coherent_states_and_a_constant_mean_number_of_photons"]}