{"id":"320995392_Improved_Lower_Bounds_for_Graph_Edit_Distance","abstract":"The problem of deriving lower and upper bounds for the edit distance between undirected, labelled graphs has recently received increasing attention. However, only one algorithm has been proposed that allegedly computes not only an upper but also a lower bound for non-uniform edit costs and incorporates information about both node and edge labels. In this paper, we demonstrate that this algorithm is incorrect. We present a corrected version Branch that runs in $O(n^{2}\\Delta^{3}+n^{3}$ time, where is the maximum of the maximum degrees of input graphs G and H. We also develop a speed-up $O(n^{2}\\Delta^{2}+n^{3}$ that runs in $O(n^{2}\\Delta^{2}+I(n^{2}\\Delta^{3}+n^{3}))$ time and computes an only slightly less accurate lower bound. The lower bounds produced by BranchFast are shown to be pseudo-metrics on a collection of graphs. Finally, we suggest an anytime algorithm BranchTight that iteratively improves Branch's lower bound. BranchTight runs in $O(n^{2}\\Delta^{2}+I(n^{2}\\Delta^{3}+n^{3}))$ time, where the number of iterations I is controlled by the user. A detailed experimental evaluation shows that all suggested algorithms are Pareto optimal, that they are very effective when used as filters for edit distance range queries, and that they perform excellently when used within classification frameworks.","authors":["David B. Blumenthal","Johann Gamper"],"meta":["November 2017IEEE Transactions on Knowledge and Data Engineering PP(99):1-1","DOI:10.1109/TKDE.2017.2772243"],"references":["317068219_A_Survey_on_Applications_of_Bipartite_Graph_Edit_Distance","316627199_Exact_Computation_of_Graph_Edit_Distance_for_Uniform_and_Non-_Uniform_Metric_Edit_Costs","316626294_Correcting_and_Speeding-Up_Bounds_for_Non-Uniform_Graph_Edit_Distance","310509366_Graph-Based_Keyword_Spotting_in_Historical_Handwritten_Documents","308956963_Graph_Edit_Distance_as_a_Quadratic_Assignment_Problem","300778051_Learning_Heuristics_to_Reduce_the_Overestimation_of_Bipartite_Graph_Edit_Distance_Approximation","292931738_CSI_GED_An_Efficient_Approach_for_Graph_Edit_Similarity_Computation","283150223_Approximation_of_Graph_Edit_Distance_in_Quadratic_Time","282822657_Graph_Edit_Distance_Moving_from_global_to_local_structure_to_solve_the_graph-matching_problem","281788593_Approximate_Graph_Edit_Distance_in_Quadratic_Time"]}