{"id":"320970808_Algorithms_as_culture_Some_tactics_for_the_ethnography_of_algorithmic_systems","abstract":"This article responds to recent debates in critical algorithm studies about the significance of the term “algorithm.” Where some have suggested that critical scholars should align their use of the term with its common definition in professional computer science, I argue that we should instead approach algorithms as “multiples”—unstable objects that are enacted through the varied practices that people use to engage with them, including the practices of “outsider” researchers. This approach builds on the work of Laura Devendorf, Elizabeth Goodman, and Annemarie Mol. Different ways of enacting algorithms foreground certain issues while occluding others: computer scientists enact algorithms as conceptual objects indifferent to implementation details, while calls for accountability enact algorithms as closed boxes to be opened. I propose that critical researchers might seek to enact algorithms ethnographically, seeing them as heterogeneous and diffuse sociotechnical systems, rather than rigidly constrained and procedural formulas. To do so, I suggest thinking of algorithms not “in” culture, as the event occasioning this essay was titled, but “as” culture: part of broad patterns of meaning and practice that can be engaged with empirically. I offer a set of practical tactics for the ethnographic enactment of algorithmic systems, which do not depend on pinning down a singular “algorithm” or achieving “access,” but which rather work from the partial and mobile position of an outsider.","authors":["Nick Seaver"],"meta":["December 2017Big Data & Society 4(2):205395171773810","DOI:10.1177/2053951717738104"],"references":["309964434_2_Algorithm","306524466_Algorithms_and_their_others_Algorithmic_culture_in_context","304428606_Asymmetries_of_Knowledge_Mediated_Ethnography_and_ICT_for_Development","289555278_How_the_machine_'thinks_Understanding_opacity_in_machine_learning_algorithms","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","312453304_Interviews_as_ethnography_Disembodied_social_interaction_in_Britain","312378887_Seeing_without_knowing_Limitations_of_the_transparency_ideal_and_its_application_to_algorithmic_accountability","308544320_Conclusion_An_American_Mining_Firm_in_Post-Authoritarian_Indonesia","290587779_Writing_against_culture","290224621_Practical_ontology_Worlds_in_STS_and_anthropology"]}