{"id":"320966709_Simultaneous_Super-Resolution_and_Cross-Modality_Synthesis_of_3D_Medical_Images_Using_Weakly-Supervised_Joint_Convolutional_Sparse_Coding","abstract":"Magnetic Resonance Imaging (MRI) offers high-resolution in vivo imaging and rich functional and anatomical multimodality tissue contrast. In practice, however, there are challenges associated with considerations of scanning costs, patient comfort, and scanning time that constrain how much data can be acquired in clinical or research studies. In this paper, we explore the possibility of generating high-resolution and multimodal images from low-resolution single-modality imagery. We propose the weakly-supervised joint convolutional sparse coding to simultaneously solve the problems of super-resolution (SR) and cross-modality image synthesis. The learning process requires only a few registered multimodal image pairs as the training set. Additionally, the quality of the joint dictionary learning can be improved using a larger set of unpaired images1. To combine unpaired data from different image resolutions/modalities, a hetero-domain image alignment term is proposed. Local image neighborhoods are naturally preserved by operating on the whole image domain (as opposed to image patches) and using joint convolutional sparse coding. The paired images are enhanced in the joint learning process with unpaired data and an additional maximum mean discrepancy term, which minimizes the dissimilarity between their feature distributions. Experiments show that the proposed method outperforms state-of-the-art techniques on both SR reconstruction and simultaneous SR and cross-modality synthesis.","authors":["Yawen Huang","Ling Shao","Alejandro F Frangi"],"meta":["July 2017","DOI:10.1109/CVPR.2017.613","Conference: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR)"],"references":["312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","312270756_Hetero-Manifold_Regularisation_for_Cross-Modal_Hashing","311765299_Pairwise_Operator_Learning_for_Patch-Based_Single-Image_Super-Resolution","311610841_Image_Style_Transfer_Using_Convolutional_Neural_Networks","303885589_Color_object_recognition_via_cross-domain_learning_on_RGB-D_images","300412580_Convolutional_Sparse_Coding_for_Image_Super-Resolution","300253107_Hierarchical_Reconstruction_of_7T-like_Images_from_3T_MRI_Using_Multi-level_CCA_and_Group_Sparsity","298101977_Fast_and_flexible_convolutional_sparse_coding","288640908_A_Adjusted_Anchored_Neighborhood_Regression_for_Fast_Super-Resolution","286594390_Recognizing_RGB_Images_by_Learning_from_RGB-D_Data"]}