{"id":"320978478_Using_persistent_homology_and_dynamical_distances_to_analyze_protein_binding","abstract":"Persistent homology captures the evolution of topological features of a model as a parameter changes. The most commonly used summary statistics of persistent homology are the barcode and the persistence diagram. Another summary statistic, the persistence landscape, was recently introduced by Bubenik. It is a functional summary, so it is easy to calculate sample means and variances, and it is straightforward to construct various test statistics. Implementing a permutation test we detect conformational changes between closed and open forms of the maltose-binding protein, a large biomolecule consisting of 370 amino acid residues. Furthermore, persistence landscapes can be applied to machine learning methods. A hyperplane from a support vector machine shows the clear separation between the closed and open proteins conformations. Moreover, because our approach captures dynamical properties of the protein our results may help in identifying residues susceptible to ligand binding; we show that the majority of active site residues and allosteric pathway residues are located in the vicinity of the most persistent loop in the corresponding filtered Vietoris-Rips complex. This finding was not observed in the classical anisotropic network model.","authors":["Violeta Kovacev-Nikolic","Peter Bubenik","Dragan Nikolic","Giseon Heo"],"meta":["March 2016Statistical Applications in Genetics and Molecular Biology 15(1):19-38","DOI:10.1515/sagmb-2015-0057"],"references":["305765713_Persistent_Homology_in_Analysis_of_Point-Cloud_Data","276835504_A_topological_measurement_of_protein_compressibility","338288950_MaltoseMaltodextrin_System_of_Escherichia_coli_Transport_Metabolism_and_Regulation","313060900_Large_sample_theory_of_intrinsic_and_extrinsic_sample_means_on_manifolds","312469612_AutoDock4_and_AutoDockTools4_automated_docking_with_selective_receptor_flexibility","312455832_R_A_Language_and_Environment_for_Statistical_Computing","308805632_A_stable_multi-scale_kernel_for_topological_machine_learning","288245128_ASA_view_Solvent_accessibility_graphics_for_proteins","285599593_A_Global_Geometric_Framework_for_Nonlinear_Dimensionality_Reduction","281766106_Statistical_topological_data_analysis_using_persistence_landscapes"]}