{"id":"320914111_Using_quantitative_features_extracted_from_T2-weighted_MRI_to_improve_breast_MRI_computer-aided_diagnosis_CAD","abstract":"Computer-aided diagnosis (CAD) has been proposed for breast MRI as a tool to standardize evaluation, to automate time-consuming analysis, and to aid the diagnostic decision process by radiologists. T2w MRI findings are diagnostically complementary to T1w DCE-MRI findings in the breast and prior research showed that measuring the T2w intensity of a lesion relative to a tissue of reference improves diagnostic accuracy. The diagnostic value of this information in CAD has not been yet quantified. This study proposes an automatic method of assessing relative T2w lesion intensity without the need to select a reference region. We also evaluate the effect of adding this feature to other T2w and T1w image features in the predictive performance of a breast lesion classifier for differential diagnosis of benign and malignant lesions. An automated feature of relative T2w lesion intensity was developed using a quantitative regression model. The diagnostic performance of the proposed feature in addition to T2w texture was compared to the performance of a conventional breast MRI CAD system based on T1w DCE-MRI features alone. The added contribution of T2w features to more conventional T1w-based features was investigated using classification rules extracted from the lesion classifier. After institutional review board approval that waived informed consent, we identified 627 breast lesions (245 malignant, 382 benign) diagnosed after undergoing breast MRI at our institution between 2007 and 2014. An increase in diagnostic performance in terms of area under the curve (AUC) from the receiver operating characteristic (ROC) analysis was observed with the additional T2w features and the proposed quantitative feature of relative T2w lesion intensity. AUC increased from 0.80 to 0.83 and this difference was statistically significant (adjusted p-value = 0.020).","authors":["Cristina Gallego-Ortiz","Anne Martel"],"meta":["November 2017PLoS ONE 12(11):e0187501","DOI:10.1371/journal.pone.0187501"],"references":["280138095_Feature_Selection_with_Boruta_Package","265052539_Interpreting_Tree_Ensembles_with_inTrees","236674257_Estimating_Sensitivity_and_Specificity_for_Technology_Assessment_Based_on_Observer_Studies","228776646_Additive_Logistic_Regression_A_Statistical_View_of_Boosting","301645676_Incidentally_detected_enhancing_lesions_found_in_breast_MRI_analysis_of_apparent_diffusion_coefficient_and_T2_signal_intensity_significantly_improves_specificity","282042636_Improving_the_Accuracy_of_Computer-aided_Diagnosis_for_Breast_MR_Imaging_by_Differentiating_between_Mass_and_Nonmass_Lesions","263207222_Effectiveness_of_Screening_With_Annual_Magnetic_Resonance_Imaging_and_Mammography_Results_of_the_Initial_Screen_From_the_Ontario_High_Risk_Breast_Screening_Program","236225291_3D_T2-weighted_Spin_Echo_Imaging_in_the_Breast","227756412_Do_T2-weighted_pulse_sequences_help_with_the_differential_diagnosis_of_enhancing_lesions_in_dynamic_breast_MRI","221749384_Detection_and_classification_of_contrast-enhancing_masses_by_a_fully_automatic_computer-assisted_diagnosis_system_for_breast_MRI"]}