{"id":"320959295_Competencies_for_Complexity_Problem_Solving_in_the_Twenty-First_Century","abstract":"In this chapter, we present a view of problem solving as a bundle of skills, knowledge and abilities that are required to deal effectively with complex non-routine situations in different domains. This includes cognitive aspects of problem solving, such as causal reasoning, model building, rule induction, and information integration. These abilities are comparatively well covered by existing tests and relate to existing theories. However, non-cognitive components, such as motivation, self-regulation and social skills, which are clearly important for real-life problem solving have only just begun to be covered in assessment. We conclude that currently there is no single assessment instrument that captures problem solving competency in a comprehensive way and that a number of challenges must be overcome to cover a construct of this breadth effectively. Research on some important components of problem solving is still underdeveloped and will need to be expanded before we can claim a thorough, scientifically backed understanding of real-world problem solving. We suggest that a focus on handling and acting within complex systems (systems competency) may be a suitable starting point for such an integrative approach.","authors":["Joachim Funke","Andreas Fischer","Daniel V. Holt"],"meta":["January 2018","DOI:10.1007/978-3-319-65368-6_3","In book: Assessment and Teaching of 21st Century Skills (pp.41-53)","Projects: Validity of Minimal Complex SystemsComplex Problem Solving"],"references":["318402716_Complex_Problem_Solving_What_It_Is_and_What_It_Is_Not","316169901_The_Nature_of_Problem_Solving_Using_Research_to_Inspire_21st_Century_Learning","312099882_When_Less_Is_Less_Solving_Multiple_Simple_Problems_Is_Not_Complex_Problem_Solving-A_comment_on_Greiff_et_al_2015","295909244_The_multiple_faces_of_complex_problems_A_model_of_problem_solving_competency_and_its_implications_for_training_and_assessment","283520988_Assessment_of_Problem_Solving_Skills_by_means_of_Multiple_Complex_Systems_-_Validity_of_Finite_Automata_and_Linear_Dynamic_Systems","283009519_Complex_problem_solving_-_single_ability_or_complex_phenomenon","313668464_Everyday_problem_solving","313665755_Creative_problem_solving_An_overview","312431537_PA_facilitates_creative_problem_solving","283342095_Uber_das_Problemlosen_in_sehr_komplexen_Realitatsbereichen"]}