{"id":"320950303_ReSF_Recurrent_Low-Latency_Scheduling_in_IEEE_802154e_TSCH_networks","abstract":"The recent increase of connected devices has triggered countless Internet-of-Things applications to emerge. By using the Time-Slotted Channel Hopping (TSCH) mode of the IEEE 802.15.4e MAC layer, wireless multi-hop networks enable highly reliable and low-power communication, supporting mission-critical and industrial applications. TSCH uses channel hopping to avoid both external interference and multi-path fading, and a synchronization-based schedule which allows precise bandwidth allocation. Efficient schedule management is crucial when minimizing the delay of a packet to reach its destination. In networks with recurrent sensor data transmissions that repeat after a certain period, current scheduling functions are prone to high latencies by ignoring this recurrent behavior. In this article, we propose a TSCH scheduling function that tackles this minimal-latency recurrent traffic problem. Concretely, this work presents two novel contributions. First, the recurrent traffic problem is defined formally as an Integer Linear Program. Second, we propose the Recurrent Low-Latency Scheduling Function (ReSF) that reserves minimal-latency paths from source to sink and only activates these paths when recurrent traffic is expected. Extensive experimental results show that using ReSF leads to a latency improvement up to 80% compared to state-of-the-art low-latency scheduling functions, with a negligible impact on power consumption of at most 6%.","authors":["Glenn Daneels","Bart Spinnewyn","Steven Latré","Jeroen Famaey"],"meta":["November 2017Ad Hoc Networks 69","DOI:10.1016/j.adhoc.2017.11.002"],"references":["317278951_Minimal_IPv6_over_the_TSCH_Mode_of_IEEE_802154e_6TiSCH_Configuration","316883978_Experimental_Validation_of_a_Distributed_Self-Configured_6TiSCH_with_Traffic_Isolation_in_Low_Power_Lossy_Networks","308841729_Decentralized_broadcast-based_scheduling_for_dense_multi-hop_TSCH_networks","303801378_On_the_Interest_of_Opportunistic_Anycast_Scheduling_for_Wireless_Low_Power_Lossy_Networks","281966008_Decentralized_Traffic_Aware_Scheduling_in_6TiSCH_Networks_Design_and_Experimental_Evaluation","280102169_Orchestra_Robust_Mesh_Networks_Through_Autonomously_Scheduled_TSCH","306062272_LLSF_Low_Latency_Scheduling_Function_for_6TiSCH_Networks","283010947_A_queue-based_scheduling_algorithm_for_PCE-enabled_Industrial_Internet_of_Things_networks","282191949_Wave_A_Distributed_Scheduling_Algorithm_for_Convergecast_in_IEEE_802154e_Networks_Extended_Version","273397558_6TiSCH_deterministic_IP-enabled_industrial_Internet_of_Things"]}