{"id":"320994821_Computing_research_in_the_academy_insights_from_theses_and_dissertations","abstract":"Computational technologies have become increasingly pervasive in recent decades. Computing research in academia has commensurately seen dramatic increases, both in computing-specific research and research using computing. This article maps out the academic computing landscape by examining the connections between computing-related keywords used to describe theses and dissertations. Specifically, data from 29,435 dissertations and theses found in the ProQuest Theses and Dissertation database in the years 2009–2014 were analyzed. Results identify interdisciplinary clusters, as well as identify key differences in connections between the four computing disciplines in the database: computer science (CS), computer engineering (CE), information technology (IT), and information science (ISci). For example, authors who primarily identify with CS rarely list secondary keywords, while authors from a high variety of other disciplines list CS as a secondary keyword. CE is tightly focused and growing, but rarely seen as a relevant secondary keyword by other fields. Meanwhile, the highly interdisciplinary nature of IT and ISci is shown, along with different subgroups within those areas. While the total number of unique theses with computing-related keywords has remained steady, they have shifted dramatically between specific computing fields (e.g., away from CS toward CE and IT). Visualizations present information on the growth and change in focus of computing-related theses and dissertations, as well as networks of keywords that co-occur. We discuss potential explanations of the patterns, as well as their implications on the future of graduate work in computing disciplines.","authors":["Sung Kim","Derek L. Hansen","Richard G. Helps"],"meta":["November 2017Scientometrics","DOI:10.1007/s11192-017-2572-y"],"references":["307619797_Explore_the_research_front_of_a_specific_research_theme_based_on_a_novel_technique_of_enhanced_co-word_analysis","301551223_Use_of_dissertation_data_in_science_policy_research","301375385_Information_Technology_Research_in_the_Academy","289573356_Application_of_word_co-occurrence_analysis_method_in_mapping_of_the_scientific_fields_case_study_the_field_of_Informetrics","287427505_An_Investigation_of_Distance_Education_in_North_American_Research_Literature_Using_Co-word_Analysis","283897669_Research_characteristics_and_status_on_social_media_in_China_A_bibliometric_and_co-word_analysis","316637976_Analyzing_Social_Media_Networks_With_NodeXL","313657755_Intellectual_structure_of_knowledge_in_iMetrics_A_co-word_analysis","308007052_Red_Fish_Blue_Fish_Reexamining_Student_Understanding_of_the_Computing_Disciplines","289756047_Co-Word_Analysis"]}