{"id":"320910418_A_long_short-term_memory_based_Schaeffer_gesture_recognition_system","abstract":"In this work, a Schaeffer language recognition system is proposed in order to help autistic children overcome communicative disorders. Using Schaeffer language as a speech and language therapy, improves children communication skills and at the same time the understanding of language productions. Nevertheless, the teaching process of children in performing gestures properly is not straightforward. For this purpose, this system will teach children with autism disorder the correct way to communicate using gestures in combination with speech reproduction. The main purpose is to accelerate the learning process and increase children interest by using a technological approach. Several recurrent neural network-based approaches have been tested, such as vanilla recurrent neural networks, long short-term memory networks,and gated recurrent unit-based models. In order to select the most suitable model, an extensive comparison has been conducted reporting a 93.13% classification success rate over a subset of 25 Schaeffer gestures by using an long short-term memory-based approach. Our dataset consists on pose-based features such as angles and euclidean distances extracted from the raw skeletal data provided by a Kinect v2 sensor.","authors":["Sergiu Oprea","Alberto Garcia-Garcia","Sergio Orts","Víctor Villena Martinez"],"meta":["November 2017Expert Systems 35(2):e12247","DOI:10.1111/exsy.12247","Project: RETOGAR: Retorno al hogar. Sistema de mejora de la autonomía de personas con daño cerebral adquirido y dependientes en su integración en la sociedad"],"references":["301839500_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","322277018_Tensorflow_Large-scale_machine_learning_on_heterogeneous_distributed_systems","319770252_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","318533663_Bayesian_Co-Boosting_for_Multi-modal_Gesture_Recognition","311610152_Online_Detection_and_Classification_of_Dynamic_Hand_Gestures_with_Recurrent_3D_Convolutional_Neural_Networks","306187539_Dynamic_Hand_Gesture_Recognition_for_Wearable_Devices_with_Low_Complexity_Recurrent_Neural_Networks","305218193_Efficient_and_precise_interactive_hand_tracking_through_joint_continuous_optimization_of_pose_and_correspondences","297757591_Sign_Language_Recognition_Using_Convolutional_Neural_Networks","291206539_A_Multi-scale_Boosted_Detector_for_Efficient_and_Robust_Gesture_Recognition","291206509_Multi-scale_Deep_Learning_for_Gesture_Detection_and_Localization"]}