{"id":"320954868_Resilient_Randomized_Quantized_Consensus","abstract":"We consider the problem of multi-agent consensus where some agents are subject to faults/attacks and might make updates arbitrarily. The network consists of agents taking integer-valued (i.e., quantized) states under directed communication links. The goal of the healthy normal agents is to form consensus in their state values, which may be disturbed by the non-normal, malicious agents. We develop update schemes to be equipped by the normal agents whose interactions are asynchronous and subject to non-uniform and time-varying time delays. In particular, we employ a variant of the so-called mean subsequence reduced (MSR) algorithms, which have been long studied in computer science, where each normal agent ignores extreme values from its neighbors. We solve the resilient quantized consensus problems in the presence of totally/locally bounded adversarial agents and provide necessary and sufficient conditions in terms of the connectivity notion of graph robustness. Furthermore, it will be shown that randomization is essential both in quantization and in the updating times when normal agents interact in an asynchronous manner.","authors":["Seyed Mehran Dibaji","Hideaki Ishii","Roberto Tempo"],"meta":["November 2017IEEE Transactions on Automatic Control PP(99):1-1","DOI:10.1109/TAC.2017.2771363","Project: Resilient Control"],"references":["312430697_Resilient_Consensus_of_Second-Order_Agent_Networks_Asynchronous_Update_Rules_with_Delays","318717413_Fault-Tolerant_Clock_Synchronization_Over_Unreliable_Channels_in_Wireless_Sensor_Networks","312042163_Resilient_randomized_quantized_consensus_with_delayed_information","305776169_Resilient_Randomized_Quantized_Consensus","283570768_Resilient_Multi-Agent_Consensus_with_Asynchrony_and_Delayed_Information","274196548_Consensus_of_second-order_multi-agent_systems_in_the_presence_of_locally_bounded_faults","273914442_A_Notion_of_Robustness_in_Complex_Networks","270292508_Crash-Tolerant_Consensus_in_Directed_Graphs","267189059_Graph_Theoretic_Methods_in_Multi-Agent_Networks","266703062_Distributed_Coordination_of_Multi-agent_Networks_Emergent_Problems_Models_and_Issues"]}