{"id":"320993585_Quantum_plug_n'_play_Modular_computation_in_the_quantum_regime","abstract":"Classical computation is modular. It exploits plug n' play architectures which allow us to use pre-fabricated circuits without knowing their construction. This bestows advantages such as allowing parts of the computational process to be outsourced, and permitting individual circuit components to be exchanged and upgraded. Here, we introduce a formal framework to describe modularity in the quantum regime. We demonstrate a 'no-go' theorem, stipulating that it is not always possible to make use of quantum circuits without knowing their construction. This has significant consequences for quantum algorithms, forcing the circuit implementation of certain quantum algorithms to be rebuilt almost entirely from scratch after incremental changes in the problem—such as changing the number being factored in Shor's algorithm. We develop a workaround capable of restoring modularity, and apply it to design a modular version of Shor's algorithm that exhibits increased versatility and reduced complexity. In doing so we pave the way to a realistic framework whereby 'quantum chips' and remote servers can be invoked (or assembled) to implement various parts of a more complex quantum computation.","authors":["Jayne Thompson","Kavan Modi","Vlatko Vedral","Mile Gu"],"meta":["November 2017New Journal of Physics 20(1)","DOI:10.1088/1367-2630/aa99b3"],"references":["309573000_Flexible_resources_for_quantum_metrology","280695576_Coherent_controlization_using_superconducting_qubits","260003313_Implementing_quantum_control_for_unknown_subroutines","257201722_Quantum_circuits_cannot_control_unknown_operations","232906027_Functional_Quantum_Computing_An_Optical_Approach","329645393_Design_Rules_The_Power_of_Modularity","280821144_Polynomial-Time_Algorithms_for_Prime_Factorization_and_Discrete_Logarithms_on_a_Quantum_Computer","242533283_Classes_of_Recursively_Enumerable_Sets_and_Their_Decision_Problems","238707861_Design_rules_The_power_of_modularity","220694260_An_Introduction_to_Theory_of_Numbers"]}