{"id":"320953077_Transcriptional_and_Post-Transcriptional_Mechanisms_of_the_Development_of_Neocortical_Lamination","abstract":"The neocortex is a laminated brain structure that is the seat of higher cognitive capacity and responses, long-term memory, sensory and emotional functions, and voluntary motor behavior. Proper lamination requires that progenitor cells give rise to a neuron, that the immature neuron can migrate away from its mother cell and past other cells, and finally that the immature neuron can take its place and adopt a mature identity characterized by connectivity and gene expression; thus lamination proceeds through three steps: genesis, migration, and maturation. Each neocortical layer contains pyramidal neurons that share specific morphological and molecular characteristics that stem from their prenatal birth date. Transcription factors are dynamic proteins because of the cohort of downstream factors that they regulate. RNA-binding proteins are no less dynamic, and play important roles in every step of mRNA processing. Indeed, recent screens have uncovered post-transcriptional mechanisms as being integral regulatory mechanisms to neocortical development. Here, we summarize major aspects of neocortical laminar development, emphasizing transcriptional and post-transcriptional mechanisms, with the aim of spurring increased understanding and study of its intricacies.","authors":["Tatiana Popovitchenko","Mladen-Roko Rasin"],"meta":["November 2017Frontiers in Neuroanatomy 11","DOI:10.3389/fnana.2017.00102"],"references":["318466986_The_Functioning_of_a_Cortex_without_Layers","317981966_The_doublesex-related_Dmrta2_safeguards_neural_progenitor_maintenance_involving_transcriptional_regulation_of_Hes1","316462962_The_RNA-binding_protein_MARF1_promotes_cortical_neurogenesis_through_its_RNase_activity_domain","316178309_Comprehensive_transcriptome_analysis_of_neocortical_layers_in_humans_chimpanzees_and_macaques","315498493_Transcriptomic_Perspectives_on_Neocortical_Structure_Development_Evolution_and_Disease","311335440_Dynamic_mRNA_Transport_and_Local_Translation_in_Radial_Glial_Progenitors_of_the_Developing_Brain","310951281_Delta-Notch_signalling_in_segmentation","310659762_Akirin2_is_essential_for_the_formation_of_the_cerebral_cortex","319274320_RNA_on_the_brain_emerging_layers_of_post-transcriptional_regulation_in_cerebral_cortex_development","317300652_Neurodevelopmental_protein_Musashi_1_interacts_with_the_Zika_genome_and_promotes_viral_replication"]}