{"id":"321090552_Context_Aware_Computing_Learning_and_Big_Data_in_Internet_of_Things_A_Survey","abstract":"Internet of Things (IoT) has been growing rapidly due to recent advancements in communications and sensor technologies. Meanwhile, with this revolutionary transformation, researchers, implementers, deployers, and users are faced with many challenges. IoT is a complicated, crowded, and complex field; there are various types of devices, protocols, communication channels, architectures, middleware, and more. Standardization efforts are plenty, and this chaos will continue for quite some time. What is clear, on the other hand, is that IoT deployments are increasing with accelerating speed, and this trend will not stop in the near future. As the field grows in numbers and heterogeneity, “intelligence” becomes a focal point in IoT. Since data now becomes “big data”, understanding, learning, and reasoning with big data is paramount for the future success of IoT. One of the major problems in the path to intelligent IoT is understanding “context”, or making sense of the environment, situation, or status using data from sensors, and then acting accordingly in autonomous ways. This is called “context aware computing”, and it now requires both sensing and, increasingly, learning, as IoT systems get more data and better learning from this “big data”. In this survey, we review the field, first, from a historical perspective, covering ubiquitous and pervasive computing, ambient intelligence, and wireless sensor networks, and then, move to context aware computing studies. Finally, we review learning and “big data” studies related to IoT. We also identify the open issues and provide an insight for future study areas for IoT researchers.\n\nLink: http://ieeexplore.ieee.org/document/8110603/","authors":["Omer Berat Sezer","Erdogan Dogdu","Murat Ozbayoglu"],"meta":["November 2017IEEE Internet of Things Journal Volume: 5(Issue: 1):1-27","DOI:10.1109/JIOT.2017.2773600","Project: IoT and Big Data Analytics"],"references":["322515935_Weather_data_analysis_and_sensor_fault_detection_using_an_extended_IoT_framework_with_semantics_big_data_and_machine_learning","313456501_An_extended_IoT_framework_with_semantics_big_data_and_analytics","308850426_Development_of_a_smart_home_ontology_and_the_implementation_of_a_semantic_sensor_network_simulator_An_Internet_of_Things_approach","308126056_Semantic_Framework_of_Internet_of_Things_for_Smart_Cities_Case_Studies","314276618_SDN-based_architecture_challenging_the_IoT_heterogeneity","313545527_A_SDN-IoT_Architecture_with_NFV_Implementation","313411496_Low-power_smart_passive_REU_for_industrial_IoT_applications","310484004_Distributed_Neural_Networks_for_Internet_of_Things_The_Big-Little_Approach","308810843_i-learning_IoT_An_intelligent_self_learning_system_for_home_automation_using_IoT","308004762_SDN_and_Virtualization_Solutions_for_the_Internet_of_Things_A_Survey"]}