{"id":"321051971_Multi-Classification_Approaches_for_Classifying_Mobile_App_Traffic","abstract":"The growing usage of smartphones in everyday life is deeply (and rapidly) changing the nature of traffic traversing home and enterprise networks, and the Internet. Different tools and middleboxes, such as performance enhancement proxies, network monitors and policy enforcement devices, base their functions on the knowledge of the applications generating the traffic. This requirement is tightly coupled to an accurate traffic classification, being exacerbated by the (daily) expanding set of apps and the moving-target nature of mobile traffic. On the top of that, the increasing adoption of encrypted protocols (such as TLS) makes classification even more challenging, defeating established approaches (e.g., Deep Packet Inspection). To this end, in this paper we aim to improve the performance of classification of mobile apps traffic by proposing a multi-classification (viz. fusion) approach, intelligently-combining outputs from state-of-the-art classifiers proposed for mobile and encrypted traffic classification. Under this framework, four classes of different combiners (differing in whether they accept soft or hard classifiers' outputs, the training requirements, and the learning philosophy) are taken into account and compared. The present approach enjoys modularity, as any classifier may be readily plugged-in/out to improve performance further. Finally, based on a dataset of (true) users' activity collected by a mobile solutions provider, our results demonstrate that classification performance can be improved according to all considered metrics, up to +9.5% (recall score) with respect to the best state-of-the-art classifier. The proposed system is also capitalized to validate a novel pre-processing of traffic traces, here developed, and assess performance sensitivity to traffic object (temporal) segmentation, before actual classification.","authors":["Giuseppe Aceto","Domenico Ciuonzo","Antonio Montieri","Antonio Pescapè"],"meta":["November 2017Journal of Network and Computer Applications 103","DOI:10.1016/j.jnca.2017.11.007","Project: Mobile and Encrypted Traffic Classification"],"references":["328176051_Eavesdropping_on_Fine-Grained_User_Activities_Within_Smartphone_Apps_Over_Encrypted_Network_Traffic","319624148_Traffic_Classification_of_Mobile_Apps_through_Multi-Classification","335832861_Reviewing_Traffic_Classification","327044796_A_Look_at_the_Mobile_App_Identification_Landscape","319770816_Combining_Pattern_Classifiers_Methods_and_Algorithms","316283269_Robust_Smartphone_App_Identification_Via_Encrypted_Network_Traffic_Analysis","316079866_Classification_of_Encrypted_Traffic_With_Second-Order_Markov_Chains_and_Application_Attribute_Bigrams","313172476_Early_application_identification","309219242_High_Performance_Traffic_Classification_based_on_Message_Size_Sequence_and_Distribution","305805366_A_Look_at_the_Mobile_App_Identification_Landscape"]}