{"id":"321042980_Multi-leader_election_in_dynamic_sensor_networks","abstract":"The leader election problem is one of the fundamental problems in distributed computing. Different from most of the existing results studying the multi-leader election in static networks or one leader election in dynamic networks, in this paper, we focus on the multi-leader election in dynamic sensor networks where nodes are deployed randomly. A centralized simple leader election algorithm (VLE), a distributed leader election algorithm (NMDLE), and a multi-leader election algorithm (PSMLE) are proposed so as to elect multi-leaders for the purpose of saving energy and prolonging the network lifetime, respectively. Specifically, the proposed algorithms aim at using less leaders to control the whole network, which is controlled by at least kopt leaders, here kopt denotes the optimal number of network partitions. Then we analyze the impacts of the sleep scheme of nodes and node moving on energy consumption and establish a theoretical model for energy cost. Finally, we provide extensive simulation results valuating the correctness of theoretical analysis.","authors":["Kan Yu","Meng Gao","Honglu Jiang","Guangshun Li"],"meta":["November 2017EURASIP Journal on Wireless Communications and Networking 2017(1)","DOI:10.1186/s13638-017-0961-9"],"references":["269180677_A_Local_Energy_Consumption_Prediction-Based_Clustering_Protocol_for_Wireless_Sensor_Networks","264934528_Ear-Phone_An_End-to-End_Participatory_Urban_Noise_Mapping_System","316308784_Approximate_Holistic_Aggregation_in_Wireless_Sensor_Networks","312247531_Extracting_Kernel_Dataset_from_Big_Sensory_Data_in_Wireless_Sensor_Networks","305977561_On_a_Voronoi_aggregative_process_related_to_a_bivariate_Poisson_process","304573646_Cost-Efficient_Strategies_for_Restraining_Rumor_Spreading_in_Mobile_Social_Networks","303957931_Shortest_Link_Scheduling_Algorithms_in_Wireless_Networks_Under_SINR","283801894_Approximate_Holistic_Aggregation_in_Wireless_Sensor_Networks","282598475_Approximate_aggregation_for_tracking_quantiles_and_range_countings_in_wireless_sensor_networks","281058681_Smoothed_Analysis_of_Dynamic_Networks"]}