{"id":"321009873_A_Game-Based_Competition_as_Instrument_for_Teaching_Artificial_Intelligence","abstract":"This paper reports about teaching Artificial Intelligence (AI) by applying the experiential approach called “learning by doing”, where traditional, formal teaching is integrated with a practical activity (a game competition, in our case), that is relevant for AI discipline and allows for an active and playful participation of students.\n\nStudents of the course of Fundamentals of AI at the University of Bologna have been challenged (on a voluntary base) to develop an AI software able to play the game of Nine Men’s Morris: at the end of the course, the software players have been compared within a tournament, so as to establish the competition winner. The game has been chosen to let the students deepen the knowledge about AI techniques in solving games, and to apply it in a real, not trivial setting.\n\nThe significance and the impact of this approach, from the educational point of view, have been assessed through two questionnaires, a first one focused on the technical aspects, and a second one on the students’ opinions about the initiative. The results are encouraging: students declare they felt highly motivated in studying AI algorithms and techniques, and they have been stimulated in autonomously search for extensions and new solutions not deeply investigated during traditional lessons.","authors":["Federico Chesani","Andrea Galassi","Paola Mello","Giada Trisolini"],"meta":["November 2017","DOI:10.1007/978-3-319-70169-1_6","Conference: XVIth International Conference of the Italian Association for Artificial IntelligenceAt: Bari"],"references":["264459392_Calculating_Ultra-Strong_and_Extended_Solutions_for_Nine_Men's_Morris_Morabaraba_and_Lasker_Morris","256436984_Didactic_Strategies_and_Technologies_for_Education_Incorporating_Advancements","317953505_Situated_learning_Legitimate_peripheral_participation","316874765_Symbolic_versus_sub-symbolic_approaches_a_case_study_on_training_Deep_Networks_to_play_Nine_Men's_Morris_game","290259399_Learning_Together_Apart","285481160_How_to_Run_a_Successful_Game-Based_AI_Competition","264125333_Open_classroom_Enhancing_student_achievement_on_artificial_intelligence_through_an_international_online_competition","239639462_Board_and_Table_Games_From_Many_Civilizations","224285715_Artificial_Intelligence_A_Modern_Approach","200044349_Artificial_Intelligence_A_Modern_Approach"]}