{"id":"321082321_WikiPathways_A_multifaceted_pathway_database_bridging_metabolomics_to_other_omics_research","abstract":"WikiPathways (wikipathways.org) captures the collective knowledge represented in biological pathways. By providing a database in a curated, machine readable way, omics data analysis and visualization is enabled. WikiPathways and other pathway databases are used to analyze experimental data by research groups in many fields. Due to the open and collaborative nature of the WikiPathways platform, our content keeps growing and is getting more accurate, making WikiPathways a reliable and rich pathway database. Previously, however, the focus was primarily on genes and proteins, leaving many metabolites with only limited annotation. Recent curation efforts focused on improving the annotation of metabolism and metabolic pathways by associating unmapped metabolites with database identifiers and providing more detailed interaction knowledge. Here, we report the outcomes of the continued growth and curation efforts, such as a doubling of the number of annotated metabolite nodes in WikiPathways. Furthermore, we introduce an OpenAPI documentation of our web services and the FAIR (Findable, Accessible, Interoperable and Reusable) annotation of resources to increase the interoperability of the knowledge encoded in these pathways and experimental omics data. New search options, monthly downloads, more links to metabolite databases, and new portals make pathway knowledge more effortlessly accessible to individual researchers and research communities.","authors":["Denise Slenter","Martina Kutmon","Kristina Hanspers","Anders Riutta"],"meta":["November 2017Nucleic Acids Research 46(Database issue)","DOI:10.1093/nar/gkx1064"],"references":["318109735_A_transcriptomics_data-driven_gene_space_accurately_predicts_liver_cytopathology_and_drug-induced_liver_injury","314972538_Bayesian_model_of_signal_rewiring_reveals_mechanisms_of_gene_dysregulation_in_acquired_drug_resistance_in_breast_cancer","311348207_KEGG_New_perspectives_on_genomes_pathways_diseases_and_drugs","308114723_The_metabolome_18_years_on_a_concept_comes_of_age","307813104_WikiPathways_App_for_Cytoscape_Making_biological_pathways_amenable_to_network_analysis_and_visualization_v2_ref_status_indexed_httpf1000res49l","305660424_Integration_of_targeted_metabolomics_and_transcriptomics_identifies_deregulation_of_phosphatidylcholine_metabolism_in_Huntington's_disease_peripheral_blood_samples","320199306_Reliable_Granular_References_to_Changing_Linked_Data","317717906_WikiGenomes_An_open_web_application_for_community_consumption_and_curation_of_gene_annotation_data_in_Wikidata","311675936_Identifying_known_unknowns_using_the_US_EPA's_CompTox_Chemistry_Dashboard","305375456_The_Reactome_pathway_Knowledgebase"]}