{"id":"321020678_Electronic_Lecture_Time-Table_Scheduler_Using_Genetic_Algorithm","abstract":"Lecture time-tabling preparation has always been\nknown as a typical scheduling problem that is time consuming,\nenergy sapping and often leading to general apathy and waste of\nresources. Planning time-table every session or semester is among\nthe most complex and error-prone task carried out in higher\ninstitutions of learning. Therefore, the need to adopt an\nelectronic system as opposed to the manual process cannot be\nover-emphasized. Several other administrative sectors of most\ninstitutions have been automated, but lecture time-tabling is still\ndone manually because of its inherent problems. Planning lecture\ntime-table demands enormous attention and effort from any\ninstitution because of its constraint satisfaction problem. The\nFederal Polytechnic Ilaro, the case study in this research operates\na Manual time tabling system (MTTS) that is done centrally,\nwhich makes it more difficult in getting a flawless lecture\nscheduling. This study developed an electronic lecture time-table\nscheduler (ELTS) using Genetic algorithm to provide\nconvenience in fixing classes and reduction in the risk of\nomission and clashes of courses, halls and lecturers.\nQuestionnaire was also prepared and administered to sample the\nopinions of staff, students and committee members involved in\nthe manual process. Difference in mean response on the two\nresponse variables of ELTS and MTTS was tested using Paired\nSample T-test technique. The result from the analysis\ncorroborates the fact that the new ELTS will be the best method\nin tackling the lapses experienced by the old system.","authors":["Jumoke Soyemi","Akinode John Lekan","Abiodun Samson Oloruntoba"],"meta":["November 2017","DOI:10.1109/DASC-PICom-DataCom-CyberSciTec.2017.124","Conference: 2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology CongressAt: Orlando, Florida, USA","Project: Design and Development of Automated LectureTime-tabling System"],"references":["271729669_The_Automation_of_the_Timetabling_Process_in_Higher_Education","222036135_Single-track_train_timetabling_with_guaranteed_optimality_Branch-and-bound_algorithms_with_enhanced_lower_bounds","258651163_University_Timetabling_based_on_Hard_Constraints_using_Genetic_Algorithm","240257402_Facilities_management_A_'Jack_of_all_trades'","239927876_Lecture_Timetabling_Using_Genetic_Algorithms","222567018_Recent_research_directions_in_automated_timetabling","37437221_Some_combinatorial_models_for_course_scheduling","2243688_Coordination_Techniques_for_Distributed_Artificial_Intelligence"]}