{"id":"321032878_Health_information_technology_and_health_care_activists_Where_is_the_place_of_Iranians","abstract":"Background\nThe level of knowledge and using health information technology by clinicians, students and staff has always been one of the essential issues in the field of health.\n\nObjective\nThe objective of the present study was to evaluate HIT knowledge, attitude, and practice habits among health care professionals and students in educational hospitals in Iran.\n\nMethods\nThis case study was carried out in 2016 on 539 personnel of 65 educational hospitals in Iran entailing three subgroups of physicians (n=128), medical students (n=97), and health record staff (n=314). A pretested self-administered questionnaire was designed to evaluate the knowledge, attitude and practice of health information technology. It was comprised of three parts of “baseline general characteristics”, “knowledge categories”, and “attitude and practice”.\n\nResults\nIn total, 28.8% of participants had a good level of knowledge about computer science, whereas 37.7% had a poor level of knowledge. A total of 40% showed good attitude and practice, while 25.6% had poor attitude and practice. Furthermore, 16.4% of physicians, 32% of students and 33.1% of health record staff had good knowledge, while poor knowledge was reported in 45.3% of physicians, 25.8% of students, and 37.6% of staff (p=0.304). The trend of good attitude and practice habits were respectively 28.9%, 50.5%, and 40.8% in physicians, students, and staff, whereas these trends were respectively 30.5%, 4.1%, and 29.9% for poor attitude and practice (p=0.163). Generally, the knowledge level of participants was positively related to the rate of attitude and practice (r=0.847, p<0.001), so the higher knowledge level brought about the higher score in attitude and practice.\n\nConclusion\nThe level of knowledge and practice of HIT was low among the physicians, students, and staff. Our university can provide a plenary program to promote the level of knowledge and information on practice of HIT.","authors":["Mobina Ghoochani","Kahouei Mehdi","Morteza Hemmat","Hesamedin Askari Majdabadi"],"meta":["October 2017Electronic Physician 9(10):5657-5662","DOI:10.19082/5657"],"references":["304185837_Health_Sciences_Students'_Self-Assessment_of_Information_and_Communication_Technology_Skills_and_Attitude_Toward_e-Learning","280060455_Attitude_of_Ayurveda_doctors_toward_the_impact_of_health_information_technology","268151599_User_Acceptance_of_Health_Information_Technology_HIT_in_Developing_Countries_A_Conceptual_Model","264810279_Role_of_Information_Communication_Technology_in_Higher_Education_Learners_Perspective_in_Rural_Medical_Schools","321549183_Monitoring_Technologies_in_Acute_Care_Environments_A_Comprehensive_Guide_to_Patient_Monitoring_Technology","287213747_The_Relationship_of_Health_Literacy_With_Use_of_Digital_Technology_for_Health_Information_Implications_for_Public_Health_Practice","283116183_Information_Technology_Adoption_and_Literacy_in_Health_Care_Practice_A_Case_Study","267732600_Technology_and_its_ethics_in_nursing_and_caring_journals_An_integrative_literature_review","263662773_Acceptance_and_use_of_electronic_medical_records_An_exploratory_study_of_hospital_physicians'_salient_beliefs_about_HIT_systems","242091432_Virtual_students'_perceptions_of_e-learning_in_Iran"]}