{"id":"321039694_NEARCHOS_Networked_Archaeological_Open_Science_Advances_in_Archaeology_Through_Field_Analytics_and_Scientific_Community_Sharing","abstract":"The full release and circulation of excavation results often takes decades, thus slowing down progress in archaeology to a degree not in keeping with other scientific fields. The nonconformity of released data for digital processing also requires vast and costly data input and adaptation. Archaeology should face the cognitive challenges posed by digital environments, changing in scope and rhythm. We advocate the adoption of a synergy between recording techniques, field analytics, and a collaborative approach to create a new epistemological perspective, one in which research questions are constantly redefined through real-time, collaborative analysis of data as they are collected and/or searched for in an excavation. Since new questions are defined in science discourse after previous results have been disseminated and discussed within the scientific community, sharing evidence in remote with colleagues, both in the process of field collection and subsequent study, will be a key innovative feature, allowing a complex and real-time distant interaction with the scholarly community and leading to more rapid improvements in research agendas and queries.","authors":["Nicolò Marchetti","Ivana Angelini","Gilberto Artioli","Giacomo Benati"],"meta":["December 2018Journal of Archaeological Research","DOI:10.1007/s10814-017-9112-4","Project: NEARCHOS"],"references":["320068431_OPEN_SCIENCE_IN_ARCHAEOLOGY","307834343_ONLINE_4D_RECONSTRUCTION_USING_MULTI-IMAGES_AVAILABLE_UNDER_OPEN_ACCESS","307705104_Online_access_and_sharing_of_reality-based_3d_models","305758645_3D_Archaeology_New_Perspectives_and_Challenges-The_Example_of_Catalhoyuk","321602744_Satellite_Remote_Sensing_A_New_Tool_for_Archaeology","321525834_Digitally_Archiving_Cultural_Objects","315958843_Social_science_and_archaeological_enquiry","312185501_Diegetic_user_interfaces_for_virtual_environments_with_HMDs_a_user_experience_study_with_oculus_rift","307885544_Archaeological_Information_Systems_AIS_Adapting_GIS_to_archaeological_contexts","300413415_Digitizing_Early_Farming_Cultures_customizing_the_Arches_Heritage_Inventory_Management_System"]}