{"id":"321026185_Processing_Skyline_Queries_in_Incomplete_Data_Issues_Challenges_and_Future_Trends","abstract":"In many contemporary database applications such as multi-criteria decision-making and real-time decision-support applications, data mining, e-commerce and recommendation systems, users need query operators to process the data aiming at finding the results that best fit with their preferences. Skyline queries are one of the most predominant query operators that privileges to find the query results that return only those data items whose dimension vector is not dominated by any other data item in the database. Because of their usefulness and ubiquity, skyline queries have been incorporated in different types of databases such as complete, incomplete and uncertain. This paper attempts to survey and analyse the previous works proposed to process skyline queries in incomplete database. The discussion focuses on examine these approaches highlighting the strengths and the weaknesses of each work. Besides, we also discuss in detail the current challenges in processing skyline queries in incomplete database and investigate the impact of incomplete data on skyline operation. A summary of most of the well-known works has been reported to identifying the limitations of those works. Some recommendations and future work directions have been drawn helping researchers to investigate the unsolved problems related to skyline queries in database system.","authors":["Yonis Gulzar","Ali Amer Alwan","Imad Alshaikhli","Norsaremah Salleh"],"meta":["November 2017Journal of Computer Science 13(11):647-658","DOI:10.3844/jcssp.2017.647.658","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["317818038_DERIVING_SKYLINE_POINTS_OVER_DYNAMIC_AND_INCOMPLETE_DATABASES","311381585_A_Model_for_Skyline_Query_Processing_in_a_Partially_Complete_Database","306048459_A_Framework_for_Evaluating_Skyline_Queries_over_Incomplete_Data","305080534_Processing_skyline_queries_in_incomplete_distributed_databases","303373632_Continuous_skyline_queries_on_multicore_architectures","296480084_Crowdsourced_Data_Management_A_Survey","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries","313830633_Skyline_Preference_Query_Based_on_Massive_and_Incomplete_Dataset","302476677_Optimizing_Skyline_Queries_over_Incomplete_Data","301257769_ISSA_Efficient_Skyline_Computation_for_Incomplete_Data","294288292_An_Efficient_Approach_for_Processing_Skyline_Queries_in_Incomplete_Multidimensional_Database","274175108_Skyline_Sets_Queries_for_Incomplete_Data","272785531_On_Efficient_k-Skyband_Query_Processing_over_Incomplete_Data","271020624_A_Framework_for_Identifying_Skylines_over_Incomplete_Data","278664991_Shooting_Stars_in_the_Sky"]}