{"id":"321030770_Omniscient_Debugging_for_Executable_DSLs","abstract":"Omniscient debugging is a promising technique that relies on execution traces to enable free traversal of the states reached by a model (or program) during an execution. While a few General-Purpose Languages (GPLs) already have support for omniscient debugging, developing such a complex tool for any executable Domain Specific Language (DSL) remains a challenging and error prone task. A generic solution must: support a wide range of executable DSLs independently of the metaprogramming approaches used for implementing their semantics; be efficient for good responsiveness. Our contribution relies on a generic omniscient debugger supported by efficient generic trace management facilities. To support a wide range of executable DSLs, the debugger provides a common set of debugging facilities, and is based on a pattern to define runtime services independently of metaprogramming approaches. Results show that our debugger can be used with various executable DSLs implemented with different metaprogramming approaches. As compared to a solution that copies the model at each step, it is on average sixtimes more efficient in memory, and at least 2.2faster when exploring past execution states, while only slowing down the execution 1.6times on average.","authors":["Erwan Bousse","Dorian Leroy","Benoit Combemale","Manuel Wimmer"],"meta":["November 2017Journal of Systems and Software 137","DOI:10.1016/j.jss.2017.11.025"],"references":["309369240_Object-oriented_design_pattern_for_DSL_program_monitoring","308901511_Execution_framework_of_the_GEMOC_studio_tool_demo","280699642_Supporting_Efficient_and_Advanced_Omniscient_Debugging_for_xDSMLs","271135270_Towards_a_Meta-Language_for_the_Concurrency_Concern_in_DSLs","269269106_A_Design_Pattern_to_Build_Executable_DSMLs_and_associated_VV_tools","309362937_Automated_testing_support_for_reactive_domain-specific_modelling_languages","305794650_Debugging_parallel_DEVS","291570406_Towards_Efficient_and_Scalabale_Omniscient_Debugging_for_Model_Transformations","283750883_Practical_domain-specific_debuggers_using_the_Moldable_Debugger_framework","267456099_A_tutorial_on_metamodelling_for_grammar_researchers"]}