{"id":"321043573_Psychological_targeting_as_an_effective_approach_to_digital_mass_persuasion","abstract":"People are exposed to persuasive communication across many different contexts: Governments, companies, and political parties use persuasive appeals to encourage people to eat healthier, purchase a particular product, or vote for a specific candidate. Laboratory studies show that such persuasive appeals are more effective in influencing behavior when they are tailored to individuals' unique psychological characteristics. However, the investigation of large-scale psychological persuasion in the real world has been hindered by the questionnaire-based nature of psychological assessment. Recent research, however, shows that people's psychological characteristics can be accurately predicted from their digital footprints, such as their Facebook Likes or Tweets. Capitalizing on this form of psychological assessment from digital footprints, we test the effects of psychological persuasion on people's actual behavior in an ecologically valid setting. In three field experiments that reached over 3.5 million individuals with psychologically tailored advertising, we find that matching the content of persuasive appeals to individuals' psychological characteristics significantly altered their behavior as measured by clicks and purchases. Persuasive appeals that were matched to people's extraversion or openness-to-experience level resulted in up to 40% more clicks and up to 50% more purchases than their mismatching or unpersonalized counterparts. Our findings suggest that the application of psychological targeting makes it possible to influence the behavior of large groups of people by tailoring persuasive appeals to the psychological needs of the target audiences. We discuss both the potential benefits of this method for helping individuals make better decisions and the potential pitfalls related to manipulation and privacy.","authors":["Sandra Matz","M. Kosinski","Gideon Nave","David Stillwell"],"meta":["November 2017Proceedings of the National Academy of Sciences 114(48):201710966","DOI:10.1073/pnas.1710966114"],"references":["312903276_Regulatory_fit_and_persuasion_basic_principles_and_remaining_questions","288520753_Life_in_the_network_The_coming_age_of_computational_social_science","281621604_Facebook_as_a_Research_Tool_for_the_Social_Sciences","308955266_Personalization_and_Personality_Some_Effects_of_Customizing_Message_Style_Based_on_Consumer_Personality","303497399_Facebook_as_a_Research_Tool_for_the_Social_Sciences_Opportunities_Challenges_Ethical_Considerations_and_Practical_Guidelines","296712696_The_World_Turned_Upside_Down","295674783_Dynamics_of_Communicator_and_Audience_Power_The_Persuasiveness_of_Competence_versus_Warmth","289916154_IEEE_TRANSACTIONS_ON_AFFECTIVE_COMPUTING_The_Pictures_we_Like_are_our_Image_Continuous_Mapping_of_Favorite_Pictures_into_Self-Assessed_and_Attributed_Personality_Traits","284041695_Self-Report_in_Organisational_Research_Problems_and_Prospects","270910076_Computer-based_personality_judgments_are_more_accurate_than_those_made_by_humans"]}