{"id":"321097020_Implementasi_Metode_K-Nearest_Neighbor_untuk_Rekomendasi_Keminatan_Studi_Studi_Kasus_Jurusan_Teknik_Informatika_Universitas_Brawijaya","abstract":"Abstrak Prodi Informatika Universitas Brawijaya mempunyai 5(lima) keminatan yang akan ditempuh mahasiswa dalam menjalani perkuliahan. Mengingat sangat pentingnya keminatan ini untuk perkuliahan mahasiswa yang nantinya juga berpengaruh pada tugas akhir (skripsi) hingga kelulusan mahasiswa, maka mahasiswa diharapkan untuk memilih keminatan yang sesuai dengan minat dan bakatnya. Berdasarkan Buku Pedoman Fakultas Ilmu Komputer Universitas Brawijaya tahun 2016 keminatan yang ada pada prodi Informatika ada 5 (lima) keminatan yaitu Rekayasa Perangkat Lunak, Komputasi Cerdas, Perangkat bergerak, Jaringan Komputer serta Game. Agar mahasiswa dapat memilih keminatan yang sesuai maka di perlukan sistem rekomendasi untuk keminatan mahasiswa dengan harapan mahasiswa dapat memilih keminatan yang sesuai dengan bakat, keinginan serta tentu saja nilai mata kuliah wajib yang sudah ditempuh. Dengan mengimplementasikan metode K-Nearest Neighbor yang bertujuan untuk memberikan rekomendasi keminatan berdasarkan atribut nilai-nilai mata kuliah wajib. Pengujian dilakukan dengan membandingkan hasil keminatan yang sudah diverifikasi oleh akademik kampus dengan hasil dari sistem. Dari pengujian data uji sebanyak 30 data mahasiswa yang sudah memilih keminatan maka didapatkan hasil akurasi sebanyak 76,66% terhadap data latih dengan nilai K yang paling optimal adalah K bernilai 10, maka dapat disimpulkan sistem rekomendasi keminatan ini dapat membantu mahasiswa memberikan rekomendasi keminatan yang akan dipilih. Abstract The Informatics Engineering Programme in Brawijaya University has 5 (five) interests that should be taken by each students in their course period. Considering the importance of this interests to students' academic process which later will affect their final project until their graduation, therefore students are expected to choose their insterests based on their attentiveness and ability. Based on the Faculty of Computer Science Handbook Universitas Brawijaya 2016, there are 5 (five) interests existing in Informatics Programme, namely Software Engineering, Smart Computing, Mobile devices, Computer Networks and Games. In order for students to choose the right interest then they need a recommendation system for students so that students can choose interest that suites their talent, desire and scores of courses that have been taken. By implementing K-Nearest Neighbor method which aims to give recommendation of interests based on attribute of compulsory courses scores. Testing is done by comparing the results of the interests that has been verified by campus' academic with the results of the system. From the test of data train as much as 30 data of students which have chosen their interests hence gotten the result of accuracy as much 76.66% to trainned data with the most optimal K value, the K value 10, therefore can be concluded this recommendation of interest system can help student give recommendation of interest which will be chosen.","authors":["Ilmu Fakultas","Komputer","Luthfi Anshori","Rekyan Regasari Mp"],"meta":["July 2018INSAN Jurnal Psikologi dan Kesehatan Mental","Project: Internet of Things untuk monitoring Kualitas Air Kolam Ikan"],"references":["44262413_MKNN_Modified_k-nearest_neighbor","271298477_Applying_k-Nearest_Neighbour_in_Diagnosing_Heart_Disease_Patients"]}