{"id":"321003980_Analysis_of_the_syllabus_of_Computer_Science_in_Health_System_for_Bachelors_of_Science_in_Nursing_professionals","abstract":"Introduction: in order to effectively and efficiently respond to the increasing quantitative and qualitative demand of Cuban society for having a professionally trained nurse with increasing and sustained competences; it is necessary to design a consistent system of training that guarantees access, permanence and continued development of young people.\n\nObjective: to carry out an assessment of the program of the subject Computer Science in Health System for Bachelors of Science in Nursing graduates, based on what is currently regulated into the methodological teaching work.\n\nMethods: a critical, reflexive and participatory review was conducted; each of the 5 programs comprising the subject were analyzed, the current regulation for the methodological teaching work, resolution 210/07 and the model of the Graduates in Nursing , supported by observation as an empirical method.\n\nResults: wide-ranging competencies and generalizing skills are proposed for each subject included in the program of study which must be methodologically oriented favoring the formulation of this training based on the objectives to be achieved from a developmental conception.\n\nConclusions: the assessments of the program indicate that the subject is conceived as a system of topics must respond to the training of the bachelor degree in nursing in order to assume the challenges the exercise of this profession compel , but methodologically the program of study is not oriented on how to approach the contents (system of skills, knowledge and values), so as to clearly determine the generalizing skills to be developed from each subject, which respond to the professional proficiency these graduates attain for their successful performance in the practice of the profession.","authors":["Ania Sosa Fernández","Ignacio Estévez Valdés","Damarys Padro Tejido","Inés Bárbara González Corrales"],"meta":["October 2017"],"references":["262496227_COMPETENCIA_EN_INVESTIGACION_EN_ENFERMERIA","317516750_La_gestion_de_la_informacion_Herramienta_esencial_para_el_desarrollo_de_habilidades_en_la_comunidad_estudiantil_universitaria"]}