{"id":"321069732_Applications_of_Deep_Learning_and_Reinforcement_Learning_to_Biological_Data","abstract":"Rapid advancement in the hardware based technologies over past decades opened up new possibilities for Biological and Life scientists to gather multimodal data from various application domains (e.g., Omics, Bioimaging, Medical Imaging, and [Brain/Body]-Machine Interfaces). Novel data intensive machine learning techniques are required to decipher these data. Recent research in Deep learning (DL), Reinforcement learning (RL), and their combination (Deep RL) promise to revolutionize Artificial Intelligence. Increasing computational power, faster data storage devices, and declining computing costs allowed scientists to apply these techniques on such enormous and complex datasets which otherwise would not have been possible. This review article provides a comprehensive survey of the applications of DL, RL, and Deep RL techniques in mining Biological data coming from various application domains. In addition, the performances of DL techniques when applied to different datasets pertaining to the various application domains have been compared. Finally, it outlines some open issues on this challenging research area and postulates possible future perspectives.","authors":["Mufti Mahmud","M. Shamim Kaiser","Amir Hussain","Stefano Vassanelli"],"meta":["November 2017IEEE Transactions on Neural Networks and Learning Systems PP(99)","DOI:10.1109/TNNLS.2018.2790388","Project: Advance machine learning for Biological data processing"],"references":["321859458_Hierarchical_Convolutional_Neural_Networks_for_EEG-Based_Emotion_Recognition","343099146_Data_Management_Challenges_for_Deep_Learning","335141602_Artificial_Intelligence_Foundations_of_Computational_Agents","327965052_Bio-Imaging_Principles_Techniques_and_Applications","324400278_Clustering_Algorithms","319770257_Exact_solutions_to_the_nonlinear_dynamics_of_learning_in_deep_linear_neural_networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317423207_A_Deep_Learning_Approach_for_Motor_Imagery_EEG_Signal_Classification","317085443_A_DEEP_LEARNING_APPROACH_FOR_CANCER_DETECTION_AND_RELEVANT_GENE_IDENTIFICATION","316806141_3D_Deeply_Supervised_Network_for_Automated_Segmentation_of_Volumetric_Medical_Images"]}