{"id":"321072817_Reviewer_bias_in_single-_versus_double-blind_peer_review","abstract":"Peer review may be \"single-blind,\" in which reviewers are aware of the names and affiliations of paper authors, or \"double-blind,\" in which this information is hidden. Noting that computer science research often appears first or exclusively in peer-reviewed conferences rather than journals, we study these two reviewing models in the context of the 10th Association for Computing Machinery International Conference on Web Search and Data Mining, a highly selective venue (15.6% acceptance rate) in which expert committee members review full-length submissions for acceptance. We present a controlled experiment in which four committee members review each paper. Two of these four reviewers are drawn from a pool of committee members with access to author information; the other two are drawn from a disjoint pool without such access. This information asymmetry persists through the process of bidding for papers, reviewing papers, and entering scores. Reviewers in the single-blind condition typically bid for 22% fewer papers and preferentially bid for papers from top universities and companies. Once papers are allocated to reviewers, single-blind reviewers are significantly more likely than their double-blind counterparts to recommend for acceptance papers from famous authors, top universities, and top companies. The estimated odds multipliers are tangible, at 1.63, 1.58, and 2.10, respectively.","authors":["Andrew Tomkins","Min Zhang","William D Heavlin"],"meta":["November 2017Proceedings of the National Academy of Sciences 114(48):201707323","DOI:10.1073/pnas.1707323114"],"references":["345948466_How_Professors_Think_Inside_the_Curious_World_of_Academic_Judgment","314093993_Computational_support_for_academic_peer_review_A_perspective_from_artificial_intelligence","313247780_Single_versus_Double_Blind_Reviewing_at_WSDM_2017","308698734_Single-blind_vs_Double-blind_Peer_Review_in_the_Setting_of_Author_Prestige","305742158_Double-blind_reviewing_at_EvoLang_11_reveals_gender_bias","304916997_Estimating_peer_effects_in_networks_with_peer_encouragement_designs","301851624_The_effects_of_double-blind_versus_single-blind_reviewing_Experimental_evidence_from_the_American_Economic_Review","296614847_Impact_of_double_blind_reviewing_on_SIGMOD_publication_A_more_detail_analysis","283588895_The_Peters_Ceci_Study_of_Journal_Publications","277815637_The_Matthew_effect_in_science"]}