{"id":"321049810_Situation-Aware_Protocol_Switching_in_Software-Defined_Wireless_Sensor_Network_Systems","abstract":"In this paper, a situation-aware protocol switching scheme is proposed for software-defined wireless sensor networks (SDWSNs) to support application-specific requirements in real-time. The proposed scheme consists of two phases — decision making and protocol deployment. In decision making, we use the supervised learning approach to choose the suitable routing protocols to be deployed in different time periods according to application-specific requirements. In the second phase, the chosen protocol is deployed in the network by the SDN controller in an adaptive manner. It is noteworthy that the proposed scheme can be integrated on top of the SDN controller in WSN to deploy a suitable routing protocol dynamically in the network. Extensive simulation results are analyzed to show the effectiveness of the proposed scheme, while varying the application-specific requirements. We see that the proposed scheme outperforms the existing schemes, in which a particular protocol is used in different time periods, in terms of energy consumption, throughput, packet delivery ratio, and delay in the network. It is shown that situation-aware protocol switching is capable of enhancing the network performance of SDWSNs.","authors":["Sudip Misra","Samaresh Bera","Achuthananda M P","Sankar K. Pal"],"meta":["November 2017IEEE Systems Journal PP(99)","DOI:10.1109/JSYST.2017.2774284","Project: Software-Defined Networking"],"references":["309133669_Soft-WSN_Software-Defined_WSN_Management_System_for_IoT_Applications","273303163_Energy_Minimization_in_Multi-Task_Software-Defined_Sensor_Networks","269300737_PayLess_A_low_cost_network_monitoring_framework_for_Software_Defined_Networks","268510155_Dynamically_reconfigurable_WSN_node_based_on_ISOIECIEEE_21451_TEDS","268241387_A_software_defined_wireless_sensor_network","308846358_SDN-WISE_Design_prototyping_and_experimentation_of_a_stateful_SDN_solution_for_WIreless_SEnsor_networks","289237188_DRRP_A_dynamically_reconfigurable_routing_protocol_for_WSN","283473015_An_SDN-assisted_Framework_for_Optimal_Deployment_of_MapReduce_Functions_in_WSNs","277145645_An_energy-efficient_SDN_based_sleep_scheduling_algorithm_for_WSNs","265445023_CS229_Lecture_notes"]}