{"id":"321094817_On_the_Antijamming_Performance_of_the_NR-DCSK_System","abstract":"This paper investigates the anti-jamming performance of the NR-DCSK system. We consider several practical jamming environments including broad-band jamming (BBJ), partial-time jamming (PTJ), tone jamming (TJ) consisting of both single-tone and multi-tone, and sweep jamming (SWJ). We first analytically derived the bit error rates of the considered system under the BBJ and the PTJ environments in closed-form expressions. Our derived results show that the system performances under these two jamming environments are enhanced as P increases, where P is the parameter of the NR-DCSK modulation scheme denoting the number of times a chaotic sample is repeated. In addition, our results demonstrate that for the PTJ, the optimal value of the jamming factor is close to zero when the jamming power is small, however, it increases and approaches one as the jamming power enlarges. We then investigate the performance of the considered system under the TJ and the SWJ environments via Monte-Carlo simulations. Our simulations show that single-tone jamming causes a more significant performance degradation than that provided by multi-tone jamming counterparts. Moreover, we point out that the system performance is significantly degraded when the starting frequency of the sweep jammer is close to the carrier frequency of the transmitted chaotic signals, the sweep bandwidth is small, and the sweep time is half of the transmitted bit duration.","authors":["Binh Van Nguyen","Hyoyoung Jung","Kiseon Kim"],"meta":["February 2018Security and Communication Networks 2018(12)","DOI:10.1155/2018/7963641","Project: Chaotic communications for Anti-Eavesdropping and Anti-Jamming Military Systems"],"references":["303532963_Wireless_Chaos-Based_Communication_Systems_A_Comprehensive_Survey","295085972_NR-DCSK_A_Noise_Reduction_Differential_Chaos_Shift_Keying_System","277553938_I-DCSK_An_Improved_Noncoherent_Communication_System_Architecture","260666876_Reference-Modulated_DCSK_A_Novel_Chaotic_Communication_Scheme","254059534_High-Efficiency_Differential-Chaos-Shift-Keying_Scheme_for_Chaos-Based_Noncoherent_Communication","313867536_Chirp-Like_Jamming_Mitigation_for_GPS_Receivers_Using_Wavelet-Packet-Transform-Assisted_Adaptive_Filters","301639187_Robust_Set-Membership_Filtering_Techniques_on_GPS_Sensor_Jamming_Mitigation","288993059_Design_of_a_Short_Reference_Non-Coherent_Chaos-Based_Communication_Systems","270632762_Phase-Separated_DCSK_A_Simple_Delay-Component-Free_Solution_for_Chaotic_Communications","246856968_Modern_Communications_Jamming_Principles_and_Techniques"]}