{"id":"321070436_Spatio-Temporal_Data_Mining_A_Survey_of_Problems_and_Methods","abstract":"Large volumes of spatio-temporal data are increasingly collected and studied in diverse domains including, climate science, social sciences, neuroscience, epidemiology, transportation, mobile health, and Earth sciences. Spatio-temporal data differs from relational data for which computational approaches are developed in the data mining community for multiple decades, in that both spatial and temporal attributes are available in addition to the actual measurements/attributes. The presence of these attributes introduces additional challenges that needs to be dealt with. Approaches for mining spatio-temporal data have been studied for over a decade in the data mining community. In this article we present a broad survey of this relatively young field of spatio-temporal data mining. We discuss different types of spatio-temporal data and the relevant data mining questions that arise in the context of analyzing each of these datasets. Based on the nature of the data mining problem studied, we classify literature on spatio-temporal data mining into six major categories: clustering, predictive learning, change detection, frequent pattern mining, anomaly detection, and relationship mining. We discuss the various forms of spatio-temporal data mining problems in each of these categories.","authors":["Gowtham Atluri","Anuj Karpatne","Vipin Kumar"],"meta":["November 2017ACM Computing Surveys 51(4)","DOI:10.1145/3161602","Project: Big Data in Climate"],"references":["318917041_Incremental_Dual-memory_LSTM_in_Land_Cover_Prediction","318916589_Tripoles_A_New_Class_of_Relationships_in_Time_Series_Data","317486104_B_rain_Z_oom_High_Resolution_Reconstruction_from_Multi-modal_Brain_Signals","317485490_Predict_Land_Covers_with_Transition_Modeling_and_Incremental_Learning","328249913_Statistical_analysis_of_spatial_and_spatio-temporal_point_patterns_third_edition","324469789_Forecasting_Structural_Time_Series_Models_and_the_Kalman_Filter","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318591322_Semantic_Understanding_of_Spatial_Trajectories","317788334_An_approach_for_global_monitoring_of_surface_water_extent_variations_in_reservoirs_using_MODIS_data","316286773_ST-SAGE_A_Spatial-Temporal_Sparse_Additive_Generative_Model_for_Spatial_Item_Recommendation"]}