{"id":"321096916_Challenges_and_Prospects_of_Blind_Spread_Spectrum_Medical_Image_Watermarking","abstract":"Spread Spectrum Watermarking is an emerging area in digital information security. Building from the security provided by this technology in Communication Engineering, one could leverage the same concept to hide patient data securely in a medical image to be transmitted to a remote physician for diagnostic purposes. Spread spectrum is known to hide information as low-power noise using coding sequences with high auto-correlation but low cross-correlation. This ensures that only recipients with the appropriate key can decode the information hidden in the cover and also that more than one user could hide data in the same cover without significant interference. Attackers would find it difficult to decode or even destroy the hidden information without destroying the cover itself. However, there are certain challenges such as amount of information that could be hidden, the fidelity of the information retrieved after unintentional processing and possibility of added information reducing the diagnostic quality of the medical image. In this research, both scholarly survey and experimental evidence were employed to investigate the challenges and possible solutions to utilizing spread spectrum watermarking in the area of medical data hiding for Tele-medicine. It was found that even though medical images with higher pixel depth have high watermark imperceptibility at high embedding rates, their susceptibility to noise is higher such that detection accuracy for blind watermarking is often below 100% for spatial domain watermarking. It is thus concluded that more adequate pre-processing and embedding strategy are needed in order to increase detection efficiency for robust watermark embedding for medical images with high embedding rates.","authors":["Peter U. Eze","Udaya Parampalli"],"meta":["November 2017","DOI:10.1109/NIGERCON.2017.8281873","Conference: 2017 IEEE 3rd International Conference on Electro-Technology for National DevelopmentAt: Federal University of Technology, Owerri, Nigeria","Project: Improving the robustness and reliability of telemedical data through spread spectrum steganography"],"references":["281493527_Robust_and_Large_Hiding_Capacity_Steganography_using_Spread_Spectrum_and_Discrete_Cosine_Transform","280315129_Spread_Spectrum_based_Invertible_Watermarking_for_Medical_Images_using_RNS_Chaos","271469713_An_Eigen-Based_Spreading_Sequences_Design_Framework_for_CDMA_Satellite_Systems","251871499_Kerckhoffs'_Principle_for_Intrusion_Detection","230849286_A_Review_of_Medical_Image_Watermarking_Requirements_for_Teleradiology","224200871_Spread_Spectrum-Based_Watermarking_for_Tardos_Code-Based_Fingerprinting_for_H264AVC_Video","263606329_Digital_Watermarking_and_Steganography","262695613_Watermarking_Techniques_used_in_Medical_Images_a_Survey","232904475_Watermarking_of_chest_CT_scan_medical_images_for_content_authentication","229887870_New_scheme_of_digital_watermarking_using_an_adaptive_embedding_strength_applied_on_multiresolution_filed_by_97_wavelet"]}