{"id":"321095166_Improving_Factor-Based_Quantitative_Investing_by_Forecasting_Company_Fundamentals","abstract":"On a periodic basis, publicly traded companies are required to report fundamentals: financial data such as revenue, operating income, debt, among others. These data points provide some insight into the financial health of a company. Academic research has identified some factors, i.e. computed features of the reported data, that are known through retrospective analysis to outperform the market average. Two popular factors are the book value normalized by market capitalization (book-to-market) and the operating income normalized by the enterprise value (EBIT/EV). In this paper: we first show through simulation that if we could (clairvoyantly) select stocks using factors calculated on future fundamentals (via oracle), then our portfolios would far outperform a standard factor approach. Motivated by this analysis, we train deep neural networks to forecast future fundamentals based on a trailing 5-years window. Quantitative analysis demonstrates a significant improvement in MSE over a naive strategy. Moreover, in retrospective analysis using an industry-grade stock portfolio simulator (backtester), we show an improvement in compounded annual return to 17.1% (MLP) vs 14.4% for a standard factor model.","authors":["John Alberg","Zachary Chase Lipton"],"meta":["November 2017"],"references":["308034527_Long-term_recurrent_convolutional_networks_for_visual_recognition_and_description","307747289_Show_and_tell_A_neural_image_caption_generator","305401279_Context_Matters_Refining_Object_Detection_in_Video_with_Recurrent_Neural_Networks","303822097_Recurrent_Neural_Networks_for_Multivariate_Time_Series_with_Missing_Values","301879215_Investigation_Into_The_Effectiveness_Of_Long_Short_Term_Memory_Networks_For_Stock_Price_Prediction","283761671_Learning_to_Diagnose_with_LSTM_Recurrent_Neural_Networks","269405423_ANN_Model_to_Predict_Stock_Prices_at_Stock_Exchange_Markets","308953671_Deep_Learning_for_Multivariate_Financial_Time_Series","308865815_A_LSTM-based_method_for_stock_returns_prediction_A_case_study_of_China_stock_market","269935372_Deep_Captioning_with_Multimodal_Recurrent_Neural_Networks_m-RNN"]}