{"id":"321017301_AUDIT_SISTEM_ENTERPRISE_ASSET_MANAGEMENT_MENGGUNAKAN_FRAMEWORK_COBIT_5","abstract":"ABSTRAK Penerapan teknologi informasi dalam suatu perusahaan dapat membantu proses bisnis lebih berkembang untuk mecapai tujuan strategis perusahaan. PT Mitrabara Adiperdana Tbk dan PT Baradinamika Mudasukses adalah perusahaan yang bergerak di bidang pertambangan batubara. Perusahaan telah menggunakan sistem EAM (Enterprise Asset Management) selama tujuh tahun. Sistem EAM membantu pengelolaan aset, penerapan EAM yang baik dapat memperpanjang umur aset. Audit sistem informasi bertujuan mengevaluasi tata kelola teknologi informasi perusahaan. Tujuan dari audit sistem EAM adalah untuk mengoptimalkan kontribusi nilai, mengelola perubahan dengan terkendali, dan mengelola aset sehingga dapat memberikan keuntungan yang lebih banyak bagi perusahaan. Penelitian ini berfokus pada sistem EAM bagian maintenance. Penelitian ini menggunakan capability model pada framework COBIT 5 untuk mengukur level kapabilitas pada setiap proses. Dalam melakukan pengumpulan data, penelitian ini menggunakan wawancara kepada narasumber yang bersangkutan. Level kapabilitas pada proses EDM02 mencapai level 3 dengan expected level adalah 4. Pada proses BAI06 rata-rata level kapabilitas adalah 2.75 dengan expected level adalah 3. Serta pada proses BAI09 rata-rata level kapabilitas adalah 2.8 dengan expected level adalah 3. Hasil penelitian berdasarkan analisis level kapabilitas setiap proses berupa rekomendasi yang disarankan untuk diimplementasikan oleh perusahaan untuk meningkatkan optimasi nilai, pengelolaan perubahan, dan aset. ABSTRACT Implementation of information technology in a company can help developing business processes to reach company's strategic goals. PT Mitrabara Adiperdana Tbk and PT Baradinamika Mudasukses are companies engaged in coal mining. The company has been using EAM (Enterprise Asset Management) system for seven years. EAM system is useful for managing assets, implementation of EAM can extend life of assets. Information systems audit aims to evaluate company's technology governance. The purpose of EAM system audit is to optimize value contribution, manage changes in a controlled manner, and manage assets to provide more profit to the company. This research focuses on maintenance aspect of EAM system. This research uses capability model in COBIT 5 framework to measure capability level in each process. In conducting this research, data collection using interviews to the relevant informant. Capability level in EDM02 process reach level 3 with expected level is 4. In process BAI06 average capability level is 2.75 with expected level is 3. And in process BAI09 average capability level is 2.8 with expected level is 3. The result of research based on analysis of capability level of each process is recommended to be implemented by company to improve value optimization, manage changes, and assets.","authors":["Pistia Octaviyanti","Johanes Andry"],"meta":["January 2018"],"references":["328197492_Audit_Sistem_Informasi_Menggunakan_Cobit_41_pada_PT_Erajaya_Swasembada_Tbk","320254270_Performance_Measurement_of_IT_Based_on_COBIT_Assessment_A_Case_Study","317113795_Audit_of_IT_Governance_Based_on_COBIT_5_Assessments_A_Case_Study","31735050_Information_Systems_Control_and_Audit_R_Weber"]}