{"id":"321022497_Short-crested_wave_breaking","abstract":"Peregrine (1998, 1999), in discussing the effect of local variations of wave energy dissipation as a generation mechanism for vorticity at the scale of individual waves, spurred a wave of study of vorticity dynamics and mixing processes in the wave-driven ocean. In deep water, the limited depth of penetration of breaking effects leads to the conceptual forcing of a smoke-ring resulting from the localized cross-section of impulsive forcing, as elaborated by Pizzo and Melville (2013). In shallow water, depth limitations favor the generation of a quasi-two-dimensional field of vertical vortex structures, with a resulting inverse cascade of energy to low wavenumbers and the evolution of flows such as transient rip currents (Johnson and Pattiaratchi, 2006). In this presentation, we consider vorticity-generating mechanisms ranging from the generation of patterns of vertical vorticity in 2D, depth-averaged flows, to a more detailed picture of the vorticity field evolving during a localized breaking event. Using an LES/VOF model (Derakhti and Kirby, 2014), we examine the evolution of coherent vortex structures whose initial scales are determined by the width of the breaking region, and are much larger than the locally-controlled reverse horseshoe structures seen in typical studies of along-crest uniform breaking. We study the persistence of three-dimensionality of these structures and their contribution to the development of depth-integrated vertical vorticity, but also point out the persistent presence of both components of horizontal vorticity as a result of the isolated breaking event.","authors":["James T Kirby","Morteza Derakhti"],"meta":["November 2017European Journal of Mechanics - B/Fluids 73","DOI:10.1016/j.euromechflu.2017.11.001","Project: 3-D Wave-Driven Nearshore Circulation"],"references":["308087831_NHWAVE_Consistent_boundary_conditions_and_turbulence_modeling","293801055_Breaking-onset_energy_and_momentum_flux_in_unsteady_focused_wave_packets","279289729_Bubble_entrainment_and_liquid-bubble_interaction_under_unsteady_breaking_waves","259436996_Vortex_generation_by_deep-water_breaking_waves","313768453_Laboratory_study_of_steep_and_breaking_waves","308171465_Wave_breaking_in_the_surf_zone_and_deep_water_in_a_non-hydrostatic_RANS_model_Part_2_Turbulence_and_mean_circulation","277917613_Boussinesq_modeling_of_longshore_currents_in_the_SandyDuck_experiment_under_directional_random_wave_conditions","263163737_Fully_nonlinear_long-waves_models_in_presence_of_vorticity","263006746_The_Generation_of_Surfzone_Eddies_in_a_Strong_Alongshore_Current","260922953_Numerical_treatment_of_wave_breaking_on_unstructured_finite_volume_approximations_for_extended_Boussinesq-type_equations"]}