{"id":"321124896_Improving_galaxy_morphologies_for_SDSS_with_Deep_Learning","abstract":"We present a morphological catalogue for $\\sim$ 670,000 galaxies in the Sloan Digital Sky Survey in two flavours: T-Type, related to the Hubble sequence, and Galaxy Zoo 2 (GZ2 hereafter) classification scheme. By combining accurate existing visual classification catalogues with machine learning, we provide the largest and most accurate morphological catalogue up to date. The classifications are obtained with Deep Learning algorithms using Convolutional Neural Networks (CNNs). We use two visual classification catalogues, the GZ2 and the Nair et al. 2010, for training CNNs with color images in order to obtain T-Types and a series of GZ2 type questions (disk/features, edge-on galaxies, bar signature, bulge prominence, roundness and mergers). We also provide an additional probability enabling a separation between pure elliptical (E) from S0, where the T-Type model is not so efficient. For the T-Type, our results show smaller offset and scatter than previous models trained with support vector machines. For the GZ2 type questions, our models have large accuracy (> 97\\%), precision and recall values (> 90\\%) when applied to a test sample with the same characteristics as the one used for training, i.e., with small uncertainties in the GZ2 classification. When we apply our models to a subset of galaxies with larger uncertainties in GZ2 (low agreement between classifiers), the resulting probability distributions show a clear bimodality. This allows us to recover a significant fraction of galaxies with a robust classification, for which the GZ2 was classification was uncertain. The catalogue is publicly released with the paper.","authors":["H. Domínguez Sánchez","M. Huertas-Company","M. Bernardi","Diego Tuccillo"],"meta":["November 2017","DOI:10.1093/mnras/sty338"],"references":["274094291_Rotation-invariant_convolutional_neural_networks_for_galaxy_morphology_prediction","314115654_Comparing_PyMorph_and_SDSS_photometry_II_The_differences_are_more_than_semantics_and_are_not_dominated_by_intracluster_light","312545914_Comparing_PyMorph_and_SDSS_photometry_I_Background_sky_and_model_fitting_effects","305455711_The_Euclid_mission_design","304814454_Galaxy_Zoo_Comparing_the_demographics_of_spiral_arm_number_and_a_new_method_for_correcting_redshift_bias","301878767_The_high_mass_end_of_the_stellar_mass_function_Dependence_on_stellar_population_models_and_agreement_between_fits_to_the_light_profile","289406930_The_Dark_Energy_Survey_More_than_dark_energy_-_an_overview","283335633_A_Catalogue_of_Two-Dimensional_Photometric_Decompositions_in_the_SDSS-DR7_Spectroscopic_Main_Galaxy_Sample_Extension_to_g-_and_i-Bands","282000211_A_Catalog_of_Visual-like_Morphologies_in_the_5_CANDELS_Fields_Using_Deep_Learning","281486597_A_universal_structural_and_star-forming_relation_since_zsim3_connecting_compact_star-forming_and_quiescent_galaxies"]}