{"id":"321131549_Communicating_amidst_the_noise_Modeling_the_aggregate_influence_of_ambient_and_vessel_noise_on_baleen_whale_communication_space_in_a_national_marine_sanctuary","abstract":"Anthropogenic noise negatively impacts many species. One of the more insidious\neffects of elevated noise levels is the reduction in area over which animals are able to acoustically\ncommunicate, often termed communication masking. This study utilizes modeling approaches to\nevaluate relative levels of masking for 4 baleen whale species from the combination of current\nambient noise conditions and noise from discrete vessels operating in the Stellwagen Bank Nat -\nional Marine Sanctuary. Acoustic data were collected using bottom-mounted autonomous recorders.\nOne day was analyzed for each of 5 different species-specific sound types, corresponding to peaks\nin occurrence of fin and humpback whale songs, humpback whale social sounds, minke whale\npulse trains and North Atlantic right whale gunshots. Source levels for animals and 3 categories of\nvessels were calculated empirically; sound propagation was modeled using Bellhop ray tracing.\nAn agent-based modeling framework was used to calculate changes in communication space (CS)\nin comparison to reference conditions (10 dB lower than current ambient noise). In these singleday\nsnapshots, current ambient noise and noise from vessels for which automatic identification\nsystem (AIS) data were available contribute most heavily to loss of CS, followed by whale-watching\nand fishing vessels. Right whale gunshots experience the least amount of masking, while fin,\nhumpback and minke whale signals experience masking levels of 80% or more. While these\nresults incorporate several simplifying assumptions, this study further develops the framework by\nwhich to comparatively quantify masking, providing information on the relative degree of masking\nexperienced between species and allowing for important insights on the relative contributions\nof different anthropogenic sound sources.","authors":["Danielle Marie Cholewiak","Christopher Willes Clark","Dimitri Ponirakis","Adam S Frankel"],"meta":["May 2018Endangered Species Research 36","DOI:10.3354/esr00875"],"references":["296686679_Modeling_the_aggregated_exposure_and_responses_of_bowhead_whales_Balaena_mysticetus_to_multiple_sources_of_anthropogenic_underwater_sound","289571556_Can_you_hear_me_here_Managing_acoustic_habitat_in_US_waters","288664513_Communication_masking_in_marine_mammals_A_review_and_research_strategy","282045878_Quieter_marine_protected_areas","352111649_Acoustic_Communication_Social_Sounds_and_the_Potential_Impacts_of_Noise","320781340_Marine_Mammals_and_Noise","313238038_Acoustic_communication_and_behavior_of_the_southern_right_whale_Eubalaena_australis","312341106_Whale_watching_worldwide_tourism_numbers_expenditures_and_expanding_economic_benefits_a_special_report_from_the_International_Fund_for_animal_welfare","288521038_Finite-element_ray_tracing","272496048_Come_dine_with_me_food-associated_social_signalling_in_wild_bottlenose_dolphins_Tursiops_truncatus"]}