{"id":"321180719_Single-Shot_Refinement_Neural_Network_for_Object_Detection","abstract":"For object detection, the two-stage approach (e.g., Faster R-CNN) has been achieving the highest accuracy, whereas the one-stage approach (e.g., SSD) has the advantage of high efficiency. To inherit the merits of both while overcoming their disadvantages, in this paper, we propose a novel single-shot based detector, called RefineDet, that achieves better accuracy than two-stage methods and maintains comparable efficiency of one-stage methods. RefineDet consists of two inter-connected modules, namely, the anchor refinement module and the object detection module. Specifically, the former aims to (1) filter out negative anchors to reduce search space for the classifier, and (2) coarsely adjust the locations and sizes of anchors to provide better initialization for the subsequent regressor. The latter module takes the refined anchors as the input from the former to further improve the regression and predict multi-class label. Meanwhile, we design a transfer connection block to transfer the features in the anchor refinement module to predict locations, sizes and class labels of objects in the object detection module. The multi-task loss function enables us to train the whole network in an end-to-end way. Extensive experiments on PASCAL VOC 2007, PASCAL VOC 2012, and MS COCO demonstrate that RefineDet achieves state-of-the-art detection accuracy with high efficiency. Code is available at https://github.com/sfzhang15/RefineDet.","authors":["Shifeng Zhang","Longyin Wen","Xiao Bian","Zhen Lei"],"meta":["June 2018","DOI:10.1109/CVPR.2018.00442","Conference: IEEE Conference on Computer Vision and Pattern Recognition (CVPR)","Project: Object Detection"],"references":["321369549_SFD_Single_Shot_Scale-invariant_Face_Detector","320495167_Detecting_Face_with_Densely_Connected_Face_Proposal_Network","319164062_FaceBoxes_A_CPU_Real-time_Face_Detector_with_High_Accuracy","326566753_Focal_Loss_for_Dense_Object_Detection","322060558_Deformable_Convolutional_Networks","320967941_YOLO9000_Better_Faster_Stronger","320964522_RON_Reverse_Connection_with_Objectness_Prior_Networks_for_Object_Detection","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","319770331_ParseNet_Looking_Wider_to_See_Better","319770284_Edge_Boxes_Locating_Object_Proposals_from_Edges"]}