{"id":"321180174_Deep_Supervised_Learning_Using_Local_Errors","abstract":"Error backpropagation is a highly effective mechanism for learning high-quality hierarchical features in deep networks. Updating the features or weights in one layer, however, requires waiting for the propagation of error signals from higher layers. Learning using delayed and non-local errors makes it hard to reconcile backpropagation with the learning mechanisms observed in biological neural networks as it requires the neurons to maintain a memory of the input long enough until the higher-layer errors arrive. In this paper, we propose an alternative learning mechanism where errors are generated locally in each layer using fixed, random auxiliary classifiers. Lower layers could thus be trained independently of higher layers and training could either proceed layer by layer, or simultaneously in all layers using local error information. We address biological plausibility concerns such as weight symmetry requirements and show that the proposed learning mechanism based on fixed, broad, and random tuning of each neuron to the classification categories outperforms the biologically-motivated feedback alignment learning technique on the MNIST, CIFAR10, and SVHN datasets, approaching the performance of standard backpropagation. Our approach highlights a potential biological mechanism for the supervised, or task-dependent, learning of feature hierarchies. In addition, we show that it is well suited for learning deep networks in custom hardware where it can drastically reduce memory traffic and data communication overheads.","authors":["Hesham Mostafa","Vishwajith Ramesh","Gert Cauwenberghs"],"meta":["November 2017Frontiers in Neuroscience 12","DOI:10.3389/fnins.2018.00608"],"references":["319856813_In-Datacenter_Performance_Analysis_of_a_Tensor_Processing_Unit","319770123_Densely_Connected_Convolutional_Networks","318360042_Hardware-Efficient_On-line_Learning_through_Pipelined_Truncated-Error_Backpropagation_in_Binary-State_Networks","317357018_NullHop_A_Flexible_Convolutional_Neural_Network_Accelerator_Based_on_Sparse_Representations_of_Feature_Maps","324690431_Revisiting_Small_Batch_Training_for_Deep_Neural_Networks","319770421_Convolutional_Clustering_for_Unsupervised_Learning","319770323_EIE_Efficient_Inference_Engine_on_Compressed_Deep_Neural_Network","319770276_CNN_Features_off-the-shelf_an_Astounding_Baseline_for_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770112_Stacked_What-Where_Auto-encoders"]}