{"id":"321169483_Style-based_motion_analysis_for_dance_composition","abstract":"Synthesizing human motions from existing motion capture data is the approach of choice in most applications requiring high- quality visual results. Usually to synthesize motion, short motion segments are concatenated into longer sequences by finding transitions at points where character poses are similar. If similarity is only a measure of posture correlation, without consideration for the stylistic variations of movement, the resulting motion might have unnatural discontinuities. Particularly prone to this problem are highly stylized motions, such as dance performances. This work presents a motion analysis framework, based on Laban Movement Analysis, that also accounts for stylistic variations of the movement. Implemented in the context of Motion Graphs, it is used to eliminate potentially problematic transitions and synthesize style-coherent animation, without requiring prior labeling of the data. The effectiveness of our method is demonstrated by synthesizing contemporary dance performances that include a variety of different emotional states. The algorithm is able to compose highly stylized motions that are reminiscent to dancing scenarios using only plausible movements from existing clips.","authors":["Andreas Aristidou","Efstathios Stavrakis","Margarita Papaefthimiou","George Papagiannakis"],"meta":["December 2018The Visual Computer 34(12):1725–1737","DOI:10.1007/s00371-017-1452-z"],"references":["318717425_Emotion_control_of_unstructured_dance_movements","312985021_Interactive_dancing_game_with_real-time_recognition_of_continuous_dance_moves_from_3D_human_motion_capture","312771174_Fast_local_and_global_similarity_searches_in_large_motion_capture_databases","303036265_Continuous_body_emotion_recognition_system_during_theater_performances","324636504_PERFORM_Perceptual_Approach_for_Adding_OCEAN_Personality_to_Human_Motion_Using_Laban_Movement_Analysis","313564784_Learning_motion_style_synthesis_from_perceptual_observations","313550520_Motion_texture_A_two-level_statistical_model_for_character_motion_synthesis","309565898_PERFORM_Perceptual_approach_for_adding_OCEAN_personality_to_human_motion_using_laban_movement_analysis","305218345_A_deep_learning_framework_for_character_motion_synthesis_and_editing","305218344_Spectral_Style_Transfer_for_Human_Motion_between_Independent_Actions"]}