{"id":"321106152_Konzeptplanung_von_Montagesystemen_mit_graphen-basierten_Entwurfssprachen","abstract":"Produzierende Unternehmen unterliegen einem kontinuierlichen und zum Teil fundamentalen Wandel. Be-reits heute stehen diese Unternehmen unter einem immer stärker zunehmenden Zeitdruck, einem anhalten-denden Kostendruck, und gleichzeitig steigt die Komplexität der Produkte und Prozesse. Für Unternehmen, deren Kernkompetenz Montageprozesse sind, ist daher ein Ansatz, mit dem schneller bessere und nachhal-tigere Ergebnisse bei der Planung von Montagesystemen erzielen zu können, erforderlich. In diesem Beitrag wird die Idee eines innovativen Ansatzes für einen automatisierten Entwurfsprozess, der die Konzeptphase von Montagesystemen umfasst, dargestellt. Die Berücksichtigung von unterschiedlichen Eingangsgrößen (z. B. die Produktstruktur) und Anforderungen (z. B. wirtschaftliche oder technische) an die Auslegung ei-nes Montagesystems, sind wesentliche Elemente, um ein eine ganzheitliche Gestaltung unter Berücksichti-gung aller relevanten Eingangsgrößen zu erzielen. Häufig sind diese Eingangsgrößen mit Unsicherheiten behaftet, die es ebenfalls in der Modellierung zu berücksichtigen gilt. Als ein möglicher Ansatz für eine effiziente und schnelle Planung mit Hilfe einer wissensbasierten Entwurfsmethode ist der Einsatz von graphenbasierten Entwurfssprachen. Durch die wis-sensbasierte Entwurfsmethode kann ein digitales und regelbasiert ausführbares Abbild des Entwurfsprozes-ses dargestellt werden. Dabei wird das Entwurfswissen in Form von Regeln und Vokabeln abgelegt. In ei-nem Engineering-Framework wird dieses ausgeführt und ein zentrales Modell erzeugt. Durch den automati-sierten Entwurfsprozess können dann vollautomatisch weitere Modelle (z. B. in domänenspezifischen An-wendungen) erzeugt werden, die anschließend validiert, bewertet oder im Entwurfsprozess weiterverarbeitet werden können.","authors":["Theresa Breckle","Jens Kiefer","Markus Kiesel","Martin Manns"],"meta":["April 2017","Conference: ASIM-Treffen STS/GMMS 2017At: Ulm"],"references":[]}