{"id":"321122646_Validating_and_verifying_the_requirements_and_design_of_a_haemodialysis_machine_using_the_Rodin_toolset","abstract":"We present a formal specification and analysis of a haemodialysis machine (HD machine) in Event-B using the Rodin Toolset. The medical device domain is a particularly complex multidisciplinary field involving disparate branches of engineering, biological and medical fields as well as a critical patient-machine interface. Requirements include safety properties, process steps, human-machine interfaces, timing constraints, dynamic control algorithms, and design features. Our aim is to demonstrate that the Event-B based modelling, verification and validation tools deal with the variety of requirements involved in a typical medical device. We utilise ProR for structuring and tracking requirements. We model the HD machine using iUML-B state-machines and class diagrams, and build a corresponding BMotion Studio visualisation. For verification, we use both theorem proving and model checking techniques. We validate the design of the system using (i) diagrams to aid the modelling of the sequential properties of the requirements, and (ii) ProB-based animation and visualisation tools to explore the system's behaviour. Some of the safety properties involve dynamic behaviour which is difficult to verify in Event-B. For these properties we use (iii) co-simulation tools to validate against a continuous model of the physical behaviour. We conclude that the Event-B based modelling tools are particularly rich in verification and validation techniques and with the help of supporting tools for requirements tracking, are able to address the different kinds of requirements in a medical device.","authors":["Thai Son Hoang","Colin Snook","Asieh Salehi Fathabadi","Michael Butler"],"meta":["November 2017Science of Computer Programming 158","DOI:10.1016/j.scico.2017.11.002"],"references":["282010001_Formalizing_the_Cardiac_Pacemaker_Resynchronization_Therapy","271826296_The_Unit-B_Method_-_Refinement_Guided_by_Progress_Concerns","228772647_Failure_modes_in_medical_device_software_An_analysis_of_15_years_of_recall_data","221224338_A_Tutorial_on_Uppaal","220744295_Reasoning_about_Liveness_Properties_in_Event-B","43652213_Rodin_An_Open_Toolset_for_Modelling_and_Reasoning_in_Event-B","2956521_A_Formal_Methods_Approach_to_Medical_Device_Review","303557266_Translating_B_to_TLA_for_validation_with_TLC","261918757_Integrating_SMT_solvers_in_Rodin","245029002_Formal_verification_of_software-based_medical_devices_considering_medical_guidelines","220992808_Visualising_Event-B_Models_with_B-Motion_Studio","220071276_Proving_the_Correctness_of_Multiprocess_Programs","39994313_ProB_An_Automated_Analysis_Toolset_for_the_B_Method","2956530_Ensuring_Patient_Safety_in_Wireless_Medical_Device_Networks"]}