{"id":"321136324_Internal_quality_assurance_for_external_contributions_in_GitHub_An_empirical_investigation","abstract":"For popular open-source software projects, there are always a large number of worldwide developers who have been glued to making code contributions, while most of these developers play the role of casual contributors because of their very limited code commits. The frequent turnover of such a group of developers and the wide variations in their coding experiences challenge the project management on code and quality. This paper aims to investigate the status quo of internal quality assurance for external contributions in social coding sites. We first conducted a case study of 21 popular GitHub projects to estimate the code quality of the casual contributors. The quantitative results show that the casual contributors introduced greater quantity and severity of code quality issues than the main contributors; the developers who contribute to different projects as main and casual contributors did not perform significantly differently in terms of their code quality. On the basis of these findings, we further conducted a survey of 81 developers on GitHub to understand their practices on internal quality assurance. The qualitative results expose some limitations of present internal quality control for external contributions in GitHub. Finally, we discuss an alternative quality management paradigm: Continuous Inspection for industrial practices.","authors":["Yao Lu","Xinjun Mao","Zude Li","Yang Zhang"],"meta":["November 2017Journal of Software: Evolution and Process 30(50):e1918","DOI:10.1002/smr.1918"],"references":["309149831_Thresholds_for_Size_and_Complexity_Metrics_A_Case_Study_from_the_Perspective_of_Defect_Density","305788567_Determinants_of_pull-based_development_in_the_context_of_continuous_integration","303755164_Initial_and_Eventual_Software_Quality_Relating_to_Continuous_Integration_in_GitHub","303099372_The_sky_is_not_the_limit_multitasking_across_GitHub_projects","323402782_Code_quality_from_the_programmer's_perspective","316921883_Boosting_bug-report-oriented_fault_localization_with_segmentation_and_stack-trace_analysis","311653164_Social_media_in_GitHub_the_role_of_-mention_in_assisting_software_development","308814578_Tracking_Static_Analysis_Violations_over_Time_to_Capture_Developer_Characteristics","308495563_Boosting_Bug-Report-Oriented_Fault_Localization_with_Segmentation_and_Stack-Trace_Analysis","305296096_Towards_a_Metrics_Suite_for_Object_Oriented_Design"]}