{"id":"321168013_The_influence_of_parental_smartphone_use_eye_contact_and_'bystander_ignorance'_on_child_development","abstract":"Digital technologies and media have changed the daily lives of families around the world by creating new interactional contexts and relational patterns (e.g. Wartella et al. 2013; Ólafsson et al. 2013). The familial use of digital media has quickly formed anew the structure, function and mentality of family interaction. Smartphones are the flagships of new digital media and the amount of smartphone owners (Smith 2015), as well as the frequency of their use (Turkle 2015; Rosen 2012; ebrand 2015), has been increasing rapidly. The shift from “Computer Age” to “Smartphone Age” is reality all over the world (Carson & Jonsson 2015). \nA common response to criticism of new technology states that it has always been met with suspicion and dystopias, which in hindsight have turned out to be exaggerated. The hampering effects of smartphone use on simultaneous face-to-face -interaction has been coined the phenomena of “Sticky Media Device” and worry has been raised about parental smartphone use in particular (Chapter 9 in this book by Mantere and Raudaskoski). But why would using a smartphone differ in this regard from, say, reading a book or fixing a coffee machine? Can't parental attention be “stuck” on various things and so make responses to a child missing or confused?\nIn this chapter we will illustrate the central mechanisms of smartphone use that, from the point of view of small children, set the parental use of smartphone significantly apart from that of many other usages of objects in the visible home environment. There is a point to be made that for example television and magazines do not create a similar adjacency pair structure with their user (Mantere & Raudaskoski, chapter 9), but we also argue that there are other yet uninspected elements of smartphone use, which will be crucial for understanding what the spread of smartphones into everyday lives of families can mean for child development. Compared with the handling of other objects in the home environment, the use of smartphone is exceptional in two major ways: 1) it catches a gaze and thus draws the caregiver away from the participation framework and 2) it conveys exceptionally little signs of the aspects of the activity that the caregiver is engaging in.\nWe start off the chapter by considering the meaning of gaze in early interaction, paving the way to attachment and social skills. After that we discuss the affordances of environmental artifacts and their part in socialization process. Then we introduce a new concept of “bystander ignorance”, which illustrates the role of smartphone use from the point of view of another person in the same physical space with the smartphone user. We approach bystander ignorance by considering the situational aspects of parental smartphone use relevant to a small child. In conclusion, we sum up the main points of the chapter and discuss the need for further studies.","authors":["Sanna Raudaskoski","Eerik Mantere","Satu Valkonen"],"meta":["September 2017","In book: Media, Family Interaction and the Digitalization of Childhood (pp.173 - 184)Chapter: 11Publisher: Edward ElgarEditors: Anja Riitta Lahikainen, Tiina Mälkiä, Katja Repo","Project: New social norms in the smartphone era"],"references":["313018278_Children's_use_of_online_technologies_in_Europe_a_review_of_the_European_evidence_base_revised_edition","312616338_Formulating_planes_seeing_as_a_situated_activity","271180035_The_Intentional_Stance","344318848_Mother-infant_attachment_and_psychoanalysis_The_eyes_of_shame","320182162_The_Perception_of_the_Environment_Essays_in_Livelihood_Dwelling_and_Skill","308342114_Socialization_Parent-Child_Interaction_in_Everyday_Life","288865833_Imitation_of_Facial_and_Hand_Gestures_by_Human_Neonates","284292101_Formal_structures_of_practical_tasks_A_resource_for_action_in_the_social_life_of_very_young_children","269425684_Forms_of_Talk","259253284_The_ecological_approach_to_visual_perception"]}