{"id":"321160754_Exploring_the_Use_of_Shatter_for_AllSAT_Through_Ramsey-Type_Problems","abstract":"In the context of SAT solvers, Shatter is a popular tool for symmetry breaking on CNF formulas. Nevertheless, little has been said about its use in the context of AllSAT problems: problems where we are interested in listing all the models of a Boolean formula. AllSAT has gained much popularity in recent years due to its many applications in domains like model checking, data mining, etc. One example of a particularly transparent application of AllSAT to other fields of computer science is computational Ramsey theory. In this paper we study the effect of incorporating Shatter to the workflow of using Boolean formulas to generate all possible edge colorings of a graph avoiding prescribed monochromatic subgraphs. Generating complete sets of colorings is an important building block in computational Ramsey theory. We identify two drawbacks in the na\\\"ive use of Shatter to break the symmetries of Boolean formulas encoding Ramsey-type problems for graphs: a \"blow-up\" in the number of models and the generation of incomplete sets of colorings. The issues presented in this work are not intended to discourage the use of Shatter as a preprocessing tool for AllSAT problems in combinatorial computing but to help researchers properly use this tool by avoiding these potential pitfalls. To this end, we provide strategies and additional tools to cope with the negative effects of using Shatter for AllSAT. While the specific application addressed in this paper is that of Ramsey-type problems, the analysis we carry out applies to many other areas in which highly-symmetrical Boolean formulas arise and we wish to find all of their models.","authors":["David Narváez"],"meta":["November 2017"],"references":["314814537_Solving_difficult_SAT_instances_in_the_presence_of_symmetry","306118536_On_Local_Domain_Symmetry_for_Model_Expansion","285271125_Breaking_Symmetries_in_Graph_Search_with_Canonizing_Sets","283335132_Computing_the_Ramsey_Number_R433_using_Abstraction_and_Symmetry_breaking","282603514_Implementing_Efficient_All_Solutions_SAT_Solvers","265655095_Small_Ramsey_Numbers","318664890_The_science_of_brute_force","262362449_Boolean_satisfiability_for_sequence_mining","262221930_All-SAT_using_minimal_blocking_clauses","256660314_Conflict-driven_answer_set_solving_From_theory_to_practice","242503674_Graphs_Groups_and_Surfaces","255409884_Symmetry_and_Satisfiability","242029072_Combinatorial_Designs_by_SAT_Solvers","238883563_On_the_weak_pigeonhole_principle","238871891_On_the_existence_of_specified_cycles_in_complementary_graphs"]}