{"id":"321197205_OptiqueVQS_a_Visual_Query_System_over_Ontologies_for_Industry","abstract":"An important application of semantic technologies in industry has been the formalisation of information models using OWL 2 ontologies and the use of RDF for storing and exchanging application data. Moreover, legacy data can be virtualised as RDF using ontologies following the ontology-based data access (OBDA) approach. In all these applications, it is important to provide domain experts with query formulation tools for expressing their information needs in terms of queries over ontologies. In this work, we present such a tool, OptiqueVQS, which is designed based on our experience with OBDA applications in Statoil and Siemens and on best HCI practices for interdisciplinary engineering environments. OptiqueVQS implements a number of unique techniques distinguishing it from analogous query formulation systems. In particular, it exploits ontology projection techniques to enable graph-based navigation over an ontology during query construction. Secondly, while OptiqueVQS is primarily ontology driven, it exploits sampled data to enhance selection of data values for some data attributes. Finally, OptiqueVQS is built on well-grounded requirements, design rationale, and quality attributes. We evaluated OptiqueVQS with both domain experts and casual users and qualitatively compared our system against prominent visual systems for ontology-driven query formulation and exploration of semantic data. OptiqueVQS is available online and can be downloaded together with an example OBDA scenario.","authors":["Ahmet Soylu","Evgeny Kharlamov","Dmitriy Zheleznyakov","Ernesto Jiménez-Ruiz"],"meta":["August 2017Semantic Web 9(1–2)","DOI:10.3233/SW-180293","Projects: SIRIUSOptique"],"references":["318123829_Ontology_Based_Data_Access_in_Statoil","314681861_Semantic_access_to_streaming_and_static_data_at_Siemens","313066221_Capturing_Industrial_Information_Models_with_Ontologies_and_Constraints","311818203_Querying_Industrial_Stream-Temporal_Data_an_Ontology-based_Visual_Approach","319393483_OWL_2_Web_Ontology_Language_Direct_Semantics","313065984_Towards_Analytics_Aware_Ontology_Based_Access_to_Static_and_Streaming_Data","312721366_How_Semantic_Technologies_Can_Enhance_Data_Access_at_Siemens_Energy","304553121_QueryVOWL_A_Visual_Query_Notation_for_Linked_Data","304352133_Ontop_Answering_SPARQL_queries_over_relational_databases","304021625_Ontology-Based_Integration_of_Streaming_and_Static_Relational_Data_with_Optique"]}