{"id":"321137181_A_study_of_different_representation_conventions_during_investigatory_sensemaking","abstract":"Background\nDuring the process of conducting investigations, users structure information externally to\nhelp them make sense of what they know, and what they need to know. Software-based\nvisual representations may be a natural place for doing this, but there are a number of types of information structuring that might be supported and hence designed for. Further, there might be important differences in how well different representational conventions support sensemaking. There are questions about what type of representational support might allow these users to be more effective when interacting with information.\n\nAim\nTo explore the impact that different types of external representational structuring have on\nperformance and user experience during intelligence type investigations. Intelligence\nanalysis represents a difficult example domain were sensemaking is needed. We have a\nparticular interest in the role that timeline representations might play given evidence that\npeople are naturally predisposed to make sense of complex social scenarios by constructing narratives. From this we attempt to quantify possible benefits of timeline representation during investigatory sensemaking, compared with argumentation representation.\n\nMethod\nParticipants performed a small investigation using the IEEE 2011 VAST challenge dataset in which they structured information either as a timeline, an argumentation or as they wished (freeform). 30 participants took part in the study. The study used three levels of a between participants independent variable of representation type. The dependent variables were performance (in terms of recall, precision efficiency and understanding) and user experience (in terms of cognitive load, engagement and confidence in understanding).\n\nResult\nThe result shows that the freeform condition experienced a lower cognitive load than the\nother two: timeline and argument respectively. A post hoc exploratory analysis was\nconducted to better understand the information behaviour and structuring activities across conditions and to better understand the types of structuring that participants perform in the freeform condition. The analysis resulted in an Embedded Representational Structuring Theory (ERST) that helps to characterise and describe representations primarily in terms of their elements and their relations.\n\nConclusion\nThe results suggest that: (a) people experienced lower cognitive load when they are free to structure information as they wish, (b) during their investigations, they create complex\nheterogeneous representations consisting of various entities and multiple relation types and (c) their structuring activities can be described by a finite set of structuring conventions.","authors":["Efeosasere Okoro"],"meta":["November 2017","Thesis for: Masters by Research in Visual Analytics"],"references":["262406185_Scaffolding_Computer_Supported_Argumentation_Processes_through_Mini_Map_Based_Interaction_Techniques","254303284_Perceived_Time_as_a_Measure_of_Mental_Workload_Effects_of_Time_Constraints_and_Task_Success","245489403_Argument_Mapping_with_ReasonAble","297712579_Information_seeking_gathering_and_review_Journalism_as_a_case_study_for_the_design_of_search_and_authoring_systems","289239659_Psychological_Time_Interval_Length_Judgments_and_Subjective_Passage_of_Time_Judgments","285071274_A_Cognitive_Theory_of_Juror_Decision_Making_The_Story_Model","270960227_A_data-frame_theory_of_sensemaking","269452844_Story_and_Discourse_Narrative_Structure_in_Fiction_and_Film","263761363_Statistics_Without_Maths_for_Psychology","245889876_Designing_and_Reporting_Experiments_in_Psychology"]}