{"id":"321183997_Learning_Style_Classification_Based_on_Student's_Behavior_in_Moodle_Learning_Management_System","abstract":"In learning field, each student has his own learning style that affects his way of get, process, understand and percept information. Determining the learning style of students enhances the performance of learning process. Two methods are commonly used to acquire student's learning style: static by questionnaire and dynamic by tracing student's navigation on e-learning environment. In this paper, a new approach to classify students dynamically depending on their learning style was proposed. This approach was experimented on 35 students for Data Structure online course created using Moodle. By extracting students' behavior, data from Moodle log, the learning style for each student was identified according to Felder and Silverman model. Also, learning style based on the behavior have been compared with a quiz results conducted at the end of the course. Receiver operating characteristic (ROC) curve have been used to evaluate the quality of classification results comparing with quiz results. Good results with average accuracy of 76% are achieved. Students' data have been divided into four training and testing sets with different splitting ratio. Different testing accuracy values are obtained for the different ratios using each dimension of Felder-Silverman learning style model (FSLSM).","authors":["Manal Abdullah","Asmaa Alqahtani","Jawhara Aljabri","Reem Altowirgi"],"meta":["February 2015","DOI:10.14738/tmlai.31.868","Projects: intrference avoidancelearning styles in e-learning to improve teaching the Algorithms courses"],"references":["309120076_Learning_and_teaching_styles_in_engineering_education_Engr","271550786_Learning_styles_vs_suitable_courses","264224326_Understanding_Student_Differences","239584383_Decision_Rule_Induction_in_a_Learning_Content_Management_System","228403640_Index_of_Learning_Styles_Questionnaire","225924875_Data_Mining_Methods_for_Recommender_Systems","222511520_Introduction_to_ROC_analysis","299825605_Overview_Converging_Technologies_for_Improving_Human_Performance","282624282_A_Comparative_Data_Mining_Technique_for_David_Kolb's_Experiential_Learning_Style_Classification","261268445_Toward_a_Fully_Automatic_Learner_Modeling_Based_on_Web_Usage_Mining_with_Respect_to_Educational_Preferences_and_Learning_Styles"]}