{"id":"321148188_Solving_Everyday_Challenges_in_a_Computational_Way_of_Thinking","abstract":"Over a decade, computational thinking (CT) has been in the focus of educators and researchers in computer science. During this period of time, the term has been developed in different ways, reaching from a fundamental idea for finding a definition what problem-solving in computer science is about to a very particular view that CT is a required skill to code software applications. This paper presents results of the Fulbright project coThink - Computational Thinking carried out at the Missouri State University in Springfield, MO, USA which was based on the research question: How can CT be utilized with computer science algorithms for challenging real-life situations? As a result of a literature review, a CT five-step problem-solving process aimed at improving students’ awareness to handle everyday life situations was identified. It was further integrated in classroom lessons, where it was applied at four student groups and evaluated mixing qualitative (analysis of worksheets) and quantitative methods (questionnaire) at a sample size of n = 75. Results showed that students frequently discovered a good approximation to solve real-life challenges following computer science algorithms but we also came to the conclusion to revise our problem-solving process.","authors":["Bernhard Standl"],"meta":["November 2017","DOI:10.1007/978-3-319-71483-7_15","Conference: International Conference on Informatics in Schools: Situation, Evolution, and Perspectives","Project: Fulbright Project coThink - Computational Thinking"],"references":["308499063_It's_Computational_Thinking_Bebras_Tasks_in_the_Curriculum","303668799_Computational_Thinking_for_All_Pedagogical_Approaches_to_Embedding_21st_Century_Problem_Solving_in_K-12_Classrooms","299450690_Computational_thinking_the_developing_definition","282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","274309848_Computational_Thinking","273772180_Computational_Thinking_in_K-9_Education","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","310792069_The_long_quest_for_computational_thinking","283504240_Grounding_Computational_Thinking_Skill_Acquisition_Through_Contextualized_Instruction","267014649_Algorithms_Unplugged"]}