{"id":"321167484_Video_et_analyse_de_l'activite","abstract":"Cette contribution s'intéresse aux utilisations qui peuvent être faites de la vidéo dans une perspective d'analyse de l'activité et dans une visée transformative (formation, (ré)organisation du travail, aménagement de poste, prévention, fiabilisation, conception, etc.). Elle présente synthétiquement les principales options méthodologiques à prendre par les intervenants – ergonomes, formateurs, chercheurs, consultants – pour analyser les activités et/ou les faire analyser aux bénéficiaires (i) en extériorité (part observable) et (ii) en intériorité (point de vue des acteurs). Concernant l'analyse en intériorité, l'instrumentation vidéo est notamment décrite selon trois options distinctes : (i) la démonstration (exemplification, pratiques ostensives – approche plutôt normative de la transformation de l’activité), (ii) l’enquête (recherche, instruction d’un problème – approche plutôt développementale de la transformation de l’activité), et (iii) l’entretien (explicitation, remise en situation). Ces trois options sont caractérisées à partir de la littérature scientifique en ergonomie, psychologie du travail et sciences de l'éducation. La conclusion propose des points de vigilance et perspectives de développement inhérents aux types d'instrumentations vidéo décrits.","authors":["Simon Flandin"],"meta":["October 2017","In book: Encyclopédie d'analyse des activités (pp.193-205)Edition: 1Chapter: 7Publisher: PUFEditors: Jean-Marie Barbier & Marc Durand","Project: ENACTS - Environnements Numériques d'Aide à la Compréhension et à la Transformation des Situations"],"references":["320796172_Video_formation_et_transformations_de_l'activite_professionnelle","311466836_Exploiter_la_video_dans_les_dispositifs_de_formation_des_enseignants_novices_conceptualisation_et_discussion_theoriques_a_partir_d'une_etude_de_cas_en_EPS","281856192_Exploiter_le_potentiel_des_processus_de_renormalisation_en_formation_a_l'enseignement","272819833_Videoformation_orientee-activite_quelles_utilisations_pour_quels_effets_sur_les_enseignants","269567154_Les_entretiens_d'autoconfrontation_et_de_remise_en_situation_par_les_traces_materielles_et_le_programme_de_recherche_cours_d'action","8339266_Auto-_and_allo-confrontation_as_tools_for_reflective_activities","331111710_Analyse_de_l'activite_d'enseignants_stagiaires_du_second_degre_en_situation_de_videoformation_autonome_contribution_a_un_programme_de_recherche_technologique_en_formation","283354989_Trois_approches_contrastees_de_la_videoformation_dans_le_paysage_francophone_Tensions_epistemologiques_et_effets_en_formation","281581979_Enregistrement_en_perspective_subjective_situee_et_entretien_en_re_situ_subjectif_Une_methodologie_de_constitution_de_l'experience","270819420_Goal-Directed_Action"]}