{"id":"321168354_Analyzing_Polarization_of_Social_Media_Users_and_News_Sites_during_Political_Campaigns","abstract":"Social media analysis is a fast growing research area aimed at extracting useful information from social networks. Recent years have seen a great interest from academic and business world in using social media to measure public opinion. This paper presents a methodology aimed at discovering the behavior of social network users and how news sites are used during political campaigns characterized by the rivalry of different factions. As a case study, we present an analysis on the constitutional referendum that was held in Italy on December 4, 2016. A first goal of the analysis was to study how Twitter users expressed their voting intentions about the referendum in the weeks before the voting day, so as to understand how the voting trends have evolved before the vote, e.g., if there have been changes in the voting intentions. According to our study, 48% of Twitter users were polarized toward no, 25% toward yes, and 27% had a neutral behavior. A second goal was to understand the effects of news sites on the referendum campaign. The analysis has shown that some news sites had a strong polarization toward yes (unita.tv, ilsole24ore.it and linkiesta.it), some others had a neutral position (lastampa.it, corriere.it, huffingtonpost.it and repubblica.it) and others were oriented toward no (ilfattoquotidiano.it, ilgiornale.it and beppegrillo.it).","authors":["Fabrizio Marozzo","Alessandro Bessi"],"meta":["November 2017Social Network Analysis and Mining 8(1)","DOI:10.1007/s13278-017-0479-5"],"references":["314142627_Big_Data_Analysis_on_Clouds","308187926_Analyzing_social_media_data_to_discover_mobility_patterns_at_EXPO_2015_Methodology_and_results","305166631_Following_Soccer_Fans_from_Geotagged_Tweets_at_FIFA_World_Cup_2014","303392985_Social_media_and_political_communication_in_the_2014_elections_to_the_European_Parliament","278833969_Social_Media_in_Public_Opinion_Research_Executive_Summary_of_the_Aapor_Task_Force_on_Emerging_Technologies_in_Public_OPinion_Research","306129743_Data_Analysis_in_the_Cloud_Models_Techniques_and_Applications","299867565_Media_Bias_in_German_Online_Newspapers","288906520_Random_forests","287796858_Twitter_Use_in_Election_Campaigns_A_Systematic_Literature_Review","284673771_Opening_Closed_Regimes_What_Was_the_Role_of_Social_Media_During_the_Arab_Spring"]}