{"id":"321148186_Promoting_Computational_Thinking_Skills_Would_You_Use_this_Bebras_Task","abstract":"Bebras, an international challenge organized on an annual basis in several countries (50 in 2016), has the goal of promoting informatics and computational thinking through attractive tasks. We analyzed Bebras tasks by considering the Computational Thinking (CT) skills each task promotes, starting from the operational definition of CT developed by the International Society for Technology in Education (ISTE) and the ACM-founded Computer Science Teachers Association (CSTA). We argue that such an approach is indeed well-suited to present Bebras tasks, especially with the goal to use them in curricular teaching: framing them as CT enablers helps in making explicit their educational potential, that can be appreciated also by teachers without a formal education in informatics and adapted to a wide range of ages and schools. We explored the viability of our approach by interviewing teachers of different kinds of schools. We propose to use these CT skills also as a tool to classify Bebras tasks, which results in a more uniform distribution of tasks, w.r.t. the one obtained by leveraging content topics.","authors":["Annalisa Calcagni","Violetta Lonati","Dario Malchiodi","Mattia Monga"],"meta":["November 2017","DOI:10.1007/978-3-319-71483-7_9","Conference: International Conference on Informatics in Schools: Situation, Evolution, and Perspectives"],"references":["315831218_Developing_a_Two-Dimensional_Categorization_System_for_Educational_Tasks_in_Informatics","308499063_It's_Computational_Thinking_Bebras_Tasks_in_the_Curriculum","291411712_Informatics_Education_based_on_Solving_Attractive_Tasks_through_a_Contest","221437671_Bebras_International_Contest_on_Informatics_and_Computer_Literacy_Criteria_for_Good_Tasks","221437589_What's_the_Fun_in_Informatics_Working_to_Capture_Children_and_Teachers_into_the_Pleasure_of_Computing","319133932_Conceptions_and_Misconceptions_about_Computational_Thinking_among_Italian_Primary_School_Teachers","317989565_Bebras_as_a_Teaching_Resource_Classifying_the_Tasks_Corpus_Using_Computational_Thinking_Skills","228580987_Fundamental_ideas_of_computer_science","220807117_The_beaver_contest_attracting_youngsters_to_study_computing"]}