{"id":"321189367_Research_on_elastic_resource_management_for_multi-queue_under_cloud_computing_environment","abstract":"As a new approach to manage computing resource, virtualization technology is more and more widely applied in the high-energy physics field. A virtual computing cluster based on Openstack was built at IHEP, using HTCondor as the job queue management system. In a traditional static cluster, a fixed number of virtual machines are pre-allocated to the job queue of different experiments. However this method cannot be well adapted to the volatility of computing resource requirements. To solve this problem, an elastic computing resource management system under cloud computing environment has been designed. This system performs unified management of virtual computing nodes on the basis of job queue in HTCondor based on dual resource thresholds as well as the quota service. A two-stage pool is designed to improve the efficiency of resource pool expansion. This paper will present several use cases of the elastic resource management system in IHEPCloud. The practical run shows virtual computing resource dynamically expanded or shrunk while computing requirements change. Additionally, the CPU utilization ratio of computing resource was significantly increased when compared with traditional resource management. The system also has good performance when there are multiple condor schedulers and multiple job queues.","authors":["Zhenjing CHENG","Haibo LI","Qiulan HUANG","Yaodong Cheng"],"meta":["October 2017Journal of Physics Conference Series 898(9):092003","DOI:10.1088/1742-6596/898/9/092003"],"references":["288020779_Using_the_glideinWMS_System_as_a_Common_Resource_Provisioning_Layer_in_CMS","288019992_Lightweight_scheduling_of_elastic_analysis_containers_in_a_competitive_cloud_environment_a_Docked_Analysis_Facility_for_ALICE","271530646_High-Throughput_Computing_Versus_High-Performance_Computing_for_Groundwater_Applications","265114856_Kernel-based_Virtual_Machine_Technology","261163854_A_Performance_Study_on_the_VM_Startup_Time_in_the_Cloud","259510665_VM_consolidation_A_real_case_based_on_OpenStack_Cloud","234805485_Building_a_Monitoring_Infrastructure_with_Nagios","231073622_A_future_project_at_tibet_The_large_high_altitude_air_shower_observatory_LHAASO","228661937_KVM_The_Linux_virtual_machine_monitor","224224850_OpenNebula_A_Cloud_Management_Tool"]}