{"id":"321116176_Reverse_engineering_modeling_methods_and_tools_a_survey","abstract":"Reverse Engineering (RE) is a long-term goal of engineering and computer science; it aims at the reconstruction of CAD models from measured data by means of 3D mathematical surfaces and geometrical features representing the geometry of a physical part. In the last two decades, reviews and surveys have occasionally covered this topic, but a systematic dissertation of modeling methods from a mechanical engineering point of view is still missing. The purpose of this paper is to fill this gap; starting from a general description of the overall RE framework (acquisition, segmentation, classification, fitting), both an up-to-date survey and a categorization of available modeling techniques and tools working on 3D data are provided. The main aspects of various strategies are discussed as well, in order to highlight strengths and weaknesses characterizing different approaches. Moreover, an overview of commercial software for RE is presented, considering both dedicated solutions and packages supplied as add-on with ‘traditional’ CAD systems. Finally, possible improvements to be addressed by the research in the RE field are discussed, outlining potential future trends that are still to be investigated.","authors":["Francesco Buonamici","Monica Carfagni","Rocco Furferi","Lapo Governi"],"meta":["November 2017Computer-Aided Design and Applications 15(3):1-22","DOI:10.1080/16864360.2017.1397894","Project: 3D VIsion, Reverse Engineering, CAD modelling"],"references":["319770544_A_survey_of_content_based_3D_shape_retrieval_methods","317575447_A_Multi-view_Recurrent_Neural_Network_for_3D_Mesh_Segmentation","315525687_Review_of_reverse_engineering_systems_-_current_state_of_the_art","312681332_Reverse_Engineering_of_3D_Models_Based_on_Image_Processing_and_3D_Scanning_Techniques","308824674_User-assisted_reverse_modeling_with_evolutionary_algorithms","301901685_From_reverse_engineering_to_shape_engineering_in_mechanical_design","297468115_Reconstruction_technique_for_turbine_blade_based_on_constraint_of_sectional_feature","293286938_Reverse_engineering_of_solid_models","289032805_GlobFit","288855413_3D_Mesh_Labeling_via_Deep_Convolutional_Neural_Networks"]}