{"id":"321242447_FWCMR_A_scalable_and_robust_fuzzy_weighted_clustering_based_on_MapReduce_with_application_to_microarray_gene_expression","abstract":"Data clustering is a very useful data mining technique to find groups of similar objects present in the dataset. Scalability to handle immense volumes, robustness to intrinsic outlier data and validity of clustering results are the main challenges of any data clustering approach. In order to address these challenges, a fuzzy weighted clustering approach which is comprehensibly parallel and distributed in every phase, is proposed in this research. Although the proposed method can be used for various data clustering purposes, it has been applied in gene expression clustering to reveal functional relationships of genes in a biological process. Conforming to MapReduce, the proposed method also presents a novel similarity measure which benefits from combining ordered weighted averaging and Spearman correlation coefficient. In the proposed method, density reachable genes were joined to establish subclusters. Afterwards, final cluster results were obtained by merging these subclusters. A voting system detects the best weights and consequently the most valid clusters among all possible results for each distinct dataset. The whole algorithm is implemented on a distributed processing platform and it is scalable to process any size of data stored in cloud infrastructures.\nPrecision of resulting clusters were evaluated using some of the well-known cluster validity indexes in the literature. Also, the efficiency of the proposed method in scalability and robustness was compared with recently published similar researches. In all the mentioned comparisons, the proposed method outperformed recent works on the same datasets.","authors":["Behrooz Hosseini","Kourosh Kiani"],"meta":["January 2018Expert Systems with Applications 91:198-210","DOI:10.1016/j.eswa.2017.08.051","Project: Big Data"],"references":["331534089_DATA_CLUSTERING_Algorithms_and_Applications","277023409_Modelling-based_experiment_retrieval_A_case_study_with_gene_expression_clustering","270001833_Imputation_of_Truncated_p-Values_For_Meta-Analysis_Methods_and_Its_Genomic_Application","267935882_CLUSTERING_MICROARRAY_DATA_USING_THE_SELF_ORGANISING_OSCILLATOR_NETWORK","314110987_Hybrid_Chemical_Reaction_based_Metaheuristic_with_Fuzzy_c-means_Algorithm_for_Optimal_Cluster_Analysis","312932287_A_novel_clustering_algorithm_based_on_data_transformation","304400251_Hessian_Regularization_Based_Symmetric_Nonnegative_Matrix_Factorization_for_Clustering_Gene_Expression_and_Microbiome_Data","283363875_Silhouettes_a_graphical_aid_to_the_interpretation_and_validation_of_cluster_analysis","278650260_Analysis_of_Multiple_DNA_Microarray_Datasets","273398830_A_Survey_of_Clustering_Algorithms_for_Big_Data_Taxonomy_and_Empirical_Analysis","262314054_A_Review_on_Missing_Value_Imputation_Algorithms_for_Microarray_Gene_Expression_Data","261557716_Information_Theory_A_Tutorial_Introduction","266227658_On_tests_and_measures_of_group_divergence_I_Theoretical_formulae","262163709_MapReduce_Algorithms_for_Big_Data_Analysis","261454906_Big_data_Issues_challenges_tools_and_Good_practices"]}