{"id":"321285322_A_Blended_Learning_Module_in_Statistics_for_Computer_Science_and_Engineering_Students_Revisited","abstract":"Teaching a statistics course for undergraduate computer science students can be very challenging: As statistics teachers we are usually faced with problems ranging from a complete disinterest in the subject to lack of basic knowledge in mathematics and anxiety for failing the exam, since statistics has the reputation of having high failure rates. In our case, we additionally struggle with difficulties in the timing of the lectures as well as often occurring absence of the students due to spare-time jobs or a long traveling time to the university. This paper reveals how these issues can be addressed by the introduction of a blended learning module in statistics. In the following, we describe an e-learning development process used to implement time- and location-independent learning in statistics. The study focuses on a six-step-approach for developing the blended learning module. In addition, the teaching framework for the blended module is presented, including suggestions for increasing the interest in learning the course. Furthermore, the first experimental in-class usage, including evaluation of the students’ expectations, has been completed and the outcome is discussed.","authors":["Christina Andersson","Doina Logofătu"],"meta":["November 2017","DOI:10.3991/ijep.v7i4.7441"],"references":["294238075_Teaching_an_Introductory_Statistics_Course_with_CyberStats_an_Electronic_Textbook","290695892_A_Study_Comparing_Traditional_and_Hybrid_Internet-Based_Instruction_in_Introductory_Statistics_Classes","288456715_Teaching_introductory_statistics_online_-_Satisfyin_students","286055089_Basic_Math_Skills_and_Performance_in_an_Introductory_Statistics_Course","313609383_The_impact_of_math_background_on_performance_in_managerial_economics_and_basic_finance_courses","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","312455832_R_A_Language_and_Environment_for_Statistical_Computing","288862740_Online_students_don't_fare_as_well_as_classroom_counterparts_study_finds","285683322_Upside_down_and_inside_out_Flip_your_classroom_to_improve_student_learning","279736305_Communicating_the_Power_and_Impact_of_Our_Profession_A_Heads_Up_for_the_Next_Executive_Directors_of_the_ASA"]}