{"id":"321210500_Groupwise_Maximin_Fair_Allocation_of_Indivisible_Goods","abstract":"We study the problem of allocating indivisible goods among n agents in a fair manner. For this problem, maximin share (MMS) is a well-studied solution concept which provides a fairness threshold. Specifically, maximin share is defined as the minimum utility that an agent can guarantee for herself when asked to partition the set of goods into n bundles such that the remaining (n-1) agents pick their bundles adversarially. An allocation is deemed to be fair if every agent gets a bundle whose valuation is at least her maximin share. Even though maximin shares provide a natural benchmark for fairness, it has its own drawbacks and, in particular, it is not sufficient to rule out unsatisfactory allocations. Motivated by these considerations, in this work we define a stronger notion of fairness, called groupwise maximin share guarantee (GMMS). In GMMS, we require that the maximin share guarantee is achieved not just with respect to the grand bundle, but also among all the subgroups of agents. Hence, this solution concept strengthens MMS and provides an ex-post fairness guarantee. We show that in specific settings, GMMS allocations always exist. We also establish the existence of approximate GMMS allocations under additive valuations, and develop a polynomial-time algorithm to find such allocations. Moreover, we establish a scale of fairness wherein we show that GMMS implies approximate envy freeness. Finally, we empirically demonstrate the existence of GMMS allocations in a large set of randomly generated instances. For the same set of instances, we additionally show that our algorithm achieves an approximation factor better than the established, worst-case bound.","authors":["Siddharth Barman","Arpita Biswas","Sanath Kumar Krishnamurthy","Yadati Narahari"],"meta":["November 2017","Project: Fair Allocation of Indivisible Goods"],"references":["318829728_Fair_Division_of_a_Graph","315764599_Fair_Allocation_of_Indivisible_Goods_Improvement_and_Generalization","273157896_Approximation_Algorithms_for_Computing_Maximin_Share_Allocations","317704918_Approximation_Algorithms_for_Maximin_Fair_Division","316012129_Handbook_of_Computational_Social_Choice","314085402_Approximation_Algorithms_for_Computing_Maximin_Share_Allocations","312160451_Algorithms_for_Max-Min_Share_Fair_Allocation_of_Indivisible_Chores","305524869_The_Unreasonable_Fairness_of_Maximum_Nash_Welfare","266212199_How_to_Cut_a_Cake_Fairly","243785231_The_Problem_of_Fair_Division","228972039_Efficient_Fair_Division_Help_the_Worst_off_or_Avoid_Envy","227633669_The_Combinatorial_Assignment_Problem_Approximate_Competitive_Equilibrium_from_Equal_Incomes","221444777_On_approximately_fair_allocations_of_indivisible_goods","4977580_Equity_Envy_and_Efficiency"]}