{"id":"321290560_A_review_of_the_use_of_virtual_reality_head-mounted_displays_in_education_and_training","abstract":"In the light of substantial improvements to the quality and availability of virtual reality (VR) hardware seen since 2013, this review seeks to update our knowledge about the use of head-mounted displays (HMDs) in education and training. Following a comprehensive search 21 documents reporting on experimental studies were identified, quality assessed, and analysed. The quality assessment shows that the study quality was below average according to the Medical Education Research Study Quality Instrument, especially for the studies that were designed as user evaluations of educational VR products. The review identified a number of situations where HMDs are useful for skills acquisition. These include cognitive skills related to remembering and understanding spatial and visual information and knowledge; psychomotor skills related to head-movement, such as visual scanning or observational skills; and affective skills related to controlling your emotional response to stressful or difficult situations. Outside of these situations the HMDs had no advantage when compared to less immersive technologies or traditional instruction and in some cases even proved counterproductive because of widespread cybersickness, technological challenges, or because the immersive experience distracted from the learning task.","authors":["Lasse X Jensen","Flemming Konradsen"],"meta":["July 2018Education and Information Technologies 23(11):1-15","DOI:10.1007/s10639-017-9676-0","Project: Virtual Reality HMDs in Education and Training"],"references":["312485345_Smartphone_Based_Virtual_Reality_Systems_in_Classroom_Teaching_-_A_Study_on_the_Effects_of_Learning_Outcome","308787299_Exploring_educational_immersive_videogames_an_empirical_study_with_a_3D_multimodal_interaction_prototype","305998482_A_Case_Study_on_Virtual_Reality_American_Football_Training","315554857_Learning_to_Juggle_in_an_Interactive_Virtual_Reality_Environment","314613385_Investigating_the_Impact_of_Interactive_Immersive_Virtual_Reality_Environments_in_Enhancing_Task_Performance_in_Online_Engineering_Design_Activities","314489277_Virtual_Reality_Applications_for_Stress_Management_Training_in_the_Military","312079133_Immersivity_and_Playability_Evaluation_of_a_Game_Experience_in_Cultural_Heritage","311489137_Supporting_Precise_Manual-handling_Task_using_Visuo-haptic_Interaction","307626043_Introducing_a_Virtual_Reality_Experience_in_Anatomic_Pathology_Education","305679957_Virtual_reality_systems_enhance_students'_achievements_in_engineering_education"]}