{"id":"321229442_Unsupervised_gene_selection_using_biological_knowledge_Application_in_sample_clustering","abstract":"Background\nClassification of biological samples of gene expression data is a basic building block in solving several problems in the field of bioinformatics like cancer and other disease diagnosis and making a proper treatment plan. One big challenge in sample classification is handling large dimensional and redundant gene expression data. To reduce the complexity of handling this high dimensional data, gene/feature selection plays a major role.\n\nResults\nThe current paper explores the use of biological knowledge acquired from Gene Ontology database in selecting the proper subset of genes which can further participate in clustering of samples. The proposed feature selection technique is unsupervised in nature as it does not utilize any class label information in the process of gene selection. At the end, a multi-objective clustering approach is deployed to cluster the available set of samples in the reduced gene space.\n\nConclusions\nReported results show that consideration of biological knowledge in gene selection technique not only reduces the feature space dimensionality in great extent but also improves the accuracy of sample classification. The obtained reduced gene space is validated using strong biological significance tests. In order to prove the supremacy of our proposed gene selection based sample clustering technique, a thorough comparative analysis has also been performed with state-of-the-art techniques.","authors":["Sudipta Acharya","Sriparna Saha","Nikhil Nandyala"],"meta":["November 2017BMC Bioinformatics 18(1)","DOI:10.1186/s12859-017-1933-0"],"references":["324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","310588923_Performance_analysis_of_genetic_algorithm_with_KNN_and_SVM_for_Feature_Selection_in_Tumor_Classification","308519360_Quantum-behaved_Discrete_Multi-objective_Particle_Swarm_Optimization_for_Complex_Network_Clustering","280879361_Use_of_Semi-supervised_Clustering_and_Feature_Selection_Techniques_for_Gene-Expression_Data","279356416_Similarity_Measures","276852712_Multi-objective_semi-supervised_clustering_for_automatic_pixel_classification_from_remote_sensing_imagery","272176868_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","270790861_Feature_Selection_and_Clustering_of_Gene_Expression_Profiles_Using_Biological_Knowledge","267665612_Unsupervised_classification_Similarity_measures_classical_and_metaheuristic_approaches_and_applications","261467588_Gene_selection_using_biological_knowledge_and_fuzzy_clustering"]}