{"id":"321283063_A_review_of_semantic_segmentation_using_deep_neural_networks","abstract":"During the long history of computer vision, one of the grand challenges has been semantic segmentation which is the ability to segment an unknown image into different parts and objects (e.g., beach, ocean, sun, dog, swimmer). Furthermore, segmentation is even deeper than object recognition because recognition is not necessary for segmentation. Specifically, humans can perform image segmentation without even knowing what the objects are (for example, in satellite imagery or medical X-ray scans, there may be several objects which are unknown, but they can still be segmented within the image typically for further investigation). Performing segmentation without knowing the exact identity of all objects in the scene is an important part of our visual understanding process which can give us a powerful model to understand the world and also be used to improve or augment existing computer vision techniques. Herein this work, we review the field of semantic segmentation as pertaining to deep convolutional neural networks. We provide comprehensive coverage of the top approaches and summarize the strengths, weaknesses and major challenges.","authors":["Yanming Guo","Yu Liu","Theodoros Georgiou","Michael S. Lew"],"meta":["June 2018International Journal of Multimedia Information Retrieval 7(2)","DOI:10.1007/s13735-017-0141-z","Project: Deep Learning for Visual Understanding"],"references":["322060396_Mask_R-CNN","320971364_Webly_Supervised_Semantic_Segmentation","320968206_Pyramid_Scene_Parsing_Network","320964499_Simple_Does_It_Weakly_Supervised_Instance_and_Semantic_Segmentation","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770331_ParseNet_Looking_Wider_to_See_Better","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks"]}