{"id":"321258536_INTERSECCOES_ENTRE_DESIGN_THINKINGS_E_FORMACAO_DE_PROFESSORES","abstract":"A inovação é elemento integrado à sociedade contemporânea com novas metodologias no\nfazer pedagógico. A formação do docente amplia-se para uma visão integral do homem que\npromovendo novas metodologias para o ensino com intersecções de ferramentas diversas.\nEssas inovações metodoogicas fazem parte de um novo cenário educacional, onde o estudante\né mais participativo e autonomo no seu pensar. Isso faz com que o professor procure por um\nnovo fazer pedagógico inserindo nesse planejamento e problámticas que permitam com que o\nestudante motivesse a aprender. Esse faz com que a sala de aula torne-se um espaço de\ninteração e de problematizações que tenha como pano de fundo as ferramentas do desinger\nthinking. Esse é utilizado para elaboração das aulas e também para oportunizar novas\nmaneiras de ensinar ao estudantes dessa sociedade do conhecimento. Sendo assim, o objetivo\nnesse artigo é mapear as intersecções entre design thinking e a formação de professores. Para\ntanto se realizou uma busca sistemática seguida de uma análise bibliométrica na base de\ndados Scopus. Como resultado, identificou-se que a pesquisa emerge no campo das Ciências\nSocias intersectando as discussões na área de Engenharia; Ciência da Computação; Ciência\nambiental; Artes e Humanidades; Negócios, Gestão e Contabilidade; Ciências da decisão e\nMedicina e congrega um novo olhar ao fazer pegagócio trazendo então uma discussão que\ntranscenda a modelos cartezianos de ensinar onde aprendizagem se concebia em um processo\npassivo.","authors":["Andreia de Bem Machado","Andreza Regina Lopes da Silva"],"meta":["November 2017","DOI:10.5965/2316419006092017077","Project: Educação"],"references":["277806780_A_quarta_revolucao_educacional_a_mudanca_de_tempos_espacos_e_relacoes_na_escola_a_partir_do_uso_de_tecnologias_e_da_inclusao_social_The_fourth_educational_revolution_changes_of_time_space_and_relation","277053669_BIBLIOMETRIA_CIENTOMETRIA_INFOMETRIA_conceitos_e_aplicacoes","26360304_Trabalhando_com_estrategias_de_ensino-aprendizado_por_descoberta_na_area_da_saude_a_problematizacao_e_a_aprendizagem_baseada_em_problemas","220468656_International_Encyclopedia_of_Information_and_Library_Science"]}