{"id":"321254512_Are_Boys_and_Girls_still_Digitally_Differentiated_The_Case_of_Catalonian_Teenagers","abstract":"Aim/Purpose: This article presents a study of ICT use and attitudes related to the computer use of girls and boys from Catalonia in order to detect which gender differences may explain the low presence of women in the ICT field and to design a proposal of actions in schools to help reduce these differences.\n\nBackground: Since the number of women in the field of ICT remains very low, this study looks into the factors that influence girls’ lack of interest in ICT field.\n\nMethodology: The study collected data from 29 randomly selected public secondary schools in Catalonia with a total of 1,920 students (972 boys and 815 girls aged between 11 and 13 years old); it analyzes socio-demographic data, frequency and type of computers use and attitudes and self-efficacy on ICT use.\n\nContribution: The study concludes there is a prevalence of stereotypes about the differences of skills and professional vocation among the teenagers and a gender difference when we focus on attitudes toward computers or self-efficacy.\n\nFindings: Boys and girls face computer use in different ways and both have a stereotyped image of their mothers’ and fathers’ digital skills and ICT jobs. Girls present higher levels of anxiety than boys when using a computer and lower self-confidence. Boys have higher self-efficacy than girls when asked for their perception about doing tasks with computers.\n\nImpact on Society: Policy makers must design strategies to minimize these gender differences in order to engage more girls in technological studies and minimize this imbalance.\n\nFuture Research: Future research is needed, in the Catalan context, about whether the intensive use of computers in schools can influence the reduction of the gender-gap and identify which interventions must be made to maximize its effect.","authors":["Roser Cussó","Xavier Carrera Farran"],"meta":["October 2017Journal of Information Technology Research 16(1):411-435","DOI:10.28945/3879","Project: Gender differences in computer use among teenagers: attitudes and self-efficacy"],"references":["305464520_Adolescents'_Gendered_Portrayals_of_Information_and_Communication_Technologies_Occupations","274668797_The_Measurement_of_Computer_Attitudes_An_Empirical_Comparison_of_Available_Scales","274350538_An_Examination_of_The_Factor_Structures_of_The_Computer_Attitude_Scale","320655349_Influencing_the_Influencers_The_Role_of_Mothers_in_IT_Career_Choices","312685275_Students'_Use_of_and_Engagement_with_ICT_at_Home_and_School","288972309_Understanding_women's_presence_in_ICT","281359400_Computing_Whether_She_Belongs_Stereotypes_Undermine_Girls'_Interest_and_Sense_of_Belonging_in_Computer_Science","272179942_Between_a_rock_and_a_hard_place_women_and_computer_technology","265854784_Adolescents'_computer_performance_The_role_of_self-concept_and_motivational_aspects","262871104_Now_I_know_what_ICT_can_do_for_me"]}