{"id":"321297094_Information_as_a_double-edged_sword_The_role_of_computer_experience_and_information_on_applicant_reactions_towards_novel_technologies_for_personnel_selection","abstract":"Technologically advanced selection procedures are entering the market at exponential rates. The current study tested two previously held assumptions: (a) providing applicants with procedural information (i.e., making the procedure more transparent and justifying the use of this procedure) on novel technologies for personnel selection would positively impact applicant reactions, and (b) technologically advanced procedures might differentially affect applicants with different levels of computer experience. In a 2 (computer science students, other students) × 2 (low information, high information) design, 120 participants watched a video showing a technologically advanced selection procedure (i.e., an interview with a virtual character responding and adapting to applicants’ nonverbal behavior). Results showed that computer experience did not affect applicant reactions. Information had a positive indirect effect on overall organizational attractiveness via open treatment and information known. This positive indirect effect was counterbalanced by a direct negative effect of information on overall organizational attractiveness. This study suggests that computer experience does not affect applicant reactions to novel technologies for personnel selection, and that organizations should be cautious about providing applicants with information when using technologically advanced procedures as information can be a double-edged sword.\n\nUpdate: While not specifically mentioned in the paper it has implications for explainability and XAI research: providing people with more transparency can have simultaneous positive and negative effects on acceptance.","authors":["Markus Langer","Cornelius J. König","Andromachi Fitili"],"meta":["January 2018Computers in Human Behavior 81:19-30","DOI:10.1016/j.chb.2017.11.036","Projects: Artificial Intelligence and Automation in Human Resource ManagementExplainable Artificial Intelligence and PsychologyNovel technologies for HR: Applicants' and hiring managers' reactions and behavior"],"references":["313219279_The_importance_of_recruitment_in_job_choice_A_different_way_of_looking","312661133_Technology_in_the_Employment_Interview_A_Meta-Analysis_and_Future_Research_Agenda","308050661_Dear_Computer_Teach_Me_Manners_Testing_Virtual_Employment_Interview_Training","303949636_Asynchronous_Video_Interviewing_as_a_New_Technology_in_Personnel_Selection_The_Applicant's_Point_of_View","302977849_New_Talent_Signals_Shiny_New_Objects_or_a_Brave_New_World","317155671_Using_pre-test_explanations_to_improve_test-taker_reactions_Testing_a_set_of_wise_interventions","299506298_On_the_Nature_of_Creepiness","294687158_Applicant_reactions_to_selection_Development_of_the_selection_procedural_scale_SPJS","292368103_Applicants'_reactions_to_the_fairness_of_selection_procedures_The_effects_of_positive_rule_violations_and_time_of_measurement","289066201_Introduction_to_Mediation_Moderation_and_Conditional_Process_Analysis_A_Regression-Based_Approach","281286234_Estimating_the_reproducibility_of_psychological_science","275223620_Social_Sensing_for_Psychology_Automated_Interpersonal_Behavior_Assessment","265685428_Challenges_and_opportunities_affecting_the_future_of_Human_Resource_Management","265685423_The_influence_of_technology_on_the_future_of_Human_Resource_Management","263555250_A_comparative_assessment_of_videoconference_and_face-to-face_employment_interviews"]}