{"id":"321210959_Adversarial_Network_Embedding","abstract":"Learning low-dimensional representations of networks has proved effective in a variety of tasks such as node classification, link prediction and network visualization. Existing methods can effectively encode different structural properties into the representations, such as neighborhood connectivity patterns, global structural role similarities and other high-order proximities. However, except for objectives to capture network structural properties, most of them suffer from lack of additional constraints for enhancing the robustness of representations. In this paper, we aim to exploit the strengths of generative adversarial networks in capturing latent features, and investigate its contribution in learning stable and robust graph representations. Specifically, we propose an Adversarial Network Embedding (ANE) framework, which leverages the adversarial learning principle to regularize the representation learning. It consists of two components, i.e., a structure preserving component and an adversarial learning component. The former component aims to capture network structural properties, while the latter contributes to learning robust representations by matching the posterior distribution of the latent representations to given priors. As shown by the empirical results, our method is competitive with or superior to state-of-the-art approaches on benchmark network embedding tasks.","authors":["Quanyu DAI","Qiang Li","Jian Tang","Dan Wang"],"meta":["November 2017"],"references":["317399572_Inductive_Representation_Learning_on_Large_Graphs","313628491_Community_Preserving_Network_Embedding","310825144_Asymmetric_Transitivity_Preserving_Graph_Embedding","303755744_Adversarially_Learned_Inference","319770355_Generative_Adversarial_Nets","319770154_Adversarial_Autoencoders","310824980_Structural_Deep_Network_Embedding","308027538_Energy-based_Generative_Adversarial_Network","307991731_Semi-Supervised_Classification_with_Graph_Convolutional_Networks","305997704_node2vec_Scalable_Feature_Learning_for_Networks"]}