{"id":"321246320_INFORMATICA_EN_LA_ENSENANZA_DE_LA_MATEMATICARETOS_Y_DESAFIOS_EN_EL_CONTEXTO_UNIVERSITARIO_ECUATORIANO","abstract":"RESUMEN En la República del Ecuador como parte del proceso de perfeccionamiento de la Educación Superior, se ha ve-nido trabajando en la concepción que permita integrar el uso de la informática en la clase de Matemática, pero los resultados distan del resultado esperado. En un len-guaje más concreto, o más esquemático, podría decirse que no se ha previsto el efecto de la computación sobre la enseñanza de la matemática, ni se ha derivado una concepción que incorpore este importante instrumento a la matemática universitaria, constituyendo el proble-ma de investigación del que se derivó el presente tema. Mediante la combinación de métodos de investigación del nivel teórico y del nivel empírico se logró arribar a re-sultados que sintetizan la influencia que tiene la computa-ción en la enseñanza de la Matemática. Palabras clave: Pensamiento lógico, matemática, informática, proceso enseñanza-aprendizaje. ABSTRACT In the Republic of Ecuador as part of the improvement process of Higher Education, the conception which allows integrating the use of computer science in the Mathematics class has been analyzed, but the results are far from the expected result. In a more concrete, or more schematic language, it could be said that the effect of computing on mathematics teaching has not been foreseen, nor has a conception which incorporates this important instrument to university mathematics been derived. It constitutes the research problem from which the present topic was derived. By combining research methods from the theoretical level and the empirical level, it was possible to arrive at results which synthesize the influence that computing has on the teaching of mathematics.","authors":["Richard Javier Torres Vargas"],"meta":["June 2017","Project: INFORMÁTICA EN LA ENSEÑANZA DE LA MATEMÁTICA: RETOS Y DESAFÍOS EN EL CONTEXTO UNIVERSITARIO ECUATORIANO"],"references":["287725581_Automatic_tutoring_by_intrinsic_programming","232561923_The_behavior_of_organisms_An_experimental_analysis","220106985_The_Design_of_an_Instructional_System_Based_on_Problem_Generators","23356971_The_projective_expression_of_needs_II_The_effect_of_different_intensities_of_the_hunger_drive_on_Thematic_Apperception"]}