{"id":"321346253_Students'_Attitudes_Towards_Edmodo_a_Social_Learning_Network_A_Scale_Development_Study","abstract":"Social Learning Networks (SLNs) are the developed forms of Social Network Sites (SNSs) adapted to educational environments, and they are used by quite a large population throughout the world. In addition, in related literature, there is no scale for the measurement of students' attitudes towards such sites. The purpose of this study was to develop a scale to determine students' attitudes towards Edmodo, a Social Learning Network (Edmodo Attitude Scale, EAS). The scale development process included reviewing the related literature, developing an item pool, asking for expert's views, developing a draft form, carrying out two different applications for exploratory and confirmatory factor analyses and conducting validity and reliability analyses. The scale was developed in Turkish and applied online. The participants of the study were selected among undergraduate students who experienced Edmodo in a university in Turkey. At the end of the research process, a scale made up of 18 items and 4 factors was developed. The factors were found to be collaboration, usefulness, instructor support and self-confidence. Consequently, the scale could be said to be a valid and reliable attitude scale that could be used in learning environments which involves the use of a SLN.","authors":["Eyup Yünkül","Serkan Çankaya"],"meta":["April 2017Turkish Online Journal of Distance Education 18(2):16-29","DOI:10.17718/tojde.306554"],"references":["308631869_The_impact_of_social_media_use_on_academic_performance_among_university_students_A_pilot_study","304462188_Egitim_icin_Yeni_Bir_Ortam_Twitter","286113881_Beyond_the_Classroom_Walls_Edmodo_in_Saudi_Secondary_School_EFL_Instruction_Attitudes_and_Challenges","284722708_The_Role_of_Social_Learning_Networks_in_Mobile_Assisted_Language_Learning_Edmodo_as_a_Case_Study","283306982_THE_DEVELOPMENT_OF_TEACHERS_ATTITUDE_SCALE_TOWARDS_EDUCATIONAL_RESEARCH_THE_VALIDITY_AND_RELIABILITY_STUDY","277234062_Dijital_Yerliler_Sosyal_Aglar_ve_Kutuphanelerin_Gelecegi","267935416_The_Use_of_Alternative_Social_Networking_Sites_in_Higher_Educational_Settings_A_Case_Study_of_the_E-Learning_Benefits_of_Ning_in_Education","305474168_Sosyal_Aglarin_Egitim_Baglaminda_Kullanimi_-_Using_Social_Networks_in_Educational_Context","303919046_Principles_and_Practice_of_Structural_Equation_Modeling","273587794_Using_Facebook_to_Connect_Alumni_Current_Students_and_Faculty_A_How-to_Guide"]}