{"id":"321388919_Virtualisation_devices_for_student_learning_Comparison_between_desktop-based_Oculus_Rift_and_mobile-based_Gear_VR_virtual_reality_in_medical_and_health_science_education","abstract":"Consumer-grade virtual reality has recently become available for both desktop and mobile platforms and may redefine the way that students learn. However, the decision regarding which device to utilise within a curriculum is unclear. Desktop-based VR has considerably higher setup costs involved, whereas mobile-based VR cannot produce the quality of environment due to its limited processing power. This study aimed to compare performance in an anatomical knowledge test between two virtual reality headsets, the Oculus Rift and Gear VR, as well as to investigate student perceptions and adverse health effects experienced from their use. An identical lesson on spine anatomy was presented to subjects using either the Oculus Rift or Gear VR, with no significant differences observed in test scores from participants using either device, with both groups answering 60% of the questions correctly. However, 40% of participants experienced significantly higher rates of nausea and blurred vision when using the Gear VR (P < 0.05). It was established that the more cost effective mobile-based VR was just as suitable for teaching isolated-systems than the more expensive desktop-based VR. These outcomes show great promise for the effective use of mobile-based virtual reality devices in medical and health science education.","authors":["Christian Moro","Zane Štromberga","Allan Stirling"],"meta":["November 2017Australasian Journal of Educational Technology 33(6)","DOI:10.14742/ajet.3840","Project: Virtual, Augmented and Mixed Reality in Education"],"references":["316178177_The_effectiveness_of_virtual_and_augmented_reality_in_health_sciences_and_medical_anatomy","313661017_Supporting_Students'_Transition_to_University_and_Problem-Based_Learning","309706897_Cyber_sick_but_still_having_fun","308363578_Evaluating_Experiences_in_Different_Virtual_Reality_Setups","303530211_3D_Anatomy_Models_and_Impact_on_Learning_A_Review_of_the_Quality_of_the_Literature","328410344_Towards_simulation_of_the_classroom_learning_experience_Virtual_reality_approach","320947001_An_Interactive_3D_Virtual_Anatomy_Puzzle_for_Learning_and_Simulation_-_Initial_Demonstration_and_Evaluation","305027208_A_fully_immersive_virtual_model_to_explore_archaeological_sites","304259933_The_design_development_and_evaluation_of_a_virtual_reality_based_learning_environment","302910382_From_chalkboard_slides_and_paper_to_e-learning_How_computing_technologies_have_transformed_anatomical_sciences_education"]}