{"id":"321381685_Work_station_learning_activities_A_flexible_and_scalable_instrument_for_integrating_across_basic_subjects_in_biomedical_education","abstract":"Background\nEstablishing innovative teaching programs in biomedical education involves dealing with several national and supra-national (i.e. European) regulations as well as with new pedagogical and demographic demands. We aimed to develop and validate a suitable instrument to integrate activities across preclinical years in all Health Science Degrees while meeting requirements of national quality agencies.\n\nMethods\nThe new approach was conceived at two different levels: first, we identified potentially integrative units from different fields according to national learning goals established for each preclinical year (national quality agency regulations). Secondly, we implemented a new instrument that combines active methodologies in Work Station Learning Activities (WSLA), using clinical scenarios as a guiding common thread to instruct students from an integrated perspective. We evaluated students’ perception through a Likert-type survey of a total of 118 students enrolled in the first year of the Bachelor’s Degree in Medicine.\n\nResults\nOur model of integrated activities through WSLA is feasible, scalable and manageable with large groups of students and a minimum number of instructors, two major limitations in many medical schools. Students’ perception of WSLA was positive in overall terms. Seventy nine percent of participants stated that WSLA sessions were more useful than non-integrated activities. Eighty three percent confirmed that the WSLA methodology was effective at integrating concepts covered by different subjects.\n\nConclusions\nThe WSLA approach is a flexible and scalable instrument for moving towards integrated curricula, and it can be successfully adapted to teach basic subjects in preclinical years of Health Science degrees. WSLA can be applied to large groups of students in a variety of contexts or environments using clinical cases as connecting threads.","authors":["Rocio Gonzalez-Soltero","Ana ISABEL Rodriguez Learte","Ana Mª. Sánchez","Beatriz Gal"],"meta":["November 2017BMC Medical Education 17(1)","DOI:10.1186/s12909-017-1084-z"],"references":["323688854_El_aprendizaje_a_traves_del_juego_como_herramienta_en_el_diseno_de_actividades_de_valor_anadido_en_un_curriculo_integrador_de_Ciencias_Biomedicas_Basicas","313478674_El_aprendizaje_a_traves_del_juego_como_herramienta_en_el_diseno_de_actividades_de_valor_anadido_en_un_curriculo_integrador_de_Ciencias_Biomedicas_Basicas_Gamification_as_a_tool_for_the_design_of_added","309768490_Team-based_learning_in_large_enrollment_classes","307824850_Curriculum_Integration_in_Medical_Education_A_Theoretical_Review","301664548_Web_al_Servicio_de_la_Anatomia_Relato_de_una_Experiencia_Docente","292984144_Implementation_of_team-based_learning_in_year_1_of_a_PBL_medical_program_a_pilot_study","284228543_A_Disease-Based_Approach_to_the_Vertical_and_Horizontal_Integration_of_a_Medical_Curriculum","310622785_Integrating_multiple_data_sources_in_a_cardiology_imaging_laboratory","292499662_Medical_Education_in_the_United_States_and_Canada_a_report_to_the_Carnegie_Foundation_for_the_Advancement_of_Teaching_Cited_by_Ludmerer_K_Understanding_the_Flexner_Report","284279846_Analysis_of_the_Team-Based_Learning_Literature_TBL_Comes_of_Age"]}