{"id":"321375076_Deep_Image_Prior","abstract":"Deep convolutional networks have become a popular tool for image generation and restoration. Generally, their excellent performance is imputed to their ability to learn realistic image priors from a large number of example images. In this paper, we show that, on the contrary, the structure of a generator network is sufficient to capture a great deal of low-level image statistics prior to any learning. In order to do so, we show that a randomly-initialized neural network can be used as a handcrafted prior with excellent results in standard inverse problems such as denoising, super-resolution, and inpainting. Furthermore, the same prior can be used to invert deep neural representations to diagnose them, and to restore images based on flash-no flash input pairs. Apart from its diverse applications, our approach highlights the inductive bias captured by standard generator network architectures. It also bridges the gap between two very popular families of image restoration methods: learning-based methods using deep convolutional networks and learning-free methods based on handcrafted image priors such as self-similarity. Code and supplementary material are available at https://dmitryulyanov.github.io/deep_image_prior.","authors":["Dmitry Ulyanov","Andrea Vedaldi","Victor Lempitsky"],"meta":["July 2020International Journal of Computer Vision 128(8)","DOI:10.1007/s11263-020-01303-4"],"references":["322076334_The_Robust_Manifold_Defense_Adversarial_Training_using_Generative_Models","322060149_Convolutional_Dictionary_Learning_via_Local_Processing","321902002_Zero-Shot_Super-Resolution_using_Deep_Internal_Learning","329748512_Zero-Shot_Super-Resolution_Using_Deep_Internal_Learning","322060274_Non-uniform_Blind_Deblurring_by_Reblurring","322060260_EnhanceNet_Single_Image_Super-Resolution_Through_Automated_Texture_Synthesis","320971178_Non-local_Color_Image_Denoising_with_Convolutional_Neural_Networks","320968363_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","320968314_Benchmarking_Denoising_Algorithms_with_Real_Photographs","319770355_Generative_Adversarial_Nets"]}