{"id":"321352236_Action_Recognition_in_Video_Sequences_using_Deep_Bi-directional_LSTM_with_CNN_Features","abstract":"Recurrent neural network (RNN) and long short-term memory (LSTM) have achieved great success in processing sequential multimedia data and yielded state-of-the-art results in speech recognition, digital signal processing, video processing, and text data analysis. In this paper, we propose a novel action recognition method by processing the video data using convolutional neural network (CNN) and deep bidirectional LSTM (DB-LSTM) network. Firstly, deep features are extracted from every sixth frame of the videos which helps reduce the redundancy and complexity. Next, the sequential information among frame features is learnt using DB-LSTM network, where multiple layers are stacked together in both forward pass and backward pass of DB-LSTM to increase its depth. The proposed method is capable of learning long term sequences and can process lengthy videos by analyzing features for a certain time interval. Experimental results show significant improvements in action recognition using the proposed method on three benchmark datasets including UCF-101, YouTube 11 Actions, and HMDB51 compared to state-of-the-art action recognition methods.","authors":["Amin Ullah","Jamil Ahmad","Khan Muhammad","Muhammad Sajjad"],"meta":["November 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2778011","Projects: Computer Vision and Image Analysis, Understanding and ProcessingHuman Actions and Activities RecognitionIntelligent Video Surveillance"],"references":["319306777_Action_Recognition_with_Dynamic_Image_Networks","318168391_Improved_pedestrian_detection_using_motion_segmentation_and_silhouette_orientation","317829355_Illumination_and_scale_invariant_relevant_visual_features_with_hypergraph-based_learning_for_multi-shot_person_re-identification","315881463_Segmenting_foreground_objects_in_a_multi-modal_background_using_modified_Z-score","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","315637414_A_Neuromorphic_Person_Re-Identification_Framework_for_Video_Surveillance","314866990_Error_detection_and_accuracy_estimation_in_automatic_speech_recognition_using_deep_bidirectional_recurrent_neural_networks","309738650_Action2Activity_Recognizing_Complex_Activities_from_Sensor_Data","309083223_An_Evaluation_of_Background_Subtraction_for_Object_Detection_Vis-a-Vis_Mitigating_Challenging_Scenarios","308859819_Beyond_short_snippets_Deep_networks_for_video_classification"]}