{"id":"321321862_In-Network_Computation_is_a_Dumb_Idea_Whose_Time_Has_Come","abstract":"Programmable data plane hardware creates new opportunities for infusing intelligence into the network. This raises a fundamental question: what kinds of computation should be delegated to the network?\nIn this paper, we discuss the opportunities and challenges for co-designing data center distributed systems with their network layer. We believe that the time has finally come for offloading part of their computation to execute in-network. However, in-network computation tasks must be judiciously crafted to match the limitations of the network machine architecture of programmable devices. With the help of our experiments on machine learning and graph analytics workloads, we identify that aggregation functions raise opportunities to exploit the limited computation power of networking hardware to lessen network congestion and improve the overall application performance. Moreover, as a proof-of-concept, we propose Daiet, a system that performs in-network data aggregation. Experimental results with an initial prototype show a large data reduction ratio (86.9%-89.3%) and a similar decrease in the workers' computation time.","authors":["Amedeo Sapio","Ibrahim Abdelaziz","Abdulla Aldilaijan","Marco Canini"],"meta":["November 2017","DOI:10.1145/3152434.3152461","Conference: the 16th ACM Workshop"],"references":["315915931_Enabling_Fast_Hierarchical_Heavy_Hitter_Detection_using_Programmable_Data_Planes","315914075_Heavy-Hitter_Detection_Entirely_in_the_Data_Plane","318915496_Language-Directed_Hardware_Design_for_Network_Performance_Monitoring","316903059_IncBricks_Toward_In-Network_Computation_with_an_In-Network_Cache","316857111_Forwarding_metamorphosis_fast_programmable_match-action_processing_in_hardware_for_SDN","315914878_Dapper_Data_Plane_Performance_Diagnosis_of_TCP","315867257_IncBricks_Toward_In-Network_Computation_with_an_In-Network_Cache","312964483_Scalable_Hierarchical_Aggregation_Protocol_SHArP_A_Hardware_Architecture_for_Efficient_Data_Reduction","312775005_MapReduce_Simplified_data_processing_on_large_clusters","305782411_Packet_Transactions_High-Level_Programming_for_Line-Rate_Switches"]}