{"id":"321325830_Ad-hoc_Runtime_Object_Structure_Visualizations_with_MetaLinks","abstract":"This paper describes an original method and a tool for an a posteriori analysis of a running object software system, specifically system's runtime structural properties. Highly context-dependent systems pose a challenge of understanding their runtime behaviour. The typical approach is to let the system run and manually observe its runtime properties, which is cognitively demanding and error-prone. Smalltalk, and Pharo in particular, focuses on providing live introspection and immediate feedback during the development. In our method, we take the advantage of these possibilities and combine them with the (relatively new) concept of metalinks as a way to hook into existing code without modifying it, and to set specific attributes to be observed. The result is an analysis tool focused on visualization of ad-hoc runtime structures -- that is, providing an analyst with a live view of the stepwise construction and runtime changes of a system based on a UML instance visualization. We demonstrate the tool on analyzing the construction loop of Pharo's Spec UI framework.","authors":["Peter Uhnák","Robert Pergl"],"meta":["September 2017","DOI:10.1145/3139903.3139912","Conference: the 12th edition of the International Workshop"],"references":["220818134_How_can_diagramming_tools_help_support_programming_activities","48907864_Sub-method_Structural_and_Behavioral_Reflection","309443539_The_OpenPonk_modeling_platform","309443412_A_low_Overhead_Per_Object_Write_Barrier_for_the_Cog_VM","259510634_Seamless_Composition_and_Reuse_of_Customizable_User_Interfaces_with_Spec","234793613_Clean_Code_A_Handbook_of_Agile_Software_Craftsmanship","225136999_Visualizing_Memory_Graphs","220688352_Software_Visualization_Visualizing_the_Structure_Behaviour_and_Evolution_of_Software","15176212_The_Magical_Number_Seven_Plus_or_Minus_Two_Some_Limits_on_Out_Capacity_for_Processing_Information","10255186_The_Magical_Number_Seven_Plus_Or_Minus_2_Some_Limits_On_Our_Capacity_for_Processing_Information"]}