{"id":"321369556_Diversite_des_services_rendus_par_les_territoires_a_forte_densite_d'elevages_trois_cas_d'etude_en_Europe","abstract":"Dans cet article, nous analysons trois territoires à haute densité animale, différentiés par le contexte de production (densité et diversité des élevages), la sensibilité des milieux et les choix stratégiques et technologiques mis en œuvre pour la gestion des effluents : i) la Bretagne, un territoire de polyculture-polyélevage avec une forte densité d'élevages et des zones particulièrement sensibles sur le plan environnemental, ii) l'Allemagne, avec la particularité d'un très fort développement de la méthanisation à des fins de production d'énergie renouvelable et iii) la Catalogne, un territoire marqué par un développement récent et très rapide de la production porcine dans un milieu où les surfaces agricoles disponibles pour l'épandage sont limitées. Ces systèmes se caractérisent par une production élevée par unité de surface et par unité de travail, à des coûts relativement bas, avec un recours important à des intrants, principalement pour l’alimentation des animaux. Malgré des progrès significatifs, les impacts environnementaux locaux, eutrophisation et acidification, constituent une limite importante dans ces systèmes. À l'inverse, les impacts globaux, comme l'émission de gaz à effet de serre sont faibles par unité de produit, compte tenu du type d'élevage et de l'intensité de production. Ils sont encore réduits avec la méthanisation. Ces systèmes font face à une remise en cause du modèle socio-économique dans lequel ils s’inscrivent avec des questions autour de la faible rémunération des éleveurs et du bien-être animal. Différents leviers d'action spécifiques à ces territoires à haute densité animale ont été identifiés pour mieux gérer les compromis entre les différents services.","authors":["Jean-Yves Dourmad","Luc Delaby","J.-L. Boixadera","Carlos Ortis"],"meta":["November 2017Productions Animales -Paris- Institut National de la Recherche Agronomique- 30(4):303-320","DOI:10.20870/productions-animales.2017.30.4.2261","Project: Role, impacts and services provided by European livestock production"],"references":["332131002_La_competitivite_de_la_filiere_volaille_de_chair_francaise_entre_doutes_et_espoirs","320806012_La_grange_un_cadre_conceptuel_pour_apprehender_les_bouquets_de_services_rendus_par_l'elevage_dans_les_territoires","311528565_ECOALIM_A_Dataset_of_Environmental_Impacts_of_Feed_Ingredients_Used_in_French_Animal_Production","286542447_Reducing_the_land_use_of_EU_pork_production_Where_there's_swill_there's_a_way","337385403_Production_de_biogaz_par_les_exploitations_agricoles_en_Allemagne","328157720_Co-localisation_des_differentes_productions_animales_en_Europe_l'exception_francaise","326988496_An_analytical_framework_for_structuring_analysis_and_design_of_sustainable_ruminant_livestock_systems","313612353_La_politique_de_l'eau_approche_economique_et_application_a_la_pollution_des_elevages","285714718_La_methanisation_des_effluents_d'elevage_en_France_et_en_Europe_ppppprincipe_etat_des_lieux_et_perspectives","282871471_Best_available_technology_for_European_livestock_farms_Availability_effectiveness_and_uptake"]}