{"id":"321329824_SimpleITK_Image-Analysis_Notebooks_a_Collaborative_Environment_for_Education_and_Reproducible_Research","abstract":"Modern scientific endeavors increasingly require team collaborations to construct and interpret complex computational workflows. This work describes an image-analysis environment that supports the use of computational tools that facilitate reproducible research and support scientists with varying levels of software development skills. The Jupyter notebook web application is the basis of an environment that enables flexible, well-documented, and reproducible workflows via literate programming. Image-analysis software development is made accessible to scientists with varying levels of programming experience via the use of the SimpleITK toolkit, a simplified interface to the Insight Segmentation and Registration Toolkit. Additional features of the development environment include user friendly data sharing using online data repositories and a testing framework that facilitates code maintenance. SimpleITK provides a large number of examples illustrating educational and research-oriented image analysis workflows for free download from GitHub under an Apache 2.0 license: github.com/InsightSoftwareConsortium/SimpleITK-Notebooks.","authors":["Ziv Yaniv","Bradley C Lowekamp","Hans Joseph Johnson","Richard Beare"],"meta":["November 2017Journal of Digital Imaging 31(3)","DOI:10.1007/s10278-017-0037-8","Project: Insight Toolkit (ITK)"],"references":["303042835_The_POPI_model_a_point-validated_pixel-based_breathing_thorax_model","267025728_The_POPI-Model_a_point_validated_pixel-based_breathing_thorax_model","262229349_The_Insight_ToolKit_Image_Registration_Framework","259701414_The_design_of_simpleITK","316235514_Jupyter_Notebooks_-_a_publishing_format_for_reproducible_computational_workflows","315497598_Pro_Git","296480150_Leaders_of_Tomorrow_on_the_Future_of_Software_Engineering_A_Roundtable","287334922_SCIRun","281345608_Ggplot2_Elegant_Graphics_for_Data_Analysis","267933178_Interactive_notebooks_Sharing_the_code"]}