{"id":"321320514_QnQ_A_Reputation_Model_to_Secure_Mobile_Crowdsourcing_Applications_from_Incentive_Losses","abstract":"A major limitation of mobile Crowd Sourcing (CS) applications is the generation of false (or spam) contributions due to selfish and malicious behaviors of users, or wrong perception of an event. Such false contributions induce loss of revenue through disbursement of undue incentives and also negatively affects the application's operational reliability. In this work, we propose a reputation model, called QnQ, to segregate different user classes such as honest, selfish, or malicious based on their reputation scores. The resultant score is then used as an indicator to decide an incentive for a user. Unlike existing works, QnQ ensures fairness to different user behaviors by unifying 'quantity' (degree of participation) and 'quality' (accuracy of contribution). Specifically, QnQ utilizes evidences from a rating feedback mechanism to propose an event-specific expected truthfulness metric by considering total feedback volume, probability mass for positive evidence, and the discounted probability mass of uncertain evidence. To classify an event as true or not, a generalized linear model is used to transform its truthfulness into quality of information (QoI). Finally, the QoIs of various events in which a user participates, are aggregated to compute a user's reputation score. For evaluation of QnQ through experimental study, we consider a vehicular crowdsourcing application. QoI performance of our model is compared with Jøsang's belief model, while reputation and incentive leakage is compared with Dempster-Shafer based reputation model. Experimental results demonstrate that QnQ is able to better capture subtle differences in user behaviors by unifying both quality and quantity, and significantly reduces undue incentives in presence of rogue contributions.","authors":["Shameek Bhattacharjee","Nirnay Ghosh","Vijay K. Shah","Sajal K. Das"],"meta":["November 2017","DOI:10.1109/CNS.2017.8228635","Conference: Communications and Network Security (CNS), 2017 IEEE Conference onAt: Los Angeles, USA","Project: Trust Reputation and Dependable Decision Models in CrowdSensing"],"references":["305674072_Enhancing_Reliability_of_Vehicular_Participatory_Sensing_Network_A_Bayesian_Approach","301723978_Topic-Aware_Social_Sensing_with_Arbitrary_Source_Dependency_Graphs","268891179_The_Kohlrausch_function_properties_and_applications","262244032_A_Reputation_Framework_for_Social_Participatory_Sensing_Systems","304358731_Defending_against_Sybil_Devices_in_Crowdsourced_Mapping_Services","282564141_Trust_Management_and_Reputation_Systems_in_Mobile_Participatory_Sensing_Applications_A_Survey","273393306_Free_Market_of_Crowdsourcing_Incentive_Mechanism_Design_for_Mobile_Sensing","269298309_Trac_Truthful_Auction_for_Location-Aware_Collaborative_Sensing_in_Mobile_Crowdsourcing","262203262_Trust-aware_Recommender_Systems","261060371_Optimal_Incentive-driven_Design_of_Participatory_Sensing_Systems"]}