{"id":"321324502_Towards_Accurate_Deceptive_Opinion_Spam_Detection_based_on_Word_Order-preserving_CNN","abstract":"As a mainly network of Internet naval activities, the deceptive opinion spam is of great harm. The identification of deceptive opinion spam is of great importance because of the rapid and dramatic development of Internet. The effective distinguish between positive and deceptive opinion plays an important role in maintaining and improving the Internet environment. Deceptive opinion spam is very short, varied type and content. In order to effectively identify deceptive opinion, expect for the textual semantics and emotional polarity that have been widely used in text analysis, we need to further summarize the deep features of deceptive opinion in order to characterize deceptive opinion effectively. In this paper, we use the traditional convolution neural network and improve it from the point of the word order by using the method called word order-preserving k-max pooling, which makes convolution neural network more suitable for text classification. The experiment can get better deceptive opinion spam detection.","authors":["Siyuan Zhao","Zhiwei Xu","Limin Liu","Mengjie Guo"],"meta":["September 2018Mathematical Problems in Engineering 2018(1)","DOI:10.1155/2018/2410206"],"references":["305334466_Recurrent_Neural_Network_Grammars","303476391_On_the_Temporal_Dynamics_of_Opinion_Spamming_Case_Studies_on_Yelp","303015763_Detecting_Rumors_from_Microblogs_with_Recurrent_Neural_Networks","302662540_Neural_associative_memories_based_on_optimal_bayesian_learning","348692884_Recurrent_Neural_Network","347550003_Deceptive_Opinion_Spam_based_On_Deep_Learning","322408637_Detection_of_False_Online_Advertisements_with_DCNN","321941910_Detecting_Deceptive_Opinions_Intra_and_Cross-Domain_Classification_Using_an_Efficient_Representation","315989962_Spam_Mobile_Apps_Characteristics_Detection_and_in_the_Wild_Analysis","301404376_Semantic_Clustering_and_Convolutional_Neural_Network_for_Short_Text_Categorization"]}