{"id":"321347680_Diversity_Constraints_in_Public_Housing_Allocation","abstract":"The state of Singapore operates a national public housing program, accounting for over 80% of its residential real estate. Singapore uses its housing allocation program to ensure ethnic diversity in its neighborhoods; it does so by imposing ethnic quotas: every ethnic group must not own more than a certain percentage in a housing project, thus ensuring that every neighborhood contains members from each ethnic group. However, imposing diversity constraints naturally results in some welfare loss. Our work studies the tradeoff between diversity and social welfare from the perspective of computational economics. We model the problem as an extension of the classic assignment problem, with additional diversity constraints. While the classic assignment program is poly-time computable, we show that adding diversity constraints makes the problem computationally intractable; however, we identify a $\\tfrac{1}{2}$-approximation algorithm, as well as reasonable agent utility models which admit poly-time algorithms. In addition, we study the price of diversity: this is the loss in welfare incurred by imposing diversity constraints; we provide upper bounds on the price of diversity as a function of natural problem parameters; next, we analyze public data from Singapore's Housing and Development Board, and create a simulated framework testing the welfare loss due to diversity constraints in realistic large-scale scenarios.","authors":["Nawal Benabbou","Mithun Chakraborty","Vinh Ho Xuan","Jakub Sliwinski"],"meta":["January 2018","Conference: International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2018)"],"references":["277019922_Approximation_Algorithms_for_Bounded_Color_Matchings_via_Convex_Decompositions","335470421_Random_Serial_Dictatorship_The_One_and_Only","318829966_Diverse_Weighted_Bipartite_b-Matching","318489246_Finding_Fair_and_Efficient_Allocations","317704918_Approximation_Algorithms_for_Maximin_Fair_Division","314903538_Raffles","305524869_The_Unreasonable_Fairness_of_Maximum_Nash_Welfare","288645327_The_Story_of_Singapore's_Public_Housing_From_a_Nation_of_Home-Seekers_to_a_Nation_of_Homeowners","275912235_School_Admissions_Reform_in_Chicago_and_England_Comparing_Mechanisms_by_their_Vulnerability_to_Manipulation","265426020_Algorithms_for_the_Assignment_and_Transportation_Problems"]}