{"id":"321321806_Debugging_Cyber-Physical_Systems_with_Pharo_An_Experience_Report","abstract":"Cyber-Physical Systems (CPS) integrate sensors and actuators to collect data and control entities in the physical world. Debugging CPS systems is hard due to the time-sensitive nature of a distributed applications combined with the lack of control on the surrounding physical environment. This makes bugs in CPS systems hard to reproduce and thus to fix. In this context, on-line debugging techniques are helpful because the debugger is connected to the device when an exception or crash occurs.\nThis paper reports on our experiences on applying two different on-line debugging techniques for a CPS system: remote debugging using the Pharo remote debugger and our IDRA debugger. In contrast to traditional remote debugging, IDRA allows to on-line debug an application locally in another client machine by reproducing the runtime context where the bug manifested. Our qualitative evaluation shows that IDRA provides almost the same interaction capabilities than Pharo's remote debugger and is less intrusive when performing hot-modifications. Our benchmarks also show that IDRA is significantly faster than the Pharo remote debugger, although it increases the amount of data transferred over the network.","authors":["Matteo Marra","Elisa Gonzalez Boix","Steven Costiou","Mickaël Kerboeuf"],"meta":["September 2017","DOI:10.1145/3139903.3139913","Conference: the 12th edition of the International Workshop"],"references":["303099521_BigDebug_Debugging_Primitives_for_Interactive_Big_Data_Processing_in_Spark","277917044_Mercury_Properties_and_Design_of_a_Remote_Debugging_Solution_using_Reflection","256663425_Representing_Code_History_with_Development_Environment_Events","241624085_Clustered_Serialization_with_Fuel","213878888_Debugging_concurrent_programs","200040296_Mirrors_Design_principles_for_meta-level_facilities_of_object-oriented_programming_languages","3187935_Understanding_Code_Mobility","261021106_A_Classification_of_the_Debugging_Techniques_of_Wireless_Sensor_Networks","220280289_Stabdump-A_Dump_Interpreter_Program_to_Assist_Debugging"]}