{"id":"321325770_A_Deep_Learning_Approach_for_Population_Estimation_from_Satellite_Imagery","abstract":"Knowing where people live is a fundamental component of many decision making processes such as urban development, infectious disease containment, evacuation planning, risk management, conservation planning, and more. While bottom-up, survey driven censuses can provide a comprehensive view into the population landscape of a country, they are expensive to realize, are infrequently performed, and only provide population counts over broad areas. Population disaggregation techniques and population projection methods individually address these shortcomings, but also have shortcomings of their own. To jointly answer the questions of \"where do people live\" and \"how many people live there,\" we propose a deep learning model for creating high-resolution population estimations from satellite imagery. Specifically, we train convolutional neural networks to predict population in the USA at a 0.01°x0.01° resolution grid from 1-year composite Landsat imagery. We validate these models in two ways: quantitatively, by comparing our model's grid cell estimates aggregated at a county-level to several US Census county-level population projections, and qualitatively, by directly interpreting the model's predictions in terms of the satellite image inputs. We find that aggregating our model's estimates gives comparable results to the Census county-level population projections and that the predictions made by our model can be directly interpreted, which give it advantages over traditional population disaggregation methods. In general, our model is an example of how machine learning techniques can be an effective tool for extracting information from inherently unstructured, remotely sensed data to provide effective solutions to social problems.","authors":["Caleb Robinson","Frederick Matthew Hohman","Bistra Dilkina"],"meta":["November 2017","DOI:10.1145/3149858.3149863","Conference: the 1st ACM SIGSPATIAL Workshop"],"references":["318920503_Using_Convolutional_Networks_and_Satellite_Imagery_to_Identify_Patterns_in_Urban_Environments_at_a_Large_Scale","315882788_Using_convolutional_networks_and_satellite_imagery_to_identify_patterns_in_urban_environments_at_a_large_scale","311491838_DeepSat_a_learning_framework_for_satellite_imagery","304783430_A_New_Short-Term_County_Population_Projection_Method","301854581_Towards_Better_Exploiting_Convolutional_Neural_Networks_for_Remote_Sensing_Scene_Classification","283501025_Transferring_Deep_Convolutional_Neural_Networks_for_the_Scene_Classification_of_High-Resolution_Remote_Sensing_Imagery","282403466_Transfer_Learning_from_Deep_Features_for_Remote_Sensing_and_Poverty_Mapping","311313583_Equitable_development_through_deep_learning_The_case_of_sub-national_population_density_estimation","306300024_Combining_satellite_imagery_and_machine_learning_to_predict_poverty","283892100_Taking_Advantage_of_the_Improved_Availability_of_Census_Data_A_First_Look_at_the_Gridded_Population_of_the_World_Version_4"]}