{"id":"321395317_Self-righting_potential_and_the_evolution_of_shell_shape_in_Galapagos_tortoises","abstract":"Self-righting, the capacity of an animal to self-turn after falling on its back, is a fitness-related trait. Delayed self-righting can result in loss of mating opportunities or death. Traits involved in self-righting may therefore be under selection. Galápagos giant tortoises have two main shell morphologies - saddleback and domed – that have been proposed to be adaptive. The more sloped shape on the sides of the shell and the longer extension of neck and legs of the saddlebacks could have evolved to optimize self-righting. The drier environments with more uneven surfaces where the saddleback tortoises occur increases their risk to fall on their back while walking. The ability to fast overturn could reduce the danger of dying. To test this hypothesis, we used 3D shell reconstructions of 89 Galápagos giant tortoises from three domed and two saddleback species to compare self-righting potential of the two shell morphotypes. Our results indicate that saddleback shells require higher energy input to self-right than domed ones. This suggests that several traits associated with the saddleback shell morphology could have evolved to facilitate self-righting. Studying the functional performances of fitness-related traits, as in this work, could provide important insight into the adaptive value of traits.","authors":["Ylenia Chiari","Arie Van der Meijden","Adalgisa Caccone","Julien Claude"],"meta":["November 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-15787-7"],"references":["299656049_Ecological_and_evolutionary_influences_on_body_size_and_shape_in_the_Galapagos_marine_iguana_Amblyrhynchus_cristatus","283056521_Description_of_a_New_Galapagos_Giant_Tortoise_Species_Chelonoidis_Testudines_Testudinidae_from_Cerro_Fatal_on_Santa_Cruz_Island","313174403_Exaptation_A_Missing_Term_in_the_Science_of_Form","305114148_Expedition_of_the_California_Academy_of_Sciences_to_the_Galapagos_Islands_1905-1906","286632567_Study_of_a_soil_sequence_on_Indefatigable_Island","275823327_Ontogenetic_shift_of_antipredator_behaviour_in_Hermann's_tortoises","274428506_Righting_time_versus_shell_size_and_shape_dimorphism_in_adult_Hermann's_tortoises_Field_observations_meet_theoretical_predictions","274228601_Encyclopedia_of_Turtles","270006366_Geometry_of_self_righting_The_case_of_Hermann's_tortoises","255621677_Agonistic_Behavior_of_the_Galapagos_Tortoise_Geochelone_elephantopus_with_Emphasis_on_Its_Relationship_to_Saddle-Backed_Shell_Shape"]}