{"id":"321327719_Memetic_Algorithm_Based_on_Global-Best_Harmony_Search_and_Hill_Climbing_for_Part_of_Speech_Tagging","abstract":"The task of assigning tags to the words of a sentence has many applications today in natural language processing (NLP) and therefore requires a fast and accurate algorithm. This paper presents a Part-of-Speech Tagger based on Global-Best Harmony Search (GBHS) which includes local optimization (based on the Hill Climbing algorithm that includes knowledge of the problem to define the neighborhood) for the best harmony after each improvisation (iteration). In the proposed algorithm, a candidate solution (harmony) is represented as a vector of the size of the numbers of word in a sentence, while the fitness function considers the cumulative probability of tagging each word and its relation to its predecessor and successor word. The proposed algorithm obtained 95.2% precision values and improved on the results obtained by other taggers. The experimental results were analyzed with Friedman non-parametric statistical tests, with a level of significance of 90%. The proposed Part-of-Speech Tagger algorithm was found to perform with quality and efficiency in the tagging problem, in contrast to the comparison algorithms. The Brown corpus divided into 5 folders was used to conduct the experiments, thereby allowing application of cross-validation.","authors":["Luz Marina Sierra Martínez","Carlos Cobos","Juan Carlos Corrales"],"meta":["November 2017Lecture Notes in Computer Science 10682:198-211","DOI:10.1007/978-3-319-71928-3_20"],"references":["308584335_Heuristic-based_part-of-speech_tagging_of_source_code_identifiers_and_comments","301404130_What_Can_We_Get_From_1000_Tokens_A_Case_Study_of_Multilingual_POS_Tagging_For_Resource-Poor_Languages","319393928_Modern_Information_Retrieval","319393666_Modern_Information_Retrieval","312607081_Building_a_large_annotated_corpus_of_english_The_penn_treebank","308827054_A_hybrid_Parts_Of_Speech_tagger_for_Malayalam_language","304295921_An_English_Part_of_Speech_Tagging_Method_Based_on_Maximum_Entropy","304293263_Innovative_algorithms_for_Parts_of_Speech_Tagging_in_hindi-english_machine_translation_language","304289871_Hidden_Markov_Model_based_Part_of_Speech_Tagging_for_Nepali_language","290633663_A_new_approach_to_the_POS_tagging_problem_using_evolutionary_computation"]}