{"id":"321382026_Museo_sobre_la_historia_de_los_Computadores_Museum_of_the_history_of_computers","abstract":"The Computer Architecture group has a high number of devices related to the history of the computers. This material was stored in a warehouse and the aim to develop in this paper is based on exploiting these devices so that our students of degrees in computer science (especially students of the speciality of computer engineering), physics and electronics, can view physically the materials described in different subjects. Resumen El grupo docente de Arquitectura de Computadores tiene en su haber una gran cantidad de dispositivos relacionados con la historia del PC. Este material se encontraba confinado en un almacén y el objetivo principal a desarrollar en este trabajo se basa en explotar ese material desaprovechado para que nuestros alumnos de las titulaciones de los Grados en Informática (especialmente los alumnos de la especialidad de Ingeniería de Computadores), Física y Electrónica, se enriquezcan viendo físicamente materiales de los que se les habla en distintas asignaturas. Palabras clave: museo; historia de los computadores; componentes del PC 1. INTRODUCCIÓN Durante la Segunda Guerra Mundial surgen los primeros computadores dentro de los proyectos secretos que mantenían las distintas naciones. La evolución de la tecnología ha hecho que, cada ciertos años, apareciera un elemento novedoso y crítico que reducía considerablemente las dimensiones de los computadores, su precio, su consumo en potencia, al mismo tiempo que aumentaba su velocidad. Estos elementos novedosos han sido los encargados de clasificar los computadores en distintas generaciones. A partir de aquí comienza una carrera con el objetivo de conseguir computadores cada vez más pequeños, rápidos, de menor precio y con un consumo de potencia cada vez menor [1].","authors":["A Gersnoviez","M Brox","Manuel Ortiz","Francisco J. Quiles"],"meta":["January 2017Revista de Innovación y Buenas Prácticas Docentes 1(1):169–175","DOI:10.21071/ripadoc.v1i0.9607"],"references":[]}