{"id":"321450064_Da_informatica_a_tecnologia_da_informacao_dependencia_reserva_de_mercado_e_suas_implicacoes_politico-economicas_From_informatics_to_information_technology_dependence_market_reserve_and_its_political_a","abstract":"RESUMO Nos rumos da evolução do componente tecnológico na contemporaneidade, a reconhecida era da informação e sua correspondente sociedade da informação já foram também consideradas era da informática e, por sua vez, sociedade da informática. Com o passar do tempo, disciplinas comumente associadas à aplicação da ciência da computação, em conjunto com outros campos de conhecimento, perderam sua alcunha coletiva consagrada, a informática, por um novo termo, o da tecnologia da informação. O artigo discorre sobre o percurso da informática à noção de tecnologia da informação, e reúne, brevemente, elementos que identificam o componente tecnológico, localizados em aspectos políticos, econômicos e sociais do país, para então compreender as implicações dos caminhos tomados. A informática no Brasil é retratada em seus aspectos históricos de dependência e reserva de mercado, abordando-se as implicações políticas dessa postura. As descontinuidades dos programas e governos apontam para uma tímida (ou mesmo inexistente) política nacional de tecnologia da informação no país, e colocam ao centro o aspecto econômico em detrimento dos demais.\n\nPalavras-chave: Informática; Tecnologia da Informação; Política Nacional de Informática.\nABSTRACT In terms of the evolution of the technological component in the contemporary world, the acknowledged information age and its corresponding information society was also considered as a computer age and, in turn, a computer science society. Over time disciplines commonly associated with the application of Computer Science in conjunction with other fields of knowledge have lost their consecrated collective, computing, for a new term, that of information technology. This paper discusses the course of computing to the notion of information technology and briefly brings together elements that identify the technological component, located in political, economic and social aspects of the country and then understand the implications of the paths taken. Informatics in Brazil is portrayed in its historical aspects of dependence and market reserve, addressing the political implications of this stance. The discontinuities of the programs and governments point to a timid (or even non-existent) national information technology policy in the country, and place the economic aspect at the center at the expense of the others.\n\nKeywords: Informatics; Information Technology; National Policy of Informatics.","authors":["Ronaldo Ferreira Araujo","Marlene Oliveira"],"meta":["December 2017Liinc em Revista 13(2)","DOI:10.18617/liinc.v13i2.3941"],"references":["338175712_O_estagio_do_governo_eletronico_no_Brasil_em_relacao_ao_contexto_mundial","277035550_Subdesenvolvimento_dependencia_tecnologica_e_informacao","273170916_RESERVA_DE_MERCADO_UM_MAL_ENTENDIDO_CASO_POLITICO-TECNOLOGICO_DE_SUCESSO_DEMOCRATICO_E_FRACASSO_AUTORITARIO","270486072_Fabio_Erber_o_economista_e_suas_circunstancias","270202561_Aspectos_da_politica_tecnologica_nos_paises_da_America_Latina","250048269_A_politica_na_sociedade_do_conhecimento","246620449_Knowledge_Societies_Information_Technology_for_Sustainable_Development","291214367_Modernizacao_da_agricultura_no_Brasil_Impactos_economicos_sociais_e_ambientais","261834017_As_tecnologias_da_inteligencia_o_futuro_do_pensamento_na_era_da_informatica","43196603_A_INFORMATICA_NO_BRASIL_E_O_NOVO_PARADIGMA_INDUSTRIAL"]}