{"id":"321493303_Understanding_the_impact_of_guiding_inquiry_the_relationship_between_directive_support_student_attributes_and_transfer_of_knowledge_attitudes_and_behaviours_in_inquiry_learning","abstract":"Guiding inquiry learning has been shown to increase knowledge gains. Yet, little is known about the effect of guidance on attitudes and behaviours, its interaction with student attributes, and transfer of impact once guidance is removed. We address these gaps in the context of an interactive Physics simulation on electric circuits (https://phet.colorado.edu/en/simulation/circuit-construction-kit-dc). 49 students in the Non-Directive condition received a set of goals to focus their inquiry, in addition to implicit support built into the simulation. 48 students in the Directive condition received, in addition to these, also detailed directions and prompts. Log-file analysis found that directive support led to more formal testing and less exploration. Clustering identified two groups of learners: one with higher incoming knowledge (Higher Knowledge), the other with higher incoming perceptions of competence and control (Higher PoCC). Working with the simulation improved knowledge and attitudes across cluster groups, so that prior differences all but disappeared. With regard to guidance, adding directive support improved knowledge gains for the Higher Knowledge group, yet suppressed their attitudinal growth. The same support had no effect on knowledge gains for the Higher PoCC group, yet it boosted their attitudinal growth. A transfer activity, where directive support was no longer available, found that impact on attitudes carried forward, yet impacts on behaviours and knowledge were short-lived. Overall, the study highlights the complex interaction between guidance and student attributes. For some, supporting short-term knowledge gains may inadvertenly lead to longer term negative impact on attitudes towards inquiry.","authors":["Ido Roll","Deborah L Butler","Nikki Yee","Ashley Welsh"],"meta":["February 2018Instructional Science 46(9)","DOI:10.1007/s11251-017-9437-x"],"references":["318449853_Modeling_Student_Learning_Behavior_Patterns_in_an_Online_Science_Inquiry_Environment","318155591_Identifying_Productive_Inquiry_in_Virtual_Labs_Using_Sequence_Mining","305397119_Towards_a_Theory_of_When_and_How_Problem_Solving_Followed_by_Instruction_Supports_Learning","318155489_Is_More_Agency_Better_The_Impact_of_Student_Agency_on_Game-Based_Learning","316823281_Self-efficacy_the_exercise_of_control","313080735_A_response_time_model_for_bottom-out_hints_as_worked_examples","312392155_Designing_Grounded_Feedback_Criteria_for_Using_Linked_Representations_to_Support_Learning_of_Abstract_Symbols","310750355_Expectancy-value_theory_of_achievement_motivation","302567283_Microworlds","299996960_Examining_Productive_Failure_Productive_Success_Unproductive_Failure_and_Unproductive_Success_in_Learning","294290060_Ability-related_differences_in_performance_of_an_inquiry_task_The_added_value_of_prompts","293193229_Meta-Analysis_of_Inquiry-Based_Learning_Effects_of_Guidance","291741577_Systematic_review_and_meta-analysis_of_STEM_simulations","288859761_An_attributional_approach_to_motivation_in_school","285723655_Self-theories_and_motivation_Students'_beliefs_about_intelligence"]}