{"id":"321458684_Simternet_-_Complex_Internet_Exercise_on_a_Virtual_ICT_Learning_Environment","abstract":"Information and communications technology systems are increasingly important to the modern society. Understanding the complex systems, which powers our everyday lives, is an important competence for future experts, since everything is getting connected from the simple household devices to the complex industrial systems. In this paper, a high-level concept for a complex learning environment is presented, which aims to simulate the Internet and offer a realistic environment where ICT (Information and Communications Technology) systems can be further studied. A model of Internet was used as a centre point to interconnect virtualized cases together and a simple, scalable virtualization platform was developed to meet the demands. This study was conducted to assess the performance and scalability of the solution, and test the system user experience and usability issues when under heavy workload. The results indicate that the system is capable of simulating several thousand different devices, and serve as a basis for further development.","authors":["Vesa Kankare","Jussi Kasurinen"],"meta":["January 2017Procedia Computer Science 119:350-358","DOI:10.1016/j.procs.2017.11.194","Project: XAMK Kotka Digital Economies Research Group"],"references":["273771346_Remote_Security_Labs_in_The_Cloud","273756984_Hypervisors_vs_Lightweight_Virtualization_A_Performance_Comparison","266660100_VIRL_the_virtual_internet_routing_lab","262867517_Computer_Networks_Virtualization_with_GNS3_Evaluating_a_solution_to_optimize_resources_and_achieve_a_distance_learning","225369468_Rapid_prototyping_methodology_in_action_A_developmental_study","309961613_Containers_and_Virtual_Machines_at_Scale_A_Comparative_Study","308704308_Network_simulations_and_future_technologies_in_teaching_networking_courses_Development_of_a_laboratory_model_with_Cisco_Virtual_Internet_Routing_Lab_Virl","299867537_Containing_the_Hype","283551946_Virtual_Laboratories_-_Use_of_Public_Testbeds_in_Education","224557651_Assessing_Student_Learning_in_a_Virtual_Laboratory_Environment"]}