{"id":"321410768_Graph-based_analysis_of_brain_connectivity_in_schizophrenia","abstract":"The present study evaluated brain connectivity using electroencephalography (EEG) data from 14 patients with schizophrenia and 14 healthy controls. Phase-Locking Value (PLV), Phase-Lag Index (PLI) and Directed Transfer Function (DTF) were calculated for the original EEG data and following current source density (CSD) transformation, re-referencing using the average reference electrode (AVERAGE) and reference electrode standardization techniques (REST). The statistical analysis of adjacency matrices was carried out using indices based on graph theory. Both CSD and REST reduced the influence of volume conducted currents. The largest group differences in connectivity were observed for the alpha band. Schizophrenic patients showed reduced connectivity strength, as well as a lower clustering coefficient and shorter characteristic path length for both measures of phase synchronization following CSD transformation or REST re-referencing. Reduced synchronization was accompanied by increased directional flow from the occipital region for the alpha band. Following the REST re-referencing, the sources of alpha activity were located at parietal rather than occipital derivations. The results of PLV and DTF demonstrated group differences in fronto-posterior asymmetry following CSD transformation, while for PLI the differences were significant only using REST. The only analysis that identified group differences in inter-hemispheric asymmetry was DTF calculated for REST. Our results suggest that a comparison of different connectivity measures using graph-based indices for each frequency band, separately, may be a useful tool in the study of disconnectivity disorders such as schizophrenia.","authors":["Elzbieta Olejarczyk","Wojciech Jernajczyk"],"meta":["November 2017PLoS ONE 12(11):e0188629","DOI:10.1371/journal.pone.0188629","Projects: Impact of transcranial magnetic stimulation on brain connectivity in psychiatry.Brain connectivity analysis"],"references":["319646126_The_EEG_Split_Alpha_Peak_Phenomenological_Origins_and_Methodological_Aspects_of_Detection_and_Evaluation","318228773_How_Different_EEG_References_Influence_Sensor_Level_Functional_Connectivity_Graphs","317236110_Non-linear_Analysis_of_Scalp_EEG_by_Using_Bispectra_The_Effect_of_the_Reference_Choice","317170877_The_Influence_of_Volume_Conduction_on_DTF_Estimate_and_the_Problem_of_Its_Mitigation","310745745_Volume_Conduction_Influences_Scalp-Based_Connectivity_Estimates","309645656_Neuronal_electrical_ongoing_activity_as_a_signature_of_cortical_areas","305288072_Critical_Comments_on_EEG_Sensor_Space_Dynamical_Connectivity_Analysis","315975208_Complexity_of_EEG-signal_in_Time_Domain_-_Possible_Biomedical_Application","315788268_Comparison_of_connectivity_analyses_for_resting_state_EEG_data","301826550_Impact_of_the_reference_choice_on_scalp_EEG_connectivity_estimation"]}