{"id":"321409106_On_the_Optimization_of_Improved_Apriori_Algorithm_via_Linked-list_Trie","abstract":"In recent years there has been explosive growth of data and its utilization triggered by technological advancements. Consequently, several business enterprises have accumulated enormous data from client purchases gathered at all times. Data mining involve processes used to turn raw data into beneficial information through the use of suitable software and hardware. This area has attracted significant attention and several different approaches exist such as association rules (AR). In particular, AR constitutes an important data mining approach but is faced with several challenges in terms of efficiency. Therefore, this paper investigates the major challenges based on AR in data mining stemming from the improvement of the apriori algorithm. We aim towards reducing the major shortcomings of the current apriori algorithm. This paper also proposes the usage of an optimized linked-list trie data structure for storage and to make support counting more efficient. To achieve this, an effective candidate generation method was employed to reduce the cost of matching candidate itemsets. The improved and the optimized apriori algorithm and its benefits are presented and discussed in this paper.","authors":["Mercy Mlambo","Naison Gasela","Esiefarienrhe Bukohwo","Bassey Isong"],"meta":["October 2017","DOI:10.1145/3152723.3152740","Conference: the 2017 International Conference","Project: IT Security and IT Governance  in Cloud Computing"],"references":["266414509_Aggregate_Function_Based_Enhanced_Apriori_Algorithm_for_Mining_Association_Rules","266348059_PALM_Preprocessed_Apriori_For_Logical_Matching_Using_Map_Reduce_Algorithm-PALM_Preprocessed_Apriori_For_Logical_Matching_Algorithm_Apriori_Algorithm_Map_Reducing_Algorithm_and_Pattern_Matching","317269464_Recommender_system_based_on_scarce_information_mining","312775005_MapReduce_Simplified_data_processing_on_large_clusters","303206384_Data_Mining_Concepts_and_Techniques","301463783_The_Parallel_Improved_Apriori_Algorithm_Research_Based_on_Spark","300542828_An_Enhancement_of_the_MapReduce_Apriori_Algorithm_Using_Vertical_Data_Layout_and_Set_Theory_Concept_of_Intersection","284602613_Implementing_improved_algorithm_over_APRIORI_data_mining_association_rule_algorithm","282189528_A_Method_to_Optimize_Apriori_Algorithm_for_Frequent_Items_Mining","262528259_An_Efficient_Merkle-Tree-Based_Authentication_Scheme_for_Smart_Grid"]}