{"id":"321417588_Direct_Segmented_Sonification_of_Characteristic_Features_of_the_Data_Domain","abstract":"Sonification and audification create auditory displays of datasets. Audification translates data points into digital audio samples and the auditory display's duration is determined by the playback rate. Like audification, auditory graphs maintain the temporal relationships of data while using parameter mappings (typically data-to-frequency) to represent the ordinate values. Such direct approaches have the advantage of presenting the data stream `as is' without the imposed interpretations or accentuation of particular features found in indirect approaches. However, datasets can often be subdivided into short non-overlapping variable length segments that each encapsulate a discrete unit of domain-specific significant information and current direct approaches cannot represent these. We present Direct Segmented Sonification (DSSon) for highlighting the segments' data distributions as individual sonic events. Using domain knowledge to segment data, DSSon presents segments as discrete auditory gestalts while retaining the overall temporal regime and relationships of the dataset. The method's structural decoupling from the sound stream's formation means playback speed is independent of the individual sonic event durations, thereby offering highly flexible time compression/stretching to allow zooming into or out of the data. Demonstrated by three models applied to biomechanical data, DSSon displays high directness, letting the data `speak' for themselves.","authors":["Paul Vickers","Robert Höldrich"],"meta":["November 2017"],"references":["317187975_Movement_amplitude_on_the_Functional_Re-adaptive_Exercise_Device_deep_spinal_muscle_activity_and_movement_control","279851430_AUGMENTED_AUDIFICATION","224927719_Sonification_Abstraite_Sonification_Concrete_An_'Aesthetic_Perspective_Space'_for_Classifying_Auditory_Displays_in_the_Ars_Musica_Domain","220245073_Musical_Program_Auralisation_Empirical_Studies","306246480_Perceiving_Graphical_and_Pictorial_Information_via_Hearing_and_Touch","295866198_Comparison_and_Evaluation_of_Sonification_Strategies_for_Guidance_Tasks","277078168_Translating_Sonifications"]}