{"id":"321427658_Modelo_Teorico_Logico_uma_avaliacao_na_perspectiva_da_educacao_popular_para_idosos_Theorical_Logical_Model_An_Assessment_in_the_Perspective_of_Popular_Education_for_Elderly","abstract":"RESUMO O modelo lógico facilita planejar e comunicar o que se pretende avaliar, bem como o que se espera dele. Uma proposta para organizações de modo que sejam observadas se estão sendo realizadas e levando aos resultados esperados. Formado por três componentes. No primeiro componente, é demonstrado o problema existente, com o público alvo e beneficiários, bem como o objetivo geral e específicos. O segundo componente irá mostrar o resultado final e os impactos diretos e indiretos ocasionados. A relevância e os pontos favoráveis e desfavoráveis contidos comporão o terceiro componente. O estudo tem como objetivo fazer uma avaliação na Faculdade Aberta para a Terceira Idade, em Petrolina-PE (FATI FACAPE/UPE), para que possam ser observados metas e resultados, traçando o que deve ser melhorado, bem como os fatores favoráveis e desfavoráveis ao campo de estudo sob o modelo lógico na perspectiva da educação popular. A pesquisa ocorreu na FATI FACAPE/UPE. Esta é composta por uma equipe multidisciplinar das áreas de Administração, Ciências Contábeis, Ciência da Computação, Gestão em Tecnologia da Informação, Direito, Saúde, Pedagogia e Letras. Conta com o apoio da Coordenação de Extensão da Faculdade de Ciências Aplicáveis de Petrolina, em parceria com a Universidade de Pernambuco. Essa faculdade aberta permite abrir as portas para um segmento da população que necessita de oportunidades, bem como abrir um espaço de convivência social, de aquisição de novos conhecimentos voltados para o envelhecimento sadio e digno e o modelo lógico possibilita uma avaliação do mesmo. Palavras-chave: Envelhecimento; avaliação; programa. ABSTRACT The logical model makes it easy to plan and communicate what intended to evaluate, as well as what is expected of it. A proposal to organize the actions so that they are being carried out and the 1 Enfermeira. Docente de Enfermagem da UPE Campus Petrolina. Doutoranda em Ciências e Química da Vida-UFRGS. Endereço:Rua Lucas Roberto de Araujo,","authors":["Thereza Christina da Cunha Lima Gama","Sofia Santos","Camila de Souza Coelho","Edivaldo Xavier Silva Júnior"],"meta":["October 2017"],"references":["322906948_Avaliacao_em_saude_dos_modelos_teoricos_a_pratica_na_avaliacao_de_programas_e_sistemas_de_saude","307726346_O_desafio_da_avaliacao_da_producao_cientifica","250027934_Utilizacao_de_pesquisas_como_construir_modelos_teoricos_para_avaliacao","240972823_Perspectivas_atuais_da_educacao"]}