{"id":"321493951_Non-convex_Optimization_for_Machine_Learning","abstract":"A vast majority of machine learning algorithms train their models and perform inference by solving optimization problems. In order to capture the learning and prediction problems accurately, structural constraints such as sparsity or low rank are frequently imposed or else the objective itself is designed to be a non-convex function. This is especially true of algorithms that operate in high-dimensional spaces or that train non-linear models such as tensor models and deep networks. The freedom to express the learning problem as a non-convex optimization problem gives immense modeling power to the algorithm designer, but often such problems are NP-hard to solve. A popular workaround to this has been to relax non-convex problems to convex ones and use traditional methods to solve the (convex) relaxed optimization problems. However this approach may be lossy and nevertheless presents significant challenges for large scale optimization. On the other hand, direct approaches to non-convex optimization have met with resounding success in several domains and remain the methods of choice for the practitioner, as they frequently outperform relaxation-based techniques - popular heuristics include projected gradient descent and alternating minimization. However, these are often poorly understood in terms of their convergence and other properties. This monograph presents a selection of recent advances that bridge a long-standing gap in our understanding of these heuristics. The monograph will lead the reader through several widely used non-convex optimization techniques, as well as applications thereof. The goal of this monograph is to both, introduce the rich literature in this area, as well as equip the reader with the tools and techniques needed to analyze these simple procedures for non-convex problems.","authors":["Prateek P Jain","Purushottam Kar"],"meta":["December 2017Foundations and Trends® in Machine Learning 10(3-4):142-336","DOI:10.1561/2200000058"],"references":["332137169_Reinforcement_Learning_of_POMDPs_using_Spectral_Methods","327767128_Statistical_Learning_with_Sparsity_The_Lasso_and_Generalizations","319895134_Learning_Depth-Three_Neural_Networks_in_Polynomial_Time","319770239_Identifying_and_attacking_the_saddle_point_problem_in_high-dimensional_non-convex_optimization","319373007_Wiley_Series_in_Probability_and_Statistics","317633546_Finding_approximate_local_minima_faster_than_gradient_descent","308864207_Local_and_global_optimality_of_LP_minimization_for_sparse_recovery","306173128_Convergence_of_an_alternating_maximization_procedure","301898481_Training_Input-Output_Recurrent_Neural_Networks_through_Spectral_Methods","295699887_Matrix_factorization_techniques_for_recommender_systems","283117867_When_Are_Nonconvex_Problems_Not_Scary","284060073_The_diameters_of_octahedra","283786636_Convex_Optimization_Algorithms_and_Complexity","283755139_Matrix_Completion_With_Column_Manipulation_Near-Optimal_Sample-Robustness-Rank_Tradeoffs","280221190_Sharp_Time--Data_Tradeoffs_for_Linear_Inverse_Problems"]}