{"id":"321427501_Dynamics_Sampling_in_Transition_Pathway_Space","abstract":"The minimum energy pathway contains important information describing the transition between two states on a potential energy surface (PES). Chain-of-states methods were developed to efficiently calculate minimum energy pathways connecting two stable states. In the chain-of-states framework, a series of structures are generated and optimized to represent the minimum energy pathway connecting two states. However, multiple pathways may exist connecting two existing states, and should be identified to obtain a full view of the transitions. Therefore, we developed an enhanced sampling method, named as the direct pathway dynamics sampling (DPDS) method, to facilitate exploration of a PES for multiple pathways connecting two stable states as well as addition minima and their associated transition pathways. In the DPDS method, molecular dynamics simulations are carried out on the targeting PES within a chain-of-states framework to directly sample the transition pathway space. The simulations of DPDS could be regulated by two parameters controlling distance among states along the pathway and smoothness of the pathway. One advantage of the chain-of-states framework is that no specific reaction coordinates are necessary to generate the reaction pathway, because such information is implicitly represented by the structures along the pathway. The chain-of-states setup in a DPDS method greatly enhances the sufficient sampling in high-energy space between two end states, such as transition states. By removing the constraint on the end states of the pathway, DPDS will also sample pathways connecting minima on a PES in addition to the endpoints of starting pathway. This feature makes DPDS an ideal method to directly explore transition pathway space. Three examples demonstrate the efficiency of DPDS methods in sampling the high-energy area important for reactions on the PES.","authors":["Hongyu Zhou","Peng Tao"],"meta":["November 2017Journal of Chemical Theory and Computation 14(1)","DOI:10.1021/acs.jctc.7b00606"],"references":["285319306_Transition_Path_Theory","281792288_CHARMM_The_biomolecular_simulation_program","302593894_Path_optimization_by_a_variational_reaction_coordinate_method_II_Improved_computational_efficiency_through_internal_coordinates_and_surface_interpolation","301686500_Markov_State_Models_and_tICA_Reveal_a_Nonnative_Folding_Nucleus_in_Simulations_of_NuG2","287965269_Path_optimization_by_a_variational_reaction_coordinate_method_I_Development_of_formalism_and_algorithms","281671064_A_simple_Chain-of-States_method_in_acceleration_space_for_the_efficient_location_of_Minimum_Energy_Paths","270903100_The_Protein_Data_Bank","265860034_Efficiently_computing_pathway_free_energies_New_approaches_based_on_chain-of-replica_and_Non-Boltzmann_Bennett_reweighting_schemes","264917026_Escaping_Free-Energy_Minima","251470749_An_Overview_of_String-Based_Path_Sampling_Methods"]}