{"id":"321416021_Quantum-Assisted_Learning_of_Hardware-Embedded_Probabilistic_Graphical_Models","abstract":"Mainstream machine-learning techniques such as deep learning and probabilistic programming rely heavily on sampling from generally intractable probability distributions. There is increasing interest in the potential advantages of using quantum computing technologies as sampling engines to speed up these tasks or to make them more effective. However, some pressing challenges in state-of-the-art quantum annealers have to be overcome before we can assess their actual performance. The sparse connectivity, resulting from the local interaction between quantum bits in physical hardware implementations, is considered the most severe limitation to the quality of constructing powerful generative unsupervised machine-learning models. Here, we use embedding techniques to add redundancy to data sets, allowing us to increase the modeling capacity of quantum annealers. We illustrate our findings by training hardware-embedded graphical models on a binarized data set of handwritten digits and two synthetic data sets in experiments with up to 940 quantum bits. Our model can be trained in quantum hardware without full knowledge of the effective parameters specifying the corresponding quantum Gibbs-like distribution; therefore, this approach avoids the need to infer the effective temperature at each iteration, speeding up learning; it also mitigates the effect of noise in the control parameters, making it robust to deviations from the reference Gibbs distribution. Our approach demonstrates the feasibility of using quantum annealers for implementing generative models, and it provides a suitable framework for benchmarking these quantum technologies on machine-learning-related tasks.","authors":["Marcello Benedetti","John Realpe-Gomez","Rupak Biswas","Alejandro Perdomo-Ortiz"],"meta":["November 2017Physical Review X 7(4)","DOI:10.1103/PhysRevX.7.041052"],"references":["319416018_On_the_Readiness_of_Quantum_Optimization_Machines_for_Industrial_Applications","319415972_Opportunities_and_challenges_for_quantum-assisted_machine_learning_in_near-term_quantum_computers","319415775_Quantum-assisted_Helmholtz_machines_A_quantum-classical_deep_learning_framework_for_industrial_datasets_in_near-term_devices","318721159_Quantum_machine_learning_A_classical_perspective","315116210_A_Study_of_Complex_Deep_Learning_Networks_on_High_Performance_Neuromorphic_and_Quantum_Computers","312521292_Basic_protocols_in_quantum_reinforcement_learning_with_superconducting_circuits","319349982_Viewing_Vanilla_Quantum_Annealing_Through_Spin_Glasses","318824536_Quantum_algorithm_for_linear_regression","317820194_Test-driving_1000_qubits","312031263_NIPS_2016_Tutorial_Generative_Adversarial_Networks"]}