{"id":"321441549_Medical_subdomain_classification_of_clinical_notes_using_a_machine_learning-based_natural_language_processing_approach","abstract":"Background\nThe medical subdomain of a clinical note, such as cardiology or neurology, is useful content-derived metadata for developing machine learning downstream applications. To classify the medical subdomain of a note accurately, we have constructed a machine learning-based natural language processing (NLP) pipeline and developed medical subdomain classifiers based on the content of the note. Methods\nWe constructed the pipeline using the clinical NLP system, clinical Text Analysis and Knowledge Extraction System (cTAKES), the Unified Medical Language System (UMLS) Metathesaurus, Semantic Network, and learning algorithms to extract features from two datasets — clinical notes from Integrating Data for Analysis, Anonymization, and Sharing (iDASH) data repository (n = 431) and Massachusetts General Hospital (MGH) (n = 91,237), and built medical subdomain classifiers with different combinations of data representation methods and supervised learning algorithms. We evaluated the performance of classifiers and their portability across the two datasets. ResultsThe convolutional recurrent neural network with neural word embeddings trained-medical subdomain classifier yielded the best performance measurement on iDASH and MGH datasets with area under receiver operating characteristic curve (AUC) of 0.975 and 0.991, and F1 scores of 0.845 and 0.870, respectively. Considering better clinical interpretability, linear support vector machine-trained medical subdomain classifier using hybrid bag-of-words and clinically relevant UMLS concepts as the feature representation, with term frequency-inverse document frequency (tf-idf)-weighting, outperformed other shallow learning classifiers on iDASH and MGH datasets with AUC of 0.957 and 0.964, and F1 scores of 0.932 and 0.934 respectively. We trained classifiers on one dataset, applied to the other dataset and yielded the threshold of F1 score of 0.7 in classifiers for half of the medical subdomains we studied. Conclusion\nOur study shows that a supervised learning-based NLP approach is useful to develop medical subdomain classifiers. The deep learning algorithm with distributed word representation yields better performance yet shallow learning algorithms with the word and concept representation achieves comparable performance with better clinical interpretability. Portable classifiers may also be used across datasets from different institutions.","authors":["Wei-Hung Weng","Kavishwar Wagholikar","Alexa T. McCray","Peter Szolovits"],"meta":["December 2017BMC Medical Informatics and Decision Making 17(1):155","DOI:10.1186/s12911-017-0556-8"],"references":["316451238_Medical_Text_Classification_Using_Convolutional_Neural_Networks","313256806_Autism_spectrum_disorder_detection_from_semi-structured_and_unstructured_medical_data","305881120_De-identification_of_Patient_Notes_with_Recurrent_Neural_Networks","319770220_Bag_of_Tricks_for_Efficient_Text_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318741395_Bag_of_Tricks_for_Efficient_Text_Classification","312538118_Support-vector_networks","311990095_Cached_Long_Short-Term_Memory_Neural_Networks_for_Document-Level_Sentiment_Classification","309207617_Cached_Long_Short-Term_Memory_Neural_Networks_for_Document-Level_Sentiment_Classification","308965985_Text_mining_electronic_hospital_records_to_automatically_classify_admissions_against_disease_Measuring_the_impact_of_linking_data_sources"]}