{"id":"321475963_A_Model_Reduction_Technique_in_Space_and_Time_for_Fatigue_Simulation","abstract":"The simulation of mechanical responses of structures subjected to cyclic loadings for a large number of cycles remains a challenge. The goal herein is to develop an innovative computational scheme for fatigue computations involving non-linear mechanical behaviour of materials, described by internal variables. The focus is on the Large Time Increment (LATIN) method coupled with a model reduction technique, the Proper Generalized Decomposition (PGD). Moreover, a multi-time scale approach is proposed for the simulation of fatigue involving large number of cycles. The quantities of interest are calculated only at particular pre-defined cycles called the “nodal cycles” and a suitable interpolation is used to estimate their evolution at the intermediate cycles. The proposed framework is exemplified for a structure subjected to cyclic loading, where damage is considered to be isotropic and micro-defect closure effects are taken into account. The combination of these techniques reduce the numerical cost drastically and allows to create virtual S-N curves for large number of cycles.","authors":["Mainak Bhattacharyya","Amélie Fau","Udo Nackenhorst","David Néron"],"meta":["January 2018","DOI:10.1007/978-3-319-65463-8_10","In book: Multiscale Modeling of Heterogeneous Structures (pp.183-203)","Project: Fatigue damage simulation using LATIN-PGD approach"],"references":["321409959_A_LATIN-based_model_reduction_approach_for_the_simulation_of_cycling_damage","309531909_A_Review_on_Fatigue_Life_Prediction_Methods_for_Metals","321612209_Separated_Representations_and_PGD-Based_Model_Reduction_Fundamentals_and_Applications","313656922_On_multiscale_computational_mechanics_with_time-space_homogenization","313616751_Theory_of_Stress_Concentration_for_Shear_Strained_Prismatical_Bodies_with_Arbitrary_Nonlinear_Stress_Strain_Law","311981321_A_critical_analysis_of_crack_propagation_laws","305279276_A_concept_of_fatigue_damage_Quoted_in_19","305083279_Effects_of_large_hydrostatic_pressure_on_torsional_fatigue_strength_of_an_alloy_steel","301730148_Cumulative_damage_in_fatigue","300040790_PGD_in_linear_and_nonlinear_Computational_Solid_Mechanics"]}