{"id":"321488533_A_Model_for_Processing_Skyline_Queries_in_Crowd-sourced_Databases","abstract":"Nowadays, in most of the modern database applications, lots of critical queries and tasks cannot be completely addressed by machine. Crowd-sourcing database has become a new paradigm for harness human cognitive abilities to process these computer hard tasks. In particular, those problems that are difficult for machines but easier for humans can be solved better than ever, such as entity resolution, fuzzy matching for predicates and joins, and image recognition. Additionally, crowd-sourcing database allows performing database operators on incomplete data as human workers can be involved to provide estimated values during run-time. Skyline queries which received formidable attention by database community in the last decade, and exploited in a variety of applications such as multi-criteria decision making and decision support systems. Various works have been accomplished address the issues of skyline query in crowd-sourcing database. This includes a database with full and partial complete data. However, we argue that processing skyline queries with partial incomplete data in crowd-sourcing database has not received an appropriate attention. Therefore, an efficient approach processing skyline queries with partial incomplete data in crowd-sourcing database is needed. This paper attempts to present an efficient model tackling the issue of processing skyline queries in incomplete crowd-sourcing database. The main idea of the proposed model is exploiting the available data in the database to estimate the missing values. Besides, the model tries to explore the crowd-sourced database in order to provide more accurate results, when local database failed to provide precise values. In order to ensure high quality result could be obtained, certain factors should be considered for worker selection to carry out the task such as workers quality and the monetary cost. Other critical factors should be considered such as time latency to generate the results.","authors":["Marwa B. Swidan","Ali Amer Alwan","Sherzod Turaev","Yonis Gulzar"],"meta":["May 2018Indonesian Journal of Electrical Engineering and Computer Science 10(2):798-806","DOI:10.11591/ijeecs.v10.i2.pp798-806","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["317011909_Skyline_Query_Processing_for_Incomplete_Data_in_Cloud_Environment","311488660_The_Dynamics_of_Micro-Task_Crowdsourcing_The_Case_of_Amazon_MTurk","306048459_A_Framework_for_Evaluating_Skyline_Queries_over_Incomplete_Data","303600096_A_survey_of_machine_learning_for_big_data_processing","296480084_Crowdsourced_Data_Management_A_Survey","294288292_An_Efficient_Approach_for_Processing_Skyline_Queries_in_Incomplete_Multidimensional_Database","281692247_Crowdsourcing_for_Query_Processing_onWeb_Data_A_Case_Study_on_the_Skyline_Operator","274175108_Skyline_Sets_Queries_for_Incomplete_Data","271585164_Efficient_caching_for_constrained_skyline_queries","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries"]}