{"id":"321464979_Implicit_explicit_and_speculative_knowledge","abstract":"We compare different epistemic notions in the presence of awareness of propositional variables: the logic of implicit knowledge (in which explicit knowledge is definable), the logic of explicit knowledge, and the logic of speculative knowledge. Speculative knowledge is a novel epistemic notion that permits reasoning about unawareness. These logics are interpreted on epistemic awareness models: these are multi-agent Kripke structures for propositional awareness (in each state an agent may only be aware of formulas containing occurrences of a subset of all propositional variables). Different notions of bisimulation are suitable for these logics. We provide correspondence between bisimulation and modal equivalence on image-finite models for these logics. Expressivity and axiomatizations are investigated for models without restrictions, and for models with equivalence relations for all agents (modeling knowledge) and awareness introspection (agents know what they are aware of). We show that the logic of speculative knowledge is as expressive as the logic of explicit knowledge, and the logic of implicit knowledge is more expressive than the two other logics. We also present expressivity results for more restricted languages. We then provide and compare axiomatizations for the three logics; the axiomatizations for speculative knowledge are novel. We compare our results to those for awareness achieved in artificial intelligence, computer science, philosophy, and economics.","authors":["Hans van Ditmarsch","Tim French","Fernando R. Velazquez-Quesada","Yì N. Wáng"],"meta":["December 2017Artificial Intelligence 256","DOI:10.1016/j.artint.2017.11.004"],"references":["277888114_Bisimulation_characterization_and_expressivity_hierarchy_of_languages_for_epistemic_awareness_models","271902146_Semantics_for_Knowledge_and_Change_of_Awareness","262235433_Action_models_for_knowledge_and_awareness","332958972_Interactive_Unawareness","314891252_Awareness","312082576_Awareness_of_Unawareness_A_Theory_of_Decision_Making_in_the_Face_of_Ignorance","291768720_A_useful_four-valued_logic","288291831_Bilattice_public_announcement_logic","271921198_A_Logic_for_Reasoning_About_Knowledge_of_Unawareness","266524057_Modal_Logic"]}