{"id":"321523336_Deep_Learning_and_Convolutional_Neural_Networks_for_Medical_Image_Computing_Precision_Medicine_High_Performance_and_Large-Scale_Datasets","abstract":"This timely text/reference presents a detailed review of the state of the art in deep learning approaches for semantic object detection and segmentation in medical image computing, and large-scale radiology database mining. A particular focus is placed on the application of convolutional neural networks, with the theory supported by practical examples.\nTopics and features:\n\n• Highlights how the use of deep neural networks can address new questions and protocols, as well as improve upon existing challenges in medical image computing\n• Discusses the insightful research experience and views of Dr. Ronald M. Summers in medical imaging-based computer-aided diagnosis and its interaction with deep learning\n• Presents a comprehensive review of the latest research and literature on deep learning for medical image analysis\n• Describes a range of different methods that make use of deep learning for object or landmark detection tasks in 2D and 3D medical imaging\n• Examines a varied selection of techniques for semantic segmentation using deep learning principles in medical imaging\n• Introduces a novel approach to interleaved text and image deep mining on a large-scale radiology image database for automated image interpretation\n\nThis pioneering volume will prove invaluable to researchers and graduate students wishing to employ deep neural network models and representations for medical image analysis and medical imaging applications.\nDr. Le Lu is a Staff Scientist in the Radiology and Imaging Sciences Department of the National Institutes of Health Clinical Center, Bethesda, MD, USA. Dr. Yefeng Zheng is a Senior Staff Scientist at Siemens Healthcare Technology Center, Princeton, NJ, USA. Dr. Gustavo Carneiro is an Associate Professor in the School of Computer Science at The University of Adelaide, Australia. Dr. Lin Yang is an Associate Professor in the Department of Biomedical Engineering at the University of Florida, Gainesville, FL, USA.","authors":["Le Lu","Yefeng Zheng","Gustavo Carneiro","Lin Yang"],"meta":["January 2017","DOI:10.1007/978-3-319-42999-1","ISBN: 978-3-319-42998-4"],"references":[]}