{"id":"321500340_LiDAR_Point_Clouds_to_3D_Urban_Models_A_Review","abstract":"Three dimensional urban models are an integral\npart of numerous applications such as urban planning and\nperformance simulation, mapping and visualization, emergency\nresponse training and entertainment, among others. We consolidate\nvarious algorithms proposed for reconstructing 3D models\nof urban objects from point clouds. Urban models addressed\nin this review include buildings, vegetation, utilities such as\nroads or power lines and free-form architectures such as curved\nbuildings or statues, all of which are ubiquitous in a typical\nurban scenario. While urban modeling, building reconstruction\nin particular, clearly demand specific traits in the models such\nas regularity, symmetry and repetition, most of the traditional\nand state-of-the-art 3D reconstruction algorithms are designed\nto address very generic objects of arbitrary shapes and topology.\nThe recent efforts in the urban reconstruction arena, however,\nstrive to accommodate the various pressing needs of urban modeling.\nStrategically, urban modeling research nowadays focuses\non the usage of specialized priors such as global regularity,\nManhattan-geometry or symmetry to aid the reconstruction or\nefficient adaptation of existing reconstruction techniques to the\nurban modeling pipeline. Aimed at an in-depth exploration of\nfurther possibilities, we review the existing urban reconstruction\nalgorithms, prevalent in computer graphics, computer vision and\nphotogrammetry disciplines, evaluate their performance in the\narchitectural modeling context and discuss the adaptability of\ngeneric mesh reconstruction techniques to the urban modeling\npipeline. In the end, we suggest a few directions of research that\nmay be adopted to close in the technology gaps.","authors":["Ruisheng Wang","Jiju Peethambaran","Chen Dong"],"meta":["January 2018IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing PP(99)","DOI:10.1109/JSTARS.2017.2781132","Projects: Detailed Modeling of Urban ScenesOutdoor and Indoor Building Modeling via Point Clouds"],"references":["320173176_Modeling_Indoor_Spaces_Using_Decomposition_and_Reconstruction_of_Structural_Elements","319069047_Topologically_Aware_Building_Rooftop_Reconstruction_From_Airborne_Laser_Scanning_Point_Clouds","314733909_SmartBoxes_for_interactive_urban_reconstruction","313618366_A_survey_of_urban_reconstruction","312549746_Massive-scale_tree_modelling_from_TLS_data","311611435_Large-Scale_Semantic_3D_Reconstruction_An_Adaptive_Multi-resolution_Model_for_Multi-class_Volumetric_Labeling","319770318_Surface_reconstruction_by_Voronoi_filtering","317556828_A_Fast_Edge_Extraction_Method_for_Mobile_Lidar_Point_Clouds","314246241_Enhancing_Urban_Facades_via_LiDAR_based_Sculpting","312535356_Reconstructing_power_cables_from_LIDAR_data_using_Eigenvector_streamlines_of_the_point_distribution_tensor_field"]}