{"id":"321544057_Multiple_Criteria_Decision_Analysis_State_of_the_Art_Surveys","abstract":"In two volumes, this new edition presents the state of the art in Multiple Criteria Decision Analysis (MCDA). Reflecting the explosive growth in the field seen during the last several years, the editors not only present surveys of the foundations of MCDA, but look as well at many new areas and new applications. Individual chapter authors are among the most prestigious names in MCDA research, and combined their chapters bring the field completely up to date.\nPart I of the book considers the history and current state of MCDA, with surveys that cover the early history of MCDA and an overview that discusses the “pre-theoretical” assumptions of MCDA. Part II then presents the foundations of MCDA, with individual chapters that provide a very exhaustive review of preference modeling, along with a chapter devoted to the axiomatic basis of the different models that multiple criteria preferences. Part III looks at outranking methods, with three chapters that consider the ELECTRE methods, PROMETHEE methods, and a look at the rich literature of other outranking methods.\nPart IV, on Multiattribute Utility and Value Theories (MAUT), presents chapters on the fundamentals of this approach, the very well known UTA methods, the Analytic Hierarchy Process (AHP) and its more recent extension, the Analytic Network Process (ANP), as well as a chapter on MACBETH (Measuring Attractiveness by a Categorical Based Evaluation Technique). Part V looks at Non-Classical MCDA Approaches, with chapters on risk and uncertainty in MCDA, the decision rule approach to MCDA, the fuzzy integral approach, the verbal decision methods, and a tentative assessment of the role of fuzzy sets in decision analysis.\nPart VI, on Multiobjective Optimization, contains chapters on recent developments of vector\nand set optimization, the state of the art in continuous multiobjective programming, multiobjective combinatorial optimization, fuzzy multicriteria optimization, a review of the field of goal programming, interactive methods for solving multiobjective optimization problems, and relationships between MCDA and evolutionary multiobjective optimization (EMO). Part VII, on Applications, selects some of the most significant areas, including contributions of MCDA in finance, energy planning problems, telecommunication network planning and design, sustainable development, and portfolio analysis. Finally, Part VIII, on MCDM software, presents well known MCDA software packages.","authors":["Salvatore Greco","Matthias Ehrgott","José Rui Figueira"],"meta":["January 2016","DOI:10.1007/978-1-4939-3094-4","ISBN: 978-1-4939-3093-7"],"references":[]}