{"id":"321568065_Geometric_Problems_on_Maxima_and_Minima","abstract":"Questions of maxima and minima have great practical significance, with applications to physics, engineering, and economics; they have also given rise to theoretical advances, notably in calculus and optimization. Indeed, while most texts view the study of extrema within the context of calculus, this carefully constructed problem book takes a uniquely intuitive approach to the subject: it presents hundreds of extreme-value problems, examples, and solutions primarily through Euclidean geometry.\n\nKey features and topics:\n* Comprehensive selection of problems, including Greek geometry and optics, Newtonian mechanics, isoperimetric problems, and recently solved problems such as Malfatti’s problem\n* Unified approach to the subject, with emphasis on geometric, algebraic, analytic, and combinatorial reasoning\n* Presentation and application of classical inequalities, including Cauchy--Schwarz and Minkowski’s Inequality; basic results in calculus, such as the Intermediate Value Theorem; and emphasis on simple but useful geometric concepts, including transformations, convexity, and symmetry\n* Clear solutions to the problems, often accompanied by figures\n* Hundreds of exercises of varying difficulty, from straightforward to Olympiad-caliber\n\nWritten by a team of established mathematicians and professors, this work draws on the authors’ experience in the classroom and as Olympiad coaches. By exposing readers to a wealth of creative problem-solving approaches, the text communicates not only geometry but also algebra, calculus, and topology. Ideal for use at the junior and senior undergraduate level, as well as in enrichment programs and Olympiad training for advanced high school students, this book’s breadth and depth will appeal to a wide audience, from secondary school teachers and pupils to graduate students, professional mathematicians, and puzzle enthusiasts.","authors":["Titu Andreescu","Oleg Mushkarov","Luchezar Stoyanov"],"meta":["January 2006","DOI:10.1007/0-8176-4473-3","ISBN: 978-0-8176-3517-6"],"references":[]}