{"id":"321549734_Digitale_Produktion","abstract":"Die digitale Produktion stellt eine ganzheitliche Produktionsfunktion dar. Sie berücksichtigt die Triade Mensch, Organisation und Technik und setzt innovative Informationstechnologien ein. Das Buch behandelt die Einordnung, den Aufbau, die Vernetzung sowie die Optimierung produkt- und produktionsbezogener Prozesse in Industrieunternehmen mit besonderer Berücksichtigung der unterstützenden Informationstechnologien. Dabei bilden die Gestaltungs- und Planungsprozesse von Produkten, technischen Prozessen und Anlagen den Schwerpunkt.\nUntersucht wird neben der Produktionsfunktion in Wechselwirkung mit vor- und nachgelagerten Unternehmensfunktionen die Steigerung der Effizienz in der Produktion bei optimaler Unterstützung durch moderne IT-Systeme.\nDie Autoren stellen Ergebnisse vor, die im Rahmen des Innovationsclusters „Digitale Produktion“ erarbeitet wurden. Sie liefern fundierte Methoden, Systembeschreibungen und Anwendungsbeispiele. \nDer Inhalt\nEinführung und Standortbestimmung „Produktion in Deutschland“.- Globale Wettbewerbsfähigkeit und der Produktionsbereich.- Grundlagen der digitalen Produktion: Definition und Entwicklung.- Lebenszyklusorientiertes Engineering und Management von Produkten und Fabriken.- Nutzung neuer Informationstechnologien für die digitale Produktion.- Zukunftsperspektiven und Zusammenfassung.\n\nDie Zielgruppen\nManagement von industriellen Unternehmen · Konstruktions- und Produktionsleiter · IT-Management · Unternehmen der verarbeitenden Industrie · Softwarehäuser und Unternehmen der IT-Industrie · Forschungs- und Entwicklungsbereiche in der Konstruktions- und Produktionstechnik · Studierende an Universitäten und Hochschulen des Maschinenbaus und der angewandten Informatik\nDie Herausgeber\nEngelbert Westkämper\nDieter Spath\nCarmen Constantinescu\nJoachim Lentes","authors":["Engelbert Westkämper","Dieter Spath","Carmen Constantinescu","Joachim Lentes"],"meta":["January 2013","DOI:10.1007/978-3-642-20259-9","ISBN: 978-3-642-20258-2"],"references":[]}