{"id":"321535074_LP-LPA_A_link_influence-based_label_propagation_algorithm_for_discovering_community_structures_in_networks","abstract":"Community detection is an essential approach for analyzing the structural and functional properties of complex networks. Although many community detection algorithms have been recently presented, most of them are weak and limited in different ways. Label Propagation Algorithm (LPA) is a well-known and efficient community detection technique which is characterized by the merits of nearly-linear running time and easy implementation. However, LPA has some significant problems such as instability, randomness, and monster community detection. In this paper, an algorithm, namely node’s label influence policy for label propagation algorithm (LP-LPA) was proposed for detecting efficient community structures. LP-LPA measures link strength value for edges and nodes’ label influence value for nodes in a new label propagation strategy with preference on link strength and for initial nodes selection, avoid of random behavior in tiebreak states, and efficient updating order and rule update. These procedures can sort out the randomness issue in an original LPA and stabilize the discovered communities in all runs of the same network. Experiments on synthetic networks and a wide range of real-world social networks indicated that the proposed method achieves significant accuracy and high stability. Indeed, it can obviously solve monster community problem with regard to detecting communities in networks.","authors":["Kamal Berahmand","Asgarali Bouyer"],"meta":["December 2017International Journal of Modern Physics B 32(06):1850062","DOI:10.1142/S0217979218500625","Project: Networks analysis_ complexity"],"references":["312483836_GA-LP_A_genetic_algorithm_based_on_Label_Propagation_to_detect_communities_in_directed_networks","303086678_Detecting_Community_Structure_by_Using_a_Constrained_Label_Propagation_Algorithm","295395520_Community_detection_in_social_networks","317077051_An_improved_label_propagation_algorithm_based_on_node_importance_and_random_walk_for_community_detection","308732464_Parallel_overlapping_community_discovery_based_on_grey_relational_analysis","305780197_Community_detection_in_networks_A_user_guide","302919201_An_improved_label_propagation_algorithm_using_average_node_energy_in_complex_networks","280939909_Graph_Clustering","277950040_CenLP_A_centrality-based_label_propagation_algorithm_for_community_detection_in_networks","274407883_Label_propagation_algorithm_based_on_local_cycles_for_community_detection"]}