{"id":"321574776_Harmonic_Networks_Deep_Translation_and_Rotation_Equivariance","abstract":"Translating or rotating an input image should not affect the results of many computer vision tasks. Convolutional neural networks (CNNs) are already translation equivariant: input image translations produce proportionate feature map translations. This is not the case for rotations. Global rotation equivariance is typically sought through data augmentation, but patch-wise equivariance is more difficult. We present Harmonic Networks or H-Nets, a CNN exhibiting equivariance to patch-wise translation and 360-rotation. We achieve this by replacing regular CNN filters with circular harmonics, returning a maximal response and orientation for every receptive field patch. H-Nets use a rich, parameter-efficient and low computational complexity representation, and we show that deep feature maps within the network encode complicated rotational invariants. We demonstrate that our layers are general enough to be used in conjunction with the latest architectures and techniques, such as deep supervision and batch normalization. We also achieve state-of-the-art classification on rotated-MNIST, and competitive results on other benchmark challenges.","authors":["Daniel Worrall","Stephan J. Garbin","Daniyar Turmukhambetov","Jourdan Gabriel"],"meta":["July 2017","DOI:10.1109/CVPR.2017.758","Conference: IEEE Conference on Computer Vision and Pattern Recognition (CVPR)"],"references":["308820325_DeepContour_A_Deep_Convolutional_Feature_Learned_by_Positive-sharing_Loss_for_Contour_Detection","319770360_Deeply-Supervised_Nets","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318439989_Pushing_the_Boundaries_of_Boundary_Detection_using_Deep_Learning","318263567_Learning_rotation_invariant_convolutional_filters_for_texture_classification","311926206_Steerable_CNNs","311610088_Structured_Receptive_Fields_in_CNNs","310752533_Visualizing_and_understanding_convolutional_networks","308846657_Understanding_image_representations_by_measuring_their_equivariance_and_equivalence","308845205_DeepEdge_A_multi-scale_bifurcated_deep_network_for_top-down_contour_detection"]}