{"id":"321511311_Image_to_Image_Translation_for_Domain_Adaptation","abstract":"We propose a general framework for unsupervised domain adaptation, which allows deep neural networks trained on a source domain to be tested on a different target domain without requiring any training annotations in the target domain. This is achieved by adding extra networks and losses that help regularize the features extracted by the backbone encoder network. To this end we propose the novel use of the recently proposed unpaired image-toimage translation framework to constrain the features extracted by the encoder network. Specifically, we require that the features extracted are able to reconstruct the images in both domains. In addition we require that the distribution of features extracted from images in the two domains are indistinguishable. Many recent works can be seen as specific cases of our general framework. We apply our method for domain adaptation between MNIST, USPS, and SVHN datasets, and Amazon, Webcam and DSLR Office datasets in classification tasks, and also between GTA5 and Cityscapes datasets for a segmentation task. We demonstrate state of the art performance on each of these datasets.","authors":["Zak Murez","Soheil Kolouri","David Kriegman","Ravi Ramamoorthi"],"meta":["December 2017"],"references":["322060135_Unpaired_Image-to-Image_Translation_Using_Cycle-Consistent_Adversarial_Networks","319770123_Densely_Connected_Convolutional_Networks","319284613_The_One_Hundred_Layers_Tiramisu_Fully_Convolutional_DenseNets_for_Semantic_Segmentation","315710637_Unpaired_Image-to-Image_Translation_using_Cycle-Consistent_Adversarial_Networks","311610734_The_SYNTHIA_Dataset_A_Large_Collection_of_Synthetic_Images_for_Semantic_Segmentation_of_Urban_Scenes","320971009_Adversarial_Discriminative_Domain_Adaptation","319770355_Generative_Adversarial_Nets","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770011_Virtual_Worlds_as_Proxy_for_Multi-Object_Tracking_Analysis","315765101_Improved_Training_of_Wasserstein_GANs"]}