{"id":"321505207_Advancing_inclusive_science_and_systemic_change_The_convergence_of_national_aims_and_institutional_goals_in_implementing_and_assessing_biomedical_science_training","abstract":"Background and purpose\nNational reports call for improving America’s leadership in scientific research, accelerating degree attainments, and diversifying the scientific workforce to foster innovation. However, slow progress and persistent disparities across growing U.S. populations are evident on key science workforce indicators, from degree attainment to career achievements. The purpose of this article is to provide a conceptual basis and overview of a national effort funded by the National Institutes of Health (NIH) that advances inclusive science practice and systemic change. We introduce the context, features, and rationale that drive practice and evaluation in the Diversity Program Consortium (DPC) approach, which is an experimental program to implement and evaluate evidence-based and novel practices to expand and diversify the biomedical workforce.\n\nKey highlights\nDespite decades of federal investment for biomedical research training, researchers identified disparate adjusted rates of R01 grant awards by scientists’ race/ethnicity. This motivated NIH to fund the DPC approach as a set of highly integrated initiatives that empower institutional change agents to create scalable, evidenced-based strategies to enhance diversity in biomedical research and health science training. Key DPC elements include: 1) A systemic approach to enhance science preparedness involving students, faculty, and institutional-capacity development; 2) Collaboration, partnerships and networks across individuals and organizations, and especially between NIH, 10 undergraduate Building Infrastructure Leading to Diversity (BUILD) sites, the National Research Mentoring Network (NRMN), and the Coordination and Evaluation Center (CEC); and 3) Increased focus within and across key career stages for expanding training and ultimately diversifying the scientific workforce. A new framework for inclusive science practices and discussion of systemic change challenges provide insights into DPC processes and activities.\n\nImplications\nCollectively, the DPC establishes a national learning collaborative to implement and evaluate multidimensional components of training and program interventions, accelerate the adoption of promising or effective practices, and disseminate lessons to the broader extramural scientific community. Linking practice with evaluation research will identify exemplars that others may adopt to advance the goals of inclusive science in promoting and sustaining innovation, accelerating equity in science careers and, ultimately, address challenging health problems in an increasingly diverse nation.","authors":["Sylvia Hurtado","Damani White-Lewis","Keith C Norris"],"meta":["December 2017BMC Proceedings 11(S12)","DOI:10.1186/s12919-017-0086-5"],"references":["321512669_Enhancing_research_careers_An_example_of_a_US_national_diversity-focused_grant-writing_training_and_coaching_experiment","321510390_A_new_approach_to_mentoring_for_research_careers_The_National_Research_Mentoring_Network","321508472_Evaluating_efforts_to_diversify_the_biomedical_workforce_The_role_and_function_of_the_Coordination_and_Evaluation_Center_of_the_Diversity_Program_Consortium","321504927_Critical_race_theory_as_a_bridge_in_science_training_The_California_State_University_Northridge_BUILD_PODER_program","303434768_Affirming_independence_Exploring_mechanisms_underlying_a_values_affirmation_intervention_for_first-generation_students","303087074_Affirming_Independence_Exploring_Mechanisms_Underlying_a_Values_Affirmation_Intervention_for_First-Generation_Students","345700687_Improving_How_Universities_Teach_Science_Lessons_from_the_Science_Education_Initiative","312449644_Projections_of_the_Size_and_Composition_of_the_US_Population_2014_to_2060_Current_Population_Reports","308380202_From_the_NIH_A_Systems_Approach_to_Increasing_the_Diversity_of_the_Biomedical_Research_Workforce","293236434_Measuring_the_state_of_equity_in_public_higher_education"]}