{"id":"321513584_A_Survey_on_5G_Networks_for_the_Internet_of_Things_Communication_Technologies_and_Challenges","abstract":"The Internet of Things (IoT) is a promising technology which tends to revolutionize and connect the global world via heterogeneous smart devices through seamless connectivity. The current demand for Machine-Type Communications (MTC) has resulted in a variety of communication technologies with diverse service requirements to achieve the modern IoT vision. More recent cellular standards like Long-Term Evolution (LTE) have been introduced for mobile devices but are not well suited for low-power and low data rate devices such as the IoT devices. To address this, there is a number of emerging IoT standards. Fifth Generation (5G) mobile network, in particular, aims to address the limitations of previous cellular standards and be a potential key enabler for future IoT. In this paper, the state-of-the-art of the IoT application requirements along with their associated communication technologies are surveyed. Additionally, the 3rd Generation Partnership Project (3GPP) cellular-based Low-Power Wide Area (LPWA) solutions to support and enable the new service requirements for Massive to Critical IoT use cases are discussed in detail, including Extended Coverage Global System for Mobile Communications for the Internet of Things (EC-GSM-IoT), enhanced Machine-Type Communications (eMTC), and Narrowband-Internet of Things (NB-IoT). Furthermore, 5G New Radio (NR) enhancements for new service requirements and enabling technologies for the IoT are introduced. This paper presents a comprehensive review related to emerging and enabling technologies with main focus on 5G mobile networks that is envisaged to support the exponential traffic growth for enabling the IoT. The challenges and open research directions pertinent to the deployment of Massive to Critical IoT applications are also presented in coming up with an efficient context-aware congestion control (CACC) mechanism.","authors":["Godfrey Akpakwu","Bruno Silva","Gerhard P. Hancke","Adnan M. Abu-Mahfouz"],"meta":["December 2017IEEE Access 5(12):3619 - 3647","DOI:10.1109/ACCESS.2017.2779844","Project: Smart Networks"],"references":["316730673_Software_Defined_Networking_for_Improved_Wireless_Sensor_Network_Management_A_Survey","315045187_A_Survey_on_Software-Defined_Wireless_Sensor_Networks_Challenges_and_Design_Requirements","314365156_Bridge_monitoring_using_wireless_smart_sensors","313389010_The_challenges_of_M2M_massive_access_in_wireless_cellular_networks","312560251_A_key_distribution_scheme_using_elliptic_curve_cryptography_in_wireless_sensor_networks","329631979_Blockchain_and_Internet_of_Things_Opportunities_and_Challenges","314298104_Software_defined_wireless_sensor_networks_application_opportunities_for_efficient_network_management_A_survey","313761517_Autonomous_control_and_the_internet_of_things_Increasing_robustness_scalability_and_agility_in_logistic_networks","313387969_Technologies_for_5G_Networks_Challenges_and_Opportunities","313354264_Technologies_and_challenges_in_developing_Machine-to-Machine_applications_A_survey"]}