{"id":"321512926_The_Case_for_Learned_Index_Structures","abstract":"Indexes are models: a B-Tree-Index can be seen as a model to map a key to the position of a record within a sorted array, a Hash-Index as a model to map a key to a position of a record within an unsorted array, and a BitMap-Index as a model to indicate if a data record exists or not. In this exploratory research paper, we start from this premise and posit that all existing index structures can be replaced with other types of models, including deep-learning models, which we term learned indexes. The key idea is that a model can learn the sort order or structure of lookup keys and use this signal to effectively predict the position or existence of records. We theoretically analyze under which conditions learned indexes outperform traditional index structures and describe the main challenges in designing learned index structures. Our initial results show, that by using neural nets we are able to outperform cache-optimized B-Trees by up to 70% in speed while saving an order-of-magnitude in memory over several real-world data sets. More importantly though, we believe that the idea of replacing core components of a data management system through learned models has far reaching implications for future systems designs and that this work just provides a glimpse of what might be possible.","authors":["Tim Kraska","Alex Beutel","Ed H. Chi","Jeffrey Dean"],"meta":["December 2017"],"references":["322851489_A-Tree_A_Bounded_Approximate_Index_Structure","319952837_Deep_Lattice_Networks_and_Partial_Monotonic_Functions","310624366_Hash_function_generation_by_neural_network","322949811_A_Model_for_Learned_Bloom_Filters_and_Related_Structures","320285738_MACHINE_LEARNING_APPROACH_IN_THE_PHISHING_ATTACK_DETECTION_PROBLEM","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770355_Generative_Adversarial_Nets","319769909_Distilling_the_Knowledge_in_a_Neural_Network","312875953_Two_birds_one_stone_a_fast_yet_lightweight_indexing_scheme_for_modern_database_systems","312619873_Outrageously_Large_Neural_Networks_The_Sparsely-Gated_Mixture-of-Experts_Layer"]}