{"id":"321531388_Didaktik_der_Bruchrechnung","abstract":"Die Bruchrechnung in Form der Brüche und Dezimalbrüche gilt allgemein als schwieriges und herausforderndes Gebiet. Das zentrale Ziel dieser stark überarbeiteten 5. Auflage ist es daher, die Bruchrechnung als faszinierendes und wichtiges Gebiet des Mathematikunterrichts darzustellen, das dennoch für alle Lernenden verständlich bleiben kann. Folglich stehen in diesem seit Jahrzehnten bewährten Standardwerk die zentralen Grundvorstellungen im Mittelpunkt, und es werden zahlreiche konstruktive Vorschläge gemacht, wie die Lernenden die Bruchzahlen und das Rechnen mit ihnen prozessorientiert lernen können. Hierbei wird zur Illustrierung auch auf viele überzeugende Beispiele aus neuesten Schulbüchern zurückgegriffen – in dieser Auflage erstmalig in Farbe. Die Zielgruppen sind Studierende für das Lehramt der Primarstufe und der Sekundarstufen, Lehramtsanwärterinnen und Lehramtsanwärter mit dem Fach Mathematik sowie praktizierende Lehrerinnen und Lehrer.\n\nDer Inhalt\nZahlen, Operationen und Strategien „verstehen“ – Ist die Bruchrechnung heute noch nötig? – Einführung von Brüchen – Erweitern/Kürzen – Größenvergleich von Brüchen – Addition/Subtraktion von Brüchen – Multiplikation/Division von Brüchen – Brüche und natürliche Zahlen – Prozessorientierter Zugang zu den Dezimalbrüchen – Veranschaulichungen zu Dezimalbrüchen – Erweiterung des Stellenwertsystems – Darstellen, Lesen und Schreiben von Dezimalbrüchen – Erweitern/Kürzen bei Dezimalbrüchen – Größenvergleich und Anordnung bei Dezimalbrüchen – Zusammenhang zwischen Brüchen und Dezimalbrüchen – Addition/Subtraktion von Dezimalbrüchen – Multiplikation/Division von Dezimalbrüchen – Runden, Überschlagen und Schätzen.\n\nDie Autoren\nProf. Dr. Friedhelm Padberg, Fakultät für Mathematik, Universität Bielefeld\nProf. Dr. Sebastian Wartha, Institut für Mathematik und Informatik, Pädagogische Hochschule Karlsruhe","authors":["Friedhelm Padberg","Sebastian Wartha"],"meta":["January 2017","DOI:10.1007/978-3-662-52969-0","ISBN: 978-3-662-52968-3"],"references":[]}