{"id":"321587376_A_Survey_on_the_Cryptographic_Encryption_Algorithms","abstract":"Security is the major concern when the sensitive\ninformation is stored and transferred across the internet where the information is no longer protected by physical boundaries. Cryptography is an essential, effective and efficient component to ensure the secure communication between the different entities by transferring unintelligible information and only the authorized recipient can be able to access the information. The right selection of cryptographic algorithm is important for secure communication that provides more security, accuracy and efficiency. In this paper, we examine the security aspects and processes involved in the design and implementation of most widely used symmetric encryption algorithms such as Data Encryption Standard (DES), Triple Data Encryption Standard (3DES), Blowfish, Advanced Encryption Standard (AES) and Hybrid Cubes Encryption Algorithm (HiSea). Furthermore, this paper evaluated and compared the performance of these encryption algorithms based on encryption and decryption time, throughput, key size, avalanche effect, memory, correlation assessment and entropy. Thus, amongst the existing cryptographic algorithm, we choose a suitable encryption algorithm based on different parameters that are best fit to the user requirements.","authors":["Muhammad Faheem Mushtaq","Sapiee Jamel","Abdulkadir Hassan Disina","Zahraddeen Abubakar Pindar"],"meta":["November 2017International Journal of Advanced Computer Science and Applications 8(11):333-344","DOI:10.14569/IJACSA.2017.081141"],"references":["321075188_Key_Generation_Technique_based_on_Triangular_Coordinate_Extraction_for_Hybrid_Cubes","320802850_Cloud_Computing_Environment_and_Security_Challenges_A_Review","318506702_Triangular_Coordinate_Extraction_TCE_for_hybrid_cubes","318200344_Cryptography_A_Comparative_Analysis_for_Modern_Techniques","307940772_Evaluation_of_cryptographic_primitives_security_based_on_proximity_to_the_Latin_square","301234351_A_Comprehensive_Evaluation_of_Cryptographic_Algorithms_DES_3DES_AES_RSA_and_Blowfish","315862882_All-or-Nothing_Key_Derivation_Function_Based_on_Quasigroup_String_Transformation","303954371_Performance_Evaluation_of_EncryptionDecryption_Mechanisms_to_Enhance_Data_Security","288352911_Description_of_a_new_variable-length_key_64-bit_block_cipher_blowfish","285510304_Blowfish_encryption_algorithm_for_information_security"]}