{"id":"321580532_Chemistry_and_three-dimensional_morphology_of_martensite-austenite_constituent_in_the_bainite_structure_of_low-carbon_low-alloy_steels","abstract":"The martensite-austenite constituent (MA) originates from carbon-enriched and untransformed austenite surrounded by bainite and is known to deteriorate the toughness of bainitic steel. The relationship between MA and bainite formation in low-carbon low-alloy steel was investigated with respect to the effects of cooling rate and Nb addition, as well as the relationship between the MA distribution and surrounding bainite. Nb addition enhanced the formation of MA over a wider range of cooling rates, and the fraction of MA became maximum at a cooling rate of 5 K/s. A microstructure consisting of carbide-free coarse bainite with few high angle boundaries is formed near the prior austenite grain boundary, and fine bainite with a high density of carbide and high angle boundaries is formed within the austenite grains. MA tends to be located in the coarse bainite region. Three-dimensional observations of the bainite and MA indicated MA is elongated along bainitic ferrites with the same growth direction or the same habit plane, while MA is blocky when the surrounding bainitic ferrites have different growth directions. Thus, the shape of MA is strongly affected by the crystallography of the surrounding bainite structure. The carbon content in austenite revealed that the carbon content of MA is close to the T0 composition at the transformation temperature, which suggests that MA formation is caused by a reduction of the driving force for transformation by carbon enrichment, which results in incomplete bainite transformation. Nb addition further inhibits the decomposition of austenite and promotes MA formation.","authors":["N. Takayama","Goro Miyamoto","Tadashi Furuhara"],"meta":["December 2017Acta Materialia 145","DOI:10.1016/j.actamat.2017.11.036"],"references":["316618944_TOWARDS_IMPROVED_SUBMERGED_ARC_WELD_METAL_-_2","316537992_Influence_of_Martensite-Austenite_Constituent_on_Toughness_of_Heat-Affected_Zone_of_High-Strength_Weldable_Structural_Steels","316076963_Crystallography_and_Interphase_Boundary_of_Martensite_and_Bainite_in_Steels","271491346_Study_on_Micro-crack_Initiation_Properties_in_Steel_HAZ_having_Microscopical_Heterogeneity_in_Strength_Report_1_Influence_of_Martensitic_Islands_on_Fracture_Behaviour_of_Multipass_Weld_HAZ","267340430_Characterization_of_Transformation_Stasis_in_Low-Carbon_Steels_Microalloyed_with_B_and_Mo","233709685_Incomplete_transformation_of_upper_bainite_in_Nb_bearing_low_carbon_steels"]}