{"id":"321621429_Human-Centered_Software_Engineering_-_Integrating_Usability_in_the_Software_Development_Lifecycle","abstract":"Human-CenteredSoftwareEngineering: BridgingHCI,UsabilityandSoftwareEngineering From its beginning in the 1980’s, the ?eld of human-computer interaction (HCI) has beende?nedasamultidisciplinaryarena. BythisImeanthattherehas beenanexplicit recognition that distinct skills and perspectives are required to make the whole effort of designing usable computer systems work well. Thus people with backgrounds in Computer Science (CS) and Software Engineering (SE) joined with people with ba- grounds in various behavioral science disciplines (e. g. , cognitive and social psych- ogy, anthropology)inaneffortwhereallperspectiveswereseenasessentialtocreating usable systems. But while the ?eld of HCI brings individuals with many background disciplines together to discuss a common goal - the development of useful, usable, satisfying systems - the form of the collaboration remains unclear. Are we striving to coordinate the varied activities in system development, or are we seeking a richer collaborative framework? In coordination, Usability and SE skills can remain quite distinct and while the activities of each group might be critical to the success of a project, we need only insure that critical results are provided at appropriate points in the development cycle. Communication by one group to the other during an activity might be seen as only minimally necessary. In collaboration, there is a sense that each group can learn something about its own methods and processes through a close pa- nership with the other. Communication during the process of gathering information from target users of a system by usability professionals would not be seen as so- thing that gets in the way of the essential work of software engineering professionals.","authors":["Ahmed Seffah","Jan Gulliksen","Michel Desmarais"],"meta":["January 2005","DOI:10.1007/1-4020-4113-6","ISBN: 978-1-4020-4027-6"],"references":[]}