{"id":"321627213_Against_a_pedagogical_colonisation_The_case_of_the_School_of_Architecture_at_the_University_of_Costa_Rica","abstract":"In an article written in 1983, in which he reflected on the Architectural Association’s experience in the Kumasi School of Architecture, John-Michel Lloyd described the attempts of teaching European Architectural Histories and Theories in non-Western countries as almost tragicomic: the Ghana context was amazingly distant from the European architectural culture, still, European ways of knowledge transfer persisted. The Kumasi case was not isolated, European ways of teaching architecture were used in Africa, Asia, and Latin America, despite the regions different colonial backgrounds. In the case of Latin America, schools often emulated the Beaux Art model. Created in 1970, by three Costa Rican architects, the pedagogical system of the School of Architecture of the University of Costa Rica proposed an absolute rupture with European methods of teaching architecture. In their dissertation, presented at the Department of Tropical Studies of the AA, Felo García, Jorge Bertheau and Edgar Brenes—the three Costa Rican architects—regarded education as an inherited mechanism that served to preserve old knowledge structures. This paper explores the School’s pedagogical system main propositions regarding education and its links to the Department of Tropical Studies, where it was partially created, and to John-Michael Lloyd himself. Research suggests that for its creators, implementing their experimental teaching system served as a way to liberate architectural education from what can be referred to as “pedagogical colonisation”: the continuous use of foreign methods that inevitably reinforced an unbalanced relationship between Western metropolis and developing countries in terms of access to architectural knowledge. Discourse is constructed around archived documents and interviews with main actors.","authors":["Natalia Solano-Meza"],"meta":["January 2017","Conference: AIARG conferenceAt: Waterford, Ireland","Project: Thought, rupture, practice. The School of Architecture of the University of Costa Rica, 1962-1974"],"references":[]}