{"id":"321694645_Detecting_Imminent_Lane_Change_Maneuvers_in_Connected_Vehicle_Environments","abstract":"Lane changing is a complex decision-making process that is affected by factors such as vehicle features, driver characteristics, network attributes, and traffic conditions. Understanding the changes in driver behavior and vehicle trajectory before the lane change initiation process is essential to the design of a safe and reliable crash avoidance system. The recently introduced connected vehicle (CV) technology provides opportunities for real-time, high-resolution data exchange capability between vehicles. This study explored the high-resolution vehicle trajectory data attainable in CV environments for detecting the onset of lane change maneuvers. The observed change in behavior before the initiation of such a maneuver was examined to identify the associated driving pattern. This pattern was used to develop two lane change detection models: an artificial neural network (ANN) model and a multiple logistic regression (MLR) model. The two models were trained and tested with Next Generation Simulation data collected from a weaving freeway segment in Arlington, Virginia. The results show 80% detection accuracy for the ANN model, compared with 72% for the MLR model. The developed models identified the vehicle speed, acceleration, and speed relative to the lead vehicle as the most significant attributes for lane change detection. Drivers’ intentions could be detected early and potential crashes could be prevented by training these models to capture similar driving behavior patterns.","authors":["Peter R. Bakhit","Osama A. Osman","Sherif Ishak"],"meta":["January 2017Transportation Research Record Journal of the Transportation Research Board 2645(1):168-175","DOI:10.3141/2645-18","Project: Connected Vehicle Applications"],"references":["267625987_Near-Crash_Identification_in_a_Connected_Vehicle_Environment","244955518_A_Driver_Behavior_Recognition_Method_Based_on_a_Driver_Model_Framework","224244850_Lane_Change_Intent_Prediction_for_Driver_Assistance_On-Road_Design_and_Evaluation","223735487_Integrated_driving_behavior_modeling","223457818_Lane_change_manoeuvres_and_safety_margins","3737831_Towards_real-time_recognition_of_driver_intentions","258263215_CORSIM-corridor_traffic_simulation_model","255669431_Pattern_Recognition_Techniques_to_Infer_Driver_Intentions","245222350_A_neural_network_for_image-based_vehicle_detection","235737436_Locally_Weighted_Regression_An_Approach_to_Regression_Analysis_by_Local_Fitting","222035477_A_Review_of_Neural_Networks_Applied_to_Transport","35267602_Modeling_Drivers'_Acceleration_and_Lane_Changing_Behavior","23527133_A_model_for_the_structure_of_lane-changing_decision","3428045_Lane_Change_Intent_Analysis_Using_Robust_Operators_and_Sparse_Bayesian_Learning","3154779_Strategies_and_spacing_requirements_for_lane_changing_and_merging_in_automated_highway_systems","2593769_Development_of_Performance_Specifications_for_Collision_Avoidance_Systems_for_Lane_Change_Merging_and_Backing_Task_2_Interim_Report_Functional_Goals_Establishment"]}