{"id":"321660724_Systems_Biology_Graphical_Notation_Activity_Flow_language_Level_1_Version_12","abstract":"The Systems Biological Graphical Notation (SBGN) is an international community effort for standardized graphical representations of biological pathways and networks. The goal of SBGN is to provide unambiguous pathway and network maps for readers with different scientific backgrounds as well as to support efficient and accurate exchange of biological knowledge between different research communities, industry, and other players in systems biology. Three SBGN languages, Process Description (PD), Entity Relationship (ER) and Activity Flow (AF), allow for the representation of different aspects of biological and biochemical systems at different levels of detail.\nThe SBGN Activity Flow language represents the influences of activities among various entities within a network. Unlike SBGN PD and ER that focus on the entities and their relationships with others, SBGN AF puts the emphasis on the functions (or activities) performed by the entities, and their effects to the functions of the same or other entities. The nodes (elements) describe the biological activities of the entities, such as protein kinase activity, binding activity or receptor activity, which can be easily mapped to Gene Ontology molecular function terms. The edges (connections) provide descriptions of relationships (or influences) between the activities, e.g., positive influence and negative influence. Among all three languages of SBGN, AF is the closest to signaling pathways in biological literature and textbooks, but its well-defined semantics offer a superior precision in expressing biological knowledge.","authors":["Huaiyu Mi","Falk Schreiber","Stuart Leslie Moodie","Tobias Czauderna"],"meta":["June 2015Journal of Integrative Bioinformatics 12(2)","DOI:10.1515/jib-2015-265","Project: Systems Biology Graphical Notation"],"references":["26729781_The_Systems_Biology_Graphical_Notation","291154775_Erratum_TGF-b_signaling_in_tumor_suppression_and_cancer_progression_Nature_Genetics_2001_29_117-129","220695896_Graph_Drawing_Algorithms_for_the_Visualization_of_Graphs","24256562_A_Mutant-p53Smad_Complex_Opposes_p63_to_Empower_TGF_beta-Induced_Metastasis","13984399_TGF-beta_signal_transduction_and_Smad"]}