{"id":"321637603_Programmable_self-assembly_of_three-dimensional_nanostructures_from_10000_unique_components","abstract":"Nucleic acids (DNA and RNA) are widely used to construct nanometre-scale structures with ever increasing complexity1,2,3,4,5,6,7,8,9,10,11,12,13,14, with possible application in fields such as structural biology, biophysics, synthetic biology and photonics. The nanostructures are formed through one-pot self-assembly, with early kilodalton-scale examples containing typically tens of unique DNA strands. The introduction of DNA origami4, which uses many staple strands to fold one long scaffold strand into a desired structure, has provided access to megadalton-scale nanostructures that contain hundreds of unique DNA strands6,7,10,11,12,13,14. Even larger DNA origami structures are possible15,16, but manufacturing and manipulating an increasingly long scaffold strand remains a challenge. An alternative and more readily scalable approach involves the assembly of DNA bricks, which each consist of four short binding domains arranged so that the bricks can interlock8,9. This approach does not require a scaffold; instead, the short DNA brick strands self-assemble according to specific inter-brick interactions. First-generation bricks used to create three-dimensional structures are 32 nucleotides long, consisting of four eight-nucleotide binding domains. Protocols have been designed to direct the assembly of hundreds of distinct bricks into well formed structures, but attempts to create larger structures have encountered practical challenges and had limited success9. Here we show that DNA bricks with longer, 13-nucleotide binding domains make it possible to self-assemble 0.1–1-gigadalton, three-dimensional nanostructures from tens of thousands of unique components, including a 0.5-gigadalton cuboid containing about 30,000 unique bricks and a 1-gigadalton rotationally symmetric tetramer. We also assembled a cuboid that contains around 10,000 bricks and about 20,000 uniquely addressable, 13-base-pair ‘voxels’ that serves as a molecular canvas for three-dimensional sculpting. Complex, user-prescribed, three-dimensional cavities can be produced within this molecular canvas, enabling the creation of shapes such as letters, a helicoid and a teddy bear. We anticipate that with further optimization of structure design, strand synthesis and assembly procedure even larger structures could be accessible, which could be useful for applications such as positioning functional components.","authors":["Luvena Ong","Nikita Hanikel","Omar K. Yaghi","Casey Grun"],"meta":["December 2017Nature 552(7683):72-77","DOI:10.1038/nature24648","Project: The self-assembly of DNA and RNA molecules"],"references":["314978839_Barcode_extension_for_analysis_and_reconstruction_of_structures","291801654_Folding_DNA_to_create_nanoscale_shapes_and_patterns","284022952_Scalable_amplification_of_strand_subsets_from_chip-synthesized_oligonucleotide_libraries","281387947_Routing_of_individual_polymers_in_designed_patterns","274258404_Dynamic_DNA_devices_and_assemblies_formed_by_shape-complementary_non-base_pairing_3D_components","271855181_Rational_design_of_self-assembly_pathways_for_complex_multicomponent_structures","309344510_Molecular_force_spectroscopy_with_a_DNA_origami-based_nanoscopic_force_clamp","303560591_Designer_nanoscale_DNA_assemblies_programmed_from_the_top_down","295169929_Self-assembly_of_DNA_into_Nanoscale_Three-Dimensional_Shapes","280389197_DNA_rendering_of_polyhedral_meshes_at_the_nanoscale","266741383_Casting_inorganic_structures_with_DNA_molds","260809073_Polyhedra_self-assembled_from_DNA_tripods_and_characterized_with_3D_DNA-PAINT","265254995_Toward_larger_DNA_origami","262610553_Multi-enzyme_complexes_on_DNA_scaffolds_capable_of_substrate_channelling_with_an_artificial_swinging_arm","260212743_DNA_Origami_Structures_Directly_Assembled_from_Intact_Bacteriophages"]}