{"id":"321652173_A_Novel_Sonification_Approach_to_Support_the_Diagnosis_of_Alzheimer's_Dementia","abstract":"Alzheimer’s disease is the most common neurodegenerative form of dementia that steadily worsens and eventually leads to death. Its set of symptoms include loss of cognitive function and memory decline. Structural and functional imaging methods such as CT, MRI, and PET scans play an essential role in the diagnosis process, being able to identify specific areas of cerebral damages. While the accuracy of these imaging techniques increases over time, the severity assessment of dementia remains challenging and susceptible to cognitive and perceptual errors due to intra-reader variability among physicians. Doctors have not agreed upon standardized measurement of cell loss used to specifically diagnose dementia among individuals. These limitations have led researchers to look for supportive diagnosis tools to enhance the spectrum of diseases characteristics and peculiarities. Here is presented a supportive auditory tool to aid in diagnosing patients with different levels of Alzheimer’s. This tool introduces an audible parameter mapped upon three different brain’s lobes. The motivating force behind this supportive auditory technique arise from the fact that AD is distinguished by a decrease of the metabolic activity (hypometabolism) in the parietal and temporal lobes of the brain. The diagnosis is then performed by comparing metabolic activity of the affected lobes to the metabolic activity of other lobes that are not generally affected by AD (i.e., sensorimotor cortex). Results from the diagnosis process compared with the ground truth show that physicians were able to categorize different levels of AD using the sonification generated in this study with higher accuracy than using a standard diagnosis procedure, based on the visualization alone.","authors":["Letizia Gionfrida","Agnieszka Roginska"],"meta":["December 2017Frontiers in Neurology 8","DOI:10.3389/fneur.2017.00647"],"references":["305211931_Multimodality_Review_of_Amyloid-related_Diseases_of_the_Central_Nervous_System","263964309_Heart_Rate_Sonification_A_New_Approach_to_Medical_Diagnosis","263964122_The_Sonification_Handbook","262531805_PETCT_in_the_management_of_thyroid_cancers","307629984_Clinical_PET-MR_Imaging_in_Breast_Cancer_and_Lung_Cancer","302073933_An_Introduction_to_Cognitive_Aging_and_Dementia_A_Clinical_Neuropsychologist's_Perspective","270819087_The_SuperCollider_Book","261083692_A_Supporting_Method_of_Medical_Imaging_Diagnosis_with_Sonification","249563742_Heat_and_the_Heartbeat_of_the_City_Sonifying_Data_Describing_Climate_Change","234805620_Universal_Design_of_Auditory_Graphs_A_Comparison_of_Sonification_Mappings_for_Visually_Impaired_and_Sighted_Listeners","230784623_The_Conundrum_of_PETMR","232243923_AtmosphericsWeather_Works_A_Spatialized_Meteorological_Data_Sonification_Project","228922354_Taxonomy_and_definitions_for_sonification_and_auditory_display","224209923_A_system_for_the_complementary_visualization_of_3D_volume_images_using_2D_and_3D_binaurally_processed_sonification_representations","222008441_18F-FDG_PET_imaging_analysis_for_computer_aided_Alzheimer's_diagnosis"]}