{"id":"321619956_International_Handbook_of_Information_Technology_in_Primary_and_Secondary_Education","abstract":"Since the introduction of the computer into education in the 1960’s its potential for K-12 education has been widely recognized. The terminology used, at times confusing due to rapid technology change, has continuously evolved. We are in transition to an information society, and the term computer technology has been replaced by information technology (IT) or information and communication technology (ICT). New demands from the information society require education to focus on information management and communication skills, for which IT can be an essential resource. IT offers promising environments and tools to support new approaches to teaching and learning.\nDespite major investments, the implementation of IT in education has been a persistent problem. And, although it is generally assumed that IT has high potential for improving education, major research findings have only recently confirmed positive results of IT on students’ performance.\nWhile there is a vast amount of research on information technology (IT) in K-12 education, most of it is scattered. Until now, a unified presentation of the research from a broad international perspective has not been accomplished. As a ground-breaking publication, the two-volume International Handbook on Information Technology (full title) synthesizes the major issues and directions of research in the field.\nOne major focus of the Handbook is the design and potential of IT-based student learning environments. Offering the latest research in IT and the learning process, distance learning, and emerging technologies for education, these chapters address the critical issue of the potential for IT to improve K-12 education.\nA second important theme deals with the implementation of IT in educational practice. In these chapters, barriers and opportunities for IT implementation are studied from several perspectives: the teacher, the curriculum, the school organization and educational policy. Curriculum, competencies and attitudes, teacher learning, schools, and international and regional programs and policies are examined, to improve understanding how the implementation of IT in K-12 educational practice can be supported.\nAdditional topics addressed in the Handbook include the role of education in the information society, threats to equity in education and as well various approaches to research in IT in education.\nThe International Handbook on Information Technology in Primary and Secondary Education provides researchers, policy makers and practitioners with an integrated and detailed overview of this complex field, making it an essential reference for all libraries and educators.","authors":["Joke Voogt","Gerald Knezek"],"meta":["January 2008","DOI:10.1007/978-0-387-73315-9","ISBN: 978-0-387-73314-2"],"references":[]}