{"id":"321694732_Extracting_Non-redundant_Correlated_Purchase_Behaviors_by_Utility_Measure","abstract":"From web search and data mining, users' click and purchase behaviors contain valuable information, thus numerous approaches have been proposed to identify embedded useful knowledge from them. In these real-life situations, each user may perform the same action/event multiple times, and multiple accessed events product different profit. Many utility-oriented data mining approaches thus have been extensively studied. Previous studies have the limitation that the overall utility of traditional pattern is limited since they rarely consider the inherent correlation. For example, from the purchase behavior, the low-utility patterns sometimes with a very high-utility pattern will be considered as a valuable pattern even if this behavior may be not highly correlated. A more intelligent framework that provides non-redundant and correlated behavior based on utility measure is thus desired. In this paper, we first present a novel method to extract non-redundant correlated purchase behaviors considering the utility and correlation factors. The high qualified patterns can be derived with high profit and strong correlation, which can lead to higher recall and reveal better precision. In the proposed projection-based approach, an efficient projection mechanism and a sorted downward closure property are developed to reduce the database size. Several pruning strategies are further developed to efficiently and effectively discover the desired patterns. An extensive experimental study showed that the novel non-redundant correlated high-utility pattern has more effectiveness than the previous knowledge representation. Moreover, the proposed algorithm is efficient in terms of execution time and memory usage.","authors":["Wensheng Gan","Chun-Wei Jerry Lin","Philippe Fournier Viger","Han-Chieh Chao"],"meta":["December 2017Knowledge-Based Systems","DOI:10.1016/j.knosys.2017.12.003","Project: UPM: utility-oriented pattern mining"],"references":["318857484_Extracting_Non-redundant_Correlated_Purchase_Behaviors_by_Utility_Measure","318536108_Data_mining_in_distributed_environment_a_survey","315726003_A_Survey_of_Itemset_Mining","308387578_FDHUP_Fast_algorithm_for_mining_discriminative_high_utility_patterns","307619679_Indexed_list-based_high_utility_pattern_mining_with_utility_upper-bound_reduction_and_pattern_combination_techniques","307614061_EFIM_a_fast_and_memory_efficient_algorithm_for_high-utility_itemset_mining","314198135_A_Lattice-Based_Approach_for_Mining_High_Utility_Association_Rules","313423915_Mining_of_frequent_patterns_with_multiple_minimum_supports","308599135_Efficient_Mining_of_High-Utility_Itemsets_Using_Multiple_Minimum_Utility_Thresholds","307621847_FHN_An_Efficient_Algorithm_for_Mining_High-Utility_Itemsets_with_Negative_Unit_Profits"]}