{"id":"321620115_Mathematical_Problems_in_Image_Processing_Partial_Differential_Equations_and_the_Calculus_of_Variations","abstract":"Partial differential equations (PDEs) and variational methods were introduced into image processing about fifteen years ago. Since then, intensive research has been carried out. The goals of this book are to present a variety of image analysis applications, the precise mathematics involved and how to discretize them. Thus, this book is intended for two audiences. The first is the mathematical community by showing the contribution of mathematics to this domain. It is also the occasion to highlight some unsolved theoretical questions. The second is the computer vision community by presenting a clear, self-contained and global overview of the mathematics involved in image processing problems. This work will serve as a useful source of reference and inspiration for fellow researchers in Applied Mathematics and Computer Vision, as well as being a basis for advanced courses within these fields.\n\nDuring the four years since the publication of the first edition, there has been substantial progress in the range of image processing applications covered by the PDE framework. The main goals of the second edition are to update the first edition by giving a coherent account of some of the recent challenging applications, and to update the existing material. In addition, this book provides the reader with the opportunity to make his own simulations with a minimal effort. To this end, programming tools are made available, which will allow the reader to implement and test easily some classical approaches.\nReviews of the earlier edition:\n\"Mathematical Problems in Image Processing is a major, elegant, and unique contribution to the applied mathematics literature, oriented toward applications in image processing and computer vision.... Researchers and practitioners working in the field will benefit by adding this book to their personal collection. Students and instructors will benefit by using this book as a graduate course textbook.\"\n-- SIAM Review\n\"The Mathematician -- and he doesn't need to be a 'die-hard' applied mathematician -- will love it because there are all these spectacular applications of nontrivial mathematical techniques and he can even find some open theoretical questions. The numerical analyst will discover many challenging problems and implementations. The image processor will be an eager reader because the book provides all the mathematical elements, including most of the proofs.... Both content and typography are a delight. I can recommend the book warmly for theoretical and applied researchers.\"\n-- Bulletin of the Belgian Mathematics","authors":["Gilles Aubert","Pierre Kornprobst"],"meta":["January 2006","DOI:10.1007/978-0-387-44588-5","ISBN: 978-0-387-32200-1"],"references":[]}