{"id":"321660768_Alteration_of_brain_network_topology_in_HIV-associated_neurocognitive_disorder_A_novel_functional_connectivity_perspective","abstract":"HIV is capable of invading the brain soon after seroconversion. This ultimately can lead to deficits in multiple cognitive domains commonly referred to as HIV-associated neurocognitive disorders (HAND). Clinical diagnosis of such deficits requires detailed neuropsychological assessment but clinical signs may be difficult to detect during asymptomatic injury of the central nervous system (CNS). Therefore neuroimaging biomarkers are of particular interest in HAND. In this study, we constructed brain connectivity profiles of 40 subjects (20 HIV positive subjects and 20 age-matched seronegative controls) using two different methods: a non-linear mutual connectivity analysis approach and a conventional method based on Pearson's correlation. These profiles were then summarized using graph-theoretic methods characterizing their topological network properties. Standard clinical and laboratory assessments were performed and a battery of neuropsychological (NP) tests was administered for all participating subjects. Based on NP testing, 14 of the seropositive subjects exhibited mild neurologic impairment. Subsequently, we analyzed associations between the network derived measures and neuropsychological assessment scores as well as common clinical laboratory plasma markers (CD4 cell count, HIV RNA) after adjusting for age and gender. Mutual connectivity analysis derived graph-theoretic measures, Modularity and Small Worldness, were significantly (p","authors":["Anas Z. Abidin","Adora M. DSouza","Mahesh B. Nagarajan","Lu Wang"],"meta":["December 2017NeuroImage: Clinical 17(C)","DOI:10.1016/j.nicl.2017.11.025"],"references":["305272449_Disrupted_topological_organization_of_structural_and_functional_brain_connectomes_in_clinically_isolated_syndrome_and_multiple_sclerosis","284902796_A_resilient_low-frequency_small-world_human_brain_functional_network_with_highly_connected_association_cortical_hubs","267745609_Neurocognitive_Change_in_the_Era_of_HIV_Combination_Antiretroviral_Therapy_The_Longitudinal_CHARTER_Study","264201791_The_hubs_of_the_human_connectome_are_generally_implicated_in_the_anatomy_of_brain_disorders","301759836_Reconfiguration_of_brain_network_architecture_to_support_executive_control_in_aging","297893822_HIV-associated_neurocognitive_disorder_-_pathogenesis_and_prospects_for_treatment","273657862_HIV_and_antiretroviral_therapy_in_the_brain_neuronal_injury_and_repair","273514039_Effects_of_HIV_and_combination_antiretroviral_therapy_on_cortico-striatal_functional_connectivity","267929372_Multimodal_Neuroimaging_Evidence_of_Alterations_in_Cortical_Structure_and_Function_in_HIV-Infected_Older_Adults","265345234_Modern_network_science_of_neurological_disorders"]}