{"id":"321652262_Generalized_enhanced_suffix_array_construction_in_external_memory","abstract":"Background: \nSuffix arrays, augmented by additional data structures, allow solving efficiently many string processing problems. The external memory construction of the generalized suffix array for a string collection is a fundamental task when the size of the input collection or the data structure exceeds the available internal memory.\n\nResults: \nIn this article we present and analyze [Formula: see text] [introduced in CPM (External memory generalized suffix and [Formula: see text] arrays construction. In: Proceedings of CPM. pp 201-10, 2013)], the first external memory algorithm to construct generalized suffix arrays augmented with the longest common prefix array for a string collection. Our algorithm relies on a combination of buffers, induced sorting and a heap to avoid direct string comparisons. We performed experiments that covered different aspects of our algorithm, including running time, efficiency, external memory access, internal phases and the influence of different optimization strategies. On real datasets of size up to 24 GB and using 2 GB of internal memory, [Formula: see text] showed a competitive performance when compared to [Formula: see text] and [Formula: see text], which are efficient algorithms for a single string according to the related literature. We also show the effect of disk caching managed by the operating system on our algorithm.\n\nConclusions: \nThe proposed algorithm was validated through performance tests using real datasets from different domains, in various combinations, and showed a competitive performance. Our algorithm can also construct the generalized Burrows-Wheeler transform of a string collection with no additional cost except by the output time.","authors":["Felipe A. Louza","Guilherme P. Telles","Steve Hoffmann","Cristina Dutra De Aguiar Ciferri"],"meta":["December 2017Algorithms for Molecular Biology 12(1)","DOI:10.1186/s13015-017-0117-9","Project: Construction of Fundamental Data Structures for Strings"],"references":["316005996_Inducing_enhanced_suffix_arrays_for_string_collections","310823649_Parallel_distributed_memory_construction_of_suffix_and_longest_common_prefix_arrays","310744421_Burrows-Wheeler_transform_and_LCP_array_construction_in_constant_space","319394814_Algorithms_on_strings_trees_and_sequences_computer_science_and_computational_biology","312079717_Space-Efficient_Construction_of_Compressed_Indexes_in_Deterministic_Linear_Time","309078517_Inducing_Suffix_and_LCP_Arrays_in_External_Memory","308533321_Optimal_suffix_sorting_and_LCP_array_construction_for_constant_alphabets","303788487_LCP_array_construction_in_external_memory","301307700_Lightweight_LCP_Construction_for_Very_Large_Collections_of_Strings","300789519_Parallel_External_Memory_Suffix_Sorting"]}