{"id":"321619684_Rethinking_Engineering_Education_The_CDIO_Approach","abstract":"In the past ten years, leaders in engineering industries have identified specific knowledge, skills, and attitudes required of their workforce if they want to be innovative and competitive in a global marketplace. Engineering education programs have kept pace with emerging disciplinary knowledge, research and technologies, but have been less successful in ensuring that their graduates acquire the knowledge, skills, and attitudes desired by industry.\nThis book describes an approach to engineering education that integrates a comprehensive set of personal and interpersonal skills, and process, product, and system building skills with disciplinary knowledge. The education of engineers is set in the context of engineering practice, that is, Conceiving, Designing, Implementing, and Operating (CDIO) through the entire lifecycle of engineering processes, products, and processes.\nThe CDIO approach and the topics in the book will be of increasing interest in the next five to ten years. At the start of the CDIO Initiative, four leading engineering programs in the United States and Sweden adopted the CDIO approach and collaborated in its development and implementation. In less than six years, the collaboration has grown to include more than twenty programs in nine different countries. This book will be both a description of the development and implementation of the CDIO approach, and a guide to engineering programs worldwide who seek to improve their programs.\nFrom the Foreword by Charles M. Vest, President Emeritus, MIT:\nThe philosophy of the CDIO approach to engineering education captures these essential features of a modern engineering education -excitement about what engineers do, deep learning of the fundamentals, skills, and the knowledge of how engineers contribute to society.","authors":["Edward F. Crawley","Johan Malmqvist","Soren Ostlund","Doris R. Brodeur"],"meta":["January 2007","DOI:10.1007/978-0-387-38290-6","ISBN: 978-0-387-38287-6"],"references":[]}