{"id":"321610103_Soft_Computing_in_Humanities_and_Social_Sciences","abstract":"The field of Soft Computing in Humanities and Social Sciences is at a turning point. The strong distinction between “science” and “humanities” has been criticized from many fronts and, at the same time, an increasing cooperation between the so-called “hard sciences” and “soft sciences” is taking place in a wide range of scientific projects dealing with very complex and interdisciplinary topics. In the last fifteen years the area of Soft Computing has also experienced a gradual rapprochement to disciplines in the Humanities and Social Sciences, and also in the field of Medicine, Biology and even the Arts, a phenomenon that did not occur much in the previous years.\n\nThe collection of this book presents a generous sampling of the new and burgeoning field of Soft Computing in Humanities and Social Sciences, bringing together a wide array of authors and subject matters from different disciplines. Some of the contributors of the book belong to the scientific and technical areas of Soft Computing while others come from various fields in the humanities and social sciences such as Philosophy, History, Sociology or Economics.\n\nRudolf Seising received a Ph.D. degree in philosophy of science and a postdoctoral lecture qualification (PD) in history of science from the Ludwig Maximilians University of Munich.\nHe is an Adjoint Researcher at the European Centre for Soft Computing in Mieres (Asturias), Spain.\n\nVeronica Sanz earned a Ph.D. in Philosophy at the University Complutense of Madrid (Spain). At the moment she is a Postdoctoral Researcher at the Science, Technology and Society Center in the University of California at Berkeley.\n\nVeronica Sanz earned a Ph.D. in Philosophy at the University Complutense of Madrid (Spain). At the moment she is a Postdoctoral Researcher at the Science, Technology and Society Center in the University of California at Berkeley.","authors":["Rudolf Seising","Veronica Sanz González"],"meta":["January 2012Studies in Fuzziness and Soft Computing","DOI:10.1007/978-3-642-24672-2","ISBN: 978-3-642-24671-5","Project: Fuzzy Sets and Soft Computing"],"references":[]}