{"id":"321622541_Des_services_contrastes_rendus_par_l'elevage_dans_les_espaces_urbains_et_periurbains_europeens","abstract":"L’élevage dans les espaces urbains et périurbains trouve actuellement un net regain d’intérêt en Europe du fait de l’intérêt croissant des consommateurs autour du « produire local » et du besoin de « nature » des citadins. Notre objectif est ici de synthétiser une littérature souvent fragmentaire et de structurer cette analyse grâce au cadre des bouquets de services. Pour les espaces périurbains, la littérature scientifique traite en priorité des enjeux d’aménagement pour répondre à l’approvisionnement alimentaire des villes. L’élevage en ville est bien moins étudié, ce qui nous a conduits à utiliser quelques travaux hors Europe et à consulter les sites internet de communautés urbaines et des sites associatifs. Les bouquets de services rendus par l’élevage et les freins à son développement sont très différents entre ces deux types d’espaces. Dans les villes d’Europe de l’Ouest le service d’approvisionnement reste minoritaire. La réintroduction des animaux en ville est largement motivée par une volonté de créer du lien social et constitue un facteur de réinsertion et d’éducation des citadins vis-à-vis de l’origine des produits qu’ils consomment. Les principaux freins sont liés aux nuisances et aux risques épidémiologiques occasionnés par les animaux. Dans les espaces périurbains, la contribution de l’élevage au service d’approvisionnement est plus importante et dynamisée par la vente directe. L’élevage d’herbivores maintient des prairies qui fournissent différents services de régulation et répondent aux attentes des citadins pour des espaces récréatifs à proximité immédiate des villes. Le développement de l’élevage est principalement contraint par la forte pression foncière qui s’exerce sur ces espaces. Nous concluons en proposant quelques pistes de recherches.","authors":["Delfosse Claire","Bertrand Dumont","Nathalie Hostiou"],"meta":["December 2017Productions Animales -Paris- Institut National de la Recherche Agronomique- 30(4):395-406","DOI:10.20870/productions-animales.2017.30.4.2269","Project: Role, impacts and services provided by European livestock production"],"references":["321753623_Les_bouquets_de_services_un_concept_cle_pour_raisonner_l'avenir_des_territoires_d'elevage","321369556_Diversite_des_services_rendus_par_les_territoires_a_forte_densite_d'elevages_trois_cas_d'etude_en_Europe","320830203_Une_typologie_pour_representer_la_diversite_des_territoires_d'elevage_en_Europe","320806012_La_grange_un_cadre_conceptuel_pour_apprehender_les_bouquets_de_services_rendus_par_l'elevage_dans_les_territoires","341820226_Vente_directe_de_viande_bovine_dans_la_vallee_du_Thore_Tarn_un_exemple_de_diversification_agricole_en_proximite_urbaine","322794169_Trajectoires_et_strategies_agricoles_dans_les_espaces_urbains_et_periurbains_Entre_specialisation_et_conversion_L'exemple_de_la_peripherie_Sud-Est_de_l'agglomeration_lilloise","322462112_Les_multiples_facettes_des_cultures_territoriales_dans_le_departement_du_Nord","320193378_Les_espaces_agricoles_des_circuits_de_proximite_une_lecture_critique_de_la_relocalisation_de_l'approvisionnement_alimentaire_de_Millau","317135715_Dossier_L'agriculture_dans_le_systeme_alimentaire_urbain_continuites_et_innovations_-_Introduction","316100441_Quand_le_cheval_contribue_au_dynamisme_des_territoires_analyse_de_projets_locaux_innovants_entrepris_par_des_collectivites_francaises"]}