{"id":"321679911_Enhancing_sustainable_urban_development_through_smart_city_applications","abstract":"Purpose\n\nThis paper investigates the potential contribution of smart city approaches and tools to sustainable urban development in the environment domain. Recent research has highlighted the need to explore the relation of smart and sustainable cities more systematically, focusing on practical applications that could enable a deeper understanding of the included domains, typologies and design concepts, and this paper aims to address this research gap. At the same time, it tries to identify whether these applications could contribute to the “zero vision” strategy, an extremely ambitious challenge within the field of smart cities.\n\nDesign/methodology/approach\n\nThis objective is pursued through an in-depth investigation of available open source and proprietary smart city applications related to environmental sustainability in urban environments. A total of 32 applications were detected through the Intelligent/Smart Cities Open Source (ICOS) community, a meta-repository for smart cities solutions. The applications are analyzed comparatively regarding (i) the environmental issue addressed, (ii) the associated mitigation strategies, (iii) the included innovation mechanism, (iv) the role of information and communication technologies and (v) the overall outcome.\n\nFindings\n\nThe findings suggest that the smart and sustainable city landscape is extremely fragmented both on the policy and the technical levels. There is a host of unexplored opportunities toward smart sustainable development, many of which are still unknown. Similar findings are reached for all categories of environmental challenges in cities. Research limitations pertain to the analysis of a relatively small number of applications. The results can be used to inform policy making toward becoming more proactive and impactful both locally and globally. Given that smart city application market niches are also identified, they are also of special interest to developers, user communities and digital entrepreneurs.\n\nOriginality/value\n\nThe value added by this paper is two-fold. At the theoretical level, it offers a neat conceptual bridge between smart and sustainable cities debate. At the practical level, it identifies under-researched and under-exploited fields of smart city applications that could be opportunities to attain the “zero vision” objective.","authors":["Margarita Angelidou","Artemis Psaltoglou","Nicos Komninos","Christina Kakderi"],"meta":["December 2017","DOI:10.1108/JSTPM-05-2017-0016","Project: Research"],"references":["328981572_Urban_Problems_-_Underground_Solutions","319165021_Angelidou_M_2017_The_Role_of_Smart_City_Characteristics_in_the_Plans_of_Fifteen_Cities_Journal_of_Urban_Technology_1-28","317048810_Irregular_migratory_flows_Towards_an_ICTs'_enabled_integrated_framework_for_resilient_urban_systems","314455288_Challenges_with_smart_cities_initiatives_-_A_municipal_decision_makers'_perspective","312295543_Accelerating_the_Uptake_of_Smart_City_Applications_through_Cloud_Computing","310403759_Smart_Sustainable_Cities_Definition_and_Challenges","321509064_Analysis_of_Urban_Growth_and_Sprawl_from_Remote_Sensing_Data","317268435_An_empirical_investigation_of_social_innovation_initiatives_for_sustainable_urban_development","314259748_Smart_Sustainable_Cities_of_the_Future_An_Extensive_Interdisciplinary_Literature_Review","313149581_What_are_the_differences_between_sustainable_and_smart_cities"]}