{"id":"321636510_The_Experience_Sampling_Method_on_Mobile_Devices","abstract":"The Experience Sampling Method (ESM) is used by scientists from various disciplines to gather insights into the intra-psychic elements of human life. Researchers have used the ESM in a wide variety of studies, with the method seeing increased popularity. Mobile technologies have enabled new possibilities for the use of the ESM, while simultaneously leading to new conceptual, methodological, and technological challenges. In this survey, we provide an overview of the history of the ESM, usage of this methodology in the computer science discipline, as well as its evolution over time. Next, we identify and discuss important considerations for ESM studies on mobile devices, and analyse the particular methodological parameters scientists should consider in their study design. We reflect on the existing tools that support the ESM methodology and discuss the future development of such tools. Finally, we discuss the effect of future technological developments on the use of the ESM and identify areas requiring further investigation.","authors":["Niels van Berkel","Denzil Ferreira","Vassilis Kostakos"],"meta":["December 2017ACM Computing Surveys 50(6):1-40","DOI:10.1145/3123988","Project: AWARE: Human and Social Context for Wellbeing"],"references":["319164495_Gamification_of_Mobile_Experience_Sampling_Improves_Data_Quality_and_Quantity","311530435_Human_Factors_in_the_Design_of_Longitudinal_Smartphone-based_Wellness_Surveys","310820163_In-situ_investigation_of_notifications_in_multi-device_environments","310820071_mEMA_Microinteraction-based_Ecological_Momentary_Assessment_EMA_Using_a_Smartwatch","321619751_Mobile_Context_Awareness","313475906_A_survey_method_for_characterizing_daily_life_experience","313389196_My_phone_and_me_Understanding_people's_receptivity_to_mobile_notifications","311489599_A_field_study_comparing_approaches_to_collecting_annotated_activity_data_in_real-world_settings","310842192_Back-of-device_interaction_allows_creating_very_small_touch_devices","310818957_Wearable_ESM_differences_in_the_experience_sampling_method_across_wearable_devices"]}