{"id":"321653857_Komunikasi_Keluarga_Dalam_Pencegahan_Perilaku_Bullying_Bagi_Anak","abstract":"Communication process occurs in every aspect of life, including family. When people interact to each other, sometimes it may lead to bullying. Bullying is not a new phenomenon, especially in family. Bullying means verbal and physical threat, force and violence which conduct repeatedly, for instance by the older children to their younger sister or brother. This is the uniqueness of this research. Family communication becomes main foundation to prevent bullying. Researcher see this phenomenon as a unique problem to be studied. Based on that phenomenon, researcher interested to study “Family Communication in Preventing Bullying Behavior for Children”. Result shows that family communication in preventing children’s bullying behavior covers: (1) In order to prevent bullying, an effective family communication process has to be strived, including respect, empathy, audible (2) Causative factor of bullying is inappropriate parenting in context of family communication.\n\nProses komunikasi berlangsung dalam setiap aspek kehidupan, termasuk dalam lapisan masyarakat dan lapisan keluarga. Ketika manusia melakukan interaksi satu sama lainnya, kadang-kadang mengarah pada perilaku bullying. Bullying bukanlah fenomena yang baru lagi, khususnya dalam sebuah keluarga. Bullying artinya ancaman, pemaksaan, kekerasan fisik maupun verbal yang dilakukan berulang-ulang, misalnya kakak kepada adiknya. Disinilah letak keunikan penelitian ini. Komunikasi keluarga menjadi pondasi utama untuk mencegah terjadinya perilaku bullying bagi anak. Peneliti melihat fenomena ini merupakan masalah yang unik dan menarik untuk diteliti. Berdasarkan fenomena tersebut, peneliti tertarik untuk mengangkat “Komunikasi Keluarga dalam Pencegahan Perilaku Bullying bagi Anak”. Hasil penelitian ini menunjukkan bahwa komunikasi keluarga dalam pencegahan perilaku bullying bagi anak meliputi: (1) Untuk mencegah bullying harus diupayakan proses komunikasi keluarga yang efektif yaitu: respek, empati, audible; (2) Adapun faktor penyebab terjadinya perilaku bullying adalah pengasuhan orangtua yang tidak tepat dalam konteks komunikasi keluarga","authors":["Preciosa Alnashava Janitra","Ditha Prasanti"],"meta":["June 2017Jurnal Ilmu Sosial Mamangan 6(1):23","DOI:10.22202/mamangan.1878"],"references":["247979482_The_Olweus_BullyVictim_Questionnaire","323670054_Analisis_Pemenuhan_Hak_Dasar_Anak_Pada_Program_Kota_Layak_Anak_Di_Kecamatan_Gading_Cempaka_Bengkulu","323669947_Upaya_Keluarga_Dalam_Penyembuhan_Pasien_Penyakit_Jiwa_Studi_Pada_Pasien_Penyakit_Jiwa_di_RSJ_HB_Sa'anin_Padang","284565059_Bullyvictim_problems_at_school_Facts_and_effective_intervention","222032486_Personality_and_family_relations_of_children_who_bully","6891338_Adolescent_Male_Bullies_Victims_and_Bully-Victims_A_Comparison_of_Psychosocial_and_Behavioral_Characteristics"]}