{"id":"321654016_Conversion_of_Continuous-Valued_Deep_Networks_to_Efficient_Event-Driven_Networks_for_Image_Classification","abstract":"Spiking neural networks (SNNs) can potentially offer an efficient way of doing inference because the neurons in the networks are sparsely activated and computations are event-driven. Previous work showed that simple continuous-valued deep Convolutional Neural Networks (CNNs) can be converted into accurate spiking equivalents. These networks did not include certain common operations such as max-pooling, softmax, batch-normalization and Inception-modules. This paper presents spiking equivalents of these operations therefore allowing conversion of nearly arbitrary CNN architectures. We show conversion of popular CNN architectures, including VGG-16 and Inception-v3, into SNNs that produce the best results reported to date on MNIST, CIFAR-10 and the challenging ImageNet dataset. SNNs can trade off classification error rate against the number of available operations whereas deep continuous-valued neural networks require a fixed number of operations to achieve their classification error rate. From the examples of LeNet for MNIST and BinaryNet for CIFAR-10, we show that with an increase in error rate of a few percentage points, the SNNs can achieve more than 2x reductions in operations compared to the original CNNs. This highlights the potential of SNNs in particular when deployed on power-efficient neuromorphic spiking neuron chips, for use in embedded applications.","authors":["Bodo Rueckauer","Iulia-Alexandra Lungu","Yuhuang Hu","Michael Pfeiffer"],"meta":["December 2017Frontiers in Neuroscience 11","DOI:10.3389/fnins.2017.00682"],"references":["318174473_An_Event-Driven_Classifier_for_Spiking_Neural_Networks_Fed_with_Synthetic_or_Dynamic_Vision_Sensor_Data","311611993_Theory_and_Tools_for_the_Conversion_of_Analog_to_Spiking_Convolutional_Neural_Networks","310327110_Training_Spiking_Deep_Networks_for_Neuromorphic_Hardware","327549820_Event-based_neuromorphic_systems","320091283_Fast_classification_using_sparsely_active_spiking_networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313054161_STDP_enables_spiking_neurons_to_detect_hidden_causes_of_their_inputs","309776735_TrueHappiness_Neuromorphic_Emotion_Recognition_on_TrueNorth","308824618_Real-time_event-driven_spiking_neural_network_object_recognition_on_the_SpiNNaker_platform","307904596_Fast_and_Efficient_Asynchronous_Neural_Computation_with_Adapting_Spiking_Neural_Networks"]}