{"id":"321609171_Ensino_de_Demonstracao_por_Inducao_em_Teoria_dos_Grafos_utilizando_um_Ambiente_Visual_de_Algoritmos","abstract":"Com o intuito de aperfeiçoar o processo de ensino e aprendizagem em Ciência da Computação, novas metodologias vêm sendo propostas. Algumas destas metodologias têm concentrado esforços em transformar processos abstratos em concretos através de softwares que possibilitem a melhor compreensão dos tópicos abordados e maior interação entre aluno e objeto de trabalho. Para isto, ambientes visuais de algoritmos (AVA) estão sendo utilizados para visualizar o passo-a-passo de algoritmos. A visualização de algoritmos é um recurso auxiliar poderoso no processo de ensino e aprendizagem. Na disciplina de Teoria dos Grafos, vários AVAs foram propostos para este fim. Entretanto, há carência de trabalhos que proponham um AVA como recurso metodológico para o ensino de demonstração por indução em Teoria dos Grafos. A demonstração por indução em Teoria dos Grafos é uma área bastante importante para abstrações e resoluções de problemas na área de Computação. A indução matemática é abordada inicialmente no curso de Computação na disciplina Matemática Discreta. Grande parte dos alunos sente dificuldades em visualizar e utilizar de forma correta a demonstração por indução. Este projeto tem como objetivo melhorar o processo de ensino e aprendizagem na disciplina de Teoria dos Grafos em relação às demonstrações por indução. Para isto, propõe-se um método de ensino e aprendizagem com intuito de auxiliar os alunos que tenham dificuldades no entendimento e compreensão tanto da técnica de demonstração por indução, quanto dos conceitos abordados na disciplina. A metodologia adotada consiste na criação de um AVA para o ensino de demonstrações por indução em Teoria dos Grafos e a utilização deste AVA em um ambiente controlado. Este ambiente será composto por duas turmas (A e B) de estudantes voluntários. O experimento ocorrerá em dois momentos: (i) primeiro momento, a turma A será exposta a conceitos que envolvem demonstração por indução com a utilização do AVA, enquanto a turma B será exposta aos mesmos conceitos, porém sem a utilização do AVA criado; (ii) segundo momento, será semelhante ao primeiro, porém com a inversão das turmas e com a exposição de outros conceitos. Questionários serão aplicados antes e após a realização do experimento. Ao final, será realizada uma análise quali-quantitativa dos resultados obtidos dos questionários respondidos. A hipótese principal deste projeto é que o uso de AVAs no ensino de demonstração por indução em Teoria dos Grafos é mais favorável ao processo de ensino e aprendizagem do que o cenário que não envolve o seu uso.","authors":["Frederico Assis Carvalho","Esdras Lins Bispo Jr."],"meta":["June 2016","DOI:10.13140/RG.2.2.17170.96960","Conference: Encontro de Licenciaturas do Sudoeste Goiano (ELICPIBID)At: Quirinópolis, GO","Project: Visualização de Algoritmos na Educação de Computação"],"references":[]}