{"id":"321791327_Long-Short_Range_Communication_Network_Leveraging_LoRa_TM_and_Wake-up_Receiver","abstract":"Wireless sensor and actuator networks play a central role in the Internet of Things, and a lot of effort is devoted to enable energy efficient and low latency communications. In the recent years, low power communications has evolved towards multi-kilometer ranges and low bit-rate approaches such as LoRa™. However, the medium access layer protocols rely on the well-known duty-cycling schemes, which require a trade-off between power consumption and latency for message transfer from the gateway to the nodes. Domains such as industrial applications in which sensors and actuators are part of the control loop require predictable latency, as well as low power consumption. Emerging ultra-low-power wake-up receivers enable pure-asynchronous communications, allowing both low latency and low power consumption, but at the cost of a lower sensitivity and lower range than traditional wireless receivers and LoRa™. In this work, we propose an energy efficient architecture that combines long-range communication with ultra low-power short-range wake-up receivers to achieve both energy efficient and low latency communication in heterogeneous long-short range networks. A hardware architecture as well as a protocol is proposed to exploit the benefits of these two communication schemes. Experimental measurements and analytical comparisons show that the proposed approach remove the need for a trade-off between power consumption and latency.","authors":["Fayçal Ait Aoudia","Matthieu Gautier","Michele Magno","Mickael Le Gentil"],"meta":["December 2017Microprocessors and Microsystems 56","DOI:10.1016/j.micpro.2017.12.004","Project: Wake Up Radio and Energy efficient Communication"],"references":["309498865_A_Low_Latency_and_Energy_Efficient_Communication_Architecture_for_Heterogeneous_Long-Short_Range_Communication","301464143_Zippy_On-Demand_Network_Flooding","293191680_Design_implementation_and_performance_evaluation_of_a_flexible_low_latency_and_low_cost_nano-Watt_Wake-Up_Radio_Receiver","287218879_Research_Article_OPWUM_Opportunistic_MAC_Protocol_Leveraging_Wake-Up_Receivers_in_WSNs","316948751_WULoRa_An_energy_efficient_IoT_end-node_for_energy_harvesting_and_heterogeneous_communication","313454347_Analytical_and_Experimental_Evaluation_of_Wake-Up_Receivers_Based_Protocols","311498757_A_Generic_Framework_for_Modeling_MAC_Protocols_in_Wireless_Sensor_Networks","310660661_Optimum_Excitations_for_a_Dual-Band_Microwatt_Wake-Up_Radio","309079811_MAC_Protocols_with_Wake-up_Radio_for_Wireless_Sensor_Networks_A_Review","300416848_Radio-On-Demand_Sensor_and_Actuator_Networks_ROD-SAN_System_Design_and_Field_Trial"]}