{"id":"321747011_Applying_Data_Mining_Techniques_in_Healthcare","abstract":"Healthcare sector provides huge volume of data on patients and their illnesses, on health insurance plants, medication and treatment schedules for different diseases, on medical services and so forth. Nowadays, there is a growing demand for the healthcare community to transform the existing quantities of healthcare data into value-added data, by discovering unknown patterns and relations between these data and by using them in the decision-making process, even if they refer to management, planning or treatments. Data mining consists in discovering knowledge and techniques such as classification and regression trees, logistic regression and neural networks that are adequate to predict the health status of a patient, by taking into account various medical parameters (also known as attributes) and demographic parameters. This paper presents a case study on the classification of patients with thyroid dysfunctions into three classes (i.e. 1 - hypothyroidism, 2 - hyperthyroidism, 3- normal) by using data mining algorithms and discusses possible methods to improve the accuracy of the considered classification models.","authors":["Irina Ionita","Liviu Ioniță"],"meta":["September 2016Studies in Informatics and Control 25(3):385-394","DOI:10.24846/v25i3y201612","Project: Application of Data Mining in Healthcare Sector"],"references":["242074409_Application_of_data_mining_techniques_in_pharmaceutical_industry","227658748_Classification_and_Regression_Trees","287739533_Artificial_Neural_Networks","242641395_Problems_in_the_Analysis_of_Survey_Data_and_a_Proposal","226222944_Induction_of_Decision_Trees","224398667_Diagnosis_of_Thyroid_Disorders_using_Artificial_Neural_Networks","222159273_ESTDD_Expert_system_for_thyroid_diseases_diagnosis","220543019_Improved_Use_of_Continuous_Attributes_in_C45","220520250_Biological_applications_of_multi-relational_data_mining","49803517_A_Three-Stage_Expert_System_Based_on_Support_Vector_Machines_for_Thyroid_Disease_Diagnosis"]}