{"id":"321756650_MODEL_FOR_BUILDING_COMPETENCIES_THROUGH_AN_ELECTRONIC_SYSTEM_FOR_ASSESSMENT_OF_KNOWLEDGE","abstract":"The ICT penetration in the life of the average person, digitisation of things and the easy access to information from many and different sources has gradually shifted the emphasis in the learning process from acquiring knowledge toward building skills and competencies. In the course of the training in hard skills, it becomes more and more important that the acquired knowledge be applied rationally in the solving of sudden problems. The main issues that are encountered in the learning process are the abundance of information sources, difficulties in selecting appropriate learning literature, and defocusing learners from the main purpose of learning. A good solution is a frequent control over the knowledge imposed from the lecturer, who checks the acquired knowledge analysing the results and guiding the learners to their specific problem through a suitable solution and appropriate literature. The paper presents a model for building competence in disciplines developing hard skills (such as C ++, C #, Java, JavaScript, HTML, etc.). The model is based on a scheme of accelerated systematic use of a complex of validation tools for the acquired knowledge in the educational process-presentation, verification, analysis and application of the learned material in practical tasks with the participation of an electronic system. It includes regularly repeating four stages: Stage of acquaintance with the new learning material, stage of testing and analysing knowledge; Stage of practical implementation in the form of realization of more complex tasks or larger projects and fourth stage-implementation of accumulated knowledge and skills in the solving of cases. The result of implementing the model in the learning process has a positive influence on demonstrated student knowledge in the form of more and better-solved tasks during the learning process and a greater number of correct answers during the exam. This gives a reason to believe that the model can enjoy the same success in other hard skills disciplines.","authors":["Iva Kostadinova","Iglika Getova","Georgi Dimitrov","Boryana Nikolova"],"meta":["November 2017","DOI:10.21125/iceri.2017.0163","Conference: ICERI2017 Conference Seville, SpainAt: Seville, Spain"],"references":["318685296_ANALYSIS_OF_THE_POSSIBILITIES_FOR_ENHANCING_STUDENTS'_TRAINING_PERFORMANCE_IN_HARD_SKILLS_SUBJECTS","313919607_An_Approach_to_constructing_a_model_for_creating_a_system_for_automated_generation_of_tests","264816875_Competency-based_education_in_an_electronicsupported_environment_An_example_from_a_distance_teaching_university","317001888_An_Approach_to_constructing_a_model_for_creating_a_system_for_automated_generation_of_tests","301351335_Challenges_in_teaching_digital_generation_in_Bulgaria"]}