{"id":"321762526_A_critical_review_of_13_years_of_mobile_game-based_learning","abstract":"With the increasing popularity of smartphones and tablets, game-based learning (GBL) is undergoing a rapid shift to mobile platforms. This transformation is driven by mobility, wireless interfaces, and built-in sensors that these smart devices offer in order to enable blended and context-sensitive mobile learning (m-Learning) activities. Thus, m-Learning is becoming more independent and ubiquitous (u-Learning). In order to identify and analyze the main trends and the future challenging issues involved in designing mGBL learning strategies, as well as to bring to the foreground important issues pertaining to mobile and context-aware ubiquitous GBL, the work at hand conducts a comprehensive survey of this particular area. Specifically, it introduces and applies a six-dimensional framework consisted of Spatio-temporal, Collaboration/Social, Session, Personalization, Data security & privacy, and Pedagogy, with the aim of scrutinizing the contributions in the field of mGBL published from 2004 to 2016. It was found that the transition to mGBL presents several difficulties, and therefore cannot be conceived as a simple and quick modification of existing GBL solutions. In this respect, this work is anticipated to foster the development of well-designed solutions that are intensive not only in their technological aspect, but in pedagogical qualities as well.","authors":["Filippos Giannakas","Georgios Kambourakis","Andreas Papasalouros","Stefanos Gritzalis"],"meta":["December 2017Educational Technology Research and Development 66(2)","DOI:10.1007/s11423-017-9552-z","Project: CyberAware mDGBL application"],"references":["317118082_LBS_Mobile_Learning_System_Based_on_Android_Platform","302916603_Improving_learning_computer_architecture_through_an_educational_mobile_game","302078465_CyberAware_A_mobile_game-based_app_for_cybersecurity_education_and_awareness","301714063_Security_Education_and_Awareness_for_K-6_Going_Mobile","288375322_Learning_History_Using_Role-Playing_Game_RPG_on_Mobile_Platform","286368756_Design_a_mobile_game_for_home_computer_users_to_prevent_from_phishing_attacks","285767902_Security_and_privacy_in_m-learning_and_beyond_Challenges_and_state-of-the-art","300361256_Useful_Design_Patterns_for_Game_Development","286651887_AKAMIA_Chemistry_mobile_game-based_tutorial","286605490_A_pattern_approach_to_interaction_design"]}