{"id":"321760448_A_Scoping_Review_of_Studies_on_Computational_Thinking_in_K-12_Mathematics_Classrooms","abstract":"Since the 1960s, a few, yet very influential, educational researchers have investigated how computer programming can be used to foster mathematics learning. However, since the term ‘computational thinking’ was popularised by Jeannette Wing in 2006, the number of studies in this area has grown substantially. In this article, we present a systematic analysis of literature linking mathematics education to computational thinking in an attempt to quantify the breadth and depth of existing work in the area. Our analysis indicates that many studies: (1) originate from computer science academics rather than education experts; (2) involve mathematics but mainly concentrate on teaching programming skills; (3) present small-scale research designs on self-reported attitudes or beliefs; (4) rarely deal with concepts in mathematical domain areas such as probability, statistics, measurement or functions. Thus, we conclude that there are opportunities for rigorous research designs reporting on observable learning outcomes, explicitly targeting mathematics, conducted by multidisciplinary teams, and focusing on less-explored domain areas. We believe that these opportunities should be investigated, in order to provide a broader evidence base for developing meaningful digital learning experiences in mathematics for school-aged children.","authors":["Daniel Hickmott","Elena Prieto-Rodriguez","Kathryn Holmes"],"meta":["April 2018Digital Experiences in Mathematics Education 4(3):1-22","DOI:10.1007/s40751-017-0038-8"],"references":["312119278_Bridging_Primary_Programming_and_Mathematics_Some_Findings_of_Design_Research_in_England","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","301422420_Using_App_inventor_history_as_a_gateway_to_engage_African_American_students_in_computer_science","316948805_Assessing_Computational_Thinking_in_CS_Unplugged_Activities","308849453_Oh_SNAP_A_one-week_summer_computing_workshop_for_K-12_teachers","308849413_CodePlus_-_Designing_an_after_school_computing_programme_for_girls","308839730_Viewing_K-12_mathematics_and_science_standards_through_the_lens_of_the_first-year_introduction_to_engineering_course_classification_scheme","308828702_Teaching_K-12_students_STEM-C_related_topics_through_playing_and_conducting_research","307569274_Learning_from_the_Past-The_Need_for_Empirical_Evidence_on_the_Transfer_Effects_of_Computer_Programming_Skills","300918005_Scratch_A_Way_to_Logo_and_Python"]}