{"id":"321738302_Improving_Network_Connectivity_and_Robustness_Using_Trusted_Nodes_With_Application_to_Resilient_Consensus","abstract":"To observe and control a networked system, especially in failure-prone circumstances, it is imperative that the underlying network structure is robust against node or link failures. A common approach for increasing network robustness is redundancy: deploying additional nodes and establishing new links between nodes, which could be prohibitively expensive. This paper addresses the problem of improving structural robustness of networks without adding extra links. The main idea is to ensure that a small subset of nodes, referred to as the trusted nodes, remain intact and function correctly at all times. We extend two fundamental metrics of structural robustness with the notion of trusted nodes, network connectivity and $r$ -robustness, and then show that by controlling the number and location of trusted nodes, any desired connectivity and robustness can be achieved without adding extra links. We study complexity of finding trusted nodes and construction of robust networks with trusted nodes. Finally, we present a resilient consensus algorithm with trusted nodes and show that, unlike existing algorithms, resilient consensus is possible in sparse networks containing few trusted nodes.","authors":["Waseem toori Abbas","Aron Laszka","Xenofon Koutsoukos"],"meta":["December 2017IEEE Transactions on Control of Network Systems PP(99):1-1","DOI:10.1109/TCNS.2017.2782486"],"references":["305870897_Resilient_consensus_for_multi-agent_systems_with_quantized_communication","316443650_Resilient_First-Order_Consensus_and_Weakly_Stable_Higher_Order_Synchronization_of_Continuous-Time_Networked_Multi-Agent_Systems","312517628_Formations_for_Resilient_Robot_Teams","312285763_Secure_distributed_observers_for_a_class_of_linear_time_invariant_systems_in_the_presence_of_Byzantine_adversaries","312112121_Online_algorithms_for_network_formation","306296294_On_Connectivity_and_Robustness_in_Random_Intersection_Graphs","303449034_The_Game-Theoretic_Formation_of_Interconnections_Between_Networks","274196548_Consensus_of_second-order_multi-agent_systems_in_the_presence_of_locally_bounded_faults","273914442_A_Notion_of_Robustness_in_Complex_Networks","269259550_Robust_Graph_Topologies_for_Networked_Systems"]}