{"id":"321732456_Tree_crickets_optimize_the_acoustics_of_baffles_to_exaggerate_their_mate-attraction_signal","abstract":"Object manufacture in insects is typically inherited, and believed to be highly stereotyped. Optimization, the ability to select the functionally best material and modify it appropriately for a specific function, implies flexibility and is usually thought to be incompatible with inherited behaviour. Here, we show that tree-crickets optimize acoustic baffles, objects that are used to increase the effective loudness of mate-attraction calls. We quantified the acoustic efficiency of all baffles within the naturally feasible design space using finite-element modelling and found that design affects efficiency significantly. We tested the baffle-making behaviour of tree crickets in a series of experimental contexts. We found that given the opportunity, tree crickets optimised baffle acoustics; they selected the best sized object and modified it appropriately to make a near optimal baffle. Surprisingly, optimization could be achieved in a single attempt, and is likely to be achieved through an inherited yet highly accurate behavioural heuristic.","authors":["Natasha Mhatre","Robert Malkin","Rittik Deb","Rohini Balakrishnan"],"meta":["December 2017eLife Sciences 6:e32763","DOI:10.7554/eLife.32763"],"references":["313940786_Bumblebees_show_cognitive_flexibility_by_improving_on_an_observed_complex_behavior","312103622_Cognition-mediated_evolution_of_low-quality_floral_nectars","308886689_Associative_Mechanisms_Allow_for_Social_Learning_and_Cultural_Transmission_of_String_Pulling_in_an_Insect","287917884_Why_is_tool_use_rare_in_animals","275703146_Acoustic_Communication_and_Baffling_Behaviors_of_Crickets","264690154_The_opportunity_for_sampling_The_ecological_context_of_female_mate_choice","258184250_A_Tool_for_Every_Job_Assessing_the_Need_for_a_Universal_Definition_of_Tool_Use","243716469_Structural_Acoustics_Tutorial-Part_2_Sound-Structure_Interaction","271691812_A_Review_of_Tool_Use_in_Insects","247442902_Introduction_To_Algorithms"]}