{"id":"321714735_A_timeless_biology","abstract":"Contrary to claims that physics is timeless while biology is time-dependent, we take the opposite standpoint: physical systems' dynamics are constrained by the arrow of time, while living assemblies are time-independent. Indeed, the concepts of “constraints” and “displacements” shed new light on the role of continuous time flow in life evolution, allowing us to sketch a physical gauge theory for biological systems in long timescales. In the very short timescales of biological systems' individual lives, time looks like “frozen” and “fixed”, so that the second law of thermodynamics is momentarily wrecked. The global symmetries (standing for biological constrained trajectories, i.e. the energetic gradient flows dictated by the second law of thermodynamics in long timescales) are broken by local “displacements” where time is held constant, i.e., modifications occurring in living systems. Such displacements stand for brief local forces, able to temporarily “break” the cosmic increase in entropy. The force able to restore the symmetries (called “gauge field”) stands for the very long timescales of biological evolution. Therefore, at the very low speeds of life evolution, time is no longer one of the four phase space coordinates of a spacetime Universe: but it becomes just a gauge field superimposed to three-dimensional biological systems. We discuss the implications in biology: when assessing living beings, the underrated role of isolated “spatial” modifications needs to be emphasized, living apart the evolutionary role of time.","authors":["Arturo Tozzi","James F Peters","Clifford Chafin","Domenico de Falco"],"meta":["December 2017Progress in Biophysics and Molecular Biology 134","DOI:10.1016/j.pbiomolbio.2017.12.002","Projects: Theoretical BiologyTopology and brain (my papers)My physical papers"],"references":["318544688_Towards_a_more_global_understanding_of_development_and_evolution","317619297_Cellular_gauge_symmetry_and_the_Li_organization_principle_General_considerations","313108523_Towards_Topological_Mechanisms_Underlying_Experience_Acquisition_and_Transmission_in_the_Human_Brain","301636784_Building_a_minimum_frustration_framework_for_brain_functions_in_long_timescales","297679077_Towards_a_Neuronal_Gauge_Theory","275350990_How_can_we_study_reasoning_in_the_brain","273452923_Information_processing_in_the_CNS_a_supramolecular_chemistry","300055383_Quantum_Field_Theory","267672003_Les_connexions_infinitesimales_dans_un_espace_fibre_differentiable","265681688_Quantum_Theory_of_Gravity_II_The_Manifestly_Covariant_Theory"]}