{"id":"321766197_O_estudo_e_a_identificacao_dos_padroes_de_metadados_para_a_representacao_e_a_recuperacao_da_imagem_digital_na_perspectiva_da_web","abstract":"Os suportes da informação são utilizados pelo homem desde o\nprincípio de sua criação como pilar da sua própria existência, permitindo a transmissão de ideologias às gerações futuras e contribuindo para a evolução da humanidade. A imagem é uma forma de comunicação e registro da memória, que, permeadas pelas Tecnologias da Informação e Comunicação (TIC),\npossibilitou a expansão de formas de registro, as imagens digitais. A crescente produção e o uso de informações imagéticas digitais, sobremaneira no contexto da web, gera a necessidade de encontrar soluções para o estabelecimento de parâmetros que propiciem a descrição e o acesso aos recursos imagéticos. O\nobjetivo geral desta pesquisa consiste na identificação e no mapeamento dos padrões de metadados para o recurso imagético digital, pautando-se no Tratamento de Recursos Imagéticos (TRI), de modo a propiciar a recuperação\nmais efetiva das informações no domínio web. Caracteriza-se como uma metodologia exploratória e descritiva, com o intuito de mapear os padrões para a representação de imagens digitais e seus atributos, relacionando-os aos aspectos\nintrínsecos à web. Como resultados, são apresentados o mapeamento e a categorização dos padrões de metadados, que abrangem Dublin Core, MARC21, MODS, MIX, IPTC, Core VRA, XMP e PLUS, e aponta-se um corpus teórico referente aos conceitos e procedimentos para formas de representação e\ndescrição da imagem digital no âmbito da web pautado na literatura científica da área de Biblioteconomia, Ciência da Informação e Ciência da Computação. Dessa forma, sublinha-se que as formas convencionais e tradicionais da Ciência da Informação, principalmente no que tange ao tratamento de recursos informacionais, podem propiciar uma melhora no desempenho de recuperação de informações imagéticas digitais em ambientes informacionais.","authors":["Gabriela Aparecida da Cunha Yamane","Fabiano Ferreira de Castro"],"meta":["December 2017Em Questão 24(1):145","DOI:10.19132/1808-5245241.145-173"],"references":["330296175_A_INTEROPERABILIDADE_DOS_SISTEMAS_DE_INFORMACAO_SOB_O_ENFOQUE_DA_ANALISE_SINTATICA_E_SEMANTICA_DE_DADOS_NA_WEB","26349885_A_sociedade_da_informacao_e_seus_desafios","242616107_The_fundamentals_of_digital_image_processing_prentice-hall","28804740_FRBR_-_Requisitos_Funcionais_para_Registros_Bibliograficos_um_estudo_no_catalogo_da_Rede_Bibliodata"]}