{"id":"321788243_Leveraging_uncertainty_information_from_deep_neural_networks_for_disease_detection","abstract":"Deep learning (DL) has revolutionized the field of computer vision and image processing. In medical imaging, algorithmic solutions based on DL have been shown to achieve high performance on tasks that previously required medical experts. However, DL-based solutions for disease detection have been proposed without methods to quantify and control their uncertainty in a decision. In contrast, a physician knows whether she is uncertain about a case and will consult more experienced colleagues if needed. Here we evaluate drop-out based Bayesian uncertainty measures for DL in diagnosing diabetic retinopathy (DR) from fundus images and show that it captures uncertainty better than straightforward alternatives. Furthermore, we show that uncertainty informed decision referral can improve diagnostic performance. Experiments across different networks, tasks and datasets show robust generalization. Depending on network capacity and task/dataset difficulty, we surpass 85% sensitivity and 80% specificity as recommended by the NHS when referring 0-20% of the most uncertain decisions for further inspection. We analyse causes of uncertainty by relating intuitions from 2D visualizations to the high-dimensional image space. While uncertainty is sensitive to clinically relevant cases, sensitivity to unfamiliar data samples is task dependent, but can be rendered more robust.","authors":["Christian Leibig","Vaneeda Allken","Murat Seckin Ayhan","Philipp Berens"],"meta":["December 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-17876-z"],"references":["305646054_Convolutional_Neural_Networks_for_Diabetic_Retinopathy","304914068_Automated_analysis_of_retinal_imaging_using_machine_learning_techniques_for_computer_vision","329650090_Gaussian_Processes_for_Machine_Learning","319770378_Explaining_and_harnessing_adversarial_examples","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","312698868_Fast_Predictive_Image_Registration","311430201_Simple_and_Scalable_Predictive_Uncertainty_Estimation_using_Deep_Ensembles","311164170_Development_and_Validation_of_a_Deep_Learning_Algorithm_for_Detection_of_Diabetic_Retinopathy_in_Retinal_Fundus_Photographs","309553422_Deep_Gaussian_Processes"]}