{"id":"321760586_A_CONCEPTUAL_FRAMEWORK_TO_IMPLEMENT_GAMIFICATION_ON_ONLINE_COURSES_OF_COMPUTER_PROGRAMMING_LEARNING_IMPLEMENTATION","abstract":"The programming learning is one of the main areas on informatics teaching, through which a student acquires competences on practice and conceptual levels. However, several problems have been reported on literature related to the programming learning. Problems associated to the curriculum, language choice, attitude facing programming, cognitive factors, styles of learning, motivation, among others. (Pears, et. al, 2007), (Jenkins, 2002), (Lahtinem, et.al.), (Denning, & McGettrick, 2005), (Kinnunem & Malmi, 2006), (Rahmat et. al., 2012). Based on this problem authors defined the following objectives: a) to study the difficulties visualized during programming learning; b) to propose a gamification conceptual solution; c) implementation of the conceptual solution; d) evaluation of the impact of gamification on learning. Within the scope of this publication, authors presented and described the implementation of a framework and the observed impact of gamification on programming learning. Programming is one of the core competences for students of technology areas related to informatics. The comprehension of the basic concepts is a fundamental pillar for the evolution in learning and the related problems have been object of study, being necessary to continue studying and exploring the related problems with learning, (Rahmat et. al., 2012). Informatics area is constantly being updated and the approaches to teaching/ learning of programming must accompany this update. For example, approaches that seek to focus the student in learning and that will help to improve the perception of the difficulty of the matter are necessary. As examples of these approaches we have the graphic visualization tools, the use of robots and the recent gamification solutions, (Helminen et.al, 2010), (Sorva et. al., 2010), (McGill, M, 2012), (Ibáñez, et. al, 2014). However, the knowledge about the effect of gamification on students’ performance is still scarce, (Dicheva, et. al, 2015). The authors recommend that more research should be carried out integrating one or two gamification elements and to identify the extent to which these elements influence performance. Within the scope of this work the adopted methodologic approach was the following one: a) literature review related to problems in programming learning process, proposed solutions as a support to programming learning and gamification in educational context; b) identification of the starting questions; c) which are the elements/ characteristics of gamification used on educational context; d) which are the gamification elements that could influence performance. From the research questions the following objectives were defined: a) design and implementation of a gamification framework to online programming teaching; b) and the identification of student’s perceptions after attending the gamification course. In order to fulfill the objectives, an online course of fundamentals of programming was designed and implemented, based on the previously proposed framework having then been launched a questionnaire to the students who attended the online course. The main contribution of this work is an implementation of the framework and its evaluation in a specific context, an online programming learning course. We hope to contribute to encourage changes in teaching practices in programming teaching.","authors":["Martinha Piteira","Carlos J. Costa","Manuela Aparicio"],"meta":["November 2017","DOI:10.21125/iceri.2017.1865","Conference: 10th annual International Conference of Education, Research and Innovation","Project: Gamification in Education: Learning Computer Programming"],"references":["270273830_Gamification_in_Education_A_Systematic_Mapping_Study","266398023_Gamification_in_Theory_and_Action_A_Survey","265789392_Gamification_for_Engaging_Computer_Science_Students_in_Learning_Activities_A_Case_Study","262395542_An_experience_report_on_using_gamification_in_technical_higher_education","257716774_Major_Problems_in_Basic_Programming_that_Influence_Student_Performance","254008065_The_Curriculum_Planning_Process_for_Undergraduate_Game_Degree_Programs_in_the_United_Kingdom_and_United_States","303664831_Playing_seriously_-_How_gamification_and_social_cues_influence_bank_customers_to_use_gamified_e-business_applications","287068595_Beyond_designing_for_motivation_The_importance_of_context_in_gamification","273946893_For_the_Win_How_Game_Thinking_can_Revolutionize_your_Business","230854793_The_Gamification_of_Learning_and_Instruction_Game-based_Methods_and_Strategies_for_Training_and_Eduction"]}