{"id":"321774472_Skipping_the_real_world_Classification_of_PolSAR_images_without_explicit_feature_extraction","abstract":"The typical processing chain for pixel-wise classification from PolSAR images starts with an optional preprocessing step (e.g. speckle reduction), continues with extracting features projecting the complex-valued data into the real domain (e.g. by polarimetric decompositions) which are then used as input for a machine-learning based classifier, and ends in an optional postprocessing (e.g. label smoothing). The extracted features are usually hand-crafted as well as preselected and represent (a somewhat arbitrary) projection from the complex to the real domain in order to fit the requirements of standard machine-learning approaches such as Support Vector Machines or Artificial Neural Networks. This paper proposes to adapt the internal node tests of Random Forests to work directly on the complex-valued PolSAR data, which makes any explicit feature extraction obsolete. This approach leads to a classification framework with a significantly decreased computation time and memory footprint since no image features have to be computed and stored beforehand. The experimental results on one fully-polarimetric and one dual-polarimetric dataset show that, despite the simpler approach, accuracy can be maintained (decreased by only less than 2% for the fully-polarimetric dataset) or even improved (increased by roughly 9% for the dual-polarimetric dataset). © 2017 International Society for Photogrammetry and Remote Sensing, Inc. (ISPRS).","authors":["Ronny Hänsch","Olaf Hellwich"],"meta":["December 2017ISPRS Journal of Photogrammetry and Remote Sensing 140","DOI:10.1016/j.isprsjprs.2017.11.022"],"references":["312430516_Statistical_models_for_SAR_amplitude_data_A_unified_vision_through_Mellin_transform_and_Meijer_functions","311164761_Polarimetric_SAR_Image_Classification_Using_Deep_Convolutional_Neural_Networks","308862203_Evaluation_of_tree_creation_methods_within_random_forests_for_classification_of_PolSAR_images","286689609_Kernel-based_classification_in_complex-valued_feature_spaces_for_polarimetric_SAR_data","271275883_Tensorial_Independent_Component_Analysis-Based_Feature_Extraction_for_Polarimetric_SAR_Data_Classification","264564101_Features_Color_Spaces_and_Boosting_New_Insights_on_Semantic_Classification_of_Remote_Sensing_Images","260836261_Nonlinear_Compressed_Sensing-Based_LDA_Topic_Model_for_Polarimetric_SAR_Image_Classification","260623343_Texture_Classification_of_PolSAR_Data_Based_on_Sparse_Coding_of_Wavelet_Polarization_Textons"]}