{"id":"321745166_StaticDynamic_Filtering_for_Mesh_Geometry","abstract":"The joint bilateral filter, which enables feature-preserving signal smoothing according to the structural information from a guidance, has been applied for various tasks in geometry processing. Existing methods either rely on a static guidance that may be inconsistent with the input and lead to unsatisfactory results, or a dynamic guidance that is automatically updated but sensitive to noises and outliers. Inspired by recent advances in image filtering, we propose a new geometry filtering technique called static/dynamic filter, which utilizes both static and dynamic guidances to achieve state-of-the-art results. The proposed filter is based on a nonlinear optimization that enforces smoothness of the signal within designated neighborhoods, while preserving signal variations that correspond to features of certain scales. We develop an efficient iterative solver for the problem, which unifies existing filters that are based on static or dynamic guidances. The filter can be applied to mesh face normals followed by vertex position update, to achieve scale-aware and feature-preserving filtering of mesh geometry. It also works well for other types of signals defined on mesh surfaces, such as texture colors. Extensive experimental results demonstrate the effectiveness of the proposed filter for various geometry processing applications such as mesh denoising, geometry feature enhancement, and texture color filtering.","authors":["Juyong Zhang","Bailin Deng","Yang Hong","Yue Peng"],"meta":["December 2017IEEE Transactions on Visualization and Computer Graphics PP(99)","DOI:10.1109/TVCG.2018.2816926"],"references":["276337736_Variational_Mesh_Denoising_Using_Total_Variation_and_Piecewise_Constant_Function_Space","262452442_A_General_Framework_for_Bilateral_and_Mean_Shift_Filtering","262148045_Introduction_to_Geometric_Processing_through_Optimization","313634582_Image_smoothing_via_L0_gradient_minimization","308813992_Robust_image_filtering_using_joint_static_and_dynamic_guidance","302925609_Mesh_denoising_via_L0_minimization","289845213_Rolling_Guidance_Filter","283564926_Rolling_Guidance_Normal_Filter_for_Geometric_Processing","282940705_Guided_Mesh_Normal_Filtering","274480293_Bilateral_Texture_Filtering"]}