{"id":"321753623_Les_bouquets_de_services_un_concept_cle_pour_raisonner_l'avenir_des_territoires_d'elevage","abstract":"L’élevage représente une activité majeure dans nombre de territoires ruraux européens. Au-delà des controverses sur les conséquences environnementales de l’élevage, et sur les conditions de vie et d’abattage des animaux, il rend différents services à la société qu’il convient de révéler, et si possible de quantifier. Le cadre conceptuel des bouquets de services permet de considérer la coexistence d’effets positifs et négatifs de l’élevage à un instant donné sur un territoire. L’augmentation d’un service impliquant en général la diminution d’autres, ce cadre permet d’identifier les compromis à considérer au sein des territoires. Aux échelles larges (de la petite région agricole à l’Europe), on constate souvent un antagonisme entre production et emploi d’une part, services environnementaux et culturels d’autre part. Les cartographies de services révèlent l’effet des systèmes dominants dans les territoires, mais ne prennent pas en compte la coexistence avec des systèmes de niche, dont les contributions positives sont largement masquées. Une analyse à des échelles plus fines (bassin versant, canton, exploitation) montre qu’il est possible de dépasser ces antagonismes en prenant en compte les temporalités, l’hétérogénéité spatiale, et les interactions techniques ou organisationnelles entre différents types de systèmes d’élevage (et de cultures) d’un même territoire. Des modélisations aux échelles larges permettent de simuler de manière prospective les conséquences du changement climatique et d’évolutions plus tranchées des modes de production et de consommation. L’alimentation humaine – au travers de la part des protéines d’origine animale – et l’alimentation animale – du fait de son impact sur l’usage des terres – ont un poids décisif dans ces scénarios. Nous concluons en proposant des pistes de réflexions afin de mieux valoriser la diversité des services fournis par l’élevage.","authors":["Bertrand Dumont","Julie Ryschawy","Michel Duru","Marc Benoit"],"meta":["December 2017Productions Animales -Paris- Institut National de la Recherche Agronomique- 30(4):407-422","DOI:10.20870/productions-animales.2017.30.4.2271","Projects: INRA challenge on ecosystem services (EcoServ)Role, impacts and services provided by European livestock production"],"references":["341786438_Creation_et_distribution_de_valeur_economique_dans_les_filieres_de_fromage_AOP","328158499_Enjeux_et_atouts_des_productions_animales_sous_signe_officiel_de_qualite_pour_repondre_aux_attentes_societales","328156806_Quelles_concurrences_et_synergies_entre_cultures_et_elevage_dans_les_territoires_de_polyculture-elevage","321753402_L'Irlande_un_territoire_porte_par_l'elevage_laitier_dans_des_conditions_de_milieu_favorable_et_de_marches_incertains","321622541_Des_services_contrastes_rendus_par_l'elevage_dans_les_espaces_urbains_et_periurbains_europeens","321533588_La_diversite_des_services_rendus_par_les_territoires_d'elevage_herbagers_fournissant_des_produits_de_qualite_dans_des_environnements_preserves","321369556_Diversite_des_services_rendus_par_les_territoires_a_forte_densite_d'elevages_trois_cas_d'etude_en_Europe","320830203_Une_typologie_pour_representer_la_diversite_des_territoires_d'elevage_en_Europe","320806012_La_grange_un_cadre_conceptuel_pour_apprehender_les_bouquets_de_services_rendus_par_l'elevage_dans_les_territoires","316989007_Une_expertise_scientifique_collective_analyse_les_roles_impacts_et_services_issus_des_elevages_en_Europe"]}