{"id":"321823463_Cellular_Automata_Applications_in_Shortest_Path_Problem","abstract":"Cellular Automata (CAs) are computational models that can capture the essential features of systems in which global behavior emerges from the collective effect of simple components, which interact locally. During the last decades, CAs have been extensively used for mimicking several natural processes and systems to find fine solutions in many complex hard to solve computer science and engineering problems. Among them, the shortest path problem is one of the most pronounced and highly studied problems that scientists have been trying to tackle by using a plethora of methodologies and even unconventional approaches. The proposed solutions are mainly justified by their ability to provide a correct solution in a better time complexity than the renowned Dijkstra's algorithm. Although there is a wide variety regarding the algorithmic complexity of the algorithms suggested, spanning from simplistic graph traversal algorithms to complex nature inspired and bio-mimicking algorithms, in this chapter we focus on the successful application of CAs to shortest path problem as found in various diverse disciplines like computer science, swarm robotics, computer networks, decision science and biomimicking of biological organisms' behaviour. In particular, an introduction on the first CA-based algorithm tackling the shortest path problem is provided in detail. After the short presentation of shortest path algorithms arriving from the relaxization of the CAs principles, the application of the CA-based shortest path definition on the coordinated motion of swarm robotics is also introduced. Moreover, the CA based application of shortest path finding in computer networks is presented in brief. Finally, a CA that models exactly the behavior of a biological organism, namely the Physarum's behavior, finding the minimum-length path between two points in a labyrinth is given.","authors":["Michail-Antisthenis Tsompanas","Nikolaos I Dourvas","Konstantinos Ioannidis","Georgios Ch. Sirakoulis"],"meta":["December 2017"],"references":["314593932_Cellular_Automata_Models_Simulating_Slime_Mould_Computing","314258055_Towards_implementation_of_Cellular_Automata_in_Microbial_Fuel_Cells","309729843_A_Self-Driving_Robot_Using_Deep_Convolutional_Neural_Networks_on_Neuromorphic_Hardware","318195768_Cellular_Automaton_Belousov-Zhabotinsky_Model_for_Binary_Full_Adder","316582956_FPGA_processor_with_GPS_for_modelling_railway_traffic_flow","314605607_Parallel_Acceleration_of_Slime_Mould_Discrete_Models","309319199_Modeling_Passengers_Boarding_in_Aircraft_Using_Cellular_Automata","308271344_Game_of_Life_Variations_for_Image_Scrambling","307446152_Parallel_Fuzzy_Cellular_Automata_for_Data-Driven_Simulation_of_Wildfire_Spreading","301951042_Multi-Resolution_Hierarchical_Motion_Planner_for_Multi-Robot_Systems_on_Spatiotemporal_Cellular_Automata"]}