{"id":"321832598_An_optimized_approach_for_simultaneous_horizontal_data_fragmentation_and_allocation_in_Distributed_Database_Systems_DDBSs","abstract":"With the substantial ever-upgrading advancement in data and information management field, Distributed Database System (DDBS) is still proven to be the most growingly-demanded tool to handle the accompanied constantly-piled volumes of data. However, the efficiency and adequacy of DDBS is profoundly correlated with the reliability and precision of the process in which DDBS is set to be designed. As for DDBS design, thus, several strategies have been developed, in literature, to be used in purpose of promoting DDBS performance. Off these strategies, data fragmentation, data allocation and replication, and sites clustering are the most immensely-used efficacious techniques that otherwise DDBS design and rendering would be prohibitively expensive. On one hand, an accurate well-architected data fragmentation and allocation is bound to incredibly increase data locality and promote the overall DDBS throughputs. On the other hand, finding a practical sites clustering process is set to contribute remarkably in reducing the overall Transmission Costs (TC). Consequently, consolidating all these strategies into one single work is going to undoubtedly satisfy a massive growth in DDBS influence. In this paper, therefore, an optimized heuristic horizontal fragmentation and allocation approach is meticulously developed. All the drawn-above strategies are elegantly combined into a single effective approach so as to an influential solution for DDBS productivity promotion is set to be markedly fulfilled. Most importantly, an internal and external evaluations are extensively illustrated. Obviously, findings of conducted experiments have maximally been recorded to be in favor of DDBS performance betterment.","authors":["Ali A. Amer","Adel A. Sewisy","Taha M.A. Elgendy"],"meta":["January 2018Heliyon 3(12)","DOI:10.1016/j.heliyon.2017.e00487","Project: Optimizing dynamic data allocation in DDBSs using Meta-heuristic-based requirements selection technique"],"references":["267184697_A_New_Approach_for_Database_Fragmentation_and_Allocation_to_Improve_the_Distributed_Database_Management_System_Performance_A_New_Approach_for_Database_Fragmentation_and_Allocation_to_Improve_the_Distr","315329894_Incremental_Data_Allocation_and_Reallocation_in_Distributed_Database_Systems","313113705_A_Novel_Query-Driven_Clustering-Based_Technique_for_Vertical_Fragmentation_and_Allocation_in_Distributed_Database_Systems","312059884_An_extended_efficient_approach_to_dynamic_fragment_allocation_in_distributed_database_systems","305950944_A_Replication_Scheme_for_Multiple_Fragmentations_with_Overlapping_Fragments","300787574_Horizontal_Fragmentation_and_Replication_for_Multiple_Relaxation_Attributes","283228018_Hybridized_fragmentation_of_very_large_databases_using_clustering","282375850_Query_Interaction_Based_Approach_for_Horizontal_Data_Partitioning","276276283_A_synchronized_design_technique_for_efficient_data_distribution","272413549_Designing_High_Performance_Web-Based_Computing_Services_to_Promote_Telemedicine_Database_Management_System"]}