{"id":"321812783_Modeling_Neutrosophic_Data_by_Self-Organizing_Feature_Map_MANETs_Data_Case_Study","abstract":"Network security is a major research area for both scientists and business. Intrusion Detection System (IDS) is one of the most\nchallenging problems in Mobile Ad Hoc Networks (MANETs). The main reason resides behind the changing and uncertain nature\nof MANETs networks. Hence, a compensate evolving in the IDS would be converting the whole system to rely on uncertainty and\nindeterminacy concepts. These concepts are the main issues in the fuzzy system and consequently in neutrosophic system. In\nneutrosophic system, each attack is determined by MEMEBERSHIP, INDETERMINACY and NONMEMEBERSHIP degrees. The main obstacle is that most data available are regular values which are not suitable for neutrosophic calculation. This paper is\nconcerned by the preprocessing phase of the neutrosophic knowledge discovery system. Converting the regular data to neutrosophic\nvalues is a problem of generating the MEMEBERSHIP, NONMEMEBERSHIP and INDETERMINACY functions for each\nvariable in the system. Self-Organized Feature Maps (SOFM) are unsupervised artificial neural networks that were used to build\nfuzzy MEMEBERSHIP function, hence they could be utilized to define the neutrosophic variable as well. SOFMs capabilities to cluster inputs using self-adoption techniques have been utilized in generating neutrosophic functions for the subsets of the variables. The SOFM are used to define the MEMEBERSHIP, NONMEMEBERSHIP and INDETERMINACY functions of the KDD network attacks data available in the UCI machine learning repository for further processing in knowledge discovery. Experimental results show the features and their corresponding functions.","authors":["Haitham Elwahsh","Mona Gamal","A. A. Salama","Ibrahim Mahmoud El-henawy"],"meta":["January 2017Procedia Computer Science 121:152-159","DOI:10.1016/j.procs.2017.11.021","Project: New Trends in Neutrosophic Theory and Applications"],"references":["310829564_Neutrosophic_Crisp_Set_Theory","308789702_Review_of_Recommender_Systems_Algorithms_Utilized_in_Social_Networks_based_e-Learning_Systems_Neutrosophic_System","306072178_Security_Issues_in_Mobile_Ad_Hoc_Networks","299892017_Neutrosophic_Crisp_Probability_Theory_Decision_Making_Process","299712728_Neutrosophic_Features_for_Image_Retrieval","277140556_Design_and_Implementation_of_Neutrosophic_Data_Operations_Using_Object_Oriented_Programming","268444118_Neutrosophic_Set_-_A_Generalization_of_the_Intuitionistic_Fuzzy_Set","312626900_Measurement_of_membership_functions_Theoretical_and_empirical_work","270819588_Self-Organizing_Maps","263603644_The_self-organizing_map"]}