{"id":"321879269_Parallel_Ellipsoidal_Perfectly_Matched_Layers_for_Acoustic_Helmholtz_Problems_on_Exterior_Domains","abstract":"Exterior acoustic problems occur in a wide range of applications, making the finite element analysis of such problems a common practice in the engineering community. Various methods for truncating infinite exterior domains have been developed, including absorbing boundary conditions, infinite elements, and more recently, perfectly matched layers (PML). PML are gaining popularity due to their generality, ease of implementation, and effectiveness as an absorbing boundary condition. PML formulations have been developed in Cartesian, cylindrical, and spherical geometries, but not ellipsoidal. In addition, the parallel solution of PML formulations with iterative solvers for the solution of the Helmholtz equation, and how this compares with more traditional strategies such as infinite elements, has not been adequately investigated.\nIn this paper, we present a parallel, ellipsoidal PML formulation for acoustic Helmholtz problems. To faciliate the meshing process, the ellipsoidal PML layer is generated with an on-the-fly mesh extrusion. Though the complex stretching is defined along ellipsoidal contours, we modify the Jacobian to include an additional mapping back to Cartesian coordinates in the weak formulation of the finite element equations. This allows the equations to be solved in Cartesian coordinates, which is more compatible with existing finite element software, but without the necessity of dealing with corners in the PML formulation. Herein we also compare the conditioning and performance of the PML Helmholtz problem with infinite element approach that is based on high order basis functions. On a set of representative exterior acoustic examples, we show that high order infinite element basis functions lead to an increasing number of Helmholtz solver iterations, whereas for PML the number of iterations remains constant for the same level of accuracy. This provides an additional advantage of PML over the infinite element approach.","authors":["Gregory Bunting","Arun Prakash","Timothy Walsh","Clark Dohrmann"],"meta":["December 2017Journal of Computational Acoustics","DOI:10.1142/S0218396X18500157"],"references":["315063196_Infinite_Elements_and_Their_Influence_on_Normal_and_Radiation_Modes_in_Exterior_Acoustics","263932390_An_efficient_time-domain_perfectly_matched_layers_formulation_for_elastodynamics_on_spherical_domains","313245998_Transient_wave_envelope_elements_for_wave_problems","311361136_This_Submission_is_for_Special_Issue_on_Underwater_Acoustics_Perfectly_Matched_Layer_Technique_for_Parabolic_Equation_Models_in_Ocean_Acoustics","305336158_Hybrid_Finite_Element_Method_and_Variational_Theory_of_Complex_Rays_for_Helmholtz_Problems","284790885_Comparison_of_Constant_and_Discontinuous_Quadratic_Boundary_Elements_for_Exterior_Axisymmetric_Acoustic-Wave_Propagation_Problems","272320170_Three-dimensional_wave-envelope_elements_of_variable_order_for_acoustic_radiation_and_scattering_Part_II_Formulation_in_the_time_domain","267439519_Sweeping_preconditioners_for_elastic_wave_propagation_with_spectral_element_methods","263902323_Radiation_boundary_conditions_for_the_Helmholtz_equation_for_ellipsoidal_prolate_spheroidal_oblate_spheroidal_and_spherical_domain_boundaries","263797197_A_comparison_of_transient_infinite_elements_and_transient_kirchhoff_integral_methods_for_far_field_acoustic_analysis"]}