{"id":"321811906_Blockchain_based_financial_case_analysis_and_its_implications","abstract":"Purpose\n\nIn Korea and abroad, this paper investigates the use of blockchains in the financial sector. This study aims to examine how blockchains are applied to the financial sector and how to respond to the Korean conditions.\n\nDesign/methodology/approach\n\nThis paper investigates the movements of the financial sector and related services using the blockchain in the current market.\n\nFindings\n\nFirst, as a result of examining domestic and foreign cases, it can be seen that the areas where blockchains are most actively applied in the financial sector are expanding into settlement, remittance, securities and smart contracts. Also, in Korea, many of the authentication procedures based on the equipment possessed by the consumers are used so that introduction of the blockchain in the authentication part is prominent. Second, the move to introduce a closed (private) distributed ledger that does not go through the central bank is accelerating in payments between banks. Third, domestic financial institutions also need joint action by financial institutions through a blockchain consortium to apply blockchain technology to the financial sector. Fourth, consumer needs and technological developments are changing. At the same time, as the opportunity to infringe on the information held by individuals has expanded, the need for blockchain technology is strongly emerging because of the efforts of the organizations to defend it.\n\nOriginality/value\n\nThis paper contributes to understanding the changes in the financial sector using the blockchain.","authors":["Soonduck Yoo"],"meta":["December 2017Asia Pacific Journal of Innovation and Entrepreneurship 11(3):312-321","DOI:10.1108/APJIE-12-2017-036"],"references":["261434466_Information_propagation_in_the_Bitcoin_network","325341671_Legal_Issues_for_the_Introduction_of_Distributed_Ledger_Based_on_Blockchain_Technology_-_Focused_On_the_Financial_Industry_-","228640975_Bitcoin_A_Peer-to-Peer_Electronic_Cash_System"]}