{"id":"321823792_Face-from-Depth_for_Head_Pose_Estimation_on_Depth_Images","abstract":"Depth cameras allow to setup reliable solutions for people monitoring and behavior understanding, specially when unstable or poor illumination conditions make unusable common RGB sensors. Therefore, we propose a complete framework for the estimation of the head and shoulder pose based on depth images only. A head detection and localization module is also included, in order to develop a complete end-to-end system. The core element of the framework is a Convolutional Neural Network, called POSEidon+, that receives as input three types of images and provides the 3D angles of the pose as output. Moreover, a Face-from-Depth component based on a Deterministic Conditional GAN model is able to hallucinate a face from the corresponding depth image and we empirically demonstrate that this positively impacts the system performances. We test the proposed framework on two public datasets, namely Biwi Kinect Head Pose and ICT-3DHP, and on Pandora, a new challenging dataset mainly inspired by the automotive setup. Experimental results show that our method overcomes all recent state-of-art works based on both intensity and depth input data, running in real time at more than 30 frames per second.","authors":["Guido Borghi","Matteo Fabbri","Roberto Vezzani","Simone Calderara"],"meta":["December 2017IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99)","DOI:10.1109/TPAMI.2018.2885472"],"references":["320966985_POSEidon_Face-from-Depth_for_Driver_Pose_Estimation","319643046_Improving_Heterogeneous_Face_Recognition_with_Conditional_Adversarial_Networks","319575331_Head_pose_estimation_through_multi-class_face_segmentation","320971086_Deep_Mixture_of_Linear_Inverse_Regressions_Applied_to_Head-Pose_Estimation","320968311_A_Generative_Model_for_Depth-Based_Robust_3D_Facial_Pose_Tracking","320662529_Generative_adversarial_models_for_people_attribute_recognition_in_surveillance","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770355_Generative_Adversarial_Nets","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks"]}