{"id":"321805015_Nearly_free_curves_and_arrangements_a_vector_bundle_point_of_view","abstract":"Many papers are devoted to study logarithmic sheaves associated to reduced divisors, in particular logarithmic bundles associated to plane curves since forty years in differential and algebraic topology or geometry. An interesting family of these curves are the so-called free ones for which the associated logarithmic sheaf is the direct sum of two line bundles. When the curve is a finite set of distinct lines (i.e. a line arrangement), Terao conjectured thirty years ago that its freeness depends only on its combinatorics. A lot of efforts were done to prove it but at this time it is only proved up to 12 lines. If one wants to find a counter example to this conjecture a new family of curves arises naturally: the nearly free curves introduced by Dimca and Sticlaru. We prove here that the logarithmic bundle associated to a nearly free curve possesses a minimal non zero section that vanishes on one single point $P$, called jumping point, and that characterizes the bundle. Then we give a precise description of the behaviour of $P$. In particular we show, based on detailed examples, that the position of $P$ relatively to its corresponding nearly free arrangement of lines may or may not be a combinatorial invariant, depending on the chosen combinatorics.","authors":["Jean Vallès","Simone Marchesi"],"meta":["December 2017Mathematical Proceedings of the Cambridge Philosophical Society 170(1)","DOI:10.1017/S0305004119000318","Project: Free and nearly free projective hypersurfaces"],"references":["317650077_On_the_Splitting_types_of_bundles_of_logarithmic_Vector_Fields_Along_Plane_Curves","274644782_Free_divisors_and_rational_cuspidal_plane_curves","272195327_Free_divisors_in_a_pencil_of_curves","230996405_Logarithmic_bundles_and_Line_arrangements_an_approach_via_the_standardconstruction","321507344_Grundlehren_der_mathematischen_Wissenschaften","319542067_Erratum_Free_divisors_in_a_pencil_of_curves_MR3370110","309050837_Arrangements_of_hyperplanes_and_their_freeness","246895050_Multiarrangements_of_hyperplanes_and_their_freeness","226840642_Some_properties_of_stable_rank-2_vector_bundles_on_Pn","226718038_Bounding_cohomology_groups_of_vector_bundles_on_Pn"]}