{"id":"321806566_MTD-Spamguard_a_moving_target_defense-based_spammer_detection_system_in_social_network","abstract":"Machine learning classifiers are currently the state of the art for spammer detection tasks in SNSs. Note, however, that these classifiers fail to detect adaptive spammers that dynamically change their spamming strategies or behaviors and attempt to pose as legitimate users. In this paper, we propose an efficient spammer detection system (which we call MTD-Spamguard) wherein the notion of MTD is applied to increase the robustness of well-known machine learning classifiers against the adaptive spammers in SNSs. The system introduces a new method of MTD wherein the concept of differential immunity of different classifiers is employed to detect the spammers. To classify a single user in the test dataset, we pick one of the appropriate trained classifiers from multiple classifiers and then use its classification output. To choose the appropriate classifier, we design an effective classifier switching strategy by formulating the interaction of users (normal users and spammers) and detector (which hosts the machine learning classifier) as a repeated Bayesian Stackelberg game. The classifier switching strategy provides strong Stackelberg equilibrium between users and detector, maximizing the accuracy of classification and reducing the misclassification of spammers. The system achieves 30% gain in classification accuracy over the Facebook dataset (constructed in our recent work).","authors":["Jin Ho Park","Shailendra Rathore","Daesung Moon","Jong Hyuk Park"],"meta":["October 2018Soft Computing 22(20)","DOI:10.1007/s00500-017-2976-x","Project: social network security"],"references":["326171058_On_Machine_Learning_and_Programming_Languages","321432580_Optimization_of_sentiment_analysis_using_machine_learning_classifiers","314862113_Detecting_redirection_spam_using_multilayer_perceptron_neural_network","313954479_A_moving_target_defense_approach_to_mitigate_DDoS_attacks_against_proxy-based_architectures","320968636_Universal_Adversarial_Perturbations","319992928_SpamSpotter_An_Efficient_Spammer_Detection_Framework_based_on_Intelligent_Decision_Support_System_on_Facebook","319485670_XSSClassifier_An_Efficient_XSS_Attack_Detection_Approach_Based_on_Machine_Learning_Classifier_on_SNSs","319301344_Multilevel_learning_based_modeling_for_link_prediction_and_users'_consumption_preference_in_Online_Social_Networks","319249403_Social_Network_Security_Issues_Challenges_Threats_and_Solutions","309892105_Moving_target_defense_state_of_the_art_and_characteristics"]}