{"id":"321805979_EXPERIENCIAS_EN_EL_PROCESO_DE_ENSENANZA-APRENDIZAJE_DE_LA_PROGRAMACION_MEDIANTE_ENTORNOS_VIRTUALES","abstract":"RESUMEN\nEste trabajo tiene como objetivo sistematizar las experiencias vividas por las autoras en el desarrollo del proceso de enseñanza-aprendizaje de la programación, en la formación de profesores de Informática, utilizando entornos virtuales de aprendizaje. La sistematización de experiencias permitió recuperar los hechos y realizar una interpretación crítica de lo ocurrido durante la implementación de entornos virtuales. Para interpretar críticamente lo ocurrido, se utilizó la observación al desempeño de los estudiantes, el análisis del registro de calificaciones de los entornos virtuales y los criterios de estudiantes y profesoras, obteniendo una valoración del impacto de la utilización de entornos virtuales en el proceso de enseñanza-aprendizaje de la programación. \nABSTRACT\nThis work aims to systematize the experiences of the authors in the development of the teaching-learning process of programming, in the training of computer science teachers, using virtual learning environments. The systematization of experiences allowed to recover the facts and to make a critical interpretation of what happened during the implementation of the virtual enviroments. In order to interpret critically what happened, we used the observation of student performance, the analysis of the virtual classroom record of qualifications and the criteria of students and teachers, obtaining an assessment of the impact of the use of virtual classrooms in teaching-learning process of programming.","authors":["Emma Regina Fierro Martín","María Amelia Muñoz Pentón","Keila Irene Díaz Tejera"],"meta":["January 2017","Project: El trabajo colaborativo en la identificación y solución de problemas del proceso de enseñanza aprendizaje de la Informática"],"references":["321807433_LA_ANALOGIA_EN_LA_RESOLUCION_DE_PROBLEMAS_EN_EL_PROCESO_DE_ENSENANZA-APRENDIZAJE_DE_LA_PROGRAMACION","316854850_Programas_de_intervencion_para_la_mejora_de_las_competencias_de_aprendizaje_autorregulado_en_educacion_superior","28308735_El_modelo_de_acreditacion_de_carreras_de_la_educacion_superior_cubana"]}