{"id":"321823669_An_SDN_hybrid_architecture_for_vehicular_networks_Application_to_Intelligent_Transport_System","abstract":"Vehicular networks are one of the cornerstone of an Intelligent Transportation System (ITS). They are expected to provide ubiquitous network connectivity to moving vehicles while supporting various ITS services, some with very stringent requirements in terms of latency and reliability. Two vehicular networking technologies are envisioned to jointly support the full range of ITS services : DSRC (Dedicated Short Range Communication) for direct vehicle to vehicle/Road Side Units (RSU) communications and cellular technologies. To the best of our knowledge, approaches from the literature usually divide ITS services on each of these networks according to their requirements and one single network is in charge of supporting the each service. Those that consider both network technologies to offer multi-path routing, load balancing or path splitting for a better quality of experience of ITS services assume obviously separately controlled networks. Under the umbrella of SDN (Software Defined Networking), we propose in this paper a hybrid network architecture that enables the joint control of the networks providing connectivity to multi-homed vehicles and, also, explore the opportunities brought by such an architecture. We show through some use cases, that in addition to the flexibility and fine-grained programmability brought by SDN, it opens the way towards the development of effective network control algorithms that are the key towards the successful support of ITS services and especially those with stringent QoS. We also show how these algorithms could also benefit from information related to the environment or context in which vehicles evolve (traffic density, planned trajectory, ..), which could be easily collected by data providers and made available via the cloud.","authors":["Soufian Toufga","Philippe Owezarski","Slim Abdellatif","Thierry Villemur"],"meta":["December 2017"],"references":["281356798_Data_Communication_in_VANETs_A_Survey_Challenges_and_Applications","261706482_Towards_Software-Defined_VANET_Architectures_and_Services","317566854_SCGRP_SDN-enabled_Connectivity-aware_Geographical_Routing_Protocol_of_VANETs_for_urban_environment","316727502_SDGR_An_SDN-Based_Geographic_Routing_Protocol_for_VANET","308847455_A_Software_Defined_Network_architecture_for_GeoBroadcast_in_VANETs","305871314_DeVANET_Decentralized_Software-Defined_VANET_Architecture","305304586_Channel_congestion_performance_analysis_for_DSRC_vehicle_ad_hoc_network","293079393_From_GSM_to_LTE-Advanced_An_Introduction_to_Mobile_Networks_and_Mobile_Broadband_Second_Edition","224760740_Revisiting_Carrier_Sense_Multiple_Access_with_Collision_Avoidance_CSMACA"]}