{"id":"321888252_Tracking_community_evolution_in_social_networks","abstract":"Recently, social network analysis is gaining on importance and bringing several challenges in the computer science discipline. Most social networks are dynamic and evolve gradually and the communities in these dynamic networks usually have changing members and could grow and shrink over time. The analysis of communities and their evolution is a relevant research domain that attracts researchers from a variety of fields; having suitable information and methods for dynamic analysis, one may challenge to forecast the future of the communities, and then conduct it appropriately in order to attain or modify this predicted future according to precise requirements. This capability would be a strong mechanism used by marketing, human resource managers, personnel recruitment, etc. In this paper, we are analyzing the changes in the dynamic network through tracking and examining the dynamic evolution of communities within a sequence of snapshots. We start by describing some basic dynamic features of social networks. Then, we propose a new technique called CED (Community Evolution Detection) which was developed in order to detect community evolution in the social network. The central elements of this technique are that it greatly depends on key nodes and QuantityInsertion metric. It also focuses on both efficiency and parameter free. We demonstrate the abilities and potential of our approach by testing it in real datasets and compare it with well-known algorithm with regard to complexity, accuracy and flexibility.","authors":["Boujlaleb Loubna","Ali Idarrou","D. Mammass"],"meta":["November 2017Journal of Theoretical and Applied Information Technology 95(22):6127-6137","Projects: multimedia Information Retrieval in semi-structured documentscomplex network, graph theory"],"references":["224567853_Detection_of_local_community_structures_in_complex_dynamic_networks_with_random_walks","221653507_MONIC_-_Modeling_and_monitoring_cluster_transitions","314819165_Natural_communities_in_large_linked_networks","311344563_Finding_community_structure_in_very_large_networks","264587712_NEIWalk_Community_Discovery_in_Dynamic_Content-Based_Networks","262221295_Community_Event_Prediction_in_Dynamic_Social_Networks","257680564_Community_Detection_in_Dynamic_Social_Networks_Based_on_Multiobjective_Immune_Algorithm","253253918_Detecting_Community_Structure_in_Networks","235737467_Algebraic_Connectivity_of_Graphs","221654597_An_event-based_framework_for_characterizing_the_evolutionary_behavior_of_interaction_graphs"]}