{"id":"321813202_Energy_Landscape_and_Pathways_for_Transitions_Between_Watson-Crick_and_Hoogsteen_Base_Pairing_in_DNA","abstract":"The recent discovery that Hoogsteen (HG) base pairs are widespread in DNA across diverse sequences, and positional contexts, could have important implications for understanding DNA replication and DNA-protein recognition. While evidence is emerging that the Hoogsteen conformation could be a thermodynamically accessible conformation of the DNA duplex, and provide a means to expand its functionality, relatively little is known about the molecular mechanism underlying the Watson-Crick to Hoogsteen transition. In this Perspective, we describe pathways and kinetics for this transition at an atomic level of detail, using the energy landscape framework. We show that competition between the duplex conformations results in a double funnel landscape, which explains some recent experimental observations. The interconversion pathways feature a number of intermediates, with a variable number of Watson-Crick and Hoogsteen base pairs. The relatively slow kinetics, with possible deviations from two-state behavior, suggest that this conformational switch is likely to be a difficult target for both simulation and experiment.","authors":["Debayan Chakraborty","David J. Wales"],"meta":["December 2017Journal of Physical Chemistry Letters 9(1)","DOI:10.1021/acs.jpclett.7b01933"],"references":["321048978_How_accurate_are_accurate_force-fields_for_B-DNA","315777054_Sequence_dependency_of_canonical_base_pair_opening_in_the_DNA_double_helix","312361658_How_accurate_are_accurate_force-fields_for_B-DNA","311328993_Probing_helical_transitions_in_a_DNA_duplex","301335304_Long-timescale_dynamics_of_the_Drew-Dickerson_dodecamer","284022716_Parmbsc1_A_refined_force_field_for_DNA_simulations","280910837_Free_energy_landscape_and_transition_pathways_from_Watson-Crick_to_Hoogsteen_base_pairing_in_free_duplex_DNA","316623680_Exploring_biomolecular_energy_landscapes","315885770_Probing_helical_transitions_in_a_DNA_duplex","303982690_Assessing_the_Current_State_of_Amber_Force_Field_Modifications_for_DNA"]}