{"id":"321874484_A_Novel_Robotic_Platform_for_Aerial_Manipulation_Using_Quadrotors_as_Rotating_Thrust_Generators","abstract":"We propose a novel robotic platform for aerial operation and manipulation, SmQ (spherically-connected multi-quadrotor) platform, which consists of a rigid frame and multiple quadrotors, that are connected to the frame via passive spherical joints and act as distributed rotating thrust generators to collectively propel the frame by adjusting their attitude and thrust force. Depending on the number of quadrotors and their configuration, this SmQ platform can fully (or partially) overcome the issues of under-actuation of the standard multi-rotor drones for aerial operation/manipulation (e.g., body-tilting with side-way gust/force, dynamic interaction hard to attain, complicated arm-drone integration, etc.). We present the dynamics modeling of this SmQ platform system and establish the condition for its full-actuation in SE(3). We also show how to address the limited range of spherical joints and rotor saturations as a constrained optimization problem by noticing the similarity with multi-fingered grasping problem under friction-cone constraint. We then design and analyze feedback control laws for the S3Q and S2Q systems as a combination of high-level Lyapunov control design and low-level constrained optimization; and show that the (fully-actuated) S3Q system can assume any trajectory in SE(3), whereas the S2Q system in 3 ×S 2 with its un-actuated dynamics still internally stable. Experiments are also performed to show the efficacy of the theory.","authors":["Hai-Nguyen Nguyen","Sangyul Park","Junyoung Park","Dongjun Lee"],"meta":["February 2018IEEE Transactions on Robotics 34(2):353-369","DOI:10.1109/TRO.2018.2791604"],"references":["314584837_Dynamics_Control_and_Planning_for_Cooperative_Manipulation_of_Payloads_Suspended_by_Cables_from_Multiple_Quadrotor_Robots","311755244_Modeling_and_control_of_FAST-Hex_A_fully-actuated_by_synchronized-tilting_hexarotor","310829525_Motion_Planning_for_6-D_Manipulation_with_Aerial_Towed-cable_Systems","320255366_Dexterous_Aerial_Robots-Mobile_Manipulation_Using_Unmanned_Aerial_Systems","319770298_A_Mathematical_Introduction_to_Robotic_Manipulation","311755084_Design_modeling_and_control_of_omni-directional_aerial_robot","310830377_Cooperative_manipulation_and_transportation_with_aerial_robots","308063337_Design_and_Modeling_of_Dexterous_Aerial_Manipulator","307204779_Global_exponential_attitude_tracking_controls_on_so_3","305923226_Estimation_Control_and_Planning_for_Autonomous_Aerial_Transportation"]}