{"id":"321877414_Bee-Inspired_Protocol_Engineering_From_Nature_to_Networks","abstract":"Honey bee colonies demonstrate robust adaptive efficient agent-based communications and task allocations without centralized controls – desirable features in network design. This book introduces a multipath routing algorithm for packet-switched telecommunication networks based on techniques observed in bee colonies. The algorithm, BeeHive, is dynamic, simple, efficient, robust and flexible, and it represents an important step towards intelligent networks that optimally manage resources.\nThe author guides the reader in a survey of nature-inspired routing protocols and communication techniques observed in insect colonies. He then offers the design of a scalable framework for nature-inspired routing algorithms, and he examines a practical application using real networks of Linux routers. He also utilizes formal techniques to analytically model the performance of nature-inspired routing algorithms. In the last chapters of the book, he introduces an immune-inspired security framework for nature-inspired algorithms, and uses the wisdom of the hive for routing in ad hoc and sensor networks. Finally, the author provides a comprehensive bibliography to serve as a reference for nature-inspired solutions to networking problems.\nThis book bridges the gap between natural computing and computer networking. What sets this book apart from other texts on this subject is its natural engineering approach in which the challenges and objectives of a real-world system are identified before its solution, nature-inspired or otherwise, is discussed. This balanced exposition of the book makes it equally suitable for telecommunication network designers and theorists, and computer science researchers engaged with artificial intelligence, agents, and nature-inspired techniques.","authors":["Muddassar Farooq"],"meta":["January 2009Natural Computing Series","DOI:10.1007/978-3-540-85954-3","ISBN: 978-3-540-85953-6"],"references":[]}