{"id":"321884732_Web_of_Science_use_in_published_research_and_review_papers_1997-2017_a_selective_dynamic_cross-domain_content-based_analysis","abstract":"Clarivate Analytics’s Web of Science (WoS) is the world’s leading scientific citation search and analytical information platform. It is used as both a research tool supporting a broad array of scientific tasks across diverse knowledge domains as well as a dataset for large-scale data-intensive studies. WoS has been used in thousands of published academic studies over the past 20 years. It is also the most enduring commercial legacy of Eugene Garfield. Despite the central position WoS holds in contemporary research, the quantitative impact of WoS has not been previously examined by rigorous scientific studies. To better understand how this key piece of Eugene Garfield’s heritage has contributed to science, we investigated the ways in which WoS (and associated products and features) is mentioned in a sample of 19,478 English-language research and review papers published between 1997 and 2017, as indexed in WoS databases. We offered descriptive analyses of the distribution of the papers across countries, institutions and knowledge domains. We also used natural language processingtechniques to identify the verbs and nouns in the abstracts of these papers that are grammatically connected to WoS-related phrases. This is the first study to empirically investigate the documentation of the use of the WoS platform in published academic papers in both scientometric and linguistic terms.","authors":["Kai Li","Jason Rollins","Erjia Yan"],"meta":["December 2017Scientometrics 115(1)","DOI:10.1007/s11192-017-2622-5"],"references":["319920245_Data_set_mentions_and_citations_A_content_analysis_of_full-text_publications","319135424_Reference_Publication_Year_Spectroscopy_RPYS_of_Eugene_Garfield's_publications","318741575_Statins_and_the_risk_of_cirrhosis_in_hepatitis_B_or_C_patients_A_systematic_review_and_dose-response_meta-analysis_of_observational_studies","313915097_Clarivate_Analytics_Continued_Omnia_vanitas_Impact_Factor_Culture","320241630_Eugene_Garfield's_Scholarly_Impact_A_Scientometric_Review","319021243_MicroRNA-150_as_a_Potential_Biomarker_in_Diagnosis_of_Cancer_a_Meta-Analysis","317663974_Do_usage_counts_of_scientific_data_make_sense_An_investigation_of_the_Dryad_repository","316288184_The_Revised_Child_Anxiety_and_Depression_Scale_A_systematic_review_and_reliability_generalization_meta-analysis","309599390_The_location_of_the_citation_changing_practices_in_how_publications_cite_original_data_in_the_Dryad_Digital_Repository","305388470_Reuse_of_scientific_data_in_academic_publications_An_investigation_of_Dryad_Digital_Repository"]}