{"id":"321902777_Products_of_Euclidean_metrics_and_applications_to_proximity_questions_among_curves","abstract":"The problem of Approximate Nearest Neighbor (ANN) search is fundamental in computer science and has benefited from significant progress in the past couple of decades. However, most work has been devoted to pointsets whereas complex shapes have not been sufficiently treated. Here, we focus on distance functions between discretized curves in Euclidean space: they appear in a wide range of applications, from road segments to time-series in general dimension. For $\\ell_p$-products of Euclidean metrics, for any $p$, we design simple and efficient data structures for ANN, based on randomized projections, which are of independent interest. They serve to solve proximity problems under a notion of distance between discretized curves, which generalizes both discrete Fr\\'{e}chet and Dynamic Time Warping distances. These are the most popular and practical approaches to comparing such curves. We offer the first data structures and query algorithms for ANN with arbitrarily good approximation factor, at the expense of increasing space usage and preprocessing time over existing methods. Query time complexity is comparable or significantly improved by our algorithms; our algorithm is especially efficient when the length of the curves is bounded.","authors":["Ioannis Z Emiris","Ioannis Psarros"],"meta":["December 2017"],"references":["312041857_Randomized_Embeddings_with_Slack_and_High-Dimensional_Approximate_Nearest_Neighbor","269117128_Low-quality_dimension_reduction_and_high-dimensional_Approximate_Nearest_Neighbor","319770399_Approximate_nearest_neighbors_towards_removing_the_curse_of_dimensionality","312084761_Optimal_Hashing-based_Time-Space_Trade-offs_for_Approximate_Near_Neighbors","309719165_Fast_construction_of_nets_in_low_dimensional_metrics_and_their_applications","227619265_On_variants_of_the_Johnson-Lindenstrauss_lemma","220983736_Approximate_nearest_neighbor_algorithms_for_Frechet_distance_via_product_metrics","220431068_Space-Time_Tradeoffs_for_Approximate_Nearest_Neighbor_Searching","44024128_Nearest_Neighbor_Search_the_Old_the_New_and_the_Impossible"]}