{"id":"321915391_DeepSynergy_Predicting_anti-cancer_drug_synergy_with_Deep_Learning","abstract":"Motivation: \nWhile drug combination therapies are a well-established concept in cancer treatment, identifying novel synergistic combinations is challenging due to the size of combinatorial space. However, computational approaches have emerged as a time- and cost-efficient way to prioritize combinations to test, based on recently available large-scale combination screening data. Recently, Deep Learning has had an impact in many research areas by achieving new state-of-the-art model performance. However, Deep Learning has not yet been applied to drug synergy prediction, which is the approach we present here, termed DeepSynergy. DeepSynergy uses chemical and genomic information as input information, a normalisation strategy to account for input data heterogeneity, and conical layers to model drug synergies.\n\nResults: \nDeepSynergy was compared to other machine learning methods such as Gradient Boosting Machines, Random Forests, Support Vector Machines, and Elastic Nets on the largest publicly available synergy data set with respect to mean squared error. DeepSynergy significantly outperformed the other methods with an improvement of 7.2% over the second best method at the prediction of novel drug combinations within the space of explored drugs and cell lines. At this task, the mean Pearson correlation coefficient between the measured and the predicted values of DeepSynergy was 0.73. Applying DeepSynergy for classification of these novel drug combinations resulted in a high predictive performance of an AUC of 0.90. Furthermore, we found that all compared methods exhibit low predictive performance when extrapolating to unexplored drugs or cell lines, which we suggest is due to limitations in the size and diversity of the dataset. We envision that DeepSynergy could be a valuable tool for selecting novel synergistic drug combinations.\n\nAvailability: \nDeepSynergy is available via www.bioinf.jku.at/software/DeepSynergy.\n\nContact: \nklambauer@bioinf.jku.at.\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Kristina Preuer","Rich Lewis","Sepp Hochreiter","Andreas Bender"],"meta":["December 2017Bioinformatics 34(9)","DOI:10.1093/bioinformatics/btx806"],"references":["317425537_Self-Normalizing_Neural_Networks","315799520_Repurposed_high-throughput_images_enable_biological_activity_prediction_for_drug_discovery","311657078_Fulvestrant_reverses_doxorubicin_resistance_in_multidrug-resistant_breast_cell_lines_independent_of_estrogen_receptor_expression","309540723_Approaches_to_modernize_the_combination_drug_development_paradigm","307142445_Systematic_Analysis_of_Quantitative_Logic_Model_Ensembles_Predicts_Drug_Combination_Effects_on_Cell_Signaling_Networks_Systematic_Analysis_of_Quantitative_Logic_Model","305076472_A_Landscape_of_Pharmacogenomic_Interactions_in_Cancer","322561845_Methods_for_High-throughput_Drug_Combination_Screening_and_Synergy_Scoring","312538118_Support-vector_networks","312432923_Regularization_and_Variable_Selection_via_the_Elastic_Nets","306914392_Modeling_of_signaling_crosstalk-mediated_drug_resistance_and_its_implications_on_drug_combination"]}