{"id":"321994673_Haematopietic_stem_cells_--_entropic_landscapes_of_differentiation","abstract":"The metaphor of a potential epigenetic differentiation landscape broadly suggests that during differentiation a stem cell follows the steepest descending gradient toward a stable equilibrium state which represents the final cell type. It has been conjectured that there is an analogy to the concept of entropy in statistical mechanics. In this context, in the undifferentiated state the entropy would be large since fewer constraints exist on the gene expression programs of the cell. As differentiation progresses, gene expression programs become more and more constrained and thus the entropy would be expected to decrease. Such an entropy decrease would, in analogy to statistical mechanics, require some form of free energy to decrease accordingly. In order to assess these predictions, we compute the Shannon entropy for time-resolved single-cell gene expression data in two different experimental setups of haematopoietic differentiation. We find that the behaviour of this entropy measure is in contrast to these predictions. In particular, we find that the Shannon entropy is not a decreasing function of developmental pseudo-time but instead it increases toward the point of commitment before decreasing again. This behaviour is consistent with an increase in gene expression disorder observed in populations sampled at the point of commitment. Single cells in these populations exhibit different combinations of regulator activity that suggest the presence of multiple configurations of a potential differentiation network as a result of multiple entry points into the committed state.","authors":["Karoline Wiesner","Jose Teles","M. Hartnor","C. Peterson"],"meta":["December 2017Interface focus: a theme supplement of Journal of the Royal Society interface 8(6)","DOI:10.1098/rsfs.2018.0040","Project: Applied Information Theory"],"references":["317398498_Single-cell_entropy_for_accurate_estimation_of_differentiation_potency_from_a_cell's_transcriptome","316345553_Processes_on_the_Emergent_Landscapes_of_Biochemical_Reaction_Networks_and_Heterogeneous_Cell_Population_Dynamics_-_Differentiations_in_living_matters","312069241_Single-Cell-Based_Analysis_Highlights_a_Surge_in_Cell-to-Cell_Molecular_Variability_Preceding_Irreversible_Commitment_in_a_Differentiation_Process","283705025_Entropy_Ergodicity_and_Stem_Cell_Multipotency","261034077_Pseudo-temporal_ordering_of_individual_cells_reveals_dynamics_and_regulators_of_cell_fate_decisions","320253491_Single-cell_transcriptomics_to_explore_the_immune_system_in_health_and_disease","308043233_Transition_states_and_cell_fate_decisions_in_epigenetic_landscapes","278790667_From_Analog_to_Digital_Models_of_Gene_Regulation","272495650_Identification_of_Flt3_Lympho-Myeloid_Stem_Cells_Lacking_Erythro-Megakaryocytic_Potential","259204663_Gene_Regulation_When_Analog_Beats_Digital"]}