{"id":"321902156_Can_co-location_be_used_as_a_proxy_for_face-to-face_contacts","abstract":"Technological advances have led to a strong increase in the number of data collection efforts aimed at measuring co-presence of individuals at different spatial resolutions. It is however unclear how much co-presence data can inform us on actual face-to-face contacts, of particular interest to study the structure of a population in social groups or for use in data-driven models of information or epidemic spreading processes. Here, we address this issue by leveraging data sets containing high resolution face-to-face contacts as well as a coarser spatial localisation of individuals, both temporally resolved, in various contexts. The co-presence and the face-to-face contact temporal networks share a number of structural and statistical features, but the former is (by definition) much denser than the latter. We thus consider several down-sampling methods that generate surrogate contact networks from the co-presence signal and compare them with the real face-to-face data. We show that these surrogate networks reproduce some features of the real data but are only partially able to identify the most central nodes of the face-to-face network. We then address the issue of using such down-sampled co-presence data in data-driven simulations of epidemic processes, and in identifying efficient containment strategies. We show that the performance of the various sampling methods strongly varies depending on context. We discuss the consequences of our results with respect to data collection strategies and methodologies.","authors":["Mathieu Génois","Alain Barrat"],"meta":["December 2017EPJ Data Science 7(1)","DOI:10.1140/epjds/s13688-018-0140-1"],"references":["298420723_Social_Contact_Networks_and_Mixing_among_Students_in_K-12_Schools_in_Pittsburgh_PA","283277455_The_Scaling_of_Human_Contacts_and_Epidemic_Processes_in_Metapopulation_Networks","278048090_Contact_Patterns_in_a_High_School_A_Comparison_between_Data_Collected_Using_Wearable_Sensors_Contact_Diaries_and_Friendship_Surveys","278042314_The_role_of_heterogeneity_in_contact_timing_and_duration_in_network_models_of_influenza_spread_in_schools","274644869_Temporal_Gillespie_Algorithm_Fast_Simulation_of_Contagion_Processes_on_Time-Varying_Networks","273640319_Compensating_for_population_sampling_in_simulations_of_epidemic_spread_on_temporal_contact_networks","266081742_Data_on_face-to-face_contacts_in_an_office_building_suggest_a_low-cost_vaccination_strategy_based_on_community_linkers","319524577_Estimating_the_outcome_of_spreading_processes_on_networks_with_incomplete_information_a_mesoscale_approach","309207531_Inferring_Person-to-person_Proximity_Using_WiFi_Signals","282182125_Physical_Proximity_and_Spreading_in_Dynamic_Social_Networks"]}