{"id":"321982291_Quantitative_Historical_Analysis_Uncovers_a_Single_Dimension_of_Complexity_that_Structures_Global_Variation_in_Human_Social_Organization","abstract":"Do human societies from around the world exhibit similarities in the way that they are structured, and show commonalities in the ways that they have evolved? These are long-standing questions that have proven difficult to answer. To test between competing hypotheses, we constructed a massive repository of historical and archaeological information known as \"Seshat: Global History Databank.\" We systematically coded data on 414 societies from 30 regions around the world spanning the last 10,000 years. We were able to capture information on 51 variables reflecting nine characteristics of human societies, such as social scale, economy, features of governance, and information systems. Our analyses revealed that these different characteristics show strong relationships with each other and that a single principal component captures around three-quarters of the observed variation. Furthermore, we found that different characteristics of social complexity are highly predictable across different world regions. These results suggest that key aspects of social organization are functionally related and do indeed coevolve in predictable ways. Our findings highlight the power of the sciences and humanities working together to rigorously test hypotheses about general rules that may have shaped human history.","authors":["Peter Turchin","Thomas E. Currie","Harvey Whitehouse","Pieter Francois"],"meta":["January 2018Proceedings of the National Academy of Sciences 115(2):201708800","DOI:10.1073/pnas.1708800115","Projects: SESHAT: Global History DatabankSeshat Global History DatabankSeshatSeshat: Global History Databank"],"references":["311345344_The_evolution_of_inequality","350994688_Religion_in_Human_Evolution_From_the_Paleolithic_to_the_Axial_Age","344472844_Pathways_to_complexity_an_African_perspective","331138236_The_Secret_of_Our_Success_How_Culture_Is_Driving_Human_Evolution_Domesticating_Our_Species_and_Making_Us_Smarter","324337839_The_Science_of_Culture_A_Study_of_Man_and_Civilization","318393858_R_A_Language_and_Environment_for_Statistical_Computing","318393770_R_A_Language_and_Environment_for_Statistical_Computing","317315271_Mechanisms_Of_Large-Scale_Evolutionary_Trends","316801218_Fundamental_Issues_in_Archaeology","314719010_Developing_Scales_of_Development","304380719_Settlement_scaling_and_increasing_returns_in_an_ancient_society","290437465_Sociopolitical_Evolution_in_Midrange_Societies_The_Prehispanic_Pueblo_Case","307820631_The_Role_of_Ritual_in_the_Evolution_of_Social_Complexity_Five_Predictions_and_a_Drum_Roll","294809628_War_and_society_The_new_cultural_history","287243092_Myths_of_the_Archaic_State_Evolution_of_the_Earliest_Cities_States_and_Civilizations"]}