{"id":"321902224_ES_Is_More_Than_Just_a_Traditional_Finite-Difference_Approximator","abstract":"An evolution strategy (ES) variant recently attracted significant attention due to its surprisingly good performance at optimizing neural networks in challenging deep reinforcement learning domains. It searches directly in the parameter space of neural networks by generating perturbations to the current set of parameters, checking their performance, and moving in the direction of higher reward. The resemblance of this algorithm to a traditional finite-difference approximation of the reward gradient in parameter space naturally leads to the assumption that it is just that. However, this assumption is incorrect. The aim of this paper is to definitively demonstrate this point empirically. ES is a gradient approximator, but optimizes for a different gradient than just reward (especially when the magnitude of candidate perturbations is high). Instead, it optimizes for the average reward of the entire population, often also promoting parameters that are robust to perturbation. This difference can channel ES into significantly different areas of the search space than gradient descent in parameter space, and also consequently to networks with significantly different properties. This unique robustness-seeking property, and its consequences for optimization, are demonstrated in several domains. They include humanoid locomotion, where networks from policy gradient-based reinforcement learning are far less robust to parameter perturbation than ES-based policies that solve the same task. While the implications of such robustness and robustness-seeking remain open to further study, the main contribution of this work is to highlight that such differences indeed exist and deserve attention.","authors":["Joel Lehman","Jay Chen","Jeff Clune","Kenneth O. Stanley"],"meta":["December 2017"],"references":["321902735_Improving_Exploration_in_Evolution_Strategies_for_Deep_Reinforcement_Learning_via_a_Population_of_Novelty-Seeking_Agents","321902651_On_the_Relationship_Between_the_OpenAI_Evolution_Strategy_and_Stochastic_Gradient_Descent","321902574_Deep_Neuroevolution_Genetic_Algorithms_Are_a_Competitive_Alternative_for_Training_Deep_Neural_Networks_for_Reinforcement_Learning","311736713_Resolving_the_paradox_of_evolvability_with_learning_theory_How_evolution_learns_to_improve_evolvability_on_rugged_fitness_landscapes","305271439_Quality_Diversity_A_New_Frontier_for_Evolutionary_Computation","320464576_Gradient-free_Policy_Architecture_Search_and_Adaptation","319769991_Trust_Region_Policy_Optimization","303822031_OpenAI_Gym","302935886_The_approximate_arithmetical_solution_by_finite_differences_of_physical_problems_including_differential_equations_with_an_application_to_the_stresses_in_a_masonry_dam","279964320_Simple_statistical_gradient-following_algorithms_for_connectionist_reinforcement_learning"]}