{"id":"321974783_Noisy_Ocular_Recognition_Based_on_Three_Convolutional_Neural_Networks","abstract":"In recent years, the iris recognition system has been gaining increasing acceptance for applications such as access control and smartphone security. When the images of the iris are obtained under unconstrained conditions, an issue of undermined quality is caused by optical and motion blur, off-angle view (the user's eyes looking somewhere else, not into the front of the camera), specular reflection (SR) and other factors. Such noisy iris images increase intra-individual variations and, as a result, reduce the accuracy of iris recognition. A typical iris recognition system requires a near-infrared (NIR) illuminator along with an NIR camera, which are larger and more expensive than fingerprint recognition equipment. Hence, many studies have proposed methods of using iris images captured by a visible light camera without the need for an additional illuminator. In this research, we propose a new recognition method for noisy iris and ocular images by using one iris and two periocular regions, based on three convolutional neural networks (CNNs). Experiments were conducted by using the noisy iris challenge evaluation-part II (NICE.II) training dataset (selected from the university of Beira iris (UBIRIS).v2 database), mobile iris challenge evaluation (MICHE) database, and institute of automation of Chinese academy of sciences (CASIA)-Iris-Distance database. As a result, the method proposed by this study outperformed previous methods.","authors":["Min Beom Lee","Hyung Gil Hong","Kang Ryoung Park"],"meta":["December 2017Sensors 17(12)","DOI:10.3390/s17122933"],"references":["314650388_Deep_learning_architecture_for_iris_recognition_based_on_optimal_Gabor_filters_and_deep_belief_network","322057987_Towards_More_Accurate_Iris_Recognition_Using_Deeply_Learned_Spatially_Corresponding_Features","319959937_Insights_into_the_results_of_MICHE_I_-_Mobile_Iris_CHallenge_Evaluation","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","317229764_Long_Range_Iris_Recognition_A_Survey","316328378_A_Deep_Learning_Approach_for_Iris_Sensor_Model_Identification","313450623_Deep_belief_networks_for_iris_recognition_based_on_contour_detection","311609041_Deep_Residual_Learning_for_Image_Recognition","311470633_Ocular_Biometrics_in_the_Visible_Spectrum_A_Survey","306378434_DeepIrisNet_Deep_iris_representation_with_applications_in_iris_recognition_and_cross-sensor_iris_recognition","304005584_Optimal_Face-Iris_Multimodal_Fusion_Scheme","303145025_Iris_Image_Enhancement_for_the_Recognition_of_Non-ideal_Iris_Images","301452548_Deep_Face_Recognition","294422684_Iris_Recognition_through_Machine_Learning_Techniques_a_Survey","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting"]}