{"id":"321987298_DAGAN_Deep_De-Aliasing_Generative_Adversarial_Networks_for_Fast_Compressed_Sensing_MRI_Reconstruction","abstract":"Compressed Sensing Magnetic Resonance Imaging (CS-MRI) enables fast acquisition, which is highly desirable for numerous clinical applications. This can not only reduce the scanning cost and ease patient burden, but also potentially reduce motion artefacts and the effect of contrast washout, thus yielding better image quality. Different from parallel imaging based fast MRI, which utilises multiple coils to simultaneously receive MR signals, CS-MRI breaks the Nyquist-Shannon sampling barrier to reconstruct MRI images with much less required raw data. This paper provides a deep learning based strategy for reconstruction of CS-MRI, and bridges a substantial gap between conventional non-learning methods working only on data from a single image, and prior knowledge from large training datasets. In particular, a novel conditional Generative Adversarial Networks-based model (DAGAN) is proposed to reconstruct CS-MRI. In our DAGAN architecture, we have designed a refinement learning method to stabilise our U-Net based generator, which provides an endto-end network to reduce aliasing artefacts. To better preserve texture and edges in the reconstruction, we have coupled the adversarial loss with an innovative content loss. In addition, we incorporate frequency domain information to enforce similarity in both the image and frequency domains. We have performed comprehensive comparison studies with both conventional CSMRI reconstruction methods and newly investigated deep learning approaches. Compared to these methods, our DAGAN method provides superior reconstruction with preserved perceptual image details. Furthermore, each image is reconstructed in about 5 ms, which is suitable for real-time processing.","authors":["Guang Yang","Simiao Yu","Hao Dong","Greg Slabaugh"],"meta":["December 2017IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2017.2785879"],"references":["322057512_Semantic_Image_Synthesis_via_Adversarial_Learning","320968590_Stacked_Generative_Adversarial_Networks","320966887_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","318720968_TensorLayer_A_Versatile_Library_for_Efficient_Deep_Learning_Development","318652655_Semantic_Image_Synthesis_via_Adversarial_Learning","318168153_Automatic_Brain_Tumor_Detection_and_Segmentation_Using_U-Net_Based_Fully_Convolutional_Networks","320968363_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","319770355_Generative_Adversarial_Nets","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks"]}