{"id":"321936825_The_cavity_approach_for_Steiner_trees_Packing_problems","abstract":"The Belief Propagation approximation, or cavity method, has been recently applied to several combinatorial optimization problems in its zero-temperature implementation, the Max-Sum algorithm. In particular, recent developments to solve the Edge-Disjoint paths problem and the Prize collecting Steiner tree Problem on graphs have shown remarkable results for several classes of graphs and for benchmark instances. Here we propose a generalization of these techniques for two variants of the Steiner trees packing problem where multiple \"interacting\" trees have to be sought within a given graph. Depending on the interaction among trees we distinguish the Vertex-Disjoint Steiner trees Problem, where trees cannot share nodes, from the Edge-Disjoint Steiner trees Problem, where edges cannot be shared by trees but nodes can be members of multiple trees. Several practical problems of huge interest in network design can be mapped into these two variants, for instance, the physical design of Very Large Scale Integration (VLSI) chips. The formalism described here relies on two components edge-variables that allows us to formulate a massage-passing algorithm for the V-DStP and two algorithms for the E-DStP differing in the scaling of the computational time with respect to some relevant parameters. We will show that one of the two formalisms used for the edge-disjoint variant allow us to map the Max-Sum update equations into a weighted maximum matching problem over proper bipartite graphs. The solution of the MS equations allows to non-rigorously estimate the maximum number of trees that can be accommodated on several ensembles of random networks, including regular and fully-connected graphs. We developed a heuristic procedure based on the Max-Sum equations that shows excellent performance in synthetic networks and on large benchmark instances of VLSI.","authors":["Alfredo Braunstein","Anna Paola Muntoni"],"meta":["December 2017Journal of Statistical Mechanics Theory and Experiment 2018(12)","DOI:10.1088/1742-5468/aaeb3f"],"references":["273067098_The_Edge-Disjoint_Path_Problem_on_Random_Graphs_by_Message-Passing","260003379_Shortest_node-disjoint_paths_on_random_graphs","233903746_Performance_of_a_cavity-method-based_algorithm_for_the_prize-collecting_Steiner_tree_problem_on_graphs","221580898_Reducibility_Among_Combinatorial_Problems","220588990_An_Algorithmic_Framework_for_the_Exact_Solution_of_the_Prize-Collecting_Steiner_Tree_Problem","220485300_A_rigorous_analysis_of_the_cavity_equations_for_the_minimum_spanning_tree","49710923_Finding_undetected_protein_associations_in_cell_signaling_by_belief_propagation","23230547_Statistical_Mechanics_of_Steiner_Trees","2214173_A_sharp_threshold_for_minimum_bounded-depth_and_bounded-diameterspanning_trees_and_Steiner_trees_in_random_networks","1836176_The_Cavity_Method_at_Zero_Temperature","305076267_Practical_optimization_of_Steiner_Trees_via_the_cavity_method","243787873_Compexity_of_Computer_Computations","235929805_Information_Physics_and_Computation","234053634_Steiner_Tree_Packing_Revisited","223386856_A_greedy_switch-box_router","220589094_The_Steiner_tree_packing_problem_in_VLSI_design","3225173_Hierarchical_Wire_Routing","3222835_BEAVER_A_Computational-Geometry-Based_Tool_for_Switchbox_Routing","3080323_On_the_Optimality_of_Solutions_of_the_Max-Product_Belief_Propagation_Algorithm_in_Arbitrary_Graphs"]}