{"id":"321920796_Metagaming_Playing_Competing_Spectating_Cheating_Trading_Making_and_Breaking_Videogames","abstract":"The greatest trick the videogame industry ever pulled was convincing the world that videogames were games rather than a medium for making metagames. Elegantly defined as \"games about games,\" metagames implicate a diverse range of practices that stray outside the boundaries and bend the rules: from technical glitches and forbidden strategies to Renaissance painting, algorithmic trading, professional sports, and the War on Terror. In Metagaming, Stephanie Boluk and Patrick LeMieux demonstrate how games always extend beyond the screen, and how modders, mappers, streamers, spectators, analysts, and artists are changing the way we play. Metagaming uncovers these alternative histories of play by exploring the strange experiences and unexpected effects that emerge in, on, around, and through videogames. Players puzzle through the problems of perspectival rendering in Portal, perform clandestine acts of electronic espionage in EVE Online, compete and commentate in Korean StarCraft, and speedrun The Legend of Zelda in record times (with or without the use of vision). Companies like Valve attempt to capture the metagame through international e-sports and online marketplaces while the corporate history of Super Mario Bros. is undermined by the endless levels of Infinite Mario, the frustrating pranks of Asshole Mario, and even Super Mario Clouds, a ROM hack exhibited at the Whitney Museum of American Art. One of the only books to include original software alongside each chapter, Metagaming transforms videogames from packaged products into instruments, equipment, tools, and toys for intervening in the sensory and political economies of everyday life. And although videogames conflate the creativity, criticality, and craft of play with the act of consumption, we don't simply play videogames-we make metagames. © 2017 by Stephanie Boluk and Patrick LeMieux. All rights reserved.","authors":["Stephanie Boluk","Patrick LeMieux"],"meta":["April 2017","DOI:10.5749/9781452958354","ISBN: 978-1-4529-5835-4"],"references":[]}