{"id":"321990920_Algorithms_Abstractions_and_Iterations_Teaching_Computational_Thinking_Using_Protein_Synthesis_Translation","abstract":"One of the eight Next Generation Science Standards (NGSS) scientific practices is using mathematics and computational thinking (CT). CT is not merely a data analysis tool, but also a problem-solving tool. By utilizing computing concepts, people can sequentially and logically solve complex science and engineering problems. In this article, we share a successful lesson using protein synthesis to teach CT. This lesson focuses primarily on modeling and simulation practices with an extension activity focusing on the computational problem-solving practices of CT. We identify and define five CT concepts within the aforementioned practices that form the foundation of CT: Algorithm, abstraction, iteration, branching, and variable. In this lesson, we utilize a game to familiarize students with CT basics, and then use their new CT foundation to design, construct, and evaluate algorithms within the context of protein synthesis. As an optional extension to the lesson, students enter the problem-solving environment to create a program that translates mRNA triplet codons to an amino acid chain. We argue that biology classrooms are ideal contexts for CT learning because biological processes function as a system, and understanding how the system functions requires algorithmic thinking and problem-solving skills. © 2018 National Association of Biology Teachers. All rights reserved.","authors":["Amanda Peel","Patricia Friedrichsen"],"meta":["January 2018The American Biology Teacher 80(1):21-28","DOI:10.1525/abt.2018.80.1.21"],"references":["290194160_Computational_Thinking_Concepts_for_Grade_School","289834568_Rethinking_Technology_Creativity_in_the_21st_Century_Of_Art_Algorithms","283155060_Defining_Computational_Thinking_for_Mathematics_and_Science_Classrooms","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","220420371_Computational_thinking","265286561_Computational_Thinking_is_Pervasive","248285087_A_Framework_for_K-12_Science_Education_Practices_Crosscutting_Concepts_and_Core_Ideas"]}