{"id":"321948696_Applet_ontology_as_a_tool_for_automatic_assessment_of_applet-based_assessment_tasks","abstract":"The automatic assessment of applet-based tasks on the fly is important for knowing what students have done with the applet after they submit the task. Automatic assessment and analysis of students’ submissions saves teachers’ time and energy. In Computer Science, the term ontology refers to a formal knowledge representation of a set of concepts within a domain and of the relationships between those concepts. Modelling these task applets into applet ontology gives the formal specification of the shared conceptualization of the task applets. In this paper, I explain and demonstrate with examples how the applet ontology can be used as a tool for automatic assessment. For a proof of concept of the applet ontology that goes beyond any specific domain, I considered a pool of 333 applets from an open-source site which has a variety of applets for domains within subjects like Mathematics and Physics. A total of 74 applets covering Mathematics were selected using a statistical sampling method and were divided into two equal groups, each with 37 applets. I analysed one group of 37 applets to create an applet ontology. After freezing the applet ontology, I validated it and checked its robustness with the remaining 37 applets. The applet ontology was found to be approximately 89.43% robust against the remaining set of applets. For the claim that applet ontology goes beyond the subjects, I checked its robustness against 37 physics applets. The applet ontology was found to be 95.68% robust against the set of physics applets.","authors":["Aparna Lalingkar"],"meta":["December 2017Journal of Computers in Education 5(3)","DOI:10.1007/s40692-017-0096-3","Project: Applet Ontology as a tool for automation of assessment"],"references":["323457689_Digital_Interactive_Assessment_in_Mathematics_The_Case_of_Construction_E-tasks","315734378_How_might_the_use_of_technology_in_formative_assessment_support_changes_in_mathematics_teaching","309092073_Designing_Assessment_Tasks_in_a_Dynamic_Geometry_Environment","299547472_Machine_Learning_Techniques_with_Ontology_for_Subjective_Answer_Evaluation","280446977_MONTO_A_Machine_-Readable_Ontology_for_Teaching_Word_Problems_in_Mathematics","279920234_Automatic_assessment_in_engineering_mathematics_evaluation_of_the_impact","268688872_Ontology-based_Smart_Learning_Environment_for_Teaching_Word_Problems_in_Mathematics","320858471_Ontology-based_smart_learning_environment_for_teaching_word_problems_in_mathematics","314981813_Assessing_Students'_Use_of_Evidence_and_Organization_in_Response-to-Text_Writing_Using_Natural_Language_Processing_for_Rubric-Based_Automated_Scoring","281728797_A_Reconfigurable_Simulation-Based_Test_System_for_Automatically_Assessing_Software_Operating_Skills"]}