{"id":"321921870_Trust_in_a_viable_real_estate_economy_with_disruption_and_Blockchain","abstract":"Purpose\n\nThe real estate world finds itself at a tipping point of a transition: a dramatic and irreversible shift in (real estate) systems in society. This article is a State of the art of Disruption, Blockchain and Real Estate in the Netherlands and international.\n\nDesign/methodology/approach\n\nThe following questions were asked of all those involved: (1) What do you think is the essence of Blockchain for real estate?, (2) What is the most current situation with respect to Blockchain and real estate from your perspective?, (3) Which publications are important from your perspective?, (4) What do you expect with respect to the impact of Blockchain on real estate for (social) real estate? And (5) What are questions for the future for real estate and Blockchain? In addition, interviews, exploratory conversations and correspondence took place, and the content is peer reviewed.\n\nFindings\n\nChanges in value concepts affect the valuation of real estate and the thinking about it. The orientation of changing users and owners of real estate affects innovativeness, values and flexibility in managing that property. Orientation on disruption must be seen as proof that the real estate world is able to actually innovate the accumulated assets and consolidate this. The financial and real estate markets are markets that exaggerate through irrational behaviour. Fear of 'eat or be eaten' determines people's behaviour. Financial and thus real estate markets are always unstable and must always be regulated by people and organizations.\n\nResearch limitations/implications\n\nThe question that remains is whether it is important to look at disruptive innovations in existing markets or newcomers in the real estate market and Blockchain. The question is whether Blockchain is only a technological disruption, or a real game changer, and whether the entire value chain of the real estate market will embrace it. No two disruptions are the same. Trust in Blockchain is a prerequisite for guiding the predictable form of that disruption where start-up companies use new technology to offer cheaper and inferior alternatives to real estate in the market. You could also talk about anti-fragile value: 'Some things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. Yet, in spite of the ubiquity of the phenomenon, there is no word for the exact opposite of fragile. Let us call it antifragile.’ (Taleb 2012), in other words: attention to disruption and Blockchain creates a viable real estate economy.\n\nPractical implications\n\nThe true meaning of the Blockchain technology for real estate still needs to be investigated. I am still curious to understand and clarify the value of Blockchain for real estate processes. Doubt continues to exist and is therefore a feeding ground for further research, because we do not know what we have not seen.\n\nOriginality/value\n\nThe way in which disruption, Blockchain and real estate will develop in the coming years are not the only obvious characteristics of a particular era, but also its social impact and user behaviour. This also applies to how this real estate transition can best be tracked, guided and utilized in society at the international, national and regional level. Disruptive organizations clearly respond to the viability of the (built) environment and therefore determine competitive strength. This affects the current and future valuation of real estate.","authors":["Jan Veuger"],"meta":["December 2017Facilities 36(1):00-00","DOI:10.1108/F-11-2017-0106"],"references":["313497554_Digitally_rebuilding_the_real_estate_industry"]}