{"id":"321940359_TACCLE_3_O5_An_overview_of_the_most_relevant_literature_on_coding_and_computational_thinking_with_emphasis_on_the_relevant_issues_for_teachers","abstract":"The rationale for this literature review is to take the main areas of debate surrounding the teaching of coding to primary aged children and examine the polemic and the different positions that writers and practitioners are taking on these issues. This is intended to be a literature review useful to practitioners rather than academics. In that vein, in addition to published peer referenced journal articles we have decided to make maximum use of blog posts and opinions on social media for our source material as we believe that the most informed debate on kids coding is not actually going on in academic journals!\nIn fact, in a meta-analysis of 27 peer-reviewed papers on the subject of teaching computational thinking to school aged children, it was found that only ‘nine peer-reviewed intervention studies were based in K-12 settings’, highlighting the gap in the research of developing computational thinking in school aged children. ‘Even with these limited studies, most were conducted as after-school activities.’ (Lye, S. Y. & Koh, J. H. L., 2014.) So even the academics know that the scope of their own work is limited. \nBased on the preceding, the TACCLE 3 team members have compiled reviews of academic papers and have also trawled through blogs, news-articles and opinion pieces to find some answers to the questions teachers regularly ask us, along with a few extras that we found interesting. The information in this paper has been divided into 5 chapters. In the first chapter TACCLE 3 team members try to answer the following questions: \n• Why are we teaching coding?\n• Should we actually be teaching coding to young children at all?\n• How should we be teaching it?\n• How to best use tangible user interfaces?\n• Are there gender issues to overcome?\nIn chapter 2 Francisco Jose García-Peñalvo provides a deeper introduction into computational thinking: what it is, what are the core concepts of it and how to introduce this approach into the classrooms. In chapter 3 Daniela Reimann introduces us ‘smart textiles’ as a creative environment for programming interactive objects. In chapter 4 Maire Tuul gives an overview of Makey Makey, a platform for improvising tangible user interfaces. In chapter 5 Ilkka Jormanainen takes a look into the world of robotics. All of the chapters have been written in a way that it is possible to understand the content of each chapter without reading the paper from cover to cover. You can just pick out the parts you find interesting. Enjoy reading!\nReferences\nLye, S. Y. & Koh, J. H. L. (2014). Review on teaching and learning of computational thinking through programming: What is next for K-12? Computers in Human Behavior, 41, 51-61.","authors":["Maire Tuul","Francisco José García-Peñalvo","Daniela Reimann","Angela Marie Gerrard"],"meta":["October 2016","DOI:10.13140/RG.2.2.13111.01440","Report number: KA2 project “TACCLE 3 – Coding” (2015-1-BE02-KA201-012307)","Project: TACCLE 3"],"references":["354582893_THE_ASSESSMENT_OF_MOBILE_COMPUTATIONAL_THINKING","308880760_What_Computational_Thinking_Is","308848315_Arts_Bots_Application_and_outcomes_of_a_secondary_school_robotics_program","305114701_Pensamiento_computacional_Una_nueva_alfabetizacion_digital","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","353080812_Educational_projects_based_on_mobile_learning","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","317953539_How_to_solve_it_a_new_aspect_of_mathematical_method","314801178_A_tangible_interface_for_controlling_robotic_toys","310807539_PC-01_Introduction_to_computational_thinking_Educational_technology_in_primary_and_secondary_education"]}