{"id":"321987970_Auditory-Visual_Interactions_Subserving_Goal-Directed_Saccades_in_a_Complex_Scene","abstract":"This study addresses the integration of auditory and visual stimuli subserving the generation of saccades in a complex scene. Previous studies have shown that saccadic reaction times (SRTs) to combined auditory-visual stimuli are reduced when compared with SRTs to either stimulus alone. However, these results have been typically obtained with high-intensity stimuli distributed over a limited number of positions in the horizontal plane. It is less clear how auditory-visual interactions influence saccades under more complex but arguably more natural conditions, when low-intensity stimuli are embedded in complex backgrounds and distributed throughout two-dimensional (2-D) space. To study this problem, human subjects made saccades to visual-only (V-saccades), auditory-only (A-saccades), or spatially coincident auditory-visual (AV-saccades) targets. In each trial, the low-intensity target was embedded within a complex auditory-visual background, and subjects were allowed over 3 s to search for and foveate the target at 1 of 24 possible locations within the 2-D oculomotor range. We varied systematically the onset times of the targets and the intensity of the auditory target relative to background [i.e., the signal-to-noise (S/N) ratio] to examine their effects on both SRT and saccadic accuracy. Subjects were often able to localize the target within one or two saccades, but in about 15% of the trials they generated scanning patterns that consisted of many saccades. The present study reports only the SRT and accuracy of the first saccade in each trial. In all subjects, A-saccades had shorter SRTs than V-saccades, but were more inaccurate than V-saccades when generated to auditory targets presented at low S/N ratios. AV-saccades were at least as accurate as V-saccades but were generated at SRTs typical of A-saccades. The properties of AV-saccades depended systematically on both stimulus timing and S/N ratio of the auditory target. Compared with unimodal A- and V-saccades, the improvements in SRT and accuracy of AV-saccades were greatest when the visual target was synchronous with or leading the auditory target, and when the S/N ratio of the auditory target was lowest. Further, the improvements in saccade accuracy were greater in elevation than in azimuth. A control experiment demonstrated that a portion of the improvements in SRT could be attributable to a warning-cue mechanism, but that the improvements in saccade accuracy depended on the spatial register of the stimuli. These results agree well with earlier electrophysiological results obtained from the midbrain superior colliculus (SC) of anesthetized preparations, and we argue that they demonstrate multisensory integration of auditory and visual signals in a complex, quasi-natural environment. A conceptual model incorporating the SC is presented to explain the observed data.","authors":["B. D. Corneil","Marc van Wanrooij","D. P. Munoz","John van Opstal"],"meta":["July 2002Journal of Neurophysiology 88(1):438-454","DOI:10.1152/jn.2002.88.1.438"],"references":["290039893_On_your_mark_get_set_Brainstem_circuitry_underlying_saccadic_initiation","225663442_A_two-stage_model_for_visual-auditory_interaction_in_saccadic_latencies","281023181_The_influence_of_stimulus_properites_on_multisensory_processing_in_the_awake_primate_superior_colliculus","273584930_The_Mammalian_Auditory_Pathway_Neurophysiology","264215174_Statistical_facilitation_of_simple_reaction_time","256083401_Behavioral_Indices_of_Multisensory_Integration_Orientation_to_Visual_Cues_is_Affected_by_Auditory_Stimuli","247274830_Progress_in_sensory_physiology_7","231872727_Express_saccades_and_visual_attention","225627901_Auditory_psychomotor_coordination_and_visual_search_performance","225400085_Saccade_latency_and_warning_signals_Effects_of_auditory_and_visual_stimulus_onset_and_offset","200045092_Spatial_hearing_the_psychophysics_of_human_sound_localization","20971735_Signal_Transformations_Required_for_the_Generation_of_Saccadic_Eye_Movements","22019808_Precise_Recording_of_Human_Eye_Movements","21201197_Aurally_Aided_Visual_Search_in_the_Central_Visual_Field_Effects_of_Visual_Load_and_Visual_Enhancement_of_the_Target","20938709_Auditory_psychomotor_coordination_and_visual_search_performance"]}