{"id":"321933558_Computer-Aided_Diagnosis_Based_on_Convolutional_Neural_Network_System_for_Colorectal_Polyp_Classification_Preliminary_Experience","abstract":"Background and aim: \nComputer-aided diagnosis (CAD) is becoming a next-generation tool for the diagnosis of human disease. CAD for colon polyps has been suggested as a particularly useful tool for trainee colonoscopists, as the use of a CAD system avoids the complications associated with endoscopic resections. In addition to conventional CAD, a convolutional neural network (CNN) system utilizing artificial intelligence (AI) has been developing rapidly over the past 5 years. We attempted to generate a unique CNN-CAD system with an AI function that studied endoscopic images extracted from movies obtained with colonoscopes used in routine examinations. Here, we report our preliminary results of this novel CNN-CAD system for the diagnosis of colon polyps.\n\nMethods: \nA total of 1,200 images from cases of colonoscopy performed between January 2010 and December 2016 at Kindai University Hospital were used. These images were extracted from the video of actual endoscopic examinations. Additional video images from 10 cases of unlearned processes were retrospectively assessed in a pilot study. They were simply diagnosed as either an adenomatous or nonadenomatous polyp.\n\nResults: \nThe number of images used by AI to learn to distinguish adenomatous from nonadenomatous was 1,200:600. These images were extracted from the videos of actual endoscopic examinations. The size of each image was adjusted to 256 × 256 pixels. A 10-hold cross-validation was carried out. The accuracy of the 10-hold cross-validation is 0.751, where the accuracy is the ratio of the number of correct answers over the number of all the answers produced by the CNN. The decisions by the CNN were correct in 7 of 10 cases.\n\nConclusion: \nA CNN-CAD system using routine colonoscopy might be useful for the rapid diagnosis of colorectal polyp classification. Further prospective studies in an in vivo setting are required to confirm the effectiveness of a CNN-CAD system in routine colonoscopy.","authors":["Yoriaki Komeda","Hisashi Handa","Tomohiro Watanabe","Takanobu Nomura"],"meta":["December 2017Oncology 93(1):30-34","DOI:10.1159/000481227"],"references":["309474298_Exploring_Deep_Learning_and_Transfer_Learning_for_Colonic_Polyp_Classification","301250854_Characterization_of_Colorectal_Lesions_Using_a_Computer-Aided_Diagnostic_System_for_Narrow-Band_Imaging_Endocytoscopy","277411157_Deep_Learning","269177150_Novel_computer-aided_diagnostic_system_for_colorectal_lesions_by_using_endocytoscopy_with_videos","305922185_Impact_of_an_automated_system_for_endocytoscopic_diagnosis_of_small_colorectal_lesions_an_international_web-based_study","303904648_Exploring_the_clinical_potential_of_an_automatic_colonic_polyp_detection_method_based_on_the_creation_of_energy_maps","281084061_Computer-aided_diagnosis_of_colorectal_polyp_histology_by_using_a_real-time_image_recognition_system_and_narrow-band_imaging_magnifying_colonoscopy","265094487_Long-Term_Colorectal-Cancer_Mortality_after_Adenoma_Removal","245981881_Prevention_of_colorectal_cancer_by_colonoscopic_polypectomy_The_National_Polyp_Study_Workgroup","224881215_Computer-Aided_Classification_of_Colorectal_Polyps_Based_on_Vascular_Patterns_A_Pilot_Study"]}