{"id":"321953519_Invariant_Kalman_Filtering","abstract":"The Kalman filter—or, more precisely, the extended Kalman filter (EKF)—is a fundamental engineering tool that is pervasively used in control and robotics and for various estimation tasks in autonomous systems. The recently developed field of invariant extended Kalman filtering uses the geometric structure of the state space and the dynamics to improve the EKF, notably in terms of mathematical guarantees. The methodology essentially applies in the fields of localization, navigation, and simultaneous localization and mapping (SLAM). Although it was created only recently, its remarkable robustness properties have already motivated a real industrial implementation in the aerospace field. This review aims to provide an accessible introduction to the methodology of invariant Kalman filtering and to allow readers to gain insight into the relevance of the method as well as its important differences with the conventional EKF. This should be of interest to readers intrigued by the practical application of mathematical theories and those interested in finding robust, simple-to-implement filters for localization, navigation, and SLAM, notably for autonomous vehicle guidance. Expected final online publication date for the Annual Review of Control, Robotics, and Autonomous Systems Volume 1 is May 28, 2018. Please see http://www.annualreviews.org/page/journal/pubdates for revised estimates.","authors":["Axel Barrau","Silvère Bonnabel"],"meta":["May 2018Annual Review of Control Robotics and Autonomous Systems 1(1)","DOI:10.1146/annurev-control-060117-105010","Project: Invariant Kalman filtering"],"references":["321810256_Unscented_Kalman_filtering_on_Lie_groups","316780279_Geometry_and_Dynamics_for_Markov_Chain_Monte_Carlo","314092925_An_Invariant-EKF_VINS_Algorithm_for_Improving_Consistency","312202503_Convergence_and_Consistency_Analysis_for_a_3-D_Invariant-EKF_SLAM","322276975_A_new_extension_of_the_Kalman_filter_to_nonlinear_systems","321816474_An_invariant-EKF_VINS_algorithm_for_improving_consistency","320590613_Sigma_Point_Kalman_Filtering_on_Matrix_Lie_Groups_Applied_to_the_SLAM_Problem","317961115_Nonlinear_Filtering_in_Riemannian_Manifolds","311856198_Generalized_multiplicative_extended_kalman_filter_for_aided_attitude_and_heading_reference_system","305949671_Stochastic_Differential_Equations_in_a_Differentiable_Manifold"]}