{"id":"322095295_Synthesis_and_Characterization_of_Cu2ZnSnS4_CZTS_thin_film_by_Chemical_Bath_Deposition_CBD_for_Solar_Cell_Applications","abstract":"The search for alternative energy sources has solar energy as one of the primary solutions. Thin film solar cells are a technology that uses less material, but still keeps or even beats efficiencies of normal silicon solar cells. However, some of the materials used in thin film solar cells are either rare or toxic. Kesterite- type Cu2ZnSnS4 (CZTS) thin film for low-cost thin film solar cell were successfully synthesized using a relatively easy to use and comfortable Chemical bath deposition (CBD). Using chemical path deposition to deposit CZTS on the glass substrate. Time, temperature, AND concentration of each one from CZTS compound are effect parameter to prepare of CZTS. CZTS films based on a stacked precursor were prepared and characterized by Scanning electron microscopy (SEM) and Energy Dispersive X-ray Analysis (EDAX).","authors":["Maytham Qabel Hamzah","Abdullah Hasan Jabbar","Salim Oudah Mezan"],"meta":["December 2017International Journal of Scientific and Engineering Research 5(12):35-37","Projects: ENERGY GAP INVESTIGATION AND CHARACTERIZATION OF KESTERITE CU 2 ZNSNS 4 THIN FILM FOR SOLAR CELL APPLICATIONSSynthesis and Characterization of Zinc Sulphide (ZnS) Thin Film Nanoparticle for Optical PropertiesSynthesis and Characterization of Cu2ZnSnS4 (CZTS) Thin Film by Chemical Bath Deposition (CBD) for Solar Cell Applications"],"references":["273504759_Optical_Designs_that_Improve_the_Efficiency_of_Cu2ZnSnSSe4_Solar_Cells","321186670_Transition_from_CZTSe_to_CZTS_via_multicomponent_CZTSSe_Potential_low_cost_photovoltaic_absorbers","284018512_Synthesis_and_characterization_of_high-ordered_CdTe_nanorods","278396174_Highly_efficient_photocatalysis_of_p-type_Cu2ZnSnS4_under_visible-light_illumination","256794659_Synthesis_and_characterization_of_Cu2ZnSnS4_thin_films_by_SILAR_method","248074874_Structural_thermodynamical_and_optical_properties_Of_Cu2-II-IV-VI4_quaternary_compounds","236131892_Room_temperature_novel_chemical_synthesis_of_Cu_2_ZnSnS_4_CZTS_absorbing_layer_for_photovoltaic_application","222743527_Aqueous_bath_process_for_deposition_of_Cu2ZnSnS4_photovoltaic_absorbers"]}