{"id":"322005119_Como_mejorar_el_pensamiento_computacional_un_estudio_de_caso","abstract":"One of the best skills for everyone, for now, and for the future, is problem-solving. Computational thinking is the way to help us to develop that skill. Computational Thinking can be defined as a set of skills for problemsolving based on computer techniques. Computational thinking is needed everywhere and is going to be a key to success in almost all careers, not only for a scientist but for many professionals, like doctors, lawyers, teachers or farmers. For many problems it is a good idea to make a plan for its resolution using some of the techniques of computer science, such as: breaking down a complex problem into smaller parts that are more manageable and easier to understand, or solve—decomposition; looking for similarities among and within problems and others experiences—pattern recognition; focusing on the important information only, and pulling out specific differences to make one solution work for multiple problems: abstraction; developing a step-by-step solution to the problem: algorithms. This plan can be used by everyone, regardless of their area of knowledge, task or age. It is essential that these techniques are practiced and developed very early. In recent years we have to see the proliferation of numerous projects with the specific objective of encouraging the study of Computational thinking. The projects of massification of computational thinking and coding are now starting to be implemented in our education system in Portugal. Most students of the first year of the Computer Engineering course, from the IPG, mostly did not have the opportunity to develop computational thinking throughout their student life. In this paper, we present the results of a case study using follow and give instructions to improve their capacities in Computational Thinking..","authors":["José Quitério Figueiredo"],"meta":["December 2017Education in the Knowledge Society (EKS) 18(4):35","DOI:10.14201/eks20171843551"],"references":["318591942_La_ensenanza_de_la_informatica_la_programacion_y_el_pensamiento_computacional_en_los_estudios_preuniversitarios","317586197_Educacion_en_Informatica_sub_18_EI18","309418522_Evaluation_of_existing_resources_studyanalysis","316996854_A_framework_for_K-12_science_education_Practices_crosscutting_concepts_and_core_ideas","316369653_Building_coding_and_programming_3D_models_via_a_visual_programming_environment","314281953_Towards_a_qualitative_descriptor_for_paper_folding_reasoning","311506852_Computational_thinking_in_pre-university_education","311489054_Subgoals_Help_Students_Solve_Parsons_Problems","310809036_A_brief_introduction_to_TACCLE_3_-_coding_European_project","310749931_ne-Course_for_Learning_Programming","308880760_What_Computational_Thinking_Is","308345778_Proyecto_TACCLE3_-_Coding","283185797_Empowering_K-12_Students_With_Disabilities_to_Learn_Computational_Thinking_and_Computer_Programming","274309848_Computational_Thinking","300117017_Spatial_Skills_Training_in_Introductory_Computing"]}