{"id":"322094704_Study_Magnetic_Properties_And_Synthesis_With_Characterization_Of_Nickel_Oxide_NiO_Nanoparticles","abstract":"Nickel Oxide (NiO) nanopowder was obtained during a chemical method, which is a bottom up approach of synthesis. It was initially prepared via chemical synthesis of main materials were nickel acetate, sodium hydroxide (NaOH) and cety trimethyl ammonium bromide(CTAB), and extremely stirring until the pH becomes 7.5, and nanoparticles of (NiO) are prepared by thermal decomposition of freshly prepared nickel hydroxide by a sol gel and followed by heat treatment at 350oC. Nickel oxide, a kind of soft magnetic materials is one of the most attracting class of materials due to its interesting and important properties and has many technical applications, such as in catalysis, sensors and so on. The characterization of (NiO) nanoparticles for structural properties were investigated by X-ray diffraction (XRD), and transmission electron microscopy (TEM). The surface morphology of the prepared sample was carried out by scanning electron microscopy (SEM), magnetization measurements were carried out on an Alternative Gradient Force Magnetometer (AGFM), which revealed saturation magnetization of the samples were strongly dependent on the calcinations temperature and particle size of the sample. The saturation magnetization values of the samples increased as a function of the calcinations temperature. Finally our results showed that the chemical synthesis method leads to obtain nickel oxide nanoparticles with good magnetic behavior.","authors":["Abdullah Hasan Jabbar"],"meta":["August 2015International Journal of Scientific and Engineering Research 6(8):94-98","Projects: Synthesis and Characterization of Cu2ZnSnS4 (CZTS) Thin Film by Chemical Bath Deposition (CBD) for Solar Cell ApplicationsStudy Magnetic Properties And Synthesis With Characterization Of Nickel Oxide (NiO) Nanoparticles"],"references":["49692447_Nano_nickel_oxide_modified_non-enzymatic_glucose_sensors_with_enhanced_sensitivity_through_an_electrochemical_process_strategy_at_high_potential","284040759_Elements_of_X-Ray_Diffraction","228826363_Selective_growth_of_vertically_aligned_carbon_nanotubes_on_nickel_oxide_nanostructures_created_by_atomic_force_microscope_nano-oxidation"]}