{"id":"322075616_Shelter_availability_mediates_decorating_in_the_majoid_crab_Camposcia_retusa","abstract":"Although numerous aquatic and terrestrial species adorn their surface with items secured from their surroundings, termed decorating, the physical and environmental factors that drive this behavior are often unclear. One of the best-known examples of this phenomenon are the decorator crabs (Majoidea), with almost 75% of species known to decorate. Here, we examined patterns of decorating in a coral reef-associated majoid, Camposcia retusa, to identify what factors determine patterns of, and investment in, decorating. Observations of natural decoration patterns indicate this species primarily decorate with sponges, fleshy and filamentous algae, and detritus. Decorations were primarily distributed on the carapace and hind walking legs which may reflect exoskeleton morphology. However, decoration cover did not decline with size, as is observed in some other majoid species, suggesting the factors driving decoration investment remain consistent throughout growth stages. From behavioral experiments, we determined that nonuniform decorating is a result of active selection, with crabs preferentially decorating their hind legs and carapace, with only small items placed on the carapace. Decorating in C. retusa appears to function primarily as an antipredator response, with crabs decorating at higher rates when access to shelter is limited. This study is the first to quantify the decorating habits of C. retusa and suggests that behaviorally-mediated decorating has a primary antipredator function. This study also highlights the value of manipulative behavioral experiments as a tool for assessing the behavioral mechanisms that drive decorating in animals.","authors":["Rohan M Brooker","Enid C Muñoz Ruiz","Tiffany Sih","Danielle L Dixson"],"meta":["December 2017Behavioral Ecology 29(1)","DOI:10.1093/beheco/arx119"],"references":["288622240_Decoration_preferences_of_Maja_crispata_Risso_1827_Brachyura_Majidae","285196294_Camouflage_in_marine_invertebrates","277775825_The_evolutionary_ecology_of_decorating_behaviour","240809427_Geographic_variation_in_decoration_selectivity_of_Micippa_platipes_and_Tiarinia_cornigera_in_Japan","303803175_Nlme_Linear_and_Nonlinear_Mixed_Effects_Models","286177695_Camouflage_in_decorator_crabs_Integrating_ecological_behavioural_and_evolutionary_approaches","259733618_The_caddisfly_Dicosmoecus_gilvipes_Making_a_case_for_a_functional_role","251259978_Cost_and_benefit_from_shield_cases_in_caddis_larvae","249575550_Examination_of_Agonistic_Behavior_By_Character_Analysis_I_the_Spider_Crab_Microphrys_Bicornutus","237975398_The_association_of_Calliactis_tricolor_with_its_pagurid_calappid_and_majid_partners_in_the_Caribbean"]}