{"id":"322075068_Modelling_students'_knowledge_organisation_Genealogical_conceptual_networks","abstract":"Learning scientific knowledge is largely based on understanding what are its key concepts and how they are related. The relational structure of concepts also affects how concepts are introduced in teaching scientific knowledge. We model here how students organise their knowledge when they represent their understanding of how physics concepts are related. The model is based on assumptions that students use simple basic linking-motifs in introducing new concepts and mostly relate them to concepts that were introduced a few steps earlier, i.e. following a genealogical ordering. The resulting genealogical networks have relatively high local clustering coefficients of nodes but otherwise resemble networks obtained with an identical degree distribution of nodes but with random linking between them (i.e. the configuration-model). However, a few key nodes having a special structural role emerge and these nodes have a higher than average communicability betweenness centralities. These features agree with the empirically found properties of students’ concept networks.","authors":["I. T. Koponen","Maija Nousiainen"],"meta":["December 2017Physica A: Statistical Mechanics and its Applications 495","DOI:10.1016/j.physa.2017.12.105","Project: Networks Applied in Science Education Research"],"references":["313249820_Pre-service_physics_teachers'_content_knowledge_of_electric_and_magnetic_field_concepts_Conceptual_facets_and_their_balance","308027308_Multiplex_lexical_networks_reveal_patterns_in_early_word_acquisition_in_children","277133921_Weaving_the_fabric_of_science_Dynamic_network_models_of_science's_unfolding_structure","275164141_Concept_networks_in_learning_Finding_key_concepts_in_learners'_representations_of_the_interlinked_structure_of_scientific_knowledge","270003164_Using_network_science_in_the_language_sciences_and_clinic","259703561_Knowledge_Maps_as_Scaffolds_for_Cognitive_Processing","297594753_Relational_Categories_as_a_Bridge_Between_Cognitive_and_Educational_Research","281374788_Atlas_of_Knowledge_Anyone_Can_Map","274191969_Cognitive_Systematization_A_Systems_Theoretic_Approach_to_a_Coherentist_Theory_of_Knowledge","267677486_The_structure_of_complex_networks_Theory_and_applications"]}