{"id":"322061681_Positioning_behavior_according_to_individual_color_variation_improves_camouflage_in_novel_habitats","abstract":"Behavior can play a key role in adaptation, especially in novel environments. Here, we study how ground-perching grasshoppers that colonized street pavements as novel habitats behaviorally manage their detection rates by predators. We found that grasshoppers positioned themselves aligned with the spaces between adjacent bricks more than expected by chance. By performing a virtual predation experiment, we confirmed that this positioning behavior decreases the predation rate. Surprisingly, individuals with a poorer cryptic coloration made greater use of this positioning behavior, whereas individuals with a better cryptic coloration relied more on background color matching. Additionally, positioning behavior interacted with other anti-predation behaviors, individuals that were positioned on the space between bricks allowed potential predators to get closer before fleeing. These results indicate that these grasshoppers showed adaptive flexibility in camouflage and escape behaviors as a function of both individual and environmental variation. Such behavioral flexibility should allow organisms to cope better with novel environments, which deserves more study especially in the current context of global change.","authors":["Adrián Baños-Villalba","David Pablo Quevedo","Pim Edelaar"],"meta":["December 2017Behavioral Ecology 00(00):1-7","DOI:10.1093/beheco/arx181","Project: Clarifying mechanisms of adaptation to novel habitats"],"references":["316524456_Background_colour_matching_increases_with_risk_of_predation_in_a_morphologically_colour-changing_grasshopper","308172449_Background_complexity_and_the_detectability_of_camouflaged_targets_by_birds_and_humans","303716976_Dazzle_camouflage_target_tracking_and_the_confusion_effect","303387982_Escape_Distance_in_Ground-Nesting_Birds_Differs_with_Individual_Level_of_Camouflage","320692257_Phenotypic_plasticity_in_color_without_molt_in_adult_grasshoppers_of_the_genus_Sphingonotus_Acrididae_Oedipodinae","318393858_R_A_Language_and_Environment_for_Statistical_Computing","318393770_R_A_Language_and_Environment_for_Statistical_Computing","298826819_Receptor_noise_as_a_determinant_of_colour_thresholds","295899772_Cognition_and_the_evolution_of_camouflage","291787267_The_Law_Which_Underlies_Protective_Coloration"]}