{"id":"322034593_Multicasting_in_software_defined_networks_A_comprehensive_survey","abstract":"The emerging Software Defined Networking (SDN) paradigm is being adopted by the telecom industry since it enables flexible network resource allocation, configuration and management. Multicast is an essential and attractive service for a wide range of todays Internet applications for its bandwidth-preserving efficiency and flexibility. In a multicast, a data stream is delivered from single or multiple sources to a group of destinations simultaneously. SDN has potential to simplify multicast traffic engineering by leveraging the centralized nature of the network control plane, which provides a global view of the network that is built based on the real-time data gathered from network devices. This article aims to provide a comprehensive survey about the recent advances in Software Defined Multicasting. Specifically, it will provide an overview of multicasting in the context of SDNs, discuss tree planning and management, discuss multicast routing and traffic engineering, reliability and scalability in routing and multicast techniques in data centers. It will also summarize key techniques for each important topic related to multicasting that can enable researchers and practitioners to quickly get started. Finally, we identify open challenges for SDN multicasting and outline future research directions.","authors":["Zainab abdulazizi Alsaeed","Imtiaz Ahmad","Iftekhar Hussain"],"meta":["December 2017Journal of Network and Computer Applications 104","DOI:10.1016/j.jnca.2017.12.011"],"references":["311338103_A_Survey_on_the_Contributions_of_Software-Defined_Networking_to_Traffic_Engineering","305823837_Guest_Editors'_Introduction_Special_Issue_on_Management_of_Softwarized_Networks","282493708_SDM2_Cast_An_OpenFlow-Based_Software-Defined_Scalable_Multimedia_Multicast_Streaming_Framework","257571676_A_Survey_of_Parallel_and_Distributed_Algorithms_for_the_Steiner_Tree_Problem","308722935_Flexible_Efficient_and_Scalable_Software-Defined_Over-the-Top_Multicast_for_ISP_Environments_with_DynSDM","297608756_Delay-Optimized_Video_Traffic_Routing_in_Software-Defined_Inter-Datacenter_Networks","282831438_Routing_Algorithms_for_Network_Function_Virtualization_Enabled_Multicast_Topology_on_SDN","264006851_Reliable_Multicast_in_Data_Center_Networks"]}