{"id":"322071883_Entre_o_objeto_e_o_sujeito_composicao_dialogo_e_confluencia_na_recuperacao_da_informacao_em_arquivos","abstract":"A Recuperação da Informação (RI) é investigada em diversas áreas, dentre elas a Arquivologia. Ao \nexaminar o conceito de RI no campo da Arquivologia, percebe-se a influência de estudiosos e teóricos da \nCiência da Informação (CI) e da Ciência da Computação. No presente texto busca-se entender a RI em \nrelação aos ambientes chamados de arquivo e entender como a RI foi exercitada em publicações dos \núltimos anos sob a égide de elementos que podem compor visões de natureza tanto objetivista, bem como \nsubjetivista – típicas de uma discussão já em desenvolvimento no terreno epistemológico da CI. A partir \nde tais traçados, lança-se o problema de pesquisa: como se relacionam as questões e os elementos tanto \nde ordem da objetividade como da subjetividade referentes à RI e aos temas correlatos no campo \narquivístico? A pesquisa teve abordagem qualitativa, baseada em levantamento bibliográfico. A coleta foi \nempreendida em portais digitais de revistas e periódicos científicos da CI e Arquivologia. Coletaram-se \nestudos que tratavam da RI em arquivos nos últimos cinco anos. O método de análise dos dados utilizado \nfoi de conteúdo. Achados da pesquisa indicam que as visões baseadas na objetividade e subjetividade, \nconsiderando-se a relação objeto-sujeito, não se apresentam dicotômicas.","authors":["Dacles Vágner da Silva","Osvaldo De Souza","Jefferson Veras Nunes","Lidia Eugenia Cavalcante"],"meta":["December 2017Informação em Pauta 2(2):92","DOI:10.22478/ufpb.1981-0695.2018v13n1.39215","Project: Acessibilidade Informacional - Desenvolvimentos teóricos e práticos"],"references":["273384000_A_Theoretical_Paradigm_of_Information_Retrieval_in_Information_Science_and_Computer_Science","228772372_Metodo_de_analise_de_conteudo_ferramenta_para_analise_de_dados_qualitativos_no_campo_da_saude","2479977_Information_Retrieval_Interaction","288911142_Analise_De_Conteudo_Traducao_De_Luis_Antero_Reto_E_Augusto_Pinheiro"]}