{"id":"322097445_Speaking_and_Writing_Assessment_Applied_by_English_Lecturers_of_State_College_for_Islamic_Studies_STAIN_at_Curup-Bengkulu","abstract":"An appropriate type of assessment and rubric gave best description about students’ progress and achievement as well. Therefore, the aims of this research were to find out:1) speaking and writing assessment implemented by English lecturers related with the types of assessment 2) the way lecturers constructed speaking rubric in assessing students’ speaking. 3)the way the lecturers constructed writing rubric in assessing students’ writing and 4)the use of information from speaking and writing assessment for lecturers as a feedback to students. This research was conducted under descriptive design. It involved 5 lecturers. The data were taken from observation, document and interview. The results of this research are: 1) there were 9 types of speaking assessment used; question and answer, instruction and direction, paraphrasing, role play, conversation, discussion, picture-cued storytelling and retelling story. There were 5 types of assessment used by writing lecturer those are; paraphrasing, paragraph construction, strategic option, editing task and essay writing. 2) All lecturers who taught speaking I, II, and III constructed and used analytic rubric for speaking assessment. 3) Most of them used analytic scoring rubric in assessing writing, 4) the feedback is mostly used by the lecturers for assigning grades and motivating\nstudents to study","authors":["Jumatul Hidayah"],"meta":["June 2017ENGLISH FRANCA Academic Journal of English Language and Education 1(1):1","DOI:10.29240/ef.v1i1.150"],"references":["249252009_Assessing_speaking_skills_A_workshop_for_teacher_development","283988309_Testing_for_Language_Teachers","258182775_The_Power_of_Feedback","239958728_Educational_Assessment_of_Students","239059574_Fundamental_Considerations_in_Language_Testing","44564855_Language_assessment_principles_and_classroom_practices_H_Douglas_Brown","31765796_Teaching_and_Learning_in_the_Language_Classroom_T_Hedge"]}