{"id":"322133401_From_the_E-Learning_and_Blended-Learning_to_M-Learning_Trends_Benefits_and_Risks_of_Education_Digital_Transformation","abstract":"Intensive development of electronic and in particular mobile technologies are quickly becoming available to a wide range of consumers. These processes characterize the modern stage of development of the information society. There is a need to study the trends and prospects for effective use of mobile technology in various fields, including the use of mobile devices in the socio-cultural and educational spheres. The authors consider the transformation of the educational model, which becomes relevant with the development of information and computer technology and develops by means of technology of mobile learning (m-Learning). Transformation processes that occur in education determine the prospects of m-Learning, which becomes the next stage of the development of electronic and blended-Learning technologies. The development of the information society leads to the further development of open education, and the role of information culture of the person increases. Analysis of the educational systems with respect to the use of mobile technology, a comparison of the dynamics and structure of promotion and development of e-technologies in education, their improving in Russia and abroad, the peculiarities of various types of learning technologies, identifying features of different information and computer technologies and their effective use, allow to trace the evolution and transformation of the processes. In these circumstances, mobile training is a promising step in the implementation of the concept of competence approach in education. Mobile education allows combining all the advantages of e-Learning technologies, providing new opportunities to students and teachers or tutors. However, it involves some risks, and their handling must be considered during the development of new educational programs.","authors":["Olga Guchinskaya","Larisa Kraeva"],"meta":["June 2017","DOI:10.1145/3143699.3143741","Conference: the International Conference IMS-2017"],"references":["313414674_The_Future_of_Internationalization_of_Higher_Education_in_Europe","310790589_Communications_in_Cyberspace_Designs_Features","323749622_Linguistic_diversity_in_online_and_mobile_learning","310791927_University_in_the_Global_Knowledge_Society_From_Digital_Idea_to_Distance_Learning_Practice"]}