{"id":"322128377_Flash_Points_Discovering_Exceptional_Pairwise_Behaviors_in_Vote_or_Rating_Data","abstract":"We address the problem of discovering contexts that lead\nwell-distinguished collections of individuals to change their pairwise agreement w.r.t. their usual one. For instance, in the European parliament, while in overall, a strong disagreement is witnessed between deputies of the far-right French party Front National and deputies of the left party Front de Gauche, a strong agreement is observed between these deputies in votes related to the thematic: External relations with the union. We devise the method DSC (Discovering Similarities Changes) which relies on exceptional model mining to uncover three-set patterns that identify contexts and two collections of individuals where an unexpected strengthening or weakening of pairwise agreement is observed. To efficiently explore the search space, we define some closure operators and pruning techniques using upper bounds on the quality measure. In addi-\ntion of handling usual attributes (e.g. numerical, nominal), we propose\na novel pattern domain which involves hierarchical multi-tag attributes\nthat are present in many datasets. A thorough empirical study on two\nreal-world datasets (i.e., European parliament votes and collaborative\nmovie reviews) demonstrates the efficiency and the effectiveness of our approach as well as the interest and the actionability of the patterns.","authors":["Belfodil Adnene","Sylvie Cazalens","Philippe Lamarre","Marc Plantevit"],"meta":["January 2017","DOI:10.1007/978-3-319-71246-8_27","In book: Machine Learning and Knowledge Discovery in Databases (pp.442-458)"],"references":["313457188_Unsupervised_Exceptional_Attributed_Sub-Graph_Mining_in_Urban_Data","312307434_Exceptional_contextual_subgraph_mining","308384499_Local_Subgroup_Discovery_for_Eliciting_and_Understanding_New_Structure-Odor_Relationships","257553441_Diverse_subgroup_set_discovery","315869813_Exploring_Rated_Datasets_with_Rating_Maps","308393511_Exceptional_Preferences_Mining","307584527_Multi-Objective_Group_Discovery_on_the_Social_Web","291630247_Exceptional_Model_Mining_Supervised_descriptive_local_pattern_mining_with_complex_target_concepts","286847984_Mining_democracy","261465257_Analyzing_Voting_Behavior_in_Italian_Parliament_Group_Cohesion_and_Evolution"]}