{"id":"322183171_Identification_of_influential_spreaders_based_on_classified_neighbors_in_real-world_complex_networks","abstract":"Identifying the influential spreaders in complex network is a very important topic, which is conducive to deeply understanding the role of nodes in the information diffusion and epidemic spreading among a population. To this end, in this paper, we propose a novel classified neighbors algorithm to quantify the nodal spreading capability and further to differentiate the influence of various nodes. Here, we believe that the contribution of different neighbors to their focal node is different, and then classify the neighbors of the focal node according to the removal order of the neighbor in the process of k-shell decomposition. By assigning different weights for each class of neighbors and summing up the neighbors’ contributions, the spreading capacity of the focal node can be accurately characterized. Through extensive simulation experiments over 9 real-world networks, the weight distribution of different types of neighbors has been optimized, and the results strongly indicate that the current algorithm has the higher ranking accuracy and differentiation extent when compared to other algorithms, such as degree centrality, k-shell decomposition method and mixed degree decomposition approach. Current results can help to greatly reduce the cost of sales promotion, considerably suppress the rumor dissemination and effectively control the outbreak of epidemics within many real-world systems.","authors":["Chao Li","Li Wang","Shiwen Sun","Chengyi Xia"],"meta":["March 2018Applied Mathematics and Computation 320:512-523","DOI:10.1016/j.amc.2017.10.001"],"references":["277334106_Improving_the_accuracy_of_the_k-shell_method_by_removing_redundant_links_From_a_perspective_of_spreading_dynamics","276070992_Core-like_groups_result_in_invalidation_of_identifying_super-spreader_by_k-shell_decomposition","275275456_Epidemic_spreading_model_of_complex_dynamical_network_with_the_heterogeneity_of_nodes","265388758_Spatial_epidemiology_of_networked_metapopulation_an_overview"]}