{"id":"322138395_Computing_Allied_Engineering_Domain_in_India_with_reference_to_Private_Universities_A_Case_Study_of_Bachelors_Programs","abstract":"Computing has been considered as important tools and technologies for information activities ranging from collection, selection, organization, processing, management, and dissemination of information. Computer Science including other allied fields becomes important for the creation of computation systems around the world. As the progress in the computing technology continues in the society, many universities around the world have started Computing and Information Technology related degrees. India is rising rapidly in terms of many things including economy and education. As a developing country, India is shining and growing rapidly in the education sector through its liberal higher education policies. India is considered as one of the important nations for the growth in Engineering education and skill development. India holds world largest higher educational institutions and about eight hundreds of them are degree awarding bodies. There are good numbers of Engineering programs mainly offered in the Engineering and Technological Colleges and Universities of different kinds. In recent past among the Higher educational Institutes in India Engineering programs have been started rapidly in private universities. This study provides a detailed overview of higher educational institutions in India emphasizing Engineering sectors. This study provides a strong focus on computing and information technology related programs available in private universities in India in Engineering segment.","authors":["Sreeramana Aithal","P.K. Paul","A. Bhuimali"],"meta":["November 2017","DOI:10.5281/zenodo.1089937.","Project: Information Technology and Science"],"references":["226085821_Financing_higher_education_in_India","225972339_The_dilemma_of_change_in_Indian_higher_education","44807123_Pharmacy_Education_in_India","320674521_A_Novel_Educational_Proposal_and_Strategies_Toward_Promoting_Cloud_Computing_Big_Data_and_Human-Computer_Interaction_in_Engineering_Colleges_and_Universities","284866579_Balanced_scorecards_in_managing_higher_education_institutions_An_Indian_perspective","272390085_Information_Science_A_Potential_interdisciplinary_field_with_Historical_Perspectives_and_Future_Potentials","267369946_Higher_Education_in_India_Structure_Statistics_and_Challenges","240542929_Transition_from_higher_education_as_a_public_good_to_higher_education_as_a_private_good_the_saga_of_Indian_experience","229792055_Higher_Education_in_India_Growth_Concerns_and_Change_Agenda","228294594_Getting_the_Numbers_Right_International_Engineering_Education_in_the_United_States_China_and_India"]}