{"id":"322171503_Design_and_modeling_of_constant-force_mechanisms_A_survey","abstract":"Constant-force mechanisms (CFMs) have become a hot research topic in recent years. Unlike conventional force control technology by using force sensor and controller, which leads to a complicated algorithm design and higher cost, the CFMs can provide a near constant force output by using the property of mechanical structure. Hence, the CFMs are widely used in overload protection, biomedical application, and robot end-effectors for providing a friendly interaction with the environment as well as micromanipulation for protecting the micro-objects from being damaged. This paper presents a survey of the state-of-the-art design and modeling approaches for constant-force mechanisms. According to the working principles, the CFMs are classified into five kinds of conventional rigid-link constant-force mechanisms and five kinds of fully compliant constant-force mechanisms. In addition, the comparisons between different types of the CFMs are discussed. In particular, compliant constant-force mechanisms emerge as promising devices owing to the specific advantages. Four modeling methods and five types of compliant constant-force mechanism designs are introduced in detail. The presented overview is helpful to those engaged in constant-force mechanism area to know the recent state and research tendency.","authors":["Piyu Wang","Qingsong Xu"],"meta":["January 2018Mechanism and Machine Theory 119:1-21","DOI:10.1016/j.mechmachtheory.2017.08.017"],"references":["289687305_Simplified_modelling_and_development_of_a_bi-directionally_adjustable_constant-force_compliant_gripper","309040427_Design_and_Control_of_a_Novel_Compliant_Constant-Force_Gripper_Based_on_Buckled_Fixed-Guided_Beams","298737036_Design_of_a_Curved_Surface_Constant_Force_Mechanism","282745297_Design_and_Development_of_a_Compact_Flexure-Based_XY_Precision_Positioning_System_With_Centimeter_Range","275437196_On_the_analytical_and_experimental_assessment_of_the_performance_of_a_quasi-zero-stiffness_isolator","269363405_Overview_of_Micro-Force_Sensing_Methods"]}