{"id":"322112114_Modeling_the_effects_of_age_and_gender_on_normal_pediatric_brain_metabolism_using_F18-FDG_PETCT","abstract":"Normal databases of pediatric brain metabolism are uncommon, as local brain metabolism evolves significantly with age throughout childhood, limiting their clinical applicability. The aim of this study was to develop mathematical models of regional relative brain metabolism (RRBM) using pediatric F18-FluoroDeoxyGlucose (FDG) Positron Emission Tomography (PET) with Computed Tomography (CT) data of normal pediatric brains, accounting for gender and age. Methods: PET/CT brain acquisitions were obtained from 88 neurologically-normal subjects, aged 6 months to 18 years. Subjects were assigned to either development (n = 59) or validation groups (n = 29). For each subject, commercially available software (NeuroQTM) was used to quantify the relative metabolism of 47 separate brain regions using whole-brain normalized (WBN) and pons normalized (PN) activity. The effects of age on RRBM were modeled using multiple linear and non-linear mathematical equations and the significance of gender was assessed using the Student t-test. Optimal models were selected using the Akaike Information Criterion. Mean predicted values and 95% prediction intervals were derived for all regions. Model predictions were compared to the validation data set and mean predicted error was calculated for all regions using both WBN and PN models. Results: As a function of age, optimal models of RRBM were linear for 7 regions, quadratic for 13, cubic for 6, logarithmic for 12, power for 7, and modified power laws for 4regions using WBN data; linearfor 9 regions, quadratic for 27, cubic for 2, logarithmic for 5 and power for 2 using PN data. Gender differences were found to be statistically significant only in the posterior cingulate cortex for the WBN data. Comparing our models to the validation group resulted in 94.3% of regions falling within the 95% prediction interval for WBN and 94.1% for PN. For all the brain regions in the validation group, the percentage of error in prediction was 3 ± 0.96% using WBN data, and 4.72 ± 1.25% when compared to the PN data (P < 0.0001). Conclusion: Pediatric brain metabolism is a complex function of age and gender. We have developed mathematical models of brain activity which allow for accurate prediction of regional pediatric brain metabolism.","authors":["Sophie Turpin","Patrick Martineau","Marc-André Levasseur","Raymond Lambert"],"meta":["December 2017Journal of Nuclear Medicine 59(7):jnumed.117.201889","DOI:10.2967/jnumed.117.201889"],"references":["311466472_The_need_of_standardization_and_of_large_clinical_studies_in_an_emerging_indication_of_18FFDG_PET_the_autoimmune_encephalitis","292990616_Temporal_epilepsy_lesions_may_be_detected_by_the_voxel-based_quantitative_analysis_of_brain_FDG-PET_images_using_an_original_block-matching_normalization_software","273146622_Establishing_Age-Associated_Normative_Ranges_of_the_Cerebral_18F-FDG_Uptake_Ratio_in_Children","268232215_Validation_of_an_optimized_SPM_procedure_for_FDG-PET_in_dementia_diagnosis_in_a_clinical_setting","259253827_Normal_cerebral_FDG_uptake_during_childhood","234068504_Optimizing_statistical_parametric_mapping_analysis_of_F-FDG_PET_in_children","313811016_Diagnostic_value_of_18F-FDG_PETCT_versus_MRI_in_the_setting_of_antibody-specific_autoimmune_encephalitis","269283435_Voxel-based_analysis_of_normal_cerebral_18FFDG_uptake_during_childhood_using_statistical_parametric_mapping","263353274_Performance_evaluation_of_the_Ingenuity_TF_PETCT_scanner_with_a_focus_on_high_count-rate_conditions","253339492_Cerebral_Glucose_Metabolism_on_Positron_Emission_Tomography_of_Children"]}