{"id":"322105532_Assessing_interoperability_requirements_in_networked_enterprises_A_model-based_system_engineering_approach","abstract":"When two or more systems work together, it is crucial to verify interoperability. Systems engineers should be working to continuously improve the ability to interoperate for maintaining a sustainable and efficient collaboration among the networked systems. Systems could benefit from the use of interoperability assessments for identifying their strengths and weakness as well as their compatibility with potential collaborative peer systems. However, the current assessment approaches do not explicitly define the interoperability requirements and their interdependencies. Acknowledging the different requirement dependencies supports the identification of impacts on the overall system, for example implications within a network caused by changes in the collaboration strategy or the introduction of a new information technology tool. Thus, based on model-based systems engineering, this paper defines a networked enterprise as a system of systems (SoS) and proposes to use the SoS characteristics for identifying interoperability requirements and their dependencies. Further, we formalise and utilise inputs for an assessment tool.","authors":["Gabriel Da Silva Serapiao Leal","Wided Guédria","Hervé Panetto"],"meta":["December 2017Insight 20(4):15-18","DOI:10.1002/inst.12174","Project: Decision Support for Interoperability Readiness in Networked Enterprise"],"references":["263203151_Extending_the_Ontology_of_Enterprise_Interoperability_OoEI_Using_Enterprise-as-System_Concepts","235192607_Survey_on_Interoperability_Measurement","227067444_Collaborative_Networks_A_New_Scientific_Discipline","40721053_System_of_Enterprise-Systems_Integration_Issues_an_Engineering_Perspective","37933517_Anatomy_of_Enterprise_Collaborations","303823336_Towards_a_Meta-Model_for_Networked_Enterprise","260317569_A_Formal_Framework_for_the_Formalization_of_Informal_Requirements","259117718_Interoperability_evaluation_models_A_systematic_review","235110140_Behind_the_Wizard's_Curtain_An_Integration_Environment_for_a_System_of_Systems","220594383_Towards_a_Systemic_Formalisation_of_Interoperability"]}