{"id":"322148739_Order_batching_in_an_automated_warehouse_with_several_vertical_lift_modules_Optimization_and_experiments_with_real_data","abstract":"The vertical lift module is an automated storage and retrieval system widely used in warehouses. The performance of a warehouse with vertical lift modules is highly correlated with the efficiency of the order picking. Order batching, namely regrouping customers' orders into batches to be collected from the module, constitutes a critical decision impacting the picking efficiency. In this paper, we provide optimization models for order batching, with the objective of minimizing total completion time, that is, the time required to collect a given set of customers' orders. We first consider the case of one vertical lift module and then extend our approach to study a warehouse with several modules. We use real data from two companies operating in different sectors in order to test and validate our models. Numerical experiments show that our models perform much better than the batching method currently used by these companies. For complex cases that cannot be solved within a reasonable timeframe with Cplex, we develop a metaheuristic approach, which generally yields very good solutions in less than one minute. This paper investigates problems that are firmly grounded in practice. Our batching models and metaheuristic approach have been implemented in practice and are currently used by some companies.","authors":["Lenoble Nicolas","Yannick Frein","Ramzi Hammami"],"meta":["December 2017European Journal of Operational Research 267(3)","DOI:10.1016/j.ejor.2017.12.037"],"references":["263371904_Development_of_a_framework_for_the_design_of_autonomous_vehicle_storage_and_retrieval_systems","258109768_Metaheuristics_for_the_Order_Batching_Problem_in_Manual_Order_Picking_Systems","281706986_Travel_time_model_for_double-deep_shuttle-based_storage_and_retrieval_systems","263058182_Energy_efficiency_model_for_the_mini-load_automated_storage_and_retrieval_systems"]}