{"id":"322135044_Problem-based_Learning_for_Programming_Education","abstract":"Computer Programming is a core subject in Computer Science. This course requires the analysis and solving of problem critically. These skills are also required in preparing Computer Science students for the career world. Problem-based Learning is thus regarded as one of the suitable methods for Teaching and Learning programming. Although this method has been proven to hone student skills in other areas such as Medicine, its usage in Computer Programming courses has yet to bring about any impacts. This is because, to date, Problem-based Learning has been employed based on the practitioner's intuition without specifically meeting the principles and concepts of Programming courses from the human, process, and product aspects. The human aspect involves practitioners during the process. The framework for this study is built using a qualitative method that combines theoretical and empirical studies. The theoretical study includes reviews of the implementation of previous Problem-based Learning in Computer Science as well as other fields. The empirical study involves information obtained from both the theoretical and empirical studies were analysed by utilising the Thematic Analysis method to generate the proposed framework for this study. This framework can be utilised as a guide for the management and practitioners in Computer Science education to use Problem-based Learning as an effective Teaching and Learning method for Programming courses.","authors":["Aminah Bibi Bawamohiddin","Rozilawati Razali"],"meta":["December 2017International Journal on Advanced Science Engineering and Information Technology 7(6):2035","DOI:10.18517/ijaseit.7.6.2232"],"references":["312056149_Flipped_Classroom_with_Problem_Based_Activities_Exploring_Self-regulated_Learning_in_a_Programming_Language_Course","308959657_Teaching_Computer_Programing_as_Knowledge_Transfer_Some_Impacts_on_Software_Engineering_Productivity","304405518_Design_and_Validation_of_Online_Learning_Environment_Questionnaire","275538706_The_Effects_of_Problem-based_Learning_Method_in_Higher_Education_on_Creative_Thinking","261041483_PBL_in_teaching_computing_An_overview_of_the_last_15_years","316858624_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","289464112_Problem_Solving_-_LargeSmall_HardEasy_ConsciousNonconscious_Problem-SpaceProblem-Solver_The_Issue_of_Dichotomization","271741153_Problem-Based_Learning_Framework_for_Junior_Software_Developer_Empirical_Study_for_Computer_Programming_Students","265092235_Characteristics_of_Problem-Based_Learning","260793267_Innovative_Practices_in_Teaching_Information_Sciences_and_Technology_Experience_Reports_and_Reflections"]}