{"id":"322143281_An_integrated_semantic_framework_for_designing_context-aware_Internet_of_Robotic_Things_systems","abstract":"The paradigm of Internet of Robotic Things (IoRT) extends the scope of the Internet of Things by endowing any object with the three main typical functions of any robotic system: Perception, actuation, and control. This paper presents a semantic framework for context-aware IoRT systems to support the development of applications for monitoring and managing IoRT systems. A knowledge representation framework, called SmartRules, is proposed for context modeling. SmartRules is a production rules language that enables reactive reasoning based on the closed world and unique name assumptions. It allows producing actions based on contextual information represented in a dedicated ontology language, called-Concept. An operational platform, centered on the notion of manageable object (MO), is also proposed to abstract the access to any physical or virtual device, which can communicate through the Internet. In addition, an integrated methodology and tools are proposed for guiding the development and deployment of context-aware Semantic IoRT systems, and, in particular, for defining context semantics and creating context management rules. To show the effectiveness of the proposed framework in ambient assisted living (AAL) applications, an IoRT system dedicated to the monitoring and assistance of an elderly person during his/her daily living activities is described and evaluated.","authors":["Lyazid Sabri","Sofiane Bouznad","Sandro Rama Fiorini","Abdelghani Chibani"],"meta":["December 2017Integrated Computer Aided Engineering 25(11):1-20","DOI:10.3233/ICA-170559"],"references":["297677866_Fall_detection_and_activity_identification_using_wearable_and_hand-held_devices","319395635_The_Description_Logic_Handbook_Theory_Implementation_and_Applications","319393494_Ontologies_A_Silver_Bullet_for_Knowledge_Management_and_Electronic_Commerce","305719522_Networked_Robots","301965842_Ontologies","285884771_The_SSN_ontology_of_the_semantic_sensor_networks_incubator_group","281390820_Enabling_context-aware_smart_home_with_semantic_technology","274903017_CONSERT_Applying_semantic_web_technologies_to_context_modeling_in_ambient_intelligence","271855452_A_gap_analysis_of_Internet-of-Things_platforms","269309090_Short_paper_Object_collaboration_model_to_create_joint_knowledge_in_WoO_environment"]}