{"id":"322190293_Percepcion_de_los_Estudiantes_sobre_el_Aprendizaje_Significativo_y_Estrategias_de_Ensenanza_en_el_Blended_Learning","abstract":"Uno de los retos más importantes para la investigación educativa en los últimos años ha sido conocer de qué manera las tic y las estrategias de enseñanza utilizadas por los docentes impactan en el aprendizaje significativo de los estudiantes, pues a pesar de que se están realizando constantes acciones pedagógicas que permitan combinar las tic con la formación tradicional, modalidad educativa llamada blended learning, aún no se cuentan con resultados concretos que permitan demostrar el éxito que tienen este tipo de acciones. El objetivo es reconocer la percepción que tienen los estudiantes del aprendizaje significativo que alcanzan y las estrategias de enseñanza que utilizan sus profesores en este tipo de modalidades. Para el cumplimiento de tal objetivo, se diseñó y validó la denominado “Escala de Percepción de Aprendizaje Significativo en el Blended Learning”, la cual mostró adecuadas propiedades psicométricas, lo que permite considerarse como válido y confiable. La muestra estuvo integrada por 110 alumnos de la carrera de abogado de una institución pública. Los resultados muestran que los participantes tienen la percepción de que su nivel de aprendizaje significativo combinado con las estrategias de enseñanza que utilizan sus profesores alcanza niveles medios, existiendo diferencias significativas conforme a la edad de los mismos, lo cual sugiere poner mayor énfasis en el tipo de estrategias utilizadas en el blended learning.","authors":["María del Rocío Carranza Alcántar","Juan Francisco Caldera Montes"],"meta":["January 2018Revista Iberoamericana sobre Calidad, Eficacia y Cambio en Educación 16.1(2018)","DOI:10.15366/reice2018.16.1.005"],"references":["331640254_LOS_RECURSOS_DIDACTICOS_COMO_FUENTE_DE_APRENDIZAJE_SIGNIFICATIVO","317261157_PERCEPCION_DE_LOS_ESTUDIANTES_SOBRE_EL_VALOR_DE_LAS_TIC_EN_SUS_ESTRATEGIAS_DE_APRENDIZAJE_Y_SU_RELACION_CON_EL_RENDIMIENTO","312426021_Las_Concepciones_sobre_el_Proceso_de_Evaluacion_del_Aprendizaje_de_los_Estudiantes_Conceptions_about_Assessment_Process_of_Students'_Learning","312040324_Actividades_de_aprendizaje_con_tecnologias_en_la_universidad_Que_uso_hacen_los_profesores","304708320_Adecuacion_de_la_Planeacion_Didactica_como_Herramienta_Docente_en_un_Modelo_Universitario_Orientado_al_Aprendizaje","295705351_La_prctica_del_estudiante_en_el_b-learning_una_observacin_sistmica","280762128_Estrategias_de_aprendizaje_Funcion_y_diagnostico_en_el_aprendizaje_adolescente","277262026_Blended_learning_Conceptos_basicos","276039408_Uso_de_redes_sociales_como_elemento_de_interaccion_y_construccion_de_contenidos_en_el_aula_cultura_participativa_a_traves_de_Facebook","299529787_Factores_Influyentes_en_Motivacion_y_Estrategias_de_Aprendizaje_en_los_Alumnos_de_Grado"]}