{"id":"322151496_Business_Informatics_A_possible_specialization_of_MSc-Information_Science_Technology_IST_Challenges_and_Opportunities_in_Developing_Countries_Context","abstract":"Information is one of the important domains, which deals with computing, information studies, and principles. Informatics is concerned with so many activities such as information collection, selection, organization, processing, management, and dissemination. Informatics and Information Science are close domains and even in many countries, they are treated as the same domain with different nomenclatures only. Information Science is an Applied Science domain responsible for information solution and at the same time technological solutions of the wider community and society. Information Science is available in so many universities and academic units and the flagship programme on Information Science is MSc-Information Science. Even in some universities specializations like Chemo informatics, Medical Informatics etc. are available. This paper talks about Information Science and its needs, values, characteristics. The Paper also talks about possibilities of introducing MSc- Information Science [Business Informatics] programme and also proposed Business Informatics specialization in Information Science [MSc] programme in Indian universities and elsewhere.","authors":["Sreeramana Aithal","P.K. Paul","A. Bhuimali"],"meta":["October 2017","DOI:10.5281/zenodo.1038399","Project: Information Technology and Science"],"references":["252113628_Learning_Objects_and_E-Learning_an_Informing_Science_Perspective","227634540_RELEVANCE_A_Review_of_and_a_Framework_for_the_Thinking_on_the_Notion_in_Information_Science","313018567_Information_science_in_theory_and_practice_Brian_Vickery_and_Alina_Vickery","229861386_Visualization_of_Literatures","223239215_An_essay_on_the_past_and_future_of_information_science_education-I_Historical_overview","222074593_An_essay_on_the_past_and_future_of_information_science_education-II","220432772_Information_Technology_Employment_and_the_Information_Sector_Trends_in_Information_Employment_1970-1995"]}