{"id":"322147999_Design_Engenharia_de_Usabilidade_aplicacao_pratica_na_criacao_de_um_aplicativo","abstract":"Para o profissional de design, a escolha da metodologia correta e do processo a ser seguido no desenvolvimento da solução de Design é primordial para o sucesso final. A metodologia se torna mais importante quando se trata do Design de aplicativos computacionais para o usuário final. De um lado, existem propostas metodológicas que focam nos aspectos técnicos (como o conhecido trabalho de Garret, por exemplo): há uma gama de estudos, metodologias, pesquisas e material didático direcionados para equipes de desenvolvimento de sistemas computacionais, que são provenientes da Ciência da Computação e da Engenharia, para profissionais dessas áreas. Estes trabalhos usam técnicas, jargões e práticas próprias. Por outro lado, encontram-se as metodologias voltadas para os aspectos tradicionais do Design tanto de produto quanto gráfico (como por exemplo as metodologias propostas no livro de George e Beaird – Princípios do Web Design Maravilhoso). Navegando entre estes extremos, os designers carecem de recomendações adequadas referentes ao estado da arte dos processos de construção das soluções digitais centradas nas necessidades do usuário, para que possam desenvolver sistemas que promovam uma melhor experiência do usuário. Este artigo apresenta um estudo de caso de desenvolvimento de um aplicativo de auxílio ao usuário na hora de tomar medicamentos. Tem-se como objetivo principal exemplificar como a Engenharia de Usabilidade se combina com técnicas específicas em cada uma de suas etapas; e mostrar o caminho percorrido no desenvolvimento do projeto de maneira a exemplificar o seu uso como complementar à formação do designer, valorizando seu papel de profissional essencial nas equipes multi/inter-disciplinares de design de aplicativos.","authors":["Cayley Guimarães","Leandro Augusto Ferras Dos Santos","Isabela Mantovani Fontana"],"meta":["December 2017Design & Tecnologia 7(14):11","DOI:10.23972/det2017iss14pp11-29"],"references":["281294308_USABILIDADE_NA_WEB_O_USUARIO_COMO_AGENTE-FACILITADOR_NO_DESENVOLVIMENTO_DE_INTERFACES_DE_HOME_PAGES","277947102_Innovation_in_HCI_What_Can_we_Learn_from_Design_Thinking","268330806_brazildigitaldividecom_Confronting_Inequality_in_the_Information_Society","264595739_Incremental_and_Radical_Innovation_Design_Research_vs_Technology_and_Meaning_Change","311473294_Integrating_usability_engineering_into_the_computer_science_curriculum_a_proposal","303542697_Usability_Engineering_Practices_in_Software_Development_Organizations_The_Greek_and_the_Italian_Case_Study","273068944_Cognition_and_Thought_An_Information_Processing_Approach","269495896_The_Psychology_of_Everyday_Things","260476390_Human-Computer_Interaction","255678851_Globalizing_usability_engineering_current_status_in_Japan"]}