{"id":"322167258_A_heuristic_method_for_simulating_open-data_of_arbitrary_complexity_that_can_be_used_to_compare_and_evaluate_machine_learning_methods","abstract":"A central challenge of developing and evaluating artificial intelligence and machine learning methods for regression and classification is access to data that illuminates the strengths and weaknesses of different methods. Open data plays an important role in this process by making it easy for computational researchers to easily access real data for this purpose. Genomics has in some examples taken a leading role in the open data effort starting with DNA microarrays. While real data from experimental and observational studies is necessary for developing computational methods it is not sufficient. This is because it is not possible to know what the ground truth is in real data. This must be accompanied by simulated data where that balance between signal and noise is known and can be directly evaluated. Unfortunately, there is a lack of methods and software for simulating data with the kind of complexity found in real biological and biomedical systems. We present here the Heuristic Identification of Biological Architectures for simulating Complex Hierarchical Interactions (HIBACHI) method and prototype software for simulating complex biological and biomedical data. Further, we introduce new methods for developing simulation models that generate data that specifically allows discrimination between different machine learning methods.","authors":["Jason H Moore","Maksim Shestov","Peter Schmitt","Randal S Olson"],"meta":["January 2018"],"references":["268282843_Heuristic_Identification_of_Biological_Architectures_for_Simulating_Complex_Hierarchical_Genetic_Interactions","231740094_GAMETES_A_Fast_Direct_Algorithm_for_Generating_Pure_Strict_Epistatic_Models_with_Random_Architectures","220694283_Evolutionary_Computation_for_Modeling_and_Optimization","216301261_A_Field_Guide_to_Genetic_Programming","47620860_Genome_Simulation_Approaches_for_Synthesizing_In_Silico_Datasets_for_Human_Genomics","23306987_A_Flexible_Forward_Simulator_for_Populations_Subject_to_Selection_and_Demography","7725131_SimuPOP_a_forward-time_population_genetics_simulation_environment","6703545_Data_simulation_software_for_whole-genome_association_and_other_studies_in_human_genetics"]}