{"id":"322138587_Indian_Higher_Education_With_Slant_to_Information_Technology-_A_Fundamental_Overview","abstract":"Education is most important facet for development. Education, training, and research are an integral and integrated parts each other. All these are responsible and dedicated for the better and healthy knowledge cultivation. Educational Institutions are responsible for the dedication of knowledge activities such as collection, selection, organization, processing, management, and dissemination of knowledge and similar activities. India is a developing country and growing fast to reach a status of developed nation education is a vital source and facets. Development of a country as a whole many a ways depends on the subjects and fields having applied in nature. Information Technology and Computing related subjects are playing a great for the complete and modern development of society. Even education systems have changed with the integration and application of Information Technology. The growths of Higher Educational Institutions (HEIs) are rapid in recent past as far as India is concerned. The increasing number of institutions, universities, especially self-financed is eye-catching. There are many merits and demerits of such type of institutions. The present paper is a kind of review one but also deals with the basics of policies that may be applied in future. Paper is presented many knowledge aspects in terms of a basic overview of institutions, numbers, engineering sectors, computing fields etc. in a brief manner.","authors":["Sreeramana Aithal","P.K. Paul","A. Bhuimali"],"meta":["November 2017","DOI:10.5281/zenodo.1090185.","Project: Information Technology and Science"],"references":["263155914_Inclusive_Education_in_India_International_concept_national_interpretation","320674521_A_Novel_Educational_Proposal_and_Strategies_Toward_Promoting_Cloud_Computing_Big_Data_and_Human-Computer_Interaction_in_Engineering_Colleges_and_Universities","320674263_Why_Green_Computing_and_Green_Information_Sciences_Have_Potentialities_in_Academics_and_iSchools_Practice_and_Educational_Perspectives","286062638_Sociology_of_Education_in_India_Changing_Contours_and_Emerging_Concerns","285122379_Developing_interpretive_structural_model_for_quality_framework_in_higher_education_Indian_context","284866579_Balanced_scorecards_in_managing_higher_education_institutions_An_Indian_perspective","281162259_Increasing_the_Retention_of_American_Indian_Students_in_Professional_Programs_in_Higher_Education","272390085_Information_Science_A_Potential_interdisciplinary_field_with_Historical_Perspectives_and_Future_Potentials","267369946_Higher_Education_in_India_Structure_Statistics_and_Challenges","266604863_Technical_Education_in_North_Eastern_India_Problems_and_prospects"]}