{"id":"322108803_Damped_Window_based_High_Average_Utility_Pattern_Mining_over_data_streams","abstract":"Data mining methods have been required in both commercial and non-commercial areas. In such circumstances, pattern mining techniques can be used to find meaningful pattern information. Utility pattern mining (UPM) is more suitable for evaluating the usefulness of patterns. The method introduced in this paper employs the high average utility pattern mining (HAUPM) approach, which is one of the UPM approaches and discovers interesting patterns of which the items have more meaningful relations among one another by using a novel utility measure. Meanwhile, past research on pattern mining algorithms mainly focus on mining tasks processing static database such as batch operations. Most continuous, unbounded stream data such as data constantly produced from heart beat sensors should be treated differently with respect to importance because up-to-date data may have higher influence than old data. Therefore, our approach also adopts the concept of the damped window model to gain more useful patterns in stream environments. Various experiments are performed on real datasets in order to demonstrate that the designed method not only provides important, recent pattern information but also requires less computational resources such as execution time, memory usage, scalability and significant test.","authors":["Unil Yun","Donggyu Kim","Eunchul Yoon","Hamido Fujita"],"meta":["December 2017Knowledge-Based Systems 144","DOI:10.1016/j.knosys.2017.12.029"],"references":["313698821_Efficient_algorithm_for_mining_high_average-utility_itemsets_in_incremental_transaction_databases","307619679_Indexed_list-based_high_utility_pattern_mining_with_utility_upper-bound_reduction_and_pattern_combination_techniques","300141470_EFIM_A_Highly_Efficient_Algorithm_for_High-Utility_Itemset_Mining","292949167_Efficient_mining_of_high_utility_patterns_with_considering_of_Rarity_and_Length","291018985_Mining_High_Utility_Patterns_in_One_Phase_without_Generating_Candidates","282545681_Efficient_Algorithms_for_Mining_Top-K_High_Utility_Itemsets","304617600_Efficient_representative_pattern_mining_based_on_weight_and_maximality_conditions","273328312_Incremental_high_utility_pattern_mining_with_static_and_dynamic_databases","271922599_Mining_top-k_frequent_patterns_with_combination_reducing_techniques","263578829_An_efficient_projection-based_indexing_approach_for_mining_high_utility_itemsets"]}