{"id":"322261928_Predicting_7-day_30-day_and_60-day_all-cause_unplanned_readmission_A_case_study_of_a_Sydney_hospital","abstract":"Background: \nThe identification of patients at high risk of unplanned readmission is an important component of discharge planning strategies aimed at preventing unwanted returns to hospital. The aim of this study was to investigate the factors associated with unplanned readmission in a Sydney hospital. We developed and compared validated readmission risk scores using routinely collected hospital data to predict 7-day, 30-day and 60-day all-cause unplanned readmission.\n\nMethods: \nA combination of gradient boosted tree algorithms for variable selection and logistic regression models was used to build and validate readmission risk scores using medical records from 62,235 live discharges from a metropolitan hospital in Sydney, Australia.\n\nResults: \nThe scores had good calibration and fair discriminative performance with c-statistic of 0.71 for 7-day and for 30-day readmission, and 0.74 for 60-day. Previous history of healthcare utilization, urgency of the index admission, old age, comorbidities related to cancer, psychosis, and drug-abuse, abnormal pathology results at discharge, and being unmarried and a public patient were found to be important predictors in all models. Unplanned readmissions beyond 7 days were more strongly associated with longer hospital stays and older patients with higher number of comorbidities and higher use of acute care in the past year.\n\nConclusions: \nThis study demonstrates similar predictors and performance to previous risk scores of 30-day unplanned readmission. Shorter-term readmissions may have different causal pathways than 30-day readmission, and may, therefore, require different screening tools and interventions. This study also re-iterates the need to include more informative data elements to ensure the appropriateness of these risk scores in clinical practice.","authors":["Yashar Maali","Oscar Perez-Concha","Enrico Coiera","David Roffe"],"meta":["January 2018BMC Medical Informatics and Decision Making 18(1)","DOI:10.1186/s12911-017-0580-8"],"references":["304609897_Utility_of_models_to_predict_28-day_or_30-day_unplanned_hospital_readmissions_An_updated_systematic_review","282001464_Real-time_prediction_of_mortality_readmission_and_length_of_stay_using_electronic_health_record_data","271593901_Predicting_30-Day_Readmissions_With_Preadmission_Electronic_Health_Record_Data","305785909_Further_limitations_of_the_HOSPITAL_score_in_US_hospitals","303164978_Potentially_avoidable_30-day_hospital_readmissions_in_medical_patients_Derivation_and_validation_of_a_prediction_model","281788018_Feasibility_of_30-Day_Hospital_Readmission_Prediction_Modeling_based_on_Health_Information_Exchange_Data","280687718_Greedy_Function_Approximation_A_Gradient_Boosting_Machine","279988793_Unplanned_30-Day_Readmissions_in_a_General_Internal_Medicine_Hospitalist_Service_at_a_Comprehensive_Cancer_Center","270909693_Examination_of_Unplanned_30-Day_Readmissions_to_a_Comprehensive_Cancer_Hospital","262265328_Preventing_30-Day_Hospital_Readmissions"]}