{"id":"322250594_Knowing_left_from_right_asymmetric_functional_connectivity_during_resting_state","abstract":"The functional organization of left and right hemispheres is different, and hemispheric asymmetries are thought to underlie variations in brain function across individuals. In this study, we assess how differences between hemispheres are reflected in Asymmetric Functional Connectivity (AFC), which provides a full description of how the brain’s connectivity structure during resting state differs from that of the same brain mirrored over the longitudinal fissure. In addition, we assess how AFC varies across subjects. Data were provided by the Human Connectome Project, including 423 resting state and combined language task fMRI data sets, and the pattern of AFC was established for all subjects. While we could quantify the symmetry of brain connectivity at 95%, significant asymmetries were observed, consisting foremost of: (1) higher correlations between language areas in the left hemisphere than between their right hemisphere homologues. (2) Higher correlations between language homologue areas in the right hemisphere and left default mode network, than between language areas in the left hemisphere and the default mode network in the right hemisphere. The extent to which subjects exhibited this pattern correlated with language lateralization and handedness. Further exploration in intersubject variation in AFC revealed several additional patterns, one involving entire hemispheres, and another correlations with limbic areas. These results show that language is an important, but not only determinant of AFC. The additional patterns of AFC require further research to be linked to specific asymmetric neuronal states or events.\n\nElectronic supplementary material\nThe online version of this article (10.1007/s00429-017-1604-y) contains supplementary material, which is available to authorized users.","authors":["Mathijs Raemaekers","Wouter Schellekens","Natalia Petridou","Nick F Ramsey"],"meta":["May 2018Brain Structure and Function 223(4)","DOI:10.1007/s00429-017-1604-y"],"references":["309686914_Development_of_the_Intrinsic_Language_Network_in_Preschool_Children_from_Ages_3_to_5_Years","271648481_Unmasking_Language_Lateralization_in_Human_Brain_Intrinsic_Activity","265558188_Functional_Specialization_in_the_Human_Brain_Estimated_By_Intrinsic_Hemispheric_Interaction","319646729_Inter-hemispherical_asymmetry_in_default-mode_functional_connectivity_and_BAIAP2_gene_are_associated_with_anger_expression_in_ADHD_adults","298329561_Intra-hemispheric_intrinsic_connectivity_asymmetry_and_its_relationships_with_handedness_and_language_Lateralization","284657937_Remarques_stir_le_siege_de_la_faculte_du_langage_articule_suivies_d'une_observation_d'aphemie_perte_de_la_parole","278045418_Intelligence-related_differences_in_the_asymmetry_of_spontaneous_cerebral_activity_Intelligence_and_Brain_Functional_Asymmetry","277530344_Automatically_Parcellating_the_Human_Cerebral_Cortex","277412964_Variation_in_homotopic_areas'_activity_and_inter-hemispheric_intrinsic_connectivity_with_type_of_language_lateralization_an_FMRI_study_of_covert_sentence_generation_in_297_healthy_volunteers","271331133_Functional_resting-state_connectivity_of_the_human_motor_network_Differences_between_right-_and_left-handers"]}