{"id":"322275534_An_outlier_detection_scheme_for_dynamical_sequential_datasets","abstract":"Outlier detection plays an important role in the pre-treatment of sequential datasets to obtain pure valuable data. This paper proposes an outlier detection scheme for dynamical sequential datasets. First, the conception of forward outlier factor(FOF) and backward outlier factor(BOF) are employed to measure an object’s similarity shared with its sequentially adjacent objects. The object that shows no similarity with its sequential neighbors is labeled as suspicious outliers, which will be treated subsequently to judge whether it is really an outlier in the dataset. Second, the sequentially adjacent suspicious outliers are defined as suspicious outlier series(SOS), then the expected path representing the ideal transition path through the suspicious outliers in the SOS and the measured path representing the real path through all the objects in the SOS are employed, and the ratio of the length of the expected path to that of the measured path indicates whether there exist outliers in the SOS. Third, in the case that there exist outliers in the SOS, if there are N suspicious outliers in the SOS, then 2N − 2 remaining path will be generated by removing k(0 < k < N) suspicious outliers and sequentially connecting the remaining ones. The dynamical sequential outlier factor(DSOF) is employed to represent the ratio of the length of measured path of the considered remaining path to the that of the the expected path of the corresponding SOS, and the degree of the objects removed in a remaining path being outliers is indicated by the DSOF. The proposed outlier detection scheme is conducted from a dynamical perspective, and breaks the tight relation between being an outlier and being not similar with adjacent objects. Experiments are conducted to evaluate the effectiveness of the proposed scheme, and the experimental results verify that the proposed scheme has higher detection quality for sequential dataset. In addition, the proposed outlier detection scheme is not dependent on the size of dataset and needs no prior information about the distribution of the data.","authors":["Shiliang Zhang","Hui Cao","Zonglin Ye","Yanbin Zhang"],"meta":["January 2018Communication in Statistics- Simulation and Computation 48(10):1-53","DOI:10.1080/03610918.2017.1414249"],"references":["263273751_A_novel_probabilistic_method_for_robust_parametric_identification_and_outlier_detection","263273601_Novel_Outlier-Resistant_Extended_Kalman_Filter_for_Robust_Online_Structural_Identication","261491747_PCA_sensitivity_The_role_of_representative_and_outlier_strides_in_gait_sequence","324640566_Outliers_in_Statistical_Data","324410612_Outliers_in_Statistical_Data","313664547_Improved_histograms_for_selectivity_estimation_of_range_predicates","305910935_A_simple_sequential_outlier_detection_with_several_residuals","305397619_Data_Clustering_A_Review","264994698_The_Identification_of_Multiple_Outliers","260324581_Information-Theoretic_Outlier_Detection_for_Large-Scale_Categorical_Data"]}