{"id":"322202972_Uzaktan_Egitim_Ogrencilerinin_Bilgisayar_Programlamaya_Yonelik_Tutumlarinin_Incelenmesi","abstract":"Bu çalışmada uzaktan eğitim öğrencilerinin bilgisayar programlamaya yönelik tutumlarının çeşitli değişkenler\naçısından incelenmesi amaçlanmıştır. Çalışma gurubunu Ahmet Yesevi Üniversitesinde uzaktan eğitim\nyoluyla eğitimlerini sürdüren Bilgisayar Mühendisliği, Yönetim Bilişim Sistemleri Mühendisliği ve Bilgisayar\nProgramcılığı bölümü öğrencileri oluşturmaktadır. Çalışmaya katılan öğrenciler, programlama dersini en az\nalgoritma düzeyinde almış 160 adet 1, 2, 3 ve 4. sınıf yüksek lisans (19), lisans (112) ve ön lisans (29)\nöğrencileridir. Verilerin toplanmasında Bilgisayar Programlamaya karşı Tutum Ölçeği (BPkTÖ) kullanılmıştır.\nÇalışmada elde edilen veriler normal dağılım gösterdiği için analizlerde bağımsız örneklem t-testi ve tek\nyönlü ANOVA parametrik istatistikleri kullanılmıştır. Çalışmanın sonuçlarına göre Faktör 1, Faktör 2 ve\nölçeğin tümünde öğrencilerin programlamaya karşı tutumlarının nötr, faktör 3 için olumlu, faktör 4 için ise\nolumsuz olduğu görülmektedir. Erkek ve kızların programlamaya karşı tutumlarında anlamlı bir farklılık\nyoktur. Sınıf ile programlamaya karşı tutumları arasında sadece faktör 1 için anlamlı bir fark bulunmuştur.\nSınıf arttıkça tutum da artmaktadır. Programlama amaçlı bilgisayar başında geçirilen süreye göre sadece\nBilgisayar mühendisliği bölümünde anlamlı bir fak bulunmuştur. Mezun olunan lise türü ile programlamaya\nkarşı tutumlar arasında anlamlı bir fark bulunamamıştır. Yüksek lisans, lisans ve ön lisans öğrencilerinin\nprogramlamaya karşı tutumları arasında anlamlı bir farklılık bulunamamıştır.","authors":["Uzaktan Eğitim","Öğrencilerinin Bilgisayar","Programlamaya Yönelik","Tutumlarının İncelenmesi"],"meta":["January 2018","Conference: ERPA 2016At: Saray Bosna"],"references":["302977538_Investigation_of_Attitudes_Towards_Computer_Programming_in_Terms_of_Various_Variables","26541534_Open_primary_education_school_students'_opinions_about_mathematics_television_programmes","274782531_Development_of_Computer_Programming_Attitude_Scale_for_University_Students","271303710_Engineering_and_CEIT_Student's_Attitude_towards_learning_computer_programming","242091808_An_investigation_of_factors_related_to_self-efficacy_for_Java_programming_among_engineering_students"]}