{"id":"322260317_Quality_Control_in_Crowdsourcing_A_Survey_of_Quality_Attributes_Assessment_Techniques_and_Assurance_Actions","abstract":"Crowdsourcing enables one to leverage on the intelligence and wisdom of potentially large groups of individuals toward solving problems. Common problems approached with crowdsourcing are labeling images, translating or transcribing text, providing opinions or ideas, and similar—all tasks that computers are not good at or where they may even fail altogether. The introduction of humans into computations and/or everyday work, however, also poses critical, novel challenges in terms of quality control, as the crowd is typically composed of people with unknown and very diverse abilities, skills, interests, personal objectives, and technological resources. This survey studies quality in the context of crowdsourcing along several dimensions, so as to define and characterize it and to understand the current state of the art. Specifically, this survey derives a quality model for crowdsourcing tasks, identifies the methods and techniques that can be used to assess the attributes of the model, and the actions and strategies that help prevent and mitigate quality problems. An analysis of how these features are supported by the state of the art further identifies open issues and informs an outlook on hot future research directions.","authors":["Florian Daniel","Pavel Kucherbaev","Cinzia Cappiello","Boualem Benatallah"],"meta":["January 2018ACM Computing Surveys 51(1):1-40","DOI:10.1145/3148148"],"references":["318830137_The_Many_Benefits_of_Annotator_Rationales_for_Relevance_Judgments","312524607_Volunteering_vs_Work_for_Pay_Incentives_and_Tradeoffs_in_Crowdsourcing","311491468_ReLauncher_Crowdsourcing_Micro-Tasks_Runtime_Controller","348864528_Enhancing_Learning_Through_Self-assessment","326335500_A_Survey_of_Trust_in_Computer_Science_and_the_Semantic_Web","312807507_Peoplecloud_for_the_globally_integrated_enterprise","312635188_Using_Hierarchical_Skills_for_Optimized_Task_Assignment_in_Knowledge-Intensive_Crowdsourcing","311584518_An_Introduction_to_Outlier_Analysis","311490300_Parting_Crowds_Characterizing_Divergent_Interpretations_in_Crowdsourced_Annotation_Tasks","311489038_Quality_Management_in_Crowdsourcing_using_Gold_Judges_Behavior"]}