{"id":"322274676_Modelling_interaction_dynamics_between_two_foliar_pathogens_in_wheat_A_multi-scale_approach","abstract":"Background and aims: \nDisease models can improve our understanding of dynamic interactions in pathosystems and thus support the design of innovative and sustainable strategies of crop protections. However, most epidemiological models focus on a single type of pathogen, ignoring the interactions between different parasites competing on the same host and how they are impacted by properties of the canopy. This study presents a new model of a disease complex coupling two wheat fungal diseases, caused by Zymoseptoria tritici (septoria) and Puccinia triticina (brown rust), respectively, combined with a functional-structural plant model of wheat.\n\nMethods: \nAt the leaf scale, our model is a combination of two sub-models of the infection cycles for the two fungal pathogens with a sub-model of competition between lesions. We assume that the leaf area is the resource available for both fungi. Due to the necrotic period of septoria, it has a competitive advantage on biotrophic lesions of rust. Assumptions on lesion competition are first tested developing a geometrically explicit model on a simplified rectangular shape, representing a leaf on which lesions grow and interact according to a set of rules derived from the literature. Then a descriptive statistical model at the leaf scale was designed by upscaling the previous mechanistic model, and both models were compared. Finally, the simplified statistical model has been used in a 3-D epidemiological canopy growth model to simulate the diseases dynamics and the interactions at the canopy scale.\n\nKey results: \nAt the leaf scale, the statistical model was a satisfactory metamodel of the complex geometrical model. At the canopy scale, the disease dynamics for each fungus alone and together were explored in different weather scenarios. Rust and septoria epidemics showed different behaviours. Simulated epidemics of brown rust were greatly affected by the presence of septoria for almost all the tested scenarios, but the reverse was not the case. However, shortening the rust latent period or advancing the rust inoculum shifted the competition more in favour of rust, and epidemics became more balanced.\n\nConclusions: \nThis study is a first step towards the integration of several diseases within virtual plant models and should prompt new research to understand the interactions between canopy properties and competing pathogens.","authors":["Guillaume Garin","Christophe Pradal","Christian Fournier","David Claessen"],"meta":["December 2017Annals of Botany 121(5)","DOI:10.1093/aob/mcx186","Project: Modelling interactions in physiologically structured populations: competition, predation, cannibalism, disease,  behavior"],"references":["322739159_Plant_architecture_and_foliar_senescence_impact_the_race_between_wheat_growth_and_Zymoseptoria_tritici_epidemics","317544732_Morphological_Plant_Modeling_Unleashing_Geometric_and_Topological_Potential_within_the_Plant_Sciences","313226449_Reshaping_Plant_Biology_Qualitative_and_Quantitative_Descriptors_for_Plant_Morphology","312191159_Spatial_competition_dynamics_between_reef_corals_under_ocean_acidification","305951242_CN-Wheat_a_functional-structural_model_of_carbon_and_nitrogen_metabolism_in_wheat_culms_after_anthesis_II_Model_evaluation","346063282_EFFECTS_OF_GRASSLAND_PLANT_SPECIES_DIVERSITY_ABUNDANCE_AND_COMPOSITION_ON_FOLIAR_FUNGAL_DISEASE","321612174_Coral_Reefs_An_Ecosystem_in_Transition","312567581_The_shade_avoidance_syndrome_Multiple_signals_and_ecological_consequences_Neighbor_detection_and_shade-avoidance","312487598_Openalea_scientific_workflows_combining_data_analysis_and_simulation","308089603_Modelling_crop-weed_competition_Why_what_how_and_what_lies_ahead"]}