{"id":"322275354_A_hybrid_algorithm_combining_lexisearch_and_genetic_algorithms_for_the_quadratic_assignment_problem","abstract":"Lexisearch and genetic algorithms are two different types of methods for solving combinatorial optimization problems. Lexisearch algorithm gives us exact optimal solution, whereas, genetic algorithms give heuristic solution to a problem. In this paper, a hybrid algorithm (LSGA) that combines lexisearch and genetic algorithms is developed to obtain heuristic solution to the quadratic assignment problem. The proposed algorithm uses lexisearch algorithm to generate initial population, self-adaptively three crossover operators, and randomly one of four mutation operators, restricted combined mutation operator as local search, and multi-parent sequential constructive crossover as immigration method. The self-adaptive crossover operator that consists of one-point crossover, swap path crossover and sequential\nconstructive crossover can produce better solutions. Also, the random selection of a mutation operator effectively prevents LSGA from being stuck in local optimal zone. Further, the immigration method with combined mutation effectively generated very good chromosomes, which promotes the convergence rate and accuracy of the solution. Experimental results on four categories of benchmark QAPLIB\ninstances show the effectiveness of the LSGA. Out of 35 instances 18 instances have been solved optimally, and for the remaining instances, solutions are very close to the optima. Finally, a comparative study has been carried out between LSGA and unified particle swarm optimization (UPSO) for the same instances. In terms of solution\nquality, LSGA outperformed UPSO for all category of instances. Also, in terms of computational time, except for seven instances, LSGA outperformed UPSO.","authors":["Zakir Hussain Ahmed"],"meta":["January 2018Cogent Engineering 5(1)","DOI:10.1080/23311916.2018.1423743","Project: Multi-parent Hybrid Genetic Algorithms for the Quadratic Assignment Problem"],"references":["325222004_Development_of_modified_discrete_particle_swarm_optimization_algorithm_for_quadratic_assignment_problems","308571106_Parameter_Selection_of_Discrete_Particle_Swarm_Optimization_Algorithm_for_the_Quadratic_Assignment_Problems","282590022_Particle_Swarm_Algorithm_Variants_for_the_Quadratic_Assignment_Problems_-_A_Probabilistic_Learning_Approach","275716879_A_multi-parent_genetic_algorithm_for_the_quadratic_assignment_problem","274310248_An_Improved_Genetic_Algorithm_using_Adaptive_Mutation_Operator_for_the_Quadratic_Assignment_Problem","274310229_A_Simple_Genetic_Algorithm_using_Sequential_Constructive_Crossover_for_the_Quadratic_Assignment_Problem","313202522_Effective_local_and_guided_variable_neighbourhood_search_methods_for_the_asymmetric_travelling_salesman_problem","299272099_Performance_of_chaos_and_burst_noises_injected_to_the_Hopfield_NN_for_quadratic_assignment_problems","285323814_On_the_solution_of_traveling_salesman_problems_documenta_mathematica_journal_der_deutschen_mathematiker-vereinigung_vol_Extra_Volume_ICM_III","274894906_Experimental_analysis_of_crossover_and_mutation_operators_on_the_quadratic_assignment_problem"]}