{"id":"322245417_EEG_in_neonates_Forward_modeling_and_sensitivity_analysis_with_respect_to_variations_of_the_conductivity","abstract":"The paper is devoted to the analysis of electroencephalography (EEG) in neonates. The goal is to investigate the impact of fontanels on EEG measurements, i.e. on the values of the electric potential on the scalp. In order to answer this clinical issue, a complete mathematical study (modeling, existence and uniqueness result, realistic simulations) is carried out. A model for the forward problem in EEG source localization is proposed. The model is able to take into account the presence and ossification process of fontanels which are characterized by a variable conductivity. From a mathematical point of view, the model consists in solving an elliptic problem with a singular source term in an inhomogeneous medium. A subtraction approach is used to deal with the singularity in the source term, and existence and uniqueness results are proved for the continuous problem. Discretization is performed with 3D Finite Elements of type P1 and error estimates are proved in the energy (H 1-)norm. Numerical simulations for a three-layer spherical model as well as for a realistic neonatal head model including or not the fontanels have been obtained and corroborate the theoretical results. A mathematical tool related to the concept of Gâteau derivatives is introduced which is able to measure the sensitivity of the electric potential with respect to small variations in the fontanel conductivity. This study attests that the presence of fontanels in neonates does have an impact on EEG measurements. 2010 Mathematics Subject Classification. Primary: 92C50, 65N30, 49K40, 35B30; Secondary: 65N12.","authors":["Hamed Azizollahi","Marion Darbas","Mohamadou Malal Diallo","Abdellatif El Badia"],"meta":["January 2018Mathematical biosciences and engineering: MBE 15(4)","DOI:10.3934/mbe.2018041"],"references":["303788364_Assessment_of_two_approximation_methods_for_the_inverse_problem_of_electroencephalography","303687518_Effects_of_uncertainty_in_head_tissue_conductivity_and_complexity_on_EEG_forward_modeling_in_neonates","282859335_FEM_Method_for_the_EEG_Forward_Problem_and_Improvement_Based_on_Modification_of_the_Saint_Venant's_Method","277892976_Comparison_Study_for_Whitney_Raviart-Thomas_Type_Source_Models_in_Finite_Element_Method_Based_EEG_Forward_Modeling","276121552_Optimal_design_for_parameter_estimation_in_EEG_problems_in_a_3D_multilayered_domain","271224507_Identifiability_Properties_for_Inverse_Problems_in_EEG_Data_Processing_Medical_Engineering_with_Observability_and_Optimization_Issues","331134366_An_inverse_dipole_source_problem_in_inhomogeneous_media_Application_to_the_EEG_source_localization_in_neonates","263514717_A_guideline_for_head_volume_conductor_modeling_in_EEG_and_MEG","262195411_Neonatal_EEG_at_scalp_is_focal_and_implies_high_skull_conductivity_in_realistic_neonatal_head_models","254497888_Source_localization_using_rational_approximation_on_plane_sections"]}