{"id":"322285433_Human_visual_exploration_reduces_uncertainty_about_the_sensed_world","abstract":"In previous papers, we introduced a normative scheme for scene construction and epistemic (visual) searches based upon active inference. This scheme provides a principled account of how people decide where to look, when categorising a visual scene based on its contents. In this paper, we use active inference to explain the visual searches of normal human subjects; enabling us to answer some key questions about visual foraging and salience attribution. First, we asked whether there is any evidence for ‘epistemic foraging’; i.e. exploration that resolves uncertainty about a scene. In brief, we used Bayesian model comparison to compare Markov decision process (MDP) models of scan-paths that did–and did not–contain the epistemic, uncertainty-resolving imperatives for action selection. In the course of this model comparison, we discovered that it was necessary to include non-epistemic (heuristic) policies to explain observed behaviour (e.g., a reading-like strategy that involved scanning from left to right). Despite this use of heuristic policies, model comparison showed that there is substantial evidence for epistemic foraging in the visual exploration of even simple scenes. Second, we compared MDP models that did–and did not–allow for changes in prior expectations over successive blocks of the visual search paradigm. We found that implicit prior beliefs about the speed and accuracy of visual searches changed systematically with experience. Finally, we characterised intersubject variability in terms of subject-specific prior beliefs. Specifically, we used canonical correlation analysis to see if there were any mixtures of prior expectations that could predict between-subject differences in performance; thereby establishing a quantitative link between different behavioural phenotypes and Bayesian belief updating. We demonstrated that better scene categorisation performance is consistently associated with lower reliance on heuristics; i.e., a greater use of a generative model of the scene to direct its exploration.","authors":["Muammer Berk Mirza","Rick A Adams","Christoph Mathys","Karl J Friston"],"meta":["January 2018PLoS ONE 13(1):e0190429","DOI:10.1371/journal.pone.0190429"],"references":["303958606_Scene_Construction_Visual_Foraging_and_Active_Inference","284023138_Bayesian_model_reduction_and_empirical_Bayes_for_group_DCM_studies","272520403_Active_inference_and_epistemic_value","310627938_Active_Inference_A_Process_Theory","304714021_Active_inference_and_learning","304146457_What's_new_in_Psychtoolbox-3","297107122_Cognitive_determinants_of_fixation_location_during_picture_viewing","292136499_A_saliency-based_search_mechanism_for_overt_and_covert_shifts_of_visual_attention","244958444_A_Mathematical_Theory_of_Communication_The_Bell_System_Technical_Journal","242412506_Eye_Movements_During_Perception_of_Complex_Objects"]}