{"id":"322280831_Increasing_student_engagement_through_virtual_interactions_How","abstract":"Our ongoing research is focusing on identifying and taxonomising the elements and the factors that affect learner engagement with virtual worlds when hybrid virtual learning models are used. Our main hypothesis links learner engagement with interactions, both in the virtual world and in the physical classroom. In order to examine this subject, there is an elaboration on and consideration of aspects such as the learners’ prior experiences in the use of virtual worlds, their preconceptions about using them as a learning tool and the impact that the instructional designers’ choices have on enhancing the opportunities for interactions. In this paper, we examine the impact that the orientation process has on university students who study computer science and have almost no experience in the use of virtual worlds. Our findings suggest that the orientation process contributed positively to students’ smooth induction and that resulted in having meaningful and engaging interactions. Furthermore, students’ simultaneous coexistence in both environments eliminated the drawbacks of each educational approach and broadened the network of interactions.","authors":["Athanasios Christopoulos","Marc Conrad","Mitul Shukla"],"meta":["November 2018Virtual Reality 22(1)","DOI:10.1007/s10055-017-0330-3"],"references":["304020544_How_Do_Students_'Really'_Interact_with_Virtual_Worlds_-_The_Influence_of_Proper_Induction_for_Virtual_Interactions","285490703_Objects_Worlds_and_Students_Virtual_Interaction_in_Education","272164429_Towards_a_framework_for_the_design_of_mixed_reality_immersive_education_spaces","268041441_Learners'_Experience_of_Presence_in_Virtual_Worlds","266347691_The_Avatar_as_a_Knowledge_Worker_How_Immersive_3D_Virtual_Environments_may_Foster_Knowledge_Acquisition","347784146_Virtual_Worlds_in_Health_Care_Higher_Education","317108176_Interaction_in_Situated_Learning_Does_Not_Imply_Immersion_-_Virtual_Worlds_Help_to_Engage_Learners_without_Immersing_Them","276935040_Mind_in_Society_The_Development_of_Higher_Mental_Processes","268861577_An_Introduction_to_Categorical_Data_Analysis_Second_Edition","265530153_A_White_Paper_Achieving_Success_with_Blended_Learning"]}