{"id":"322258510_A_Comprehensive_Taxonomy_of_Fragmentation_and_Allocation_Techniques_in_Distributed_Database_Design","abstract":"The need to design an optimally distributed database is increasingly important with the growth of information technology and computer networks. However, designing a distributed database is an extremely complex process due to a large number of geographically distributed sites and database relations. Moreover, decreasing communication costs and query response time should be taken into consideration. There are three main techniques applied to design a distributed database, namely Fragmentation, Data allocation, and Replication. It is notable that these techniques are often treated separately and rarely processed together. Some available allocation methods are applied regardless of how the fragmentation technique is performed or replication process is adopted. In contrast, other fragmentation techniques do not consider the allocation or the replication techniques. Therefore, the first and foremost step for designing an optimal database is to develop a comprehensive understanding of the current fragmentation, replication, and allocation techniques and their disadvantages. This article presents an attempt to fulfill this step by proposing a comprehensive taxonomy of the available fragmentation and allocation techniques in distributed database design. The article also discusses some case studies of these techniques for a deeper understanding of its achievements and limitations.","authors":["Ali A. Amer","Dalia Nashat"],"meta":["April 2018ACM Computing Surveys 51(1):1-25","DOI:10.1145/3150223","Project: Optimizing dynamic data allocation in DDBSs using Meta-heuristic-based requirements selection technique"],"references":["291295055_Principles_of_Distributed_Database_systems","286277572_Clustering-based_fragmentation_and_data_replication_for_flexible_query_answering_in_distributed_databases","340448962_Allocating_data_files_over_a_wide_area_network_Goal_setting_and_compromise_design","340448803_Optimization_problems_and_solution_methods_in_the_design_of_data_distribution","315329894_Incremental_Data_Allocation_and_Reallocation_in_Distributed_Database_Systems","314509155_Incremental_Data_Allocation_and_Reallocation_in_Distributed_Database_Systems","313167179_An_enhanced_grouping_algorithm_for_vertical_partitioning_problem_in_ddbs","288876354_Analysis_and_design_methods_for_nonlinear_systems","286240254_Dynamic_allocation_and_efficient_distribution_of_data_among_multiple_clouds_using_network_coding","283228018_Hybridized_fragmentation_of_very_large_databases_using_clustering"]}