{"id":"322265995_Optimum_Power_Production_of_Small_Hydropower_Plant_SHP_using_Firefly_Algorithm_FA_in_Himreen_Lake_Dam_HLD_Eastern_Iraq","abstract":"In developing countries, the amount of electrical power production is lower than the request of power or load. Therefore, sustaining the stability of optimum power production system becomes a problem. Sometimes, the development of the correct quantity of load demand is necessary in order to keep the system of power production steady. Thus, the addition of Kaplan turbine into Small Hydropower Plant (SHP) is verified to explore its applicability. This study focuses on the improvement of optimization model by applying particle swarm optimization and firefly algorithm methods in order to get a stable power production utility at its maximum level. Furthermore, it investigates on the minimization of utility loss in power production from the hydropower system, which is done by optimizing the variables of operation control in the hydropower plant at Lake Himreen - Diyala Dam. The variables mentioned are net turbine head, rate of water flow and power production which had been gathered in the data during a research throughout a 10-year period. Moreover, this study investigates the uncertainties of input and output operation of small hydropower plant, the designing of the entire 3570 experiments, and the data collected from the observation on the performance of the nonlinear plant model. The results obtained from these two methods, namely Firefly Algorithm (FA) and Particle Swarm Optimization, (PSO) are compared. The inferences for general comparisons are created through several behavior indicators. The behavior indicators illustrate that FA’s performance is better than PSO’s performance, in some fields. At the end, the results show the strength of FA, as well as its efficiency and superiority.","authors":["Ali Thaeer Hammid","Mohd Herwan Sulaiman","Atheer A Kadhim"],"meta":["December 2017Research Journal of Applied Sciences 12(10):455-466","DOI:10.3923/rjasci.2017.455.466","Projects: Optimization and Control of Hydro Generation Scheduling using Hybrid Firefly Algorithm and Particle Swarm Optimization TechniquesPeripherals, Components, and Applications of Allen-Bradley PLC"],"references":[]}