{"id":"322270147_Adaptive_fuzzy_interpolation_based_on_ranking_values_of_interval_type-2_polygonal_fuzzy_sets","abstract":"In recent years, some adaptive fuzzy interpolative reasoning (AFIR) methods have been proposed to deal with contradictions occurred during fuzzy interpolation processes. However, the degrees of consistency of the AFIR results of the existing AFIR methods are not good enough. Moreover, the existing AFIR methods are based on type-1 fuzzy sets (T1FSs), which cannot deal with AFIR using interval type-2 fuzzy sets (IT2FSs), where IT2FSs are more suitable to represent the fuzziness of information than T1FSs. In this paper, we propose a new AFIR method based on the ranking values of interval type-2 polygonal fuzzy sets (IT2PFSs). We also apply the proposed AFIR method based on IT2PFSs to deal with the diarrheal disease prediction problem. The proposed AFIR method based on the ranking values of IT2PFSs can overcome the shortcomings of Yang and Shen's AFIR method (2011) and Cheng et al.’s AFIR method (2016) because it gets a higher consistency of the AFIR results in terms of the degree of similarity between the AFIR results and it deals with AFIR based on IT2PFSs rather than T1FSs.","authors":["Shyi-Ming Chen","Stenly Ibrahim Adam"],"meta":["April 2018Information Sciences 435","DOI:10.1016/j.ins.2018.01.003"],"references":["312033288_Type-2_Fuzzy_Linear_Systems","310781049_A_granular_computing_framework_for_approximate_reasoning_in_situation_awareness","309182204_Fuzzy_higher_type_information_granules_from_an_uncertainty_measurement","304375229_The_development_of_granular_rule-based_systems_A_study_in_structural_model_compression","301794030_Rule_Based_Systems_A_Granular_Computing_Perspective","292991155_DCC_A_framework_for_dynamic_granular_clustering","292677226_Orthopairs_and_granular_computing","289501761_Bridging_gaps_between_several_forms_of_granular_computing","289499196_Interactive_Granular_Computing","287419298_Granular_computing_computational_intelligence_and_the_analysis_of_non-geometric_input_spaces"]}