{"id":"322207176_Topology_Design_of_Robot_Mechanisms","abstract":"This book focuses on the topology theory of mechanisms developed by the authors and provides a systematic method for the topology design of parallel mechanisms (PMs). \nThe main original theoretical contributions of this book include:\n(1) Three basic concepts\n(a) The “geometrical constraint type”, kinematic pair and connection of links are three structural elements. As such, the symbolic expression of these mechanisms’ structures is an invariance. \n(b) The position and orientation characteristic (POC) set describes the POC of relative motion between any two links and is an invariance.\n(c) In turn, the simple open chain (SOC) unit is used to develop four basic equations of mechanism topology (see Chapters 4 to 6).\n(2) Mechanism composition principle\nThe book proposes a mechanism composition principle based on the SOC unit and establishes a systematic theory for the unified modeling of the topology, kinematics, and dynamics of mechanisms (see Chapter 7).\n(3) Four basic equations\n(a) A POC equation of serial mechanisms and its 10 operation rules (see Chapter 4).\n(b) A POC equation of PMs and its 14 operation rules (see Chapter 5).\n(c) The general DOF formulas\n(see Chapter 6).\n(d) The coupling degree formula for the Assur kinematic chain (see Chapter 7).\n(4) One systematic method for the topology design of parallel mechanisms (see Chapters 8-10)\nDrawing on these three basic concepts and four basic equations, the book puts forward a systematic method for the topology design of PMs, one that is fundamentally different from existing methods. Its main characteristics are as follows: \n(a) The design process includes two stages: the first is structure synthesis, which allows many structure types to be obtained; the second involves the performance analysis, classification and optimization of structure types.\n(b) The design operation is independent of the motion position and selection of fixed coordinate system.\nAs such, the proposed method is essentially geometrical. This ensures that full-cycle DOF and the generality of geometric conditions of mechanism existence apply.\n(c) Each individual design step follows an explicit formula or the guidelines for design criteria, making the operation simple, feasible and reproducible. In addition, the topology design of the SCARA PM is studied in detail, providing an example to illustrate the proposed method (see Chapter 10).","authors":["Ting-Li Yang","Anxin Liu","Huiping Shen","LuBin Hang"],"meta":["January 2018","DOI:10.1007/978-981-10-5532-4","ISBN: 978-981-10-5531-7"],"references":[]}