{"id":"322221651_PrivySense_underlinePrice_underlineVolatilitunderliney_based_underlineSentimentunderlines_underlineEstimation_from_Financial_News_using_Machine_Learning","abstract":"As machine learning ascends the peak of computer science zeitgeist, the usage and experimentation with sentiment analysis using various forms of textual data seems pervasive. The effect is especially pronounced in formulating securities trading strategies, due to a plethora of reasons including the relative ease of implementation and the abundance of academic research suggesting automated sentiment analysis can be productively used in trading strategies. The source data for such analyzers ranges a broad spectrum like social media feeds, micro-blogs, real-time news feeds, ex-post financial data etc. The abstract technique underlying these analyzers involve supervised learning of sentiment classification where the classifier is trained on annotated source corpus, and accuracy is measured by testing how well the classifiers generalizes on unseen test data from the corpus. Post training, and validation of fitted models, the classifiers are used to execute trading strategies, and the corresponding returns are compared with appropriate benchmark returns (for e.g., the S&P500 returns). In this paper, we introduce $\\underline{a\\ novel\\ technique\\ of\\ using\\ price\\ volatilities\\ to\\ empirically\\ determine\\ the\\ sentiment\\ in\\ news\\ data}$, instead of the traditional reverse approach. We also perform meta sentiment analysis by evaluating the efficacy of existing sentiment classifiers and the precise definition of sentiment from securities trading context. We scrutinize the efficacy of using human-annotated sentiment classification and the tacit assumptions that introduces subjective bias in existing financial news sentiment classifiers.","authors":["Raeid Saqur","Nicole Langballe"],"meta":["December 2017"],"references":["221101350_Evaluating_N-gram_based_Evaluation_Metrics_for_Automatic_Keyphrase_Extraction","220873208_Sentiment_Polarity_Identification_in_Financial_News_A_Cohesion-based_Approach","306353000_Generalized_autoregressive_conditional_heteroskedasticity","304020599_Improving_the_Sentiment_Analysis_Process_of_Spanish_Tweets_with_BM25","282751520_Tweets_and_Trades_the_Information_Content_of_Stock_Microblogs","238195651_Autoregressive_Conditional_Heteroscedasticity_With_Estimates_of_the_Variance_of_United_Kingdom_Inflation","228280089_Wisdom_of_Crowds_The_Value_of_Stock_Opinions_Transmitted_Through_Social_Media","221297824_Trading_Strategies_to_Exploit_Blog_and_News_Sentiment","221013206_Identifying_and_Following_Expert_Investors_in_Stock_Microblogs_1_Roy_Bar-Haim_1","215470760_Opinion_Mining_and_Sentiment_Analysis","200045846_A_Study_Using_N-Gram_Features_for_Text_Categorization","4992327_Measuring_and_Testing_the_Impact_of_News_on_Volatility"]}