{"id":"322200016_Accessing_Accuracy_of_Structural_Performance_on_Basic_Steps_in_Recording_Malay_Zapin_Dance_Movement_Using_Motion_Capture","abstract":"Traditional dances are deemed under the classification of intangible cultural heritage that could easily be threatened because of their fragility. The need to protect this valuable asset is imperative as it reflects the uniqueness of our generation's identity and portrays the human development of any community. Dance is arguably the most complex entity to decipher or captured in notation, in still or moving state, because of its kinaesthetic nature. Hence, this paper presents the study of several basic steps based on the structural performance in the Malay dance called Zapin besides accessing accuracy in recording the movement by using motion capture. Zapin is one of the oldest traditional dances fusing the Hadrahmaut Arab dance with Malay performance styles. The objective of the venture is to preserve Zapin focusing on the steps in correspondence with the dance motifs. The recording and simulation of the movement can be virtually re-enacted in 3 dimension (3D) using Motion Capture (MoCap) technology. This technology enables movements to be viewed and analyzed in 3D from 360 degrees, making it an easy reference for viewers to observe and learners to emulate the movements. The approach and technique of recording the dance movement in real time using MoCap technology will be illustrated in this paper.","authors":["Muhammad Zaffwan Idris","Norsimaa Mustaffa"],"meta":["January 2017","Project: Digital Heritage"],"references":["265533041_THE_SIGNIFICANCE_OF_PRESERVATION_TO_SAVE_OR_NOT_TO_SAVE_1","238384821_World_Heritage_Classification_and_Related_Issues-A_Case_Study_of_the_Convention_Concerning_the_Protection_of_the_World_Cultural_and_Natural_Heritage","220184018_Capturing_and_animating_skin_deformation_in_human_motion","273082850_Jazz_in_Kuala_Lumpur","259428371_Cultural_Heritage_on_the_Web_Applied_Digital_Visual_Anthropology_and_Local_Cultural_Property_Rights_Discourse","257627002_Music_similarity-based_approach_to_generating_dance_motion_sequence","243460233_Malaysian_cultural_heritage_at_risk_A_case_study_of_digitisation_projects","242422889_Understanding_Motion_Capture_for_Computer_Animation_and_Video_Games","231855231_Intangible_Heritage_and_Erasure_Rethinking_Cultural_Preservation_and_Contemporary_Museum_Practice"]}