{"id":"322372860_Dynamics_of_co-authorship_and_productivity_across_different_fields_of_scientific_research","abstract":"We aimed to assess which factors correlate with collaborative behavior and whether such behavior associates with scientific impact (citations and becoming a principal investigator). We used the R index which is defined for each author as log(Np)/log(I1), where I1 is the number of co-authors who appear in at least I1 papers written by that author and Np are his/her total papers. Higher R means lower collaborative behavior, i.e. not working much with others, or not collaborating repeatedly with the same co-authors. Across 249,054 researchers who had published ≥30 papers in 2000–2015 but had not published anything before 2000, R varied across scientific fields. Lower values of R (more collaboration) were seen in physics, medicine, infectious disease and brain sciences and higher values of R were seen for social science, computer science and engineering. Among the 9,314 most productive researchers already reaching Np ≥ 30 and I1 ≥ 4 by the end of 2006, R mostly remained stable for most fields from 2006 to 2015 with small increases seen in physics, chemistry, and medicine. Both US-based authorship and male gender were associated with higher values of R (lower collaboration), although the effect was small. Lower values of R (more collaboration) were associated with higher citation impact (h-index), and the effect was stronger in certain fields (physics, medicine, engineering, health sciences) than in others (brain sciences, computer science, infectious disease, chemistry). Finally, for a subset of 400 U.S. researchers in medicine, infectious disease and brain sciences, higher R (lower collaboration) was associated with a higher chance of being a principal investigator by 2016. Our analysis maps the patterns and evolution of collaborative behavior across scientific disciplines.","authors":["Austin J. Parish","Kevin Boyack","John Ioannidis"],"meta":["January 2018PLoS ONE 13(1):e0189742","DOI:10.1371/journal.pone.0189742"],"references":["307886461_Citation_Metrics_A_Primer_on_How_Not_to_Normalize","306186524_Choosing_Collaboration_Partners_How_Scientific_Success_in_Physics_Depends_on_Network_Positions","297723759_Researchers'_Individual_Publication_Rate_Has_Not_Increased_in_a_Century","282744276_The_relationship_between_the_number_of_authors_of_a_publication_its_citations_and_the_impact_factor_of_the_publishing_journal_Evidence_from_Italy","270162919_Straight_from_the_source_Accounting_for_scientific_success","318393858_R_A_Language_and_Environment_for_Statistical_Computing","283553375_The_influence_of_various_forms_of_co-authorship_on_the_scientific_productivity_of_Russian_scientists_in_the_field_of_molecular_biology","281493052_How_to_become_an_important_player_in_scientific_collaboration_networks","271740711_Sixty-four_years_of_informetrics_research_Productivity_impact_and_collaboration","270053147_The_relationship_between_the_research_performance_of_scientists_and_their_position_in_co-authorship_networks_in_three_fields"]}