{"id":"322375084_Staging_laparoscopy_for_locally_advanced_gastric_cancer_in_Chinese_patients_A_multicenter_prospective_registry_study","abstract":"Background: \nStaging laparoscopy(SL) is a recommended technique for the staging of Gastric Cancer(GC) and provides the indication for a radical surgery. Considering the medical practice in China, the standardized and regular usage of SL is yet to be spread. However, existing guidelines vary and make an ambiguity of indication for SL. Besides, the specific indication for Chinese patients remains a niche. This study aims to the essential, missing information of Chinese patients and tries to normalize the indication of LS in medical practice in China.\n\nMethods: \nThe study is a prospective, multicenter cohort study being conducted in China with a total of 450 patients, all diagnosed with locally advanced gastric cancer (cT2-4 N0-3 M0, no evidence of intra-abdominal dissemination) through Computed Tomography(CT) and/or Endoscopic Ultrasonography(EUS). Peritoneal lavage is regularly performed during the SL. Multivariate Cox regression model and receiver-operator characteristic(ROC) analysis will be used to analyze the significant risk factors of intra-abdominal metastasis(including peritoneal dissemination and a positive cytological result).\n\nDiscussion: \nThis confirmatory study will provide us with the specific positive rate of intraabdominal metastasis of GC in China, compared with empirical evidence of 20%. We expect this trial will contribute to our discovery of the specific risk factors of intra-abdominal metastasis of Chinese patients and to the stimulating and performing of minimally invasive surgical procedures.\n\nTrial registration: \nClinicalTrials.gov : registration number NCT02172690 .","authors":["ZiYu li","Zhemin Li","Lianhai Zhang","Qian Liu"],"meta":["January 2018BMC Cancer 18(1)","DOI:10.1186/s12885-017-3791-6"],"references":["326466052_Gastric_cancer_ESMO-ESSO-ESTRO_clinical_practice_guidelines_for_diagnosis_treatment_and_follow-up","309257013_Gastric_Cancer_Version_32016_Clinical_Practice_Guidelines_in_Oncology","304404553_Cancer_incidence_and_mortality_worldwide_Sources_methods_and_major_patterns_in_GLOBOCAN_2012","285129863_Gastric_cancer_ESMO-ESSO-ESTRO_clinical_practice_guidelines_for_diagnosis_treatment_and_follow-up","278269853_Appropriate_Body_Mass_Index_for_Asian_Populations_and_Its_Implications_for_Policy_and_Intervention_Strategies","265605267_Cancer_Incidence_and_Mortality_Worldwide_sources_methods_and_major_patterns_in_GLOBOCAN_2012","44888365_Peritoneal_Wash_Cytology_in_Gastric_Carcinoma_Prognostic_Significance_and_Therapeutic_Consequences","7827138_The_Value_of_Peritoneal_Cytology_as_a_Preoperative_Predictor_in_Patients_With_Gastric_Carcinoma_Undergoing_a_Curative_Resection"]}