{"id":"322347454_Atmospheric_River_Tracking_Method_Intercomparison_Project_ARTMIP_Project_Goals_and_Experimental_Design","abstract":"The Atmospheric River Tracking Method Intercomparison Project (ARTMIP) is an international collaborative effort to understand and quantify the uncertainties in atmospheric river (AR) science based on detection algorithm alone. Currently, there are many AR identification and tracking algorithms in the literature with a wide range of techniques and conclusions. ARTMIP strives to provide the community with information on different methodologies and provide guidance on the most appropriate algorithm for a given science question or region of interest. All ARTMIP participants will implement their detection algorithms on a specified common dataset for a defined period of time. The project is divided into two phases: Tier 1 will utilize the MERRA-2 reanalysis from January 1980 to June of 2017 and will be used as a baseline for all subsequent comparisons. Participation in Tier 1 is required. Tier 2 will be optional and include sensitivity studies designed around specific science questions, such as reanalysis uncertainty and climate change. High resolution reanalysis and/or model output will be used wherever possible. Proposed metrics include AR frequency, duration, intensity, and precipitation attributable to ARs. Here we present the ARTMIP experimental design, timeline, project requirements, and a brief description of the variety of methodologies in the current literature. We also present results from our 1-month proof of concept trial run designed to illustrate the utility and feasibility of the ARTMIP project.","authors":["Christine A. Shields","Jonathan J. Rutz","Lai-Yung Leung","Fred Martin Ralph"],"meta":["January 2018Geoscientific Model Development Discussions","DOI:10.5194/gmd-2017-295"],"references":["325886834_Global_evaluation_of_atmospheric_river_subseasonal_prediction_skill","322379331_Global_Assessment_of_Atmospheric_River_Prediction_Skill","320291267_Global_Floods_and_Water_Availability_Driven_by_Atmospheric_Rivers","328394706_Influence_of_Atmospheric_Rivers_on_Mountain_Snowpack_in_the_Western_US","322014741_An_Inter-comparison_Between_Reanalysis_and_Dropsonde_Observations_of_the_Total_Water_Vapor_Transport_in_Individual_Atmospheric_Rivers","320319891_Implications_of_Detection_Methods_on_Characterizing_Atmospheric_River_Contribution_to_Seasonal_Snowfall_Across_Sierra_Nevada_USA","318894284_Assessing_the_climate-scale_variability_of_atmospheric_rivers_affecting_western_North_America_Atmospheric_River_Climate-Scale_Behavior","318473007_Advancing_Atmospheric_River_Forecasts_into_Subseasonal-to-Seasonal_Timescales_Forecasting_ARs_at_S2S_timescales","317612119_Changes_in_the_Climatology_Structure_and_Seasonality_of_Northeast_Pacific_Atmospheric_Rivers_in_CMIP5_Climate_Simulations","316651695_Atmospheric_Rivers_in_20-year_Weather_and_Climate_Simulations_A_Multi-model_Global_Evaluation_Atmospheric_River_Simulations"]}