{"id":"322300195_Pensamiento_computacional_Una_tercera_competencia_clave","abstract":"¿Por qué un corpus curricular sobre \"pensamiento computacional\" ahora? Hace dos años decíamos (Zapata-Ros, 2015) que \"las instituciones y agencias competentes, los expertos y los autores de informes de tendencia se han visto sorprendidos por un hecho: la sociedad y los sistemas de producción, de servicios y de consumo demandan profesionales cualificados en las industrias de la información\". Constatando, en el mundo desarrollado, la existencia de altas tasas de paro con un considerable número de puestos de trabajo de ingenieros de software, desarrolladores de aplicaciones, documentalistas digitales, que se quedan sin cubrir por falta de egresados de las escuelas técnicas, por falta de demanda de estos estudios por parte de potenciales alumnos y sobre todo por la falta de personal capacitado. Esta era una causa pero hay otras que señalamos en (Zapata-Ros, 2012) como son las disrupciones universitarias que hacen que un número considerable de individuos algunos extremadamente competentes soslayen la vía de formación, y promoción profesional formales que teóricamente la universidad tienen encomendadas por otras más autónomas. Ahora la toma de conciencia de las instituciones y agencias públicas, estatales e interestatales es mucho mayor. Una muestra de ello es la declaración de la UE en el documento The Computational Thinking Study 1 Computational thinking (CT) is a shorthand for \"thinking as a computer scientist\", i.e. the ability to use the concepts of computer science to formulate and solve problems. Computational thinking has been promoted in recent years as a skill or competence that is as fundamental as numeracy and literacy. Despite the high interest in developing CT among schoolchildren and the large public and private investment in CT initiatives, there are a number of issues and challenges for the integration of CT in the school curricula. Tras una primera etapa de toma de conciencia ante la situación algunos países han reaccionado de forma diversa según podemos ver otro apartado del presente trabajo. En ese cuadro podemos ver distintas respuestas por parte de los sistemas educativos de los países más sensibles, los que han abordado el problema desde la perspectiva de una reorganización del curriculum. Sin embargo la cuestión de fondo supone la aparición de unas nuevas destrezas básicas. Las sociedades más conscientes han visto que se trata de 1 The Computational Thinking Study. Joint Research Centre (JRC). EU Science Hub https://ec.europa.eu/jrc/en/computational-thinking","authors":["Miguel Zapata-Ros"],"meta":["January 2018","Project: Pensamiento computacional (Computational think)"],"references":["312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","305319947_Instructional_Theory_and_Technology_for_the_New_Paradigm_of_Education_160","324427800_The_Fractal_Geometry_of_Nature","319394383_How_to_Solve_it","319393294_Logic_of_Scientific_Discovery","311898370_What_do_you_mean_by_collaborative_learning","308823301_DISSECT_Analysis_of_pedagogical_techniques_to_integrate_computational_thinking_into_K-12_curricula","308812666_DISSECT_Exploring_the_relationship_between_computational_thinking_and_English_literature_in_K-12_curricula","305081700_Introducing_Computational_Thinking_to_K-5_in_a_French_Context","301463451_A_Pilot_Computer_Science_and_Programming_Course_for_Primary_School_Students","300253595_Introducing_a_New_Computer_Science_Curriculum_for_All_School_Levels_in_Poland","294878622_Factors_Influencing_Computer_Science_Learning_in_Middle_School","291372256_Pensamiento_computacional_Una_nueva_alfabetizacion_digital","301199586_Computing_as_a_New_Compulsory_Subject_in_the_Macedonian_Primary_Schools_Curriculum","288961768_Digital_literacy"]}