{"id":"322306075_Ultra-Reliable_and_Low-Latency_Wireless_Communication_Tail_Risk_and_Scale","abstract":"Ensuring ultra-reliable and low-latency communication (URLLC) for 5G wireless networks and beyond is of capital importance and is currently receiving tremendous attention in academia and industry. At its core, URLLC mandates a departure from expected utility-based network design approaches, in which relying on average quantities (e.g., average throughput, average delay and average response time) is no longer an option but a necessity. Instead, a principled and scalable framework which takes into account delay, reliability, packet size, network architecture, and topology (across access, edge, and core) and decision-making under uncertainty is sorely lacking. The overarching goal of this article is a first step to fill this void. Towards this vision, after providing definitions of latency and reliability, we closely examine various enablers of URLLC and their inherent tradeoffs. Subsequently, we focus our attention on a plethora of techniques and methodologies pertaining to the requirements of ultra-reliable and low-latency communication, as well as their applications through selected use cases. These results provide crisp insights for the design of low-latency and high-reliable wireless networks.","authors":["Mehdi Bennis","mérouane Debbah","H. Vincent Poor"],"meta":["January 2018"],"references":["337618049_Distributed_Federated_Learning_for_Ultra-Reliable_Low-Latency_Vehicular_Communications","324584376_Ultra-Reliable_and_Low-Latency_Vehicular_Transmission_An_Extreme_Value_Theory_Approach","322969151_Ultra-Reliable_Communication_in_5G_mmWave_Networks_A_Risk-Sensitive_Approach","322674697_Mean-Field_Game_Theoretic_Edge_Caching_in_Ultra-Dense_Networks","321823651_Joint_Scheduling_of_URLLC_and_eMBB_Traffic_in_5G_Wireless_Networks","321511177_High_Reliability_and_Low_Latency_for_Vehicular_Networks_Challenges_and_Solutions","320181012_Latency_and_Reliability-Aware_Task_Offloading_and_Resource_Allocation_for_Mobile_Edge_Computing","319391733_Network_Slicing_for_Ultra-Reliable_Low_Latency_Communication_in_Industry_40_Scenarios","319328021_Wireless_Access_for_Ultra-Reliable_Low-Latency_Communication_Principles_and_Building_Blocks","330964960_Prospect_Theory_An_Analysis_of_Decision_under_Risk"]}