{"id":"322377219_Tailored_laser_beam_shaping_for_efficient_and_accurate_microstructuring","abstract":"Large-area processing with high material removal rates by ultrashort pulsed (USP) lasers is coming into focus by the development of high-power USP laser systems. However, currently the bottleneck for high-rate production is given by slow and inefficient beam manipulation. On the one hand, slow beam deflection with regard to high pulse repetition rates leads to heat accumulation and shielding effects, on the other hand, a conventional focus cannot provide the optimum fluence due to the Gaussian intensity profile. In this paper, we emphasize on two approaches of dynamic laser beam shaping with liquid crystal on silicon spatial light modulation and acousto-optic beam shaping. Advantages and limitations of dynamic laser beam shaping with regard to USP laser material processing and methods for reducing the influence of speckle are discussed. Additionally, the influence of optics induced aberrations on speckle characteristics is evaluated. Laser material processing results are presented correlating the achieved structure quality with the simulated and measured beam quality. Experimental and analytical investigations show a certain fluence dependence of the necessary number of alternative holograms to realize homogeneous microstructures.","authors":["T. Häfner","Johannes Strauss","Clemens Roider","J. Heberle"],"meta":["January 2018Applied Physics A 124(2)","DOI:10.1007/s00339-017-1530-0"],"references":["308266345_Evaluation_and_Calibration_of_LCoS_SLM_for_Direct_Laser_Structuring_with_Tailored_Intensity_Distributions","283453492_Fast_spatial_beam_shaping_by_acousto-optic_diffraction_for_3D_non-linear_microscopy","281778236_Speckle-suppressed_phase-only_holographic_three-dimensional_display_based_on_double-constraint_Gerchberg-Saxton_algorithm","258036263_Precise_shaping_of_laser_light_by_an_acousto-optic_deflector","241122198_Ultrafast_Scan_Techniques_for_3D-mm_Structuring_of_Metal_Surfaces_with_high_repetitive_ps-laser_pulses","320001354_Effect_of_Picosecond_Laser_Based_Modifications_of_Amorphous_Carbon_Coatings_on_Lubricant-free_Tribological_Systems","279062698_Beam_Shaping_Optics_for_Process_Acceleration","264693753_Direct_femtosecond_laser_surface_nanomicrostructuring_and_its_applications","249969312_Ablation_of_metals_by_ultrashort_laser_pulses","243576426_Iterative_Fouriertransform_algorithm_applied_to_computer_holography"]}