{"id":"322316147_Ensemble_landmarking_of_3D_facial_surface_scans","abstract":"Landmarking of 3D facial surface scans is an important analysis step in medical and biological applications, such as genome-wide association studies (GWAS). Manual landmarking is often employed with considerable cost and rater dependent variability. Landmarking automatically with minimal training is therefore desirable. We apply statistical ensemble methods to improve automated landmarking of 3D facial surface scans. Base landmarking algorithms using features derived from 3D surface scans are combined using either bagging or stacking. A focus is on low training complexity of maximal 40 training samples with template based landmarking algorithms that have proved successful in such applications. Additionally, we use correlations between landmark coordinates by introducing a search strategy guided by principal components (PCs) of training landmarks. We found that bagging has no useful impact, while stacking strongly improves accuracy to an average error of 1.7 mm across all 21 landmarks in this study, a 22% improvement as compared to a previous, comparable algorithm. Heritability estimates in twin pairs also show improvements when using facial distances from landmarks. Ensemble methods allow improvement of automatic, accurate landmarking of 3D facial images with minimal training which is advantageous in large cohort studies for GWAS and when landmarking needs change or data quality varies.","authors":["Markus A. de Jong","Pirro Hysi","Tim Spector","W.J. Niessen"],"meta":["January 2018Scientific Reports 8(1)","DOI:10.1038/s41598-017-18294-x","Project: Facial research"],"references":["307303825_Heritability_maps_of_human_face_morphology_through_large-scale_automated_three-dimensional_phenotyping","306932804_Genomewide_Association_Study_of_African_Children_Identifies_Association_of_SCHIP1_and_PDE8A_with_Facial_Size_and_Shape","306932720_Genome-Wide_Association_Study_Reveals_Multiple_Loci_Influencing_Normal_Human_Facial_Morphology","283435703_An_Automatic_3D_Facial_Landmarking_Algorithm_Using_2D_Gabor_Wavelets","283040455_Learning_Deep_Representation_for_Face_Alignment_with_Auxiliary_Attributes","277566204_Reconstruction_Of_Images_From_Gabor_Graphs_With_Applications_In_Facial_Image_Processing","320112472_Face_recognition_by_Elastic_Bunch_Graph_Matching","313015749_Comparing_Humans_and_Deep_Learning_Performance_for_Grading_AMD_A_Study_in_Using_Universal_Deep_Features_and_Transfer_Learning_for_Automated_AMD_Analysis","287624007_Active_shape_models_with_SIFT_descriptors_and_MARS","281682999_Predicting_facial_characteristics_from_complex_polygenic_variations"]}