{"id":"322318858_Automata_Approach_to_XML_Data_Indexing","abstract":"The internal structure of XML documents can be viewed as a tree. Trees are among the fundamental and well-studied data structures in computer science. They express a hierarchical structure and are widely used in many applications. This paper focuses on the problem of processing tree data structures; particularly, it studies the XML index problem. Although there exist many state-of-the-art methods, the XML index problem still belongs to the active research areas. However, existing methods usually lack clear references to a systematic approach to the standard theory of formal languages and automata. Therefore, we present some new methods solving the XML index problem using the automata theory. These methods are simple and allow one to efficiently process a small subset of XPath. Thus, having an XML data structure, our methods can be used efficiently as auxiliary data structures that enable answering a particular set of queries, e.g., XPath queries using any combination of the child and descendant-or-self axes. Given an XML tree model with n nodes, the searching phase uses the index, reads an input query of size m, finds the answer in time O ( m ) and does not depend on the size of the original XML document.","authors":["Eliška Šestáková","Jan Janoušek"],"meta":["January 2018Information (Switzerland) 9(1):12","DOI:10.3390/info9010012"],"references":["230876408_Finite_Automata_and_Their_Decision_Problems","221311087_Query_Caching_and_View_Selection_for_XML_Databases","350070111_Indexing_XML_documents_using_tree_paths_automaton","314830429_Validating_streaming_XML_documents","314827875_Storing_and_querying_ordered_XML_using_a_relational_database_system","313562144_Index_Structures_for_Path_Expressions","307532376_An_Improved_Indexing_Method_for_Xpath_Queries","300117652_Tree_String_Path_Subsequences_Automaton_and_Its_Use_for_Indexing_XML_Documents","283040862_An_automaton-based_index_scheme_supporting_twig_queries_for_on-demand_XML_data_broadcast","262356168_Automata_for_XML_-_a_survey"]}