{"id":"322346201_A_Novel_Heuristic_for_Evolutionary_Clustering","abstract":"Clustering is considered a challenging problem of data mining due to its unsupervised nature. The literature is inundated with algorithms and concepts related to determining the most suitable clustering structure in data. These techniques have a mathematical model of a cluster and attempt to obtain a result that shall represent this model as closely as possible. However as the problem of clustering is NP hard such strategies have disadvantages such as converging to local optima or suffering from the curse of dimensionality. In such scenario, meta heuristics could be more suitable strategies. Such techniques utilizes biologically inspired techniques such as swarm intelligence, evolution etc. to traverse the search space. Due to their inherent parallel nature, they are most robust towards converging to a local optima. The objective (cost) function used by such meta heuristics is responsible for guiding the agents of the swarm towards the best solution. Hence it should be designed to achieve trade-off between multiple objectives and constraints and at the same time produce relevant clustering. In this paper, a cost function is proposed (PSO-2) to produce compact well separated clusters by using the concept of intra-cluster and inter-cluster distances. Experiments have been performed on artificial benchmark data-sets where performance of the particle swarm optimizer using the proposed cost function is evaluated against other evolutionary and non evolutionary algorithms. The clustering structures produced by the methods have been evaluated using distance based and internal cluster validation metrics to demonstrate that the performance of PSO-2 is comparable to other techniques.","authors":["Pranav Nerurkar","Archana Shirke","Madhav Chandane","Sunil Bhirud"],"meta":["January 2018Procedia Computer Science 125:780-789","DOI:10.1016/j.procs.2017.12.100","Project: Machine learning"],"references":["315833486_A_New_Heuristic_for_the_Data_Clustering_Problem","306082311_A_Decision_Variable_Clustering-Based_Evolutionary_Algorithm_for_Large-Scale_Many-Objective_Optimization","260720119_Survey_of_Multiobjective_Evolutionary_Algorithms_for_Data_Mining_Part_II","227242104_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_Global_Optimization_over_Continuous_Spaces","313758667_A_new_optimizer_using_particle_swarm_theory","293010785_Biased_Multiobjective_Optimization_and_Decomposition_Algorithm","286049576_Particle_Swarm_Optimization","282389026_A_Sparse_Spectral_Clustering_Framework_via_Multi-Objective_Evolutionary_Algorithm","267272421_A_Novel_Evolutionary_Kernel_Intuitionistic_Fuzzy_C_-means_Clustering_Algorithm","264216764_How_to_find_an_appropriate_clustering_for_mixed-type_variables_with_application_to_socio-economic_stratification"]}