{"id":"322346663_Understanding_the_notion_of_risk_in_the_General_Data_Protection_Regulation","abstract":"The goal of this contribution is to understand the notion of risk as it is enshrined in the General Data Protection Regulation (GDPR), with a particular on Art. 35 providing for the obligation to carry out data protection impact assessments (DPIAs), the first risk management tool to be enshrined in EU data protection law, and which therefore contains a number of key elements in order to grasp the notion. The adoption of this risk-based approach has not come without a number of debates and controversies, notably on the scope and meaning of the risk-based approach. Yet, what has remained up to date out of the debate is the very notion of risk itself, which underpins the whole risk-based approach. The contribution uses the notions of risk and risk analysis as tools for describing and understanding risk in the GDPR. One of the main findings is that the GDPR risk is about \"compliance risk\" (i.e., the lower the compliance the higher the consequences upon the data subjects' rights). This stance is in direct contradiction with a number of positions arguing for a strict separation between compliance and risk issues. This contribution sees instead issues of compliance and risk to the data subjects rights and freedoms as deeply interconnected. The conclusion will use these discussions as a basis to address the long-standing debate on the differences between privacy impact assessments (PIAs) and DPIAs. They will also warn against the fact that ultimately the way risk is defined in the GDPR is somewhat irrelevant: what matters most is the methodology used and the type of risk at work therein.","authors":["Raphaël Gellert"],"meta":["January 2018Computer Law & Security Review 34(2)","DOI:10.1016/j.clsr.2017.12.003"],"references":["265450064_Review_of_the_European_Data_Protection_Directive","320314086_The_Riskification_of_European_Data_Protection_Law_through_a_two-fold_Shift","315449573_Risk_and_Culture_An_Essay_on_the_Selection_of_Technological_and_Environmental_Dangers","313776180_Risk_to_the_Right_to_the_Protection_of_Personal_Data","312652929_We_Have_Always_Managed_Risks_in_Data_Protection_Law_Understanding_the_Similarities_and_Differences_Between_the_Rights-Based_and_the_Risk-Based_Approaches_to_Data_Protection","289538507_The_Emergence_of_Personal_Data_Protection_as_a_Fundamental_Right_of_the_EU","275003692_An_evaluation_of_privacy_impact_assessment_guidance_documents","273286548_Data_protection_A_risk_regulation_Between_the_risk_management_of_everything_and_the_precautionary_alternative","273279584_Developing_and_testing_a_surveillance_impact_assessment_methodology","271401106_Privacy_principles_risks_and_harms","270016197_Risk_and_Culture_An_Essay_on_the_Selection_of_Technological_and_Environmental_Dangers","269488253_Against_The_Gods_The_Remarkable_Story_of_Risk","228452367_The_state_of_the_art_in_privacy_impact_assessment","45251794_The_Boundaries_Of_Privacy_Harm","30523078_Organized_Uncertainty_Designing_A_World_of_Risk_Management"]}