{"id":"322326235_Towards_a_framework_for_computational_persuasion_with_applications_in_behaviour_change1","abstract":"Persuasion is an activity that involves one party trying to induce another party to believe something or to do something. It is an important and multifaceted human facility. Obviously, sales and marketing is heavily dependent on persuasion. But many other activities involve persuasion such as a doctor persuading a patient to drink less alcohol, a road safety expert persuading drivers to not text while driving, or an online safety expert persuading users of social media sites to not reveal too much personal information online. As computing becomes involved in every sphere of life, so too is persuasion a target for applying computer-based solutions. An automated persuasion system (APS) is a system that can engage in a dialogue with a user (the persuadee) in order to persuade the persuadee to do (or not do) some action or to believe (or not believe) something. To do this, an APS aims to use convincing arguments in order to persuade the persuadee. Computational persuasion is the study of formal models of dialogues involving arguments and counterarguments, of user models, and strategies, for APSs. A promising application area for computational persuasion is in behaviour change. Within healthcare organizations, government agencies, and non-governmental agencies, there is much interest in changing behaviour of particular groups of people away from actions that are harmful to themselves and/or to others around them.","authors":["Anthony Hunter"],"meta":["January 2018Argument and Computation 9(3):1-26","DOI:10.3233/AAC-170032"],"references":["345152028_An_activity-centric_argumentation_framework_for_assistive_technology_aimed_at_improving_health","325632700_Empirical_Methods_for_Modelling_Persuadees_in_Dialogical_Argumentation","323704721_Expanding_Argumentation_Frameworks_Enforcing_and_Monotonicity_Results","323704637_What_Does_it_Take_to_Enforce_an_Argument_Minimal_Change_in_abstract_Argumentation","321348432_Two_dimensional_uncertainty_in_persuadee_modelling_in_argumentation","319315965_Probabilistic_Reasoning_with_Abstract_Argumentation_Frameworks","318785211_Empirical_Evaluation_of_Abstract_Argumentation_Supporting_the_Need_for_Bipolar_and_Probabilistic_Approaches","346469251_Elements_of_Argumentation","326621056_Modelling_the_persuadee_in_asymmetric_argumentation_dialogues_for_persuasion","322864697_An_extension-based_approach_to_belief_revision_in_abstract_argumentation"]}