{"id":"322324638_Dynamic_Risk_Assessment_Based_on_Statistical_Failure_Data_and_Condition-Monitoring_Degradation_Data","abstract":"Traditional quantitative risk assessment methods (e.g., event tree analysis) are static in nature, i.e., the risk indexes are assessed before operation, which prevents capturing time-dependent variations as the components and systems operate, age, fail, are repaired and changed. To address this issue, we develop a dynamic risk assessment (DRA) method that allows online estimation of risk indexes using data collected during operation. Two types of data are considered: statistical failure data, which refer to the counts of accidents or near misses from similar systems and condition-monitoring data, which come from online monitoring the degradation of the target system of interest. For this, a hierarchical Bayesian model is developed to compute the reliability of the safety barriers and a Bayesian updating algorithm, which integrates particle filtering (PF) with Markov Chain Monte Carlo, is developed to update the reliability evaluations based on both the statistical and condition-monitoring data. The updated safety barriers reliabilities, are, then, used in an event tree (ET) for consequence analysis and the risk indexes are updated accordingly. A case study on a high-flow safety system is conducted to demonstrate the developed methods. A comparison to the DRA method which only uses statistical failure data shows that by introducing condition-monitoring data on the system degradation process, it is possible to capture the system-specific characteristics, and, therefore, provide a more complete and accurate description of the risk of the target system.","authors":["Zhiguo Zeng","Enrico Zio"],"meta":["January 2018IEEE Transactions on Reliability PP(99):1-14","DOI:10.1109/TR.2017.2778804","Project: Dependent failure process: modeling and analysis"],"references":["317394013_A_compositional_method_to_model_dependent_failure_behavior_based_on_PoF_models","311394435_System_dynamic_reliability_assessment_and_failure_prognostics","309272962_Comparative_study_between_crack_closure_model_and_Willenborg_model_for_fatigue_prediction_under_overload_effects","307555953_Using_PoF_models_to_predict_system_reliability_considering_failure_collaboration","316853991_Improved_Dynamic_Dependability_Assessment_Through_Integration_With_Prognostics","308916950_Dynamic_safety_assessment_of_natural_gas_stations_using_Bayesian_network","305821220_Some_Challenges_and_Opportunities_in_Reliability_Engineering","305770802_Dynamic_risk_management_a_contemporary_approach_to_process_safety_management","304107121_Quantitative_risk_analysis_on_leakage_failure_of_submarine_oil_and_gas_pipelines_using_Bayesian_network","303946751_Towards_dynamic_risk_analysis_A_review_of_the_risk_assessment_approach_and_its_limitations_in_the_chemical_process_industry"]}