{"id":"322433862_Stock_Market_Classification_Model_Using_Sentiment_Analysis_on_Twitter_Based_on_Hybrid_Naive_Bayes_Classifiers","abstract":"Sentiment analysis has become one of the most popular process to predict stock market behaviour based on consumer reactions. Concurrently, the availability of data from Twitter has also attracted researchers towards this research area. Most of the models related to sentiment analysis are still suffering from inaccuracies. The low accuracy in classification has a direct effect on the reliability of stock market indicators. The study primarily focuses on the analysis of the Twitter dataset. Moreover, an improved model is proposed in this study; it is designed to enhance the classification accuracy. The first phase of this model is data collection, and the second involves the filtration and transformation, which are conducted to get only relevant data. The most crucial phase is labelling, in which polarity of data is determined and negative, positive or neutral values are assigned to people opinion. The fourth phase is the classification phase in which suitable patterns of the stock market are identified by hybridizing Naïve Bayes Classifiers (NBCs), and the final phase is the performance and evaluation. This study proposes Hybrid Naïve Bayes Classifiers (HNBCs) as a machine learning method for stock market classification. The outcome is instrumental for investors, companies, and researchers whereby it will enable them to formulate their plans according to the sentiments of people. The proposed method has produced a significant result; it has achieved accuracy equals 90.38%.","authors":["Ghaith Abdulsattar A.Jabbar Alkubaisi","Siti Sakira Kamaruddin","Husniza Husni"],"meta":["January 2018Computer and Information Science 11(1):52","DOI:10.5539/cis.v11n1p52","Project: Machine Learning and Sentiment Analysis"],"references":["322153001_A_systematic_review_on_the_relationship_between_stock_market_prediction_model_using_sentiment_analysis_on_twitter_based_on_machine_learning_method_and_features_selection","310598868_Real-Time_Investors'_Sentiment_Analysis_from_Newspaper_Articles","308567456_Sentiment_analysis_system_for_Indonesia_online_retail_shop_review_using_hierarchy_Naive_Bayes_technique","315308363_Can_Twitter_Help_Predict_Firm-Level_Earnings_and_Stock_Returns","313866634_Mining_User_Requirements_from_Application_Store_Reviews_Using_Frame_Semantics","312203461_SCLS_Multi-label_feature_selection_based_on_scalable_criterion_for_large_label_set","311805207_Temporal_Feature_Selection_on_Networked_Time_Series","311488870_Automated_Content_Analysis_A_Sentiment_Analysis_on_Malaysian_Government_Social_Media","309209225_Sentiment_Analysis_Leveraging_Emotions_and_Word_Embeddings","308014230_Factors_influencing_big_data_decision-making_quality"]}