{"id":"322454624_Adaptive_Biometric_Systems_using_Ensembles","abstract":"In view of the increased availability of online services, enhanced authentication mechanisms have become necessary, including the use of biometric systems. However, recent studies have shown that biometric features can change. Consequently, the recognition performance can be affected over time. Adaptive biometric systems, which can automatically adapt the biometric reference, have been proposed to deal with this problem. Frequently, these systems use query samples classified as genuine to adapt the biometric reference. Despite their good results, there are concerns regarding their robustness. This paper investigates an alternative to increase their robustness by using an ensemble of classifiers. Ensembles can improve the recognition performance of decision models, providing a more stable classification decision. This paper extends our previous investigation on ensembles by investigating questions regarding their application for adaptive biometric systems using one-class classification algorithms, including a proposal to automatically adapt the meta classifier over time.","authors":["Paulo Henrique Pisani","Ana Carolina Lorena","Andre de Carvalho"],"meta":["January 2018Intelligent Systems, IEEE PP(99):1-1","DOI:10.1109/MIS.2018.111144956"],"references":["308716305_Statistical_comparison_of_classifiers_through_Bayesian_hierarchical_modelling","304411232_Ensemble_of_Adaptive_Algorithms_for_Keystroke_Dynamics","290509735_50_Years_of_Biometric_Research_Accomplishments_Challenges_and_Opportunities","224083440_GREYC_keystroke_A_benchmark_for_keystroke_dynamics_biometric_systems","304554974_Adaptive_approaches_for_keystroke_dynamics","284942449_Adaptive_Positive_Selection_for_Keystroke_Dynamics","282237654_An_adaptive_ensemble-based_system_for_face_recognition_in_person_re-identification","261161994_Customizing_biometric_authentication_systems_via_discriminative_score_calibration","260664389_Critical_analysis_of_adaptive_biometric_systems","221383507_Continual_Retraining_of_Keystroke_Dynamics_Based_Authenticator"]}