{"id":"322465983_A_Systematic_Survey_of_Natural_Language_Processing_NLP_Approaches_in_Different_Systems","abstract":"Natural Language Processing and Programming Languages are both established areas in the field of Computer Science, each of them with a long research tradition. Natural Language processing Frameworks can make conceivable the use of natural language to express ideas. In education system, Natural Language Processing gives solution in a assortment of differing fields related with the social and cultural context of language learning. Natural Language Processing is broadly integrated with the expansive number of education connections such as research, science, linguistics, e-learning, evaluations system, and contributes resulting positive outcomes in other education settings such as schools, higher education system, and universities. In healthcare, NLP Frameworks decrease fetched as well as improve the quality of electronic healthcare systems. It is therefore against this foundation that this paper reviews the NLP techniques, uses in education, healthcare and their applications as well as their limitations. The reason of this relook is to overview and report the current state and the future bearings of the use of NLP innovations in different frameworks in the corporate world.","authors":["Ramalingam Ponnusamy"],"meta":["January 2018","Project: Development of an Agent Based Specialized Multi-Lingual Web Browser for Visually Handicapped"],"references":["262526821_Supporting_Process_Model_Validation_through_Natural_Language_Generation","278324949_Graph-Based_Methods_for_Natural_Language_Processing_and_Understanding-A_Survey_and_Analysis","277345431_Automated_Checking_of_Conformance_to_Requirements_Templates_Using_Natural_Language_Processing","268357415_Statistical_Methods_in_Natural_Language_Processing","264585537_Natural_Language_Processing","261567318_Jumping_NLP_Curves_A_Review_of_Natural_Language_Processing_Research_Review_Article","3296313_Report_on_workshop_on_high_performance_computing_and_communications_for_grand_challenge_applications_computer_vision_speech_and_natural_language_processing_and_artificial_intelligence","3281843_Applying_Parallel_Processing_to_Natural-Language_Processing","3281839_Natural-Language_Processing"]}