{"id":"322487895_Requirements_Prioritization_Techniques_Comparison","abstract":"Requirements prioritization is considered as one of the most important approaches in the requirement engineering process. Requirements prioritization is used to define the ordering or schedule for executing requirement based on their priority or importance with respect to stakeholders’ viewpoints. Many prioritization techniques for requirement have been proposed by researchers, and there is no single technique can be used for all projects types. In this paper we give an overview of the requirement process and requirement prioritization concept. We also present the most popular techniques used to prioritize the software project requirements and a compression between these techniques. On the other hand, we spot the light on the importance of involving the non-functional requirements prioritization because of the great effects of non-functional on project success and quality; some approaches that used in prioritize non-functional requirements are discussed in this paper, in addition a general model is proposed based on reviewing the prioritization techniques in order to suggests a best suited technique for specific projects according to decision makers parameters.","authors":["Amjad Hudaib","Raja M.T Masadeh","Mais Haj Qasem","Abdullah Issa Alzaqebah"],"meta":["January 2018Modern Applied Science 12(2)","DOI:10.5539/mas.v12n2p62","Project: Whale Optimization Algorithm for Requirements Prioritization"],"references":["322524463_Grey_Wolf_Algorithm_for_Requirements_Prioritization","322413230_Requirements_Prioritization_Techniques_Review_and_Analysis","319393768_Key_words_for_use_in_RFCs_to_Indicate_Requirement_Levels","301759449_Experimentation_on_Accuracy_of_Non_Functional_Requirement_Prioritization_Approaches_for_different_complexity_Projects","299646730_Data_Mining_Approach_for_Commercial_Data_Classification_and_Migration_in_Hybrid_Storage_Systems","263585408_An_Approach_for_Integrating_the_Prioritization_of_Functional_and_Nonfunctional_Requirements","261506446_Requirements_prioritization_in_software_engineering_A_systematic_mapping_study","345754604_Non-functional_Requirement_Prioritization_Approach","260649019_A_Machine_Learning_Approach_to_Software_Requirements_Prioritization","243786842_IETF_RFC_2119_Key_words_for_use_in_RFCs_to_Indicate_Requirement_Levels"]}