{"id":"322408346_Information-Theoretic_Analysis_of_a_Family_of_Improper_Discrete_Constellations","abstract":"Non-circular or improper Gaussian signaling has proven beneficial in several interference-limited wireless networks. However, all implementable coding schemes are based on finite discrete constellations rather than Gaussian signals. In this paper, we propose a new family of improper constellations generated by widely linear processing of a square M-QAM (quadrature amplitude modulation) signal. This family of discrete constellations is parameterized by κ , the circularity coefficient and a phase ϕ . For uncoded communication systems, this phase should be optimized as ϕ * ( κ ) to maximize the minimum Euclidean distance between points of the improper constellation, therefore minimizing the bit error rate (BER). For the more relevant case of coded communications, where the coded symbols are constrained to be in this family of improper constellations using ϕ * ( κ ) , it is shown theoretically and further corroborated by simulations that, except for a shaping loss of 1.53 dB encountered at a high signal-to-noise ratio (snr), there is no rate loss with respect to the improper Gaussian capacity. In this sense, the proposed family of constellations can be viewed as the improper counterpart of the standard proper M-QAM constellations widely used in coded communication systems.","authors":["Ignacio Santamaría","Pedro M. Crespo","Christian Lameiro","Peter J. Schreier"],"meta":["January 2018Entropy 20(1):45","DOI:10.3390/e20010045"],"references":["331936660_Volume_Integrals_over_n-Dimensional_Ellipsoids","305007000_Improper_signaling_and_symbol_extensions_How_far_can_we_go_with_Gaussian_P2P_codebooks_in_the_interfering_MAC_with_TIN","304369196_On_the_Superiority_of_Improper_Gaussian_Signaling_in_Wireless_Interference_MIMO_Scenarios","283241469_Coexisting_Linear_and_Widely_Linear_Transceivers_in_the_MIMO_Interference_Channel","311241908_Overlay_Spectrum_Sharing_Using_Improper_Gaussian_Signaling","305676328_Improper_Gaussian_signaling_in_full-duplex_relay_channels_with_residual_self-interference","303830001_On_Alternate_Relaying_With_Improper_Gaussian_Signaling","303217800_Rate_region_boundary_of_the_Z-interference_channel_with_improper_signaling","299499845_Underlay_Cognitive_Radio_Systems_With_Improper_Gaussian_Signaling_Outage_Performance_Analysis","281663367_Statistical_Signal_Processing_of_Complex-Valued_Data-_The_Theory_of_Improper_and_Noncircular_Signals"]}