{"id":"322400225_An_extended_energy_hub_approach_for_load_flow_analysis_of_highly_coupled_district_energy_networks_Illustration_with_electricity_and_heating","abstract":"Energy systems at district/urban level are getting more complex and diversified from time to time. Different energy carriers are coupled each other to meet various types of energy demands. The conventional way of analyzing energy networks independently does not reflect the true nature of the coupled networks. One of such a promising coupled multi-carrier energy system (MCES) is the combination of district heating and electricity networks. The coupling between these two networks is increasing due to the integration of co– and poly-generation technologies at the distribution networks. Recent literatures tried to address a load flow analysis for lightly coupled networks by formulating case-specific load flow models. This paper presents a more general and flexible tool developed using Matlab® which can be used to conduct the load flow analysis of highly coupled electricity and heating networks. An energy hub concept is extended further to formulate a general model in which local generations and detailed network parameters of MCES can be taken into account. Coupled heating and electricity networks are modeled in detail for illustration. The flexibility and generality of the model are then tested by considering case studies with different network topologies (tree and meshed). A comparison is also made with a model used in recent literature. The results show that the proposed model is more accurate. The main contribution of this paper can be summarized by the following five points: (1) Coupling matrices are used to relate network power flow equations of different energy carriers; (2) Hybrid hydraulic head and pipe flow equations are used to develop the hydraulic model which can be applied for both types of tree and meshed heating networks with the possibility of pumping units; (3) A general thermal model that relates steady state temperature drops and mass flow rates, even during change of flow direction, is developed for the heating network; (4) The electricity network is modeled with the possibility of tap changing transformers; (5) The overall system of equations are solved as a single problem using Newton-Raphson iterative method.\nAvailable at:\nhttps://www.sciencedirect.com/science/article/pii/S0306261917318135","authors":["Getnet Tadesse Ayele","Pierrick Alexandre Haurant","Björn Laumert","Bruno Lacarrière"],"meta":["February 2018Applied Energy 212:850-867","DOI:10.1016/j.apenergy.2017.12.090","Project: Integrated District Energy System"],"references":["282454516_Modelling_assessment_and_Sankey_diagrams_of_integrated_electricity-heat-gas_networks_in_multi-vector_district_energy_systems","303795637_Combined_energy_hub_optimisation_and_demand_side_management_for_buildings","292604844_Synergy_of_smart_grids_and_hybrid_distributed_generation_on_the_value_of_energy_storage","283537552_An_Integrated_Steady-State_Operation_Assessment_of_Electrical_Natural_Gas_and_District_Heating_Networks","281580743_A_review_of_modelling_approaches_and_tools_for_the_simulation_of_district-scale_energy_systems","279805487_Integrated_modeling_of_microgrid_for_steady-state_analysis_using_modified_concept_of_multi-carrier_energy_hub","261565843_4th_Generation_District_Heating_4GDH_Integrating_smart_thermal_grids_into_future_sustainable_energy_systems","260523784_A_Decomposed_Solution_to_Multiple-Energy_Carriers_Optimal_Power_Flow"]}