{"id":"322433623_Federated_learning_of_predictive_models_from_federated_Electronic_Health_Records","abstract":"Background\nIn an era of “big data,” computationally efficient and privacy-aware solutions for large-scale machine learning problems become crucial, especially in the healthcare domain, where large amounts of data are stored in different locations and owned by different entities. Past research has been focused on centralized algorithms, which assume the existence of a central data repository (database) which stores and can process the data from all participants. Such an architecture, however, can be impractical when data are not centrally located, it does not scale well to very large datasets, and introduces single-point of failure risks which could compromise the integrity and privacy of the data. Given scores of data widely spread across hospitals/individuals, a decentralized computationally scalable methodology is very much in need.\n\nObjective\nWe aim at solving a binary supervised classification problem to predict hospitalizations for cardiac events using a distributed algorithm. We seek to develop a general decentralized optimization framework enabling multiple data holders to collaborate and converge to a common predictive model, without explicitly exchanging raw data.\n\nMethods\nWe focus on the soft-margin l1-regularized sparse Support Vector Machine (sSVM) classifier. We develop an iterative cluster Primal Dual Splitting (cPDS) algorithm for solving the large-scale sSVM problem in a decentralized fashion. Such a distributed learning scheme is relevant for multi-institutional collaborations or peer-to-peer applications, allowing the data holders to collaborate, while keeping every participant's data private.\n\nResults\nWe test cPDS on the problem of predicting hospitalizations due to heart diseases within a calendar year based on information in the patients Electronic Health Records prior to that year. cPDS converges faster than centralized methods at the cost of some communication between agents. It also converges faster and with less communication overhead compared to an alternative distributed algorithm. In both cases, it achieves similar prediction accuracy measured by the Area Under the Receiver Operating Characteristic Curve (AUC) of the classifier. We extract important features discovered by the algorithm that are predictive of future hospitalizations, thus providing a way to interpret the classification results and inform prevention efforts.","authors":["Theodora S. Brisimi","Ruidi Chen","Theofanie Mela","Alex Olshevsky"],"meta":["January 2018International Journal of Medical Informatics 112","DOI:10.1016/j.ijmedinf.2018.01.007"],"references":["320395340_Classification_Of_Diabetes_Disease_Using_Support_Vector_Machine","317425671_Outlier_Detection_Using_Distributionally_Robust_Optimization_under_the_Wasserstein_Metric","285648686_Differentially_Private_Distributed_Convex_Optimization_via_Functional_Perturbation","268451808_Average_Consensus_in_Nearly_Linear_Time_and_Its_Implications_for_Decentralized_Optimization_and_Multi-Agent_Control","267623929_Prediction_of_hospitalization_due_to_heart_diseases_by_supervised_learning_methods","259695002_Differentially_Private_Distributed_Optimization","238656504_Incremental_Subgradient_Methods_for_Nondifferentiable_Optimization","51549003_Application_of_Support_Vector_Machine_for_Prediction_of_Medication_Adherence_in_Heart_Failure_Patients","42388347_Application_of_support_vector_machine_modeling_for_prediction_of_common_diseases_The_case_of_diabetes_and_pre-diabetes","23763856_Support_Vector_Machines_for_Automated_Recognition_of_Obstructive_Sleep_Apnea_Syndrome_From_ECG_Recordings","312538118_Support-vector_networks","312112084_A_joint_sparse_clustering_and_classification_approach_with_applications_to_hospitalization_prediction","308061191_The_Algorithmic_Foundations_of_Differential_Privacy","301252143_Statistical_Learning_with_Sparsity_The_Lasso_and_Generalizations","284332229_k-Anonymity_A_Model_for_Protecting_Privacy","271592141_A_New_Initiative_on_Precision_Medicine","7775144_GEMS_A_System_for_automated_cancer_diagnosis_and_biomarker_discovery_from_microarray_gene_expression_data","5640022_General_Cardiovascular_Risk_Profile_for_Use_in_Primary_Care_The_Framingham_Heart_Study"]}