{"id":"322447285_One_hundred_twenty-five_years_of_the_Journal_of_Political_Economy_A_bibliometric_overview","abstract":"The Journal of Political Economy was created in December 1892. In 2017, the journal celebrates the 125th anniversary. Motivated by this event, this study presents a bibliometric overview of the leading trends of the journal according to a wide range of criteria including authors, institutions, countries, papers and keywords. The work uses the Scopus and the Web of Science databases to collect the bibliographic material and considers a wide range of bibliometric indicators including the number of citations and publications, the h-index, citation thresholds and the cites per paper. The study also uses software for the visualization of similarities by using several bibliometric techniques including bibliographic coupling, co-citation and co-occurrence of keywords. The results indicates that research published in the journal is mainly carried out by US economists, being the University of Chicago the most productive and influential institution. Several authors that published their seminal work in the journal have obtained the Nobel Prize in economics. The journal is well-recognized in the scientific community as one of the Top 5 journals in economics.","authors":["Lluis Amiguet","Anna M. Gil-Lafuente","Finn E Kydland","Jose M. Merigo"],"meta":["December 2017Journal of Political Economy 125(6)","Project: Spanish Royal Academy of Economics and Financial Sciences"],"references":["257663336_Time_series_citation_data_The_Nobel_Prize_in_economics","247570191_The_Journal_of_Management's_First_30_Years","313367358_Thirty_years_of_the_Journal_of_Business_Industrial_Marketing_a_bibliometric_analysis","281221890_Uncertainty_measures_for_economics_journal_impact_factors","270784769_50th_Anniversary_of_the_Review_of_Economic_Studies","264714000_Contributing_Authors_and_Institutions_to_the_Journal_of_Finance_1946-1985","263188208_Ranking_Journals","247837380_Two_Decades_of_Contributions_to_Marketing_and_Public_Policy_An_Analysis_of_Research_Published_in_Journal_of_Public_Policy_Marketing","247559556_What_Economists_Think_of_Their_Journals","246850582_Changes_in_The_Intellectual_Structure_of_Strategic_Management_Research"]}