{"id":"322487314_Undergraduate_Haredi_Students_Studying_Computer_Science_Is_Their_Prior_Education_Merely_a_Barrier","abstract":"Aim/Purpose Our research goal was to examine whether the prior, Talmud-based education\nof ultraorthodox Jewish men is merely a barrier to their academic\nstudies or whether it can be recruited to leverage academic learning.\nBackground This work is in line with the growing interest in extending the diversity of\nstudents studying in higher-education institutes and studying computer\nscience (CS) in particular.\nMethodology We employed a mixed-methods approach. We compared the scores in CS\ncourses of two groups of students who started their studies in the same\ncollege in 2015: 58 ultraorthodox men and 139 men with a conventional\nbackground of Israeli K-12 schooling. We also traced the solution processes\nof ultraorthodox men in tasks involving Logic, in which their\ngroup scored significantly better than the other group.\nContribution The main contribution of this work lies in challenging the idea that the\nknowledge of unique cultures is merely a barrier and in illustrating the\nimportance of further mapping such knowledge.\nFindings The ultraorthodox group’s grades in the courses never fell below the\ngrades of the other group for the duration of the five semesters. Due to\ntheir intensive Talmud studies (which embeds Logic), we hypothesized\nthey would have leverage in subjects relating to Logic; however this hypothesis\nwas refuted. Nevertheless, we found that the ultraorthodox students\ntended to recruit conceptual knowledge rather than merely recalling\na procedure to solve the task, as novices often do.\nRecommendations\nfor Practitioners\nWe concluded that these students’ unique knowledge should not be\nviewed merely as a barrier. Rather, it can and should be considered in\nterms of what and how it can anchor and leverage learning; this could\nfacilitate the education of this unique population.\nImpact on Society This conclusion has an important implication, given the growing interest\nin diversifying higher education and CS in particular, to include representatives\nof groups in society that come from different, unique cultures.\nFuture Research Students’ unique previous knowledge can and should be mapped, not\nonly to foresee weaknesses that are an outcome of “fragile knowledge” ,\nbut also in terms of possible strengths, knowledge, values, and practices\nthat can be used to anchor and expand the new knowledge.\nKeywords computer science, diversity, prior education, Talmud, Logic","authors":["Sara Genut","Yifat Ben-David Kolikant"],"meta":["December 2017Interdisciplinary Journal of e-Skills and Lifelong Learning 13","DOI:10.28945/3878","Project: Computer science education of unrepresented societies in academics"],"references":["304249115_Motivational_factors_for_studying_science_and_engineering_in_beginning_students_The_case_of_academic_preparatory_programmes","300115203_Does_Outreach_Impact_Choices_of_Major_for_Underrepresented_Undergraduate_Students","283322343_BETWEEN_MATHEMATICS_AND_TALMUD_-_THE_CONSTRUCTION_OF_A_HYBRID_DISCOURSE_IN_AN_ULTRA-ORTHODOX_CLASSROOM","271293267_Self-Esteem_and_Motivation_for_Learning_among_Minority_Students_A_Comparison_between_Students_of_Pre-Academic_and_Regular_Programs","267686821_Quantitative_Analyses_of_Student_Performance_On_Concept_Inventories","260979995_Success_in_Introductory_Programming_What_Works","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","289175986_Rigorous_Methodology_for_Concept_Inventory_Development_Using_the_'Assessment_Triangle'_to_Develop_and_Test_the_Thermal_and_Transport_Science_Concept_Inventory_TTCI","271012528_Ethno-Religious_Differences_in_Israeli_Higher_Education_Vertical_and_Horizontal_Dimensions","267457641_A_psychometric_evaluation_of_the_digital_logic_concept_inventory"]}