{"id":"322454391_A_Multimodal_Approach_for_the_Safeguarding_and_Transmission_of_Intangible_Cultural_Heritage_The_Case_of_i-Treasures","abstract":"Intangible Cultural Heritage (ICH) creations include, amongst other, music, dance, singing, theatre, human skills and craftsmanship. These cultural expressions are usually transmitted orally and/or using gestures and are modified over a period of time, through a process of collective recreation. As the world becomes more interconnected and many different cultures come into contact, local communities run the risk of losing important elements of their ICH, while young people find it difficult to maintain the connection with the cultural heritage treasured by their elders. In this paper, we present a novel holistic approach for the safeguarding and transmission of ICH that goes beyond the mere digitization of ICH content. Based on multisensory technology for the capturing of ICH, the proposed approach enables the generation of completely novel cultural content. High-level semantics are extracted from the acquired data, enabling researchers to identify possible implicit or hidden correlations between different ICH expressions or interpretation styles and study the evolution of a specific ICH. This data, coupled with other cultural resources, is accessible through the i-Treasures Web-platform, which provides the means for supporting knowledge exchange between researchers as well as know-how transmission from ICH bearers to apprentices.","authors":["Kosmas Dimitropoulos","Sotiris Manitsaris","Filareti Tsalakanidou","Bruce Denby"],"meta":["January 2018Intelligent Systems, IEEE PP(99):1-1","DOI:10.1109/MIS.2018.111144858"],"references":["334735261_Intangible_Cultural_Heritage_and_New_Technologies_Challenges_and_Opportunities_for_Cultural_Preservation_and_Development","310734460_Classification_of_Multidimensional_Time-Evolving_Data_Using_Histograms_of_Grassmannian_Points","295105425_Multi-Entity_Bayesian_Networks_for_Knowledge-Driven_Analysis_of_ICH_Content","274633528_A_Game-like_Application_for_Dance_Learning_Using_a_Natural_Human_Computer_Interface","269692830_An_Integrated_Platform_Supporting_Intangible_Cultural_Heritage_Learning_and_Transmission_Definition_of_Requirements_and_Evaluation_Criteria","262679319_Learning_cultural_heritage_by_serious_games","305910555_Motion_machine_A_new_framework_for_motion_capture_signal_feature_prototyping","304372513_Contour-based_3D_tongue_motion_visualization_using_ultrasound_image_sequences"]}