{"id":"322419245_Optimal_resource_diffusion_for_suppressing_disease_spreading_in_multiplex_networks","abstract":"Resource diffusion is an ubiquitous phenomenon, but how it impacts epidemic spreading has received little study. We propose a model that couples epidemic spreading and resource diffusion in multiplex networks. The spread of disease in a physical contact layer and the recovery of the infected nodes are both strongly dependent upon resources supplied by their counterparts in the social layer. The generation and diffusion of resources in the social layer are in turn strongly dependent upon the state of the nodes in the physical contact layer. Resources diffuse preferentially or randomly in this model. To quantify the degree of preferential diffusion, a bias parameter that controls the resource diffusion is proposed. We conduct extensive simulations and find that the preferential resource diffusion can change phase transition type of the fraction of infected nodes. When the degree of interlayer correlation is below a critical value, increasing the bias parameter changes the phase transition from double continuous to single continuous. When the degree of interlayer correlation is above a critical value, the phase transition changes from multiple continuous to first discontinuous and then to hybrid. We find hysteresis loops in the phase transition. We also find that there is an optimal resource strategy at each fixed degree of interlayer correlation where the threshold reaches a maximum and under which the disease can be maximally suppressed. In addition, the optimal controlling parameter increases as the degree of inter-layer correlation increases.","authors":["Xiaolong Chen","Wei Wang","Shimin Cai","H. Eugene Stanley"],"meta":["January 2018Journal of Statistical Mechanics Theory and Experiment 2018(5)","DOI:10.1088/1742-5468/aabfcc","Project: Complex networks"],"references":["307469293_The_physics_of_spreading_processes_in_multilayer_networks","281262073_Disease-induced_resource_constraints_can_trigger_explosive","280227222_West_African_Ebola_Epidemic_after_One_Year_-_Slowing_but_Not_Yet_under_Control","279968925_Epidemic_spreading_and_immunization_strategy_in_multiplex_networks","307472662_Optimal_Deployment_of_Resources_for_Maximizing_Impact_in_Spreading_Processes","301879448_Crossover_phenomena_of_percolation_transition_in_evolution_networks_with_hybrid_attachment","301879410_Immunization_and_Targeted_Destruction_of_Networks_using_Explosive_Percolation","286512712_Simple_algorithm_for_computing_the_communication_complexity_of_quantum_communication_processes","274023202_Monte_Carlo_Simulation_in_Statistical_Physics","273704243_Percolation_in_real_interdependent_networks","271771638_Multiple_Tipping_Points_and_Optimal_Repairing_in_Interacting_Networks","269417469_Immunization_strategy_for_epidemic_spreading_on_multilayer_networks","263745870_The_Matthew_effect_in_empirical_data","264708826_Epidemic_processes_in_complex_networks","262319902_A_Critical_Point_for_Random_Graphs_with_a_Given_Degree_Sequence"]}