{"id":"322431242_Digital_signage_and_targeted_advertisement_based_on_personal_preferences_and_digital_business_models","abstract":"Digital signage in general refers to the provision of content (advertisements, news, assistance) on electronic scoreboards or large displays in places where many people are present or passing by. The more this content is expected to be tailored for specific user groups, the more context information is required, like, e.g., the preferences or profiles of target users or user groups. The ideal digital signage solution would be able to provide individualized content for the audience consuming the information at any time: if only one person is present, the content would be personalized for this person; if a group of persons is present the demand of all should be met. Based on a digital signage solution for elevator doors, the paper investigates the intersecting of preferences as a contribution to determine the most relevant content for a group of users. This intersection of preferences serves as a basis for new business models for interactive elevator digital signage. The main contributions of the paper are (1) an industrial case of digital business model innovation motivating contextual digital signage, (2) a technical approach for intersecting personal preferences, and (3) a methodical approach for digital business model innovation.","authors":["Matthias Wißotzki","Kurt Sandkuhl","Alexander V. Smirnov","Alexey Kashevnik"],"meta":["November 2017","DOI:10.23919/FRUCT.2017.8250206","Conference: 2017 21st Conference of Open Innovations Association (FRUCT)"],"references":["260584232_Interactive_Digital_Signage","257660223_Dynamic_context-aware_personalisation_in_a_pervasive_environment","320798154_Matching_and_Grokking_Approaches_to_Personalized_Crowdsourcing","316474982_Quantitative_preference_model_for_dynamic_query_personalization","305175424_A_Domain_Ontology_in_Social_Networks_for_Identifying_User_Interest_for_Personalized_Recommendations","262209942_Are_there_any_nicely_structured_preference_profiles_nearby","261119761_A_multi-agent_personalized_ontology_profile_based_user_preference_profile_construction_method","256852152_Design_Science_in_Information_Systems_Research","250957244_Digital_Capital_Harnessing_the_Power_of_Business_Webs","247834016_Ontology-driven_codification_for_discrete_and_modular_products"]}