{"id":"322412904_Social_Engineering_and_Insider_Threats","abstract":"This paper describes our research on the insider\nthreats of Social engineering. Social engineering is a method\nusing interaction between humans to get the access of a\nsystem in an illegal way. Due to staff’s lack of confidentiality,\nthe confidentiality of records is compromised, data is stolen\nor financial damage is done. This is insider threat. Social\nengineering and insider threat are two of the most relevant\nsubjects in cyber security today. This research summarizes\nand seeks solution for the drawback of Social engineering\nthrough analyzing the Insider Threat cases. The first stage is\nto introduce the importance of using social engineering to\nreduce internet crime by analyzing the past loss created by\ninsider threats. The second test illustrates insider threats’\nhazards to network security are ongoing. The third part\ncovers the situation of insider threats with the emphasis on\nthe security side. The topic of security aspect is extended to\nthe rest of internal control of system, data exchange, and\nmanagement of employees and their communication content.\nActually, by the time of this abstract, insider threats are still\nnot being taken as seriously as it should be. Many companies\nand organizations have given little thought to the insider\nthreat but have concentrated on keeping attackers outside\nthe network. This research will directly focus on the insider\nthreats of organizations and the ways hackers use social\nengineering with the latest analysis of technology involved\nand examples that are close to common cybercrime. We aim\nto reveal the importance of reducing insider threats in\norganizations. The further research will be focused on a\ngroup consisted of managers and engineers within a\ncompany and the communication means of staff to the\noutside world. The analysis of the related crime cases will\nhelp prevent similar tragedy and seek possible approaches.\nKey Words— Social engineering; Insider threat; Cyber Crime;\nCyber security; Organization; Hackers","authors":["Liu Xiangyu","Li Qiuyang","Sonali Chandel"],"meta":["October 2017","DOI:10.1109/CyberC.2017.91","Conference: 2017 International Conference on Cyber-Enabled Distributed Computing and Knowledge Discovery (CyberC)"],"references":["267936156_Failure_to_Recognize_Fake_Internet_Popup_Warning_Messages","265882572_A_Personality_Based_Model_for_Determining_Susceptibility_to_Phishing_Attacks","235357780_Phishing_Personality_Traits_and_Facebook","285713979_Thinking_in_Systems_A_Primer","273961956_The_Psychology_of_Vigilance","261454307_Phishing_in_a_university_community_Two_large_scale_phishing_experiments","261264369_A_Bayesian_Network_Model_for_Predicting_Insider_Threats","247878603_The_Field_Guide_to_Human_Error_Investigations","247286694_Prospect_Theory_of_Decisions_Under_Risk","237010027_Who_is_More_Susceptible_to_Phishing_Emails_A_Saudi_Arabian_Study","235114728_Development_of_Methodical_Social_Engineering_Taxonomy_Project","234837375_Personality_Structure_Emergence_of_the_Five-Factor_Model","232557435_Changes_in_operator_efficiency_as_a_function_of_environmental_stress_fatigue_and_circadian_rhythms","232454041_Noise_task_difficulty_and_Stroop_color-word_performance","221516432_Why_phishing_works"]}