{"id":"322525698_What_does_interdisciplinarity_look_like_in_practice_Mapping_interdisciplinarity_and_its_limits_in_the_environmental_sciences","abstract":"In this paper we take a close look at current interdisciplinary modeling practices in the environmental sciences , and suggest that closer attention needs to be paid to the nature of scientific practices when investigating and planning interdisciplinarity. While interdisciplinarity is often portrayed as a medium of novel and trans-formative methodological work, current modeling strategies in the environmental sciences are conservative, avoiding methodological conflict, while confining interdisciplinary interactions to a relatively small set of pre-existing modeling frameworks and strategies (a process we call crystallization). We argue that such practices can be rationalized as responses in part to cognitive constraints which restrict interdisciplinary work. We identify four salient integrative modeling strategies in environmental sciences, and argue that this crystalliza-tion, while contradicting somewhat the novel goals many have for interdisciplinarity, makes sense when considered in the light of common disciplinary practices and cognitive constraints. These results provide cause to rethink in more concrete methodological terms what interdisciplinarity amounts to, and what kinds of inter-disciplinarity are obtainable in the environmental sciences and elsewhere.","authors":["Miles Macleod","Michiru Nagatsu"],"meta":["February 2018Studies In History and Philosophy of Science Part A 67","DOI:10.1016/j.shpsa.2018.01.001","Project: Model-building across disciplinary boundaries: Economics, Ecology, and Psychology"],"references":["311558344_Investigating_Interdisciplinary_Collaboration_Theory_and_Practice_Across_Disciplines","308941908_What_makes_interdisciplinarity_difficult_Some_consequences_of_domain_specificity_in_interdisciplinary_practice","305267244_Model_Coupling_in_Resource_Economics_Conditions_for_Effective_Interdisciplinary_Collaboration","299857791_Optimality_of_continuous_cover_vs_clearcut_regimes_in_managing_forest_resources","287241582_Magnets_spins_and_neurons_The_dissemination_of_model_templates_across_disciplines","347571805_An_Introduction_to_Ecological_Economics","334711978_The_Eroding_Artificial-Natural_Distinction_Some_Consequences_for_Ecology_and_Economics","318444029_Economics_of_forest_carbon_storage_and_the_additionality_principle","305481488_Interdisciplinary_problem-_solving_emerging_modes_in_integrative_systems_biology","297650053_Interdisciplinary_success_without_integration"]}