{"id":"322585173_STRIDE-based_threat_modeling_for_cyber-physical_systems","abstract":"Critical infrastructures and industrial control systems are complex Cyber-Physical Systems (CPS). To ensure reliable operations of such systems, comprehensive threat modeling during system design and validation is of paramount significance. Previous works in literature mostly focus on safety, risks and hazards in CPS but lack effective threat modeling necessary to eliminate cyber vulnerabilities. Further, impact of cyber attacks on physical processes is not fully understood. This paper presents a comprehensive threat modeling framework for CPS using STRIDE, a systematic approach for ensuring system security at the component level. This paper first devises a feasible and effective methodology for applying STRIDE and then demonstrates it against a real synchrophasor-based synchronous islanding testbed in the laboratory. It investigates (i) what threat types could emerge in each system component based on the security properties lacking, and (ii) how a vulnerability in a system component risks the entire system security. The paper identifies that STRIDE is a light-weight and effective threat modeling methodology for CPS that simplifies the task for security analysts to identify vulnerabilities and plan appropriate component level security measures at the system design stage.","authors":["Rafiullah Khan","Kieran Mclaughlin","David Laverty","Sakir Sezer"],"meta":["September 2017","DOI:10.1109/ISGTEurope.2017.8260283","Conference: 2017 IEEE PES Innovative Smart Grid Technologies Conference Europe (ISGT-Europe)"],"references":["316060984_Threat_Analysis_of_BlackEnergy_Malware_for_Synchrophasor_based_Real-time_Control_and_Monitoring_in_Smart_Grid","316060941_IEEE_C37118-2_Synchrophasor_Communication_Framework_Overview_Cyber_Vulnerabilities_Analysis_and_Performance_Evaluation","316060888_Analysis_of_IEEE_C37118_and_IEC_61850-90-5_synchrophasor_communication_frameworks","309151336_Threat_Modeling_in_Cyber-Physical_Systems","304745194_STPA-SafeSec_Safety_and_security_analysis_for_cyber-physical_systems","291766457_A_STRIDE-Based_Threat_Model_for_Telehealth_Systems","291349648_SAHARA_A_security-aware_hazard_and_risk_analysis_method","344490828_Data_Integrity_Attacks_in_Smart_Grid_Wide_Area_Monitoring","308831312_Synchrophasors_Applications_in_Power_System_Monitoring_Protection_and_Control","300343562_A_Cyber-Physical_Security_Analysis_of_Synchronous-Islanded_Microgrid_Operation"]}