{"id":"322551070_Durch_das_praktische_Gestalten_von_didaktischen_Designs_nutzliche_Erkenntnisse_gewinnen_Eine_Einfuhrung_in_die_Gestaltungsforschung","abstract":"In dem Aufsatz wird eine Einführung in die didaktische Gestaltungsforschung (Design-Based-Research, DBR) gegeben. Der pragmatische Forschungsansatz wird als Alternative zu bestehenden Traditionen der Lehr-Lern-Forschung in Aussicht gestellt, da er deren oftmals beklagte Praxisferne überwinden soll.\n\nGestaltungsforschung zielt darauf ab, komplexe Probleme in Lehr-Lernkontexten durch innovative, nützliche und praktische Entwicklungen zu adressieren. Durch das aktive Entwerfen und Gestalten dieser Interventionen werden dabei auch theoretische Erkenntnisse gewonnen, mit denen neue Theorien konstruiert oder bestehende bereichert werden können.\n\nIm dem Aufsatz wird die Nützlichkeit des DBR-Ansatzes herausgearbeitet, begriffliche Grundlagen erörtert und das methodische Vorgehen beschrieben. Dabei werden auch Standards und Gütekriterien besprochen. Abschließend wird der Ansatz einer kritischen Analyse unterzogen, um neben den Chancen auch Grenzen und Unzulänglichkeiten herauszuarbeiten. DBR eignet sich für Lehrende, die ihrer Praxis gestalterisch auf den Grund gehen möchten.","authors":["Dirk Jahn"],"meta":["January 2014"],"references":["296063521_Kritisches_Denken_fordern_konnen_-_Entwicklung_eines_didaktischen_Designs_zur_Qualifizierung_padagogischer_Professionals","254088681_Design-Based_Research","245888530_Design_Research_for_Sustained_Innovation","300894195_Begrundungslinien_fur_eine_entwicklungsorientierte_Bildungsforschung","272832621_Wirtschaftsunterricht_gestalten_Toolbox_Eine_traditionelle_und_handlungsorientierte_Didaktik_fur_kaufmannische_Bildungsgange","272832481_Qualifizierung_padagogischer_Professionals_fur_flexibles_Lernen","271429289_Design_Research_Theoretical_and_Methodological_Issues","265092409_Innovation_ohne_ForschungEin_Pladoyer_fur_den_Design-Based_Research-Ansatz_in_der_Lehr-Lernforschung","251151778_Methoden-Triangulation_in_der_qualitativen_Forschung","247813179_The_'Compleat'_Design_Experiment_from_soup_to_nuts"]}