{"id":"322503303_A_survey_of_incremental_high-utility_itemset_mining","abstract":"Traditional association rule mining has been widely studied. But it is unsuitable for real-world applications where factors such as unit profits of items and purchase quantities must be considered. High-utility itemset mining (HUIM) is designed to find highly profitable patterns by considering both the purchase quantities and unit profits of items. However, most HUIM algorithms are designed to be applied to static databases. But in real-world applications such as market basket analysis and business decision-making, databases are often dynamically updated by inserting new data such as customer transactions. Several researchers have proposed algorithms to discover high-utility itemsets (HUIs) in dynamically updated databases. Unlike batch algorithms, which always process a database from scratch, incremental high-utility itemset mining (iHUIM) algorithms incrementally update and output HUIs, thus reducing the cost of discovering HUIs. This paper provides an up-to-date survey of the state-of-the-art iHUIM algorithms, including Apriori-based, tree-based, and utility-list-based approaches. To the best of our knowledge, this is the first survey on the mining task of incremental high-utility itemset mining. The paper also identifies several important issues and research challenges for iHUIM. This article is categorized under:","authors":["Wensheng Gan","Chun-Wei Jerry Lin","Philippe Fournier Viger","Han‐Chieh Chao"],"meta":["January 2018Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery 8(6)","DOI:10.1002/widm.1242","Project: UPM: utility-oriented pattern mining"],"references":["318536108_Data_mining_in_distributed_environment_a_survey","315726273_A_Survey_of_Itemset_Mining","315726003_A_Survey_of_Itemset_Mining","313698821_Efficient_algorithm_for_mining_high_average-utility_itemsets_in_incremental_transaction_databases","315462023_An_Efficient_Algorithm_for_Mining_High_Utility_Patterns_from_Incremental_Databases_with_One_Database_Scan","314198135_A_Lattice-Based_Approach_for_Mining_High_Utility_Association_Rules","313553730_Constrained_frequent_pattern_mining_A_pattern-growth_view","313524724_Database_mining_A_performance_perspective","312455488_Resilient_distributed_datasets_A_fault-tolerant_abstraction_for_in-memory_cluster_computing","309759156_Mining_of_high_average-utility_itemsets_using_novel_list_structure_and_pruning_strategy"]}