{"id":"322592281_Navigable_maps_of_structural_brain_networks_across_species","abstract":"Brains are spatially embedded networks whose architecture has been shaped by physical and biochemical constraints throughout evolution. While these networks provide global connectivity and sustain the broad spectrum of the functions of the brain, the underlying routing strategies for communication between the different areas and their control remain to be elucidated. Here, we investigate the flow of information in connectomes of several species using greedy routing as a distributed navigation protocol. In Euclidean space, in which brains have evolved, our results unveil that the navigability of brains vary highly across species. On the one hand, this result may suggest that the more evolved an organism is, the more the structure of the connectome is encoded in the spatial organization of the brain. On the other hand, conclusions obtained using coarse-grained connectomes, where nodes correspond to areas instead of individual neurones, may not apply to connectomes obtained at the microscopic, neuronal level. Moreover, we prove that the effective geometry of the brain is better described as hyperbolic rather than Euclidean. This indicates that other factors besides degrees and Euclidean distance play a significant role in the existence of connections. On a more practical perspective, hyperbolic embeddings offer a universal and meaningful representations to compare brain networks across species on an equal footing.","authors":["Antoine Allard","M. Ángeles Serrano"],"meta":["January 2018PLoS Computational Biology 16(2)","DOI:10.1371/journal.pcbi.1007584"],"references":["345689389_The_latent_geometry_of_the_human_protein_interaction_network","325560161_Editorial_New_Trends_in_Connectomics","324473034_The_latent_geometry_of_the_human_protein_interaction_network","324005732_A_spectrum_of_routing_strategies_for_brain_networks","322961410_Efficient_communication_dynamics_on_macro-connectome_and_the_propagation_speed","322695216_Navigation_of_brain_networks","321169172_Machine_learning_meets_complex_networks_via_coalescent_embedding_in_the_hyperbolic_space","323461193_How_to_Characterize_the_Function_of_a_Brain_Region","321804736_Communication_dynamics_in_complex_brain_networks","316117945_Human_Brain_Mapping_A_Systematic_Comparison_of_Parcellation_Methods_for_the_Human_Cerebral_Cortex"]}