{"id":"322508229_Possibility_spaces_and_the_notion_of_novelty_from_music_to_biology","abstract":"We provide a new perspective on the relation between the space of description of an object and the appearance of novelties. One of the aims of this perspective is to facilitate the interaction between mathematics and historical sciences. The definition of novelties is paradoxical: if one can define in advance the possibles, then they are not genuinely new. By analyzing the situation in set theory, we show that defining generic (i.e., shared) and specific (i.e., individual) properties of elements of a set are radically different notions. As a result, generic and specific definitions of possibilities cannot be conflated. We argue that genuinely stating possibilities requires that their meaning has to be made explicit. For example, in physics, properties playing theoretical roles are generic; then, generic reasoning is sufficient to define possibilities. By contrast, in music, we argue that specific properties matter, and generic definitions become insufficient. Then, the notion of new possibilities becomes relevant and irreducible. In biology, among other examples, the generic definition of the space of DNA sequences is insufficient to state phenotypic possibilities even if we assume complete genetic determinism. The generic properties of this space are relevant for sequencing or DNA duplication, but they are inadequate to understand phenotypes. We develop a strong concept of biological novelties which justifies the notion of new possibilities and is more robust than the notion of changing description spaces. These biological novelties are not generic outcomes from an initial situation. They are specific and this specificity is associated with biological functions, that is to say, with a specific causal structure. Thus, we think that in contrast with physics, the concept of new possibilities is necessary for biology.","authors":["Maël Montévil"],"meta":["November 2019Synthese 196(11)","DOI:10.1007/s11229-017-1668-5","Project: Theoretical Principles for Biology"],"references":["317305354_Complex_versus_Complicated_Models_of_Cognition","317151730_Biological_Physics_of_the_Developing_Embryo","306140617_Theoretical_principles_for_biology_Variation","306076621_Theoretical_principles_for_biology_Organization","304965332_Formal_Definitions_of_Unbounded_Evolution_and_Innovation_Reveal_Universal_Mechanisms_for_Open-Ended_Evolution_in_Dynamical_Systems","304490458_Assisted_Lead_Sheet_Composition_Using_FlowComposer","317151676_Biological_Physics_of_the_Developing_Embryo","314374078_A_Critical_Overview_of_Biological_Functions","314112166_Grand_Views_of_Evolution","311892363_Chasing_the_Tail_The_Emergence_of_Autocatalytic_Networks"]}