{"id":"322596184_Making_sense_of_user_comments_Identifying_journalists'_requirements_for_a_comment_analysis_framework","abstract":"Newsrooms are still searching for ways to manage user comments because of both a desire for professional distance from their audiences and a lack of analytical tools. This paper presents findings from our exploratory, interdisciplinary study in journalism research and computer science that focuses on the algorithmic classification and clustering of user comments. In contrast to endeavours that aim at filtering out hate speech or spam, we take a more constructive approach and focus on detecting particularly useful or high-quality user contributions that can be leveraged for journalistic purposes. On the basis of a literature review and our own preliminary research on audience participation and user review analytics, we developed a mock-up of a software framework to help journalists systematically analyze user comments to this end. We then surveyed its effectiveness through two group discussions - one with comment moderators and another with editors from different editorial departments of a large German online newsroom. Features that journalists and comment moderators considered useful include the categorization of user comments in pro- and contra-arguments towards a certain topic, the automated assessment of comments' quality as well as the identification of surprising or exceptional comments and those that present new questions, arguments or viewpoints.","authors":["Wiebke Loosen","Marlo Häring","Zijad Kurtanović","Lisa Merten"],"meta":["January 2017Studies in Communication and Media 6(4):333-364","DOI:10.5771/2192-4007-2017-4-333","Project: SCAN – Systematic Content Analysis of User Comments for Journalists"],"references":["324331578_Erwartungen_und_Erwartungserwartungen_an_Publikumsbeteiligung_bei_der_Tagesschau","322181134_Communicative_Figurations_Transforming_Communications_in_Times_of_Deep_Mediatization","321343254_The_Transformation_of_Journalism_From_Changing_Newsroom_Cultures_to_a_New_Communicative_Orientation_2017","311759653_Toward_the_Automated_Detection_of_Individuals'_Rationales_in_Large-Scale_Online_Open_Participative_Activities_A_Conceptual_Framework","307545605_The_Effects_of_Reader_Comments_on_the_Perception_of_Personalized_Scandals_Exploring_the_Roles_of_Comment_Valence_and_Commenters'_Social_Status","320026034_Mining_User_Rationale_from_Software_Reviews","318283646_The_deliberative_influence_of_comment_section_structure","310812052_Despicable_Disgusting_Repulsive_Public_Emotions_and_Moralities_in_Online_Discussions_About_Violence_Towards_Refugees","309042939_Reciprocal_journalism_a_concept_of_mutual_exchange_between_journalists_and_audiences","308825707_Using_compression_models_for_filtering_troll_comments"]}