{"id":"322539357_Utilizing_Learners'_Negative_Ratings_in_Semantic_Content-based_Recommender_System_for_e-Learning_Forum","abstract":"Nowadays, most of e-learning systems embody online discussion forums as a medium for collaborative learning that supports knowledge sharing and information exchanging between learners. The exponential growth of the available shared information in e-learning online discussion forums has caused a difficulty for learners in discovering interesting information. This paper introduces a novel recommendation architecture that is able to recommend interesting post messages to the learners in an e-learning online discussion forum based on a semantic content-based filtering and learners' negative ratings. We evaluated the proposed e-learning recommender system against exiting e-learning recommender systems that use similar filtering techniques in terms of recommendation accuracy and learners' performance. The obtained experimental results show that the proposed e-learning recommender system outperforms other similar e-learning recommender systems that use non-semantic content-based filtering technique (CB), non-semantic content-based filtering technique with learners' negative ratings (CB-NR), semantic content-based filtering technique (SCB), with respect to system accuracy of about 57%, 28%, and 25%, respectively. Furthermore, the obtained results also show that the learning performance has been increased by at least 9.84% for the learners whom are supported by recommendations based on the proposed technique as compared to other similar recommendation techniques.","authors":["Naji Albatayneh","Khairil Imran","Fang-Fang Chua"],"meta":["January 2018Educational Technology & Society 21(1)","Project: Semantically- enhanced Content-based Recommender Systems"],"references":["287246825_A_Semantic_Content-Based_Forum_Recommender_System_Architecture_Based_on_Content-Based_Filtering_and_Latent_Semantic_Analysis","301222357_Toward_the_next_generation_of_recommender_systems_A_survey_of_the_state-of-the-art_and_possible_extensions","296951462_Panorama_of_recommender_systems_to_support_learning","288467056_Social_Learning_Theory","286535385_Effective_Trust-aware_E-learning_Recommender_System_based_on_Learning_Styles_and_Knowledge_Levels","285598717_Enhancing_Online_Discussion_Forums_with_Topic-Driven_Content_Search_and_Assisted_Posting","276074803_OntoSakai_On_the_optimization_of_a_Learning_Management_System_using_semantics_and_user_profiling","274903035_Recommender_System_Application_Developments_A_Survey","270293266_A_recommender_agent_based_on_learning_styles_for_better_virtual_collaborative_learning_experiences","262286679_Elicitation_of_latent_learning_needs_through_learning_goals_recommendation"]}