{"id":"322592488_Hiding_in_plain_sight_Leaf_beetles_Chrysomelidae_Galerucinae_use_feeding_damage_as_a_masquerade_decoy","abstract":"We report on a unique variant of the masquerade strategy, wherein small herbivorous leaf beetles (Chrysomelidae:\nGalerucinae) have recurrently evolved a close resemblance to innocuous, unprofitable decoy objects of their own\nmanufacture, i.e. their own feeding damage. Our study is based on a worldwide sample of 119 species of leaf beetles\nin the subfamily Galerucinae. Most species (115) are members of the tribe Alticini, the flea beetles s.s., known for\ntheir remarkably swift jumping ability and astonishing diversity. Masquerading beetles are small, ranging in length\nfrom 1.4 to 4.2 mm, monochromatically light or dark, and lack contrasting patterns or warning colours. Although\nmany species make shallow, light colored trenches, 53% of the adult feeding damage consists of closely spaced, oval\nto elongate holes that completely penetrate the host leaf, which gives it a pitted, stippled appearance. Body area\nwas correlated with feeding hole area. Hole area increases by 0.60 mm2 for each square millimetre of beetle area.\nLog–linear modelling showed that beetle body colour was darker when damage was darker and lighter when damage\nwas lighter and when host leaves were broad as opposed to narrow and were oriented horizontally as opposed to\nvertically. We discuss why masquerade is not a response to induced host plant defences. These findings support the\nhypothesis that intense selection by visually orienting predators, such as insectivorous birds, has driven small leaf\nbeetles to evolve bodies more closely to resemble their feeding damage and evolve their feeding habits to produce\ndamage that resembles their own bodies.","authors":["Alexander Konstantinov","K D Prathapan","Fredric V. Vencl"],"meta":["February 2018Biological Journal of the Linnean Society 123(1):311–320","DOI:10.1093/biolinnean/blx149","Project: Systematics of Oriental flea beetles"],"references":["312921551_Linking_the_evolution_and_form_of_warning_coloration_in_nature","308172449_Background_complexity_and_the_detectability_of_camouflaged_targets_by_birds_and_humans","304948041_Jumping_mechanisms_and_performance_in_beetles_I_Flea_beetles_Coleoptera_Chrysomelidae_Alticini","303531745_Possible_living_fossil_in_Bolivia_A_new_genus_of_flea_beetles_with_modified_hind_legs_Coleoptera_Chrysomelidae_Galerucinae_Alticini","317314121_BIRD_PREDATION_AS_A_SELECTIVE_AGENT_IN_A_BUTTERFLY_POPULATION","313140546_Disappearance_as_a_protective_factor_A_supposed_case_of_Batesian_mimicry_among_beetles_Coleoptera_Carabidae_and_Chrysomelidae","298508187_The_evolution_and_ecology_of_masquerade","289060492_Chemical_defence_of_adult_leaf_beetles_updated","284978330_Resultate_funfzehnjahriger_Untersuchungen_uber_die_Nahrungspflanzen_einheimischer_Halticinen","284756305_Uber_die_Vortheile_der_Mimicry_bei_Schmetterlingen"]}