{"id":"322597981_Recall_and_Recognition_on_Minimalism_A_Replication_of_the_Case_Study_on_the_Apple_Logo","abstract":"The present research aims to better understand the impact of brand exposure and brand perception on logo recall and recognition. Building off of prior work that has examined surprising impairments in visual memory for the Apple logo (Blake, Nazarian and Castel, 2015), a comparative analysis is developed by comparing computer science and social science becoming specialists. The Apple logo is used as a case study due to its minimalism. The data reveal that only a small amount of the subjects can recall and recognize the Apple logo correctly. The recognition phase, in comparison with the recalling one, seems to be an easier task for the subjects. However, although the stylized features of the logo are often overlooked, each subject manages to recognize a large amount of details of the logo. Contrary to expectations, regardless of being a man or a woman, owning an Apple device, or developing a very positive emotional attachment to the brand are not significant variables that can determine a higher level of recall and recognition. Nevertheless, having a strong background in the technological domain can increase the probability of paying much attention to the details of a technical brand.","authors":["Ioana Iancu","Bogdan Iancu"],"meta":["January 2017","DOI:10.17646/KOME.2017.24"],"references":["271939205_Logo_design_in_marketing_communications_Brand_logo_complexity_moderates_exposure_effects_on_brand_recognition_and_brand_attitude","235718130_Attention_Restores_Discrete_Items_to_Visual_Short-Term_Memory","24099086_Effects_of_Brand_Logo_Complexity_Repetition_and_Spacing_on_Processing_Fluency_and_Judgment","13807835_Gender_Differences_in_Episodic_Memory","6289302_Gender_differences_in_object_location_memory_A_meta-analysis","316021394_The_Paradox_of_Simplicity_Effects_of_Role_on_the_Preference_and_Choice_of_Product_Visual_Simplicity_Level","272835507_The_Apple_of_the_mind's_eye_Everyday_attention_metamemory_and_reconstructive_memory_for_the_Apple_logo","30773337_First_attention_then_intention_-_Insights_from_computational_neuroscience_of_vision","7170923_Gender_differences_in_memory_for_object_and_word_locations"]}