{"id":"322584404_The_Shape_Space_of_3D_Botanical_Tree_Models","abstract":"We propose an algorithm for generating novel 3D tree model variations from existing ones via geometric and structural blending. Our approach is to treat botanical trees as elements of a tree-shape space equipped with a proper metric that quantifies geometric and structural deformations. Geodesics, or shortest paths under the metric, between two points in the tree-shape space correspond to optimal deformations that align one tree onto another, including the possibility of expanding, adding, or removing branches and parts. Central to our approach is a mechanism for computing correspondences between trees that have different structures and a different number of branches. The ability to compute geodesics and their lengths enables us to compute continuous blending between botanical trees, which, in turn, facilitates statistical analysis, such as the computation of averages of tree structures. We show a variety of 3D tree models generated with our approach from 3D trees exhibiting complex geometric and structural differences. We also demonstrate the application of the framework in reflection symmetry analysis and symmetrization of botanical trees.","authors":["Guan Wang","Hamid Laga","Ning Xie","Jinyuan Jia"],"meta":["January 2018ACM Transactions on Graphics 37(1):1-18","DOI:10.1145/3144456"],"references":["317749455_Interactive_Modeling_and_Authoring_of_Climbing_Plants","269031504_Plant_Models_Faithful_to_Botanical_Structure_and_Development","344046236_Digital_Design_of_Nature_Computer_Generated_Plants_and_Organics","317301727_Interactive_Modeling_of_3D_Tree_with_Ball_B-Spline_Curves","314779251_A_probabilistic_model_for_component-based_shape_synthesis","311478440_Creative_Virtual_Tree_Modeling_Through_Hierarchical_Topology-Preserving_Blending","309192228_Numerical_Inversion_of_SRNF_Maps_for_Elastic_Shape_Analysis_of_Genus-Zero_Surfaces","287390345_3D_Tree_Skeletonization_from_Multiple_Images_Based_on_PyrLK_Optical_Flow","283496663_Recent_Trends_Applications_and_Perspectives_in_3D_Shape_Similarity_Assessment","270699725_Capturing_and_Animating_the_Morphogenesis_of_Polygonal_Tree_Models"]}