{"id":"322509128_Proposed_Algorithm_for_Gumbel_Distribution_Estimation","abstract":"Gumbel distribution was dealt with great care by researchers and statisticians. There are traditional methods to estimate Gumbel's two parameters known as Maximum Likelihood, the Method of Moments and recently the method of re-sampling called (Jackknife). However, these methods suffer from some mathematical difficulties in solving them analytically and there is clearly. Accordingly, there are other non-traditional methods, like the principle of the nearest neighbors, used in computer science especially, artificial intelligence algorithms, including the genetic algorithm, the artificial neural network algorithm, and others that may to be meta-heuristic methods. Moreover, this principle of nearest neighbors has useful statistical features. The objective of this paper is thus to propose a new algorithm where it allows getting the estimation of the parameters of Gumbel probability distribution directly. Furthermore, it overcomes the mathematical difficulties in this matter without need to the derivative of the likelihood function. Taking simulation approach under consideration as empirical experiments where a hybrid method performs optimization of these three traditional methods. In this regard, comparisons have been done between the new proposed method and each pair of the traditional methods mentioned above by efficiency criterion (RMSE). As a result, (36) experiments of different combinations of initial values of two parameters (λ: shift parameter and θ: scale parameter) in three values that take four different sample sizes for each experiment. To conclude, the proposed algorithm showed its superiority. In addition, the method of moments was the best in estimating the shift parameter (λ) and the method of maximum likelihood was in estimating the scale parameter (θ).","authors":["Omar Abdulmohsin Ali"],"meta":["December 2017Australian Journal of Basic and Applied Sciences 11(16):15","DOI:10.22587/ajbas.2017.11.16.3","Project: Proposed Semi-Genetic Algorithm in Gumbel distribution Estimation"],"references":["274887821_Estimating_Parameters_of_Gumbel_Distribution_using_the_Methods_of_Moments_probability_weighted_Moments_and_maximum_likelihood","273754860_Linear_Regression_Model_Related_to_Gumbel_Distribution","233921784_Maximum_Likelihood_Parameter_Estimators_for_the_Two_Populations_GEV_Distribution","228686781_Estimating_time_trends_in_Gumbel-distributed_data_by_means_of_generalized_linear_models","26435235_The_construction_of_confidence_intervals_for_frequency_analysis_using_resampling_techniques","286400244_Estimation_of_gumbel_parameters_under_ranked_set_sampling","38358385_Bootstrap_Methods_Another_Look_at_the_Jackknife"]}