{"id":"322543452_Postural_stability_and_simulator_sickness_after_walking_on_a_treadmill_in_a_virtual_environment_with_a_curved_display","abstract":"Virtual environments are a valuable rehabilitation tool that can be used to address unique patient-specific goals; however simulator sickness can cause feelings of discomfort and unwanted side effects that limit the effectiveness of treatment. The purpose of this research was to assess simulator-induced sickness (SIS) symptoms and postural stability before and after 45 minutes of immersion in a virtual environment with a treadmill-motion base and curved display.\nThirty able-bodied Canadian Armed Forces members participated in this study. Symptoms of SIS were evaluated using the Simulator Sickness Questionnaire and postural stability was quantified using centre of pressure data during quiet stance. SIS symptoms and postural stability were evaluated three times throughout the session – at the start of the session, after 15 minutes, and after 45 minutes. Participants reported mild simulator sickness symptoms, including eyestrain, headache, difficulty focusing, and dizziness after immersion in the virtual environment, which was below the acceptable level. Postural instability was greater after 45 minutes in the virtual environment, but did not affect participant’s ability to successfully complete the session. The data reported in this paper provide useful baseline information of a healthy military population for clinical assessments and future studies using a virtual environment with a treadmill-motion base and large curved display.","authors":["E.H. Sinitski","Aidan A Thompson","P. Capt Godsell","J. Lt(N) Honey"],"meta":["January 2018Displays 52","DOI:10.1016/j.displa.2018.01.001"],"references":["270823605_Fixed_and_Self-paced_Treadmill_Walking_for_Able-bodied_and_Transtibial_Amputees_in_a_Multi-terrain_Virtual_Environment","259806383_Effects_of_virtual_environment_platforms_on_emotional_responses","255690481_Walking_in_an_Unstable_Environment_Strategies_Used_by_Transtibial_Amputees_to_Prevent_Falling_During_Gait","225078700_Amplitude_effects_of_medio-lateral_mechanical_and_visual_perturbations_on_gait","49626152_Dynamic_Stability_of_Human_Walking_in_Visually_and_Mechanically_Destabilizing_Environments","43097925_Simulator_sickness_during_driving_simulation_studies","41507687_Research_in_visually_induced_motion_sickness","13192028_Measurement_of_postural_stability_before_and_after_immersion_in_a_virtual_environment","10671289_Assessing_the_driving_performance_of_older_adult_drivers_On-road_versus_simulated_driving","7074819_Motion_sickness_preceded_by_unstable_kinematics_of_the_center_of_pressure"]}