{"id":"322515727_Learning_a_Deep_Single_Image_Contrast_Enhancer_from_Multi-Exposure_Images","abstract":"Due to the poor lighting condition and limited dynamic range of digital imaging devices, the recorded images are often under-/over-exposed and with low contrast. Most of previous single image contrast enhancement (SICE) methods adjust the tone curve to correct the contrast of an input image. Those methods, however, often fail in revealing image details because of the limited information in a single image. On the other hand, the SICE task can be better accomplished if we can learn extra information from appropriately collected training data. In this work, we propose to use the convolutional neural network (CNN) to train a SICE enhancer. One key issue is how to construct a training dataset of low-contrast and high-contrast image pairs for end-to-end CNN learning. To this end, we build a large-scale multi-exposure image dataset, which contains 589 elaborately selected high-resolution multi-exposure sequences with 4,413 images. Thirteen representative multi-exposure image fusion and stack-based high dynamic range imaging algorithms are employed to generate the contrast enhanced images for each sequence, and subjective experiments are conducted to screen the best quality one as the reference image of each scene. With the constructed dataset, a CNN can be easily trained as the SICE enhancer to improve the contrast of an under-/over-exposure image. Experimental results demonstrate the advantages of our method over existing SICE methods with a significant margin.","authors":["Jianrui Cai","Shuhang Gu","Lei Zhang"],"meta":["January 2018IEEE Transactions on Image Processing PP(99):1-1","DOI:10.1109/TIP.2018.2794218"],"references":["321231998_Deep_reverse_tone_mapping","320564412_HDR_image_reconstruction_from_a_single_exposure_using_deep_CNNs","319566093_Multi-scale_exposure_fusion_via_gradient_domain_guided_image_filtering","313873079_Robust_Multi-Exposure_Image_Fusion_A_Structural_Patch_Decomposition_Approach","320971141_Learning_Fully_Convolutional_Networks_for_Iterative_Non-blind_Deconvolution","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770198_Learning_a_Deep_Convolutional_Network_for_Image_Super-Resolution","318611898_Deep_high_dynamic_range_imaging_of_dynamic_scenes","318337546_Deep_Bilateral_Learning_for_Real-Time_Image_Enhancement","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity"]}