{"id":"322535131_Projecting_one's_own_spatial_bias_onto_others_during_a_theory-of-mind_task","abstract":"Many people show a left-right bias in visual processing. We measured spatial bias in neurotypical participants using a variant of the line bisection task. In the same participants, we measured performance in a social cognition task. This theory-of-mind task measured whether each participant had a processing-speed bias toward the right of, or left of, a cartoon agent about which the participant was thinking. Crucially, the cartoon was rotated such that what was left and right with respect to the cartoon was up and down with respect to the participant. Thus, a person's own left-right bias could not align directly onto left and right with respect to the cartoon head. Performance on the two tasks was significantly correlated. People who had a natural bias toward processing their own left side of space were quicker to process how the cartoon might think about objects to the left side of its face, and likewise for a rightward bias. One possible interpretation of these results is that the act of processing one's own personal space shares some of the same underlying mechanisms as the social cognitive act of reconstructing someone else's processing of their space.","authors":["Branden J. Bio","Taylor W. Webb","Michael S A Graziano"],"meta":["January 2018Proceedings of the National Academy of Sciences 115(7):201718493","DOI:10.1073/pnas.1718493115"],"references":["312585771_Measuring_Mindreading_A_Review_of_Behavioral_Approaches_to_Testing_Cognitive_and_Affective_Mental_State_Attribution_in_Neurologically_Typical_Adults","301280198_Topographical_Organization_of_Attentional_Social_and_Memory_Processes_in_the_Human_Temporoparietal_Cortex","260876711_Attributing_awareness_to_oneself_and_to_others","312411857_The_inferior_parietal_lobule_and_temporoparietal_junction_A_network_perspective","310393324_Cortical_Networks_Involved_in_Visual_Awareness_Independently_of_Visual_Attention","304146457_What's_new_in_Psychtoolbox-3","269770893_Hemispatial_Neglect_Clinic_Pathogenesis_and_Treatment","259699961_Representational_Pseudoneglect_A_Review","236068370_Shifting_Attentional_Priorities_Control_of_Spatial_Attention_through_Hemispheric_Competition","227621758_Meta-Analysis_of_Theory-of-Mind_Development_The_Truth_about_False_Belief"]}