{"id":"322647255_A_Natural_Language_Processing_System_That_Links_Medical_Terms_in_Electronic_Health_Record_Notes_to_Lay_Definitions_System_Development_Using_Physician_Reviews","abstract":"Background: \nMany health care systems now allow patients to access their electronic health record (EHR) notes online through patient portals. Medical jargon in EHR notes can confuse patients, which may interfere with potential benefits of patient access to EHR notes.\n\nObjective: \nThe aim of this study was to develop and evaluate the usability and content quality of NoteAid, a Web-based natural language processing system that links medical terms in EHR notes to lay definitions, that is, definitions easily understood by lay people.\n\nMethods: \nNoteAid incorporates two core components: CoDeMed, a lexical resource of lay definitions for medical terms, and MedLink, a computational unit that links medical terms to lay definitions. We developed innovative computational methods, including an adapted distant supervision algorithm to prioritize medical terms important for EHR comprehension to facilitate the effort of building CoDeMed. Ten physician domain experts evaluated the user interface and content quality of NoteAid. The evaluation protocol included a cognitive walkthrough session and a postsession questionnaire. Physician feedback sessions were audio-recorded. We used standard content analysis methods to analyze qualitative data from these sessions.\n\nResults: \nPhysician feedback was mixed. Positive feedback on NoteAid included (1) Easy to use, (2) Good visual display, (3) Satisfactory system speed, and (4) Adequate lay definitions. Opportunities for improvement arising from evaluation sessions and feedback included (1) improving the display of definitions for partially matched terms, (2) including more medical terms in CoDeMed, (3) improving the handling of terms whose definitions vary depending on different contexts, and (4) standardizing the scope of definitions for medicines. On the basis of these results, we have improved NoteAid's user interface and a number of definitions, and added 4502 more definitions in CoDeMed.\n\nConclusions: \nPhysician evaluation yielded useful feedback for content validation and refinement of this innovative tool that has the potential to improve patient EHR comprehension and experience using patient portals. Future ongoing work will develop algorithms to handle ambiguous medical terms and test and evaluate NoteAid with patients.","authors":["Jinying Chen","Emily Druhl","Balaji Polepalli Ramesh","Thomas K Houston"],"meta":["January 2018Journal of Medical Internet Research 20(1):e26","DOI:10.2196/jmir.8669"],"references":["320745522_Ranking_Medical_Terms_to_Support_Expansion_of_Lay_Language_Resources_for_Patient_Comprehension_of_Electronic_Health_Record_Notes_Adapted_Distant_Supervision_Approach","316643585_Trust_and_credibility_in_online_health_information_a_review_and_agenda_for_future_research","301449060_Mining_and_Ranking_Biomedical_Synonym_Candidates_from_Wikipedia","280448142_Ease_of_Adoption_of_Clinical_Natural_Language_Processing_Software_An_Evaluation_of_Five_Systems","279306517_Patient_Portals_and_Patient_Engagement_A_State_of_the_Science_Review","308355409_Three_approaches_to_content_analysis","302972209_A_randomised_crossover_trial_of_minimising_medical_terminology_in_secondary_care_correspondence_in_patients_with_chronic_health_conditions_impact_on_understanding_and_patient_reported_outcomes_Minimis","293263529_Evaluating_Patient_Access_to_Electronic_Health_Records_Results_From_a_Survey_of_Veterans","285627423_Barriers_and_Facilitators_to_Online_Portal_Use_Among_Patients_and_Caregivers_in_a_Safety_Net_Health_Care_System_A_Qualitative_Study","277424099_Health_Information_on_the_Internet"]}