{"id":"322610532_The_Game_Making_Framework_for_Collaborative_Learning","abstract":"Collaborative learning is a study group process that each member contributes their idea, information, experience, skill, and ability they have so it can be used on learning activity and improve members’ knowledge[1]. Digital game can become one of collaborative learning media that is not just for entertainment but also can be used as a unique and effective interactive learning media[2]. In conventional game making for collaborative learning, the research proves that it can improve excitement and contribution in learning activities[3]. But in game making, there are many technical issues for non-computer science students[3]. Based on many issues, designing framework is chosen to become a solution to help people in developing game as collaborative learning media by themselves. Because framework is a basic form of system [4], consist of various command, function, and benefit for developer in application development [5][6], so game making for collaborative learning is conducted again with support from framework designed by researcher. In order to know the effect from framework support in game making as collaborative learning media, this study is based on two subjects of non-computer science students and computer science students.","authors":["Aprilia Christanti","Ridwan Sanjaya","Erdhi widyarto Nugroho"],"meta":["January 2018SISFORMA 4(2):43","DOI:10.24167/sisforma.v4i2.1295"],"references":["323510688_penerapan_metode_collaborative_learning_untuk_meningkatkan_pemahaman_materi_kuliah_metodologi_penelitian","242282475_What_is_Collaborative_Learning","286029916_A_Meta-Analytic_Review_of_Studies_of_the_Effectiveness_of_Small-Group_Learning_Methods_on_Statistics_Achievement","285873028_Constructing_knowledge_together","273883554_Teaching_Methods_and_Learning_Preferences_in_the_Engineering_Department_of_an_Asian_University","265773678_Object-oriented_application_frameworks","233854028_Online_Computer_Games_as_Collaborative_Learning_Environments_Prospects_and_Challenges_for_Tertiary_Education"]}