{"id":"322674661_SIR_Coverage_Analysis_in_Cellular_Networks_with_Temporal_Traffic_A_Stochastic_Geometry_Approach","abstract":"The bloom in mobile applications not just bring in enjoyment to daily life, but also imposes more\ncomplicated traffic situation on wireless network. A complete understanding of the impact from traffic\nprofile is thus essential for network operators to respond adequately to the surge in data traffic. In\nthis paper, based on stochastic geometry and queuing theory, we develop a mathematical framework\nthat captures the interplay between the spatial location of base stations (BSs), which determines the\nmagnitude of mutual interference, and their temporal traffic dynamic. We derive a tractable expression\nfor the SIR distribution, and verify its accuracy via simulations. Based on our analysis, we find that i)\nunder the same configuration, when traffic condition changes from light to heavy, the corresponding SIR\nrequirement can differ by more than 10 dB for the network to maintain coverage, ii) the SIR coverage\nprobability varies largely with traffic fluctuation in the sub-medium load regime, whereas in scenario\nwith very light traffic load, the SIR outage probability increases linearly with the packet arrival rate,\niii) the mean delay, as well as coverage probability of cell edge user equipments (UEs) are vulnerable\nto the traffic fluctuation, thus confirms its appeal for traffic-aware communication technology.","authors":["Howard H. Yang","Tony Q.S. Quek"],"meta":["July 2018IEEE Transactions on Wireless Communications","Project: Traffic and Backhaul in Ultra-Dense Small Cell Networks with Edge Computing"],"references":["321638086_An_Analytical_Model_for_Flow-Level_Performance_in_Heterogeneous_Wireless_Networks","315794678_Packet_Throughput_Analysis_of_Static_and_Dynamic_TDD_in_Small_Cell_Networks","311430613_Towards_a_Tractable_Delay_Analysis_in_Large_Wireless_Networks","308947991_A_Comprehensive_Analysis_of_5G_Heterogeneous_Cellular_Systems_operating_over_kappa-mu_Shadowed_Fading_Channels","308321258_Spatiotemporal_Stochastic_Modeling_of_IoT_Enabled_Cellular_Networks_Scalability_and_Stability_Analysis","301876927_Modeling_and_Analysis_of_Cellular_Networks_Using_Stochastic_Geometry_A_Tutorial","310953057_Heterogeneous_Cellular_Networks_With_Spatio-Temporal_Traffic_Delay_Analysis_and_Scheduling","308744412_Unified_Stochastic_Geometry_Modeling_and_Analysis_of_Cellular_Networks_in_LOSNLOS_and_Shadowed_Fading","301876267_The_Intensity_Matching_Approach_A_Tractable_Stochastic_Geometry_Approximation_to_System-Level_Analysis_of_Cellular_Networks","301701558_Cell-Edge-Aware_Precoding_for_Downlink_Massive_MIMO_Cellular_Networks"]}