{"id":"322642930_IMPLEMENTASI_TEKNIK_DYNAMIC_TIME_WARPING_DTW_PADA_APLIKASI_SPEECH_TO_TEXT","abstract":"ABSTRAK Suara/ucapan adalah salah satu cara kita sebagai manusia untuk berkomunikasi dan mengekspresikan diri. Speech to text (ucapan ke text), merupakan salah satu bidang sains computer yaitu bidang pengolahan suara. Speech to text (STT) adalah penerjemahan kalimat (kata yang diucapkan) ke dalam text. STT merupakan proses pengolahan suatu sinyal suara, mengekstrak fitur dari sinyal suara tersebut yang selanjutkan dibandingkan dengan hasil ekstraksi dari sinyal suara yang lain untuk dapat dikenali persamaannya. Penelitian ini merancang dan membangun suatu program aplikasi Speech to Text yang mampu identifikasi suatu sinyal suara menggunakan perangkat lunak simulasi MATLAB R2016a. Terdapat dua proses umum pada bidang pengolahan suara, yaitu ekstraksi fitur dan pencocokan fitur. Pada sistem ini metode mel-frequency cepstral coefficients digunakan untuk mengekstraksi fitur dan metode dynamic time warping digunakan untuk pencocokan fitur. Metode DTW yang digunakan dapat menghitung jarak atau selisih antara dua data yang dibandingkan. Rata-rata akurasi yang didapat setelah dilakukan percobaan pada pengujian kata adalah 95.85% dan pada pengujian kalimat adalah 94%. ABSTRACT Voice / speech is one of the ways we as human beings to communicate and express themselves. Speech to text (STT), is one of computer science is the field of sound processing. Speech to text (STT) is the translation of the sentence (the spoken word) in the text. STT is a voice signal processing, extracting features from the speech signal and then compared it with the extraction of the other sound signal to recognize the signal similarities. This research design and build an application program Speech to Text that is capable of identifying a sound signal using simulation software MATLAB R2016a. There are two common processes in the field of sound processing, feature extraction and matching features. In this system, the method mel-frequency cepstral coefficients are used to extract features and dynamic time warping method used for matching features. DTW method used can calculate the distance or the difference between the two data being compared. The average accuracy is obtained after experiments on the test word was 95.85% and the testing of the sentence is 94%. How to Cite : Dinata, C. Puspitaningrum, D. Erna, E. (2017). IMPLEMENTASI TEKNIK DYNAMIC TIME WARPING (DTW) PADA APLIKASI SPEECH TO TEXT. Jurnal Teknik Informatika, 10(1), 49-58. doi:10.15408/jti.v10i1.6816 Permalink/DOI: http://dx.doi.org/10.15408/jti.v10i1.6816","authors":["Candra Dinata","Diyah Puspitaningrum","Ernawati Erna"],"meta":["January 2018","DOI:10.15408/jti.v10i1.6816"],"references":["263358996_An_Efficient_Speech_Recognition_System","309614028_Gesture_and_voice_control_of_Internet_of_Things","240418268_Analyzing_Discontinuous_Speech_in_EU_Conversations_A_Methodological_Proposal","230584985_The_Scientist_Engineer's_Guide_to_Digital_Signal_Processing"]}