{"id":"322602560_Sliding_to_predict_vision-based_beating_heart_motion_estimation_by_modeling_temporal_interactions","abstract":"Purpose: \nTechnical advancements have been part of modern medical solutions as they promote better surgical alternatives that serve to the benefit of patients. Particularly with cardiovascular surgeries, robotic surgical systems enable surgeons to perform delicate procedures on a beating heart, avoiding the complications of cardiac arrest. This advantage comes with the price of having to deal with a dynamic target which presents technical challenges for the surgical system. In this work, we propose a solution for cardiac motion estimation.\n\nMethods: \nOur estimation approach uses a variational framework that guarantees preservation of the complex anatomy of the heart. An advantage of our approach is that it takes into account different disturbances, such as specular reflections and occlusion events. This is achieved by performing a preprocessing step that eliminates the specular highlights and a predicting step, based on a conditional restricted Boltzmann machine, that recovers missing information caused by partial occlusions.\n\nResults: \nWe carried out exhaustive experimentations on two datasets, one from a phantom and the other from an in vivo procedure. The results show that our visual approach reaches an average minima in the order of magnitude of [Formula: see text] while preserving the heart's anatomical structure and providing stable values for the Jacobian determinant ranging from 0.917 to 1.015. We also show that our specular elimination approach reaches an accuracy of 99% compared to a ground truth. In terms of prediction, our approach compared favorably against two well-known predictors, NARX and EKF, giving the lowest average RMSE of 0.071.\n\nConclusion: \nOur approach avoids the risks of using mechanical stabilizers and can also be effective for acquiring the motion of organs other than the heart, such as the lung or other deformable objects.","authors":["Angelica I. Aviles-Rivero","Samar Alsaleh","Alicia Casals"],"meta":["January 2018International Journal of Computer Assisted Radiology and Surgery 13(10)","DOI:10.1007/s11548-018-1702-1"],"references":["308129582_Motion_Prediction_via_Online_Instantaneous_Frequency_Estimation_for_Vision-based_Beating_Heart_Tracking","295503209_Minimally_invasive_direct_coronary_artery_bypass_grafting_with_an_improved_rib_spreader_and_a_new-shaped_cardiac_stabilizer_Results_of_200_consecutive_cases_in_a_single_institution","262266938_3D_soft-tissue_tracking_using_spatial-color_joint_probability_distribution_and_thin-plate_spline_model","260330782_A_Quasi-Spherical_Triangle-Based_Approach_for_Efficient_3-D_Soft-Tissue_Motion_Tracking","312676193_The_state_of_robotic_cardiac_surgery_in_Europe","309338166_Adaptive_segmentation_and_mask-specific_Sobolev_inpainting_of_specular_highlights_for_endoscopic_images","309326617_Towards_estimating_cardiac_motion_using_low-rank_representation_and_topology_preservation_for_ultrafast_ultrasound_data","304109482_Training_products_of_experts_by_minimizing_contrastive_divergence","294284348_Beating_Heart_Surgery_Comparison_of_Two_Active_Compensation_Solutions_for_Minimally_Invasive_Coronary_Artery_Bypass_Grafting","294284333_Overview_of_General_Advantages_Limitations_and_Strategies"]}