{"id":"322692071_An_Ontology-Based_Knowledge_Modelling_for_a_Sustainability_Assessment_Domain","abstract":"Sustainability assessment has received more and more attention from researchers and it offers a large number of opportunities to measure and evaluate the level of its accomplishment. However, proper selection of a particular sustainability assessment approach, reflecting problem properties and the evaluator’s preferences, is a complex and important issue. Due to an existing number of different approaches dedicated to assessing, supporting, or measuring the level of sustainability and their structure oriented on the particular domain usage, problems with accurate matching frequently occur. On the other hand, the efficiency of sustainability assessment depends on the available knowledge of the ongoing capabilities. Additionally, actual research trends confirm that knowledge engineering gives a method to handle domain knowledge practically and effectively. Unfortunately, literature studies confirm that there is a lack of knowledge systematization in the sustainability assessment domain, however. The practical application of knowledge-based mechanisms may cover this gap. In this paper, we provide formal, practical and technological guidance to a knowledge management-based approach to sustainability assessment. We propose ontology as a form of knowledge conceptualization and using knowledge engineering, we make gathered knowledge publicly available and reusable, especially in terms of interoperability of collected knowledge.","authors":["Agnieszka Konys"],"meta":["January 2018Sustainability 10(2):300","DOI:10.3390/su10020300"],"references":["320789134_Using_the_PROSA_Method_in_Offshore_Wind_Farm_Location_Problems","319605514_A_Tailored_Ontology_Supporting_Sensor_Implementation_for_the_Maintenance_of_Industrial_Machines","314198523_Knowledge_Management_in_Startups_Systematic_Literature_Review_and_Future_Research_Agenda","313817068_Integrated_Supplier_Selection_Framework_in_a_Resilient_Construction_Supply_Chain_An_Approach_via_Analytic_Hierarchy_Process_AHP_and_Grey_Relational_Analysis_GRA","312276772_Entropic_Citizenship_Behavior_and_Sustainability_in_Urban_Organizations_Towards_a_Theoretical_Model","309417857_2016_Environmental_Performance_Index_EPI","309027108_Factors_Influencing_Sustainable_Entrepreneurship_in_Small_and_Medium-Sized_Enterprises_in_Iran_A_Case_Study_of_Food_Industry","321605301_In_Search_of_Indicators_of_Sustainable_Development","319395635_The_Description_Logic_Handbook_Theory_Implementation_and_Applications","319393397_Towards_a_Methodology_for_Building_Ontologies"]}