{"id":"322696215_Classification_Algorithms_for_Determining_Handwritten_Digit","abstract":"Data-intensive science is a critical science paradigm that interferes with all other sciences. Data mining (DM) is a powerful and useful technology with wide potential users focusing on important meaningful patterns and discovers a new knowledge from a collected dataset. Any predictive task in DM uses some attribute to classify an unknown class. Classification algorithms are a class of prominent mathematical techniques in DM. Constructing a model is the core aspect of such algorithms. However, their performance highly depends on the algorithm behavior upon manipulating data. Focusing on binarazaition as an approach for preprocessing, this paper analysis and evaluates different classification algorithms when construct a model based on accuracy in the classification task. The Mixed National\nInstitute of Standards and Technology (MNIST) handwritten digits dataset provided by Yann LeCun has been used in evaluation. The paper focuses on machine learning approaches for handwritten digits detection. Machine learning establishes classification methods, such as K-Nearest Neighbor(KNN), Decision Tree (DT), and Neural Networks (NN). Results showed that the knowledge-based method, i.e. NN algorithm, is more accurate in determining the digits as it reduces the error rate. The implication of this evaluation is providing essential insights for computer scientists and practitioners for choosing the suitable DM technique that fit with their data.","authors":["Hayder Naser Khraibet Al-Behadili"],"meta":["January 2018Iraqi Journal for Electrical And Electronic Engineering 12(1)","DOI:10.33762/eeej.2016.110679"],"references":["227869132_Handwriting_development_competency_and_intervention","222834590_Handwritten_digit_recognition_Benchmarking_of_state-of-the-art_techniques","221900777_The_WEKA_data_mining_software_An_update","3684535_Comparison_of_classifier_methods_a_case_study_in_handwritten_digit_recognition","292215554_Data-Intensive_Computing_in_the_21st_Century","242919078_Handwritten_Digit_Recognition_Using_K_Nearest-Neighbor_Radial-Basis_Function_and_Backpropagation_Neural_Networks","222455722_Convexity_analysis_of_active_contour_problems","222422286_Improved_method_of_handwritten_digit_recognition_tested_on_MNIST_database","220520188_Mining_knowledge_from_text_using_information_extraction"]}