{"id":"322679001_Visual_Exploration_and_Analysis_of_Multi-subject_Correlation_of_Student_Performance_in_College_Courses","abstract":"In-depth analysis of student performance in college courses and its influence factors is significant to curriculum arrangement optimization and teaching quality improvement. However, it is challenging due to the complicated student score data which contains multiple relevant subjects and has characteristics like multivariate, multi-attribute and time-related. Traditional analysis tools and display methods are limited when exploring association and anomalies in curriculum performance. In this paper, according to the characteristics of student score data, we design a student performance visual analysis system called SPVAS, which consists of multiple coordinated views. Firstly, to explore the temporal distribution, variation patterns of student performance in different grades and semesters are discovered using heat-map matrix integrated with multi-attribute. Then, by extending interaction and demonstration ability of the parallel coordinates, multiple statistical characteristics of student performance and its correlative subjects such as courses and teachers can be presented. Finally, the correlation among courses and influence factors of student performance are revealed through novel layouts of combinations of arc diagram with both parallel coordinates and node-link diagram. With interaction techniques like cross filters and dynamic association in multiple views applying on the novel layouts, cross analysis and coherent inference from any aspects of course, student and teacher are achieved. To test the effectiveness and usefulness of SPVAS, a real dataset is adapted in a case study, and domain experts are involved during the process of test and evaluation. © 2018, Beijing China Science Journal Publishing Co. Ltd. All right reserved.","authors":["Lianen Ji","Fang Gao","Kaihong Huang","Zongyan Chen"],"meta":["January 2018Jisuanji Fuzhu Sheji Yu Tuxingxue Xuebao/Journal of Computer-Aided Design and Computer Graphics 30(1):44","DOI:10.3724/SP.J.1089.2018.16924"],"references":[]}