{"id":"322606752_Global_trends_in_research_related_to_social_media_in_psychology_Mapping_and_bibliometric_analysis","abstract":"Background\nSocial media, defined as interactive Web applications, have been on the rise globally, particularly among adults. The objective of this study was to investigate the trend of the literature related to the most used social network worldwide (i.e. Facebook, Twitter, LinkedIn, Snapchat, and Instagram) in the field of psychology. Specifically, this study will assess the growth in publications, citation analysis, international collaboration, author productivity, emerging topics and the mapping of frequent terms in publications pertaining to social media in the field of psychology. Methods\nPublications related to social media in the field of psychology published between 2004 and 2014 were obtained from the Web of Science. The records extracted were analysed for bibliometric characteristics such as the growth in publications, citation analysis, international collaboration, emerging topics and the mapping of frequent terms in publications pertaining to social media in the field of psychology. VOSviewer v.1.6.5 was used to construct scientific maps. ResultsOverall, 959 publications were retrieved during the period between 2004 and 2015. The number of research publications in social media in the field of psychology showed a steady upward growth. Publications from the USA accounted for 57.14% of the total publications and the highest h-index (48).The most common document type was research articles (873; 91.03%). Over 99.06% of the publications were published in English. Computers in Human Behavior was the most prolific journal. The University of Wisconsin–Madison ranked first in terms of the total publications (n = 39). A visualisation analysis showed that personality psychology, experimental psychology, psychological risk factors, and developmental psychology were continual concerns of the research. Conclusions\nThis is the first study reporting the global trends in the research related to social media in the psychology field. Based on the raw data from the Web of Science, publication characteristics such as quality and quantity were assessed using bibliometric techniques over 12 years. The USA and its institutions play a dominant role in this topic. The most preferred topics related to social media in psychology are personality psychology, experimental psychology, psychological risk factors, and developmental psychology.","authors":["Sa'ed H Zyoud","Prof. Waleed Sweileh","Rahmat Awang","Samah Al-Jabi"],"meta":["January 2018International Journal of Mental Health Systems 12(1)","DOI:10.1186/s13033-018-0182-6"],"references":["312399381_Ovarian_cancer_Density_equalizing_mapping_of_the_global_research_architecture","312271321_Bibliometric_analysis_of_worldwide_publications_on_multi-_extensively_and_totally_drug_-_resistant_tuberculosis_2006-2015","312180491_Pulmonary_Hypertension_Scientometric_Analysis_and_Density-Equalizing_Mapping","311867177_Research_on_Social_Networking_Sites_and_Social_Support_from_2004_to_2015_A_Narrative_Review_and_Directions_for_Future_Research","309430505_Mapping_cross-border_collaboration_and_communication_in_cardiovascular_research_from_1992_to_2012","303853270_Global_research_trends_of_Middle_East_respiratory_syndrome_coronavirus_A_bibliometric_analysis","302922447_Trends_in_Pleural_Effusion_Research_A_Bibliometric_Analysis_From_the_Scopus_Database","302066549_Dengue_research_A_bibliometric_analysis_of_worldwide_and_Arab_publications_during_1872-2015","338505419_Bibliometric_analysis_of_worldwide_publications_on_multi-_extensively_and_totally_drug_-_resistant_tuberculosis_2006-2015","309965391_Global_research_production_in_glyphosate_intoxication_from_1978_to_2015_A_bibliometric_analysis"]}