{"id":"322665831_A_pragmatic_analysis_of_MA_thesis_acknowledgements","abstract":"Most studies on gratitude have focused on spoken interaction. Less attention has been paid to written thanking expressions. From a pragmatic perspective, the present study explores the use of\nthanking strategies for different addressees in 20 MA thesis acknowledgements. Results reveal that explicit thanking strategies (using overt thanking words) are by far more frequently used than\nimplicit thanking strategies (using no overt thanking words). The most common explicit thanking strategy is thanking + addressees + reasons (favor or positive feelings). Moreover, the choice of strategies varies, depending mainly upon the nature and importance of the assistance or support the addressees have provided. Simple thanking strategies occur much more frequently than complex thanking strategies. A small number of recurrent thanking words and formulaic and personalized structures feature the linguistic realization of this conventionalized part genre. The addressees in thesis acknowledgements include six categories: advisors, committee members, other faculty members, participants, classmates/friends, and family members, arranged in descending order of frequency. Among them, advisors are invariably thanked first, and complex thanking strategies are usually employed to elaborate on their specific assistance. These results signify thesis acknowledgements as the socio-pragmatic embodiment of the graduates’ professional as well as\ninterpersonal supporting networks.","authors":["Stephanie W. Cheng","Louis Kuo"],"meta":["January 2011"],"references":["349688286_Poison_to_Your_Soul_Thanks_and_Apologies_Contrastively_Viewed","348864049_The_Art_of_Action_Research_in_the_Classroom","345850175_English_in_Today's_Research_World_A_Writing_Guide","344622862_Needs_assessment_in_language_programming_from_theory_to_practice","317953471_Qualitative_Research_and_Case_Study_Applications_In_Education","317953395_Qualitative_research_and_evaluation_methods","313555958_Lexical_bundles_in_conversation_and_academic_prose","313208344_The_Nature_of_English_for_Specific_Purposes","313148432_DES-IMPL-EVALU-IGN_An_evaluator's_checklist","313085318_Data_collection_in_pragmatics_research","312453386_Expressing_gratitude_in_american_english","303201880_Overview_A_rationale_for_needs_analysis_and_needs_analysis_research","303197340_The_role_of_needs_analysis_in_adult_ESL_programme_design","290843008_5_Using_a_small_corpus_to_obtain_data_for_teaching_a_genre","290488199_An_ESP_program_for_international_medical_graduates_in_residency"]}