{"id":"322646099_Significantly_Fast_and_Robust_Fuzzy_C-Means_Clustering_Algorithm_Based_on_Morphological_Reconstruction_and_Membership_Filtering","abstract":"As fuzzy c-means clustering (FCM) algorithm is sensitive to noise, local spatial information is often introduced to an objective function to improve the robustness of the FCM algorithm for image segmentation. However, the introduction of local spatial information normally leads to a high computational complexity, arising out of an iterative calculation of the distance between the spatial neighbors of pixels and clustering centers. To address this issue, an improved FCM algorithm based on morphological reconstruction and membership filtering (FRFCM) that is significantly faster and more robust than FCM, is proposed in this paper. Firstly, the local spatial information of images is incorporated into our FRFCM by introducing morphological reconstruction operation to guarantee noise-immunity and image detail-preservation. Secondly, the modification of a pixel's membership, based on the distance between the spatial neighbors of the pixel and clustering centers, is replaced by local membership filtering that depends only on the spatial neighbors of the pixel's membership. Compared to state-of-the-art algorithms, the proposed FRFCM algorithm is simpler and significantly faster since it is unnecessary to compute the distance between the neighbors of pixels and clustering centers. In addition, it is efficient for noisy image segmentation because spatial filters are able to improve pixels' membership efficiently. Experiments performed on synthetic and real-world images demonstrate that the proposed algorithm not only achieves better results, but also requires less time than state-of-the-art algorithms for image segmentation.","authors":["Tao Lei","Xiaohong Jia","Yanning Zhang","Lifeng He"],"meta":["January 2018IEEE Transactions on Fuzzy Systems PP(99):1-1","DOI:10.1109/TFUZZ.2018.2796074","Projects: Image segmentationmultivariate morphological watershed theory and its applications in multi-channel image processing"],"references":["317083801_Affinity_learning_via_self-diffusion_for_image_segmentation_and_clustering","312928939_Bounded_Self-Weights_Estimation_Method_for_Non-Local_Means_Image_Denoising_Using_Minimax_Estimators","312103026_A_Conditionally_Invariant_Mathematical_Morphological_Framework_for_Color_Images","309470020_Graph-Driven_Diffusion_and_Random_Walk_Schemes_for_Image_Segmentation","308860702_Semi-Supervised_Learning_And_Graph_Cuts_For_Consensus_Based_Medical_Image_Segmentation","308827597_Superpixel_segmentation_using_Linear_Spectral_Clustering","292773066_Mean_shift_towards_feature_space_analysis","292074151_Adaptive_fuzzy_c-means_algorithm_based_on_local_noise_detecting_for_image_segmentation","285630251_Nonparametric_Statistical_Active_Contour_Based_on_Inclusion_Degree_of_Fuzzy_Sets","284274252_Multi-Scale_Opening_of_Conjoined_Fuzzy_Objects_Theory_and_Applications"]}