{"id":"322645201_A_mereotopology_based_on_sequent_algebras","abstract":"Mereotopology is an extension of mereology with some relations of topological nature like contact. An algebraic counterpart of mereotopology is the notion of contact algebra which is a Boolean algebra whose elements are considered to denote spatial regions, extended with a binary relation of contact between regions. Although the language of contact algebra is quite expressive to define many useful mereological relations (part-of, overlap, underlap) and mereotopological relations (external contact, tangential part-of, non-tangential part-of, self-connectedness), there are, however, some interesting mereotopological relations which are not definable in it. Such are, for instance, the relation of n-ary contact, internal connectedness and some others. To overcome this disadvantage, we introduce a generalisation of contact algebra, replacing the contact with a binary relation between finite sets of regions and a region, satisfying some formal properties of Tarski consequence relation. The obtained system is called sequent algebra, considered as an algebraic counterpart of a new mereotopology. We develop the topological representation theory for sequent algebras showing in this way certain correspondence between point-free and point-based models of space. As a by-product, we show how one logical relation in nature notion, Tarski consequence relation, may have also certain spatial (mereotopological) meaning.","authors":["Dimiter Vakarelov"],"meta":["January 2018Journal of Applied Non-Classical Logics 27(1):1-23","DOI:10.1080/11663081.2017.1420590"],"references":["330422421_Contact_Algebras_and_Region-based_Theory_of_Space_Proximity_Approach-II","268365827_Qualitative_Spatio-_Temporal_Representation_and_Reasoning_Trends_and_Future_Directions","235171825_Semantic_Domains_and_Denotational_Semantics","233419687_Region-Based_Theories_of_Space_Mereotopology_and_Beyond","324357738_Parts_A_Study_in_Ontology","321610413_Logic_of_Domains","314439410_Mereocompactness_and_Duality_for_Mereotopological_Spaces","281704142_Information_Systems_Similarity_Relations_and_Modal_Logics","251470850_Chapter_13_Qualitative_Spatial_Representation_and_Reasoning","226673421_Axioms_Algebras_and_Topology"]}