{"id":"322605090_Discovery_of_cell-type_specific_DNA_motif_grammar_in_cis-regulatory_elements_using_random_Forest","abstract":"Background\nIt has been observed that many transcription factors (TFs) can bind to different genomic loci depending on the cell type in which a TF is expressed in, even though the individual TF usually binds to the same core motif in different cell types. How a TF can bind to the genome in such a highly cell-type specific manner, is a critical research question. One hypothesis is that a TF requires co-binding of different TFs in different cell types. If this is the case, it may be possible to observe different combinations of TF motifs – a motif grammar – located at the TF binding sites in different cell types. In this study, we develop a bioinformatics method to systematically identify DNA motifs in TF binding sites across multiple cell types based on published ChIP-seq data, and address two questions: (1) can we build a machine learning classifier to predict cell-type specificity based on motif combinations alone, and (2) can we extract meaningful cell-type specific motif grammars from this classifier model. ResultsWe present a Random Forest (RF) based approach to build a multi-class classifier to predict the cell-type specificity of a TF binding site given its motif content. We applied this RF classifier to two published ChIP-seq datasets of TF (TCF7L2 and MAX) across multiple cell types. Using cross-validation, we show that motif combinations alone are indeed predictive of cell types. Furthermore, we present a rule mining approach to extract the most discriminatory rules in the RF classifier, thus allowing us to discover the underlying cell-type specific motif grammar. Conclusions\nOur bioinformatics analysis supports the hypothesis that combinatorial TF motif patterns are cell-type specific.","authors":["Xin Wang","Peijie Lin","Joshua W. K. Ho"],"meta":["January 2018BMC Genomics 19(1):929","DOI:10.1186/s12864-017-4340-z"],"references":["312284251_Modular_combinatorial_binding_among_human_trans-acting_factors_reveals_direct_and_indirect_factor_binding","301314936_DNA_context_represents_transcription_regulation_of_the_gene_in_mouse_embryonic_stem_cells","299361245_Role_of_estrogen_receptor_in_breast_cancer_cell_gene_expression","280496611_Predicting_the_sequence_specificities_of_DNA-_and_RNA-binding_proteins_by_deep_learning","272742180_Rule_Extraction_from_Random_Forest_the_RFHC_Methods","317066382_Rule-based_design_of_synthetic_transcription_factors_in_eukaryotes","312957069_Newer_Laws_Give_Media_Means_to_'SLAPP'_Back_in_Libel_Suits","309075304_ENCODE_Project_Consortium_An_integrated_encyclopedia_of_DNA_elements_in_the_human_genome","283075873_An_integrated_encyclopedia_of_DNA_elements_in_the_human_genome","272835979_Regulation_and_function_of_the_NFE2_transcription_factor_in_hematopoietic_and_non-hematopoietic_cells","272515489_Transcription_factor_binding_dynamics_during_human_ES_cell_differentiation","265052539_Interpreting_Tree_Ensembles_with_inTrees","262536763_A_Single_Amino_Acid_in_EBNA-2_Determines_Superior_B_Lymphoblastoid_Cell_Line_Growth_Maintenance_by_Epstein-Barr_Virus_Type_1_EBNA-2","259918210_Alternative_human_liver_transcripts_of_TCF7L2_bind_to_the_gluconeogenesis_regulator_HNF4a_at_the_protein_level","260528552_MYC_MAX_and_small_cell_lung_cancer"]}