{"id":"322684103_Efficient_Use_of_Information_and_Social_Value_of_Information","abstract":"This paper analyzes equilibrium and welfare for a tractable class of economies (games) that have externalities, strategic complementarity or substitutability, and heterogeneous information. First, we characterize the equilibrium use of information: complementarity heightens the sensitivity of equilibrium actions to public information, raising aggregate volatility, whereas substitutability heightens the sensitivity to private information, raising cross-sectional dispersion. Next, we define and characterize an efficiency benchmark designed to address whether the equilibrium use of information is optimal from a social perspective; the efficient use of information reflects the social value of aligning choices across agents. Finally, we examine the comparative statics of equilibrium welfare with respect to the information structure; the social value of information is best understood by classifying economies according to the inefficiency, if any, in the equilibrium use of information. We conclude with a few applications, including production externalities, beauty contests, business cycles, and large Cournot and Bertrand games.\nKEYWORDS: Incomplete information, coordination, complementarities, externalities, amplification, efficiency.","authors":["George-Marios Angeletos","Alessandro Pavan"],"meta":["July 2007"],"references":["24091154_Coordinating_Coordination_Failures_in_Keynesian_Models","313475320_The_Private_And_Social_Value_of_Information_And_The_Reward_To_Inventive_Activity","286546871_Rules_vs_Discretion_after_Twenty-Five_Years","265642801_The_Use_of_Knowledge_in_Society","258229222_Team_Decision_Problems","252751245_Informational_and_Economic_Efficiency_in_REE_with_Asymmetric_Information","246366318_Heterogeneous_Information_and_the_Benefits_of_Public_Information_Disclosures","228771151_Imperfect_information_consumers'_expectations_and_business_cycles","222450550_Duopoly_information_equilibrium_Cournot_and_Bertrand","46433418_Transparency_and_Monetary_Policy_with_Imperfect_Common_Knowledge"]}