{"id":"322680683_Does_the_national_innovation_system_spur_economic_growth_in_Brazil_Russia_India_China_and_South_Africa_economies_Evidence_from_panel_data","abstract":"p> The question as to whether the national innovation system (NIS) plays a significant positive role in influencing economic growth has been intensely debated by academics as well as policy analysts. The main controversy, however, is the fact that the ongoing empirical evidences on the relationship between innovation and economic growth are still mixed. The aim of this paper is to provide further evidence on the relationship between the NIS and economic growth using consistent and reliable data from a sample of emerging economies (Brazil, Russia, India, China and South Africa [BRICS]). The research has a BRICS focus and constructs NIS using historical panel data set for the main variables, that is, university enrolment rate for science and engineering students, government research and development expenditure, high-tech export and the enclosure of control variables covering the period 2000Q1–2013Q4. The study employed a dynamic panel estimation technique with a view of evaluating the relative impact of the NIS on economic growth in BRICS. The results revealed that the NIS as a whole has a positive effect on economic growth in BRICS economies. An important policy implication emerging from this study is that extra efforts are needed by emerging economies to promote the development of a NIS so as to explore the potential growth-inducing effects of a well-functioning NIS. Consequently, findings from this study have offered some persuading indicators for BRICS economies to explore the development of a NIS as a potential opportunity to speed up their economic growth. </p","authors":["Brima Sesay","Zhao Yulin","Fang Wang"],"meta":["January 2018South African Journal of Economic and Management Sciences (SAJEMS) 21(1):12","DOI:10.4102/sajems.v21i1.1647"],"references":["271028862_Nano-economics_in_a_National_System_of_Innovation","312992058_Distribution_of_the_estimators_for_autoregressive_time_series_with_a_unit_root","292741506_Some_Tests_of_Specification_for_Panel_Data_Monte_Carlo_Evidence_and_an_Application_to_Employment_Equations","283409724_Testing_for_Unit_Roots_in_Heterogeneous_Panels","280698425_The_patent_paradox_revisited_An_empirical_study_of_patenting_in_the_US_semiconductor_industry_1979-1995","271517443_The_Competitive_Advantage_Of_Nations","270407796_Endogenous_Growth_Theory","263252227_Initial_conditions_and_moment_restrictions_in_dynamic_panel_data_models_-_Monte_Carlo_evidence_and_an_application_to_employment_equations","260383564_RD_Innovation_and_Technological_Progress_A_Test_of_the_Schumpeterian_Framework_Without_Scale_Effects","258260630_Technological_Systems_and_Economic_Performance_The_Case_of_Factory_Automation"]}