{"id":"322710351_The_integration_of_economic_history_into_economics","abstract":"In the USA today the academic field of economic history is much closer to economics than it is to history in terms of professional behavior, a stylized fact that I call the “integration of economic history into economics.” I document this using two types of evidence—use of econometric language in articles appearing in academic journals of economic history and economics; and publication histories of successive cohorts of Ph.D.s in the first decade since receiving the doctorate. Over time, economic history became more like economics in its use of econometrics and in the likelihood of scholars publishing in economics, as opposed to, say, economic history journals. But the pace of change was slower in economic history than in labor economics, another subfield of economics that underwent profound intellectual change in the 1950s and 1960s, and there was also a structural break evident for post-2000 Ph.D. cohorts. To account for these features of the data, I sketch a simple, overlapping generations model of the academic labor market in which junior scholars have to convince senior scholars of the merits of their work in order to gain tenure. I argue that the early cliometricians—most notably, Robert Fogel and Douglass North—conceived of a scholarly identity for economic history that kept the field distinct from economics proper in various ways, until after 2000 when their influence had waned.","authors":["Robert Margo"],"meta":["September 2018Cliometrica 12(3)","DOI:10.1007/s11698-018-0170-8"],"references":["286496247_The_Evolution_of_Economic_History_since_1950_From_Cliometrics_to_Cliodynamics","324382774_Understanding_the_Gender_Gap_An_Economic_History_of_American_Women","324319254_Understanding_the_Gender_Gap_An_Economic_History_of_American_Women","324291024_Understanding_the_Gender_Gap_An_Economic_History_of_American_Women","324266136_Co-authorship_in_Economic_History_and_Economics_Are_We_Any_Different","321908546_Cotton_slavery_and_the_New_History_of_Capitalism","316437469_Economic_History_Historical_Analysis_and_the_New_History_of_Capitalism","297488400_Natural_experiments_of_history","287390866_Economics_and_the_Modern_Economic_Historian","285540438_Cliometrics_-_40_Years_Later","275822544_Time_on_the_Cross_The_Economics_of_American_Negro_Slavery","274908425_Urban_Slavery_in_the_American_South_1820-1860_A_Quantitative_History","273698151_A_Contribution_to_The_Theory_of_Economic_Growth","270346295_Time_on_the_Cross_Vol_1_The_Economics_of_American_Negro_Slavery","269897206_The_End_of_Economic_History"]}