{"id":"322746540_Modeling_Variability_in_the_Video_Domain_Language_and_Experience_Report","abstract":"In an industrial project, we addressed the challenge of developing a software-based video generator such that consumers and providers of video processing algorithms can benchmark them on a wide range of video variants. This article aims to report on our positive experience in modeling, controlling, and implementing software variability in the video domain. We describe how we have designed and developed a variability modeling language, called VM, resulting from the close collaboration with industrial partners during 2 years. We expose the specific requirements and advanced variability constructs; we developed and used to characterize and derive variations of video sequences. The results of our experiments and industrial experience show that our solution is effective to model complex variability information and supports the synthesis of hundreds of realistic video variants. From the software language perspective, we learned that basic variability mechanisms are useful but not enough; attributes and multi-features are of prior importance; meta-information and specific constructs are relevant for scalable and purposeful reasoning over variability models. From the video domain and software perspective, we report on the practical benefits of a variability approach. With more automation and control, practitioners can now envision benchmarking video algorithms over large, diverse, controlled, yet realistic datasets (videos that mimic real recorded videos)—something impossible at the beginning of the project.","authors":["Edward Mauricio Alférez Salinas","Mathieu Acher","José A. Galindo","Benoit Baudry"],"meta":["March 2019Software Quality Journal 27(1):307–347","DOI:10.1007/s11219-017-9400-8"],"references":["312473089_Technology_research_explained","285673088_Practical_Minimization_of_Pairwise-covering_Test_Configurations_Using_Constraint_Programming","319437299_Using_pure_variants_Across_The_Product_Line_Lifecycle","316269438_Feature-Oriented_Software_Product_Lines","311489758_Variability_Modeling_of_Cryptographic_Components_Clafer_Experience_Report","308841803_Using_pure_variants_across_the_product_line_lifecycle","308816044_Ten_years_of_product_line_engineering_at_Danfoss_lessons_learned_and_way_ahead","308811586_Using_machine_learning_to_infer_constraints_for_product_lines","300014543_Three_Cases_of_Feature-Based_Variability_Modeling_in_Industry","297503207_Quantifying_structural_attributes_of_system_decompositions_in_28_feature-oriented_software_product_lines_An_exploratory_study"]}