{"id":"322781165_Global_synonymous_mutagenesis_identifies_cis-acting_RNA_elements_that_regulate_HIV-1_splicing_and_replication","abstract":"The ~9.5 kilobase HIV-1 genome contains RNA sequences and structures that control many aspects of viral replication, including transcription, splicing, nuclear export, translation, packaging and reverse transcription. Nonetheless, chemical probing and other approaches suggest that the HIV-1 genome may contain many more RNA secondary structures of unknown importance and function. To determine whether there are additional, undiscovered cis-acting RNA elements in the HIV-1 genome that are important for viral replication, we undertook a global silent mutagenesis experiment. Sixteen mutant proviruses containing clusters of ~50 to ~200 synonymous mutations covering nearly the entire HIV-1 protein coding sequence were designed and synthesized. Analyses of these mutant viruses resulted in their division into three phenotypic groups. Group 1 mutants exhibited near wild-type replication, Group 2 mutants exhibited replication defects accompanied by perturbed RNA splicing, and Group 3 mutants had replication defects in the absence of obvious splicing perturbation. The three phenotypes were caused by mutations that exhibited a clear regional bias in their distribution along the viral genome, and those that caused replication defects all caused reductions in the level of unspliced RNA. We characterized in detail the underlying defects for Group 2 mutants. Second-site revertants that enabled viral replication could be derived for Group 2 mutants, and generally contained point mutations that reduced the utilization of proximal splice sites. Mapping of the changes responsible for splicing perturbations in Group 2 viruses revealed the presence of several RNA sequences that apparently suppressed the use of cryptic or canonical splice sites. Some sequences that affected splicing were diffusely distributed, while others could be mapped to discrete elements, proximal or distal to the affected splice site(s). Overall, our data indicate complex negative regulation of HIV-1 splicing by RNA elements in various regions of the HIV-1 genome that enable balanced splicing and viral replication.","authors":["Matthew A Takata","Steven J. Soll","Ann Emery","Daniel Blanco-Melo"],"meta":["January 2018PLoS Pathogens 14(1):e1006824","DOI:10.1371/journal.ppat.1006824"],"references":["320066451_CG_dinucleotide_suppression_enables_antiviral_defence_targeting_non-self_RNA","316523692_Analysis_of_Competing_HIV-1_Splice_Donor_Sites_Uncovers_a_Tight_Cluster_of_Splicing_Regulatory_Elements_within_Exon_22b","310021667_Transcriptional_start_site_heterogeneity_modulates_the_structure_and_function_of_the_HIV-1_genome","282360509_The_Silent_Sway_of_Splicing_by_Synonymous_Substitutions","278790834_Single-Cell_and_Single-Cycle_Analysis_of_HIV-1_Replication","277974599_Structure_of_the_HIV-1_RNA_packaging_signal","312302210_Characterizing_HIV-1_Splicing_Using_Next_Generation_Sequencing","274685576_Role_of_RNA_structure_and_protein_factors_in_the_control_of_HIV-1_splicing","268789141_Global_Changes_in_the_RNA_Binding_Specificity_of_HIV-1_Gag_Regulate_Virion_Genesis","266747257_HIV-1_splicing_at_the_major_splice_donor_site_is_restricted_by_RNA_structure"]}