{"id":"322720912_Cell_detection_in_pathology_and_microscopy_images_with_multi-scale_fully_convolutional_neural_networks","abstract":"Automated nucleus/cell detection is usually considered as the basis and a critical prerequisite step of computer assisted pathology and microscopy image analysis. However, due to the enormous variability (cell types, stains and different microscopes) and data complexity (cell overlapping, inhomogeneous intensities, background clutters and image artifacts), robust and accurate nucleus/cell detection is usually a difficult problem. To address this issue, we propose a novel multi-scale fully convolutional neural networks approach for regression of a density map to robustly detect the nuclei of pathology and microscopy images. The procedure can be divided into three main stages. Initially, instead of working on the simple dot label space, regression on the proposed structured proximity space for patches is performed so that centers of image patches are explicitly forced to produce larger values than their adjacent areas. Then, several multi-scale fully convolutional regression networks are developed for this task; this will enlarge the receptive field and not only can detect the single, small size cells, but also benefit to detecting cells with big size and overlapping states. In this stage, we copy the full feature maps from the contracting path and merge with the feature maps of the expansive path. This operation will make full use of shallow and deep semantic information of the networks. The networks do not have any fully connected layers; this strategy allows the seamless probability map prediction of arbitrarily large images. At the same time, data augmentations (e.g., small range shift, zoom and randomly flip) are carefully used to enhance the robustness of detection. Finally, morphological operations and suitable filters are employed and some prior information is introduced to find the centers of the cells more robustly. Our method achieves about 99.25% detection precision and the F1-measure is 0.9924 on fluorescence microscopy cell images; about 85.90% detection precision and the F1-measure is 0.9020 on Lymphocyte cell images and about 78.41% detection precision and the F1-measure is 0.8440 on breast histopathological images. This result leads to a promising detection performance that equates and sometimes exceeds the recently published leading detection approaches with the same benchmark datasets.","authors":["Xipeng Pan","Dengxian Yang","Lingqiao Li","Zhenbing Liu"],"meta":["November 2018World Wide Web 21(11)","DOI:10.1007/s11280-017-0520-7"],"references":["316857602_A_Deep_Learning_And_Novelty_Detection_Framework_For_Rapid_Phenotyping_In_High-Content_Screening","320893769_Detection_of_Nuclei_in_HE_Stained_Sections_Using_Convolutional_Neural_Networks","319770257_Exact_solutions_to_the_nonlinear_dynamics_of_learning_in_deep_linear_neural_networks","318397684_Robust_Cell_Detection_and_Segmentation_in_Histopathological_Images_Using_Sparse_Reconstruction_and_Stacked_Denoising_Autoencoders","318395184_A_Novel_Cell_Detection_Method_Using_Deep_Convolutional_Neural_Network_and_Maximum-Weight_Independent_Set","318168231_Simultaneous_Cell_Detection_and_Classification_with_an_Asymmetric_Deep_Autoencoder_in_Bone_Marrow_Histology_Images","317726345_Hybrid_deep_autoencoder_with_Curvature_Gaussian_for_detection_of_various_types_of_cells_in_bone_marrow_trephine_biopsy_images","317724086_Blood_cell_detection_and_counting_in_holographic_lens-free_imaging_by_convolutional_sparse_dictionary_learning_and_coding","313080610_Deep_Voting_A_Robust_Approach_Toward_Nucleus_Localization_in_Microscopy_Images","312145950_Mitosis_detection_in_breast_cancer_pathology_images_by_combining_handcrafted_and_convolutional_neural_network_features"]}