{"id":"322756437_On_Quasi-Newton_Forward--Backward_Splitting_Proximal_Calculus_and_Convergence","abstract":"We introduce a framework for quasi-Newton forward--backward splitting algorithms (proximal quasi-Newton methods) with a metric induced by diagonal $\\pm$ rank-$r$ symmetric positive definite matrices. This special type of metric allows for a highly efficient evaluation of the proximal mapping. The key to this efficiency is a general proximal calculus in the new metric. By using duality, formulas are derived that relate the proximal mapping in a rank-$r$ modified metric to the original metric. We also describe efficient implementations of the proximity calculation for a large class of functions; the implementations exploit the piece-wise linear nature of the dual problem. Then, we apply these results to acceleration of composite convex minimization problems, which leads to elegant quasi-Newton methods for which we prove convergence. The algorithm is tested on several numerical examples and compared to a comprehensive list of alternatives in the literature. Our quasi-Newton splitting algorithm with the prescribed metric compares favorably against state-of-the-art. The algorithm has extensive applications including signal processing, sparse recovery, machine learning and classification to name a few.","authors":["Stephen R. Becker","Jalal M. Fadili","Peter Ochs"],"meta":["January 2018SIAM Journal on Optimization 29(4)","DOI:10.1137/18M1167152"],"references":["311221666_A_differential_equation_for_modeling_Nesterov's_accelerated_gradient_method_Theory_and_insights","301817829_Forward-backward_quasi-Newton_methods_for_nonsmooth_optimization_problems","301815018_The_Variable_Metric_Forward-Backward_Splitting_Algorithm_Under_Mild_Differentiability_Assumptions","296667792_Unifying_abstract_inexact_convergence_theorems_for_descent_methods_and_block_coordinate_variable_metric_iPiano","321069992_Adaptive_Fista","315573860_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Spaces","315455143_BFGS_convergence_to_nonsmooth_minimizers_of_convex_functions","312690325_Proximal_splitting_methods_in_signal_processing","303011345_On_the_convergence_of_variable_metric_line-search_based_proximal-gradient_method_under_the_Kurdyka-Lojasiewicz_inequality","301838197_Efficient_evaluation_of_scaled_proximal_operators"]}