{"id":"322788019_Greedy_Algorithms_for_Maximizing_Nash_Social_Welfare","abstract":"We study the problem of fairly allocating a set of indivisible goods among agents with additive valuations. The extent of fairness of an allocation is measured by its Nash social welfare, which is the geometric mean of the valuations of the agents for their bundles. While the problem of maximizing Nash social welfare is known to be APX-hard in general, we study the effectiveness of simple, greedy algorithms in solving this problem in two interesting special cases. First, we show that a simple, greedy algorithm provides a 1.061-approximation guarantee when agents have identical valuations, even though the problem of maximizing Nash social welfare remains NP-hard for this setting. Second, we show that when agents have binary valuations over the goods, an exact solution (i.e., a Nash optimal allocation) can be found in polynomial time via a greedy algorithm. Our results in the binary setting extend to provide novel, exact algorithms for optimizing Nash social welfare under concave valuations. Notably, for the above mentioned scenarios, our techniques provide a simple alternative to several of the existing, more sophisticated techniques for this problem such as constructing equilibria of Fisher markets or using real stable polynomials.","authors":["Siddharth Barman","Sanath Kumar Krishnamurthy","Rohit Vaish"],"meta":["January 2018"],"references":["319197390_Earning_Limits_in_Fisher_Markets_with_Spending-Constraint_Utilities","318460787_Approximating_the_Nash_Social_Welfare_with_Budget-Additive_Valuations","232706871_The_Nash_Social_Welfare_Function","317704915_Convex_Program_Duality_Fisher_Markets_and_Nash_Social_Welfare","308457598_Nash_Social_Welfare_Matrix_Permanent_and_Stable_Polynomials","305524869_The_Unreasonable_Fairness_of_Maximum_Nash_Welfare","279864653_APX-Hardness_of_Maximizing_Nash_Social_Welfare_with_Indivisible_Items","278396700_Minimizing_envy_and_maximizing_average_Nash_social_welfare_in_the_allocation_of_indivisible_goods","272248157_Maximizing_Nash_Product_Social_Welfare_in_Allocating_Indivisible_Goods","228108240_The_Bargaining_Problem","221454404_Complexity_of_social_welfare_optimization_in_multiagent_resource_allocation","38366777_Consensus_of_Subjective_Probabilities_The_Pari-Mutuel_Method","28641207_Integer_Programming_with_a_Fixed_Number_of_Variables","23573635_Fair_Division_and_Collective_Welfare","4977580_Equity_Envy_and_Efficiency"]}