{"id":"322743832_Acces_a_l'Information_par_un_Systeme_de_Filtrage_Collaboratif_Controle","abstract":"De nos jours, d'importantes quantités d'informations sont à la disposition de chacun grâce au développement des technologies de l'information. Afin d'aider à la découverte de documents intéressants, des outils comme les systèmes de filtrage d'informations sont développés. Ces systèmes fournissent aux utilisateurs un flot continu de documents, sans qu'ils aient à exprimer explicitement ce qu'ils cherchent, contrairement aux systèmes de recherche d'information où une requête doit être produite à chaque fois. En contrepartie, il faut que le système connaisse les centres d'intérêt des utilisateurs (profils) et suive leur évolution au cours du temps. Cela est possible grâce aux retours d'évaluations que l'utilisateur donne sur les documents fournis par le système.Les systèmes de filtrage en général requièrent la participation active des utilisateurs pour atteindre de bonnes performances : c'est en effet par leurs évaluations des documents reçus que les utilisateurs ajustent leur profil. Le filtrage dit «collaboratif» fait intervenir explicitement une communauté par une entraide mutuelle : chaque membre de la communauté reçoit des documents que d'autres membres ont jugés intéressants. Pour cela, il est encore plus important que chaque utilisateur donne régulièrement son point de vue sur les documents envoyés par le système car les performances du système dépendent du comportement de l'ensemble des utilisateurs : un utilisateur qui ne contribue pas à alimenter le système voit non seulement l’efficacité du système baisser pour lui-même, mais fait également baisser l’efficacité pour les autres ! Cette situation est un frein à une utilisation réelle, efficace et à long terme des systèmes de filtrage collaboratif.Si l'on veut que leur travail d'évaluation ne soit pas perçu par les utilisateurs comme un pensum sans contrepartie, il faut munir le système de filtrage d'un contrôle de la qualité. Notre objectif de recherche est de définir et mettre en œuvre un tel système de contrôle qui, à partir de données extraites du système de filtrage en cours d'exploitation, élabore des indicateurs de la qualité. Ces indicateurs permettront d'identifier des situations problématiques et de suggérer des actions afin de garantir l’efficacité du système. De façon plus générale, nous proposons une méthode permettant de définir un modèle d’évaluation de la qualité, que nous appelons EMQUSE (Evaluation Method for Quality in Use), basé sur un aspect qualitatif: la satisfaction de l’utilisateur.","authors":["Lizbeth Gallardo"],"meta":["January 2005"],"references":[]}