{"id":"322739159_Plant_architecture_and_foliar_senescence_impact_the_race_between_wheat_growth_and_Zymoseptoria_tritici_epidemics","abstract":"Abstract\nBackground and Aims\n\nIn order to optimize crop management in innovative agricultural production systems, it is crucial to better understand how plant disease epidemics develop and what factors influence them. This study explores how canopy growth, its spatial organization and leaf senescence impact Zymoseptoria tritici epidemics.\nMethods\n\nWe used the Septo3D model, an epidemic model of Septoria tritici blotch (STB) coupled with a 3-D virtual wheat structural plant model (SPM). The model was calibrated and evaluated against field experimental data. Sensitivity analyses were performed on the model to explore how wheat plant traits impact the interaction between wheat growth and Z. tritici epidemics.\nKey Results\n\nThe model reproduces consistently the effects of crop architecture and weather on STB progress on the upper leaves. Model sensitivity analyses show that the effects of plant traits on epidemics depended on weather conditions. The simulations confirm the known effect of increased stem height and stem elongation rate on limiting STB progress on upper leaves. Strikingly, the timing of leaf senescence is one of the most influential traits on simulated STB epidemics. When the green life span duration of leaves is reduced by early senescence, epidemics are strongly reduced.\nConclusions\n\nWe introduce the notion of a ‘race’ for the colonization of emerging healthy host tissue between the growing canopy and the developing epidemics. This race is 2-fold: (1) an upward race at the canopy scale where STB must catch the newly emerging leaves before they grow away from the spore sources; and (2) a local race at the leaf scale where STB must use the resources of its host before it is caught by leaf apical senescence. The results shed new light on the importance of dynamic interactions between host and pathogen.","authors":["Corinne Robert","Guillaume Garin","Abichou Mariem","Vianney Houlès"],"meta":["January 2018Annals of Botany 121(5)","DOI:10.1093/aob/mcx192","Projects: Modeling the architecture of wheat plantThe ECHAP project: Reducing fungicide use by associating optimal treatment strategies and canopies promoting disease escape"],"references":["316569912_Crop_Fertilization_Impacts_Epidemics_and_Optimal_Latent_Period_of_Biotrophic_Fungal_Pathogens","313226449_Reshaping_Plant_Biology_Qualitative_and_Quantitative_Descriptors_for_Plant_Morphology","309041778_L'architecture_des_couverts_vegetaux_un_levier_pour_reduire_l'utilisation_des_fongicides","301639977_How_Knowledge_of_Pathogen_Population_Biology_Informs_Management_of_Septoria_Tritici_Blotch","290479732_Inferring_the_origin_of_primary_inoculum_of_Zymoseptoria_tritici_from_differential_adaptation_of_resident_and_immigrant_populations_to_wheat_cultivars","284026604_Integration_of_knowledge_on_wheat_phenology_and_Septoria_tritici_epidemiology_into_a_disease_risk_simulation_model_validated_in_Belgium","302806603_Fashionably_late_partners_have_more_fruitful_encounters_Impact_of_the_timing_of_co-infection_and_pathogenicity_on_sexual_reproduction_in_Zymoseptoria_tritici","285197010_The_Relationship_Between_Epidemics_of_Septoria_Leaf_Blotch_and_Yield_Losses_in_Spring_Wheat","279970834_OpenAlea_Scientific_Workflows_Combining_Data_Analysis_and_Simulation","278850621_Is_Zymoseptoria_tritici_a_hemibiotroph"]}