{"id":"322779772_An_effective_misbehavior_detection_model_using_artificial_neural_network_for_vehicular_ad_hoc_network_applications","abstract":"Vehicular ad hoc network (VANET) is the key enabler for future intelligent transportation systems' applications. Due to its high mobility, VANETs rely on the availability of accurate and reliable mobility information of the vehicles. However, misbehavior in mobility can lead to catastrophic results in both safety and traffic efficiency. Several drawbacks of existing misbehavior detection models designed for VANETs which impacted the performance of the applications and the security solutions altogether. Machine learning has not been studied extensively in misbehavior detection in VANET. In this paper, an effective misbehavior detection model based on machine learning techniques is proposed. The proposed model consists of four main phases: data acquisition, data sharing, analysis and decision making. New features are derived which represent the misbehavior, environment and communication status in order to effectively detect the misbehavior data. By using Artificial Neural Network (ANN) techniques namely the feedforward and the back propagation algorithms, an effective misbehavior classifier is trained based on historical data that contains both attacker and normal traffic data. A real-world traffic dataset namely NGSIM is used to construct and evaluate the proposed model. Results show significant improvement in the effectiveness of the proposed model in comparison with the existing baseline model.","authors":["Fuad A. Ghaleb","Anazida Zainal","Murad A. Rassam","Fathey Mohammed"],"meta":["November 2017","DOI:10.1109/AINS.2017.8270417","Conference: 2017 IEEE Conference on Application, Information and Network Security (AINS)"],"references":["315439003_A_Survey_of_Attacks_and_Detection_Mechanisms_on_Intelligent_Transportation_Systems_VANETs_and_IoV","309388104_Survey_on_Misbehavior_Detection_in_Cooperative_Intelligent_Transportation_Systems","308573202_Mobility_information_estimation_algorithm_using_Kalman-filter_for_vehicular_ad_hoc_networks","284360423_Location_Information_Verification_cum_Security_Using_TBM_in_Geocast_Routing","283200148_Host_Based_Intrusion_Detection_for_VANETs_A_Statistical_Approach_to_Rogue_Node_Detection","267506782_A_flexible_subjective_logic-based_framework_for_misbehavior_detection_in_V2V_networks","321504310_Multilayered_Security_and_Privacy_Protection_in_Car-to-X_Networks","317790194_Improved_vehicle_positioning_algorithm_using_enhanced_innovation-based_adaptive_Kalman_filter","303126356_Enhanced_Position_Verification_for_VANETs_using_Subjective_Logic","283632873_Vehicle_trajectory-based_location_verification_for_VANETs"]}