{"id":"322708981_Scuba_Scalable_kernel-based_gene_prioritization","abstract":"Background\nThe uncovering of genes linked to human diseases is a pressing challenge in molecular biology and precision medicine. This task is often hindered by the large number of candidate genes and by the heterogeneity of the available information. Computational methods for the prioritization of candidate genes can help to cope with these problems. In particular, kernel-based methods are a powerful resource for the integration of heterogeneous biological knowledge, however, their practical implementation is often precluded by their limited scalability. ResultsWe propose Scuba, a scalable kernel-based method for gene prioritization. It implements a novel multiple kernel learning approach, based on a semi-supervised perspective and on the optimization of the margin distribution. Scuba is optimized to cope with strongly unbalanced settings where known disease genes are few and large scale predictions are required. Importantly, it is able to efficiently deal both with a large amount of candidate genes and with an arbitrary number of data sources. As a direct consequence of scalability, Scuba integrates also a new efficient strategy to select optimal kernel parameters for each data source. We performed cross-validation experiments and simulated a realistic usage setting, showing that Scuba outperforms a wide range of state-of-the-art methods. Conclusions\nScuba achieves state-of-the-art performance and has enhanced scalability compared to existing kernel-based approaches for genomic data. This method can be useful to prioritize candidate genes, particularly when their number is large or when input data is highly heterogeneous. The code is freely available at https://github.com/gzampieri/Scuba.","authors":["Guido Zampieri","Van Dinh Tran","Michele Donini","Nicolò Navarin"],"meta":["January 2018BMC Bioinformatics 19(1)","DOI:10.1186/s12859-018-2025-5","Project: \"Bioinfogen: BIOINFORMATICS FOR PERSONAL GENOMICS\""],"references":["311348204_The_Human_Phenotype_Ontology_in_2017","295080817_Kernel_based_collaborative_filtering_for_very_large_scale_top-N_item_recommendation","284279059_NONCODE_2016_an_informative_and_valuable_data_source_of_long_non-coding_RNAs","282152306_A_fast_and_high_performance_multiple_data_integration_algorithm_for_identifying_human_disease_genes","325485250_The_Human_Phenotype_Ontology_in_2017","313102947_KEGG_Kyoto_encyclopedia_of_genes_and_genomes","308833433_Gene_prioritization_through_geometric-inspired_kernel_data_fusion","307913807_How_to_Identify_Pathogenic_Mutations_among_All_Those_Variations_Variant_Annotation_and_Filtration_in_the_Genome_Sequencing_Era","292781024_Human_Protein_Reference_Database-2009_update","289534118_Gene_Prioritization_Through_Geometric-Inspired_Kernel_Data_Fusion"]}