{"id":"322745586_High_research_productivity_in_vertically_undifferentiated_higher_education_systems_Who_are_the_top_performers","abstract":"The growing scholarly interest in research top performers comes from the growing policy interest in research top performance itself. A question emerges: what makes someone a top performer? In this paper, the upper 10 percent of Polish academics in terms of research productivity are studied, and predictors of entering this class are sought. In the science system (and Poland follows global patterns), a small number of scholars produce most of the works and attract huge numbers of citations. Performance determines rewards, and small differences in talent translate into a disproportionate level of success, leading to inequalities in resources, research outcomes, and rewards. Top performers are studied here through a bivariate analysis of their working time distribution and their academic role orientation, as well as through a model approach. Odds ratio estimates with logistic regression of being highly productive Polish academics are presented. Consistently across major clusters of academic disciplines, the tiny minority of 10 percent of academics produces about half (44.7 percent) of all Polish publications (48.0 percent of publications in English and 57.2 percent of internationally co-authored publications). The mean research productivity of top performers across major clusters is on average 7.3 times higher than that of the other academics, and in terms of internationally co-authored publications, 12.07 times higher. High inequality was observed: the average research productivity distribution is highly skewed with a long tail on the right not only for all Polish academics but also for top performers. The class of top performers is as internally stratified as that of their lower-performing colleagues. Separate regression models for all academics, science, technology, engineering and mathematics (STEM) academics, and social sciences and humanities (SSH) academics are built based on a large national sample (2,525 usable observations), and implications are discussed.","authors":["Marek Kwiek"],"meta":["January 2018Scientometrics 115(1)","DOI:10.1007/s11192-018-2644-7","Project: Academic Profession in the Knowledge Society"],"references":["321836240_International_Research_Collaboration_and_International_Research_Orientation_Comparative_Findings_About_European_Academics","317147298_Academic_top_earners_Research_productivity_prestige_generation_and_salary_patterns_in_European_universities","344486804_How_Economics_Shapes_Science","324621965_Social_Stratification_in_Science","324309854_Striking_the_Mother_Lode_in_Science_The_Importance_of_Age_Place_and_Time","319221319_The_Study_of_the_Academic_Profession_-_Contributions_from_and_to_the_Sociology_of_Professions","318474422_The_law_of_limited_excellence_publication_productivity_of_Israel_Prize_laureates_in_the_life_and_exact_sciences","317837567_The_Changing_Academic_Profession","315498599_Scholars_in_the_Changing_American_Academy","315361281_THE_BEST_AND_THE_REST_REVISITING_THE_NORM_OF_NORMALITY_OF_INDIVIDUAL_PERFORMANCE","314078627_A_generational_divide_in_the_academic_profession_A_mixed_quantitative_and_qualitative_approach_to_the_Polish_case","313867677_An_investigation_on_the_skewness_patterns_and_fractal_nature_of_research_productivity_distributions_at_field_and_discipline_level","315191050_The_Scientific_Community","314866227_How_stars_matter_Recruiting_and_peer_effects_in_evolutionary_biology","313059029_Scientists_at_major_and_minor_universities"]}