{"id":"322764293_Bayesian_network_hybrid_learning_using_an_elite-guided_genetic_algorithm","abstract":"Bayesian networks (BNs) constitute a powerful framework for probabilistic reasoning and have been extensively used in different research domains. This paper presents an improved hybrid learning strategy that features parameterized genetic algorithms (GAs) to learn the structure of BNs underlying a set of data samples. The performance of GAs is influenced by the choice of multiple initial parameters. This work is concerned with designing a series of parameter-less hybrid methods on a build-up basis: first the standard implementation is refined with the previously-developed data-informed evolutionary strategies. Then, two novel knowledge-driven parent controlling enhancements are presented. The first improvement works upon the parent limitation setting. BN structure learning algorithms typically set a bound for the maximum number of parents a BN node can possess to comply with the computational feasibility of the learning process. Our proposed method carefully selects the parents to rule out based on a knowledge-driven strategy. The second enhancement aims at reducing the sensitivity of the parent control setting by dynamically adjusting the maximum number of parents each node can hold. In the experimental section, it is shown how the adopted baseline outperforms the competitor algorithms included in the benchmark: thanks to its global search capabilities, the genetic methodology can efficiently prevail over other state-of-the-art structural learners on large networks. Presented experiments also prove how the proposed methods enhance the algorithmic efficiency and sensitivity to parameter setting, and address the problem of data fragmentation with respect to the baseline, with the advantage of higher performances in some cases.","authors":["Carlo Contaldi","Fatemeh Vafaee","Peter C. Nelson"],"meta":["June 2019Artificial Intelligence Review 52(293)","DOI:10.1007/s10462-018-9615-5"],"references":["319208010_Learning_Bayesian_network_structure_from_massive_datasets_The_sparse_candidate_algorithm","318067551_The_role_of_crossover_operator_in_bayesian_network_structure_learning_performance_a_comprehensive_comparative_study_and_new_insights","313659797_Biometry_The_principles_and_practice_of_statistics_in_biological_research_WH_Freeman_and_Company","304257411_Biometry_The_Principles_and_Practice_of_Statistics_in_Biological_Research","290882608_Semantic_Information_Retrieval","286650705_Balancing_the_exploration_and_exploitation_in_an_adaptive_diversity_guided_genetic_algorithm","275697437_Causality_Models_Reasoning_and_Inference","269159312_Information_Retrieval","266656281_Learning_the_structure_of_large-scale_Bayesian_Networks_using_genetic_algorithm","266656099_Among-site_rate_variation_Adaptation_of_genetic_algorithm_mutation_rates_at_each_single_site","242448131_Causation_Prediction_and_Search","262206059_Efficient_methods_for_learning_Bayesian_network_super-structures","254198346_Learning_Bayesian_Network_Structures_by_searching_the_best_orderordering_with_genetic_algorithms","246901566_Multiple_Comparisons_Among_Means","242460971_X_On_the_criterion_that_a_given_system_of_deviations_from_the_probable_in_the_case_of_a_correlated_system_of_variables_is_such_that_it_can_be_reasonably_supposed_to_have_arisen_from_random_sampling"]}