{"id":"322727417_The_Pseudo-Equivalent_Groups_Approach_as_an_Alternative_to_Common-Item_Equating_The_Pseudo-Equivalent_Groups_Approach","abstract":"The purpose of this study was to evaluate the effectiveness of linking test scores by using test takers' background data to form pseudo-equivalent groups (PEG) of test takers. Using 4 operational test forms that each included 100 items and were taken by more than 30,000 test takers, we created 2 half-length research forms that had either 20 (strong anchor) or 10 (weak anchor) items in common. Because the 2 research forms were assembled from a single form that had been administered in a large-scale operational testing setting, we obtained the direct equating function between the 2 research forms through the single-group design and treated it as a criterion or true equating function between the 2 research forms. We equated the 2 research forms in a common-item design using the poststratification equipercentile (PSE) and chained equipercentile (CHEQ) methods, and then compared the common-item results to the results derived from the PEG linking. Because the new and reference groups differed substantially in ability, by study design, the CHEQ method produced more accurate results than did the PSE method in both the strong and weak anchor conditions. CHEQ using 10 common items was as effective as PSE using 20 common items. PSE using 10 common items produced the least accurate results among the five methods. The PEG linking produced more accurate results compared to the PSE method using the weak anchor.","authors":["Sooyeon Kim","Ru Lu"],"meta":["January 2018ETS Research Report Series 2018(1)","DOI:10.1002/ets2.12195"],"references":["279958178_Test_Equating_Scaling_and_Linking","277661601_Pseudo-Equivalent_Groups_and_Linking","270585302_Test_Equating_Scaling_and_Linking_Methods_and_Practices_2nd_ed","251203019_Using_Exponential_Families_for_Equating","230267609_Comparisons_among_Small_Sample_Equating_Methods_in_a_Common-Item_Design","230254001_Random-Groups_Equating_with_Samples_of_50_to_400_Test_Takers","38359165_Adjustment_by_Minimum_Discriminant_Information"]}