{"id":"322748932_Parallelization_of_stochastic_bounds_for_Markov_chains_on_multicore_and_manycore_platforms","abstract":"The author demonstrates the methodology for parallelizing of finding stochastic bounds for Markov chains on multicore and manycore platforms. The stochastic bounds algorithm for Markov chains with the sparse matrices is investigated, thus needing a lot of irregular memory access. Its parallel implementations should scale across multiple threads and characterize with a high performance and performance portability between multicore and manycore platforms. The presented methods are built on the usage of two parallelization extensions of the C++ language: OpenMP and Cilk Plus. For this two extensions, we use two programming models, namely loop parallelism and task-based parallelism. The numerical experiments show the execution time of the implementations and the scalability on multicore and manycore platforms. This work provides the parallel implementations and at the same time presents an educational example of how computer science problems with irregular memory access can be implemented for high performance using OpenMP and Cilk Plus.","authors":["Jarosław Bylina"],"meta":["April 2018The Journal of Supercomputing 74(4)","DOI:10.1007/s11227-018-2235-7"],"references":["300882906_Stochastic_Bounds_for_Markov_Chains_with_the_Use_of_GPU","281884296_A_Brief_Introduction_to_an_Algorithmic_Approach_for_Strong_stochastic_Bounds","269512447_Computational_Aspects_of_GPU-accelerated_Sparse_Matrix-Vector_Multiplication_for_Solving_Markov_Models","260708633_Efficient_Sparse_Matrix-vector_Multiplication_on_x86-based_Many-core_Processors","323946697_Stochastic_Bounds_for_Markov_Chains_on_Intel_Xeon_Phi_Coprocessor","316799344_Markov_Processes_for_Stochastic_Modeling","300709182_An_Efficient_Representation_on_GPU_for_Transition_Rate_Matrices_for_Markov_Chains","290326104_A_Markovian_Model_of_a_Network_of_Two_Wireless_Devices","265371993_Markov_Processes_for_Stochastic_Modeling","264960784_Comparison_Methods_for_Stochastic_Models_and_Risks"]}