{"id":"322738290_An_interaction_Continuum_for_3D_Dataset_Visualization","abstract":"An increasing number of interaction paradigms and devices are being developed and studied for 3D manipulations. This development benefits, in particular, scientific domains such as visualization which rely on manipulation of 3D data. Numerous studies have proven the benefits of each one of them for specific tasks involved in visualization. Yet, classical graphical user interfaces as well as mouse and keyboards still prevail in most interactive settings: such environments are still useful for specific tasks and because they are readily available and accessible when compared to innovative interaction paradigms and devices. In contrast to the usual approach to create or study a new interaction paradigm, technique, or device, the work presented in this thesis paves the way towards an interaction continuum: the possibility to transition between and combine two or more interaction paradigms to benefit from their inherent advantages. To achieve this goal we take several steps. First, building on the observation that mouse and keyboard, tactile interaction and tangible interaction are now standards or are getting close to being standard interaction paradigms for casual or specific use cases, this thesis studies and compares their inherent advantages and limitations for 3D manipulations. Based on this work, we then create a hybrid tactile/tangible interaction paradigm. Based on the needs of scientific visualization for fluid dynamics, we implement specific 3D explorative interaction techniques with the hybrid paradigm and evaluate them with domain experts. The prototypical implementation of this hybrid paradigm is a tactile-enabled and spatially-aware tablet. Based on the feedback from domain experts, such a combination is more flexible than the state of the art and still facilitates precise 3D manipulations. With the potential of this hybrid paradigm, we then tackle the complex task of 3D subsets selection---a major initial step for data understanding. While 3D subset selection is usually conducted with an initial 2D input later extended by the machine, our combination of tactile and tangible interaction allows users to have a fully manual selection technique with the same spatially-aware tablet: a 2D lasso can be drawn with tactile input which can then be extended into 3D when moving the tablet. Not only does this combination fill in an empty space in the taxonomy of 3D subset selection techniques, but we also found it to be more precise than partially-automated solutions---albeit being slower. Finally, building on the observation that tangible interaction with a locally-coupled device might need gain factor adjustments, we propose to use a specific aspect of tactile interaction, pressure-sensing, to control the gain factors of tangible manipulations. The work presented in this thesis thus demonstrates the potential of an interaction continuum for visualization by proposing hybrid interaction paradigms in an easy-to-maintain, easy-to-integrate, and affordable setup. It provides the necessary initial steps for an interaction continuum that will hopefully inspire the creation of more hybrid interaction techniques for 3D data interaction.","authors":["Lonni Besançon"],"meta":["December 2017","Project: An Interaction Continuum for 3D Dataset Visualization"],"references":["318848148_A_Hybrid_2D3D_User_Interface_for_Radiological_Diagnosis","317004801_Preference_Between_Allocentric_and_Egocentric_3D_Manipulation_in_a_Locally_Coupled_Configuration","316712306_Investigating_Cross-Device_Interaction_between_a_Handheld_Device_and_a_Large_Display","316709179_Mouse_Tactile_and_Tangible_Input_for_3D_Manipulation","316652456_Pressure-Based_Gain_Factor_Control_for_Mobile_3D_Interaction_using_Locally-Coupled_Devices","316139894_The_earth_is_flat_p005_Significance_thresholds_and_the_crisis_of_unreplicable_research","313554067_The_silk_cursor_Investigating_transparency_for_3D_target_acquisition","313450659_A_Tangible_Volume_for_Portable_3D_Interaction","312184560_Tabletop_3D_Object_Manipulation_with_Touch_and_Tangibles","311465407_The_CAT_for_efficient_2D_and_3D_interaction_as_an_alternative_to_mouse_adaptations","306051856_Hybrid_TactileTangible_Interaction_for_3D_Data_Exploration","303545847_Comparing_Tangible_and_Multi-touch_Interaction_for_Interactive_Data_Visualization_Tasks","310416313_The_new_statistics_Why_and_how","308814785_Object_impersonation_Towards_effective_interaction_in_tablet-_and_HMD-based_hybrid_virtual_environments","302074233_Special_Interest_Group_on_Transparent_Statistics_in_HCI"]}