{"id":"322753211_Social_Morphodynamics_Mapping_Identity_Transformations_Cultural_Encounters_and_the_Evolution_of_Core_Values","abstract":"In this paper given to Harvard CES community in the framework of my appointment as a Visiting Research Scholar, I outline a personal account of a theoretical path toward a specific research project and scientific method to map some burning contemporary societal issues. It is aimed to represent an important take on social epistemological and anthropological scientific approaches, based on the anthropological and sociological methodology of the French structural tradition, which may figure out what anthropology is or may be heading today. European societies are facing new challenges stemming from cultural encounters and identity transformations. These have revealed the vulnerability of the EU project and cosmopolitan European identity. To address these challenges I propose a new theoretical and methodological approach that draws on structural socio-anthropology and aims to develop some of Lévi-Strauss’s and Pierre Bourdieu’s conceptual and theoretical tools. I outline a complex research strategy including the use of Bayesian inference and computer formalism, while comparison of the findings with policy choices and practices will make it possible to assess the effects of European integration policies.","authors":["Albert Doja"],"meta":["January 2018"],"references":["279532443_Invitation_au_terrain_Memoire_personnel_de_la_construction_du_projet_socio-anthropologique","229550025_Levi-Strauss_and_the_political_The_elementary_structures_of_kinship_and_the_resolution_of_relations_between_indigenous_people_and_settler_states","49633768_Fertility_Trends_Marriage_Patterns_and_Savant_Typologies_in_Albanian_Context","305093824_Ungesellschaftliche_Gesellschaftlichkeit_Exklusion_und_Antagonismus_bei_Levi-Strauss_unter_Berucksichtigung_von_Lacan_Laclau_und_Luhmann","298545469_The_elementary_structures_of_kinship_and_the_resolution_of_relations_between_indigenous_peoples_and_settler_states_vol_11_pg_425_2005","297476050_The_Cambridge_Companion_to_Levi-Strauss","274344504_Lire_Levi-Strauss_Le_deploiement_d'une_intuition","240815139_Approche_morphodynamique_de_la_formule_canonique_du_mythe","229068330_The_Society_of_Mind","228173333_The_Commodification_of_Intimacy_Marriage_Sex_and_Reproductive_Labor"]}