{"id":"322749812_SegNet_A_Deep_Convolutional_Encoder-Decoder_Architecture_for_Image_Segmentation","abstract":"We present a novel and practical deep fully convolutional neural network architecture for semantic pixel-wise segmentation termed SegNet. This core trainable segmentation engine consists of an encoder network, a corresponding decoder network followed by a pixel-wise classification layer. The architecture of the encoder network is topologically identical to the 13 convolutional layers in the VGG16 network [1]. The role of the decoder network is to map the low resolution encoder feature maps to full input resolution feature maps for pixel-wise classification. The novelty of SegNet lies is in the manner in which the decoder upsamples its lower resolution input feature map(s). Specifically, the decoder uses pooling indices computed in the max-pooling step of the corresponding encoder to perform non-linear upsampling. This eliminates the need for learning to upsample. The upsampled maps are sparse and are then convolved with trainable filters to produce dense feature maps. We compare our proposed architecture with the widely adopted FCN [2] and also with the well known DeepLab-LargeFOV [3] , DeconvNet [4] architectures. This comparison reveals the memory versus accuracy trade-off involved in achieving good segmentation performance. SegNet was primarily motivated by scene understanding applications. Hence, it is designed to be efficient both in terms of memory and computational time during inference. It is also significantly smaller in the number of trainable parameters than other competing architectures and can be trained end-to-end using stochastic gradient descent. We also performed a controlled benchmark of SegNet and other architectures on both road scenes and SUN RGB-D indoor scene segmentation tasks. These quantitative assessments show that SegNet provides good performance with competitive inference time and most efficient inference memory-wise as compared to other architectures. We also provide a Caffe implementation of SegNet and a web demo at http://mi.eng.cam.ac.uk/projects/segnet/.","authors":["Vijay Badrinarayanan","Alex Kendall","Roberto Cipolla"],"meta":["December 2017","DOI:10.17863/CAM.17966"],"references":["332814678_Bayesian_SegNet_Model_Uncertainty_in_Deep_Convolutional_Encoder-Decoder_Architectures_for_Scene_Understanding","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","319770305_Learning_Convolutional_Feature_Hierarchies_for_Visual_Recognition","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770284_Edge_Boxes_Locating_Object_Proposals_from_Edges","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770198_Learning_a_Deep_Convolutional_Network_for_Image_Super-Resolution","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","314100361_Indoor_Segmentation_and_Support_Inference_from_RGBD_Images","311610893_Efficient_Piecewise_Training_of_Deep_Structured_Models_for_Semantic_Segmentation"]}