{"id":"322838097_Adapting_to_large-scale_changes_in_Advanced_Placement_Biology_Chemistry_and_Physics_the_impact_of_online_teacher_communities","abstract":"Over the past decade, the field of teacher professional learning has coalesced around core characteristics of high quality professional development experiences (e.g. Borko, Jacobs, & Koellner, 2010. Contemporary approaches to teacher professional development. In P. L. Peterson, E. Baker, & B. McGaw (Eds.), International encyclopedia of education (Vol. 7, pp. 548–556). Oxford: Elsevier.; Darling-Hammond, Hyler, & Gardner, 2017. Effective teacher professional development. Palo Alto, CA: Learning Policy Institute). Many countries have found these advances of great interest because of a desire to build teacher capacity in science education and across the full curriculum. This paper continues this progress by examining the role and impact of an online professional development community within the top-down, large-scale curriculum and assessment revision of Advanced Placement (AP) Biology, Chemistry, and Physics. This paper is part of a five-year, longitudinal, U.S. National Science Foundation–funded project to study the relative effectiveness of various types of professional development in enabling teachers to adapt to the revised AP course goals and exams. Of the many forms of professional development our research has examined, preliminary analyses indicated that participation in the College Board's online AP Teacher Community (APTC) – where teachers can discuss teaching strategies, share resources, and connect with each other – had positive, direct, and statistically significant association with teacher self-reported shifts in practice and with gains in student AP scores (Fishman et al., 2014). This study explored how usage of the online APTC might be useful to teachers and examined a more robust estimate of these effects. Findings from the experience of AP teachers may be valuable in supporting other large-scale curriculum changes, such as the U.S. Next Generation Science Standards or Common Core Standards, as well as parallel curricular shifts in other countries.","authors":["Kim Frumin","Chris Dede","Christian Fischer","Brandon Foster"],"meta":["January 2018International Journal of Science Education 40(20):1-24","DOI:10.1080/09500693.2018.1424962","Project: Supporting Large Scale Change in Science Education: Understanding Professional Development and Adoption Variation Related to Revised Advanced Placement Curriculum (PD-RAP)"],"references":["281744478_Cultivating_Knowledge_Sharing_and_Trust_in_Online_Communities_for_Educators","346828891_The_Allure_of_Order_High_Hopes_Dashed_Expectations_and_the_Troubled_Quest_to_Remake_American_SchoolingHigh_Hopes_Dashed_Expectations_and_the_Troubled_Quest_to_Remake_American_Schooling","345851617_Teaching_Excellence_through_Professional_Learning_and_Policy_Reform_Lessons_from_around_the_World","316996854_A_framework_for_K-12_science_education_Practices_crosscutting_concepts_and_core_ideas","314751141_Hierarchical_Linear_Models_Applications_and_Data_Analysis_Methods","309109591_STEM_integration_in_K-12_education_status_prospects_and_an_agenda_for_research","307175934_Chinese_Science_Education_in_the_21st_Century_Policy_Practice_and_Research","303105948_Regression_Modeling_Strategies_With_Applications_to_Linear_Models_Logistic_and_Ordinal_Regression_and_Survival_Analysis","276831973_Effective_CPD_on_a_large_scale_examining_the_development_of_multipliers","276317278_Scaling_CPD_through_professional_learning_communities_development_of_teachers'_self-efficacy_in_relation_to_collaboration"]}