{"id":"322871977_Fuzzy_Cognitive_Diagnosis_for_Modelling_Examinee_Performance","abstract":"Recent decades have witnessed the rapid growth of educational data mining (EDM), which aims at automatically extracting valuable information from large repositories of data generated by or related to people’s learning activities in educational settings. One of the key EDM tasks is cognitive modelling with examination data, and cognitive modelling tries to profile examinees by discovering their latent knowledge state and cognitive level (e.g. the proficiency of specific skills). However, to the best of our knowledge, the problem of extracting information from both objective and subjective examination problems to achieve more precise and interpretable cognitive analysis remains underexplored. To this end, we propose a fuzzy cognitive diagnosis framework (FuzzyCDF) for examinees’ cognitive modelling with both objective and subjective problems. Specifically, to handle the partially correct responses on subjective problems, we first fuzzify the skill proficiency of examinees. Then we combine fuzzy set theory and educational hypotheses to model the examinees’ mastery on the problems based on their skill proficiency. Finally, we simulate the generation of examination score on each problem by considering slip and guess factors. In this way, the whole diagnosis framework is built. For further comprehensive verification, we apply our FuzzyCDF to three classical cognitive assessment tasks, i.e., predicting examinee performance, slip and guess detection, and cognitive diagnosis visualization. Extensive experiments on three real-world datasets for these assessment tasks prove that FuzzyCDF can reveal the knowledge states and cognitive level of the examinees effectively and interpretatively.","authors":["Qi Liu","Runze Wu","Enhong Chen","Guandong Xu"],"meta":["January 2018ACM Transactions on Intelligent Systems and Technology 9(4):1-26","DOI:10.1145/3168361"],"references":["320882619_Tracking_Knowledge_Proficiency_of_Students_with_Educational_Priors","304288599_Mining_Indecisiveness_in_Customer_Behaviors","349860897_Item_Response_Theory","322407983_Knowledge_or_Gaming_Cognitive_Modelling_Based_on_Multiple-Attempt_Response","319394499_Fuzzy_Sets","316936202_Foundations_of_Fuzzy_Control_A_Practical_Approach_Second_Edition","309092275_Collaborative_Learning_Team_Formation_A_Cognitive_Modeling_Perspective","304494685_Probabilistic_matrix_factorization","301973938_Subjective_versus_Objective_Questions_Perception_of_Question_Subjectivity_in_Social_QA","300988879_Multicomponent_Latent_Trait_Models_for_Test_Design"]}