{"id":"322826475_Participatory_GIS_in_design_of_the_Wroclaw_University_of_Science_and_Technology_campus_web_map_and_spatial_analysis_of_campus_area_quality","abstract":"Public participation geographic information system (GIS) and participatory mapping data collection methods are means that enhance capacity in generating, managing, and communicating spatial information in various fields ranging from local planning to environmental management. In this study these methods have been used in two ways. The first one, to gather information on the additional functionality of campus web map expected by its potential users, i.e. students, staff and visitors, through web based survey. The second, to collect geographically referenced information on campus areas that are liked and disliked in a geo-survey carried out with ArcGIS Online GeoForm Application. The results of the first survey were used to map facilities such as: bicycle infrastructure, building entrances, wheelchair accessible infrastructure and benches. The results of the second one, to analyse the most and the least attractive parts of the campus with heat and hot spot analyses in GIS. In addition, the answers have been studied with regard to the visual and functional aspects of campus area raised in the survey. The thematic layers developed in the results of field mapping and geoprocessing of geosurvey data were included in the campus web map project. The paper describes the applied methodology of data collection, processing, analysis, interpretation and geovisualisation.","authors":["Jan Blachowski","Jakub Łuczak","Paulina Zagrodnik"],"meta":["January 2018E3S Web of Conferences 29(3):00025","DOI:10.1051/e3sconf/20182900025"],"references":["300478520_From_Crowdsourced_Mapping_to_Community_Mapping_The_Post-earthquake_Work_of_OpenStreetMap_Haiti","268691608_Evaluating_a_concept_design_of_a_crowd-sourced_'mashup'_providing_ease-of-access_information_for_people_with_limited_mobility","226851393_The_Credibility_of_Volunteered_Geographic_Information","288462810_The_Association_Of_American_Geographers","279578831_Delineating_public_and_participation_in_PPGIS","278640308_Citizen_Science_and_Volunteered_Geographic_Information_Overview_and_Typology_of_Participation","276061108_The_use_of_public_participation_GIS_PPGIS_for_park_visitor_management_A_case_study_of_mountain_biking","269403791_Is_PPGIS_good_enough_An_empirical_evaluation_of_the_quality_of_PPGIS_crowd-sourced_spatial_data_for_conservation_planning","263930716_Assessing_the_value_of_public_lands_using_public_participation_GIS_PPGIS_and_social_landscape_metrics","227624240_Public_Participation_Geographic_Information_Systems_A_Literature_Review_and_Framework"]}