{"id":"322813763_Self-Calibration_and_Bilinear_Inverse_Problems_via_Linear_Least_Squares","abstract":"Whenever we use devices to take measurements, calibration is indispensable. While the purpose of calibration is to reduce bias and uncertainty in the measurements, it can be quite difficult, expensive, and sometimes even impossible to implement. We study a challenging problem called self-calibration, i.e., the task of designing an algorithm for devices so that the algorithm is able to perform calibration automatically. More precisely, we consider the setup y = A(d)x + ε where only partial information about the sensing matrix A(d) is known and where A(d) linearly depends on d. The goal is to estimate the calibration parameter d (resolve the uncertainty in the sensing process) and the signal/ object of interest x simultaneously. For three different models of practical relevance, we show how such a bilinear inverse problem, including blind deconvolution as an important example, can be solved via a simple linear least squares approach. As a consequence, the proposed algorithms are numerically extremely efficient, thus potentially allowing for real-time deployment. We also present a variation of the least squares approach, which leads to a spectral method, where the solution to the bilinear inverse problem can be found by computing the singular vector associated with the smallest singular value of a certain matrix derived from the bilinear system. Explicit theoretical guarantees and stability theory are derived for both techniques, and the number of sampling complexity is nearly optimal (up to a poly-log factor). Applications in imaging sciences and signal processing are discussed, and numerical simulations are presented to demonstrate the effectiveness and efficiency of our approach. © 2018 Society for Industrial and Applied Mathematics and by SIAM.","authors":["Shuyang Ling","Thomas Strohmer"],"meta":["January 2018SIAM Journal on Imaging Sciences 11(1):252-292","DOI:10.1137/16M1103634"],"references":["308980804_A_Greedy_Blind_Calibration_Method_for_Compressed_Sensing_with_Unknown_Sensor_Gains","288060069_Optimal_Sample_Complexity_for_Blind_Gain_and_Phase_Calibration","288059922_Blind_Deconvolution_Meets_Blind_Demixing_Algorithms_and_Performance_Bounds","284218963_Blind_Recovery_of_Sparse_Signals_From_Subsampled_Convolution","317929441_A_convex_approach_to_blind_deconvolution_with_diverse_inputs","311981428_Through_the_Haze_A_Non-Convex_Approach_to_Blind_Calibration_for_Linear_Random_Sensing_Models","311252844_A_non-convex_blind_calibration_method_for_randomised_sensing_strategies","308772807_Blind_Deconvolution_From_Multiple_Sparse_Inputs","301838499_Optimal_Injectivity_Conditions_for_Bilinear_Inverse_Problems_with_Applications_to_Identifiability_of_Deconvolution_Problems","297659801_An_Overview_of_Low-Rank_Matrix_Recovery_From_Incomplete_Observations"]}