{"id":"322828759_EVALUASI_PERFORMA_USABILITY_SITUS-SITUS_WEB_PERGURUAN_TINGGI_NEGERI_DI_INDONESIA_YANG_TERAKREDITASI_A_TAHUN_2013_SERTA_PERBANDINGAN_KONDISI_SITUS_WEB_TAHUN_2014_DAN_2017","abstract":"ABSTRAK Artikel ini berisi tentang hasil evaluasi usability terhadap situs web Perguruan Tinggi Negeri (PTN) di Indonesia yang memperoleh Akreditasi A dari Badan Akreditasi Nasional Perguruan Tinggi (BAN-PT) pada tahun 2013 yang masih berlaku hingga tahun 2017. Adapun berdasarkan hasil penelitian, PTN yang memperoleh skor kepuasan pengguna tertinggi dalam hal situs web adalah Universitas Gajah Mada. Adapun Perguruan Tinggi yang memiliki skor kepuasan pengguna terendah adalah Universitas Diponegoro. Berdasarkan hasil uji korelasi antara hasil rata-rata QUIS dan rata-rata level permasalahan usability, dapat disimpulkan bahwa keduanya memiliki korelasi yang kuat, nyata dan searah (r = 0.21, p = 0.000). Dengan kata lain, jika hasil rata-rata QUIS semakin tinggi, maka dapat diasumsikan kondisi permasalahan usability situs web tersebut semakin rendah. Situs web UNHAS memiliki performa usability tertinggi dengan skor terkecil berdasarkan hasil normalisasi (5.8205), sedangkan situs web UNDIP memiliki performa usability terendah dengan skor terbesar (23.4430). Perubahan situs web UIN Jakarta pada tahun 2017 jika dibandingkan dengan tahun 2014 ialah ditambahkannya breadcrumps navigation, fitur drop-down pada menu bar, dan mesin pencari. Sementara pada situs web UI tahun 2017 telah ditambahkan 7 menu bar dari yang semula hanya 5 menu bar, kemudian pada situs web UNDIP telah menggunakan menu bar di bagian atas (header) setelah sebelumnya hanya menggunakan tautan dan ditambahkan pula alamat surat elektronik dan tautan-tautan kepada media sosial UNDIP. ABSTRACT This article contains of website usability evaluation result of the State Universities in Indonesia to obtain accreditation from the National Accreditation Board of Higher Education in 2013 which is still valid until 2017. The basis of research, universities that received the highest user satisfaction scores in terms of website is Gadjah Mada University. The university that have the lowest user satisfaction score is Diponegoro University. Based on the results of correlation between the average QUIS yield and average usability problems level, it can be concluded that both have a strong correlation, real and direction (r = 0621, p = 0.000). In other words, if the average QUIS score is higher, then it can be predicted conditions that website usability problems getting lower. UNHAS website has the highest usability performance with the smallest score is based on the results of normalization (5.8205), while UNDIP website has the lowest usability performance with the largest score (23.4430). Changes of UIN Jakarta website in 2017 compared to 2014 are adding breadcrumps navigation, a drop-down menu feature on the menu bar, and search engine. While on the UI website 2017 has added 7 menu bars from the only 5 menu bars originally, then on UNDIP website has used the menu bar at the top position (header) after previously only use the links and also added the email address and links to UNDIP social medias.How to Cite : Ichsani, Y. (2017). EVALUASI PERFORMA USABILITY SITUS-SITUS WEB PERGURUAN TINGGI NEGERI DI INDONESIA YANG TERAKREDITASI “A” TAHUN 2013 SERTA PERBANDINGAN KONDISI SITUS WEB TAHUN 2014 DAN 2017. Jurnal Teknik Informatika, 10(2), 93-108. doi:10.15408/jti.v10i2.6824Permalink/DOI: http://dx.doi.org/10.15408/jti.v10i2.6824","authors":["Yuditha Ichsani"],"meta":["January 2018","DOI:10.15408/jti.v10i2.6824"],"references":["235287027_Informetric_analyses_on_the_world_wide_web_Methodological_approaches_to_'webometrics'","220591866_The_DeLone_and_McLean_Model_of_Information_Systems_Success_A_Ten-Year_Update","26445674_Data_Mining_A_Preprocessing_Engine","314566512_Criteria_for_the_development_of_effective_university_Web_sites","313177619_The_Delone_and_Mclean_information_system_success_A_ten_years_update","272829776_Measuring_the_User_Experience_Interactive_Technologies_Collecting_Analyzing_and_Presenting_Usability_Metrics","267934261_NIST_Guide_to_the_Processes_Approach_for_Improving_the_Usability_of_Electronic_Health_Records","242375192_Usability_engineering_at_a_discount","31656164_Handbook_of_Usability_Testing_How_to_Plan_Design_and_Conduct_Effective_Tests"]}