{"id":"322878459_The_development_and_application_of_bioinformatics_core_competencies_to_improve_bioinformatics_training_and_education","abstract":"Bioinformatics is recognized as part of the essential knowledge base of numerous career paths in biomedical research and healthcare. However, there is little agreement in the field over what that knowledge entails or how best to provide it. These disagreements are compounded by the wide range of populations in need of bioinformatics training, with divergent prior backgrounds and intended application areas. The Curriculum Task Force of the International Society of Computational Biology (ISCB) Education Committee has sought to provide a framework for training needs and curricula in terms of a set of bioinformatics core competencies that cut across many user personas and training programs. The initial competencies developed based on surveys of employers and training programs have since been refined through a multiyear process of community engagement. This report describes the current status of the competencies and presents a series of use cases illustrating how they are being applied in diverse training contexts. These use cases are intended to demonstrate how others can make use of the competencies and engage in the process of their continuing refinement and application. The report concludes with a consideration of remaining challenges and future plans.","authors":["Nicola Mulder","Russell Schwartz","Michelle D Brazas","Cath Brooksbank"],"meta":["February 2018PLoS Computational Biology 14(2):e1005772","DOI:10.1371/journal.pcbi.1005772"],"references":["303086249_Applying_Evaluating_and_Refining_Bioinformatics_Core_Competencies_An_Update_from_the_Curriculum_Task_Force_of_ISCB's_Education_Committee","290210252_The_CourseSource_Bioinformatics_Learning_Framework","285543038_H3ABioNet_a_sustainable_Pan-African_Bioinformatics_Network_for_Human_Heredity_and_Health_in_Africa","260610641_Bioinformatics_Curriculum_Guidelines_Toward_a_Definition_of_Core_Competencies","228116304_A_report_of_the_Curriculum_Task_Force_of_the_ISCB_Education_Committee","235465787_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives"]}