{"id":"322889029_Measuring_Structural_Similarity_Between_RDF_Graphs","abstract":"In the latest years, there has been a huge effort to deploy large amounts of data, making it available in the form of RDF data thanks, among others, to the Linked Data initiative. In this context, using shared ontologies has been crucial to gain interoperability, and to be able to integrate and exploit third party datasets. However, using the same ontology does not suffice to successfully query or integrate external data within your own dataset: the actual usage of the vocabulary (e.g., which concepts have instances, which properties are actually populated and how, etc.) is crucial for these tasks. Being able to compare different RDF graphs at the actual usage level would indeed help in such situations. Unfortunately, the complexity of graph comparison is an obstacle to the scalability of many approaches.\n\nIn this article, we present our structural similarity measure, designed to compare structural similarity of low-level data between two different RDF graphs according to the patterns they share. To obtain such patterns, we leverage a data mining method (KRIMP) which allows to extract the most descriptive patterns appearing in a transactional database. We adapt this method to the particularities of RDF data, proposing two different conversions for an RDF graph. Once we have the descriptive patterns, we evaluate how much two graphs can compress each other to give a numerical measure depending on the common data structures they share. We have carried out several experiments to show its ability to capture the structural differences of actual vocabulary usage.","authors":["Pierre Maillot","Carlos Bobed"],"meta":["April 2018","DOI:10.1145/3167132.3167342","Conference: 33rd ACM/SIGAPP Symposium On Applied Computing (SAC 2018), SWA trackAt: Pau, France"],"references":["317177489_Entity_Deduplication_on_ScholarlyData","303884143_Graph-FCA_in_Practice","298070201_Measuring_Semantic_Distance_for_Linked_Open_Data-enabled_Recommender_Systems","283765412_Consistency_Evaluation_of_RDF_Data_How_Data_and_Updates_are_Relevant","275722081_XML_clustering_A_review_of_structural_approaches","305077157_A_Semantic_Similarity_Measure_for_Linked_Data_An_Information_Content-Based_Approach","302896838_Minimum_Description_Length_Principle","301953430_Abstraction_Refinement_for_Ontology_Materialization","301953150_The_WebDataCommons_Microdata_RDFa_and_Microformat_Dataset_Series","289707166_Semantic_Web_in_data_mining_and_knowledge_discovery_A_comprehensive_survey"]}