{"id":"322810419_A_Brief_Review_of_Facial_Emotion_Recognition_Based_on_Visual_Information","abstract":"Facial emotion recognition (FER) is an important topic in the fields of computer vision and artificial intelligence owing to its significant academic and commercial potential. Although FER can be conducted using multiple sensors, this review focuses on studies that exclusively use facial images, because visual expressions are one of the main information channels in interpersonal communication. This paper provides a brief review of researches in the field of FER conducted over the past decades. First, conventional FER approaches are described along with a summary of the representative categories of FER systems and their main algorithms. Deep-learning-based FER approaches using deep networks enabling “end-to-end” learning are then presented. This review also focuses on an up-to-date hybrid deep-learning approach combining a convolutional neural network (CNN) for the spatial features of an individual frame and long short-term memory (LSTM) for temporal features of consecutive frames. In the later part of this paper, a brief review of publicly available evaluation metrics is given, and a comparison with benchmark results, which are a standard for a quantitative comparison of FER researches, is described. This review can serve as a brief guidebook to newcomers in the field of FER, providing basic knowledge and a general understanding of the latest state-of-the-art studies, as well as to experienced researchers looking for productive directions for future work.","authors":["Byoungchul Ko"],"meta":["January 2018Sensors 18(2):401","DOI:10.3390/s18020401"],"references":["320971322_Deep_Structured_Learning_for_Facial_Action_Unit_Intensity_Estimation","319770438_Long-Term_Recurrent_Convolutional_Networks_for_Visual_Recognition_and_Description","318671014_Eyemotion_Classifying_facial_expressions_in_VR_using_eye-tracking_cameras","345714468_Learning_Spatial_and_Temporal_Cues_for_Multi-Label_Facial_Action_Unit_Detection","330179655_Communication_Without_Words","320827688_Driver_Facial_Landmark_Detection_in_Real_Driving_Situation","319277663_Facial_Expression_Recognition_Using_Enhanced_Deep_3D_Convolutional_Neural_Networks","317871387_Multi_angle_optimal_pattern-based_deep_learning_for_automatic_facial_expression_recognition","317202478_Genetic_Algorithm_Based_Filter_Bank_Design_for_Light_Convolutional_Neural_Network","316708837_A_Quick_Review_of_Deep_Learning_in_Facial_Expression"]}