{"id":"322834716_The_growth_and_evolution_of_cardiovascular_magnetic_resonance_A_20-year_history_of_the_Society_for_Cardiovascular_Magnetic_Resonance_SCMR_annual_scientific_sessions","abstract":"Background and purpose: \nThe purpose of this work is to summarize cardiovascular magnetic resonance (CMR) research trends and highlights presented at the annual Society for Cardiovascular Magnetic Resonance (SCMR) scientific sessions over the past 20 years.\n\nMethods: \nScientific programs from all SCMR Annual Scientific Sessions from 1998 to 2017 were obtained. SCMR Headquarters also provided data for the number and the country of origin of attendees and the number of accepted abstracts according to type. Data analysis included text analysis (key word extraction) and visualization by 'word clouds' representing the most frequently used words in session titles for 5-year intervals. In addition, session titles were sorted into 17 major subject categories to further evaluate research and clinical CMR trends over time.\n\nResults: \nAnalysis of SCMR annual scientific sessions locations, attendance, and number of accepted abstracts demonstrated substantial growth of CMR research and clinical applications. As an international field of study, significant growth of CMR was documented by a strong increase in SCMR scientific session attendance (> 500%, 270 to 1406 from 1998 to 2017, number of accepted abstracts (> 700%, 98 to 701 from 1998 to 2018) and number of international participants (42-415% increase for participants from Asia, Central and South America, Middle East and Africa in 2004-2017). 'Word clouds' based evaluation of research trends illustrated a shift from early focus on 'MRI technique feasibility' to new established techniques (e.g. late gadolinium enhancement) and their clinical applications and translation (key words 'patient', 'disease') and more recently novel techniques and quantitative CMR imaging (key words 'mapping', 'T1', 'flow', 'function'). Nearly every topic category demonstrated an increase in the number of sessions over the 20-year period with 'Clinical Practice' leading all categories. Our analysis identified three growth areas 'Congenital', 'Clinical Practice', and 'Structure/function/flow'.\n\nConclusion: \nThe analysis of the SCMR historical archives demonstrates a healthy and internationally active field of study which continues to undergo substantial growth and expansion into new and emerging CMR topics and clinical application areas.","authors":["Daniel C Lee","Michael Markl","Erica Dall'Armellina","Yuchi Han"],"meta":["December 2018Journal of Cardiovascular Magnetic Resonance 20(1)","DOI:10.1186/s12968-018-0429-z"],"references":["320292533_Clinical_recommendations_for_cardiovascular_magnetic_resonance_mapping_of_T1_T2_T2_and_extracellular_volume_A_consensus_statement_by_the_Society_for_Cardiovascular_Magnetic_Resonance_SCMR_endorsed_by_","320022210_Representation_of_cardiovascular_magnetic_resonance_in_the_AHA_ACC_guidelines","311104714_Cardiac_T1_Mapping_and_Extracellular_Volume_ECV_in_clinical_practice_A_comprehensive_review","301733232_Cardiovascular_magnetic_resonance_in_rheumatology_Current_status_and_recommendations_for_use","291555136_Role_of_cardiovascular_magnetic_resonance_in_the_guidelines_of_the_European_Society_of_Cardiology","281815682_Cardiovascular_magnetic_resonance_phase_contrast_imaging","280968508_4D_flow_cardiovascular_magnetic_resonance_consensus_statement","263710759_Effect_of_the_2010_task_force_criteria_on_reclassification_of_cardiovascular_magnetic_resonance_criteria_for_arrhythmogenic_right_ventricular_cardiomyopathy","317388117_The_Future_of_Cardiovascular_Magnetic_Resonance_Imaging","299567804_Accelerated_MRI_for_the_assessment_of_cardiac_function"]}