{"id":"322874093_Data_Synchronization_Model_for_Heterogeneous_Mobile_Databases_and_Server-side_Database","abstract":"Mobile devices, because they can be used to access corporate information anytime anywhere, have recently received considerable attention, and several research efforts have been tailored towards addressing data synchronization problems. However, the solutions are either vendor specific or homogeneous in nature. This paper proposed Heterogeneous Mobile Database Synchronization Model (HMDSM) to enable all mobile databases (regardless of their individual differences) and participate in any data synchronization process. To accomplish this, an experimental approach (exploratory and confirmatory) was employed. Also existing models and algorithms are classified, protracted and applied. All database peculiar information, such as trigger, timestamp and meta-data are eliminated. A listener is added to listen to any operation performed from either side. To prove its performance, the proposed model underwent rigorous experimentation and testing. X² test was used to analyze the data generated from the experiment. Results show the feasibility of having an approach which can handle database synchronization between heterogeneous mobile databases and the server. The proposed model does not only prove its generic nature to all mobile databases but also reduces the use of mobile resources; thus suitable for mobile devices with low computing power to proficiently process large amount of data.","authors":["Abdullahi Abubakar Imam","Shuib Basri","Rohiza Ahmad","Abdul Rehman Gilal"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(1)","DOI:10.14569/IJACSA.2018.090172"],"references":["312835365_Synchronization_Algorithm_for_Remote_Heterogeneous_Database_Environment","284803966_Data_synchronization_between_mobile_devices_and_server-side_databases_A_systematic_literature_review","283602542_MySQLite_Sync_Middleware_for_stored_data_synchronization_in_mobile_devices_and_DBMSs","303513615_Release_Practices_for_Mobile_Apps_--_What_do_Users_and_Developers_Think","283883870_A_Stateful_Database_Synchronization_Approach_for_Mobile_Devices","271547528_MRDMS-mobile_replicated_database_management_synchronization","269035230_Database_synchronization_model_for_mobile_devices","261302047_Synchronization_wireless_algorithm_based_on_message_digest_SWAMD_for_mobile_device_database","251923177_Optimization_Of_Heterogeneous_Databases_Data_Synchronization_In_WAN_By_Virtual_Log_Compression","246392539_Study_research_design"]}