{"id":"322898364_Implementation_of_multiple_interpretation_data_model_concepts_in_CIDOC_CRM_and_compatible_models","abstract":"p>Modelling cultural heritage is a research topic shared by a broad scientific community. Although this subject has been widely studied, it seems that some aspects still have to be tackled. This paper describes two CIDOC (ICOM’s International Committee for Documentation) Conceptual Reference Model (CRM) extension proposals (A & B) dedicated to structuring knowledge concerning historical objects and historical events. It focuses on multiple interpretations and sequential reality, this last being a concept which does not exist in CIDOC CRM but was originally developed in another conceptual model, the Multiple Interpretation Data Model (MIDM). To begin, an extensive description of MIDM concepts is given as well as a recall of its main peculiarities. It is followed by a mapping proposed to translate MIDM concepts into ontologies devoted to describing cultural heritage entities and activities, the CIDOC CRM and compatible models. Unfortunately, some MIDM concepts are not covered by this mapping because they do not match with existing CRM entities and properties, and this paper explains why an extension is necessary. It describes how the two versions of the extension proposal cover the missing MIDM concepts. One of these two versions, the proposal A, has been implemented as ontology in Protégé and has been tested through an instantiation phase using a real example. This instantiation phase is fully detailed. It shows that proposal A works coherently with CRM ontologies. On another hand, instantiation phase highlights improvements needs such as recording chronology in a structured way.\n\nHighlights: \n\nCultural Heritage modelling involves two different ontological concepts: reality and information held about it.\n\nHistorical Objects existence is a sequence made by events, stability periods and changes affecting it.\n\nMultiple Interpretation Data Model mapping to CIDOC CRM and its extension proposal take into account difference between reality and information. They also manage sequence concept.\n</ul","authors":["Muriel Van Ruymbeke","Pierre Hallot","Gilles-Antoine Nys","Roland Billen"],"meta":["February 2018Virtual Archaeology Review 9(19)","DOI:10.4995/var.2018.8884"],"references":["319281041_A_SURVEY_ON_TOPICS_RESEARCHERS_AND_CULTURES_IN_THE_FIELD_OF_DIGITAL_HERITAGE","316478165_Modelling_of_Static_and_Moving_Objects_Digitizing_Tangible_and_Intangible_Cultural_Heritage","310438909_Development_of_a_platform_recommending_3D_and_spectral_digitisation_strategies","308944041_Expressing_reliability_with_CIDOC_CRM","306327468_Harmonizing_the_CRMba_and_CRMarchaeo_models","306089508_CRMgeo_A_spatiotemporal_extension_of_CIDOC-CRM","305628507_Process_concept_or_thing_Some_initial_considerations_in_the_ontological_modelling_of_architecture","303041230_Enhancing_Spatio-Temporal_Identity_States_of_Existence_and_Presence","301618275_Modeliser_les_objets_historiques_pour_l'etude_des_dynamiques_urbaines_dans_la_longue_duree_Le_modele_OH_FET_objet_historique_fonction_espace_temps","282537765_CRMba_a_CRM_extension_for_the_documentation_of_standing_buildings"]}