{"id":"322877594_Comparing_fixed_sampling_with_minimizer_sampling_when_using_k-mer_indexes_to_find_maximal_exact_matches","abstract":"Bioinformatics applications and pipelines increasingly use k-mer indexes to search for similar sequences. The major problem with k-mer indexes is that they require lots of memory. Sampling is often used to reduce index size and query time. Most applications use one of two major types of sampling: fixed sampling and minimizer sampling. It is well known that fixed sampling will produce a smaller index, typically by roughly a factor of two, whereas it is generally assumed that minimizer sampling will produce faster query times since query k-mers can also be sampled. However, no direct comparison of fixed and minimizer sampling has been performed to verify these assumptions. We systematically compare fixed and minimizer sampling using the human genome as our database. We use the resulting k-mer indexes for fixed sampling and minimizer sampling to find all maximal exact matches between our database, the human genome, and three separate query sets, the mouse genome, the chimp genome, and an NGS data set. We reach the following conclusions. First, using larger k-mers reduces query time for both fixed sampling and minimizer sampling at a cost of requiring more space. If we use the same k-mer size for both methods, fixed sampling requires typically half as much space whereas minimizer sampling processes queries only slightly faster. If we are allowed to use any k-mer size for each method, then we can choose a k-mer size such that fixed sampling both uses less space and processes queries faster than minimizer sampling. The reason is that although minimizer sampling is able to sample query k-mers, the number of shared k-mer occurrences that must be processed is much larger for minimizer sampling than fixed sampling. In conclusion, we argue that for any application where each shared k-mer occurrence must be processed, fixed sampling is the right sampling method.","authors":["Meznah Almutairy","Eric Torng"],"meta":["February 2018PLoS ONE 13(2):e0189960","DOI:10.1371/journal.pone.0189960"],"references":["318285872_The_effects_of_sampling_on_the_efficiency_and_accuracy_of_k-mer_indexes_Theoretical_and_empirical_comparisons_using_the_human_genome","276360302_A_long_fragment_aligner_called_ALFALFA","316858415_Proceedings_of_the_VLDB_Endowment","316857981_Proceedings_of_the_VLDB_Endowment","315920621_A_Fast_Approximate_Algorithm_for_Mapping_Long_Reads_to_Large_Reference_Databases","305910088_Compact_Universal_k-mer_Hitting_Sets","286302053_Minimap_and_miniasm_Fast_mapping_and_de_novo_assembly_for_noisy_long_sequences","284650481_Improved_Tools_for_Biological_Sequence_Comparison","270051399_A_map_of_human_genome_sequence_variation_containing_142_million_single_nucleotide_polymorphisms","268335908_E-MEM_Efficient_computation_of_Maximal_Exact_Matches_for_very_large_genomes"]}