{"id":"322898578_A_Bootstrap_Based_Measure_Robust_to_the_Choice_of_Normalization_Methods_for_Detecting_Rhythmic_Features_in_High_Dimensional_Data","abstract":"Motivation: Gene-expression data obtained from high throughput technologies are subject to various sources of noise and accordingly the raw data are pre-processed before formally analyzed. Normalization of the data is a key pre-processing step, since it removes systematic variations across arrays. There are numerous normalization methods available in the literature. Based on our experience, in the context of oscillatory systems, such as cell-cycle, circadian clock, etc., the choice of the normalization method may substantially impact the determination of a gene to be rhythmic. Thus rhythmicity of a gene can purely be an artifact of how the data were normalized. Since the determination of rhythmic genes is an important component of modern toxicological and pharmacological studies, it is important to determine truly rhythmic genes that are robust to the choice of a normalization method. Results: In this paper we introduce a rhythmicity measure and a bootstrap methodology to detect rhythmic genes in an oscillatory system. Although the proposed methodology can be used for any high-throughput gene expression data, in this paper we illustrate the proposed methodology using several publicly available circadian clock microarray gene-expression datasets. We demonstrate that the choice of normalization method has very little effect on the proposed methodology. Specifically, for any pair of normalization methods considered in this paper, the resulting values of the rhythmicity measure are highly correlated. Thus it suggests that the proposed measure is robust to the choice of a normalization method. Consequently, the rhythmicity of a gene is potentially not a mere artifact of the normalization method used. Lastly, as demonstrated in the paper, the proposed bootstrap methodology can also be used for simulating data for genes participating in an oscillatory system using a reference dataset.","authors":["Yolanda Larriba","Cristina Rueda","Miguel A. Fernández","Shyamal Peddada"],"meta":["February 2018Frontiers in Genetics 9","DOI:10.3389/fgene.2018.00024"],"references":["307871389_Order_restricted_inference_for_oscillatory_systems_for_detecting_rhythmic_signals","289531056_CrossNorm_A_novel_normalization_strategy_for_microarray_data_in_cancers","280031340_Determination_of_Temporal_Order_among_the_Components_of_an_Oscillatory_System","275049992_Recent_Advances_in_Circadian_Rhythms_in_Cardiovascular_System","268984448_A_circadian_gene_expression_atlas_in_mammals_Implications_for_biology_and_medicine","344713686_An_Introduction_to_the_Bootstrap","313598900_Analysis_of_two-way_tables_by_medians","283679863_Exploration_Normalization_and_Summaries_of_High_Density_Oligonucleotide_Array_Probe_Level_Data","277493177_Summaries_of_Affymetrix_GeneChip_probe_level_data","269469651_Theory_and_Applications_of_Correspondence_Analysis"]}