{"id":"322886188_Centralized_and_distributed_cognitive_task_processing_in_the_human_connectome","abstract":"A key question in modern neuroscience is how cognitive changes in a human brain can be quantified and captured by functional connectomes (FC) . A systematic approach to measure pairwise functional distance at different brain states is lacking. This would provide a straight-forward way to quantify differences in cognitive processing across tasks; also, it would help in relating these differences in task-based FCs to the underlying structural network. Here we propose a framework, based on Jensen-Shannon divergence,to map the task-rest connectivity divergence between tasks and resting-state FC. We show how this information theoretical measure allows for quantifying connectivity changes in distributed and centralized processing in functional networks. We study resting-state and seven tasks from the Human Connectome Project dataset to obtain the most divergent links across tasks. We investigate how these changes are associated to different functional brain networks, and use the proposed measure to infer changes in the information processing regimes. Furthermore, we show how the FC divergence with respect to resting state is shaped by structural connectivity, and to what extent this relationship depends on the task. This framework provides a well grounded mathematical quantification of connectivity changes associated to cognitive processing in large-scale brain networks.","authors":["Enrico Amico","Alex Arenas","Joaquín Goñi"],"meta":["January 2018Network Neuroscience 3(2)","DOI:10.1162/netn_a_00072","Project: Brain Connectomics, Network science"],"references":["326239717_Subgraphs_of_functional_brain_networks_identify_dynamical_constraints_of_cognitive_control","320746261_Structure-function_relationships_during_segregated_and_integrated_network_states_of_human_brain_functional_connectivity","320473059_Cognitive_task_information_is_transferred_between_brain_regions_via_resting-state_network_topology","320280097_Mapping_Hybrid_Functional-structural_Connectivity_Traits_in_the_Human_Connectome","315790512_Can_brain_state_be_manipulated_to_emphasize_individual_differences_in_functional_connectivity","311066573_Functional_Alignment_with_Anatomical_Networks_is_Associated_with_Cognitive_Flexibility","309455037_Evidence_for_Two_Independent_Factors_that_Modify_Brain_Networks_to_Meet_Task_Goals","309294930_The_Dynamics_of_Functional_Brain_Networks_Integrated_Network_States_during_Cognitive_Task_Performance","308993392_Activity_flow_over_resting-state_networks_shapes_cognitive_task_activations","311269724_Fundamentals_of_Brain_Network_Analysis"]}