{"id":"322897107_Facial_Emotion_Recognition_A_Survey_and_Real-World_User_Experiences_in_Mixed_Reality","abstract":"Extensive possibilities of applications have made emotion recognition ineluctable and challenging in the field of computer science. The use of non-verbal cues such as gestures, body movement, and facial expressions convey the feeling and the feedback to the user. This discipline of Human-Computer Interaction places reliance on the algorithmic robustness and the sensitivity of the sensor to ameliorate the recognition. Sensors play a significant role in accurate detection by providing a very high-quality input, hence increasing the efficiency and the reliability of the system. Automatic recognition of human emotions would help in teaching social intelligence in the machines. This paper presents a brief study of the various approaches and the techniques of emotion recognition. The survey covers a succinct review of the databases that are considered as data sets for algorithms detecting the emotions by facial expressions. Later, mixed reality device Microsoft HoloLens (MHL) is introduced for observing emotion recognition in Augmented Reality (AR). A brief introduction of its sensors, their application in emotion recognition and some preliminary results of emotion recognition using MHL are presented. The paper then concludes by comparing results of emotion recognition by the MHL and a regular webcam.","authors":["Dhwani Mehta","Mohammad Faridul Haque Siddiqui","Ahmad Yazdan Javaid"],"meta":["February 2018Sensors 18(2)","DOI:10.3390/s18020416","Project: Multi Modal Data Fusion"],"references":["309612049_EmotiW_2016_video_and_group-level_emotion_recognition_challenges","281457501_Facial_Expression_Recognition_A_Survey","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","313400482_Image_based_Static_Facial_Expression_Recognition_with_Multiple_Deep_Network_Learning","306218037_Learning_multiple_layers_of_features_from_tiny_images","305907172_Literature_survey_on_face_and_face_expression_recognition","298708402_A_survey_on_human_emotion_recognition_approaches_databases_and_applications","292024732_The_ar_face_database_Technical_report_CVC_Technical","289569787_Survey_on_RGB_3D_Thermal_and_Multimodal_Approaches_for_Facial_Expression_Recognition_History_Trends_and_Affect-Related_Applications","286932057_Recurrent_Neural_Networks_for_Emotion_Recognition_in_Video"]}