{"id":"322820157_Post-task_Effects_on_EEG_Brain_Activity_Differ_for_Various_Differential_Learning_and_Contextual_Interference_Protocols","abstract":"A large body of research has shown superior learning rates in variable practice compared to repetitive practice. More specifically, this has been demonstrated in the contextual interference (CI) and in the differential learning (DL) approach that are both representatives of variable practice. Behavioral studies have indicate different learning processes in CI and DL. Aim of the present study was to examine immediate post-task effects on electroencephalographic (EEG) brain activation patterns after CI and DL protocols that reveal underlying neural processes at the early stage of motor consolidation. Additionally, we tested two DL protocols (gradual DL, chaotic DL) to examine the effect of different degrees of stochastic fluctuations within the DL approach with a low degree of fluctuations in gradual DL and a high degree of fluctuations in chaotic DL. Twenty-two subjects performed badminton serves according to three variable practice protocols (CI, gradual DL, chaotic DL), and a repetitive learning protocol in a within-subjects design. Spontaneous EEG activity was measured before, and immediately after each 20-min practice session from 19 electrodes. Results showed distinguishable neural processes after CI, DL, and repetitive learning. Increases in EEG theta and alpha power were obtained in somatosensory regions (electrodes P3, P7, Pz, P4, P8) in both DL conditions compared to CI, and repetitive learning. Increases in theta and alpha activity in motor areas (electrodes C3, Cz, C4) were found after chaotic DL compared to gradual DL, and CI. Anterior areas (electrodes F3, F7, Fz, F4, F8) showed increased activity in the beta and gamma bands after CI. Alpha activity was increased in occipital areas (electrodes O1, O2) after repetitive learning. Post-task EEG brain activation patterns suggest that DL stimulates the somatosensory and motor system, and engages more regions of the cortex than repetitive learning due to a tighter stimulation of the motor and somatosensory system during DL practice. CI seems to activate specifically executively controlled processing in anterior brain areas. We discuss the obtained patterns of post-training EEG traces as evidence for different underlying neural processes in CI, DL, and repetitive learning at the early stage of motor learning.","authors":["Diana Henz","Alexander John","Christian Merz","Wolfgang I. Schöllhorn"],"meta":["January 2018Frontiers in Human Neuroscience 12","DOI:10.3389/fnhum.2018.00019","Project: Effects of differential learning dependent on type of movement, age, level of performance, sex, or individual characteristics."],"references":["332253560_Vergleich_von_Techniktrainingsansatzen_zum_Tennisaufschlag","320357447_EEG_BRAIN_ACTIVATION_PATTERNS_IN_DIFFERENTIAL_AND_REPETITIVE_SOCCER_DRIBBLING_AND_SHOOTING_TRAINING","309343533_Differential_Training_Facilitates_Early_Consolidation_in_Motor_Learning","323144347_DIFFERENTIAL_TRAINING_AS_AN_INTERVENTION_STRATEGY_TO_PREVENT_CHOKING_UNDER_PRESSURE_IN_BASKETBALL_FREE-THROW","317662779_Untersuchung_der_Auswirkungen_verschiedener_Variationsbereiche_des_differenziellen_Lernens_und_Lehrens_im_weiten_Sinn_auf_ausgewahlte_technische_Grundfertigkeiten_im_Hallenhockey_Effects_of_several_am","316660269_Laser_Theory","309528303_Thermodynamic_theory_of_structure_stability_and_fluctuations","293731625_Invited_commentary_Differential_learning_is_different_from_contextual_interference_learning","284445928_Differenzielles_Lernen_im_Volleyball_Ein_Unterrichtsvorhaben_zur_Verbesserung_der_Annahme_differential_learning_in_Volleyball","284192543_Differenzielles_Lernen_im_Kugelstossen"]}