{"id":"322831948_Growing_popularity_of_Post_Graduate_Diploma_programs_in_IT_and_Computing_in_Indian_Private_Universities_An_Overview","abstract":"Computing and Information Technology is one of the emerging and popular subjects in today’s age. Computing and IT subject today becomes the field of fields. Various domain and disciplines which are associated with the information mechanism and digitalization may be treated within the branch of Computing and Information Technology. There are many levels available in this field ranging from certificate, diploma, advanced diploma, post graduate diploma to university leading masters, bachelors and doctoral programs. In a university system, Computing and Information Technology programs are available as a field of professional study and also as an academic branch of study. Although apart from the university system, Computing and Information Technology programs are available also in the computer related foundation, association, institutions, training division etc. The program of Bachelors, Masters, and Doctoral are offered mainly at the university level whereas all the remaining level of study being offered in other educational institutions. However, one level called ‘Post Graduate Diploma’ is offered both at the university systems and other Computing and Information Technology dealing organizations. Interestingly the craze and popularity of such programs have been increased in recent past due to their benefits and power to move higher level including masters and doctoral degree. This is a conceptual paper dedicated to the offering of PG Diploma program in the field and mainly concentrated on offering the program at the university level. This paper highlights the possibilities and opportunities of offering the PG Diploma program by Indian Private Universities on Computing and Information Technology field mainly Computer Applications.","authors":["Sreeramana Aithal","P.K. Paul"],"meta":["January 2018","DOI:10.5281/zenodo.1162290","Project: Private University"],"references":["322138395_Computing_Allied_Engineering_Domain_in_India_with_reference_to_Private_Universities_A_Case_Study_of_Bachelors_Programs","322138390_MCA_Information_Science_and_Management_The_Next_Generation_Interdisciplinary_specialization_for_Social_Business_Health_Mathematical_Sciences-A_Step_for_promoting_Digital_Humanities","226085821_Financing_higher_education_in_India","225972339_The_dilemma_of_change_in_Indian_higher_education","284866579_Balanced_scorecards_in_managing_higher_education_institutions_An_Indian_perspective","272390085_Information_Science_A_Potential_interdisciplinary_field_with_Historical_Perspectives_and_Future_Potentials","267369946_Higher_Education_in_India_Structure_Statistics_and_Challenges","240542929_Transition_from_higher_education_as_a_public_good_to_higher_education_as_a_private_good_the_saga_of_Indian_experience","229792055_Higher_Education_in_India_Growth_Concerns_and_Change_Agenda","228294594_Getting_the_Numbers_Right_International_Engineering_Education_in_the_United_States_China_and_India"]}