{"id":"322851669_FastGCN_Fast_Learning_with_Graph_Convolutional_Networks_via_Importance_Sampling","abstract":"The graph convolutional networks (GCN) recently proposed by Kipf and Welling are an effective graph model for semi-supervised learning. This model, however, was originally designed to be learned with the presence of both training and test data. Moreover, the recursive neighborhood expansion across layers poses time and memory challenges for training with large, dense graphs. To relax the requirement of simultaneous availability of test data, we interpret graph convolutions as integral transforms of embedding functions under probability measures. Such an interpretation allows for the use of Monte Carlo approaches to consistently estimate the integrals, which in turn leads to a batched training scheme as we propose in this work---FastGCN. Enhanced with importance sampling, FastGCN not only is efficient for training but also generalizes well for inference. We show a comprehensive set of experiments to demonstrate its effectiveness compared with GCN and related models. In particular, training is orders of magnitude more efficient while predictions remain comparably accurate.","authors":["Jie Chen","Tengfei Ma","Cao Xiao"],"meta":["January 2018","Conference: International Conference on Learning Representations (ICLR)"],"references":["317399572_Inductive_Representation_Learning_on_Large_Graphs","316780438_Graph_Embedding_Techniques_Applications_and_Performance_A_Survey","310825144_Asymmetric_Transitivity_Preserving_Graph_Embedding","315795307_Neural_Message_Passing_for_Quantum_Chemistry","307991731_Semi-Supervised_Classification_with_Graph_Convolutional_Networks","305997704_node2vec_Scalable_Feature_Learning_for_Networks","304641430_Convolutional_Neural_Networks_on_Graphs_with_Fast_Localized_Spectral_Filtering","303302244_Learning_Convolutional_Neural_Networks_for_Graphs","284219934_Structural-RNN_Deep_Learning_on_Spatio-Temporal_Graphs","284219592_Gated_Graph_Sequence_Neural_Networks"]}