{"id":"322895757_Unplugged_cybersecurity_An_approach_for_bringing_computer_science_into_the_classroom","abstract":"The United States Naval Academy (USNA) STEM Center for Education and Outreach addresses an urgent Navy and national need for more young people to pursue careers in STEM fields through world-wide outreach to 17,000 students and 900 teachers per year. To achieve this mission, the STEM Center has developed a hands-on and inquiry-based methodology to be used with K-12 educators at professional development workshops and with students through camps, festivals and fairs, and STEM days.According to recent data, math and computer science (CS) are the fastest growing fields among STEM careers (US Bureau of Labor Statistics, 2016). The Computer Science for All initiative (2016) urges communities to bring more computer science education into the classroom to meet the rapidly rising need for more CS graduates. As a result, the USNA STEM Center has developed a number of unplugged (without a computer) cybersecurity modules to promote engagement and increase awareness. Topic areas include encryption, networking and social media, viruses and malware, programming, hardware components, authentication and authorization, and hacking.This article describes the methodology for developing unplugged computer science activities and adapting computer science undergraduate curriculum for K-12 educators and students as an introduction to complex computer science topics.","authors":["Rachel E Fees","Jennifer da Rosa","Sarah S Durkin","M. M. Murray"],"meta":["February 2018International Journal of Computer Science Education in Schools 2(1)","DOI:10.21585/ijcses.v2i1.21"],"references":["266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","262401690_Learning_to_Teach_Computer_Science_The_Need_for_a_Methods_Course","257137269_Bringing_Computer_Science_Back_Into_Schools_Lessons_from_the_UK","312959977_Women_planning_to_major_in_computer_science_Who_are_they_and_what_makes_them_unique","306920994_Screen_printed_logic_gates_employing_milled_p-silicon_as_an_active_material","285837006_Computer_science_outreach_in_an_elementary_school","274998933_What_Works_in_Professional_Development","232524016_Learning_Theories_An_Educational_Perspective","225966656_A_Deweyan_Perspective_on_Science_Education_Constructivism_Experience_and_Why_We_Learn_Science","220692915_Applied_cryptography_Protocols_algorithms_and_source_code_in_C_2nd_ed"]}