{"id":"322800395_PdPSO_The_fusion_of_primal-dual_interior_point_method_and_Particle_Swarm_Optimization_algorithm","abstract":"Particle Swarm Optimization (PSO) is a meta-heuristic algorithm that has been used to solve a variety of complex optimization problems. In spite of the acceptance of the algorithm in various fields, PSO still suffers from common issues such as premature convergence and local minima. This provides a platform for generating a variety of PSO variants. Although these variants are successful in addressing issues specific to a directed domain, they are still unable to resolve the issues effectively. The Interior-Point Methods (IPMs) are efficient tools for solving nonlinear optimization problems. On the one hand, the method is depicted as the most robust algorithm for solving large scale nonlinear optimization problems. On the other, similar to PSO, the methods are still plagued with several issues. We propose Primal-Dual Interior Point Particle Swarm Optimization (pdPSO) to resolve the shortcomings of a standard PSO without the limitations of the IPM methods. We applied the Primal Dual procedure to each particle in a finite number of iterations, and fed the PSO with the its output. We compared the performance of our new algorithm (pdPSO) with IPM and PSO using nine different dynamic benchmark functions. Our results revealed that pdPSO performed better than both the independent PSO algorithm and the IPM method. The proposed algorithm is not susceptible to premature convergence, and can better avoid local minima than conventional PSO, hence hypothetically it has the potential to perform better than many variants of PSO.","authors":["Emmanuel Gbenga Dada","Effirul Ikhwan Ramlan"],"meta":["January 2018Malaysian Journal of Computer Science 31(1):17-34","DOI:10.22452/mjcs.vol31no1.2"],"references":["323326795_A_generalized_direction_in_interior_point_method_for_monotone_linear_complementarity_problems","305078507_Opposition-Based_Adaptive_Fireworks_Algorithm","301817139_Implementation_of_Interior-point_Methods_for_LP_based_on_Krylov_Subspace_Iterative_Solvers_with_Inner-iteration_Preconditioning","298907378_Multiobjective_sorting-based_learning_particle_swarm_optimization_for_continuous_optimization","284716169_Ringed_Seal_Search_for_Global_Optimization_via_a_Sensitive_Search_Model","321614755_Handbook_of_Swarm_Intelligence_Concepts_Principles_and_Applications","312816335_Swarm_Intelligence","308815819_Improved_chicken_swarm_optimization","292603843_A_novel_particle_swarm_optimizer_hybridized_with_extremal_optimization","285705324_Advances_in_particle_swarm_optimization_algorithm","271881406_Particle_Swarm_Optimization_Technique_for_Solving_Economic_Emission_Dispatch_Problems","276795211_Convergence_of_Inner-Iteration_GMRES_Methods_for_Rank-Deficient_Least_Squares_Problems","276165925_Enhancing_firefly_algorithm_using_generalized_opposition-based_learning","273002355_Convex_Optimization","265493229_Inner-Iteration_Krylov_Subspace_Methods_for_Least_Squares_Problems"]}