{"id":"322837666_On_wave_breaking_for_Boussinesq-type_models","abstract":"We consider the issue of wave breaking closure for Boussinesq type models, and attempt at providing some more understanding of the sensitivity of some closure approaches to the numerical set-up, and in particular to mesh size. For relatively classical choices of weakly dispersive propagation models, we compare two closure strategies. The first is the hybrid method consisting in suppressing the dispersive terms in breaking regions, as initially suggested by Tonelli and Petti in 2009. The second is an eddy viscosity approach based on the solution of a a turbulent kinetic energy. The formulation follows early work by O. Nwogu in the 90’s, and some more recent developments by Zhang and co-workers (Ocean Mod. 2014), adapting it to be consistent with the wave breaking detection used here. We perform a study of the behaviour of the two closures for different mesh sizes, with attention to the possibility of obtaining grid independent results. Based on a classical shallow water theory, we also suggest some monitors to quantify the different contributions to the dissipation mechanism, differentiating those associated to the scheme from those of the partial differential equation. These quantities are used to analyze the dynamics of dissipation in some classical benchmarks, and its dependence on the mesh size. Our main results show that numerical dissipation contributes very little to the the results obtained when using eddy viscosity method. This closure shows little sensitivity to the grid, and may lend itself to the development and use of non-dissipative/energy conserving numerical methods. The opposite is observed for the hybrid approach, for which numerical dissipation plays a key role, and unfortunately is sensitive to the size of the mesh. In particular, when working, the two approaches investigated provide results which are in the same ball range and which agree with what is usually reported in literature. With the hybrid method, however, the inception of instabilities is observed at mesh sizes which vary from case to case, and depend on the propagation model. These results are comforted by numerical computations on a large number of classical benchmarks.","authors":["Maria Kazolea","Mario Ricchiuto"],"meta":["March 2018Ocean Modelling 123","DOI:10.1016/j.ocemod.2018.01.003"],"references":["320680295_R-adaptation_for_Shallow_Water_flows_conservation_well_balancedness_efficiency","309654027_Spilling_breakers_in_shallow_water_Applications_to_Favre_waves_and_to_the_shoaling_and_breaking_of_solitary_waves","304780640_A_new_high-order_energy-preserving_scheme_for_the_modified_Korteweg-de_Vries_equation","320751375_Wave_propagation_breaking_and_overtopping_on_a_2D_reef_A_comparative_evaluation_of_numerical_codes_for_tsunami_modelling","317756653_New_energy-preserving_finite_volume_element_scheme_for_the_korteweg-de_vries_equation","314600808_Numerical_Prediction_of_Breaking_Waves_and_Currents_with_a_Boussinesq_Model","313837123_A_Boussinesq_type_extension_of_the_GeoClaw_model_-_a_study_of_wave_breaking_phenomena_applying_dispersive_long_wave_models","313631710_Energy-preserving_and_stable_approximations_for_the_two-dimensional_shallow_water_equations","312911814_Numerical_methods_for_gasdynamic_systems_of_unstructured_meshes","307554201_Boussinesq_Models_and_Their_Application_to_Coastal_Processes_across_a_Wide_Range_of_Scales","301877549_A_discontinuous_Galerkin_method_for_a_new_class_of_Green-Naghdi_equations_on_simplicial_unstructured_meshes","295074025_r-adaptation_for_shallow_water_flows_well-balancedness_mass_conservation_and_efficiency","294733595_High_Order_Energy-Preserving_Method_of_the_Good_Boussinesq_Equation","285599438_High_Resolution_Schemes_for_Hyperbolic_Conservation_Laws","282181451_An_Entropy_Stable_Nodal_Discontinuous_Galerkin_Method_for_the_Two_Dimensional_Shallow_Water_Equations_on_Unstructured_Curvilinear_Meshes_with_Discontinuous_Bathymetry"]}