{"id":"322839334_Improving_programming_skills_in_engineering_education_through_problem-based_game_projects_with_Scratch","abstract":"Nowadays, programming skills are receiving widespread attention for different age groups alongside occupational education programs to better prepare individuals for their future careers. However, introducing programming concepts in an appropriate manner is a challenge in higher education. The main assumption of this study is that enhancing the classical introduction to programming courses through real-life problem-based game development with Scratch programming environment potentially improves the learners' programming skills and motivation. Accordingly, in this study, during one academic semester period, the Introduction to Programming course for engineering students is enriched up to a certain level through real-life game development projects with Scratch. The students are followed within a four-year period starting from freshman until their graduation. The progress of the students who have taken the Introduction to Programming course in enriched or classical form in the fourth year Senior-project course are evaluated. The results show that by slightly improving the course curriculum through real-life game development projects in the Scratch environment, students’ performance on the graduation projects improved significantly. As a conclusion, game-based learning, problem-based learning, visual programming and projects are technologies that can potentially help learners to perform better in the introduction to programming course, in turn affecting their performances in projects.","authors":["Damla Topalli","Nergiz Cagiltay"],"meta":["May 2018Computers & Education 120","DOI:10.1016/j.compedu.2018.01.011"],"references":["220140195_Computer_games_created_by_middle_school_girls_Can_they_be_used_to_measure_understanding_of_computer_science_concepts","222423950_Successful_implementation_of_user-centered_game_based_learning_in_higher_education_An_example_from_civil_engineering","220140261_The_effect_of_simulation_games_on_the_learning_of_computational_problem_solving","41888015_Creative_use_of_podcasting_in_higher_education_and_its_effect_on_competitive_agency"]}