{"id":"322842241_Inequalities_in_global_health_inequalities_research_A_50-year_bibliometric_analysis_1966-2015","abstract":"Background:\nIncreasing evidence shows that health inequalities exist between and within countries, and emphasis has been placed on strengthening the production and use of the global health inequalities research, so as to improve capacities to act. Yet, a comprehensive overview of this evidence base is still needed, to determine what is known about the global and historical scientific production on health inequalities to date, how is it distributed in terms of country income groups and world regions, how has it changed over time, and what international collaboration dynamics exist.\n\nMethods:\nA comprehensive bibliometric analysis of the global scientific production on health inequalities, from 1966 to 2015, was conducted using Scopus database. The historical and global evolution of the study of health inequalities was considered, and through joinpoint regression analysis and visualisation network maps, the preceding questions were examined.\n\nFindings:\n159 countries (via authorship affiliation) contributed to this scientific production, three times as many countries than previously found. Scientific output on health inequalities has exponentially grown over the last five decades, with several marked shift points, and a visible country-income group affiliation gradient in the initiation and consistent publication frequency. Higher income countries, especially Anglo-Saxon and European countries, disproportionately dominate first and co-authorship, and are at the core of the global collaborative research networks, with the Global South on the periphery. However, several country anomalies exist that suggest that the causes of these research inequalities, and potential underlying dependencies, run deeper than simply differences in country income and language.\n\nConclusions:\nWhilst the global evidence base has expanded, Global North-South research gaps exist, persist and, in some cases, are widening. Greater understanding of the structural determinants of these research inequalities and national research capacities is needed, to further strengthen the evidence base, and support the long term agenda for global health equity.","authors":["Lucinda Cash-Gibson","Diego Fernando Rojas Gualdrón","Juan M Pericas","Joan Benach"],"meta":["January 2018PLoS ONE 13(1):e0191901","DOI:10.1371/journal.pone.0191901","Projects: Individual and population health metricsPhD thesis: Global Health Inequalities Research Capacities"],"references":["320904506_Measuring_the_bias_against_low-income_country_research_An_Implicit_Association_Test","319403690_Donorfunding_health_policy_and_systems_research_in_low-_and_middle-income_countries_How_much_from_where_and_to_whom","308917713_Health_inequalities_research_in_India_a_review_of_trends_and_themes_in_the_literature_since_the_1990s","308519960_Capacidades_de_investigacion_sobre_determinantes_sociales_de_la_salud_en_Brasil_Colombia_y_Mexico","345827944_Epistemologies_of_the_South_Justice_Against_Epistemicide","321248179_Brain_Drain_from_Developing_Countries_How_can_Brain_Drain_be_Converted_into_Wisdom_Gain","317521509_Impacto_del_informe_de_la_Comision_sobre_Determinantes_Sociales_de_la_Salud_cuatro_anos_despues","317086818_Bibliometrics_as_a_Tool_for_Supporting_Prospective_RD_Decision-Making_in_the_Health_Sciences","316657835_Taking_Over_the_Asylum","309632833_North-south_collaboration_and_capacity_development_in_global_health_research_in_low-_and_middle-income_countries_-_The_ARCADE_projects"]}