{"id":"322961207_Constructing_Spatiotemporal_Load_Profiles_of_Transit_Vehicles_with_Multiple_Data_Sources","abstract":"Obtaining load profiles of transit vehicles has remained a difficult task for transit operators due to technical and financial constraints. Although a significant advance in transit demand and supply data collection has been achieved over the past decade, information related to load profiles at the vehicular level is either impossible or very difficult to retrieve from them. It is not even uncommon to see that these data are underutilized by transit operators due to considerable deficiencies and shortcomings in the data themselves, and/or the processing algorithms needed to process them. This study is therefore dedicated to addressing this challenge that has largely been overlooked by both researchers and practitioners. First, we identify the issues which hinder the construction of load profiles based on three prevailing transit data sources, including automatic fare collection (AFC); automatic vehicle location (AVL); and general transit feed specification (GTFS) data. Second, we develop a methodology that can sequentially address all the issues and output desirable vehicle load profiles. The methodology consists of four steps, including (1) data pre-processing; (2) matching trips in GTFS and AVL; (3) matching passenger rides to vehicle trajectories; (4) improving vehicle trajectories. The resulting spatiotemporal load profiles of transit vehicles enable detailed investigation into vehicle movements and demand patterns over time and space, including service utilization and the propagation of delays and crowding. Data collected from the urban transit network in The Hague, The Netherlands are used to demonstrate the proposed methodology. The visualization of spatiotemporal load profiles through space-time seat occupancy graphs provides operators with a compact and powerful reference to improve their services.","authors":["Ding Luo","Loïc Bonnetain","Oded Cats","J.W.C. Van Lint"],"meta":["July 2018Transportation Research Record Journal of the Transportation Research Board 2672(4)","DOI:10.1177/0361198118781166","Project: SETA Mobility"],"references":["319258433_Quantile_Regression_Analysis_of_Transit_Travel_Time_Reliability_with_Automatic_Vehicle_Location_and_Farecard_Data","313038517_Constructing_Transit_Origin-Destination_Matrices_with_Spatial_Clustering","325305605_Potential_Uses_of_Transit_Smart_Card_Registration_and_Transaction_Data_to_Improve_Transit_Planning","316751366_A_probabilistic_Passenger-to-Train_Assignment_Model_based_on_automated_data","311633873_Toward_a_Demand_Estimation_Model_Based_on_Automated_Vehicle_Location","311631261_BusViz_Big_Data_for_Bus_Fleets","310593855_Bus_arrival_time_calculation_model_based_on_smart_card_data","309898383_Crowding_cost_estimation_with_large_scale_smart_card_and_vehicle_location_data","303545351_Estimation_of_Passenger_Route_Choice_Pattern_Using_Smart_Card_Data_for_Complex_Metro_Systems","293192839_Short-Term_Prediction_of_Ridership_on_Public_Transport_with_Smart_Card_Data"]}