{"id":"322967508_System_Interaction_Theory_Describing_Interactions_between_Work_Systems","abstract":"Interactions between systems are a necessity, a source of opportunity, and a source of difficulty and complication in building, implementing, and maintaining IT-reliant systems in organizations. This paper presents system interaction theory (SINT), a theory for analysis that covers almost all intentional and unintentional interactions between work systems that may be sociotechnical or totally automated. SINT is a broadly applicable theory that encompasses interactions between the types of systems that are central to the IS discipline. To minimize redundancy, this paper summarizes SINT immediately after introducing the research goal and, thereby, provides a context for the many distinctions and references that follow. A discussion of SINT’s domain and scope explains why SINT views interacting entities as work systems rather than as tasks, components, or software modules. The literature review positions SINT in relation to topics under headings that range from general systems theory and computer science to human computer interaction and organization science. Topics in SINT include relevant characteristics of systems and system interactions, purposes and/or causes of system interactions, system interaction patterns, direct effects of system interactions, responses to direct effects, and outcomes related to system interactions. The paper discusses a variety of potential contributions to theory, practice, and research.","authors":["Steven Alter"],"meta":["February 2018Communications of the Association for Information Systems 42(1)","DOI:10.17705/1CAIS.04209"],"references":["327903090_Encapsulation_as_a_Key_Concern_in_Analysis_and_Design_for_Service_Systems_AMCIS_2016","311609095_System_Interaction_Patterns","287312048_Editorial_Complexity_of_Systems_Evolution_Requirements_Engineering_Perspective","285268227_New_State_of_Play_in_Information_Systems_Research_The_Push_to_the_Edges","316270652_General_Systems_Theory","308525516_The_principles_of_sociotechnical_design_revisited","303414480_General_systems_theory_Problems_perspectives_practice","303007331_Loosely_Coupled_Systems_A_Reconceptualization","286038687_Moving_the_Work_System_Theory_Forward","285946645_Principles_of_Computer_System_Design_An_Introduction"]}