{"id":"322934008_Serotonin_Differentially_Regulates_L5_Pyramidal_Cell_Classes_of_the_Medial_Prefrontal_Cortex_in_Rats_and_Mice","abstract":"The prefrontal cortex receives a dense serotonergic innervation that plays an important role in its regulation. However, how serotonin regulates different pyramidal and interneuron cell classes in this area is incompletely understood. Previous work in rats has shown that serotonin differentially regulates two classes of pyramidal cells in layer 5. It excites one class by activating 5-HT2A receptors, whereas it more subtly modulates the integrative properties of the other by co-activating 5-HT1A and 5-HT2A receptors. Here we have used electrophysiological recordings, combined with retrograde labeling and morphological reconstruction, to show that the first cell class corresponds to long range corticofugal neurons and the second corresponds to intratelencephalic neurons. These results suggest that, in rats, serotonin facilitates subcortical output while more subtly modulating cortico-cortical and cortico-striatal output. Interestingly, these results obtained in rats differ from those previously reported for mouse prefrontal cortex. Therefore we reinvestigated the effects of serotonin in mice and confirmed that serotonin predominantly activates inhibitory 5-HT1A receptors on long-range corticofugal cells. Thus serotonin exerts opposite effects on these cells in rats and mice. Finally, we determined whether cortical serotonin responsiveness in mice is regulated during development. Serotonin elicited predominantly depolarizing inward current responses during the early postnatal period, whereas inhibitory 5-HT1A receptor-mediated responses did not become evident until the end of the second postnatal week. These results reveal commonalities as well as unexpected differences in the serotonergic regulation of long-range corticofugal and intratelencephalic neurons of layer 5 in rat and mouse.","authors":["Mary C. Elliott","Peter M. Tanaka","Ryan W. Schwark","Rodrigo Andrade"],"meta":["January 2018eNeuro 5(1):ENEURO.0305-17.2018","DOI:10.1523/ENEURO.0305-17.2018"],"references":["289355733_Adult_mouse_cortical_cell_taxonomy_revealed_by_single_cell_transcriptomics","265048853_Activity-dependent_serotonergic_excitation_of_callosal_projection_neurons_in_the_mouse_prefrontal_cortex","257599731_Morphological_and_Physiological_Characterization_of_Pyramidal_Neuron_Subtypes_in_Rat_Medial_Prefrontal_Cortex","257599705_Cell_Type-Specific_Effects_of_Adenosine_on_Cortical_Neurons","223973480_Synaptic_Activity_Unmasks_Dopamine_D2_Receptor_Modulation_of_a_Specific_Class_of_Layer_V_Pyramidal_Neurons_in_Prefrontal_Cortex","221979560_Selective_serotonergic_excitation_of_callosal_projection_neurons","51881145_Essential_Role_for_Phosphatidylinositol_45-Bisphosphate_in_the_Expression_Regulation_and_Gating_of_the_Slow_Afterhyperpolarization_Current_in_the_Cerebral_Cortex","236064126_Corticostriatal_connectivity_and_its_role_in_disease","223395756_Cellular_Effects_of_Serotonin_in_the_CNS","51861623_Projections_and_interconnections_of_genetically_defined_serotonin_neurons_in_mice"]}