{"id":"322915933_International_consensus_ICON_on_basic_voice_assessment_for_unilateral_vocal_fold_paralysis","abstract":"There is a growing need for evaluation tools allowing the quantification of the outcome after voice surgeries. Since the end of the 1990s, multiple unfruitful attempts have been made to reach a consensus, including the Dejonckere protocol for the European Laryngological Society in 2001. This suggested to perform objective and quantifiable measures in the following domains: perception, acoustic, aerodynamic, self-evaluation by the patient and videolaryngostroboscopy. But in a PubMed® search with the keywords \"Voice Assessment\" and \"Voice Outcome\" since 2001 retrieving 452 articles, only 33 of them were using methods taking into account the first four dimensions proposed by Dejonckere. To elaborate a new and simpler protocol, we chose to focus on unilateral vocal fold paralyses (UVFP), which represents a homogeneous disease in terms of physiology. This protocol was elaborated on the basis of a review of the literature and of the database and experience of the IFOS panel members. In summary, our group recommends the use and implementation of the ELS \"basic protocol\" with some minor modifications. Voice audio recordings are an indispensable prerequisite, and may even have medico-legal implications. We recommend the systematic use of the Voice Handicap Index (VHI). Perceptual analysis must be performed by using Hirano's GRB scale and voice breathiness has to be prioritized. Currently, acoustic analysis remains optional given the lack of data to support clinical usefulness. Aerodynamic studies should include at a minimum an evaluation of the Maximum Phonation Time, calculated in seconds following multiple trials in order to obtain a recording representing the patient's best possible glottis closure.","authors":["A. Mattei","Gauthier desuter","M. Roux","B.-J. Lee"],"meta":["February 2018European Annals of Otorhinolaryngology, Head and Neck Diseases 135(1S)","DOI:10.1016/j.anorl.2017.12.007"],"references":["257838212_Correlation_Between_the_Basic_Video_Laryngostroboscopic_Parameters_and_Multidimensional_Voice_Measurements","236052236_Voice_and_Speech_Changes_in_Various_Phases_of_Menstrual_Cycle","6179752_Voice_Therapy_Used_to_Test_a_Basic_Protocol_for_Multidimensional_Assessment_of_Dysphonia","316250707_A_Multidimensional_Study_of_Vocal_Function_Following_Radiation_Therapy_for_Laryngeal_Cancers","269766835_Consideration_of_vocal_fold_position_in_unilateral_vocal_fold_paralyses","246021605_A_simple_technique_for_consistent_microphone_placement_in_voice_recording","7274128_Evolution_of_Vocal_Fold_Nodules_from_Childhood_to_Adolescence"]}