{"id":"322959527_Analisis_Sentimen_Pariwisata_di_Kota_Malang_Menggunakan_Metode_Naive_Bayes_dan_Seleksi_Fitur_Query_Expansion_Ranking","abstract":"Pariwisata merupakan salah satu sektor usaha untuk memajukan suatu kota. Kota Malang pada saat ini memiliki sebuah branding city yang bernama \"Beautiful Malang\". Masyarakat Indonesia memilih pariwisata Kota Malang sebagai destinasi dan mengulasnya pada website salah satunya adalah TripAdvisor. Dengan demikian penelitian ini mencoba menganalisis ulasan dari masyarakat tentang pariwisata Kota Malang melalui analisis sentimen dan diklasifikasikan menjadi dua kelas yaitu positif dan negatif. Pada penelitian ini metode yang digunakan adalah Naive Bayes dengan seleksi fitur Query Expansion Ranking untuk mengurangi jumlah fitur pada proses klasifikasi. Proses dari analisis sentimen terdiri dari preprocessing, seleksi fitur dengan metode Query Expansion Ranking, dan klasifikasi dengan Naive Bayes. Pengujian pada penelitian ini adalah uji akurasi dengan menggunakan variasi rasio seleksi fitur, hasilnya seleksi fitur 75% memiliki akurasi terbaik sebesar 86.6%. Kata kunci: analisis sentimen, query expansion ranking, naïve bayes Abstract Tourism is one of effort to promote a city. Malang currently has a branding city called \"Beautiful Malang\". Indonesian choose Malang tourism as a destination and review it on the website, one of them is TripAdvisor. Thus this research tried to analyze the reviews from the public about the tourism of Malang City through sentiment analysis and classified into two classes, that is positive and negative. In this research the method used is Naive Bayes with Query Expansion Ranking feature selection to reduce the number of features in the classification process. The process of sentiment analysis consists of preprocessing, feature selection with Query Expansion Ranking method, and classification with Naive Bayes. This research is testing the accuracy by using the variation of feature selection ratio, the result of 75% feature selection has the best accuracy of 86.6%. Keywords: sentiment analysis, query expansion ranking, naïve bayes 1. PENDAHULUAN Word of Mouth yang diketahui sebagai penyampaian informasi dari mulut ke mulut (orang ke orang) adalah sebuah metode yang digunakan oleh konsumen untuk mengungkapkan perasaan dan pengalaman mereka mengenai sebuah produk, merek, atau layanan namun metode tersebut tidak bertujuan untuk memasarkan atau mempromosikan (Hung, 2017). Dengan berbagi dan menyebarkan dokumen Word of Mouth, masyarakat luas dapat menggunakan dokumen Word of Mouth tersebut sebagai referensi dan pengambilan keputusan. Terlebih lagi pada era sekarang dimana pertumbuhan internet dan media sosial telah berkembang pesat sehingga menyediakan berbagai informasi opini orang lain. Analisis Sentimen yaitu studi yang terdiri dari Natural Language Processing, komputasi linguistik , dan analisis teks untuk mengidentifikasi sentimen teks (Vinodhini dan Chandrasekaran, 2016) dapat membantu untuk mengidentifikasi opini mengenai suatu produk yang disampaikan oleh pengguna online untuk mengekspesikan emosi, perilaku, atau secara otomatis. Analisis sentimen biasanya terbagi menjadi dua kelas yaitu positif dan negatif.","authors":["Shima Fanissa","Muhammad Ali Fauzi","Sigit Adinugroho"],"meta":["August 2018","Project: Text Mining and Text Information Retrieval"],"references":["322029398_Indonesian_News_Classification_Using_Naive_Bayes_and_Two-Phase_Feature_Selection_Model","320234777_Analisis_Sentimen_Tentang_Opini_Film_pada_Dokumen_Twitter_Berbahasa_Indonesia_Menggunakan_Naive_Bayes_dengan_Perbaikan_Kata_Tidak_Baku","308570079_A_new_feature_selection_method_for_sentiment_analysis_of_Turkish_reviews","283976859_A_comparative_performance_evaluation_of_neural_network_based_approach_for_sentiment_classification_of_online_reviews","261151537_Scalable_sentiment_classification_for_Big_Data_analysis_using_Naive_Bayes_Classifier","314510325_Word_of_mouth_quality_classification_based_on_contextual_sentiment_lexicons","284657154_A_comparison_of_event_models_for_naive_bayes_text_classification_in_AAAI-98_workshop_on_learning_for_text_categorization"]}