{"id":"322977175_Implicant_based_parallel_all_solution_solver_for_Boolean_satisfiability","abstract":"This paper develops a parallel computational solver for computing all satifying assignments of a Boolean system of equations defined by Boolean functions of several variables. While there are well known solvers for satisfiability of Boolean formulas in CNF form, these are designed primarily for deciding satisfiability of the formula and do not address the problem of finding all satisfying solutions. Moreover development of parallel solvers for satisfiability problems is still an unfinished problem of Computer Science. The solver proposed in this paper is aimed at representing all solutions of Boolean formulas even without the CNF form with a parallel algorithm. Algorithm proposed is applied to Boolean functions in algebraic normal form (ANF). The algorithm is based on the idea to represent the satisfying assignments in terms of a complete set of impli-cants of the Boolean functions appearing as factors of a Boolean formula. The algorithm is effective mainly in the case when the factors of the formula are sparse (i.e. have a small fraction of the total number of variables). This allows small computation of a complete set of implicants of individual factors one at a time and reduce the formula at each step. An algorithm is also proposed for finding a complete set of orthogonal implicants of functions in ANF. An advantages of this algorithm is that all solutions can be represented compactly in terms of implicants. Finally due to small and distributed computation at every step as well as computation in terms of independent threads, the solver proposed in this paper is expected to be useful for developing heuristics for a well scalable parallel solver for large size problems of Boolean satisfiability over large number of processors.","authors":["Virendra R. Sule"],"meta":["February 2017","Project: Parallel solver for all satisfying solutions  of Boolean formulas. "],"references":["301839509_Projective_cofactor_decompositions_of_Boolean_functions_and_the_satisfiability_problem","288830392_An_Efficient_Steady-State_Analysis_Method_for_Large_Boolean_Networks_with_High_Maximum_Node_Connectivity","269687525_Generalized_cofactors_and_decomposition_of_Boolean_satisfiability_problems","263432785_Steady_state_analysis_of_Boolean_molecular_network_models_via_model_reduction_and_computational_algebra","263237850_An_algorithm_for_Boolean_satisfiability_based_on_generalized_orthonormal_expansion","323742444_A_Way_to_Simplify_Truth_Functions","302206108_The_Problem_of_Simplifying_Truth_Functions","292562364_Handbook_of_Satisfiability_Preface","278702163_Algebraic_Cryptanalysis","277334230_A_Novel_Algorithm_for_the_Maximal_Fit_Problem_in_Boolean_Networks"]}