{"id":"322905432_Patent_Keyword_Extraction_Algorithm_Based_on_Distributed_Representation_for_Patent_Classification","abstract":"Many text mining tasks such as text retrieval, text summarization, and text comparisons depend on the extraction of representative keywords from the main text. Most existing keyword extraction algorithms are based on discrete bag-of-words type of word representation of the text. In this paper, we propose a patent keyword extraction algorithm (PKEA) based on the distributed Skip-gram model for patent classification. We also develop a set of quantitative performance measures for keyword extraction evaluation based on information gain and cross-validation, based on Support Vector Machine (SVM) classification, which are valuable when human-annotated keywords are not available. We used a standard benchmark dataset and a homemade patent dataset to evaluate the performance of PKEA. Our patent dataset includes 2500 patents from five distinct technological fields related to autonomous cars (GPS systems, lidar systems, object recognition systems, radar systems, and vehicle control systems). We compared our method with Frequency, Term Frequency-Inverse Document Frequency (TF-IDF), TextRank and Rapid Automatic Keyword Extraction (RAKE). The experimental results show that our proposed algorithm provides a promising way to extract keywords from patent texts for patent classification.","authors":["Jie Hu","Shaobo Li","Yong Yao","Liya Yu"],"meta":["February 2018Entropy 20(2):104","DOI:10.3390/e20020104"],"references":["290169681_Automatic_keyword_extraction_from_documents_using_conditional_random_fields","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","313941887_Application_technology_opportunity_discovery_from_technology_portfolios_Use_of_patent_classification_and_collaborative_filtering","313803168_Knowledge_of_extraction_from_trained_neural_network_by_using_decision_tree","308086495_Monitoring_emerging_technologies_for_technology_planning_using_technical_keyword_based_analysis_from_patent_data","307587534_Digging_Language_Model_-_Maximum_Entropy_Phrase_Extraction","303697648_The_evolution_of_patent_mining_Applying_bibliometrics_analysis_and_keyword_network_analysis","300886257_Using_Word_Embeddings_to_Enhance_Keyword_Identification_for_Scientific_Publications","299496445_Ensemble_of_keyword_extraction_methods_and_classifiers_in_text_classification","291558122_A_patent_quality_analysis_and_classification_system_using_self-organizing_maps_with_support_vector_machine"]}