{"id":"322962019_DIREITOS_AUTORAIS_E_MUSICA_TECNOLOGIA_DIREITO_E_REGULACAO","abstract":"A partir de abordagem multidisciplinar, o artigo analisou o presente impacto da tecnologia sobre o Direito de Propriedade Intelectual, com ênfase nos fonogramas. Considerou a essencialidade dos recursos tecnológicos para permitir a universalização do acesso à música bem como para viabilizar a preservação dos direitos autorais. Cotejou o papel regulador do Direito no tema pesquisado e as ferramentas tecnológicas que podem facilitar a identificação da autoria e a justa partilha dos resultados econômicos da obra. Resultante de projeto de pesquisa envolvendo distintos programas de pós-graduação em Direito do país, foi elaborado a partir de análise teórica e dogmática com base no método lógico-dedutivo, transportando conhecimentos da área tecnológica, de forma a facilitar a compreensão dos aspectos jurídicos e econômicos relacionados ao direito autoral de fonogramas, utilizando-se de referenciais teóricos da Ciência da Computação, do Direito de Propriedade e do Direito Econômico. A técnica de pesquisa aplicada foi documentação indireta por meio de pesquisa bibliográfica, documental e legislativa. O artigo concluiu que a tecnologia pode ser empregada como uma importante aliada na busca por soluções que compatibilizem o Direito de Propriedade Intelectual relacionado à música em seus aspectos individual e social.","authors":["Marcia Carla Pereira Ribeiro","Cinthia Obladen de Almendra Freitas","Rubia Carneiro Neves"],"meta":["February 2018Revista Brasileira de Políticas Públicas 7(3)","DOI:10.5102/rbpp.v7i3.4799"],"references":["338822971_O_modelo_economico_do_gratis_na_internet_e_o_direito_de_autor_O_caso_K-Lite_Nitro","322961854_DIREITO_AUTORAL_NA_CIBERCULTURA_UMA_ANALISE_DO_ACESSO_AOS_BENS_IMATERIAIS_A_PARTIR_DAS_LICENCAS_CREATIVE_COMMONS_40","257498483_Exploring_different_approaches_for_music_genre_classification","320201578_A_INTERVENCAO_DIRETA_E_INDIRETA_NA_ATIVIDADE_ECONOMICA_EM_FACE_DA_ORDEM_JURIDICA_BRASILEIRA","316851740_FINANCIAMENTO_CULTURAL_NO_BRASIL_CONTEMPORANEO","316851661_POLITICAS_DE_ACESSO_ABERTO_PARA_TRABALHOS_CIENTIFICOS_INTERESSE_PUBLICO_E_DIREITOS_DE_AUTOR","281229106_As_Politicas_Publicas_de_Acesso_e_Difusao_da_Cultura_no_Brasil_e_o_Caso_do_Programa_Nacional_de_Apoio_a_Cultura","224446104_Efficient_and_Robust_Music_Identification_With_Weighted_Finite-State_Transducers","221995544_Pattern_Recognition_and_Machine_Learning","220426760_Extracting_information_from_music_audio"]}