{"id":"322961854_DIREITO_AUTORAL_NA_CIBERCULTURA_UMA_ANALISE_DO_ACESSO_AOS_BENS_IMATERIAIS_A_PARTIR_DAS_LICENCAS_CREATIVE_COMMONS_40","abstract":"Este artigo analisa os movimentos de acesso aos bens imateriais que ocorrem através do compartilhamento de arquivos na internet, no intuito de compreender em que medida os bens culturais na sociedade da informação estão à disposição de uma cultura de Direitos Humanos. Partindo da hipótese de que há na rede mundial de computadores uma ampliação do acesso à produção cultural, a qual é fomentada por movimentos como o Creative Commons, Copyleft, Linux e Flok Society, realiza-se um estudo qualitativo sobre as licenças criativas, com suporte no levantamento de dados, documentos e referencial teórico, utilizando a análise de conteúdo nas licenças Creative Commons 4.0, para problematizar os direitos autorais e os reflexos da tecnologia na maneira como a população tem acesso aos bens culturais. Os resultados apontam para uma proteção da propriedade com muito acento ainda no direito autoral tradicional, frustrando quem pudesse esperar das licenças um novo paradigma na relação entre criação, produção e circulação coletiva de ideias. No entanto, conclui-se que a semente está lançada, no sentido de ampliar o debate e promover, cada vez mais, uma cultura de produção e acesso à informação que contemple uma perspectiva forte de Direitos Humanos.","authors":["Gabriela Maia Reboucas","Fernanda Oliveira Santos"],"meta":["February 2018Revista Brasileira de Políticas Públicas 7(3)","DOI:10.5102/rbpp.v7i3.4954"],"references":["343657940_A_PROTECAO_INTERNACIONAL_DO_DIREITO_DE_AUTOR_E_O_EMBATE_ENTRE_OS_SISTEMAS_DO_COPYRIGHT_E_DO_DROIT_D'AUTEUR_INTERNATIONAL_PROTECTION_OF_COPYRIGHT_AND_SYSTEMS_CLASH_BETWEEN_COPYRIGHT_AND_DROIT_D'AUTEUR","339711385_O_que_e_Creative_Commons_Novos_modelos_de_direito_autoral_em_um_mundo_mais_criativo","322962019_DIREITOS_AUTORAIS_E_MUSICA_TECNOLOGIA_DIREITO_E_REGULACAO","277184489_Musica_e_Cibercultura","270453229_Reflexoes_sobre_os_valores_do_movimento_software_livre_na_criacao_de_novos_movimentos_informacionais","324531643_Creative_Commons_Attribution-NonCommercial_40_International_Public_License_CC_BY-NC_40","320203760_A_PROTECAO_POSITIVA_DO_DOMINIO_PUBLICO","316851661_POLITICAS_DE_ACESSO_ABERTO_PARA_TRABALHOS_CIENTIFICOS_INTERESSE_PUBLICO_E_DIREITOS_DE_AUTOR","277799048_Politicas_culturais_na_era_digital_ou_a_Revolucao_Caraiba_contemporanea","271766361_Analise_de_Conteudo"]}