{"id":"322905084_MEMU_More_Efficient_Algorithm_to_Mine_High_Average-Utility_Patterns_With_Multiple_Minimum_Average-Utility_Thresholds","abstract":"High average-utility itemsets mining (HAUIM) is an emerging topic in data mining. Compared to traditional high utility itemset mining, HAUIM more fairly measures the utility of itemsets by considering their lengths (number of items). Many previous studies have presented algorithms to efficiently mine high average-utility itemsets (HAUIs). Most of these algorithms, however, only mine HAUIs using a single minimum high average-utility threshold, which limits their usefulness to analyze real data. This is a problem because different items are not equally important to the user. The importance of an item can be expressed for example in terms of weights, interestingness or unit profit. In the past, a baseline algorithm called HAUIM-MMAU was presented to mine HAUIs using multiple minimum high average-utility thresholds. However, it uses a generate-and-test approach to mine HAUIs using a level-wise approach, which is time consuming. In this paper, we propose an efficient algorithm to discover HAUIs based on the average-utility list structure. A tighter upper-bound model is used to reduce the search space instead of the one used in traditional HAUIM, which is called the auub model. Three pruning strategies are also respectively developed to increase the performance HAUIs. Experiments show that the proposed algorithm outperforms the state-of-the-art HAUIM-MMAU algorithm in terms of runtime, memory usage, number of candidates and scalability.","authors":["Chun-Wei Jerry Lin","Shifeng Ren","Philippe Fournier Viger"],"meta":["February 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2801261"],"references":["317703960_EHAUPM_Efficient_High_Average-Utility_Pattern_Mining_with_Tighter_Upper-Bounds","314665553_A_fast_algorithm_for_mining_high_average-utility_itemsets","308387578_FDHUP_Fast_algorithm_for_mining_discriminative_high_utility_patterns","307587257_The_SPMF_Open-Source_Data_Mining_Library_Version_2","305910416_More_Efficient_Algorithms_for_Mining_High-Utility_Itemsets_with_Multiple_Minimum_Utility_Thresholds","319393723_Fast_algorithms_for_mining_association_rules","315462023_An_Efficient_Algorithm_for_Mining_High_Utility_Patterns_from_Incremental_Databases_with_One_Database_Scan","310824798_XGBoost_A_Scalable_Tree_Boosting_System","308599135_Efficient_Mining_of_High-Utility_Itemsets_Using_Multiple_Minimum_Utility_Thresholds","307621847_FHN_An_Efficient_Algorithm_for_Mining_High-Utility_Itemsets_with_Negative_Unit_Profits"]}