{"id":"322904031_Microblog_sentiment_analysis_using_social_and_topic_context","abstract":"Analyzing massive user-generated microblogs is very crucial in many fields, attracting many researchers to study. However, it is very challenging to process such noisy and short microblogs. Most prior works only use texts to identify sentiment polarity and assume that microblogs are independent and identically distributed, which ignore microblogs are networked data. Therefore, their performance is not usually satisfactory. Inspired by two sociological theories (sentimental consistency and emotional contagion), in this paper, we propose a new method combining social context and topic context to analyze microblog sentiment. In particular, different from previous work using direct user relations, we introduce structure similarity context into social contexts and propose a method to measure structure similarity. In addition, we also introduce topic context to model the semantic relations between microblogs. Social context and topic context are combined by the Laplacian matrix of the graph built by these contexts and Laplacian regularization are added into the microblog sentiment analysis model. Experimental results on two real Twitter datasets demonstrate that our proposed model can outperform baseline methods consistently and significantly.","authors":["Xiaomei Zou","Jing Yang","Jianpei Zhang"],"meta":["February 2018PLoS ONE 13(2):e0191163","DOI:10.1371/journal.pone.0191163"],"references":["311990858_Attention-based_LSTM_for_Aspect-level_Sentiment_Classification","311689459_Lexicon_based_Feature_Extraction_for_Emotion_Text_Classification","309897403_Improving_sentiment_analysis_via_sentence_type_classification_using_BiLSTM-CRF_and_CNN","309193714_Recommendation_with_Social_Dimensions","339940261_SenticNet_4_a_semantic_resource_for_sentiment_analysis_based_on_conceptual_primitives","322715582_The_elements_of_statistical_learning","314140847_Combine_HowNet_Lexicon_to_Train_Phrase_Recursive_Autoencoder_for_Sentence-Level_Sentiment_Analysis","313456493_Convolutional_MKL_Based_Multimodal_Emotion_Recognition_and_Sentiment_Analysis","312451093_Context-sensitive_twitter_sentiment_classification_using_neural_network","309685612_Adapting_sentiment_lexicons_to_domain-specific_social_media_texts"]}