{"id":"322959763_Bachelor_of_Computer_Applications_BCA_An_Applied_Science_Program_into_a_New_Direction","abstract":"Computing and Information Technology become an important source and tool of development. It is responsible for the designing of IT and Computing infrastructure of different areas viz. Business, Healthcare, Transportation, Education and Training, Governance, and Administration etc hence the skilled manpower in this field (computing) is important and urgent. Computer Application is a study and research areas of applied nature. Before the development of domain Computer Application, the main popular and available subjects was Computer Science as far as Indian context is concerned. Although internationally as an applied branch Information Technology has emerged. In education and training segment during the eighties (1980’s) some of the Indian universities moved to offer ‘Computer Application’ as an applied computing related branch as an alternative of substitute Computer Science (which was traditional, theoretical and mathematical) and initially Masters program has been started for diverse graduate with some logical/ quantitative skills. Gradually the same branch has been started in Bachelors level as well. Hence this paper is conceptual in nature and deals with the educational affairs of computing and information technology related field as far as India is concerned. This paper is highlights various emerging changes of Computer Application in this regard with reference to job potentialities and attempts to showcase the current situation in private universities in India with reference to Computer Applications (Bachelors) programs. Traditionally it is a common myth among a percentage of stakeholders that Computer Application is a program with Application concentration rather scientific and theoretical base. However, this paper tries to explore the future concept and dealing of Computer Application and allied fields in future.","authors":["P.K. Paul","Sreeramana Aithal"],"meta":["December 2017","Project: Private University"],"references":["322138587_Indian_Higher_Education_With_Slant_to_Information_Technology-_A_Fundamental_Overview","322138395_Computing_Allied_Engineering_Domain_in_India_with_reference_to_Private_Universities_A_Case_Study_of_Bachelors_Programs","322138390_MCA_Information_Science_and_Management_The_Next_Generation_Interdisciplinary_specialization_for_Social_Business_Health_Mathematical_Sciences-A_Step_for_promoting_Digital_Humanities","259686609_The_Interface_of_Technology_and_Medical_Education_in_India_Current_trends_and_scope","249360041_India_in_the_knowledge_economy_-_An_electronic_paradigm","320674521_A_Novel_Educational_Proposal_and_Strategies_Toward_Promoting_Cloud_Computing_Big_Data_and_Human-Computer_Interaction_in_Engineering_Colleges_and_Universities","284866579_Balanced_scorecards_in_managing_higher_education_institutions_An_Indian_perspective","281162259_Increasing_the_Retention_of_American_Indian_Students_in_Professional_Programs_in_Higher_Education","267369946_Higher_Education_in_India_Structure_Statistics_and_Challenges","240542929_Transition_from_higher_education_as_a_public_good_to_higher_education_as_a_private_good_the_saga_of_Indian_experience"]}