{"id":"322908038_Abstractive_Text_Summarization_based_on_Improved_Semantic_Graph_Approach","abstract":"The goal of abstractive summarization of multi-documents is to automatically produce a condensed version of the document text and maintain the significant information. Most of the graph-based extractive methods represent sentence as bag of words and utilize content similarity measure, which might fail to detect semantically equivalent redundant sentences. On other hand, graph based abstractive method depends on domain expert to build a semantic graph from manually created ontology, which requires time and effort. This work presents a semantic graph approach with improved ranking algorithm for abstractive summarization of multi-documents. The semantic graph is built from the source documents in a manner that the graph nodes denote the predicate argument structures (PASs)—the semantic structure of sentence, which is automatically identified by using semantic role labeling; while graph edges represent similarity weight, which is computed from PASs semantic similarity. In order to reflect the impact of both document and document set on PASs, the edge of semantic graph is further augmented with PAS-to-document and PAS-to-document set relationships. The important graph nodes (PASs) are ranked using the improved graph ranking algorithm. The redundant PASs are reduced by using maximal marginal relevance for re-ranking the PASs and finally summary sentences are generated from the top ranked PASs using language generation. Experiment of this research is accomplished using DUC-2002, a standard dataset for document summarization. Experimental findings signify that the proposed approach shows superior performance than other summarization approaches.","authors":["Atif Khan","Naomie Salim","Haleem Farman","Murad Khan"],"meta":["October 2018International Journal of Parallel Programming 46(1)","DOI:10.1007/s10766-018-0560-3"],"references":["299499824_Recent_automatic_text_summarization_techniques_a_survey","282886980_SmaCH_A_Framework_for_Smart_Cultural_Heritage_Spaces","277722623_Abstractive_Multi-Document_Summarization_via_Phrase_Selection_and_Merging","313874021_IoT-based_Collaborative_Reputation_System_for_Associating_Visitors_and_Artworks_in_a_Cultural_scenario","312736798_Automatic_text_summarization","306150627_A_trainable_document_summarizer","291387124_Concept_Generalization_and_Fusion_for_Abstractive_Sentence_Generation","291361747_Toward_Abstractive_Summarization_Using_Semantic_Representations","282864223_Concept-based_Summarization_using_Integer_Linear_Programming_From_Concept_Pruning_to_Multiple_Optimal_Solutions","270878876_Towards_Robust_Abstractive_Multi-Document_Summarization_A_Caseframe_Analysis_of_Centrality_and_Domain"]}