{"id":"322999295_Vision-Based_Fatigue_Crack_Detection_of_Steel_Structures_Using_Video_Feature_Tracking","abstract":"Fatigue cracks developed under repetitive loads are one of the major threats to structural integrity of steel bridges. Human inspection is the most commonly applied approach for fatigue crack detection, but is time consuming, labor intensive, and lacks reliability. In this study, we propose a computer vision-based fatigue crack detection approach using a short video stream taken by a consumer-grade digital camera. A feature tracking technology is applied to the video for tracking the surface motion of the monitored structure under repetitive load. Then, a crack detection and localization algorithm is established to effectively search differential features at different video frames caused by the crack opening and closing. The effectiveness of the proposed approach is validated through testing two experimental specimens with in-plane and out-of-plane fatigue cracks, respectively. Results indicate that the proposed approach can robustly identify the fatigue crack, even when the crack is under ambient lighting conditions, surrounded by other crack-like edges, covered by complex surface textures, or invisible to human eyes due to crack closure. Furthermore, our proposed approach enables accurate quantification of the crack opening under fatigue loading with submillimeter accuracy. However, due to the capacity of the camera resolution in this study, accurate detection of crack tip remains challenging.","authors":["Xiangxiong Kong","Jian Li"],"meta":["February 2018Computer-Aided Civil and Infrastructure Engineering 33(4)","DOI:10.1111/mice.12353","Project: PhD Project: Sensing Fatigue Cracks in Steel Bridges using Advanced SHM Technologies"],"references":["317269817_A_large-area_strain_sensing_technology_for_monitoring_fatigue_cracks_in_steel_bridges","315866203_Retrofitting_Distortion-Induced_Fatigue_in_Skewed_Girders_to_Cross-Frame_Connections","315613676_Deep_Learning-Based_Crack_Damage_Detection_Using_Convolutional_Neural_Networks","319770516_A_combined_corner_and_edge_detector","319770440_Vision_Algorithms_Theory_and_Practice","319223118_Automated_Pixel-Level_Pavement_Crack_Detection_on_3D_Asphalt_Surfaces_Using_a_Deep-Learning_Network_Pixel-level_pavement_crack_detection_on_3D_asphalt_surfaces","318911293_Identification_framework_for_cracks_on_a_steel_structure_surface_by_a_restricted_Boltzmann_machines_algorithm_based_on_consumer-grade_camera_images","317953050_Statistical_Analysis_of_Modal_Properties_of_a_Cable-Stayed_Bridge_through_Long-Term_Wireless_Structural_Health_Monitoring","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","315970464_Statistical_Selection_and_Interpretation_of_Imagery_Features_for_Computer_Vision-Based_Pavement_Crack-Detection_Systems"]}