{"id":"322992655_PROCEDIMIENTO_PARA_LA_FORMACION_POR_ROLES_EN_LA_PRODUCCION_DE_SOFTWARE_EN_LA_UNIVERSIDAD_DE_CIENCIAS_INFORMATICASPROCEDURE_FOR_THE_TRAINING_BY_ROLES_IN_SOFTWARE_PRODUCTION_AT_THE_UNIVERSITY_OF_COMPUTE","abstract":"Resumen Este artículo propone un procedimiento para la capacitación orientada a roles de los especialistas en ciencias informáticas de la producción de software en la Universidad de las Ciencias Informáticas. Se elaboran cuestionarios para evaluar el nivel de desarrollo de las habilidades por roles y se aplica la técnica de 360-grados. Además, se determinan las necesidades de capacitación para acortar las brechas identificadas durante el diagnóstico. La aplicación del procedimiento, en una muestra de proyectos cerrados de aplicaciones y servicios informáticos de la Universidad, evidencia la necesidad de la capacitación orientada al mejoramiento en el desempeño de los roles. Abstract This paper proposes a procedure for the role-oriented training of computer science specialists in software production at the University of Computer Science. Questionnaires are developed to assess the level of development of the skills by roles and it is applied the 360-degree technique. In addition, training needs are determined to bridge gaps identified during the diagnosis. The application of the procedure in a sample of closed projects applications and informatics services of the university demonstrates the need for training aimed at improving the performance of the roles.","authors":["Mailín Ochoa Calzadilla","Mercedes Delgado Fernández"],"meta":["January 2018","Projects: Revista Cubana de Administración Pública y Empresarial (ISSN: 2664-0856)Quality ManagementEducación Superior y formación de directivosEnterprise and Public Administration Innovation"],"references":["319701154_OUTBOUND_TRAINING_AND_ITS_EFFECT_ON_EMPLOYEE_PERFORMANCE_-_A_REVIEW_OF_LITERATURE","319701009_OUTBOUND_TRAINING_AND_ITS_EFFECT_ON_EMPLOYEE_PERFORMANCE_-_A_REVIEW_OF_LITERATURE","318043440_Measuring_return_on_investment_and_risk_in_training_-_A_business_training_evaluation_model_for_managers_and_leaders","313218813_The_New_performance_management_paradigm_Capitalizing_on_the_unrealized_potential_of_360_degree_feedback","312519335_Analysis_of_the_Impact_of_Human_Capital_Investment_and_Allocation_on_the_Upgrade_of_Industrial_Structure_in_Guangdong","312318696_Evaluation_of_drug_management_competency_A_comparison_between_the_360-degree_appraisal_and_manager_assessment","286530760_Strategic_Human_Resource_Management_Innovation_Capability_and_Performance_An_Empirical_Study_in_Indonesia_Software_Industry","329104941_Project_Management_para_la_gestion_de_la_innovacion_en_la_industria_cubana","319276865_Red_neuronal_multicapa_para_la_evaluacion_de_competencias_laborales","290436198_Gestion_del_talento_humano_y_del_conocimiento"]}