{"id":"323027170_From_Hashing_to_CNNs_Training_BinaryWeight_Networks_via_Hashing","abstract":"Deep convolutional neural networks (CNNs) have shown appealing performance on various computer vision tasks in recent years. This motivates people to deploy CNNs to realworld applications. However, most of state-of-art CNNs require large memory and computational resources, which hinders the deployment on mobile devices. Recent studies show that low-bit weight representation can reduce much storage and memory demand, and also can achieve efficient network inference. To achieve this goal, we propose a novel approach named BWNH to train Binary Weight Networks via Hashing. In this paper, we first reveal the strong connection between inner-product preserving hashing and binary weight networks, and show that training binary weight networks can be intrinsically regarded as a hashing problem. Based on this perspective, we propose an alternating optimization method to learn the hash codes instead of directly learning binary weights. Extensive experiments on CIFAR10, CIFAR100 and ImageNet demonstrate that our proposed BWNH outperforms current state-of-art by a large margin.","authors":["Qingzhu Lin","Peisong Wang","Jian Cheng"],"meta":["February 2018"],"references":["318899430_Learning_Accurate_Low-Bit_Deep_Neural_Networks_with_Stochastic_Quantization","313645102_Incremental_Network_Quantization_Towards_Lossless_CNNs_with_Low-Precision_Weights","313367469_Deep_Learning_with_Low_Precision_by_Half-wave_Gaussian_Quantization","319770367_Exploiting_Linear_Structure_Within_Convolutional_Networks_for_Efficient_Evaluation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770146_Second_Order_Derivatives_for_Network_Pruning_Optimal_Brain_Surgeon","319770137_Compression_of_Deep_Convolutional_Neural_Networks_for_Fast_and_Low_Power_Mobile_Applications","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","313601183_Optimal_brain_damage_in","311610246_Fast_ConvNets_Using_Group-Wise_Brain_Damage"]}