{"id":"323004019_Uptake_and_outcome_of_manuscripts_in_Nature_journals_by_review_model_and_author_characteristics","abstract":"Background\nDouble-blind peer review has been proposed as a possible solution to avoid implicit referee bias in academic publishing. The aims of this study are to analyse the demographics of corresponding authors choosing double-blind peer review and to identify differences in the editorial outcome of manuscripts depending on their review model.\n\nMethods\nData includes 128,454 manuscripts received between March 2015 and February 2017 by 25 Nature-branded journals. We investigated the uptake of double-blind review in relation to journal tier, as well as gender, country, and institutional prestige of the corresponding author. We then studied the manuscripts’ editorial outcome in relation to review model and author’s characteristics. The gender (male, female, or NA) of the corresponding authors was determined from their first name using a third-party service (Gender API). The prestige of the corresponding author’s institutions was measured from the data of the Global Research Identifier Database (GRID) by dividing institutions in three prestige groups with reference to the 2016 Times Higher Education (THE) ranking. We employed descriptive statistics for data exploration, and we tested our hypotheses using Pearson’s chi-square and binomial tests. We also performed logistic regression modelling with author update, out-to-review, and acceptance as response, and journal tier, author gender, author country, and institution as predictors.\n\nResults\nAuthor uptake for double-blind submissions was 12% (12,631 out of 106,373). We found a small but significant association between journal tier and review type (p value < 0.001, Cramer’s V = 0.054, df = 2). We had gender information for 50,533 corresponding authors and found no statistically significant difference in the distribution of peer review model between males and females (p value = 0.6179). We had 58,920 records with normalised institutions and a THE rank, and we found that corresponding authors from the less prestigious institutions are more likely to choose double-blind review (p value < 0.001, df = 2, Cramer’s V = 0.106). In the ten countries with the highest number of submissions, we found a large significant association between country and review type (p value < 0.001, df = 10, Cramer’s V = 0.189). The outcome both at first decision and post review is significantly more negative (i.e. a higher likelihood for rejection) for double-blind than single-blind papers (p value < 0.001, df = 1, Cramer’s V = 0.112 for first decision; p value < 0.001; df = 1, Cramer’s V = 0.082 for post-review decision).\n\nConclusions\nThe proportion of authors that choose double-blind review is higher when they submit to more prestigious journals, they are affiliated with less prestigious institutions, or they are from specific countries; the double-blind option is also linked to less successful editorial outcomes.","authors":["Barbara Mcgillivray","Elisa De Ranieri"],"meta":["August 2018Research Integrity and Peer Review 3(1)","DOI:10.1186/s41073-018-0049-z","Project: Scientometrics"],"references":["323166113_Gender_bias_in_scholarly_peer_review","321793262_Survey_on_open_peer_review_Attitudes_and_experience_amongst_editors_authors_and_reviewers","321072817_Reviewer_bias_in_single-_versus_double-blind_peer_review","303905540_Impact_of_interventions_to_improve_the_quality_of_peer_review_of_biomedical_journals_A_systematic_review_and_meta-analysis","323424582_Statistical_power_analysis_for_the_behavioral_sciences","305742158_Double-blind_reviewing_at_EvoLang_11_reveals_gender_bias","301851624_The_effects_of_double-blind_versus_single-blind_reviewing_Experimental_evidence_from_the_American_Economic_Review","281056270_Is_Double-Blinded_Peer_Review_Necessary_The_Effect_of_Blinding_on_Review_Quality","277370267_Exploring_the_Peer_Review_Process_What_is_it_Does_it_Work_and_Can_it_Be_Improved","263552626_Masked_Reviews_Are_Not_Fairer_Reviews"]}