{"id":"323089587_Belarusian_Mentality_in_the_Context_of_Intercultural_Communication_Grounds_or_Pessimism_and_Optimism","abstract":"The article is devoted to the consideration of the factors which influence intercultural communication of Belarusians with people who live in the countries bordering Belarus (Russia, Ukraine, Poland, Lithuania and Latvia) and some countries where English is used as the first official language (the UK, the USA, Canada, Australia and Ireland). The objectives of the research were: to compare cultures of people living in Belarus, in the bordering countries and in the English-speaking countries; to describe the characteristics of Belarusian mentality which presumably create cultural barriers; and to determine the factors that facilitate intercultural communication of Belarusians with people under consideration. The research was based on the dimensions of power distance, individualism, masculinity, uncertainty avoidance, long term orientation and indulgence (G. Hofstede). Using these criteria, the characteristics of Belarusian mentality were systematically presented; they include tolerance, collectivism, cautiousness, modesty, restraint, respect for traditions and pragmatism. The reflection of the distinctive features of the Belarusians’ outlook in proverbs and behaviour illustrates the differences which can presumably cause cross-cultural misunderstanding. Also, the factors which promote intercultural communication are highlighted. The results of the research may be used in intercultural training of postgraduate students and in-service specialists in education and business.","authors":["Iryna Piniuta"],"meta":["November 2017Sustainable Multilingualism 11(1)","DOI:10.1515/sm-2017-0012"],"references":["259703201_Grounding_in_Communication","245823281_Culture_and_Social_Behavior","230557580_Culture's_Consequences_Comparing_Values_Behaviors_Institutions_and_Organizations_Across_Nations","46951214_The_Concise_Oxford_Dictionary_of_Proverbs","44819785_Cultures_and_Organizations_Software_of_the_Mind","31710711_Culture_Consequences_Comparing_Values_Behaviors_Institutions_and_Organizations_Across_Nations_G_Hofstede"]}