{"id":"323022781_Deep_hashing_with_top_similarity_preserving_for_image_retrieval","abstract":"Hashing has drawn more and more attention in image retrieval due to its high search speed and low storage cost. Traditional hashing methods project the high-dimensional hand-crafted visual features to compact binary codes by linear or non-linear hashing functions. Deep hashing methods, which integrate image representation learning and hash functions learning into a unified framework, have shown more superior performance. Most of existing supervised deep hashing methods mainly consider the semantic similarities among images by using pair-wise or triplet-wise constraints as supervision information. However, as a kind of crucial information, the rankings of the retrieval results, are neglected. Consequently, the produced hash codes may be suboptimal. In this paper, a new Deep Hashing with Top Similarity Preserving (DHTSP) method is proposed to optimize the quality of hash codes for image retrieval. Specifically, we utilize AlexNet to extract discriminative image representations directly from the raw image pixels and learn hash functions simultaneously. Then a top similarity preserving loss function is designed to preserve the similarity of returned images at the top of the ranking list. Experimental results on three benchmark datasets show that our proposed method outperforms most of state-of-the-art deep hashing methods and traditional hashing methods.","authors":["Qiang Li","Haiyan Fu","Xiangwei Kong","Qi Tian"],"meta":["September 2018Multimedia Tools and Applications 77(12)","DOI:10.1007/s11042-017-5596-7","Project: retrieval"],"references":["319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770387_Deep_Sparse_Rectifier_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","318830369_Dynamic_Multi-View_Hashing_for_Online_Image_Retrieval","317083900_Query-adaptive_late_fusion_for_image_search_and_person_re-identification","313239027_NUS-WIDE_a_real-world_web_image_database_from_National_University_of_Singapore","310751682_Bayes_merging_of_multiple_vocabularies_for_scalable_image_retrieval","308868076_Simultaneous_feature_learning_and_hash_coding_with_deep_neural_networks","308862713_Supervised_Discrete_Hashing"]}