{"id":"323070498_A_Novel_Computational_Method_for_Detecting_DNA_Methylation_Sites_with_DNA_Sequence_Information_and_Physicochemical_Properties","abstract":"DNA methylation is an important biochemical process, and it has a close connection with many types of cancer. Research about DNA methylation can help us to understand the regulation mechanism and epigenetic reprogramming. Therefore, it becomes very important to recognize the methylation sites in the DNA sequence. In the past several decades, many computational methods-especially machine learning methods-have been developed since the high-throughout sequencing technology became widely used in research and industry. In order to accurately identify whether or not a nucleotide residue is methylated under the specific DNA sequence context, we propose a novel method that overcomes the shortcomings of previous methods for predicting methylation sites. We use k-gram, multivariate mutual information, discrete wavelet transform, and pseudo amino acid composition to extract features, and train a sparse Bayesian learning model to do DNA methylation prediction. Five criteria-area under the receiver operating characteristic curve (AUC), Matthew's correlation coefficient (MCC), accuracy (ACC), sensitivity (SN), and specificity-are used to evaluate the prediction results of our method. On the benchmark dataset, we could reach 0.8632 on AUC, 0.8017 on ACC, 0.5558 on MCC, and 0.7268 on SN. Additionally, the best results on two scBS-seq profiled mouse embryonic stem cells datasets were 0.8896 and 0.9511 by AUC, respectively. When compared with other outstanding methods, our method surpassed them on the accuracy of prediction. The improvement of AUC by our method compared to other methods was at least 0.0399 . For the convenience of other researchers, our code has been uploaded to a file hosting service, and can be downloaded from: https://figshare.com/s/0697b692d802861282d3.","authors":["Gaofeng Pan","Limin Jiang","Jijun Tang","Fei Guo"],"meta":["February 2018International Journal of Molecular Sciences 19(2)","DOI:10.3390/ijms19020511","Project: DNA Sequence Analysis"],"references":["320462826_Impact_of_Natural_Compounds_on_DNA_Methylation_Levels_of_the_Tumor_Suppressor_Gene_RASSF1A_in_Cancer","320119313_Improved_detection_of_DNA-binding_proteins_via_compression_technology_on_PSSM_information","319145767_An_Ameliorated_Prediction_of_Drug-Target_Interactions_Based_on_Multi-Scale_Discrete_Wavelet_Transform_and_Network_Features","316024160_DeepCpG_Accurate_prediction_of_single-cell_DNA_methylation_states_using_deep_learning","309324003_Genetic_Variants_and_Multiple_Sclerosis_Risk_Gene_SLC9A9_Expression_in_Distinct_Human_Brain_Regions","308762755_Predicting_protein-protein_interactions_via_multivariate_mutual_information_of_protein_sequences","317621848_A_refined_DNA_methylation_detection_method_using_MspJI_coupled_quantitative_PCR","316975001_DIRECTION_A_machine_learning_framework_for_predicting_and_characterizing_DNA_methylation_and_hydroxymethylation_in_mammalian_genomes","310049300_Epigenetic_Basis_of_Human_Cancer","303397827_Integrating_genome-wide_association_studies_and_gene_expression_data_highlights_dysregulated_multiple_sclerosis_risk_pathways"]}