{"id":"323094264_A_New_Greedy_Insertion_Heuristic_Algorithm_with_a_Multi-Stage_Filtering_Mechanism_for_Energy-Efficient_Single_Machine_Scheduling_Problems","abstract":"To improve energy efficiency and maintain the stability of the power grid, time-of-use (TOU) electricity tariffs have been widely used around the world, which bring both opportunities and challenges to the energy-efficient scheduling problems. Single machine scheduling problems under TOU electricity tariffs are of great significance both in theory and practice. Although methods based on discrete-time or continuous-time models have been put forward for addressing this problem, they are deficient in solution quality or time complexity, especially when dealing with large-size instances. To address large-scale problems more efficiently, a new greedy insertion heuristic algorithm with a multi-stage filtering mechanism including coarse granularity and fine granularity filtering is developed in this paper. Based on the concentration and diffusion strategy, the algorithm can quickly filter out many impossible positions in the coarse granularity filtering stage, and then, each job can find its optimal position in a relatively large space in the fine granularity filtering stage. To show the effectiveness and computational process of the proposed algorithm, a real case study is provided. Furthermore, two sets of contrast experiments are conducted, aiming to demonstrate the good application of the algorithm. The experiments indicate that the small-size instances can be solved within 0.02 s using our algorithm, and the accuracy is further improved. For the large-size instances, the computation speed of our algorithm is improved greatly compared with the classic greedy insertion heuristic algorithm.","authors":["Hongliang Zhang","Youcai Fang","Ruilin Pan","Chuanming Ge"],"meta":["February 2018Algorithms 11(2):18","DOI:10.3390/a11020018"],"references":["321238420_Research_on_Energy-Saving_Scheduling_of_a_Forging_Stock_Charging_Furnace_Based_on_an_Improved_SPEA2_Algorithm","312482108_Distributed_Demand_Side_Management_with_Battery_Storage_for_Smart_Home_Energy_Scheduling","281966238_Scheduling_on_a_single_machine_under_time-of-use_electricity_tariffs","316041554_Energy-efficient_bi-objective_single-machine_scheduling_with_power-down_mechanism","315960301_Energy-conscious_unrelated_parallel_machine_scheduling_under_time-of-use_electricity_tariffs","312076126_Energy-efficient_permutation_flow_shop_scheduling_problem_using_a_hybrid_multi-objective_backtracking_search_algorithm","305890096_Bi-objective_optimization_of_a_single_machine_batch_scheduling_problem_with_energy_cost_consideration","301329953_An_efficient_greedy_insertion_heuristic_for_energy-conscious_single_machine_scheduling_problem_under_time-of-use_electricity_tariffs","283513674_Parallel_Machine_Scheduling_Under_Time-of-Use_Electricity_Prices_New_Models_and_Optimization_Approaches","278716628_Sustainable_performance_oriented_operational_decision-making_of_single_machine_systems_with_deterministic_product_arrival_time"]}