{"id":"323082156_Using_machine_learning_to_predict_student_difficulties_from_learning_session_data","abstract":"The student’s performance prediction is an important research topic because it can help teachers prevent students from dropping out before final exams and identify students that need additional assistance. The objective of this study is to predict the difficulties that students will encounter in a subsequent digital design course session. We analyzed the data logged by a technology-enhanced learning (TEL) system called digital electronics education and design suite (DEEDS) using machine learning algorithms. The machine learning algorithms included an artificial neural networks (ANNs), support vector machines (SVMs), logistic regression, Naïve bayes classifiers and decision trees. The DEEDS system allows students to solve digital design exercises with different levels of difficulty while logging input data. The input variables of the current study were average time, total number of activities, average idle time, average number of keystrokes and total related activity for each exercise during individual sessions in the digital design course; the output variables were the student(s) grades for each session. We then trained machine learning algorithms on the data from the previous session and tested the algorithms on the data from the upcoming session. We performed k-fold cross-validation and computed the receiver operating characteristic and root mean square error metrics to evaluate the models’ performances. The results show that ANNs and SVMs achieve higher accuracy than do other algorithms. ANNs and SVMs can easily be integrated into the TEL system; thus, we would expect instructors to report improved student’s performance during the subsequent session.","authors":["Mushtaq Hussain","Wenhao Zhu","Wu Zhang","Raza Abidi"],"meta":["June 2019Artificial Intelligence Review 52(1):1-27","DOI:10.1007/s10462-018-9620-8","Projects: Build Teaching Dashboard for real time moodle system using Deep Learning and DjangoMining e-learning system data to find different pattern of student"],"references":["317598093_Predicting_Student_Retention_from_Behavior_in_an_Online_Orientation_Course","316109475_A_Learning_Analytics_Approach_to_Correlate_the_Academic_Achievements_of_Students_with_Interaction_Data_from_an_Educational_Simulator","314105046_Learning_pulse_a_machine_learning_approach_for_predicting_performance_in_self-regulated_learning_using_multimodal_data","313736599_Data-driven_system_to_predict_academic_grades_and_dropout","308276194_Models_for_early_prediction_of_at-risk_students_in_a_course_using_standards-based_grading","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","317423104_Unsupervised_learning_for_understanding_student_achievement_in_a_distance_learning_setting","314105851_Modeling_exploration_strategies_to_predict_student_performance_within_a_learning_environment_and_beyond","314099468_Ouroboros_early_identification_of_at-risk_students_without_models_based_on_legacy_data","311610937_Prediction_of_students_performance_using_Educational_Data_Mining"]}