{"id":"323118933_Updating_Dynamic_Random_Hyperbolic_Graphs_in_Sublinear_Time","abstract":"Generative network models play an important role in algorithm development, scaling studies, network analysis, and realistic system benchmarks for graph data sets. A complex network model gaining considerable popularity builds random hyperbolic graphs, generated by distributing points within a disk in the hyperbolic plane and then adding edges between points with a probability depending on their hyperbolic distance.\nWe present a dynamic extension to model gradual network change, while preserving at each step the point position probabilities. To process the dynamic changes efficiently, we formalize the concept of a probabilistic neighborhood: Let P be a set of n points in Euclidean or hyperbolic space, q a query point, dist a distance metric, and f : R⁺ → &lsqb;0, 1&rsqb; a monotonically decreasing function. Then, the probabilistic neighborhood N(q, f) of q with respect to f is a random subset of P and each point p ∈ P belongs to N(q, f) with probability f(dist(p, q)). We present a fast, sublinear-time query algorithm to sample probabilistic neighborhoods from planar point sets. For certain distributions of planar P, we prove that our algorithm answers a query in O((&verbar;N(q, f)&verbar; + √n) log n) time with high probability. This enables us to process a node movement in random hyperbolic graphs in sublinear time, resulting in a speedup of about one order of magnitude in practice compared to the fastest previous approach. Apart from that, our query algorithm is also applicable to Euclidean geometry, making it of independent interest for other sampling or probabilistic spreading scenarios.","authors":["Moritz von Looz","Henning Meyerhenke"],"meta":["February 2018Journal of Experimental Algorithmics 23(1)","DOI:10.1145/3195635"],"references":["311313900_Generating_massive_complex_networks_with_hyperbolic_geometry_faster_in_practice","311154155_Generating_Scaled_Replicas_of_Real-World_Complex_Networks","307904341_Generating_Scaled_Replicas_of_Real-World_Complex_Networks","300218249_Generating_Random_Hyperbolic_Graphs_in_Subquadratic_Time","283733005_NetworKit_A_Tool_Suite_for_Large-scale_Complex_Network_Analysis","283471149_Geometric_Inhomogeneous_Random_Graphs","323715289_Efficient_Embedding_of_Scale-Free_Graphs_in_the_Hyperbolic_Plane","305998281_Querying_Probabilistic_Neighborhoods_in_Spatial_Data_Sets_Efficiently","303800016_The_probability_of_connectivity_in_a_hyperbolic_model_of_complex_networks","285649018_On_the_Diameter_of_Hyperbolic_Random_Graphs"]}