{"id":"323199742_L'enseignement_pris_a_partie_etude_d'un_phenomene_de_deludicisation","abstract":"[English below] \n-------------------------------------------------------------------\nDans la salle de classe, des « learning games » sont utilisés pour transmettre de manière plaisante le savoir aux apprenants. Mais en travaillant sur le cas d’un jeu sérieux utilisé pour l’apprentissage du génie mécanique, cette étude vise à interroger les individus qui, dans leur activité de travail, doivent prescrire le jeu aux élèves : les enseignants eux-mêmes. En élargissant l’étude des rapports du jeu au travail depuis le joueur vers une analyse de l’activité de l’enseignant, des contextes sociopolitiques et des impératifs organisationnels de l’apprentissage, la notion de déludicisation servira à analyser le travail d’organisation des travailleurs au prisme des arbitrages réalisés entre activité de jeu et activité de travail.\n-------------------------------------------------\nIn the classroom, \"learning games\" are used to transmit knowledge to learners in a pleasant way. But this case study of a serious game used to teach mechanical engineering aims to question those specific individuals who, in their labor activity, must prescribe the act of playing to students: the teachers themselves. By broadening the interrogation of the relationship between game and work from the player to the analysis of the teacher activity, the socio-political contexts and the organizational imperatives of learning, the notion of degamification will be used to analyze workers’ organizing work to the prism of arbitration achieved between play activity and work activity.","authors":["Victor Potier"],"meta":["March 2018Travailler 39(39):33 - 55","DOI:10.3917/trav.039.0033","Project: Déludicisation"],"references":["314266241_Undesigned_Cooperation_within_a_Serious_Game_Observations_during_a_Mechanical_Engineering_Course","282531138_Une_approche_situee_et_critique_du_concept_de_gamification","32231969_La_captation_des_publics_entre_dispositifs_et_dispositions_ou_le_petit_chaperon_rouge_revisite","324378567_Le_sens_pratique","316695917_Tensions_entre_innovations_et_prescriptions_numeriques_au_lycee_Archimede","311612671_L'innovation_pedagogique_en_contexte_numerique","311612573_Le_lycee_en_regime_numerique_Usages_et_compositions_des_acteurs","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives","44827970_L'acteur_et_le_systeme_Les_contraintes_de_l'action_collective_Le_Seuil_Paris"]}