{"id":"323159589_Investigating_Learners'_Technology_Engagement_-_A_Perspective_From_Ubiquitous_Game-Based_Learning_in_Smart_Campus","abstract":"With the increasing development of information technology and emerging of modern mobile devices, researchers have been shedding light on the integration of ubiquitous learning and online games in the construction of smart campus, aiming to enhance online users’ learning performance and perceptions. However, challenges of such blend learning model, for example how to avoid the learners’ distraction from online games, triggered many concerns from software engineers and educators. The current study investigated the factors and driving mechanism to construct a learner’s technology engagement model (TEM) towards ubiquitous game-based learning in the smart campus context. Based on the Technology Acceptance Model (TAM) and the Media system dependency theory (MSD), this study identified the relationships among Individual Expectation (IE), Facility Environment (FE), Social Environment (SE) and Technology Engagement (TE). A total of 168 participants, who were randomly assigned in the ubiquitous game-based learning settings, took part in the investigation. SPSS 19.0 was employed to analyze factorial validity, internal consistency reliability, correlation and multiple regression analyses. The result shows that learners’ technology engagement toward Ubiquitous Game-based Learning (UGL) was influenced directly by individual expectation (including fragmented learning and infotainment learning) and social environment (including peer coaching and parental supports). Additionally, the ease of use significantly moderated the fragmented learning and technology engagement in the context of smart campus, while it was an insignificant moderator of infotainment. Besides, the ease of use significantly moderated the coaching of peers and technology engagement, while failed to moderate the parental supports and technology engagements. The theoretical and practical implications are finally discussed in terms of the development tendency of the construction of smart campus with UGL model.","authors":["Xuesong Zhai","Yan Dong","Jing Yuan"],"meta":["February 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2805758"],"references":["311969992_Social_media_use_in_the_career_development_of_graduate","311644620_Structural_equation_modeling_and_regression_guidelines_for_research_practice","318132605_Smart_Pedagogy_for_Smart_Universities","315514246_The_motivational_pull_of_video_game_feedback_rules_and_social_interaction_Another_self-determination_theory_approach","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","312613995_On_the_Evaluation_of_Structural_Equation_Models","309893885_Technology_use_by_pre-service_teachers_during_teaching_practice_Are_new_teachers_embracing_technology_right_away_in_their_first_teaching_experience","308186561_Adaptive_3D_Virtual_Learning_Environments_-_A_Review_of_the_Literature","302578399_The_Effects_of_Game-Based_Learning_and_Anticipation_of_a_Test_on_the_Learning_Outcomes_of_10th_Grade_Geology_Students","296707253_HoningStone_Building_Creative_Combos_With_Honing_Theory_for_a_Digital_Card_Game"]}