{"id":"323150553_A_multi-armed_bandit_solver_method_for_adaptive_power_allocation_in_device-to-device_communication","abstract":"Device to device (D2D) communication has attracted enormous attention for future cellular networks which helps to increase the cellular capacity, improve the user throughput, and extend the battery lifetime of user equipments (UEs) by reusing the spectrum resources. However, D2D devices provide interferences in the system while reusing the resources. Proper control of interferences helps to increase the performance of the overall system. Adaptive power allocation among cellular and D2D users contributes to providing an efficient interference management system. In this paper, we propose an online power allocation method, i.e., multi-armed bandit solver for D2D communication. We explore the proposed method to improve the system throughput and D2D throughput as well. We incorporate the set of states for this learning algorithm with the appropriate number of system-defined variables, which increases the observation space and consequently improve the balance of spectrum usage. Finally, we compare our proposed work with existing distributed reinforcement learning and random allocation of resources. Simulation results depict that the proposed resource allocation method outperforms the existing works regarding overall system throughput as well as D2D throughput by efficiently controlling the interference levels.","authors":["Muhidul Islam Khan","Muhammad Mahtab Alam","Yannick Le Moullec"],"meta":["May 2018","Conference: International Workshop on Recent Advances in Cellular Technologies and 5G for IoT Environments (RACT-5G-IoT)","Project: [H2020] COEL: ERA-Chair of Cognitive Electronics, Thomas Johann Seebeck Department of Electronics,  Tallinn University of Technology, Estonia"],"references":["289706644_Resource-aware_task_scheduling_by_an_adversarial_bandit_solver_method_in_wireless_sensor_networks","224088484_Device-to-Device_communication_as_an_underlay_to_LTE-Advanced_networks","313630745_The_nonstochastic_multiarmed_bandit_problem","312246409_Q-learning_based_power_control_algorithm_for_D2D_communication","307303220_Optimal_QoS-Aware_Channel_Assignment_in_D2D_Communications_with_Partial_CSI","301408432_Dynamic_resource_allocations_based_on_Q-learning_for_D2D_communication_in_cellular_networks","300078430_An_adaptive_resource_allocation_scheme_for_device-to-device_communication_underlaying_cellular_networks","221643171_A_QoS-Aware_Power_Optimization_Scheme_in_OFDMA_Systems_with_Integrated_Device-to-Device_D2D_Communications","3416682_A_general_correlation_model_for_shadow_fading_in_mobile_radio_systems"]}