{"id":"323142007_Review_of_Smart_Meter_Data_Analytics_Applications_Methodologies_and_Challenges","abstract":"The widespread popularity of smart meters enables an immense amount of fine-grained electricity consumption data to be collected. Meanwhile, the deregulation of the power industry, particularly on the delivery side, has continuously been moving forward worldwide. How to employ massive smart meter data to promote and enhance the efficiency and sustainability of the power grid is a pressing issue. To date, substantial works have been conducted on smart meter data analytics. To provide a comprehensive overview of the current research and to identify challenges for future research, this paper conducts an application-oriented review of smart meter data analytics. Following the three stages of analytics, namely, descriptive, predictive and prescriptive analytics, we identify the key application areas as load analysis, load forecasting, and load management. We also review the techniques and methodologies adopted or developed to address each application. In addition, we also discuss some research trends, such as big data issues, novel machine learning technologies, new business models, the transition of energy systems, and data privacy and security.","authors":["Yi Wang","Qixin Chen","Tao Hong","Chongqing Kang"],"meta":["May 2019IEEE Transactions on Smart Grid 10(3):3125-3148","DOI:10.1109/TSG.2018.2818167","Project: Theory and methodology of generalized dynamic demand response towards urban energy system"],"references":["323845770_Combining_Probabilistic_Load_Forecasts","323019263_An_Ensemble_Forecasting_Method_for_the_Aggregated_Load_With_Subprofiles","322992299_Deep_Learning-Based_Socio-Demographic_Information_Identification_From_Smart_Meter_Data","322937838_Using_peer-to-peer_energy-trading_platforms_to_incentivize_prosumers_to_form_federated_power_plants","322701110_Probabilistic_Peak_Load_Estimation_in_Smart_Cities_Using_Smart_Meter_Data","324872629_Training_Energy_Data_Scientists_Universities_and_Industry_Need_to_Work_Together_to_Bridge_the_Talent_Gap","324872484_Big_Data_Analytics_Making_the_Smart_Grid_Smarter_Guest_Editorial","324872372_Weather_Data_for_Energy_Analytics_From_Modeling_Outages_and_Reliability_Indices_to_Simulating_Distributed_Photovoltaic_Fleets","324871886_Visualizing_Big_Energy_Data_Solutions_for_This_Crucial_Component_of_Data_Analysis","323229703_False_Load_Attack_to_Smart_Meters_by_Synchronously_Switching_Power_Circuits"]}