{"id":"323164302_Generative_Adversarial_Networks_for_Hyperspectral_Image_Classification","abstract":"A Generative Adversarial Network (GAN) usually contains a generative network and a discriminative network in competition with each other. The GAN has shown their capability in a variety of applications. In this paper, the usefulness and effectiveness of GAN for classification of hyperspectral images (HSIs) is explored for the first time. In the proposed GAN, a convolutional neural network (CNN) is designed to discriminate the inputs and another CNN is used to generate so-called fake inputs. The aforementioned CNNs are trained together: The generative CNN tries to generate fake inputs that are as real as possible, and the discriminative CNN tries to classify the real and fake inputs. This kind of adversarial training improves the generalization capability of the discriminative CNN, which is really important when the training samples are limited. Specifically, we propose two schemes: (1) a well-designed 1D-GAN as a spectral classifier, and (2) a robust 3D-GAN is as a spectral-spatial classifier. Furthermore, the generated adversarial samples are used with real training samples to fine-tune the discriminative CNN, which improves the final classification performance. The proposed classifiers are carried out on three widely-used hyperspectral datasets: Salinas, Indiana Pines, and Kennedy Space Center. The obtained results reveal that the proposed models provide competitive results compared to the state-of-the-art methods. In addition, the proposed GANs open new opportunities in the remote sensing community for the challenging task of HSIs classification, and also, reveal the huge potential of GAN-based methods for the analysis of such complex and inherently nonlinear data. Index Terms-Convolutional neural network (CNN), deep learning, generative adversarial network (GAN), hyperspectral images classification.","authors":["Zhu Lin","Yushi Chen","Pedram Ghamisi","Jon Atli Benediktsson"],"meta":["February 2018IEEE Transactions on Geoscience and Remote Sensing PP(99)","DOI:10.1109/TGRS.2018.2805286","Projects: Hyperspectral Image Analysis Using Deep LearningFeature extraction and classification of hyperspectral images based on convolutional neural network"],"references":["322060135_Unpaired_Image-to-Image_Translation_Using_Cycle-Consistent_Adversarial_Networks","321314778_Hyperspectral_Images_Classification_With_Gabor_Filtering_and_Convolutional_Neural_Network","320516991_Generative_Adversarial_Networks_An_Overview","320094124_Locality_Adaptive_Discriminant_Analysis_for_Spectral-Spatial_Classification_of_Hyperspectral_Images","319770355_Generative_Adversarial_Nets","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318978976_Multiple_Kernel_Learning_for_Hyperspectral_Image_Classification_A_Review","317596229_Discriminative_Robust_Deep_Dictionary_Learning_for_Hyperspectral_Image_Classification","316572572_Deep_Recurrent_Neural_Networks_for_Hyperspectral_Image_Classification","315588084_Learning_to_Diversify_Deep_Belief_Networks_for_Hyperspectral_Image_Classification","313044478_Wasserstein_GAN","312097352_Advanced_Spectral_Classifiers_for_Hyperspectral_Images_A_Review","312355586_Spectral-Spatial_Classification_of_Hyperspectral_Imagery_with_3D_Convolutional_Neural_Network","311396907_Hyperspectral_Imaging_Techniques_for_Spectral_Detection_and_Classification","309713252_Hyperspectral_Image_Classification_Using_Deep_Pixel-Pair_Features"]}