{"id":"323196994_Sorting_Through_the_Safety_Data_Haystack_Using_Machine_Learning_to_Identify_Individual_Case_Safety_Reports_in_Social-Digital_Media","abstract":"IntroductionThere is increasing interest in social digital media (SDM) as a data source for pharmacovigilance activities; however, SDM is considered a low information content data source for safety data. Given that pharmacovigilance itself operates in a high-noise, lower-validity environment without objective ‘gold standards’ beyond process definitions, the introduction of large volumes of SDM into the pharmacovigilance workflow has the potential to exacerbate issues with limited manual resources to perform adverse event identification and processing. Recent advances in medical informatics have resulted in methods for developing programs which can assist human experts in the detection of valid individual case safety reports (ICSRs) within SDM. Objective\nIn this study, we developed rule-based and machine learning (ML) models for classifying ICSRs from SDM and compared their performance with that of human pharmacovigilance experts. Methods\nWe used a random sampling from a collection of 311,189 SDM posts that mentioned Roche products and brands in combination with common medical and scientific terms sourced from Twitter, Tumblr, Facebook, and a spectrum of news media blogs to develop and evaluate three iterations of an automated ICSR classifier. The ICSR classifier models consisted of sub-components to annotate the relevant ICSR elements and a component to make the final decision on the validity of the ICSR. Agreement with human pharmacovigilance experts was chosen as the preferred performance metric and was evaluated by calculating the Gwet AC1 statistic (gKappa). The best performing model was tested against the Roche global pharmacovigilance expert using a blind dataset and put through a time test of the full 311,189-post dataset. ResultsDuring this effort, the initial strict rule-based approach to ICSR classification resulted in a model with an accuracy of 65% and a gKappa of 46%. Adding an ML-based adverse event annotator improved the accuracy to 74% and gKappa to 60%. This was further improved by the addition of an additional ML ICSR detector. On a blind test set of 2500 posts, the final model demonstrated a gKappa of 78% and an accuracy of 83%. In the time test, it took the final model 48 h to complete a task that would have taken an estimated 44,000 h for human experts to perform. Conclusion\nThe results of this study indicate that an effective and scalable solution to the challenge of ICSR detection in SDM includes a workflow using an automated ML classifier to identify likely ICSRs for further human SME review.","authors":["Shaun Comfort","Sujan Perera","Zoe Hudson","Darren Dorrell"],"meta":["February 2018Drug Safety 41(6)","DOI:10.1007/s40264-018-0641-7"],"references":["313278332_Using_Social_Listening_Data_to_Monitor_Misuse_and_Nonmedical_Use_of_Bupropion_A_Content_Analysis","312036444_Evaluation_of_Facebook_and_Twitter_Monitoring_to_Detect_Safety_Signals_for_Medical_Products_An_Analysis_of_Recent_FDA_Safety_Alerts","312034749_The_Use_of_Social_Media_in_ADR_Monitoring_and_Reporting","307918240_Can_social_media_data_lead_to_earlier_detection_of_drug-related_adverse_events_Social_Media_Data_and_Drug-related_Adverse_Events","328409717_Cobert's_Manual_of_Drug_Safety_and_Pharmacovigilance","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","316176244_Using_Social_Media_Data_in_Routine_Pharmacovigilance_A_Pilot_Study_to_Identify_Safety_Signals_and_Patient_Perspectives","315653230_Deep_learning_for_pharmacovigilance_Recurrent_neural_network_architectures_for_labeling_adverse_drug_reactions_in_Twitter_posts","307875608_Social_Media_Monitoring_and_Adverse_Drug_Reaction_Reporting_in_Pharmacovigilance","304579416_Sentiment_classification_on_customer_feedback_data_Noisy_data_large_feature_vectors_and_the_role_of_linguistic_analysis","273786930_Pharmacovigilance_from_social_media_Mining_adverse_drug_reaction_mentions_using_sequence_labeling_with_word_embedding_cluster_features","272753186_Utilizing_Social_Media_Data_for_Pharmacovigilance_A_Review","271170427_If_Nothing_Goes_Wrong_Is_Everything_All_Right","267656530_Guesstimation_20_Solving_the_world's_problems_on_the_back_of_a_napkin","267454088_Analysis_of_Named_Entity_Recognition_and_Linking_for_Tweets"]}