{"id":"323176721_Institutional_logics_of_Chinese_doctoral_education_system","abstract":"As Chinese doctoral education has grown dramatically in the past four decades and developed into one of the largest doctoral education systems in the world, it has become one significant and integral part of the global doctoral education landscape. However, in the literature, there is a lack of both a comprehensive understanding of the Chinese doctoral education system and of generic frameworks for understanding doctoral education in a global context, with an emphasis on the underlying value systems. This may not only hamper the research on doctoral education in China but also affect international comparison and collaboration with Chinese doctoral education. Using the theory of institutional logics, this study tries to bridge the gap by identifying the complex value systems underlying the context of the Chinese doctoral education system, through a qualitative study mainly based on interview data and complemented by documentary data. The interview involves 135 participants, including 45 university academic leaders, 33 doctoral supervisors and 56 doctoral students from 17 research universities, as well as one government policy-maker. We found that the context of Chinese doctoral education system consists of multiple logics of state, profession, family, market and corporation. The special constellation of institutional logics has shaped the current Chinese doctoral education system as a state-led model but meanwhile incorporating family characteristics, market orientation and regulated academic autonomy. The study also showed that Chinese doctoral education has been developing in line with international academic norms and global marketization trends, and has also been shaped by China’s socio-cultural tradition and the strong state regulation. In addition to the institutional logics analysis of the Chinese doctoral education system, this study paves the way for developing a novel framework for analysing doctoral education systems in other contexts and for comparative purposes.","authors":["Gaoming Zheng","Wenqin Shen","Yuzhuo Cai"],"meta":["November 2018Higher Education 76(1)","DOI:10.1007/s10734-018-0236-3","Project: EU-China Doctoral Education"],"references":["321925700_Reproducing_academic_successors_or_cultivating_versatile_experts_influences_of_doctoral_training_on_career_expectations_of_Chinese_PhD_students","321343995_Indigenous_knowledges_and_supervision_Changing_the_lens","320423107_The_cultural_mission_of_China's_elite_universities_examples_from_Peking_and_Tsinghua","344899776_China's_Universities_1895-1995","344614941_Cultural_Foundations_of_Chinese_Education","343506064_The_Higher_Education_System_Academic_Organization_in_Cross-National_Perspective","337202489_Comparing_Doctoral_Education_in_China_and_Finland_An_Institutional_Logics_Perspective","318519449_The_Higher_Education_System_Academic_Organization_in_Cross-National_Perspective","317987650_Academic_socialization_of_Chinese_doctoral_students_in_Germany_identification_interaction_and_motivation","315805456_Organizational_Configurations_of_Modern_Universities_Institutional_Logics_and_Public_Policies_Towards_an_Integrative_Framework","314949850_Towards_an_analytical_framework_for_understanding_the_development_of_a_quality_assurance_system_in_an_international_joint_programme","314443118_Reforms_and_collaborations_in_Europe-China_doctoral_education","314443116_University_academic_promotion_system_and_academic_identity_An_institutional_logics_perspective","311994544_East-West_Crosscurrents_in_Higher_Education","309435832_Universities_as_Hybrids_Applications_of_Institutional_Logics_Theory_to_Higher_Education"]}