{"id":"323150894_MCA_Degree_Beyond_traditional_Mathematical_Logical_Prerequisite_Concentration_Is_it_into_a_new_Direction","abstract":"In Indian academic segment, Computer Application is one of the important and popular programs of study. The term Computer Application in India treated as a domain rather conveying meaning-application of computing. Computer Application programs available with Bachelors and Masters degree program leading to BCA and MCA degree. The program applied in nature and mainly dedicated to prepare skilled manpower in the segment of the software industry. Further, Computer Application program is responsible for the creation of manpower for the industries, organizations, and institutions. The initial period of Computer Application program was restricted only to MCA program and gradually the undergraduate program has been offered by many Indian universities. The main aim of introducing MCA program over the existing Masters in Computer Sciences was to make students skilled in computing and information technology industry with diverse undergraduate/ bachelor degrees background. Although as an Applied Science program MCA opened up the door for the bachelors degree holders with the condition of having completed at least one paper/ course in Mathematics etc. However, in recent past, many universities have been taken initiative for offering MCA program without entrance eligibility on Mathematics. Such universities offer the MCA program to the holders of Computing/ Computer Sciences or allied subject as a paper and gradually many have started to offer the same with that prerequisite. This paper is first time exploring such academic affairs in the form of scientific research. The paper is of theoretical nature with mentioned current and future potentials as well beyond mathematical prerequisite and curricula and job potentialities with cases of Indian Private Universities.","authors":["P.K. Paul","A Bhuimali","Sreeramana Aithal","K S Shivraj"],"meta":["January 2018Journal of Advanced Applied Scientific Research 3(1)","DOI:10.5281/zenodo.1171067","Project: Higher Education System"],"references":["322138587_Indian_Higher_Education_With_Slant_to_Information_Technology-_A_Fundamental_Overview","322138395_Computing_Allied_Engineering_Domain_in_India_with_reference_to_Private_Universities_A_Case_Study_of_Bachelors_Programs","322138390_MCA_Information_Science_and_Management_The_Next_Generation_Interdisciplinary_specialization_for_Social_Business_Health_Mathematical_Sciences-A_Step_for_promoting_Digital_Humanities","259686609_The_Interface_of_Technology_and_Medical_Education_in_India_Current_trends_and_scope","330162859_MCA_Information_Science_and_Management_The_Next_Generation_Interdisciplinary_specialization_for_Social_Business_Health_and_Mathematical_SciencesA_Step_for_promoting_Digital_Humanities","320674521_A_Novel_Educational_Proposal_and_Strategies_Toward_Promoting_Cloud_Computing_Big_Data_and_Human-Computer_Interaction_in_Engineering_Colleges_and_Universities","286062638_Sociology_of_Education_in_India_Changing_Contours_and_Emerging_Concerns","285122379_Developing_interpretive_structural_model_for_quality_framework_in_higher_education_Indian_context","267369946_Higher_Education_in_India_Structure_Statistics_and_Challenges","266604863_Technical_Education_in_North_Eastern_India_Problems_and_prospects"]}