{"id":"323141776_Ethical_and_Social_Aspects_of_Self-Driving_Cars","abstract":"As an envisaged future of transportation, self-driving cars are being discussed from various perspectives, including social, economical, engineering, computer science, design, and ethics. On the one hand, self-driving cars present new engineering problems that are being gradually successfully solved. On the other hand, social and ethical problems are typically being presented in the form of an idealized unsolvable decision-making problem, the so-called trolley problem, which is grossly misleading. We argue that an applied engineering ethical approach for the development of new technology is what is needed; the approach should be applied, meaning that it should focus on the analysis of complex real-world engineering problems. Software plays a crucial role for the control of self-driving cars; therefore, software engineering solutions should seriously handle ethical and social considerations. In this paper we take a closer look at the regulative instruments, standards, design, and implementations of components, systems, and services and we present practical social and ethical challenges that have to be met, as well as novel expectations for software engineering.","authors":["Tobias Holstein","Gordana Dodig Crnkovic","Patrizio Pelliccione"],"meta":["February 2018","Project: Ethics in the Future of Transportation"],"references":["318082024_Autonomous_Vehicle_Ethics_Stock_or_custom","317922915_Risk-Based_Decision-Making_Fallacies_Why_Present_Functional_Safety_Standards_are_Not_Enough","317551489_The_Experience_of_Ethics_Evaluation_of_Self_Harm_Risks_in_Automated_Vehicles","317485812_Is_Driverless_Car_Another_Weiserian_Mistake","315098777_Towards_Moral_Autonomous_Systems","312597416_Why_a_Right_to_Explanation_of_Automated_Decision-Making_Does_Not_Exist_in_the_General_Data_Protection_Regulation","312119614_Self-driving_Cars_in_Dilemmatic_Situations_An_Approach_Based_on_the_Theory_of_Justification_in_Criminal_Law","327918755_Ethical_IT_Innovation_A_Value-Based_System_Design_Approach","314033799_Automotive_Architecture_Framework_The_Experience_of_Volvo_Cars","313804015_Basic_requirements_for_proven-in-use_arguments"]}