{"id":"323129191_Does_descriptive_text_change_how_people_look_at_art_A_novel_analysis_of_eye-movements_using_data-driven_Units_of_Interest","abstract":"Does reading a description of an artwork affect how a person subsequently views it? In a\ncontrolled study, we show that in most cases, textual description does not influence how\npeople subsequently view paintings, contrary to participants’ self-report that they believed\nit did. To examine whether the description affected transition behaviour, we devised a\nnovel analysis method that systematically determines Units of Interest (UOIs), and calculates transitions between these, to quantify the effect of an external factor (a descriptive text) on the viewing pattern of a naturalistic stimulus (a painting). UOIs are defined using a grid-based system, where the cell-size is determined by a clustering algorithm (DBSCAN). The Hellinger distance is computed for the distance between two Markov chains using a permutation test, constructed from the transition matrices (visual shifts between UOIs) of the two groups for each painting. Results show that the description does not affect the way in which people transition between UOIs for all but one of the paintings -- an abstract work -- suggesting that description may play more of a role in determining transition behaviour when a lack of semantic cues means it is unclear how the painting should be interpreted. The contribution is twofold: to the domain of art/curation, we provide evidence that descriptive texts do not effect how people view paintings, with the possible exception of some abstract paintings; to the domain of eye-movement research, we provide a method with the potential to answer questions across multiple research areas, where the goal is to determine whether a particular factor or condition consistently affects viewing behaviour of naturalistic stimuli.","authors":["Alan Davies","Manuele Reani","Caroline Jay","Simon Harper"],"meta":["February 2018Journal of Eye Movement Research 10(4)","DOI:10.16910/jemr.10.4.4"],"references":["273835568_Areas_of_Interest_as_a_Signal_Detection_Problem_in_Behavioral_Eye-Tracking_Research","270653341_Describing_Art_-_An_Interdisciplinary_Approach_to_the_Effects_of_Speaking_on_Gaze_Movements_during_the_Beholding_of_Paintings","263364035_Keeping_Our_Eyes_on_the_Eyes_The_Case_of_Arcimboldo","316627850_Introduction_to_Robust_Estimation_and_Hypothesis_Testing","306017825_Analysis_of_Eye_Movements_with_Eyetrace","291711352_Your_labels_make_me_feel_stupid","274987059_The_white_cube_of_the_museum_versus_the_gray_cube_of_the_street_The_role_of_context_in_aesthetic_evaluations","274015857_Team_RDCR_A_Language_And_Environment_For_Statistical_Computing_R_Foundation_for_Statistical_Computing_Vienna_Austria","272520937_The_effects_of_visual_context_and_individual_differences_on_perception_and_evaluation_of_modern_art_and_graffiti_art","265386572_Looking_behaviour_and_preference_for_artworks_The_role_of_emotional_valence_and_location"]}