{"id":"323165101_Distributed_Coordinated_Transmission_with_Forward-Backward_Training_for_5G_Radio_Access","abstract":"Coordinated multipoint (CoMP) transmission and reception has been considered in cellular networks for enabling larger coverage, improved rates and interference mitigation. To harness the gains of coordinated beamforming, fast information exchange over a backhaul connecting the cooperating base stations (BSs) is required. In practice, the bandwidth and delay limitations of the backhaul may not be able to meet such stringent demands. Such impairments motivate the study of cooperative approaches based only on local channel state information (CSI) and which require minimal or no information exchange between the BSs. To this end, several distributed approaches are introduced for coordinated beamforming (CB) CoMP. The proposed methods rely on the channel reciprocity and iterative spatially precoded over-the-air pilot signaling. We elaborate how forward-backward (F-B) training facilitates distributed CB by allowing BSs and user equipments (UEs) to iteratively optimize their respective transmitters/receivers based on only locally measured CSI. The trade-off due to the overhead from the F-B iterations is discussed. We also consider the challenge of dynamic TDD where the UE-UE channel knowledge cannot be acquired at the BSs by exploiting channel reciprocity. Finally, standardization activities and practical requirements for enabling the proposed F-B training schemes in 5G radio access are discussed.","authors":["Antti Tölli","Hadi Ghauch","Jarkko Kaleva","Petri Komulainen"],"meta":["February 2018IEEE Communications Magazine 57(1)","DOI:10.1109/MCOM.2018.1700199"],"references":["273474952_Distributed_Low-Overhead_Schemes_for_Multi-Stream_MIMO_Interference_Channels","328299853_Bi-Directional_Beamformer_Training_for_Dynamic_TDD_Networks","323589802_Decentralized_Joint_Precoding_With_Pilot-Aided_Beamformer_Estimation","308825749_Bi-directional_signaling_strategies_for_dynamic_TDD_networks","304415925_Decentralized_Coherent_Coordinated_Multi-Point_Transmission_for_Weighted_Sum_Rate_Maximization","295244614_Decentralized_Sum_Rate_Maximization_With_QoS_Constraints_for_Interfering_Broadcast_Channel_Via_Successive_Convex_Approximation","276466418_Distributed_CSI_Acquisition_and_Coordinated_Precoding_for_TDD_Multicell_MIMO_Systems","269205301_Achieving_low_latency_and_energy_consumption_by_5G_TDD_mode_optimization","264574682_Bi-Directional_Training_for_Adaptive_Beamforming_and_Power_Control_in_Interference_Networks","258794306_Effective_CSI_signaling_and_decentralized_beam_coordination_in_TDD_multi-cell_MIMO_systems"]}