{"id":"323150851_The_Maximum_Clique_Interdiction_Problem","abstract":"We study the two player zero-sum Stackelberg game in which the leader interdicts (removes) a limited number of vertices from the graph, and the follower searches for the maximum clique in the interdicted graph. The goal of the leader is to derive an interdiction policy which will result in the worst possible outcome for the follower. This problem has applications in many areas, such as crime detection, prevention of outbreaks of infectious diseases and surveillance of communication networks. We design an exact solution framework based on a Bilevel Integer Linear Programming model. Thanks to the study of the polytope of the corresponding single-level reformulation, we derive a branch-and-cut algorithm and enhance it by tight combinatorial lower and upper bounds, which also allow for a drastic reduction of the size of the input graph. Our model is based on an exponential family of Clique-Interdiction Cuts whose separation requires solving the maximum clique problem. We derive an effective separation procedure based on a newly developed combinatorial algorithm that is tailored for finding maximum cliques in interdicted graphs. We assess the applicability and the limits of our exact framework on publicly available instances, including large-scale social networks with up to one hundred thousand vertices and three million edges. Most of these instances are solved to provable optimality within short computing times. Our code (which will be also publicly available) allows to analyze the resilience of (social) networks with respect to vertex-interdiction attacks, i.e., the decrease of the size of the maximum clique in function of incremental interdiction budget level.","authors":["Fabio Furini","Ivana Ljubic","Sebastien Martin","Pablo San Segundo"],"meta":["February 2019European Journal of Operational Research 277(1):112-127","DOI:10.1016/j.ejor.2019.02.028","Project: Exact Maximum Clique"],"references":["319893031_A_New_General-Purpose_Algorithm_for_Mixed-Integer_Bilevel_Linear_Programs","309463355_Interdiction_Games_and_Monotonicity","325060256_Finding_clique_clusters_with_the_highest_betweenness_centrality","324868408_The_Critical_Node_Detection_Problem_in_networks_A_survey","318032420_A_Branch_and_Price_Algorithm_for_a_Stackelberg_Security_Game","316053980_A_Value-Function-Based_Exact_Approach_for_the_Bilevel_Mixed-Integer_Programming_Problem","314033019_On_Minimization_of_the_Number_of_Branches_in_Branch-and-Bound_Algorithms_for_the_Maximum_Clique_Problem","304026774_Risk-Averse_Shortest_Path_Interdiction","303935267_Improved_Infra-Chromatic_Bound_for_Exact_Maximum_Clique_Search","303757774_ORMS_models_for_supply_chain_disruptions_a_review_social_science_research"]}