{"id":"323153146_How_Do_Scientists_Develop_Scientific_Software_An_External_Replication","abstract":"Although the goal of scientists is to do science, not to develop software, many scientists have extended their roles to include software development to their skills. However, since scientists have different background, it remains unclear how do they perceive software engineering practices or how do they acquire software engineering knowledge. In this paper we conducted an external replication of one influential 10 years paper about how scientists develop and use scientific software. In particular, we employed the same method (an on-line questionnaire) in a different population (R developers). When analyzing the more than 1,572 responses received, enriched with data gathered from their GitHub repositories, we correlated our findings with the original study. We found that the results were consistent in many ways, including: (1) scientists that develop software work mostly alone, (2) they decide themselves what they want to work on next, and (3) most of what they learnt came from self-study, rather than a formal education. However, we also uncover new facts, such as: some of the \"pain points'' regarding software development are not related to technical activities (e.g., interruptions, lack of collaborators, and lack of a reward system play a role). Our replication can help researchers, practitioners, and educators to better focus their efforts on topics that are important to the scientific community that develops software.","authors":["Gustavo Pinto","Igor Scaliante Wiese","Luiz Felipe Fronchetti Dias"],"meta":["February 2018","DOI:10.1109/SANER.2018.8330263","Conference: 25th IEEE International Conference on Software Analysis, Evolution and ReengineeringAt: Campobasso, Italy","Project: Understanding Open-Source Software and Communities"],"references":["319552273_Training_Software_Engineers_Using_Open-Source_Software_The_Professors'_Perspective","316650733_Reducing_Interruptions_at_Work_A_Large-Scale_Field_Study_of_FlowLight","303513465_More_Common_Than_You_Think_An_In-depth_Study_of_Casual_Contributors","236890306_Replication_of_empirical_studies_in_software_engineering_research_A_systematic_mapping_study","321664337_Gamification_in_Software_Engineering_Education_An_Empirical_Study","307090853_Predicting_the_Popularity_of_GitHub_Repositories","301222248_Building_knowledge_through_families_of_experiments","283597132_Guide_to_advanced_empirical_software_engineering","270513213_Programming_tools_Adventures_with_R","225888418_Personal_Opinion_Surveys"]}