{"id":"323128912_Seymour_Papert_1928-2016_Aux_sources_d'une_pensee_innovante_et_engagee","abstract":"Mathématicien et pionnier des technologies éducatives, Seymour Papert a contribué de façon décisive à l’orientation des recherches sur les environnements informatiques pour l’apprentissage humain (EIAH). Son œuvre est à l’origine d’un courant de recherche international sur l’apprentissage des mathématiques avec lequel la recherche en didactique des mathématiques entretient des relations – que l’on pourrait qualifier de dialectiques – depuis le début des années 80. Victime d’un accident en 2006 à Hanoï, où il était l’invité d’une conférence de la 17° étude ICMI2 sur l'utilisation des technologies numériques dans l'enseignement et l'apprentissage des mathématiques, Seymour Papert a dû brutalement interrompre son activité académique. Il est décédé le 31 juillet 2016.\nLa revue Recherches en Didactique des mathématiques a souhaité lui rendre hommage, c’est le sens de ce texte. Après avoir évoqué des jalons importants de la vie scientifique de Seymour Papert, ce texte revient sur deux concepts clés, micromonde et constructionnisme, qui constituent les piliers fondateurs de son œuvre.","authors":["Nicolas Balacheff"],"meta":["December 2017","Project: Bridging Didactic and TEL research in Math Ed."],"references":["323994802_Savoirs_concepts_et_situations_dans_les_premiers_apprentissages_en_programmation_et_en_algorithmique","300275420_Reflection_on_Networking_Through_the_Praxeological_Lens","270309006_LOGO_Mathematics_in_the_Classroom","260528401_Networking_theoretical_frames_The_ReMath_enterprise","251041427_Problemes_procedures_programmes_etudies_et_realises_par_des_enfants_de_CM2_utilisant_un_mini-ordinateur","226869830_Connecting_theory_and_practice_Results_from_the_teaching_of_Logo","226180158_Didactical_Complexity_of_Computational_Environments_for_the_Learning_of_Mathematics","221393161_Epistemological_domain_of_validity_of_microworlds_the_case_of_LOGO_and_Cabri-Geometre","37597063_LLOGO_An_Implementation_of_LOGO_in_LISP","37596722_Proposal_to_ARPA_for_Research_on_Artificial_Intelligence_at_MIT_1970-1971","37596720_Form_and_Content_in_Computer_Science","37596691_Teaching_Children_Thinking"]}