{"id":"323150046_Error_in_the_Reconstruction_of_Nonsparse_Images","abstract":"Sparse signals, assuming a small number of nonzero coefficients in a transformation domain, can be reconstructed from a reduced set of measurements. In practical applications, signals are only approximately sparse. Images are a representative example of such approximately sparse signals in the two-dimensional (2D) discrete cosine transform (DCT) domain. Although a significant amount of image energy is well concentrated in a small number of transform coefficients, other nonzero coefficients appearing in the 2D-DCT domain make the images be only approximately sparse or nonsparse. In the compressive sensing theory, strict sparsity should be assumed. It means that the reconstruction algorithms will not be able to recover small valued coefficients (above the assumed sparsity) of nonsparse signals. In the literature, this kind of reconstruction error is described by appropriate error bound relations. In this paper, an exact relation for the expected reconstruction error is derived and presented in the form of a theorem. In addition to the theoretical proof, the presented theory is validated through numerical simulations.","authors":["Milos Brajovic","Isidora Stanković","Milos Dakovic","Cornel Ioana"],"meta":["February 2018Mathematical Problems in Engineering 2018:1-10","DOI:10.1155/2018/4314527"],"references":["314251610_Denoising_of_sparse_images_in_impulsive_disturbance_environment","310272928_Nonsparsity_Influence_on_the_ISAR_Recovery_from_a_Reduced_Set_of_Data","303179494_Reconstruction_of_Sparse_Signals_in_Impulsive_Disturbance_Environments","316579638_Nonsparsity_influence_on_the_ISAR_recovery_from_reduced_data_Correspondence","313508668_Compressive_sensing","309338817_On_the_noise_impact_in_the_L1_based_reconstruction_of_the_sparse_time-frequency_distributions","308812174_Image_reconstruction_based_on_the_improved_compressive_sensing_algorithm","308633926_Performance_of_Compressive_Sensing_Image_Reconstruction_for_Search_and_Rescue","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","276426090_A_Survey_of_Sparse_Representation_Algorithms_and_Applications"]}