{"id":"323118564_Explicit_size_distributions_of_failure_cascades_redefine_systemic_risk_on_finite_networks","abstract":"How big is the risk that a few initial failures of nodes in a network amplify to large cascades that span a substantial share of all nodes? Predicting the final cascade size is critical to ensure the functioning of a system as a whole. Yet, this task is hampered by uncertain or changing parameters and missing information. In infinitely large networks, the average cascade size can often be well estimated by established approaches building on local tree approximations and mean field approximations. Yet, as we demonstrate, in finite networks, this average does not even need to be a likely outcome. Instead, we find broad and even bimodal cascade size distributions. This phenomenon persists for system sizes up to $10^{7}$ and different cascade models, i.e. it is relevant for most real systems. To show this, we derive explicit closed-form solutions for the full probability distribution of the final cascade size. We focus on two topological limit cases, the complete network representing a dense network with a very narrow degree distribution, and the star network representing a sparse network with a inhomogeneous degree distribution. Those topologies are of great interest, as they either minimize or maximize the average cascade size and are common motifs in many real world networks.","authors":["Rebekka Burkholz","Hans J. Herrmann","Frank Schweitzer"],"meta":["May 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-25211-3"],"references":["327068129_Modeling_infectious_disease_dynamics_in_the_complex_landscape_of_global_health","317591053_Correlations_between_thresholds_and_degrees_An_analytic_approach_to_model_attacks_and_failure_cascades","315644120_Networks_Shocks_and_Systemic_Risk","315421666_Systemic_Risk_and_Stability_in_Financial_Networks","314891537_Contagion_in_Financial_Networks","312760557_Framework_for_cascade_size_calculations_on_random_networks","312445741_Contagion_in_financial_networks_Bank_of_England_Working_Paper_No_383","311899572_Epidemic_processes_in_complex_networks","310441433_Resilience_to_contagion_in_financial_networks","308043355_Contagion_in_Financial_Networks"]}