{"id":"323180568_Current_problems_with_the_prerequisites_for_flipped_classroom_teaching---a_case_study_in_a_university_in_Northwest_China","abstract":"With the rapid advancement of IT, more and more attempts have been made to incorporate this modern technology into education. Of the newest teaching and learning devices and approaches, the use of microlectures and the idea of flipped classroom model(known as FCM) have caught the attention of many teachers. While the new teaching device and the innovative teaching approach succeed in some teachers’ classes, they are doomed to failure in others’ for this new approach involves prerequisites of which many teachers might not be fully aware of before their teaching practice, the lack of which might become barriers. This paper presents a post hoc analysis of a failed case with FCM and attempts to discuss, at a macroscopic level, problems with preconditions for FCM that currently exist, in the hope that teachers who are making an attempt at FCM can be aware of these problems and thus would make better preparation for it so as not to repeat the failure should they conduct FCM in their teaching. As are revealed by a detailed analysis of the reasons and a further deliberation on the failure with regard to a successful case, students’ inadaptability to unmonitored e-learning, teachers’ inadequate knowledge of computer science and information technology, the lack of a desirable communication platform and restrictive syllabuses may all hinder the smooth application of FCM, among which, the lack of a desirable communication platform and teachers’ lack of adequate knowledge of computer science and information technology have become a bottleneck in the application of FCM.","authors":["Yi Li"],"meta":["February 2018Smart Learning Environments 5(1)","DOI:10.1186/s40561-018-0051-4"],"references":["314410439_Costs_Effects_and_Utility_of_Microcomputer_Assisted_Instruction_in_the_Classroom","314299671_Friend_or_Foe_Flipped_Classroom_for_Undergraduate_Electrocardiogram_Learning_A_Randomized_Controlled_Study","311944245_Implementing_the_flipped_classroom_an_exploration_of_study_behaviour_and_student_performance","281608666_Seamless_flipped_learning-_A_mobile_technologyenhanced_flipped_classroom_with_effective_learning_strategies","313709855_Technology_integration_in_the_schools_Why_it_is_not_happening","311396228_The_flipped_classroom_strategy_What_is_it_and_how_can_it_best_be_used","311160268_Modified_Flipped_Classroom_Instructional_Model_in_Learning_Sciences_Course_for_Graduate_Students","305728152_Study_of_Flipped_Classroom_Teaching_Mode_Suitable_for_China's_National_Conditions","303170761_The_classroom_flip_Using_Web_course_management_tools_to_become_the_guide_on_the_side","293329867_Exploring_undergraduates'_perspectives_and_flipped_learning_readiness_in_their_flipped_classrooms"]}