{"id":"323165090_Ranking_State-of-the-art_Papers_via_Incomplete_Tournaments_Induced_by_Citations_from_Performance_Tables","abstract":"How can we find state-of-the-art papers for a given task? Is it possible to automatically maintain leaderboards in the form of partial orders between papers, based on performance on standard benchmarks? Can we detect potential anomalies in papers where some metrics improve but others degrade? Is citation count of any use in early detection of top-performing papers? Here we answer these questions, while describing our experience building a new bibliometric system that robustly mines experimental performance from papers. We propose a novel performance tournament graph with papers as nodes, where edges encode noisy performance comparison information extracted from papers. These extractions resemble (noisy) outcomes of matches in an incomplete tournament. Had they been complete and perfectly reliable, compiling a ranking would have been trivial. In the face of noisy extractions, we propose several approaches to rank papers, identify the best of them, and show that commercial academic search systems fail miserably at finding state-of-the-art papers. Contradicting faith in a steady march of science, we find widespread existence of cycles in the performance tournament, which expose potential anomalies and reproducibility issues. Using widely-used lists of state-of-the-art papers in 27 areas of Computer Science, we demonstrate that our system can effectively build reliable rankings. Our code and data sets will be placed in the public domain.","authors":["Mayank Singh","Rajdeep Sarkar","Pawan Goyal","Animesh Mukherjee"],"meta":["February 2018"],"references":["318583966_Meaningless_comparisons_lead_to_false_optimism_in_medical_machine_learning","309640954_Fully-Convolutional_Siamese_Networks_for_Object_Tracking","274090775_Modeling_the_Citation_Network_by_Network_Cosmology","257350831_Quantifying_Long-Term_Scientific_Impact","322946844_The_Ranking_of_Incomplete_Tournaments_A_Mathematician's_Guide_to_Popular_Sports","322122153_Scatteract_Automated_Extraction_of_Data_from_Scatter_Plots","316706220_ChartSense_Interactive_Data_Extraction_from_Chart_Images","303904876_Examining_Additivity_and_Weak_Baselines","301375892_Automatic_Extraction_of_Data_from_Bar_Charts","283617410_Emergence_of_Scaling_in_Random_Networks","238910391_Effect_of_the_age_of_papers_on_the_preferential_attachment_in_citation_networks","222670011_Incorporating_interactive_3-dimensional_graphics_in_astronomy_research_papers","221996591_The_PageRank_Citation_Ranking_Bringing_Order_to_the_Web","221653893_Efficient_clustering_of_high-dimensional_data_sets_with_application_to_reference_matching","221615057_Detecting_topic_evolution_in_scientific_literature_How_can_citations_help"]}