{"id":"323192524_Identification_of_a-fetoprotein-specific_T_cell_receptors_for_hepatocellular_carcinoma_immunotherapy","abstract":"Hepatocellular carcinoma (HCC) is the major form of liver cancer for which there is no effective therapy. Genetic modification with T-cell receptors (TCRs) specific for HCC-associated antigens, such as α-fetoprotein (AFP), can potentially redirect human T cells to specifically recognize and kill HCC tumor cells to achieve antitumor effects. In this study, using lentivector and peptide immunization, we identified a population of cluster of differentiation 8 (CD8) T cells in human leukocyte antigen (HLA)-A2 transgenic AAD mice that recognized AFP158 epitope on human HCC cells. Adoptive transfer of the AFP158 -specific mouse CD8 T cells eradicated HepG2 tumor xenografts as large as 2 cm in diameter in immunocompromised nonobese diabetic severe combined immunodeficient gamma knockout (NSG) mice. We then established T-cell hybridoma clones from the AFP158 -specific mouse CD8 T cells and identified three sets of paired TCR genes out of five hybridomas. Expression of the murine TCR genes redirected primary human T cells to bind HLA-A2/AFP158 tetramer. TCR gene-engineered human T (TCR-T) cells also specifically recognized HLA-A2+ AFP+ HepG2 HCC tumor cells and produced effector cytokines. Importantly, the TCR-T cells could specifically kill HLA-A2+ AFP+ HepG2 tumor cells without significant toxicity to normal primary hepatocytes in vitro. Adoptive transfer of the AFP-specific TCR-T cells could eradicate HepG2 tumors in NSG mice.\n\nConclusion: \nWe have identified AFP-specific murine TCR genes that can redirect human T cells to specifically recognize and kill HCC tumor cells, and those AFP158 -specific TCRs have a great potential to engineer a patient's autologous T cells to treat HCC tumors. (Hepatology 2018).","authors":["Wei Zhu","Yibing Peng","Lan Wang","Yuan Hong"],"meta":["February 2018Hepatology 68(2)","DOI:10.1002/hep.29844","Project: liver cancer Immunotherapy"],"references":["321679640_Inflammation-induced_IgA_cells_dismantle_anti-liver_cancer_immunity","321439889_Human_CD26high_T_cells_elicit_tumor_immunity_against_multiple_malignancies_via_enhanced_migration_and_persistence","319359411_The_Antitumor_Effects_of_Vaccine-Activated_CD8_T_Cells_Associate_with_Weak_TCR_Signaling_and_Induction_of_Stem-Like_Memory_T_Cells","311381251_Global_Regional_and_National_Cancer_Incidence_Mortality_Years_of_Life_Lost_Years_Lived_With_Disability_and_DisabilityAdjusted_Life-years_for_32_Cancer_Groups_1990_to_2015_A_Systematic_Analysis_for_the","301217939_Liver_immunology_and_its_role_in_inflammation_and_homeostasis","289523977_Prospects_for_gene-engineered_T_cell_immunotherapy_for_solid_cancers","327491425_Targeting_alpha_fetoprotein_with_TCR_engineered_T_cells_in_HCC","310793180_Global_cancer_statistics","289524933_Immune_Checkpoint_Blockade_in_Hepatocellular_Carcinoma","281520865_Cancer_immunotherapy_Harnessing_the_immune_system_to_battle_cancer"]}