{"id":"323141807_Image-Based_Synthesis_for_Deep_3D_Human_Pose_Estimation","abstract":"This paper addresses the problem of 3D human pose estimation in the wild. A significant challenge is the lack of training data, i.e., 2D images of humans annotated with 3D poses. Such data is necessary to train state-of-the-art CNN architectures. Here, we propose a solution to generate a large set of photorealistic synthetic images of humans with 3D pose annotations. We introduce an image-based synthesis engine that artificially augments a dataset of real images with 2D human pose annotations using 3D motion capture data. Given a candidate 3D pose, our algorithm selects for each joint an image whose 2D pose locally matches the projected 3D pose. The selected images are then combined to generate a new synthetic image by stitching local image patches in a kinematically constrained manner. The resulting images are used to train an end-to-end CNN for full-body 3D pose estimation. We cluster the training data into a large number of pose classes and tackle pose estimation as a $K$-way classification problem. Such an approach is viable only with large training sets such as ours. Our method outperforms most of the published works in terms of 3D pose estimation in controlled environments (Human3.6M) and shows promising results for real-world images (LSP). This demonstrates that CNNs trained on artificial images generalize well to real images. Compared to data generated from more classical rendering engines, our synthetic images do not require any domain adaptation or fine-tuning stage.","authors":["Grégory Rogez","Cordelia Schmid"],"meta":["September 2018International Journal of Computer Vision 126(9):993--1008","DOI:10.1007/s11263-018-1071-9","Project: Data synthesis for 3D human pose understanding"],"references":["325633337_Monocular_3D_Human_Pose_Estimation_in_the_Wild_Using_Improved_CNN_Supervision","322060193_Towards_3D_Human_Pose_Estimation_in_the_Wild_A_Weakly-Supervised_Approach","320971592_Learning_from_Synthetic_Humans","320964606_Coarse-to-Fine_Volumetric_Prediction_for_Single-Image_3D_Human_Pose","320964490_Procedural_Generation_of_Videos_to_Train_Deep_Action_Recognition_Networks","346988985_Deep_Kinematic_Pose_Regression","320971349_3D_Human_Pose_Estimation_from_a_Single_Image_via_Distance_Matrix_Regression","320968127_3D_Human_Pose_Estimation_2D_Pose_Estimation_Matching","320964713_Expecting_the_Unexpected_Training_Detectors_for_Unusual_Pedestrians_with_Adversarial_Imposters","319770355_Generative_Adversarial_Nets"]}