{"id":"323118941_Confluence_Modulo_Equivalence_with_Invariants_in_Constraint_Handling_Rules","abstract":"Confluence denotes the property of a state transition system that states can be rewritten in more than one way yielding the same result. Although it is a desirable property, confluence is often too strict in practical applications because it also considers states that can never be reached in practice. Additionally, sometimes states that have the same semantics in the practical context are considered as different states due to different syntactic representations. By introducing suitable invariants and equivalence relations on the states, programs may have the property to be confluent modulo the equivalence relation w.r.t. the invariant which often is desirable in practice. In this paper, a sufficient and necessary criterion for confluence modulo equivalence w.r.t. an invariant for Constraint Handling Rules (CHR) is presented. It is the first approach that covers invariant-based confluence modulo equivalence for the de facto standard semantics of CHR. There is a trade-off between practical applicability and the simplicity of proving a confluence property. Therefore, a better manageable subset of equivalence relations has been identified that allows for the proposed confluence criterion and and simplifies the confluence proofs by using well established CHR analysis methods.","authors":["Daniel Gall","Thom Frühwirth"],"meta":["February 2018"],"references":["310122616_On_Proving_Confluence_Modulo_Equivalence_for_Constraint_Handling_Rules","220986824_Observable_Confluence_for_Constraint_Handling_Rules","2684418_Operational_Semantics_and_Confluence_of_Constraint_Propagation_Rules","2248683_Confluence_and_Semantics_of_Constraint_Simplification_Rules","312835055_Confluence_Modulo_Equivalence_in_Constraint_Handling_Rules","277287135_Constraint_Handling_Rules","213878344_Confluent_Reductions_Abstract_Properties_and_Applications_to_Term_Rewriting_Systems_Abstract_Properties_and_Applications_to_Term_Rewriting_Systems","48410906_Graph_transformation_systems_in_Constraint_Handling_Rules_improved_methods_for_program_analysis"]}