{"id":"323154595_Data_Hiding_Based_on_a_Two-Layer_Turtle_Shell_Matrix","abstract":"Data hiding is a technology that embeds data into a cover carrier in an imperceptible way while still allowing the hidden data to be extracted accurately from the stego-carrier, which is one important branch of computer science and has drawn attention of scholars in the last decade. Turtle shell-based (TSB) schemes have become popular in recent years due to their higher embedding capacity (EC) and better visual quality of the stego-image than most of the none magic matrices based (MMB) schemes. This paper proposes a two-layer turtle shell matrix-based (TTSMB) scheme for data hiding, in which an extra attribute presented by a 4-ary digit is assigned to each element of the turtle shell matrix with symmetrical distribution. Therefore, compared with the original TSB scheme, two more bits are embedded into each pixel pair to obtain a higher EC up to 2.5 bits per pixel (bpp). The experimental results reveal that under the condition of the same visual quality, the EC of the proposed scheme outperforms state-of-the-art data hiding schemes.","authors":["Xiao-Zhu Xie","Chia-Chen Lin","Chin-Chen Chang"],"meta":["February 2018Symmetry 10(2):47","DOI:10.3390/sym10020047"],"references":["322323136_Efficient_Information_Hiding_Based_on_Theory_of_Numbers","321688649_A_Block-Based_Division_Reversible_Data_Hiding_Method_in_Encrypted_Images","320360918_Reversible_Dual-Image-Based_Hiding_Scheme_Using_Block_Folding_Technique","303528670_Data_hiding_based_on_extended_turtle_shell_matrix_construction_method","327102128_A_Lossless_Data_Embedding_Technique_by_Joint_Neighboring_Coding","321816277_A_novel_tree_based_method_for_data_hiding_and_integrity_in_medical_images","286725669_A_Novel_Turtle_Shell_Based_Scheme_for_Data_Hiding","285638883_Image_hiding_by_optimal_LSB_sSubstitution_and_genetic_algorithm","283828302_High_capacity_turtle_shell-based_data_hiding","266605056_High_Capacity_Data_Hiding_Scheme_for_DCT-based_Images"]}