{"id":"323160411_Recent_Advancements_in_Event_Processing","abstract":"Event processing (EP) is a data processing technology that conducts online processing of event information. In this survey, we summarize the latest cutting-edge work done on EP from both industrial and academic research community viewpoints. We divide the entire field of EP into three subareas: EP system architectures, EP use cases, and EP open research topics. Then we deep dive into the details of each subsection. We investigate the system architecture characteristics of novel EP platforms, such as Apache Storm, Apache Spark, and Apache Flink. We found significant advancements made on novel application areas, such as the Internet of Things; streaming machine learning (ML); and processing of complex data types such as text, video data streams, and graphs. Furthermore, there has been significant body of contributions made on event ordering, system scalability, development of EP languages and exploration of use of heterogeneous devices for EP, which we investigate in the latter half of this article. Through our study, we found key areas that require significant attention from the EP community, such as Streaming ML, EP system benchmarking, and graph stream processing.","authors":["Miyuru Dayarathna","Srinath Perera"],"meta":["February 2018ACM Computing Surveys 51(2):1-36","DOI:10.1145/3170432","Project: Siddhi: High Performance Stream Processing & Applications"],"references":["310473853_Energy_consumption_analysis_of_data_stream_processing_a_benchmarking_approach_ENERGY_CONSUMPTION_ANALYSIS_OF_DATA_STREAM_PROCESSING","333958469_A_Survey_of_Stream_Clustering_Algorithms","328076544_Key_technologies_for_big_data_stream_computing","321520718_Building_Your_Next_Big_Thing_with_Google_Cloud_Platform","308872859_Issues_in_Complex_Event_Processing_Systems","308859100_Complex_Event_Processing_on_uncertain_data_streams_in_product_manufacturing_process","305871378_Benchmarking_Streaming_Computation_Engines_Storm_Flink_and_Spark_Streaming","301988040_Acceleration_of_Data_Streaming_Classification_using_Reconfigurable_Technology","301412690_Processing_of_Mixed-Sensitivity_Video_Surveillance_Streams_on_Hybrid_Clouds","300621643_Vertex_and_Hyperedge_Connectivity_in_Dynamic_Graph_Streams"]}