{"id":"323194256_Finite_Element_Multi-scale_Modeling_of_Chemical_Segregation_in_Steel_Solidification_Taking_into_Account_the_Transport_of_Equiaxed_Grains","abstract":"The transport of solid crystals in the liquid pool during solidification of large ingots is known to have a significant effect on their final grain structure and macrosegregation. Numerical modeling of the associated physics is challenging since complex and strong interactions between heat and mass transfer at the microscopic and macroscopic scales must be taken into account. The paper presents a finite element multi-scale solidification model coupling nucleation, growth, and solute diffusion at the microscopic scale, represented by a single unique grain, while also including transport of the liquid and solid phases at the macroscopic scale of the ingots. The numerical resolution is based on a splitting method which sequentially describes the evolution and interaction of quantities into a transport and a growth stage. This splitting method reduces the non-linear complexity of the set of equations and is, for the first time, implemented using the finite element method. This is possible due to the introduction of an artificial diffusion in all conservation equations solved by the finite element method. Simulations with and without grain transport are compared to demonstrate the impact of solid phase transport on the solidification process as well as the formation of macrosegregation in a binary alloy (Sn-5 wt pct Pb). The model is also applied to the solidification of the binary alloy Fe-0.36 wt pct C in a domain representative of a 3.3-ton steel ingot. © 2018 The Minerals, Metals & Materials Society and ASM International","authors":["Thi-Thuy-My Nguyen","Charles-Andre GANDIN","Combeau Hervé","Miha Založnik"],"meta":["February 2018Metallurgical and Materials Transactions A 49(2)","DOI:10.1007/s11661-018-4496-4","Projects: Numerical modelling of solidification and welding processesNumerical simulation of mechanical interactions between liquid and solid phase in solidification processes"],"references":["312415682_Four-Phase_Dendritic_Model_for_the_Prediction_of_Macrosegregation_Shrinkage_Cavity_and_Porosity_in_a_55-Ton_Ingot","310745078_Experimental_study_and_two-phase_numerical_modeling_of_macrosegregation_induced_by_solid_deformation_during_punch_pressing_of_solidifying_steel_ingots","278334053_Modelling_of_Columnar-to-Equiaxed_and_Equiaxed-to-Columnar_Transitions_in_Ingots_Using_a_Multiphase_Model","268754759_Corrigendum_Inclusion_flotation-driven_channel_segregation_in_solidifying_steels","306418406_A_continuum_grain_attachment_model_for_simulations_of_equiaxed_solidification","304253572_Predictive_Capabilities_of_Multiphysics_and_Multiscale_Models_in_Modeling_Solidification_of_Steel_Ingots_and_DC_Casting_of_Aluminum","301023045_A_Variational_Basis_for_Upwind_Finite_Elements","279210374_A_Comprehensive_Case_Study_of_Macrosegregation_in_a_Steel_Ingot","272234976_Detection_of_macrosegregation_in_a_large_metallic_specimen_using_XRF","270189304_Two-Phase_Modeling_of_Macrosegregation_in_a_231_t_Steel_Ingot"]}