{"id":"323205310_SISTEMA_DE_GERENCIAMENTO_WEB_PARA_ENGENHARIA_CLINICA_PROPOSTA_DE_ARQUITETURA_E_IMPLEMENTACAO","abstract":"O avanço tecnológico propiciou o surgimento de novas técnicas e novos produtos com o objetivo de melhorar a qualidade de vida do ser humano. A ampliação do parque tecnológico nos Estabelecimentos Assistenciais de Saúde, através da aquisição de tecnologias com princípios de funcionamento cada vez mais complexos, tornou indispensável a presença de um profissional especializado, o Engenheiro Clínico. Por se tratar de um setor com fluxos de alta complexidade e que demandam cautela, o setor de Engenharia Clínica exige um controle eficaz de todos os dados provenientes desses fluxos de gerenciamento, tornando o uso de sistemas informatizados uma ferramenta necessária e útil. Nesse contexto, o trabalho em evidência consiste em propor a arquitetura de um software com o objetivo principal de promover a informatização e a centralização, em um único sistema web, de todos os processos e fluxos de gerenciamento que envolvem o setor de Engenharia Clínica do Hospital Universitário Onofre Lopes. Assim, foi modelada uma plataforma web de gerenciamento que salva as informações cadastradas acerca dos equipamentos, das ordens de serviço do setor e que fornece consultas para a geração de relatórios para análises. A modelagem do sistema de gerenciamento possibilitará uma diminuição no tempo gasto com cadastro, consultas, análises, edição de dados e tornará o processo de gerenciamento menos complicado e mais fluido, além de organizar os dados de forma clara e simples.","authors":["Ana Cecília Sá Fernandes","Thales Barros De Castro","José Micael Delgado Barbosa","Marcel da Câmara Ribeiro-Dantas"],"meta":["November 2017Revista Brasileira de Inovação Tecnológica em Saúde ISSN 2236-1103 7(2)","DOI:10.18816/r-bits.v7i2.11623"],"references":["307638398_The_Impact_of_Information_Technology_on_managers_decision_making","267742181_Methods_for_assessing_the_completeness_of_data_in_health_information_systems_in_Brazil_A_systematic_review","232274861_FrameWeb_um_Metodo_baseado_em_Frameworks_para_o_Projeto_de_Sistemas_de_Informacao_Web","277061232_Problematizacao_do_conceito_Qualidade_da_informacao","38031118_Review_of_data_quality_dimensions_and_applied_methods_in_the_evaluation_of_health_information_systems","36837642_The_Biomedical_Engineering_Handbook"]}