{"id":"323242431_A_systematic_review_of_provenance_systems","abstract":"Provenance refers to the entire amount of information, comprising all the elements and their relationships, that contribute to the existence of a piece of data. The knowledge of provenance data allows a great number of benefits such as verifying a product, result reproductivity, sharing and reuse of knowledge, or assessing data quality and validity. With such tangible benefits, it is no wonder that in recent years, research on provenance has grown exponentially, and has been applied to a wide range of different scientific disciplines. Some years ago, managing and recording provenance information were performed manually. Given the huge volume of information available nowadays, the manual performance of such tasks is no longer an option. The problem of systematically performing tasks such as the understanding, capture and management of provenance has gained significant attention by the research community and industry over the past decades. As a consequence, there has been a huge amount of contributions and proposed provenance systems as solutions for performing such kinds of tasks. The overall objective of this paper is to plot the landscape of published systems in the field of provenance, with two main purposes. First, we seek to evaluate the desired characteristics that provenance systems are expected to have. Second, we aim at identifying a set of representative systems (both early and recent use) to be exhaustively analyzed according to such characteristics. In particular, we have performed a systematic literature review of studies, identifying a comprehensive set of 105 relevant resources in all. The results show that there are common aspects or characteristics of provenance systems thoroughly renowned throughout the literature on the topic. Based on these results, we have defined a six-dimensional taxonomy of provenance characteristics attending to: general aspects, data capture, data access, subject, storage, and non-functional aspects. Additionally, the study has found that there are 25 most referenced provenance systems within the provenance context. This study exhaustively analyzes and compares such systems attending to our taxonomy and pinpoints future directions.","authors":["Beatriz Pérez","Julio Rubio","Carlos Sáenz-Adán"],"meta":["December 2018Knowledge and Information Systems 57(4)","DOI:10.1007/s10115-018-1164-3"],"references":["312489586_The_taverna_workflow_suite_Designing_and_executing_workflows_of_web_services_on_the_desktop_web_or_in_the_cloud","344924326_Karma2","337455324_ProvMark_A_Provenance_Expressiveness_Benchmarking_System","317716304_PLUS_Provenance_for_life_the_universe_and_stuff","316849406_The_Semiring_Framework_for_Database_Provenance","316600283_Data_Mining_Concepts_and_Techniques","314795206_Data_grid_management_systems","313431086_An_Online_Validator_for_Provenance_Algorithmic_Design_Testing_and_API","312482697_Static_analysis_of_Taverna_workflows_to_predict_provenance_patterns","312479459_Scientific_workflows_for_computational_reproducibility_in_the_life_sciences_Status_challenges_and_opportunities"]}