{"id":"323206961_Cybersecurity_awareness_survey_An_analysis_from_Bangladesh_perspective","abstract":"In modern era digital devices are the part and parcel in everyday life. Easy access to internet across the globe has totally changed the pattern of life. Web has become the main source of acquiring knowledge and information. Email is replacing the postal mail system. Use of computer is a mandatory from primary education sector to government level enterprise. Facebook, twitter, whatsapp, viber are becoming main way to social communication. All these developments made life of people easier and comfortable but at the same time crimes associated with technologies have also emerged especially in a developing country like Bangladesh. Cybercrime has become a vital issue. This study conveys an in-depth survey about the awareness of cybercrime amongst the people of Bangladesh. Both online and offline version of the survey were created to conduct this study. The study finds that there is a patchy awareness level and it is not satisfactory. The general people are unaware of standard practices for cybersecurity. The government and respective organizations is not vibrant regarding cybercrime related issues. A proper guideline is required. Also it needs to be updated on timely manner. Additionally, Pearson's Chi-squared test was conducted for in-depth analysis. Finally, it can be said that there exists an urgency to implement a prototype for cybersecurity to combat with cyber threats.","authors":["Nadeem Ahmed","Umme Kulsum","Md. Imran Bin Azad","Zaforullah Momtaz"],"meta":["December 2017","DOI:10.1109/R10-HTC.2017.8289074","Conference: 2017 IEEE Region 10 Humanitarian Technology Conference (R10-HTC)"],"references":["317209734_Access_developing_countries'_cybersecurity_capabilities_through_a_Social_Influence_strategy","316449708_A_survey_on_internet_usage_and_cybersecurity_awareness_in_students","324317303_Biostatistics_A_Foundation_for_Analysis_in_the_Health_Sciences","319172929_Assess_developing_countries'_cybersecurity_capabilities_through_a_social_influence_strategy","317427527_College_Students'_Cybersecurity_Risk_Perceptions_Awareness_and_Practices"]}