{"id":"323240635_What_Do_We_Teach_When_We_Teach_the_Learning_Sciences_A_Document_Analysis_of_75_Graduate_Programs","abstract":"Learning sciences as an academic community investigating human learning, emerged more than 30 years ago. Since then, graduate learning sciences programs have been established worldwide. However, currently little is known about their disciplinary backgrounds and the topics and research methods they address. In this document analysis of the websites of 75 international graduate learning sciences programs, we examine central concepts and research methods across institutions, compare the programs, and assess the homogeneity of different subgroups. Results reveal that the concepts addressed most frequently were real-world learning in formal and informal contexts, designing learning environments, cognition and metacognition, and using technology to support learning. Among research methods, design-based research, discourse and dialog analyses, and basic statistics stand out. Results show substantial differences between programs, yet those programs focusing on design-based research show the highest similarity regarding the other concepts and methods they teach. Interpreting the similarity of the graduate programs using a Community of Practice perspective, there is a set of relatively coherent programs at the core of the learning sciences, pointing to the emergence of a discipline, and a variety of multidisciplinary and more heterogeneous programs “orbiting” the core in the periphery, shaping and innovating the field.","authors":["Daniel Sommerhoff","Andrea Szameitat","Freydis Vogel","Olga Chernikova"],"meta":["February 2018Journal of the Learning Sciences 27(2)","DOI:10.1080/10508406.2018.1440353"],"references":["345000309_Innoversity_in_Communities_of_Practice","321300499_The_Cambridge_handbook_of_the_learning_sciences_second_edition","317953505_Situated_learning_Legitimate_peripheral_participation","314358716_History_of_the_Learning_Sciences","312407054_What_Do_Learning_Scientists_Do_A_Survey_of_the_ISLS_Membership","311485010_Learning_in_activity","303270804_Cognitive_apprenticeship_Teaching_the_crafts_of_reading_writing_mathematics","302336325_History_of_the_Sciences_of_Learning","292695685_Foundations_of_the_learning_sciences","291101669_Cognitive_Apprenticeship"]}