{"id":"323231217_Verifying_the_Correctness_of_Workflow_Systems_Based_on_Workflow_Net_With_Data_Constraints","abstract":"The correctness verification is very important for workflow systems. It is closely related with both control-flows and data-flows. Workflow nets with data (WFD-nets) are a kind of formal model that can both reflect some logical structures of workflow systems, e.g., choice and concurrency, and represent some operations on data, e.g., read, write and delete. However, these data operations are conceptual in WFD-nets and only characterize the logical relation between two operations, e.g., whether a write and a read are concurrently operating on a data. They do not consider the functional requirements about data (i.e., data constraints). Thus, some data errors cannot be found via WFD-nets. In order to solve this problem, we propose Workflow nets with Data Constraints (WFDC-nets) and define four levels of soundness to describe different correctness requirements. Based on the reachability graphs of WFDC-nets, we verify the soundness. The related algorithms are proposed and a tool is developed to show the effectiveness and usefulness of our method. OAPA","authors":["Yaqiong He","Guanjun Liu","Dongming Xiang","Jiaquan Sun"],"meta":["February 2018IEEE Access 6:1-1","DOI:10.1109/ACCESS.2018.2806884"],"references":["305783315_A_Branching-Process-Based_Method_to_Check_Soundness_of_Workflow_Systems","298226676_Verification_of_Workflow_nets","265885200_Business_Process_Modeling_Using_Petri_Nets","241638834_Model_Checking_Analysis_of_Semantically_Annotated_Business_Processes","228979348_Analyzing_control-flow_and_data-flow_in_workflow_processes_in_a_unified_way","312568627_Checking_the_Inconsistent_Data_in_Concurrent_Systems_by_Petri_Nets_with_Data_Operations","285842809_Petri_Nets_Properties_Analysis_and_Applications","262260281_Structured_Programming","260799751_Analysis_and_Application_of_Logical_Petri_Nets_to_E-Commerce_Systems","257896547_Verification_of_workflow_nets_with_transition_conditions"]}