{"id":"323222854_An_Efficient_Collision_Free_Protocol_for_VANET","abstract":"VANET is considered as one of the most important research field in the wireless and mobile technology, which provides road safety, updated traffic information, and infotainment. The transmission technology used in VANET is the wireless broadcast which means that the vehicles on the road are sharing a single communication channel for broadcasting the messages, usually VANET suffers from the number of nodes consisting and competing to reserve and use the channel, and this leads to high collision scenarios if the situations are not managed wisely. \n\nIn this research a new collision free protocol hereinafter will be called (CF-MAC) to manage the channel access in Medium Access Control Sublayer (MAC) for the transmission will be proposed, this protocol will ensure a collision-free management to enhance the channel performance, and increase the channel reliability. The evaluation criteria will depend on the QoS enhancement like channel throughput, message delay, and message loss; the results show that the overall channel performance in terms of collision and packet loss ratio is improved.","authors":["Ghassan Samara"],"meta":["February 2018International Journal of Computer Applications 180(16):30-34","DOI:10.5120/ijca2018916368"],"references":["298847766_Evaluating_the_Impact_of_Transmission_Range_on_the_Performance_of_VANET","263545192_Intelligent_emergency_message_broadcasting_in_VANET_using_PSO","253879375_Increase_emergency_message_reception_in_VANET","234581488_An_analytical_model_for_beaconing_in_VANETs","224986100_Car-2-Car_Communication_Consortium_-_Manifesto","315475517_An_Infrastructure-Free_Slot_Assignment_Algorithm_for_Reliable_Broadcast_of_Periodic_Messages_in_Vehicular_Ad_Hoc_Networks","294156205_Intelligent_transport_systems","282680990_Reliable_and_secure_routing_ADHOC_algorithm_based_on_collaborative_monitor_nodes_in_VANETS","261041723_VeMAC_A_novel_multichannel_MAC_protocol_for_vehicular_ad_hoc_networks","247933007_RAMC_a_RSU-assisted_multi-channel_coordination_MAC_protocol_for_VANET"]}