{"id":"323251091_A_unified_analytical_approach_for_the_acoustic_conceptual_design_of_fans_of_modern_aero-engines","abstract":"This thesis proposes a set of theoretical models to predict, during the conceptual design phase, the sound emitted by the fan stage of an aero-engine, which is due to the interaction of its solid surfaces with the flow. The models are analytical or semi-analytical in nature, and cover a range of disciplines that span between aerodynamics and acoustics. Various fan architectures, such as the conventional ducted turbofan, the ducted contrarrotating fan and the contrarrotating open rotors, are addressed on a common basis, where the sensitivity of the radiated noise to the fan design is investigated at given thrust and optimal aerodynamic performance. The main part of the thesis provides a detailed description of the models that have been selected, adapted and implemented with appropriate formulations to form a consistent prediction environment. Pan aerodynamics is considered via a meanline approach, where a given streamline is assumed to be representative of the whole flow passage. A procedure to obtain a realistic and aerodynamically sound fan geometry based on a reduced number of parameters, typical of the preliminary design phase, is proposed. For each investigated fan, the aerodynamic performance map is explored to locate the off-design points relevant for acoustic certification. The flow perturbations generated by the blades are described as decaying wakes and potential fields that propagate down to the neighboring blade row and interact with it in form of acoustic waves. The formulation of the sound pressure radiated by the blades has been completely derived anew from the linear theory of the Acoustic Analogy. The acoustic pressure, expressed in the frequency domain, presents strong analogies in the ducted problem compared with the free-field case. The mathematical derivation also shows that the expressions of tonal and broadband noise assume very similar forms. Finally, a term common to all problems, identified as the source strength, only depends on the flow around the blades, and can therefore be directly related to the aerodynamic quantities deduced from the fan design procedure mentioned above. The capabilities of that unified prediction approach are illustrated by two parametric studies, which deal with the acoustic implications of a modification of the design speed of the fan for the three main architectures. The motivation for addressing this topic is twofold: first, fan speed is known to be an essential key driver for noise emission; second, it is a parameter that strongly affects design and thus is a good candidate to test the entire calculation chain. The speed reduction is realized either by decreasing the fan pressure ratio, hence increasing the bypass ratio of the engine, or by increasing the aerodynamic loading of the blades, if the fan diameter cannot be further increased. It turns out that the results obtained feature realistic, sensible, and smooth trends that are in line with past theoretical and experimental studies. As a consequence, the feasibility of acoustic assessment based on analytical models during a preliminary design phase is demonstrated. The virtues of the contrarrotating concepts over the conventional turbofan in terms of broadband and tonal self-noise can be directly attributed to the lower aerodynamic loading and Mach numbers. The open rotors do not by themselves generate more noise, the source strength is relatively similar to that of ducted fans, but lack the benefits of a nacelle equipped with sound damping liners. Finally, fan designs with a low pressure ratio tend to be significantly less noisy, thus the acoustic optimum lies far below the optimum of fuel-consumption. A low-noise design alternative to the reduction of the pressure ratio, is increasing the loading of the fan, which however must result from a careful compromise between broadband and tonal noise.","authors":["A. Moreau"],"meta":["January 2017DLR Deutsches Zentrum fur Luft- und Raumfahrt e.V. - Forschungsberichte 2017(56):1-159"],"references":["270755677_Incidence_and_Deviation-Angle_Correlations_for_Compressor_Cascades"]}