{"id":"323268303_Non-Invasive_CardioVascular_Monitoring","abstract":"Cardiovascular problem is one of the major concern in these days as majority of the people die from this problem annually. In 2015, it was responsible for 31% of the total death and estimated around 17.7 million people. The number is increasing alarmingly and sources claimed that total estimated global cost of cardiovascular disease was $863 billion in 2010 and it might likely to increase by 2030 to $1044 billion. Heart disease including Coronary Heart Disease, Hypertension, and Stroke claims the top rank in most of the countries to end a life. Meanwhile, medical science has improved a lot to stand by the patients and therefore, new possibilities are opening up. In this article, we have focused literature review on Non-Invasive cardiovascular monitoring researches undertaken so far to provide new possibilities and research trends so that we can monitor our health better and take precautions earlier with the use and advancement of Computer Science & Technology. Here we have primarily focused on PPG signal and possibilities to measure important blood parameters like Glucose, HB that indirectly or directly can provide us a status of our health when required. Recent report suggests that PPG or Photoplethysmograms is very useful for measuring heart rates, arterial age, blood pressure, oxygen saturation, emotion detection etc. Accurate measurement of PPG can open up new possibilities in non-invasive computer aided cardiac research.","authors":["Ayan Chatterjee"],"meta":["February 2018Journal of Environmental Science, Computer Science and Engineering & Technology 7(1):33-47","DOI:10.24214/jecet.B.7.1.03347]"],"references":["263624422_Real-Time_Heart_Rate_Monitoring_System_based_on_Ring-Type_Pulse_Oximeter_Sensor","299044874_Pulse_Oximetry_Plethysmographic_Waveform_During_Changes_in_Blood_Volume","252047775_Development_of_a_wristwatch-type_PPG_array_sensor_module","11301525_Use_of_a_peripheral_perfusion_index_derived_from_the_pulse_oximetry_signal_as_a_noninvasive_indicator_of_perfusion","11014450_Evaluating_the_Relationship_Between_Arterial_Blood_Pressure_Changes_and_Indices_of_Pulse_Oximetric_Plethysmography"]}