{"id":"323205145_How_does_the_interaction_radius_affect_the_performance_of_intervention_on_collective_behavior","abstract":"The interaction radius r plays an important role in the collective behavior of many multi-agent systems because it defines the interaction network among agents. For the topic of intervention on collective behavior of multi-agent systems, does r also affect the intervention performance? In this paper we study whether it is easier to change the convergent heading of the group by adding some special agents (called shills) into the Vicsek model when r is larger (or smaller). Two kinds of shills are considered: fixed-heading shills (like leaders that never change their headings) and evolvable-heading shills (like normal agents but with carefully designed initial headings). We know that with the increase of r, two contradictory effects exist simultaneously: the influential area of a single shill is enlarged, but its influence strength is weakened. Which factor dominates? Through simulations and theoretical analysis we surprisingly find that r affects the intervention performance differently in different cases: when fixed-heading shills are placed together at the center of the group, larger r gives a better intervention performance; when evolvable-heading shills are placed together at the center, smaller r is better; when shills (either fixed-heading or evolvable-heading) are distributed evenly inside the group, the effect of r on the intervention performance is not significant. We believe these results will inspire the design of intervention strategies for many other multi-agent systems.","authors":["Caiyun Wang","Jing Han"],"meta":["February 2018PLoS ONE 13(2):e0192738","DOI:10.1371/journal.pone.0192738"],"references":["338777784_Biological_Pattern_Formation","287853569_Leading_birds_by_the_beak_response_of_flocks_to_external_perturbations","264979572_Optimal_Radius_for_Connectivity_in_Duty-Cycled_Wireless_Sensor_Networks","264928223_The_Smallest_Possible_Interaction_Radius_for_Flock_Synchronization","262941742_Swarm_intelligence_inspired_shills_and_the_evolution_of_cooperation","311263121_Optimal_radius_for_connectivity_in_duty-cycled_wireless_sensor_networks","308835692_Intervention_of_DeGroot_model_by_soft_control","308498392_The_impact_of_interaction_radius_on_soft_control_performance_based_on_the_Vicsek_Model","306929146_Linear_response_to_leadership_effective_temperature_and_decision_making_in_flocks","271748598_Ecological_Aspects_of_Some_Mixed-Species_Foraging_Flocks_of_Birds","236666729_Nondestructive_Intervention_to_Multi-Agent_Systems_through_an_Intelligent_Agent","226831182_Gierer_A_Meinhardt_H_A_theory_of_biological_pattern_formation_Kybernetik_12_30-_39","235709967_Flocks_Herds_and_Schools_A_Distributed_Behavioral_Model","226165718_Convergence_of_a_Class_of_Multi-Agent_Systems_In_Probabilistic_Framework","222822345_Synchronization_of_multi-agent_systems_without_connectivity_assumptions"]}