{"id":"323224526_Dynamic_Vehicle_Routing_Problems_with_Enhanced_Ant_Colony_Optimization","abstract":"As we all know, there are a great number of optimization problems in the world. One of the relatively complicated and high-level problems is the vehicle routing problem (VRP). Dynamic vehicle routing problem (DVRP) is a major variant of VRP, and it is closer to real logistic scene. In DVRP, the customers’ demands appear with time, and the unserved customers’ points must be updated and rearranged while carrying out the programming paths. Owing to the complexity and significance of the problem, DVRP applications have grabbed the attention of researchers in the past two decades. In this paper, we have two main contributions to solving DVRP. Firstly, DVRP is solved with enhanced Ant Colony Optimization (E-ACO), which is the traditional Ant Colony Optimization (ACO) fusing improved K -means and crossover operation. K -means can divide the region with the most reasonable distance, while ACO using crossover is applied to extend search space and avoid falling into local optimum prematurely. Secondly, several new evaluation benchmarks are proposed, which can objectively and comprehensively estimate the proposed method. In the experiment, the results for different scale problems are compared to those of previously published papers. Experimental results show that the algorithm is feasible and efficient.","authors":["Haitao Xu","Pan Pu","Feng Duan"],"meta":["February 2018Discrete Dynamics in Nature and Society 2018:1-13","DOI:10.1155/2018/1295485"],"references":["314102323_Ant_Colony_Optimization_ACO_based_Routing_Protocols_for_Wireless_Sensor_Networks_WSN_A_Survey","296623496_A_Three-Stage_Saving-Based_Heuristic_for_Vehicle_Routing_Problem_with_Time_Windows_and_Stochastic_Travel_Times","295010750_Feasible_Initial_Population_with_Genetic_Diversity_for_a_Population-Based_Algorithm_Applied_to_the_Vehicle_Routing_Problem_with_Time_Windows","291283973_Application_of_Particle_Swarm_Optimization_Algorithm_to_Dynamic_Vehicle_Routing_Problem","287796502_The_Vehicle_Routing_Problem_State_of_the_Art_Classification_and_Review","313228902_On_Solving_Periodic_Re-Optimization_Dynamic_Vehicle_Routing_Problems","311894936_Metaheuristics_for_Vehicle_Routing_Problems","301352491_Ant_colony_optimization_with_clustering_for_solving_the_dynamic_location_routing_problem","287661759_An_effective_heuristic_algorithm_for_the_traveling_salesman_problem","269056159_Genetic_Algorithm_for_Vehicle_Routing_Problem"]}