{"id":"323237742_Towards_minimum-delay_and_energy-efficient_flooding_in_low-duty-cycle_wireless_sensor_networks","abstract":"Wireless sensor networks (WSNs) play a very important role in realizing Internet of Things (IoT). In many WSN applications, flooding is a fundamental network service for remote network configuration, diagnosis or disseminating code updates. Despite a plethora of research on flooding problem in the literature, there has been very limited research on flooding tree construction in asynchronous low-duty-cycle WSNs. In this paper, we focus our investigation on minimum-delay and energy-efficient flooding tree construction considering the duty-cycle operation and unreliable wireless links. We show the existence of the latency-energy trade-off in flooding. We formulate the problem as a undetermined-delay-constrained minimum spanning tree (UDC-MST) problem, where the delay constraint is known a posteriori. Due to the NP-completeness of the UDC-MST problem, we design a distributed Minimum-Delay Energy-efficient flooding Tree (MDET) algorithm to construct an energy optimal tree with flooding delay bounding. Through extensive simulations, we demonstrate that MDET achieves a comparable delivery latency with the minimum-delay flooding, and incurs only 10% more transmission cost than the lower bound, which yields a good balance between flooding delay and energy efficiency.","authors":["Long Cheng","Jianwei Niu","Chengwen Luo","Lei Shu"],"meta":["April 2018Computer Networks 134:66-77","DOI:10.1016/j.comnet.2018.01.012"],"references":["314012340_Opportunistic_broadcasting_for_low-power_sensor_networks_with_adaptive_performance_requirements","303556275_ART_Adaptive_fRequency-Temporal_co-existing_of_ZigBee_and_WiFi","312670830_Identifying_State-Free_Networked_Tags","309713164_Pando_Fountain-Enabled_Fast_Data_Dissemination_With_Constructive_Interference","301744892_Achieving_Efficient_Reliable_Flooding_in_Low-Duty-Cycle_Wireless_Sensor_Networks","277937497_OppCode_Correlated_Opportunistic_Coding_for_Energy-Efficient_Flooding_in_Wireless_Sensor_Networks"]}