{"id":"323226766_Inverse_design_of_optical_elements_based_on_arrays_of_dielectric_spheres","abstract":"Arrays of wavelength scale scatterers are a promising platform for designing optical elements with a compact footprint. The large number of degrees of freedom in this system allows for unique and plentiful functionalities. However, the many variables also create a complex design problem. While intuitive forward design methods work for simple optical elements, they often fail to produce complicated elements, especially those involving multiple elements. We present an inverse design methodology for large arrays of wavelength scale spheres based on both adjoint optimization or sensitivity analysis and generalized multi-sphere Mie theory as a solution to the design problem. We validate our methodology by designing two sets of optical elements with scatterers on sub-wavelength and super-wavelength periodic grids. Both sets consist of a singlet and a doublet lens with one and two layers of spheres respectively designed for 1550 nm. The designed NA is ∼0.33 (∼0.5) for the sub-wavelength (super-wavelength) periodic structure. We find that with the sub-wavelength periodicity, the full width at half-maximum of the focal spot produced by the singlet and doublet is smaller than that produced by an ideal lens with the same geometric parameters. Finally, we simulate a realistic experimental scenario for the doublet, where the spheres are placed on a substrate with the same refractive index. We find the performance is similar, but with lower intensity at the focal spot and larger spot size. The method described here will simplify the design procedure for complicated multi-functional optical elements and or scatterer array-based volume optics based on a specified figure of merit.","authors":["Alan Zhan","Taylor K. Fryett","Shane Colburn","Arka Majumdar"],"meta":["February 2018Applied Optics 57(6):1437","DOI:10.1364/AO.57.001437"],"references":["320022310_Optimization-based_Dielectric_Metasurfaces_for_Angle-Selective_Multifunctional_Beam_Deflection","318910556_Electromagnetic_reprogrammable_coding-metasurface_holograms","316910915_CELES_CUDA-accelerated_simulation_of_electromagnetic_scattering_by_large_ensembles_of_spheres","316860838_Fabrication-constrained_nanophotonic_inverse_design","319186774_Extending_the_applicability_of_the_T-matrix_method_to_light_scattering_by_flat_particles_on_a_substrate_via_truncation_of_Sommerfeld_integrals","317703912_Planar_Metasurface_Retroreflector","317387403_Controlling_the_sign_of_chromatic_dispersion_in_diffractive_optics_with_dielectric_metasurfaces","316613220_Large-Angle_Multifunctional_Metagratings_Based_on_Freeform_Multimode_Geometries","313280193_Genetically_optimized_All-dielectric_metasurfaces","312961648_Achromatic_Metalens_over_60_nm_Bandwidth_in_the_Visible_and_Metalens_with_Reverse_Chromatic_Dispersion"]}