{"id":"323236348_Omnidirectional_Aerial_Vehicles_with_Unidirectional_Thrusters_Analysis_Optimal_Design_and_Motion_Control","abstract":"This paper presents a theoretical study on omni-directional aerial vehicles with body-frame fixed unidirectional thrusters. Omniplus multi-rotor designs are defined as the ones that allow to exert a total wrench in any direction using positive-only lift force and drag moment (i.e., positive rotational speed) for each rotor blade. Algebraic conditions for a design to be omniplus are derived, a simple necessary condition being the fact that at least seven propellers have to be used. An energy optimal design strategy is then defined as the one minimizing the maximum norm of the input set needed to span a certain wrench ellipsoid for the adopted input allocation strategy. Two corresponding major design criteria are then introduced: firstly, a minimum allocation-matrix condition number aims at an equal sharing of the effort needed to generate wrenches in any direction; secondly, imposing a balanced design guarantees an equal sharing of the extra effort needed to keep the input in the non-negative orthant. We propose a numerical algorithm to solve such optimal design problem and a control algorithm to control any omnidirectional platform. The work is concluded with informative simulation results in non-ideal conditions.","authors":["Marco Tognon","Antonio Franchi"],"meta":["February 2018"],"references":["322945431_Omnidirectional_Aerial_Vehicles_with_Unidirectional_Thrusters_Theory_Optimal_Design_and_Control","318693969_Adaptive_closed-loop_speed_control_of_BLDC_motors_with_applications_to_multi-rotor_aerial_vehicles","316786071_Dynamic_Decentralized_Control_for_Protocentric_Aerial_Manipulators","311755244_Modeling_and_control_of_FAST-Hex_A_fully-actuated_by_synchronized-tilting_hexarotor","308978709_A_Novel_Overactuated_Quadrotor_Unmanned_Aerial_Vehicle_Modeling_Control_and_Experimental_Validation","321619816_Advances_in_Unmanned_Aerial_Vehicles_State_of_the_Art_and_the_Road_to_Autonomy","311755084_Design_modeling_and_control_of_omni-directional_aerial_robot","303886125_Design_modeling_and_control_of_an_omni-directional_aerial_vehicle","303885466_Experiments_on_coordinated_motion_of_aerial_robotic_manipulators","301836803_Dynamics_Control_and_Estimation_for_Aerial_Robots_Tethered_by_Cables_or_Bars"]}