{"id":"323392524_8T_SRAM_Cell_as_a_Multi-bit_Dot_Product_Engine_for_Beyond_von-Neumann_Computing","abstract":"Large scale digital computing almost exclusively relies on the von-Neumann architecture which comprises of separate units for storage and computations. The energy expensive transfer of data from the memory units to the computing cores results in the well-known von-Neumann bottleneck. Various approaches aimed towards bypassing the von-Neumann bottleneck are being extensively explored in the literature. Emerging non-volatile memristive technologies have been shown to be very efficient in computing analog dot products in an in-situ fashion. The memristive analog computation of the dot product results in much faster operation as opposed to digital vector in-memory bit-wise Boolean computations. However, challenges with respect to large scale manufacturing coupled with the limited endurance of memristors have hindered rapid commercialization of memristive based computing solutions. In this work, we show that the standard 8 transistor (8T) digital SRAM array can be configured as an analog-like in-memory multi-bit dot product engine. By applying appropriate analog voltages to the read-ports of the 8T SRAM array, and sensing the output current, an approximate analog-digital dot-product engine can be implemented. We present two different configurations for enabling multi-bit dot product computations in the 8T SRAM cell array, without modifying the standard bit-cell structure. Since our proposal preserves the standard 8T-SRAM array structure, it can be used as a storage element with standard read-write instructions, and also as an on-demand analog-like dot product accelerator.","authors":["Akhilesh Jaiswal","Indranil Chakraborty","Amogh Agrawal","Kaushik Roy"],"meta":["February 2018IEEE Transactions on Very Large Scale Integration (VLSI) Systems PP(99)","DOI:10.1109/TVLSI.2019.2929245"],"references":["322260339_A_Multi-Functional_In-Memory_Inference_Processor_Using_a_Standard_6T_SRAM_Array","321492168_Analogue_signal_and_image_processing_with_large_memristor_crossbars","321306860_Technology_Aware_Training_in_Memristive_Neuromorphic_Systems_based_on_non-ideal_Synaptic_Crossbars","321823718_X-SRAM_Enabling_In-Memory_Boolean_Computations_in_CMOS_Static_Random_Access_Memories","319370171_A_03V_VDDmin_42T_SRAM_for_searching_and_in-memory_computing_using_55nm_DDC_technology","313949035_A_175-fJbit_Energy-Efficient_Analog_SRAM_for_Mixed-Signal_Processing","313879627_The_Power_of_Sparsity_in_Convolutional_Neural_Networks","313060232_Learning_Internal_Representations_by_Error_Propagation","311168790_Analyzing_the_Electromigration_Effects_on_Different_Metal_Layers_and_Different_Wire_Lengths","277959043_Learning_both_Weights_and_Connections_for_Efficient_Neural_Networks"]}