{"id":"323358576_Covering_the_Space_of_Tilts_Application_to_Affine_Invariant_Image_Comparison","abstract":"We propose a mathematical method to analyze the numerous algorithms performing image matching by affine simulation (IMAS). To become affine invariant they apply a discrete set of affine transforms to the images, prior to the comparison of all images by a scale invariant image matching (SIIM), like SIFT (scale invariant feature transform). Obviously this multiplication of images to be compared increases the image matching complexity. Three questions arise: (a) what is the best set of affine transforms to apply to each image to gain full practical affine invariance? (b) what is the lowest attainable complexity for the resulting method? (c) how is the underlying SIIM method chosen? We provide an explicit answer and a mathematical proof of quasi-optimality of the solution to the _rst question. As an answer to (b) we find that the near-optimal complexity ratio between full affine matching and scale invariant matching is more than halved, compared to the current IMAS methods. This means that the number of key points necessary for affine matching can be halved, and that the matching complexity is divided by four for exactly the same performance. This also means that an affine invariant set of descriptors can be associated with any image. The price to pay for full affine invariance is that the cardinality of this set is around 6.4 times larger than for a SIIM. © 2018 Society for Industrial and Applied Mathematics. And by SIAM.","authors":["Mariano Rodríguez","Julie Delon","Jean-Michel Morel"],"meta":["January 2018SIAM Journal on Imaging Sciences 11(2)","DOI:10.1137/17M1140509"],"references":["279916389_Efficient_Dense-Field_Copy-Move_Forgery_Detection","274410731_ASIFT_An_Algorithm_for_Fully_Affine_Invariant_Comparison","319770714_Photo_tourism_Exploring_photo_collections_in_3D","319770432_Evaluating_color_descriptors_for_object_and_scene_recognition","319770370_Three_things_everyone_should_know_to_improve_object_retrieval","316074523_Local_features_for_RGBD_image_matching_under_viewpoint_changes","313527089_Distinctive_image_features_from_scale-invariant_key_points","313522833_PCA-SIFT_A_more_distinctive_representation_for_local_image_descriptors","308642582_ASIFT_A_new_framework_for_fully_affine_invariant_image_comparison","303563897_LATCH_Learned_arrangements_of_three_patch_codes"]}