{"id":"323301290_The_Importance_of_Water_for_Life","abstract":"Liquid water is essential for life as we know it, i.e. carbon-based life. Although other compound-solvent pairs that could exist in very specific physical environments could be envisaged, the elements essential to carbon and water-based life are among the most common in the universe. Carbon molecules and liquid water have physical and chemical properties that make them optimised compound-solvent pairs. Liquid water is essential for important prebiotic reactions. But equally important for the emergence of life is the contact of carbon molecules in liquid water with hot rocks and minerals. We here review the environmental conditions of the early Earth, as soon as it had liquid water at its surface and was habitable. Basing our approach to life as a “cosmic phenomenon” (de Duve 1995), i.e. a chemical continuum, we briefly address the various hypotheses for the origin of life, noting their relevance with respect to early environmental conditions. It appears that hydrothermal environments were important in this respect. We continue with the record of early life noting that, by 3.5 Ga, when the sedimentary environment started being well-preserved, anaerobic life forms had colonised all habitable microenvironments from the sea floor to exposed beach environments and, possibly, in the photic planktonic zone of the sea. Life on Earth had also evolved to the relatively sophisticated stage of anoxygenic photosynthesis. We conclude with an evaluation of the potential for habitability and colonisation of other planets and satellites in the Solar System, noting that the most common life forms in the Solar System and probably in the Universe would be similar to terrestrial chemotrophs whose carbon source is either reduced carbon or CO2 dissolved in water and whose energy would be sourced from oxidized carbon, H2, or other transition elements.","authors":["Frances Westall","Andre Brack"],"meta":["February 2018Space Science Reviews 214(2)","DOI:10.1007/s11214-018-0476-7"],"references":["317138665_Earliest_signs_of_life_on_land_preserved_in_ca_35_Ga_hot_spring_deposits","303600537_Prebiotic_Chemicals_-_Amino_Acid_and_Phosphorus_-_In_the_Coma_of_Comet_67PChuryumov-Gerasimenko","285741657_Evidence_for_cavity-dwelling_microbial_life_in_322_Ga_tidal_deposits","284165922_Biosignatures_on_Mars_What_Where_and_How_Implications_for_the_Search_for_Martian_Life","347369899_Before_enzymes_and_templates_theory_of_surface_metabolism","346671135_The_RNA_World_Life_before_DNA_and_Protein","308094091_Illusory_Late_Heavy_Bombardments","305645166_The_physiology_and_habitat_of_the_last_universal_common_ancestor","289001981_Chapter_1_Archean_Komatiites","288598173_The_early_earth","277968569_Archean_333_Ga_microbe-sediment_systems_were_diverse_and_flourished_in_a_hydrothermal_context","283328435_Earth's_Early_Atmosphere_and_Oceans_and_The_Origin_of_Life","279402328_Earth's_atmosphere","278345118_Large-scale_impacts_and_the_evolution_of_the_Earth's_crust_The_early_years","278331558_Early_evolution_of_large_micro-organisms_with_cytological_complexity_revealed_by_microanalyses_of_34_Ga_organic-walled_microfossils"]}