{"id":"323388632_A_DNA_Computing_Model_for_the_Graph_Vertex_Coloring_Problem_Based_on_a_Probe_Graph","abstract":"The biggest bottleneck in DNA computing is exponential explosion, in which the DNA molecules used as data in information processing grow exponentially with an increase of problem size. To overcome this bottleneck and improve the processing speed, we propose a DNA computing model to solve the graph vertex coloring problem. The main points of the model are as follows: ① The exponential explosion problem is solved by dividing subgraphs, reducing the vertex colors without losing the solutions, and ordering the vertices in subgraphs; and ② the bio-operation times are reduced considerably by a designed parallel polymerase chain reaction (PCR) technology that dramatically improves the processing speed. In this article, a 3-colorable graph with 61 vertices is used to illustrate the capability of the DNA computing model. The experiment showed that not only are all the solutions of the graph found, but also more than 99% of false solutions are deleted when the initial solution space is constructed. The powerful computational capability of the model was based on specific reactions among the large number of nanoscale oligonucleotide strands. All these tiny strands are operated by DNA self-assembly and parallel PCR. After thousands of accurate PCR operations, the solutions were found by recognizing, splicing, and assembling. We also prove that the searching capability of this model is up to O(3⁵⁹). By means of an exhaustive search, it would take more than 896 000 years for an electronic computer (5 × 10¹⁴ s⁻¹) to achieve this enormous task. This searching capability is the largest among both the electronic and non-electronic computers that have been developed since the DNA computing model was proposed by Adleman's research group in 2002 (with a searching capability of O(2²⁰)).","authors":["Jin Xu","Xiaoli Qiang","Kai Zhang","Cheng Zhang"],"meta":["February 2018Engineering 4(1)","DOI:10.1016/j.eng.2018.02.011"],"references":["288284056_DMA_algorithm_for_graph_vertex_coloring_problem","276169042_Graph_Theory_With_Applications","243333728_Global_heuristically_search_algorithm_for_DNA_encoding","239667955_3-Coloring_in_Time_O13289n","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","225843971_Computation_by_Self-assembly_of_DNA_Graphs","225367521_A_DNA_computer_model_for_solving_vertex_coloring_problem","221932947_Algebraic_Graph_Theory","220901169_Register_Allocation_Spilling_via_Graph_Coloring","220752996_Deciding_3-Colourability_in_Less_Than_O1415n_Steps"]}