{"id":"323368854_New_Approach_to_Entrepreneurship_Education_in_Primary_Schools_The_BGENTL","abstract":"The European Union is promoting for more than 3 decades the entrepreneurship education in Europe, for\nall levels of education. One of the main goals is to strengthen the perspective of lifelong learning of the\nentrepreneurship education. So, the majority of the European countries are in a process of educational\nreform and are embedding this type of educational offering. Several methodologies are put in practice with\ndifferent impact on entrepreneurship competences development and focusing in diverse subareas (e.g.\ncreativity or business) and are applied at different levels of education.\nThe primary level of education has specific characteristics and challenges, therefore different\nmethodologies have to be applied. Early learning is always a motivation for acquiring behaviours and habits\nsince learning modifies behaviour, cognitive, motor, sensory level, integrating changes in our values and\nattitudes. Mainly because most of the physical, emotional, psychosocial and cognitive changes occur during\nchildhood and adolescence, projecting here, at this stage, the basis for a good self-esteem and selfconfidence.\nAfter an experience of implementing different methodologies and developing several projects, using games\nto promote learning is proven to achieve positive results in several areas of knowledge and behaviour.\nTherefore the proposal, here of a new methodology in entrepreneurship education for young children, the\nBoard Game Entrepreneurship Learning (BGENTL) to promote entrepreneurship education to this\nstudent’s target, based on the use of different board games is appealing. Each one of the games has a specific\npurpose to develop specific areas related and that integrate what is called an entrepreneurship behaviour.\nIn this paper, we’ll present the games and its several stages of this new methodology.","authors":["Teresa Paiva"],"meta":["November 2017Turkish Online Journal of Educational Technology","DOI:10.1787/5jlwm62b3bvh-en"],"references":["275692000_Innovation_and_Entrepreneurship","324998613_Tangling_With_Spaghetti_Pedagogical_Lessons_From_Games","281030348_A_game-based_method_for_teaching_Entrepreneurship","253685755_Educating_Entrepreneurship_Students_About_Emotion_and_Learning_From_Failure","227627586_The_Emergence_of_Entrepreneurship_Education_Development_Trends_and_Challenges"]}