{"id":"323392012_A_Survey_on_Health_Monitoring_Systems_for_Health_Smart_Homes","abstract":"Aging population ratios are rising significantly. Health monitoring systems (HMS) in smart environments have evolved rapidly to become a viable alternative to traditional healthcare solutions. The aim of HMS is to not only reduce costs but to also provide timely e-health services to individuals wishing to maintain their independence. In this way, elderly people can avoid, for as long as possible, any interaction with healthcare institutions (e.g. nursing homes and hospitals), which in turn reduces pressure on the health system. To fully realise this vision of seamless e-health services supporting people in need of them, a number of challenges that need further investigation still exist. To this end, we provide an overview of the current state of the art for smart health monitoring systems. We review HMS in smart environments from a general perspective and with a particular focus on systems for the elderly and dependent people. We look at the challenges for these systems from the perspective of developing the technology itself, system requirements, system design and modelling. We present a consolidated picture of the most important functions and services offered by HMS for monitoring and detecting human behaviour including its concepts, approaches, and processing techniques. Moreover, we provide an extensive, in-depth analysis and evaluation of the existing research findings in the area of e-health systems. Finally, we present challenges and open issues facing the smart HMS field and we make recommendations on how to improve future systems.","authors":["Haider Mshali","Tayeb Lemlouma","Maria Moloney","Damien Magoni"],"meta":["July 2018International Journal of Industrial Ergonomics 66","DOI:10.1016/j.ergon.2018.02.002","Project: Health Monitoring Systems"],"references":["302893879_Context-Aware_Adaptive_Framework_for_e-Health_Monitoring","301778496_Human_motion_recognition_using_a_wireless_sensor-based_wearable_system","301721523_A_Markovian-based_Approach_for_Daily_Living_Activities_Recognition","287120022_Applications_of_Mobile_Agents_in_Healthcare_Domain_A_Literature_Survey","282288238_A_Predictive_Approach_for_Efficient_e-Health_Monitoring","310622365_Design_ubiquitous_architecture_for_telemedicine_based_on_mhealth_Arduino_4G_LTE","303693085_Prevent_Cooking_Risks_in_Kitchen_of_Elderly_People_Adaptable_Reasoning_Engine_Based_on_Fuzzy_Logic_for_Smart_Oven","300820627_A_New_Methodology_CON-INFO_for_Context-Based_Development_of_a_Mobile_User_Interface_in_Healthcare_Applications","285803617_Human_activity_recognition_for_video_surveillance_using_sequences_of_postures","282304010_Multiple_model_analytics_for_adverse_event_prediction_in_remote_health_monitoring_systems"]}