{"id":"323358536_Impact_of_knowledge_sharing_and_absorptive_capacity_on_project_performance_the_moderating_role_of_social_processes","abstract":"Purpose - This study aims to propose an integrated model to examine the impact of knowledge governance, knowledge sharing and absorptive capacity (ACAP) on project performance in the context of project-based organizations (PBOs). This study also examines the moderating role of social processes on the relationships among these variables.\n\nDesign/methodology/approach - To test the proposed model, cross-sectional data were collected regarding projects from 133 PBOs in Pakistan’s information technology/software industry. The data were analyzed using the partial least squares – structural equation modeling (PLS-SEM) method and PRCOESS tool. Finally, this study also uses causal asymmetry analysis to check asymmetric relationship in the key constructs.\n\nFindings - The results generally support the proposed model. Knowledge governance and knowledge sharing are important antecedents for improving the ACAP of the project, which in turn significantly improves project performance. Additionally, social processes positively moderate the relationship between knowledge sharing and ACAP, as well as between ACAP and project performance.\n\nResearch limitations/implications - The findings suggest that PBOs should invest in developing a knowledge governance system that guides and stimulates knowledge sharing within and between projects. This would boost the ACAP of projects and lead to superior project performance.\n\nOriginality/value - This study addresses the important issue of knowledge management in IT/software projects. It proposes a unique model that integrates the key constructs of knowledge management and describes their effect on project performance.","authors":["Imran Ali","Ata Ul Musawir","Murad Ali"],"meta":["February 2018Journal of Knowledge Management 22(1)","DOI:10.1108/JKM-10-2016-0449","Project: knowledge and innovation, PLS-SEM, fsQCA, Artificial Neural Network (ANN)"],"references":["321874281_Impact_of_Organizational_Culture_Values_on_Organizational_Agility","321409127_Analyzing_Supply_Chain_Uncertainty_to_Deliver_Sustainable_Operational_Performance_Symmetrical_and_Asymmetrical_Modeling_Approaches","321256468_The_Impact_of_Managerial_and_Adaptive_Capabilities_to_Stimulate_Organizational_Innovation_in_SMEs_A_Complementary_PLS-SEM_Approach","319669432_Partial_Least_Squares_Structural_Equation_Modeling","317400451_Advanced_Issues_in_Partial_Least_Squares_Structural_Equation_Modeling","317144457_The_effect_of_organizational_structure_on_absorptive_capacity_in_single_and_dual_learning_modes","333389574_Management_of_Project_Knowledge_and_Experiences","329822427_Some_Methods_for_Respecifying_Measurement_Models_to_Obtain_Unidimensional_Construct_Measurement","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","313082025_Knowledge_management_and_knowledge_management_systems_conceptual_foundations_and_research_issues"]}