{"id":"323367563_Increasing_temperature_of_cooling_granular_gases","abstract":"The kinetic energy of a force-free granular gas decays monotonously due to inelastic collisions of the particles. For a homogeneous granular gas of identical particles, the corresponding decay of granular temperature is quantified by Haff's law. Here, we report that for a granular gas of aggregating particles, the granular temperature does not necessarily decay but may even increase. Surprisingly, the increase of temperature is accompanied by the continuous loss of total gas energy. This stunning effect arises from a subtle interplay between decaying kinetic energy and gradual reduction of the number of degrees of freedom associated with the particles' dynamics. We derive a set of kinetic equations of Smoluchowski type for the concentrations of aggregates of different sizes and their energies. We find scaling solutions to these equations and a condition for the aggregation mechanism predicting growth of temperature. Numerical direct simulation Monte Carlo results confirm the theoretical predictions.","authors":["Nikolai Brilliantov","Arno Formella","Thorsten Pöschel"],"meta":["February 2018Nature Communications 9(1)","DOI:10.1038/s41467-017-02803-7"],"references":["315797414_Ballistic_Aggregation_in_Systems_of_Inelastic_Particles_Cluster_growth_structure_and_aging","301877963_Kinetics_of_Vapor-Solid_Phase_Transitions_Structure_Growth_and_Mechanism","280118608_Size_distribution_of_particles_in_Saturn's_rings_from_aggregation_and_fragmentation","345980566_Physics_of_Long-Range_Interacting_Systems","344896934_Kinetic_Theory_of_Granular_Gases","316800807_Transport_and_Fluctuations_in_Granular_Fluids","312158798_Material_Physics_Rockets_MAPHEUS-34_Flights_and_Developments","292720794_Intermolecular_and_Surface_Forces_3rd_Edition","275228698_Freely_cooling_granular_gases_with_short-ranged_attractive_potentials","272411190_Three-dimensional_3D_experimental_realization_and_observation_of_a_granular_gas_in_microgravity"]}