{"id":"323338966_Choosing_STEM_College_Majors_Exploring_the_Role_of_Pre-College_Engineering_Courses","abstract":"Despite the recent policy proclamations urging state and local educators to implement integrated science, technology, engineering, and mathematics (STEM) curricula, relatively little is known about the role and impact of pre-college engineering courses within these initiatives. When combined with appropriate mathematics and science courses, high school engineering and engineering technology (E&ET) courses may have the potential to provide students with pre-college learning experiences that encourage them to pursue STEM college majors. Our central research question was: What is the nature and extent of any relationship between high school E&ET course completion and subsequent selection of a STEM major in a two-year or four-year college? Using the first and second follow-up datasets of the Education Longitudinal Study of 2002, we examined the direction and magnitude of the association between E&ET course-taking in high school and postsecondary STEM program enrollment. We controlled for a wide array of factors identified in the literature as being associated with college major selection, allowing us to better isolate the association between high school E&ET course-taking and college major selection. Overall, students who earned three credits in E&ET courses were 1.60 times more likely to enroll in STEM majors in four-year institutions than students who did not earn high school E&ET credits. This positive, significant association persisted even after controlling for students’ social backgrounds, academic preparation and attitudes during high school, college choice considerations, and early postsecondary education experiences. In combination with a high school college readiness curriculum, E&ET courses potentially contribute in multiple ways to informing students’ selection of engineering and STEM college majors.","authors":["L. Allen Phelps","Eric Camburn","Sookweon Min"],"meta":["February 2018Journal of Pre-College Engineering Education Research (J-PEER) 8(1)","DOI:10.7771/2157-9288.1146"],"references":["316630314_Multilevel_structural_equation_models_for_investigating_the_effects_of_computer-based_learning_in_math_classrooms_on_Science_Technology_Engineering_and_Math_STEM_major_selection_in_4-year_postsecondar","344839303_A_Study_of_the_Impact_of_Project_Lead_The_Way_on_Achievement_Outcomes_in_Iowa","325081757_Board_122_The_Impact_of_Community_College_Students'_Propensity_for_Innovation_on_Persistence_in_STEM_Majors","325078016_Helping_First-Year_Engineering_Students_Select_a_Major","319748439_Access_To_Advanced_Math","319604582_Understanding_African_American_Students'_Experiences_in_STEM_Education_An_Ecological_Systems_Approach","316879791_Community_colleges_in_the_evolving_STEM_education_landscape_Summary_of_a_summit","305920439_SCCT_Research_in_the_International_Context_Empirical_Evidence_Future_Directions_and_Practical_Implications","305920249_SCCT_and_Underrepresented_Populations_in_STEM_Fields_Moving_the_Needle","305682888_A_Social_Cognitive_Approach_to_Understanding_Engineering_Career_Interest_and_Expectations_among_Underrepresented_Students_in_School-Based_Clubs"]}