{"id":"323355797_Are_Two_Samples_Really_Better_Than_One_On_the_Non-Asymptotic_Performance_of_Empirical_Revenue_Maximization","abstract":"The literature on \"mechanism design from samples,\" which has flourished in recent years at the interface of economics and computer science, offers a bridge between the classic computer-science approach of worst-case analysis (corresponding to \"no samples\") and the classic economic approach of average-case analysis for a given Bayesian prior (conceptually corresponding to the number of samples tending to infinity). Nonetheless, the two directions studied so far are two extreme and almost diametrically opposed directions: that of asymptotic results where the number of samples grows large, and that where only a single sample is available. In this paper, we take a first step toward understanding the middle ground that bridges these two approaches: that of a fixed number of samples greater than one. In a variety of contexts, we ask what is possibly the most fundamental question in this direction: \"are two samples really better than one sample?\". We present a few surprising negative result, and complement them with our main result: showing that the worst-case, over all regular distributions, expected-revenue guarantee of the Empirical Revenue Maximization algorithm given two samples is greater than that of this algorithm given one sample. The proof is technically challenging, and provides the first result that shows that some deterministic mechanism constructed using two samples can guarantee more than one half of the optimal revenue.","authors":["Moshe Babaioff","Yannai A. Gonczarowski","Yishay Mansour","Shay Moran"],"meta":["February 2018"],"references":["228730784_Approximation_in_Mechanism_Design","4901330_Auctions_Versus_Negotiations","1955771_Truth_Revelation_in_Approximately_Efficient_Combinatorial_Auctions","317639849_Efficient_empirical_revenue_maximization_in_single-parameter_auction_environments","316617803_Sample_Complexity_of_Multi-Item_Profit_Maximization","312538489_Revenue_maximization_with_a_single_sample","305525032_Ironing_in_the_Dark","303901619_The_sample_complexity_of_auctions_with_side_information","262270737_Parametric_digital_auctions","5202190_Optimal_Auction_Design"]}