{"id":"323324757_Mixed_Approaches_to_CS0_Exploring_Topic_and_Pedagogy_Variance_after_Six_Years_of_CS0","abstract":"Since 2010, the Cal Poly Computer Science Department has required computing majors to select from a variety of CS0 courses to start their academic year. The broad objective of the course is to attract and retain undergraduates that have no prior experience in CS by using authentic problems that demonstrate the relevance and highlight the role of computers in solving \"real world\" problems. The course is offered in a variety of thematic \"flavors\" that leverage a student's pre-existing interests (e.g. in music or art), but all share the common goals of introducing students to the basics of programming, teamwork, and college-level study. While there is overlap in overall goals, the courses vary drastically in topic matter (e.g. robotics, gaming, music, computational art, mobile apps, security) and in pedagogical approach (e.g. principles of design, project-based student driven learning, and traditional topic-based programming modules). The introduction of this CS0 course has increased students' commitment to their major and success in follow-on classes. We present these successes and show that student GPAs in a follow-on object oriented programming course do not vary significantly for the differing subtopics and teaching pedagogies employed in the various flavors. Our report includes examining two student subgroups (those experienced with programming and those new to programming). Our evaluations suggest that the existence and goal of the course matter more than the specific content, with all subtopics and pedagogical approaches performing well.","authors":["Zoë J. Wood","John Clements","Zachary Peterson","David Janzen"],"meta":["February 2018","DOI:10.1145/3159450.3159592","Conference: the 49th ACM Technical Symposium"],"references":["262171514_Exploring_hypotheses_about_media_comptation","259649357_Creative_Coding_and_Visual_Portfolios_for_CS1","254007477_Improving_First-year_Success_and_Retention_through_Interest-Based_CS0_Courses","254004985_Game_design_for_promoting_counterfactual_thinking","221538954_A_multidisciplinary_approach_towards_computational_thinking_for_science_majors","221538557_Evaluating_a_breadth-first_CS_1_for_scientists","220613179_Failure_rates_in_introductory_programming","262392995_Teaching_computing_for_everyone","262276058_Using_the_context_of_algorithmic_art_to_change_attitudes_in_introductory_programming","246393956_How_to_Design_Programs_An_Introduction_to_Computing_and_Programming","234789601_Does_contextualized_computing_education_help","221538832_Women_in_CS_An_evaluation_of_three_promising_practices"]}