{"id":"323365727_Sistem_Pendukung_Keputusan_Pengurutan_Berdasarkan_Jenis_Suara_Anggota_Baru_Divisi_Paduan_Suara_BIOS_Menggunakan_Metode_Profile_Matching_Studi_Kasus_Logicio_Choir_FILKOM","abstract":"Abstrak Paduan Suara Mahasiswa Fakultas Ilmu Komputer atau yang sering disebut dengan Logicio Choir (LC) merupakan suatu divisi di dalam organisasi Seni dan Olahraga di lingkungan Fakultas Ilmu Komputer yang bernama BIOS (Badan Internal Olahraga dan Seni). Divisi ini digunakan untuk menampung mahasiswa FILKOM yang tertarik dan memiliki bakat di bidang paduan suara. Para peserta ini muncul dari keinginan untuk meningkatkan pengetahuan dan keterampilan musik mereka. Untuk menjadi anggota dari paduan suara ini dilakukan beberapa tahap seleksi. Kriteria yang dinilai dalam seleksi tersebut antara lain adalah kemampuan pendengaran (hearing nada), kemampuan membaca not balok ataupun not angka, kemampuan bernyanyi dengan intonasi dan artikulasi yang baik dan penentuan tinggi rendah nada seseorang (ambitus nada). Banyaknya jumlah kriteria, sedikitnya juri dalam menyeleksi serta hasil kriteria yang berbeda-beda tiap anggota membuat sulit dalam mencapai keputusan. Profile Matching adalah salah satu metode pengambilan keputusan yang cocok untuk seleksi penerimaan anggota secara objektif sesuai kriteria yang dibutuhkan. Profile Matching merupakan sebuah mekanisme pengambilan keputusan dengan mengasumsikan bahwa terdapat tingkat variabel prediktor ideal yang harus dimiliki oleh individu, bukan tingkat minimal yang harus dipenuhi atau dilewati. Penilaian dan perhitungan niliai gap berdasarkan 9 kriteria yaitu ambitus, hearing 2 nada, hearing 3 nada, hearing 4 nada, hearing 5 nada, membaca not balok, mebaca not angka, menyanyi lagu wajid dan menyanyi lagu bebas. Hasil dari implementasi metode Profile Matching dapat menjadi solusi efisien dan efektif dalam pengambilan keputusan untuk seleksi penerimaan anggota. Kinerja sistem yang dirancang dapat digunakan untuk mengambil keputusan penerimaan anggota dengan output berupa urutan berdasarkan nilai akhir yang paling tinggi ke nilai akhir yang paling rendah dengan jumlah 61 data uji dengan persentase validitas sebesar 77.04%. Abstract Faculty of Computer Science Choir's or commonly referred to with the Logicio Choir (LC) is a Division in the organization of Arts and Sports in an environment of Faculty of Computer Science called the BIOS (Badan Internal Olahraga dan Seni). The Division was used to accommodate FILKOM students and has talent in the field of the chorus. The participants emerged from the desire to improve the knowledge and skills of their music. To become a member of this choir performed need several stages of selection. The criteria assessed in the selection include the ability of auditory (hearing), the ability to read scores or not numbers, the ability to sing with good intonation, articulation and determination high and low tone of someone (ambitus tone). A large number of criteria in selecting a jury, at least as well as the results of the different criteria that each Member makes it difficult in reaching a decision. Profile Matching is one of the decision-making methods that is suitable for selecting the members objectively based on the criteria that are needed by the organization. Profile Matching is a decision-making mechanism to assume that there is an ideal level of predictor variables that must be owned by individuals, not the minimum level that must be passed. Assessment and calculation of the value gap based on 9 citeria: Ambitus, hearing 2 tone, hearing 3 tone, hearing","authors":["Dinul Wikramaditya Syah","Edy Santoso","Rizal Setya Perdana"],"meta":["August 2017"],"references":["314036007_Implementasi_Metode_Profile_matching_untuk_Penentuan_Penerimaan_Usulan_Penelitian_Internal_Dosen_STMIK_El_Rahma","277853029_SISTEM_PENDUKUNG_KEPUTUSAN_SELEKSI_SUMBER_DAYA_MANUSIA_DI_PERUSAHAAN","233587993_Analysing_and_Understanding_the_Singing_Voice_Recent_Progress_and_Open_Questions","221479871_On_using_voice_source_measures_in_automatic_gender_classification_of_children's_speech","309474789_Effects_of_Focus_of_Attention_on_Tone_Production_in_Trained_Singers","261210796_Formant_analysis_in_assessment_of_the_quality_of_choral_singers"]}