{"id":"323395783_In_vivo_estimation_of_passive_biomechanical_properties_of_human_myocardium","abstract":"Identification of in vivo passive biomechanical properties of healthy human myocardium from regular clinical data is essential for subject-specific modelling of left ventricle (LV). In this work, myocardium was defined by Holzapfel-Ogden constitutive law. Therefore, the objectives of the study were (a) to estimate the ranges of the constitutive parameters for healthy human myocardium using non-invasive routine clinical data, and (b) to investigate the effect of geometry, LV end-diastolic pressure (EDP) and fibre orientations on estimated values. In order to avoid invasive measurements and additional scans, LV cavity volume, measured from routine MRI, and empirical pressure-normalised-volume relation (Klotz-curve) were used as clinical data. Finite element modelling, response surface method and genetic algorithm were used to inversely estimate the constitutive parameters. Due to the ill-posed nature of the inverse optimisation problem, the myocardial properties was extracted by identifying the ranges of the parameters, instead of finding unique values. Additional sensitivity studies were carried out to identify the effect of LV EDP, fibre orientation and geometry on estimated parameters. Although uniqueness of the solution cannot be achieved, the normal ranges of the parameters produced similar mechanical responses within the physiological ranges. These information could be used in future computational studies for designing heart failure treatments.\nGraphical abstract","authors":["Arnab Palit","Sunil K Bhudia","Theodoros Arvanitis","Glen A Turley"],"meta":["February 2018Medical & Biological Engineering & Computing 56(5):1-17","DOI:10.1007/s11517-017-1768-x"],"references":["276317648_Parameter_estimation_in_a_Holzapfel-Ogden_law_for_healthy_myocardium","272822630_Quantification_of_Shear_Deformations_and_Corresponding_Stresses_in_the_Biaxially_Tested_Human_Myocardium","312450052_Parameter_estimation_of_the_Holzapfel-Ogden_law_for_healthy_myocardium","312189697_Passive_diastolic_modelling_of_human_ventricles_Effects_of_base_movement_and_geometrical_heterogeneity","284352901_Effect_of_Fibre_Orientation_on_Diastolic_Mechanics_of_Human_Ventricle","279753926_Biomechanical_Properties_and_Microstructure_of_Human_Ventricular_Myocardium","277454489_Epicardial_Suction_A_New_Approach_to_Mechanical_Testing_of_the_Passive_Ventricular_Wall","275525798_Heterogeneous_growth-induced_prestrain_in_the_heart","274702811_Influence_of_myocardial_fibersheet_orientations_on_left_ventricular_mechanical_contraction","271219970_Computational_modelling_of_left-ventricular_diastolic_mechanics_Effect_of_fibre_orientation_and_right-ventricle_topology"]}