{"id":"323331159_The_Importance_of_Producing_Shared_Code_Through_Pair_Programming","abstract":"Collaborative learning frameworks such as pair programming have been shown to be highly effective for computer science learning. Skeptics of this approach often refer to the risk of one student relying on a stronger partner to solve the problem. Lending weight to this skepticism, many theories emphasize the importance of learner autonomy. Therefore, it is reasonable to hypothesize that a hybrid pair programming paradigm-one in which partners work together side-by-side at two separate computers and produce their own versions of the code-may be even more effective than traditional pair programming. To investigate this hypothesis, we conducted a study in which 200 introductory programming students were paired and then placed in either a pair-programming condition (two students at one computer) or a hybrid condition (two students at two computers). The results show that traditional pair programming fostered comparable learning gains as measured on an individual post-test, and significantly higher student satisfaction, than the hybrid approach. These findings highlight the importance of not just collaborating, but working together on shared code, for novice computer science learners.","authors":["Mehmet Celepkolu","Kristy Elizabeth Boyer"],"meta":["February 2018","DOI:10.1145/3159450.3159506","Conference: the 49th ACM Technical Symposium"],"references":["243778765_The_Construction_of_Shared_Knowledge_in_Collaborative_Problem_Solving","341352019_Schools_for_Thought_A_Science_of_Learning_in_the_Classroom","314722187_Experimenting_with_pair_programming_in_the_classroom","313046190_An_overview_of_cooperative_learning","312676691_Exploring_Collaborative_Learning_Theoretical_and_Conceptual_Perspectives","283735711_Investigating_Chinese_HE_EFL_classrooms_Using_collaborative_learning_to_enhance_learning","273055780_Schools_for_Thought_A_Science_of_Learning_in_the_Classroom","266657039_Failure_rates_in_introductory_programming_revisited","242358843_Schools_for_Thought_A_Science_of_Learning_in_the_Classroom","234728419_The_Effects_of_Repeated_Cooperative_Testing_in_an_Introductory_Statistics_Course"]}