{"id":"323365558_Implementasi_Metode_Improved_K-Means_Untuk_Mengelompokkan_Dokumen_Jurnal_Pengembangan_Teknologi_Informasi_Dan_Ilmu_Komputer","abstract":"Abstrak Jurnal Pengembangan Teknologi Informasi dan Ilmu Komputer (J-PTIIK) merupakan jurnal keilmuan di bidang komputer yang memuat tulisan ilmiah hasil penelitian mahasiswa/i FILKOM Universitas Brawijaya yang diterbitkan secara berkala. J-PTIIK merupakan dokumen jurnal yang memiliki topik jurnal berada dalam bidang teknologi informasi dan ilmu komputer. Pada saat ini J-PTIIK dikelompokkan berdasarkan arsip volume dan nomor terbit jurnal. Untuk memudahkan identifikasi topik jurnal yang terdapat pada J-PTIIK, maka dokumen J-PTIIK dapat dikelompokkan berdasarkan kemiripan topik yang terdapat dalam J-PTIIK. Pengelompokan dokumen J-PTIIK dibuat dengan menggunakan metode improved k-means. Metode improved k-means merupakan teknik klasterisasi unsupervised dengan penentuan centroid awal klaster diperoleh dengan cara menggabungkan metode optimasi jarak dan densitas. Praproses dokumen dan pembentukan vector space model untuk melakukan pembobotan kata dilakukan terlebih dahulu sebelum mengelompokkan dokumen J-PTIIK. Berdasarkan hasil pengujian, pengelompokan dokumen J-PTIIK memperoleh hasil silhouette coefficient optimal sebesar 0,026574 pada k = 19 dan α = 0,50. Hasil pengujian purity optimal diperoleh sebesar 0,738197 pada k = 23 dan α = 0,50. Hasil penelitian menunjukkan penggunaan metode improved k-means memiliki silhouette coefficient yang lebih baik dibandingkan metode k-means, dengan nilai rata-rata silhouette coefficient pada metode improved k-means sebesar 0,016457654 dan metode k-means sebesar 0,011820563. Abstract Journal of Information Technology and Computer Science Development (J-PTIIK) is a scientific journal in the field of computer that contains scientific writings of research results FILKOM Brawijaya University students that published periodically. J-PTIIK is a journal document that has journal topics that are in the field of information technology and computer science. At this time J-PTIIK is clustered by volume archive and published journal number. To facilitate the identification of journal topics contained in J-PTIIK, J-PTIIK documents can be clustered based on similarity of topics contained in J-PTIIK. J-PTIIK documents clustering is made using improved k-means method. The improved k-means method is the unsupervised clustering techniques with the initial centroid determination obtained by combining the optimization method of distance and density. Document pre-processing and formation of vector space model to perform term weighting is done first before clustering the J-PTIIK documents. Based on the evaluation results, J-PTIIK documents clustering obtained an optimal silhouette coefficient by 0.026574 at k = 19 and α = 0.50. Optimal purity test results obtained by 0.738197 at k = 23 and α = 0.50. The research result shows that the use of improved k-means method has better silhouette coefficient than k-means method, with average value of silhouette coefficient at improved k-means method by 0.016457654 and k-means method by 0.011820563.","authors":["Muhammad Abdurasyid","Indriati","Rizal Setya Perdana"],"meta":["February 2018"],"references":["339529230_Preprocessing_Techniques_for_Text_Mining_-_An_Overview","273038150_Text_Mining_Techniques_and_its_Application","261641244_ModEx_and_Seed-Detective_Two_Novel_Techniques_for_High_Quality_Clustering_by_using_Good_Initial_Seeds_in_K-Means","260341572_TEXT_MINING_CONCEPTS_PROCESS_AND_APPLICATIONS","257744026_Initialization_for_K-means_Clustering_using_Voronoi_Diagram","318473343_An_Improved_K-means_Text_Clustering_Algorithm_by_Optimizing_Initial_Cluster_Centers","316533987_Text_mining_An_improvised_feature_based_model_approach","315873299_Two_Step_Clustering_Model_for_K-Means_Algorithm","309074560_Scoring_term_weighting_and_the_vector_space_model","268645239_Parallel_K-means_clustering_algorithm","220814768_Beyond_TFIDF_Weighting_for_Text_Categorization_in_the_Vector_Space_Model","220751747_Optimized_K-means_clustering_with_intelligent_initial_centroid_selection_for_web_search_using_URL_and_tag_contents"]}