{"id":"323364216_Agile_convolutional_neural_network_for_pulmonary_nodule_classification_using_CT_images","abstract":"Objective\nTo distinguish benign from malignant pulmonary nodules using CT images is critical for their precise diagnosis and treatment. A new Agile convolutional neural network (CNN) framework is proposed to conquer the challenges of a small-scale medical image database and the small size of the nodules, and it improves the performance of pulmonary nodule classification using CT images. MethodsA hybrid CNN of LeNet and AlexNet is constructed through combining the layer settings of LeNet and the parameter settings of AlexNet. A dataset with 743 CT image nodule samples is built up based on the 1018 CT scans of LIDC to train and evaluate the Agile CNN model. Through adjusting the parameters of the kernel size, learning rate, and other factors, the effect of these parameters on the performance of the CNN model is investigated, and an optimized setting of the CNN is obtained finally. ResultsAfter finely optimizing the settings of the CNN, the estimation accuracy and the area under the curve can reach 0.822 and 0.877, respectively. The accuracy of the CNN is significantly dependent on the kernel size, learning rate, training batch size, dropout, and weight initializations. The best performance is achieved when the kernel size is set to \\(7\\times 7\\), the learning rate is 0.005, the batch size is 32, and dropout and Gaussian initialization are used. Conclusions\nThis competitive performance demonstrates that our proposed CNN framework and the optimization strategy of the CNN parameters are suitable for pulmonary nodule classification characterized by small medical datasets and small targets. The classification model might help diagnose and treat pulmonary nodules effectively.","authors":["Xinzhuo Zhao","Liyao Liu","Shouliang Qi","Yueyang Teng"],"meta":["February 2018International Journal of Computer Assisted Radiology and Surgery 13(1)","DOI:10.1007/s11548-017-1696-0"],"references":["305486310_Enhancing_deep_convolutional_neural_network_scheme_for_breast_cancer_diagnosis_with_unlabeled_data","305196650_Going_deeper_with_convolutions","301651102_Computer_aided_lung_cancer_diagnosis_with_deep_learning_algorithms","301330399_Computer-Aided_Diagnosis_with_Deep_Learning_Architecture_Applications_to_Breast_Lesions_in_US_Images_and_Pulmonary_Nodules_in_CT_Scans","296624579_Pulmonary_Nodule_Detection_in_CT_Images_False_Positive_Reduction_Using_Multi-View_Convolutional_Networks","292996483_Deep_Convolutional_Neural_Networks_for_Computer-Aided_Detection_CNN_Architectures_Dataset_Characteristics_and_Transfer_Learning","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311609041_Deep_Residual_Learning_for_Image_Recognition","303600785_Multi-crop_Convolutional_Neural_Networks_for_Lung_Nodule_Malignancy_Suspiciousness_Classification","301732947_Guest_Editorial_Deep_Learning_in_Medical_Imaging_Overview_and_Future_Promise_of_an_Exciting_New_Technique"]}