{"id":"323330404_Improving_Research_and_Experience_Reports_of_Pre-College_Computing_Activities_A_Gap_Analysis","abstract":"This paper provides a detailed examination of pre-college computing activities as reported in three Association of Computing Machinery (ACM) venues (2012-2016). Ninety-two articles describing informal learning activities were reviewed for 24 program elements (i.e., activity components, and student/instructor demographics). These 24 program elements were defined and shaped by a virtual focus group study and the articles themselves. Results indicate that the majority of authors adequately report age/grade levels of participants, number of participants, the type of activity, when the activity was offered, the tools/languages used in the activity, and whether the activity was required or elective. However, there is a deficiency in reporting many other important and foundational program elements, including contact hours of activity participants, clear learning objectives, the prior experience of participants (students and instructors), and many more. In conjunction with previous work, this paper provides recommendations to reduce these deficiencies. The Recommendations for Reporting Pre-College Computing Activities (Version 1.0) are presented to help researchers improve the quality of papers, set a standard of necessary data needed to replicate studies, and provide a basis for comparing activities and activity outcomes across multiple studies and experiences.","authors":["Monica M. McGill","Adrienne Decker","Zachary Abbott"],"meta":["February 2018","DOI:10.1145/3159450.3159481","Conference: the 49th ACM Technical Symposium","Project: Effectiveness of pre-college computing activities"],"references":["314303790_Pre-College_Computing_Outreach_Research_Towards_Improving_the_Practice","311489321_Towards_a_Common_Framework_for_Evaluating_Computing_Outreach_Activities","303904862_Undergraduate_Students'_Perceptions_of_the_Impact_of_Pre-College_Computing_Activities_on_Choices_of_Major","301705066_Bringing_computer_science_to_US_schools_state_by_state","275673504_Theorising_about_gender_and_computing_interventions_through_an_evaluation_framework_Theorising_about_gender_and_computing_interventions"]}