{"id":"323317621_A_Comparative_Analysis_for_Tree-Based_Ensemble_Methods_for_Detecting_Imminent_Lane_Change_Maneuvers_in_Connected_and_Automated_Vehicle_Environments","abstract":"Lane-changing is one of the main contributors to car crashes in the U.S. The complexity of the decision-making process associated with lane-changing makes such maneuvers prone to driving errors, and hence, increases the possibility of car crashes. Thus, researchers have been investigating ways to model and predict lane-changing maneuvers for optimally designed crash avoidance systems. Such systems rely on the accuracy of detecting the onset of lane-change maneuvers, which requires comprehensive vehicle trajectory data. Connected Vehicles (CV) data provide opportunities for accurate modeling of lane-changing maneuvers, especially with the variety of advanced tools available nowadays. The review of the literature indicates that most of the implemented modeling tools do not achieve reliable accuracy for such critical safety application of lane-change prediction. Recently, eXtreme Gradient Boosting (XGB) became a well-recognized algorithm among the computer science community in solving classification problems due to its accuracy, scalability, and speed. This study implements the XGB in predicting the onset of lane changing maneuvers using CV trajectory data. The performance of XGB is compared to three other tree-based algorithms namely, Decision Trees, Gradient Boosting, and Random Forests. The Next Generation Simulation trajectory data are used to represent the high-resolution CV data. The results indicate that XGB is superior to the other algorithms with a high accuracy value of 99.7%. This outstanding accuracy is achieved when considering vehicle trajectory data two seconds prior to a potential lane change maneuver. The findings of this study are promising for detection of lane change maneuvers in CV environments.","authors":["Saleh Mousa","Peter R. Bakhit","Osama A. Osman","Sherif Ishak"],"meta":["February 2018Transportation Research Record Journal of the Transportation Research Board 2672(42)","DOI:10.1177/0361198118780204","Project: Connected Vehicle Applications"],"references":["267625987_Near-Crash_Identification_in_a_Connected_Vehicle_Environment","321694645_Detecting_Imminent_Lane_Change_Maneuvers_in_Connected_Vehicle_Environments","317002983_An_Extreme_Gradient_Boosting_Algorithm_for_Freeway_Short-Term_Travel_Time_Prediction","312908213_Lane_changing_on_the_motorway_factors_affecting_its_occurrence_and_their_implications","312551529_Higgs_boson_discovery_with_boosted_trees","301839264_XGBoost_A_Scalable_Tree_Boosting_System","287584136_Models_of_freeway_lane_changing_and_gap_acceptance_behavior","282506218_Modeling_Lane-Changing_Behavior_in_a_Connected_Environment_A_Game_Theory_Approach","277436958_Integrated_Lane_Change_Model_with_Relaxation_and_Synchronization","264626419_Investigation_of_the_early-onset_breakdown_phenomenon_at_urban_expressway_bottlenecks_in_Shanghai","260604695_The_Evolution_of_Boosting_Algorithms_From_Machine_Learning_to_Statistical_Modelling","258400864_A_Neural_Network_Model_for_Driver's_Lane-Changing_Trajectory_Prediction_in_Urban_Traffic_Flow","260657439_Review_of_Microscopic_Lane-Changing_Models_and_Future_Research_Opportunities","258263215_CORSIM-corridor_traffic_simulation_model","245222306_Modelling_dual_carriageway_lane_changing_using_neural_networks"]}