{"id":"323335071_Continual_Lifelong_Learning_with_Neural_Networks_A_Review","abstract":"Humans and animals have the ability to continually acquire and fine-tune knowledge throughout their lifespan. This ability, referred to as lifelong learning, is mediated by a rich set of neurocognitive mechanisms that together contribute to the development and specialization of our sensorimotor skills as well as to long-term memory consolidation and retrieval. Consequently, lifelong learning capabilities are crucial for computational learning systems and autonomous agents interacting in the real world and processing continuous streams of information. However, lifelong learning remains a long-standing challenge for machine learning and neural network models since the continual acquisition of incrementally available information from non-stationary data distributions generally leads to catastrophic forgetting or interference. This limitation represents a major drawback also for state-of-the-art deep and shallow neural network models that typically learn representations from stationary batches of training data, thus without accounting for situations in which the number of tasks is not known a priori and the information becomes incrementally available over time. In this review, we critically summarize the main challenges linked to lifelong learning for artificial learning systems and compare existing neural network approaches that alleviate, to different extents, catastrophic forgetting. Although significant advances have been made in domain-specific learning with neural networks, extensive research efforts are required for the development of robust lifelong learning on autonomous agents and robots. We discuss well-established and emerging research motivated by lifelong learning factors in biological systems such as neurosynaptic plasticity, critical developmental stages, multi-task transfer learning, intrinsically motivated exploration, and crossmodal learning.","authors":["German I. Parisi","Ronald Kemker","Jose L. Part","Christopher Kanan"],"meta":["February 2019Neural networks: the official journal of the International Neural Network Society 113:54-71","DOI:10.1016/j.neunet.2019.01.012","Project: Cross-modal learning"],"references":["329245020_Lifelong_Learning_of_Spatiotemporal_Representations_With_Dual-Memory_Recurrent_Self-Organization","324251375_A_computational_model_of_crossmodal_processing_for_conflict_resolution","323615303_Human_hippocampal_neurogenesis_drops_sharply_in_children_to_undetectable_levels_in_adults","323471514_A_Neurorobotic_Experiment_for_Crossmodal_Conflict_Resolution_in_Complex_Environments","322048883_An_Incremental_Self-Organizing_Architecture_for_Sensorimotor_Learning_and_Prediction","336971631_Feedback_Systems_An_Introduction_for_Scientists_and_Engineers","327916206_Introduction_to_the_Theory_of_Neural_Computation","324255285_Incremental_online_learning_of_objects_for_robots_operating_in_real_environments","324237643_Human_Hippocampal_Neurogenesis_Persists_throughout_Aging","324110517_Theory_for_the_development_of_neuron_selectivity_orientation_specificity_and_binocular_interaction_in_visual_cortex"]}