{"id":"323324710_A_Landscape_Study_of_Computer_Science_Education_in_NYC_Early_Findings_and_Implications_for_Policy_and_Practice","abstract":"NYC's Computer Science for All (CS4All) is a 10-year, districtwide initiative aimed at providing high-quality computer science (CS) education to all NYC public school students. It aspires to greatly increase the number of students, teachers, and schools exposed to CS in NYC, and to offer meaningful learning experiences that build on prior exposure and skills at every grade level. These plans include providing high-quality professional development (PD) to some 5,000 teachers, designed to help them learn new programs and pedagogies in CS education, as well as strategies for integrating CS into existing courses. This paper presents findings from an assessment of CS in NYC, conducted in the second year of the CS4All initiative. Using a telephone survey of a representative sample of schools, we describe the current state of CS programming and training in the City. Overall, we found high participation in CS teacher training opportunities (both through and independent of the initiative) and widespread offering of CS courses Specifically, we estimate just over half of schools districtwide (56%) participated in some type of CS training in the 2015-16 school year, and about two thirds of schools (64%) offered students some kind of CS coursework in the 2016-17 school year (through either stand-alone CS courses or the integration of CS into other subjects). The type of programming and training varied by school level (elementary, middle and high). We also explored the extent to which programming and training are reaching schools and students who are historically underrepresented in CS--including women and girls, students of color, low-income students and students with disabilities. We found that schools offering CS courses and activities served fewer Black and Latino students and more White and Asian Students, compared with schools not offering CS. This work is unique, as it is the only districtwide assessment of CS education conducted anywhere in the country to date, thus adding to an under-researched but important and growing field of study","authors":["Cheri Fancsali","Linda Tigani","Paulina Toro Isaza","Rachel Cole"],"meta":["February 2018","DOI:10.1145/3159450.3159467","Conference: the 49th ACM Technical SymposiumAt: https://dl.acm.org/citation.cfm?id=3159467"],"references":["304346634_Landscape_of_K-12_Computer_Science_Education_in_the_US_Perceptions_Access_and_Barriers","247700402_Teacher_Sorting_and_the_Plight_of_Urban_Schools_A_Descriptive_Analysis","343364402_Running_on_Empty_the_Failure_to_Teach_K--12_Computer_Science_in_the_Digital_Age","317953558_The_dreamkeepers_successful_teachers_of_African_American_children","316947483_Visions_of_Computer_Science_Education_Unpacking_Arguments_for_and_Projected_Impacts_of_CS4All_Initiatives","255573999_Stuck_in_the_Shallow_End_Education_Race_and_Computing","249134606_Effects_of_Teacher_Efficacy_on_Computer_Skills_and_Computer_Cognitions_of_Canadian_Students_in_Grades_K-3","238789537_Attitude_towards_science_A_review_of_the_literature_and_its_implications","238162544_A_Review_of_Research_on_Project-Based_Learning","230557511_Mail_and_Internet_Surveys_The_Tailored_Design_Method"]}