{"id":"323398776_Autonomous_Investment_Analysis_A_Discrete_Probabilistic_Approach","abstract":"Since early days of computer science, researchers ask themselves where is the line that separates\ntasks machine can do from those only human beings can really accomplish. Several tasks were pointed as\nimpossible to machines and later conquered by new advances in Artificial Intelligence. Nowadays, it seems we\nare not far from the day when driving cars will be included among the tasks machines can do in an efficient\nway. Certainly, even more complex activities will be dominated by machines in the future. In fact, there is\nsignificant research effort to make investment analysis become one those activities. In this paper, we propose a\nprobabilistic approach for autonomous investment analysis (AIA) that deals with three dimensions of complexity\n(nature of assets, multiple analysis algorithms per asset and horizon of investment, non-stationary nature of the\nenvironment). This approach is based in multiple autonomous agents, discretization of AIA problem and its\nmodelling as a classification problem. This approach breaks down the complexity faced by AIA in problems that\ncan be addressed by a group of agents that work together to provide intelligent and customized investment\nadvices for individuals. We present an implementation of such approach and the results achieved by using it will\nhistoric data from Brazilian stock market. We believe that such approach may contribute to development of AIA.\nFurthermore, this approach allows an easy integration with algorithms and techniques already developed, that\nmay help to solve part of the problem.","authors":["Paulo André Lima de Castro","Jaime Simão Sichman","Ronnald Annoni Junior"],"meta":["February 2018","DOI:10.22456/2175-2745.74992","Project: Automated Investment Analysis"],"references":["260086856_A_Review_of_Unsupervised_Feature_Learning_and_Deep_Learning_for_Time-Series_Modeling","257518280_Automated_asset_management_based_on_partially_cooperative_agents_for_a_world_of_risks","238751548_TEORIA_E_EVIDENCIA_DA_EFICIENCIA_INFORMACIONAL_DO_MERCADO_DE_CAPITAIS_BRASILEIRO","279272290_Portfolio_Selection","265459481_Probability_and_Statistics_for_the_Engineering_Computing_and_Physical_Sciences","265423800_THE_ENCYCLOPEDIA_OF_TRADING_STRATEGIES","247676575_A_NonRandom_Walk_Down_Wall_Street","244957106_A_Multi-Agent_System_for_Stock_Trading","242550759_Applied_Corporate_Finance","224982542_Computing_Machinery_and_Intelligence","221173715_A_Particle_Swarm_Optimisation_Approach_in_the_Construction_of_Optimal_Risky_Portfolios","221522963_Three_Automated_Stock-Trading_Agents_A_Comparative_Study","221522960_Two_Stock-Trading_Agents_Market_Making_and_Technical_Analysis","221345789_Reinforcement_learning_for_optimized_trade_execution","221226195_Co-evolution_of_Successful_Trading_Strategies_in_A_Simulated_Stock_Market"]}