{"id":"323334894_Unsupervised_Phase_Mapping_of_X-ray_Diffraction_Data_by_Nonnegative_Matrix_Factorization_Integrated_with_Custom_Clustering","abstract":"Analyzing large X-ray diffraction (XRD) datasets is a key step in high-throughput mapping of the compositional phase diagrams of combinatorial materials libraries. Optimizing and automating this task can help accelerate the process of discovery of materials with novel and desirable properties. Here, we report a new method for pattern analysis and phase extraction of XRD datasets. The method expands the Nonnegative Matrix Factorization method, which has been used previously to analyze such datasets, by combining it with custom clustering and cross-correlation algorithms. This new method is capable of robust determination of the number of basis patterns present in the data which, in turn, enables straightforward identification of any possible peak-shifted patterns. Peak-shifting arises due to continuous change in the lattice constants as a function of composition, and is ubiquitous in XRD datasets from composition spread libraries. Successful identification of the peak-shifted patterns allows proper quantification and classification of the basis XRD patterns, which is necessary in order to decipher the contribution of each unique single-phase structure to the multi-phase regions. The process can be utilized to determine accurately the compositional phase diagram of a system under study. The presented method is applied to one synthetic and one experimental dataset, and demonstrates robust accuracy and identification abilities.","authors":["Valentin Stanev","Velimir Vesselinov","A. Gilad Kusne","Graham Antoszewski"],"meta":["February 2018","DOI:10.1038/s41524-018-0099-2","Projects: SOURCE IDENTIFICATION BY NON-NEGATIVE MATRIX FACTORIZATION COMBINED WITH SEMI-SUPERVISED CLUSTERINGMachine Learning based on Matrix/Tensor Factorization (Decomposition)"],"references":["323898384_Identification_of_release_sources_in_advection-diffusion_system_by_machine_learning_combined_with_Green's_function_inverse_method","323650134_Nonnegative_Matrix_Factorization_for_identification_of_unknown_number_of_sources_emitting_delayed_signals","320956775_Contaminant_source_identification_using_semi-supervised_machine_learning","313243636_Comparison_of_dissimilarity_measures_for_cluster_analysis_of_X-ray_diffraction_data_from_combinatorial_libraries","311612086_Sources_identification_using_shifted_non-negative_matrix_factorization_combined_with_semi-supervised_clustering","308913041_Automated_Phase_Mapping_with_AgileFD_and_its_Application_to_Light_Absorber_Discovery_in_the_V-Mn-Nb_Oxide_System","308805626_Phase-Mapper_An_AI_Platform_to_Accelerate_High_Throughput_Materials_Discovery","344076422_Combinatorial_Materials_Synthesis","320535608_Inferring_phase_diagrams_from_X-ray_data_with_background_signals_using_graph_segmentation","305451877_Semi-Supervised_Approach_to_Phase_Identification_from_Combinatorial_Sample_Diffraction_Patterns"]}