{"id":"323370499_Secure_Data_Archiving_Using_Enhanced_Data_Retention_Policies","abstract":"With the increase in the number of applications that are deployed and executed in a cloud, cloud service providers face several maintenance related issues due to the high volume of data involved. The inability to effectively organize the information for decision making can have a serious impact on business decision making. The use of a cloud’s storage facilities for data backup and archiving provides flexibility and data preservation features at a very low cost. In this paper, we present an efficient data management system that can archive, store and manage information effectively. The massive amount of data in the cloud is grouped based on Jaccard Similarity into six different buckets. Two sets of data retention policies are proposed for the cloud archive framework. These policies are applied to each of the buckets individually to identify the data to be archived. Additionally, homomorphic encryption is applied to provide a level of security to the data to be archived. This data is archived into the cloud to provide a data storage environment as a service that is optimized for long term data retention, security and that is compliant with the data retention policy. This framework eventually improves the availability, confidentiality and reduces the access latency significantly.","authors":["Sabireen Haneef","Kirthica S.","Rajeswari Sridhar"],"meta":["February 2018","DOI:10.1007/978-981-10-8603-8_12","In book: Data Science Analytics and Applications (pp.139-152)"],"references":["317248581_Using_of_Jaccard_Coefficient_for_Keywords_Similarity","271311252_Cloud_Computing_Evaluation_Based_on_Financial_Metrics","261083917_Homomorphic_encryption_method_applied_to_Cloud_Computing","253233588_Versioned_File_Backup_and_Synchronization_for_Storage_Clouds","221354138_Evaluating_2-DNF_Formulas_on_Ciphertexts","220726111_An_Artificial_Intelligence_Perspective_on_Autonomic_Computing_Policies","220595098_GEODAC_A_Data_Assurance_Policy_Specification_and_Enforcement_Framework_for_Outsourced_Services","262234123_Howcare_a_personal_health_cloud_archive_and_care-partners'_community","261488280_CloudDT_Efficient_tape_resource_management_using_deduplication_in_cloud_backup_and_archival_services","240542439_Cloud_Computing_and_Information_Policy_Computing_in_a_Policy_Cloud","224168699_A_medical_image_archive_solution_in_the_cloud","37991950_How_People_Re-find_Information_When_the_Web_Changes","8067668_Trends_in_PACS_image_storage_and_archive"]}