{"id":"323333867_Estimacion_de_costo_de_software_Una_propuesta_de_aplicacion_pedagogica_de_COCOMO","abstract":"Los planes de estudio de ciencias de la computación y carreras afines evidencian una brecha importante en torno a la temática de estimación de costos de proyectos de software. En general, en los modelos curriculares relacionados con el desarrollo de software, se recomienda la temática de la estimación en el desarrollo del software sin especificar ningún modelo de estimación en concreto. En abono a lo anterior, dichos modelos tienen la particularidad de que son difíciles de entender y los ejemplos existentes en la bibliografía suelen ser muy vagos sin considerar contextos cercanos a la realidad. En este artículo se presenta una propuesta de aplicación pedagógica del modelo de estimación de costos COCOMO en las modalidades básica e intermedia orientada a la magnitud del producto final. El modelo incluye seis apartados necesarios para un adecuado abordaje pedagógico. Lo primero que se define es su fundamento teórico esquematizado de forma resumida. Además, se presenta un caso real de estudio, ejemplos resueltos, la propuesta pedagógica y el análisis respectivo. La relevancia de este trabajo se fundamenta en el hecho de que se facilita la enseñanza del tema de estimación del costo del software, de forma práctica y contextualizada en un caso real.","authors":["Gabriela Garita Gonzalez","Fulvio Lizano"],"meta":["January 2018","DOI:10.15359/ru.32-1.8"],"references":["247935033_IS_2010_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Information_Systems","247925262_Large_Limits_to_Software_Estimation","220613150_MSIS_2006_Model_curriculum_and_guidelines_for_graduate_degree_programs_in_information_systems","321944643_Software_engineering_economics","271992316_Hybrid_Online_Education","259183325_Joint_Task_Force_on_Computing_Curricula_Report_on_Software_Engineering_Curriculum_Guidlines_for_Undergraduate_Degree_Programs_in_Software_Engineering","252514924_Pedagogical_Models_for_E-Learning_A_Theory-Based_Design_Framework","235939803_Hybrid_Online_Education_Identifying_Integration_Models_Using_Adventure_Learning","233054458_Why_Is_Software_Project_Management_Difficult_And_What_That_Implies_for_Teaching_Software_Project_Management","221494805_A_Survey_on_Software_Cost_Estimation_in_the_Chinese_Software_Industry"]}