{"id":"323453934_Informatics_as_a_branch_in_Indian_Academics_with_case_of_private_universities_emphasizing_Biological_Information_Sciences","abstract":"Informatics is an interdisciplinary field of practice and study and treated as an alternative to information technology as well as computing education. Informatics foci have two ways first is computational and another is information oriented. Informatics is useful and applicable to different types of organizations viz. IT organization, universities, research centers, governments department, social places\nand so on. Informatics is less mathematical and hence much\nuseful in the interaction of people, information, and technologies. Informatics is thus widely used in diverse\nareas viz. healthcare, hospitalities, transportation, society, commerce, and business etc. Information technology is closely associated with the Informatics but it has higher components of information fundamentals and basics of information management. Though, Information Science is much similar and synonymous with informatics in many contexts. Universities around the world are offering degrees, training and research programs in the informatics and its subfields. India is a leading education hub in the world and has numerous educational institutions. Use of informatics nomenclature in India is still very much limited.\nThough, some of the universities (mainly private) have started programs in the field. The paper is conceptual in\nnature and thus theoretical. It provides a detailed account of informatics, its nature, and types emphasizing the\navailability of the degree/programs in India with reference to private universities. The paper mainly highlighted the bio-informatics and related areas at a large as far as private universities are concerned.","authors":["Sreeramana Aithal","P.K. Paul"],"meta":["December 2017","Project: Information Science"],"references":["265116392_7_Consumer_health_informatics_in_the_Internet_age","45651382_Incorporating_Genomics_and_Bioinformatics_across_the_Life_Sciences_Curriculum","24439799_Phylogenetic_diversity_PD_and_bio-diversity_conservation_Some_bioinformatics_challenges","12453365_Consumer_Health_Informatics","307912731_A_vision_for_collaborative_training_infrastructure_for_bioinformatics_Training_infrastructure_for_bioinformatics","261930875_Chemical_Information_Management_Powered_by_Chemo-Informatics_Possibilities_and_Opportunities_Emphasizing_Need_and_Way_in_Academics_and_Universities","222074593_An_essay_on_the_past_and_future_of_information_science_education-II","15559027_Public_Health_Informatics_How_Information-Age_Technology_Can_Strengthen_Public_Health","13953833_Aims_and_tasks_of_medical_informatics","12143855_Health_informatics_education_and_training"]}