{"id":"323440891_Role_of_cognitive_assessment_for_high_school_graduates_prior_to_choosing_their_college_major","abstract":"[Purpose] Academic performance of college students can be impacted by the efficacy of students’ ability and teaching methods. It is important to assess the progression of college students’ cognitive abilities among different college majors and as they move from junior to senior levels. However, dearth of studies have been examined the role of cognitive ability tests as a tool to determine the aptitude of the perspective students. Therefore, this study assessed cognitive abilities of computer science and ART students. [Subjects and Methods] Participants were 130 college students (70 computer and 60 art students) in their first and final years of study at King Saud University. Cognitive ability was assessed using the Test of Nonverbal Intelligence, Third Edition. [Results] The cognitive ability of computer science students were statistically better than that of art students and were shown improvement from junior to senior levels, while the cognitive ability of art students did not. [Conclusion] The cognitive ability of computer science college students was superior compared to those in art, indicating the importance of cognitive ability assessment for high school graduates prior to choosing a college major. Cognitive scales should be included as an aptitude assessment tool for decision-makers and prospective students to determine an appropriate career, which might reduce the rate of university drop out.","authors":["Sami Alabdulwahab","Shaji John Kachanathu","Abdullah Saad AlSaeed"],"meta":["February 2018Journal of Physical Therapy Science 30(2):304-306","DOI:10.1589/jpts.30.304"],"references":["307139233_Cognitive_abilities_of_health_and_art_college_students_a_pilot_study","273897715_College_Performance_and_Retention_A_Meta-Analysis_of_the_Predictive_Validities_of_ACT_R_Scores_High_School_Grades_and_SES","257350649_Novel_evidence_in_support_of_the_bilingual_advantage_Influences_of_task_demands_and_experience_on_cognitive_control_and_working_memory","221776109_Qualitative_Differences_between_Bilingual_Language_Control_and_Executive_Control_Evidence_from_Task-Switching","11210672_Cross-Cultural_Evidence_of_Cognitive_Adaptations_for_Social_Exchange_among_the_Shiwiar_of_Ecuadorian_Amazonia","248975167_Computer_simulations_in_the_high_school_Students'_cognitive_stages_science_process_skills_and_academic_achievement_in_microbiology","220079462_Application_of_Social_Cognitive_Theory_to_Training_for_Computer_Skills","51900317_How_smart_do_you_think_you_are_A_meta-analysis_on_the_validity_of_self-estimates_of_cognitive_ability"]}