{"id":"323463236_The_Extraction_of_Knowledge_Factors_of_Teachers_for_Physical_Computing_Education","abstract":"In informatics, physical computing focuses on interactions to realize the real world as a computing system. From 2018, how to teach the physical computing in informatics as a mandatory subject is important. The purpose of this study is to analyze the problems in the physical computing education recognized by secondary school informatics teachers and to provide implications for effective programming education. First, we extracted related keywords of physical computing in the 2015 revised informatics curriculum and science curriculum. Second, extracted keywords are classified into hardware and programming. Third, we developed a questionnaire item suitable for classification keywords. Finally, web surveys were conducted and analyzed for in-service and preservice secondary school informatics teachers. As a result of the research, it was confirmed that the informatics teachers recognized that physical computing education was helpful for programming education. However, a large proportion of the member's lack of training time and receive appropriate education and training programs, hardware, reduced the level of knowledge about the physical computing element content.","authors":["Hye Seong Park","Aoki Hiroyuki","Ja Mee Kim"],"meta":["February 2018International Journal on Advanced Science Engineering and Information Technology 8(1):30","DOI:10.18517/ijaseit.8.1.3100"],"references":["305343923_The_Changes_of_Middle_School_Students'_Perception_and_Achievement_based_on_the_Teaching_Method_in_Physical_Computing_Education","304925118_Analysis_of_Factors_Affecting_Achievement_in_Maker_Programming_Education_in_the_Age_of_Wireless_Communication","299481548_Comparative_Study_of_Informatics_Subject_Curriculums_and_Textbooks_in_Middle_School_Between_Korea_and_England","276466451_Physical_Computing_and_its_Scope_-_Towards_a_Constructionist_Computer_Science_Curriculum_with_Physical_Computing","228328491_Learning_to_program_-_difficulties_and_solutions","305708367_A_PRACTICAL_APPROACH_TO_ARDUINO_PROGRAMMING_FOR_THE_PHYSICAL_COMPUTING_SECTION_OF_THE_INFORMATICS_CURRICULUM_IN_KOREAN_MIDDLE_SCHOOL","270819564_Physical_Computing_-_Sensing_and_Controlling_the_Physical_World_with_Computers","224588847_Debugging_From_the_Student_Perspective"]}