{"id":"323440662_Classifying_magnetic_resonance_image_modalities_with_convolutional_neural_networks","abstract":"Magnetic Resonance (MR) imaging allows the acquisition of images with different contrast properties depending on the acquisition protocol and the magnetic properties of tissues. Many MR brain image processing techniques, such as tissue segmentation, require multiple MR contrasts as inputs, and each contrast is treated differently. Thus it is advantageous to automate the identification of image contrasts for various purposes, such as facilitating image processing pipelines, and managing and maintaining large databases via content-based image retrieval (CBIR). Most automated CBIR techniques focus on a two-step process: extracting features from data and classifying the image based on these features. We present a novel 3D deep convolutional neural network (CNN)-based method for MR image contrast classification. The proposed CNN automatically identifies the MR contrast of an input brain image volume. Specifically, we explored three classification problems: (1) identify T1-weighted (T1-w), T2-weighted (T2-w), and fluid-attenuated inversion recovery (FLAIR) contrasts, (2) identify pre vs post-contrast T1-w, (3) identify pre vs post-contrast FLAIR. A total of 3418 image volumes acquired from multiple sites and multiple scanners were used. To evaluate each task, the proposed model was trained on 2137 images and tested on the remaining 1281 images. Results showed that image volumes were correctly classified with 97.57% accuracy.","authors":["Samuel Remedios","Snehashis Roy","Dzung L. Pham","John A Butman"],"meta":["February 2018","DOI:10.1117/12.2293943","Conference: Computer-Aided Diagnosis","Project: VHL ELST"],"references":["305196650_Going_deeper_with_convolutions","304360811_Classification_of_medical_images_using_edge-based_features_and_sparse_representation","277411157_Deep_Learning","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316727286_Fast_wavelet_based_image_characterization_for_content_based_medical_image_retrieval","286512696_Deep_Residual_Learning_for_Image_Recognition","275526671_Toward_Content_Based_Image_Retrieval_with_Deep_Convolutional_Neural_Networks","262245694_Classification_of_MRI_brain_images_using_combined_wavelet_entropy_based_spider_web_plots_and_probabilistic_neural_network","234018557_An_implementation_of_a_CBIR_system_based_on_SVM_learning_scheme","224057611_Medical_Image_Categorization_using_a_Texture_Based_Symbolic_Description"]}