{"id":"323489745_Conceptualization_of_energy_security_in_resource-poor_economies_The_role_of_the_nature_of_economy","abstract":"This paper studies how energy security is conceptualized in four resource-poor, advanced island economies: Singapore, South Korea, Japan, and Taiwan. It is found that the energy security conceptualization of the four economies in effect returns to the very original and conventional one: stable and reliable energy supply. However, these economies are different in the level of stability and reliability demanded. Why are they similar in energy security conceptualization whereas different in the level of stability and reliability demanded? Adopting documentation analysis, comparative study, and the varieties of capitalism theory, we find that the nature of economy constitutes the decisive factor that shapes energy security conceptualization. The coordinated market economies (CMEs) are more concerned about energy supply disruption than the liberalized market economies (LMEs). The paper demonstrates that despite numerous energy security concepts in the literature, resource-poor economies still adopt the original and conventional one in practice. The findings suggest that security of supply is the top measure for resource-poor economies to improve their energy security and creating a joint petroleum and LNG market would be desirable for the four economies in this study.","authors":["Lixia Yao","Xunpeng Shi","Philip Andrews-Speed"],"meta":["March 2018Energy Policy 114:394-402","DOI:10.1016/j.enpol.2017.12.029"],"references":["305384172_Evaluating_Energy_Security_of_Resource-Poor_Economies_A_Modified_Principle_Component_Analysis_Approach","304899310_Gas_and_LNG_trading_hubs_hub_indexation_and_destination_flexibility_in_East_Asia","280545512_Singapore_in_a_Post-Kyoto_World_Energy_Environment_and_the_Economy","344749118_Economic_Development_of_Taiwan_Early_Experiences_and_the_Pacific_Trade_Triangle","324051142_VI_THE_ENERGY_ECONOMY_OF_A_CITY_STATE_SINGAPORE","297770397_Singapore_the_Energy_Economy_From_The_First_Refinery_To_The_End_Of_Cheap_Oil_1960-2010","277608233_Energy_security_in_China_A_quantitative_analysis_and_policy_implications","275613132_Energy_Security_in_the_1990s","267918994_The_Developmental_Logic_of_Financial_Liberalization_in_Taiwan","267275066_Renewable_energy_in_eastern_Asia_Renewable_energy_policy_review_and_comparative_SWOT_analysis_for_promoting_renewable_energy_in_Japan_South_Korea_and_Taiwan"]}