{"id":"323407906_An_assessment_of_multimodal_imaging_of_subsurface_text_in_mummy_cartonnage_using_surrogate_papyrus_phantoms","abstract":"Ancient Egyptian mummies were often covered with an outer casing, panels and masks made from cartonnage: a lightweight material made from linen, plaster, and recycled papyrus held together with adhesive. Egyptologists, papyrologists, and historians aim to recover and read extant text on the papyrus contained within cartonnage layers, but some methods, such as dissolving mummy casings, are destructive. The use of an advanced range of different imaging modalities was investigated to test the feasibility of non-destructive approaches applied to multi-layered papyrus found in ancient Egyptian mummy cartonnage. Eight different techniques were compared by imaging four synthetic phantoms designed to provide robust, well-understood, yet relevant sample standards using modern papyrus and replica inks. The techniques include optical (multispectral imaging with reflection and transillumination, and optical coherence tomography), X-ray (X-ray fluorescence imaging, X-ray fluorescence spectroscopy, X-ray micro computed tomography and phase contrast X-ray) and terahertz-based approaches. Optical imaging techniques were able to detect inks on all four phantoms, but were unable to significantly penetrate papyrus. X-ray-based techniques were sensitive to iron-based inks with excellent penetration but were not able to detect carbon-based inks. However, using terahertz imaging, it was possible to detect carbon-based inks with good penetration but with less sensitivity to iron-based inks. The phantoms allowed reliable and repeatable tests to be made at multiple sites on three continents. The tests demonstrated that each imaging modality needs to be optimised for this particular application: it is, in general, not sufficient to repurpose an existing device without modification. Furthermore, it is likely that no single imaging technique will to be able to robustly detect and enable the reading of text within ancient Egyptian mummy cartonnage. However, by carefully selecting, optimising and combining techniques, text contained within these fragile and rare artefacts may eventually be open to non-destructive imaging, identification, and interpretation.","authors":["Adam Gibson","Kathryn Piquette","Uwe Bergmann","William Christens-Barry"],"meta":["February 2018Heritage Science 6(1)","DOI:10.1186/s40494-018-0175-4"],"references":["318916044_Optical_coherence_tomography_and_non-linear_microscopy_for_paintings_-_A_study_of_the_complementary_capabilities_and_laser_degradation_effects","315532169_Reflectance_imaging_spectroscopy_and_synchrotron_radiation_X-ray_fluorescence_mapping_used_in_a_technical_study_of_The_Blue_Room_by_Pablo_Picasso","308000054_Corrigendum_Virtual_unrolling_and_deciphering_of_Herculaneum_papyri_by_X-ray_phase-contrast_tomography","305924620_Small_angle_X-ray_scattering_with_edge-illumination","301854694_Enhanced_X-ray-phase-contrast-tomography_brings_new_clarity_to_the_2000-year-old_'voice'_of_Epicurean_philosopher_Philodemus","289083626_Apocalypto_-_Revealing_lost_text_with_XMT","282774201_The_Value_of_Critical_Destruction_Evaluating_Multispectral_Image_Processing_Methods_for_the_Analysis_of_Primary_Historical_Texts","291685155_Conservation_of_Ancient_Papyrus_Materials","287392757_Material_characterization_of_historical_parchment_using_terahertz_time-domain_spectroscopy","277680342_Brute_force_absorption_contrast_microtomography"]}