{"id":"323449167_Inferring_Inflection_Classes_with_Description_Length","abstract":"We discuss the notion of an inflection class system, a traditional ingredient of the description of inflection systems of nontrivial complexity. We distinguish systems of microclasses, which partition a set of lexemes in classes with identical behavior, and systems of macroclasses, which group lexemes that are similar enough in a few larger classes. On the basis of the intuition that macroclasses should contribute to a concise description of the system, we propose one algorithmic method for inferring macroclasses from raw inflectional paradigms, based on minimisation of the description length of the system under a given strategy for identifying morphological alternations in paradigms. We then exhibit classifications produced by our implementation on French and European Portuguese conjugation data, and argue that they constitute an appropriate systematisation of traditional classifications. To arrive at such a concincing systematisation, it is crucial though that we use a local approach to class similarity (based on pairwise comparisons of paradigm cells) rather than a global approach (based on simultaneous comparison of all cells). We conclude that it is indeed possible to infer inflectional macroclasses objectively.","authors":["Sacha Beniamine","Olivier Bonami","Benoît Sagot"],"meta":["February 2018Journal of Language Modelling 5(3):465","DOI:10.15398/jlm.v5i3.184"],"references":["318381152_Abstractive_morphological_learning_with_a_recurrent_neural_network","312330355_Sur_la_morphologie_implicative_dans_la_conjugaison_du_portugais_une_etude_quantitative","286739410_Gender_in_Russian_An_Account_of_Gender_Specification_and_Its_Relationship_to_Declension","312330363_The_role_of_morphology_in_constraint-based_lexicalist_grammars","308767423_Joint_predictiveness_in_inflectional_paradigms","301405531_Inflection_Generation_as_Discriminative_String_Transduction","286993788_Automatic_extraction_of_morphological_lexicons_from_morphologically_annotated_corpora","286993511_Semi-supervised_learning_of_morphological_paradigms_and_lexicons","281301102_De_formes_en_themes","277326619_Implicative_structure_and_joint_predictiveness"]}