{"id":"323410110_Convolutional_Neural_Networks_combined_with_Runge-Kutta_Methods","abstract":"A convolutional neural network for image classification can be constructed following some mathematical ways since it models the ventral stream in visual cortex which is regarded as a multi-period dynamical system. In this paper, a new point of view is proposed for constructing network models as well as providing a direction to get inspiration or explanation for neural network. If each period in ventral stream was deemed to be a dynamical system with time as the independent variable, there should be a set of ordinary differential equations (ODEs) for this system. Runge-Kutta methods are common means to solve ODE. Thus, network model ought to be built using these methods. Moreover, convolutional networks could be employed to emulate the increments within every time-step. The model constructed in the above way is named Runge-Kutta Convolutional Neural Network (RKNet). According to this idea, Dense Convolutional Networks (DenseNets) and Residual Networks (ResNets) were varied to RKNets. To prove the feasibility of RKNets, these variants were verified on benchmark datasets, CIFAR and ImageNet. The experimental results show that the RKNets transformed from DenseNets gained similar or even higher parameter efficiency. The success of the experiments denotes that Runge-Kutta methods can be utilized to construct convolutional neural networks for image classification efficiently. Furthermore, the network models might be structured more rationally in the future basing on RKNet and priori knowledge.","authors":["Mai Zhu","Chong Fu"],"meta":["February 2018"],"references":["318652675_Memory-Efficient_Implementation_of_DenseNets","306885833_Densely_Connected_Convolutional_Networks","305196650_Going_deeper_with_convolutions","301876854_Bridging_the_Gaps_Between_Residual_Learning_Recurrent_Neural_Networks_and_Visual_Cortex","265295439_ImageNet_Large_Scale_Visual_Recognition_Challenge","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","312532641_Theoretical_Neuroscience","311609041_Deep_Residual_Learning_for_Image_Recognition","308846031_Recurrent_convolutional_neural_network_for_object_recognition","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","265748773_Learning_Multiple_Layers_of_Features_from_Tiny_Images","263002356_Microsoft_COCO_Common_Objects_in_Context","21780665_Separate_Visual_Pathways_for_Perception_and_Action","3302431_Runge-Kutta_neural_network_for_identification_of_dynamical_systems_in_high_accuracy"]}