{"id":"323439412_The_Effect_of_Tax_System_on_Shareholder_Decisions_when_Choosing_a_Accounting_Principles","abstract":"This paper aims to identify the factors that affect the decisions of the tax system to choose the accounting principles in Iraqi companies. The focus is on managing perceptions of the impact of the tax system on cost and the views of stakeholders in accounting principles. In a Real data, we pick Final budgets end of the year data of the 2 most important companies in Iraq, and the statement of their views on the impact of the figures reported by stakeholders in the companies and how to track companies specific targets linked to profit. According to the participants in the real data accounting figures and the impact of corporate perceptions of stakeholders and selection of accounting principles, tracking corporate goals for profit is not consistent with the objective of minimizing the tax system for companies. Despite taking some measures to reduce response bias, one cannot rule out the possibility of introducing some bias in the responses. It will provide more empirical investigations based on annual reports for more information on evidence of factors that affect the reporting policies of the companies. This study helps researchers to determine the tax systems that determine the accounting principles for companies operating in countries with similar environment to those in Iraq. In addition, the results of this study can facilitate professionals who are doing an international financial analysis. The results of this study can contribute to explain the contributions of Iraqi company's decisions. Given that the Iraqi tax system is similar to that prevailing in many neighboring Gulf countries, the Gulf States; this study can provide an insight into the factors affecting the financial reporting of companies operating in these countries.","authors":["Hisham Noori"],"meta":["February 2018Journal of Reviews on Global Economics 7:21-27","DOI:10.6000/1929-7092.2018.07.03"],"references":[]}