{"id":"323465986_Leveraging_the_Big_Data_Produced_by_the_Network_to_Take_Intelligent_Decisions_on_Flow_Management","abstract":"Software Defined Network (SDN) offers very advantageous feature of programming the network at runtime by decoupling the control plane from data plane to have centralized and better forwarding decisions. To attain the maximum throughput and relatively less latency within a large network, we have captured the real time big data produced by the network. Big data is revolutionizing the modern computer science world to analyze the extremely large datasets to predict future requirements. Therefore, it would be useful to embed intelligence in the systems. With the power of SDN, we programmed our network at run time using Ryu controller to dump the network traffic and engineer it accordingly. We proposed a methodology for taking intelligent decisions with traffic engineering in SDN. Results have shown that SDN leverages the big data to decrease the latency time by adding programs in the controller of SDN. An algorithm is presented to maximize the bandwidth utilization to possess higher throughput after shaping the traffic. It is found through the results that our proposed methodology of applying intelligence on traffic management in SDN outperforms those without intelligence decision making.","authors":["Shafaan Khaliq","Muhammad Ikram Lali","Basit Shahzad","Farooq Javed"],"meta":["February 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2808358","Project: Social Impact of Computing"],"references":["262805723_Software-Defined_Networking_A_Comprehensive_Survey","262240269_Performance_Analysis_of_Software-Defined_Networking_SDN","318532605_Traffic_Engineering_in_Hybrid_SDN_Networks_with_Multiple_Traffic_Matrices","317617290_The_role_of_big_data_analytics_in_Internet_of_Things","313539539_A_Holistic_SDN-Capable_Session-Plane_Tailored_for_Efficient_IoMT_Smart_Surveillance_Applications","309056746_Networking_for_Big_Data_A_Survey","286746200_An_SDN-Based_Approach_for_Load_Balance_in_Heterogeneous_Radio_Access_Networks","273706796_A_Survey_on_Software-Defined_Networking","271553937_SoDA_Dynamic_visual_analytics_of_big_social_data","271471922_A_performance_study_of_network_migration_to_SDN-enabled_Traffic_Engineering"]}