{"id":"323464206_Putting_Flipped_Classroom_into_Practice_A_Comprehensive_Review_of_Empirical_Research","abstract":"Recent technical and infrastructural developments posit flipped (or inverted) classroom approaches ripe for exploration at all levels of formal education. Flipped classroom approaches have students use technology to access lectures and other instructional-oriented resources outside the classroom, in order to engage them in active learning during in-class time. Scholars and educators have reported a variety of outcomes of a flipped approach to teaching and learning; however, the lack of a summary from these empirical studies prevents stakeholders from having a clear view of the benefits and challenges of this teaching strategy. The purpose of this chapter is to provide a review of the flipped classroom approach in order to summarize the findings and guide future studies. Thirty-seven peer-reviewed articles were collected from a systematic literature search and analyzed based on a categorization of their main elements. The results of this survey show the direction of flipped classroom research during recent years and the most common technologies, subject domains, evaluation methods, and pedagogical designs; in addition, our study summarizes the benefits and challenges of adopting a flipped approach in the classroom. Suggestions for future research include: describing in detail the flipped approach, performing controlled experiments, and triangulating data from diverse sources. These future research efforts will allow us to better indicate which aspects and ingredients of a flipped classroom work better and under which circumstances and student groups. The findings will ultimately allow us to form best practices and a unified framework for guiding/assisting educators who want to adopt this teaching style.","authors":["Michail Giannakos","John Krogstie","Demetrios Sampson"],"meta":["March 2018","DOI:10.1007/978-3-319-73417-0_2","In book: Digital Technologies: Sustainable Innovations for Improving Teaching and Learning (pp.27-44)"],"references":["308724773_Implementing_Teaching_Model_Templates_for_Supporting_Flipped_Classroom-Enhanced_STEM_Education_in_Moodle","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","285935974_The_flipped_classroom_A_survey_of_the_research","345929198_Implementing_An_Inverted_Classroom_Model_In_Engineering_Statics_Initial_Results","344538008_The_Flipped_Classroom_A_Survey_of_the_Research","308837433_Do_students_like_the_flipped_classroom_An_investigation_of_student_reaction_to_a_flipped_undergraduate_IT_course","306150855_Writing_wasn't_really_stressed_accurate_historical_analysis_was_stressed_Student_Perceptions_of_In-Class_Writing_in_the_Inverted_General_Education_University_History_Survey_Course","303101301_The_flipped_classroom_in_world_history","288347639_Flipping_the_college_spreadsheet_skills_classroom_Initial_empirical_results","285521835_Flipping_the_Classroom_Applications_to_Curriculum_Redesign_for_an_Introduction_to_Management_Course_Impact_on_Grades"]}