{"id":"323528034_Deep_learning_for_biomarker_regression_application_to_osteoporosis_and_emphysema_on_chest_CT_scans","abstract":"Introduction: \nBiomarker computation using deep-learning often relies on a two-step process, where the deep learning algorithm segments the region of interest and then the biomarker is measured. We propose an alternative paradigm, where the biomarker is estimated directly using a regression network. We showcase this image-to-biomarker paradigm using two biomarkers: the estimation of bone mineral density (BMD) and the estimation of lung percentage of emphysema from CT scans.\n\nMaterials and methods: \nWe use a large database of 9,925 CT scans to train, validate and test the network for which reference standard BMD and percentage emphysema have been already computed. First, the 3D dataset is reduced to a set of canonical 2D slices where the organ of interest is visible (either spine for BMD or lungs for emphysema). This data reduction is performed using an automatic object detector. Second, The regression neural network is composed of three convolutional layers, followed by a fully connected and an output layer. The network is optimized using a momentum optimizer with an exponential decay rate, using the root mean squared error as cost function.\n\nResults: \nThe Pearson correlation coefficients obtained against the reference standards are r = 0.940 (p < 0.00001) and r = 0.976 (p < 0.00001) for BMD and percentage emphysema respectively.\n\nConclusions: \nThe deep-learning regression architecture can learn biomarkers from images directly, without indicating the structures of interest. This approach simplifies the development of biomarker extraction algorithms. The proposed data reduction based on object detectors conveys enough information to compute the biomarkers of interest.","authors":["Germán González","George R. Washko","Raúl San José Estépar"],"meta":["March 2018Proceedings of SPIE - The International Society for Optical Engineering 10574:52","DOI:10.1117/12.2293455","Conference: Image Processing"],"references":["301839500_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","296624579_Pulmonary_Nodule_Detection_in_CT_Images_False_Positive_Reduction_Using_Multi-View_Convolutional_Networks","319770252_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","319636187_Disease_Staging_and_Prognosis_in_Smokers_Using_Deep_Learning_in_Chest_Computed_Tomography","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","311164170_Development_and_Validation_of_a_Deep_Learning_Algorithm_for_Detection_of_Diabetic_Retinopathy_in_Retinal_Fundus_Photographs","304665349_Automated_Agatston_score_computation_in_a_large_dataset_of_non_ECG-gated_chest_computed_tomography","301762556_Automatic_coronary_artery_calcium_scoring_in_cardiac_CT_angiography_using_paired_convolutional_neural_networks","297608770_Brain_Tumor_Segmentation_Using_Convolutional_Neural_Networks_in_MRI_Images","293014405_Locality_Sensitive_Deep_Learning_for_Detection_and_Classification_of_Nuclei_in_Routine_Colon_Cancer_Histology_Images"]}