{"id":"323511629_Student_Attendance_Management_System","abstract":"Attendance management is important to every single organization; it can decide whether or not an organization such as educational institutions, public or private sectors will be successful in the future. Organizations will have to keep a track of people within the organization such as employees and students to maximize their performance. Managing student attendance during lecture periods has become a difficult challenge. The ability to compute the attendance percentage becomes a major task as manual computation produces errors, and wastes a lot of time. For the stated reason, an efficient Web-based application for attendance management system is designed to track student's activity in the class. This application takes attendance electronically and the records of the attendance are storing in a database. The system design using the Model, View, and Controller (MVC) architecture, and implemented using the power of Laravel Framework. JavaScript is adding to the application to improve the use of the system. MySQL used for the Application Database. The system designed in a way that can differentiate the hours of theoretical and practical lessons since the rate of them is different for calculating the percentages of the students' absence. Insertions, deletions, and changes of data in the system can do straightforward via the designed GUI without interacting with the tables. Different presentation of information is obtainable from the system. The test case of the system exposed that the system is working enormously and is ready to use to manage to attend students for any department of the University. INTRODUCTION Due to student's interest in classrooms, and whose is the largest union in the study environment of university or institution, so recording absence at a department having a large number of students in a classroom is a difficult task and time-consuming. Moreover, the process takes much time, and many efforts are spent by the staff of the department to complete the attendance rates for each student. So in many institutions and academic organizations, attendance is a very important criterion which is used for various purposes. These purposes include record keeping, assessment of students, and promotion of optimal and consistent attendance in class. As long as in many developing countries, a minimum percentage of class attendance is required in most institutions and this policy has not been adhered to, because of the various challenges the present method of taking attendance presents. The process of recording attendances for students was in the form of hardcopy papers and the system was manually done. Besides wasting time and taking efforts for preparing sheets and documents, other disadvantages may be visible to the traditional one due to loss or damage to the sheets-sheet could be stolen.","authors":["Karwan Jacksi","Falah Hasan Mohammed","Shahab Zebari"],"meta":["February 2018International Journal of Engineering and Technology 6(2):49-53","DOI:10.21276/sjet.2018.6.2.1","Projects: Student Attendance Management SystemStudent Attendance Management System"],"references":["325819350_Computer_Science_and_Management_Studies_Development_of_a_Student_Attendance_Management_System_Using_RFID_and_Face_Recognition_A_Review","281029040_Design_And_Implementation_Of_Online_Submission_and_Peer_Review_System_A_Case_Study_Of_E-Journal_Of_University_Of_Zakho","274539665_General_method_for_data_indexing_using_clustering_methods","260434261_TouchIn_An_NFC_Supported_Attendance_System_in_a_University_Environment","235598499_RFID-Based_Students_Attendance_Management_System","308831938_A_web_enabled_secured_system_for_attendance_monitoring_and_real_time_location_tracking_using_Biometric_and_Radio_Frequency_Identification_RFID_technology","284735074_LAS_Web-based_laboratory_attendance_system_by_integrating_RFID-ARDUINO_technology","261457429_Web-based_student_attendance_system_using_RFID_technology","261263604_Student_attendance_monitoring_at_the_university_using_NFC"]}