{"id":"323550800_Passion_Cooperation_and_JavaScript_This_is_what_the_industry_is_looking_for_in_a_recently_graduated_computer_programmer","abstract":"For institutions offering a degree in information technology (IT), knowledge about what the IT industry needs from their employees is valuable. In this study we talk to people interested in hiring computer programming graduates. Through semi-structured interviews with representatives from 10 companies we investigate what the companies are looking for in a recently graduated computer programmer. Our findings suggest that an inner drive and interest in the computer programming field is the most important quality. If a person has a genuine interest in the field, the person will most likely learn what is needed to excel at their job. Further, the candidate should be a good match for the team, as well as the company culture. Most interviewees do not focus on which exact languages or technologies the candidates know. If a candidate fit the other criteria they are assumed to be able to learn the required technologies quickly. However when asking directly, we find a clear trend: All companies want JavaScript competence. This insight can guide educators in multiple ways. First of all we can always improve focus on team work and cooperation. Further, we may be able to to nurture the intrinsic motivation of our students. Lastly, the JavaScript ecosystem is ripe for a more prominent place on our curricula.","authors":["Per Lauvås","Kjetil Raaen"],"meta":["November 2017","Conference: NIKTAt: Oslo"],"references":["266456393_What_is_Employability","258199021_The_Concept_of_Employability","234769209_Gaps_in_the_computer_science_curriculum_An_exploratory_study_of_industry_professionals","228916748_An_examination_of_employers'_perceptions_and_expectations_of_IS_entry-level_personal_and_interpersonal_skills","220795015_Defining_the_expectation_gap_A_comparison_of_industry_needs_and_existing_game_development_curriculum","314531685_Perception_Gaps_about_Skills_Requirement_for_Entry-Level_IS_Professionals_between_Recruiters_and_Students","242935743_Researching_Information_Systems_and_Computing","220121682_Perception_Gaps_about_Skills_Requirement_for_Entry-Level_IS_Professionals_between_Recruiters_and_Students_An_Exploratory_Study"]}