{"id":"323583621_Assessing_the_influence_of_knowledge_translation_platforms_on_health_system_policy_processes_to_achieve_the_health_millennium_development_goals_in_Cameroon_and_Uganda_A_comparative_case_study","abstract":"There is a scarcity of empirical data on the influence of initiatives supporting evidence-informed health system policy-making (EIHSP), such as the knowledge translation platforms (KTPs) operating in Africa. To assess whether and how two KTPs housed in government-affiliated institutions in Cameroon and Uganda have influenced: (1) health system policy-making processes and decisions aiming at supporting achievement of the health millennium development goals (MDGs); and (2) the general climate for EIHSP. We conducted an embedded comparative case study of four policy processes in which Evidence Informed Policy Network (EVIPNet) Cameroon and Regional East African Community Health Policy Initiative (REACH-PI) Uganda were involved between 2009 and 2011. We combined a documentary review and semi structured interviews of 54 stakeholders. A framework-guided thematic analysis, inspired by scholarship in health policy analysis and knowledge utilization was used. EVIPNet Cameroon and REACH-PI Uganda have had direct influence on health system policy decisions. The coproduction of evidence briefs combined with tacit knowledge gathered during inclusive evidence-informed stakeholder dialogues helped to reframe health system problems, unveil sources of conflicts, open grounds for consensus and align viable and affordable options for achieving the health MDGs thus leading to decisions. New policy issue networks have emerged. The KTPs indirectly influenced health policy processes by changing how interests interact with one another and by introducing safe-harbour deliberations and intersected with contextual ideational factors by improving access to policy-relevant evidence. KTPs were perceived as change agents with positive impact on the understanding, acceptance and adoption of EIHSP because of their complementary work in relation to capacity building, rapid evidence syntheses and clearinghouse of policy-relevant evidence. This embedded case study illustrates how two KTPs influenced policy decisions through pathways involving policy issue networks, interest groups interaction and evidence-supported ideas and how they influenced the general climate for EIHSP.","authors":["Pierre Ongolo-Zogo","John N. Lavis","Goran Tomson","Nelson Sewankambo"],"meta":["February 2018Health Policy and Planning 33(4)","DOI:10.1093/heapol/czx194"],"references":["320974801_A_collaboratively-derived_science-policy_research_agenda","313711148_The_'good_governance'_of_evidence_in_health_policy","282291754_Debate_The_'good_governance'_of_evidence_in_health_policy","275511720_Ideas_Politics_and_Public_Policy","275083070_Health_in_the_sustainable_development_goals_Ready_for_a_paradigm_shift","272082959_Enabling_Dynamic_Partnerships_through_Joint_Degrees_between_Low-_and_High-Income_Countries_for_Capacity_Development_in_Global_Health_Research_Experience_from_the_Karolinska_InstitutetMakerere_Universi","317452842_Funding_agencies_in_low-_and_middle-income_countries_support_for_knowledge_translation","313140637_A_systematic_review_of_barriers_to_and_facilitators_of_the_use_of_evidence_by_policymakers","284653793_Learning_from_abroad_the_role_of_policy_transfer'","283937120_An_advocacy_coalition_framework_of_policy_change_and_the_role_of_policy_learning_therein"]}