{"id":"323564141_Carrier_Based_Stair_Edge_PWM_SEPWM_for_Capacitor_Balancing_In_Multilevel_Converters_with_Floating_Capacitors","abstract":"Multilevel converters with floating capacitors (FCs) are widely applied in recent years in a wide range of industrial applications from high voltage direct current (HVDC) systems to high power drives. However, some FC topologies lack complete FC voltage balancing capability due to the inherent topology limitation or the insufficient switching state for capacitor balancing. This will result in large ripples on capacitors at low frequency (such as fundamental frequency), limiting their performance and application, particularly when the fundamental frequency is very low in low-speed drive operations. Typical examples of those multilevel converters are Modular Multilevel Converters (MMC), Nested Neutral-Point-Clamped (NNPC) converter, etc. In order to improve the floating capacitor balancing for this kind of multilevel converters, this paper proposes a carrier based PWM method, named Stair Edge PWM method. This method can obtain sufficient redundant switching states for FC voltage balancing by producing multiple levels in one PWM period. The FC voltage balancing is thus achieved at switching frequency, which can greatly reduce the capacitor voltage ripple and therefore enable the use of much smaller floating capacitors. Meanwhile, the voltage stress on each device and low dv/dt feature are still the same as the normal multilevel operation, reserving two of the most salient features of multilevel converters. The proposed method also features much simpler and easier implementation compared to space vector based approaches, particularly when high-level converters are considered. An application example using a four-level NNPC converter is provided in this paper. The effectiveness and performance of the proposed method are verified by both simulation and experiment.","authors":["Hao Tian","Yunwei Ryan Li"],"meta":["March 2018IEEE Transactions on Industry Applications 54(4):3440 - 3452","DOI:10.1109/TIA.2018.2812142","Projects: Electric DrivesMultilevel Converter: Topologies, PWM and Control"],"references":["301317054_Quasi_Two-Level_PWM_Operation_of_an_MMC_Phase_Leg_with_Reduced_Module_Capacitance","261774097_Circuit_Topologies_Modeling_Control_Schemes_and_Applications_of_Modular_Multilevel_Converters","317072073_Carrier_based_three-level_PWM_for_improving_flying_capacitor_balancing_of_Nested_Neutral-Point-Clamped_NNPC_converter","305218279_A_Space_Virtual-Vector_Modulation_SVVM_with_Voltage_Balance_Control_VBC_for_Nested_Neutral-Point_Clamped_NNPC_Converter_Under_Low_Output_Frequency_Conditions","303513961_Low-frequency_voltage_ripples_in_the_flying_capacitors_of_the_nested_neutral-point-clamped_converter","279155981_A_Capacitor_Voltage_Balancing_Method_for_Nested_Neutral_Point_Clamped_NNPC_Inverter","270793306_A_Novel_and_Simple_Single-phase_Modulator_for_the_Nested_Neutral_Point_Clamped_NNPC_Converter","264743944_A_New_Nested_Neutral_Point-Clamped_NNPC_Converter_for_Medium-Voltage_MV_Power_Conversion","252062960_A_Simulation_Method_to_Predict_the_Turn-to-turn_Voltage_Spikes_in_a_PWM_Fed_Motor_Winding","241159325_Selective_harmonic_elimination_PWM_applied_to_H-bridge_topology_in_high_speed_applications"]}