{"id":"323500923_Financial_risk_information_avoidance","abstract":"Availability of information is one of the most important factors for financial decision-makers. Having complete information about the probability of losing money should always leave decision-makers better off. However, in some situations financial decision-makers prefer to know less than more. In this study we investigated the impact of selected characteristics of financial threats on individuals’ decisions to avoid risk information in an incentivised online experiment. We found that threat severity, relative risk, and effectiveness of threat prevention alone do not influence decisions to avoid risk information. However, we did find an interaction effect between the first two treatments. Furthermore, our data suggest that coping style, locus of control, and anticipated emotional response are statistically significant predictors of financial risk information avoidance.","authors":["Anna Blajer-Gołębiewska","Dagmara Wach","Maciej Kos"],"meta":["January 2018Ekonomska Istraživanja / Economic Research 31(1):521-536","DOI:10.1080/1331677X.2018.1439396","Project: Risk information avoidance - theoretical groundwork and research framework development with a special focus on genetic health risk information / Unikanie informacji o ryzyku - podstawy teoretyczne oraz rozwój metod badawczych..."],"references":["314650897_Information_Avoidance","291303826_A_Model_of_Defensive_Information_Avoidance_in_Information_Systems_Use","289830113_A_medical_risk_attitude_subscale_for_DOSPERT","286382855_DOSPERTM_A_survey_of_medical_risk_attitudes_in_the_United_States","283791173_Compatibility_of_market_risk_measures","313658140_Generalized_Expectancies_for_Internal_versus_External_Control_of_Reinforcement","313154022_A_Conceptual_Model_of_Information_Seeking","309822898_Logistic_Regression_Why_We_Cannot_Do_What_We_Think_We_Can_Do_and_What_We_Can_Do_About_It","309104843_Financial_Attention","298614319_Risk_Management_of_Healthcare_organizations"]}