{"id":"323529516_Visualizing_the_Academic_Discipline_of_Knowledge_Management","abstract":"The aim of this paper was to evaluate the research status of knowledge management (KM) and identify the characteristics of KM in the literature. We selected and studied in detail 7628 original research articles from the Web of Science from 1974 to 2017. Although many studies have contributed to the evolution of the KM domain, our results showed that a comprehensive bibliometric and visualization investigation was required. The literature on KM has grown rapidly since the 1970s. The United States of America, as the original contributing country, has also internationally collaborated the most in this field of study. The National Cheng Kung University has made the highest number of contributions. The majority of authors contributed a small number of publications. Additionally, the most common category in KM research was management. The main publications for KM research include Journal of Knowledge Management, and Knowledge Management Research & Practice. A keywords analysis determined that \"knowledge sharing\", \"innovation\", \"ontology\", and \"knowledge management\" were consistent hotspots in knowledge management research. Through a document co-citation analysis, the intellectual structures of knowledge management were defined, and four emerging trends were identified that focus on new phenomenon, the practice of knowledge management, small and medium enterprises (SMEs) management based on knowledge perspective, innovation and performance, and big data-enabled KM. We also provide eight research questions for future studies. Our results will benefit academics, researchers, and research students who want to rapidly obtain an overview of knowledge management research. This study can also be a starting point for communication between academics and practitioners.","authors":["Peng Wang","Fang-Wei Zhu","Hao-Yang Song","Jian-Hua Hou"],"meta":["March 2018Sustainability 10(3):682","DOI:10.3390/su10030682"],"references":["314198523_Knowledge_Management_in_Startups_Systematic_Literature_Review_and_Future_Research_Agenda","309956300_Using_knowledge_management_systems_A_taxonomy_of_SME_strategies","301865836_Network_Structure_Self-Organization_and_the_Growth_of_International_Collaboration_in_Science","319190286_Aligning_Enterprise_Knowledge_and_Knowledge_Management_Systems_to_Improve_Efficiency_and_Effectiveness_Performance_A_Three-dimensional_Fuzzy-based_Decision_Support_System","316024020_Knowledge_management_systems_the_hallmark_of_SMEs","315361612_Different_knowledge_different_benefits_Toward_a_productivity_perspective_on_knowledge_sharing_in_organizations","313082025_Knowledge_management_and_knowledge_management_systems_conceptual_foundations_and_research_issues","308092291_A_Systematic_Review_of_Supply_Chain_Knowledge_Management_Research_State_of_the_Art_and_Research_Opportunities","301675439_Journal_of_Strategic_Management_Studies","300000380_Major_trends_in_knowledge_management_research_a_bibliometric_study"]}