{"id":"323525000_Knowledge_Representation_by_Concept_Mining_Fuzzy_Relation_from_Unstructured_Data","abstract":"Concept hierarchies or Taxonomies are crucial for any knowledge representation system. It's important because it allow formulating rules in an abstract and concise way and thus facilitating the development, refinement and reuse of knowledge. Making the knowledge implicitly contained in the texts explicitly is a great challenge. Knowledge can be found in texts at different levels of explicitness depending on the sort of text considered. However, it is also well known that any knowledge-based system suffers from the so-called knowledge acquisition bottleneck. In order to partially overcome this problem we present a novel approach to automatically learning a concept hierarchy from a text corpus. We focus on learning composite concepts and building up a knowledge base from existing documents. We have then proposed our design for extracting concepts from the unstructured document, although it can be generalized for html, pdf, ppt and so on, but accuracy of the algorithm can be checked at few documents only. From the extracted concept, we have calculated the fuzzy distance among concepts. Then we have some rules on the basis of experimental results.","authors":["Rafeeq Ahmed","Nesar Ahmad"],"meta":["September 2012"],"references":["240448257_Illustrating_an_ideal_adaptive_e-learning_A_conceptual_framework","237428399_Current_Research_on_IMS_Learning_Design","228639039_Graphical_ontology_modeling_language_for_learning_environments","228598275_Knowledge_Representation_and_Reasoning_in_Personalized_Web-Based_e-Learning_Applications","228328457_Intelligent_learning_environments_for_programming_The_case_for_integration_and_adaptation","224686820_Towards_Context-Sensitive_Domain_Ontology_Extraction","254573059_E-Learning_-_A_Guidebook_of_Principles_Procedures_and_Practices","243772982_Connecting_learning_objects_to_instructional_design_theory_A_definition","224320592_Toward_a_Fuzzy_Domain_Ontology_Extraction_Method_for_Adaptive_e-Learning","222937513_What_drives_a_successful_e-Learning_An_empirical_investigation_of_the_critical_factors_influencing_learner_satisfaction"]}