{"id":"323573098_Scheduling_in_production_supply_chain_and_Industry_40_systems_by_optimal_control","abstract":"This paper presents a survey on the applications of optimal control to scheduling in production, supply chain and Industry 4.0 systems with a focus on the deterministic maximum principle. The first objective is to derive major contributions, application areas, limitations, as well as research and application recommendations for the future research.\nThe second objective is to explain control engineering models in terms of industrial engineering and production management.\nTo achieve these objectives, optimal control models, qualitative methods of performance analysis and computational methods for optimal control are considered. We provide a brief historic overview and clarify major mathematical fundamentals whereby the control engineering terms are brought into correspondence with industrial engineering and management. The survey allows the grouping of models with only terminal constraints with application to master production scheduling, models with hybrid terminal–logical constraints with applications to short term job and flow shop scheduling, and hybrid structural–terminal–logical constraints with applications to customised assembly systems such as Industry 4.0. Computational algorithms in state, control and adjoint variable spaces are discussed.","authors":["Dmitry Ivanov","Alexandre Dolgui","Suresh Sethi","Boris vladimirovich Sokolov"],"meta":["March 2018International Journal of Production Research","Projects: Inventory ManagementSupply Chain ManagementDynamic scheduling in Industry 4.0 and digital supply chain systems"],"references":["320492005_Ripple_effect_in_the_supply_chain_an_analysis_and_recent_literature","306283907_A_multiphase_optimal_control_method_for_multi-train_control_and_scheduling_on_railway_lines","292342553_Robust_dynamic_schedule_coordination_control_in_the_supply_chain","291353897_Schedule_robustness_analysis_with_the_help_of_attainable_sets_in_continuous_flow_problem_under_capacity_disruptions","288081046_Adaptive_Supply_Chain_Management","321568632_Optimal_Control_Theory_Applications_to_Management_Science_and_Economics","320903701_The_future_of_manufacturing_systems_engineering","317773241_Optimal_Feedback_Production_Planning_in_a_Stochastic_N-Machine_Flowshop","316692867_Mathematical_Theory_of_Control_Systems_Design","314156034_The_Mathematical_Theory_of_Optimal_Processes"]}