{"id":"323572885_A_Novel_Technique_Based_on_Visual_Words_Fusion_Analysis_of_Sparse_Features_for_Effective_Content-Based_Image_Retrieval","abstract":"Content-based image retrieval (CBIR) is a mechanism that is used to retrieve similar images from an image collection. In this paper, an effective novel technique is introduced to improve the performance of CBIR on the basis of visual words fusion of scale-invariant feature transform (SIFT) and local intensity order pattern (LIOP) descriptors. SIFT performs better on scale changes and on invariant rotations. However, SIFT does not perform better in the case of low contrast and illumination changes within an image, while LIOP performs better in such circumstances. SIFT performs better even at large rotation and scale changes, while LIOP does not perform well in such circumstances. Moreover, SIFT features are invariant to slight distortion as compared to LIOP. The proposed technique is based on the visual words fusion of SIFT and LIOP descriptors which overcomes the aforementioned issues and significantly improves the performance of CBIR. The experimental results of the proposed technique are compared with another proposed novel features fusion technique based on SIFT-LIOP descriptors as well as with the state-of-the-art CBIR techniques. The qualitative and quantitative analysis carried out on three image collections, namely, Corel-A, Corel-B, and Caltech-256, demonstrate the robustness of the proposed technique based on visual words fusion as compared to features fusion and the state-of-the-art CBIR techniques.","authors":["Muhammad Yousuf Irfan Zia","Zahid Mehmood","Hafiz Adnan Habib","Toqeer Mahmood"],"meta":["March 2018Mathematical Problems in Engineering 2018(1):13","DOI:10.1155/2018/2134395","Project: Forensic Analysis, Machine Learning, and Information Retrieval (FAMLIR) Research Group"],"references":["322462855_Content-Based_Image_Retrieval_Based_on_Visual_Words_Fusion_Versus_Features_Fusion_of_Local_and_Global_Features","319464495_A_novel_image_retrieval_based_on_rectangular_spatial_histograms_of_visual_words","318494514_An_efficient_forensic_technique_for_exposing_region_duplication_forgery_in_digital_images","316522425_Content-based_image_retrieval_and_semantic_automatic_image_annotation_based_on_the_weighted_average_of_triangular_histograms_using_support_vector_machine","313541807_Forensic_analysis_of_copy-move_forgery_in_digital_images_using_the_stationary_wavelets","306005153_A_Novel_Image_Retrieval_Based_on_a_Combination_of_Local_and_Global_Histograms_of_Visual_Words","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","318723466_Copy-move_forgery_detection_through_stationary_wavelets_and_local_binary_pattern_variance_for_forensic_analysis_in_digital_images","310403387_A_K-means_clustering_algorithm","305313210_A_Privacy-Preserving_and_Copy-Deterrence_Content-Based_Image_Retrieval_Scheme_in_Cloud_Computing"]}