{"id":"323590487_Infusing_an_HtDP-based_CS1_with_distributed_programming_using_functional_video_games","abstract":"A Computer Science introduction course ought to focus on exciting students about the subject matter and on problem solving through the methodical design of programs. An effective way to achieve both is through the development of functional video games. As most students are interested in video games, their development adds an exciting domain to any introduction to programming. This article advocates that an exciting crowning achievement for students in such a course is the design and implementation of a multiplayer distributed video game. By exploiting a domain that is popular with students, they are taught about design principles, communication protocols, and pitfalls in distributed programming. This article puts forth a successfully used design recipe that places distributed programming well within the reach of beginning students and outlines the use of this design recipe in the classroom. For those teaching beginners, this article presents a model for developing their own distributed programming module. The success of the presented methodology is measured through student feedback on their distributed programming experience. The empirical results suggest that the design and implementation of distributed functional video games is effective and well-received by students. Furthermore, the data suggests that the presented methodology fails to exhibit the gender gap common in Computer Science and is effective regardless of the programming experience CS1 students bring to the classroom.","authors":["Marco T. Morazán"],"meta":["March 2018Journal of Functional Programming 28","DOI:10.1017/S0956796818000059"],"references":["254264382_Teacher_Leadership_and_Intellectual_Stimulation_Improving_Students'_Approaches_to_Studying_through_Intrinsic_Motivation","311475027_A_functional_IO_system_or_fun_for_freshman_kids","311472429_Problem_solving_in_community_a_necessary_shift_in_cs_pedagogy","300918155_Teaching_Algebra_and_Computing_through_Bootstrap_and_Program_by_Design_Abstract_Only","299670644_Functional_Video_Games_in_CS1_II","281396646_Generative_and_accumulative_recursion_made_fun_for_beginners","261278708_Patterns_and_Exemplars_Compelling_Strategies_for_Teaching_Parallel_and_Distributed_Computing_to_CS_Undergraduates","261278707_Integrating_Parallel_and_Distributed_Computing_Topics_into_an_Undergraduate_CS_Curriculum","246393956_How_to_Design_Programs_An_Introduction_to_Computing_and_Programming","244304143_Operating_System_Concepts_with_Java"]}