{"id":"323535753_LICCA_A_tool_for_cross-language_clone_detection","abstract":"Code clones mostly have been proven harmful for the development and maintenance of software systems, leading to code deterioration and an increase in bugs as the system evolves. Modern software systems are composed of several components, incorporating multiple technologies in their development. In such systems, it is common to replicate (parts of) functionality across the different components, potentially in a different programming language. Effect of these duplicates is more acute, as their identification becomes more challenging. This paper presents LICCA, a tool for the identification of duplicate code fragments across multiple languages. LICCA is integrated with the SSQSA platform and relies on its high-level representation of code in which it is possible to extract syntactic and semantic characteristics of code fragments positing full cross-language clone detection. LICCA is on a technology development level. We demonstrate its potential by adopting a set of cloning scenarios, extended and rewritten in five characteristic languages: Java, C, JavaScript, Modula-2 and Scheme.","authors":["Tijana Vislavski","Gordana Rakić","Nicolás Cardozo","Zoran Budimac"],"meta":["March 2018","DOI:10.1109/SANER.2018.8330250","Conference: 25th IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER 2018)At: Campobasso, Italy","Project: SSQSA: Set of Software Quality Static Analysers"],"references":["313236091_CLCMiner_Detecting_Cross-Language_Clones_without_Intermediates","307965258_Towards_the_Code_Clone_Analysis_in_Heterogeneous_Software_Products","293637657_Raters'_reliability_in_clone_benchmarks_construction","289632926_Evaluating_Modern_Clone_Detection_Tools","282431515_Duplicate_Code_Detection_using_Control_Statements","275772216_Performance_Evaluation_of_Clone_Detection_Tools","314875758_Model-Driven_Software_Migration_A_Methodology","308729490_LLVM-based_code_clone_detection_framework","301444753_Reusability_based_program_clone_detection_case_study_on_large_scale_healthcare_software_system","298801730_A_Survey_of_Software_Clone_Detection_Techniques"]}