{"id":"323524855_The_Sequent_Calculus_Trainer_with_Automated_Reasoning_-_Helping_Students_to_Find_Proofs","abstract":"The sequent calculus is a formalism for proving validity of statements formulated in First-Order Logic. It is routinely used in computer science modules on mathematical logic. Formal proofs in the sequent calculus are finite trees obtained by successively applying proof rules to formulas, thus simplifying them step-by-step.\n\nStudents often struggle with the mathematical formalities and the level of abstraction that topics like formal logic and formal proofs involve. The difficulties can be categorised as syntactic or semantic. On the syntactic level, students need to understand what a correctly formed proof is, how rules can be applied (on paper for instance) without leaving the mathematical framework of the sequent calculus, and so on. Beyond this, on the semantic level, students need to acquire strategies that let them find the right proof.\n\nThe Sequent Calculus Trainer is a tool that is designed to aid students in learning the techniques of proving given statements formally. In this paper we describe the didactical motivation behind the tool and the techniques used to address issues on the syntactic as well as on the semantic level.","authors":["Arno Ehle","Norbert Hundeshagen","Martin Lange"],"meta":["March 2018","DOI:10.4204/EPTCS.267.2"],"references":["225142568_Z3_an_efficient_SMT_solver","220987572_Panda_A_Proof_Assistant_in_Natural_Deduction_for_All_A_Gentzen_Style_Proof_Assistant_for_Undergraduate_Students","300576499_Yices_22","286591575_A_tour_of_CVC4_How_it_works_and_how_to_use_it","280105058_The_Sequent_Calculus_Trainer_-_Helping_Students_to_Correctly_Construct_Proofs","268902432_On_the_rules_of_suppositions_in_formal_logic","267168138_The_Collected_Papers_of_Gerhard_Gentzen","265351411_Mathematical_logic_Transl_from_the_German_by_Ann_S_Ferebee","242976245_Untersuchungen_uber_das_logische_Schliessen_I-II","226981638_Semantic_and_Syntactic_Proof_Productions"]}