{"id":"323588077_The_silhouette_width_criterion_for_clustering_and_association_mining_to_select_image_features","abstract":"Image data are normally unstructured and high dimensional due to the photography technology advancement such that an image can be taken at a wide range of resolution levels. To overcome such problem, data miners may consider selecting only a minimal set of features that are really important for classifying their images. Feature selection is a popular method for reducing dimensions in data. However, most feature selection algorithms return results in form of score for each feature. It is still difficult for data miners to choose features based on such scoring scheme because they may not know which score range is the best for their data classification at hand. Therefore, in this research, we aim to assist data miners and novice data analysts on solving dimensionality problem by finding for them the best optimal set of features, instead of just reporting the scores of all features and leaving the selection step to be the burden of miners. We select optimal set of features by firstly apply clustering technique to group similar features based on their scores. We thus propose the silhouette width criterion for selecting the optimal number of clusters during the cluster analysis step. After that we perform association mining to analyze relationships that may exist among different subsets of features toward the target attribute. Our method finally reports user the best subset of features to be potentially used further for data classification. We demonstrate performance of our proposed method on the satellite forest image data in Japan. © 2018 International Association of Computer Science and Information Technology.","authors":["N. Kaoungku","K. Suksut","R. Chanklan","K. Kerdprasop"],"meta":["February 2018","DOI:10.18178/ijmlc.2018.8.1.665"],"references":["220321053_Eficient_Feature_Selection_Via_Analysis_of_Relevance_and_Redundancy","6597563_Original_paper_In_search_of_the_small_ones_improved_prediction_of_short_exons_in_vertebrates_plants_fungi_and_protists","5542498_Approaches_to_dimensionality_reduction_in_proteomic_biomarker_studies","328424131_A_Method_to_Clustering_the_Feature_Ranking_on_Data_Classification_Using_an_Ensemble_Feature_Selection","313606501_Mining_Association_rules_between_sets_of_items_in_large_databases","224584217_Feature_Selection_Algorithm_Based_on_Association_Rules_Mining_Method","220895376_Machine_Learning_Techniques_and_Chi-Square_Feature_Selection_for_Cancer_Classification_Using_SAGE_Gene_Expression_Profiles","220049032_Some_Methods_for_Classification_and_Analysis_of_MultiVariate_Observations","4309456_Clustering_Categorical_Data_Using_Silhouette_Coefficient_as_a_Relocating_Measure","2460430_Fast_Algorithms_for_Mining_Association_Rules"]}