{"id":"323592213_Do_Children_Perceive_Whether_a_Robotic_Peer_is_Learning_or_Not","abstract":"Social robots are being used to create better educational scenarios, thereby fostering children»s learning. In the work presented here, we describe an autonomous social robot that was designed to enhance children»s handwriting skills. Exploiting the benefits of the learning-by-teaching method, the system provides a scenario in which a child acts as a teacher and corrects the handwriting difficulties of the robotic agent. To explore the children»s perception towards this social robot and the effect on their learning, we have conducted a multi-session study with children that compared two contrasting competencies in the robot: 'learning' vs 'non-learning' and presented as two conditions in the study. The results suggest that the children learned more in the learning condition compared with the non-learning condition and their learning gains seem to be affected by their perception of the robot. The results did not lead to any significant differences in the children»s perception of the robot in the first two weeks of interaction. However, by the end of the 4th week, the results changed. The children in the learning condition gave significantly higher writing ability and overall performance scores to the robot compared with the non-learning condition. In addition, the change in the robot»s learning capabilities did not show to affect their perceived intelligence, likability and friendliness towards it.","authors":["Shruti Chandra","Raul Benites Paradeda","Hang Yin","Pierre Dillenbourg"],"meta":["February 2018","DOI:10.1145/3171221.3171274","Conference: the 2018 ACM/IEEE International Conference","Project: CoWriter"],"references":["317920869_Classification_of_Children's_Handwriting_Errors_for_the_Design_of_an_Educational_Co-writer_Robotic_Peer","312880890_Synthesizing_Robotic_Handwriting_Motion_by_Learning_from_Human_Demonstrations","307941849_Synthesizing_Robotic_Handwriting_Motion_by_Learning_from_Human_Demonstrations","307601758_Children's_Peer_Assessment_and_Self-disclosure_in_the_Presence_of_an_Educational_Robot","307466149_The_Role_that_an_Educational_Robot_Plays","300361523_Developing_Interactive_Embodied_Characters_Using_the_Thalamus_Framework_A_Collaborative_Approach","284423421_Can_a_Child_Feel_Responsible_for_Another_in_the_Presence_of_a_Robot_in_a_Collaborative_Learning_Activity","324385131_Role_Theory_Concepts_and_Research","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","301914495_How_expressiveness_of_a_robotic_tutor_is_perceived_by_children_in_a_learning_environment"]}