{"id":"323582090_Tadpoles_respond_to_background_colour_under_threat","abstract":"The ability to respond to background colour is an important feature of species that might beneft\nfrom background matching camoufage. Tadpole colour patterns vary and could be associated with\nseveral functions, including defense. Because tadpoles are exposed to a wide array of visually oriented\npredators, they represent good models to study defensive colouration and associated behaviours. We\ntested whether a potentially disruptively camoufaged tadpole with a dark body crossed by yellow\nbars (Ololygon machadoi) is able to respond diferently to matching light and dark natural background\ncolours and an artifcial blue contrasting background. We used a syntopic contrasting black tadpole\n(Bokermannohyla martinsi) as a control, expecting it not to respond to background colour in search for\ncamoufage. Ololygon machadoi tadpoles chose light over blue backgrounds under threat, as expected,\nhowever they did not show preferential use of dark vs. blue backgrounds. Bokermannohyla martinsi\ndid not respond to any combination of background colours. Our results suggest that O. machadoi\ntadpoles are able to respond to background colour, and may favor matching backgrounds under some\ncircumstances. The potentially disruptive colouration of O. machadoi tadpoles may increase their\nrepertoire of escape strategies, background matching being one of the options to escape predation.","authors":["Paula Cabral Eterovick","Izabela Santos Mendes","Jessica Kloh","Luan T Pinheiro"],"meta":["March 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-22315-8"],"references":["284930331_The_role_of_tadpole_coloration_against_visually_oriented_predators","282119245_Taking_tadpole_biology_into_the_21st_century_a_consensus_paper_from_the_First_Tadpoles_International_Workshop","281043308_Escape_Response_of_Tadpoles_of_Two_Species_of_Bokermannohyla_Anura_Hylidae_to_Simulated_Threat","277776314_Anfibios_da_Serra_do_Cipo_Minas_Gerais_Brasil_1_duas_especies_novas_de_Hyla_Anura_Hylidae","330541545_Flora_II_As_Pteridofitas_da_Serra_do_Caraca","318393770_R_A_Language_and_Environment_for_Statistical_Computing","312455832_R_A_Language_and_Environment_for_Statistical_Computing","299482631_Behavioural_ecological_and_evolutionary_aspects_of_diversity_in_frog_colour_patterns","298104785_Dos_nuevas_especies_de_Hyla_del_grupo_catharinae_Amphibia_Hylidae","274560661_Tadpole_antipredator_responses_change_over_time_What_is_the_role_of_learning_and_generalization"]}