{"id":"323510688_penerapan_metode_collaborative_learning_untuk_meningkatkan_pemahaman_materi_kuliah_metodologi_penelitian","abstract":"A good study device is very necessary to reach a high quality study. The target of this research is to: (1) implement learning scenario using Collaborative Learning, (2) measure the impact of collaborative learning method in understanding the research methodology items, (3) measure the intrinsic motivation of the students in understanding a material, and (4) see the knowledge and psycho-motoric aspects comprehensively. This research is conducted in four months with five steps in every cycle. The steps are planning, action, observation, reflection, and evaluation. The result of the first cycle can be improved in the next cycles. It was found in the implementation in the cycle that there was a change towards a more optimum progress. Optimum implementation of learning scenario, is marked by the existence of arrangement and application of learning scenario that make the students involved actively, and involvement of various learning activities and resources in a whole. The result of this research showed that there was improvement of understanding of research methodology items in cognitive, affective and psycho-motoric aspects comprehensively based on the basic competence determined. Dalam proses pembelajaran di perguruan tinggi, mahasiswa masih diperkenalkan dengan su-atu konsep bahwa keberhasilan lebih merujuk pada kompetisi (competition) daripada kooperasi (coo-peration). Keberhasilan merupakan hasil dari ke-mandirian (independence) ketimbang saling keter-gantungan (interdependence). Pandangan seperti ini bahkan masih berkembang di kalangan pakar psikologi. Padahal, di negara-negara maju konsep seperti ini sudah banyak ditinggalkan. Covey (1989) telah memperkenalkan bahwa dalam para-digma manajemen modern dan kehidupan modern, keberhasilan seseorang justru dipengaruhi yang pa-ling tinggi oleh interdependensi. Adapun tahapan-nya keberhasilan adalah dari yang paling rendah yaitu ketergantungan (dependence), kemudian ke-mandirian, dan yang paling tinggi adalah saling ke-tergantungan. Pergeseran konsep seperti ini sangat bisa dipahami karena semakin terspesialisasikan-nya bidang-bidang ilmu sehingga untuk menghasil-kan suatu produk, manajemen produksi harus mampu mengkolaborasikan secara serasi antarspe-sialisasi bidang ilmu yang ada. Proses pembelajaran menekankan penting-nya kooperasi daripada kompetisi serta saling ke-tergantungan daripada kemandirian. Jika kompetisi yang dikembangkan, maka hal ini ada kecenderu-ngan dapat mengarahkan mahasiswa pada pikiran dan perasaan tidak segan untuk menyerang orang lain. Sementara itu, pengembangan kooperasi dan interdependensi justru dapat mengembangkan ke-mampuan menghadapi tantangan, kepemimpinan, dan manajemen yang sangat diperlukan jika kelak mereka sudah memasuki dunia kerja. Collaborative learning adalah proses belajar kelompok yang setiap anggota menyumbangkan informasi, pengalaman, ide, sikap, pendapat, ke-mampuan, dan keterampilan yang dimilikinya, un-tuk secara bersama-sama saling meningkatkan pe-mahaman seluruh anggota. Collaborative learning","authors":["Sudarman Sudarman"],"meta":["March 2018","Project: sudarman@fkip.unmul.ac.id"],"references":["240353006_Collaborative_learning_and_multimedia","30873041_Teaching_Concepts_an_Instructional_Design_Guide"]}