{"id":"323638651_Transportation_infrastructure_investment_and_the_location_of_new_manufacturing_around_South_Korea's_West_Coast_Expressway","abstract":"This study analyzes the impact of the opening of the West Coast Expressway in Korea on the location of new manufacturing establishments near the road. The expressway opened in December 2001 and connects the Seoul Metropolitan area with Jeolla province. Major construction goals were to stimulate the industrial development of nearby regions and improve the traffic flow around existing industrial complexes. The analysis used panel data for the ten years of 1997 through 2006. The database was developed from the annual Korea Mining and Manufacturing Survey and other sources.\nThe analysis used a fine spatial resolution based on three non-overlapping, small spatial administrative units: city wards (Korean: dong), towns (K. eup), and rural districts (K. myeon). This led to 2029 observations (one for each spatial unit) per year, or a total of 20,290 observations for the 10-year panel. The analysis was performed with a fixed-effect negative binomial panel regression. The analysis modeled the formation of new manufacturing establishments, both in total and classified by technology level and establishment size.\nThe results found that the opening of the West Coast Expressway had a significant positive impact on the decision of the location of new manufacturing establishments. The average wage of employed workers in local manufacturing establishments was also an important location determinant for new manufacturing establishments, especially for establishments based on lower technology levels which pay lower wages. Land price was found to produce a negative effect, regardless of technology level or size. The number of employed workers in existing manufacturing establishments in the local area was a highly significant positive determinant of location for new manufacturing establishments, indicating agglomeration effects.","authors":["Hyungtai Kim","Sanghoon Ahn","Gudmundur F. Ulfarsson"],"meta":["March 2018Transport Policy 66","DOI:10.1016/j.tranpol.2018.02.016"],"references":[]}