{"id":"323642048_Preparedness_for_the_next_epidemic_health_and_political_issues_of_an_emerging_paradigm","abstract":"‘Preparing for the next epidemic’ has been a recurrent theme in global health in recent years. Starting with SARS, by way of the Avian influenza, and intensifying after the 2013–2016 Ebola outbreak, the urgency of preparing for the next health disaster has been recommended by numerous global health stakeholders. Recommendations and global partnerships are aligned with the many action proposals that have been formulated by international political actors, including the WHO, that have made ‘preparedness for the next epidemic’ a new paradigm, alongside prevention. The intent of this commentary is to argue the need to discuss some aspects of the preparedness paradigm from both health and democratic perspectives. We believe preparedness reveals a new and problematic biopolitical orientation in global health. Our argument is that preparedness enacts a model that: (i) reconfigures knowledge about epidemics by disconnecting them from the social and historical contexts in which they arise and (ii) imposes new modalities of intervention that raise issues for democratic autonomy. After first tracing back the genealogy of the preparedness paradigm, this paper then discusses some of the issues at stake for both health and democracy.","authors":["Pierre-Marie David","Nicolas Le Dévédec"],"meta":["March 2018Critical Public Health 29(10075):1-7","DOI:10.1080/09581596.2018.1447646"],"references":["312531517_New_Vaccines_against_Epidemic_Infectious_Diseases","280910096_Planning_for_the_Next_Global_Pandemic","277967666_Preparedness_as_a_technology_of_insecurity_Pandemic_influenza_planning_and_the_global_biopolitics_of_emerging_infectious_disease","323322132_The_history_of_sexuality_Volume_1_An_introduction","312545668_CEPI-a_new_global_RD_organisation_for_epidemic_preparedness_and_response","311362379_Liste_des_sigles","298803143_A_panic_foretold_Ebola_in_the_United_States","289742979_On_The_Political","286062012_When_People_Come_First_Critical_Studies_in_Global_Health","273786086_The_Next_Epidemic_-_Lessons_from_Ebola"]}