{"id":"323663940_Improving_the_performance_of_minimizers_and_winnowing_schemes","abstract":"Motivation: \nThe minimizers scheme is a method for selecting k -mers from sequences. It is used in many bioinformatics software tools to bin comparable sequences or to sample a sequence in a deterministic fashion at approximately regular intervals, in order to reduce memory consumption and processing time. Although very useful, the minimizers selection procedure has undesirable behaviors (e.g. too many k -mers are selected when processing certain sequences). Some of these problems were already known to the authors of the minimizers technique, and the natural lexicographic ordering of k -mers used by minimizers was recognized as their origin. Many software tools using minimizers employ ad hoc variations of the lexicographic order to alleviate those issues.\n\nResults: \nWe provide an in-depth analysis of the effect of k -mer ordering on the performance of the minimizers technique. By using small universal hitting sets (a recently defined concept), we show how to significantly improve the performance of minimizers and avoid some of its worse behaviors. Based on these results, we encourage bioinformatics software developers to use an ordering based on a universal hitting set or, if not possible, a randomized ordering, rather than the lexicographic order. This analysis also settles negatively a conjecture (by Schleimer et al. ) on the expected density of minimizers in a random sequence.\n\nAvailability and implementation: \nThe software used for this analysis is available on GitHub: https://github.com/gmarcais/minimizers.git .\n\nContact: \ngmarcais@cs.cmu.edu or carlk@cs.cmu.edu.","authors":["Guillaume Marcais","David Pellow","Daniel Bork","Yaron Orenstein"],"meta":["July 2017Bioinformatics 33(14):i110-i117","DOI:10.1093/bioinformatics/btx235"],"references":["304002583_Compacting_de_Bruijn_graphs_from_sequencing_data_quickly_and_in_low_memory","263736737_KMC_2_Fast_and_resource-frugal_k-mer_counting","263012253_Sampling_the_Suffix_Array_with_Minimizers","260443015_Wood_DE_Salzberg_SL_Kraken_Ultrafast_metagenomic_sequence_classification_using_exact_alignment_Genome_Biol_15_R46","259824884_On_the_Representation_of_De_Bruijn_Graphs","224868956_Exploiting_sparseness_in_de_novo_genome_assembly","305910088_Compact_Universal_k-mer_Hitting_Sets","286302053_Minimap_and_miniasm_Fast_mapping_and_de_novo_assembly_for_noisy_long_sequences","277334891_MSPKmerCounter_A_Fast_and_Memory_Efficient_Approach_for_K-mer_Counting","237128705_A_Combinatorial_Problem"]}