{"id":"323694588_Embedding_rainbow_trees_with_applications_to_graph_labelling_and_decomposition","abstract":"A subgraph of an edge-coloured graph is called rainbow if all its edges have distinct colours. The study of rainbow subgraphs goes back more than two hundred years to the work of Euler on Latin squares. Since then rainbow structures have been the focus of extensive research and have found applications in the areas of graph labelling and decomposition. An edge-colouring is locally $k$-bounded if each vertex is contained in at most $k$ edges of the same colour. In this paper we prove that any such edge-colouring of the complete graph $K_n$ contains a rainbow copy of every tree with at most $(1-o(1))n/k$ vertices. As a locally $k$-bounded edge-colouring of $K_n$ may have only $(n-1)/k$ distinct colours, this is essentially tight. As a corollary of this result we obtain asymptotic versions of two long-standing conjectures in graph theory. Firstly, we prove an asymptotic version of Ringel's conjecture from 1963, showing that any $n$-edge tree packs into the complete graph $K_{2n+o(n)}$ to cover all but $o(n^2)$ of its edges. Secondly, we show that all trees have an almost-harmonious labelling. The existence of such a labelling was conjectured by Graham and Sloane in 1980. We also discuss some additional applications.","authors":["Richard Montgomery","Alexey Pokrovskiy","Benny Sudakov"],"meta":["March 2018Journal of the European Mathematical Society 22(10)","DOI:10.4171/JEMS/982"],"references":["306885751_Random_subgraphs_of_properly_edge-coloured_complete_graphs_and_long_rainbow_cycles","288890271_Packing_spanning_graphs_from_separable_families","273704351_Long_rainbow_path_in_properly_edge-colored_complete_graphs","309697895_Recherche_sur_une_nouvelle_espece_de_quarres_magiques","305880868_Optimal_packings_of_bounded_degree_trees","301878306_Packing_minor-closed_families_of_graphs_into_complete_graphs","301648373_A_blow-up_lemma_for_approximate_decompositions","270308708_Combinatorial_Matrix_Theory","268646455_Contemporary_design_theory_A_collection_of_surveys","268496537_Random_Graphs"]}