{"id":"323694818_Fake_news_propagate_differently_from_real_news_even_at_early_stages_of_spreading","abstract":"Social media can be a double-edged sword for modern communications, either a convenient channel exchanging ideas or an unexpected conduit circulating fake news through a large population. Existing studies of fake news focus on efforts on theoretical modelling of propagation or identification methods based on black-box machine learning, neglecting the possibility of identifying fake news using only structural features of propagation of fake news compared to those of real news and in particular the ability to identify fake news at early stages of propagation. Here we track large databases of fake news and real news in both, Twitter in Japan and its counterpart Weibo in China, and accumulate their complete traces of re-posting. It is consistently revealed in both media that fake news spreads distinctively, even at early stages of spreading, in a structure that resembles multiple broadcasters, while real news circulates with a dominant source. A novel predictability feature emerges from this difference in their propagation networks, offering new paths of early detection of fake news in social media. Instead of commonly used features like texts or users for fake news identification, our finding demonstrates collective structural signals that could be useful for filtering out fake news at early stages of their propagation evolution.","authors":["Zilong Zhao","Jichang Zhao","Yukie Sano","Orr Levy"],"meta":["March 2018EPJ Data Science 9(1)","DOI:10.1140/epjds/s13688-020-00224-z"],"references":["323650280_The_science_of_fake_news","319952704_Smoke_Screener_or_Straight_Shooter_Detecting_Elite_Sybil_Attacks_in_User-Review_Social_Networks","318661348_Debunking_in_a_world_of_tribes","315514666_Early_Detection_of_Promoted_Campaigns_on_Social_Media","332120456_Polarization_and_Fake_News_Early_Warning_of_Potential_Misinformation_Targets","328261301_On_Facebook_most_ties_are_weak","323649207_The_spread_of_true_and_false_news_online","323249037_Smoke_Screener_or_Straight_Shooter_Detecting_Elite_Sybil_Attacks_in_User-Review_Social_Networks","318475247_A_Study_of_Tweet_Veracity_to_Separate_Rumours_from_Counter-Rumours","316373563_Do_Rumors_Diffuse_Differently_from_Non-rumors_A_Systematically_Empirical_Analysis_in_Sina_Weibo_for_Rumor_Identification"]}