{"id":"323664116_Deep_learning_with_word_embeddings_improves_biomedical_named_entity_recognition","abstract":"Motivation: \nText mining has become an important tool for biomedical research. The most fundamental text-mining task is the recognition of biomedical named entities (NER), such as genes, chemicals and diseases. Current NER methods rely on pre-defined features which try to capture the specific surface properties of entity types, properties of the typical local context, background knowledge, and linguistic information. State-of-the-art tools are entity-specific, as dictionaries and empirically optimal feature sets differ between entity types, which makes their development costly. Furthermore, features are often optimized for a specific gold standard corpus, which makes extrapolation of quality measures difficult.\n\nResults: \nWe show that a completely generic method based on deep learning and statistical word embeddings [called long short-term memory network-conditional random field (LSTM-CRF)] outperforms state-of-the-art entity-specific NER tools, and often by a large margin. To this end, we compared the performance of LSTM-CRF on 33 data sets covering five different entity classes with that of best-of-class NER tools and an entity-agnostic CRF implementation. On average, F1-score of LSTM-CRF is 5% above that of the baselines, mostly due to a sharp increase in recall.\n\nAvailability and implementation: \nThe source code for LSTM-CRF is available at https://github.com/glample/tagger and the links to the corpora are available at https://corposaurus.github.io/corpora/ .\n\nContact: \nhabibima@informatik.hu-berlin.de.","authors":["Maryam Habibi","Leon Weber","Mariana Neves","David Luis Wiegandt"],"meta":["July 2017Bioinformatics 33(14):i37-i48","DOI:10.1093/bioinformatics/btx228"],"references":["311587013_Overview_of_BioCreative_II_gene_mention_recognition","309544834_Recognizing_chemicals_in_patents_a_comparative_analysis","305334469_Neural_Architectures_for_Named_Entity_Recognition","302593945_BioCreative_V_CDR_task_corpus_a_resource_for_chemical_disease_relation_extraction","291354616_VSDC_A_method_to_improve_early_recognition_in_virtual_screening_when_limited_experimental_resources_are_available","288971322_Overview_of_the_BioCreative_V_chemical_disease_relation_CDR_task","287107309_Effects_of_Semantic_Features_on_Machine_Learning-Based_Drug_Name_Recognition_Systems_Word_Embeddings_vs_Manually_Constructed_Dictionaries","312250856_An_Investigation_of_Recurrent_Neural_Architectures_for_Drug_Name_Recognition","303891593_TaggerOne_Joint_Named_Entity_Recognition_and_Normalization_with_Semi-Markov_Models","301847993_Exploring_the_Limits_of_Language_Modeling"]}