{"id":"323612291_A_Quasi-Virtual_Online_Analyser_based_on_an_Artificial_Neural_Networks_and_Offline_Measurements_to_predict_purities_of_raffinateextract_in_Simulated_Moving_Bed_processes","abstract":"The quality control and optimization of Simulated Moving Bed processes are still a challenge. Among the main reasons for that, the real time measurement of its main properties can be highlighted. Further developments in this field are necessary in order to allow the development of better control and optimization systems of these units. In the present work, a system composed by two Artificial Neural Networks working concomitantly with an offline measurement system is proposed, named Quasi-Virtual Analyser (Q-VOA) system. The development of the Q-VOA is presented and the system is simulated in order to evaluate its efficiency. The methodology used to select the input variables for the Q-VOA is another contribution of this work. The results show that the Q-VOA is capable of reducing the system errors and keep the prediction closer to the process true responses, when compared with the simple VOA system, which is based solely on model predictions. Furthermore, the results show the efficiency of the measurement system even under the presence of non-measured perturbations.","authors":["Idelfonso Bessa dos Reis Nogueira","Ana M. Ribeiro","Reiner Requião","Karen V. Pontes"],"meta":["March 2018Applied Soft Computing 67","DOI:10.1016/j.asoc.2018.03.001","Project: AICySPrOC - Artificial Intelligence oriented Cyclic adsorption Separation/reaction Processes Optimization and Control"],"references":["299381892_Artificial_Neural_Network_Modeling_and_Mechanism_Study_for_Relaxation_of_Deformed_Rubber","284030503_Neural_networks_to_Estimate_Physicochemical_Properties_of_Choline_Carboxylate_Ionic_Liquids","283534347_Prediction_of_the_Particle_Size_Distribution_Parameters_in_a_High_Shear_Granulation_Process_Using_a_Key_Parameter_Definition_Combined_Artificial_Neural_Network_Model","282525181_Modeling_the_Removal_of_Endosulfan_from_Aqueous_Solution_by_Electrocoagulation_Process_Using_Artificial_Neural_Network_ANN"]}