{"id":"323659332_A_Hybrid_Metaheuristic_and_Kernel_Intuitionistic_Fuzzy_c-means_Algorithm_for_Cluster_Analysis","abstract":"Cluster analysis is a very useful data mining approach. Although many clustering algorithms have been proposed, it is very difficult to find a clustering method which is suitable for all types of datasets. This study proposes an evolutionary-based clustering algorithm which combines a metaheuristic with a kernel intuitionistic fuzzy c-means (KIFCM) algorithm. The KIFCM algorithm improves the fuzzy c-means (FCM) algorithm by employing an intuitionistic fuzzy set and a kernel function. According to previous studies, the KIFCM algorithm is a promising algorithm. However, it still has a weakness due to its high sensitivity to initial centroids. Thus, this study overcomes this problem by using a metaheuristic algorithm to improve the KIFCM result. The metaheuristic can provide better initial centroids for the KIFCM algorithm. This study applies three metaheuristics, particle swarm optimization (PSO), genetic algorithm (GA) and artificial bee colony (ABC) algorithms. Though the hybrid method is not new, this is the first paper to combine metaheuristics and KIFCM. The proposed algorithms, PSO-KIFCM, GA-KIFCM and ABC-KIFCM algorithms are evaluated using six benchmark datasets. The results are compared with some other clustering algorithms, namely K-means, FCM, Kernel fuzzy c-means (KFCM) and KIFCM algorithms. The results prove that the proposed algorithms achieve better accuracy. Furthermore, the proposed algorithms are applied to solve a case study on customer segmentation. This case study is taken from franchise stores selling women's clothing in Taiwan. For this case study, the proposed algorithms also exhibit better cluster construction than other tested algorithms.","authors":["R.J. Kuo","T.C. Lin","F.E. Zulvia","C.Y. Tsai"],"meta":["March 2018Applied Soft Computing 67","DOI:10.1016/j.asoc.2018.02.039"],"references":["267272421_A_Novel_Evolutionary_Kernel_Intuitionistic_Fuzzy_C_-means_Clustering_Algorithm","6705848_Computing_the_maximum_similarity_bi-clusters_of_gene_expression_data"]}