{"id":"323612179_An_Epidemic_Model_of_Computer_Worms_with_Time_Delay_and_Variable_Infection_Rate","abstract":"With rapid development of Internet, network security issues become increasingly serious. Temporary patches have been put on the infectious hosts, which may lose efficacy on occasions. This leads to a time delay when vaccinated hosts change to susceptible hosts. On the other hand, the worm infection is usually a nonlinear process. Considering the actual situation, a variable infection rate is introduced to describe the spread process of worms. According to above aspects, we propose a time-delayed worm propagation model with variable infection rate. Then the existence condition and the stability of the positive equilibrium are derived. Due to the existence of time delay, the worm propagation system may be unstable and out of control. Moreover, the threshold τ0 of Hopf bifurcation is obtained. The worm propagation system is stable if time delay is less than τ0 . When time delay is over τ0 , the system will be unstable. In addition, numerical experiments have been performed, which can match the conclusions we deduce. The numerical experiments also show that there exists a threshold in the parameter a , which implies that we should choose appropriate infection rate β(t) to constrain worm prevalence. Finally, simulation experiments are carried out to prove the validity of our conclusions.","authors":["Yu Yao","Qiang fu","Wei Yang","Ying Wang"],"meta":["March 2018Security and Communication Networks 2018(5):1-11","DOI:10.1155/2018/9756982"],"references":["273497068_Analysis_of_a_Delayed_Internet_Worm_Propagation_Model_with_Impulsive_Quarantine_Strategy","258383340_Hopf_Bifurcation_in_an_SEIDQV_Worm_Propagation_Model_with_Quarantine_Strategy","258382885_An_Impulse_Model_for_Computer_Viruses","258382874_Towards_the_Epidemiological_Modeling_of_Computer_Viruses","258381818_Propagation_of_Computer_Virus_under_Human_Intervention_A_Dynamical_Model","282936277_Effects_of_dynamic_quarantine_and_nonlinear_infection_rate_in_a_model_for_computer_worms_propagation","277536590_Dynamical_analysis_and_control_strategies_on_malware_propagation_model","273728664_An_epidemic_model_of_computer_viruses_with_vaccination_and_generalized_nonlinear_incidence_rate","257634012_The_spread_of_computer_virus_under_the_effect_of_external_computers","257591026_A_novel_computer_virus_model_and_its_dynamics"]}