{"id":"323656013_Sense-Based_Arabic_Information_Retrieval_Using_Harmony_Search_Algorithm","abstract":"Information Retrieval (IR) is a field of computer science that deals with storing, searching, and retrieving documents that satisfy the user need. The modern standard Arabic language is rich in multiple meanings (senses) for many words and this is substantially due to lack of diacritical marks. The task for finding appropriate meanings is a key demand in most of the Arabic IR applications. Actually, the successful system should not be interested only in the retrieval quality and oblivious to the system efficiency. Thus, this paper contributes to improve the system effectiveness by finding appropriate stemming methodology, word sense disambiguation, and query expansion for addressing the retrieval quality of AIR. Also, it contributes to improve the system efficiency through using a powerful metaheuristic search called Harmony Search (HS) algorithm inspired from the musical improvisation processes. The performance of the proposed system outperforms the one in the traditional system in a rate of 19.5% while reduces the latency in an approximate rate of 0.077 second for each query.","authors":["Alia Karim","Abdul wahab Hassan","Mustafa Jasim Hadi"],"meta":["August 2017Iraqi Journal for Computers and Informatics 43(2)","DOI:10.25195/ijci.v43i2.59"],"references":["313774220_Proposed_MABC-SDAIR_algorithm_for_sense-based_distributed_Arabic_information_retrieval","307993178_Mining_Documents_and_Sentiments_in_Cross-lingual_Context","305387933_Arabic_Query_Expansion_Using_WordNet_and_Association_Rules","303157100_Arabic_roots_extraction_using_morphological_analysis","282345535_Harmony_Search_Algorithm_for_Word_Sense_Disambiguation","281856153_A_Comparative_Study_on_Arabic_Stemmers","321525592_An_Introduction_to_Harmony_Search_Optimization_Method","306315345_A_review_of_semantic_similarity_measures_in_WordNet","284736127_Harmony_Search_Algorithm_with_Ensemble_of_Surrogate_Models","284735978_Investigating_the_Convergence_Characteristics_of_Harmony_Search"]}