{"id":"323650585_Structure-Based_Sybil_Detection_in_Social_Networks_via_Local_Rule-Based_Propagation","abstract":"Sybil detection in social networks is a basic security research problem. Structure-based methods have been shown to be promising at detecting Sybils. Existing structure-based methods can be classified into Random Walk (RW)-based methods and Loop Belief Propagation (LBP)-based methods. RW-based methods cannot leverage labeled Sybils and labeled benign users simultaneously, which limits their detection accuracy, and/or they are not robust to noisy labels. LBP-based methods are not scalable and cannot guarantee convergence. In this work, we propose SybilSCAR, a novel structure-based method to detect Sybils in social networks. SybilSCAR is Scalable, Convergent, Accurate, and Robust to label noise. We first propose a framework to unify RW-based and LBP-based methods. Under our framework, these methods can be viewed as iteratively applying a (different) local rule to every user, which propagates label information among a social graph. Second, we design a new local rule, which SybilSCAR iteratively applies to every user to detect Sybils. We compare SybilSCAR with state-of-the-art RW-based and LBP-based methods theoretically and empirically. Theoretically, we show that, with proper parameter settings, SybilSCAR has a tighter asymptotical bound on the number of Sybils that are falsely accepted into a social network than existing structure-based methods. Empirically, we perform evaluation using both social networks with synthesized Sybils and a large-scale Twitter dataset (41.7M nodes and 1.2B edges) with real Sybils. Our results show that 1) SybilSCAR is substantially more accurate and more robust to label noise than state-of-the-art RW-based methods; 2) SybilSCAR is more accurate and one order of magnitude more scalable than state-of-the-art LBP-based methods.","authors":["Binghui Wang","Jinyuan Jia","Le Zhang","Neil Zhenqiang Gong"],"meta":["March 2018IEEE Transactions on Network Science and Engineering PP(99):1-1","DOI:10.1109/TNSE.2018.2813672","Project: Graph-based Security and Privacy Analytics"],"references":["323884123_SYBILFUSE_Combining_Local_Attributes_with_Global_Structure_to_Perform_Robust_Sybil_Detection","320839700_GANG_Detecting_Fraudulent_Users_in_Online_Social_Networks_via_Guilt-by-Association_on_Directed_Graphs","319408946_Random_Walk_Based_Fake_Account_Detection_in_Online_Social_Networks","317506206_SybilSCAR_Sybil_Detection_in_Online_Social_Networks_via_Local_Rule_based_Propagation","300925110_Integro_Leveraging_Victim_Prediction_for_Robust_Fake_Account_Detection_in_OSNs","327003467_SYBILFUSE_Combining_Local_Attributes_with_Global_Structure_to_Perform_Robust_Sybil_Detection","324767808_Markov_Chains_and_Mixing_Times","319281084_Robust_Spammer_Detection_in_Microblogs_Leveraging_User_Carefulness","311175296_An_analysis_of_social_network-based_sybil_defenses","310823607_SmartWalk_Enhancing_Social_Network_Security_via_Adaptive_Random_Walks"]}