{"id":"323662208_Modeling_the_Emergence_of_Antibiotic_Resistance_in_Bacterial_Populations","abstract":"Since antibiotics have become routinely used to treat infections, antibiotic resistance is now an emerging concern for public health. To understand how bacteria become resistant to antibiotics, many students draw from the common misconception that bacteria gain resistance upon antibiotic exposure. We have designed models and a corresponding lab that explores how a population of bacteria can evolve antibiotic resistance, with emphasis on dispelling common misconceptions surrounding the mechanism of antibiotic resistance. Using an antibiotic disk diffusion assay, students compare the antibiotic resistance level of a harmless E. coli strain of bacteria over time. Then, students compare their lab data to the models, which together illustrate the roles that initial genetic variation and random mutation play in the evolution of antibiotic resistance. In this guided investigation, basic microbiology concepts and techniques are made accessible to students in a high school classroom. The models developed here are in line with the practices of the Next Generation Science Standards (NGSS). The models, together with the lab, are used to guide students through the process of argumentation using a claim, evidence, and reasoning (CER) format to explain the evolutionary mechanisms of antibiotic resistance.","authors":["Michelle Williams","Patricia Friedrichsen","Troy D. Sadler","Pamela J. B. Brown"],"meta":["March 2018The American Biology Teacher 80(3):214-220","DOI:10.1525/abt.2018.80.3.214"],"references":["240526585_A_typology_of_school_science_models","227714748_Developing_a_learning_progression_for_scientific_modeling_Making_scientific_modeling_accessible_and_meaningful_for_learner","225629976_Current_Status_of_Research_in_Teaching_and_Learning_Evolution_II_Pedagogical_Issues","296630528_Perspective_Teaching_evolution_in_higher_education","267982391_Development_and_evaluation_of_a_model_for_secondary_evolution_educators'_professional_development_needs","248056274_The_Uses_of_Argument","243774103_Nothing_in_Biology_Makes_Sense_Except_in_the_Light_of_Evolution_The_American_Biology_Teacher","236262497_Scientific_Argumentation_in_Biology_30_Classroom_Activities","229640826_Bishop_BA_Anderson_CW_Student_conceptions_of_natural_selection_and_its_role_in_evolution_J_Res_Sci_Teach_199027415-27","229589381_Teaching_evolutionary_biology_Pressures_stress_and_coping"]}