{"id":"323619311_CardNutri_A_Software_of_Weekly_Menus_Nutritional_Elaboration_for_Scholar_Feeding_Applying_Evolutionary_Computation","abstract":"This paper aims to present and evaluate a software that uses an evolutionary strategy to design weekly nutritional menus for School Feeding. The software ensures the nutritional needs of students and also minimizes the total cost of the menu. We based our nutritional needs on the Brazilian National School Feeding Programme (PNAE). This program takes into account: (i) the age of the student; (ii) some preparations issues as color, consistency and, variety; and also (iii) the maximum amount to be paid per meal. Our software generates, in less than five minutes, a set of menus, and the nutritionist can choose the menu that suits his/her best. We evaluate our algorithm using the Weighted-Sum approach, and our results show that the obtained 5-days menus using the proposed methodology not only comply with the restrictions imposed by the authorities but also produce inexpensive and healthy menus. We also appraise the software itself using an opinion pool among nine nutritionists. The professionals considered our software above expectations.","authors":["Rafaela Moreira","Elizabeth F. Wanner","Flávio Vinícius Cruzeiro Martins","João Sarubbi"],"meta":["March 2018","DOI:10.1007/978-3-319-77538-8_59","In book: Applications of Evolutionary Computation (pp.897-913)"],"references":["267529026_A_New_Menu_Planning_Model_for_Malaysian_Secondary_Schools_using_Optimization_Approach","266226598_Pladiet_Un_Sistema_de_Computo_para_el_Diseno_de_Dietas_Individualizas_Utilizando_Algoritmos_Geneticos","200085965_Perceived_Usefulness_Perceived_Ease_of_Use_and_User_Acceptance_of_Information_Technology","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","242543379_Using_the_Thinking_Aloud_method_in_cognitive_interface_design","220742615_Healthy_daily_meal_planner","220419818_Menu_Planning_by_Computer","200086112_A_Technique_for_Measurement_of_Attitudes"]}