{"id":"323722948_Community_Interaction_and_Conflict_on_the_Web","abstract":"Users organize themselves into communities on web platforms. These communities can interact with one another, often leading to conflicts and toxic interactions. However, little is known about the mechanisms of interactions between communities and how they impact users.\nHere we study intercommunity interactions across 36,000 communities on Reddit, examining cases where users of one community are mobilized by negative sentiment to comment in another community. We show that such conflicts tend to be initiated by a handful of communities---less than 1% of communities start 74% of conflicts. While conflicts tend to be initiated by highly active community members, they are carried out by significantly less active members. We find that conflicts are marked by formation of echo chambers, where users primarily talk to other users from their own community. In the long-term, conflicts have adverse effects and reduce the overall activity of users in the targeted communities.\nOur analysis of user interactions also suggests strategies for mitigating the negative impact of conflicts---such as increasing direct engagement between attackers and defenders. Further, we accurately predict whether a conflict will occur by creating a novel LSTM model that combines graph embeddings, user, community, and text features. This model can be used to create an early-warning system for community moderators to prevent conflicts. Altogether, this work presents a data-driven view of community interactions and conflict, and paves the way towards healthier online communities.","authors":["Srijan Kumar","William L. Hamilton","Jure Leskovec","Dan Jurafsky"],"meta":["March 2018","DOI:10.1145/3178876.3186141"],"references":["324717175_False_Information_on_Web_and_Social_Media_A_Survey","322965265_REV2_Fraudulent_User_Prediction_in_Rating_Platforms","321068618_The_Web_Centipede_Understanding_How_Web_Communities_Influence_Each_Other_Through_the_Lens_of_Mainstream_and_Alternative_News_Sources","319896834_Representation_Learning_on_Graphs_Methods_and_Applications","330436559_MANAGING_CONFLICT_IN_ORGANIZATIONS","329959710_Building_Successful_Online_Communities_Evidence-Based_Social_Design","324320472_Nonparametric_Statistics_for_the_Behavioral_Sciences","324286856_The_Nature_of_Prejudice","321639668_You_Can't_Stay_Here_The_Efficacy_of_Reddit's_2015_Ban_Examined_Through_Hate_Speech","321635965_Identifying_Misaligned_Inter-Group_Links_and_Communities"]}