{"id":"323734667_A_Threat-Driven_Approach_to_Modeling_a_Campus_Network_Security","abstract":"The Higher Education Institutions (HEI) readiness to cyber security threats has gotten less consideration than certain organizations and financial companies and the need to address these kinds of adversities are necessary in colleges and universities. These institutions face challenges which are unique to the way they operate, meaning they have to seek out appropriate solutions to keep their assets safe and secure. Threat-Driven Approach is a systematic approach that is driven by a clear understanding of the security need. Using this systematic approach, the strength of a protection is easily gauged through simple identification of the weakest link of the network. Various Threat Driven approach have been proposed, but most of the study focuses on the security of software development and business infrastructure. Based on the existing literature, there is no HEI that are practicing the systematic approach in securing their assets. The primary purpose of this paper is to enable HEI to apply this approach and will provide detailed guidance that will enable HEI to place threats at the forefront of planning, design, testing, deployment and operational activities. The threat driven approach is a set of integrated methodology, practices and tools into one framework/model. The STRIDE and DREAD are also used in this study to identify and calculate the potential threats of the Network Security. As a result, our approach can make network design secured from anticipated security threats and, thus, reduce significant design-level vulnerabilities.","authors":["Marlon Naagas"],"meta":["February 2018","DOI:10.1145/3193092.3193096","Conference: the 6th International Conference"],"references":["311238739_Threat_Modeling_of_Electronic_Health_Systems_and_Mitigating_Countermeasures","290628781_Using_Model_Driven_Security_Approaches_in_Web_Application_Development","261467039_Model-Based_Vulnerability_Testing_for_Web_Applications","259445374_Fuzzy_Logic_Approach_for_Threat_Prioritization_in_Agile_Security_Framework_using_DREAD_Model","304189716_Penetration_testing_Concepts_attack_methods_and_defense_strategies","283021234_Towards_a_model-driven_based_security_framework"]}