{"id":"323791509_Intergenerational_transmission_of_gender_segregation_How_parents'_occupational_field_affects_gender_differences_in_field_of_study_choices","abstract":"The study explores how parents’ occupational field affects gender differences in educational fields. On the one hand, the theory of direct transfer predicts that adolescents enter fields similar to those of their parents because of intergenerational transmission of occupation-specific resources and that adolescents are more likely to draw upon the resources provided by the higher-status parent. On the other hand, the theory of sex-role learning predicts that boys and girls are more likely to choose more gender-stereotypical fields of study because they learn ‘appropriate’ gender-role behaviour from their parents’ occupational field and that boys are more likely to learn this behaviour from their father and girls from their mother. We use longitudinal data collected from adolescents and their parents in the Netherlands (N = 2,497) and tested our hypotheses using multiple-group structural equation modelling and multinomial regression analyses. In line with sex-role learning, results show that especially mothers who are employed in a more feminine occupational field influence their daughters to enter a more feminine field of study (health, biology, agriculture and veterinary) and their sons to enter a more masculine field of study (science and technology). Mothers’ occupational field therefore not only influences girls’ field of study, but also boys’. This study highlights the role of horizontal characteristics when examining which field of study adolescents enter. Contrary to the stratification literature, which primarily focuses on fathers, this study concludes that mothers play a more important role in gender differences in fields of study.","authors":["Maaike van der vleuten","Eva Jaspers","Ineke Maas","T. van der Lippe"],"meta":["March 2018British Educational Research Journal 44(1)","DOI:10.1002/berj.3329"],"references":["303566495_Gender_segregation_in_the_labour_market_Root_causes_implications_and_policy_responses_in_the_EU","269629291_Fields_of_Study_College_Selectivity_and_Student_Inequalities_in_Higher_Education","267153157_Gender_of_Siblings_and_Choice_of_College_Major","313406750_Fields_of_study_college_selectivity_and_student_inequalities","288467056_Social_Learning_Theory","285579681_Gender_Segregation_in_Vocational_Education","276527386_STEM_Education","275326687_Nurse_or_Mechanic_The_Role_of_Parental_Socialization_and_Children's_Personality_in_the_Formation_of_Sex-Typed_Occupational_Aspirations","272562514_Attitude_Similarity_in_Three-Generation_Families_Socialization_Status_Inheritance_or_Reciprocal_Influence","272562329_Sex_and_the_Process_of_Status_Attainment_A_Comparison_of_Working_Women_and_Men"]}