{"id":"323747090_Hybrid_Forecasting_of_Chaotic_Processes_Using_Machine_Learning_in_Conjunction_with_a_Knowledge-Based_Model","abstract":"A model-based approach to forecasting chaotic dynamical systems utilizes knowledge of the physical processes governing the dynamics to build an approximate mathematical model of the system. In contrast, machine learning techniques have demonstrated promising results for forecasting chaotic systems purely from past time series measurements of system state variables (training data), without prior knowledge of the system dynamics. The motivation for this paper is the potential of machine learning for filling in the gaps in our underlying mechanistic knowledge that cause widely-used knowledge-based models to be inaccurate. Thus we here propose a general method that leverages the advantages of these two approaches by combining a knowledge-based model and a machine learning technique to build a hybrid forecasting scheme. Potential applications for such an approach are numerous (e.g., improving weather forecasting). We demonstrate and test the utility of this approach using a particular illustrative version of a machine learning known as reservoir computing, and we apply the resulting hybrid forecaster to a low-dimensional chaotic system, as well as to a high-dimensional spatiotemporal chaotic system. These tests yield extremely promising results in that our hybrid technique is able to accurately predict for a much longer period of time than either its machine-learning component or its model-based component alone.","authors":["Jaideep Pathak","Alexander Wikner","Rebeckah Fussell","Sarthak Chandra"],"meta":["March 2018Chaos (Woodbury, N.Y.) 28(4)","DOI:10.1063/1.5028373"],"references":["323694500_Data-assisted_reduced-order_modeling_of_extreme_events_in_complex_dynamical_systems","322457145_Model-Free_Prediction_of_Large_Spatiotemporally_Chaotic_Systems_from_Data_A_Reservoir_Computing_Approach","320564486_Using_Machine_Learning_to_Replicate_Chaotic_Attractors_and_Calculate_Lyapunov_Exponents_from_Data","313463701_High-Speed_Photonic_Reservoir_Computing_Using_a_Time-Delay-Based_Architecture_Million_Words_per_Second_Classification","267982748_Reservoir_computing_with_a_single_time-delay_autonomous_Boolean_node","317155297_Brain-Inspired_Photonic_Signal_Processor_for_Generating_Periodic_Patterns_and_Emulating_Chaotic_Systems","315793836_Reservoir_observers_Model-free_inference_of_unmeasured_variables_in_chaotic_systems","235982903_Persistent_Propagation_of_Concentration_Waves_in_Dissipative_Media_Far_from_Thermal_Equilibrium","227637940_A_Hybrid_Neural-Network_First_Principles_Approach_to_Process_Modeling","224043924_Deterministic_Nonperiodic_Flow"]}