{"id":"323708174_Predicting_cancer_outcomes_from_histology_and_genomics_using_convolutional_networks","abstract":"Cancer histology reflects underlying molecular processes and disease progression and contains rich phenotypic information that is predictive of patient outcomes. In this study, we show a computational approach for learning patient outcomes from digital pathology images using deep learning to combine the power of adaptive machine learning algorithms with traditional survival models. We illustrate how these survival convolutional neural networks (SCNNs) can integrate information from both histology images and genomic biomarkers into a single unified framework to predict time-to-event outcomes and show prediction accuracy that surpasses the current clinical paradigm for predicting the overall survival of patients diagnosed with glioma. We use statistical sampling techniques to address challenges in learning survival from histology images, including tumor heterogeneity and the need for large training cohorts. We also provide insights into the prediction mechanisms of SCNNs, using heat map visualization to show that SCNNs recognize important structures, like microvascular proliferation, that are related to prognosis and that are used by pathologists in grading. These results highlight the emerging role of deep learning in precision medicine and suggest an expanding utility for computational analysis of histology in the future practice of pathology.","authors":["Pooya Mobadersany","Safoora Yousefi","Mohamed Amgad","David A Gutman"],"meta":["March 2018Proceedings of the National Academy of Sciences 115(13):201717139","DOI:10.1073/pnas.1717139115"],"references":["323409041_DeepSurv_Personalized_treatment_recommender_system_using_a_Cox_proportional_hazards_deep_neural_network","319773247_Predicting_clinical_outcomes_from_large_scale_cancer_genomic_profiles_with_deep_survival_models","316192215_Accurate_and_reproducible_invasive_breast_cancer_detection_in_whole-slide_images_A_Deep_Learning_approach_for_quantifying_tumor_extent","320763666_The_Digital_Slide_Archive_A_Software_Platform_for_Management_Integration_and_Analysis_of_Histology_for_Cancer_Research","320333333_The_impact_of_surgery_in_molecularly_defined_low-grade_glioma_An_integrated_clinical_radiological_and_molecular_analysis","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","312568206_Deep_convolutional_neural_network_for_survival_analysis_with_pathological_images","311164170_Development_and_Validation_of_a_Deep_Learning_Algorithm_for_Detection_of_Diabetic_Retinopathy_in_Retinal_Fundus_Photographs"]}