{"id":"323746954_Deep_k-Nearest_Neighbors_Towards_Confident_Interpretable_and_Robust_Deep_Learning","abstract":"Deep neural networks (DNNs) enable innovative applications of machine learning like image recognition, machine translation, or malware detection. However, deep learning is often criticized for its lack of robustness in adversarial settings (e.g., vulnerability to adversarial inputs) and general inability to rationalize its predictions. In this work, we exploit the structure of deep learning to enable new learning-based inference and decision strategies that achieve desirable properties such as robustness and interpretability. We take a first step in this direction and introduce the Deep k-Nearest Neighbors (DkNN). This hybrid classifier combines the k-nearest neighbors algorithm with representations of the data learned by each layer of the DNN: a test input is compared to its neighboring training points according to the distance that separates them in the representations. We show the labels of these neighboring points afford confidence estimates for inputs outside the model's training manifold, including on malicious inputs like adversarial examples--and therein provides protections against inputs that are outside the models understanding. This is because the nearest neighbors can be used to estimate the nonconformity of, i.e., the lack of support for, a prediction in the training data. The neighbors also constitute human-interpretable explanations of predictions. We evaluate the DkNN algorithm on several datasets, and show the confidence estimates accurately identify inputs outside the model, and that the explanations provided by nearest neighbors are intuitive and useful in understanding model failures.","authors":["Nicolas Papernot","Patrick McDaniel"],"meta":["March 2018"],"references":["326276006_SoK_Security_and_Privacy_in_Machine_Learning","328554450_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","324258821_Human_Decisions_and_Machine_Predictions","323983704_Big_Data's_Disparate_Impact","323248062_Feature_Squeezing_Detecting_Adversarial_Examples_in_Deep_Neural_Networks","322277018_Tensorflow_Large-scale_machine_learning_on_heterogeneous_distributed_systems","320971142_Network_Dissection_Quantifying_Interpretability_of_Deep_Visual_Representations","320967614_A_neural_algorithm_for_a_fundamental_computing_problem","320671312_MagNet_A_Two-Pronged_Defense_against_Adversarial_Examples","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks"]}