{"id":"323746847_Quantization_of_Fully_Convolutional_Networks_for_Accurate_Biomedical_Image_Segmentation","abstract":"With pervasive applications of medical imaging in health-care, biomedical image segmentation plays a central role in quantitative analysis, clinical diagno- sis, and medical intervention. Since manual anno- tation su ers limited reproducibility, arduous e orts, and excessive time, automatic segmentation is desired to process increasingly larger scale histopathological data. Recently, deep neural networks (DNNs), par- ticularly fully convolutional networks (FCNs), have been widely applied to biomedical image segmenta- tion, attaining much improved performance. At the same time, quantization of DNNs has become an ac- tive research topic, which aims to represent weights with less memory (precision) to considerably reduce memory and computation requirements of DNNs while maintaining acceptable accuracy. In this paper, we apply quantization techniques to FCNs for accurate biomedical image segmentation. Unlike existing litera- ture on quantization which primarily targets memory and computation complexity reduction, we apply quan- tization as a method to reduce over tting in FCNs for better accuracy. Speci cally, we focus on a state-of- the-art segmentation framework, suggestive annotation [22], which judiciously extracts representative annota- tion samples from the original training dataset, obtain- ing an e ective small-sized balanced training dataset. We develop two new quantization processes for this framework: (1) suggestive annotation with quantiza- tion for highly representative training samples, and (2) network training with quantization for high accuracy. Extensive experiments on the MICCAI Gland dataset show that both quantization processes can improve the segmentation performance, and our proposed method exceeds the current state-of-the-art performance by up to 1%. In addition, our method has a reduction of up to 6.4x on memory usage.","authors":["Xiaowei Xu","Qing Lu","Yu Hu","Lin Yang"],"meta":["March 2018"],"references":["313645102_Incremental_Network_Quantization_Towards_Lossless_CNNs_with_Low-Precision_Weights","311610999_DCAN_Deep_Contour-Aware_Networks_for_Accurate_Gland_Segmentation","321821460_Edge_segmentation_Empowering_mobile_telemedicine_with_compressed_cellular_neural_networks","319770334_Deep_Compression_Compressing_Deep_Neural_Networks_with_Pruning_Trained_Quantization_and_Huffman_Coding","319462219_Suggestive_Annotation_A_Deep_Active_Learning_Framework_for_Biomedical_Image_Segmentation","313074664_Gland_Instance_Segmentation_by_Deep_Multichannel_Side_Supervision","311430286_Trained_Ternary_Quantization","310610295_Gland_Instance_Segmentation_Using_Deep_Multichannel_Neural_Networks","308277088_XNOR-Net_ImageNet_Classification_Using_Binary_Convolutional_Neural_Networks","305193694_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation"]}