{"id":"323726874_Implementation_of_a_Model_of_Inventories_in_Five_Mipymes_in_the_City_of_Neiva_Republic_of_Colombia","abstract":"Bearing in mind that most of the productive units in the country correspond to Mipymes and the contribution they are making to the economy. It is necessary to know some series of situations related to their administrative management that, due to lack of knowledge, resources, the same business culture, make them are uncompetitive and productive in an environment in which every day there are major challenges. One of the aspects that affect them, has to do with the handling of inventories, this to the extent that many of the Mipymes do not have an inventory management system that allows them to make efficient use of resources. Precisely this was proven during the development of the applied research instruments, which included the implementation of the ABC Inventory Management Model, where the companies have low rotation products in their inventories, which leads to a series of unnecessary costs and that undoubtedly affects your finances. All this leads to the idea of working on the implementation of an inventory management model according to the needs of Mipymes For this, it is necessary to know the way in which the inventories are handled, for such case from the development of the survey and the five selected MSMEs. The second is to identify the shortcomings of the inventories studied, and the third to determine the inventory model to be used and to implement it in Mipymes.","authors":["José Eduardo Martínez Orrego","Ruthber Rodriguez","Jorge Bernardo Ramirez Zarta","Jorge Luis Lebro Burgos"],"meta":["March 2018International Journal of Applied Engineering Research 13(6)","Projects: Implementation of a Model of Inventories in Five Mipymes in the City of Neiva, Republic of ColombiaProduction control"],"references":["324091535_Electrogenic_Biodegradation_Study_of_the_Carbofuran_Insecticide_in_Soil","322926365_Extraction_in_Laboratory_of_Heavy_Metals_Through_Rhizofiltration_using_the_Plant_Zea_Mays_maize","322687430_A_consistent_methodology_for_the_development_of_inverse_and_direct_kinematics_of_robust_industrial_robots","322594033_Dental_Caries_Social_Problem_in_School_Children_Aged_5-14_Years_from_Formal_Educational_Institutions_in_Huila_Colombia","322526369_Real_Process_Characteristic_Capacity_Weight_in_the_Product_500_Grams_in_a_Rice_Mill","321913209_Design_of_a_gas_sensor_based_on_the_concept_of_digital_interconnection_IoT_for_the_emergency_broadcast_system","321913089_Case_Study_of_Energy_Management_Model_in_the_Threshing_System_for_the_Production_of_White_Rice","321743256_Generation_and_Control_of_Basic_Geometric_Trajectories_for_a_Robot_Manipulator_Using_CompactRIOR","319523644_Audio_signals_processing_with_digital_filters_implementation_using_MyDSP","318600784_Natural_Reserves_of_Civil_Society_as_Strategic_Ecosystems_Case_Study_Meremberg"]}