{"id":"323747026_Detecting_sequences_of_system_states_in_temporal_networks","abstract":"Many time-evolving systems in nature, society and technology leave traces of the interactions within them. These interactions form temporal networks that reflect the states of the systems. In this work, we pursue a coarse-grained description of these systems by proposing a method to assign discrete states to the systems and inferring the sequence of such states from the data. Such states could, for example, correspond to a mental state (as inferred from neuroimaging data) or the operational state of an organization (as inferred by interpersonal communication). Our method combines a graph distance measure and hierarchical clustering. Using several empirical data sets of social temporal networks, we show that our method is capable of inferring the system's states such as distinct activities in a school and a weekday state as opposed to a weekend state. We expect the methods to be equally useful in other settings such as temporally varying protein interactions, ecological interspecific interactions, functional connectivity in the brain and adaptive social networks.","authors":["Naoki Masuda","Petter Holme"],"meta":["January 2019Scientific Reports 9(1)","DOI:10.1038/s41598-018-37534-2"],"references":["345726206_Network_dynamics_in_the_healthy_and_epileptic_developing_brain","331512748_Spectral_Dimension_Reduction_of_Complex_Dynamical_Networks","322991208_Fluctuating_interaction_network_and_time-varying_stability_of_a_natural_fish_community","319992671_Network_dynamics_in_the_healthy_and_epileptic_developing_brain","318359958_Community_Discovery_in_Dynamic_Networks_A_Survey","317732109_Concept_Drift_and_Anomaly_Detection_in_Graph_Streams","321595981_A_Graph-Theoretic_Approach_to_Enterprise_Network_Dynamics","320211905_Temporal_Network_Epidemiology","318829795_Fast_Change_Point_Detection_on_Dynamic_Social_Networks","318227799_Comparing_test-retest_reliability_of_dynamic_functional_connectivity_methods"]}