{"id":"323796674_Fast_End-to-End_Trainable_Guided_Filter","abstract":"Image processing and pixel-wise dense prediction have been advanced by harnessing the capabilities of deep learning. One central issue of deep learning is the limited capacity to handle joint upsampling. We present a deep learning building block for joint upsampling, namely guided filtering layer. This layer aims at efficiently generating the high-resolution output given the corresponding low-resolution one and a high-resolution guidance map. The proposed layer is composed of a guided filter, which is reformulated as a fully differentiable block. To this end, we show that a guided filter can be expressed as a group of spatial varying linear transformation matrices. This layer could be integrated with the convolutional neural networks (CNNs) and jointly optimized through end-to-end training. To further take advantage of end-to-end training, we plug in a trainable transformation function that generates task-specific guidance maps. By integrating the CNNs and the proposed layer, we form deep guided filtering networks. The proposed networks are evaluated on five advanced image processing tasks. Experiments on MIT-Adobe FiveK Dataset demonstrate that the proposed approach runs 10-100 times faster and achieves the state-of-the-art performance. We also show that the proposed guided filtering layer helps to improve the performance of multiple pixel-wise dense prediction tasks. The code is available at https://github.com/wuhuikai/DeepGuidedFilter.","authors":["Huikai Wu","Shuai Zheng","Junge Zhang","Kaiqi Huang"],"meta":["March 2018"],"references":["320966887_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","314634750_Locality-Sensitive_Deconvolution_Networks_with_Gated_Fusion_for_RGB-D_Indoor_Semantic_Segmentation","311610242_Non-local_Image_Dehazing","310610633_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","322058824_Fast_Image_Processing_with_Fully-Convolutional_Networks","320968192_Deeply_Supervised_Salient_Object_Detection_with_Short_Connections","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","318337546_Deep_Bilateral_Learning_for_Real-Time_Image_Enhancement","313634582_Image_smoothing_via_L0_gradient_minimization","311229546_Fast_local_Laplacian_filters_Theory_and_applications"]}