{"id":"323775211_Os_fraseologismos_no_portugues_falado_no_Nordeste_brasileiro_unidades_fraseologicas_para_designar_a_pessoa_que_nao_gosta_de_gastar_seu_dinheiro","abstract":"Este trabalho apresenta resultados de investigação sobre a fraseologia referente ao campo lexical convívio e comportamento social com base nos dados do Projeto Atlas Linguístico do Brasil (Projeto ALiB). Está vinculado ao Projeto VALEXTRA (Variação lexical: teorias, recursos e aplicações): do condicionamento lexical às constrições pragmáticas, convênio CAPES/COFECUB 838/15 celebrado entre a Universidade Federal da Bahia e a Universidade Paris 13 (Laboratoire Lexiques Dictionnaires Informatique). Busca-se, a partir do material coletado na pesquisa, apresentar um estudo sobre a presença de fraseologismos nas entrevistas dos informantes, oriundos das capitais brasileiras, estratificados por sexo – homem e mulher – faixa etária – de 18 a 30 anos e de 50 a 65 anos – e nível de escolaridade – fundamental e universitário. O termo fraseologismo está sendo aqui concebido como o fenômeno da linguagem que se exprime através de associações sintagmáticas recorrentes (MEJRI, 1997). Parte-se do princípio de que as unidades fraseológicas são combinações de unidades léxicas, relativamente estáveis, com certo grau de idiomaticidade, formadas por duas ou mais palavras, que constituem a competência discursiva dos falantes, em língua materna, segunda ou estrangeira, utilizadas convencionalmente em contextos precisos, com objetivos específicos, como, por exemplo, as respostas que se obtém para a questão referente à pessoa sovina “como se chama a pessoa que não gosta de gastar seu dinheiro e, às vezes, até passa dificuldades para não gastar?” – mão de vaca, mão-fechada, pão-duro e unha de fome. No que diz respeito aos fraseologismos analisados, podem-se fazer algumas considerações: as criações lexicais analisadas contemplam a polilexicalidade; as unidades fraseológicas refletem uma expressão cristalizada, cujo sentido geral não é literal. Demonstra-se também o uso das expressões fraseológicas no território brasileiro relacionado aos fatores sexo, faixa etária e nível de escolaridade. Assim, as designações enfocadas possibilitam a documentação da diversidade lexical do português falado no Brasil, seguindo os princípios da Geolinguística Pluridimensional Contemporânea em que o registro segue os parâmetros diatópicos, diageracionais, diassexuais e diastráticos.","authors":["Marcela Moura Torres Paim","Silvana Ribeiro"],"meta":["March 2018","DOI:10.13102/cl.v19i4Especial.2860"],"references":["270997369_Le_figement_lexical_descriptions_linguistiques_et_structuration_semantique"]}