{"id":"323796282_An_application_of_cascaded_3D_fully_convolutional_networks_for_medical_image_segmentation","abstract":"Recent advances in 3D fully convolutional networks (FCN) have made it feasible to produce dense voxel-wise predictions of volumetric images. In this work, we show that a multi-class 3D FCN trained on manually labeled CT scans of several anatomical structures (ranging from the large organs to thin vessels) can achieve competitive segmentation results, while avoiding the need for handcrafting features or training class-specific models.\nTo this end, we propose a two-stage, coarse-to-fine approach that will first use a 3D FCN to roughly define a candidate region, which will then be used as input to a second 3D FCN. This reduces the number of voxels the second FCN has to classify to ∼10% and allows it to focus on more detailed segmentation of the organs and vessels.\nWe utilize training and validation sets consisting of 331 clinical CT images and test our models on a completely unseen data collection acquired at a different hospital that includes 150 CT scans, targeting three anatomical organs (liver, spleen, and pancreas). In challenging organs such as the pancreas, our cascaded approach improves the mean Dice score from 68.5 to 82.2%, achieving the highest reported average score on this dataset. We compare with a 2D FCN method on a separate dataset of 240 CT scans with 18 classes and achieve a significantly higher performance in small organs and vessels. Furthermore, we explore fine-tuning our models to different datasets.\nOur experiments illustrate the promise and robustness of current 3D FCN based semantic segmentation of medical images, achieving state-of-the-art results.","authors":["Holger Reinhard Roth","Hirohisa Oda","Xiangrong Zhou","Natsuki Shimizu"],"meta":["March 2018Computerized medical imaging and graphics: the official journal of the Computerized Medical Imaging Society 66","DOI:10.1016/j.compmedimag.2018.03.001"],"references":["318013361_On_the_Compactness_Efficiency_and_Representation_of_3D_Convolutional_Networks_Brain_Parcellation_as_a_Pretext_Task","317087807_Anatomically_Constrained_Neural_Networks_ACNN_Application_to_Cardiac_Image_Enhancement_and_Segmentation","313072108_Regression_Forest-Based_Atlas_Localization_and_Direction_Specific_Atlas_Generation_for_Pancreas_Segmentation","312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","319461555_Towards_Image-Guided_Pancreas_and_Biliary_Endoscopy_Automatic_Multi-organ_Segmentation_on_Abdominal_CT_with_Dense_Dilated_Networks","318635961_Deep_learning_of_the_sectional_appearances_of_3D_CT_images_for_anatomical_structure_segmentation_based_on_an_FCN_voting_method","316806141_3D_Deeply_Supervised_Network_for_Automated_Segmentation_of_Volumetric_Medical_Images","313074390_Three-Dimensional_CT_Image_Segmentation_by_Combining_2D_Fully_Convolutional_Network_with_3D_Majority_Voting","313072928_Automatic_Liver_and_Lesion_Segmentation_in_CT_Using_Cascaded_Fully_Convolutional_Neural_Networks_and_3D_Conditional_Random_Fields","313072707_3D_U-Net_Learning_Dense_Volumetric_Segmentation_from_Sparse_Annotation"]}