{"id":"323779867_Wrist_and_Arm_Body_Surface_Bipolar_ECG_Leads_Signal_and_Sensor_Study_for_Long-term_Rhythm_Monitoring","abstract":"With cardiovascular disease and heart arrhythmias continuing to have a high mortality rate, it is important to monitor the electrocardiogram (ECG) signal in a non-invasive, long-term wearable device. In this study we investigate sensors and the ECG signal-to-noise ratio map along the left arm, for wearable arm-ECG monitoring devices. In a pilot study, 11 subjects attending a cardiology outpatient clinic, far-field left-arm ECG recordings included signals from a combination of dry and special pre-gelled BIS-Quatro TM sensor system, axially and transversally oriented along the left arm: on the wrist, upper forearm and upper arm. A total of 10 bipolar leads were recorded simultaneously (using 18 acquisition channels). Each subject was recorded for 8 minutes at rest, using the bio-potential acquisition system; all data was imported and processed using Matlab and MS Excel. Analysis was completed to evaluate signal-to-noise ratio (SNR) distribution maps. An average ECG SNR figure of 42.63 was found in the dry-electrode positioned on the upper arm bipolar lead, whilst the SNR ratio positioned on the wrist was 13.14. Similar to this, in the BIS-electrodes (gelled), there was an average ECG SNR figure of 89.25 on the upper arm and of 5.18 positioned on the wrist. This study clinically evidenced the ECG S/N map on the left arm. It reveals that bipolar arm-ECG SNR are consistently stronger on the upper arm, when recorded with the gelled BIS sensors. .","authors":["Omar J Escalona","Louise Mcfrederick","Maira Borges","Pedro Linares Herrera"],"meta":["March 2018","DOI:10.22489/CinC.2017.071-458","Conference: Computing in CardiologyAt: Rennes-France"],"references":["260703868_Arm_and_wrist_surface_potential_mapping_for_wearable_ECG_rhythm_recording_devices_A_pilot_clinical_study","3778998_Design_for_wearability","312426183_A_Clinical_Perspective_on_Sudden_Cardiac_Death","309332985_Electrocardiographic_waveforms_fitness_check_device_technique_for_sudden_cardiac_death_risk_screening","14968607_Fast_and_reliable_QRS_alignment_technique_for_high-frequency_analysis_of_signal-averaged_ECG","8579255_Insertable_Loop_Recorder_Use_for_Detection_of_Intermittent_Arrhythmias"]}