{"id":"323746963_Dealing_with_Unknown_Unknowns_Identification_and_Selection_of_Minimal_Sensing_for_Fractional_Dynamics_with_Unknown_Inputs","abstract":"This paper focuses on analysis and design of time-varying complex networks having fractional order dynamics. These systems are key in modeling the complex dynamical processes arising in several natural and man made systems. Notably, examples include neurophysiological signals such as electroencephalogram (EEG) that captures the variation in potential fields, and blood oxygenation level dependent (BOLD) signal, which serves as a proxy for neuronal activity. Notwithstanding, the complex networks originated by locally measuring EEG and BOLD are often treated as isolated networks and do not capture the dependency from external stimuli, e.g., originated in subcortical structures such as the thalamus and the brain stem. Therefore, we propose a paradigm-shift towards the analysis of such complex networks under unknown unknowns (i.e., excitations). Consequently, the main contributions of the present paper are threefold: (i) we present an alternating scheme that enables to determine the best estimate of the model parameters and unknown stimuli; (ii) we provide necessary and sufficient conditions to ensure that it is possible to retrieve the state and unknown stimuli; and (iii) upon these conditions we determine a small subset of variables that need to be measured to ensure that both state and input can be recovered, while establishing sub-optimality guarantees with respect to the smallest possible subset. Finally, we present several pedagogical examples of the main results using real data collected from an EEG wearable device.","authors":["Gaurav Gupta","Sergio Pequito","Paul Bogdan"],"meta":["March 2018","DOI:10.23919/ACC.2018.8430866","Conference: ACC"],"references":["318369148_Multi-fractal_characterization_of_bacterial_swimming_dynamics_a_case_study_on_real_and_simulated_Serratia_marcescens","280018089_Linear_Systems_with_Sparse_Inputs_Observability_and_Input_Recovery","317910730_Observer_Design_for_a_Class_of_Nonlinear_Fractional-Order_Systems_with_Unknown_Input","313691182_Minimum_number_of_sensors_to_ensure_observability_of_physiological_systems_A_case_study","301232370_A_Spatio-Temporal_Fractal_Model_for_a_CPS_Approach_to_Brain-Machine-Body_Interfaces","297655374_Novel_fractional_order_particle_swarm_optimization","292251882_Fractional_Dynamics_and_Control","273047476_Chaotic_and_Fractal_Dynamics_An_Introduction_for_Applied_Scientists_and_Engineers","268688503_On_the_convergence_properties_of_the_EM_algorithm","265852983_A_novel_approach_to_unknown_input_filter_design_for_discrete-time_linear_systems"]}