{"id":"323733667_Evolving_Simple_Models_of_Diverse_Intrinsic_Dynamics_in_Hippocampal_Neuron_Types","abstract":"The diversity of intrinsic dynamics observed in neurons may enhance the computations implemented in the circuit by enriching network-level emergent properties such as synchronization and phase locking. Large-scale spiking network models of entire brain regions offer a platform to test theories of neural computation and cognitive function, providing useful insights on information processing in the nervous system. However, a systematic in-depth investigation requires network simulations to capture the biological intrinsic diversity of individual neurons at a sufficient level of accuracy. The computationally efficient Izhikevich model can reproduce a wide range of neuronal behaviors qualitatively. Previous studies using optimization techniques, however, were less successful in quantitatively matching experimentally recorded voltage traces. In this article, we present an automated pipeline based on evolutionary algorithms to quantitatively reproduce features of various classes of neuronal spike patterns using the Izhikevich model. Employing experimental data from Hippocampome.org, a comprehensive knowledgebase of neuron types in the rodent hippocampus, we demonstrate that our approach reliably fit Izhikevich models to nine distinct classes of experimentally recorded spike patterns, including delayed spiking, spiking with adaptation, stuttering, and bursting. Importantly, by leveraging the parameter-exploration capabilities of evolutionary algorithms, and by representing qualitative spike pattern class definitions in the error landscape, our approach creates several suitable models for each neuron type, exhibiting appropriate feature variabilities among neurons. Moreover, we demonstrate the flexibility of our methodology by creating multi-compartment Izhikevich models for each neuron type in addition to single-point versions. Although the results presented here focus on hippocampal neuron types, the same strategy is broadly applicable to any neural systems.","authors":["Siva Venkadesh","Alexander Komendantov","Stanislav Listopad","Eric 'Siggy Scott"],"meta":["March 2018Frontiers in Neuroinformatics 12","DOI:10.3389/fninf.2018.00008","Project: Doctoral research"],"references":["301899075_Automated_point-neuron_simplification_of_data-driven_microcircuit_models","280569688_CARLsim_3_A_User-Friendly_and_Highly_Optimized_Library_for_the_Creation_of_Neurobiologically_Detailed_Spiking_Neural_Networks","278792695_Automated_High-Throughput_Characterization_of_Single_Neurons_by_Means_of_Simplified_Spiking_Models","313558087_A_quantitative_description_of_membrane_current_and_its_application_to_conduction_and_excitation_in_nerve","307507499_An_Evolutionary_Framework_for_Replicating_Neurophysiological_Data_with_Spiking_Neural_Networks","301233029_Resonate-and-fire_neurons","284816672_Multi-objective_optimization","282667245_Reconstruction_and_Simulation_of_Neocortical_Microcircuitry","278731322_A_Million-Plus_Neuron_Model_of_the_Hippocampal_Dentate_Gyrus_Critical_Role_for_Topography_in_Determining_Spatio-Temporal_Network_Dynamics","278697010_Multi-objective_Optimization"]}