{"id":"323779790_Identifying_skylines_in_cloud_databases_with_incomplete_data","abstract":"Skyline queries is a rich area of research in the database\ncommunity. Due to its great benefits, it has been integrated\ninto many database applications including but not limited to\npersonalized recommendation, multi-objective, decision support\nand decision-making systems. Many variations of skyline\ntechnique have been proposed in the literature addressing\nthe issue of handling skyline queries in incomplete database.\nNevertheless, these solutions are designed to fit with centralized\nincomplete database (single access). However, in many realworld database systems, this might not be the case, particularly\nfor a database with a large amount of incomplete data distributed\nover various remote locations such as cloud databases. It is\ninadequate to directly apply skyline solutions designed for the\ncentralized incomplete database to work on cloud due to the\nprohibitive cost. Thus, this paper introduces a new approach\ncalled Incomplete-data Cloud Skylines (ICS) aiming at processing\nskyline queries in cloud databases with incomplete data. This\napproach emphasizes on reducing the amount of data transfer and domination tests during skyline process. It incorporates sorting\ntechnique that assists in arranging the data items in a way where\ndominating data items will be placed at the top of the list helping\nin eliminate dominated data items. Besides, ICS also employs\na filtering technique to prune the dominated data items before\napplying skyline technique. It comprises a technique named local\nskyline joiner that helps in reducing the amount of data transfer\nbetween datacenters when deriving the final skylines. It limit\nthe amount of data items to be transferred to only those local\nskylines of each relation. A comprehensive experiment have\nbeen performed on both synthetic and real-life datasets, which\ndemonstrate the effectiveness and versatility of our approach in\ncomparison to the current existing approaches. We argue that our\napproach is practical and can be adopted in many contemporary\ncloud database systems with incomplete data to process skyline\nqueries.","authors":["Yonis Gulzar","Ali Amer Alwan","Norsaremah Salleh","Imad Fakhri Al Shaikhli"],"meta":["January 2019Journal of Information and Communication Technology 18(1):19-34","DOI:10.32890/jict2019.18.1.2","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["321488533_A_Model_for_Processing_Skyline_Queries_in_Crowd-sourced_Databases","321026185_Processing_Skyline_Queries_in_Incomplete_Data_Issues_Challenges_and_Future_Trends","317011909_Skyline_Query_Processing_for_Incomplete_Data_in_Cloud_Environment","305080534_Processing_skyline_queries_in_incomplete_distributed_databases","294288292_An_Efficient_Approach_for_Processing_Skyline_Queries_in_Incomplete_Multidimensional_Database","274175108_Skyline_Sets_Queries_for_Incomplete_Data","272785531_On_Efficient_k-Skyband_Query_Processing_over_Incomplete_Data","313830633_Skyline_Preference_Query_Based_on_Massive_and_Incomplete_Dataset","303746026_Efficient_Skyline_Query_over_Multiple_Relations","302476677_Optimizing_Skyline_Queries_over_Incomplete_Data"]}