{"id":"323887640_Quality_of_Experience_QoE-aware_placement_of_applications_in_Fog_computing_environments","abstract":"Fog computing aims at offering Cloud like services at the network edge for supporting Internet of Things (IoT) applications with low latency response requirements. Hierarchical, distributed and heterogeneous nature of computational instances make application placement in Fog a challenging task. Diversified user expectations and different features of IoT devices also intensify the application placement problem. Placement of applications to compatible Fog instances based on user expectations can enhance Quality of Experience (QoE) regarding the system services. In this paper, we propose a QoE-aware application placement policy that prioritizes different application placement requests according to user expectations and calculates the capabilities of Fog instances considering their current status. In Fog computing environment, it also facilitates placement of applications to suitable Fog instances so that user QoE is maximized in respect of utility access, resource consumption and service delivery. The proposed policy is evaluated by simulating a Fog environment using iFogSim. Experimental results indicate that the policy significantly improves data processing time, network congestion, resource affordability and service quality.","authors":["Md. Redowan Mahmud","Satish Narayana Srirama","Kotagiri Ramamohanarao","Rajkumar Buyya"],"meta":["March 2018Journal of Parallel and Distributed Computing 132","DOI:10.1016/j.jpdc.2018.03.004"],"references":["320253062_Measurement-based_scheduler_for_multi-class_QoE_optimization_in_wireless_networks","318667849_Resource_aware_placement_of_IoT_application_modules_in_Fog-Cloud_Computing_Paradigm","314163041_Improving_Quality_of_Experience_in_Future_Wireless_Access_Networks_through_Fog_Computing","313881814_Towards_QoS-aware_Fog_Service_Placement","319992979_Indie_Fog_An_Efficient_Fog-Computing_Infrastructure_for_the_Internet_of_Things","317243750_Do_we_all_really_know_what_a_Fog_Node_is_Current_trends_towards_an_open_definition","316722011_QoS-Aware_Deployment_of_IoT_Applications_Through_the_Fog","313451017_On-the-Fly_QoE-Aware_Transcoding_in_the_Mobile_Edge","312114411_SARS_A_novel_QoE_based_service-aware_resource_scheduling_scheme_in_wireless_network","312077304_Feasibility_of_Fog_Computing_Deployment_based_on_Docker_Containerization_over_RaspberryPi"]}