{"id":"323896444_Prospects_and_opportunities_for_visual_programming_technologies_and_tools_application_in_educating_at_school","abstract":"Article depicts typical problems that students encounter when mastering programming. For each problem, a number of existing specialized software environments offering a solution is displayed. Analyses of programming environments elements and the selection of those who are directly involved in solving problems are conducted. In the end, aggregation of the best solution is carried out and an assumption about the possibility of combining the best elements is made. Initially, the school computer science course was focused on the formation of computer programming and computer skills. Now the main part of the course is devoted to the study of applied software and information technologies. At the same time, classical programming languages developed in the last century are used for learning more. The first successful attempt to create an alternative programming language that could act as an educational tool is the Logo language. A similar display method can be found in many programming environments, where the user does not need to have programming skills, but be able to make a workable algorithm. This allows you not to be distracted by programming language, but to design a program from blocks. Each of the visual programming environments mentioned in the article is not without a number of drawbacks. However, even with this state of affairs, there is a tendency to expand the use of visual programming languages in teaching.","authors":["E.M. Kagan"],"meta":["December 2018RUDN Journal of Informatization in Education 15(1):18-28","DOI:10.22363/2312-8631-2018-15-1-18-28"],"references":["283427515_Programming_in_K-12_Science_Classrooms","262174428_Using_app_inventor_in_a_K-12_summer_camp","243575656_Evolution_of_Novice_Programming_Environments_The_Structure_Editors_of_Carnegie_Mellon_University","236688216_From_Agents_to_Continuous_Change_via_Aesthetics_Learning_Mechanics_with_Visual_Agentbased_Computational_Modeling","234796737_Learning_to_Program_Learning_to_Construct_Mechanisms_and_Explanations","288883999_Programming_by_rehearsal","238741064_Pygmalion_a_computer_program_to_model_and_stimulate_creative_thought","232616231_LEGOsheets_a_rule-based_programming_simulation_and_manipulation_environment_for_the_LEGO_Programmable_Brick","228328529_Mindstorms_Children_Computers_and_Powerful_Ideas"]}