{"id":"323855899_Proportional_Selection_of_Mobile_Relays_in_Millimeter-Wave_Heterogeneous_Networks","abstract":"Millimeter-wave (mmWave) communications are capable of providing gigabit-per-second data rate for future wireless networks. However, mmWave links have the major issues of high propagation loss and shadowing. In access networks, due to the propagation loss and shadowing, a mobile node may fail to communicate directly with its base station. In that case, one of the practical solutions is to communicate via a relay. This paper considers a heterogeneous access network in which if the access link of a mobile node suffers from an outage, some other idle mobile nodes are selected to act as relays. The links from these relays to the mobile node are device-to-device connections. The relay selection problem is formulated as a coalitional game in which each outage link corresponds to a coalition, while each mobile relay is a player. We propose the proportional switching algorithm that allows the players to switch among the coalitions sequentially until stability is reached. Compared to the conventional approaches, the proposed algorithm can obtain the proportionally fair solution of the mobile nodes' performance. The mathematical analysis shows that the switching algorithm always converges to the stable solution. The simulation results verify that analysis; in the meantime, those results provide the evaluations for the proportionality and performance of the proposed algorithm. The algorithm is shown to achieve the proportionally fair results, while producing significant improvements in system performance compared to the non-cooperative approach and non-proportional algorithms.","authors":["Minh-Thuyen Thi","Thong Huynh","won-Joo Hwang"],"meta":["March 2018IEEE Access 6(1):1-11","DOI:10.1109/ACCESS.2018.2812736"],"references":["323856222_Stability_and_Optimality_of_Coalition_Formation_Game_for_Resource_Allocation_in_Device-to-Device_Underlaying_Cellular_Networks","316553533_Coalition_Formation_Game_for_Joint_Power_Control_and_Fair_Channel_Allocation_in_Device-to-Device_Communications_Underlaying_Cellular_Networks","291029506_On_the_Performance_of_Relay_Aided_Millimeter_Wave_Networks","283326900_A_Constrained_Coalition_Formation_Game_for_Multihop_D2D_Content_Uploading","310597439_Improving_the_Coverage_of_Millimeter-Wave_mmWave_Cellular_Networks_using_Device-to-Device_Relays","301843504_Exploiting_Multi-Hop_Relaying_to_Overcome_Blockage_in_Directional_mmWave_Small_Cells","292858835_Game_Theory_Applications_in_Network_Design","285005845_Device-to-Device_Communication_in_LTE-Advanced_Networks_A_Survey","283648887_Distributed_Resource_Allocation_for_D2D_Communications_Underlay_Cellular_Networks","282691937_Optimal_Relay_Probing_in_Millimeter-Wave_Cellular_Systems_With_Device-to-Device_Relaying"]}