{"id":"323854848_Entre_as_dimensoes_escondidas_do_letramento_academico_e_os_presumidos_sociais_do_genero_artigo_de_pesquisa_nas_diretrizes_para_autores_de_periodicos_em_ciencia_da_computacao","abstract":"O presente trabalho analisou textos de diretrizes para autores de seis periódicos em Ciência da Computação, com o objetivo de verificar a existência de dimensões “escondidas” do letramento, as quais podem ocultar informações relevantes para uma melhor elaboração dos textos de acordo com o esperado pelas revistas. A partir de uma análise etnográfica discursiva, a qual possibilitou a compreensão dos conceitos de língua, texto e gênero que fundamentam as práticas de letramento das revistas, alguns ocultamentos foram identificados e relacionados a presumidos sociais do gênero artigo de pesquisa. A análise revelou, dentre outras coisas, que os periódicos concentram as orientações, em grande parte, nos aspectos formais e estruturais do texto, deixando “escondidas” dimensões do letramento relacionadas a conteúdo, retórica e ideologia, por exemplo. Embasados por uma concepção de língua, texto e gênero que se aproxima à abordagem de ensino de escrita identificada por Lea e Street (1998) como Socialização Acadêmica, esses periódicos partem do presumido de que as especificidades do discurso acadêmico são únicas e transferíveis de gênero para gênero, independentemente dos eventos de letramento em questão. Assim, contam com um conhecimento do letramento acadêmico que pesquisadores menos experientes podem ainda não reconhecer, dificultando a iniciação desses novatos nas discussões acadêmicas.","authors":["Bruna Gabriela Augusto Marçal Vieira"],"meta":["August 2017Raído 11(27):105","DOI:10.30612/raido.v11i27.5642"],"references":["305421676_A_disciplina_Metodologia_Cientifica_-_Redacao_e_Documentacao_Tecnica_e_a_promocao_do_letramento_academico_de_graduandos_em_Ciencia_da_Computacao_uma_analise_qualitativa","277035714_A_IMPORTANCIA_DO_CONCEITO_DE_GENEROS_DISCURSIVOS_NO_ENSINO_DE_REDACAO_ACADEMICA","272745636_Letramentos_academicos_e_multimodalidade_em_contexto_de_EaD_semipresencial","327929445_LETRAMENTO_E_FORMACAO_UNIVERSITARIA_Formar_para_a_escrita_e_pela_escrita","307701739_AS_PERSPECTIVAS_ETNOGRAFICA_E_DISCURSIVA_NO_ENSINO_DA_ESCRITA_O_EXEMPLO_DE_TEXTOS_DE_PRE-UNIVERSITARIOS","285113355_7_Whose_'Common_Sense'_Essayist_literacy_and_the_institutional_practice_of_mystery","279236580_The_Dialogic_Imagination_Austin","276000144_Writing_and_Identity_The_Discoursal_Construction_of_Identity_in_Academic_Writing","275786680_Literacy_in_Theory_and_Practice","238750475_Analysing_genre_Language_use_in_professional_settings","232676401_Publish_or_Perish","220017627_Student_Writing_in_Higher_Education_An_Academic_Literacies_Approach"]}