{"id":"323860348_Running_out_of_STEM_a_comparative_study_across_STEM_majors_of_college_students_at-risk_of_dropping_out_early","abstract":"Higher education institutions in the United States and across the Western world face a critical problem of attrition of college students and this problem is particularly acute within the Science, Technology, Engineering, and Mathematics (STEM) fields. Students are especially vulnerable in the initial years of their academic programs; more than 60% of the dropouts occur in the first two years. Therefore, early identification of at-risk students is crucial for a focused intervention if institutions are to support students towards completion. In this paper we developed and evaluated a survival analysis framework for the early identification of students at the risk of dropping out. We compared the performance of survival analysis approaches to other machine learning approaches including logistic regression, decision trees and boosting. The proposed methods show good performance for early prediction of at-risk students and are also able to predict when a student will dropout with high accuracy. We performed a comparative analysis of nine different majors with varying levels of academic rigor, challenge and student body. This study enables advisors and university administrators to intervene in advance to improve student retention.","authors":["Yujing Chen","Aditya Johri","Huzefa Rangwala"],"meta":["March 2018","DOI:10.1145/3170358.3170410","Conference: the 8th International Conference"],"references":["307168000_Survival_Analysis_based_Framework_for_Early_Prediction_of_Student_Dropouts","272558041_College_Persistence_Structural_Equations_Modeling_Test_of_an_Integrated_Model_of_Student_Retention","271828374_Indicators_of_success_in_STEM_majors_A_cohort_study","269475545_Predicting_Student_Performance_by_Using_Data_Mining_Methods_for_Classification","268424401_Why_Students_Drop_Out_of_School_A_Review_of_25_Years_of_Research","306199590_Research_and_practice_of_student_retention_What_next_Journal_of_College_Student_Retention_Research","285481515_Retaining_students_in_science_technology_engineering_and_mathematics_STEM_majors","272177888_Leaving_Engineering_A_Multi-Year_Single_Institution_Study","271729352_Predicting_Student_Attrition_with_Data_Mining_Methods","264784492_Predictors_of_academic_achievement_and_retention_among_college_freshmen_A_longitudinal_study"]}