{"id":"323879411_Automatic_Semantic_Segmentation_of_Brain_Gliomas_from_MRI_Images_Using_a_Deep_Cascaded_Neural_Network","abstract":"Brain tumors can appear anywhere in the brain and have vastly different sizes and morphology. Additionally, these tumors are often diffused and poorly contrasted. Consequently, the segmentation of brain tumor and intratumor subregions using magnetic resonance imaging (MRI) data with minimal human interventions remains a challenging task. In this paper, we present a novel fully automatic segmentation method from MRI data containing in vivo brain gliomas. This approach can not only localize the entire tumor region but can also accurately segment the intratumor structure. The proposed work was based on a cascaded deep learning convolutional neural network consisting of two subnetworks: (1) a tumor localization network (TLN) and (2) an intratumor classification network (ITCN). The TLN, a fully convolutional network (FCN) in conjunction with the transfer learning technology, was used to first process MRI data. The goal of the first subnetwork was to define the tumor region from an MRI slice. Then, the ITCN was used to label the defined tumor region into multiple subregions. Particularly, ITCN exploited a convolutional neural network (CNN) with deeper architecture and smaller kernel. The proposed approach was validated on multimodal brain tumor segmentation (BRATS 2015) datasets, which contain 220 high-grade glioma (HGG) and 54 low-grade glioma (LGG) cases. Dice similarity coefficient (DSC), positive predictive value (PPV), and sensitivity were used as evaluation metrics. Our experimental results indicated that our method could obtain the promising segmentation results and had a faster segmentation speed. More specifically, the proposed method obtained comparable and overall better DSC values (0.89, 0.77, and 0.80) on the combined (HGG + LGG) testing set, as compared to other methods reported in the literature. Additionally, the proposed approach was able to complete a segmentation task at a rate of 1.54 seconds per slice.","authors":["Shaoguo Cui","Lei Mao","Jingfeng Jiang","Chang Liu"],"meta":["March 2018Journal of Healthcare Engineering 2018(1):1-14","DOI:10.1155/2018/4940593"],"references":["318168153_Automatic_Brain_Tumor_Detection_and_Segmentation_Using_U-Net_Based_Fully_Convolutional_Networks","316859748_Automatic_Brain_Tumor_Detection_and_Segmentation_Using_U-Net_Based_Fully_Convolutional_Networks","313781923_Brain_tumor_classification_from_multi-modality_MRI_using_wavelets_and_machine_learning","312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","310235567_3-D_Convolutional_Neural_Networks_for_Glioblastoma_Segmentation","309457251_Structured_prediction_with_convolutional_neural_networks_for_multimodal_brain_tumor_segmentation","320968234_Joint_Sequence_Learning_and_Cross-Modality_Convolution_for_3D_Biomedical_Segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770174_Practical_recommendations_for_gradient-based_training_of_deep_architectures","315867463_On_hierarchical_brain_tumor_segmentation_in_MRI_using_fully_convolutional_neural_networks_A_preliminary_study"]}