{"id":"323831510_Minimizing_message_size_in_stochastic_communication_patterns_fast_self-stabilizing_protocols_with_3_bits","abstract":"This paper considers the basic (Formula presented.) model of communication, in which in each round, each agent extracts information from few randomly chosen agents. We seek to identify the smallest amount of information revealed in each interaction (message size) that nevertheless allows for efficient and robust computations of fundamental information dissemination tasks. We focus on the Majority Bit Dissemination problem that considers a population of n agents, with a designated subset of source agents. Each source agent holds an input bit and each agent holds an output bit. The goal is to let all agents converge their output bits on the most frequent input bit of the sources (the majority bit). Note that the particular case of a single source agent corresponds to the classical problem of Broadcast (also termed Rumor Spreading). We concentrate on the severe fault-tolerant context of self-stabilization, in which a correct configuration must be reached eventually, despite all agents starting the execution with arbitrary initial states. In particular, the specification of who is a source and what is its initial input bit may be set by an adversary. We first design a general compiler which can essentially transform any self-stabilizing algorithm with a certain property (called “the bitwise-independence property”) that uses (Formula presented.)-bits messages to one that uses only (Formula presented.)-bits messages, while paying only a small penalty in the running time. By applying this compiler recursively we then obtain a self-stabilizing Clock Synchronization protocol, in which agents synchronize their clocks modulo some given integer T, within (Formula presented.) rounds w.h.p., and using messages that contain 3 bits only. We then employ the new Clock Synchronization tool to obtain a self-stabilizing Majority Bit Dissemination protocol which converges in (Formula presented.) time, w.h.p., on every initial configuration, provided that the ratio of sources supporting the minority opinion is bounded away from half. Moreover, this protocol also uses only 3 bits per interaction.","authors":["Lucas Boczkowski","Amos Korman","Emanuele Natale"],"meta":["June 2019Distributed Computing 32(4)","DOI:10.1007/s00446-018-0330-x"],"references":["321895476_Self-stabilizing_repeated_balls-into-bins","312262352_Individual_versus_collective_cognition_in_social_insects","307630468_Stable_leader_election_in_population_protocols_requires_linear_time","282863695_Fast_Consensus_for_Voting_on_General_Expander_Graphs","312413193_Minimizing_Message_Size_in_Stochastic_Communication_Patterns_Fast_Self-Stabilizing_Protocols_with_3_bits","305660596_Brief_Announcement_Self-stabilizing_Clock_Synchronization_with_3-bit_Messages","304263470_Probability_1_Computation_with_Chemical_Reaction_Networks","301846483_Efficient_k-Party_Voting_with_Two_Choices","297764937_Synchronous_counting_and_computational_algorithm_design","281788895_Speed_Faults_in_Computation_by_Chemical_Reaction_Networks","275669290_Clock_Synchronization_and_Distributed_Estimation_in_Highly_Dynamic_Networks_An_Information_Theoretic_Approach","281312251_Stabilizing_Consensus_with_Many_Opinions","280970262_Efficient_Counting_with_Optimal_Resilience","279258484_Breathe_before_speaking_Efficient_information_dissemination_despite_noisy_limited_and_anonymous_communication","274012289_Towards_Optimal_Synchronous_Counting"]}