{"id":"323892380_A_Co-Citation_and_Cluster_Analysis_of_Scientometrics_of_Geographic_Information_Ontology","abstract":"Geographic information ontology represents an effective means of expressing geographic concepts and relationships between them. As an emerging field of study, it has drawn the attention of increasing numbers of scholars worldwide. In this study, both co-citation and cluster analysis methods of scientometrics are used to perform a comprehensive analysis of the papers on the topic of geographic information ontology indexed by the Web of Science (WoS) and published between 2001 and 2016. The results show that the history of the study of geographic information ontology can be divided roughly into three periods. Computer science and mathematics play important roles in this field of study. The International Journal of Geographical Information Science is an important periodical that provides knowledge resources for the study of geographic information ontology. The papers of Gruber TR and Guarino N are referenced most frequently, as well as that of Smith B., who formally introduced information ontology to the field of geographic information science. Providing personalized and intelligent geographic information services for users is an important focus of geographic information ontology.","authors":["Yu Liu","Lin Li","Hang Shen","Hui Yang"],"meta":["March 2018International Journal of Geo-Information 7(3):120","DOI:10.3390/ijgi7030120"],"references":["314750889_Ontologies_and_Representation_Spaces_for_Sketch_Map_Interpretation","284812572_Google_Scholar_Scopus_and_the_Web_of_Science_A_longitudinal_and_cross-disciplinary_comparison","281444704_'Technology_Mining'_bibliometrics_analysis_applying_network_analysis_and_cluster_analysis","278195995_On_the_Formulation_of_Conceptual_Spaces_for_Land_Cover_Classification_Systems","313719888_Ontology-driven_geographic_information_systems","313077665_Collective_Knowledge_Systems_Where_the_Social_Web_Meets_the_Semantic_Web","309523371_A_bibliometric_and_visual_analysis_of_global_geo-ontology_research","289862413_Ontology_with_human_subjects_testing_An_empirical_investigation_of_geographic_categories","282962903_Global_research_trends_in_landslides_during_1991-2014_a_bibliometric_analysis","280093301_Overview_of_Ontology"]}