{"id":"323853375_Cognitive_Constructive_-_Chronometric_Techniques_as_a_Tool_for_the_E-Assessment_of_Learning","abstract":"The 21st century brought new demands to formal education. For instance, the introduction of information and communication technology (ICT) has revolutionized the conception and the realization of teaching (e.g., online education). Concurrently, in the field of evaluation of learning, advances have been characterized only by the digital encapsulation (digital domestication) of summative and formative assessment instruments, rather than by the generation of native approaches of the digital age. This clearly imposes a current demand to innovate methods and instruments of assessment that are better aligned with the new educational reality, framed by the era of innovative ICT. In particular, e-assessment will benefit by considering current cognitive science and computer science advances in ways that were not possible before. This is the case with the cognitive constructive chronometrical assessment of learning described in this paper. This approach favors innovating formative evaluation, but can be considered as complementary to several endeavors of old masters of educative evaluation.","authors":["Guadalupe Elizabeth Morales-Martinez","Ernesto Octavio López Ramírez","Jocelyn Pamela Garcia-Duran","Urdiales María"],"meta":["February 2018","DOI:10.26803/ijlter.17.2.10"],"references":["346493719_Augmented_Learning_Research_and_Design_of_Mobile_Educational_Games","328415006_Embedding_assessment_within_primary_school_science_A_case_study","324495904_Evaluation_in_e-learning","321609556_Assessment_Learning_and_Judgement_in_Higher_Education","319102283_e-Evaluacion_orientada_al_e-Aprendizaje_estrategico_en_Educacion_Superior","315297449_Fundamentals_of_Evidence-Based_Health_Care_and_Translational_Science","311806157_Assessment_in_Education_Principles_Policy_Practice","309078734_Cognitive_responsive_e-assessment_of_constructive_e-learning","308010702_New_Approaches_to_E-Cognitive_Assessment_of_E-Learning","305060896_Rethinking_assessment_in_higher_education"]}