{"id":"323811102_Report_of_a_large_depletion_in_the_ozone_layer_over_southern_Brazil_and_Uruguay_by_using_multi-instrumental_data","abstract":"Ozone is one of the chemical compounds that form part of the atmosphere. It plays a key role in the stratosphere where the ozone layer is located and absorbs large amounts of ultraviolet radiation. However, during austral spring (August–November), there is a massive destruction of the ozone layer, which is known as the Antarctic ozone hole. This phenomenon decreases ozone concentration in that region, which may affect other regions in addition to the polar one. This anomaly may also reach mid-latitudes; hence, it is called the secondary effect of the Antarctic ozone hole. Therefore, this study aims to identify the passage of an ozone secondary effect (OSE) event in the region of the city of Santa Maria – RS (29.68° S, 53.80° W) by means of a multi-instrumental analysis using the satellites TIMED/SABER, AURA/MLS, and OMI-ERS. Measurements were made in São Martinho da Serra/RS – Brazil (29.53° S, 53.85° W) using a sounding balloon and a Brewer Spectrophotometer. In addition, the present study aims to describe and analyse the influence that this stratospheric ozone reduction has on temperatures presented by these instruments, including data collected through the radio occultation technique. The event was first identified by the AURA/MLS satellite on 19 October 2016 over Uruguay. This reduction in ozone concentration was found by comparing the climatology for the years 1996–1998 for the state of Rio Grande do Sul, which is close to Uruguay. This event was already observed in Santa Maria/RS-Brazil on 20 October 2016 as presented by the OMI-ERS satellite and the Brewer Spectrophotometer. Moreover, a significant decrease was reported by the TIMED/SABER satellite in Uruguay. On 21 October, the poor ozone air mass was still over the region of interest, according to the OMI-ERS satellite, data from the sounding balloon launched in Santa Maria/RS-Brazil, and measurements made by the AURA/MLS satellite. Furthermore, the influence of ozone on the stratosphere temperature was observed during this period. Despite a continuous decrease detected in height, the temperature should have followed an increasing pattern in the stratospheric layer. Finally, the TIMED/SABER and OMI-ERS satellites showed that on 23 October, the air mass with low ozone concentration was moving away, and its layer, as well as the temperature, in the stratosphere was re-established.","authors":["Caroline Bresciani","Gabriela Dornelles Bittencourt","Jose Valentin Bageston","Damaris Kirsch Pinheiro"],"meta":["March 2018Annales Geophysicae 36(2):405-413","DOI:10.5194/angeo-36-405-2018"],"references":["323818915_A_major_event_of_Antarctic_ozone_hole_influence_in_southern_Brazil_in_October_2016_An_analysis_of_tropospheric_and_stratospheric_dynamics","317904765_Real-time_Environmental_Applications_and_Display_sYstem_READY","312049245_Measurements_of_the_total_ozone_column_using_a_Brewer_spectrophotometer_and_TOMS_and_OMI_satellite_instruments_over_the_Southern_Space_Observatory_in_Brazil","307828203_Stability_of_temperatures_from_TIMEDSABER_v107_2002-2009_and_AuraMLS_v22_2004-2009_compared_with_OH6-2_temperatures_observed_at_Davis_Station_Antarctica","304496658_Influence_of_the_Antartic_Ozone_Hole_over_South_of_Brazil_in_2010_and_2011","316638337_First_reprocessing_of_Southern_Hemisphere_ADditional_OZonesondes_SHADOZ_profile_records_1998-2015_1_Methodology_and_evaluation_SHADOZ_Reprocessed_Ozonesonde_Profiles","285448675_Preliminary_result_of_ozone_observations_at_Syowa_station_from_February_1982_to_January_1983","261376219_The_Brewer-Dobson_circulation","256643058_Evidence_for_an_ozone_hole_perturbation_at_30_South","253533803_Data_Inversion_for_the_Constellation_Observing_System_for_Meteorology_Ionosphere_and_Climate_COSMIC"]}