{"id":"323877523_Virtual_Rehabilitation_-_Benefits_and_Challenges","abstract":"Objectives: To discuss the advantages and disadvantages of rehabilitation applications of virtual reality.\nMethods: VR can be used as an enhancement to conventional therapy for patients with conditions ranging from musculo-skeletal problems, to stroke-induced paralysis, to cognitive deficits. This approach is called “VR-augmented rehabilitation.” Alternately, VR can replace conventional interventions altogether, in which case the rehabilitation is “VR-based.” If the intervention is done at a distance, then it is called “telerehabilitation.” Simulation exercises for post-stroke patients have been developed using a “teacher object” approach or a video game approach. Simulations for musculo-skeletal patients use virtual replicas of rehabilitation devices (such as rubber ball, power putty, peg board). Phobia-inducing virtual environments are prescribed for patients with cognitive deficits.\nResults: VR-augmented rehabilitation has been shown effective for stroke patients in the chronic phase of the disease. VR-based rehabilitation has been improving patients with fear of flying, Vietnam syndrome, fear of heights, and chronic stroke patients. Telerehabilitation interventions using VR have improved musculo-skeletal and post-stroke patients, however less data is available at this time.\nConclusions: Virtual reality presents significant advantages when applied to rehabilitation of patients with varied conditions. These advantages include patient motivation, adaptability and variability based on patient baseline, transparent data storage, online remote data access, economy of scale, reduced medical costs. Challenges in VR use for rehabilitation relate to lack of computer skills on the part of therapists, lack of support infrastructure, expensive equipment (initially), inadequate communication infrastructure (for telerehabilitation in rural areas), and patient safety concerns.","authors":["Grigore Burdea"],"meta":["January 2003Methods of Information in Medicine 42(05):519-523","DOI:10.1055/s-0038-1634378"],"references":["244453677_Analysis_of_assets_for_virtual_reality_applications_in_neuropsychology","232623399_Treating_Psychological_and_Physical_Disorders_with_VR","257307375_Use_of_virtual_environments_in_motor_learning_and_rehabilitation","247085101_Orthopedic_telerehabilitation_with_virtual_force_feedback","13123462_Virtual_reality_therapy_An_effective_treatment_for_psychological_disorders"]}