{"id":"323867726_Network_Service_Orchestration_A_Survey","abstract":"Business models of network service providers are undergoing an evolving transformation fueled by vertical customer demands and technological advances such as 5G, Software Defined Networking (SDN), and Network Function Virtualization (NFV). Emerging scenarios call for agile network services consuming network, storage, and compute resources across heterogeneous infrastructures and administrative domains. Coordinating resource control and service creation across interconnected domains and diverse technologies becomes a grand challenge. Research and development efforts are being devoted on enabling orchestration processes to automate, coordinate, and manage the deployment and operation of network services. In this survey, we delve into the topic of Network Service Orchestration (NSO) by reviewing the historical background, relevant research projects, enabling technologies, and standardization activities. We define key concepts and propose a taxonomy of NSO approaches and solutions to pave the way to the understanding of the diverse ongoing efforts towards the realization of multiple NSO application scenarios. Based on the analysis of the state of affairs, we finalize by discussing a series of open challenges and research opportunities, altogether contributing to a timely and comprehensive survey on the vibrant and strategic topic of network service orchestration.","authors":["Nathan F. Saraiva de Sousa","Danny Lachos Perez","Raphael V. Rosa","Mateus Augusto Silva Santos"],"meta":["March 2018Computer Communications 142","DOI:10.1016/j.comcom.2019.04.008","Project: Software-Defined Orchestrated Video Service Assurance through Smart Control Loops"],"references":["319637605_Security_and_Resilience_in_5G_Current_Challenges_and_Future_Directions","318801667_T-NOVA_An_open-source_MANO_stack_for_NFV_infrastructures","318473116_Internet_of_Things_From_Small-_to_Large-Scale_Orchestration","318339889_X-MANO_Cross-domain_Management_and_Orchestration_of_Network_Services","331729978_5G_Innovations_for_New_Business_Opportunities","323202736_A_Network_Service_Provider_Perspective_on_Network_Slicing","322837109_A_Comprehensive_Survey_of_Network_Function_Virtualization","322510110_An_Optimal_Roadside_Unit_Placement_Method_for_VANET_Localization","320680379_From_Software-Defined_to_Human-Defined_Networking_Challenges_and_Opportunities","318494191_RESTful_Web_Services"]}