{"id":"323807655_The_impact_of_preprocessing_steps_on_the_accuracy_of_machine_learning_algorithms_in_sentiment_analysis","abstract":"Big data and its related technologies have become active areas of research recently. There is a huge amount of data generated every minute and second that includes unstructured data which is the topic of interest for researchers now a days. A lot of research work is currently going on in the areas of text analytics and text preprocessing. In this paper, we have studied the impact of different preprocessing steps on the accuracy of three machine learning algorithms for sentiment analysis. We applied different text preprocessing techniques and studied their impact on accuracy for sentiment classification using three well-known machine learning classifiers including Naïve Bayes (NB), maximum entropy (MaxE), and support vector machines (SVM). We calculated accuracy of the three machine learning algorithms before and after applying the preprocessing steps. Results proved that the accuracy of NB algorithm was significantly improved after applying the preprocessing steps. Slight improvement in accuracy of SVM algorithm was seen after applying the preprocessing steps. Interestingly, in case of MaxE algorithm, no improvement in accuracy was seen. Our work is a comparative study, and our results proved that in case of NB algorithm, actuary was again significantly high than any other machine learning algorithm after applying the preprocessing steps; followed by MaxE and SVM algorithms. This research work proves that text preprocessing impacts the accuracy of machine learning algorithms. It further concludes that in case of NB algorithm, accuracy has significantly improved after applying text preprocessing steps.","authors":["Saqib Alam","Nianmin Yao"],"meta":["September 2019Computational and Mathematical Organization Theory 25(6)","DOI:10.1007/s10588-018-9266-8"],"references":["320773363_An_improved_algorithm_for_sentiment_analysis_based_on_maximum_entropy","319483403_Sentence-Level_Emotion_Detection_Framework_Using_Rule-Based_Classification","318857333_Aspect-based_sentiment_analysis_to_review_products_using_Naive_Bayes","318474768_Comparative_study_of_machine_learning_techniques_in_sentimental_analysis","318408079_SentiReview_Sentiment_analysis_based_on_text_and_emoticons","313910414_Lexicon-enhanced_sentiment_analysis_framework_using_rule-based_classification_scheme","320185840_A_Rule-Based_Sentiment_Classification_Framework_for_Health_Reviews_on_Mobile_Social_Media","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","313085177_Feature_selection_for_text_classification_with_Naive_Bayes","303360625_Sarcasm_as_contrast_between_a_positive_sentiment_and_negative_situation","293045375_Aspect_term_extraction_for_sentiment_analysis_in_large_movie_reviews_using_Gini_Index_feature_selection_method_and_SVM_classifier","272863616_Sentiment_Analysis_of_Movie_Reviews_using_POS_tags_and_Term_Frequencies","234131319_Efficient_Estimation_of_Word_Representations_in_Vector_Space","269291425_Big_data_and_sentiment_analysis_using_KNIME_Online_reviews_vs_social_media","234827916_Support_Vector_Machine_Active_Learning_With_Applications_To_Text_Classification"]}