{"id":"323898703_Dacura_A_new_solution_to_data_harvesting_and_knowledge_extraction_for_the_historical_sciences","abstract":"New advances in computer science address problems historical scientists face in gathering and evaluating the now vast data sources available through the Internet. As an example we introduce Dacura, a dataset curation platform designed to assist historical researchers in harvesting, evaluating, and curating high-quality information sets from the Internet and other sources. Dacura uses semantic knowledge graph technology to represent data as complex, inter-related knowledge allowing rapid search and retrieval of highly specific data without the need of a lookup table. Dacura automates the generation of tools to help non-experts curate high quality knowledge bases over time and to integrate data from multiple sources into its curated knowledge model. Together these features allow rapid harvesting and automated evaluation of Internet resources. We provide an example of Dacura in practice as the software employed to populate and manage the Seshat databank.","authors":["Peter N. Peregrine","Rob Brennan","Thomas Currie","Kevin Feeney"],"meta":["March 2018Historical Methods A Journal of Quantitative and Interdisciplinary History","DOI:10.1080/01615440.2018.1443863"],"references":["325031278_A_Systematic_Assessment_of_Axial_Age_Proposals_Using_Global_Comparative_Historical_Evidence","321982291_Quantitative_Historical_Analysis_Uncovers_a_Single_Dimension_of_Complexity_that_Structures_Global_Variation_in_Human_Social_Organization","279849138_Title_Seshat_The_Global_History_Databank","276369577_Cultural_Dynamics_Deep_Time_and_Data_Planning_Cyberinfrastructure_Investments_for_Archaeology","51060273_Household_expansion_linked_to_agricultural_intensification_during_emergence_of_Hawaiian_archaic_states","293608354_Guns_Germs_and_Steel_in_2003","283599884_Open_context_in_context_Cyberinfrastructure_and_distributed_approaches_to_publish_and_preserve_archaeological_data","233822134_Outline_of_World_Cultures"]}