{"id":"323870668_MCA_Degree_in_1_to_5_Years_An_Investigation_of_Private_Universities_in_India","abstract":"Computer Application (CA) is a branch of study responsible for the creation of software and applications. It is primarily focused on software technologies and allied areas. Computer Application is available as an academic program and professional area to become industry professionals. The field started during the 1980s and gradually developed in different higher educational institutions in India. Moreover, the branch Computer Application started and still offered in India only. Initially, the branch was started as an alternative field of existing Computer Science. Computer Science is purely concentrated on theoretical areas and mathematical concentration but Computer Application was started with a primary focus on software technologies and development. Initially, Computer Application branch started with Master's program rather Bachelors program. It has started with three years program for Bachelor's degree in any stream rather typical criteria of Bachelor's Degree in concerned/ related/ allied field of study. Computer Application is today offered in different duration with different eligibility criteria. This paper discusses in general, an overview of Computing and Information Technology emphasizes on Computer Application. Paper highlighted the multiple entry options in MCA program with multiple durations in Indian universities with special emphasis to the Private universities.","authors":["P.K. Paul","Sreeramana Aithal","K S Shivraj","D Maheswari"],"meta":["January 2018","DOI:10.5281/zenodo.1203986","Project: Private University"],"references":["322831948_Growing_popularity_of_Post_Graduate_Diploma_programs_in_IT_and_Computing_in_Indian_Private_Universities_An_Overview","322138390_MCA_Information_Science_and_Management_The_Next_Generation_Interdisciplinary_specialization_for_Social_Business_Health_Mathematical_Sciences-A_Step_for_promoting_Digital_Humanities","226085821_Financing_higher_education_in_India","225972339_The_dilemma_of_change_in_Indian_higher_education","44807123_Pharmacy_Education_in_India","284866579_Balanced_scorecards_in_managing_higher_education_institutions_An_Indian_perspective","272390085_Information_Science_A_Potential_interdisciplinary_field_with_Historical_Perspectives_and_Future_Potentials","267369946_Higher_Education_in_India_Structure_Statistics_and_Challenges","240542929_Transition_from_higher_education_as_a_public_good_to_higher_education_as_a_private_good_the_saga_of_Indian_experience","228294594_Getting_the_Numbers_Right_International_Engineering_Education_in_the_United_States_China_and_India"]}