{"id":"323846159_Fast_Approximation_and_Exact_Computation_of_Negative_Curvature_Parameters_of_Graphs","abstract":"In this paper, we study Gromov hyperbolicity and related parameters, that represent how close (locally) a metric space is to a tree from a metric point of view. The study of Gromov hyperbolicity for geodesic metric spaces can be reduced to the study of graph hyperbolicity. Our main contribution in this note is a new characterization of hyperbolicity for graphs (and for complete geodesic metric spaces). This characterization has algorithmic implications in the field of large-scale network analysis, which was one of our initial motivations. A sharp estimate of graph hyperbolicity is useful, e.g., in embedding an undirected graph into hyperbolic space with minimum distortion [Verbeek and Suri, SoCG'14]. The hyperbolicity of a graph can be computed in polynomial-time, however it is unlikely that it can be done in subcubic time. This makes this parameter difficult to compute or to approximate on large graphs. Using our new characterization of graph hyperbolicity, we provide a simple factor 8 approximation algorithm for computing the hyperbolicity of an $n$-vertex graph $G=(V,E)$ in optimal time $O(n^2)$ (assuming that the input is the distance matrix of the graph). This algorithm leads to constant factor approximations of other graph-parameters related to hyperbolicity (thinness, slimness, and insize). We also present the first efficient algorithms for exact computation of these parameters. All of our algorithms can be used to approximate the hyperbolicity of a geodesic metric space.","authors":["Jérémie Chalopin","Victor Chepoi","Feodor F. Dragan","Guillaume Ducoffe"],"meta":["April 2021Discrete & Computational Geometry 65(1)","DOI:10.1007/s00454-019-00107-9"],"references":["322218102_Fully_polynomial_FPT_algorithms_for_some_classes_of_bounded_clique-width_graphs","318489374_Fully_Polynomial_FPT_Algorithms_for_Some_Classes_of_Bounded_Clique-width_Graphs","318191564_When_Can_Graph_Hyperbolicity_Be_Computed_in_Linear_Time","313879278_When_can_Graph_Hyperbolicity_be_computed_in_Linear_Time","323894473_Fast_Approximation_Algorithms_for_p-Centers_in_Large_delta_d-Hyperbolic_Graphs","323060373_An_Improved_Combinatorial_Algorithm_for_Boolean_Matrix_Multiplication","321618091_Sur_les_Groupes_Hyperboliques_d'apres_Mikhael_Gromov","316520065_An_algorithm_detecting_hyperbolicity","313825707_Effect_of_Gromov-Hyperbolicity_Parameter_on_Cuts_and_Expansions_in_Graphs_and_Some_Algorithmic_Implications","313456252_On_the_hyperbolicity_of_large-scale_networks_and_its_estimation"]}