{"id":"323846320_Approximating_Dominating_Set_on_Intersection_Graphs_of_L-frames","abstract":"We consider the Dominating Set (DS) problem on the intersection graphs of geometric objects. Surprisingly, for simple and widely used objects such as rectangles, the problem is NP-hard even when all the rectangles are \"anchored\" at a line with slope -1. It is easy to see that for the anchored rectangles, the problem reduces to one with even simpler objects: L-frames. An L-frame is the union of a vertical and a horizontal segment that share one endpoint (corner of the L-frame). In light of the above discussion, we consider DS on the intersection graphs of L-frames. In this paper, we consider three restricted versions of the problem. First, we consider the version in which the corners of all input L-frames are anchored at a line with slope -1, and obtain a polynomial-time $(2+\\epsilon)$-approximation. Furthermore, we obtain a PTAS in case all the input L-frames are anchored at the diagonal from one side. Next, we consider the version, where all input L-frames intersect a vertical line, and prove APX-hardness of this version. Moreover, we prove NP-hardness of this version even in case the horizontal and vertical segments of each L-frame have the same length. Finally, we consider the version, where every L-frame intersects a vertical and a horizontal line, and show that this version is linear-time solvable. We also consider these versions of the problem in the so-called \"edge intersection model\", and obtain several interesting results. One of the results is an NP-hardness proof of the third version which answers a question posed by Mehrabi (WAOA 2017).","authors":["Sayan Bandyapadhyay","Anil Maheshwari","Saeed Mehrabi","Subhash Suri"],"meta":["March 2018Computational Geometry 82(2)","DOI:10.1016/j.comgeo.2019.04.004"],"references":["348344882_Dominating_set_of_rectangles_intersecting_a_straight_line","323862087_Packing_and_Covering_with_Non-Piercing_Regions","302583805_Geometric_Dominating_Set_and_Set_Cover_via_Local_Search","302383459_An_algorithm_for_the_maximum_weight_independent_set_problem_on_outerstring_graphs","324110215_Approximating_Domination_on_Intersection_Graphs_of_Paths_on_a_Grid","318729111_Planar_graphs_as_L-intersection_or_L-contact_graphs","303024915_Covering_Hitting_Piercing_and_Packing_Rectangles_Intersecting_an_Inclined_Line","300132946_Maximum_Independent_Set_on_B_1_B_1_-VPG_Graphs","281084642_Max_Point-Tolerance_Graphs","272194462_The_Hardness_of_Approximation_of_Euclidean_k-means"]}