{"id":"323863803_Ruling_out_FPT_algorithms_for_Weighted_Coloring_on_forests","abstract":"Given a graph G, a proper k-coloring of G is a partition c=(Si)i∈[1,k] of V(G) into k stable sets S1,…,Sk. Given a weight function w:V(G)→R+, the weight of a color Si is defined as w(i)=maxv∈Si⁡w(v) and the weight of a coloring c as w(c)=∑i=1kw(i). Guan and Zhu [Inf. Process. Lett., 1997] defined the weighted chromatic number of a pair (G,w), denoted by σ(G,w), as the minimum weight of a proper coloring of G. For a positive integer r, they also defined σ(G,w;r) as the minimum of w(c) among all proper r-colorings c of G.\nThe complexity of determining σ(G,w) when G is a tree was open for almost 20 years, until Araújo et al. [SIAM J. Discrete Math., 2014] recently proved that the problem cannot be solved in time no(log⁡n) on n-vertex trees unless the Exponential Time Hypothesis (ETH) fails.\nThe objective of this article is to provide hardness results for computing σ(G,w) and σ(G,w;r) when G is a tree or a forest, relying on complexity assumptions weaker than the ETH. Namely, we study the problem from the viewpoint of parameterized complexity, and we assume the weaker hypothesis FPT≠W[1]. Building on the techniques of Araújo et al., we prove that when G is a forest, the decision problem of computing σ(G,w) is W[1]-hard parameterized by the size of a largest connected component of G, and that computing σ(G,w;r) is W[2]-hard parameterized by r. Our results rule out the existence of FPT algorithms for computing these invariants on trees or forests for many natural choices of the parameter.","authors":["Julio Araujo","Julien Baste","Ignasi Sau"],"meta":["March 2018Theoretical Computer Science 729","DOI:10.1016/j.tcs.2018.03.013"],"references":["278769048_Weighted_Coloring_in_Trees","221580898_Reducibility_Among_Combinatorial_Problems","222923068_Strong_computational_lower_bounds_via_parameterized_complexity","222666128_Which_Problems_Have_Strongly_Exponential_Complexity","220639813_Approximating_Interval_Coloring_and_Max-Coloring_in_Chordal_Graphs","216877581_A_Coloring_Problem_for_Weighted_Graphs","41817447_Weighted_coloring_on_planar_bipartite_and_split_graphs_Complexity_and_approximation"]}