{"id":"323857616_VIAL_a_unified_process_for_visual_interactive_labeling","abstract":"The assignment of labels to data instances is a fundamental prerequisite for many machine learning tasks. Moreover, labeling is a frequently applied process in visual interactive analysis approaches and visual analytics. However, the strategies for creating labels usually differ between these two fields. This raises the question whether synergies between the different approaches can be attained. In this paper, we study the process of labeling data instances with the user in the loop, from both the machine learning and visual interactive perspective. Based on a review of differences and commonalities, we propose the “visual interactive labeling” (VIAL) process that unifies both approaches. We describe the six major steps of the process and discuss their specific challenges. Additionally, we present two heterogeneous usage scenarios from the novel VIAL perspective, one on metric distance learning and one on object detection in videos. Finally, we discuss general challenges to VIAL and point out necessary work for the realization of future VIAL approaches.","authors":["Jürgen Bernard","Matthias Zeppelzauer","Michael Sedlmair","Wolfgang Aigner"],"meta":["September 2018The Visual Computer 34(2)","DOI:10.1007/s00371-018-1500-3","Projects: IntelliGait - Intelligent Human Gait AnalysisVisual-InterActive Labeling"],"references":["323357472_Adopting_Mental_Similarity_Notions_of_Categorical_Data_Objects_to_Algorithmic_Similarity_Functions","320102864_Incremental_On-line_Learning_A_Review_and_Comparison_of_State_of_the_Art_Algorithms","319362030_Podium_Ranking_Data_Using_Mixed-Initiative_Visual_Analytics","328901897_Patent_Retrieval_A_Multi-Modal_Visual_Analytics_Approach","319770277_Deep_Learning_of_Representations_for_Unsupervised_and_Transfer_Learning","319393666_Modern_Information_Retrieval","319364386_Visualizing_Dataflow_Graphs_of_Deep_Learning_Models_in_TensorFlow","319361848_Comparing_Visual-Interactive_Labeling_with_Active_Learning_An_Experimental_Study","318411522_Data_Abstraction_for_Visualizing_Large_Time_Series","318200585_Comparing_Personal_Image_Collections_with_PICTuReVis"]}