{"id":"323811073_Visual_analysis_of_traffic_data_based_on_topic_modeling_ChinaVis_2017","abstract":"The spatio-temporal urban movement patterns can be extracted from the massive trajectory data recorded by GPS devices. Effectively analyzing the massive and complex traffic data and then finding useful information hidden in such data constitute challenging yet meaningful research. By providing the interactive visual analysis of the underlying traffic patterns of the city, the results can guide the users in choosing ideal locations for setting up shops for business operations. We construct the topic model to analyze the GPS taxi trajectory data. The topic information is combined with the traffic volume information to choose the representative candidate areas. Then, traffic flow graphs are generated between candidate areas to show the distribution of such areas and the taxi running rules. We study the distribution and semantics of the topics from three aspects: time, space, and POIs (points of interest). Thus, we can enhance the user’s understanding of area characters by semantics. In addition, inspired by the wheels of vehicles, we design a metaphor-based glyph to summarize the multi-dimensional attributes of each candidate area. Users can explore the prospective areas’ multiple attributes over time through varied interactions to learn the details of the area from multiple perspectives. Finally, we design and implement a visual analysis prototype system of traffic trajectory data as well as verify the feasibility and validity of the system in the case study.\n\nGraphical Abstract\nOpen image in new window","authors":["Ying Tang","Fengfan Sheng","Hongxin Zhang","Chaojie Shi"],"meta":["March 2018Journal of Visualization 21(1)","DOI:10.1007/s12650-018-0481-7","Project: Semantics-aware urban data analysis"],"references":["324664404_HomeFinder_Revisited_Finding_Ideal_Homes_with_Reachability-Centric_Multi-Criteria_Decision_Making","320055450_Exploring_the_Design_Space_of_Immersive_Urban_Analytics","312479958_Visualizing_the_Relationship_Between_Human_Mobility_and_Points_of_Interest","305923124_SmartAdP_Visual_Analytics_of_Large-scale_Taxi_Trajectories_for_Selecting_Billboard_Locations","305923125_SemanticTraj_A_New_Approach_to_Interacting_with_Massive_Taxi_Trajectories","303802749_Indexing_by_Latent_Semantic_Analysis","296480251_Embedding_Spatio-Temporal_Information_into_Maps_by_Route-Zooming","279282487_A_Survey_of_Traffic_Data_Visualization","277679296_Urban_Computing","276175172_A_semantic-enhanced_trajectory_visual_analytics_for_digital_forensic"]}