{"id":"323818758_Tracking_an_atmospheric_river_in_a_warmer_climate_From_water_vapor_to_economic_impacts","abstract":"Atmospheric rivers (ARs) account for more than 75 % of heavy precipitation events and nearly all of the extreme flooding events along the Olympic Mountains and western Cascade Mountains of western Washington state. In a warmer climate, ARs in this region are projected to become more frequent and intense, primarily due to increases in atmospheric water vapor. However, it is unclear how the changes in water vapor transport will affect regional flooding and associated economic impacts. In this work we present an integrated modeling system to quantify the atmospheric–hydrologic–hydraulic and economic impacts of the December 2007 AR event that impacted the Chehalis River basin in western Washington. We use the modeling system to project impacts under a hypothetical scenario in which the same December 2007 event occurs in a warmer climate. This method allows us to incorporate different types of uncertainty, including (a) alternative future radiative forcings, (b) different responses of the climate system to future radiative forcings and (c) different responses of the surface hydrologic system. In the warming scenario, AR integrated vapor transport increases; however, these changes do not translate into generalized increases in precipitation throughout the basin. The changes in precipitation translate into spatially heterogeneous changes in sub-basin runoff and increased streamflow along the entire Chehalis main stem. Economic losses due to stock damages increase moderately, but losses in terms of business interruption are significant. Our integrated modeling tool provides communities in the Chehalis region with a range of possible future physical and economic impacts associated with AR flooding.","authors":["Francina Dominguez","Sandy Dall&amp;apos;erba","Shuyi Huang","Andre Fernandes Tomon Avelino"],"meta":["March 2018Earth System Dynamics 9(1):249-266","DOI:10.5194/esd-9-249-2018"],"references":["322013988_Evaluation_of_the_moisture_sources_in_two_extreme_landfalling_atmospheric_river_events_using_an_Eulerian_WRF_tracers_tool","313593111_Linking_Atmospheric_River_Hydrological_Impacts_on_the_US_West_Coast_to_Rossby_Wave_Breaking","283291683_An_evaluation_of_atmospheric_rivers_over_the_North_Pacific_in_CMIP5_and_their_response_to_warming_under_RCP_85","282254893_Completion_of_the_2011_National_Land_Cover_Database_for_the_Conterminous_United_States_-_Representing_a_Decade_of_Land_Cover_Change_Information","281067047_Using_HAZUS-MH_and_HEC-RAS_to_Evaluate_Real_World_Flooding_Events_in_the_Upper_Alabama_River_Watershed","279207748_Hurricane_Sandy_before_1900_and_after_2100","325095849_Comparing_the_Economic_Impact_of_Natural_Disasters_Generated_by_Different_Input-Output_Models_An_Application_to_the_2007_Chehalis_River_Flood_WA_Comparing_the_Economic_Impact_of_Natural_Disasters_Gene","284701586_The_WRF_single-moment_6-class_microphysics_scheme_WSM6","282497398_Climate_change_intensification_of_horizontal_water_vapor_transport_in_CMIP5","280801529_The_Kain_-_Fritsch_convective_parameterization_An_update"]}