{"id":"323941723_Systematic_Review_of_Research_Trends_in_Robotics_Education_for_Young_Children","abstract":"This study conducted a systematic and thematic review on existing literature in robotics education using robotics kits (not social robots) for young children (Pre-K and kindergarten through 5th grade). This study investigated: (1) the definition of robotics education; (2) thematic patterns of key findings; and (3) theoretical and methodological traits. The results of the review present a limitation of previous research in that it has focused on robotics education only as an instrumental means to support other subjects or STEM education. This study identifies that the findings of the existing research are weighted toward outcome-focused research. Lastly, this study addresses the fact that most of the existing studies used constructivist and constructionist frameworks not only to design and implement robotics curricula but also to analyze young children’s engagement in robotics education. Relying on the findings of the review, this study suggests clarifying and specifying robotics-intensified knowledge, skills, and attitudes in defining robotics education in connection to computer science education. In addition, this study concludes that research agendas need to be diversified and the diversity of research participants needs to be broadened. To do this, this study suggests employing social and cultural theoretical frameworks and critical analytical lenses by considering children’s historical, cultural, social, and institutional contexts in understanding young children’s engagement in robotics education.","authors":["Sung Eun Jung","Eun-sok Won"],"meta":["March 2018Sustainability 10(4):905","DOI:10.3390/su10040905"],"references":["320637894_Implementing_a_Robotics_Curriculum_in_an_Early_Childhood_Montessori_Classroom","317972637_Heterogeneous_Associations_of_Second-Graders'_Learning_in_Robotics_Class","305197309_Advancing_the_E_in_K-12_STEM_Education","301284225_A_Review_on_the_Use_of_Robots_in_Education_and_Young_Children","339469779_Judith_Butler_Notes_Toward_a_Performative_Theory_of_Assembly_Rezension","318155236_Developing_an_Integrative_STEM_Curriculum_for_Robotics_Education_Through_Educational_Design_Research","313375967_Reprint-Preferred_Reporting_Items_for_Systematic_Reviews_and_Meta-Analyses_The_PRISMA_Statement","312668976_Undergraduate_STEM_Instructors'_Teacher_Identities_and_Discourses_on_Student_Gender_Expression_and_Equity_Stem_Instructors'_Discourses_on_Student_Gender","312650472_Educational_Robotics_Intervention_on_Executive_Functions_in_preschool_children_a_pilot_study","304862632_Critical_Is_Something_Others_Don't_Do_Mapping_the_Imaginative_of_Educational_Technology"]}