{"id":"323988797_An_Efficient_Two-Phase_Model_for_Computing_Influential_Nodes_in_Social_Networks_Using_Social_Actions","abstract":"The measurement of influence in social networks has received a lot of attention in the data mining community. Influence maximization refers to the process of finding influential users who make the most of information or product adoption. In real settings, the influence of a user in a social network can be modeled by the set of actions (e.g., “like”, “share”, “retweet”, “comment”) performed by other users of the network on his/her publications. To the best of our knowledge, all proposed models in the literature treat these actions equally. However, it is obvious that a “like” of a publication means less influence than a “share” of the same publication. This suggests that each action has its own level of influence (or importance). In this paper, we propose a model (called Social Action-Based Influence Maximization Model, SAIM) for influence maximization in social networks. In SAIM, actions are not considered equally in measuring the “influence power” of an individual, and it is composed of two major steps. In the first step, we compute the influence power of each individual in the social network. This influence power is computed from user actions using PageRank. At the end of this step, we get a weighted social network in which each node is labeled by its influence power. In the second step of SAIM, we compute an optimal set of influential nodes using a new concept named “influence-BFS tree”. Experiments conducted on large-scale real-world and synthetic social networks reveal the good performance of our model SAIM in computing, in acceptable time scales, a minimal set of influential nodes allowing the maximum spreading of information.","authors":["Mehdi Azaouzi","Lotfi Ben Romdhane"],"meta":["March 2018Journal of Computer Science and Technology 33(2):286-304","DOI:10.1007/s11390-018-1820-9","Project: Social Networks Analysis"],"references":["303214441_Gephi_An_Open_Source_Software_for_Exploring_and_Manipulating_Networks","309774714_Diffusion_models_and_approaches_for_influence_maximization_in_social_networks","309714621_Identification_of_influential_spreaders_in_online_social_networks_using_interaction_weighted_K-core_decomposition_method","305500247_Engagement_Capacity_and_Engaging_Team_Formation_for_Reach_Maximization_of_Online_Social_Media_Platforms","304994968_TOSI_A_trust-oriented_social_influence_evaluation_method_in_contextual_social_networks","304914185_Budget_Allocation_for_Maximizing_Viral_Advertising_in_Social_Networks","304293938_Credit_Distribution_and_influence_maximization_in_online_social_networks_using_node_features","303633899_INCIM_A_community-based_algorithm_for_influence_maximization_problem_under_the_linear_threshold_model","300590495_Influence_Maximization_in_Near-Linear_Time","300329247_Positive_Opinion_Influential_Node_Set_Selection_for_Social_Networks_Considering_Both_Positive_and_Negative_Relationships"]}