{"id":"323924955_Multi-Class_Active_Learning_by_Integrating_Uncertainty_and_Diversity","abstract":"Active learning is a promising way to reduce the labeling cost with a limited training samples initially, and then iteratively select the most valuable samples from a large number of unlabeled data for labeling in order to construct a powerful classifier. The goal of active learning is to make the labeled dataset have no redundancy as much as possible. Uncertainty and diversity are two important criteria for active learning. Currently, a promising way by combining uncertainty and diversity for active learning is developed. However, many of these methods are designed based on the binary class or uncertainty followed by diversity strategy. They are hard to select the most valuable samples for multiple classes with binary setting with diversity and uncertainty simultaneously. In this paper, we integrate uncertainty and diversity into one formula by multi-class settings. Uncertainty is measured by the margin minimum while diversity is measured by the maximum mean discrepancy, which is popular to measure the distribution between two datasets. By minimizing the upper bound for the true risk of the integrating formula, we find the samples that not only uncertainty but also diversity with each other. We conduct our experiments on 12 benchmark UCI datasets, and the experimental results demonstrate that the proposed method performs better than some other state-of-the-art methods.","authors":["Zengmao Wang","Xi Fang","Xinyao Tang","Chen Wu"],"meta":["March 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2817845"],"references":["322282449_Multi-Instance_Learning_with_Discriminative_Bag_Mapping","319946166_Multiple_Structure-View_Learning_for_Graph_Classification","312654941_Positive_and_Unlabeled_Multi-Graph_Learning","309056081_PLTD_Patch-Based_Low-Rank_Tensor_Decomposition_for_Hyperspectral_Images","307881957_LIBSVM_A_library_for_support_vector_machines","306434593_Beyond_the_Sparsity-Based_Target_Detector_A_Hybrid_Sparsity_and_Statistics_Based_Detector_for_Hyperspectral_Images","305977907_Integral_Probability_Metrics_and_Their_Generating_Classes_of_Functions","298727608_Stacked_Convolutional_Denoising_Auto-Encoders_for_Feature_Representation","284205877_Exploring_Representativeness_and_Informativeness_for_Active_Learning","281304728_Active_learning_with_hinted_support_vector_machine"]}