{"id":"323944796_Studying_the_consistency_of_star_ratings_and_the_complaints_in_1_2-star_user_reviews_for_top_free_cross-platform_Android_and_iOS_apps","abstract":"How users rate a mobile app via star ratings and user reviews is of utmost importance for the success of an app. Recent studies and surveys show that users rely heavily on star ratings and user reviews that are provided by other users, for deciding which app to download. However, understanding star ratings and user reviews is a complicated matter, since they are influenced by many factors such as the actual quality of the app and how the user perceives such quality relative to their expectations, which are in turn influenced by their prior experiences and expectations relative to other apps on the platform (e.g., iOS versus Android). Nevertheless, star ratings and user reviews provide developers with valuable information for improving the overall impression of their app. In an effort to expand their revenue and reach more users, app developers commonly build cross-platform apps, i.e., apps that are available on multiple platforms. As star ratings and user reviews are of such importance in the mobile app industry, it is essential for developers of cross-platform apps to maintain a consistent level of star ratings and user reviews for their apps across the various platforms on which they are available. In this paper, we investigate whether cross-platform apps achieve a consistent level of star ratings and user reviews. We manually identify 19 cross-platform apps and conduct an empirical study on their star ratings and user reviews. By manually tagging 9,902 1 & 2-star reviews of the studied cross-platform apps, we discover that the distribution of the frequency of complaint types varies across platforms. Finally, we study the negative impact ratio of complaint types and find that for some apps, users have higher expectations on one platform. All our proposed techniques and our methodologies are generic and can be used for any app. Our findings show that at least 79% of the studied cross-platform apps do not have consistent star ratings, which suggests that different quality assurance efforts need to be considered by developers for the different platforms that they wish to support.","authors":["Hanyang Hu","Cor-Paul Bezemer","Ahmed E. Hassan"],"meta":["December 2018Empirical Software Engineering 23(4)","DOI:10.1007/s10664-018-9604-y","Projects: App Store AnalyticsMining the Google Play Store"],"references":["317638070_Recommending_and_Localizing_Change_Requests_for_Mobile_Apps_based_on_User_Reviews","314856161_A_study_of_the_relation_of_mobile_device_attributes_with_the_user-perceived_quality_of_Android_apps","313428459_Recommending_and_Localizing_Change_Requests_for_Mobile_Apps_Based_on_User_Reviews","310459331_Predicting_Smartphone_Operating_System_from_Personality_and_Individual_Differences","310022320_Studying_the_consistency_of_star_ratings_and_the_complaints_in_1_2-star_user_reviews_for_top_free_cross-platform_Android_and_iOS_apps","310022319_Studying_the_consistency_of_star_ratings_and_the_complaints_in_1_2-star_user_reviews_for_top_free_cross-platform_Android_and_iOS_apps","324525040_Mobile_information_retrieval","318326819_Same_App_Different_App_Stores_A_Comparative_Study","311531753_Experience_Report_Understanding_Cross-Platform_App_Issues_from_User_Reviews","311359043_A_Survey_of_App_Store_Analysis_for_Software_Engineering"]}