{"id":"323991296_Data-based_Decision_Rules_to_Personalize_Depression_Follow-up","abstract":"Depression is a common mental illness with complex and heterogeneous progression dynamics. Risk grouping of depression treatment population based on their longitudinal patterns has the potential to enable cost-effective monitoring policy design. This paper establishes a rule-based method to identify a set of risk predictive patterns from person-level longitudinal disease measurements by integrating the data transformation, rule discovery and rule evaluation. We further extend the identified rules to create rule-based monitoring strategies to adaptively monitor individuals with different disease severities. We applied the rule-based method on an electronic health record (EHR) dataset of depression treatment population containing person-level longitudinal Patient Health Questionnaire (PHQ)-9 scores for assessing depression severity. 12 risk predictive rules are identified, and the rule-based prognostic model based on identified rules enables more accurate prediction of disease severity than other prognostic models including RuleFit, logistic regression and Support Vector Machine. Two rule-based monitoring strategies outperform the latest PHQ-9 based monitoring strategy by providing higher sensitivity and specificity. The rule-based method can lead to a better understanding of disease dynamics, achieving more accurate prognostics of disease progressions, personalizing follow-up intervals, and designing cost-effective monitoring of patients in clinical practice.","authors":["Ying Lin","Shuai Huang","Gregory E Simon","Shan Liu"],"meta":["March 2018Scientific Reports 8(1):5064","DOI:10.1038/s41598-018-23326-1"],"references":["307086892_A_Comparison_of_Rule-based_Analysis_with_Regression_Methods_in_Understanding_the_Risk_Factors_for_Study_Withdrawal_in_a_Pediatric_Study","349860897_Item_Response_Theory","313968065_Item_Response_Theory","309433093_Analysis_of_Depression_Trajectory_Patterns_Using_Collaborative_Learning","298953138_Development_and_Validation_of_an_International_Risk_Prediction_Algorithm_for_Episodes_of_Major_Depression_in_General_Practice_Attendees_The_PredictD_Study_vol_65_pg_1368_2008","292073787_US_Preventive_Services_Task_Force_Recommendation_Statement_on_Screening_for_Depression_in_Adults","290159283_Antidepressant_use_in_persons_aged_12_and_over_United_States","283745857_Making_machine_learning_models_interpretable","269876686_Mobile_health_monitoring_to_characterize_depression_symptom_trajectories_in_primary_care","266385157_Design_Analysis_of_Experiments"]}