{"id":"323956929_A_Comprehensive_Analysis_of_Deep_Regression","abstract":"Deep learning revolutionized data science, and recently, its popularity has grown exponentially, as did the amount of papers employing deep networks. Vision tasks such as human pose estimation did not escape this methodological change. The large number of deep architectures lead to a plethora of methods that are evaluated under different experimental protocols. Moreover, small changes in the architecture of the network, or in the data pre-processing procedure, together with the stochastic nature of the optimization methods, lead to notably different results, making extremely difficult to sift methods that significantly outperform others. Therefore, when proposing regression algorithms, practitioners proceed by trial-and-error. This situation motivated the current study, in which we perform a systematic evaluation and a statistical analysis of the performance of vanilla deep regression -- short for convolutional neural networks with a linear regression top layer --. Up to our knowledge this is the first comprehensive analysis of deep regression techniques. We perform experiments on three vision problems and report confidence intervals for the median performance as well as the statistical significance of the results, if any. Surprisingly, the variability due to different data pre-processing procedures generally eclipses the variability due to modifications in the network architecture.","authors":["Stéphane Lathuilière","Pablo Mesejo","Xavier Alameda-Pineda","Radu Horaud"],"meta":["March 2018IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99)","DOI:10.1109/TPAMI.2019.2910523"],"references":["327995338_On_Regression_Losses_for_Deep_Depth_Estimation","316970253_Systematic_Evaluation_of_Convolution_Neural_Network_Advances_on_the_ImageNet","315867122_LCR-Net_Localization-Classification-Regression_for_Human_Pose","315489658_How_Far_are_We_from_Solving_the_2D_3D_Face_Alignment_Problem_and_a_Dataset_of_230000_3D_Facial_Landmarks","314115710_On_architectural_choices_in_deep_learning_From_network_structure_to_gradient_convergence_and_parameter_estimation","322060630_Genetic_CNN","320971086_Deep_Mixture_of_Linear_Inverse_Regressions_Applied_to_Head-Pose_Estimation","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770174_Practical_recommendations_for_gradient-based_training_of_deep_architectures","306023833_Deep_Expectation_of_Real_and_Apparent_Age_from_a_Single_Image_Without_Facial_Landmarks","305196650_Going_deeper_with_convolutions","309663753_Deep_Convolutional_Neural_Network_Design_Patterns","308278381_Fashion_Landmark_Detection_in_the_Wild","306281834_Rethinking_the_Inception_Architecture_for_Computer_Vision"]}