{"id":"323955231_Physics-Aware_Gaussian_Processes_in_Remote_Sensing","abstract":"Earth observation from satellite sensory data poses challenging problems, where machine learning is currently a key player. In recent years, Gaussian Process (GP) regression have excelled in biophysical parameter estimation tasks from airborne and satellite observations. GP regression is based on solid Bayesian statistics, and generally yields efficient and accurate parameter estimates. However, GPs are typically used for inverse modeling based on concurrent observations and in situ measurements only. Very often a forward model encoding the well-understood physical relations between the state vector and the radiance observations is available though and could be useful to improve predictions and understanding. In this work, we review three GP models that respect and learn the physics of the underlying processes in the context of both forward and inverse modeling. After reviewing the traditional application of GPs for parameter retrieval, we introduce a Joint GP (JGP) model that combines in situ measurements and simulated data in a single GP model. Then, we present a latent force model (LFM) for GP modeling that encodes ordinary differential equations to blend data-driven modeling and physical constraints of the system governing equations. The LFM performs multi-output regression, adapts to the signal characteristics, is able to cope with missing data in the time series, and provides explicit latent functions that allow system analysis and evaluation. Finally, we present an Automatic Gaussian Process Emulator (AGAPE) that approximates the forward physical model using concepts from Bayesian optimization and at the same time builds an optimally compact look-up-table for inversion. We give empirical evidence of the performance of these models through illustrative examples of vegetation monitoring and atmospheric modeling.","authors":["Gustau Camps-Valls","Luca Martino","Daniel Heestermans Svendsen","Manuel Campos-Taberner"],"meta":["March 2018Applied Soft Computing 68(2–3)","DOI:10.1016/j.asoc.2018.03.021","Project: SEDAL: Statistical Learning for Earth Observation Data Analysis"],"references":["321090803_Joint_Gaussian_Processes_for_Biophysical_Parameter_Retrieval","317803443_Physics-Aware_Gaussian_Processes_for_Earth_Observation","317099228_Automatic_Emulation_by_Adaptive_Relevance_Vector_Machines","316117680_Downstream_Services_for_Rice_Crop_Monitoring_in_Europe_From_Regional_to_Local_Scale","315373480_Automatic_emulator_and_optimized_look-up_table_generation_for_radiative_transfer_models","314278561_Exploitation_of_SAR_and_Optical_Sentinel_Data_to_Detect_Rice_Crop_and_Estimate_Seasonal_Dynamics_of_Leaf_Area_Index","311902144_SMELLY_PARALLEL_MCMC_CHAINS","305639277_Parallel_interacting_Markov_adaptive_importance_sampling","309917899_Latent_force_models_for_earth_observation_time_series_prediction","309133922_Multitemporal_and_multiresolution_leaf_area_index_retrieval_for_operational_local_rice_crop_monitoring"]}