{"id":"323989892_Rainbow_Connections_in_Digraphs","abstract":"An arc-coloured path in a digraph is rainbow if its arcs have distinct colours. A vertex-coloured path is vertex rainbow if its internal vertices have distinct colours. A totally-coloured path is total rainbow if its arcs and internal vertices have distinct colours. An arc-coloured (resp. vertex-coloured, totally-coloured) digraph D is rainbow connected (resp. rainbow vertex-connected, total rainbow connected) if any two vertices of D are connected by a rainbow (resp. vertex rainbow, total rainbow) path. The rainbow connection number (resp. rainbow vertex-connection number, total rainbow connection number) of a digraph D is the smallest number of colours needed to make D rainbow connected (resp. rainbow vertex-connected, total rainbow connected). In this paper, we study the rainbow connection, rainbow vertex-connection and total rainbow connection numbers of digraphs. We give some properties of these parameters and establish relations between them. The rainbow connection number and the rainbow vertex-connection number of a digraph D are both upper bounded by the order of D, while its total rainbow connection number is upper bounded by twice of its order. In particular, we prove that a digraph of order n has rainbow connection number n if and only if it is Hamiltonian and has three vertices with eccentricity n−1, that it has rainbow vertex-connection number n if and only if it has a Hamiltonian cycle C and three vertices with eccentricity n−1 such that no two of them are consecutive on C, and that it has total rainbow connection number 2n if and only if it has rainbow vertex-connection number n.","authors":["Elzbieta Sidorowicz","Eric Sopena"],"meta":["March 2018Discrete Applied Mathematics 243","DOI:10.1016/j.dam.2018.01.014"],"references":["313272094_Rainbow_connectivity_of_cacti_and_some_infinite_digraphs","286235015_Hardness_Results_for_Total_Rainbow_Connection_of_Graphs","275587932_A_Note_on_the_Rainbow_Connectivity_of_Tournaments","274730360_Rainbow_Connection_in_Some_Digraphs","274039597_Rainbow_connection_in_oriented_graphs","268518108_On_forbidden_subgraphs_and_rainbow_connection_in_graphs_with_minimum_degree_2","253241277_Rainbow_Connections_of_Graphs_A_Survey","268496917_Rainbow_connection_in_graphs","237148488_Rainbow_connection_and_minimum_degree","232384235_On_minimally_rainbow_-connected_graphs"]}