{"id":"323956764_A_trust-based_recommendation_method_using_network_diffusion_processes","abstract":"A variety of rating-based recommendation methods have been extensively studied including the well-known collaborative filtering approaches and some network diffusion-based methods, however, social trust relations are not sufficiently considered when making recommendations. In this paper, we contribute to the literature by proposing a trust-based recommendation method, named CosRA+T, after integrating the information of trust relations into the resource-redistribution process. Specifically, a tunable parameter is used to scale the resources received by trusted users before the redistribution back to the objects. Interestingly, we find an optimal scaling parameter for the proposed CosRA+T method to achieve its best recommendation accuracy, and the optimal value seems to be universal under several evaluation metrics across different datasets. Moreover, results of extensive experiments on the two real-world rating datasets with trust relations, Epinions and FriendFeed, suggest that CosRA+T has a remarkable improvement in overall accuracy, diversity, and novelty. Our work takes a step towards designing better recommendation algorithms by employing multiple resources of social network information.","authors":["Ling-Jiao Chen","Jian Gao"],"meta":["March 2018Physica A: Statistical Mechanics and its Applications 506","DOI:10.1016/j.physa.2018.04.089"],"references":["321189867_Quantifying_China's_regional_economic_complexity","309237237_A_vertex_similarity_index_for_better_personalized_recommendation","306230407_Big_data_reveal_the_status_of_economic_development","304169558_Critical_size_of_ego_communication_networks","286134658_Stability_of_similarity_measurements_for_bipartite_networks","281487213_Evaluating_user_reputation_in_online_rating_systems_via_an_iterative_group-based_ranking_method","319282477_Diffusion-based_recommendation_with_trust_relations_on_tripartite_graphs","309184880_Identifying_online_user_reputation_of_user-object_bipartite_networks","294107078_A_Novel_Recommendation_Model_Regularized_with_User_Trust_and_Item_Ratings","284218886_Network-based_recommendation_algorithms_A_review"]}