{"id":"323934775_L'integration_des_serious_games_dans_les_cours_d'introduction_de_l'algorithmique_et_de_la_programmation","abstract":"Les élèves débutants en programmation sont confrontés à beaucoup de difficultés (multiplicité de concepts théoriques et techniques, construction de programmes et d'algorithmes…), ce qui mène à leur démotivation pour apprendre la programmation. Afin de stimuler l'intérêt des élèves, nous avons élaboré des séquences pédagogiques en algorithmique et programmation basées sur les serious games. Ainsi, une expérimentation a été menée avec un groupe expérimental de 20 élèves de niveau de la 1 ère année du secondaire qualifiant où les élèves ont été initiés à des serious games : jeux Blockley, Light-Bot…, puis à la création de jeux avec Scratch un environnement visuel facilitant la programmation. Le groupe témoin, de 20 élèves aussi, a suivi une introduction à l'algorithmique et à la programmation en utilisant une méthode classique. A la fin de l'expérimentation, les deux groupes ont été amenés à répondre à un test dans le cadre des évaluations sommatives et à un questionnaire destiné à évaluer leur motivation et intérêt pour l'apprentissage de la programmation. Les résultats obtenus montrent que les élèves du groupe expérimental ont mieux acquis les notions de base de l'algorithmique et de la programmation. Nous concluons que l'innovation pédagogique via les serious games peut être un moyen pour aboutir à un apprentissage efficace des élèves, les rendre plus autonomes dans la construction de leurs savoirs et de les motiver à poursuivre leurs études en programmation. Abstract Beginning programming students face a number of learning difficulties due to a multiplicity of theoretical and technical new concepts in program construction and algorithms, which often lead to their lack of motivation to learn programming. We have developed pedagogical learning sequences based on serious games for the module algorithms and programming. We implemented our new method in an experimental class of 20 high-school students. We first introduced serious games to the students, then taught them how to create simple games in a visual environment facilitating programming (Scratch). Twenty other students (control group), followed an introduction to algorithms and programming using a conventional teaching method. Both groups had the same summative assessments as well as a survey to assess their motivation and interest in learning programming. The experimental group not only outperformed the control group but showed better motivation for programming. We conclude that serious games help achieve an effective student learning environment where students build their own knowledge and skills, and motivate them for computer sciences.","authors":["Ibrahim Ouahbi","Fatiha Kaddari","Hassane Darhmaoui","Abdelrhani Elachqar"],"meta":["February 2018"],"references":["311489150_Retention_of_Flow_Evaluating_a_Computer_Science_Education_Week_Activity","300005547_Pre-service_Teachers'_Perceptions_and_Awareness_toward_Serious_Games_in_the_Classroom_-_Case_of_Morocco","283167206_Relire_Jacques_Henriot_a_l'ere_de_la_societe_ludique_et_des_jeux_video","279555284_Educational_usages_of_online_games_the_example_of_language_learning_Usages_educatifs_des_jeux_en_ligne_L'exemple_de_l'apprentissage_des_langues","274378317_A_Serious_Game_for_Developing_Computational_Thinking_and_Learning_Introductory_Computer_Programming","273693305_Origins_of_Serious_Games","311472519_A_case_study_of_retention_practices_at_the_University_of_Illinois_at_Urbana-Champaign","307090875_Le_createur_litteraire_et_la_fantaisie","291196987_Programming_Languages_in_Education_The_Search_for_an_Easy_Start","275483718_Extended_analogy"]}