{"id":"323944215_Microservices_Architecting_for_Continuous_Delivery_and_DevOps","abstract":"Businesses today need to respond to customer needs at unprecedented speeds. Driven by this need for speed, many companies are rushing to the DevOps movement and implementing Continuous Delivery (CD). I had been implementing DevOps and CD for Paddy Power, a multi-billion-euro betting and gaming company, for four years. I had found that software architecture can be a key barrier. To address the architectural challenges, we tried an emerging architectural style called Microservices. I have observed increased deployability, modifiability, and resilience to design erosion. At the same time, I also observed new challenges associated with the increased number of services, evolving contracts among services, technology diversity, and testing. I share the practical strategies that can be employed to address these new challenges, discuss situations for which Microservices may not be a good choice, and outline areas that require further research.","authors":["Lianping Chen"],"meta":["March 2018","DOI:10.1109/ICSA.2018.00013","Conference: IEEE International Conference on Software Architecture (ICSA 2018)At: SEATTLE","Project: Continuous Delivery, DevOps, Continuous Software Engineering, Microservices"],"references":["313874428_Continuous_Delivery_Overcoming_Adoption_Challenges","303449436_The_Intersection_of_Continuous_Deployment_and_Architecting_Process_Practitioners'_Perspectives","303296480_Continuous_deployment_at_Facebook_and_OANDA","298902672_Microservices_Architecture_Enables_DevOps_an_Experience_Report_on_Migration_to_a_Cloud-Native_Architecture","280776459_Towards_Architecting_for_Continuous_Delivery","276074339_A_systematic_literature_review_on_SOA_migration","255569055_Characterizing_Architecturally_Significant_Requirements","308819146_Continuous_Deployment_and_Schema_Evolution_in_SQL_Databases","288855582_Speed_Data_and_Ecosystems_The_Future_of_Software_Engineering","286593179_Toward_Design_Decisions_to_Enable_Deployability_Empirical_Study_of_Three_Projects_Reaching_for_the_Continuous_Delivery_Holy_Grail"]}