{"id":"323912690_A_trip_to_work_Estimation_of_origin_and_destination_of_commuting_patterns_in_the_main_metropolitan_regions_of_Haiti_using_CDR","abstract":"The rapid, unplanned urbanisation in Haiti creates a series of urban mobility challenges which can contribute to job market fragmentation and decrease the quality of life in the city. Data on population and job distributions, and on home-work commuting patterns in major urban centres are scarce. The most recent census took place in 2003 and events such as the 2010 earthquake have caused major redistributions of the population. In this data scarce context, our work takes advantage of nationwide de-identified Call Detail Records (CDR) from the main mobile operator in the country to investigate night and daytime populations densities and commuting patterns. We use a non-supervised learning algorithm to identify meaningful locations for individuals. These locations are then labelled according to a scoring criteria. The labelled locations are distributed in a grid with cells measuring 500 × 500 m in order to aggregate the individual level data and to create origin-destination matrices of weighted connections between home and work locations. The results suggest that labor markets are fragmented in Haiti. The two main urban centres, Port-au-Prince and Cap-Haïtien suffer from low employment accessibility as measured by the percentage of the population that travels beyond their identified home cluster (1 km radius) during the day. The data from the origin-destination matrices suggest that only 42 and 40 percent of the population are considered to be commuters in Port-au-Prince and Cap-Haïtien respectively.","authors":["Guilherme Augusto Zagatti","Miguel Gonzalez","Paolo Avner","Nancy Lozano-Gracia"],"meta":["March 2018Development Engineering 3","DOI:10.1016/j.deveng.2018.03.002"],"references":["296626391_Estimation_and_monitoring_of_city-to-city_travel_times_using_call_detail_records","281590314_Returners_and_explorers_dichotomy_in_human_mobility","257647427_Approaching_the_Limit_of_Predictability_in_Human_Mobility","313123448_WorldPop_open_data_for_spatial_demography"]}