{"id":"323932180_Reservoir_Computing_Approaches_for_Representation_and_Classification_of_Multivariate_Time_Series","abstract":"Classification of multivariate time series (MTS) has been tackled with a large variety of methodologies and applied to a wide range of scenarios. Among the existing approaches, reservoir computing (RC) techniques, which implement a fixed and high-dimensional recurrent network to process sequential data, are computationally efficient tools to generate a vectorial, fixed-size representation of the MTS, which can be further processed by standard classifiers. Building upon previous works, in this paper we describe and compare several advanced RC-based approaches to generate unsupervised MTS representations, with a specific focus on their capability of yielding an accurate classification. Our main contribution is a new method to encode the MTS within the parameters of a linear model, trained to predict a low-dimensional embedding of the reservoir dynamics. We also study the combination of this representation technique when enhanced with a more complex bidirectional reservoir and non-linear readouts, such as deep neural networks with both fixed and flexible activation functions. We compare with state-of-the-art recurrent networks, standard RC approaches and time series kernels on multiple classification tasks, showing that the proposed algorithms can achieve superior classification accuracy, while being vastly more efficient to train.","authors":["Filippo Maria Bianchi","Simone Scardapane","Sigurd Løkse","Robert Jenssen"],"meta":["March 2018IEEE Transactions on Neural Networks and Learning Systems PP(99)","DOI:10.1109/TNNLS.2020.3001377"],"references":["334564371_Learning_representations_of_multivariate_time_series_with_missing_data","331474581_Deep_learning_for_time_series_classification_a_review","321496979_Time_Series_Classification_in_Reservoir-_and_Model-Space","319875739_LSTM_Fully_Convolutional_Networks_for_Time_Series_Classification","318332658_Time_series_classification_from_scratch_with_deep_neural_networks_A_strong_baseline","325579228_AF_Classification_from_a_Short_Single_Lead_ECG_Recording_the_PhysioNetComputing_in_Cardiology_Challenge_2017","322612556_Multiobjective_Learning_in_the_Model_Space_for_Time_Series_Classification","321160494_Bidirectional_deep_echo_state_networks","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks"]}