{"id":"323945356_Optimal_order_release_dates_for_two-level_assembly_systems_with_stochastic_lead_times_at_each_level","abstract":"In this paper, we examine an optimisation problem for component replenishment in two-level assembly systems under stochastic lead times. The Assembly-to-Order principle is applied. The demand for a finished product and its planned due date are known. The capacity of the assembly system at each level is considered infinite. At each level, the assembly process starts when all the required components or semi-finished items are available. At the second level, the components are ordered from external suppliers and order release dates are decision variables of the problem. A backlogging cost is incurred if the finished product demand is satisfied after the planned due date. If the finished product, a given component or a semi-finished product is available before the corresponding assembly date, an inventory holding cost is considered. Genetic algorithms (GA) reinforced with different techniques are developed to find order release dates that minimise the total expected cost. A Branch and Bound method is also developed to assess the effectiveness of the hybrid GA. Regardless of the number of components and the variability of the costs related to the finished product, the experimental results indicate that the proposed GA are highly efficient.","authors":["Oussama Ben-Ammar","Alexandre Dolgui"],"meta":["March 2018International Journal of Production Research","DOI:10.1080/00207543.2018.1449268","Project: Supply chain design resilience assessment with structure dynamics considerations"],"references":["340454547_A_Study_on_MRP_with_Using_Leads_Time_Order_Quality_and_Service_Level_over_a_Single_Inventory","298902095_On_Theory_in_Supply_Chain_Uncertainty_and_its_Implications_for_Supply_Chain_Integration","297590934_Component_replenishment_planning_for_a_single-level_assembly_system_under_random_lead_times_A_chance_constrained_programming_approach","281126060_Single-period_inventory_model_for_one-level_assembly_system_with_stochastic_lead_times_and_demand","280140318_A_State_of_the_Art_on_Supply_Planning_and_Inventory_Control_under_Lead_Time_Uncertainty","264626305_A_review_of_discrete-time_optimization_models_for_tactical_production_planning","263728716_A_bibliography_of_non-deterministic_lot-sizing_models","321619629_Planning_Production_and_Inventories_in_the_Extended_Enterprise_A_State_of_the_Art_Handbook_Volume_1","285967953_Handbooks_in_Operations_Research_and_Management_Science","271930404_Planned_Leadtimes_For_Serial_Production_Systems"]}