{"id":"324076115_Qualidade_na_Educacao_Superior_a_Distancia_no_Brasil_Onde_Estamos_para_Onde_Vamos","abstract":"p> A educação superior a distância no Brasil tinha, em 2004, cerca de 60 mil alunos matriculados; cresceu rapidamente e atingiu em 2016 a marca de 1,5 milhão de matrículas, oferecendo importante colaboração para o desenvolvimento do país. Nesse contexto, mais do que nunca, é necessário analisar como se processou esse crescimento e prospectar o futuro, com vista a seu aprimoramento. Foi pesquisado o perfil da oferta atual dos cursos de EaD e comparado com os presenciais. Em 2016 eram 206 Instituições de Ensino Superior (IES) oferecendo EaD, com desempenho médio, medido pelo Enade, equivalente ao dos cursos presenciais. Desse total, apenas cinco IES detinham 58% das matrículas, em sua maioria com cursos com conceito abaixo do patamar de 1,5 nos exames de 2015 e 2016. Isso significa que, na prática, a maioria dos alunos de EaD está frequentando cursos mal avaliados segundo o critério do Enade. Um fato contraditório e alarmente é que essas mesmas IES têm, de maneira geral, resultados do Enade para seus cursos presenciais superiores àqueles obtidos em seus cursos em EaD, indicando que não tratam as duas modalidades com o mesmo critério de responsabilidade. Finalizamos este artigo com a análise do conceito provisório do curso (CPC) e considerando a necessidade de implantar algumas medidas visando ao aprimoramento da oferta na área de Educação a Distância.\n\nPalavras-chave: Qualidade na educação, Educação no Brasil, Educação a distância, Educação presencial, Enade, CPC.\n\nQuality Higher Distance Learning Education: where are we and where are we moving toward to? \n\nAbstrac t \nDistance higher education in Brazil used to have, in 2004, about 60 thousand students enrolled; it grew rapidly and reached the 1.5 million enrollment mark in 2016, providing an important contribution to the development of the country. In this context, more than ever, it is necessary to analyze how this growth was processed and to look at the future, for its improvement. The profile of the current offer of distance education courses was researched and compared with the traditional ones. In 2016 there were 206 Higher Education Institutions (HEIs) offering Distance Learning, with average performance, measured by Enade, equivalent to that of face-to-face courses. Out of this total, only five HEIs held 58% of enrollments, mostly with courses with a concept below 1.5 in the 2015 and 2016 exams. This means that, in practical terms, most DL students are attending poor courses evaluated according to Enade and its criteria. A contradictory and widespread fact is that these same HEIs generally have results from Enade for their on-site courses higher than those obtained in their courses in DL, indicating that they do not treat the two modalities with the same criterion of responsibility. We conclude this article with the analysis of the provisional concept of the course (CPC) and considering the need to implement some measures aimed at improving the offer in the area of Distance Education.\n\nKeywords: Quality in education, Education in Brazil, Distance learning, Traditional learning, Enade, CPC</p","authors":["Carlos Bielschowsky"],"meta":["March 2018","DOI:10.18264/eadf.v8i1.709"],"references":["266749744_Regulating_higher_education_Quality_assurance_and_neo-liberal_managerailism_in_higher_education-A_critical_introduction","239590931_Quality_assessment_and_quality_assurance_in_distance_teacher_education"]}