{"id":"324078015_PIE_A_Domain-Specific_Language_for_Interactive_Software_Development_Pipelines","abstract":"Context. Software development pipelines are used for automating essential parts of software engineering processes, such as build automation and continuous integration testing. In particular, interactive pipelines, which process events in a live environment such as an IDE, require timely results for low-latency feedback, and persistence to retain low-latency feedback between restarts. Inquiry. Developing an incrementalized and persistent version of a pipeline is one way to reduce feedback latency, but requires implementation of dependency tracking, cache invalidation, and other complicated and error-prone techniques. Therefore, interactivity complicates pipeline development if timeliness and persistence become responsibilities of the pipeline programmer, rather than being supported by the underlying system. Systems for programming incremental and persistent pipelines exist, but do not focus on ease of development, requiring a high degree of boilerplate, increasing development and maintenance effort. Approach. We develop Pipelines for Interactive Environments (PIE), a Domain-Specific Language (DSL), API, and runtime for developing interactive software development pipelines, where ease of development is a focus. The PIE DSL is a statically typed and lexically scoped language. PIE programs are compiled to programs implementing the API, which the PIE runtime executes in an incremental and persistent way. Knowledge. PIE provides a straightforward programming model that enables direct and concise expression of pipelines without boilerplate, reducing the development and maintenance effort of pipelines. Compiled pipeline programs can be embedded into interactive environments such as code editors and IDEs, enabling timely feedback at a low cost. Grounding. Compared to the state of the art, PIE reduces the code required to express an interactive pipeline by a factor of 6 in a case study on syntax-aware editors. Furthermore, we evaluate PIE in two case studies of complex interactive software development scenarios, demonstrating that PIE can handle complex interactive pipelines in a straightforward and concise way. Importance. Interactive pipelines are complicated software artifacts that power many important systems such as continuous feedback cycles in IDEs and code editors, and live language development in language workbenches. New pipelines, and evolution of existing pipelines, is frequently necessary. Therefore, a system for easily developing and maintaining interactive pipelines, such as PIE, is important.","authors":["Gabriël Konat","Michael J. Steindorfer","Sebastian Erdweg","Eelco Visser"],"meta":["March 2018The Art Science and Engineering of Programming 2(3)","DOI:10.22152/programming-journal.org/2018/2/9"],"references":["281712054_A_Theory_of_Name_Resolution","274074393_YAWL_yet_another_workflow_language","273058226_Spores_A_Type-Based_Foundation_for_Closures_in_the_Age_of_Concurrency_and_Distribution","311489968_A_constraint_language_for_static_semantic_analysis_based_on_scope_graphs","310824203_Non-recursive_make_considered_harmful_build_systems_at_scale","310821226_Bootstrapping_domain-specific_meta-languages_in_language_workbenches","308894677_Domain-Specific_Languages_Dagstuhl_Seminar_15062","307090523_IncA_a_DSL_for_the_definition_of_incremental_program_analyses","283771961_Declarative_Name_Binding_and_Scope_Rules","281334201_Evaluating_And_Comparing_Language_Workbenches_Existing_Results_And_Benchmarks_For_The_Future"]}