{"id":"324054916_When_Subgraph_Isomorphism_is_Really_Hard_and_Why_This_Matters_for_Graph_Databases","abstract":"The subgraph isomorphism problem involves deciding whether a copy of a pattern graph occurs inside a larger target graph. The non-induced version allows extra edges in the target, whilst the induced version does not. Although both variants are NP-complete, algorithms inspired by constraint programming can operate comfortably on many real-world problem instances with thousands of vertices. However, they cannot handle arbitrary instances of this size. We show how to generate “really hard” random instances for subgraph isomorphism problems, which are computationally challenging with a couple of hundred vertices in the target, and only twenty pattern vertices. For the non-induced version of the problem, these instances lie on a satisfiable / unsatisfiable phase transition, whose location we can predict; for the induced variant, much richer behaviour is observed, and constrainedness gives a better measure of difficulty than does proximity to a phase transition. These results have practical consequences: we explain why the widely researched “filter / verify” indexing technique used in graph databases is founded upon a misunderstanding of the empirical hardness of NP-complete problems, and cannot be beneficial when paired with any reasonable subgraph isomorphism algorithm.","authors":["Ciaran Mccreesh","Patrick Prosser","Christine Solnon","James Trimble"],"meta":["March 2018Journal of Artificial Intelligence Research 61","DOI:10.1613/jair.5768"],"references":["313898724_A_Minimal_Rare_Substructures-Based_Model_for_Graph_Database_Indexing","283189571_Performance_and_scalability_of_indexed_subgraph_query_processing_methods","322893605_On_the_Glucose_SAT_solver","316449785_Challenging_the_Time_Complexity_of_Exact_Subgraph_Isomorphism_for_Huge_and_Dense_Graphs_with_VF3","302942781_Exacts_and_Inexacts_methods_for_graph_similarity_in_Structural_Pattern_Recognition","300581415_Updating_Graph_Indices_with_a_One-Pass_Algorithm","294723417_Online_Subgraph_Skyline_Analysis_Over_Knowledge_Graphs","292449753_Customising_compilers_for_customisable_processors","289569803_On_the_Variable_Ordering_in_Subgraph_Isomorphism_Algorithms","274343540_An_in-depth_comparison_of_subgraph_isomorphism_algorithms_in_graph_databases"]}