{"id":"324036323_Gamified_In-Home_Rehabilitation_for_Stroke_Survivors_Analytical_Review","abstract":"A stroke is a life-changing event that may end up as a disability, with repercussions on the patient’s quality of life. Stroke rehabilitation therapies are helpful to regain some of the patient’s lost functionality. However, in practice stroke patients may suffer from a gradual loss of motivation. Gamified systems are used to increase user motivation, hence, gamified elements have been implemented into stroke rehabilitation therapies in order to improve patients’ engagement and adherence. This review work focuses on selecting and analyzing developed and validated gamified stroke rehabilitation systems published between 2009 and 2017 to identify the most important features of these systems. After extensive research, 32 articles have met the selection criteria, resulting in a total of 28 unique works. The works were analyzed and a total of 20 features were identified. The features are explained, making emphasis on the works that implement them extensively. Finally, a classification of features based on objectives is proposed, which was used to identify the relationships between features and implementation gaps. It was found that there is a tendency to develop low-cost solutions as in-home therapy systems and provide a variety of games. This review allowed the definition of the opportunities for future research direction such as systems addressing the three rehabilitation areas; data analytics to make decisions; motivational content identification based on automatic engagement detection and emotion recognition; and alert systems for patient´s safety.","authors":["Paul Tamayo-Serrano","Samir Garbaya","Pierre Blazevic"],"meta":["March 2018International Journal of Serious Games 5(1)","DOI:10.17083/ijsg.v5i1.224"],"references":["319891180_SITAR_a_system_for_independent_task-oriented_assessment_and_rehabilitation","310492157_Accuracy_and_Reliability_of_the_Kinect_Version_2_for_Clinical_Measurement_of_Motor_Function","309619078_Benefits_of_virtual_reality_based_cognitive_rehabilitation_through_simulated_activities_of_daily_living_a_randomized_controlled_trial_with_stroke_patients","309342032_Accuracy_evaluation_of_the_Kinect_v2_sensor_during_dynamic_movements_in_a_rehabilitation_scenario","306079114_Self-directed_arm_therapy_at_home_after_stroke_with_a_sensor-based_virtual_reality_training_system","318494438_Flow_the_psychology_of_optimal_experience","314884297_A_Game-Based_Solution_for_In-Home_Rehabilitation","308855334_Automatic_assessment_of_upper_limb_function_during_play_of_the_action_video_game_circus_challenge_validity_and_sensitivity_to_change","304605237_Evaluation_of_Pose_Tracking_Accuracy_in_the_First_and_Second_Generations_of_Microsoft_Kinect","303693962_Essential_features_of_serious_games_design_in_higher_education_Linking_learning_attributes_to_game_mechanics_Essential_features_of_serious_games_design"]}