{"id":"324055958_SEAT_A_Taxonomy_to_Characterize_Automation_in_Software_Engineering","abstract":"Reducing cost and time required to build high quality software is a major goal for software developers. Building tools and techniques that can help achieve such a goal is the chief aim for Automated Software Engineering (ASE) researchers. However, in order to be effective an ASE researcher or professional must understand the characteristics of both successful and not-so-successful ASE tools, and the constituent techniques employed by such ASE tools. In this paper we present such a characterization of ASE tools and major constituent techniques from different areas of computer science and engineering that have been employed by such ASE tools. To develop the characterization we carried out an extensive systematic literature review over about 1175 ASE research articles. One of our key goal was to identify useful relationships among ASE tools, their constituent techniques and the software development life cycle activities that these tools targeted. In terms of changes in popularity of constituent techniques with time we did not observe any clear trend. We organized the results of our characterization as a taxonomy called SEAT (Software Engineering Automation Taxonomy). A salient feature of SEAT is that it focuses on automation of activities from all phases of SDLC. Such a taxonomy, among other applications, shall enable synthesizing new automation tools for different SDLC activities. Recomposing existing systems to achieve better features will also be possible. Further, the taxonomy has been realized as a graph database using neo4j(an open source graph database), which can be queried using an SQL like language. The graph database allowed us to uncover hidden relationships by way of exhaustive search for connections and paths between different nodes (i.e. concepts). We demonstrate the efficacy of SEAT by discussing few practical use cases.","authors":["Shipra Sharma","Balwinder Sodhi"],"meta":["March 2018"],"references":["261392355_Benefits_and_limitations_of_automated_software_testing_Systematic_literature_review_and_practitioner_survey","260155792_A_systematic_literature_review_of_software_requirements_prioritization_research","323431523_SOFTWARE_ENGINEERING_IS_ENGINEERING","308850601_Automatic_and_Continuous_Software_Architecture_Validation","307860372_Review_of_Systematic_Literature_Review_Tools","303515566_Improvements_in_the_StArt_tool_to_better_support_the_systematic_review_process","288128024_Managing_Literature_reviews_information_through_visualization","271589479_Guidelines_for_performing_systematic_literature_reviews_in_software_engineering","262206388_An_orchestrated_survey_on_automated_software_test_case_generation","261270949_AutoComment_Mining_question_and_answer_sites_for_automatic_comment_generation","256473981_A_Taxonomy_for_Requirements_Engineering_and_Software_Test_Alignment","220093079_The_Guide_to_the_Software_Engineering_Body_of_Knowledge","221336494_Dimensions_in_Program_Synthesis"]}