{"id":"324009077_Integrated_production_quality_control_and_condition-based_maintenance_for_imperfect_production_systems","abstract":"This paper considers an integrated problem of production lot sizing, quality control and condition-based maintenance for an imperfect production system subject to both reliability and quality degradations. The system produces a single type of product to meet constant demand. To provide protection to the stock against uncertainties, a make-to-stock production policy is employed. The condition-based maintenance policy consists in carrying out inspections at the end of production runs to evaluate system condition and performing imperfect preventive maintenance if detected degradation level exceeds the threshold. The quality control is performed by using 100% inspection policy to obtain the proportion of defectives. Based on the quality information feedback, an overhaul action is conducted once the proportion reaches a given threshold during production runs. The aim of this paper is to jointly optimize the lot size, the inventory threshold, the preventive maintenance and overhaul thresholds such that the total cost per unit time is minimized. A stochastic mathematical model is formulated and solved by a simulation-based optimization approach coupling Monte Carlo Simulation and Response Surface Methodology. Finally, an illustrative example and sensitivity analyses are provided to demonstrate the proposed model.","authors":["Guo Qing Cheng","Bing Hai Zhou","Ling Li"],"meta":["March 2018Reliability Engineering [?] System Safety 175","DOI:10.1016/j.ress.2018.03.025"],"references":["318113052_Integrated_predictive_maintenance_strategy_for_manufacturing_systems_by_combining_quality_control_and_mission_reliability_analysis","286376496_Age-dependent_production_and_replacement_strategies_in_failure-prone_manufacturing_systems","257337899_Joint_control_of_production_overhaul_and_preventive_maintenance_for_a_production_system_subject_to_quality_and_reliability_deteriorations","316468414_Dynamic_Optimization_of_Process_Quality_Control_and_Maintenance_Planning","310394007_Modeling_condition-based_maintenance_and_replacement_strategies_for_an_imperfect_production-inventory_system","262580392_An_integrated_simulation-analysis_of_variance_methodology_for_effective_analysis_of_CBM_alternatives"]}