{"id":"324008982_Congestion_Control_in_Wireless_Sensor_Networks_by_Hybrid_Multi-Objective_Optimization_Algorithm","abstract":"In this paper, a new congestion control algorithm for Wireless Sensor Networks is proposed. The existing algorithms for this problem have high complexity and power usage due to retransmission with congestion control being carried out by finding the optimal rate through a simple Poisson process. Retransmission of the colliding packets causes wastage of energy since wireless sensor network has limited battery. It has been realized that heuristic based methods offer better rate than the simple Poisson process. Besides, energy of the nodes was not considered in the fitness function of the related algorithms, which can lead to node failure when low energy nodes are used for sending high amount of packets. In order to handle those limitations, we propose a congestion control algorithm based on the multi-objective optimization algorithm named PSOGSA for rate optimization and regulating arrival rate of data from every child node to the parent node. A multi-objective optimization function taking into consideration the energy of the node in its fitness function is used. The priority based transmission is enabled as the optimization approach regulates the arrival rate on the basis of priority: output available bandwidth and energy of the child node. To mitigate the congestion, adjustment of rate to optimum value is used. The new algorithm is implemented in MATLAB R2016a and compared against the existing Cuckoo Search (CS) and Adaptive Cuckoo Search (ACS) algorithms. Simulation results prove that proposed mechanism has better results than the existing approaches.","authors":["Karishma Singh","Karan Singh","Le Hoang Son","Ahmed Aziz"],"meta":["March 2018Computer Networks 138","DOI:10.1016/j.comnet.2018.03.023"],"references":["311088016_Improving_lifetime_and_network_connections_of_3D_wireless_sensor_networks_based_on_fuzzy_clustering_and_particle_swarm_optimization","257676113_COCM_Class_Based_Optimized_Congestion_Management_Protocol_for_Healthcare_Wireless_Sensor_Networks"]}