{"id":"324055318_Evolutionary_n-level_Hypergraph_Partitioning_with_Adaptive_Coarsening","abstract":"Hypergraph partitioning is an NP-hard problem that occurs in many computer science applications where it is necessary to reduce large problems into a number of smaller, computationally tractable sub-problems. Current techniques use a multilevel approach wherein an initial partitioning is performed after compressing the hypergraph to a predetermined level. This level is typically chosen to produce very coarse hypergraphs in which heuristic algorithms are fast and effective. This article presents a novel memetic algorithm which remains effective on larger initial hypergraphs. This enables the exploitation of information that can be lost during coarsening and results in improved final solution quality. We use this algorithm to present an empirical analysis of the space of possible initial hypergraphs in terms of its searchability at different levels of coarsening. We find that the best results arise at coarsening levels unique to each hypergraph. Based on this, we introduce an adaptive scheme that stops coarsening when the rate of information loss in a hypergraph becomes non-linear and show that this produces further improvements. The results show that we have identified a valuable role for evolutionary algorithms within the current state-of-the-art hypergraph partitioning framework.","authors":["Richard J. Preen","Jim Smith"],"meta":["December 2019IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council 23(6):962-971","DOI:10.1109/TEVC.2019.2896951"],"references":["320336136_Improving_Coarsening_Schemes_for_Hypergraph_Partitioning_by_Exploiting_Community_Structure","310515157_Recent_Advances_in_Graph_Partitioning","309858392_Engineering_a_direct_k-way_Hypergraph_Partitioning_Algorithm","320241489_Memetic_Multilevel_Hypergraph_Partitioning","315749851_Combinatorial_Algorithms_for_Integrated_Circuit_Layout","313868294_Parallel_Graph_Partitioning_for_Complex_Networks","313803357_Evolving_Multi-level_Graph_Partitioning_Algorithms","309449601_An_Adaptive_Multipopulation_Differential_Evolution_With_Dynamic_Population_Reduction","304747181_BOA_The_Bayesian_optimization_algorithm","303836138_A_Recursive_Hypergraph_Bipartitioning_Framework_for_Reducing_Bandwidth_and_Latency_Costs_Simultaneously"]}