{"id":"324089096_A_bibliometric_analysis_of_natural_language_processing_in_medical_research","abstract":"Background: \nNatural language processing (NLP) has become an increasingly significant role in advancing medicine. Rich research achievements of NLP methods and applications for medical information processing are available. It is of great significance to conduct a deep analysis to understand the recent development of NLP-empowered medical research field. However, limited study examining the research status of this field could be found. Therefore, this study aims to quantitatively assess the academic output of NLP in medical research field.\n\nMethods: \nWe conducted a bibliometric analysis on NLP-empowered medical research publications retrieved from PubMed in the period 2007-2016. The analysis focused on three aspects. Firstly, the literature distribution characteristics were obtained with a statistics analysis method. Secondly, a network analysis method was used to reveal scientific collaboration relations. Finally, thematic discovery and evolution was reflected using an affinity propagation clustering method.\n\nResults: \nThere were 1405 NLP-empowered medical research publications published during the 10 years with an average annual growth rate of 18.39%. 10 most productive publication sources together contributed more than 50% of the total publications. The USA had the highest number of publications. A moderately significant correlation between country's publications and GDP per capita was revealed. Denny, Joshua C was the most productive author. Mayo Clinic was the most productive affiliation. The annual co-affiliation and co-country rates reached 64.04% and 15.79% in 2016, respectively. 10 main great thematic areas were identified including Computational biology, Terminology mining, Information extraction, Text classification, Social medium as data source, Information retrieval, etc. CONCLUSIONS: A bibliometric analysis of NLP-empowered medical research publications for uncovering the recent research status is presented. The results can assist relevant researchers, especially newcomers in understanding the research development systematically, seeking scientific cooperation partners, optimizing research topic choices and monitoring new scientific or technological activities.","authors":["Xieling Chen","Haoran Xie","Fu Lee Wang","Ziqing Liu"],"meta":["March 2018BMC Medical Informatics and Decision Making 18(Suppl 1):14","DOI:10.1186/s12911-018-0594-x"],"references":["317704068_Analyzing_the_field_of_bioinformatics_with_the_multi-faceted_topic_modeling_technique","317085841_Clinical_Word_Sense_Disambiguation_with_Interactive_Search_and_Classification","315503570_The_Changing_Landscape_of_Neuroscience_Research_2006-2015_A_Bibliometric_Study","321140301_Discovering_the_Recent_Research_in_Natural_Language_Processing_Field_Based_on_a_Statistical_Approach","320300637_A_Data-Driven_Approach_for_Discovering_the_Recent_Research_Status_of_Diabetes_in_China","318147343_Large-scale_extraction_of_drug-disease_pairs_from_the_medical_literature","313362005_Discovering_Commonly_Shared_Semantic_Concepts_of_Eligibility_Criteria_for_Learning_Clinical_Trial_Design","309960438_Web-based_Real-Time_Case_Finding_for_the_Population_Health_Management_of_Patients_With_Diabetes_Mellitus_A_Prospective_Validation_of_the_Natural_Language_Processing-Based_Algorithm_With_Statewide_Elec","309884355_Clinical_Natural_Language_Processing_in_2015_Leveraging_the_Variety_of_Texts_of_Clinical_Interest","309876851_Aspiring_to_Unintended_Consequences_of_Natural_Language_Processing_A_Review_of_Recent_Developments_in_Clinical_and_Consumer-Generated_Text_Processing"]}