{"id":"324013015_Publication_patterns_in_the_social_sciences_and_humanities_evidence_from_eight_European_countries","abstract":"This study investigates patterns in the language and type of social sciences and humanities (SSH) publications in non-English speaking European countries to demonstrate that such patterns are related not only to discipline but also to each country’s cultural and historic heritage. We investigate publication patterns that occur across SSH publications of the whole of the SSH and of economics and business, law, and philosophy and theology publications in the Czech Republic, Denmark, Finland, Flanders (Belgium), Norway, Poland, Slovakia, and Slovenia. We use data from 74,022 peer-reviewed publications from 2014 registered in at least one of the eight countries’ national databases and for 272,376 peer-reviewed publications from the period of 2011–2014 registered in at least one of the seven countries’ national databases (for all countries except Slovakia). Our findings show that publication patterns differ both between fields (e.g. patterns in law differ from those in economics and business in the same way in Flanders and Finland) and within fields (e.g. patterns in law in the Czech Republic differ from patterns in law in Finland). We observe that the publication patterns are stable and quite similar in West European and Nordic countries, whereas in Central and Eastern European countries the publication patterns demonstrate considerable changes. Nevertheless, in all countries, the share of articles and the share of publications in English is on the rise. We conclude with recommendations for science policy and highlight that internationalization policies in non-English speaking countries should consider various starting points and cultural heritages in different countries.","authors":["Emanuel Kulczycki","Tim Engels","Janne Pölönen","Kasper Bruun"],"meta":["March 2018Scientometrics 116(4)","DOI:10.1007/s11192-018-2711-0","Projects: Współczesna polska humanistyka wobec wyzwań naukometrii (Contemporary Polish Humanities in the face of the Challenges of Scientometric)ENRESSH"],"references":["325818109_Comprehensiveness_of_national_bibliographic_databases_for_social_sciences_and_humanities_Findings_from_a_European_survey","325253053_A_comparison_of_cognitive_and_organizational_classification_of_publications_in_the_social_sciences_and_humanities","321075836_On_The_Route_Towards_Renewal_The_Polish_Academy_Of_Sciences_In_Post-Socialist_Context","320841936_Publication_patterns_in_the_social_sciences_and_humanities_in_Flanders_and_Poland","303783894_Scholarly_publication_patterns_in_the_social_sciences_and_humanities_and_their_coverage_in_Scopus_and_Web_of_Science","301528886_Publication-Based_Funding_The_Norwegian_Model","298939570_Grand_challenges_in_data_integration-state_of_the_art_and_future_perspectives_an_introduction","297369590_Scholarly_publication_patterns_in_the_social_sciences_and_humanities_and_their_coverage_in_Scopus_and_Web_of_Science","312316289_Assessing_publications_through_a_bibliometric_indicator_The_case_of_comprehensive_evaluation_of_scientific_units_in_Poland","312130129_Toward_an_excellence-based_research_funding_system_Evidence_from_Poland"]}