{"id":"324089533_Diabetes_classification_model_based_on_boosting_algorithms","abstract":"Background: \nDiabetes mellitus is a common and complicated chronic lifelong disease. Hence, it is of high clinical significance to find the most relevant clinical indexes and to perform efficient computer-aided pre-diagnoses and diagnoses.\n\nResults: \nNon-parametric statistical testing is performed on hundreds of medical measurement index results between diabetic and non-diabetic populations. Two common boosting algorithms, Adaboost.M1 and LogitBoost, are selected to establish a machine model for diabetes diagnosis based on these clinical test data, involving a total of 35,669 individuals. The machine classification models built by these two algorithms have very good classification ability. Here, the LogitBoost classification model is slightly better than the Adaboost.M1 classification model. The overall accuracy of the LogitBoost classification model reached 95.30% when using 10-fold cross validation. The true positive, true negative, false positive, and false negative rates of the binary classification model were 0.921, 0.969, 0.031, and 0.079, respectively, and the area under the receiver operating characteristic curve reached 0.99.\n\nConclusions: \nThe boosting algorithms show excellent performance for the diabetes classification models based on clinical medical data. The coefficient matrix of the original data is a sparse matrix, because some of the test results were missing, including some that were directly related to disease diagnosis. Therefore, the model is robust and has a degree of pre-diagnosis function. In the process of selecting the preferred test items, the most statistically significant discriminating factors between the diabetic and general populations were obtained and can be used as reference risk factors for diabetes mellitus.","authors":["Peihua Chen","Chuandi Pan"],"meta":["March 2018BMC Bioinformatics 19(1):109","DOI:10.1186/s12859-018-2090-9"],"references":["318141628_EFS_An_ensemble_feature_selection_tool_implemented_as_R-package_and_web-application","310765952_Compensation_of_feature_selection_biases_accompanied_with_improved_predictive_performance_for_binary_classification_by_using_a_novel_ensemble_feature_selection_approach","285392550_Free_Triiodothyronine_Levels_Are_Associated_with_Diabetic_Nephropathy_in_Euthyroid_Patients_with_Type_2_Diabetes","280997513_Normal_liver_enzymes_are_correlated_with_severity_of_metabolic_syndrome_in_a_large_population_based_cohort","308822762_Predictive_and_preventive_models_for_diabetes_prevention_using_clinical_information_in_electronic_health_record","301904725_The_rising_cost_of_diabetes_care_in_the_USA","298733850_On_the_convergence_of_nanotechnology_and_Big_Data_analysis_for_computer-aided_diagnosis","296691242_Data-mining_to_build_a_knowledge_representation_store_for_clinical_decision_support_Studies_on_curation_and_validation_based_on_machine_performance_in_multiple_choice_medical_licensing_examinations","295395871_Correlation_between_the_plasma_fibrinogen_concentration_and_coronary_heart_disease_severity_in_Moroccan_patients_with_type_2_diabetes_Prospective_study","290625583_Cancer-Disease_Associations_A_Visualization_and_Animation_through_Medical_Big_Data"]}