{"id":"324125329_A_Comprehensive_Survey_on_the_Reliability_of_Mobile_Wireless_Sensor_Networks_Taxonomy_Challenges_and_Future_Directions","abstract":"With the development and popularization of mobile terminal technology, mobile wireless sensor networks (MWSNs) have become a new evolution trend in wireless sensor networks (WSNs) technology. The mobility of nodes introduced by MWSNs greatly expands the application range of WSNs. However, the mobility of the sink node also induces changes of the network topology, time delays, and packet loss rates, which can greatly affect the routing performance of the networks. In addition, the reliability and robustness of the networks are also greatly affected and challenged. The theories and methods applied to WSNs previously, such as data collection, reliable data transmission, network reliability, network topologies, and routing protocols are not currently available for MWSNs. The introduction of mobility features into traditional static WSNs brings new challenges for the stability, security, and reliability of WSNs. Reliability is an important index for evaluating the performance of MWSNs. Moreover, the reliability of the data transmission determines the practical value of MWSNs. The stable and reliable operation of MWSNs requires ongoing and important work. Therefore, in this article, we present a comprehensive and meticulous investigation of the reliability theory of MWSNs which was developed in recent years. This article outlines the classification and features of MWSNs. Specifically, we systematically analyze the research direction and recent progress made in the field of MWSNs. The existing methods are systematically compared and the advantages and disadvantages of the methods are presented. The main parameters of comparison include time delays, network size, energy efficiency, scalability, and reliability. Finally, some open questions and future research directions are presented at the end of this article.","authors":["Ying-Gao Yue","Ping He"],"meta":["March 2018Information Fusion 44","DOI:10.1016/j.inffus.2018.03.005"],"references":["323484152_Improving_Reliability_of_Wireless_Sensor_Network_WSN_Using_Network_Coding_Multipath_Routing","320905813_Fault_Prediction_Based_on_the_Kernel_Function_for_Ribbon_Wireless_Sensor_Networks","318277261_The_Reliability_of_Wireless_Sensor_Network_on_Pipeline_Monitoring_System","316145619_A_Survey_on_Routing_Protocols_for_Wireless_Sensor_Networks_with_Mobile_Sink_Application","321135858_Improving_Energy_Efficiency_and_Reliability_of_Wireless_Sensor_Networks_with_MC-AODV_Routing_Protocol","318491538_Assessment_of_Data_Reliability_of_Wireless_Sensor_Network_for_Bioinformatics","318476586_Towards_a_Complete_Virtual_Data_Center_Embedding_Algorithm_Using_Hybrid_Strategy","316054140_Threshold_distance-based_cluster_routing_protocols_for_static_and_mobile_wireless_sensor_networks","315854249_Adaptive_Forward_Error_Correction_Scheme_to_Improve_Data_Reliability_in_Solar-Powered_Wireless_Sensor_Networks","309264415_Optimization-based_extreme_learning_machine_for_data_fusion_in_mobile_wireless_sensor_networks"]}