{"id":"324181860_StarCraft_Micromanagement_With_Reinforcement_Learning_and_Curriculum_Transfer_Learning","abstract":"Real-time strategy games have been an important field of game artificial intelligence in recent years. This paper presents a reinforcement learning and curriculum transfer learning method to control multiple units in StarCraft micromanagement. We define an efficient state representation, which breaks down the complexity caused by the large state space in the game environment. Then a parameter sharing multi-agent gradientdescent Sarsa({\\lambda}) (PS-MAGDS) algorithm is proposed to train the units. The learning policy is shared among our units to encourage cooperative behaviors. We use a neural network as a function approximator to estimate the action-value function, and propose a reward function to help units balance their move and attack. In addition, a transfer learning method is used to extend our model to more difficult scenarios, which accelerates the training process and improves the learning performance. In small scale scenarios, our units successfully learn to combat and defeat the built-in AI with 100% win rates. In large scale scenarios, curriculum transfer learning method is used to progressively train a group of units, and shows superior performance over some baseline methods in target scenarios. With reinforcement learning and curriculum transfer learning, our units are able to learn appropriate strategies in StarCraft micromanagement scenarios.","authors":["Kun Shao","Yuanheng Zhu","Dongbin Zhao"],"meta":["April 2018IEEE Transactions on Emerging Topics in Computational Intelligence PP(99)","DOI:10.1109/TETCI.2018.2823329"],"references":["324686165_Recent_progress_of_deep_reinforcement_learningfrom_AlphaGo_to_AlphaGo_Zero","322995253_Cooperative_reinforcement_learning_for_multiple_units_combat_in_starCraft","321143620_Insights_on_Transfer_Optimization_Because_Experience_is_the_Best_Teacher","320821388_A_Unified_Game-Theoretic_Approach_to_Multiagent_Reinforcement_Learning","320473480_Mastering_the_game_of_Go_without_human_knowledge","331477508_A_Unified_Game-Theoretic_Approach_to_Multiagent_Reinforcement_Learning","321286614_Cooperative_Multi-agent_Control_Using_Deep_Reinforcement_Learning","319770330_Prioritized_Experience_Replay","319769991_Trust_Region_Policy_Optimization","317399486_Multi-Agent_Actor-Critic_for_Mixed_Cooperative-Competitive_Environments"]}