{"id":"324119771_On_the_Fintech_Revolution_Interpreting_the_Forces_of_Innovation_Disruption_and_Transformation_in_Financial_Services","abstract":"The financial services industry has been experiencing the recent emergence of new technology innovations and process disruptions. The industry overall, and many fintech start-ups are looking for new pathways to successful business models, the creation of enhanced customer experience, and approaches that result in services transformation. Industry and academic observers believe this to be more of a revolution than a set of less influential changes, with financial services as a whole due for major improvements in efficiency, customer centricity, and informedness. The long-standing dominance of leading firms that are not able to figure out how to effectively hook up with the “Fintech Revolution” is at stake. We present a new fintech innovation mapping approach that enables the assessment of the extent to which there are changes and transformations in four areas of financial services. We discuss: operations management in financial services and the changes occurring; technology innovations that have begun to leverage the execution and stakeholder value associated with payments, cryptocurrencies, blockchain, and cross-border payments; multiple innovations that have affected lending and deposit services, peer-to-peer (P2P) lending, and social media use; issues with respect to investments, financial markets, trading, risk management, robo-advisory and services influenced by blockchain and fintech innovations.","authors":["Peter Gomber","Robert J. Kauffman","Chris Parker","Bruce W. Weber"],"meta":["January 2018Journal of Management Information Systems 35(1):220-265","DOI:10.1080/07421222.2018.1440766"],"references":["324118265_How_Does_Social_Media_Impact_Bitcoin_Value_A_Test_of_the_Silent_Majority_Hypothesis","324117290_Disentangling_Digital_Platform_Competition_The_Case_of_UK_Mobile_Payment_Platforms","321016831_Investor_Platform_Choice_Herding_Platform_Attributes_and_Regulations","340357011_The_completion_effect_in_charitable_crowdfunding","324119674_The_Role_of_Provision_Points_in_Online_Crowdfunding","324116479_The_Innovation_Mechanisms_of_Fintech_Start-Ups_Insights_from_SWIFT's_Innotribe_Competition","324116382_Cheap_Talk_The_Impact_of_Lender-Borrower_Communication_on_Peer-to-Peer_Lending_Outcomes","321566318_Creating_Value_in_Financial_Services_Strategies_Operations_and_Technologies","321093694_On_the_Role_of_Provision_Points_in_Online_Crowdfunding","320790603_How_Does_Online_Lending_Influence_Bankruptcy_Filings_Evidence_from_a_Natural_Experiment"]}