{"id":"324168952_Modelisation_praxeologique_des_connaissances_en_biologie_pour_realiser_un_diagnostic_automatique_de_la_conception_de_protocoles_par_les_eleves_avec_la_plate-forme_LabBook","abstract":"Cet article s'inscrit dans un travail de modélisation des connaissances pour effectuer un diagnostic automatique des erreurs dans une situation expérimentale en biologie, et plus précisément sur la mise en évidence de la fermentation alcoolique chez les levures. Le cadre théorique utilisé est celui de la Théorie Anthropologique du Didactique (Chevallard, 1999) et plus spécifiquement dans l'approche praxéologique (Bosch et Chevallard, 1999). Nous proposons un modèle de pré-structuration de protocole afin qu'il puisse être implémenté dans une plate-forme informatique de conception de protocoles expérimentaux, LabBook (d'Ham et al., 2014). La pré-structuration s'appuie sur une analyse épistémologique des connaissances et des difficultés relatives aux concepts liés à la fermentation alcoolique. Notre modélisation sera par la suite testée en classe de terminale scientifique de spécialité, afin d'anticiper un diagnostic des erreurs, qui sera réalisé dans un deuxième temps. Mots-clés : TAD, EIAH, protocole expérimental, pré structuration, difficultés. Contexte de la recherche Ce sujet s'inscrit dans un travail de thèse dont le but est de modéliser des connaissances pour effectuer un diagnostic automatique des erreurs d'élèves de Terminal S, spécialité SVT, et de prévoir des rétroactions. Nous modélisons les connaissances mises en jeu lors d'une activité de conception expérimentale sur le thème des métabolismes cellulaires, et plus particulièrement la fermentation alcoolique, en utilisant le cadre de la Théorie Anthropologique du Didactique (Chevallard, 1992, 1999). Les élèves doivent structurer un protocole sous forme d'étapes et d'actions avec l'éditeur de protocole Copex de la plate-forme LabBook (d'Ham et al., 2014). Nous proposons une pré-structuration de ce protocole, qui prend en compte les difficultés des élèves identifiées a priori. Une expérimentation suivra afin de tester l'efficacité de la prise en charge par le logiciel de ces difficultés. Etat de l'art, cadre théorique et questions de recherche La modélisation des connaissances s'inscrit dans le cadre de la TAD (Chevallard, 1992, 1999) et plus spécifiquement dans l'approche praxéologique (Bosch et Chevallard, 1999). Elle considère que toute activité humaine consiste à accomplir une tâche t d'un certain type T, au moyen d'une technique τ, justifiée par une technologie θ, elle-même légitimée par une théorie Θ. Cela met en oeuvre une organisation que Chevallard (1999) note [T/t/τ/θ/Θ] et qu'il nomme praxéologie, ou organisation praxéologique. Dans sa théorie il en distingue 1 labbok.imag.fr. Cette plateforme est développée au sein de l'équipe MeTAH du LIG, par des chercheurs informaticiens et didacticiens des sciences.","authors":["Catherine Bonnat","Patricia Marzin","Isabelle Girault"],"meta":["March 2016","Conference: 9e rencontres scientifiques de l'ARDISTAt: Lens, France"],"references":["281661224_Des_environnements_numeriques_pour_etayer_l'investigation_scientifique_et_la_conception_experimentale_de_copex-chimie_a_LabBook","279258616_Utilisation_du_modele_praxeologique_de_reference_dans_un_EIAH","27604317_DES_LYCEENS_FACE_A_UNE_INVESTIGATION_A_CARACTERE_EXPERIMENTAL_UN_EXEMPLE_EN_PREMIERE_S","292702896_L'analyse_des_pratiques_enseignantes_en_theorie_anthropologique_du_didactique","248975071_Representation_of_the_cell_and_its_processes_in_high_school_students_An_integrated_view","229613034_Understanding_cellular_respiration_An_analysis_of_conceptual_change_in_college_biology","27604197_L'equation-bilan_en_chimie_un_concept_integrateur_source_de_difficultes_persistantes","27604196_Releve_de_quelques_obstacles_epistemologiques_dans_l'apprentissage_du_concept_de_reaction_chimique"]}