{"id":"324120229_Monocular_microsaccades_Do_they_really_occur","abstract":"Small saccades, known as microsaccades, occur frequently during fixation. Several recent studies have argued that a considerable fraction of these movements are present in the traces from one eye only. This claim contrasts with the findings of older reports, which concluded that microsaccades, like larger saccades, are virtually always binocular events. Here we examined the characteristics of small saccades by means of two of the most established high-resolution eye-tracking techniques available. A binocular Dual Purkinje Image eye-tracker was used to record eye movements while observers fixated, with their head immobilized, on markers displayed on a monitor. A specially designed eye-coil system was used to measure eye movements during normal head-free viewing, while subjects fixated on markers at various distances. Monocular microsaccades were virtually absent in both datasets. In the head-fixed data, not a single monocular microsaccade was observed. In the head-free data, only one event appeared to be monocular out of more than a thousand saccades. Monocular microsaccades do not seem to occur during normal head-free or head-immobilized fixation.","authors":["Yu Fang","Christopher Gill","Martina Poletti","Michele Rucci"],"meta":["March 2018Journal of Vision 18(3)","DOI:10.1167/18.3.18"],"references":["312655442_Bayesian_microsaccade_detection","301289441_Eye_movements_between_saccades_Measuring_ocular_drift_and_tremor","295910534_Monocular_microsaccades_are_visual-task_related","287404783_Head-Eye_Coordination_at_a_Microscopic_Scale","283798318_Control_and_Functions_of_Fixational_Eye_Movements","274947962_Correcting_video-based_eye_tracking_signals_for_pupil_size_artifacts","272840130_Effects_of_aging_on_eye_movements_in_the_real_world","319213672_Searching_for_monocular_microsaccades_-_A_red_Hering_of_modern_eye_trackers","298872181_Microsaccades_under_monocular_viewing_conditions","285350812_The_behavioural_and_neurophysiological_modulation_of_microsaccades_in_monkeys"]}