{"id":"324176182_TUB-HAUPM_Tighter_Upper_Bound_for_Mining_High_Average-Utility_Patterns","abstract":"High-utility itemset mining (HUIM) has been gaining popularity in the field of data mining. Frequent itemset mining (FIM) used to be the main tool to reveal high-frequency patterns but failed to consider the concept of profit. HUIM, on the other hand, obtains the itemsets and is practical in commercial applications. A main challenge in HUIM is that HUIM should handle the exponential search space for HUIM when the number of distinct items and the size of the database are both too large. The other challenge is that existing HUIM methods overlook the length of high-utility itemsets; hence, a large itemset gets an unreasonable estimated profit as opposed to the actual value. Therefore, several algorithms were proposed to mine high average-utility itemsets. High average-utility itemset mining (HAUIM) is an extension for traditional HUIM, which provides a different measure with HUIM. It discovers utility patterns by considering both their utilities and lengths. To reduce the searching space in HAUIM, average-utility upper-bound (auub), looser upper-bound utility (lub), and a revised tighter upper-bound model (rtub) are proposed to prune the searching graph in HAUIM. These three upper-bounds for high average-utility itemsets decrease the number of candidate patterns efficiently. However, they still overestimate a high average-utility itemset and waste on assessing the unnecessary patterns. Two new tighter upper-bounds, maximum following utility upper-bound (mfuub) and top-k transaction-maximum utility upper-bound (krtmuub), are proposed in this article to further contract the size of candidate pattern set. Experiments conducted on several benchmark datasets show the proposed method outperforms the previous HAUIM algorithms in terms of runtime, number of join operations and scalability.","authors":["Jimmy Ming-Tai Wu","Chun-Wei Jerry Lin","Matin Pirouz","Philippe Fournier Viger"],"meta":["April 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2820740"],"references":["317703960_EHAUPM_Efficient_High_Average-Utility_Pattern_Mining_with_Tighter_Upper-Bounds","313476858_A_Survey_of_Sequential_Pattern_Mining","304480191_EFIM-Closed_Fast_and_Memory_Efficient_Discovery_of_Closed_High-Utility_Itemsets","297727740_A_binary_PSO_approach_to_mine_high-utility_itemsets","319393723_Fast_algorithms_for_mining_association_rules","310049843_An_ACO-based_Approach_to_Mine_High-Utility_Itemsets","308599135_Efficient_Mining_of_High-Utility_Itemsets_Using_Multiple_Minimum_Utility_Thresholds","304480278_Efficient_Mining_of_High_Average-Utility_Itemsets_with_Multiple_Minimum_Thresholds","301930535_A_New_Method_for_Mining_High_Average_Utility_Itemsets","300896060_Mining_High_Utility_Itemsets_in_Big_Data"]}