{"id":"324193884_The_disinformation_order_Disruptive_communication_and_the_decline_of_democratic_institutions","abstract":"Many democratic nations are experiencing increased levels of false information circulating through social media and political websites that mimic journalism formats. In many cases, this disinformation is associated with the efforts of movements and parties on the radical right to mobilize supporters against centre parties and the mainstream press that carries their messages. The spread of disinformation can be traced to growing legitimacy problems in many democracies. Declining citizen confidence in institutions undermines the credibility of official information in the news and opens publics to alternative information sources. Those sources are often associated with both nationalist (primarily radical right) and foreign (commonly Russian) strategies to undermine institutional legitimacy and destabilize centre parties, governments and elections. The Brexit campaign in the United Kingdom and the election of Donald Trump in the United States are among the most prominent examples of disinformation campaigns intended to disrupt normal democratic order, but many other nations display signs of disinformation and democratic disruption. The origins of these problems and their implications for political communication research are explored.","authors":["Lance Bennett","Steven Livingston"],"meta":["April 2018European Journal of Communication 33(2):122-139","DOI:10.1177/0267323118760317"],"references":["324550524_Rethinking_Political_Communication_in_a_Time_of_Disrupted_Public_Spheres","320237117_A_Field_Guide_to_Fake_News_A_Collection_of_Recipes_for_Those_Who_Love_to_Cook_with_Digital_Methods","318660817_The_democratic_interface_technology_political_organization_and_diverging_patterns_of_electoral_representation","272752872_Regimes_of_Post-truth_Post-politics_and_Attention_Economies","346476208_The_Hybrid_Media_System_Politics_and_Power","318733954_How_the_Chinese_Government_Fabricates_Social_Media_Posts_for_Strategic_Distraction_Not_Engaged_Argument","318008588_The_Elusive_Backfire_Effect_Mass_Attitudes'_Steadfast_Factual_Adherence","318004266_Stings_and_Scams_Fake_News_the_First_Amendment_and_the_New_Activist_Journalism","307554299_The_Koch_Network_and_Republican_Party_Extremism","296795554_Ruling_the_Void_The_Hollowing_of_Western_Democracy"]}