{"id":"324151028_Pancreas_Segmentation_in_CT_and_MRI_Images_via_Domain_Specific_Network_Designing_and_Recurrent_Neural_Contextual_Learning","abstract":"Automatic pancreas segmentation in radiology images, eg., computed tomography (CT) and magnetic resonance imaging (MRI), is frequently required by computer-aided screening, diagnosis, and quantitative assessment. Yet pancreas is a challenging abdominal organ to segment due to the high inter-patient anatomical variability in both shape and volume metrics. Recently, convolutional neural networks (CNNs) have demonstrated promising performance on accurate segmentation of pancreas. However, the CNN-based method often suffers from segmentation discontinuity for reasons such as noisy image quality and blurry pancreatic boundary. From this point, we propose to introduce recurrent neural networks (RNNs) to address the problem of spatial non-smoothness of inter-slice pancreas segmentation across adjacent image slices. To inference initial segmentation, we first train a 2D CNN sub-network, where we modify its network architecture with deep-supervision and multi-scale feature map aggregation so that it can be trained from scratch with small-sized training data and presents superior performance than transferred models. Thereafter, the successive CNN outputs are processed by another RNN sub-network, which refines the consistency of segmented shapes. More specifically, the RNN sub-network consists convolutional long short-term memory (CLSTM) units in both top-down and bottom-up directions, which regularizes the segmentation of an image by integrating predictions of its neighboring slices. We train the stacked CNN-RNN model end-to-end and perform quantitative evaluations on both CT and MRI images.","authors":["Jinzheng Cai","Le Lu","Fuyong Xing","Lin Yang"],"meta":["March 2018"],"references":["319462215_Progressive_and_Multi-path_Holistically_Nested_Neural_Networks_for_Pathological_Lung_Segmentation_from_CT_Images","313212493_Spatial_Aggregation_of_Holistically-Nested_Convolutional_Neural_Networks_for_Automated_Pancreas_Localization_and_Segmentation","313072108_Regression_Forest-Based_Atlas_Localization_and_Direction_Specific_Atlas_Generation_for_Pancreas_Segmentation","312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","311925867_Pancreas_Segmentation_in_Abdominal_CT_Scan_A_Coarse-to-Fine_Approach","319770327_Multi-Scale_Context_Aggregation_by_Dilated_Convolutions","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","315969856_Multi-atlas_pancreas_segmentation_Atlas_selection_based_on_vessel_structure","313072707_3D_U-Net_Learning_Dense_Volumetric_Segmentation_from_Sparse_Annotation","311754161_V-Net_Fully_Convolutional_Neural_Networks_for_Volumetric_Medical_Image_Segmentation"]}