{"id":"324148596_Imaging_Biomarkers_for_Precision_Medicine_in_Locally_Advanced_Breast_Cancer","abstract":"Guidelines from the American National Comprehensive Cancer Network recommend neoadjuvant chemotherapy to patients with locally advanced breast cancer (LABC) to downstage tumours before surgery. However, only a small fraction (15%–17%) of LABC patients achieve pathological complete response (pCR); that is, no residual tumour in the breast, after treatment. Measuring tumour response during neoadjuvant chemotherapy can potentially help physicians adapt treatment, thus potentially improving the pCR rate. Recently, imaging biomarkers that are used to measure the tumour's functional and biological features have been studied as pretreatment markers for pCR or as an indicator for intratreatment tumour response. Also, imaging biomarkers have been the focus of intense research to characterise tumour heterogeneity as well as to advance our understanding of the principle mechanisms behind chemoresistance. Advances in investigational radiology are moving rapidly to high-resolution imaging, capturing metabolic data, and performing tissue characterisation and statistical modelling of imaging biomarkers, with an end point of personalised medicine in breast cancer treatment. In this commentary, we present studies within the framework of imaging biomarkers used to measure breast tumour response to chemotherapy. Current studies are showing that significant progress has been made in the accuracy of measuring tumour response either before or during chemotherapy, yet the challenges at the forefront of these works include translational gaps such as needing large-scale clinical trials for validation and standardisation of imaging methods. However, the ongoing research is showing that imaging biomarkers may play an important role in personalised treatments for LABC.","authors":["William T. Tran","Charmaine Childs","Heidi Probst","Golnaz Farhat"],"meta":["April 2018Journal of Medical Imaging and Radiation Sciences 49(4)","DOI:10.1016/j.jmir.2017.09.006"],"references":["316068242_A_priori_Prediction_of_Neoadjuvant_Chemotherapy_Response_and_Survival_in_Breast_Cancer_Patients_using_Quantitative_Ultrasound","309920654_Imaging_biomarker_roadmap_for_cancer_studies","309608532_Critical_research_gaps_and_translational_priorities_for_the_successful_prevention_and_treatment_of_breast_cancer","309017333_Imaging_biomarker_roadmap_for_cancer_studies","302341151_Textural_Features_for_Image_Classification","283776133_Current_Definition_of_Locally_Advanced_Breast_Cancer","292448008_Management_of_locally_advanced_breast_cancer-perspectives_and_future_directions_vol_12_pg_147_2015","283755445_Early_detection_of_chemotherapy-refractory_patients_by_monitoring_textural_alterations_in_diffuse_optical_spectroscopic_images","283492734_Computer_Aided_Theragnosis_Using_Quantitative_Ultrasound_Spectroscopy_and_Maximum_Mean_Discrepancy_in_Locally_Advanced_Breast_Cancer","283074950_Apoptosis_oncosis_and_necrosis_An_overview_of_cell_death","282128756_Effectiveness_of_evaluating_tumor_vascularization_using_3D_power_Doppler_ultrasound_with_high-definition_flow_technology_in_the_prediction_of_the_response_to_neoadjuvant_chemotherapy_for_T2_breast_can","282532830_Prospective_Validation_of_a_21-Gene_Expression_Assay_in_Breast_Cancer","274944756_Intratumor_Heterogeneity_Evolution_through_Space_and_Time","272094878_Corrigendum_Management_of_locally_advanced_breast_cancer--perspectives_and_future_directions","270974245_Time-Domain_Optical_Mammography_SoftScan_Initial_Results"]}