{"id":"324124668_A_novel_strategy_of_integrated_microarray_analysis_identifies_CENPA_CDK1_and_CDC20_as_a_cluster_of_diagnostic_biomarkers_in_lung_adenocarcinoma","abstract":"Lung adenocarcinoma (LAC) is the most lethal cancer and the leading cause of cancer-related death worldwide. The identification of meaningful clusters of co-expressed genes or representative biomarkers may help improve the accuracy of LAC diagnoses. Public databases, such as the Gene Expression Omnibus (GEO), provide rich resources of valuable information for clinics, however, the integration of multiple microarray datasets from various platforms and institutes remained a challenge. To determine potential indicators of LAC, we performed genome-wide relative significance (GWRS), genome-wide global significance (GWGS) and support vector machine (SVM) analyses progressively to identify robust gene biomarker signatures from 5 different microarray datasets that included 330 samples. The top 200 genes with robust signatures were selected for integrative analysis according to \"guilt-by-association\" methods, including protein-protein interaction (PPI) analysis and gene co-expression analysis. Of these 200 genes, only 10 genes showed both intensive PPI network and high gene co-expression correlation (r > 0.8). IPA analysis of this regulatory networks suggested that the cell cycle process is a crucial determinant of LAC. CENPA, as well as two linked hub genes CDK1 and CDC20, are determined to be potential indicators of LAC. Immunohistochemical staining showed that CENPA, CDK1 and CDC20 were highly expressed in LAC cancer tissue with co-expression patterns. A Cox regression model indicated that LAC patients with CENPA+/CDK1+and CENPA+/CDC20+were high-risk groups in terms of overall survival. In conclusion, our integrated microarray analysis demonstrated that CENPA, CDK1 and CDC20 might serve as novel cluster of prognostic biomarkers for LAC, and the cooperative unit of three genes provides a technically simple approach for identification of LAC patients.","authors":["Wan-Ting Liu","Yang Wang","Jing Zhang","Fei Ye"],"meta":["March 2018Cancer Letters 425","DOI:10.1016/j.canlet.2018.03.043"],"references":["318091384_Isodeoxyelephantopin_induces_protective_autophagy_in_lung_cancer_cells_via_Nrf2-p62-keap1_feedback_loop","317059423_Identification_of_potential_long_non-coding_RNA_biomarkers_associated_with_the_progression_of_colon_cancer","294738717_CENP-C_directs_a_structural_transition_of_CENP-A_nucleosomes_mainly_through_sliding_of_DNA_gyres","258636319_Ras_regulates_kinesin_13_family_members_to_control_cell_migration_pathways_in_transformed_human_bronchial_epithelial_cells"]}