{"id":"324167109_An_Operator-Valued_Kantorovich_Metric_on_Complete_Metric_Spaces","abstract":"The Kantorovich metric provides a way of measuring the distance between two Borel probability measures on a metric space. This metric has a broad range of applications from bioinformatics to image processing, and is commonly linked to the optimal transport problem in computer science. Noteworthy to this paper will be the role of the Kantorovich metric in the study of iterated function systems, which are families of contractive mappings on a complete metric space. When the underlying metric space is compact, it is well known that the space of Borel probability measures on this metric space, equipped with the Kantorovich metric, constitutes a compact, and thus complete metric space. In previous work, we generalized the Kantorovich metric to operator-valued measures for a compact underlying metric space, and applied this generalized metric to the setting of iterated function systems. We note that the work of P. Jorgensen, K. Shuman, and K. Kornelson provided the framework for our application to this setting. The situation when the underlying metric space is complete, but not necessarily compact, has been studied by A. Kravchenko. In this paper, we extend the results of Kravchenko to the generalized Kantorovich metric on operator-valued measures.","authors":["Trubee Davison"],"meta":["October 2019Acta Applicandae Mathematicae 163(5)","DOI:10.1007/s10440-018-0213-y"],"references":["306187033_A_Positive_Operator-Valued_Measure_for_an_Iterated_Function_System","313611886_Fractals_and_self-similarity","284746134_Erratum_to_Generalizing_the_Kantorovich_Metric_to_Projection_Valued_Measures_Acta_Appl_Math_2014_101007s10440-014-9976-y","251187902_A_geometrical_property_of_POV-measures_and_systems_of_covariance","243765747_A_Course_in_Functional_Analysis","239601715_Fractals_and_Self-Similarity","225630549_Completeness_of_the_Space_of_Separable_Measures_in_the_Kantorovich-Rubinshtein_Metric","224011016_Optimal_transport_--_Old_and_new","222511212_Measures_in_wavelet_decompositions","220435984_The_uncertainty_relation_for_joint_measurement_of_postion_and_momentum","220367804_The_Kantorovich_Metric_in_Computer_Science_A_Brief_Survey","2122378_Use_of_operator_algebras_in_the_analysis_of_measures_from_wavelets_and_iterated_function_systems","2093979_Harmonic_analysis_of_iterated_function_systems_with_overlap"]}