{"id":"324134838_ODD2D_An_ODD_based_protocol_for_mapping_data_to_empirical_ABMs","abstract":"The quantity of data and processes used in modeling projects has been dramatically increasing in recent years due to the progress in computation capability and to the popularity of new approaches such as open data. Modelers face an increasing difficulty in analyzing and modeling complex systems that consist of many heterogeneous entities. Adapting existing models is relevant to avoid dealing with the complexity of writing and studying a new model from scratch. ODD (Overview, Design concepts, Details) protocol has emerged as a solution to document Agent-Based Models (ABMs). It appears to be a convenient solution to address significant problems such as comprehension, replication, and dissemination. However, it lacks a standard that formalizes the use of data in empirical models. This paper tackles this issue by proposing a set of rules that outline the use of empirical data inside an ABM. We call this new protocol ODD+2D (ODD+Decision + Data). ODD+2D integrates a mapping diagram called DAMap (Data to Agent Mapping). This mapping model formalizes how data are processed and mapped to agent-based models. In this paper, we focus on the architecture of ODD+2D, and we illustrate it with a residential mobility model in Marrakesh.","authors":["Ahmed Laatabi","Nicolas Marilleau","Tri Nguyen-Huu","Hbid Moulay Lhassan"],"meta":["March 2018Journal of Artificial Societies and Social Simulation, The 21(2)","DOI:10.18564/jasss.3646","Project: Stability and Bifurcation"],"references":["315459313_Introduction_to_Multi-Agent_Simulation","313232922_The_Practice_of_Archiving_Model_Code_of_Agent-Based_Models","308612157_Simple_or_complicated_agent-based_models_A_complicated_issue","304744243_Enhancing_Agent-Based_Models_with_Discrete_Choice_Experiments","315840457_Replicating_complex_agent_based_models_a_formidable_task","313427701_Agent_UML_A_formalism_for_specifying_multiagent_software_system","306062998_How_to_Describe_Agent-Based_Models_in_Population_Studies","306062801_Using_Survey_Data_for_Agent-Based_Modeling_Design_and_Challenges_in_a_Model_of_Armed_Conflict_and_Population_Change","300102282_Empiricism_and_Agent-Based_Modelling","300102100_Designing_Empirical_Agent-Based_Models_An_Issue_of_Matching_Data_Technical_Requirements_and_Stakeholders_Expectations"]}