{"id":"324133787_PERCEPTION_OF_ACADEMIC_STAFF_OVER_THEIR_CAREER_DUE_TO_TECHNOLOGY_IMPLEMENTATION_AT_SOHAR_UNIVERSITY","abstract":"Purpose The objectives of the study are to analyze ways through which technology introduced in Sohar University is helping the lectures teaching in the University and improves their research activities and to analyze the methods of administrative works of lectures in the University. Design/methodology/approach To carry out this research study, 133 samples were collected from academic staff working in all the faculties of Sohar University using a questionnaire. The questionnaire was containing the personal details, teaching, research and administration related factors. The data obtained was analyzed, and interpreted to obtain the result. Findings The study reveals that the academic staff feels the technology implementation has improved the teaching pattern and standards of the university and hence their teaching style also has changed. It is also proventhat the academic staff feels the technology implementation has helped to improve their research career. It is shown that the academic staff feels the technology implementation has helped to reduce their administrative work. Research limitations/Implications It was reported that the technology implementation would be successful only when adequate training is given beforehand and mostly time is wasted for rectifying the technical bugs arising due to technological implementation. Social implications The study suggests thattechnology implementation is successful only if technical staff regularly maintains computers. They also suggested that there is aneed for software skills training though it is time-consuming. Originality/Value Only a very few have examined the perception of the academic staff of all the faculties at University level in Oman, and it is a first-hand study of its kind, and the results will be useful to IT departments.","authors":["Sulaiman Said AL-Shibli","Ahmad Abushakra","Firdouse Rahman Khan"],"meta":["March 2018International Journal of Management Innovation & Entrepreneurial Research 4(1):16-24","DOI:10.18510/ijmier.2018.414"],"references":["324770799_Information_Technologies_and_Education_for_the_Poor_in_Africa_Recommendations_for_a_Pro-Poor_ICT4D_Non-Formal_Education_Policy","322069046_IMPLICATIONS_OF_SOCIAL_MEDIA_NETWORKS_TECHNOLOGY_IN_INTERPERSONAL_SKILLS_AND_ACADEMIC_PERFORMANCES","318532326_TECHNOLOGICAL_PLATFORMS_FOR_SOCIAL_ENTREPRENEURSHIP_AND_COMMUNITY_ENGAGEMENT","317004404_IMPACT_OF_SOCIAL_MEDIA_ON_CUSTOMERS_SATISFACTION_BANK_MUSCAT_-_A_CASE_STUDY","255657856_Technology_integration_in_education_in_developing_countries_Guidelines_to_policy_makers1","255567031_Learning_to_Teach_with_Technology_Strategies_for_Inservice_Professional_Development","271927952_Activity_Theory_as_a_Framework_for_Investigating_District-Classroom_System_Interactions_and_Their_Influences_on_Technology_Integration","255566862_Toward_Technology_Integration_in_the_Schools_Why_It_Isn't_Happening","248078049_Why_Faculty_Did-and_Did_Not-Integrate_Instructional_Software_in_Their_Undergraduate_Classrooms","232886390_Digital_Backpacks"]}