{"id":"324156073_Innovative_design_with_learning_reflexiveness_for_developing_the_Hamiltonian_circuit_learning_games","abstract":"In this study, we use a new proposed framework to develop the Hamiltonian circuit learning games for college students. The framework is for enhancing learners’ activities with learning reflexiveness. The design of these games is based on this framework to achieve the targeted learning outcomes. In recent years, the game-based learning is a very popular research topic. The Hamiltonian circuit is an important concepts for learning many computer science and electric engineering topics, such as IC design routing algorithm. The developed games use guiding rules to enable students to learn the Hamiltonian circuit in complicate graph problem. After the game, the learners are given a reviewing test which using the animation film for explaining the knowledge. This design concept is different from the previous studies. Through this new design, the outcome gets the better learning results under the effect of reflection. The students will have a deeper impression on the subject, and through self-learning and active thinking, in the game will have a deeper experience.","authors":["Chien Yang","Chiang Hsuan-Yu"],"meta":["February 2018Advances in Science Technology and Engineering Systems Journal 3(1):352-356","DOI:10.25046/aj030143"],"references":["239526993_From_boring_to_scoring-A_collaborative_serious_game_for_learning_and_practicing_mathematical_logic_for_computer_science_education","44798215_Medical_student_attitudes_toward_video_games_and_related_new_media_technologies_in_medical_education","303693962_Essential_features_of_serious_games_design_in_higher_education_Linking_learning_attributes_to_game_mechanics_Essential_features_of_serious_games_design","267340440_Benefits_barriers_and_guideline_recommendations_for_the_implementation_of_serious_games_in_education_for_stakeholders_and_policymakers","244486256_The_Concept_of_Flow","238687478_Making_learning_fun_A_taxonomy_of_intrinsic_motivations_for_learning","223301305_Digital_Game-Based_Learning_in_high_school_Computer_Science_education_Impact_on_educational_effectiveness_and_student_motivation","47428670_Work_motivation_of_nurses_A_literature_review"]}