{"id":"324135965_Common_Mistakes_Committed_and_Challenges_Faced_in_Research_Proposal_Writing_by_University_of_Zambia_Postgraduate_Students","abstract":"Abstract\n\nProposal writing is an important part of postgraduate studies at the University of Zambia. The aim of this study\nwas to establish the common mistakes committed and challenges faced by postgraduate students in the school\nof education at the University of Zambia. The study was purely qualitative. A total of 100 respondents were\nrandomly sampled 80 of which were masters students while 20 were lecturers. Data was collected through\nface to face interviews with lecturers and focus group discussions with masters’ students. To do so, interview\nguides and focus group discussion guides were used. Data was analysed qualitatively through categorisation of\ndata into identified themes according to research objectives. The findings of the study showed that students’\nmistakes in writing the proposal included: broad and unclear topics, failure to state the problem, failure to\nidentify the gap in the literature, using wrong methodology, misunderstanding research terminology, wrong\nreferencing style and plagiarism. The challenges which students faced included: unavailability of lecturers for\nconsultations, negative comments from supervisors, and limited time in which to write the proposal, lack of\nmaterials and lack of co-ordination between DRGS, Assistant Dean- School of Education and the Lecturers/\nsupervisors. The paper concludes that there is need to review the way the methodology course (EDR) is\ntaught in the school of education. Further, there is need for students, lecturers, and the office of the Assistant\nDean responsible for postgraduate studies and the Directorate of Research and Graduate Studies to work\ncohesively for the good of postgraduate studies.","authors":["Peter Chomba Manchishi","Daniel Ndhlovu","David Sani Mwanza"],"meta":["March 2015","Project: Publication"],"references":["260060464_How_to_Write_a_Research_Proposal","251796979_WRITING_AN_EFFECTIVE_RESEARCH_PROPOSAL","239518437_Doing_Your_Research_Project","237624140_Common_Mistakes_and_Problems_in_Research_Proposal_Writing"]}