{"id":"324150490_Improved_Functional_Mappings_via_Product_Preservation","abstract":"In this paper, we consider the problem of information transfer across shapes and propose an extension to the widely used functional map representation. Our main observation is that in addition to the vector space structure of the functional spaces, which has been heavily exploited in the functional map framework, the functional algebra (i.e., the ability to take pointwise products of functions) can significantly extend the power of this framework. Equipped with this observation, we show how to improve one of the key applications of functional maps, namely transferring real‐valued functions without conversion to point‐to‐point correspondences. We demonstrate through extensive experiments that by decomposing a given function into a linear combination consisting not only of basis functions but also of their pointwise products, both the representation power and the quality of the function transfer can be improved significantly. Our modification, while computationally simple, allows us to achieve higher transfer accuracy while keeping the size of the basis and the functional map fixed. We also analyze the computational complexity of optimally representing functions through linear combinations of products in a given basis and prove NP‐completeness in some general cases. Finally, we argue that the use of function products can have a wide‐reaching effect in extending the power of functional maps in a variety of applications, in particular by enabling the transfer of high‐frequency functions without changing the representation size or complexity.","authors":["Dorian Nogneng","Simone Melzi","Emanuele Rodolà","U Castellani"],"meta":["May 2018Computer Graphics Forum 37(2)","DOI:10.1111/cgf.13352"],"references":["320271702_A_Survey_on_Shape_Correspondence","318785369_Efficient_Deformable_Shape_Correspondence_via_Kernel_Matching","318610378_Consistent_functional_cross_field_design_for_mesh_quadrangulation","321621297_Algebras_Rings_and_Modules","318757611_Computing_and_processing_correspondences_with_functional_maps","318337082_Localized_Manifold_Harmonics_for_Spectral_Shape_Analysis","318202072_On_the_Stability_of_Functional_Maps_and_Shape_Difference_Operators","317750722_Informative_Descriptor_Preservation_via_Commutativity_for_Shape_Matching","317749625_Fully_Spectral_Partial_Shape_Matching","316870219_Variance-Minimizing_Transport_Plans_for_Inter-surface_Mapping"]}