{"id":"324162489_High_School_Students'_Views_on_the_PBL_Activities_Supported_via_Flipped_Classroom_and_LEGO_Practices","abstract":"The purpose of this study was to investigate the high school students' views on instructions based on Flipped Classroom Model (FC) and LEGO applications. The case study, which is one of the qualitative research methods, was used within the scope of the study, the duration of which was 7 weeks. In order to choose the research group of the study, one of the purposeful sampling methods, criterion sampling, was used. In this context, the study was conducted with 35 10th grade high school students from two different classes. EGA (ExperimentalGroupA) consisted of 18 students while EGB (ExperimentalGroupB) consisted of 17 students. Within the scope of the study, algorithm instruction with FC and LEGO applications was conducted on EGA and LEGO applications and algorithm instruction in classroom were conducted on EGB. In accordance with the study, processes of focus group discussions and gathering data through observation were carried out. For the analysis of the data that was gathered, content analysis was performed and NVivo 8 was used. In the end of the study, the students were observed to be having great prejudices and reported negative views in the beginning of the study. Upon the initiation of the study, the prejudices and negative opinions were observed to be replaced by positive opinions. Students mentioned a great deal of educational benefits of the study. They stated that with the study, their motivation and interest in the lesson increased thanks to the implementations. Additionally in the group work, students said that they cooperated, exchanged ideas, shared tasks, took responsibility and socialized with their friends. About FC, students gave positive feedback on the communication opportunities of the atmosphere and they stated that they could repeatedly go beyond the class hours with FC, hence came prepared and saved time. Also students stated that FC atmosphere improved opportunities for teacher-student communication.","authors":["Barış Çukurbaşı","Mübin Kiyici"],"meta":["April 2018Educational Technology & Society 21(2)","Project: This  work  was  supported  by  the  Sakarya  University  Scientific  Research  Projects  Committee (Project number: 2015 - 70 - 02 - 001)"],"references":["322096672_Science_and_Technology_Laboratory_Applications_Supported_by_Robotic_RoboLab_Robotik_Destekli_Fen_ve_Teknoloji_Laboratuvar_Uygulamalari_RoboLab","301621034_Ogretim_Teknolojilerinde_Yeni_Egilimler_ve_Yaklasimlar","297601145_Students'_Perceptions_of_the_Value_of_Using_Videos_as_a_Pre-class_Learning_Experience_in_the_Flipped_Classroom","285627099_The_Flipped_Classroom_Improves_Student_Achievement_and_Course_Satisfaction_in_a_Statistics_Course_A_Quasi-Experimental_Study","308077046_Turkiye'de_Ogretim_Teknolojileri_Alaninda_Yayimlanan_Yuksek_Lisans_ve_Doktora_Tezlerinde_Genel_Egilimler","303772078_Probleme_Dayali_Ogrenme","297791292_The_Synergistic_Effects_of_Self-Regulation_Tools_and_the_Flipped_Classroom","296666499_Experiences_with_LEGO_MINDSTORMS_as_an_Embedded_and_Robotics_Plattform_within_the_Undergraduate_Curriculum","290605806_Flip_Your_Students'_Learning","288777667_Developing_conceptual_understanding_of_mechanical_advantage_through_the_use_of_Lego_robotic_technology"]}