{"id":"324153603_Monophily_in_social_networks_introduces_similarity_among_friends-of-friends","abstract":"The observation that individuals tend to be friends with people who are similar to themselves, commonly known as homophily, is a prominent feature of social networks. While homophily describes a bias in attribute preferences for similar others, it gives limited attention to variability. Here, we observe that attribute preferences can exhibit variation beyond what can be explained by homophily. We call this excess variation monophily to describe the presence of individuals with extreme preferences for a particular attribute possibly unrelated to their own attribute. We observe that monophily can induce a similarity among friends-of-friends without requiring any similarity among friends. To simulate homophily and monophily in synthetic networks, we propose an overdispersed extension of the classical stochastic block model. We use this model to demonstrate how homophily-based methods for predicting attributes on social networks based on friends (that is, 'the company you keep') are fundamentally different from monophily-based methods based on friends-of-friends (that is, 'the company you’re kept in'). We place particular focus on predicting gender, where homophily can be weak or non-existent in practice. These findings offer an alternative perspective on network structure and prediction, complicating the already difficult task of protecting privacy on social networks.","authors":["Kristen M. Altenburger","Johan Ugander"],"meta":["April 2018Nature Human Behaviour 2(4):1-7","DOI:10.1038/s41562-018-0321-8","Project: Monophily in social networks introduces similarity among friends-of-friends"],"references":["305616148_Gender_Differences_in_Communication_Behaviors_Spatial_Proximity_Patterns_and_Mobility_Habits","325677286_Random_graphs_and_complex_networks","323290377_Quasi_likelihood_functions_generalized_linear_models_and_the_Gauss_Newton_method","319333726_Algorithms_for_graph_partitioning_on_the_planted_partition_model","317487134_Graph-based_semi-supervised_learning_for_relational_networks","313324980_Relational_Analysis_The_Study_of_Social_Organizations_with_Survey_Methods","313285012_Prediction_and_explanation_in_social_systems","312204452_Should_social_science_be_more_solution-oriented","311668724_Graph-based_semi-supervised_learning_for_relational_networks","304179623_Categorical_Data_Analysis"]}