{"id":"324279056_Metro_Map_Colour-Coding_Effect_on_Usability_in_Route_Tracing","abstract":"Does the choice of colour-coding scheme affect the usability of metro maps, as measured by the accuracy and speed of navigation? Using colour to differentiate lines or services in maps of metro rail networks has been a common practice around the world for many decades. Broadly speaking, there are two basic schemes: 'route colouring', in which each end-to-end route has a distinct colour, and 'trunk colouring', in which each major trunk has a distinct colour, and the individual routes inherit the colour of the main trunk that they run along. A third, intermediate scheme is 'shaded colouring', in which each trunk has a distinct colour, and each route has a distinct shade of that colour. In this study, 285 volunteers in the US were randomised to these three colour-coding schemes and performed seventeen navigational tasks. Each task involved tracing a route in the New York City subway map. Overall, we found that route colouring was significantly more accurate than the trunk-and shaded-colouring schemes. A planned subset analysis, however, revealed major differences between specific navigational hazards: route colouring performed better only against certain nav-igational hazards; trunk colouring performed best against one hazard; and other hazards showed no effect of colour coding. Route colouring was significantly faster only in one subset.","authors":["Peter B Lloyd","Maxwell J Roberts","Peter Rodgers"],"meta":["April 2018","Conference: Diagrams 2018At: Edinburgh","Project: Automated Design of Metro Maps (PhD research)"],"references":["320074747_Crowdsourcing_Versus_the_Laboratory_Towards_Human-Centered_Experiments_Using_the_Crowd","277895622_Lost_in_transportation_Information_measures_and_cognitive_limits_in_multilayer_navigation","236068471_Evaluating_Amazon's_Mechanical_Turk_as_a_Tool_for_Experimental_Behavioral_Research","227427003_Mind_the_Map_The_Impact_of_Transit_Maps_on_Path_Choice_in_Public_Transit","321433333_Redesigning_subway_map_to_mitigate_bottleneck_congestion_An_experiment_in_Washington_DC_using_Mechanical_Turk","310504704_Radical_departures_Comparing_conventional_octolinear_versus_concentric_circles_schematic_maps_for_the_Berlin_U-BahnS-Bahn_networks_using_objective_and_subjective_measures_of_effectiveness","306939383_The_magical_number_seven_plus_or_minus_two_Some_limits_on_our_capacity_to_process_information","278325084_Becksploitation_The_Over-use_of_a_Cartographic_Icon","237966778_Transit_Map_Color_Coding_and_Street_Detail","228758318_Cognitive_Map-Design_Research_in_the_Twentieth_Century_Theoretical_and_Empirical_Approaches"]}