{"id":"324237011_Cerebellar_Projections_to_the_Prefrontal_Cortex_of_the_Primate","abstract":"The cerebellum is known to project via the thalamus to multiple motor areas of the cerebral cortex. In this study, we examined the extent and anatomical organization of cerebellar input to multiple regions of prefrontal cortex. We first used conventional retrograde tracers to map the origin of thalamic projections to five prefrontal regions: medial area 9 (9m), lateral area 9 (9l), dorsal area 46 (46d), ventral area 46, and lateral area 12. Only areas 46d, 9m, and 9l received substantial input from thalamic regions included within the zone of termination of cerebellar efferents. This suggested that these cortical areas were the target of cerebellar output. We tested this possibility using retrograde transneuronal transport of the McIntyre-B strain of herpes simplex virus type 1 from areas of prefrontal cortex. Neurons labeled by retrograde transneuronal transport of virus were found in the dentate nucleus only after injections into areas 46d, 9m, and 9l. The precise location of labeled neurons in the dentate varied with the prefrontal area injected. In addition, the dentate neurons labeled after virus injections into prefrontal areas were located in regions spatially separate from those labeled after virus injections into motor areas of the cerebral cortex. Our observations indicate that the cerebellum influences several areas of prefrontal cortex via the thalamus. Furthermore, separate output channels exist in the dentate to influence motor and cognitive operations. These results provide an anatomical substrate for the cerebellum to be involved in cognitive functions such as planning, working memory, and rule-based learning.","authors":["Frank Middleton","Peter Leonard Strick"],"meta":["January 2001The Journal of Neuroscience : The Official Journal of the Society for Neuroscience 21(2):700-712","DOI:10.1523/JNEUROSCI.21-02-00700.2001"],"references":["324176429_Motor_sequence_learning_a_study_with_positron_emission_tomography","322047640_Cerebrocerebellar_communication_systems","311450984_Studies_of_cerebral_function_in_primates_I_The_functions_of_the_frontal_association_areas_in_monkeys","287174228_Cerebellar_Projections_to_the_Thalamic_Nuclei_in_Monkeys","285326326_Fastigial_cerebellar_projections_to_the_ventrolateral_nucleus_of_the_thalamus_and_the_organization_of_the_descending_pathways","285256848_Fluorescent_Neuronal_Tracers","284744521_X-ray_computerized_tomography_studies_in_schizophrenia_A_review_and_synthesis","284572452_Evidence_for_output_channels_in_the_basal_ganglia_and_cerebellum","274384342_The_prefrontal_cortex_and_the_cognitive_foundation_of_ordely_action","243774551_Timing_Functions_of_The_Cerebellum"]}