{"id":"324247797_Interactive_Hypermedia_Programs_and_its_Impact_on_the_Achievement_of_University_Students_Academically_Defaulting_in_Computer_Sciences","abstract":"Traditional teaching practices through lecture series in a classroom have shown to have less universal efficacy in imparting knowledge to every student. Some students encounter problems in this traditional setting, especially in subjects that require applied instruction rather than verbal teaching. University students who have problems in understanding computer science have been hypothesized in this study to achieve better results on the application of interactive hypermedia programs in their curricula. The study has, thus, conducted a teaching survey through pretest-posttest control group design where computer science students of the Community College of Northern Border University were selected through non-probability sampling methodology and were made to undergo traditional teaching followed by interactive hypermedia sessions on the same subject. The evaluations of the change in performance provided results that showed that there existed a statistically significant difference in the mean scores of students after attending the interactive hypermedia program, providing evidence that hypermedia induced educational sessions were better to induce performance of students than those sessions that did not have any hypermedia exposure. However, the study also provided an understanding of limitations such as generalized quantitative experiments on computer science students of the Northern Border University, but the researcher believes that more widespread experimentation of the same kind can help establish the unbiased performance supremacy of hypermedia instruction in improving the academic performance of university students in different subjects.","authors":["Mohamed Desoky Rabeh"],"meta":["May 2018International Journal of Advanced Computer Science and Applications 9(3):142-147"],"references":["311431787_Understanding_the_Impact_of_Individual_Differences_on_Learner_Performance_Using_Hypermedia_Systems","279558680_The_relationship_between_students'_exposure_to_technology_and_their_achievement_in_science_and_math","275684942_Studying_the_Impact_of_Using_Multimedia_Interactive_Programs_on_Children's_Ability_to_Learn_Basic_Math_Skills","272871799_The_Use_of_Multimedia_Technology_in_English_Language_Teaching_A_Global_Perspective","311699242_A_novel_approach_of_multimedia_instruction_applications_in_engineering_education","298972479_Learning_Computer_Science_Concepts_with_Scratch","266992922_Guide_to_teaching_computer_science_An_activity-based_approach","257740185_The_impact_of_using_multimedia_on_students'_academic_achievement_in_the_College_of_Education_at_King_Saud_University","250888490_Developing_a_Hypermedia_System_for_Computer_Systems_Education","226935704_Sex_differences_on_the_California_statewide_assessment_of_computer_literacy"]}