{"id":"324277938_Automatic_2D_Image_Segmentation_Using_Tissue-Like_P_System","abstract":"This paper uses P-Lingua, a standard programming language that is designed specifically for P systems, to automatically simulate the region-based segmentation of 2D images. P-Lingua, which is based on membrane computing, links to Java Netbeans using the PLinguaCore4 Java library to automatically codify the pixels of the input image as long as automatically draw the output segmented image. Many methods have been suggested previously and used for artificial image segmentation, but to the best of our knowledge, none of those techniques were automatic, where the image was codified manually and the visualization of the output image was done manually in the tissue simulator which takes time and effort, especially when dealing with large images in the system. Two types of pixel adjacency have been utilized in this paper, namely; 4-adjacency and 8-adjacency. The jacquard index method has been used to measure the accuracy of the segmentation. The results of the proposed method demonstrated that beside its ability to automatically segmenting 2D images with arbitrary sizes, it is more efficient and faster than the tissue simulator tool, since the latter needs the input image to be codified manually pixel by pixel which makes it impractical for real-world applications.","authors":["Rafaa Ismael Yahya","Siti Mariyam Shamsuddin","Salah I. Yahya","Shafaatunnur Hasan"],"meta":["March 2018International Journal of Advances in Soft Computing and its Applications 19(1)"],"references":["312268086_Image_Segmentation_Using_Membrane_Computing_A_Literature_Survey","289809253_Color_Segmentation_of_2D_Images_with_Thresholding","282376438_Region-based_segmentation_of_Hexagonal_digital_images_using_membrane_computing","278715021_Membrane_Computing_for_2D_Image_Segmentation","266472447_Thresholding_2D_Images_with_Cell-like_P_Systems","264907859_A_P-Lingua_based_Simulator_for_Tissue_P_Systems_with_Cell_Separation","313532827_Segmentation_of_Peripheral_Blood_Smear_Images_Using_Tissue-Like_P_Systems","286674016_A_Review_on_Recent_Research_and_Implementation_Methodologies_on_Medical_Image_Segmentation","282887316_Jaccard_index_compensation_for_object_segmentation_evaluation","267760799_Optimal_multi-level_thresholding_with_membrane_computing"]}