{"id":"324223383_A_desambiguacao_de_palavras_homonimas_em_sentencas_por_aplicativos_de_Traducao_Automatica_Portugues_Brasileiro-Libras_The_disambiguation_of_homonymous_words_in_sentences_by_Brazilian_Portuguese-Libras","abstract":"Resumo Este estudo analisa a Tradução Automática (TA) de palavras homônimas isoladas e inseridas em sentenças, realizada pelos aplicativos Hand Talk (HT) e ProDeaf Móvel (PDM), ambos tradutores automáticos do Português Brasileiro (PB) para Língua Brasileira de Sinais (Libras), uma vez que estudos anteriores têm apontado para a ausência de estratégias de desambiguação, uso de datilologia e erros de tradução. Esta é uma pesquisa qualitativa exploratória fundamentada em estudos sobre o léxico da Libras, Tradução Automática, Processamento de Línguas Naturais e Desambiguação, que tem por finalidade aprofundar achados iniciais, sob o mesmo viés teórico, com vistas a propor melhorias para a TA de PB-Libras. Assim, esta pesquisa analisou a TA de 38 palavras homônimas isoladas e contextualizadas em 38 pares de sentenças (dois significados em cada par de sentença). Os resultados revelaram que na TA de palavras isoladas os aplicativos geram a tradução de apenas um dos significados das palavras homônimas (HT: 89% e PDM: 63%). Nas sentenças, o percentual de acerto do significado das palavras, em ambos os aplicativos, é menor (HT: 82% e PDM: 60%) do que na TA por palavra isolada e ainda mais reduzido (HT: 13% e PDM: 11%) na desambiguação de palavras homônimas. Os achados desta pesquisa indicam a necessidade de aperfeiçoamento do sistema de Processamento de Línguas Naturais dos aplicativos quanto à desambiguação de palavras homônimas. Infere-se que uma TA mais adequada em nível de palavra isolada e de sentença pode oferecer aos usuários traduções mais análogas à Libras em níveis semântico e sintático, enquanto língua natural e oficial da comunidade surda no Brasil. Palavras-chave: aplicativos de tradução automática; libras; palavras homônimas. * Centro Universitário Ritter dos Reis (UniRitter), Porto Alegre (RS),","authors":["Ygor Corrêa","Rafael Peduzzi Gomes","Carina Rebello Cruz"],"meta":["April 2018","DOI:10.1590/010318138651735357941"],"references":["332588719_Tecnologia_Assistiva_a_insercao_de_aplicativos_de_traducao_na_promocao_de_uma_melhor_comunicacao_entre_surdos_e_ouvintes","332582608_Contribuicoes_da_Teoria_da_Aprendizagem_Multimidia_e_da_Usabilidade_para_aprendizagem_de_Libras_e_Lingua_Portuguesa_por_meio_de_aplicativos_moveis","332390103_Aplicativos_de_Traducao_Portugues-Libras_na_Educacao_Bilingue_desafios_frente_a_desambiguacao","320149461_A_systematic_reading_in_statistical_translation_From_the_statistical_machine_translation_to_the_neural_translation_models","312054840_Traducao_automatica_e_competencia_tradutoria_repensando_intersecoes","332585622_AVALIACAO_DE_TECNOLOGIAS_DE_TRADUCAO_PORTUGUES-LIBRAS_VISANDO_O_USO_NO_ENSINO_DE_CRIANCAS_SURDAS","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","306203109_Native_and_foreign_vocabulary_in_American_Sign_Language_A_lexicon_with_multiple_origins","306093774_Achieving_Open_Vocabulary_Neural_Machine_Translation_with_Hybrid_Word-Character_Models","306092988_Improving_Neural_Machine_Translation_Models_with_Monolingual_Data"]}