{"id":"324230977_Graduates'_Competence_on_Employability_Skills_and_Job_Performance","abstract":"One critical measure of success in workplaces is employee’s ability to use competently the knowledge, skills and values that match the needs of his job, satisfy the demands of his employer, and contribute to the overall achievement of institutional goals. An explanatory-correlational research design was used to determine the extent of relationship between three categories of employability skills (using The Conference Board of Canada’s Employability Skills 2000+) and five elements of Contextual Performance adopted from Borman and Motowidlo’s Taxonomy. There were a total of 220 respondents representing the groups of employers and employees from 25 government institutions in the south-central part of Mindanao region, Philippines. Inferential analysis shows that fundamental skills had moderate relationship with employees’ contextual performance; however, being more competent in thinking and problem solving skills provides employees with more benefits in performing contextual behavior. Findings further revealed that although personal management skills had moderate relationship with employees’ contextual behavior, the competence in personal adaptability and learning continuously are contributory across all elements of contextual performance. Finally, the result of the study yielded that teamwork skills, particularly the skill on working with others, were also moderately correlated with employees’ contextual performance. This implies that graduates’ competence in employability skills could give them due advantage in their respective work settings. Thus, proper attention on developing competence on employability skills by employers, employees, higher academic institutions, labor agencies, and policy makers may help address the problems on job performance.","authors":["Maripaz Carungay Abas","Ombra Imam"],"meta":["June 2016International Journal of Evaluation and Research in Education (IJERE) 5(2):119","DOI:10.11591/ijere.v5i2.4530"],"references":["327550245_Employability_Skills_and_Task_Performance_of_Employees_in_Government_Sector","256860265_Sure_They're_Trained_but_Are_They_Employable","242032760_EMPLOYABILITY_SKILLS_AND_STUDENTS'_SELF-PERCEIVED_COMPETENCE_FOR_CAREERS_IN_THE_HOSPITALITY_INDUSTRY","292099781_Employability_skills_Key_to_success","279478990_Empowerment_Contextual_Performance_Job_Satisfaction_-_A_Case_Study_of_the_Scandic_Hotels_in_Jonkoping_-","271429461_Educational_Research_Planning_Planning_Conducting_and_Evaluating_Quantitative_and_Qualitative_Research","263761465_Statistics_Without_Maths_for_Psychology","248916074_Principles_of_Psychological_Measurement","247789604_The_Bases_of_Competence_Skills_for_Lifelong_Learning_and_Employability","244461428_Expanding_the_Criterion_Domain_to_Include_Elements_of_Contextual_Performance"]}