{"id":"324274321_Structural_Equation_Model_Untuk_Analisis_Multivariate_Menggunakan_LISREL","abstract":"Abstrak Tiga komponen secara umum model persamaan struktural: (1) analisis jalur (2) sintesis konseptual variabel laten dan pengukuran model, dan (3) prosedur estimasi umum. Sketsa ini perkembangan dalam model persamaan struktural tidak akan lengkap tanpa menyebutkan perangkat lunak komputer yang telah muncul. Perangkat lunak LISREL mungkin telah menjadi satu faktor greates menuju spreed dari teknik ini. Keywords: model persamaan linear, model persamaan structural, structural equation mode (SEM), Linear equation model (Lisrel) PENDAHULUAN Secara umum terdapat dua jenis penelitian yaitu penelitian kualitatif dan kuantitatif. Penelitian kualitatif bertujuan untuk mendapatkan gambaran seutuhnya mengenai suatu hal menurut pandangan manusia yang diteliti. Penelitian kualitatif berhubungan dengan ide, persepsi, pendapat, kepercayaan orang yang diteliti, tentang suatu topik. Hal tersebut tidak selayaknya diukur dengan angka dan tidak dapat ditetapkan sebelumnya dengan jelas dan pasti. Karena itu dalam penelitian kualitatif, peneliti termasuk alat peneliti yang utama. Dan sebagai alat peneliti, ia dapat dengan luwes menyesuaikan diri dengan bermacam situasi di lapangan. Pengertian mengenai penelitian kuantitatif adalah penelitian yang memusatkan perhatian beberapa hal yang lebih nyata, yang dapat diukur dengan angka dan berusaha mengerti hal yang diteliti dengan melakukan pengukuran (frekuensi dan intensitas variabel). Penelitian kuantitatif dilakukan bila seseorang ingin membuktikan sesuatu, yaitu menunjukkan keberadaan suatu variabel, menunjukan hubungan antara variabel, membuktikan suatu teori. Karena itu peneliti harus merencanakan dengan terperinci dan pasti proses dan alat pengumpulan data yang akan diteliti, berdasarkan teoritis (konsep dan hubungan antar konsep) dan definisi operasional hanya memusatkan pada bagian yang hendak diteliti dan dalam bentuk yang hendak diterapkan peneliti dan dapat diukur dengan angka. Semua masalah di atas akan coba dibahas dalam penelitian yang menggunakan SEM dan LISREL berikut ini. 1. Perumusan Masalah Rumusan masalah dalam analisis multivariate adalah bagaimana melakukan pengukuran variabel penelitian secara menyeluruh, jika konsep dan gagasan yang dihadapi berkenaan dengan pengukuran secara tidak langsung (variabel bertingkat) karena harus diukur melalui beberapa variabel indikator serta mengukur kesalahan yang terdapat dalam setiap variabel indikator. 2. Tinjauan Pustaka 2.1. Sturctural Equation model (SEM) SEM adalah singkatan dari model persamaan struktural (structural equation model) yang merupakan generasi kedua teknik analisis multivariate yang memungkinkan peneliti untuk menguji hubungan antara variabel yang kompleks baik recursive maupun non-recursive untuk memperoleh gambaran menyeluruh mengenai suatu model. Tidak seperti analisis multivariate biasa (regresi berganda dan analisis faktor). SEM dapat melakukan pengujian secara bersama-sama (Bollen, 1989), yaitu: model struktural yang mengukur hubungan antara independent dan dependent construct, serta model measurement yang mengukur hubungan (nilai loading) antara variabel indikator dengan konstruk (variabel laten). Dengan digabungkannya pengujian model struktural dan pengukuran tersebut memungkinkan peneliti untuk; 1). Menguji kesalahan pengukuran (measurement error) sebagai bagian yang","authors":["Ramadiani Ramadiani"],"meta":["April 2018","DOI:10.30872/jim.v5i1.48","Projects: e-LearningDecision support system"],"references":["285425839_Structural_equation_models_in_the_social_sciences_Specification_estimation_and_testing","232435904_Analysis_of_Covariance_Structures","24063191_An_Alternative_Two_Stage_Least_Squares_2SLS_Estimator_for_Latent_Variable_Equations"]}