{"id":"324216550_Automated_defect_inspection_of_LED_chip_using_deep_convolutional_neural_network","abstract":"Defect inspection is a vital part of the production process to control the quality of LED chip. On the one hand, traditional methods are time-consuming, which rely on models badly and require rich operation experience. On the other hand, defect localization cannot be achieved by using traditional networks. To solve these problems, we achieve the application of convolutional neural network (CNN) for LED chip defect inspection. Built in the CNN, a class activation mapping technique is proposed to localize defect regions without using region-level human annotations. Further, LED chip datasets are collected for training the CNN. It is worth to emphasize that the chip defect classification and localization tasks are completed in a single CNN which is very fast and convenient. The proposed CNN based defect inspector named LEDNet achieves impressively high performance on the inspection of LED chip defects (line blemishes and scratch marks) with an inaccuracy of 5.04%, localizing exact defect regions as well.","authors":["Hui Lin","Bin Li","Xinggang Wang","Yufeng Shu"],"meta":["August 2019Journal of Intelligent Manufacturing 30(1):1-10","DOI:10.1007/s10845-018-1415-x"],"references":["305196650_Going_deeper_with_convolutions","283028285_Blob_analyzation-based_template_matching_algorithm_for_LED_chip_localization","277411157_Deep_Learning","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770006_Learning_Deep_Features_for_Discriminative_Localization","316428837_Solar_Power_Plant_Detection_on_Multi-Spectral_Satellite_Imagery_using_Convolutional_Neural_Networks_with_Feedback_Model_and_m-PCNN_Fusion","308262556_Visual_Stability_Prediction_and_Its_Application_to_Manipulation","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","287250939_Learning_Deep_Features_for_Discriminative_Localization","285988707_Light-emitting_diodes_second_edition"]}