{"id":"324279029_Automated_Student_Attendance_System_using_Fingerprint_Recognition","abstract":"The project work aims at designing a student attendance system which could effectively manage attendance of students of the department of Computer Science and Engineering at Jatiya Kabi Kazi Nazrul Islam University. In this project work, attendance is marked after student's biometric identification. For student identification, a fingerprint recognition based identification system is used. Fingerprint features are considered to be the best and fastest method for biometric identification. These features are more secure to use and unique for every person that don't change in one's lifetime. Fingerprint recognition is a mature field today, but still identifying individual from a set of enrolled fingerprints is a time taking process. It was very necessary to improve the fingerprint identification system for implementation on large databases, e.g. of an institute or a country. In this project, the minutiae algorithm is used to develop the identification system which is faster in implementation than any other available today in the market. The proposed automated attendance system based on fingerprint recognition was tested on a class of student fingerprint databases and achieved significant results for taking an attendance of the students of the Department of Computer Science and Engineering. The proposed system has been implemented using C# programming paradigm platform.","authors":["Sifatnur Rahman","Mahabur Rahman","Md. Mijanur Rahman"],"meta":["January 2018Edelweiss Applied Science and Technology","DOI:10.33805/2576.8484.120","Project: Developing Student Attendance System based on Fingerprint Recognition"],"references":["324278932_Biometric_student_registration_and_verification_system","311511130_Attendance_Management_System_Using_Barcode_Identification_on_Students'_Identity_Cards","295813222_Design_and_Implementation_of_Iris_Recognition_Based_Attendance_Management_System","270608176_A_Comparative_Study_on_Fingerprint_Matching_Algorithms_for_EVM","269962935_Biometric_Attendance_System","314062110_Template_Matching_Techniques_in_Computer_Vision_Theory_and_Practice","297661908_Comparison_between_Minutiae_Based_and_Pattern_Based_Algorithm_of_Fingerprint_Image","277767918_RFID_Based_Time_Attendance_System","272496016_Template_Matching_Techniques_in_Computer_Vision_Theory_and_Practice","269328531_Automated_attendance_management_system_based_on_face_recognition_algorithms"]}