{"id":"324267046_Sociedad_de_la_informacion_investigacion_y_desafios_a_la_educacion_latinoamericana_y_chilena","abstract":"ResumenSin duda alguna podemos apreciar que Chile se encuentra en un proceso de integración a la globalización en el cual destaca en relación a los países latinoamericanos. Sin embargo, existe un desarrollo desigual en cuanto a los factores de competitividad. La adecuada inserción de Chile en la globalización, una mayor integración a la sociedad de la información, no pasan por el acceso a medios informáticos y tecnológicamente avanzados. Las formas de integración a la sociedad de la información global requieren del desarrollo de una nueva educación, del decidido estímulo a la ciencia y al desarrollo tecnológico y, por sobre todo, del desarrollo del espíritu crítico e innovador en los jóvenes que son los ciudadanos de hoy y del futuro.Palabras clave: Globalización, Educación, Integración, TecnologíasAbstractUndoubtedly, some of us can realize that Chile is amidst an integrating process toward globalization where it stands out from other Latin American countries. Nevertheless, there is an uneven development as far as the factors of competition. The suitable incorporation of Chile in globalization, a closer integration to the hi-tech society, does not only happen through the technologically advanced access to computer science means. The forms of integration to the global hi-tech society entail the development of new education planning, the pre-established stimulus to science and the technological progress and, above all, the development of the critical and innovating spirit in the young who are the citizens of today and tomorrow.Key words: Globalization, Education, Integration, Technologies","authors":["Cristian Parker"],"meta":["January 2017Revista Temas Sociológicos","DOI:10.29344/07194145.12.216"],"references":["28060179_Competitividad_internacional_y_educacion_en_los_paises_de_America_Latina_y_el_Caribe","28055076_Indicadores_del_desarrollo_educativo_en_America_Latina_y_de_su_impacto_en_los_niveles_de_vida_de_la_poblacion","202187416_Social_Theory_and_Global_Culture","44355291_La_industria_textil_en_America_latina_Comision_Economica_para_America_Latina"]}