{"id":"324269049_Analysis_of_Cross-Layer_Design_of_Quality-of-Service_Forward_Geographic_Wireless_Sensor_Network_Routing_Strategies_in_Green_Internet_of_Things","abstract":"Wireless sensor networks suffer from some limitations\nsuch as energy constraints and the cooperative demands\nessential to perform multi-hop geographic routing for Internet\nof things (IoT) applications. Quality of Service (QoS) depends on\na great extent on offering participating nodes an incentive for collaborating.\nThis paper presents a mathematical model for a new generation\nby forwarding QoS routing determination that enables\nallocation of the optimal path to satisfy QoS parameters to support\na wide range of communication-intensive IoT’s applications. The\nmodel is used to investigate the effects of multi-hop communication\non a traffic system model designed with a Markov discrete time\nM=M=1 queuing model, applicable to green deployment of\nduty-cycle sensor nodes. We present an analytical formulation for\nthe bit-error-rate, and a critical path-loss model is defined to the\nspecified level of trust among the most frequently used nodes.\nAdditionally, we address the degree of irregularity parameter\nfor promoting adaptation to geographic switching with respect\nto two categories of transmission in distributed systems: hop-by-\nhop and end-to-end retransmission schemes. The simulations\nidentified results for the average packet delay transmission, the\nenergy consumption for transmission, and the throughput. The\nsimulations offer insights into the impact of radio irregularity\non the neighbor-discovery routing technique of both schemes.\nBased on the simulation results, the messages encoded with a\nnon-return-to-zero (NRZ) have more green efficiency over multihop\nIoT (without loss of connectivity between nodes) than those\nencoded with the Manchester operation. The findings presented\nin this work are of great help to designers of IoT.","authors":["Mohammed Zaki Hasan","Fadi Al-Turjman","Hussain Al-Rizzo"],"meta":["April 2018IEEE Access 6:1-1","DOI:10.1109/ACCESS.2018.2822551"],"references":["317749402_Evaluation_of_a_duty-cycled_asynchronous_X-MAC_protocol_for_vehicular_sensor_networks","313825022_Low_Transmission_Delay_Based_on_LEACH_and_PEGASIS_Protocol_in_WSN","312358275_Lifetime_maximization_by_partitioning_approach_in_wireless_sensor_networks","329026897_Collaborative_signal_and_information_processing_An_information-directed_approach","320341741_Energy-Aware_Data_Delivery_Framework_for_Safety-Oriented_Mobile_IoT","319133330_Collaborative_Topology_Control_for_Many-to-One_Communications_in_Wireless_Sensor_Networks","319120010_Optimizing_Multipath_Routing_With_Guaranteed_Fault_Tolerance_in_Internet_of_Things","315500717_Cognitive_routing_protocol_for_disaster-inspired_Internet_of_Things","313466034_Optimized_Multi-Constrained_Quality-of-Service_Multipath_Routing_Approach_for_Multimedia_Sensor_Networks","313018444_A_Survey_on_Multipath_Routing_Protocols_for_QoS_Assurances_in_Real-Time_Wireless_Multimedia_Sensor_Networks"]}