{"id":"324215632_Theme_trends_and_knowledge_structure_on_choroidal_neovascularization_A_quantitative_and_co-word_analysis","abstract":"Background: \nThe distribution pattern and knowledge structure of choroidal neovascularization (CNV) was surveyed based on literatures in PubMed.\n\nMethods: \nPublished scientific papers about CNV were retrieved from Jan 1st, 2012 to May 31st, 2017. Extracted MeSH terms were analyzed quantitatively by using Bibliographic Item Co-Occurrence Matrix Builder (BICOMB) and high-frequency MeSH terms were identified. Hierarchical cluster analysis was conducted by SPSS 19.0 according to the MeSH term-source article matrix. High-frequency MeSH terms co-occurrence matrix was constructed to support strategic diagram and social network analysis (SNA).\n\nResults: \nAccording to the searching strategy, all together 2366 papers were included, and the number of annual papers changed slightly from Jan 1st, 2012 to May 31st, 2017. Among all the extracted MeSH terms, 44 high-frequency MeSH terms were identified and hotspots were clustered into 6 categories. In the strategic diagram, clinical drug therapy, pathology and diagnosis related researches of CNV were well developed. In contrast, the metabolism, etiology, complications, prevention and control of CNV in animal models, and genetics related researches of CNV were relatively immature, which offers potential research space for future study. As for the SNA result, the position status of each component was described by the centrality values.\n\nConclusions: \nThe studies on CNV are relatively divergent and the 6 research categories concluded from this study could reflect the publication trends on CNV to some extent. By providing a quantitative bibliometric research across a 5-year span, it could help to depict an overall command of the latest topics and provide some hints for researchers when launching new projects.","authors":["Fangkun Zhao","Bei Shi","Ruixin Liu","Wenkai Zhou"],"meta":["April 2018BMC Ophthalmology 18(1):86","DOI:10.1186/s12886-018-0752-z"],"references":["320370459_A_bibliometric_and_social_network_analysis_of_pelvic_organ_prolapse_during_2007-2016","316472283_Percolation_Centrality_Quantifying_Graph-Theoretic_Impact_of_Nodes_during_Percolation_in_Networks","313415784_Oxidative_Stress-Related_Mechanisms_and_Antioxidant_Therapy_in_Diabetic_Retinopathy","292336892_Knowledge_structure_and_theme_trends_analysis_on_general_practitioner_research_A_Co-word_perspective","291830083_How_frequently_do_clusters_occur_in_hierarchical_clustering_analysis_A_graph_theoretical_approach_to_studying_ties_in_proximity","290157449_Let_There_Be_Light_Gene_and_Cell_Therapy_for_Blindness","289584903_Trends_and_topics_in_eye_disease_research_in_PubMed_from_2010_to_2014","319267301_OPTICAL_COHERENCE_TOMOGRAPHY_ANALYSIS_OF_OUTER_RETINAL_TUBULATIONS_Sequential_Evolution_and_Pathophysiological_Insights","305459974_Current_advances_in_the_treatment_of_neovascular_age-related_macular_degeneration","303104039_Genome_engineering_in_ophthalmology_Application_of_CRISPRCas_to_the_treatment_of_eye_disease"]}