{"id":"324374527_Critical_issues_in_designing_and_implementing_temporal_analytics","abstract":"The importance of temporality in learning has been long established, but it is only recently that serious attention has begun to be paid to the precise identification, measurement, and analysis of the temporal features of learning. From 2009 to 2016, a series of temporality workshops explored temporal concepts and data types, analysis methods for exploiting temporal data, techniques for visualizing temporal information, and practical considerations for the use of temporal analyses in particular contexts of learning. Following from these efforts, this two-part Special Section serves to consolidate research working to progress conceptual, technical and practical tools for temporal analyses of learning data. In addition, in this second and final editorial we aim to make four contributions to the ongoing dialouge around temporal learning analytics to help us move towards a clearer mapping of the research space. First, the editorial presents an overview of the five papers in Part 2 of the Special Section on Temporal Analyses, highlighting the dimensions of data types, learning constructs, analysis approaches, and potential impact. Second, it draws on the fluid relationship between ‘analyzed time’ and ‘experienced time’ to highlight the need for caution and criticality in the purposes temporal analyses are mobilized to serve. Third it offers a guide for future work in this area by outlining important questions that all temporal analyses should intentionally address. Finally, it proposes next steps learning analytics researchers and practitioners can take collectively to advance work on the use of temporal analyses to support learning.","authors":["Bodong Chen","Simon -Download all my papers at my website- Knight","Alyssa Friend Wise"],"meta":["April 2018","DOI:10.18608/jla.2018.51.1"],"references":["321486667_Time_for_Change_Why_Learning_Analytics_Needs_Temporal_Analysis","321486571_Promising_Ideas_for_Collective_Advancement_of_Communal_Knowledge_Using_Temporal_Analytics_and_Cluster_Analysis","312643512_Two_tales_of_time_uncovering_the_significance_of_sequential_patterns_among_contribution_types_in_knowledge-building_discourse","309745647_Rotating_Leadership_and_Collective_Responsibility_in_a_Grade_4_Knowledge_Building_Classroom","284197155_Why_Theory_Matters_More_than_Ever_in_the_Age_of_Big_Data","313355485_Capturing_temporal_and_sequential_patterns_of_self-_co-_and_socially_shared_regulation_in_the_context_of_collaborative_learning","308755148_Epistemology_Assessment_Pedagogy_Where_Learning_Meets_Analytics_in_the_Middle_Space","303190164_Learning_Analytics_for_Online_Discussions_Embedded_and_Extracted_Approaches","280962688_Activity_Theory_Between_Historical_Engagement_and_Future-Making_Practice","277835569_Developing_Structural-Temporal_Visualizations_of_Asynchronous_Threaded_Online_Learning_Conversations"]}