{"id":"324360241_Whale_Optimization_Algorithm_for_Solving_the_Maximum_Flow_Problem","abstract":"Maximum Flow Problem (MFP) is deemed as one of several well-known basic problems in weighted direct graphs [9]. Moreover, it can be applied to many applications in computer engineering and computer science. This problem is solved by many techniques. Thus, this study presents a possible solution to the max flow problem (MFP) using a Whale Optimization algorithm (WOA), which is considered as one of the most recent optimization algorithms that was suggested in 2016. The experimental results of the \"MaxFlow-WO\" algorithm that were tested on various datasets are good evidence that the s technique can solve the MFP and reinforce its performance. It aims to solve the MFP by clustering the search space to find the MF for each cluster (local MF) in order to find the overall solution (global MF) of the desired graph. The WOA is used to solve the MFP by supposing the graph is the search space that the whales looking to reach the prey. Here, the prey is the sink in the network (represented by the graph) and other whales are represented in other nodes in the graph.","authors":["Raja M.T Masadeh","Abdullah Issa Alzaqebah","Ahmad Abdel-Aziz Sharieh"],"meta":["April 2018Journal of Theoretical and Applied Information Technology 96(8)","Project: Maximum Flow Problem based on Whale Optimization Algorithm"],"references":["322618401_A_Parallel_Genetic_Algorithm_for_Maximum_Flow_Problem","322524463_Grey_Wolf_Algorithm_for_Requirements_Prioritization","322487895_Requirements_Prioritization_Techniques_Comparison","319453738_A_Comparison_between_Chemical_Reaction_Optimization_and_Genetic_Algorithms_for_Max_Flow_Problem","318095530_A_Parallel_Genetic_Algorithm_for_Maximum_Flow_Problem","317623186_Grey_wolf_optimization_applied_to_the_maximum_flow_problem","307639177_Chemical_Reaction_Optimization_for_Max_Flow_Problem","306021086_Comparing_between_different_approaches_to_solve_the_01_Knapsack_problem","296635903_The_Whale_Optimization_Algorithm","292025923_Algorithm_for_solution_of_a_problem_of_maximum_flow_in_a_network_with_power_estimation"]}