{"id":"324377142_Non-Orthogonal_Narrowband_Internet_of_Things_A_Design_for_Saving_Bandwidth_and_Doubling_the_Number_of_Connected_Devices","abstract":"Narrowband IoT (NB-IoT) is a low power wide area network (LPWAN) technique introduced in 3GPP release 13. The narrowband transmission scheme enables high capacity, wide coverage and low power consumption communications. With the increasing demand for services over the air, wireless spectrum is becoming scarce and new techniques are required to boost the number of connected devices within a limited spectral resource to meet the service requirements. This work provides a compressed signal waveform solution, termed fast-orthogonal frequency division multiplexing (Fast-OFDM), to double potentially the number of connected devices by compressing occupied bandwidth of each device without compromising data rate and bit error rate (BER) performance. Simulation is firstly evaluated for the Fast-OFDM with comparisons to single-carrier-frequency division multiple access (SC-FDMA). Results indicate the same performance for both systems in additive white Gaussian noise (AWGN) channel. Experimental measurements are also presented to show the bandwidth saving benefits of Fast-OFDM. It is shown that in a line-of-sight (LOS) scenario, Fast-OFDM has similar performance as SC-FDMA but with 50% bandwidth saving. This research paves the way for extended coverage, enhanced capacity and improved data rate of NB-IoT in 5th generation (5G) new radio (NR) networks.","authors":["Tongyang Xu","I. Darwazeh"],"meta":["April 2018IEEE Internet of Things Journal PP(99):1-1","DOI:10.1109/JIOT.2018.2825098","Project: Next Generation Internet of Things"],"references":["338140584_Fast_OFDM_A_Proposal_for_Doubling_the_Data_Rate_of_OFDM_Schemes","321513584_A_Survey_on_5G_Networks_for_the_Internet_of_Things_Communication_Technologies_and_Challenges","319869218_Narrow_Band_Internet_of_Things","326414720_Signal_processing_for_5G_Algorithms_and_implementations","324999617_Visible_light_communications_Fast-orthogonal_frequency_division_multiplexing_in_highly_bandlimited_conditions","322514631_Co-Existence_of_NB-IoT_and_Radar_in_Shared_Spectrum_An_Experimental_Study","322274900_Channel_estimation_for_OFDM","321483758_Spectrally_Efficient_FDM_over_Satellite_Systems_with_Advanced_Interference_Cancellation","320544536_Narrow-Band_Internet_of_Things_Implementations_and_Applications","319118060_Narrow_Band_Internet_of_Things_Simulation_and_Modelling"]}