{"id":"324390729_Coupling_dynamics_of_epidemic_spreading_and_information_diffusion_on_complex_networks","abstract":"The interaction between disease and disease information on complex networks has facilitated an interdisciplinary research area. When a disease begins to spread in the population , the corresponding information would also be transmitted among individuals, which in turn influence the spreading pattern of the disease. In this paper, firstly, we analyze the propagation of two representative diseases (H7N9 and Dengue fever) in the real-world population and their corresponding information on Internet, suggesting the high correlation of the two-type dynamical processes. Secondly, inspired by empirical analyses, we propose a nonlinear model to further interpret the coupling effect based on the SIS (Susceptible-Infected-Susceptible) model. Both simulation results and theoretical analysis show that a high prevalence of epidemic will lead to a slow information decay, consequently resulting in a high infected level, which shall in turn prevent the epidemic spreading. Finally, further theoretical analysis demonstrates that a multi-outbreak phenomenon emerges via the effect of coupling dynamics, which finds good agreement with empirical results. This work may shed light on the in-depth understanding of the interplay between the dynamics of epidemic spreading and information diffusion.","authors":["Xiu-Xiu Zhan","Chuang Liu","Ge Zhou","Zike Zhang"],"meta":["September 2018Applied Mathematics and Computation 332","DOI:10.1016/j.amc.2018.03.050","Projects: Prevention of Infectious diseases by public vaccination and individual protectionEpidemiological Modeling on  NetworksDynamics of  infectious diseases"],"references":["324390819_Epidemic_Dynamics_On_Information-Driven_Adaptive_Networks","307536753_Statistical_physics_of_vaccination","281627380_Impact_of_human_mobility_on_the_emergence_of_dengue_epidemics_in_Pakistan","274095027_Events_Determine_Spreading_Patterns_Information_Transmission_via_Internal_and_External_Influences_on_Social_Networks","320695357_Information_cascades_in_complex_networks","317550406_Vaccination_and_epidemics_in_networked_populations-An_introduction","311899572_Epidemic_processes_in_complex_networks","310842925_Analysis_of_rabies_in_China_Transmission_dynamics_and_control","305488779_Dynamics_of_information_diffusion_and_its_applications_on_complex_networks","299656543_Roles_of_edge_weights_on_epidemic_spreading_dynamics"]}