{"id":"324385634_A_Sequence_Data_Model_for_Analyzing_Temporal_Patterns_of_Student_Data","abstract":"Data models built for analyzing student data often obfuscate temporal relationships for reasons of simplicity, or to aid in generalization. We present a model based on temporal relationships of heterogeneous data as the basis for building predictive models. We show how within- and between-semester temporal patterns can provide insight into the student experience. For example, in a within-semester model, the prediction of the final course grade can be based on weekly activities and submissions recorded in the LMS. In the between-semester model, the prediction of success or failure in a degree program can be based on sequence patterns of grades and activities across multiple semesters. The benefits of our sequence data model include temporal structure, segmentation, contextualization, and storytelling. To demonstrate these benefits, we have collected and analyzed 10 years of student data from the College of Computing at UNC Charlotte in a between-semester sequence model, and used data in an introductory course in computer science to build a within-semester sequence model. Our results for the two sequence models show that analytics based on the sequence data model can achieve higher predictive accuracy than non-temporal models with the same data.","authors":["Mohammad Javad Mahzoon","Mary Lou Maher","Omar Eltayeby","Wenwen Dou"],"meta":["April 2018","DOI:10.18608/jla.2018.51.5"],"references":["275542685_Educational_Data_Mining_A_Review","271297360_Identifying_At-Risk_Students_Using_Machine_Learning_Techniques_A_Case_Study_with_IS_100","269221701_Early_Alert_of_Academically_At-Risk_Students_An_Open_Source_Analytics_Initiative","262372065_Improving_retention_Predicting_at-risk_students_by_analysing_clicking_behaviour_in_a_virtual_learning_environment","254462830_Course_signals_at_Purdue_Using_learning_analytics_to_increase_student_success","340771713_Learning_in_the_Presence_of_Concept_Drift_and_Hidden_Contexts","299969000_A_Machine_Learning_Framework_to_Identify_Students_at_Risk_of_Adverse_Academic_Outcomes","278700103_Density-Based_Clustering_Based_on_Hierarchical_Density_Estimates","262218331_Review_Educational_data_mining_A_survey_and_a_data_mining-based_analysis_of_recent_works","242453132_Academic_Analytics"]}