{"id":"324387070_The_Loss_Surface_of_XOR_Artificial_Neural_Networks","abstract":"Training an artificial neural network involves an optimization process over the landscape defined by the cost (loss) as a function of the network parameters. We explore these landscapes using optimisation tools developed for potential energy landscapes in molecular science. The number of local minima and transition states (saddle points of index one), as well as the ratio of transition states to minima, grow rapidly with the number of nodes in the network. There is also a strong dependence on the regularisation parameter, with the landscape becoming more convex (fewer minima) as the regularisation term increases. We demonstrate that in our formulation, stationary points for networks with $N_h$ hidden nodes, including the minimal network required to fit the XOR data, are also stationary points for networks with $N_{h} +1$ hidden nodes when all the weights involving the additional nodes are zero. Hence, smaller networks optimized to train the XOR data are embedded in the landscapes of larger networks. Our results clarify certain aspects of the classification and sensitivity (to perturbations in the input data) of minima and saddle points for this system, and may provide insight into dropout and network compression.","authors":["Dhagash Mehta","Xiaojun Zhao","Edgar Andrés Bernal","David J. Wales"],"meta":["April 2018PHYSICAL REVIEW E 97(5)","DOI:10.1103/PhysRevE.97.052307"],"references":["317399405_Are_Saddles_Good_Enough_for_Deep_Learning","317376097_Energy_landscapes_for_machine_learning","308264858_On_Large-Batch_Training_for_Deep_Learning_Generalization_Gap_and_Sharp_Minima","319770334_Deep_Compression_Compressing_Deep_Neural_Networks_with_Pruning_Trained_Quantization_and_Huffman_Coding","319770239_Identifying_and_attacking_the_saddle_point_problem_in_high-dimensional_non-convex_optimization","316623680_Exploring_biomolecular_energy_landscapes","315570714_Energy_Landscapes_for_Machine_Learning","315096447_Sharp_Minima_Can_Generalize_For_Deep_Nets","310610566_Local_minima_in_training_of_deep_networks","307719713_Efficient_object_localization_using_Convolutional_Networks"]}