{"id":"324464619_Algorithms_bots_and_political_communication_in_the_US_2016_election_The_challenge_of_automated_political_communication_for_election_law_and_administration","abstract":"Political communication is the process of putting information, technology, and media in the service of power. Increasingly, political actors are automating such processes, through algorithms that obscure motives and authors yet reach immense networks of people through personal ties among friends and family. Not all political algorithms are used for manipulation and social control however. So what are the primary ways in which algorithmic political communication—organized by automated scripts on social media—may undermine elections in democracies? In the US context, what specific elements of communication policy or election law might regulate the behavior of such “bots,” or the political actors who employ them? First, we describe computational propaganda and define political bots as automated scripts designed to manipulate public opinion. Second, we illustrate how political bots have been used to manipulate public opinion and explain how algorithms are an important new domain of analysis for scholars of political communication. Finally, we demonstrate how political bots are likely to interfere with political communication in the United States by allowing surreptitious campaign coordination, illegally soliciting either contributions or votes, or violating rules on disclosure.","authors":["Philip N. Howard","Samuel Woolley","Ryan Calo"],"meta":["April 2018Journal of Information Technology & Politics 15(7):1-13","DOI:10.1080/19331681.2018.1448735"],"references":["260587124_Detecting_Automation_of_Twitter_Accounts_Are_You_a_Human_Bot_or_Cyborg","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","304225776_Bots_StrongerIn_and_Brexit_Computational_Propaganda_during_the_UK-EU_Referendum","303431228_Pax_Technica_How_the_Internet_of_Things_May_Set_Us_Free_or_Lock_Us_Up","296914114_Machine_speech","292496163_Loopholecom_How_the_fecs_failure_to_fully_regulate_the_internet_undermines_campaign_finance_law","291044350_Coordination_reconsidered","283183426_News_Bots","280538627_Political_Bots_and_the_Manipulation_of_Public_Opinion_in_Venezuela","263970127_Automated_Media_An_Institutional_Theory_Perspective_on_Algorithmic_Media_Production_and_Consumption"]}