{"id":"324497912_Publication_Trends_Over_10_Years_of_Computational_Thinking_Research","abstract":"The current study aimed to review studies on computational thinking (CT) indexed in Web of Science (WOS) and ERIC databases. A thorough search in electronic databases revealed 96 studies on computational thinking which were published between 2006 and 2016. Studies were exposed to a quantitative content analysis through using an article control form developed by the researchers. Studies were summarized under several themes including the research purpose, design, methodology, sampling characteristics, data analysis, and main findings. The findings were reported using descriptive statistics to see the trends. It was observed that there was an increase in the number of CT studies in recent years, and these were mainly conducted in the field of computer sciences. In addition, CT studies were mostly published in journals in the field of Education and Instructional Technologies. Theoretical paradigm and literature review design were preferred more in previous studies. The most commonly used sampling method was the purposive sampling. It was also revealed that samples of previous CT studies were generally pre-college students. Written data collection tools and quantitative analysis were mostly used in reviewed papers. Findings mainly focused on CT skills. Based on current findings, recommendations and implications for further researches were provided.","authors":["ulaş Ilic","Halil İbrahim Haseski","Ufuk Tugtekin"],"meta":["April 2018Contemporary Educational Technology 9(2)","DOI:10.30935/cet.414798","Project: Computational Thinking"],"references":["318394039_Computational_Thinking_in_Educational_Digital_Games_An_Assessment_Tool_Proposal","309160785_Inquiry_Based-Computational_Experiment_Acquisition_of_Threshold_Concepts_and_Argumentation_in_Science_and_Mathematics_Education","303792583_Computational_Thinking_The_Skill_Set_of_the_21st_Century","303668799_Computational_Thinking_for_All_Pedagogical_Approaches_to_Embedding_21st_Century_Problem_Solving_in_K-12_Classrooms","303093502_Pedagogic_transformation_student-directed_design_and_computational_thinking","348865369_An_Introduction_to_Statistical_Concepts_Third_Edition","346923962_Computational_Thinking_in_Educational_Digital_Games_An_Assessment_Tool_Proposal","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","315029881_Designing_a_Literature_Instruction_Using_Big_Data","301745270_Instructional_supports_for_students_with_disabilities_in_K-5_computing_Findings_from_a_cross-case_analysis"]}