{"id":"324484226_Engineering_and_development_in_Brazil_challenges_and_prospects_a_new_perspective_on_the_topic","abstract":"Purpose\n\nEngineering is a powerful instrument for promoting the social and economic development of nations. Its enhancement is a strategic element to accelerate Brazil’s progress. This paper aims to present a new perspective on the topic of “Engineering and Development in Brazil, Challenges and Prospects” (Guimarães et al., 2007). Its goal is to discuss the need for restructuring the Brazilian system for research, development and innovation (RD&I) and the training of human resources in engineering in the country.\n\nDesign/methodology/approach\n\nThis article is designed to discuss the relations between the performance of the industrial sector and the maturation of engineering in Brazil by looking at the national scientific production in the area in comparison to the world production and to countries (South Korea and The Netherlands). Finally, in terms of training human resources, the Brazilian study abroad program Science without Borders program is discussed in the article as an important tool for the qualification of engineering students in Brazil.\n\nFindings\n\nA few of the main findings in this research are as follows: despite being among the top 20 countries in scientific production in Engineering, Brazil still lacks turning this scientific-technological knowledge into products and patents; Brazilian universities and research institutes must build interorganizational collaborations with the industrial sector to increase innovation in the field of engineering; The distribution of the investment in RD&I in engineering must be strategically distributed among its various fields, taking into account national strategies and the technological interrelations between them. The article concludes that engineering is a powerful instrument for promoting a country’s social development while offering indications about Brazilian strategic orientation in the development of engineering.\n\nOriginality/value\n\nDespite already being well known that engineering is a powerful instrument for promoting a country’s social development, this article innovates by associating academic scientific production in engineering to other variables related to economic development, such as gross domestic product, human development index, industrial and manufactured production and the filing of patents. It comes at an important moment when the Brazilian Government is discussing new strategies to increase social and economic development in the country while controlling for the investment in RD&I. Therefore, it is the right moment to discuss national policies in science, technology and innovation, especially in the area of engineering.","authors":["Luis Grochocki","Jorge Guimarães","Alvaro Toubes Prata","João Fernando Gomes de Oliveira"],"meta":["April 2018Innovation & Management Review 15(1)","DOI:10.1108/INMR-02-2018-003"],"references":["308308692_Unbalanced_international_collaboration_affects_adversely_the_usefulness_of_countries'_scientific_output_as_well_as_their_technological_and_social_impact","247909063_The_increasing_link_between_U_S_technology_and_public_science","225309059_Network_Dynamics_and_Field_Evolution_The_Growth_of_Interorganizational_Collaboration_in_the_Life_Sciences1","223000186_The_Increasing_Linkage_between_US_Technology_and_Public_Science"]}