{"id":"324457127_ICE-Based_Refinement_Type_Discovery_for_Higher-Order_Functional_Programs","abstract":"We propose a method for automatically finding refinement types of higher-order function programs. Our method is an extension of the Ice framework of Garg et al. for finding invariants. In addition to the usual positive and negative samples in machine learning, their Ice framework uses implication constraints, which consist of pairs (x, y) such that if x satisfies an invariant, so does y. From these constraints, Ice infers inductive invariants effectively. We observe that the implication constraints in the original Ice framework are not suitable for finding invariants of recursive functions with multiple function calls. We thus generalize the implication constraints to those of the form \\((\\{x_1,\\dots ,x_k\\}, y)\\), which means that if all of \\(x_1,\\dots ,x_k\\) satisfy an invariant, so does y. We extend their algorithms for inferring likely invariants from samples, verifying the inferred invariants, and generating new samples. We have implemented our method and confirmed its effectiveness through experiments. Open image in new window","authors":["Adrien Champion","Tomoya Chiba","Naoki Kobayashi","Ryosuke Sato"],"meta":["April 2018","DOI:10.1007/978-3-319-89960-2_20","In book: Tools and Algorithms for the Construction and Analysis of Systems (pp.365-384)"],"references":["312747006_Dependent_Array_Type_Inference_from_Tests","306927462_SMT-based_model_checking_for_recursive_programs","305793183_Automatically_learning_shape_specifications","309888961_Automating_relatively_complete_verification_of_higher-order_functional_programs","305258493_The_Kind_2_Model_Checker","303773727_Automatically_learning_shape_specifications","303011709_Learning_invariants_using_decision_trees_and_implication_counterexamples","301273972_Learning_invariants_using_decision_trees_and_implication_counterexamples","300472004_Horn_Clause_Solvers_for_Program_Verification","294284620_Compositional_and_Lightweight_Dependent_Type_Inference_for_ML"]}