{"id":"324416606_Monitoring_of_the_Educational_Process_with_the_Use_of_Information_and_Communication_Technologies_A_Case_Study_in_Computer_Science","abstract":"The main goal of the present paper is to get a feedback of the Computer Science lessons in order to introduce consecutive changes in Computer Science curriculum for enhancing the efficiency of the educational process. One of the prospective ways of solving such a problem is the use of information and communication technologies that help searching for an option for enhancing the efficiency. The aim of the current research is to develop monitoring of the educational process at the Computer Science lessons with the use of information and communication technologies and the implementation of the process concerning teachers' deliberate acquirement of monitoring skills. The essential method is monitoring that can improve the state of schooling at the Computer Science lessons by means of identifying problems and deliberate individual work. The paper deals with the step-by-step algorithm of the monitoring implementation at the Computer Science lessons. This algorithm includes the following stages: introductory and motivational, reproductive self work, productive self work and final stage. The peculiarity of monitoring is its traceability of the educational process, a phased examination and progress assessment at the Computer Science lessons. The implementation of phased monitoring at the Computer Science lessons aims at classroom management, the development of educational work and impartial progress assessment.","authors":["Natalia Barinova","Venera Zakirova","Daniya Akhmetova","Lyudmila Lysogorova"],"meta":["April 2018Eurasia Journal of Mathematics, Science and Technology Education 14(6):2379-2391","DOI:10.29333/ejmste/89840"],"references":["322872129_Teaching_English_language_to_young_school-age_children_while_making_projects_playing_games_and_using_robotics","306048101_Australian_Technical_Teachers_Experience_of_Technology_Integration_in_Teaching","298655041_Technology_and_the_New_Professionalization_of_Teaching","286135126_Promoting_Student_Engagement_in_the_Classroom","281404915_Monitoring_makes_a_difference_Quality_and_temporal_variation_in_teacher_education_students'_collaborative_learning","276846907_Using_Student_Test_Scores_to_Measure_Teacher_Performance","322872453_Peculiarities_of_developing_high_school_students'_lexical_skills_by_means_of_the_programmed_learning_technology","305731711_Educational_process_navigator_as_means_of_creation_of_individual_educational_path_of_a_student","295927125_Leadership_and_management_of_quality_in_higher_education","285432521_Progress_self-monitoring_Effects_on_children's_self-efficacy_and_achievement"]}