{"id":"324457712_A_deep_learning_approach_for_ECG-based_heartbeat_classification_for_arrhythmia_detection","abstract":"Classification is one of the most popular topics in healthcare and bioinformatics, especially in relation to arrhythmia detection. Arrhythmias are irregularities in the rate or rhythm of the heartbeat which, in some cases, may occur sporadically in a subject’s daily life. To capture these infrequent events, a Holter device is usually employed to record long-term ECG data. Therefore, the automatic recognition of abnormal heartbeats from a large amount of ECG data is an important and essential task. In the last two decades, a huge number of methods have been proposed to address the problem of ECG beat classification. At the same time, deep learning has advanced rapidly since the early 2000s and now demonstrates a state-of-the-art performance in various fields. In this paper, we propose a novel deep learning approach for ECG beat classification. We have conducted the experiments on the well-known MIT–BIH Arrhythmia Database, and compared our results with the scientific literature. The final results show that our model is not only more efficient than the state of the art in terms of accuracy, but also competitive in terms of sensitivity and specificity.","authors":["Giovanna Sannino","Giuseppe De Pietro"],"meta":["April 2018Future Generation Computer Systems 86(1)","DOI:10.1016/j.future.2018.03.057","Project: Health information systems"],"references":["319491438_Inter-Patient_ECG_Heartbeat_Classification_with_Temporal_VCG_Optimized_by_PSO","308822908_Wearable_technology_and_ECG_processing_for_fall_risk_assessment_prevention_and_detection","303155606_A_survey_of_noise_removal_techniques_for_ecg_signals","301839500_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","298402343_A_revised_scheme_for_real_time_ECG_Signal_denoising_based_on_recursive_filtering","319477323_Big_data_analytics_in_genomics_The_point_on_Deep_Learning_solutions","319407912_Heart_Disorder_Detection_with_Menard_Algorithm_on_Apache_Spark","311450485_Fast_effective_rule_induction","304533937_Learning_representations_by_back_propagating_errors_Cogn","303979870_Computational_Health_Informatics_in_the_Big_Data_Age_A_Survey"]}