{"id":"324453389_Doppler_Effect_in_the_Acoustic_Ultra_Low_Frequency_Band_for_Wireless_Underwater_Networks","abstract":"It is well known that communication is affected by the change in frequency of a signal for an observer that is moving relative to the source. As a result of the motion of either the source or the observer, successive waves are emitted from a position that may get closer or further to the observer. This phenomenon, known as Doppler effect, also affects underwater acoustic waves used for communications between Autonomous Underwater Vehicles (AUVs), Underwater Sensors (USs) and remote operators. There have been few studies on the impact of Doppler shift in underwater communications. Assuming underwater communications using acoustic waves, in this paper we study the Doppler effect in relation to the half-power bandwidth and distance in the Ultra Low Frequency (ULF) band (i.e., from 0.3 to 3 kHz). We investigate two specific issues. Firstly, the maximum shift that can be expected on underwater links in the ULF band. Secondly, the maximum frequency drift, and associated patterns, that can happen during the reception of data frames. Numeric simulations are conducted. The analysis is based on scenarios that show the existence of significant Doppler effect. More specifically, we show that Doppler effect, under narrow half-power bandwidth, is significant with respect to the half-power bandwidth in the ULF band, for long distance communications. Furthermore, we show that Doppler effect patterns are not necessarily linear.","authors":["Abdel-Mehsen Ahmad","Jamil Kassem","Michel Barbeau","Evangelos Kranakis"],"meta":["October 2018Mobile Networks and Applications 23(1)","DOI:10.1007/s11036-018-1036-9"],"references":["299573094_Long_Range_Acoustic_Communications_and_Navigation_in_the_Arctic","282680481_Simulation_of_underwater_communications_with_a_colored_noise_approximation_and_mobility","271873981_A_correction_of_the_half-power_bandwidth_method_for_estimating_damping","349552120_Sonar_and_Underwater_Acoustics_MarageSonar_and_Underwater_Acoustics","272315652_A_low-frequency_underwater_sound_source_for_seismic_exploration","269928579_Underwater_Acoustic_Networking_Techniques","265182467_Sonar_and_Underwater_Acoustics","259639191_An_Introduction_to_Underwater_Acoustic_Principles_and_Applications","256800738_Attenuation_Of_low_frequency_sound_in_the_ocean","243497527_Analytic_Description_of_the_Low-Frequency_Attenuation_Coefficient"]}