{"id":"324485584_LAS_NANOCIENCIAS_EN_UNIVERSIDADES_DE_ENSENANZA_DE_ARTES_LIBERALES_INSERCION_CURRICULAR_E_INTEGRACION_DE_PLANES_DE_ESTUDIOS_-_NANOSCIENCES_IN_LIBERAL_ARTS_COLLEGES_CURRICULUM_EMBEDDING_AND_PROGRAM'S_IN","abstract":"Resumen En esta comunicación se presenta una aproximación a la enseñanza de las nanociencias desde la perspectiva de la Facultad de Ciencias de la Universidad de Santo Tomas, cuya enseñanza es en artes liberales, y donde no hay establecida una licenciatura en Física. Así mismo, el programa curricular de otras licenciaturas no deja espacio a un curso directamente asociado con las nanociencias. También tiene como objetivo, despertar en los estudiantes el sentido de emprendimiento tecnológico y mostrar, cómo las ciencias aplicadas pueden conducir a modelos matemáticos que a su vez pudieran ser extendidos a otras ramas de las ciencias básicas. Al tomar de ejemplo el fenómeno de la superconductividad, se muestra, cómo el mismo vincula avances tecnológicos desde la medicina y la ciencia de la computación y se extiende a la astrofísica y la cosmología. Palabras Clave: Programas de estudios, nanociencias, integración disciplinaria, ciencias básicas, ciencias aplicadas, superconductividad, emprendimiento, semilleros. Abstract This communication discusses an approach for teaching about nanosciences from the perspective of the School of Sciences at St. Thomas University with a \"Liberal Art\" type of education, where also there is not a major in Physics neither room within the curriculum for a course on nanosciences. Besides that, this approach intends motivate students about technological entrepreneurship and discuss how","authors":["David Quesada"],"meta":["April 2018"],"references":["321948882_Biomedical_modeling_of_Magnetic_Nanoparticles_Fluid_Hyperthermia_for_Cancer_treatment","260709276_Identifying_Knowledge_Skill_and_Competence_for_Nanoscience_and_Nanotechnology_Research_A_Study_of_Postgraduate_Researchers'_Experiences","226908041_Nanotechnology_and_the_public_Effectively_communicating_nanoscale_science_and_engineering_concepts","312344362_Mathematical_Modeling_of_the_Optical_response_of_photovoltaic_cells","272118758_Integrating_nanotechnology_into_school_education_A_review_of_the_literature","252443814_The_Arpes_Experiment_and_the_Gap_Symmetry"]}