{"id":"324472557_Deep_image_reconstruction_from_human_brain_activity","abstract":"Machine learning-based analysis of human functional magnetic resonance imaging (fMRI) patterns has enabled the visualization of perceptual content. However, it has been limited to the reconstruction with low-level image bases (Miyawaki et al., 2008; Wen et al., 2016) or to the matching to exemplars (Naselaris et al., 2009; Nishimoto et al., 2011). Recent work showed that visual cortical activity can be decoded (translated) into hierarchical features of a deep neural network (DNN) for the same input image, providing a way to make use of the information from hierarchical visual features (Horikawa & Kamitani, 2017). Here, we present a novel image reconstruction method, in which the pixel values of an image are optimized to make its DNN features similar to those decoded from human brain activity at multiple layers. We found that the generated images resembled the stimulus images (both natural images and artificial shapes) and the subjective visual content during imagery. While our model was solely trained with natural images, our method successfully generalized the reconstruction to artificial shapes, indicating that our model indeed ‘reconstructs’ or ‘generates’ images from brain activity, not simply matches to exemplars. A natural image prior introduced by another deep neural network effectively rendered semantically meaningful details to reconstructions by constraining reconstructed images to be similar to natural images. Furthermore, human judgment of reconstructions suggests the effectiveness of combining multiple DNN layers to enhance visual quality of generated images. The results suggest that hierarchical visual information in the brain can be effectively combined to reconstruct perceptual and subjective images.","authors":["Guohua Shen","Tomoyasu Horikawa","Kei Majima","Yukiyasu Kamitani"],"meta":["December 2017","DOI:10.1101/240317"],"references":["330521293_Variational_Autoencoder_An_Unsupervised_Model_for_Modeling_and_Decoding_fMRI_Activity_in_Visual_Cortex","303682017_Synthesizing_the_preferred_inputs_for_neurons_in_neural_networks_via_deep_generator_networks","283117724_Generic_decoding_of_seen_and_imagined_objects_using_hierarchical_visual_features","326526790_Generative_adversarial_networks_for_reconstructing_natural_images_from_brain_activity","306186676_Neural_Encoding_and_Decoding_with_Deep_Learning_for_Dynamic_Natural_Vision","295833538_Using_goal-driven_deep_learning_models_to_understand_sensory_cortex","288033914_The_Parahippocampal_Place_Area_A_Cortical_Representation_of_the_Local_Visual_Environment","269040983_Understanding_Deep_Image_Representations_by_Inverting_Them","252324799_Linear_Reconstruction_of_Perceived_Images_from_Human_Brain_Activity","226174686_On_the_Limited_Memory_BFGS_Method_for_Large_Scale_Optimization"]}