{"id":"324426210_Decision-Tree_Rule-Based_and_Random_Forest_Classification_of_High-Resolution_Multispectral_Imagery_for_Wetland_Mapping_and_Inventory","abstract":"Efforts are increasingly being made to classify the world’s wetland resources, an important ecosystem and habitat that is diminishing in abundance. There are multiple remote sensing classification methods, including a suite of nonparametric classifiers such as decision-tree (DT), rule-based (RB), and random forest (RF). High-resolution satellite imagery can provide more specificity to the classified end product, and ancillary data layers such as the Normalized Difference Vegetation Index, and hydrogeomorphic layers such as distance-to-a-stream can be coupled to improve overall accuracy (OA) in wetland studies. In this paper, we contrast three nonparametric machine-learning algorithms (DT, RB, and RF) using a large field-based dataset (n = 228) from the Selenga River Delta of Lake Baikal, Russia. We also explore the use of ancillary data layers selected to improve OA, with a goal of providing end users with a recommended classifier to use and the most parsimonious suite of input parameters for classifying wetland-dominated landscapes. Though all classifiers appeared suitable, the RF classification outperformed both the DT and RB methods, achieving OA >81%. Including a texture metric (homogeneity) substantially improved the classification OA. However, including vegetation/soil/water metrics (based on WorldView-2 band combinations), hydrogeomorphic data layers, and elevation data layers to increase the descriptive content of the input parameters surprisingly did not markedly improve the OA. We conclude that, in most cases, RF should be the classifier of choice. The potential exception to this recommendation is under the circumstance where the end user requires narrative rules to best manage his or her resource. Though not useful in this study, continuously increasing satellite imagery resolution and band availability suggests the inclusion of ancillary contextual data layers such as soil metrics or elevation data, the granularity of which may define its utility in subsequent wetland classifications.","authors":["Tedros M Berhane","Charles R. Lane","Qiusheng Wu","Bradley Autrey"],"meta":["April 2018Remote Sensing 10(4):580","DOI:10.3390/rs10040580"],"references":["322109346_Comparing_Pixel-_and_Object-Based_Approaches_in_Effectively_Classifying_Wetland-Dominated_Landscapes","321820219_Google_Earth_Engine_Open-Access_Satellite_Data_and_Machine_Learning_in_Support_of_Large-Area_Probabilistic_Wetland_Mapping","320460251_Mapping_the_Dabus_Wetlands_Ethiopia_Using_Random_Forest_Classification_of_Landsat_PALSAR_and_Topographic_Data","318969304_Automated_Quantification_of_Surface_Water_Inundation_in_Wetlands_Using_Optical_Satellite_Imagery","315888162_A_Review_of_Wetland_Remote_Sensing","322017094_Remote_sensing_for_wetland_classification_a_comprehensive_review","320175649_Enhancing_protection_for_vulnerable_waters","319831842_Feature_Reduction","316575395_GIS_and_Remote_Sensing_Applications_in_Wetland_Mapping_and_Monitoring","313469376_Tree-based_models"]}