{"id":"324472149_An_information-theoretic_all-scales_approach_to_comparing_networks","abstract":"As network research becomes more sophisticated, it is more common than ever for researchers to find themselves not studying a single network but needing to analyze sets of networks. An important task when working with sets of networks is network comparison, developing a similarity or distance measure between networks so that meaningful comparisons can be drawn. The best means to accomplish this task remains an open area of research. Here we introduce a new measure to compare networks, the Portrait Divergence, that is mathematically principled, incorporates the topological characteristics of networks at all structural scales, and is general-purpose and applicable to all types of networks. An important feature of our measure that enables many of its useful properties is that it is based on a graph invariant, the network portrait. We test our measure on both synthetic graphs and real world networks taken from protein interaction data, neuroscience, and computational social science applications. The Portrait Divergence reveals important characteristics of multilayer and temporal networks extracted from data.","authors":["James P. Bagrow","Erik Matthew Bollt"],"meta":["July 2019Applied Network Science 4(1)","DOI:10.1007/s41109-019-0156-x"],"references":["326728182_Complex_network_comparison_based_on_communicability_sequence_entropy","322674830_Tracking_Network_Dynamics_a_review_of_distances_and_similarity_metrics","315782191_Network-Ensemble_Comparisons_with_Stochastic_Rewiring_and_Von_Neumann_Entropy","307636160_Spectral_Entropies_as_Information-Theoretic_Tools_for_Complex_Network_Comparison","288520753_Life_in_the_network_The_coming_age_of_computational_social_science","320754769_Characterizing_the_structural_diversity_of_complex_networks_across_domains","312940435_2001_Statistical_mechanics_of_complex_networksJ","312873583_Neuroscience_Big_brain_big_data","303302244_Learning_Convolutional_Neural_Networks_for_Graphs","299969948_Deep_Graph_Kernels"]}