{"id":"324473034_The_latent_geometry_of_the_human_protein_interaction_network","abstract":"Motivation: \nA series of recently introduced algorithms and models advocates for the existence of a hyperbolic geometry underlying the network representation of complex systems. Since the human protein interaction network (hPIN) has a complex architecture, we hypothesised that uncovering its latent geometry could ease challenging problems in systems biology, translating them into measuring distances between proteins.\n\nResults: \nWe embedded the hPIN to hyperbolic space and found that the inferred coordinates of nodes capture biologically relevant features, like protein age, function and cellular localisation. This means that the representation of the hPIN in the two-dimensional hyperbolic plane offers a novel and informative way to visualise proteins and their interactions. We then used these coordinates to compute hyperbolic distances between proteins, which served as likelihood scores for the prediction of plausible protein interactions. Finally, we observed that proteins can efficiently communicate with each other via a greedy routing process, guided by the latent geometry of the hPIN. We show that these efficient communication channels can be used to determine the core members of signal transduction pathways and to study how system perturbations impact their efficiency.\n\nAvailability and implementation: \nAn R implementation of our network embedder is available at https://github.com/galanisl/NetHypGeom. Also, a web tool for the geometric analysis of the hPIN accompanies this text at http://cbdm-01.zdv.uni-mainz.de/galanisl/gapi.\n\nContact: \ngalanisl@uni-mainz.de or andrade@uni-mainz.de.\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Gregorio Alanis-Lobato","Pablo Mier","Miguel Andrade"],"meta":["April 2018Bioinformatics 34(16)","DOI:10.1093/bioinformatics/bty206"],"references":["310912568_A_Survey_of_Link_Prediction_in_Complex_Networks","310233743_Manifold_learning_and_maximum_likelihood_estimation_for_hyperbolic_network_embedding","309564070_HIPPIE_v20_Enhancing_meaningfulness_and_reliability_of_protein-protein_interaction_networks","334863087_Requirement_of_Smurf-mediated_endocytosis_of_Patched1_in_sonic_hedgehog_signal_reception","317005993_Architecture_of_the_human_interactome_defines_protein_communities_and_disease_networks","316878699_A_subcellular_map_of_the_human_proteome","314721342_Specificity_and_Evolvability_in_Eukaryotic_Protein_Interaction_Networks","314714723_Proteome-Scale_Human_Interactomics","313102947_KEGG_Kyoto_encyclopedia_of_genes_and_genomes","312129770_Distance_Distribution_between_Complex_Network_Nodes_in_Hyperbolic_Space"]}