{"id":"324444981_Mixed-precision_in-memory_computing","abstract":"As complementary metal–oxide–semiconductor (CMOS) scaling reaches its technological limits, a radical departure from traditional von Neumann systems, which involve separate processing and memory units, is needed in order to extend the performance of today’s computers substantially. In-memory computing is a promising approach in which nanoscale resistive memory devices, organized in a computational memory unit, are used for both processing and memory. However, to reach the numerical accuracy typically required for data analytics and scientific computing, limitations arising from device variability and non-ideal device characteristics need to be addressed. Here we introduce the concept of mixed-precision in-memory computing, which combines a von Neumann machine with a computational memory unit. In this hybrid system, the computational memory unit performs the bulk of a computational task, while the von Neumann machine implements a backward method to iteratively improve the accuracy of the solution. The system therefore benefits from both the high precision of digital computing and the energy/areal efficiency of in-memory computing. We experimentally demonstrate the efficacy of the approach by accurately solving systems of linear equations, in particular, a system of 5,000 equations using 998,752 phase-change memory devices. A hybrid system that combines a von Neumann machine with a computational memory unit can offer both the high precision of digital computing and the energy/areal efficiency of in-memory computing, which is illustrated by accurately solving a system of 5,000 equations using 998,752 phase-change memory devices.","authors":["Manuel Le Gallo","Abu Sebastian","Roland Mathis","Matteo Manica"],"meta":["April 2018Nature Electronics 1(4):246-253","DOI:10.1038/s41928-018-0054-8","Project: PrECISE"],"references":["321510724_Mixed-precision_training_of_deep_neural_networks_using_computational_memory","321492168_Analogue_signal_and_image_processing_with_large_memristor_crossbars","317343983_Temporal_correlation_detection_using_computational_phase-change_memory","309140162_ISAAC_A_Convolutional_Neural_Network_Accelerator_with_In-Situ_Analog_Arithmetic_in_Crossbars","324094263_Making_Memristive_Neural_Network_Accelerators_Reliable","322347538_Memristive_Boltzmann_machine_A_hardware_accelerator_for_combinatorial_optimization_and_deep_learning","321715489_Compressed_Sensing_Recovery_using_Computational_Memory","317078153_Sparse_coding_with_memristor_networks","309340583_Inherent_stochasticity_in_phase-change_memory_devices","303693440_RSEM_accurate_transcript_quantification_from_RNA-Seq_data_with_or_without_a_reference_genome_BMC_Bioinform_12323","299642732_Memristive_Boltzmann_machine_A_hardware_accelerator_for_combinatorial_optimization_and_deep_learning","303542726_Dot-product_engine_for_neuromorphic_computing_programming_1T1M_crossbar_to_accelerate_matrix-vector_multiplication","303092482_Stochastic_phase-change_neurons","301333448_Recent_Progress_in_Phase-Change_Memory_Technology","283801160_A_collective_relaxation_model_for_resistance_drift_in_phase_change_memory_cells"]}