{"id":"324436906_Mesure_sans_contact_de_l'activite_cardiaque_par_analyse_du_flux_video_issu_d'une_camera_numerique_extraction_de_parametres_physiologiques_et_application_a_l'estimation_du_stress","abstract":"Photoplethysmographic (PPG) signals obtained from a webcam are analyzed through a continuous wavelet transform to assess the instantaneous pulse rate. The measurements are performed on human faces. Robust image and signal processing are introduced to collect only pixels that contain photoplethysmographic information and to remove major artifacts and trends on raw webcam PPG signals. The interbeat intervals are computed using a standard peak detection to form the instantaneous pulse rate. In addition, the respiration is recovered using the pulse rate series by respiratory sinus arrhythmia, the natural variation in pulse rate driven by the respiration. The amplitudes of the photoplethysmographic signal, which reflect relative changes in the vascular bed due to peripheral vasoconstriction or vasodilatation, are also measured. The presented algorithms are implemented on a mid-range computer and the overall method works in real-time. The performance of the proposed pulse and breathing rates assessment method was evaluated using approved contact probes on a set of 12 healthy subjects. Results show high degrees of correlation between physiological measurements even in the presence of motion. This work provides a motion-tolerant method that remotely measures the instantaneous pulse and breathing rates. Monitoring physiological signals via non-contact means presents a greater challenge in personal health care, telemedicine and affective computing. \n\nThe second part of this thesis consists in assessing mental workload changes using the parameters assessed previously, i.e. the photoplethysmographic amplitude fluctuation and the pulse rate variability. These particular signals provide an estimation of the autonomic nervous system state. In order to validate the proposed method we have recorded, concurrently to the webcam curves, electrodermal activity during an interactive game that was developed to successively stress and relax the subject. We have specifically employed a computerized and interactive version of the STROOP color word test. The results exhibit a strong correlation between the webcam and contact skin conductance level traces and offer further support for the applicability of mental stress detection by remote and low-cost means, providing an alternative to conventional contact techniques.","authors":["Frédéric Bousefsaf"],"meta":["November 2014","Thesis for: PhD"],"references":["281388503_A_Preliminary_Attempt_to_Understand_Compatibility_of_Photoplethysmographic_Pulse_Rate_Variability_with_Electrocardiogramic_Heart_Rate_Variability","279257002_Acquisition_multi-modale_en_temps_reel_pour_le_suivi_du_mouvement_respiratoire","328510001_Discussion_of_Time-frequency_Techniques_in_Biomedical_Signal_Analysis_A_Tutorial_Review_of_Similarities_and_Differences","315616269_Vision_Analysis_in_Detecting_Abnormal_Breathing_Activity_in_application_to_Diagnosis_of_Obstructive_Sleep_Apnoea","312922029_Emotion_recognition_based_on_physiological_changes_in_music_listening","311693095_Heart_rate_variability_Standards_of_measurement_physiological_interpretation_and_clinical_use","298092912_The_respiratory_system","292575325_Soleil_et_peau","289056325_Heart_Rate_Extraction_from_Photoplethysmogram_Waveform_Using_Wavelet_Multi-resolution_Analysis","279608410_The_CIE_system_of_colorimetry","265843107_Heart_Rate_Variability_Stress_and_Psychiatric_Conditions","264560716_Remote_detection_of_mental_workload_changes_using_cardiac_parameters_assessed_with_a_low-cost_webcam","267821281_Ondelettes_pour_le_signal_numerique","266501465_Comment_etudier_les_emotions_en_laboratoire","266067792_Heart_Rate_Variability_Monitoring_during_Human-Computer_Interaction"]}