{"id":"324499591_Stable_States_of_Boolean_Regulatory_Networks_Composed_Over_Hexagonal_Grids","abstract":"Cellular processes are governed by complex molecular regulatory networks. To understand the dynamics emerging from these networks, a popular approach relies on a Boolean abstraction. These Boolean regulatory networks define qualitative models with discrete dynamics in which properties of interest relate to the so-called attractors and their reachability. When considering multi-cellular systems, cell-cell communication must be accounted by properly inter-connecting cellular network models. This is done through logical composition rules that define cell-cell communication, leading to a (composed) model of the regulatory control of the whole.\nThis work focuses on Boolean models composed over hexagonal grids, which suitably represent simple epithelia. Stable states embody stable patterns of the grid, i.e., ensembles of differentiated cell types, each characterized by a specific pattern of gene expression. Identification of these stable states is a challenging problem due to the combinatorial explosion of the dimensions of the model state space and to the potentially huge number of solutions.\nFollowing the formalisation of model composition, we present a SAT-based method to identify the stable states of Boolean models composed over hexagonal grids. This approach is applied to a few prototypical case studies, illustrating counter-intuitive dependencies of the number of stable states on: the cellular model, the composition rule and the grid characteristics (i.e., dimensions and border conditions).","authors":["Pedro Varela","Inês Lynce","Vasco Manquinho","Claudine Chaouiya"],"meta":["April 2018Electronic Notes in Theoretical Computer Science 335:113-130","DOI:10.1016/j.entcs.2018.03.011"],"references":["303690884_Logical_Modeling_and_Dynamical_Analysis_of_Cellular_Networks","301455290_A_New_Method_to_Encode_the_At-Most-One_Constraint_into_SAT","261187019_A_Discrete_Model_of_Drosophila_Eggshell_Patterning_Reveals_Cell-Autonomous_and_Juxtacrine_Effects","245026961_Dynamical_modeling_and_analysis_of_large_cellular_regulatory_networks","225919808_An_Efficient_Method_for_Dynamic_Analysis_of_Gene_Regulatory_Networks_and_in_silico_Gene_Perturbation_Experiments","221218637_Decision_Diagrams_for_the_Representation_and_Analysis_of_Logical_Models_of_Genetic_Networks","263970275_Boolean_modeling_A_logic-based_dynamic_approach_for_understanding_signaling_and_regulatory_networks_and_for_making_useful_predictions","235363858_Composition_and_abstraction_of_logical_regulatory_modules_Application_to_multicellular_systems","221996529_Logical_modelling_of_regulatory_networks_with_GINsim_23","220944458_Combining_Component_Caching_and_Clause_Learning_for_Effective_Model_Counting"]}