{"id":"324417098_Execution_of_UML_models_a_systematic_review_of_research_and_practice","abstract":"Several research efforts from different areas have focused on the execution of UML models, resulting in a diverse and complex scientific body of knowledge. With this work, we aim at identifying, classifying, and evaluating existing solutions for the execution of UML models. We conducted a systematic review in which we selected 63 research studies and 19 tools among over 5400 entries by applying a systematic search and selection process. We defined a classification framework for characterizing solutions for UML model execution, and we applied it to the 82 selected entries. Finally, we analyzed and discussed the obtained data. From the analyzed data, we drew the following conclusions: (i) There is a growing scientific interest on UML model execution; (ii) solutions providing translational execution clearly outnumber interpretive solutions; (iii) model-level debugging is supported in very few cases; (iv) only a few research studies provide evidence of industrial use, with very limited empirical evaluations; (v) the most common limitation deals with coverage of the UML language. Based on these observations, we discuss potential research challenges and implications for the future of UML model execution. Our results provide a concise overview of states of the art and practice for UML model execution intended for use by both researchers and practitioners.","authors":["Federico Ciccozzi","Ivano Malavolta","Bran Selic"],"meta":["June 2019Software and Systems Modeling 18(3)","DOI:10.1007/s10270-018-0675-4","Project: MOMENTUM: analysis of fUML and ALF for optimised model compilation"],"references":["325728289_Unicomp_a_semantics-aware_model_compiler_for_optimised_predictable_software","321015800_Microservices_yesterday_today_and_tomorrow","317071768_Research_on_Architecting_Microservices_Trends_Focus_and_Potential_for_Industrial_Adoption","316104813_Microservices_Yesterday_Today_and_Tomorrow","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","336573400_Systematic_Mapping_Studies_in_Software_Engineering","315664446_Microservices_yesterday_today_and_tomorrow","304371234_UML_executable_A_comparative_study_of_UML_compilers_and_interpreters","304179623_Categorical_Data_Analysis","300641938_A_Customizable_Execution_Engine_for_Models_of_Embedded_Systems"]}