{"id":"324438035_ICT_as_a_catalyst_for_teaching-learning_process_A_meta-analysis_study","abstract":"Information and communication technologies (ICT) have become an important aspects of our daily life. In the past few decades the use of ICT has fundamentally changed the practices and procedures of nearly all forms of endeavor including the education sector. The advent of the internet has pressured new productivity and service demands as well as expectations in the field of education. The world is moving rapidly into digital media and information sector, the role of ICT in Education is becoming more and more important and this importance will continue to grow and develop in the 21st century. In this paper, a detailed literature has been reviewed regarding the proper use of ICTs in the field of education highlighting the effective use of ICT in the teaching and learning process. Introduction In the past few years higher education institutions have enormously invested their time and money in information and communication technologies. ICT has a major impact in higher education, both at the teaching as well as learning process. According to UNESCO (2002) information and communication technology (ICT) is regarded as the combination of 'Informatics technology' with other related technology, specifically communication technology. The dynamic nature of ICT, emphasis the core educational purposes is inclusive in design and focuses on a broad exposure to technologies together aiming at enhancing creativity and imagination of learner. ICT as an institution helps teachers into exploring educational possibilities of technology, learning to make right choices of hardware-software interaction and growing to become a critical users of ICT. For student ICT in education sector is an initiation into creativity and problem solving, an opportunity to share carrier pursuits. The potential of each technology varies according to its use by the population. ICT in education is a medium that uses information and communication technology to support enhance and optimize the knowledge. Researches all over the world has shown that ICT can improve students learning behavior and can enhance teaching skills. National Institute of Multimedia Education in Japan reported that an increase in the use of ICT in education integrated technology to curriculum has a significant and positive impact on students' achievements. The study showed that students who are continuously being exposed to technology through education has better knowledge, presentation skills, innovative capabilities and are ready to take more effort in learning as compared to others. The effective usage of these technology on students' academic performance is one of the debating question. ICTs have good potential to motivate, enrich, accelerate and engage students in helping them to relate school experience with work practices as well as strengthening teaching learning process. In this changing","authors":["Zainab Musheer"],"meta":["March 2018"],"references":["255625262_Pedagogical_Motivations_for_Student_Computer_Use_That_Lead_to_Student_Engagement","249360041_India_in_the_knowledge_economy_-_An_electronic_paradigm","248998120_Guiding_Principles_in_Web-Based_Instructional_Design","347494204_Developing_the_ICT_Capable_School","306201541_Learning_with_technology_using_computers_as_cognitive_tools","292781142_The_24-hour_professor","265540165_Making_Technology_Deliver_for_Education_in_Developing_Countries","252884514_Effects_of_Using_Instructional_Technology_in_Elementary_and_Secondary_Schools_What_Controlled_Evaluation_Studies_Say","243773514_Computers_as_Mindtools_for_Schools_Engaging_Critical_Thinking","243756750_Distance_Education_A_Systems_View"]}