{"id":"324443992_BCDForest_A_boosting_cascade_deep_forest_model_towards_the_classification_of_cancer_subtypes_based_on_gene_expression_data","abstract":"Background: \nThe classification of cancer subtypes is of great importance to cancer disease diagnosis and therapy. Many supervised learning approaches have been applied to cancer subtype classification in the past few years, especially of deep learning based approaches. Recently, the deep forest model has been proposed as an alternative of deep neural networks to learn hyper-representations by using cascade ensemble decision trees. It has been proved that the deep forest model has competitive or even better performance than deep neural networks in some extent. However, the standard deep forest model may face overfitting and ensemble diversity challenges when dealing with small sample size and high-dimensional biology data.\n\nResults: \nIn this paper, we propose a deep learning model, so-called BCDForest, to address cancer subtype classification on small-scale biology datasets, which can be viewed as a modification of the standard deep forest model. The BCDForest distinguishes from the standard deep forest model with the following two main contributions: First, a named multi-class-grained scanning method is proposed to train multiple binary classifiers to encourage diversity of ensemble. Meanwhile, the fitting quality of each classifier is considered in representation learning. Second, we propose a boosting strategy to emphasize more important features in cascade forests, thus to propagate the benefits of discriminative features among cascade layers to improve the classification performance. Systematic comparison experiments on both microarray and RNA-Seq gene expression datasets demonstrate that our method consistently outperforms the state-of-the-art methods in application of cancer subtype classification.\n\nConclusions: \nThe multi-class-grained scanning and boosting strategy in our model provide an effective solution to ease the overfitting challenge and improve the robustness of deep forest model working on small-scale data. Our model provides a useful approach to the classification of cancer subtypes by using deep learning on high-dimensional and small-scale biology data.","authors":["Yang Guo","Liu Shuhui","Zhanhuai Li","Xuequn Shang"],"meta":["April 2018BMC Bioinformatics 19(S5)","DOI:10.1186/s12859-018-2095-4"],"references":["323957541_Improving_the_measurement_of_semantic_similarity_by_combining_gene_ontology_and_co-functional_network_A_random_walk_based_approach","322112514_Measuring_disease_similarity_and_predicting_disease-related_ncRNAs_by_a_novel_method","322110707_Identifying_term_relations_cross_different_gene_ontology_categories","321657764_Classification_of_Breast_Cancer_Subtypes_by_combining_Gene_Expression_and_DNA_Methylation_Data","319936602_DisSetSim_An_online_system_for_calculating_similarity_between_disease_sets","317114002_A_novel_method_to_measure_the_semantic_similarity_of_HPO_terms","305677960_DisSim_An_online_system_for_exploring_significant_similar_diseases_and_exhibiting_potential_therapeutic_drugs","319094310_Identifying_consistent_disease_subnetworks_using_DNet","318830176_Deep_Forest_Towards_An_Alternative_to_Deep_Neural_Networks","317113686_A_novel_method_to_measure_the_semantic_similarity_of_HPO_terms"]}