{"id":"324472130_Quantum_Algorithm_Implementations_for_Beginners","abstract":"As quantum computers have become available to the general public, the need has arisen to train a cohort of quantum programmers, many of whom have been developing classic computer programs for most of their career. While currently available quantum computers have less than 100 qubits, quantum computer hardware is widely expected to grow in terms of qubit counts, quality, and connectivity. Our article aims to explain the principles of quantum programming, which are quite different from classical programming, with straight-forward algebra that makes understanding the underlying quantum mechanics optional (but still fascinating). We give an introduction to quantum computing algorithms and their implementation on real quantum hardware. We survey 20 different quantum algorithms, attempting to describe each in a succintc and self-contained fashion; we show how they are implemented on IBM's quantum computer; and in each case we discuss the results of the implementation with respect to differences of the simulator and the actual hardware runs. This article introduces computer scientists and engineers to quantum algorithms and provides a blueprint for their implementations.","authors":["Patrick J. Coles","Stephan Eidenbenz","Scott Pakin","Adetokunbo Adedoyin"],"meta":["April 2018","Project: Quantum computing algorithms"],"references":["321134985_A_Quantum_Circuit_to_Construct_All_Maximal_Cliques_Using_Grover_Search_Algorithm","308646675_Superfast_maximum-likelihood_reconstruction_for_quantum_tomography","295968442_Quantum_Search_Using_Grover's_Algorithm","295186455_Quantum_search_of_a_real_unstructured_database","322035435_Computing_with_a_single_qubit_faster_than_the_computation_quantum_speed_limit","318671070_Entanglement_spectroscopy_on_a_quantum_computer","315454606_Solving_Systems_of_Linear_Equations_with_a_Superconducting_Quantum_Processor","311737153_Complexity-Theoretic_Foundations_of_Quantum_Supremacy_Experiments","306186585_A_Practical_Quantum_Instruction_Set_Architecture","285096539_Quantum_random_walks_An_introductory_overview"]}