{"id":"324433350_Principal_Component_Analysis_based_Imaging_Angle_Determination_for_3D_Motion_Monitoring_using_Single_Slice_On_Board_Imaging","abstract":"Purpose: \nThrough-plane motion introduces uncertainty in 3D motion monitoring when using single slice on board imaging (OBI) modalities such as cine MRI. We propose a principal component analysis (PCA) based framework to determine the optimal imaging plane to minimize the through-plane motion for single slice imaging based motion monitoring METHODS: Four-dimensional computed tomography (4DCT) images of 8 thoracic cancer patients were retrospectively analyzed. The target volumes were manually delineated at different respiratory phases of 4DCT. We performed automated image registration to establish the 4D respiratory target motion trajectories for all patients. PCA was conducted using the motion information to define the three principal components of the respiratory motion trajectories. Two imaging planes were determined perpendicular to the second and third principal component respectively to avoid imaging with the primary principal component of the through-plane motion. Single slice images were reconstructed from 4DCT in the PCA-derived orthogonal imaging planes, and were compared against the traditional AP/Lateral image pairs on through-plane motion, residual error in motion monitoring, absolute motion amplitude error, and the similarity between target segmentations at different phases. We evaluated the significance of the proposed motion monitoring improvement using paired t-test analysis.\n\nResults: \nThe PCA-determined imaging planes had overall less through-plane motion compared against the AP/Lateral image pairs. For all patients, the average through-plane motion was 3.6 mm (range: 1.6-5.6 mm) for the AP view, and 1.7 mm (range: 0.6-2.7 mm) for the lateral view. With PCA optimization, the average through-plane motion was 2.5 mm (range: 1.3-3.9 mm) and 0.6 mm (range: 0.2-1.5 mm) for the two imaging planes respectively. The absolute residual error of the reconstructed max-exhale-to-inhale motion averaged 0.7 mm (range: 0.4-1.3 mm, 95% CI: 0.4-1.1 mm) using optimized imaging planes, averaged 0.5 mm (range: 0.3-1.0 mm, 95% CI: 0.2-0.8 mm) using an imaging plane perpendicular to the minimal motion component only, and averaged 1.3 mm (range: 0.4-2.8 mm, 95% CI: 0.4-2.3 mm) in AP/Lat orthogonal image pairs. The root mean square error of reconstructed displacement was 0.8 mm for optimized imaging planes, 0.6 mm for imaging plane perpendicular to the minimal motion component only, and 1.6 mm for AP/Lat orthogonal image pairs. When using the optimized imaging planes for motion monitoring, there was no significant absolute amplitude error of the reconstructed motion (p=0.0988), while AP/Lat images had significant error (p=0.0097) with a paired t-test. The average surface distance (ASD) between overlaid 2D tumor segmentation at end-of-inhale and end-of-exhale for all eight patients was 0.6±0.2 mm in optimized imaging planes and 1.4±0.8 mm in AP/Lat images. The Dice similarity coefficient (DSC) between overlaid 2D tumor segmentation at end-of-inhale and end-of-exhale for all eight patients was 0.96±0.03 in optimized imaging planes and 0.89±0.05 in AP/Lat images. Both ASD (p=0.034) and DSC (p=0.022) were significantly improved in the optimized imaging planes.\n\nConclusions: \nMotion monitoring using imaging planes determined by the proposed PCA-based framework had significantly improved performance. Single slice image based motion tracking can be used for clinical implementations such as MR Image Guided Radiation Therapy (MR-IGRT). This article is protected by copyright. All rights reserved.","authors":["Ting Chen","Miao Zhang","Salma Jabbour","Hesheng Wang"],"meta":["April 2018Medical Physics 45(6)","DOI:10.1002/mp.12904"],"references":["314223730_The_Future_of_Image-Guided_Radiotherapy_will_be_MR-Guided","314200651_New_concept_on_an_integrated_interior_magnetic_resonance_imaging_and_medical_linear_accelerator_system_for_radiation_therapy","314097720_MRI-guided_lung_SBRT_Present_and_future_developments","313801305_The_integration_of_MRI_in_radiation_therapy_Collaboration_of_radiographers_and_radiation_therapists","316443471_A_Hybrid_Image_Registration_and_Matching_Framework_for_Real-Time_Motion_Tracking_in_MRI-Guided_Radiotherapy","316307279_Characterization_of_spatial_distortion_in_a_035T_MRI-guided_radiotherapy_system","312477229_Magnetic_field_effects_on_particle_beams_and_their_implications_for_dose_calculation_in_MR_guided_particle_therapy","309734691_Initial_experiments_with_gel-water_towards_MRI-linac_dosimetry_and_imaging","308490842_Anatomic_and_dosimetric_changes_in_patients_with_head_and_neck_cancer_treated_with_an_integrated_MRI-_tri-_60_Co_teletherapy_device","307969841_Technical_Note_Experimental_results_from_a_prototype_high-field_inline_MRI-linac"]}