{"id":"324459289_A_Dynamic_Algorithm_for_Stochastic_Trust_Propagation_in_Online_Social_Networks_Learning_Automata_Approach","abstract":"The dynamic nature of trust has been universally accepted in the literature. As two users interact with each other, trust between them evolves based on their interaction's experience, in such a way that the level of trust increases if the experience is positive and otherwise, it decreases. Since social interactions in online networks, especially in activity and interaction networks, occur continuously in time, trust networks can be considered as stochastic graphs with continuous time-varying edge weights. This is while previous work on the trust propagation has assumed trust network as a static graph and developed deterministic algorithms for inferring trust in the graph. The problem becomes more challenging since trust propagation based algorithms are too time-consuming and therefore it is highly probable that trust weights change during their running time. In order to tackle this problem, this paper proposes a dynamic algorithm called DyTrust to infer trust between two indirectly connected users. The proposed algorithm utilizes distributed learning automata (DLA) to capture the dynamicity of trust during the trust propagation process and dynamically update the found reliable trust paths upon the trust variations. To the best of our knowledge, DyTrust is the first dynamic trust propagation algorithm presented so far. We conduct several experiments on the real trust network dataset, Kaitiaki, and evaluate the performance of the proposed algorithm DyTrust in comparison with the well-known trust propagation algorithms. The results demonstrate that by considering the dynamicity of trust, DyTrust can infer trust with a higher accuracy.","authors":["Mina Ghavip our","Mohammad Reza Meybodi"],"meta":["April 2018Computer Communications 123","DOI:10.1016/j.comcom.2018.04.004"],"references":["278680821_Efficiently_Predicting_Trustworthiness_of_Mobile_Services_Based_on_Trust_Propagation_in_Social_Networks"]}