{"id":"324555751_An_Ensemble_of_Condition_Based_Classifiers_for_Device_Independent_Detailed_Human_Activity_Recognition_Using_Smartphones","abstract":"Human activity recognition is increasingly used for medical, surveillance and entertainment applications. For better monitoring, these applications require identification of detailed activity like sitting on chair/floor, brisk/slow walking, running, etc. This paper proposes a ubiquitous solution to detailed activity recognition through the use of smartphone sensors. Use of smartphones for activity recognition poses challenges such as device independence and various usage behavior in terms of where the smartphone is kept. Only a few works address one or more of these challenges. Consequently, in this paper, we present a detailed activity recognition framework for identifying both static and dynamic activities addressing the above-mentioned challenges. The framework supports cases where (i) dataset contains data from accelerometer; and the (ii) dataset contains data from both accelerometer and gyroscope sensor of smartphones. The framework forms an ensemble of the condition based classifiers to address the variance due to different hardware configuration and usage behavior in terms of where the smartphone is kept (right pants pocket, shirt pockets or right hand). The framework is implemented and tested on real data set collected from 10 users with five different device configurations. It is observed that, with our proposed approach, 94% recognition accuracy can be achieved.","authors":["Jayita Saha","Chandreyee Chowdhury","Ishan Roy Chowdhury","Suparna Biswas"],"meta":["April 2018Information (Switzerland) 9(4):94","DOI:10.3390/info9040094"],"references":["321262735_Designing_device_independent_two-phase_activity_recognition_framework_for_smartphones","319181998_Activity_Recognition_Invariant_to_Sensor_Orientation_with_Wearable_Motion_Sensors","312236027_PACP_A_Position-Independent_Activity_Recognition_Method_Using_Smartphone_Sensors","288102533_A_wearable_sensor_based_approach_to_real-time_fall_detection_and_fine-grained_activity_recognition","282540158_Multimodal_Wearable_Sensing_for_Fine-Grained_Activity_Recognition_in_Healthcare","282535768_Ambient_and_smartphone_sensor_assisted_ADL_recognition_in_multi-inhabitant_smart_environments","315365036_Human_Activities_Recognition_in_Android_Smartphone_Using_Support_Vector_Machine","303464131_Physical_Activity_Recognition_From_Smartphone_Accelerometer_Data_for_User_Context_Awareness_Sensing","301409490_An_Ensemble_Approach_for_Activity_Recognition_with_Accelerometer_in_Mobile-Phone","298412360_A_Public_Domain_Dataset_for_Human_Activity_Recognition_using_Smartphones"]}