{"id":"324565677_A_dynamic_phase_model_of_psychological_contract_processes","abstract":"In formulating a dynamic model of psychological contract (PC) phases, this paper offers new insights by incorporating a temporal perspective into the study of the PC. Although conceptualized as a dynamic construct, little empirical attention has been directed at how PCs evolve and change over time. Moreover, conceptualization of the PC and its processes has undergone limited revision since the 1990s despite challenges to some of its tenets and advances in related fields that suggest the importance of time to such processes. In this article, we address limitations in existing theory, clarify the conceptualization of the PC, and bring dynamism to the forefront of PC theory building by emphasizing dynamic processes. We propose a phase‐based model of PC processes (intraphase and interphase) wherein the functions of key variables (e.g., promises, inducements, contributions, and obligations) change over time and context. These phases include creation, maintenance, renegotiation, and repair. This model directs attention to the dynamic nature of the PC, drawing on contemporary evidence regarding self‐regulatory mechanisms. Finally, we present the implications of this dynamic phase model for theory and research.","authors":["Denise M. Rousseau","Samantha D. Hansen","Maria Tomprou"],"meta":["September 2016Journal of Organizational Behavior 39(9)","DOI:10.1002/job.2284"],"references":["308039593_A_Multi-Level_Theory_of_Psychological_Contract_Fulfillment_in_Teams","306255684_Organizational_commitment_and_related_constructs_Psychological_contracts","325671474_Core_Affect_and_the_Psychological_Construction_of_Emotion","325003171_Corporate_Ethics_Programs_as_Control_Systems_Influences_of_Executive_Commitment_and_Environmental_Factors","324997397_Repairing_and_Enhancing_Trust_Approaches_to_Reducing_Organizational_Trust_Deficits","324385827_Organizational_Psychology","324288984_The_Social_Psychology_of_Bargaining_and_Negotiation","318149961_Knowledge_acquisition_and_effective_socialization_The_role_of_the_psychological_contract","317971120_International_Review_of_Industrial_and_Organizational_Psychology_Volume_10","313302179_Job_Market_Signaling"]}