{"id":"324536376_EMPIOT_An_energy_measurement_platform_for_wireless_IoT_devices","abstract":"Profiling and minimizing the energy consumption of IoT devices is an essential step towards employing IoT in various application domains. In this paper we propose EMPIOT, an accurate, low-cost, easy to build, and flexible, power measurement platform. We present the hardware and software components of this platform, and study the effect of various design parameters on accuracy. In particular, we analyze the effect of driver, bus speed, input voltage, and buffering mechanism, on sampling rate, measurement accuracy and processing demand. These extensive experimental studies enable us to configure the system in order to achieve its highest performance. We also propose a novel calibration technique and report the calibration parameters under various settings. Using five different IoT devices performing four types of workloads, we evaluate the performance of EMPIOT against the ground truth obtained from high-accuracy devices. Our results show that, for very low-power devices that utilize 802.15.4 wireless standard, measurement error is less than 4%. In addition, for 802.11-based devices that generate short and high power spikes, error is less than 3%.","authors":["Behnam Dezfouli","Immanuel Amirtharaj","Chia-Chi Li"],"meta":["April 2018","DOI:10.1016/j.jnca.2018.07.016","Project: IoT Power Management"],"references":["307947563_Trusted_Energy-Efficient_Cloud-Based_Services_Brokerage_Platform","266383054_CAMA_Efficient_Modeling_of_the_Capture_Effect_for_Low-Power_Wireless_Networks","318327525_Efficient_analysis_of_power_consumption_behaviour_of_embedded_wireless_IoT_systems","315382774_An_Energy-aware_Service_Composition_Algorithm_for_Multiple_Cloud-based_IoT_Applications","309687867_Distributed_Energy_Measurement_in_WSNs_for_Outdoor_Applications","303885628_mMonitor_In-situ_energy_monitoring_with_microwatt_power_consumption","303332765_Energy_Profiling_in_Practical_Sensor_Networks_Identifying_Hidden_Consumers","301410228_A_power_measurement_system_for_accurate_energy_profiling_of_embedded_wireless_systems","280970584_The_Power_of_Models_Modeling_Power_Consumption_for_IoT_Devices","276062089_PowerPi_Measuring_and_Modeling_the_Power_Consumption_of_the_Raspberry_Pi"]}