{"id":"324558712_Author-level_metrics_in_the_new_academic_profile_platforms_The_online_behaviour_of_the_Bibliometrics_community","abstract":"The new web-based academic communication platforms do not only enable researchers to better advertise their academic outputs, making them more visible than ever before, but they also provide a wide supply of metrics to help authors better understand the impact their work is making. This study has three objectives: a) to analyse the uptake of some of the most popular platforms (Google Scholar Citations, ResearcherID, ResearchGate, Mendeley and Twitter) by a specific scientific community (bibliometrics, scientometrics, informetrics, webometrics, and altmetrics); b) to compare the metrics available from each platform; and c) to determine the meaning of all these new metrics. To do this, the data available in these platforms about a sample of 811 authors (researchers in bibliometrics for whom a public profile Google Scholar Citations was found) were extracted. A total of 31 metrics were analysed. The results show that a high number of the analysed researchers only had a profile in Google Scholar Citations (159), or only in Google Scholar Citations and ResearchGate (142). Lastly, we find two kinds of metrics of online impact. First, metrics related to connectivity (followers), and second, all metrics associated to academic impact. This second group can further be divided into usage metrics (reads, views), and citation metrics. The results suggest that Google Scholar Citations is the source that provides more comprehensive citation-related data, whereas Twitter stands out in connectivity-related metrics.","authors":["Alberto Martín-Martín","Enrique Orduna-Malea","Emilio Delgado López-Cózar"],"meta":["April 2018Journal of Informetrics 12(2)","DOI:10.1016/j.joi.2018.04.001","Projects: Google Scholar as a tool for scientific evaluationOnline Academic Profiles"],"references":["346934156_Scientific_Revolution_in_Scientometrics_The_Broadening_of_Impact_from_Citation_to_Societal","321312971_A_novel_method_for_depicting_academic_disciplines_through_Google_Scholar_Citations_The_case_of_Bibliometrics","316573798_Do_ResearchGate_Scores_create_ghost_academic_reputations","315360406_Academicss_Awareness_Perceptions_and_Uses_of_Social_Networking_Sites_Analysis_of_a_Social_Networking_Sites_Survey_Dataset","312038361_Can_we_use_Google_Scholar_to_identify_highly-cited_documents","312032771_Comparing_Downloads_Mendeley_Readership_and_Google_Scholar_Citations_as_Indicators_of_Article_Performance","307303664_Scholarly_use_of_social_media_and_altmetrics_A_review_of_the_literature","317241694_An_Assessment_of_the_Completeness_of_Scholarly_Information_on_the_Internet","316136090_Social_Network_Sites_for_Scientists_A_Quantitative_Survey","312210566_Principal_Component_Analysis"]}