{"id":"324574642_UNet_A_Nested_U-Net_Architecture_for_Medical_Image_Segmentation","abstract":"In this paper, we present UNet++, a new, more powerful architecture for medical image segmentation. Our architecture is essentially a deeply-supervised encoder-decoder network where the encoder and decoder sub-networks are connected through a series of nested, dense skip pathways. The re-designed skip pathways aim at reducing the semantic gap between the feature maps of the encoder and decoder sub-networks. We argue that the optimizer would deal with an easier learning task when the feature maps from the decoder and encoder networks are semantically similar. We have evaluated UNet++ in comparison with U-Net and wide U-Net architectures across multiple medical image segmentation tasks: nodule segmentation in the low-dose CT scans of chest, nuclei segmentation in the microscopy images, liver segmentation in abdominal CT scans, and polyp segmentation in colonoscopy videos. Our experiments demonstrate that UNet++ with deep supervision achieves an average IoU gain of 3.9 and 3.4 points over U-Net and wide U-Net, respectively.","authors":["Zongwei Zhou","Md Mahfuzur Rahman Siddiquee","Nima Tajbakhsh","Jianming Liang"],"meta":["July 2018","Conference: 4th Deep Learning in Medical Image Analysis (DLMIA) WorkshopAt: Spain"],"references":["318505761_Fine-Tuning_Convolutional_Neural_Networks_for_Biomedical_Image_Analysis_Actively_and_Incrementally","306885833_Densely_Connected_Convolutional_Networks","297659797_Convolutional_Neural_Networks_for_Medical_Image_Analysis_Fine_Tuning_or_Full_Training","332815165_Residual_Conv-Deconv_Grid_Network_for_Semantic_Segmentation","322060396_Mask_R-CNN","319977080_H-DenseUNet_Hybrid_Densely_Connected_UNet_for_Liver_and_Liver_Tumor_Segmentation_from_CT_Volumes","318699860_Residual_Conv-Deconv_Grid_Network_for_Semantic_Segmentation","306187521_The_Importance_of_Skip_Connections_in_Biomedical_Image_Segmentation","305193694_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation","301921832_Fully_convolutional_networks_for_semantic_segmentation"]}