{"id":"324564507_MODEL_OF_THE_IMPLEMENTATION_PROCESS_OF_DESIGNING_A_CLOUD-BASED_LEARNING_ENVIRONMENT_FOR_THE_PREPARATION_OF_BACHELOR_OF_COMPUTER_SCIENCE","abstract":"The article presents the model of the process of implementation of the design of a cloud-oriented learning environment (CBLE) for the preparation of bachelor of computer science, which consists of seven stages: analysis, setting goals and objectives, formulating requirements for the cloud-oriented learning environment, modeling the CBLE, developing CBLE, using CBLE in the educational Bachelor of Computer Science and Performance Testing. Each stage contains sub-steps. The analysis stage is considered in three aspects: psychological, pedagogical and technological. The formulation of the requirements for the CBLE was carried out taking into account the content and objectives of the training; experience of using CBLE; the personal qualities and knowledge, skills and abilities of students. The simulation phase was divided into sub-stages: the development of a structural and functional model of the CBLE for the preparation of bachelors of computer science; development of a model of cloud-oriented learning support system (COLSS); development of a model of interaction processes in CBLE. The fifth stage was also divided into the following sub-steps: domain registration and customization of the appearance of COLSS; definition of the disciplines provided by the curriculum preparation of bachelors of computer science; creation of own cabinets of teachers and students; download educational and methodological and accompanying materials; the choice of traditional and cloud-oriented forms, methods, means of training. The verification of the functioning of the CBLE will be carried out in the following areas: the functioning of the CBLE; results of students' educational activity; formation of information and communication competence of students.","authors":["Tetiana Vakaliuk"],"meta":["December 2017Information Technologies in Education","DOI:10.14308/ite000649","Project: Theoretical and methodical principles of the cloud-based learning environment design and use in the training of bachelors in computer science."],"references":[]}