{"id":"324579846_Defining_a_Class_of_Cyber_Weapons_as_WMD_An_Examination_of_the_Merits","abstract":"This article examines the merits of defining a class of offensive destructive cyber weapons as weapons of mass destruction (WMD). It analyzes the growing danger of destructive cyber weapons in the future joint operating environment and the devastating effects they may have in the physical domain. Further, it outlines evidence that specifically coded, offensive destructive cyber weapons would meet the spirit and intent of the three academic conditions for categorization as WMD. It argues the merits of categorizing a class of destructive cyber weapons as WMD, and addresses important factors required to examine advantages afforded to policy makers. Towards this end, the paper offers two recommendations for consideration to account for the value in designating a class of destructive cyber weapons as WMD. The recommendations include a proposed cyber deterrence theory of \"Attributed Response Assured,\" and outline how this theory could support a U.S. cyber policy of strategic ambiguity. Further, it recommends defining acceptable behaviors for cyber activity by the international community. In the absence of a U.N.-led effort, the establishment of a Proliferation Security Initiative-type agreement could further steps to clarify \"norms\" and communicate \"redlines\" to potential adversaries. These steps would assist policy makers in the collective effort towards enabling the security of a networked world against the most dangerous cyber threats capable of causing mass casualties or mass destruction.","authors":["Benjamin B. Hatch"],"meta":["April 2018Journal of Strategic Security 11(1):43-61","DOI:10.5038/1944-0472.11.1.1657"],"references":["281863975_Defining_weapons_of_mass_destruction","281863967_The_Future_of_Weapons_of_Mass_Destruction_Their_Nature_and_Role_in_2030","235159408_Defining_Weapons_of_Mass_Destruction","320356946_Bombing_to_Win_Air_Power_and_Coercion_in_War"]}