{"id":"324518990_The_Effects_of_Adding_Reachability_Predicates_in_Propositional_Separation_Logic","abstract":"The list segment predicate (LS) used in separation logic for verifying programs with pointers is well-suited to express properties on singly-linked lists. We study the effects of adding LS to the full propositional separation logic with the separating conjunction and implication, which is motivated by the recent design of new fragments in which all these ingredients are used indifferently and verification tools start to handle the magic wand connective. This is a very natural extension that has not been studied so far. We show that the restriction without the separating implication can be solved in polynomial space by using an appropriate abstraction for memory states whereas the full extension is shown undecidable by reduction from first-order separation logic. Many variants of the logic and fragments are also investigated from the computational point of view when LS is added, providing numerous results about adding reachability predicates to propositional separation logic.","authors":["Stephane Demri","Étienne Lozes","Alessio Mansutti"],"meta":["April 2018","DOI:10.1007/978-3-319-89366-2_26","Conference: FOSSACS'18","Projects: Separation LogicDecision Procedures for Separation Logics"],"references":["318364792_A_Decidable_Fragment_in_Separation_Logic_with_Inductive_Predicates_and_Arithmetic","318130157_Separation_Logic_with_One_Quantified_Variable","300636175_Automated_Theorem_Proving_for_Assertions_in_Separation_Logic_with_All_Connectives","340421919_Parametric_completeness_for_separation_theories","328780101_On_the_Almighty_Wand","328780100_Reasoning_about_sequences_of_memory_states","325112180_Viper_A_verification_infrastructure_for_permission-based_reasoning","316183702_A_decision_procedure_for_satisfiability_in_separation_logic_with_inductive_predicates","303144413_Expressive_completeness_of_separation_logic_with_two_variables_and_no_separating_conjunction","300114364_Viper_A_Verification_Infrastructure_for_Permission-Based_Reasoning"]}