{"id":"324575869_Indoor_Tracking_Mapping_and_Navigation_Algorithms_Technologies_and_Applications","abstract":"The demand of intelligent systems that can improve our daily lives by providing relevant information is continuously growing. Some examples include 1) finding the nearest exit during emergency events; 2) continuous georeferencing in either outdoor or indoor environments to receive location-based information; 3) tracking people and goods to prevent our assets from being lost; and 4) monitoring of people’s physical activities to encourage an active lifestyle or to patrol medical rehabilitation. An important requirement of such systems should be the ability to sense movement and location and possibly predict our behaviour in the short time. Spatial 3D information plays a crucial role in understanding the context and making technologies around us autonomous. However, due to factors such as scene obstructions, movement variations, sensor limitations, and model uncertainty, indoor tracking, mapping, and navigation remain to be a highly challenging problem.\n\nIn this special issue, recent advancements in computer vision, machine learning, robotics, engineering, and spatial sciences are brought together to study motion tracking, 2D/3D digitization of indoor spaces, and navigation in the absence of GNSS signals. State-of-the-art algorithms, methods, technologies, and innovative applications are presented to support cross-disciplinary collaboration.","authors":["Jacky C. K. Chow","Michael Peter","Marco Scaioni","Mohannad Al-Durgham"],"meta":["April 2018Journal of Sensors 2018:1-3","DOI:10.1155/2018/5971752","Project: Robot Vision and Navigation"],"references":["319854802_THE_ISPRS_BENCHMARK_ON_INDOOR_MODELLING","307823090_Towards_automatic_indoor_reconstruction_of_cluttered_building_rooms_from_point_clouds","301849501_Estimating_Uncertain_Spatial_Relationships_in_Robotics","284748697_An_Improved_PDRMagnetometerFloor_Map_Integration_Algorithm_for_Ubiquitous_Positioning_Using_the_Adaptive_Unscented_Kalman_Filter","275557275_Implementation_of_Mobile_Target_Positioning_Technology_Integrating_SINS_with_WSN_Measurements","312425025_Summary_of_available_indoor_location_techniques","302920076_Parametric_as-built_model_generation_of_complex_shapes_from_point_clouds","278701579_Sequential_Monte_Carlo_Methods_for_Localization_in_Wireless_Networks","273182272_Where_is_photogrammetry_heading_to_State_of_the_art_and_trends","262397124_In_Autonomous_Robot_Vehicles"]}