{"id":"324506742_Politicas_de_integracion_en_la_educacion_universitaria_El_caso_de_indigenas_y_afrocolombianos_y_el_problema_de_la_desercion","abstract":"Para superar rupturas del modelo educativo que influyen en la deserción en el sistema de educación universitario, acordamos realizar una intervención matriculando a los estudiantes indígenas y afrocolombianos admitidos en el 2006-­-II a los diferentes programas de ingeniería que ofrece la Universidad del Valle en los cursos de cálculo. La experiencia se da como un proceso de investigación-intervención que se diseñó e implementó con el objetivo de proporcionar una oportunidad, real y no solo legal a los estudiantes que ingresan por condición de excepción étnica a los planes de ingenierías, de acceder a los conocimientos científicos y tecnológicos de que se ocupa dicha universidad. \n\nTo overcome the ruptures of the educational model that influence the desertion in the university education system, we agreed to carry out an intervention by enrolling the indigenous and Afro-Colombian students admitted in 2006-II to the different engineering programs offered by the Universidad del Valle in the courses of calculation. The experience is given as an investigation-intervention process that was designed and implemented with the objective of providing an opportunity, real and not only legal to the students who enter the engineering plans due to ethnic exception condition, to access the knowledge scientific and technological aspects of the university.","authors":["Rafael Alberto Méndez-Romero","César Augusto Delgado"],"meta":["April 2018Revista Electrónica Interuniversitaria de Formación del Profesorado 21(2)","DOI:10.6018/reifop.21.2.323221"],"references":["254337851_Teaching_image-processing_concepts_in_junior_high_school_Boys'_and_girls'_achievements_and_attitudes_towards_technology","249752162_A_qualitative_study_using_project-based_learning_in_a_mainstream_middle_school","226593203_Project-Based_Learning_in_Post-Secondary_Education_-_Theory_Practice_and_Rubber_Sling_Shots","284690440_Actividad_conjunta_Y_habla","272816419_El_Desarrollo_de_los_procesos_psicologicos_superiores","261620472_Creating_Usable_Innovations_in_Systemic_Reform_Scaling_Up_Technology-Embedded_Project-Based_Science_in_Urban_Schools","234604818_Promising_Practices_for_Connecting_High_School_to_the_Real_World","49304656_Psicologia_de_la_invencion_en_el_campo_matematico"]}