{"id":"324559398_Unpacking_the_Strategies_of_Ten_Highly_Rated_MOOCs_Implications_for_Engaging_Students_in_Large_Online_Courses","abstract":"For an instructor who is interested in conducting large online courses, what factors related to course design and the individual instructors could engage their students? Which of these factors are more valued by the students? What specific strategies are used to implement these factors? To answer these questions, this paper examines the factors and strategies that could engage learners in 10 highly-rated massive open online courses (MOOCs) across different subject disciplines. Ten highly-rated MOOCs were sampled because they could exemplify good practice or teaching strategies. The features of each MOOC were examined in detail, along with a large-scale qualitative analysis of 4,466 participants’ reflection data. The current study also investigated the reasons for students’ disaffection, and students’ suggestions for improvement. Findings suggest six key factors that can engage online students and nine reasons for student disaffection. Collectively, the findings and implications presented in this study provide practical guidelines to other instructors of large online courses. The findings may also offer tips for instructors of traditional e-learning courses. At the very least, the information presented in this study might suggest possible solutions for traditional e-learning courses that might otherwise been overlooked.","authors":["Khe Foon Hew"],"meta":["April 2018Teachers College Record 120(1)","DOI:10.1177/016146811812000107"],"references":["286859720_Self_and_peer_assessment_in_massive_open_online_courses","283159673_Motivation_in_the_Classroom_Reciprocal_Effects_of_Teacher_Behavior_and_Student_Engagement_Across_the_School_Year","317214677_The_Influence_of_Teacher_and_Peer_Relationships_on_Students'_Classroom_Engagement_and_Everyday_Motivational_Resilience","313390246_Basics_of_qualitative_research_Grounded_theory_procedures_and_techniques","312443917_My_Modern_Experience_Teaching_a_MOOC","298574732_The_MOOC_syllabus_blues_Strategies_for_MOOCs_and_syllabus_materials","297784857_What_professors_can_learn_from_'hard_core'_MOOC_students","289963904_Intrinsic_and_extrinsic_motivations_Classic_definitions_and_new_directions","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","288882856_The_teacher-child_relationship_and_children's_early_school_adjustment"]}