{"id":"324507886_AVALIACAO_DE_FERRAMENTAS_DE_MINERACAO_DE_DADOS_UMA_ABORDAGEM_COM_O_MODELO_TAM","abstract":"A mineração de dados é a área da ciência da computação que visa analisar grandes volumes de dados com o objetivo de descobrir informações úteis, ocultas e não triviais para as organizações. Para apoiar este processo de descoberta do conhecimento existem inúmeras ferramentas de mineração de dados como, por exemplo, Weka, Knime, RapidMiner e Tanagra. Entretanto, não se sabe como cientistas de dados, em formação, aceitam e utilizam tais ferramentas. Assim, o objetivo deste trabalho é avaliar a aceitação das ferramentas de mineração de dados (Weka, Knime, RapidMiner e Tanagra) através do modelo de aceitação de tecnologia (Technology Acceptance Model – TAM) com os discentes da disciplina de Mineração de Dados do curso de Sistemas de Informação de uma Instituição Pública. Para tanto, foi aplicado um questionário com 23 questões sobre Variáveis Externas (VE), Facilidade de uso percebido (FUP), Utilidade Percebida (UP) e Intenção Comportamental (IC) com 12 discentes do referido curso, durante o segundo semestre de 2016. A pesquisa mostrou as ferramentas analisadas são fáceis de serem usadas, com exceção da Tanagra que obteve 48,9% de aceitação neste quesito. Todas as ferramentas mostraram-se úteis para realizar as tarefas de mineração de dados. Além disso, os participantes demonstraram interesse em utilizar as tarefas diárias de mineração de dados, em particular o RapidMiner, Weka e Knime.","authors":["Gleidison Santos Hora","Jislane Silva Santos Menezes","Gilson Pereira dos Santos Júnior","Almerindo Nascimento Rehem Neto"],"meta":["March 2018Interfaces Científicas - Exatas e Tecnológicas 2(3):109","DOI:10.17564/2359-4942.2018v2n3p109-121"],"references":["277983543_User_Acceptance_of_Information_Technology_Theories_and_Models","277890863_Adocao_de_um_Software_Publico_Brasileiro_Estudo_de_Caso_orientado_pelo_Modelo_de_Aceitacao_de_Tecnologia","273482112_Research_on_information_systems_failures_and_successes_Status_update_and_future_directions","227446117_User_Acceptance_of_Computer_Technology_A_Comparison_of_Two_Theoretical_Models","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","241186867_ANALISE_DO_MODELO_DE_ACEITACAO_DE_TECNOLOGIA_DE_DAVIS","227458458_Principles_of_Data_Mining","2334667_A_Survey_Of_Data_Mining_And_Knowledge_Discovery_Software_Tools"]}