{"id":"324575475_A_Stone-type_Duality_Theorem_for_Separation_Logic_Via_its_Underlying_Bunched_Logics","abstract":"Stone-type duality theorems, which relate algebraic and relational/topological models, are important tools in logic because — in addition to elegant abstraction — they strengthen soundness and completeness to a categorical equivalence, yielding a framework through which both algebraic and topological methods can be brought to bear on a logic. We give a systematic treatment of Stone-type duality theorems for the structures that interpret bunched logics, starting with the weakest systems, recovering the familiar Boolean BI, and concluding with Separation Logic. Our results encompass all the known existing algebraic approaches to Separation Logic and prove them sound with respect to the standard store-heap semantics. We additionally recover soundness and completeness theorems of the specific truth-functional models of these logics as presented in the literature. This approach synthesises a variety of techniques from modal, substructural and categorical logic and contextualises the ‘resource semantics’ interpretation underpinning Separation Logic amongst them. As a consequence, theory from those fields — as well as algebraic and topological methods — can be applied to both Separation Logic and the systems of bunched logics it is built upon. Conversely, the notion of indexed resource frame (generalizing the standard model of Separation Logic) and its associated completeness proof can easily be adapted to other non-classical predicate logics.","authors":["Simon Docherty","David Pym"],"meta":["April 2018Electronic Notes in Theoretical Computer Science 336:101-118","DOI:10.1016/j.entcs.2018.03.018"],"references":["302059548_A_Logic_of_Separating_Modalities","279716572_A_Program_Construction_and_Verification_Tool_for_Separation_Logic","340421919_Parametric_completeness_for_separation_theories","323335675_Undecidability_of_Propositional_Separation_Logic_and_Its_Neighbours","313857563_Intuitionistic_Layered_Graph_Logic_Semantics_and_Proof_Theory","302150812_The_Scope_of_First-Order_Logic","298809434_A_calculus_and_logic_of_bunched_resources_and_processes","281425897_Layered_graph_logic_as_an_assertion_language_for_access_control_policy_models","275166094_The_formal_strong_completeness_of_partial_monoidal_Boolean_BI","274969956_Context_logic_as_modal_logic","262161279_Expressivity_Properties_of_Boolean_BI_Through_Relational_Models","270752720_Erratum_to_A_substructural_logic_for_layered_graphs","268164079_Looking_at_Separation_Algebras_with_Boolean_BI-eyes","262282666_Categorical_logic","243779915_Boolean_Algebras_with_Operators_Part_I"]}