{"id":"324590709_An_Optimal_Cluster_Formation_Based_Energy_Efficient_Dynamic_Scheduling_Hybrid_MAC_Protocol_for_Heavy_Traffic_Load_in_Wireless_Sensor_Networks","abstract":"This article proposes an Energy Efficient Dynamic Scheduling Hybrid MAC Protocol (EDS-MAC) for Traffic Adaptive Wireless Sensor Networks. The proposed approach consists of two stages. (i) cluster formation, and (ii) data transmission. In the first stage, a variable step size firefly algorithm (VSSFFA) is proposed for generating energy-aware clusters by optimal selection of cluster heads. The VSSFFA reduces the cost of locating optimal position for the head nodes in a cluster. Additionally, we proposed the VSSFFA-based approach within the cluster rather than base station, which makes it a semi-distributed method. The selection criteria of the objective function are based on the residual energy, intra-cluster distance, node degree and head count of the probable cluster heads. Data communication is done using data transmission stage, which reduces the latency, delay, and control overhead. Compared to IH-MAC, EDS-MAC reduces the size of control packet by introducing short node address (1 byte instead of 8 bytes in IH-MAC). By enabling lower duty cycle operation and by performing efficient clustering, it reduces overhearing and reduces the overall latency experienced by the sensor network. Hence, introduction of EDS-MAC protocol in WSN can help the users with prolonged network life span and minimize the energy and overhead utilization of the overall network. The efficiency of the proposed MAC protocol has been analyzed using the NS-2 simulator. WSN employing EDS-MAC is compared with IH-MAC and is found to experience 50% reduction in overall energy consumption and 72% reduction in overall delay experienced by the network.","authors":["Vinu Sundararaj","Selvi Muthukrishnan","R.S. Kumar"],"meta":["April 2018Computers & Security 77","DOI:10.1016/j.cose.2018.04.009"],"references":["319257602_6LoWPAN_Route-Over_with_End-to-End_Fragmentation_and_Reassembly_Using_Cross-Layer_Adaptive_Backoff_Exponent"]}