{"id":"324505241_Community_Detection_in_Complex_Networks_via_Clique_Conductance","abstract":"Network science plays a central role in understanding and modeling complex systems in many areas including physics, sociology, biology, computer science, economics, politics, and neuroscience. One of the most important features of networks is community structure, i.e., clustering of nodes that are locally densely interconnected. Communities reveal the hierarchical organization of nodes, and detecting communities is of great importance in the study of complex systems. Most existing community-detection methods consider low-order connection patterns at the level of individual links. But high-order connection patterns, at the level of small subnetworks, are generally not considered. In this paper, we develop a novel community-detection method based on cliques, i.e., local complete subnetworks. The proposed method overcomes the deficiencies of previous similar community-detection methods by considering the mathematical properties of cliques. We apply the proposed method to computer-generated graphs and real-world network datasets. When applied to networks with known community structure, the proposed method detects the structure with high fidelity and sensitivity. When applied to networks with no a priori information regarding community structure, the proposed method yields insightful results revealing the organization of these complex networks. We also show that the proposed method is guaranteed to detect near-optimal clusters in the bipartition case.","authors":["Zhenqi Lu","Johan Wahlström","Arye Nehorai"],"meta":["April 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-23932-z"],"references":["316021678_The_b-model_for_Random_Graphs_-_Maximum_Likelihood_Cramer-Rao_Bounds_and_Hypothesis_Testing","349667207_A_Lower_Bound_for_the_Smallest_Eigenvalue_of_the_Laplacian","324285070_Introduction_to_Mathematical_Sociology","313203353_The_architecture_of_complexity","312600697_Algorithm_457_Finding_all_cliques_of_an_undirected_graph","311344563_Finding_community_structure_in_very_large_networks","309715704_Least_squares_quantization_in_PCM","305037467_Higher-order_organization_of_complex_networks","288271487_Enumerating_all_connected_maximal_common_subgraphs_in_two_graphs","283617410_Emergence_of_Scaling_in_Random_Networks"]}