{"id":"324518784_Artificial_Intelligence_from_the_Point_of_View_of_Law","abstract":"Artificial intelligence technologies are developing intensively today, including due to the development of technologies of stable neural networks and cloud computing infrastructures, fuzzy system technologies, entropy administration, swarm intelligence, evolutionary computations, and many others. etc. At the same time, the problem of almost complete absence of normative legal regulation and normative technical regulation of the foundations, conditions and features of development, functioning and activities, integration into other systems and control over the use of artificial intelligence technologies is global today. The Article is devoted to the study of the specifics of the legal regulation of the use and development of artificial intelligence. Some approaches to the definition of artificial intelligence and the features of legal regulation of this sphere, which take place in the scientific literature, are considered and the author's definition of artificial intelligence is developed and given through the disclosure of its main features. In particular, according to the proposed definition, artificial intelligence is an artificial complex cybernetic computer-software-hardware system possessing the properties of substantivity, autonomy, and also the ability to perceive and analyze data, to self-learn. The question of positioning the artificial intelligence system as a special form of person (for example, the so-called «electronic person»), that is, granting it a certain legal personality depending on various factors and the field of application of such a system, is considered in this article. The article also notes the main possible approaches to legal support for the use and development of artificial intelligence systems, in particular, such approaches include the preemptive universal-total legal regulation and legal regulation aimed at the regulation of specific artificial intelligence systems. The main risks and uncertainties associated with artificial intelligence (and which are of great importance for the adoption of legislation in this field) have been investigated. There are drawn the conclusions about how to develop legislation on the use and development of artificial intelligence: consistently, taking into account the specifics of areas of its application, as well as balancing the interests of individuals, society and the state with regard to proper security and protection of individual rights, and interests related to the development of innovation for the benefit of the whole society.","authors":["Igor V. Ponkin","Alena I Redkina"],"meta":["December 2018RUDN JOURNAL OF LAW 22(1):91-109","DOI:10.22363/2313-2337-2018-22-1-91-109"],"references":["317747137_The_machine_author_What_level_of_copyright_protection_is_appropriate_for_fully_independent_computergenerated_works","316799244_Liability_for_Crimes_Involving_Artificial_Intelligence_Systems","304604754_Regulating_Artificial_Intelligence_Systems_Risks_Challenges_Competencies_and_Strategies","293772363_With_technology_comes_responsibility","287524652_Introduction_to_artificial_intelligence_technology","275411835_Liability_for_damages_caused_by_artificial_intelligence","263265182_Attacking_Human_Implants_A_New_Generation_of_Cybercrime","238700860_rights_reserved_Of_Artificial_Intelligence_and_Legal_Reasoning_Cass","234821411_Special_section_Legal_ethical_and_policy_issues_associated_with_virtual_environments_and_computer_mediated_reality_-_Guest_editors'_introduction","228257044_Legal_Personhood_for_Artificial_Intelligences"]}