{"id":"324534429_Wicked_conflict_Using_wicked_problem_thinking_for_holistic_management_of_conservation_conflict","abstract":"Conservation conflict is widespread, damaging and has proved difficult to manage using conventional conservation approaches. Conflicts are often ‘wicked problems’, lacking clear solutions due to divergent values of stakeholders, and being embedded within wickedly complex environments. Drawing on the concept of wicked environmental problems could lead to management strategies better suited to tackling conflict. However, it is unclear whether managers are embracing ideas from the wicked problems concept. There is currently a lack of guidance for applying strategies to tackle particular wicked problems, such as conservation conflict. We explored the suitability of wicked problems‐inspired management, using eight contemporary conflict case‐studies. Conservation conflict was managed predominantly using conventional approaches suited to tackling single objectives in simple environments, rather than balancing competing objectives in complex environments. To deal with different characteristics of wickedness, we recommend that managers develop strategies combining distributed decision‐making, diverse opinions, pattern‐based predictions, trade‐off based objectives and reporting of failures. Recent advances in conservation conflict research have focused on improving interactions among stakeholders. We believe that such stakeholder‐focused approaches would dovetail with the whole‐system focus of a wicked problems framework, allowing conservationists to move towards a holistic strategy for managing conservation conflict.\nThis article is protected by copyright. All rights reserved","authors":["Tom H. E. Mason","Chris Pollard","Deepthi Chimalakonda","Angela Guerrero"],"meta":["October 2017Conservation Letters 11(6)","DOI:10.1111/conl.12460"],"references":["323647960_Time_series_analysis_reveals_synchrony_and_asynchrony_between_conflict_management_effort_and_increasing_large_grazing_bird_populations_in_northern_Europe","320184254_Using_structured_decision-making_to_set_restoration_objectives_when_multiple_values_and_preferences_exist","320150737_Quantifying_the_expected_value_of_uncertain_management_choices_for_over-abundant_Greylag_Geese","318328784_The_changing_environment_of_conservation_conflict_Geese_and_farming_in_Scotland","316286606_Ecosystem_management_as_a_wicked_problem","315963897_Building_partnerships_with_communities_for_biodiversity_conservation_Lessons_from_Asian_mountains","325466186_Decision-making_in_conservation_and_natural_resource_management_models_for_interdisciplinary_approaches","319171247_Collaborative_environmental_governance_Achieving_collective_action_in_social-ecological_systems","315983246_Optimizing_the_spatial_planning_of_prescribed_burns_to_achieve_multiple_objectives_in_a_fire-dependent_ecosystem","313834792_The_modelling_spiral_for_solving_wicked_environmental_problems_Guidance_for_stakeholder_involvement_and_collaborative_model_development"]}