{"id":"324563977_A_Trend_Analysis_of_Temperature_and_Rainfall_to_Predict_Climate_Change_for_Northwestern_Region_of_Bangladesh","abstract":"Bangladesh is one in all the foremost climate vulnerable countries of the world. In recent years, climate change studies over the country get plenty of attention by the researchers and policymakers. A substantial quantity of global climate change studies over the country use climate models to estimate future projections and uncertainties. Maximum temperature, precipitation and their potential future changes are evaluated in an ensemble of the 5th Phase Coupled Model Inter-comparison Project (CMIP5) within the Inter-governmental Panel on Climate Change (IPCC) diagnostic exercise for the Fifth Assessment Report (AR5) and the available historical data collected by the Bangladesh Meteorological Department (BMD) during the period 1981-2008 in the north-western region of Bangladesh and also the comparison between these two values. It has been found that average maximum temperature shows a positive trend of increase at a rate of 0.29˚C and 5.3˚C per century respectively, for BMD data and MPI-ESM-LR (CMIP5) model data. But the rainfall is decreasing at a rate of 8.8 mm and 40.1 mm per century respectively for BMD data and MPI-ESM-LR (CMIP5) model data. It is seen that July was the maximum monsoon rainfall month and January was the lowest rainfall month. The peak frequency is slightly smaller than 12 months, which indicates that the major events are occurring before ending a year compared to the previous year. According to MPI-ESM-LR (CMIP5) model data, the future normal temperature on the north-western region will be increased at a rate of 1.62˚C during the period 2040-2100.","authors":["M. D. I. Bhuyan","Md. Mohymenul Islam","Ebrahim Khalil Bhuiyan"],"meta":["January 2018American Journal of Climate Change 07(02):115-134","DOI:10.4236/ajcc.2018.72009"],"references":["316886181_A_COMPARATIVE_ANALYSIS_OF_CMIP3_AND_CMIP5_CLIMATE_PROJECTIONS_OVER_BANGLADESH","284376980_Variability_and_Trends_of_Summer_Monsoon_Rainfall_over_Bangladesh","283044089_Characteristics_of_Summer_Monsoon_Rainfall_over_South_Asia_Using_TRMM_Data","282121264_Characteristics_of_Diurnal_Variation_of_Summer_Monsoon_Rainfall_over_Bangladesh_and_its_Adjacent_Areas","268588865_Application_of_RCM-Based_Climate_Change_Indices_in_Assessing_Future_Climate_Part_I-Temperature_Extremes","324434480_Rank_Correlation_Methods","306204661_Robustness_and_uncertainties_in_the_new_CMIP5_climate_model_projections_Nat","303428453_Women_and_Climate_Change_in_Bangladesh","300313079_The_Implications_of_Climate_Change_for_Bangladesh_A_Synthesis","285374624_Trends_of_monsoon_rainfall_pattern_in_Bangladesh"]}