{"id":"324675312_The_development_of_children's_story_book_about_Acep_Zamzam_Noor_to_support_learning_bahasa_Indonesia_in_elementary_school","abstract":"The study is conducted based on students' low appreciation of literature and poetry, as well as the lack of children's resource books which should tell them about poets. Introducing poems to students means presenting the world of literature to children. By giving and introducing book to the children is one of the most effective ways to introduce the existence of poets. A children's book can be used as a media and the source of learning Bahasa Indonesian for elementary school students. This study aims to determine the design of a children's book about a poet Acep Zamzam Noor to support learning Bahasa Indonesia in elementary school, the process of development, and student's and teacher's responses to the design developed. Because this research is about the development of education, the appropriate method is Educational Design Research (EDR). The study involves the poet as a source, lecturers, practitioners / experts, students, elementary school teachers and elementary school students. This children's book contains material for learning Bahasa Indonesia which is developed for fourth grade of elementary school with a theme called 'my dream'. It uses method to find out the information from interview and story text about an adventure of a figure as the Basic Competence, as relevance to the curriculum 2013. The study produced a children's book about Acep Zamzam Noor with the principles of book design including procedure development, and a positive response from students and teachers to the children's story book that has been developed. In conclusion, the design of a children's story book about Acep Zamzam Noor is worth to support the textbook for learning Bahasa Indonesia for fourth grade of elementary school.","authors":["E.N. Andriani","A. Saepulrohman","Seni Apriliya"],"meta":["January 2016Man in India 96(12):4931-4945"],"references":[]}