{"id":"324619139_Reasons_For_Physicians_Not_Adopting_Clinical_Decision_Support_Systems_Critical_Analysis","abstract":"Background: \nClinical decision support systems (CDSSs) are an integral component of today's health information technologies. They assist with interpretation, diagnosis, and treatment. A CDSS can be embedded throughout the patient safety continuum providing reminders, recommendations, and alerts to health care providers. Although CDSSs have been shown to reduce medical errors and improve patient outcomes, they have fallen short of their full potential. User acceptance has been identified as one of the potential reasons for this shortfall.\n\nObjective: \nThe purpose of this paper was to conduct a critical review and task analysis of CDSS research and to develop a new framework for CDSS design in order to achieve user acceptance.\n\nMethods: \nA critical review of CDSS papers was conducted with a focus on user acceptance. To gain a greater understanding of the problems associated with CDSS acceptance, we conducted a task analysis to identify and describe the goals, user input, system output, knowledge requirements, and constraints from two different perspectives: the machine (ie, the CDSS engine) and the user (ie, the physician).\n\nResults: \nFavorability of CDSSs was based on user acceptance of clinical guidelines, reminders, alerts, and diagnostic suggestions. We propose two models: (1) the user acceptance and system adaptation design model, which includes optimizing CDSS design based on user needs/expectations, and (2) the input-process-output-engagemodel, which reveals to users the processes that govern CDSS outputs.\n\nConclusions: \nThis research demonstrates that the incorporation of the proposed models will improve user acceptance to support the beneficial effects of CDSSs adoption. Ultimately, if a user does not accept technology, this not only poses a threat to the use of the technology but can also pose a threat to the health and well-being of patients.","authors":["Saif Khairat","David Marc","William Crosby","Ali Al Sanousi"],"meta":["April 2018JMIR Medical Informatics 6(2):e24","DOI:10.2196/medinform.8912"],"references":["295688271_Precision_diagnosis_a_view_of_the_clinical_decision_support_systems_CDSS_landscape_through_the_lens_of_critical_care","274396810_Clinical_decision_support_systems_for_improving_diagnostic_accuracy_and_achieving_precision_medicine","346195086_THE_1999-2000_TASK_ANALYSIS_OF_AMERICAN_NURSE-MIDWIFERYMIDWIFERY_PRACTICE","321599826_Clinical_Decision_Support_Systems_Theory_and_Practice","313197077_User_acceptance_of_computer_technology_system_characteristics_user_perceptions","312368182_Use_acceptance_of_information_technology_Toward_a_unified_view","281679163_Use_of_Simulation_to_Study_Nurses_Acceptance_and_Non-Acceptance_of_Clinical_Decision_Support_Suggestions","281508694_Improving_clinical_practice_using_clinical_support_systems_A_systematic_review_of_trials_to_identify_features_critical_to_success","280702372_Clinical_decision_support_systems","270386238_Being_There_Putting_Brain_Body_and_World_Together_Again"]}