{"id":"324651570_Games_Ready_to_Use_A_Serious_Game_for_Teaching_Natural_Risk_Management","abstract":"Background.Risk management, and in particular the management of natural hazards and territorial risks has become an essential skill for civil engineers. Teaching risk management to engineering students is therefore crucial, but is also challenging: it looks too abstract to students, and practical works are complex and expensive to organise. It also involves interconnected mechanisms coupling human and technical aspects, that are difficult to explain.\nAim. The challenge is then to propose a serious game able to support the teaching of territorial risk management to engineering students. As part of their curriculum, these students are expected to learn various concepts and notions: territorial risk, vulnerability of a territory, resilience, risk perception, multi-criteria analysis and balanced management.\nMethod. In order to support risk management teaching, we propose SPRITE, an agent-based serious game using a concrete case study which is exemplary in terms of risk management: the coastal floods on the Oleron Island (France). SPRITE places the player (the student) in the role of a local councillor of the Oleron Island, who must ensure the safety and well-being of the island residents, while maximising performance with respect to economic and environmental issues, in a context of coastal flood risk.\nResults. The model is fully implemented in GAMA, an open-source multi-agent geographical simulation platform, and the game is already playable. It was used at the University of Bordeaux in a course on risk management dedicated to students in the Master of Geology and Civil Engineering. The evaluation of engagement and motivation with the game and learning from playing is very positive.\nConclusions. The results from the game evaluation are encouraging. Short term future work will mainly be dedicated to pursuing this evaluation, and comparing results between students using SPRITE vs students following a more traditional course. Longer term prospects include several improvements of the model and the interface and implemented multiplayer features.","authors":["Franck Taillandier","Carole A Adam"],"meta":["April 2018Simulation & Gaming 49(4):104687811877021","DOI:10.1177/1046878118770217","Project: Floods - SPRITE & MAGIL"],"references":["320024279_Learning_Risk_Management_in_Software_Projects_with_a_Serious_Game_Based_on_Intelligent_Agents_and_Fuzzy_Systems","311631378_How_People_Learn_while_playing_Serious_Games_A_Computational_Modelling_Approach","309760312_SPRITE_-_Participatory_Simulation_for_Raising_Awareness_About_Coastal_Flood_Risk_on_the_Oleron_Island","308663509_Decision_aiding_for_lower_soil_risk_in_urban_planning_operation","305041383_A_Proof-of-Concept_Study_of_Game-Based_Learning_in_Higher_Education","321621071_Funology_From_Usability_to_Enjoyment","319914179_Participatory_simulation_to_foster_social_learning_on_coastal_flooding_prevention","310734314_Serious_Games_on_Environmental_Management","308599448_On_the_seismic_response_of_buildings_in_aggregate_Analysis_of_a_typical_masonry_building_from_Azores","299903335_Serious_Game_on_Flood_Risk_Management"]}