{"id":"324663293_Exploring_Energy_Landscapes","abstract":"Recent advances in the potential energy landscapes approach are highlighted, including both theoretical and computational contributions. Treating the high dimensionality of molecular and condensed matter systems of contemporary interest is important for understanding how emergent properties are encoded in the landscape and for calculating these properties while faithfully representing barriers between different morphologies. The pathways characterized in full dimensionality, which are used to construct kinetic transition networks, may prove useful in guiding such calculations. The energy landscape perspective has also produced new procedures for structure prediction and analysis of thermodynamic properties. Basin-hopping global optimization, with alternative acceptance criteria and generalizations to multiple metric spaces, has been used to treat systems ranging from biomolecules to nanoalloy clusters and condensed matter. This review also illustrates how all this methodology, developed in the context of chemical physics, can be transferred to landscapes defined by cost functions associated with machine learning.","authors":["David J. Wales"],"meta":["April 2018Annual Review of Physical Chemistry 69(1):401-425","DOI:10.1146/annurev-physchem-050317-021219"],"references":["318898628_Exploring_biomolecular_energy_landscapes","317376097_Energy_landscapes_for_machine_learning","313679860_Machine_learning_prediction_for_classification_of_outcomes_in_local_minimisation","313567843_GPU-Accelerated_Exploration_of_Biomolecular_Energy_Landscapes","313482964_Transforming_the_Energy_Landscape_of_a_Coiled-Coil_Peptide_via_Point_Mutations","316623680_Exploring_biomolecular_energy_landscapes","315570714_Energy_Landscapes_for_Machine_Learning","315539892_Decoding_heat_capacity_features_from_the_energy_landscape","315535845_Defining_and_quantifying_frustration_in_the_energy_landscape_Applications_to_atomic_and_molecular_clusters_biomolecules_jammed_and_glassy_systems","309751262_GPU-Accelerated_Exploration_of_Biomolecular_Energy_Landscapes"]}