{"id":"324649052_Filling_in_the_Missing_Link_between_Simulation_and_Application_in_Opportunistic_Networking","abstract":"In the domain of opportunistic networking, just like in any other domain of computer science, the engineering process should span all stages between an original idea and the validation of its implementation in real conditions. Yet most researchers often stop halfway along this process: they rely on simulation to validate the protocols and distributed applications they design, and neglect to go further. Their algorithms are thus only rarely implemented for real, and when they are, the validation of the resulting code is usually performed at a very small scale. Therefore, the results obtained are hardly repeatable or comparable to others.\nLEPTON is an emulation platform that can help bridge the gap between pure simulation and fully operational implementation, thus allowing developers to observe how the software they develop (instead of pseudo-code that simulates its behavior) performs in controlled, repeatable conditions.\nIn this paper we present LEPTON, an emulation platform we developed, and we show how existing opportunistic networking systems can be adapted to run with this platform. Taking two existing middleware systems as use cases, we also demonstrate that running demanding scenarios with LEPTON constitute an excellent stress test and a powerful tool to improve the opportunistic systems under test.","authors":["Adrián Sánchez-Carmona","Frédéric Guidec","Pascale Launay","Yves Mahéo"],"meta":["April 2018Journal of Systems and Software 142(5)","DOI:10.1016/j.jss.2018.04.025"],"references":["331982905_Time-Varying_Graphs_and_Dynamic_Networks","311444133_EmuStack_An_OpenStack-Based_DTN_Network_Emulation_Platform_Extended_Version","316040999_Throwboxes_in_Delay_Tolerant_Networks_A_Survey_of_Placement_Strategies_Buffering_Capacity_and_Mobility_Models","315629716_Social-based_energy-aware_multicasting_in_delay_tolerant_networks","312469804_An_overview_of_the_OMNET_simulation_environment","312103454_Towards_Repeatability_Verifiability_in_Networking_Experiments_A_Stochastic_Framework","308841630_HINT_from_network_characterization_to_opportunistic_applications","308038946_EmuStack_An_OpenStack-Based_DTN_Network_Emulation_Platform","307846783_A_Protocol_for_Content-Based_Communication_in_Disconnected_Mobile_Ad_Hoc_Networks","303775661_A_Middleware_for_Opportunistic_Content_Distribution"]}