{"id":"324651720_Pointwise_Partial_Information_Decomposition_Using_the_Specificity_and_Ambiguity_Lattices","abstract":"What are the distinct ways in which a set of predictor variables can provide information about a target variable? When does a variable provide unique information, when do variables share redundant information, and when do variables combine synergistically to provide complementary information? The redundancy lattice from the partial information decomposition of Williams and Beer provided a promising glimpse at the answer to these questions. However, this structure was constructed using a much criticised measure of redundant information, and despite sustained research, no completely satisfactory replacement measure has been proposed. In this paper, we take a different approach, applying the axiomatic derivation of the redundancy lattice to a single realisation from a set of discrete variables. To overcome the difficulty associated with signed pointwise mutual information, we apply this decomposition separately to the unsigned entropic components of pointwise mutual information which we refer to as the specificity and ambiguity. This yields a separate redundancy lattice for each component. Then based upon an operational interpretation of redundancy, we define measures of redundant specificity and ambiguity enabling us to evaluate the partial information atoms in each lattice. These atoms can be recombined to yield the sought-aftermultivariate information decomposition. We apply this framework to canonical examples from the literature and discuss the results and the various properties of the decomposition. In particular, the pointwise decomposition using specificity and ambiguity satisfies a chain rule over target variables, which provides new insights into the so-called two-bit-copy example.","authors":["Conor Finn","Joseph T Lizier"],"meta":["April 2018Entropy 20(4):297","DOI:10.3390/e20040297"],"references":["320643164_Partial_and_Entropic_Information_Decompositions_of_a_Neuronal_Modulatory_Interaction","320292538_Bivariate_Partial_Information_Decomposition_The_Optimization_Perspective","319855615_Quantifying_Information_Modification_in_Developing_Neural_Networks_via_Partial_Information_Decomposition","319586303_The_Partial_Information_Decomposition_of_Generative_Neural_Network_Models","319403416_Morphological_Computation_Synergy_of_Body_and_Brain","317955049_Invariant_Components_of_Synergy_Redundancy_and_Unique_Information_among_Three_Variables","317833253_Multiscale_Information_Decomposition_Exact_Computation_for_Multivariate_Gaussian_Processes","317740318_Secret_Sharing_and_Shared_Information","317816056_Quantifying_Synergistic_Mutual_Information","316269418_What_Is_Enumerative_Combinatorics"]}