{"id":"324687346_Deep_Learning_in_Spiking_Neural_Networks","abstract":"In recent years, deep learning has been a revolution in the field of machine learning, for computer vision in particular. In this approach, a deep (multilayer) artificial neural network (ANN) is trained in a supervised manner using backpropagation. Huge amounts of labeled examples are required, but the resulting classification accuracy is truly impressive, sometimes outperforming humans. Neurons in an ANN are characterized by a single, static, continuous-valued activation. Yet biological neurons use discrete spikes to compute and transmit information, and the spike times, in addition to the spike rates, matter. Spiking neural networks (SNNs) are thus more biologically realistic than ANNs, and arguably the only viable option if one wants to understand how the brain computes. SNNs are also more hardware friendly and energy-efficient than ANNs, and are thus appealing for technology, especially for portable devices. However, training deep SNNs remains a challenge. Spiking neurons' transfer function is usually non-differentiable, which prevents using backpropagation. Here we review recent supervised and unsupervised methods to train deep SNNs, and compare them in terms of accuracy, but also computational cost and hardware friendliness. The emerging picture is that SNNs still lag behind ANNs in terms of accuracy, but the gap is decreasing, and can even vanish on some tasks, while the SNNs typically require much fewer operations.","authors":["Amirhossein Tavanaei","Masoud Ghodrati","Saeed Reza Kheradpisheh","Timothée Masquelier"],"meta":["April 2018Neural networks: the official journal of the International Neural Network Society","DOI:10.1016/j.neunet.2018.12.002","Projects: Spike-time-based Spiking Deep Neural NetworksDeep Spiking Neural Network and Sparse Learning"],"references":["327727472_Optimal_Localist_and_Distributed_Coding_of_Spatiotemporal_Spike_Patterns_Through_STDP_and_Coincidence_Detection","325718113_A_Retinotopic_Spiking_Neural_Network_System_for_Accurate_Recognition_of_Moving_Objects_Using_NeuCube_and_Dynamic_Vision_Sensors","325696398_Modelling_Peri-Perceptual_Brain_Processes_in_a_Deep_Learning_Spiking_Neural_Network_Architecture","321654016_Conversion_of_Continuous-Valued_Deep_Networks_to_Efficient_Event-Driven_Networks_for_Image_Classification","321015928_BP-STDP_Approximating_Backpropagation_using_Spike_Timing_Dependent_Plasticity","328399883_Training_Spiking_ConvNets_by_STDP_and_Gradient_Descent","327916206_Introduction_to_the_Theory_of_Neural_Computation","325025933_First-Spike-Based_Visual_Categorization_Using_Reward-Modulated_STDP","323376354_Phased_LSTM_Accelerating_Recurrent_Network_Training_for_Long_or_Event-based_Sequences","321813680_MT-spike_A_multilayer_time-based_spiking_neuromorphic_architecture_with_temporal_error_backpropagation"]}