{"id":"324694064_Evolutionary_Design_of_Convolutional_Neural_Networks_for_Human_Activity_Recognition_in_Sensor-Rich_Environments","abstract":"Human activity recognition is a challenging problem for context-aware systems and applications. It is gaining interest due to the ubiquity of different sensor sources, wearable smart objects, ambient sensors, etc. This task is usually approached as a supervised machine learning problem, where a label is to be predicted given some input data, such as the signals retrieved from different sensors. For tackling the human activity recognition problem in sensor network environments, in this paper we propose the use of deep learning (convolutional neural networks) to perform activity recognition using the publicly available OPPORTUNITY dataset. Instead of manually choosing a suitable topology, we will let an evolutionary algorithm design the optimal topology in order to maximize the classification F1 score. After that, we will also explore the performance of committees of the models resulting from the evolutionary process. Results analysis indicates that the proposed model was able to perform activity recognition within a heterogeneous sensor network environment, achieving very high accuracies when tested with new sensor data. Based on all conducted experiments, the proposed neuroevolutionary system has proved to be able to systematically find a classification model which is capable of outperforming previous results reported in the state-of-the-art, showing that this approach is useful and improves upon previously manually-designed architectures.","authors":["Alejandro Baldominos","Yago Sáez","Pedro Isasi"],"meta":["April 2018Sensors 18(4)","DOI:10.3390/s18041288","Project: Automatic design of deep neural networks"],"references":["318511165_Smart_City_A_GECAD-BISITE_Energy_Management_Case_Study","301463804_Optimizing_deep_learning_hyper-parameters_through_an_evolutionary_algorithm","322566084_A_generalized_framework_for_wireless_localization_in_gerontechnology","322079459_Evolutionary_Convolutional_Neural_Networks_an_Application_to_Handwriting_Recognition","319770314_Deep_Convolutional_Neural_Networks_On_Multichannel_Time_Series_For_Human_Activity_Recognition","318375026_Large_scale_evolution_of_convolutional_neural_networks_using_volunteer_computing","318133289_A_Serious_Game_to_Reduce_Consumption_in_Smart_Buildings","318071861_A_genetic_programming_approach_to_designing_convolutional_neural_network_architectures","313620036_A_new_evolutionary_system_for_evolving_artificial_neural_networks","301227546_Convolution_by_Evolution_Differentiable_Pattern_Producing_Networks"]}