{"id":"324655664_Comparison_of_normalization_methods_for_the_analysis_of_metagenomic_gene_abundance_data","abstract":"Background: \nIn shotgun metagenomics, microbial communities are studied through direct sequencing of DNA without any prior cultivation. By comparing gene abundances estimated from the generated sequencing reads, functional differences between the communities can be identified. However, gene abundance data is affected by high levels of systematic variability, which can greatly reduce the statistical power and introduce false positives. Normalization, which is the process where systematic variability is identified and removed, is therefore a vital part of the data analysis. A wide range of normalization methods for high-dimensional count data has been proposed but their performance on the analysis of shotgun metagenomic data has not been evaluated.\n\nResults: \nHere, we present a systematic evaluation of nine normalization methods for gene abundance data. The methods were evaluated through resampling of three comprehensive datasets, creating a realistic setting that preserved the unique characteristics of metagenomic data. Performance was measured in terms of the methods ability to identify differentially abundant genes (DAGs), correctly calculate unbiased p-values and control the false discovery rate (FDR). Our results showed that the choice of normalization method has a large impact on the end results. When the DAGs were asymmetrically present between the experimental conditions, many normalization methods had a reduced true positive rate (TPR) and a high false positive rate (FPR). The methods trimmed mean of M-values (TMM) and relative log expression (RLE) had the overall highest performance and are therefore recommended for the analysis of gene abundance data. For larger sample sizes, CSS also showed satisfactory performance.\n\nConclusions: \nThis study emphasizes the importance of selecting a suitable normalization methods in the analysis of data from shotgun metagenomics. Our results also demonstrate that improper methods may result in unacceptably high levels of false positives, which in turn may lead to incorrect or obfuscated biological interpretation.","authors":["Mariana Buongermino Pereira","Mikael Wallroth","Viktor Jonsson","Erik Kristiansson"],"meta":["April 2018BMC Genomics 19(1)","DOI:10.1186/s12864-018-4637-6"],"references":["316346229_HirBin_High-resolution_identification_of_differentially_abundant_functions_in_metagenomes","316054592_Intestinal_microbiome_in_children_with_severe_and_complicated_acute_viral_gastroenteritis","315967320_Comparative_metagenomics_reveals_insights_into_the_deep-sea_adaptation_mechanism_of_the_microorganisms_in_Iheya_hydrothermal_fields","314194282_Normalization_and_microbial_differential_abundance_strategies_depend_upon_data_characteristics","313896526_Variable_Colonization_after_Reciprocal_Fecal_Microbiota_Transfer_between_Mice_with_Low_and_High_Richness_Microbiota","322181597_Strategies_for_Taxonomic_and_Functional_Annotation_of_Metagenomes","322181197_Computational_and_Statistical_Considerations_in_the_Analysis_of_Metagenomic_Data","320189116_A_broken_promise_microbiome_differential_abundance_methods_do_not_control_the_false_discovery_rate","311095954_Variability_in_Metagenomic_Count_Data_and_Its_Influence_on_the_Identification_of_Differentially_Abundant_Genes","308895295_NORMALIZATION_AND_DIFFERENTIAL_ABUNDANCE_ANALYSIS_OF_METAGENOMIC_BIOMARKER-GENE_SURVEYS","291952536_Statistical_evaluation_of_methods_for_identification_of_differentially_abundant_genes_in_comparative_metagenomics","284176030_EGGNOG_45_A_hierarchical_orthology_framework_with_improved_functional_annotations_for_eukaryotic_prokaryotic_and_viral_sequences","281581402_Tentacle_distributed_quantification_of_genes_in_metagenomes","281238409_Moderated_Estimation_of_Fold_Change_and_Dispersion_for_RNA-Seq_Data_with_DESeq2","280910079_QPROT_Statistical_method_for_testing_differential_expression_using_protein-level_intensity_data_in_label-free_quantitative_proteomics"]}