{"id":"324642345_Systematic_review_as_a_research_method_in_postgraduate_nursing_education","abstract":"In South Africa, there appears to be poor understanding about using a systematic review as an acceptable research method in post-graduate nursing education. The lack of understanding may result in research supervisors being unable to guide post-graduate students, such as masters and doctoral students, in using the systematic review methodology in the completion of an academic qualification. Furthermore, they might not be able to assist post-graduate students in completing their studies, or conducting studies, in particular systematic reviews, which are of high quality. Valuable opportunities can thus be missed that might add to the body of knowledge to inform and improve research, education, and clinical practice. This article may set the field for an informed debate on systematic reviews as a useful and acceptable research method to be used by post-graduate nursing students in South Africa. We conclude that a systematic review could be a useful and acceptable method for research in post-graduate nursing education. However, the method's benefits and disadvantages should be considered before a post-graduate student embarks on such a journey.","authors":["Wilma ten Ham-Baloyi","Portia Janine Jordan"],"meta":["October 2016Health SA Gesondheid 21:120-128","DOI:10.4102/hsag.v21i0.942"],"references":["321248903_Five_Steps_to_Conducting_a_Systematic_Review","268809132_The_Benefits_and_Challenges_of_Using_Systematic_Reviews_in_International_Development_Research","267956514_Cochrane_systematic_review_as_a_PhD_thesis_An_alternative_with_numerous_advantages","246115972_Evidence-Based_Medicine_How_to_Practice_and_Teach_EBM_Evidence-Based_Medicine","317953648_Naturalistic_inquiry","302999996_How_To_Do_a_Sytematic_Literature_Review_in_Nursing_A_Step-By-Step_Guide","280645955_Systematic_Reviews_in_the_Social_Sciences_A_Practical_Guide","275418436_Basic_Concepts_in_the_Methodology_of_the_Social_Sciences","259987816_Including_systematic_reviews_in_PhD_programmes_and_candidatures_in_nursing_-_'Hobson's_choice'","250757422_Nursing_Research_An_Introduction"]}