{"id":"324600286_A_Mean_Field_View_of_the_Landscape_of_Two-Layers_Neural_Networks","abstract":"Multi-layer neural networks are among the most powerful models in machine learning, yet the fundamental reasons for this success defy mathematical understanding. Learning a neural network requires to optimize a non-convex high-dimensional objective (risk function), a problem which is usually attacked using stochastic gradient descent (SGD). Does SGD converge to a global optimum of the risk or only to a local optimum? In the first case, does this happen because local minima are absent, or because SGD somehow avoids them? In the second, why do local minima reached by SGD have good generalization properties? In this paper we consider a simple case, namely two-layers neural networks, and prove that -in a suitable scaling limit- SGD dynamics is captured by a certain non-linear partial differential equation (PDE) that we call distributional dynamics (DD). We then consider several specific examples, and show how DD can be used to prove convergence of SGD to networks with nearlyideal generalization error. This description allows to 'average-out' some of the complexities of the landscape of neural networks, and can be used to prove a general convergence result for noisy SGD.","authors":["Song HONG Mei","Andrea Montanari","Phan-Minh Nguyen"],"meta":["April 2018Proceedings of the National Academy of Sciences 115(33)","DOI:10.1073/pnas.1806579115"],"references":["321768393_Scaling_Limit_Exact_and_Tractable_Analysis_of_Online_Learning_Algorithms_with_Applications_to_Regularized_Regression_and_PCA","314093619_Globally_Optimal_Gradient_Descent_for_a_ConvNet_with_Gaussian_Inputs","282906751_ell_1-regularized_Neural_Networks_are_Improperly_Learnable_in_Polynomial_Time","332183957_Provable_Methods_for_Training_Neural_Networks_with_Sparse_Connectivity","320820893_Learning_One-hidden-layer_Neural_Networks_with_Landscape_Design","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770166_Provable_Bounds_for_Learning_Some_Deep_Representations","318489182_Theoretical_Insights_Into_the_Optimization_Landscape_of_Over-Parameterized_Shallow_Neural_Networks","269339448_Provable_Methods_for_Training_Neural_Networks_with_Sparse_Connectivity","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks"]}