{"id":"324681957_Ambient_Assisted_Living_system's_models_and_architectures_A_survey_of_the_state_of_the_art","abstract":"The field of Ambient Assisted living (AAL) is evolving rapidly. Standardization, uniformities and facilitation in the system design, have become an urge to satisfy the growing needs for integrated solutions. In this context, Reference Models (RM) and Reference Architectures (RA) impose as suitable solutions for organizing the relationship between the different elements of a software. Furthermore, they achieve a well-recognized understanding of the AAL domain by raising the congruency between the context, the goals and the design. In this paper, we investigate the AAL system requirements and implementation challenges. Moreover, we examined RM and RA definitions, demands and specifications with the perspective of, describing and evaluating AAL related ones, using quality attributes in a number of dimensions. Our main determination is giving an overview of the current state of the art of AAL oriented layouts, which we found generally research oriented ones, and most of them have been established with one specific concern. Our perspective is to improve and consolidate the future designs of the AAL models and architectures to implement the applications over a survival infrastructure.","authors":["Amina El Murabet","Anouar Abtoy","Abdellah Touhafi","Abderahim Tahiri"],"meta":["April 2018Journal of King Saud University - Computer and Information Sciences 32(1)","DOI:10.1016/j.jksuci.2018.04.009"],"references":["336796013_Assessment_of_Reference_Architectures_and_Reference_Models_for_Ambient_Assisted_Living_Systems_Results_of_a_Systematic_Literature_Review","318890332_Towards_an_SOA_Architectural_Model_for_AAL-Paas_Design_and_Implimentation_Challenges","309232789_Direct_and_indirect_healthcare_costs_of_rheumatoid_arthritis_patients_in_Turkey","308948006_A_survey_of_Ambient_Assisted_Living_systems_Challenges_and_opportunities","276867067_Ambient_Assisted_Living_Technologies_for_Aging_Well_A_Scoping_Review","272399955_The_UniversAAL_Platform_for_AAL_Ambient_Assisted_Living","261356672_RAModel_A_Reference_Model_for_Reference_Architectures","260487270_A_Survey_on_Ambient-Assisted_Living_Tools_for_Older_Adults","306004839_The_aging_population_demographics_and_the_biology_of_aging","270285617_Health_and_quality_of_life_in_an_aging_population_-_Food_and_beyond"]}