{"id":"324675187_Metasurface-Based_Polarimeters","abstract":"The state of polarization (SOP) is an inherent property of light that can be used to gain crucial information about the composition and structure of materials interrogated with light. However, the SOP is difficult to experimentally determine since it involves phase information between orthogonal polarization states, and is uncorrelated with the light intensity and frequency, which can be easily determined with photodetectors and spectrometers. Rapid progress on optical gradient metasurfaces has resulted in the development of conceptually new approaches to the SOP characterization. In this paper, we review the fundamentals of and recent developments within metasurface-based polarimeters. Starting by introducing the concepts of generalized Snell's law and Stokes parameters, we explain the Pancharatnam-Berry phase (PB-phase) which is instrumental for differentiating between orthogonal circular polarizations. Then we review the recent progress in metasurface-based polarimeters, including polarimeters, spectropolarimeters, orbital angular momentum (OAM) spectropolarimeters, and photodetector integrated polarimeters. The review is ended with a short conclusion and perspective for future developments.","authors":["Fei Ding","Yiting Chen","S.I. Bozhevolnyi"],"meta":["April 2018Applied Sciences 8(4)","DOI:10.3390/app8040594"],"references":["325077401_Bifunctional_gap-plasmon_metasurfaces_for_visible_light_polarization-controlled_unidirectional_surface_plasmon_excitation_and_beam_steering_at_normal_incidence","322507213_Wavefront_shaping_with_disorder-engineered_metasurfaces","320014429_On-Chip_Spectropolarimetry_by_Fingerprinting_with_Random_Surface_Arrays_of_Nanoparticles","319213883_Gradient_metasurfaces_A_review_of_fundamentals_and_applications","319065147_Multifunctional_interleaved_geometric-phase_dielectric_metasurfaces","318910494_Broadband_achromatic_optical_metasurface_devices","321811132_Visible_Metasurfaces_for_On-Chip_Polarimetry","321809183_Disorder-induced_optical_transition_from_spin_Hall_to_random_Rashba_effect","320844863_Performance_characteristics_of_4-port_in-plane_and_out-of-plane_in-line_metasurface_polarimeters","319485375_Free-Space_Optical_Beam_Tapping_with_an_All-Silica_Metasurface"]}