{"id":"324655775_Analysis_of_the_self-archiving_policies_of_journals_in_the_highest_rank_category_of_the_Finnish_journal_classification_system_within_computer_science_physics_and_electronic_engineering","abstract":"Vaikka avointen lehtien määrä on nousussa, vaikuttaa maksumuureihin perustuva toimintamalli olevan edelleen tieteellisen julkaisemisen modus operandi. Täten suurin osa julkaisuista voidaan avata (open access) joko maksamalla kustantajille yksittäisten artikkelien avoimuudesta tai rinnakkaistallentamalla työ avoimeen julkaisuarkistoon kustantajan ehtojen mukaisesti.\n\nKeskeistä on, miten kustantajat suhtautuvat avoimuuteen ja mitä ne tässä suhteessa sallivat. Miten on huippulehtien laita? Sallivatko Julkaisufoorumi-luokituksen arvostetuimmat lehdet maksuttoman avoimen rinnakkaistallentamisen ja millä ehdoilla? Tämä katsaus tarkastelee Julkaisufoorumissa korkeasti arvostettujen tietotekniikan, fysiikan ja sähkö-, automaatio- ja tietoliikennetekniikan lehtien rinnakkaistallennusehtoja. Rinnakkaistallennusehtoja tarkastellaan suhteessa Euroopan Tutkimusneuvoston avoimen julkaisemisen vaatimuksiin. Tarkastelun fokus on hyväksyttävissä versiotyypeissä ja embargojaksojen pituuksissa. Julkaisuarkistojen osalta rinnakkaistallennusehtoja tarkastellaan suhteessa yliopisto- ja tieteenalakohtaisia julkaisuarkistoja koskeviin ehtoihin. Analyysin tuloksena on, että noin 75% tarkastelluista lehdistä sallii rinnakkaistallennuksen joko yliopisto- tai tieteenalakohtaisiin julkaisuarkistoihin siten, että Euroopan Tutkimusneuvoston vaatimukset versiotyypeistä ja embargojaksojen pituuksista täyttyvät. Katsauksen aineisto on avoimesti saatavilla.","authors":["Antti Rousi"],"meta":["April 2018Informaatiotutkimus 37(1)","DOI:10.23978/inf.70168"],"references":["306259467_Essay_on_institutional_repositories_and_open_access","305504522_Journal_copyright_restrictions_and_actual_open_access_availability_a_study_of_articles_published_in_eight_top_information_systems_journals_2010-2014","305314643_What_does_'green_open_access_mean_Tracking_twelve_years_of_changes_to_journal_publisher_self-archiving_policies","259255687_Green_open_access_policies_of_scholarly_journal_publishers_A_study_of_what_when_and_where_self-archiving_is_allowed","229159279_Open_Access_versus_Subscription_Journals_A_Comparison_of_Scientific_Impact","257663194_On_the_impact_of_Gold_Open_Access_Journals"]}