{"id":"324745118_Fundamentals_of_spreading_processes_in_single_and_multilayer_complex_networks","abstract":"Spreading processes have been largely studied in the literature, both analytically and by means of large-scale numerical simulations. These processes mainly include the propagation of diseases, rumors and information on top of a given population. In the last two decades, with the advent of modern network science, we have witnessed significant advances in this field of research. Here we review the main theoretical and numerical methods developed for the study of spreading processes on complex networked systems. Specifically, we formally define epidemic processes on single and multilayer networks and discuss in details the main methods used to perform numerical simulations. Throughout the review, we classify spreading processes (disease and rumor models) into two classes according to the nature of time: (i) continuous-time and (ii) cellular automata approach, where the second one can be further divided into synchronous and asynchronous updating schemes. Our revision includes the heterogeneous mean-field, the quenched-mean field, and the pair quenched mean-field approaches, as well as their respective simulation techniques, emphasizing similarities and differences among the different techniques. The content presented here offers a whole suite of methods to study epidemic-like processes in complex networks, both for researchers without previous experience in the subject and for experts.","authors":["Guilherme Ferraz de Arruda","Francisco A Rodrigues","Yamir Moreno"],"meta":["April 2018Physics Reports 756","DOI:10.1016/j.physrep.2018.06.007","Project: Spreading processes in single and multilayer complex networks"],"references":["315795156_Optimized_Gillespie_algorithms_for_the_simulation_of_Markovian_epidemic_processes_on_large_and_heterogeneous_networks","307604344_A_General_Markov_Chain_Approach_for_Disease_and_Rumor_Spreading_in_Complex_Networks","314700939_Multilayer_Networks_Metrics_and_Spectral_Properties","313136089_Routing_of_multipoint_connections","312608439_Assortative_mixing_in_networks_J","311899572_Epidemic_processes_in_complex_networks","311612620_Unification_of_theoretical_approaches_for_epidemic_spreading_on_complex_networks","303749942_Sampling_methods_for_the_quasistationary_regime_of_epidemic_processes_on_regular_and_complex_networks","303557925_Approximate_formula_and_bounds_for_the_time-varying_susceptible-infected-susceptible_prevalence_in_networks","303448700_Leveraging_percolation_theory_to_single_out_influential_spreaders_in_networks"]}