{"id":"324766812_Literature_Now_Contains_Graphic_Language_Adaptation_Visualization_and_Transmedia_Texts","abstract":"Literary influence is now visible in the form of a graphic visualization, whether as a graphic novel or, as this essay demonstrates in computer-generated visual data around texts and textual relations. All of these are adaptations of the literary text. I first argue that the ‘graphing’ of the source/original – if we retain old-world categories such as ‘original’ – text into visual language renders literary texts into our most recognizable interface: the screen with its icons. This ‘iconization in graphic adaptation is a mirroring and a ghostification. In the second part of the essay I argue that textual criticism is an instance of adaptation because the critical texts are produced from and about literary texts. Today, this process utilizes the graphic language and representational modes of the digital medium and is therefore transmedial. Maps of literary influence, built through software, graphic visualizations of literary texts. In the third section, the essay argues that the work of criticism in the digital age gestures at the contexts and processes outside the task and textual frame, and to signs and symbols within it. In transmedia metareferencing is a form of adaptation because it takes material from various media to compose the cultural history of the text in the form of whatever is laid out on the screen. In the final section, the essay proposes a poetics of transmedia adaptation and graphic visualization.","authors":["Pramod K. Nayar"],"meta":["February 2018Rupkatha Journal on Interdisciplinary Studies in Humanities 10(1)","DOI:10.21659/rupkatha.v10n1.02"],"references":["347395425_A_New_Republic_of_Letters_Memory_and_Scholarship_in_the_Age_of_Digital_Reproduction","334807214_Metareference_across_Media_The_Concept_its_Transmedial_Potentials_and_Problems_Main_Forms_and_Functions","322633355_Visualizing_Mouvance_Toward_a_visual_analysis_of_variant_medieval_text_traditions","318505278_Introduction_Data_Visualisation_and_the_Humanities","318072663_Data_Collaboration_Laboratory_Bringing_Concepts_from_Science_into_Humanities_Practice","311296373_Transmedia_Storytelling_and_the_New_Era_of_Media_Convergence_in_Higher_Education","307041206_Graphical_Approaches_to_the_Digital_Humanities","307039464_Text_Analysis_and_Visualization_Making_Meaning_Count","272807118_The_Wolf_Man's_Magic_Word_A_Cryptonymy","260100605_Expanding_Genette's_EpitextPeritext_Model_for_Transitional_Electronic_Literature_Centrifugal_and_Centripetal_Vectors_on_Kindles_and_iPads"]}