{"id":"324794402_Status_and_rebuilding_of_European_fisheries","abstract":"Since January 2014, the reformed Common Fisheries Policy (CFP) of the European Union is legally binding for all Member States. It prescribes the end of overfishing and the rebuilding of all stocks above levels that can produce maximum sustainable yields (MSY). This study examines the current status, exploitation pattern, required time for rebuilding, future catch, and future profitability for 397 European stocks. Fishing pressure and biomass were estimated from 2000 to the last year with available data in 10 European ecoregions and 2 wide ranging regions. In the last year with available data, 69% of the 397 stocks were subject to ongoing overfishing and 51% of the stocks were outside of safe biological limits. Only 12% of the stocks fulfilled the prescriptions of the CFP. Fishing pressure has decreased since 2000 in some ecoregions but not in others. Barents Sea and Norwegian Sea have the highest percentage (> 60%) of sustainably exploited stocks that are capable of producing MSY. In contrast, in the Mediterranean Sea, fewer than 20% of the stocks are exploited sustainably. Overfishing is still widespread in European waters and current management, which aims at maximum sustainable exploitation, is unable to rebuild the depleted stocks and results in poor profitability. This study examines four future exploitation scenarios that are compatible with the CFP. It finds that exploitation levels of 50–80% of the maximum will rebuild stocks and lead to higher catches than currently obtained, with substantially higher profits for the fishers.","authors":["Rainer Froese","Henning Winker","Gianpaolo Coro","Nazli Demirel"],"meta":["April 2018Marine Policy 93:159-170","DOI:10.1016/j.marpol.2018.04.018"],"references":["319109130_Recent_Trends_and_Impacts_of_Fisheries_Exploitation_on_Mediterranean_Stocks_and_Ecosystems","317169343_Coherent_assessments_of_Europe's_marine_fishes_show_regional_divergence_and_megafauna_loss","315504654_Windows_of_Opportunity_for_Sustainable_Fisheries_Management_The_Case_of_Eastern_Baltic_Cod","315229473_Mediterranean_Sea_A_Failure_of_the_European_Fisheries_Management_System","309283306_Estimating_fisheries_reference_points_from_catch_and_resilience","299471799_Global_fishery_prospects_under_contrasting_management_regimes","315466378_Applying_a_New_Ensemble_Approach_to_Estimating_Stock_Status_of_Marine_Fisheries_Around_the_World","313647654_Impact_of_fishing_on_the_abundance_of_marine_species","313576109_The_Economic_Theory_of_a_Common_Property_Resource_The_Fishery","304713949_Fishing_for_MSY_using_pretty_good_yield_ranges_without_impairing_recruitment"]}