{"id":"324751801_Presentation_Attack_Detection_for_Iris_Recognition_System_Using_NIR_Camera_Sensor","abstract":"Among biometric recognition systems such as fingerprint, finger-vein, or face, the iris recognition system has proven to be effective for achieving a high recognition accuracy and security level. However, several recent studies have indicated that an iris recognition system can be fooled by using presentation attack images that are recaptured using high-quality printed images or by contact lenses with printed iris patterns. As a result, this potential threat can reduce the security level of an iris recognition system. In this study, we propose a new presentation attack detection (PAD) method for an iris recognition system (iPAD) using a near infrared light (NIR) camera image. To detect presentation attack images, we first localized the iris region of the input iris image using circular edge detection (CED). Based on the result of iris localization, we extracted the image features using deep learning-based and handcrafted-based methods. The input iris images were then classified into real and presentation attack categories using support vector machines (SVM). Through extensive experiments with two public datasets, we show that our proposed method effectively solves the iris recognition presentation attack detection problem and produces detection accuracy superior to previous studies.","authors":["Dat Tien Nguyen","Na  Rae Baek","Tuyen Danh Pham","Kang  Ryoung Park"],"meta":["April 2018Sensors 18(5):1315","DOI:10.3390/s18051315"],"references":["323423536_Combining_Deep_and_Handcrafted_Image_Features_for_Presentation_Attack_Detection_in_Face_Recognition_Systems_Using_Visible-Light_Camera_Sensors","322873086_LivDet_iris_2017_-_Iris_liveness_detection_competition_2017","321896881_Iris_Recognition_with_Off-the-Shelf_CNN_Features_A_Deep_Learning_Perspective","320177028_Spoof_Detection_for_Finger-Vein_Recognition_System_Using_NIR_Camera","317340604_Handcrafted_vs_Non-Handcrafted_Features_for_computer_vision_classification","315470211_Gender_Recognition_from_Human-Body_Images_Using_Visible-Light_and_Thermal_Camera_Videos_Based_on_a_Convolutional_Neural_Network_for_Image_Feature_Extraction","320373850_Deep_Texture_Features_for_Robust_Face_Spoofing_Detection","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317229764_Long_Range_Iris_Recognition_A_Survey","316169411_LivDet-Iris_2015_-_Iris_Liveness_Detection_Competition_2015"]}