{"id":"324757615_Gaia_Data_Release_2_The_astrometric_solution","abstract":"Context. Gaia Data Release 2 ( Gaia DR2) contains results for 1693 million sources in the magnitude range 3 to 21 based on observations collected by the European Space Agency Gaia satellite during the first 22 months of its operational phase.\nAims. We describe the input data, models, and processing used for the astrometric content of Gaia DR2, and the validation of these resultsperformed within the astrometry task.\nMethods. Some 320 billion centroid positions from the pre-processed astrometric CCD observations were used to estimate the five astrometric parameters (positions, parallaxes, and proper motions) for 1332 million sources, and approximate positions at the reference epoch J2015.5 for an additional 361 million mostly faint sources. These data were calculated in two steps. First, the satellite attitude and the astrometric calibration parameters of the CCDs were obtained in an astrometric global iterative solution for 16 million selected sources, using about 1% of the input data. This primary solution was tied to the extragalactic International Celestial Reference System (ICRS) by means of quasars. The resulting attitude and calibration were then used to calculate the astrometric parameters of all the sources. Special validation solutions were used to characterise the random and systematic errors in parallax and proper motion.\nResults. For the sources with five-parameter astrometric solutions, the median uncertainty in parallax and position at the reference epoch J2015.5 is about 0.04 mas for bright ( G < 14 mag) sources, 0.1 mas at G = 17 mag, and 0.7 masat G = 20 mag. In the proper motion components the corresponding uncertainties are 0.05, 0.2, and 1.2 mas yr ⁻¹ , respectively.The optical reference frame defined by Gaia DR2 is aligned with ICRS and is non-rotating with respect to the quasars to within 0.15 mas yr ⁻¹ . From the quasars and validation solutions we estimate that systematics in the parallaxes depending on position, magnitude, and colour are generally below 0.1 mas, but the parallaxes are on the whole too small by about 0.03 mas. Significant spatial correlations of up to 0.04 mas in parallax and 0.07 mas yr ⁻¹ in proper motion are seen on small (< 1 deg) and intermediate (20 deg) angular scales. Important statistics and information for the users of the Gaia DR2 astrometry are given in the appendices.","authors":["L. Lindegren","Jose Hernandez","A. Bombrun","Sergei A Klioner"],"meta":["April 2018Astronomy and Astrophysics 616","DOI:10.1051/0004-6361/201832727"],"references":["326105811_Gaia_Data_Release_2_Catalogue_validation","324757490_Gaia_Data_Release_2_Calibration_and_mitigation_of_electronic_offset_effects_in_the_data","324757403_Gaia_Data_Release_2_Processing_the_spectroscopic_data","324757394_Gaia_Data_Release_2_Processing_of_the_photometric_data","324756346_Gaia_Data_Release_2_Kinematics_of_globular_clusters_and_dwarf_galaxies_around_the_Milky_Way","324756243_Gaia_Data_Release_2_Summary_of_the_contents_and_survey_properties","324756174_Gaia_Data_Release_2_Observational_Hertzsprung-Russell_diagrams","324756006_Gaia_Data_Release_2_The_Celestial_reference_frame_Gaia-CRF2","331245583_Gaia_Data_Release_2","324757625_Gaia_Data_Release_2_The_photometric_content_and_validation"]}