{"id":"324751265_Applying_Gradient_Descent_in_Convolutional_Neural_Networks","abstract":"With the development of the integrated circuit and computer science, people become caring more about solving practical issues via information technologies. Along with that, a new subject called Artificial Intelligent (AI) comes up. One popular research interest of AI is about recognition algorithm. In this paper, one of the most common algorithms, Convolutional Neural Networks (CNNs) will be introduced, for image recognition. Understanding its theory and structure is of great significance for every scholar who is interested in this field. Convolution Neural Network is an artificial neural network which combines the mathematical method of convolution and neural network. The hieratical structure of CNN provides it reliable computer speed and reasonable error rate. The most significant characteristics of CNNs are feature extraction, weight sharing and dimension reduction. Meanwhile, combining with the Back Propagation (BP) mechanism and the Gradient Descent (GD) method, CNNs has the ability to self-study and in-depth learning. Basically, BP provides an opportunity for backwardfeedback for enhancing reliability and GD is used for self-training process. This paper mainly discusses the CNN and the related BP and GD algorithms, including the basic structure and function of CNN, details of each layer, the principles and features of BP and GD, and some examples in practice with a summary in the end.","authors":["Nan Cui"],"meta":["April 2018Journal of Physics Conference Series 1004(1):012027","DOI:10.1088/1742-6596/1004/1/012027"],"references":["313060232_Learning_Internal_Representations_by_Error_Propagation","303681767_Understanding_Convolutional_Neural_Networks","301099799_Feature_Extraction_and_Recognition_of_Handwritten_Characters_by_Homogeneous_Layers","275807826_Principles_of_Neurodynamics","245683212_Cognition_A_self-organizing_multilayered_neural_network","234461398_A_Proposed_Model_for_Visual_Information_Processing_in_the_Human_Brain","216792879_Backpropagation_Applied_to_Handwritten_Zip_Code_Recognition","21952992_Cognitron_A_self-organizing_multilayered_neural_network"]}