{"id":"324770285_Cloud_security_and_compliance_-_A_semantic_approach_in_end_to_end_security","abstract":"Abstract- The Cloud services are becoming an essential part of many organizations. Cloud providers have to\nadhere to security and privacy policies to ensure their users' data remains confidential and secure. Though there\nare some ongoing efforts on developing cloud security standards, most cloud providers are implementing a mishmash\nof security and privacy controls. This has led to confusion among cloud consumers as to what security\nmeasures they should expect from the cloud services, and whether these measures would comply with their\nsecurity and compliance requirements. We have conducted a comprehensive study to review the potential threats\nfaced by cloud consumers and have determined the compliance models and security controls that should be in\nplace to manage the risk. Based on this study, we have developed an ontology describing the cloud security\ncontrols, threats and compliances. We have also developed an application that classifies the security threats faced\nby cloud users and automatically determines the high level security and compliance policy controls that have to be\nactivated for each threat. The application also displays existing cloud providers that support these security\npolicies. Cloud consumers can use our system to formulate their security policies and find compliant providers\neven if they are not familiar with the underlying technology.","authors":["Kalaiprasath .R","R Elankavi","Udaya Kumar"],"meta":["September 2017International Journal on Smart Sensing and Intelligent Systems 8(Special):482-494","DOI:10.21307/ijssis-2017-265","Project: Cloud security and compliance - A semantic approach in end to end security"],"references":["323467538_Social_popularity_based_routing_in_delay_tolerant_networks","318235185_Path_Observation_Based_Physical_Routing_Protocol_for_Wireless_Ad_Hoc_Networks","317214542_Eda-based_estimation_of_visual_attention_by_observation_of_eye_blink_frequency","317213811_Techniques_in_advancing_the_capabilities_of_various_nitrate_detection_methods_A_review","316683681_A_total_quality_assessment_solution_for_synthetic_aperture_radar_nlfm_waveform_generation_and_evaluation_in_a_complex_random_media","316683615_An_in_vitro_cost-effective_test_bench_for_active_cardiac_implants_reproducing_human_exposure_to_electric_fields_50_hz","315498514_A_solar-powered_white_led-based_uv-vis_spectrophotometric_system_managed_by_pc_for_air_pollution_detection_in_faraway_and_unfriendly_locations","314356942_Feedback_equalizer_for_vehicular_channel","317214730_Smart_sensing_system_for_enhanceing_the_reliability_of_power_electronic_devices_used_in_wind_turbines","314895489_Power_Optimization_Techniques_for_Sequential_Elements_Using_Pulse_Triggered_Flip-Flops_with_SVL_Logic"]}