{"id":"324756243_Gaia_Data_Release_2_Summary_of_the_contents_and_survey_properties","abstract":"Context. We present the second Gaia data release, Gaia DR2, consisting of astrometry, photometry, radial velocities, and information on astrophysical parameters and variability, for sources brighter than magnitude 21. In addition epoch astrometry and photometry are provided for a modest sample of minor planets in the solar system.\nAims. A summary of the contents of Gaia DR2 is presented, accompanied by a discussion on the differences with respect to Gaia DR1 and an overview of the main limitations which are still present in the survey. Recommendations are made on the responsible use of Gaia DR2 results.\nMethods. The raw data collected with the Gaia instruments during the first 22 months of the mission have been processed by the Gaia Data Processing and Analysis Consortium (DPAC) and turned into this second data release, which represents a major advance with respect to Gaia DR1 in terms of completeness, performance, and richness of the data products. Results. Gaia DR2 contains celestial positions and the apparent brightness in G for approximately 1.7 billion sources. For 1.3 billion of those sources, parallaxes and proper motions are in addition available. The sample of sources for which variability information is provided is expanded to 0.5 million stars. This data release contains four new elements: broad-band colour information in the form of the apparent brightness in the GBP (330–680 nm) and GRP (630–1050 nm) bands is available for 1.4 billion sources; median radial velocities for some 7 million sources are presented; for between 77 and 161 million sources estimates are provided of the stellar effective temperature, extinction, reddening, and radius and luminosity; and for a pre-selected list of 14 000 minor planets in the solar system epoch astrometry and photometry are presented. Finally, Gaia DR2 also represents a new materialisation of the celestial reference frame in the optical, the Gaia -CRF2, which is the first optical reference frame based solely on extragalactic sources. There are notable changes in the photometric system and the catalogue source list with respect to Gaia DR1, and we stress the need to consider the two data releases as independent. Conclusions. Gaia DR2 represents a major achievement for the Gaia mission, delivering on the long standing promise to provide parallaxes and proper motions for over 1 billion stars, and representing a first step in the availability of complementary radial velocity and source astrophysical information for a sample of stars in the Gaia survey which covers a very substantial fraction of the volume of our galaxy.","authors":["Gaia Collaboration","C. Ordenovic"],"meta":["April 2018Astronomy and Astrophysics 616","DOI:10.1051/0004-6361/201833051","Project: Gaia mission"],"references":["326105811_Gaia_Data_Release_2_Catalogue_validation","324890330_Gaia_Data_Release_2_Summary_of_the_variability_processing_analysis_results","324776485_Gaia_Data_Release_2_Using_Gaia_parallaxes","324776032_Gaia_Data_Release_2_Mapping_the_Milky_Way_disc_kinematics","324757615_Gaia_Data_Release_2_The_astrometric_solution","324757490_Gaia_Data_Release_2_Calibration_and_mitigation_of_electronic_offset_effects_in_the_data","324757403_Gaia_Data_Release_2_Processing_the_spectroscopic_data","324757394_Gaia_Data_Release_2_Processing_of_the_photometric_data","324757625_Gaia_Data_Release_2_The_photometric_content_and_validation","324757552_Gaia_Radial_Velocity_Spectrometer"]}