{"id":"324702251_On-Line_Path_Computation_and_Function_Placement_in_SDNs","abstract":"We consider service requests that arrive in an online fashion in Software-Defined Networks (SDNs) with network function virtualization (NFV). Each request is a flow with a high-level specification of routing and processing (by network functions) requirements. Each network function can be performed by a specified subset of servers in the system. The algorithm needs to decide whether to reject the request, or accept it and with a specific routing and processing assignment, under given capacity constraints (solving the path computation and function placement problems). Each served request is assumed to “pay” a pre-specified benefit and the goal is to maximize the total benefit accrued. In this paper we first formalize the problem, and propose a new service model that allows us to cope with requests with unknown duration without preemption. The new service model augments the traditional accept/reject schemes with a new possible response of “stand by.” We also present a new expressive model to describe requests abstractly using a “plan” represented by a directed graph. Our algorithmic result is an online algorithm for path computation and function placement that guarantees, in each time step, throughput of at least a logarithmic fraction of a (very permissive) upper bound on the maximal possible benefit.","authors":["Guy Even","Moti Medina","Boaz Patt-Shamir"],"meta":["February 2019Theory of Computing Systems 63(3)","DOI:10.1007/s00224-018-9863-4"],"references":["301857547_Competitive_Path_Computation_and_Function_Placement_in_SDNs","301855728_An_Approximation_Algorithm_for_Path_Computation_and_Function_Placement_in_SDNs","263699248_Merlin_A_Language_for_Provisioning_Network_Resources","262805723_Software-Defined_Networking_A_Comprehensive_Survey","234784007_Amortized_efficiency_of_list_update_paging_rules","310506879_An_Approximation_Algorithm_for_Path_Computation_and_Function_Placement_in_SDNs","309613847_On-Line_Path_Computation_and_Function_Placement_in_SDNs","308855122_Near_optimal_placement_of_virtual_network_functions","262360476_Managing_the_network_with_Merlin","262154555_Competitive_Routing_of_Virtual_Circuits_with_Unknown_Duration"]}