{"id":"324744968_The_structured_backbone_of_temporal_social_ties","abstract":"In many data sets, crucial information on the structure and temporality of a system coexists with noise and non-essential elements. In networked systems for instance, some edges might be non-essential or exist only by chance. Filtering them out and extracting a set of relevant connections, the \"network backbone\", is a non-trivial task, and methods put forward until now do not address time-resolved networks, whose availability has strongly increased in recent years. We develop here such a method, by defining an adequate temporal network null model, which calculates the random chance of nodes to be connected at any time after controlling for their activity. This allows us to identify, at any level of statistical significance, pairs of nodes that have more interactions than expected given their activities: These form a backbone of significant ties. We apply our method to empirical temporal networks of socio-economic interest and find that (i) at given level of statistical significance, our method identifies more significant ties than previous methods considering temporally aggregated networks, and (ii) when a community structure is present, most significant ties are intra-community edges, suggesting that inter-community edges are random. Most importantly, our filtering method can assign a significance to more complex structures such as triads of simultaneous interactions, while methods based on static representations are by construction unable to do so. Strikingly, we uncover that significant triads are not equivalent to triangles composed by three significant edges. Our results hint at new ways to represent temporal networks for use in data-driven models and in anonymity-preserving ways.","authors":["Teruyoshi Kobayashi","Taro Takaguchi","Alain Barrat"],"meta":["January 2019Nature Communications 10(1)","DOI:10.1038/s41467-018-08160-3"],"references":["331096337_A_Polya_urn_approach_to_information_filtering_in_complex_networks","328681627_Community_Structures_Interactions_and_Dynamics_in_London's_Bicycle_Sharing_Network","328024083_Identifying_relationship_lending_in_the_interbank_market_A_network_approach","325635673_Social_dynamics_of_financial_networks","323702309_Network_structure_from_rich_but_noisy_data","323335178_Extracting_the_multi-timescale_activity_patterns_of_online_financial_markets","321902156_Can_co-location_be_used_as_a_proxy_for_face-to-face_contacts","324634329_Le_Cam's_Inequality_and_Poisson_Approximations","323627166_Network_reconstruction_and_error_estimation_with_noisy_network_data","319436082_From_Relational_Data_to_Graphs_Inferring_Significant_Links_Using_Generalized_Hypergeometric_Ensembles","317300275_Irreducible_network_backbones_unbiased_graph_filtering_via_maximum_entropy","313857986_Non-Negative_Tensor_Factorization_for_Human_Behavioral_Pattern_Mining_in_Online_Games","308899886_A_Guide_to_Temporal_Networks","305976703_Poisson_approximation_for_some_statistics_based_on_exchangeable_trials","301233247_Network_structure_and_minimum_degree"]}