{"id":"324767561_Energy_Reduction_Multipath_Routing_Protocol_for_MANET_Using_Recoil_Technique","abstract":"In Mobile Ad-hoc networks (MANET), power conservation and utilization is an acute problem and has received significant attention from academics and industry in recent years. Nodes in MANET function on battery power, which is a rare and limited energy resource. Hence, its conservation and utilization should be done judiciously for the effective functioning of the network. In this paper, a novel protocol namely Energy Reduction Multipath Routing Protocol for MANET using Recoil Technique (AOMDV-ER) is proposed, which conserves the energy along with optimal network lifetime, routing overhead, packet delivery ratio and throughput. It performs better than any other AODV based algorithms, as in AOMDV-ER the nodes transmit packets to their destination smartly by using a varying recoil off time technique based on their geographical location. This concept reduces the number of transmissions, which results in the improvement of network lifetime. In addition, the local level route maintenance reduces the additional routing overhead. Lastly, the prediction based link lifetime of each node is estimated which helps in reducing the packet loss in the network. This protocol has three subparts: an optimal route discovery algorithm amalgamation with the residual energy and distance mechanism; a coordinated recoiled nodes algorithm which eliminates the number of transmissions in order to reduces the data redundancy, traffic redundant, routing overhead, end to end delay and enhance the network lifetime; and a last link reckoning and route maintenance algorithm to improve the packet delivery ratio and link stability in the network. The experimental results show that the AOMDV-ER protocol save at least 16% energy consumption, 12% reduction in routing overhead, significant achievement in network lifetime and packet delivery ratio than Ad hoc on demand multipath distance vector routing protocol (AOMDV), Ad hoc on demand multipath distance vector routing protocol life maximization (AOMR-LM) and Source routing-based multicast protocol (SRMP) algorithms. Hence, the AOMDV-ER algorithm performs better than these recently developed algorithms.","authors":["Rakesh  Kumar Sahu","Narendra Chaudhari"],"meta":["April 2018Electronics 7(5):56","DOI:10.3390/electronics7050056"],"references":["315466869_OEFS_On-demand_Energy-based_Forwarding_Strategy_for_Named_Data_Wireless_Ad_Hoc_Networks","271304275_Mesh_Based_Multicast_Routing_in_MANET_Stable_Link_Based_Approach","270627365_Cluster_and_Location_Based_Overlay_Multicast_in_Mobile_Ad_Hoc_and_Sensor_Networks","267500921_A_Multipath_Energy-Conserving_Routing_Protocol_for_Lifetime_Improvement_of_Wireless_Ad_Hoc_Networks","261140635_Data_Delivery_Method_Based_on_Neighbor_Nodes'_Information_in_a_Mobile_Ad_Hoc_Network","328466190_A_Multipath_Energy-Conserving_Routing_Protocol_for_Wireless_Ad_Hoc_Networks_Lifetime_Improvement","317149774_Energy_Efficient_Multipath_Routing_Protocol_for_Mobile_Ad-Hoc_Network_Using_the_Fitness_Function","291769079_Efficient_data_delivery_over_MANET's_through_secured_EGMP","287458287_LAR-1_Affirmative_influences_on_Energy-Conservation_and_Network_Lifetime_in_MANET","276427782_An_Energy-efficient_Routing_Protocol_for_MANETs_a_Particle_Swarm_Optimization_Approach"]}