{"id":"324725496_LWR-Based_Fully_Homomorphic_Encryption_Revisited","abstract":"Very recently, Costache and Smart proposed a fully homomorphic encryption (FHE) scheme based on the Learning with Rounding ( LWR ) problem, which removes the noise (typically, Gaussian noise) sampling needed in the previous lattices-based FHEs. But their scheme did not work, since the noise of homomorphic multiplication is complicated and large, which leads to failure of decryption. More specifically, they chose LWR instances as a public key and the private key therein as a secret key and then used the tensor product to implement homomorphic multiplication, which resulted in a tangly modulus problem. Recall that there are two moduli in the LWR instances, and then the moduli will tangle together due to the tensor product. Inspired by their work, we built the first workable LWR -based FHE scheme eliminating the tangly modulus problem by cleverly adopting the celebrated approximate eigenvector method proposed by Gentry et al. at Crypto 2013. Roughly speaking, we use a specific matrix multiplication to perform the homomorphic multiplication, hence no tangly modulus problem. Furthermore, we also extend the LWR -based FHE scheme to the multikey setting using the tricks used to construct LWE -based multikey FHE by Mukherjee and Wichs at Eurocrypt 2016. Our LWR -based multikey FHE construction provides an alternative to the existing multikey FHEs and can also be applied to multiparty computation with higher efficiency.","authors":["Fucai Luo","Fuqun Wang","Kunpeng Wang","Jie Li"],"meta":["April 2018Security and Communication Networks 2018(11):1-12","DOI:10.1155/2018/5967635"],"references":["309820221_Analyzing_the_Shuffling_Side-Channel_Countermeasure_for_Lattice-Based_Signatures","309774041_Faster_Fully_Homomorphic_Encryption_Bootstrapping_in_Less_Than_01_Seconds","309302653_Multi-key_FHE_from_LWE_Revisited","309299335_Targeted_Homomorphic_Attribute-Based_Encryption","305810992_Flush_Gauss_and_Reload_-_A_Cache_Attack_on_the_BLISS_Lattice-Based_Signature_Scheme","305782105_On_the_Hardness_of_Learning_with_Rounding_over_Small_Modulus","304373854_Fully_homomorphic_encryption_with_relatively_small_key_and_ciphertext_sizes","301670743_Two_Round_Multiparty_Computation_via_Multi-key_FHE","300571458_Leveled_Fully_Homomorphic_Signatures_from_Standard_Lattices","286511587_FHEW_Bootstrapping_Homomorphic_Encryption_in_Less_Than_a_Second"]}