{"id":"324764911_Never-ending_learning","abstract":"Whereas people learn many different types of knowledge from diverse experiences over many years, and become better learners over time, most current machine learning systems are much more narrow, learning just a single function or data model based on statistical analysis of a single data set. We suggest that people learn better than computers precisely because of this difference, and we suggest a key direction for machine learning research is to develop software architectures that enable intelligent agents to also learn many types of knowledge, continuously over many years, and to become better learners over time. In this paper we define more precisely this never-ending learning paradigm for machine learning, and we present one case study: the Never-Ending Language Learner (NELL), which achieves a number of the desired properties of a never-ending learner. NELL has been learning to read the Web 24hrs/day since January 2010, and so far has acquired a knowledge base with 120mn diverse, confidence-weighted beliefs (e.g., servedWith(tea,biscuits)), while learning thousands of interrelated functions that continually improve its reading competence over time. NELL has also learned to reason over its knowledge base to infer new beliefs it has not yet read from those it has, and NELL is inventing new relational predicates to extend the ontology it uses to represent beliefs. We describe the design of NELL, experimental results illustrating its behavior, and discuss both its successes and shortcomings as a case study in never-ending learning. NELL can be tracked online at http://rtw.ml.cmu.edu, and followed on Twitter at @CMUNELL.","authors":["T. Mitchell","B. Kisiel","J. Krishnamurthy","Ni Lao"],"meta":["April 2018Communications of the ACM 61(5):103-115","DOI:10.1145/3191513"],"references":["317040721_Estimating_Accuracy_from_Unlabeled_Data_A_Probabilistic_Logic_Approach","313242708_Never-Ending_Learning","289579004_Estimating_accuracy_from_unlabeled_data","284787673_Towards_Universal_Paraphrastic_Sentence_Embeddings","318740750_Leveraging_Knowledge_Bases_in_LSTMs_for_Improving_Machine_Reading","309747963_Lifelong_Machine_Learning","301404985_Incorporating_Vector_Space_Similarity_in_Random_Walk_Inference_over_Knowledge_Bases","294282523_Conversing_Learning_Active_Learning_and_Active_Social_Interaction_for_Human_Supervision_in_Never-Ending_Learning_Systems","290767110_Knowledge_Graph_Identification","286647531_OpenEval_Web_information_query_evaluation"]}