{"id":"324740353_Hierarchical_combinatorial_deep_learning_architecture_for_pancreas_segmentation_of_medical_computed_tomography_cancer_images","abstract":"Background: \nEfficient computational recognition and segmentation of target organ from medical images are foundational in diagnosis and treatment, especially about pancreas cancer. In practice, the diversity in appearance of pancreas and organs in abdomen, makes detailed texture information of objects important in segmentation algorithm. According to our observations, however, the structures of previous networks, such as the Richer Feature Convolutional Network (RCF), are too coarse to segment the object (pancreas) accurately, especially the edge.\n\nMethod: \nIn this paper, we extend the RCF, proposed to the field of edge detection, for the challenging pancreas segmentation, and put forward a novel pancreas segmentation network. By employing multi-layer up-sampling structure replacing the simple up-sampling operation in all stages, the proposed network fully considers the multi-scale detailed contexture information of object (pancreas) to perform per-pixel segmentation. Additionally, using the CT scans, we supply and train our network, thus get an effective pipeline.\n\nResult: \nWorking with our pipeline with multi-layer up-sampling model, we achieve better performance than RCF in the task of single object (pancreas) segmentation. Besides, combining with multi scale input, we achieve the 76.36% DSC (Dice Similarity Coefficient) value in testing data.\n\nConclusion: \nThe results of our experiments show that our advanced model works better than previous networks in our dataset. On the other words, it has better ability in catching detailed contexture information. Therefore, our new single object segmentation model has practical meaning in computational automatic diagnosis.","authors":["Min Fu","Wenming Wu","Xiafei Hong","Qiuhua Liu"],"meta":["April 2018BMC Systems Biology 12(S4)","DOI:10.1186/s12918-018-0572-z"],"references":["320971612_Richer_Convolutional_Features_for_Edge_Detection","311492722_Richer_Convolutional_Features_for_Edge_Detection","305196650_Going_deeper_with_convolutions","292996483_Deep_Convolutional_Neural_Networks_for_Computer-Aided_Detection_CNN_Architectures_Dataset_Characteristics_and_Transfer_Learning","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","312727767_Going_deeper_with_convolutions","303409473_R-FCN_Object_Detection_via_Region-based_Fully_Convolutional_Networks","303157241_The_relationship_between_precision-recall_and_ROC_Curves","301921832_Fully_convolutional_networks_for_semantic_segmentation"]}