{"id":"324732733_Ontology-Based_Web_Service_Architecture_for_Retail_Supply_Chain_Management","abstract":"Supply chain business-partners are dependent on each other for resources and information. This dependency has been deepening in recent decades due to globalization of enterprise operations and rapid improvement in information technology-based business services. Particularly, service-oriented computing (SOC) technologies provide numerous opportunities and value-added service capabilities that global retail business requires to remain competitive in the market. Initiative to semantic web service provision is playing a crucial role to realize the possibility of heterogenous information systems integration in supply chain. The ability to dynamically discover and invoke a web service is an important aspects of semantic web service-based architecture. An essential part of the service discovery process is the ontology-based semantic web service matchmaking algorithm. This paper presents the key features of an improved matchmaking algorithm to calculate the similarity between concepts on ontology for semantic web service. The matchmaking is taking place in the context of OWL-S (Ontology Web Language for Services) based retail sales management. The paper describes the Semantic Web Service Architecture-II (SWSA-II), which uses a hybrid knowledge-based system; and it consists of Structural Case-Based Reasoning (S-CBR), Rule-Based Reasoning (RBR), and an ontological concept similarity assessment algorithm. Finally, a business scenario is used to demonstrate the functionality of the algorithm.","authors":["Kamal Pal"],"meta":["January 2018Procedia Computer Science 130:985-990","DOI:10.1016/j.procs.2018.04.101"],"references":["317039068_A_Semantic_Web_Service_Architecture_for_Supply_Chain_Management","260636776_Bootstrapping_Ontologies_for_Web_Services","221466079_LogMap_Logic-Based_and_Scalable_Ontology_Matching","220438679_Web_Service_Modeling_Ontology","220349132_Structural_Case-Based_Reasoning_and_Ontology-Based_Knowledge_Management_A_Perfect_Match","222577579_OWLS-MX_a_hybrid_semantic_web_service_matchmaker_for_OWL-S_services"]}