{"id":"324789554_Use_flexibility_of_perch_types_by_the_branch-camouflaged_Common_Potoo_Nyctibius_griseus_Why_this_bird_may_occasionally_dare_to_perch_on_artificial_substrates","abstract":"Animal species gain protection against visually oriented predators when they choose a suitable substrate that maximizes camouflaging. The choice of appropriate substrate may be particularly important during the brooding period when vulnerability of the parents and their progeny is high. The Common Potoo (Nyctibius griseus) is a well-camouflaged bird that blends nearly perfectly into a branch extension. Camouflage may be so effective for this species that perched individuals may wait until the last second before fleeing a potential predator. We compared the features of day perch substrates used by this bird during nesting and nonnesting occasions. We accessed 1,560 photos online and found that Common Potoo predominantly use natural tree substrates for nesting and resting (1,510 photos, 96.8%), except for a small percentage of individuals (50 photos, 3.2%) that choose seemingly risky artificial substrates (e.g., wires, traffic poles, and even plastic bottles) as resting sites. In addition, a random subsample of 150 photographs of individuals perched on trees revealed (1) prominently similar features of nesting perches chosen by adults during the nestling and not fully fledged stages of their offspring, and (2) a more flexible choice of tree substrate features by adults during the nonnesting period. We hypothesized that during the nesting period, adult behavior is to use perches that increase crypsis (i.e., with minimal probability of detection by visually oriented predators). Adults, in the absence of nestlings and not fully fledged juveniles, may be more flexible in choosing resting substrates, taking advantage of the masquerade effect. Received 5 October 2016. Accepted 11 June 2017.","authors":["César Cestari","Cristina Gonçalves","Ivan Sazima"],"meta":["March 2018The Wilson Journal of Ornithology 130(1):191-199","DOI:10.1676/16-175.1","Projects: Vertebrate Natural HistoryInvestigating proximate and ultimate causes of birds'behavior in anthropogenic habitat.s"],"references":["292336193_Camouflage_predicts_survival_in_ground-nesting_birds","280637761_Parrots_as_overlooked_seed_dispersers","277776494_Cleaner_birds_a_worldwide_overview","275961207_The_baby_shall_stay_safe_the_Common_Potoo_leaves_the_day_roost_and_protect_its_nestling_from_rainstorm","320182358_The_Origin_of_Species","294260157_Nightjars_and_their_allies_The_Caprimulgiformes","291024772_Family_nyctibiidae_potoos","276852680_Bent_posture_improves_the_protective_value_of_bird_dropping_masquerading_by_caterpillars","274499418_Notes_on_the_Structure_of_the_Upper_Eyelid_of_Potoos_Nyctibius","273107888_Animal_Camouflage"]}