{"id":"324723768_Information_Decomposition_of_Target_Effects_from_Multi-Source_Interactions_Perspectives_on_Previous_Current_and_Future_Work","abstract":"The formulation of the Partial Information Decomposition (PID) framework by Williams and Beer in 2010 attracted a significant amount of attention to the problem of defining redundant (or shared), unique and synergistic (or complementary) components of mutual information that a set of source variables provides about a target. This attention resulted in a number of measures proposed to capture these concepts, theoretical investigations into such measures, and applications to empirical data (in particular to datasets from neuroscience). In this Special Issue on “Information Decomposition of Target Effects from Multi-Source Interactions” at Entropy, we have gathered current work on such information decomposition approaches from many of the leading research groups in the field. We begin our editorial by providing the reader with a review of previous information decomposition research, including an overview of the variety of measures proposed, how they have been interpreted and applied to empirical investigations. We then introduce the articles included in the special issue one by one, providing a similar categorisation of these articles into: i. proposals of new measures; ii. theoretical investigations into properties and interpretations of such approaches, and iii. applications of these measures in empirical studies. We finish by providing an outlook on the future of the field.","authors":["Joseph T Lizier","Nils Bertschinger","Juergen Jost","Michael Wibral"],"meta":["April 2018Entropy 20(4):307","DOI:10.3390/e20040307"],"references":["324651720_Pointwise_Partial_Information_Decomposition_Using_the_Specificity_and_Ambiguity_Lattices","322787393_Probability_Mass_Exclusions_and_the_Directed_Components_of_Pointwise_Mutual_Information","321279520_Analyzing_Information_Distribution_in_Complex_Systems","320643164_Partial_and_Entropic_Information_Decompositions_of_a_Neuronal_Modulatory_Interaction","320292538_Bivariate_Partial_Information_Decomposition_The_Optimization_Perspective","319855615_Quantifying_Information_Modification_in_Developing_Neural_Networks_via_Partial_Information_Decomposition","319586303_The_Partial_Information_Decomposition_of_Generative_Neural_Network_Models","319403416_Morphological_Computation_Synergy_of_Body_and_Brain","317955049_Invariant_Components_of_Synergy_Redundancy_and_Unique_Information_among_Three_Variables","322787401_Pointwise_Information_Decomposition_Using_the_Specificity_and_Ambiguity_Lattices"]}