{"id":"324739720_Social_media_metrics_and_sentiment_analysis_to_evaluate_the_effectiveness_of_social_media_posts","abstract":"The paper at hand presents the results of an analysis of indicators underlying successful self-marketing techniques on social media. The participants included YouTube gamers. We focus on the content of their communication on Facebook to identify significant differences in terms of their user-generated Facebook metrics and commentary sentiments. Methodologically, ANOVA and sentiment analysis were applied. ANOVA of the classified post categories revealed that re-posted YouTube videos gained significantly fewer likes, comments, and shares from the audience. On the other hand, photos tended to show significantly more follower-generated actions compared to other post types in the sample. Sentiment analysis revealed underlying follower negativity when user-generated activity tended to be relatively low, offering valuable complementary results to the mere analysis of other post indicators, such as the number of likes, comments, and shares. The results indicated the necessity to utilize natural language processing techniques to optimize brand communication on social media and highlighted the importance of considering the opinion of the masses for better understanding of consumer feedback.","authors":["Flora Poecze","Claus Ebster","Christine Strauss"],"meta":["January 2018Procedia Computer Science 130:660-666","DOI:10.1016/j.procs.2018.04.117","Project: New Business Models enabled by ICT"],"references":["275281543_Motivations_for_sharing_information_and_social_support_in_social_media_A_comparative_analysis_of_Facebook_Twitter_Delicious_YouTube_and_Flickr_Motivations_for_Sharing_Information_and_Social_Support_in","313398724_Sentiment_analysis_of_facebook_statuses_using_naive_bayes_classifier_for_language_learning","307936026_Large-scale_sentiment_analysis_for_news_and_blogs","303924235_Sentiment_Analysis_in_Social_Networks","290496893_Sentiment_analysis_Mining_opinions_sentiments_and_emotions","289394953_Predictive_Analytics_and_Data_Mining_Concepts_and_Practice_with_RapidMiner","271672000_Exploring_Personal_Branding_on_YouTube","267821420_The_Brand_Called_You","264824022_Using_social_media_for_continuous_monitoring_and_mining_of_consumer_behaviour","261960908_Content_Sharing_in_a_Social_Broadcasting_Environment_Evidence_from_Twitter"]}