{"id":"324761102_Finding_overlapping_communities_in_multilayer_networks","abstract":"Finding communities in multilayer networks is a vital step in understanding the structure and dynamics of these layers, where each layer represents a particular type of relationship between nodes in the natural world. However, most community discovery methods for multilayer networks may ignore the interplay between layers or the unique topological structure in a layer. Moreover, most of them can only detect non-overlapping communities. In this paper, we propose a new community discovery method for multilayer networks, which leverages the interplay between layers and the unique topology in a layer to reveal overlapping communities. Through a comprehensive analysis of edge behaviors within and across layers, we first calculate the similarities for edges from the same layer and the cross layers. Then, by leveraging these similarities, we can construct a dendrogram for the multilayer networks that takes both the unique topological structure and the important interplay into consideration. Finally, by introducing a new community density metric for multilayer networks, we can cut the dendrogram to get the overlapping communities for these layers. By applying our method on both synthetic and real-world datasets, we demonstrate that our method has an accurate performance in discovering overlapping communities in multilayer networks.","authors":["Weiyi Liu","Toyotaro Suzumura","Hongyu Ji","Guangmin Hu"],"meta":["April 2018PLoS ONE 13(4):e0188747","DOI:10.1371/journal.pone.0188747"],"references":["294285452_Semantics-Aware_Content-Based_Recommender_Systems","281214216_Heterogeneous_Coupling_between_Interdependent_Lattices_Promotes_the_Cooperation_in_the_Prisoner's_Dilemma_Game","308073050_Inferring_the_reputation_enhances_the_cooperation_in_the_public_goods_game_on_interdependent_lattices","307964986_Scalable_Link_Prediction_on_Multidimensional_Networks","304506015_Maps_of_sparse_Markov_chains_efficiently_reveal_community_structure_in_network_flows_with_memory","301846217_Finding_overlapping_communities_in_multiplex_networks","301232956_The_structure_and_function_of_networks","299135738_A_Survey_of_Socially_Aware_Peer-to-Peer_Systems","283531736_Efficient_community_detection_of_network_flows_for_varying_Markov_times_and_bipartite_networks","268817412_The_Structure_and_Dynamics_of_Multilayer_Networks"]}