{"id":"324730789_Research_Patterns_and_Trends_on_Open_Educational_Practices_An_Exploratory_Literature_Review","abstract":"There have been increasingly more discussions on Open Educational Practices (OEPs) in recent years. We conducted a literature review in order to understand (1) the scope and nature of OEPs as documented in the literature, and (2) its relationship with OERs. All peer-reviewed articles indexed in the ERIC database, which have open educational practice(s) in their title, abstract, or keywords were sampled through manual data collection and text-mining (Hearst, 2003). In the screening process, researchers reached 37 papers published between 1979 and 2017, and after examining their content, included 36 of them to the research corpus. Of these 36 papers, 35 were journal articles and 1 was a research report. Preliminary analysis of resources demonstrated two major strands of OEP research in the educational literature: those who explore OEPs in relation to OERs only and, to a lesser extent, those who discuss OEPs in a broader context including networked and open scholarship. The first paper on digital open educational practices was published in 2008 (n = 1) and peak publication points were reached in 2014 (n = 6), 2015 (n= 6) and 2016 (n = 8), which suggests a slow but steady increase in papers related to OEPs. Of all the 91 different keywords that were used in the papers, open educational resource[s] (n = 32), open educational practice[s] (n = 27), higher education (n = 5), professional development (n = 4), open education (n = 3) and public open scholar (n = 3) were the most frequently used ones. During the session, common trends and patterns based on geographical location, source and education level will also be discussed. Based on the findings, and building on the works of Ehlers (2011) and Mays (2017), we call for a need to conceptualise open education as a pluralistic model that embrace open educational practices as a pedagogical approach. The result of this relationship can be artefacts such as OERs and MOOCs; however, using Cronin's (2017) four dimensions of open shared by open educators, we can possibly see implications in \"closed\" settings as well. We also argue that although many practices such as teaching a MOOC or becoming an active member of an educational hashtag community are examples of OEPs, as a descriptor, the term itself is under-recognized in the broader educational literature.","authors":["Suzan Koseoglu","Aras Bozkurt"],"meta":["January 2018","Conference: OER18: Open to All, The 9th annual conference for Open Education research, practice and policyAt: Bristol, United Kingdom"],"references":["260423349_Extending_the_territory_From_open_educational_resources_to_open_educational_practices","321907505_Mainstreaming_use_of_Open_Educational_Resources_OER_in_an_African_context"]}