{"id":"324882480_Ensemble_of_Deep_Models_for_Event_Recognition","abstract":"In this article, we address the problem of recognizing an event from a single related picture. Given the large number of event classes and the limited information contained in a single shot, the problem is known to be particularly hard. To achieve a reliable detection, we propose a combination of multiple classifiers, and we compare three alternative strategies to fuse the results of each classifier, namely: (i) induced order weighted averaging operators, (ii) genetic algorithms, and (iii) particle swarm optimization. Each method is aimed at determining the optimal weights to be assigned to the decision scores yielded by different deep models, according to the relevant optimization strategy. Experimental tests have been performed on three event recognition datasets, evaluating the performance of various deep models, both alone and selectively combined. Experimental results demonstrate that the proposed approach outperforms traditional multiple classifier solutions based on uniform weighting, and outperforms recent state-of-the-art approaches.","authors":["Kashif Ahmad","Mohamed Lamine Mekhalfi","Nicola Conci","Farid Melgani"],"meta":["May 2018ACM Transactions on Multimedia Computing, Communications and Applications 14(2):1-20","DOI:10.1145/3199668","Project: Event Recongnition"],"references":["319877859_Convolutional_Neural_Networks_for_Disaster_Images_Retrieval","319695330_Transferring_Deep_Object_and_Scene_Representations_for_Event_Recognition_in_Still_Images","318081382_Deep_Learning_for_Mobile_Multimedia_A_Survey","311612072_Spatial_Pyramid_Convolutional_Neural_Network_for_Social_Event_Detection_in_Static_Image","320005174_A_saliency-based_approach_to_event_recognition","319770006_Learning_Deep_Features_for_Discriminative_Localization","316898798_A_hierarchical_approach_to_event_discovery_from_single_images_using_MIL_framework","311609041_Deep_Residual_Learning_for_Image_Recognition","308870623_Event_recognition_in_personal_photo_collections_using_hierarchical_model_and_multiple_features","308842244_DevNet_A_Deep_Event_Network_for_multimedia_event_detection_and_evidence_recounting"]}