{"id":"324889185_The_Anatomy_of_a_Large-Scale_Online_Experimentation_Platform","abstract":"Online controlled experiments (e.g., A/B tests) are an integral part of successful data-driven companies. At Microsoft, supporting experimentation poses a unique challenge due to the wide variety of products being developed, along with the fact that experimentation capabilities had to be added to existing, mature products with codebases that go back decades. This paper describes the Microsoft ExP Platform (ExP for short) which enables trustworthy A/B experimentation at scale for products across Microsoft, from web properties (such as bing.com) to mobile apps to device drivers within the Windows operating system. The two core tenets of the platform are trustworthiness (an experiment is meaningful only if its results can be trusted) and scalability (we aspire to expose every single change in any product through an A/B experiment). Currently, over ten thousand experiments are run annually. In this paper, we describe the four core components of an A/B experimentation system: experimentation portal, experiment execution service, log processing service and analysis service, and explain the reasoning behind the design choices made. These four components work together to provide a system where ideas can turn into experiments within minutes and those experiments can provide initial trustworthy results within hours.","authors":["Somit Gupta","Lucy Ulanova","Sumit Bhardwaj","Pavel Dmitriev"],"meta":["May 2018","DOI:10.1109/ICSA.2018.00009","Conference: IEEE INTERNATIONAL CONFERENCE ON SOFTWARE ARCHITECTURE (ICSA 2018)At: Seattle, USA","Project: Online Controlled Experimentation"],"references":["320582817_Democratizing_online_controlled_experiments_at_Bookingcom","319482190_The_Benefits_of_Controlled_Experimentation_at_Scale","317006885_The_Evolution_of_Continuous_Experimentation_in_Software_Product_Development","313449492_Pitfalls_of_long-term_online_controlled_experiments","309312079_Trustworthy_Analysis_of_Online_AB_Tests_Pitfalls_challenges_and_solutions","309131478_Concise_summarization_of_heterogeneous_treatment_effect_using_total_variation_regularized_regression","344896533_Power_Analysis_for_Experimental_Research_A_Practical_Guide_for_the_Biological_Medical_and_Social_Sciences","318920701_A_Dirty_Dozen_Twelve_Common_Metric_Interpretation_Pitfalls_in_Online_Controlled_Experiments","318764327_AB_Testing_at_Scale_Accelerating_Software_Innovation","309469428_Measuring_Metrics"]}