{"id":"324813624_Safety-aware_Graph-based_Semi-Supervised_Learning","abstract":"In machine learning field, Graph-based Semi-Supervised Learning (GSSL) has recently attracted much attention and many researchers have proposed a number of different methods. GSSL generally constructs a k nearest neighbors graph to explore manifold structure which may improve learning performance of GSSL. If one uses an inappropriate graph to learn a semi-supervised classifier, the performance of the classifier may be worse than that of supervised learning (SL) only trained by labeled samples. Hence, it is worthy to design a safe version to broaden the application area of GSSL. In this paper, we introduce a Safety-aware GSSL (SaGSSL) method which can adaptively select the good graphs and learn a safe semi-supervised classifier simultaneously. The basic assumption is that a graph has a high quality if the sample margin obtained by GSSL with the graph is larger than that obtained by SL. By identifying the high-quality graphs and setting the corresponding weights large, the predictions of our algorithm will approach to those of GSSL with the graphs. Meanwhile, the weights of the low-quality graphs should be small and the predictions of our algorithm will be close to those of SL. Hence the degeneration probability will be reduced and our algorithm is expected to realize the goal of safe exploitation of different graphs. Experimental results on several datasets show that our algorithm can simultaneously implement the graph selection and safely exploit the unlabeled samples.","authors":["Haitao Gan","Zhenhua Li","Wei Wu","Zhizeng Luo"],"meta":["April 2018Expert Systems with Applications 107","DOI:10.1016/j.eswa.2018.04.031","Project: safe semi-supervised learning"],"references":["315889639_Towards_Safe_Semi-supervised_Classification_Adjusted_Cluster_Assumption_via_Clustering","284233833_An_overview_on_semi-supervised_support_vector_machine","281349704_A_risk_degree-based_safe_semi-supervised_learning_algorithm"]}