{"id":"324857791_In_the_Beginning_was_a_Mutualism_-_On_the_Origin_of_Translation","abstract":"The origin of translation is critical for understanding the evolution of life, including the origins of life. The canonical genetic code is one of the most dominant aspects of life on this planet, while the origin of heredity is one of the key evolutionary transitions in living world. Why the translation apparatus evolved is one of the enduring mysteries of molecular biology. Assuming the hypothesis, that during the emergence of life evolution had to first involve autocatalytic systems which only subsequently acquired the capacity of genetic heredity, we propose and discuss possible mechanisms, basic aspects of the emergence and subsequent molecular evolution of translation and ribosomes, as well as enzymes as we know them today. It is possible, in this sense, to view the ribosome as a digital-to-analogue information converter. The proposed mechanism is based on the abilities and tendencies of short RNA and polypeptides to fold and to catalyse biochemical reactions. The proposed mechanism is in concordance with the hypothesis of a possible chemical co-evolution of RNA and proteins in the origin of the genetic code or even more generally at the early evolution of life on Earth. The possible abundance and availability of monomers at prebiotic conditions are considered in the mechanism. The hypothesis that early polypeptides were folding on the RNA scaffold is also considered and mutualism in molecular evolutionary development of RNA and peptides is favoured.","authors":["Marko Vitas","Andrej Dobovišek"],"meta":["June 2018Origins of Life and Evolution of Biospheres 48(1)","DOI:10.1007/s11084-018-9557-6","Project: I am an independent researcher. I do not have any formal projects or grants. However, I am following published literature on the Origin of Life topics."],"references":["321052104_Expanding_the_informational_chemistries_of_life_PeptideRNA_networks","320066372_Early_trace_of_life_from_395_Ga_sedimentary_rocks_in_Labrador_Canada","320047499_Methane_Fuel_or_Exhaust_at_the_Emergence_of_Life","319621563_Insuperable_problems_of_the_genetic_code_initially_emerging_in_an_RNA_World","318968611_The_Central_Symbiosis_of_Molecular_Biology_Molecules_in_Mutualism","318200591_Small_and_Random_Peptides_An_Unexplored_Reservoir_of_Potentially_Functional_Primitive_Organocatalysts_The_Case_of_Seryl-Histidine","344505280_The_endogenous_synthesis_of_organic_compounds","344501217_Clues_from_present-day_biology_the_thioester_world","344495803_Origin_of_life_in_an_iron-sulfur_world","322584676_Single-chain_Fvs","316909224_Ancestral_Interactions_of_Ribosomal_RNA_and_Ribosomal_Proteins","316477106_Ribosomal_proteins_as_documents_of_the_transition_from_unstructured_polypeptides_to_folded_proteins","316024943_Formation_of_nucleobases_in_a_Miller-Urey_reducing_atmosphere","315138114_Two_genetic_codes_Repetitive_syntax_for_active_non-coding_RNAs_non-repetitive_syntax_for_the_DNA_archives","315052808_Nucleic_acids_Function_and_potential_for_abiogenesis"]}