{"id":"324868974_EEG_based_epileptiform_pattern_recognition_inside_and_outside_the_seizure_states","abstract":"Automatic diagnosis of epilepsy by computers based on Electroencephalography (EEG) analysis is a beneficial practice which increases recognition rate, speeds up diagnosis and saves physicians from long hours of EEG inspection. Most studies on this subject report results on detecting seizures; but seizures, which appear during the ictal states are very rare to catch. Therefore, an efficient algorithm must be able to detect epilepsy during nonseizure periods, or in other words interictal states as well. We present a novel algorithm to detect epileptiform patterns during both states: ictal and interictal. For this purpose, we use wavelet packet analysis (WPA) rather than traditional time and frequency domain methods. WPA, by providing arbitrary time-frequency resolution, enables analyzing signals of stationary and non-stationary nature. It has better time representation than Fourier analysis and better high frequency resolution than Wavelet analysis. WPA subimages are analyzed further to obtain feature vectors of Log Energy Entropy, Norm Entropy and Energy. These features are fed into a classifier, multilayer perceptron (MLP). We test our method on a well-known and widely studied database which includes healthy, ictal and interictal EEG recordings. Normal vs. Ictal and Interictal vs. Ictal zone classifications are realized at 100% accuracy by using any of the three features. Nonseizure vs. Seizure state classification is realized with 100% accuracy using Norm entropy. Normal vs. Interictal zone classification is achieved with 100% accuracy using Log Energy Entropy. Normal vs. Interictal vs. Ictal Zone classifications are considered as two-step binary classifications of Nonseizure vs. Seizure state followed by Normal vs. Interictal zone both of which are realized at 100% accuracy. Therefore, jointly use of Log Energy Entropy and Norm entropy is able to realize all possible classifications with 100% accuracy. We make the most comprehensive comparison of results belonging to all possible classification categories reported on the same datasets. The proposed method outperforms all the other results in all possible classifications by achieving 100% accuracy in all possible classifications. The method presented is the only single method that achieves this. Overall, the method provides us with a promising tool for the detection of epileptiform patterns during and outside the seizure states.","authors":["Hüseyin Göksu"],"meta":["May 2018Biomedical Signal Processing and Control 43:204-215","DOI:10.1016/j.bspc.2018.03.004","Project: EEG Pattern Analysis"],"references":["308041451_Classification_of_epileptic_seizures_using_wavelet_packet_log_energy_and_norm_entropies_with_recurrent_Elman_neural_network_classifier","278039834_EMD-Based_Temporal_and_Spectral_Features_for_the_Classification_of_EEG_Signals_Using_Supervised_Learning","276394581_Epileptic_EEG_classification_using_nonlinear_parameters_on_different_frequency_bands","266263775_Epileptic_Seizure_Classification_of_EEG_Time-Series_Using_Rational_Discrete_Short-Time_Fourier_Transform","309371741_Automatic_epilepsy_detection_using_wavelet-based_nonlinear_analysis_and_optimized_SVM","280051077_Classification_of_EEG_signals_using_normal_inverse_Gaussian_parameters_in_the_dual-tree_complex_wavelet_transform_domain_for_seizure_detection","266375743_Automated_diagnosis_of_epileptic_EEG_using_entropies","265020979_Classification_of_seizure_and_seizure-free_EEG_signals_using_local_binary_patterns","262875516_1D-Local_Binary_Pattern_Based_Feature_Extraction_for_Classification_of_Epileptic_EEG_Signals","261960620_Automatic_EEG_seizure_detection_using_dual-tree_complex_wavelet-Fourier_features","258530382_Detection_of_Seizure_and_Epilepsy_Using_Higher_Order_Statistics_in_the_EMD_Domain","261917923_Epileptic_seizure_detection_in_EEGs_signals_using_a_fast_weighted_horizontal_visibility_algorithm","261701123_Classification_of_seizure_based_on_the_time-frequency_image_of_EEG_signals_using_HHT_and_SVM","260429269_Epileptic_seizure_detection_using_DWT_based_fuzzy_approximate_entropy_and_support_vector_machine","257404074_Use_of_principal_component_analysis_for_automatic_classification_of_epileptic_EEG_activities_in_wavelet_framework"]}