{"id":"324867318_Automated_defect_detection_tool_for_closed_circuit_television_cctv_inspected_sewer_pipelines","abstract":"In sewer networks, the economic effects and costs that result from a pipeline failure are rising sharply. As a result, there is huge demand for inspection and rehabilitation of sewer pipelines. In addition to being inaccurate, current practices of sewer pipelines inspection are time consuming and may not keep up with the deterioration rates of the pipelines. This papers presents the development of an automated tool to detect some defects such as: cracks, deformation, settled deposits and joint displacement in sewer pipelines. The automated approach is dependent upon using image-processing techniques and several mathematical formulas to analyze output data from Closed Circuit Television (CCTV) camera images. The automated tool was able to detect cracks, displaced joints, ovality and settled deposits in pipelines using CCTV camera inspection output footage using two different datasets. To examine the performance of the proposed detection methodology, confusion matrices were constructed, in which true positives for crack, settled deposits and displaced joints were 74%, 53% and 65%. As for the ovality, all defects in the images were detected successfully. Although these values could indicate low performance, however the proposed methodology could be improved if additional images were used. Given that one inspection session can result in hundreds of CCTV camera footage, introducing an automated tool would help yield faster results. Additionally, given the subjective nature of evaluating the severity of defects, it would result in more systematic outputs since the current method rely heavily on the operator's experience.","authors":["Alaa Al Hawari","Mazen Alamin","Firas Alkadour","Mohamed Elmasry"],"meta":["May 2018Automation in Construction 89:99-109","DOI:10.1016/j.autcon.2018.01.004"],"references":["307722909_A_New_Image-Based_Model_For_Predicting_Cracks_In_Sewer_Pipes","306928115_Automated_Detection_of_Faults_in_Wastewater_Pipes_from_CCTV_Footage_by_Using_Random_Forests","273616769_Fat_Oil_and_Grease_Accumulation_in_Sewer_Systems_Comprehensive_Survey_of_Experiences_of_Scandinavian_Municipalities","224267815_Robust_segmentation_of_vessels_from_retinal_angiography","44742953_Video_Processing_Techniques_for_Assisted_CCTV_Inspection_and_Condition_Rating_of_Sewers","3191952_Estimation_of_Planar_Curves_Surfaces_and_Nonplanar_Space_Curves_Defined_by_Implicit_Equations_with_Applications_to_Edge_and_Range_Image_Segmentation","2354546_Adaptively_Sampled_Distance_Fields_A_General_Representation_of_Shape_for_Computer_Graphics","276853078_Automated_defect_detection_in_textured_surfaces_using_optimal_elliptical_Gabor_filters","245289368_Challenging_Issues_in_Modeling_Deterioration_of_Combined_Sewers","232203667_A_Threshold_Selection_Method_From_Gray-Level_Histograms","223284696_Neuro-fuzzy_network_for_the_classification_of_buried_pipe_defects","220217702_Morphological_segmentation_based_on_edge_detection_for_sewer_pipe_defects_on_CCTV_images"]}