{"id":"324854180_E-Business_the_impact_of_regional_growth_on_the_improvement_of_Information_and_Communication_Development","abstract":"ICT becomes a key element to improve industrial infrastructure efficiency and sustainable economic productivity. This study aims to analysis the impact of regional improvement on information and communication development in Indonesia. This research is a correlational study. Population of this research include 151 regions in Indonesia. By using a total sampling, there were 151 sample regions. The results show there are the strong impact of regional growth on increasing Gross Regional Domestic Product (GRDP) of information and communication. It can be seen from all regional improvement sub variables that have a high correlation in increasing GRDP of Information and Communication in Indonesia. Only two sub-variables that have low correlation to GRDP of Information and Communication variable i.e. GRDP of Agriculture, Forestry and Fishing (0.01) and GRDP of Mining and Quarrying (0.04). The correlation coefficient (R) is 0.981, means the variable of information and communication GRDP has a very strong correlation with regional growth variable. Thus the value of Adjusted R Square is 95.8%, means there are impact of regional growth variables in increasing GRDPof Information and Communication, while the increase of 4.2% of Information and Communication GRDP is influenced by other factors aside from regional improvement.","authors":["MI Setiawan","C Hasyim","N Kurniasih","Dahlan Abdullah"],"meta":["April 2018Journal of Physics Conference Series 1007(1):012044","DOI:10.1088/1742-6596/1007/1/012044","Project: Computer Science"],"references":["321798937_Impact_of_GDP_Information_Technology_in_Developing_of_Regional_Central_Business_Case_50_Airports_IT_City_Development_in_Indonesia","283974167_Points_of_Significance_Simple_linear_regression","277339263_Dependency_on_un-captured_GDP_as_a_source_of_resilience_beyond_economic_value_in_countries_with_advanced_ICT_infrastructure_Similarities_and_disparities_between_Finland_and_Singapore","270293577_New_paradigm_of_ICT_productivity_-_Increasing_role_of_un-captured_GDP_and_growing_anger_of_consumers","268992343_Applied_Linear_Regression","264669919_Linear_regression","234814904_The_Global_Information_Technology_Report_2005-2006_Leveraging_ICT_for_Development_World_Economic_Forum_Reports"]}