{"id":"324843761_ONS_An_ontology_for_a_standardized_description_of_interventions_and_observational_studies_in_nutrition","abstract":"Background\nThe multidisciplinary nature of nutrition research is one of its main strengths. At the same time, however, it presents a major obstacle to integrate data analysis, especially for the terminological and semantic interpretations that specific research fields or communities are used to. To date, a proper ontology to structure and formalize the concepts used for the description of nutritional studies is still lacking.\n\nResults\nWe have developed the Ontology for Nutritional Studies (ONS) by harmonizing selected pre-existing de facto ontologies with novel health and nutritional terminology classifications. The ONS is the result of a scholarly consensus of 51 research centers in nine European countries. The ontology classes and relations are commonly encountered while conducting, storing, harmonizing, integrating, describing, and searching nutritional studies. The ONS facilitates the description and specification of complex nutritional studies as demonstrated with two application scenarios.\n\nConclusions\nThe ONS is the first systematic effort to provide a solid and extensible formal ontology framework for nutritional studies. Integration of new information can be easily achieved by the addition of extra modules (i.e., nutrigenomics, metabolomics, nutrikinetics, and quality appraisal). The ONS provides a unified and standardized terminology for nutritional studies as a resource for nutrition researchers who might not necessarily be familiar with ontologies and standardization concepts.\n\nElectronic supplementary material\nThe online version of this article (10.1186/s12263-018-0601-y) contains supplementary material, which is available to authorized users.","authors":["Francesco Vitali","Rosario Lombardo","Damariz Rivero","Fulvio Mattivi"],"meta":["April 2018Genes & Nutrition 13(1)","DOI:10.1186/s12263-018-0601-y","Project: European Nutrition Phenotype Assessment and Data Sharing Initiative (ENPADASI)"],"references":["323441705_Joint_Data_Analysis_in_Nutritional_Epidemiology_Identification_of_Observational_Studies_and_Minimal_Requirements","320122390_Dietary_and_health_biomarkers-time_for_an_update","319859230_Perspective_Essential_Study_Quality_Descriptors_for_Data_from_Nutritional_Epidemiologic_Research","316016960_Worldwide_trends_in_blood_pressure_from_1975_to_2015_a_pooled_analysis_of_1479_population-based_measurement_studies_with_191_million_participants","309153173_Ontobee_A_linked_ontology_data_server_to_support_ontology_term_dereferencing_linkage_query_and_integration","307557235_Evolution_of_biomedical_ontologies_and_mappings_Overview_of_recent_approaches","320382470_Omega-6_fatty_acid_biomarkers_and_incident_type_2_diabetes_Pooled_analysis_of_individual-level_data_for_39_740_adults_from_20_prospective_cohort_studies","319394161_Resource_Description_Framework_RDF_Model_and_Syntax_Specification","319226404_The_food_classification_and_description_system_FoodEx_2_draft-revision_1","315510805_Omega-6_Fatty_Acid_Biomarkers_and_Incident_Type_2_Diabetes_A_Pooled_Analysis_of_20_Cohort_Studies"]}