{"id":"324818140_A_Afetividade_na_Educacao_Online_Percursos_e_Possibilidades","abstract":"p>O artigo aprofunda conhecimentos sobre a afetividade na educação online, considerando o afeto, a interatividade, a colaboração, a coautoria e a aprendizagem significativa como fatores preponderantes para o sucesso na modalidade. O método é a pesquisa-formação na cibercultura, que não separa a docência do ato de pesquisar. Não há centralidade no docente, nos conteúdos, nas tecnologias nem nos praticantes ciberculturais; a centralidade está na rede que se forma entre todas essas interlocuções. O contexto foi o curso de extensão Formação de Docentes para a Educação Online ministrado no Instituto Federal do Rio de Janeiro, campus Belford Roxo, em que ambiências formativas e dispositivos de pesquisa na educação online foram acionados para compreender as questões norteadoras do estudo. Como achado da pesquisa, tem-se a noção subsunçora “Atividades síncronas: pertencimento e afetividade”, emergente das narrativas dos praticantes, dodiálogo bibliográfico, da imersão nocotidiano da pesquisa e do dispositivo “síncrono ou assíncrono? Eis a questão...”, acionado utilizando um fórum de discussão para que mais dados sobre a afetividade pudessem emergir. O achado da pesquisa proporciona saberes para melhores práticas como docentes online, assunto de extrema importância para a Educação em contexto de cibercultura.\n\nPalavras-chave: Afetividade, Educação Online, Pesquisa-formação, Cibercultura.\n\nThe Affectivity in Online Education: Paths and Possibilities \n\nAbstract \n\nThe article deepens knowledge about affectivity in online education, considering affection, along with interactivity, collaboration, co-authorship and meaningful learning as preponderant factors for success in the modality. The method is research-formation in cyberculture, which does not separate teaching from the act of researching. There is no centrality in the teacher, in the contents, in the technologies and in the cybercultural practitioners, the centrality is in the network that forms among all these interlocutions. The context was the Extension Course \"Teacher Education for Online Education\", taught at the Federal Institute of Rio de Janeiro, Campus Belford Roxo, where formation environments and research devices in online education were used to understand the guiding questions of the study. As a result of the research, the subscriber notion \"Synchronous activities: belonging and affectivity\" emerges from the narratives of the practitioners, from the bibliographic dialogue, from the immersion in the daily routine of research and from the \"synchrono orassynchrono\" device. Here's the question ...\" triggered using a discussion forum so that more data on affectivity could emerge. The finding of the research provides knowledge for best practices as online teachers, a subject of extreme importance for education in the context of cyberculture.\n\nKeywords: Affectivity, Online Education, Research-formation, Cyberculture</p","authors":["Vivian Martins","Adriana Baptista"],"meta":["April 2018","DOI:10.18264/eadf.v8i1.639"],"references":["326699676_Visual_Storytelling_e_Pesquisa-formacao_na_Cibercultura","299999601_Mediacao_docente_online_para_colaboracao_notas_de_uma_pesquisa-formacao_na_cibercultura","224982520_O_misterio_da_consciencia_do_corpo_e_das_emocoes_ao_conhecimento_de_si","49303773_Pedagogia_del_Oprimido"]}