{"id":"324895946_Competency_Maps_an_Effective_Model_to_Integrate_Professional_Competencies_Across_a_STEM_Curriculum","abstract":"Curricula designed in the context of the European Higher Education Area need to be based on both domain-specific and professional competencies. Whereas universities have had extensive experience in developing students’ domain-specific competencies, fostering professional competencies poses a new challenge we need to face. This paper presents a model to globally develop professional competencies in a STEM (science, technology, engineering, and mathematics) degree program, and assesses the results of its implementation after 4 years. The model is based on the use of competency maps, in which each competency is defined in terms of competency units. Each competency unit is described by a set of expected learning outcomes at three domain levels. This model allows careful analysis, revision, and iteration for an effective integration of professional competencies in domain-specific subjects. A global competency map is also designed, including all the professional competency learning outcomes to be achieved throughout the degree. This map becomes a useful tool for curriculum designers and coordinators. The results were obtained from four sources: (1) students’ grades (classes graduated from 2013 to 2016, the first 4 years of the new Bachelor’s Degree in Informatics Engineering at the Barcelona School of Informatics); (2) students’ surveys (answered by students when they finished the degree); (3) the government employment survey, where former students evaluate their satisfaction of the received training in the light of their work experience; and (4) the Everis Foundation University-Enterprise Ranking, answered by over 2000 employers evaluating their satisfaction regarding their employees’ university training, where the Barcelona School of Informatics scores first in the national ranking. The results show that competency maps are a good tool for developing professional competencies in a STEM degree.","authors":["Fermín Sánchez-Carracedo","Antonia Soler","Carme Martín","David Lopez"],"meta":["May 2018Journal of Science Education and Technology 27(6)","DOI:10.1007/s10956-018-9735-3","Project: Appropiate Attitude towards Work Generic Competency"],"references":["299507876_Communication_Skills_for_the_21st_Century_Engineer","284158538_Identifying_21st_Century_STEM_Competencies_Using_Workplace_Data","273395455_A_Smart_Home_Test_Bed_for_Undergraduate_Education_to_Bridge_the_Curriculum_Gap_From_Traditional_Power_Systems_to_Modernized_Smart_Grids","320656385_Investigating_the_Perception_of_Stakeholders_on_Soft_Skills_Development_of_Students_Evidence_from_South_Africa","314146193_El_impacto_de_la_evaluacion_educativa_en_el_desarrollo_de_competencias_en_la_universidad_La_perspectiva_de_las_primeras_promociones_de_graduados","284825902_The_Bayer_Facts_of_Science_Education_XVI_US_STEM_Workforce_Shortage-Myth_or_Reality_Fortune_1000_Talent_Recruiters_on_the_Debate","275837294_Adapting_Team-Based_Learning_for_Application_in_the_Basic_Electric_Circuit_Theory_Sequence","270631717_Analysis_of_Introducing_Active_Learning_Methodologies_in_a_Basic_Computer_Architecture_Course","264268495_Which_ABET_Competencies_Do_Engineering_Graduates_Find_Most_Important_in_their_Work","259334309_Implementation_of_a_Project-Based_Telecommunications_Engineering_Design_Course","229010973_Development_of_Professional_Competencies_in_Engineering_Education","247699381_Taxonomy_o_f_Educational_Objectives_Cognitive_Domain","237253558_The_ABET_'professional_skills'-Can_they_be_taught_Can_they_be_assessed","234118102_Rethinking_Engineering_Education_The_CDIO_Approach","227036224_Harnessing_the_Environmental_Professional_Expertise_of_Engineering_Students-The_Course_Environmental_Management_Systems_in_the_Industry"]}