{"id":"324807177_Embedded_Fuzzy_Bilingual_Dictionary_model_for_cross_language_information_retrieval_systems","abstract":"The goal of Cross language information Retrieval (CLIR) is the mapping of query written in one language (source language) to document collection in another language (target language). Over the years, CLIR employs approaches like dictionary translation, machine translations and query expansion to output documents based on users query. While relevance of retrieved document ranks high for the success of any Information Retrieval operation, obtaining relevance is encumbered with several issues compounded by the methods employed in CLIR. Thus, the research examines some of these existing methods in CLIR towards extending the dictionary translator and query expansion model. Here, a Fuzzy Bilingual Dictionary (FBD) with a dual concept driven document-clustering technique was proposed with a bid to retrieve more relevant document across language. The resulting model was tested on 3000 dataset of computer science related articles with queries posed in Yoruba language. A better recall and precision rate of the retrieval operation was achieved from the experiments.","authors":["Olufade Falade Williams Onifade","Ayodeji Ibitoye","Pabitra Mitra"],"meta":["April 2018International Journal of Information Technology 10(1)","DOI:10.1007/s41870-018-0181-5","Project: Information Retreival"],"references":["294579479_Fuzzy_Latent_Semantic_Query_Expansion_Model_for_Enhancing_Information_Retrieval","277786219_Efficient_query_expansion","271543840_Retrieving_haystacks_A_data_driven_information_needs_model_for_faceted_search","265231841_Twelve_years_of_measuring_linguistic_diversity_in_the_Internet_Balance_and_perspectives","228921156_Human_Language_Technologies","314002752_Cross-Language_Information_Retrieval","308161218_Introduction_to_information_retrieval_chapt","276935841_Introduction_to_Information_Retrieval","267834185_Localising_for_Yoruba_Experience_Challenges_and_Future_Direction","267770300_Indian_Languages_IR_using_Latent_Semantic_Indexing"]}