{"id":"324819869_From_Machine_Ethics_To_Machine_Explainability_and_Back","abstract":"We find ourselves surrounded by a rapidly increasing number of autonomous and semi-autonomous systems. Two grand challenges arise from this development: Machine Ethics and Machine Explainability. Machine Ethics, on the one hand, is concerned with behavioral constraints for systems, set up in a formal unambiguous, algorithmizable, and implementable way, so that morally acceptable, restricted behavior results; Machine Explainability, on the other hand, enables systems to explain their actions and argue for their decisions, so that human users can understand and justifiably trust them. In this\npaper, we stress the need to link and cross-fertilize these two areas. We point out how Machine Ethics calls for Machine Explainability, and how Machine Explainability\ninvolves Machine Ethics. We develop both these facets based on a toy example from the context of medical care robots. In this context, we argue that moral behavior, even if it were verifiable and verified, is not enough to establish justified trust in an autonomous system. It needs to be supplemented with the ability to explain decisions and should thus be supplemented by a Machine Explanation component. Conversely, such explanations need to refer to the system’s model- and constraint-based Machine Ethics reasoning. We propose to apply a framework of formal argumentation theory for the task of generating useful explanations of the Machine Explanation component and we sketch out how the content of the arguments must use the moral reasoning of the Machine Ethics component.","authors":["Timo Speith","Holger Hermanns","Kevin Baum"],"meta":["January 2018","Conference: International Symposium on Artificial Intelligence and MathematicsAt: Fort Lauderdale, FL."],"references":["320041658_An_Essay_on_Self-explanatory_Computational_Intelligence_A_Linguistic_Model_of_Data_Processing_Systems","301293464_The_Social_Dilemma_of_Autonomous_Vehicles","322587792_Requirements_for_Conceptual_Representations_of_Explanations_and_How_Reasoning_Systems_Can_Serve_Them","320195668_Two_Challenges_for_CI_Trustworthiness_and_How_to_Address_Them","317101045_Formal_Guarantees_on_the_Robustness_of_a_Classifier_against_Adversarial_Manipulation","317061784_Adversarial_Examples_Are_Not_Easily_Detected_Bypassing_Ten_Detection_Methods","315341515_Is_Your_Software_on_Dope","308894556_Facets_of_Software_Doping","308894060_What_the_Hack_Is_Wrong_with_Software_Doping","299725386_Friendly_Artificial_Intelligence"]}