{"id":"324805716_Quasi-cyclic_multi-edge_LDPC_codes_for_long-distance_quantum_cryptography","abstract":"The speed at which two remote parties can exchange secret keys in continuous-variable quantum key distribution (CV-QKD) is currently limited by the computational complexity of key reconciliation. Multi-dimensional reconciliation using multi-edge low-density parity-check (LDPC) codes with low code rates and long block lengths has been shown to improve error-correction performance and extend the maximum reconciliation distance. We introduce a quasi-cyclic code construction for multi-edge codes that is highly suitable for hardware-accelerated decoding on a graphics processing unit (GPU). When combined with an 8-dimensional reconciliation scheme, our LDPC decoder achieves an information throughput of 7.16 Kbit/s on a single NVIDIA GeForce GTX 1080 GPU, at a maximum distance of 142 km with a secret key rate of 6.64 × 10−8 bits/pulse for a rate 0.02 code with block length of 106 bits. The LDPC codes presented in this work can be used to extend the previous maximum CV-QKD distance of 100 km to 142 km, while delivering up to 3.50× higher information throughput over the tight upper bound on secret key rate for a lossy channel. Improvements in the post-processing algorithms for quantum cryptography can extend the secure transmission distance by over 40%. Quantum key distribution protocols rely on the transmission of quantum states, but also on classical post-processing to eliminate errors introduced by imperfect equipment or the interference of an attacker. Over long distances, the requirements of this classical 'reconciliation' processing can become the bottleneck for key exchange. Mario Milicevic and colleagues from the University of Toronto and the University of British Columbia in Canada have developed a high-throughput error correction scheme that increases the potential operating range for quantum key distribution from 100 to 143 km. Their method is fast enough that the rate of key distribution is instead limited by the physical properties of the communication channel.","authors":["Mario Milicevic","Chen Feng","Lei M. Zhang","P. Glenn Gulak"],"meta":["December 2018npj Quantum Information 4(1)","DOI:10.1038/s41534-018-0070-6"],"references":["316489767_Fundamental_limits_of_repeaterless_quantum_communications","307894849_Continuous-variable_quantum_key_distribution_based_on_a_plug-and-play_dual-phase-modulated_coherent-states_protocol","304271794_Measurement_device_independent_quantum_key_distribution_over_404_km_optical_fibre","303970143_Integrated_Silicon_Photonic_Transmitter_for_Polarization-Encoded_Quantum_Key_Distribution","317947260_Experimental_study_on_all-fiber-based_unidimensional_continuous-variable_quantum_key_distribution","316638843_Continuous_variable_quantum_key_distribution","314982289_High-efficiency_reconciliation_for_continuous_variable_quantum_key_distribution","311805845_Integrated_Silicon_Photonics_for_High-Speed_Quantum_Key_Distribution","304163871_Practical_challenges_in_quantum_key_distribution","301709765_Repeat-accumulate_codes_for_reconciliation_in_continuous_variable_quantum_key_distribution"]}