{"id":"324854452_E-Business_The_impact_of_the_Regional_Government_Development_APBD_on_Information_and_Communication_Development_in_Indonesia","abstract":"The decline of development delived from natural resources in several regions in Indonesia requires local governments to make a breakthrough in increasing revenues beyond natural resources, including through increased revenue in the field of information technology. The purpose of this study is to analyze the impact of the regional government development (APBD) on information and communication development in Indonesia. By using correlational research, it is known that all of APBD sub variables have a high correlation in increasing Gross Regional Domestic Product (GRDP) of Information and Communication in Indonesia, only sub-variable of surplus/deficit development, unexpected development sub-variable, subvariable of development aid to province/regency/city and village government, and sub-variable of development special allocations that have not a significant correlation to increase of GRDP of Information and Communication in Indonesia. There is 86,7% of APBD variable influence the increase of GRDP of Information and Communication, while the increase of 15,3% of Information and Communication GRDP influenced by other factors aside from APBD. It shows the strong impact of APBD on increasing GRDP of Information and Communication","authors":["M I Setiawan","C Hasyim","N Kurniasih","Dahlan Abdullah"],"meta":["April 2018Journal of Physics Conference Series 1007(1):012045","DOI:10.1088/1742-6596/1007/1/012045","Project: Computer Science"],"references":["321798937_Impact_of_GDP_Information_Technology_in_Developing_of_Regional_Central_Business_Case_50_Airports_IT_City_Development_in_Indonesia","318715630_The_linear_and_non-linear_impacts_of_ICT_on_economic_growth_of_disaggregate_income_groups_within_SSA_region","318224385_Measuring_in_a_time_of_crisis_the_impact_of_broadband_connections_on_economic_growth_an_OECD_panel_analysis","316154543_The_Impact_of_Broadband_Infrastructure_on_Economic_Growth_in_Some_Arab_and_Emerging_Countries","305266949_Estimation_of_urban_infrastructure_demand_with_consideration_of_urban_characteristics","285390785_Regression","283974167_Points_of_Significance_Simple_linear_regression","268992343_Applied_Linear_Regression","264669919_Linear_regression","44415974_Applied_linear_regression_Sanford_Weisberg"]}