{"id":"324892205_Online_Hunting_Gathering_and_Sharing_-_A_Return_to_Experiential_Learning_in_a_Digital_Age","abstract":"p class=\"3\">Learning through a collective experience by taking part in group activities, such as hunting, gathering, and sharing, has always been a natural, “organic,” and “experiential” process where new skills and knowledge, if benefitting the whole group, are accepted, shared, and propagated. Nevertheless, in industrialized societies where specific knowledge and skills are an economical and societal necessity, the learning economy has largely moved to a model where the teachers “harvest” selected knowledge and “put it in a basket” from which students are expected to take from and learn. This learning model has permeated the 21st century digital world, where the main promoted advantage of these new learning environments is still the “individualization of learning,” which can result in a very solitary and isolated endeavor; however, it doesn’t have to be the case. An example of a successful online university course suggests that carefully crafted online instructional design strategies can contribute to a flexible and rich experiential learning environment. Although they might be physically disconnected, it is possible for learners and a teacher to remain closely interconnected, engaged, and accountable for both individual and group success in knowledge \"hunting, gathering, and sharing\" activities in a digital age.</p","authors":["Maristela Petrovic-Dzerdz","Anne Trépanier"],"meta":["May 2018International Review of Research in Open and Distance Learning 19(2)","DOI:10.19173/irrodl.v19i2.3732"],"references":["272177799_Why_Minimal_Guidance_During_Instruction_Does_Not_Work_An_Analysis_of_the_Failure_of_Constructivist_Discovery_Problem-Based_Experiential_and_Inquiry-Based_Teaching","283968398_Play_as_a_foundation_for_hunter-gatherer_social_existence","279329299_Technology-Based_Experiential_Learning_A_Transnational_Experiment","242124970_Conceptual_Foundations_for_an_Evolutionary_Educational_Psychology"]}