{"id":"324977554_Students_and_Teachers_Attitudes_and_Satisfaction_toward_E-Learning_A_Case_Study_in_Egypt","abstract":"E-learning is an important technological tool that is used by higher educational institutions worldwide to enhance the quality of teaching and learning. However, assessing the attitudes and satisfaction of students and teachers of such a system is becoming increasingly important to its success as it presents a new learning environment for them. The aim of this study therefore was to try to determine Egyptian student attitudes and satisfaction and Egyptian teachers’ satisfaction and perception of the usefulness of E-learning in the Faculty of Informatics and Computer Science at the British University in Egypt. Data were gathered from two sources: a student questionnaire and a teacher questionnaire. The findings of this study have shown that a) there were no significant differences between male and female students and the different degree years in their attitudes to and use of E-learning; b) the Preparatory Year appear to be less satisfied with the activities and teacher feedback on E-learning in comparison with the other degree years and c) teachers are satisfied with E-learning and regard it as a useful tool as it complements face-to-face teaching and saves them valuable time. The findings of this study will benefit academics and decision-makers involved in developing and implementing E-learning strategies in higher education institutions in the Middle East and North African regions.\nKeywords: E-learning technology; students’ perspective; teachers’ perspective; higher education; attitudes and satisfaction.","authors":["Pauline Ghenghesh","Leslie Croxford","Khaled Ahmed Nagaty"],"meta":["January 2018","DOI:10.12816/0044059"],"references":["308962767_Students'_acceptance_and_readiness_for_E-learning_in_Northeastern_Thailand","274704352_Students'_Perceptions_Towards_Blended_Learning_Environment_Using_the_OCC","270608170_Attitude_of_University_Students_towards_E-learning_in_West_Bengal","268343753_UNDERSTANDING_STUDENTS'_ATTITUDES_TOWARD_E-LEARNING_EVIDENCE_FROM_BRUNEIAN_VOCATIONAL_AND_TECHNICAL_EDUCATION","266482075_Evaluating_Student_Satisfaction_with_Blended_Learning_in_a_Gender-Segregated_Environment","280048690_Attitude_of_Students_Towards_E-learning_in_South-West_Nigerian_Universities_An_Application_of_Technology_Acceptance_Model","270412730_Modeling_Key_Drivers_of_E-Learning_Satisfaction_among_Student_Teachers","232593787_Course_work_characteristics_and_students'_satisfaction_with_instruction","229881344_An_empirical_investigation_of_students'_behavioural_intentions_to_use_the_online_learning_course_websites","222937513_What_drives_a_successful_e-Learning_An_empirical_investigation_of_the_critical_factors_influencing_learner_satisfaction"]}