{"id":"324958631_A_distributed_density_optimized_scheduling_function_for_IEEE_802154e_TSCH_networks","abstract":"The Industrial Internet of Things is a challenge for wireless sensor networks, where ultrareliability, guaranteed performance, and ultralow‐power consumption are mandatory requirements to enable critical IoT applications. The time‐slotted channel hopping (TSCH) mode of the IEEE 802.15.4e standard is one of the most promising technologies to accomplish these requirements by yielding guaranteed performance and, simultaneously, efficiently combating external interference and multipath fading. One of the challenges in TSCH networks is to build an efficient schedule for managing the access of the nodes to the timeslots and channels. Several scheduling algorithms have been proposed. Currently, the Scheduling Function Zero SFx is one of the proposed scheduling algorithms for 6TiSCH, the ongoing standard for an IPv6‐enabled stack working over TSCH. SFx is based on random resource allocation according to the traffic demand, which makes it inadequate for large‐scale and dense deployments due to internal collisions. This paper has two main goals. First, we extensively investigate the performance of SFx for large‐scale and dense scenarios, analyze its scalability, and identify its scheduling limitations. Second, we present a new TSCH‐based scheduling function, ie, the distributed broadcast‐based scheduling (DeBraS) algorithm, a scheduling solution designed for dense deployments based on sharing scheduling information between nodes to reduce collisions proactively. We show, through extensive and large‐scale simulations, that DeBraS supports much larger densities than state‐of‐the‐art scheduling functions, outperforming the current distributed 6TiSCH algorithm SFx up to 1.61 times in terms of throughput for large network sizes, at the expense of an increase in power consumption.","authors":["Esteban Municio","Kathleen Spaey","Steven Latré"],"meta":["May 2017Transactions on Emerging Telecommunications Technologies 29(12)","DOI:10.1002/ett.3420"],"references":["320950303_ReSF_Recurrent_Low-Latency_Scheduling_in_IEEE_802154e_TSCH_networks","317278951_Minimal_IPv6_over_the_TSCH_Mode_of_IEEE_802154e_6TiSCH_Configuration","308841729_Decentralized_broadcast-based_scheduling_for_dense_multi-hop_TSCH_networks","304663495_TDMA_scheduling_problem_avoiding_interference_in_multi-hop_wireless_sensor_networks","317357473_CCR_Cost-aware_cell_relocation_in_6TiSCH_networks","316823963_Principles_of_Mobile_Communication","315382711_Distributed_Cell_Selection_for_Scheduling_Function_in_6TiSCH_Networks","306062272_LLSF_Low_Latency_Scheduling_Function_for_6TiSCH_Networks","305910056_A_Model-based_Beacon_Scheduling_algorithm_for_IEEE_802154e_TSCH_networks","304295721_Experimental_evaluation_of_IETF_6TiSCH_in_the_context_of_Smart_Grid"]}