{"id":"324922764_Estrategia_para_la_evaluacion_de_escenarios_de_despliegue_del_Sistema_de_Informacion_Hospitalaria_XAVIA_HIS_en_instituciones_de_salud","abstract":"El Centro de Informática médica (CESIM) de la Universidad de las Ciencias Informáticas (UCI) desarrolla el Sistema de Información Hospitalaria XAVIA HIS, el cual es un producto que tienen como objetivo satisfacer las necesidades de generación de información, para almacenar, procesar y reinterpretar datos médico-administrativos de cualquier institución de salud. Además, permite la optimización de los recursos humanos y materiales y facilita la toma de decisiones clínico-administrativas. Es de gran importancia para el CESIM el éxito en una implantación del sistema XAVIA HIS, no obstante, estos proyectos de implantación se han visto incididos por un conjunto de insuficiencias que han provocado grandes personalizaciones con demora excesiva de tiempo, complejidad y cantidad de cambios identificados, así como gasto considerable de recursos humanos. El objetivo de la investigación es desarrollar una estrategia para la evaluación de escenarios de despliegue del sistema XAVIA HIS, en organizaciones e instituciones de salud, que per-mita mejorar el alcance de los proyectos de implantación. Para ello se realizó un estudio descriptivo, que incluyó como escenario de aplicación el Centro Nacional de Cirugía de Mínimo Acceso, en el periodo comprendido de abril de 2015 a diciembre de 2017. Como resultado se obtuvo una estrategia para la evaluación de escenarios de despliegue del Sistema de Información Hospitalaria XAVIA HIS en instituciones de salud, que impacta positivamente en la disminución del tiempo de implantación, así como en la adecuación de los procesos asistenciales implementados en el sistema XAVIA HIS, que se llevan a cabo en los centros de salud.","authors":["Maylevis Morejón Valdés","José Felipe Ramírez Pérez"],"meta":["April 2018","Conference: Convención Internacional de Salud Pública, Cuba Salud 2018At: La habana, Cuba","Project: eVitae, cuban platform of electronic health record"],"references":["311974182_PMBOK_y_PRINCE_2_similitudes_y_diferencias"]}