{"id":"324928208_Real-Time_Fault_Detection_and_Identification_for_MMC_Using_1-D_Convolutional_Neural_Networks","abstract":"Automated early detection and identification of switch faults are essential in high-voltage applications. Modular multilevel converter (MMC) is a new and promising topology for such applications. MMC is composed of many identical controlled voltage sources called modules or cells. Each cell may have one or more switches and a switch failure may occur in anyone of these cells. The steady-state normal and fault behavior of a cell voltage will also significantly vary according to the changes in the load current and the fault timing. This makes it a challenging problem to detect and identify such faults as soon as they occur. In this study, we propose a real-time and highly accurate MMC circuit monitoring system for early fault detection and identification using adaptive 1D Convolutional Neural Networks (CNNs). The proposed approach is directly applicable to the raw voltage and current data and thus eliminates the need for any feature extraction algorithm, resulting in a highly efficient and reliable system. Simulation results obtained using a 4-cell, 8-switch MMC topology demonstrate that the proposed system has a high reliability to avoid any false alarm and achieves a detection probability of 0.989, and average identification probability of 0.997 in less than 100 ms.","authors":["Serkan Kiranyaz","Adel Gastli","L. Ben-Brahim","Nasser Alemadi"],"meta":["May 2018IEEE Transactions on Industrial Electronics PP(99):1-1","DOI:10.1109/TIE.2018.2833045","Project: We are now working on machine learning and pattern recognition for big media data analytics."],"references":["309834298_Real-Time_Vibration-Based_Structural_Damage_Detection_Using_One-Dimensional_Convolutional_Neural_Networks","304550799_Real-Time_Motor_Fault_Detection_by_1D_Convolutional_Neural_Networks","281081141_Real-Time_Patient-Specific_ECG_Classification_by_1D_Convolutional_Neural_Networks","277411157_Deep_Learning","265612288_Fault_Detection_and_Localization_Method_for_Modular_Multilevel_Converters","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","291388723_Modular_Multilevel_Converter_Circulating_Current_Reduction_Using_Model_Predictive_Control","261247663_Fault_Detection_and_Remedy_of_Multilevel_Inverter_Based_on_BP_Neural_Network","260496672_Fault_Detection_for_Modular_Multilevel_Converters_Based_on_Sliding_Mode_Observer","241908660_Fault_diagnosis_system_for_a_multilevel_inverter_using_a_neural_network"]}