{"id":"324963632_Pulmonary_Artery-Vein_Classification_in_CT_Images_Using_Deep_Learning","abstract":"Recent studies show that pulmonary vascular diseases may specifically affect arteries or veins through different physiologic mechanisms. To detect changes in the two vascular trees, physicians manually analyze the chest computed tomography (CT) image of the patients in search of abnormalities. This process is time-consuming, difficult to standardize and thus not feasible for large clinical studies or useful in real-world clinical decision making. Therefore, automatic separation of arteries and veins in CT images is becoming of great interest, as it may help physicians accurately diagnose pathological conditions. In this work, we present a novel, fully automatic approach to classifying vessels from chest CT images into arteries and veins. The algorithm follows three main steps: first, a scale-space particles segmentation to isolate vessels; then a 3D convolutional neural network (CNN) to obtain a first classification of vessels; finally, graph-cuts (GC) optimization to refine the results. To justify the usage of the proposed CNN architecture, we compared different 2D and 3D CNNs that may use local information from bronchus- and vessel-enhanced images provided to the network with different strategies. We also compared the proposed CNN approach with a Random Forests (RF) classifier. The methodology was trained and evaluated on the superior and inferior lobes of the right lung of eighteen clinical cases with non-contrast chest CT scans, in comparison with manual classification. The proposed algorithm achieves an overall accuracy of 94%, which is higher than the accuracy obtained using other CNN architectures and RF. Our method was also validated with contrast-enhanced CT scans of patients with Chronic Thromboembolic Pulmonary Hypertension (CTEPH) to demonstrate that our model generalizes well to contrast-enhanced modalities. The proposed method outperforms state-of-the-art methods, paving the way for future use of 3D CNN for A/V classification in CT images.","authors":["Pietro Nardelli","Daniel Jimenez-Carretero","David Bermejo-Pelaez","George R. Washko"],"meta":["May 2018IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2018.2833385"],"references":["308203358_Arterial_and_Venous_Pulmonary_Vascular_Morphology_and_Their_Relationship_to_Findings_in_Cardiac_Magnetic_Resonance_Imaging_in_Smokers","303657108_TensorFlow_A_system_for_large-scale_machine_learning","302059515_Automated_Integer_Programming_Based_Separation_of_Arteries_and_Veins_from_Thoracic_CT_Images","301839500_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","293013941_Pulmonary_vascular_morphology_as_an_imaging_biomarker_in_chronic_thromboembolic_pulmonary_hypertension","322277018_Tensorflow_Large-scale_machine_learning_on_heterogeneous_distributed_systems","317724908_Deep-learning_strategy_for_pulmonary_artery-vein_classification_of_non-contrast_CT_images","303605804_On_the_shortest_spanning_subtree_of_a_graph_and_the_traveling_salesman_problem","288906520_Random_forests","283932747_Data-Dependent_Higher-Order_Clique_Selection_for_Artery-Vein_Segmentation_by_Energy_Minimization"]}