{"id":"324900571_L'impact_des_formations_continues_a_distance_aux_enseignants_des_sciences_physiques_dans_des_logiciels_de_simulation_informatique","abstract":"Ce travail a pour objet d’étudier les failles du processus d’apprentissage des sciences physiques ainsi que la possibilité de bénéficier des avantages des nouvelles TIC par l’intégration des simulateurs informatiques. Pour ce faire, et en se basant sur les résultats initiaux d’un questionnaire, Nous avons commencé par la mise en place d'une formation à distance concernant la conception et l’utilisation pédagogique des simulateurs pour plus de deux cents enseignants marocains qui n'ont utilisé les technologies de l’information et de la communication (TIC) en classe que pour la préparation des cours et des contrôles. Les enseignants concernés étaient répartis sur les différentes académies du Royaume. La formation a duré six semaines pendant lesquelles étaient programmés des cours interactifs, des rencontres synchrones et asynchrones, des tests et des projets de réalisation d’un simulateur informatique. L’analyse d’un questionnaire délivré en ligne aux dits enseignants avant et après cette formation vise à montrer l’impact de ce genre de formations continues à distance sur l’utilisation des TIC en classe, sur la substitution des travaux pratiques ratés (faute de matériel didactique ou de son danger), sur l’apprentissage des phénomènes virtuels, sur le rendement des élèves marocains et par conséquent sur l’amélioration de la qualité d’enseignement des sciences physiques et ce en utilisant les simulateurs informatiques","authors":["Khalid Mahdi"],"meta":["May 2018","Projects: Ingénierie pédagogique et l’enseignement des sciences physiques au MarocConception d'un support numérique d'aide pour l'enseignement des sciences physiques"],"references":["348249318_les_facteurs_influencant_l'acquisition_des_concepts_en_electricite","322924091_La_valeur_ajoutee_de_la_formation_continue_en_ligne_des_enseignants_de_sciences_physiques_dans_le_simulateur_PSPICE","312457194_Impact_des_simulateurs_informatiques_dans_l'enseignement_de_sciences_physiques","310795856_Distance_training_for_physics_teachers_in_education_sciences_flexible_and_efficient","273308842_Qualifications_of_Physics_Teachers_in_ICT_to_Integrate_the_Use_of_ICT_in_Moroccan_Physics_Schools_Obstacles_and_Solutions","261594443_La_simulation_concue_comme_experience_concrete","270039093_Travail_collaboratif_et_interactions_dans_les_forums_de_discussion_fermes_Cas_d'eleves_ingenieurs_tunisiens","229760140_The_relationship_between_process_skill_and_formal_thinking_abilities","228847468_L'apprentissage_collaboratif_en_ligne_huit_avantages_qui_en_font_un_must"]}