{"id":"324923032_An_Empirical_Study_of_Game_Reviews_on_the_Steam_Platform","abstract":"The steadily increasing popularity of computer games has led to the rise of a multi-billion dollar industry. Due to the scale of the computer game industry, developing a successful game is challenging. In addition, prior studies show that gamers are extremely hard to please, making the quality of games an important issue. Most online game stores allow users to review a game that they bought. Such reviews can make or break a game, as other potential buyers often base their purchasing decisions on the reviews of a game. Hence, studying game reviews can help game developers better understand user concerns, and further improve the user-perceived quality of games. \n\nIn this paper, we perform an empirical study of the reviews of 6,224 games on the Steam platform, one of the most popular digital game delivery platforms, to better understand if game reviews share similar characteristics with mobile app reviews, and thereby understand whether the conclusions and tools from mobile app review studies can be leveraged by game developers. In addition, new insights from game reviews could possibly open up new research directions for research of mobile app reviews. We first conduct a preliminary study to understand the number of game reviews and the complexity to read through them. In addition, we study the relation between several game-specific characteristics and the fluctuations of the number of reviews that are received on a daily basis. We then focus on the useful information that can be acquired from reviews by studying the major concerns that users express in their reviews, and the amount of play time before players post a review. We find that game reviews are different from mobile app reviews along several aspects. Additionally , the number of playing hours before posting a review is a unique and helpful attribute for developers that is not found in mobile app reviews. Future longitudinal studies should be conducted to help developers and researchers leverage this information. Although negative reviews contain more valuable information about the negative aspects of the game, such as mentioned complaints and bug reports, developers and researchers should also not ignore the potentially useful information in positive reviews. Our study on game reviews serves as a starting point for other game review researchers, and suggests that prior studies on mobile app reviews may need to be revisited.","authors":["Dayi Lin","Cor-Paul Bezemer","Ying Zou","Ahmed E. Hassan"],"meta":["February 2019Empirical Software Engineering 24(1)","DOI:10.1007/s10664-018-9627-4","Projects: App Store AnalyticsMining Online Gaming Stores"],"references":["318726026_Studying_the_Dialogue_Between_Users_and_Developers_of_Free_Apps_in_the_Google_Play_Store","318317815_Android_Apps_and_User_Feedback_A_Dataset_for_Software_Evolution_and_Quality_Improvement","318317595_Android_Apps_and_User_Feedback_A_Dataset_for_Software_Evolution_and_Quality_Improvement","317638070_Recommending_and_Localizing_Change_Requests_for_Mobile_Apps_based_on_User_Reviews","317631936_An_Examination_of_the_Current_Rating_System_used_in_Mobile_App_Stores","317570653_An_Empirical_Study_of_Early_Access_Games_on_the_Steam_Platform","314856161_A_study_of_the_relation_of_mobile_device_attributes_with_the_user-perceived_quality_of_Android_apps","313428459_Recommending_and_Localizing_Change_Requests_for_Mobile_Apps_Based_on_User_Reviews","311625816_Studying_the_urgent_updates_of_popular_games_on_the_Steam_platform","318035973_On_the_Emotion_of_Users_in_App_Reviews","311615368_Analyzing_Reviews_and_Code_of_Mobile_Apps_for_Better_Release_Planning","311531753_Experience_Report_Understanding_Cross-Platform_App_Issues_from_User_Reviews","311359043_A_Survey_of_App_Store_Analysis_for_Software_Engineering","310588245_A_Systematic_Literature_Review_Opinion_Mining_Studies_from_Mobile_App_Store_User_Reviews","304286572_What_Parts_of_Your_Apps_are_Loved_by_Users_T"]}