{"id":"324975517_Healthcare_robotics_a_qualitative_exploration_of_key_challenges_and_future_directions_Preprint","abstract":"Background\nThe emergence of robotics is transforming industries around the world. Robot technologies are evolving exponentially, particularly as they converge with other functionalities such as artificial intelligence to learn from their environment, from each other, and from humans.\n\nObjective\nThe goal of the research was to understand the emerging role of robotics in health care and identify existing and likely future challenges to maximize the benefits associated with robotics and related convergent technologies.\n\nMethods\nWe conducted qualitative semistructured one-to-one interviews exploring the role of robotic applications in health care contexts. Using purposive sampling, we identified a diverse range of stakeholders involved in conceiving, procuring, developing, and using robotics in a range of national and international health care settings. Interviews were digitally recorded, transcribed verbatim, and analyzed thematically, supported by NVivo 10 (QSR International) software. Theoretically, this work was informed by the sociotechnical perspective, where social and technical systems are understood as being interdependent.\n\nResults\nWe conducted 21 interviews and these accounts suggested that there are significant opportunities for improving the safety, quality, and efficiency of health care through robotics, but our analysis identified 4 major barriers that need to be effectively negotiated to realize these: (1) no clear pull from professionals and patients, (2) appearance of robots and associated expectations and concerns, (3) disruption of the way work is organized and distributed, and (4) new ethical and legal challenges requiring flexible liability and ethical frameworks.\n\nConclusions\nSociotechnical challenges associated with the effective integration of robotic applications in health care settings are likely to be significant, particularly for patient-facing functions. These need to be identified and addressed for effective innovation and adoption.","authors":["Kathrin Cresswell","Sarah Cunningham-Burley","Aziz Sheikh"],"meta":["March 2018Journal of Medical Internet Research 20(7)","DOI:10.2196/10410"],"references":["291188199_Investigating_expertise_flexibility_and_resilience_in_socio-technical_environments_A_case_study_in_robotic_surgery","267763443_Service_Robotics_in_Healthcare_A_Perspective_for_Information_Systems_Researchers","347493919_Healthcare_Robots_Ethics_Design_and_Implementation","320088291_Formative_Analysis_of_Aging_in_Place_Implications_for_the_Design_of_Caregiver_Robots","309880312_The_Unintended_Consequences_of_Health_Information_Technology_Revisited","305719310_Rehabilitation_and_Health_Care_Robotics","279711519_Determining_Validity_in_Qualitative_Inquiry","279439148_Snowball_Sampling_Problems_and_Techniques_of_Chain_Referral_Sampling","274371551_Robotics_in_Construction","264197925_The_Determinants_of_Home_Healthcare_Robots_Adoption_An_Empirical_Investigation"]}