{"id":"324936042_Factors_affecting_ERP_implementation_success_in_Jordanian_commercial_banks_sector","abstract":"Today, great potential is envisaged for enterprise resource planning (ERP) systems in bank’s sector; software vendors have been repackaging their ERP implementation success for commercial bank’s sector with a recent focus upon the role of knowledge transfer. This paper describes some of the common factors affecting ERP implementation success by using knowledge transfer as mediate factor. We identify key success factors of ERP implementation in a Jordanian commercial bank’s sector as a sample. Therefore, the examination of the proposed model was made using a newly developed questionnaire. The questionnaires were distributed to a group of 240 persons employed in 13 commercial banks in Jordan. ERP users were selected as key respondents to the questionnaires. Additionally, the empirical data were analysed using the smart partial least square (PLS) technique. The main findings of the empirical study show significant influence of using ERP factors in enhancing the ERP implementation success mediation by the factor of knowledge transfer. The paper proposed an enhanced model that examines vital issues concerning ERP factors effective implementation, thus, providing valuable outcomes for decision-makers and academics. Keywords: enterprise resource planning; ERP; ERP factors; knowledge transfer; ERP implementation success; commercial banks sector.","authors":["Samer Alhawari","Maha Mahdi Alkhaffaf","Louay Karadsheh","Mufleh Jarrah"],"meta":["January 2018International Journal of Economics and Business Research 15(4):417","DOI:10.1504/IJEBR.2018.10012857"],"references":["331642264_An_Investigation_on_the_Challenges_of_Enterprise_Resource_Planning_Systems_Implementation_in_Zambia_a_comparative_study_of_three_organisations","308399906_Impact_of_enterprise_resource_planning_on_management_control_system_and_accountants'_role","303750015_CRITICAL_SUCCESS_FACTORS_FOR_ENTERPRISE_RESOURCE_PLANNING_IMPLEMENTATION_SUCCESS","319543624_Ambiguity_and_the_process_of_knowledge_transfer_in_strategic_alliances","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","309529355_Relationship_among_Project_Management_Processes_and_Knowledge_Repository_for_Project_Success","305373692_ERP_system_implementation_issues_and_challenges_in_developing_nations","304838872_An_Emergent_Model_of_End-users'_Acceptance_of_Enterprise_Resource_Planning_Systems_A_Grounded_Theory_Approach","297523102_A_Journey_through_the_Wilderness_An_Autoethnographic_Study_of_the_ERP_System_Implementation_Process_As_Created_by_IT_Project_Managers_and_Team_Members","285936319_A_Survey_Study_of_Influential_Factors_in_the_Implementation_of_Enterprise_Resource_Planning_Systems"]}