{"id":"324993562_The_Role_of_Rapid_Reviews_in_Supporting_Decision-Making_in_Software_Engineering_Practice","abstract":"Context: Recent work on Evidence Based Software Engineering (EBSE) suggests that systematic reviews lack connection with Software Engineering (SE) practice. In Evidence Based Medicine there is a growing initiative to address this kind of problem, in particular through what has been named as Rapid Reviews (RRs). They are adaptations of regular systematic reviews made to fit practitioners constraints.\nGoal: Evaluate the perceptions from SE practitioners on the use of Rapid Reviews to support decision-making in SE practice.\nMethod: We conducted an Action Research to evaluate RRs insertion in a real-world software development project.\nResults: Our results show that practitioners are rater positive about Rapid Reviews. They reported to have learned new concepts, reduced time and cost of decision-making, improved their understanding about the problem their facing, among other benefits. Additionally, two months after the introduction of the Rapid Review, in a follow up visit, we perceived that the practitioners have indeed adopted the evidence provided.\nConclusions: Based on the positive results we obtained with this study, and the experiences reported in medicine, we believe RRs could play an important role towards knowledge transfer and decision-making support in SE practice.","authors":["Bruno Cartaxo","Gustavo Pinto","Sergio Soares"],"meta":["May 2018","DOI:10.1145/3210459.3210462","Conference: 22nd International Conference on Evaluation and Assessment in Software Engineering (EASE)","Projects: Knowledge Transfer Between Software Engineering Research and PracticeTransfering knowledge  to software engineering practice"],"references":["322294051_Towards_a_Model_to_Transfer_Knowledge_from_Software_Engineering_Research_to_Practice","320979920_Using_a_Visual_Abstract_as_a_Lens_for_Communicating_and_Promoting_Design_Science_Research_in_Software_Engineering","320100700_Rapid_reviews_to_strengthen_health_policy_and_systems_a_practical_guide","318336961_Guidelines_for_including_the_grey_literature_and_conducting_multivocal_literature_reviews_in_software_engineering","316939663_Evidence_Briefings_Towards_a_Medium_to_Transfer_Knowledge_from_Systematic_Reviews_to_Practitioners","316862123_Using_QA_Websites_as_a_Method_for_Assessing_Systematic_Reviews","315079451_Five_shared_decision-making_tools_in_5_months_Use_of_rapid_reviews_to_develop_decision_boxes_for_seniors_living_with_dementia_and_their_caregivers","327427689_Action_Research_in_Health","318407388_Comparison_of_a_full_systematic_review_versus_rapid_review_approaches_to_assess_a_newborn_screening_test_for_tyrosinemia_type_1","318014357_Diffusion_of_Innovations"]}