{"id":"324988448_Cardiac_Arrhythmia_Classification_by_Multi-Layer_Perceptron_and_Convolution_Neural_Networks","abstract":"The electrocardiogram (ECG) plays an imperative role in the medical field, as it records heart signal over time and is used to discover numerous cardiovascular diseases. If a documented ECG signal has a certain irregularity in its predefined features, this is called arrhythmia, the types of which include tachycardia, bradycardia, supraventricular arrhythmias, and ventricular, etc. This has encouraged us to do research that consists of distinguishing between several arrhythmias by using deep neural network algorithms such as multi-layer perceptron (MLP) and convolution neural network (CNN). The TensorFlow library that was established by Google for deep learning and machine learning is used in python to acquire the algorithms proposed here. The ECG databases accessible at PhysioBank.com and kaggle.com were used for training, testing, and validation of the MLP and CNN algorithms. The proposed algorithm consists of four hidden layers with weights, biases in MLP, and four-layer convolution neural networks which map ECG samples to the different classes of arrhythmia. The accuracy of the algorithm surpasses the performance of the current algorithms that have been developed by other cardiologists in both sensitivity and precision.","authors":["Shalin Savalia","Vahid Emamian"],"meta":["May 2018Bioengineering 5(2):35","DOI:10.3390/bioengineering5020035"],"references":["331431676_A_neural_network_approach_and_wavelet_analysis_for_ECG_classification","317336647_Automated_Detection_of_Coronary_Artery_Disease_Using_Different_Durations_of_ECG_Segments_with_Convolutional_Neural_Network","325579228_AF_Classification_from_a_Short_Single_Lead_ECG_Recording_the_PhysioNetComputing_in_Cardiology_Challenge_2017","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","315865786_Swift_single_image_super_resolution_using_deep_convolution_neural_network","313588931_Automated_characterization_of_arrhythmias_using_nonlinear_features_from_tachycardia_ECG_beats","309917913_An_Automated_ECG_Beat_Classification_System_Using_Convolutional_Neural_Networks","309691902_The_application_of_supervised_learning_through_feed-forward_neural_networks_for_ECG_signal_classification","308831341_An_algorithm_for_ECG_analysis_of_arrhythmia_detection","308277201_Identity_Mappings_in_Deep_Residual_Networks"]}