{"id":"324922242_Detection_of_Red-Meat_Adulteration_by_Deep_Spectral-Spatial_Features_in_Hyperspectral_Images","abstract":"This paper provides a comprehensive analysis of the performance of hyperspectral imaging for detecting adulteration in red-meat products. A dataset of line-scanning images of lamb, beef, or pork muscles was collected taking into account the state of the meat (fresh, frozen, thawed, and packing and unpacking the sample with a transparent bag). For simulating the adulteration problem, meat muscles were defined as either a class of lamb or a class of beef or pork. We investigated handcrafted spectral and spatial features by using the support vector machines (SVM) model and self-extraction spectral and spatial features by using a deep convolution neural networks (CNN) model. Results showed that the CNN model achieves the best performance with a 94.4% overall classification accuracy independent of the state of the products. The CNN model provides a high and balanced F-score for all classes at all stages. The resulting CNN model is considered as being simple and fairly invariant to the condition of the meat. This paper shows that hyperspectral imaging systems can be used as powerful tools for rapid, reliable, and non-destructive detection of adulteration in red-meat products. Also, this study confirms that deep-learning approaches such as CNN networks provide robust features for classifying the hyperspectral data of meat products; this opens the door for more research in the area of practical applications (i.e., in meat processing). © 2018 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license","authors":["Mahmoud Al-Sarayreh","Marlon M. Reis","Wei Qi Yan","Reinhard Klette"],"meta":["May 2018Journal of Imaging 4(5):63","DOI:10.3390/jimaging4050063"],"references":["322323166_3D_Convolutional_Neural_Networks_for_Crop_Classification_with_Multi-Temporal_Remote_Sensing_Images","315570561_Bidirectional-Convolutional_LSTM_Based_Spectral-Spatial_Feature_Learning_for_Hyperspectral_Image_Classification","309445593_Deep_Learning_for_Hyperspectral_Data_Classification_through_Exponential_Momentum_Deep_Convolution_Neural_Networks","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319419062_Stacked_sparse_autoencoder_in_hyperspectral_data_classification_using_spectral-spatial_higher_order_statistics_and_multifractal_spectrum_features","316572572_Deep_Recurrent_Neural_Networks_for_Hyperspectral_Image_Classification","313575668_Statistical_and_structural_approaches_to_texture","312355586_Spectral-Spatial_Classification_of_Hyperspectral_Imagery_with_3D_Convolutional_Neural_Network","311756654_Super_pixel_based_classification_using_conditional_random_fields_for_hyperspectral_images"]}