{"id":"324951902_Finding_local_genome_rearrangements","abstract":"Background\nThe double cut and join (DCJ) model of genome rearrangement is well studied due to its mathematical simplicity and power to account for the many events that transform gene order. These studies have mostly been devoted to the understanding of minimum length scenarios transforming one genome into another. In this paper we search instead for rearrangement scenarios that minimize the number of rearrangements whose breakpoints are unlikely due to some biological criteria. One such criterion has recently become accessible due to the advent of the Hi-C experiment, facilitating the study of 3D spacial distance between breakpoint regions.\n\nResults\nWe establish a link between the minimum number of unlikely rearrangements required by a scenario and the problem of finding a maximum edge-disjoint cycle packing on a certain transformed version of the adjacency graph. This link leads to a 3/2-approximation as well as an exact integer linear programming formulation for our problem, which we prove to be NP-complete. We also present experimental results on fruit flies, showing that Hi-C data is informative when used as a criterion for rearrangements.\n\nConclusions\nA new variant of the weighted DCJ distance problem is addressed that ignores scenario length in its objective function. A solution to this problem provides a lower bound on the number of unlikely moves necessary when transforming one gene order into another. This lower bound aids in the study of rearrangement scenarios with respect to chromatin structure, and could eventually be used in the design of a fixed parameter algorithm with a more general objective function.","authors":["Pijus Simonaitis","Krister M. Swenson"],"meta":["May 2018Algorithms for Molecular Biology 13(1)","DOI:10.1186/s13015-018-0127-2"],"references":["319704283_Rearrangement_Scenarios_Guided_by_Chromatin_Structure","303295077_Models_and_algorithms_for_genome_rearrangement_with_positional_constraints","285824052_Triggers_for_genomic_rearrangements_insights_into_genomic_cellular_and_environmental_influences","223976604_Topological_Domains_in_Mammalian_Genomes_Identified_by_Analysis_of_Chromatin_Interactions","221766911_Three-Dimensional_Folding_and_Functional_Organization_Principles_of_the_Drosophila_Genome","331865689_Improved_bounds_on_sorting_by_length-weighted_reversals","283819701_Sorting_Signed_Circular_Permutations_by_Super_Short_Reversals","257144999_Approximating_the_number_of_Double_Cut-and-Join_scenarios","231586595_Genomic_sorting_with_length-weighted_reversals","223541856_Packing_cycles_in_undirected_graphs"]}