{"id":"325001190_Linear_Search_by_a_Pair_of_Distinct-Speed_Robots","abstract":"Two mobile robots are initially placed at the same point on an infinite line. Each robot may move on the line in either direction not exceeding its maximal speed. The robots need to find a stationary target placed at an unknown location on the line. The search is completed when both robots arrive at the target point. The target is discovered at the moment when either robot arrives at its position. The robot knowing the placement of the target may communicate it to the other robot. We look for the algorithm with the shortest possible search time (i.e. the worst-case time at which both robots meet at the target) measured as a function of the target distance from the origin (i.e. the time required to travel directly from the starting point to the target at unit velocity). We consider two standard models of communication between the robots, namely wireless communication and communication by meeting. In the case of communication by meeting, a robot learns about the target while sharing the same location with a robot possessing this knowledge. We propose here an optimal search strategy for two robots including the respective lower bound argument, for the full spectrum of their maximal speeds. This extends the main result of Chrobak et al. (in: Italiano, Margaria-Steffen, Pokorný, Quisquater, Wattenhofer (eds) Current trends in theory and practice of computer science, SOFSEM, 2015) referring to the exact complexity of the problem for the case when the speed of the slower robot is at least one third of the faster one. In the wireless communication model, a message sent by one robot is instantly received by the other robot, regardless of their current positions on the line. For this model, we design a strategy which is optimal whenever the faster robot is at most \n\n17\n\n+\n4\n≈\n8.123\n\ntimes faster than the slower one. We also prove that otherwise the wireless communication offers no advantage over communication by meeting.","authors":["Evangelos Bampas","Jurek Czyzowicz","Leszek Gasieniec","David Ilcinkas"],"meta":["May 2018Algorithmica 81(2)","DOI:10.1007/s00453-018-0447-0"],"references":["332938966_Chases_and_Escapes_The_Mathematics_of_Pursuit_and_Evasion","311489772_Evacuating_two_robots_from_multiple_unknown_exits_in_a_circle","310953049_Search_on_a_Line_by_Byzantine_Robots","305660886_Search_on_a_Line_with_Faulty_Robots","301721524_Fence_Patrolling_with_Two-speed_Robots","300790909_Wireless_Autonomous_Robot_Evacuation_from_Equilateral_Triangles_and_Squares","300008139_Evacuating_Robots_via_Unknown_Exit_in_a_Disk","285320254_Online_searching","278681129_Group_Search_on_the_Line","275064283_An_Optimal_Search"]}