{"id":"325021491_The_locus_of_legitimate_interpretation_in_Big_Data_sciences_Lessons_for_computational_social_science_from_-omic_biology_and_high-energy_physics","abstract":"This paper argues that analyses of the ways in which Big Data has been enacted in other academic disciplines can provide us with concepts that will help understand the application of Big Data to social questions. We use examples drawn from our Science and Technology Studies (STS) analyses of -omic biology and high energy physics to demonstrate the utility of three theoretical concepts: (i) primary and secondary inscriptions, (ii) crafted and found data, and (iii) the locus of legitimate interpretation. These help us to show how the histories, organisational forms, and power dynamics of a field lead to different enactments of big data. The paper suggests that these concepts can be used to help us to understand the ways in which Big Data is being enacted in the domain of the social sciences, and to outline in general terms the ways in which this enactment might be different to that which we have observed in the ‘hard’ sciences. We contend that the locus of legitimate interpretation of Big Data biology and physics is tightly delineated, found within the disciplinary institutions and cultures of these disciplines. We suggest that when using Big Data to make knowledge claims about ‘the social’ the locus of legitimate interpretation is more diffuse, with knowledge claims that are treated as being credible made from other disciplines, or even by those outside academia entirely.","authors":["Andrew Bartlett","Jamie Lewis","Luis Reyes-Galindo","Neil Stephens"],"meta":["June 2018Big Data & Society 5(1):205395171876883","DOI:10.1177/2053951718768831"],"references":["325997821_Analysing_the_role_of_virtualisation_and_visualisation_on_interdisciplinary_knowledge_exchange_in_stem_cell_research_processes","318548425_Demarcating_Fringe_Science_for_Policy","317914041_Bioinformatics_Indispensable_yet_hidden_in_plain_sight","317201515_Towards_an_Ethical_Framework_for_Publishing_Twitter_Data_in_Social_Research_Taking_into_Account_Users'_Views_Online_Context_and_Algorithmic_Estimation","344636652_Knowledge_machines_language_and_information_in_a_technological_society","344324962_Biology_Computing_and_the_History_of_Molecular_Sequencing_From_Proteins_to_DNA_1945-2000","329960149_Arguments_that_Count_Physics_Computing_and_Missile_Defense_1949-2012","322906897_Data-Centric_Biology_A_Philosophical_Study","322871591_Deep_neural_networks_are_more_accurate_than_humans_at_detecting_sexual_orientation_from_facial_images","318019680_Data_ex_Machina_Introduction_to_Big_Data"]}