{"id":"325025844_Automated_ECG_Classification_Using_Dual_Heartbeat_Coupling_Based_on_Convolutional_Neural_Network","abstract":"A high performance electrocardiogram (ECG) based arrhythmic beats classification system is presented in this paper. The classifier was designed based on convolutional neural network (CNN). Single channel ECG signal was segmented into heartbeats in accordance with the changing heartbeat rate. The beats were transformed into dual beat coupling matrix as 2-D inputs to the CNN classifier, which captured both the beat morphology and beat-to-beat correlation in ECG. A systematic training beat selection procedure was also proposed which automatically include the most representative beats into the training set to improve classification performance. The classification system was evaluated for detection of supraventricular ectopic beats (SVEB or S beats) and ventricular ectopic beats (VEB or V beats) using the MIT-BIH arrhythmia database. Our proposed method has demonstrated superior performance than several state-of-the-art detectors. In particular, our proposed CNN system has improved sensitivity and positive predictive rate for S beats by more than 12.2% and 11.9% respectively over these top performing algorithms. Our proposed CNN classifier with an automatic training beats selection process has shown to outperform the previous methods. The classifier is also a personalized one by combining training set from a common pool and a subject-specific set of ECG data. Our proposed system provides a reliable and fully automatic tool for detection of arrhythmia heartbeat without the need for manual feature extraction or expert assistant. It can potentially be implemented on portable device for long-term monitoring of cardiac arrhythmia.","authors":["Xiaolong Zhai","Chung Tin"],"meta":["May 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2833841"],"references":["315821873_Automated_Detection_of_Arrhythmias_Using_Different_Intervals_of_Tachycardia_ECG_Segments_with_Convolutional_Neural_Network","303498772_Deep_learning_as_a_tool_for_increased_accuracy_and_efficiency_of_histopathological_diagnosis","285648102_Protein_Secondary_Structure_Prediction_Using_Deep_Convolutional_Neural_Fields","282126595_Analyzing_animal_behavior_via_classifying_each_video_frame_using_convolutional_neural_networks","281081141_Real-Time_Patient-Specific_ECG_Classification_by_1D_Convolutional_Neural_Networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","318259423_Cardiologist-Level_Arrhythmia_Detection_with_Convolutional_Neural_Networks","310660841_Heartbeat_Classification_Using_Abstract_Features_From_the_Abductive_Interpretation_of_the_ECG","304417592_MatConvNet_convolutional_neural_networks_for_MATLAB","293174514_Deep_Learning_Approach_for_Active_Classification_of_Electrocardiogram_Signals"]}