{"id":"325060256_Finding_clique_clusters_with_the_highest_betweenness_centrality","abstract":"This article introduces and studies the most betweenness-central clique problem, which involves finding a clique cluster of maximum betweenness centrality in a connected network. This problem allows one to extend the traditional notion of finding a single most influential (or central) member, to one of identifying central groups whose members collectively satisfy a structural property that is meaningful relative to the underlying system. Among others, betweenness-central cliques find application in corporate, social, communication, power grid, and biological network analysis. In this study, the betweenness centrality measure adopted to define our problem is based on the summation of the percentages representing the ratio of the shortest paths between every pair of vertices in a network that intersect a given clique. The decision version of this problem is proven to be NP-complete, and it is shown that an optimal solution to this problem is either a maximal clique, or contained in a maximal clique with the same objective value. We also propose an analytical upper bound for the betweenness centrality of any maximal clique containing a given clique, and employ it to develop a combinatorial branch-and-bound algorithm for solving this problem. Computational performance of the proposed algorithm is then compared with that of a mixed integer programming technique on a test-bed of randomly generated graphs and real-life power-law networks.","authors":["Maciej Rysz","Foad Mahdavi Pajouh","Eduardo L. Pasiliao"],"meta":["May 2018European Journal of Operational Research 271(1)","DOI:10.1016/j.ejor.2018.05.006"],"references":["257658028_On_inclusionwise_maximal_and_maximum_cardinality_-clubs_in_graphs","257516335_A_branch-and-bound_approach_for_maximum_quasi-cliques","222538101_Centrality_and_Network_Flow","222405203_A_Graph-Theoretic_Perspective_on_Centrality","267026775_An_integer_programming_approach_for_finding_the_most_and_the_least_central_cliques","260027556_Evolution_of_social_networks","233952925_Modeling_centrality_measures_in_social_network_analysis_using_bi-criteria_network_flow_optimization_problems","223573923_Characterization_of_topological_keystone_species_Local_global_and_meso-scale_centralities_in_food_webs","222572979_On_Variants_of_Shortest-Path_Betweenness_Centrality_and_their_Generic_Computation","4940325_Analysis_of_heuristics_for_finding_a_maximum_weight_planar_subgraph","4784409_Network_Embeddedness_and_the_Exploration_of_Novel_Technologies_Technological_Distance_Betweenness_Centrality_and_Density"]}