{"id":"325003122_Image_Segmentation_Using_Sparse_Subset_Selection","abstract":"In this paper, we present a new image segmentation method based on the concept of sparse subset selection. Starting with an over-segmentation, we adopt local spectral histogram features to encode the visual information of the small segments into high-dimensional vectors, called superpixel features. Then, the superpixel features are fed into a novel convex model which efficiently leverages the features to group the superpixels into a proper number of coherent regions. Our model automatically determines the optimal number of coherent regions and superpixels assignment to shape final segments. To solve our model, we propose a numerical algorithm based on the alternating direction method of multipliers (ADMM), whose iterations consist of two highly parallelizable sub-problems. We show each sub-problem enjoys closed-form solution which makes the ADMM iterations computationally very efficient. Extensive experiments on benchmark image segmentation datasets demonstrate that our proposed method in combination with an over-segmentation can provide high quality and competitive results compared to the existing state-of-the-art methods.","authors":["Fariba Zohrizadeh","Mohsen Kheirandishfard","Farhad Kamangar"],"meta":["March 2018","DOI:10.1109/WACV.2018.00165","Conference: 2018 IEEE Winter Conference on Applications of Computer Vision (WACV)"],"references":["325325400_Piecewise_Flat_Embedding_for_Image_Segmentation","311610825_Scale-Aware_Alignment_of_Hierarchical_Image_Segmentation","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","318439989_Pushing_the_Boundaries_of_Boundary_Detection_using_Deep_Learning","313542424_An_automatic_system_for_cell_nuclei_pleomorphism_segmentation_in_histopathological_images_of_breast_cancer","313157156_Fast_alternating_direction_optimization_methods","312550454_FusionSeg_Learning_to_combine_motion_and_appearance_for_fully_automatic_segmention_of_generic_objects_in_videos","311610925_Active_Image_Segmentation_Propagation","311531874_Reliability-Based_Local_Features_Aggregation_for_Image_Segmentation","308277743_Laplacian_Pyramid_Reconstruction_and_Refinement_for_Semantic_Segmentation"]}