{"id":"325011475_emergence-of-automated-computing-technologies-in-biomedical-diseaseand-drug-discovery-117","abstract":"Present era is estimated as the era of technological evolution. Every aspect of human life is greatly influenced through it. Just like all the sectors, emergence of information and computing technologies in Biomedical drug, disease, big data is worthy of remark. However, access, manipulation and analysis of biomedical data have become significantly mandatory for medical disease, drug discovery. In this regard, computer technologies are being developed emerging new specialty, methods, prospects, approach to handle big data. Rather than this big data perspective is seems to be appeared increasingly in biomedical sector which have already a great obstacle for the practitioners to work efficiently. In this respect lots of research have been conducted still going on. It’s a matter of blessings that recent computing technologies are doing well discovering new trends for disease detection as well as drug discovery. However, some barrier is still in action in this path. Realizing the worth of this computing technologies in biomedical science this work encompasses some exceptionally tremendous contribution in biomedical science, what they trended to do, their perspectives, challenges, way to avoid obstacles which can be a resource for the future further research in this field. Moreover, biomedical big data computing perspectives and contributions have been also concentrated in this work. Various machine learning approaches focused on various research and their drawbacks are also receptacle for the rest portion of this contribution.","authors":["Md Golam Sarowar"],"meta":["March 2018"],"references":["316365993_International_network_of_cancer_genome_projects","301345304_Pajek-program_for_large_Network_analysis","300366496_Challenges_of_Identifying_Clinically_Actionable_Genetic_Variants_for_Precision_Medicine","291387301_Big_Data_Application_in_Biomedical_Research_and_Health_Care_A_Literature_Review","321616227_Mobile_Health_A_Technology_Road_Map","316366148_The_genomic_and_transcriptomic_architecture_of_2000_breast_tumours_reveals_novel_subgroups","313444342_Choosing_an_Appropriate_Ensemble_Classifier_for_Balanced_Bioinformatics_Data","312775005_MapReduce_Simplified_data_processing_on_large_clusters","297235987_Big_datasocial_media_combo_poised_to_advance_healthcare","293497374_Dynamic_programming"]}