{"id":"325095283_Modelling_and_optimization_of_a_manufacturingremanufacturing_system_with_storage_facility_under_carbon_cap_and_trade_policy","abstract":"Due to rigorous environmental legislations and competitive economics worldwide, a growing number of companies are devoted to recovering and remanufacturing used products. Consequently, over the past few decades, the management of manufacturing/remanufacturing systems has been receiving increasing attention from researchers and companies leaders. Most of the existing research papers in the literature considered that remanufactured products have the same quality and price as new ones. However, in practice, the market perceives new items as higher quality products rather than remanufactured items. This paper aims to bridge the gap in research on manufacturing/remanufacturing supply chain, by investigating an optimal storage and manufacturing/remanufacturing planning, while taking into consideration the difference between new and remanufactured items, random machine failures, carbon constraints and distinct random customer demands for both items types. Furthermore, to make our system more realistic, it is assumed that the return rate of used items depends on the sales in the past periods, machine repair time is stochastic and set-up time period is not negligible. In this study, two models are developed, considering carbon emissions or not, to determine the optimal values of the manufacturing/remanufacturing period lengths and serviceable stock capacities of new and remanufactured items. Numerical results are provided to illustrate the impact of set-up cost, percentage of returned used items, machine availability, carbon cap and carbon trading price on the optimal storage and production planning. Moreover, the influences of carbon cap, carbon trading price and percentage of returned used items on carbon emissions have been analyzed. The results reveal that set-up cost, percentage of returned used items and machine availability have significant impact on storage and production planning of new and remanufactured items. In addition, the results indicate that a lower carbon cap and/or a high carbon trading price, induce the producer to collect and remanufacture used items and curb carbon emissions.","authors":["Sadok Turki","Christophe Sauvey","Nidhal Rezg"],"meta":["May 2018Journal of Cleaner Production 193","DOI:10.1016/j.jclepro.2018.05.057"],"references":["305680023_Unreliable_manufacturing_supply_chain_optimisation_based_on_an_infinitesimal_perturbation_analysis","263609327_Perturbation_analysis_for_continuous_and_discrete_flow_models_A_study_of_the_delivery_time_impact_on_the_optimal_buffer_level","272787193_Effects_of_carbon_emission_regulations_on_remanufacturing_decisions_with_limited_information_of_demand_distribution"]}