{"id":"325064000_Numerical_methods_for_hydraulic_transients_in_visco-elastic_pipes","abstract":"In technical applications involving transient fluid flows in pipes, the convective terms of the corresponding governing equations are generally negligible. Typically, under this condition, these governing equations are efficiently discretized by the Method of Characteristics. Only in the last years the availability of very efficient and robust numerical schemes for the complete system of equations, such as recent Finite Volume Methods, has encouraged the simulation of transient fluid flows with numerical schemes different from the Method of Characteristics, allowing a better representation of the physics of the phenomena. In this work, a wide and critical comparison of the capability of Method of Characteristics, Explicit Path-Conservative (DOT solver) Finite Volume Method and Semi-Implicit Staggered Finite Volume Method is presented and discussed, in terms of accuracy and efficiency. To perform the analysis in a framework that properly represents real-world engineering applications, the visco-elastic behaviour of the pipe wall, the effects of the unsteadiness of the flow on the friction losses, cavitation and cross-sectional changes are taken into account. The analyses are performed comparing numerical solutions obtained using the three models against experimental data and analytical solutions. In particular, water hammer studies in high density polyethylene pipes, for which laboratory data have been provided, are used as test cases. Considering the visco-elastic mechanical behaviour of plastic materials, 3-parameter and multi-parameter linear visco-elastic rheological models are adopted and implemented in each numerical scheme. Original extensions of existing techniques for the numerical treatment of such visco-elastic models are introduced in this work for the first time. After a focused calibration of the visco-elastic parameters, the different performance of the numerical models is investigated. A comparison of the results is presented taking into account the unsteady wall-shear stress, with a new approach proposed for turbulent flows, or simply considering a quasi-steady friction model. A predominance of the damping effect due to visco-elasticity with respect to the damping effect related to the unsteady friction is confirmed in these contexts. Moreover, all the numerical methods show a good agreement with the experimental data and a high efficiency of the Method of Characteristics in standard configuration is observed. Finally, three Riemann Problems are chosen and run to stress the numerical methods, taking into account cross-sectional changes, more flexible materials and cavitation cases. In these demanding scenarios, the weak spots of the Method of Characteristics are depicted.","authors":["Giulia Bertaglia","Matteo Ioriatti","Alessandro Valiani","Michael Dumbser"],"meta":["May 2018Journal of Fluids and Structures 81(C):230-254","DOI:10.1016/j.jfluidstructs.2018.05.004"],"references":["307917780_Experimental_distinction_of_damping_mechanisms_during_hydraulic_transients_in_pipe_flow","296691630_A_review_of_one-dimensional_unsteady_friction_models_for_transient_pipe_flow","285994431_New_efficient_approximation_of_weighting_functions_for_simulations_of_unsteady_friction_losses_in_liquid_pipe_flow","319115806_Viscoelastic_models_for_the_simulation_of_transients_in_polymeric_pipes","318150016_A_comparison_of_explicit_and_semi-implicit_finite_volume_schemes_for_viscous_compressible_flows_in_elastic_pipes_in_fast_transient_regime_Comparison_of_finite_volume_schemes_for_viscous_compressible_f","317234831_Finite-Volume_Solutions_to_the_Water-Hammer_Equations_in_Conservation_Form_Incorporating_Dynamic_Friction_Using_the_Godunov_Scheme","316118052_Well_balancing_of_the_SWE_schemes_for_moving-water_steady_flows","297320524_High_speed_and_accurate_computing_method_of_frequency_dependent_friction_in_laminar_pipe_flow_fow_characteristics_method","294112150_A_path-conservative_Osher-type_scheme_for_axially_symmetric_compressible_flows_in_flexible_visco-elastic_tubes","280015941_COMPUTATION_OF_UNSTEADY_PIPE_FLOW_WITH_RESPECT_TO_VISCO-ELASTIC_MATERIAL_PROPERTIES"]}