{"id":"325032828_Quality_Metrics_For_RDF_Graph_Summarization","abstract":"RDF Graph Summarization pertains to the process of extracting concise but meaningful summaries from RDF Knowledge\nBases (KBs) representing as close as possible the actual contents of the KB both in terms of structure and data. RDF Summarization\nallows for better exploration and visualization of the underlying RDF graphs, optimization of queries or query evaluation\nin multiple steps, better understanding of connections in Linked Datasets and many other applications. In the literature,\nthere are efforts reported presenting algorithms for extracting summaries from RDF KBs. These efforts though provide different\nresults while applied on the same KB, thus a way to compare the produced summaries and decide on their quality and bestfitness\nfor specific tasks, in the form of a quality framework, is necessary. So in this work, we propose a comprehensive Quality\nFramework for RDF Graph Summarization that would allow a better, deeper and more complete understanding of the quality of\nthe different summaries and facilitate their comparison. We work at two levels: the level of the ideal summary of the KB that\ncould be provided by an expert user and the level of the instances contained by the KB. For the first level, we are computing\nhow close the proposed summary is to the ideal solution (when this is available) by defining and computing its precision, recall\nand F-measure against the ideal solution. For the second level, we are computing if the existing instances are covered (i.e. can\nbe retrieved) and at which degree by the proposed summary. Again we define and compute its precision, recall and F-measure\nagainst the data contained in the original KB. We also compute the connectivity of the proposed summary compared to the ideal\none, since in many cases (like, e.g., when we want to query) this is an important factor and in general in RDF, linked datasets are\nusually used. We use our quality framework to test the results of three of the best RDF Graph Summarization algorithms, when\nsummarizing different (in terms of content) and diverse (in terms of total size and number of instances, classes and predicates)\nKBs and we present comparative results for them. We conclude this work by discussing these results and the suitability of the\nproposed quality framework in order to get useful insights for the quality of the presented results.","authors":["Mussab Zneika","Dan Vodislav","Dimitris Kotzinos"],"meta":["January 2018Semantic Web 10(12)","DOI:10.3233/SW-190346","Project: LOD graph summarization"],"references":["298615434_Summarizing_Linked_Data_RDF_Graphs_Using_Approximate_Graph_Pattern_Mining","287631618_Similar_structures_inside_RDF-graphs","283189435_SEPPs_Construct_and_Explore_Bisimulation_Summaries_plus_Optimize_Navigational_Queries_all_on_Existing_SPARQL_Systems","281625807_S_EPPs_Construct_and_Explore_Bisimulation_Summaries_plus_Optimize_Navigational_Queries_all_on_Existing_SPARQL_Systems","313009595_Dataset_Summary_Visualization_with_LODSight","309305790_ABSTAT_Ontology-Driven_Linked_Data_Summaries_with_Pattern_Minimalization","305870860_RDF_Graph_Summarization_Based_on_Approximate_Patterns","300579460_Constructing_Bisimulation_Summaries_on_a_Multi-Core_Graph_Processing_Framework","289313663_A_Semi-supervised_Learning_Approach_for_Ontology_Matching","289114188_ASSG_Adaptive_Structural_Summary_for_RDF_Graph_data"]}