{"id":"325099153_The_Webinar_Integration_Tool_A_Framework_for_Promoting_Active_Learning_in_Blended_Environments","abstract":"This paper describes a three-stage process of developing a webinar integration tool to enhance the interaction of teaching and learning in blended environments. In the context of medical education, we emphasize three factors of effective webinar integration in blended learning: fostering better solutions for faculty and students to interact virtually; enhancing blended learning using webinars as flipped mini-lectures; and promoting the 4Es Learning Cycle (engagement, exploration, explanation, and extension) through webinars. With the development of a webinar integration tool, we propose an implementation framework based on four guiding principles: (1) technology considerations: matching the tool features with tasks, (2) planning with the perspective of participatory theories of learning, (3) promoting active learning with the 4Es Learning Cycle model, and (4) identifying factors for effective learning through webinar. The three-stage process includes: conducting a needs assessment and training sessions to ensure prerequisite skills for attending and hosting a webinar session, collecting baseline data on overall uses and perceptions of webinars, and applying the results of stages 1 and 2 to the development of a webinar integration tool. Our goal is to identify best practices for integrating webinar technologies in medical education, and assist faculty in aligning course objectives with appropriate webinar activities. Through formative evaluation and continuous improvement of our framework, our broader goal and contribution to the field is to encourage the development and sharing of domain-specific practical strategies for webinar integration, and strategies for designing compelling blended learning and teaching experiences.","authors":["Ping Lieser","Steven D. Taff","Anne Murphy-Hagan"],"meta":["May 2018Journal of Interactive Media in Education 2018(1):7","DOI:10.5334/jime.453"],"references":["268433450_Meeting_Extension_Programming_Needs_with_Technology_A_Case_Study_of_Agritourism_Webinars","254796793_Use_of_the_Webinar_Tool_Elluminate_to_Support_Training_The_Effects_of_Webinar-Learning_Implementation_from_Student-Trainers'_Perspective","348861961_Learning_Online_What_Research_Tells_Us_About_Whether_When_and_How","265092107_Confronting_the_Challenges_of_Participatory_Culture_-_Media_Education_for_the_21st_Century_Part_2","248998202_Throwing_light_into_the_black_box_of_implementation_ICT_in_Cyprus_elementary_schools","248940395_Concepts_Broadening_the_definition_of_distance_education_in_light_of_the_new_telecommunications_technologies","247897833_The_Human_Touch_Synchronous_Communication_in_Web-Based_Learning","243769578_Barriers_to_Adopting_Emerging_Technologies_in_Education","243678857_On-line_education_A_new_domain","240801881_High_Access_and_Low_Use_of_Technologies_in_High_School_Classrooms_Explaining_an_Apparent_Paradox"]}