{"id":"325180421_A_study_of_the_correlation_between_STEM_career_knowledge_mathematics_self-efficacy_career_interests_and_career_activities_on_the_likelihood_of_pursuing_a_STEM_career_among_middle_school_students","abstract":"Background\nA sample of 1448 students in grades 7 and 9 was drawn from public schools in Atlantic Canada to explore students’ knowledge of science and mathematics requirements for science, technology, engineering, and mathematics (STEM) careers. Also explored were their mathematics self-efficacy (MSE), their future career interests, their preferences for particular career activities, and their likelihood to pursue a STEM career.\n\nResults\nAnalysis revealed that while older students had more knowledge about mathematics/science requirements for STEM careers, this knowledge was lacking overall. Also, students with higher MSE were more knowledgeable about STEM career requirements. Furthermore, students with higher MSE and STEM career knowledge were more likely to choose a STEM career. Students with greater interest in technical and scientific skills were also more likely to consider a STEM career than those who preferred career activities that involved practical, productive, and concrete activities.\n\nConclusions\nThe results of this study show that students in middle school have a limited STEM career knowledge with respect to subject requirements and with respect to what sort of activities these careers involve. Furthermore, students with low MSE have a declining interest in STEM careers. Our data thus support the need to improve access to knowledge to facilitate students’ understanding of STEM careers and the nature of STEM work. Exposure of students to STEM careers can enhance their interest in pursuing careers involving science, technology, engineering, and mathematics.","authors":["Karen A. Blotnicky","Tamara A Franz-Odendaal","Frederick French","Phillip Joy"],"meta":["May 2018International Journal of STEM Education 5(1)","DOI:10.1186/s40594-018-0118-3"],"references":["308784695_Perceptions_of_Female_High_School_Students_on_Engineering","289953397_Lessons_Learned_Authenticity_Interdisciplinarity_and_Mentoring_for_STEM_Learning_Environments","284837095_High_School_Students'_Perceptions_of_the_Effects_of_International_Science_Olympiad_on_Their_STEM_Career_Aspirations_and_Twenty-First_Century_Skill_Development","273898491_A_Model_of_Factors_Contributing_to_STEM_Learning_and_Career_Orientation","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","308806844_Motivational_factors_predicting_STEM_and_engineering_career_intentions_for_high_school_students","303796259_Experiences_and_Perceptions_of_STEM_Subjects_Careers_and_Engagement_in_STEM_Activities_Among_Middle_School_Students_in_the_Maritime_Provinces","298825847_Broadening_the_use_of_Holland's_hexagon_with_specific_implications_for_career_counselors","286751485_Coteaching_as_an_approach_to_enhance_science_learning_and_teaching_in_primary_schools","269616413_Willing_able_and_unwanted_High_school_girls'_potential_selves_in_computing"]}