{"id":"325129016_3DCityDB_-_a_3D_geodatabase_solution_for_the_management_analysis_and_visualization_of_semantic_3D_city_models_based_on_CityGML","abstract":"Abstract Over the last decade, more and more cities and even countries worldwide are creating semantic 3D city models of their physical environment based on the international CityGML standard issued by the Open Geospatial Consortium (OGC). CityGML is an open data model and XML-based data exchange format describing the most relevant urban and landscape objects along with their spatial and non-spatial attributes, relations, and their complex hierarchical structures in five levels of detail. 3D city models, which are structured according to CityGML, are often used for various complex GIS simulation and analysis tasks, which go far beyond pure 3D visualization. Due to the large size and complexity of the sometimes country-wide 3D geospatial data, the GIS software vendors and service providers face many challenges when building 3D spatial data infrastructures for realizing the efficient storage, analysis, management, interaction, and visualization of the 3D city models based on the CityGML standard. Hence, there has been strong demand for an open and comprehensive software solution that can provide full support of the aforementioned functionalities. The ‘3D City Database’ (3DCityDB) is a free 3D geo-database solution for CityGML-based 3D city models. 3DCityDB has been developed as an Open Source and platform-independent software suite to facilitate the development and deployment of 3D city model applications. The 3DCityDB software package consists of a database schema for spatially enhanced relational database management systems (ORACLE Spatial or PostgreSQL/PostGIS) with a set of database procedures and software tools allowing to import, manage, analyze, visualize, and export virtual 3D city models according to the CityGML standard. Within this paper, the software suite is illustrated and explained in detail with respect to the related technical implementations and the underlying conceptual software design. Moreover, the utilization of 3DCityDB in different projects and practical application fields are also presented in this paper.","authors":["Zhihang Yao","Claus Nagel","Felix Kunde","György Hudra"],"meta":["May 2018Open Geospatial Data Software and Standards 3(1)","DOI:10.1186/s40965-018-0046-7","Project: Open source geospatial tools and technologies for urban and environmental studies"],"references":["321193016_3D_City_Database_extension_for_the_CityGML_Energy_ADE_08_PostgreSQL_Version","321190491_CityGML_goes_mobile_application_of_large_3D_CityGML_models_on_smartphones","320575566_CITYGML_AND_THE_STREETS_OF_NEW_YORK_-_A_PROPOSAL_FOR_DETAILED_STREET_SPACE_MODELLING","320573624_SPATIO-SEMANTIC_COMPARISON_OF_LARGE_3D_CITY_MODELS_IN_CITYGML_USING_A_GRAPH_DATABASE","320569583_SOLAR_POTENTIAL_ANALYSIS_AND_INTEGRATION_OF_THE_TIME-DEPENDENT_SIMULATION_RESULTS_FOR_SEMANTIC_3D_CITY_MODELS_USING_DYNAMIZERS","309615303_Integrating_Dynamic_Data_and_Sensors_with_Semantic_3D_City_Models_in_the_context_of_Smart_Cities","309218269_Comparison_of_2D_3D_Parameter-Based_Models_in_Urban_Fine_Dust_Distribution_Modelling","309091874_Multimodal_Location_Based_Services-Semantic_3D_City_Data_as_Virtual_and_Augmented_Reality","320593834_Applications_of_3D_City_Models_for_a_Better_Understanding_of_the_Built_Environment","317411946_Integrating_and_Managing_the_Information_for_Smart_Sustainable_Districts_-_The_Smart_District_Data_Infrastructure_SDDI"]}