{"id":"325163731_Bi-objective_optimization_for_energy_aware_IoT_service_composition","abstract":"In recent years, service-oriented based Internet of Things (IoT) has received massive attention from research and industry. Integrating and composing smart objects functionalities or their services is required to create and promote more complex IoT applications with advanced features. When many smart objects are deployed, how do we select the most appropriate set of smart objects to compose a service by considering both energy and Quality of Service (QoS) is an essential and challenging task. In this work, we reduced the problem of finding an optimal balance between QoS level and the consumed energy of the IoT service composition to a Bi-objective Shortest Path Optimization (BSPO) problem and used an exact algorithm named pulse to solve the problem. The BSPO has two objectives, minimizing the QoS including execution time, network latency, and service price and minimize the energy consumption of the composite service. Experimental evaluations show that the proposed approach has short execution time in various complex service profiles. Meanwhile, it can obtain good performance in energy consumption and thus network lifetime while maintaining a reasonable QoS level.","authors":["Osama Alsaryrah","Ibrahim Mashal","Tein yaw David Chung"],"meta":["May 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2836334","Project: Green internet of Things service composition"],"references":["317488692_Evaluating_Performance_of_Containerized_IoT_Services_for_Clustered_Devices_at_the_Network_Edge","314162289_Fog_Orchestration_for_Internet_of_Things_Services","307639507_Revisiting_Service-Oriented_Architecture_for_the_IoT_A_Middleware_Perspective","299432530_Situation-Aware_IoT_Services_Coordination_Platform_Using_Event_Driven_SOA_Paradigm","330356933_Multiple_attribute_decision_making_Methods_and_applications","315382774_An_Energy-aware_Service_Composition_Algorithm_for_Multiple_Cloud-based_IoT_Applications","314201600_An_open_IoT_framework_based_on_microservices_architecture","314195843_Energy-aware_composition_for_wireless_sensor_networks_as_a_service","301331452_SoIoT_Toward_A_user-centric_IoT-based_service_framework","301307155_Energy-Centered_and_QoS-Aware_Services_Selection_for_Internet_of_Things"]}