{"id":"325194656_On_domination_game_stable_graphs_and_domination_game_edge-critical_graphs","abstract":"Let γg(G) be the game domination number of a graph G. For any vertex v∈V(G), we denote by G|v a partially dominated graph G in which the vertex v is already dominated. In this paper, based on the domination game critical graph, two related definitions to the game domination number are introduced as follows. A graph G is domination game stable (or γg-stable for short) if γg(G)=γg(G|v) for any vertex v∈V(G) and is domination game edge-critical (or γg-edge-critical for short) if γg(G−e)>γg(G) for any edge e∈E(G).A γg-stable (γg-edge-critical resp.) graph G is called k-γg-stable (k-γg-edge-critical resp.) if γg(G)=k. We characterize the k-γg-stable graphs with k∈{1,2} and 3-γg-stable trees and show that the Kneser graphs K(n,2) with n≥5 are γg-stable. Also allγg-stable paths and cycles are completely determined, respectively. Moreover, we prove the existence of k-γg-stable graphs for any positive integer k. In addition, all complete r-partite γg-stable and γg-edge-critical graphs are determined, respectively. The characterization of k-γg-edge-critical graphs is given for k∈{1,2} with an example of a3-γg-edge-critical graph. Two sufficient conditions are presented for non-γg-edge-critical graphs. Finally we propose several open related problems.","authors":["Kexiang Xu","Xia Li"],"meta":["May 2018Discrete Applied Mathematics 250","DOI:10.1016/j.dam.2018.05.027"],"references":["327064771_Domination_game_on_paths_and_cycles","319894431_Game_Total_Domination_Critical_Graphs","309751325_Domination_game_extremal_families_for_35-conjecture_for_forests","303739608_How_Long_Can_One_Bluff_in_the_Domination_Game","293645980_On_graphs_with_small_game_domination_number","285575603_Total_Version_of_the_Domination_Game","321012982_On_graphs_with_largest_possible_game_domination_number","310470883_Total_domination_in_maximal_outerplanar_graphs","308030937_Trees_with_Equal_Total_Domination_and_Game_Total_Domination_Numbers","289541710_Domination_Game_A_proof_of_the_35-Conjecture_for_Graphs_with_Minimum_Degree_at_Least_Two"]}