{"id":"325174711_A_rule-based_approach_for_crop_identification_using_multi-temporal_and_multi-sensor_phenological_metrics","abstract":"Accurate classification and mapping of crops is essential for supporting sustainable land management. Such maps can be created based on satellite remote sensing; however, the selection of input data and optimal classifier algorithm still needs to be addressed especially for areas where field data is scarce. We exploited the intra-annual variation of temporal signatures of remotely sensed observations and used prior knowledge of crop calendars for the development of a two-step processing chain for crop classification. First, Landsat-based time-series metrics capturing within-season phenological variation were preprocessed and analyzed using Google Earth Engine cloud computing platform. The developmental stage of each crop was modeled by fitting harmonic function. The model’s output was further used for the automatic generation of training samples. Second, several classification methods (support vector machines, random forest, decision fusion) were tested. As input data for crop classification, composites based on Sentinel-1 and Landsat images were used. Overall classification accuracies exceeded 80% when the seasonal composites were used. Winter cereals were the most accurately classified, while we observed misclassifications among summer crops. The proposed approach offers a potential to accurately map crops in the areas where in situ field data are scarce or unavailable.","authors":["Gohar Ghazaryan","Olena Dubovyk","Fabian Löw","Mykola Lavreniuk"],"meta":["January 2018European Journal of Remote Sensing 51(1):511-524","DOI:10.1080/22797254.2018.1455540","Project: EvIDENz: Earth observation-based information products for drought risk assessment on a national basis"],"references":["313484584_On_combining_classifiers","305361549_Quantifying_the_Impacts_of_Environmental_Factors_on_Vegetation_Dynamics_over_Climatic_and_Management_Gradients_of_Central_Asia","305338072_Early_Detection_of_Summer_Crops_Using_High_Spatial_Resolution_Optical_Image_Time_Series","303934066_Automated_mapping_of_soybean_and_corn_using_phenology","303752152_Evaluating_Crop_Area_Mapping_from_MODIS_Time-Series_as_an_Assessment_Tool_for_Zimbabwe's_Fast_Track_Land_Reform_Programme","329584084_Advances_in_Environmental_Remote_Sensing_Sensors_Algorithms_and_Applications","318393712_R_A_Language_and_Environment_for_Statistical_Computing","318125549_A_new_method_for_crop_classification_combining_time_series_of_radar_images_and_crop_phenology_information","312078616_TIMESAT_for_Processing_Time-Series_Data_from_Satellite_Sensors_for_Land_Surface_Monitoring","310430138_Creating_a_basic_customizable_framework_for_crop_detection_using_Landsat_imagery"]}