{"id":"325171206_Toward_a_Hybrid_SDN_Architecture_for_V2V_Communication_in_IoV_Environment","abstract":"Internet of Vehicles (IoV) represents the evolution of Vehicular Ad-hoc Networks into Internet of Things paradigm using cloud computing as support. In IoV, Vehicle-to-Vehicle is the principal communication mode where the vehicles are either data transmitter, relay or receiver. This type of communication is subject to disturbances which deteriorate connectivity and hence the quality of service as it prevents access to cloud services on board vehicle. In this paper, we propose a robust routing protocol for the transmission of data packets satisfying the evolution of the topology and the mobility of the network by adopting a hybrid Software-Defined Networking architecture. This is done by disassociating the control plane that makes decisions about where data is sent from the data plane that forwards data to the selected destination. The control decisions are based on different criteria, namely the contact duration, the free load and the communication errors, which are carried out by each vehicle, in a decentralized mode. However, the error logs are handled within clusters, by an elected cluster head node, in a locally centralized mode. An implementation of this proposed hybrid protocol on a multi-agent platform with a comparative study is presented in this paper.","authors":["Lylia Alouache","Nga Nguyen","Makhlouf Aliouat","Rachid Chelouah"],"meta":["May 2018","DOI:10.1109/SDS.2018.8370428","Conference: SDS 2018At: Barcelona, Spain","Project: IoV & VANETs"],"references":["312335275_SDN_Coordination_for_CCN_and_FC_Content_Dissemination_in_VANETs","308386681_A_Comparative_Survey_of_VANET_Clustering_Techniques","307892108_Internet_of_Vehicles_From_intelligent_grid_to_autonomous_cars_and_vehicular_fogs","282831953_Vehicular_Ad_Hoc_Networks_Architectures_Research_Issues_Methodologies_Challenges_and_Trends","317566854_SCGRP_SDN-enabled_Connectivity-aware_Geographical_Routing_Protocol_of_VANETs_for_urban_environment","316727502_SDGR_An_SDN-Based_Geographic_Routing_Protocol_for_VANET","300482420_The_design_of_IOV_overall_structure_and_the_research_of_IOV_key_technology_in_intelligent_transportation_system","287470973_Developing_Multi-agent_Systems_with_JADE","283551558_SDN-based_routing_for_efficient_message_propagation_in_VANET","279160652_Cooperative_Data_Scheduling_in_Hybrid_Vehicular_Ad_Hoc_Networks_VANET_as_a_Software_Defined_Network"]}