{"id":"325163672_Fast_Ellipse_Detection_via_Gradient_Information_for_Robotic_Manipulation_of_Cylindrical_Objects","abstract":"Robotic manipulation of objects requires a fast recognition from image stream. For many cylindrical object (e.g. cans, cups, pipes, bottles, etc.) this is possible through detection of ellipse depicting the circular top of the cylinder. Growing industrial and warehouse applications of robots drive the demand for fast and reliable detection of ellipses, while state-of-the-art methods are lacking in either speed or accuracy strength. We present a novel algorithm to perform fast and robust ellipse detection. First, the method utilizes the information of edge curvature to split curves into arcs. Next, the arc convexity-concavity is used to classify arcs into different quadrants of ellipses. Then based on multiple geometric constraints the arcs can be grouped at low computational cost. Our method is compared with six state-of-the-art methods using three public image datasets. The comparison results show that the proposed algorithm outperforms other methods with high detection accuracy and fast detection speed. Lastly, the algorithm is applied to identifying cylindrical objects in real-time for arranging and tracking purposes.","authors":["Dong Huixu","Gb Sun","Wee Ching Pang","Ehsan Asadi"],"meta":["May 2018IEEE Robotics and Automation Letters 3(4):2754 - 2761","DOI:10.1109/LRA.2018.2836428","Project: Vision-Based Robotic Manipulation of Objects in Dynamic Scenario"],"references":["320195569_Geometric_design_optimization_of_an_under-actuated_tendon-driven_robotic_gripper","263893437_A_fast_and_effective_ellipse_detector_for_embedded_vision_applications","260691259_The_Open_Motion_Planning_Library","345004213_Ellipse_Detection-Based_Bin-Picking_Visual_Servoing_System","324082319_Accurate_detection_of_ellipses_with_false_detection_control_at_video_rates_using_a_gradient_analysis","307170121_A_Fast_Ellipse_Detector_Using_Projective_Invariant_Pruning","293080222_Detection_localization_and_picking_up_of_coil_springs_from_a_pile","291374866_Pose-estimation_and_reorientation_of_pistons_for_robotic_bin-picking","281318614_Effective_ellipse_detector_with_polygonal_curve_and_likelihood_ratio_test","269299881_Valve_turning_using_a_dual-arm_aerial_manipulator"]}