{"id":"325162420_Artificial_Intelligence_for_Diabetes_Management_and_Decision_Support_Literature_Review","abstract":"Background: \nArtificial intelligence methods in combination with the latest technologies, including medical devices, mobile computing, and sensor technologies, have the potential to enable the creation and delivery of better management services to deal with chronic diseases. One of the most lethal and prevalent chronic diseases is diabetes mellitus, which is characterized by dysfunction of glucose homeostasis.\n\nObjective: \nThe objective of this paper is to review recent efforts to use artificial intelligence techniques to assist in the management of diabetes, along with the associated challenges.\n\nMethods: \nA review of the literature was conducted using PubMed and related bibliographic resources. Analyses of the literature from 2010 to 2018 yielded 1849 pertinent articles, of which we selected 141 for detailed review.\n\nResults: \nWe propose a functional taxonomy for diabetes management and artificial intelligence. Additionally, a detailed analysis of each subject category was performed using related key outcomes. This approach revealed that the experiments and studies reviewed yielded encouraging results.\n\nConclusions: \nWe obtained evidence of an acceleration of research activity aimed at developing artificial intelligence-powered tools for prediction and prevention of complications associated with diabetes. Our results indicate that artificial intelligence methods are being progressively established as suitable for use in clinical daily practice, as well as for the self-management of diabetes. Consequently, these methods provide powerful tools for improving patients' quality of life.","authors":["Iván Contreras","Josep Vehí"],"meta":["May 2018Journal of Medical Internet Research 20(5)","DOI:10.2196/10775","Project: Artificial Intelligence for Diabetes Management"],"references":["323498128_A_Neural-Network-Based_Approach_to_Personalize_Insulin_Bolus_Calculation_Using_Continuous_Glucose_Monitoring","323435915_A_Novel_Approach_for_Fully_Automated_Personalized_Health_Coaching_for_Adults_with_Prediabetes_Pilot_Clinical_Trial","322973121_Automatic_Detection_and_Estimation_of_Unannounced_Meals_for_Multivariable_Artificial_Pancreas_System","320915547_Personalized_blood_glucose_prediction_A_hybrid_approach_using_grammatical_evolution_and_physiological_models","320314538_Encouraging_Physical_Activity_in_Patients_With_Diabetes_Intervention_Using_a_Reinforcement_Learning_System","324729332_Adaptive_Workflows_for_Diabetes_Management_Self-Management_Assistant_and_Remote_Treatment_for_Diabetes","324108165_Pharmacological_therapy_selection_of_type_2_diabetes_based_on_the_SWARA_and_modified_MULTIMOORA_methods_under_a_fuzzy_environment","323781664_A_Diabetes_Self-Management_Prototype_in_an_AAL-Environment_to_Detect_Remarkable_Health_States","322989160_A_dashboard-based_system_for_supporting_diabetes_care","322038592_Automated_blood_glucose_control_in_type_1_diabetes_A_review_of_progress_and_challenges"]}