{"id":"325171658_The_Impact_of_Video_Length_on_Learning_in_a_Middle-Level_Flipped_Science_Setting_Implications_for_Diversity_Inclusion","abstract":"Popularity of videos for classroom instruction has increased over the years due to affordability and user-friendliness of today’s digital video cameras. This prevalence has led to an increase in flipped, K-12 classrooms countrywide. However, quantitative data establishing the appropriate video length to foster authentic learning is limited, particularly in middle-level classrooms. We focus on this aspect of video technology in two flipped science classrooms at the middle school level to determine the optimal video length to enable learning, increase retention and support student motivation. Our results indicate that while assessments directly following short videos were slightly higher, these findings were not significantly different from scores following longer videos. While short-term retention of material did not seem to be influenced by video length, longer-term retention for males and students with learning disabilities was higher following short videos compared to long as assessed on summative assessments. Students self-report that they were more engaged, had enhanced focus, and had a perceived higher retention of content following shorter videos. This study has important implications for student learning, application of content, and the development of critical thinking skills. This is particularly paramount in an era where content knowledge is just a search engine away.","authors":["Krista E H Slemmons","Kele Anyanwu","Josh Hames","Dave Grabski"],"meta":["October 2018Journal of Science Education and Technology 27(2):1-11","DOI:10.1007/s10956-018-9736-2","Project: Science Education"],"references":["303687011_Students'_Perceptions_and_Emotions_Toward_Learning_in_a_Flipped_General_Science_Classroom","290982430_Performance_and_Perception_in_the_Flipped_Learning_Model_An_Initial_Approach_to_Evaluate_the_Effectiveness_of_a_New_Teaching_Methodology_in_a_General_Science_Classroom","285935974_The_flipped_classroom_A_survey_of_the_research","309310624_Three_approaches_to_the_quantitative_definition_of_information","304860437_Multimedia_Learning_Second_Edition","304005338_Student_perceptions_of_a_flipped_classroom_management_course","293814555_Tips_for_teaching_hands-on_practical_skills","292732544_Can_technology_exploit_our_many_ways_of_knowing","287104845_The_Flipped_Classroom_Online_instruction_at_home_frees_class_time_for_learning","284072850_Student_perceptions_in_the_classroom_Student_perceptions_in_the_classroom"]}