{"id":"325128367_Analytical_Study_of_Reinforced_Concrete_Beams_Strengthened_by_FRP_Bars_Subjected_to_Impact_Loading_Conditions","abstract":"Civil engineers have considered Fiber Reinforced Polymer (FRP) materials to enhance the performance of structural members subjected to static and dynamic loading conditions. However, there are some design limitations due to uncertainty in the behavior of such strengthened members. This fact is particularly important when considering the complex nature of the nonlinear behavior of materials, the impact loading conditions and geometry of the members having FRP systems. In this research, a new analytical model is developed to analyze structural members strengthened with FRP systems and subjected to impact loading conditions. ABAQUS based finite element code was used to develop the proposed model. The model was validated against nine beams built and tested with various configurations and loading conditions. Three sets of beams were prepared and tested under quasistatic and impact loadings by applying various impact height and Dynamic Explicit loading conditions. The first set consisted of two beams, where one of the beams was reinforced with steel bars and the other was externally reinforced with GFRP sheet. The second set consisted of six beams, with five of the beams were reinforced with steel bars and one of them wrapped by GFRP sheet. The last set was tested to validate the response of concrete beams reinforced by FRP bar. In addition, beams were reinforced with glass and carbon fiber composite bars tested under Quasi-Static and Impact loading conditions. The impact load was simulated by the concept of a drop of a solid hammer from various heights. The numerical results showed that the developed model can be an effective tool to predict the performance of retrofitted beams under dynamic loading condition. Furthermore, the model showed that FRP retrofitting of RC beams subjected to repetitive impact loads can effectively improve their dynamic performance and can slow the progress of damage.","authors":["Sajjad Sayyar Roudsari","Sameer A. Hamoush","Sayed Mohamad Soleimani","Taher Abu-Lebdeh"],"meta":["April 2018American Journal of Engineering and Applied Sciences","DOI:10.3844/ofsp.11916","Project: Finite Element"],"references":["307440731_Experimental_studies_and_numerical_simulation_of_behavior_of_RC_beams_retrofitted_with_HSSWM-HPM_under_impact_loading","302630760_Review_of_Concrete_Structures_Strengthened_with_FRP_Against_Impact_Loading","222054644_Plasticity_model_for_concrete_using_the_bounding_surface_model","328636972_Evaluation_of_large-size_reinforced_concrete_columns_strengthened_for_axial_load_using_fiber_reinforced_polymers","297371042_Analysis_of_crack_formation_and_crack_growth_in_concrete_by_means_of_finite_elements","294577342_Experimental_Investigation_of_the_Behaviour_of_Concrete_Beams_Reinforced_with_GFRP_Bars_under_Static_and_Impact_Loading","289027911_Behavior_of_RC_beams_under_impact_loading_Some_new_findings","222617217_Failure_mechanisms_in_twill-weave_laminates_FEM_predictions_vs_experiments"]}