{"id":"325227735_Sentiment_analysis_using_semantic_similarity_and_Hadoop_MapReduce","abstract":"Sentiment analysis or opinion mining is a domain that analyses people’s opinions, sentiments, evaluations, attitudes, and emotions from a written language; it had become a very active area of scientific research in recent years, especially with the development of social networks like Facebook and Twitter. In this paper we propose two new approaches to classify the tweets (look for the feeling expressed in the tweet), the first according to three classes : negative, positive or neutral, and the second according to two classes : negative or positive. Our first method consists in calculating the semantic similarity between the tweet to classify and three documents where each document represents a class (contains the words that represent a class); after the calculation of the similarity, the tweet takes the class of the document that has the greatest value of the semantic similarity with it. And the second method consists in calculating the semantic similarity between each word of the tweet to classify and the words “positive” and “negative” by proposing a new formula. We decide to do the analysis in a parallel and distributed way, using the Hadoop framework with the Hadoop distributed file system (HDFS) and the programming model MapReduce to solve the problem of the calculation time of the analysis if the dataset of the tweets is very large. The aim of our work is to combine between several domains, the information retrieval, semantic similarity, opinion mining or sentiment analysis and big data.","authors":["Youness Madani","Mohammed Erritali","Bengourram Jamaa"],"meta":["May 2019Knowledge and Information Systems 59(8)","DOI:10.1007/s10115-018-1212-z","Project: elearning systems and  big data "],"references":["320446679_The_Effects_of_Emoji_in_Sentiment_Analysis","311420923_Semantic_Sentiment_Analysis_in_Arabic_Social_Media","306364792_On_stopwords_filtering_and_data_sparsity_for_sentiment_analysis_of_twitter","323056960_A_parallel_semantic_sentiment_analysis","319209250_Social_Login_and_Data_Storage_in_the_Big_Data_File_System_HDFS","318096606_Sentiment_Analysis_on_Twitter_Data_using_KNN_and_SVM","314249995_Comparison_Research_on_Text_Pre-processing_Methods_on_Twitter_Sentiment_Analysis","313541582_Effect_of_negation_in_sentiment_analysis","305083440_Combining_local_context_and_WordNet_similarity_for_word_sense_identification","303402645_A_Hybrid_Approach_to_the_Sentiment_Analysis_Problem_at_the_Sentence_Level","301953428_Semantic_Patterns_for_Sentiment_Analysis_of_Twitter","262794111_On_Stopwords_Filtering_and_Data_Sparsity_for_Sentiment_Analysis_of_Twitter","261875740_Sentiment_Analysis_Algorithms_and_Applications_A_Survey","257719580_The_Role_of_Text_Pre-processing_in_Sentiment_Analysis","278652532_Lecture_Notes_in_Computer_Science"]}