{"id":"325292430_Time_Warp_Invariant_k_SVD_sparse_coding_and_dictionary_learning_for_time_series_under_time_warp","abstract":"Learning dictionary for sparse representing time series is an important issue to extract latent temporal features, reveal salient primitives and sparsely represent complex temporal data. Time series are challenging data, they are often of different durations, may be composed of local or global salient events, that may arise with varying delays at different time stamps. This paper addresses the sparse coding and dictionary learning for such challenging time series. For that, we propose a non linear time warp invariant kSVD (twi-ksvd) where both input samples and dictionary atoms may have different lengths while involving varying delays. For the sparse coding problem, we propose an efficient time warp invariant \northogonal matching pursuit based on a new cosine maximisation time warp operator and induced sibling atoms. For the dictionary learning, thanks to a rotation transformation between each atom and its sibling atoms, a singular value decomposition is used to jointly approximate the coefficients and update the dictionary. The proposed method is confronted to major shift invariant, convolved and kernel dictionary learning methods on several challenging character and digit handwritten trajectories. The experiments conducted show the potential of twi-ksvd to efficiently sparse represent time series and to extract latent discriminative primitives for time series classification.","authors":["Saeed Varasteh Yazdi","Ahlame Douzal"],"meta":["May 2018Pattern Recognition Letters 112","DOI:10.1016/j.patrec.2018.05.017","Project: Time warp invariant sparse coding and  dictionary learning for time series classification and clustering"],"references":["312994338_MOTIF_AN_EFFICIENT_ALGORITHM_FOR_LEARNING_TRANSLATION_INVARIANT_DICTIONARIES","254056832_Shift_2D_Rotation_Invariant_Sparse_Coding_for_Multivariate_Signals","316692582_Mathematical_Methods_for_Physicists","316588757_A_Wavelet_Tour_of_Signal_Processing","298789494_Generalized_k-means-based_clustering_for_temporal_data_under_weighted_and_kernel_time_warp","285975509_Learning_sparse_representations_for_human_action_recognition","284462851_The_curvelet_transform_for_image_denoising","266397318_Kernel_sparse_representation_for_time_series_classification","250142531_Shift-Invariant_Sparse_Coding_for_Audio_Classification","242653228_Image_Noise_Reduction_via_Geometric_Multiscale_Ridgelet_Support_Vector_Transform_and_Dictionary_Learning"]}