{"id":"325294971_Classification_des_Systemes_Cobotiques","abstract":"La classification des systèmes cobotiques est difficile car il existe de nombreux critères pour décrire la collaboration homme robot. Après état de l'art et définition des termes, nous proposons d'étudier les flux d'informations entre le cobot, au sens le plus large du terme, l'humain, l'environnement, et l'interface afin de caractériser les différents types de collaboration. La représentation sous la forme d'un schème de l'interaction s'avère riche et pertinente. Dix exemples sont analysés et discutés. Plusieurs schèmes présentent des caractéristiques discriminantes qui permettent de qualifier les systèmes cobotiques. On distingue ainsi le système symbiotique, avec un échange constant d'informations et un partage efficace de la tâche, l'humain augmenté, la sous-traitance, l'assistance à l'effort et l'assistance intelligente. \nABSTRACT. The classification of cobotic systems is hard as there exist numerous criteria to describe human robot collaboration. After state of the art and definition of the main terms, we propose to study the flow of information among the cobot, in its broadest sense, the human, the environment and the interface in order to characterize the different types of collaboration. The description with a scheme of interaction seems particularly appropriate. Ten examples are considered and discussed. Several schemes present discriminant features that allow the qualification and naming of the cobotic systems. It is thus possible to identify the symbiotic system, with a constant information exchange and an efficient work sharing, the augmented human, the sous-traitance, the assistance to effort and the intelligent assistance. \nMOTS-CLÉS. Cobotique, robotique collaborative, cobot.","authors":["Jean-Marc Salotti","Eric Ferreri","Olivier Ly","David Daney"],"meta":["March 2018","DOI:10.21494/ISTE.OP.2018.0268","Project: Human-robot collaboration"],"references":["305876847_Human_Factors_Issues_for_the_Design_of_a_Cobotic_System","301676712_Human-Robot_Interaction_Tackling_the_AI_Challenges","226246918_Safety_for_Physical_Human-Robot_Interaction","220755236_Classifying_human-robot_interaction_An_updated_taxonomy","285855850_A_model_for_types_and_levels_of_human_interaction_with_automation","272021251_Classification_of_physical_human-robot_interaction_scenarios_to_identify_relevant_requirements","256509329_A_research_paradigm_in_human-robot_interaction","242632592_Sociable_machines_expressive_social_exchange_between_robot_and_human","224989205_Safe_Physical_Human-Robot_Interaction_Measurements_Analysis_and_New_Insights","224285715_Artificial_Intelligence_A_Modern_Approach"]}