{"id":"325211540_On_the_direct_acquisition_of_beam's-eye-view_images_in_MRI_for_integration_with_external_beam_radiotherapy","abstract":"The recent interest in the integration of external beam radiotherapy with a magnetic resonance (MR) imaging unit offers the potential for real-time adaptive tumour tracking during radiation treatment. The tracking of large tumours which follow a rapid trajectory may best be served by the generation of a projection image from the perspective of the beam source, or \"beam's eye view\" (BEV). This type of image projection represents the path of the radiation beam, thus enabling rapid compensations for target translations, rotations and deformations, as well time-dependent critical structure avoidance. MR units have been traditionally incapable of this type of imaging except through lengthy 3D acquisitions and ray tracing procedures. This work investigates some changes to the traditional MR scanner architecture that would permit the direct acquisition of a BEV image suitable for integration with external beam radiotherapy. Based on the theory presented in this work, a phantom was imaged with nonlinear encoding-gradient field patterns to demonstrate the technique. The phantom was constructed with agarose gel tubes spaced two cm apart at their base and oriented to converge towards an imaginary beam source 100 cm away. A corresponding virtual phantom was also created and subjected to the same encoding technique as in the physical demonstration, allowing the method to be tested without hardware limitations. The experimentally acquired and simulated images indicate the feasibility of the technique, showing a substantial amount of blur reduction in a diverging phantom compared to the conventional imaging geometry, particularly with the nonlinear gradients ideally implemented. The theory is developed to demonstrate that the method can be adapted in a number of different configurations to accommodate all proposed integration schemes for MR units and radiotherapy sources. Depending on the configuration, the implementation of this technique will require between two and four additional nonlinear encoding coils.","authors":["Keith Wachowicz","Brad Murray","Biagio Gino Fallone"],"meta":["May 2018Physics in Medicine and Biology 63(12)","DOI:10.1088/1361-6560/aac5b9"],"references":["259250963_Impact_of_the_MLC_on_the_MRI_field_distortion_of_a_prototype_MRI-linac","228652057_A_Stream_Function_Method_For_Gradient_Coil_Design","220914546_Attempts_to_Bronchial_Tumor_Motion_Tracking_in_Portal_Images_during_Conformal_Radiotherapy_Treatment","321232811_Initial_observations_of_intra-_and_inter-_fractional_motion_variation_in_MR_guided_lung_SBRT","317188982_Real-time_dynamic_MR_image_reconstruction_using_compressed_sensing_and_principal_component_analysis_CS-PCA_Demonstration_in_lung_tumor_tracking","263131337_The_Magnetic_Resonance_Imaging-Linac_System","263131336_The_ViewRay_System_Magnetic_Resonance-Guided_and_Controlled_Radiotherapy","263131335_A_Facility_for_Magnetic_Resonance-Guided_Radiation_Therapy","263092062_The_Australian_Magnetic_Resonance_Imaging-Linac_Program","263092061_The_Rotating_Biplanar_Linac-Magnetic_Resonance_Imaging_System","261325541_Three-dimensional_liver_motion_tracking_using_real-time_two-dimensional_MRI","227992977_Probe_Design_and_Construction","43497157_Novel_Gradient_Coils_Designed_Using_a_Boundary_Element_Method","43447539_Winding_patterns_for_biplanar_MRI_shim_coils_with_rectangular_and_circular_target-field_regions","8473285_Use_of_spherical_harmonic_deconvolution_methods_to_compensate_for_nonlinear_gradient_effects_on_MRI_images","7759822_Clinical_Use_of_Electronic_Portal_Imaging","5590365_Linac-based_on-board_imaging_feasibility_and_the_dosimetric_consequences_of_head_roll_in_head-and-neck_IMRT_plans"]}