{"id":"325256573_Evolutionary_games_on_multilayer_networks_A_colloquium","abstract":"Networks form the backbone of many complex systems, ranging from the Internet\nto human societies. Accordingly, not only is the range of our interactions\nlimited and thus best described and modeled by networks, it is also a fact that\nthe networks that are an integral part of such models are often interdependent\nor even interconnected. Networks of networks or multilayer networks are\ntherefore a more apt description of social systems. This colloquium is devoted\nto evolutionary games on multilayer networks, and in particular to the\nevolution of cooperation as one of the main pillars of modern human societies.\nWe first give an overview of the most significant conceptual differences\nbetween single-layer and multilayer networks, and we provide basic definitions\nand a classification of the most commonly used terms. Subsequently, we review\nfascinating and counterintuitive evolutionary outcomes that emerge due to\ndifferent types of interdependencies between otherwise independent populations.\nThe focus is on coupling through the utilities of players, through the flow of\ninformation, as well as through the popularity of different strategies on\ndifferent network layers. The colloquium highlights the importance of pattern\nformation and collective behavior for the promotion of cooperation under\nadverse conditions, as well as the synergies between network science and\nevolutionary game theory.","authors":["Zhen Wang","Lin Wang","Attila Szolnoki","Matjaz Perc"],"meta":["May 2015The European Physical Journal B 88(5):124","DOI:10.1140/epjb/e2015-60270-7"],"references":["325256732_Immunization_of_Epidemics_in_Multiplex_Networks","275359239_Ranking_in_interconnected_multilayer_networks_reveals_versatile_nodes","275081015_From_a_single_network_to_a_network_of_networks","270653646_Not_Just_a_Theory-The_Utility_of_Mathematical_Models_in_Evolutionary_Biology","347563337_The_Calculus_of_Selfishness","334006082_Evolutionary_Dynamics_Exploring_the_Equations_of_Life","275292080_The_Major_Transitions_of_Evolution","273395749_Overlapping_Communities_Explain_Core-Periphery_Organization_of_Networks","273118658_The_Evolution_of_Cooperation","270406703_Helpers_among_Birds"]}