{"id":"325217781_On_a_new_extension_of_BTP_for_binary_CSPs","abstract":"The study of broken-triangles is becoming increasingly ambitious, by both solving constraint satisfaction problems (CSPs) in polynomial time and reducing search space size through either value merging or variable elimination. Considerable progress has been made in extending this important concept, such as dual broken-triangle and weakly broken-triangle, in order to maximize the number of captured tractable CSP instances and/or the number of merged values. Specifically, $m$-wBTP allows us to merge more values than BTP. DBTP, $\\forall \\exists$-BTP, $k$-BTP, WBTP and $m$-wBTP permit us to capture more tractable instances than BTP. However, except BTP, none of these extensions allows variable elimination while preserving satisfiability. Moreover, $k$-BTP and $m$-wBTP define bigger tractable classes around BTP but both of them generally need a high level of consistency. \n\nHere, we introduce a new weaker form of BTP, called $m$-fBTP for flexible broken-triangle property, which will represent a compromise between most of these previous tractable properties based on BTP. $m$-fBTP allows us on the one hand to eliminate more variables than BTP while preserving satisfiability and on the other to define a new bigger tractable class for which arc consistency is a decision procedure. Likewise, $m$-fBTP permits to merge more values than BTP but fewer than $m$-wBTP. The binary CSP instances satisfying $m$-fBTP are solved by algorithms of the state-of-the-art like MAC and RFL in polynomial time. An open question is whether it is possible to compute, in polynomial time, the existence of some variable ordering for which a given instance satisfies $1$-fBTP.","authors":["Achref El Mouelhi"],"meta":["October 2018Constraints 23(4):355-382","DOI:10.1007/s10601-018-9290-9","Project: Tractability, constraint decomposition, value merging, variable elmination"],"references":["311103278_A_BTP-Based_Family_of_Variable_Elimination_Rules_for_Binary_CSPs","281886829_Beyond_Consistency_and_Substitutability","281627188_A_Microstructure-Based_Family_of_Tractable_Classes_for_CSPs","279021734_Classes_Polynomiales_Cachees_de_la_Theorie_a_la_Pratique","277557390_On_Broken_Triangles","277250213_A_Hybrid_Tractable_Class_for_Non-Binary_CSPs","310820956_The_Power_of_Arc_Consistency_for_CSPs_Defined_by_Partially-Ordered_Forbidden_Patterns","306388329_Extending_Broken_Triangles_and_Enhanced_Value-Merging","302973999_Extending_the_Broken_Triangle_Property_tractable_class_of_binary_CSPs","293015480_Broken_triangles_From_value_merging_to_a_tractable_class_of_general-arity_constraint_satisfaction_problems","272020870_The_Extendable-Triple_Property_a_new_CSP_Tractable_Class_beyond_BTP","268214083_Hidden_Tractable_Classes_From_Theory_to_Practice","263729979_Unifying_and_extending_hybrid_tractable_classes_of_CSPs","263046157_Some_New_Tractable_Classes_of_CSPs_and_Their_Relations_with_Backtracking_Algorithms","272194163_Variable_and_Value_Elimination_in_Binary_Constraint_Satisfaction_via_Forbidden_Patterns"]}