{"id":"325205229_Cost_Calculation_of_Construction_Projects_Including_Sustainability_Factors_Using_the_Case_Based_Reasoning_CBR_Method","abstract":"The idea of sustainable development and the resulting environmentally friendly attitudes are increasingly used in construction projects. Designing in accordance with the principles of sustainable development has an impact on the costs of construction works. The authors of this paper proposed an approach to estimate the costs of sports field construction using the Case Based Reasoning method. In their analysis, they distinguished 16 factors that affect the cost of a construction project and are possible to already be described at an early stage of its preparation. The original elements of the work include: consideration of such environmental factors as the environmental impact of the building, materials used, the impact of the facility on the surroundings affecting the amount of implementation costs and development of own database containing 143 construction projects that are related to sports fields. In order to calculate the similarity of cases, different calculation formulas were applied depending on the type of data (quantitative, qualitative, uncertain, no data). The obtained results confirmed that the CBR method based on historical data and using criteria related to sustainable development may be useful in cost estimation in the initial phase of a construction project. Its application to the calculation of the costs that are related to the implementation of sports fields generates an error of 14%, which is a very good result for initial calculations. In the short run, such factors as the impact of the object and the type of materials that are used from the perspective of their influence on the environment may be decisive as far as the costs determined in the life cycle of the building are concerned, as well as the lowest costs of the building construction ensuring the appropriate quality and respect for the environment.","authors":["Agnieszka Lesniak","Krzysztof Zima"],"meta":["May 2018Sustainability 10(5):1608","DOI:10.3390/su10051608","Project: Methods of supporting cost calculation of construction works"],"references":["326755693_Cost_Estimating_of_Football_Pitches_Construction_in_the_Concept_Phase_Using_Case_Based_Reasoning","325062373_Houses_Based_on_Wood_as_an_Ecological_and_Sustainable_Housing_Alternative-Case_Study","323879606_Construction_Time_of_Three_Wall_Types_Made_of_Locally_Sourced_Materials_A_Comparative_Study","323779533_ANN_Based_Approach_for_Estimation_of_Construction_Costs_of_Sports_Fields","323157054_A_Hybrid_MCDM_Technique_for_Risk_Management_in_Construction_Projects","322446710_The_Architect_and_the_Paradigms_of_Sustainable_Development_A_Review_of_Dilemmas","321454939_A_Model_for_Shovel_Capital_Cost_Estimation_Using_a_Hybrid_Model_of_Multivariate_Regression_and_Neural_Networks","321425538_Harmonization_of_cyclical_construction_processes_a_systematic_review","323680742_Prediction_of_site_overhead_costs_with_the_use_of_artificial_neural_network_based_model","318441227_A_new_hybrid_fuzzy_MCDM_approach_for_evaluation_of_construction_equipment_with_sustainability_considerations"]}