{"id":"325214583_Changements_socio-environnementaux_et_evolution_des_pratiques_agropastorales_en_Afrique_sahelienne_etude_comparee_entre_le_Ferlo_Senegal_le_Gourma_Mali_et_le_Fakara_Niger","abstract":"Dans un contexte biophysique caractérisé par d’importants changements socio-environnementaux,l’objectif principal de la thèse vise à comprendre dans quelle mesure les pratiques agropastorales modulent dans l’espace et dans le temps la vulnérabilité et l’adaptabilité des agro-écosystèmes et des sociétés agropastorales du Sahel. Afin d’atteindre le but visé, cette problématique a été envisagée à l’échelle macro-régionale, celle du Sahel,en s’appuyant sur trois sites d’étude micro-régionaux à savoir le Ferlo (Sénégal) ; le Gourma (Mali) et le Fakara (Niger) au sein desquels les perceptions et les représentations des sociétés ont été étudiées dans un échantillon de villages et de campements.La méthode d’analyse élaborée comporte deux volets :1) un travail de cartographie par télédétection basé sur le traitement d’images satellites, et 2) des analyses géo-textuelles basées sur la lexicométrie à partir d’entretiens semi-directifs. La cartographie par télédétection a permis d’établir un diagnostic aux échelles micro-régionales et locales sur l’évolution du couvert végétal depuis les années 70 jusqu’en 2010. Du diagnostic tiré d’une approche multiscalaire, il ressort des contrastes intra et inter régionaux dans l’évolution de la couverture du sol par la végétation qui invitent à nuancer les observations faisant état d’un reverdissement du Sahel. L’articulation de la télédétection avec les enquêtes de terrain a permis d’appréhender l’évolution des ressources végétales d’une part, et d’autre part d’examiner la diversité des réponses données par les sociétés rurales du Sahel à la crise climatique des années 70 et 80, et aux évolutions socio-économiques récentes qu’ont connu leur pays et leur région. A travers la lexicométrie, des analyses géo-textuelles basées sur les entretiens semi-directifs ont permis d’approcher les perceptions des agropasteurs au sujet de la vulnérabilité et de la résilience des ressources naturelles. A la lumière des perceptions exprimées, les pratiques adaptatives ont été appréhendées dans leur variété. Il en ressort des reconfigurations socio-spatiales dans les trajectoires des activités agricoles et pastorales qui expliquent en partie les contrastes intra et inter régions observés entre le Ferlo, le Gourma et le Fakara.","authors":["Oumar Marega"],"meta":["October 2016"],"references":[]}