{"id":"325227552_A_logic-based_method_to_build_signaling_networks_and_propose_experimental_plans","abstract":"With the dramatic increase of the diversity and the sheer quantity of biological data generated, the construction of comprehensive signaling networks that include precise mechanisms cannot be carried out manually anymore. In this context, we propose a logic-based method that allows building large signaling networks automatically. Our method is based on a set of expert rules that make explicit the reasoning made by biologists when interpreting experimental results coming from a wide variety of experiment types. These rules allow formulating all the conclusions that can be inferred from a set of experimental results, and thus building all the possible networks that explain these results. Moreover, given an hypothesis, our system proposes experimental plans to carry out in order to validate or invalidate it. To evaluate the performance of our method, we applied our framework to the reconstruction of the FSHR-induced and the EGFR-induced signaling networks. The FSHR is known to induce the transactivation of the EGFR, but very little is known on the resulting FSH- and EGF-dependent network. We built a single network using data underlying both networks. This leads to a new hypothesis on the activation of MEK by p38MAPK, which we validate experimentally. These preliminary results represent a first step in the demonstration of a cross-talk between these two major MAP kinases pathways.","authors":["Adrien Rougny","Pauline Gloaguen","Nathalie Langonné","Eric Reiter"],"meta":["May 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-26006-2"],"references":["321663694_Systems_Biology_Graphical_Notation_Process_Description_language_Level_1_Version_13","321662513_Systems_Biology_Graphical_Notation_Entity_Relationship_language_Level_1_Version_2","321660724_Systems_Biology_Graphical_Notation_Activity_Flow_language_Level_1_Version_12","321290965_From_word_models_to_executable_models_of_signaling_networks_using_automated_assembly","304009364_Qualitative_dynamics_semantics_for_SBGN_process_description","290173456_How_to_infer_gene_networks_from_expression_profiles","284033240_Systems_Biology_Graphical_Notation_Entity_Relationship_language_Level_1_Version_2","300546247_Inferring_Executable_Models_from_Formalized_Experimental_Evidence","291787738_The_BioPAX_community_standard_for_pathway_data_sharing","284623705_Specificity_and_mechanism_of_action_of_some_commonly_used_protein_kinase_inhibitors"]}