{"id":"325284861_PRIMENENIE_DISTANCIONNYH_TEHNOLOGIJ_DLA_RASSIRENIA_VOZMOZNOSTEJ_OBRAZOVATELNOJ_DEATELNOSTI_V_INSTITUTE","abstract":"The article describes the experience of using remote technologies in the educational environment of the Institute of Computer Science and Technology of Peter the Great St.Petersburg Polytechnic University. The aim of the article is the analysis of the problems associated with the use of online learning courses and the systematization of functions to manage the learning process, facing the administration of the Institute (faculty). In the management system of online courses three levels are defined: developer-teacher, administrator of curricula and initiator of online learning application at the university. The problems of organization and administration of online courses at the middle level of management are considered. Motivations for the development of distance education in the institute are defined, which concern not only teachers and students, but also the institution as a whole. Due to the online learning courses are expanding the capabilities of the Institute on the use of distance learning education, training graduate and undergraduate students. The tasks of the Institute on the use and development of distance technologies are considered. The use of online learning technology associated with the educational programs of the Institute. Three stages of introduction of online technologies are described: a stage of training of teachers, a stage of development both inside university courses and a stage of development of open online courses. Among the features of the application selected model of mixed or hybrid learning. The issue of selection of online courses for inclusion on platforms of open education is considered.","authors":["Sergey Aleksandrovih Molodyakov"],"meta":["May 2018"],"references":["347477510_Features_of_development_and_implementation_of_courses_of_the_educational_field_Mathematics_in_distance_education_system","281266575_Positive_and_negative_sides_of_using_LMS_Moodle_in_studying_process"]}