{"id":"325253453_BUSINESS_INFORMATICS_WITH_SPECIAL_REFERENCE_TO_BIG_DATA_AS_AN_EMERGING_AREA_A_BASIC_REVIEW","abstract":"Business Informatics is about the applications and integration of Information Science and Technology into Business and Management tools and techniques into the Business Systems. It is also about combining the concept of Business and Technologies. The field is also called as Business Information Science and in some countries as Business Information Systems. The areas in current age are not only the tools and techniques but also a subject. Initially, the subject treated as a concept and research areas and now this becomes a full-fledged subject in various context. The area of Business Informatics is also increasing in recent past from technologies and tools to conceptual management areas viz. IT Governance, IT Policy, IT Management, Information Administration, and Information Management. In recent past, the concept of technologies have been increased and several areas are included which are majorly part of components of Information Technologies viz. Database Technology, Networking Technology, Communication Technology etc. Among the latest areas Data Sciences play a lead role with the components of Big Data Technologies powered by Data warehousing, Data Mining etc. This paper may be treated as a valuable source for the newcomers in the field of IT and Computing having less conceptual knowledge in the area of Business Informatics and new to the concepts of Big Data. The paper may be a good alternative to know about the basics, characteristics, nature of Big Data with fundamentals of applications.","authors":["A Bhuimali","Sreeramana Aithal","P.K. Paul"],"meta":["April 2018","DOI:10.5281/zenodo.1249786","Project: Information Science"],"references":["323400369_Business_Information_Sciences_emphasizing_Digital_Marketing_as_an_emerging_field_of_Business_IT_A_Study_of_Indian_Private_Universities","288484047_Educating_the_Next_Generation_of_Data_Scientists","282692841_Big_data_and_data_science_What_should_we_teach","276927463_Bridging_the_Data_Talent_Gap_Positioning_the_iSchool_as_an_Agent_for_Change","256439081_Data_Science_and_Its_Relationship_to_Big_Data_and_Data-Driven_Decision_Making","322350953_Data_Science_Vis-a-Vis_efficient_healthcare_and_medical_systems_A_techno-managerial_perspective","320674521_A_Novel_Educational_Proposal_and_Strategies_Toward_Promoting_Cloud_Computing_Big_Data_and_Human-Computer_Interaction_in_Engineering_Colleges_and_Universities","305791185_Data_science_programs_in_US_higher_education_An_exploratory_content_analysis_of_program_description_curriculum_structure_and_course_focus","284679162_Business_Intelligence_and_Analytics_From_Big_Data_to_Big_Impact","232279315_Data_Scientist_The_Sexiest_Job_of_the_21st_Century"]}