{"id":"325272446_RepTB_a_gene_ontology_based_drug_repurposing_approach_for_tuberculosis","abstract":"Tuberculosis (TB) is the world's leading infectious killer with 1.8 million deaths in 2015 as reported by WHO. It is therefore imperative that alternate routes of identification of novel anti-TB compounds are explored given the time and costs involved in new drug discovery process. Towards this, we have developed RepTB. This is a unique drug repurposing approach for TB that uses molecular function correlations among known drug-target pairs to predict novel drug-target interactions. In this study, we have created a Gene Ontology based network containing 26,404 edges, 6630 drug and 4083 target nodes. The network, enriched with molecular function ontology, was analyzed using Network Based Inference (NBI). The association scores computed from NBI are used to identify novel drug-target interactions. These interactions are further evaluated based on a combined evidence approach for identification of potential drug repurposing candidates. In this approach, targets which have no known variation in clinical isolates, no human homologs, and are essential for Mtb's survival and or virulence are prioritized. We analyzed predicted DTIs to identify target pairs whose predicted drugs may have synergistic bactericidal effect. From the list of predicted DTIs from RepTB, four TB targets, namely, FolP1 (Dihydropteroate synthase), Tmk (Thymidylate kinase), Dut (Deoxyuridine 5'-triphosphate nucleotidohydrolase) and MenB (1,4-dihydroxy-2-naphthoyl-CoA synthase) may be selected for further validation. In addition, we observed that in some cases there is significant chemical structure similarity between predicted and reported drugs of prioritized targets, lending credence to our approach. We also report new chemical space for prioritized targets that may be tested further. We believe that with increasing drug-target interaction dataset RepTB will be able to offer better predictive value and is amenable for identification of drug-repurposing candidates for other disease indications too.","authors":["Anurag Passi","Neeraj Kumar Rajput","David J. Wild","Anshu Bhardwaj"],"meta":["May 2018Journal of Cheminformatics 10(1)","DOI:10.1186/s13321-018-0276-9"],"references":["327490918_dUTP_pyrophosphatase_is_an_essential_enzyme_in_Saccharomyces_cerevisiae","313237253_Docking-based_virtual_screening_of_known_drugs_against_murE_of_Mycobacterium_tuberculosis_towards_repurposing_for_TB","311737486_Expected_effects_of_adopting_a_9_month_regimen_for_multidrug-resistant_tuberculosis_a_population_modelling_analysis","308727710_Repurposing_clinically_approved_cephalosporins_for_tuberculosis_therapy","308699336_Validation_of_CoaBC_as_a_Bactericidal_Target_in_the_Coenzyme_A_Pathway_of_Mycobacterium_tuberculosis","308544431_Repurposing_clinically_approved_cephalosporins_for_tuberculosis_therapy","315949795_Bioinformatics_approach_to_prioritize_drugs_towards_repurposing_for_tuberculosis","313826968_Cardiac_Immunomodulation","299535387_Repurposing_drugs_for_treatment_of_tuberculosis_TB_a_role_for_non-steroidal_anti-inflammatory_drugs_NSAIDs","294729730_Drug-resistant_TB_Deadly_costly_and_in_need_of_a_vaccine","285322518_Drug_target_prioritization_by_perturbed_gene_expression_and_network_information","283516041_Rifampicin-Induced_Nephrotoxicity_in_a_Tuberculosis_Patient","281226688_Optimizing_drug-target_interaction_prediction_based_on_random_walk_on_heterogeneous_networks","275358053_Role_of_folP1_and_folP2_Genes_in_the_Action_of_Sulfamethoxazole_and_Trimethoprim_Against_Mycobacteria","282568720_Recognizing_drug_targets_using_evolutionary_information_Implications_for_repurposing_FDA-approved_drugs_against_Mycobacterium_tuberculosis_H37Rv"]}