{"id":"325273779_Simulacion_basada_en_agentes_Una_metodologia_para_el_estudio_de_sistemas_complejos","abstract":"Las ciencias de la complejidad se han desarrollado de forma magnífica en las últimas décadas. Un conjunto amplio de principios, marcos conceptuales, métodos, teorías y herramientas se ha propuesto para estudiar sistemas tan diversos como las células, los ecosistemas, las redes de comercio o las ciudades. Dentro de ese contexto, la simulación basada en agentes (SBA) ha proporcionado una metodología especialmente poderosa para avanzar la teoría y la investigación de los sistemas complejos. De acuerdo con la idea central de la SBA, es posible recrear, constructivamente, los patrones que exhiben tales sistemas, a través de la simulación computacional de sus componentes, su entorno y las interacciones entre ellos. La SBA constituye un laboratorio virtual sobre el que es posible elaborar explicaciones, experimentos, teorías y predicciones acerca de los sistemas complejos. En este capítulo se realiza una introducción a la lógica, los usos, las ventajas y las aplicaciones de la SBA.","authors":["Nelson Alfonso Gómez-Cruz"],"meta":["January 2018","DOI:10.2307/j.ctvfc5506.12","In book: Construcción de problemas de investigación : diálogos entre el interior y el exterior (pp.230-268)Chapter: 6 (Part 2)Publisher: Universidad de Antioquia y Universidad Pontificia BolivarianaEditors: Maria Luisa Eschenhagen, Carlos Eduardo Maldonado, Gabriel Velez Cuartas, Germán Guerrero","Project: Grupo de trabajo en Simulación basada en agentes"],"references":["308953674_Ant_Colony_Optimization","332089344_Great_Principles_of_Computing","329648617_Growing_Artificial_Societies_Social_Science_from_the_Bottom_Up","321613427_Agent-Based_Optimization","318453843_Introduction_to_Computational_Social_Science","313706874_Adaptation_in_natural_and_artificial_systems","312803895_Agent-based_modeling_Methods_and_techniques_for_simulating_human_systems","310830392_Agent-Based_Simulation","305262729_Agent-Based_Modelling_in_Economics","304036469_Agent-Based_Modeling_and_Artificial_Life"]}