{"id":"325217580_Mobile_Encrypted_Traffic_Classification_Using_Deep_Learning","abstract":"The massive adoption of hand-held devices has led to the explosion of mobile traffic volumes traversing home and enterprise networks, as well as the Internet. Procedures for inferring (mobile) applications generating such traffic, known as Traffic Classification (TC), are the enabler for highly-valuable profiling information while certainly raise important privacy issues. The design of accurate classifiers is however exacerbated by the increasing adoption of encrypted protocols (such as TLS), hindering the applicability of highly-accurate approaches, such as deep packet inspection. Additionally, the (daily) expanding set of apps and the moving-target nature of mobile traffic makes design solutions with usual machine learning, based on manually-and expert-originated features, outdated. For these reasons, we suggest Deep Learning (DL) as a viable strategy to design traffic classifiers based on automatically-extracted features, reflecting the complex mobile-traffic patterns. To this end, different state-of-the-art DL techniques from TC are here reproduced, dissected, and set into a systematic framework for comparison, including also a performance evaluation workbench. Based on three datasets of real human users' activity, performance of these DL classifiers is critically investigated, highlighting pitfalls, design guidelines, and open issues of DL in mobile encrypted TC.","authors":["Giuseppe Aceto","Domenico Ciuonzo","Antonio Montieri","Antonio Pescapè"],"meta":["May 2018","DOI:10.23919/TMA.2018.8506558","Conference: IEEE/ACM Network Traffic Measurement and Analysis Conference (TMA'18)","Project: Mobile and Encrypted Traffic Classification"],"references":["328176051_Eavesdropping_on_Fine-Grained_User_Activities_Within_Smartphone_Apps_Over_Encrypted_Network_Traffic","321237003_Studying_TLS_Usage_in_Android_Apps","321051971_Multi-Classification_Approaches_for_Classifying_Mobile_App_Traffic","319622754_Deep_Packet_A_Novel_Approach_For_Encrypted_Traffic_Classification_Using_Deep_Learning","319569635_Network_Traffic_Classifier_With_Convolutional_and_Recurrent_Neural_Networks_for_Internet_of_Things","319235742_Automated_Website_Fingerprinting_through_Deep_Learning","319054632_End-to-end_encrypted_traffic_classification_with_one-dimensional_convolution_neural_networks","316176048_Malware_traffic_classification_using_convolutional_neural_network_for_representation_learning","326918292_Studying_TLS_Usage_in_Android_Apps","321025084_Traffic_Analysis_with_Deep_Learning"]}