{"id":"325269624_How_important_is_scientific_software_in_bioinformatics_research_A_comparative_study_between_international_and_Chinese_research_communities","abstract":"Software programs are among the most important tools in data‐driven research. The popularity of well‐known packages and corresponding large numbers of citations received bear testimony of the contribution of scientific software to academic research. Yet software is not generally recognized as an academic outcome. In this study, a usage‐based model is proposed with varied indicators including citations, mentions, and downloads to measure the importance of scientific software. We performed an investigation on a sample of international bioinformatics research articles, and on a sample from the Chinese community. Our analysis shows that scientists in the field of bioinformatics rely heavily on scientific software: the major differences between the international community and the Chinese example being how scientific packages are mentioned in publications and the time gap between the introduction of a package and its use. Biologists publishing in international journals tend to apply the latest tools earlier; Chinese scientists publishing in Chinese tend to follow later. Further, journals with higher impact factors tend to publish articles applying the latest tools earlier.","authors":["Bo Yang","Shuiqing Huang","Xue Wang","Ronald Rousseau"],"meta":["May 2018Journal of the Association for Information Science and Technology 69(3)","DOI:10.1002/asi.24031"],"references":["305139267_Academic_software_downloads_from_Google_Code_useful_usage_indicators","283889572_Understanding_the_scientific_software_ecosystem_and_its_impact_Current_and_future_measures","283175915_The_structure_and_comparative_advantages_of_China's_scientific_research_quantitative_and_qualitative_perspectives","324621965_Social_Stratification_in_Science","308844362_Disciplinary_differences_of_software_use_and_impact_in_scientific_literature","308098066_BLAST_Architecture_and_applications","302342160_BLAST_architecture_and_applications","295277074_Measuring_and_Anticipating_the_Impact_of_Data_Reuse","288060980_The_unsung_heroes_of_scientific_software","282936072_Assessing_the_impact_of_software_on_science_A_bootstrapped_learning_of_software_entities_in_full-text_papers"]}