{"id":"325374546_Structured_Streaming_A_Declarative_API_for_Real-Time_Applications_in_Apache_Spark","abstract":"With the ubiquity of real-time data, organizations need streaming systems that are scalable, easy to use, and easy to integrate into business applications. Structured Streaming is a new high-level streaming API in Apache Spark based on our experience with Spark Streaming. Structured Streaming differs from other recent streaming APIs, such as Google Dataflow, in two main ways. First, it is a purely declarative API based on automatically incrementalizing a static relational query (expressed using SQL or DataFrames), in contrast to APIs that ask the user to build a DAG of physical operators. Second, Structured Streaming aims to support end-to-end real-time applications that integrate streaming with batch and interactive analysis. We found that this integration was often a key challenge in practice. Structured Streaming achieves high performance via Spark SQL's code generation engine and can outperform Apache Flink by up to 2x and Apache Kafka Streams by 90x. It also offers rich operational features such as rollbacks, code updates, and mixed streaming/batch execution. We describe the system's design and use cases from several hundred production deployments on Databricks, the largest of which process over 1 PB of data per month.","authors":["Michael Armbrust","Tathagata Das","Joseph Torres","Burak Yavuz"],"meta":["May 2018","DOI:10.1145/3183713.3190664","Conference: the 2018 International Conference"],"references":["276535565_Trill","220988193_The_Design_of_the_Borealis_Stream_Processing_Engine","220831920_Stateful_Bulk_Processing_for_Incremental_Analytics","305260487_Efficiently_Updating_Materialized_Views","290471147_Spark_SQL","283189749_The_dataflow_model_A_practical_approach_to_balancing_correctness_latency_and_cost_in_massive-scale_unbounded_out-of-order_data_processing","262362581_Naiad_A_timely_dataflow_system","262166616_Discretized_streams_Fault-tolerant_streaming_computation_at_scale","255719644_Issue_in_data_stream_management","221213696_TelegraphCQ_Continuous_Dataflow_Processing","221212831_Continuous_Analytics_Over_Discontinuous_Streams","220988144_Consistency_Analysis_in_Bloom_a_CALM_and_Collected_Approach","220967230_Hive_-_A_Petabyte_Scale_Data_Warehouse_Using_Hadoop","3296243_Incremental_recomputation_of_active_relational_expression"]}