{"id":"325345073_Mapa_de_los_cibermedios_de_Espana_en_2018_analisis_cuantitativo","abstract":"[ES] Introducción: A punto de cumplir su primer cuarto de siglo, los medios periodísticos digitales de España continúan con su crecimiento constante. La presente investigación presenta un mapa actualizado, a marzo de 2018, de los cibermedios periodísticos en España. Metodología: En concreto, identifica y analiza una muestra compuesta por 3.431 medios digitales, localizados gracias a una revisión de directorios especializados y al empleo de diversas estrategias de búsqueda avanzada. Se trata de la mayor muestra de publicaciones digitales de España hasta el momento. Resultados: Sobre el conjunto de medios identificado, se estudian aspectos como el estado actual de las publicaciones (activas o inactivas), número y tipo de plataformas donde se publican, tema, alcance, distribución territorial, lenguas de publicación, titularidad y modelo de financiación. Discusión y Conclusiones: El resultado es un mapa actualizado y minucioso, aunque no exhaustivo, de los cibermedios en España, que retrata estas publicaciones como un medio altamente consolidado y en expansión. \n\n[EN] Introduction: On the verge of reaching their first quarter of a century, the digital news media in Spain continue with their unstoppable growth. This research presents an updated map, as of March 2018, of digital news media in Spain. Methodology: It identifies and analyses a sample made up of 3,431 digital media, located thanks to a thorough review of directories of the media industry, as well as the use of several advanced search strategies. This dataset provides the largest sample of Spanish digital publications so far. Results: Among the media studied, aspects such as the current status of these publications (either active or inactive), number and type of platforms where they are published, news topic, scope, territorial distribution, publishing languages, ownership and business model are studied. Discussion and Conclusions: The result is the most updated and comprehensive, although not exhaustive, map of digital news media in Spain, which portrays these publications as a highly consolidated and expanding medium","authors":["Ramón Salaverría","Pilar Martinez-Costa","James Breiner"],"meta":["May 2018Revista Latina de Comunicacion Social","DOI:10.4185/RLCS-2018-1295","Projects: DIGINATIVEMEDIA - Digital native media in Spain: characterisation and trends // Cibermedios nativos digitales en España: caracterización y tendenciasUSPRINME - News Preferences and Use within the New Media Scenario in Spain: Audiences, Companies, Contents, and Multiscreen Influence Management"],"references":["315691455_Los_labs_de_medios_en_Espana_la_innovacion_desde_el_area_de_la_organizacion_periodistica","312020494_Tipologia_de_los_cibermedios_periodisticos_bases_teoricas_para_su_clasificacion","304525995_Los_'labs'_de_medios_en_Espana_modelos_y_tendencias","304005930_Metamedios_y_periodismo_revision_panoramica_de_los_nuevos_cibermedios","299445399_Redefinir_al_comunicador","291152981_Ciberperiodismo_diez_anos_de_prensa_digital_en_Espana","277934735_Prensa_digital_en_2013-2014","274632856_Prensa_en_Internet_nuevos_modelos_de_negocio_en_el_escenario_de_la_convergencia","301852346_Informacion_en_el_movil","299470241_Innovacion_y_desarrollo_de_los_cibermedios_en_Espana","228618500_Investigacion_internacional_sobre_ciberperiodismo_hipertexto_interactividad_multimedia_y_convergencia","271440533_Evolucion_de_los_Cibermedios_De_la_convergencia_digital_a_la_distribucion_multiplataforma","220437848_Interactivity_in_the_Daily_Routines_of_Online_Newsrooms_Dealing_with_an_Uncomfortable_Myth","28220806_Las_redes_sociales_trastocan_los_modelos_de_los_medios_de_comunicacion_tradicionales"]}