{"id":"325306289_Natural_Neighborhood_Graph-based_Instance_Reduction_Algorithm_without_Parameters","abstract":"Instance-based learning often uses all instances in a training set to construct inference structures. The large number of instances and attributes may lead to high storage requirements and low search efficiency. Instance reduction is developed to address these issues by removing irrelevant instances and noises from the training set. However, existing reduction techniques still have the shortcomings of parameter dependency and relatively low accuracy and reduction rates. In this study, we present a natural neighborhood graph-based instance reduction algorithm, namely, NNGIR. A natural neighborhood graph (NaNG) is automatically constructed by the natural neighbor search algorithm. This graph can provide a compact description of the nearest neighbor relation over pairs of instances. NNGIR applies NaNG to divide the original training set into noisy, border and internal instances. Next, the algorithm obtains a reduced set by eliminating noisy and redundant points. NNGIR has three main advantages: (1) it is a non-parameter instance reduction algorithm due to the use of natural neighborhood graphs; (2) it strongly increases the reduction rate while maintaining or even improving the predication accuracy; (3) its fluctuation of reduction rates for different types of data sets is notably small. The efficiency of NNGIR is supported by the positive results from the experiments conducted on both synthetic and real data sets.","authors":["Lijun Yang","Qing-sheng Zhu","Huang Jinlong","Dongdong Cheng"],"meta":["May 2018Applied Soft Computing 70","DOI:10.1016/j.asoc.2018.05.029"],"references":["312404614_QCC_a_novel_clustering_algorithm_based_on_Quasi-Cluster_Centers","312047515_Minimum_redundancy_maximum_relevance_feature_selection_approach_for_temporal_gene_expression_data","312235303_Adaptive_edited_natural_neighbor_algorithm","303533377_Natural_Neighbor_a_self-adaptive_neighborhood_method_without_parameter_K","283538918_A_Non-parameter_Outlier_Detection_Algorithm_Based_on_Natural_Neighbor","275149242_A_new_fast_reduction_technique_based_on_binary_nearest_neighbor_tree","262322176_ATISA_Adaptive_Threshold-based_Instance_Selection_Algorithm","222972880_A_class_boundary_preserving_algorithm_for_data_condensation"]}