{"id":"325366202_Porosity-Permeability_Relations_for_Evolving_Pore_Space_A_Review_with_a_Focus_on_Bio-geochemically_Altered_Porous_Media","abstract":"Reactive transport processes in a porous medium will often both cause changes to the pore structure, via precipitation and dissolution of biomass or minerals, and be affected by these changes, via changes to the material’s porosity and permeability. An understanding of the pore structure morphology and the changes to flow parameters during these processes is critical when modeling reactive transport. Commonly applied porosity–permeability relations in simulation models on the REV scale use a power-law relation, often with slight modifications, to describe such features; they are often used for modeling the effects of mineral precipitation and/or dissolution on permeability. To predict the reduction in permeability due to biomass growth, many different and often rather complex relations have been developed and published by a variety of authors. Some authors use exponential or simplified Kozeny–Carman relations. However, many of these relations do not lead to fundamentally different predictions of permeability alteration when compared to a simple power-law relation with a suitable exponent. Exceptions to this general trend are only few of the porosity–permeability relations developed for biomass clogging; these consider a residual permeability even when the pore space is completely filled with biomass. Other exceptions are relations that consider a critical porosity at which the porous medium becomes impermeable; this is often used when modeling the effect of mineral precipitation. This review first defines the scale on which porosity–permeability relations are typically used and aims at explaining why these relations are not unique. It shows the variety of existing approaches and concludes with their essential features.","authors":["Johannes Hommel","Edward Coltman","Holger Class"],"meta":["September 2018Transport in Porous Media 124(B10)","DOI:10.1007/s11242-018-1086-2"],"references":["314983581_Reaction_Rates_in_Chemically_Heterogeneous_Rock_-_Coupled_Impact_of_Structure_and_Flow_Properties_Studied_by_X-ray_Microtomography","313537982_Dynamic_Reservoir-Condition_Microtomography_of_Reactive_Transport_in_Complex_Carbonates_Effect_of_Initial_Pore_Structure_and_Initial_Brine_pH","296332602_Reservoir_Condition_Imaging_of_Reactive_Transport_in_Heterogeneous_Carbonates_Using_Fast_Synchrotron_Tomography_-_Effect_of_Initial_Pore_structure_and_Flow_Conditions","289601513_Pore-scale_simulation_of_carbonate_dissolution_in_micro-CT_images","341661398_The_Physics_of_Flow_Through_Porous_Media_3rd_Edition","314785753_A_Fast_and_Direct_Method_of_Permeability_Measurements_on_Drill_Cuttings","314758673_Permeability_Damage_in_Diatomite_Due_to_in-situ_Silica_DissolutionPrecipitation","298738424_Biomineralization_Bioremediation_and_Biorecovery_of_Toxic_Metals_and_Radionuclides","295864657_Fracture_Sealing_with_Microbially-Induced_Calcium_Carbonate_Precipitation_A_Field_Study","289223438_Statistical_network_theory_of_silica_deposition_and_dissolution_in_diatomite"]}