{"id":"325312020_The_strategic_national_infrastructure_assessment_of_digital_communications","abstract":"Purpose: Public policy requires effective identification of the current and emerging issues being faced in industry and beyond. This paper identifies a set of key issues currently facing digital communications and reviews their relevance for the strategic provision of infrastructure, particularly within the UK context. Design/methodology/approach: The methodology focuses on taking a horizon scanning approach to obtaining current information from a range of authoritative decision-makers across industry, government and academia. After structuring the issues identified, these areas are explored by a multi-disciplinary research team covering engineering, economics and computer science. Findings: Five key categories were identified including (i) future demand, (ii) coverage and capacity, (iii) policy and regulation, (iv) economics and business models, and (v) technology. The results are reported for both fixed and wireless networks. Shared issues affecting the wider digital ecosystem are also identified including Brexit, connecting remote areas, and the degree to which the economics of infrastructure allows for building multiple overlapping infrastructures. We find that future demand uncertainty is one of the major issues affecting the digital communications sector driven by rigid willingness-to-pay, weak revenue and an increasing shift from fixed to wireless technologies. Policy must create the market conditions that encourage the entry of new competitors with innovative thinking and disruptive business models. Research limitations/implications: A limitation of the analysis is that it is quite UK-focused, hence further research could broaden this analysis to assessing issues at a continental or global scale. Practical implications: Social implications: Originality/value: The value of this paper originates from the breadth of the expert elicitation exercise carried out to gather the initial set of issues, followed by the analysis of this data by a multi-disciplinary team of researchers. The results direct a future research agenda, as many issues are indicative of a lack of existing evidence to support effective decision-making.","authors":["Edward Oughton"],"meta":["May 2018","DOI:10.17863/CAM.23343","Project: Mistral: Multi-scale infrastructure systems analytics"],"references":["318768633_The_cost_coverage_and_rollout_implications_of_5G_infrastructure_in_Britain","298796193_The_ITU-T's_new_Gfast_standard_brings_DSL_into_the_gigabit_era","283986398_Software_Defined_Optical_Networks_SDONs_A_Comprehensive_Survey","314525101_Did_Separating_Openreach_from_British_Telecom_Benefit_Consumers","313629843_Cisco_Visual_Networking_Index_Global_Mobile_Data_Traffic_Forecast_Update_2014-2019","311631198_Network_Function_Virtualization","306381338_European_mobile_markets_and_the_doctrine_of_4_networks_good_3_networks_bad","305651386_Multilevel_governance_and_broadband_infrastructure_development_Evidence_from_Canada","300572800_Strategies_to_Promote_Broadband_Demand","273793036_DOCSIS_31_Scaling_broadband_cable_to_Gigabit_speeds"]}