{"id":"325372117_Accelerating_the_Branch-and-Price_Algorithm_Using_Machine_Learning","abstract":"This study presents a widely applicable approach to accelerate the computation time of the Branch-and-Price (BaP) algorithm, which is a very powerful exact method used for solving complex combinatorial problems. Existing studies indicate that the most computationally demanding element of the BaP algorithm is the pricing problem. The case-studies presented in this paper show that more than 90% of the total Central Processing Unit (CPU) processing time is consumed by solving the pricing problem. The pricing problem is repetitive in nature and it solves the same problem from scratch differing only in the input dual prices. In this study, we demonstrate how to utilize the knowledge gained from previous executions of the pricing problem to reduce the solution space of pricing problems solved in future iterations. The solution is based on an online machine learning method that is not tailor-made for a specific problem (but needs a proper problem-dependent feature selection) and uses a very fast regression model that generates negligible overhead compared to the total CPU processing time of the BaP algorithm. The method predicts a tight upper bound for the current iteration of the pricing problem while preserving the exactness of the BaP algorithm. The efficiency of the proposed approach is demonstrated by two distinct case-studies: the nurse rostering problem and the scheduling of time-division multiplexing for multi-core platforms. The experiments carried out for both case-studies using benchmark instances from the literature show a 40% and 22% average CPU time reduction for the entire BaP algorithm.","authors":["Roman Václavík","Antonin Novak","Premysl Sucha","Zdeněk Hanzálek"],"meta":["May 2018European Journal of Operational Research 271(3)","DOI:10.1016/j.ejor.2018.05.046"],"references":["279835628_Efficiently_Solving_Repeated_Integer_Linear_Programming_Problems_by_Learning_Solutions_of_Similar_Linear_Programming_Problems_using_Boosting_Trees","261565830_New_approaches_to_nurse_rostering_benchmark_instances","303269133_Gaussian_Processes_for_Machine_Learning","284685941_Branch_and_Price_Column_generation_for_solving_huge_integer_programs","284235265_Scalable_and_Efficient_Configuration_of_Time-Division_Multiplexed_Resources","278651717_The_Nature_of_Statistical_Learning_Theory","276100796_An_Accelerated_Branch-and-Price_Algorithm_for_Multiple-Runway_Aircraft_Sequencing_Problems","270917507_A_branch-and-price_approach_for_a_multi-period_vehicle_routing_problem","262340005_Branch-and-price_and_constraint_programming_for_solving_a_real-life_technician_dispatching_problem","260112780_A_Branch-and-Price_Algorithm_to_Solve_the_Integrated_Berth_Allocation_and_Yard_Assignment_Problem_in_Bulk_Ports"]}