{"id":"325374976_Towards_the_Fusion_of_Intrusive_and_Non-intrusive_Load_Monitoring_A_Hybrid_Approach","abstract":"With Electricity as a fundamental part of our life, its production has still large, negative environmental impact. Therefore, one strain of research is to optimize electricity usage by avoiding its unnecessary consumption or time its consumption when green energy is available. The shift towards an Advanced Metering Infrastructure (AMI) allows to optimize energy distribution based on the current load at residence level. However, applications such as Demand Management and Advanced Load Forecasting require information further down at device level, which cannot be provided by standard electricity meters nor existing AMIs. Hence, different approaches for appliance monitoring emerged over the past 30 years which are categorized into Intrusive systems requiring multiple distributed sensors and Non-Intrusive systems requiring a single unobtrusive sensor. Although each category has been individually explored, hybrid approaches have received little attention. Our experiments highlight that variable consumer devices (e.g. PCs) are detrimental to the detection performance of non-intrusive systems. We further show that their influence can be inhibited by using sensor data from additional intrusive sensors. Even fairly straightforward sensor fusion techniques lead to a classification performance (F1) gain from 84.88 % to 93.41 % in our test setup. As this highlights the potential to contribute to the global goal of saving energy, we define further research directions for hybrid load monitoring systems.","authors":["Benjamin Völker","Philipp Scholl","Tobias Schubert","Bernd Becker"],"meta":["June 2018","DOI:10.1145/3208903.3212052","Conference: the Ninth International Conference"],"references":["224577690_Modeling_and_Estimating_Current_Harmonics_of_Variable_Electronic_Loads","224225559_Nonintrusive_Appliance_Load_Monitoring_Review_and_Outlook","221081207_SmartMeterKOM_A_low-cost_wireless_sensor_for_distributed_power_metering","2984633_Nonintrusive_appliance_load_monitoring"]}