{"id":"325362194_An_improved_Density_Peaks_Clustering_Algorithm_with_Fast_Finding_Cluster_Centers","abstract":"Fast and efficient are common requirements for all clustering algorithms. Density peaks clustering algorithm (DPC) can deal with non-spherical clusters well. However, due to the difficulty of large-scale data set storage and its high computational complexity, how to conduct effective data mining has become a challenge. To address this issue, we propose an improved density peaks clustering algorithm with fast finding cluster centers, which improves the efficiency of DPC algorithm by screening points with higher local density based on two novel prescreening strategies. The first strategy is based on the grid-division (GDPC), which screens points according to the density of corresponding grid cells. The second strategy is based on the circle-division (CDPC), which screens the points according to the uneven distribution of data sets in the corresponding circles. Theoretical analysis and experimental results show that both the prescreening strategies can reduce the calculation complexity, and the proposed algorithm not only more satisfied than DPC algorithm, but also superior than well-known Nyström-SC algorithm on the large-scale data sets. Moreover, due to the different theories of the two prescreening strategies, the first strategy is faster and the second strategy is more accurate on the large-scale data sets.","authors":["Xinzheng Xu","Shifei Ding","Zhongzhi Shi"],"meta":["May 2018Knowledge-Based Systems 158","DOI:10.1016/j.knosys.2018.05.034"],"references":["276370686_A_new_method_to_estimate_ages_of_facial_image_for_large_database","257435867_Research_of_semi-supervised_spectral_clustering_algorithm_based_on_pairwise_constraints","318591492_An_entropy-based_density_peaks_clustering_algorithm_for_mixed_type_data_employing_fuzzy_neighborhood","317617974_Fast_density_clustering_strategies_based_on_the_k-means_algorithm","307606071_DenPEHC_Density_Peak_based_Efficient_Hierarchical_Clustering","303859622_Clustering_by_fast_search_and_find_of_density_peaks_via_HD","298807366_Robust_clustering_by_detecting_density_peaks_and_assigning_points_based_on_fuzzy_weighted_K-nearest_neighbors","293804713_Study_on_Density_Peaks_Clustering_Based_on_k-Nearest_Neighbors_and_Principal_Component_Analysis","291690751_Improvement_of_Distributed_Clustering_Algorithm_Based_on_Min-cluster","284085664_Clustering_classification_discriminant_analysis_and_dimension_reduction_via_generalized_hyperbolic_mixtures"]}