{"id":"325359097_Retrospective_correction_of_motion_artifact_affected_structural_MRI_images_using_deep_learning_of_simulated_motion","abstract":"Head motion during MRI acquisition presents significant problems for subsequent neuroimaging analyses. In this work, we propose to use convolutional neural networks (CNNs) to correct motion-corrupted images as well as investigate a possible improvement by augmenting L1 loss with adversarial loss. For training, in order to gain access to a ground-truth, we first selected a large number of motion-free images from the ABIDE dataset. We then added simulated motion artifacts on these images to produce motion corrupted data and a 3D regression CNN was trained to predict the motion-free volume as the output. We tested the CNN on unseen simulated data as well as real motion affected data. Quantitative evaluation was carried out using metrics such as Structural Similarity (SSIM) index, Correlation Coefficient (CC), and Tissue Contrast T-score (TCT). It was found that Gaussian smoothing as a conventional method did not significantly differ in SSIM, CC and RMSE from the uncorrected data. On the other hand, the two CNN models successfully removed the motion-related artifact as their SSIM and CC significantly increased after their correction and the error was reduced. The CNN displayed significantly larger TCT compared to the uncorrected images whereas the adversarial network, while improved did not show a significantly increased TCT, which may be explained also by its over-enhancement of edges. Our results suggest that the proposed CNN framework enables the network to generalize well to both unseen simulated motion artifacts as well as real motion artifact-affected data. The proposed method could easily be adapted to estimate a motion severity score, which could be used as a score of quality control or as a nuisance covariate in subsequent statistical analyses.","authors":["Hosung Kim","Wenlu Zhang","Meng Law","Lu Zhao"],"meta":["May 2018","Project: Deep learning in brain MRI"],"references":["319643168_NiftyNet_a_deep-learning_platform_for_medical_imaging","318013361_On_the_Compactness_Efficiency_and_Representation_of_3D_Convolutional_Networks_Brain_Parcellation_as_a_Pretext_Task","317703658_Three-dimensional_motion_corrected_sensitivity_encoding_reconstruction_for_multi-shot_multi-slice_MRI_Application_to_neonatal_brain_imaging","316974453_Retrospective_Head_Motion_Estimation_in_Structural_Brain_MRI_with_3D_CNNs","312623387_Image_De-Raining_Using_a_Conditional_Generative_Adversarial_Network","311732441_Automated_Quality_Assessment_of_Structural_Magnetic_Resonance_Brain_Images_Based_on_a_Supervised_Machine_Learning_Algorithm","302305068_Multi-Scale_Context_Aggregation_by_Dilated_Convolutions","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","303097146_NEOCIVET_Towards_accurate_morphometry_of_neonatal_gyrification_and_clinical_applications_in_preterm_newborns","301836893_Perceptual_Losses_for_Real-Time_Style_Transfer_and_Super-Resolution","300112392_Retrospective_Motion_Correction_of_Magnitude-Input_MR_Images","292192486_The_autism_brain_imaging_data_exchange_towards_a_large-scale_evaluation_of_the_intrinsic_brain_architecture_in_autism","286512696_Deep_Residual_Learning_for_Image_Recognition","271597522_Motion_Artefacts_in_MRI_a_Complex_Problem_with_Many_Partial_Solutions","269935079_Adam_A_Method_for_Stochastic_Optimization"]}