{"id":"325307075_Modelling_crops_and_cropping_systems-Evolving_purpose_practice_and_prospects","abstract":"Crops and cropping systems are characterised by complexity and variability. Complexity arises from inherently complex plant and soil processes combined in an almost infinite set of permutations and combinations associated with biotic and abiotic drivers that are inherently variable in both space and time. Modelling has evolved over the last 100 years as a means of describing and interpreting complex and variable performance and increasingly as a means of predicting likely performance in prescribed circumstances for better decision making. In this paper we reflect on the evolution of quantitative approaches to describing and predicting crop growth and cropping system performance. We begin with early mathematical descriptions of plant and crop growth and soil processes dating from the 1920′s to 1950′s. We explore the early crop models of the 60′s and 70′s and the more comprehensive crop-soil models of the 1970′s and 80′s. Cropping systems models with comprehensive systems management capabilities underpinned by a modular design began to gain currency in the 1990s. Over this long period, the ambitions held by model-makers’ for model applications grew. We analysed the publication records of major cropping systems models to summarise the broad trends in model applications that emerged in the early 21st Century, based on the 60 years of development in the 20th Century. There was an “explosion” in publications on cropping systems models, with an eight fold increase from 2000 to 2015. In parallel, the application of models greatly expanded from approximately four areas in 2000 (agronomy, model development, climate change and methods) to more than 20 in 2015. However, despite this explosion and expansion there is little evidence in the literature that modelling was having an impact on farmers and policy makers. We conclude with an examination of the forces shaping cropping systems model development and application. Developments in data acquisition and model-data fusion may open the way for cropping systems models to have greater impact in real-world policy or practice settings, making a meaningful contribution to future agricultural productivity and sustainability.","authors":["B. A. Keating","Peter J. Thorburn"],"meta":["May 2018European Journal of Agronomy 100","DOI:10.1016/j.eja.2018.04.007"],"references":["290481403_A_Comprehensive_Review_of_the_CERES-Wheat_-Maize_and_-Rice_Models'_Performances","240782563_Influence_of_Soil_Water_Status_and_Meteorological_Conditions_on_Evaporation_from_a_Corn_Canopy1","223612645_An_overview_of_the_crop_model_STICS","223374076_The_FARMSCAPE_approach_to_decision_support_Farmers'_advisers'_researchers'_monitoring_simulation_communication_and_performance_evaluation","320123560_Considering_agriculture_in_IPCC_assessments","288889422_Environmental_and_economic_benefits_of_variable_rate_nitrogen_fertilization_in_a_nitrate_vulnerable_zone","257505055_A_strategic_and_tactical_management_approach_to_select_optimal_N_fertilizer_rates_for_wheat_in_a_spatially_variable_field","250102431_Evaluation_of_the_EPIC_Simulation_Model_Using_a_Dryland_Wheat-Sorghum-Fallow_Crop_Rotation1","250096499_A_Drought_Criterion_and_Its_Application_in_Evaluating_Drought_Incidence_and_Hazard1","249769694_The_Epistemology_of_Action_Research","240615246_Uncertainty_in_simulating_wheat_yields_under_climate_change","232834386_Agricultural_decision_support_systems_facilitating_co-learning_A_case_study_on_environmental_impacts_of_sugarcane_production","221946670_Simulation_Models_Science_Snake_Oil_Education_or_Engineering"]}