{"id":"325320777_What_are_the_causes_of_a_suboptimal_FFR_after_coronary_stent_deployment_Insights_from_a_consecutive_series_using_OCT_imaging","abstract":"Aims: \nFractional flow reserve (FFR) can be used to detect a suboptimal result after percutaneous coronary intervention (PCI). A lower post procedure FFR (< 0.90) has been shown to be associated with adverse clinical outcomes at follow-up. This pilot study aimed to understand the mechanisms resulting in a suboptimal FFR and whether Optical Coherence Tomography (OCT) guided optimisation could improve final FFR.\n\nMethods and results: \nThirty five patients undergoing complex PCI were prospectively enrolled. After stenting and post dilatation, OCT and pressure wire were performed. An FFR threshold <0.90 after PCI was defined as suboptimal and mandated further PCI optimisation. A satisfactory post-PCI FFR (predefined as ≥0.90) was achieved immediately after conventional PCI in 14 patients (40%) and in this group no further treatment was performed. Minor abnormalities (stent malapposition of 200-500 µm) were observed with OCT in three of these patients. Suboptimal functional results after conventional stenting (predefined as FFR <0.90) were found in 21 patients (60%). In thirteen out of this 21 patients (61.9%) OCT demonstrated a suboptimal stent result. Subsequent OCT-guided optimization was performed resulting in a higher final FFR (increase from 0.80±0.02 to 0.88±0.01; P = 0.008).\n\nConclusions: \nDespite a satisfactory angiographic result, a suboptimal functional result is evident in a substantial proportion of patients undergoing complex PCI. Implementation of an OCT-guided PCI optimisation protocol may reveal potentially treatable causes allowing optimisation of the post PCI functional result.","authors":["Mathias Wolfrum","Giovanni Luigi De Maria","Stefano Benenati","Jeremy Langrish"],"meta":["May 2018EuroIntervention: journal of EuroPCR in collaboration with the Working Group on Interventional Cardiology of the European Society of Cardiology 14(12)","DOI:10.4244/EIJ-D-18-00071"],"references":[]}