{"id":"325485408_New_Trends_in_Higher_Education_in_the_Globalizing_World_STEM_in_Teacher_Education","abstract":"One of the main objectives of education, which raises individuals that the society needs, is to resource labor force that will provide the development of the society by maintaining the economic, social, scientific and technological advances. Many countries that aspire to have an advanced economy and technology aim to build a society that is advanced at Science, Technology, Engineering and Mathematics (STEM) and have sustainable development in these fields, and this has been one of the main educational strategies of those countries. STEM education has a strategic importance for our country to maintain the competitive power on international scale. This research aims to conduct a needs analysis towards the curricular design of STEM education to be proposed for the undergraduate programs of science education at education faculties. The study holds a descriptive model and qualitative methods were used. The study group consists of 12 faculty from Science, Mathematics, Computer and Instructional Technologies at Faculty of Education, and from the Department of Mechanical Engineering, Faculty of Engineering at Gazi University; 15 science teachers who work at the schools which have different socioeconomic levels in Ankara, and 42 sophomore students who study at the Department of Science Education at Gazi University Faculty of Education. Content analysis was used as the data analysis method. Findings of the study reveal that there are no studies conducted to integrate different fields into teacher education programs, there are no courses related to STEM education integrated into the curriculum, and the knowledge and skills pre-service teachers should gain to implement this approach in their professional teaching career do not exist in the curriculum. In addition, it was found that most of the teachers believe teacher collaboration; they associate their courses mostly with mathematics and information technologies. Likewise, it was identified that the main reason behind why the teachers cannot teach through interdisciplinary approach is due to teacher related reasons. Concerning the pre-service education, The Ministry of National Education and education faculties should work collaboratively, determine the teacher competencies and try to develop undergraduate curriculum for pre-service teachers to gain these competencies. Training teachers during pre-service period rather than in-service training will play a crucial role to gain the expected results from the approach.","authors":["Nilay Türk","Nurdan Kalayci","Havva Yamak"],"meta":["June 2018Universal Journal of Educational Research 6(6)","DOI:10.13189/ujer.2018.060620"],"references":["335928324_Bilimsel_Arastirma_Yontemleri","317640555_Assessing_teacher_education_and_professional_development_needs_for_the_implementation_of_integrated_approaches_to_STEM_education","316647977_Fen_Bilgisi_ve_Ilkogretim_Matematik_Ogretmenlerinin_Disiplinlerarasi_Yaklasima_Yonelik_Goruslerinin_Belirlenmesi","310666622_The_eight_essential_elements_of_inclusive_STEM_high_schools","299533858_STEM_Images_Revealing_STEM_Conceptions_of_Pre-Service_Chemistry_and_Mathematics_Teachers","316363549_fficacy_of_applying_integrated_teaching_program_using_cooperative_and_project_based_learning_approaches_Butunlestirilmis_ogretim_programinin_isbirligine_dayali_ve_proje_tabanli_ogrenme_yaklasimiyla_uy","311508750_Sosyal_bilimlerde_nitel_arastirma_yontemleri","310740835_FeTeMM_Egitimi_Makale_Cagri_Mektubu","307723642_Egitimde_Disiplinlerarasi_Yaklasimin_Kullanildigi_Tezlerin_Analizi","306151749_Fen_Egitiminde_Ilkogretim_6_Sidotlessnidotlessflarda_Cicekli_Bitkiler_Konusunun_Ogretiminde_Bilgisayar_Destekli_Ogretimin_Ogrenci_Basaridotlesssidotlessna_Etkisi"]}