{"id":"325406712_Do_outreach_activities_in_secondary_STEM_education_motivate_students_and_improve_their_attitudes_towards_STEM","abstract":"The present study investigated outreach activities, developed by STEM-based companies or universities in co-creation with secondary education with the aim to inform students about and motivate them for a career in STEM by connecting the work-context with school-science. Although many of such activities are being offered, little is known about their effects. We investigated students’ perceptions with the outreach learning environment, perceived need-fulfilment, self-reported motivation and attitudes towards STEM. Data were gathered from 729 high-school students engaged in 12 activities in the USA and the Netherlands. The students completed a questionnaire, which contained questions about four elements of our theoretical frame based on the Self-Determination-Theory (SDT). Perceived needs-fulfilment and motivation were measured using the basic-psychological-needs-scale and the self-regulation-questionnaire. Attitudes were measured using the test-of-science-related-attitudes. Learning environment perceptions were measured in a previous study using subscales of what-is-happing-in-this-classroom (WIHIC), constructivist-learning-environments-scale (CLES) and classroom-environment-scale (CES) and typified by activity characteristics. Multilevel analyses of variance were conducted for the two motivation scales (controlled and autonomous-motivation) and the two attitude scales (social-implication and career-interest). Activity characteristics explained almost all variance in these variables between activities. Specific characteristics of outreach activities that statistically significantly related to autonomous motivation and positive general attitudes towards STEM were: workshop-format, understanding science, an out-of-school component. The attitude towards a possible STEM-career was positively associated with autonomous-motivation and negatively associated with controlled-motivation. Thus, outreach learning environments indeed created opportunities to increase students’ motivation in STEM and attitude towards STEM, but the impact varied according to particular characteristics of the activities.","authors":["Johanna Vennix","Brok den Pj","Ruurd Taconis"],"meta":["May 2018International Journal of Science Education 40(1):1-21","DOI:10.1080/09500693.2018.1473659"],"references":["309453030_Perceptions_of_STEM-based_outreach_learning_activities_in_secondary_education","291557042_A_New_Autonomy-Supportive_Way_of_Teaching_That_Increases_Conceptual_Learning_Teaching_in_Students'_Preferred_Ways","323424582_Statistical_power_analysis_for_the_behavioral_sciences","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","310494491_Place-Based_Learning_Environments","303119370_Intrinsic_and_extrinsic_motivation_A_hierarchical_model","299651748_Outside_school_time_an_examination_of_science_achievement_and_non-cognitive_characteristics_of_15-year_olds_in_several_countries","292759697_Increasing_student_interest_and_attitudes_in_STEM_Professional_development_and_activities_to_engage_and_inspire_learners","285211052_Encouraging_Student_Interest_in_Science_and_Technology_Studies","281079790_Authentic_Learning_Environments"]}