{"id":"325404249_Energy_conscious_multi-site_computation_offloading_for_mobile_cloud_computing","abstract":"In mobile devices, one of the major reasons for battery consumption is due to computation of complex applications. To provide high performance of execution on the mobile devices, the concept of mobile cloud computing (MCC) is used. MCC allows the computation complex modules to offload onto a cloud from a mobile device, which helps to remove the resource constraint condition of the mobile devices. Computations can also be offloaded to nearby clouds called multi-sites, which may have different resources, access delays, computation capability or service charges. The mobile users can specify their priority such as total completion time, cost or energy saving of the application execution in MCC environment. But most of the existing research is focused to optimize only one objective, i.e., either total completion time or cost or energy. But when offloading computation modules onto cloud-based multi-sites, a tradeoff solution is required to strike a balance between the total completion time and energy savings. Further, the entire computational execution on the cloud is to be served efficiently with optimal power utilization. Various algorithms are developed to reduce power consumption, and one such algorithm is dynamic voltage and frequency scaling (DVFS) algorithm. In this paper, new algorithms known as cost and time constraint task partitioning and offloading algorithm (CTTPO), multi-site task scheduling algorithm (MTS) based on teaching, learning-based optimization and the energy saving on multi-sites (ESM) using DVS technique are proposed. CTTPO deals with trade-off between time and cost for the task partitioning and offloading. The MTS algorithm deals with time efficient scheduling on multi-sites, and ESM algorithm saves the energy on the multi-sites by switching the sites from high voltage to low voltage during ideal time. The simulation study demonstrates that the proposed algorithms outperformed the existing techniques based on time, cost and energy parameters.","authors":["Raj Kumari","Sakshi Kaushal","Naveen Chilamkurti"],"meta":["October 2018Soft Computing 22(8)","DOI:10.1007/s00500-018-3264-0"],"references":["318800942_Process_state_synchronization_for_mobility_support_in_mobile_cloud_computing","311961962_A_Fast_Hybrid_Multi-site_Computation_Offloading_for_Mobile_Cloud_Computing","307087870_Energy-Efficient_Offloading_for_Mobile_Edge_Computing_in_5G_Heterogeneous_Networks","288038782_Cloudlet_Deployment_in_Local_Wireless_Networks_Motivation_Architectures_Applications_and_Open_Challenges","305655449_Mobile_ad_hoc_cloud_A_survey","301710486_A_genetic_algorithm_for_virtual_machine_migration_in_heterogeneous_mobile_cloud_computing","297816577_Cloud_computing_for_mobile_users_Can_offloading_computation_save_energy","297676918_On_Energy-Efficient_Offloading_in_Mobile_Cloud_for_RealTime_Video_Applications","286570509_Optimal_Scheduling_Simulation_of_Software_for_Multi-tenant_in_Cloud_Computing_Environment","284018469_Energy-efficient_multisite_offloading_policy_using_Markov_decision_process_for_mobile_cloud_computing","283335287_An_Optimal_Offloading_Partitioning_Algorithm_in_Mobile_Cloud_Computing","282267183_Modeling_Multi-Factor_Multi-Site_Risk-Based_Offloading_for_Mobile_Cloud_Computing","273180314_Computation_Offloading_for_Service_Workflow_in_Mobile_Cloud_Computing","271546419_Resource_allocation_in_cloud_using_simulated_annealing","266853755_Dynamic_Transmission_Scheduling_and_Link_Selection_in_Mobile_Cloud_Computing"]}