{"id":"325437832_Collecting_sexual_assault_history_and_forensic_evidence_from_adult_women_in_the_emergency_department_A_retrospective_study","abstract":"Background: \nThe objective of this retrospective study was to examine the discrepancy between information derived from written medical reports and the results of forensic DNA analyses on swabs collected from the victims in 122 cases of alleged sexual assault treated at the Emergency Department of Padua Hospital. The examination of discrepant results has proved useful to support a broader application of sexual assault management, particularly during the taking of case history.\n\nMethods: \nThe Laboratory of Forensic Genetics of Padua University have processed samples from 122 sexual assault cases over a period of 5 years.\n\nResults: \nOf the 103 cases in which the victim reported a penetration and ejaculation, only 67 (55% of all the samples) correlated with positive feedback match from the laboratory. In 36 cases in which the patient reported penetration with ejaculation, no male DNA was found in the samples collected. Therefore, there was a total of 41 cases in which the patient's report were not supported by laboratory data. In the remaining ten cases, which had an ambiguous history, 3 tested positively for the presence of male DNA.\n\nConclusions: \nTo avoid discrepancies between the medical reporting and reconstruction of sex crimes, it is crucial to deploy strategies which focus not only on the technical aspects of evidence collection, but also on how the victim's story is recorded; such efforts could lead to better management of sexual assault victims, and to a strengthened legal impact of forensic evidence and of crime reconstruction.","authors":["Pamela Tozzo","Elena Ponzano","Gloria Spigarolo","Nespeca Patrizia"],"meta":["May 2018BMC Health Services Research 18(1)","DOI:10.1186/s12913-018-3205-8"],"references":["313817035_Complaints_against_health-care_professionals_providing_police_custodial_and_forensic_medicalhealth-care_services_and_sexual_offence_examiner_services_in_England_Wales_and_Northern_Ireland","271880350_Emergency_Centre_care_for_sexual_assault_victims","269756925_Victims_of_Violence_in_Accident_Emergency_Reporting_Survey_of_Eleven_Emergency_Structures_Out_of_Eighteen","257535963_Sexual_Assault_Training_in_Emergency_Medicine_Residencies_A_Survey_of_Program_Directors","250921841_Use_of_emergency_department_services_by_women_victims_of_violence_in_Lazio_region_Italy","303597265_Factors_That_Influence_Women_to_Disclose_Sexual_Assault_History_to_Health_Care_Providers","265344573_Discrepancy_between_information_reported_by_the_victims_of_sexual_assaults_and_clinical_forensic_findings","257692706_Sexual_assault_and_rape","255976719_Determinants_of_assault-related_violence_in_the_community_Potential_for_public_health_interventions_in_hospitals","236101661_The_Effects_of_Differential_Extraction_Conditions_on_the_Premature_Lysis_of_Spermatozoa"]}