{"id":"325454232_Rescaling_and_refocusing_smart_cities_research_from_mega_cities_to_smart_villages","abstract":"Purpose\n\nThe purpose of this paper is to rethink the focus of the smart cities debate and to open it to policymaking and strategy considerations. To this end, the origins of what is termed normative bias in smart cities research are identified and a case made for a holistic, scalable and human-centred smart cities research agenda. Applicable across the micro, mezzo and macro levels of the context in which smart cities develop, this research agenda remains sensitive to the limitations and enablers inherent in these contexts. Policymaking and strategy consideration are incorporated in the agenda this paper advances, thus creating the prospect of bridging the normative and the empirical in smart cities research.\n\nDesign/methodology/approach\n\nThis paper queries the smart cities debate and, by reference to megacities research, argues that the smart city remains an overly normatively laden concept frequently discussed in separation from the broader socio-political and economic contexts in which it is embedded. By focusing on what is termed the normative bias of smart cities research, this paper introduces the nested clusters model. By advocating the inclusion of policymaking and strategy considerations in the smart cities debate, a case is made for a holistic, scalable and human-centred smart cities agenda focused, on the one hand, on individuals and citizens inhabiting smart cities and, on the other hand, on interdependencies that unfold between a given smart city and the context in which it is embedded.\n\nFindings\n\nThis paper delineates the research focus and scope of the megacities and smart cities debates respectively. It locates the origins of normative bias inherent in smart cities research and, by making a case for holistic, scalable and human-centred smart cities research, suggests ways of bypassing that bias. It is argued that smart cities research has the potential of contributing to research on megacities (smart megacities and clusters), cities (smart cities) and villages (smart villages). The notions of policymaking and strategy, and ultimately of governance, are brought into the spotlight. Against this backdrop, it is argued that smart cities research needs to be based on real tangible experiences of individuals inhabiting rural and urban space and that it also needs to mirror and feed into policy-design and policymaking processes.\n\nResearch limitations/implications\n\nThe paper stresses the need to explore the question of how the specific contexts in which cities/urban areas are located influence those cities/urban areas’ growth and development strategies. It also postulates new avenues of inter and multidisciplinary research geared toward building bridges between the normative and the empirical in the smart cities debate. More research is needed to advance these imperatives at the micro, mezzo and macro levels.\n\nPractical implications\n\nBy highlighting the connection, relatively under-represented in the literature, between the normative and the empirical in smart cities research, this paper encourages a more structured debate between academia and policymakers focused on the sustainable development of cities/urban areas. In doing so, it also advocates policies and strategies conducive to strengthening individuals’/citizens’ ability to benefit from and contribute to smart cities development, thereby making them sustainable.\n\nSocial implications\n\nThis paper makes a case for pragmatic and demand-driven smart cities research, i.e. based on the frequently very basic needs of individuals and citizens inhabiting not only urban but also rural areas. It highlights the role of basic infrastructure as the key enabler/inhibitor of information and communication technology-enhanced services. The nested clusters model introduced in this paper suggests that an intimate connection exists between individuals’ well-being, their active civic engagement and smart cities sustainability.\n\nOriginality/value\n\nThis paper delineates the relationship between megacities and smart cities research. It identifies the sources of what is termed normative bias in smart cities research. To address the implications of that bias, a nested clusters model for smart cities is introduced, i.e. a conceptual framework that allows us to redraw the debate on smart cities and establish a functional connection between the array of normatively laden ideas of what a smart city could be and what is feasible, and under which conditions at the policymaking level.","authors":["Anna Visvizi","Miltiadis Lytras"],"meta":["May 2018","DOI:10.1108/JSTPM-02-2018-0020"],"references":["322668223_Sustainable_Queuing-Network_Design_for_Airport_Security_Based_on_the_Monte_Carlo_Method","321630648_Different_Mortality_Effects_of_Extreme_Temperature_Stress_in_Three_Large_City_Clusters_of_Northern_and_Southern_China","321171185_Big_Sensed_Data_Meets_Deep_Learning_for_Smarter_Health_Care_in_Smart_Cities","319216489_Double_exposure_infrastructure_planning_and_urban_climate_resilience_in_coastal_megacities_A_case_study_of_Manila","317986481_Urban_innovation_through_policy_integration_Critical_perspectives_from_100_smart_cities_mission_in_India","317048810_Irregular_migratory_flows_Towards_an_ICTs'_enabled_integrated_framework_for_resilient_urban_systems","316819671_Cluster_Activities_in_Different_Institutional_Environments_Case_Studies_of_ICT-Clusters_from_Austria_Germany_Ukraine_and_Serbia","316697190_Spillovers_from_immigrant_diversity_in_cities","315698657_Global_city_clusters_theorizing_spatial_and_non-spatial_proximity_in_inter-urban_firm_networks","314132267_Editorial_-_Volume_18_Issue_1","311670580_Big_Data_and_Data_Analytics_Research_From_Metaphors_to_Value_Space_for_Collective_Wisdom_in_Human_Decision_Making_and_Smart_Machines","308961054_The_next_wave_of_innovation-Review_of_smart_cities_intelligent_operation_systems","305628701_Smart_cities_Concepts_architectures_research_opportunities","284232349_Industrial_Clusters_and_CSR_in_Developing_Countries_The_Role_of_International_Donor_Funding","277026227_Smart_cities_A_conjuncture_of_four_forces","274166044_Smart_city_policies_A_spatial_approach","271999461_Neither_ordinary_nor_global_a_reflection_on_the_'extra-ordinary'_expansion_of_Athens","265099803_The_OECD_Metropolitan_Governance_Survey_A_Quantitative_Description_of_Governance_Structures_in_Large_Urban_Agglomerations","259453677_The_Contribution_of_Economic_Sectors_to_Economic_Growth_The_Cases_of_Malaysia_and_China","249679672_The_Metabolism_of_the_Industrial_City_The_Case_of_Pittsburgh","336810185_How_do_we_understand_smart_cities_An_evolutionary_perspective","322864739_Big_data_dashboards_as_smart_decision_support_tools_for_i_-cities_-_An_experiment_on_stockholm","321987111_Global_logistics_city_concept_a_cluster-led_strategy_under_the_belt_and_road_initiative","320845098_Smart_cities_and_digital_workplace_culture_in_the_global_European_context_Amsterdam_London_and_Paris","319244849_Stickiness_and_slipperiness_in_Istanbul's_old_city_jewellery_cluster_A_survival_story","314259748_Smart_Sustainable_Cities_of_the_Future_An_Extensive_Interdisciplinary_Literature_Review","313653085_Clusters_and_the_New_Economics_of_Competition","313149581_What_are_the_differences_between_sustainable_and_smart_cities","313035538_A_Smart_City_Is_a_Collaborative_Community_Lessons_from_Smart_Aarhus","311558361_World_urbanization_prospects_the_2014_revision_highlights","309290863_Smart_utopia_VS_smart_reality_Learning_by_experience_from_10_smart_city_cases","308547379_Virtual_reality_in_learning_collaboration_and_behaviour_content_systems_strategies_context_designs","303504538_What_drives_the_effectiveness_of_industrial_clusters_Exploring_the_impact_of_contextual_structural_and_functioning_determinants","288073504_Satisfying_transportation_needs_in_fast-growing_metropolitan_areas_mobility_solutions_for_mega-cities_in_developing_countries","283246865_Creativity_clusters_and_the_competitive_advantage_of_cities","51992970_Deconstructing_Clusters_Chaotic_Concept_or_Policy_Panacea","5152799_The_Knowledge-Based_Economy_Conceptual_Framework_or_Buzzword"]}