{"id":"325485871_Mud_and_sand_effects_on_wave_propagation_over_the_French_Guiana_coasts","abstract":"The dampening effect of waves by soft mud layers is observed throughout the spectrum, in laboratory as well as on the Louisiana or Guyana coasts. Since the bi-layer theoretical approach of GADE (1958), several parameterizations have been proposed and implemented in wave numerical models but many efforts of calibrations and additional works are still required to obtain realistic representations of in situ processes. The Guyanese coasts are impacted by the Amazon sediments discharge. In fact, 20 to 30% of these sediments migrate longshore either in turbid or in mud banks forms due to the waves and current combined actions. These mud banks cause rapid coastline variations, leading to accretion, erosion and submersion risks. The French operational wave forecasting system at coastal scale is based on WAVEWATCH III ®, using an unstructured grid that covers the French Guiana with a resolution of 200 m nearshore. A first version of this system has been implemented in 2017 in the framework of the HOMONIM project (History, Observation, Modeling sea levels, joint SHOM and Météo-France project). However this first version doesn't include the effects of the mud and sand banks on waves. In this paper, we investigate the mud and sand effects on the wave propagation in order to improve the future version of the operational French Guiana configuration. Numerical tests on different bottom stress parameterizations are performed on a laboratory case, to assess the behaviour of WW3. A more realistic application on Guiana is carried out by the creation of a seabed map (grain size) and the use of a fine description of the characteristics and location of the mud banks, thanks to high resolution satellite imagery and in-situ data.","authors":["Héloïse Michaud","Olivier Morio","Erwan Gensac","Robert Osinski"],"meta":["May 2018","DOI:10.5150/jngcgc.2018.011","Conference: Journées Nationales Génie Civil Génie CôtierAt: La Rochelle","Project: HOMONIM"],"references":["301659744_Implementation_of_the_next_French_operational_coastal_wave_forecasting_system_and_application_to_a_wave-current_interaction_study","292706132_Bottom_frictional_stresses_and_longshore_currents_due_to_waves_with_large_angles_of_incidence","260552903_On_the_developments_of_spectral_wave_models_numerics_and_parameterizations_for_the_coastal_ocean","318604402_Wave_energy_dissipation_due_to_mudbanks_formed_off_southwest_coast_of_India","313055322_Measurements_of_wind-wave_growth_and_swell_decay_during_the_joint_north_sea_wave_project","279340747_Lecture_Notes_on_Coastal_and_Estuarine_Studies","256197847_User_Manual_and_System_Documentation_of_wavewatch-III","223234237_Modeling_of_wave_damping_at_Guyana_mud_coast"]}