{"id":"325446604_The_influence_of_prior_knowledge_on_experiment_design_guidance_in_a_science_inquiry_context","abstract":"Designing and conducting sound and informative experiments is an important aspect of inquiry learning. Students, however, often design experiments that do not allow them to reach conclusions. Considering the difficulties students experience with the process of designing experiments, additional guidance in the form of an Experiment Design Tool (EDT) was developed, together with reflection questions. In this study, 147 pre-university students worked in an online inquiry learning environment on buoyancy and Archimedes’ principle. Students were randomly assigned to one of three conditions, each of which contained a different version of the EDT. Since students’ prior knowledge has been found to influence the amount and type of guidance they need, the versions of the tool differed with respect to the level of guidance provided. A pre- and post-test were administered to assess students’ conceptual knowledge. No overall differences between conditions were found. In a subsequent analysis, students were classified as either low, low-intermediate-, high-intermediate, or high prior knowledge students. For Archimedes’ principle we found that low-intermediate prior knowledge students gained significantly more conceptual knowledge than low prior knowledge students in the fully guided condition. It is hypothesised that students need at least some prior knowledge in order to fully benefit from the guidance offered.","authors":["Siswa A. N. van Riesen","Hannie Gijlers","Anjo Anjewierden","Ton de Jong"],"meta":["May 2018International Journal of Science Education 40(11):1-18","DOI:10.1080/09500693.2018.1477263"],"references":["334021603_The_influence_of_prior_knowledge_on_the_effectiveness_of_guided_experiment_design","322321024_Supporting_learners'_experiment_design","306020931_Learning_strategies_a_synthesis_and_conceptual_model","318575524_Cloud_ecosystem_for_supporting_inquiry_learning_with_online_labs_Creation_personalization_and_exploitation","303157781_Expertise_reversal_effect_and_its_instructional_implications","293193229_Meta-Analysis_of_Inquiry-Based_Learning_Effects_of_Guidance","291741577_Systematic_review_and_meta-analysis_of_STEM_simulations","282189573_Not_a_magic_bullet_The_effect_of_scaffolding_on_knowledge_and_attitudes_in_online_simulations","281720588_Designing_Instruction_to_Improve_Lifelong_Inquiry_Learning","280818320_The_guided_discovery_principle_in_multimedia_learning"]}