{"id":"325489301_3D_Scanning_Applications_in_Medical_field_A_Literature-based_Review","abstract":"Background: Medical field has extensive use of different scanning like X-rays, CT, MRI and Ultrasound. These techniques are quite useful for providing information on the internal organs. However, there is a gap for obtaining information of the outer body parts which can now be taken care by 3D Scanning technologies. A large number of research papers about different scanning techniques and 3D scanning has been studied to identify the impact of them and the subsequent research. The aim of the work: Doctors and technologists use the available scanning technologies in different sub-medical fields. This paper endeavours to find out the best possible usage of 3D scanning technologies in the medical area. This paper will help doctors for best treatment to the patient with high knowledge, minimum risks and maximising benefits. Materials and methods: A large number of the relevant research papers from 2008 to April 2018, identified through Scopus are studied using bibliometric analysis, thus to determine strength & limitation and to undertake application analysis. Results: Year-wise, Journal-wise and relevant applications wise study undertaken in the medical field through Bibliometric research to identify the strength, limitations, and applications of 3D scanning, and other contemporaries scanning technologies. Conclusion: The bibliometric analysis shows that there is an increasing trend in the research work undertaken in 3D scanning application in the medical field, this also explains future potential and contribution. Corporate are exploring 3D scanning for commercial medical applications along with part analysis & designs before the actual production. It helps to create efficient implants easily and quickly. In this paper, we have summarised 3D scanning applications for medical purposes. This technology helps to produce medical implant according to the required specification. It is used for the accurate measuring of patient's body shape, size and skin surface area or an individual part of the body. In medical, data varies from patient to patient, so for producing a 3D digital image, 3D scanning technologies are used which provide digital 3D models. We can obtain improved patient treatment through the integration of digital models with Virtual Reality and Holographic techniques. The significant limitation of this technology is that it can only scan the outer surface of the body or part/model.","authors":["Abid Haleem","Mohd Javaid"],"meta":["May 2018Clinical Epidemiology and Global Health 7(2)","DOI:10.1016/j.cegh.2018.05.006","Project: Role of 3D Printing and 3D Scanner for Product Design and Development"],"references":["331631209_Performance_Evaluation_of_Macor_Dental_Ceramic_An_Investigation_with_Rotary_Ultrasonic_Machining","325278735_Current_status_and_challenges_of_Additive_manufacturing_in_orthopaedics_An_overview","324681846_Additive_manufacturing_applications_in_orthopaedics_A_review","320348139_Additive_manufacturing_applications_in_medical_cases_A_literature_based_review","320262374_A_semi-automatic_computer-aided_method_for_personalized_Vacuum_Bell_design","314970701_Rapid_Manufacturing_Classification_and_Recent_Development","322981704_Aesthetic_reconstruction_of_microtia_a_review_of_current_techniques_and_new_3D_printing_approaches","322660825_3D_scanning_and_geometry_processing_techniques_for_customised_hand_orthotics_an_experimental_assessment","318762512_Supporting_of_Postural_Deformities_Diagnosis_Using_3D_Scanning","315386186_3D_Printed_Bio-models_for_Medical_Applications"]}