{"id":"325427097_Students_Acceptance_of_Google_Classroom_An_Exploratory_Study_using_PLS-SEM_Approach","abstract":"Google classroom can work in unidirectional process as it can serve the teachers’ strategies and styles on one hand and students’ perception, understanding, and effective participation in different classroom skills on the other hand. The acceptance of Google classroom is affected by different factors. Some of them are still not clearly specified and discussed in previous research; therefore, they need further investigation. Based on the previous assumption, this study is an attempt to examine the factors that affect the students’ acceptance\nof Google classroom at Al Buraimi University College (BUC) in Oman. The Technology Acceptance Model (TAM) was adopted to formulate the hypotheses of the current study. The data was collected through an online questionnaire with 337 respondents. The Partial Least Square-Structural Equation Model (PLS-SEM) approach was used to assess both the measurement and structural models. The results of the study prove that both the perceived ease of use (PEOU) and perceived usefulness (PU) positively influence the behavioral\nintention, which in turn influence the actual usage of Google classrooms. This study helps the decision makers of the higher educational institutions to have a better understanding of the effectiveness of using Google classroom by their students. It is assumed that it helps in measuring the level of students’ acceptance\nto the previously mentioned technology.","authors":["Rana Saeed","Mostafa Al-Emran"],"meta":["June 2018International Journal of Emerging Technologies in Learning (iJET) 13(06):112-123","DOI:10.3991/ijet.v13i06.8275"],"references":["318667420_Students'_Attitudes_Towards_the_Use_of_Mobile_Technologies_in_e-Evaluation","313717807_The_application_of_Google_Classroom_as_a_tool_for_teaching_and_learning","312023090_Academics'_Awareness_Towards_Mobile_Learning_in_Oman","309426869_The_Impact_of_Google_Apps_at_Work_Higher_Educational_Perspective","272677397_E-podium_Technology_A_medium_of_managing_Knowledge_at_Al_Buraimi_University_College_via_M-learning","271677620_Students'_Perceptions_of_E-learning_at_the_University_of_Jordan","316448016_The_use_of_UTAUT2_model_for_understanding_student_perceptions_using_Google_Classroom_A_case_study_of_Introduction_to_Information_Technology_course","316447759_Deployment_of_Google_Classroom_to_enhance_SDL_cognitive_skills_A_case_study_of_introduction_to_information_technology_course","306124408_Learning_Engagement_in_Virtual_Environment","285549555_Investigating_attitudes_towards_the_use_of_mobile_learning_in_higher_education"]}