{"id":"325408300_Hybrid_compression_of_inverted_lists_for_reordered_document_collections","abstract":"Text search engines are a fundamental tool nowadays. Their efficiency relies on a popular and simple data structure: inverted indexes. They store an inverted list per term of the vocabulary. The inverted list of a given term stores, among other things, the document identifiers (docIDs) of the documents that contain the term. Currently, inverted indexes can be stored efficiently using integer compression schemes. Previous research also studied how an optimized document ordering can be used to assign docIDs to the document database. This yields important improvements in index compression and query processing time. In this paper we show that using a hybrid compression approach on the inverted lists is more effective in this scenario, with two main contributions: • First, we introduce a document reordering approach that aims at generating runs of consecutive docIDs in a properly-selected subset of inverted lists of the index.• Second, we introduce hybrid compression approaches that combine gap and run-length encodings within inverted lists, in order to take advantage not only from small gaps, but also from long runs of consecutive docIDs generated by our document reordering approach. Our experimental results indicate a reduction of about 10%–30% in the space usage of the whole index (just regarding docIDs), compared with the most efficient state-of-the-art results. Also, decompression speed is up to 1.22 times faster if the runs of consecutive docIDs must be explicitly decompressed, and up to 4.58 times faster if implicit decompression of these runs is allowed (e.g., representing the runs as intervals in the output). Finally, we also improve the query processing time of AND queries (by up to 12%), WAND queries (by up to 23%), and full (non-ranked) OR queries (by up to 86%), outperforming the best existing approaches.","authors":["Diego Arroyuelo","Mauricio Oyarzún","Senen Gonzalez","Victor Sepulveda"],"meta":["May 2018Information Processing and Management 54(6)","DOI:10.1016/j.ipm.2018.05.007","Project: Information Retrieval"],"references":["301124441_Universal_Indexes_for_Highly_Repetitive_Document_Collections","225165845_Entry_Pairing_in_Inverted_File","321617600_Data_Compression_The_Complete_Reference","308161218_Introduction_to_information_retrieval_chapt","266654119_Scalability_and_efficiency_challenges_in_commercial_Web_search_engines","265812801_Information_retrieval_Implementing_and_evaluating_search_engines","237912898_Authoritative_sources_in_a_hyperlinked_environment","225246528_Binary_Interpolative_Coding_for_Effective_Index_Compression","223749302_Inverted_file_compression_through_document_identifier_reassignment","222415653_Sorting_improves_word-aligned_bitmap_indexes"]}