{"id":"325446924_The_effect_of_automatic_assessment_on_novice_programming_Strengths_and_limitations_of_existing_systems","abstract":"Computer programming is always of high concern for students in introductory programming courses. High rates of failure occur every semester due to lack of adequate skills in programming. No student can become a programmer overnight because such learning requires proper guidance as well as consistent practice with the programming exercises. The role of instructors in the development of students' learning skills is crucial in order to provide feedback on their errors and improve their knowledge accordingly. On the other hand, due to the large number of students, instructors are also overloading themselves to focus on each individual student's errors. To address these issues, researchers have developed numerous Automatic Assessment (AA) systems that not only evaluate the students' programs but also provide instant feedback on their errors as well as abridge the workload of the instructors. Due to the large pool of existing systems, it is difficult to cover each and every system in one study. Therefore, this paper provides a comprehensive overview of some of the existing systems based on the three‐analysis approaches: dynamic, static, and hybrid. Moreover, this paper aims to discuss the strengths and limitations of these systems and suggests some potential recommendations regarding the AA specifications for novice programming, which may help in standardizing these systems.","authors":["Zahid Ullah","Adidah Lajis","Mona Jamjoom","Abdulrahman H. Altalhi"],"meta":["February 2018Computer Applications in Engineering Education 26(6)","DOI:10.1002/cae.21974"],"references":["325209253_Proposed_Assessment_Framework_Based_on_Bloom_Taxonomy_Cognitive_Competency_Introduction_to_Programming","323194408_Realm_of_Thermoalkaline_Lipases_in_Bioprocess_Commodities","307789462_Automatic_Assessment_of_Programming_assignment","295903831_Towards_Practical_Programming_Exercises_and_Automated_Assessment_in_Massive_Open_Online_Courses","289995667_Improving_Automated_Programming_Assessments_User_Experience_Evaluation_Using_FaSt-generator","321597457_Computer_Assisted_Assessment_Research_into_E-Assessment_International_Conference_CAA_2014_Zeist_The_Netherlands_June_30_-_July_1_2014_Proceedings","300113164_A_Framework_of_an_Automatic_Assessment_System_for_Learning_Programming","294733933_How_Difficult_Are_Novice_Code_Writing_Tasks_A_Software_Metrics_Approach","290002478_Kassandra","287282163_Designing_a_test_set_for_structural_testing_in_automatic_programming_assessment"]}