{"id":"325480960_The_10_Vs_Issues_and_Challenges_of_Big_Data","abstract":"In this emerging computing and digital globe, information and Knowledge are created and then collected with a rapid approach by wide range of applications through scientific computing and commercial workloads. Over 3.8 billion people out of 7.6 billion population of the world are connected to the internet. Out of 13.4 billion devices, 8.06 billion devices have a mobile connection. In 2020, 38.5 billion devices will be connected and globally internet traffic will be 92 times greater than it was in 2005. The use of such devices and internet not only increase the data volume but the velocity of market brings in fast-track and accelerates as information is transferred and shared with light speed on optic fiber and wireless networks. This fast generation of huge data creates numerous challenges. The existing approaches addressing issues such as, Volume, Variety, Velocity and Value in big data research perspective. The objectives of the paper are to investigate and analyze the current status of Big Data and furthermore a comprehensive overview of various aspects has discussed, and additionally has been described all 10 Vs' (Issues) of Big Data.","authors":["Nawsher Khan","Mohammed Alsaqer","Habib Shah","Gran Badsha"],"meta":["March 2018","DOI:10.1145/3206157.3206166","Conference: the 2018 International Conference"],"references":["312387451_Big_data_Survey_technologies_opportunities_and_challenges","309588610_Comparison_of_Spark_Resource_Managers_and_Distributed_File_Systems","276248376_Beyond_the_hype_Big_data_concepts_methods_and_analytics","312917980_The_Google_file_system","312775005_MapReduce_Simplified_data_processing_on_large_clusters","306090152_Big_data_in_an_HR_context_Exploring_organizational_change_readiness_employee_attitudes_and_behaviors","305736330_Big_Data_From_Beginning_to_Future","304929258_3-D_Data_Management_Controlling_Data_Volume_Velocity_and_Variety","285473642_Extracting_value_from_chaos","273610489_Big_Data_Little_History"]}