{"id":"325465700_The_First_Impression_of_Conference_Papers_Does_It_Matter_in_Predicting_Future_Citations","abstract":"This paper explores the factors influencing the future citations of conference papers. We concentrated on the explanatory power of early attention on conference papers for citations collected from Google Scholar and Scopus. The early attention data includes users’ online activities in a conference support system: CN3. Bookmarks from the bibliographic management system, Citeulike, were used as a collateral source of early attention. To examine the chronological contributions of 13 factors on citations, a multiple sequential regression analysis was conducted for three time points of the publication cycle – article submission, time of conferences and months after conferences. Our results illustrate that online readers’ early attention of Citeulike bookmarks were found to have the most influence on the future impact of the conference papers. The early attention records from CN3 made noteworthy improvements to explaining both the Google and Scopus citations as well. We also found that the type of papers, the number of papers presented at a conference, and the best paper award records were significant factors influencing future citations. However, the magnitude of the effects made by online readers’ early attention from both sources appears to be larger than these three traditional factors.","authors":["Danielle H. Lee","Peter Brusilovsky"],"meta":["June 2018Journal of the Association for Information Science and Technology Accepted(1)","DOI:10.1002/asi.24100","Projects: Social Systems for Academic ConferencesSocial Recommender Systems"],"references":["289292128_How_well_developed_are_altmetrics_cross-disciplinary_analysis_of_the_presence_of_'alternative_metrics'_in_scientific_publications_RIP","284812572_Google_Scholar_Scopus_and_the_Web_of_Science_A_longitudinal_and_cross-disciplinary_comparison","275527716_Conferences_versus_journals_in_computer_science_Conferences_vs_Journals_in_Computer_Science","350682693_Multiple_Regression_and_Beyond","330698260_Multiple_Regression_and_Beyond_An_Introduction_to_Multiple_Regression_and_Structural_Equation_Modeling","316092105_Do_Mendeley_reader_counts_reflect_the_scholarly_impact_of_conference_papers_An_investigation_of_computer_science_and_engineering","305313479_Using_a_Two-Step_Transformation_to_Address_Non-Normality_from_a_Business_Value_of_Information_Technology_Perspective","304151215_Linking_information_and_people_in_a_social_system_for_academic_conferences","294577114_Factors_affecting_number_of_citations_a_comprehensive_review_of_the_literature","272139358_Republication_of_conference_papers_in_journals"]}