{"id":"325456402_Constrained_distance_based_clustering_for_time-series_a_comparative_and_experimental_study","abstract":"Constrained clustering is becoming an increasingly popular approach in data mining. It offers a balance between the complexity of producing a formal definition of thematic classes—required by supervised methods—and unsupervised approaches, which ignore expert knowledge and intuition. Nevertheless, the application of constrained clustering to time-series analysis is relatively unknown. This is partly due to the unsuitability of the Euclidean distance metric, which is typically used in data mining, to time-series data. This article addresses this divide by presenting an exhaustive review of constrained clustering algorithms and by modifying publicly available implementations to use a more appropriate distance measure—dynamic time warping. It presents a comparative study, in which their performance is evaluated when applied to time-series. It is found that k-means based algorithms become computationally expensive and unstable under these modifications. Spectral approaches are easily applied and offer state-of-the-art performance, whereas declarative approaches are also easily applied and guarantee constraint satisfaction. An analysis of the results raises several influencing factors to an algorithm’s performance when constraints are introduced.","authors":["Thomas Lampert","Thi-Bich-Hanh Dao","Baptiste Lafabregue","Serrette Nicolas"],"meta":["November 2018Data Mining and Knowledge Discovery 32(2)","DOI:10.1007/s10618-018-0573-y","Project: ICUBE-COCLICO"],"references":["313484584_On_combining_classifiers","329236159_Semi-supervised_clustering_with_user_feedback","329235533_Constrained_clustering_Advances_in_algorithms_theory_and_applications","329235506_Using_assignment_constraints_to_avoid_empty_clusters_in_k-means_clustering","314408182_Constrained_clustering_via_spectral_regularization","313487833_A_tutorial_on_spectral_clustering","313385669_Clustering_with_constraints_Feasibility_issues_and_the_k-means_algorithm","313134761_Nonlinear_programming","312351218_Cluster_Ensemble_Selection_with_Constraints","311621738_Local_search_approach_for_the_pairwise_constrained_clustering_problem"]}