{"id":"325475570_A_tutorial_on_multiobjective_optimization_fundamentals_and_evolutionary_methods","abstract":"In almost no other field of computer science, the idea of using bio-inspired search paradigms has been so useful as in solving multiobjective optimization problems. The idea of using a population of search agents that collectively approximate the Pareto front resonates well with processes in natural evolution, immune systems, and swarm intelligence. Methods such as NSGA-II, SPEA2, SMS-EMOA, MOPSO, and MOEA/D became standard solvers when it comes to solving multiobjective optimization problems. This tutorial will review some of the most important fundamentals in multiobjective optimization and then introduce representative algorithms, illustrate their working principles, and discuss their application scope. In addition, the tutorial will discuss statistical performance assessment. Finally, it highlights recent important trends and closely related research fields. The tutorial is intended for readers, who want to acquire basic knowledge on the mathematical foundations of multiobjective optimization and state-of-the-art methods in evolutionary multiobjective optimization. The aim is to provide a starting point for researching in this active area, and it should also help the advanced reader to identify open research topics.","authors":["Michael Emmerich","André H. Deutz"],"meta":["September 2018Natural Computing 17(1–2)","DOI:10.1007/s11047-018-9685-y","Project: Set-Oriented and Indicator-Based Multicriteria Optimization (SIMCO)"],"references":["319098122_Performance_metrics_in_multi-objective_optimization","313841537_Design_Perspectives_of_an_Evolutionary_Process_for_Multi-objective_Molecular_Optimization","321544057_Multiple_Criteria_Decision_Analysis_State_of_the_Art_Surveys","318577000_Computing_and_Updating_Hypervolume_Contributions_in_Up_to_Four_Dimensions","318375309_ecr_20_a_modular_framework_for_evolutionary_computation_in_R","318375022_Constraint-handling_techniques_used_with_evolutionary_algorithms","318374908_GECCO_2017_tutorial_on_evolutionary_multiobjective_optimization","318069208_Reference_point_specification_in_hypervolume_calculation_for_fair_comparison_and_efficient_search","313841572_Hypervolume_Indicator_Gradient_Ascent_Multi-objective_Optimization","313841394_Multi-objective_Big_Data_Optimization_with_jMetal_and_Spark"]}