{"id":"325588881_Context-free_path_querying_by_matrix_multiplication","abstract":"Context-free path querying is a technique, which recently gains popularity in many areas, for example, graph databases, bioinformatics, static analysis, etc. In some of these areas, it is often required to query large graphs, and existing algorithms demonstrate a poor performance in this case. The generalization of matrix-based Valiant's context-free language recognition algorithm for graph case is widely considered as a recipe for efficient context-free path querying; however, no progress has been made in this direction so far.\nWe propose the first generalization of matrix-based Valiant's algorithm for context-free path querying. Our generalization does not deliver a truly sub-cubic worst-case complexity algorithm, whose existence still remains a hard open problem in the area. On the other hand, the utilization of matrix operations (such as matrix multiplication) in the process of context-free path query evaluation makes it possible to efficiently apply a wide class of optimizations and computing techniques, such as GPGPU (General-Purpose computing on Graphics Processing Units), parallel processing, sparse matrix representation, distributed-memory computation, etc. Indeed, the evaluation on a set of conventional benchmarks shows, that our algorithm outperforms the existing ones.","authors":["Rustam Azimov","Semyon Grigorev"],"meta":["June 2018","DOI:10.1145/3210259.3210264","Conference: the 1st ACM SIGMOD Joint International Workshop","Project: YaccConstructor"],"references":["322260219_Context-free_path_querying_with_structural_representation_of_result","321662505_Subgraph_Queries_by_Context-free_Grammars","311969459_Context-Free_Path_Querying_with_Structural_Representation_of_Result","305695455_Programming_GPGPU_Graph_Applications_with_Linear_Algebra_Building_Blocks","301335208_Regular_Queries_on_Graph_Databases","316799445_Expert_F_30","312013434_Context-sensitive_data-dependence_analysis_via_linear_conjunctive_language_reachability","311472772_Fast_algorithms_for_Dyck-CFL-reachability_with_applications_to_alias_analysis","308569065_Context-Free_Path_Queries_on_RDF_Graphs","305081839_Regular_Path_Queries_on_Massive_Graphs"]}