{"id":"325577236_Comparative_analysis_of_two_discretizations_of_Ricci_curvature_for_complex_networks","abstract":"We have performed an empirical comparison of two distinct notions of discrete Ricci curvature for graphs or networks, namely, the Forman-Ricci curvature and Ollivier-Ricci curvature. Importantly, these two discretizations of the Ricci curvature were developed based on different properties of the classical smooth notion, and thus, the two notions shed light on different aspects of network structure and behavior. Nevertheless, our extensive computational analysis in a wide range of both model and real-world networks shows that the two discretizations of Ricci curvature are highly correlated in many networks. Moreover, we show that if one considers the augmented Forman-Ricci curvature which also accounts for the two-dimensional simplicial complexes arising in graphs, the observed correlation between the two discretizations is even higher, especially, in real networks. Besides the potential theoretical implications of these observations, the close relationship between the two discretizations has practical implications whereby Forman-Ricci curvature can be employed in place of Ollivier-Ricci curvature for faster computation in larger real-world networks whenever coarse analysis suffices.","authors":["Areejit Samal","R. P. Sreejith","Jiao Gu","Shiping Liu"],"meta":["June 2018Scientific Reports 8(1):8650","DOI:10.1038/s41598-018-27001-3","Project: Geometrical characterization of complex networks"],"references":["313465896_Emergent_Hyperbolic_Network_Geometry","325654623_Discrete_Curvatures_and_Network_Analysis","323198834_Jaccard_Curvature-an_Efficient_Proxy_for_Ollivier-Ricci_Curvature_in_Graphs","321718879_Comparing_Three_Notions_of_Discrete_Ricci_Curvature_on_Biological_Networks","321610148_Riemannian_Geometry_and_Geometric_Analysis","321502225_Riemannian_Geometry_and_Geometric_Analysis","320221064_The_Geometric_Meaning_of_Curvature_Local_and_Nonlocal_Aspects_of_Ricci_Curvature","316519951_A_visual_introduction_to_Riemannian_curvatures_and_some_discrete_generalizations","313609388_On_the_evolution_of_random_graphs","312940435_2001_Statistical_mechanics_of_complex_networksJ"]}