{"id":"325525469_A_virtual_proctor_with_biometric_authentication_for_facilitating_distance_education","abstract":"The lack of efficient and reliable proctoring for tests, examinations and laboratory exercises is slowing down the adoption of distance education. At present, the most popular solution is to arrange for proctors to supervise the students through a surveillance camera system. This method exhibits two shortcomings. The cost for setting up the surveillance system is high and the proctoring process is laborious and tedious. In order to overcome these shortcomings, some proctoring software that identifies and monitors student behavior during educational activities has been developed. However, these software solutions exhibit certain limitations: (i) They impose more severe restrictions on the students than a human proctor would. The students have to sit upright and remain directly in front of their webcams at all times. (ii) The reliability of these software systems highly depends on the initial conditions under which the educational activity is started. For example, changes in the lighting conditions can cause erroneous results.\n\nIn order to improve the usability and to overcome the shortcomings of the existing remote proctoring methods, a virtual proctor (VP) with biometric authentication and facial tracking functionality is proposed here. In this paper, a two-stage approach (facial detection and facial recognition) for designing the VP is introduced. Then, an innovative method to crop out the face region from images based on facial detection is presented. After that, in order to render the usage of the VP more comfortable to the students, in addition to an eigenface-based facial recognition algorithm, a modified facial recognition method based on a real-time stereo matching algorithm is employed to track the students’ movements. Then, the VP identifies suspicious student behaviors that may represent cheating attempts. By employing a combination of eigenface-based facial recognition and real-time stereo matching, the students can move forward, backward, left, right and can rotate their head in a larger range. In addition, the modified algorithm used here is reliable to changes of lighting, thus decreasing the possibility of false identification of suspicious behaviors.","authors":["Zhou Zhang","Elsayed S. Aziz","Sven Esche","C. Chassapis"],"meta":["March 2017","Conference: The 14th International Conference on Remote Engineering and Virtual InstrumentationAt: New York City, New York, USA"],"references":["314079280_A_Virtual_Laboratory_Combined_With_Biometric_Authentication_and_3D_Reconstruction","308796035_A_Smart_Method_for_Developing_Game-Based_Virtual_Laboratories","278966707_Real-Time_3D_Reconstruction_for_Facilitating_the_Development_of_Game-based_Virtual_Laboratories","269333347_Integration_of_Physical_Devices_into_Game-based_Virtual_Reality","265059088_A_Task_Analysis_of_Usability_in_Third-Party_Authentication","319770829_Robust_Real-time_Object_Detection","319770732_A_statistical_approach_for_real-time_robust_background_subtraction_and_shadow_detection","319770162_Fast_and_Robust_Classification_using_Asymmetric_AdaBoost_and_a_Detector_Cascade","299197766_Robust_face_detection_using_the_Hausdorff_distance","299172953_Real-time_face_detection_using_edge-orientation_matching"]}