{"id":"325532104_Clinical_Named_Entity_Recognition_Using_Deep_Learning_Models","abstract":"Clinical Named Entity Recognition (NER) is a critical natural language processing (NLP) task to extract important concepts (named entities) from clinical narratives. Researchers have extensively investigated machine learning models for clinical NER. Recently, there have been increasing efforts to apply deep learning models to improve the performance of current clinical NER systems. This study examined two popular deep learning architectures, the Convolutional Neural Network (CNN) and the Recurrent Neural Network (RNN), to extract concepts from clinical texts. We compared the two deep neural network architectures with three baseline Conditional Random Fields (CRFs) models and two state-of-the-art clinical NER systems using the i2b2 2010 clinical concept extraction corpus. The evaluation results showed that the RNN model trained with the word embeddings achieved a new state-of-the- art performance (a strict F1 score of 85.94%) for the defined clinical NER task, outperforming the best-reported system that used both manually defined and unsupervised learning features. This study demonstrates the advantage of using deep neural network architectures for clinical concept extraction, including distributed feature representation, automatic feature learning, and long-term dependencies capture. This is one of the first studies to compare the two widely used deep learning models and demonstrate the superior performance of the RNN model for clinical NER.","authors":["Yonghui Wu","Min Jiang","Jun Xu","Degui Zhi"],"meta":["April 2018AMIA ... Annual Symposium proceedings / AMIA Symposium. AMIA Symposium 2017:1812-1819"],"references":["317088438_A_Study_of_Neural_Word_Embeddings_for_Named_Entity_Recognition_in_Clinical_Text","317085608_Bidirectional_RNN_for_Medical_Event_Detection_in_Electronic_Health_Records","281815157_Named_Entity_Recognition_in_Chinese_Clinical_Text_Using_Deep_Neural_Network","277411157_Deep_Learning","266201822_Natural_Language_Processing_Almost_from_Scratch","264985584_Evaluating_the_state_of_the_art_in_disorder_recognition_and_normalization_of_the_clinical_narrative","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","305334589_Dependency_Sensitive_Convolutional_Neural_Networks_for_Modeling_Sentences_and_Documents","262219274_Re-ranking_for_joint_named-entity_recognition_and_linking"]}