{"id":"325524586_Emphysema_classification_using_a_multi-view_convolutional_network","abstract":"In this article we propose and validate a fully automatic tool for emphysema classification in Computed Tomography (CT) images. We hypothesize that a relatively simple Convolutional Neural Network (CNN) architecture can learn even better discriminative features from the input data compared with more complex and deeper architectures. The proposed architecture is comprised of only 4 convolutional and 3 pooling layers, where the input corresponds to a 2.5D multiview representation of the pulmonary segment tissue to classify, corresponding to axial, sagittal and coronal views. The proposed architecture is compared to similar 2D CNN and 3D CNN, and to more complex architectures which involve a larger number of parameters (up to six times larger). This method has been evaluated in 1553 tissue samples, and achieves an overall sensitivity of 81.78 % and a specificity of 97.34%, and results show that the proposed method outperforms deeper state-of-the-art architectures particularly designed for lung pattern classification. The method shows satisfactory results in full-lung classification.","authors":["David Bermejo-Pelaez","Raul San Jose Estepar","M. J. Ledesma-Carbayo"],"meta":["April 2018Proceedings / IEEE International Symposium on Biomedical Imaging: from nano to macro. IEEE International Symposium on Biomedical Imaging 2018:519-522","DOI:10.1109/ISBI.2018.8363629","Conference: 2018 IEEE 15th International Symposium on Biomedical Imaging (ISBI 2018)"],"references":["233836017_Advances_in_Optimizing_Recurrent_Networks","13988429_Quantification_of_Pulmonary_Emphysema_from_Lung_Computed_Tomography_Images","5844448_Lung_Tissue_Classification_Using_Wavelet_Frames","311498473_Multi-source_Transfer_Learning_with_Convolutional_Neural_Networks_for_Lung_Pattern_Analysis","296476972_Lung_Pattern_Classification_for_Interstitial_Lung_Diseases_Using_a_Deep_Convolutional_Neural_Network","256191348_Distinct_Quantitative_CT_Emphysema_Patterns_are_Associated_with_Physiology_and_Function_in_Smokers","237070106_Emphysema_quantification_in_a_multi-scanner_HRCT_cohort_using_local_intensity_distributions","24022200_Whole-lung_densitometry_versus_visual_assessment_of_emphysema","5354376_Texture-Based_Quantification_of_Pulmonary_Emphysema_on_High-Resolution_Computed_Tomography_Comparison_With_Density-Based_Quantification_and_Correlation_With_Pulmonary_Function_Test"]}