{"id":"325501788_Error_modelling_and_motion_reliability_analysis_of_a_planar_parallel_manipulator_with_multiple_uncertainties","abstract":"The inherent uncertainties of a manipulator, including manufacturing tolerances, input errors and joint clearances, cause deviations between the actual motion and the expected motion, leading to a motion reliability problem. This paper focuses on the motion reliability of a planar 3-RRR parallel manipulator with multiple uncertainties. First, the error model of the manipulator is built. Then, an analytical method is presented to verify its validation and accuracy. To address the complexity of the motion in a journal-bearing joint, the joint clearance parameters are modelled as interval variables while other parameters are treated as random variables. A new hybrid approach to motion reliability analysis based on the first order second moment (FOSM) method and the Monte Carlo simulation (MCS) method is developed for the manipulator with both random and interval variables. This method has an easier simulation process than that of the conventional MCS method using direct kinematics. Compared to the probability method with random variables, the proposed hybrid method has a higher confidence estimate of motion reliability for the manipulator with joint clearances.","authors":["Zhenhui Zhan","Xianmin Zhang","Zhicong Jian","Haodong Zhang"],"meta":["June 2018Mechanism and Machine Theory 124:55-72","DOI:10.1016/j.mechmachtheory.2018.02.005","Project: Motion reliability of planar parallel  manipulators"],"references":["318697760_Dynamic_analysis_of_a_3-PRR_parallel_mechanism_by_considering_joint_clearances","305724487_Nonlinear_dynamics_and_chaotic_control_of_a_flexible_multibody_system_with_uncertain_joint_clearance","278157068_Dynamic_modeling_and_analysis_of_wear_in_spatial_hard-on-hard_couple_hip_replacements_using_multibody_systems_methodologies","257633888_Study_of_the_effect_of_contact_force_model_on_the_dynamic_response_of_mechanical_systems_with_dry_clearance_joints_Computational_and_experimental_approaches"]}