{"id":"325577251_Peculiarities_of_Formation_of_Knowledge_Economy_Through_Modernization_of_the_Higher_Education_System_in_Russia","abstract":"The paradigm of “knowledge economy” influences socio-economic and political processes within national economies. The primary role of knowledge, wide reproduction of the elements of technical interaction of innovational goods, quick growth of high-tech sector of economy, and qualitative development of human capital – these elements are the main requirements set to the countries that implement the projects of “knowledge economy”. At that, the existing difficulties of implementing the paradigm of “knowledge economy” are related to old ideas of effective development of economy, science, and technological spheres. This problem lies in the system of higher education, which needs substantial modernization. According to this thesis, the purpose of the research is stage-by-stage evaluation of formation of the “knowledge economy” formation through modernization of education system. In order to achieve this goal, it is necessary to solve the following tasks: study “knowledge economy” from the positions of determining the theoretical regularities and the essence of this category; conduct analysis of genesis of “knowledge economy” at various stages of society’s development; determine peculiarities of “knowledge economy” in the system of higher education; form the system of “knowledge economy” according to the authors’ ideas. Scientific novelty of the research consists in studying the issue of “knowledge economy” through the prism of modernization of the system of higher education. Besides, the authors perform comparative evaluation of the levels of higher education of the USA and the Russian Federation and determine the final results of “knowledge economy” formation in each of the above models. The result of the research is formed proprietary system of interaction within “knowledge economy”, between the institutional environment of higher education, R&D system, market structures, state, and human. This research is interesting from the position of application of the new approach to studying the peculiarities of “knowledge economy” formation. According to this, the article will be interesting for specialists that participate in implementation of strategic projects in the sphere of formation of a new economic model of the country’s development.","authors":["Lyudmila I. Gubareva","Valentina S. Tenetilova","Svetlana V. Derepasko","Irina S. Gavrilova"],"meta":["January 2019","DOI:10.1007/978-3-319-90835-9_2","In book: Perspectives on the Use of New Information and Communication Technology (ICT) in the Modern Economy (pp.11-22)"],"references":["291212923_On_innovation_and_knowledge_economy_in_Russia","271081169_International_Joint_Ventures_as_Boundary_Spanners_Technological_Knowledge_Transfer_in_an_Emerging_Economy","270106002_A_PERSPECTIVE_ON_MEDIA_ENTREPRENEURSHIP_POLICY_GLOBALIZATION_OF_KNOWLEDGE_AND_OPPORTUNITIES_FOR_DEVELOPING_ECONOMIES","265509957_Knowledge-_Intensive_Business_Services_KIBS_and_Their_Role_in_the_Knowledge-_Based_Economy","233467307_The_Changing_Role_of_Learning_Regions_in_the_Globalizing_Knowledge_Economy_A_Theoretical_Re-examination","317119054_Smart_city_technologies_new_barriers_to_investment_or_a_method_for_solving_the_economic_problems_of_municipalities","309118425_Peculiarities_of_formation_of_socially_oriented_strategy_of_economic_growth_of_national_economy","270664111_Self-organization_of_knowledge_economies"]}