{"id":"325528964_Online_Learning_Readiness_and_Attitudes_Towards_Gaming_in_Gamified_Online_Learning_-_A_Mixed_Methods_Case_Study","abstract":"Gamification has gained a lot of attention in recent years as a possible way to foster students’ motivation and learning behavior. As a high drop-out rate is associated with distance learning, in particular with students often struggling to engage with the material, the implementation of gamification may support and enhance more successful online learning. A distance learning Bachelor degree class was selected as a case study to investigate the implementation of a Moodle-based gamification concept as well as different variables associated in using a mixed-methods-approach. Eight students were interviewed and 32 participated in an online survey. Significant positive correlations were found between students’ online learning readiness in the dimension of technical competencies and both types of autonomous motivation (identified and intrinsic motivation). A significant positive correlation was also found between self-reported attitudes towards gaming and the dimension of coping of study-satisfaction. As expected, students who indicated rather low online learning readiness tended to show non-autonomous motivation (amotivation). Surprisingly, some students reported autonomous motivation, despite having expressed a rather dismissive attitude towards playing online and computer games in general. Acquiring digital badges reportedly felt like appreciation directly awarded by the students’ instructor. Progress bars were positively evaluated and were accepted as a management tool for individual learning strategies.","authors":["Klaudia Bovermann","Joshua Weidlich","Theo Bastiaens PhD"],"meta":["July 2018","DOI:10.1186/s41239-018-0107-0","Project: Gamified online learning"],"references":["318901719_Using_a_gamified_mobile_app_to_increase_student_engagement_retention_and_academic_achievement","318682271_Forschungsmethoden_und_Evaluation_in_den_Sozial-_und_Humanwissenschaften","313872357_Gamifying_education_what_is_known_what_is_believed_and_what_remains_uncertain_a_critical_review","311879391_How_gamification_motivates_An_experimental_study_of_the_effects_of_specific_game_design_elements_on_psychological_need_satisfaction","346682582_Experteninterviews_und_qualitative_Inhaltsanalyse","323424582_Statistical_power_analysis_for_the_behavioral_sciences","317953655_Designing_and_conducting_mixed_methods_research","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","312303277_The_maturing_of_gamification_research","312291880_Exploring_the_Role_of_E-Learning_Readiness_on_Student_Satisfaction_and_Motivation_in_Flipped_Classroom"]}