{"id":"325545847_Model_of_the_methodical_center_of_open_education_in_computer_science_for_the_teaching_of_gifted_students","abstract":"The article defines and substantiates the advantages of introducing a mixed form of computer science education for gifted students. For the implementation of mixed student learning, a model of a methodological center for open education in computer science at school is offered. The model of the methodical center of open education offers to combine the efforts of teachers of informatics of various educational institutions to create open electronic educational resources for gifted students and to organize their training in inter-school groups. The experience of introducing mixed learning in the field of computer science of gifted students in the model of the methodical center of open education is considered on the example of a regional experiment, which was attended by 6 educational institutions and methodological center. In the model of the methodical center of open education in computer science for gifted students, the purpose and the main tasks, methods and forms of activity of teachers and students in the open informational and educational environment were reflected. The basis of open education in the proposed model is the purposeful, controlled, intensive independent work of students who can study according to an individual schedule in a convenient place, having access to electronic educational resources and an agreed opportunity of contact with the teacher using: e-mail, chat, webinar, video conferencing as well as personal contact. The results of the survey of students and their parents illustrate their interest in obtaining IT education and readiness to participate in teaching computer science in a mixed form of study. The development of the informational and educational environment of open education is provided by cloud services for the preservation and execution of tasks, online teacher consultations, constant updating of video tutorials on html-programming, computer graphics and algorithmization. Most students point out the importance of working with a teacher, but at the level of interaction and consultation, and not control. Results of studying students in the methodical center of open education are confirmed by an increase in the number of prizewinners of computer science competitions and students' satisfaction from online learning","authors":["Iryna Vorotnykova"],"meta":["June 2018OPEN EDUCATIONAL E-ENVIRONMENT OF MODERN UNIVERSITY 4(4):96-107","DOI:10.28925/2414-0325.2018.4.96107","Project: Змішане навчання у загальноосвітній школі"],"references":["311910208_Blended_learning_effectiveness_the_relationship_between_student_characteristics_design_features_and_outcomes"]}