{"id":"325580109_How_to_Perform_a_Literature_Review_with_Free_and_Open_Source_Software","abstract":"As it provides a firm foundation for advancing knowledge, a solid literature review is a critical feature of any academic investigation. Yet, there are several challenges in performing literature reviews including: i) lack of access to the literature because of costs, ii) fracturing of the literature into many sources, lack of access and comprehensive coverage in many databases and search engines, and iii) the use of proprietary software lock-in strategies for bibliographic software, which can make porting literature reviews between organizations cumbersome and costly. These challenges often result in poor quality literature reviews completed by a single researcher unfamiliar with the approaches to the same research in other sub-fields and static reviews that are often lost to the scientific community. In this paper, an open source approach will be expanded to the application of improving the quality of literature reviews by providing best practices. Although there are many types and goals of literature reviews, it is found that all of them can be improved using a tool chain of free and open source software (FOSS) and methods. Specifically, this paper will provide a clear framework for i) comprehensive searching and obtaining access to the literature, ii) the use of FOSS for all steps including browsing, bibliographic software, and writing and iii) documenting a literature review to encourage collaboration of a dynamic document that lives into the future. This approach solves the current challenges of literature reviews and provides benefits of lower labor and economic costs, improved researcher control, and increased potential for collaboration. Finally, the challenges of using this approach and methods to overcome them are reviewed and future work is described.","authors":["Joshua M Pearce"],"meta":["May 2018"],"references":["345698528_The_State_of_OA_A_large-scale_analysis_of_the_prevalence_and_impact_of_Open_Access_articles","320722731_Distributed_Manufacturing_of_Flexible_Products_Technical_Feasibility_and_Economic_Viability","318581967_Impact_of_DIY_Home_Manufacturing_with_3D_Printing_on_the_Toy_and_Game_Market","315510195_Emerging_Business_Models_for_Open_Source_Hardware","313592355_Emergence_of_Home_Manufacturing_in_the_Developed_World_Return_on_Investment_for_Open-Source_3-D_Printers","311651498_Wikis_for_group_work_Encouraging_transparency_benchmarking_and_feedback","309897059_Open_Source_Database_and_Website_to_Provide_Free_and_Open_Access_to_Inactive_US_Patents_in_the_Public_Domain","303397810_3D_Printing_in_the_Laboratory_Maximize_Time_and_Funds_with_Customized_and_Open-Source_Labware","316024398_A_comparative_analysis_of_forums_and_wikis_as_tools_for_online_collaborative_learning","315476506_Monitoring_a_National_Open_Access_Funder_Mandate"]}