{"id":"325588643_Unifying_Leakage_Models_From_Probing_Attacks_to_Noisy_Leakage","abstract":"A recent trend in cryptography is to formally show the leakage resilience of cryptographic implementations in a given leakage model. One of the most prominent leakage model—the so-called bounded leakage model—assumes that the amount of leakage that an adversary receives is a-priori bounded. Unfortunately, it has been pointed out by several works that the assumption of bounded leakages is hard to verify in practice. A more realistic assumption is to consider that leakages are sufficiently noisy, following the engineering observation that real-world physical leakages are inherently perturbed by physical noise. While already the seminal work of Chari et al. (in: CRYPTO, pp 398–412, 1999) study security of side-channel countermeasures in the noisy model, only recently Prouff and Rivain (in: Johansson T, Nguyen PQ (eds) EUROCRYPT, volume 7881 of lecture notes in 931 computer science, pp 142–159, Springer, 2013) offer a full formal analysis of the masking countermeasure in a physically motivated noise model. In particular, the authors show that a block-cipher implementation that uses the Boolean masking scheme is secure against a very general class of noisy leakage functions. While this is an important step toward better understanding the security of masking schemes, the analysis of Prouff and Rivain has several shortcomings including in particular requiring leak-free gates. In this work, we provide an alternative security proof in the same noise model that overcomes these challenges. We achieve this goal by a new reduction from noisy leakage to the important model of probing adversaries (Ishai et al. in: CRYPTO, pp 463–481, 2003). This reduction is the main technical contribution of our work that significantly simplifies the formal security analysis of masking schemes against realistic side-channel leakages.","authors":["Alexandre Duc","Stefan Dziembowski","Sebastian Faust"],"meta":["June 2018Journal of Cryptology 32(1)","DOI:10.1007/s00145-018-9284-1"],"references":["266531126_Leakage-Resilient_Symmetric_Cryptography_under_Empirically_Verifiable_Assumptions","264458092_Masking_against_Side-Channel_Attacks_A_Formal_Security_Proof","264458001_Provably_Secure_Higher-Order_Masking_of_AES","262162590_Higher-Order_Masking_Schemes_for_S-Boxes","325215122_How_to_Compute_in_the_Presence_of_Leakage","301670692_Circuit_Compilers_with_O1log_n_O_1_log_n_Leakage_Rate","283882418_Noisy_Leakage_Revisited","267185998_How_to_Compute_under_calACsf0_Leakage_without_Secure_Hardware","262356200_Leakage-Resilient_Circuits_without_Computational_Assumptions","262209324_Shielding_circuits_with_groups","225899150_Provably_secure_masking_of_AES","261455354_How_to_Compute_in_the_Presence_of_Leakage","234818880_Power_Analysis_Attacks_Revealing_the_Secrets_of_Smart_Cards_Advances_in_Information_Security","225679785_Physically_Observable_Cryptography","224354130_Leakage-Resilient_Cryptography"]}