{"id":"325569975_25_Reviews_on_Artificial_Human_Optimization_Field_for_the_First_Time_in_Research_Industry","abstract":"The author proposed a new field titled “Artificial Human Optimization” in December 2016 [1]. He authored the following five articles in Artificial Human Optimization field:\n\n1) Entrepreneur: Artificial Human Optimization. Transactions on Machine Learning and Artificial Intelligence, Volume 4 No 6 December (2016); pp: 64-70 [1]. 2) “CEO: Different Reviews on PhD in Artificial Intelligence”, Global Journal of Advanced Research, vol. 1, no.2, pp. 155-158, 2014 [2]. 3) “POSTDOC : The Human Optimization”, Computer Science & Information Technology (CS & IT), CSCP, pp. 183-187, 2013 [3]. 4) “Artificial Human Optimization – An Introduction”, Transactions on Machine Learning and Artificial Intelligence, Volume 6, No 2, pp: 1-9, April 2018 [4]. 5) “An Ocean of Opportunities in Artificial Human Optimization Field”, Transactions on Machine Learning and Artificial Intelligence, Volume 6, No 3, June 2018 [5].\n\nThe complete reviews of all the above papers are shown in this paper for the first time in Research Industry. This paper is a new kind of research paper where the focus is completely on the reviews obtained for a particular new field. This work is the extension of work in [2]. Similar to this paper, the article [2] is completely focused on reviews obtained. The difference between article [2] and this paper lies in the fact that in this paper reviews are shown for all the papers of the author in Artificial Human Optimization field whereas article [2] shows reviews of single paper in Artificial Human optimization field.","authors":["Satish Gajawada"],"meta":["June 2018","Project: Artificial Human Optimization"],"references":["325570144_An_Ocean_of_Opportunities_in_Artificial_Human_Optimization_Field","325570137_Artificial_Human_Optimization_-_An_Introduction","325569937_Entrepreneur_Artificial_Human_Optimization","325569918_CEO_Different_Reviews_on_PhD_in_Artificial_Intelligence"]}