{"id":"325519832_Compositional_Structure_Recognition_of_3D_Building_Models_Through_Volumetric_Analysis","abstract":"Structure is one of the most important properties of man-made objects, and it is beneficial for a number of applications. In this paper, we propose an effective method to recognize the 3D building models’ compositional structures, which represent the basic knowledge of human beings on the shape formation of the models in 3D space. To overcome the shortcomings of the traditional algorithms that are focused on the detailed geometric features of the surface meshes, volumetric analysis is employed here to study the compositional structures of the building models from inside. To describe the general shape of a building model in 3D space, the model is voxelized, and layered distance maps are generated to record its volumetric characteristics at different places. With reference to the value variation of the layered distance maps in the horizontal and vertical directions, different structural parts are identified in the voxel space, and the valid voxels are classified accordingly to obtain the voxel representation of each part. Based on the volume decomposition result, an extended topological graph (ETG) is then constructed for description of the compositional structure of the building model. As the spatial relationships between different parts are analyzed from inside and the whole process is implemented in the voxel space, the method is immune to the complicated and confusing features on the surfaces of the building models, with the scale of the structure recognition determined by the discretizing resolution of the voxel space. In the experiments, three typical building models are chosen for discussion of the effectiveness and efficiency of the proposed approach, and some example applications are shown to demonstrate its potential usage in different fields.","authors":["Xuan Sun","Qingquan Li","Bisheng Yang"],"meta":["June 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2842721"],"references":["303597788_Structure-adaptive_Shape_Editing_for_Man-made_Objects","295457603_Erratum_Building_Information_Modeling_BIM_for_existing_buildings_-_Literature_review_and_future_needs_Automation_in_Construction_2014_38_109-127","290812094_Recognizing_structure_in_laser_scanning_point_clouds","312976276_Parts_of_recognition","286026550_Mesh_segmentation_using_feature_point_and_core_extraction","267555374_Generalization_of_tiled_models_with_curved_surfaces_using_typification","262334849_LOD_Generation_for_3D_Polyhedral_Building_Model","262212076_Interpreting_Concept_Sketches","259134758_Geometric_structure_simplification_of_3D_building_models","257346534_CityGML_-_Interoperable_semantic_3D_city_models"]}