{"id":"325563832_Eco-Cognitive_Computationalism_From_Mimetic_Minds_to_Morphology-Based_Enhancement_of_Mimetic_Bodies","abstract":"Eco-cognitive computationalism sees computation in context, exploiting the ideas developed in those projects that have originated the recent views on embodied, situated, and distributed cognition. Turing’s original intellectual perspective has already clearly depicted the evolutionary emergence in humans of information, meaning, and of the first rudimentary forms of cognition, as the result of a complex interplay and simultaneous coevolution, in time, of the states of brain/mind, body, and external environment. This cognitive process played a fundamental heuristic role in Turing’s invention of the universal logical computing machine. It is by extending this eco-cognitive perspective that we can see that the recent emphasis on the simplification of cognitive and motor tasks generated in organic agents by morphological aspects implies the construction of appropriate “mimetic bodies”, able to render the accompanied computation simpler, according to a general appeal to the “simplexity” of animal embodied cognition. I hope it will become clear that eco-cognitive computationalism does not aim at furnishing a final and stable definition of the concept of computation, such as a textbook or a different epistemological approach could provide: I intend to take into account the historical and dynamical character of the concept, to propose an intellectual framework that depicts how we can understand not only the change of its meaning, but also the “emergence” of new forms of computations.","authors":["Lorenzo Magnani"],"meta":["June 2018Entropy 20(6):430","DOI:10.3390/e20060430"],"references":["323427510_Computation_and_Representation_in_Cognitive_Neuroscience","320359134_Computational_Dynamics_of_Natural_Information_Morphology_Discretely_Continuous","307559761_What_Is_Morphological_Computation_On_How_the_Body_Contributes_to_Cognition_and_Control","346831691_Intelligent_Machinery_1948","332765197_Computationalism_in_a_Dynamic_and_Distributed_Eco-cognitive_Perspective","328753512_Laplace_Turing_et_la_geometrie_impossible_du_jeu_de_l_'imitation_aleas_determinisme_et_programmes_dans_le_test_de_Turing","327580372_Darwin's_Unfinished_Symphony_How_Culture_Made_the_Human_Mind","303616836_When_does_a_physical_system_compute","301340622_Physical_Computation_A_Mechanistic_Account","290049139_Mimetic_Minds_Meaning_Formation_through_Epistemic_Mediators_and_External_Representations","288985527_The_Info-computational_Nature_of_Morphological_Computing","277698388_Information_Physics-Towards_a_New_Conception_of_Physical_Reality","277412620_Information_processing_via_physical_soft_body","267567971_Morphological_Computation_-_The_Body_as_a_Computational_Resource","270808929_The_Prehistory_of_the_Mind_A_Search_for_the_Origins_of_Art_Religion_and_Science"]}