{"id":"325564266_Twenty_years_of_the_Journal_of_Knowledge_Management_a_bibliometric_analysis","abstract":"Purpose\n\nIn 2017, the Journal of Knowledge Management (JKM) celebrates its 20th anniversary. This study aims to show an updated analysis of their publications to provide a general overview of the journal, focusing on a bibliometric analysis of its publications between 1997 and 2016.\n\nDesign/methodology/approach\n\nThe methodology involves two procedures: a performance analysis and a science mapping analysis of JKM. The performance analysis uses a series of bibliometric indicators such as h-index, productivity and citations. This analysis considers different dimensions, including papers, authors, universities and countries. VOSviewer software is used to carry out the mapping of science of JKM, which, based on the concurrence of key words and co-citation points of view, seeks to graphically analyze the structure of the references of this journal.\n\nFindings\n\nThere is a positive evolution in the number of publications (although with certain oscillations), which shows a growing interest in publishing in JKM. The USA and the UK lead the publications in this journal, although at a regional level, Europe is the most productive. The low participation of emerging economies in JKM is also observed.\n\nPractical implications\n\nThe paper will identify the leading trends in the journal in terms of papers, authors, institutions, countries, journals and keywords. This study is useful for obtaining a quick snapshot of what is happening in the journal.\n\nOriginality/value\n\nFrom the historical record of JKM publications, this study presents an exclusive bibliometric analysis of its publications until 2016 and identifies its main trends.","authors":["Magaly Gaviria-Marin","Jose M. Merigo","Simona Popa"],"meta":["June 2018Journal of Knowledge Management 22(6)","DOI:10.1108/JKM-10-2017-0497"],"references":["326811636_Knowledge_management_A_global_examination_based_on_bibliometric_analysis","322292788_International_entrepreneurship_a_bibliometric_overview","327063629_Analisis_bibliometrico_del_campo_modelado_de_difusion_de_innovaciones","324501572_A_Bibliometric_Analysis_of_the_First_Twenty-Five_Years_of_the_International_Journal_of_Uncertainty_Fuzziness_and_Knowledge-Based_Systems","322860274_Fifty_years_of_the_European_Journal_of_Marketing_a_bibliometric_analysis","321672602_Knowledge_management_impacts_on_organizational_innovation_performance","321472423_Fifty_Years_of_Information_Sciences_A_Bibliometric_Overview","320107397_Mapping_the_knowledge_domains_of_Building_Information_Modeling_BIM_A_bibliometric_approach","319594822_Forty_years_of_Computers_Industrial_Engineering_A_bibliometric_analysis","318717500_Entrepreneurial_settings_within_global_family_firms_research_perspectives_from_cross-cultural_knowledge_management_studies"]}