{"id":"325557708_'It's_Reducing_a_Human_Being_to_a_Percentage'_Perceptions_of_Procedural_Justice_in_Algorithmic_Decisions","abstract":"Data-driven decision-making consequential to individuals raises important questions of accountability and justice. Indeed, European law provides individuals limited rights to ‘meaningful information about the logic’ behind significant, autonomous decisions such as loan approvals, insurance quotes, and CV filtering. We undertake three studies examining people's perceptions of justice in algorithmic decision-making under different scenarios and explanation styles. Dimensions of justice previously observed in response to human decision-making appear similarly engaged in response to algorithmic decisions. Qualitative analysis identified several concerns and heuristics involved in justice perceptions including arbitrariness, generalisation, and (in)dignity. Quantitative analysis indicates that explanation styles primarily matter to justice perceptions only when subjects are exposed to multiple different styles—under repeated exposure of one style, scenario effects obscure any explanation effects. Our results suggests there may be no 'best’ approach to explaining algorithmic decisions, and that reflection on their automated nature both implicates and mitigates justice dimensions.","authors":["R Binns","Max Van Kleek","M Veale","U Lyngs"],"meta":["April 2018","Conference: CHI'18: ACM Conference on Human Factors in Computing Systems"],"references":["319277461_User_Preferences_for_Hybrid_Explanations","312597416_Why_a_Right_to_Explanation_of_Automated_Decision-Making_Does_Not_Exist_in_the_General_Data_Protection_Regulation","307558943_Evaluating_the_Visualization_of_What_a_Deep_Neural_Network_Has_Learned","301894892_First_I_like_it_then_I_hide_it_Folk_Theories_of_Social_Feeds","318003528_Slave_to_the_Algorithm_Why_a_Right_to_Explanationn_is_Probably_Not_the_Remedy_You_are_Looking_for","315843595_UX_Design_Innovation_Challenges_for_Working_with_Machine_Learning_as_a_Design_Material","305342147_Why_Should_I_Trust_You_Explaining_the_Predictions_of_Any_Classifier","301931787_How_Much_Information_Effects_of_Transparency_on_Trust_in_an_Algorithmic_Interface","294285834_Explaining_Recommendations_Design_and_Evaluation","292321537_Credit_scoring_and_the_equal_credit_opportunity_act"]}