{"id":"325599662_Efficient_algorithms_using_subiterative_convergence_for_Kemeny_ranking_problem","abstract":"Rank aggregation problem is useful to practitioners in political science, computer science, social science, medical science, and allied fields. The objective is to identify a consensus ranking of n objects that best fits independent rankings given by k different judges. Under the Kemeny framework, a distance metric called Kemeny distance is minimized to obtain consensus ranking. For large n, with present computing powers, it is not feasible to identify a consensus ranking under the Kemeny framework. To address the problem, researchers have proposed several algorithms. These algorithms are able to handle datasets with n up to 200 in a reasonable amount of time. However, run-time increases very quickly as n increases. In the present paper, we propose two basic algorithms— Subiterative Convergence and Greedy Algorithm. Using these basic algorithms, two advanced algorithms— FUR and SIgFUR have been developed. We show that our results are generally superior to existing algorithms in terms of both performance (Kemeny distance) and run-time. Even for large number of objects, the proposed algorithms run in few minutes.","authors":["Prakash Singh Badal","Ashish Das"],"meta":["June 2018Computers & Operations Research 98","DOI:10.1016/j.cor.2018.06.007"],"references":["291355884_A_Recursive_Partitioning_Method_for_the_Prediction_of_Preference_Rankings_Based_Upon_Kemeny_Distances","283808033_Two_algorithms_for_finding_optimal_solutions_of_the_Kemeny_rank_aggregation_problem_for_full_rankings","346366705_Nicholas_of_Cusa_and_Medieval_Political_Thought","324470397_Mathematical_Models_in_the_Social_Sciences","324356152_Essai_sur_l'application_de_l'analyse_a_la_probabilite_des_decisions","322715582_The_elements_of_statistical_learning","312968262_A_differential_evolution_algorithm_for_finding_the_median_ranking_under_the_Kemeny_axiomatic_approach","310403387_A_K-means_clustering_algorithm","307534542_Algorithm_AS_136_A_K-means_vlustering_algorithm","284540314_Social_Choice_and_Individual_Values"]}