{"id":"325675922_Fair_allocation_of_indivisible_goods","abstract":"As introduced in Chapter 11, fair allocation (or fair division) refers to the general problem of fairly dividing a common resource among agents having different-and sometimes antagonistic-interests in the resource. But under this general term one can actually gather a cluster of very different problems, all calling for different solution concepts: after all, one can easily figure out that we cannot allocate a set of objects like a bicycle, a car or a house like we allocate pieces of land. In this chapter, we will focus on fair division of indivisible goods. In other words, the resource is here a set O = {o1, …, op} of objects (that may also be called goods or items). Every object must be allocated as is, that is, an object loses its value if it is broken or divided into pieces to be allocated to several individuals. This assumption makes sense in a lot of real-world situations, where indivisible goods can be for example physical objects such as houses or cars in divorce settlements, or “virtual” objects like courses to allocate to students (Othman et al., 2010) or Earth observation images (Lemaître et al., 1999). Moreover, we assume in this chapter that the objects are nonshareable, which means that the same item cannot be allocated to more than one agent. This assumption seems to be questionable when the objects at stake are rather nonrival, that is, when the consumption of one unit by an agent will not prevent another one from having another unit (what we referred to as “virtual” objects). In most applications, such nonrival objects are available in limited quantity though (e.g., number of attendants in a course). This kind of problems can always be modeled with nonshareable goods by introducing several units of the same good. What mainly makes fair division of indivisible goods specific, if not more difficult, is that classical fairness concepts like envy-freeness or proportionality are sometimes unreachable, unlike in the divisible (aka cake-cutting) case. As an illustration of this difference, consider a (infinitely divisible) piece of land which has to be split among two individuals, Alice and Bob. One classical way to proceed (see Chapter 13) is to let Alice propose a cut, and then let Bob take the share he prefers. © Felix Brandt, Vincent Conitzer, Ulle Endriss, Jérôme Lang, Ariel D. Procaccia 2016.","authors":["Sylvain Bouveret","Yann Chevaleyre","Nicolas Maudet"],"meta":["January 2016","DOI:10.1017/CBO9781107446984.013"],"references":[]}