{"id":"325659876_Moving_forward_with_ethnomethodological_approaches_to_analysing_mathematics_classroom_interactions","abstract":"Ethnomethodological approaches to research such as Interactionism, Conversation Analysis and Discursive Psychology have so far played only a small part in mathematics education research. This is in contrast to the wider use of these approaches in language education, medical discourse research, and legal discourse research. This article outlines the key principles an ethnomethodological approach follows, the methods used and the necessary reconceptualisation of some key concepts that are the focus of much mathematics education research. These are illustrated with some key examples from research in mathematics education, before looking at other fields for potential opportunities not yet realised within research in mathematics classrooms. These opportunities include a range of research questions already receiving a great deal of attention within the field but are yet to be examined from an ethnomethodological perspective. They also include new approaches that involve combining different research approaches which have been used to great effect in other fields.","authors":["Jenni Ingram"],"meta":["June 2018ZDM: the international journal on mathematics education 50(5):1-11","DOI:10.1007/s11858-018-0951-3"],"references":["312652565_Conversation_analysis_and_institutional_talk","290899397_Handling_errors_as_they_arise_in_whole-class_interactions","324034702_Making_Student_Explanations_Relevant_in_Whole_Class_Discussion","324034701_Recommendations_for_Research_on_Language_and_Learning_Mathematics","288915714_Mathematics_learning_in_narrative_classroom_cultures_Studies_of_argumentation_in_primary_mathematics_education","288878163_How_to_Analyse_Talk_in_Institutional_Settings_A_Casebook_of_Methods","287509970_The_Interactional_Architecture_of_the_Language_Classroom_A_Conversation_Analysis_Perspective","286423454_Corpus_Linguistics_and_Conversation_Analysis_at_the_Interface_Theoretical_Perspectives_Practical_Outcomes","285929877_The_Handbook_of_Conversation_Analysis","285049704_Teacher_evaluations"]}