{"id":"325605113_Equivalent-accuracy_accelerated_neural-network_training_using_analogue_memory","abstract":"Neural-network training can be slow and energy intensive, owing to the need to transfer the weight data for the network between conventional digital memory chips and processor chips. Analogue non-volatile memory can accelerate the neural-network training algorithm known as backpropagation by performing parallelized multiply-accumulate operations in the analogue domain at the location of the weight data. However, the classification accuracies of such in situ training using non-volatile-memory hardware have generally been less than those of software-based training, owing to insufficient dynamic range and excessive weight-update asymmetry. Here we demonstrate mixed hardware-software neural-network implementations that involve up to 204,900 synapses and that combine long-term storage in phase-change memory, near-linear updates of volatile capacitors and weight-data transfer with 'polarity inversion' to cancel out inherent device-to-device variations. We achieve generalization accuracies (on previously unseen data) equivalent to those of software-based training on various commonly used machine-learning test datasets (MNIST, MNIST-backrand, CIFAR-10 and CIFAR-100). The computational energy efficiency of 28,065 billion operations per second per watt and throughput per area of 3.6 trillion operations per second per square millimetre that we calculate for our implementation exceed those of today's graphical processing units by two orders of magnitude. This work provides a path towards hardware accelerators that are both fast and energy efficient, particularly on fully connected neural-network layers.","authors":["Stefano Ambrogio","Pritish Narayanan","Hsinyu Tsai","Robert M. Shelby"],"meta":["June 2018Nature 558(7708)","DOI:10.1038/s41586-018-0180-5"],"references":["321510724_Mixed-precision_training_of_deep_neural_networks_using_computational_memory","319856813_In-Datacenter_Performance_Analysis_of_a_Tensor_Processing_Unit","317613363_In-Datacenter_Performance_Analysis_of_a_Tensor_Processing_Unit","320607067_Analog_CMOS-based_resistive_processing_unit_for_deep_neural_network_training","320089060_Reducing_circuit_design_complexity_for_neuromorphic_machine_learning_systems_based_on_Non-Volatile_Memory_arrays","319770357_DeCAF_A_Deep_Convolutional_Activation_Feature_for_Generic_Visual_Recognition","319607193_Toward_on-chip_acceleration_of_the_backpropagation_algorithm_using_nonvolatile_memory","319031516_Achieving_ideal_accuracies_in_analog_neuromorphic_computing_using_periodic_carry","317739794_Analog_CMOS-based_Resistive_Processing_Unit_for_Deep_Neural_Network_Training","313878822_A_non-volatile_organic_electrochemical_device_as_a_low-voltage_artificial_synapse_for_neuromorphic_computing","311445870_Neuromorphic_computing_using_non-volatile_memory","313264818_Can_FPGAs_Beat_GPUs_in_Accelerating_Next-Generation_Deep_Neural_Networks","310745621_Li-Ion_Synaptic_Transistor_for_Low_Power_Analog_Computing","306281834_Rethinking_the_Inception_Architecture_for_Computer_Vision","306218037_Learning_multiple_layers_of_features_from_tiny_images"]}