{"id":"325657564_A_Lightning_fast_approach_to_classify_Bangla_Handwritten_Characters_and_Numerals_using_newly_structured_Deep_Neural_Network","abstract":"Handwritten character recognition is a significant image classification task. We present a model that is the first of it’s kind as it is the first ever deep learning model designed to classify all basic and compound Bangla handwritten characters along with all Bangla numerals under the same filters. In this work, we propose a new architecture that can potentially ensure the network to learn sufficient number of filters with fewer parameters and time complexity. Furthermore, we also devised a technique to select a specific portion of the network that has almost the same learning capability as the entire network. Moreover, we demonstrated how this technique can enhance classification accuracy while making the neural network unbiased in terms of view point. Our proposed model is also a demonstration of managing variable amount of filters without adding the load on number of parameters required. Through the coarse of this work we came up with a image classifier that can classify all meaningful Bangla handwritten characters and numerals of different shapes. Consequently, we have achieved an accuracy rate of 97.21%. The paper provides conclusive results as well as adequate proof behind all the methodologies presented.","authors":["Sourajit Saha","Nisha Saha Puja"],"meta":["January 2018Procedia Computer Science 132:1760-1770","DOI:10.1016/j.procs.2018.05.151","Project: Presented in International Conference on Computational Intelligence and Data Science, sponsored by IBM Research India"],"references":["315945090_BanglaLekha-Isolated_A_multi-purpose_comprehensive_dataset_of_Handwritten_Bangla_Isolated_characters","313955743_Bangla_handwritten_digit_recognition_using_autoencoder_and_deep_convolutional_neural_network","280131305_Learned_vs_Hand-Crafted_Features_for_Pedestrian_Gender_Recognition","279298981_Bangla_Handwritten_Character_Recognition_using_Convolutional_Neural_Network","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311609041_Deep_Residual_Learning_for_Image_Recognition","306281834_Rethinking_the_Inception_Architecture_for_Computer_Vision","303449354_Wide_Residual_Networks","295256741_Role_of_Offline_Handwritten_Character_Recognition_System_in_Various_Applications","226218344_A_Tutorial_on_the_Cross-Entropy_Method"]}