{"id":"325686162_Smartphone_sensor-based_activity_recognition_by_using_machine_learning_and_deep_learning_algorithms","abstract":"Smartphones are widely used today, and it becomes possible to detect the user's environmental changes by using the smartphone sensors, as demonstrated in this paper where we propose a method to identify human activities with reasonably high accuracy by using smartphone sensor data. First, the raw smartphone sensor data are collected from two categories of human activity: motion-based, e.g., walking and running; and phone movement-based, e.g., left-right, up-down, clockwise and counterclockwise movement. Firstly, two types of features extraction are designed from the raw sensor data, and activity recognition is analyzed using machine learning classification models based on these features. Secondly, the activity recognition performance is analyzed through the Convolutional Neural Network (CNN) model using only the raw data. Our experiments show substantial improvement in the result with the addition of features and the use of CNN model based on smartphone sensor data with judicious learning techniques and good feature designs. © 2018, International Association of Computer Science and Information Technology.","authors":["Qingzhong Liu","Zhaoxian Zhou","Sarbagya Ratna Shakya","Prathyusha Uduthalapally"],"meta":["April 2018","DOI:10.18178/ijmlc.2018.8.2.674","Project: human activity recogntion"],"references":["318392552_Deep_Learning_for_Sensor-based_Activity_Recognition_A_Survey","261056239_Activity_recognition_using_smartphone_sensors","244476949_A_Survey_on_Smartphone-Based_Systems_for_Opportunistic_User_Context_Recognition","224170986_A_survey_of_mobile_phone_sensing_IEEE_Commun_Mag","221240669_ActiServ_Activity_Recognition_Service_for_mobile_phones","283259046_Sequential_Deep_Learning_for_Human_Action_Recognition","234784440_SmartBuckle_human_activity_recognition_using_a_3-axis_accelerometer_and_a_wearable_camera","225806390_An_Activity_Recognition_System_For_Mobile_Phones","221016026_Activity_Recognition_from_User-Annotated_Acceleration_Data","220737182_Analysis_of_low_resolution_accelerometer_data_for_continuous_human_activty_recognition"]}