{"id":"325685712_Deep_Autoencoder_Networks_optimized_with_genetic_algorithms_for_efficient_ECG_clustering","abstract":"Deep analyses of electrocardiogram (ECG) signals can reveal hidden information that can be potentially useful for the accurate diagnosis of heart diseases. Time series data of ECGs are usually high dimensional and complex in their components. One of the key successes for this kind of learning is to learn from the representative data. In this research, we present Deep Autoencoder Networks (DANs) for efficient casting of time series representatives. To determine the appropriate DAN structure, we use genetic algorithms (GAs). ECG representatives are then clustered. The clustering results obtained from our proposed method are compared with those obtained using other time series representation techniques. This comparison is based on the grouping accuracy involving the correct data label and cluster purity. The experimental results show that we can cast for appropriate ECG representatives that yield better performance with regard to time series clustering with 30% improvement in grouping accuracy and 23% increase in the purity metric. © 2018, International Association of Computer Science and Information Technology.","authors":["Tippaya Thinsungnoen","K. Kerdprasop","Nittaya Kerdprasop"],"meta":["April 2018","DOI:10.18178/ijmlc.2018.8.2.672"],"references":["328423972_A_Deep_Learning_of_Time_Series_for_Efficient_Analysis","328421261_Support_Vector_Machine_with_Restarting_Genetic_Algorithm_for_Classifying_Imbalanced_Data","328421175_The_Forecast_of_PM10_Pollutant_by_Using_a_Hybrid_Model","282649748_pdc_An_R_Package_for_Complexity-Based_Clustering_of_Time_Series","319770626_Multi-column_Deep_Neural_Networks_for_Image_Classification","313706874_Adaptation_in_natural_and_artificial_systems","308263678_Dimensionality_reduction_for_fast_similarity_search_in_large_time_series_databases","306069516_ECG_Assessment_based_on_Neural_Networks_with_Pretraining","292215395_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","291437015_Model-Coupled_Autoencoder_for_Time_Series_Visualisation"]}