{"id":"325615571_Contributions_to_Seismic_Full_Waveform_Inversion_for_Time_Harmonic_Wave_Equations_Stability_Estimates_Convergence_Analysis_Numerical_Experiments_involving_Large_Scale_Optimization_Algorithms","abstract":"In this project, we investigate the recovery of subsurface Earth parameters. We considerthe seismic imaging as a large scale iterative minimization problem, and deploy the FullWaveform Inversion (FWI) method, for which several aspects must be treated. The recon-struction is based on the wave equations because the characteristics of the measurementsindicate the nature of the medium in which the waves propagate. First, the natural het-erogeneity and anisotropy of the Earth require numerical methods that are adapted andefficient to solve the wave propagation problem. In this study, we have decided to workwith the harmonic formulation, i.e., in the frequency domain. Therefore, we detail themathematical equations involved and the numerical discretization used to solve the waveequations in large scale situations.The inverse problem is then established in order to frame the seismic imaging. It isa nonlinear and ill-posed inverse problem by nature, due to the limited available data,and the complexity of the subsurface characterization. However, we obtain a conditionalLipschitz-type stability in the case of piecewise constant model representation. We derivethe lower and upper bound for the underlying stability constant, which allows us to quantifythe stability with frequency and scale. It is of great use for the underlying optimizationalgorithm involved to solve the seismic problem. We review the foundations of iterativeoptimization techniques and provide the different methods that we have used in this project.The Newton method, due to the numerical cost of inverting the Hessian, may not always beaccessible. We propose some comparisons to identify the benefits of using the Hessian, inorder to study what would be an appropriate procedure regarding the accuracy and time.We study the convergence of the iterative minimization method, depending on differentaspects such as the geometry of the subsurface, the frequency, and the parametrization. Inparticular, we quantify the frequency progression, from the point of view of optimization,by showing how the size of the basin of attraction evolves with frequency.Following the convergence and stability analysis of the problem, the iterative minimiza-tion algorithm is conducted via a multi-level scheme where frequency and scale progresssimultaneously. We perform a collection of experiments, including acoustic and elasticmedia, in two and three dimensions. The perspectives of attenuation and anisotropic re-constructions are also introduced. Finally, we study the case of Cauchy data, motivated bythe dual sensors devices that are developed in the geophysical industry. We derive a novelcost function, which arises from the stability analysis of the problem. It allows elegantperspectives where no prior information on the acquisition set is required.","authors":["Florian Faucher"],"meta":["November 2017"],"references":[]}