{"id":"325666492_A_Security_Pattern_Classification_Based_on_Data_Integration","abstract":"Security patterns are design patterns specialised to provide reusable and general solutions to recurring security problems. These patterns, which capture the strengths of different security approaches, are intended to make the design of maintainable and secure applications easier. The pattern community is continuously providing new security patterns (180 patterns are available at the moment). For a given problem, this growing pattern set along with their abstract presentations make the security pattern choice tedious, even for experts in software design. We contribute in this issue by presenting a method of security pattern classification based upon data extraction and integration. The pattern classification is semi-automatically inferred by means of a data-store integrating disparate publicly available security data. This classification exposes relationships among software attacks, weaknesses, security principles and security patterns. It expresses the pattern combinations that can counter a given attack. Besides the pattern classification, we show that the data-store can be used to generate Attack Defense Trees. In our context, these illustrate, for a given attack, its sub-attacks and the related defenses given under the form of security pattern combinations. Such trees make the pattern classification more readable even for beginners in security patterns. Finally, we evaluate on 25 human subjects the benefits of using Attack Defense Trees and a classification established for Web applications, which covers 215 attacks, 136 software weaknesses, 66 security principles and 26 security patterns.","authors":["Sébastien Salva","Loukmen Regainia"],"meta":["June 2018","DOI:10.1007/978-3-319-93354-2_6","In book: Information Systems Security and Privacy (pp.105-129)"],"references":["314522351_A_Methodology_of_Security_Pattern_Classification_and_of_Attack-Defense_Tree_Generation","313419746_A_classification_methodology_for_security_patterns_to_help_fix_software_weaknesses","308828806_Do_Security_Patterns_Really_Help_Designers","268018467_Attack-defense_trees","261860296_ADTool_Security_Analysis_with_Attack-Defense_Trees","261338535_A_Comparative_Study_of_Software_Security_Pattern_Classifications","258762161_Organizing_Security_Patterns_Related_to_Security_and_Pattern_Recognition_Requirements","221240558_Classifying_Security_Patterns","221223658_Using_an_Ontology_to_Suggest_Software_Design_Patterns_Integration","220716343_A_Natural_Classification_Scheme_for_Software_Security_Patterns","2539506_Transparent_Fault_Tolerance_for_Web_Services_Based_Architectures","289901069_Vulnerability-Based_Security_Pattern_Categorization_in_Search_of_Missing_Patterns","259517240_An_Extensible_Pattern-based_Library_and_Taxonomy_of_Security_Threats_for_Distributed_Systems","246438387_Improving_Web_Application_Security_Threats_and_Countermeasures","242520787_Building_Secure_Software_How_to_Avoid_Security_Problems_the_Right_Way","221548985_Combining_Misuse_Cases_with_Attack_Trees_and_Security_Activity_Models","3437813_Web_application_security_engineering","2994185_The_Protection_of_Information_in_Computer_Systems"]}