{"id":"325639446_Retrieval_Practice_Bloom's_Taxonomy_Do_Students_Need_Fact_Knowledge_Before_Higher_Order_Learning","abstract":"The development of students’ higher order learning is a critical component of education. For decades, educators and scientists have engaged in an ongoing debate about whether higher order learning can only be enhanced by building a base of factual knowledge (analogous to Bloom’s taxonomy) or whether higher order learning can be enhanced directly by engaging in complex questioning and materials. The relationship between fact learning and higher order learning is often speculated, but empirically unknown. In this study, middle school students and college students engaged in retrieval practice with fact questions, higher order questions, or a mix of question types to examine the optimal type of retrieval practice for enhancing higher order learning. In laboratory and K-12 settings, retrieval practice consistently increased delayed test performance, compared with rereading or no quizzes. Critically, higher order and mixed quizzes improved higher order test performance, but fact quizzes did not. Contrary to popular intuition about higher order learning and Bloom’s taxonomy, building a foundation of knowledge via fact-based retrieval practice may be less potent than engaging in higher order retrieval practice, a key finding for future research and classroom application.","authors":["Pooja K. Agarwal"],"meta":["February 2019Journal of Educational Psychology 111(2):189-209","DOI:10.1037/edu0000282"],"references":["324995852_Transfer_of_Test-Enhanced_Learning_Meta-Analytic_Review_and_Synthesis","319470426_Developing_Analyzing_and_Using_Distractors_for_Multiple-Choice_Tests_in_Education_A_Comprehensive_Review","315706448_Rethinking_the_Use_of_Tests_A_Meta-Analysis_of_Practice_Testing","306271315_Benefits_from_retrieval_practice_are_greater_for_students_with_lower_working_memory_capacity","305433736_Memory_and_Meta-memory_Considerations_in_the_Training_of_Human_Beings","323424582_Statistical_power_analysis_for_the_behavioral_sciences","321988375_Retrieving_and_applying_knowledge_to_different_examples_promotes_transfer_of_learning","317599516_Hierarchical_Linear_Models_Applications_and_Data_Analysis_Methods","303874967_Analysing_tables_of_statistical_tests","297559034_Cognitive_load_theory"]}