{"id":"325644558_The_Modular_SSN_Ontology_A_Joint_W3C_and_OGC_Standard_Specifying_the_Semantics_of_Sensors_Observations_Sampling_and_Actuation","abstract":"The joint W3C (World Wide Web Consortium) and OGC (Open Geospatial Consortium) Spatial Data on the Web (SDW) Working Group developed a set of ontologies to describe sensors, actuators, samplers as well as their observations, actuation, and sampling activities. The ontologies have been published both as a W3C recommendation and as an OGC implementation standard. The set includes a lightweight core module called SOSA (Sensor, Observation, Sampler, and Actuator) available at: http://www.w3.org/ns/sosa/, and a more expressive extension module called SSN (Semantic Sensor Network) available at: http://www.w3.org/ns/ssn/. Together they describe systems of sensors and actuators, observations, the used procedures, the subjects and their properties being observed or acted upon, samples and the process of sampling, and so forth. The set of ontologies adopts a modular architecture with SOSA as a self-contained core that is extended by SSN and other modules to add expressivity and breadth. The SOSA/SSN ontologies are able to support a wide range of applications and use cases, including satellite imagery, large-scale scientific monitoring, industrial and household infrastructures, social sensing, citizen science, observation-driven ontology engineering, and the Internet of Things. In this paper we give an overview of the ontologies and discuss the rationale behind key design decisions, reporting on the differences between the new SSN ontology presented here and its predecessor [9] developed by the W3C Semantic Sensor Network Incubator group (the SSN-XG). We present usage examples and describe alignment modules that foster interoperability with other ontologies. A. Haller et al. / The Modular SSN Ontology: A Joint W3C and OGC Standard 1","authors":["Armin Haller","Krzysztof Janowicz","Simon Jonathan David Cox","Maxime Lefrançois"],"meta":["August 2018Semantic Web 10(3)","DOI:10.3233/SW-180320","Project: SMARTER: A Scalable and Elastic Platform for Near-Realtime Analytics on The Graph of Everything"],"references":["327857021_SOSA_A_Lightweight_Ontology_for_Sensors_Observations_Samples_and_Actuators","326335033_SOSA_A_lightweight_ontology_for_sensors_observations_samples_and_actuators","309813051_IoT-Lite_A_Lightweight_Semantic_Model_for_the_Internet_of_Things","307616021_The_ACORN-SAT_linked_climate_dataset","300338060_RDFox_A_Highly-Scalable_RDF_Store","319393290_The_WonderWeb_Library_of_Foundational_Ontologies","319221229_Integrated_Semantic_Fault_Analysis_and_Worker_Support_for_Cyber-Physical_Production_Systems","317177239_A_SPARQL_Extension_for_Generating_RDF_from_Heterogeneous_Formats","314249603_Linking_open_data_and_the_crowd_for_real-time_passenger_information","301246816_Inferray_fast_in-memory_RDF_inference"]}