{"id":"325685863_The_Role_of_Homograms_in_Machine_Translation","abstract":"The Croatian language is a pitch-accent language, in which the tone contour realized in the stressed syllable carries the lexical information. Therefore, in some cases, a different lexical accent gives the word a different meaning. In such cases, the ambiguity of the word in written texts, where accents are not usually marked, can be solved by determining the appropriate accent. There are also cases when various basic and derived forms of words have different meanings, different morphosyntactic descriptions (MSDs), and possibly different accents. When words have the same written forms but different meanings, they are called homograms. In order to resolve the ambiguity of homograms, we created a lexicon of homograms that is comprised of all Croatian nouns of different gender, which have the same written forms (if accents are not marked) but different meanings, MSDs, and possibly different accents. This lexicon consists of 19,366 entries and 3,460 unique homograms. Each entry in the lexicon comprises the homogram (unaccented word), the accented word, the corresponding MSD, and the accented lemma. The obtained lexicon enables us to identify and disambiguate homograms within the corpus efficiently and accurately. We also evaluated and analyzed the performance of machine translation (MT) systems for the Croatian-English language pair with a special emphasis on homogram translation. We confirmed that the disambiguation of homograms can improve the performance of MT systems in avoiding major translation mistakes related to assigning the wrong meaning to homograms. © 2018, International Association of Computer Science and Information Technology.","authors":["Lucia Nacinovic Prskalo","Marija Brkic Bakaric"],"meta":["April 2018","DOI:10.18178/ijmlc.2018.8.2.669"],"references":["319730654_Improving_Word_Sense_Disambiguation_in_Neural_Machine_Translation_with_Sense_Embeddings","307583770_Cro36WSD_A_Lexical_Sample_for_Croatian_Word_Sense_Disambiguation","307583768_Experiments_on_Active_Learning_for_Croatian_Word_Sense_Disambiguation","297764898_Word_sense_disambiguation_for_Arabic_text_categorization","242534195_The_MULTEXT-east_morphosyntactic_specifications_for_Slavic_languages","230635464_Were_the_clocks_striking_or_surprising_Using_WSD_to_improve_MT_performance","306094276_Linguistic_Input_Features_Improve_Neural_Machine_Translation","301408994_bshrsrWaC_-_Web_Corpora_of_Bosnian_Croatian_and_Serbian","276185940_The_SETimesHR_Linguistically_Annotated_Corpus_of_Croatian","259370517_Distinguishing_systems_and_distinguishing_senses_New_evaluation_methods_for_Word_Sense_Disambiguation"]}