{"id":"325652790_Adaptive_filter_design_via_a_gradient_thresholding_algorithm_for_compressive_spectral_imaging","abstract":"Sensing a spectral image data cube has traditionally been a time-consuming task since it requires a scanning process. In contrast, compressive spectral imaging (CSI) has attracted widespread interest since it requires fewer samples than scanning systems to acquire the data cube, thus improving the sensing speed. CSI captures linear projections of the scene, and then a reconstruction algorithm estimates the underlying scene. One notable CSI architecture is the color coded aperture snapshot spectral imager (C-CASSI), which employs pixelated filter arrays as the coding patterns to spatially and spectrally encode the incoming light. Up to date works on C-CASSI have used non-adaptive color coded apertures. Non-adaptive sampling ignores prior information about the signal to design the coding patterns. Therefore, this work proposes a method to adaptively design the color coded aperture, such that the quality of image reconstruction is improved. In more detail, this work introduces a gradient thresholding algorithm, which computes the consecutive color coded aperture from a rapidly reconstructed low-resolution version of the data cube. The successive adaptive patterns enable recovering a data cube in the presence of Gaussian noise with higher image quality. Real reconstructions and simulations evidence an improvement of up to 3 dB in the quality of image reconstruction of the proposed method in comparison with state-of-the-art non-adaptive techniques.","authors":["Nelson Diaz","Hoover Rueda","Henry Arguello"],"meta":["June 2018Applied Optics 57(17):4890","DOI:10.1364/AO.57.004890","Project: Adaptive compresive spectral imaging."],"references":["303393680_Compressive_spectral_imaging_using_multiple_snapshot_colored-mosaic_detector_measurements","286928170_High-dynamic_range_compressive_spectral_imaging_by_grayscale_coded_aperture_adaptive_filtering","285648332_Compressive_hyperspectral_imaging_via_adaptive_sampling_and_dictionary_learning","318793604_Coded_aperture_design_in_compressive_spectral_imaging_based_on_side_information","310823158_Spatiotemporal_blue_noise_coded_aperture_design_for_multi-shot_compressive_spectral_imaging","309881586_Filtered_gradient_reconstruction_algorithm_for_compressive_spectral_imaging","283029481_Hyperspectral_Imaging_for_Safety_and_Security","269289064_DMD-based_implementation_of_patterned_optical_filter_arrays_for_compressive_spectral_imaging","261045745_Compressive_Coded_Aperture_Spectral_Imaging_An_Introduction","260835645_Colored_Coded_Aperture_Design_by_Concentration_of_Measure_in_Compressive_Spectral_Imaging"]}