{"id":"325675956_Control_and_bribery_in_voting","abstract":"Introduction In this chapter we study control and bribery, two families of problems modeling various ways of manipulating elections. Briefly put, control problems model situations where some entity, usually referred to as the chair or the election organizer, has some ability to affect the election structure. For example, the chair might be able to encourage new candidates to join the election, or might be able to prevent some voters from casting their votes. On the other hand, bribery models situations where the structure of the election stays intact (we have the same candidates and the same voters), but some outside agent pays the voters to change their votes. Naturally, such manipulative actions, dishonestly skewing election results, are undesirable. Thus it is interesting to know if there are so-called complexity shields against these attacks (see also Chapter 6 on manipulation and, relatedly, Section 4.3.3 in the book chapter by Baumeister and Rothe (2015)). That is, it is interesting to know the computational complexity of recognizing whether various forms of such attacks are possible or not. However, there are also other interpretations of control and bribery, many of them quite positive. In this chapter we survey results on the complexity of control and bribery in elections, providing an overview of the specific problems studied, sketching sample proofs, and reviewing some approaches to dealing with the computational hardness of these control and bribery problems (see also Sections 4.3.4 and 4.3.5 in the book chapter by Baumeister and Rothe (2015)). Seeking ways of dealing with the computational hardness of control and bribery may seem surprising at first. However, on one hand, if we interpret control and bribery as modeling attacks on elections, then we would like to know the limitations of our complexity shields. On the other hand, if we take other interpretations of control and bribery, then we simply would like to know how to solve these problems. We survey some classical results on control in Section 7.3, on bribery in Section 7.4, and then briefly discuss their various applications in Section 7.5. Preliminaries We start by recalling various voting rules, including preference-based voting rules and (variants of) approval voting. For the former, an election (A, R) is given by a set A of m alternatives (or candidates) and a preference profile R = (≻1, …, ≻n) over A that collects n votes, each expressing a linear preference order over A. © Felix Brandt, Vincent Conitzer, Ulle Endriss, Jérôme Lang, Ariel D. Procaccia 2016.","authors":["P. Faliszewski","J. Rothe"],"meta":["January 2016","DOI:10.1017/CBO9781107446984.008"],"references":[]}