{"id":"325626988_Emerging_artificial_intelligence_methods_in_structural_engineering","abstract":"Artificial intelligence (AI) is proving to be an efficient alternative approach to classical modeling techniques. AI refers to the branch of computer science that develops machines and software with human-like intelligence. Compared to traditional methods, AI offers advantages to deal with problems associated with uncertainties and is an effective aid to solve such complex problems. In addition, AI-based solutions are good alternatives to determine engineering design parameters when testing is not possible, thus resulting in significant savings in terms of human time and effort spent in experiments. AI is also able to make the process of decision making faster, decrease error rates, and increase computational efficiency. Among the different AI techniques, machine learning (ML), pattern recognition (PR), and deep learning (DL) have recently acquired considerable attention and are establishing themselves as a new class of intelligent methods for use in structural engineering. The objective of this review paper is to summarize techniques concerning applications of the noted AI methods in structural engineering developed over the last decade. First, a general introduction to AI is presented and the importance of AI in structural engineering is described. Thereafter, a review of recent applications of ML, PR, and DL in the field is provided, and the capability of such methods to address the restrictions of conventional models are discussed. Further, the advantages of employing such algorithmic methods are discussed in detail. Finally, potential research avenues and emerging trends for employing ML, PR, and DL are presented, and their limitations are discussed.","authors":["Hadi Salehi","Rigoberto Burgueño"],"meta":["September 2018Engineering Structures 171:170-189","DOI:10.1016/j.engstruct.2018.05.084"],"references":["323859703_A_Review_of_Multi-Criteria_Assessment_of_the_Social_Sustainability_of_Infrastructures","322999295_Vision-Based_Fatigue_Crack_Detection_of_Steel_Structures_Using_Video_Feature_Tracking","350061913_Computational_Intelligence_Synergies_of_Fuzzy_Logic_Neural_Networks_and_Evolutionary_Computing","328250333_Machine_Learning_An_Algorithmic_Perspective","324045342_A_methodology_for_structural_health_diagnosis_and_assessment_using_machine_learning_with_noisy_and_incomplete_data_from_self-powered_wireless_sensors","322210276_Structural_damage_identification_using_image-based_pattern_recognition_on_event-based_binary_data_generated_from_self-powered_sensor_networks","322009333_Sustainable_Decision-Making_in_Civil_Engineering_Construction_and_Building_Technology","321596199_Machine_Learning_in_Computer_Vision","321434144_Statistical_pattern_recognition_approach_for_long-time_monitoring_of_the_GMeazza_stadium_by_means_of_AR_models_and_PCA","321154724_Structural_failure_classification_for_reinforced_concrete_buildings_using_trained_neural_network_based_multi-objective_genetic_algorithm"]}