{"id":"325602264_Aplikasi_Pemetaan_Kualitas_Pendidikan_di_Indonesia_Menggunakan_Metode_K-Means","abstract":"Aplikasi Pemetaan Kualitas Pendidikan Di Indonesia Menggunakan Metode K-Means adalah sebuah aplikasi yang dirancang untuk memudahkan pemetaan kualitas pendidikan di Indonesia. Aplikasi ini dapat membuat sebuah cluster dari kualitas pendidikan di Indonesia berdasarkan sejumlah parameter yaitu Angka Partisipasi Kasar, Angka Partisipasi Murni, Angka Putus Sekolah, Angka Kelulusan, Angka Melanjutkan, Jumlah Sekolah, Rasio Siswa/Sekolah, Rasio Siswa/Kelas, Rasio Kelas/Guru, Rasio Kelas/Sekolah, Rombongan Belajar/Ruang Kelas, dan Jarak Sekolah. Keluaran atau output dari sistem berupa peta yang mengelompokkan daerah-daerah sesuai dengan kualitas pendidikan yang dimilikinya. Analisis perancangan yang digunakan dalam pembuatan sistem ini menggunakan UML (Unified Modeling Language) dimana setiap aktivitas pada sistem akan dikelompokkan secara sendiri-sendiri di dalam sebuah use case diagram dan alur dari sistem digambarkan dalam bentuk flowchart. Perancangan sistem yang dilakukan antara lain perancangan basis data. Perancangan berdasarkan spesifikasi kebutuhan, dan perancangan antarmuka. Secara umum aplikasi ini dapat menghitung data parameter kualitas pendidikan dengan menggunakan metode K-Means Clustering, dan menampilkan hasilnya dalam bentuk peta, sehingga dinas pendidikan atau lembaga-lembaga yang menangani pendidikan di Indonesia dapat membandingkan kualitas pendidikan setiap provinsi di Indonesia Key word : Clustering, k-means, pemetaan","authors":["Gibran Satya Nugraha","Hairani Hairani"],"meta":["May 2018Matrik Jurnal Manajemen Teknik Informatika dan Rekayasa Komputer 17(2):13-23","DOI:10.30812/matrik.v17i2.84"],"references":["254468351_A_Simulation_Based_Comparative_Study_of_Normalization_Procedures_in_Multiattribute_Decision_Making","279896893_Impact_of_normalization_in_distributed_K-means_clustering","31746366_Data_Mining_Concepts_and_Techniques_2nd_edition","31723938_Decision_Support_Systems_and_Intelligent_Systems_E_Turban_JE_Aronson_colaboracion_de_N_Bolloju"]}