{"id":"325637324_High_capacity_transparent_and_secure_audio_steganography_model_based_on_fractal_coding_and_chaotic_map_in_temporal_domain","abstract":"Information hiding researchers have been exploring techniques to improve the security of transmitting sensitive data through an unsecured channel. This paper proposes an audio steganography model for secure audio transmission during communication based on fractal coding and a chaotic least significant bit or also known as HASFC. This model contributes to enhancing the hiding capacity and preserving the statistical transparency and security. The HASFC model manages to embed secret audio into a cover audio with the same size. In order to achieve this result, fractal coding is adopted which produces high compression ratio with the acceptable reconstructed signal. The chaotic map is used to randomly select the cover samples for embedding and its initial parameters are utilized as a secret key to enhancing the security of the proposed model. Unlike the existing audio steganography schemes, The HASFC model outperforms related studies by improving the hiding capacity up to 30% and maintaining the transparency of stego audio with average values of SNR at 70.4, PRD at 0.0002 and SDG at 4.7. Moreover, the model also shows resistance against brute-force attack and statistical analysis.","authors":["Ahmed Hussain Ali","Loay E. George","A. A. Zaidan","Mohd Rosmadi Mokhtar"],"meta":["December 2018Multimedia Tools and Applications 77(1)","DOI:10.1007/s11042-018-6213-0","Project: Image, Audio and Video Compression"],"references":["334207925_Recent_Approaches_for_VoIP_Steganography","334207842_Research_Article_A_Review_on_Audio_Steganography_Techniques","316271884_Enhancing_the_hiding_capacity_of_audio_steganography_based_on_block_mapping","315816089_Robust_image_hiding_in_audio_based_on_integer_wavelet_transform_and_Chaotic_maps_hopping","328018273_Speeding-up_Fractal_Color_Image_Compression_Using_Moments_Features_Based_on_Symmetry_Predictor","328017944_Speeding-up_Fractal_Colored_Image_Compression_Using_Moments_Features","319575784_Authenticity_verification_of_audio_signals_based_on_fragile_watermarking_for_audio_forensics","316600454_Introduction_to_Data_Compression","316588858_Introduction_to_Data_Compression","313784124_Highly_Transparent_and_Secure_Scheme_for_Concealing_Text_Within_Audio"]}