{"id":"325675371_Introduction_to_the_theory_of_fair_allocation","abstract":"Introduction The purpose of this chapter is to briefly introduce the theory of fair allocation in the context of concretely specified economic environments. There, requirements of fairness are expressed in terms of resources and opportunities understood in their physical sense. Thus, it contrasts with abstract social choice theory as this expression is commonly understood: in the canonical Arrovian model (Part I), the alternatives available to society are not structured in any particular way, whereas in models of resource allocation, the space of feasible alternatives is equipped with a variety of mathematical structures, topological, vectorial, and order structures. This enrichment has implications on several levels. First, when we specify the model itself, we can include properties of preferences reflecting these structures that would not be meaningful without them. Second, we can formulate properties of allocation rules referring to the structures. Finally, we can define allocation rules that are based on the structures. Abstract social choice theory and the theory of fair allocation have the same constructive objective, however, namely, to identify the “best” way of reconciling the conflicting interests of the participants. In each case, we can distinguish two branches of the literature. The normative branch focuses on the distribution of welfare throughout the population. It starts with the formulation of criteria of fairness, and it studies their implications. The strategic branch is concerned with the fact that agents have some control over resources, technologies, and the information about the outside world or their own preferences, and that they may try to take advantage of this control. Ideally, the allocation process should be safe from manipulation of resources or technologies, by individual or by groups, and from misrepresentation of their knowledge of the environment or of their preferences. We focus on the normative branch here but there is not a complete conceptual separation between normative and strategic considerations; some properties of rules can be interpreted from either viewpoint; also, from a technical perspective, the two branches are linked in multiple ways. The primary aim of abstract social choice theory is to define social orderings over the set of alternatives, whereas most of the theory we review here deals with how to choose, for each economy, one (or several) allocation(s) from a set. © Felix Brandt, Vincent Conitzer, Ulle Endriss, Jérôme Lang, Ariel D. Procaccia 2016.","authors":["William Thomson"],"meta":["January 2016","DOI:10.1017/CBO9781107446984.012"],"references":[]}