{"id":"325704794_Detecting_opinion_spams_through_supervised_boosting_approach","abstract":"Product reviews are the individual’s opinions, judgement or belief about a certain product or service provided by certain companies. Such reviews serve as guides for these companies to plan and monitor their business ventures in terms of increasing productivity or enhancing their product/service qualities. Product reviews can also increase business profits by convincing future customers about the products which they have interest in. In the mobile application marketplace such as Google Playstore, reviews and star ratings are used as indicators of the application quality. However, among all these reviews, hereby also known as opinions, spams also exist, to disrupt the online business balance. Previous studies used the time series and neural network approach (which require a lot of computational power) to detect these opinion spams. However, the detection performance can be restricted in terms of accuracy because the approach focusses on basic, discrete and document level features only thereby, projecting little statistical relationships. Aiming to improve the detection of opinion spams in mobile application marketplace, this study proposes using statistical based features that are modelled through the supervised boosting approach such as the Extreme Gradient Boost (XGBoost) and the Generalized Boosted Regression Model (GBM) to evaluate two multilingual datasets (i.e. English and Malay language). From the evaluation done, it was found that the XGBoost is most suitable for detecting opinion spams in the English dataset while the GBM Gaussian is most suitable for the Malay dataset. The comparative analysis also indicates that the implementation of the proposed statistical based features had achieved a detection accuracy rate of 87.43 per cent on the English dataset and 86.13 per cent on the Malay dataset.","authors":["Hazim Hanif","Nor Badrul Anuar","Mohd Faizal","Nor Aniza Abdullah"],"meta":["June 2018PLoS ONE 13(6):e0198884","DOI:10.1371/journal.pone.0198884"],"references":["318081655_Fusing_and_mining_opinions_for_reputation_generation","315409295_Bio-inspired_computational_paradigm_for_feature_investigation_and_malware_detection_interactive_analytics","318549485_Opinion_mining_using_ensemble_text_hidden_Markov_models_for_text_classification","316781685_Multi-site_solar_power_forecasting_using_gradient_boosted_regression_trees","314200871_Document_Representation_and_Feature_Combination_for_Deceptive_Spam_Review_Detection","313811372_Patterns_of_waste_generation_A_gradient_boosting_model_for_short-term_waste_prediction_in_New_York_City","313387287_Relationship_between_customer_sentiment_and_online_customer_ratings_for_hotels_-_An_empirical_analysis","312097498_Neural_networks_for_deceptive_opinion_spam_detection_An_empirical_study","310824798_XGBoost_A_Scalable_Tree_Boosting_System","310813825_Fusing_and_Mining_Opinions_for_Reputation_Generation","306959512_DyHAP_Dynamic_Hybrid_ANFIS-PSO_approach_for_predicting_mobile_malware","307557341_The_rise_of_malware_Bibliometric_analysis_of_malware_study","304456133_A_Topic-Enhanced_Word_Embedding_for_Twitter_Sentiment_Classification","303915585_Neural_networks_An_overview_of_early_research_current_frameworks_and_new_challenges","303274917_Spotting_fake_reviews_via_collective_positive-unlabeled_learning"]}