{"id":"325731308_Towards_saving_money_in_using_smart_contracts","abstract":"Being a new kind of software leveraging blockchain to execute real contracts, smart contracts are in great demand due to many advantages. Ethereum is the largest blockchain platform that supports smart contracts by running them in its virtual machine. To ensure that a smart contract will terminate eventually and prevent abuse of resources, Ethereum charges the developers for deploying smart contracts and the users for executing smart contracts. Although our previous work shows that under-optimized smart contracts may cost more money than necessary, it just lists 7 anti-patterns and the detection method for 3 of them. In this paper, we conduct the first in-depth investigation on such under-optimized smart contracts. We first identify 24 anti-patterns from the execution traces of real smart contracts. Then, we design and develop GasReducer, the first tool to automatically detect all these anti-patterns from the bytecode of smart contracts and replace them with efficient code through bytecode-to-bytecode optimization. Using GasReducer to analyze all smart contracts and their execution traces, we detect 9,490,768 and 557,565,754 anti-pattern instances in deploying and invoking smart contracts, respectively.","authors":["Ting Chen","Zihao Li","Hao Zhou","Jiachi Chen"],"meta":["May 2018","DOI:10.1145/3183399.3183420","Conference: New Ideas and Emerging Results Track at the 40th International Conference on Software Engineering (NIER-ICSE)","Project: Blockchain System"],"references":["321902145_An_Adaptive_Gas_Cost_Mechanism_for_Ethereum_to_Defend_Against_Under-Priced_DoS_Attacks","314157173_Under-Optimized_Smart_Contracts_Devour_Your_Money","311476490_Automatic_generation_of_peephole_superoptimizers","309448109_Formal_Verification_of_Smart_Contracts_Short_Paper","309444724_Making_Smart_Contracts_Smarter","220938997_Automatic_generation_of_peephole_superoptimizers","220851805_Binary_Translation_Using_Peephole_Superoptimizers"]}