{"id":"325700913_RDF-F_RDF_Datatype_inFerring_Framework_Towards_Better_RDF_Document_Matching","abstract":"In the context of RDF document matching/integration, the datatype information, which is related to literal objects, is an important aspect to be analyzed in order to better determine similar RDF documents. In this paper, we present an RDF Datatype in Ferring Framework, called RDF-F, which provides two independent datatype inference processes: 1) a four-step process consisting of (i) a predicate information analysis (i.e., deduce the datatype from existing range property), (ii) an analysis of the object value itself by a pattern-matching process (i.e., recognize the object lexical space), (iii) a semantic analysis of the predicate name and its context, and (iv) generalization of Numeric and Binary datatypes to ensure the integration; and 2) a non-ambiguous lexical-space-matching process, where literal values are inferred by the modification of their representation, following new lexical spaces. We evaluated the performance and the accuracy of both processes with datasets from DBpedia. Results show that the execution time of both indicators is linear and their accuracy can increase up to 97.10 and 99.30%, respectively.","authors":["Irvin Dongo","Yudith Cardinale","Richard Chbeir"],"meta":["June 2018Data Science and Engineering 3(2)","DOI:10.1007/s41019-018-0064-6"],"references":["320184192_Semantic_Web_Datatype_Inference_Towards_Better_RDF_Matching","318802029_Semantic_Web_Datatype_Similarity_Towards_Better_RDF_Document_Matching","298330771_Discovering_Types_in_RDF_Datasets","297470187_Gleaning_Types_for_Literals_in_RDF_Triples_with_Application_to_Entity_Summarization","314720323_Schema_extraction_from_XML_collections","311612719_Overview_of_YAM-not_Yet_Another_Matcher_for_ontology_alignment_task-","301869762_Practical_Datatype_Specializations_with_Phantom_Types_and_Recursion_Schemes","300142744_Toward_RDF_Normalization","283914597_Current_State_of_Ontology_Matching_A_Survey_of_Ontology_and_Schema_Matching","282562830_Combinators_and_type-driven_transformers_in_Objective_Caml"]}