{"id":"325752981_Near-Optimal_Machine_Teaching_via_Explanatory_Teaching_Sets","abstract":"Modern applications of machine teaching for humans often involve domain-specific, non- trivial target hypothesis classes. To facilitate understanding of the target hypothesis, it is crucial for the teaching algorithm to use examples which are interpretable to the human learner. In this paper, we propose NOTES, a principled framework for constructing interpretable teaching sets, utilizing explanations to accelerate the teaching process. Our algorithm is built upon a natural stochastic model of learners and a novel submodular surrogate objective function which greedily selects interpretable teaching examples. We prove that NOTES is competitive with the optimal explanation-based teaching strategy. We further instantiate NOTES with a specific hypothesis class, which can be viewed as an interpretable approximation of any hypothesis class, allowing us to handle complex hypothesis in practice. We demonstrate the effectiveness of NOTES on several image classification tasks, for both simulated and real human learners. Our experimental results suggest that by leveraging explanations, one can significantly speed up teaching.","authors":["Chen Yuxin","Oisin Mac Aodha","Shihan Su","Pietro Perona"],"meta":["April 2018","Conference: Twenty-First International Conference on Artificial Intelligence and StatisticsVolume: 84"],"references":["323302327_Teaching_Categories_to_Human_Learners_with_Visual_Explanations","313516177_Adaptive_optimal_training_of_animal_behavior","289686421_Using_Highlighting_to_Train_Attentional_Expertise","283273878_Tractable_Bayesian_teaching","317240886_Iterative_Machine_Teaching","316077530_Approximately_Optimal_Teaching_of_Approximately_Optimal_Learners","305998718_Interpretable_Decision_Sets_A_Joint_Framework_for_Description_and_Prediction","305342147_Why_Should_I_Trust_You_Explaining_the_Predictions_of_Any_Classifier","287092353_Teaching_classification_boundaries_to_humans","283478271_Interpretable_classifiers_using_rules_and_Bayesian_analysis_Building_a_better_stroke_prediction_model"]}