{"id":"325794611_A_Model_of_Spatial_Directness_in_Interaction_for_Visualization","abstract":"We discuss the concept of directness in the context of spatial interaction with visualization. In particular, we propose a model that allows practitioners to analyze and describe the spatial directness of interaction techniques, ultimately to be able to better understand interaction issues that may affect usability. To reach these goals, we distinguish between different types of directness. Each type of directness depends on a particular mapping between different spaces, for which we consider the data space, the visualization space, the output space, the user space, the manipulation space, and the interaction space. In addition to the introduction of the model itself, we also show how to apply it to several real-world interaction scenarios in visualization, and thus discuss the resulting types of spatial directness, without recommending either more direct or more indirect interaction techniques. In particular, we will demonstrate descriptive and evaluative usage of the proposed model, and also briefly discuss its generative usage.","authors":["Stefan Bruckner","Tobias Isenberg","Timo Ropinski","Alexander Wiebel"],"meta":["June 2018IEEE Transactions on Visualization and Computer Graphics PP(99)","DOI:10.1109/TVCG.2018.2848906"],"references":["313205744_A_Design_Space_for_Spatio-Data_Coordination_Tangible_Interaction_Devices_for_Immersive_Information_Visualisation","312575924_Tools_Techniques_for_Direct_Volume_Interaction","306051856_Hybrid_TactileTangible_Interaction_for_3D_Data_Exploration","339303893_A_head-mounted_three_dimensional_display","320313193_Investigating_the_Use_of_Spatial_Interaction_for_3D_Data_Visualization_on_Mobile_Devices","319121765_Direct-Manipulation_Visualization_of_Deep_Networks","312185079_Interactive_Exploration_of_Three-Dimensional_Scientific_Visualizations_on_Large_Display_Surfaces","311309327_Interactive_Visualization_of_3D_Scanned_Mummies_at_Public_Venues","301463894_Top_computational_visualization_RD_problems_2015_panel","300409178_Inviwo_-_An_extensible_multi-purpose_visualization_framework"]}