{"id":"325707523_When_deictic_gestures_in_a_robot_can_harm_child-robot_collaboration","abstract":"This paper describes research aimed at supporting children's reading practices using a robot designed to interact with children as their reading companion. We use a learning by teaching scenario in which the robot has a similar or lower reading level compared to children, and needs help and extra practice to develop its reading skills. The interaction is structured with robot reading to the child and sometimes making mistakes as the robot is considered to be in the learning phase. Child corrects the robot by giving it instant feedbacks. To understand what kind of behavior can be more constructive to the interaction especially in helping the child, we evaluated the effect of a deictic gesture, namely pointing on the child's ability to find reading mistakes made by the robot. We designed three types of mistakes corresponding to different levels of reading mastery. We tested our system in a within-subject experiment with 16 children. We split children into a high and low reading proficiency even-though they were all beginners. For the high reading proficiency group, we observed that pointing gestures were beneficial for recognizing some types of mistakes that the robot made. For the earlier stage group of readers pointing were helping to find mistakes that were raised upon a mismatch between text and illustrations. However, surprisingly, for this same group of children, the deictic gestures were disturbing in recognizing mismatches between text and meaning.","authors":["Elmira Yadollahi","Wafa Johal","Ana Paiva","Pierre Dillenbourg"],"meta":["June 2018","DOI:10.1145/3202185.3202743","Conference: the 17th ACM Conference","Project: CoReader"],"references":["316653734_Someone_to_Read_with_Design_of_and_Experiences_with_an_In-Home_Learning_Companion_Robot_for_Reading","305727026_Design_Rationale_Opportunities_and_Recommendations_for_Tangible_Reading_Systems_for_Children","301324078_Learning_by_Teaching_a_Robot_The_Case_of_Handwriting","321606572_Learning_Strategies_and_Learning_Styles","318305370_Audio-visual_synchronization_in_reading_while_listening_to_texts_Effects_on_visual_behavior_and_verbal_learning","305726774_Evaluating_Engagement_in_Reading_Comparing_Children_and_Adult_Assessors","301690409_Joint_attention_as_social_cognition","292795445_Teaching_reading_with_talking_books","287409811_Dyslexia_A_Practitioner's_Handbook_Fourth_Edition","286746222_Storytelling_with_robots_Learning_companions_for_preschool_children's_language_development"]}