{"id":"325713189_Relacoes_disciplinares_entre_a_ciencia_da_informacao_e_a_triade_biblioteconomia_arquivistica_e_documentacao_1960-2000_subsidios_para_uma_reflexao_sobre_a_area","abstract":"RESUMO Partindo da perspectiva epistemológica de Morin (2007) relativamente ao conceito de disciplina enquanto categoria autônoma de um corpo científico, abordam-se as relações disciplinares entre ciência da informação (CI) e biblioteconomia, arquivística e documentação. A relação imbricada entre estas disciplinas concorre para que suas fronteiras aparentemente se diluam, em particular, no caso da CI, que aliada às fortes ligações com outras áreas científicas dificultam a sua definição epistemológica e de intervenção, colocando em xeque a sua disciplinaridade. Propõe-se contribuir para o esclarecimento das referidas relações disciplinares, procurando-se identificar e analisar as relações entre a CI e as outras disciplinas consideradas e refletir sobre a sua evolução. Partiu-se de abordagem qualitativa de natureza exploratória, baseada em revisão da literatura, privilegiando-se obras sobre a gênese e epistemologia da CI (artigos científicos escritos entre 1968 e 2003). Conclui-se que as relações disciplinares da CI com as outras disciplinas encontram-se em contínua evolução desde a sua gênese, apresentando matizes díspares entre cada uma delas. Nas obras analisadas, a documentação manifestou presença diretamente relacionada com a gênese da CI; a biblioteconomia partilhou essa ligação à sua gênese, mas paralelamente, em vários cenários, manteve-se autônoma; a arquivística apresentou relação distante relativamente à CI, mais em contexto de prática profissional que epistemológico. Ao longo do período estudado, a CI estabeleceu relações privilegiadas com outras áreas do saber, entre as quais: a informática/ciência da computação, psicologia, comunicação, linguística e matemática, o que demonstra sua dinâmica e ajuste ao desenvolvimento sociocultural e tecnológico. Palavras-chave: Ciência da informação. Biblioteconomia. Arquivística. Documentação. Relações disciplinares.","authors":["Luis Machado","Maria da Graça Simões","Renato Rocha Souza"],"meta":["May 2018Ciência da Informação 46(2)","Project: Web Semântica no output dos PPG de Ciência da Informação"],"references":["314915819_Um_olhar_sobre_a_origem_da_ciencia_da_informacao_indicios_embrionarios_para_sua_caracterizacao_identitaria","280598402_A_Ciencia_da_Informacao_criadora_de_conhecimento_actas","256441144_Revisiting_Ontologies_A_Necessary_Clarification","220434422_Conceptions_of_information_science","292273357_The_phenomena_of_interest_to_information_science","292067486_Conferencias_do_Georgia_Institute_of_Technology_e_a_ciencia_da_informacao_de_volta_para_o_futuro","288927624_History_and_foundations_of_information_science","278405327_Manual_de_investigacao_em_ciencias_sociais_trajectos","242365079_The_foundations_of_information_science_Part_I_Philosophical_aspects","229797155_Information_Science_What_Is_It","26350008_A_ciencia_da_informacao_como_ciencia_social","26349778_Construcao_de_conceitos_no_campo_da_ciencia_da_informacao"]}