{"id":"325737624_The_important_of_service_quality_and_the_trust_in_technology_on_users_perspectives_to_continues_use_of_mobile_services","abstract":"Delivering government services through the mobile applications is popular in developed countries, which benefit the citizens and governments. However, the user’s acceptance of services via mobile applications still challenging for the government. The purpose of this research is to investigate the factors that influence citizens acceptance of mobile government services, based on the relative variables to help government to maintain the services and fulfill the citizen’s needs. A sample of 536 participants has shared their thought and participate in the online survey. Structural equation modeling (AMOS) implemented is conducted to validate the research model and test the research hypotheses. This research provides evidences to show that mobile governments can facilitate and assist citizens to access government services. In general, user acceptance can be viewed as the intention of user to use a new technology, together with an understanding of how to find it and how to use it. Citizens acceptance should be investigated based on major factors such as self-efficacy, trust in technology and service quality. The results of this research contribute to the user acceptance theory and to the marketing of mobile services by providing a clear picture and more understanding of the user perspective of using mobile services.","authors":["Ibrahim Almarashdeh"],"meta":["May 2018Journal of Theoretical and Applied Information Technology 96(10):2954-2972"],"references":["316247677_How_To_Make_Them_Use_It_Citizens_Acceptance_Of_M-government","311531442_Investigating_the_acceptance_of_technology_in_distance_learning_program","306259945_A_COMPREHENSIVE_ADOPTION_MODEL_OF_M-_GOVERNMENT_SERVICES_AMONG_CITIZENS_IN_DEVELOPING_COUNTRIES_1_MST_REBEKA_SULTANA","320027448_Enhancing_ICT_Infrastructure_in_Public_Services_Factors_Influencing_Mobile_Government_M-Government_Adoption_in_India","317156514_The_adoption_of_M-government_services_from_the_user's_perspectives_Empirical_evidence_from_the_United_Arab_Emirates","313104261_User_acceptance_of_mobile_services","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","310055535_Confirmatory_factor_analysis","303919811_Alternative_ways_of_assessing_model_fit","303508682_Sharing_instructors_experience_of_learning_management_system_A_technology_perspective_of_user_satisfaction_in_distance_learning_course"]}