{"id":"325728483_Assessing_software_development_skills_among_K-6_learners_in_a_project-based_workshop_with_scratch","abstract":"Recent literature reports a fair amount of initiatives on how to engage younger populations in achieving computational literacy. However, there is considerable less research on how to effectively deliver software development skills in a way that can be accepted and ultimately adopted by this user group. As a way to bridge this gap, we ran an extracurricular project-based workshop, targeting 10-12 years old learners with no prior coding experience, delivered over five days in the computer labs at the University of Chile. In this workshop, participants follow hands-on activities where they acquire the basics of computer programming and develop a small-scale software application using Scratch. These activities showcase that good software engineering practices can be taught to K-6 students, where these students are guided by experienced computer science undergraduate and graduate students. This paper presents a descriptive case study that focuses on assessing how K-6 learners assimilate and use these practices when developing their first computing application in a non-traditional learning experience. In order to do this, we designed and calibrated a rubric to evaluate the software products generated by the workshop participants. Our findings provide further evidence that it is indeed possible to teach initial notions of software engineering to this user group, structuring these constructs in a non-technical language that can be assimilated by novice developers. Furthermore, we did not observe significant differences in this matter according to gender and socio-economic status.","authors":["Francisco J. Gutierrez","Jocelyn Simmonds","Nancy Hitschfeld","Cecilia Casanova"],"meta":["May 2018","DOI:10.1145/3183377.3183396","Conference: the 40th International Conference"],"references":["323328918_Coding_or_Hacking_Exploring_Inaccurate_Views_on_Computing_and_Computer_Scientists_among_K-6_Learners_in_Chile","316991044_The_Impact_of_Gender_Stereotypes_on_the_Self-Concept_of_Female_Students_in_STEM_Subjects_with_an_Under-Representation_of_Females","316613934_On_the_Automatic_Assessment_of_Computational_Thinking_Skills_A_Comparison_with_Human_Experts","315469267_Software_clones_in_scratch_projects_on_the_presence_of_copy-and-paste_in_computational_thinking_learning","307089174_How_Kids_Code_and_How_We_Know_An_Exploratory_Study_on_the_Scratch_Repository","318126978_Teaching_Software_Engineering_Principles_to_K-12_Students_A_MOOC_on_Scratch","311489317_How_Early_Does_the_CS_Gender_Gap_Emerge_A_Study_of_Collaborative_Problem_Solving_in_5th_Grade_Computer_Science","311316007_Code_Yourself_and_A_Programar_A_bilingual_MOOC_for_teaching_computer_science_to_teenagers","305628802_From_computational_thinking_to_computational_participation_in_K--12_education","305026995_Do_code_smells_hamper_novice_programming_A_controlled_experiment_on_Scratch_programs"]}