{"id":"325736178_A_comprehensive_survey_on_Content_Based_Image_Retrieval_system_and_its_application_in_medical_domain","abstract":"Content Based Image Retrieval (CBIR) is an important and widely used technique for retrieval of different kinds of images from large database. Collection of information in database are available in different formats such as text, image, graph, chart etc. Here, our focus is on information which is available in the form of images. Searching and retrieval of the image from a large amount of database is difficult problem because it uses the image visual information such as shape, text and color for indexing and representation of an image. For efficient CBIR system, there is a need to develop different kinds of retrieval methods using feature extraction, similarity matching etc. Text Based Image Retrieval systems are used in many hospitals, but for large databases these are inefficient. To solve this problem, CBIR systems are proposed to retrieve matching images from database using automated feature extraction method. At present, medical imaging field finds extensive growth in the generation and evaluation of various types of medical images which are high inconsistency, usually fused and the combination of various minor composition structures. For easy retrieval, need to be development of feature extraction and image classification methods. Different methods are used for different kinds of medical images. The Radiology department and Cardiology department are the largest producers of medical images and the patient abnormal images can be stored with the normal images. CBIR uses query image as input and it retrieves the images, which are similar to the query more efficiently and effectively. This paper provides a comprehensive Survey about CBIR system and its one of the major application in medical domain.","authors":["K. Srinivasa Reddy","R. Anandan","Kalaivani K","P. Swaminathan"],"meta":["May 2018International Journal of Engineering & Technology 7(2):181-185","DOI:10.14419/ijet.v7i2.31.13436"],"references":["318701076_Applying_Content-Based_Image_Retrieval_Techniques_to_Provide_New_Services_for_Tourism_Industry","301793985_Content-Based_Image_Retrieval_for_Medical_Applications_with_Flip-Invariant_Consideration_Using_Low-Level_Image_Descriptors","275208626_A_Study_on_Content_Based_Image_Retrieval_Systems","267726611_Content_Based_Image_Retrieval_System_for_Medical_Databases_CBIR-MD_-Lucratively_tested_on_Endoscopy_Dental_and_Skull_Images","266169223_Different_Approaches_of_CBIR_Techniques","255563600_System_Refinement_for_Content_Based_Satellite_Image_Retrieval","8664797_A_Review_of_Content-Based_Image_Retrieval_Systems_in_Medical_Applications_-_Clinical_Benefits_and_Future_Directions","314298499_Review_on_Content_Based_Image_Retrieval_CBIR_Technique","306095811_A_Comprehensive_Survey_of_Content_Based_Image_Retrieval_Techniques","288262413_Content_based_image_retrieval_in_medical_imaging","273278248_SURVEY_ON_CONTENT_BASED_IMAGE_RETRIEVAL_TECHNIQUES","224200496_3D_Neurological_Image_Retrieval_with_Localized_Pathology-Centric_CMRGlc_Patterns","220162278_Content-Based_Image_Retrieval_Theory_and_Applications"]}