{"id":"325798008_Avaliando_os_Cursos_de_Licenciatura_a_Distancia_da_UFMS_o_que_Dizem_os_Egressos","abstract":"O presente artigo apresenta as percepções dos egressos dos cursos de licenciaturas em Ciências Biológicas, Letras, Matemática e Pedagogia na modalidade a distância da UFMS formados em 2012, 2013 e 2014. O questionário on-line, composto por 46 questões distribuídas em cinco blocos, foi divulgado no grupo dos egressos em redes sociais, enviado para o e-mail pessoal dos ex-alunos e encaminhado também via Moodle. Neste estudo, consideraremos as respostas referentes às dez questões do grupo 4 - Avaliação do curso na modalidade a distância. Os resultados evidenciam que grande parte dos informantes aprova a atuação dos professores, dos tutores presenciais e a distância, avalia positivamente as aulas presenciais, os materiais didáticos, as disciplinas ofertadas, as atividades avaliativas e o uso do Moodle como ambiente virtual de aprendizagem. Apenas o item relacionado às webaulas não foi tão bem avaliado. A baixa qualidade da internet em algumas cidades e os problemas de conexão dificultam a transmissão de aulas com qualidade. Contudo, mesmo diante dessas e outras dificuldades, é preciso ressaltar o importante papel que a educação a distância vem cumprindo nos municípios do interior do estado, possibilitando a atuação de novos profissionais nas escolas, com formação específica e bastante satisfatória, na percepção dos egressos.Palavras-chave: Educação a Distância, Formação de professores, Egressos. Evaluating Distance-Learning Teacher Training Courses at UFMS: What Graduates Have to SayAbstractThis article aims to present how graduates from distance-learning teachertraining courses in Biology, Language Studies, Mathematics and Pedagogy from UFMS perceive their college education. We asked the graduates from the classes of 2012, 2013 and 2014 to answer a 5-part 46-question on-line survey through their social media, e-mail or Moodle. In this study, we considered only the responses for the 10 questions from part four of the survey, called \"Evaluating the Distance Learning Course\". The results show that a large group of the informants approve of teacher and tutor performance and evaluate positively the on-site classes, the learning material, the subjects offered, the assessment testing and Moodle as a learning management system. The informants did not evaluate so well the classes through videoconference technology, which can be explained by the low quality internet connection in some cities and other technical problems that may have troubled the classes. Nevertheless, despite these and other problems in the courses, we need to emphasize the important role distance learning education has played in taking higher education to countryside cities and making it possible to have qualified professionals working in their schools, with specific and satisfactory academic training, according to the own graduates.Keywords: Distance learning education, Teacher training, Graduates.","authors":["Patrícia Rocha","Daniela Sayuri Kawamoto Kanashiro","Mirian Lange Noal"],"meta":["April 2018","DOI:10.18264/eadf.v8i1.638"],"references":["250987980_A_inclusao_social_e_digital_de_pessoas_com_limitacao_visual_e_o_uso_das_tecnologias_de_informacao_e_de_comunicacao_na_producao_de_paginas_para_a_Internet","321808322_Educacao_a_Distancia_desafios_contemporaneos"]}