{"id":"325729957_Artificial_intelligence_in_radiation_oncology_A_specialty-wide_disruptive_transformation","abstract":"Artificial intelligence (AI) is emerging as a technology with the power to transform established industries, and with applications from automated manufacturing to advertising and facial recognition to fully autonomous transportation. Advances in each of these domains have led some to call AI the \"fourth\" industrial revolution [1]. In healthcare, AI is emerging as both a productive and disruptive force across many disciplines. This is perhaps most evident in Diagnostic Radiology and Pathology, specialties largely built around the processing and complex interpretation of medical images, where the role of AI is increasingly seen as both a boon and a threat. In Radiation Oncology as well, AI seems poised to reshape the specialty in significant ways, though the impact of AI has been relatively limited at present, and may rightly seem more distant to many, given the predominantly interpersonal and complex interventional nature of the specialty. In this overview, we will explore the current state and anticipated future impact of AI on Radiation Oncology, in detail, focusing on key topics from multiple stakeholder perspectives, as well as the role our specialty may play in helping to shape the future of AI within the larger spectrum of medicine.","authors":["Reid F Thompson","Gilmer Valdes","Clifton D Fuller","Colin M. Carpenter"],"meta":["June 2018Radiotherapy and Oncology 129(3)","DOI:10.1016/j.radonc.2018.05.030"],"references":["322527074_Artificial_intelligence_will_reduce_the_need_for_clinical_medical_physicists","321494085_Data_Sharing_Convert_Challenges_into_Opportunities","319159072_IMRT_QA_using_machine_learning_A_multi-institutional_validation","319141808_Data_sharing_Guard_the_privacy_of_donors","317133196_Infrastructure_and_distributed_learning_methodology_for_privacy-preserving_multi-centric_rapid_learning_health_care_euroCAT","41655013_Datamining_approaches_for_modeling_tumor_control_probability","321435190_Radiation_Oncology_Needs_to_Adopt_a_Comprehensive_Standard_for_Data_Transfer_The_Case_for_HL7_FHIR","313971257_Regulatory_watch_From_big_data_to_smart_data_FDA's_INFORMED_initiative","235414303_Using_overlap_volume_histogram_and_IMRT_plan_data_to_guide_and_automate_VMAT_planning_A_head-and-neck_case_study"]}