{"id":"325795691_Reliability_based_optimization_of_a_hat_stiffened_panel","abstract":"This article is the first of its kind that treats hat stiffened panel in reliability based optimization (RBO). This panel is used in aerospace and marine structure. Along RBO, a deterministic optimization of this panel is performed. These optimization methods are based on a polynomial metamodel. Panel optimization aims to maximize its rigidity and minimize its weight. The variables vector contains the panel geometric dimensions. Uniform distributions are associated to geometric variables and materials densities of the panel. The results of these two optimization types are compared to show the influence of inputs uncertainties on the optimum design. RBO is performed using two methods; The first being a combination of Monte-Carlo simulation to propagate uncertainty and NSGA2 to find optimum points. The second uses analytic calculation to propagate uncertainty and bi-objective Normal boundary intersection to find the Pareto front. The latter outperforms the first and produces an exact Pareto front with a better execution\ntime.","authors":["Oussama Braydi","Rafic Younes","Pascal Lafon","Ahmad El-Samrout"],"meta":["November 2017","Conference: 23ème Congrès Français de MécaniqueAt: Lille - France","Project: Global framework of optimization in probabilistic context for mechanical engineering"],"references":["257334864_A_modified_NBI_and_NC_method_for_the_solution_of_N-multiobjective_optimization_problems","225167636_Chateauneuf_A_Benchmark_study_of_numerical_methods_for_reliability-based_design_optimization_Structural_and_Multidisciplinary_Optimization_41_277-294","239535128_Using_Common_Random_Numbers_and_Control_Variates_in_Multiple-Comparison_Procedures","225820579_Adaptive_weighted_sum_method_for_multiobjective_optimization_A_new_method_for_Pareto_front_generation","222702934_Robust_optimization_-_A_comprehensive_survey","3418687_A_fast_and_elitist_multiobjective_genetic_algorithm_NSGA-II"]}