{"id":"325755028_Visual_cross-platform_analysis_digital_methods_to_research_social_media_images","abstract":"Analysis of social media using digital methods is a flourishing approach. However, the relatively easy availability of data collected via platform application programming interfaces has arguably led to the predominance of single-platform research of social media. Such research has also privileged the role of text in social media analysis, as a form of data that is more readily gathered and searchable than images. In this paper, we challenge both of these prevailing forms of social media research by outlining a methodology for visual cross-platform analysis (VCPA), defined as the study of still and moving images across two or more social media platforms. Our argument contains three steps. First, we argue that cross-platform analysis addresses a gap in research methods in that it acknowledges the interplay between a social phenomenon under investigation and the medium within which it is being researched, thus illuminating the different affordances and cultures of web platforms. Second, we build on the literature on multimodal communication and platform vernacular to provide a rationale for incorporating the visual into cross-platform analysis. Third, we reflect on an experimental cross-platform analysis of images within social media posts (n = 471,033) used to communicate climate change to advance different modes of macro- and meso-levels of analysis that are natively visual: image-text networks, image plots and composite images. We conclude by assessing the research pathways opened up by VCPA, delineating potential contributions to empirical research and theory and the potential impact on practitioners of social media communication.","authors":["Warren Pearce","Suay Ozkula","Amanda K. Greene","Lauren Teeling"],"meta":["June 2018Information Communication and Society 23(5)","DOI:10.1080/1369118X.2018.1486871"],"references":["328217698_5_Foundations_of_Digital_Methods_Query_Design_Studying_Culture_through_Data","314100273_Digital_Methods_for_Cross-platform_Analysis","301644273_Instagrammatics_and_digital_methods_Studying_visual_social_media_from_selfies_and_GIFs_to_memes_and_emoji","300086040_Lesbian_Gay_Bisexual_Trans_and_Queer_Visibility_Through_Selfies_Comparing_Platform_Mediators_Across_Ruby_Roses_Instagram_and_Vine_Presence","325424607_Beyond_the_hashtag_Circumventing_content_moderation_on_social_media","323321590_Iconology_Image_Text_Ideology","315201802_Iconology_Image_Text_Ideology","309962707_The_walkthrough_method_An_approach_to_the_study_of_apps","306259282_Analysis_of_Photo_Sharing_and_Visual_Social_Relationships_Instagram_as_Case_Study","301644436_Mapping_sociocultural_controversies_across_digital_media_platforms_one_week_of_gamergate_on_Twitter_YouTube_and_Tumblr"]}