{"id":"325705165_An_Experience_Using_On-Computer_Programming_Questions_During_Exams","abstract":"Exams in programming intensive computer science courses are often completed on paper. While a variety of question types may be used, it is common to require students to write short programs on paper without the aid of the development tools and reference materials that they have used throughout the semester. Our students have expressed concerns that such exams are not reflective of the \"real world\" and that they believe that their grade on such exams is not an accurate reflection of their programming ability.\nIn this paper we report on our recent experience using exams that include a closed book multiple choice portion answered on paper and an on-computer programming portion where students were asked to create small programs using their usual development tools and reference materials, including full internet access. Students' experience with such exams is reported for a class of 126 students, and a number of advantages and challenges observed by the course instructor are also discussed. Overall, both the students and the course instructor found that on-computer programming questions were preferable to answering such questions on paper.","authors":["Ben Stephenson"],"meta":["May 2018","DOI:10.1145/3209635.3209639","Conference: the 23rd Western Canadian Conference"],"references":["262299998_Assessing_Process_and_Product_-_A_Practical_Lab_Exam_for_an_Introductory_Programming_Course","220807287_Using_lab_exams_to_ensure_programming_practice_in_an_introductory_programming_course","3844917_The_design_of_online_tests_for_Computer_Science_I_and_their_effectiveness","314296100_In-Lab_Programming_Tests_in_a_Data_Structures_Course_in_C_for_Non-Specialists","311489136_Paper_vs_Computer-based_Exams_A_Study_of_Errors_in_Recursive_Binary_Tree_Algorithms","311465400_Using_lab_exams_to_ensure_programming_practice_in_an_introductory_programming_course","283873016_Computerized_testing_A_vision_and_initial_experiences","221538748_Assessing_the_assessment_of_programming_ability","221538372_Testing_skills_and_knowledge_introducing_a_laboratory_exam_in_CS1","221538101_Using_Lab_Practica_to_Evaluate_Programming_Ability"]}