{"id":"325781277_A_taxonomy_of_digital_intensive_sectors","abstract":"This study proposes a taxonomy of sectors according to the extent to which they have\ngone digital. The taxonomy accounts for some of the key facets of the digital\ntransformation, and recognises that sectors differ in their development and adoption of\nthe most advanced “digital” technologies, in the human capital needed to embed them in\nproduction and in the extent to which digital tools are used to deal with clients and\nsuppliers. The indicators used to classify 36 ISIC revision 4 sectors over the period 2001-\n15 are: share of ICT tangible and intangible (i.e. software) investment; share of\npurchases of intermediate ICT goods and services; stock of robots per hundreds of\nemployees; share of ICT specialists in total employment; and the share of turnover from\nonline sales.\nSome sectors (e.g. telecom and IT services) are positioned consistently at the top of the\ndistribution of sectors, independently of the indicator used, while others are positioned in\nthe bottom quartile of digital intensity across all available indicators (e.g. agriculture,\nmining and real estate). This is true for the classification of sectors based on both 2001-\n03 and 2013-15 data. Sectors positioned in the middle, instead, differ across indicators,\nsuggesting that they are engaged in the digital transformation at different rates,\ndepending on the dimensions considered.\nThe study further proposes an overall summary indicator of the digital transformation in\nsectors which encompasses all the considered dimensions. Preliminary results suggest\nthat this summary indicator performs reasonably well in approximating sectors’\nintensities in the different dimensions of the digital transformation.","authors":["Flavio Calvino","Chiara Criscuolo","Luca Marcolin","Mariagrazia Squicciarini"],"meta":["June 2018","DOI:10.1787/f404736a-en","Project: Going Digital: Measurement"],"references":["318214387_Skills_and_global_value_chains_A_characterisation","254426074_Intangible_Capital_and_Growth_in_Advanced_Economies_Measurement_Methods_and_Comparative_Results","227461326_Are_ICT_users_more_innovative_an_analysis_of_ICT-enabled_innovation_in_OECD_firms","323766747_Robots_at_Work","298091593_Innovation_in_Firms_A_Microeconomic_Perspective","292357417_The_Economic_Impact_of_ICT_Measurement_Evidence_and_Implications","289328461_The_low-tech_issue","274731196_An_Illustrated_User_Guide_to_the_World_Input-Output_Database_The_Case_of_Global_Automotive_Production","256062432_If_Technology_Has_Arrived_Everywhere_Why_Has_Income_Diverged","248405072_We''d_Better_Watch_Out","5205977_Productivity_Growth_in_ICT-producing_and_ICT-using_Industries_A_Source_of_Growth_Differentials_in_the_OECD","24047053_ICT_Investment_and_Economic_Growth_in_the_1990s_Is_the_United_States_a_Unique_Case","5206013_Measuring_Investment_in_Software"]}