{"id":"325800590_Evolutionary_Approach_to_Machine_Learning_and_Deep_Neural_Networks","abstract":"This book provides theoretical and practical knowledge about a methodology for evolutionary algorithm-based search strategy with the integration of several machine learning and deep learning techniques. These include convolutional neural networks, Gröbner bases, relevance vector machines, transfer learning, bagging and boosting methods, clustering techniques (affinity propagation), and belief networks, among others. The development of such tools contributes to better optimizing methodologies. Beginning with the essentials of evolutionary algorithms and covering interdisciplinary research topics, the contents of this book are valuable for different classes of readers: novice, intermediate, and also expert readers from related fields.\nFollowing the chapters on introduction and basic methods, Chapter 3 details a new research direction, i.e., neuro-evolution, an evolutionary method for the generation of deep neural networks, and also describes how evolutionary methods are extended in combination with machine learning techniques. Chapter 4 includes novel methods such as particle swarm optimization based on affinity propagation (PSOAP), and transfer learning for differential evolution (TRADE), another machine learning approach for extending differential evolution.\nThe last chapter is dedicated to the state of the art in gene regulatory network (GRN) research as one of the most interesting and active research fields. The author describes an evolving reaction network, which expands the neuro-evolution methodology to produce a type of genetic network suitable for biochemical systems and has succeeded in designing genetic circuits in synthetic biology. The author also presents real-world GRN application to several artificial intelligent tasks, proposing a framework of motion generation by GRNs (MONGERN), which evolves GRNs to operate a real humanoid robot.","authors":["Hitoshi Iba"],"meta":["June 2018","DOI:10.1007/978-981-13-0200-8","ISBN: 978-981-13-0199-5"],"references":["328829520_Agent-Based_Modeling_and_Simulation_with_Swarm"]}