{"id":"325811637_Extending_INSPIRE_to_the_internet_of_things_through_sensorthings_API","abstract":"Spatial Data Infrastructures (SDI) established during the past two decades “unlocked” heterogeneous geospatial datasets. The European Union INSPIRE Directive laid down the foundation of a pan-European SDI where thousands of public sector data providers make their data, including sensor observations, available for cross-border and cross-domain reuse. At the same time, SDIs should inevitably adopt new technology and standards to remain fit for purpose and address in the best possible way the needs of different stakeholders (government, businesses and citizens). Some of the recurring technical requirements raised by SDI stakeholders include: (i) the need for adoption of RESTful architectures; together with (ii) alternative (to GML) data encodings, such as JavaScript Object Notation (JSON) and binary exchange formats; and (iii) adoption of asynchronous publish–subscribe-based messaging protocols. The newly established OGC standard SensorThings API is particularly interesting to investigate for INSPIRE, as it addresses together all three topics. In this manuscript, we provide our synthesised perspective on the necessary steps for the OGC SensorThings API standard to be considered as a solution that meets the legal obligations stemming out of the INSPIRE Directive. We share our perspective on what should be done concerning: (i) data encoding; and (ii) the use of SensorThings API as a download service.","authors":["Alexander Kotsev","Steve Liang","Hylke van der Schaaf","Tania Khalafbeigi"],"meta":["June 2018Geosciences 8(6)","DOI:10.3390/geosciences8060221"],"references":["307553765_A_Web_Service_Protocol_Realizing_Interoperable_Internet_of_Things_Tasking_Capability","303549672_Towards_a_Federation_of_Smart_City_Services","261513319_Making_the_Sensor_Observation_Service_INSPIRE_Compliant","221118254_OGCR_Sensor_Web_Enablement_Overview_and_High_Level_Architecture","4286990_OGC_R_Sensor_Web_Enablement_Overview_and_high_level_architecture","325652678_Establishing_Common_Ground_Through_INSPIRE_The_Legally-Driven_European_Spatial_Data_Infrastructure","273138151_SEnviro_A_Sensorized_Platform_Proposal_Using_Open_Hardware_and_Open_Standards","242410772_OpenGISR_Sensor_Model_Language_SensorML_Implementation_Specification","222848001_OGC_Catalog_Services_A_key_element_for_the_development_of_Spatial_Data_Infrastructures"]}