{"id":"325833276_A_survey_on_automation_of_security_requirements_in_service-based_business_processes","abstract":"Service-oriented computing (SOC) and business process management (BPM) are essential topics in computer science. Companies are widely adopting business process standards, such as BPMN, to model their business processes, while automatise them by using services from the SOC world. The automation leads to a gain of efficiency in executing business processes and facilitates the execution of tests. However, the automation also raises fundamental security concerns, especially considering that it can use external services available on the internet, e.g., web services. For example, companies are not comfortable to use systems that communicate over the internet without guarantees that secure actions have been adequately used. The main objective of this work is to provide a holistic view of current initiatives and tools to model and enforce security requirements in service-based business processes along with open research and practical challenges on this subject. The intention is that this work can serve as a source of theoretical and pragmatic ideas for those who want to execute their business processes having in mind security concerns.","authors":["Fernando Antonio Aires Lins","Erica Teixeira Gomes Sousa","Nelson Souto Rosa"],"meta":["January 2018International Journal of Web Engineering and Technology 13(1):3","DOI:10.1504/IJWET.2018.092398"],"references":["289712675_An_Extension_of_Business_Process_Model_and_Notation_for_Security_Risk_Management","282437509_Automation_of_service-based_security-aware_business_processes_in_the_Cloud","265026009_A_Domain-Specific_Language_for_Modelling_Security_Objectives_in_a_Business_Process_Models_of_SOA_Applications","235949866_Aalst_WMP_Business_process_management_a_comprehensive_survey_ISRN_Softw_Eng_1-37","317236091_Supporting_Secure_Business_Process_Design_via_Security_Process_Patterns","317071979_Adding_a_Third_Dimension_to_BPMN_as_a_Means_of_Representing_Cyber_Security_Requirements","282307593_From_Secure_Business_Process_Models_to_Secure_Artifact-Centric_Specifications","280530637_Towards_Automation_of_Security-aware_SOA-based_Business_Processes","259517239_Securing_Business_Processes_using_Security_Risk-oriented_Patterns","221587552_Composing_Non-functional_Concerns_in_Composite_Web_Services"]}