{"id":"325859484_On_the_optimality_of_non-linear_computations_for_symmetric_key_primitives","abstract":"A block is an n -bit string, and a (possibly keyed) block-function is a non-linear mapping that maps one block to another, e.g., a block-cipher. In this paper, we consider various symmetric key primitives with {\\ell} block inputs and raise the following question: what is the minimum number of block-function invocations required for a mode to be secure? We begin with encryption modes that generate {\\ell^{\\prime}} block outputs and show that at least {(\\ell+\\ell^{\\prime}-1)} block-function invocations are necessary to achieve the PRF security. In presence of a nonce, the requirement of block-functions reduces to {\\ell^{\\prime}} blocks only. If {\\ell=\\ell^{\\prime}} , in order to achieve SPRP security, the mode requires at least {2\\ell} many block-function invocations. We next consider length preserving r -block (called chunk ) online encryption modes and show that, to achieve online PRP security, each chunk should have at least {2r-1} many and overall at least {2r\\ell-1} many block-functions for {\\ell} many chunks. Moreover, we show that it can achieve online SPRP security if each chunk contains at least {2r} non-linear block-functions. We next analyze affine MAC modes and show that an integrity-secure affine MAC mode requires at least {\\ell} many block-function invocations to process an {\\ell} block message. Finally, we consider affine mode authenticated encryption and show that in order to achieve INT-RUP security or integrity security under a nonce-misuse scenario, either (i) the number of non-linear block-functions required to generate the ciphertext is more than {\\ell} or (ii) the number of extra non-linear block-functions required to generate the tag depends on {\\ell} .","authors":["Avik Chakraborti","Nilanjan Datta","Mridul Nandi"],"meta":["June 2018Journal of Mathematical Cryptology 12(4)","DOI:10.1515/jmc-2017-0011"],"references":["281985394_Extended_Generalized_Feistel_Networks_Using_Matrix_Representation","220618451_How_to_Construct_Pseudorandom_Permutations_from_Pseudorandom_Functions","220334721_On-line_Ciphers_and_the_Hash-CBC_Constructions","300139511_On_the_Optimality_of_Non-Linear_Computations_of_Length-Preserving_Encryption_Schemes","221354885_On_Generalized_Feistel_Networks","220334911_A_Block-Cipher_Mode_of_Operation_for_Parallelizable_Message_Authentication","220333378_PRF_Domain_Extension_Using_DAGs","2922848_EME_extending_EME_to_handle_arbitrary-length_messages","2775996_The_Security_of_Cipher_Block_Chaining","2557088_OMAC_One-Key_CBC_MAC_-_Addendum","2376852_Parallelizable_Encryption_Mode_with_Almost_Free_Message_Integrity","2362407_Lecture_Notes_in_Computer_Science"]}