{"id":"325881702_State_of_the_art_in_image_processing_big_data_analytics_Issues_and_challenges","abstract":"Image processing, in the contemporary domain, is now emerging as a novel and an innovative space in computing research and applications. Today, the discipline of \"computer science\" may be termed as \"image science\", why because in every aspect of computer application, either science or humanities or management, image processing plays a vital role in varied ways. It is broadly now used in all the industries, organizations, administrative divisions; various social organizations, economic/business institutions, healthcare, defense and so on. Image processing takes images as input and image processing techniques are used to process the images and the output is modified images, video, or collection of text, or features of the images. The resultant output by most image processing techniques creates a huge amount of data which is categorized as Big-data. In this technique, bulky information is processed and stored as either structured or un-structured data as a result of processing images through computing techniques. In turn, Big Data analytics for mining knowledge from data created through image processing techniques has a huge potential in sectors like education, government organizations, healthcare institutions, manufacturing units, finance and banking, centers of retail business. This paper focuses on highlighting the recent innovations made in the field of image processing and Big Data analytics. The integration and interaction of the two broad fields of image processing and Big Data have great potential in various areas. Research challenges identified in the integration and interaction of these two broad fields are discussed and some possible research directions are suggested.","authors":["S Vahini Ezhilraman","Sujatha Srinivasan"],"meta":["June 2018International Journal of Engineering & Technology 7(2):195-199","DOI:10.14419/ijet.v7i2.33.13885"],"references":["312196553_Value_Oriented_Big_Data_Strategy_Analysis_Case_Study","312144674_A_Survey_on_Pre-Processing_in_Image_Matting","307516860_Guest_Editorial_Big_Data_Analytics_for_Grid_Modernization","296550027_A_Survey_on_Big_Data_Analytics_Challenges_Open_Research_Issues_and_Tools","286639597_Performance_Analysis_of_Texture_Image_Retrieval_for_Curvelet_Contourlet_Transform_and_Local_Ternary_Pattern_Using_Mri_Brain_Tumor_Image","316988718_Big_Data_Analytics_Image_Enhancement_based_approach","281894614_Hyperspectral_image_processing_and_analysis","4365745_Medical_Image_Processing_by_Denoising_and_Contour_Extraction"]}