{"id":"325805953_RETHINKING_ACTIVE_LEARNING_AS_A_PARADIGM_OF_OUR_TIMES_TOWARDS_POETICIZING_AND_HUMANIZING_NATURAL_SCIENCES_IN_THE_AGE_OF_STEM","abstract":"Though practiced since ancient times, active learning has emerged as the dominant educational paradigm in the 1990s. Methodologically, it is more suitable to teach critical thinking skills compared to the classical lecturing approach. On the other hand, most university settings, including those focusing heavily on STEM (Science-Engineering-Technology-Mathematics), have embraced it unreservedly, offering no forums to analyze its pros and cons and thus provide conditions for its progress. This constitutes a fundamental paradox. In this essay, specific drawbacks associated with the practical applications of this educational paradigm are discussed. They include the promotion of mediocrity through classroom \"democratization\"; the suppression of solitary reflections and introspectiveness, along with the creative potentials associated therewith; the inhibition of extraordinariness through excessive teamwork; and the incompatibility with the dominant learning assessment strategies. It is argued that the absorption of ideas stemming from domains distant from pedagogy and one's field of research are needed to revitalize the current state of active learning practice. Proposed solutions include the revival of the magic of live lecturing through training teachers in spoken poetry and performance arts; integrating research projects into teaching time; and restructuring the concept of the classroom toward a space and context more reflective of life and more conducive to the learning experience. Continued discussion over the weaknesses of active learning practices are needed to ensure the unhindered progress of this teaching methodology that is currently unrivaled in its popularity and prospect.","authors":["Vuk Uskokovic"],"meta":["January 2017Journal of Materials Education 39(5-6):241-258"],"references":["282765844_Chemical_Reactions_as_Petite_Rendezvous_The_Use_of_Metaphor_in_Materials_Science_Education","344092371_Thus_Spoke_Zarathustra","317953719_Radical_Constructivism_A_Way_of_Knowing_and_Learning","317953622_Radical_constructivism_A_way_of_knowing_and_learning","316082788_Why_Every_Aspect_of_an_Academic_Pharmacy_Career_Should_Be_Viewed_Through_the_Lens_of_Scholarship","303990432_Engaging_Ideas_The_Professors_Guide_to_Integrating_Writing_Critical_Thinking_and_Active_Learning_in_the_Classroom","274462407_The_Open_Society_and_Its_Enemies","270147889_An_Introduction_to_Cybernetics","269645835_Mind_and_Nature_A_Necessary_Unity","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives"]}