{"id":"325896767_Kinematic_Spline_Curves_A_temporal_invariant_descriptor_for_fast_action_recognition","abstract":"Over the last few decades, action recognition applications have attracted the growing interest of researchers, especially with the advent of RGB-D cameras. These applications increasingly require fast processing. Therefore, it becomes important to include the computational latency in the evaluation criteria. In this paper, we propose a novel human action descriptor based on skeleton data provided by RGB-D cameras for fast action recognition. The descriptor is built by interpolating the kinematics of skeleton joints (position, velocity and acceleration) using a cubic spline algorithm. A skeleton normalization is done to alleviate anthropometric variability. To ensure rate invariance which is one of the most challenging issue in action recognition, a novel temporal normalization algorithm called Time Variable Replacement (TVR) is proposed. It is a change of variable of time by a variable that we call Normalized Action Time (NAT) varying in a ﬁxed range and making the descriptors less sensitive to execution rate variability. To map time with NAT, increasing functions (called Time Variable Replacement Function (TVRF)) are used. Two different Time Variable Replacement Functions (TVRF) are proposed in this paper: the Normalized Accumulated kinetic Energy (NAE) of the skeleton and the Normalized Pose Motion Signal Energy (NPMSE) of the skeleton. The action recognition is carried out using a linear Support Vector Machine (SVM). Experimental results on ﬁve challenging benchmarks show the effectiveness of our approach in terms of recognition accuracy and computational latency.","authors":["Enjie Ghorbel","Rémi Boutteau","Jacques Boonaert","Xavier Savatier"],"meta":["June 2018Image and Vision Computing 77","DOI:10.1016/j.imavis.2018.06.004"],"references":["318876886_Learning_Action_Recognition_Model_From_Depth_and_Skeleton_Videos","314797332_A_New_Representation_of_Skeleton_Sequences_for_3D_Action_Recognition","311399994_A_fast_and_accurate_motion_descriptor_for_human_action_recognition_applications","305724903_Motion_Segment_Decomposition_of_RGB-D_Sequences_for_Human_Behavior_Understanding","305638191_Spatio-Temporal_LSTM_with_Trust_Gates_for_3D_Human_Action_Recognition","325912548_Applications_of_hybrid_system_identification_in_computer_vision","315933027_SkeletonNet_Mining_Deep_Part_Features_for_3D_Action_Recognition","313720977_On_the_learnability_and_design_of_output_codes_for_multiclass_problems","307881957_LIBSVM_A_library_for_support_vector_machines","305867060_Hierarchical_recurrent_neural_network_for_skeleton_based_action_recognition"]}