{"id":"325825949_Conflict-free_rerouting_scheme_through_flow_splitting_for_virtual_networks_using_switches","abstract":"The weaknesses of the Internet led to the creation of a new network paradigm – network virtualization. Virtualization is a very successful technique for sharing and reusing resources, which results in higher efficiency. Despite its advantages, including flexibility in network architecture, virtualization imposes many challenges, such as physical resource allocation to virtual devices. An efficient allocation strategy for these resources can ensure good Quality of Service (QoS) in virtual networks, whether in node or link failure events. This paper presents a conflict-free rerouting scheme with efficient additional capacity usage for link and node failure resilience in a virtual network using switches. Combining an IP Fast Rerouting approach and flow-splitting strategy, this scheme provides short reaction time, stable performance and low complexity because the rerouting calculation and configuration are performed in advance. We show that rerouting by traffic splitting based on the entering arc and destination is sufficient to address all link-failure situations in the network, assuming that the network is two-link connected. After modelling the dimensioning problem as an Integer Linear Programme, we demonstrate through practical implementation of our rerouting scheme on different networks that the scheme can substantially minimize the additional capacity draw on the substrate network. A solution using multiple virtual planes is also provided to solve several conflict problems in the case of simultaneous multiple link failures.","authors":["Vianney Kengne Tchendji","Yannick Florian Yankam","Jean Frédéric Myoupo"],"meta":["December 2018Journal of Internet Services and Applications 9(1)","DOI:10.1186/s13174-018-0085-4"],"references":["276322279_Virtual_Network_Security_Threats_Countermeasures_and_Challenges","261337278_A_demonstration_of_automatic_bootstrapping_of_resilient_OpenFlow_networks","260357303_OpenFlow-Based_Segment_Protection_in_Ethernet_Networks","257883291_Mapping_virtual_networks_onto_substrate_networks","282864736_Autonomous_management_of_quality_of_service_in_virtual_networks","274441253_Autonomous_IP_Fast_Rerouting_with_Compressed_Backup_Flow_Entries_Using_OpenFlow","273002355_Convex_Optimization","257582253_Virtual_network_embedding_through_topology_awareness_and_optimization","256942138_OpenFlow_Meeting_carrier-grade_recovery_requirements","249645298_A_Performance_Comparison_of_Network_Simulators_for_Wireless_Networks"]}