{"id":"325867518_Percutaneous_USMRI_Fusion-guided_Radiofrequency_Ablation_for_Recurrent_Subcentimeter_Hepatocellular_Carcinoma_Technical_Feasibility_and_Therapeutic_Outcomes","abstract":"Purpose To evaluate the technical feasibility and therapeutic outcomes of percutaneous US/MRI fusion-guided radiofrequency ablation (RFA) of recurrent subcentimeter-sized hepatocellular carcinomas (HCCs). Materials and Methods For this retrospective study, between January 2012 and December 2014 a total of 194 planning US examinations were performed in 186 patients (159 men and 27 women; mean age, 61.1 years ± 10.0 [standard deviation]) for newly developed subcentimeter recurrent HCCs. These recurrent HCCs were defined as hypervascular nodules (>5.5 mm and <10 mm) with typical MRI findings of HCC. The study assessed how often US/MRI fusion-guided percutaneous RFA was deemed technically feasible at planning US examination (the feasibility rate) and the therapeutic outcomes after RFA, including the rates of technical success, technique efficacy, local tumor progression (LTP), and major complications. Cumulative LTP rates were estimated with the Kaplan-Meier method. Results The feasibility rate of percutaneous RFA at planning US examination was 65.7% (138 of 210 HCCs). The most common reason for RFA infeasibility was that an index tumor was inconspicuous at US. Among 138 subcentimeter HCCs feasible for RFA, 125 lesions underwent percutaneous RFA. The rates of both technical success and technique efficacy were 98.4% (123 of 125). The cumulative LTP rates at 1, 2, and 3 years were 3.6%, 5.4%, and 7.4%, respectively. The major complication rate was 2.5% (three of 119). Conclusion Percutaneous US/MRI fusion-guided radiofrequency ablation (RFA) was feasible in approximately two-thirds of subcentimeter recurrent hepatocellular carcinomas (HCCs). Percutaneous US/MRI fusion-guided RFA is a safe and effective treatment modality for patients with subcentimeter recurrent HCCs.","authors":["Kyoung Doo Song","Min Woo Lee","Hyunchul Rhim","Tae Wook Kang"],"meta":["June 2018Radiology 288(3)","DOI:10.1148/radiol.2018172743"],"references":[]}