{"id":"325868154_Random-Forest_Inspired_Neural_Networks","abstract":"Neural networks have become very popular in recent years because of the astonishing success of deep learning in various domains such as image and speech recognition. In many of these domains, specific architectures of neural networks, such as convolutional networks, seem to fit the particular structure of the problem domain very well, and can therefore perform in an astonishingly effective way. However, the success of neural networks is not universal across all domains. Indeed, for learning problems without any special structure, or in cases where the data is somewhat limited, neural networks are known not to perform well with respect to traditional machine learning methods such as random forests. In this paper, we show that a carefully designed neural network with random forest structure can have better generalization ability. In fact, this architecture is more powerful than random forests, because the back-propagation algorithm reduces to a more powerful and generalized way of constructing a decision tree. Furthermore, the approach is efficient to train and requires a small constant factor of the number of training examples. This efficiency allows the training of multiple neural networks in order to improve the generalization accuracy. Experimental results on real-world benchmark datasets demonstrate the effectiveness of the proposed enhancements for classification and regression.","authors":["Suhang Wang","Charu C. Aggarwal","Huan Liu"],"meta":["October 2018ACM Transactions on Intelligent Systems and Technology 9(6)","DOI:10.1145/3232230"],"references":["325710431_Deep_Learning_for_Feature_Representation","324942059_Weakly_Supervised_Facial_Attribute_Manipulation_via_Deep_Adversarial_Network","345141493_Feature_Engineering_for_Machine_Learning_and_Data_Analytics","324008839_A_Generative_Model_for_Category_Text_Generation","322715582_The_elements_of_statistical_learning","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","318830176_Deep_Forest_Towards_An_Alternative_to_Deep_Neural_Networks"]}