{"id":"325863839_Online_Clustering_for_Evolving_Data_Streams_with_Online_Anomaly_Detection","abstract":"Clustering data streams is an emerging challenge with a wide range of applications in areas including Wireless Sensor Networks, the Internet of Things, finance and social media. In an evolving data stream, a clustering algorithm is desired to both (a) assign observations to clusters and (b) identify anomalies in real-time. Current state-of-the-art algorithms in the literature do not address feature (b) as they only consider the spatial proximity of data, which results in (1) poor clustering and (2) poor demonstration of the temporal evolution of data in noisy environments. In this paper, we propose an online clustering algorithm that considers the temporal proximity of observations as well as their spatial proximity to identify anomalies in real-time. It identifies the evolution of clusters in noisy streams, incrementally updates the model and calculates the minimum window length over the evolving data stream without jeopardizing performance. To the best of our knowledge, this is the first online clustering algorithm that identifies anomalies in real-time and discovers the temporal evolution of clusters. Our contributions are supported by synthetic as well as real-world data experiments.","authors":["Milad Chenaghlou","Masud Moshtaghi","Christopher Leckie","Mahsa Salehi"],"meta":["June 2018","DOI:10.1007/978-3-319-93037-4_40","In book: Advances in Knowledge Discovery and Data Mining (pp.508-521)"],"references":["322516978_An_Efficient_Method_for_Anomaly_Detection_in_Non-Stationary_Data_Streams","306061974_Online_Clustering_of_Multivariate_Time-series","294121659_Generalized_information_theoretic_cluster_validity_indices_for_soft_clusterings","278711150_A_Relevance_Weighted_Ensemble_Model_for_Anomaly_Detection_in_Switching_Data_Streams","316230574_Hybrid_system_of_ART_and_RBF_neural_networks_for_online_clustering","313061265_Clustering_data_streams","312879244_Some_methods_for_the_classification_and_analysis_of_multivariate_observations","304533936_A_simple_weight_decay_can_improve_generalization","292262674_Some_methods_for_classification_and_analysis_of_multivariate_observations","279345613_Applied_Multivariate_Statistical_Analysis"]}