{"id":"325832662_Property_specification_patterns_for_robotic_missions","abstract":"Engineering dependable software for mobile robots is becoming increasingly important. A core asset in engineering mobile robots is the mission specification---a formal description of the goals that mobile robots shall achieve. Such mission specifications are used, among others, to synthesize, verify, simulate, or guide the engineering of robot software. Development of precise mission specifications is challenging. Engineers need to translate the mission requirements into specification structures expressed in a logical language---a laborious and error-prone task.\nTo mitigate this problem, we present a catalog of mission specification patterns for mobile robots. Our focus is on robot movement, one of the most prominent and recurrent specification problems for mobile robots. Our catalog maps common mission specification problems to recurrent solutions, which we provide as templates that can be used by engineers. The patterns are the result of analyzing missions extracted from the literature. For each pattern, we describe usage intent, known uses, relationships to other patterns, and---most importantly---a template representing the solution as a logical formula in temporal logic.\nOur specification patterns constitute reusable building blocks that can be used by engineers to create complex mission specifications while reducing specification mistakes. We believe that our patterns support researchers working on tool support and techniques to synthesize and verify mission specifications, and language designers creating rich domain-specific languages for mobile robots, incorporating our patterns as language concepts.","authors":["Claudio Menghi","Christos Tsigkanos","Thorsten Berger","Patrizio Pelliccione"],"meta":["May 2018","DOI:10.1145/3183440.3195044","Conference: the 40th International Conference"],"references":["224588836_Temporal-Logic-Based_Reactive_Mission_and_Motion_Planning","221785903_Gauging_Intelligence_of_Mobile_Robots","221554456_Specification_patterns_for_probabilistic_quality_properties","27536987_Multiagent_Mission_Specification_and_Execution","3656185_Specification_and_execution_of_multiagent_missions","2592885_Patterns_in_Property_Specifications_for_Finite-State_Verification","272414613_Aligning_Qualitative_Real-Time_and_Probabilistic_Property_Specification_Patterns_Using_a_Structured_English_Grammar","269198960_Real-time_specification_patterns","27536903_Usability_Evaluation_of_High-Level_User_Assistance_for_Robot_Mission_Specification","3846344_Patterns_in_property_specifications_for_finite-state_verification"]}