{"id":"325839083_Epigenetic_maintenance_of_topological_domains_in_the_highly_rearranged_gibbon_genome","abstract":"The relationship between evolutionary genome remodeling and the three-dimensional structure of the genome remain largely unexplored. Here, we use the heavily rearranged gibbon genome to examine how evolutionary chromosomal rearrangements impact genome-wide chromatin interactions, topologically associating domains (TADs), and their epigenetic landscape. We use high-resolution maps of gibbon-human breaks of synteny (BOS), apply Hi-C in gibbon, measure an array of epigenetic features, and perform cross-species comparisons. We find that gibbon rearrangements occur at TAD boundaries, independent of the parameters used to identify TADs. This overlap is supported by a remarkable genetic and epigenetic similarity between BOS and TAD boundaries, namely presence of CpG islands and SINE elements, and enrichment in CTCF and H3K4me3 binding. Cross-species comparisons reveal that regions orthologous to BOS also correspond with boundaries of large (400-600 kb) TADs in human and other mammalian species. The colocalization of rearrangement breakpoints and TAD boundaries may be due to higher chromatin fragility at these locations and/or increased selective pressure against rearrangements that disrupt TAD integrity. We also examine the small portion of BOS that did not overlap with TAD boundaries and gave rise to novel TADs in the gibbon genome. We postulate that these new TADs generally lack deleterious consequences. Last, we show that limited epigenetic homogenization occurs across breakpoints, irrespective of their time of occurrence in the gibbon lineage. Overall, our findings demonstrate remarkable conservation of chromatin interactions and epigenetic landscape in gibbons, in spite of extensive genomic shuffling.","authors":["Nathan Lazar","Kimberly A. Nevonen","Brendan O'Connell","Christine McCann"],"meta":["June 2018Genome Research 28(7)","DOI:10.1101/gr.233874.117"],"references":["345145258_Chromatin_features_constrain_structural_variation_across_evolutionary_timescales","324970654_An_Integrative_Framework_For_Detecting_Structural_Variations_In_Cancer_Genomes","318577781_Genome_Organization_Drives_Chromosome_Fragility","317959545_Hi-C_as_a_tool_for_precise_detection_and_characterisation_of_chromosomal_rearrangements_and_copy_number_variation_in_human_tumours","310438681_A_Compendium_of_Chromatin_Contact_Maps_Reveals_Spatially_Active_Regions_in_the_Human_Genome","345713305_Genetic_drivers_of_repeat_expansion_disorders_localize_to_3-D_chromatin_domain_boundaries","318576199_Computational_Prediction_of_Position_Effects_of_Apparently_Balanced_Human_Chromosomal_Rearrangements","316887873_Gibbon_genome_and_the_fast_karyotype_evolution_of_small_apes","316106107_Clinical_and_molecular_characterization_of_a_second_family_with_the_12q14_microdeletion_syndrome_and_review_of_the_literature","310473459_Whole_Genome_Sequencing_of_Cytogenetically_Balanced_Chromosome_Translocations_Identifies_Potentially_Pathological_Gene_Disruptions_and_Highlights_the_Importance_of_Microhomology_in_the_Mechanism_of_Fo"]}