{"id":"325821424_Universities_and_smart_cities_the_challenges_to_high_quality","abstract":"The universities have a diverse influence on the development of the society. Today this also includes countless smart city and community initiatives all over the world. These cases bring together city planning, industry, universities and citizens to improve the urban life of individuals and organisations with the integrated use of versatile information, digital and communication technologies. The purpose of this article is to consider quality management in the universities in a professional and creative way, which comprehensively covers the universities’ activities of education, research and social collaboration, and which can ensure the universities’ successful partnership in the smart city projects. This article describes the key aspects related to the smart city phenomenon and development, and in this context the challenges to expanding and reinforcing the universities’ quality management practices to meet the increased requirements of the collaboration with the other organisations for the quality of society through the disrupted innovations. The article brings up related conceptual bases, practical solutions and examples. Smart cities are also manifestations of the 4th industrial revolution and industry 4.0, which emerging phenomena imply innovations, better planning, a more participatory approach towards higher energy efficiency, better transport solutions, and intelligent use of information and communication technologies. The required collaboration with the many different involved societal parties sets requirements for quality in the universities’ main activity sectors. In practice, this is ensured through organisational learning towards excellence in the overall performance of the university that implies professional quality management principles, innovations in processes and practices aligned with the other organisations of the society. This article is based on the authors’ long-term general research and practice of the business integrated quality management, and education and industry collaboration at different universities. Some parts of the material have been presented at different seminars and conferences, for instance in Chelyabinsk/Russia, Kenitra/Morocco and Kremenets/Ukraina.","authors":["Juhani Anttila","Kari Jussila"],"meta":["June 2018Total Quality Management and Business Excellence 29(9-10):1-16","DOI:10.1080/14783363.2018.1486552","Project: No particular project; only authors’ scientific multidisciplinary interests"],"references":["306046857_Everything_You_Wanted_to_Know_About_Smart_Cities","236896569_How_Shall_We_Know_Epistemological_Concerns_in_Research_in_Experiential_Education","220694277_Linked_How_Everything_Is_Connected_to_Everything_Else_and_What_It_Means_for_Business_Science_and_Everyday_Life","314755853_The_New_Economics_For_Industry_Government_Education","215439307_ISO_90012000_-_Quality_management_systems_-_Requirements","44833830_The_Fifth_Discipline_Fieldbook_Strategies_and_Tools_for_Building_a_Learning_Organization"]}