{"id":"325984939_Modeling_and_Characterization_of_Traffic_Flows_in_Urban_Environments","abstract":"Currently, one of the main challenges faced in large metropolitan areas is traffic congestion. To address this problem, adequate traffic control could produce many benefits, including reduced pollutant emissions and reduced travel times. If it were possible to characterize the state of traffic by predicting future traffic conditions for optimizing the route of automated vehicles, and if these measures could be taken to preventively mitigate the effects of congestion with its related problems, the overall traffic flow could be improved. This paper performs an experimental study of the traffic distribution in the city of Valencia, Spain, characterizing the different streets of the city in terms of vehicle load with respect to the travel time during rush hour traffic conditions. Experimental results based on realistic vehicular traffic traces from the city of Valencia show that only some street segments fall under the general theory of vehicular flow, offering a good fit using quadratic regression, while a great number of street segments fall under other categories. Although in some cases such discrepancies are related to lack of traffic, injecting additional vehicles shows that significant mismatches still persist. Thus, in this paper we propose an equation to characterize travel times over a segment belonging to the sigmoid family; specifically, we apply logistic regression, being able to significantly improve the curve fitting results for most of the street segments under analysis. Based on our regression results, we performed a clustering analysis of the different street segments, showing that they can be classified into three well-defined categories, which evidences a predictable traffic distribution using the logistic regression throughout the city during rush hours, and allows optimizing the traffic for automated vehicles.","authors":["Jorge Luis Zambrano-Martinez","Carlos Tavares Calafate","David Soler","Juan-Carlos Cano"],"meta":["June 2018Sensors 18(7):2020","DOI:10.3390/s18072020","Project: Efficient Traffic Management in Urban Environments"],"references":["321838003_Towards_Realistic_Urban_Traffic_Experiments_Using_DFROUTER_Heuristic_Validation_and_Extensions","319659330_Towards_Real-Time_Road_Traffic_Analytics_using_Telco_Big_Data","312484891_Using_Real_Traffic_Data_for_ITS_Simulation_Procedure_and_Validation","283958420_Traffic_Management_as_a_Service_The_Traffic_Flow_Pattern_Classification_Problem","281804935_DFROUTER-Estimation_of_Vehicle_Routes_from_Cross-Section_Measurements","324289750_Applied_Logistic_Regression_Analysis","319698313_Analysis_and_Classification_of_the_Vehicular_Traffic_Distribution_in_an_Urban_Area","312404401_Artificial_Neural_Network_Based_Real-Time_Urban_Road_Traffic_State_Estimation_Framework","311623504_Automated_planning_for_Urban_traffic_control_Strategic_vehicle_routing_to_respect_air_quality_limitations","302961862_Efficient_Macroscopic_Urban_Traffic_Models_for_Reducing_Congestion_A_PDDL_Planning_Approach","266673838_A_Communications-Oriented_Perspective_on_Traffic_Management_Systems_for_Smart_Cities_Challenges_and_Innovative_Approaches","260680268_Adaptive_Kalman_filter_approach_for_stochastic_short-term_traffic_flow_rate_prediction_and_uncertainty_quantification","264220075_Analysis_of_Travel_Times_and_CO2_Emissions_in_Time-Dependent_Vehicle_Routing","261025598_Hierarchical_fuzzy_rule-based_system_optimized_with_genetic_algorithms_for_short_term_traffic_congestion_prediction","260543527_Localized_Extended_Kalman_Filter_for_Scalable_Real-Time_Traffic_State_Estimation"]}