{"id":"325993841_Utilisation_of_the_conceive-design-implement-operate_framework_in_a_mechanical_engineering_capstone_project","abstract":"The Conceive-Design-Implement-Operate framework was initiated around 20 years ago at Massachusetts Institute of Technology (MIT) in order to reform engineering education to cope with the latest needs and challenges available in the industry. MIT researchers thought of the set of skills that graduates would need to have upon graduation. Then they developed the framework and syllabus, and then ran it through pilot programmes to monitor and refine its underlying approaches. The framework takes into account students’ ‘Technical Knowledge and Reasoning’, ‘Personal and Professional Skills’, ‘Interpersonal Skills’ and ability to ‘Conceive-Design-Implement and Operate’ engineering system or processes. It is now well established with over 100 universities applying its concepts to enhance engineering education. The framework defines 12 standards, which are implemented to describe the frameworks structure. This framework has been applied to several modules (or courses) within Taylor’s School of Engineering. In particular, the present investigation discusses the application of this framework within the context of a Capstone Project module in the school’s Mechanical Engineering Programme. This module is a yearlong, 3rd year module within a 4-year engineering degree programme where students are tasked to design and build a complex engineering system. This paper discusses how the framework is used to enhance students’ ability to brainstorm and develop suitable and sustainable engineering design solutions for a specified design challenge. The paper will discuss what the students have accomplished in each part of the conceive-design-implement-operate framework stages, as well as how these techniques have enabled them to appropriately design an engineering solution in addition to the rubrics used to assess them in each part of the framework.","authors":["Melanie Yong Ze Siin","Satesh N Namasivayam","Mohammad Hosseini Fouladi","Mohammad AZ Mohd Zali"],"meta":["June 2018International Journal of Mechanical Engineering Education 48(1):030641901878302","DOI:10.1177/0306419018783023"],"references":["349002623_CDIO_BASED_ENGINEERING_DESIGN_AND_OPTIMIZATION_COURSE","315300898_Implementing_CDIO_Approach_in_preparing_engineers_for_Space_Industry","299655056_Implementation_of_CDIO_Approach_in_training_engineering_specialists_for_the_benefit_of_sustainable_development","283852866_Professional_development_of_Russian_HEIs'_management_and_faculty_in_CDIO_standards_application","282665955_Development_of_Biomimetic_Robots_in_the_EPS_Engineering_Programme_Capstone_Project","320492670_Automatic_Control_Education_in_a_CDIO_Perspective","317806807_Setting_Engineering_Students_Up_for_Success_in_the_21st_Century_Integrating_Gamification_and_Crowdsourcing_into_a_CDIO-based_Web_Design_Course","313407959_Pediatric_Medical_Device_Development_by_Surgeons_via_Capstone_Engineering_Design_Programs","311357961_A_case_study_on_the_implementation_of_the_conceive_-_Design_-_implement_-_Operate_framework","307014659_Infusing_industry_practices_into_an_engineering_captsone_project_A_learning_outcome_attainment_case_study"]}