{"id":"325908162_The_key_role_of_behaviour_in_animal_camouflage","abstract":"Animal camouflage represents one of the most important ways of preventing (or facilitating) predation. It attracted the attention of the earliest evolutionary biologists, and today remains a focus of investigation in areas ranging from evolutionary ecology, animal decision-making, optimal strategies, visual psychology, computer science, to materials science. Most work focuses on the role of animal morphology per se, and its interactions with the background in affecting detection and recognition. However, the behaviour of organisms is likely to be crucial in affecting camouflage too, through background choice, body orientation and positioning; and strategies of camouflage that require movement. A wealth of potential mechanisms may affect such behaviours, from imprinting and self-assessment to genetics, and operate at several levels (species, morph, and individual). Over many years there have been numerous studies investigating the role of behaviour in camouflage, but to date, no effort to synthesise these studies and ideas into a coherent framework. Here, we review key work on behaviour and camouflage, highlight the mechanisms involved and implications of behaviour, discuss the importance of this in a changing world, and offer suggestions for addressing the many important gaps in our understanding of this subject.","authors":["Martin Stevens","Graeme Ruxton"],"meta":["June 2018Biological reviews of the Cambridge Philosophical Society 94(July)","DOI:10.1111/brv.12438"],"references":["324789554_Use_flexibility_of_perch_types_by_the_branch-camouflaged_Common_Potoo_Nyctibius_griseus_Why_this_bird_may_occasionally_dare_to_perch_on_artificial_substrates","323582090_Tadpoles_respond_to_background_colour_under_threat","322592488_Hiding_in_plain_sight_Leaf_beetles_Chrysomelidae_Galerucinae_use_feeding_damage_as_a_masquerade_decoy","322075616_Shelter_availability_mediates_decorating_in_the_majoid_crab_Camposcia_retusa","322061681_Positioning_behavior_according_to_individual_color_variation_improves_camouflage_in_novel_habitats","320581541_Habitat-dependent_niche_partitioning_between_colour_morphs_of_the_algal-dwelling_shrimp_Hippolyte_obliquimanus","320323014_Through_predators'_eyes_Phenotype-environment_associations_in_shore_crab_coloration_at_different_spatial_scales","321160368_Behavioral_adaptations_of_cryptic_moths_VI_Further_experimental_studies_on_bark-like_species","321018540_Behavioral_adaptations_of_cryptic_moths_I_Preliminary_studies_on_bark-like_species","320554744_Body_size_and_evolution_of_motion_dazzle_coloration_in_lizards"]}