{"id":"325930433_e-Learning_in_Higher_Education_Exploratory_Survey_among_Romanian_Students","abstract":"Internet and the related Information and Communications Technologies (the ICTs) has\nbecome an important component of teaching and learning in higher education. The concept of e-Learning is subject to constant change and can be defined as a learning system based on formalised teaching with the help of electronic resources. E-Learning systems can include fully online, mixed mode (also known as Blended Learning) or web assisted courses and there are numerous tools and features at the disposal of students and universities teachers. The main objective of this paper was to highlight the role of and the need for e-Learning in Romanian higher education. In order to achieve this aim, two\nmain research activities were carried out. First, an extensive literature review was performed for understanding the e-Learning technologies and their applications in academic environment. Second, an exploratory research was developed to identify the students' education preference, perception regarding e-Learning effectiveness and their readiness to its adoption. A structured questionnaire was designed and applied to the graduated and undergraduate students of The Bucharest University of Economic Studies. The quantitative data was analysed using descriptive statistics and other tools available in Statistical Packages for the Social Sciences (SPSS). Results of the survey revealed the positive attitudes towards e-Learning and technology-mediated education, especially among graduated students. Participants of survey also considered that e-Learning enhances the understanding of course content and improve collaboration and interactivity between students and teachers. These findings allow to draw suggestions for future research directions and recommendations regarding e-Learning implementation in Romanian higher education.","authors":["Mihai Felea","Irina Albastroiu Nastase","Cristinel Vasiliu","Bogdan Georgescu"],"meta":["May 2018","Conference: The 14th International Scientific Conference eLearning and Software for EducationAt: Bucharest, Romania"],"references":["321097139_E-Learning_in_Higher_Education_Institutions_and_Its_Determinants","320470021_An_Overview_of_E-learning_Platforms_for_Transport_and_Intermodality","312146845_The_Relevance_of_E-Learning_in_Higher_Education","272021412_Engaging_e-Learning_in_Higher_Education_Issues_and_Challenges","267976210_Critical_success_factors_in_e-learning-an_empirical_study","313706668_Blended_learning_systems_Definition_current_trends_and_future_directions","312146612_The_Relevance_of_E-Learning_in_Higher_Education","233453586_E_-_Learning_in_higher_education_Some_key_aspects_and_their_relationship_to_approaches_to_study","223791272_A_task-technology_fit_view_of_learning_management_system_impact","222828606_Critical_success_factors_for_e-learning_acceptance_Confirmatory_factor_models"]}