{"id":"325932686_Convolutional_neural_networks_an_overview_and_application_in_radiology","abstract":"Convolutional neural network (CNN), a class of artificial neural networks that has become dominant in various computer vision tasks, is attracting interest across a variety of domains, including radiology. CNN is designed to automatically and adaptively learn spatial hierarchies of features through backpropagation by using multiple building blocks, such as convolution layers, pooling layers, and fully connected layers. This review article offers a perspective on the basic concepts of CNN and its application to various radiological tasks, and discusses its challenges and future directions in the field of radiology. Two challenges in applying CNN to radiological tasks, small dataset and overfitting, will also be covered in this article, as well as techniques to minimize them. Being familiar with the concepts and advantages, as well as limitations, of CNN is essential to leverage its potential in diagnostic radiology, with the goal of augmenting the performance of radiologists and improving patient care.\n\nKey points: \n• Convolutional neural network is a class of deep learning methods which has become dominant in various computer vision tasks and is attracting interest across a variety of domains, including radiology. • Convolutional neural network is composed of multiple building blocks, such as convolution layers, pooling layers, and fully connected layers, and is designed to automatically and adaptively learn spatial hierarchies of features through a backpropagation algorithm. • Familiarity with the concepts and advantages, as well as limitations, of convolutional neural network is essential to leverage its potential to improve radiologist performance and, eventually, patient care.","authors":["Rikiya Yamashita","Mizuho Nishio","Richard Kinh Gian Do","Kaori Togashi"],"meta":["June 2018Insights into Imaging 9(4)","DOI:10.1007/s13244-018-0639-9"],"references":["321117067_3D_multi-view_convolutional_neural_networks_for_lung_nodule_classification","320241478_DeepLesion_Automated_Deep_Mining_Categorization_and_Detection_of_Significant_Radiology_Image_Findings_using_Large-Scale_Clinical_Lesion_Annotations","322319200_Methodologic_Guide_for_Evaluating_Clinical_Performance_and_Effect_of_Artificial_Intelligence_Technology_for_Medical_Diagnosis_and_Prediction","322058942_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","321988079_Improving_Arterial_Spin_Labeling_by_Using_Deep_Learning","321759252_Diagnostic_Assessment_of_Deep_Learning_Algorithms_for_Detection_of_Lymph_Node_Metastases_in_Women_With_Breast_Cancer","321082314_Deep_Learning_to_Classify_Radiology_Free-Text_Reports","320673701_Deep_Learning_with_Convolutional_Neural_Network_for_Differentiation_of_Liver_Masses_at_Dynamic_Contrast-enhanced_CT_A_Preliminary_Study","319916613_Deep_Learning_MR_Imaging-based_Attenuation_Correction_for_PETMR_Imaging","319770387_Deep_Sparse_Rectifier_Neural_Networks"]}