{"id":"325926484_Teaching_social_work_supervision_to_part-time_students_of_distance_studies_challenges_and_opportunities","abstract":"Supervision provides a forum for social workers to reflect on their practice with respect to increasing the quality of their work. To fulfil the objective of supervision, some conditions are needy: first of all, a confidential relationship between supervisor and supervisee and, second, a safe and supportive environment. It is a question whether it is possible to cover such demanding conditions when teaching supervision to part-time students of distance studies. The aim of this article is thus to discuss the challenges and opportunities of teaching social work supervision in the form of blended learning where diverse elements of distance learning are used (e.g. rare face-to-face contact with teachers and other students, online written assignments and online feedback replacing the face-to-face contact of the full-time students). The author shares her experience from the teaching of a one-term course of supervision at the master’s level of the Social Work part-time distance studies programme. The analysis of the students’ written reflections of the Balint supervision group session shows that, even within the above-mentioned form of education, it is possible to fulfil a specific level of the main supervision objectives. Some suggestions for optimizing this supervision method within the distance studies are presented in the conclusion.","authors":["Mirka Nečasová"],"meta":["June 2018Social Work Education 37(2):1-15","DOI:10.1080/02615479.2018.1487549"],"references":["254093049_Classic_Balint_Group_Work_and_the_Thinking_of_WR_Bion_How_Balint_Work_Increases_the_Ability_to_Think_One's_Own_Thoughts","347495149_Supervision_in_the_Mental_Health_Professions_A_Practitioner's_Guide","346959145_Supervising_the_Counsellor_A_Cyclical_Model","308490946_IRRODL_Volume_5_Number_2","298720876_Supervision_in_Social_Work","290005810_Blended_Learning_and_Sense_of_Community_A_Comparative_Analysis_with_Traditional_and_Fully_Online_Graduate_Courses","284915341_Personal_and_professional_development","261325467_Revisiting_Balint's_innovation_Enhancing_capacity_in_collaborative_mental_health_care","256620583_Kompetence_v_praxi_socialni_prace","240339984_Focused_Countertransference_Exploration_in_Classroom_Teaching_of_Modern_Psychoanalytic_Candidates","221727005_Transcultural_issues_in_the_dynamics_of_a_Balint_clinical_reflection_group_for_community_mental_health_workers","40346497_Nebezpeci_moci_v_pomahajicich_profesich"]}