{"id":"325937079_Hybrid_parallelization_of_a_multi-tree_path_search_algorithm_Application_to_highly-flexible_biomolecules","abstract":"The study of the conformational energy landscape of a molecule is essential for the understanding of its physicochemical properties. This requires the exploration of a continuous, high-dimensional space to identify the most probable conformations and the transition paths between them. The problem is computationally difficult, in particular for highly-flexible biomolecules such as Intrinsically Disordered Proteins (IDPs). In recent years, a robotics-inspired algorithm called Transition-based Rapidly-exploring Random Tree (TRRT) has been proposed to solve this problem, and has been shown to provide good results with small and middle-sized biomolecules. Aiming to treat larger systems, we propose a hybrid strategy for the efficient parallelization of a multi-tree variant of TRRT, called Multi-TRRT, enabling an efficient execution in (possibly large) computer clusters. The parallel algorithm uses OpenMP multi-threading for computation inside each multi-core processor and MPI to perform the communication between processors. Results show a near-linear speedup for a wide range of cluster configurations. Although the paper mainly deals with the application of the proposed parallel algorithm to the investigation of biomolecules, the explanations concerning the methods are general, aiming to inspire future work on the parallelization of related algorithms.","authors":["Alejandro Estaña","Kevin Molloy","Marc Vaisset","Nathalie Sibille"],"meta":["June 2018Parallel Computing 77","DOI:10.1016/j.parco.2018.06.005"],"references":["275718031_Characterizing_Energy_Landscapes_of_Peptides_Using_a_Combination_of_Stochastic_Algorithms","264859668_A_multi-tree_extension_of_the_Transition-based_RRT_Application_to_ordering-and-pathfinding_problems_in_continuous_cost_spaces","263620565_Visualization_of_arrestin_recruitment_by_a_G_Protein-Coupled_Receptor","260709814_C-FOREST_Parallel_shortest_path_planning_with_superlinear_speedup","313078844_The_developmentapplication_of_the_minimalist_organicbiochemical_molecular_mechanic_force_field_using_a_combination_of_ab_initio_calculations_and_experimental_data","309475317_Small-angle_scattering_studies_of_intrinsically_disordered_proteins_and_their_complexes","301972163_Parallelization_of_MD_Algorithms_and_Load_Balancing","266398651_Scalable_Multicore_Motion_Planning_Using_Lock-Free_Concurrency","261434744_A_scalable_distributed_RRT_for_motion_planning","257659886_Motion_planning_algorithms_for_molecular_simulations_A_survey"]}