{"id":"325942647_The_impact_of_individual_heterogeneity_on_the_coupled_awareness-epidemic_dynamics_in_multiplex_networks","abstract":"Awareness of disease outbreaks can trigger changes in human behavior and has a significant impact on the spread of epidemics. Previous studies usually considered the coupled awareness-epidemic dynamics to be two competing processes that interact in the information and epidemic layers. However, these studies mostly assumed that all aware individuals have the same reduced infectivity and that different neighbors have the same influence on one's perception, ignoring the heterogeneity of individuals. In this paper, we propose a coupled awareness-epidemic spreading model in multiplex networks incorporating three types of heterogeneity: (1) the heterogeneity of individual responses to disease outbreaks, (2) the influence heterogeneity in the epidemic layer, and (3) the influence heterogeneity in the information layer. The theoretical analysis shows that the influence heterogeneity in the information layer has two-stage effects on the epidemic threshold. Moreover, we find that the epidemic threshold in the higher stage depends on the heterogeneity of individual responses and the influence heterogeneity in the epidemic layer, while the epidemic threshold in the lower stage is independent of awareness spreading and individual behaviors. The results give us a better understanding of how individual heterogeneity affects epidemic spreading and provide some practical implications for the control of epidemics.","authors":["Yaohui Pan","Zhijun Yan"],"meta":["June 2018Chaos (Woodbury, N.Y.) 28(6):063123","DOI:10.1063/1.5000280"],"references":["307833833_An_innovative_influenza_vaccination_policy_targeting_last_season's_patients","301579082_Epidemic_spreading_with_activity-driven_awareness_diffusion_on_multiplex_network","301244032_Suppressing_disease_spreading_by_using_information_diffusion_on_multiplex_networks","287249930_Predicting_the_epidemic_threshold_of_the_susceptible-infected-recovered_model","282310379_Impacts_of_complex_behavioral_responses_on_asymmetric_interacting_spreading_dynamics_in_multiplex_networks","280537968_Coupled_disease-behavior_dynamics_on_complex_networks_A_review","319659255_The_impact_of_multiple_information_on_coupled_awareness-epidemic_dynamics_in_multiplex_networks","305809093_Competing_spreading_processes_and_immunization_in_multiplex_networks","304107239_Effect_of_individual_behavior_on_the_interplay_between_awareness_and_disease_spreading_in_multiplex_networks","289366010_Changing_climates_of_conflict_A_social_network_experiment_in_56_schools"]}