{"id":"325965745_Mobile_Learning_Readiness_among_English_Language_Learners_at_a_Public_University_in_Malaysia","abstract":"A critical factor for English language researchers and practitioners to consider when designing and implementing mobile-based learning solutions, is students’ readiness to embrace the educational use of mobile technology. Despite the increasing popularity of mobile technology in Malaysia, little is known about whether students are ready if such technology is to be integrated in their lessons. This paper aims to investigate the mobile learning readiness among English language learners in a Malaysian university. A quantitative survey approach was used in this study by adapting Parasuraman’s Technology Readiness Index (TRI). Questionnaires were distributed to 68 undergraduates from various study fields who were undertaking English language courses in the university. The study reveals, that the respondents are moderately ready \nfor mobile technology. Although they are highly optimistic, their perceptions pertaining to innovativeness towards the technology are relatively moderate. They also have moderate discomfort and feeling of insecurity in using mobile technology. There are significant positive correlations between positive constructs (optimism and innovativeness) and overall TRI. However, there are no significant correlations between negative constructs (discomfort and insecurity) and overall TRI. This study highlights the importance for English language learning providers to consider students’ beliefs and predispositions in adopting a technological learning approach in their teaching. A deeper understanding of students’ readiness for mobile learning may facilitate efforts to enhance the teaching and learning of English language by the use of mobile technology.","authors":["Munir Shuib","Siti Norbaya Azizan","Malini Ganapathy"],"meta":["September 2018Pertanika Journal of Social Science and Humanities 26(3):1491-1504","Project: Intelligent mobile learning tool for grammar learning (I-MoL TOOL)"],"references":["322488153_A_Holistic_Mobile_Security_Framework_for_Nigeria","321034523_Teacher_Training_and_PD_in_Mobile_Pedagogy_for_English_Language_Teaching","318257775_Enhancing_Oral_Communication_Skills_Using_Mobile_Phones_Among_Undergraduate_English_Language_Learners_in_Malaysia","305663436_Mobile_Learning_in_Malaysian_Universities_Are_Students_Ready","295136119_Mobile_Learning_in_Southeast_Asia_Opportunities_and_Challenges","285767902_Security_and_privacy_in_m-learning_and_beyond_Challenges_and_state-of-the-art","280239113_ICT_in_the_changing_landscape_of_higher_education_in_Southeast_Asia","276303606_Designing_an_Intelligent_Mobile_Learning_Tool_for_Grammar_Learning_i-MoL","309476418_The_moving_finger_writes_and_having_writInternational_Review_of_Research_in_Open_and_Distance_Learning","291922755_Technology_readiness_index_TRI_among_USM_distance_education_students_according_to_age"]}