{"id":"325924314_The_New_Virtues_of_Engineering_and_the_Need_for_Change_in_the_Engineering_Curriculum","abstract":"Since ancient times and definitely since the industrial revolution, architects and engineers cultivated their introspective pleasures of solitary reasoning in search for innovative solutions. Mechanical design departments were the sanctum in the headquarters of the firms. Engineers were no men (exclusively) of words but of genius. Their ingenuity was encoded into technical drawings in china ink on A0 transparent paper. If electronics came into play it was added later, and if even some programming was involved, the code was developed and implemented right before the system was put into operation. Now these days are over. A new breed of people took the lead out of the hands of the mechanical engineers. They hold a degree in mechatronics and they play the game according to different rules. Their office walls are cluttered with abstract diagrams naming components and interfaces-naming, not showing-this difference is important! They talk and talk to people they call stakeholders, mainly from outside the company. They think in use-cases and product architecture-not in geometry. Instead of 3D-CAD they use Powerpoint-together with some fancy database-applications. They dispute all day long about product architecture, product line approach and platforms. And they are pretty sure that the decisions taken are highly value adding. The detail-design is carried out by some contractor from Far East-right before the system is put into operation. Since today's products reach out much further by connection to the internet, they include sensor data from worldwide sources, from satellites and cameras. This spills out a cornucopia of new functionality over the engineering departments. But the bigger the offering, the harder it gets to choose the right set of functions that really suites the needs of users. This new game of product development requires new virtues of engineering, like abstract thinking, logical modelling, and empathy for customers, users and colleagues from other disciplines, to name a few. Especially in times of ubiquitous use of 3D-CAD, technical universities return to old-school tools like pencil and paper. But I pledge strongly to overcome these old days of the nerd farm. We have to attract a new breed of people and train them to develop the new set of virtues necessary for coping with the future demands of engineering. There's nothing bad with pencil and paper but we should use them for conceptual work, for sketching the far future of things and services. In this paper the new set of virtues is derived from the demands on the markets, the society, and on the engineering field. It is shown how leading Universities and Engineering Schools take on new forms of teaching to educate young people for developing these new virtues.","authors":["Hanno Weber"],"meta":["January 2017","Projects: Higher EducationSystems Engineering for Small Enterprises"],"references":[]}