{"id":"325994489_Experiments_in_Artificial_Theory_of_Mind_From_Safety_to_Story-Telling","abstract":"Theory of mind is the term given by philosophers and psychologists for the ability to form a predictive model of self and others. In this paper we focus on synthetic models of theory of mind. We contend firstly that such models—especially when tested experimentally—can provide useful insights into cognition, and secondly that artificial theory of mind can provide intelligent robots with powerful new capabilities, in particular social intelligence for human-robot interaction. This paper advances the hypothesis that simulation-based internal models offer a powerful and realisable, theory-driven basis for artificial theory of mind. Proposed as a computational model of the simulation theory of mind, our simulation-based internal model equips a robot with an internal model of itself and its environment, including other dynamic actors, which can test (i.e., simulate) the robot's next possible actions and hence anticipate the likely consequences of those actions both for itself and others. Although it falls far short of a full artificial theory of mind, our model does allow us to test several interesting scenarios: in some of these a robot equipped with the internal model interacts with other robots without an internal model, but acting as proxy humans; in others two robots each with a simulation-based internal model interact with each other. We outline a series of experiments which each demonstrate some aspect of artificial theory of mind.","authors":["Alan F T Winfield"],"meta":["June 2018Frontiers in Robotics and AI 5","DOI:10.3389/frobt.2018.00075"],"references":["330296749_The_Dark_Side_of_Ethical_Robots","326426729_Anticipation_in_Robotics","322859319_The_Grand_Challenges_of_Science_Robotics","322388451_Simulation-Based_Internal_Models_for_Safer_Robots","318394753_When_Robots_Tell_Each_Other_Stories_The_Emergence_of_Artificial_Fiction","317126510_An_architecture_for_ethical_robots_inspired_by_the_simulation_theory_of_cognition","344487023_Simulating_Minds","334900059_Theory_of_Mind","328659598_Engineering_Simulations_as_Scientific_Instruments_A_Pattern_Language_With_Kieran_Alden_Paul_S_Andrews_James_L_Bown_Alastair_Droop_Richard_B_Greaves_Mark_Read_Adam_T_Sampson_Jon_Timmis_Alan_FT_Winfield","323355576_Machine_Theory_of_Mind"]}