{"id":"325964994_University_Education_vs_Students'_Productivity_in_Computing_The_Environment_as_a_Judge","abstract":"Many have had high expectations for the impact of computing education on societal development. By and large, these expectations have not been realized. It has become evident that several factors such as learning environment have tremendous influence in the quality of teaching students receive and the extent of attention they pay to lessons in school. This implies that schools with ill-equipped environments hardly put in the best in their students especially in the area of computing. This scenario has been among the primary reasons for low productivity of students in computing. To this effect, this study investigated the influence of the learning environment on students' productivity in computing. Three research questions were formulated and one hypothesis was tested. The study employed the survey design. The sample comprised of one hundred and fifty (150) respondents randomly drawn from the Department of Computer Science and Computer Education, University of Benin. Researchers' self-developed environmental questionnaire (SMQ) was used to elicit information from the respondents. Data collected was analyzed using mean rating and standard deviation while t-test was used to test the hypothesis for significance at 0.05. The results of our data analysis revealed that the learning environment is very important for better output in academic pursuits. Based on these findings, some relevant recommendations were made.","authors":["Obienu A. C","Frank Amadin"],"meta":["May 2018"],"references":["284483237_Boosting_student_achievement_New_research_on_the_power_of_developmental_assets","316224145_Psychology_for_Teachers","312900079_Organizational_health_directly_influences_student_performance_at_the_middle_level","272177691_Cronbach's_Alpha_A_Tool_for_Assessing_the_Reliability_of_Scales","234587044_The_Psychological_Environment_of_the_School_A_Focus_for_School_Leadership_Project_Report","233066081_Rethinking_perceived_service_quality_An_alternative_to_hierarchical_and_multidimensional_models","232464210_Learning_and_memory_2nd_ed"]}