{"id":"325966153_Research_Commentary_Setting_a_Definition_Context_and_Theory-Based_Research_Agenda_for_the_Gamification_of_Non-Gaming_Applications","abstract":"As a nascent area of study, gamification has attracted the interest of researchers in several fields, but little attention has been focused on creating a theoretical foundation for gamification research. The basic idea of gamification is to use game-like features in non-game contexts to motivate users and improve performance outcomes. As a boundary-spanning subject by nature, gamification has drawn the interest of scholars from diverse communities, including information systems, education, marketing, computer science, and business administration. To establish a theoretical foundation, it is important to clearly define and explain gamification in comparison with similar concepts and areas of research. Likewise, it is important to define the scope of the domain and develop a research agenda that explicitly takes into account the important role of theory. In this review article, we have set forth the pre-theoretical structures necessary for theory-building in this area. Accordingly, we engaged an interdisciplinary group of discussants to evaluate and select the most relevant theories for gamification. Moreover, we developed exemplary research questions to help create a research agenda for gamification. We conclude that using a multi-theoretical perspective in the creation of a research agenda should help and encourage IS researchers to take a lead role in this promising and emerging area.","authors":["Horst Treiblmaier","Lisa-Maria Putz","Paul Benjamin Lowry"],"meta":["June 2018","DOI:10.17705/1thci.00107","Projects: GamificationSocial media and HCI"],"references":["354726859_Usage_of_Hedonic_Web_Instruments","327198883_Gamification_for_Health_and_WellbeingA_Systematic_Review_of_the_Literature","326672226_Improvement_of_healthy_lifestyle_habits_in_university_students_through_a_gamification_approach","326200322_Field_Trips_for_Sustainable_Transport_Education_Impact_on_Knowledge_Attitude_and_Behavioral_Intention","325450967_A_Systematic_Review_of_Gamification_Research_In_Pursuit_of_Homo_Ludens","323379691_Gamified_Workshops_as_Drivers_for_Attitudinal_and_Behavioral_Shifts_toward_Sustainable_Business_Practices_The_Role_of_Enjoyment_Curiosity_and_External_Regulation","322797402_Gamification_of_the_work_floor_A_literature_review_of_gamifying_production_and_logistics_operations","326309725_Cybersecurity_Skills_Training_An_Attacker-Centric_Gamified_Approach","319993469_Experiential_Metaphors_in_Abstract_Games","319965557_What_is_Gamification_in_Learning_and_Education"]}