{"id":"326088707_Assessment_of_skin-friction-reduction_techniques_on_a_turbulent_wing_section","abstract":"The scope of the present project is to quantify the effects of uniform blowing and body-force damping on turbulent boundary layers subjected to a non-uniform adverse-pressure-gradient distribution. To this end, well-resolved large-eddy simulations are employed to describe the flow around the NACA4412 airfoil at moderate Reynolds number 200, 000 based on free-stream velocity and chord length. In the present paper we focus on uniform blowing and the conference presentation will include a comparison with body-force damping applied in the same region. The inner-scaled profiles of the mean velocity and of selected components of the Reynolds-stress tensor are examined and compared with the uncontrolled cases. It is known that uniform blowing and adverse-pressure gradients share some similarities in their effect on the boundary layers , and our results will show that these effects are not independent. The behaviour of the skin-friction coefficient is analyzed through the FIK decomposition, and the impact of this control strategy on the aerodynamic efficiency of the airfoil is discussed.","authors":["Marco Atzori","Ricardo Vinuesa","Alexander Stroh","Bettina Frohnapfel"],"meta":["June 2018","Conference: 12th ERCOFTAC Symp. on Engineering Turbulence Modeling and Measurements (ETMM12), Montpellier, France, September 26{28"],"references":["324865655_Turbulent_boundary_layers_around_wing_sections_up_to_Rec_1000000","319036381_Revisiting_History_Effects_in_Adverse-Pressure-Gradient_Turbulent_Boundary_Layers","318366603_Skin-friction_control_of_the_flow_around_a_wing_section_through_uniform_blowing","315741966_History_effects_and_near-equilibrium_in_adverse-pressure-gradient_turbulent_boundary_layers","284203141_On_the_identification_of_a_vortex","313050669_Turbulent_Boundary_Layers_in_Adverse_Pressure_Gradients","301842218_Global_effect_of_local_skin_friction_drag_reduction_in_spatially_developing_turbulent_boundary_layer","301243898_On_determining_characteristic_length_scales_in_pressure-gradient_turbulent_boundary_layers","279461078_Effect_of_uniform_blowingsuction_in_a_turbulent_boundary_layer_at_moderate_Reynolds_number","265193591_TEE_VARIATION_WITH_REYNOLDS_NUMBER_OF_PRESSURE_DISTRIBUTION_OVER_AN_AIRFOIL_SECTION"]}