{"id":"326039675_A_Critical_Review_of_Consumer_Wearables_Mobile_Applications_and_Equipment_for_Providing_Biofeedback_Monitoring_Stress_and_Sleep_in_Physically_Active_Populations","abstract":"The commercial market for technologies to monitor and improve personal health and sports performance is ever expanding. A wide range of smart watches, bands, garments, and patches with embedded sensors, small portable devices and mobile applications now exist to record and provide users with feedback on many different physical performance variables. These variables include cardiorespiratory function, movement patterns, sweat analysis, tissue oxygenation, sleep, emotional state, and changes in cognitive function following concussion. In this review, we have summarized the features and evaluated the characteristics of a cross-section of technologies for health and sports performance according to what the technology is claimed to do, whether it has been validated and is reliable, and if it is suitable for general consumer use. Consumers who are choosing new technology should consider whether it (1) produces desirable (or non-desirable) outcomes, (2) has been developed based on real-world need, and (3) has been tested and proven effective in applied studies in different settings. Among the technologies included in this review, more than half have not been validated through independent research. Only 5% of the technologies have been formally validated. Around 10% of technologies have been developed for and used in research. The value of such technologies for consumer use is debatable, however, because they may require extra time to set up and interpret the data they produce. Looking to the future, the rapidly expanding market of health and sports performance technology has much to offer consumers. To create a competitive advantage, companies producing health and performance technologies should consult with consumers to identify real-world need, and invest in research to prove the effectiveness of their products. To get the best value, consumers should carefully select such products, not only based on their personal needs, but also according to the strength of supporting evidence and effectiveness of the products.","authors":["Jonathan M. Peake","Graham K Kerr","John P Sullivan"],"meta":["June 2018Frontiers in Physiology 9","DOI:10.3389/fphys.2018.00743"],"references":["323375064_Three-dimensional_multiple_object_tracking_in_the_pediatric_population_The_NeuroTracker_and_its_promising_role_in_the_management_of_mild_traumatic_brain_injury","322690563_Performance_comparison_of_the_MOXY_and_PortaMon_near-infrared_spectroscopy_muscle_oximeters_at_rest_and_during_exercise","320963222_Wearable_Technology_for_Athletes_Information_Overload_and_Pseudoscience","320821579_Emerging_Wearable_Physiological_Monitoring_Technologies_and_Decision_Aids_for_Health_Performance","320453780_Portable_biosensor_for_monitoring_cortisol_in_low-volume_perspired_human_sweat","319600901_Position_Affects_Performance_in_Multiple-Object_Tracking_in_Rugby_Union_Players","318569476_Validation_of_brain-derived_signals_in_near-infrared_spectroscopy_through_multivoxel_analysis_of_concurrent_functional_magnetic_resonance_imaging_Validation_of_NIRS_Signals_by_Concurrent_fMRI","321958542_Feeling_validated_yet_A_scoping_review_of_the_use_of_consumer-targeted_wearable_and_mobile_technology_to_measure_and_improve_sleep","321786264_A_validation_study_of_Fitbit_Charge_2_compared_with_polysomnography_in_adults","317689071_Dynamic_Model_of_Athletes'_Emotions_Based_on_Wearable_Devices"]}