{"id":"326028545_Satisfaction_Practices_and_Influences_in_Agile_Software_Development","abstract":"The principles behind the Agile Manifesto begin with \"Our highest priority is to satisfy the customer...\". It also states that Agile projects should be build around motivated and self-organized teams, which might also lead to more satisfied developers. Several studies indeed report an increased job satisfaction by anecdotal evidence. In this paper we address the topic of satisfaction by in-depth analysis of the results of a nationwide survey about software development in Switzerland. We wanted to find out if satisfaction depends on the applied development method, and, more concrete, how satisfaction relates to other elements in the development process, including the use of various practices, and the influences on business, team and software issues. We found that higher satisfaction is reported more by those using Agile development than with plan-driven processes. We explored the different perspectives of developers and those with a management role and found a high consistency of satisfaction between Agile developers and Agile management, and big differences with using working plan-driven methods. We found that certain practices and influences have high correlations to satisfaction, and that collaborative processes are closely related to satisfaction, especially when combined with technical practices. Applying recursive partitioning, we found which elements were most important for satisfaction, and gained insight about how practices and influences work in combination. We also explored the relationship between satisfaction and personal experience with Agile development. Our results in this analysis are principally descriptive, but we think they can be a relevant contribution to understand the challenges for everyone involved in Agile development, and can help in the transformation to Agile.","authors":["Martin Kropp","Andreas Meier","Craig Anslow","Robert Biddle"],"meta":["June 2018","DOI:10.1145/3210459.3210470","Conference: 22nd International Conference on Evaluation and Assessment in Software Engineering (EASE)At: Christchurch, NZ","Project: Swiss Agile Study"],"references":["308596596_Teamwork_Quality_and_Project_Success_in_Software_Development_A_Survey_of_Agile_Development_Teams","303144525_Job_Satisfaction_in_Agile_Development_Teams_Agile_Development_as_Work_Redesign","277685000_Swiss_Agile_Study_2014","260649018_Self-Organizing_Roles_on_Agile_Software_Development_Teams","257391318_Successful_extreme_programming_Fidelity_to_the_methodology_or_good_teamworking","235665541_An_introduction_to_Recursive_Partitioning_Using_the_RPART_Routines","261958605_Toward_an_Understanding_of_Job_Satisfaction_on_Agile_Teams_Agile_Development_as_Work_Redesign","258453991_Collaboration_Communication_and_Co-ordination_in_Agile_Software_Development_Practice","245457284_Applying_the_GoalQuestionMetric_Paradigm_in_the_Experience_Factory","235961479_Classification_and_Regression_Trees"]}