{"id":"326076180_Distribution_shapes_govern_the_discovery_of_predictive_models_for_gene_regulation","abstract":"Despite substantial experimental and computational efforts, mechanistic modeling remains more predictive in engineering than in systems biology. The reason for this discrepancy is not fully understood. One might argue that the randomness and complexity of biological systems are the main barriers to predictive understanding, but these issues are not unique to biology. Instead, we hypothesize that the specific shapes of rare single-molecule event distributions produce substantial yet overlooked challenges for biological models. We demonstrate why modern statistical tools to disentangle complexity and stochasticity, which assume normally distributed fluctuations or enormous datasets, do not apply to the discrete, positive, and nonsymmetric distributions that characterize mRNA fluctuations in single cells. As an example, we integrate single-molecule measurements and advanced computational analyses to explore mitogen-activated protein kinase induction of multiple stress response genes. Through systematic analyses of different metrics to compare the same model to the same data, we elucidate why standard modeling approaches yield nonpredictive models for single-cell gene regulation. We further explain how advanced tools recover precise, reproducible, and predictive understanding of transcription regulation mechanisms, including gene activation, polymerase initiation, elongation, mRNA accumulation, spatial transport, and decay.","authors":["Brian Munsky","Guoliang Li","Zachary Fox","Douglas P. Shepherd"],"meta":["June 2018Proceedings of the National Academy of Sciences 115(29):201804060","DOI:10.1073/pnas.1804060115"],"references":["294277031_Dynamics_of_epigenetic_regulation_at_the_single-cell_level","284246776_Single-Cell_Genomics_Unveils_Critical_Regulators_of_Th17_Cell_Pathogenicity","310610253_Synthetic_recording_and_in_situ_readout_of_lineage_information_in_single_cells","308121793_High-throughput_single-cell_gene-expression_profiling_with_multiplexed_error-robust_fluorescence_in_situ_hybridization","306345957_Finite_state_projection_based_bounds_to_compare_chemical_master_equation_models_using_single-cell_data","301932981_Real-time_quantification_of_single_RNA_translation_dynamics_in_living_cells","301719306_Exploiting_Natural_Fluctuations_to_Identify_Kinetic_Mechanisms_in_Sparsely_Characterized_Systems","297743078_Measurement_of_Gene_Regulation_in_Individual_Cells_Reveals_Rapid_Switching_Between_Promoter_States","290495323_Control_of_Transcript_Variability_in_Single_Mammalian_Cells","283555522_Systems_biology_UN_Certainties"]}