{"id":"326027425_IMAGING_In-Memory_AlGorithms_for_Image_processiNG","abstract":"Data-intensive applications such as image processing suffer from massive data movement between memory and processing units. The severe limitations on system performance and energy efficiency imposed by this data movement are further exacerbated with any increase in the distance the data must travel. This data transfer and its associated obstacles could be eliminated by the use of emerging non-volatile resistive memory technologies (memristors) that make it possible to both store and process data within the same memory cells. In this paper, we propose four in-memory algorithms for efficient execution of fixed point multiplication using MAGIC gates. These algorithms achieve much better latency and throughput than a previous work and significantly reduce the area cost. They can thus be feasibly implemented inside the size-limited memory arrays. We use these fixed point multiplication algorithms to efficiently perform more complex in-memory operations such as image convolution and further show how to partition large images to multiple memory arrays so as to maximize the parallelism. All the proposed algorithms are evaluated and verified using a cycle-accurate and functional simulator. Our algorithms provide on average $200x$ better performance over state-of-the-art APIM, a processing in-memory architecture for data intensive applications.","authors":["Ameer Haj Ali","Rotem Ben-Hur","Nimrod Wald","Ronny Ronen"],"meta":["June 2018Circuits and Systems I: Regular Papers, IEEE Transactions on PP(99):1-14","DOI:10.1109/TCSI.2018.2846699"],"references":["323239859_Efficient_Algorithms_for_In-Memory_Fixed_Point_Multiplication_Using_MAGIC","319856813_In-Datacenter_Performance_Analysis_of_a_Tensor_Processing_Unit","319102986_Memristive_LogicA_framework_for_evaluation_and_comparison","316903105_PipeLayer_A_Pipelined_ReRAM-Based_Accelerator_for_Deep_Learning","324476133_Practical_Challenges_in_Delivering_the_Promises_of_Real_Processing-in-Memory_Machines","321813953_Simple_magic_Synthesis_and_in-memory_Mapping_of_logic_execution_for_memristor-aided_logic","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316898987_Compute_Caches","316876910_Ultra-Efficient_Processing_In-Memory_for_Data_Intensive_Applications","312336286_Memristive_memory_processing_unit_MPU_controller_for_in-memory_processing"]}