{"id":"326084761_Pro_Machine_Learning_Algorithms","abstract":"Bridge the gap between a high-level understanding of how an algorithm works and knowing the nuts and bolts to tune your models better. This book will give you the confidence and skills when developing all the major machine learning models. In Pro Machine Learning Algorithms, you will first develop the algorithm in Excel so that you get a practical understanding of all the levers that can be tuned in a model, before implementing the models in Python/R.\n\nYou will cover all the major algorithms: supervised and unsupervised learning, which include linear/logistic regression; k-means clustering; PCA; recommender system; decision tree; random forest; GBM; and neural networks. You will also be exposed to the latest in deep learning through CNNs, RNNs, and word2vec for text mining. You will be learning not only the algorithms, but also the concepts of feature engineering to maximize the performance of a model. You will see the theory along with case studies, such as sentiment classification, fraud detection, recommender systems, and image recognition, so that you get the best of both theory and practice for the vast majority of the machine learning algorithms used in industry. Along with learning the algorithms, you will also be exposed to running machine-learning models on all the major cloud service providers.\n\nYou are expected to have minimal knowledge of statistics/software programming and by the end of this book you should be able to work on a machine learning project with confidence. \n\nYou will:\n\n• Get an in-depth understanding of all the major machine learning and deep learning algorithms \n• Fully appreciate the pitfalls to avoid while building models\n• Implement machine learning algorithms in the cloud \n• Follow a hands-on approach through case studies for each algorithm\n• Gain the tricks of ensemble learning to build more accurate models\n• Discover the basics of programming in R/Python and the Keras framework for deep learning","authors":["V Kishore Ayyadevara"],"meta":["January 2018","DOI:10.1007/978-1-4842-3564-5","ISBN: 978-1-4842-3563-8"],"references":[]}