{"id":"326023772_The_role_of_deep_learning_and_radiomic_feature_extraction_in_cancer-specific_predictive_modelling_A_review","abstract":"This paper reviews objective methods for prognostic modelling of cancer tumours located within radiology images, a process known as radiomics. Radiomics is a novel feature transformation method for detecting clinically relevant features from radiological imaging data that are difficult for the human eye to perceive. To facilitate the detection machine learning and deep learning methods are increasingly investigated with the aim of improving patient diagnosis, treatment options and outcomes. A review of the relevant works in the expanding field of radiomics for survival prediction from cancer is provided. Research works outside the field of radiomics which define techniques that may be of future use to improve feature extraction and analysis are also reviewed. Radiomics is a rapidly advancing field of clinical image analysis with a vast potential for supporting decision making involved in the diagnosis and treatment of cancer. The realisation of this goal of more effective decision making requires significant individual and integrated expertise from domain experts in medicine, biology and computer science to allow advances in computer vision and machine learning techniques to be applied effectively. Deep learning combined with machine learning has the potential to advance the field of radiomics significantly in the years to come, provided that mechanisms for data sharing or distributed learning are established to increase the availability of data across all patient and tumour types.","authors":["Alanna Heather Therese Vial","David Stirling","Matthew Field","Montserrat Ros"],"meta":["June 2018Translational Cancer Research 7(3):803-816","DOI:10.21037/tcr.2018.05.02"],"references":["320887449_Clustering_of_multi-parametric_functional_imaging_to_identify_high-risk_subvolumes_in_non-small_cell_lung_cancer","320344963_A_Review_of_Convolutional_Neural_Networks_for_Inverse_Problems_in_Imaging","319858005_Development_and_clinical_application_of_radiomics_in_lung_cancer","319232643_Feature_selection_methodology_for_longitudinal_cone-beam_CT_radiomics","318460353_Deep_Learning_based_Radiomics_DLR_and_its_usage_in_noninvasive_IDH1_prediction_for_low_grade_glioma","318301989_Overview_of_deep_learning_in_medical_imaging","317133196_Infrastructure_and_distributed_learning_methodology_for_privacy-preserving_multi-centric_rapid_learning_health_care_euroCAT","323718863_Assessing_the_prognostic_impact_of_3D_CT_image_tumour_rind_texture_features_on_lung_cancer_survival_modelling","321584260_Classification_of_early_stage_non-small_cell_lung_cancers_on_computed_tomographic_images_into_histological_types_using_radiomic_features_interobserver_delineation_variability_analysis","317186931_Future_of_Medical_Physics_Real-time_MRI_guided_Proton_Therapy"]}