{"id":"326043909_Re-emergence_of_the_leaf_clip_gesture_during_an_alpha_takeover_affects_variation_in_male_chimpanzee_loud_calls","abstract":"Loud calls are used by many species as long-distance signals for group defense, mate attraction, and inter- and intragroup spacing. Chimpanzee loud calls, or pant hoots, are used in a variety of contexts including group coordination and during male contests. Here, we observed an alpha male takeover in wild chimpanzees ( Pan troglodytes verus ) during which the leaf clipping gesture re-emerged after disappearing for almost two years in this community. Leaf clipping only occurred in males and was observed almost exclusively prior to pant hoot vocalizations, as has been observed in other chimpanzee communities of the Taï forest in Côte d’Ivoire. Consequently, we hypothesized that leaf clipping may be important for male-male competition by affecting variation in the acoustic properties of male chimpanzee loud calls. We therefore investigated whether pant hoots preceded by leaf clipping differed acoustically from those without, while also testing the influence of social context on pant hoot variation, namely male dominance rank and hierarchy instability, i.e., before, during and after the alpha takeover. We found that pant hoots preceded by leaf clipping were longer, contained more call elements and drum beats, and lower fundamental and peak frequencies. Moreover, during the alpha takeover pant hoots were shorter, contained fewer drum beats and higher fundamental frequencies. Additionally, pant hoot and aggression rates were also highest during the alpha takeover with leaf clipping more likely to occur on days when pant hooting rates were high. Overall social rank had limited effects on pant hoot variation. We suggest that elevated arousal and aggression during the alpha takeover triggered the re-emergence of leaf clipping and the associated acoustic changes in pant hoots. Further research should focus on the potential mechanisms by which leaf clipping is connected to variation in pant hoots and cross-population comparisons of the behaviour.","authors":["Ammie Kalan","Christophe Boesch"],"meta":["June 2018PeerJ 6(1):e5079","DOI:10.7717/peerj.5079"],"references":["317390125_Wild_chimpanzees'_use_of_single_and_combined_vocal_and_gestural_signals","309921634_Acoustic_and_Temporal_Variation_in_Gelada_Theropithecus_gelada_Loud_Calls_Advertise_Male_Quality","301292648_Sexual_selection_on_male_vocal_fundamental_frequency_in_humans_and_other_anthropoids","296603149_The_relationship_between_testosterone_and_long-distance_calling_in_wild_male_chimpanzees","318393770_R_A_Language_and_Environment_for_Statistical_Computing","318393712_R_A_Language_and_Environment_for_Statistical_Computing","316360101_lme4_Linear_mixed-effects_models_using_Eigen_and_S4","311568872_Production_of_and_responses_to_unimodal_and_multimodal_signals_in_wild_chimpanzees_Pan_troglodytes_schweinfurthii","277773119_Energetic_Costs_of_Reproductive_Effort_in_Male_Chimpanzees","277664929_Generalized_Linear_Models_Monographs_on_Statistics_and_Applied_Probability_No_37","263352347_Fitting_Linear_Mixed-Effects_Models_Using_lme4","262771594_Social_and_ecological_correlates_of_long-distance_pant_hoot_calls_in_male_chimpanzees","260115271_Fallow_bucks_attend_to_vocal_cues_of_motivation_and_fatigue","263745998_The_Meanings_of_Chimpanzee_Gestures","262873378_Vocal_expression_of_emotions_in_mammals_Mechanisms_of_production_and_evidence"]}