{"id":"326040255_Pattern_Construction_for_Extracting_Domain_Terminology","abstract":"The extraction of domain terminology is a task that is increasingly used for different application processes of natural language such as\nthe information recovery, the creation of specialized corpus, question-answering systems, the creation of ontologies and the automatic\nclassification of documents. This task of the extraction of domain terminology is generally performed by generating patterns. In literature\nwe could find that the patterns which are used to extract such terminology often change from one domain to another, it means the intervention of human experts to the generation and validation of these patterns. This article deals with a methodology for automatic obtaining patterns (Basic Patterns and Definitory Verbal Patterns) for extracting domain terminology and minimizing the manual work of the ex- perts. The obtained methodology was evaluated in the computer science domain obtaining a 97 percent in the case of the values of the\nbasic patterns and a 98 percent of the definitory verbal patterns. Then the methodology was tested in three other domains with similar results, Agricultural Engineering (a 96 percent of the basic patterns and a 97 percent of the definitory verbal patterns), Veterinary Medicine\n(98% of the basic pattern and the definitory verbal patterns) and Agronomy (96% of the basic pattern and the definitory verbal patterns),\nshowing that methodology can be applied in any specialty curriculum documents.","authors":["Yusney Marrero","Paloma Moreda","Rafael Muñoz Guillena"],"meta":["June 2018"],"references":["237676103_El_rol_de_las_predicaciones_verbales_en_la_extraccion_automatica_de_conceptos","228615592_Towards_the_extraction_of_conceptual_information_from_corpora","221466796_DBpedia_A_Nucleus_for_a_Web_of_Open_Data","41392094_Extraccion_de_contextos_definitorios_en_textos_de_especialidad_a_partir_del_reconocimiento_de_patrones_linguisticos","33681031_Reperage_des_enonces_d'interet_definitoire_dans_les_bases_de_donnees_textuelles","269963461_Le_contexte_terminographique","254764752_Building_a_Multilingual_Database_with_Wordnets_for_European_Languages","221606983_Automatically_Constructing_a_Dictionary_for_Information_Extraction_Tasks","220873618_BabelNet_Building_a_Very_Large_Multilingual_Semantic_Network","220813930_Learning_information_extraction_patterns_from_examples"]}