{"id":"326042317_Exploring_the_effectiveness_of_Edmodo_on_Greek_EFL_B1_learners'_motivation_to_write","abstract":"The present study aims at investigating the effectiveness of the Edmodo educational social network on Greek High School EFL learners' motivation to write. For this purpose, an Edmodo-based writing project was designed and implemented with the students of a 3 rd grade Junior High School classroom. For the collection of data a pre-and post-questionnaire for the students, administered before and after the application of Edmodo, the Edmodo learning platform and the analysis of the students' posts on it during the project and semi-structured interviews to probe deeper into the learners' perceptions concerning the use of Edmodo in writing lessons were employed. The results of the study revealed that the implementation of the Edmodo project had a positive effect on the aspects of writing motivation examined, as a shift in students' attitudes to writing and writing habits as well as increased participation and engagement in the writing process and tasks were detected. The research findings appeared to be quite encouraging, indicating that Edmodo can be a valuable tool in the hands of teachers who seek effective ways to develop, foster and maintain students' motivation to write.","authors":["Magdalini Tsiakyroudi"],"meta":["June 2018"],"references":["334890248_Building_Students'_Writing_Skill_by_Using_Edmodo","292386838_The_use_of_Edmodo_in_teaching_writing_in_a_blended_learning_setting","290194678_MAXIMIZING_L2_INTERACTION_THROUGH_USING_EDMODO_IN_SAUDI_EFL_CLASSROOMS","287326814_Planning_out_pre-writing_activities","311574163_Social_Media_and_Peer_Review_Edmodo_in_the_Composition_Classroom","304833950_Interest_and_Its_Contribution_as_a_Mental_Resource_for_Learning","297546895_Reflections_on_effective_use_of_graphic_organizers","291154331_The_multiple_meanings_of_motivation_to_write","289836430_Writing_and_Motivation","287248121_Questionnaires_in_second_language_research_Construction_administration_and_processing_Second_edition"]}