{"id":"326073432_A_Tutorial_for_Information_Theory_in_Neuroscience","abstract":"Understanding how neural systems integrate, encode, and compute information is central to understanding brain function. Frequently, data from neuroscience experiments are multivariate, the interactions between the variables are nonlinear, and the landscape of hypothesized or possible interactions between variables is extremely broad. Information theory is well suited to address these types of data, as it possesses multivariate analysis tools, it can be applied to many different types of data, it can capture nonlinear interactions, and it does not require assumptions about the structure of the underlying data (i.e., it is model independent). In this article, we walk through the mathematics of information theory along with common logistical problems associated with data type, data binning, data quantity requirements, bias, and significance testing. Next, we analyze models inspired by canonical neuroscience experiments to improve understanding and demonstrate the strengths of information theory analyses. To facilitate the use of information theory analyses, and an understanding of how these analyses are implemented, we also provide a free MATLAB software package that can be applied to a wide range of data from neuroscience experiments, as well as from other fields of study.","authors":["Nicholas Timme","Christopher Lapish"],"meta":["June 2018eNeuro 5(3):ENEURO.0052-18.2018","DOI:10.1523/ENEURO.0052-18.2018"],"references":["324651720_Pointwise_Partial_Information_Decomposition_Using_the_Specificity_and_Ambiguity_Lattices","323135385_Inform_A_toolkit_for_information-theoretic_analysis_of_complex_systems","320014529_Abandon_Statistical_Significance","317955049_Invariant_Components_of_Synergy_Redundancy_and_Unique_Information_among_Three_Variables","317575956_Breakdown_of_local_information_processing_may_underlie_isoflurane_anesthesia_effects","323395563_Analytical_estimates_of_limited_sampling_biases_in_different_information_measures","322787401_Pointwise_Information_Decomposition_Using_the_Specificity_and_Ambiguity_Lattices","321613059_Directed_Information_Measures_in_Neuroscience","317733858_Prefrontal_Neurons_Encode_a_Solution_to_the_Credit-Assignment_Problem","317233031_Elements_of_information_theory_2nd_edition"]}