{"id":"326098120_Coupling_a_firefly_algorithm_with_support_vector_regression_to_predict_evaporation_in_northern_Iran","abstract":"Evaporation accounts for varying shares of water balance under different climatic conditions, and its correct prediction poses a significant challenge before water resources management in watersheds. Given the complex and nonlinear behavior of the evaporation component, and according to the fact that this parameter is not measured at many meteorological stations, at least during some timeframes, and that the meteorological stations measuring this component are not properly distributed in many developing countries, including Iran, the main objective of this work was to predict the evaporation component at two meteorological stations (Rasht and Lahijan) located in Gilan province in northern Iran over the 2006–2016 time period. To that end, those meteorological parameters recorded at the two stations which had the highest impact on evaporation prediction were identified using Pearson correlation coefficient. Selected parameters were then used, under separate scenarios, as inputs to support vector regression (SVR) and SVR model coupled with firefly algorithm (SVR-FA) in order to simulate evaporation values on a daily scale. Evaporation amounts showed the highest correlation with net solar radiation and saturation vapor pressure deficit at Lahijan and Rasht stations, respectively. Root mean square error values of evaporation prediction at testing phase of SVR and SVR-FA ranged from 1.05 to 1.43 and 1.02 to 1.31 mm, respectively, at Lahijan station and from 1.02 to 1.28 and 0.88 to 1.17 mm, respectively, at Rasht station for various scenarios. For underpredicted evaporation data set, the magnitude of RMSE reduction from SVR1 to SVR7 was 27% at Lahijan and 18% at Rasht station; whereas RMSE decrement from SVR-FA1 to SVR-FA7 was 18 and 26 percent at Lahijan and Rasht stations, respectively. This means that for the underpredicted data set, the role of increasing the number of SVR and SVR-FA input parameters in decreasing evaporation prediction error has been more conspicuous at Lahijan and Rasht stations, respectively. Analysis of SVR and SVR-FA performance at various 2-mm intervals of measured evaporation showed that prediction error has generally been increasing with increment of evaporation values, with the highest errors observed at the 8-10 mm interval for both Lahijan and Rasht stations (error rates of 3.42 and 2.42 mm/day at Lahijan and 6.13 and 5.84 mm/day at Rasht station, with SVR1 and SVR-FA1 models, respectively).","authors":["Roozbeh Moazenzadeh","Babak Mohammadi","Shahab S. Band","Kwok-wing Chau"],"meta":["January 2018Engineering Applications of Computational Fluid Mechanics 12(1):584-597","DOI:10.1080/19942060.2018.1482476"],"references":["319352834_Predicting_the_Future_Using_Web_Knowledge_State_of_the_Art_Survey","305716574_Utilizing_RBF-NN_and_ANFIS_Methods_for_Multi-Lead_ahead_Prediction_Model_of_Evaporation_from_Reservoir","303468133_Comparison_of_six_different_soft_computing_methods_in_modeling_evaporation_in_different_climates","283098641_Modeling_of_groundwater_level_fluctuations_using_dendrochronology_in_alluvial_aquifers","281588278_Assessing_the_suitability_of_hybridizing_the_Cuckoo_optimization_algorithm_with_ANN_and_ANFIS_techniques_to_predict_daily_evaporation","316913575_Application_of_firefly_algorithm-based_support_vector_machines_for_prediction_of_field_capacity_and_permanent_wilting_point","311068803_Pan_evaporation_modeling_using_six_different_heuristic_computing_methods","293195565_Daily_pan_evaporation_modeling_using_chi-squared_automatic_interaction_detector_neural_networks_classification_and_regression_tree","284018461_A_comparative_study_of_population-based_optimization_algorithms_for_downstream_river_flow_forecasting_by_a_hybrid_neural_network_model","281890883_Pan_evaporation_modeling_using_least_square_support_vector_machine_multivariate_adaptive_regression_splines_and_M5_model_tree"]}