{"id":"326089087_Hybrid_correction_of_highly_noisy_long_reads_using_a_variable-order_de_Bruijn_graph","abstract":"Motivation: \nThe recent rise of long read sequencing technologies such as Pacific Biosciences and Oxford Nanopore allows to solve assembly problems for larger and more complex genomes than what allowed short reads technologies. However, these long reads are very noisy, reaching an error rate of around 10 to 15% for Pacific Biosciences, and up to 30% for Oxford Nanopore. The error correction problem has been tackled by either self-correcting the long reads, or using complementary short reads in a hybrid approach. However, even though sequencing technologies promise to lower the error rate of the long reads below 10%, it is still higher in practice, and correcting such noisy long reads remains an issue.\n\nResults: \nWe present HG-CoLoR, a hybrid error correction method that focuses on a seed-and-extend approach based on the alignment of the short reads to the long reads, followed by the traversal of a variable-order de Bruijn graph, built from the short reads. Our experiments show that HG-CoLoR manages to efficiently correct highly noisy long reads that display an error rate as high as 44%. When compared to other state-of-the-art long read error correction methods, our experiments also show that HG-CoLoR provides the best trade-off between runtime and quality of the results, and is the only method able to efficiently scale to eukaryotic genomes.\n\nAvailability and implementation: \nHG-CoLoR is implemented is C++, supported on Linux platforms and freely available at https://github.com/morispi/HG-CoLoR.\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Pierre Morisse","Thierry Lecroq","Arnaud Lefebvre"],"meta":["June 2018Bioinformatics 34(24)","DOI:10.1093/bioinformatics/bty521"],"references":["315950794_HALC_High_throughput_algorithm_for_long_read_error_correction","315173901_Canu_Scalable_and_accurate_long-read_assembly_via_adaptive_k-mer_weighting_and_repeat_separation","301876053_Accurate_selfcorrection_of_errors_in_long_reads_using_de_Bruijn_graphs","301827317_Jabba_Hybrid_error_correction_for_long_sequencing_reads","282764706_Oxford_Nanopore_sequencing_hybrid_error_correction_and_de_novo_assembly_of_a_eukaryotic_genome","280103451_Karect_Accurate_Correction_of_Substitution_Insertion_and_Deletion_Errors_for_Next-generation_Sequencing_Data","320452786_LRCstats_a_tool_for_evaluating_long_reads_correction_methods","313044506_KMC_3_counting_and_manipulating_k-mer_statistics","310582563_CoLoRMap_Correcting_Long_Reads_by_Mapping_short_reads","302921979_SimLoRD_-_Simulation_of_Long_Read_Data"]}