{"id":"326097966_Music_Technology_and_the_Hip_Hop_Beat_Making_Tradition_A_History_and_Typology_of_Equipment_for_Music_Therapy","abstract":"This article contextualises music technology within the Hip Hop tradition of beat making. While literature exploring music technology in music therapy has proliferated in recent years, much of this has focused on the “assistive” function of technology, where it is used to facilitate music making for clients who have limited access to playing acoustic – or non-tech-based – instruments. This paper argues for an alternate lens that positions music technology within the tradition of beat making and that this is a musicing practice of value in its own right. To do so, a brief historical account of the beat making tradition is provided, which locates its origins within Hip Hop culture and acknowledges the evolution of the myriad beat-based genres that have and continue to emerge around music technology. A basic typology of beat making equipment is then provided to foster greater understanding of these technologies as instruments in their own right and their role in shaping contemporary music. To account for the rapid innovation in this area, the typology focuses on pieces with historical significance and the primary functions that remain the building blocks of composition and performance in beat making to this day. Brief accounts of how these instruments can and are integrated into therapeutic practice are also provided. It is acknowledged that this paper itself represents only one, brief account of beat making traditions and instruments. Yet, it is hoped it will promote understanding of their significance and serve as a useful reference in helping practitioners consider how these instruments may enrich practice. It is argued that such consideration is not only useful, but critical for reasons of cultural sustainability, and ensuring the relevance of music therapy practice in the 21st Century.","authors":["Alexander Crooke"],"meta":["June 2018Voices A World Forum for Music Therapy 18(2)","DOI:10.15845/voices.v18i2.996","Project: Exploring Hip Hop in Australia"],"references":["346495965_Prophets_of_the_Hood_Politics_and_Poetics_in_Hip_Hop","345792400_'Plugged_in'_technology_and_popular_music","330147392_Improvising_Using_Beat_Making_Technologies_in_Music_Therapy_with_Young_People","324403702_Black_Noise_Rap_Music_and_Black_Culture_in_Contemporary_America","323384185_The_Selection_of_Music_Experiences_in_Music_Therapy","322119577_Play_like_Jay_Pedagogies_of_drum_kit_performance_after_J_Dilla","317778934_Hip-Hop_Authenticity_and_the_London_Scene_Living_Out_Authenticity_in_Popular_Music","315386715_Youth_Music_and_Creative_Cultures","313249270_Music_therapy_and_cultural_diversity","312463185_Hear_our_voices_A_music_therapy_songwriting_program_and_the_message_of_the_Little_Saints_through_the_medium_of_rap"]}