{"id":"326046798_Peer_assessment_and_groups_formation_in_massive_open_online_courses","abstract":"One of the major challenges facing Massive Open Online Courses (MOOCs) is assessing the learner performances beyond traditional automated assessment methods. This leads to a bottleneck problem due to the massiveness of course participants, especially in the context of problem solving. To tackle this issue, peer assessment has been proposed as an effective method. However, the validity of this process is still under discussion, suffers from a lack of credibility and has many weaknesses, particularly with regards to group formation. This paper develops a new method of peer assessment for MOOCs to improve the accuracy and exactitude of the learner grade. Our proposition is based on three main steps: the formation of learner groups, the assessment and synthesis of the results. First, the group definition process can use different elements of the learner model and enables to build heterogeneous groups. After, each learner is required to grade a small number of peer productions. Finally, a synthesis of the various grades is proposed using both data about the ability to assess of each learner and complexity of problems. To evaluate the proposed peer assessment process, we conducted an experimentation devoted to teaching Software Quality Assurance to beginners with computer science during the first university cycle.","authors":["Haddadi Lynda","Farida Bouarab-Dahmani","Nathalie Guin","Berkane Tassadit"],"meta":["June 2018Computer Applications in Engineering Education 26(5)","DOI:10.1002/cae.22005"],"references":["314756215_Collaborative_MOOC_content_design_and_automatic_assessment_based_on_ODALA_approach","309032104_Exploring_the_use_of_MOOC_discussion_forums","301322468_Improving_the_Peer_Assessment_Experience_on_MOOC_Platforms","295217225_An_Analysis_of_MOOC_Discussion_Forum_Interactions_from_the_Most_Active_Users","324797172_A_Systematic_Analysis_of_Peer_Assessment_in_the_MOOC_Era_and_Future_Perspectives","320650570_Peer_assessment_in_MOOCs_based_on_learners'_profiles_clustering","307710116_A_PRATICA_NA_PRATICA","307534542_Algorithm_AS_136_A_K-means_vlustering_algorithm","298971854_On_the_validity_of_peer_grading_and_a_cloud_teaching_assistant_system","290487631_Peer_and_self_assessment_in_massive_online_classes"]}