{"id":"326100487_Refining_the_law_of_practice","abstract":"The \"law of practice\"-a simple nonlinear function describing the relationship between mean response time (RT) and practice-has provided a practically and theoretically useful way of quantifying the speed-up that characterizes skill acquisition. Early work favored a power law, but this was shown to be an artifact of biases caused by averaging over participants who are individually better described by an exponential law. However, both power and exponential functions make the strong assumption that the speedup always proceeds at a steadily decreasing rate, even though there are sometimes clear exceptions. We propose a new law that can both accommodate an initial delay resulting in a slower-faster-slower rate of learning, with either power or exponential forms as limiting cases, and which can account for not only mean RT but also the effect of practice on the entire distribution of RT. We evaluate this proposal with data from a broad array of tasks using hierarchical Bayesian modeling, which pools data across participants while minimizing averaging artifacts, and using inference procedures that take into account differences in flexibility among laws. In a clear majority of paradigms our results supported a delayed exponential law. (PsycINFO Database Record","authors":["Nathan J Evans","Scott D Brown","Douglas J Mewhort","Andrew Heathcote"],"meta":["July 2018Psychological Review 125(4):592-605","DOI:10.1037/rev0000105"],"references":["317386969_Need_for_closure_is_associated_with_urgency_in_perceptual_decision-making","313284592_Model_Flexibility_Analysis_Does_Not_Measure_the_Persuasiveness_of_a_Fit","307526836_Practical_Bayesian_model_evaluation_using_leave-one-out_cross-validation_and_WAIC","283468073_Generalising_the_drift_rate_distribution_for_linear_ballistic_accumulators","324303007_Experimental_Psychology","316566947_Bayes_factors_for_the_linear_ballistic_accumulator_model_of_decision-making","306927838_People_adopt_optimal_policies_in_simple_decision-making_after_practice_and_guidance","299433248_Phases_of_learning_How_skill_acquisition_impacts_cognitive_processing","284046833_Bayesian_measures_of_model_complexity_and_fit_with_discussion","283638806_Modeling_the_Distinct_Phases_of_Skill_Acquisition"]}