{"id":"326164444_Investigating_serendipity_in_recommender_systems_based_on_real_user_feedback","abstract":"Over the past several years, research in recommender systems has emphasized the importance of serendipity, but there is still no consensus on the definition of this concept and whether serendipitous items should be recommended is still not a well-addressed question. According to the most common definition, serendipity consists of three components: relevance, novelty and unexpectedness, where each component has multiple variations. In this paper, we looked at eight different definitions of serendipity and asked users how they perceived them in the context of movie recommendations. We surveyed 475 users of the movie recommender system, MovieLens regarding 2146 movies in total and compared those definitions of serendipity based on user responses. We found that most kinds of serendipity and all the variations of serendipity components broaden user preferences, but one variation of unexpectedness hurts user satisfaction. We found effective features for detecting serendipitous movies according to definitions that do not include this variation of unexpectedness. We also found that different variations of unexpectedness and different kinds of serendipity have different effects on preference broadening and user satisfaction. Among movies users rate in our system, up to 8.5% are serendipitous according to at least one definition of serendipity, while among recommendations that users receive and follow in our system, this ratio is up to 69%.","authors":["Denis Kotkov","Joseph A. Konstan","Qian Zhao","Jari Veijalainen"],"meta":["April 2018","DOI:10.1145/3167132.3167276","Conference: the 33rd Annual ACM Symposium"],"references":["317283429_A_Serendipity-Oriented_Greedy_Algorithm_for_Recommendations","306075233_A_Survey_of_Serendipity_in_Recommender_Systems","301432391_I_like_to_explore_sometimes","313363141_Discovery_Is_Never_By_Chance_Designing_for_UnSerendipity","311784289_Diversity_Serendipity_Novelty_and_Coverage_A_Survey_and_Empirical_Analysis_of_Beyond-Accuracy_Objectives_in_Recommender_Systems","304179623_Categorical_Data_Analysis","302973713_Challenges_of_Serendipity_in_Recommender_Systems","301432309_Letting_Users_Choose_Recommender_Algorithms","300791314_An_Unexpectedness-Augmented_Utility_Model_for_Making_Serendipitous_Recommendation","281943993_An_investigation_on_the_serendipity_problem_in_recommender_systems"]}