{"id":"326100673_The_Kappa_platform_for_rule-based_modeling","abstract":"Motivation: \nWe present an overview of the Kappa platform, an integrated suite of analysis and visualization techniques for building and interactively exploring rule-based models. The main components of the platform are the Kappa Simulator, the Kappa Static Analyzer and the Kappa Story Extractor. In addition to these components, we describe the Kappa User Interface, which includes a range of interactive visualization tools for rule-based models needed to make sense of the complexity of biological systems. We argue that, in this approach, modeling is akin to programming and can likewise benefit from an integrated development environment. Our platform is a step in this direction.\n\nResults: \nWe discuss details about the computation and rendering of static, dynamic, and causal views of a model, which include the contact map (CM), snaphots at different resolutions, the dynamic influence network (DIN) and causal compression. We provide use cases illustrating how these concepts generate insight. Specifically, we show how the CM and snapshots provide information about systems capable of polymerization, such as Wnt signaling. A well-understood model of the KaiABC oscillator, translated into Kappa from the literature, is deployed to demonstrate the DIN and its use in understanding systems dynamics. Finally, we discuss how pathways might be discovered or recovered from a rule-based model by means of causal compression, as exemplified for early events in EGF signaling.\n\nAvailability and implementation: \nThe Kappa platform is available via the project website at kappalanguage.org. All components of the platform are open source and freely available through the authors' code repositories.","authors":["Pierre Boutillier","Mutaamba Maasha","Xing Li","Héctor F Medina-Abarca"],"meta":["July 2018Bioinformatics 34(13):i583-i592","DOI:10.1093/bioinformatics/bty272"],"references":["321290965_From_word_models_to_executable_models_of_signaling_networks_using_automated_assembly","321057505_Automated_visualization_of_rule-based_models","319326374_Dynamic_Influence_Networks_for_Rule-Based_Models","315341304_Incremental_Update_for_Graph_Rewriting","313788355_A_taxonomy_of_visualization_tasks_for_the_analysis_of_biological_pathway_data","301881054_A_Software_Package_for_Chemically_Inspired_Graph_Transformation","296619431_A_knowledge_representation_meta-model_for_rule-based_modelling_of_signalling_networks","282462274_Extended_LineSets_A_visualization_technique_for_the_interactive_inspection_of_biological_pathways","319408676_Bio-Curation_for_Cellular_Signalling_The_KAMI_Project","304370780_A_Software_Package_for_Chemically_Inspired_Graph_Transformation"]}