{"id":"326158666_One-Sided_Device-Independent_Certification_of_Unbounded_Random_Numbers","abstract":"The intrinsic non-locality of correlations in Quantum Mechanics allow us to certify the behaviour of a quantum mechanism in a device independent way. In particular, we present a new protocol that allows an unbounded amount of randomness to be certified as being legitimately the consequence of a measurement on a quantum state. By using a sequence of non-projective measurements on single state, we show a more robust method to certify unbounded randomness than the protocol of Churchod et al., by moving to a one-sided device independent scenario. This protocol also does not assume any specific behaviour of the adversary trying to fool the participants in the protocol, which is an advantage over previous steering based protocols. We present numerical results which confirm the optimal functioning of this protocol in the ideal case. Furthermore, we also study an experimental scenario to determine the feasibility of the protocol in a realistic implementation. The effect of depolarizing noise is examined, by studying a potential state produced by a networked system of ion traps.","authors":["Brian Coyle","Matty J. Hoban","Elham Kashefi"],"meta":["July 2018","DOI:10.4204/EPTCS.273.2","Project: One-Sided Device Independent Certification of Unbounded Random Numbers"],"references":["301818702_Minimally_complex_ion_traps_as_modules_for_quantum_communication_and_computing","282844130_Unbounded_randomness_certification_using_sequences_of_measurements","275669345_Optimal_randomness_certification_in_the_quantum_steering_and_prepare-and-measure_scenarios","263020530_Quantum_randomness_extraction_for_various_levels_of_characterization_of_the_devices","260872667_Modular_Entanglement_of_Atomic_Qubits_using_both_Photons_and_Phonons","323130140_On_the_Einstein_Podolsky_Rosen_paradox","301835340_Quantum_steering_a_short_review_with_focus_on_semidefinite_programming","262608615_Quantifying_Einstein-Podolsky-Rosen_Steering","245601492_Can_quantum_mechancial_description_of_physics_be_considered_complete","229058134_Convex_Optimization"]}