{"id":"326122488_Political_Engagement_on_Social_Media_as_Antecedent_for_Political_Support_among_Voters_in_Malaysia","abstract":"The emergence of new media as a result of the development of the internet has made the media a democratic agent of information. In conjunction with the transition of current political culture, society is now more comfortable using social media as a source of political information. This study was conducted to identify the impact of social media use on politics in Malaysia and to analyze the level of social media uses in determining the people's pattern of support for political parties and political candidates in Malaysia. This study was conducted using survey questionnaire as the research instrument. A total of 993 respondents consisting of males (46.2%) and females (53.8%) were selected randomly to participate in this study. Among the survey results, almost two-third of the respondents used newspapers (65.5%), followed by social media (63.5%) and television (59.5%) to search and read current political information in Malaysia. The findings also show that respondents agree that social media plays a role and has the advantage of channeling political information (mean = 3.57) compared to conventional media. The respondents agreed that social media helped to enhance the image of candidates and political parties (mean = 3.17) by displaying candidate activity in serving the people (mean = 3.25). This suggests that today's society is very concerned with what is shown on social media on matters involving current politics. Therefore, monitoring of political information shared on social media should be done to ensure that information is free from seditious elements that can diverge unity. © 2018, Universiti Kebangsaan Malaysia Press. All rights reserved.","authors":["Ali Salman","Mohammad Agus Yusoff","Mohd Azul Mohamad Salleh","Mohd Yusof b. Abdullah"],"meta":["June 2018Jurnal Komunikasi: Malaysian Journal of Communication 34(2):152-165","DOI:10.17576/JKMJC-2018-3402-10","Project: Social Media in Malaysia and Indonesia"],"references":["324082805_Kegunaan_dan_Kepuasan_Portal_Berita_dalam_Kalangan_Belia_Malaysia_Uses_and_Gratifications_of_News_Portal_Among_Malaysian_Youths","274060611_Party_change_social_media_and_the_rise_of_'citizen-initiated'_campaigning","265754696_The_New_Media_and_Malaysian_Politics_in_Historical_Perspective","257672505_Co-Production_in_an_Information_Age_Individual_and_Community_Engagement_Supported_by_New_Media","259132082_Who_benefits_from_Twitter_Social_media_and_political_competition_in_the_US_House_of_Representatives","249802615_Agenda_Setting_in_Congressional_Elections_The_Impact_of_Issues_and_Campaigns_on_Voting_Behavior","249802466_Does_the_Messenger_Matter_Candidate-Media_Agenda_Convergence_and_Its_Effects_on_Voter_Issue_Salience","233729903_Social_Media_and_Political_Change_Capacity_Constraint_and_Consequence","220140607_Perceived_credibility_of_Internet_encyclopedias"]}