{"id":"326168155_Evolving_mario_levels_in_the_latent_space_of_a_deep_convolutional_generative_adversarial_network","abstract":"Generative Adversarial Networks (GANs) are a machine learning approach capable of generating novel example outputs across a space of provided training examples. Procedural Content Generation (PCG) of levels for video games could benefit from such models, especially for games where there is a pre-existing corpus of levels to emulate. This paper trains a GAN to generate levels for Super Mario Bros using a level from the Video Game Level Corpus. The approach successfully generates a variety of levels similar to one in the original corpus, but is further improved by application of the Covariance Matrix Adaptation Evolution Strategy (CMA-ES). Specifically, various fitness functions are used to discover levels within the latent space of the GAN that maximize desired properties. Simple static properties are optimized, such as a given distribution of tile types. Additionally, the champion A* agent from the 2009 Mario AI competition is used to assess whether a level is playable, and how many jumping actions are required to beat it. These fitness functions allow for the discovery of levels that exist within the space of examples designed by experts, and also guide the search towards levels that fulfill one or more specified objectives.","authors":["Vanessa Volz","Jacob Schrum","Jialin Liu","Simon Lucas"],"meta":["July 2018","DOI:10.1145/3205455.3205517","Conference: the Genetic and Evolutionary Computation Conference"],"references":["320971134_Plug_Play_Generative_Networks_Conditional_Iterative_Generation_of_Images_in_Latent_Space","317061803_DeepMasterPrint_Generating_Fingerprints_for_Presentation_Attacks","313247478_Procedural_Content_Generation_via_Machine_Learning_PCGML","323592586_Deep_Interactive_Evolution","319770355_Generative_Adversarial_Nets","319770154_Adversarial_Autoencoders","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","315765101_Improved_Training_of_Wasserstein_GANs","310235353_GANS_for_Sequences_of_Discrete_Elements_with_the_Gumbel-softmax_Distribution","309280537_Procedural_Content_Generation_in_Games"]}