{"id":"326151634_The_Causality_Research_between_Syndrome_Elements_by_Attribute_Topology","abstract":"Background\nThe traditional Chinese medicine (TCM) is an empirical medical system and has its own diagnosis and treatment method. The syndrome elements are atoms to modern TCM diagnosis proposed by Professor Zhu Wenfeng. Researching and analyzing the syndrome element system is one of the active issues for TCM research. At present, most related researches focus on the correlativity and hierarchical relationship of the diseases and symptoms, but the causality researches between syndrome elements themselves have not been reported so far.\n\nMethods\nTo explore the causality between syndrome elements, a method named causality by attribute topology (CAT) is proposed. Based on the subordinate relations in attribute topology, the inference method analyzes and reasons the dependency relationship between the sets of objects which contain attributes. Through the removal of attributes in the attribute topology, the formal context is updated constantly. Thus, the causal relationship among the attributes is deduced. In this method, 500 records are mathematically transferred to a binary context for syndrome element analysis. Through the analysis and verification of the potential causal relationship between the syndrome elements, knowledge discovery of the diagnostic data of traditional Chinese medicine based on attribute topology structure diagram is conducted.\n\nResults\nThis paper has verified the causal transformation between these syndrome elements. The experimental results between the female group data and the male group data show that different genders have different characteristics and relations of syndrome elements. The experimental results are basically consistent with the traditional Chinese medicine theory.\n\nConclusion\nThe experiment shows that causality by attribute topology (CAT) is feasible to describe the causality between TCM syndrome elements. Further research on possible knowledge discovery in TCM diagnostic data should be conducted through the analysis of the potential causal relationship between TCM diagnostic data and each syndrome element.","authors":["Tao Zhang","Mengqi Liu","Wenyuan Liu"],"meta":["July 2018Computational and Mathematical Methods in Medicine 2018(03):1-12","DOI:10.1155/2018/9707581"],"references":["318335582_A_research_on_syndrome_element_differentiation_based_on_phenomenology_and_mathematical_method","301903220_A_Bayesian_Network_Framework_for_Project_Cost_Benefit_and_Risk_Analysis_with_an_Agricultural_Development_Case_Study","259448067_Learning_Bayesian_networks_for_clinical_time_series_analysis","259004023_Investigation_into_the_Influence_of_Physician_for_Treatment_Based_on_Syndrome_Differentiation","235446980_Multipartite_information_causality","223957085_Inquiry_diagnosis_of_coronary_heart_disease_in_Chinese_medicine_based_on_symptom-syndrome_interactions","287124970_Urbanization_economic_growth_and_carbon_dioxide_emissions_in_China_A_panel_cointegration_and_causality_analysis","257126088_The_causal_relationship_between_energy_consumption_and_economic_growth_in_Lebanon","256721435_Formal_concept_analysis_based_on_the_topology_for_attributes_of_a_formal_context","242423304_probabilistic_reasoning_in_intelligent_systems_networks_of_plausible_inference_san_mateo"]}