{"id":"326100778_Asymptotically_optimal_minimizers_schemes","abstract":"Motivation: \nThe minimizers technique is a method to sample k-mers that is used in many bioinformatics software to reduce computation, memory usage and run time. The number of applications using minimizers keeps on growing steadily. Despite its many uses, the theoretical understanding of minimizers is still very limited. In many applications, selecting as few k-mers as possible (i.e. having a low density) is beneficial. The density is highly dependent on the choice of the order on the k-mers. Different applications use different orders, but none of these orders are optimal. A better understanding of minimizers schemes, and the related local and forward schemes, will allow designing schemes with lower density and thereby making existing and future bioinformatics tools even more efficient.\n\nResults: \nFrom the analysis of the asymptotic behavior of minimizers, forward and local schemes, we show that the previously believed lower bound on minimizers schemes does not hold, and that schemes with density lower than thought possible actually exist. The proof is constructive and leads to an efficient algorithm to compare k-mers. These orders are the first known orders that are asymptotically optimal. Additionally, we give improved bounds on the density achievable by the three type of schemes.","authors":["Guillaume Marcais","Dan DeBlasio","Carl Kingsford"],"meta":["July 2018Bioinformatics 34(13):i13-i22","DOI:10.1093/bioinformatics/bty258"],"references":["323663940_Improving_the_performance_of_minimizers_and_winnowing_schemes","320178008_Designing_small_universal_k-mer_hitting_sets_for_improved_analysis_of_high-throughput_sequencing","304265533_Mash_Fast_genome_and_metagenome_distance_estimation_using_MinHash","282066370_Minimizing_the_Number_of_Bootstrappings_in_Fully_Homomorphic_Encryption","276100394_CoMeta_Classification_of_Metagenomes_Using_k-mers","263736737_KMC_2_Fast_and_resource-frugal_k-mer_counting","260443015_Wood_DE_Salzberg_SL_Kraken_Ultrafast_metagenomic_sequence_classification_using_exact_alignment_Genome_Biol_15_R46","286302053_Minimap_and_miniasm_Fast_mapping_and_de_novo_assembly_for_noisy_long_sequences","277334891_MSPKmerCounter_A_Fast_and_Memory_Efficient_Approach_for_K-mer_Counting","262164659_Memory_efficient_minimum_substring_partitioning"]}