{"id":"326104442_Formalizing_the_Mapping_of_UML_Conceptual_Schemas_to_Column-Oriented_Databases","abstract":"Nowadays, most organizations need to improve their decision-making process using Big Data. To achieve this, they have to store Big Data, perform an analysis, and transform the results into useful and valuable information. To perform this, it's necessary to deal with new challenges in designing and creating data warehouse. Traditionally, creating a data warehouse followed well-governed process based on relational databases. The influence of Big Data challenged this traditional approach primarily due to the changing nature of data. As a result, using NoSQL databases has become a necessity to handle Big Data challenges. In this article, the authors show how to create a data warehouse on NoSQL systems. They propose the Object2NoSQL process that generates column-oriented physical models starting from a UML conceptual model. To ensure efficient automatic transformation, they propose a logical model that exhibits a sufficient degree of independence so as to enable its mapping to one or more column-oriented platforms. The authors provide experiments of their approach using a case study in the health care field.","authors":["Fatma Abdelhedi","Amal Ait Brahim","Gilles Zurfluh"],"meta":["July 2018International Journal of Data Warehousing and Mining 14(3):44-68","DOI:10.4018/IJDWM.2018070103"],"references":["323309389_Growth_of_New_Databases_Analysis_of_NOSQL_Datastores","308925683_NOSQL_Design_for_Analytical_Workloads_Variability_Matters","308856170_A_Big_Data_Modeling_Methodology_for_Apache_Cassandra","308723693_UMLtoGraphDB_Mapping_Conceptual_Schemas_to_Graph_Databases","309281915_Introduction_to_HBase_Schema_design","305262074_Vertical_Partitioning_for_Database_Design_A_Graphical_Algorithm","301416532_Big_Data_Design","289734479_Transforming_UML_class_diagrams_into_HBase_based_on_meta-model","261310819_Denormalizing_data_into_schema-free_databases","254012870_Survey_on_NoSQL_database"]}