{"id":"326152330_Can_our_cities_be_planned_Does_the_function_follow_the_form_The_New_York_experience","abstract":"Do we need urban planning? For a better future, for a better territorial integration, for attending collective demands? New York is at the other side of the usual answer. Manhattan is an example of the versatility of a single pattern, drawn on a paper over a territory with very different features. When it comes to reality, it uniforms it, and fills it with progressive, unattended and renewed demands, with no more plan than the one that is demanded by an efficient economic system. Its urban plan (?) has just attended, quickly, private demands, giving flexibility to ground uses and GFAs, with no more worries than its functionality. As the only stable issue, as simple and clear as possible, has been the link between urban space and territory through a universal but fixed pattern. It allows free deals between developers and authority, respecting very few regulations, to enable changes, constructions, knocking offs and rehabilitations far from the European style urban plans. Which is its future in a democratic and free society? A government based constantly and with transparency on assemblies, not in a Plan, that can assure equal treatments and fair deals of the initiatives towards the community? Some of the proposals accepted in Manhattan, where the urban shape at its simplest stage of a horizontal pattern unchanged in its 200 years of existence, show us the success and failures of this system. Adapted from the beginning to a traded world, it has no bad urban nor social conscience. This frame match perfectly the precapitalism of its founders with the demands of a contemporary globalized society.","authors":["Alberto Peñín Ibáñez","Alberto Peñín"],"meta":["September 2017","DOI:10.4995/ISUF2017.2017.6681","Conference: 24th ISUF 2017 - City and Territory in the Globalization Age"],"references":["242530243_Learning_from_las_vegas_the_forgotten_symbolism_of_architectural_form"]}