{"id":"326100607_A_gene-phenotype_relationship_extraction_pipeline_from_the_biomedical_literature_using_a_representation_learning_approach","abstract":"Motivation: \nThe fundamental challenge of modern genetic analysis is to establish gene-phenotype correlations that are often found in the large-scale publications. Because lexical features of gene are relatively regular in text, the main challenge of these relation extraction is phenotype recognition. Due to phenotypic descriptions are often study- or author-specific, few lexicon can be used to effectively identify the entire phenotypic expressions in text, especially for plants.\n\nResults: \nWe have proposed a pipeline for extracting phenotype, gene and their relations from biomedical literature. Combined with abbreviation revision and sentence template extraction, we improved the unsupervised word-embedding-to-sentence-embedding cascaded approach as representation learning to recognize the various broad phenotypic information in literature. In addition, the dictionary- and rule-based method was applied for gene recognition. Finally, we integrated one of famous information extraction system OLLIE to identify gene-phenotype relations. To demonstrate the applicability of the pipeline, we established two types of comparison experiment using model organism Arabidopsis thaliana. In the comparison of state-of-the-art baselines, our approach obtained the best performance (F1-Measure of 66.83%). We also applied the pipeline to 481 full-articles from TAIR gene-phenotype manual relationship dataset to prove the validity. The results showed that our proposed pipeline can cover 70.94% of the original dataset and add 373 new relations to expand it.\n\nAvailability and implementation: \nThe source code is available at http://www.wutbiolab.cn: 82/Gene-Phenotype-Relation-Extraction-Pipeline.zip.\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Wenhui Xing","Junsheng Qi","Xiaohui Yuan","Lin Li"],"meta":["July 2018Bioinformatics 34(13):i386-i394","DOI:10.1093/bioinformatics/bty263"],"references":["334782476_PolySearch_a_web-based_text_mining_system_for_extracting_relationships_between_human_diseases_genes_mutations_drugs_and_metabolites","312284329_An_analysis_of_disease-gene_relationship_from_Medline_abstracts_by_DigSee","311246447_Text_Mining_Genotype-Phenotype_Relationships_from_Biomedical_Literature_for_Database_Curation_and_Precision_Medicine","309558759_AraPheno_A_public_database_for_Arabidopsis_thaliana_phenotypes","283776334_PhenoMiner_From_text_to_a_database_of_phenotypes_associated_with_OMIM_diseases","321990036_Cascade_word_embedding_to_sentence_embedding_A_class_label_enhanced_approach_to_phenotype_extraction","310785798_NELasso_Group-Sparse_Modeling_for_Characterizing_Relations_Among_Named_Entities_in_News_Articles","307955489_Distributed_representations_of_words_and_phrases_and_their_compositionality","293330746_Bridging_semantics_and_syntax_with_graph_algorithms-state-of-the-art_of_extracting_biomedical_relations","288250868_A_Review_of_Relational_Machine_Learning_for_Knowledge_Graphs"]}