{"id":"326100468_Modeling_second_language_writing_quality_A_structural_equation_investigation_of_lexical_syntactic_and_cohesive_features_in_source-based_and_independent_writing","abstract":"This study develops a model of second language (L2) writing quality in the context of a standardized writing test (TOEFL iBT) using a structural equation modeling (SEM) approach. A corpus of 480 test-takers’ responses to source-based and independent writing tasks was the basis for the model. Four latent variables were constructed: an L2 writing quality variable informed by scores of source-based and independent writing tasks, and lexical sophistication, syntactic complexity, and cohesion variables informed by lexical, syntactic, and cohesive features within the essays. The SEM analysis showed that an L2 writing quality model had a good fit, and was generalizable across writing prompts (with the exception of lexical features), gender, and learning contexts. The structural regression analysis indicated that 81.7% of the variance in L2 writing quality was explained by lexical decision reaction time scores (β = 0.932), lexical overlap between paragraphs (β = 0.434), and mean length of clauses via lexical decision reaction time scores (β = 0.607). These findings indicate that higher-rated essays tend to contain more sophisticated words that elicited longer response times in lexical decision tasks, greater lexical overlap between paragraphs, and longer clauses accompanying more sophisticated words. Implications for evaluating lexical, syntactic, and cohesive features in L2 writing are discussed.","authors":["Minkyung Kim","Scott A. Crossley"],"meta":["July 2018Assessing Writing 37:39-56","DOI:10.1016/j.asw.2018.03.002"],"references":["280289927_Does_writing_development_equal_writing_quality_A_computational_investigation_of_syntactic_complexity_in_L2_learners","321954622_Lexical_Sophistication_as_a_Multidimensional_Phenomenon_Relations_to_Second_Language_Lexical_Proficiency_Development_and_Writing_Quality","313877573_Using_Native-Speaker_Psycholinguistic_Norms_to_Predict_Lexical_Proficiency_and_Development_in_Second-Language_Production","297791199_The_development_and_use_of_cohesive_devices_in_L2_writing_and_their_relations_to_judgments_of_essay_quality","276831728_Predicting_Patterns_of_Grammatical_Complexity_Across_Language_Exam_Task_Types_and_Proficiency_Levels","223774109_The_Importance_of_Cohesive_Conditions_to_Perceptions_of_Writing_Quality_at_the_Early_Stages_of_Foreign_Language_Learning","223730797_Difference_in_written_discourse_in_independent_and_integrated_prototype_tasks_for_next_generation_TOEFL"]}