{"id":"326127348_Self-adaptive_Ensemble_Based_Differential_Evolution","abstract":"Differential evolution (DE) is among the more prominent branch of evolutionary algorithm (EA) innovated for multiple optimization properties. It has been improvised in various practical solutions, whether it is for benchmark testing or real world situations. As compared with other stochastic optimization algorithms such as nature inspired algorithms and evolutionary ones, DE possesses savvy traits in terms of exploration and exploitation within its own domain. With its motives of locating optimal points and minimized solution steps for objective functions, DE relied heavily on the necessity to specify parameter settings that is catered for achieving appropriate convergence values. The exhibited parameter value is seen directly correlated with the quality of the solutions for the underlying optimization problem. However, selection of appropriate parameter values occasionally necessitate for a priori experience and problem dependent on user. In most cases, users emphasize more on solving the optimization problem rather than solving the algorithm itself. Besides that, research work related to parameter study in DE lacks of proper and clear guidance to users. Therefore, there is a need to develop a DE which can adaptively determine the appropriate parameters to solve different optimization problems with minimum guidance from users. In this research, we take the opportunity to develop a DE model which combines self-adaptive and ensemble mechanisms to dynamically change the control parameters as well as mutation strategy during evolution with minimum intervention from users. The experimental results have shown that the proposed model is able to perform adequately well in twenty different benchmark problems without depending on user to determine the parameters explicitly. © 2018, International Association of Computer Science and Information Technology.","authors":["Shir Li Wang","Theam Foo Ng","Farid Morsidi"],"meta":["June 2018","DOI:10.18178/ijmlc.2018.8.3.701","Projects: Differential EvolutionHeuristic Self-Operated Mechanism in Differential Evolution"],"references":["292616241_Recent_Advances_in_Differential_Evolution_-_An_Updated_Survey","284013321_Self-adaptive_control_parameters_randomization_frequency_and_propagations_in_differential_evolution","284001168_Adaptive_Differential_Evolution_Algorithm_with_Novel_Mutation_Strategies_in_Multiple_Sub-populations","282160682_Differential_Evolution_with_Multi-Population_Based_Ensemble_of_Mutation_Strategies","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","299589306_A_novel_hybrid_decomposition-and-ensemble_model_based_on_CEEMD_and_GWO_for_short-term_PM25_concentration_forecasting","296687965_Differential_Evolution_With_Guiding_Archive_for_Global_Numerical_Optimization","283565951_A_differential_evolution_algorithm_with_self-adaptive_strategy_and_control_parameters_based_on_symmetric_Latin_hypercube_design_for_unconstrained_optimization_problems","281149836_A_Two-point_Estimate_Method_for_Uncertainty_Modeling_in_Multi-Objective_Optimal_Reactive_Power_Dispatch_Problem","280722428_Differential_evolution_algorithm_with_constraint_sequencing_An_efficient_approach_for_problems_with_inequality_constraints"]}