{"id":"326292661_Deep_Learning_and_Hand-Crafted_Feature_Based_Approaches_for_Polyp_Detection_in_Medical_Videos","abstract":"Video analysis including classification, segmentation or tagging is one of the most challenging but also interesting topics multimedia research currently try to tackle. This is often related to videos from surveillance cameras or social media. In the last years, also medical institutions produce more and more video and image content. Some areas of medical image analysis, like radiology or brain scans, are well covered, but there is a much broader potential of medical multimedia content analysis. For example, in colonoscopy, 20% of polyps are missed or incompletely removed on average [1]. Thus, automatic detection to support medical experts can be useful. In this paper, we present and evaluate several machine learning-based approaches for real-time polyp detection for live colonoscopy. We propose pixel-wise localization and frame-wise detection methods which include both handcrafted and deep learning based approaches. The experimental results demonstrate the capability of analyzing multimedia content in real clinical settings, the possible improvements in the work flow and the potential improved detection rates for medical experts.","authors":["Konstantin Pogorelov","Olga Ostroukhova","Mattis Jeppsson","Håvard Espeland"],"meta":["July 2018","DOI:10.1109/CBMS.2018.00073","Conference: 31st IEEE CBMS International Symposium on Computer-Based Medical Systems","Project: Medico - Automatic detection of disease in the GI tract benchmark"],"references":["318548710_Efficient_disease_detection_in_gastrointestinal_videos_-_global_features_versus_neural_networks","318011750_Retinal_Vessel_Segmentation_in_Fundoscopic_Images_with_Generative_Adversarial_Networks","316215961_KVASIR_A_Multi-Class_Image_Dataset_for_Computer_Aided_Gastrointestinal_Disease_Detection","313448887_Comparative_Validation_of_Polyp_Detection_Methods_in_Video_Colonoscopy_Results_From_the_MICCAI_2015_Endoscopic_Vision_Challenge","320968382_Xception_Deep_Learning_with_Depthwise_Separable_Convolutions","320114056_Comparison_of_hand-craft_feature_based_SVM_and_CNN_based_deep_learning_framework_for_automatic_polyp_classification","319770355_Generative_Adversarial_Nets","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","318811350_Automatic_Polyp_Detection_via_a_Novel_Unified_Bottom-Up_and_Top-Down_Saliency_Approach","316216011_Nerthus_A_Bowel_Preparation_Quality_Video_Dataset"]}