{"id":"326272532_Normative_foundations_of_human_cooperation","abstract":"A large literature shares the view that social norms shape human cooperation, but without a clean empirical identification of the relevant norms almost every behaviour can be rationalized as norm driven, thus rendering norms useless as an explanatory construct. This raises the question of whether social norms are indeed causal drivers of behaviour and can convincingly explain major cooperation-related regularities. Here, we show that the norm of conditional cooperation provides such an explanation, that powerful methods for its empirical identification exist and that social norms have causal effects. Norm compliance rests on fundamental human motives (‘social preferences’) that also imply a willingness to punish free-riders, but normative constraints on peer punishment are important for its effectiveness and welfare properties. If given the chance, a large majority of people favour the imposition of such constraints through the migration to institutional environments that enable the normative guidance of cooperation and norm enforcement behaviours. Fehr and Schurtenberger show that the prevailing evidence supports the view that social norms are causal drivers of human cooperation and explain major cooperation-related regularities. Norms also guide peer punishment and people have strong preferences for institutions that support norm formation.","authors":["Ernst Fehr","Ivo Schurtenberger"],"meta":["July 2018Nature Human Behaviour 2(7)","DOI:10.1038/s41562-018-0385-5"],"references":["325299581_The_many_Faces_of_Human_Sociality_Uncovering_the_Distribution_and_Stability_of_Social_Preferences","322948790_The_dynamics_of_norm_formation_and_norm_decay","321884364_Preschool_children_and_chimpanzees_incur_costs_to_watch_punishment_of_antisocial_others","356315086_Lab_Measures_of_Other-Regarding_Preferences_Can_Predict_Some_Related_On-the-Job_Behavior_Evidence_from_a_Large_Scale_Field_Experiment","336196070_Nominal_Wage_Rigidity_in_Village_Labor_Markets","331456158_Incorporating_Fairness_into_Game_Theory_and_Economics","330988124_Norms_in_the_Wild_How_to_Diagnose_Measure_and_Change_Social_Norms","321133411_Public_goods_games_and_psychological_utility_Theory_and_evidence","320751986_Creating_an_Efficient_Culture_of_Cooperation","320075513_The_Limits_to_Moral_Erosion_in_Markets_Social_Norms_and_the_Replacement_Excuse"]}