{"id":"326223085_UAV_based_wilt_detection_system_via_convolutional_neural_networks","abstract":"The significant role of plants can be observed through the dependency of animals and humans on them. Oxygen, materials, food and the beauty of the world are contributed by plants. Climate change, the decrease in pollinators, and plant diseases are causing a significant decline in both quality and coverage ratio of the plants and crops on a global scale. In developed countries, above 80 percent of rural production is produced by sharecropping. However, due to widespread diseases in plants, yields are reported to have declined by more than a half. These diseases are identified and diagnosed by the agricultural and forestry department. Manual inspection on a large area of fields requires a huge amount of time and effort, thereby reduces the effectiveness significantly. To counter this problem, we propose an automatic disease detection and classification method in radish fields by using a camera attached to an unmanned aerial vehicle (UAV) to capture high quality images from the fields and analyze them by extracting both color and texture features, then we used K-means clustering to filter radish regions and feeds them into a fine-tuned GoogleNet to detect Fusarium wilt of radish efficiently at early stage and allow the authorities to take timely action which ensures the food safety for current and future generations.","authors":["L. Minh Dang","Syed Ibrahim Hassan","Hyeonjoon Moon","Irfan Mehmood"],"meta":["July 2018Sustainable Computing: Informatics and Systems","Project: Development of ICT based Surveillance System for Fusarium Wilt of Radish"],"references":["320580118_Single_image_shadow_detection_and_removal_based_on_feature_fusion_and_multiple_dictionary_learning","319075107_A_Robust_Time_Synchronization_Scheme_for_Industrial_Internet_of_Things","316990364_UAV-Based_Traffic_Analysis_A_Universal_Guiding_Framework_Based_on_Literature_Survey","323958809_Latency_Estimation_Based_on_Traffic_Density_for_Video_Streaming_in_the_Internet_of_Vehicles","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318844274_Towards_an_efficient_risk_assessment_in_software_projects-Fuzzy_reinforcement_paradigm","317249699_Medical_image_classification_based_on_multi-scale_non-negative_sparse_coding","316863459_Mining_top-_k_co-occurrence_items_with_sequential_pattern","316849935_SIRSE_A_secure_identity_recognition_scheme_based_on_electroencephalogram_data_with_multi-factor_feature","316459784_Pattern_recognition_of_electromyography_signals_based_on_novel_time_domain_features_for_amputees'_limb_motion_classification"]}