{"id":"326262290_Human_Recognition_Based_On_Ear_Shape_Images_Using_PCA-Wavelets_and_Different_Classification_Methods","abstract":"A new approach of human recognition using ear images is introduced. It consists of two basic steps which are the ear segmentation and ear recognition. In the first one, Likelihood skin detector is used to determine the skin areas in the side face images. Then, some of the morphological operations are applied to determine the ear region. This region is extracted using image processing techniques. The ear recognition step depends on the segmented ear images as inputs. A hybrid PCA_Wavelet algorithm is used to extract the ear features from ear. Finally, the feed forwarding back propagation neural network is trained using the feature vectors. Tests which applied on 460 images, which have been taken during 4 months and under different illumination and pose variations, show that the system achieved a rate of 96.73% for ear extraction and 98.9% for recognition. More experiments are done to specify the best wavelet level, the best number of features, the best classification method, and the best threshold value. The study is also compared with other ones at the area of ear recognition.","authors":["Ali Mayya","Mariam Saii"],"meta":["September 2016Journal of Medical Devices 1(1)","DOI:10.15761/MDDE.1000103","Project: PhD Project"],"references":["265997950_Skin_Detection_-a_Short_Tutorial","264885464_Automatic_Ear_Recognition_System_using_Back_Propagation_Neural_Network","227288648_Ear_Biometrics","220809024_A_Genetic_Algorithm_for_Creating_a_Set_of_Color_Spaces_for_Ear_Authentication","261125798_Detector_adaptation_by_maximising_agreement_between_independent_data_sources","251887346_Combination_of_PCA_and_Wavelet_Transforms_for_Face_Recognition_on_25D_Images","228997656_Person_Identification_Using_Ear_Biometrics","224127299_Toward_Unconstrained_Ear_Recognition_From_Two-Dimensional_Images","222829209_Force_field_feature_extraction_for_ear_biometrics","220604353_Automated_human_identification_using_ear_imaging"]}