{"id":"326233667_Medical_students'_attitude_towards_artificial_intelligence_a_multicentre_survey","abstract":"Objectives: \nTo assess undergraduate medical students' attitudes towards artificial intelligence (AI) in radiology and medicine.\n\nMaterials and methods: \nA web-based questionnaire was designed using SurveyMonkey, and was sent out to students at three major medical schools. It consisted of various sections aiming to evaluate the students' prior knowledge of AI in radiology and beyond, as well as their attitude towards AI in radiology specifically and in medicine in general. Respondents' anonymity was ensured.\n\nResults: \nA total of 263 students (166 female, 94 male, median age 23 years) responded to the questionnaire. Around 52% were aware of the ongoing discussion about AI in radiology and 68% stated that they were unaware of the technologies involved. Respondents agreed that AI could potentially detect pathologies in radiological examinations (83%) but felt that AI would not be able to establish a definite diagnosis (56%). The majority agreed that AI will revolutionise and improve radiology (77% and 86%), while disagreeing with statements that human radiologists will be replaced (83%). Over two-thirds agreed on the need for AI to be included in medical training (71%). In sub-group analyses male and tech-savvy respondents were more confident on the benefits of AI and less fearful of these technologies.\n\nConclusion: \nContrary to anecdotes published in the media, undergraduate medical students do not worry that AI will replace human radiologists, and are aware of the potential applications and implications of AI on radiology and medicine. Radiology should take the lead in educating students about these emerging technologies.\n\nKey points: \n• Medical students are aware of the potential applications and implications of AI in radiology and medicine in general. • Medical students do not worry that the human radiologist or physician will be replaced. • Artificial intelligence should be included in medical training.","authors":["Daniel Pinto dos Santos","Daniel Giese","S. Brodehl","Seung-Hun Chon"],"meta":["July 2018European Radiology 29(4)","DOI:10.1007/s00330-018-5601-1","Project: Machine Learning in Radiology"],"references":["324033707_Toward_Augmented_Radiologists","323504157_Data_Science_Big_Data_Machine_Learning_and_Artificial_Intelligence","315344086_Toolkits_and_Libraries_for_Deep_Learning","323498892_Role_of_Big_Data_and_Machine_Learning_in_Diagnostic_Decision_Support_in_Radiology","318393770_R_A_Language_and_Environment_for_Statistical_Computing","318393712_R_A_Language_and_Environment_for_Statistical_Computing","316443493_Deep_Learning_at_Chest_Radiography_Automated_Classification_of_Pulmonary_Tuberculosis_by_Using_Convolutional_Neural_Networks","312957714_Implementing_Machine_Learning_in_Radiology_Practice_and_Research","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","311164170_Development_and_Validation_of_a_Deep_Learning_Algorithm_for_Detection_of_Diabetic_Retinopathy_in_Retinal_Fundus_Photographs","304368799_Machine_learning_approaches_in_medical_image_analysis_From_detection_to_diagnosis","281345608_Ggplot2_Elegant_Graphics_for_Data_Analysis","245585126_ggplot2_An_Implementation_of_the_Grammar_of_Graphics","200086112_A_Technique_for_Measurement_of_Attitudes"]}