{"id":"326234040_The_SOFIA_Focal_Plane_Imager_A_Highly_Sensitive_and_Fast_Photometer_for_the_Wavelength_Range_04_to_1_Micron","abstract":"The Stratospheric Observatory for Infrared Astronomy (SOFIA) is a heavily modified Boeing 747SP aircraft, accommodating a 2.7m infrared telescope. This airborne observation platform operates at flight altitudes of up to 13.7km (45,000ft) and therefore allows a nearly unobstructed view of the visible and infrared universe at wavelengths between 0.4μm and 1600μm. The Focal Plane Imager (FPI+) is SOFIA’s main tracking camera. It uses a commercial, off-the-shelf camera with a thermoelectrically cooled EMCCD. The back-illuminated sensor has a peak quantum efficiency greater than 95% at 550nm and the dark current is as low as 0.001 e-/pix/sec. Since 2015, the FPI+ has been available to the community as a Facility Science Instrument (FSI), and can be used as a high speed photometer for events in the visual wavelength range.\nThis paper presents a detailed overview of the design and optical configuration of the FPI+. Different settings and specifications of the camera are explained and the focal plane sensor is described. The camera’s performance in regards to sensitivity and frame rate is shown. The operation of the instrument is described as well as the support for guest observers throughout the process from proposing to data analysis. To date, SOFIA has conducted multiple FPI+ observations of stellar occultations, e.g. occultations by Pluto in 2011 and 2015, the occultation by 2014MU69 in July 2017 and the occultation by Triton in October 2017. Additionally, multiple observations of exo-planet transits have been observed with the FPI+. Throughout these observations, the FPI+ has proven to be an excellent photometer for astronomical events that have challenging requirements for sensitivity and temporal resolution.","authors":["Enrico Pfuller","Jurgen Wolf","Manuel Wiedemann"],"meta":["July 2018Journal of Astronomical Instrumentation 07(04)","DOI:10.1142/S2251171718400068"],"references":["337702137_Haze_in_Pluto's_atmosphere_Results_from_SOFIA_and_ground-based_observations_of_the_2015_June_29_Pluto_occultation","253056621_Pluto's_Atmosphere_Then_and_Now"]}