{"id":"326258149_Quelques_inegalites_de_superconcentration_theorie_et_applications","abstract":"Cette thèse porte sur le phénomène de superconcentration qui apparaît dans l'étude des fluctuations de divers modèles de la recherche actuelle (matrices aléatoires, verres de spins, champ libre gaussien discret, percolation,...). Plus particulièrement, la thèse est consacrée à l'examen d'inégalités de superconcentration à l'échelle exponentielle ; notamment pour des supremum de familles gaussiennes. Les outils mis en œuvre comprennent la propriété d'hypercontractivité de semi-groupes de Markov. Par ailleurs, celle-ci a conduit à une version d'ordre supérieur d'une inégalité sur la variance de M. Talagrand. La première partie de la thèse présente brièvement les notions essentielles de la théorie classique de la concentration de la mesure ainsi que les principaux outils, à savoir : méthodes d'interpolations à l'aide de semi-groupes markoviens, inégalités fonctionnelles, transport optimal et isopérimétrie. Un survol de la littérature existante est ensuite proposé. La deuxième partie du manuscrit rassemble, dans différents chapitres, les travaux que nous avons effectués durant cette thèse. Une grande partie de ceux-ci repose sur la représentation dynamique de la variance le long du semi-groupe d'Ornstein-Uhlenbeck et sa propriété d'hypercontractivité. De nouvelles inégalités de superconcentration sont obtenues au niveau exponentiel et illustrées sur des exemples provenant de la théorie des extrêmes. Le cadre de l'hypercontractivité a également conduit à une nouvelle inégalité sur le cube discret, celle-ci permettant une application sur l'influence d'ordre deux de fonctions booléennes. Enfin, le dernier chapitre aborde la phénomène de superconcentration par le transport optimal. Des majorations de la variance et des inégalités de déviations non asymptotiques pour le maximum de variables aléatoires indépendantes et de même loi sont obtenues. A nouveau, des illustrations pour des lois usuelles, appartenant aux différents domaines d'attraction de la théorie des extrêmes, sont proposées","authors":["Kevin Tanguy"],"meta":["June 2017"],"references":["308107162_On_the_energy_landscape_of_the_mixed_even_p-spin_model","303655913_Second_Order_Concentration_via_Logarithmic_Sobolev_Inequalities","299653176_Fluctuations_of_the_free_energy_in_the_mixed_p-spin_models_with_external_field","288713301_Parisi_Formula_Disorder_Chaos_and_Fluctuation_for_the_Ground_State_Energy_in_the_Spherical_Mixed_p-Spin_Models","325959905_Extrema_of_log-correlated_random_variables_Principles_and_examples","316956155_The_variance_of_the_ell_pn-norm_of_the_Gaussian_vector_and_Dvoretzky's_theorem","313367456_Superconcentration_and_randomized_Dvoretzky's_theorem_for_spaces_with_1-unconditional_bases","312131883_A_sharp_small_deviation_inequality_for_the_largest_eigenvalue_of_a_random_matrix","309738262_A_small_deviation_inequality_for_convex_functions","309634778_Gaussian_Processes_on_Trees_From_Spin_Glasses_to_Branching_Brownian_Motion","283993057_Transport_inequalities","285809848_A_new_proof_of_the_theorem_of_A_Dvoretzky_on_sections_of_convex_bodies","283869055_Every_monotone_graph_property_has_a_sharp_threshold","283762057_50_years_of_first_passage_percolation","283279908_Random_version_of_Dvoretzky's_theorem_in_ell_pn"]}