{"id":"326298598_On_the_model_checking_of_finite_state_transducers_over_semigroups","abstract":"Sequential reactive systems represent programs that interact with the environment by receiving signals or requests and react to these requests by performing operations with data. Such systems simulate various software like computer drivers, real-time systems, control procedures, online protocols etc. In this paper, we study the verification problem for the programs of this kind. We use finite state transducers over semigroups as formal models of reactive systems. We introduce a new specification language LP-CTL* to describe the behavior of transducers. This language is based on the well-known temporal logic CTL* and has two distinguished features: 1) each temporal operator is parameterized with a regular expression over input alphabet of the transducer, and 2) each atomic proposition is specified by a regular expression over the output alphabet of the transducer. We develop a tabular algorithm for model checking of finite state transducers over semigroups against LP-CTL* formulae, prove its correctness, and estimate its complexity. We also consider a special fragment of LP-CTL* language, where temporal operators are parameterized with regular expressions over one-letter alphabet, and show that this fragment may be used to specify usual Kripke structures, while it is more expressive than usual CTL*.","authors":["A.R. Gnatenko","Vladimir Zakharov"],"meta":["October 2018Proceedings of the Institute for System Programming of RAS 30(3):303-324","DOI:10.15514/ISPRAS-2018-30(3)-21"],"references":["228942683_Symbolic_Finite_State_Transducers_Algorithms_and_Applications","225504441_Yet_another_process_logic","317596082_Automatic_program_inversion_using_symbolic_transducers","301972339_Pattern-Based_Refinement_of_Assume-Guarantee_Specifications_in_Reactive_Synthesis","300468722_Equivalence_Checking_Problem_for_Finite_State_Transducers_over_Semigroups","234800433_The_unsolvability_of_the_Equivalence_Problem_for_L-Free_nondeterministic_generalized_machines","223035891_The_equivalence_of_finite_valued_transducers_on_HDT0L_languages_is_decidable","222717812_Temporal_logic_can_be_more_expressive","222504369_Dynamic_Linear_Time_Temporal_Logic","222365593_Single-valued_a-transducers"]}