{"id":"326283597_Morphological_modeling_of_cold_spray_coatings","abstract":"In this article, we study the microstructure of cold sprayed films of copper particles deposited onto a carbon fiber reinforced polymer. The microstructure of the coating is made of a packing of seemingly round-shaped particles of varying sizes embedded in a polymer matrix. The copper particles are separated by thin interstices. The coating is designed to cover the body of recent commercial aircrafts. Its role is to protect the aircraft from lightning impact by ensuring that the surface is conductive enough to evacuate electrical charges. A high resistivity contrast is observed between the copper particles and the polymer matrix. Therefore, the global resistivity of the material is highly dependent on the microstructure geometry.\n\nFollowing an approach commonly used in materials science, to investigate its influence on the electrical properties of the global material at the macroscopic scale, we design a 3D multiscale stochastic model that enables us to simulate the microstructure. The model is based upon a generalization of the classical JohnsonMehl tessellation, which accounts for the interstices that appear between copper particles. The method is very general and could potentially be applied to model any microstructure exhibiting similar interstices between aggregates of particles.","authors":["Vincent Bortolussi","Bruno Figliuzzi","François Willot","Matthieu Faessel"],"meta":["July 2018Image Analysis and Stereology 37(2):145","DOI:10.5566/ias.1894"],"references":["306277353_Use_of_watersheds_in_contour_detection","295120696_Modelling_the_microstructure_and_the_viscoelastic_behaviour_of_carbon_black_filled_rubber_materials_from_3D_simulations","278619568_A_Fourier-based_numerical_homogenization_tool_for_an_explosive_material","309449406_Stochastic_upscaling_of_heterogeneous_materials","305978989_Random_tessellations_in_Rd","305977186_Random_Johnson-Mehl_tessellations","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","285891007_Efficient_algorithms_for_globally_optimal_trajectories","280752432_SMIL_Simple_Morphological_Image_Library","278769816_A_Morphological_Approach_to_the_Modeling_of_the_Cold_Spray_Process"]}