{"id":"326208152_Can_Cryptocurrencies_Help_to_Pave_the_Way_to_a_More_Sustainable_Economy_Questioning_the_Economic_Growth_Paradigm","abstract":"The emergence of Blockchain technology entails myriad implications for actors across a diverse set of industry sectors. Focusing on the Blockchain as the data structure underlying cryptocurrencies, this chapter explores the potential of this technology to contribute to the broader societal goals of inter- and intra-generational equity commonly convened under the banner of sustainability. In particular, we examine how cryptocurrencies may alleviate a fundamental institutional driver for economic growth and facilitate the maintenance of a sustainable steady-state economy by displacing demand for debt-based money as a medium of exchange. In building this case, the chapter begins by considering the inexorable limits to economic growth implied by the bio-physical realities of our planet, and the inability of our current monetary systems to function effectively within these limits. The discussion then turns to the ways in which political reforms and alternative currencies could overcome this problem, before exploring the various advantages of cryptocurrencies over many of the alternative options. This line of argumentation amounts to a strong case for the further development of Blockchain technologies and especially cryptocurrencies, and one which may appeal to individuals far beyond the spheres of IT, business and finance.","authors":["Horst Treiblmaier","Dave Leonard"],"meta":["July 2018","DOI:10.1007/978-3-319-99058-3_7","In book: Business Transformation through BlockchainPublisher: Palgrave Macmillan","Project: Implications of Blockchain"],"references":["348310680_The_Impact_of_the_Economic_Crisis_in_the_Welfare_State","326468435_The_growth_paradigm_A_critique","278675783_Inflation_and_Income_Inequality_in_Developed_Economies","325788250_Response_diversity_ecosystem_change_and_resilience","320337833_Assessing_the_Differences_in_Bitcoin_Other_Cryptocurrency_Legality_Across_National_Jurisdictions","320181958_The_Entropy_Law_and_the_Economic_Process","312600815_Creating_New_Money_A_monetary_reform_for_the_information_age","293091673_Unsustainable_Development_Could_it_be_a_Ponzi_Scheme","291090060_Organization_for_Economic_Cooperation_and_Development","272262534_Hayek_Money_The_Cryptocurrency_Price_Stability_Solution"]}