{"id":"326273510_The_Roles_of_Transfer_of_Learning_and_Forgetting_in_the_Persistence_and_Fadeout_of_Early_Childhood_Mathematics_Interventions","abstract":"Although effective interventions have generated immediate positive effects on mathematics achievement, these effects often diminish over time, leading to the important question of what causes fadeout and persistence of intervention effects. This study investigates how children's forgetting contributes to fadeout and how transfer contributes to the persistence of effects of early childhood mathematics interventions. We also test whether having a sustaining classroom environment following an intervention helps mitigate forgetting and promote new learning. Students who received the intervention forgot more in the following year than students who did not, but forgetting accounted for only about one-quarter of the fadeout effect. A small offsetting, non-significant transfer effect accounted for some of the persistence of the intervention effect, approximately one-tenth of the end-of-program treatment effect and a quarter of the treatment effect one year later. These findings suggest that most of the fadeout was attributable to control-group students catching up to the treatment-group students in the year following the intervention. Finding ways to facilitate more transfer of learning in subsequent schooling could improve the persistence of early intervention effects.","authors":["Connie Y. Kang","Greg Duncan","Douglas H. Clements","Julie Sarama"],"meta":["July 2018Journal of Educational Psychology 111(4)","DOI:10.1037/edu0000297"],"references":["323864402_Memory_instability_as_a_gateway_to_generalization","317802946_Risky_business_Correlation_and_causation_in_longitudinal_studies_of_skill_development","315443274_A_Computational_Model_of_Fraction_Arithmetic","313696592_PK-3_What_Does_It_Mean_For_INstruction","307944850_Persistence_and_Fadeout_in_the_Impacts_of_Child_and_Adolescent_Interventions","306024878_Fadeout_in_an_Early_Mathematics_Intervention_Constraining_Content_or_Preexisting_Differences","284123208_The_environment_in_raising_early_intelligence_A_meta-analysis_of_the_fadeout_effect","324575012_Preschool_and_Children's_Outcomes_in_Elementary_School_Have_Patterns_Changed_Nationwide_Between_1998_and_2010","304399925_Realizing_Relevance_The_Influence_of_Domain-Specific_Information_on_Generation_of_New_Knowledge_Through_Integration_in_4-_to_8-Year-Old_Children","285521281_On_the_symbiosis_of_learning_remembering_and_forgetting"]}