{"id":"326266218_Mizdisciplinarnij_kontekst_formuvanna_tutorskoi_kompetentnosti_u_profesijnij_pidgotovci_majbutnih_uciteliv","abstract":"The author considers the problems of tutor competence development in future teachers professional training. The article explains the interdisciplinary nature of tutoring, presents the structure of tutor competence. It is determined that the structure of the tutor competence should identify pedagogical, psychological, methodological and IT competences. The analysis of scientific papers identifies these competences as important professional ones.It is concluded that an interdisciplinary approach to teachers professional training for tutor activity should be implemented by the following conditions for the links between different disciplines: integration of theory and practice of tutor support in teaching psychological and pedagogical subjects; exploring technologies in distance learning online environment while learning informatics courses and experience to participate in online educational environment; the use of ICT in the study of professional disciplines; comprehensive work on writing qualification works on problems of tutor support in terms of specialty.The author determines the technological component for implementation of tutor functions in the system of distance education content: the contents of computer science courses include introduction of distance learning technologies; future teachers gain experience working directly in the educational online environment both as a student and a teacher.Thus, the study of psychological, pedagogical and computer science courses and practical training in the online educational environment are the strong basis for the development of pedagogical, psychological, methodological and information technology components of the tutor competence.","authors":["Kateryna Osadcha"],"meta":["July 2018","Project: Professional training of future teachers for tutor activities"],"references":["291054827_INTERDISCIPLINARY_APPROACH_AS_A_PREREQUISITE_FOR_THE_DEVELOPMENT_OF_ECONOMICS_AND_EDUCATION"]}