{"id":"326294123_MMSFL-OWFB_A_novel_class_of_orthogonal_wavelet_filters_for_epileptic_seizure_detection","abstract":"The optimal filters with minimal bandwidth are highly desirable in many applications such as communication and biomedical signal processing. In this study, we design optimally frequency localized orthogonal wavelet filters and evaluate their performance using electroencephalogram (EEG) signals for automated detection of epileptic seizure. The paper presents a novel method for designing optimal orthogonal wavelet filter banks (OWFB) with the objective of minimizing their frequency spreads. The designed wavelet filter also possesses the desired degree of regularity. The regularity condition has been imposed analytically so as to satisfy the constraint accurately. We propose a novel semi-definite programming (SDP) formulation which does not involve any parametrization. The solution of the SDP yields optimal orthogonal wavelet filter for the given length of the filter. We have developed an automated diagnosis system that identifies epileptic seizure EEG signals using the features obtained from the designed minimally mean squared frequency localized (MMSFL) OWFB. We have tested the performance of the proposed model using two independent EEG databases in order to ensure the consistency and robustness of the model. Interestingly, the proposed MMSFL-OWFB feature-based model exhibits ceiling level of performance, with classification accuracy ≥ 99% in classifying seizure (ictal) and seizure-free (non-ictal) EEG signals for both databases. Our developed system can be employed in hospitals and community cares to aid the epileptologists in the accurate diagnosis of seizures.","authors":["Manish Sharma","Ankit Bhurane","U Rajendra Acharya"],"meta":["July 2018Knowledge-Based Systems 160","DOI:10.1016/j.knosys.2018.07.019","Project: Design of optimal filter banks for biomedical signal analysis"],"references":["325062664_An_accurate_sleep_stages_classification_system_using_a_new_class_of_optimally_time-frequency_localized_three-band_wavelet_filter_bank","324911889_Unified_Bayesian_Estimator_of_EEG_Reference_at_Infinity_rREST_Regularized_Reference_Electrode_Standardization_Technique","324444941_Deep_learning_for_healthcare_applications_based_on_physiological_signals_A_review","321778747_How_do_the_reference_montage_and_electrodes_setup_affect_the_measured_scalp_EEG_potentials","320072603_Deep_convolutional_neural_network_for_the_automated_detection_and_diagnosis_of_seizure_using_EEG_signals","319161466_A_novel_three-band_orthogonal_wavelet_filter_bank_method_for_an_automated_identification_of_alcoholic_EEG_signals","318676079_The_Effect_of_Electroencephalogram_EEG_Reference_Choice_on_Information-Theoretic_Measures_of_the_Complexity_and_Integration_of_EEG_Signals","318323224_A_novel_approach_to_detect_epileptic_seizures_using_a_combination_of_tunable-Q_wavelet_transform_and_fractal_dimension","324307177_Ten_Lectures_on_Wavelets","319023789_Classify_Epileptic_EEG_Signals_Using_Weighted_Complex_Networks_Based_Community_Structure_Detection"]}