{"id":"326226637_Adapting_Agile_Practices_in_University_Contexts","abstract":"Teaching agile practices has found its place in software engineering curricula in many universities across the globe. As a result, educators and students have embraced different ways to apply agile practices during their courses through lectures, games, projects, workshops and more for effective theoretical and practical learning. Practicing agile in university contexts comes with challenges for students and to counter these challenges, they perform some adaptations to standard agile practices making them effective and easier to use in university contexts. This study describes the constraints the students faced while applying agile practices in a university course taught at the University of Auckland, including difficulty in setting up common time for all team members to work together, limited availability of customer due to busy schedule and the modifications the students introduced to adapt agile practices to suit the university context, such as daily stand-ups with reduced frequency, combining sprint meetings, and rotating scrum master from team. In addition, it summarizes the effectiveness of these modifications based on reflection of the students. Recommendations for educators and students are also provided. Our findings and recommendations will help educators and students better coordinate and apply agile practices on industry-based projects in university contexts.","authors":["Zainab Masood","Rashina Hoda","Kelly Blincoe"],"meta":["July 2018Journal of Systems and Software 144","DOI:10.1016/j.jss.2018.07.011"],"references":["317600977_Being_Extreme_in_the_Classroom_experiences_Teaching_XP","303296552_How_Surveys_Tutors_and_Software_Help_to_Assess_Scrum_Adoption_in_a_Classroom_Software_Engineering_Project","262412335_Using_Scrum_in_a_quarter-length_undergraduate_software_engineering_course","262293615_Teaching_agile_methodology_in_a_software_engineering_capstone_course","261023323_Teaching_agile_software_development_at_university_level_Values_management_and_craftsmanship","311488670_Scrum_and_Agile_Methods_in_Software_Engineering_Courses","303296726_Teaching_Agile_addressing_the_conflict_between_project_delivery_and_application_of_Agile_methods","297325115_Adapting_XP_to_an_academic_environment_by_phasing-in_practices","282926964_Leveraging_scrum_principles_in_collaborative_inter-disciplinary_service-learning_project_courses","265092226_Basics_of_Grounded_Theory_Analysis_Emergence_vs_Forcing"]}