{"id":"326224220_Assessing_sustainability_in_North_America's_ecosystems_using_criticality_and_information_theory","abstract":"Sustainability is a key concept in economic and policy debates. Nevertheless, it is usually treated only in a qualitative way and has eluded quantitative analysis. Here, we propose a sustainability index based on the premise that sustainable systems do not lose or gain Fisher Information over time. We test this approach using time series data from the AmeriFlux network that measures ecosystem respiration, water and energy fluxes in order to elucidate two key sustainability features: ecosystem health and stability. A novel definition of ecosystem health is developed based on the concept of criticality, which implies that if a system’s fluctuations are scale invariant then the system is in a balance between robustness and adaptability. We define ecosystem stability by taking an information theory approach that measures its entropy and Fisher information. Analysis of the Ameriflux consortium big data set of ecosystem respiration time series is contrasted with land condition data. In general we find a good agreement between the sustainability index and land condition data. However, we acknowledge that the results are a preliminary test of the approach and further verification will require a multi-signal analysis. For example, high values of the sustainability index for some croplands are counter-intuitive and we interpret these results as ecosystems maintained in artificial health due to continuous human-induced inflows of matter and energy in the form of soil nutrients and control of competition, pests and disease.","authors":["Elvia Ramírez-Carrillo","Oliver López-Corona","Juan Claudio Toledo-Roy","Jon C. Lovett"],"meta":["June 2018PLoS ONE 13(7)","DOI:10.1371/journal.pone.0200382","Project: Health as criticality"],"references":["318560107_Criticality_in_the_brain_A_synthesis_of_neurobiology_models_and_cognition","303977641_A_Statistical_Physics_Characterization_of_the_Complex_Systems_Dynamics_Quantifying_Complexity_from_Spatio-Temporal_Interactions","301233215_Scaling_behaviour_of_heartbeat_intervals_obtained_by_wavelet-based_time-series_analysis","293168562_Heart_Rate_and_Systolic_Blood_Pressure_Variability_in_the_Time_Domain_in_Patients_with_Recent_and_Long-Standing_Diabetes_Mellitus","287249695_Dynamical_Criticality_Overview_and_Open_Questions","321620378_Critical_Phenomena_in_Natural_Sciences_Chaos_Fractals_Selforganization_and_Disorder_Concepts_and_Tools","318393712_R_A_Language_and_Environment_for_Statistical_Computing","318349837_Modeling_landscape_condition_for_biodiversity_assessment-Application_in_temperate_North_America","314243655_Complexity_of_lakes_in_a_latitudinal_gradient","303782632_How_is_ecosystem_health_defined_and_measured_A_critical_review_of_freshwater_and_estuarine_studies"]}