{"id":"326244362_Conceptual_Framework_for_Integrating_a_Wireless_Sensor_and_Control_Network_into_a_Robotics_Course_for_Senior_Students_of_Mechanical_Engineering_Technology","abstract":"Modern robotics is a field that integrates mechanical, electrical, computer and information systems. Therefore, students with knowledge of and practical experience in modern robotics will be more confident and competitive in tomorrow’s information society. However, students of Engineering Technology, especially Mechanical Engineering Technology (MET), are facing two dilemmas when taking robotics courses because technology programs mainly focus on hands-on skills and there are fewer fundamental robotics-related courses in the MET curriculum than in electrical engineering technology. First, one of the educational goals in MET is to cultivate future technologists rather than researchers. Therefore, the stronger emphasis of MET curricula on applications compared with mechanical engineering curricula impairs the students’ deeper understanding of the advanced concepts and theories required by modern robotics. Second, the limited number of robotics class hours constrain the extended application and practice of the knowledge related to advanced robotics. Therefore, devising an efficient educational approach for the robotics class of the MET program is desirable. \nIn order to find an appropriate method for overcoming the above-mentioned problems, an educational framework based on using a wireless sensor and control network was devised and employed in the senior-level robotics course “Sensor and Actuator Applications in Robotics”. This framework has two advantages over the former teaching methodology. First, it is low cost and used to facilitate conceptual education. It was implemented using popular and affordable mechatronics devices (Arduino development kit, sensors, wireless communication modules, actuators, etc.). The goal of the proposed educational framework is to eliminate the need for including advanced algorithms and optimization (data processing, noisy control, robust optimization, etc.). Instead, with this framework, the students are enabled to familiarize themselves with the principal concepts of robotics, practice the application of hardware and software, create their own innovative projects and prepare themselves for their entry into the job market, thus supporting the central educational goal of cultivating technologists in MET. Second, the devised ready-to-use framework avoids exposing the students to complicated algorithms and appropriately balances the students’ time between theory and practice, thus letting them focus more on the applications of robotics. Therefore, both the students and instructors can take advantage of the limited number of class hours to develop sophisticated projects. \nThe first step in the development of this educational approach was to conduct an assessment of the affected students. For that purpose, a student survey was administered in the course. This survey was designed to determine what the students wanted to get out of this course and to assess their abilities both in handling software and hardware. Based on the survey results and the assessment of the students’ abilities, the course was then redesigned. Subsequently, the students were instructed to familiarize themselves with basic sensors and actuators, the Arduino development kit and c-based programming with Arduino Integrated Development Environment (IDE). After the students had mastered the usage of the hardware and software, the framework was implemented into the course. Over the course of the semester, a series of homework and projects were assigned. Through these assignments, the students were able to build practical devices within the framework, including remotely controlled vehicles, a miniature smart building, a mobile controller, etc. In addition, the framework enhanced the students’ understanding of the fundamental concepts, and the practical applications inspired the students’ interest in this course, which also improved their performance","authors":["Zhou Zhang","Andy Zhang","Mingshao Zhang","Sven Esche"],"meta":["June 2018","DOI:10.18260/1-2--30215","Conference: 2018 ASEE Annual Conference & ExpositionAt: Salt Lake City, UT"],"references":["308796035_A_Smart_Method_for_Developing_Game-Based_Virtual_Laboratories","308795979_A_Virtual_Laboratory_System_with_Biometric_Authentication_and_Remote_Proctoring_Based_on_Facial_Recognition","283025520_Simultaneous_tracking_and_reconstruction_of_objects_and_its_application_in_educational_robotics_laboratories","278966707_Real-Time_3D_Reconstruction_for_Facilitating_the_Development_of_Game-based_Virtual_Laboratories","269333347_Integration_of_Physical_Devices_into_Game-based_Virtual_Reality","267596527_Real-Time_3D_Model_Reconstruction_and_Interaction_Using_Kinect_for_a_Game-Based_Virtual_Laboratory","222534027_Wireless_Sensor_Networks_A_Survey","267004023_Wireless_Sensor_and_Actuator_Networks_Algorithms_and_Protocols_for_Scalable_Coordination_and_Data_Communication","226290096_Topology_Control_for_Wireless_Sensor_Networks","220690734_Arduino_Cookbook_-_Recipes_to_Begin_Expand_and_Enhance_Your_Projects"]}