{"id":"326219431_Predicting_Successful_Collaboration_in_a_Pair_Programming_Eye_Tracking_Experiment","abstract":"The context of collaboration is of great importance. Attempts have been made to objectively define what comprises a successful collaboration. Questions like \"When can we say that a collaboration is successful?\" or \"Is there a way to predict that a collaboration would be successful?\" have been asked. In this paper, we look at the output of the collaboration, which are the debugging scores of the pairs, and we consider a collaboration to be successful if it leads to good debugging scores. We choose pair programming because it is an example of a collaboration paradigm. In order to find out what are the potential factors that could possibly predict success in the context of a pair program tracing and debugging task, we performed a dual eye tracking experiment on pairs of novice programmers. We tracked and recorded their fixation sequences and analyzed them using Cross-Recurrence Quantification Analysis (CRQA). Two machine learning algorithms were used, such as Naive Bayes and Logistic Regression. Our findings reveal that CRQA results alone are inadequate to come up with a model with an acceptable performance. Hence, we added the pairs' proficiency level to the model. Between the two models, the Logistic Regression model turned out to be the better model. However, the performance is still not quite unacceptable to predict success so other features are needed to enhance the model.","authors":["Maureen Villamor","Ma. Mercedes Rodrigo"],"meta":["July 2018","DOI:10.1145/3213586.3225234","Conference: Adjunct Publication of the 26th Conference","Project: Eye Tracking and Pair Programming"],"references":["258845782_Real-time_mutual_gaze_perception_enhances_collaborative_learning_and_collaboration_quality_International_Journal_of_Computer-Supported_Collaborative_Learning_84_375-397","243778765_The_Construction_of_Shared_Knowledge_in_Collaborative_Problem_Solving","230786738_Eye_tracking_in_human-computer_interaction_and_usability_research_Current_status_and_future_prospects","224922255_Selection_of_recurrence_threshold_for_signal_detection","222408325_The_effectiveness_of_pair_programming_A_meta-analysis","220811090_A_Method_to_Study_Visual_Attention_Aspects_of_Collaboration_Eye-Tracking_Pair_Programmers_Simultaneously","284858203_Eye_tracking_in_HCI_and_usability_research","283622235_Dual_Eye-Tracking_Methods_for_the_Study_of_Remote_Collaborative_Problem_Solving","234817247_Assessing_distributed_pair_programming","222393956_Nonlinear_analysis_of_bivariate_data_with_cross_recurrence_plots"]}