{"id":"326237067_Information_and_communication_technologies_and_computer_science_The_process_of_curriculum_development","abstract":"The purpose of study is to revise the existing curriculum of \"Information and Communication Technologies and Software\" course, which covers the subjects related with computing and technology use and make students prepared for the future, in order to graduate students donated with necessary knowledge and skills by continuous improvement. During this study, needs analysis has been done, problems has been determined, literature review is done, theoretical framework was established, stakeholder opinions were taken and the existing software and resources were examined. In addition to these, discussions were made about the content of the curriculum with teachers in the workshops, the expectations of the teachers about the teaching methods were taken and the objectives of the contents were written jointly. At the last stage, examinations were made in terms of competencies and values, measurement and evaluation approaches were determined, suggestions for teaching of the course were prepared and a draft curriculum was established. However, the point which is as important as the revision of curriculum is the effective implementation if the program in related ages in all over the country. Thus, suggestions according to this point is also provided within the study.","authors":["Yasemin Gulbahar","Filiz Kalelioglu"],"meta":["January 2018Milli Egitim 1(217):5-23"],"references":["312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","273758977_Teaching_Programming_with_Computational_and_Informational_Thinking","234810765_Computational_thinking_for_youth_in_practice","220420371_Computational_thinking","286704874_Teaching_mode_reform_and_exploration_on_the_University_Computer_Basic_based_on_Computational_thinking_training_in_Network_Environment","280559547_To_Block_or_not_to_Block_That_is_the_Question_Students'_Perceptions_of_Blocks-based_Programming","261307432_Work_in_progress_ACTIVATE_Advancing_computing_and_technology_interest_and_innovation_through_teacher_education","261047323_A_longitudinal_study_of_the_effects_of_a_high_school_robotics_and_computational_thinking_class_on_academic_achievement_WIP","224148764_A_computational_introduction_to_STEM_studies"]}