{"id":"326224348_A_Survey_of_Robotics_Control_Based_on_Learning-Inspired_Spiking_Neural_Networks","abstract":"Biological intelligence processes information using impulses or spikes, which makes those living creatures able to perceive and act in the real world exceptionally well and outperform state-of-the-art robots in almost every aspect of life. To make up the deficit, emerging hardware technologies and software knowledge in the fields of neuroscience, electronics, and computer science have made it possible to design biologically realistic robots controlled by spiking neural networks (SNNs), inspired by the mechanism of brains. However, a comprehensive review on controlling robots based on SNNs is still missing. In this paper, we survey the developments of the past decade in the field of spiking neural networks for control tasks, with particular focus on the fast emerging robotics-related applications. We first highlight the primary impetuses of SNN-based robotics tasks in terms of speed, energy efficiency, and computation capabilities. We then classify those SNN-based robotic applications according to different learning rules and explicate those learning rules with their corresponding robotic applications. We also briefly present some existing platforms that offer an interaction between SNNs and robotics simulations for exploration and exploitation. Finally, we conclude our survey with a forecast of future challenges and some associated potential research topics in terms of controlling robots based on SNNs.","authors":["Zhenshan Bing","Claus Meschede","Florian Röhrbein","Kai Huang"],"meta":["July 2018Frontiers in Neurorobotics 12","DOI:10.3389/fnbot.2018.00035","Project: Bachelor's Thesis"],"references":["317166774_A_Heterosynaptic_Spiking_Neural_System_for_the_Development_of_Autonomous_Agents","317017771_A_computational_model_of_conditioning_inspired_by_Drosophila_olfactory_system","314306341_Motor-Skill_Learning_in_an_Insect_Inspired_Neuro-Computational_Control_System","344988850_III3_Theory_of_the_Backpropagation_Neural_Network","319770411_Torch7_A_Matlab-like_Environment_for_Machine_Learning","318329361_A_self-driving_robot_using_deep_convolutional_neural_networks_on_neuromorphic_hardware","315970635_Towards_autonomous_locomotion_CPG-based_control_of_smooth_3D_slithering_gait_transition_of_a_snake-like_robot","313956570_Robotic_implementation_of_classical_and_operant_conditioning_within_a_single_SNN_architecture","313805444_Ultra-low_energy_neuromorphic_device_based_navigation_approach_for_biomimetic_robots","313532346_Toward_biomorphic_control_using_a_custom_a_VLSI_CPG_chips"]}