{"id":"326275066_The_trials_of_evidence-based_practice_in_education_a_systematic_review_of_randomised_controlled_trials_in_education_research_1980-2016","abstract":"Background: The use of randomised controlled trials (RCTs) in education has increased significantly over the last 15 years. However, their use has also been subject to sustained and rather trenchant criticism from significant sections of the education research community. Key criticisms have included the claims that: it is not possible to undertake RCTs in education; RCTs are blunt research designs that ignore context and experience; RCTs tend to generate simplistic universal laws of ‘cause and effect’; and that they are inherently descriptive and contribute little to theory.\nPurpose: This article seeks to assess the above four criticisms of RCTs by considering the actual evidence in relation to the use of RCTs in education in practice.\nDesign and methods: The article is based upon a systematic review that has sought to identify and describe all RCTs conducted in educational settings and including a focus on educational outcomes between 1980 and 2016. The search is limited to articles and reports published in English.\nResults: The systematic review found a total of 1017 unique RCTs that have been completed and reported between 1980 and 2016. Just over three quarters of these have been produced over the last 10 years, reflecting the significant increase in the use of RCTs in recent years. Overall, just over half of all RCTs identified were conducted in North America and a little under a third in Europe. The RCTs cover a wide range of educational settings and focus on an equally wide range of educational interventions and outcomes. The findings not only disprove the claim that it is not possible to do RCTs in education but also provide some supporting evidence to challenge the other three key criticisms outlined earlier.\nConclusions: While providing evidence to counter the four criticisms outlined earlier, the article suggests that there remains significant progress to be made. The article concludes by outlining some key challenges for researchers undertaking RCTs in education.","authors":["Paul Connolly","Ciara Keenan","Karolina Urbanska"],"meta":["July 2018Educational Research 60(3):1-16","DOI:10.1080/00131881.2018.1493353"],"references":["281071595_The_PRISMA_Statement_for_Reporting_Systematic_Reviews_and_Meta-Analyses_of_Studies_That_Evaluate_Health_Care_Interventions_Explanation_and_Elaboration","237931382_Randomised_Controlled_Trials_for_Evidence-based_Education_Some_Problems_in_Judging_'What_Works'","318983584_Using_Randomised_Controlled_Trials_in_Education","312628083_The_trials_of_evidence-based_education_The_Promises_Opportunities_and_Problems_of_Trials_in_Education","312085950_Designing_randomised_trials_in_health_education_and_the_social_sciences_An_introduction","271831938_Research_Methods_in_Education","270960149_Research_Methods_In_Education","259999142_Cochrane_Handbook_for_Systematic_Reviews_of_Interventions","248994774_Making_Evidence-Based_Practice_Educational","239391379_A_Systematic_Review_of_Busways"]}