{"id":"326249101_Evaluating_a_Blended_Online_Learning_Model_Among_Undergraduate_Nursing_Students_A_Quantitative_Study","abstract":"In Australia, the emerging use of technology in higher education has brought about significant change in the delivery of undergraduate nursing programs. Universities are now tasked with delivering a blend of online and face-to-face education, while students face new and sometimes challenging online learning environments with little technical support. This article explores the attitudes held by Bachelor of Nursing students toward the blended educational mode at a rural university in Victoria, Australia. A total of 109 participants constituted a convenience sample from a Bachelor of Nursing program across all 3-year levels. Responses provided by participants who completed an online self-report questionnaire were analyzed via descriptive and inferential statistics. The results indicated that participants struggled with inaccurate expectations of workload and the technical difficulties presented by online modules. Although this area requires further research, to an extent autonomy and flexibility were identified as two prominent traits exhibited by students who flourished in the blended modes. All in all, the results of this study strongly reflect the challenges faced by undergraduate nursing students navigating newly introduced online systems in a blended mode of study.","authors":["Marianne Ota","Blake Peck","Dr Joanne Porter"],"meta":["July 2018Computers, informatics, nursing: CIN 36(10):1","DOI:10.1097/CIN.0000000000000456"],"references":["233380074_Self-determined_blended_learning_A_case_study_of_blended_learning_design","24186015_Blended_learning_in_education_Effects_on_knowledge_and_attitude","293025898_Blended_learning_within_an_undergraduate_exercise_physiology_laboratory","239942706_Evaluation_of_a_blended_learning_model_in_geriatric_medicine_A_successful_learning_experience_for_medical_students","236637868_The_use_of_blended_learning_to_create_a_module_about_ill-health_during_childbirth_for_pre-registration_midwifery_students","233369932_How_Much_Does_the_Distance_in_Distance_Education_Matter_Our_Students_Speak","45286568_Developing_competence_in_cardiac_care_through_the_use_of_blended_learning_Course_members'_and_mentors'_accounts","26285806_Perceptions_of_distance_education_among_nursing_faculty_members_in_North_America","5941337_The_expectations_and_experiences_of_blended_learning_approaches_to_patient_safety_education"]}