{"id":"326204431_A_Computational_Intelligence_System_Identifying_Cyber-Attacks_on_Smart_Energy_Grids","abstract":"According to the latest projections of the International Energy Agency, smart grid technologies have become essential to handling the radical changes expected in international energy portfolios through 2030. A smart grid is an energy transmission and distribution network enhanced through digital control, monitoring, and telecommunication capabilities. It provides a real-time, two-way flow of energy and information to all stakeholders in the electricity chain, from the generation plant to the commercial, industrial, and residential end user. New digital equipment and devices can be strategically deployed to complement existing equipment. Using a combination of centralized IT and distributed intelligence within critical system control nodes ranging from thermal and renewable plant controls to grid and distribution utility servers to cities, commercial and industrial infrastructures, and homes a smart grid can bring unprecedented efficiency and stability to the energy system. Information and communication infrastructures will play an important role in connecting and optimizing the available grid layers. Grid operation depends on control systems called Supervisory Control and Data Acquisition (SCADA) that monitor and control the physical infrastructure. At the heart of these SCADA systems are specialized computers known as Programmable Logic Controllers (PLCs). There are destructive cyber-attacks against SCADA systems as Advanced Persistent Threats (APT) were able to take over the PLCs controlling the centrifuges, reprogramming them in order to speed up the centrifuges, leading to the destruction of many and yet displaying a normal operating speed in order to trick the centrifuge operators and finally can not only shut things down but can alter their function and permanently damage industrial equipment. This paper proposes a computational intelligence System for Identification Cyber-Attacks on the Smart Energy Grids (SICASEG). It is a big data forensics tool which can capture, record, and analyze the smart energy grid network events to find the source of an attack to both prevent future attacks and perhaps for prosecution. © 2018, Springer International Publishing AG, part of Springer Nature.","authors":["Konstantinos Demertzis","Lazaros S. Iliadis"],"meta":["July 2018","DOI:10.1007/978-3-319-74325-7_5","In book: Modern Discrete Mathematics and Analysis (pp.97-116)","Project: Smart Energy Grids"],"references":["333797924_Commentary_Aedes_albopictus_and_Aedes_japonicus-two_invasive_mosquito_species_with_different_temperature_niches_in_Europe","326051538_Soft_computing_forecasting_of_cardiovascular_and_respiratory_incidents_based_on_climate_change_scenarios","321011261_The_Impact_of_Climate_Change_on_Biodiversity_The_Ecological_Consequences_of_Introduced_Species_in_Greece","320282247_A_Hybrid_Soft_Computing_Approach_Producing_Robust_Forest_Fire_Risk_Indices","320020386_Comparative_Analysis_of_Exhaust_Emissions_caused_by_Chainsaws_with_Soft_Computing_and_Statistical_Approaches","319036562_A_Hybrid_Soft_Computing_Approach_Producing_Robust_Forest_Fire_Risk_Indices","318851417_Hybrid_Soft_Computing_Analytics_of_Cardiorespiratory_Morbidity_and_Mortality_Risk_Due_to_Air_Pollution","318822219_A_Spiking_One-Class_Anomaly_Detection_Framework_for_Cyber-Security_on_Industrial_Control_Systems","347549427_The_Smart_Grid_Enabling_Energy_Efficiency_and_Demand_Response","336585582_Intrusion_Detection_via_Machine_Learning_for_SCADA_System_Protection"]}