{"id":"326344970_A_Survey_and_Taxonomy_of_Self-Aware_and_Self-Adaptive_Cloud_Autoscaling_Systems","abstract":"Autoscaling system can reconfigure cloud-based services and applications, through various configurations of cloud so ware and provisions of hardware resources, to adapt to the changing environment at runtime. Such a behavior offers the foundation for achieving elasticity in modern cloud computing paradigm. Given the dynamic and uncertain nature of the shared cloud infrastructure, cloud autoscaling system has been engineered as one of the most complex, sophisticated and intelligent artifacts created by human, aiming to achieve self-aware, self-adaptive and dependable runtime scaling. Yet, existing Self-aware and Self-adaptive Cloud Autoscaling System (SSCAS) is not mature to a state that it can be reliably exploited in the cloud. In this article, we survey the state-of-the-art research studies on SSCAS and provide a comprehensive taxonomy for this eld. We present detailed analysis of the results and provide insights on open challenges, as well as the promising directions that are worth investigated in the future work of this area of research. Our survey and taxonomy contribute to the fundamentals of engineering more intelligent autoscaling systems in the cloud.","authors":["Tao Chen","Rami Bahsoon","Xin Yao"],"meta":["June 2018ACM Computing Surveys 51(3)","DOI:10.1145/3190507"],"references":["324235317_To_Adapt_or_Not_to_Adapt_Technical_Debt_and_Learning_Driven_Self-Adaptation_for_Managing_Runtime_Performance","318841084_CHOPPER_an_intelligent_QoS-aware_autonomic_resource_management_approach_for_cloud_computing","318539615_Auto-scaling_Web_Applications_in_Clouds_A_Cost-Aware_Approach","318410957_Improving_Resource_Efficiency_of_Container-Instance_Clusters_on_Clouds","318407944_KPI-Agnostic_Control_for_Fine-Grained_Vertical_Elasticity","317297877_Elasticity_in_Cloud_Computing_State_of_the_Art_and_Research_Challenges","313373162_Model-driven_optimal_resource_scaling_in_cloud","319637448_A_Stochastic_Optimization_Approach_for_Cloud_Elasticity","312576689_Workload_and_Resource_Aware_Proactive_Auto-scaler_for_PaaS_Cloud","312571012_Auto-tuning_Performance_of_MPI_Parallel_Programs_Using_Resource_Management_in_Container-Based_Virtual_Cloud"]}