{"id":"326313296_JythonMusic_An_Environment_for_Developing_Interactive_Music_Systems","abstract":"JythonMusic is a software environment for developing interactive musical experiences and systems. It is based on jMusic, a software environment for computer-assisted composition, which was extended within the last decade into a more comprehensive framework providing composers and software developers with libraries for music making, image manipulation, building graphical user interfaces, and interacting with external devices via MIDI and OSC, among others. This environment is free and open source. It is based on Python, therefore it provides more economical syntax relative to Java- and C/C++-like languages. JythonMusic rests on top of Java, so it provides access to the complete Java API and external Java-based libraries as needed. Also, it works seamlessly with other tools, such as Pd, Max/MSP, and Processing, among others. The paper provides an overview of important JythonMusic libraries related to constructing interactive musical experiences. It also discusses several projects developed using JythonMusic, which include interactive sound art installations, new interfaces for sound manipulation and spatialization, as well as various explorations on mapping among motion, gesture and music.","authors":["Bill Manaris","Pangur Brougham- Cook","Dana Hughes","Andrew R. Brown"],"meta":["June 2018","Conference: New Interfaces for Musical ExpressionAt: Blacksburg, VA","Project: Music Information Retrieval, Computational Aesthetics, and Artificial Creativity"],"references":["327075959_SoundMorpheus_A_Myoelectric-Sensor_Based_Interface_for_Sound_Spatialization_and_Shaping","303808538_JythonMusic_An_environment_for_teaching_algorithmic_music_composition_dynamic_coding_and_musical_performativity","289495366_ChucK_A_Strongly_Timed_Computer_Music_Language","265164868_miniAudicle_for_iPad_Touchscreen-based_Music_Software_Programming","261847581_Dropping_CS_enrollments_Or_the_emperor's_new_clothes","324334542_Interactive_Music_Systems_Machine_Listening_and_Composing","318494464_Pure_data_another_integrated_computer_music_environment","276350038_Monterey_Mirror_an_experiment_in_interactive_music_performance_combining_evolutionary_computation_and_Zipf's_law","271966603_Making_Music_with_Computers_Creative_Programming_in_Python","269968345_Classification_of_Musical_Instruments_Translated_from_the_Original_German_by_Anthony_Baines_and_Klaus_P_Wachsmann"]}