{"id":"326330793_Automated_Sewer_Pipeline_Inspection_Using_Computer_Vision_Techniques","abstract":"To facilitate condition assessment in sewer pipeline networks current practice is using the available technologies to visually inspect the internal condition of pipelines. Closed circuit television (CCTV) has been one of the most used methods in North American municipalities in last decades. However, this method requires hours of videos to be inspected by certified inspectors which is time consuming, labor intensive, and error prone. The main objective of this research is to propose an automated approach for inspection and condition assessment of sewer pipelines using computer vision techniques. This research includes two main part: identifying region of interest (ROI) in sewer inspection videos which are most likely to contain sewer defects, and defect detection and classification among the identified anomalous frames. The ROI detection model employs proportional data modeling using hidden Markov models (HMM) to extract abnormal frames from sewer CCTV videos. In the next step, a deep learning approach using convolutional neural networks (CNN) is proposed to detect the defects and classify them. The presented algorithm has been developed and tested using the data sets from CCTV inspection reports.","authors":["Saeed Moradi","Tarek Zayed","Farzaneh Golkhoo"],"meta":["July 2018","DOI:10.1061/9780784481653.064","Conference: Pipelines 2018"],"references":["44742953_Video_Processing_Techniques_for_Assisted_CCTV_Inspection_and_Condition_Rating_of_Sewers","3302251_Face_Recognition_A_Convolutional_Neural_Network_Approach","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","288260378_The_handbook_of_brain_theory_and_neural_networks","275182826_Integrated_Vision-Based_System_for_Automated_Defect_Detection_in_Sewer_Closed_Circuit_Television_Inspection_Videos","259518040_Optical_flow_techniques_for_estimation_of_camera_motion_parameters_in_sewer_closed_circuit_television_inspection_videos","245136722_Automated_detection_of_cracks_in_buried_concrete_pipe_images","238720759_Speech_Audio_Image_and_Biomedical_Signal_Processing_using_Neural_Networks","223800730_Segmentation_of_buried_concrete_pipe_images","222732098_Automated_defect_detection_for_sewer_pipeline_inspection_and_condition_assessment","30873241_Automated_detection_of_surface_defects_in_water_and_sewer_pipes"]}