{"id":"326326395_MaxWhere_VR-learning_improves_effectiveness_over_clasiccal_tools_of_e-learning","abstract":"The paper investigates how workflows can be communicated and shared through linguistic descriptions, digital content and technological tools. We focus primarily on the content and digital tools of e-learning and VR learning, however the results of the paper can be applied to collaborative workflows in general. The paper compares the effectiveness of three techniques, ranging from well-known to radically new: classical e-mail / attachment based sharing, sharing through web interfaces (through a Moodle frontend), and sharing through a VR interface provided by a recently developed VR engine called MaxWhere. To this end, the paper introduces new methods and a new set of concepts for the purposes of benchmarking digital capabilities and user effectiveness within the domain of workflow sharing. The paper applies these concepts and methods to compare the use of the above listed technologies with the participation of 379 test subjects. Tests shows that the users were able to complete the required workflow at least 50% faster in the MaxWhere 3D environment than in all other competing cases. The paper also proves that 3D environments are capable of providing users with a much higher level of comprehension when it comes to sharing and interpreting digital workflows.","authors":["Ildikó Horváth","Bálint Lampert","Attila Pongracz","Judit Sipos"],"meta":["July 2018Acta Polytechnica Hungarica 15(3)","Projects: 3D/VR technology3D VR spaces in education"],"references":["313026009_Cost-effective_hand_gesture_computer_control_interface","312574890_When_brands_come_to_life_experimental_research_on_the_vividness_effect_of_Virtual_Reality_in_transformational_marketing_communications","312113959_Innovative_engineering_education_in_the_cooperative_VR_environment","309936836_Eye-Tracking_Analysis_of_Computer_Networks_Exam_Question_Besides_Different_Skilled_Groups","328761028_Innovative_engineering_education_in_the_cooperative_VR_environmen","322707112_The_IT_device_demand_of_the_edu-coaching_method_in_the_higher_education_of_engineering","315872036_Advertising_perception_with_immersive_virtual_reality_devices","312370129_How_virtual_reality_affects_perceived_learning_effectiveness_a_task-technology_fit_perspective","312115180_Disruptive_technologies_in_higher_education","311751589_Direct_manipulation_is_better_than_passive_viewing_for_learning_anatomy_in_a_three-dimensional_virtual_reality_environment"]}