{"id":"326337319_A_Multi-Institutional_Perspective_on_HFOSS_Projects_in_the_Computing_Curriculum","abstract":"Many computer science programs have capstone experiences or project courses that allow students to integrate knowledge from the full breadth of their major. Such capstone projects may be student-designed, instructor-designed, designed in conjunction with outside companies, or integrated with ongoing free and open source (FOSS) projects. The literature shows that the FOSS approach has attracted a great deal of interest, in particular when implemented with projects that have humanitarian goals (HFOSS). In this article, we describe five unique models from five distinct types of institutions for incorporating sustained FOSS or HFOSS (alternatively H/FOSS) project work into capstone experiences or courses. The goal is to provide instructors wishing to integrate open source experiences into their curriculum with additional perspectives and resources to help in adapting this approach to the specific needs and goals of their institution and students. All of the models presented are based on sustained engagement with H/FOSS projects that last at least one semester and often more. Each model is described in terms of its characteristics and how it fits the needs of the institution using the model. Assessment of each model is also presented. We then discuss the themes that are common across the models, such as project selection, team formation, mentoring, and student assessment. We examine the choices made by each model, as well as the challenges faced. We end with a discussion how the models have leveraged institutional initiatives and collaborations with outside organizations to address some of the challenges associated with these projects.","authors":["Grant Braught","Bonnie Mackellar","Allen B. Tucker","John Maccormick"],"meta":["July 2018ACM Transactions on Computing Education 18(2):1-31","DOI:10.1145/3145476","Project: Non-Profit FOSS Institute"],"references":["316075237_TECH_STARTUPS_REALISTIC_SOFTWARE_ENGINEERING_PROJECTS_WITH_INTERDISCIPLINARY_COLLABORATION","311314022_Utilizing_open_source_software_in_teaching_practice-based_software_engineering_courses","291998049_Shaping_Software_Engineering_Curricula_using_Open_Source_Communities","330311210_Software_Development_An_Open_Source_Approach","319394075_The_Mythical_Man-Month","316948051_A_Two-Course_Sequence_of_Real_Projects_for_Real_Customers","316858624_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","312485346_Experience_Report_Guiding_Faculty_Students_to_Participate_in_Humanitarian_FOSS_Communities","301391453_Learning_within_a_professional_environment","300116169_A_Multi-Institutional_Study_of_Learning_via_Student_Involvement_in_Humanitarian_Free_and_Open_Source_Software_Projects"]}