{"id":"326378136_Autism_and_virtual_reality_head-mounted_displays_a_state_of_the_art_systematic_review","abstract":"Purpose – The use of virtual reality (VR) technologies in the education of autistic children has been a focus of research for over two decades. It is argued that this form of technology can provide authentic “real world” contexts that target social and life skills training in safe, controllable and repeatable virtual environments. The development of affordable VR head-mounted displays (HMD), such as Google cardboard and Oculus Rift, has seen a renewed interest in their use for a wide range of applications, including the education of autistic individuals. The paper aims to discuss these issues.\nDesign/methodology/approach – A systematic search of electronic databases focussing on empirical studies on the use of VR-HMD for children and adults on the autism spectrum was undertaken.\nFindings – A review of the literature identified a limited number of studies in this field characterised by differences in the type of application, technology used and participant characteristics.\nResearch limitations/implications – Whilst there are some grounds for optimism, more research is needed on the use of this technology within educational settings to ensure robust recommendations can be made on the implementation, use and sustainability of this approach.\nOriginality/value – This paper is the first to consider the evidence base for the use of VR-HMD technology to support the needs of the autistic population.\nKeywords Autism, Assessment, Learning, Education, Virtual reality, Head-mounted display Paper type Literature review","authors":["Ryan Bradley","Nigel Newbutt"],"meta":["July 2018Journal of Enabling Technologies 12(02)","DOI:10.1108/JET-01-2018-0004"],"references":["321096501_The_opportunities_of_virtual_reality_in_the_rehabilitation_of_children_with_attention_deficit_hyperactivity_disorder_A_literature_review","316697278_Virtual_Reality_in_Pediatric_Psychology","320751427_Daily_Living_Skills_Training_in_Virtual_Reality_to_Help_Children_with_Autism_Spectrum_Disorder_in_a_Real_Shopping_Scenario","320384783_A_study_on_cyber_sickness_reduction_by_oculo-motor_exercise_performed_immediately_prior_to_viewing_virtual_reality_VR_content_on_head_mounted_display_HMD","320104793_A_Study_on_Development_Trends_of_Chinese_Game_Technology","319989237_Technology_use_as_a_support_tool_by_secondary_students_with_autism","318698137_Does_visualize_industries_matter_A_technology_foresight_of_global_Virtual_Reality_and_Augmented_Reality_Industry","318157465_Virtual_Reality_Self_Induced_Cybersickness_An_Exploratory_Study","315976738_Vocational_Rehabilitation_of_Individuals_with_Autism_Spectrum_Disorder_with_Virtual_Reality","306097302_Authenticity_in_Virtual_Reality_for_assessment_and_intervention_in_Autism_A_Conceptual_Review"]}