{"id":"326331365_Cognitive_Management_of_Bandwidth_Allocation_Models_with_Case-Based_Reasoning_-_Evidences_Towards_Dynamic_BAM_Reconfiguration","abstract":"Management is a complex task in today's heterogeneous and large scale networks like Cloud, Internet of Things (IoT) , vehicular and Multiprotocol Label Switching (MPLS) networks. Likewise, researchers and developers envision the use of artificial intelligence techniques to create cognitive and autonomic management tools that aim better assist and enhance the management process cycle. Bandwidth Allocation Models (BAMs) are a resource allocation solution for networks that need to share and optimize limited resources like bandwidth, fiber or optical slots in a flexible and dynamic way. This paper proposes and evaluates the use of Case-based Reasoning (CBR) for the cognitive management of BAM reconfiguration in MPLS networks. The results suggest that CBR learns about bandwidth request profiles associated with the current network state and is able to dynamically define or assist in BAM reconfiguration. The BAM reconfiguration approach adopted is based on switching among available BAM implementations (Maximum Allocation Model, Russian Dolls Model and AllocTC-Sharing). The cognitive management proposed allows BAMs self-configuration and results in optimizing the utilization of network resources.","authors":["Eliseu M Oliveira","Rafael Freitas Reale","Joberto S B Martins"],"meta":["June 2018","DOI:10.5281/zenodo.1310021","Conference: IEEE International Symposium on Computers and Communications - ISCC 2018At: Natal, Brazil","Project: RePAF- A Dynamic and Autonomic Resource Allocation Framework for MPLS, Elastic Optical Networks (EON), Network Function Virtualization (NFV) and IoT"],"references":["308849815_G-BAM_A_Generalized_Bandwidth_Allocation_Model_for_IPMPLSDS-TE_Networks","287974031_QoS-Aware_Autonomic_Resource_Management_in_Cloud_Computing_A_Systematic_Review","284710685_Resource_Allocation_for_Cognitive_Satellite_Communications_with_Incumbent_Terrestrial_Networks","276298408_Large-Scale_Cognitive_Cellular_Systems_Resource_Management_Overview","273060943_Resource_Allocation_for_Cognitive_Small_Cell_Networks_A_Cooperative_Bargaining_Game_Theoretic_Approach","262415723_A_Preliminary_Evaluation_of_Bandwidth_Allocation_Model_Dynamic_Switching","308815881_A-MAR_A_new_bandwidth_constraint_model_for_DS-TE_networks","298464339_Autonomic_Network_Management_Principles","280222649_Virtualized_Cognitive_Network_Architecture_for_5G_Cellular_Networks","265972417_Reliable_Adaptive_Resource_Management_for_Cognitive_Cloud_Vehicular_Networks"]}