{"id":"326396320_A_Model_of_Threatening_Academic_Environments_Predicts_Women_STEM_Majors'_Self-Esteem_and_Engagement_in_STEM","abstract":"The present study tested a model of threatening academic environments among a vulnerable population: women in science, technology, engineering, and mathematics (STEM) fields. Women in STEM are underrepresented and more likely to perceive their STEM educational environments as threatening than do men. U.S. Women majoring in STEM fields (n = 579) completed a questionnaire measuring each construct of a model of threatening academic environments proposed by Inzlicht et al. (2009). Supporting the model, greater gender stigma consciousness predicted greater gender-based rejection sensitivity. Gender rejection sensitivity predicted more negative perceptions of campus climate. More negative climate predicted more experiences of stereotype threat, which in turn predicted lower perceived control. Lower perceived control predicted greater disengagement from STEM domains, which predicted lower self-esteem. Differences also emerged between women in male- compared to female-dominated STEM subfields and between racial minority and majority women. This model describes how experiences of threatening environments may contribute to the underrepresentation of women in STEM. The model provides an overview for researchers, educators, and practitioners to better understand the relations among hostile STEM climates, experiences of identity threat, and academic disengagement. Interventions addressing environmental and individual factors in the model may improve retention and women’s experiences in STEM.","authors":["Bettina Casad","Zachary W Petzel","Emily A. Ingalls"],"meta":["April 2019Sex Roles 80(10):1-20","DOI:10.1007/s11199-018-0942-4"],"references":["322754390_Wise_Psychological_Interventions_to_Improve_Gender_and_Racial_Equality_in_STEM","317096537_Female_peer_mentors_early_in_college_increase_women's_positive_academic_experiences_and_retention_in_engineering","303572219_Model_Minority_Stereotype_Influence_on_Perceived_Mental_Health_Needs_of_Asian_Americans","303087074_Affirming_Independence_Exploring_Mechanisms_Underlying_a_Values_Affirmation_Intervention_for_First-Generation_Students","301692802_The_Impact_of_Interpersonal_Discrimination_and_Stress_on_Health_and_Performance_for_Early_Career_STEM_Academicians","299651588_Instructional_Interventions_That_Motivate_Classroom_Learning","321197985_Structural_equation_modeling_with_AMOS_Basic_concepts_applications_and_programming_2nd_ed","319973110_Improving_Student_Outcomes_in_Higher_Education_The_Science_of_Targeted_Intervention","292937634_STEM_attrition_College_students'_paths_into_and_out_of_STEM_fields","292587969_Stereotype_and_prejudice_Their_automatic_and_controlled_components"]}