{"id":"326338353_When_Adults_Don't_Exercise_Behavioral_Strategies_to_Increase_Physical_Activity_in_Sedentary_Middle-Aged_and_Older_Adults","abstract":"Physical activity is one of the most promising nonpharmacological, noninvasive, and cost-effective methods of health-promotion, yet statistics show that only a small percentage of middle-aged and older adults engage in the recommended amount of regular exercise. This state of affairs is less likely due to a lack of knowledge about the benefits of exercise than to failures of motivation and self-regulatory mechanisms. Many types of intervention programs target exercise in later life, but they typically do not achieve sustained behavior change, and there has been very little increase in the exercise rate in the population over the last decade. The goal of this paper is to consider the use of effective low-cost motivational and behavioral strategies for increasing physical activity, which could have far-reaching benefits at the individual and population levels. We present a multicomponent framework to guide development of behavior change interventions to increase and maintain physical activity among sedentary adults and others at risk for health problems. This involves a personalized approach to motivation and behavior change, which includes social support, goal setting, and positive affect coupled with cognitive restructuring of negative and self-defeating attitudes and misconceptions. These strategies can lead to increases in exercise self-efficacy and control beliefs as well as self- management skills such as self-regulation and action planning, which in turn are expected to lead to long-term increases in activity. These changes in activity frequency and intensity can ultimately lead to improvements in physical and psychological well-being among middle-aged and older adults, including those from underserved, vulnerable populations. Even a modest increase in physical activity can have a significant impact on health and quality of life. Recommendations for future interventions include a focus on ways to achieve personalized approaches, broad outreach, and maintenance of behavior changes.","authors":["Margie E. Lachman","Lewis Lipsitz","James Lubben","Carmen Castaneda-Sceppa"],"meta":["January 2018","DOI:10.1093/geroni/igy007"],"references":["318968341_Built_environmental_correlates_of_older_adults'_total_physical_activity_and_walking_A_systematic_review_and_meta-analysis","316532602_The_association_between_social_support_and_physical_activity_in_older_adults_A_systematic_review","312204737_Behavior_Change_with_Fitness_Technology_in_Sedentary_Adults_A_Review_of_the_Evidence_for_Increasing_Physical_Activity","281347892_Does_multicomponent_physical_exercise_with_simultaneous_cognitive_training_boost_cognitive_performance_in_older_adults_A_6-month_randomized_controlled_trial_with_a_1-year_follow-up","278332238_Randomized_Trial_of_a_Fitbit-Based_Physical_Activity_Intervention_for_Women","277500226_Enacted_Support_and_Well-Being_A_Test_of_the_Mediating_Role_of_Perceived_Control","309110326_US_Health_in_International_Perspective_Shorter_Lives_Poorer_Health","298067105_Effects_of_treating_depression_and_low_perceived_social_support_on_clinical_events_after_myocardial_infarction_Results_of_ENRICHD_enhancing_recovery_in_coronary_heart_disease_patients","285751425_Transtheoretical_model_of_behavior_change","285715305_The_Relevance_of_Control_Beliefs_for_Health_and_Aging"]}