{"id":"326329515_Hot_streaks_in_artistic_cultural_and_scientific_careers","abstract":"The hot streak-loosely defined as 'winning begets more winnings'-highlights a specific period during which an individual's performance is substantially better than his or her typical performance. Although hot streaks have been widely debated in sports1,2, gambling3-5 and financial markets6,7 over the past several decades, little is known about whether they apply to individual careers. Here, building on rich literature on the lifecycle of creativity8-22, we collected large-scale career histories of individual artists, film directors and scientists, tracing the artworks, films and scientific publications they produced. We find that, across all three domains, hit works within a career show a high degree of temporal regularity, with each career being characterized by bursts of high-impact works occurring in sequence. We demonstrate that these observations can be explained by a simple hot-streak model, allowing us to probe quantitatively the hot streak phenomenon governing individual careers. We find this phenomemon to be remarkably universal across diverse domains: hot streaks are ubiquitous yet usually unique across different careers. The hot streak emerges randomly within an individual's sequence of works, is temporally localized, and is not associated with any detectable change in productivity. We show that, because works produced during hot streaks garner substantially more impact, the uncovered hot streaks fundamentally drive the collective impact of an individual, and ignoring this leads us to systematically overestimate or underestimate the future impact of a career. These results not only deepen our quantitative understanding of patterns that govern individual ingenuity and success, but also may have implications for identifying and nurturing individuals whose work will have lasting impact.","authors":["Lu Liu","Yang Wang","Roberta Sinatra","C. Lee Giles"],"meta":["July 2018Nature 559(7714)","DOI:10.1038/s41586-018-0315-8"],"references":["323502497_Science_of_science","320681151_The_science_of_science_From_the_perspective_of_complex_systems","311925597_The_misleading_narrative_of_the_canonical_faculty_productivity_trajectory","305440413_The_Memory_of_Science_Inflation_Myopia_and_the_Knowledge_Network","283532355_The_Distribution_of_the_Asymptotic_Number_of_Citations_to_Sets_of_Publications_by_a_Researcher_or_From_an_Academic_Department_Are_Consistent_With_a_Discrete_Lognormal_Model","332918303_Old_Masters_and_Young_Geniuses_The_Two_Life_Cycles_of_Artistic_Creativity","329893923_Age_and_achievement","315367591_Surprised_by_the_Gambler's_and_Hot_Hand_Fallacies_A_Truth_in_the_Law_of_Small_Numbers","309692079_Quantifying_the_evolution_of_individual_scientific_impact","298852493_The_Matthew_Effect_in_Science","271533454_Cross-evaluation_of_metrics_to_estimate_the_significance_of_creative_works","280685184_The_Burden_of_Knowledge_and_the_Death_of_the_Renaissance_Man_Is_Innovation_Getting_Harder","278996362_Age_and_outstanding_achievement_What_do_we_know_after_a_century_of_research","277815637_The_Matthew_effect_in_science","267136949_The_Gambler's_and_Hot-Hand_Fallacies_Theory_and_Applications"]}