{"id":"326312114_Indian_Diabetic_Retinopathy_Image_Dataset_IDRiD_A_Database_for_Diabetic_Retinopathy_Screening_Research","abstract":"Diabetic Retinopathy is the most prevalent cause of avoidable vision impairment, mainly affecting the working-age population in the world. Recent research has given a better understanding of the requirement in clinical eye care practice to identify better and cheaper ways of identification, management, diagnosis and treatment of retinal disease. The importance of diabetic retinopathy screening programs and difficulty in achieving reliable early diagnosis of diabetic retinopathy at a reasonable cost needs attention to develop computer-aided diagnosis tool. Computer-aided disease diagnosis in retinal image analysis could ease mass screening of populations with diabetes mellitus and help clinicians in utilizing their time more efficiently. The recent technological advances in computing power, communication systems, and machine learning techniques provide opportunities to the biomedical engineers and computer scientists to meet the requirements of clinical practice. Diverse and representative retinal image sets are essential for developing and testing digital screening programs and the automated algorithms at their core. To the best of our knowledge, IDRiD (Indian Diabetic Retinopathy Image Dataset), is the first database representative of an Indian population. It constitutes typical diabetic retinopathy lesions and normal retinal structures annotated at a pixel level. The dataset provides information on the disease severity of diabetic retinopathy, and diabetic macular edema for each image. This makes it perfect for development and evaluation of image analysis algorithms for early detection of diabetic retinopathy.","authors":["Prasanna Porwal","Samiksha Pachade","Ravi Kamble","Manesh Kokare"],"meta":["July 2018Data 3(3):25","DOI:10.3390/data3030025"],"references":["297237967_Diabetic_retinopathy_An_epidemic_at_home_and_around_the_world","345703727_Automatic_Retinal_Image_Analysis_for_the_Detection_of_Diabetic_Retinopathy","329275789_Automated_Image_Detection_of_Retinal_Pathology","327934863_Detection_and_Analysis_of_Diabetic_Retinopathy","315860095_Diabetic_Macular_Edema","298899833_Addressing_risk_factors_screening_and_preventative_treatment_for_diabetic_retinopathy_in_developing_countries_A_review","298806238_Diabetic_retinopathy","288830448_Diabetic_retinopathy_Global_prevalence_major_risk_factors_screening_practices_and_public_health_challenges_A_review","285613380_Diabetic_retinopathy_screening","278694659_Diabetic_Macular_Edema"]}