{"id":"326317729_A_new_approach_for_estimating_stock_status_from_length_frequency_data","abstract":"This study presents a new method (LBB) for the analysis of length frequency data from commercial catches. LBB works for species that grow throughout their lives, such as most commercially-important fish and invertebrates, and requires no input in addition to length frequency data. It estimates asymptotic length, length at first capture, relative natural mortality, and relative fishing mortality. Standard fisheries equations can then be used to approximate current exploited biomass relative to unexploited biomass. In addition, these parameters allow the estimation of length at first capture that would maximize catch and biomass for a given fishing effort, and estimation of a proxy for the relative biomass capable of producing maximum sustainable yields. Relative biomass estimates of LBB were not significantly different from the \"true\" values in simulated data and were similar to independent estimates from full stock assessments. LBB also presents a new indicator for assessing whether an observed size structure is indicative of a healthy stock. LBB results will obviously be misleading if the length frequency data do not represent the size composition of the exploited size range of the stock or if length frequencies resulting from the interplay of growth and mortality are masked by strong recruitment pulses.","authors":["Rainer Froese","Henning Winker","Gianpaolo Coro","Nazli Demirel"],"meta":["November 2018ICES Journal of Marine Science","DOI:10.1093/icesjms/fsy078"],"references":["319381159_Accounting_for_variable_recruitment_and_fishing_mortality_in_length-based_stock_assessments_for_data-limited_fisheries","318712126_Predicting_life_history_parameters_for_all_fishes_worldwide","309283306_Estimating_fisheries_reference_points_from_catch_and_resilience","304908930_Model-based_estimates_of_effective_sample_size_in_stock_assessment_models_using_the_Dirichlet-multinomial_distribution","302982941_A_simple_length-structured_model_based_on_life_history_ratios_and_incorporating_size-dependent_selectivity_Application_to_spawning_potential_ratios_for_data-poor_stocks","322256336_An_optimized_catch-only_assessment_method_for_data_poor_fisheries","318393712_R_A_Language_and_Environment_for_Statistical_Computing","316172902_The_refined_ORCS_approach_A_catch-based_method_for_estimating_stock_status_and_catch_limits_for_data-poor_fish_stocks","314234255_Estimating_stock_depletion_level_from_patterns_of_catch_history","293194776_Minimizing_the_impact_of_fishing"]}