{"id":"326381830_Massively_Parallel_Implementation_of_Sequence_Alignment_with_Basic_Local_Alignment_Search_Tool_Using_Parallel_Computing_in_Java_Library","abstract":"Basic Local Alignment Search Tool (BLAST) is an essential algorithm that researchers use for sequence alignment analysis. The National Center for Biotechnology Information (NCBI)-BLAST application is the most popular implementation of the BLAST algorithm. It can run on a single multithreading node. However, the volume of nucleotide and protein data is fast growing, making single node insufficient. It is more and more important to develop high-performance computing solutions, which could help researchers to analyze genetic data in a fast and scalable way. This article presents execution of the BLAST algorithm on high performance computing (HPC) clusters and supercomputers in a massively parallel manner using thousands of processors. The Parallel Computing in Java (PCJ) library has been used to implement the optimal splitting up of the input queries, the work distribution, and search management. It is used with the nonmodified NCBI-BLAST package, which is an additional advantage for the users. The result application-PCJ-BLAST-is responsible for reading sequence for comparison, splitting it up and starting multiple NCBI-BLAST executables. Since I/O performance could limit sequence analysis performance, the article contains an investigation of this problem. The obtained results show that using Java and PCJ library it is possible to perform sequence analysis using hundreds of nodes in parallel. We have achieved excellent performance and efficiency and we have significantly reduced the time required for sequence analysis. Our work also proved that PCJ library could be used as an effective tool for fast development of the scalable applications.","authors":["Marek Nowicki","Davit Bzhalava","Piotr Bała"],"meta":["July 2018Journal of Computational Biology: a Journal of Computational Molecular Cell Biology 25(8)","DOI:10.1089/cmb.2018.0079","Project: HPDCJ - Heterogenous parallel and distributed computing  with Java"],"references":["322106262_Scaling_bioinformatics_applications_on_HPC","290891419_Gapped_BLAST_and_PSIBLAST_A_new_generation_of_protein_database_search_programs","228860147_The_Design_Implementation_and_Evaluation_of_mpiBLAST","228734882_Introduction_to_UPC_and_language_specification","220952344_TurboBLAST_a_parallel_implementation_of_blast_built_on_the_turbohub","20923774_Basic_Local_Aligment_Search_Tool","4139015_Efficient_data_access_for_parallel_BLAST","2313892_Efficiency_of_Shared-Memory_Multiprocessors_for_a_Genetic_Sequence_Similarity_Search_Algorithm","319054048_Massively_Parallel_Sequence_Alignment_with_BLAST_Through_Work_Distribution_Implemented_Using_PCJ_Library","315742212_Are_Next-Generation_Sequencing_Tools_Ready_for_the_Cloud","246984932_Co-Array_Fortran_for_parallel_programming","242386491_Titanium_language_reference_manual_v1","228796706_Parallelization_of_local_BLAST_service_on_workstation_clusters","9078621_Parallel_BLAST_on_split_databases"]}