{"id":"326326582_Factors_Contributing_to_the_Enhanced_Performance_of_the_MaxWhere_3D_VR_Platform_in_the_Distribution_of_Digital_Information","abstract":"The rapid evolution of information technology and of a new networked culture in the 21st century has brought a new question to the forefront of scientific interest: the question of how new technologies influence the effectiveness with which humans are able to perform specific tasks. This paper presents an experiment contrasting traditional 2D interfaces and the MaxWhere 3D VR educational platform in order to shed light on how the effectiveness of various operations and workflows constituting the core of digital literacy has evolved in recent times. In order to draw specific conclusions, a new framework of concepts, qualitative and quantitative metrics and experimental procedures is proposed in the paper. The final goal of the proposed framework is to help evaluate the effectiveness of digital workflows. The results of the experiment, evaluated in terms of the proposed framework, point to the conclusion that when using MaxWhere instead of traditional 2D interfaces, users are able to accomplish the same digital workflows with 30% less user operations, and up to 80% less machine operations. Based on these results, the paper concludes that MaxWhere as an educational platform offers users a number of ways to accomplish tasks that would otherwise require extremely complicated digital workflows in more traditional 2D environments.","authors":["Ildikó Horváth","Anna Sudár"],"meta":["July 2018Acta Polytechnica Hungarica 15(3)","DOI:10.12700/APH.15.3.2018.3.9","Project: 3D VR spaces in education"],"references":["312113959_Innovative_engineering_education_in_the_cooperative_VR_environment","265089605_Future_Internet-based_Collaboration_in_Factory_Planning","322710316_Teaching_electrical_machines_in_a_3D_virtual_space","315872036_Advertising_perception_with_immersive_virtual_reality_devices","311751589_Direct_manipulation_is_better_than_passive_viewing_for_learning_anatomy_in_a_three-dimensional_virtual_reality_environment","309722798_Advantages_and_challenges_associated_with_augmented_reality_for_education_A_systematic_review_of_the_literature","273592265_Technical_Perspectives_on_Theory_in_Screen-Based_Virtual_Reality_Environments_Leading_From_the_Future_in_VHRD"]}