{"id":"326348881_Policy_making_for_smart_cities_innovation_and_social_inclusive_economic_growth_for_sustainability","abstract":"ABSTRACT\n\nPurpose – This paper queries the scientific debate related to a new generation of policy-aware smart cities research geared towards innovation and sustainable inclusive socio-economic growth and development. It summarizes the rationale behind the relevant JSTPM Special Issue and its overall objective to serve as a reference for policymakers, educators, practitioners, government and think-tank officers interested in the emerging topics in smart cities research. \n\nDesign/methodology/approach – This paper examines the state of the art of smart cities research and provides an overview of papers included in the special issue. The approach is related to meta-desktop research aiming to reveal the key contributions and open research issues related to policymaking for smart cities research. \n\nFindings – This paper makes a case for opening the smart cities concept to a new generation of sophisticated ICT-enabled solutions. It is argued that more structured and output-oriented dialogue among a variety of stakeholders is needed, and that the debate needs to focus on new sustainable, global, and socially aware polices for research on smart cities, smart regions, and smart clusters. To this end, greater attention needs to be paid to emerging technologies, such as the Internet of Things, Cognitive Computing, Advanced Analytics and Business Intelligence, 5G networks, anticipatory and context-aware computing, and advanced distributed-data warehouse platforms. \n\nResearch limitations/implications – This editorial introduces the debate that unfolds in the Special Issue. It also highlights how this debate could be enriched by means of international collaboration and scientific dialogue. \n\nPractical implications – By highlighting the variety of research related to smart cities policymaking, this paper offers a typology of the services and applications that target data-driven policymaking at the \nmicro-, mezzo-, and macro-levels. \n\nSocial Implications – This paper argues that sustainability and innovation are two integral aspects of the same social challenge. The integration of sophisticated technological platforms and advanced policies requires a new managerial paradigm at all levels of decision-making across and beyond continents and local boundaries. \n\nOriginality/value – This Special Issue is one of the first attempts worldwide to discuss the socially aware policymaking process as an inevitable part of smart cities research. \n\nKeywords – smart cities, policymaking, socially inclusive economic growth, sustainability, technology policymaking, social innovation \n\nPaper type – editorial / conceptual paper","authors":["Anna Visvizi","Miltiadis Lytras","Ernesto Damiani","Hassan Mathkour"],"meta":["July 2018","DOI:10.1108/JSTPM-07-2018-079","Project: IoT and e-business"],"references":["322258662_Smart_Cities_in_Taiwan_A_Perspective_on_Big_Data_Applications","317048810_Irregular_migratory_flows_Towards_an_ICTs'_enabled_integrated_framework_for_resilient_urban_systems","314132267_Editorial_-_Volume_18_Issue_1","311670580_Big_Data_and_Data_Analytics_Research_From_Metaphors_to_Value_Space_for_Collective_Wisdom_in_Human_Decision_Making_and_Smart_Machines","308547379_Virtual_reality_in_learning_collaboration_and_behaviour_content_systems_strategies_context_designs"]}