{"id":"326352935_MOLESTRA_A_Multi-Task_Learning_Approach_for_Real-Time_Big_Data_Analytics","abstract":"Modern critical infrastructures are characterized by a high degree of complexity, in terms of vulnerabilities, threats, and interdependencies that characterize them. The possible causes of a digital assault or occurrence of a digital attack are not simple to identify, as they may be due to a chain of seemingly insignificant incidents, the combination of which provokes the occurrence of scalar effects on multiple levels. Similarly, the digital explosion of technologies related to the critical infrastructure and the technical characteristics of their subsystems entails the continuous production of a huge amount of data from heterogeneous sources, requiring the adoption of intelligent techniques for critical analysis and optimal decision making. In many applications (e.g. network traffic monitoring) data is received at a high frequency over time. Thus, it is not possible to store all historical samples, which implies that they should be processed in real time and that it may not be possible to re-review old samples (one-pass constraint). We should consider the importance of protecting critical infrastructure, combined with the fact that many of these systems are cyber-attack targets, but they cannot easily be disconnected from their layout as this could lead to generalized operational problems. This research paper proposes a Multi-Task Learning model for Real-Time & Large-Scale Data Analytics, towards the Cyber protection of Critical Infrastructure. More specifically, it suggests the Multi Overlap LEarning STReaming Analytics (MOLESTRA) which is a standardization of the \"Kappa\" architecture. The aim is the analysis of large data sets where the tasks are executed in an overlapping manner. This is done to ensure the utilization of the cognitive or learning relationships among the data flows. The proposed architecture uses the k-NN Classifier with Self Adjusting Memory (k-NN SAM). MOLESTRA, provides a clear and effective way to separate the short-term from the long-term memory. In this way the temporal intervals between the transfer of knowledge from one memory to the other and vice versa are differentiated.","authors":["Konstantinos Demertzis","Lazaros Liadis","Vardis Anezakis"],"meta":["July 2018","DOI:10.1109/INISTA.2018.8466306","Conference: 2018 IEEE International Conference on INnovations in Intelligent SysTems and ApplicationsAt: Thessaloniki Greece","Project: Machine Learning to Cyber Security"],"references":["317011773_An_innovative_soft_computing_system_for_smart_energy_grids_cybersecurity","314139485_Computational_intelligence_anti-malware_framework_for_android_OS","312712000_A_Bio-Inspired_Hybrid_Artificial_Intelligence_Framework_for_Cyber_Security","311759998_KNN_Classifier_with_Self_Adjusting_Memory_for_Heterogeneous_Concept_Drift","308871780_Lambda_architecture_for_cost-effective_batch_and_speed_big_data_processing","319886141_The_Lambda_and_the_Kappa","318915768_Distributed_Multi-Task_Relationship_Learning","317011692_A_hybrid_network_anomaly_and_intrusion_detection_approach_based_on_evolving_spiking_neural_network_classification","313449087_Asynchronous_Multi-task_Learning","312570716_Proposal_of_Lambda_Architecture_Adoption_for_Real_Time_Predictive_Maintenance"]}