{"id":"326335033_SOSA_A_lightweight_ontology_for_sensors_observations_samples_and_actuators","abstract":"The Sensor, Observation, Sample, and Actuator (SOSA) ontology provides a formal but lightweight general-purpose specification for modellingthe interaction between the entities involved in the acts of observation, actuation, and sampling. SOSA is the result of rethinking the W3C-XG Semantic Sensor Network (SSN) ontology based on changes in scope and target audience, technical developments, and lessons learned over the past years. SOSA also acts as a replacement of SSN's Stimulus Sensor Observation (SSO) core. It has been developed by the first joint working group of the Open Geospatial Consortium (OGC) and the World Wide Web Consortium (W3C) on Spatial Data on the Web. In this work, we motivate the need for SOSA, provide an overview of the main classes and properties, and briefly discuss its integration with the new release of the SSN ontology as well as various other alignments to specifications such as OGC's Observations and Measurements (O&M), Dolce-Ultralite (DUL), and other prominent ontologies. We will also touch upon common modelling problems and application areas related to publishing and searching observation, sampling, and actuation data on the Web. The SOSA ontology and standard can be accessed at https://www.w3.org/TR/vocab-ssn/.","authors":["Krzysztof Janowicz","Armin Haller","Simon Jonathan David Cox","Danh Le Phuoc"],"meta":["July 2018Journal of Web Semantics 56","DOI:10.1016/j.websem.2018.06.003","Project: SMARTER: A Scalable and Elastic Platform for Near-Realtime Analytics on The Graph of Everything"],"references":["230745470_A_Survey_of_the_Semantic_Specification_of_Sensors","230606838_A_RESTful_proxy_and_data_model_for_linked_sensor_data","327836200_Semantic_Sensor_Network_Ontology","326337841_The_SSN_Ontology_of_the_W3C_Semantic_Sensor_Network_Incubator_Group","301540040_On_the_Capabilities_and_Limitations_of_OWL_Regarding_Typecasting_and_Ontology_Design_Pattern_Views","291348591_Ontology_for_observations_and_sampling_features_with_alignments_to_existing_models","287390900_Schemaorg_Evolution_of_Structured_Data_on_the_Web","264610641_Observation-Driven_Geo-Ontology_Engineering","262936925_Observations_and_Measurements_-_Part_1_-_Observation_Schema","242410772_OpenGISR_Sensor_Model_Language_SensorML_Implementation_Specification"]}