{"id":"326350556_The_Effect_of_Tutorial_Multimedia_on_the_Transformator_Learning_Outcomes_Based_on_the_Students'_Visual_Ability","abstract":"The low learning outcomes have a negative impact on the quality of graduates. This study is aimed at revealing the effect of multimedia exploratory tutorial model on the learning outcomes of Basic Competence (BC) and Advanced Competency (AC) based on the students' visual ability differences in the course of Transformator. The research was conducted in State University of Medan using quasy experiment. Samples of 82 students were divided into three groups: Visual High (VH), Visual Medium (VM) and Visual Low (VL). The comparison of research results was analyzed by Anova. The result shows that at the BC level the students' learning outcomes in the VM and VH groups were higher than VL while the VM and VH did not differ significantly. At the AC level the three student groups differ significantly, the VH group is higher than the VM and the VM is higher than the VL. This study concludes that multimedia exploratory tutorials are effective for VM and VH student groups but not for VL. Therefore exploratory multimedia should be used for VM and VT students to obtain optimal BC and only for VH group to obtain optimal AC. However, this multimedia is not recommended for students with low visual abilities (VL). It is advisable to prepare a special exploratory media for high visual ability students, while for students with low visual ability need to do further research to find effective learning media used.","authors":["S. Sriadhi","S Gultom","Restu Restu","Janner Simarmata"],"meta":["July 2018IOP Conference Series Materials Science and Engineering 384(1):012059","DOI:10.1088/1757-899X/384/1/012059"],"references":["288149258_Effect_of_student_engagement_on_multimedia-assisted_instruction","287756948_Effectiveness_Of_Arcs_Model_Of_Motivational_Design_To_Overcome_Non_Completion_Rate_Of_Students_In_Distance_Education","284180462_MULTIMEDIA_EXPLORATORY_TUTORIAL_LEARNING_ETL_UNTUK_PEMBELAJARAN_PEMBANGKIT_ENERGI_LISTRIK","266204215_Efficacy_of_Multimedia_Learning_Modules_as_Preparation_for_Lecture-Based_Tutorials_in_Electromagnetism","226914099_The_Purdue_Visualization_of_Rotations_Test","223208796_3D_visualization_types_in_multimedia_applications_for_science_learning_A_case_study_for_8th_grade_students_in_Greece","46706378_How_to_Optimize_Learning_From_Animated_Models_A_Review_of_Guidelines_Based_on_Cognitive_Load","324845226_Motivating_e-Learners_Application_of_the_ARCS_Model_to_e-Learning_for_San_Diego_Zoo_Global's_Animal_Care_Professionals","263350262_An_Approach_to_Develop_and_Measure_Engineering_Visualization_in_an_Introductory_Mechanics_Course_using_Computer-Aided_Learning_Modules","245494269_Application_of_multimedia_in_engineering_design_education"]}