{"id":"326327430_Automatic_multi-organ_segmentation_in_dual_energy_CT_using_3D_fully_convolutional_network","abstract":"Automatic multi-organ segmentation of the dual energy computed tomography\n(DECT) data is beneficial for biomedical research and clinical applications. Numerous\nrecent researches in medical image processing show the feasibility to use 3-D\nfully convolutional networks (FCN) for voxel-wise dense predictions of medical\nimages. In the scope of this work, three 3D-FCN-based algorithmic approaches\nfor the automatic multi-organ segmentation in DECT are developed. Both of the\ntheoretical benefit and the practical performance of these novel deep-learning-based\napproaches are assessed. The approaches were evaluated using 26 torso DECT\ndata acquired with a clinical dual-source CT system. Six thoracic and abdominal\norgans (left and right lungs, liver, spleen, and left and right kidneys) were evaluated\nusing a cross-validation strategy. In all the tests, we achieved the best average Dice\ncoefficients of 98% for the right lung, 97% for the left lung, 93% for the liver,\n91% for the spleen, 94% for the right kidney, 92% for the left kidney, respectively.\nSuccessful tests on special clinical cases reveal the high adaptability of our methods\nin the practical application. The results show that our methods are feasible and\npromising.","authors":["Shuqing Chen","Xia Zhong","Erlangen-Nürnberg Shiyang Hu","Sabrina Dorn"],"meta":["July 2018","Conference: 1st Conference on Medical Imaging with Deep Learning (MIDL 2018)At: Amsterdam, The Netherlands","Project: Quantitative DECT with prior atlas knowledge"],"references":["323300836_Manifold_Learning-based_Data_Sampling_for_Model_Training","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","225301482_Optimal_Inversion_of_the_Generalized_Anscombe_Transformation_for_Poisson-Gaussian_Noise","220860992_Best_Practices_for_Convolutional_Neural_Networks_Applied_to_Visual_Document_Analysis","323678847_Organ-specific_context-sensitive_CT_image_reconstruction_and_display","319463016_Error_Corrective_Boosting_for_Learning_Fully_Convolutional_Networks_with_Limited_Data","315187326_Deep_Learning_in_Medical_Image_Analysis","313072707_3D_U-Net_Learning_Dense_Volumetric_Segmentation_from_Sparse_Annotation","281226172_Dual-_and_Multi-Energy_CT_Principles_Technical_Approaches_and_Clinical_Applications","12204040_Nonlinear_Dimensionality_Reduction_by_Locally_Linear_Embedding"]}