{"id":"326480423_Solving_Transfer_Pricing_Involving_Collaborative_and_Non-cooperative_Equilibria_in_Nash_and_Stackelberg_Games_Centralized-Decentralized_Decision_Making","abstract":"The classical transfer pricing model considers a cooperative approach taking into account that each division purchases goods from an upstream division in the supply chain. However, divisions of a firm can be decentralized and not necessarily act cooperatively. A conflict in decentralization arises. A lack of coordination between the divisions and central management occurs if the divisions have full autonomy: managers might engage in actions that would benefit their divisions to the detriment of maximizing the well-being of the entire firm. This paper presents a model for transfer pricing that is able to maintain divisional decentralization by computing the Nash equilibrium and at the same time encourage divisions to achieve central management optimal results by computing the strong Nash equilibrium. The resulting strong Nash/Nash equilibrium point involves the computation of a cooperative and non-cooperative behavior. The model is able to provide a measure of the divisional profit maximization of the firm. In addition, we consider a bi-level structure of the company’s supply chain and solve the problem employing a Stackelberg equilibrium approach. For solving the problem we represent the transfer pricing game in terms of a coupled nonlinear programming equations implementing the penalty approach. A regularization method is employed to ensure the convergence of the utility-functions to a unique equilibrium point. For computing the equilibrium point we employ a minimization of the Euclidean distance. Next, we transform the penalty problem into a new system of equations in the Euclidean distance format. For minimizing the Euclidean distance we use a gradient method approach. A numerical example validates the effectiveness and usefulness of the proposed model for transfer pricing.","authors":["Julio B Clempner","Alexander S. Poznyak"],"meta":["August 2019Computational Economics 54(1)","DOI:10.1007/s10614-018-9836-3"],"references":["322478309_Negotiating_transfer_pricing_using_the_Nash_bargaining_solution","318935536_A_Tikhonov_regularized_penalty_function_approach_for_solving_polylinear_programming_problems","316471045_Advanced_Mathematical_Tools_for_Automatic_Control_Engineers_Volume_2","314379630_Strategic_Incentives_for_Keeping_One_Set_of_Books_in_International_Transfer_Pricing","309198181_Multiobjective_Markov_chains_optimization_problem_with_strong_Pareto_frontier_Principles_of_decision_making","303713806_Necessary_and_sufficient_Karush-Kuhn-Tucker_conditions_for_multiobjective_Markov_chains_optimality","301916411_An_optimal_strong_equilibrium_solution_for_cooperative_multi-leader-follower_Stackelberg_Markov_chains_games","284647529_Transfer_Pricing_-_A_Synthesis","284561606_Transfer_Pricing_in_Complex_Organizations_A_Review_and_Integration_of_Recent_Empirical_and_Analytical_Research","284401232_Control_with_Fairness_in_Transfer_Pricing","282382752_Computing_the_StackelbergNash_Equilibria_Using_the_Extraproximal_Method_Convergence_Analysis_and_Implementation_Details_for_Markov_Chains_Games","282627021_Determining_Intra-company_Transfer_Pricing_for_Multinational_Corporations","277857742_International_Intra-Company_Transfer_Pricing","274540912_Risk_Sharing_and_Transfer_Price_Systems_Under_Uncertainty","271739538_Profit_shifting_drivers_of_transfer_mispricing_and_the_potential_of_countermeasures"]}