{"id":"326479439_Combining_Memory_and_Non-linearity_in_Echo_State_Networks","abstract":"Echo State Networks (ESNs) represent a successful methodology for efficient modeling of Recurrent Neural Networks. Untrained recurrent dynamics in ESNs apparently need to comply a trade-off between the two desirable features of implementing a long memory over past inputs and the ability of modeling non-linear dynamics. In this paper , we analyze such memory/non-linearity trade-off from the perspective of recurrent model design. In particular, we propose two variants to the standard ESN model, aiming at combining linear and non-linear dynamics both in the architectural setup of the recurrent system, and at the level of recurrent units activation functions. The proposed models are experimentally assessed on ad-hoc defined tasks as well as on standard benchmarks in the area of Reservoir Computing. Results show that the introduced ESN variants can grasp the proper trade-off between memory and non-linearity requirements, at the same time allowing to improve the performance of standard ESNs. Moreover, the analysis of the employed degree of non-linearity in the reservoir system can provide useful insights on the characterization of the learning task at hand.","authors":["Eleonora Di Gregorio","Claudio Gallicchio","Alessio Micheli"],"meta":["July 2018","Conference: Preprint of the paper accepted for the 27th International Conference on Artificial Neural Networks"],"references":["323855650_Randomized_Recurrent_Neural_Networks","319403947_Reservoir_Computing_Beyond_Memory-Nonlinearity_Trade-off","316740225_Randomized_Machine_Learning_Approaches_Recent_Developments_and_Challenges","316591291_Deep_Reservoir_Computing_A_Critical_Experimental_Analysis","306013940_RSS-based_Robot_Localization_in_Critical_Environments_using_Reservoir_Computing","298911566_Human_activity_recognition_using_multisensor_data_fusion_based_on_Reservoir_Computing","282600673_Prediction_of_the_Italian_electricity_price_for_smart_grid_applications","257435359_An_experimental_characterization_of_reservoir_computing_in_ambient_assisted_living_applications","247514367_Short_Term_Memory_in_Echo_State_Networks","256360776_Acoustic_Modeling_With_Hierarchical_Reservoirs"]}