{"id":"326448909_Where_the_smart_things_are_Social_machines_and_the_Internet_of_Things","abstract":"The emergence of large-scale social media systems, such as Wikipedia, Facebook, and Twitter, has given rise to a new multi-disciplinary effort based around the concept of social machines. For the most part, this research effort has limited its attention to the study of Web-based systems. It has also, perhaps unsurprisingly, tended to highlight the social scientific relevance of such systems. The present paper seeks to expand the scope of the social machine research effort to encompass the Internet of Things. One advantage of this expansion is that it helps to reveal some of the links between the science of social machines and the sciences of the mind. A second advantage is that it furthers our conceptual understanding of social machines and supports the quest to derive a philosophically-robust definition of the term “social machine.” The results of the present analysis suggest that social machines are best conceived as systems in which a combination of social and technological elements play a role in the mechanistic realization of system-level phenomena. The analysis also highlights the relevance of cognitive science and the philosophy of mind to our general understanding of systems that transcend the cyber, physical, and social domains.","authors":["Paul Smart","Aastha Madaan","Wendy Hall"],"meta":["July 2019Phenomenology and the Cognitive Sciences 18(4)","DOI:10.1007/s11097-018-9583-x"],"references":["319393385_Towards_the_Web_of_Things_Web_Mashups_for_Embedded_Devices","345888580_Surfing_Uncertainty_Prediction_Action_and_the_Embodied_Mind","344122710_Physarum_Machines_Computers_from_Slime_Mould","332087075_The_Internet_of_Things","325001650_10_Sociomateriality_Challenging_the_Separation_of_Technology_Work_and_Organization","321598032_Ambient_Intelligence_European_Conference_AmI_2008_Nuremberg_Germany_November_19-22_2008_Proceedings","321144394_The_social_scaffolding_of_machine_intelligence","321125668_Human-Extended_Machine_Cognition","320699688_The_Routledge_Handbook_of_Mechanisms_and_Mechanical_Philosophy","318666474_The_Natural_Science_of_Computing"]}