{"id":"326496907_Tecnicas_de_Big_Data_e_Projecao_de_Risco_de_Mercado_utilizando_Dados_em_Alta_Frequencia","abstract":"De acordo com White (2012), o mundo passa por um período denominado de “Era dos Dados”, em que o “universo digital” poderá ter um tamanho de 44 zetabytes em 2020. Um dos fatores para o crescimento do número de dados são as operações em alta frequência em bolsas de valores, estas cresceram significativamente nos últimos anos. Neste contexto, torna-se difícil mensurar a volatilidade durante o dia devido à quantidade de negociações em tempo real. Neste caso, deve-se calcular adequadamente as medidas de volatilidade para que realmente o risco seja percebido pelo operador. O objetivo deste artigo é apresentar uma metodologia para obter a volatilidade futura a partir da extração dos dados e do cálculo da volatilidade por meio de técnicas de Big Data. Para atender o objetivo foram analisadas todas as ações existentes no banco de dados da BOVESPA. Neste artigo, foram selecionadas as 10 ações mais negociadas no período entre os anos de 2012 a 2014 para apresentação dos resultados. Na primeira fase, desenvolveram-se as funções para tratamento dos dados e estimação das medidas de risco utilizando-se da linguagem de programação Python. Na segunda fase utilizou-se o Apache Hadoop e o MapReduce (com o Hadoop Streaming) para o cálculo distribuído da estimação do modelo de volatilidade. Para estimar a Volatilidade Percebida foram utilizadas séries de preços ponderados pelo volume no intervalo de 5 minutos. Como método de projeção foi utilizado o modelo HAR-RV, proposto em Corsi (2003). Como resultados, foram desenvolvidas implementações em Python para estimação da Volatilidade Percebida e implementações em Apache Hadoop e MapReduce (com o Hadoop Streaming) para projeção da Volatilidade. Os resultados das estimativas e projeções ocorreram conforme esperado pela literatura.","authors":["Alcides Araujo","Alessandra De Ávila Montini"],"meta":["December 2016Future Studies Research Journal Trends and Strategies 8(3):83-108","DOI:10.24023/FutureJournal/2175-5825/2016.v8i3.219"],"references":[]}