{"id":"326466321_Controlling_an_organic_synthesis_robot_with_machine_learning_to_search_for_new_reactivity","abstract":"The discovery of chemical reactions is an inherently unpredictable and time-consuming process1. An attractive alternative is to predict reactivity, although relevant approaches, such as computer-aided reaction design, are still in their infancy2. Reaction prediction based on high-level quantum chemical methods is complex3, even for simple molecules. Although machine learning is powerful for data analysis4,5, its applications in chemistry are still being developed6. Inspired by strategies based on chemists' intuition7, we propose that a reaction system controlled by a machine learning algorithm may be able to explore the space of chemical reactions quickly, especially if trained by an expert8. Here we present an organic synthesis robot that can perform chemical reactions and analysis faster than they can be performed manually, as well as predict the reactivity of possible reagent combinations after conducting a small number of experiments, thus effectively navigating chemical reaction space. By using machine learning for decision making, enabled by binary encoding of the chemical inputs, the reactions can be assessed in real time using nuclear magnetic resonance and infrared spectroscopy. The machine learning system was able to predict the reactivity of about 1,000 reaction combinations with accuracy greater than 80 per cent after considering the outcomes of slightly over 10 per cent of the dataset. This approach was also used to calculate the reactivity of published datasets. Further, by using real-time data from our robot, these predictions were followed up manually by a chemist, leading to the discovery of four reactions.","authors":["Jaroslaw M Granda","Liva Donina","Vincenza Dragone","De-Liang Long"],"meta":["July 2018Nature 559(7714)","DOI:10.1038/s41586-018-0307-8"],"references":["317552456_An_autonomous_organic_reaction_search_engine_for_chemical_reactivity","308980727_Automatic_Chemical_Design_Using_a_Data-Driven_Continuous_Representation_of_Molecules","305386496_Scikit-Iearn_Machine_learning_in_python","324053014_Deoxyfluorination_with_Sulfonyl_Fluorides_Navigating_Reaction_Space_with_Machine_Learning","323623871_The_Molecular_Industrial_Revolution_Automated_Synthesis_of_Small_Molecules","323207851_Predicting_reaction_performance_in_C-N_cross-coupling_using_machine_learning","322704138_A_platform_for_automated_nanomole-scale_reaction_screening_and_micromole-scale_synthesis_in_flow","317097450_The_natural_productome","312538118_Support-vector_networks","301828508_Machine-learning-assisted_materials_discovery_using_failed_experiments","281127496_Automatic_discovery_and_optimization_of_chemical_processes","277801502_Why_is_Tanimoto_index_an_appropriate_choice_for_fingerprint-based_similarity_calculations","277411157_Deep_Learning","292142928_Towards_dial-a-molecule_by_integrating_continuous_flow_analytics_and_self-optimisation","281822417_Machine_Learning_Trends_Perspectives_and_Prospects"]}