{"id":"326466336_GOATOOLS_A_Python_library_for_Gene_Ontology_analyses","abstract":"The biological interpretation of gene lists with interesting shared properties, such as up- or down-regulation in a particular experiment, is typically accomplished using gene ontology enrichment analysis tools. Given a list of genes, a gene ontology (GO) enrichment analysis may return hundreds of statistically significant GO results in a \"flat\" list, which can be challenging to summarize. It can also be difficult to keep pace with rapidly expanding biological knowledge, which often results in daily changes to any of the over 47,000 gene ontologies that describe biological knowledge. GOATOOLS, a Python-based library, makes it more efficient to stay current with the latest ontologies and annotations, perform gene ontology enrichment analyses to determine over- and under-represented terms, and organize results for greater clarity and easier interpretation using a novel GOATOOLS GO grouping method. We performed functional analyses on both stochastic simulation data and real data from a published RNA-seq study to compare the enrichment results from GOATOOLS to two other popular tools: DAVID and GOstats. GOATOOLS is freely available through GitHub: https://github.com/tanghaibao/goatools .","authors":["D. V. Klopfenstein","Liangsheng Zhang","Brent S. Pedersen","Fidel Ramírez"],"meta":["July 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-28948-z"],"references":["317163814_Expansion_of_the_Gene_Ontology_knowledgebase_and_resources","312008098_Visualizing_GO_Annotations","312008003_Gene_Ontology_Pitfalls_Biases_and_Remedies","311348915_Mouse_Genome_Database_MGD-2017_Community_knowledge_resource_for_the_laboratory_mouse","304806652_Systematic_and_integrative_analysis_of_large_gene_lists_using_DAVID_bioinformatics_resources","340180048_Statsmodels_Econometric_and_Statistical_Modeling_with_Python","307511449_Impact_of_outdated_gene_annotations_on_pathway_enrichment_analysis","305460354_Codon_identity_regulates_mRNA_stability_and_translation_efficiency_during_the_maternal-to-zygotic_transition","304806762_Systematic_and_integrative_analysis_of_large_gene_lists_using_DAVID_bioinformatics_resources","301854619_Visualizing_Gene_Ontology_annotations"]}