{"id":"326450530_State_of_the_Art_Reproducibility_in_Artificial_Intelligence","abstract":"Background: Research results in artificial intelligence (AI) are criticized for not being reproducible. Objective: To quantify the state of reproducibility of empirical AI research using six reproducibility metrics measuring three different degrees of reproducibility. Hypotheses: 1) AI research is not documented well enough to reproduce the reported results. 2) Documentation practices have improved over time. Method: The literature is reviewed and a set of variables that should be documented to enable reproducibility are grouped into three factors: Experiment, Data and Method. The metrics describe how well the factors have been documented for a paper. A total of 400 research papers from the conference series IJCAI and AAAI have been surveyed using the metrics. Findings: None of the papers document all of the variables. The metrics show that between 20% and 30% of the variables for each factor are documented. One of the metrics show statistically significant increase over time while the others show no change. Interpretation: The reproducibility scores decrease with increased documentation requirements. Improvement over time is found. Conclusion: Both hypotheses are supported.","authors":["Odd Erik Gundersen","Sigbjørn Kjensmo"],"meta":["February 2018","Conference: AAAI 2018At: New Orleans","Project: Reproducible AI"],"references":["307694062_Best_Practices_for_Computational_Science_Software_Infrastructure_and_Environments_for_Reproducible_and_Extensible_Research","258821361_An_Evaluation_of_the_Software_System_Dependency_of_a_Global_Atmospheric_Model","331945008_Open_Science_in_Machine_Learning","319770398_WaveLab_and_Reproducible_Research","301409387_Recomputationorg_Experiences_of_Its_First_Year_and_Lessons_Learned","298787690_Repeatability_in_Computer_Systems_Research","283986485_A_Survey_on_Reproducibility_in_Parallel_Computing","270289226_Reproducibility_in_Science_Improving_the_Standard_for_Basic_and_Preclinical_Research","268032442_Trust_Your_Science_Open_Your_Data_and_Code","262297107_Intention-aware_routing_to_minimise_delays_at_electric_vehicle_charging_stations"]}