{"id":"326497648_Seven_Characteristics_Defining_Online_News_Formats_Towards_a_typology_of_online_news_and_live_blogs","abstract":"Whilst live blogs have become an established part of the news media ecology, corresponding research is still in its infancy, especially that which examines the crucial question of sourcing practices. Focussing on three UK news organisations – BBC News, the Guardian and the Telegraph – in this article we provide the largest and most comprehensive empirical study to date comparing sourcing practices in online news and live blogs. We analyse sourcing practices across three different genres of live blogging and corresponding online news articles, through a comparative analysis of events broadly categorised as crisis, politics and sport. Our findings suggest that there are some aspects of sourcing practices that are distinct to live blogs, such as directly embedding social media. However, when it comes to polyvocality (the diversity of who gets to speak), genre-specific journalism norms seem to account for more than the affordances of the platform itself and only in sport live blogs are demotic voices habitually included. Based on these findings, we develop a typology of live blogging and online news articles that documents the nuances in sourcing patterns across different news formats and genres, and provide a theoretical basis for future research in this field.","authors":["Einar Thorsen","Daniel Jackson"],"meta":["July 2018Digital Journalism 6(7):1-22","DOI:10.1080/21670811.2018.1468722"],"references":["317972849_Live_Blogging_about_Terrorist_Attacks_The_effects_of_competition_and_editorial_strategy","289730386_The_Discourse_of_Broadcast_News_A_Linguistic_Approach","345540997_Out_of_bounds","305512188_The_Uncensored_War_The_Media_and_Vietnam","304033045_Internet_users_participation_and_news_framing_The_Strauss-Kahn_case-related_Live_Blog_at_Le_Mondefr","292652720_Ordinary_people_and_the_media_The_demotic_turn","283100790_Out_of_bounds_Professional_norms_as_boundary_markers","283037734_Cast_Aside","282184138_Re-evaluating_journalistic_routines_in_a_digital_age_A_review_of_research_on_the_use_of_online_sources","281609922_FOLLOWING_THE_ACTION"]}