{"id":"326432931_CNN_models_discriminating_between_pulmonary_micro-nodules_and_non-nodules_from_CT_images","abstract":"Background: \nEarly and automatic detection of pulmonary nodules from CT lung screening is the prerequisite for precise management of lung cancer. However, a large number of false positives appear in order to increase the sensitivity, especially for detecting micro-nodules (diameter < 3 mm), which increases the radiologists' workload and causes unnecessary anxiety for the patients. To decrease the false positive rate, we propose to use CNN models to discriminate between pulmonary micro-nodules and non-nodules from CT image patches.\n\nMethods: \nA total of 13,179 micro-nodules and 21,315 non-nodules marked by radiologists are extracted with three different patch sizes (16 × 16, 32 × 32 and 64 × 64) from LIDC/IDRI database and used in the experiments. Three CNN models with different depths (1, 2 or 4 convolutional layers) are designed; their performances are evaluated by the fivefold cross-validation in term of the accuracy, area under the curve (AUC), F-score and sensitivity. The network parameters are also optimized.\n\nResults: \nIt is found that the performance of the CNN models is greatly dependent on the patches size and the number of convolutional layers. The CNN model with two convolutional layers presented the best performance in case of 32 × 32 patches size, achieving an accuracy of 88.28%, an AUC of 0.87, a F-score of 83.45% and a sensitivity of 83.82%.\n\nConclusions: \nThe CNN models with appropriate depth and size of image patches can effectively discriminate between pulmonary micro-nodules and non-nodules, and reduce the false positives and help manage lung cancer precisely.","authors":["Patrice Monkam","Shouliang Qi","Mingjie Xu","Fangfang Han"],"meta":["July 2018BioMedical Engineering OnLine 17(1)","DOI:10.1186/s12938-018-0529-x"],"references":["323364216_Agile_convolutional_neural_network_for_pulmonary_nodule_classification_using_CT_images","322664420_Automatic_detection_of_multisize_pulmonary_nodules_in_CT_images_Large-scale_validation_of_the_false-positive_reduction_step","322323166_3D_Convolutional_Neural_Networks_for_Crop_Classification_with_Multi-Temporal_Remote_Sensing_Images","319453582_Lung_Cancer_Detection_and_Classification_with_3D_Convolutional_Neural_Network_3D-CNN","318032236_Evaluating_pulmonary_nodules_to_detect_lung_cancer_Does_Fleischner_criteria_really_work","317724082_Detecting_Small_Signs_from_Large_Images","323536386_A_Deep_3D_Residual_CNN_for_False_Positive_Reduction_in_Pulmonary_Nodule_Detection","319770414_Identity_Mappings_in_Deep_Residual_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318434723_An_Automatic_Detection_System_of_Lung_Nodule_Based_on_Multi-Group_Patch-Based_Deep_Learning_Network"]}