{"id":"326418445_Debugging_in_Programming_as_a_Multimodal_Practice_in_Early_Childhood_Education_Settings","abstract":"The aim of this article is to broadly elaborate on how programming can be understood as a new teaching scope in preschools, focusing specifically on debugging as one of the phases involved in learning to program. The research question How can debugging as part of teaching and learning programming be understood as multimodal learning? has guided the analysis and the presentation of the data. In this study, and its analysis process, we have combined a multimodal understanding of teaching and learning practices with understandings of programming and how it is practiced. Consequently, the multidisciplinary approach in this study, combining theories from social sciences with theories and concepts from computer science, is central throughout the article. This is therefore also a creative, explorative process as there are no clear norms to follow when conducting multidisciplinary analyses. The data consist of video recordings of teaching sessions with children and a teacher engaged in programming activities. The video material was recorded in a preschool setting during the school year 2017–2018 and consists of 25 sessions of programming activities with children, who were four or five years old. The results show how debugging in early childhood education is a multimodal activity socially established by use of speech, pointing and gaze. Our findings also indicate that artefacts are central to learning debugging, and a term ‘instructional artefacts’ is therefore added. Finally, the material shows how basic programming concepts and principles can be explored with young children.","authors":["Mia Heikkilä","Linda Mannila"],"meta":["July 2018Multimodal Technologies and Interaction 2(3):42","DOI:10.3390/mti2030042"],"references":["325398053_Introducing_fundamental_object-oriented_programming_concepts_in_preschool_education_within_the_context_of_physical_science_courses","303960042_DigComp_20_The_Digital_Competence_Framework_for_Citizens_Update_Phase_1_the_Conceptual_Reference_Model","301284225_A_Review_on_the_Use_of_Robots_in_Education_and_Young_Children","298565409_Negotiating_Transcription_as_a_Relative_Insider_Implications_for_Rigor","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","318586199_Children's_Use_of_Objects_in_Their_Storytelling","312659855_Children's_ongoing_and_relational_negotiation_of_informed_assent_in_child-researcher_child-child_and_child-parent_interaction","307940615_Multimodality_Learning_and_Communication_A_social_semiotic_frame_by_J_Bezemer_and_G_Kress","292836316_Multimodal_pedagogies_in_diverse_classrooms_Representation_rights_and_resources","291144504_Literacy_in_the_New_Media_Age"]}