{"id":"326490085_ISSN_2394-4714_Foundation_of_Computer_Science_FCS","abstract":"This paper presents report of research work on comparative analysis of Pathloss measurements based on terrain differences, frequencies of operation and distance between Base Transceiver Station (BTS) and Mobile Station (MS). Lagos state G.S.M terrains with 2G (900MHz / 1800MHz) and 3G (2100MHz) frequencies of operation were put under investigation. Field data were collected through drive tests from twelve (12) different sites using TEMS software in the chosen environments over a range of distance between 0.5-10Km from Base station (BS) to Mobile station (MS) with measurement taken at 0.5Km intervals for a period of one year (52 weeks). Strategically Lagos-Island (N6 0 27.4832' E3 0 23.5453'), Surulere (N6 0 33.3844' E3 0 20.9407'), Lekki-Oniru (N6 0 26.6661' E3 0 28.7463') and Agbede-Ikorodu (N6 0 39.9250' E3 0 29.0363') were chosen as dense-urban (DU), urban (UR), suburban (SU) and non-urban (NU) G.S.M terrains respectively. In this research work Rxlev/RSSI and Pathloss were measured in all areas of investigation and empirical Cost231-Hata model was used for pathloss calculation of field data, and its results were compared with Pathloss measured through drive tests. The measured pathloss, when compared with empirical values from the COST 231 theoretical models, showed a close agreement with the pathloss predicted by the COST231-Hata model in terms of mean square error analysis. During our findings it was revealed that Pathloss increases with distance between BTS and MS, Pathloss also increases with frequency of operation; hence 3G networks experience more pathloss than 2G and from further analysis it was observed that Pathloss increases from Non-Urban to SubUrban to Urban and Dense-Urban respectively when compared using different terrain characteristics. General Terms Comparative analysis of pathloss measurements","authors":["Nurudeen Ola Salau","Oluwagbemiga Shoewu","A O Ogunlewe"],"meta":["February 2017","Projects: Pathloss Measurement for G.S.M Terrains in Lagos State NigeriaPredicting of WLAN RSSI using AI "],"references":["326504342_Evaluation_and_Analysis_of_3G_Network_in_Lagos_Metropolis_Nigeria","320532656_Comparison_of_Propagation_Models_for_GSM_1800_and_WCDMA_Systems_in_Selected_Urban_Areas_of_Nigeria","307513002_Empirical_Analysis_on_the_GSM_Network_KPIs_Using_Real-_Time_Methodology_for_a_Novel_Network_Integration","264737837_Measurement_and_Modeling_of_Path_Loss_for_GSM_Signal_in_a_Sub_Urban_Environment_over_Irregular_Terrain-Review","262294517_Propagation_measurements_and_modelling_at_1800_MHz_in_Lagos_Nigeria","45796458_Optimised_COST-231_Hata_Models_for_WiMAX_Path_Loss_Prediction_in_Suburban_and_Open_Urban_Environments","236183230_Wireless_Communications_Principles_and_Practice_2nd_Edition"]}