{"id":"326415570_Lecturers'_Understanding_on_Indexing_Databases_of_SINTA_DOAJ_Google_Scholar_SCOPUS_and_Web_of_Science_A_Study_of_Indonesians","abstract":"The Ministry of Research, Technology and Higher Education of Indonesia has\nintroduced several national and international indexers of scientific works. This policy becomes a guideline for lecturers and researchers in choosing the reputable publications. This study aimed to describe the understanding level of Indonesian lecturers related to indexing databases,i.e. SINTA, DOAJ, Scopus, Web of Science, and Google Scholar. This research used descriptive design and survey method. The populations in this study were Indonesian lecturers and researchers. The primary data were obtained from a questionnaire filled by 316 lecturers and researchers from 33 Provinces in Indonesia recruited with convenience sampling technique on October-November 2017. The data analysis was performed using frequency distribution tables, cross tabulation and descriptive analysis. The results of this study showed that the understanding of Indonesian lecturers and researchers regarding publications in indexing databases SINTA, DOAJ, Scopus, Web of Science and Google Scholar is that, on average, 66,5% have known about SINTA, DOAJ, Scopus, Web of Science and Google Scholar. However, based on empirical frequency 76% of them have never published with journals or\nproceedings indexed in Scopus.","authors":["Ansari Saleh Ahmar","Nuning Kurniasih","Dasapta Erwin Irawan","Dian Utami Sutiksno"],"meta":["January 2018Journal of Physics Conference Series 954(1):012026","DOI:10.1088/1742-6596/954/1/012026","Projects: CollaborationJournalismCity Brandingdevelopment of publicationto make a portable instrument for methane detectionSistem Keamanan Pintu Berbasis Arduino MegaUSPTO Application #: 20090082604, “Novel process for producing liquid hydrocarbon by pyrolysis of biomass in presence of hydrogen from a carbon-free energy sourceDesigning Augmented Reality as a Role-Playing Strategy to Enhance Learners’ Extensive Reading: A Case StudyDerivates of azaphilone Monascus pigmentsLectures' Understanding on Indexing Databases of SINTA, DOAJ, Google Scholar, SCOPUS, and Web of Science: A Study of IndonesianseComputer Sciencefree research in technology and educationPengaruh Kualitas Jasa, Citra Perusahaan dan Tingkat Suku Bunga Kredit Terhadap Keputusan Pengambilan Produk Kredit MikroArticleDecision Support System (DSS)Private Law Journal, Sociotechno anda Social Scienceprogramme developmentPolicies for admission of new studentsLecturers’ Understanding on Indexing Databases of SINTA, DOAJ, Google Scholar, SCOPUS, and Web of Science: A Study of IndonesiansEffektifitas Teknikal Sumber Daya Manusia Sebuah Paradigma dalam Penilaian KinerjaManagement"],"references":["326148837_Riding_with_the_Metric_Tide_'Predatory'_Journals_in_Scopus","314273427_The_impact_factor_of_an_open_access_journal_does_not_contribute_to_an_article's_citations","308504716_The_Implementation_of_Altmetrics_in_Library_as_an_Alternative_Measurement_Method_for_Scholarly_Article_Impact_in_Social_Web_Ecosystem","263230667_Residual_Effects_of_Past_on_Later_Behavior_Habituation_and_Reasoned_Action_Perspectives","262011627_The_Mediating_Role_of_Social_Competition_Identity_Management_Strategy_in_the_Predictive_Relationship_between_Susceptibility_to_Social_Influence_Internet_Privacy_Concern_and_Online_Political_Efficacy","254734093_Habit_and_Intention_in_Everyday_Life_The_Multiple_Processes_by_Which_Past_Behavior_Predicts_Future_Behavior","230572840_Pedestrians'_intention_to_jaywalk_Automatic_or_planned_A_study_based_on_a_dual-process_model_in_China","229159279_Open_Access_versus_Subscription_Journals_A_Comparison_of_Scientific_Impact","309425256_The_Mediating_Role_of_Social_Competition_Identity_Management_Strategy_in_the_Predictive_Relationship_between_Susceptibility_to_Social_Influence_Internet_Privacy_Concern_and_Online_Political_Efficacy","235913739_Residual_Effects_of_Past_on_Later_Behavior_Habituation_and_Reasoned_Action_Perspectives"]}