{"id":"326480991_M-Centrality_Identifying_key_nodes_based_on_global_position_and_local_degree_variation","abstract":"Identifying influential nodes in a network is a major issue due to the great deal of applications concerned, such as disease spreading and rumor dynamics. That is why, a plethora of centrality measures has emerged over the years in order to rank nodes according to their topological importance in the network. Local metrics such as degree centrality make use of a very limited information and are easy to compute. Global metrics such as betweenness centrality exploit the information of the whole network structure at the cost of a very high computational complexity. Recent works have shown that combining multiple metrics is a promising strategy to quantify the node's influential ability. Our work is in this line. In this paper, we introduce a multi-attributes centrality measure called M-Centrality that combines the information on the position of the node in the network with the local information on its nearest neighborhood. The position is measured by the K-shell decomposition, and the degree variation in the neighborhood of the node quantifies the influence of the local context. In order to examine the performances of the proposed measure, we conduct experiments on small and large scale real-world networks from the perspectives of transmission dynamics and network connectivity. According to the empirical results, the M-Centrality outperforms its alternatives in identifying both influential spreaders and nodes essential to maintain the network connectivity. In addition, its low computational complexity makes it easily applied to large scale networks.","authors":["Ahmed Ibnoulouafi","Mohamed El Haziti","Hocine Cherifi"],"meta":["July 2018Journal of Statistical Mechanics Theory and Experiment 2018(7):073407","DOI:10.1088/1742-5468/aace08"],"references":["319663233_Discussion_on_Damping_Factor_Value_in_PageRank_Computation","319347666_Local_Community_Detection_in_Dynamic_Graphs_Using_Personalized_Centrality","312870733_Iterative_Neighbour-Information_Gathering_for_Ranking_Nodes_in_Complex_Networks","308062589_The_Dynamics_of_Viral_Marketing","306931772_Correction_A_Novel_Top-k_Strategy_for_Influence_Maximization_in_Complex_Networks_with_Community_Structure","320767616_Influential_nodes_ranking_in_complex_networks_An_entropy-based_approach","304744011_Vital_nodes_identification_in_complex_networks","303980462_Information-Theoretic-Entropy_Based_Weight_Aggregation_Method_in_Multiple-Attribute_Group_Decision-Making","303557829_Fast_ranking_influential_nodes_in_complex_networks_using_a_k-shell_iteration_factor","299358250_Network_of_Thrones"]}