{"id":"326488302_Computers_Aren't_Syntax_All_the_Way_Down_or_Content_All_the_Way_Up","abstract":"This paper argues that the idea of a computer is unique. Calculators and analog computers are not different ideas about computers, and nature does not compute by itself. Computers, once clearly defined in all their terms and mechanisms, rather than enumerated by behavioral examples, can be more than instrumental tools in science, and more than source of analogies and taxonomies in philosophy. They can help us understand semantic content and its relation to form. This can be achieved because they have the potential to do more than calculators, which are computers that are designed not to learn. Today’s computers are not designed to learn; rather, they are designed to support learning; therefore, any theory of content tested by computers that currently exist must be of an empirical, rather than a formal nature. If they are designed someday to learn, we will see a change in roles, requiring an empirical theory about the Turing architecture’s content, using the primitives of learning machines. This way of thinking, which I call the intensional view of computers, avoids the problems of analogies between minds and computers. It focuses on the constitutive properties of computers, such as showing clearly how they can help us avoid the infinite regress in interpretation, and how we can clarify the terms of the suggested mechanisms to facilitate a useful debate. Within the intensional view, syntax and content in the context of computers become two ends of physically realizing correspondence problems in various domains.","authors":["Cem Bozsahin"],"meta":["September 2018Minds and Machines 28(1):1-25","DOI:10.1007/s11023-018-9469-2"],"references":["346925784_Perception_and_Understanding_in_Young_Children_An_Experimental_Approach","319448732_Why_philosophers_should_care_about_computational_complexity","319394391_Constraints_on_Variables_in_syntax","316121614_Bootstrapping_language_acquisition","313609411_Troubles_with_computationalism","304541636_Biological_Foundations_of_Language","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","301266099_What_Is_a_Computational_Constraint","291866980_On_the_spaghetti_computer_and_other_analog_gadgets_for_problem_solving","285520249_The_physical_Church_thesis_and_physical_computational_complexity","279419194_Studies_in_Cognitive_Systems","279265687_Computers","273988644_Intentional_Systems","272160113_Minds_Brains_and_Programs","271696231_The_Linguistic_Development_of_Genie"]}