{"id":"326472400_Performance_management_system_and_public_service_delivery_in_Nigeria_Impacts_problems_challenges_and_prospects","abstract":"Background: Managing workers’ performance is an effective mechanism for developing both workers and organisational effectiveness. By clarifying an organisation’s objectives, translating these objectives into clear individual goals and reviewing their goals regularly, performance management provides a well-structured and effective management tool for public service delivery.\n\nObjectives: The aim of this article is to examine performance management system approaches introduced in Nigeria between 1960 and 2017 for public service delivery.\n\nMethods: This study relied on secondary sources of data collection, such as public service reforms, textbooks, journal articles, newspapers and the Internet. Data analysis techniques adopted include content, thematic, historical and secondary data analyses.\n\nResults: The results show the impact made and problems and challenges experienced. They include inconsistent and contradictory reforms from one regime to another, the absence of clear indices of measurement, lack of employees’ engagement, the use of traditional line item and zero-based budgeting systems instead of performance-based budgeting system and incentives do not built into performance management, among others.\n\nConclusion: The article concludes that performance management system is yet to be entrenched in public sector management in Nigeria and recommends, among other things, that government should embark on institutional reforms to help achieve results in high-priority areas, reinforce the intent of the law to help agencies move beyond a narrow compliance culture, train public managers and administrators on fundamentals of performance management systems and the measurement of key performance indicators.","authors":["Augustine Eneanya"],"meta":["July 2018Africa’s Public Service Delivery and Performance Review 6(1)","DOI:10.4102/apsdpr.v6i1.201"],"references":["254734316_Building_a_Practically_Useful_Theory_of_Goal_Setting_and_Task_Motivation_A_35Year_Odyssey","308575119_Getting_Serious_about_Performance_Management","254356787_Performance_Contracting_in_the_Human_Services","247756548_A_Proven_ConnectionPerformance_Management_and_Business_Results","246794791_Measuring_Performance_in_Public_and_Nonprofit_Organization","246333399_Goal_setting_A_motivational_technique_that_works","240531000_Performance_management_theory_A_look_from_the_performer's_perspective_with_implications_for_HRD","232602449_Systems_of_Organization","228253257_Performance_Appraisal_Performance_Management_and_Improving_Individual_Performance_A_Motivational_Framework","227616491_Performance_Appraisal_and_Management_The_Developing_Research_Agenda"]}