{"id":"326422701_How_Maintainability_Issues_of_Android_Apps_Evolve","abstract":"Android is the largest mobile platform today, with thousands of apps published and updated in the Google Play store everyday. Maintenance is an important factor in Android apps lifecycle, as it allows developers to constantly improve their apps and better tailor them to their user base. In this paper we investigate the evolution of various maintainability issues along the lifetime of Android apps. We designed and conducted an empirical study on 434 GitHub repositories containing open, real (i.e., published in the Google Play store), and actively maintained Android apps. We statically analyzed 9,945 weekly snapshots of all apps for identifying their maintainability issues over time. We also identified maintainability hotspots along the lifetime of Android apps according to how their density of maintainability issues evolves over time. More than 2,000 GitHub commits belonging to identified hotspots have been manually categorized to understand the context in which maintainability hotspots occur. Our results shed light on (i) how often various types of maintainability issues occur over the lifetime of Android apps, (ii) the evolution trends of the density of maintainability issues in Android apps, and (iii) an in-depth characterization of development activities related to maintainability hotspots. Together, these results can help Android developers in (i) better planning code refactoring sessions, (ii) better planning their code review sessions (e.g., steering the assignment of code reviews), and (iii) taking special care of their code quality when performing tasks belonging to activities highly correlated with maintainability issues. We also support researchers by objectively characterizing the state of the practice about maintainability of Android apps. Independently from the type of development activity , maintainability issues grow until they stabilize, but are never fully resolved.","authors":["Ivano Malavolta","Roberto Verdecchia","Bojan Filipovic","Magiel Bruntink"],"meta":["July 2018","DOI:10.1109/ICSME.2018.00042","Conference: International Conference on Software Maintenance and Evolution (ICSME)"],"references":["325545505_A_Graph-based_Dataset_of_Commit_History_of_Real-World_Android_apps","325545411_Self-Reported_Activities_of_Android_Developers","312485026_A_Quantitative_and_Qualitative_Investigation_of_Performance-Related_Commits_in_Android_Apps","304286743_Tracking_the_Software_Quality_of_Android_Applications_Along_Their_Evolution_T","297737807_When_and_Why_Your_Code_Starts_to_Smell_Bad","281527594_An_in-depth_study_of_the_promises_and_perils_of_mining_GitHub","273397841_Test_Code_Quality_and_Its_Relation_to_Issue_Handling_Performance","317542596_A_Time_Series_Analysis_of_TravisTorrent_Builds_To_Everything_There_Is_a_Season","312256506_Towards_a_Benchmark_for_the_Maintainability_Evolution_of_Industrial_Software_Systems","280742393_Time_Series_Analysis_Forecasting_and_Control"]}