{"id":"326504494_A_branch-and-price_Algorithm_for_the_Vehicle_Routing_Problem_with_Time_Windows_on_a_road_network","abstract":"Vehicle routing problems (VRP) concern the pickup and/or the delivery of goods from/to customers with vehicles. In the literature, most approaches consider the road network implicitly. Specifically, so‐called customer‐based graphs are used where nodes represent customers (plus the depot) and arcs represent best paths between customers. This model can affect solution quality when several attributes are defined on road segments (like travel time and distance). To handle that, two approaches are proposed in the literature. The road network can be represented using a multigraph that extends the customer‐based graph and where an arc is introduced for every efficient path between two nodes. Alternatively, the problem can be solved on a graph that mimics the original road network. In this paper, we investigate the latter approach. We consider the VRP with time windows (VRPTW) and we develop a branch‐and‐price scheme. An extensive computational study based on several types of instances is conducted in order to evaluate this approach compared to the multigraph‐based approach. As far as we know, our branch‐and‐price scheme is the first exact method for the VRPTW with the road‐network model. Also, our computational study provides the first comparison between the two models: multigraph and road‐network.","authors":["Hamza Ben Ticha","Nabil Absi","Dominique Feillet","Alain Quilliot"],"meta":["September 2018Networks 73(4)","DOI:10.1002/net.21852","Project: Vehicle Routing Problems in urban areas"],"references":["318109030_A_solution_method_for_the_Multi-destination_Bi-objectives_Shortest_Path_Problem","263519614_Pricing_Routines_for_Vehicle_Routing_with_Time_Windows_on_Road_Networks","228564046_Cut-First_Branch-and-Price-Second_for_the_Capacitated_Arc-Routing_Problem","328819735_Multigraph_Modeling_and_Adaptive_Large_Neighborhood_Search_for_the_Vehicle_Routing_Problem_with_Time_Windows","322630979_Vehicle_routing_problems_with_road-network_information_State_of_the_art","318086646_Empirical_analysis_for_the_VRPTW_with_a_multigraph_representation_for_the_road_network","284685941_Branch_and_Price_Column_generation_for_solving_huge_integer_programs","284299207_Some_considerations_about_computational_complexity_for_multiobjective_combinatorial_problems","267109723_The_Vehicle_Routing_Problem_Latest_Advances_and_New_Challenges","237131761_Lecture_Notes_in_Economics_and_Mathematical_Systems"]}