{"id":"326516795_Genomic_mosaicism_in_the_developing_and_adult_brain","abstract":"Since the discovery of DNA, the normal developing and functioning brain has been assumed to be composed of cells with identical genomes, which remains the dominant view even today. However, this pervasive assumption is incorrect, as proven by increasing numbers of reports within the last 20 years that have identified multiple forms of somatically produced genomic mosaicism (GM), wherein brain cells – especially neurons – from a single individual show diverse alterations in DNA, distinct from the germline. Critically, these changes alter the actual DNA nucleotide sequences – in contrast to epigenetic mechanisms – and almost certainly contribute to the remarkably diverse phenotypes of single brain cells, including single‐cell transcriptomic profiles. Here we review the history of GM within the normal brain, including its major forms, initiating mechanisms, and possible functions. GM forms include aneuploidies and aneusomies, smaller copy number variations (CNVs), long interspersed nuclear element type 1 (LINE1) repeat elements, and single nucleotide variations (SNVs), as well as DNA content variation (DCV) that reflects all forms of GM with greatest coverage of large, brain cell populations. In addition, technical considerations are examined, along with relationships amongst GM forms and multiple brain diseases. GM affecting genes and loci within the brain contrast with current neural discovery approaches that rely on sequencing non‐brain DNA (e.g., genome‐wide association studies (GWAS)). Increasing knowledge of neural GM has implications for mechanisms of development, diversity, and function, as well as understanding diseases, particularly the overwhelming prevalence of sporadic brain GM unlinked to germline mutations. This article is protected by copyright. All rights reserved.","authors":["Suzanne Rohrback","Benjamin Siddoway","Christine S Liu","Jerold Chun"],"meta":["July 2018Developmental Neurobiology 78(11)","DOI:10.1002/dneu.22626"],"references":["322976464_The_Human_Cell_Atlas","322507522_Conserved_properties_of_dentate_gyrus_neurogenesis_across_postnatal_development_revealed_by_single-cell_RNA_sequencing","322320149_LINE-1_protein_localization_and_functional_dynamics_during_the_cell_cycle","322072513_Somatic_Mutations_Activating_the_mTOR_Pathway_in_Dorsal_Telencephalic_Progenitors_Cause_a_Continuum_of_Cortical_Dysplasias","321734918_Integrative_single-cell_analysis_of_transcriptional_and_epigenetic_states_in_the_human_adult_brain","321657941_Different_mutational_rates_and_mechanisms_in_human_cells_at_pregastrulation_and_neurogenesis","321584619_Science_Forum_The_Human_Cell_Atlas","342137924_The_recombination_activating_gene-1_RAG-1_transcript_is_present_in_the_murine_central_nervous_system","323789252_Single-cell_profiling_of_the_developing_mouse_brain_and_spinal_cord_with_split-pool_barcoding","321660477_Aging_and_neurodegeneration_are_associated_with_increased_mutations_in_single_human_neurons"]}