{"id":"326504141_Behavior_of_an_Inductive_Loop_Sensor_in_the_Measurement_of_Partial_Discharge_Pulses_with_Variations_in_Its_Separation_from_the_Primary_Conductor","abstract":"Ideally, an insulation system must be capable of electrically insulating the active components of a machine or device subjected to high voltages. However, due to the presence of polluting agents or imperfections inside or on the surface of the insulation, small current pulses called partial discharges (PDs) are common, which partially short-circuit the insulation and cause it to lose its insulating properties, and thus its insulation capacity, over time. In some cases, measurements of this phenomenon are limited by the type of sensor used; if it is not adequate, it can distort the obtained results, which can lead to a misdiagnosis of the state of the device. The inductive loop sensor has experimentally been demonstrated to be capable of properly measuring different types of PDs. However, because of its current design, there are several practical limitations on its use in real devices or environments. An example is the presence of a primary conductor located at a fixed distance from the sensor, through which PD pulses must flow for the sensor to capture them. In this article, the sensor’s behavior is studied at different separation distances from the line through which the PD pulses flow. In addition, the measuring capacity of the sensor is tested by removing the presence of the primary conductor and placing the sensor directly over the line through which the PD pulses of a real device flow.","authors":["Jorge Alfredo Ardila-Rey","Aldo Barrueto","Alvaro Zerene","Bruno Albuquerque de Castro"],"meta":["July 2018Sensors 18(7):2324","DOI:10.3390/s18072324","Projects: SEPARATION, IDENTIFICATION AND LOCALIZATION OF PARTIAL DISCHARGES SOURCES BY MEANS OF UHF MEASUREMENTS FOR ELECTRICAL ASSETS MAINTENANCESignal processing analysis applied to partial discharges monitoring"],"references":["351373144_THE_HF_RESISTANCE_OF_SINGLE_LAYER_COILS","324088835_A_Comparison_of_Inductive_Sensors_in_the_Characterization_of_Partial_Discharges_and_Electrical_Noise_Using_the_Chromatic_Technique","309004377_A_low_cost_system_for_acoustic_monitoring_of_partial_discharge_in_power_transformer_by_piezeletic_sensor","267641815_The_Rogowski_Coil_Principles_and_Applications_A_Review","260370872_Inductive_Sensor_Performance_in_Partial_Discharges_and_Noise_Separation_by_Means_of_Spectral_Power_Ratios","233741471_Implementation_of_a_Rogowski_coil_for_the_measurement_of_partial_discharges","318894245_Assessment_of_Macro_Fiber_Composite_Sensors_for_Measurement_of_Acoustic_Partial_Discharge_Signals_in_Power_Transformers","304611911_Geometrical_Shapes_Impact_on_the_Performance_of_ABS-Based_Coreless_Inductive_Sensors_for_PD_Measurement_in_HV_Power_Cables","234234321_Antenna_Theory_and_Design","233748266_Designing_and_tuning_an_air-cored_current_transformer_for_partial_discharges_pulses_measurements"]}