{"id":"326559394_jAVANT-GARDE_A_Cross-Platform_Serious_Game_for_an_Introduction_to_Programming_With_Java","abstract":"Background. Programming is widely known to be a cognitively demanding field. Learning programming can be a strenuous task without the proper guidance and methodology. Students often face difficulties in understanding even the most basic and fundamental concepts of programming, leading to their confusion and disappointment. Serious games for programming have the potential to alleviate students’ difficulties with programming.\nAim. This article introduces a new serious game named jAVANT-GARDE which aims to educate the player on the basic concepts of programming and object-oriented programming through Java. By design, the game is suitable for everyone, even for players with no previous knowledge of programming. This article aims to present important information regarding the design, implementation and pilot evaluation of jAVANT-GARDE.\nMethod. The game was evaluated by 42 high school students (age 16-17) in terms of perceived player experience and short-term learning. The participants played the game for one hour in the school lab and then answered a questionnaire based on the MEEGA+ framework.\nResults. Students evaluated positively the game in terms of its usability, confidence in playing the game, challenge, satisfaction, fun, focused attention and relevance. Moreover, the majority of students stated that would prefer learning programming with this game to learning through other teaching methods.\nConclusions. The results of the pilot study and students’ replies in the questionnaire are rather positive. This gives us the initiative to proceed with studying the effect of the game in long-term learning of programming concepts.","authors":["Stefanos Galgouranas","Stelios Xinogalos"],"meta":["July 2018Simulation & Gaming 49(6):104687811878997","DOI:10.1177/1046878118789976"],"references":["323043806_Capitalizing_on_the_Most_Important_Part_of_a_Learning_Session_The_Experience","309031701_MEEGA_An_Evolution_of_a_Model_for_the_Evaluation_of_Educational_Games","280554743_Object-Oriented_Design_and_Programming_An_Investigation_of_Novices'_Conceptions_on_Objects_and_Classes","272171887_Engaging_in_Gameplay_and_in_Debriefing","267034137_Designing_educational_games_for_computer_programming_A_holistic_framework","251899148_Educational_games_EG_design_framework_Combination_of_game_design_pedagogy_and_content_modeling","39997972_A_Conceptual_Framework_for_Serious_Games","313362969_A_conceptual_framework_for_serious_games","228574221_A_Framework_for_developing_serious_games_to_meet_learner_needs"]}