{"id":"326558725_Adaptive_Genetic_Algorithm_for_Optical_Metasurfaces_Design","abstract":"As optical metasurfaces become progressively ubiquitous, the expectations from them are becoming increasingly complex. The limited number of structural parameters in the conventional metasurface building blocks, and existing phase engineering rules do not completely support the growth rate of metasurface applications. In this paper, we present digitized-binary elements, as alternative high-dimensional building blocks, to accommodate the needs of complex-tailorable-multifunctional applications. To design these complicated platforms, we demonstrate adaptive genetic algorithm (AGA), as a powerful evolutionary optimizer, capable of handling such demanding design expectations. We solve four complex problems of high current interest to the optics community, namely, a binary-pattern plasmonic reflectarray with high tolerance to fabrication imperfections and high reflection efficiency for beam-steering purposes, a dual-beam aperiodic leaky-wave antenna, which diffracts TE and TM excitation waveguides modes to arbitrarily chosen directions, a compact birefringent all-dielectric metasurface with finer pixel resolution compared to canonical nano-antennas, and a visible-transparent infrared emitting/absorbing metasurface that shows high promise for solar-cell cooling applications, to showcase the advantages of the combination of binary-pattern metasurfaces and the AGA technique. Each of these novel applications encounters computational and fabrication challenges under conventional design methods, and is chosen carefully to highlight one of the unique advantages of the AGA technique. Finally, we show that large surplus datasets produced as by-products of the evolutionary optimizers can be employed as ingredients of the new-age computational algorithms, such as, machine learning and deep leaning. In doing so, we open a new gateway of predicting the solution to a problem in the fastest possible way based on statistical analysis of the datasets rather than researching the whole solution space.","authors":["Samad Jafar-Zanjani","Sandeep Inampudi","Hossein Mosallaei"],"meta":["July 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-29275-z"],"references":["325559398_Optimization_of_Inventory_Routing_Problem_in_Refined_Oil_Logistics_with_the_Perspective_of_Carbon_Tax","325438655_Magnetism_of_new_metastable_cobalt-nitride_compounds","321325188_Phase_and_dispersion_engineering_of_metalenses_broadband_achromatic_focusing_and_imaging_in_the_visible","320247763_Metalenses_Versatile_multifunctional_photonic_components","325775721_Neural_network_based_design_of_metagratings","325742244_A_new_multilevel_inverter_with_genetic_algorithm_optimization_for_hybrid_power_station_application","325555689_A_new_multilevel_inverter_with_genetic_algorithm_optimization_for_hybrid_power_station_application","325372557_EEO-AGA_energy_efficiency_optimisation_in_D2D_communications_using_adaptive_genetic_algorithm","322830453_Composite_Multilayer_Shared_Aperture_Nanostructures_A_Functional_Multispectral_Control","321588905_Unidirectional_thermal_radiation_from_a_SiC_metasurface"]}