{"id":"326502049_Scattering_Networks_for_Hybrid_Representation_Learning","abstract":"Scattering networks are a class of designed Convolutional Neural Networks (CNNs) with fixed weights. We argue they can serve as generic representations for modelling images. In particular, by working in scattering space, we achieve competitive results both for supervised and unsupervised learning tasks, while making progress towards constructing more interpretable CNNs. For supervised learning, we demonstrate that the early layers of CNNs do not necessarily need to be learned, and can be replaced with a scattering network instead. Indeed, using hybrid architectures, we achieve the best results with predefined representations to-date, while being competitive with end-to-end learned CNNs. Specifically, even applying a shallow cascade of small-windowed scattering coefficients followed by\n$1\\times 1$ \n-convolutions results in AlexNet accuracy on the ILSVRC2012 classification task. Moreover, by combining scattering networks with deep residual networks, we achieve a single-crop top-5 error of 11.4% on ILSVRC2012. Also, we show they can yield excellent performance in the small sample regime on CIFAR-10 and STL-10 datasets, exceeding their end-to-end counterparts, through their ability to incorporate geometrical priors. For unsupervised learning, scattering coefficients can be a competitive representation that permits image recovery. We use this fact to train hybrid GANs to generate images. Finally, we empirically analyze several properties related to stability and reconstruction of images from scattering coefficients.","authors":["Edouard Oyallon","Sergey Zagoruyko","Gabriel Huang","Nikos Komodakis"],"meta":["July 2018IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99):1-1","DOI:10.1109/TPAMI.2018.2855738","Project: Scattering Networks"],"references":["322059657_Scaling_the_Scattering_Transform_Deep_Hybrid_Networks","322058348_Look_Listen_and_Learn","320964604_Building_a_Regular_Decision_Boundary_with_Deep_Networks","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770378_Explaining_and_harnessing_adversarial_examples","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","313619815_Unsupervised_feature_learning_for_RGB-D_based_object_recognition","313061242_A_theory_for_multiresolution_signal_decomposition_The_wavelet_representation","311611060_Context_Encoders_Feature_Learning_by_Inpainting"]}