{"id":"326514397_Statistical_semi-supervised_system_for_grading_multiple_peer-reviewed_open-ended_works","abstract":"In the education context, open-ended works generally entail a series of benefits as the possibility of develop original ideas and a more productive learning process to the student rather than closed-answer activities. Nevertheless, such works suppose a significant correction workload to the teacher in contrast to the latter ones that can be self-corrected. Furthermore, such workload turns to be intractable with large groups of students. In order to maintain the advantages of open-ended works with a reasonable amount of correction effort, this article proposes a novel methodology: students perform the corrections using a rubric (closed Likert scale) as a guideline in a peer-review fashion; then, their markings are automatically analyzed with statistical tools to detect possible biased scorings; finally, in the event the statistical analysis detects a biased case, the teacher is required to intervene to manually correct the assignment. This methodology has been tested on two different assignments with two heterogeneous groups of people to assess the robustness and reliability of the proposal. As a result, we obtain values over 95% in the confidence of the intra-class correlation test (ICC) between the grades computed by our proposal and those directly resulting from the manual correction of the teacher. These figures confirm that the evaluation obtained with the proposed methodology is statistically similar to that of the manual correction of the teacher with a remarkable decrease in terms of effort.","authors":["Juan Ramón Rico-Juan","Antonio Javier Gallego","Jose J. Valero-Mas","Jorge Calvo-Zaragoza"],"meta":["July 2018Computers & Education 126","DOI:10.1016/j.compedu.2018.07.017"],"references":["303357021_Higher_education_and_the_digital_revolution_About_MOOCs_SPOCs_social_media_and_the_Cookie_Monster","288761667_Teachers'_reasons_for_using_peer_assessment_Positive_experience_predicts_use","275449694_Peer_review_in_higher_education_Student_perceptions_before_and_after_participation","312806603_The_Future_of_University_in_the_Post-Massification_Era_A_Conceptual_Framework","276487795_Natural_Language_Processing_techniques_for_researching_and_improving_peer_feedback","276364651_Conceptualization_development_and_implementation_of_a_web-based_system_for_automatic_evaluation_of_mathematical_expressions","263143227_Rethinking_feedback_practices_in_higher_education_A_peer_review_perspective","262273921_Peer_and_Self_Assessment_in_Massive_Online_Classes","228328446_A_Survey_of_Automated_Assessment_Approaches_for_Programming_Assignments","227966907_Improving_the_Efficiency_and_Effectiveness_of_Grading_Through_the_Use_of_Computer-Assisted_Grading_Rubrics"]}