{"id":"326552317_Dynamic_Programming_heuristic_for_k-means_Clustering_among_a_2-dimensional_Pareto_Frontier","abstract":"This paper is motivated by a real life application of multi-objective optimization without preference. Having many incomparable solutions with Pareto optimality, the motivation is to select a small number of representative solutions for decision makers. The k-means clustering is investigated in this paper for the 2-dimensional case using the specific property that the points to cluster are Pareto optimal in R 2. A dynamic programming heuristic is designed, assuming a specific property of the optimal clusters. Having N points to partition in K cluster, the complexity of the heuristic is in O(N 3). If the presented conjecture is proven, it induces that K-means clustering would be polynomially solvable in O(N 3). The dynamic programming algorithm can be adapted to consider cardinality constraints for the clusters, which can improve the complexity. Matheuristics can be derived from the previous algorithm to have a complexity in O(K.N 2). These algorithms allows a natural parallel implementation. A posteriori, the complexity of the clustering algorithms allows also to consider these algorithms inside multi-objective meta-heuristics to archive diversified non-dominated points along the Pareto front. Applications in stochastic/robust optimization are also discussed, clustering scenarios of uncertainty.","authors":["Nicolas Dupin","Frank Nielsen","El-Ghazali Talbi"],"meta":["July 2018","Conference: 7th International Conference on Metaheuristics and Nature Inspired Computing META’18At: Marrakech","Project: Clustering algorithms in a 2d Pareto Front"],"references":["327797677_Introduction_to_HPC_with_MPI_for_Data_Science","321482087_MBSE_PLM_MIP_and_Robust_Optimization_for_System_of_Systems_Management_Application_to_SCCOA_French_Air_Defense_Program","316882972_Modelisation_et_resolution_de_tres_grands_problemes_stochastiques_combinatoires_application_a_la_gestion_de_production_electrique","311106771_On_Scenario_Aggregation_to_Approximate_Robust_Optimization_Problems","325150360_Parallel_matheuristics_for_the_discrete_unit_commitment_problem_with_min-stop_ramping_constraints","312908300_Fast_Exact_k-Means_k-Medians_and_Bregman_Divergence_Clustering_in_1D","310403387_A_K-means_clustering_algorithm","309715704_Least_squares_quantization_in_PCM","295761729_Using_clustering_techniques_to_improve_the_performance_of_a_multi-objective_particle_swarm_optimizer","284686912_k-means_the_advantages_of_careful_seeding_In_Proceedings_of_the_Eighteenth_Annual_ACM-SIAM_Symposium_on_Discrete_Algorithms_New_Orleans_SIAM_pp_1027-1035"]}