{"id":"326547795_Transformation_Changes_in_the_System_of_Professional_Competences_of_a_Modern_Specialists_in_the_Conditions_of_Knowledge_Economy's_Formation_and_the_Innovational_Approach_to_Training","abstract":"The purpose of the article is to study the transformation changes in the system of professional competences of modern specialist in the conditions of knowledge economy’s formation and formation of Industry 4.0 and to develop the innovational approach to its study and preparation. Methodology of this approach is based on application of competence-based approach to education and learning, the method of compiling a map of competences of a modern specialist, and the method of graphic interpretation of authors’ conclusions and recommendations (the method of data formalization). As a result of studying the structure and logic of organization of the educational services market and labor market by the example of modern Russia, it is concluded that a narrow specialization of employees is in demand. Business processes of modern Russian companies are strictly differentiated; ordinary employees, innovators, and technical specialists are separated. In the conditions of knowledge economy’s formation and formation of Industry 4.0, wide specialization of employees will be in demand. As production functions will be automatized, the number of companies’ employees will be reduced, and each employees will have to conform to requirements from all three categories. Transition to new requirements to a modern specialist in the conditions of knowledge economy’s formation and formation of Industry 4.0 will be related to transformation changes in the system of his professional competences. We compiled a map of professional competences of a modern specialist in the conditions of knowledge economy’s formation and formation of Industry 4.0 and distinguished three main professional competences, which a production specialist should possess in the conditions of knowledge economy and Industry 4.0: competence of generation of innovations, computer programming, and digital thinking. According to the above transformation changes in the system of professional competences of a modern specialist in the conditions of knowledge economy’s formation and formation of Industry 4.0, it is necessary to pass from narrow specialization of specialists’ training to creation of wide specialization of employees. For that, an innovational approach (Fig. 1) to teaching and training of a modern specialist in the conditions of knowledge economy’s formation and formation of Industry 4.0 is presented.","authors":["Aleksei Bogoviz","Tatiana I. Gulyaeva","Elena I. Semenova","Svetlana Lobova"],"meta":["January 2019","DOI:10.1007/978-3-319-94310-7_19","In book: Industry 4.0: Industrial Revolution of the 21st Century (pp.193-200)"],"references":["318161718_Assessment_of_the_Students'_Expectations_and_Perception_Regarding_the_Development_of_the_Competences_in_Industrial_Engineering_Course","317692047_Development_of_the_Industrial_IoT_Competences_in_the_Areas_of_Organization_Process_and_Interaction_Based_on_the_Learning_Factory_Concept","316019644_Development_of_competences_while_solving_real_industrial_interdisciplinary_problems_A_successful_cooperation_with_industry","315703229_The_development_of_student's_cultural_competence_in_a_post-industrial_society_The_imperatives_of_capital_approach","276099825_Influence_of_problem-based_learning_strategy_on_enhancing_student's_industrial_oriented_competences_learned_an_action_research_on_learning_weblog_analysis","313109658_Electronic_information_and_education_environment_as_instrument_of_forming_and_quality_evaluation_of_professional_competences_of_the_international_industrial_enterprises_specialists"]}