{"id":"326540762_The_ABC_of_Software_Engineering_Research","abstract":"A variety of research methods and techniques are available to SE researchers, and while several overviews exist, there is neither consistency in the research methods covered nor in the terminology used. Furthermore, research is sometimes critically reviewed for characteristics inherent to the methods. We adopt a taxonomy from the social sciences, termed here the ABC framework for SE research, which offers a holistic view of eight archetypal research strategies. ABC refers to the research goal which strives for generalizability over Actors (A), precise measurement of their Behavior (B), in a realistic Context (C). The ABC framework uses two dimensions widely considered to be key in research design: the level of obtrusiveness of the research, and generalizability of research findings. We discuss metaphors for each strategy and their inherent limitations and potential strengths. We illustrate these research strategies in two key SE domains: global software engineering and requirements engineering, and apply the framework on a sample of 75 articles. Finally, we discuss six ways in which the framework can advance SE research.","authors":["Klaas-Jan Stol","Brian Fitzgerald"],"meta":["July 2018ACM Transactions on Software Engineering and Methodology 27(3):1-51","DOI:10.1145/3241743","Project: Software Engineering Research Methods"],"references":["322673772_Toward_Methodological_Guidelines_for_Process_Theories_and_Taxonomies_in_Software_Engineering","321171730_Competition-Based_Crowdsourcing_Software_Development_A_Multi-Method_Study_from_a_Customer_Perspective","317934577_On_the_correlation_between_size_and_metric_validity","316218588_Curating_GitHub_for_engineered_software_projects","315919595_Documenting_and_sharing_software_knowledge_using_screencasts","315918566_An_empirical_study_of_unspecified_dependencies_in_make-based_build_systems","329855251_Towards_Dissolution_of_the_is_Research_Debate_From_Polarization_to_Polarity","324353742_Unobtrusive_Measures_Nonreactive_Research_in_the_Social_Sciences","320070983_A_large-scale_study_of_programming_languages_and_code_quality_in_GitHub","317953357_The_discovery_of_grounded_theory"]}