{"id":"326579025_A_Novel_Transfer_Learning_Approach_to_Enhance_Deep_Neural_Network_Classification_of_Brain_Functional_Connectomes","abstract":"Early diagnosis remains a significant challenge for many neurological disorders, especially for rare disorders where studying large cohorts is not possible. A novel solution that investigators have undertaken is combining advanced machine learning algorithms with resting-state functional Magnetic Resonance Imaging to unveil hidden pathological brain connectome patterns to uncover diagnostic and prognostic biomarkers. Recently, state-of-the-art deep learning techniques are outperforming traditional machine learning methods and are hailed as a milestone for artificial intelligence. However, whole brain classification that combines brain connectome with deep learning has been hindered by insufficient training samples. Inspired by the transfer learning strategy employed in computer vision, we exploited previously collected resting-state functional MRI data for healthy subjects from existing databases and transferred this knowledge for new disease classification tasks. We developed a deep transfer learning neural network (DTL-NN) framework for enhancing the classification of whole brain functional connectivity patterns. Briefly, we trained a stacked sparse autoencoder (SSAE) prototype to learn healthy functional connectivity patterns in an offline learning environment. Then, the SSAE prototype was transferred to a DTL-NN model for a new classification task. To test the validity of our framework, we collected resting-state functional MRI data from the Autism Brain Imaging Data Exchange (ABIDE) repository. Using autism spectrum disorder (ASD) classification as a target task, we compared the performance of our DTL-NN approach with a traditional deep neural network and support vector machine models across four ABIDE data sites that enrolled at least 60 subjects. As compared to traditional models, our DTL-NN approach achieved an improved performance in accuracy, sensitivity, specificity and area under receiver operating characteristic curve. These findings suggest that DTL-NN approaches could enhance disease classification for neurological conditions, where accumulating large neuroimaging datasets has been challenging.","authors":["Hailong Li","Nehal A. Parikh","Lili He"],"meta":["July 2018Frontiers in Neuroscience 12","DOI:10.3389/fnins.2018.00491"],"references":["324036771_Robust_multi-label_transfer_feature_learning_for_early_diagnosis_of_Alzheimer's_disease","322847950_Early_prediction_of_cognitive_deficits_in_very_preterm_infants_using_functional_connectome_data_in_an_artificial_neural_network_framework","319401022_Identification_of_autism_spectrum_disorder_using_deep_learning_and_the_ABIDE_dataset","319204072_Diagnosing_Autism_Spectrum_Disorder_from_Brain_Resting-State_Functional_Connectivity_Patterns_Using_a_Deep_Neural_Network_with_a_Novel_Feature_Selection_Method","287807235_Characteristics_of_Brains_in_Autism_Spectrum_Disorder_Structure_Function_and_Connectivity_across_the_Lifespan","312979061_FNIRT-FMRIB's_non-linear_image_registration_tool","312839772_Deep_Ensemble_Learning_of_Sparse_Regression_Models_for_Brain_Disease_Diagnosis","309532479_Random_features_for_large_scale_kernel_machines","304582504_Brain_functional_network_connectivity_development_in_very_preterm_infants_The_first_six_months","300476986_Discrimination_of_ADHD_Based_on_fMRI_Data_with_Deep_Belief_Network"]}