{"id":"326565826_A_self-organized_resource_provisioning_for_cloud_block_storage","abstract":"Modern cloud deployments rely on multiple layers of microservices and a layer of one or more persistent data store systems. The latter has always received a lot of attention as it is the slowest part of the request of an online service. Its unpredictable performance due to workload interference, performance degradation, lack of control, and network partitions has made the cloud less attractive for some services, especially for the applications that require guaranteed throughput, latency, elasticity, and high availability. Motivated by those facts, we propose the Block Software Defined Storage (BSDS), a framework to automate the orchestration, deployment, and management of a storage system by separating the data layer from control. BSDS employs an SLA-aware (Service Level Agreement) and self-learning scheduler that treats the backend media as a black box and abstracts the resource allocation from the state of the storage cluster. Our proposed framework is a step toward the emergence of an intelligent cloud infrastructure that can adapt to unexpected failures, network traffic fluctuations, workload interference perturbations or even changes in the underlying infrastructure. We perform extensive simulations with workloads deduced from an enterprise block storage system and showcase that the proposed scheduler can provide guaranteed Quality of Service (QoS). We finally demonstrate a practical deployment of BSDS on the OpenStack platform.","authors":["Babak Ravandi","Ioannis Papapanagiotou"],"meta":["July 2018Future Generation Computer Systems 89(4)","DOI:10.1016/j.future.2018.06.045","Project: Software Defined Storage for Cloud Infrastructure"],"references":["318671352_Next_Generation_Cloud_Computing_New_Trends_and_Research_Directions","316791415_A_Self-Learning_Scheduling_in_Cloud_Software_Defined_Block_Storage","313837980_A_Trace-Driven_Evaluation_of_Cloud_Computing_Schedulers_for_IaaS","312572431_A_Black-Box_Self-Learning_Scheduler_for_Cloud_Block_Storage_Systems","312478950_Toward_cloud_computing_QoS_architecture_Analysis_of_cloud_systems_and_cloud_services","322259715_On_Reducing_IoT_Service_Delay_via_Fog_Offloading","318847338_An_efficient_load-balancing_mechanism_for_heterogeneous_range-queriable_cloud_storage","318636637_Complex_Systems_and_Clouds_A_Self-Organization_and_Self-Management_Perspective","312655362_Model_learning","311358640_Research_challenges_in_legal-rule_and_QoS-aware_cloud_service_brokerage"]}