{"id":"326687518_Full-Fledged_Semantic_Indexing_and_Querying_Model_Designed_for_Seamless_Integration_in_Legacy_RDBMS","abstract":"In the past decade, there has been an increasing need for semantic-aware data search and indexing in textual (structured and NoSQL) databases, as full-text search systems became available to non-experts where users have no knowledge about the data being searched and often formulate query keywords which are different from those used by the authors in indexing relevant documents, thus producing noisy and sometimes irrelevant results. In this paper, we address the problem of semantic-aware querying and provide a general framework for modeling and processing semantic-based keyword queries in textual databases, i.e., considering the lexical and semantic similarities/disparities when matching user query and data index terms. To do so, we design and construct a semantic-aware inverted index structure called SemIndex, extending the standard inverted index by constructing a tightly coupled inverted index graph that combines two main resources: a semantic network and a standard inverted index on a collection of textual data. We then provide a general keyword query model with specially tailored query processing algorithms built on top of SemIndex, in order to produce semantic-aware results, allowing the user to choose the results’ semantic coverage and expressiveness based on her needs. To investigate the practicality and effectiveness of SemIndex, we discuss its physical design within a standard commercial RDBMS allowing to create, store, and query its graph structure, thus enabling the system to easily scale up and handle large volumes of data. We have conducted a battery of experiments to test the performance of SemIndex, evaluating its construction time, storage size, query processing time, and result quality, in comparison with legacy inverted index. Results highlight both the effectiveness and scalability of our approach.","authors":["Joe Tekli","Richard Chbeir","Agma Traina","Caetano Traina Jr"],"meta":["July 2018Data & Knowledge Engineering 117","DOI:10.1016/j.datak.2018.07.007"],"references":["320245965_Scalable_top-k_keyword_search_in_relational_databases","315123810_A_query_refinement_framework_for_xml_keyword_search","293012566_An_Overview_on_XML_Semantic_Disambiguation_from_Unstructured_Text_to_Semi-Structured_Data_Background_Applications_and_Ongoing_Challenges","279258546_SVG-to-RDF_Image_Semantization","275013939_OntoLearn_Reloaded_A_Graph-Based_Algorithm_for_Taxonomy_Induction","271155628_Ontology_based_Semantic_Indexing_Approach_for_Information_Retrieval_System","341193157_Searching_the_web_The_public_and_their_queries","298331297_Building_Semantic_Trees_from_XML_Documents","282563512_Combining_User_and_Database_Perspective_for_Solving_Keyword_Queries_over_Relational_Databases","271629988_Taxonomy-based_relaxation_of_query_answering_in_relational_databases"]}