{"id":"326609321_ISR_is_Still_a_Digital_Ontology","abstract":"I will analyse Floridi’s rejection of digital ontologies and his positive proposal for an informational structural realism (ISR). I intend to show that ISR is still fundamentally a digital ontology, albeit with some different metaphysical commitments to those that Floridi rejects. I will argue that even though Floridi deploys the method of levels of abstraction adapted from computer science, and has established a Kantian transcendentalist conception of both information and structure, ISR still reduces to a discretised binary, and therefore digital, ontology. The digital ontologies that Floridi rejects are John Wheeler’s “It from Bit” conception and computational (including pancomputational) metaphysics (although there are others). They’re rejected predominantly on the basis that they rely upon a false dichotomy between digital discrete and continuous metaphysics (with which I agree). ISR involves a Kantian transcendentalist conception of de re relations that is intended to avoid this false dichotomy. However, I’ll argue that the binary, discrete, digital component of digital ontology is retained in ISR, and therefore ISR is still a digital ontology since its conception of information reduces to binary discrete de re relations. As such, ISR comes down on one side of the rejected ontic dichotomy of digital metaphysics, and so an informational metaphysics that is not a digital ontology is still a promissory note in the philosophy of information.","authors":["Bruce Long"],"meta":["June 2020Erkenntnis 85(1)","DOI:10.1007/s10670-018-0041-5","Project: Development of an Informational (or Information-Theoretic) Scientific Metaphysics"],"references":["311861937_Computing_Nature","296687538_Introduction_The_Philosophy_of_Information","293800050_What_is_Information","344703619_The_Structure_of_the_World_Metaphysics_and_Representation","317139321_A_philosopher's_guide_to_the_foundations_of_quantum_field_theory","315182436_Bit_from_It","312003797_Quantum_Information_Theory","311811016_The_Meaning_of_Relativity","303420530_A_computable_universe_Understanding_and_exploring_nature_as_computation","303418850_The_universe_as_quantum_computer","284806731_The_World_in_the_Data","275017642_The_Universe_as_a_Cyclic_Organized_Information_System_John_Wheeler's_World_Revisited","274741397_The_Universe_as_a_Cyclic_Organized_Information_System_John_Wheeler's_World_Revisited","285942556_Every_Thing_Must_Go_Metaphysics_Naturalized","281797053_A_Computable_Universe_Understanding_and_Exploring_Nature_as_Computation"]}