{"id":"326683652_Performance_Comparison_of_Artificial_Intelligence_Techniques_for_Non-intrusive_Electrical_Load_Monitoring","abstract":"The increased awareness in reducing energy consumption and encouraging response from the use of smart meters have triggered the idea of non-intrusive load monitoring (NILM). The purpose of NILM is to obtain useful information about the usage of electrical appliances usually measured at the main entrance of electricity to obtain aggregate power signal by using a smart meter. The load operating states based on the on/off loads can be detected by analysing the aggregate power signals. This paper presents a comparative study for evaluating the performance of artificial intelligence techniques in classifying the type and operating states of three load types that are usually available in commercial buildings, such as fluorescent light, air-conditioner and personal computer. In this NILM study, experiments were carried out to collect information of the load usage pattern by using a commercial smart meter. From the power parameters captured by the smart meter, effective signal analysis has been done using the time time (TT)-transform to achieve accurate load disaggregation. Load feature selection is also considered by using three power parameters which are real power, reactive power and the TT-transform parameters. These three parameters are used as inputs for training the artificial intelligence techniques in classifying the type and operating states of the loads. The load classification results showed that the proposed extreme learning machine (ELM) technique has successfully achieved high accuracy and fast learning compared with artificial neural network and support vector machine. Based on validation results, ELM achieved the highest load classification with 100% accuracy for data sampled at 1 minute time interval. © 2018 Institute of Advanced Engineering and Science. All rights reserved.","authors":["Kamran Khalid","Azah Mohamed","Ramizi Mohamed","Hussain Shareef"],"meta":["June 2018Bulletin of Electrical Engineering and Informatics 7(2):143-152","DOI:10.11591/eei.v7i2.1190"],"references":["286421151_Random_forest_based_adaptive_non-intrusive_load_identification","277009814_Unsupervised_Algorithms_for_Non-Intrusive_Load_Monitoring_an_Up-to-Date_Overview","270573810_Load_Decomposition_at_Smart_Meters_Level_Using_Eigenloads_Approach","264273594_Extreme_learning_machines","261309488_Support_vector_machine_based_methods_for_non-intrusive_identification_of_miscellaneous_electric_loads","258387116_Power_Load_Event_Detection_and_Classification_Based_on_Edge_Symbol_Analysis_and_Support_Vector_Machine","228587177_The_S-transform_with_windows_of_arbitrary_and_varying_shape","220325302_On_the_TT-Transform_and_Its_Diagonal_Elements","342232632_Extreme_Learning_Machine_Theory_and_Applications","308839674_Autonomous_load_disaggregation_approach_based_on_active_power_measurements"]}