{"id":"326604641_Rising_English_Vocabulary_Mastery_Crosswords_Puzzle_Games_for_Computer_Science_Students","abstract":"English is a Foreign Language as a subject that has been studying since elementary. However, most of the students; English is a difficult course to learn. Thus, it needs improvement both from the media system used and the appropriate strategy for the English course as a general basic course in particular in the Faculty of Computer Science into a fun learning. A way to make English fun and easy to learn is the use of the strategy of a game called Crossword Puzzle Games. The purpose of the research is to find out whether the use of Crossword Puzzle strategy can improve the value of English courses, whether by using the Crossword Puzzle Learning Strategy can improve students' Vocabulary and find out whether using the learning strategy of Crosswords Puzzle can increase students' interest in Computer science faculty in learning English. The method used in this research is descriptive qualitative, which the result of this research is the elucidation of data obtained from quantitative and qualitative. The results of this study obtained through the collecting and analyzing of quantitative and qualitative data. Quantitative data obtained through the oral test at Mid Semester Test and qualitative data acquisition of questionnaires, observation, and interviews with several students. The result obtained from the research is the use of strategy Crossword Puzzle can increase the value of English courses in the first-semester students' faculty of Computer Science, by using Crossword Puzzle learning strategy can improve Vocabulary first-semester students' faculty of the Computer Science, and by using Crosswords Puzzle learning strategy can increase student interest of the first-semester students' faculty of Computer Science in learning English.","authors":["Indah Muzdalifah"],"meta":["July 2018IOP Conference Series Earth and Environmental Science 175(1):012075","DOI:10.1088/1755-1315/175/1/012075"],"references":["277873420_The_advantages_and_disadvantages_of_using_games_in_teaching_vocabulary_to_the_third_graders_of_top_school_elementary_school","254352669_Purpose_in_Teaching_Foreign_Language","239796090_Non-traditional_interventions_to_stimulate_discussion_The_use_of_games_and_puzzles","237365505_Reviewing_for_Exams_Do_Crossword_Puzzles_Help_in_the_Success_of_Student_Learning"]}