{"id":"326677708_Automated_analysis_of_feature_models_Quo_vadis","abstract":"Feature models have been used since the 90's to describe software product lines as a way of reusing common parts in a family of software systems. In 2010, a systematic literature review was published summarizing the advances and settling the basis of the area of Automated Analysis of Feature Models (AAFM). From then on, different studies have applied the AAFM in different domains. In this paper, we provide an overview of the evolution of this field since 2010 by performing a systematic mapping study considering 423 primary sources. We found six different variability facets where the AAFM is being applied that define the tendencies: product configuration and derivation; testing and evolution; reverse engineering; multi-model variability-analysis; variability modelling and variability-intensive systems. We also confirmed that there is a lack of industrial evidence in most of the cases. Finally, we present where and when the papers have been published and who are the authors and institutions that are contributing to the field. We observed that the maturity is proven by the increment in the number of journals published along the years as well as the diversity of conferences and workshops where papers are published. We also suggest some synergies with other areas such as cloud or mobile computing among others that can motivate further research in the future.","authors":["José A. Galindo","David Benavides","Pablo Trinidad","Antonio Manuel Gutierrez"],"meta":["May 2019Computing 101(6)","DOI:10.1007/s00607-018-0646-1","Project: BELI: Technologies for Hybrid, Highly-Configurable and SLA-Aware Cloud Services"],"references":["322746540_Modeling_Variability_in_the_Video_Domain_Language_and_Experience_Report","320847656_Reducing_Impact_of_Negative_Complexity_on_Sustainability_of_Mass_Customization","320072170_Towards_Taming_Variability_Models_in_the_Wild","319441942_Search-based_product_line_fault_detection_allocating_test_cases_iteratively","336573400_Systematic_Mapping_Studies_in_Software_Engineering","327783856_Variability_extraction_and_modeling_for_product_variants","322028897_Multi-Objective_Optimization_Algorithm_for_Feature_Selection_in_Software_Product_Lines","320772064_Product_Configuration_based_on_Feature_Model","320771890_Feature_Selection_Optimization_Based_on_Atomic_Set_and_Genetic_Algorithm_in_Software_Product_Line","320495889_Supporting_the_Development_of_Interdisciplinary_Product_Lines_in_the_Manufacturing_Domain"]}