{"id":"326680025_CuDi3D_Cu_rvilinear_Di_splacement_based_approach_for_online_3D_action_detection","abstract":"Being able to interactively detect and recognize 3D actions based on skeleton data, in unsegmented streams, has become an important computer vision topic. It raises three scientific problems in relation with variability. The first one is the temporal variability that occurs when subjects perform gestures with different speeds. The second one is the inter-class spatial variability, which refers to disparities between the displacement amounts induced by different classes (i.e. long vs. short movements). The last one is the intra-class spatial variability caused by differences in style and gesture amplitude. In this paper, we design an original approach that better considers these three issues. To address temporal variability we introduce the notion of curvilinear segmentation. It consists in extracting features, not on temporally-based sliding windows, but on trajectory segments for which the cumulated displacement equals a class-based amount. Second, to tackle inter-class spatial variability, we define several competing classifiers with their dedicated curvilinear windows. Last, we address intra-class spatial variability by designing a fusion system that takes the decisions and confidence scores of every competing classifier into account. Extensive experiments on four challenging skeleton-based datasets demonstrate the relevance of the proposed approach for action recognition and online action detection.","authors":["Said Yacine Boulahia","Eric Anquetil","Franck Multon","Richard Kulpa"],"meta":["July 2018Computer Vision and Image Understanding 174","DOI:10.1016/j.cviu.2018.07.003"],"references":["318036562_3D_Multistroke_Mapping_3DMM_Transfer_of_Hand-Drawn_Pattern_Representation_for_Skeleton-Based_Gesture_Recognition","316443196_HIF3D_Handwriting-Inspired_Features_for_3D_skeleton-based_action_recognition","311546049_Online_human_moves_recognition_through_discriminative_key_poses_and_speed-aware_action_graphs","308193884_Online_Human_Action_Detection_Using_Joint_Classification-Regression_Recurrent_Neural_Networks","305724903_Motion_Segment_Decomposition_of_RGB-D_Sequences_for_Human_Behavior_Understanding","318202740_Linear_Latent_Low_Dimensional_Space_for_Online_Early_Action_Recognition_and_Prediction","316945668_Real-Time_Online_Action_Detection_Forests_Using_Spatio-Temporal_Contexts","308188110_Online_Action_Detection","307881957_LIBSVM_A_library_for_support_vector_machines","305867060_Hierarchical_recurrent_neural_network_for_skeleton_based_action_recognition"]}