{"id":"326670737_40_years_of_cognitive_architectures_core_cognitive_abilities_and_practical_applications","abstract":"In this paper we present a broad overview of the last 40 years of research on cognitive architectures. To date, the number of existing architectures has reached several hundred, but most of the existing surveys do not reflect this growth and instead focus on a handful of well-established architectures. In this survey we aim to provide a more inclusive and high-level overview of the research on cognitive architectures. Our final set of 84 architectures includes 49 that are still actively developed, and borrow from a diverse set of disciplines, spanning areas from psychoanalysis to neuroscience. To keep the length of this paper within reasonable limits we discuss only the core cognitive abilities, such as perception, attention mechanisms, action selection, memory, learning, reasoning and metareasoning. In order to assess the breadth of practical applications of cognitive architectures we present information on over 900 practical projects implemented using the cognitive architectures in our list. We use various visualization techniques to highlight the overall trends in the development of the field. In addition to summarizing the current state-of-the-art in the cognitive architecture research, this survey describes a variety of methods and ideas that have been tried and their relative success in modeling human cognitive abilities, as well as which aspects of cognitive behavior need more research with respect to their mechanistic counterparts and thus can further inform how cognitive science might progress.","authors":["Yulia Kotseruba","John K Tsotsos"],"meta":["January 2020Artificial Intelligence Review 53(1)","DOI:10.1007/s10462-018-9646-y"],"references":["329318860_Attention-situation_awareness_A-SA_model_of_pilot_error","326156990_Comparative_study_of_cognitive_architectures","345902714_Anatomy_of_the_Mind_Exploring_Psychological_Mechanisms_and_Processes_with_the_Clarion_Cognitive_Architecture","334342540_Combining_Low-Level_Perception_with_Expectations_in_CHREST","334267347_Top-Down_versus_Bottom-Up_Learning_in_Skill_Acquisition","334264232_What_Does_it_Take_to_Pass_the_False_Belief_Task_An_ACT-R_Model","334264047_Metacat_A_Self-Watching_Cognitive_Architecture_for_Analogy-Making","329648508_The_Soar_Cognitive_Architecture","327118871_Cognitive_computational_neuroscience","325953894_Human_memory_A_proposed_system_and_its_control_processes"]}