{"id":"326681471_Interpreting_Recurrent_Neural_Networks_Behaviour_via_Excitable_Network_Attractors","abstract":"Introduction: Machine learning provides fundamental tools both for scientific research and for the development of technologies with significant impact on society. It provides methods that facilitate the discovery of regularities in data and that give predictions without explicit knowledge of the rules governing a system. However, a price is paid for exploiting such flexibility: machine learning methods are typically black-boxes where it is difficult to fully understand what the machine is doing or how it is operating. This poses constraints on the applicability and explainability of such methods. Methods: Our research aims to open the black-box of recurrent neural networks, an important family of neural networks used for processing sequential data. We propose a novel methodology that provides a mechanistic interpretation of behaviour when solving a computational task. Our methodology uses mathematical constructs called excitable network attractors, which are invariant sets in phase space composed of stable attractors and excitable connections between them. Results and Discussion: As the behaviour of recurrent neural networks depends both on training and on inputs to the system, we introduce an algorithm to extract network attractors directly from the trajectory of a neural network while solving tasks. Simulations conducted on a controlled benchmark task confirm the relevance of these attractors for interpreting the behaviour of recurrent neural networks, at least for tasks that involve learning a finite number of stable states and transitions between them.","authors":["Andrea Ceni","Peter Ashwin","Lorenzo Livi"],"meta":["March 2020Cognitive Computation 12(2)","DOI:10.1007/s12559-019-09634-2","Project: Machine Learning and Dynamical Systems"],"references":["328680697_FixedPointFinder_A_Tensorflow_toolbox_for_identifying_and_characterizing_fixed_points_in_recurrent_neural_networks","320296812_full-FORCE_A_Target-Based_Method_for_Training_Recurrent_Networks","319770720_Computational_aspects_of_feedback_in_neural_circuits","316738708_Echo_State_Property_of_Deep_Reservoir_Computing_Networks","325197352_From_coupled_networks_of_systems_to_networks_of_states_in_phase_space","324237032_Sensitive_Finite-State_Computations_Using_a_Distributed_Network_With_a_Noisy_Network_Attractor","321324791_Linking_connectivity_dynamics_and_computations_in_recurrent_neural_networks","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319280824_Using_Directional_Fibers_to_Locate_Fixed_Points_of_Recurrent_Neural_Networks","317930333_Methods_for_Interpreting_and_Understanding_Deep_Neural_Networks"]}