{"id":"326604080_A_Corpus-based_Analysis_of_the_Terminology_of_the_Social_Sciences_and_Humanities","abstract":"This paper was concerned with terminology of the social sciences and humanities in Indonesian scientific papers. Using electronic corpora built from the collection of texts on legal science and administrative science in Universitas Indonesia, the aims of the study was to illustrate how to integrate corpus linguistic method with the communicative theory of terminology (CTT) to examine terminology. Three procedures of corpus analysis were applied to assist in identifying two of the areas that terminological units must fulfil, i.e. the linguistic component and the cognitive component. The keyword and word clusters analysis were used to extract multi-word terms while the collocation analysis was used to derive the most significant sense categories of terms. Using corpus software, vis. WordSmith Tools, the corpus analysis presents some of the results showing that the linguistic component of terminological units can be traced through the technique of keyword and word clusters. In Addition, the cognitive component of terminological units was possible to investigate through the concept of semantic preference, one of the key concepts in corpus linguistics built from the analysis of collocation. Therefore, it can be concluded that a corpus-based approach to study terminology is considered to offer several benefits, especially to the activity concerned with the compilation, description, processing and presenting terms in a more reliable and efficient way. It may also provide an alternative method for creating glossary and for translators to resolve terminological problems.","authors":["Susi Yuliawati","Totok Suhardijanto","Rahayu Surtiati Hidayat"],"meta":["July 2018IOP Conference Series Earth and Environmental Science 175(1):012109","DOI:10.1088/1755-1315/175/1/012109"],"references":["346673127_A_Practical_Course_in_Terminology_Processing","346643636_Corpora_in_Applied_Linguistics","344497616_The_Dynamics_of_Terminology_A_descriptive_theory_of_term_formation_and_terminological_growth","344480778_Terminology_Theory_methods_and_applications","285212980_The_Oxford_Handbook_of_Translation_Studies","276222082_Terms_in_Context_a_Corpus-Based_Analysis_of_the_Terminology_of_the_European_Union's_Development_Cooperation_Policy_with_the_African_Caribbean_and_Pacific_Group_of_States","242464564_A_Practical_Course_in_Terminology_Processing","233586525_Theories_of_terminology_Their_description_prescription_and_explanation","222167625_PC_analysis_of_key_words_-_And_key_key_words","2530760_The_Longman_Grammar_of_Spoken_and_Written_English"]}