{"id":"326604435_Systems_protobiology_Origin_of_life_in_lipid_catalytic_networks","abstract":"Life is that which replicates and evolves, but there is no consensus on how life emerged. We advocate a systems protobiology view, whereby the first replicators were assemblies of spontaneously accreting, heterogeneous and mostly non-canonical amphiphiles. This view is substantiated by rigorous chemical kinetics simulations of the graded autocatalysis replication domain (GARD) model, based on the notion that the replication or reproduction of compositional information predated that of sequence information. GARD reveals the emergence of privileged non-equilibrium assemblies (composomes), which portray catalysis-based homeostatic (concentration-preserving) growth. Such a process, along with occasional assembly fission, embodies cell-like reproduction. GARD pre-RNA evolution is evidenced in the selection of different composomes within a sparse fitness landscape, in response to environmental chemical changes. These observations refute claims that GARD assemblies (or other mutually catalytic networks in the metabolism first scenario) cannot evolve. Composomes represent both a genotype and a selectable phenotype, anteceding present-day biology in which the two are mostly separated. Detailed GARD analyses show attractor-like transitions from random assemblies to self-organized composomes, with negative entropy change, thus establishing composomes as dissipative systems-hallmarks of life. We show a preliminary new version of our model, metabolic GARD (M-GARD), in which lipid covalent modifications are orchestrated by non-enzymatic lipid catalysts, themselves compositionally reproduced. M-GARD fills the gap of the lack of true metabolism in basic GARD, and is rewardingly supported by a published experimental instance of a lipid-based mutually catalytic network. Anticipating near-future far-reaching progress of molecular dynamics, M-GARD is slated to quantitatively depict elaborate protocells, with orchestrated reproduction of both lipid bilayer and lumenal content. Finally, a GARD analysis in a whole-planet context offers the potential for estimating the probability of life's emergence. The invigorated GARD scrutiny presented in this review enhances the validity of autocatalytic sets as a bona fide early evolution scenario and provides essential infrastructure for a paradigm shift towards a systems protobiology view of life's origin.","authors":["Doron Lancet","Raphael Zidovetzki","Omer Markovitch"],"meta":["July 2018Journal of The Royal Society Interface 15(144):20180159","DOI:10.1098/rsif.2018.0159"],"references":["324096796_Replication_of_Simulated_Prebiotic_Amphiphilic_Vesicles_in_a_Finite_Environment_Exhibits_Complex_Behavior_That_Includes_High_Progeny_Variability_and_Competition","323205111_Predicting_species_emergence_in_simulated_complex_pre-biotic_networks","322903028_Modern_views_of_ancient_metabolic_networks","321585333_Mineral_surface_chemistry_control_for_origin_of_prebiotic_peptides","346672592_Rayleigh-Benard_Convection_Structures_and_Dynamics","346644398_What_is_Life_With_Mind_and_Matter_and_Autobiographical_Sketches","344486562_Origins_of_Life","344135982_PHYSICAL_CHEMICAL_AND_STRUCTURAL_DESCRIPTIONS_OF_ENERGETIC_PROCESSES_IN_PHOTOSYNTHETIC_BACTERIA_COMPARISONS_WITH_GREEN_PLANTS_AND_RESPIRATORY_SYSTEMS","323016382_Quantitative_-omic_data_empowers_bottom-up_systems_biology","322881514_Chemistry_of_a_Unique_Polyketide-like_Synthase"]}