{"id":"326679321_Revisao_sistematica_sobre_as_producoes_cientificas_da_Revista_Tecnologias_na_Educacao","abstract":"A Revista Tecnologias na Educação em 2018 completa 10 anos de existência, promovendo a divulgação de inúmeros artigos científicos e relatos de experiência desenvolvidos por docentes, discentes e pesquisadores destacando as tecnologias na educação. É inquestionável as contribuições da Revista para a comunidade científica, nesse sentido, este trabalho tem como objetivo apresentar uma revisão sistemática da literatura sobre as produções da Revista, buscando responder quais áreas do conhecimento estão mais presentes nessas produções, quais os objetivos e recursos didáticos digitais utilizados para o processo de ensino e aprendizagem pelos pesquisadores que publicam na Revista. Os resultados mostram que a Revista Tecnologias na Educação tem publicado mais trabalhos no campo das Ciências Exatas, em especial nas áreas da Química, Matemática e Física. Salienta-se que diversos trabalhos contemplavam a \"Formação de professores para uso das TICs\", um dos temas aceitos pela Revista. Ademais, dos 351 trabalhos publicados (269 artigos científicos e 82 relatos de experiência) a Revista apresenta 42 áreas do conhecimento distintas (por exemplo, língua portuguesa, história, ciência da computação etc.) que contribuem para o desenvolvimento de pesquisas com as tecnologias na educação. Essa profusão de áreas apresenta não somente a importância de pesquisas envolvendo características multidisciplinares, mas também o alcance que as tecnologias têm nas práticas pedagógicas em diversos campos do saber, revelando como a Revista Tecnologias na Educação vem contribuindo para a aprendizagem em rede.","authors":["Bruno Silva Leite"],"meta":["July 2018","Project: Active Technological Learning"],"references":["327449162_Aprendizagem_Tecnologica_Ativa","324642345_Systematic_review_as_a_research_method_in_postgraduate_nursing_education","322856060_Apropriacao_das_Tecnologias_da_Informacao_e_Comunicacao_no_ensino_de_ciencias_uma_revisao_sistematica_da_ultima_decada_2007-2016","307550927_Contribuicao_da_Web_20_como_ferramenta_de_aprendizagem_um_estudo_de_caso","280012559_Tecnologias_no_ensino_de_quimica_teoria_e_pratica_na_formacao_docente","228756057_Procedures_for_Performing_Systematic_Reviews","292779771_'An_introduction_to_Systematic_Reviews'","237473923_Estudos_de_revisao_sistematica_Um_guia_para_sintese_criteriosa_da_evidencia_cientifica"]}