{"id":"326742347_Uma_proposta_para_tratamento_de_respostas_ao_acaso_em_questoes_de_multipla_escolha","abstract":"Este artigo apresenta uma proposta para o tratamento das respostas ao acaso, com foco nas respostas de Questões do Tipo Múltipla Escolha também conhecido como QME, por ser uma ferramenta muito utilizada em avaliações de desempenho e adotado por Ministérios entre outros meios de avaliações sobre a educação, este estudo procura oferecer uma proposta durante exames a distância ou mesmo presencial com uma grande quantidade de participantes, este formato torna o processo de avaliação uma tarefa mais complexa, procurando medir e aprovar os participantes de concursos ou de outros tipos de avaliações de desempenho. Com a crescente utilização de sistemas de computadores a distância, como os oferecidos pelos Ministérios da Educação, a tendência é que os Governos procurem mais alternativas para atender um público ainda maior e mais carente, com o objetivo de aumentar e melhorar a educação em todo o país. Este estudo procura oferecer alternativas ao modelo tradicional de uso de QMEs, tendo uma abordagem distinta, mais simples e direta sobre o tratamento dos resultados durante as avaliações, o foco deste trabalho está voltado para a educação e os métodos de avaliações atualmente utilizados pelos governos e ministérios no Brasil.","authors":["Antonio Carlos Bento"],"meta":["August 2018","Project: Education & Intelligent Systems"],"references":["317404251_FOMENTO_AO_USO_DAS_TICs_NOS_CURSOS_DE_GRADUACAO_DA_UNIVERSIDADE_DO_ESTADO_DO_RIO_DE_JANEIRO_UMA_EXPERIENCIA_EM_DESENVOLVIMENTO","277177611_Apropriacao_do_telemovel_como_ferramenta_de_mediacao_em_mobile_learning_estudos_de_caso_em_contexto_educativo","302414272_Active_Portfolio_Management","297598685_Avaliacao_do_Conceito_de_Evolucao_nos_Livros_Didaticos","296819908_Competing_on_resources","285130157_What_form_transforms_A_constructive-developmental_approach_to_transformative_learning","271807687_Effects_of_College_Transition_and_Perceptions_of_Campus_Racial_Climate_on_Latino_College_Students'_Sense_of_Belonging","248940619_Learner-Interface_Interaction_in_Distance_Education_An_Extension_of_Contemporary_Models_and_Strategies_for_Practitioners","235272387_Facebook_and_education_A_classroom_connection","229767004_Informal_and_Incidental_Learning"]}