{"id":"326784897_Feature_clustering_and_ranking_for_selecting_stable_features_from_high_dimensional_remotely_sensed_data","abstract":"High dimensional remote sensing data sets typically contain redundancy amongst the features. Traditional approaches to feature selection are prone to instability and selection of sub-optimal features in these circumstances. They can also be computationally expensive, especially when dealing with very large remote sensing data sets. This article presents an efficient, deterministic feature ranking method that is robust to redundancy. Affinity propagation is used to group correlated features into clusters. A relevance criterion is evaluated for each feature. Clusters are then ranked based on the median of the relevance values of their constituent features. The most relevant individual features can then be selected automatically from the best clusters. Other criteria, such as computation time or measurement cost, can optionally be considered interactively when making this selection. The proposed feature selection method is compared to competing filter approach methods on a number of remote sensing data sets containing feature redundancy. Mutual information and naive Bayes relevance criteria were evaluated in conjunction with the feature selection methods. Using the proposed method it was shown that the stability of selected features improved under different data samplings, while similar or better classification accuracies were achieved compared to competing methods.","authors":["Dugal Harris","Adriaan Van Niekerk"],"meta":["August 2018International Journal of Remote Sensing 39(25):1-16","DOI:10.1080/01431161.2018.1500730"],"references":["312052465_Supervised_Multiview_Feature_Selection_Exploring_Homogeneity_and_Heterogeneity_With_l12-Norm_and_Automatic_View_Generation","301599728_Feature_Selection_Based_on_Structured_Sparsity_A_Comprehensive_Study","289671819_Cross_Correlation_Based_Clustering_for_Feature_Selection_in_Hyperspectral_Imagery","308083984_Big_Data_for_Remote_Sensing_Challenges_and_Opportunities","307065704_Statistical_Pattern_Recognition_Second_Edition","303697659_A_fast_algorithm_for_finding_the_non-dominated_set_in_multi-objective_optimization","292487691_Universal_feature_selection_using_feature_similarity","286535250_Statistical_pattern_recognition","284280060_Can_High-Order_Dependencies_Improve_Mutual_Information_based_Feature_Selection","274202844_Neural_Networks_for_Pattern_Recognition"]}