{"id":"326767372_Glanceable_Visualization_Studies_of_Data_Comparison_Performance_on_Smartwatches","abstract":"We present the results of two perception studies to assess how quickly people can perform a simple data comparison task for small-scale visualizations on a smartwatch. The main goal of these studies is to extend our understanding of design constraints for smartwatch visualizations. Previous work has shown that a vast majority of smartwatch interactions last under 5 s. It is still unknown what people can actually perceive from visualizations during such short glances, in particular with such a limited display space of smartwatches. To shed light on this question, we conducted two perception studies that assessed the lower bounds of task time for a simple data comparison task. We tested three chart types common on smartwatches: bar charts, donut charts, and radial bar charts with three different data sizes: 7, 12, and 24 data values. In our first study, we controlled the differences of the two target bars to be compared, while the second study varied the difference randomly. For both studies, we found that participants performed the task on average in <300 ms for the bar chart, <220 ms for the donut chart, and in <1780 ms for the radial bar chart. Thresholds in the second study per chart type were on average 1.14-1.35× higher than in the first study. Our results show that bar and donut charts should be preferred on smartwatch displays when quick data comparisons are necessary.","authors":["Tanja Blascheck","Lonni Besançon","Anastasia Bezerianos","Bongshin Lee"],"meta":["July 2018IEEE Transactions on Visualization and Computer Graphics PP(99)","DOI:10.1109/TVCG.2018.2865142"],"references":["324660271_When_David_Meets_Goliath_Combining_Smartwatches_with_a_Large_Vertical_Display_for_Visual_Data_Exploration","314027983_Word-Sized_Graphics_for_Scientific_Texts","311824284_Quantifying_Sources_and_Types_of_Smartwatch_Usage_Sessions","305386412_Exploring_the_Design_Space_of_Glanceable_Feedback_for_Physical_Activity_Trackers","324393428_The_Visual_Display_of_Quantitative_Information","311431261_An_Exploration_of_Word-Scale_Visualizations_for_Text_Documents","309417345_An_Exploratory_Study_of_Word-Scale_Graphics_in_Data-Rich_Text_Documents","304811503_Arcs_Angles_or_Areas_Individual_Data_Encodings_in_Pie_and_Donut_Charts","302565822_Glyph_Design_for_Temporal_and_Multi-Dimensional_Data_Design_Considerations_and_Evaluation","301936017_Smartwatch_in_vivo"]}