{"id":"326730809_HSRA_Hadoop-based_spliced_read_aligner_for_RNA_sequencing_data","abstract":"Nowadays, the analysis of transcriptome sequencing (RNA-seq) data has become the standard method for quantifying the levels of gene expression. In RNA-seq experiments, the mapping of short reads to a reference genome or transcriptome is considered a crucial step that remains as one of the most time-consuming. With the steady development of Next Generation Sequencing (NGS) technologies, unprecedented amounts of genomic data introduce significant challenges in terms of storage, processing and downstream analysis. As cost and throughput continue to improve, there is a growing need for new software solutions that minimize the impact of increasing data volume on RNA read alignment. In this work we introduce HSRA, a Big Data tool that takes advantage of the MapReduce programming model to extend the multithreading capabilities of a state-of-the-art spliced read aligner for RNA-seq data (HISAT2) to distributed memory systems such as multi-core clusters or cloud platforms. HSRA has been built upon the Hadoop MapReduce framework and supports both single- and paired-end reads from FASTQ/FASTA datasets, providing output alignments in SAM format. The design of HSRA has been carefully optimized to avoid the main limitations and major causes of inefficiency found in previous Big Data mapping tools, which cannot fully exploit the raw performance of the underlying aligner. On a 16-node multi-core cluster, HSRA is on average 2.3 times faster than previous Hadoop-based tools. Source code in Java as well as a user’s guide are publicly available for download at http://hsra.dec.udc.es.","authors":["Roberto R. Expósito","Jorge González-Domínguez","Juan Touriño"],"meta":["July 2018PLoS ONE 13(7):e0201483","DOI:10.1371/journal.pone.0201483"],"references":["320581690_A_Review_of_Scalable_Bioinformatics_Pipelines","315875989_Halvade-RNA_Parallel_variant_calling_from_transcriptomic_data_using_MapReduce","316728045_MarDRe_efficient_MapReduce-based_removal_of_duplicate_DNA_reads_in_the_cloud","315995364_Speeding_Up_Large-Scale_Next_Generation_Sequencing_Data_Analysis_with_pBWA","314271914_Salmon_provides_fast_and_bias-aware_quantification_of_transcript_expression","313339704_Next-generation_sequencing_Big_data_meets_high_performance_computing","312926325_parSRA_A_Framework_for_the_Parallel_Execution_of_Short_Read_Aligners_on_Compute_Clusters","312917980_The_Google_file_system","312571743_Accelerating_large-scale_genomic_analysis_with_Spark","312482561_FASTdoop_A_versatile_and_efficient_library_for_the_input_of_FASTA_and_FASTQ_files_for_MapReduce_Hadoop_bioinformatics_applications"]}