{"id":"326785457_Open_Source_in_Urban_Planning_and_Architecture_Experiences_and_Guidelines_from_Traditional_Cultures_Participatory_Processes_and_Computer_Science","abstract":"Open Source (OS) philosophy can cause important effects both in the design processes and in the professional role of designers. It started as a computer science phenomenon and\nhas rapidly spread to other fields, such as architecture and urban planning. However, there are few studies reflecting about its impact, and there are not guidelines for managing its possible consequences. This article offers some insights considering three main sources: (1) current OS experiences in architecture and urban planning, (2) past traditional and participatory design strategies, and (3) works in computer science about OS. These three topics are conceptually linked using as an index some OS attributes expressed in the OS\ninitiative definition. With that background, guidelines are finally proposed. The article demonstrates that current OS initiatives in architecture and urbanism have many similarities\nwith past design processes and recent computer science experiences. Both subjects can be used as precedents in order to adequately incorporate and adapt OS thinking, a revolution that, depending on the managing skills, could improve the quality of the design and the designer's profession, or provoke a crisis in the current professional model.","authors":["Santiago Manuel Pardo García"],"meta":["July 2018International Journal of Architectural Research Archnet-IJAR 12(2):24-39","DOI:10.26687/archnet-ijar.v12i2.1514"],"references":["303127163_ICT-enabled_bottom-up_architectural_design","287506983_From_Aristotle_to_Ringelmann_a_large-scale_analysis_of_team_productivity_and_coordination_in_Open_Source_Software_projects","324905293_The_City_Shaped_The_Grid","292633404_Thinking_through_Landscape","287854637_Life_in_design_Christopher_Alexander_and_the_nature_of_order","283525883_Integrated_Open_Source_Design_for_Architecture_in_High-Density_Housing_Practice","281050442_Exploring_Collective_Architectural_Conception_Cooperation_Coordination_and_Collaboration_via_Basic_Online_Tools","275702532_Architecture_Without_Architects_A_Short_Introduction_to_Non-Pedigreed_Architecture","273099707_Crowdsourcing_urban_form_and_function","270385877_Notes_on_the_Synthesis_of_Form"]}