{"id":"326742214_Uma_proposta_para_tratamento_de_resultados_em_avaliacoes_de_desempenho_utilizando_raciocinio_estatistico_e_logica_difusa","abstract":"Este artigo apresenta uma proposta para o tratamento de resultados em avaliações de desempenho, por meio da utilização da lógica difusa e do raciocínio estatístico, tendo como base trabalhos apresentados por diferentes autores na área de educação e tecnologia. Sendo parte de um projeto denominado “Proposta para Tratamento de Resultados em Avaliações de Desempenho Utilizando o Raciocínio Estatístico e a Lógica Difusa”. Com os estudos realizados sobre trabalhos que apresentam a utilização da Lógica Difusa em tratamentos de resultados em avaliações de desempenho de estudantes, os quais foram apresentados sistemas desenvolvidos para a educação a distância, aproveitando as mesmas técnicas para o tratamento das respostas durante testes e avaliações, os quais utilizam questões do tipo múltipla escolha ou QME. Esta proposta apresenta uma parte do projeto, o qual utiliza em conjunto o raciocínio estatístico e o pensamento estatístico, também é apresentado na proposta original em forma de um sistema protótipo desenvolvido para demonstrar o funcionamento das regras e para confirmar os resultados, utilizado também como parte de um laboratório.\nComo apresentado por alguns autores neste trabalho, questões do tipo múltipla escolha são um desafio na sua construção para se conseguir aferir o real conhecimento do estudante durante a realização de exames que utilizam este modelo.","authors":["Antonio Carlos Bento"],"meta":["August 2018","Project: Education & Intelligent Systems"],"references":["280879167_O_Uso_de_Tecnicas_Fuzzy_em_Ambientes_Inteligentes_de_Aprendizagem","251312915_Situando_as_diferencas_implicadas_na_educacao_de_surdos_inclusaoexclusao","237599212_Analise_de_Metodologias_e_Ambientes_de_Ensino_para_Algoritmos_Estruturas_de_Dados_e_Programacao_aos_iniciantes_em_Computacao_e_Informatica","228834860_Estudo_sobre_a_Evasao_em_um_Curso_de_Licenciatura_em_Informatica_e_Consideracoes_para_Melhorias","333285084_Avaliacao_da_aprendizagem_por_meio_de_logica_de_fuzzy_validado_por_uma_Arvore_de_Decisao_ID3","277223657_Sistema_Tutor_Inteligente_baseado_na_Teoria_da_Aprendizagem_Significativa_com_acompanhamento_Fuzzy","247804736_The_Challenge_of_Developing_Statistical_Reasoning","228465660_On_the_difficulty_of_learning_to_program","30865671_Avaliacao_educacional_sistemica_na_perspectiva_dos_testes_de_desempenho_e_de_seus_resultados_estudo_do_saeb","21520772_An_Introduction_to_the_Five-Factor_Model_and_Its_Applications"]}