{"id":"326751019_Cyber-Offending_and_Traditional_Offending_over_the_Life-Course_an_Empirical_Comparison","abstract":"Purpose\nThis paper argues that cyber-dependent offending differs in important ways from other types of offending, which poses challenges to established life-course criminological explanations. Moreover, this study examines to what extent life circumstances in both private and professional life are differentially related to cyber-offending and traditional offending.\n\nMethods\nThis study analyzes longitudinal registration data of all adults who have been at least once suspected of a cybercrime (N = 870) and/or a traditional crime (N = 1,144,740) in the Netherlands during the period of 2000–2012. Using fixed effects panel models, within-person effects of household composition, employment, and enrollment in education on the likelihood of cyber-offending are compared with those for traditional offending.\n\nResults\nSimilar results are found with respect to individual’s private lives. An individual is less likely to commit cybercrime as well as traditional crime in years in which that individual shares a household with a partner, whether with or without children, than in other years. For the professional life, several important differences are found. Employment and enrollment in education are not statistically significantly related to cyber-offending, whereas they reduce the likelihood of traditional offending. In fact, for these professional life circumstances, opposite effects are found in this population.\n\nConclusions\nThis first study to empirically compare cyber-offending and traditional offending over the life-course finds important similarities and differences. The results hint at the importance of possible cybercriminal opportunities provided by otherwise preventive professional life circumstances.","authors":["Marleen Weulen Kranenbarg","Stijn Ruiter","Jean-Louis Van Gelder","Wim Bernasco"],"meta":["September 2018Journal of Developmental and Life-Course Criminology 4(2)","DOI:10.1007/s40865-018-0087-8"],"references":["321716315_Space_Transition_Theory_of_Cyber_Crimes","319233629_Criminals_seeking_ICT-expertise_an_exploratory_study_of_Dutch_cases","311162953_Patterns_and_Correlates_of_Offender_Versatility_and_Specialization_Across_a_23-Year_Span_for_At-Risk_Young_Men","305039725_Investigating_the_Relationship_Between_the_Diversity_Index_and_Frequency_of_Offending","288254393_Fixed-effects_panel_regression","286437183_How_Work_Affects_Crime-And_Crime_Affects_Work-Over_The_Life_Course","318657835_Verschillen_crackers_van_andere_criminelen_Een_vergelijking_op_basis_van_Nederlandse_verdachtenregistraties","302371732_Computer_Crime_and_White-Collar_Crime","292770598_Categorising_cybercrime_and_cybercriminals_The_problem_and_potential_approaches","289038901_Between_Hackers_and_White-Collar_Offenders"]}