{"id":"326773232_A_fast_and_agnostic_method_for_bacterial_genome-wide_association_studies_bridging_the_gap_between_k-mers_and_genetic_events","abstract":"Motivation\nGenome-wide association study (GWAS) methods applied to bacterial genomes have shown promising results for genetic marker discovery or fine-assessment of marker effect. Recently, alignment-free methods based on kmer composition have proven their ability to explore the accessory genome. However, they lead to redundant descriptions and results which are hard to interpret.\n\nMethods\nHere, we introduce DBGWAS, an extended kmer-based GWAS method producing interpretable genetic variants associated with pheno-types. Relying on compacted De Bruijn graphs (cDBG), our method gathers cDBG nodes identified by the association model into subgraphs defined from their neighbourhood in the initial cDBG. DBGWAS is fast, alignment-free and only requires a set of contigs and phenotypes. It produces annotated subgraphs representing local polymorphisms as well as mobile genetic elements (MGE) and offers a graphical framework to interpret GWAS results.\n\nResults\nWe validated our method using antibiotic resistance phenotypes for three bacterial species. DBGWAS recovered known resistance determinants such as mutations in core genes in Mycobacterium tuberculosis and genes acquired by horizontal transfer in Staphylococcus aureus and Pseudomonas aeruginosa – along with their MGE context. It also enabled us to formulate new hypotheses involving genetic variants not yet described in the antibiotic resistance literature.\n\nConclusion\nOur novel method proved its efficiency to retrieve any type of phenotype-associated genetic variant without prior knowledge. All experiments were computed in less than two hours and produced a compact set of meaningful subgraphs, thereby outperforming other GWAS approaches and facilitating the interpretation of the results.\n\nAvailability\nOpen-source tool available at https://gitlab.com/leoisl/dbgwas","authors":["Magali Jaillard","Leandro Ishi Soares de Lima","Maud Tournourd","Pierre Mahé"],"meta":["April 2018","DOI:10.1101/297754"],"references":["345738242_Association_Mapping_from_Sequencing_Reads_Using_K_-mers","321488944_Representing_Genetic_Determinants_in_Bacterial_GWAS_with_Compacted_De_Bruijn_Graphs","319649998_Structural_and_functional_insights_into_the_periplasmic_detector_domain_of_the_GacS_histidine_kinase_controlling_biofilm_formation_in_Pseudomonas_aeruginosa","317244498_Correlation_between_phenotypic_antibiotic_susceptibility_and_the_resistome_in_Pseudomonas_aeruginosa","315733412_Genome_graphs_and_the_evolution_of_genome_inference","313956694_ABySS_20_Resource-efficient_assembly_of_large_genomes_using_a_Bloom_filter","312509983_Microbial_genomics_and_antimicrobial_susceptibility_testing","316031033_De_novo_assembly_of_viral_quasispecies_using_overlap_graphs","315777017_Antimicrobial_resistance_in_Mycobacterium_tuberculosis_Mechanistic_and_evolutionary_perspectives","313642978_Fast_and_scalable_minimal_perfect_hashing_for_massive_key_sets"]}