{"id":"326751518_Use_of_Artificial_Intelligence_in_Healthcare_Delivery","abstract":"In recent years, there has been an amplified focus on the use of artificial intelligence (AI) in various domains to resolve complex issues. Likewise, the adoption of artificial\nintelligence (AI) in healthcare is growing while radically changing the face of healthcare delivery. AI is being employed in a myriad of settings including hospitals, clinical laboratories, and research facilities. AI approaches employing machines to sense and\ncomprehend data like humans has opened up previously unavailable or unrecognised opportunities for clinical practitioners and health service organisations. Some examples include utilising AI approaches to analyse unstructured data such as photos, videos, physician\nnotes to enable clinical decision making; use of intelligence interfaces to enhance patient engagement and compliance with treatment; and predictive modelling to manage patient flow and hospital capacity/resource allocation. Yet, there is an incomplete understanding of AI and even confusion as to what it is? Also, it is not completely clear what the implications are in using AI generally and in particular for clinicians? This chapter aims to cover these topics and also introduce the reader to the concept of AI, the theories behind AI programming and the various applications of AI in the medical domain.","authors":["Sandeep Reddy"],"meta":["August 2018","DOI:10.5772/intechopen.74714","In book: eHealth - Making Health Care Smarter"],"references":["318255127_Artificial_intelligence_for_analyzing_orthopedic_trauma_radiographs_Deep_learning_algorithms-are_they_on_par_with_humans_for_diagnosing_fractures","309560795_Role_of_Soft_Computing_Approaches_in_HealthCare_Domain_A_Mini_Review","345239562_Smart_Machines_IBM's_Watson_and_the_Era_of_Cognitive_Computing","344619178_Smart_Machines_IBM's_Watson_and_the_Era_of_Cognitive_Computing","344478908_Artificial_Intelligence_The_Basics","335141602_Artificial_Intelligence_Foundations_of_Computational_Agents","327041198_Searching_and_Optimization_Techniques_in_Artificial_Intelligence_A_Comparative_Study_Complexity_Analysis","322601043_China_enters_the_battle_for_AI_talent","321079381_ADVANCES_IN_ARTIFICIAL_INTELLIGENCE_RESEARCH_IN_HEALTH","313218385_Artificial_neural_networks_An_introduction"]}