{"id":"326726851_StrokeAggregator_Consolidating_raw_sketches_into_artist-intended_curve_drawings","abstract":"When creating line drawings, artists frequently depict intended curves using multiple, tightly clustered, or overdrawn, strokes. Given such sketches, human observers can readily envision these intended, aggregate, curves, and mentally assemble the artist's envisioned 2D imagery. Algorithmic stroke consolidation---replacement of overdrawn stroke clusters by corresponding aggregate curves---can benefit a range of sketch processing and sketch-based modeling applications which are designed to operate on consolidated, intended curves. We propose StrokeAggregator, a novel stroke consolidation method that significantly improves on the state of the art, and produces aggregate curve drawings validated to be consistent with viewer expectations. Our framework clusters strokes into groups that jointly define intended aggregate curves by leveraging principles derived from human perception research and observation of artistic practices. We employ these principles within a coarse-to-fine clustering method that starts with an initial clustering based on pairwise stroke compatibility analysis, and then refines it by analyzing interactions both within and in-between clusters of strokes. We facilitate this analysis by computing a common 1D parameterization for groups of strokes via common aggregate curve fitting. We demonstrate our method on a large range of line drawings, and validate its ability to generate consolidated drawings that are consistent with viewer perception via qualitative user evaluation, and comparisons to manually consolidated drawings and algorithmic alternatives.","authors":["Chenxi Liu","Enrique Rosales","Alla Sheffer"],"meta":["July 2018ACM Transactions on Graphics 37(4):1-15","DOI:10.1145/3197517.3201314"],"references":["313734022_SketchSoup_Exploratory_Ideation_Using_Design_Sketches","317043727_Globally_Consistent_Wrinkle-Aware_Shading_of_Line_Drawings","315666649_Mastering_Sketching_Adversarial_Augmentation_for_Structured_Prediction","309955407_Gesture3D_Posing_3D_characters_via_gesture_drawings","305218334_Learning_to_simplify_fully_convolutional_networks_for_rough_sketch_cleanup","302888107_Fidelity_vs_Simplicity_a_Global_Approach_to_Line_Drawing_Vectorization","285635492_Mesh-independent_surface_interpolation_in_Geometric_Modeling_for_Scientific_Visualization","283620619_Modeling_Character_Canvases_from_Cartoon_Drawings","283436013_Closure-aware_Sketch_Simplification","282070589_Hierarchical_Density_Estimates_for_Data_Clustering_Visualization_and_Outlier_Detection"]}