{"id":"326728355_SmartCheck_static_analysis_of_ethereum_smart_contracts","abstract":"Ethereum is a major blockchain-based platform for smart contracts - Turing complete programs that are executed in a decentralized network and usually manipulate digital units of value. Solidity is the most mature high-level smart contract language. Ethereum is a hostile execution environment, where anonymous attackers exploit bugs for immediate financial gain. Developers have a very limited ability to patch deployed contracts. Hackers steal up to tens of millions of dollars from flawed contracts, a well-known example being \"The DAO\", broken in June 2016. Advice on secure Ethereum programming practices is spread out across blogs, papers, and tutorials. Many sources are outdated due to a rapid pace of development in this field. Automated vulnerability detection tools, which help detect potentially problematic language constructs, are still underdeveloped in this area.\nWe provide a comprehensive classification of code issues in Solidity and implement SmartCheck - an extensible static analysis tool that detects them¹. SmartCheck translates Solidity source code into an XML-based intermediate representation and checks it against XPath patterns. We evaluated our tool on a big dataset of real-world contracts and compared the results with manual audit on three contracts. Our tool reflects the current state of knowledge on Solidity vulnerabilities and shows significant improvements over alternatives. SmartCheck has its limitations, as detection of some bugs requires more sophisticated techniques such as taint analysis or even manual audit. We believe though that a static analyzer should be an essential part of contract developers' toolbox, letting them fix simple bugs fast and allocate more effort to complex issues.","authors":["Sergei Tikhomirov","Ekaterina Voskresenskaya","Ivan Ivanitskiy","Ramil Takhaviev"],"meta":["May 2018","DOI:10.1145/3194113.3194115","Conference: the 1st International Workshop"],"references":["314157173_Under-Optimized_Smart_Contracts_Devour_Your_Money","267845836_A_Survey_of_Static_Program_Analysis_Techniques","220751872_TAJ_Effective_Taint_Analysis_of_Web_Applications","326948399_KEVM_A_Complete_Formal_Semantics_of_the_Ethereum_Virtual_Machine","323234138_Ethereum_State_of_Knowledge_and_Research_Perspectives","315856245_A_Survey_of_Attacks_on_Ethereum_Smart_Contracts_SoK","309448109_Formal_Verification_of_Smart_Contracts_Short_Paper","309444724_Making_Smart_Contracts_Smarter","307507489_Step_by_Step_Towards_Creating_a_Safe_Smart_Contract_Lessons_and_Insights_from_a_Cryptocurrency_Lab","261242538_Software_Vulnerability_Discovery_Techniques_A_Survey","224001120_Compilers_principles_and_techniques_and_tools"]}