{"id":"326725509_How_do_students_study_in_STEM_courses_Findings_from_a_light-touch_intervention_and_its_relevance_for_underrepresented_students","abstract":"With the nationwide emphasis on improving outcomes for STEM undergraduates, it is important that we not only focus on modifying classroom instruction, but also provide students with the tools to maximize their independent learning time. There has been considerable work in laboratory settings examining two beneficial practices for enhancing learning: spacing and self-testing. In the current study, we examine biology students’ study practices, particularly in the context of these two behaviors. We specifically investigate whether a light-touch study skills intervention focused on encouraging spacing and self-testing practices impacted their utilization. Based on pre- and post-course surveys, we found that students report utilizing both beneficial and ineffective study practices and confirm that usage of spacing and self-testing correlates with a higher course grade. We also found that students in the section of the course which received the study skills intervention were more likely to report continued use or adoption of spacing and self-testing compared to students in control sections without the intervention. Surprisingly, we found that underrepresented minorities (URMs) under-utilize self-testing, and that our intervention helped to partially ameliorate this gap. Additionally, we found that URMs who reported self-testing earned similar course grades compared to non-URMs who also self-tested, but that there was a much larger drop in performance for URMs who did not self-test relative to non-URMs who also did not self-test. Overall, we would encourage instructors to dedicate class time towards discussing the merits of beneficial study practices, especially for students that have historically underperformed in STEM disciplines.","authors":["Fernando Rodriguez","Mariela J. Rivas","Lani H. Matsumura","Mark Warschauer"],"meta":["July 2018PLoS ONE 13(7):e0200767","DOI:10.1371/journal.pone.0200767"],"references":["286639744_Spaced_Retrieval_Practice_Increases_College_Students'_Short-_and_Long-Term_Retention_of_Mathematics_Knowledge","271922078_When_Is_Practice_Testing_Most_Effective_for_Improving_the_Durability_and_Efficiency_of_Student_Learning","271593412_Instructor_and_student_knowledge_of_study_strategies","266859800_Qualitative_content_analysis_-_theoretical_foundation_basic_procedures_and_software_solution","308520305_Development_and_Use_of_the_Approaches_to_Teaching_Inventory","294694752_Test_enhanced_learning","290985505_Higher_education_Gaps_in_access_and_persistence_study","290478004_Qualitative_Content_Analysis_Theoretical_Background_and_Procedures","285679704_Students'_resistance_to_change_in_learning_strategies_courses","280019283_Untangling_the_Benefits_of_Multiple_Study_Opportunities_and_Repeated_Testing_for_Cued_Recall","264482411_Self-regulated_learning_study_strategies_and_academic_performance_in_undergraduate_organic_chemistry_An_investigation_examining_ethnically_diverse_students","262267588_Active_Learning_Increases_Student_Performance_in_Science_Engineering_and_Mathematics","258180568_Improving_Students'_Learning_With_Effective_Learning_Techniques","262952893_WhatMatters_in_College_for_Retaining_Aspiring_Scientists_and_Engineers_FromUnderrepresented_RacialGroups","258180977_Maintenance_of_Foreign_Language_Vocabulary_and_the_Spacing_Effect"]}