{"id":"326727993_A_Unified_Multilingual_Handwriting_Recognition_System_using_multigrams_sub-lexical_units","abstract":"We address the design of a unified multilingual system for handwriting recognition. Most of multilingual systems rests on specialized models that are trained on a single language and one of them is selected at test time. While some recognition systems are based on a unified optical model, dealing with a unified language model remains a major issue, as traditional language models are generally trained on corpora composed of large word lexicons per language. Here, we bring a solution by considering language models based on sub-lexical units, called multigrams. Dealing with multigrams strongly reduces the lexicon size and thus decreases the language model complexity. This makes possible the design of an end-to-end unified multilingual recognition system where both a single optical model and a single language model are trained on all the languages. We discuss the impact of the language unification on each model and show that our system reaches state-of-the-art methods performance with a strong reduction of the complexity.","authors":["Wassim Swaileh","Yann Soullard","Thierry Paquet"],"meta":["July 2018Pattern Recognition Letters 121(17)","DOI:10.1016/j.patrec.2018.07.027"],"references":["322780846_Handwriting_Recognition_with_Multigrams","312547989_Language_Identification_in_Document_Images","312485569_A_Unified_FrenchEnglish_Syllabic_Model_for_Handwriting_Recognition","322779850_Gated_Convolutional_Recurrent_Neural_Networks_for_Multilingual_Handwriting_Recognition","321599148_Language_Modeling_for_Information_Retrieval","312485418_Handwriting_Recognition_with_Large_Multidimensional_Long_Short-Term_Memory_Recurrent_Neural_Networks","311469848_Recurrent_neural_network_based_language_model","303950938_Multilingual_OCR_for_Indic_Scripts","290182483_Deep_Neural_Networks_for_Large_Vocabulary_Handwritten_Text_Recognition","283401257_Character-Based_Handwritten_Text_Recognition_of_Multilingual_Documents"]}