{"id":"326797099_Evolving_Spiking_Neural_Networks_for_online_learning_over_drifting_data_streams","abstract":"Nowadays huge volumes of data are produced in the form of fast streams, which are further affected by non-stationary phenomena. The resulting lack of stationarity in the distribution of the produced data calls for efficient and scalable algorithms for online analysis capable of adapting to such changes (concept drift). The online learning field has lately turned its focus on this challenging scenario, by designing incremental learning algorithms that avoid becoming obsolete after a concept drift occurs. Despite the noted activity in the literature, a need for new efficient and scalable algorithms that adapt to the drift still prevails as a research topic deserving further effort. Surprisingly, Spiking Neural Networks, one of the major exponents of the third generation of artificial neural networks, have not been thoroughly studied as an online learning approach, even though they are naturally suited to easily and quickly adapting to changing environments. This work covers this research gap by adapting Spiking Neural Networks to meet the processing requirements that online learning scenarios impose. In particular the work focuses on limiting the size of the neuron repository and making the most of this limited size by resorting to data reduction techniques. Experiments with synthetic and real data sets are discussed, leading to the empirically validated assertion that, by virtue of a tailored exploitation of the neuron repository, Spiking Neural Networks adapt better to drifts, obtaining higher accuracy scores than naive versions of Spiking Neural Networks for online learning environments.","authors":["Jesús López Lobo","Ibai Laña","Javier Del Ser","Nekane Bilbao"],"meta":["August 2018Neural networks: the official journal of the International Neural Network Society 108","DOI:10.1016/j.neunet.2018.07.014"],"references":["320393329_DRED_An_Evolutionary_Diversity_Generation_Method_for_Concept_Drift_Adaptation_in_Online_Learning_Environments","317579226_Adaptive_random_forests_for_evolving_data_stream_classification","315698712_A_Survey_on_Ensemble_Learning_for_Data_Stream_Classification","308900541_Discussion_and_review_on_evolving_data_streams_and_concept_drift_adapting","305077794_A_Survey_on_Feature_Drift_Adaptation_Definition_Benchmark_Challenges_and_Future_Directions","315454833_A_Systematic_Study_of_Online_Class_Imbalance_Learning_With_Concept_Drift","314923595_Prototype_Selection_on_Large_and_Streaming_Data","313750911_The_impact_of_diversity_on_online_ensemble_learning_in_the_presence_of_concept_drift","313325995_Ensemble_learning_for_data_stream_analysis_A_survey","300125762_An_Overview_of_Concept_Drift_Applications"]}