{"id":"326762422_Effects_of_virtual_acoustics_on_target-word_identification_performance_in_multi-talker_environments","abstract":"Many virtual reality applications let multiple users communicate in a multi-talker environment, recreating the classic cocktail-party effect. While there is a vast body of research focusing on the perception and intelligibility of human speech in real-world scenarios with cocktail party effects, there is little work in accurately modeling and evaluating the effect in virtual environments. Given the goal of evaluating the impact of virtual acoustic simulation on the cocktail party effect, we conducted experiments to establish the signal-to-noise ratio (SNR) thresholds for target-word identification performance. Our evaluation was performed for sentences from the coordinate response measure corpus in presence of multi-talker babble. The thresholds were established under varying sound propagation and spatialization conditions. We used a state-of-the-art geometric acoustic system integrated into the Unity game engine to simulate varying conditions of reverberance (direct sound, direct sound & early reflections, direct sound and early reflections and late reverberation) and spatialization (mono, stereo, and binaural). Our results show that spatialization has the biggest effect on the ability of listeners to discern the target words in multi-talker virtual environments. Reverberance, on the other hand, slightly affects the target word discerning ability negatively.","authors":["Atul Rungta","Nicholas Rewkowski","Carl Schissler","Philip Robinson"],"meta":["August 2018","DOI:10.1145/3225153.3225166","Conference: the 15th ACM Symposium"],"references":["323620425_Diffraction_Kernels_for_Interactive_Sound_Propagation_in_Dynamic_Environments","322898522_Generic_HRTFs_May_be_Good_Enough_in_Virtual_Reality_Improving_Source_Localization_through_Cross-Modal_Plasticity","317914343_Concurrent_talking_in_immersive_virtual_reality_On_the_dominance_of_visual_speech_cues","308669775_Interactive_Sound_Propagation_and_Rendering_for_Large_Multi-Source_Scenes","288485193_P-HRTF_Efficient_personalized_HRTF_computation_for_high-fidelity_spatial_sound","274397643_The_cocktail-party_problem_revisited_early_processing_and_selection_of_multi-talker_speech","274013833_WAVE_Interactive_Wave-based_Sound_Propagation_for_Virtual_Environments","270697468_High-Order_Diffraction_and_Diffuse_Reflections_for_Interactive_Sound_Propagation_in_Large_Environments","318614275_Interactive_sound_propagation_and_rendering_for_large_multi-source_scenes","284569636_Wave-Based_Sound_Propagation_in_Large_Open_Scenes_Using_an_Equivalent_Source_Formulation"]}