{"id":"326734817_The_Impact_of_the_Blockchain_on_the_Supply_Chain_A_Theory-Based_Research_Framework_and_a_Call_for_Action","abstract":"STRUCTURED ABSTRACT\nPurpose-This paper strives to close the current research gap pertaining to potential implications of the Blockchain for SCM by presenting a framework built on four established economic theories (principal agent theory, transaction cost analysis, resource-based view, network theory). These theories can be used to derive research questions that are theory-based as well as relevant for the industry. This paper is intended to initiate and stimulate an academic discussion on the potential impact of the Blockchain and introduces a framework for middle-range theorizing together with several research questions. \n\nDesign/methodology/approach-This paper builds on previous theories that are frequently used in SCM research and shows how they can be adapted to Blockchain-related questions. Findings-This paper introduces a framework for middle-range theorizing together with several research questions. Research limitations/implications-The paper presents Blockchain-related research questions derived from four frequently used theories: namely principal agent theory (PAT), transaction cost theory (TCA), resource-based view (RBV) and network theory (NT). These questions will guide future research pertaining to structural (PAT, TCA) and managerial issues (RBV, NT) and will foster middle-range theory development in SCM research. Practical implications-Blockchain technology has the potential to significantly change SCM. Given the huge investments by industry, academic research is needed that investigates potential implications and supports companies. In this paper various research questions are introduced that illustrate how the implications of Blockchain on SCM can be investigated from different perspectives. Originality/value-To the best of our knowledge, no academic papers are published in leading academic journals that investigate the relationship between SCM and Blockchain from a theory-based perspective.","authors":["Horst Treiblmaier"],"meta":["August 2018Supply Chain Management","DOI:10.1108/SCM-01-2018-0029","Project: Implications of Blockchain"],"references":["341913793_The_Truth_About_Blockchain","322374208_Optimal_levels_of_decentralization_for_resilient_supply_chains","319436630_Beyond_Bitcoin_A_Critical_Look_at_Blockchain-Based_Systems","319047604_A_Blockchain-based_Approach_for_Data_Accountability_and_Provenance_Tracking","318724655_Blockchain_in_Logistics_and_Supply_Chain_Trick_or_Treat","344598580_Transaction_cost_framework_in_operations_and_supply_chain_management_research_theory_and_measurement","330066446_Business_Transformation_through_Blockchain_Volume_I","324139564_1_Blockchain's_roles_in_meeting_key_supply_chain_management_objectives","319130139_Revisiting_the_resource-based_view_on_logistics_performance_in_the_shipping_industry","318916518_Applying_Theories_from_Other_Disciplines_to_Logistics_and_Supply_Chain_Management_A_Systematic_Literature_Review","317999620_Banking_on_Blockchain_Costs_Savings_Thanks_to_the_Blockchain_Technology","317567258_Trends_and_Strategies_in_Logistics_and_Supply_Chain_Management_-_Digital_Transformation_Opportunities","317182541_ProvChain_A_Blockchain-Based_Data_Provenance_Architecture_in_Cloud_Environment_with_Enhanced_Privacy_and_Availability","317013223_Traceability_and_risks_an_extended_transaction_cost_perspective","317723673_Digital_blockchain_networks_appear_to_be_following_Metcalfe's_Law"]}