{"id":"326836028_Deep_Recurrent_Neural_Network_for_Agricultural_Classification_using_multitemporal_SAR_Sentinel-1_for_Camargue_France","abstract":"The development and improvement of methods to map agricultural land cover are currently major challenges, especially for radar images. This is due to the speckle noise nature of radar, leading to a less intensive use of radar rather than optical images. The European Space Agency Sentinel-1 constellation, which recently became operational, is a satellite system providing global coverage of Synthetic Aperture Radar (SAR) with a 6-days revisit period at a high spatial resolution of about 20 m. These data are valuable, as they provide spatial information on agricultural crops. The aim of this paper is to provide a better understanding of the capabilities of Sentinel-1 radar images for agricultural land cover mapping through the use of deep learning techniques. The analysis is carried out on multitemporal Sentinel-1 data over an area in Camargue, France. The data set was processed in order to produce an intensity radar data stack from May 2017 to September 2017. We improved this radar time series dataset by exploiting temporal filtering to reduce noise, while retaining as much as possible the fine structures present in the images. We revealed that even with classical machine learning approaches (K nearest neighbors, random forest, and support vector machines), good performance classification could be achieved with F-measure/Accuracy greater than 86% and Kappa coefficient better than 0.82. We found that the results of the two deep recurrent neural network (RNN)-based classifiers clearly outperformed the classical approaches. Finally, our analyses of the Camargue area results show that the same performance was obtained with two different RNN-based classifiers on the Rice class, which is the most dominant crop of this region, with a F-measure metric of 96%. These results thus highlight that in the near future these RNN-based techniques will play an important role in the analysis of remote sensing time series.","authors":["Emile Ndikumana","Nicolas Baghdadi","Courault Dominique","L. Hossard"],"meta":["August 2018Remote Sensing 10(8):1217","DOI:10.3390/rs10081217"],"references":["323357827_Deep_Learning_in_Agriculture_A_Survey","322849117_Deep_Recurrent_Neural_Networks_for_Winter_Vegetation_Quality_Mapping_via_Multitemporal_SAR_Sentinel-1","321793334_Tomosar_platform_supports_for_Sentinel-1_tops_persistent_scatterers_interferometry","315939269_Deep_Learning_Classification_of_Land_Cover_and_Crop_Types_Using_Remote_Sensing_Data","312649590_Operational_High_Resolution_Land_Cover_Map_Production_at_the_Country_Scale_Using_Satellite_Image_Time_Series","312210139_Estimating_inter-annual_variability_in_winter_wheat_sowing_dates_from_satellite_time_series_in_Camargue_France","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","316098191_Land_Cover_Classification_via_Multi-temporal_Spatial_Data_by_Recurrent_Neural_Networks","309729965_Assessing_the_Ability_of_LSTMs_to_Learn_Syntax-Sensitive_Dependencies","307881957_LIBSVM_A_library_for_support_vector_machines"]}