{"id":"326832715_Enhanced_Textual_Password_Scheme_for_Better_Security_and_Memorability","abstract":"Traditional textual password scheme provides a large number of password combinations but users generally use a small portion of available password space. Complex textual passwords are difficult to remember, therefore most users choose passwords with small length and contain dictionary words. Due to the use of small password length and dictionary words, textual passwords become easy to crack through offline guessability attacks. Traditional textual passwords scheme is also weak against keystroke logger attacks because alphanumeric characters are directly inserted into the password field. In this paper, enhancements are proposed in the registration and login screen of the traditional textual password scheme for improving security against offline guessability attacks and keystroke logger attacks. The proposed registration screen also improve memorability of traditional textual passwords through visual cues or patternbased approach. In the proposed login screen, passwords are indirectly inserted into the password field, to resist keystroke logger attacks. A comparative analysis between the passwords created in traditional and proposed pattern-based approach is presented. The testing results show that users create strong and high entropy passwords in the proposed pattern-based approach as compared to the traditional textual passwords approach. © 2018, (IJACSA) International Journal of Advanced Computer Science and Applications.","authors":["Hina Bhanbhro","Shah Zaman","Syed Raheel","Sheikh Tahir"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(7)","DOI:10.14569/IJACSA.2018.090730"],"references":["221437145_Influencing_users_towards_better_passwords_Persuasive_cued_click-points","221166427_Helping_users_create_better_passwords_is_this_the_right_approach","221166403_Encountering_Stronger_Password_Requirements_User_Attitudes_and_Behaviors","274662550_A_Large-Scale_Study_of_Web_Password_Habits_of_Chinese_Network_Users","269291432_Password_security_-_No_change_in_35_years","262349500_Does_my_password_go_up_to_eleven_the_impact_of_password_meters_on_password_selection","262320725_The_Domino_Effect_of_Password_Reuse","232507657_Recall_and_recognition_of_words_and_pictures_by_adults_and_children","228356232_Do_strong_web_passwords_accomplish_anything","222304661_Improving_system_security_via_proactive_password_checking"]}