{"id":"326853887_Fog-Assisted_Translation_Towards_Efficient_Software_Emulation_on_Heterogeneous_IoT_Devices","abstract":"With predictions that in the near future tens of billions of devices will be added to the Internet of Things (IoT), new challenges arise, including the development and deployment of software for a wide variety of devices, architectures, instruction set architectures, and computational resources. Despite the fact that emulation techniques have been successful in the creation of virtual layers to ease software deployment in heterogeneous settings, the power consumption and memory code footprint restrictions of the IoT lead to new issues which still need to be further explored within the scope of software emulation. Therefore, we investigate how a distributed implementation of dynamic translation can be used to increase emulation performance in this context. To evidence this, we present a novel distributed dynamic translator simulator that can simulate environments with several devices running RISCV applications and offloading code compilation through the network. Using this simulator, we tested a scenario with 400 constrained IoT devices running lean virtual machines that are capable of offloading dynamic translation to four fog devices, which in turn have the option of distributing their workload to other fog devices or the cloud.The results show that we can improve the performance of constrained devices by 10 times with the use of fog-assisted translation, while at the same time guaranteeing no extra overhead in the emulation process of the fog devices themselves. These findings suggest that, in general, distributed dynamic translation can leverage fog computing to improve emulation in the IoT, even when it comes to devices with limited resources.","authors":["Vanderson Rosario","Flávia Pisani","Alexandre Rodrigues Gomes","Edson Borin"],"meta":["May 2018","DOI:10.1109/IPDPSW.2018.00196","Conference: 2018 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW)"],"references":["320971096_Beyond_the_Fog_Bringing_Cross-Platform_Code_Execution_to_Constrained_IoT_Devices","320239870_RIoTBench_An_IoT_benchmark_for_distributed_stream_processing_systems","320971620_The_Case_for_Flexible_ISAs_Unleashing_Hardware_and_Software","314854501_Generalized_just-in-time_trace_compilation_using_a_parallel_task_farm_in_a_dynamic_binary_translator","314815915_Online_feedback-directed_optimization_of_Java","311473577_Software_profiling_for_hot_path_prediction_less_is_more","311472495_Improving_the_performance_of_trace-based_systems_by_false_loop_filtering","307141461_Handling_IoT_platform_heterogeneity_with_COISA_a_compact_OpenISA_virtual_platform","293011761_Internet_of_Things_in_the_5G_Era_Enablers_Architecture_and_Business_Models","277974796_A_dynamic_binary_translation_system_in_a_clientserver_environment"]}