{"id":"326825428_Emergence_of_Weak_Coupling_at_Large_Distance_in_Quantum_Gravity","abstract":"The Ooguri-Vafa swampland conjectures claim that in any consistent theory of quantum gravity, when venturing to large distances in scalar field space, a tower of particles will become light at a rate that is exponential in the field-space distance. We provide a novel viewpoint on this claim: If we assume that a tower of states becomes light near a particular point in field space, and we further demand that loop corrections drive both gravity and the scalar to strong coupling at a common energy scale, then the requirement that the particles become light exponentially fast in the field-space distance in Planck units follows automatically. Furthermore, the same assumption of a common strong-coupling scale for scalar fields and gravitons implies that, when a scalar field evolves over a super-Planckian distance, the average particle mass changes by an amount of the order of the cutoff energy. This supports earlier suggestions that significantly super-Planckian excursions in field space cannot be described within a single effective field theory. We comment on the relationship of our results to the weak gravity conjecture.","authors":["Ben Heidenreich","Matthew Reece","Tom Rudelius"],"meta":["August 2018Physical Review Letters 121(5)","DOI:10.1103/PhysRevLett.121.051601"],"references":["323392616_Infinite_Distances_in_Field_Space_and_Massless_Towers_of_States","322568104_A_Geometrical_Upper_Bound_on_the_Inflaton_Range","321604399_The_Weak_Gravity_Conjecture_and_Emergence_from_an_Ultraviolet_Cutoff","319255937_Flat_Monodromies_and_a_Moduli_Space_Size_Conjecture","323164895_A_Tower_Weak_Gravity_Conjecture_from_Infrared_Consistency","316921293_The_Weak_Gravity_Conjecture_and_Scalar_Fields","315382899_The_Swampland_Conjecture_and_F-term_Axion_Monodromy_Inflation","308821296_Super-Planckian_Spatial_Field_Variations_and_Quantum_Gravity","304548303_Evidence_for_a_Lattice_Weak_Gravity_Conjecture","304547923_The_Weak_Gravity_Conjecture_in_three_dimensions"]}