{"id":"326832646_An_Improved_Bat_Algorithm_based_on_Novel_Initialization_Technique_for_Global_Optimization_Problem","abstract":"Bat algorithm (BA) is a nature-inspired metaheuristic algorithm which is widely used to solve the real world global optimization problem. BA is a population-based intelligent stochastic search technique that emerged from the echolocation features of bats and created from the mimics of bats foraging behavior. One of the major issue faced by the BA is frequently captured in local optima while handling the complex real-world problems. In this study, a new variant of BA named as improved bat algorithm (I-BAT) is proposed. Improved bat algorithm modifies the standard BA by enhancing its exploitation capabilities, and secondly for initialization of swarm, a quasi-random sequence Torus has been applied to overcome the issue of convergence and diversity. Population initialization is a vital factor in BA, which considerably influences the diversity and convergence of swarm. In order to improve the diversity and convergence, quasi-random sequences are more useful to initialize the population rather than the random distribution. The proposed strategy is applied to standard benchmark functions that are extensively used in the literature. The experimental results illustrate the superiority of the proposed technique. The simulation results verify the efficiency of proposed technique for swarm over the benchmark algorithm that is implemented for the function optimization. © 2018, (IJACSA) International Journal of Advanced Computer Science and Applications.","authors":["Waqas Haider Bangyal","Jamil Ahmad","Hafiz Tayyab Rauf","Sobia Pervaiz"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(7)","DOI:10.14569/IJACSA.2018.090723"],"references":["283716766_Improved_Bat_algorithm_for_the_detection_of_myocardial_infarction","260331759_Modified_Bat_Algorithm","258397338_A_Novel_Hybrid_Bat_Algorithm_with_Harmony_Search_for_Global_Numerical_Optimization","236455548_A_hybrid_bat_algorithm","233780272_Bat_Algorithm_A_Novel_Approach_for_Global_Engineering_Optimization","324316433_Geometries_and_Groups","309365898_New_directional_bat_algorithm_for_continuous_optimization_problems","283405515_A_chaotic_Levy_flight_bat_algorithm_for_parameter_estimation_in_nonlinear_dynamic_biological_systems","269670039_Bat_Algorithm_with_Self-adaptive_Mutation_A_Comparative_Study_on_Numerical_Optimization_Problems","258581844_Image_Matching_Using_a_Bat_Algorithm_with_Mutation"]}