{"id":"326815769_Non-white_matter_tissue_extraction_and_deep_convolutional_neural_network_for_Alzheimer's_disease_detection","abstract":"In this paper, we introduce an automatic and robust method to detect and identify Alzheimer’s disease (AD) using the magnetic resonance imaging (MRI) and positron emission tomography (PET) images. AD research as utilized with clinical and computer aid diagnostic tools has been strongly developed in recent decades. Several studies have resulted in many methods of early detection of AD, which benefit patient outcomes and new findings on the development of a deeper understanding of the mechanisms of this disease. Therefore, using the operation of electronic computers to diagnose automatically the incident of AD has served a vital role in supporting clinicians as well as easing significant elaboration on manual and subjectively AD diagnosing of clinicians for the patient’s beneficial outcomes. To this end, we propose a deep learning approach-based model of AD detection applying to MRI and PET images. Individually, we extract non-white matter of brain PET images, which are guided by MRI images as an anatomical mask. Before running the classification module, we build an unsupervised network entitled the high-level layer concatenation autoencoder to pre-train the network with inputs as three-dimensional patches extracted from pre-processed scans. The learned parameters are reused for a well-known convolutional neural network to boost up the training procedure. We conduct experiments on a public data set ADNI and classified a subject into one of three groups: normal control, mild cognitive impairment, and AD. Our proposed method outperforms for AD detection problem than other methods.","authors":["Vu Duong","Ngoc-Huynh Ho","Hyung-Jeong Yang","Jahae Kim"],"meta":["October 2018Soft Computing 22(5)","DOI:10.1007/s00500-018-3421-5","Project: Alzheimer's Disease Prognosis"],"references":["321352456_Creation_of_a_deep_convolutional_auto-encoder_in_Caffe","321156983_Image_recognition_performance_enhancements_using_image_normalization","319412671_Transfer_Learning_with_Deep_Convolutional_Neural_Network_for_SAR_Target_Classification_with_Limited_Labeled_Data","314423109_Adaptive_Medical_Image_Compression_Based_on_Lossy_and_Lossless_Embedded_Zerotree_Methods","286302172_Creation_of_a_Deep_Convolutional_Auto-Encoder_in_Caffe","325018908_Hidden_Markov_Models_for_classifying_protein_secondary_and_tertiary_structures","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","316942060_Deep_Learning_in_Genomic_and_Medical_Image_Data_Analysis_Challenges_and_Approaches","301874293_Hough-CNN_Deep_Learning_for_Segmentation_of_Deep_Brain_Regions_in_MRI_and_Ultrasound","290537224_Robust_ROI_watermarking_scheme_based_on_visual_cryptography_Application_on_mammograms"]}