{"id":"326888312_Immunologically_effective_dose_A_practical_model_for_immuno-radiotherapy","abstract":"Objectives\nConcomitant radiotherapy with immune checkpoint blockade could be synergistic. Out-of-field effects could improve survival by slowing or blocking metastatic spreading. However, not much is known about the optimal size per fraction and inter-fraction time in that new context.\n\nMethods\nThe new concept of Immunologically Effective Dose (IED) is proposed: it models an intrinsic immunogenicity of radiotherapy schedules, i.e. the fraction of immunogenicity that results from the choice of the dosing regimen. The IED is defined as the single dose, given in infinitely low dose rate, that produces the same amount of abscopal response as the radiation schedule being considered. The IED uses the classic parameters of the BED formula and adds two parameters for immunogenicity that describe the local availability of immune effectors within the tumor micro-environment. Fundamentally, the IED adds a time dimension in the BED formula and describes an intrinsic immunogenicity level for radiotherapy.\n\nResults\nThe IED is positively related to the intensity of the out-of-field, radiotherapy-mediated, immune effects described in some preclinical data. Examples of numerical simulations are given for various schedules. A web-based calculator is freely available.\n\nConclusions\nOut-of-field effects of radiotherapy with immune checkpoint blockers might be better predicted and eventually, radiotherapy schedules with better local and systemic immunogenicity could be proposed.\n\nAdvances in knowledge\nA model for the intrinsic level of immunogenicity of radiotherapy schedules, referred to as the Immunologically Effective Dose (IED), that is independent of the type of immunotherapy.","authors":["Raphael Serre","Fabrice Barlesi","Xavier Muracciole","Dominique Barbolosi"],"meta":["August 2018Oncotarget 9(61)","DOI:10.18632/oncotarget.25746"],"references":["314306559_Hypofractionated_Irradiation_Has_Immune_Stimulatory_Potential_and_Induces_a_Timely_Restricted_Infiltration_of_Immune_Cells_in_Colon_Cancer_Tumors","277977786_A_Systematic_Evaluation_of_Abscopal_Responses_following_Radiotherapy_in_Patients_with_Metastatic_Melanoma_Treated_with_Ipilimumab","264435294_Abscopal_effects_of_radiotherapy_on_advanced_melanoma_patients_who_progressed_after_ipilimumab_immunotherapy","221684311_Immunologic_Correlates_of_the_Abscopal_Effect_in_a_Patient_with_Melanoma","308316439_Current_clinical_trials_testing_the_combination_of_immunotherapy_with_radiotherapy","304144812_Modern_Radiotherapy_Concepts_and_the_Impact_of_Radiation_on_Immune_Activation","260376281_An_Abscopal_Response_to_Radiation_and_Ipilimumab_in_a_Patient_with_Metastatic_Non-Small_Cell_Lung_Cancer","235384194_The_Etiology_of_Treatment-related_Lymphopenia_in_Patients_with_Malignant_Gliomas_Modeling_Radiation_Dose_to_Circulating_Lymphocytes_Explains_Clinical_Observations_and_Suggests_Methods_of_Modifying_the","51972314_Maximizing_Tumor_Immunity_With_Fractionated_Radiation","36852229_Principles_and_Practice_of_Radiation_Oncology"]}