{"id":"326832436_Interactive_Visual_Decision_Tree_for_Developing_Detection_Rules_of_Attacks_on_Web_Applications","abstract":"Creating detection rules of attacks on web applications is not a trivial task, especially when the attacks are launched by experienced hackers. In such a situation, human expertise is essential to produce effective results. However, human users are easily overloaded by the huge input data, which is meant to be analyzed, learned from, and used to develop appropriate detection rules. To support human users in dealing with the information overload problem while developing detection rules of web application attacks, we propose a novel technique and tool called Interactive Visual Decision Tree (IVDT). IVDT is a variant of the popular decision tree learning technique introduced in research fields such as machine learning and data mining, with two additionally important features: visually supported data analysis and user-guided tree growing. Visually supported data analysis helps human users cope with high volume of training data while analyzing each node in the tree being built. On the other hand, user-guided tree growing allows human users to apply their own expertise and experience to create custom split condition for each tree node. A prototype implementation of IVDT is built and experimented to evaluate its effectiveness in terms of detection accuracy achieved by its users as well as ease of working with. The experiment results prove some advantages of IVDT over traditional decision tree learning method, but also point out its problems that should be handled in future improvements. © 2018, (IJACSA) International Journal of Advanced Computer Science and Applications.","authors":["Tran Tri Dang","Tran Khanh Dang","Truong-Giang Nguyen"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(7)","DOI:10.14569/IJACSA.2018.090705"],"references":["263495206_Visualization_of_web_form_submissions_for_security_analysis","263123406_A_survey_on_security_visualization_techniques_for_web_information_systems","221654449_Visual_Classification_An_Interactive_Approach_to_Decision_Tree_Construction","327606791_Classification_And_Regression_Trees","314807959_Abstracting_application-level_web_security","251879904_Java_Universal_NetworkGraph_Framework_v_201","239612576_TrACE_A_Tool_for_Eective_Visualization_of_File_System_Access-Control","226222944_Induction_of_Decision_Trees","223517847_Preattentive_Processing_in_Vision","222685854_Fast_detection_and_visualization_of_network_attacks_on_parallel_coordinates","30013012_Circle_Segments_A_Technique_for_Visually_Exploring_Large_Multidimensional_Data_Sets","220272011_PaintingClass_interactive_construction_visualization_and_exploration_of_decision_trees","220067760_The_Plane_with_Parallel_Coordinates","3509204_Tree-Maps_A_Space-Filling_Approach_to_the_Visualization_of_Hierarchical_Information_Structures"]}