{"id":"326803491_Synthesis_of_Faujasite_Zeolite_Z_for_Adsorption_of_Cationic_Dye_from_Textile_Waste_Water","abstract":"The synthesis of Faujasite Zeolite from Locally available Erusu Kaolin clay sourced in Nigeria has been attempted using standard procedures which have proven sufficient upon slight modifications and reported in literature. The zeolite was characterized with Scanning Electron Microscopy, Fourier Transformed infrared spectroscopy (FTIR), X-ray Diffractometer and BET surface area analyzer. Forthwith, Adsorption of the hazardous cationic dye malachite green (MG) on the synthesized zeolite was investigated. Batch process variables for the adsorption of MG by Zeolite were determined. The mechanisms involved in the adsorption of MG by the sorbent were explored using isotherms models. The maximum equilibrium adsorption capacity was found to be 108.26 mg/g at 30˚C. It is noteworthy that the adsorption of MG was reduced (about 45%) at low pH (4) compared to that at high pH (12). Furthermore, among the other parameters affecting adsorption, a high MG adsorption capacity (about 54%) was observed at a maximum initial MG dye concentration of 200 mg/L compared to that at lower initial MG dye concentration (25 mg/L), indicating the dependency of sorption on the initial adsorbate concentration (C O) in the solution. The MG adsorption data indicate multilayer adsorption because the data were fit better by the Freundlich model (R 2 > 0.99) than by the Langmuir model. Surface diffusion was found to be a possible mechanism for the adsorption of MG by Zeolite. The study shed light on the potential of synthesized kaolinite derivative \"Zeolite\" as an efficient sorbent for cationic dye cleanup in wastewater treatment.","authors":["Abimbola George Olaremu","Adedapo Adeola"],"meta":["January 2018"],"references":["273198885_Optimization_of_Parameters_Affecting_Adsorption_of_Nickel_II_Zinc_II_and_Lead_II_on_Dowex_50_W_Resin_Using_a_Response_Surface_Methodology_Approach","236615787_Adsorption_Kinetics_and_Column_Operations_for_the_Removal_and_Recovery_of_Malachite_Green_from_Wastewater_Using_Bottom_Ash","307539797_Organic_Dyes_and_Pigments","297599965_Interactive_influence_of_Fe-Mn_and_organic_matter_on_pentachlorophenol_sorption_under_oxic_and_anoxic_conditions","290210937_Adsorption_of_copper_Cu_2_from_aqueous_solution_using_date_palm_trunk_fibre_isotherms_and_kinetics","287825371_Heterogeneous_Catalysis_and_Fine_Chemicals_II","285700867_Introduction_to_Zeolite_Science_and_Practice","285025154_Synthesis_of_faujasite_zeolites_from_Kankara_Kaolin_clay","283804429_Adsorption_of_cationic_dyes_onto_Moroccan_clay_Application_for_industrial_wastewater_treatment","257589806_Infrared_evidence_for_the_formation_of_an_intermediate_compound_during_the_synthesis_of_zeolite_Na-A_from_metakaolin"]}