{"id":"326818120_Web_monitoring_of_emerging_animal_infectious_diseases_integrated_in_the_French_Animal_Health_Epidemic_Intelligence_System","abstract":"Since 2013, the French Animal Health Epidemic Intelligence System (in French: Veille Sanitaire Internationale, VSI) has been monitoring signals of the emergence of new and exotic animal infectious diseases worldwide. Once detected, the VSI team verifies the signals and issues early warning reports to French animal health authorities when potential threats to France are detected. To improve detection of signals from online news sources, we designed the Platform for Automated extraction of Disease Information from the web (PADI-web). PADI-web automatically collects, processes and extracts English-language epidemiological information from Google News. The core component of PADI-web is a combined information extraction (IE) method founded on rule-based systems and data mining techniques. The IE approach allows extraction of key information on diseases, locations, dates, hosts and the number of cases mentioned in the news. We evaluated the combined method for IE on a dataset of 352 disease-related news reports mentioning the diseases involved, locations, dates, hosts and the number of cases. The combined method for IE accurately identified (F-score) 95% of the diseases and hosts, respectively, 85% of the number of cases, 83% of dates and 80% of locations from the disease-related news. We assessed the sensitivity of PADI-web to detect primary outbreaks of four emerging animal infectious diseases notifiable to the World Organisation for Animal Health (OIE). From January to June 2016, PADI-web detected signals for 64% of all primary outbreaks of African swine fever, 53% of avian influenza, 25% of bluetongue and 19% of foot-and-mouth disease. PADI-web timely detected primary outbreaks of avian influenza and foot-and-mouth disease in Asia, i.e. they were detected 8 and 3 days before immediate notification to OIE, respectively.","authors":["Elena Arsevska","Sarah Valentin","Julien Rabatel","Jocelyn De Goër De Herve"],"meta":["August 2018PLoS ONE 13(8):e0199960","DOI:10.1371/journal.pone.0199960","Projects: AgroNLPPlatform for Automated extraction of Disease Information - PADI"],"references":["309240362_Avian_Influenza_Risk_Surveillance_in_North_America_with_Online_Media","307174918_Mining_association_rules_between_sets_of_items_in_large_databases","283891961_Biomedical_term_extraction_overview_and_a_new_methodology","282576879_Using_Social_Media_for_Actionable_Disease_Surveillance_and_Outbreak_Management_A_Systematic_Literature_Review","318393770_R_A_Language_and_Environment_for_Statistical_Computing","318393712_R_A_Language_and_Environment_for_Statistical_Computing","313606501_Mining_Association_rules_between_sets_of_items_in_large_databases","307881957_LIBSVM_A_library_for_support_vector_machines","306269290_Identification_of_Associations_between_Clinical_Signs_and_Hosts_to_Monitor_the_Web_for_Detection_of_Animal_Disease_Outbreaks","297038369_Identification_of_terms_for_detecting_early_signals_of_emerging_infectious_disease_outbreaks_on_the_web","280559339_African_swine_fever_in_the_Caucasus","276929133_Comparing_timeliness_content_and_disease_severity_of_formal_and_informal_source_outbreak_reporting","276032817_Using_AquaticHealthnet_to_Detect_Emerging_Trends_in_Aquatic_Animal_Health","272179100_Des_laboratoires_de_reference_a_la_veille_sanitaire_internationale_en_France_From_reference_laboratories_to_international_health_surveillance_in_France","272091377_The_Stanford_CoreNLP_Natural_Language_Processing_Toolkit"]}