{"id":"326839021_A_Brief_History_of_Bioinformatics","abstract":"It is easy for today's students and researchers to believe that modern bioinformatics emerged recently to assist next-generation sequencing data analysis. However, the very beginnings of bioinformatics occurred more than 50 years ago, when desktop computers were still a hypothesis and DNA could not yet be sequenced. The foundations of bioinformatics were laid in the early 1960s with the application of computational methods to protein sequence analysis (notably, de novo sequence assembly, biological sequence databases and substitution models). Later on, DNA analysis also emerged due to parallel advances in (i) molecular biology methods, which allowed easier manipulation of DNA, as well as its sequencing, and (ii) computer science, which saw the rise of increasingly miniaturized and more powerful computers, as well as novel software better suited to handle bioinformatics tasks. In the 1990s through the 2000s, major improvements in sequencing technology, along with reduced costs, gave rise to an exponential increase of data. The arrival of 'Big Data' has laid out new challenges in terms of data mining and management, calling for more expertise from computer science into the field. Coupled with an ever-increasing amount of bioinformatics tools, biological Big Data had (and continues to have) profound implications on the predictive power and reproducibility of bioinformatics results. To overcome this issue, universities are now fully integrating this discipline into the curriculum of biology students. Recent subdisciplines such as synthetic biology, systems biology and whole-cell modeling have emerged from the ever-increasing complementarity between computer science and biology.","authors":["Jeff Gauthier","Antony T Vincent","Steve Charette","Nicolas Derome"],"meta":["August 2018Briefings in Bioinformatics 2018(bby063):1-16","DOI:10.1093/bib/bby063"],"references":["348283701_DISTRIBUTION_DENSITY_OF_NUCLEOTIDES_WITHIN_A_DESOXYRIBONUCLEIC_ACID_CHAIN","320921866_The_UCSC_Genome_Browser_database_2018_update","319965471_A_biologist's_guide_to_Bayesian_phylogenetic_analysis","313022746_Student_Performance_along_Axes_of_Scenario_Novelty_and_Complexity_in_Introductory_Biology_Lessons_from_a_Unique_Factorial_Approach_to_Assessment","321428987_The_international_nucleotide_sequence_database_collaboration","319695316_Implementing_a_web-based_introductory_bioinformatics_course_for_non-bioinformaticians_that_incorporates_practical_exercises_Implementing_a_Web-Based_Introductory_Bioinformatics","313724016_Bioconductor_Open_software_development_for_computational_biology_and_bioinformatics","312794221_Assemblathon_2_Evaluating_de_novo_methods_of_genome_assembly_in_three_vertebrate_species","312630654_A_protein_sequenator","312055637_Sixty-five_years_of_the_long_march_in_protein_secondary_structure_prediction_The_final_stretch"]}