{"id":"326894640_Mathematics_Learning_through_Computational_Thinking_Activities_A_Systematic_Literature_Review","abstract":"Computational Thinking represents a terminology that embraces the complex set of reasoning processes that are held for problem stating and solving through a computational tool. The ability of systematizing problems and solve them by these means is currently being considered a skill to be developed by all students, together with Language, Mathematics and Sciences. Considering that Computer Science has many of its roots on Mathematics, it is reasonable to ponder if and how Mathematics learning can be influenced by offering activities related to Computational Thinking to students. In this sense, this article presents a Systematic Literature Review on reported evidences of Mathematics learning in activities aimed at developing Computational Thinking skills. Forty-two articles which presented didactic activities together with an experimental design to evaluate learning outcomes published from 2006 to 2017 were analyzed. The majority of identified activities used a software tool or hardware device for their development. In these papers, a wide variety of mathematical topics has been being developed, with some emphasis on Planar Geometry and Algebra. Conversion of models and solutions between different semiotic representations is a high level cognitive skill that is most frequently associated to educational outcomes. This review indicated that more recent articles present a higher level of rigor in methodological procedures to assess learning effects. However, joint analysis of evidences from more than one data source is still not frequently used as a validation procedure.","authors":["Thiago Schumacher Barcelos","Roberto Munoz","Rodolfo Villarroel","Erick Merino"],"meta":["July 2018JOURNAL OF UNIVERSAL COMPUTER SCIENCE 24(7):815","Project: Relações entre o Pensamento Computacional e a Matemática em atividades didáticas de construção de jogos digitais"],"references":["320068824_Wearable_Learning_Multiplayer_Embodied_Games_for_Math","316535287_Quantifying_K-12_and_college_student_learning_outcomes_of_STEM_guitar_building","313843728_A_Pathway_into_Computational_Thinking_in_Primary_Schools","311093028_Assessment_in_Undergraduate_Programming-Based_Mathematics_Courses","302909013_Code_to_learn_with_Scratch_A_systematic_literature_review","276859440_Measuring_the_Level_of_Algorithmic_Skills_at_the_End_of_Secondary_Education_in_Hungary","274309848_Computational_Thinking","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","309591884_As_Competencias_para_Ensinar_no_Seculo_XXI_A_Formacao_dos_Professores_e_o_Desafio_da_Avaliacao","306235518_Computational_Thinking_and_Mathematics_Possible_Relationships_Revealed_by_an_Analysis_of_National_Curriculum_Guidelines"]}