{"id":"326908713_PBCS_An_Efficient_Parallel_Characteristic_Set_Method_for_Solving_Boolean_Polynomial_Systems","abstract":"Solving Boolean polynomial systems as an important aspect of symbolic computation, plays a fundamental role in various real applications. Although there exist many efficient sequential algorithms for solving Boolean polynomial systems, they are inefficient or even unavailable when the problem scale becomes large, due to the computational complexity of the problem and the limited processing capability of a single node. In this paper we propose an efficient parallel characteristic set method called PBCS for solving Boolean polynomial systems under the high-performance computing environment. Specifically, PBCS takes full advantage of the state-of-the-art characteristic set method and achieves load balancing by dynamically reallocating tasks. Moreover, the performance is further improved by optimizing the parameter setting. Extensive experiments are conducted to demonstrate that PBCS is efficient and scalable for solving Boolean equations, especially for the equations rasing from stream ciphers that have block triangular structure. In addition, the algorithm has good scalability and can be extended to the size of thousands CPU cores with a stable speedup.","authors":["Juan Zhao","Junqiang Song","Min Zhu","Jincai Li"],"meta":["August 2018","DOI:10.1145/3225058.3225097","Conference: the 47th International Conference"],"references":["312173033_Solving_Polynomial_Systems_with_Noise_over_F_2_Revisited","262451912_On_the_Efficiency_of_Solving_Boolean_Polynomial_Systems_with_the_Characteristic_Set_Method","279742427_A_new_framework_for_computing_Grobner_bases","268069576_Logical_foundations_of_proof_complexity_Reprint_of_the_2010_hardback_ed","268017574_A_Distributed_Computing_Model_for_Wu's_Method","267682051_An_Algebraic_Cryptanalysis_of_Nonlinear_Filter_Generators_using_Grobner_bases","262370395_Signature_Rewriting_in_Grobner_Basis_Computation","257253103_Characteristic_set_algorithms_for_equation_solving_in_finite_fields","247032141_On_the_complexity_of_Grobner_basis_computation_of_semi-regular_overdetermined","239086442_A_New_Efficient_Algorithm_for_Computing_Grobner_Bases_F4"]}