{"id":"326901416_ENSINO_DOS_PROCESSOS_DE_ELETRIZACAO_NO_3_ANO_DO_ENSINO_MEDIO_USANDO_AS_TEORIAS_COGNITIVISTAS_DE_VYGOTSKY_E_DE_AUSUBEL_ALIADAS_A_ATIVIDADES_EXPERIMENTAIS_TEACHING_OF_THE_PROCESSES_OF_ELECTRIFICATION_IN","abstract":"RESUMO Neste trabalho apresentamos a relevância das atividades colaborativas e construtivistas no ensino de Física para alunos do 3º ano do ensino médio, incluindo estudantes em vulnerabilidade social e econômica. Versa sobre a utilização de dois métodos de ensino: tradicional e construtivista. O último foi baseado na teoria do desenvolvimento cognitivista de Vygotsky e na aprendizagem significativa de Ausubel, incluindo atividades experimentais. Os resultados, avaliados por meio de questionários aplicados após o primeiro método e após o segundo método, demonstraram uma considerável evolução no aprendizado dos estudantes, mostrando a superioridade da utilização de técnicas cognitivistas associadas a experimentos. Esses mesmos resultados foram muito mais evidenciados em estudantes em situação de vulnerabilidade social, pois o rendimento aumentou em torno de dezoito vezes. O uso de métodos construtivistas, mesmo combinado com métodos tradicionais, motiva a participação e melhora a aprendizagem dos estudantes, podendo ser usado para reverter à forma de ensino mecânico usualmente empregado em laboratórios de Ciências. ABSTRACT In this work we present the relevance of collaborative and constructivist activities in Physics teaching for students in the 3rd year of high school, including pupils with social and economic vulnerability. It reports on the use of two teaching methods: traditional and constructivist. The latter was based on Vygotsky's theory of cognitive development and on the meaningful learning of Ausubel, including experimental activities. The results, evaluated through questionnaires applied after the first method and after the second method, demonstrated a considerable evolution in student learning, showing the superiority of the use of cognitivist techniques associated with experiments. These same results were much more evident in students in a situation of social vulnerability, since the school performance increased around eighteen times. The use of constructivist methods, even when combined with traditional methods, motivates participation and improves student learning, and can be used to revert to the form of mechanical education usually employed in science labs.","authors":["Eloi Junior","Marcelo Castanheira Da Silva"],"meta":["December 2017"],"references":["266296437_Avaliacao_de_sites_educacionais_de_Quimica_e_Fisica_um_estudo_comparativo","262614522_Professores_-_pesquisadores_reflexao_e_mudanca_metodologica_no_ensino_de_fisica_-_o_contexto_da_avaliacao","39077223_Conocimiento_profesional_y_epistemologia_de_los_profesores_I_Teoria_metodos_e_instrumentos","255670146_Vygotsky_e_a_Zona_de_Desenvolvimento_Proximal_ZDP_Tres_implicacoes_pedagogicas"]}