{"id":"326906608_Discrepancy-based_Evolutionary_Diversity_Optimization","abstract":"Diversity plays a crucial role in evolutionary computation. While diversity has been mainly used to prevent the population of an evolutionary algorithm from premature convergence, the use of evolutionary algorithms to obtain a diverse set of solutions has gained increasing attention in recent years. Diversity optimization in terms of features on the underlying problem allows to obtain a better understanding of possible solutions to the problem at hand and can be used for algorithm selection when dealing with combinatorial optimization problems such as the Traveling Salesperson Problem.\nWe consider discrepancy-based diversity optimization approaches for evolving diverse sets of images as well as instances of the Traveling Salesperson problem where a local search is not able to find near optimal solutions. Our experimental investigations comparing three diversity optimization approaches show that a discrepancy-based diversity optimization approach using a tie-breaking rule based on weighted differences to surrounding feature points provides the best results in terms of the star discrepancy measure.","authors":["Aneta Neumann","Wanru Gao","Carola Doerr","Frank Neumann"],"meta":["July 2018","DOI:10.1145/3205455.3205532","Conference: the Genetic and Evolutionary Computation Conference","Project: Evolutionary Art"],"references":["315491551_Evolutionary_Image_Transition_Using_Random_Walks","314797274_Evolutionary_Image_Composition_Using_Feature_Covariance_Matrices","283334713_Feature-Based_Diversity_Optimization_for_Problem_Instance_Classification","282500394_Analyzing_the_Effects_of_Instance_Features_and_Algorithm_Parameters_for_Max-Min_Ant_System_and_the_Traveling_Salesperson_Problem","315491630_Evolution_of_Artistic_Image_Variants_Through_Feature_Based_Diversity_Optimisation","314929743_Quasi-random_Numbers_Improve_the_CMA-ES_on_the_BBOB_Testbed","313348999_Feature_extraction_image_processing","307507688_Feature-Based_Diversity_Optimization_for_Problem_Instance_Classification","303697195_Global_contrast_factor_-_A_new_approach_to_image_contrast","300228880_Optimal_Parameter_Choices_Through_Self-Adjustment"]}