{"id":"326917999_Metacognitive_Difficulties_Faced_by_Novice_Programmers_in_Automated_Assessment_Tools","abstract":"Most novice programmers are not explicitly aware of the problem-solving process used to approach programming problems and cannot articulate to an instructor where they are in that process. Many are now arguing that this skill, called metacognitive awareness, is crucial for novice learning. However, novices frequently learn in university CS1 courses that employ automated assessment tools (AATs), which are not typically designed to provide the cognitive scaffolding necessary for novices to develop metacognitive awareness. This paper reports on an experiment designed to understand what difficulties novice programmers currently face when learning to code with an AAT. We describe the experiences of CS1 students who participated in a think-aloud study where they were observed solving a programming problem with an AAT. Our observations show that some students mentally augmented the tool when it did not explicitly support their metacognitive awareness, while others stumbled due to the tool's lack of such support. We use these observations to formulate difficulties faced by novices that lack metacognitive awareness, compare these results to other related studies, and look toward future work in modifying AATs.","authors":["James Prather","Raymond Pettit","Kayla McMurry","Alani Peters"],"meta":["August 2018","DOI:10.1145/3230977.3230981","Conference: the 2018 ACM Conference","Project: Metacognitive awareness in CS students"],"references":["319131903_On_Novices'_Interaction_with_Compiler_Error_Messages_A_Human_Factors_Approach","319131538_Comprehension_First_Evaluating_a_Novel_Pedagogy_and_Tutoring_System_for_Program_Tracing_in_CS1","318576092_Do_Developers_Read_Compiler_Error_Messages","316947518_Do_Enhanced_Compiler_Error_Messages_Help_Students_Results_Inconclusive","305082117_A_New_Metric_to_Quantify_Repeated_Compiler_Errors_for_Novice_Programmers","305081685_Towards_a_Systematic_Review_of_Automated_Feedback_Generation_for_Programming_Exercises","341439115_Protocol_Analysis_Verbal_Reports_as_Data","331156241_How_to_Solve_It_A_New_Aspect_of_Mathematical_Method","323331299_The_Effects_of_Enhanced_Compiler_Error_Messages_on_a_Syntax_Error_Debugging_Test","320850146_Metacognitive_calibration_when_learning_to_program"]}