{"id":"326943873_Certified_Graph_View_Maintenance_with_Regular_Datalog","abstract":"We employ the Coq proof assistant to develop a mechanically-certified framework for evaluating graph queries and incrementally maintaining materialized graph instances, also called views. The language we use for defining queries and views is Regular Datalog (RD) – a notable fragment of non-recursive Datalog that can express complex navigational queries, with transitive closure as native operator. We first design and encode the theory of RD and then mechanize a RD-specific evaluation algorithm capable of fine-grained, incremental graph view computation, which we prove sound with respect to the declarative RD semantics. By using the Coq extraction mechanism, we test an OCaml version of the verified engine on a set of preliminary benchmarks. Our development is particularly focused on leveraging existing verification and notational techniques to: a) define mechanized properties that can be easily understood by logicians and database researchers and b) attain formal verification with limited effort. Our work is the first step towards a unified, machine-verified, formal framework for dynamic graph query languages and their evaluation engines.","authors":["Angela Bonifati","Stefania Dumbrava","EMILIO JESÚS GALLEGO ARIAS"],"meta":["July 2018Theory and Practice of Logic Programming 18(3-4):372-389","DOI:10.1017/S1471068418000224"],"references":["319202867_Certifying_Standard_and_Stratified_Datalog_Inference_Engines_in_SSReflect","316848888_Handling_Environments_in_a_Nested_Relational_Algebra_with_Combinators_and_an_Implementation_in_a_Verified_Query_Compiler","301335208_Regular_Queries_on_Graph_Databases","320074732_Foundations_of_Modern_Query_Languages_for_Graph_Databases","318166891_The_ASP_System_DLV2","317596084_HoTTSQL_proving_query_rewrites_with_univalent_SQL_semantics","316849564_Incremental_Graph_Computations_Doable_and_Undoable","311394172_Incremental_View_Maintenance_for_Deductive_Graph_Databases_Using_Generalized_Discrimination_Networks","310831031_GMark_Schema-Driven_Generation_of_Graphs_and_Queries","305260496_A_Study_of_Transitive_Closure_As_a_Recursion_Mechanism"]}