{"id":"326997146_Foundations_of_Temporal_Text_Networks","abstract":"Abstract Three fundamental elements to understand human information networks are the individuals (actors) in the network, the information they exchange, that is often observable online as text content (emails, social media posts, etc.), and the time when these exchanges happen. An extremely large amount of research has addressed some of these aspects either in isolation or as combinations of two of them. There are also more and more works studying systems where all three elements are present, but typically using ad hoc models and algorithms that cannot be easily transfered to other contexts. To address this heterogeneity, in this article we present a simple, expressive and extensible model for temporal text networks, that we claim can be used as a common ground across different types of networks and analysis tasks, and we show how simple procedures to produce views of the model allow the direct application of analysis methods already developed in other domains, from traditional data mining to multilayer network mining.","authors":["Davide Vega D'Aurelio","Matteo Magnani"],"meta":["August 2018Applied Network Science 3(1)","DOI:10.1007/s41109-018-0082-3","Project: Models and Methods for Temporal Text Networks"],"references":["331868175_Automated_analysis_of_actor-topic_networks_on_twitter_New_approaches_to_the_analysis_of_socio-semantic_networks","316780438_Graph_Embedding_Techniques_Applications_and_Performance_A_Survey","315909044_Over-time_measurement_of_triadic_closure_in_coauthorship_networks","325742135_Multilayer_social_networks","320884583_Distant_Meta-Path_Similarities_for_Text-Based_Heterogeneous_Information_Networks","320835613_Knowledge_Communities_and_Socio-Cognitive_Taxonomies","319646605_Semantic_homophily_in_online_communication_Evidence_from_Twitter","319393928_Modern_Information_Retrieval","318919867_When_is_a_Network_a_Network_Multi-Order_Graphical_Model_Selection_in_Pathways_and_Temporal_Networks","313264273_Motifs_in_Temporal_Networks"]}