{"id":"326917042_Barycentric_Combinations_Based_Subdivision_Shaders","abstract":"We present a new representation of uniform subdivision surfaces based on Iterated Functions Systems formalism.\nMain advantages of this new representation are the formalization of topological subdivision, multiscale representa-\ntion of limit surface, separation of iterative space where the attractor is computed once for all and modeling space\nwhere the attractor is projected many times. An important consequence of this approach is that all uniform subdi-\nvision schemes are handled in the same way whatever there are primal or dual, approximating or interpolating.\nSubdivision surfaces are no longer viewed as a set of rules but as a list of barycentric combinations to apply\non neighborhoods of the coarse mesh. These combinations are representative subsets of the attractor which is\ndeduced from a Controlled Iterated Functions System automaton. From this new point of view we present in this\npaper a straightforward implementation to directly compute a tessellation of the subdivision surface from a control\nmesh. This implementation takes full advantage of Graphics Processing Units high capability of computation and\nTessellation Stage of OpenGL/GLSL rendering pipeline to generate on the fly a tessellation of the limit surface","authors":["Lucas Morlet","Marc Neveu","Sandrine Lanquetin","Christian Gentil"],"meta":["May 2018","DOI:10.24132/CSRN.2018.2801.6","Conference: 26. International Conference in Central Europe on Computer Graphics, Visualization and Computer VisionAt: Plzen, Czech Republic","Project: PhD Thesis : Elaboration of multi-representation geometric model"],"references":["221316579_Subdivision_Schemes_and_Attractors","285673348_Isogeometric_analysis_based_on_extended_Catmull-Clark_subdivision","266613340_Fractional_half-tangent_of_a_curve_described_by_Iterated_Function_Systems","265718761_Joining_PrimalDual_Subdivision_Surfaces","256152244_Clark_J_Recursively_generated_b-spline_surfaces_on_arbitrary_topological_meshes_Computer-Aided_Design_106_350-355","242529866_Subdivision_Methods_for_Geometric_Design_A_Constructive_Approach","239761623_Feature-Adaptive_GPU_Rendering_of_Catmull-Clark_Subdivision_Surfaces","239601715_Fractals_and_Self-Similarity","223851936_A_Unified_approach_to_subdivision_algorithms_near_extraordinary_vertices","222448665_Behavior_of_recursive_division_surfaces_near_extraordinary_points"]}