{"id":"326946242_Routing_Driverless_Transport_Vehicles_in_Car_Assembly_with_Answer_Set_Programming","abstract":"Automated storage and retrieval systems are principal components of modern production and warehouse facilities. In particular, automated guided vehicles nowadays substitute human-operated pallet trucks in transporting production materials between storage locations and assembly stations. While low-level control systems take care of navigating such driverless vehicles along programmed routes and avoid collisions even under unforeseen circumstances, in the common case of multiple vehicles sharing the same operation area, the problem remains how to set up routes such that a collection of transport tasks is accomplished most effectively. We address this prevalent problem in the context of car assembly at Mercedes-Benz Ludwigsfelde GmbH, a large-scale producer of commercial vehicles, where routes for automated guided vehicles used in the production process have traditionally been hand-coded by human engineers. Such ad-hoc methods may suffice as long as a running production process remains in place, while any change in the factory layout or production targets necessitates tedious manual reconfiguration, not to mention the missing portability between different production plants. Unlike this, we propose a declarative approach based on Answer Set Programming to optimize the routes taken by automated guided vehicles for accomplishing transport tasks. The advantages include a transparent and executable problem formalization, provable optimality of routes relative to objective criteria, as well as elaboration tolerance towards particular factory layouts and production targets. Moreover, we demonstrate that our approach is efficient enough to deal with the transport tasks evolving in realistic production processes at the car factory of Mercedes-Benz Ludwigsfelde GmbH.","authors":["Martin Gebser","PHILIPP OBERMEIER","Torsten Schaub","Michel Ratsch-Heitmann"],"meta":["July 2018Theory and Practice of Logic Programming 18(3-4):520-534","DOI:10.1017/S1471068418000182"],"references":["318829408_Generalized_Target_Assignment_and_Path_Finding_Using_Answer_Set_Programming","280104857_Planning_as_Tabled_Logic_Programming","276005972_Answer_Set_Solving_in_Practice","221604402_Adding_Time_and_Intervals_to_Procedural_and_Hierarchical_Control_Specifications","220543188_PDDL21_An_extension_to_PDDL_for_expressing_temporal_planning_domains","316965339_Declarative_encodings_of_acyclicity_properties","316949002_Enhancing_symbolic_system_synthesis_through_ASPmT_with_partial_assignment_evaluation","316921532_Clingcon_The_Next_Generation","251470849_Chapter_12_Temporal_Representation_and_Reasoning"]}