{"id":"326905824_NumaMMA_NUMA_MeMory_Analyzer","abstract":"Non Uniform Memory Access (NUMA) architectures are nowadays common for running High-Performance Computing (HPC) applications. In such architectures, several distinct physical memories are assembled to create a single shared memory. Nevertheless, because there are several physical memories, access times to these memories are not uniform depending on the location of the core performing the memory request and on the location of the target memory. Hence, threads and data placement are crucial to efficiently exploit such architectures. To help in taking decision about this placement, profiling tools are needed. In this work, we propose NUMA MeMory Analyzer (NumaMMA), a new profiling tool for understanding the memory access patterns of HPC applications. NumaMMA combines efficient collection of memory traces using hardware mechanisms with original visualization means allowing to see how memory access patterns evolve over time. The information reported by NumaMMA allows to understand the nature of these access patterns inside each object allocated by the application. We show how NumaMMA can help understanding the memory patterns of several HPC applications in order to optimize them and get speedups up to 28% over the standard non optimized version.","authors":["François Trahay","Manuel Selva","Lionel Morel","Kevin Marquet"],"meta":["August 2018","DOI:10.1145/3225058.3225094","Conference: the 47th International Conference","Project: NumaMMA"],"references":["311481319_Affinity-Based_Thread_and_Data_Mapping_in_Shared_Memory_Systems","320789663_RTHMS_a_tool_for_data_placement_on_hybrid_memory_system","317486614_RTHMS_a_tool_for_data_placement_on_hybrid_memory_system","317394147_Optimizing_memory_affinity_with_a_hybrid_compilerOS_approach","317193947_Quantitative_Evaluation_of_Intel_PEBS_Overhead_for_Online_System-Noise_Analysis","313543916_A_Tool_to_Detect_Performance_Problems_of_Multi-threaded_Programs_on_NUMA_Systems","312568592_numap_A_portable_library_for_low-level_memory_profiling","309061679_Hardware-Assisted_Thread_and_Data_Mapping_in_Hierarchical_Multicore_Architectures","304552143_ScaAnalyzer_a_tool_to_identify_memory_scalability_bottlenecks_in_parallel_programs","284785209_Challenges_of_Memory_Management_on_Modern_NUMA_Systems"]}