{"id":"326999572_Automated_Analysis_of_Cognitive_Presence_in_Online_Discussions_Written_in_Portuguese","abstract":"This paper presents a method for automated content analysis of students’ messages in asynchronous discussions written in Portuguese. In particular, the paper looks at the problem of coding discussion transcripts for the levels of cognitive presence, a key construct in a widely used Community of Inquiry model of online learning. Although there are techniques to coding for cognitive presence in the English language, the literature is still poor in methods for others languages, such as Portuguese. The proposed method uses a set of 87 different features to create a random forest classifier to automatically extract the cognitive phases. The model developed reached Cohen’s κκ\\kappa of .72, which represents a “substantial” agreement, and it is above the Cohen’s κκ\\kappa threshold of .70, commonly used in the literature for determining a reliable quantitative content analysis. This paper also provides some theoretical insights into the nature of cognitive presence by looking at the classification features that were most relevant for distinguishing between the different phases of cognitive presence.","authors":["Valter Neto","Vitor Rolim","Rafael Ferreira","Vitomir Kovanovic"],"meta":["September 2018","DOI:10.1007/978-3-319-98572-5_19","Conference: Thirteenth European Conference on Technology Enhanced Learning (EC-TEL 2018)At: Leeds, UK","Project: Learning analytics assessment of cognitive presence"],"references":["312846891_Piecing_the_Learning_Analytics_Puzzle_A_Consolidated_Model_of_a_Field_of_Research_and_Practice","305386496_Scikit-Iearn_Machine_learning_in_python","283463324_Structure_Matters_Adoption_of_Structured_Classification_Approach_in_the_Context_of_Cognitive_Presence_Classification","283463233_Learning_Analytics_for_Communities_of_Inquiry","283463126_Towards_Automated_Content_Analysis_of_Discussion_Transcripts_A_Cognitive_Presence_Case","324307358_Thinking_in_Education","306284143_The_General_Inquirer_A_Computer_Approach_to_Content_Analysis","306146231_From_word_embeddings_to_document_distances","288906520_Random_forests","286069528_Automated_evaluation_of_text_and_discourse_with_Coh-Metrix"]}