{"id":"326966670_IT_and_tourism_still_a_hot_topic_but_do_not_forget_IT","abstract":"More and more aspects of our life “move” to the Web. The Web and the Internet, as the underlying information infrastructure and “machine”, can be considered as a mirror of the “real” physical world. However, the Web is not only reflecting this world, it is obviously also transforming it, where it is increasingly hard to distinguish between the physical and the virtual. It acts both as an enabler and driver of new, technical, economic and societal developments. With recent achievements in areas such as machine learning, Internet of Things or artificial intelligence (or rather intelligent assistance—a probably more appropriate term), we see the power of computer science. In this short comment, we argue that IT and tourism is still a hot topic, also or especially from a scientific point of view. However, from this latter point of view this might change, and we claim that, in order to prevent the field from becoming insignificant, more emphasis must be put on technical and formal aspects of science. We do not know the future, we are not “futurologists” (In a marketing note of an innovation and technology conference, the organizers even wanted to provide a look beyond the future—we have no idea how this nonsense could be done!), but we take the freedom to highlight some issues, which we consider to be important—in particular since one of the authors has a background of driving the field for nearly 30 years.","authors":["Julia Neidhardt","H. Werthner"],"meta":["December 2018Information Technology & Tourism 20(4)","DOI:10.1007/s40558-018-0115-x"],"references":["288520753_Life_in_the_network_The_coming_age_of_computational_social_science","273518869_Future_research_issues_in_IT_and_tourism","243772913_Information_Technology_and_Tourism_A_Challenging_Relation","222696021_Progress_in_Information_Technology_and_Tourism_Management_20_Years_on_and_10_Years_After_the_Internet-The_State_of_eTourism_Research","285070096_Strategic_E-Tourism_Alternatives_for_Destinations","233655607_The_Journal_of_Information_Technology_Tourism_A_Content_Analysis_of_the_Past_10_Years","220425044_Technology_strategy_and_management_-_The_puzzle_of_Apple","220421353_E-commerce_and_tourism","220420334_Technology_strategy_and_managementThe_evolution_of_platform_thinking"]}