{"id":"326918417_Symmetry-adapted_representation_learning","abstract":"In this paper, we propose the use of data symmetries, in the sense of equivalences under signal transformations, as priors for learning symmetry-adapted data representations, i.e., representations that are equivariant to these transformations. We rely on a group-theoretic definition of equivariance and provide conditions for enforcing a learned representation, for example the weights in a neural network layer or the atoms in a dictionary, to have the structure of a group and specifically the group structure in the distribution of the input. By reducing the analysis of generic group symmetries to permutation symmetries, we devise a regularization scheme for representation learning algorithm, using an unlabeled training set. The proposed regularization is aimed to be a conceptual, theoretical and computational proof of concept for symmetry-adapted representation learning, where the learned data representations are equivariant or invariant to transformations, without explicit knowledge of the underlying symmetries in the data.","authors":["Fabio Anselmi","Georgios Evangelopoulos","Lorenzo Rosasco","Tomaso A. Poggio"],"meta":["August 2018Pattern Recognition 86","DOI:10.1016/j.patcog.2018.07.025"],"references":["320648809_Robust_Plackett-Luce_model_for_k-ary_crowdsourced_preferences","301854555_Group_Equivariant_Convolutional_Networks","280490715_Discriminative_Template_Learning_in_Group-Convolutional_Networks_for_Invariant_Speech_Representations","271425238_Combining_time-_and_frequency-domain_convolution_in_convolutional_neural_network-based_phone_recognition","328520627_Emergence_of_Invariance_and_Disentanglement_in_Deep_Representations","308846657_Understanding_image_representations_by_measuring_their_equivariance_and_equivalence","290012411_Deep_symmetry_networks","281139622_Unsupervised_learning_of_invariant_representations","277895449_Spatial_Transformer_Networks","261226002_Rotation_Scaling_and_Deformation_Invariant_Scattering_for_Texture_Discrimination"]}