{"id":"326900596_An_Analysis_of_Teachers'_Strategies_in_Conducting_Speaking_Assessments_at_MTSN_Andalan_Pekanbaru","abstract":"Teaching speaking is an important part in the language teaching, as well as the assessing speaking. Therefore, teachers need to use some strategies in conducting the assessing speaking. Based on that issue, this research was aimed at exploring teachers’ strategies in assessing speaking skill. To explore the problems, case study with a qualitative approach was adopted. This research employed observation, questionnaire and interview in collecting the data and involved five teachers from MTsNAndalanPekanbaru. The collected data were analyzed by using flow data analysis process of Miles &Huberman (1994). The findings revealed that teachers apply the strategy of conducting the speaking assessment in the classroom which are started from the way they identify current status of classroom speaking assessment, the purpose of their speaking assessment, types speaking assessment, then selecting the teachers’ strategies of speaking assessment and last, teachers’ perceptions of the effectiveness of classroom speaking assessment. In general, teachers implementing some strategies in conducting the speaking assessment. There were discussion and conversation, question and answer, role play, repetition, etc. This research was expected to broaden teachers’ knowledge about strategies in assessing speaking in terms of the purpose and the type of assessment used, then teachers’ perceptions of speaking assessment.","authors":["Andi Idayani","Rugaiyah Rugaiyah"],"meta":["February 2017J-SHMIC Journal of English for Academic 4(1):1","DOI:10.25299/jshmic.2017.vol4(1).502"],"references":["324451568_Educational_Research_Planning_Conducting_and_Evaluating_Quantitative_and_Qualitative_Research_6th_Edition","320353627_Qualitative_research_design_An_interactive_approach","240314226_The_Impact_of_Classroom_Evaluation_Practices_on_Students","343900589_Teaching_ESLEFL_Listening_and_Speaking","274998135_Teaching_the_Spoken_Language","254581294_Dictionary_of_Language_Testing","240273373_Teaching_by_Principles_An_Interactive_Approach_to_Language_Pedagogy","239059574_Fundamental_Considerations_in_Language_Testing","237469231_A_Developmental_Approach_to_Assessment_of_Young_Children","234627934_Alternative_Assessment_Responses_to_Commonly_Asked_Questions"]}