{"id":"326989092_A_Comparative_Illustration_of_Foundational_Ontologies_BORO_and_UFO","abstract":"This paper investigates the differences that exist between a 3D and a 4D ontology. We examine these differences by comparing both ontologies through the metaphysical choices each ontology makes and explore the composing characteristics that define them. More specifically, the differences between the ontologies were illustrated through several modeling fragments that were derived from a modeling case presented at the 5 th OntoCom workshop. Each of these modeling fragments focused on the metaphysical choices that the ontologies make-Essence and Identity, Relationships and Time. These comparisons highlighted the different ontological approaches and structures that exist between the ontologies. Moreover, depending on the ontology, the resulting conceptual model could differ substantially, confirming the impact and importance of the choice of a certain ontology. The observed differences between both ontologies eventually led us to formulate three discussion points that question the applicability of certain metaphysical choices in certain circumstances, and that can serve as a basis for future discussion or future research studies in the domain of ODCM.","authors":["Michaël Verdonck","Tiago Prince Sales","Frederik Gailly"],"meta":["September 2018","Conference: 6th International Workshop on Ontologies and Conceptual Modeling (Onto.Com)At: Cape Town, South Africa","Project: Ontology-driven conceptual modeling"],"references":["300141913_Improving_Model_Quality_Through_Foundational_Ontologies_Two_Contrasting_Approaches_to_the_Representation_of_Roles","285926489_Towards_Ontological_Foundations_for_Conceptual_Modeling_The_Unified_Foundational_Ontology_UFO_Story","295892142_BORO_as_a_Foundation_to_Enterprise_Ontology","283985872_The_Oxford_companion_to_philosophy","283925025_Maintaining_Knowledge_about_Temporal_Intervals","269916094_On_The_Plurality_of_Worlds","234797263_Business_objects_re-engineering_for_re-use","233600623_Ontological_Aspects_of_Information_Modeling","231831456_IEEE_standard_upper_ontology_A_progress_report","229741860_On_the_ontological_expressiveness_of_information_systems_analysis_and_design_grammars"]}