{"id":"326926541_Supervised_ECG_Interval_Segmentation_Using_LSTM_Neural_Network","abstract":"Segmenting electrocardiogram (ECG) into its important components is crucial to the field of cardiology and pharmaceutical studies, because analyses of ECG segments can be used to predict heart symptoms and the effects of cardiac medications. For each study, thousands of ECG signal points need to be analyzed and segmented. Despite of the success of using deep learning (DL) methods in multiple studies on classifying the heart condition, there are still lacking DL-based methods to characterize ECG temporal features. This paper describes a novel ECG segmentation method based on the recurrent neural network (RNN) with long short-term memory (LSTM) layers. In this model, each ECG sample is classified into one of the four categories: P-wave, QRS-wave, T-wave, and neutral (others). Our work shows that DL sequence learning methods outperform a traditional Markov model in terms of accuracy and using simple local features instead of complicated features, such as wavelet encoding. Particularly on T-wave segmentation, our approach can achieve an accuracy of 90%, compared to that of 74.2% using Markov models.","authors":["Hedayat Abrishami"],"meta":["August 2018","Conference: Int'l Conf. Bioinformatics and Computational BiologyAt: Las Vegas, NV"],"references":["285493884_Convolutional_Neural_Networks_for_Patient-Specific_ECG_Classification","254051289_Time_plane_ECG_feature_extraction_using_Hilbert_transform_variable_threshold_and_slope_reversal_approach","226679477_Emission_Modelling_for_Supervised_ECG_Segmentation_using_Finite_Differences","221619492_Markov_Models_for_Automated_ECG_Interval_Analysis","313820658_Comparative_study_of_algorithms_for_ECG_segmentation","313624280_Pilot_Study_Analyzing_Automated_ECG_Screening_of_Hypertrophic_Cardiomyopathy","309008641_Long_Short-Term_Memory_based_Convolutional_Recurrent_Neural_Networks_for_Large_Vocabulary_Speech_Recognition","269935079_Adam_A_Method_for_Stochastic_Optimization","264086561_Real-time_Electrocardiogram_P-QRS-T_Detection-Delineation_Algorithm_Based_on_Quality-Supported_Analysis_of_Characteristic_Templates","260010747_Automated_analysis_of_ECG_waveforms_with_atypical_QRS_complex_morphologies"]}