{"id":"326918081_Towards_an_Analysis_of_Program_Complexity_From_a_Cognitive_Perspective","abstract":"Instructional designers, examiners, and researchers frequently need to assess the complexity of computer programs in their work. However, there is a dearth of established methodologies for assessing the complexity of a program from a learning point of view. In this article, we explore theories and methods for describing programs in terms of the demands they place on human cognition. More specifically, we draw on Cognitive Load Theory and the Model of Hierarchical Complexity in order to extend Soloway's plan-based analysis of programs and apply it at a fine level of granularity. The resulting framework of Cognitive Complexity of Computer Programs~(CCCP) generates metrics for two aspects of a program: plan depth and maximal plan interactivity. Plan depth reflects the overall complexity of the cognitive schemas that are required for reasoning about the program, and maximal plan interactivity reflects the complexity of interactions between schemas that arise from program composition. Using a number of short programs as case studies, we apply the CCCP to illustrate why one program or construct is more complex than another, to identify dependencies between constructs that a novice programmer needs to learn and to contrast the complexity of different strategies for program composition. Finally, we highlight some areas in computing education and computing education research in which the CCCP could be applied and discuss the upcoming work to validate and refine the CCCP and associated methodology beyond this initial exploration.","authors":["Rodrigo Silva Duran","Juha Sorva","Sofia Leite"],"meta":["August 2018","DOI:10.1145/3230977.3230986","Conference: the 2018 ACM Conference","Project: Cognitive Complexity of Computer Programs"],"references":["323331341_A_Systematic_Review_of_the_Use_of_Bloom's_Taxonomy_in_Computer_Science_Education","322879255_Developing_Assessments_to_Determine_Mastery_of_Programming_Fundamentals","315906988_Differentiating_Different_Types_of_Cognitive_Load_a_Comparison_of_Different_Measures","345686561_Ten_Steps_to_Complex_Learning_A_Systematic_Approach_to_Four-Component_Instructional_Design","326796699_Ten_Steps_to_Complex_Learning_A_Systematic_Approach_to_Four-Component_Instructional_Design","325670141_Access_to_Information_in_Working_Memory_Exploring_the_Focus_of_Attention","320850142_Designing_a_multi-faceted_SOLO_taxonomy_to_track_program_design_skills_through_an_entire_course","319134131_K-8_Learning_Trajectories_Derived_from_Research_Literature_Sequence_Repetition_Conditionals","318913212_Sometimes_Rainfall_Accumulates_Talk-Alouds_with_Novice_Functional_Programmers","318035766_Syntax_Predicates_Idioms_-_What_Really_Affects_Code_Complexity"]}