{"id":"326986921_Using_Technology_to_Support_Teaching_Computer_Science_A_Study_with_Middle_School_Students","abstract":"Expansion of computer science education in K-12 schools is driving the need for quality computer science teachers. Effective computer science teachers need both knowledge of computer science and pedagogical content knowledge (PCK), which includes an understanding of student misconceptions. In this study, by integrating an automated assessment system, we identified common misconceptions of Chinese middle school students in an introductory programming course. We found that students’ limited English ability and existing math knowledge contributed to their misconceptions in learning to program. We also noted that Chinese students with better English ability made fewer programming mistakes. This finding differs from previous studies on English speakers that found that students’ English ability had negative impacts on the learning of programming commands. Our results suggest that computer science teachers should integrate appropriate technology into instruction to support identifying and addressing specific student misconceptions. We recommend that teacher training programs in computer science pay attention to developing teachers’ technological pedagogical content knowledge (TPACK), the knowledge for effective teaching with technology.","authors":["Yizhou Qian","James D. Lehman"],"meta":["August 2018Eurasia Journal of Mathematics, Science and Technology Education 14(12)","DOI:10.29333/ejmste/94227"],"references":["321505356_What_is_Technological_Pedagogical_Content_Knowledge_TPACK","320679287_Students'_Misconceptions_and_Other_Difficulties_in_Introductory_Programming_A_Literature_Review","317826860_Behavioural_Intention_and_Pre-Service_Mathematics_Teachers'_Technological_Pedagogical_Content_Knowledge","309086464_Measuring_computer_science_pedagogical_content_knowledge_An_exploratory_analysis_of_teaching_vignettes_to_measure_teacher_knowledge","303939858_An_Effective_Approach_to_Enhancing_Compiler_Error_Messages","320007511_Exploring_In-_and_Pre-Service_Science_and_Mathematics_Teachers'_Technology_Pedagogy_and_Content_Knowledge_TPACK_What_Next","317223917_Novice_Java_Programming_Mistakes_Large-Scale_Data_vs_Educator_Beliefs","316799068_Modelling_Learners_and_Learning_in_Science_Education","311489140_Modernizing_Plan-Composition_Studies","302944837_Misconceptions_and_attitudes_that_infere_with_learning_to_program"]}