{"id":"326993207_Analytical_Reduction_of_Nonlinear_Metabolic_Networks_Accounting_for_Dynamics_in_Enzymatic_Reactions","abstract":"Metabolic modeling has been particularly efficient to understand the conditions affecting the metabolism of an organism. But so far, metabolic models have mainly considered static situations, assuming balanced growth. Some organisms are always far from equilibrium, and metabolic modeling must account for their dynamics. This leads to high-dimensional models in which metabolic fluxes are no more constant but vary depending on the intracellular concentrations. Such metabolic models must be reduced and simplified so that they can be calibrated and analyzed. Reducing these models of large dimension down to a model of smaller dimension is very challenging, specially, when dealing with nonlinear metabolic rates. Here, we propose a rigorous approach to reduce metabolic models using quasi-steady-state reduction based on Tikhonov’s theorem, with a characterized and bounded reduction error. We assume that the metabolic network can be represented with Michaelis-Menten enzymatic reactions that evolve at different time scales. In this simplest approach, some metabolites can accumulate. We consider the case with a continuous varying input in the model, such as light for microalgae, so that the system is never at a steady state. Furthermore, our analysis proves that metabolites in the slow part of the metabolic system reach higher concentrations (by one order of magnitude) than metabolites in the fast part under some flux conditions. A simple example illustrates our approach and the resulting accuracy of the reduction method.","authors":["Claudia López Zazueta","Olivier Bernard","Jean-Luc Gouze"],"meta":["August 2018Complexity 2018(6):1-22","DOI:10.1155/2018/2342650"],"references":["289706368_Effects_of_quasi-steady-state_reduction_on_biophysical_models_with_oscillations","264553106_DRUM_A_New_Framework_for_Metabolic_Modeling_under_Non-Balanced_Growth_Application_to_the_Carbon_Metabolism_of_Unicellular_Microalgae","299382432_Reply_to_the_Comment_on_Mathematical_modeling_of_unicellular_microalgae_and_cyanobacteria_metabolism_for_biofuel_production_by_Baroukh_et_al_Curr_Opin_Biotechnol_2015_33198-205","274264352_Mathematical_modeling_of_unicellular_microalgae_and_cyanobacteria_metabolism_for_biofuel_production","266011779_Differential_equations_and_dynamical_systems_to_appear_3rd_ed","265907594_Nonlinear_Time_Scale_Systems_in_Standard_and_Nonstandard_Forms_Analysis_and_Control","265438572_Singular_perturbation_methods_in_control_Analysis_and_design","264266586_Metabolic_Engineering","257591506_Computing_quasi-steady_state_reductions","256227331_On_systems_of_ordinary_differential_equations_with_several_parameters_multiplying_the_derivatives"]}