{"id":"326920508_Functional_principles_of_early_time_measurement_at_Stonehenge_and_Nebra","abstract":"The world-famous Neolithic circle of Stonehenge might possibly have been used as a precise open-air lunisolar calendar over thousands of years. The Nebra Sky Disc, dating from the Bronze Age, and 1500 years later in age, offers surprisingly the same constructional features and characteristics. In this study, it is emphasised that Stonehenge and the Nebra Sky Disc served as lunisolar calendars based on an 18.6 yr cycle, made possible by the observation of the motion of the northern lunar standstills solely. With both calendarsystems, solar and lunar eclipses could be predicted precisely on the day — more than 5000 years ago. With this study, a solution of the enigma about the astronomical function principles of henge architectures in the British Isles is discussed. The functional principles of the lunisolar calendars are similar to a modern computer: the moon serves as an impulse generator (processor), the circular arrangement of posts memorises data and an algorithm in a form of a software or calendar is performed with simple equipment. The Nebra Sky Disc could possibly be referred to as a portable and progressed laptop version of this computer.\nKey words – Stonehenge, lunisolar calendar, henge, Nebra Sky Disc, computer science, archaeoastronomy, lunar standstills, Neolithic, Bronze Age, Woodhenge, Avebury","authors":["Friedel Herten","Georg Waldmann"],"meta":["August 2018","Project: Archaeastronomy"],"references":["278681176_Calendars_and_Astronomy","278680948_Stonehenge_and_its_Landscape","270915633_Prediction_of_Eclipses","249350610_An_Attempt_to_Ascertain_the_Date_of_the_Original_Construction_of_Stonehenge_from_Its_Orientation","242862861_Astronomically-oriented_markings_on_Stonehenge","241461254_Astronomische_Deutung_der_Himmelsscheibe_von_Nebra","241436310_The_General_and_the_Specific_Dealing_with_Cultural_Diversity","234508968_Science_and_Society_in_Prehistoric_Britain","234484493_Eclipse_Cycles_and_Eclipses_at_Stonehenge","234474365_Stonehenge_A_Neolithic_Computer"]}