{"id":"326902886_Diode_fibres_for_fabric-based_optical_communications","abstract":"Semiconductor diodes are basic building blocks of modern computation, communications and sensing1. As such, incorporating them into textile-grade fibres can increase fabric capabilities and functions2, to encompass, for example, fabric-based communications or physiological monitoring. However, processing challenges have so far precluded the realization of semiconducting diodes of high quality in thermally drawn fibres. Here we demonstrate a scalable thermal drawing process of electrically connected diode fibres. We begin by constructing a macroscopic preform that hosts discrete diodes internal to the structure alongside hollow channels through which conducting copper or tungsten wires are fed. As the preform is heated and drawn into a fibre, the conducting wires approach the diodes until they make electrical contact, resulting in hundreds of diodes connected in parallel inside a single fibre. Two types of in-fibre device are realized: light-emitting and photodetecting p-i-n diodes. An inter-device spacing smaller than 20 centimetres is achieved, as well as light collimation and focusing by a lens designed in the fibre cladding. Diode fibres maintain performance throughout ten machine-wash cycles, indicating the relevance of this approach to apparel applications. To demonstrate the utility of this approach, a three-megahertz bi-directional optical communication link is established between two fabrics containing receiver-emitter fibres. Finally, heart-rate measurements with the diodes indicate their potential for implementation in all-fabric physiological-status monitoring systems. Our approach provides a path to realizing ever more sophisticated functions in fibres, presenting the prospect of a fibre 'Moore's law' analogue through the increase of device density and function in thermally drawn textile-ready fibres.","authors":["Michael Rein","Valentine Dominique Favrod","Chong Hou","Tural Khudiyev"],"meta":["August 2018Nature 560(7717)","DOI:10.1038/s41586-018-0390-x"],"references":["308906293_Self-assembled_fibre_optoelectronics_with_discrete_translational_symmetry","281701420_Multimaterial_Fibers","271140158_Multifunctional_fibers_for_simultaneous_optical_electrical_and_chemical_interrogation_of_neural_circuits_in_vivo","350441793_Principles_of_Solar_Cells_LEDs_and_Diodes_The_role_of_the_PN_junction_KitaiPrinciples_of_Solar_Cells_LEDs_and_Diodes_The_role_of_the_PN_junction","327399749_Principles_of_Solar_Cells_LEDs_and_Related_Devices_The_Role_of_the_PN_Junction","316659669_Glassy_Semiconductors","282742965_Integration_of_micro-electronics_with_yarns_for_smart_textiles","282534033_High_Luminance_Fiber-Based_Polymer_Light-Emitting_Devices_by_a_Dip-Coating_Method","275029499_Principles_of_LED_Light_Communications_Towards_Networked_Li-Fi","274407184_A_colour-tunable_weavable_fibre-shaped_polymer_light-emitting_electrochemical_cell","268021371_Optical_control_of_insulin_release_using_a_photoswitchable_sulfonylurea","263741051_Wearable_Electronics_and_Smart_Textiles_A_Critical_Review","234952806_Fiber_based_organic_photovoltaic_devices","257953839_Fabrication_and_characterization_of_thermally_drawn_fiber_capacitors","231742280_All-in-Fiber_Chemical_Sensing"]}