{"id":"327085273_Enhanced_Network_Anomaly_Detection_Based_on_Deep_Neural_Networks","abstract":"Due to the monumental growth of Internet applications in last decade, the need for security of information network has increased manifolds. As a primary defense of network infrastructure, an Intrusion Detection System is expected to adapt to dynamically changing threat landscape. Many supervised and unsupervised techniques have been devised by researchers from the discipline of machine learning and data mining to achieve reliable detection of anomalies. Deep learning is an area of Machine Learning which applies neuron-like structure for learning tasks. Deep learning has profoundly changed the way we approach learning tasks by delivering monumental progress in different disciplines like Speech Processing, Computer Vision and Natural Language Processing to name a few. It is only relevant that this new technology must be investigated for information security applications. The aim of this article is to investigate the suitability of Deep learning approaches for anomaly-based intrusion detection system. For this study, we developed anomaly detection models based on different deep neural network structures including Convolutional Neural Networks, Autoencoders and Recurrent Neural Networks. These deep models were trained on NSLKDD training dataset and evaluated on both test datasets provided by NSLKDD namely NSLKDDTest+ and NSLKDDTest21. All experiments in this study are performed by authors on a GPU-based test bed. Conventional Machine Learning based intrusion detection models were implemented using well-known classification techniques including Extreme Learning Machine, Nearest Neighbor, Decision-Tree, Random-Forest, Support Vector Machine, Naive-Bays, and Quadratic Discriminant Analysis. Both deep and conventional Machine Learning models were evaluated using well-known classification metrics including, Receiver Operating Characteristics, Area under Curve, Precision-Recall Curve, mean average precision and accuracy of classification. Experimental results of deep IDS models showed promising results for real-world application in anomaly detection systems. OAPA","authors":["Sheraz Naseer","Dr. Yasir Saleem","Shehzad Khalid","Mr Khawar"],"meta":["August 2018IEEE Access 6:1-1","DOI:10.1109/ACCESS.2018.2863036"],"references":["323973146_Botnet_Command_and_Control_Traffic_Detection_Challenges_A_Correlation_based_Solution","315695819_Collective_Anomaly_Detection_based_on_Long_Short_Term_Memory_Recurrent_Neural_Network","315469263_Method_of_intrusion_detection_using_deep_neural_network","312201249_Fuzzy_based_multi-criteria_vertical_handover_decision_modeling_in_heterogeneous_wireless_networks","312170608_Shallow_and_Deep_Networks_Intrusion_Detection_System_A_Taxonomy_and_Survey","342232632_Extreme_Learning_Machine_Theory_and_Applications","319899509_Towards_Designing_Efficient_Lightweight_Ciphers_for_Internet_of_Things","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313316525_Dynamic_Clustering_and_Management_of_Mobile_Wireless_Sensor_Networks"]}