{"id":"327007491_Distributionally_robust_single_machine_scheduling_with_the_total_tardiness_criterion","abstract":"This paper proposes a distributionally robust optimization (DRO) model for single machine scheduling with uncertain processing times. The processing time of each job is assumed to be an unknown random variable within a given distributional set, which is described by mean and variance information. The proposed DRO model aims to find an optimal sequence that minimizes the expected worst-case total tardiness. To the best of our knowledge, it is the first time in the relevant literature that a DRO approach is adopted to minimize the total tardiness criterion for machine scheduling. An explicit expression is derived as an upper bound approximation for the robust objective, and then we transform the DRO problem into a mixed integer second-order cone programming problem. To solve this problem, a branch-and-bound algorithm with several novel bounding procedures and dominance rules is designed. Computational experiments confirm that the bounding procedures and dominance rules contribute significantly to the algorithm's efficiency, and problem instances with up to 30 jobs can be optimally solved within 40 s. To tackle large-scale problem instances, we further design a beam search algorithm with filtering and recovering phases. Additional experiments with instances beyond 30 jobs confirm the efficacy of this beam search algorithm. To test the effectiveness of the proposed DRO model, we compare the robust sequences to nominal sequences under different processing time distributions. Experimental results show that the robust sequences perform better than nominal sequences, especially when the due dates are relatively loose.","authors":["Shengsheng Niu","Shiji Song","Jian-Ya Ding","Yuli Zhang"],"meta":["August 2018Computers & Operations Research 101","DOI:10.1016/j.cor.2018.08.007"],"references":["328711541_Exact_Algorithms_for_Distributionally_b_-Robust_Machine_Scheduling_with_Uncertain_Processing_Times"]}