{"id":"327024138_Temporal_walk_based_centrality_metric_for_graph_streams","abstract":"A plethora of centrality measures or rankings have been proposed to account for the importance of the nodes of a network.\nIn the seminal study of Boldi and Vigna (2014), the comparative evaluation of centrality measures was termed a difficult, arduous task.\nIn networks with fast dynamics, such as the Twitter mention or retweet graphs, predicting emerging centrality is even more challenging.\n\nOur main result is a new, temporal walk based dynamic centrality measure that models temporal information propagation by considering the order of edge creation. \nDynamic centrality measures have already started to emerge in publications; however, their empirical evaluation is limited. \nOne of our main contributions is creating a quantitative experiment to assess temporal centrality metrics.\nIn this experiment, our new measure outperforms graph snapshot based static and other recently proposed dynamic centrality measures in assigning the highest time-aware centrality to the actually relevant nodes of the network.\nAdditional experiments over different data sets show that our method perform well for detecting concept drift in the process that generates the graphs.","authors":["Ferenc Béres","Róbert Pálovics","Anna Oláh","András A. Benczúr"],"meta":["August 2018Applied Network Science 3(1)","DOI:10.1007/s41109-018-0080-5"],"references":["318430316_Ego-betweenness_centrality_in_link_streams","308994155_LEMP_Fast_Retrieval_of_Large_Entries_in_a_Matrix_Product","279864378_Eigenvector-Based_Centrality_Measures_for_Temporal_Networks","307584537_Temporal_PageRank","300141143_Temporal_PageRank_on_Social_Networks","299970591_Efficient_PageRank_Tracking_in_Evolving_Networks","289666460_Computing_Personalized_PageRank_Based_on_Temporal-Biased_Proximity","283226284_Incremental_iteration_method_for_fast_PageRank_computation","272199060_Betweenness_in_time_dependent_networks","262282224_Fast_incremental_and_personalized_PageRank"]}