{"id":"327093313_Quality_of_Experience_Framework_for_Cloud_Computing_QoC","abstract":"Cloud computing provides platform for pay per use services such as software, hardware and platforms. Previous cloud frameworks use fix policies that do not have the functionality to upgrade services on demand when the user do not receive services according to Service Level Agreement (SLA). Also, there was a lack of functionality to monitor external network and client device resources. This paper presents Quality of experience framework for Cloud computing (QoC) for monitoring the Quality of Experience (QoE) of the end user using video streaming services in the cloud computing environment. The management platform is used for administration purpose in QoC framework that provides facility to easily manage the cloud environment and provide services according to SLA via runtime policy change. The objective QoE/QoS section will automatically monitor the Quality of Service (QoS) data. It will also compare and analyze the subjective QoE submitted by the users and objective QoS data collected by agent based framework for accurate QoE prediction and proper management. The proposed QoC framework has new features of real time network monitoring, client device monitoring and allows changing policy in runtime environment which to our knowledge is currently not provided by existing frameworks.","authors":["Asif Ali Laghari","Hui He","Asiya Khan","Neetesh Kumar"],"meta":["November 2018IEEE Access 6(1):64876-64890","DOI:10.1109/ACCESS.2018.2865967","Project: Monitoring Quality of Experience in Cloud Computing "],"references":["326387801_Assessment_of_quality_of_experience_QoE_of_image_compression_in_social_cloud_computing","324653339_Enabling_Green_Computing_in_Cloud_Environments_Network_Virtualization_Approach_Towards_5G_Support","322082467_Quality_of_Experience_Assessment_of_Video_Quality_in_Social_Clouds","322004552_Impact_of_storage_of_mobile_on_quality_of_experience_QoE_at_user_level_accessing_cloud","316899601_Assessing_effect_of_Cloud_distance_on_end_user's_Quality_of_Experience_QoE","315888326_Automatic_Network_Policy_Change_on_the_Basis_of_Quality_of_Experience_QoE","311901920_Mobile_Cloud_Computing_Energy-aware_Task_Offloading_MCC_ETO","311771195_Recent_advancements_in_resource_allocation_techniques_for_cloud_computing_environment_A_systematic_review","322140788_Towards_Green_Computing_for_Internet_of_Things_Energy_Oriented_Path_and_Message_Scheduling_Approach","317644286_Systematic_Analysis_of_Quality_of_Experience_QoE_Frameworks_for_Multimedia_Services"]}