{"id":"327006804_PHAROS-PHysical_assistant_RObot_system","abstract":"The great demographic change leading to an ageing society demands technological solutions to satisfy the increasing varied elderly needs. This paper presents PHAROS, an interactive robot system that recommends and monitors physical exercises designed for the elderly. The aim of PHAROS is to be a friendly elderly companion that periodically suggests personalised physical activities, promoting healthy living and active ageing. Here, it is presented the PHAROS architecture, components and experimental results. The architecture has three main strands: a Pepper robot, that interacts with the users and records their exercises performance; the Human Exercise Recognition, that uses the Pepper recorded information to classify the exercise performed using Deep Leaning methods; and the Recommender, a smart-decision maker that schedules periodically personalised physical exercises in the users’ agenda. The experimental results show a high accuracy in terms of detecting and classifying the physical exercises (97.35%) done by 7 persons. Furthermore, we have implemented a novel procedure of rating exercises on the recommendation algorithm. It closely follows the users’ health status (poor performance may reveal health problems) and adapts the suggestions to it. The history may be used to access the physical condition of the user, revealing underlying problems that may be impossible to see otherwise.","authors":["Angelo Costa","Ester Martínez","Miguel Cazorla","Vicente Julián"],"meta":["August 2018Sensors 18(8):2633","DOI:10.3390/s18082633","Project: RETOGAR: Retorno al hogar. Sistema de mejora de la autonomía de personas con daño cerebral adquirido y dependientes en su integración en la sociedad"],"references":["305624914_An_autonomous_robotic_exercise_tutor_for_elderly_people","300367316_Hand_Body_Language_Gesture_Recognition_Based_on_Signals_From_Specialized_Glove_and_Machine_Learning_Algorithms","320963917_Realtime_Multi-person_2D_Pose_Estimation_Using_Part_Affinity_Fields","320536344_Novel_Genetic_Ensembles_of_Classifiers_Applied_to_Myocardium_Dysfunction_Recognition_Based_on_ECG_Signals","319770228_Convolutional_Pose_Machines","319665463_Novel_Methodology_of_Cardiac_Health_Recognition_Based_on_ECG_Signals_and_Evolutionary-Neural_System","318694643_Simultaneous_Feature_and_Body-Part_Learning_for_real-time_robot_awareness_of_human_behaviors","307573365_End-user_personalization_of_context-dependent_applications_in_AAL_scenarios","306136808_Advances_and_trends_for_the_development_of_ambient-assisted_living_platforms","286512696_Deep_Residual_Learning_for_Image_Recognition"]}