{"id":"327067893_HVDC_protection_criteria_for_transient_stability_of_AC_systems_with_embedded_HVDC_links","abstract":"In recent years different protection strategies for High Voltage Direct Current (HVDC) grids have been developed by the\nindustry and academia for the reliable and safe operation of\ndirect current grids. The proposed strategies have different impacts on the AC networks where HVDC grids are connected.\nIn the case of embedded HVDC grids embedded in a synchronous AC network, a partial loss of the HVDC grid might\ncause the desynchronization of the AC grid. Therefore, it is\nof utmost importance to assess the impact of those protection\nstrategies into the stability of the whole network. The objective of this paper is to propose a methodology for the transient\nstability assessment of a simple but representative AC grid in\ncase of DC fault. After validation of the methodology, some\nHVDC link protection criteria are defined in terms of the Critical Time to Return to Operation (CTRO). These criteria will be\nhelpful for the design of HVDC protection systems, or for the\nsizing of future HVDC links in order to respect the constraints\nof the existing protection strategies.","authors":["Juan Carlos Gonzalez-Torres","Valentin Costan","Gilney Damm","Abdelkrim Benchaib"],"meta":["July 2018The Journal of Engineering 2018(15)","DOI:10.1049/joe.2018.0264","Projects: Transient stability of high voltage AC-DC electric transmission systemsControl and dispatch of MTDC grids"],"references":["280894715_DCDC_converters_as_DC_circuit-breakers_in_HVDC_networks_operation","317055602_Impact_of_DC_grid_contingencies_on_AC_system_stability","317055378_A_multi-vendor_protection_strategy_for_HVDC_grids_based_on_low-speed_DC_circuit_breakers","305332676_Dynamic_interactions_of_DC_and_AC_grids_subject_to_DC_faults","281458572_Classification_of_Fault_Clearing_Strategies_for_HVDC_Grids","281414167_Power_system_control_and_stability","279366112_Energy_Function_Analysis_for_Power_System_Stability","270792401_Impacts_of_three_MMC-HVDC_configurations_on_AC_system_stability_under_DC_line_faults","258222936_Energy_Function_Analysis_for_Power_System_Stability","233530434_Power_System_Stability_and_Control"]}