{"id":"327032790_Democracy_when_the_people_are_thinking_Revitalizing_our_politics_through_public_deliberation","abstract":"Democracy requires a connection to the “will of the people.” What does that mean in a world of “fake news,” relentless advocacy, dialogue mostly among the like-minded, and massive spending to manipulate public opinion? What kind of opinion can the public have under such conditions? What would democracy be like if the people were really thinking in depth about the policies they must live with? This book argues that “deliberative democracy” is not utopian. It is a practical solution to many of democracy’s ills. It can supplement existing institutions with practical reforms. It can apply at all levels of government and for many different kinds of policy choices. This book speaks to a recurring dilemma: listen to the people and get the angry voices of populism or rely on widely distrusted elites and get policies that seem out of touch with the public’s concerns. Instead, there are methods for getting a representative and thoughtful public voice that is really worth listening to. Democracy is under siege in most countries. Democratic institutions have low approval and face a resurgent threat from authoritarian regimes. Deliberative democracy can provide an antidote. It can reinvigorate our democratic politics. This book draws on the author’s research with many collaborators on “Deliberative Polling”-a process he has conducted in twenty-seven countries on six continents. It contributes both to political theory and to the empirical study of public opinion and participation, and should interest anyone concerned about the future of democracy and how it can be revitalized. © James S. Fishkin 2018 and Part III, Section 2: James S. Fishkin, Thad Kousser, Robert C. Luskin, and Alice Siu and Part III, Section 4: James S. Fishkin, Roy William Mayega, Lynn Atuyambe, Nathan Tumuhamye, Julius Ssentongo, Alice Siu, and William Bazeyo and Part III, Section 5: James S. Fishkin, Robert C. Luskin, and Alice Siu.","authors":["J.S. Fishkin"],"meta":["January 2018","DOI:10.1093/oso/9780198820291.001.0001"],"references":[]}