{"id":"327005495_A_Controlled_Experiment_on_Python_vs_C_for_an_Introductory_Programming_Course_Students'_Outcomes","abstract":"We performed a controlled experiment comparing a C and a Python Introductory Programming course. Three faculty members at University of Campinas, Brazil, taught the same CS1 course for the same majors in two different semesters, one version in Python and one in C, with a total of 391 students involved in the experiment. We measured the dropout rate, the failure rate, the grades on the two exams, the proportion of completed lab assignments, and the number of submissions per completed assignment. There was no difference in the dropout rate. The failure rate for Python was 16.9% against 23.1% for C. The effect size (Cohen’s D) on the comparison of Python against C on the midterm exam was 0.27, and 0.38 for the final exam. The effect size for the proportion of completed assignments was 0.39 and the effect size for the number of submissions per assignment was -0.61 (Python had less submissions per completed assignments). Thus, for all measures, with the exception of dropout rate, the version of the course in Python yielded better student outcomes than the version in C and all differences are significant (with 95% confidence) with the exception of the failure rate (p-value&equals;0.12).","authors":["Jacques Wainer","Eduardo C. Xavier"],"meta":["August 2018ACM Transactions on Computing Education 18(3):1-16","DOI:10.1145/3152894"],"references":["308409950_An_Analysis_of_Introductory_University_Programming_Courses_in_the_UK","299416830_More_Time_or_Better_Tools_A_Large-Scale_Retrospective_Comparison_of_Pedagogical_Approaches_to_Teach_Programming","276044122_The_Effects_of_Objects-First_and_Objects-Late_Methods_on_Achievements_of_OOP_Learners","273188579_Teaching_Introductory_Programming_A_Quantitative_Evaluation_of_Different_Approaches","262267588_Active_Learning_Increases_Student_Performance_in_Science_Engineering_and_Mathematics","305026910_Can_we_enforce_a_benefit_for_dynamically_typed_languages_in_comparison_to_statically_typed_ones_A_controlled_experiment","270757972_On_Effect_Size","269507612_A_Confidence_Interval_for_a_Percentage_Increase","266657039_Failure_rates_in_introductory_programming_revisited","262256894_An_Empirical_Investigation_into_Programming_Language_Syntax"]}