{"id":"327026270_Computational_Thinking_in_K-12_In-service_Teacher_Perceptions_of_Computational_Thinking_Foundations_and_Research_Highlights","abstract":"Computational thinking (CT) has been described as a problem-solving approach that draws from the practices of computer science (CS). Computer science ideas and practices influence multiple domains, from simplifying complex tasks and problems through problem decomposition to using automation to increase the speed and efficiency of solving those problems. Computational thinking is, thus, described as a set of mental skills, a disposition common to most fields, and computer science concepts that can impact those fields decontextualized from programming and hardware. Researchers and educators have worked to integrate CT into multiple subjects in K-12. This takes the form of both identifying instances of CT already being used in existing teacher practices and identifying areas where disciplinary practices can be changed through the latest application of computational tools. This chapter reports the results from a study to examine practicing teachers’ views of CT and how those views compare to how computer science education researchers define CT. Results from this study suggest that teachers’ conceptions of CT include important aspects of the CT literature, yet there are several common misconceptions about CT. We discuss implications of our findings on how to engage non-computing K-12 teachers in computational thinking and develop their competencies to incorporate CT within the context of their subject area. The goal of this discussion is to inform in-service and preservice teacher development efforts and clarify how CT applies to disciplinary knowledge within K-12 education.","authors":["Phil Sands","Aman Yadav","Jon Good"],"meta":["August 2018","DOI:10.1007/978-3-319-93566-9_8","In book: Computational Thinking in the STEM Disciplines (pp.151-164)"],"references":["311425641_Expanding_computer_science_education_in_schools_Understanding_teacher_experiences_and_challenges","303668799_Computational_Thinking_for_All_Pedagogical_Approaches_to_Embedding_21st_Century_Problem_Solving_in_K-12_Classrooms","283155060_Defining_Computational_Thinking_for_Mathematics_and_Science_Classrooms","281065932_America's_Children_Providing_early_exposure_to_STEM_Science_Technology_Engineering_Math_Initiatives","274309848_Computational_Thinking","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","317158625_Remaining_trouble_spots_with_computational_thinking","301463453_Relationships_computational_thinking_pedagogy_of_programming_and_Bloom's_Taxonomy","292937643_Science_technology_engineering_and_mathematics_STEM_education_A_primer","282748526_Integrating_computational_thinking_across_the_K-8_curriculum"]}