{"id":"327005544_Doctoral_students'_well-being_a_literature_review","abstract":"Purpose: Doctoral student well-being is an important matter that shapes the well-being of academics throughout their careers. Given that well-being has been found to be closely related to employee productivity and efficiency, strategies associated with maintaining well-being during PhD studies might be crucial for higher education, its outcomes and—just as importantly—for a balanced life of PhD students.\nMethod: Based on 17 studies, this literature review critically assesses the literature on doctoral student well-being.\nResults: Theoretical models, concepts of well-being, and methods applied are discussed, as are the results of the articles. The reviewed studies are then discussed based on a SWOT analysis addressing the strengths and weaknesses of the reviewed research as well as the identified opportunities and threats, which can be used as a basis for future research. Based on the review findings and the SWOT analysis, a multidimensional view of the well-being of doctoral students is proposed.\nConclusions: The study proposes a more student-centred approach to meeting doctoral students’ needs, and the enhancement of doctoral student well-being in order, as a long-term goal, to improve academics’ well-being and productivity.","authors":["Manuela Schmidt","Erika Hansson"],"meta":["August 2018International Journal of Qualitative Studies on Health and Well-Being 13(1):1508171","DOI:10.1080/17482631.2018.1508171"],"references":["321707475_Researcher_Self-Care_in_Emotionally_Demanding_Research_A_Proposed_Conceptual_Framework","318962713_Prediction_of_the_Dimensions_of_the_Spiritual_Well-Being_of_Students_at_Kermanshah_University_of_Medical_Sciences_Iran_The_Roles_of_Demographic_Variables","315705652_Frequent_visitors_at_the_psychiatric_emergency_room_-_A_literature_review","313083521_Free_traits_and_personal_contexts_Expanding_a_social_ecological_model_of_well-being","345768388_What's_too_much_and_what's_too_little_The_Process_of_Becoming_an_Independent_Researcher_in_Doctoral_Education","321271344_Validation_of_the_quality_in_PhD_processes_questionnaire","320721932_Stages_of_PPP_and_Principal-Agent_Conflicts_The_Swedish_Water_and_Sewerage_Sector","320655419_The_Relationships_between_Doctoral_Students'_Perceptions_of_Supervision_and_Burnout","319278053_Self-Care_in_Clinical_Psychology_Graduate_Training","311929835_The_New_Generation_of_Auditors_Meeting_Praxis_Dual_Learning's_Role_in_Audit_Students'_Professional_Development"]}