{"id":"327076654_The_Enhanced_Hybrid_Algorithm_for_the_AbdulRazzaq_and_Berry-Ravindran_Algorithms","abstract":"Exact string matching is one of the critical issues in the field of computer science. This study proposed a hybrid string matching algorithm called E- AbdulRazzaq. This algorithm used the best properties of two original algorithms; AbdulRazzaq and Berry-Ravindran Algorithms. The proposed algorithm showed an efficient performance in the number of attempts and number of character comparison when compared the original and recent to the standard algorithms. The proposed algorithm was applied in several types of databases, which are DNA sequences, Protein sequences, XML structures, Pitch characters, English texts, and Source codes. The Pitch database was the best match for E-AbdulRazzaq with the number of attempts involving long and short patterns, while the DNA database was the worst match. No data is specified as the best or worst with the E-AbdulRazzaq algorithm in terms of the character comparisons. The E-AbdulRazzaq algorithms ranked first in most databases when using short and long patterns, in terms of number of attempts and character comparisons.","authors":["Atheer Akram Abdulrazzaq","Nur ' Aini","Ahmed Majid Taha"],"meta":["August 2018International Journal of Engineering & Technology 7(3):1709-1717","DOI:10.14419/ijet.v7i3.12436"],"references":["312932122_New_Searching_Technique_of_Hybrid_Exact_String_Matching_Algorithm","312120578_A_New_Efficient_Hybrid_String_Matching_Algorithm_to_Solve_the_Exact_String_Matching_Problem","281863574_A_New_Efficient_Hybrid_Exact_String_Matching_Algorithm_and_Its_Applications","221313820_Suffix_Arrays_on_Words","220693416_Handbook_of_Exact_String_Matching_Algorithms","300111929_Parallel_GPU-Based_Hybrid_String_Matching_Algorithm","238328609_Protein_structure_prediction","224570594_BRQS_Matching_Algorithm_for_Searching_Protein_Sequence_Databases","220715198_A_Fast_Hybrid_Pattern_Matching_Algorithm_for_Biological_Sequences"]}