{"id":"327085142_Integration_of_Spectral_Histogram_and_Level_Set_for_Coastline_Detection_in_SAR_Images","abstract":"This study proposed a novel algorithm for coastline detection in single-polarization synthetic aperture radar (SAR) images based on the local spectral histogram (LSH) and the level set method (LSM). The proposed algorithm includes two main steps. In the processing step, a rough land/sea segmentation is done by utilizing a texture-based segmentation using LSH. In the postprocessing step, the region-based LSM is used to refine the previous segmentation and extract the coastline accurately. The level set (LS) function is initialized using the results of LSH segmentation. This prevents the development of spurious contours, becoming trapped in the local minimum, eliminates the manual support, and also speeds up the LS evolution. A hierarchical LS regularization is proposed using two Gaussian kernels, which is compatible with noisy images and able to detect very narrow regions. The proposed algorithm is able to detect a coastline at the full-resolution of the input SAR image and also is robust to noise. It does not require pre-processing step to reduce speckle. A criterion to quantify the accuracy of the results was also proposed. The experimental results for a number of real high-resolution single-polarization SAR images demonstrate that the proposed method is robust to noise and efficient for coastline detection in different coastal and sea environments.","authors":["Mohammad Modava","Gholamreza Akbarizadeh","Mohammad Soroosh"],"meta":["August 2018IEEE Transactions on Aerospace and Electronic Systems 55(2):810-819","DOI:10.1109/TAES.2018.2865120","Project: Coastline Detection in SAR Images"],"references":["317589916_A_Level_Set_Based_Method_for_Coastline_Detection_of_SAR_Images","311522754_Coastline_Extraction_from_SAR_Images_Using_Spatial_Fuzzy_Clustering_and_the_Active_Contour_Method","283747835_A_Two-Phase_Algorithm_Based_on_Kurtosis_Curvelet_Energy_and_Unsupervised_Spectral_Regression_for_Segmentation_of_SAR_Images","319676481_Full-polarimetric_SAR_measurements_for_coastline_extraction_and_coastal_area_classification","318670932_SAR_Image_Colorization_Converting_Single-Polarization_to_Fully_Polarimetric_Using_Deep_Neural_Networks","315910392_A_Coastline_Detection_Method_in_Polarimetric_SAR_Images_Mixing_the_Region-Based_and_Edge-Based_Active_Contour_Models","310487702_Fronts_propagating_with_curve-dependent_speed_algorithms_based_on_Hamilton-Jacobi_formulations","309965977_Coastline_Detection_in_SAR_Images_Using_a_Hierarchical_Level_Set_Segmentation","303505489_Dual-Polarimetric_C-_and_X-Band_SAR_Data_for_Coastline_Extraction","278789807_Factorization-Based_Texture_Segmentation"]}