{"id":"327099873_Accelerating_Multi-point_Statistics_Reconstruction_Method_for_Porous_Media_via_Deep_Learning","abstract":"Reconstruction of three-dimensional (3D) porous media from a single two-dimensional (2D) image or limited morphological information has been an outstanding problem. Specifically, multi-point statistics (MPS)-based methods have been proved to be effective and promising to address this problem. Besides, recently sampling-based MPS methods that reconstruct 3D microstructure layer by layer have attracted increasing attention, for its relatively lower computational cost and memory demand. However, due to the nature that one has to search and match multi-point information in a data structure like binary tree or list for each simulation, it is very time-consuming, especially for large template used to reconstruct geometrically complex media. In this paper, to overcome this challenge, for the first time to the best of our knowledge, an accelerating reconstruction method based on deep learning is proposed. Specially, conditional generative adversarial networks (CGAN) is leveraged to model and characterize the relation between the sampling image which contains conditioning data and the target void-solid image. Unlike conventional MPS-based method generally performing simulation point by point, our method is able to directly translate the sampling image to the target one instantaneously, thus leading to a significant speedup factor (~760 for 2D reconstruction and ~25 for 3D reconstruction on CPU). Meanwhile, to assess the performance of our method, we test it on sandstone samples, and two-point correlation function, lineal-path function and two-point cluster function, as well as local porosity distribution are quantitatively compared with those of the target microstructure. The comparison indicates that our method is of high efficiency while preserving good agreement of statistical functions with that of the target system. We remark that our approach opens the door to a new methodology that incorporating machine learning/deep learning techniques into conventional methods to address CPU- or memory-demanding issues in a wide range of related fields.","authors":["Junxi Feng","Qizhi Teng","Xiaohai He","Xiaohong Wu"],"meta":["August 2018Acta Materialia 159","DOI:10.1016/j.actamat.2018.08.026","Project: 3D reconstruction and characterization of heterogeneous media via deep learning"],"references":["324557737_Markov_prior-based_block-matching_algorithm_for_superdimension_reconstruction_of_porous_media","323937736_Anisotropic_distribution_of_the_micro_residual_stresses_in_lath_martensite_revealed_by_FIB_ring-core_milling_technique","322729625_Accelerating_Science_with_Generative_Adversarial_Networks_An_Application_to_3D_Particle_Showers_in_Multilayer_Calorimeters","321234208_An_Improved_Method_for_Reconstructing_the_Digital_Core_Model_of_Heterogeneous_Porous_Media","316029770_Reconstruction_of_three-dimensional_porous_media_using_generative_adversarial_neural_networks","323489564_Reconstruction_of_three-dimensional_heterogeneous_media_from_a_single_two-dimensional_section_via_co-occurrence_correlation_function","323298036_Accurate_modeling_and_evaluation_of_microstructures_in_complex_materials","323064560_From_Eyes_to_Face_Synthesis_a_New_Approach_for_Human-Centered_Smart_Surveillance","318223340_HYPPS_A_hybrid_geostatistical_modeling_algorithm_for_subsurface_modeling","312960699_Quantifying_damage_in_polycrystalline_ice_via_X-Ray_computed_micro-tomography"]}