{"id":"327045512_The_quantum_technologies_roadmap_A_European_community_view","abstract":"Within the last two decades, quantum technologies (QT) have made tremendous progress, moving from Nobel Prize award-winning experiments on quantum physics (1997: Chu, Cohen-Tanoudji, Phillips; 2001: Cornell, Ketterle, Wieman; 2005: Hall, Hänsch-, Glauber; 2012: Haroche, Wineland) into a cross-disciplinary field of applied research. Technologies are being developed now that explicitly address individual quantum states and make use of the 'strange' quantum properties, such as superposition and entanglement. The field comprises four domains: quantum communication, where individual or entangled photons are used to transmit data in a provably secure way; quantum simulation, where well-controlled quantum systems are used to reproduce the behaviour of other, less accessible quantum systems; quantum computation, which employs quantum effects to dramatically speed up certain calculations, such as number factoring; and quantum sensing and metrology, where the high sensitivity of coherent quantum systems to external perturbations is exploited to enhance the performance of measurements of physical quantities. In Europe, the QT community has profited from several EC funded coordination projects, which, among other things, have coordinated the creation of a 150-page QT Roadmap (http://qurope.eu/h2020/qtflagship/roadmap2016). This article presents an updated summary of this roadmap.","authors":["Antonio Acín","Immanuel Bloch","Harry Buhrman","Tommaso Calarco"],"meta":["August 2018New Journal of Physics 20(8):080201","DOI:10.1088/1367-2630/aad1ea"],"references":["319122223_A_programmable_two-qubit_quantum_processor_in_silicon","318785268_Unconditional_violation_of_the_shot_noise_limit_in_photonic_quantum_metrology","304226169_Generation_of_one-million-mode_continuous-variable_cluster_state_by_unlimited_time-domain_multiplexing","319683702_Programming_languages_and_compiler_design_for_realistic_quantum_hardware","315921240_Quantum_Cryptography_a_view_from_classical_cryptography","311470621_Certified_randomness_in_quantum_physics","309765980_Quantum_sensing","307916913_The_Quantum_Future_of_Computation","307895525_Detection_of_15_dB_Squeezed_States_of_Light_and_their_Application_for_the_Absolute_Calibration_of_Photoelectric_Quantum_Efficiency","291942453_Simulating_Physics_with_Computers"]}