{"id":"327053772_An_efficient_mechanism_to_generate_dynamic_keys_based_on_genetic_algorithm","abstract":"Sharing information and providing services are the key factors of the computer network. Due to publically in nature of computer network and improvement of various technology in the field of computer science, the chances of hacking and licking the confidentiality of shared messages have increased exponentially. Hence, preventing such possibilities and maintaining the confidentiality over the computer network has become the primary and forth most requirement. According to Shannon's perfect secrecy, the confidentiality of shared information can only be maintained if the size of the key is greater or equal to the length of the message. In this paper, an efficient mechanism has been proposed to establish the initial secret key based on the genetic algorithm (GA) and variable key generation mechanism, which helps to change the keys after selection of the initial key for each new block of data transmission to make the key size as long as the size of the original message. To prove the efficiency of the proposed scheme, a comparative studies with the existing related schemes have also been carried out later in this paper.","authors":["Chukhu Chunka","Rajat Subhra Goswami","Subhasish Banerjee"],"meta":["August 2018Security and Privacy 4(10):e37","DOI:10.1002/spy2.37"],"references":["316534895_An_Approach_to_Generate_Variable_Keys_based_on_Vertical_Horizontal_Mechanism","311424500_An_Overview_of_the_RC4_Algorithm","283571516_An_Approach_to_Generate_2-Dimensional_AVK_to_Enhance_Security_of_Shared_Information","319394459_Artificial_Intelligence","316933107_The_genetic_algorithm_for_image_encryption","306085780_Samir_Kumar_Chatterjee","305801381_A_Novel_Approach_to_Achieve_the_Perfect_Security_through_AVK_over_Insecure_Communication_Channel","301720790_Generation_of_Automatic_Variable_Key_to_Make_Secure_Communication","283571440_Absolute_key_variation_technique_of_automatic_variable_key_in_cryptography","271418845_Genetic_Algorithm_with_elitism_for_cryptanalysis_of_Vigenere_cipher"]}