{"id":"327054654_Identifying_influential_nodes_in_complex_networks_based_on_the_inverse-square_law","abstract":"How to identify influential nodes in complex networks continues to be an open issue. A number of centrality measures have been presented to address this problem. However, these studies focus only on a centrality measure and each centrality measure has its own shortcomings and limitations. To solve problems above, in this paper, a novel method is proposed to identify influential nodes based on the inverse-square law. The mutual attraction between different nodes has been defined in complex network, which is inversely proportional to the square of the distance between two nodes. Then, the definition of intensity of node in a complex network is proposed and described as the sum of attraction between a pair of nodes in the network. The ranking method is presented based on the intensity of node, which can be considered as the influence of the node. In order to illustrate the effectiveness of the proposed method, several experiments are conducted to identify vital nodes simulations on four real networks, and the superiority of the proposed method can be demonstrated by the results of comparison experiments.","authors":["Liguo Fei","Qi Zhang","Yong Deng"],"meta":["August 2018Physica A: Statistical Mechanics and its Applications 512","DOI:10.1016/j.physa.2018.08.135"],"references":["327970870_Generalized_Ordered_Propositions_Fusion_Based_on_Belief_Entropy","325792396_An_enhanced_fuzzy_evidential_DEMATEL_method_with_its_application_to_identify_critical_success_factors","325533418_A_hybrid_intelligent_model_for_assessment_of_critical_success_factors_in_high-risk_emergency_system","326484996_A_New_MADA_Methodology_Based_on_D_Numbers","325868276_Evaluation_method_based_on_fuzzy_relations_between_Dempster-Shafer_belief_structure","324999113_Generating_Z-number_based_on_OWA_weights_using_maximum_entropy","324426307_Identifying_influential_nodes_in_complex_networks_A_node_information_dimension_approach","321684553_An_Improved_Method_for_Combining_Conflicting_Evidences_Based_on_the_Similarity_Measure_and_Belief_Function_Entropy","321092729_A_novel_method_for_forecasting_time_series_based_on_fuzzy_logic_and_visibility_graph"]}