{"id":"327043742_A_Relaxation_Based_Approach_to_Optimal_Control_of_Hybrid_and_Switched_Systems_A_Practical_Guide_for_Engineers","abstract":"A complete overview of the existing generalizations of the conventional optimal control problems KEY FEATURES  Illustrates the use of the relaxation approaches in engineering optimization  Presents application of the relaxation methods in computational schemes for a numerical treatment of the sophisticated hybrid/switched optimal control problems  Offers a rigorous and self-contained mathematical tool for an adequate understanding and practical use of the relaxation techniques  Presents an extension of the relaxation methodology to the new class of applied dynamic systems, namely, to hybrid and switched control systems DESCRIPTION A Relaxation Based Approach to Optimal Control of Hybrid and Switched Systems: A Practical Guide for Engineers proposes a unified approach to effective and numerically tractable relaxation schemes for optimal control problems of hybrid and switched systems. The book gives an overview of the existing (conventional and newly developed) relaxation techniques associated with the conventional systems described by ordinary differential equations. Next, it constructs a self-contained relaxation theory for optimal control processes governed by various types (sub-classes) of general hybrid and switched systems. It contains all mathematical tools necessary for an adequate understanding and using of the sophisticated relaxation techniques. In addition, readers will find many practically oriented optimal control problems related to the new class of dynamic systems. All in all, the book follows engineering and numerical concepts. However, it can also be considered as a mathematical compendium that contains the necessary formal results and important algorithms related to the modern relaxation theory.","authors":["Vadim Azhmyakov"],"meta":["November 2018","Publisher: ElsevierISBN: 978-0-12-814788-7"],"references":[]}