{"id":"327162643_Automatic_Classification_of_Motor_Impairment_Neural_Disorders_from_EEG_Signals_Using_Deep_Convolutional_Neural_Networks","abstract":"The analysis of biomedical signals, such as the EEGs for measuring brain activity, provides means for the diagnosis of various cognitive tasks and neural disorders. These signals are frequently transformed into visual representations such as spectrograms, which can reveal characteristic patterns and serve as a basis for classification, when extracting specific features from them. We designed a new method that uses spectrogram images to feed them without any feature selection/extraction procedure directly into a deep convolutional neural network architecture and train it for the classification of motor impairment neural disorder in a person. The proposed method was tested on a set of (un)impaired subjects, where it outperformed the traditional machine learning methods. The results, obtained without any human intervention and by using all the default parameter values, turned out not to lag much behind an established state-of-the-\nart method, that takes advantage of using domain knowledge for the analysis of EEG recordings. Based on the experimental results we believe that the proposed method can be considered\nas a sound basis for further optimization towards a competitive, fully automated method for classification of EEG signals.","authors":["Grega Vrbančič","Vili Podgorelec"],"meta":["August 2018Elektronika ir Elektrotechnika 24(4)","DOI:10.5755/j01.eie.24.4.21469"],"references":["322561190_Deep_learning_with_convolutional_neural_networks_for_decoding_and_visualization_of_EEG_pathology","301878860_Efficient_Multi-Scale_3D_CNN_with_fully_connected_CRF_for_Accurate_Brain_Lesion_Segmentation","299903006_Computer_Science_Technical_Report_Echo_State_Networks_for_Modeling_and_Classification_of_EEG_Signals_in_Mental-Task_Brain-Computer_Interfaces","298069183_Automatic_Diagnosis_of_Mild_Cognitive_Impairment_Using_Electroencephalogram_Spectral_Features","319770626_Multi-column_Deep_Neural_Networks_for_Image_Classification","316612360_Effect_of_parameter_variations_on_accuracy_of_Convolutional_Neural_Network","316598799_On_weight_initialization_in_deep_neural_networks","311499903_Sleep_Neurophysiological_Dynamics_Through_the_Lens_of_Multitaper_Spectral_Analysis","309076254_Gradientbased_learning_applied_to_document_recognition","308839991_A_review_on_analysis_of_EEG_signals"]}