{"id":"327140179_Why_When_and_How_to_Adjust_Your_P_Values","abstract":"Currently, numerous papers are published reporting analysis of biological data at different omics levels by making statistical inferences. Of note, many studies, as those published in this Journal, report association of gene(s) at the genomic and transcriptomic levels by undertaking appropriate statistical tests. For instance, genotype, allele or haplotype frequencies at the genomic level or normalized expression levels at the transcriptomic level are compared between the case and control groups using the Chi-square/Fisher's exact test or independent (i.e. two-sampled) t-test respectively, with this culminating into a single numeric, namely the P value (or the degree of the false positive rate), which is used to make or break the outcome of the association test. This approach has flaws but nevertheless remains a standard and convenient approach in association studies. However, what becomes a critical issue is that the same cut-off is used when 'multiple' tests are undertaken on the same case-control (or any pairwise) comparison. Here, in brevity, we present what the P value represents, and why and when it should be adjusted. We also show, with worked examples, how to adjust P values for multiple testing in the R environment for statistical computing (http://www.R-project.org).","authors":["Mohieddin Jafari","Naser Ansari-Pour"],"meta":["May 2019Cell Journal 20(4):604-607","DOI:10.22074/cellj.2019.5992"],"references":["311335682_Alternatives_to_P_value_Confidence_interval_and_effect_size","297604406_P-Values_Misunderstood_and_Misused","264123129_An_investigation_of_the_false_discovery_rate_and_the_misinterpretation_of_P_values","297657015_The_ASA's_Statement_on_p-Values_Context_Process_and_Purpose","284886573_Sifting_the_evidence-what's_wrong_with_significance_tests","266942059_Test_of_Significance_in_Harmonic_Analysis","265175175_Publication_Bias_in_the_Social_Sciences_Unlocking_the_File_Drawer","257074741_Rejoinder_An_estimate_of_the_science-wise_false_discovery_rate_and_application_to_the_top_medical_literature","247404090_The_Earth_Is_Round_p_05_Rejoinder","224037609_Why_the_P-value_culture_is_bad_and_confidence_intervals_a_better_alternative"]}