{"id":"327118310_Design_Tool_for_Enhanced_New_Product_Development_in_Low_Income_Economies","abstract":"In order to alleviate poverty throughout the World government and non-government organisations provide aid in the form of essential household products. These products typically include cook stoves, water filters and LED lights. However, evidence suggests that these products are not always suitable for Low Income Economies (LIEs) which has resulted in a number of high profile product failures. In response to the growing need for appropriate New Product Development (NPD), this paper presents the development of a tool to assist industrial designers create appropriate and long lasting solutions for those in poverty. Data was collected from the analysis of existing products, a survey, interviews with NGOs & industrial designers and a field trip to Myanmar. The results were used to identify attributes required for effective, long-lasting product design. This was used to create a tool for designers which was found to enhance understanding of appropriate NPD for LIEs.","authors":["Timothy Whitehead","Mark Evans","Guy A. Bingham"],"meta":["June 2016","DOI:10.21606/drs.2016.467","Conference: Design Research Society 2016 ConferenceAt: Brighton, UK","Project: New Product Development in Low Income Countries"],"references":["274546196_The_Mirage_of_Marketing_to_the_Bottom_of_the_Pyramid_How_the_Private_Sector_Can_Help_Alleviate_Poverty","257927083_Design_Considerations_for_Base_of_the_Pyramid_BoP_Projects","255570936_THE_FIRST_LEARNING_EXPERIENCE_OF_DESIGNING_FOR_THE_BOP","237439966_A_critique_of_design_methodologies_appropriate_to_private-sector_activity_in_development","235356393_Using_thematic_analysis_in_psychology","232919264_Design_for_Environment_as_a_Tool_for_the_Development_of_a_Sustainable_Supply_Chain","317030091_Design_for_Micro-Enterprise_An_Approach_to_Product_Design_for_Emerging_Markets","300936975_PRECARIOUSNESS_AND_AMBIGUITY_INDUSTRIAL_DESIGN_IN_DEPENDENT_COUNTRIES","248515663_The_Fortune_at_the_Bottom_of_the_Pyramid_Eradicating_Poverty_through_Profits","247554493_Small_Is_Beautiful_A_Study_of_Economics_as_if_People_Mattered"]}