{"id":"327110184_A_new_method_for_3D_individual_tree_extraction_using_multispectral_airborne_LiDAR_point_clouds","abstract":"Characterization of individual trees is essential for many applications in forest management and ecology. Previous studies relied on single tree detection from monochromatic wavelength airborne laser scanning (ALS) systems and they focused on the use of the geometric spatial information of the point clouds (i.e., X, Y, and Z coordinates). However, there is quite often a difficulty dealing with clumped trees when only the geometric spatial information is considered. The emergence of multispectral LiDAR sensors provides a new solution for individual tree structure acquisition. The aim of this paper is to investigate the performance of multispectral ALS data for delineating individual trees which are challenging by using the monochromatic wavelength ALS system. The proposed workflow utilizes the mean shift segmentation method on different feature spaces for crown isolation. In addition, both spatial domain and multispectral domain are used to refine the under-segmentation crown segments. Ten plots (2 sets of different structural complexity) located in the dense coniferous forest area in Tobermory, Ontario, Canada are selected as experiment data. Results show that the developed method correctly detects 88% and 82% of the dominant trees with and without multispectral information, respectively. Compared with segmentation using geometric spatial information solely, the main improvements are achieved for clumped tree segment with the distinguished multispectral features. This study demonstrates that multispectral airborne laser scanning data is more capable for individual tree delineation than monochromatic wavelength laser scanning data in dealing with forests with clumped crowns in dense forests. © 2018 International Society for Photogrammetry and Remote Sensing, Inc. (ISPRS)","authors":["Wenxia Dai","Bisheng Yang","Zhen Dong","Ahmed Shaker"],"meta":["October 2018ISPRS Journal of Photogrammetry and Remote Sensing 144","DOI:10.1016/j.isprsjprs.2018.08.010","Projects: Multiple Geometric Primitives Detection from Ubiquitous Point Cloudsstructure extraction and modeling from uniquitous point clouds"],"references":["316548783_Multispectral_LiDAR_Data_for_Land_Cover_Classification_of_Urban_Areas","316490001_Contextual_segment-based_classification_of_airborne_laser_scanner_data","313807328_An_Internal_Crown_Geometric_Model_for_Conifer_Species_Classification_With_High-Density_LiDAR_Data","313021070_Single-Sensor_Solution_to_Tree_Species_Classification_Using_Multispectral_Airborne_Laser_Scanning","307531927_Airborne_multispectral_lidar_data_for_land-cover_classification_and_landwater_mapping_using_different_spectral_indexes","305768718_Two-step_adaptive_extraction_method_for_ground_points_and_breaklines_from_lidar_point_clouds","317255188_A_classification-segmentation_framework_for_the_detection_of_individual_trees_in_dense_MMS_point_cloud_data_acquired_in_urban_areas","310050998_Large-scale_estimation_of_change_in_aboveground_biomass_in_miombo_woodlands_using_airborne_laser_scanning_and_national_forest_inventory_data","307881957_LIBSVM_A_library_for_support_vector_machines","305784119_How_to_assess_the_accuracy_of_the_individual_tree-based_forest_inventory_derived_from_remotely_sensed_data_a_review"]}