{"id":"327118901_Zapping_500_faces_in_less_than_100_seconds_Evidence_for_extremely_fast_and_sustained_continuous_visual_search","abstract":"A number of studies have shown human subjects' impressive ability to detect faces in individual images, with saccade reaction times starting as fast as 100 ms after stimulus onset. Here, we report evidence that humans can rapidly and continuously saccade towards single faces embedded in different scenes at rates approaching 6 faces/scenes each second (including blinks and eye movement times). These observations are impressive, given that humans usually make no more than 2 to 5 saccades per second when searching a single scene with eye movements. Surprisingly, attempts to hide the faces by blending them into a large background scene had little effect on targeting rates, saccade reaction times, or targeting accuracy. Upright faces were found more quickly and more accurately than inverted faces; both with and without a cluttered background scene, and over a large range of eccentricities (4째-16째). The fastest subject in our study made continuous saccades to 500 small 3째 upright faces at 4째 eccentricities in only 96 seconds. The maximum face targeting rate ever achieved by any subject during any sequence of 7 faces during Experiment 3 for the no scene and upright face condition was 6.5 faces targeted/second. Our data provide evidence that the human visual system includes an ultra-rapid and continuous object localization system for upright faces. Furthermore, these observations indicate that continuous paradigms such as the one we have used can push humans to make remarkably fast reaction times that impose strong constraints and challenges on models of how, where, and when visual processing occurs in the human brain.","authors":["Jacob G. Martin","Charles E. Davis","Maximilian Riesenhuber","Simon Jonathan Thorpe"],"meta":["August 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-30245-8"],"references":["323714290_A_consumer-grade_LCD_monitor_for_precise_visual_stimulation","273148788_Modulation_of_microsaccade_rate_by_task_difficulty_revealed_through_between-_and_within-trial_comparisons","265101572_Guided_Search_40_Current_Progress_with_a_model_of_visual_search","262781861_Using_Eye_Tracking_to_Assess_Reading_Performance_in_Patients_with_Glaucoma_A_Within-Person_Study","292136499_A_saliency-based_search_mechanism_for_overt_and_covert_shifts_of_visual_attention","280957169_Fast_saccades_towards_faces_Face_detection_in_just_100_ms","276084819_The_time-course_of_face-selective_ERP_activation_during_ultra-rapid_saccades","260869923_Guided_Search_40","256764950_Timing_of_saccadic_eye_movements_during_visual_search_for_multiple_targets","242591539_Individual_Comparisons_by_Ranking_Methods"]}