{"id":"327154667_Early_Video_Content_Popularity_Detection_with_Change_Point_Analysis","abstract":"Video content is responsible for more than 70% of the global IP traffic. Consequently, it is important for content delivery infrastructures to rapidly detect and respond to changes in content popularity dynamics. For flexible and highly adaptive solutions, the capability for a quick response should be driven from early (real-time) and low-complexity content popularity detection schemes. In this paper, we focus on the early and low-complexity detection of video content popularity, which we address as a statistical change point (CP) detection problem. Our proposed methodology estimates in real-time the existence, the number, the magnitude and the direction of changes in the average number of video visits by combining: (i) off-line and on-line CP schemes; (ii) an improved measurements window segmentation heuristic for the detection of multiple CPs; and (iii) a variation of the moving average convergence divergence (MACD) indicator to detect the direction of changes. We evaluated the proposed framework using a large database of real youtube video visits. The proposed algorithm is shown to accurately identify CPs and the direction of change in the off-line phase. Finally, a few illustrative examples of two variations of the on-line algorithm are also included.","authors":["Sotiris Skaperas","Lefteris Mamatas","Arsenia Chorti"],"meta":["August 2018","DOI:10.1109/GLOCOM.2018.8648121","Conference: IEEE Global Communications Conference (GLOBECOM)At: Abu Dhabi, UAE"],"references":["325206124_Elastic_Content_Distribution_Based_on_Unikernels_and_Change-Point_Analysis","319416123_A_Novel_Caching_Policy_with_Content_Popularity_Prediction_and_User_Preference_Learning_in_Fog-RAN","311913378_Monitoring_Multivariate_Time_Series","275487187_A_survey_on_predicting_the_popularity_of_web_content","269258645_YOUStatAnalyzer_a_Tool_for_Analysing_the_Dynamics_of_YouTube_Content_Popularity","266653405_Using_early_view_patterns_to_predict_the_popularity_of_YouTube_videos","312895147_Heteroskedasticity_and_Autocorrelation_Consistent_Covariance_Matrix","268242787_Detecting_'disorder'_in_multidimensional_random_process","255484805_Asymptotic_Distribution_of_the_Delay_Time_in_Page's_Sequential_Procedure","241721914_Use_of_Cumulative_Sum_of_Squares_for_Retrospective_Detection_of_Changes_in_Variance"]}