{"id":"327215339_Co-diffusion_of_social_contagions","abstract":"Prior social contagion models consider the spread of either one contagion on interdependent networks or multiple contagions on single layer networks, usually under assumptions of competition. We propose a new threshold model for the diffusion of multiple contagions. Individuals are placed on a multiplex network with a periodic lattice layer and a random-regular-graph layer. On these population structures, we study the interface between two key aspects of the diffusion process: the level of synergy between two contagions, and the rate at which individuals become dormant after adoption. Dormancy is defined as a looser form of immunity that limits active spreading but without conferring resistance. Monte Carlo simulations reveal lower synergy makes contagions more susceptible to percolation, especially those that diffuse on lattices. Faster diffusion of one contagion with dormancy probabilistically blocks the diffusion of the other, in a way similar to ring vaccination. We show that within a band of synergy, bimodal or trimodal branchings occur on the slower contagion on the lattice. We also show complimentary contagions can provide a synergistic boost to help spread contagions that have almost gone dormant.","authors":["Ho-Chun Herbert Chang","Feng Fu"],"meta":["August 2018New Journal of Physics 20(9)","DOI:10.1088/1367-2630/aadce7","Project: Co-diffusion of social contagions"],"references":["325916260_Complex_Contagions_A_Decade_in_Review","325256573_Evolutionary_games_on_multilayer_networks_A_colloquium","322609557_Interactive_social_contagions_and_co-infections_on_complex_networks","320794190_Fundamental_properties_of_cooperative_contagion_processes","345703408_The_Crowd","334006082_Evolutionary_Dynamics_Exploring_the_Equations_of_Life","327847487_Is_Blockchain_a_General_Purpose_Technology","324435512_Multilayer_Networks_in_a_Nutshell","323118726_Synergistic_interactions_promote_behavior_spreading_and_alter_phase_transition_on_multiplex_networks","320695357_Information_cascades_in_complex_networks"]}