{"id":"327257758_Automated_literature_analysis_threats_and_experiences","abstract":"The number of scientific publications is increasing each year, specifically in the field of computer science. In order to condense existing knowledge, evidence-based software engineering is concerned with systematic literature reviews, surveys, and other kinds of literature analysis. These methods are used to summarize the evidence on empirical studies - or approaches in general - and to identify gaps for new research opportunities. However, executing systematic review processes requires a considerable amount of time and effort. Consequently, researchers have proposed several semi-automated approaches to support and facilitate different steps of such methods. With our current research, we aim to assist researchers to efficiently and effectively execute different steps, namely the search for and selection of primary studies. In this paper, we report several issues we identified during our research that threaten any kind of literature analysis and hamper suitable tool support. We further recommend solutions to mitigate these threats. Overall, our goal is to raise researchers' and publishers' awareness regarding several potential threats on literature analysis, to support software engineers in designing suitable tools for research, and to encourage the research community to solve these threats.","authors":["Yusra Shakeel","Jacob Krüger","Ivonne von Nostitz-Wallwitz","Christian Lausberger"],"meta":["June 2018","DOI:10.1145/3194747.3194748","Conference: the International Workshop","Project: Quality Assessment of Scientific Studies"],"references":["303994629_A_Systematic_Review_of_Knowledge_Sharing_Challenges_and_Practices_in_Global_Software_Development","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","297678141_Applying_Information_Retrieval_Techniques_to_Detect_Duplicates_and_to_Rank_References_in_the_Preliminary_Phases_of_Systematic_Literature_Reviews","282942019_Semi-automatic_selection_of_primary_studies_in_systematic_literature_reviews_is_it_reasonable","345134920_Evidence-Based_Software_Engineering_and_Systematic_Reviews","336586053_On_Searching_Relevant_Studies_in_Software_Engineering","317115621_Identifying_Innovative_Documents_Quo_vadis","308848093_Arrival_Times_with_Hours_of_Service_Regulations_for_Truck_Drivers-Tracks_and_Gaps_from_Current_Research","284070096_Identification_of_SLR_Tool_Needs_-_Results_of_a_Community_Workshop","283672402_A_comparative_evaluation_of_cloud_migration_optimization_approaches_A_systematic_literature_review"]}