{"id":"327290837_Dynamic_Interference_for_Uplink_SCMA_in_Large-Scale_Wireless_Networks_without_Coordination","abstract":"Abstract Fast varying active transmitter sets are a key feature of wireless communication networks with very short length transmissions arising in communications for the Internet of Things. As a consequence, the interference is dynamic, leading to non-Gaussian statistics. At the same time, the very high density of devices is motivating non-orthogonal multiple access (NOMA) techniques, such as sparse code multiple access (SCMA). In this paper, we study the statistics of the dynamic interference from devices using SCMA. In particular, we show that the interference is α-stable with non-trivial dependence structure for large-scale networks modeled via Poisson point processes. Moreover, the interference on each frequency band is shown to be sub-Gaussian α-stable in the special case of disjoint SCMA codebooks. We investigate the impact of the α-stable interference on achievable rates and on the optimal density of devices. Our analysis suggests that ultra dense networks are desirable even with α-stable interference.","authors":["Malcolm Egan","Laurent Clavier","Ce Zheng","Mauro Freitas"],"meta":["August 2018EURASIP Journal on Wireless Communications and Networking 2018(1)","DOI:10.1186/s13638-018-1225-z"],"references":["349549661_Indoor_Radio_Planning_A_Practical_Guide_for_2G_3G_and_4G","325355157_Capacity_approximation_of_continuous_channels_by_discrete_inputs","324286691_An_Introduction_to_the_Theory_of_Point_Processes","319531621_Indoor_Radio_Planning","319366727_Capacity_sensitivity_in_additive_non-Gaussian_noise_channels","316806544_Lecture_Notes_in_Statistics","314196126_Capacity_Bounds_for_Additive_Symmetric_a-Stable_Noise_Channels","308851869_Skew-t_copula_for_dependence_modelling_of_impulsive_a-stable_interference","306117440_Achievable_rates_for_additive_isotropic_a-stable_noise_channels","284787167_On_the_Finiteness_of_the_Capacity_of_Continuous_Channels"]}