{"id":"327246354_A_new_coupled_disease-awareness_spreading_model_with_mass_media_on_multiplex_networks","abstract":"How to understand the propagation properties of infectious diseases among the population is an important topic in the field of epidemic modelling. In this paper, we investigate the interaction between the disease transmission and disease-related awareness spread, and then propose a new coupled disease spreading model on a two-layered multiplex network, where one layer denotes the underlying topology for the epidemics and the other one represents the corresponding topology for the awareness spread. In the current model, once the information about the disease is acquired by some susceptible ones, it is assumed that they will take the preventive measures to reduce the probability of being infected (e.g., social distancing or taking the vaccine). In the epidemic layer, the transmission dynamics among nodes can be characterized with the classic SIR (susceptible-infective-recovered) model, and those individuals who obtain the disease information will cut down their rate of being infected with a multiplicative factor γ during the course of disease transmission; while in the awareness layer, we will employ the UAU (unaware-aware-unaware) model to denote the diffusion of information. Meanwhile, we explore the impact of mass media on the spread of infectious diseases in the model. Based on the microscopic Markovian chain approach, we build the probability tree to describe the switching process among different states and then establish the different equations for the state transition in detail. Furthermore, we analytically derive the epidemic threshold regarding the disease propagation, which is correlated with the multiplex network topology and the coupling relationship between two classes of spreading dynamics, and extensive simulations also validate the theoretical predictions. Current results are beneficial for us to deeply understand the contagion characteristics of real epidemics within the population.","authors":["Chengyi Xia","Zhishuang Wang","Chunyuan Zheng","Quantong Guo"],"meta":["August 2018Information Sciences 471","DOI:10.1016/j.ins.2018.08.050"],"references":[]}