{"id":"327299924_A_multi-objective_mathematical_model_for_the_optimization_of_the_transittability_of_complex_biomolecular_networks","abstract":"The fundamental goal of systems biology is to understand the dynamic aspects of cells and their behaviour. This organism is represented by a network so-called complex biomolecular network in which the nodes represent the different cellular components and the edges represent the interactions occurring among them. Through this network, it is easy to study the transition states and the dynamic behaviour of cells. Indeed, perturbing some nodes of the biomolecular network induce the transition of all the network. This process, known as the ”transittability”, expresses the idea of steering the complex biomolecular network from an unexpected state to a desired state.\nIn this context, we are thus interested in how to use the transittability of biomolecular networks to increase the efficiency of translational medicine for improving human health and disease, including genetic and environmental factors of of patient’s well-being. This is a great opportunity to understand diseases, and find new diagnoses and treatments.\nDue to its complexity, the transittability of complex biomolecular networks can be considered as an optimization problem. Up to a recent date only few studies have been carried out in this problem. Most of them focused only on the minimization of the required nodes to steer the entire network, and others considered the minimization of the number of stimuli to be applied on the network. However, this assumption is not always realistic, because steering complex biomolecular networks is in general a multi-objective optimization problem. It requires finding appropriate trade-offs among various objectives, for example between the appropriate nodes to be stimulated and the number of external stimuli to be used and their cost, and the impact on patient’s well-being.\nIn this paper, the optimization of the transittability of complex biomolecular networks is investigated from the multi-objective perspective. In the mathematical model four criteria are considered simultaneously: the minimization of the number of external stimuli, the minimization of their total cost, the minimization of the number of target nodes, and the minimization of the patient discomfort. All these objectives are described theoretically and mathematically in detail.","authors":["Ali Ayadi","Cecilia Zanni-Merk","François De Bertrand de Beuvron","Saoussen Krichen"],"meta":["January 2018Procedia Computer Science 126:498-506","DOI:10.1016/j.procs.2018.07.284","Project: Semantic technologies for the optimization of complex biomolecular networks"],"references":["319447254_BNO_An_ontology_for_describing_the_behaviour_of_complex_biomolecular_networks","307911642_Logical_and_Semantic_Modeling_of_Complex_Biomolecular_Networks","268231656_Target_control_of_complex_networks","261920689_Transittability_of_complex_networks_and_its_applications_to_regulatory_biomolecular_networks","317269452_Biomolecular_Network_Controllability_With_Drug_Binding_Information","315561374_Understanding_the_Behaviour_of_Complex_Biomolecular_Networks_by_Combining_Logical_and_Semantic_Modeling","300575922_Drug_Target_Identification_Based_on_Structural_Output_Controllability_of_Complex_Networks","299380083_Minimum_steering_node_set_of_complex_networks_and_its_applications_to_biomolecular_networks","271772746_Network_Output_Controllability-Based_Method_for_Drug_Target_Identification","267439764_Optimization_problems_in_molecular_biology_a_survey_and_critical_review","242333283_Realistic_Control_of_Network_Dynamics","223991910_Optimizing_controllability_of_complex_networks_by_minimum_structural_perturbations","220669591_Opportunities_for_Combinatorial_Optimization_in_Computational_Biology","51117462_Controllability_of_complex_networks","46818390_Optimization_meets_systems_biology"]}