{"id":"327234843_Computational_Fact_Checking_A_Content_Management_Perspective","abstract":"Data journalism designates journalistic work inspired by digital data sources. A particularly popular and active area of data journalism is concerned with fact-checking. The term was born in the journalist community and referred the process of verifying and ensuring the accuracy of published media content; since 2012, however, it has increasingly focused on the analysis of politics, economy, science, and news content shared in any form, but first and foremost on the Web (social and otherwise). These trends have been noticed by computer scientists working in the industry and academia. Thus, a very lively area of digital content management research has taken up these problems and works to propose foundations (models), algorithms, and implement them through concrete tools.\nOur tutorial: (i) Outlines the current state of affairs in the area of digital (or computational) fact-checking in newsrooms, by journalists, NGO workers, scientists and IT companies; (ii) Shows which areas of digital content management research, in particular those relying on the Web, can be leveraged to help fact-checking, and gives a comprehensive survey of efforts in this area; (iii) Highlights ongoing trends, unsolved problems, and areas where we envision future scientific and practical advances.","authors":["Sylvie Cazalens","Julien Leblay","Philippe Lamarre","Ioana Manolescu"],"meta":["August 2018Proceedings of the VLDB Endowment 11(12)","DOI:10.14778/3229863.3229880"],"references":["322128377_Flash_Points_Discovering_Exceptional_Pairwise_Behaviors_in_Vote_or_Rating_Data","319597830_ClaimBuster_the_first-ever_end-to-end_fact-checking_system","319395280_The_pascal_recognising_textual_entailment_challenge","304128217_Stance_Detection_with_Bidirectional_Conditional_Encoding","329975657_Design_Challenges_for_Entity_Linking","316899273_Finding_diverse_high-value_representatives_on_a_surface_of_answers","312206128_Computational_Fact_Checking_through_Query_Perturbations","307632447_Context_dependent_claim_detection","304021720_SourceSight_Enabling_Effective_Source_Selection","304021428_Goods_Organizing_Google's_Datasets"]}