{"id":"327211305_Review_Biological_determinants_of_between-animal_variation_in_feed_efficiency_of_growing_beef_cattle","abstract":"Animal’s feed efficiency in growing cattle (i.e. the animal ability to reach a market or adult BW with the least amount of feed intake), is a key factor in the beef cattle industry. Feeding systems have made huge progress to understand dietary factors influencing the average animal feed efficiency. However, there exists a considerable amount of animal-to-animal variation around the average feed efficiency observed in beef cattle reared in similar conditions, which is still far from being understood. This review aims to identify biological determinants and molecular pathways involved in the between-animal variation in feed efficiency with particular reference to growing beef cattle phenotyped for residual feed intake (RFI). Moreover, the review attempts to distinguish true potential determinants from those revealed through simple associations or indirectly linked to RFI through their association with feed intake. Most representative and studied biological processes which seem to be connected to feed efficiency were reviewed, such as feeding behaviour, digestion and methane production, rumen microbiome structure and functioning, energy metabolism at the whole body and cellular levels, protein turnover, hormone regulation and body composition. In addition, an overall molecular network analysis was conducted for unravelling networks and their linked functions involved in between-animal variation in feed efficiency. The results from this review suggest that feeding and digestive-related mechanisms could be associated with RFI mainly because they co-vary with feed intake. Although much more research is warranted, especially with high-forage diets, the role of feeding and digestive related mechanisms as true determinants of animal variability in feed efficiency could be minor. Concerning the metabolic-related mechanisms, despite the scarcity of studies using reference methods it seems that feed efficient animals have a significantly lower energy metabolic rate independent of the associated intake reduction. This lower heat production in feed efficient animals may result from a decreased protein turnover and a higher efficiency of ATP production in mitochondria, both mechanisms also identified in the molecular network analysis. In contrast, hormones and body composition could not be conclusively related to animal-to-animal variation in feed efficiency. The analysis of potential biological networks underlying RFI variations highlighted other significant pathways such as lipid metabolism and immunity and stress response. Finally, emerging knowledge suggests that metabolic functions underlying genetic variation in feed efficiency could be associated with other important traits in animal production. This emphasizes the relevance of understanding the biological basis of relevant animal traits to better define future balanced breeding programmes.","authors":["Gonzalo Cantalapiedra-Hijar","Mohammed Abo-Ismail","Gordon E Carstens","Le Luo Guan"],"meta":["August 2018animal 12(s2):1-15","DOI:10.1017/S1751731118001489","Project: Energy efficiency in ruminants"],"references":["325269722_Invited_review_Improving_feed_efficiency_of_beef_cattle_-_the_current_state_of_the_art_and_future_challenges","316292503_Direct_multitrait_selection_realizes_the_highest_genetic_response_for_ratio_traits","312920783_Digestion_and_metabolism_of_low_and_high_residual_feed_intake_Nellore_bulls","311854689_Feed_efficiency_and_enteric_methane_production_of_Nellore_cattle_in_the_feedlot_and_on_pasture","310620081_Associations_among_methane_emission_traits_measured_in_the_feedlot_and_in_respiration_chambers_in_angus_cattle_bred_to_vary_in_feed_efficiency","320575950_Exploration_of_Biological_Markers_of_Feed_Efficiency_in_Young_Bulls","319314024_Molecular_Physiology_of_Feed_Efficiency_in_Beef_Cattle","316968087_Feed_efficiency_correlations_in_beef_cattle_offered_zero-grazed_grass_and_a_high-concentrate_diet","316899995_Factors_Influencing_the_Growth_of_Meat_Animals","309893687_1481_Repeatability_of_feed_efficiency_in_beef_cattle_offered_grass_silage_and_zero-grazed_grass"]}