{"id":"327298190_Community_Detection_Using_Attribute_Homogenous_Motif","abstract":"Network community detection with higher-order features has become a hot research topic recently, since higher-order features that are captured at the level of small network subgraphs can help to gain new insights into the higher-order organizations of the overall network. However, most of the existing higher-order community detection methods only leverage the structural information of networks, yet fail to take into consideration the rich information of node attributes, which typically makes them incapable of discovering semantically meaningful communities. To address this problem, we propose a novel method for community detection based on a newly designed higher-order feature termed Attribute Homogenous Motif (AHMotif), which integrates both node attributes and higher-order structure of the network in a seamless way. Specifically, the statistically significant motifs are identified for the network in terms of the topological structure, and homogeneity values are computed for structural motifs according to the attributes of the nodes that are involved in the motif. Then the given attributed network can be further represented via a newly designed AHMotif adjacency matrix. The AHMotif adjacency matrix encodes both structure and attribute information and can characterize the network from a higher-order perspective. Afterwards, several proximity based methods are utilized to obtain the final community detection results. Extensive experiments on several real-world datasets have shown the superiority of our AHMotif based method in community detection.","authors":["Pei-Zhen Li","Ling Huang","Chang-Dong Wang","Dong Huang"],"meta":["August 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2867549"],"references":["326204015_Integrative_Network_Embedding_via_Deep_Joint_Reconstruction","326202442_Finding_Communities_with_Hierarchical_Semantics_by_Distinguishing_General_and_Specialized_topics","321037517_Query_Optimal_k-Plex_Based_Community_in_Graphs","317389544_Node_Attribute-enhanced_Community_Detection_in_Complex_Networks","324639350_Mining_Graphlet_Counts_in_Online_Social_Networks","322549417_Identifying_Influential_Nodes_Based_on_Community_Structure_to_Speed_up_the_Dissemination_of_Information_in_Complex_Network","322325939_Nonnegative_Matrix_Factorization_with_Mixed_Hypergraph_Regularization_for_Community_Detection","321896261_A_Generic_Framework_for_Interesting_Subspace_Cluster_Detection_in_Multi-attributed_Networks","316469394_MISAGA_An_Algorithm_for_Mining_Interesting_Subgraphs_in_Attributed_Graphs","315873066_Scalable_Motif-aware_Graph_Clustering"]}