{"id":"327252498_Classification_and_regression_tree_with_resampling_for_classifying_imbalanced_data","abstract":"Data mining is the automatic process to find from data interesting and useful patterns for specific tasks such as predicting future data or classifying label or group of the new data items. Many data mining algorithms successfully applied to several real-life data are in a tree group. Among the tree-based algorithms, decision tree is the most popular and renowned one for its high accuracy on classifying data in general cases in which data in each class are quite equally distributed. But many datasets in real applications are imbalanced; amount of data in some group outnumber those in other group. Such uneven distribution among classes is a main reason why classification accuracy is not excellent even when using decision tree algorithm. Inefficiency is due to the case that in the tree growing phase, the algorithm tends to favor the majority data and ignores the minority data to be incorrectly classified. In the past many researchers try to solve this data imbalanced problem with many ways like over-sampling, under-sampling, cost-sensitive classification, or even ensemble of cost-sensitive decision tree. In this paper, we introduce a simplified method of learning classification and regression tree (CART) with resampling technique for classifying imbalanced datasets. We compare our proposed method with other methods based on several metrics including the precision on classifying the minority data as opposed to the classification on majority data, the overall accuracy regardless of minority nor majority classes, and the Matthews Correlation Coefficient (MCC). The use of MCC is suitable for imbalanced data because it takes into account all four classifying metrics: true positive, true negative, false positive, and false negative. The performance of our proposed method to combine resampling with CART is satisfied based on the MCC metric. From all five experimental imbalanced datasets, our method performs the best. © 2018, International Association of Computer Science and Information Technology.","authors":["S. Boonamnuay","Nittaya Kerdprasop","K. Kerdprasop"],"meta":["August 2018","DOI:10.18178/ijmlc.2018.8.4.708"],"references":["317321000_Optimal_classifier_for_imbalanced_data_using_Matthews_Correlation_Coefficient_metric","317125011_Cost-Effective_Class-Imbalance_Aware_CNN_for_Vehicle_Localization_and_Categorization_in_High_Resolution_Aerial_Images","316870952_Automatic_Video_Event_Detection_for_Imbalance_Data_Using_Enhanced_Ensemble_Deep_Learning","306929309_Groundwater_level_prediction_of_landslide_based_on_classification_and_regression_tree","301596547_Learning_from_imbalanced_data_Open_challenges_and_future_directions","283955035_A_Comparison_of_ClassificationRegression_Trees_and_Logistic_Regression_in_Failure_Models","276412348_Evaluation_From_precision_recall_and_F-measure_to_ROC_informedness_markedness_correlation","327606791_Classification_And_Regression_Trees","317183845_SMOTE-GPU_Big_Data_preprocessing_on_commodity_hardware_for_imbalanced_classification","272825856_KEEL_Data-Mining_Software_Tool_Data_Set_Repository_Integration_of_Algorithms_and_Experimental_Analysis_Framework"]}