{"id":"327264506_Cross-Spectral_Iris_Recognition_using_CNN_and_Supervised_Discrete_Hashing","abstract":"Completely automated iris recognition has emerged as an integral part of e-business and e-governance infrastructure which has acquired billions of iris images under near-infrared illumination to establish the identity of individuals. A range of e-business and surveillance applications can provide iris images that are acquired under visible illumination. Therefore, development of accurate cross-spectral iris matching capabilities is highly desirable. This paper investigates cross-spectral iris recognition using a range of deep learning architectures. Our experimental results on two publicly available cross-spectral iris databases, from 209 and 120 different subjects respectively, indicate outperforming results and validate our approach for the cross-spectral iris matching. Our observations indicate that the self-learned features generated from the convolution neural networks (CNN) are generally sparse and offer great potential for template compression. Therefore, this paper also introduces the iris recognition with supervised discrete hashing that can not only achieve more accurate performance but also offer a significant reduction in the size of iris templates. Most accurate cross-spectral matching performance is achieved by incorporating supervised discrete hashing on the features learned from the trained CNN with softmax cross-entropy loss. The proposed approach not only achieves outperforming results over other considered CNN architecture but also offers significantly reduced template size as compared with the other iris recognition methods available in the literature.","authors":["Kuo Wang","Ajay Kumar"],"meta":["August 2018Pattern Recognition 86","DOI:10.1016/j.patcog.2018.08.010"],"references":["311478362_Accurate_Periocular_Recognition_Under_Less_Constrained_Environment_Using_Semantics-Assisted_Convolutional_Neural_Network","309082436_Toward_More_Accurate_Iris_Recognition_Using_Cross-Spectral_Matching"]}