{"id":"327296885_A_multi-objective_method_for_optimizing_the_transittability_of_complex_biomolecular_networks","abstract":"With the development of high-throughput techniques, systems biology has been pushing researchers to focus on how to optimize the steering of biomolecular networks from their actual state to a desired state. This phenomenon known as the ”transittability” means that complex biomolecular networks can be steered from an unexpected state to a desired state.\nThis paper investigates the optimization of the transittability of complex biomolecular networks taking into account different objective functions. To solve this problem, we propose a multi-objective optimization approach which consists of two steps, the search and decision making step. The search step is based on a powerful multi-objective genetic algorithm, the non-dominated sorting genetic algrorithm (NSGA-II), to solve our problem and obtain a Pareto-optimal set. As regards the decision making step is based on the use of a multi-criteria decision making method, the Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS), for providing the best compromise solution according to the user preferences. The proposed approach was tested and applied to solve the steering of the p53 Signaling network. Experimental results illustrate the effectiveness of this approach.","authors":["Ali Ayadi","Cecilia Zanni-Merk","François De Bertrand de Beuvron","Saoussen Krichen"],"meta":["January 2018Procedia Computer Science 126:507-516","DOI:10.1016/j.procs.2018.07.285","Project: Semantic technologies for the optimization of complex biomolecular networks"],"references":["317990410_A_meta-heuristic_approach_supported_by_NSGA-II_for_the_design_and_plan_of_supply_chain_networks_considering_new_product_development","268231656_Target_control_of_complex_networks","261920689_Transittability_of_complex_networks_and_its_applications_to_regulatory_biomolecular_networks","242333283_Realistic_Control_of_Network_Dynamics","317269452_Biomolecular_Network_Controllability_With_Drug_Binding_Information","311732969_Muiltiobjective_optimization_using_nondominated_sorting_in_genetic_algorithms","305274844_Performance_of_Decomposition-Based_Many-Objective_Algorithms_Strongly_Depends_on_Pareto_Front_Shapes","299380083_Minimum_steering_node_set_of_complex_networks_and_its_applications_to_biomolecular_networks","299038134_Specification_of_genetic_search_directions_in_cellular_multi-objective_genetic_algorithms","289818435_Methods_for_Multiple_Attribute_Decision_Making"]}