{"id":"327217492_Computational_Thinking_and_Literacy","abstract":"Today’s students will enter a workforce that is powerfully shaped by computing. To be successful in a changing economy, students must learn to think algorithmically and computationally, to solve problems with varying levels of abstraction. These computational thinking skills have become so integrated into social function as to represent fundamental literacies. However, computer science has not been widely taught in K-12 schools. Efforts to create computer science standards and frameworks have yet to make their way into mandated course requirements. Despite a plethora of research on digital literacies, research on the role of computational thinking in the literature is sparse. This conceptual paper proposes a three dimensional framework for exploring the relationship between computational thinking and literacy through: 1) situating computational thinking in the literature as a literacy; 2) outlining mechanisms by which students’ existing literacy skills can be leveraged to foster computational thinking; and 3) elaborating ways in which computational thinking skills facilitate literacy development.","authors":["Sharin Jacob","Mark Warschauer"],"meta":["August 2018","DOI:10.26716/jcsi.2018.01.1.1"],"references":["331844224_TEACHING_COMPUTATIONAL_THINKING_TO_ENGLISH_LEARNERS","350683776_An_Introduction_to_Second_Language_Acquisition_Research","349860774_Electronic_Literacies_Language_Culture_and_Power_in_Online_Education","344985330_Convergence_Culture_Where_Old_and_New_Media_Collide","344487699_Cool_Places_Geographies_of_Youth_Cultures","329654770_New_Digital_Media_and_Learning_as_an_Emerging_Area_and_Worked_Examples_as_One_Way_Forward","329654173_Changing_Minds_Computers_Learning_and_Literacy","324857157_The_introductory_computer_programming_course_is_first_and_foremost_a_LANGUAGE_course","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","318600661_Changing_a_Generation's_Way_of_Thinking_Teaching_Computational_Thinking_Through_Programming"]}