{"id":"327291898_Software_Product_Line_Evolution_a_Systematic_Literature_Review","abstract":"Context: Software Product Lines (SPL) evolve when there are changes in the requirements, product structure or the technology being used. Different approaches have been proposed for managing SPL assets and some also address how evolution affects these assets. Existing mapping studies have focused on specific aspects of SPL evolution, but there is no cohesive body of work that gives an overview of the area as a whole.\n\nObjective: The goals of this work are to review the characteristics of the approaches reported as supporting SPL evolution, and to synthesize the evidence provided by primary studies about the nature of their processes, as well as how they are reported and validated.\n\nMethod: We conducted a systematic literature review, considering six research questions formulated to evaluate evolution approaches for SPL. We considered journal, conference and workshop papers published up until March 2017 in leading digital libraries for computer science.\n\nResults: After a thorough analysis of the papers retrieved from the digital libraries, we ended up with a set of 60 primary studies. Feature models are widely used to represent SPLs, so feature evolution is frequently addressed. Other assets are less frequently addressed. The area has matured over time: papers presenting more rigorous work are becoming more common. The processes used to support SPL evolution are systematic, but with a low level of automation.\n\nConclusions: Our research shows that there is no consensus about SPL formalization, what assets can evolve, nor how and when these evolve. Case studies are quite popular, but few industrial-sized case studies are publicly available. Also, few of the proposed techniques offer tool support. We believe that the SPL community needs to work together to improve the state of the art, creating methods and tools that support SPL evolution in a more comparable manner.","authors":["Maíra Marques Samary","Jocelyn Simmonds","Pedro O. Rossel","M. Cecilia Bastarrica"],"meta":["January 2019Information and Software Technology 105:190-208","DOI:10.1016/j.infsof.2018.08.014"],"references":["313832257_Building_Reliable_and_Maintainable_Dynamic_Software_Product_Lines_an_Investigation_in_the_Body_Sensor_Network_Domain","312513112_DarwinSPL_an_integrated_tool_suite_for_modeling_evolving_context-aware_software_product_lines","311658839_Software_Product_Lines_Traceability_A_Systematic_Mapping_Study","311489734_Guaranteeing_Configuration_Validity_in_Evolving_Software_Product_Lines","310821083_Higher-order_delta_modeling_for_software_product_line_evolution","310820316_Partially_safe_evolution_of_software_product_lines","309744110_Requirements_Prioritization_Decision_Rule_Improvement_for_Software_Product_Line_Evolution","309110389_Foundatiotns_for_the_study_of_software_architecture","308917848_Aligning_Coevolving_Artifacts_Between_Software_Product_Lines_and_Products","308841413_A_prototype-based_approach_for_managing_clones_in_clone-and-own_product_lines"]}