{"id":"327210985_Review_Epigenetics_developmental_programming_and_nutrition_in_herbivores","abstract":"Epidemiological studies in humans and animal models (including ruminants and horses) have highlighted the critical role of nutrition on developmental programming. Indeed, it has been demonstrated that the nutritional environment during the periconceptional period and foetal development can altered the postnatal performance of the resultant offspring. This nutritional programming can be exerted by maternal and paternal lineages and can affect offspring beyond the F1 generation. Alterations in epigenetic mechanisms have been proposed as the causative link behind the programming trajectories observed in the offspring. Although a clear cause–effect relationship between epigenetic modifications during early development and later offspring phenotype has not been demonstrated in livestock species, strong associations have been reported for some epigenetic marks (e.g. messenger RNA) that are worth exploring as possible predictors of future offspring phenotype. In this review, we shortly describe the main epigenetic mechanisms studied so far in mammals (i.e. mainly in the mouse) thought to be associated with developmental programming, and discuss the few studies available in mammalian herbivores (e.g. cattle) showing the effect of nutrition on epigenetic marks and the associated phenotype. Clearly, there is a need to develop research on nutritional strategies capable of modulating the epigenetic machinery with positive influence on the phenotype of livestock herbivores. This type of research is needed to alleviate the challenges currently faced by the livestock industry (e.g. impaired fertility of high-yielding dairy cows). This in turn will have a positive influence on animal welfare and productivity of livestock enterprises.","authors":["Pascale Chavatte-Palmer","Miguel A Velazquez","Hélène Jammes","Véronique Duranthon"],"meta":["August 2018animal 12(s2):1-9","DOI:10.1017/S1751731118001337"],"references":["321492174_Dynamic_epigenomic_landscapes_during_early_lineage_specification_in_mouse_embryos","320949032_Meta-analysis_to_predict_the_effects_of_metabolizable_amino_acids_on_dairy_cattle_performance","320566493_Acetylation_and_methylation_of_sperm_histone_3_lysine_27_H3K27ac_and_H3K27me3_are_associated_with_bull_fertility","315992036_Endogenous_Retroviruses_With_Us_and_against_Us","315845498_Host-mediated_effects_of_phytonutrients_in_ruminants_A_review","321436173_A_100-Year_Review_Metabolic_modifiers_in_dairy_cattle_nutrition","321187666_Evidence_for_the_implication_of_the_histone_code_in_building_the_genome_structure","320349513_Spermatozoa_DNA_methylation_patterns_differ_due_to_peripubertal_age_in_bulls","318878787_Placentome_Nutrient_Transporters_and_Mammalian_Target_of_Rapamycin_Signaling_Proteins_Are_Altered_by_the_Methionine_Supply_during_Late_Gestation_in_Dairy_Cows_and_Are_Associated_with_Newborn_Birth_Wei","316082837_Xist-dependent_imprinted_X_inactivation_and_the_early_developmental_consequences_of_its_failure"]}