{"id":"327211174_Review_The_compositional_variation_of_the_rumen_microbiome_and_its_effect_on_host_performance_and_methane_emission","abstract":"The rumen microbiome has the important task of supplying ruminants with most of their dietary requirements and is responsible for up to 90% of their metabolic needs. This tremendous feat is possible due to the large diversity of microorganisms in the rumen. The rumen is considered one of the most diverse ecosystems on the planet in terms of species diversity and functional richness. From the moment the feed is ingested, it enters a vast cascade in which specialized microorganisms degrade specific components of the feed turning them into molecules, which in turn are utilized as anabolic precursors and energy sources for the animal. The output of this degradation process not only affects the animal, but also has an extensive impact on the environment. Some of the byproducts that are emitted as waste from this process, such as methane, act as greenhouse gases which greatly contribute to global warming. Recent technological advances developed to study this community enabled a larger overview of its vast taxonomic and functional diversity, thus leading to a better understanding of its ecology and function. This deeper understanding of the forces affecting the microbiome includes the forces that shape composition, the variation among animals, the stability of its key components, the processes of succession on a short- and long-time scales such as primary colonization and diurnal oscillations. These collective understandings have helped to provide insights into the potential effects that these forces have on the outputs observed from the animal itself. Over the recent years, there has been a growing body of evidence demonstrating the link between the microbiome and its effect on productivity of the host animals and the environment, which has placed rumen microbiome studies in the forefront of animal agricultural research. In this review, we focus on the natural variations in community composition, which are not the results of different management or feed but rather intrinsic features of animals. We characterize the rumen microbiome, its potential impact on its host as well as the barriers in implementing the current knowledge to modulate the microbiome and point toward potential avenues to overcome these hurdles.","authors":["Itzhak Mizrahi","Elie Jami"],"meta":["August 2018animal 12(s2):1-13","DOI:10.1017/S1751731118001957"],"references":["324054799_Assessment_of_microbiome_changes_after_rumen_transfaunation_implications_on_improving_feed_efficiency_in_beef_cattle","322830286_The_Effect_of_DNA_Extraction_Methods_on_Observed_Microbial_Communities_from_Fibrous_and_Liquid_Rumen_Fractions_of_Dairy_Cows","319990028_An_Investigation_into_Rumen_Fungal_and_Protozoal_Diversity_in_Three_Rumen_Fractions_during_High-Fiber_or_Grain-Induced_Sub-Acute_Ruminal_Acidosis_Conditions_with_or_without_Active_Dry_Yeast_Supplement","319639724_List_of_new_names_and_new_combinations_previously_effectively_but_not_validly_published","319389058_Comparison_of_rumen_bacterial_communities_in_dairy_herds_of_different_production","319329529_PCR_and_Omics_Based_Techniques_to_Study_the_Diversity_Ecology_and_Biology_of_Anaerobic_Fungi_Insights_Challenges_and_Opportunities","319269658_A_Structural_and_Functional_Elucidation_of_the_Rumen_Microbiome_Influenced_by_Various_Diets_and_Microenvironments","319140283_Heritable_Bovine_Rumen_Bacteria_Are_Phylogenetically_Related_and_Correlated_with_the_Cow's_Capacity_To_Harvest_Energy_from_Its_Feed","318413313_Taxon_abundance_diversity_co-occurrence_and_network_analysis_of_the_ruminal_microbiota_in_response_to_dietary_changes_in_dairy_cows","320869121_List_of_new_names_and_new_combinations_previously_effectively_but_not_validly_published"]}