{"id":"327262325_'Aye'_or_'No'_Speech-level_Sentiment_Analysis_of_Hansard_UK_Parliamentary_Debate_Transcripts","abstract":"Transcripts of UK parliamentary debates provide access to the opinions of politicians towards many important topics, but due to the large quantity of textual data and the specialised language used, they are not straightforward for human readers to process. We apply opinion mining methods to these transcripts to classify the sentiment polarity of speakers as being either positive or negative towards the motions proposed in the debates. We compare classification performance on a novel corpus using both manually annotated sentiment labels and labels derived from the speakers' votes ('aye' or 'no'). We introduce a two-step classification model, and evaluate the performance of both one-and two-step models, as well as the use of a range of textual and contextual features. Results suggest that textual features are more indicative of manually annotated class labels. Conversely, in addition to boosting performance, contextual metadata features are particularly indicative of vote labels. Use of the two-step debate model results in performance gains and appears to capture some of the complexity of the debate format. Optimum performance on this data is achieved using all features to train a multi-layer neural network, indicating that such models may be most able to exploit the relationships between textual and contextual cues in parliamentary debate speeches.","authors":["Gavin Abercrombie","Riza Batista-Navarro"],"meta":["May 2018","Conference: LRECAt: Miyazaki, Japan"],"references":["327861042_A_Sentiment-labelled_Corpus_of_Hansard_Parliamentary_Debate_Speeches","322793086_SemEval-2017_Task_4_Sentiment_Analysis_in_Twitter","240875078_Feature_Specific_Sentiment_Analysis_for_Product_Reviews","220873062_Collective_Classification_of_Congressional_Floor-Debate_Transcripts","220746311_Twitter_as_a_Corpus_for_Sentiment_Analysis_and_Opinion_Mining","341869422_Mining_Ethos_in_Political_Debate","279121638_Towards_Sentiment_Analysis_on_Parliamentary_Debates_in_Hansard","274203088_Westminster's_World_Understanding_Political_Roles","233367956_Roles_and_behaviour_of_British_MPs","215470760_Opinion_Mining_and_Sentiment_Analysis"]}