{"id":"327211304_Review_Role_of_herbivores_in_sustainable_agriculture_in_Sub-Saharan_Africa","abstract":"The role of herbivorous livestock in supporting the sustainability of the farming systems in which they are found is complex and sometimes conflicting. In Sub-Saharan Africa (SSA), the integration of livestock into farming systems is important for sustainable agriculture as the recycling of nutrients for crop production through returns of animal manure is a central element of the dominant mixed crop-livestock systems. Sustainable agriculture has been widely advocated as the main practical pathway to address the challenge of meeting the food needs of the rapidly growing population in SSA while safeguarding the needs of future generations. The objective of this paper is to review the state of knowledge of the role of herbivores in sustainable intensification of key farming systems in SSA. The pathways to sustainable agriculture in SSA include intensification of production and livelihood diversification. Sustainable agricultural practices in SSA have focused on intensification practices which aim to increase the output : input ratio through increasing use of inputs, introduction of new inputs or use of existing inputs in a new way. Intensification of livestock production can occur through increased and improved fodder availability, genetic production gains, improved crop residue use and better nutrient recycling of manure. Livestock deliver many ‘goods’ in smallholder farming systems in SSA including improving food and nutrition security, increased recycling of organic matter and nutrients and the associated soil fertility amendments, adding value to crop residues by turning them into nutrient-rich foods, income generation and animal traction. Narratives on livestock ‘bads’ or negative environmental consequences have been largely shaped by the production conditions in the Global North but livestock production in SSA is a different story. In SSA, livestock are an integral component of mixed farming systems and they play key roles in supporting the livelihoods of much of the rural population. None-the-less, the environmental consequences of livestock production on the continent cannot be ignored. To enhance agricultural sustainability in SSA, the challenge is to optimize livestock’s role in the farming systems by maximizing livestock ‘goods’ while minimizing the ‘bads’. This can be through better integration of livestock into the farming systems, efficient nutrient management systems, and provision of necessary policy and institutional support.","authors":["A.A. Ayantunde","Alan J Duncan","Mark Van Wijk","Peter Thorne"],"meta":["August 2018animal 12(s2):1-11","DOI:10.1017/S175173111800174X"],"references":["316467845_Yield_gap_analyses_to_estimate_attainable_bovine_milk_yields_and_evaluate_options_to_increase_production_in_Ethiopia_and_India","314714591_Agricultural_intensification_scenarios_household_food_availability_and_greenhouse_gas_emissions_in_Rwanda_Ex-ante_impacts_and_trade-offs","311954351_Assessment_of_lifetime_performance_of_small_ruminants_under_different_feeding_systems","311212383_Toward_climate-smart_agriculture_in_West_Africa_A_review_of_climate_change_impacts_adaptation_strategies_and_policy_developments_for_the_livestock_fishery_and_crop_production_sectors","310750304_Measuring_sustainable_intensification_in_smallholder_agroecosystems_A_review","309271573_Ten_striking_facts_about_agricultural_input_use_in_Sub-Saharan_Africa","301903938_How_scalable_is_sustainable_intensification","316630239_Yield_gap_analyses_to_estimate_attainable_bovine_milk_yields_and_evaluate_options_to_increase_production_in_Ethiopia_and_India","316457634_Chemins_d'intensification_et_durabilite_des_exploitations_de_polyculture-elevage_en_Afrique_subsaharienne_contribution_de_l'association_agriculture-elevage","313021288_Is_production_intensification_likely_to_make_farm_households_food-adequate_A_simple_food_availability_analysis_across_smallholder_farming_systems_from_East_and_West_Africa","293332064_Do_Smallholder_Mixed_Crop-Livestock_Livelihoods_Encourage_Sustainable_Agricultural_Practices_A_Meta-Analysis","289509969_Tackling_climate_change_through_livestock_A_global_assessment_of_emissions_and_mitigation_opportunities","301743854_Sustainable_food_security_and_nutrition_Demystifying_conventional_beliefs","276359960_Importance_of_Animals_in_Agricultural_Sustainability_and_Food_Security","273428256_Conservation_agriculture_in_African_mixed_crop-livestock_systems_Expanding_the_niche"]}