{"id":"327275773_Exposure_to_opposing_views_on_social_media_can_increase_political_polarization","abstract":"There is mounting concern that social media sites contribute to political polarization by creating \"echo chambers\" that insulate people from opposing views about current events. We surveyed a large sample of Democrats and Republicans who visit Twitter at least three times each week about a range of social policy issues. One week later, we randomly assigned respondents to a treatment condition in which they were offered financial incentives to follow a Twitter bot for 1 month that exposed them to messages from those with opposing political ideologies (e.g., elected officials, opinion leaders, media organizations, and nonprofit groups). Respondents were resurveyed at the end of the month to measure the effect of this treatment, and at regular intervals throughout the study period to monitor treatment compliance. We find that Republicans who followed a liberal Twitter bot became substantially more conservative posttreatment. Democrats exhibited slight increases in liberal attitudes after following a conservative Twitter bot, although these effects are not statistically significant. Notwithstanding important limitations of our study, these findings have significant implications for the interdisciplinary literature on political polarization and the emerging field of computational social science.","authors":["Christopher Bail","Lisa P. Argyle","Taylor Brown","John P. Bumpus"],"meta":["August 2018Proceedings of the National Academy of Sciences 115(37):201804840","DOI:10.1073/pnas.1804840115"],"references":["322536604_The_Elusive_Backfire_Effect_Mass_Attitudes'_Steadfast_Factual_Adherence","309906984_Political_polarization_on_Twitter","288520753_Life_in_the_network_The_coming_age_of_computational_social_science","345802191_Democracy_for_Realists_Why_Elections_Do_Not_Produce_Responsive_Government","345243439_Asymmetric_Politics_Ideological_Republicans_and_Group_Interest_Democrats","327072001_Democracy_for_Realists_Why_Elections_Do_Not_Produce_Responsive_Government","320966077_How_the_news_media_activate_public_expression_and_influence_national_agendas","319936361_Greater_Internet_use_is_not_associated_with_faster_growth_in_political_polarization_among_US_demographic_groups","318008588_The_Elusive_Backfire_Effect_Mass_Attitudes'_Steadfast_Factual_Adherence","299997389_Durably_reducing_transphobia_A_field_experiment_on_door-to-door_canvassing"]}