{"id":"327275790_Best_Match_New_relevance_search_for_PubMed","abstract":"PubMed is a free search engine for biomedical literature accessed by millions of users from around the world each day. With the rapid growth of biomedical literature—about two articles are added every minute on average—finding and retrieving the most relevant papers for a given query is increasingly challenging. We present Best Match, a new relevance search algorithm for PubMed that leverages the intelligence of our users and cutting-edge machine-learning technology as an alternative to the traditional date sort order. The Best Match algorithm is trained with past user searches with dozens of relevance-ranking signals (factors), the most important being the past usage of an article, publication date, relevance score, and type of article. This new algorithm demonstrates state-of-the-art retrieval performance in benchmarking experiments as well as an improved user experience in real-world testing (over 20% increase in user click-through rate). Since its deployment in June 2017, we have observed a significant increase (60%) in PubMed searches with relevance sort order: it now assists millions of PubMed searches each week. In this work, we hope to increase the awareness and transparency of this new relevance sort option for PubMed users, enabling them to retrieve information more effectively.","authors":["Nicolas Fiorini","Kathi Canese","Grisha Starchenko","Evgeny Kireev"],"meta":["August 2018PLoS Biology 16(8):e2005343","DOI:10.1371/journal.pbio.2005343","Project: PubMed search experience improvement"],"references":["328073314_Internet_Advertising_Formats","326305196_A_Field_Sensor_Computing_the_composition_and_intent_of_PubMed_queries","321003690_Neural_information_retrieval_at_the_end_of_the_early_years","320717729_Towards_PubMed_20","320199828_Bridging_the_gap_Incorporating_a_semantic_similarity_measure_for_effectively_mapping_PubMed_queries_to_documents","318869522_Accurately_Interpreting_Clickthrough_Data_as_Implicit_Feedback","318769032_Position-Aware_Representations_for_Relevance_Matching_in_Neural_Information_Retrieval","318740316_Deep_Learning_for_Biomedical_Information_Retrieval_Learning_Textual_Relevance_from_Click_Logs","316168423_MeSH_Now_Automatic_MeSH_indexing_at_PubMed_scale_via_learning_to_rank","323664075_ProtDec-LTR20_an_improved_method_for_protein_remote_homology_detection_by_combining_pseudo_protein_and_supervised_Learning_to_Rank"]}