{"id":"327302669_Context_Modeling_for_Industry_40_an_Ontology-Based_Proposal","abstract":"Industry 4.0 is an initiative combining a set of technologies that help to achieve more efficient manufacturing processes. An important characteristic for industrial production in Industry 4.0 is that physical items such as sensors, devices and enterprise assets are connected to each other and to the Internet. In this environment, devices and sensors generate increasing amount of data. A key point to consider is that the execution of industrial processes should depend not only on their internal state and on user interactions but also on the context of their execution, in order to become context-aware and provide added-value information to improve the monitoring of operations and their performance. Ontologies emerge as a relevant method for representing manufacturing knowledge in a machine-interpretable way. Therefore, an ontology-based context model for industry is introduced in this paper. The model facilitates context representation and reasoning by providing structures for context-related concepts, rules and their semantics.","authors":["Franco Giustozzi","Julien Saunier","Cecilia Zanni-Merk"],"meta":["January 2018Procedia Computer Science 126:675-684","DOI:10.1016/j.procs.2018.08.001"],"references":["291385881_Implementing_Smart_Factory_of_Industrie_40_An_Outlook","228585128_SAWA_An_assistant_for_higher-level_fusion_and_situation_awareness","224794260_A_Context_Modeling_Survey","224218018_A_Knowledge-Driven_Approach_to_Activity_Recognition_in_Smart_Homes","221393453_A_Spatial_Logic_based_on_Regions_and_Connection","309173850_Foundations_for_a_core_ontology_of_manufacturing","278699051_Towards_a_Better_Understanding_of_Context_and_Context-Awareness","246618219_Knowledge_Elicitation_Techniques_In_Knowledge_Engineering_Management_The_CommonKADS_Methodology","235720353_A_Translational_Approach_to_Portable_Ontologies","224285663_Allen_JF_Maintaining_Knowledge_About_Temporal_Intervals_Communications_of_the_ACM_26_832-843"]}