{"id":"327398017_Performance_Comparison_of_QEC_Network_based_JAVA_Application_and_Web_based_PHP_Application","abstract":"Every organization wants to automate the manual system for moving and storing their data in particular format. A QEC department takes feedback of teacher evaluation manually from the students in the university that is somehow more difficult to maintain the record of a teacher, more cost-effective and fewer chances to generate an accurate and optimized report. The computerized system has been developed that generates an accurate and optimized report, easy to maintain the record of the teacher. Lots of possibilities are available to design and develop the application using different programming languages. We have developed a network-based JAVA application and web-based PHP application to automate the manual system of teacher evaluation. The GUI of the application contains 18 questions as per policy of HEC which will be answered by the students. After submitting the answers to questions to the server, an excel report will be ready to generate. Our primary focus is to measure the performance of the server of a network-based JAVA application and web-based PHP application. Both forms contain the same scenario, but here we have to find which form is more suitable and beneficent for an organization in terms of their server's performance parameters like average response time, throughput, and standard deviation and data transfer rate. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Sanaullah Memon","Rasool Bux Palh","Muniba Memon","Hina Siddique"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(8)","DOI:10.14569/IJACSA.2018.090870"],"references":["248544637_Explaining_the_acceptance_and_use_of_government_Internet_services_A_multivariate_analysis_of_2006_survey_data_in_the_Netherlands","221566004_Idea_Java_vs_PHP_Security_Implications_of_Language_Choice_for_Web_Applications","220710372_Schema_Evolution_in_Wikipedia_-_Toward_a_Web_Information_System_Benchmark","302381818_Java_Network_Programming","280017547_Defining_changeability_Reconciling_flexibility_adaptability_scalability_modifiability_and_robustness_for_maintaining_system_lifecycle_value","266496608_Using_JMeter_to_Performance_Test_Web_Services","260480288_Java_Network_Programming","234808604_On_Knowledge_Base_Management_Systems_Integrating_Artificial_Intelligence_and_Database_Technologies","222009513_Printed_and_Tablet_E-paper_newspaper_from_an_environmental_perspective-A_screening_life_cycle_assessment","2956159_Databases_Deepen_the_Web"]}