{"id":"327385080_Statistical_Modeling_of_the_3D_Geometry_and_Topology_of_Botanical_Trees","abstract":"We propose a framework for statistical modeling of the 3D geometry and topology of botanical trees. We treat botanical trees as points in a tree‐shape space equipped with a proper metric that captures the geometric and the topological differences between trees. Geodesics in the tree‐shape space correspond to the optimal sequence of deformations, i.e. bending, stretching, and topological changes, which align one tree onto another. In this way, the 3D tree modeling and synthesis problem becomes a problem of exploring the tree‐shape space either in a controlled fashion, using statistical regression, or randomly by sampling from probability distributions fitted to populations in the tree‐shape space. We show how to use this framework for (1) computing statistical summaries, e.g. the mean and modes of variations, of a population of botanical trees, (2) synthesizing random instances of botanical trees from probability distributions fitted to a population of botanical trees, and (3) modeling, interactively, 3D botanical trees using a simple sketching interface. The approach is fast and only requires as input 3D botanical tree models with a known upright orientation.","authors":["Guan Wang","Hamid Laga","Jinyuan Jia","Ning Xie"],"meta":["August 2018Computer Graphics Forum 37(5):185-198","DOI:10.1111/cgf.13501"],"references":["322584404_The_Shape_Space_of_3D_Botanical_Tree_Models","317749455_Interactive_Modeling_and_Authoring_of_Climbing_Plants","300408519_Shell_PCA_Statistical_Shape_Modelling_in_Shell_Space","283563970_Deformation-Driven_Topology-Varying_3D_Shape_Correspondence","320030044_Elastic_Shape_Analysis_of_Three-Dimensional_Objects","314733988_Modeling_and_generating_moving_trees_from_video","311478440_Creative_Virtual_Tree_Modeling_Through_Hierarchical_Topology-Preserving_Blending","309192228_Numerical_Inversion_of_SRNF_Maps_for_Elastic_Shape_Analysis_of_Genus-Zero_Surfaces","290991491_Image-based_plant_modeling","287390345_3D_Tree_Skeletonization_from_Multiple_Images_Based_on_PyrLK_Optical_Flow"]}