{"id":"327307183_Store_Interface_Package_Connection_Methods_and_Propositions_for_Multi-Situated_App_Studies","abstract":"This paper discusses methodological approaches to app studies, focussing on their embeddedness and situatedness within multiple infrastructural settings. Our approach arises by paying close attention to the multivalent affordances of apps as software packages, particularly their capacity to enter into diverse groupings and relations depending on different infra-structural situations. The changing situations they evoke and participate in, accordingly, makes apps visible and accountable in a variety of unique ways. Engaging with and even staging these situations, therefore, allows for political-economic, social and cultural dynamics associated with apps and their infrastructures can be investigated through a style of research we describe as multi-situated app studies. The piece offers an overview of four different entry points of enquiry that are exemplary of this over-arching framework, focussing on app stores, app interfaces, app packages and app connections. We conclude with nine proposi-tions that develop out of these studies as prompts for further research.","authors":["Michael Dieter","Carolin Gerlitz","Anne Helmond","Nate Tkacz"],"meta":["August 2018","Projects: App ecosystems: A critical history of appsApp Studies"],"references":["322434193_From_ranking_algorithms_to_'ranking_cultures'_Investigating_the_modulation_of_visibility_in_YouTube_search_results","319067619_An_unexpected_journey_A_few_lessons_from_sciences_Po_medialab's_experience","317792421_The_Affordances_of_Social_Media_Platforms","330692906_Unthought_The_Power_of_the_Cognitive_Nonconscious","329954402_The_Metainterface_The_Art_of_Platforms_Cities_and_Clouds","322539926_Historical_website_ecology_Analyzing_past_states_of_the_web_using_archived_source_code","318494161_The_Future_of_the_Internet--And_How_to_Stop_It","313596747_Some_elements_of_a_sociology_of_translation_Domestication_of_the_scallops_and_the_fishermen_of_St_Brieuc_Bay","309962707_The_walkthrough_method_An_approach_to_the_study_of_apps","305222409_On_the_Existence_of_Digital_Objects"]}