{"id":"327369379_A_critical_review_on_self-adaptive_Li-ion_battery_ageing_models","abstract":"The prediction accuracy of Lithium-ion (Li-ion) battery ageing models based on laboratory data is uncertain in the context of online prediction. This is due to the difficulty to reproduce realistic operating profiles in laboratory. The development of self-adaptive ageing models, which are updated using the ageing data obtained in operation, allows enhancing the online prediction accuracy and reducing the required characterisation period in laboratory. At the same time, it offers the possibility to maximise systems’ profitability, providing useful information to update the energy management strategy and for predictive maintenance purposes. The present study aims at reviewing, classifying and comparing the different self-adaptive Li-ion battery ageing models proposed in the literature. Firstly, the different characteristics influencing the ability of a model to update itself are identified, and a classification is proposed for self-adaptive Li-ion battery ageing modelling methods. Secondly, specific criteria are defined to assess and compare the accuracy and computational cost of the different models, enabling a selection of the most suitable ones. Finally, relevant conclusions are drawn considering the key features required to achieve effective ageing predictions, and concise recommendations are suggested for future self-adaptive Li-ion battery ageing model development.","authors":["Mattin Lucu","Egoitz Martinez-Laserna","Iñigo Gandiaga","Haritza Camblong"],"meta":["September 2018Journal of Power Sources 401C:pp. 85-101","DOI:10.1016/j.jpowsour.2018.08.064","Project: Development of a data-driven ageing model for Lithium-ion batteries: a nonparametric approach to learn from real operation data"],"references":["315116242_Gaussian_process_regression_for_forecasting_battery_state_of_health","322270366_An_improved_unscented_particle_filter_approach_for_lithium-ion_battery_remaining_useful_life_prediction","319899038_Cycling_capacity_recovery_effect_A_coulombic_efficiency_and_post-mortem_study","318289394_Data-driven_hybrid_remaining_useful_life_estimation_approach_for_spacecraft_lithium-ion_battery","317630161_Capacity_Prognostics_of_Lithium-Ion_Batteries_using_EMD_Denoising_and_Multiple_Kernel_RVM","315845083_Robust_particle_filter_for_state_estimation_using_measurements_with_different_types_of_gross_errors","315541532_Remaining_useful_life_prediction_of_lithium-ion_battery_using_an_improved_UPF_method_based_on_MCMC","313688451_Interacting_multiple_model_particle_filter_for_prognostics_of_lithium-ion_batteries","313587628_Multi-step-ahead_prediction_techniques_for_Lithium-ion_batteries_condition_prognosis","313247796_Prognostics_of_LiNiMnCoO2-based_lithium-ion_batteries_using_a_novel_battery_degradation_model"]}