{"id":"327308331_Observation_of_the_Effect_of_Gender_on_Children's_Concept_of_Motion_Sustainability_Issue","abstract":"Determination of the parameters of motion of the surrounding objects, and in particular their speed, is one of the basic skills of a human being. Studies on the development of basic concepts of motion have been carried out for years, exploiting various methods and in different contexts. In our research, we analyzed the effect of school education on the understanding of the phenomenon of motion. We tried to determine its possible short- and long-term cognitive consequences. To achieve this goal, we used the survey method. Our studies show that children differentiate two specific concepts: average speed and instantaneous velocity. In the present work we present how the gender context is superimposed on the general picture. We found that the initial, genuine pre-school concept of speed is different for girls and boys. Our analysis shows also that this gender effect vanishes quickly along with the introduction of physical definitions of kinematical quantities by physics/science curricula. We discuss the methodological aspect of the statistical gender gap measure and we calculate the gender effect chance probability, p-value, to be slightly less than 0.001. The importance of the observed effect for the sustainable science teaching processes is discussed.","authors":["Punsiri Dam-o","Joanna Gondek","Michał Karbowiak","Tadeusz Wibig"],"meta":["August 2018Sustainability 10(9):3076","DOI:10.3390/su10093076"],"references":["305786649_Editorial_Focused_Collection_Gender_in_Physics","305783647_Gender_experience_and_self-efficacy_in_introductory_physics","305783639_Gender_gaps_and_gendered_action_in_a_first-year_physics_laboratory","345863576_Hormones_and_Animal_Social_Behavior","323424582_Statistical_power_analysis_for_the_behavioral_sciences","317623860_The_Psychology_of_Sex_Differences","314162567_The_increasingly_important_role_of_science_competency_beliefs_for_science_learning_in_girls_THE_IMPORTANT_ROLE_OF_SCIENCE_COMPETENCY_BELIEFS","310750355_Expectancy-value_theory_of_achievement_motivation","309021383_Why_are_some_STEM_fields_more_gender_balanced_than_others","297085050_SEX-DIFFERENCES_IN_MENTAL_ABILITIES_HEMISPHERIC_LATERALIZATION_AND_RATE_OF_PHYSICAL_GROWTH_AT_ADOLESCENCE"]}