{"id":"327380258_Does_the_Scopus_author_ID_suffice_to_track_scientific_international_mobility_A_case_study_based_on_Leibniz_laureates","abstract":"In this paper I outline how author identifiers enable to track international mobility of scientists. Authorship systems help to distinguish among similar names and provide information on affiliations and thus countries of stay. This study explores the relation between CV data and Scopus data in regard to tracking international mobility of scientists. To test the consistency and applicability of data on mobility episodes, residence countries as provided in CVs of a set of German scientists were compared against country information in the affiliations of their publications. Therefore, the CVs of Leibniz laureates were coded for the period 1996–2015 and their publications were gathered on the basis of Scopus author ID. Results show that the majority of scientists under study have a single author ID (68.4%). However, there are laureates with so-called ‘split identities’ where more than one author ID exists. Most of them have a dominant author ID that covers the majority of their publications and one or more additional IDs with only a few publications causing these split identities. Recall statistic shows that the use of the dominant author ID of each laureate would result in around 97% of their publication output. In contrast, the precision of Scopus author ID proves to be high. A random sample shows that all publications assigned to a specific author ID relate to a single individual, so that the precision statistic would yield 100%. Further results show that the registry systems ORCID and ResearcherID are no alternatives to Scopus author ID, because a minority of laureates make use of these identifier systems and data is often incomplete. Unlike ORCID and ResearcherID that suffer from a selection bias as those scientists who remain in science maintain their author profiles, Scopus author ID exists for every author publishing in sources covered by Scopus. The comparison of mobility data in Scopus versus CV data shows that bibliometric data is suitable to identify a scientist’s international mobility and appears to be a good solution if there are no CVs available or if they are incomplete. Furthermore, the reasons for inconsistencies in mobility data are discussed. These mainly reside in the lack of co-author affiliations, incomplete CV data, and other minor reasons.","authors":["Valeria Aman"],"meta":["September 2018Scientometrics 117(6)","DOI:10.1007/s11192-018-2895-3","Project: Determinants and career effects of scientists' international mobility (SciMo)"],"references":["320235815_Scientists_have_most_impact_when_they're_free_to_move","304706769_Author_Disambiguation_in_PubMed_Evidence_on_the_Precision_and_Recall_of_Author-ity_among_NIH-Funded_Scientists","274082949_International_mobility_Findings_from_a_survey_of_researchers_in_the_EU","265159696_Assessing_Scientific_Mobility_Dynamics_and_Impact_drawing_on_the_potential_of_electronic_CV_databases","262864594_A_bibliometric_approach_to_tracking_international_scientific_migration","250199028_CV_analysis_as_a_complementary_methodological_approach_Investigating_the_mobility_of_Australian_scientists","242084169_Measuring_and_assessing_researcher_mobility_from_CV_analysis_The_case_of_the_Ramon_y_Cajal_programme_in_Spain","227993367_Author_Name_Disambiguation","220365390_Studying_the_brain_drain_Can_bibliometric_methods_help","314097120_All_authors_must_now_supply_ORCID_identifiers","295910486_Editorial_ORCID_is_a_Wonderful_But_Not_Required_Tool_for_Authors","277351392_Accuracy_evaluation_of_Scopus_Author_ID_based_on_the_largest_funding_database_in_Japan","257663145_Studying_scientific_migration_in_Scopus"]}