{"id":"327332125_A_Combined_Arithmetic-High-Level_Synthesis_Solution_to_Deploy_Partial_Carry-Save_Radix-8_Booth_Multipliers_in_Datapaths","abstract":"While partial carry-save adders are easily designed by splitting them into several fragments working in parallel, the design of partial carry-save multipliers is more challenging. Prior approaches have proposed several solutions based on the radix-4 Booth recoding. This technique makes it possible to diminish the height of a multiplier by half, this being the most widespread option when designing multipliers, as only easy multiples are required. Larger radices provide further reductions at the expense of the appearance of hard multiples. Such is the case of radix-8 Booth multipliers, whose critical path is located at the generation of the 3X multiple. In order to mitigate this delay, in our prior works, we proposed to first decouple the 3X computation and introduce it in the dataflow graph, leveraging the available slack. Considering this, we then present a partial carry-save radix-8 Booth multiplier that receives three inputs in this format, namely, the multiplicand, the multiplier, and the 3X multiple. Moreover, the rest of the datapath is adapted to work in partial carry-save. In comparison with conventional radix-4 and radix-8 Booth-based datapaths, the proposal is able to diminish the execution time and energy consumption while benefits from the area reduction provided by the selection of radix 8. Furthermore, it outperforms prior state-of-the-art partial carry-save multipliers based on radix 4.","authors":["Alberto Del Barrio","Roman Hermida","Seda Memik"],"meta":["August 2018Circuits and Systems I: Regular Papers, IEEE Transactions on PP(99):1-14","DOI:10.1109/TCSI.2018.2866172"],"references":["318611226_A_Computationally_Efficient_Reconfigurable_Constant_Multiplication_Architecture_Based_on_CSD_Decoded_Vertical-Horizontal_Common_Sub-Expression_Elimination_Algorithm","316949141_A_slack-based_approach_to_efficiently_deploy_radix_8_booth_multipliers","294276739_A_Partial_Carry-Save_On-the-Fly_Correction_Multispeculative_Multiplier","283887872_Approximate_Radix-8_Booth_Multipliers_for_Low-Power_and_High-Performance_Operation","313404724_Data-dependent_truncation_scheme_for_parallel_multipliers","312076178_Minimizing_Coefficients_Wordlength_for_Piecewise-Polynomial_Hardware_Function_Evaluation_With_Exact_or_Faithful_Rounding","299416732_Weighted_Partitioning_for_Fast_Multiplier-less_Multiple_Constant_Convolution_Circuit","281802307_High-Level_Synthesis_From_Algorithm_to_Digital_Circuits","273394020_High_Speed_Speculative_Multipliers_Based_on_Speculative_Carry-Save_Tree","271463923_The_optimum_Booth_radix_for_low_power_integer_multipliers"]}