{"id":"327317297_Multiplex_network_motifs_as_building_blocks_of_corporate_networks","abstract":"In corporate networks, firms are connected through links of corporate ownership and shared directors, connecting the control over major economic actors in our economies in meaningful and consequential ways. Most research thus far focused on the connectedness of firms as a result of one particular link type, analyzing node-specific metrics or global network-based methods to gain insights in the modelled corporate system.\nIn this paper, we aim to understand multiplex corporate networks with multiple types of connections, specifically investigating the network’s essential building blocks: multiplex network motifs. Motifs, which are small subgraph patterns occurring at significantly higher frequencies than in similar random networks, have demonstrated their usefulness in understanding the structure of many types of real-world networks. However, detecting motifs in multiplex networks is nontrivial for two reasons. First of all, there are no out-of-the-box subgraph enumeration algorithms for multiplex networks. Second, existing null models to test network motif significance, are unable to incorporate the interlayer dependencies in the multiplex network. We solve these two issues by introducing a layer encoding algorithm that incorporates the multiplex aspect in the subgraph enumeration phase. In addition, we propose a null model that is able to preserve the interlayer connectedness, while taking into account that one of the link types is actually the result of a projection of an underlying bipartite network.\nThe experimental section considers the corporate network of Germany, in which tens of thousands of firms are connected through several hundred thousand links. We demonstrate how incorporating the multiplex aspect in motif detection is able to reveal new insights that could not be obtained by studying only one type of relationship. In a general sense, the motifs reflect known corporate governance practices related to the monitoring of investments and the concentration of ownership. A substantial fraction of the discovered motifs is typical for an industrialized country such as Germany, whereas others seem specific for certain economic sectors. Interestingly, we find that motifs involving financial firms are over-represented amongst the larger and more complex motifs. This demonstrates the prominent role of the financial sector in Germany’s largely industry-oriented corporate network.","authors":["Frank Takes","Walter A. Kosters","Boyd Witte","Eelke M. Heemskerk"],"meta":["August 2018Applied Network Science 3(1):39","DOI:10.1007/s41109-018-0094-z"],"references":["318895761_Brain_network_clustering_with_information_flow_motifs","314433469_Uncovering_Offshore_Financial_Centers_Conduits_and_Sinks_in_the_Global_Corporate_Ownership_Network","311430710_The_Effects_of_Data_Quality_on_the_Analysis_of_Corporate_Board_Interlock_Networks","344480541_Corporate_Networks_in_Europe_and_the_United_States","325742135_Multilayer_social_networks","321531791_The_promise_and_perils_of_using_big_data_in_the_study_of_corporate_networks_problems_diagnostics_and_fixes","321316885_Detecting_Motifs_in_Multiplex_Corporate_Networks","313264273_Motifs_in_Temporal_Networks","305037467_Higher-order_organization_of_complex_networks","304104437_Ownership_structure_and_corporate_tax_avoidance_Evidence_from_publicly_listed_private_firms_in_China"]}