{"id":"327396217_Effects_of_Social_Guidance_on_a_Robot_Learning_Sequences_of_Policies_in_Hierarchical_Learning","abstract":"See new publication on http://dx.doi.org/10.3390/app11030975.\n\nWe aim for a robot capable to learn sequences of motor policies to achieve a field of complex tasks. In this paper, we consider a set of interrelated complex tasks hierarchically organized. To address this high-dimensional mapping between a continuous high-dimensional space of tasks and an infinite dimensional space of sequences of policies, we introduce a framework called \"procedure\", which enables the creation of sequences of policies by combining previously learned skills. \nWe propose an active learning algorithmic architecture, capable of organizing its learning process in order to achieve a field of complex tasks by learning sequences of primitive motor policies. Based on heuristics of goal-babbling, social guidance, strategic learning guided by intrinsic motivation, and the \"procedure\" framework, our algorithm can actively decide on which outcome to focus and which exploration strategy to apply. \nWe show that a simulation industrial robot can tackle the learning of complex motor policies and adapt this complexity to that of the task at hand. Owing to its exploration strategies, it can discover the levels of difficulty of the tasks, and learn the hierarchy between tasks so as to combine simple tasks to complete a complex task.","authors":["Nicolas Duminy","Dominique Duhaut","Sao Mai Nguyen"],"meta":["October 2018","DOI:10.1109/SMC.2018.00636","Conference: IEEE International Conference on Systems Man and CyberneticsAt: Japan"],"references":["324251060_Learning_a_Set_of_Interrelated_Tasks_by_Using_Sequences_of_Motor_Policies_for_a_Strategic_Intrinsically_Motivated_Learner","313541747_Strategic_and_interactive_learning_of_a_hierarchical_set_of_tasks_by_the_Poppy_humanoid_robot","257458383_Active_Choice_of_Teachers_Learning_Strategies_and_Goals_for_a_Socially_Guided_Intrinsic_Motivation_Learner","234412726_Active_Learning_of_Inverse_Models_with_Intrinsically_Motivated_Goal_Exploration_in_Robots","224200261_Intrinsically_Motivated_Goal_Exploration_for_Active_Motor_Learning_in_Robots_a_Case_Study","224199809_Incremental_learning_of_subtasks_from_unsegmented_demonstration","224163311_Goal_Babbling_Permits_Direct_Learning_of_Inverse_Kinematics","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","285433839_Behavioral_Hierarchy_Exploration_and_Representation","261455709_The_Strategic_Student_Approach_for_Life-Long_Exploration_and_Learning"]}