{"id":"327397706_A_Review_on_Scream_Classification_for_Situation_Understanding","abstract":"In our living environment, a non-speech audio signal provides a significant evidence for situation awareness. It also compliments the information obtained from a video signal. In non-speech audio signals, screaming is one of the events in which the people like security guard, care taker and family members are particularly interested in terms of care and surveillance because screams are atomically considered as a sign of danger. Contrary to this concept, this review is particularly targeting automated acoustic systems using non-speech class of scream believing that the screams can further be classified into various classes like happiness, sadness, fear, danger, etc. Inspired by the prevalent scream audio detection and classification field, a taxonomy has been projected to highlight the target applications, significant sound features, classification techniques, and their impact on classification problems in last few decades. This review will assist the researchers for retrieving the most appropriate scream detection and classification technique and acoustic parameters for scream classification that can assist in understanding the vocalization condition of the speaker. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Saba Nazir","Muhammad Awais","Sheraz Malik","Fatima Nazir"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(8)","DOI:10.14569/IJACSA.2018.090809"],"references":["317723191_Deep_Neural_Network_based_learning_and_transferring_mid-level_audio_features_for_acoustic_scene_classification","316534244_Analysis_of_human_scream_and_its_impact_on_text-independent_speaker_verification","305684153_A_Preliminary_Study_on_Deep-Learning_Based_Screaming_Sound_Detection","299544182_Deep_neural_networks_for_automatic_detection_of_screams_and_shouted_speech_in_subway_trains","286376123_Two-Stage_Supervised_Learning-Based_Method_to_Detect_Screams_and_Cries_in_Urban_Environments","324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","321108135_AC_An_Audio_Classifier_to_Classify_Violent_Extensive_Audios","318409582_Sound_classification_based_on_spectrogram_for_surveillance_applications","316027412_Noise-Robust_Scream_Detection_using_Band-limited_Spectral_Entropy","289414964_Analysis_and_identification_of_human_scream_Implications_for_speaker_recognition"]}