{"id":"327428541_Characterization_of_relapsing-remitting_multiple_sclerosis_patients_using_support_vector_machine_classifications_of_functional_and_diffusion_MRI_data","abstract":"Multiple Sclerosis patients' clinical symptoms do not correlate strongly with structural assessment done with traditional magnetic resonance images. However, its diagnosis and evaluation of the disease's progression are based on a combination of this imaging analysis complemented with clinical examination. Therefore, other biomarkers are necessary to better understand the disease. In this paper, we capitalize on machine learning techniques to classify relapsing-remitting multiple sclerosis patients and healthy volunteers based on machine learning techniques, and to identify relevant brain areas and connectivity measures for characterizing patients. To this end, we acquired magnetic resonance imaging data from relapsing-remitting multiple sclerosis patients and healthy subjects. Fractional anisotropy maps, structural and functional connectivity were extracted from the scans. Each of them were used as separate input features to construct support vector machine classifiers. A fourth input feature was created by combining structural and functional connectivity. Patients were divided in two groups according to their degree of disability and, together with the control group, three group pairs were formed for comparison. Twelve separate classifiers were built from the combination of these four input features and three group pairs. The classifiers were able to distinguish between patients and healthy subjects, reaching accuracy levels as high as 89% ± 2%. In contrast, the performance was noticeably lower when comparing the two groups of patients with different levels of disability, reaching levels below 63% ± 5%. The brain regions that contributed the most to the classification were the right occipital, left frontal orbital, medial frontal cortices and lingual gyrus. The developed classifiers based on MRI data were able to distinguish multiple sclerosis patients and healthy subjects reliably. Moreover, the resulting classification models identified brain regions, and functional and structural connections relevant for better understanding of the disease.","authors":["Mariana Zurita","Cristian Montalba","Tomas Labbe","Juan Pablo Cruz"],"meta":["September 2018NeuroImage: Clinical 20","DOI:10.1016/j.nicl.2018.09.002","Project: Multiple Sclerosis and Cognition"],"references":["316949128_The_clinico-radiological_paradox_of_cognitive_function_and_MRI_burden_of_white_matter_lesions_in_people_with_multiple_sclerosis_A_systematic_review_and_meta-analysis","314110377_Ensemble_Classification_of_Alzheimer's_Disease_and_Mild_Cognitive_Impairment_Based_on_Complex_Graph_Measures_from_Diffusion_Tensor_Images","308898952_Graph_Theory-Based_Brain_Connectivity_for_Automatic_Classification_of_Multiple_Sclerosis_Clinical_Courses","307792214_Deterministic_diffusion_fiber_tracking_improved_by_quantitative_anisotropy","301903004_Combined_structural_and_functional_patterns_discriminating_upper_limb_motor_disability_in_multiple_sclerosis_using_multivariate_approaches","297715660_A_Graph_Based_Classification_Method_for_Multiple_Sclerosis_Clinical_Forms_Using_Support_Vector_Machine","291327529_Structural_Brain_Network_Characteristics_Can_Differentiate_CIS_from_Early_RRMS","315115837_Functional_network_connectivity_abnormalities_in_multiple_sclerosis_Correlations_with_disability_and_cognitive_impairment","309654403_Gray_matter_MRI_differentiates_neuromyelitis_optica_from_multiple_sclerosis_using_random_forest","305343142_Dentate_nucleus_connectivity_in_adult_patients_with_multiple_sclerosis_Functional_changes_at_rest_and_correlation_with_clinical_features"]}