{"id":"327416148_Semantic_Signatures_for_Urban_Visual_Localization","abstract":"Visual localization is a useful alternative to standard localization techniques. In a typical scenario, features are extracted from images captured by cameras and compared with geo-referenced databases. Location information is then inferred from the matching results. Conventional schemes mainly use low-level visual features. They offer good accuracy but suffer from scalability issues. In order to assist localization in large urban areas, this work explores a different path by utilizing high-level semantic information. It is found that object information in a street view can facilitate localization. A novel descriptor scheme called \"semantic signature\" is proposed to summarize this information. A semantic signature consists of type and angle information of visible objects at a spatial location. Several metrics and protocols are proposed for signature comparison and retrieval. They illustrate different trade-offs between accuracy and complexity. Extensive simulation results confirm the potential of the proposed scheme in large-scale applications.","authors":["Li Weng","Bahman Soheilian","Valérie Gouet-Brunet"],"meta":["September 2018","DOI:10.1109/CBMI.2018.8516492","Conference: International Conference on Content-Based Multimedia Indexing","Project: Content-based image localization"],"references":["316902678_Cross-domain_image_localization_by_adaptive_feature_fusion","316429040_Panorama_to_panorama_matching_for_location_recognition","319770714_Photo_tourism_Exploring_photo_collections_in_3D","319610560_A_Survey_on_Visual-Based_Localization_On_the_Benefit_of_Heterogeneous_Data","317161158_Panorama_to_Panorama_Matching_for_Location_Recognition","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","315928425_Are_Large-Scale_3D_Models_Really_Necessary_for_Accurate_Visual_Localization","312823476_DisLocation_Scalable_Descriptor_Distinctiveness_for_Location_Recognition","311611050_NetVLAD_CNN_architecture_for_weakly_supervised_place_recognition","308857352_247_place_recognition_by_view_synthesis"]}