{"id":"327430296_Social_learning_and_partisan_bias_in_the_interpretation_of_climate_trends","abstract":"Vital scientific communications are frequently misinterpreted by the lay public as a result of motivated reasoning, where people misconstrue data to fit their political and psychological biases. In the case of climate change, some people have been found to systematically misinterpret climate data in ways that conflict with the intended message of climate scientists. While prior studies have attempted to reduce motivated reasoning through bipartisan communication networks, these networks have also been found to exacerbate bias. Popular theories hold that bipartisan networks amplify bias by exposing people to opposing beliefs. These theories are in tension with collective intelligence research, which shows that exchanging beliefs in social networks can facilitate social learning, thereby improving individual and group judgments. However, prior experiments in collective intelligence have relied almost exclusively on neutral questions that do not engage motivated reasoning. Using Amazon’s Mechanical Turk, we conducted an online experiment to test how bipartisan social networks can influence subjects’ interpretation of climate communications from NASA. Here, we show that exposure to opposing beliefs in structured bipartisan social networks substantially improved the accuracy of judgments among both conservatives and liberals, eliminating belief polarization. However, we also find that social learning can be reduced, and belief polarization maintained, as a result of partisan priming. We find that increasing the salience of partisanship during communication, both through exposure to the logos of political parties and through exposure to the political identities of network peers, can significantly reduce social learning.","authors":["Douglas Guilbeault","Joshua Becker","Damon Centola"],"meta":["September 2018Proceedings of the National Academy of Sciences 115(39):201722664","DOI:10.1073/pnas.1722664115"],"references":["323460988_Crowdsourcing_Judgments_of_News_Source_Quality","322536604_The_Elusive_Backfire_Effect_Mass_Attitudes'_Steadfast_Factual_Adherence","322507331_Aggregated_knowledge_from_a_small_number_of_debates_outperforms_the_wisdom_of_large_crowds","317566561_Network_dynamics_of_social_influence_in_the_wisdom_of_crowds","315590257_Tweet_for_Behavior_Change_Using_Social_Media_for_the_Dissemination_of_Public_Health_Messages","345686198_Ideologues_without_Issues_The_Polarizing_Consequences_of_Ideological_Identities","325900992_Lazy_not_biased_Susceptibility_to_partisan_fake_news_is_better_explained_by_lack_of_reasoning_than_by_motivated_reasoning","313416200_COP21_climate_negotiators'_responses_to_climate_model_forecasts","312692162_How_social_influence_can_undermine_the_wisdom_of_crowd_effect","309881044_Overcoming_Endpoint_Bias_in_Climate_Change_Communication_The_Case_of_Arctic_Sea_Ice_Trends"]}