{"id":"327455530_DQNViz_A_Visual_Analytics_Approach_to_Understand_Deep_Q-Networks","abstract":"Deep Q-Network (DQN), as one type of deep reinforcement learning model, targets to train an intelligent agent that acquires optimal actions while interacting with an environment. The model is well known for its ability to surpass professional human players across many Atari 2600 games. Despite the superhuman performance, in-depth understanding of the model and interpreting the sophisticated behaviors of the DQN agent remain to be challenging tasks, due to the long-time model training process and the large number of experiences dynamically generated by the agent. In this work, we propose DQNViz, a visual analytics system to expose details of the blind training process in four levels, and enable users to dive into the large experience space of the agent for comprehensive analysis. As an initial attempt in visualizing DQN models, our work focuses more on Atari games with a simple action space, most notably the Breakout game. From our visual analytics of the agent's experiences, we extract useful action/reward patterns that help to interpret the model and control the training. Through multiple case studies conducted together with deep learning experts, we demonstrate that DQNViz can effectively help domain experts to understand, diagnose, and potentially improve DQN models.","authors":["Junpeng Wang","Liang Gou","Han-Wei Shen","Hao Yang"],"meta":["September 2018IEEE Transactions on Visualization and Computer Graphics PP(99):1-1","DOI:10.1109/TVCG.2018.2864504","Project: Explainable Deep Learning"],"references":["323888761_GANViz_A_Visual_Analytics_Approach_to_Understand_the_Adversarial_Game","320726805_Understanding_Hidden_Memories_of_Recurrent_Neural_Networks","319301967_Do_Convolutional_Neural_Networks_Learn_Class_Hierarchy","324387616_Visual_Analytics_for_Explainable_Deep_Learning","320280165_Rainbow_Combining_Improvements_in_Deep_Reinforcement_Learning","319770330_Prioritized_Experience_Replay","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319361860_Analyzing_the_Training_Processes_of_Deep_Generative_Models","319326423_EventThread_Visual_Summarization_and_Stage_Analysis_of_Event_Sequence_Data","319209701_A_Brief_Survey_of_Deep_Reinforcement_Learning","318541027_DeepEyes_Progressive_Visual_Analytics_for_Designing_Deep_Neural_Networks","317558021_Deep_reinforcement_learning_from_human_preferences","315806876_ActiVis_Visual_Exploration_of_Industry-Scale_Deep_Neural_Network_Models","313394269_Towards_Better_Analysis_of_Machine_Learning_Models_A_Visual_Analytics_Perspective","313135362_Q-learning"]}