{"id":"327428154_Metadata_Analysis_of_Scholarly_Events_of_Computer_Science_Physics_Engineering_and_Mathematics","abstract":"Although digitization has significantly eased publishing, finding a relevant and a suitable channel of publishing remains challenging. Scientific events such as conferences, workshops or symposia are among the most popular channels, especially in computer science, natural sciences, and technology. To obtain a better understanding of scholarly communication in different fields and the role of scientific events, metadata of scientific events of four research communities have analyzed: Computer Science, Physics, Engineering, and Mathematics. Our transferable analysis methodology is based on descriptive statistics as well as exploratory data analysis. Metadata used in this work have been collected from the OpenResearch.org community platform and SCImago as the main resources containing metadata of scientific events in a semantically structured way. There is no comprehensive information about submission numbers and acceptance rates in fields other than Computer Science. The evaluation uses metrics such as continuity, geographical and time-wise distribution, field popularity and productivity as well as event progress ratio and rankings based on the SJR indicator and h5-indices. Recommendations for different stakeholders involved in the life cycle of events, such as chairs, potential authors, and sponsors, are given.","authors":["Said Fathalla","Sahar Vahdati","Sören Auer","Christoph Lange"],"meta":["September 2018","DOI:10.1007/978-3-030-00066-0_10","In book: Digital Libraries for Open Knowledge (pp.116-128)Edition: 22nd International Conference on Theory and Practice of Digital Libraries, TPDL 2018, Porto, Portugal, September 10–13, 2018"],"references":["328623246_EVENTS_A_Dataset_on_the_History_of_Top-Prestigious_Events_in_Five_Computer_Science_Communities_3rd_International_Workshop_SAVE-SD_2017_Perth_Australia_April_3_2017_and_4th_International_Workshop_SAVE-","326890754_EVENTSKG_A_Knowledge_Graph_Representation_for_Top-Prestigious_Computer_Science_Events_Metadata_10th_International_Conference_ICCCI_2018_Bristol_UK_September_5-7_2018_Proceedings_Part_I","319420278_Analysing_Scholarly_Communication_Metadata_of_Computer_Science_Events","305406290_OpenResearch_Collaborative_Management_of_Scholarly_Communication_Metadata","309700661_OpenResearch_Collaborative_Management_of_Scholarly_Communication_Metadata","309381579_What_publications_metadata_tell_us_about_the_evolution_of_a_scientific_community_the_case_of_the_Brazilian_human-computer_interaction_conference_series","303851215_Bibliometric_analysis_of_Egyptian_publications_on_Hepatitis_C_virus_from_PubMed_using_data_mining_of_an_in-house_developed_database_HCVDBegy","289583290_SIGIR's_30th_anniversary","260146543_Exploratory_data_analysis_with_MATLAB","257662865_Meta-analysis_in_psychology_A_bibliometric_study"]}