{"id":"327488588_Governance_of_the_Bioeconomy_A_Global_Comparative_Study_of_National_Bioeconomy_Strategies","abstract":"More than forty states worldwide currently pursue explicit political strategies to expand and promote their bioeconomies. This paper assesses these strategies in the context of the global Sustainable Development Goals (SDGs). Our theoretical framework differentiates between four pathways of bioeconomic developments. The extent to which bioeconomic developments along these pathways lead to increased sustainability depends on the creation of effective governance mechanisms. We distinguish between enabling governance and constraining governance as the two fundamental political challenges in setting up an effective governance framework for a sustainable bioeconomy. Further, we lay out a taxonomy of political support measures (enabling governance) and regulatory tools (constraining governance) that states can use to confront these two political challenges. Guided by this theoretical framework, we conduct a qualitative content analysis of 41 national bioeconomy strategies to provide systematic answers to the question of how well designed the individual national bioeconomy strategies are to ensure the rise of a sustainable bioeconomy.","authors":["Thomas Dietz","Jan Börner","Jan Janosch Förster","Joachim von Braun"],"meta":["September 2018Sustainability 10(9):3190","DOI:10.3390/su10093190","Project: STRIVE (Sustainable TRade and InnoVation transfer in the bioEconomy: from national strategies to global sustainable development goals)"],"references":["319185821_Environmental_concerns_in_political_bioeconomy_discourses","315887758_The_Effectiveness_of_Payments_for_Environmental_Services","312558256_When_Policy_Hits_Practice_Structure_Agency_and_Power_in_South_African_Water_Governance","309153414_Transition_Governance_towards_a_Bioeconomy_A_Comparison_of_Finland_and_The_Netherlands","326247559_National_Interests_in_International_Society","321501769_Knowledge-Driven_Developments_in_the_Bioeconomy_Technological_and_Economic_Perspectives","318613724_Qualitative_Inhaltsanalyse","318175892_Measuring_the_Bioeconomy_Economics_and_Policies","316519374_Die_Bedingungen_einer_nachhaltigen_Biookonomie","316517973_Kriterien_fur_den_Erfolg_der_Biookonomie"]}