{"id":"327499855_Impact_of_the_Quality_of_Returned-Used_Products_on_the_Optimal_Design_of_a_Manufacturing_Remanufacturing_System_under_Carbon_Emissions_Constraints","abstract":"Due to environmental legislation pressure and the competition between manufacturing firms, a high number of production firms are obliged to collect and remanufacture used products. As a result, firm leaders and academic researchers are devoted to developing and managing new sustainable supply chains. Most of the published works in the literature assume that new and remanufactured products are of the same quality, and that all of the returned-used products are remanufacturable. However, in practice, new products are perceived as being of higher quality than remanufactured ones, and the remanufacturing depends on the quality of the returned-used products. This paper aims to bridge this gap in the literature by providing an optimal design for a manufacturing/remanufacturing system that differentiates between new and remanufactured products and sorts the used products into three quality levels. The objective is to determine the optimal storage capacities and production decisions regarding new and remanufactured products while considering carbon emissions. A model is developed to consider the above issues and determine the total profit. An evolutionary algorithm is developed to find the optimal values regarding store capacities and the remanufacturing periods of new and remanufactured products that maximize the total profit. Numerical results are provided to study the impact of the quantity and quality of returned-used products on the optimal values of store capacities, the remanufacturing periods of new and remanufactured products, and carbon emissions.","authors":["Sadok Turki","Nidhal Rezg"],"meta":["September 2018Sustainability 10(9)","DOI:10.3390/su10093197"],"references":["326420405_The_Optimal_Carbon_Reduction_and_Return_Strategies_under_Carbon_Tax_Policy","326140647_The_Effects_of_Customer_Perception_and_Participation_in_Sustainable_Supply_Chain_Management_A_Smartphone_Industry_Study","325925757_Remanufacturing_Decisions_with_WTP_Discrepancy_and_Uncertain_Quality_of_Product_Returns","325095283_Modelling_and_optimization_of_a_manufacturingremanufacturing_system_with_storage_facility_under_carbon_cap_and_trade_policy","324330301_Closed-Loop_Supply_Chain_Planning_Model_of_Rare_Metals","324086242_The_Optimal_Decisions_for_a_Sustainable_Supply_Chain_with_Carbon_Information_Asymmetry_under_Cap-and-Trade","322934076_How_to_Achieve_Supply_Chain_Sustainability_Efficiently_Taming_the_Triple_Bottom_Line_Split_Business_Cycle","322690386_Environmental_Sustainability_and_Energy-Efficient_Supply_Chain_Management_A_Review_of_Research_Trends_and_Proposed_Guidelines","321666573_An_Integrated_Carbon_Policy-Based_Interactive_Strategy_for_Carbon_Reduction_and_Economic_Development_in_a_Construction_Material_Supply_Chain","322503940_Static_and_Dynamic_Pricing_Strategies_in_a_Closed-Loop_Supply_Chain_with_Reference_Quality_Effects"]}