{"id":"327455314_Multi-center_Brain_Imaging_Classification_Using_A_Novel_3D_CNN_Approach","abstract":"With the development of brain imaging technology, increasing amounts of magnetic resonance imaging (MRI) data are being acquired, and traditional computational analysis methods based on single sites and small samples are facing substantial challenges. Deep learning technology, which is born via artificial intelligence, has shown the powerful ability to solve the classification problem based on big data in many studies, while has not been widely used in brain imaging classification. Herein, we utilized our proposed novel 3D deep adding neural network (3D DANet) to classify 6008 samples from the largest datasets in the brain imaging field collected from more than 61 centers. The proposed method utilizes multiple convolutional layers to extract gradient information in different orientations and combines spatial information at two scales via the adding operation. High accuracy (over 92.5%) was obtained with a standard 5-fold cross-validation strategy, demonstrating that the proposed method can effectively handle big data classifications from multiple centers. Compared with some traditional classification methods and some deep learning architectures, the proposed method was more accurate, demonstrating its stronger power to classify data from multiple centers. Our cross-site classification results prove that the proposed method is robust when training on a dataset and testing on another dataset. To the best of our knowledge, our work is the first to classify neuroimaging data on such a large scale from multiple centers with such high accuracy. With its improved performance in classification and transferable program codes, the proposed method can potentially be used in intelligent medical treatment strategies and clinical practices based on mobile terminal.","authors":["Lin Yuan","Xue Wei","Hui Shen","Ling-Li Zeng"],"meta":["September 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2868813"],"references":["322037663_Metric_learning_with_spectral_graph_convolutions_on_brain_connectivity_networks","320389589_3D_CNN_Based_Automatic_Diagnosis_of_Attention_Deficit_Hyperactivity_Disorder_Using_Functional_and_Structural_MRI","319402719_Denser_Growing_Fiber_Connections_Induce_3-hinge_Gyral_Folding","326099136_A_survey_on_deep_learning_for_big_data","322391725_Functional_connectivity_predicts_gender_Evidence_for_gender_differences_in_resting_brain_connectivity","321637148_The_impact_of_psychosis_on_brain_anatomy_in_bipolar_disorder_A_structural_MRI_study","319770355_Generative_Adversarial_Nets","319001649_A_meta-analysis_of_sex_differences_in_human_brain_structure","317834740_Application_of_machine_learning_classification_for_structural_brain_MRI_in_mood_disorders_Critical_review_from_a_clinical_perspective","316412184_VoxResNet_Deep_voxelwise_residual_networks_for_brain_segmentation_from_3D_MR_images"]}