{"id":"327468426_Essential_axes_of_knowledge_society_and_socioformation","abstract":"The knowledge society is the new type of society that has been sought to create around the world in order to overcome the current problems related to global warming, the emergence of new diseases, poverty, hunger, terrorism, violence racism, lack of inclusion and poor quality of life for a large percentage of people in the world. The knowledge society is leading to the transformation of all professions, disciplines and areas, such as health, engineering, education, sociology, anthropology, basic sciences, architecture, among others. This new type of society demands a more interdisciplinary and transdisciplinary work, focused on contributing to improve living conditions with support in citizen culture, ethics and information technologies. \n\nThe construction of the knowledge society demands research processes that guide the development of new concepts and procedures in the different disciplines and sciences, as well as social changes, transformations in organizations and implementation of strategies that lead to the development of new skills in people , such as collaboration and entrepreneurship. To achieve the knowledge society, one of the alternatives is to develop human talent in people. On this, new approaches and educational models are being created with application in society, in organizations and also in educational institutions, such as connectivism, dialogic pedagogy, complex education and socioeducation, among others. \n\nThe socioformation is an approach focused on the development of human talent in the community, organizations and training institutions, based on project management and collaborative work so that the different actors are entrepreneurs and contribute to improve living conditions solving the problems of the environment with a global and systemic vision, with support of the communication and information technology. From the socioformation, a series of concrete strategies are proposed to orient individuals and organizations in the process of transformation towards knowledge, which are characterized by metacognition, the application of the principles of complex thinking, work in community, resolution of problems and the co-construction of the knowledge to face the challenges of the environment. \n\nThe purpose of this book is to describe the different axes of the knowledge society and the socioformation in a synthetic way, so that they serve as a general guide to researchers and professionals in different areas for their application in the environment. It is important to complement the ideas presented with the bibliographic material suggested at the end.\n\nINDEX\n\nPRESENTATION \n\nCHAPTER 1. KNOWLEDGE SOCIETY AXES \n\nIntroduction 1.1 Knowledge society concept 1.1.1 Information society 1.1.2 Network society 1.2 Knowledge and technology society 1.2.1 Socioformative Technology 1.3 Knowledge society and organizations 1.3.1 Organizations transformations 1.3.2 Educational institutions transformation 1.4 Sustainable social development References\n\nCHAPTER 2. THE SOCIOFORMATION STRUCTURE \n\nIntroduction 2.1 Concept of socioformation 2.1.1 Complex thinking • Development of complex thinking • Assessment of complex thinking 2.1.2 Ethical life project • Values • Responsability • Respect • Honesty • Equity • Solidarity • Protection of life • Attitudes 2.1.3 Entrepreneurship 2.1.4 Collaborative work 2.1.5 Metacognition 2.2 Linking actors References\n\nCHAPTER 3: HUMAN TALENT MANAGEMENT \n\nIntroduction 3.1 Human talent 3.1.1 Competencies • Basic competencies • Specific competencies • Generic competencies • Generic competence of training self-management • Generic oral and written communication competence • Generic oral and written communication in a foreign language competence • Generic collaborative work and leadership competence • Generic knowledge management competence • Generic entrepreneurship competence • Generic research competence • Generic quality management competence 3.1.2 Performance areas 3.1.3 Results of learning or key learning 3.1.4 Context problem 3.1.5 Context 3.1.6 Products (evidences) 3.1.7 Indicators or criteria 3.2 Human talent management 3.3 Basic axes of human talent management 3.4 Integral formation References\n\nCHAPTER 4: SOCIOFORMATIVE TAXONOMY \n\nIntroduction 4.1 The importance of taxonomies in the human talent management 4.2 Domain levels 4.2.1 The importance of taxonomies in the human talent management 4.2.2 Domain levels proposed by Marzano Verbs for levels of domain proposed by Marzano and Kendall 4.2.3 Domain levels proposed by the socioformation • Verbs of support for domain levels from the socioformation 4.2.4 Development levels by dimensions 4.3 Advantages of socioformative taxonomy with respect to other taxonomies 4.4 Suggestions to write learning outcomes References\n\nCHAPTER 5. SOCIOFORMATIVE CURRICULAR MANAGEMENT PROCESS AND EDUCATIONAL QUALITY \n\nIntroducción 5.1 Educational quality 5.2 Socioformative curriculum 5.3 Socioformative action research 5.4 Socioformative curriculum management model • Process 1. Collaborative work in curriculum management • Process 2. Educational and teaching model • Pedagogical Principles • Process 3. Study of internal and external context • Study of internal context • Study of external context • Process 4. Graduate process • Process 5. Entry process • Process 6. Curricular map • Process 7. Education and evaluation regulations • Process 8. Planning of academic administration • Process 9. Planning and implementation of educational projects • Process 10. Management of human directive, administrative, and teaching talent • Process 11. Resource management • Process 12. Mediation of integral education 5.5 Life cycles 5.6 Types of life cycles 5.7 Propaedeutic cycles 5.7.1 Most relevant propaedeutic cycles from the socioformation 5.7.2 Propaedeutic cycle for high school education form the socioformation 5.7.3 Propaedeutic cycle of technical education 5.7.4 Propaedeutic cycle of technical education 5.7.5 Propaedeutic cycle of professional or university education (bachelor’s program) 5.7.6 Propaedeutic cycles of higher and technical education from the socioformation 5.8 Curricular metacognition 5.9 Curricular self-organization 5.9.1 Curricular hologramatic 5.9.2 Curricular recursivity 5.9.3 Curricular dialogic References","authors":["Sergio Tobon"],"meta":["September 2018","DOI:10.24944/isbn.","Edition: 2017Publisher: KresearchEditor: KresearchISBN: 978-1-945721-19-9"],"references":["288671357_La_Socioformacion_Un_Estudio_Conceptual","288671205_Sociedad_del_Conocimiento_Estudio_documental_desde_una_perspectiva_humanista_y_compleja","281345394_The_New_Taxonomy_of_Educational_Objectives","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives","49501841_Introduccion_al_pensamiento_complejo","39152704_Los_siete_saberes_necesarios_para_la_educacion_del_futuro"]}