{"id":"327430203_Automatic_Cell_Segmentation_by_Adaptive_Thresholding_ACSAT_for_Large-Scale_Calcium_Imaging_Datasets","abstract":"Advances in calcium imaging have made it possible to record from an increasingly larger number of neurons simultaneously. Neuroscientists can now routinely image hundreds to thousands of individual neurons. An emerging technical challenge that parallels the advancement in imaging a large number of individual neurons is the processing of correspondingly large datasets. One important step is the identification of individual neurons. Traditional methods rely mainly on manual or semimanual inspection, which cannot be scaled for processing large datasets. To address this challenge, we focused on developing an automated segmentation method, which we refer to as automated cell segmentation by adaptive thresholding (ACSAT). ACSAT works with a time-collapsed image and includes an iterative procedure that automatically calculates global and local threshold values during successive iterations based on the distribution of image pixel intensities. Thus, the algorithm is capable of handling variations in morphological details and in fluorescence intensities in different calcium imaging datasets. In this paper, we demonstrate the utility of ACSAT by testing it on 500 simulated datasets, two wide-field hippocampus datasets, a wide-field striatum dataset, a wide-field cell culture dataset, and a two-photon hippocampus dataset. For the simulated datasets with truth, ACSAT achieved >80% recall and precision when the signal-to-noise ratio was no less than ∼24 dB.","authors":["Simon P. Shen","Hua-an Tseng","Kyle Hansen","Ruofan Wu"],"meta":["September 2018eNeuro 5(5):ENEURO.0056-18.2018","DOI:10.1523/ENEURO.0056-18.2018"],"references":["325271360_Video-rate_volumetric_neuronal_imaging_using_3D_targeted_illumination","323921072_Axial_localization_with_modulated-illumination_extended-depth-of-field_microscopy","323350236_Efficient_and_accurate_extraction_of_in_vivo_calcium_signals_from_microendoscopic_video_data","317043793_Global_Representations_of_Goal-Directed_Behavior_in_Distinct_Cell_Types_of_Mouse_Neocortex","311852420_Long-Term_Optical_Access_to_an_Estimated_One_Million_Neurons_in_the_Live_Mouse_Cortex","303488588_Efficient_and_accurate_extraction_of_in_vivo_calcium_signals_from_microendoscopic_video_data","293637623_An_integrative_approach_for_analyzing_hundreds_of_neurons_in_task_performing_mice_using_wide-field_calcium_imaging","287358316_Note_An_automated_image_analysis_method_for_high-throughput_classification_of_surface-bound_bacterial_cell_motions","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","289585011_Simultaneous_Denoising_Deconvolution_and_Demixing_of_Calcium_Imaging_Data"]}