{"id":"327459161_Mobi-Flow_Mobility-Aware_Adaptive_Flow-Rule_Placement_in_Software-Defined_Access_Network","abstract":"In this paper, we propose a mobility-aware adaptive flow-rule placement scheme, named as Mobi-Flow, with an aim to maximize the overall performance in a software-defined access network (SDAN). The proposed scheme consists of two components path-estimator and flow-manager. The path-estimator predicts future locations of end-users present in the network, depending on their history location sets, and delivers the predicted locations to the flow-manager. The flow-manager utilizes order K Markov predictor to associate access devices (ADs) with the users based on the predicted locations. We use the mixed integer linear programming (MILP) approach to determine the optimal number of ADs, in order to minimize the energy consumption and cost associated with flow-rule placement. The proposed scheme, Mobi-Flow, can be integrated atop the SDN controller to support the emerging concept of SDN-based IoT networking. Through extensive simulations, we show that Mobi-Flow is beneficial for minimizing the delay, and number of activated APs, control overhead, energy consumption, and cost in the network, compared to the existing schemes open shortest path first (OSPF), minimum occupied rule capacity (MRC), distributed (non-SDN), and MoRule. Particularly, the proposed scheme is capable of reducing the cost by 39%, 38%, 65%, and 11%, compared to OSPF, MRC, distributed, and MoRule, respectively.","authors":["Samaresh Bera","Sudip Misra","Mohammad S. Obaidat"],"meta":["September 2018IEEE Transactions on Mobile Computing PP(99):1-1","DOI:10.1109/TMC.2018.2868932"],"references":["321924132_On_Fair_Rule_Caching_in_Software_Defined_Radio_Access_Networks","319286893_Software-Defined_Networking_for_Internet_of_Things_A_Survey","317083799_Linear_and_Nonlinear_Programming","312517536_A_Novel_Multipath-Transmission_Supported_Software_Defined_Wireless_Network_Architecture","308831673_OFFICER_A_general_Optimization_Framework_for_OpenFlow_Rule_Allocation_and_Endpoint_Policy_Enforcement","321620119_Linear_and_Nonlinear_Programming","321257204_Characterizing_and_classifying_IoT_traffic_in_smart_cities_and_campuses","314059586_Statistical_Formulae_for_Calculating_Some_95_Confidence_Intervals","309201797_A_software_defined_networking_architecture_for_the_internet-of-things","304415646_Traffic-Aware_Placement_of_NFV_Middleboxes"]}