{"id":"327540206_Auto-marking_System_A_Support_Tool_for_Learning_of_Programming","abstract":"Computer programming requires skills in designing algorithms, understanding syntax, writing programs, as well as the ability to correct errors in order to produce good programs. These skills can be developed through much practice on a continuous basis. The students' proficiency in programming is measured by the number of exercises that can be solved correctly within a specified period. From past observations, it is discovered that most students were able to solve the problems given during laboratory sessions. However, their performances did not carry over to laboratory tests. This situation points to the possibility that the students might not have performed adequate self-practice in preparing for laboratory tests. In a student-centered learning environment, fulfilling the notional learning hours is essential to ensure that students are prepared to take their subsequent classes. Based on a constructivist-learning framework, this article reports the development and evaluation of a prototype system to assist in the selflearning of programming. The online Auto-marking Programming Exercise System was developed based on the UVa Online Judge as a benchmark. The system can provide real-time feedback to students immediately after the students submit their programs. This instant feedback is an essential characteristic of the constructivist approach to learning. This will help students learn to programme in a useful way. The system is tested and evaluated for usability by selected users from among instructors and former students of computer programming course.","authors":["Marini Abu Bakar","Mohd Isrul Esa","Norleyza Jailani","Muriati Mukhtar"],"meta":["August 2018International Journal on Advanced Science Engineering and Information Technology 8(4):1313-1320","DOI:10.18517/ijaseit.8.4.6416"],"references":["309176375_Introductory_Programming_Subject_in_European_Higher_Education","308822905_Code_Hunt_Experience_with_Coding_Contests_at_Scale","305081685_Towards_a_Systematic_Review_of_Automated_Feedback_Generation_for_Programming_Exercises","296696274_The_Influence_of_Problem_Solving_Abilities_on_Students'_Performance_on_Different_Assessment_Tasks_in_Introductory_Programming","281114287_I'm_a_Facilitator_of_Learning_Understanding_What_Teachers_and_Students_Do_Within_Student-Centered_Physical_Education_Models","276852167_Designing_for_deeper_learning_in_a_blended_computer_science_course_for_middle_school_students","257716774_Major_Problems_in_Basic_Programming_that_Influence_Student_Performance","323818312_PC_2_to_support_instant_feedback_and_good_programming_practice","313467367_Competitive_learning_in_informatics_The_UVa_online_judge_experience","252044423_Monitoring_system_of_student_situation_in_introductory_C_programming_exercise_with_a_contest_style"]}