{"id":"327566710_Principles_of_Insect_Path_Integration","abstract":"Continuously monitoring its position in space relative to a goal is one of the most essential tasks for an animal that moves through its environment. Species as diverse as rats, bees, and crabs achieve this by integrating all changes of direction with the distance covered during their foraging trips, a process called path integration. They generate an estimate of their current position relative to a starting point, enabling a straight-line return, following what is known as a home vector. While in theory path integration always leads the animal precisely back home, in the real world noise limits the usefulness of this strategy when operating in isolation. Noise results from stochastic processes in the nervous system and from unreliable sensory information, particularly when obtaining heading estimates. Path integration, during which angular self-motion provides the sole input for encoding heading (idiothetic path integration), results in accumulating errors that render this strategy useless over long distances. In contrast, when using an external compass this limitation is avoided (allothetic path integration). Many navigating insects indeed rely on external compass cues for estimating body orientation, whereas they obtain distance information by integration of steps or optic-flow-based speed signals. In the insect brain, a region called the central complex plays a key role for path integration. Not only does the central complex house a ring-attractor network that encodes head directions, neurons responding to optic flow also converge with this circuit. A neural substrate for integrating direction and distance into a memorized home vector has therefore been proposed in the central complex. We discuss how behavioral data and the theoretical framework of path integration can be aligned with these neural data.","authors":["Stanley Heinze","Ajay Narendra","Allen Cheung"],"meta":["September 2018Current biology: CB 28(17):R1043-R1058","DOI:10.1016/j.cub.2018.04.058","Project: Brain in Brain - The insect central complex underlying navigational decisions"],"references":["323166112_Angular_velocity_integration_in_a_fly_heading_circuit","322258742_Recurrent_Circuitry_for_Balancing_Sleep_Need_and_Sleep","321700270_The_evolution_of_honey_bee_dance_communication_A_mechanistic_perspective","321700073_Ocellar_structure_is_driven_by_the_mode_of_locomotion_and_activity_time_in_Myrmecia_ants","321051888_The_Role_of_Celestial_Compass_Information_in_Cataglyphis_Ants_during_Learning_Walks_and_for_Neuroplasticity_in_the_Central_Complex_and_Mushroom_Bodies","320254232_An_Anatomically_Constrained_Model_for_Path_Integration_in_the_Bee_Brain","319949313_Unraveling_the_neural_basis_of_insect_navigation","319382874_Polarized_light_use_in_the_nocturnal_bull_ant_Myrmecia_midas","320538224_Polarized-light_processing_in_insect_brains_Recent_insights_from_the_desert_locust_the_monarch_butterfly_the_cricket_and_the_fruit_fly","318575476_Idiothetic_Path_Integration_in_the_Fruit_Fly_Drosophila_melanogaster"]}