{"id":"327565117_Ecological_Design-Based_Research_for_Computer_Science_Education_Affordances_and_Effectivities_for_Elementary_School_Students","abstract":"This article integrates an ecological approach and design-based research in computer science education research by following the simultaneous development of a computer programming environment and curriculum for elementary school age children over 2-1/2 years. We studied the alignment of the affordances provided by the programming environment and curriculum with the effectivities of students in 4th through 6th grade (9-12 years old). We used the computer science concept of initializing as a tracer idea and both qualitative and quantitative data to identify mismatches between the affordances provided by our programming environment and the learners’ effectivities. These included requisite mathematical skills, confusion between resetting and setting up, and incorrectly assuming that features of the programming environment conveyed information. We then describe how we addressed the mismatches by removing or adding functionality to the programming environment, adding signifiers, adapting the curriculum to include scaffolding related to the effectivities, or removing activities.","authors":["Danielle Boyd Harlow","Hilary Dwyer","Alexandria K. Hansen","Ashley Iveland"],"meta":["September 2018Cognition and Instruction 36(3):1-23","DOI:10.1080/07370008.2018.1475390","Project: DEPICT: Developing Elementary (learning) Progressions to Integrate Computational Thinking"],"references":["309154985_Situating_Multimodal_Learning_Analytics","296847071_Initialization_in_Scratch_Seeking_Knowledge_Transfer","296846980_Fourth_Grade_Students_Reading_Block-Based_Programs_Predictions_Visual_Cues_and_Affordances","283425066_Computer_Science_and_Engineering_Design_in_the_Science_Classroom","277955015_Interactive_Design_by_Children_A_Construct_Map_for_Programming","275274983_Floors_and_Flexibility_Designing_a_Programming_Environment_for_4th-6th_Grade_Classrooms","324352933_The_Ecological_Approach_to_Visual_Perception","288042361_Hci_for_Kids","275156985_Implications_of_Complexity_for_Research_on_Learning_Progressions","273947569_Beyond_the_digital_divide_An_ecological_approach_to_gameplay"]}