{"id":"327518683_Turning_Words_Into_Consumer_Preferences_How_Sentiment_Analysis_Is_Framed_in_Research_and_the_News_Media","abstract":"Sentiment analysis is an increasingly popular instrument for the analysis of social media discourse. Sentiment scores seemingly represent an objective means of assessing the mood of social media users, consumers, and the public at large. Similar to other computational tools, sentiment analysis promises to reduce complexity and mitigate information overload, and to inform the decisions of marketers, pollsters, and scholars with reliable data. This article argues that the assumptions encoded into sentiment analysis as a method are accompanied by a number of constraints, both regarding its technical limitations (in terms of what sentiment analysis can and cannot accomplish) and conceptually (in terms of what the notion of sentiment implicitly represents), constraints which are often de-emphasized in public discourse. After providing an overview of its history and development in computer science as well as psychology and the social sciences, we turn to the role of sentiment as a currency in the attention economy. We then present a brief study of common framing of sentiment analysis in the news media, highlighting the expectations that exist regarding its analytical capabilities. We close by discussing the kind of conceptual work that takes place around computational methods such as sentiment analysis in specific cultural environments, highlighting their influence on the public imaginary.","authors":["Cornelius Puschmann","Alison Powell"],"meta":["July 2018Social Media + Society 4(3):205630511879772","DOI:10.1177/2056305118797724"],"references":["342784984_A_Theoretical_Map_for_Selecting_Among_Text_Analysis_Methods","323832097_Digital_Traces_in_Context_Reuniting_a_Divided_Public_Tracing_the_TTIP_Debate_on_Twitter_and_in_Traditional_Media","307840661_Understanding_Social_Media_Logic","302869229_Analyzing_public_sentiments_online_Combining_human-_and_computer-based_content_analysis","342786635_The_Unobtrusive_Measurement_of_Psychological_States_and_Traits","331214593_Political_Turbulence_How_Social_Media_Shape_Collective_Action","328304906_Sentiment_analysis_and_subjectivity","312622550_Speaking_Sociologically_with_Big_Data_Symphonic_Social_Science_and_the_Future_for_Big_Data_Research","311765985_I_Saw_You_in_the_News_Mediated_and_Direct_Intergroup_Contact_Improve_Outgroup_Attitudes","309436401_The_Heart_and_Soul_of_the_Web_Sentiment_Strength_Detection_in_the_Social_Web_with_SentiStrength"]}