{"id":"327576882_Top_Fifty_Highly_Cited_Publications_on_the_Internet_of_Things","abstract":"The present study aimed at analyzing the publication pattern of highly cited research publications of Internet of Things. Web of Science citation database was used to extract data for the study. The top fifty highly cited publications were considered as the sample of this study. The data were analyzed based on publication year, document type, source title, time cited, usage count, authorship pattern, collaborative coefficient, research collaboration, and research areas. The findings revealed that majority of the publications were research articles and most of them were published in IEEE journals. Research articles written by multiple authors were more prominent than single-author publications. Researchers from USA and China preferred collaborative research and researchers from Italy preferred non-international collaborative research. The researchers from developed western countries are highly engaging with research in Internet of Things. The most popular research areas under Internet of Things are computer science and telecommunication","authors":["Prasadi Kanchana Jayasekara","Abu Ks"],"meta":["July 2018Journal of the University Librarians Association of Sri Lanka 21(2):140","DOI:10.4038/jula.v21i2.7922"],"references":["323950352_Highly_cited_articles_in_wind_tunnel-related_research_a_bibliometric_analysis","320191882_Highly_Cited_Publications_Output_by_India_in_Computer_Science_1996-15_A_Scientometric_Assessment","317175637_The_fifty_highest_cited_papers_in_anterior_cruciate_ligament_injury","311248474_Highly_Cited_Articles_in_Science_Citation_Index_Expanded_-_Subject_Category_of_Horticulture_A_Bibliometric_Analysis","297728505_Internet_of_things_A_scientometric_assessment_of_global_output_2005-2014","321587954_Internet_of_Things_A_Scientometric_Review","311394140_Highly_cited_publications_in_World_War_II_a_bibliometric_analysis","308021808_The_Internet_of_Things_The_Story_So_Far","305851301_Vision_applications_and_future_challenges_of_Internet_of_Things_A_bibliometric_study_of_the_recent_literature","301888287_That_'Internet_of_Things'_Thing"]}