{"id":"327599546_Strategic_decision_making_about_travel_during_disease_outbreaks_A_game_theoretical_approach","abstract":"Visitors can play an important role in the spread of infections. Here, we incorporate an epidemic model into a game theoretical framework to investigate the effects of travel strategies on infection control. Potential visitors must decide whether to travel to a destination that is at risk of infectious disease outbreaks. We compare the individually optimal (Nash equilibrium) strategy to the group optimal strategy that maximizes the overall population utility. Economic epidemiological models often find that individual and group optimal strategies are very different. By contrast, we find perfect agreement between individual and group optimal strategies across a wide parameter regime. For more limited regimes where disagreement does occur, the disagreement is (i) generally very extreme; (ii) highly sensitive to small changes in infection transmissibility and visitor costs/benefits; and (iii) can manifest either in a higher travel volume for individual optimal than group optimal strategies, or vice versa. The simulations show qualitative agreement with the 2003 severe acute respiratory syndrome (SARS) outbreak in Beijing, China. We conclude that a conflict between individual and group optimal visitor travel strategies during outbreaks may not generally be a problem, although extreme differences could emerge suddenly under certain changes in economic and epidemiological conditions.","authors":["Shi Zhao","Chris Bauch","Daihai He"],"meta":["September 2018Journal of The Royal Society Interface 15(146):20180515","DOI:10.1098/rsif.2018.0515"],"references":["318711753_Effects_of_Reactive_Social_Distancing_on_the_1918_Influenza_Pandemic","307536753_Statistical_physics_of_vaccination","304065450_Prevention_and_Control_of_Zika_as_a_Mosquito-Borne_and_Sexually_Transmitted_Disease_A_Mathematical_Modeling_Analysis","301874255_Spatio-temporal_patterns_of_influenza_B_proportions","283895679_Differences_in_the_seasonality_of_MERS-CoV_and_influenza_in_the_Middle_East","280537968_Coupled_disease-behavior_dynamics_on_complex_networks_A_review","334563761_Modeling_Infectious_Diseases_in_Humans_and_Animals","279304620_Why_the_panic_South_Korea's_MERS_response_questioned","278690611_Behavioral_Epidemiology_of_Infectious_Diseases_An_Overview","275667090_Game_theory_of_pre-emptive_vaccination_before_bioterrorism_or_accidental_release_of_smallpox"]}