{"id":"327576207_Perfil_del_ingeniero_de_sistemas_formado_por_universidades_y_el_perfil_exigido_en_empresas_de_base_tecnologica_en_Colombia_una_comparacion","abstract":"En esta investigación se realiza una caracterización del perfil laboral y profesional de los ingenieros de sistemas en Colombia, y se analizan, de manera comparativa, a la luz de estándares internacionales de la Association for Computing Machinery –ACM. Esto con el fin de conocer aspectos de formación de la carrera profesional, así como las oportunidades laborales exigidas por el sector productivo del contexto colombiano. El proceso metodológico de investigación fue asumido desde el paradigma cuantitativo, con un enfoque empírico analítico y tipo de investigación correlacional descriptivo, con un muestreo no probabilístico intencional por conveniencia, tanto de las universidades como empresas de base tecnológica seleccionadas. Uno de sus principales hallazgos consistió en identificar que en las disciplinas de las Ciencias de la Computación (CS) y Sistemas de Información (IS), el perfil laboral requerido por las empresas tiene más exigencias en relación con el perfil laboral con el que egresan los estudiantes de ingeniería de sistemas de las universidades colombianas.","authors":["Robinson Andres Jimenez Toledo","Alvaro Alexander Martinez Navarro","Giovanni Hernandez","Javier Alejandro Jiménez Toledo"],"meta":["July 2017trilogía Ciencia Tecnología Sociedad 9(17):201-217","DOI:10.22430/21457778.637","Projects: System engineer profileCLEI 2017"],"references":["317814911_Paradigmas_de_la_investigacion_sobre_lo_cuantitativo_y_lo_cualitativo","315897674_Entrepreneurial_intention_among_engineering_students_The_role_of_entrepreneurship_education","267495016_Improvement_of_Students_Professional_Formation_Curriculums_to_Meet_the_Market_Work","266592264_Professional_Training_in_Software_Engineering_A_Critical_Need_in_the_United_States_Formacion_Profesional_en_Ingenieria_de_Software_Una_Necesidad_Critica_en_los_Estados_Unidos","39724285_La_formacion_por_competencias_laborales_Guia_tecnico_pedagogica_para_docentes_de_formacion_profesional_2a_ed"]}