{"id":"327587754_A_catalogue_associating_security_patterns_and_attack_steps_to_design_secure_applications","abstract":"Design Patterns are now widely accepted and used in software engineer- ing; they represent generic and reusable solutions to common problems in software design. Security patterns are specialised patterns whose purpose is to help design applications that should meet security requirements. The enthusiasm surrounding security patterns has made emerge several catalogues listing up to 180 different pat- terns at the moment. This growing number brings an increased difficulty in choos- ing the most appropriate patterns for a given design problem. We propose a secu- rity pattern classification to facilitate the security pattern choice and a classification method based on data integration. The classification exposes relationships among software attacks, security principles and security patterns. It expresses the pattern combinations that are countermeasures to a given attack. This classification is semi- automatically inferred by means of a data-store integrating disparate publicly avail- able security data. The data-store is also used to generate Attack Defense Trees. In our context, these illustrate, for a given attack, its sub-attacks, steps, techniques and the related defenses given under the form of security pattern combinations. Such trees make the pattern classification more readable even for beginners in security patterns. Finally, we evaluate on human subjects the benefits of using a pattern clas- sification established for Web applications, which covers 215 attacks, 66 security principles and 26 security patterns.","authors":["Sébastien Salva","Loukmen Regainia"],"meta":["January 2019Journal of Computer Security 27(1):49--74","DOI:10.3233/JCS-171063"],"references":["319151372_Controlled_Experiments_with_Student_Participants_in_Software_Engineering_Preliminary_Results_from_a_Systematic_Mapping_Study","314522351_A_Methodology_of_Security_Pattern_Classification_and_of_Attack-Defense_Tree_Generation","313419746_A_classification_methodology_for_security_patterns_to_help_fix_software_weaknesses","308828806_Do_Security_Patterns_Really_Help_Designers","273388342_Attack_Trees_with_Sequential_Conjunction","331274587_Using_an_Ontology_to_Suggest_Software_Design_Patterns_Integration","325666492_A_Security_Pattern_Classification_Based_on_Data_Integration","300349108_Revisiting_Architectural_Tactics_for_Security","290610187_Security_Engineering_with_Patterns_-_Origins_Theoretical_Models_and_New_Applications","289901069_Vulnerability-Based_Security_Pattern_Categorization_in_Search_of_Missing_Patterns"]}