{"id":"327588289_Making_the_V_in_VQA_Matter_Elevating_the_Role_of_Image_Understanding_in_Visual_Question_Answering","abstract":"The problem of visual question answering (VQA) is of significant importance both as a challenging research question and for the rich set of applications it enables. In this context, however, inherent structure in our world and bias in our language tend to be a simpler signal for learning than visual modalities, resulting in VQA models that ignore visual information, leading to an inflated sense of their capability. We propose to counter these language priors for the task of VQA and make vision (the V in VQA) matter! Specifically, we balance the popular VQA dataset (Antol et al., in: ICCV, 2015) by collecting complementary images such that every question in our balanced dataset is associated with not just a single image, but rather a pair of similar images that result in two different answers to the question. Our dataset is by construction more balanced than the original VQA dataset and has approximately twice the number of image-question pairs. Our complete balanced dataset is publicly available at http://visualqa.org/ as part of the 2nd iteration of the VQA Dataset and Challenge (VQA v2.0). We further benchmark a number of state-of-art VQA models on our balanced dataset. All models perform significantly worse on our balanced dataset, suggesting that these models have indeed learned to exploit language priors. This finding provides the first concrete empirical evidence for what seems to be a qualitative sense among practitioners. We also present interesting insights from analysis of the participant entries in VQA Challenge 2017, organized by us on the proposed VQA v2.0 dataset. The results of the challenge were announced in the 2nd VQA Challenge Workshop at the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2017. Finally, our data collection protocol for identifying complementary images enables us to develop a novel interpretable model, which in addition to providing an answer to the given (image, question) pair, also provides a counter-example based explanation. Specifically, it identifies an image that is similar to the original image, but it believes has a different answer to the same question. This can help in building trust for machines among their users.","authors":["Yash Goyal","Tejas Khot","Aishwarya Agrawal","Douglas Summers Stay"],"meta":["April 2019International Journal of Computer Vision 127(4)","DOI:10.1007/s11263-018-1116-0"],"references":["322060642_Multi-modal_Factorized_Bilinear_Pooling_with_Co-attention_Learning_for_Visual_Question_Answering","319770438_Long-Term_Recurrent_Convolutional_Networks_for_Visual_Recognition_and_Description","329747236_Tips_and_Tricks_for_Visual_Question_Answering_Learnings_from_the_2017_Challenge","329743446_Don't_Just_Assume_Look_and_Answer_Overcoming_Priors_for_Visual_Question_Answering","329740168_Bottom-Up_and_Top-Down_Attention_for_Image_Captioning_and_Visual_Question_Answering","322060180_An_Analysis_of_Visual_Question_Answering_Algorithms","322057786_Learning_to_Reason_End-to-End_Module_Networks_for_Visual_Question_Answering","321487939_Don't_Just_Assume_Look_and_Answer_Overcoming_Priors_for_Visual_Question_Answering","320967203_CLEVR_A_Diagnostic_Dataset_for_Compositional_Language_and_Elementary_Visual_Reasoning","319770345_Exploring_Models_and_Data_for_Image_Question_Answering"]}