{"id":"327527752_New_Methods_for_Collaborative_Experiential_Learning_to_Provide_Personalised_Formative_Assessment","abstract":"Supporting diverse and rapidly changing learning styles of new digital age generations is one of the major hurdles to higher education in the age of massification of education markets. Higher education institutions must now utilize unprecedented network speed and mobile technology to create stimulating learning environments for new digital age generations. This paper presents a new learning and teaching model that combines dynamic learning space (DLS) and mobile collaborative experimental learning (MCEL) for supporting diverse learning styles of students. DLS assists students with state-of-art modern wireless network technologies in order to support fast-paced, multi-tasking, data and content intensive collaborative learning in class. The model further extends student learning activities beyond classroom by allowing students to continue their learning anywhere and anytime conveniently using their mobile devices. MCEL provides automated continuous personalized formative-feedback 24/7. The main objectives of the model are to improve student engagement and to provide ownership of their learning journey, experiential learning, contextualized learning, and formative assessment at low cost. The model employs three factors that influence collaborative experiential learning and formative assessment. The three factors are: (1) the use of learning space within the classroom, (2) wireless learning technology, and (3) mobile learning system (m-Learning). Pilot studies of the model are conducted and evaluated on two groups of postgraduate students. Their participation is observed, and a survey is conducted. The results show that (1) DLS encourages high-level learning and diverse learning styles to move away from passive low-level knowledge intensive learning activities; (2) MCEL supports Bigg's constructive alignment in curriculum design, contextualized experimental learning, and personalized formative learning.","authors":["Abhishek Bhati","Insu Song"],"meta":["April 2019International Journal of Emerging Technologies in Learning (iJET) 14(07):179","DOI:10.3991/ijet.v14i07.9173","Project: Student Experience in Higher Education"],"references":["319424214_21st_Century_Skills_Development_Through_Inquiry-Based_Learning","318707629_Deciphering_the_Future_of_Learning_Through_Daily_Observation","311997083_21st_Century_Skills_Development_Through_Inquiry-Based_Learning","304628808_Non-traditional_university_student_achievement_Theory_policy_and_practice_in_Australia","295400457_Rethinking_pedagogy_for_a_digital_age_designing_for_21st_Century_Learning","307768511_Motivation_and_mobile_devices_exploring_the_role_of_appropriation_and_coping_strategies","305688123_Teaching_for_Quality_Learning_at_University","303780209_Vandalism_and_tourism_settings_An_integrative_review","286025111_An_Introduction_to_Visual_Research_Methods_in_Tourism","272815384_Innovation_in_business_education_in_emerging_markets"]}