{"id":"327564737_An_Approach_for_Creating_KDM2PSM_Transformation_Engines_in_ADM_Context_The_RUTE-K2J_Case","abstract":"Architecture-Driven Modernization (ADM) is a type of software reenginering that employs standard metamodels along the process and deals with the whole system architecture. The main metamodel is the Knowledge-Discovery Metamodel (KDM), which is language, platform independent and it is able to represent several aspects of a software system. Although there is much research effort in the reverse engineering phase of ADM, little have been published around the forward engineering one; mainly on the generation of Platform-Specific Models (PSM) from KDM. This phase is essential as it belongs to the final part of the horseshoe cycle, completing the reengineering process. However, the lack of research and the absence of tooling support hinders the industrial adoption of ADM. Therefore, in this paper we propose an approach to support engineers in creating Transformation Engines (TE) from KDM to any other PSM. This approach was emerged from the experience in creating a TE called RUTE-K2J, which aims at generating Java Model from KDM. The transformation rules of RUTE-K2J were tested considering sets of common code structures that normally appears when modernizing systems. The test cases have shown the transformation rules were able to generate correctly 92% of the source code that was submitted to the transformation.","authors":["Guisella Angulo","Daniel Gustavo San Martín Santibáñez","Bruno Santos","Fabiano Ferrari"],"meta":["September 2018","DOI:10.1145/3267183.3267193","Conference: the VII Brazilian Symposium"],"references":["322509090_A_Three-Phase_Approach_to_Efficiently_Transform_C_into_KDM","281035724_A_combined_approach_for_concern_identification_in_KDM_models","278050843_Migrating_Traditional_Web_Applications_to_CMS-based_Web_Applications","263847948_The_Promises_and_Perils_of_Mining_GitHub","319637910_Supporting_the_Specification_and_Serialization_of_Planned_Architectures_in_Architecture-Driven_Modernization_Context","314875758_Model-Driven_Software_Migration_A_Methodology","281035561_Towards_a_refactoring_catalogue_for_knowledge_discovery_metamodel","279355975_Experimentation_in_Software_Engineering","261308484_A_Gap-Analysis-Based_Framework_for_Evolution_and_Modernization_Modernization_of_Domain_Management_at_Redes","260979288_Model-Driven_Software_Migration_A_Methodology_Reengineering_Recovery_and_Modernization_of_Legacy_Systems"]}