{"id":"327644991_A_generic_individual-based_model_can_predict_yield_nitrogen_content_and_species_abundance_in_experimental_grassland_communities","abstract":"Functional–structural plant models are increasingly being used to analyse relationships between plant functioning and the topological and spatial organisation of their modular structure. In this study, the performance of an individual-based model accounting for the architecture and population dynamics of forage legumes in multi-species grasslands was assessed. Morphogenetic shoot and root parameters were calibrated for seven widely used species. Other model parameters concerning C and N metabolism were obtained from the literature. The model was evaluated using a series of independent experiments combining the seven species in binary mixtures that were subject to regular defoliation. For all the species, the model could accurately simulate phytomer demography, leaf area dynamics, and root growth under conditions of weak competition. In addition, the plastic changes induced by competition for light and N in terms of plant development, leaf area, N uptake, and total plant biomass were correctly predicted. The different species displayed contrasting sensitivities to defoliation, and the model was able to predict the superior ability of creeping species to sustain regular defoliation. As a result of competition and management, the balance between species changed over time and was strongly dependent on the pair of species used. The model proved able to capture these differences in community dynamics. Overall, the results demonstrate that integrating the individual components of population dynamics in a process-based model can provide good predictive capacity regarding mixtures of cultivated species.","authors":["Lucas Faverjon","Abraham J Escobar-Gutiérrez","Isabelle Litrico","Bernadette Julier"],"meta":["September 2018Journal of Experimental Botany 70(9):2491–2504","DOI:10.1093/jxb/ery323","Projects: A cybernetic framework for morphogenesis simulationsIndividual-based modelling of multi-species grasslands"],"references":["322274672_A_generic_individual-based_model_to_simulate_morphogenesis_C-N_acquisition_and_population_dynamics_in_contrasting_forage_legumes","320075316_Quantifying_crop_responses_to_nitrogen_and_avenues_to_improve_nitrogen-use_efficiency","317362204_Performance_of_lucerne_genotypes_for_biomass_production_and_nitrogen_content_differs_in_monoculture_and_in_mixture_with_grasses_and_is_partly_predicted_from_traits_recorded_on_isolated_plants","315052479_A_Conserved_Potential_Development_Framework_Applies_to_Shoots_of_Legume_Species_with_Contrasting_Morphogenetic_Strategies","345723224_Development_and_Growth_Characteristics_of_Temperate_Perennial_Legumes","341964325_Morphogenetic_and_structural_determination_of_plant_regrowth_after_defoliation","313772282_Climate_and_the_efficiency_of_crop_production_in_Britain","313490103_Major_shifts_in_species'_relative_abundance_in_grassland_mixtures_alongside_positive_effects_of_species_diversity_in_yield_A_continental-scale_experiment","312896210_WinRHIZO_a_root-measuring_system_with_a_unique_overlap_correction_method","312566629_Assessment_of_'3DS'_a_soil_module_for_individual-based_models_of_plant_communities"]}