{"id":"327639942_Effects_of_climate_change_on_water_resources_in_the_upper_Blue_Nile_Basin_of_Ethiopia","abstract":"Drawing on hydrology, rainfall, and climatic data from the past 25 years, this article investigates the effects of climate change on water resources in the transnational Blue Nile Basin (BNB). The primary focus is on determining the long-term temporal and seasonal changes in the flows of the Blue Nile in Ethiopia at the border to Sudan. This is important because the Blue Nile is the main tributary to the Nile river, the lifeline of both Sudan and Egypt. Therefore, to begin with long-term trends in hydrological time series were detected by means of both parametric and nonparametric techniques. The Soil and Water Assessment Tool (SWAT) model was calibrated using several sub-basins and new high-resolution land use and soil maps. Future climate change impacts were projected using data from the Climate Forecast System Reanalysis (CFSR) of the National Centers for Environmental Predictions based on three different climate change scenarios from the Coupled Model Intercomparison Project (CMIP3). Projected time series were analysed for changes in rainfall and streamflow trends. Climate change scenario modelling suggested that the precipitation will increase from 7% to 48% and that streamflow from the BNB could increase by 21% to 97%. The results provide a basis for evaluating future impacts of climate change on the upper Blue Nile River (Abay River). This is the main river basin contributing to the Nile and a source of water for millions of people in Sudan and Egypt, downstream from Ethiopia. Three models (CCCMA, CNRM, MRI) were applied in this research, within two future time periods (2046–2064 and 2081–2099) and one scenario (A1B). The Abay Basin was divided into seven sub-basins, six of which were used as inlets to the lowest basin at the border to Sudan. The above-mentioned results show that under current climate change scenarios there is a strong seasonal shift to be expected from the present main rainfall season (June to September) to an earlier onset from January to May with less pronounced peaks but longer duration of the rainfall season. This has direct consequences on the streamflow of the Blue Nile, which is connected to the rainfall season and therefore has direct effects on the people living in the sphere of influence of the Nile River.","authors":["Vincent Roth","Tatenda Lemann","Gete Zeleke","Alemtsehay Subhatu"],"meta":["September 2018Heliyon 4(9):e00771","DOI:10.1016/j.heliyon.2018.e00771","Project: Erosion and Blue and Green Water modelling in the upper Blue Nile Basin"],"references":["315371279_Inter-Basin_Groundwater_Transfer_and_Multiple_Approach_Recharge_Estimation_of_the_Upper_Awash_Aquifer_System","307916428_Climate_change_in_the_Blue_Nile_Basin_Ethiopia_implications_for_water_resources_and_sediment_transport","307685642_A_multi_basin_SWAT_model_analysis_of_runoff_and_sedimentation_in_the_Blue_Nile_Ethiopia","307655755_Sediment_management_modelling_in_Blue_Nile_Basin_using_SWAT_model","307654284_Assessment_of_climate_change_impact_on_hydrological_extremes_in_two_source_regions_of_the_Nile_River_Basin","307169323_Reducing_Landscape_Heterogeneity_for_Improved_Land_Use_and_Land_Cover_LULC_Classification_Across_the_Large_and_Complex_Ethiopian_Highlands","280466046_Climate_Change_Impact_on_Sediment_Yield_in_the_Upper_Gilgel_Abay_Catchment_Blue_Nile_Basin_Ethiopia","316442244_Climate_change_enhances_interannual_variability_of_the_Nile_river_flow","313661314_Large_area_hydrologic_modeling_and_assessment_Part_1_Model_development","296883193_Application_of_swat_for_the_Upper_North_Bosque_River_Watershed"]}