{"id":"327641571_Learning_structural_motif_representations_for_efficient_protein_structure_search","abstract":"Motivation\nGiven a protein of unknown function, fast identification of similar protein structures from the Protein Data Bank (PDB) is a critical step for inferring its biological function. Such structural neighbors can provide evolutionary insights into protein conformation, interfaces and binding sites that are not detectable from sequence similarity. However, the computational cost of performing pairwise structural alignment against all structures in PDB is prohibitively expensive. Alignment-free approaches have been introduced to enable fast but coarse comparisons by representing each protein as a vector of structure features or fingerprints and only computing similarity between vectors. As a notable example, FragBag represents each protein by a ‘bag of fragments’, which is a vector of frequencies of contiguous short backbone fragments from a predetermined library. Despite being efficient, the accuracy of FragBag is unsatisfactory because its backbone fragment library may not be optimally constructed and long-range interacting patterns are omitted.\n\nResults\nHere we present a new approach to learning effective structural motif presentations using deep learning. We develop DeepFold, a deep convolutional neural network model to extract structural motif features of a protein structure. We demonstrate that DeepFold substantially outperforms FragBag on protein structural search on a non-redundant protein structure database and a set of newly released structures. Remarkably, DeepFold not only extracts meaningful backbone segments but also finds important long-range interacting motifs for structural comparison. We expect that DeepFold will provide new insights into the evolution and hierarchical organization of protein structural motifs.\n\nAvailability and implementation\nhttps://github.com/largelymfs/DeepFold","authors":["Yang Liu","Qing Ye","Liwei Wang","Jian Peng"],"meta":["September 2018Bioinformatics 34(17):i773-i780","DOI:10.1093/bioinformatics/bty585"],"references":["302569301_Theano_A_Python_framework_for_fast_computation_of_mathematical_expressions","284219144_Learning_Deep_Structure-Preserving_Image-Text_Embeddings","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316856658_Text_Data_Management_and_Analysis_A_Practical_Introduction_to_Information_Retrieval_and_Text_Mining","311610250_Learning_Deep_Structure-Preserving_Image-Text_Embeddings","308098066_BLAST_Architecture_and_applications","304552788_FaceNet_A_unified_embedding_for_face_recognition_and_clustering","302342160_BLAST_architecture_and_applications","301875828_Low-Density_Locality-Sensitive_Hashing_Boosts_Metagenomic_Binning","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting"]}