{"id":"327630485_Statistical_Machine_Translation_from_Arab_Vocal_Improvisation_to_Instrumental_Melodic_Accompaniment","abstract":"Vocal improvisation is an essential practice in Arab music. The interactivity between the singer and the instrumentalist(s) is a main feature of this deep-rooted musical form. As part of the inter-activity, the instrumentalist recapitulates, or translates, each vocal sentence upon its completion. In this paper, we present our own parallel corpus of instrumentally accompanied Arab vocal improvisation. The initial size of the corpus is 2779 parallel sentences. We discuss the process of building this corpus as well as the choice of data representation. We also present some statistics about the corpus. Then we present initial experiments on applying statistical machine translation to propose an automatic instrumental accompaniment to Arab vocal improvisation. The results with this small corpus, in comparison to classical machine translation of natural languages, are very promising: a BLEU of 24.62 from Vocal to instrumental and 24.07 from instrumental to vocal.","authors":["Fadi M. Al-Ghawanmeh","Kamel Smaïli"],"meta":["March 2018","Project: Translating Arab Music (TRAM): Applying Machine Translation on Automatic Accompaniment to Vocal Improvisation"],"references":["320734102_Aspects_of_Tempo_and_Rhythmic_Elaboration_in_Hindustani_Music_A_Corpus_Study","308570161_Classification_of_classic_Turkish_music_makams_by_using_deep_belief_networks","282906186_Corpus_COFLA_A_Research_Corpus_for_the_Computational_Study_of_Flamenco_Music","272238126_Automatic_Accompaniment_to_Arab_Vocal_Improvisation_Mawwal","271507804_Toward_an_Improved_Automatic_Melodic_Accompaniment_to_Arab_Vocal_Improvisation_Mawwal","242503379_An_On-Line_Algorithm_for_Real-Time_Accompaniment","312922200_Two_decades_of_statistical_language_modeling_Where_do_we_go_from_here","301444121_Creating_Corpora_for_Computational_Research_in_Arab-Andalusian_Music","221515810_MySong_automatic_accompaniment_generation_for_vocal_melodies","200806379_The_Synthetic_Performer_in_The_Context_of_Live_Performance"]}