{"id":"327651974_Review_Domestic_herbivores_and_food_security_Current_contribution_trends_and_challenges_for_a_sustainable_development","abstract":"Herbivores are found in a variety of ecosystems all over the world. Permanent pastures and meadows cover about 25% of global land. We currently count one domesticated herbivore for two people in the world and the number is growing. Production systems and products are highly diverse. This high diversity is the result of thousands of years of natural selection and human-controlled breeding, as well as migration and trade. Because of the high diversity of domestic herbivore genetic resources, herders have been able to live in regions where no alternative for income generation exists. Meat and milk from domestic herbivores provide 16% and 8% of the global protein and kilocalorie consumption, respectively. They also provide a variety of essential micronutrients but can contribute to overweight and obesity when consumed in excess. Domestic herbivores also make significant contribution to food security through the production of manure, draught power and transport and the generation of income at household and national level. They have a key role to play in women's empowerment and gender equality, both in rural and urban areas. Demand for meat and milk is increasing because of population growth, rising incomes and urbanisation. This trend is expected to continue, especially in Latin America, South Asia and China. The sustainable development of domestic herbivore production needs to address the feed/food and the efficiency of herbivores in turning forages into protein. It also needs to address the contribution of herbivores to greenhouse gas emissions, especially of ruminants through enteric fermentation, and their mitigation potential, including through carbon sequestration. Animal genetic resources have a key role to play in mitigating and adapting to climate change. The role of ruminants in the circular bioeconomy needs to be enhanced, promoting the use of by-products and waste as livestock feed and the recycling of manure for energy and nutrients. Finally, the role of domestic herbivores in providing secure livelihoods and economic opportunities for millions of smallholder farmers and pastoralists needs to be enhanced. The sustainable development of the sector therefore requires adequate policies, and there are already a variety of mechanisms available, including regulations, cross-compliance systems, payments for environmental services and research and development. Priority areas for policy makers should be aligned with the global framework of the Sustainable Development Goals and include: (i) food security and nutrition, (ii) economic development and livelihoods, (iii) animal and human health and finally, (iv) environment, climate and natural resources.","authors":["Anne Mottet","Félix Teillard","Paul Boettcher","G De' Besi"],"meta":["September 2018animal 12(s2)","DOI:10.1017/S1751731118002215"],"references":["320489389_Gender_assessment_of_dairy_value_chains_evidence_from_Kenya_Recommended_citation","320416456_Diversification_as_Part_of_a_CSA_Strategy_The_Cases_of_Zambia_and_Malawi","312201313_Livestock_On_our_plates_or_eating_at_our_table_A_new_analysis_of_the_feedfood_debate","310450354_Prospects_for_Livestock-Based_Livelihoods_in_Africa's_Drylands","303465065_Climate_change_mitigation_and_productivity_gains_in_livestock_supply_chains_insights_from_regional_case_studies","289509969_Tackling_climate_change_through_livestock_A_global_assessment_of_emissions_and_mitigation_opportunities","278047075_Animal_board_Invited_Review_Genetic_possibilities_to_reduce_enteric_methane_emissions_from_ruminants","316052907_Global_poultry_production_current_state_and_future_outlook_and_challenges","312274465_Council_Directive_1991676EC_EC_Directive_of_the_European_Parliament_and_of_the_Council_of_12_December_1991_on_the_Protection_of_Waters_Against_Pollution_Caused_by_Nitrates_from_Agricultural_Sources","277927074_Environmental_impacts_of_beef_production_Review_of_challenges_and_perspectives_for_durability"]}