{"id":"327682339_NLP_and_IR_based_solution_for_confirming_classification_of_research_papers","abstract":"In this paper, an approach is presented for classifying and categorizing the research’s papers in very accurate manner. Typically, the papers are classified into clusters based on the concepts and the contents, this clustering process is mainly depends on the title of the paper. However, a lot of papers have ambiguous title or have a very short title. Therefore, the researcher needs to cluster and classify the papers not just depending on the title, but also include other parts of the paper like: abstract, keywords, and may be some key parts of the paper. This process is time consuming since the researchers spend a lot of time to decide the related cluster of the undertaken paper. Our presented approach provides an automatic, short time, and accurate solution, which mainly depends on Information Retrieval (IR) as core process along with some Natural Language Processing (NLP) techniques. Latent Dirichlet Allocation (LDA) and Latent Semantic Indexing (LSI) are the two IR algorithms which used in the new approach. We use the LDA for classifying the papers using the concept of topic modeling. And we use the LSI for performing querying. The new approach uses the title of the paper, the abstract, and the keyword for performing the classification process. Two distinct experiments were conducted over 600 papers in the field of computer science. The results show the efficiency of the proposed approach in classifying and mapping the papers accurately and efficiently.","authors":["Khalid Nahar","Nouh Alhindawi","Obaida M. Al-hazaimeh","Ra'ed M. Al-Khatib"],"meta":["August 2018Journal of Theoretical and Applied Information Technology 96(16):5269-5279"],"references":["319098517_A_Robust_Image_Watermarking_Scheme_Based_on_SVD_in_the_Spatial_Domain","318920995_Information_Analysis_to_Study_Interactions_between_different_Genes_and_Diseases","310051144_A_comparison_of_US-based_and_Iraqi_English_research_article_abstracts_using_corpora","297592038_A_Topic_Modeling_Based_Solution_for_Confirming_Software_Documentation_Quality","296476212_A_Voice_Identification_System_using_Hidden_Markov_Model","283671339_Quantitative_analysis_of_large_amounts_of_journalistic_texts_using_topic_modelling","282837665_Arabic_Phonemes_Transcription_using_Data_Driven_Approach","273794038_Structure-oriented_singular_value_decomposition_for_random_noise_attenuation_of_seismic_data","265164760_Visualization_analysis_of_feed_forward_neural_network_input_contribution","263665251_A_new_robust_and_secure_digital_image_watermarking_scheme_based_on_the_integer_wavelet_transform_and_singular_value_decomposition"]}