{"id":"327660555_On_the_de_Sitter_swampland_criterion","abstract":"A new swampland criterion has recently been proposed. As a consequence, it forbids the existence of de Sitter solutions in a low energy effective theory of a quantum gravity. However, there exist classical de Sitter solutions of ten-dimensional (10d) type II supergravities, even though they are unstable. This appears at first sight in contradiction with the criterion. Beyond possible doubts on the validity of these solutions, we propose two answers to this apparent puzzle. A first possibility is that the known 10d solutions always exhibit an energy scale of order or higher than a Kaluza–Klein scale, as we argue. A corresponding 4d low energy effective theory would then differ from the usual consistent truncations, and as we explain, would not admit a de Sitter solution. This would reconcile the existence of these 10d de Sitter solutions with the 4d criterion. A second, alternative possibility is to have a refined swampland criterion, that we propose. It forbids to have both the existence and the stability of a de Sitter solution, while unstable solutions are still allowed.","authors":["David Andriot"],"meta":["September 2018Physics Letters B 785","DOI:10.1016/j.physletb.2018.09.022"],"references":["320609377_On_classical_de_Sitter_and_Minkowski_solutions_with_intersecting_branes","316590654_String_cosmology_and_the_landscape","311769411_A_Universal_Tachyon_in_Nearly_No-scale_de_Sitter_Compactifications","307603778_Refining_the_boundaries_of_the_classical_de_Sitter_landscape","301842146_Towards_Kaluza-Klein_Dark_Matter_on_Nilmanifolds","235548802_On_Slow-Roll_Moduli_Inflation_in_Massive_IIA_Supergravity_with_Metric_Fluxes","279633188_New_supersymmetric_vacua_on_solvmanifolds","263113676_Intersecting_brane_solutions_in_string_and_M-theory","236621868_Quantization_problem_in_Scherk-Schwarz_compactifications","230962303_The_effective_theory_of_type_IIA_AdS4_compactifications_on_nilmanifolds_and_cosets"]}