{"id":"327657740_Optimal_maintenance_plan_for_two-level_assembly_system_and_risk_study_of_machine_failure","abstract":"This paper deals with the optimisation of two-levels assembly system planning. This system is composed of a single machine, inventories at levels 1 and 2 for stock keeping components to assembly and final assembled product. It assumed that the machine processes all assembly operations and is subject to random failure. A mathematical model is developed to incorporate a supply planning for two-level assembly systems under stochastic lead times and breakdowns machine. A preventive maintenance plan is carried out to reduce the frequency of the corrective maintenance actions. This work has double goals. The first one is to find the optimal order release dates for the different components at level 2 and the optimal preventive maintenance plan. The second one is to quantify the risk due to machine failures which have an impact on the lead-time of the finished product. To consider the maintenance actions, preventive maintenance actions are perfectly performed to restore the machine to state “as good as new”, minimal repair is considered at failure. The model minimises the total cost, which is the sum of inventory holding cost for components at levels 1 and 2, backlogging and inventory holding cost for the finished products and maintenance costs. To illustrate the effectiveness of the proposed model, different meta-heuristics are applied; the genetic algorithm shows the most suited to our analytical model, the optimal release date founded by this algorithm allows finding the optimal preventive maintenance plan. The obtained optimal maintenance planning is used in the risk assessment in order to find the threshold repair period that avoids lost profit.","authors":["Zouhour Guiras","Sadok Turki","Nidhal Rezg","Alexandre Dolgui"],"meta":["September 2018International Journal of Production Research 57(1):1-18","DOI:10.1080/00207543.2018.1521017"],"references":["326207859_Comparative_Analysis_of_Heuristic_Algorithms_Used_for_Solving_a_Production_and_Maintenance_Planning_Problem_PMPP","324767266_Optimization_of_Two-Level_DisassemblyRemanufacturingAssembly_System_with_an_Integrated_Maintenance_Strategy","323945356_Optimal_order_release_dates_for_two-level_assembly_systems_with_stochastic_lead_times_at_each_level","317297853_Literature_Review_on_Disruption_Recovery_in_the_Supply_Chain","312057635_Optimal_Supply_Planning_for_Two-Levels_Assembly_System_with_Stochastic_Lead-_Times_and_Maintenance_Actions","306074810_Disruptions_in_supply_chains_and_recovery_policies_state-of-the_art_review","303565816_Ecological_Optimization_for_Forecasting_Production_and_Maintenance_Problem_based_Carbon_Tax","280751654_Planification_des_reapprovisionnements_pour_systeme_d'assemblage_a_deux_niveaux_quand_les_delais_d'approvisionnement_sont_aleatoires","306157111_Parametrage_de_la_methode_mRP_en_environnement_incertain_une_revue_de_la_litterature","303685878_Ecological_Optimization_for_Forecasting_Production_and_Maintenance_Problem_based_Carbon_Tax"]}