{"id":"327603425_Individual_Variation_in_PROP_Status_Fungiform_Papillae_Density_and_Responsiveness_to_Taste_Stimuli_in_a_Large_Population_Sample","abstract":"Despite considerable research investigating the role of PROP bitterness perception and variation of fungiform papillae density (FPD) in food perception, this relationship remains controversial as well as the association between the two phenotypes. Data from 1119 subjects (38.6% male; 18-60 years) enrolled in the Italian Taste project were analysed. Responsiveness to the bitterness of PROP was assessed on the general Labelled Magnitude Scale. FPD was determined from manual counting on digital images of the tongue. Solutions of tastes, astringent and pungent sensations were prepared to be moderate/strong on a gLMS. Four foods had tastants added to produce four variations in target sensations from weak to strong (pear juice: citric acid, sourness, chocolate pudding: sucrose, sweetness; bean purée: sodium chloride, saltiness and tomato juice: capsaicin, pungency). Females gave ratings to PROP and showed FPD that were significantly higher than males. Both phenotype markers significantly decreased with age. No significant correlations were found between PROP ratings and FPD. FPD variation doesn't affect perceived intensity of solutions. Responsiveness to PROP positively correlated to perceived intensity of most stimuli in solution. A significant effect of FPD on perceived intensity of target sensation in foods was found in a few cases. Responsiveness to PROP positively affected all taste intensities in subjects with low FPD while there were no significant effects of PROP in high FPD subjects. These data highlight a complex interplay between PROP status and FPD and the need of a critical reconsideration of their role in food perception and acceptability.","authors":["Caterina Dinnella","Erminio Monteleone","Maria Piochi","Sara Spinelli"],"meta":["September 2018Chemical Senses 43(9)","DOI:10.1093/chemse/bjy058","Project: Italian Taste. A project of the Italian Sensory Science Society"],"references":["323486921_Associations_between_human_fungiform_papillae_and_responsiveness_to_oral_stimuli_Effects_of_individual_variability_population_characteristics_and_methods_for_papillae_quantification","321879206_Multidimensional_measurement_of_individual_differences_in_taste_perception","321261707_Factors_Influencing_the_Phenotypic_Characterization_of_the_Oral_Marker_PROP","317413221_Lingual_tactile_sensitivity_effect_of_age_group_sex_and_fungiform_papillae_density","312348333_First_objective_evaluation_of_taste_sensitivity_to_6-n-propylthiouracil_PROP_a_paradigm_gustatory_stimulus_in_humans","323264743_Personality_traits_and_gender_influence_liking_and_choice_of_food_pungency","317335333_Quantification_of_Oral_Roughness_Perception_and_Comparison_with_Mechanism_of_Astringency_Perception","316244276_Past_exposure_to_fruit_and_vegetable_variety_moderates_the_link_between_fungiform_papillae_density_and_current_variety_of_FV_consumed_by_children","314095784_Exploring_influences_on_food_choice_in_a_large_population_sample_the_Italian_Taste_Project","306928333_The_effect_of_genotypical_and_phenotypical_variation_in_taste_sensitivity_on_liking_of_ice_cream_and_dietary_fat_intak"]}