{"id":"327627185_Respond-CAM_Analyzing_Deep_Models_for_3D_Imaging_Data_by_Visualizations","abstract":"The convolutional neural network (CNN) has become a powerful tool for various biomedical image analysis tasks, but there is a lack of visual explanation for the machinery of CNNs. In this paper, we present a novel algorithm, Respond-weighted Class Activation Mapping (Respond-CAM), for making CNN-based models interpretable by visualizing input regions that are important for predictions, especially for biomedical 3D imaging data inputs. Our method uses the gradients of any target concept (e.g. the score of target class) that flow into a convolutional layer. The weighted feature maps are combined to produce a heatmap that highlights the important regions in the image for predicting the target concept. We prove a preferable sum-to-score property of the Respond-CAM and verify its significant improvement on 3D images from the current state-of-the-art approach. Our tests on Cellular Electron Cryo-Tomography 3D images show that Respond-CAM achieves superior performance on visualizing the CNNs with 3D biomedical image inputs, and is able to get reasonably good results on visualizing the CNNs with natural image inputs. The Respond-CAM is an efficient and reliable approach for visualizing the CNN machinery, and is applicable to a wide variety of CNN model families and image analysis tasks. Our code is available at: https://github.com/xulabs/projects/tree/master/respond_cam.","authors":["Guannan Zhao","Bo Zhou","Kai Wen Wang","Rui Jiang"],"meta":["September 2018Lecture Notes in Computer Science","DOI:10.1007/978-3-030-00928-1_55","In book: Medical Image Computing and Computer Assisted Intervention – MICCAI 2018 (pp.485-492)","Project: De novo detection of macromolecular structures using cellular electron cryo-tomography data"],"references":["313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","313097589_Deep_learning_based_subdivision_approach_for_large_scale_macromolecules_structure_recovery_from_electron_cryo_tomograms","323593846_The_Building_Blocks_of_Interpretability","322058942_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","319770006_Learning_Deep_Features_for_Discriminative_Localization","312594863_Convolutional_Neural_Networks_for_Automated_Annotation_of_Cellular_Cryo-Electron_Tomograms","287250939_Learning_Deep_Features_for_Discriminative_Localization","284025615_Rank_Correlation_Measures","258424423_Visualizing_and_Understanding_Convolutional_Neural_Networks","242512892_A_New_Measure_of_Rank_Correlation"]}