{"id":"327640339_Merit-guided_Dynamic_Feature_Selection_Filter_for_Data_Streams","abstract":"Learning from ephemeral data streams has garnered the interest of both researchers and practitioners towards adaptive learning techniques. Despite the convincing results obtained thus far, most of the current research still overlooks that the relevance of features may change throughout the learning process. Scenarios where features become - or cease to be - relevant to the learning task are called feature drifting data streams, and the identification of which features are relevant becomes even more challenging when the feature space is high-dimensional. To select relevant features during the progress of data streams, we propose a merit-guided and classifier-independent dynamic feature selection algorithm named DynamIc SymmetriCal Uncertainty Selection for Streams (DISCUSS). We evaluate our proposal on both synthetic and real-world datasets and show that DISCUSS can boost kNN and Naive Bayes classifiers’ accuracy rates on high-dimensional data streams, while at the expense of limited processing time and memory space. Finally, the drawbacks of the proposed method are assessed, and possible future works on the topic are also discussed.","authors":["Jean Paul Barddal","Fabrício Enembreck","Heitor Murilo Gomes","Albert Bifet"],"meta":["September 2018Expert Systems with Applications 116","DOI:10.1016/j.eswa.2018.09.031"],"references":["305886425_Estimating_the_Price_Impact_of_Proposed_Wind_Farms_in_Competitive_Electricity_Markets","305180735_On_Dynamic_Feature_Weighting_for_Feature_Drifting_Data_Streams","305083748_Advancing_feature_selection_research","289529742_A_Survey_on_Feature_Drift_Adaptation","283761478_Characterizing_Concept_Drift","269776374_A_Survey_on_Data_Stream_Clustering_and_Classification","317607823_Feature_ranking_in_hoeffding_algorithms_for_regression","290872065_A_Feature_Selection_Method_Using_Hierarchical_Clustering","282374038_All_Relevant_Feature_Selection_Methods_and_Applications","268993225_Notes_on_the_History_of_Correlation"]}