{"id":"327695829_Median_Filter_Based_Compressed_Sensing_Model_with_Application_to_MR_Image_Reconstruction","abstract":"Magnetic resonance imaging (MRI) has become a helpful technique and developed rapidly in clinical medicine and diagnosis. Magnetic resonance (MR) images can display more clearly soft tissue structures and are important for doctors to diagnose diseases. However, the long acquisition and transformation time of MR images may limit their application in clinical diagnosis. Compressed sensing methods have been widely used in faithfully reconstructing MR images and greatly shorten the scanning and transforming time. In this paper we present a compressed sensing model based on median filter for MR image reconstruction. By combining a total variation term, a median filter term, and a data fitting term together, we first propose a minimization problem for image reconstruction. The median filter term makes our method eliminate additional noise from the reconstruction process and obtain much clearer reconstruction results. One key point of the proposed method lies in the fact that both the total variation term and the median filter term are presented in the L1 norm formulation. We then apply the split Bregman technique for fast minimization and give an efficient algorithm. Finally, we apply our method to numbers of MR images and compare it with a related method. Reconstruction results and comparisons demonstrate the accuracy and efficiency of the proposed model.","authors":["Yunyun Yang","Xuxu Qin","Boying Wu"],"meta":["September 2018Mathematical Problems in Engineering 2018(6):1-9","DOI:10.1155/2018/8316194"],"references":["280939667_Applying_compressive_sensing_to_TEM_video_a_substantial_frame_rate_increase_on_any_camera","280534465_Alternating_Direction_Method_of_Multipliers_for_Linear_Inverse_Problems","260657221_Energy-Efficient_Distributed_Data_Storage_for_Wireless_Sensor_Networks_Based_on_Compressed_Sensing_and_Network_Coding","321982899_Low-Rank_Multi-View_Embedding_Learning_for_Micro-Video_Popularity_Prediction","308093349_A_neurodynamic_approach_to_convex_optimization_problems_with_general_constraint","288927245_An_iterative_regularization_method_for_total_variation-based_image_restoration","287162884_ISAR_imaging_of_uniformly_accelerative_rotating_targets_based_on_chirp-Fourier_transform","283025639_Speech_coding_and_enhancement_using_quantized_compressive_sensing_measurements","269634058_Robust_Uncertainty_Principles_Exact_Signal_Frequency_Information","263098684_Multiplicative_intrinsic_component_optimization_MICO_for_MRI_bias_field_estimation_and_tissue_segmentation"]}