{"id":"327600365_Campus_Data_Analysis_Based_on_Positive_and_Negative_Sequential_Patterns","abstract":"Campus data analysis is becoming increasingly important in mining students' behavior. The consumption data of college students is an important part of the campus data, which can reflect the students' behavior to a great degree. A few methods have been used to analyze students' consumption data, such as classification, association rules, clustering, decision trees, time series, etc. However, they do not use the method of sequential patterns mining, which results in some important information missing. Moreover, they only consider the occurring (positive) events but do not consider the nonoccurring (negative) events, which may lead to some important information missing. So this paper uses a positive and negative sequential patterns mining algorithm, called NegI-NSP, to analyze the consumption data of students. Moreover, we associate students' consumption data with their academic grades by adding the students' academic grades into sequences to analyze the relationship between the students' academic grades and their consumptions. The experimental results show that the students' academic performance has significant correlation with the habits of having breakfast regularly.","authors":["Xiaoqi Jiang","Qian Gao","Tiantian Xu","Xiangjun Dong"],"meta":["September 2018International Journal of Pattern Recognition and Artificial Intelligence 33(2)","DOI:10.1142/S021800141959016X"],"references":["306383934_e-NSPFI_Efficient_Mining_Negative_Sequential_Pattern_from_Both_Frequent_and_Infrequent_Positive_Sequential_Patterns","297750727_E-NSP_Efficient_negative_sequential_pattern_mining","286510367_Select_actionable_positive_or_negative_sequential_patterns","283680994_Nonoccurring_Behavior_Analytics_A_New_Area","225747659_Mining_Sequential_Patterns_with_Negative_Conclusions","220894617_An_Efficient_GA-Based_Algorithm_for_Mining_Negative_Sequential_Patterns","326022003_F-NSP_A_Fast_Negative_Sequential_Patterns_Mining_Method_with_Self-adaptive_Data_Storage","303976546_E-msNSP_Efficient_Negative_Sequential_Patterns_Mining_Based_on_Multiple_Minimum_Supports","271571652_Study_on_the_Application_of_Data_Mining_Based_on_Campus_Card_Platform","4285459_Mining_Negative_Sequential_Patterns_in_Transaction_Databases"]}