{"id":"327658583_Low-Certainty-Need_LCN_supply_chains_a_new_perspective_in_managing_disruption_risks_and_resilience","abstract":"This paper is a part of IJPR Special Issue and in Open Access by September 30, 2019: https://www.tandfonline.com/toc/tprs20/current. This study suggests a new approach to supply chain (SC) disruption risk management where SC behaviour is less dependent on the certainty of our knowledge about the environment and its changes. The unpredictability of the occurrence of disruption and its magnitude suggests that designing SCs with a low need for ‘certainty’ may be as important, if not more so, than predetermined disruption control strategies. In this setting, this study calls for the development of a new perspective in SC disruption management, i.e. low-certainty-need (LCN) SCs. A number of principles and concepts is derived in recent, relevant literature to structure the characteristics of the LCN framework and its management. Structural variety, process flexibility, and parametrical redundancy are identified as key LCN SC characteristics that ensure efficient disruption resistance as well as recovery resource allocation. Two efficiency capabilities of the LCN SC are shown, i.e. low need for uncertainty consideration in planning decisions and low need for recovery coordination efforts based on a combination of lean and resilient elements. The results allow the identification of an LCN SC framework, concepts and technologies for its implementation as well as missing themes and new research questions which contribute to a better understanding of SC disruption risks. Special focus is directed on the digital technology usage in the LCN framework implementation.","authors":["Dmitry Ivanov","Alexandre Dolgui"],"meta":["September 2018International Journal of Production Research","DOI:10.1080/00207543.2018.1521025"],"references":["326046999_The_impact_of_digital_technology_and_Industry_40_on_the_ripple_effect_and_supply_chain_risk_analytics","325021224_An_enhanced_procedure_for_managing_blood_supply_chain_under_disruptions_and_uncertainties","324911557_Increasing_Supply_Chain_Robustness_through_Process_Flexibility_and_Inventory","324418957_Bayesian_network_modelling_for_supply_chain_risk_propagation","323923198_Supply_chains_robustness_Challenges_and_opportunities","327053573_A_Real-Option_Approach_to_Mitigate_Disruption_Risk_in_the_Supply_Chain","325710768_Designing_a_resilient_competitive_supply_chain_network_under_disruption_risks_A_real-world_application","324663008_Mitigating_Supply_Uncertainty_The_Interplay_between_Diversification_and_Pricing","323180609_How_do_supply_chain_risk_management_flexibility-driven_strategies_perform_in_mitigating_supply_disruption_risks","322261649_Supply_chain_flexibility_and_operations_optimisation_under_demand_uncertainty_a_case_in_disaster_relief"]}