{"id":"327726351_Cohort_and_Rhyme_Priming_Emerge_from_the_Multiplex_Network_Structure_of_the_Mental_Lexicon","abstract":"Complex networks recently opened new ways for investigating how language use is influenced by the mental representation of word similarities. This work adopts the framework of multiplex lexical networks for investigating lexical retrieval from memory. The focus is on priming, i.e., exposure to a given stimulus facilitating or inhibiting retrieval of a given lexical item. Supported by recent findings of network distance influencing lexical retrieval, the multiplex network approach tests how the layout of hundreds of thousands of word-word similarities in the mental lexicon can lead to priming effects on multiple combined semantic and phonological levels. Results provide quantitative evidence that phonological priming effects are encoded directly in the multiplex structure of the mental representation of words sharing phonemes either in their onsets (cohort priming) or at their ends (rhyme priming). By comparison with randomised null models, both cohort and rhyming effects are found to be emerging properties of the mental lexicon arising from its multiplexity. These priming effects are absent on individual layers but become prominent on the combined multiplex structure. The emergence of priming effects is displayed both when only semantic layers are considered, an approximated representation of the so-called semantic memory, and when semantics is enriched with phonological similarities, an approximated representation of the lexical-auditory nature of the mental lexicon. Multiplex lexical networks can account for connections between semantic and phonological information in the mental lexicon and hence represent a promising modelling route for shedding light on the interplay between multiple aspects of language and human cognition in synergy with experimental psycholinguistic data.","authors":["Massimo Stella"],"meta":["September 2018Complexity 2018:1-14","DOI:10.1155/2018/6438702","Project: Cognitive Networks and Data Science approaches to understanding cognition"],"references":["324913683_Using_complex_networks_to_understand_the_mental_lexicon","323471074_Distance_Entropy_Cartography_Characterises_Centrality_in_Complex_Networks","322528363_Flexibility_of_thought_in_high_creative_individuals_represented_by_percolation_analysis","320036700_The_Influence_of_Closeness_Centrality_on_Lexical_Processing","319463772_Knowledge_gaps_in_the_early_growth_of_semantic_networks","317229887_Multiplex_model_of_mental_lexicon_reveals_explosive_learning_in_humans","337741405_The_multiplex_structure_of_the_mental_lexicon_influences_picture_naming_in_people_with_aphasia","326143486_The_multiplex_structure_of_the_mental_lexicon_influences_picture_naming_in_people_with_aphasia","325670372_A_Reason_to_Rhyme_Phonological_and_Semantic_Influences_on_Lexical_Access","315826510_Phonological_facilitation_in_picture_naming_When_and_where_A_tDCS_study"]}