{"id":"327747905_Active_Deep_Learning_with_Fisher_Information_for_Patch-Wise_Semantic_Segmentation_4th_International_Workshop_DLMIA_2018_and_8th_International_Workshop_ML-CDS_2018_Held_in_Conjunction_with_MICCAI_2018_","abstract":"Deep learning with convolutional neural networks (CNN) has achieved unprecedented success in segmentation, however it requires large training data, which is expensive to obtain. Active Learning (AL) frameworks can facilitate major improvements in CNN performance with intelligent selection of minimal data to be labeled. This paper proposes a novel diversified AL based on Fisher information (FI) for the first time for CNNs, where gradient computations from backpropagation are used for efficient computation of FI on the large CNN parameter space. We evaluated the proposed method in the context of newborn and adolescent brain extraction problem under two scenarios: (1) semi-automatic segmentation of a particular subject from a different age group or with a pathology not available in the original training data, where starting from an inaccurate pre-trained model, we iteratively label small number of voxels queried by AL until the model generates accurate segmentation for that subject, and (2) using AL to build a universal model generalizable to all images in a given data set. In both scenarios, FI-based AL improved performance after labeling a small percentage (less than 0.05%) of voxels. The results showed that FI-based AL significantly outperformed random sampling, and achieved accuracy higher than entropy-based querying in transfer learning, where the model learns to extract brains of newborn subjects given an initial model trained on adolescents.","authors":["Jamshid Sourati","Ali Gholipour","Jennifer G. Dy","Sila Kurugol"],"meta":["September 2018","DOI:10.1007/978-3-030-00889-5_10","In book: Deep Learning in Medical Image Analysis and Multimodal Learning for Clinical Decision Support (pp.83-91)"],"references":["313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","311251205_Interactive_Whole-Heart_Segmentation_in_Congenital_Heart_Disease","303683115_Asymptotic_Analysis_of_Objectives_based_on_Fisher_Information_in_Active_Learning","322871206_The_developing_human_connectome_project_A_minimal_processing_pipeline_for_neonatal_cortical_surface_reconstruction","319462219_Suggestive_Annotation_A_Deep_Active_Learning_Framework_for_Biomedical_Image_Segmentation","319279554_A_Probabilistic_Active_Learning_Algorithm_Based_on_Fisher_Information_Ratio","305218171_Cost-Effective_Active_Learning_for_Deep_Image_Classification","285688992_Semidefinite_programming","285635838_The_value_of_unlabeled_data_for_classification_problems","277958952_Convergence_Rates_of_Active_Learning_for_Maximum_Likelihood_Estimation"]}