{"id":"327702133_Effect_of_Performance_Expectancy_and_Effort_Expectancy_on_the_Mobile_Commerce_Adoption_Intention_through_Personal_Innovativeness_among_Pakistani_Consumers","abstract":"Global environment is now changing drastically, and a revolutionary change has been observed in consumer buying behavior, radically shifting from physically environment to mobile commerce. Regardless of the previous researches that has executed by researches over the last two decades on the adoption behavior of mobile commerce in a field of marketing and IT, further empirical investigation is required to explore the individual characteristic such as personal innovativeness that stimulate the consumers to adopt the mobile commerce services. Primarily this research is conducted to understand the relationships among performance expectancy, effort expectancy, personal innovativeness and behavioral intentions in a Pakistani consumer market and how individual variable dubbed personal innovativeness mediates the relationship among performance expectancy, effort expectancy, personal innovativeness and behavioral intentions using framework of unified theory of acceptance and use of technology (UTAUT). The study has conducted a questionnaire-based survey of 320 users of mobile commerce in total. Structural equation modeling (SEM) technique is used through AMOS version 23. Results show that the performance expectancy and effort expectancy are significantly influence the behavioral intentions to adopt mobile commerce with significant effect of mediator and the results for this study could be fruitful for telecommunication, mobile commerce companies and marketers in formulating strategies to attract potential consumers effectively and efficiently. The present study enriches and adds value to limited literature on performance expectancy, effort expectancy, personal innovativeness and behavioral intentions. In addition, personal innovativeness has not been inspected earlier as a mediating variable.","authors":["Pak J Commer","Soc Sci","Shrafat Ali Sair","Rizwan Qaiser Danish"],"meta":["August 2018"],"references":["309118412_Continuance_intention_of_mobile_commerce_usage_activities_Does_personal_innovativeness_matter","324688306_Factors_influencing_the_adoption_of_mobile_commerce_applications_in_Cameroon","323286163_Factors_influencing_the_adoption_of_mobile_commerce_in_Taiwan","313335681_Explaining_the_Adoption_of_Social_Networks_Sites_to_Share_User-Generated_Content_A_Revision_of_the_UTAUT2","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","312617768_Emerging_value_propositions_for_m-commerce","312557103_Factors_influencing_adoption_of_mobile_banking_by_Jordanian_bank_customers_Extending_UTAUT2_with_trust","311682119_A_SEM-neural_network_approach_for_predicting_antecedents_of_m-commerce_acceptance","305348568_Marketing_research_an_applied_orientation","303919046_Principles_and_Practice_of_Structural_Equation_Modeling"]}