{"id":"327729039_UniLectin3D_a_database_of_carbohydrate_binding_proteins_with_curated_information_on_3D_structures_and_interacting_ligands","abstract":"Lectins, and related receptors such as adhesins and toxins, are glycan-binding proteins from all origins that decipher the glycocode, i.e. the structural information encoded in the conformation of complex carbohydrates present on the surface of all cells. Lectins are still poorly classified and annotated, but since their functions are based on ligand recognition, their 3D-structures provide a solid foundation for characterization. UniLectin3D is a curated database that classifies lectins on origin and fold, with cross-links to literature, other databases in glycosciences and functional data such as known specificity. The database provides detailed information on lectins, their bound glycan ligands, and features their interactions using the Protein-Ligand Interaction Profiler (PLIP) server. Special care was devoted to the description of the bound glycan ligands with the use of simple graphical representation and numerical format for cross-linking to other databases in glyco-science. We conceived the design of the database architecture and the navigation tools to account for all organisms, as well as to search for oligosaccharide epitopes complexed within specified binding sites. UniLectin3D is accessible at https://www.unilectin. eu/unilectin3D.","authors":["François Bonnardel","Julien Mariethoz","Sebastian Salentin","Xavier Robin"],"meta":["September 2018Nucleic Acids Research 47(D1)","DOI:10.1093/nar/gky832"],"references":["326964908_GlycomicsExPASy_Bridging_the_gap","325321334_SWISS-MODEL_homology_modelling_of_protein_structures_and_complexes","321011063_PDBe_Towards_reusable_data_delivery_infrastructure_at_protein_data_bank_in_Europe","315612844_ProtVista_Visualization_of_protein_sequence_annotations","325499009_NGL_Viewer_Web-based_molecular_graphics_for_large_complexes","325306385_Glycoinformatics_Bridging_Isolated_Islands_in_the_Sea_of_Data","323663767_Understanding_the_glycome_An_interactive_view_of_glycosylation_from_glycocompositions_to_glycoepitopes","321409324_LiteMol_suite_Interactive_web-based_visualization_of_large-scale_macromolecular_structure_data","320540092_GlyTouCan_An_accessible_glycan_structure_repository","317095974_Histo-blood_group_antigens_as_mediators_of_infections"]}