{"id":"327767400_Using_Big_Data_Techniques_for_Measuring_Productive_Friction_in_Mass_Collaboration_Online_Environments","abstract":"The advent of the social web brought with it challenges and opportunities for research on learning and knowledge construction. Using the online-encyclopedia Wikipedia as an example, we discuss several methods that can be applied to analyze the dynamic nature of knowledge-related processes in mass collaboration environments. These methods can help in the analysis of the interactions between the two levels that are relevant in computer-supported collaborative learning (CSCL) research: The individual level of learners and the collective level of the group or community. In line with constructivist theories of learning, we argue that the development of knowledge on both levels is triggered by productive friction, that is, the prolific resolution of socio-cognitive conflicts. By describing three prototypical methods that have been used in previous Wikipedia research, we review how these techniques can be used to examine the dynamics on both levels and analyze how these dynamics can be predicted by the amount of productive friction. We illustrate how these studies make use of text classifiers, social network analysis, and cluster analysis in order to operationalize the theoretical concepts. We conclude by discussing implications for the analysis of dynamic knowledge processes from a learning sciences perspective.","authors":["Peter Holtz","Joachim Kimmerle","Ulrike Cress"],"meta":["December 2018International Journal of Computer-Supported Collaborative Learning 13(1)","DOI:10.1007/s11412-018-9285-y","Projects: Knowledge construction in WikipediaAnalytics for Everyday Learning"],"references":["324687610_Handbook_of_Learning_Analytics","323772665_Effects_of_Contributor_Experience_on_the_Quality_of_Health-Related_Wikipedia_Articles","319903018_AFEL_Towards_Measuring_Online_Activities_Contributions_to_Self-Directed_Learning","317098880_A_Productive_Clash_of_Perspectives_The_Interplay_between_Articles'_and_Authors'_Perspectives_and_their_Impact_on_Wikipedia_Edits_in_a_Controversial_Domain","316806471_Dialogic_Education_and_Technology","346833069_Big_Data_In_Psychological_Research","320807370_Cluster_Analysis","317588557_All_in_Good_Time_Knowledge_Introduction_Restructuring_and_Development_of_Shared_Opinions_as_Different_Stages_in_Collaborative_Writing","317371283_Joint_interactions_in_large_online_knowledge_communities_The_A3C_framework","316177286_The_Interrelations_of_Individual_Learning_and_Collective_Knowledge_Construction_A_Cognitive-Systemic_Framework"]}