{"id":"327754330_THALWEG_DETECTION_FOR_RIVER_NETWORK_CARTOGRAPHY_IN_FOREST_FROM_HIGH-RESOLUTION_LIDAR_DATA","abstract":"This paper addresses the problem of extracting the drainage network in forested areas. A precise description of the drainage network including intermittent streams is required for the planning of logging operations and environmental conservation. LiDAR provides now high-resolution point clouds from which the terrain is modelled and the drainage extracted but it also brings some challenges for traditional approaches. First, the raster DTM is interpolated from LiDAR ground points and has to be split in tiles for processing, adding approximations. Second, drainage enforcement techniques alter the terrain and rely on parameters difficult to fix and limiting the optimisation of the process. In this context, we discuss a new approach aiming at: (1) Designing a data structure to model the terrain with a Triangulated Irregular Network in order to avoid interpolation. This data structure must enable the distribution of data and processes across several nodes in Big data architectures and eventually, the processing of complete watersheds with no tiling. (2) Modelling the river network through thalwegs and avoiding the filling and breaching operations. Thalweg detection is more robust, removing the need for filling and breaching. However, it yields a very dense network requiring a simplification step. Combining this model and the architecture will enable the design and modelling of a new tool for river network computation directly from LiDAR ground points. In this paper, we mainly discuss the second point and propose to model the drainage by a network of thalwegs computed from the terrain. Thalwegs are extracted from the surface network, a topological structure formed of peaks, pits and saddles as vertices and ridges and thalwegs as vertices. We present preliminary results comparing the thalweg network and the drainage network.","authors":["Eric Guilbert","Sylvain Jutras","Thierry Badard"],"meta":["September 2018","DOI:10.5194/isprs-archives-XLII-4-241-2018"],"references":["309430037_Comparison_of_various_algorithms_for_DTM_interpolation_from_LIDAR_data_in_dense_mountain_forests","309188841_An_Object_Based_Approach_for_Submarine_Canyon_Identification_from_Surface_Networks","303845763_COMPARISON_OF_HIGH_AND_LOW_DENSITY_AIRBORNE_LIDAR_DATA_FOR_FOREST_ROAD_QUALITY_ASSESSMENT","324052436_Elcano_A_Geospatial_Big_Data_Processing_System_based_on_SparkSQL","313657404_Carving_and_adaptive_drainage_enforcement_of_grid_digital_elevation_models","309053489_Algorithms_for_Extracting_Correct_Critical_Points_and_Constructing_Topological_Graphs_from_Discrete_Geographical_Elevation_Data","301241625_Drainage_networks_and_watersheds_delineation_derived_from_TIN-based_digital_elevation_models","286925102_The_practice_of_DEM_stream_burning_revisited","284814928_Hierarchical_models_for_the_definition_and_extraction_of_terrain_features","281241558_Interpolation_Routines_Assessment_in_ALS-Derived_Digital_Elevation_Models_for_Forestry_Applications"]}