{"id":"327761579_Reconstruction_of_the_socio-semantic_dynamics_of_political_activist_Twitter_networks-Method_and_application_to_the_2017_French_presidential_election","abstract":"Background\nDigital spaces, and in particular social networking sites, are becoming increasingly present and influential in the functioning of our democracies. In this paper, we propose an integrated methodology for the data collection, the reconstruction, the analysis and the visualization of the development of a country’s political landscape from Twitter data.\n\nMethod\nThe proposed method relies solely on the interactions between Twitter accounts and is independent of the characteristics of the shared contents such as the language of the tweets. We validate our methodology on a case study on the 2017 French presidential election (60 million Twitter exchanges between more than 2.4 million users) via two independent methods: the comparison between our automated political categorization and a human categorization based on the evaluation of a sample of 5000 profiles descriptions; the correspondence between the reconfigurations detected in the reconstructed political landscape and key political events reported in the media. This latter validation demonstrated the ability of our approach to accurately reflect the reconfigurations at play in the off-line political scene.\n\nResults\nWe built on this reconstruction to give insights into the opinion dynamics and the reconfigurations of political communities at play during a presidential election. First, we propose a quantitative description and analysis of the political engagement of members of political communities. Second, we analyze the impact of political communities on information diffusion and in particular on their role in the fake news phenomena. We measure a differential echo chamber effect on the different types of political news (fake news, debunks, standard news) caused by the community structure and emphasize the importance of addressing the meso-structures of political networks in understanding the fake news phenomena.\n\nConclusions\nGiving access to an intermediate level, between sociological surveys in the field and large statistical studies (such as those conducted by national or international organizations) we demonstrate that social networks data make it possible to qualify and quantify the activity of political communities in a multi-polar political environment; as well as their temporal evolution and reconfiguration, their structure, their alliance strategies and their semantic particularities during a presidential campaign through the analysis of their digital traces. We conclude this paper with a comment on the political and ethical implications of the use of social networks data in politics. We stress the importance of developing social macroscopes that will enable citizens to better understand how they collectively make society and propose as example the “Politoscope”, a macroscope that delivers some of our results in an interactive way.","authors":["Noé Gaumont","Maziyar Panahi","David Chavalarias"],"meta":["September 2018PLoS ONE 13(9):e0201879","DOI:10.1371/journal.pone.0201879"],"references":["323650280_The_science_of_fake_news","318699348_Beyond_Misinformation_Understanding_and_Coping_with_the_Post-Truth_Era","334062672_The_Cultural_Origins_of_Human_Cognition","323649207_The_spread_of_true_and_false_news_online","323142063_Social_Media_News_and_Political_Information_during_the_US_Election_Was_Polarizing_Content_Concentrated_in_Swing_States","319395187_Knowledge_Engineering_Practice_and_Patterns","318740751_Beyond_Binary_Labels_Political_Ideology_Prediction_of_Twitter_Users","311532789_Latent_dirichlet_allocation","311490351_Quantifying_Controversy_in_Social_Media","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web"]}