{"id":"327735985_Understanding_the_interplay_between_social_and_spatial_behaviour","abstract":"Abstract According to personality psychology, personality traits determine many aspects of human behaviour. However, validating this insight in large groups has been challenging so far, due to the scarcity of multi-channel data. Here, we focus on the relationship between mobility and social behaviour by analysing trajectories and mobile phone interactions of ∼1000 individuals from two high-resolution longitudinal datasets. We identify a connection between the way in which individuals explore new resources and exploit known assets in the social and spatial spheres. We show that different individuals balance the exploration-exploitation trade-off in different ways and we explain part of the variability in the data by the big five personality traits. We point out that, in both realms, extraversion correlates with the attitude towards exploration and routine diversity, while neuroticism and openness account for the tendency to evolve routine over long time-scales. We find no evidence for the existence of classes of individuals across the spatio-social domains. Our results bridge the fields of human geography, sociology and personality psychology and can help improve current models of mobility and tie formation.","authors":["Laura Alessandretti","Sune Lehmann","Andrea Baronchelli"],"meta":["December 2018EPJ Data Science 7(1)","DOI:10.1140/epjds/s13688-018-0164-6"],"references":["321793448_Correlations_between_human_mobility_and_social_interaction_reveal_general_activity_patterns","313879521_Personality_Traits_and_Ego-network_Dynamics","308026943_Evidence_for_a_Conserved_Quantity_in_Human_Mobility","307439022_The_TimeGeo_modeling_framework_for_urban_mobility_without_travel_surveys","281590314_Returners_and_explorers_dichotomy_in_human_mobility","303014211_What_about_people_in_regional_scienceJ","301428591_Opportunities_and_Challenges_in_Crowdsourced_Wardriving","301233236_Clustering_and_preferential_attachment_in_growing_networks","286103880_Urban_rhythms_and_travel_behaviour_Spatial_and_temporal_phenomena_of_daily_travel","283270587_Mining_Facebook_data_for_predictive_personality_modeling"]}