{"id":"327729908_Probing_Limits_of_Information_Spread_with_Sequential_Seeding","abstract":"We consider here information spread which propagates with certain probability from nodes just activated to their not yet activated neighbors. Diffusion cascades can be triggered by activation of even a small set of nodes. Such activation is commonly performed in a single stage. A novel approach based on sequential seeding is analyzed here resulting in three fundamental contributions. First, we propose a coordinated execution of randomized choices to enable precise comparison of different algorithms in general. We apply it here when the newly activated nodes at each stage of spreading attempt to activate their neighbors. Then, we present a formal proof that sequential seeding delivers at least as good spread coverage as the single stage seeding does. Moreover, we also show that, under modest assumptions, sequential seeding performs provably better than the single stage seeding using the same number of seeds and node ranking. Finally, we present experimental results comparing single stage and sequential approaches on directed and undirected graphs to the well-known greedy approach to provide the objective measure of the sequential seeding benefits. Surprisingly, applying sequential seeding to a simple degree-based selection leads to higher coverage than achieved by the computationally expensive greedy approach currently considered to be the best heuristic.","authors":["Jarosław Jankowski","Boleslaw K. Szymanski","Przemysław Kazienko","Radosław Michalski"],"meta":["September 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-32081-2"],"references":["319453490_Seeds_Buffering_for_Information_Spreading_Processes","316229651_Dynamic_Rankings_for_Seed_Selection_in_Complex_Networks_Balancing_Costs_and_Coverage","316220619_Balancing_Speed_and_Coverage_by_Sequential_Seeding_in_Complex_Networks","304555048_Scalable_Methods_for_Adaptively_Seeding_a_Social_Network","291821968_Success_Factors_in_Product_Seeding_The_Role_of_Homophily","287483617_A_Novel_Top-k_Strategy_for_Influence_Maximization_in_Complex_Networks_with_Community_Structure","283872657_Dynamic_influence_maximization_under_increasing_returns_to_scale","321245909_The_structure_of_scientific_collaboration_networks","312970191_Scientific_collaboration_networks","290718207_Cultures_of_the_Central_Highlands_New_Guinea"]}