{"id":"327753925_Exploring_the_benefits_and_challenges_of_learning_analytics_in_higher_education_institutions_A_systematic_literature_review","abstract":"Purpose\n\nThe potential capabilities and benefits that learning analytics can provide are not fully utilized. A current stream of research suggests that learning analytics has more to offer for continuous improvement of higher education institutions. This research aims at exploring the opportunities that data analytics stand to offer higher education and the challenges that plays down its role, adoption and usage in different areas of higher education institutions.\n\nDesign/methodology/approach\n\nThe current research adopts a systematic literature review approach in answering the research questions. The critical role of research reviews, the relative newness of learning analytics in addition to the exploratory nature of the research questions justify the use of a systematic literature review. The current research employed systematic research process adapted and presented by (Hallinger, 2012) to be used in social sciences in general and in educational leadership and management in particular. A standard process of finding relevant articles and examining reference lists is followed using articles from higher education which is the research context.\n\nFindings\n\nAn examination of the literature showed that the majority of studies within the sample of articles are empirical representing (53%), (32%) are conceptual while only (15%) of the articles are a systematic literature review. Results also show that (58%) of the articles are teaching and learning related, 34% are management related while only 8% are research related. Several challenges and opportunities of learning analytics in the three areas highlighted are presented and discussed.\n\nOriginality/value\n\nThe benefits and challenges of learning analytics are numerous and scattered in the literature. In this research a typology related to different educational domains is developed to shed light on the benefits and challenges of learning analytics within particular higher education areas that are relevant to specific stakeholders. Benefits and challenges of learning analytics are classified into being : management related, teaching and learning related and research related.","authors":["Shahira El Alfy","Jorge Marx Gómez","Anita Dani"],"meta":["September 2018Information Discovery and Delivery 47(4):00-00","DOI:10.1108/IDD-06-2018-0018"],"references":["319132917_Using_Learning_Analytics_for_Preserving_Academic_Integrity","314246417_Learning_analytics_and_the_imperative_for_theory-driven_research","314151376_Supporting_adaptive_learning_pathways_through_the_use_of_learning_analytics_developments_challenges_and_future_opportunities","312509093_A_Systematic_Review_on_Educational_Data_Mining","312127274_Information_Literacy_and_Retention_A_Case_Study_of_the_Value_of_the_Library","325147872_APPLICATION_OF_DATAMINING_TECHNIQUES_IN_HIGHER_EDUCATION_SYSTEM","319292839_Academic_libraries_institutional_learning_analytics_One_path_to_integration","318794169_An_Agile_Approach_for_Academic_Analytics_A_Case_Study","316635133_EMERGING_EVIDENCE_ON_THE_USE_OF_BIG_DATA_AND_ANALYTICS_IN_WORKPLACE_LEARNING_A_Systematic_Literature_Review","311718666_Are_Higher_Education_Institutions_Prepared_for_Learning_Analytics"]}