{"id":"327741382_Empiricism_without_Magic_Transformational_Abstraction_in_Deep_Convolutional_Neural_Networks","abstract":"In artificial intelligence, recent research has demonstrated the remarkable potential of Deep Convolutional Neural Networks (DCNNs), which seem to exceed state-of-the-art performance in new domains weekly, especially on the sorts of very difficult perceptual discrimination tasks that skeptics thought would remain beyond the reach of artificial intelligence. However, it has proven difficult to explain why DCNNs perform so well. In philosophy of mind, empiricists have long suggested that complex cognition is based on information derived from sensory experience, often appealing to a faculty of abstraction. Rationalists have frequently complained, however, that empiricists never adequately explained how this faculty of abstraction actually works. In this paper, I tie these two questions together, to the mutual benefit of both disciplines. I argue that the architectural features that distinguish DCNNs from earlier neural networks allow them to implement a form of hierarchical processing that I call “transformational abstraction”. Transformational abstraction iteratively converts sensory-based representations of category exemplars into new formats that are increasingly tolerant to “nuisance variation” in input. Reflecting upon the way that DCNNs leverage a combination of linear and non-linear processing to efficiently accomplish this feat allows us to understand how the brain is capable of bi-directional travel between exemplars and abstractions, addressing longstanding problems in empiricist philosophy of mind. I end by considering the prospects for future research on DCNNs, arguing that rather than simply implementing 80s connectionism with more brute-force computation, transformational abstraction counts as a qualitatively distinct form of processing ripe with philosophical and psychological significance, because it is significantly better suited to depict the generic mechanism responsible for this important kind of psychological processing in the brain.","authors":["Cameron Buckner"],"meta":["December 2018Synthese 195(3)","DOI:10.1007/s11229-018-01949-1"],"references":["326381669_Large-Scale_High-Resolution_Comparison_of_the_Core_Visual_Object_Recognition_Behavior_of_Humans_Monkeys_and_State-of-the-Art_Deep_Artificial_Neural_Networks","321100819_Building_machines_that_learn_and_think_for_themselves","320473480_Mastering_the_game_of_Go_without_human_knowledge","316718563_Equilibrium_Propagation_Bridging_the_Gap_between_Energy-Based_Models_and_Backpropagation","345665888_Are_More_Details_Better_On_the_Norms_of_Completeness_for_Mechanistic_Explanations","344505005_Doing_without_Concepts","325370890_Concept_Nativism_and_Neural_Plasticity","322220859_Deep_Learning_A_Critical_Appraisal","322057605_Predicting_Deeper_into_the_Future_of_Semantic_Segmentation","318551830_Neuroscience-Inspired_Artificial_Intelligence","311646906_Mechanistic_Abstraction","315608881_Back_to_the_Cradle_Mechanism_Schemata_from_Piaget_to_DNA","312511634_Deconvolution_and_Checkerboard_Artifacts","311610841_Image_Style_Transfer_Using_Convolutional_Neural_Networks","311458890_A_Probabilistic_Framework_for_Deep_Learning"]}