{"id":"327709435_Peeking_Inside_the_Black-Box_A_Survey_on_Explainable_Artificial_Intelligence_XAI","abstract":"At the dawn of the fourth industrial revolution, we are witnessing a fast and widespread adoption of Artificial Intelligence (AI) in our daily life, which contributes to accelerating the shift towards a more algorithmic society. However, even with such unprecedented advancements, a key impediment to the use of AI-based systems is that they often lack transparency. Indeed, the black box nature of these systems allows powerful predictions, but it cannot be directly explained. This issue has triggered a new debate on Explainable Artificial Intelligence. A research field that holds substantial promise for improving trust and transparency of AI-based systems. It is recognized as the sine qua non for AI to continue making steady progress without disruption. This survey provides an entry point for interested researchers and practitioners to learn key aspects of the young and rapidly growing body of research related to explainable AI. Through the lens of literature, we review existing approaches regarding the topic, we discuss trends surrounding its sphere and we present major research trajectories.","authors":["Amina Adadi","Mohammed Berrada"],"meta":["September 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2870052"],"references":["330373326_Adversarial_Examples_Attacks_and_Defenses_for_Deep_Learning","328307690_Explainable_AI_for_Designers_A_Human-Centered_Perspective_on_Mixed-Initiative_Co-Creation","327552003_Visualizing_the_Feature_Importance_for_Black_Box_Models","350857855_Quantitative_Evaluation_of_Machine_Learning_Explanations_A_Human-Grounded_Benchmark","346236975_Tree_Space_Prototypes_Another_Look_at_Making_Tree_Ensembles_Interpretable","340782084_Machine_Learning_and_Artificial_Intelligence","334601446_Lightly-supervised_Representation_Learning_with_Global_Interpretability","330880261_Explaining_Explanations_An_Overview_of_Interpretability_of_Machine_Learning","330297410_Distill-and-Compare_Auditing_Black-Box_Models_Using_Transparent_Model_Distillation","330294149_Interpretable_Approaches_to_Detect_Bias_in_Black-Box_Models"]}