{"id":"327739225_Triclustering_Algorithms_for_Three-Dimensional_Data_Analysis_A_Comprehensive_Survey","abstract":"Three-dimensional data are increasingly prevalent across biomedical and social domains. Notable examples are gene-sample-time, individual-feature-time, or node-node-time data, generally referred to as observation-attribute-context data. The unsupervised analysis of three-dimensional data can be pursued to discover putative biological modules, disease progression profiles, and communities of individuals with coherent behavior, among other patterns of interest. It is thus key to enhance the understanding of complex biological, individual, and societal systems. In this context, although clustering can be applied to group observations, its relevance is limited since observations in three-dimensional data domains are typically only meaningfully correlated on subspaces of the overall space. Biclustering tackles this challenge but disregards the third dimension. In this scenario, triclustering—the discovery of coherent subspaces within three-dimensional data—has been largely researched to tackle these problems. Despite the diversity of contributions in this field, there still lacks a structured view on the major requirements of triclustering, desirable forms of homogeneity (including coherency, structure, quality, locality, and orthonormality criteria), and algorithmic approaches. This work formalizes the triclustering task and its scope, introduces a taxonomy to categorize the contributions in the field, provides a comprehensive comparison of state-of-the-art triclustering algorithms according to their behavior and output, and lists relevant real-world applications. Finally, it highlights challenges and opportunities to advance the field of triclustering and its applicability to complex three-dimensional data analysis.","authors":["Rui Henriques","Sara C . Madeira"],"meta":["September 2018ACM Computing Surveys 51(5):1-43","DOI:10.1145/3195833"],"references":["319867164_CLUSTERING-BASED_APPROACHES_TO_THE_EXPLORATION_OF_SPATIO-TEMPORAL_DATA","318154262_Turning_Krimp_into_a_Triclustering_Technique_on_Sets_of_Attribute-Condition_Pairs_that_Compress","318011890_BSig_Evaluating_the_Statistical_Significance_of_Biclustering_Solutions","317832702_Triclustering_Georeferenced_Time_Series_for_Analyzing_Patterns_of_Intra-Annual_Variability_in_Temperature","312644404_A_systematic_comparative_evaluation_of_biclustering_techniques","308092146_Tri-Clustered_Tensor_Completion_for_Social-Aware_Image_Tag_Refinement","303424893_BicNET_Flexible_module_discovery_in_large-scale_biological_networks_using_biclustering","312521785_TimesVector_A_vectorized_clustering_approach_to_the_analysis_of_time_series_transcriptome_data_from_multiple_phenotypes","307823324_Learning_from_High-Dimensional_Data_using_Local_Descriptive_Models","307435901_A_Fast_Gene_Expression_Analysis_using_Parallel_Biclustering_and_Distributed_Triclustering_Approach"]}