{"id":"327798140_Flow_around_Groynes_Modelling_in_Different_Numerical_Schemes","abstract":"There is no need for further augment about the performance of numerical model in representing the hydraulic flow regime. Even if the mathematics and computer science have obtained many considerable progresses, there have not been yet uptil now a numerical solution that is considered comprehensively and perfectly the fluid mechanics due to its complication. Therefore, lot of numerical schemes have been developed relied on different approaches: Advection schemes, diffusion schemes, turbulence models. Model appropriate selection is considered as a key factor to sovle successfully a real problem. With the aims of evaluating the impact of different numerical schemes, this study uses TELEMAC 3D model, a product of EDF, to simulate the hydraulic regime in river. Relying on the advection schemes and turbulence models, five scenarios are organized in TELEMAC 3D for representing the hydraulic flow in a segment of the Waal, Netherlands. The modeling result is compared with the research of Mohamed F.M Yossef and Huid J. de Vriend (2011) in aspect of horizontal velocity distribution, vertical velocity distribution, flow stage. The comparison shows that there is a significant uncertainty in using different numerical schemes for flow stage modeling. The paper is expected to provide an insight view about using the computational model for hydraulic research and to be useful for studying the dynamics of flow stage by hydrodynamics simulation.","authors":["Nguyen Quang Binh","Duong Ngoc Vo","Philippe Gourbesville"],"meta":["September 2018","DOI:10.29007/2nlb"],"references":["259840779_Flow_Details_near_River_Groynes_Experimental_Investigation","228958634_Coherent_Structures_in_Flat-Bed_Abutment_Flow_Computational_Fluid_Dynamics_Simulations_and_Experiments","288771736_Three-dimensional_simulation_of_flow_around_a_groyne_with_large-eddy_turbulence_model","284662489_Study_of_Scour_Around_Spur-Dikes","245297097_3D_Unsteady_RANS_Modeling_of_Complex_Hydraulic_Engineering_Flows_I_Numerical_Model","245297095_Effects_of_Groyne_Layout_on_the_Flow_in_Groyne_Fields_Laboratory_Experiments","245039754_An_experimental_study_on_tip_velocity_and_downstream_recirculation_zone_of_single_groynes_of_permeability_change","239389519_Numerical_Investigation_of_Flow_Hydrodynamics_in_a_Channel_with_a_Series_of_Groynes","226508995_Mass_exchange_in_a_shallow_channel_flow_with_a_series_of_groynes_LES_study_and_comparison_with_laboratory_and_field_experiments"]}