{"id":"327795691_Measuring_shared_mental_models_in_healthcare","abstract":"Objective\nTo review common qualitative and quantitative methods of measuring shared mental models appropriate for use in the healthcare setting.\n\nBackground\nShared mental models are the overlap of individuals’ set of knowledge and/or assumptions that act as the basis for understanding and decision making between individuals. Within healthcare, shared mental models facilitate effective teamwork and theorized to influence clinical decision making and performance. With the current rapid growth and expansion of healthcare teams, it is critical that we understand and correctly use shared mental model measurement methods assess optimal team performance. Unfortunately, agreement on the proper measurement of shared mental models within healthcare remains diffuse.\n\nMethod\nThis paper presents methods appropriate to measure shared mental models within healthcare.\n\nResults\nMultiple shared mental model measurement methods are discussed with regard to their utility within this setting, ease of use, and difficulties in deploying within the healthcare operational environment. For rigorous analysis of shared mental models, it is recommended that a combination of qualitative and quantitative analyses be employed.\n\nConclusion\nThere are multitude of shared mental model measurement methods that can be used in the healthcare domain; although there is no perfect solution for every situation. Researchers can utilize this article to determine the best approach for their needs.","authors":["Logan Gisick","Kristen Webster","Joseph Roland Keebler","Elizabeth Lazzara"],"meta":["September 2018Journal of Patient Safety and Risk Management 23(5):251604351879644","DOI:10.1177/2516043518796442"],"references":["309644998_Directly_Comparing_Handoff_Protocols_for_Pediatric_Hospitalists","308003479_Medical_Waste_Disposal_Method_Selection_Based_on_a_Hierarchical_Decision_Model_with_Intuitionistic_Fuzzy_Relations","307579828_Assessing_the_similarity_of_mental_models_of_operating_room_team_members_and_implications_for_patient_safety_A_prospective_replicated_study","299712629_Comprehending_Adverbs_Of_Doubt_And_Certainty_In_Health_Communication_A_Multidimensional_Scaling_Approach","275023609_Root-Cause_Analysis_Creating_Utilizing_a_Functional_Database","305110338_A_Knowledge_Capture_Approach_For_Directly_Acquiring_Team_Mental_Models","303151880_Conceptual_development_and_empirical_evaluation_of_measures_of_shared_mental_models_as_indicators_of_team_effectiveness","301217467_The_Mastery_Rubric_for_Evidence-Based_Medicine_Institutional_Validation_via_Multidimensional_Scaling","299693282_Distance_Ratio_An_Exploratory_Application_to_Compare_Complex_Networks","273584961_How_to_turn_a_team_of_experts_into_an_expert_medical_team_guidance_from_the_aviation_and_military_communities"]}