{"id":"327732603_A_Hybrid_Approach_of_Using_Particle_Swarm_Optimization_and_Volumetric_Active_Contour_without_Edge_for_Segmenting_Brain_Tumors_in_MRI_Scan","abstract":"segmentation of brain tumors in magnetic resonance imaging is a one of the most complex processes in medical image analysis because it requires a combination of data knowledge with domain knowledge to achieve highly results. Such that, the data knowledge refers to homogeneity, continuity, and anatomical texture. While the domain knowledge refers to shapes, location, and size of the tumor to be delineated. Due to recent advances in medical imaging technologies which produce a massive number of cross-sectional slices, this makes a manual segmentation process is a very intensive, time-consuming and prone to inconsistences. In this study, an automated method for recognizing and segmenting the pathological area in MRI scans has been developed. First the dataset has been pre-processed and prepared by implementing a set of algorithms to standardize all collected samples. A particle swarm optimization is utilized to find the core of pathological area within each MRI slice. Finally, an active contour without edge method is utilized to extract the pathological area in MRI scan. Results reported on the collected dataset includes 50 MRI scans of pathological patients that was provided by Iraqi Center for Research and Magnetic Resonance of Al Imamain Al-Kadhimain Medical City in Iraq. The achieved accuracy of the proposed method was 92% compared with manual delineation.","authors":["Ali M. Hasan"],"meta":["September 2018International Journal on Electrical Engineering and Informatics 6(3)","DOI:10.11591/ijeei.v6i3.592","Project: Medical Image Processing"],"references":["325436490_A_New_Deformable_Model_Based_on_Fractional_Wright_Energy_Function_for_Tumor_Segmentation_of_Volumetric_Brain_MRI_Scans","324988531_A_New_Local_Fractional_Entropy-Based_Model_for_Kidney_MRI_Image_Enhancement","310464341_Segmentation_of_Brain_Tumors_in_MRI_Images_Using_Three-Dimensional_Active_Contour_without_Edge","308393344_Automated_brain_tumour_detection_and_segmentation_using_superpixel-based_extremely_randomized_trees_in_FLAIR_MRI","299595402_Automated_Segmentation_of_Tumours_in_MRI_Brain_Scans","309456686_Brain_tumor_segmentation_with_deep_neural_networks","305235033_Local_region-based_ACM_with_fractional_calculus_for_boundary_segmentation_in_images_with_intensity_inhomogeneity","301344257_Automated_screening_of_MRI_brain_scanning_using_grey_level_statistics","278717844_Imaging_Modalities_in_Brain_Tumors","278650416_Epidemiology_Histologic_Classification_and_Clinical_Course_of_Brain_Tumors"]}