{"id":"327753157_Glider_soaring_via_reinforcement_learning_in_the_field","abstract":"Soaring birds often rely on ascending thermal plumes (thermals) in the atmosphere as they search for prey or migrate across large distances1-4. The landscape of convective currents is rugged and shifts on timescales of a few minutes as thermals constantly form, disintegrate or are transported away by the wind5,6. How soaring birds find and navigate thermals within this complex landscape is unknown. Reinforcement learning7 provides an appropriate framework in which to identify an effective navigational strategy as a sequence of decisions made in response to environmental cues. Here we use reinforcement learning to train a glider in the field to navigate atmospheric thermals autonomously. We equipped a glider of two-metre wingspan with a flight controller that precisely controlled the bank angle and pitch, modulating these at intervals with the aim of gaining as much lift as possible. A navigational strategy was determined solely from the glider's pooled experiences, collected over several days in the field. The strategy relies on on-board methods to accurately estimate the local vertical wind accelerations and the roll-wise torques on the glider, which serve as navigational cues. We establish the validity of our learned flight policy through field experiments, numerical simulations and estimates of the noise in measurements caused by atmospheric turbulence. Our results highlight the role of vertical wind accelerations and roll-wise torques as effective mechanosensory cues for soaring birds and provide a navigational strategy that is directly applicable to the development of autonomous soaring vehicles.","authors":["Gautam Reddy","Jerome Wong-Ng","Antonio Celani","Terrence J. Sejnowski"],"meta":["October 2018Nature 562(7726)","DOI:10.1038/s41586-018-0533-0"],"references":["320473480_Mastering_the_game_of_Go_without_human_knowledge","305787251_Learning_to_soar_in_turbulent_environments","335654517_Differential_Use_of_Thermal_Convection_by_Soaring_Birds_Over_Central_Israel","320957854_The_Atmospheric_Boundary_Layer","304672166_Frigate_birds_track_atmospheric_conditions_over_months-long_transoceanic_flights","276314527_Learning_to_soar_Resource-constrained_exploration_in_reinforcement_learning","274572264_End-to-End_Training_of_Deep_Visuomotor_Policies","272837232_Human-level_control_through_deep_reinforcement_learning","269204578_Guidance_and_Control_of_an_Autonomous_Soaring_Vehicle_with_Flight_Test_Results","260912339_The_gliding_speed_of_migrating_birds_Slow_and_safe_or_fast_and_risky","232663767_Differential_use_of_thermal_convection_by_soaring_birds_over_central_Israel","260585050_A_First_Course_in_Turbulence","252962648_Autonomous_Soaring_The_Montague_Cross_Country_Challenge","237451342_Thermal_soaring_compared_in_three_dissimilar_tropical_bird_species_Fregata_magnificens_Pelecanus_occidentalis_and_Coragyps_atratus","237377610_Implementation_Details_and_Flight_Test_Results_of_an_Autonomous_Soaring_Controller"]}