{"id":"327727887_Improving_Intrusion_Detection_with_Deep_Packet_Inspection_and_Regular_Expressions","abstract":"Traffic analysis is a process of great importance, when it comes in securing a network. This analysis can be classified in different levels and one of most interest is Deep Packet Inspection (DPI). DPI is a very effective way of monitoring the network, since it performs traffic control over mostly of the OSI model's layers (from L3 to L7). Regular Expressions (RegExp) on the other hand is used in computer science and can make use of a group of characters, in order to create a searching pattern. This technique can be combined with a series of mathematical algorithms for helping the individual to quickly find out the search pattern within a text and even replace it with another value. In this paper, we aim to prove that the use of Regular Expressions is much more productive and effective when used for creating matching rules needed in DPI. We design, test and put into comparison Regular Expression rules and compare it against the conventional methods. In addition to the above, we have created a case study of detecting EternalBlue and DoublePulsar threats, in order to point out the practical and realistic value of our proposal.","authors":["P. Dinaki","Dimitrios Baltatzis","Nikolaos Serketzis"],"meta":["February 2018International Journal of Computer Science and Information Security, 16(2):77"],"references":["224249866_An_Approach_for_Unifying_Rule_Based_Deep_Packet_Inspection","306029169_Research_on_Network_Intrusion_Detection_Method_based_on_Regular_Expression_Matching","302982049_A_Survey_on_Regular_Expression_Matching_for_Deep_Packet_Inspection_Applications_Algorithms_and_Hardware_Platforms","262296386_Efficient_regular_expression_pattern_matching_for_network_intrusion_detection_systems_using_modified_word-based_automata","237400325_Understanding_IPS_and_IDS_Using_IPS_and_IDS_together_for_Defense_in_Depth","237278621_Deep_Packet_Inspection_in_Perspective_Tracing_its_lineage_and_surveillance_potentials","200446667_Guide_to_Intrusion_Detection_and_Prevention_Systems_IDPS"]}