{"id":"327765812_A_Concise_Introduction_to_Geometric_Numerical_Integration","abstract":"Discover How Geometric Integrators Preserve the Main Qualitative Properties of Continuous Dynamical Systems A Concise Introduction to Geometric Numerical Integration presents the main themes, techniques, and applications of geometric integrators for researchers in mathematics, physics, astronomy, and chemistry who are already familiar with numerical tools for solving differential equations. It also offers a bridge from traditional training in the numerical analysis of differential equations to understanding recent, advanced research literature on numerical geometric integration. The book first examines high-order classical integration methods from the structure preservation point of view. It then illustrates how to construct high-order integrators via the composition of basic low-order methods and analyzes the idea of splitting. It next reviews symplectic integrators constructed directly from the theory of generating functions as well as the important category of variational integrators. The authors also explain the relationship between the preservation of the geometric properties of a numerical method and the observed favorable error propagation in long-time integration. The book concludes with an analysis of the applicability of splitting and composition methods to certain classes of partial differential equations, such as the Schrödinger equation and other evolution equations. The motivation of geometric numerical integration is not only to develop numerical methods with improved qualitative behavior but also to provide more accurate long-time integration results than those obtained by general-purpose algorithms. Accessible to researchers and post-graduate students from diverse backgrounds, this introductory book gets readers up to speed on the ideas, methods, and applications of this field. Readers can reproduce the figures and results given in the text using the MATLAB® programs and model files available online.","authors":["Sergio Blanes","Fernando Casas"],"meta":["November 2017","DOI:10.1201/b21563","ISBN: 9781482263442"],"references":[]}