{"id":"327756575_Reflexiones_en_torno_a_la_Investigacion-Accion_educativa","abstract":"En la mayoría de los estudios publicados en el área de educación, la IA (Investigación-Acción) con docentes aparece romantizada presentándose como un método eficaz para que estos cambien sus prácticas de enseñanza. Desde una mirada crítica, el propósito de este artículo es realizar una reflexión metodológica, un análisis sobre cómo se ha construido el conocimiento en una experiencia de IA en donde se desarrollaron comunidades de aprendizaje docente en escuelas secundarias de Córdoba, Argentina. Esta reflexión metodológica analiza las tensiones que se generan entre las demandas de la investigación y las condiciones de trabajo, prácticas y creencias que atraviesan los docentes de las escuelas secundarias. El análisis de las tensiones nos permite comprender el potencial de la IA tanto para estudiar las intervenciones en las escuelas con la colaboración de los docentes, como para crear un modelo de formación de los docentes. Asimismo, los hallazgos de esta reflexión generan implicancias metodológicas para desarrollar IA en las escuelas. AbstractIn most papers published in the educational area, action research (AR) with teachers is romanticized as an efficient method to change teachers practices. From a critical stand point the purpose of this article is to conduct a methodological reflexion, an analysis on how teachers and researcher have constructed knowledge in an AR experience involving teacher professional communities in secondary schools located in Córdoba, Argentina. This methodological reflexion examines tensions that emerged among research demands and teachers believes, practices and working conditions in secondary schools. The tension’s analysis allowed us to understand the potential of AR to both, study school interventions in collaboration with teachers and as a model to teachers’ professional development. The findings of these reflexion generate methodological implicantions for the development of AR in schools. Recibido: 19 de diciembre de 2012Aceptado: 07 de agosto de 2013","authors":["Dra. María Cecilia Martínez"],"meta":["January 2014CPU-e Revista de Investigación Educativa","DOI:10.25009/cpue.v0i18.756"],"references":["268424659_Exploring_Types_of_Educational_Action_Research_Implications_for_Research_Validity","228372074_La_investigacion-accion_colaborativa_Reflexiones_metodologicas_a_partir_de_su_aplicacion_en_un_proyecto_de_Musica_y_Lengua","39148352_Investigacion_colaborativa_y_formacion_de_universitarios","28158229_La_construccion_de_la_accion_tutorial_desde_las_coordenadas_de_la_investigacion_colaborativa","28094316_Investigacion_accion_participativa_IAP_aspectos_conceptuales_y_dificultades_de_implementacion","28092797_Una_reflexion_sobre_algunas_cuestiones_relacionadas_con_la_investigacion-accion_colaboradora_en_educacion","285533648_How_schools_change_reforms_Redefining_reform_success_and_failure","279417759_New_Forms_of_Knowledge_Production_and_the_Role_of_Action_Research","274769350_Ideology_and_Curriculum","273591859_Action_Research_and_Orders_of_Democracy","243479574_Tinkering_Toward_Utopia_A_Century_of_Public_School_Reform","238433424_Emancipation_or_workabilityCritical_versus_pragmatic_scientific_orientation_in_action_research","237507782_PENSAR_HISTORICAMENTE_EL_EXAMEN_PARA_PROBLEMATIZAR_SU_PRESENTE_NOTAS_PARA_UNA_SOCIOGENESIS_DEL_EXAMEN_1","235356496_Research_Design_Qualitative","234658228_The_Search_for_a_Middle_School_Curriculum","208575406_A_People's_History_of_the_United_States","49303773_Pedagogia_del_Oprimido","44481080_La_investigacion-accion_en_educacion_por_John_Elliott","40426369_La_universidad_en_el_proceso_de_integracion_regional_el_caso_del_Mercosur","28075133_Innovaciones_educativas_Reflexiones_sobre_los_contextos_en_su_implementacion"]}