{"id":"327801187_Changing_European_Academics_A_Comparative_Study_of_Social_Stratification_Work_Patterns_and_Research_Productivity","abstract":"European academics have been at the centre of ongoing higher education reforms, as changes in university governance and funding have led to changes in academic work and life. Discussing the academic profession, and most importantly, its increasing stratification across Europe, Changing European Academics explores the drivers of these changes as well as their current and expected results.\n\nThis comparative study of social stratification, work patterns and research productivity:\n\n* Examines eleven national, higher education systems across Europe (Austria, Finland, Germany, Ireland, Italy, The Netherlands, Norway, Poland, Portugal, Switzerland and the United Kingdom)\n\n* Provides a panoramic view of the European academic profession\n\n* Confronts misconceptions of academic work and life with compelling results and detailed analyses\n\n* Discusses new dilemmas inherent to the changing social and economic environments of higher education\n\nA thoughtful and comprehensive study of the changing academic profession in Europe, this book will be of interest to higher education practitioners, managers and policy makers, both in Europe and globally. Changing European Academics will benefit anyone whose work relates to changing academic institutions and changing academic careers. ................................................................\n\nhttps://www.routledge.com/Changing-European-Academics-A-Comparative-Study-of-Social-Stratification/Kwiek/p/book/9780815396482","authors":["Marek Kwiek"],"meta":["January 2019","DOI:10.4324/9781351182041","Publisher: London and New York: Routledge, 272 pp.ISBN: 9780815396482","Projects: [POLISH ONLY] Changing European and Polish Academic ProfessionAcademic Profession in the Knowledge SocietyBook Project: Changing European Academics (published: Routledge 2019)"],"references":["328902812_High_Participation_Systems_of_Higher_Education","327867105_Informetrics_Needs_a_Foundation_in_the_Theory_of_Science","345123967_The_Academic_Man_A_Study_in_the_Sociology_of_a_Profession","344486804_How_Economics_Shapes_Science","344479506_Missing_the_Boat_The_Failure_to_Internationalize_American_Higher_Education","330913337_Reform_as_routine_Organizational_change_and_stability_in_the_modern_world","330332254_Big_Data_Little_Data_No_Data_Scholarship_in_the_Networked_World","329079648_I_Prefer_to_Teach_An_International_Comparison_of_Faculty_Preference_for_Teaching_over_Research","328262875_Women's_status_in_higher_education_Equity_matters","328243384_Key_Profession_The_History_of_the_Association_of_University_Teachers"]}