{"id":"327846934_Fast_Affine_Invariant_Image_Matching","abstract":"Methods performing Image Matching by Affine Simulation (IMAS) attain affine invariance by applying a finite set of affine transforms to the images before comparing them with a Scale Invariant Image Matching (SIIM) method like SIFT or SURF. We describe here how to optimize IMAS methods. First, we detail an algorithm computing a minimal discrete set of affine transforms to be applied to each image before comparison. It yields a full practical affine invariance at the lowest computational cost. The matching complexity of current IMAS algorithms is divided by about 4. Our approach also associates to each image an affine invariant set of descriptors, which is twice smaller than the set of descriptors usually used in IMAS methods, and only 6.4 times larger than the set of similarity invariant descriptors of SIIM methods. In order to reduce the number of false matches, which are inherently more frequent in IMAS approaches than in SIIM, we introduce the notion of hyper-descriptor, which groups descriptors whose keypoints are spatially close. Finally, we also propose a matching criterion allowing each keypoint of the query image to be matched with several keypoints of the target image, in order to deal with situations where an object is repeated several times in the target image.","authors":["Mariano Rodríguez","Julie Delon","Jean-Michel Morel"],"meta":["September 2018Image Processing On Line 8:251-281","DOI:10.5201/ipol.2018.225"],"references":["323358576_Covering_the_Space_of_Tilts_Application_to_Affine_Invariant_Image_Comparison","305213646_Fast-Match_Fast_Affine_Template_Matching","303294459_Fundamental_Matrix_of_a_Stereo_Pair_with_A_Contrario_Elimination_of_Outliers","282055016_An_Analysis_of_the_SURF_Method","274410731_ASIFT_An_Algorithm_for_Fully_Affine_Invariant_Comparison","273388479_MODS_Fast_and_robust_method_for_two-view_matching","265988144_A_Theory_of_Shape_Identification","316074523_Local_features_for_RGBD_image_matching_under_viewpoint_changes","259624675_Three_things_everyone_should_know_to_improve_object_retrieval","257352016_Fully_affine_invariant_SURF_for_image_matching"]}