{"id":"327886798_Multiscale_impact_of_researcher_mobility","abstract":"International mobility facilitates the exchange of scientific, institutional and cultural knowledge. Yet whether globalization and advances in virtual communication technologies have altered the impact of researcher mobility is a relevant and open question that we address by analysing a broad international set of 26 170 physicists from 1980 to 2009, focusing on the 10-year period centred around each mobility event to assess the impact of mobility on research outcomes. We account for secular globalization trends by splitting the analysis into three periods, measuring for each period the effect of mobility on researchers' citation impact, research topic diversity, collaboration networks and geographical coordination. In order to identify causal effects we leverage statistical matching methods that pair mobile researchers with non-mobile researchers that are similar in research profile attributes prior the mobility event. We find that mobile researchers gain up to a 17% increase in citations relative to their non-mobile counterparts, which can be explained by the simultaneous increase in their diversity of co-authors, topics and geographical coordination in the period immediately following migration. Nevertheless, we also observe that researcher's completely curtail prior collaborations with their source country in 11% of the cross-border mobility events. As such, these individual-level perturbations fuel multiscale churning in scientific networks, e.g. rewiring the connectivity of individuals and ideas and affecting international integration. Together these results provide additional clarity on the complex relationship between human capital mobility and the dynamics of social capital investment, with implications for immigration and national innovation system policy.","authors":["Alexander M. Petersen"],"meta":["September 2018Journal of The Royal Society Interface 15(146):20180580","DOI:10.1098/rsif.2018.0580"],"references":["327046471_Cross-disciplinary_evolution_of_the_genomics_revolution","326195081_Methods_to_Account_for_Citation_Inflation_in_Research_Evaluation","324550903_The_gender_gap_in_early_career_transitions_in_the_life_sciences","323502497_Science_of_science","320258552_Circos_An_information_aesthetic_for_comparative_genomics","320235815_Scientists_have_most_impact_when_they're_free_to_move","344486804_How_Economics_Shapes_Science","332457379_The_Difference_How_the_Power_of_Diversity_Creates_Better_Groups_Firms_Schools_and_Societies_-_New_Edition","326857013_A_data-driven_computational_model_on_the_effects_of_immigration_policies","320004388_Science_of_Science_Policy_A_Handbook"]}