{"id":"327804503_Sensoring_a_Generative_System_to_Create_User-Controlled_Melodies","abstract":"The automatic generation of music is an emergent field of research that has attracted the attention of countless researchers. As a result, there is a broad spectrum of state of the art research in this field. Many systems have been designed to facilitate collaboration between humans and machines in the generation of valuable music. This research proposes an intelligent system that generates melodies under the supervision of a user, who guides the process through a mechanical device. The mechanical device is able to capture the movements of the user and translate them into a melody. The system is based on a Case-Based Reasoning (CBR) architecture, enabling it to learn from previous compositions and to improve its performance over time. The user uses a device that allows them to adapt the composition to their preferences by adjusting the pace of a melody to a specific context or generating more serious or acute notes. Additionally, the device can automatically resist some of the user’s movements, this way the user learns how they can create a good melody. Several experiments were conducted to analyze the quality of the system and the melodies it generates. According to the users’ validation, the proposed system can generate music that follows a concrete style. Most of them also believed that the partial control of the device was essential for the quality of the generated music.","authors":["Maria Navarro","Wataru Hashimoto","Sara Rodríguez","Belén Pérez Lancho"],"meta":["September 2018Sensors 18(10):3201","DOI:10.3390/s18103201"],"references":["304490458_Assisted_Lead_Sheet_Composition_Using_FlowComposer","304283708_Composing_Interactive_Dance_Pieces_for_the_MotionComposer_a_device_for_Persons_with_Disabilities","301820335_MetaCompose_A_Compositional_Evolutionary_Music_Composer","299447249_Conchord_An_Application_for_Generating_Musical_Harmony_by_Navigating_in_the_Tonal_Interval_Space","282656282_The_Painting_Fool_Sees_New_Projects_with_the_Automated_Painter","279852285_Collaborative_Composition_with_Creative_Systems_Reflections_on_the_First_Musebot_Ensemble","345707312_The_MIDI_Manual_A_Practical_Guide_to_MIDI_in_the_Project_Studio","282600373_A_computer-based_model_for_collaborative_narrative_generation","282179552_A_Multi-Agent_Emotional_Society_Whose_Melodies_Represent_its_Emergent_Social_Hierarchy_and_Are_Generated_by_Agent_Communications","279220999_Development_of_an_Automatic_Emotional_Music_Accompaniment_System_by_Fuzzy_Logic_and_Adaptive_Partition_Evolutionary_Genetic_Algorithm"]}