{"id":"327851344_Fast_Multiscale_Reconstruction_for_Cryo-EM","abstract":"We present a multiscale reconstruction framework for single-particle analysis (SPA). The representation of three-dimensional (3D) objects with scaled basis functions permits the reconstruction of volumes at any desired scale in the real-space. This multiscale approach generates interesting opportunities in SPA for the stabilization of the initial volume problem or the 3D iterative refinement procedure. In particular, we show that reconstructions performed at coarse scale are more robust to angular errors and permit gains in computational speed. A key component of the proposed iterative scheme is its fast implementation. The costly step of reconstruction, which was previously hindering the use of advanced iterative methods in SPA, is formulated as a discrete convolution with a cost that does not depend on the number of projection directions. The inclusion of the contrast transfer function inside the imaging matrix is also done at no extra computational cost. By permitting full 3D regularization, the framework is by itself a robust alternative to direct methods for performing reconstruction in adverse imaging conditions (e.g., heavy noise, large angular misassignments, low number of projections). We present reconstructions obtained at different scales from a dataset of the 2015/2016 EMDataBank Map Challenge. The algorithm has been implemented in the Scipion package.","authors":["Laurène Donati","Masih Nilchian","Carlos Oscar S. Sorzano","Michael Unser"],"meta":["September 2018Journal of Structural Biology 204(3)","DOI:10.1016/j.jsb.2018.09.008"],"references":["319874364_A_Survey_of_the_Use_of_Iterative_Reconstruction_Algorithms_in_Electron_Microscopy","327206176_A_new_algorithm_for_high-resolution_reconstruction_of_Single_Particles_by_Electron_Microscopy","313411675_cryoSPARC_algorithms_for_rapid_unsupervised_cryo-EM_structure_determination","310122378_Deep_Convolutional_Neural_Network_for_Inverse_Problems_in_Imaging","308082897_Unravelling_biological_macromolecules_with_cryo-electron_microscopy","304462900_Fast_3D_reconstruction_method_for_differential_phase_contrast_X-ray_CT","301624000_Scipion_a_software_framework_toward_integration_reproducibility_and_validation_in_3D_Electron_Microscopy","292695951_Pyramid_approach_to_subpixel_registration_based_on_intensity","291765296_UCSF_Chimera-A_visualization_system_for_exploratory_research_and_analysis","279862704_Optimized_Kaiser-Bessel_Window_Functions_for_Computed_Tomography"]}