{"id":"327868238_Predicting_Land_UseLand_Cover_Changes_Using_a_CA-Markov_Model_under_Two_Different_Scenarios","abstract":"Multi-temporal Landsat images from Landsat 5 Thematic Mapper (TM) acquired in 1993, 1998, 2003 and 2008 and Landsat 8 Operational Land Imager (OLI) from 2017, are used for analysing and predicting the spatio-temporal distributions of land use/land cover (LULC) categories in the Halgurd-Sakran Core Zone (HSCZ) of the National Park in the Kurdistan region of Iraq. The aim of this article was to explore the LULC dynamics in the HSCZ to assess where LULC changes are expected to occur under two different business-as-usual (BAU) assumptions. Two scenarios have been assumed in the present study. The first scenario, addresses the BAU assumption to show what would happen if the past trend in 1993–1998–2003 has continued until 2023 under continuing the United Nations (UN) sanctions against Iraq and particularly Kurdistan region, which extended from 1990 to 2003. Whereas, the second scenario represents the BAU assumption to show what would happen if the past trend in 2003–2008–2017 has to continue until 2023, viz. after the end of UN sanctions. Future land use changes are simulated to the year 2023 using a Cellular Automata (CA)-Markov chain model under two different scenarios (Iraq under siege and Iraq after siege). Four LULC classes were classified from Landsat using Random Forest (RF). Their accuracy was evaluated using κ and overall accuracy. The CA-Markov chain method in TerrSet is applied based on the past trends of the land use changes from 1993 to 1998 for the first scenario and from 2003 to 2008 for the second scenario. Based on this model, predicted land use maps for the 2023 are generated. Changes between two BAU scenarios under two different conditions have been quantitatively as well as spatially analysed. Overall, the results suggest a trend towards stable and homogeneous areas in the next 6 years as shown in the second scenario. This situation will have positive implication on the park.","authors":["Rahel Hamad","Heiko Balzter","Kamal Y. Odisho Kolo"],"meta":["September 2018Sustainability 10(10)","DOI:10.3390/su10103421","Project: Predicting Land Use and Land Cover in Halgurd-Sakran National Park"],"references":["326332925_Land_Cover_Changes_Induced_by_Demining_Operations_in_Halgurd-Sakran_National_Park_in_the_Kurdistan_Region_of_Iraq","323856113_Post-War_Land_Cover_Changes_and_Fragmentation_in_Halgurd_Sakran_National_Park_HSNP_Kurdistan_Region_of_Iraq_has_been_published_in_Land_and_is_available_online","318740976_Scenario-Based_Simulation_on_Dynamics_of_Land-Use-Land-Cover_Change_in_Punjab_Province_Pakistan","314301409_Multi-Criteria_Assessment_of_Land_Cover_Dynamic_Changes_in_Halgurd_Sakran_National_Park_HSNP_Kurdistan_Region_of_Iraq_Using_Remote_Sensing_and_GIS","312517068_Predictive_modelling_of_the_spatial_pattern_of_past_and_future_forest_cover_changes_in_India","311211524_Spatio-temporal_analysis_of_land_useland_cover_pattern_changes_in_Arasbaran_Biosphere_Reserve_Iran","307938894_Statistical_independence_test_and_validation_of_CA_Markov_land_use_land_cover_LULC_prediction_results","323374103_Application_of_CA-Markov_model_and_land_useland_cover_changes_in_Malacca_river_watershed_Malaysia","320355846_Geospatial_Analysis_of_Land_Use_Land_Cover_Change_Modeling_in_Phewa_Lake_Watershed_of_Nepal_by_Using_GEOMOD_Model","312559048_Application_of_Cellular_automata_and_Markov-chain_model_in_geospatial_environmental_modeling-A_review"]}