{"id":"327836192_STEAM_education_Theory_and_practice","abstract":"This book looks at the value of integrating the arts and sciences in the school curriculum. It argues that this will help students further their understanding of analytical concepts through the use of creativity. The authors illustrate how schools can work towards presenting common practices, concepts, and content. Coverage features case studies and lessons learned from classrooms across the United States.\n\nThe notion of STEAM (Science, Technology, Engineering, Arts, and Mathematics) is an emerging discipline unique in its desire to provide a well-rounded approach to education. The chapters of this volume examine STEAM in a variety of settings, from kindergarten to higher education. Readers will learn about the practical considerations involved when introducing the arts and creativity into traditionally left brain processes. This includes best practices for creating and sustaining successful STEAM initiatives in any school, college, or university. For instance, one chapter discusses novel approaches to teach writing with the scientific method in order to help students better present their ideas.\n\nThe authors also detail how the arts can engage more diverse learners, including students who are not traditionally interested in STEM subjects. They provide three concrete examples of classroom-tested inquiries: designing a prosthetic arm for a child, making a paleontology investigation, and taking a closer look at the arts within roller coaster engineering. This book is an invaluable resource for teachers and teacher trainers, university faculty, researchers, and school administrators. It will also be of interest to science, mathematics, engineering, computer science, information technology, arts and design and technology teachers.","authors":["Myint Swe Khine","Shaljan Areepattamannil"],"meta":["March 2019","DOI:10.1007/978-3-030-04003-1","Publisher: SpringerEditor: Myint Swe Khine and Shaljan AreepattamannilISBN: 978-3-030-04003-1"],"references":[]}