{"id":"327869661_Non-Vitamin_K_Antagonist_Oral_Anticoagulants_for_Mechanical_Heart_Valves_Is_the_Door_Still_Open","abstract":"The estimated prevalence of mitral or aortic valvular heart disease is ≈2.5% in the general population of Western countries, and is expected to rise with population aging. A substantial proportion of patients with valvular heart disease undergoes surgical valve replacement. Mechanical heart valves are much more durable than bioprostheses, and are thus preferentially implanted in patients with a longer life expectancy, but have the major drawback of requiring lifelong anticoagulation to prevent valve thrombosis because of their higher thrombogenicity. The non-vitamin K antagonist oral anticoagulants (NOACs) are replacing vitamin K antagonists in many settings, including bioprostheses, because of their favorable safety and efficacy profiles. However, mechanical heart valves currently pose an absolute contraindication to NOACs based on the results of a single phase II study comparing dabigatran and warfarin (RE-ALIGN [Randomized, Phase II Study to Evaluate the Safety and Pharmacokinetics of Oral Dabigatran Etexilate in Patients after Heart Valve Replacement]). That trial was stopped prematurely because of an excess of both stroke and bleeding with the dabigatran doses tested. Because of such negative findings, research in this area has been halted. We believe that several aspects of both the preclinical studies and the RE-ALIGN trial should be critically reevaluated. In our opinion, 1 single trial with a single NOAC does not represent sufficient evidence for dismissing a therapeutic strategy, anticoagulation with NOACs, that has shown better safety and at least similar efficacy as warfarin in the setting of atrial fibrillation and venous thromboembolism,. Herein, we reevaluate this topic to identify the patient profile that has the greatest likelihood of benefit from some of the NOACs, with a focus on factor Xa inhibitors, thus providing some perspectives for basic and translational research.","authors":["Alberto Aimo","Robert Giugliano","Raffaele De Caterina"],"meta":["September 2018Circulation 138(13):1356-1365","DOI:10.1161/CIRCULATIONAHA.118.035612"],"references":["319606976_2017_ESCEACTS_Guidelines_for_the_management_of_valvular_heart_disease","313971073_Factors_XI_and_XII_as_Targets_for_New_Anticoagulants","313801357_Edoxaban_for_the_Prevention_of_Thromboembolism_in_Patients_With_Atrial_Fibrillation_and_Bioprosthetic_Valves","313032730_Cohort_profile_Prevalence_of_valvular_heart_disease_in_community_patients_with_suspected_heart_failure_in_UK","311994001_Anticoagulant_independent_mechanical_heart_valves_Viable_now_or_still_a_distant_holy_grail","325703044_Anticoagulation_and_Antiplatelet_Strategies_After_On-X_Mechanical_Aortic_Valve_Replacement","321429142_European_Society_of_Cardiology_Cardiovascular_Disease_Statistics_2017","320941563_Mechanical_or_Biologic_Prostheses_for_Aortic-Valve_and_Mitral-Valve_Replacement","319143418_Dabigatran_versus_warfarin_in_patients_with_atrial_fibrillation","315119801_2017_AHAACC_Focused_Update_of_the_2014_AHAACC_Guideline_for_the_Management_of_Patients_With_Valvular_Heart_Disease_A_Report_of_the_American_College_of_CardiologyAmerican_Heart_Association_Task_Force_o"]}