{"id":"327821358_Young_women_who_choose_IT_what_role_do_their_families_play","abstract":"Presently there is a worldwide shortage of qualified engineers, IT specialists in particular. One of the strategies to fill in this gap is to find ways to attract more women into the IT industry. In Russia, at the moment, women are underrepresented in Information Technology disciplines. During the 2013/2014 academic year, as few as 24% of students enrolled on Informatics and Computer Science BSc and MSc programs were female, as against 76% male. It means that more young women should be encouraged to pursue IT-related degrees when they enter higher education institutions. Innopolis University (IU), an IT university, located in the City of Innopolis, in the Republic of Tatarstan and presently in its 5th year of operation, aims to significantly increase the share of young women in both its undergraduate and graduate programs. The university's previous research on why girls with an interest in IT while in high-school do not choose an IT career observed, among other factors, the importance parents play, influencing their daughters to pursue other more popular and less stereotyped higher education specializations. This paper reports the results of further research conducted by IU during the admission process in 2016/2017 academic year. The study focuses on the behavior and beliefs of applicants' parents, namely on the similarities in the roles that young male and female families played with regards to their decision to pursue a CS degree. The results of the research will affect students' recruitment procedures at IU.","authors":["Tanya Stanko","Oksana Zhirosh"],"meta":["November 2017","DOI:10.1109/WEEF.2017.8467169","Conference: 2017 7th World Engineering Education Forum (WEEF)"],"references":["322084984_Innopolis_University_a_Center_of_a_Newly-Developed_IT_Hub_in_Russia_The_Results_of_Four_Years_of_Academic_Operation","301411709_Why_girls_with_an_interest_in_IT_in_high-school_do_not_choose_an_IT_career","236705253_Hurdles_in_the_Pipeline_Girls_and_Technology_Careers"]}