{"id":"327812991_Repeatability_and_reproducibility_of_FreeSurfer_FSL-SIENAX_and_SPM_brain_volumetric_measurements_and_the_effect_of_lesion_filling_in_multiple_sclerosis","abstract":"Objectives\nTo compare the cross-sectional robustness of commonly used volumetric software and effects of lesion filling in multiple sclerosis (MS).\n\nMethods\nNine MS patients (six females; age 38±13 years, disease duration 7.3±5.2 years) were scanned twice with repositioning on three MRI scanners (Siemens Aera 1.5T, Avanto 1.5T, Trio 3.0T) the same day. Volumetric T1-weighted images were processed with FreeSurfer, FSL-SIENAX, SPM and SPM-CAT before and after 3D FLAIR lesion filling with LST. The whole-brain, grey matter (GM) and white matter (WM) volumes were calculated with and without normalisation to the intracranial volume or FSL-SIENAX scaling factor. Robustness was assessed using the coefficient of variation (CoV).\n\nResults\nVariability in volumetrics was lower within than between scanners (CoV 0.17–0.96% vs. 0.65–5.0%, p<0.001). All software provided similarly robust segmentations of the brain volume on the same scanner (CoV 0.17–0.28%, p=0.076). Normalisation improved inter-scanner reproducibility in FreeSurfer and SPM-based methods, but the FSL-SIENAX scaling factor did not improve robustness. Generally, SPM-based methods produced the most consistent volumetrics, while FreeSurfer was more robust for WM volumes on different scanners. FreeSurfer had more robust normalised brain and GM volumes on different scanners than FSL-SIENAX (p=0.004). MS lesion filling changed the output of FSL-SIENAX, SPM and SPM-CAT but not FreeSurfer.\n\nConclusions\nConsistent use of the same scanner is essential and normalisation to the intracranial volume is recommended for multiple scanners. Based on robustness, SPM-based methods are particularly suitable for cross-sectional volumetry. FreeSurfer poses a suitable alternative with WM segmentations less sensitive to MS lesions.\n\nKey Points\n• The same scanner should be used for brain volumetry. If different scanners are used, the intracranial volume normalisation improves the FreeSurfer and SPM robustness (but not the FSL scaling factor).\n• FreeSurfer, FSL and SPM all provide robust measures of the whole brain volume on the same MRI scanner. SPM-based methods overall provide the most robust segmentations (except white matter segmentations on different scanners where FreeSurfer is more robust).\n• MS lesion filling with Lesion Segmentation Toolbox changes the output of FSL-SIENAX and SPM. FreeSurfer output is not affected by MS lesion filling since it already takes white matter hypointensities into account and is therefore particularly suitable for MS brain volumetry.","authors":["Chunjie Guo","Daniel Ferreira","Katharina Fink","Eric Westman"],"meta":["September 2018European Radiology 29(3)","DOI:10.1007/s00330-018-5710-x"],"references":["321990229_Diagnosis_of_multiple_sclerosis_2017_revisions_of_the_McDonald_criteria","318099926_Different_patterns_of_longitudinal_brain_and_spinal_cord_changes_and_their_associations_with_disability_progression_in_NMO_and_MS","309602503_Robustness_of_Automated_Methods_for_Brain_Volume_Measurements_across_Different_MRI_Field_Strengths","291424196_Clinical_Feasibility_of_Synthetic_MRI_in_Multiple_Sclerosis_A_Diagnostic_and_Volumetric_Validation_Study","285656846_MRBrainS_Challenge_Online_Evaluation_Framework_for_Brain_Image_Segmentation_in_3T_MRI_Scans","283974973_Quantifying_brain_tissue_volume_in_multiple_sclerosis_with_automated_lesion_segmentation_and_filling","283493562_Nonconventional_MRI_and_microstructural_cerebral_changes_in_multiple_sclerosis","306526827_Guidelines_for_the_use_of_magnetic_resonance_imaging_in_diagnosing_and_monitoring_the_treatment_of_multiple_sclerosis_Recommendations_of_the_Swedish_Multiple_Sclerosis_Association_and_the_Swedish_Neur","305393471_Intra-_and_interscanner_variability_of_magnetic_resonance_imaging_based_volumetry_in_multiple_sclerosis","291947643_MRI_criteria_for_the_diagnosis_of_multiple_sclerosis_MAGNIMS_consensus_guidelines"]}