{"id":"327869615_STEM_as_girls'_professional_choice_achievements_self-esteem_and_hidden_curriculum","abstract":"This article explores the problem of gender inequality, manifested in the process of socialization of schoolchildren and young people. This problem leads to a decrease in the motivation of girls to choose technical sciences an d STEM-professions as a career. The data was collected by means of an online e survey and completing the questionnaire at school. The final sample involved 438 schoolchildren who are enrolled in 5, 8 and 11 grades in Moscow and Gubkin (Belgorod region). The data analysis demonstrates that, despite the fact that the objective achievements of girls in math are high, they tend to underestimate their abilities and less often associate their higher education prospects with technical sciences. A binary logistic regression with the interaction effects was built to look for the determining factors of schoolgirls choice of STEM-field. The appeal to interaction effects allowed to make interpretation of results more meaningful. The regression model reveals that parents, math teachers, gender beliefs, class profiles, assessment of the math abilities and the organization of the school curriculum in certain combinations influence the choice of STEM-disciplines by school girls. It is noteworthy that the class profile and the organization of the school curriculum participated in all interaction effects. The notion of a “hidden curriculum” is developed; a scale is proposed for its measurement. The factor analysis reveals that the most significant factor is “the organization of the academic life and the education programs”.","authors":["Olga Savinskaya","Tamara Mkhitaryan"],"meta":["September 2018","DOI:10.21064/WinRS.2018.3.4","Project: STEM&Gender in Russia: from preschool to labor market"],"references":["273425521_Adjusting_Micromessages_to_Improve_Equity_in_STEM","269275658_Gender_Differences_in_Fields_of_Study_The_Role_of_Significant_Others_and_Rational_Choice_Motivations","315647235_Can_Teacher_Practices_Reduce_the_Gender_Gap_in_Mathematics_Interest_for_Students_with_Different_Achievements","282523757_The_Role_of_Cultural_Contexts_in_Explaining_Cross-National_Gender_Gaps_in_STEM_Expectations","276527386_STEM_Education","254997224_Gender_and_the_Career_Choice_Process_The_Role_of_Biased_Self-Assessments","234696881_New_Perspectives_on_the_Gender_Stereotyping_of_Mathematics","232461547_Why_Aren't_More_Women_in_Science_Top_Researchers_Debate_the_Evidence","21016828_Gender_Differences_in_Mathematics_Performance_A_Meta-Analysis","15765129_Sex_Differences_in_Mathematical_Ability_Fact_or_Artifact"]}