{"id":"327822613_Mathematical_Optimization_to_Explore_Tomorrow's_Sustainable_Diets_A_Narrative_Review","abstract":"A sustainable diet is, by definition, nutritionally adequate, economically affordable, culturally acceptable, and environmentally respectful. Designing such a diet has to integrate different dimensions of diet sustainability that may not be compatible with each other. Among multicriteria assessment methods, diet optimization is a whole-diet approach that simultaneously combines several metrics for dimensions of diet sustainability. This narrative review based on 67 published studies shows how mathematical diet optimization can help with understanding the relations between the different dimensions of diet sustainability and how it can be properly used to identify sustainable diets. Diet optimization aims to find the optimal combination of foods for a population, a subpopulation, or an individual that fulfills a set of constraints while minimizing or maximizing an objective function. In the studies reviewed, diet optimization was used to examine the links between dimensions of diet sustainability, identify the minimum cost or environmental impact of a nutritionally adequate diet, or identify food combinations able to combine ≥2 sustainability dimensions. If some constraints prove difficult to fulfill, this signals an incompatibility between nutrient recommendations, over-monotonous food-consumption patterns, an inadequate supply of nutrient-rich foods, or an incompatibility with other dimensions. If diet optimization proves successful, it can serve to design nutritionally adequate, culturally acceptable, economically affordable, and environmentally friendly diets. Diet optimization results can help define dietary recommendations, tackle food security issues, and promote sustainable dietary patterns. This review emphasizes the importance of carefully choosing the model parameters (variables, objective function, constraints) and input data and the need for appropriate expertise to correctly interpret and communicate the results. Future research should make improvements in the choice of metrics used to assess each aspect of a sustainable diet, especially the cultural dimension, to improve the practicability of the results.","authors":["Rozenn Gazan","Chloé Brouzes","Florent Vieux","Matthieu Maillot"],"meta":["September 2018Advances in Nutrition 9(5):602-616","DOI:10.1093/advances/nmy049"],"references":["323192626_Integrating_nutrient_bioavailability_and_co-production_links_when_identifying_sustainable_diets_How_low_should_we_reduce_meat_consumption","322946406_Dietary_changes_needed_to_improve_diet_sustainability_are_they_similar_across_Europe","317849598_Adaptation_of_New_Colombian_Food-based_Complementary_Feeding_Recommendations_Using_Linear_Programming","317406010_Modeled_dietary_impact_of_industry-wide_food_and_beverage_reformulations_in_the_United_States_and_France","315875976_Dietary_changes_needed_to_reach_nutritional_adequacy_without_increasing_diet_cost_according_to_income_An_analysis_among_French_adults","315056723_Cost_of_the_Diet_A_method_and_software_to_calculate_the_lowest_cost_of_meeting_recommended_intakes_of_energy_and_nutrients_from_local_foods","313864012_Individual_Diet_Modeling_Shows_How_to_Balance_the_Diet_of_French_Adults_with_or_without_Excessive_Free_Sugar_Intakes","319913212_Combining_food-based_dietary_recommendations_using_Optifood_with_zinc-fortified_water_potentially_improves_nutrient_adequacy_among_4-_to_6-year-old_children_in_Kisumu_West_district_Kenya","317097376_Are_more_environmentally_sustainable_diets_with_less_meat_and_dairy_nutritionally_adequate","315473001_Decreasing_the_overall_environmental_impact_of_the_Dutch_diet_how_to_find_healthy_and_sustainable_diets_with_limited_changes"]}