{"id":"327838071_Using_recursive_feature_elimination_in_random_forest_to_account_for_correlated_variables_in_high_dimensional_data","abstract":"Background: \nRandom forest (RF) is a machine-learning method that generally works well with high-dimensional problems and allows for nonlinear relationships between predictors; however, the presence of correlated predictors has been shown to impact its ability to identify strong predictors. The Random Forest-Recursive Feature Elimination algorithm (RF-RFE) mitigates this problem in smaller data sets, but this approach has not been tested in high-dimensional omics data sets.\n\nResults: \nWe integrated 202,919 genotypes and 153,422 methylation sites in 680 individuals, and compared the abilities of RF and RF-RFE to detect simulated causal associations, which included simulated genotype-methylation interactions, between these variables and triglyceride levels. Results show that RF was able to identify strong causal variables with a few highly correlated variables, but it did not detect other causal variables.\n\nConclusions: \nAlthough RF-RFE decreased the importance of correlated variables, in the presence of many correlated variables, it also decreased the importance of causal variables, making both hard to detect. These findings suggest that RF-RFE may not scale to high-dimensional data.","authors":["Burcu F Darst","Kristen Chossek Malecki","Corinne D Engelman"],"meta":["September 2018BMC Genetics 19(Suppl 1)","DOI:10.1186/s12863-018-0633-8"],"references":["295253651_Integration_of_omics_More_than_the_sum_of_its_parts","286462909_Do_little_interactions_get_lost_in_dark_random_forests","281144987_ranger_A_Fast_Implementation_of_Random_Forests_for_High_Dimensional_Data_in_C_and_R","258083104_Correlation_and_variable_importance_in_random_forests","229089353_SNP_interaction_detection_with_Random_Forests_in_high-dimensional_genetic_data","228451484_Classification_and_Regression_by_RandomForest","288906520_Random_forests","270910379_Methods_of_integrating_data_to_uncover_genotype-phenotype_interactions","263056931_Epigenome-Wide_Association_Study_of_Fasting_Blood_Lipids_in_the_Genetics_of_Lipid-Lowering_Drugs_and_Diet_Network_Study","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink"]}