{"id":"327843962_Goal-Oriented_Creation_of_Individual_Knowledge_Model_and_Information_Technology","abstract":"The paper focuses on a fundamental problem: developing a model that describes the iterative process of goal-oriented creation of new individual knowledge, and information technology that provides this process. It is assumed that a linguist creates a personal knowledge system as a cross-language typology. We proceed from the notion of a goal-oriented knowledge system. A linguist creates the typology to fill a knowledge gap in contrastive grammar. This gap can be identified through observation of the subject area. Our study arose from a need to fill the gap in the cross-language knowledge system for machine translation. Here, we suggest a model and information technology that facilitates goal-oriented creation of a new personal knowledge system by linguists as a typology. The proposed model consists of two submodels, one representing the formation of annotations of the studied language units, which is performed by a group of linguists, and the other representing the creation of a cross-language typology by an expert-linguist on the basis of generated annotations. In the process of creating a new typology, a linguist analyses bilingual texts. With the help of information technology, a linguist matches up emerging parts of knowledge with the analysed aligned sentences of these texts. The ability to establish this correspondence is the principal distinction of the proposed technology. To show the feasibility of the technology, our team has designed the prototype of the computer system supporting goal-oriented creation of new individual knowledge. This prototype contains German-Russian translations of books totaling about 2.5 million words, analysed by a linguist. The subject of the analysis is translation models of German modal verbs into Russian, which are discovered by a linguist from bilingual texts in an automated mode. There is a wide range of Russian lexical units and syntactic constructions in translations of German modal verbs. At present, there is no systematic description of them. The main aim of the translations' analysis is to create the typology, which will fill the gap in the German-Russian contrastive grammar.","authors":["Igor M. Zatsman"],"meta":["September 2018","Conference: 19th European Conference on Knowledge ManagementAt: Padua, Italy"],"references":["317715397_The_construction_of_classification_schemes_Methods_and_technologies_of_expert_formation","308078847_WEB_Knowledge_Base_for_Asynchronous_Brainstorming","281275186_Outlining_Goals_for_Discovering_new_Knowledge_and_Computerised_Tracing_of_Emerging_Meanings","273767568_Factors_influencing_the_implicitation_of_discourse_relations_across_languages","273583845_Reflections_on_the_Penn_Discourse_TreeBank_Comparable_Corpora_and_Complementary_Annotation","220746875_The_Penn_Discourse_TreeBank_20","312607081_Building_a_large_annotated_corpus_of_english_The_penn_treebank","251880197_The_Knowledge_Creating_Company","251320847_Basic_Dimensions_of_Creative_Space","238167566_A_Study_on_Automated_Relation_Labelling_in_Ontology_Learning"]}