{"id":"327817592_Collaboration_and_implementation_of_self_organizing_maps_SOM_partitioning_algorithm_in_HOPACH_clustering_method","abstract":"Since the discovery of DNA structure in the form of the double helix, there is a development of the complex interaction required, DNA clustering into clusters which have the same features or functions. Two clustering methods can be combined by doing the partitioning and hierarchical stage alternately known as HOPACH clustering. The partitioning stage can be done by using SOM Algorithm, PAM, and K-Means. SOM algorithm because it uses unsupervised learning method and efficient to be used for extensive data. The partitioning process is continued by ordering process and then performed collapsing with an agglomerative process so that the clustering result obtained will be more accurate. The determination of the main cluster done by calculating the homogeneous value of the clustering result uses MSS (Mean Split Silhouette). The determination criteria of the main cluster are choosing the smallest MSS value. 136 sequences of DNA EVD (Ebola Virus Disease) are obtained from NCBI GenBank by extraction of DNA sequence, normalization, and then calculating the genetic distance with Euclidean Distance. The extraction of DNA sequence, normalization, and the implementation of SOM partitioning algorithm in HOPACH clustering method use open source program R. On the result of implementation SOM partitioning algorithm in HOPACH clustering method retrieved 9 clusters with MSS value of 0.50280. The cluster obtained can be identified according to species and the first year of becoming an epidemic.","authors":["Titin Siswantining","Septian Wulandari","Alhadi Bustamam"],"meta":["September 2018AIP Conference Proceedings 2014(1):020134","DOI:10.1063/1.5054538","Conference: Proceedings of the 17th International Conference on Ion Sources"],"references":["318342121_Protein_sequences_clustering_of_herpes_virus_by_using_Tribe_Markov_clustering_Tribe-MCL","318342094_Implementation_of_hierarchical_clustering_using_k-mer_sparse_matrix_to_analyze_MERS-CoV_genetic_relationship","315846404_Implementation_of_spectral_clustering_with_partitioning_around_medoids_PAM_algorithm_on_microarray_data_of_carcinoma","304415047_Application_of_hierarchical_clustering_ordered_partitioning_and_collapsing_hybrid_in_Ebola_Virus_phylogenetic_analysis","273764838_Enhanced_Self-Organizing_Map_Neural_Network_for_DNA_Sequence_Classification","271889215_Anomaly_detection_using_a_self-organizing_map_and_particle_swarm_optimization","263736737_KMC_2_Fast_and_resource-frugal_k-mer_counting","255722390_Estimation_of_genomic_characteristics_by_analyzing_k-mer_frequency_in_de_novo_genome_projects","290935584_Discovering_Knowledge_in_Data_An_Introduction_to_Data_Mining_Second_Edition","242086094_Cluster_Analysis_of_Genomic_Data_with_Applications_in_R"]}