{"id":"327839360_Notating_disfluencies_and_temporal_deviations_in_music_and_arrhythmia","abstract":"Expressive music performance and cardiac arrhythmia can be viewed as deformations of, or deviations from, an underlying pulse stream. I propose that the results of these pulse displacements can be treated as actual rhythms and represented accurately via a literal application of common music notation, which encodes proportional relations among duration categories, and figural and metric groupings. I apply the theory to recorded music containing extreme timing deviations and to electrocardiographic (ECG) recordings of cardiac arrhythmias. The rhythm transcriptions are based on rigorous computer-assisted quantitative measurements of onset timings and durations. The root-mean-square error ranges for the rhythm transcriptions were (19.1, 87.4) ms for the music samples and (24.8, 53.0) ms for the arrhythmia examples. For the performed music, the representation makes concrete the gap between the score and performance. For the arrhythmia ECGs, the transcriptions show rhythmic patterns evolving through time, progressions which are obscured by predominant individual beat morphology- and frequency-based representations. To make tangible the similarities between cardiac and music rhythms, I match the heart rhythms to music with similar rhythms to form assemblage pieces. The use of music notation leads to representations that enable formal comparisons and automated as well as human-readable analysis of the time structures of performed music and of arrhythmia ECG sequences beyond what is currently possible.","authors":["Elaine Chew"],"meta":["September 2018Music & Science 1(4):205920431879515","DOI:10.1177/2059204318795159"],"references":["319184971_Musical_Speech_A_New_Methodology_for_Transcribing_Speech_Prosody","319054140_MorpheuS_Generating_Structured_Music_with_Constrained_Patterns_and_Tension","318030342_A_Supervised_Approach_for_Rhythm_Transcription_Based_on_Tree_SeriesEnumeration","346452694_Early_Recordings_and_Musical_Style_Changing_Tastes_in_Instrumental_Performance_1900-1950","344510107_Beyond_the_Score_Music_as_Performance","341299444_A_Generative_Theory_of_Tonal_Music","322808891_Decorum_of_the_Minuet_Delirium_of_the_Waltz_A_Study_of_Dance-Music_Relations_in_34_Time","320360582_The_Mechanics_of_Tipping_Points_A_Case_of_Extreme_Elasticity_in_Expressive_Timing","313473401_LightWAVE_Waveform_and_Annotation_Viewing_and_Editing_in_a_Web_Browser","313096113_Rhythm_Transcription_of_Polyphonic_Piano_Music_Based_on_Merged-Output_HMM_for_Multiple_Voices"]}