{"id":"327810312_Higher_Education_Computer_Science_A_Manual_of_Practical_Approaches_A_Manual_of_Practical_Approaches","abstract":"There is currently a great emphasis on teaching quality in Higher Education. In the UK, the Teaching Excellence Framework and the National Student Survey have contributed significantly to this focus. Additional support for staff to develop teaching skills has also come from the Higher Education Academy, whose fellowship scheme encourages HE staff to focus on their practice in the classroom.\nThe growth in the number of students attending university has resulted in a much wider range of learning styles amongst them. Many students do not fit the idealised average of being adept at learning from primarily text-based media. Two further trends are also driving change and innovation in academic staff teaching. The first is the availability of online teaching materials such as MOOCs. The second is the emphasis now given to student postgraduate employability, represented by certain aspects of the Teaching Excellence Framework that require students not only to know information, but also to be able to articulate that knowledge and to demonstrate their skills.\nWith a desire to enable our students to achieve their highest potential, many staff undertake initiatives to facilitate learning that accommodate a wide range of learning styles. This book focuses on approaches to teaching and learning within the discipline of Computer Science. The book consists of a selection of chapters that describe a particular teaching activity or topic within Computing in HE, presented in such a way that other practitioners can adopt and adapt them as a way of helping them to develop their own teaching. It provides a number of practical cases of putting theory into practice when teaching Computer Science to both undergraduate and postgraduate students in Higher Education institutions.\nA chapter on the importance of developing soft skills and a professional online presence is also included as an essential part of preparing the students for their future employment.","authors":["Jenny Carter","Michael O'Grady","Clive Rosen"],"meta":["January 2018","DOI:10.1007/978-3-319-98590-9","ISBN: 978-3-319-98589-3"],"references":[]}