{"id":"327985602_An_Ensemble_Approach_to_Big_Data_Security_Cyber_Security","abstract":"In the past, information safety was centered on event correlation designed for observing and spotting previously identified attacks. Due to the dynamic nature of multidimensional cyber-attacks, these models are no more acceptable. Specifically, these attacks use different strategies and procedures to find their way into and out of an organization. Traditional methods have reached their limit and thus new approaches are needed to find a solution for arising issues and challenges for big data security. To understand the current problem, we critically reviewed the literature related to big data security and the solutions proposed by the scientific community. In this paper, an ensemble approach for big data cybersecurity is proposed. To evaluate our approach, the given benchmark data is fed to three different classifiers namely to a k-nearest neighbor (KNN), support vector machine (SVM), multilayer perceptron (MLP) and the output of the single classifiers were compared to ensemble approach of the three classifiers. The reported results show that the ensemble approach for big data cybersecurity performs better than the single classifiers. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Manzoor Hashmani","Muslim Jameel Syed","Aidarus M.","Maryam Zaffar"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(9)","DOI:10.14569/IJACSA.2018.090910"],"references":["281558896_Use_of_Machine_Learning_in_Big_Data_Analytics_for_Insider_Threat_Detection","210341989_Distance_Metric_Learning_for_Large_Margin_Nearest_Neighbor_Classification","319770816_Combining_Pattern_Classifiers_Methods_and_Algorithms","316080320_Cyber_Physical_Systems_Security_Analysis_Challenges_and_Solutions","283173424_Big_data_-_The_future_of_cyber-security_or_its_latest_threat","278648268_Malicious_Web_Page_Detection_A_Machine_Learning_Approach","221345258_Identifying_suspicious_URLs_An_application_of_large-scale_online_learning"]}