{"id":"327909584_Multimodal_Plant_Recognition_through_hybrid_feature_fusion_technique_using_imaging_and_non-imaging_hyper-spectral_data","abstract":"Automatic classification of the plants is growing area of association with computer science and Botany, it has attracted many researchers to subsidize plant classification using image processing and machine learning techniques. Plants can be classified using number of traits such as leaf color, flowers, leaves, roots, leaf shape, leaf size etc. highly depends upon feature selection methods. However extraction of features from selected trait is most significant state in classification. State-of-the-art classification can be achieved by using leaf characteristics such as leaf venation patterns, leaf spectral signatures, leaf color, leaf shape, etc. This paper describes multimodal plant classification system using leaf venation patterns and its spectral signatures as a significant features. This paper shows that the feature fusion can be used to achieve efficient plant identification. The accuracy of identification for leaf spectral data, leaf venation features and HOG features is validated, it signifies that feature fusion technique performs better than that of non-imaging spectral signatures features only, with recognition result of 98.03% GAR and 93.51% GAR, respectively.","authors":["Pradip Salve","Pravin Yannawar","M. M. Sardesai"],"meta":["September 2018Journal of King Saud University - Computer and Information Sciences 34(1)","DOI:10.1016/j.jksuci.2018.09.018"],"references":["320435537_Multi-Algorithm_of_Palmprint_Recognition_System_Based_on_Fusion_of_Local_Binary_Pattern_and_Two-Dimensional_Locality_Preserving_Projection","312213350_Plant_Classification_from_Leaf_Textures","301913147_Identification_of_plant_species_using_non-imaging_hyperspectral_data","290003529_Automatic_Plant_Identification_Is_Shape_the_Key_Feature","265516000_Reading_the_Leaves_A_Comparison_of_Leaf_Rank_and_Automated_Areole_Measurement_for_Quantifying_Aspects_of_Leaf_Venation","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","281116309_Automatic_Plant_Leaf_Classification_on_Mobile_Field_Guide","276241047_Plant_Species_Identification_Based_on_Independent_Component_Analysis_for_Hyperspectral_Data","262278002_Automatic_classification_of_legumes_using_leaf_vein_image_features","222902977_Utilizing_venation_features_for_efficient_leaf_image_retrieval"]}