{"id":"327977266_Joint_Base_Station_Selection_and_Adaptive_Slicing_in_Virtualized_Wireless_Networks_A_Stochastic_Optimization_Framework","abstract":"Wireless network virtualization is a promising avenue of research for next-generation 5G cellular networks. Virtu-alization focuses on the concept of active resource sharing and the building of a network designed for specific demands, decreasing operational expenditures, and improving demand satisfaction of cellular networks. This work investigates the problem of selecting base stations (BSs) to construct a virtual network that meets the the specific demands of a service provider, and adaptive slicing of the resources between the service provider's demand points. A two-stage stochastic optimization framework is introduced to model the problem of joint BS selection and adaptive slicing. Two methods were presented for determining an approximation for the two-stage stochastic optimization model. The first method uses a sampling approach applied to the deterministic equivalent program of the stochastic model. The second method uses a genetic algorithm for BS selection and adaptively slicing via a single-stage linear optimization problem. For testing, a number of scenarios were generated using a log-normal model designed to emulate demand from real world cellular networks. Simulations indicate that the first approach can provide a reasonably tight solution, but is constrained as the time expense grows exponentially with the number of parameters. The second approach provides a vast improvement in run time with the introduction of notable error.","authors":["Kory Teague","Mohammad J. Abdel‐Rahman","Allen B. Mackenzie"],"meta":["September 2018","DOI:10.1109/ICCNC.2019.8685518","Conference: 2019 International Conference on Computing, Networking and Communications (ICNC)","Project: Virtualization and Programmability in Mobile Wireless Networks: Architecture and Resource Management"],"references":["316853247_Virtualization_and_Programmability_in_Mobile_Wireless_Networks_Architecture_and_Resource_Management","294089889_On_the_Orchestration_of_Robust_Virtual_LTE-U_Networks_from_Hybrid_HalfFull-duplex_Wi-Fi_APs","286084333_Stochastic_resource_allocation_in_opportunistic_LTE-A_networks_with_heterogeneous_self-interference_cancellation_capabilities","286084088_Dimensioning_virtualized_wireless_access_networks_from_a_common_pool_of_resources","274312142_Stochastic_Guard-Band-Aware_Channel_Assignment_With_Bonding_and_Aggregation_for_DSA_Networks","299375332_Joint_Chance-Constrained_Predictive_Resource_Allocation_for_Energy-Efficient_Video_Streaming","261505408_Spatial_modeling_of_Scalable_Spatially-correlated_Log-normal_distributed_traffic_inhomogeneity_and_energy-efficient_network_planning","260657028_Chance-Constrained_Optimization_of_OFDMA_Cognitive_Radio_Uplinks","260657004_Mobile_Network_Resource_Sharing_Options_Performance_Comparisons","260523013_Spectrum_Without_Bounds_Networks_Without_Borders"]}