{"id":"327985604_Self-organized_Population_Segmentation_for_Geosocial_Network_Neighborhood","abstract":"Geosocial network neighborhood application allows user to share information and communicate with other people within a virtual neighborhood or community. A large and crowded neighbourhood will degrade social quality within the community. Therefore, optimal population segmentation is an essential part in a geosocial network neighborhood, to specify access rights and privileges to resources, and increase social connectivity. In this paper, we propose an extension of the density-based clustering method to allow self-organized segmentation for neighbourhood boundaries in a geosocial network. The objective of this paper is two-fold: First, to improve the distance calculation in population segmentation in a geosocial network neighbourhood. Second, to implement self-organized population segmentation algorithms using threshold value and Dunbar number. The effectiveness of the proposed algorithms is evaluated via experimental scenarios using GPS data. The proposed algorithms show improvement in segmenting large group size of cluster into smaller group size of cluster to maintain the stability of social relationship in the neighbourhood. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Low Shen Loong","Syarulnaziah Anawar","Zakiah Ayop","Mohd Rizuan"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(9)","DOI:10.14569/IJACSA.2018.090931"],"references":["234164607_Neighboring_in_Netville_How_the_Internet_Supports_Community_and_Social_Capital_in_a_Wired_Suburb","227716876_Community_Detection_Using_Spectral_Clustering_on_Sparse_Geosocial_Data","334062792_How_Many_Friends_Does_One_Person_Need_Dunbar's_Number_and_Other_Evolutionary_Quirks","321788649_Density-Based_Place_Clustering_Using_Geo-Social_Network_Data","307094969_The_role_of_spatial_and_temporal_structure_for_residential_rent_predictions","280691995_The_Social_Brain_Hypothesis","240276802_Are_Dyads_Really_Groups","234172664_Virtues_of_the_Haversine","220633272_Clustering_for_Mining_in_Large_Spatial_Databases","220585707_Approaches_for_Scaling_DBSCAN_Algorithm_to_Large_Spatial_Databases","49617100_A_Novel_Density_based_improved_k-means_Clustering_Algorithm_-_Dbkmeans"]}