{"id":"327981335_In-service_Teacher_Training_Problems_of_the_Teachers_as_Learners","abstract":"Teachers need to update their knowledge and skills on curricula, psychology, and pedagogy of the learners and new research on teaching and learning; hence, they need appropriate in-service training, as well. However, the professional development practices in which they participate are mostly irrelevant to what they need and stay just in theory. Current researches criticized the inadequacy and inappropriateness of the traditional methods of teachers' professional development. In this research, the views and the suggestions of the novice teachers were investigated on in-service training, which was arranged as a part of the induction program. This research is a descriptive study and the participants consist of 494 teachers who participated in teacher induction program. A questionnaire form was used including open-ended questions. The results showed that in-service training did not make any contribution to some teachers and their personal development. The negative views on the trainers and the setting where the in-service training was conducted are other significant points for the evaluation. Therefore, it can be suggested that the planning process should be carefully carried out in order for in-service training to be effective and sustainable and the andragogy principles should be taken into account in organizing the teaching and learning process.","authors":["Zeynep Ayvaz Tuncel","Fatma Çobanoğlu"],"meta":["October 2018International Journal of Instruction 11(4):159-174","DOI:10.12973/iji.2018.11411a"],"references":["317307250_Evaluating_of_In-service_Training_Activities_for_Teachers_in_Turkey_A_Critical_Analysis","316875043_Comparison_of_Online_and_Traditional_Face-to-Face_In-Service_Training_Practices_An_Experimental_Study_Cevrimici_ve_Geleneksel_Yuz_Yuze_Hizmet_Ici_Egitim_Uygulamalarinin_Karsilastirilmasi_Deneysel_Bir_","308903391_Training_Teachers_on_the_Job_What_Works_and_How_to_Measure_it","300950002_A_General_Investigation_of_the_In-Service_Training_of_English_Language_Teachers_at_Elementary_Schools_in_Turkey","293097482_Level_of_Professionalisme_among_Islamic_Education_Trainees_in_Practical_Teaching","325680681_In-service_training_of_teachers_in_turkey_at_the_beginning_of_the_2000s","321718329_Challenges_in_developing_in-service_teacher_training_Lessons_learnt_from_two_projects_for_teachers_of_Swedish_in_Finland","320643168_IN-SERVICE_TEACHER_TRAINING_COURSES_ORGANIZATIONAL_COMPONENTS","285449185_Professional_development_for_the_teacher_of_the_teacher_and_by_the_teacher","282385699_Reform_of_and_as_Professional_Development"]}