{"id":"327991477_Development_of_a_classification_scheme_for_evaluating_water_quality_in_marine_environment_receiving_treated_municipal_effluent_by_an_integrated_biomarker_approach_in_Meretrix_meretrix","abstract":"To evaluate the pollution level of marine environment received treated municipal effluent (TME), the water quality classification index (WQCI) capable of integrating biomarker results into a four-level pollution for effluent assessment was proposed and applied. The WQCI calculation was that of the integrated biomarker responses vesion 2 (IBRv2) index based on the expert system classification scale. In this research, mussels of Meretrix meretrix were treated with different effluent volume ratios (EVRs, 0–40%, v/v) for 12 days, six biomarkers of oxidative stress, metal exposure and neurotoxicity in both gills and digestive glands as well as the other two biomarkers of general health and genotoxicity in hemocytes were measured. Then based on the correlation analysis between the response of biomarkers and EVRs, the lysosomal membrane stability (LMS) and micronucleus frequency (MF) in hemocytes, glutathione (GSH) and acetylcholinesterase (AChE) in gills were chosen to calculate the IBRv2 and WQCI. The results showed that the control (EVR = 0%) was defined as Level I, EVR of 1–5% as Level II, EVR of 10–30% as Level III, and EVR of 40% as Level IV. In addition, two other sets of data of biomarkers in previous studies were used to test the applicability of the classification scheme established. The WQCI values and the evaluation results based on them were almost identical to those obtained by using the first set of data. This study is the first attempt to develop an index on water quality assessment of marine environment received discharged effluent from a biological perspective. The findings confirm that WQCI offers a potential measurement of water quality evaluation of marine environment and possible to be a water quality standard.","authors":["Ru Wan","Meng Fanping","Enping Su","Wenchao Fu"],"meta":["October 2018Ecological Indicators 93:697-703","DOI:10.1016/j.ecolind.2018.05.062"],"references":["6298905_Development_of_an_expert_system_for_the_integration_of_biomarker_responses_in_mussels_into_an_animal_health_index","279410313_Scale_of_classification_based_on_biochemical_markers_in_mussels_application_to_pollution_monitoring_in_European_coasts","10593287_Development_of_a_biomarker-based_index_for_assessing_the_ecotoxic_potential_of_aquatic_sites"]}