{"id":"327946522_On_the_sustainability_of_academic_software_the_case_of_static_analysis_tools","abstract":"From 1991 to 2015, 60 papers published in the ASE and SCAM conferences introduced static analysis prototypes or tools as academic software developed to support research. In this study, we characterize such academic software concerning sustainability. We performed an exploratory study regarding publicization (whether the software is available from an explicitly given URL in a software publication), evolution stage (initial development, evolution, servicing, phase-out or close-down), and recognition (the way others mention the software in their papers). Thereby, we discussed the results under the umbrella of software sustainability. Results for the academic software for static analysis published at ASE and SCAM, show that 40% are not publicly available from the URL informed by the authors; 78% are in an initial development stage, discontinued, or closed-down; 23% has no mentions in relevant digital libraries besides the original software publication, but 30% received contributions to their source code. We observed that a large number of academic static analysis software has inadequate publicization, short life cycles and low recognition. A systematic analysis of publicization, software life cycle, and recognition of academic software is viable, and its results may be useful to support rapid decision-making on adopting academic software for use or even as a target for contribution. The results may also promote a more inclusive view of scientific reputation with respect to the academic software produced by researchers.","authors":["Joenio Costa","Paulo Meirelles","Christina Von Flach Garcia Chavez"],"meta":["September 2018","DOI:10.1145/3266237.3266243","Conference: the XXXII Brazilian Symposium"],"references":["283889572_Understanding_the_scientific_software_ecosystem_and_its_impact_Current_and_future_measures","261768365_Safety_Security_Now_Sustainability_The_Nonfunctional_Requirement_for_the_21st_Century","260520436_The_Software_Sustainability_Institute_Changing_Research_Software_Attitudes_and_Practices","255949743_Sustainability_in_Software_Engineering_A_Systematic_Literature_Review","255949688_A_Generic_Model_for_Sustainability_with_Process-_and_Product-specific_Instances","220879217_Scientific_Software_Production_Incentives_and_Collaboration","317278677_Engineering_Academic_Software_Dagstuhl_Perspectives_Workshop_16252","309282726_Sustainability_Human_Social_Economic_and_Environmental","276364280_Software_in_the_scientific_literature_Problems_with_seeing_finding_and_using_software_mentioned_in_the_biology_literature","265130918_Better_Software_Better_Research"]}