{"id":"327916726_Le_paradigme_du_Cloud_Computing_au-dela_de_nouvelles_solutions_informatiques_un_enjeu_de_gouvernance_IT_renouvelee","abstract":"The cloud computing paradigm: Beyond new solutions, the issue of renewing the governance of information technology\nCloud computing is a corporate fad, both in the firms rolling out this solution and in those adopting it. How to integrate cloud computing solutions in an organization? What are the sakes for information systems? Based on comparisons of the analyses in the academic and professional made by the various professional groups involved in cloud computing, this article also draws from an original corpus of interviews with 39 information system directors in big firms, French and international, which are typical of the market for this type of solution. This research has made three main findings about: the strategies of adoption as a function of the type of cloud computing; the strong pressure that, from the supply-side of the market and, too, from the demand-side of actors within the firm, weighs on the choices made; and the effects of this two-sided pressure and of the very important issues for the organization’s design that call for a specific governance of information systems. To be both efficient and effective, the move toward cloud computing entails strategic decisions that have to be coordinated and steered using this new form of governance – this is necessary to keep control over what has become the “cloud computing paradigm”.","authors":["Valérie Fautrero","Valérie Fernandez","Sabine Khalil"],"meta":["September 2018Annales des Mines - Gérer et comprendre 133(3):13-24","DOI:10.3917/geco1.133.0013"],"references":["304282804_Changing_organizational_models_of_IT_departments_as_a_result_of_cloud_computing_proposal_for_a_typology","303637616_Factors_influencing_the_adoption_of_cloud_computing_by_small_and_medium_enterprises_in_developing_economies","287502584_L'envol_vers_le_Cloud_un_phenomene_de_maturations_multiples","304282965_Modelling_cloud_computing_adoption_in_major_French_local_public_authorities","302452677_Risks_in_Enterprise_Cloud_Computing_The_Perspective_of_it_Experts","281298091_Cloud_Computing_A_Practical_Framework_for_Managing_Cloud_Computing_Risk-Part_II","279814824_Organizational_challenges_in_cloud_adoption_and_enablers_of_cloud_transition_program","278851076_Cloud_Computing_Risk_and_Audit_Issues","272911111_Cloud_Computing_Future_Generation_Computing_Systemsas_the_5th_Utility","263812289_On_governance_structures_for_the_cloud_computing_services_and_assessing_their_effectiveness"]}