{"id":"327936955_Ensino_de_cursos_tecnologicos_por_meio_de_estilos_de_aprendizagem_aplicados_a_estatistica","abstract":"O presente trabalho almeja responder à questão acerca de qual é a influência do conhecimento de estatística na aprendizagem sobre Cargos e Salários para alunos de um Curso Superior de Tecnologia em Gestão de Recursos Humanos em uma Instituição de Ensino privada da cidade de São Paulo? Com o intuito de responder a esta questão, foi estabelecido o seguinte objetivo geral: analisar conhecimentos básicos de estatística utilizados em sala de aula no estudo sobre pesquisa salarial e, de forma específica, entender os estilos de aprendizagem dos alunos, propondo ações alinhadas ao perfil de aprendizagem desses estudantes. No que se refere à metodologia, o presente artigo possui uma abordagem de cunho qualitativo, de ordem exploratório-descritiva, pois almeja-se obter definições, descrições, exposições e informações sobre uma circunstância, identificando as relações presentes entre os fatores que a compõem e os sujeitos envolvidos. Apesar da natureza qualitativa, foi utilizado também o questionário ILS – Index Of Learning Styles (Índice de Estilo de Aprendizagem), de Felder e Soloman (1991), para classificar os estilos de aprendizagem dos sujeitos envolvidos no trabalho e determinar os estilos de aprendizagem das duas turmas trabalhadas.","authors":["José Ferreira De Souza","Alex Paubel Junger","José Felipe Ferreira De Souza","Luiz Henrique Amaral"],"meta":["January 2018Research Society and Development 7(3):273130","DOI:10.17648/rsd-v7i3.161"],"references":["336795381_Estilos_de_aprendizagem_de_alunos_ingressantes_em_um_curso_de_pedagogia_de_uma_instituicao_publica_do_norte_do_parana_e_implicacoes_para_a_pratica_pedagogica","327933910_Grupos_colaborativos_um_olhar_reflexivo_para_o_desenvolvimento_profissional_de_professores_de_matematica","260769777_Social_transformation_starts_with_the_self_An_autobiographical_perspective_on_the_thinking_style_preferences_of_an_educator","238264445_The_Myers-Briggs_Type_Indicator_Manual","49661911_Learning-Style_Profiles_of_150_Veterinary_Medical_Students"]}