{"id":"327986579_Thinging_Machine_Applied_to_Information_Leakage","abstract":"This paper introduces a case study that involves data leakage in a bank applying the so-called Thinging Machine (TM) model. The aim is twofold: (1) Presenting a systematic conceptual framework for the leakage problem that provides a foundation for the description and design of a data leakage system. (2) The aim in (1) is developed in the context of experimentation with the TM as a new methodology in modeling. The TM model is based on slicing the domain of interest (a part of the world) to reveal data leakage. The bank case study concentrates on leakage during internal operations of the bank. The leakage spots are exposed through surveying data territory throughout the bank. All streams of information flow are identified, thus points of possible leakage can be traced with appropriate evidence. The modeling of flow may uncover possible hidden points of leakage and provide a base for a comprehensive information flow policy. We conclude that a TM based on the Heideggerian notion of thinging can serve as a foundation for early stages of software development and as an alternative approach to the dominant object-orientation paradigm. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Sabah Al-Fedaghi","Mahmoud Wael Behbehani"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(9)","DOI:10.14569/IJACSA.2018.090914","Project: Thinging Machine Applied to Information Leakage"],"references":["326655285_Thinging_for_Software_Engineers","323365345_Privacy_Things_Systematic_Approach_to_Privacy_and_Personal_Identifiable_Information","318152978_Enterprise_data_breach_causes_challenges_prevention_and_future_directions_Enterprise_data_breach","334236395_Control_of_Waste_Water_Treatment_as_a_Flow_Machine_A_Case_Study","330487507_A_Small_Company_as_a_Thinging_Machine","324376529_Reconceptualization_of_IT_services_in_Banking_Industry_Architecture_Network","322465993_Modeling_Banking_Processes","291387283_A_Survey_on_Data_Leakage_Prevention_Systems","286399344_Creative_thinging_The_feeling_of_and_for_clay","273350303_Privacy-Preserving_Detection_of_Sensitive_Data_Exposure"]}