{"id":"327985848_Location-aware_Event_Attendance_System_using_QR_Code_and_GPS_Technology","abstract":"Attendance process in a university's event is time consuming and tracking the attendance can be harder. In this paper, a smart event attendance system for a university using QR code and GPS technology is proposed with objective to speed up the process of taking students' attendance and tracking full attendance. The method of developing the system is based on two views; user view which is the mobile application used by the students, and admin view which is the web administration system used by the event organizer. From the evaluation, students' attendance can be traced from the GPS location combine with QR code. The results indicate that full attendance increases as the system validates attendance through users' identification, location and timestamp during user login and logout. The proposed system contributes to high satisfaction among the users that claim that the mobile application helps to speed up the event registration process. © 2018 (IJACSA) International Journal of Advanced Computer Science and Applications.","authors":["Zakiah Ayop","Chan Yee","Syarulnaziah Anawar","Hamid Erman"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(9)","DOI:10.14569/IJACSA.2018.090959"],"references":["325984021_Attendance_Checking_System_Using_Quick_Response_Code_For_Students_At_The_University_Of_Sulaimaniyah","323511629_Student_Attendance_Management_System","318779349_QR_Code_Based_Smart_Attendance_System","311461423_Student_attendance_system_in_classroom_using_face_recognition_technique","287533978_Development_of_the_online_student_attendance_monitoring_system_SAMS_based_on_QR-codes_and_mobile_devices","325450951_Taxonomy_of_Biometric-based_Authentication_Schemes_for_Mobile_Computing_Devices","319127283_Face_Recognition_-_A_Tool_for_Automated_Attendance_System","308841335_Student_Attendance_Management_System_with_Bluetooth_Low_Energy_Beacon_and_Android_Devices","286570573_Biometric_attendance","278729178_Barcode_based_Student_Attendance_System"]}