{"id":"327990060_An_ontology-oriented_knowledge_methodology_for_process_planning_in_additive_layer_manufacturing","abstract":"The goal of this research is the generation of a novel knowledge with process-oriented ontology and the informal model. With regard to the proposed ontology, it establishes an improvement to related ontologies because it involves the demands of fabrication engineering and, specifically, the layer-upon-layer manufacturing planning process with various AM systems. Generally, task of AM planning indicates to make repeated and essential decisions which are always on the basis of the engineers’ knowledge and experience in additive manufacturing. Hence, it is a suitable field towards the execution of a knowledge-based engineering system. To represent the knowledge at an upper tier, the IDEF0 diagrams is introduced for identifying the sequence of tasks contained in the AM planning. They are a vital resources for defining the sequence of tasks and the messages flow. Afterward, these messages are analyzed thoroughly by applying schematic graphs, and then they are categorized into knowledge segments. Eventually, each knowledge segment is further divided into knowledge entities. At the same time, the relationships among them are also defined.\nMeanwhile, knowledge modeling involved generating an ontology of design feature which is utilized as a general information model in both computer-aided design and process planning, expression of fabrication criteria that depict the basis and properties for picking fabrication parameters. In a first method, the ontology has been examined utilizing an essential activity in AM planning: the task related to the confirmation of parameters over component quality. In this task, decisions have to be made in the orientation, slicing and the other process parameters. In this research, the differences between geometric and dimensional tolerance fabrication is considered in the generated methodology. The knowledge needed to aid all decisions is expressed utilizing the proposed ontology.","authors":["Jeremy S. Liang"],"meta":["October 2018Robotics and Computer-Integrated Manufacturing 53:28-44","DOI:10.1016/j.rcim.2018.03.003"],"references":["328938814_Rapid_Prototyping_and_Engineering_Applications_A_Toolbox_for_Prototype_Development"]}