{"id":"327943450_Review_The_application_of_omics_to_rumen_microbiota_function","abstract":"Rumen microbiome profiling uses 16S rRNA (18S rRNA, internal transcribed spacer) gene sequencing, a method that usually sequences a small portion of a single gene and is often biased and varies between different laboratories. Functional information can be inferred from this data, but only for those that are closely related to known annotated species, and even then may not truly reflect the function performed within the environment being studied. Genome sequencing of isolates and metagenome-assembled genomes has now reached a stage where representation of the majority of rumen bacterial genera are covered, but this still only represents a portion of rumen microbial species. The creation of a microbial genome (bins) database with associated functional annotations will provide a consistent reference to allow mapping of RNA-Seq reads for functional gene analysis from within the rumen microbiome. The integration of multiple omic analytics is linking functional gene activity, metabolic pathways and rumen metabolites with the responsible microbiota, supporting our biological understanding of the rumen system. The application of these techniques has advanced our understanding of the major microbial populations and functional pathways that are used in relation to lower methane emissions, higher feed efficiencies and responses to different feeding regimes. Continued and more precise use of these tools will lead to a detailed and comprehensive understanding of compositional and functional capacity and design of techniques for the directed intervention and manipulation of the rumen microbiota towards a desired state.","authors":["S. E. Denman","Diego P Morgavi","C. S. McSweeney"],"meta":["September 2018animal 12(s2):1-13","DOI:10.1017/S175173111800229X"],"references":["332342028_Cultivation_and_sequencing_of_rumen_microbiome_members_from_the_Hungate1000_Collection","327256244_A_standardized_bacterial_taxonomy_based_on_genome_phylogeny_substantially_revises_the_tree_of_life","325820047_Effectiveness_of_Interventions_to_Modulate_the_Rumen_Microbiota_Composition_and_Function_in_Pre-ruminant_and_Ruminant_Lambs","325721601_Taxonomy_annotation_and_guide_tree_errors_in_16S_rRNA_databases","325364876_Changes_in_Rumen_Microbial_Profiles_and_Subcutaneous_Fat_Composition_When_Feeding_Extruded_Flaxseed_Mixed_With_or_Before_Hay","325360898_CowPI_A_Rumen_Microbiome_Focussed_Version_of_the_PICRUSt_Functional_Inference_Software","325119150_CowPI_A_rumen_microbiome_focussed_version_of_the_PICRUSt_functional_inference_software","324427124_Pasture_Feeding_Changes_the_Bovine_Rumen_and_Milk_Metabolome","323858656_Cultivation_and_sequencing_of_rumen_microbiome_members_from_the_Hungate1000_Collection","323455433_Assembly_of_913_microbial_genomes_from_metagenomic_sequencing_of_the_cow_rumen"]}