{"id":"327933644_Pengaruh_Algoritma_Stemming_Nazief-Adriani_Terhadap_Kinerja_Algoritma_Winnowing_Untuk_Mendeteksi_Plagiarisme_Bahasa_Indonesia","abstract":"Winnowing algorithm is one among many algorithms for detecting document similarity and plagiarism. Some studies show that Winnowing algorithm performs quite well. One form of plagiarism is paraphrase plagiarism. Paraphrase plagiarism can be done by changing sentence structure, changing vocabulary, and adding or changing affixes. Based on some of our previous experiments, detecting document resemblances can be enhanced by changing the words containing affixes to their basic words. In computer science, this technique is known as stemming - a technique to extract the basic word from an affixed word. Usually this technique is required in the filtering process to save storage media. For Indonesian, the Nazief-Adriani stemming algorithm is by far the most appropriate. This study examines how the effect of Nazief-Adriani stemming algorithm on Winnowing algorithm's performance against Indonesian texts. The results showed that the stemming process using Bloom-Filter on the Winnowing algorithm tends to decrease the similarity level achieved, but it accelerates processing time by approximately 30%. Keywords—Algoritma Nazief-Adriani, Algoritma Winnowing, Bloom-Filter, Plagiat, Plagiat Checker","authors":["Hargyo Nugroho"],"meta":["June 2017Jurnal ULTIMA Computing 9(1)","DOI:10.31937/sk.v9i1.572"],"references":["266160556_KAJIAN_MORFOLOGI_DERIVASIONAL_DAN_INFLEKSIONAL_DALAM_BAHASA_INDONESIA","261078881_Comparison_between_fingerprint_and_winnowing_algorithm_to_detect_plagiarism_fraud_on_Bahasa_Indonesia_documents","246992518_Old_and_new_challenges_in_automatic_plagiarism_detection","234095085_Copy_detection_in_urdu_language_documents_using_n-grams_model","221214940_Winnowing_Local_Algorithms_for_Document_Fingerprinting","343767294_Design_And_Implementation_of_Document_Similarity_Search_System_For_WEB-Based_Medical_Journal_Management","271015785_Pembentukan_kata_dalam_bahasa_Indonesia","224249125_Survey_of_Plagiarism_Detection_Methods","220422797_A_Second_Look_at_Bloom_Filters"]}