{"id":"327950819_Dynamic_Summarization_of_Videos_Based_on_Descriptors_in_Space-Time_Video_Volumes_and_Sparse_Autoencoder","abstract":"This work addresses the problem of generating meaningful summaries from unedited user videos. A framework based on spatiotemporal and high-level features is proposed here to detect the key-shots after segmenting the videos into shots based on motion magnitude. To encode the timevarying characteristics of a video, we explore the Local Phase Quantization feature descriptor from Three Orthogonal Planes (LPQ-TOP). Sparse Autoencoder (SAE), an instance of deep learning strategy, is used for the extraction of high-level features from LPQ-TOP descriptors to represent the shots carrying keycontents of videos efficiently. The Chebyshev distance between the feature vectors of the consecutive shots are calculated and thresholded using the mean value of the distance score as the threshold value. The optimal subset of shots with distance score greater than the threshold value is used to generate a high-quality video summary. The method is evaluated using SumMe dataset. The summaries thus generated are of better quality than those produced by the other state of the art techniques. The effectiveness of the method is further evaluated by comparing with the human-created summaries in the ground truth.","authors":["Jesna Mohan","Madhu S. Nair"],"meta":["September 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2872685"],"references":["323567996_Spectrum_Analysis-Based_Traffic_Video_Synopsis","322240612_Video_summarization_via_exploring_the_global_and_local_importance","319003279_Unsupervised_Video_Summarization_with_Adversarial_LSTM_Networks","320819132_Creating_Memorable_Video_Summaries_that_Satisfy_the_User's_Intention_for_Taking_the_Videos","318127372_Unsupervised_Video_Summaries_Using_Multiple_Features_and_Image_Quality","314824260_A_utility_framework_for_the_automatic_generation_of_audio-visual_skims","311610693_Highlight_Detection_with_Pairwise_Deep_Ranking_for_First-Person_Video_Summarization","311450796_Quasi_real-time_summarization_for_consumer_videos","308854408_Video_summarization_by_learning_submodular_mixtures_of_objectives","308189212_Video_Summarization_with_Long_Short-Term_Memory"]}