{"id":"327903090_Encapsulation_as_a_Key_Concern_in_Analysis_and_Design_for_Service_Systems_AMCIS_2016","abstract":"Concepts related to sociotechnical and totally automated services should play a role in systems analysis and design because every organization operates through internally directed service systems and because much the world GDP involves services for customers. This paper explains how the concept of encapsulation proves a crucial design variable for both sociotechnical and automated services. This paper defines the term service and explains how the degree of encapsulation is related to structures for delivering services, using outsourcing as an illustrative example. It shows how encapsulation-related design decisions appear in a service life cycle model. It presents a detailed operational metamodel that describes service systems and shows how aspects of the metamodel provide operational interpretations of ideas that are important in service system design. The implication is that the concept of encapsulation should be included in analysis and design methods and tools. Abstract Concepts related to sociotechnical and totally automated services should play a role in systems analysis and design because every organization operates through internally directed service systems and because much the world GDP involves services for customers. This paper explains how the concept of encapsulation proves a crucial design variable for both sociotechnical and automated services. This paper defines the term service and explains how the degree of encapsulation is related to structures for delivering services, using outsourcing as an illustrative example. It shows how encapsulation-related design decisions appear in a service life cycle model. It presents a detailed operational metamodel that describes service systems and shows how aspects of the metamodel provide operational interpretations of ideas that are important in service system design. The implication is that the concept of encapsulation should be included in analysis and design methods and tools.","authors":["Steven Alter"],"meta":["September 2018","Conference: AMCIS 2016"],"references":["323214685_Applying_IT-Related_Business_Process_Reengineering_In_an_Informatics_Course_for_Graduate_Nursing_Programs","321372384_ANSWERING_KEY_QUESTIONS_FOR_SERVICE_SCIENCE","285268227_New_State_of_Play_in_Information_Systems_Research_The_Push_to_the_Edges","281887447_Work_System_Theory_as_a_Platform_Response_to_a_Research_Perspective_Article_by_Niederman_and_March","272566616_Service-Dominant_Logic_Continuing_the_Evolution","262564046_Work_System_Theory_Overview_of_Core_Concepts_Extensions_and_Challenges_for_the_Future","262563911_Challenges_for_Service_Science_Challenges_for_Service_Science","238053042_Viewing_Systems_as_Services_A_Fresh_Approach_in_the_IS_Field","280532063_The_Ions_of_Theory_Construction","263104763_Toward_a_richer_diversity_of_genres_in_information_systems_research_New_categorization_and_guidelines"]}