{"id":"328029858_Review_Precision_nutrition_of_ruminants_Approaches_challenges_and_potential_gains","abstract":"A plethora of sensors and information technologies with applications to the precision nutrition of herbivores have been developed and continue to be developed. The nutritional processes start outside of the animal body with the available feed (quantity and quality) and continue inside it once the feed is consumed, degraded in the gastrointestinal tract and metabolised by organs and tissues. Finally, some nutrients are wasted via urination, defecation and gaseous emissions through breathing and belching whereas remaining nutrients ensure maintenance and production. Nowadays, several processes can be monitored in real-time using new technologies, but although these provide valuable data ‘as is’, further gains could be obtained using this information as inputs to nutrition simulation models to predict unmeasurable variables in real-time and to forecast outcomes of interest. Data provided by sensors can create synergies with simulation models and this approach has the potential to expand current applications. In addition, data provided by sensors could be used with advanced analytical techniques such as data fusion, optimisation techniques and machine learning to improve their value for applications in precision animal nutrition. The present paper reviews technologies that can monitor different nutritional processes relevant to animal production, profitability, environmental management and welfare. We discussed the model-data fusion approach in which data provided by sensor technologies can be used as input of nutrition simulation models in near-real time to produce more accurate, certain and timely predictions. We also discuss some examples that have taken this model-data fusion approach to complement the capabilities of both models and sensor data, and provided examples such as predicting feed intake and methane emissions. Challenges with automatising the nutritional management of individual animals include monitoring and predicting of the flow of nutrients including nutrient intake, quantity and composition of body growth and milk production, gestation, maintenance and physical activities at the individual animal level. We concluded that the livestock industries are already seeing benefits from the development of sensor and information technologies, and this benefit is expected to grow exponentially soon with the integration of nutrition simulation models and techniques for big data analysis. However, this approach may need re-evaluating or performing new empirical research in both fields of animal nutrition and simulation modelling to accommodate a new type of data provided by the sensor technologies.","authors":["L. A. González","Ilias Kyriazakis","Luis Tedeschi"],"meta":["October 2018animal 12(s2):1-16","DOI:10.1017/S1751731118002288"],"references":["323691635_On-barn_pig_weight_estimation_based_on_body_measurements_by_a_Kinect_v1_depth_camera","323338464_Automated_body_weight_prediction_of_dairy_cows_using_3-dimensional_vision","321675211_Automated_tracking_to_measure_behavioural_changes_in_pigs_for_health_and_welfare_monitoring","320646100_An_assessment_of_Walk-over-Weighing_to_estimate_short-term_individual_forage_intake_in_sheep","319452795_Use_of_dual-energy_x-ray_absorptiometry_in_non-ruminant_nutrition_research","323633024_Phenotypically_divergent_classification_of_preweaned_heifer_calves_for_feed_efficiency_indexes_and_their_correlations_with_heat_production_and_thermography","322122286_Technical_note_Validation_of_an_ear-tag_accelerometer_sensor_to_determine_rumination_eating_and_activity_behaviors_of_grazing_dairy_cattle","321800639_Method_comparison_and_validation_of_a_prototype_device_for_measurement_of_ionized_calcium_concentrations_cow-side_against_a_point-of-care_instrument_and_a_benchtop_blood-gas_analyzer_reference_method","321336554_The_agreement_between_two_next-generation_laser_methane_detectors_and_respiration_chamber_facilities_in_recording_methane_concentrations_in_the_spent_air_produced_by_dairy_cows","320757324_Invited_review_Breeding_and_ethical_perspectives_on_genetically_modified_and_genome_edited_cattle"]}