{"id":"328095001_Identificacion_de_factores_influyentes_en_el_exito_academico_de_estudiantes_de_primer_ano_en_la_universidad_Agostinho_Neto","abstract":"En el rendimiento académico dentro de la universidad influyen muchos factores, los que se manifiestan principalmente en el primer año de la carrera. Sin embargo, los factores influyentes y los resultados que se han presentado en estudios previos no son iguales en diferentes universidades. Este trabajo presenta una aproximación para identificar un grupo de factores o variables que puede incidir en que los estudiantes que ingresan en la carrera de Ciencias de la Computación en la universidad Agostinho Neto, de Angola, puedan tener éxito en dos materias de contenidos esenciales dentro de la carrera: Lógica de Programación y Programación Imperativa. Se analizan desde el punto de vista psicopedagógico y social, las razones que explican la selección de esas variables y se contrasta con un análisis correlacional para estimar la posible asociación entre cada variable independiente y la variable criterio. La información empleada corresponde a tres cursos (unos 800 alumnos). Los resultados de aplicar el estadístico Chi-cuadrado a tablas de contingencia sugieren un grupo de aspectos que más influyen en tener éxito en las asignaturas Lógica de Programación y Programación Imperativa.","authors":["Pedro António Kinsumba","José Alberto Vilalta Alonso","Rogelio Lau-Fernández"],"meta":["December 2017Revista Iberoamericana de Tecnología en Educación y Educación en Tecnología","Project: Modelos aplicados al estudio del aprovechamiento docente"],"references":["277870377_Correlacion_entre_el_examen_de_admision_y_el_rendimiento_en_el_primer_ano_de_la_carrera_Ensenanza_de_la_Matematica_en_la_UNA","41137670_El_rendimiento_academico_en_el_nivel_de_educacion_media_como_factor_asociado_al_rendimiento_academico_en_la_universidad","277761457_Modelos_predictivos_y_explicativos_del_rendimiento_academico_universitario_caso_de_una_institucion_privada_en_Mexico","262512084_Factores_asociados_al_rendimiento_academico_en_estudiantes_universitarios_desde_el_nivel_socioeconomico_Un_estudio_en_la_Universidad_de_Costa_Rica","261953087_Gender_Differences_in_Scholastic_Achievement_A_Meta-Analysis","260059736_Modelling_for_Prediction_vs_Modelling_for_Understanding_Commentary_on_Musso_et_al_2013"]}