{"id":"328016560_A_Theoretical_and_Numerical_Analysis_of_the_Worst-Case_Size_of_Reduced_Ordered_Binary_Decision_Diagrams","abstract":"Binary Decision Diagrams (BDDs) and in particular ROBDDs (Reduced Ordered BDDs) are a common data structure for manipulating Boolean expressions, integrated circuit design, type inferencers, model checkers, and many other applications. Although the ROBDD is a lightweight data structure to implement, the behavior, in terms of memory allocation, may not be obvious to the program architect. We explore experimentally, numerically, and theoretically the typical and worst-case ROBDD sizes in terms of number of nodes and residual compression ratios, as compared to unreduced BDDs. While our theoretical results are not surprising, as they are in keeping with previously known results, we believe our method contributes to the current body of research by our experimental and statistical treatment of ROBDD sizes. In addition, we provide an algorithm to calculate the worst-case size. Finally, we present an algorithm for constructing a worst-case ROBDD of a given number of variables. Our approach may be useful to projects deciding whether the ROBDD is the appropriate data structure to use, and in building worst-case examples to test their code.","authors":["Jim Edward Newton","Didier Verna"],"meta":["January 2018ACM Transactions on Computational Logic 20(1)","DOI:10.1145/3274279"],"references":["337275367_Programmatic_Manipulation_of_Common_Lisp_Type_Specifiers","324465419_Chain_Reduction_for_Binary_and_Zero-Suppressed_Decision_Diagrams","319374324_Gradual_typing_with_union_and_intersection_types","305258620_BDD-Based_Boolean_Functional_Synthesis","304179563_Chebyshev's_Inequality","296682197_Theoretical_insights_and_algorithmic_tools_for_decision_diagram-based_optimization","263869317_EXACT_COMPUTATION_OF_THE_BIFURCATION_POINT_B4_OF_THE_LOGISTIC_MAP_AND_THE_BAILEY-BROADHURST_CONJECTURES","259875158_A_New_Look_at_BDDs_for_Pseudo-Boolean_Constraints","280765005_Graph-based_algorithms_for_Boolean_function_manipulation","260585297_Average_and_worst_case_number_of_nodes_in_decision_diagrams_of_symmetric_multiple-valued_functions"]}