{"id":"328086523_Examining_the_role_of_the_AIS_research_literature_using_the_natural_experiment_of_the_2018_JIS_conference_on_cloud_computing","abstract":"This paper examines the nature and purpose of the AIS research literature, doing so in a focused setting that enables a more nuanced analysis than is possible when reviewing the field as a whole. Specifically, I examine the population of the AIS literature on cloud computing, a technology chosen because it was the subject of the recently held 2018 Journal of Information Systems annual conference. I treat the conference as a natural experiment because the choice of papers for that conference is the best indication of the current state of thinking about not just cloud computing in AIS, but of the kind of research considered desirable in the field. The published and conference papers are analyzed using the frameworks of Alles, Kogan and Vasarhelyi (2008) and O'Leary (2008) who provide a guide for how AIS researchers can write papers that give them a comparative advantage relative to other, competing researchers, and to do the right research at the right time in the right way. Based on this analysis, I conclude that the AIS cloud computing literature largely fails to establish a clear role for itself relative to either the field of accounting or of cloud computing. That is largely the result of the AIS community being unwilling to distinguish between cloud computing as an end in itself as a research subject and the cloud as a means towards an end as a medium of data exchange. Adopting a broad perspective on the domain of AIS research yields a larger set of research topics but increases the riskiness of producing research that fails to add value to the broader literature. This is a lesson that extends beyond cloud computing to the AIS research literature as a whole.","authors":["Michael G. Alles"],"meta":["October 2018International Journal of Accounting Information Systems 31","DOI:10.1016/j.accinf.2018.09.001"],"references":["316433253_Citizen_Relationship_Management_in_Local_Governments_The_Potential_of_311_for_Public_Service_Delivery"]}