{"id":"328033937_The_Value_Paradox_of_Problem_Structuring_Methods","abstract":"The use of problem structuring method (PSM) interventions leads to outcomes unique to the circumstances of the problem context. Given the singular nature of these outcomes, a consultant attempting to sell a PSM intervention will struggle to articulate value to clients in terms that are commercially meaningful prior to the intervention being enacted. Thus, in order to win a contract to deliver a PSM intervention, the consultant must first resolve this puzzle. We explore this question by (i) reviewing how the value of PSMs has been assessed previously, (ii) setting out a suitable theoretical position to explore the problem and (iii) presenting empirical data from a commercial organization to build our theoretical position. This starts with agreement with Checkland and Scholes that attempting to sell the (financial) value of a PSM intervention a priori is unlikely to ever succeed. Our theoretical development through analysis of empirical data leads to the recognition that the process of selling a PSM intervention is bound to the interposition of the processes of problematization and interessement and the issue of trust. The recognition of a distinction between these and the actual enactment of a PSM intervention leads us to conclude that the process of selling the consulting engagement is entirely associated with the temporal ordering between them. We thus avoid the bind of the original puzzle only by articulating a paradox. To resolve the paradox, we shift analytical focus to the pre‐contractual phase of the relationship between a consultant and client and discuss implications of this paradox for soft OR practice. © 2018 The authors. Systems Research and Behavioral Science published by International Federation for Systems Research and John Wiley & Sons Ltd","authors":["Patrick Tully","Leroy White","Mike Yearworth"],"meta":["October 2018Systems Research and Behavioral Science 36(3)","DOI:10.1002/sres.2557","Projects: MethodologyPractice"],"references":["322843113_Spontaneous_emergence_of_Community_OR_Self-initiating_self-organising_problem_structuring_mediated_by_social_media","308942823_Writing_practitioner_case_studies_to_help_behavioural_OR_researchers_ground_their_theories_application_of_the_mangle_perspective","350687104_Planning_Under_Pressure","326187398_The_logic_and_methods_of_OR_consulting_practice_towards_a_foundational_view","324629913_The_Six_Principles_for_Effective_OR-Their_Relevance_in_the_90s","324629912_The_Origins_and_Diffusion_of_Operational_Research_in_the_UK","313596747_Some_elements_of_a_sociology_of_translation_Domestication_of_the_scallops_and_the_fishermen_of_St_Brieuc_Bay","305173982_Or_as_technology_Some_issues_and_implications","304890188_Part_Special_Issue_Editorial_The_process_of_OR","287884882_Sociological_Perspectives_On_Management_Consulting"]}