{"id":"328021590_A_Pilot_Study_Investigating_the_Introduction_of_a_Computer-Science_Course_at_Second_Level_Focusing_on_Computational_Thinking","abstract":"Computational Thinking has been described by Jeanette Wing (2006) as a skill set everybody should be eager to learn and use in daily life. Based on a significant amount of recent research on Computational Thinking and how we can teach it, the PACT (Programming + Algorithms = Computational Thinking) team at the Department of Computer Science at Maynooth University has been working with teachers with a view to incorporating the subject into their classrooms. To that end, a year-long course is currently being designed to teach students about Computational Thinking and Computer Science. This paper presents a brief background and overview of the course along with the design and results from an initial pilot study conducted in one secondary school. The results of the study indicate that the course was generally well received although performance did not improve on a measure of problem solving and was significantly lower for students with no prior programming experience. The course will be taught in more schools in the upcoming school year using feedback obtained from the pilot study. It is hoped that the ideas and content presented here will encourage and equip fellow researchers and educators to introduce Computational Thinking more widely in their contexts.","authors":["James Lockwood","Aidan Mooney"],"meta":["January 2017","Project: Computer Science To Go"],"references":["296696274_The_Influence_of_Problem_Solving_Abilities_on_Students'_Performance_on_Different_Assessment_Tasks_in_Introductory_Programming","280737610_PreSS_A_Web-Based_Educational_System_to_Predict_Programming_Performance","266740981_Teaching_Computational_Thinking_by_Playing_Games_and_Building_Robots","262402225_Will_it_stick_exploring_the_sustainability_of_computational_thinking_education_through_game_design","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","308840675_GK-12_DISSECT_Incorporating_computational_thinking_with_K-12_science_without_computer_access","305082229_Teaching_High_School_Students_Computational_Thinking_with_Hands-on_Activities","283453083_Advancing_students'_computational_thinking_skills_through_educational_robotics_A_study_on_age_and_gender_relevant_differences","280112337_Can_computational_thinking_predict_academic_performance","265286561_Computational_Thinking_is_Pervasive"]}