{"id":"328015581_An_intelligent_fault_diagnosis_method_of_rotating_machinery_based_on_deep_neural_networks_and_time-frequency_analysis","abstract":"As the crucial part of the health management and condition monitoring of mechanical equipment, the fault diagnosis and pattern recognition using vibration signal are essential researching contents. The time-frequency representation method cannot identify the fault patterns from time-frequency representation effectively because of the complex work conditions of rotating machinery parts and the interference of strong background noise. Considering these disadvantages, a new reliable and effective method based on the time-frequency representation and deep convolutional neural networks is presented. In this method, the time-frequency features are calculated by the short time Fourier transform (STFT), and the pseudo-color map as the new identification objects. A novel feature learning method based on the sparse autoencode with linear decode is used to extract these time-frequency features, which is an unsupervised feature learning method with the goal of minimizing the loss function. The convoluting and pooling are applied to establish the hierarchical deep convolutional neural networks and filter the useful features layer by layer from the output of sparse autoencode. And a softmax classifier is used to obtain the faults classification. The experimental datasets from roller bearing and gearbox have been taken to verify the reliability and effectiveness of the proposed method for fault diagnosis and pattern recognition. The results show that the proposed method have excellent performance of the recognized objects.","authors":["Yu Xin","Shunming Li","Chun Cheng","Jinrui Wang"],"meta":["September 2018Journal of Vibroengineering 20(6):2321-2335","DOI:10.21595/jve.2018.19040"],"references":["291387753_An_Intelligent_Fault_Diagnosis_Method_Using_Unsupervised_Feature_Learning_Towards_Mechanical_Big_Data","312421043_Gearbox_fault_classification_using_S-transform_and_convolutional_neural_network","311945071_Convolutional_neural_networks_for_vibrational_spectroscopic_data_analysis","309693788_Learning_Pooling_for_Convolutional_Neural_Network","305393812_Hierarchical_adaptive_deep_convolution_neural_network_and_its_application_to_bearing_fault_diagnosis","304254724_Study_on_nature_of_crossover_phenomena_with_application_to_gearbox_fault_diagnosis","303681767_Understanding_Convolutional_Neural_Networks","303534215_Convolutional_Neural_Network_Based_Fault_Detection_for_Rotating_Machinery","302476608_Synchrosqueezing_Transform-based_methodology_for_broken_rotor_bars_detection_in_induction_motors","288060291_Deep_Learning_with_S-shaped_Rectified_Linear_Activation_Units"]}