{"id":"328018476_Neutrosophic_Duplet_Semi-Group_and_Cancellable_Neutrosophic_Triplet_Groups","abstract":"The notions of the neutrosophic triplet and neutrosophic duplet were introduced by Florentin Smarandache. From the existing research results, the neutrosophic triplets and neutrosophic duplets are completely different from the classical algebra structures. In this paper, we further study neutrosophic duplet sets, neutrosophic duplet semi-groups, and cancellable neutrosophic triplet groups. First, some new properties of neutrosophic duplet semi-groups are funded, and the following important result is proven: there is no finite neutrosophic duplet semi-group. Second, the new concepts of weak neutrosophic duplet, weak neutrosophic duplet set, and weak neutrosophic duplet semi-group are introduced, some examples are given by using the mathematical software MATLAB (MathWorks, Inc., Natick, MA, USA), and the characterizations of cancellable weak neutrosophic duplet semi-groups are established. Third, the cancellable neutrosophic triplet groups are investigated, and the following important result is proven: the concept of cancellable neutrosophic triplet group and group coincide. Finally, the neutrosophic triplets and weak neutrosophic duplets in BCI-algebras are discussed.","authors":["Xiaohong Zhang","Florentin Smarandache","Xingliang Liang"],"meta":["October 2018Symmetry 9(11)","DOI:10.3390/sym9110275","Projects: Neutrosophic Triplet GroupsNew Trends in Neutrosophic Theory and Applications"],"references":["353762609_NEUTROSOPHIC_SET_-_A_GENERALIZATION_OF_THE_INTUITIONISTIC_FUZZY_SET","333559049_Commutative_neutrosophic_triplet_group_and_neutro-homomorphism_basic_theorem","328019101_Neutrosophic_triplet_group","327729847_States_on_pseudo-BCI_algebras","320426229_Neutrosophic_Regular_Filters_and_Fuzzy_Regular_Filters_in_Pseudo-BCI_Algebras","320161105_Neutrosophic_Perspectives_Triplets_Duplets_Multisets_Hybrid_Operators_Modal_Logic_Hedge_Algebras_And_Applications_Second_extended_and_improved_edition","343313056_States_on_Pseudo-BCI_Algebras","332549551_Neutrosophic_subalgebras_of_BCKBCI-algebras_based_on_neutrosophic_points","322606897_Soft_set_theoretical_approach_to_pseudo-BCI_algebras","322170629_Rough_fuzzy_ideals_in_BCKBCI-algebras"]}