{"id":"328007541_Customising_with_3D_printing_The_role_of_intelligent_control","abstract":"The emergence of direct digital manufacturing creates new opportunities for the production of highly customised goods especially when it is combined with conventional manufacturing methods. Nevertheless, this combination creates a need for systems that can effectively manage and control the resulting distributed manufacturing process. In this paper, we explore three different configurations that can enable direct digital manufacturing for customisation, ranging from fully integrated to inter-organisational set up. Additionally, control requirements of such systems are developed and the suitability of intelligent control is explored. By ‘intelligent control’ we mean production control that is capable of assessing and interacting with the production environment and adapting production accordingly. We argue that the so called intelligent product paradigm provides a suitable mechanism for the development of such intelligent control systems. In this approach, the intelligent product directly co-ordinates with design agent, 3D printing agents and other conventional manufacturing system agents to schedule, assign and execute tasks independently. Via a case example of a realistic production system, we propose and implement such an intelligent control system and we analyse its feasibility in supporting 3D printing enabled customisation.","authors":["Vaggelis Giannikas","Rengarajan Srinivasan","Alan Thorne","Duncan Mcfarlane"],"meta":["December 2018Computers in Industry 103:38-46","DOI:10.1016/j.compind.2018.09.003"],"references":["308453885_Implementation_of_Rapid_Manufacturing_for_Mass_Customisation","303936852_Effects_of_combining_product-centric_control_and_direct_digital_manufacturing_The_case_of_preparing_customized_hose_assembly_kits","299749017_Makespaces_From_Redistributed_Manufacturing_to_a_Circular_Economy","290430234_The_direct_digital_manufacturing_revolution_definition_of_a_research_agenda","284625478_The_3D_Printing_Order_Variability_Supercenters_and_Supply_Chain_Reconfigurations","280254221_Defining_the_Research_Agenda_for_3D_Printing-Enabled_Re-distributed_Manufacturing","344598173_Approaches_to_mass_customization_configurations_and_empirical_validation","292403179_Rapid_Manufacturing_An_Industrial_Revolution_for_the_Digital_Age","277435006_Direct_Digital_Manufacturing_Definition_Evolution_and_Sustainability_Implications","268526299_Dynamic_self-organization_in_holonic_multi-agent_manufacturing_systems_The_ADACOR_evolution"]}