{"id":"328030775_Towards_an_Incremental_Recommendation_of_POIs_for_Mobile_Tourists_without_Profiles","abstract":"Mobile tourism or m-tourism can assist and help tourists anywhere and anytime face the overload of information that may appear in their smartphones. Indeed, these mobile users find difficulties in the choice of points of interest (POIs) that may interest them during their discovery of a new environment (a city, a university campus ...). In order to reduce the number of POIs to visit, the recommendation systems (RS) represent a good solution to guide each tourist towards personalized paths close to his instantaneous location during his visit. In this article, we focus on (1) the detection of the spatiotemporal context of the tourist to filter the POIs and (2) the use of the previous notations of the places. These two criteria make it possible to integrate the evolutionary context of the visit in order to predict incrementally the most relevant transitions to be borrowed by the tourists without profile. These predictions are calculated using collaborative filtering algorithms that require the collection of traces of tourists to better refine the recommendation of POIs. In our software prototype, we have adapted the SLOPE ONE algorithm to our context of discovering the city of Chlef to avoid problems like data scarcity, cold start and scalability. In order to validate the use of this prototype, we conducted experiments by tourists in order to calculate indicators to assess the relevance of the recommendations provided by our system.","authors":["Nassim Dennouni","Yvan Peter","Luigi Lancieri","Zohra Slama"],"meta":["October 2018International Journal of Intelligent Systems and Applications 10(10):42-52","DOI:10.5815/ijisa.2018.10.05","Project: ad hoc environment for the collection and capitalization of human interactions"],"references":["322297102_Recommendation_Techniques_in_Mobile_Learning_Context","318348312_A_Survey_on_the_Generation_of_Recommender_Systems","316069659_Towards_Semantics-Aware_Recommender_System_A_LOD-Based_Approach","307888872_Guide_Me_A_Research_Work_Area_Recommender_System","301417854_Personalized_Trip_Recommendation_with_POI_Availability_and_Uncertain_Traveling_Time","321749396_Recommender_System_in_Tourism_Using_Case_based_Reasoning_Approach","311489352_Weighted_slope_one_predictors_revisited","311488661_Verification_of_POI_and_Location_Pairs_via_Weakly_Labeled_Web_Data","301222357_Toward_the_next_generation_of_recommender_systems_A_survey_of_the_state-of-the-art_and_possible_extensions","280113639_Hybrid_Web_Recommender_Systems"]}