{"id":"328077627_ViSeq_Visual_Analytics_of_Learning_Sequence_in_Massive_Open_Online_Courses","abstract":"The research on massive open online courses (MOOCs) data analytics has mushroomed recently because of the rapid development of MOOCs. The MOOC data not only contains learner profiles and learning outcomes, but also sequential information about when and which type of learning activities each learner performs, such as reviewing a lecture video before undertaking an assignment. Learning sequence analytics could help understand the correlations between learning sequences and performances, which further characterize different learner groups. However, few works have explored the sequence of learning activities, which have mostly been considered aggregated events. A visual analytics system called ViSeq is introduced to resolve the loss of sequential information, to visualize the learning sequence of different learner groups, and to help better understand the reasons behind the learning behaviors. The system facilitates users in exploring learning sequences from multiple levels of granularity. ViSeq incorporates four linked views: the projection view to identify learner groups, the pattern view to exhibit overall sequential patterns within a selected group, the sequence view to illustrate the transitions between consecutive events, and the individual view with an augmented sequence chain to compare selected personal learning sequences. Case studies and expert interviews were conducted to evaluate the system.","authors":["Qing Chen","Xuanwu Yue","Xavier Plantaz","Yuanzhe Chen"],"meta":["October 2018IEEE Transactions on Visualization and Computer Graphics PP(99)","DOI:10.1109/TVCG.2018.2872961"],"references":["318587788_Supporting_Handoff_in_Asynchronous_Collaborative_Sensemaking_Using_Knowledge-Transfer_Graphs","301934850_Unsupervised_Clickstream_Clustering_for_User_Behavior_Analysis","324133835_Visual_learning_analytics_of_educational_data_A_systematic_literature_review_and_research_agenda","320988723_Mining_Theory-Based_Patterns_from_Big_Data_Identifying_Self-Regulated_Learning_Strategies_in_Massive_Open_Online_Courses","319393588_Guidelines_for_using_multiple_views_in_information_visualization","315638301_EventAction_Visual_analytics_for_temporal_event_sequence_recommendation","306148872_Dropout_prediction_in_MOOCs_using_learner_activity_features","306051800_Patterns_and_Sequences_Interactive_Exploration_of_Clickstreamsto_Understand_Common_Visitor_Paths","305507863_Does_sequence_matter_Productive_failure_and_designing_online_authentic_learning_for_process_engineering_Productive_failure_and_designing_online_authentic_learning","302074055_High-Volume_Hypothesis_Testing_for_Large-Scale_Web_Log_Analysis"]}