{"id":"328088383_Deep_learning_in_chest_radiography_Detection_of_findings_and_presence_of_change","abstract":"Background: \nDeep learning (DL) based solutions have been proposed for interpretation of several imaging modalities including radiography, CT, and MR. For chest radiographs, DL algorithms have found success in the evaluation of abnormalities such as lung nodules, pulmonary tuberculosis, cystic fibrosis, pneumoconiosis, and location of peripherally inserted central catheters. Chest radiography represents the most commonly performed radiological test for a multitude of non-emergent and emergent clinical indications. This study aims to assess accuracy of deep learning (DL) algorithm for detection of abnormalities on routine frontal chest radiographs (CXR), and assessment of stability or change in findings over serial radiographs.\n\nMethods and findings: \nWe processed 874 de-identified frontal CXR from 724 adult patients (> 18 years) with DL (Qure AI). Scores and prediction statistics from DL were generated and recorded for the presence of pulmonary opacities, pleural effusions, hilar prominence, and enlarged cardiac silhouette. To establish a standard of reference (SOR), two thoracic radiologists assessed all CXR for these abnormalities. Four other radiologists (test radiologists), unaware of SOR and DL findings, independently assessed the presence of radiographic abnormalities. A total 724 radiographs were assessed for detection of findings. A subset of 150 radiographs with follow up examinations was used to asses change over time. Data were analyzed with receiver operating characteristics analyses and post-hoc power analysis.\n\nResults: \nAbout 42% (305/ 724) CXR had no findings according to SOR; single and multiple abnormalities were seen in 23% (168/724) and 35% (251/724) of CXR. There was no statistical difference between DL and SOR for all abnormalities (p = 0.2-0.8). The area under the curve (AUC) for DL and test radiologists ranged between 0.837-0.929 and 0.693-0.923, respectively. DL had lowest AUC (0.758) for assessing changes in pulmonary opacities over follow up CXR. Presence of chest wall implanted devices negatively affected the accuracy of DL algorithm for evaluation of pulmonary and hilar abnormalities.\n\nConclusions: \nDL algorithm can aid in interpretation of CXR findings and their stability over follow up CXR. However, in its present version, it is unlikely to replace radiologists due to its limited specificity for categorizing specific findings.","authors":["Ramandeep Singh","Mannudeep K. Kalra","Chayanin Nitiwarangkul","John A. Patti"],"meta":["October 2018PLoS ONE 13(10):e0204155","DOI:10.1371/journal.pone.0204155"],"references":["321095969_CheXNet_Radiologist-Level_Pneumonia_Detection_on_Chest_X-Rays_with_Deep_Learning","319770123_Densely_Connected_Convolutional_Networks","316740882_ChestX-Ray8_Hospital-Scale_Chest_X-Ray_Database_and_Benchmarks_on_Weakly-Supervised_Classification_and_Localization_of_Common_Thorax_Diseases","316736470_ChestX-ray8_Hospital-scale_Chest_X-ray_Database_and_Benchmarks_on_Weakly-Supervised_Classification_and_Localization_of_Common_Thorax_Diseases","302496501_Computer_Aided_Detection_of_Pulmonary_Tuberculosis_on_Digital_Chest_Radiographs_a_systematic_review","301740185_An_automated_tuberculosis_screening_strategy_combining_X-ray-based_computer-aided_detection_and_clinical_information","323488722_Detection_of_tuberculosis_patterns_in_digital_photographs_of_chest_X-ray_images_using_Deep_Learning_Feasibility_study","320727106_Learning_to_diagnose_from_scratch_by_exploiting_dependencies_among_labels","316443493_Deep_Learning_at_Chest_Radiography_Automated_Classification_of_Pulmonary_Tuberculosis_by_Using_Convolutional_Neural_Networks","302072742_A_novel_approach_for_tuberculosis_screening_based_on_deep_convolutional_neural_networks"]}