{"id":"328099746_Game_Semantics_in_Teaching_of_Classical_First_Order_Predicate_Logic_to_Stu-_dents_of_Computer_Science","abstract":"Game-theoretical interpretation of logical semantics has been first suggested in 1950s. Although it is well know among professionals, it is often excluded from introductory courses in logic. In this paper we examine whether and to what extent would including game semantics in the syllabus of an introductory course of predicate and propositional logic prove to be beneficial to students’ understanding of the subject. To that purpose, we have exposed two groups of undergraduate students of computer science to game semantics as part of recitations for the course Propositional and Predicate Logic. We focus mainly on how this affects students’ mastery of two particular topics – alternating quantification and restricted quantification. Observations were made during the recitations to evaluate any changes in students’ approach to solving relevant problems in classroom. Moreover, before the final test of the recitations one of the groups was given a brief review of game semantics and the other was not. We have measured the difference in performance of these two groups and the results support the hypothesis that game semantics helps students master certain topics of predicate logic. We reference some of the later research in psychology and pedagogy to help us explain this effect.","authors":["Jana Glivická"],"meta":["January 2018MATEC Web of Conferences 210(1):04007","DOI:10.1051/matecconf/201821004007"],"references":["307914137_Guiding_reinvention_of_conventional_tools_of_mathematical_logic_students'_reasoning_about_mathematical_disjunctions","225285609_Get_Up_and_Win_Participatory_Responses_to_Narratives","222413574_The_form_of_the_forgetting_curve_and_the_fate_of_memories","12248972_The_Role_of_Transportation_in_the_Persuasiveness_of_Public_Narrative","284122048_Comparison_of_Lecture-Based_Learning_vs_Discussion-Based_Learning_in_Undergraduate_Medical_Students","275131432_Dynamic_and_interactive_mathematics_learning_environments_The_case_of_teaching_the_limit_concept","265304068_A_Game_Theory_of_Logic_-_A_Logic_of_Game_Theory","225518918_An_Epistemological_and_Didactic_Study_of_a_Specific_Calculus_Reasoning_Rule"]}