{"id":"328077609_Big_data_Algorithms_analytics_and_applications","abstract":"As today’s organizations are capturing exponentially larger amounts of data than ever, now is the time for organizations to rethink how they digest that data. Through advanced algorithms and analytics techniques, organizations can harness this data, discover hidden patterns, and use the newly acquired knowledge to achieve competitive advantages. Presenting the contributions of leading experts in their respective fields, Big Data: Algorithms, Analytics, and Applications bridges the gap between the vastness of Big Data and the appropriate computational methods for scientific and social discovery. It covers fundamental issues about Big Data, including efficient algorithmic methods to process data, better analytical strategies to digest data, and representative applications in diverse fields, such as medicine, science, and engineering. The book is organized into five main sections: 1. Big Data Management—considers the research issues related to the management of Big Data, including indexing and scalabilityaspects. 2. Big Data Processing—addresses the problem of processing Big Data across a wide range of resource-intensive computational settings: 3. Big Data Stream Techniques and Algorithms—explores research issues regarding the management and mining of Big Data in streaming environments. 4. Big Data Privacy—focuses on models, techniques, and algorithms for preserving Big Data privacy. 5. Big Data Applications—illustrates practical applications of Big Data across several domains, including finance, multimedia tools, biometrics, and satellite Big Data processing. Overall, the book reports on state-of-the-art studies and achievements in algorithms, analytics, and applications of Big Data. It provides readers with the basis for further efforts in this challenging scientific field that will play a leading role in next-generation database, data warehousing, data mining, and cloud computing research. It also explores related applications in diverse sectors, covering technologies for media/data communication, elastic media/data storage, cross-network media/data fusion, and SaaS.","authors":["Kuan-Ching Li","H. Jiang","L.T. Yang","A. Cuzzocrea"],"meta":["January 2015"],"references":[]}