{"id":"328183263_Heterogeneous_Knowledge-Based_Attentive_Neural_Networks_for_Short-Term_Music_Recommendations","abstract":"The current existing data in online music service platforms is heterogeneous, extensive, and disorganized. Finding an effective method to use these data in recommending appropriate music to users during a short-term session is a significant challenge. Another serious problem is that most of data, in reality, obey the long-tailed distribution, which consequently leads to traditional music recommendation systems recommending a lot of popular music that users do not like on a specific occasion. To solve these problems, we propose a heterogeneous knowledge-based attentive neural network (HK-ANN) model for short-term music recommendations. First, we collect three types of data for modeling entities in user-music interaction network, i.e., graphic, textual, and visual data and then embed them into high-dimensional spaces using the TansR, PV-DM, and VAE methods respectively. The concatenation of these embedding results is an abstract representation of the entity. Based on this, a recurrent neural network with an attention mechanism is built that is capable of obtaining users’ preferences in the current session and consequently making recommendations. The experimental results show that our proposed approach outperforms the current stateof- the-art short-term music recommendation systems on one real world dataset. In addition, it can also recommend more relatively unpopular songs compared with classic models.","authors":["Qika Lin","Yaoqiang Niu","Yifan Zhu","Hao lu"],"meta":["October 2018IEEE Access 6:58990 - 59000","DOI:10.1109/ACCESS.2018.2874959","Project: Intelligent knowledge service in educational and academic scenarios"],"references":["323244320_Improving_music_recommendation_by_incorporating_social_influence","322073208_Learning_to_embed_music_and_metadata_for_context-aware_music_recommendation","321846860_Use_of_Deep_Learning_in_Modern_Recommendation_System_A_Summary_of_Recent_Works","320385043_Sequence-based_context-aware_music_recommendation","320772034_Research_of_Music_Recommendation_System_Based_on_User_Behavior_Analysis_and_Word2vec_User_Emotion_Extraction","320672683_Music_recommendation_based_on_embedding_model_with_user_preference_and_context","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","319770229_Auto-Encoding_Variational_Bayes","319770134_Stochastic_Backpropagation_and_Approximate_Inference_in_Deep_Generative_Models"]}