{"id":"328110471_e-RNSP_An_Efficient_Method_for_Mining_Repetition_Negative_Sequential_Patterns","abstract":"Negative sequential patterns (NSPs), which capture both frequent occurring and nonoccurring behaviors, become increasingly important and sometimes play a role irreplaceable by analyzing occurring behaviors only. Repetition sequential patterns capture repetitions of patterns in different sequences as well as within a sequence and are very important to understand the repetition relations between behaviors. Though some methods are available for mining NSP and repetition positive sequential patterns (RPSPs), we have not found any methods for mining repetition NSP (RNSP). RNSP can help the analysts to further understand the repetition relationships between items and capture more comprehensive information with repetition properties. However, mining RNSP is much more difficult than mining NSP due to the intrinsic challenges of nonoccurring items. To address the above issues, we first propose a formal definition of repetition negative containment. Then, we propose a method to convert repetition negative containment to repetition positive containment, which fast calculates the repetition supports by only using the corresponding RPSP's information without rescanning databases. Finally, we propose an efficient algorithm, called e-RNSP, to mine RNSP efficiently. To the best of our knowledge, e-RNSP is the first algorithm to efficiently mine RNSP. Intensive experimental results on the first four real and synthetic datasets clearly show that e-RNSP can efficiently discover the repetition negative patterns; results on the fifth dataset prove the effectiveness of RNSP which are captured by the proposed method; and the results on the rest 16 datasets analyze the impacts of data characteristics on mining process.","authors":["Xiangjun Dong","Yongshun Gong","Longbing Cao"],"meta":["October 2018IEEE Transactions on Cybernetics PP(99):1-13","DOI:10.1109/TCYB.2018.2869907"],"references":["323069514_Mining_constrained_inter-sequence_patterns_a_novel_approach_to_cope_with_item_constraints","312389292_Mining_sequential_patterns_for_classification","326022003_F-NSP_A_Fast_Negative_Sequential_Patterns_Mining_Method_with_Self-adaptive_Data_Storage","324709953_Efficient_High_Utility_Negative_Sequential_Patterns_Mining_in_Smart_Campus","324234252_Frequent_pattern_discovery_with_tri-partition_alphabets","321628744_Mining_Maximal_Frequent_Patterns_in_Transactional_Databases_and_Dynamic_Data_Streams_a_Spark-based_Approach","319660647_ELM-Based_Large-Scale_Genetic_Association_Study_via_Statistically_Significant_Pattern","319393506_Mining_Sequential_Patterns_Generalizations_and_Performance_Improvements","317948714_Multiobjective_Characteristic-based_Framework_for_Very-Large_Multiple_Sequence_Alignment","311340667_Sequence-Based_Deterministic_Initialization_for_Evolutionary_Algorithms","306383934_e-NSPFI_Efficient_Mining_Negative_Sequential_Pattern_from_Both_Frequent_and_Infrequent_Positive_Sequential_Patterns","297750727_E-NSP_Efficient_negative_sequential_pattern_mining","310790181_An_RB-EZH2_Complex_Mediates_Silencing_of_Repetitive_DNA_Sequences","303976546_E-msNSP_Efficient_Negative_Sequential_Patterns_Mining_Based_on_Multiple_Minimum_Supports","303009690_Mining_negative_sequential_patterns"]}