{"id":"328176606_Deep_Network_Embedding_for_Graph_Representation_Learning_in_Signed_Networks","abstract":"Network embedding has attracted an increasing attention over the past few years. As an effective approach to solve graph mining problems, network embedding aims to learn a low-dimensional feature vector representation for each node of a given network. The vast majority of existing network embedding algorithms, however, are only designed for unsigned networks, and the signed networks containing both positive and negative links, have pretty distinct properties from the unsigned counterpart. In this paper, we propose a deep network embedding model to learn the low-dimensional node vector representations with structural balance preservation for the signed networks. The model employs a semisupervised stacked auto-encoder to reconstruct the adjacency connections of a given signed network. As the adjacency connections are overwhelmingly positive in the real-world signed networks, we impose a larger penalty to make the auto-encoder focus more on reconstructing the scarce negative links than the abundant positive links. In addition, to preserve the structural balance property of signed networks, we design the pairwise constraints to make the positively connected nodes much closer than the negatively connected nodes in the embedding space. Based on the network representations learned by the proposed model, we conduct link sign prediction and community detection in signed networks. Extensive experimental results in real-world datasets demonstrate the superiority of the proposed model over the state-of-the-art network embedding algorithms for graph representation learning in signed networks.","authors":["Xiao Shen","Fu-Lai Chung"],"meta":["April 2020IEEE Transactions on Cybernetics 50(4):1556-1568","DOI:10.1109/TCYB.2018.2871503","Project: Network Embedding"],"references":["326140869_Deep_Domain_Adaptation_Based_on_Multi-layer_Joint_Kernelized_Distance","321063795_Deep_Network_Embedding_with_Aggregated_Proximity_Preserving","318763980_Leveraging_Cross-Network_Information_for_Graph_Sparsification_in_Influence_Maximization","313761966_Signed_Network_Embedding_in_Social_Media","324511609_Transfer_Independently_Together_A_Generalized_Framework_for_Domain_Adaptation","320638328_Adaptive_Semi-Supervised_Classifier_Ensemble_for_High_Dimensional_Data_Classification","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","316263500_Adaptive_Ensembling_of_Semi-Supervised_Clustering_Solutions","312565381_Progressive_Semisupervised_Learning_of_Multiple_Classifiers","310824980_Structural_Deep_Network_Embedding"]}