{"id":"328161137_Training_Passive_Photonic_Reservoirs_With_Integrated_Optical_Readout","abstract":"As Moore's law comes to an end, neuromorphic approaches to computing are on the rise. One of these, passive photonic reservoir computing, is a strong candidate for computing at high bitrates (> 10 Gbps) and with low energy consumption. Currently though, both benefits are limited by the necessity to perform training and readout operations in the electrical domain. Thus, efforts are currently underway in the photonic community to design an integrated optical readout, which allows to perform all operations in the optical domain. In addition to the technological challenge of designing such a readout, new algorithms have to be designed in order to train it. Foremost, suitable algorithms need to be able to deal with the fact that the actual on-chip reservoir states are not directly observable. In this work, we investigate several options for such a training algorithm and propose a solution in which the complex states of the reservoir can be observed by appropriately setting the readout weights, while iterating over a predefined input sequence. We perform numerical simulations in order to compare our method with an ideal baseline requiring full observability as well as with an established black-box optimization approach (CMA-ES).","authors":["Matthias Freiberger","Andrew Katumba","Peter Bienstman","J. Dambre"],"meta":["October 2018IEEE Transactions on Neural Networks and Learning Systems PP(99)","DOI:10.1109/TNNLS.2018.2874571","Project: Photonic Reservoir Computing"],"references":["316915793_Advances_in_photonic_reservoir_computing","316553553_A_Multiple-Input_Strategy_to_Efficient_Integrated_Photonic_Reservoir_Computing","282858807_Production_of_VO2_thin_films_through_post-deposition_annealing_of_V2O3_and_VOx_films","313505421_Completely_derandomized_self-adaptation_in_evolution_strategies","313446488_Ridge_regression_Biased_estimation_for_nonorthogonal_problems","312932423_Numerical_Simulation_and_Experiment_on_Optical_Packet_Header_Recognition_Utilizing_Reservoir_Computing_Based_on_Optoelectronic_Feedback","296327830_Photonic_reservoir_computing_approaches_to_nanoscale_computation","283256949_Integrated_all-photonic_non-volatile_multi-level_memory","275526158_Atomic_switch_networks_-_Nanoarchitectonic_design_of_a_complex_system_for_natural_computing","271494533_Variation-tolerant_Computing_with_Memristive_Reservoirs"]}