{"id":"328124048_A_hybrid_MCDM-fuzzy_multi-objective_programming_approach_for_a_G-Resilient_supply_chain_network_design","abstract":"Stakeholders are being increasingly encouraged to improve their supply chain risk management in order to cope efficiently and successfully with disruption risks due to unexpected events. Notwithstanding, supply chain managers lagged behind this target overlooking green development in considering environmental impact which has become a main criterion in supply chain management. Where the era of greenness threatens current supply chain partners with the need to either cope with the new green regulations or leave the field for new players. Thus, an approach to design supply chains that are simultaneously resilient, and green is needed. This study satisfies this need by developing a green and resilient (G-resilient, here after) fuzzy multi-objective programming model (GR-FMOPM) to present a G-resilient supply chain network design in determining the optimal number of facilities that should be established. The objectives are minimization of total cost and environmental impact and maximization of Value of resilience pillars where robustness, Agility, Leanness and Flexibility (V-RALF) can be seen four of main pillars required for supply chain resilience. Fuzzy AHP is used for determining the importance weight for each pillar followed by a usage of a Fuzzy technique for assigning the importance weight for each potential facility with respect to RALF. The importance weights obtained by Fuzzy AHP and the Fuzzy technique are then integrated in the third objective (maximization of V-RALF) to maximize the value of resilience pillars. Based on the fuzzy multi-objective model, the ε-constraint method is used to reveal Pareto optimal solutions and TOPSIS was then used to select the final Pareto solution. A case study is used to validate the applicability of the developed GR-FMOPM in obtaining a G-resilient supply chain network design and a trade-off among economic, green and resilience objectives. Finally, a sensitivity analysis is performed on the importance weight for facilities Pareto solutions with respect to the importance weight of RALF. Research findings proved that the developed GR-FMOPM could be used as a tool in evaluating and ranking related facilities with respect to their resilience performance. It can also be used to obtain a G-resilient supply chain network design in terms of facilities that should be established towards a trade-off among the three aforementioned objectives.","authors":["Ahmed Mohammed","I. Harris","A.J. Soroka","R. Nujoom"],"meta":["October 2018Computers & Industrial Engineering 127","DOI:10.1016/j.cie.2018.09.052"],"references":["323373222_Optimisation_of_a_sustainable_manufacturing_system_design_using_the_multi-objective_approach","311698214_Design_and_optimization_of_an_RFID-enabled_automated_warehousing_system_under_uncertainties_a_multi-criterion_fuzzy_programming_approach"]}