{"id":"328138817_Confidence_is_higher_in_touch_than_in_vision_in_cases_of_perceptual_ambiguity","abstract":"The inclination to touch objects that we can see is a surprising behaviour, given that vision often supplies relevant and sufficiently accurate sensory evidence. Here we suggest that this 'fact-checking' phenomenon could be explained if touch provides a higher level of perceptual certainty than vision. Testing this hypothesis, observers explored inverted T-shaped stimuli eliciting the 16 Vertical-horizontal illusion in vision and touch, which included clear-cut and ambiguous cases. In separate blocks, observers judged whether the vertical bar was shorter or longer than the horizontal bar and rated the confidence in their judgments. Decisions reached by vision were objectively more accurate than those reached by touch with higher overall confidence ratings. However, while confidence was higher for vision rather than for touch in clear-cut cases, observers were more confident in touch when the stimuli were ambiguous. This relative bias as a function of ambiguity qualifies the view that confidence tracks objective accuracy and uses a comparable mapping across sensory modalities. Employing a perceptual illusion, our method disentangles objective and subjective accuracy showing how the latter is tracked by confidence and point towards possible origins for 'fact checking' by touch.","authors":["Merle T Fairhurst","Eoin Travers","Vincent Hayward","Ophelia Deroy"],"meta":["October 2018Scientific Reports","DOI:10.1038/s41598-018-34052-z","Project: Rethinking the Senses (AHRC) based at the Centre for the Study of the Senses. "],"references":["321275914_Altering_movement_parameters_disrupts_metacognitive_accuracy","317233454_Confidence_matching_in_group_decision-making","311096107_Metacognition_of_attention_during_tactile_discrimination","318393770_R_A_Language_and_Environment_for_Statistical_Computing","315357458_Philosophical_Works_Including_the_Works_on_Vision_by_George_Berkeley_introduction_and_notes_by_M_R_Ayers","314856963_An_Investigation_of_Doubt_in_Obsessive-Compulsive_Disorder","312455832_R_A_Language_and_Environment_for_Statistical_Computing","307978917_Metacognition_in_Multisensory_Perception","306004486_Visual_Confidence","305074084_A_Mathematical_Framework_for_Statistical_Decision_Confidence"]}