{"id":"328166165_Structured_peer-to-peer-based_publication_and_sharing_of_ontologies_to_automatically_process_SPARQL_query_on_a_semantic_sensor_network","abstract":"In recent years, semantic sensor networks are proposed, which apply ontologies to provide query capabilities and data access and allow users to express their needs at a conceptual level. In such sensor networks, a large amount of web ontologies are separately created by sensors to represent their own knowledge. These ontologies are distributed in different sensors and provide knowledge for semantic queries. It has become a very pressing issue to locate the desired ontologies for a given semantic query. To address this issue, we propose an approach based on structured peer-to-peer protocol to publish shareable ontologies on different sensors and automatically discover the ontologies useful for a given SPARQL query. Therefore, if a SPARQL query is given, our approach can locate ontologies desired and further send the query to them to find out solutions for the query. In addition, if solutions can be found out from a web ontology published, our approach makes sure to discover the ontology and get the solutions from it for the query. We conduct three experiments to evaluate the approach, the results of which demonstrate that our approach is effective and efficient.","authors":["Huayou Si","Yajie Qi","Meilian Zheng","Yongjian Ren"],"meta":["October 2018International Journal of Distributed Sensor Networks 14(10):155014771879758","DOI:10.1177/1550147718797581"],"references":["300894309_The_Distributed_Ontology_Modeling_and_Specification_Language_-_DOL","275637937_Reasoning_in_Semantic_Web_using_Jena","326335568_Where_to_Publish_and_Find_Ontologies_A_Survey_of_Ontology_Libraries","319393299_OWL_2_Web_Ontology_Language_Profiles","314600526_A_Consistent_Hashing_Based_Data_Redistribution_Algorithm","308731163_OWL_RDF_RDFS_inference_derivation_using_Jena_semantic_framework_pellet_reasoner","305801887_Deep_Multimodal_Distance_Metric_Learning_Using_Click_Constraints_for_Image_Ranking","281328475_A_Distributed_PublishSubscribe_System_for_RDF_Data","280733206_Collaborative_Recommendation_with_User_Generated_Content","272353260_SPARQL_query_language_for_RDF_W3C_Recommendation"]}