{"id":"328108092_Building_a_Nasa_Yuwe_Language_Corpus_and_Tagging_with_a_Metaheuristic_Approach","abstract":"Nasa Yuwe is the language of the Nasa indigenous community in Colombia. It is currently threatened with extinction. In this regard, a range of computer science solutions have been developed to the teaching and revitalization of the language. One of the most suitable approaches is the construction of a Part-Of-Speech Tagging (POST), which encourages the analysis and advanced processing of the language. Nevertheless, for Nasa Yuwe no tagged corpus exists, neither is there a POS Tagger and no related works have been reported. This paper therefore concentrates on building a linguistic corpus tagged for the Nasa Yuwe language and generating the first tagging application for Nasa Yuwe. The main results and findings are 1) the process of building the Nasa Yuwe corpus, 2) the tagsets and tagged sentences, as well as the statistics associated with the corpus, 3) results of two experiments to evaluate several POS Taggers (a Random tagger, three versions of HSTAGger, a tagger based on the harmony search metaheuristic, and three versions of a memetic algorithm GBHS Tagger, based on Global-Best Harmony Search (GBHS), Hill Climbing and an explicit Tabu memory, which obtained the best results in contrast with the other methods considered over the Nasa Yuwe language corpus.","authors":["Luz Marina Sierra Martínez","Carlos Cobos","Juan Carlos Corrales","Tulio Rojas Curieux"],"meta":["October 2018Computacion y Sistemas 22(3):881-894","DOI:10.13053/CyS-22-3-3018"],"references":["326328106_Annotating_Bhojpuri_Corpus_using_BIS_Scheme","321327719_Memetic_Algorithm_Based_on_Global-Best_Harmony_Search_and_Hill_Climbing_for_Part_of_Speech_Tagging","309263986_Tokenizer_Adapted_for_the_Nasa_Yuwe_Language","308584335_Heuristic-based_part-of-speech_tagging_of_source_code_identifiers_and_comments","319393666_Modern_Information_Retrieval","317160815_Part-of-speech_tagging_for_web_search_queries_using_a_large-scale_web_corpus","312607081_Building_a_large_annotated_corpus_of_english_The_penn_treebank","311756091_Deep_learning_based_parts_of_speech_tagger_for_Bengali","309472176_Using_Uniform-Design_GEP_for_Part-of-Speech_Tagging","309340545_Back-Propagation_Neural_Network_Approach_to_Myanmar_Part-of-Speech_Tagging"]}