{"id":"328190164_Developing_the_Dimensions_of_a_Social_Content_Management_Framework","abstract":"The rise of social media has transformed the way of collaboration between organisations and customers. Social content resulting from the active collaboration between both parties on a social media platform should be managed accordingly. Thus, a social content management (SCM) framework should be developed as a guide to manage the social content. Such SCM framework should be able to augment existing frameworks, which mainly focuses on the value of social content for the organisations. Hence, based on the service science perspective, this article proposes a SCM framework that focusses on value to both organisations and its customers. In order to do this, the concept of Service Dominant Logic and the DART model are adopted to explore and extract the elements and factors that collectively become the dimensions of the proposed SCM framework. Experts’ review of the elements and factors is conducted to ensure that the dimensions in the SCM framework are acceptable and have practical value. The proposed framework is then validated via an instrument whose content validity is investigated by using Lawshe’s Technique. This framework could assist the organisations in decision-making process towards innovating services and in the management of social content.","authors":["Wan Azlin Zurita Wan Ahmad","Muriati Mukhtar","Yazrina Yahya"],"meta":["October 2018International Journal on Advanced Science Engineering and Information Technology 8(5)","DOI:10.18517/ijaseit.8.5.6520","Project: Social Content Management"],"references":["301508098_The_Impact_of_Social_Media_Content_Marketing_SMCM_towards_Brand_Health","293807395_How_to_strengthen_the_social_media_interactivity_of_e-government","283841746_Service_Innovation_A_Service-Dominant_Logic_Perspective","282540931_Institutions_and_axioms_an_extension_and_update_of_service-dominant_logic","303916818_Universal_and_contextualized_public_services_Digital_public_service_innovation_framework","293011304_Social_media_content_and_product_co-creation_an_emerging_paradigm","292223444_Developments_in_practice_VIII_Enterprise_content_management","291185844_Digital_transparency_and_Web_20_in_Spanish_city_councils","289500174_Social_media_and_value_co-creation_in_multi-stakeholder_systems_A_resource_integration_approach","287982195_Extending_actor_participation_in_value_creation_an_institutional_view"]}