{"id":"328187945_Development_of_Routing_Algorithms_in_Networks_on_Chip_with_a_Multiplicative_Circulant_Topology","abstract":"More info about reserch: https://www.researchgate.net/publication/330509324_Routing_in_Networks_on_Chip_with_Multiplicative_Circulant_Topology \n_______________________________________________________________\nNowadays, construction of multi-core processors is becoming one of the most popular areas of investigation in computer science field; transition to multi-core processors allows overcoming the performance decrease, observed in complex single-core system design. Increase in core number, however, raise the issue of choosing the best topology, because classic topologies (mesh, hypercube, torus) fail to meet the requirements of modern networks with numerous cores. In this paper, multiplicative circulants, as a possible topology for networks-on-chip, are considered. Comparison of main characteristics of chosen type of circulants with characteristics of widely used mesh topology, makes it possible to consider multiplicative circulants to be a better topology for multi-core systems and to suggest the packet design for simple static routing technique based on classic breadth first search (BFS) algorithm. However, universal solutions have never been the best for a certain class of objects, so a specialized routing algorithm, taking into account the peculiarities of multiplicative circulants, was elaborated. By utilizing only mathematic operations, the developed algorithm managed to avoid exponential dependency on number of nodes inherent to BFS algorithm and demonstrated good performance even for networks with hundreds of nodes. Moreover, the presented algorithm required less service data in the packet, because only the target node number was needed for proper work.\n_______________________________________________________________\nРазработка многоядерных процессорных систем является востребованным направлением науки и техники. Появление процессоров с десятками и сотнями ядер ставит перед разработчиками вопрос о выборе оптимальной топологии, способной обеспечить эффективную маршрутизацию в сети с большим количеством узлов. В настоящей работе рассматривается возможность применения мультипликативных циркулянтов в качестве топологии для сетей на кристалле. Предлагается способ организации адресного поля пакета при статической маршрутизации на основе стандартного алгоритма поиска кратчайшего пути в сети с циркулянтной топологией. Разработан специализированный алгоритм маршрутизации в сетях с топологией мультипликативный циркулянт, учитывающий особенности топологии и имеющий высокие показатели масштабируемости. \nКлючевые слова — сеть на кристалле, топология сети на кристалле, мультипликативный циркулянт, алгоритм маршрутизации.","authors":["M.A. Shchegoleva","Aleksandr Yu. Romanov"],"meta":["January 2018","DOI:10.31114/2078-7707-2018-3-119-125"],"references":["238625662_Principles_and_Practices_of_Interconnection_Network","301758570_NoC_routing_protocols_-_objective-based_classification","279358353_Catalogue_of_Artificial_Intelligence_Tools","225457583_An_interconnection_architecture_for_network-on-chip_systems","222806414_Graphs_with_Circulant_Adjacency_Matrices","220862292_Next_generation_on-chip_networks_What_kind_of_congestion_control_do_we_need","220431430_A_Combinatorial_Problem_Related_to_Multimodule_Memory_Organizations","3043158_Signed_Digit_Representations_of_Minimal_Hamming_Weight"]}