{"id":"328173661_Remote_assessment_of_countries'_cyber_weapon_capabilities","abstract":"Today, a growing number of countries are incorporating cyber troops in their military and announcing intent to develop cyber weapons. Assessing countries’ cyber capabilities has important international policy implications. However, prior work on assessing such capabilities consists mainly of case studies. These case studies require substantial expertise and effort and thus only focus on a few “obvious countries”. In this paper, we develop a socio-computational methodology and populate the methodology using real data in order to assess cyber capabilities of all countries in the world. We leverage the fact that the strength of countries’ cyber capabilities depends on countries’ motivations and latent abilities to develop such capabilities. We develop a socio-cultural model to assess countries’ motivations and present metrics to assess countries’ latent abilities. More specifically, we adapt the Friedkin socio-cultural model in order to capture factors that motivate countries to acquire such capabilities. We then populate the model using publicly available data on international relations and the list of countries that have incorporated cyber security units in their military. Subsequently, we run the model in order to obtain an estimate of countries’ motivations. We estimate countries’ latent abilities by examining the strength of cyber security research, the existence of cyber security institutions, and information technology penetration in these countries. We combine motivation scores and latent ability scores in order to obtain cyber weapon capability scores: high, medium, low, and very low. Our methodology can be used by non-experts who only have access to publicly available data.","authors":["Ghita Mezzour","Kathleen M Carley","Rick Carley"],"meta":["October 2018Social Network Analysis and Mining 8(1)","DOI:10.1007/s13278-018-0539-5"],"references":["300725544_An_empirical_study_of_global_malware_encounters","345808063_Exporting_the_Bomb_Technology_Transfer_and_the_Spread_of_Nuclear_Weapons","344114328_Cyber_Operations_and_the_Use_of_Force_in_International_Law","324513884_A_Socio-Computational_Approach_to_Predicting_Bioweapon_Proliferation","315866548_Global_Variation_in_Attack_Encounters_and_Hosting","313826791_A_matter_of_time_On_the_transitory_nature_of_cyberweapons","309087940_Technology_policy_law_and_ethics_regarding_US_acquisition_and_use_of_cyberattack_capabilities","292887506_International_military_alliances_1648-2008","291193551_The_US_military_response_to_cyber_warfare","275420698_Poor_Man's_Atomic_Bomb_Exploring_the_Relationship_between_Weapons_of_Mass_Destruction","273140349_Remote_assessment_of_countries'_nuclear_biological_and_cyber_capabilities_joint_motivation_and_latent_capability_approach","255551217_Determinants_of_Nuclear_Weapons_Proliferation","258127003_From_bombs_to_bytes_Can_our_nuclear_history_inform_our_cyber_future","254420687_Nuclear_Lessons_for_Cyber_Security","249734230_Decision-Making_Models_Rigor_and_New_Puzzles"]}