{"id":"328114822_Survey_of_automated_multiple_sclerosis_lesion_segmentation_techniques_on_magnetic_resonance_imaging","abstract":"Multiple sclerosis (MS) is a chronic disease. It affects the central nervous system and its clinical manifestation can variate. Magnetic Resonance Imaging (MRI) is often used to detect, characterize and quantify MS lesions in the brain, due to the detailed structural information that it can provide. Manual detection and measurement of MS lesions in MRI data is time-consuming, subjective and prone to errors. Therefore, multiple automated methodologies for MRI-based MS lesion segmentation have been proposed. Here, a review of the state-of-the-art of automatic methods available in the literature is presented.\nThe current survey provides a categorization of the methodologies in existence in terms of their input data handling, their main strategy of segmentation and their type of supervision. The strengths and weaknesses of each category are analyzed and explicitly discussed. The positive and negative aspects of the methods are highlighted, pointing out the future trends and, thus, leading to possible promising directions for future research. In addition, a further clustering of the methods, based on the databases used for their evaluation, is provided. The aforementioned clustering achieves a reliable comparison among methods evaluated on the same databases.\nDespite the large number of methods that have emerged in the field, there is as yet no commonly accepted methodology that has been established in clinical practice. Future challenges such as the simultaneous exploitation of more sophisticated MRI protocols and the hybridization of the most promising methods are expected to further improve the performance of the segmentation.","authors":["Antonis Danelakis","Theoharis Theoharis","Dimitrios Verganelakis"],"meta":["October 2018Computerized medical imaging and graphics: the official journal of the Computerized Medical Imaging Society 70","DOI:10.1016/j.compmedimag.2018.10.002"],"references":["14604040_Quantitative_assessment_of_MRI_in_monitoring_the_evolution_of_multiple_sclerosis"]}