{"id":"328103225_Applying_Competency-Based_Learning_Methodologies_to_Cybersecurity_Education_and_Training_Creating_a_Job-Ready_Cybersecurity_Workforce","abstract":"What do the Financial Services and Chemical sectors have in common with the Transportation and Government Facilities sectors? All sectors need workers skilled in cybersecurity. What will it take to have qualified workforce candidates coming out of education or training programs with the necessary cybersecurity skills and abilities? A global study indicates there will be a shortage of approximately 1.8 million skilled cyber workers in the next few years (Center for Cyber Safety and Education 2017).1 This creates a two-fold problem for national security and protecting our critical infrastructure from cyber attacks. First, is training a sufficient number of new information security workers and, second, is ensuring that existing Information Technology (IT) and cybersecurity workers have the requisite skills to provide necessary levels of security to protect information assets. This paper addresses the second issue – how to better equip learners to enter into, or remain in, the workforce with the necessary cybersecurity skills and abilities. This paper proposes the use of Competency- Based Education and Mastery Learning (CBML) methodologies as an innovative and more effective approach than the current Outcome-Based Education (OBE) approach. CBML methodologies strive for learners to 1 Frost & Sullivan. 2017 Global Information Security Workforce Study: Benchmarking Workforce Capacity and Response to Cyber Risk, North America Executive master critical skills at a minimum 95% competency level, before moving on to the next knowledge or skill component; rather than the OBE approach, where a “passing” grade of “C” equates to a 70% competency level. From which approach would you want to hire cyber workers for the Healthcare and Public Health sector or the Energy sector?","authors":["Alan B. Watkins","David Tobey","Casey W. O'Brien"],"meta":["January 2018","Projects: National CyberWatch Center Curriculum Standards PanelCybersecurity Workforce Capability Maturity Assessment and Development"],"references":["220017449_The_2_Sigma_Problem_The_Search_for_Methods_of_Group_Instruction_as_Effective_as_One-to-One_Tutoring"]}