{"id":"328191316_Ten_frequently_asked_questions_about_latent_class_analysis","abstract":"Latent class analysis (LCA) is a statistical method used to identify unobserved subgroups in a population with a chosen set of indicators. Given the increasing popularity of LCA, our aim is to equip psychological researchers with the theoretical and statistical fundamentals that we believe will facilitate the application of LCA models in practice. In this article, we provide answers to 10 frequently asked questions about LCA. The questions included in this article were fielded from our experience consulting with applied researchers interested in using LCA. The major topics include a general introduction in the LCA; an overview of class enumeration (e.g., deciding on the number of classes), including commonly used statistical fit indices; substantive interpretation of LCA solutions; estimation of covariates and distal outcome relations to the latent class variable; data requirements for LCA; software choices and considerations; distinctions and similarities among LCA and related latent variable models; and extensions of the LCA model. To illustrate the modeling ideas described in this article, we present an applied example using LCA. Specifically, we use LCA to model individual differences in positive youth development among college students and analyze demographic characteristics as covariates and a distal outcome of overall life satisfaction. We also include key references that direct readers to more detailed and technical discussions of these topics for which we provide an applied and introductory overview. We conclude by mentioning future developments in research and practice, including advanced cross-sectional and longitudinal extensions of LCA.","authors":["Karen Nylund-Gibson","Andrew Young Choi"],"meta":["December 2018Translational Issues in Psychological Science 4(4):440-461","DOI:10.1037/tps0000176"],"references":["322612134_MplusAutomation_An_R_Package_for_Facilitating_Large-Scale_Latent_Variable_Analyses_in_M_plus","318382899_Latent_Class_Analysis_for_Multiple_Discrete_Latent_Variables_A_Study_on_the_Association_Between_Violent_Behavior_and_Drug-Using_Behaviors","308573309_Covariates_and_Mixture_Modeling_Results_of_a_Simulation_Study_Exploring_the_Impact_of_Misspecified_Effects_on_Class_Enumeration","324722813_Extensions_of_Auxiliary_Variable_Approaches_for_the_Investigation_of_Mediation_Moderation_and_Conditional_Effects_in_Mixture_Models","323092774_Bayesian_Latent_Class_Analysis_Tutorial","317120718_Latent_Profiles_of_Acculturation_and_Their_Implications_for_Health_A_Study_With_Asian_Americans_in_Central_Texas","316174526_Fitting_latent_variable_mixture_models","312180745_Measurement_Invariance_and_Differential_Item_Functioning_in_Latent_Class_Analysis_With_Stepwise_Multiple_Indicator_Multiple_Cause_Modeling","311732267_Using_Bayesian_Statistics_to_Model_Uncertainty_in_Mixture_Models_A_Sensitivity_Analysis_of_Priors","288022457_Multiple-Group_Analysis_of_Similarity_in_Latent_Profile_Solutions"]}