{"id":"328107188_Implicit_Self-Regularization_in_Deep_Neural_Networks_Evidence_from_Random_Matrix_Theory_and_Implications_for_Learning","abstract":"Random Matrix Theory (RMT) is applied to analyze the weight matrices of Deep Neural Networks (DNNs), including both production quality, pre-trained models such as AlexNet and Inception, and smaller models trained from scratch, such as LeNet5 and a miniature-AlexNet. Empirical and theoretical results clearly indicate that the DNN training process itself implicitly implements a form of Self-Regularization, implicitly sculpting a more regu-larized energy or penalty landscape. In particular, the empirical spectral density (ESD) of DNN layer matrices displays signatures of traditionally-regularized statistical models, even in the absence of exogenously specifying traditional forms of explicit regularization, such as Dropout or Weight Norm constraints. Building on relatively recent results in RMT, most notably its extension to Universality classes of Heavy-Tailed matrices, and applying them to these empirical results, we develop a theory to identify 5+1 Phases of Training, corresponding to increasing amounts of Implicit Self-Regularization. These phases can be observed during the training process as well as in the final learned DNNs. For smaller and/or older DNNs, this Implicit Self-Regularization is like traditional Tikhonov regularization, in that there is a \"size scale\" separating signal from noise. For state-of-the-art DNNs, however, we identify a novel form of Heavy-Tailed Self-Regularization, similar to the self-organization seen in the statistical physics of disordered systems (such as classical models of actual neural activity). This results from correlations arising at all size scales, which for DNNs arises implicitly due to the training process itself. This implicit Self-Regularization can depend strongly on the many knobs of the training process. In particular, by exploiting the generalization gap phenomena, we demonstrate that we can cause a small model to exhibit all 5+1 phases of training simply by changing the batch size. This demonstrates that-all else being equal-DNN optimization with larger batch sizes leads to less-well implicitly-regularized models, and it provides an explanation for the generalization gap phenomena. Our results suggest that large, well-trained DNN architectures should exhibit Heavy-Tailed Self-Regularization, and we discuss the theoretical and practical implications of this. * Calculation Consulting,","authors":["Charles Martin","Michael W. Mahoney"],"meta":["October 2018","Project: Why Deep Learning Works"],"references":["325022755_On_the_information_bottleneck_theory_of_deep_learning","324600286_A_Mean_Field_View_of_the_Landscape_of_Two-Layers_Neural_Networks","324600052_Understanding_Convolutional_Neural_Networks_With_Information_Theory_An_Initial_Exploration","323931802_AllenNLP_A_Deep_Semantic_Natural_Language_Processing_Platform","323356041_Hessian-based_Analysis_of_Large_Batch_Training_and_Robustness_to_Adversaries","323276915_An_analysis_of_training_and_generalization_errors_in_shallow_and_deep_networks","344472691_Statistical_Mechanics_of_Learning","324744816_Measuring_the_Intrinsic_Dimension_of_Objective_Landscapes","324690431_Revisiting_Small_Batch_Training_for_Deep_Neural_Networks","323867553_Comparing_Dynamics_Deep_Neural_Networks_versus_Glassy_Systems"]}