{"id":"328203019_Analyzing_students'_answers_using_association_rule_mining_based_on_feature_selection","abstract":"Educational Institutions tend to find ways to improve academic performance by implementing different analytical tools and techniques. The explosive size of educational databases has many advantages and one of them is they can be used to enhance the performance of all academic staff and the institutions in the result. Educational Data Mining (EDM) as a new trend of data mining has faced a huge number of researches and tested almost all data mining techniques and algorithms which result in emerging enhancements in all educational fields. One of the most important functions in data mining is association rules mining. The association rules mining finds the association between dataset features and produces the association as rules. The resulting rules describe many hidden patterns inside the dataset and this feature is very helpful in EDM. Since all educational databases have many features which make the resulting association rules too many, so there is a need for using Feature Selection (FS) algorithm to reduce the features and use important features only. FS has become increasingly important as the size and dimensionality of educational datasets increase. FS is one of most important data mining research areas. It aims to identify several features that describe the dataset better than the original set of features. This objective can be achieved by removing redundant and less correlated features according to importance criteria in FS. Various selection algorithms have been proposed for filter-based FS. ReliefF is one of the most important algorithms that have been successfully implemented in many FS applications. This study presents a new model that can be utilized by any university that seeks to improve the quality of education by analyzing data and identifying factors that affect academic results to increase students' chances of success. We focus on Relief-based algorithms (RBAs) according to the technique of mining association rules. The main concept of the proposed algorithm is to find features that are closely correlative with the class attribute through the mining of association rules. Experimental results based on several real datasets confirm that the proposed model can obtain a smaller and promising feature subset compared with other models and techniques. The outcomes of this research can help improve policies in higher education.","authors":["Ali Salah Hashim","Alaa Khalaf","Wid Akeel"],"meta":["October 2018Xinan Jiaotong Daxue Xuebao/Journal of Southwest Jiaotong University 53(5):1","DOI:10.3969/j.issn.0258-2724.2018.002"],"references":["322643134_Distributed_ReliefF_based_Feature_Selection_in_Spark","321790262_Studentss_Success_Prediction_Based_on_Bayes_Algorithms","321486296_Educational_Data_Mining_Application_for_Estimating_Students_Performance_in_Weka_Environment","321026270_Modelling_students'_activities_in_programming_subjects_through_educational_data_mining","312509093_A_Systematic_Review_on_Educational_Data_Mining","324660626_Applying_Association_Rules_and_Decision_Tree_Algorithms_with_Tumor_Diagnosis_Data","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","320231195_Educational_Evaluation_Based_on_Apriori-Gen_Algorithm","319393723_Fast_algorithms_for_mining_association_rules","306260920_A_Weighted_Feature_Selection_Method_for_Instance-Based_Classification","257714693_Mining_significant_association_rules_from_educational_data_using_critical_relative_support_approach","268017225_Data_mining_Theories_algorithms_and_examples","260355884_Data_Mining_in_Education","254789319_Research_Methods_for_Business_A_Skill_Building_Approach_5th_Edition","232238898_Association_rule-based_feature_selection_method_for_Alzheimer's_disease_diagnosis"]}