{"id":"328291310_A_bibliometric_analysis_of_event_detection_in_social_media","abstract":"Purpose\nThe purpose of this paper is to explore the research status and development trend of the field of event detection in social media (ED in SM) through a bibliometric analysis of academic publications.\n\nDesign/methodology/approach\nFirst, publication distributions are analyzed including the trends of publications and citations, subject distribution, predominant journals, affiliations, authors, etc. Second, an indicator of collaboration degree is used to measure scientific connective relations from different perspectives. A network analysis method is then applied to reveal scientific collaboration relations. Furthermore, based on keyword co-occurrence analysis, major research themes and their evolutions throughout time span are discovered. Finally, a network analysis method is applied to visualize the analysis results.\n\nFindings\nThe area of ED in SM has received increasing attention and interest in academia with Computer Science and Engineering as two major research subjects. The USA and China contribute the most to the area development. Affiliations and authors tend to collaborate more with those within the same country. Among the 14 identified research themes, newly emerged themes such as Pharmacovigilance event detection are discovered.\n\nOriginality/value\nThis study is the first to comprehensively illustrate the research status of ED in SM by conducting a bibliometric analysis. Up-to-date findings are reported, which can help relevant researchers understand the research trend, seek scientific collaborators and optimize research topic choices.","authors":["Xieling Chen","Shan Wang","Yong Tang","Tianyong Hao"],"meta":["October 2018Online Information Review 43(2)","DOI:10.1108/OIR-03-2018-0068"],"references":["326064300_A_Bibliometric_Review_of_Natural_Language_Processing_Empowered_Mobile_Computing","324089096_A_bibliometric_analysis_of_natural_language_processing_in_medical_research","322606752_Global_trends_in_research_related_to_social_media_in_psychology_Mapping_and_bibliometric_analysis","322261928_Predicting_7-day_30-day_and_60-day_all-cause_unplanned_readmission_A_case_study_of_a_Sydney_hospital","319463899_Effectiveness_of_Social_Media_Data_in_Healthcare_Communication","321269797_Bibliometric_analysis_of_fuzzy_theory_research_in_China_A_30-year_perspective","320883883_Real-Time_Traffic_Event_Detection_From_Social_Media","319868231_Multi-network_multi-message_social_media_message_dissemination_problem_for_emergency_communication","319287096_Explicitly_and_Implicitly_Exploiting_the_Hierarchical_Structure_for_Mining_Website_Interests_on_News_Events","318314452_Bibliometrics_of_social_media_research_A_co-citation_and_co-word_analysis"]}