{"id":"328201137_Socioeconomic_gaps_in_science_achievement","abstract":"Background\nIn contrast to the extensive research on socioeconomic gaps in reading and math achievement, little attention has been given to socioeconomic disparities in science skills, particularly during the early years of schooling. This emphasis on later years may be problematic because large socioeconomic disparities emerge in the early years, thus it is crucial to document the size of disparities in science achievement and begin unpacking the range of factors that contribute to these disparities. Additionally, it is crucial to know which components of socioeconomic status are more strongly linked to children’s science skills so that resources can be more effectively targeted to address disparities. Using nationally representative data from the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (N = 9250), this study examines disparities in science achievement across elementary and middle school related to parental income and parental education separating their effects from each other and from a range of confounding factors. Additionally, it considers whether characteristics of children, families, and schools are pathways through which socioeconomic disparities emerge.\n\nResults\nResults show moderate gaps in science achievement related to both household income and parental education. The primary pathways through which parental education and family income influenced science achievement was through mathematics and reading achievement. For parental education gaps, smaller indirect effects also operated through access to informal science learning opportunities both inside and outside of the home environment.\n\nConclusion\nFirst, this study highlights the importance of considering the contributions of multiple measures of socioeconomic status, instead of a composite. Second, it shows that socioeconomic disparities in science achievement emerge early and that programs and policies aimed at addressing these gaps may need to target children during the early elementary and preschool years. Third, our findings suggest that elementary instructional approaches that simultaneously address science instruction with reading and/or mathematics instruction will likely be especially important for improving overall science outcomes.","authors":["Laura Betancur","Elizabeth Votruba-Drzal","Christian D Schunn"],"meta":["October 2018International Journal of STEM Education 5(1)","DOI:10.1186/s40594-018-0132-5"],"references":["320533577_How_personal_behavioral_and_environmental_factors_predict_working_in_STEMM_vs_non-STEMM_middle-skill_careers","356338964_The_Impact_of_Parental_Income_and_Education_on_the_Schooling_of_Their_Children","334267403_Cognitive_Precursors_to_Science_Comprehension","330909181_Human_capital_policy","321388051_What_are_critical_features_of_science_curriculum_materials_that_impact_student_and_teacher_outcomes","316879868_The_widening_academic_achievement_gap_between_the_rich_and_the_poor_New_evidence_and_possible_explanations","316879858_Whither_opportunity_Rising_inequality_schools_and_children's_life_chances","316879847_Monitoring_progress_toward_successful_K-12_STEM_education_A_nation_advancing","316879783_How_is_family_income_related_to_investments_in_children's_learning","311595627_Excerpts_from_Science_and_Engineering_Indicators_1998"]}