{"id":"328264084_Predicting_Weather_Forecast_Uncertainty_with_Machine_Learning","abstract":"Weather forecasts are inherently uncertain. Therefore, for many applications forecasts are only considered valuable if an uncertainty estimate can be assigned to them. Currently, the best method to provide a confidence estimate for individual forecasts is to produce an ensemble of numerical weather simulations, which is computationally very expensive. Here, we assess whether machine learning techniques can provide an alternative approach to predict the uncertainty of a weather forecast given the large‐scale atmospheric state at initialisation. We propose a method based on deep learning with artificial convolutional neural networks that is trained on past weather forecasts. Given a new weather situation, it assigns a scalar value of confidence to medium range forecasts initialised from said atmospheric state, indicating whether the predictability is higher or lower than usual for the time of the year. While our method has a lower skill than ensemble weather forecast models in predicting forecast uncertainty, it is computationally very efficient and outperforms a range of alternative methods that do not involve performing numerical forecasts. This shows that it is possible to use machine learning in order to estimate future forecast uncertainty from past forecasts. The main constraint in the performance of our method seems to be the number of past forecasts available for training the machine learning algorithm.","authors":["Sebastian Scher","Gabriele Messori"],"meta":["October 2018Quarterly Journal of the Royal Meteorological Society 144(717)","DOI:10.1002/qj.3410"],"references":["321735473_Attribution_of_recent_temperature_behaviour_reassessed_by_a_neural-network_method","315850800_Using_Artificial_Intelligence_to_Improve_Real-Time_Decision-Making_for_High-Impact_Weather","312928264_Dynamical_proxies_of_North_Atlantic_predictability_and_extremes","301896214_Application_of_Deep_Convolutional_Neural_Networks_for_Detecting_Extreme_Weather_in_Climate_Datasets","301839500_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","281516336_The_quiet_revolution_of_numerical_weather_prediction","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","295203642_Neural_networks_for_tornado_and_severe_weather_prediction_based_on_Doppler_radar-derived_attributes","280795060_Cloud_Classification_of_AVHRR_Imagery_in_Maritime_Regions_Using_a_Probabilistic_Neural_Network","277665022_Weather_forecasting_with_ensemble_methods"]}