{"id":"328210410_Evolutionary_multiobjective_multiple_description_wavelet_based_image_coding_in_the_presence_of_mixed_noise_in_images","abstract":"In this paper, a novel method for generation of multiple description (MD) wavelet based image coding is proposed by using Multi-Objective Evolutionary Algorithms (MOEAs). Complexity of the multimedia transmission problem has been increased for MD coders if an input image is affected by any type of noise. In this case, it is necessary to solve two different problems which are designing the optimal side quantizers and estimating optimal parameters of the denoising filter. Existing MD coding (MDC) generation methods are capable of solving only one problem which is to design side quantizers from the given noise-free image but they can fail reducing any type of noise on the descriptions if they applied to the given noisy image and this will cause bad quality of multimedia transmission in networks. Proposed method is used to overcome these difficulties to provide effective multimedia transmission in lossy networks. To achieve it, Dual Tree-Complex Wavelet Transform (DT-CWT) is first applied to the noisy image to obtain the subbands or set of coefficients which are used as a search space in the optimization problem. After that, two different objective functions are simultaneously employed in the MOEA to find pareto optimal solutions with the minimum costs by evolving the initial individuals through generations. Thus, optimal quantizers are created for MDCs generation and obtained optimum parameters are used in the image filter to remove the mixed Gaussian impulse noise on the descriptions effectively. The results demonstrate that proposed method is robust to the mixed Gaussian impulse noise, and offers a significant improvement of optimal side quantizers for balanced MDCs generation at different bitrates.","authors":["Huseyin Kusetogullari","Amir Yavariabdi"],"meta":["October 2018Applied Soft Computing 73","DOI:10.1016/j.asoc.2018.10.015"],"references":["311808236_Change_Detection_in_Multispectral_Landsat_Images_Using_Multi-Objective_Evolutionary_Algorithm","324401652_Resampling-Based_Multiple_Testing_Examples_and_Methods_for_p-Value_Adjustment","318601281_Adaptive_Multiple_Description_Depth_Image_Coding_Based_on_Wavelet_Sub-band_Coefficients","313755548_NCGA_Neighborhood_cultivation_genetic_algorithm_for_multi-objective_optimization_problems","313579113_Multiple_descriptive_coding_Compression_meets_the_network","312571874_Perceptual_multiple_description_coding_with_randomly_offset_quantizers","312570978_Multiple_description_coding_based_on_enhanced_X-tree","311757536_Multiple_description_vector_quantizer_design_based_on_redundant_representation_of_central_code","311732969_Muiltiobjective_optimization_using_nondominated_sorting_in_genetic_algorithms","305674314_Robust_airborne_image_transmission_using_joint_source-channel_coding_with_UEP"]}