{"id":"328226932_Deep_Learning_to_Distinguish_Recalled_but_Benign_Mammography_Images_in_Breast_Cancer_Screening","abstract":"Purpose: \nFalse positives in digital mammography screening lead to high recall rates, resulting in unnecessary medical procedures to patients and health care costs. This study aimed to investigate the revolutionary deep learning methods to distinguish recalled but benign mammography images from negative exams and those with malignancy.\n\nExperimental design: \nDeep learning convolutional neural network (CNN) models were constructed to classify mammography images into malignant (breast cancer), negative (breast cancer free), and recalled-benign categories. A total of 14,860 images of 3,715 patients from two independent mammography datasets: Full-Field Digital Mammography Dataset (FFDM) and a digitized film dataset, Digital Dataset of Screening Mammography (DDSM), were used in various settings for training and testing the CNN models. The ROC curve was generated and the AUC was calculated as a metric of the classification accuracy.\n\nResults: \nTraining and testing using only the FFDM dataset resulted in AUC ranging from 0.70 to 0.81. When the DDSM dataset was used, AUC ranged from 0.77 to 0.96. When datasets were combined for training and testing, AUC ranged from 0.76 to 0.91. When pretrained on a large nonmedical dataset and DDSM, the models showed consistent improvements in AUC ranging from 0.02 to 0.05 (all P > 0.05), compared with pretraining only on the nonmedical dataset.\n\nConclusions: \nThis study demonstrates that automatic deep learning CNN methods can identify nuanced mammographic imaging features to distinguish recalled-benign images from malignant and negative cases, which may lead to a computerized clinical toolkit to help reduce false recalls.","authors":["Sarah S. Aboutalib","Aly Abdelrahim","Wendie A. Berg","Margarita L. Zuley"],"meta":["October 2018Clinical Cancer Research 24(23)","DOI:10.1158/1078-0432.CCR-18-1115"],"references":["321195510_A_deep_learning_method_for_classifying_mammographic_breast_density_categories","318505761_Fine-Tuning_Convolutional_Neural_Networks_for_Biomedical_Image_Analysis_Actively_and_Incrementally","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","311411278_Breast_Mass_Classification_from_Mammograms_using_Deep_Convolutional_Neural_Networks","307968826_Digital_mammographic_tumor_classification_using_transfer_learning_from_deep_convolutional_neural_networks","319684144_Deep_learning_in_breast_cancer_risk_assessment_Evaluation_of_convolutional_neural_networks_on_a_clinical_dataset_of_full-field_digital_mammograms","312280340_Effectiveness_of_tomosynthesis_in_combination_with_digital_mammography_Outcomes_analysis_from_three_years_of_breast_cancer_screening","311609041_Deep_Residual_Learning_for_Image_Recognition","311449305_National_Performance_Benchmarks_for_Modern_Screening_Digital_Mammography_Update_from_the_Breast_Cancer_Surveillance_Consortium","308833748_Probabilistic_visual_search_for_masses_within_mammography_images_using_deep_learning"]}