{"id":"328292433_Review_Alternative_and_novel_feeds_for_ruminants_Nutritive_value_product_quality_and_environmental_aspects","abstract":"Ruminant-based food production faces currently multiple challenges such as environmental emissions, climate change and accelerating food–feed–fuel competition for arable land. Therefore, more sustainable feed production is needed together with the exploitation of novel resources. In addition to numerous food industry (milling, sugar, starch, alcohol or plant oil) side streams already in use, new ones such as vegetable and fruit residues are explored, but their conservation is challenging and production often seasonal. In the temperate zones, lipid-rich camelina ( Camelina sativa ) expeller as an example of oilseed by-products has potential to enrich ruminant milk and meat fat with bioactive trans -11 18:1 and cis -9, trans -11 18:2 fatty acids and mitigate methane emissions. Regardless of the lower methionine content of alternative grain legume protein relative to soya bean meal ( Glycine max ), the lactation performance or the growth of ruminants fed faba beans ( Vicia faba ), peas ( Pisum sativum ) and lupins ( Lupinus sp.) are comparable. Wood is the most abundant carbohydrate worldwide, but agroforestry approaches in ruminant nutrition are not common in the temperate areas. Untreated wood is poorly utilised by ruminants because of linkages between cellulose and lignin, but the utilisability can be improved by various processing methods. In the tropics, the leaves of fodder trees and shrubs (e.g. cassava ( Manihot esculenta ), Leucaena sp., Flemingia sp.) are good protein supplements for ruminants. A food–feed production system integrates the leaves and the by-products of on-farm food production to grass production in ruminant feeding. It can improve animal performance sustainably at smallholder farms. For larger-scale animal production, detoxified jatropha ( Jatropha sp.) meal is a noteworthy alternative protein source. Globally, the advantages of single-cell protein (bacteria, yeast, fungi, microalgae) and aquatic biomass (seaweed, duckweed) over land crops are the independence of production from arable land and weather. The chemical composition of these feeds varies widely depending on the species and growth conditions. Microalgae have shown good potential both as lipid (e.g. Schizochytrium sp.) and protein supplements (e.g. Spirulina platensis ) for ruminants. To conclude, various novel or underexploited feeds have potential to replace or supplement the traditional crops in ruminant rations. In the short-term, N-fixing grain legumes, oilseeds such as camelina and increased use of food and/or fuel industry by-products have the greatest potential to replace or supplement the traditional crops especially in the temperate zones. In the long-term, microalgae and duckweed of high-yield potential as well as wood industry by-products may become economically competitive feed options worldwide.","authors":["Anni Halmemies-Beauchet-Filleau","Marketta Rinne","Marjukka Lamminen","Chaowarit Mapato"],"meta":["October 2018animal 12(s2):1-15","DOI:10.1017/S1751731118002252"],"references":["329192331_Waste_to_worth_fruit_wastes_and_by-products_as_animal_feed","318996958_Nutritive_evaluation_and_milk_quality_of_including_of_tomato_or_olive_by-products_silages_with_sunflower_oil_in_the_diet_of_dairy_goats","332681080_Nutritional_and_fermentation_quality_of_ensiled_willow_from_an_integrated_feed_and_bioenergy_agroforestry_system_in_UK","326363878_Digestion_of_wood-based_hemicellulose_extracts_as_screened_by_in_vitro_gas_production_method_and_verified_in_vivo_using_sheep","322882392_Ruminal_degradation_and_intestinal_digestibility_of_camelina_meal_and_carinata_meal_compared_with_other_protein_sources","320639392_Highlights_of_progress_in_silage_conservation_and_future_perspectives","320426025_Comparison_of_microalgae_and_rapeseed_meal_as_supplementary_protein_in_the_grass_silage_based_nutrition_of_dairy_cows","317590505_Nitrogen_transformations_in_modern_agriculture_and_the_role_of_biological_nitrification_inhibition","316640168_Grain_Legume_Production_and_Use_in_European_Agricultural_Systems","312948734_Production_of_sugars_from_grass_silage_after_steam_explosion_or_soaking_in_aqueous_ammonia"]}