{"id":"328275728_Reverse_Logistics_Network_Problem_using_simulated_annealing_with_and_without_Priority-algorithm","abstract":"In recent years, Reverse Logistics (RL) has become a field of importance for all organizations due to growing environmental concerns, legislation, corporate social responsibility and sustainable competitiveness. In Reverse logistics, the used or returned products are collected after their acquisition and inspected for sorting into the different categories. The next step is to disposition them for repair, remanufacturing, recycling, reuse or final disposal. Manufacturers may adopt reverse logistics by choice or by force, but they have to decide whether performing the activities themselves or outsourcing to a third party (Martin et al., 2010). Lourenço et al., (2003) described three main areas of improvement within the RL process. Firstly, companies can reduce the level of returns through the analysis of their causes. Secondly, they can work on the improvement of the return’s process and, thirdly, they can create value from the returns. This paper considers the multistage reverse Logistics Network Problem (mrLNP) proposed by Lee et al., (2008). With minimizing the total of costs to reverse logistics shipping cost. We will demonstrate the mrLNP model will be formulated as a three-stage logistics network model. Since such network design problems belong to the class of NP-hard problems we propose a Simulated Annealing (SA) and simulated annealing with priority (priSA) with special neighborhood search mechanisms to find the near optimal solution consisting of two stages. Computer simulations show the several numerical examples by using, SA, priSA and priGA(Genetic algorithm with priority-based encoding method) and effectiveness of the proposed method.","authors":["Benaissa Mounir","Ilhem Slama","Mohamed Mahjoub Dhiaf"],"meta":["September 2018Archives of Transport 47(3):7-17","DOI:10.5604/01.3001.0012.6503","Project: A traveling salesman problem with time windows for the last mile delivery in online shopping"],"references":["327440363_ANALYSIS_OF_SELECTED_TRANSPORTATION_NETWORK_STRUCTURES_BASED_ON_GRAPH_MEASURES","279279954_Selected_aspects_of_simulation_modelling_of_internal_transport_processes_performed_at_logistics_facilities","305444088_A_Closed-Loop_Logistics_Model_for_Remanufacturing","283181863_The_concept_of_genetic_programming_in_organizing_internal_transport_processes","247644368_Supply_Chain_Sourcing_in_Remanufacturing_Operations_An_Empirical_Investigation_of_Remake_Versus_Buy_Martin_Guide_and_Craighead","245280941_A_Closed-Loop_Logistics_Model_for_Remanufacturing","233544172_A_Lagrangian_relaxation_heuristic_for_solving_the_multi-echelon_multi-commodity_close-loop_supply_chain_network_design_problem","227323431_Business_Case_Oce_Reverse_Logistic_Network_Re-Design_for_Copiers","226307627_A_genetic_algorithm_for_two-stage_transportation_problem_using_priority-based_encoding","224877317_Equation_of_State_Calculations_by_Fast_Computing_Machines"]}