{"id":"328240662_RDF_presentation_and_correct_content_conveyance_for_legacy_services_and_the_web_of_things","abstract":"RDF aims at being the universal abstract data model for structured data on the Web. However, the vast majority of web services consume and expose non-RDF data, and it is unlikely that all these services be converted to RDF one day. This is especially true for sensors and other devices in the Web of Things, as most RDF formats are verbose while constrained devices prefer to consume and expose data in concise formats. In this paper, we propose an approach to make these services and things reach semantic interoperability, while letting them the freedom to use their preferred formats. Our approach is rooted in the Web's architectural principles and the linked data principles, and relies on the definition of RDF presentations, which describe the link between RDF graphs and their representations. We introduce the RDF Presentation ontology (RDFP) that can be used to model inputs and outputs of procedures of the new Semantic Sensor Network ontology (SOSA/SSN), and input-Data and output Data of interaction patterns of things in the W3C WoT Thing Description ontology. We then propose practical solutions for web agents to be able to discover how a message content can be interpreted as RDF, generated from RDF, or validated, with different Web interaction protocols.","authors":["Maxime Lefrançois"],"meta":["October 2018","DOI:10.1145/3277593.3277618","Conference: the 8th International Conference"],"references":["325529618_HDTQ_Managing_RDF_Datasets_in_Compressed_Space","319393385_Towards_the_Web_of_Things_Web_Mashups_for_Embedded_Devices","283230216_IoT_interoperability_A_hub-based_approach","327836200_Semantic_Sensor_Network_Ontology","325529769_Towards_a_Binary_Object_Notation_for_RDF","319393851_Turtle_--_Terse_RDF_Triple_Language","317806290_Flexible_RDF_Generation_from_RDF_and_Heterogeneous_Data_Sources_with_SPARQL-Generate","309173720_A_Transformation_Language_for_RDF_Based_on_SPARQL","289924774_Validating_and_Describing_Linked_Data_Portals_using_RDF_Shape_Expressions","280113747_Architecture_of_the_World_Wide_Web_Volume_One"]}