{"id":"328214829_Can_computers_help_to_sharpen_our_understanding_of_ontological_arguments","abstract":"In the past decades, several emendations of Gödel’s (resp.Scott’s) modal ontological argument have been proposed, many of which preserve the intended conclusion (the necessary existence of God), while avoiding a controversial side result of the Gödel/Scott variant called the “modal collapse”, which expresses that there are no contingent truths (everything is determined, there is no free will). In this paper we provide a summary on recent computer-supported veri- fication studies on some of these modern variants of the ontological argument. The purpose is to provide further evidence that the interaction with the computer technology, which we have developed together with colleagues over the past years, can not only enable the formal assessment of ontological arguments, but can, in fact, help to sharpen our conceptual understanding of the notions and concepts involved. From a more abstract perspective, we claim that interreligious understanding may be fostered by means of formal argumentation and, in particular, formal logical analysis supported by modern interactive and automated theorem proving technology.","authors":["Christoph Benzmüller","David Fuenmayor"],"meta":["October 2018","Conference: 11th AISSQ Conference \"Mathematics & Reality\"At: Bhubaneswar, India","Project: Studies in Computational Metaphysics"],"references":["318036219_Automating_Emendations_of_the_Ontological_Argument_in_Intensional_Higher-Order_Modal_Logic","317956529_Types_Tableaus_and_Godel's_God_in_IsabelleHOL","301295955_The_Inconsistency_in_Godel's_Ontological_Argument_A_Success_Story_for_AI_in_Metaphysics","271584989_COMPUTER-ASSISTED_ANALYSIS_OF_THE_ANDERSON-HAJEK_ONTOLOGICAL_CONTROVERSY","232973323_A_Computationally-Discovered_Simplification_of_the_Ontological_Argument","275282336_Some_Emendations_of_Godel's_Ontological_Proof","270339890_A_note_on_Godel's_ontological_argument","265946028_Logic_and_Theism_Arguments_For_and_Against_Beliefs_in_God","254207433_Godel's_Ontological_Proof_Revisited","220297679_A_New_Small_Emendation_of_Godel's_Ontological_Proof"]}