{"id":"328248344_RDF4Led_an_RDF_engine_for_lightweight_edge_devices","abstract":"Semantic interoperability for the Internet of Things(IoT) is being enabled by standards and technologies from the Semantic Web. As recent research suggests a move towards decentralised IoT architectures, our focus is on how to enable scalable and robust RDF engines that can be embedded throughout the architecture, in particular at edge nodes. RDF processing at edge enables the creation of semantic integration gateways for locally connected low-level devices. We introduce a lightweight RDF engine, which comprises of RDF storage and SPARQL processor, for the lightweight edge devices, called RDF4Led. RDF4Led follows the RISCstyle (Reduce Instruction Set Computer) design philosophy. The design comprises a flash-aware storage structure, an indexing scheme and a low-memory-footprint join algorithm which improves scalability as well as robustness over competing solutions. With a significantly smaller memory footprint, we show that RDF4Led can handle 2 to 5 times more data than RDF engines such as Jena TDB and Virtuoso. On three types of ARM boards, RDF4Led requires 10--30% memory of its competitors to operate up to 30 million triples dataset; it can perform faster updates and can scale better than Jena TDB and Virtuoso. Furthermore, we demonstrate considerably faster query operations than Jena TDB.","authors":["Le Tuan Anh","Conor Hayes","Marcin Wylot","Danh Le Phuoc"],"meta":["October 2018","DOI:10.1145/3277593.3277600","Conference: the 8th International Conference","Project: SMARTER: A Scalable and Elastic Platform for Near-Realtime Analytics on The Graph of Everything"],"references":["319276546_Recipes_for_IoT_Applications","313096576_IFCIoT_Integrated_Fog_Cloud_IoT_Architectural_Paradigm_for_Future_Internet_of_Things","291823634_Diversified_Stress_Testing_of_RDF_Data_Management_Systems","268443131_Querying_Heterogeneous_Personal_Information_On_The_Go","265130707_Semantic_Interoperability_Architecture_for_Pervasive_Computing_and_Internet_of_Things","320899445_mu_m_RDF_Store_Towards_Extending_the_Semantic_Web_to_Embedded_Devices","320208067_Edge_Computing","312109957_The_Emergence_of_Edge_Computing","302869086_A_Survey_of_the-State-of-the-Art_B-tree_Index_on_Flash_Memory","277758275_Using_low_latency_storage_to_improve_RDF_store_performance"]}