{"id":"328233509_New_Approach_for_Comparison_of_Countries'_Achievements_in_Science_Olympiads","abstract":"There are several International Olympiads for secondary school students (for example, mathematics, physics, chemistry, biology and informatics). These Olympiads are not just a science competition, but a means to care for talent in the particular science. The goal of this paper is to identify the necessary topics important for good results at these international contests, and to compare the contest systems for the countries in South Eastern Europe, in the field of Informatics (Computer Science), as a region that is one of the prominent world regions in the context of high results in the international competitions. Here, we provide comparison through detailed analysis of several countries, and further we present a new approach that may be used to compare the achievements of the countries based on the results that students achieved at these competitions. Finally, we present an application of this approach on the results of some of the discussed countries compared to Macedonia. We strongly believe that the paper will provide a valuable content and approach for the entities involved in the organization of the contests, to measure their results compared to other countries, to use the information for improvement, and to use their achievements to raise awareness among the government institutions and companies in order to get support from them.","authors":["Mile Jovanov","Marija Mihova","Bojan Kostadinov","Emil Stankov"],"meta":["September 2018OLYMPIADS IN INFORMATICS 12:53-68","DOI:10.15388/ioi.2018.05"],"references":["282221736_Informatics_Olympiads_in_Turkey_Team_Selection_and_Training","279203433_Different_Approaches_for_Making_the_Initial_Selection_of_Talented_Students_in_Programming_Competitions","275031384_Informatics_at_school_-_Worldwide_def","267239148_A_New_Design_of_a_System_for_Contest_Management_and_Grading_in_Informatics_Competitions","254896016_Beyond_the_competitive_aspect_of_the_IOI_it_is_all_about_caring_for_talent"]}