{"id":"328250956_The_Science_of_Computing_Shaping_a_Discipline","abstract":"The identity of computing has been fiercely debated throughout its short history. Why is it still so hard to define computing as an academic discipline? Is computing a scientific, mathematical, or engineering discipline? By describing the mathematical, engineering, and scientific traditions of computing, The Science of Computing: Shaping a Discipline presents a rich picture of computing from the viewpoints of the field’s champions. The book helps readers understand the debates about computing as a discipline. It explains the context of computing’s central debates and portrays a broad perspective of the discipline. The book first looks at computing as a formal, theoretical discipline that is in many ways similar to mathematics, yet different in crucial ways. It traces a number of discussions about the theoretical nature of computing from the field’s intellectual origins in mathematical logic to modern views of the role of theory in computing. The book then explores the debates about computing as an engineering discipline, from the central technical innovations to the birth of the modern technical paradigm of computing to computing’s arrival as a new technical profession to software engineering gradually becoming an academic discipline. It presents arguments for and against the view of computing as engineering within the context of software production and analyzes the clash between the theoretical and practical mindsets. The book concludes with the view of computing as a science in its own right—not just as a tool for other sciences. It covers the early identity debates of computing, various views of computing as a science, and some famous characterizations of the discipline. It also addresses the experimental computer science debate, the view of computing as a natural science, and the algorithmization of sciences.","authors":["Matti Tedre"],"meta":["December 2014","DOI:10.1201/b17764","ISBN: 9780429159572"],"references":["234813593_Science_and_Computer_Science","234793340_Closing_the_Gap_between_the_university_and_industry_in_computer_science","3330537_Celebrating_the_birth_of_modern_computing_The_fiftieth_anniversary_of_a_discovery_at_the_Moore_School_of_Engineering_of_the_University_of_Pennsylvania"]}