{"id":"328394982_Semantic_information_autonomous_agency_and_non-equilibrium_statistical_physics","abstract":"Shannon information theory provides various measures of so-called syntactic information, which reflect the amount of statistical correlation between systems. By contrast, the concept of 'semantic information' refers to those correlations which carry significance or 'meaning' for a given system. Semantic information plays an important role in many fields, including biology, cognitive science and philosophy, and there has been a long-standing interest in formulating a broadly applicable and formal theory of semantic information. In this paper, we introduce such a theory. We define semantic information as the syntactic information that a physical system has about its environment which is causally necessary for the system to maintain its own existence. 'Causal necessity' is defined in terms of counter-factual interventions which scramble correlations between the system and its environment, while 'maintaining existence' is defined in terms of the system's ability to keep itself in a low entropy state. We also use recent results in non-equilibrium statistical physics to analyse semantic information from a thermodynamic point of view. Our framework is grounded in the intrinsic dynamics of a system coupled to an environment, and is applicable to any physical system, living or otherwise. It leads to formal definitions of several concepts that have been intuitively understood to be related to semantic information, including 'value of information', 'semantic content' and 'agency'.","authors":["Artemy Kolchinsky","David H. Wolpert"],"meta":["December 2018Interface focus: a theme supplement of Journal of the Royal Society interface 8(6):20180041","DOI:10.1098/rsfs.2018.0041"],"references":["318814374_Life_efficiency_does_not_always_increase_with_the_dissipation_rate","317558367_Action_and_perception_for_spatiotemporal_patterns","330868274_Sex_and_Death_An_Introduction_to_Philosophy_of_Biology","325444807_Meaning_and_Intentionality_Information_Evolution","324396684_Game_Theory","319639537_Action_and_perception_for_spatiotemporal_patterns","319370430_A_characterization_of_the_Shannon_ordering_of_communication_channels","319363462_On_the_input-degradedness_and_input-equivalence_between_channels","317649805_The_thermodynamic_efficiency_of_computations_made_in_cells_across_the_range_of_life","317215817_When_is_a_bit_worth_much_more_than_kT_ln2"]}