{"id":"328367514_The_Old_'New'_Dignitarianism","abstract":"Developments in fields as diverse as biotechnology, animal cognition, and computer science have cast serious doubt on the common belief that human beings are unique and that only they should have dignity and basic rights. A movement referred to as ‘new dignitarianism’ has recently reclaimed human dignity to fend off the threats to human uniqueness that it perceives to arise from these developments. This ‘new’ dignitarianism, however, is not new at all. Drawing on a debate between two Enlightenment philosophers, this article shows that dignitarianism has already surfaced in the eighteenth century as the negative image of another movement: naturalism. Building on this historical account, I propose to understand dignitarianism and naturalism as opposing ideal-types on a normative spectrum. Doing so allows us to see a thus-far neglected problem, which I call the Zero-Sum Problem: any gains a concrete theory makes by approximating one ideal-type, it loses by moving away from the other. I end by showing how accepting this fact is a first step to more practically viable theories that attempt to find a middle ground between the two ideal-types.","authors":["Raffael N. Fasel"],"meta":["November 2019Res Publica 25(4)","DOI:10.1007/s11158-018-09411-2"],"references":["320397589_Human_Rights_without_human_supremacism","318015852_Dignity_in_the_21st_Century","308486431_To_be_human_nonetheless_remains_a_decision_Humanism_as_decisionism_in_contemporary_critical_political_theory","347534229_Dignity_Its_History_and_Meaning","347146255_Nature_Human_Nature_and_Human_Difference_Race_in_Early_Modern_Philosophy","333944732_Human_Dignity","333886761_A_Theory_of_Justice","333884222_Justice_for_Hedgehogs","327624468_One_Another's_Equals_The_Basis_of_Human_Equality","301987820_Human_Rights_Beyond_Naturalism","299403199_'Humane_Intervention'_The_International_Protection_of_Animal_Rights","301987052_Human_Rights_and_Human_Nature_Introduction","299882636_Human_Dignity_Human_Rights_and_Simply_Trying_to_Do_the_Right_Thing","299880342_Human_Rights_Human_Dignityand_Human_Experience","299873515_On_the_Foundations_of_Human_Rights"]}