{"id":"328383406_Cognitive_conflict_strategy_to_minimize_students'_misconception_on_the_topic_of_addition_of_algebraic_expression","abstract":"Students' misconception on algebra needs more attention. Implementation of cognitive conflict strategy is needed to minimize student misconception. Learning instruments on algebra operation using a cognitive conflict strategy have been developed using the ADDIE model. The learning instruments consist of a lesson plan, worksheet, and diagnostic test. This paper describes the test result on the addition and subtraction of algebraic expression based on the learning instruments developed. The subjects were 20 students of a junior high school in Lhokseumawe, Aceh, Indonesia. Research instruments used were teacher self-reflection sheet to see how relevant the lesson plan is with the learning implementation. The learning process began with motivating the students through the problems related to their daily activities followed by working on the cognitive conflict test, presenting the result, and discussing the answers. In this phase, the teacher ensured that the students' concept was aligned with the scientific concept. In the next step, the students wrote a self-reflection to find out the differences between the initial concept and the new one. At the end of the learning, they did individual tasks related to the topic. Generally, conceptual changes found are quite good even though few students still faced misconception. However, it can be concluded that the cognitive conflict learning strategy could minimize student misconception on the topic of algebra.","authors":["Irawati","C M Zubainur","R M Ali"],"meta":["September 2018Journal of Physics Conference Series 1088(1):012084","DOI:10.1088/1742-6596/1088/1/012084"],"references":["262198657_Grade_9_Learners'_Errors_And_Misconceptions_In_Addition_Of_Fractions","286059899_Instructional_design_The_ADDIE_approach","249797836_Functions_Graphs_and_Graphing_Tasks_Learning_and_Teaching","227651397_Development_of_an_instrument_for_measuring_cognitive_conflict_in_secondary-level_science_class","222902512_Effect_of_animation_enhanced_conceptual_change_texts_on_6th_grade_students'_understanding_of_the_particulate_nature_of_matter_and_transformation_during_phase_changes","26466234_Fostering_Conceptual_Change_by_Cognitive_Conflict_Based_Instruction_on_Students'_Understanding_of_Heat_and_Temperature_Concepts"]}