{"id":"328377486_Measuring_transient_phase-amplitude_coupling_using_local_mutual_information","abstract":"Here we demonstrate the suitability of a local mutual information measure for estimating the temporal dynamics of cross-frequency coupling (CFC) in brain electrophysiological signals. In CFC, concurrent activity streams in different frequency ranges interact and transiently couple. A particular form of CFC, phase-amplitude coupling (PAC), has raised interest given the growing amount of evidence of its possible role in healthy and pathological brain information processing. Although several methods have been proposed for PAC estimation, only a few have addressed the estimation of the temporal evolution of PAC, and these typically require a large number of experimental trials to return a reliable estimate. Here we explore the use of mutual information to estimate a PAC measure (MIPAC) in both continuous and event-related multi-trial data. To validate these two applications of the proposed method, we first apply it to a set of simulated phase-amplitude modulated signals and show that MIPAC can successfully recover the temporal dynamics of the simulated coupling in either continuous or multi-trial data. Finally, to explore the use of MIPAC to analyze data from human event-related paradigms, we apply it to an actual event-related human electrocorticographic (ECoG) data set that exhibits strong PAC, demonstrating that the MIPAC estimator can be used to successfully characterize amplitude-modulation dynamics in electrophysiological data.","authors":["Ramon Martinez-Cancino","Joseph Heng","Arnaud Delorme","Ken Kreutz-Delgado"],"meta":["October 2018NeuroImage 185","DOI:10.1016/j.neuroimage.2018.10.034"],"references":["321735106_Non-linear_auto-regressive_models_for_cross-frequency_coupling_in_neural_time_series","320249206_Permutation_Mutual_Information_A_Novel_Approach_for_Measuring_Neuronal_Phase-Amplitude_Coupling","313170906_Word_association_norms_mutual_information_and_lexicography","312854561_EEGLAB_an_open_source_toolbox_for_analysis_of_single-trial_EEG_dynamics","312248019_Discriminating_Valid_from_Spurious_Indices_of_Phase-Amplitude_Coupling","310587799_A_statistical_framework_for_neuroimaging_data_analysis_based_on_mutual_information_estimated_via_a_Gaussian_copula","309622276_Topology_Cross-Frequency_and_Same-Frequency_Band_Interactions_Shape_the_Generation_of_Phase-Amplitude_Coupling_in_a_Neural_Mass_Model_of_a_Cortical_Column","306530843_Phase-amplitude_coupling_at_the_organism_level_The_amplitude_of_spontaneous_alpha_rhythm_fluctuations_varies_with_the_phase_of_the_infra-slow_gastric_basal_rhythm","321613059_Directed_Information_Measures_in_Neuroscience","299762833_Interictal_high-frequency_oscillations_generated_by_seizure_onset_and_eloquent_areas_may_be_differentially_coupled_with_different_slow_waves"]}