{"id":"328399451_A_Comparison_of_Graph_Construction_Methods_for_Semi-Supervised_Learning","abstract":"Graph-based methods are among the most active approaches to semi-supervised learning. This occurs mainly due to their ability to deal with local and global characteristics of available data, identify classes or groups regardless the data shape, and to represent submanifold in Euclidean space. Graph-based methods are sensitive to graph construction and a challenge in the area is the construction of a graph to represent data patterns. Several unsupervised graph construction methods have been proposed for dealing with different issues. However, it lacks a detailed study that evaluates their properties and effectiveness. Here, we analyze the robustness of such methods for SSL classification. The graph construction methods analyzed include k-nearest neighbor (kNN), mutual kNN combined with minimum spanning tree (M-kNN), b-matching by belief propagation (BP), b-matching by greedy approximation and sequential kNN (S-kNN). Statistical analyses are carried out with respect to classification accuracy. We observe that robustness of the methods varies according to external factors, such as labeled data representativeness and parameters k or b, and internal factors, related to the topology of the network. Regular graph construction methods, b-matching and S-kNN, achieve the best results on classification and generate more homogeneous and sparse networks.","authors":["L. Berton","Alneu de Andrade Lopes","Didier Augusto Vega-Oliveros"],"meta":["July 2018","DOI:10.1109/IJCNN.2018.8489524","Conference: 2018 International Joint Conference on Neural Networks (IJCNN)","Projects: Network science and applicationsComplex Networks Applications"],"references":["282658157_Link_prediction_in_graph_construction_for_supervised_and_semi-supervised_learning","263004448_Regular_graph_construction_for_semi-supervised_learning","311394524_RGCLI_Robust_Graph_that_Considers_Labeled_Instances_for_Semi-Supervised_Learning","305186835_Graph_Construction_with_Label_Information_for_Semi-Supervised_Learning","281405591_Laplacian_Regularized_Low-Rank_Representation_and_Its_Applications","272825857_UCI_Machine_Learning_Repository","258161092_Semi-supervised_classification_based_on_subspace_sparse_representation","257482010_Adaptive_semi-supervised_learning_on_labeled_and_unlabeled_data_with_different_distributions","253730180_Manifold_Regularization_and_Semi-supervised_Learning_Some_Theoretical_Analyses","236023962_Non-Negative_Low_Rank_and_Sparse_Graph_for_Semi-Supervised_Learning"]}