{"id":"328341314_Ls-II_An_Improved_Locust_Search_Algorithm_for_Solving_Optimization_Problems","abstract":"The Locust Search (LS) algorithm is a swarm-based optimization method inspired in the natural behavior of the desert locust. LS considers the inclusion of two distinctive nature-inspired search mechanism, namely, their solitary phase and social phase operators. These interesting search schemes allow LS to overcome some of the difficulties that commonly affect other similar methods, such as premature convergence and the lack of diversity on solutions. Recently, computer vision experiments in insect tracking methods have conducted to the development of more accurate locust motion models than those produced by simple behavior observations. The most distinctive characteristic of such new models is the use of probabilities to emulate the locust decision process. In this paper, a modification to the original LS algorithm, referred to as LS-II, is proposed to better handle global optimization problems. In LS-II, the locust motion model of the original algorithm is modified incorporating the main characteristics of the new biological formulations. As a result, LS-II improves its original capacities of exploration and exploitation of the search space. In order to test its performance, the proposed LS-II method is compared against several the state-of-the-art evolutionary methods considering a set of benchmark functions and engineering problems. Experimental results demonstrate the superior performance of the proposed approach in terms of solution quality and robustness.","authors":["Octavio Camarena","Erik Cuevas","Marco A. Pérez Cisneros","Fernando Fausto"],"meta":["October 2018Mathematical Problems in Engineering 2018(6):1-15","DOI:10.1155/2018/4148975"],"references":["327768124_A_Swarm_Approach_For_Improving_Voltage_Profiles_And_Reduce_Power_Loss_On_Electrical_Distribution_Networks","319469381_A_template_matching_approach_based_on_the_behavior_of_swarms_of_locust","318506635_Parameter_Estimation_for_Chaotic_Fractional_Systems_by_Using_the_Locust_Search_Algorithm","286986848_Locust_Collective_Motion_and_Its_Modeling","284182719_An_optimisation_algorithm_based_on_the_behaviour_of_locust_swarms","284182445_An_optimisation_algorithm_based_on_the_behaviour_of_locust_swarms","281445768_Multithreshold_Segmentation_by_Using_an_Algorithm_Based_on_the_Behavior_of_Locust_Swarms","337932102_Engineering_Optimization_Theory_and_Practice","311756115_Distribution_system_reconfiguration_for_power_loss_minimization_and_voltage_profile_improvement_using_Modified_particle_swarm_optimization","271644099_Introduction_To_Optimum_Design"]}