{"id":"328323265_A_Study_of_Hedonic_Experience_Related_to_UX_Capture_Techniques","abstract":"Aiming to meet users' expectations, the technological products need to be attractive to people, such as the sense of the immersion experienced when reading an enjoyable book, a challenge destination during a good game or a fascination with the unfolding of a drama. The main challenge to recover from this status is to overcome the obstacle, make interactive experiences memorable, satisfying, enjoyable and rewarding. In this context, techniques to evaluate the User eXperience (UX) are trying to identify different feelings. Several UX evaluation proposed in the literature can identify feelings. So, this study makes an analysis of the explicit emotions in the UX techniques with a method coming from psychology. The result was mapped on the Circumplex Model of Affect and correlated with the simplified model present in the Emocards technique. The studies make possible to identify the feelings captured by each UX technique, in this way, allowing the evaluators to choose the right technique for their needs.","authors":["João Batista da Silva Júnior","Artur Henrique Kronbauer"],"meta":["October 2018","DOI:10.1145/3274192.3274196","Conference: the 17th Brazilian Symposium","Project: Evaluating the User Experience in Different Contexts"],"references":["313757692_Measuring_emotion_Development_and_application_of_an_instrument_to_Measure_Emotional_Responses_to_Products","305365692_Poster_Crowdsourcing_for_User_ExperienceUX_Evaluation","329647379_Technology_as_Experience","323506243_A_Systematic_Mapping_Study_on_Research_Contributions_on_UX_Evaluation_Technologies","319439457_Designing_for_delight","317272164_A_study_about_psychophysiological_measures_in_user_experience_monitoring_and_evaluation","316612011_Applied_Research_for_Advertising_Products_Tactics_for_Effective_Research","306202968_Emotion_through_expression_designing_mobile_telephones_with_an_emotional_fit","302074222_Capturing_Measuring_Emotions_in_UX","300644710_ISO_9241-11_Revised_What_Have_We_Learnt_About_Usability_Since_1998"]}