{"id":"328375100_ThoughtViz_Visualizing_Human_Thoughts_Using_Generative_Adversarial_Network","abstract":"Studying human brain signals has always gathered great attention from the scientific community. In Brain Computer Interface (BCI) research, for example, changes of brain signals in relation to specific tasks (e.g., thinking something) are detected and used to control machines. While extracting spatio-temporal cues from brain signals for classifying state of human mind is an explored path, decoding and visualizing brain states is new and futuristic. Following this latter direction, in this paper, we propose an approach that is able not only to read the mind, but also to decode and visualize human thoughts. More specifically, we analyze brain activity, recorded by an ElectroEncephaloGram (EEG), of a subject while thinking about a digit, character or an object and synthesize visually the thought item. To accomplish this, we leverage the recent progress of adversarial learning by devising a conditional Generative Adversarial Network (GAN), which takes, as input, encoded EEG signals and generates corresponding images. In addition, since collecting large EEG signals in not trivial, our GAN model allows for learning distributions with limited training data. Performance analysis carried out on three different datasets -- brain signals of multiple subjects thinking digits, characters, and objects -- show that our approach is able to effectively generate images from thoughts of a person. They also demonstrate that EEG signals encode explicitly cues from thoughts which can be effectively used for generating semantically relevant visualizations.","authors":["Praveen Tirupattur","Yogesh Rawat","Concetto Spampinato","Mubarak Shah"],"meta":["October 2018","DOI:10.1145/3240508.3240641","Conference: 2018 ACM Multimedia Conference"],"references":["320127950_Envisioned_speech_recognition_using_EEG_sensors","318965745_Deep_learning_with_convolutional_neural_networks_for_EEG_decoding_and_visualization_Convolutional_Neural_Networks_in_EEG_Analysis","323404812_Epileptic_Seizure_Detection_in_Long-Term_EEG_Recordings_by_Using_Wavelet-Based_Directed_Transfer_Function","322060307_Generative_Adversarial_Networks_Conditioned_by_Brain_Signals","320968268_DeLiGAN_Generative_Adversarial_Networks_for_Diverse_and_Limited_Data","320968038_Deep_Learning_Human_Mind_for_Automated_Visual_Classification","320541311_Brain2Image_Converting_Brain_Signals_into_Images","319770355_Generative_Adversarial_Nets","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","316466373_Real-Time_Epileptic_Seizure_Detection_Using_EEG"]}