{"id":"328389319_Data_Aggregation_Design_Goals_for_Monitoring_Data_in_Wireless_Sensor_Networks","abstract":"Energy Constraint is the most significant issue in design of any wireless sensor network application. The communication between sensor nodes (SNs) is considered to be a major issue for fast energy drain. A crucial scheme to minimize energy utilization in WSN application is in-network data aggregation. It aims to reduce duplicate transmission of data frame by filtering the duplicate and unnecessary data values and thereby reducing the energy utilization. A recent trend in WSN proposes data accuracy and data latency as essential factors for various applications. Reducing data latency helps to enhance the network lifetime and also in detection of early events. Every SN has to wait for a predefined (which can be fixed or variable) time interval known as waiting time (WT) before performing aggregation function, in order to collect readings from other SNs. Data latency will be reduced and data accuracy will be increased if all SNs are well planned by a most favorable allocation of WT. Several solutions have been proposed for routing and aggregating data in WSN in order to maximize network lifetime and throughput. This study presents the classification of data aggregation design goals. Moreover we have analyzed each goal over it proficiency like data accuracy, data latency and energy utilization.","authors":["Khushboo Jain","Anup Bhola"],"meta":["October 2018","DOI:10.5281/zenodo.1464554","Conference: International Conference on Communication and Communicating TechnologyAt: ACM - G L Bajaj, Greater NoidaVolume: ICCCT-2018"],"references":["325966723_Data_Collection_Method_to_Improve_Energy_Efficiency_in_Wireless_Sensor_Network","325966558_A_Novel_Energy-Efficient_Protocol_for_WSN_based_on_Optimal_Chain_Routing","264937760_Data_Aggregation_Scheduling_Algorithms_in_Wireless_Sensor_Networks_Solutions_and_Challenges","224087293_A_methodology_for_power_consumption_evaluation_of_wireless_sensor_networks","220445859_A_line_in_the_sand_A_wireless_sensor_network_for_target_detection_classification_and_tracking","220419284_Forest_Fire_Modeling_and_Early_Detection_using_Wireless_Sensor_Networks","260671136_Survey_on_Latency_Issues_of_Asynchronous_MAC_Protocols_in_Delay-Sensitive_Wireless_Sensor_Networks","221091494_The_national_weather_sensor_grid","220443085_A_Combinatorial_Algorithmic_Approach_to_Energy_Efficient_Information_Collection_In_Wireless_Sensor_Networks","215619042_TinyDB_An_Acquisitional_Query_Processing_System_for_Sensor_Networks"]}