{"id":"328367839_Students'_Evidential_Increase_in_Learning_Using_Gamified_Learning_Environment_Volume_1","abstract":"Gamification has been amazing in the past few years as it has cover education and training due to continue technological innovation. It is evidential that Gamification increases participation, motivation and engagement. However, gamification design and implementation fail to achieve desirable outcome in education due to poor design and mainly the gamification environment that is being gamified. This research paper is aimed at mapping game elements in a well-known generally accepted Learning Management System. This provides a gamification environment that addresses limitation of gamification in education. A gamified course in learning management system (GCLMS) is developed to study increase in student, learning from GCLMS. Steps and levels of the gamification environment is shown with an evidential prove of how GCLMS increase students learning through an initial evaluation. Feedback results from students increase in learning and confidence in applying what they learnt from the GCLMS in real life scenario. This research was carried out on 47 second year undergraduate nursing students.","authors":["Vanye Vanduhe","H. F. Hassan","Dokun Oluwajana","M. Nat"],"meta":["January 2019","DOI:10.1007/978-3-030-02686-8_82","In book: Proceedings of the Future Technologies Conference (FTC) 2018 (pp.1109-1122)","Project: The Adoption of Students’ Hedonic Motivation System Model to Gamified Learning Environment"],"references":["323381320_Points_for_Posts_and_Badges_to_Brand_Advocates_The_Role_of_Gamification_in_Consumer_Brand_Engagement","322288130_A_Design_Framework_for_Adaptive_Gamification_Applications","322084896_An_Empirical_Study_on_the_Use_of_Gamification_on_IT_Courses_at_Higher_Education","319732563_Gamified_Digital_Services_How_Gameful_Experiences_Drive_Continued_Service_Usage","314189678_Linking_serious_game_narratives_with_pedagogical_theories_and_pedagogical_design_strategies","323333521_A_standard-based_architecture_to_support_learning_interoperability_A_practical_experience_in_gamification","323102838_An_exploratory_study_of_student_engagement_in_gamified_online_discussions","322932698_Applying_game_mechanics_and_student-generated_questions_to_an_online_puzzle-based_game_learning_system_to_promote_algorithmic_thinking_skills","320185481_A_Qualitative_Investigation_of_Student_Perceptions_of_Game_Elements_in_a_Gamified_Course","319997872_Gamification"]}