{"id":"328348112_A_Conceptual_Framework_for_Assessing_an_Organization's_Readiness_to_Adopt_Big_Data","abstract":"The main aim of this paper is to provide a theoretically and empirically grounded discussion on big data and to propose a conceptual framework for big data based on a temporal dimension. This study adopts two research methods. The first research method is a critical assessment of the literature that aims to identify the concept of big data in organizations. This method is composed of a search for source materials, the selection of the source materials, and their analysis and synthesis. It has been used to develop a conceptual framework for assessing an organization’s readiness to adopt big data. The purpose of the second research method is to provide an initial verification of the developed framework. This verification consisted of conducting qualitative research with the use of an in-depth interview in 15 selected organizations. The main contribution of this study is the Temporal Big Data Maturity Model (TBDMM) framework, which can help to measure the current state of an organization’s big data assets, and to plan their future development with respect to sustainability issues. The proposed framework has been built over a time dimension as a fundamental internal structure with the goal of providing a complete means for assessing an organization’s readiness to process the temporal data and knowledge that can be found in modern information sources. The proposed framework distinguishes five maturity levels: atemporal, pre-temporal, partly temporal, predominantly temporal, and temporal, which are used to evaluate data/knowledge, information technology (IT) solutions, functionalities offered by IT solutions, and the sustainable development context.","authors":["Celina M. Olszak","Maria Mach-Król"],"meta":["October 2018Sustainability 10(10):3734","DOI:10.3390/su10103734"],"references":["325117456_IOT_And_Big_Data_Analytics_In_E-Learning_A_Technological_Perspective_and_Review","323927174_Data_Science_as_an_Innovation_Challenge_From_Big_Data_to_Value_Proposition","323382119_Smart_Objects_An_Active_Big_Data_Approach","320655094_An_Overview_of_Information_Tools_and_Technologies_for_Competitive_Intelligence_Building_Theoretical_Approach","318608977_Governing_the_Complexity_of_Smart_Data_Cities_Setting_a_Research_Agenda","318449845_Big_data_analytics_capabilities_a_systematic_literature_review_and_research_agenda","317541587_Big_Data_in_Electronic_Markets","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","307612722_Big_data_analytics","307013969_How_to_improve_firm_performance_using_big_data_analytics_capability_and_business_strategy_alignment"]}