{"id":"328387910_AAPM_medical_physics_practice_guideline_10a_Scope_of_practice_for_clinical_medical_physics","abstract":"The American Association of Physicists in Medicine (AAPM) is a nonprofit professional society whose primary purposes are to advance the science, education, and professional practice of medical physics. The AAPM has more than 8000 members and is the principal organization of medical physicists in the United States. The AAPM will periodically define new practice guidelines for medical physics practice to help advance the science of medical physics and to improve the quality of service to patients throughout the United States. Existing medical physics practice guidelines will be reviewed for the purpose of revision or renewal, as appropriate, on their fifth anniversary or sooner. Each medical physics practice guideline (MPPG) represents a policy statement by the AAPM, has undergone a thorough consensus process in which it has been subjected to extensive review, and requires the approval of the Professional Council. The medical physics practice guidelines recognize that the safe and effective use of diagnostic and therapeutic radiation requires specific training, skills, and techniques as described in each document. As the review of the previous version of AAPM Professional Policy (PP)‐17 (Scope of Practice) progressed, the writing group focused on one of the main goals: to have this document accepted by regulatory and accrediting bodies. After much discussion, it was decided that this goal would be better served through a MPPG. To further advance this goal, the text was updated to reflect the rationale and processes by which the activities in the scope of practice were identified and categorized. Lastly, the AAPM Professional Council believes that this document has benefitted from public comment which is part of the MPPG process but not the AAPM Professional Policy approval process. The following terms are used in the AAPM's MPPGs: Must and Must Not: Used to indicate that adherence to the recommendation is considered necessary to conform to this practice guideline. Should and Should Not: Used to indicate a prudent practice to which exceptions may occasionally be made in appropriate circumstances.","authors":["Jessica B Clements"],"meta":["October 2018Journal of Applied Clinical Medical Physics 19(6)","DOI:10.1002/acm2.12469"],"references":[]}