{"id":"328370177_Stimuli_and_sensors_that_initiate_skeletal_muscle_hypertrophy_following_resistance_exercise","abstract":"One of the most striking adaptations to exercise is the skeletal muscle hypertrophy that occurs in response to resistance exercise. A large body of work shows that a mTORC1-mediated increase of muscle protein synthesis is the key, but not sole, mechanism by which resistance exercise causes muscle hypertrophy. Whilst much of the hypertrophy signaling cascade has been identified, the initiating, resistance exercise-induced and hypertrophy-stimulating stimuli have remained elusive. For the purpose of this review, we define an initiating, resistance exercise-induced and hypertrophy-stimulating signal as \"hypertrophy stimulus\", and the sensor of such a signal as \"hypertrophy sensor\". In this review we discuss our current knowledge of specific mechanical stimuli, damage/injury-associated and metabolic stress-associated triggers as potential hypertrophy stimuli. Mechanical signals are the prime hypertrophy stimuli candidates and a Filamin-C-BAG3-dependent regulation of mTORC1, Hippo and autophagy signalling is a plausible albeit still incompletely characterised hypertrophy sensor. Other candidate mechanosensing mechanisms are nuclear deformation-initiated signalling or several mechanisms related to costameres, which are the functional equivalents of focal adhesions in other cells. Whilst exercise-induced muscle damage is probably not essential for hypertrophy, it is still unclear whether and how such muscle damage could augment a hypertrophic response. Interventions that combine blood flow restriction and especially low load resistance exercise suggest that resistance exercise-regulated metabolites could be hypertrophy stimuli but this is based on indirect evidence and metabolite candidates are poorly characterised.","authors":["Henning Wackerhage","Brad J Schoenfeld","David Lee Hamilton","Maarit Lehti"],"meta":["October 2018Journal of Applied Physiology: Respiratory, Environmental and Exercise Physiology 126(1)","DOI:10.1152/japplphysiol.00685.2018"],"references":["327454079_Type_1_Muscle_Fiber_Hypertrophy_after_Blood_Flow-restricted_Training_in_Powerlifters","327162001_RAP2_mediates_mechanoresponses_of_the_Hippo_pathway","325297870_Genes_Whose_Gain_or_Loss-Of-Function_Increases_Skeletal_Muscle_Mass_in_Mice_A_Systematic_Literature_Review","323944795_Effects_of_different_intensities_of_resistance_training_with_equated_volume_load_on_muscle_strength_and_hypertrophy","322679006_Assessing_the_Role_of_Muscle_Protein_Breakdown_in_Response_to_Nutrition_and_Exercise_in_Humans","324168999_Autophagy_is_induced_by_resistance_exercise_in_young_men_but_unfolded_protein_response_is_induced_regardless_of_age","323577751_Muscle_Fiber_Hypertrophy_and_Myonuclei_Addition_A_Systematic_Review_and_Meta-analysis","323006219_Regional_regulation_of_focal_adhesion_kinase_after_concentric_and_eccentric_loading_is_related_to_remodeling_of_human_skeletal_muscle","322777543_Lactate_increases_myotube_diameter_via_activation_of_MEKERK_pathway_in_C2C12_cells","322550608_The_Hippo_Signaling_Pathway_in_the_Regulation_of_Skeletal_Muscle_Mass_and_Function"]}