{"id":"328460590_Preparing_for_the_Unexpected_Diversity_Improves_Planning_Resilience_in_Evolutionary_Algorithms","abstract":"As automatic optimization techniques find their way into industrial applications, the behavior of many complex systems is determined by some form of planner picking the right actions to optimize a given objective function. In many cases, the mapping of plans to objective reward may change due to unforeseen events or circumstances in the real world. In those cases, the planner usually needs some additional effort to adjust to the changed situation and reach its previous level of performance. Whenever we still need to continue polling the planner even during re-planning, it oftentimes exhibits severely lacking performance. In order to improve the planner's resilience to unforeseen change, we argue that maintaining a certain level of diversity amongst the considered plans at all times should be added to the planner's objective. Effectively, we encourage the planner to keep alternative plans to its currently best solution. As an example case, we implement a diversity-aware genetic algorithm using two different metrics for diversity (differing in their generality) and show that the blow in performance due to unexpected change can be severely lessened in the average case. We also analyze the parameter settings necessary for these techniques in order to gain an intuition how they can be incorporated into larger frameworks or process models for software and systems engineering.","authors":["Thomas Gabor","Lenz Belzner","Thomy Phan","Kyrill Schmid"],"meta":["September 2018","DOI:10.1109/ICAC.2018.00023","Conference: 2018 IEEE International Conference on Autonomic Computing (ICAC)"],"references":["326907063_Inheritance-Based_Diversity_Measures_for_Explicit_Convergence_Control_in_Evolutionary_Algorithms","324647109_Evolution_of_a_Functionally_Diverse_Swarm_via_a_Novel_Decentralised_Quality-Diversity_Algorithm","320747852_Rolling_horizon_evolution_enhancements_in_general_video_game_playing","320473480_Mastering_the_game_of_Go_without_human_knowledge","316599018_Genealogical_Distance_as_a_Diversity_Estimate_in_Evolutionary_Algorithms","326567654_Managing_uncertainty_in_self-adaptive_systems_with_plan_reuse_and_stochastic_search","321586551_Software_Engineering_for_Collective_Autonomic_Systems_The_ASCENS_Approach","320707776_Distributional_Reinforcement_Learning_with_Quantile_Regression","318652786_A_Distributional_Perspective_on_Reinforcement_Learning","317088029_Thinking_Fast_and_Slow_with_Deep_Learning_and_Tree_Search"]}