{"id":"328488205_Remote_Sensing_Performance_Enhancement_in_Hyperspectral_Images","abstract":"Hyperspectral images with hundreds of spectral bands have been proven to yield high performance in material classification. However, despite intensive advancement in hardware, the spatial resolution is still somewhat low, as compared to that of color and multispectral (MS) imagers. In this paper, we aim at presenting some ideas that may further enhance the performance of some remote sensing applications such as border monitoring and Mars exploration using hyperspectral images. One popular approach to enhancing the spatial resolution of hyperspectral images is pansharpening. We present a brief review of recent image resolution enhancement algorithms, including single super-resolution and multi-image fusion algorithms, for hyperspectral images. Advantages and limitations of the enhancement algorithms are highlighted. Some limitations in the pansharpening process include the availability of high resolution (HR) panchromatic (pan) and/or MS images, the registration of images from multiple sources, the availability of point spread function (PSF), and reliable and consistent image quality assessment. We suggest some proactive ideas to alleviate the above issues in practice. In the event where hyperspectral images are not available, we suggest the use of band synthesis techniques to generate HR hyperspectral images from low resolution (LR) MS images. Several recent interesting applications in border monitoring and Mars exploration using hyperspectral images are presented. Finally, some future directions in this research area are highlighted.","authors":["Chiman Kwan"],"meta":["October 2018Sensors 18(11):3598","DOI:10.3390/s18113598"],"references":["328432801_Deep_Learning_with_Synthetic_Hyperspectral_Images_for_Improved_Soil_Detection_in_Multispectral_Imagery","327477165_A_Super-Resolution_and_Fusion_Approach_to_Enhancing_Hyperspectral_Images","326723251_To_Learn_Image_Super-Resolution_Use_a_GAN_to_Learn_How_to_Do_Image_Degradation_First","326719452_Automatic_Target_Recognition_System_with_Online_Machine_Learning_Capability","324175904_Assessment_of_Spatiotemporal_Fusion_Algorithms_for_Planet_and_Worldview_Images","329751194_Fast_and_Accurate_Single_Image_Super-Resolution_via_Information_Distillation_Network","329197005_Mars_Surface_Mineral_Abundance_Estimation_Using_THEMIS_and_TES_Images","327455383_Hyperspectral_Image_Denoising_Employing_a_Spatial-Spectral_Deep_Residual_Convolutional_Neural_Network","326838503_Image_Resolution_Enhancement_for_Remote_Sensing_Applications","325833622_Structured_AutoEncoders_for_Subspace_Clustering"]}