{"id":"328419632_Improved_Cross_Spectral_Iris_Matching_Using_Gradientface_Based_Normalization","abstract":"Cross-spectral iris matching utilized two different electromagnetic spectrums to recognize the iris. The iris captured in the Near Infrared spectrum (NIR) is matched with the iris acquired in the Visual light spectrum (VIS). The identification and verification become more optimal when the iris image is matched in two different spectrums and wavelengths. The most challenging issue in cross-spectral iris matching is the illumination factor. The normalised iris has low contrast and nonuniform brightness due to illumination variations between NIR and VIS that is affecting recognition performance. Gradientfaces-based normalization technique (GRF) is one of the photometric normalizations in face recognition that is illumination invariant. In this paper, we improve iris recognition performance by implementing the GRF photometric normalization into cross spectral iris domain. GRF is applied to both NIR and VIS images. Thus, the matching performance of GRF is fusing with the matching performance of Difference of Gaussian (DoG) filter and Binary Statistical Image Feature (BSIF) by using “AND” rule to obtain final decisions. Experimental result demonstrated that the combination of GRF, BSIF, and DoG results in a high recognition rate and low FAR for all thresholds used in the simulation. Also, the combination of GRF, BSIF, and DoG resulted in lower Equal Error Rate compared to the combination of MSW, BSIF, and DoG schemes","authors":["Maulisa Oktiana","Khairun Saddami","Khairul Munadi","Fitri Arnia"],"meta":["September 2018","DOI:10.1109/ICELTICS.2018.8548916","Conference: International Conference on Electrical Engineering and Informatics 2018 (ICELTICs 2018)At: Banda Aceh, Indonesia","Project: crossspectral image"],"references":["320107636_Cross-Eyed_2017_Cross-Spectral_IrisPeriocular_Recognition_Database_and_Competition","318653275_Face_Recognition_under_Varying_Lighting_Conditions_A_Combination_of_Weber-face_and_Local_Directional_Pattern_for_Feature_Extraction_and_Support_Vector_Machines_for_Classification","265741844_Enhancement_of_Iris_Recognition_System_Based_on_Phase_Only_Correlation","312248204_Improving_the_Face_Recognition_Accuracy_under_Varying_Illumination_Conditions_for_Local_Binary_Patterns_and_Local_Ternary_Patterns_Based_on_Weber-Face_and_Singular_Value_Decomposition","309814720_A_novel_framework_for_cross-spectral_iris_matching","304414949_Weber_binary_pattern_and_Weber_ternary_pattern_for_illumination-robust_face_recognition","283135495_Photometric_Normalization_Techniques_for_Illumination_Invariance","281777555_Advancing_Cross-Spectral_Iris_Recognition_Research_Using_Bi-Spectral_Imaging","261440500_Generalized_Weber-face_for_illumination-robust_face_recognition","224240937_Illumination_Normalization_Based_on_Weber's_Law_With_Application_to_Face_Recognition","220502996_Face_Recognition_Under_Varying_Illumination_Using_Gradientfaces"]}