{"id":"328439257_Identifying_Infected_Users_via_Network_Traffic","abstract":"There has been increasing interest in deeper understandings of users and user behavior to tailor and strengthen cybersecurity. Just as in the field of medicine where symptoms of a disease trigger early doctor intervention, we investigate the feasibility of extracting indicators from network traffic that can be used for proactive identification of user infection, which in turn can prompt proactive intervention from a network administrator. Using two months of wireless traffic from a large, public university, we attempt to differentiate between 1923 users with infected devices and random samples of uninfected users. We extract 36 features from the traffic and apply various dimensionality reduction techniques, unsupervised clustering methods, and supervised learning algorithms. Principal Component Analysis suggests 10 features that contribute most to explaining about 92.8% of variance in user behavior, revealing 26 features less useful for understanding users. K-means clustering partitions users in distinct groups that in the majority of cases separate the infected and uninfected users, with some clusters being composed of up to 100.0% of only one type of user. Finally, supervised learning yields accuracy values up to 79.0% and ROC AUC values up to 86.0% when classifying users as either infected or uninfected. Our work shows there is potential to derive infection ‘symptoms’ from network traffic.","authors":["Margaret Gratian","Darshan Bhansali","Michel Cukier","Josiah Dykstra"],"meta":["October 2018Computers & Security 80","DOI:10.1016/j.cose.2018.10.007","Project: Human Resilience for Cybersecurity"],"references":["331523581_Decision-making_in_Risk_Management","318475314_Profiling_Users_by_Modeling_Web_Transactions","318331660_A_novel_privacy_preserving_user_identification_approach_for_network_traffic","312572407_Behavioral_clustering_of_non-stationary_IP_flow_record_data","275099769_Behavioral-Based_Feature_Abstraction_from_Network_Traffic","266656822_On_the_effectiveness_of_risk_prediction_based_on_users_browsing_behavior","313803248_User_profiling_from_network_traffic_via_novel_application-level_interactions","312421750_Efficient_Learning_of_Communication_Profiles_from_IP_Flow_Records","312210566_Principal_Component_Analysis","310499202_Predictability_of_NetFlow_data"]}