{"id":"328431795_Review_Grass-based_dairy_systems_data_and_precision_technologies","abstract":"Precision technologies and data have had relatively modest impacts in grass-based livestock ruminant production systems compared with other agricultural sectors such as arable. Precision technologies promise increased efficiency, reduced environmental impact, improved animal health, welfare and product quality. The benefits of precision technologies have, however, been relatively slow to be realised on pasture based farms. Though there is significant overlap with indoor systems, implementing technology in grass-based dairying brings unique opportunities and challenges. The large areas animals roam and graze in pasture based systems and the associated connectivity challenges may, in part at least, explain the comparatively lower adoption of such technologies in pasture based systems. With the exception of sensor and Bluetooth-enabled plate metres, there are thus few technologies designed specifically to increase pasture utilisation. Terrestrial and satellite-based spectral analysis of pasture biomass and quality is still in the development phase. One of the key drivers of efficiency in pasture based systems has thus only been marginally impacted by precision technologies. In contrast, technological development in the area of fertility and heat detection has been significant and offers significant potential value to dairy farmers, including those in pasture based systems. A past review of sensors in health management for dairy farms concluded that although the collection of accurate data was generally achieved, the processing, integration and presentation of the resulting information and decision-support applications were inadequate. These technologies’ value to farming systems is thus unclear. As a result, it is not certain that farm management is being sufficiently improved to justify widespread adoption of precision technologies currently. We argue for a user need-driven development of technologies and for a focus on how outputs arising from precision technologies and associated decision support applications are delivered to users to maximise their value. Further cost/benefit analysis is required to determine the efficacy of investing in specific precision technologies, potentially taking account of several yet to ascertained farm specific variables.","authors":["Laurence Shalloo","M. O’ Donovan","Lorenzo Leso","J. Werner"],"meta":["October 2018animal 12(s2):1-10","DOI:10.1017/S175173111800246X","Project: Integration of precision technologies into pasture-based milking systems"],"references":["325967312_A_partial_budgeting_tool_to_assess_investments_in_precision_dairy_technologies","319278626_Evaluation_of_the_RumiWatchSystem_for_measuring_grazing_behaviour_of_cows","318580684_Future_Protein_Supply_and_Demand_Strategies_and_Factors_Influencing_a_Sustainable_Equilibrium","316865934_Machine-learning-based_calving_prediction_from_activity_lying_and_ruminating_behaviors_in_dairy_cattle","323634709_Factors_associated_with_profitability_in_pasture-based_systems_of_milk_production","320757324_Invited_review_Breeding_and_ethical_perspectives_on_genetically_modified_and_genome_edited_cattle","317330673_Evaluation_of_the_IceTag_leg_sensor_and_its_derivative_models_to_predict_behaviour_using_beef_cattle_on_rangeland","317045455_Farmers'_preferences_for_automatic_lameness-detection_systems_in_dairy_cattle","315654566_Application_of_Repeat-Pass_TerraSAR-X_Staring_Spotlight_Interferometric_Coherence_to_Monitor_Pasture_Biophysical_Parameters_Limitations_and_Sensitivity_Analysis","315598866_Evaluation_of_an_activity_and_rumination_monitor_in_dairy_cattle_grazing_two_types_of_forages"]}