{"id":"328448566_A_JavaScript_Curriculum_for_High_School_Students_to_Explore_Computer_Science","abstract":"Many students do not have the opportunity to experience computer science related courses in high school due to the lack of resources at their schools. Meanwhile, there are a large number of unfilled computing related jobs nationally. Universities and colleges in the United States are not producing enough Computer Science graduates to meet the demand for jobs—and, conversely, a number of students lured by the abundance of jobs in the field are entering undergraduate Computer programs with insufficient knowledge of the nature or rigor of the discipline, causing them to lose interest after the first year. Summer programs at universities and colleges offer students opportunities to learn about Computer Science, but many of the programs are meant to broaden the knowledge of students who are already studying Computer Science at their high schools by focusing on a specialized area in the discipline such as cybersecurity or game programming. These summer programs are costly and often beyond the reach of economically disadvantaged students. This article outlines a 5 day curriculum for a Computer Science summer program for high school students. Rather than focusing on deepening students’ understanding of specialized topics, the curriculum is instead intended to expose students to foundational concepts in computer science using a hands-on, engaging approach. This foundational understanding of Computer Science will aide participating students in making informed choices about potential academic and career paths in Computer Science—and equip them with some baseline knowledge of the field should they choose to pursue a Computer Science degree.","authors":["Ching-Yu Huang","Mayra Bachrach"],"meta":["December 2018International Journal of Information and Education Technology 8(12)","DOI:10.18178/ijiet.2018.8.12.1152"],"references":["322923983_Pathway_from_Learning_Multimedia_Software_to_Computer_Science_Education","322923981_An_Integrated_Multimedia_Computer_Science_Summer_Program_for_Middle_School_students"]}