{"id":"328481053_A_Brief_Review_of_Generalized_Entropies","abstract":"Entropy appears in many contexts (thermodynamics, statistical mechanics, information theory, measure-preserving dynamical systems, topological dynamics, etc.) as a measure of different properties (energy that cannot produce work, disorder, uncertainty, randomness, complexity, etc.). In this review, we focus on the so-called generalized entropies, which from a mathematical point of view are nonnegative functions defined on probability distributions that satisfy the first three Shannon–Khinchin axioms: continuity, maximality and expansibility. While these three axioms are expected to be satisfied by all macroscopic physical systems, the fourth axiom (separability or strong additivity) is in general violated by non-ergodic systems with long range forces, this having been the main reason for exploring weaker axiomatic settings. Currently, non-additive generalized entropies are being used also to study new phenomena in complex dynamics (multifractality), quantum systems (entanglement), soft sciences, and more. Besides going through the axiomatic framework, we review the characterization of generalized entropies via two scaling exponents introduced by Hanel and Thurner. In turn, the first of these exponents is related to the diffusion scaling exponent of diffusion processes, as we also discuss. Applications are addressed as the description of the main generalized entropies advances.","authors":["José María Amigó","Sámuel Gáspár Balogh","Sergio Hernández"],"meta":["October 2018Entropy 20(11):813","DOI:10.3390/e20110813"],"references":["327936175_Generalized_entropies_in_quantum_and_classical_statistical_theories","324182219_Simulation_Study_on_the_Application_of_the_Generalized_Entropy_Concept_in_Artificial_Neural_Networks","322799635_Phase_space_volume_scaling_of_generalized_entropies_and_anomalous_diffusion_scaling_governed_by_corresponding_non-linear_Fokker-Planck_equations","316505925_Tsallis_Entropy_and_Generalized_Shannon_Additivity","313343793_Uniqueness_and_Characterization_Theorems_for_Generalized_Entropies","309346817_Bounds_on_Renyi_and_Shannon_Entropies_for_Finite_Mixtures_of_Multivariate_Skew-Normal_Distributions_Application_to_Swordfish_Xiphias_gladius_Linnaeus","324366238_Mathematical_Foundations_of_Information_Theory","319746477_Weitere_Studien_uber_das_Warmegleichgewicht_unter_Gasmolekulen","319739124_Uber_die_Beziehung_eines_allgemeinen_mechanischen_Satzes_zum_zweiten_Hauptsatze_der_Warmetheorie","316570042_A_New_Kind_of_Permutation_Entropy_Used_to_Classify_Sleep_Stages_from_Invisible_EEG_Microstructure"]}