{"id":"328470968_Supersymmetric_embedding_of_antibrane_polarization","abstract":"We study the supersymmetry breaking induced by probe anti-D3-branes at the tip of the Klebanov-Strassler throat geometry. Antibranes inside this geometry polarize and can be described by an NS5-brane wrapping an S2. When the number of antibranes is small compared to the background flux a metastable state exists that breaks supersymmetry. We present a manifestly supersymmetric effective model that realizes the polarized metastable state as a solution, spontaneously breaking the supersymmetry. The supersymmetric model relies crucially on the inclusion of Kaluza-Klein (matrix) degrees of freedom on the S2 and two supersymmetric irrelevant deformations of N=4 super-Yang-Mills (SYM), describing a large number of supersymmetric D3-branes in the IR. We explicitly identify the massless Goldstino and compute the spectrum of massive fluctuations around the metastable supersymmetry-breaking minimum, finding a Kaluza-Klein tower with masses warped down from the string scale. Below the Kaluza-Klein scale the massive tower can be integrated out and supersymmetry is realized nonlinearly. We comment on the effect of the Kaluza-Klein modes on the effective description of de Sitter vacua in string theory and inflationary model building.","authors":["Lars Aalsma","Magnus Tournoy","Jan Pieter van der Schaar","Bert Vercnocke"],"meta":["October 2018","DOI:10.1103/PhysRevD.98.086019"],"references":["328032066_De_Sitter_swampland_conjecture_and_the_Higgs_potential","327660555_On_the_de_Sitter_swampland_criterion","326856549_On_the_cosmological_implications_of_the_string_Swampland","323746754_On_the_KKLT_goldstino","323350457_Toward_de_Sitter_space_from_ten_dimensions","321794082_Towards_an_explicit_model_of_large_field_inflation","315953437_Unstoppable_brane-flux_decay_of_D_6_branes","315382556_Constrained_Superfields_on_Metastable_anti-D3-branes","324218730_What_if_string_theory_has_no_de_Sitter_vacua","310671894_Is_inflation_from_unwinding_fluxes_IIB"]}