{"id":"328435697_Analyzing_Learners_Behavior_in_MOOCs_An_Examination_of_Performance_and_Motivation_Using_a_Data-Driven_Approach","abstract":"Massive Open Online Courses (MOOCs) have been experiencing increasing use and popularity in highly ranked universities in recent years. The opportunity of accessing high quality courseware content within such platforms, while eliminating the burden of educational, financial and geographical obstacles has led to a rapid growth in participant numbers. The increasing number and diversity of participating learners has opened up new horizons to the research community for the investigation of effective learning environments. Learning Analytics has been used to investigate the impact of engagement on student performance. However, extensive literature review indicates that there is little research on the impact of MOOCs, particularly in analyzing the link between behavioral engagement and motivation as predictors of learning outcomes. In this study, we consider a dataset, which originates from online courses provided by Harvard University and Massachusetts Institute of Technology, delivered through the edX platform [1]. Two sets of empirical experiments are conducted using both statistical and machine learning techniques. Statistical methods are used to examine the association between engagement level and performance, including the consideration of learner educational backgrounds. The results indicate a significant gap between success and failure outcome learner groups, where successful learners are found to read and watch course material to a higher degree. Machine learning algorithms are used to automatically detect learners who are lacking in motivation at an early time in the course, thus providing instructors with insight in regards to student withdrawal.","authors":["Raghad AL-Shabandar","Abir Jaafar Hussain","Panos Liatsis","Robert Keight"],"meta":["October 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2876755","Project: Machine learning in MOOCs"],"references":["322342119_Student_Engagement_Literature_Review","308675581_Classification_and_Regression_Tree_CART_analysis_to_predict_influenza_in_primary_care_patients","290475072_HarvardX_and_MITx_Two_Years_of_Open_Online_Courses_Fall_2012-Summer_2014","318548867_Towards_the_Differentiation_of_Initial_and_Final_Retention_in_Massive_Open_Online_Courses","317109378_Analyzing_undergraduate_students'_performance_using_educational_data_mining","314269158_Understanding_the_massive_open_online_course_MOOC_student_experience_An_examination_of_attitudes_motivations_and_barriers","311488524_Modeling_and_Predicting_Learning_Behavior_in_MOOCs","297283227_The_role_of_students'_motivation_and_participation_in_predicting_performance_on_a_MOOC","291063731_Predicting_MOOC_Dropout_over_Weeks_Using_Machine_Learning_Methods","289963904_Intrinsic_and_extrinsic_motivations_Classic_definitions_and_new_directions"]}