{"id":"328461279_Gender_differences_in_middle_school_students'_attitudes_and_self-efficacy_perceptions_towards_MBlock_programming","abstract":"This study aims to assess the effects of teaching programming with mBlock on self-efficacy perceptions and attitudes considering programming. Particularly, this study tries to research whether there is a gender difference in middle school students or not. The study was conducted in pre-test/post-test quasi experimental design. The participants of the study which was completed in twelve weeks were 82 middle school students. The data were collected through \"Educational Computer Games Assisted Learning Coding Attitude Scale\" and \"Computer Programming Self-efficacy Scale\". The results of the research indicate that although the self-efficacy perceptions of boys towards programming were higher than the girls' at the beginning of the research, this difference was closed at the end of the research. The results also show that teaching programming with mBlock to middle school students did not cause gender differences in self-efficacy perceptions and attitudes regarding programming. Although girls' attitudes regarding programming were slightly higher than boys', the difference was not considered to be significant. In addition, it was found that programming with mBlock significantly increased students' self-efficacy perceptions and attitudes towards programming. As a result, teaching programming with mBlock can provide similar possibilities for both genders in self-efficacy perceptions and attitudes regarding programming.","authors":["Mustafa Serkan Günbatar","Halit Karalar"],"meta":["October 2018","DOI:10.12973/eu-jer.7.4.923"],"references":["313299331_COMPUTER_PROGRAMMING_SELF-EFFICACY_SCALE_CPSES_FOR_SECONDARY_SCHOOL_STUDENTS_DEVELOPMENT_VALIDATION_AND_RELIABILITY","281856217_Identifying_latent_patterns_in_undergraduate_Students'_programming_profiles","314191072_Assessing_elementary_students'_computational_thinking_in_everyday_reasoning_and_robotics_programming","305450927_EDUCATIONAL_COMPUTER_GAMES_ASSISTED_LEARNING_CODING_ATTITUDE_SCALE_VALIDITY_AND_RELIABILITY_STUDY","301308652_Preservice_Teachers_Introduction_to_Computing_Exploring_Utilization_of_Scratch","301281259_An_investigation_of_the_effects_of_programming_with_Scratch_on_the_preservice_IT_teachers'_self-efficacy_perceptions_and_attitudes_towards_computer_programming_Programming_with_Scratch","298972479_Learning_Computer_Science_Concepts_with_Scratch","297719113_Visual_programming_languages_integrated_across_the_curriculum_in_elementary_school_A_two_year_case_study_using_Scratch_in_five_schools","287787044_Attitude_gender_and_achievement_in_computer_programming","278672713_A_new_way_of_teaching_programming_skills_to_K-12_students_Codeorg"]}