{"id":"328441198_Deep_neural_network_improves_fracture_detection_by_clinicians","abstract":"Suspected fractures are among the most common reasons for patients to visit emergency departments (EDs), and X-ray imaging is the primary diagnostic tool used by clinicians to assess patients for fractures. Missing a fracture in a radiograph often has severe consequences for patients, resulting in delayed treatment and poor recovery of function. Nevertheless, radiographs in emergency settings are often read out of necessity by emergency medicine clinicians who lack subspecialized expertise in orthopedics, and misdiagnosed fractures account for upward of four of every five reported diagnostic errors in certain EDs. In this work, we developed a deep neural network to detect and localize fractures in radiographs. We trained it to accurately emulate the expertise of 18 senior subspecialized orthopedic surgeons by having them annotate 135,409 radiographs. We then ran a controlled experiment with emergency medicine clinicians to evaluate their ability to detect fractures in wrist radiographs with and without the assistance of the deep learning model. The average clinician's sensitivity was 80.8% (95% CI, 76.7-84.1%) unaided and 91.5% (95% CI, 89.3-92.9%) aided, and specificity was 87.5% (95 CI, 85.3-89.5%) unaided and 93.9% (95% CI, 92.9-94.9%) aided. The average clinician experienced a relative reduction in misinterpretation rate of 47.0% (95% CI, 37.4-53.9%). The significant improvements in diagnostic accuracy that we observed in this study show that deep learning methods are a mechanism by which senior medical specialists can deliver their expertise to generalists on the front lines of medicine, thereby providing substantial improvements to patient care.","authors":["Robert Lindsey","Aaron Daluiski","Sumit Chopra","Alexander Lachapelle"],"meta":["October 2018Proceedings of the National Academy of Sciences 115(45):201806905","DOI:10.1073/pnas.1806905115"],"references":["282306237_Diagnostic_Accuracy_of_Digital_Screening_Mammography_With_and_Without_Computer-Aided_Detection","277411157_Deep_Learning","276923248_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation","313264931_Physicists_propose_football-pitch-sized_quantum_computer","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","312387781_Improving_Human-Machine_Cooperative_Visual_Search_With_Soft_Highlighting","311164170_Development_and_Validation_of_a_Deep_Learning_Algorithm_for_Detection_of_Diabetic_Retinopathy_in_Retinal_Fundus_Photographs","293014405_Locality_Sensitive_Deep_Learning_for_Detection_and_Classification_of_Nuclei_in_Routine_Colon_Cancer_Histology_Images","280019873_Better_Bootstrap_Confidence_Intervals","274563872_Defending_the_Missed_Radiographic_Diagnosis"]}