{"id":"328469094_Mapping_historic_urban_landscape_values_through_social_media","abstract":"Social media provides big data for researchers to perform real-time analytics, as digital ethnographers, on what places and attributes people value in the historic urban landscapes they live or visit, enough to share with their social network. However, the use of these data to further our knowledge on heritage and their values, or to support heritage planning and management is still very limited. This article proposes a methodology for the analysis of viewpoints location-view scenes-tags data for photos posted on Flickr to provide insights into all facets of the perceived landscape character that identifies people-centered heritage at the city level. The analysis visualizes convergence and divergence between locals’ and tourists’ preferences. It also reveals heritage concerns in the context of daily-life practices and everyday landscape, as well as political and religious concerns in post-conflict areas. Additionally, the analysis questions the limits of heritage areas and categories used for identifying cultural values. Results showed that the different analyses complement one another to eventually provide insights into everyday encounters with the historic urban landscape. They also show the difference between experts’ and users’ documentation and characterization languages when defining heritage. When the first apply domain-specific classification models, the latter express personal reflections without following a specific hierarchy or a closed categorical system. It is believed that the outcome can help heritage scholars to further our understanding for the diversity of heritage places and attributes, as well as, heritage professionals, to inform decision-making processes in heritage planning and management on both experts’ and users’ understanding of heritage.","authors":["Manal Ginzarly","Ana Pereira Roders","Jacques Teller"],"meta":["October 2018Journal of Cultural Heritage 36","DOI:10.1016/j.culher.2018.10.002","Project: Historic Urban Landscapes (HUL)"],"references":["323783537_Cultural_Heritage_Management_and_Heritage_Impact_Assessments","321817012_Apps_under_the_surface_Problems_with_Cultural_Heritage_apps","321691655_Instagram_Flickr_or_Twitter_Assessing_the_usability_of_social_media_data_for_visitor_monitoring_in_protected_areas","299924369_Heritage_in_the_Digital_Age","285735981_Collective_memory_of_conflicts","313617245_L'emergence_patrimoniale_de_l'ethnologie_Entre_memoire_et_politiques_publiques","309603900_Continental-scale_quantification_of_landscape_values_using_social_media_data","308272614_Measuring_recreational_visitation_at_US_National_Parks_with_crowd-sourced_photographs","305924670_The_use_of_tracking_technologies_in_tourism_research_the_first_decade","297479682_Reconnecting_the_City_The_Historic_Urban_Landscape_Approach_and_the_Future_of_Urban_Heritage"]}