{"id":"328433901_RippleNet_Propagating_User_Preferences_on_the_Knowledge_Graph_for_Recommender_Systems","abstract":"To address the sparsity and cold start problem of collaborative filtering, researchers usually make use of side information, such as social networks or item attributes, to improve recommendation performance. This paper considers the knowledge graph as the source of side information. To address the limitations of existing embedding-based and path-based methods for knowledge-graph-aware recommendation, we propose RippleNet, an end-to-end framework that naturally incorporates the knowledge graph into recommender systems. Similar to actual ripples propagating on the water, RippleNet stimulates the propagation of user preferences over the set of knowledge entities by automatically and iteratively extending a user's potential interests along links in the knowledge graph. The multiple \"ripples\" activated by a user's historically clicked items are thus superposed to form the preference distribution of the user with respect to a candidate item, which could be used for predicting the final clicking probability. Through extensive experiments on real-world datasets, we demonstrate that RippleNet achieves substantial gains in a variety of scenarios, including movie, book and news recommendation, over several state-of-the-art baselines.","authors":["Hongwei Wang","Fuzheng Zhang","Jialin Wang","Miao Zhao"],"meta":["October 2018","DOI:10.1145/3269206.3271739","Conference: the 27th ACM International Conference"],"references":["326496839_Deep_Interest_Network_for_Click-Through_Rate_Prediction","324508348_DKN_Deep_Knowledge-Aware_Network_for_News_Recommendation","322965264_Sequential_Recommendation_with_User_Memory_Networks","321511306_SHINE_Signed_Heterogeneous_Information_Network_Embedding_for_Sentiment_Link_Prediction","321242035_GraphGAN_Graph_Representation_Learning_with_Generative_Adversarial_Nets","320883869_Joint_Topic-Semantic-aware_Social_Recommendation_for_Online_Voting","319947524_Knowledge_Graph_Embedding_A_Survey_of_Approaches_and_Applications","319769995_End-To-End_Memory_Networks","319285425_Interpretable_Convolutional_Neural_Networks_with_Dual_Local_and_Global_Attention_for_Review_Rating_Prediction","319283476_Collaborative_Intent_Prediction_with_Real-Time_Contextual_Data"]}