{"id":"328410713_The_Effect_of_Visual_Programming_Activities_on_Secondary_School_Students'_Computational_Thinking_Skills","abstract":"The purpose of this study is to examine the effects of visual programming activities at the secondary level on the students' computational thinking skills and their opinions about the process. The study is designed by mixed method. In the quantitative part of the study, a semi-experimental method consisting of a single group of repeated measures was applied to examine the effects of visual programming activities on computational thinking skills. Quantitative data were collected through pre-test, mid-test and posttests regarding computational thinking skills and quantitative data on students' competence in computational thinking and supported with qualitative data. The study was conducted in two stages. In the first phase, students were given activities related to concepts about computer science for 4 weeks in Scratch as a visual programming language. In the second stage, the students separated into groups and designed the game using Scratch for 4 weeks. 55 middle school students attended to the study in a public school under the Project Kodla(Ma)nisa. One-factor ANOVA was used for repeated measures to determine whether there was a significant difference between pre-test, mid-test, and posttests, and no significant difference was found between measurements. In addition, students' reflections about the process have been examined in focus group interviews and, they have expressed that they have increased awareness of computer science and have developed their imagination.","authors":["Nilüfer Atman Uslu","Filiz Mumcu","Figen Eğin"],"meta":["July 2018"],"references":["317696965_New_Paper_The_Effects_of_Computer_Programming_on_high_school_students'_reasoning_skills_and_self-efficacy_and_problem_solving_in_Mathematics","305704236_INTRODUCING_PROGRAMMING_TO_ELEMENTARY_STUDENTS_NOVICES_BY_USING_GAME_DEVELOPMENT_IN_PYTHON_AND_SCRATCH","302909013_Code_to_learn_with_Scratch_A_systematic_literature_review","291338987_Bilgisayarca_Dusunme_Beceri_Duzeyleri_Olceginin_BDBD_Ortaokul_Duzeyine_Uyarlanmasi","271746747_The_Effects_of_Teaching_Programming_via_Scratch_on_Problem_Solving_Skills_A_Discussion_from_Learners'_Perspective","223444475_Using_a_Computer_Programming_Environment_and_an_Interactive_Whiteboard_to_Investigate_Some_Mathematical_Thinking","319440133_Exploring_the_engagement_effects_of_visual_programming_language_for_data_structure_courses","312253565_A_validity_and_reliability_study_of_the_Computational_Thinking_Scales_CTS","311508750_Sosyal_bilimlerde_nitel_arastirma_yontemleri","291206157_Computational_Thinking_in_Constructionist_Video_Games","220420371_Computational_thinking"]}