{"id":"328479701_Generalized_Latent_Multi-View_Subspace_Clustering","abstract":"Subspace clustering is an effective method that has been successfully applied to many applications. Here we propose a novel subspace clustering model for multi-view data using a latent representation termed Latent Multi-View Subspace Clustering (LMSC). Unlike most existing single-view subspace clustering methods, which directly reconstruct data points using original features, our method explores underlying complementary information from multiple views and simultaneously seeks the underlying latent representation. Using the complementarity of multiple views, the latent representation depicts data more comprehensively than each individual view, accordingly making subspace representation more accurate and robust. We proposed two LMSC formulations: linear LMSC (lLMSC), based on linear correlations between latent representation and each view, and generalized LMSC (gLMSC), based on neural networks to handle general relationships. The proposed method can be efficiently optimized under the Augmented Lagrangian Multiplier with Alternating Direction Minimization (ALM-ADM) framework. Extensive experiments on diverse datasets demonstrate the effectiveness of the proposed method.","authors":["Changqing Zhang","Huazhu Fu","Qinghua Hu","Xiaochun Cao"],"meta":["October 2018IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99):1-1","DOI:10.1109/TPAMI.2018.2877660"],"references":["324151694_On_Unifying_Multi-View_Self-Representations_for_Clustering_by_Tensor_Multi-Rank_Minimization","320971546_Latent_Multi-view_Subspace_Clustering","319622759_Deep_Subspace_Clustering_Networks","325836694_Binary_Multi-View_Clustering","321331426_Multi-View_Clustering_via_Canonical_Correlation_Analysis","320032910_Deep_Sparse_Subspace_Clustering","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317191079_Domain_Adaptive_Subspace_Clustering","316945200_Multimodal_Sparse_and_Low-Rank_Subspace_Clustering"]}