{"id":"328433432_Machine_Learning_in_Network_Centrality_Measures_Tutorial_and_Outlook","abstract":"Complex networks are ubiquitous to several computer science domains. Centrality measures are an important analysis mechanism to uncover vital elements of complex networks. However, these metrics have high computational costs and requirements that hinder their applications in large real-world networks. In this tutorial, we explain how the use of neural network learning algorithms can render the application of the metrics in complex networks of arbitrary size. Moreover, the tutorial describes how to identify the best configuration for neural network training and learning such for tasks, besides presenting an easy way to generate and acquire training data. We do so by means of a general methodology, using complex network models adaptable to any application. We show that a regression model generated by the neural network successfully approximates the metric values and therefore is a robust, effective alternative in real-world applications. The methodology and proposed machine-learning model use only a fraction of time with respect to other approximation algorithms, which is crucial in complex network applications.","authors":["Luís C. Lamb","Felipe Grando","Lisandro Zambenedetti Granville"],"meta":["October 2018ACM Computing Surveys 51(5):Article 102","DOI:10.1145/3237192","Project: Machine Learning and Reasoning"],"references":["323459712_Study_on_centrality_measures_in_social_networks_a_survey","313454352_An_Analysis_of_Centrality_Measures_for_Complex_and_Social_Networks","337960591_Practical_Optimization","316753002_A_Scaled_Conjugate_Gradient_Algorithm_for_Fast_Supervised_Learning","313454458_On_the_Computation_of_Centrality_Metrics_for_Network_Security_in_Mesh_Networks","311953441_Neural_Networks_for_Fast_Estimation_of_Social_Network_Centrality_Measures","311342932_Mathematical_foundations_for_social_computing","309778275_On_approximating_networks_centrality_measures_via_neural_learning_algorithms","309697799_Neural_Network_Design","309056746_Networking_for_Big_Data_A_Survey"]}