{"id":"328508334_Modular_language_composition_for_the_masses","abstract":"The goal of modular language development is to enable the definition of new languages as assemblies of pre-existing ones. Recent approaches in this area are plentiful but usually suffer from two main problems: either they do not support modular language composition both at the specification and implementation levels, or they require advanced knowledge of specific paradigms which hampers wide adoption in the industry. In this paper, we introduce a non-intrusive approach to modular development of language concerns with well-defined interfaces that can be composed modularly at the specification and implementation levels. We present an implementation of our approach atop the Eclipse Modeling Framework, namely Alex, an object-oriented meta-language for semantics definition and language composition. We evaluate Alex in the development of a new DSL for IoT systems modeling resulting from the composition of three independently defined languages (UML activity diagrams, Lua, and the OMG Interface Description Language). We evaluate the effort required to implement and compose these languages using Alex with regards to similar approaches of the literature.","authors":["Manuel Leduc","Thomas Degueule","Benoit Combemale"],"meta":["October 2018","DOI:10.1145/3276604.3276622","Conference: the 11th ACM SIGPLAN International Conference"],"references":["325525466_Concern-Oriented_Language_Development_COLD_Fostering_Reuse_in_Language_Engineering","320971188_Revisiting_Visitors_for_Modular_Extension_of_Executable_DSMLs","308569681_Pattern-based_development_of_Domain-Specific_Modelling_Languages","281712061_A_Language_Designer's_Workbench_A_One-Stop-Shop_for_Implementation_and_Verification_of_Language_Designs","320786659_On_Language_Interfaces","309006688_Leveraging_Software_Product_Lines_Engineering_in_the_Development_of_External_DSLs_A_Systematic_Literature_Review","306272928_Modular_interpreters_with_implicit_context_propagation","295315092_Choosy_and_picky","284119593_Modular_Language_Implementation_In_Rascal_-_Experience_Report","281967047_Melange_A_Meta-language_for_Modular_and_Reusable_Development_of_DSLs"]}