{"id":"328545473_Photoplethysmography_and_Deep_Learning_Enhancing_Hypertension_Risk_Stratification","abstract":"Blood pressure is a basic physiological parameter in the cardiovascular circulatory system. Long-term abnormal blood pressure will lead to various cardiovascular diseases, making the early detection and assessment of hypertension profoundly significant for the prevention and treatment of cardiovascular diseases. In this paper, we investigate whether or not deep learning can provide better results for hypertension risk stratification when compared to the classical signal processing and feature extraction methods. We tested a deep learning method for the classification and evaluation of hypertension using photoplethysmography (PPG) signals based on the continuous wavelet transform (using Morse) and pretrained convolutional neural network (using GoogLeNet). We collected 121 data recordings from the Multiparameter Intelligent Monitoring in Intensive Care (MIMIC) Database, each containing arterial blood pressure (ABP) and photoplethysmography (PPG) signals. The ABP signals were utilized to extract blood pressure category labels, and the PPG signals were used to train and test the model. According to the seventh report of the Joint National Committee, blood pressure levels are categorized as normotension (NT), prehypertension (PHT), and hypertension (HT). For the early diagnosis and assessment of HT, the timely detection of PHT and the accurate diagnosis of HT are significant. Therefore, three HT classification trials were set: NT vs. PHT, NT vs. HT, and (NT + PHT) vs. HT. The F-scores of these three classification trials were 80.52%, 92.55%, and 82.95%, respectively. The tested deep method achieved higher accuracy for hypertension risk stratification when compared to the classical signal processing and feature extraction method. Additionally, the method achieved comparable results to another approach that requires electrocardiogram and PPG signals.","authors":["Yongbo Liang","Zhencheng Chen","Rabab Ward","Mohamed Elgendi"],"meta":["October 2018Biosensors 8(4):101","DOI:10.3390/bios8040101","Project: Digital Health"],"references":["328038128_Can_Photoplethysmography_Replace_Arterial_Blood_Pressure_in_the_Assessment_of_Blood_Pressure","327565496_Hypertension_Assessment_via_ECG_and_PPG_Signals_An_Evaluation_Using_MIMIC_Database","327270548_Advanced_Bio-Inspired_System_for_Noninvasive_Cuff-Less_Blood_Pressure_Estimation_from_Physiological_Signal_Analysis","324877959_An_optimal_filter_for_short_photoplethysmogram_signals","324590725_LiteNet_Lightweight_Neural_Network_for_Detecting_Arrhythmias_at_Resource-Constrained_Mobile_Devices","324444941_Deep_learning_for_healthcare_applications_based_on_physiological_signals_A_review","324368218_Study_of_continuous_blood_pressure_estimation_based_on_pulse_transit_time_heart_rate_and_photoplethysmography-derived_hemodynamic_covariates","324044917_Robust_ECG_Signal_Classification_for_the_Detection_of_Atrial_Fibrillation_Using_Novel_Neural_Networks","323716637_Toward_Generating_More_Diagnostic_Features_from_Photoplethysmogram_Waveforms","326099136_A_survey_on_deep_learning_for_big_data"]}