{"id":"328576742_The_blockchain_as_a_backbone_of_GDPR_compliant_frameworks","abstract":"General data protection regulation (GDPR) has been applied since 25 May 2018. It is designed to harmonize data privacy laws in European Union. It clearly defines what personal data is and identifies involved objects as Controller, Processor and Data subject. Although it focuses over the procedures in the organizations that have contact with personal data, it raises technological challenges about data storage, data processing, access control, identity management, system resilience, cybersecurity, post security breach measures, transactions traceability. We offer a new conceptual model with a trust management technology between controllers and data processors, which is based on the capabilities of the DLT. It can be useful in synthesizing software architectures, managing change due to the implementation of GDPR, ePrivacy, Policy Directive, and another forthcoming EU legislation. The article aims to present where the blockchain implementation can be helpful for the GDPR compliant operations. It doesn't cover the GDPR or blockchain in deep technical details, but just points out the important aspects where the DLT solution could be applicable. The paper is structured as follows: Section 1 introduces the paper. Section 2 describes the methodology used in this article. Section 3 introduces the GDPR and points out with short descriptions the key principles of the regulation. Section 4 covers brief explanation what blockchain is with examples from the Bitcoin implementation. Terms like transaction, transactions integrity, block, consensus are described here. Permissioned and permissionless blockchain implementations with their basic difference in the level of trust. Section 5 defines the main intersection points between GDPR compliance and the blockchain. Section 6 presents the Hyperledger fabric blockchain framework founded by Open Linux Foundation and IBM. The section focuses over the unique Hyperledger fabric abilities, which leads to increased confidentiality, transaction speed, traceability, access control, identity management, endorsement policies and smart contracts applications. Section 7 shows related research in this area. In conclusion the study reveals the biggest challenge in the blockchain application in the GDPR compliant frameworks.","authors":["Peyo Hristov","Willian Dimitrov"],"meta":["October 2018","Conference: SIMPRO 2018At: Romania","Projects: Conceptual and Simulation Modeling of Ecosystems for the Internet of Things (CoMein)комеин"],"references":["318131748_An_Overview_of_Blockchain_Technology_Architecture_Consensus_and_Future_Trends","319992346_Blockchain's_roles_in_strengthening_cybersecurity_and_protecting_privacy","221329519_No_Silver_Bullet_-_Essence_and_Accidents_of_Software_Engineering_Invited_Paper"]}