{"id":"328550071_Tensionless_strings_and_the_weak_gravity_conjecture","abstract":"A bstract\nWe test various conjectures about quantum gravity for six-dimensional string compactifications in the framework of F-theory. Starting with a gauge theory coupled to gravity, we analyze the limit in Kähler moduli space where the gauge coupling tends to zero while gravity is kept dynamical. We show that such a limit must be located at infinite distance in the moduli space. As expected, the low-energy effective theory breaks down in this limit due to a tower of charged particles becoming massless. These are the excitations of an asymptotically tensionless string, which is shown to coincide with a critical heterotic string compactified to six dimensions.\nFor a more quantitative analysis, we focus on a U(1) gauge symmetry and use a chain of dualities and mirror symmetry to determine the elliptic genus of the nearly tensionless string, which is given in terms of certain meromorphic weak Jacobi forms. Their modular properties in turn allow us to determine the charge-to-mass ratios of certain string excitations near the tensionless limit. We then provide evidence that the tower of asymptotically massless charged states satisfies the (sub-)Lattice Weak Gravity Conjecture, the Completeness Conjecture, and the Swampland Distance Conjecture. Quite remarkably, we find that the number theoretic properties of the elliptic genus conspire with the balance of gravitational and scalar forces of extremal black holes, such as to produce a narrowly tuned charge spectrum of superextremal states. As a byproduct, we show how to compute elliptic genera of both critical and non-critical strings, when refined by Mordell-Weil U(1) symmetries in F-theory.","authors":["Seung-Joo Lee","Wolfgang Lerche","Timo Weigand"],"meta":["October 2018Journal of High Energy Physics 2018(10)","DOI:10.1007/JHEP10(2018)164"],"references":["327773969_The_fundamental_need_for_a_SM_Higgs_and_the_weak_gravity_conjecture","327342261_Universal_features_of_BPS_strings_in_six-dimensional_SCFTs","326825428_Emergence_of_Weak_Coupling_at_Large_Distance_in_Quantum_Gravity","324690929_A_Note_on_4D_Heterotic_String_Vacua_FI-terms_and_the_Swampland","323392616_Infinite_Distances_in_Field_Space_and_Massless_Towers_of_States","346790082_Exact_results_for_N_2_compactifications_of_heterotic_strings","339750166_Relaxion_monodromy_and_the_Weak_Gravity_Conjecture","324624220_Backreaction_in_Axion_Monodromy_4-forms_and_the_Swampland","323770766_The_Refined_Swampland_Distance_Conjecture_in_Calabi-Yau_Moduli_Spaces","323164895_A_Tower_Weak_Gravity_Conjecture_from_Infrared_Consistency"]}