{"id":"328585602_A_Parallel_Time-Integrator_for_Solving_the_Linearized_Shallow_Water_Equations_on_the_Rotating_Sphere","abstract":"With the stagnation of processor core performance, further reductions in the time to solution for geophysical fluid problems are becoming increasingly difficult with standard time integrators. Parallel‐in‐time exposes and exploits additional parallelism in the time dimension, which is inherently sequential in traditional methods. The rational approximation of exponential integrators (REXI) method allows taking arbitrarily long time steps based on a sum over a number of decoupled complex PDEs that can be solved independently massively parallel. Hence, REXI is assumed to be well suited for modern massively parallel super computers, which are currently trending. To date, the study and development of the REXI approach have been limited to linearized problems on the periodic two‐dimensional plane. This work extends the REXI time stepping method to the linear shallow‐water equations on the rotating sphere, thus moving the method one step closer to solving fully nonlinear fluid problems of geophysical interest on the sphere. The rotating sphere poses particular challenges for finding an efficient solver due to the zonal dependence of the Coriolis term. Here, we present an efficient REXI solver based on spherical harmonics, showing the results of a geostrophic balance test, a comparison with alternative time stepping methods, an analysis of dispersion relations indicating superior properties of REXI, and finally, a performance comparison on the Cheyenne supercomputer. Our results indicate that REXI not only can take larger time steps but also can be used to gain higher accuracy and significantly reduced time to solution compared with currently existing time stepping methods.","authors":["Martin Schreiber","Richard Loft"],"meta":["October 2018Numerical Linear Algebra with Applications 26(5)","DOI:10.1002/nla.2220","Project: Next generation time integration methods targeting climate and weather simulations"],"references":["303369002_On_computation_of_Hough_functions","313612719_The_Integration_of_a_Low_Order_Spectral_Form_of_the_Primitive_Meteorological_Equations","311615364_Beyond_spatial_scalability_limitations_with_a_massively_parallel_method_for_linear_oscillatory_problems","307562149_A_Standard_Test_Set_for_Numerical_Approximations_to_the_Shallow_Water_Equations_in_Spherical_Geometry","291002110_50_Years_of_Time_Parallel_Time_Integration","290481356_Accuracy_analysis_of_mimetic_finite_volume_operators_on_geodesic_grids_and_a_consistent_alternative","285758248_The_integration_of_a_spectral_model_of_the_atmosphere_by_the_implicit_method_Proceeding_of_WMOIUGG_symposium_on_NWP","267469007_Numerical_Methods_for_Fluid_Dynamics_With_Applications_to_Geophysics","267185323_A_Framework_for_Mimetic_Discretization_of_the_Rotating_Shallow-Water_Equations_on_Arbitrary_Polygonal_Grids","266859862_PARAEXP_a_parallel_integrator_for_linear_initial-value_problems"]}