{"id":"328581661_Ontologia_para_representacao_de_tempo_no_contexto_de_indicadores_de_desempenho","abstract":"Time representation ontology in the context of performance measurement indicators\nPerformance measurement indicators are widely used by organizations in order to assess, measure and classify organizational performance. As part of performance measurement systems, indicators are often shared or compared to different internal sectors of the organization, or even with other companies. However, some indicators are associated with vagueness and imprecision. In these cases, literature related to time representation can clarify the need for the semantic representation of indicators. This work seeks to analyse the studies available, selected after bibliometric review, on the semantic representation of time through ontologies. The purpose of this is to identify a knowledge model which best served the purpose of representing time in the performance indicators’ context. After applying the METHONTOLOGY methodology, it was concluded that the most suitable option is the SWRL Temporal Ontology, due to its ability to represent fine levels of granularity for points of time.","authors":["Vanderlei Freitas Junior","Junior ; Alexandre","Leopoldo Gonçalves","Victoria Uren"],"meta":["October 2018Perspectivas em Ciência da Informação 23(3):3","DOI:10.1590/1981-5344/2609"],"references":["281654729_Axiomatic_theories_of_the_ontology_of_time_in_GFO","273405647_Practical_Framework_for_Measuring_Performance_of_International_Construction_Firms","271906680_Ontologies_of_Time_Review_and_Trends","267402303_A_Method_for_Representing_and_Querying_Temporal_Information_in_OWL","264837360_A_Fuzzy-QFD_Approach_to_Balanced_Scorecard_Using_an_Analytic_Network_Process","313005530_Ontology_of_Time_in_GFO","298043780_The_Balanced_Scorecard_measures_that_drive_performance","288901922_Key_performance_indicators_developing_implementing_and_using_winning_KPIs","283925025_Maintaining_Knowledge_about_Temporal_Intervals","274427482_A_revised_theory_of_action_and_time_based_on_intervals_and_points"]}