{"id":"328558063_Universes_and_simulations_Civilizational_development_in_nested_embedding","abstract":"The rapid development of technology has allowed computer simulations to become routinely used in an increasing number of fields of science. These simulations become more and more realistic, and their energetic efficiency grows due to progress in computer hardware and software. As humans merge with machines via implants, brain-computer interfaces and increased activity involving information instead of material objects, philosophical concepts and theoretical considerations on the nature of reality are beginning to concern practical, working models and testable virtual environments. This article discusses how simulation is understood and employed in computer science today, how software, hardware and the physical universe unify, how simulated realities are embedded one in another, how complicated it can get in application, practical scenarios, and the possible consequences of these situations. A number of basic properties of universes and simulations in such multiply nested structures are reviewed, and the relationship of these properties with a level of civilizational development is explored.","authors":["Maciej Komosinski"],"meta":["September 2018Foundations of Computing and Decision Sciences 43(3):181-205","DOI:10.1515/fcds-2018-0010"],"references":["332074609_Mappism_Formalizing_classical_and_artificial_life_views_on_mind_and_consciousness","314258055_Towards_implementation_of_Cellular_Automata_in_Microbial_Fuel_Cells","299381571_Why_Doomsday_Arguments_are_Better_than_Simulation_Arguments","282482802_JiTTree_A_Just-in-Time_Compiled_Sparse_GPU_Volume_Data_Structure","281255461_Early_draft_Simulation_self-extinction_and_philosophy_in_the_service_of_human_civilization","322622477_Information_measures_effective_complexity_and_total_information","321621222_Artificial_Life_Models_in_Software","309141184_Automatic_Generation_of_Efficient_Accelerators_for_Reconfigurable_Hardware","288591094_Is_the_universe_a_vast_consciousness-created_virtual_reality_simulation","278333478_Linking_simulation_argument_to_the_AI_risk"]}