{"id":"328576835_Grounds_for_Trust_Essential_Epistemic_Opacity_and_Computational_Reliabilism","abstract":"Several philosophical issues in connection with computer simulations rely on the assumption that results of simulations are trustworthy. Examples of these include the debate on the experimental role of computer simulations (Parker in Synthese 169(3):483–496, 2009; Morrison in Philos Stud 143(1):33–57, 2009), the nature of computer data (Barberousse and Vorms, in: Durán, Arnold (eds) Computer simulations and the changing face of scientific experimentation, Cambridge Scholars Publishing, Barcelona, 2013; Humphreys, in: Durán, Arnold (eds) Computer simulations and the changing face of scientific experimentation, Cambridge Scholars Publishing, Barcelona, 2013), and the explanatory power of computer simulations (Krohs in Int Stud Philos Sci 22(3):277–292, 2008; Durán in Int Stud Philos Sci 31(1):27–45, 2017). The aim of this article is to show that these authors are right in assuming that results of computer simulations are to be trusted when computer simulations are reliable processes. After a short reconstruction of the problem of epistemic opacity, the article elaborates extensively on computational reliabilism, a specified form of process reliabilism with computer simulations located at the center. The article ends with a discussion of four sources for computational reliabilism, namely, verification and validation, robustness analysis for computer simulations, a history of (un)successful implementations, and the role of expert knowledge in simulations.","authors":["Juan M Durán","Nico Formanek"],"meta":["December 2018Minds and Machines","DOI:10.1007/s11023-018-9481-6"],"references":["311668900_Varying_the_Explanatory_Span_Scientific_Explanation_for_Computer_Simulations","299344207_Epistemic_Opacity_Confirmation_Holism_and_Technical_Debt_Computer_Simulation_in_the_Light_of_Empirical_Software_Engineering","298419291_Computer_simulations_in_science_and_engineering_Concepts_-_Practices_-_Perspectives","344114241_Reconstructing_Reality_Models_Mathematics_and_Simulations","344082909_Simulation_and_Similarity_Using_Models_to_Understand_the_World","325166524_Boon_and_Bane_On_the_role_of_Adjustable_Parameters_in_Simulation_Models","318660693_Are_computer_simulations_experiments_And_if_not_how_are_they_related_to_each_other","317538313_Science_in_the_Age_of_Computer_Simulation","316856997_Software_engineering_theory_and_practice","315864891_Boon_and_Bane_On_the_Role_of_Adjustable_Parameters_in_Simulation_Models"]}