{"id":"328549400_E-Eye_Hidden_Electronics_Recognition_through_mmWave_Nonlinear_Effects","abstract":"While malicious attacks on electronic devices (e-devices) have become commonplace, the use of e-devices themselves for malicious attacks has increased (e.g., explosives and eavesdropping). Modern e-devices (e.g., spy cameras, bugs or concealed weapons) can be sealed in parcels/boxes, hidden under clothing or disguised with cardboard to conceal their identities (named as hidden e-devices hereafter), which brings challenges in security screening. Inspection equipment (e.g., X-ray machines) is bulky and expensive. Moreover, screening reliability still rests on human performance, and the throughput in security screening of passengers and luggages is very limited. To this end, we propose to develop a low-cost and practical hidden e-device recognition technique to enable efficient screenings for threats of hidden electronic devices in daily life. First, we investigate and model the characteristics of nonlinear effects, a special passive response of electronic devices under millimeter-wave (mmWave) sensing. Based on this theory and our preliminary experiments, we design and implement, E-Eye, an end-to-end portable hidden electronics recognition system. E-Eye comprises a low-cost (i.e., under $100), portable (i.e., 11.8cm by 4.5cm by 1.8cm) and light-weight (i.e., 45.5g) 24GHz mmWave probe and a smartphone-based e-device recognizer. To validate the E-Eye performance, we conduct experiments with 46 commodity electronic devices under 39 distinct categories. Results show that E-Eye can recognize hidden electronic devices in parcels/boxes with an accuracy of more than 99% and has an equal error rate (EER) approaching 0.44% under a controlled lab setup. Moreover, we evaluate the reliability, robustness and performance variation of E-Eye under various real-world circumstances, and E-Eye can still achieve accuracy over 97%. Intensive evaluation indicates that E-Eye is a promising solution for hidden electronics recognition in daily life.","authors":["Zhengxiong Li","Zhuolin Yang","Chen Song","Changzhi Li"],"meta":["November 2018","DOI:10.1145/3274783.3274833","Conference: the 16th ACM Conference"],"references":["322010741_Comparison_of_Random_Forest_k-Nearest_Neighbor_and_Support_Vector_Machine_Classifiers_for_Land_Cover_Classification_Using_Sentinel-2_Imagery","320217850_Cardiac_Scan_A_Non-contact_and_Continuous_Heart-based_User_Authentication_System","305719480_SleepSense_A_Noncontact_and_Cost-Effective_Sleep_Monitoring_System","317702586_Distinguishing_electronic_devices_using_harmonic_radar","317633370_Matthan_Drone_Presence_Detection_by_Identifying_Physical_Signatures_in_the_Drone's_RF_Communication","316701718_Nonlinear_Radar_for_Finding_RF_Electronics_System_Design_and_Recent_Advancements","308989351_24-GHz_biomedical_radar_on_flexible_substrate_for_ISAR_imaging","305705850_EyeVeri_A_secure_and_usable_approach_for_smartphone_user_authentication","305218416_Soli_Ubiquitous_Gesture_Sensing_with_Millimeter_Wave_Radar","299908544_Reusing_60GHz_Radios_for_Mobile_Radar_Imaging"]}