{"id":"328598009_Hybrid_approach_for_intrusion_detection_using_fuzzy_association_rules_plus_anomaly_and_misuse_detection","abstract":"In today's world, users and enterprises are facing a growing number of internet attacks that are causing damage to their networks. The design and implementation of efficient intrusion detection algorithms is mandatory to minimise such damage and to preserve the integrity and availability of computer networks. Our study, which differs from some of the approaches in the literature that handle anomaly detection and misuse detection separately and, then, aggregate the outcomes, is a novel method for intrusion detection in network traffic based on a hybrid system that hierarchically combines anomaly detection, misuse detection and fuzzy rules. Two techniques for feature selection are used in the training phase, consisting first of reducing the feature space with an Autoencoder and, then, using the Weighted Fuzzy C-Mean Clustering Algorithm (WFCM) to identify the relevant features that are highly predictive in detecting malicious behaviour. These techniques are applied to reduce the input data, which influences the number of fuzzy rules generated. The proposed approach aims to be an accurate and flexible detection system that minimises the number of false alarms and increases the intrusion detection rate. © 2018, International Association of Computer Science and Information Technology.","authors":["Samira Douzi","Ibtissam Benchaji","Bouabid Ouahidi"],"meta":["October 2018","DOI:10.18178/ijmlc.2018.8.5.738"],"references":["4115445_A_serial_combination_of_anomaly_and_misuse_IDSes_applied_to_HTTP_traffic","320005214_Network_Anomaly_Detection_System_using_Genetic_Algorithm_and_Fuzzy_Logic","315324490_Unsupervised_Feature_Extraction_with_Autoencoder_Trees","304288595_Representation_Learning_via_Semi-Supervised_Autoencoder_for_Multi-task_Learning","259138030_A_novel_hybrid_intrusion_detection_method_integrating_anomaly_detection_with_misuse_detection","223845706_Determination_of_fuzzy_logic_membership_functions_using_genetic_algorithms","220200347_Intrusion_detection_using_fuzzy_association_rules","3958373_An_improved_algorithm_for_fuzzy_data_mining_for_intrusion_detection"]}