{"id":"328549484_Which_Cognitive_Abilities_Make_the_Difference_Predicting_Academic_Achievements_in_Advanced_STEM_Studies","abstract":"Previous research has shown that psychometrically assessed cognitive abilities are predictive of achievements in science, technology, engineering and mathematics (STEM) even in highly selected samples. Spatial ability, in particular, has been found to be crucial for success in STEM, though its role relative to other abilities has been shown mostly when assessed years before entering higher STEM education. Furthermore, the role of spatial ability for mathematics in higher STEM education has been markedly understudied, although math is central across STEM domains. We investigated whether ability differences among students who entered higher STEM education were predictive of achievements during the first undergraduate year. We assessed 317 undergraduate students in Switzerland (150 from mechanical engineering and 167 from math-physics) on multiple measures of spatial, verbal and numerical abilities. In a structural equation model, we estimated the effects of latent ability factors on students’ achievements on a range of first year courses. Although ability-test scores were mostly at the upper scale range, differential effects on achievements were found: spatial ability accounted for achievements in an engineering design course beyond numerical, verbal and general reasoning abilities, but not for math and physics achievements. Math and physics achievements were best predicted by numerical, verbal and general reasoning abilities. Broadly, the results provide evidence for the predictive power of individual differences in cognitive abilities even within highly competent groups. More specifically, the results suggest that spatial ability’s role in advanced STEM learning, at least in math-intensive subjects, is less critical than numerical and verbal reasoning abilities.","authors":["Michal Berkowitz","Elsbeth Stern"],"meta":["October 2018Journal of Intelligence 6(4):48","DOI:10.3390/jintelligence6040048","Project: Cognitive predictors of STEM achievements in higher education"],"references":["316322705_Thinking_about_quantity_the_intertwined_development_of_spatial_and_numerical_cognition","302586499_Best_Alternatives_to_Cronbach's_Alpha_Reliability_in_Realistic_Conditions_Congeneric_and_Asymmetrical_Measurements","324014961_Effects_of_cognitive_abilities_on_child_and_youth_academic_achievement_Evidence_from_the_WISC-V_and_WIAT-III","322211373_Non-g_residuals_of_group_factors_predict_ability_tilt_college_majors_and_jobs_A_non-g_nexus","321279464_Developing_3D_spatial_skills_for_engineering_students","318494175_The_nature_of_human_intelligence","315559109_Primary_Mental_Abilities","312958611_Sex_Differences_in_Mental_Rotation_Tasks_Not_Just_in_the_Mental_Rotation_Process","307514907_Separate_but_correlated_The_latent_structure_of_space_and_mathematics_across_development","303919046_Principles_and_Practice_of_Structural_Equation_Modeling"]}