{"id":"328567513_Attribute-oriented_cognitive_concept_learning_strategy_a_multi-level_method","abstract":"Recently, formal concept analysis has become a potential direction of cognitive computing, which can describe the processes of cognitive concept learning. We establish a concept hierarchy structure based on the existing cognitive concept learning methods. However, none of these methods could obtain the following results: get the concept, recognize objects and distinguish between two different objects. In this paper, our focus is to construct an attribute-oriented multi-level cognitive concept learning method so as to improve and enhance the ability of cognitive concept learning. Firstly, the view point of human cognition is discussed from the multi-level approach, and then the mechanism of attribute-oriented cognitive concept learning is investigated. Through some defined special attributes, we propose a corresponding structure of attribute-oriented multi-level cognitive concept learning from an interdisciplinary viewpoint. It is a combination of philosophy and psychology of human cognition. Moreover, to make the presented attribute-oriented multi-level method easier to understand and apply in practice, an algorithm of cognitive concept learning is established. Furthermore, a case study about how to recognize the real-world animals is studied to use the proposed method and theory. Finally, in order to solve conceptual cognition problems, we perform an experimental evaluation on five data sets downloaded from the University of California-Irvine (UCI) databases. And then we provide a comparative analysis with the existing granular computing approach to two-way learning\n[44] and the three-way cognitive concept learning via multi-granularity [9]. We obtain more number of concepts than the two-way learning and the three-way cognitive concept learning approaches, which shows the feasibility and effectiveness of our attribute-oriented multi-level cognitive learning method.","authors":["Bingjiao Fan","E.C.C. Tsang","Weihua Xu","Degang Chen"],"meta":["September 2019International Journal of Machine Learning and Cybernetics 10(3)","DOI:10.1007/s13042-018-0879-5"],"references":["308272910_Three-way_conceptual_approach_for_cognitive_memory_functionalities","305625573_Interval_sets_and_three-way_concept_analysis_in_incomplete_contexts","344254542_On_the_System_Algebra_Foundations_for_Granular_Computing","326661263_Distance-based_double-quantitative_rough_fuzzy_sets_with_logic_operations","318828018_Establishment_of_Cognitive_Relations_Based_on_Cognitive_Informatics","317719988_On_attribute_reduction_in_concept_lattices_Methods_based_on_discernibility_matrix_are_outperformed_by_basic_clarification_and_reduction","317703478_Incorporating_Diversity_and_Informativeness_in_Multiple-Instance_Active_Learning","316446063_Discovering_the_Relationship_Between_Generalization_and_Uncertainty_by_Incorporating_Complexity_of_Classification","312913306_Three-way_concept_learning_based_on_cognitive_operators_An_information_fusion_viewpoint","305520156_Visualizing_Human_Behavior_and_Cognition_The_Case_of_Process_Modeling","303876801_Cognitive_concept_learning_from_incomplete_information","304068423_Concept_lattices_with_negative_information_A_characterization_theorem","301920721_Three-way_cognitive_concept_learning_via_multi-granularity","297501492_Handbook_of_Granular_Computing","284913758_Phonological_Concept_Learning"]}