{"id":"328512464_Exploring_children's_perceptions_of_developing_twenty-first_century_skills_through_computational_thinking_and_programming","abstract":"The role of programming in computing education for children has grown rapidly in recent years with the proliferation of specially designed programming tools, which is grounded on Seymour Papert’s theoretical work in Constructionism. Studies show that some children can develop computational thinking skills and practices with programming activities when learning with the tools through a well-design curriculum in elementary education (or primary education). However, existing studies may not completely address whether programming skills and computational thinking can be connected to the development of other generic skills, which are considered important to the learning and cognitive development of children. This study investigates the impact of programming on three learning competencies (creative thinking, critical thinking and problem solving) known as twenty-first century skills. The conceptual mapping between programming, computational thinking and the three learning competencies is presented. In a one-year intervention in a primary school, students were taught how to build interactive games through programming, and thus explored some basic computational thinking concepts in class. Our results show that children perceived a significant impact of programming on their learning competencies. Yet, the transferability of twenty-first century skills developed through computational thinking and programming may require a further study. Our study provides insights from children as primary respondents to help direct future research in the field of programming and computational thinking education and its potential impact on twenty-first century skills.","authors":["Gary Wong","Ho-Yin Cheung"],"meta":["October 2018Interactive Learning Environments 28(3)","DOI:10.1080/10494820.2018.1534245","Project: The impact of coding education in Hong Kong primary schools: a longitudinal study"],"references":["319959476_Demystifying_computational_thinking","306362494_An_analysis_of_young_students'_thinking_when_completing_basic_coding_tasks_using_Scratch_Jnr_On_the_iPad_General_thinking_and_computational_work","304295837_School_perceptions_of_coding_education_in_K-12_A_large_scale_quantitative_study_to_inform_innovative_practices","304001335_Computational_Thinking_and_Media_Information_Literacy_An_Integrated_Approach_to_Teaching_Twenty-First_Century_Skills","301716623_Computer_science_in_K-12_school_curricula_of_the_2lst_century_Why_what_and_when","345072407_Computational_Thinking_and_Multifaceted_Skills_A_Qualitative_Study_in_Primary_Schools","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","322595635_Computational_Thinking_Equity_in_Elementary_Classrooms_What_Third-Grade_Students_Know_and_Can_Do","315888286_Behavioral_patterns_of_elementary_students_and_teachers_in_one-to-one_robotics_instruction","311004023_A_framework_of_curriculum_design_for_computational_thinking_development_in_K-12_education"]}