{"id":"328566186_Il_etait_une_fois_des_contes_en_contextes_retour_sur_une_experimentation_au_primaire_en_Guadeloupe_et_au_Quebec","abstract":"(FR) Cet article décrit une expérimentation qui a été réalisée dans le cadre d’un programme de recherche plus large intitulé «Technologie éducative pour l’enseignement en contexte». Cette itération s’appuie sur des apprentissages collaboratifs synchrones et asynchrones entre des élèves de Guadeloupe et du Québec, autour d’un objet d’enseignement particulier et commun, le conte. La méthodologie retenue est de type Design-Based Research, et ce, en collaboration avec l’enseignant titulaire de chacune des classes. Elle a consisté à faire travailler deux classes du primaire (élèves de 10 à 11 ans pour la Guadeloupe et de 10 à 12 ans pour le Québec), chacune travaillant sur un conte régional propre à son contexte, en vue d’échanger sur les différences et les ressemblances entre chaque conte, puis d’écrire un conte en commun à la fin de projet. Cette expérimentation a pour objectif de créer des effets de contexte, c’est-à-dire des décalages entre des conceptions d’élèves de deux contextes différents autour d’un objet précis. L’analyse des résultats montre que les élèves des deux territoires sont passés de conceptions majoritairement spontanées et acontextuelles du conte à des conceptions plus confirmées et contextuelles, voire bicontextuelles. Des pistes de réflexion didactique sont ensuite proposées en vue d’exploiter les effets de contexte dans la conception et la mise en œuvre de scénarios pédagogiques au primaire.\n\nMots-clés: Conte, primaire, Guadeloupe, Québec, effets de contexte, enseignement à distance.\n\n--\n\n(EN) This article describes an experiment that was conducted as a part of a broader research project called \"Educational Technology and Teaching in context\" This study is based on synchronous and asynchronous collaborative learning between students from Guadeloupe and Quebec, with the collaboration of their teachers, around a particular and a common teaching object, namely storytelling. The chosen methodology is Design-Based Research. It involved two elementary classes (10-11 years old in Guadeloupe and 10-12 years old in Quebec), each working on a context-specific regional folktale, in order to discuss the differences and similarities between each story. This experimentation is based on the idea of creating context effects, meaning shifts between students’ conceptions from two different contexts around a precise object of study. The results show that students in both territories have moved from naive and acontextual conceptions of storytelling to more expert, contextual, and even bicontextual conceptions. Ideas for reflection are then proposed in order to exploit the effects of context in the design and implementation of pedagogical scenarios in elementary school.\n\nKeywords: folktale, elementary school, Guadeloupe, Quebec, context effects, distance learning.","authors":["Lamprini Chartofylaka","Frédéric Anciaux","Olivier-Serge Candau","Béatrice Jeannot-Fourcaud"],"meta":["July 2018","DOI:10.4000/ced.1014","Project: Technologies éducatives et enseignement en contexte (TEEC)"],"references":["336046435_Quand_les_contextes_se_comparent_et_se_parlentWhen_Contexts_Compare_Each_Other_and_Talk_to_One_Another","320403791_Using_fairy_tales_as_a_model_to_enhance_learners'_writing_organization_skill","272863846_De_la_norme_grammaticale_du_francais_parle_au_Quebec","345733521_L'analyse_de_contenu","322143300_La_litteratie_mediatique_multimodale_appliquee_en_contexte_numerique_-_LMM_Outils_conceptuels_et_didactiques","320181930_Cours_de_linguistique_generale","317511416_Conceptions_d'etudiants_scientifiques_de_Guadeloupe_sur_l'Observation_de_l'Orientation_de_la_lune_et_des_saisons_climatiques","317322936_Vers_un_cadre_d'analyse_operationnel_des_phenomenes_de_contextualisation_didactique","316706753_The_DBR_Methodology_for_the_Study_of_Context_in_Learning","307633573_Introduction_The_discipline_and_practice_of_qualitative_research"]}