{"id":"328523184_Pollution_of_Arctic_Waters_Has_Reached_a_Critical_Point_an_Innovative_Approach_to_This_Problem","abstract":"One of the most important problems in the Arctic Basin is the pollution of its waters and the assessment of its impact on the ecological system of this region. In this paper, we recommend using the geoecological information-modeling system (GIMS) as one of the Big Data tools to address this problem. Specifically, the GIMS includes a series of specific models describing ecological, hydrological, climatic, and hydrochemical processes in Arctic waters. The synthesis of GIMS with the Arctic Basin Ecosystem (ABE) model provides the GIMS-ABE coupled model that takes into account various sources of pollutants, including river runoffs, long-range atmospheric transport, and anthropogenic activities in the coastal zone, as well as ships. In the simulation experiments performed in the present study, heavy metals, oil hydrocarbons, and radionuclides are considered as primary contaminants. In addition, the biocomplexity and survivability indicators were considered as information values to predict the status of the Arctic ecosystem. The results showed a high sensitivity of the Arctic ecosystem to pollution that is currently close to a tipping point. In particular, it emerged that the current state of pollution intensity leads to increased accumulation of pollutants in marine waters at different rates ranging from 7 to 23% depending on the Arctic aquatic environment.","authors":["Costas Varotsos","Vladimir F. Krapivin"],"meta":["October 2018Water Air and Soil Pollution 229(11)","DOI:10.1007/s11270-018-4004-x"],"references":["324459972_Shannon_entropy_maximization_supplemented_by_neurocomputing_to_study_the_consequences_of_a_severe_weather_phenomenon_on_some_surface_parameters","321510518_A_new_big_data_approach_based_on_geoecological_information-modeling_system","321267813_Concentrations_of_heavy_metals_in_bottom_sediments_of_the_yenisei_river_near_krasnoyarsk","319015174_The_Earth's_Population_Can_Reach_14_Billion_in_the_23rd_Century_without_Significant_Adverse_Effects_on_Survivability","315050987_A_new_modeling_tool_for_the_diffusion_of_gases_in_ice_or_amorphous_binary_mixture_in_the_polar_stratosphere_and_the_upper_troposphere","307765659_The_fate_of_riverine_nutrients_on_Arctic_shelves","321525373_Radioactivity_and_Pollution_in_the_Nordic_Seas_and_Arctic_Region","319793433_Problems_of_globalization_and_sustainable_development","317338258_Simulation_results_from_a_coupled_model_of_carbon_dioxide_and_methane_global_cycles","316823867_Global_Climatology_and_Ecodynamics"]}