{"id":"328564305_Materializacao_da_Web_Semantica_um_modelo_de_construcao_dinamica_de_consultas_baseados_em_mapeamento_de_ontologias","abstract":"RESUMO Aproximar a linguagem computacional da humana é um desafio no processo de Recuperação da Informação. Nessa perspectiva, a Web Semântica tem permitido novos meios de tratamento dos dados contidos na Web, afim de permitir melhor compreensão do significado destas informações. Contudo, alguns dos conceitos que envolvem a Web Semântica, como as ontologias, apresentam alta complexidade, dificultando o seu uso. A dificuldade de compreensão, a estrutura que estas possuem, e a diversidade como elas são construídas, tornam o manuseio de ontologias para a descoberta do significado dos conceitos, algo não efetivo, impossibilitando oferecer um panorama concreto do sentido dos conceitos. Assim, essa pesquisa tem como objetivo propor um modelo que verifique o contexto e o significado de um conceito dentro de uma ontologia. Para tal, foi realizado pesquisa bibliográfica, construção do modelo e a implementação de um protótipo, como prova de conceito, para a verificação dos resultados. O modelo e a implementação apresentam como resultado o tratamento genérico de ontologias, obtendo o significado e o contexto que um conceito possui. Baseados nos resultados identifica-se que a utilização de ontologias permite que sistemas computacionais possam apresentar uma perspectiva ampliada do contexto dos dados, atendendo mais eficazmente as necessidades informacionais dos usuários.","authors":["Caio Saraiva Coneglian","José Eduardo Santarem Segundo"],"meta":["June 2018Perspectivas em Ciência da Informação 23(2):33-49","DOI:10.1590/1981-5344/2728"],"references":["303300481_Tecnologias_da_web_semantica_aplicadas_a_organizacao_do_conhecimento_padrao_SKOS_para_construcao_e_uso_de_vocabularios_controlados_descentralizados","270494656_A_representacao_descritiva_no_contexto_da_web_semantica","239562368_A_Web_Semantica_e_suas_contribuicoes_para_a_ciencia_da_informacao","229797155_Information_Science_What_Is_It","228057911_The_Semantic_Web","41175785_Construction_of_Engineering_Ontologies_for_Knowledge_Sharing_and_Reuse"]}