{"id":"328576961_Implementing_Customer_Relationship_Management_to_Increase_Education_Service_using_Service_Quality_Method","abstract":"Schools are one means for students to get education services. Therefore, schools are required to be able to provide good facilities and services for young people who are able and able to work together in community development. However, on the side of customer satisfaction, the school still has shortcomings and not yet optimal, for example seeing the satisfaction of the parents of students, teachers, and students all used questionnaires that are only used in the Certain period of time such as UAS, complaints, criticism advice and consultation are still not stored well (paper-based). In the CRM concept itself has a goal in terms of customer satisfaction, how to see and measure these things, how to formulate and get a definite value of customer satisfaction. then to get valid values used questionnaire instrument, then for the calculation using one method, namely service quality (servqual) which is done by calculating the difference between customer perceptions and customer expectations of a school in accordance with 5 dimensions of service quality, namely: Tangibles (proof measured), Reliability, Responsiveness, Assurance, and Empathy. That it can be seen the value of school customer satisfaction is -0.19 (parents), -0.384 (students) and -0.2167 (teachers). It can be concluded that the value of school customer satisfaction is in the moderate classification, the results of this calculation can be used as a benchmark for improving education services.","authors":["Ali Ibrahim","Shabrina Amatullah"],"meta":["October 2018Journal of Information Systems Engineering and Business Intelligence 4(2)","DOI:10.20473/jisebi.4.2.148-155"],"references":["327980292_PENERAPAN_STRATEGI_CUSTOMER_RELATIONSHIP_MANAGEMENT_CRM_PADA_SISTEM_INFORMASI_PELAYANAN_PELANGGAN_STUDI_KASUS_RUMAH_KREATIF_OGAN_ILIR_INDRALAYA_THE_IMPLEMENTATION_OF_CUSTOMER_RELATIONSHIP_MANAGEMENT_C","294689729_Advances_in_Services_Marketing_Management_Vol"]}