{"id":"328574803_On_the_Expressive_Power_of_Some_Extensions_of_Linear_Temporal_Logic","abstract":"One of the most simple models of computation which is suitable for representation of reactive systems behaviour is a finite state transducer which operates over an input alphabet of control signals and an output alphabet of basic actions. The behaviour of such a reactive system displays itself in the correspondence between flows of control signals and compositions of basic actions performed by the system. We believe that the behaviour of this kind requires more suitable and expressive means for formal specifications than the conventional LT L . In this paper, we define some new (as far as we know) extension LP-LT L of Linear Temporal Logic specifically intended for describing the properties of transducers computations. In this extension the temporal operators are parameterized by sets of words (languages) which represent distinguished flows of control signals that impact on a reactive system. Basic predicates in our variant of the temporal logic are also languages in the alphabet of basic actions of a transducer; they represent the expected response of the transducer to the specified environmental influences. In our earlier papers, we considered a model checking problem for LP-LT L and LP-CT L and showed that this problem has effective solutions. The aim of this paper is to estimate the expressive power of LP-LT L by comparing it with some well known logics widely used in the computer science for specification of reactive systems behaviour. We discovered that a restricted variant LP-1- LT L of our logic is more expressive than LTL and another restricted variant LP -n- LT L has the same expressive power as monadic second order logic S1S.","authors":["Anton Gnatenko","Vladimir Zakharov"],"meta":["October 2018Modeling and Analysis of Information Systems 25(5):506-524","DOI:10.18255/1818-1015-2018-5-506-524"],"references":["326298598_On_the_model_checking_of_finite_state_transducers_over_semigroups","249077335_Regular_Linear_Temporal_Logic","221442685_An_Automata-Theoretic_Approach_to_Automatic_Program_Verification_Preliminary_Report","220690719_Principles_of_Model_Checking","323189453_On_the_Minimization_Problem_for_Sequential_Programs","234800941_Automata_on_Infinite_Objects","222717812_Temporal_logic_can_be_more_expressive","222504369_Dynamic_Linear_Time_Temporal_Logic","222461895_Process_Logic_Expressiveness_Decidability_Completeness","220575001_Propositional_Dynamic_Logic_of_Regular_Programs","2392443_Extended_Temporal_Logic_Revisited","220404837_Synthesis_of_Communicating_Processes_from_Temporal_Logic_Specifications","220247005_An_Until_Hierarchy_and_Other_Applications_of_an_Ehrenfeucht-Fraisse_Game_for_Temporal_Logic","36179974_Tense_Logic_and_the_Theory_of_Linear_Order","2410124_Verifying_Systems_with_Infinite_but_Regular_State_Spaces"]}