{"id":"328547419_Development_of_an_Accounting_Skills_Simulation_Practice_System_Based_on_the_BS_Architecture","abstract":"Nowadays, companies are more in need of accounting professionals with both theoretical knowledge and practical abilities. However, the traditional accounting teaching model in colleges and universities cannot train students in both aspects. In order to improve the practical abilities of accounting major students in colleges and universities and promote the accounting teaching upgrade and reform, this paper proposes an accounting skills simulation practice system based on the B/S architecture, aiming at improving the comprehensive abilities of accounting students and teaching efficiency. The technical roadmap of this system adopts the B/S as the network architecture of the teaching system, HTML and Java Script language as the system programming language and MySQL database as the data storage and management database. The system consists of user administration, knowledge base management, teaching content management, practical test score management and other modules, which not only achieves the self-evaluation on the full set of accounting skills, but also improves the accounting teaching efficiency and helps teachers gain more control over the teaching process. This study can serve as some guidance to colleges and universities in cultivating innovative and practical accounting talents.","authors":["Jianmei Liu","Rong Fu"],"meta":["October 2018International Journal of Emerging Technologies in Learning (iJET) 13(10):134","DOI:10.3991/ijet.v13i10.9459"],"references":["313033971_PENGEMBANGAN_SOFTWARE_OF_HOSPITALITY_ACCOUNTING_DICTIONARY","276192825_Teaching_and_Assessing_Primary_Care_Skills_The_Family_Practice_Simulator_Model","224504439_Automatic_AJAX_application_testing","45658176_Web_based_Library_Information_System_Using_PHP_and_MYSQL","314272364_Radiative_transfer_modeling_through_terrestrial_atmosphere_and_ocean_accounting_for_inelastic_processes_Software_package_SCIATRAN","245330702_A_methodological_framework_for_the_triple_bottom_line_accounting_and_management_of_industry_enterprises","225296047_Practical_skills_teaching_in_contemporary_surgical_education_How_can_educational_theory_be_applied_to_promote_effective_learning","3249398_Ajax_Frameworks_in_Interactive_Web_Apps","3248245_MySQL_Lessons_learned_on_a_digital_library","3247611_Model_for_software_practices_from_the_accounting_profession","3188511_A_simulation_approach_to_structure-based_software_reliability_analysis","2880129_SQLrand_Preventing_SQL_injection_attacks"]}