{"id":"328688200_Self-to-Prototype_Similarity_as_a_Mediator_Between_Gender_and_Students'_Interest_in_Learning_to_Code","abstract":"There is scarcely any other field in which women are so underrepresented as they are in computer sciences. Socio-psychological literature suggests that students are more likely to engage in domains they perceive as fitting their identity (Kessels, Heyder, Latsch & Hannover, 2014). As the Science, Technology, Engineering, and Mathematics (STEM) prototype (e.g. a typical student interested in computer sciences) is linked with agentic-masculine traits (e.g. competitiveness) and not with communal-feminine traits (e.g. helping others), most girls regard STEM subjects as incompatible with their self-view. We investigated whether coding courses for students linked with communal goals were more attractive to girls compared to coding courses associated with agentic goals. We assumed greater self-to-prototype similarity would mediate the link between the students' gender and their interest in learning to code. Based on structural equation modeling with 459 German ninth-and tenth-grade students, our results confirm our hypothesis: girls showed greater interest in learning to code if course descriptions were focused on communal goals, while boys showed greater interest under the agentic-goal condition. As expected, self-to-prototype similarity mediated the relationship between gender and interest in the communal coding course. With regard to the agentic coding course, we found only a partial mediating effect. Our results provide recommendations for the development of STEM interventions that encourage the inclusion of female students.","authors":["Janine Neuhaus","Andreas Borowski"],"meta":["November 2018"],"references":["304815061_Traditional_Masculinity_and_Femininity_Validation_of_a_New_Scale_Assessing_Gender_Roles","304145352_Gender_Roles_and_Stereotypes_about_Science_Careers_Help_Explain_Women_and_Men's_Science_Pursuits","284139559_Computing_our_future_Computer_programming_and_coding_-_Priorities_school_curricula_and_initiatives_across_Europe","283279560_Women_15_Times_More_Likely_to_Leave_STEM_Pipeline_After_Calculus_Compared_to_Men_Lack_of_Mathematical_Confidence_a_Potential_Culprit","355942082_Masculinity_and_Femininity_Their_Psychological_Dimensions_Correlates_and_Antecedents","325795527_Role_congruity_theory_of_prejudice_toward_female_leaders","321389363_Bridging_the_gap_by_enhancing_the_fit_How_stereotypes_about_STEM_clash_with_stereotypes_about_girls","309021383_Why_are_some_STEM_fields_more_gender_balanced_than_others","289963909_Entwicklung_schulischer_Interessen_als_Identitatsregulation","289963250_Entwicklung_schulischer_Interessen_als_Identitatsregulation"]}