{"id":"328643367_Teaching_Game_Design_and_Basic_Computing_Concepts_a_Democratic_Experiment_in_a_Socioeconomically_Vulnerable_Community","abstract":"Computational Thinking has been promising for inclusive education in Computing. This paper presents a game programming course planned and conducted with Brazilian young people in a socioeconomically vulnerable community. In this non-formal course, nine workshops were designed and conducted considering participants' language and social context. Workshops were grounded on a structural framework based on Paulo Freire's method and their practices were inspired by techniques from Participatory Design. The paper presents the theoretical and methodological grounds adopted for the course, the structure designed for the workshops, the main observations and main learned lessons from the experience. Results suggest the course was successful to provide a meaningful education in basic computing concepts, engaging students throughout the workshops and reducing students dropout.","authors":["Ermelindo Paulo Breviglieri Schultz","Júlia Ortiz","Laura Sánchez García","Roberto Pereira"],"meta":["October 2018","DOI:10.5753/cbie.sbie.2018.1103","Conference: XXIX Simpósio Brasileiro de Informática na EducaçãoAt: Fortaleza, CE","Projects: Computando Meu Contexto: Projeto de ExtensãoPlain Literacy for Everyone"],"references":["351617652_COMPUTING_WITH_A_COMMUNITY_FOCUS_OUTCOMES_FROM_AN_APP_INVENTOR_SUMMER_CAMP_FOR_MIDDLE_SCHOOL_STUDENTS","317928214_Child_as_Protagonist_Expanding_the_Role_of_Children_in_Participatory_Design","262314073_Toward_Culturally_Responsive_Computing_Education","221537912_Socially_relevant_computing","220422722_Ethnocomputing_ICT_in_cultural_and_social_context","345543433_Participatory_Design_for_Learning","287391362_Learner-Centered_Design_of_Computing_Education_Research_on_Computing_for_Everyone","245780655_Constructionism_Tools_to_Build_and_Think_With","34009441_Metodo_Paulo_Freire_principios_e_praticas_de_uma_concepcao_popular_de_educacao"]}