{"id":"328683918_Listening_without_ears_Artificial_intelligence_in_audio_mastering","abstract":"Since the inception of recorded music there has been a need for standards and reliability across sound formats and listening environments. The role of the audio mastering engineer is prestigious and akin to a craft expert combining scientific knowledge, musical learning, manual precision and skill, and an awareness of cultural fashions and creative labour. With the advent of algorithms, big data and machine learning, loosely termed artificial intelligence in this creative sector, there is now the possibility of automating human audio mastering processes and radically disrupting mastering careers. The emergence of dedicated products and services in artificial intelligence-driven audio mastering poses profound questions for the future of the music industry, already having faced significant challenges due to the digitalization of music over the past decades. The research reports on qualitative and ethnographic inquiry with audio mastering engineers on the automation of their expertise and the potential for artificial intelligence to augment or replace aspects of their workflows. Investigating audio mastering engineers' awareness of artificial intelligence, the research probes the importance of criticality in their labour. The research identifies intuitive performance and critical listening as areas where human ingenuity and communication pose problems for simulation. Affective labour disrupts speculation of algorithmic domination by highlighting the pragmatic strategies available for humans to adapt and augment digital technologies.","authors":["Thomas Birtchnell"],"meta":["July 2018Big Data & Society 5(2):205395171880855","DOI:10.1177/2053951718808553","Project: Enhanced humans, robotics and the future of work"],"references":["325426985_Deconstructing_the_algorithmic_sublime","322341576_Algorithms_as_fetish_Faith_and_possibility_in_algorithmic_work","320970808_Algorithms_as_culture_Some_tactics_for_the_ethnography_of_algorithmic_systems","318683164_Toward_human-centered_algorithm_design","347667829_Artificial_Intelligence_What_Everyone_Needs_to_KnowRWhat_Everyone_Needs_to_KnowR","347097250_Beyond_Unwanted_Sound_Noise_Affect_and_Aesthetic_Moralism","346821192_The_Future_of_the_Professions_How_Technology_Will_Transform_the_Work_of_Human_ExpertsHow_Technology_Will_Transform_the_Work_of_Human_Experts","322646687_Algorithmic_brand_culture_participatory_labour_machine_learning_and_branding_on_social_media","320838405_Rethinking_creative_industries_research_Synthesizing_the_Creative_Class_thesis_clustering_and_global_production_network_approaches","318893945_Recommendation_Systems_as_Technologies_of_the_Self_Algorithmic_Control_and_the_Formation_of_Music_Taste"]}