{"id":"328657059_Autonomous_Flight_and_Real-Time_Tracking_of_Unmanned_Aerial_Vehicle_Proceedings_of_the_2018_Computing_Conference_Volume_1","abstract":"This study describes a system in which a micro UAV (quadrotor) was combined with a Kinect (v2), a Myo armband and an RGB camera. The quadrotor was connected to two PC clients or workstations and communicated through the Robot Operating System. The UAV moved to the marked targets in a cluttered environment without collision using the depth sensor. Recognises faces via the on-board camera based on the frame by frame basis and uses feature-based monocular simultaneous localisation and mapping (SLAM) in real-time. The SLAM tracks the pose of the quadrotor, simultaneously builds an incremental map of the surrounding environment to locate the UAV in that. The Myo armband was employed for teleoperation which commands the quadrotor to start/stop its journey or to begin a new task using hand gestures. The face recognition algorithm was developed using the Fisherface library and pre-trained database. Three missions were assigned to the UAV; to detect the marked area via Kinect’s depth sensor, fly towards and hover around the marked area, send the image/video streams to the ground station and to look for the person’s face in the crowded environment, match the name with the face owner and follow him/her within the distance of 2 m. Various organisations could use the proposed system for different purposes. It could be utilised for search and rescue, environmental monitoring, surveillance or inspection. It also could be used to identify a person in a collapsed building, in urban/suburban areas or to locate people with a particular need (alzheimer or dementia casualties which leads to wandering behaviour).","authors":["Bogdan Muresan","Shabnam Sadeghi-Esfahlani"],"meta":["January 2019","DOI:10.1007/978-3-030-01174-1_73","In book: Intelligent Computing (pp.945-956)"],"references":["317083802_Eigenfaces_vs_Fisherfaces_Recognition_Using_Class_Specific_Linear_Projection","312279333_ROS_ROBOTICS_BY_EXAMPLE","312214487_A_Hybrid_Method_for_Online_Trajectory_Planning_of_Mobile_Robots_in_Cluttered_Environments","319972376_Crazyflie_20_quadrotor_as_a_platform_for_research_and_education_in_robotics_and_control_engineering","319770286_Visual_Odometry_and_Mapping_for_Autonomous_Flight_Using_an_RGB-D_Camera","313658583_Bundle_adjustment_-_A_modern_synthesis","311753712_Towards_automated_system_and_experiment_reproduction_in_robotics","309317476_ORB-SLAM2_an_Open-Source_SLAM_System_for_Monocular_Stereo_and_RGB-D_Cameras","306926699_Visual_Odometry_and_Mapping_for_Autonomous_Flight_Using_an_RGB-D_Camera","303123869_Parallel_tracking_and_mapping_for_small_AR_workspaces"]}