{"id":"328646148_Configuring_Information_Systems_and_Work_Practices_for_Each_Other_What_Competences_Are_Needed_Locally","abstract":"Previously technical design was the realm of software engineers; now it is increasingly completed by users who configure systems after go-live. To exploit the possibilities afforded by systems the users also adapt their practices in response to their systems. The process of configuring systems and practices for each other is rich in local particulars, protracted in time, and demanding in competences. In this study we catalog the competences needed locally to accomplish change by configuring systems and practices for each other. The empirical context for the study is a project about reducing hospital patients’ fasting time before surgical operations. We identify and describe 21 competences that must be present locally. They form seven types: managing projects, understanding practice, understanding technology, preparing change, making change, assessing change, and personal traits. The project participants display the competence types with varying frequencies, thereby for example indicating that understanding practice is a larger issue than understanding technology. Preparing and making change are, probably, the two competence types that are most thinly spread locally. The catalog of the competences needed locally to configure systems and practices for each other after go-live can inform decisions about project staffing, competence building, and – more generally – curriculum development.","authors":["Morten Hertzum","Jesper Simonsen"],"meta":["October 2018International Journal of Human-Computer Studies 122","DOI:10.1016/j.ijhcs.2018.10.006"],"references":["322004280_MSIS_2016_Global_Competency_Model_for_Graduate_Degree_Programs_in_Information_Systems","313578731_Participatory_Continuing_Design_'Living_with'_Videoconferencing_in_Rehabilitation","271534593_Practice_Guideline_Recommendations_on_Perioperative_Fasting_A_Systematic_Review","269791910_Understanding_Competencies_and_Competency_Modeling_-_A_Literature_Survey","265082356_Typology_of_Knowledge_Skills_and_Competences_Clarification_of_the_Concept_and_Prototype","331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","313597543_An_improvisational_model_for_change_management_The_case_of_groupware_technologies","313053833_Champions_for_Radical_New_Inventions","303505300_Generative_Innovation_A_Comparison_of_Lightweight_and_Heavyweight_IT","284145284_Applied_organization_change_in_industry_Structural_technical_and_human_approaches"]}