{"id":"328655434_The_Good_the_Bad_and_the_Uncertain_Contributions_of_Volunteered_Geographic_Information_to_Community_Disaster_Resilience","abstract":"The adoption of location-based information sharing technologies, and the emergence of volunteered geographic information (VGI), has seen changes to community involvement in disaster management. The concept of resilience, and recognition of the capacity for renewal, reorganization , and societal development, has gained currency in disaster management. However, the opportunities presented by spatially referenced data for sourcing contextual information for understanding processes of social-ecological resilience and fostering local inclusion has not been examined. We examine how web 2.0 platforms, including VGI and social media, can support resilience building, and critically evaluate how these technologies potentially undermine resilience. We concentrate our analysis on factors deemed important for community disaster resilience through review of recent literature, policy documents, and author experience. Establishing which elements of VGI in disaster management should be emphasized, such as increased flexibility or individual empowerment, and which require careful management, such as compromised privacy or data quality, will enable VGI to become less opportunistic, data-centric, disruptive, and exclusionary, and allow for more reliable, community-centric, complementary, and socially inclusive practices. Incorporating awareness and training on collaborative geoweb technologies into disaster preparedness programs will equip individuals to make informed judgments on VGI content and reduce unintended consequences of social media initiatives.","authors":["Billy Haworth","Eleanor Bruce","Joshua Whittaker","Roisin Read"],"meta":["November 2018Frontiers in Earth Science 6:183","DOI:10.3389/feart.2018.00183"],"references":["317959347_Datafying_Disaster_Institutional_Framings_of_Data_Production_following_Superstorm_Sandy_Accepted","317487173_Implications_of_Volunteered_Geographic_Information_for_Disaster_Management_and_GIScience_A_More_Complex_World_of_Volunteered_Geography","308535661_Assessing_the_application_and_value_of_participatory_mapping_for_community_bushfire_preparation","345859293_Beautiful_Data_A_History_of_Vision_and_Reason_since_1945","323649207_The_spread_of_true_and_false_news_online","323335773_Geographies_of_resilience_Challenges_and_opportunities_of_a_descriptive_concept","322738844_Why_is_participation_inequality_important","320606802_A_Long-Term_Perspective_on_Resilience_in_Socio-Natural_Systems","317617296_Regions_of_Risk_A_Geographical_Introduction_to_Disasters","312977371_Resilience_and_adaptive_cycles"]}