{"id":"328680038_Word_and_Sentence_Embedding_Tools_to_Measure_Semantic_Similarity_of_Gene_Ontology_Terms_by_Their_Definitions","abstract":"The gene ontology (GO) database contains GO terms that describe biological functions of genes. Previous methods for comparing GO terms have relied on the fact that GO terms are organized into a tree structure. Under this paradigm, the locations of two GO terms in the tree dictate their similarity score. In this article, we introduce two new solutions for this problem by focusing instead on the definitions of the GO terms. We apply neural network-based techniques from the natural language processing (NLP) domain. The first method does not rely on the GO tree, whereas the second indirectly depends on the GO tree. In our first approach, we compare two GO definitions by treating them as two unordered sets of words. The word similarity is estimated by a word embedding model that maps words into an N-dimensional space. In our second approach, we account for the word-ordering within a sentence. We use a sentence encoder to embed GO definitions into vectors and estimate how likely one definition entails another. We validate our methods in two ways. In the first experiment, we test the model's ability to differentiate a true protein-protein network from a randomly generated network. In the second experiment, we test the model in identifying orthologs from randomly matched genes in human, mouse, and fly. In both experiments, a hybrid of NLP and GO tree-based method achieves the best classification accuracy.","authors":["Dat Duong","Wasi Uddin Ahmad","Eleazar Eskin","Kai-Wei Chang"],"meta":["October 2018Journal of Computational Biology: a Journal of Computational Molecular Cell Biology 26(1)","DOI:10.1089/cmb.2018.0093"],"references":["323664117_Applying_meta-analysis_to_genotype-tissue_expression_data_from_multiple_tissues_to_identify_eQTLs_and_increase_the_number_of_eGenes","317163814_Expansion_of_the_Gene_Ontology_knowledgebase_and_resources","305728837_Gene_Ontology_semantic_similarity_tools_survey_on_features_and_challenges_for_biological_knowledge_discovery","288323683_simDEF_Definition-based_Semantic_Similarity_Measure_of_Gene_Ontology_Terms_for_Functional_Similarity_Analysis_of_Genes","284576917_Glove_Global_Vectors_for_Word_Representation","269188046_Information_Content-Based_Gene_Ontology_Functional_Similarity_Measures_Which_One_to_Use_for_a_Given_Biological_Data_Type","261034600_GOssTo_A_stand-alone_application_and_a_web_tool_for_calculating_semantic_similarities_on_the_Gene_Ontology","322590138_Supervised_Learning_of_Universal_Sentence_Representations_from_Natural_Language_Inference_Data","320349544_Co-expression_networks_reveal_the_tissue-specific_regulation_of_transcription_and_splicing","301408902_Linguistic_Regularities_in_Sparse_and_Explicit_Word_Representations"]}