{"id":"328613936_A_Multi-Paradigm_Modelling_approach_to_live_modelling","abstract":"To develop complex systems and tackle their inherent complexity, (executable) modelling takes a prominent role in the development cycle. But whereas good tool support exists for programming, tools for executable modelling have not yet reached the same level of functionality and maturity. In particular, live programming is seeing increasing support in programming tools, allowing users to dynamically change the source code of a running application. This significantly reduces the edit–compile–debug cycle and grants the ability to gauge the effect of code changes instantly, aiding in debugging and code comprehension in general. In the modelling domain, however, live modelling only has limited support for a few formalisms. In this paper, we propose a Multi-Paradigm Modelling approach to add liveness to modelling languages in a generic way, which is reusable across multiple formalisms. Live programming concepts and techniques are transposed to (domain-specific) executable modelling languages, clearly distinguishing between generic and language-specific concepts. To evaluate our approach, live modelling is implemented for three modelling languages, for which the implementation of liveness substantially differs. For all three cases, the exact same structured process was used to enable live modelling, which only required a “sanitization” operation to be defined.","authors":["Yentl Van Tendeloo","Simon Van Mierlo","Hans Vangheluwe"],"meta":["October 2019Software and Systems Modeling 18(A)","DOI:10.1007/s10270-018-0700-7"],"references":["335321540_Optimizing_Simulink_Models","322319142_The_Modelverse_A_tool_for_Multi-Paradigm_Modelling_and_simulation","319127461_Toward_live_domain-specific_languages_From_text_differencing_to_adapting_models_at_run_time","318494443_Implementing_Level_4_Liveness_in_Declarative_Visual_Programming_Languages","318494157_Real-time_programming_and_the_big_ideas_of_computational_literacy","305794650_Debugging_parallel_DEVS","300787413_Extensible_Debugger_Framework_for_Extensible_Languages","299711284_FTGPM_An_Integrated_Framework_for_Investigating_Model_Transformation_Chains","290556953_Textual_executable_translatable_UML","290462109_Subtext"]}