{"id":"328619320_The_gCube_system_Delivering_Virtual_Research_Environments_as-a-Service","abstract":"Important changes have characterised research and knowledge production in recent decades. These changes are associated with developments in information technologies and infrastructures. The processes characterising research and knowledge production are changing through the digitalisation of science, the virtualisation of research communities and networks, the offering of underlying systems and services by infrastructures. This paper gives an overview of gCube, a software system promoting elastic and seamless access to research assets (data, services, computing) across the boundaries of institutions, disciplines and providers to favour collaboration-oriented research tasks. gCube's technology is primarily conceived to enable Hybrid Data Infrastructures facilitating the dynamic definition and operation of Virtual Research Environments. To this end, it offers a comprehensive set of data management commodities on various types of data and a rich array of “mediators” to interface well-established Infrastructures and Information Systems from various domains. Its effectiveness has been proved by operating the D4Science.org infrastructure and serving concrete, multidisciplinary, challenging, and large scale scenarios.","authors":["Massimiliano Assante","Leonardo Candela","Donatella Castelli","Roberto Cirillo"],"meta":["October 2018Future Generation Computer Systems 95","DOI:10.1016/j.future.2018.10.035","Project: gCube Software System"],"references":["328073102_Reconstructing_3D_Virtual_Environments_within_a_Collaborative_e-Infrastructure","323152981_Forecasting_the_ongoing_invasion_of_Lagocephalus_sceleratus_in_the_Mediterranean_Sea","309101613_A_Web_application_to_publish_R_scripts_as-a-Service_on_a_Cloud_computing_platform","291179278_Towards_Another_Scientific_Revolution","270896182_Science_20_Repositories_Time_for_a_Change_in_Scholarly_Communication","310828272_Towards_an_open_cloud_standard","309900921_A_Bayesian_approach_for_estimating_length-weight_relationships_in_fishes","293813575_Science_gateway_workshops_2014_special_issue_conference_publications","291258026_Who_Cares_about_Science_Gateways_A_Large-Scale_Survey_of_Community_Use_and_Needs","267513146_Parallelizing_the_Execution_of_Native_Data_Mining_Algorithms_for_Computational_Biology"]}