{"id":"328649776_DeepCrack_Learning_Hierarchical_Convolutional_Features_for_Crack_Detection","abstract":"Cracks are typical line structures that are of interest in many computer-vision applications. In practice, many cracks, e.g., pavement cracks, show poor continuity and low contrast, which bring great challenges to image-based crack detection by using low-level features. In this paper, we propose DeepCrack-an end-to-end trainable deep convolutional neural network for automatic crack detection by learning high-level features for crack representation. In this method, multi-scale deep convolutional features learned at hierarchical convolutional stages are fused together to capture the line structures. More detailed representations are made in larger scale feature maps and more holistic representations are made in smaller scale feature maps. We build DeepCrack net on the encoder–decoder architecture of SegNet and pairwisely fuse the convolutional features generated in the encoder network and in the decoder network at the same scale. We train DeepCrack net on one crack dataset and evaluate it on three others. The experimental results demonstrate that DeepCrack achieves\n$F$ \n-measure over 0.87 on the three challenging datasets in average and outperforms the current state-of-the-art methods.","authors":["Qin Zou","Zheng Zhang","Qingquan Li","Xianbiao Qi"],"meta":["October 2018IEEE Transactions on Image Processing PP(99):1-1","DOI:10.1109/TIP.2018.2878966","Project: Crack Detection"],"references":["322749812_SegNet_A_Deep_Convolutional_Encoder-Decoder_Architecture_for_Image_Segmentation","320971612_Richer_Convolutional_Features_for_Edge_Detection","320964507_SRN_Side-Output_Residual_Network_for_Object_Symmetry_Detection_in_the_Wild","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316945768_Crack_Segmentation_by_Leveraging_Multiple_Frames_of_Varying_Illumination","314296805_Path_voting_based_pavement_crack_detection_from_laser_range_images","313026065_Convolutional_channel_features","311610938_SemiContour_A_Semi-Supervised_Learning_Approach_for_Contour_Detection","311609706_Weakly_Supervised_Object_Boundaries","311609660_Object_Contour_Detection_with_a_Fully_Convolutional_Encoder-Decoder_Network"]}