{"id":"328631434_Replicability_or_reproducibility_On_the_replication_crisis_in_computational_neuroscience_and_sharing_only_relevant_detail","abstract":"Replicability and reproducibility of computational models has been somewhat understudied by “the replication movement.” In this paper, we draw on methodological studies into the replicability of psychological experiments and on the mechanistic account of explanation to analyze the functions of model replications and model reproductions in computational neuroscience. We contend that model replicability, or independent researchers' ability to obtain the same output using original code and data, and model reproducibility, or independent researchers' ability to recreate a model without original code, serve different functions and fail for different reasons. This means that measures designed to improve model replicability may not enhance (and, in some cases, may actually damage) model reproducibility. We claim that although both are undesirable, low model reproducibility poses more of a threat to long-term scientific progress than low model replicability. In our opinion, low model reproducibility stems mostly from authors' omitting to provide crucial information in scientific papers and we stress that sharing all computer code and data is not a solution. Reports of computational studies should remain selective and include all and only relevant bits of code.","authors":["Marcin Miłkowski","Mateusz Hohol","Witold M. Hensel"],"meta":["December 2018Journal of Computational Neuroscience","DOI:10.1007/s10827-018-0702-z","Project: Cognitive Science in Search of Unity"],"references":["323220816_Missing_data_hinder_replication_of_artificial_intelligence_studies","322871684_Active_inference_and_the_anatomy_of_oculomotion","322574748_Reproducibility_vs_Replicability_A_Brief_History_of_a_Confused_Terminology","318460873_Sustainable_computational_science_The_ReScience_Initiative","345665888_Are_More_Details_Better_On_the_Norms_of_Completeness_for_Mechanistic_Explanations","325488313_Statistics_for_Nuclear_and_Particle_Physicists","323708363_An_empirical_analysis_of_journal_policy_effectiveness_for_computational_reproducibility","321641597_A_Commitment_to_Open_Source_in_Neuroscience","320658906_Making_replication_mainstream","314304453_Measurement_error_and_the_replication_crisis"]}