{"id":"328661185_Students_Attitudes_Towards_Choosing_Information_Technology_and_Computer_Science_Courses_In_Relation_To_Gender_Journal_of_Advances_in_Education_and_Philosophy","abstract":"The article investigated students attitudes towards choosing Information technology and computer science courses in relation to gender. The study adopted an observational, cross-sectional exploration design with both quantitative and qualitative methods of data collection. A structured questionnaire and an interview guides were employed togather information from the respondents. Data was analyzed using frequency tabless. Study findings showed that there was a positive correlation between attitudes of students towards choosing Information technology and computer science course relating it to gender. The study recommended that there is need to advertise and give scholarships to young females to specifically pursue Information technology and computer science courses. There is need to encourage girl child education through the practice of positive discrimination and affirmative action in society. The society should be sensitized on the importance of a girl child so that elimination of gender stereotyping becomes easy. The study also suggests encouraging female candidates to apply for Information technology and computer science course and addressing gender-imbalance through student development programs. Universities should organize workshops or visit secondary schools and complain for a girls to take up Information technology and computer science course and also tell them that it is possible for them to do the course and should be told that Information technology and computer science is not only meant for males only, everyone can do it irrespective of sex and gender.","authors":["Bukenya Moses","Hadijah Nansamba","Kobugabe Christine","Rubalema Alex"],"meta":["September 2018","Project: Publications"],"references":["243766371_Determining_Sample_Size_for_Research_Activities","229574496_Gender-and_grade-level_differences_in_science_interest_and_participation","227133495_Impact_of_science-technology_learning_environment_characteristics_on_learning_outcomes_Pupils'_perceptions_and_gender_differences"]}