{"id":"328661131_DoggyVision_Examining_how_Dogs_Canis_familiaris_Interact_with_Media_using_a_Dog-Driven_Proximity_Tracker_Device","abstract":"With screen technology becoming ubiquitously embedded into our homes, these screens are often in places where they can be viewed by domestic dogs (Canis familiaris); however, there is a lack of research showing to what extent, and for how long, dogs attend to media on screens. One pressing question is to understand if a dog, given the opportunity, would or could control its own viewing. This paper describes a prototype system (DoggyVision) that gives control to a dog in regard to the turning on and off of a TV screen in order to study activation with screen media in home settings. The system is used with two dogs to explore the interaction modalities between machine and dog. DoggyVision is shown to be non-invasive for the dog and easy to use in the home. Recordings show that dogs did attend to the screen but did not appear, in this study, to change their activation behaviors around the TV screen between being in no control (week 1), and in some control (week 2), of the TV media presentation. The study builds on ‘dog- entered’ methods to examine a dog’s behavior non-invasively demonstrating that useful data can be yielded from dog-driven devices within the home. For the Animal Computer Interaction community, this is the first system that allows the dog to trigger the activation of the device as the system records the activation automatically.","authors":["Ilyena Hirskyj-Douglas","Janet C. Read"],"meta":["November 2018Animal Behavior and Cognition","DOI:10.26451/abc.05.04.06.2018"],"references":["317325804_Who_to_ask_for_help_Do_dogs_form_an_opinion_on_humans_based_on_skilfulness","315991102_Canine-Centered_Computing","311622202_Canine_computer_interaction_towards_designing_a_touchscreen_interface_for_working_dogs","306365872_Towards_a_canine-human_communication_system_based_on_head_gestures","305319163_Using_Behavioural_Information_to_Help_Owners_Gather_Requirements_from_their_Dogs'_Responses_to_Media_Technology","312862882_Usability_and_Human_Computer_Interaction_HCI","311622016_Semi-supervised_classification_of_static_canine_postures_using_the_Microsoft_Kinect","311621799_The_impact_of_training_approaches_on_experimental_setup_and_design_of_wearable_vibrotactiles_for_hunting_dogs","309295009_Animal-Computer_Interaction_the_Emergence_of_a_Discipline","306366241_Towards_the_non-visual_monitoring_of_canine_physiology_in_real-time_by_blind_handlers"]}