{"id":"328635703_Fluorescence_in_situ_hybridization_FISH_History_limitations_and_what_to_expect_from_micro-scale_FISH","abstract":"In this article, we review an important cytogenetic technique - fluorescence in situ hybridization (FISH) - which is used for obtaining spatial genomic and transcriptomic information. FISH is widely utilized in genomic and cell biological research as well as for diagnostic applications in preventive and reproductive medicine, and oncology. It is the gold standard technique for the detection of chromosomal abnormalities. Despite the high specificity of FISH and the possibility of direct quantitative imaging, some of its key limitations prevent its regular use in diagnostics. To promote the extensive use of FISH for these applications, limitations in assay time and probe consumption will need to be addressed. Microfluidic technologies hold great promise in improving exactly these parameters. In the past two decades, microtechnology has matured and enabled a new line of analysis tools for biomedical and chemical sciences. Incidentally, the convergence of microtechnology with microfluidics is starting to have a decisive impact in the field of medical diagnostics. By miniaturizing implementations of diagnostic assays, the special characteristics of fluid flow in small volumes can be leveraged to modify reaction kinetics and thus reagent delivery time of assays. Here we highlight selected important historical views on FISH, review its current implementations, and provide a perspective on the future developments and the micro-scale implementations of FISH.","authors":["D. Huber","L. Voith von Voithenberg","Govind Kaigala"],"meta":["October 2018Micro and Nano Engineering 1","DOI:10.1016/j.mne.2018.10.006"],"references":["325462307_Rapid_micro_fluorescence_in_situ_hybridization_in_tissue_sections","314140391_Clinical_use_of_biomarkers_in_breast_cancer_Updated_guidelines_from_the_European_Group_on_Tumor_Markers_EGTM","270911268_Prediction_of_melting_temperatures_in_fluorescence_in_situ_hybridization_FISH_procedures_using_thermodynamic_models","49826305_FISH_Finder_a_high-throughput_tool_for_analyzing_FISH_images","21571387_Reverse_chromosome_painting_A_method_for_the_rapid_analysis_of_aberrant_chromosomes_in_clinical_cytogenetics","222585088_Planar_Chips_Technology_for_Miniaturization_and_Integration_of_Separation_Techniques_into_Monitoring_Systems_-_Capillary_Electrophoresis_on_a_Chip","24031728_Analytical_Ancestry_Firsts_in_Fluorescent_Labeling_of_Nucleosides_Nucleotides_and_Nucleic_Acids","22963954_A_new_method_of_in_situ_hybridization","22739983_High_resolution_detection_of_DNA-RNA_hybrids_in_situ_by_immunofluorescence","21852911_Multicolor_fluorescence_in_situ_hybridization_for_the_simultaneous_detection_of_probe_sets_for_chromosomes_13_18_21_X_and_Y_in_uncultured_amniotic_fluid_cells"]}