{"id":"328762227_An_Effective_Ensemble_Framework_for_Multi-Objective_Optimization","abstract":"This paper proposes an effective ensemble framework for tackling multi-objective optimization problems, by combining the advantages of various evolutionary operators and selection criteria that are run on multiple populations. A simple ensemble algorithm is realized as a prototype to demonstrate our proposed framework. Two mechanisms, namely competition and cooperation, are employed to drive the running of the ensembles. Competition is designed by adaptively running different evolutionary operators on multiple populations. The operator that better fits the problem’s characteristics will receive more computational resources, being rewarded by a decomposition-based credit assignment strategy. Cooperation is achieved by a cooperative selection of the offspring generated by different populations. In this way, the promising offspring from one population have chances to migrate into the other populations to enhance their convergence or diversity. Moreover, the population update information is further exploited to build an evolutionary potentiality model, which is used to guide the evolutionary process. Our experimental results show the superior performance of our proposed ensemble algorithms in solving most cases of a set of thirty-one test problems, which corroborates the advantages of our ensemble framework.","authors":["Wenjun Wang","Shaoqiang Yang","Qiuzhen Lin","Qingfu Zhang"],"meta":["November 2018IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99):1-1","DOI:10.1109/TEVC.2018.2879078"],"references":["317553913_An_External_Archive-Guided_Multiobjective_Particle_Swarm_Optimization_Algorithm","313126052_A_methodology_for_determining_an_effective_subset_of_heuristics_in_selection_hyper-heuristics","305379001_A_Classification_and_Comparison_of_Credit_Assignment_Strategies_in_Multiobjective_Adaptive_Operator_Selection","313841600_Adaptive_Operator_Selection_for_Many-Objective_Optimization_with_NSGA-III","305820912_Cloudde_A_Heterogeneous_Differential_Evolution_Algorithm_and_Its_Distributed_Cloud_Version","302560124_A_fast_elitist_multi-objective_genetic_algorithm_NSGA-II","301975037_MOEAD-HH_A_Hyper-Heuristic_for_Multi-objective_Problems","292344221_A_Novel_Adaptive_Hybrid_Crossover_Operator_for_Multiobjective_Evolutionary_Algorithm","288932175_Adaptive_Composite_Operator_Selection_and_Parameter_Control_for_Multiobjective_Evolutionary_Algorithm","288856014_A_Hybrid_Evolutionary_Immune_Algorithm_for_Multiobjective_Optimization_Problems"]}