{"id":"328752893_Out-Of-Place_debugging_a_debugging_architecture_to_reduce_debugging_interference","abstract":"Context. Recent studies show that developers spend most of their programming time testing, verifying and debugging software. As applications become more and more complex, developers demand more advanced debugging support to ease the software development process. Inquiry. Since the 70's many debugging solutions were introduced. Amongst them, online debuggers provide a good insight on the conditions that led to a bug, allowing inspection and interaction with the variables of the program. However, most of the online debugging solutions introduce \\textit{debugging interference} to the execution of the program, i.e. pauses, latency, and evaluation of code containing side-effects. Approach. This paper investigates a novel debugging technique called \\outofplace debugging. The goal is to minimize the debugging interference characteristic of online debugging while allowing online remote capabilities. An \\outofplace debugger transfers the program execution and application state from the debugged application to the debugger application, both running in different processes. Knowledge. On the one hand, \\outofplace debugging allows developers to debug applications remotely, overcoming the need of physical access to the machine where the debugged application is running. On the other hand, debugging happens locally on the remote machine avoiding latency. That makes it suitable to be deployed on a distributed system and handle the debugging of several processes running in parallel. Grounding. We implemented a concrete out-of-place debugger for the Pharo Smalltalk programming language. We show that our approach is practical by performing several benchmarks, comparing our approach with a classic remote online debugger. We show that our prototype debugger outperforms by a 1000 times a traditional remote debugger in several scenarios. Moreover, we show that the presence of our debugger does not impact the overall performance of an application. Importance. This work combines remote debugging with the debugging experience of a local online debugger. Out-of-place debugging is the first online debugging technique that can minimize debugging interference while debugging a remote application. Yet, it still keeps the benefits of online debugging ( e.g. step-by-step execution). This makes the technique suitable for modern applications which are increasingly parallel, distributed and reactive to streams of data from various sources like sensors, UI, network, etc.","authors":["Matteo Marra","Guillermo Polito","Elisa Gonzalez Boix"],"meta":["November 2018The Art Science and Engineering of Programming 3(2)","DOI:10.22152/programming-journal.org/2019/3/3"],"references":["321321806_Debugging_Cyber-Physical_Systems_with_Pharo_An_Experience_Report","318870861_Unanticipated_Debugging_with_Dynamic_Layers","303099521_BigDebug_Debugging_Primitives_for_Interactive_Big_Data_Processing_in_Spark","241624085_Clustered_Serialization_with_Fuel","234830615_Software_debugging_testing_and_verification","309614034_Time-travel_debugging_for_JavaScriptNodejs","303992719_Dynamic_software_updating","262206080_DrDebug_Deterministic_Replay_based_Cyclic_Debugging_with_Dynamic_Slicing","238736300_Debugging_parallel_programs_with_instant_replay","224773145_Design_Patterns_Elements_of_Reusable_Object-Oriented_Software"]}