{"id":"328719967_Spatiotemporally_resolved_heat_transfer_measurements_in_falling_liquid-films_by_simultaneous_application_of_planar_laser-induced_fluorescence_PLIF_particle_tracking_velocimetry_PTV_and_infrared_IR_the","abstract":"We present an optical technique that combines simultaneous planar laser-induced fluorescence (PLIF), particle tracking velocimetry (PTV) and infrared (IR) thermography for the space-and time-resolved measurement of the film-height, 2-D velocity and 2-D free-surface temperature in liquid films falling over an inclined, resistively-heated glass substrate. Using this information and knowledge of the wall temperature, local and instantaneous heat-transfer coefficients (HTCs) and Nusselt numbers, Nu, are also recovered along the waves of liquid films with Kapitza number, Ka=180, and Prandtl number, Pr=77. By employing this technique, falling-film flows are investigated with Reynolds numbers in the range Re = 18–66, wave frequencies set to f w =7, 12 and 17 Hz, and a wall heat flux set to q̇=2.5 W cm ⁻² . Complementary data are also collected in equivalent (i.e., for the same mean-flow Re) flows with q̇=0 W cm ⁻² . Quality assurance experiments are performed that reveal deviations of up to 2–3% between PLIF/PTV-derived film heights, interfacial/bulk velocities and flow rates, and both analytical predictions and direct measurements of flat films over a range of conditions, while IR-based temperature measurements fall within 1 °C of thermocouple measurements. Highly localized film height, velocity, flow-rate and interface-temperature data are generated along the examined wave topologies by phase/wave locked averaging. The application of a heat flux (q̇=2.5 W cm ⁻² ) results in a pronounced “thinning” of the investigated films (by 18%, on average), while the mean bulk velocities compensate by increasing by a similar extent to conserve the imposed flow rate. The axial-velocity profiles that are obtained in the heated cases are parabolic but “fuller” compared to equivalent isothermal flows, excluding any wave-regions where the interface slopes are high. As the Re is reduced, the heating applied at the wall penetrates through the film, resulting in a pronounced coupling between the HTC and the film height in thinner film regions. When the imposed wave frequency is increased, a narrower range of HTCs is observed, which we link to the evolution of the film topology and the associated redistribution of the fluid flow upstream of the imaging location, as the liquid viscosity decreases. The local and instantaneous Nu is strongly coupled to the film height and experiences variations that increase as f w is reduced.","authors":["Alexandros Charogiannis","Christos N. Markides"],"meta":["November 2018Experimental Thermal and Fluid Science (EXP THERM FLUID SCI) 107","DOI:10.1016/j.expthermflusci.2018.11.001","Project: Harnessing unsteady phase-change heat exchange in high-performance concentrated solar power systems"],"references":["328847142_Experimental_investigations_of_liquid_falling_films_flowing_under_an_inclined_planar_substrate","324594996_A_combined_experimental_and_computational_study_of_the_heat_transfer_characteristics_of_falling_liquid-films","322254104_Solitary_waves_on_falling_liquid_films_in_the_inertia-dominated_regime","321693740_Statistical_characteristics_of_falling-film_flows_A_synergistic_approach_at_the_crossroads_of_direct_numerical_simulations_and_experiments","321042869_Optical_measurements_in_evolving_dispersed_pipe_flows","317272140_Application_of_planar_laser-induced_fluorescence_for_the_investigation_of_interfacial_waves_and_rivulet_structures_in_liquid_films_flowing_down_inverted_substrates","312496360_Detailed_hydrodynamic_characterization_of_harmonically_excited_falling-film_flows_A_combined_experimental_and_computational_study","315983971_Hydrodynamic_waves_in_films_flowing_under_an_inclined_plane","313427726_Dia_Oberflachenkondensation_des_wasserdampfes","309183494_On_the_role_of_buoyancy-driven_instabilities_in_horizontal_liquid-liquid_flow"]}