{"id":"328753161_Effective_Search_in_Rugged_Performance_Landscapes_A_Review_and_Outlook","abstract":"The creation of novel strategies, the pursuit of entrepreneurial opportunities, and the development of new technologies, capabilities, products, or business models all involve solving complex problems that require making a large number of highly interdependent choices. The challenge that complex problems pose to boundedly rational managers—the need to find a high-performing combination of interdependent choices—is akin to identifying a high peak on a rugged performance “landscape” that managers must discover through sequential search. Building on the NK model that Levinthal introduced into the management literature in 1997, scholars have used simulation methods to construct performance landscapes and examine various aspects of effective search processes. We review this literature to identify common themes and mechanisms that may be relevant in different managerial contexts. Based on a systematic analysis of 71 simulation studies published in leading management journals since 1997, we identify six themes: learning modes, problem decomposition, cognitive representations, temporal dynamics, distributed search, and search under competition. We explain the mechanisms behind the results and map all of the simulation articles to the themes. In addition, we provide an overview of relevant empirical studies and discuss how empirical and formal work can be fruitfully combined. Our review is of particular relevance for scholars in strategy, entrepreneurship, or innovation who conduct empirical research and apply a process lens. More broadly, we argue that important insights can be gained by linking the notion of search in rugged performance landscapes to practitioner-oriented practices and frameworks, such as lean startup or design thinking.","authors":["Oliver Baumann","Jens Schmidt","Nils Stieglitz"],"meta":["November 2018Journal of Management 45(1):014920631880859","DOI:10.1177/0149206318808594"],"references":["325000480_Modelling_Bounded_Rationality_in_Organizations_Progress_and_Prospects","324570418_Situating_the_Construct_of_Lean_Startup_Adjacent_Conversations_and_Possible_Future_Directions","324178213_When_Two_Bosses_Are_Better_Than_One_Nearly_Decomposable_Systems_and_Organizational_Adaptation","323489178_An_Exploration_of_Discerning_Search","329645393_Design_Rules_The_Power_of_Modularity","326080785_Behavioral_game_theory_Experiments_in_strategic_interaction","325001072_Organizational_Evolution_Learning_and_Selection_A_Genetic-Algorithm-Based_Model","324999822_Open_Versus_Closed_Innovation_A_Model_of_Discovery_and_Divergence","324998085_The_Microfoundations_Movement_in_Strategy_and_Organization_Theory","324985766_Change_in_the_Presence_of_Fit_the_Rise_the_Fall_and_the_Renaissance_of_Liz_Claiborne"]}