{"id":"328761767_Siri_Siri_in_my_hand_Who's_the_fairest_in_the_land_On_the_interpretations_illustrations_and_implications_of_artificial_intelligence","abstract":"Artificial intelligence (AI)—defined as a system's ability to correctly interpret external data, to learn from such data, and to use those learnings to achieve specific goals and tasks through flexible adaptation—is a topic in nearly every boardroom and at many dinner tables. Yet, despite this prominence, AI is still a surprisingly fuzzy concept and a lot of questions surrounding it are still open. In this article, we analyze how AI is different from related concepts, such as the Internet of Things and big data, and suggest that AI is not one monolithic term but instead needs to be seen in a more nuanced way. This can either be achieved by looking at AI through the lens of evolutionary stages (artificial narrow intelligence, artificial general intelligence, and artificial super intelligence) or by focusing on different types of AI systems (analytical AI, human-inspired AI, and humanized AI). Based on this classification, we show the potential and risk of AI using a series of case studies regarding universities, corporations, and governments. Finally, we present a framework that helps organizations think about the internal and external implications of AI, which we label the Three C Model of Confidence, Change, and Control.","authors":["Andreas Kaplan","Michael Haenlein"],"meta":["November 2018Business Horizons 62(1)","DOI:10.1016/j.bushor.2018.08.004"],"references":["322958062_Artificial_Intelligence_in_Service","319647421_The_Internet_of_Things_and_new_business_opportunities_can_be_accessed_here_httpsauthorselseviercoma1VvbE1lnoC6jK","317785180_The_Internet_of_Things_Are_you_ready_for_what's_coming","313630867_A_Conceptual_Model_of_Service_Quality_and_Its_Implications_for_Future_Research","303357021_Higher_education_and_the_digital_revolution_About_MOOCs_SPOCs_social_media_and_the_Cookie_Monster","324750252_A_school_is_a_building_that_has_four_wallswith_tomorrow_inside_Toward_the_reinvention_of_the_business_school","322669733_Teaching_artificial_intelligence_and_humanity","318614879_Synthesizing_Obama_learning_lip_sync_from_audio","313732706_Big_data_Dimensions_evolution_impacts_and_challenges","312970597_A_proposal_for_the_Dartmouth_summer_research_project_on_artificial_intelligence"]}