{"id":"328703336_Formuvanna_komunikativnoi_kompetentnosti_majbutnih_uciteliv_informatiki_zasobami_tvorcih_robit","abstract":"Modern requirements for the training of a competitive specialist actualize the necessity for updating the content of education, taking into account the competence approach. One of the important qualities of modern youth is the presence of the developed communicative competence, the ability to communicate effectively in order to achieve constructive results. This is especially true for teachers who must prepare young generation for a dynamic information environment.\nThe definition and the structure of communicative competence of teachers is analyzed, including teachers of computer sciences. It is noted that communicative competence is included in the list of the teacher's professional competences and assumes the ability to enter into communication, to be clear among the interlocutors during the performance of their professional duties. The teacher of computer sciences is a guide to the world of information technologies, which reveals to the students the laws and benefits of the information society. He must operate with terms, be aware of the current trends in the development of information and communication technologies and be able to communicate with students at a level that is clear to them.\nThe expediency of using creative works to form the communicative competence of future informatics teachers of computer sciences. Their use in the preparation of future specialists will allow students to clearly express their own opinion on a particular issue, widen their horizons, increase their ability to communicate, and defend their own opinion during public protection. Each theme of creative work can be controversial, disclosed and protected in different ways.\nThere are examples given on the theme of creative work that is appropriate to provide future computer science teachers. Methodical advice is offered on registration and writing of the creative works during independent study and classroom work. It is noted that creative work effectively influences on the development of communicative competence of future teachers of computer sciences and it must undergo public protection process among the other students of the group.\nKey words: communicative competence; future teacher of computer sciences; high school; educational process; creative work","authors":["Sergii Sharov","Tetiana Sharova"],"meta":["November 2018","DOI:10.2419/2308-4634.2018.137034"],"references":[]}