{"id":"328741184_Integrating_Computational_Thinking_with_a_Music_Education_Context","abstract":"Computational thinking is becoming common in K-12 curricula, and at the same time there is interest in how STEM subjects can be integrated with the Arts (referred to as STEAM). There are some obvious connections between music and computation, but the idea of engaging with genuine computational thinking while also having authentic music learning experiences for students provides new opportunities. In this paper we consider ways to explore computational thinking ideas such as decomposition, patterns, abstraction and algorithms in a meaningful way while also exploring key concepts that a music educator would expect to work with. We review some existing ideas for doing this, and also provide novel approaches that connect computational thinking and music. This is done through a series of vignettes that describe creative ways to connect the two subjects using approaches that have been used successfully with school students. The first approach is based on the use of comparisons in sorting, which can be used to have students physically compare musical elements such as note pitches. The second uses simple programming on physical devices to represent music notation. Further examples include exploring binary representations using sound, writing programs for musical scales, understanding musical phrases in the context of programming, and using programming for music composition. Integrating the opportunity to learn about computational thinking and music at the same time has the benefit that some efficiency can be gained in teaching, but more importantly, students are able to experience the relevance of these two subjects to each other, when they might otherwise pigeonhole them into separate areas of their lives.","authors":["Judith Bell","Tim Bell"],"meta":["October 2018Informatics in Education 17(2):151-166","DOI:10.15388/infedu.2018.09"],"references":["299450690_Computational_thinking_the_developing_definition","297898968_The_Big_Picture_Developing_Musical_Capacities","292722310_A_Global_Snapshot_of_Computer_Science_Education_in_K-12_Schools","317158625_Remaining_trouble_spots_with_computational_thinking","316098201_The_development_of_Sonic_Pi_and_its_use_in_educational_partnerships_Co-creating_pedagogies_for_learning_computer_programming","314303789_Creativity_in_Authentic_STEAM_Education_with_EarSketch","311314199_A_review_of_models_for_introducing_computational_thinking_computer_science_and_computing_in_K-12_education","310792069_The_long_quest_for_computational_thinking","305628802_From_computational_thinking_to_computational_participation_in_K--12_education","301463451_A_Pilot_Computer_Science_and_Programming_Course_for_Primary_School_Students","268447795_Computational_Thinking_in_Sound_Teaching_the_Art_and_Science_of_Music_and_Technology","262403769_Computer_Science_Unplugged_and_Related_Projects_in_Math_and_Computer_Science_Popularization","224982240_Nature_Music_and_Algorithmic_Composition"]}