{"id":"328726302_Influenza_and_pertussis_vaccination_in_pregnancy_Portrayal_in_online_media_articles_and_perceptions_of_pregnant_women_and_healthcare_professionals","abstract":"Introduction\nOnline media may influence women’s decision to undergo vaccination during pregnancy. The aims of this mixed-methods study were to: (1) examine the portrayal of maternal vaccination in online media and (2) establish the perceived target of vaccine protection as viewed by pregnant women and maternity healthcare professionals (HCPs).\n\nMethods\nOnline media articles on maternal vaccination (published July-December 2012 or November 2015-April 2016) were identified through the London School of Hygiene & Tropical Medicine’s Vaccine Confidence Database and thematically analysed. Questionnaires for pregnant women and HCPs were distributed within four English hospitals (July 2017-January 2018).\n\nResults\nOf 203 articles identified, 60% related to pertussis vaccination, 33% to influenza and 6% both. The majority positively portrayed vaccination in pregnancy (97%), but inaccurate, negative articles persist which criticize pertussis vaccination’s safety and efficacy. Positively-worded articles about pertussis tended to focus on infant protection and highlight examples of recent cases, whereas positively-worded articles about influenza focused on maternal protection. These themes were reflected in questionnaire responses from 314 pregnant women and 204 HCPs, who perceived pertussis vaccination as protecting the baby, and influenza vaccination as protecting the mother, or mother and baby equally. A minority of the pregnant women surveyed intended to decline influenza (22%) or pertussis (8%) vaccination.\n\nConclusions\nThe majority of online articles support pertussis and influenza vaccination during pregnancy. The portrayal of pertussis vaccination as primarily benefiting the child, using real-examples, may influence its higher uptake compared with influenza. This approach should be considered by HCPs when recommending vaccination. HCPs should be prepared to provide advice to women hesitant about vaccination, including addressing any negative media, and consider educational strategies to counteract inaccurate information. Future studies should directly assess the influence of media on vaccine decision-making and establish which media platforms are typically used by pregnant women to gather information.","authors":["Christopher Wilcox","Kathryn Bottrell","Pauline Paterson","William S Schulz"],"meta":["November 2018Vaccine 36(50)","DOI:10.1016/j.vaccine.2018.10.092","Project: Vaccination in pregnancy"],"references":["313810943_Evaluation_of_two_vaccine_education_interventions_to_improve_pertussis_vaccination_among_pregnant_African_American_women_A_randomized_controlled_trial","311945879_338_Maternal_Tdap_how_do_antibodies_protect_newborns_against_pertussis","282037991_Antibody_Responses_After_Primary_Immunization_in_Infants_Born_to_Women_Receiving_a_Pertussis-containing_Vaccine_During_Pregnancy_Single_Arm_Observational_Study_With_a_Historical_Comparator","281394914_Understanding_factors_influencing_vaccination_acceptance_during_pregnancy_globally_A_literature_review","326630846_Use_of_social_networking_sites_and_women's_decision_to_receive_vaccinations_during_pregnancy_A_cross-sectional_study_in_the_UK","326586806_Use_of_social_networking_sites_and_women's_decision_to_receive_vaccinations_during_pregnancy_a_cross-sectional_study_in_the_UK","315129295_Maternal_immunization","310835362_Understanding_factors_influencing_vaccination_acceptance_during_pregnancy_in_Hackney_London","282588749_Tdap_vaccine_attitudes_and_utilization_among_pregnant_women_from_a_high-risk_population","282244199_What_determines_uptake_of_pertussis_vaccine_in_pregnancy_A_cross_sectional_survey_in_an_ethnically_diverse_population_of_pregnant_women_in_London"]}