{"id":"328793411_CONCEPTS_FOR_DISTRIBUTED_INPUT_INDEPENDENT_ARCHITECTURE_FOR_SERIOUS_GAMES","abstract":"Serious games (SG) allow us to learn even when we are relaxing. These games are called “serious” because they allow us to be trained at domain-specific knowledge level. That is the main reason SG are gathering an even increasing research interest in recent years. In contrast with traditional, purely entertainment games, SGs architectures and design principles are under active investigation by researchers. Recent work in that field attempts to define how SG are structured, built, used and extended. However, there is still a lot of debate which design techniques are adequate or which techniques can be borrowed from other fields – such as computer science or mainstream entertainment games. The main objective of our research is three-fold: investigate and analyze current architectural approaches; summarize the top characteristics of a modern serious game; and propose an architecture that is coherent with current approaches. Following these principles, we determine that the prevailing views in the SGs area are that they should be distributed and modular, service-based and easily extendible. Building on top of that, we come up with a novel concept for creating serous games that are independent of their input devices and propose two ways that independence can be achieved. We briefly discuss the possible integration of 3-rd party services by using message queue brokers in a publish / subscribe manner. Finally, we summarize and propose different methods for extending our proposed approach.","authors":["Stefan Stavrev","Todorka Terzieva","Angel Golev"],"meta":["September 2018CBU International Conference Proceedings 6:1166","DOI:10.12955/cbup.v6.1310","Project: PhD research"],"references":["319280989_Natural_User_Interface_for_Education_in_Virtual_Environments","308902107_Serious_Games_Architectures_and_Engines","305298757_Towards_a_Service-Oriented_Architecture_Framework_for_Educational_Serious_Games","298797180_RAGE_Architecture_for_Reusable_Serious_Gaming_Technology_Components","278300210_VIRTUAL_ENVIRONMENT_SIMULATOR_FOR_EDUCATIONAL_SAFETY_CROSSING","268816327_A_case_study_on_Service-Oriented_Architecture_for_Serious_Games","200086154_A_SOA-based_architecture_framework","3480635_Survey_of_component-based_software_development","314589518_A_Model_Driven_Development_Framework_for_Serious_Games","243786839_Understanding_Service-Oriented_Architecture"]}