{"id":"328734113_Statistical_analysis_of_language_specificity_of_connectives_based_on_parallel_texts","abstract":"In recent decades, problems of language specificity in the Russian language attract considerable attention of researchers, although until recently, they have not been thoroughly examined using corpus-based methods. This paper presents a newmethod of investigating language specificity ofRussian connectives based on statistical analysis\nof annotated parallel texts. Russian–French and French–Russian parallel texts are processed with the help of the SupracorporaDatabase (SCDB) ofConnectives designed specifically for annotation of translation correspondences (TCs) found in parallel texts. Each TC includes annotations of a Russian connective and its translation equivalent\n(TE), which enables one to obtain statistical data on various translation models (TMs) based on several proposed parameters of language specificity of connectives. As an example, in this work, language specificity of two Russian connectives will be examined: или and а то. Based on the proposed statistical parameters, it will be demonstrated\nthat или has a very low degree of language specificity in the context of the Russian–French language pair, while а то is a highly language-specific connective. The results of this research are applicable to informatics (machine translation and statistical analysis of textual data) and comparative study of languages, such as lexical typology,\nlexicography, and theory and practice of translation.\nKeywords: supracorpora databases; statistical analysis; contrastive corpus analysis; language specificity; parallel corpora; linguistic information resources; connectives; discourse relations; semantics","authors":["Mikhail Kruzhkov","Olga Inkova"],"meta":["October 2018","DOI:10.14357/19922264180312","Project: Logical structure of the text: means for the expression of logical-semantic relations in Russian, French and Italian from the contrastive perspective"],"references":["320307330_Statistical_data_as_information_source_for_linguistic_analysis_of_russian_connectors","301446340_The_Role_of_Expectedness_in_the_Implicitation_and_Explicitation_of_Discourse_Relations","233792948_Encore_sur_la_conjonction_russe_a_to","249427523_Semantics_Culture_and_Cognition_Human_Concepts_in_Culture-Specific_ConfigurationsSemantics_Culture_and_Cognition_Human_Concepts_in_Culture-Specific_Configurations","248059430_Otrazenie_nacionalnogo_haraktera_V_leksike_Russkogo_Azyka","233693591_Seeing_through_multilingual_corpora"]}