{"id":"328751501_Predicting_conversion_from_clinically_isolated_syndrome_to_multiple_sclerosis-An_imaging-based_machine_learning_approach","abstract":"Magnetic resonance imaging (MRI) scans play a pivotal role in the evaluation of patients presenting with a clinically isolated syndrome (CIS), as these may depict brain lesions suggestive of an inflammatory cause. We hypothesized that it is possible to predict the conversion from CIS to multiple sclerosis (MS) based on the baseline MRI scan by studying image features of these lesions. We analyzed 84 patients diagnosed with CIS from a prospective observational single center cohort. The patients were followed up for at least three years. Conversion to MS was defined according to the 2010 McDonald criteria. Brain lesions were segmented based on 3D FLAIR and 3D T1 images. We generated brain lesion masks by a computer assisted manual segmentation. We also generated a set of automated segmentations using the Lesion Segmentation Toolbox for SPM to assess the influence of different segmentation methods. Shape and brightness features were automatically calculated from the segmented masks and used as input data to train an oblique random forest classifier. Prediction accuracies of the resulting model were validated through a three-fold cross-validation. Conversion from CIS to MS occurred in 66 of 84 patients (79%). The conversion or non-conversion was predicted correctly in 71 patients based on shape features derived from the computer assisted manual segmentation masks (84.5% accuracy). This predictor was more accurate than predicting conversion using dissemination in space at baseline according to the 2010 McDonald criteria (75% accuracy). While shape features strongly contributed to the accuracy of the predictor, including intensity features did not further improve performance. As patients who convert to definite MS benefit from early treatment, an early classification model is highly desirable. Our study shows that shape parameters of lesions can contribute to predicting the future course of CIS patients more accurately.","authors":["Haike Zhang","Esther Alberts","Viola Pongratz","Mark Mühlau"],"meta":["November 2018NeuroImage: Clinical 21","DOI:10.1016/j.nicl.2018.11.003"],"references":["325480870_Multi-component_relaxation_in_clinically_isolated_syndrome_Lesion_myelination_may_predict_multiple_sclerosis_conversion","322448108_The_central_vein_sign_differentiates_MS_from_CNS_inflammatory_vasculopathies","320860994_A_Novel_Public_MR_Image_Dataset_of_Multiple_Sclerosis_Patients_With_Lesion_Segmentations_Based_on_Multi-rater_Consensus","320453797_Diffusion_tensor_image_features_predict_IDH_genotype_in_newly_diagnosed_WHO_grade_IIIII_gliomas","320407046_Deep_Learning_of_Joint_Myelin_and_T1w_MRI_Features_in_Normal-Appearing_Brain_Tissue_to_Distinguish_Between_Multiple_Sclerosis_Patients_and_Healthy_Controls","318461860_Machine_Learning_Approach_for_Classifying_Multiple_Sclerosis_Courses_by_Combining_Clinical_Data_with_Lesion_Loads_and_Magnetic_Resonance_Metabolic_Features","315950089_Exploration_of_machine_learning_techniques_in_predicting_multiple_sclerosis_disease_course","323617939_Value_of_the_central_vein_sign_at_3T_to_differentiate_MS_from_seropositive_NMOSD","322005908_Prediction_of_a_multiple_sclerosis_diagnosis_in_patients_with_clinically_isolated_syndrome_using_the_2016_MAGNIMS_and_2010_McDonald_criteria_A_retrospective_study","317495612_High_risk_of_early_conversion_to_multiple_sclerosis_in_clinically_isolated_syndromes_with_dissemination_in_space_at_baseline"]}