{"id":"328784548_Designing_an_online_and_reliable_statistical_anomaly_detection_framework_for_dealing_with_large_high-speed_network_traffic","abstract":"Despite a Network Anomaly Detection System (NADS) being capable of detecting\nexisting and zero-day attacks, it is still not universally implemented in industry\nand real applications, with current systems producing high False Positive Rates\n(FPRs) and low Detection Rates (DRs). The challenges involved in designing a\nNADS architecture are 1) the methodology adopted for creating as comprehensive\na profile as possible from diverse normal patterns and 2) in establishing an adaptive\nand lightweight Decision Engine (DE) which efficiently distinguishes between\nlegitimate and anomalous activities at high speeds in large network environments.\nThe need for such a method to be trained and validated on a decent dataset with\nthe characteristics of current network environments is a significant challenge.\n\nThis thesis provides substantial contributions to research on the building of a\nscalable, adaptive and lightweight NADS framework. It considers three aspects:\na data source, relevant features and observations, and new DE approaches for\nachieving a reliable NADS architecture.\n\nThe first key contribution is the creation of a new dataset called UNSWNB15\nthat has a hybrid of realistic modern legitimate and synthetic malicious\nactivities, with statistical analyses and evaluations of it fully explained. Also,\nits complexity is assessed using existing techniques to demonstrate the extent of\ncurrent sophisticated types of anomalous events.\n\nThe second core contribution is the development of a new theory for selecting\nimportant features and observations from network packets without redundancy to\nconstruct a legitimate profile from which any deviation is considered an attack,\nthat is, establish an efficient NADS from analyses of the protocols and services of\nthe OSI model.\n\nThe third major contribution is the development of two scalable frameworks\nwith two new DE techniques for successfully detecting malicious activities in less\nprocessing times than current methods. These techniques, called the Geometric\nArea Analysis-ADS (GAA-ADS) and Dirichlet Mixture Model-ADS (DMM-ADS),\nare based on mixture models for modelling all possible normal patterns and detecting\nabnormal events that deviate from them using new outlier approaches.","authors":["Nour Moustafa"],"meta":["October 2017","Thesis for: PhD degreeAdvisor: Professor Jill Slay and Dr Gideon Creech"],"references":["315662151_From_Intrusion_Detection_to_an_Intrusion_Response_System_Fundamentals_Requirements_and_Future_Directions","314651819_An_Ensemble_Learning_Framework_for_Anomaly_Detection_in_Building_Energy_Consumption","348869539_Automatic_Defense_Against_Zero-day_Polymorphic_Worms_in_Communication_Networks","328076833_Intrusion_Detection_Networks_A_Key_to_Collaborative_Security","324421059_Sampling_Techniques","319207906_Learning_from_data_concepts_theory_and_methods","316858290_sPCA_Scalable_Principal_Component_Analysis_for_Big_Data_on_Distributed_Platforms","314156161_Cyber_Espionage","313828394_A_Hypergraph_and_Arithmetic_Residue-based_Probabilistic_Neural_Network_for_classification_in_Intrusion_Detection_Systems","313649427_Cambridge_University_Press","310665627_Performance_improvement_of_intrusion_detection_with_fusion_of_multiple_sensors_An_evidence-theory-based_approach","313539375_Vulnerabilities_and_Security_Issues","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","313268473_Deterrence_and_Dissuasion_in_Cyberspace","313065957_Performance_Analysis_of_an_Intrusion_Detection_Systems_Based_of_Artificial_Neural_Network"]}