{"id":"328870739_Profile-Based_Bandit_with_Unknown_Profiles","abstract":"Stochastic bandits have been widely studied since decades. A very large panel of settings have been introduced, some of them for the inclusion of some structure between actions. If actions are associated with feature vectors that underlie their usefulness, the discovery of a mapping parameter between such profiles and rewards can help the exploration process of the bandit strategies. This is the setting studied in this paper, but in our case the action profiles (constant feature vectors) are unknown beforehand. Instead, the agent is only given sample vectors, with mean centered on the true profiles, for a subset of actions at each step of the process. In this new bandit instance, policies have thus to deal with a doubled uncertainty, both on the profile estimators and the reward mapping parameters learned so far. We propose a new algorithm, called SampLinUCB, specifically designed for this case. Theoretical convergence guarantees are given for this strategy, according to various profile samples delivery scenarios. Finally, experiments are conducted on both artificial data and a task of focused data capture from online social networks. Obtained results demonstrate the relevance of the approach in various settings. © 2018 Sylvain Lamprier, Thibault Gisselbrecht and Patrick Gallinari.","authors":["Sylvain Lamprier","Thibault Gisselbrecht","Patrick Gallinari"],"meta":["September 2018Journal of Machine Learning Research 19:1-40"],"references":["283008501_WhichStreams_A_Dynamic_Approach_for_Focused_Data_Capture_from_Large_Social_Media","230627940_Improved_Algorithms_for_Linear_Stochastic_Bandits_extended_version","228987310_Empirical_Study_of_Topic_Modeling_in_Twitter","221619323_Parametric_Bandits_The_Generalized_Linear_Case","265490932_On_Bayesian_Upper_Confidence_Bounds_for_Bandit_Problems","262274887_Optimistic_Bayesian_Sampling_in_Contextual-Bandit_Problems","239292007_Asymptotically_efficient_adaptive_allocation_rules1","224983695_Thompson_Sampling_An_Asymptotically_Optimal_Finite_Time_Analysis","221497329_Minimax_Policies_for_Adversarial_and_Stochastic_Bandits","221497234_Stochastic_Linear_Optimization_under_Bandit_Feedback"]}