{"id":"328847060_Remote_optimization_of_an_ultracold_atoms_experiment_by_experts_and_citizen_scientists","abstract":"We introduce a remote interface to control and optimize the experimental production of Bose-Einstein condensates (BECs) and find improved solutions using two distinct implementations. First, a team of theoreticians used a remote version of their dressed chopped random basis optimization algorithm (RedCRAB), and second, a gamified interface allowed 600 citizen scientists from around the world to participate in real-time optimization. Quantitative studies of player search behavior demonstrated that they collectively engage in a combination of local and global searches. This form of multiagent adaptive search prevents premature convergence by the explorative behavior of low-performing players while high-performing players locally refine their solutions. In addition, many successful citizen science games have relied on a problem representation that directly engaged the visual or experiential intuition of the players. Here we demonstrate that citizen scientists can also be successful in an entirely abstract problem visualization. This is encouraging because a much wider range of challenges could potentially be opened to gamification in the future.","authors":["Robert Heck","Oana Vuculescu","Jens Jakob Sørensen","Jonathan Zoller"],"meta":["November 2018Proceedings of the National Academy of Sciences 115(48):201716869","DOI:10.1073/pnas.1716869115"],"references":["325091331_Challenging_local_realism_with_human_choices","318682617_Achievement_of_Sustained_Net_Plasma_Heating_in_a_Fusion_Experiment_with_the_Optometrist_Algorithm","316428957_Autonomous_Calibration_of_Single_Spin_Qubit_Operations","308382411_Social_learning_solves_the_problem_of_narrow-peaked_search_landscapes_Experimental_evidence_in_humans","322788139_Experimental_Demonstration_of_Shaken-Lattice_Interferometry","322220859_Deep_Learning_A_Critical_Appraisal","319599887_Quantum_simulations_with_ultracold_atoms_in_optical_lattices","318992504_Science_and_data_science","317108283_Compressed_quantum_computation_using_a_remote_five-qubit_quantum_computer","316439811_Control_landscapes_are_almost_always_trap_free_A_geometric_assessment"]}