{"id":"328806047_The_Effect_of_Using_Educational_Games_in_Teaching_Kingdoms_of_Living_Things","abstract":"This study aims to investigate the effects of using scientific educational games in teaching Kingdoms of Living Things on students’ academic achievement and retention of knowledge. The study also assessed students’ perceptions of these educational games. 68 ninth grade students constitute the study group of this research. In the school in which the instruction was carried out two ninth grade classes were randomly assigned as experimental group and control group. The implementation of the study lasted seven weeks as three lesson hours per week. The same method of lecturing was carried out in the experimental and control groups. Review of the topics was made by researcher through the question-answer method and giving the activities in the textbook as homework in the control group. In the experimental group, educational games were used to review, reinforce and assess the topics. At the end of the study the score of posttest and the retention test implemented six month after showed a significant difference in favor of experimental group. The results put forth that educational games enhance students’ achievement and are an effective tool in providing the retention of new knowledge. Within the scope of the study, the experimental group students’ views on the use of educational games were obtained at the end of implementation, which were generally positive. The students found the games informative, entertaining and reinforcing their learning, and stated that they are effective in enabling the retention of new knowledge, promoting collaboration with their peers, and increasing their interest and motivation for learning.","authors":["Meryem Selvi","Ayşe Öztürk Çoşan"],"meta":["September 2018Universal Journal of Educational Research 6(9):2019-2028","DOI:10.13189/ujer.2018.060921"],"references":["324926785_Using_a_board_game_to_teach_protein_synthesis_to_high_school_students","301601332_ClueConnect_a_word_array_game_to_promote_student_comprehension_of_key_terminology_in_an_introductory_anatomy_and_physiology_course","286756299_An_Educational_Board_Game_to_Assist_PharmD_Students_in_Learning_Autonomic_Nervous_System_Pharmacology","270848409_The_Effect_of_Game-Based_Learning_on_Students'_Learning_Performance_in_Science_Learning_-_A_Case_of_Conveyance_Go","327370368_Using_a_word_game_to_test_physiology_comprehension","323424582_Statistical_power_analysis_for_the_behavioral_sciences","317039296_Periyodik_cetvelin_ve_elementlerin_tombala_oyun_teknigi_ile_ogretimi_ve_bellekte_kaliciliginin_saptanmasi","303881838_A_Game-Based_Approach_To_Learning_the_Idea_of_Chemical_Elements_and_Their_Periodic_Classification","303040729_Picture_Chem_Playing_a_Game_To_Identify_Laboratory_Equipment_Items_and_Describe_Their_Use","282420719_Chemical_Alias_An_Engaging_Way_To_Examine_Nomenclature"]}