{"id":"328886497_Relationship_between_Study_Skills_and_Learning_Outcomes_Among_Nursing_Students_in_Selected_Schools_Of_Nursing_in_North_Western_Nigeria","abstract":"Study skills are approaches applied to learning. They are generally critical to success in school, considered essential for acquiring good grades, and useful for learning throughout one's life. A learning outcome is a written statement of what the successful student/learner is expected to be able to do at the end of the module of course. Capable students at all grade levels may experience difficulty in school, not because they lack ability but because they lack good study skills. The study was descriptive cross sectional survey that intended to describe the relationship between study skills and learning outcomes among nursing students in north western Nigeria. The study setting was four randomly selected schools of nursing of north western Nigeria. Simple random sampling was used in selecting the schools. Purposive sampling was used in selecting total population of first and second year students of the schools selected as a sample of the study. A fifty three items questionnaire was used to collect information on the study skills of the students. The instrument measured the students study skills in text/note books reading, note making, memory, concentration, test preparation and time management using five likert scale system. The first and second semester examination results of year 2013 were used as learning outcomes of the students. Descriptive statistics was used to present the demographic data of the respondents using tables. Student t-test, ANOVA and Pearson correlation were used in answering the research hypotheses. Data was analyzed using SPSS statistical Package version 17. The results of the research show that majority of the respondent (62.3%) were within 19-22 year age bracket, 24.9% were 23-26 year age bracket. Female nursing students were higher than male nursing students with 62.6%. Female nursing students were having better study skills than their males nursing students counterparts, except in time management where male nursing students have better mean scores of 15.92 than their females nursing students counterpart with mean score of 15.11. It was shown that the means score of notebook/text book reading was higher in 23-26 year age bracket. While mean score of memory was higher in 19-22 year age bracket. Males and females nursing students were not significantly different in study skills in most of the study skills at 95% confidence interval p>0.05; except in concentration study skill where it shows that there is significant difference in concentration study skill between male and female nursing students, p<0.05. Students were not significantly different in most of the study skills by age group, including note taking , test preparation, concentration and time management, p>0.05, however it was found that there is significant difference in note/text book reading and memory study skills by age, p<0.05. There was no significant relationship between study skills and learning outcomes in notebook/text book reading, note taking, test preparation and concentration study skills, at p>0.05. But there was significant relationship between study skills and learning outcomes in memory and time management study skills of nursing students, p<0.05. Recommendations were given which include having counselors and study skills counseling programs in every school of nursing.","authors":["Yahaya Jafaru","Tasiu Yalwa"],"meta":["January 2016","Project: Nursing Education"],"references":["257642185_Beyond_the_existence_proof_Ontological_conditions_epistemological_implications_and_in-depth_interview_research","223745503_Fluid_intelligence_memory_span_and_temperament_difficulties_predict_academic_performance_of_young_adolescents","223565193_Academic_procrastination_and_the_role_of_hope_as_a_coping_strategy"]}