{"id":"328873130_Google_Scholar_to_Overshadow_Them_All_Comparing_the_Sizes_of_12_Academic_Search_Engines_and_Bibliographic_Databases","abstract":"Information on the size of academic search engines and bibliographic databases (ASEBDs) is often outdated or entirely unavailable. Hence, it is difficult to assess the scope of specific databases, such as Google Scholar. While scientometric studies have estimated ASEBD sizes before, the methods employed were able to compare only a few databases. Consequently, there is no up-to-date comparative information on the sizes of popular ASEBDs. This study aims to fill this blind spot by providing a comparative picture of 12 of the most commonly used ASEBDs. In doing so, we build on and refine previous scientometric research by counting query hit data as an indicator of the number of accessible records. Iterative query optimization makes it possible to identify a maximum number of hits for most ASEBDs. The results were validated in terms of their capacity to assess database size by comparing them with official information on database sizes or previous scientometric studies. The queries used here are replicable, so size information can be updated quickly. The findings provide first-time size estimates of ProQuest and EbscoHost and indicate that Google Scholar’s size might have been underestimated so far by more than 50%. By our estimation Google Scholar, with 389 million records, is currently the most comprehensive academic search engine.","authors":["Michael Gusenbauer"],"meta":["January 2019Scientometrics 118(1):177–214","DOI:10.1007/s11192-018-2958-5","Project: Research Methods, Information Retrieval, Digital Learning Processes, Information Economy"],"references":["326007010_Coverage_of_highly-cited_documents_in_Google_Scholar_Web_of_Science_and_Scopus_a_multidisciplinary_comparison","321230407_Google_Scholar_as_a_source_for_scholarly_evaluation_A_bibliographic_review_of_database_errors","318162758_Microsoft_Academic_is_one_year_old_the_Phoenix_is_ready_to_leave_the_nest","317758138_Normalizing_Google_Scholar_data_for_use_in_research_evaluation","315105670_The_coverage_of_Microsoft_Academic_Analyzing_the_publication_output_of_a_university","315101380_'Just_Google_it'_-_the_scope_of_freely_available_information_sources_for_doctoral_thesis_writing","312038361_Can_we_use_Google_Scholar_to_identify_highly-cited_documents","327046234_Google_Scholar_Web_of_Science_and_Scopus_a_systematic_comparison_of_citations_in_252_subject_categories","321306589_Microsoft_Academic_Automatic_Document_Searches_Accuracy_for_Journal_Articles_and_Suitability_for_Citation_Analysis","318080973_Suitability_of_Google_Scholar_as_a_source_of_scientific_information_and_as_a_source_of_data_for_scientific_evaluation-Review_of_the_Literature"]}