{"id":"328829856_An_Online_Collaborative_Discussion_Platform_for_Bridging_a_Technological_Reliance_Gap_in_Higher_Learning_Institutions_in_Tanzania","abstract":"Currently, the online discussion forums have become the focal point for e-learning in many Higher Learning Institutions (HLIs); this is due to the ubiquitous of Information and Communication Technology (ICT) tools, significant rate and fast growing technology adoption and use in many fields including education. However, developing countries, such as Tanzania, are experiencing technical adoption difficulties, such as limited access to computers, problems with Internet connections as well as the technological reliance gap between tutors and learners; these affect the use of technology in Teaching and Learning (T/L). This study aims to use an Online Discussion Platform (onlineDP) to bridge the technological reliance gap between the tutors and learners in HLIs in Tanzania. In this study, the literature review and qualitative research methods were conducted to develop the prototype of the platform. The UMBC semantic similarity service was used to develop the contents filter used to reduce the number of duplicate discussion questions. The application was mainly developed using Laravel Pre-processor (PHP) framework and My Structured Query Language (MySQL) database. The result is the web-based application prototype that enhances the collaborative learning environment in HLIs in Tanzania. The technologies to be used for T/L, should consider both sides of tutors and learners as well as the theoretical framework for their implementations.","authors":["Linus John","Anael Sam"],"meta":["November 2018International Journal of Modern Education and Computer Science 10(11):29-35","DOI:10.5815/ijmecs.2018.11.04","Project: OnlineDP Web App"],"references":["319392192_A_decade_of_technology_enhanced_learning_at_the_University_of_Dar_es_Salaam_Tanzania_Challenges_achievements_and_opportunities","287543476_Drivers_of_learning_management_system_use_in_a_South_African_open_and_distance_learning_institution","284005658_Implementation_of_Model-View-Controller_Architecture_Pattern_for_Business_Intelligence_Architecture","281058866_An_Integrated_Mobile_Application_for_Enhancing_Management_of_Nutrition_Information_in_Arusha_Tanzania","275544467_E-learning_in_the_Evaluation_of_Students_and_Teachers_LMS_or_Social_Networks","275540078_Designing_an_MVC_Model_for_Rapid_Web_Application_Development","265160908_Facebook_groups_as_LMS_A_case_study","265052131_A_comparison_of_model_view_controller_and_model_view_presenter","339277923_Interview_with_Tony_Bates_on_the_Aspects_and_Prospects_of_Online_Learning","296385361_UMBC_EBIQUITY-CORE_Semantic_textual_similarity_systems"]}