{"id":"328840398_Rumor_propagation_dynamic_model_based_on_evolutionary_game_and_anti-rumor","abstract":"In the online social network, the spreading process of rumor contains complex dynamics. The traditional research of the rumor propagation mainly studies the spreading process of rumor from the perspectives of rumor and participating user. The symbiosis and confrontation of rumor and anti-rumor information and the dynamic changes of the influence of anti-rumor information are not emphasized. At the same time, people’s profitability and herd psychology are also ignored. In view of the above problems, we fully consider the anti-rumor information and user’s psychological factors, construct a rumor propagation dynamics model based on evolutionary game and anti-rumor information, and provide a theoretical basis for studying the inherent laws in the spreading process of rumor. First of all, we analyze the interaction pattern and characteristic of rumor in social network. In allusion to the symbiosis of rumor and anti-rumor information and the dynamic changes of the influence of anti-rumor information, we constructed the SKIR rumor propagation model based on the SIR model. Secondly, due to rivalry between rumor and anti-rumor information, as well as the user’s profitability and herd psychology, we use evolutionary game theory to construct the driving force mechanism of information and explore the causes of user behavior in the spreading process of rumor. At the same time, we combine the behavior factors and external factors of the user to build the influence of information by multivariate linear regression method, which provides the theoretical basis for the driving force of information. Finally, combining the SKIR model proposed in this paper, we get a rumor propagation dynamics model based on evolutionary game and anti-rumor information. We have proved by experiments that the model can effectively describe the propagating situation of rumor and the dynamic change rule of the influence of anti-rumor information. On the other hand, it can also reflect the influence of people’s psychology on rumor propagation.","authors":["Yunpeng Xiao","Diqiang Chen","Shihong Wei","Qian Li"],"meta":["January 2019Nonlinear Dynamics 95(1)","DOI:10.1007/s11071-018-4579-1"],"references":["325129207_The_equilibrium_complexity_analysis_and_control_in_epiphytic_supply_chain_with_product_horizontal_diversification","324688235_Rumor_and_authoritative_information_propagation_model_considering_super_spreading_in_complex_social_networks","321832545_Quantity_and_price_competition_in_a_differentiated_triopoly_static_and_dynamic_investigations","320631796_Edge-based_epidemic_dynamics_with_multiple_routes_of_transmission_on_random_networks","310473140_Rumor_spreading_model_considering_the_activity_of_spreaders_in_the_homogeneous_network","326330231_The_influence_of_positive_news_on_the_rumor_spreading_in_social_networks_with_scale-free_characteristics","326228765_Social_Hotspot_Propagation_Dynamics_Model_Based_on_Multidimensional_Attributes_and_Evolutionary_Games","316052350_Dynamical_behaviours_and_control_measures_of_rumour-spreading_model_with_consideration_of_network_topology","314191470_SIR_rumor_spreading_model_considering_the_effect_of_difference_in_nodes'_identification_capabilities","308883692_Rumor_propagation_with_heterogeneous_transmission_in_social_networks","308387749_A_survey_on_game_theoretic_models_for_community_detection_in_social_networks","307920581_Set-membership_estimations_for_the_evolution_of_infectious_diseases_in_heterogeneous_populations","307536753_Statistical_physics_of_vaccination","306274042_A_coupled_model_for_government_communication_and_rumor_spreading_in_emergencies","308756733_A_novel_game_theoretic_approach_for_modeling_competitive_information_diffusion_in_social_networks_with_heterogeneous_nodes"]}