{"id":"328818485_Optimal_or_not_depends_on_the_task","abstract":"Decision-making involves a tradeoff between pressures for caution and urgency. Previous research has investigated how well humans optimize this tradeoff, and mostly concluded that people adopt a sub-optimal strategy that over-emphasizes caution. This emphasis reduces how many decisions can be made in a fixed time, which reduces the “reward rate”. However, the strategy that is optimal depends critically on the timing properties of the experiment design: the slower the rate of decision opportunities, the more cautious the optimal strategy. Previous studies have almost uniformly adopted very fast designs, which favor very urgent decision-making. This raises the possibility that previous findings—that humans adopt strategies that are too cautious—could either be ascribed to human caution, or to the experiments’ design. To test this, we used a slowed-down decision-making task in which the optimal strategy was quite cautious. With this task, and in contrast to previous findings, the average strategy adopted across participants was very close to optimal, with about equally many participants adopting too-cautious as too-urgent strategies. Our findings suggest that task design can play a role in inferences about optimality, and that previous conclusions regarding human sub-optimality are conditional on the task settings. This limits claims about human optimality that can be supported by the available evidence.","authors":["Nathan J. Evans","Aimée J. Bennett","Scott D. Brown"],"meta":["November 2018Psychonomic Bulletin & Review 26(2)","DOI:10.3758/s13423-018-1536-4"],"references":["331310488_Thermodynamic_Integration_and_Steppingstone_Sampling_Methods_for_Estimating_Bayes_Factors_A_Tutorial","328768485_Thermodynamic_integration_via_differential_evolution_A_method_for_estimating_marginal_likelihoods","323427358_Suboptimality_in_Perceptual_Decision_Making","321316487_The_computations_that_support_simple_decision-making_A_comparison_between_the_diffusion_and_urgency-gating_models","317386969_Need_for_closure_is_associated_with_urgency_in_perceptual_decision-making","316111292_Overcoming_Indecision_by_Changing_the_Decision_Boundary","328113257_Thermodynamic_integration_via_differential_evolution_A_method_for_approximating_marginal_likelihoods","328110983_Thermodynamic_Integration_and_Steppingstone_Sampling_Methods_for_Estimating_Bayes_Factors_A_Tutorial","316566947_Bayes_factors_for_the_linear_ballistic_accumulator_model_of_decision-making","312925878_Evidence_accumulation_detected_in_BOLD_signal_using_slow_perceptual_decision_making"]}