{"id":"328803939_A_Systematic_Mapping_Study_of_HCI_Practice_Research","abstract":"Human–computer interaction (HCI) practice has emerged as a research domain in the HCI field and is growing. The need to transfer HCI practices to the industry began significantly with the works of Nielsen on usability engineering. To date, methods and techniques for designing, evaluating, and implementing interactive systems for human use have continued to emerge. It is, therefore, justified to conduct a systematic mapping study to determine the landscape of HCI practice research. A Systematic Mapping Study method was used to map 142 studies according to research type, topic, and contribution. These were then analyzed to determine an overview of HCI practice research. The objective was to analyze studies on HCI practice and present prominent issues that characterize the HCI practice research landscape. Second, to identify pressing challenges regarding HCI practices in software/systems development companies. The results show that HCI practice research has steadily increased since 2012. The majority of the studies explored focused on evaluation research that largely contributed to the evaluation methods or processes. Most of the studies were on design tools and techniques, design methods and contexts, design work and organizational culture, and collaboration and team communication. Interviews, case studies, and survey methods have been prominently used as research methods. HCI techniques are mostly used during the initial phase of development and during evaluation. HCI practice challenges in companies are mostly process-related and on performance of usability and user experience activities. The major challenge seems to be to find a way to collect and incorporate user feedback in a timely manner, especially in agile processes. There are areas identified in this study as needing more research.","authors":["Abiodun Ogunyemi","David Lamas","Marta Larusdottir","Fernando Loizides"],"meta":["November 2018International Journal of Human-Computer Interaction 35(3):1-27","DOI:10.1080/10447318.2018.1541544","Project: Development of a HCI maturity self-assessment tool"],"references":["316858471_ACM_SIGCHI_Curricula_for_Human-Computer_Interaction","336573400_Systematic_Mapping_Studies_in_Software_Engineering","326788337_User_Centered_System_Design_New_Perspectives_on_Human-computer_Interaction","323992938_RITEKrug_a_combination_of_usability_test_methods_for_agile_design","321572954_Human-Computer_Interaction_-_INTERACT_2015_15th_IFIP_TC_13_International_Conference_Bamberg_Germany_September_14-18_2015_Proceedings_Part_II","309140778_Context_of_Use_The_Final_Frontier_in_the_Practice_of_User-Centered_Design","308868223_Templates_A_Key_to_Success_When_Training_Developers_to_Perform_UX_Tasks","308860624_BoB_A_Framework_for_Organizing_Within-Iteration_UX_Work_in_Agile_Development","308844637_Integrating_Both_User-Centered_Design_and_Creative_Practices_into_Agile_Development","308844521_Communication_Breakdowns_in_the_Integration_of_User-Centred_Design_and_Agile_Development"]}