{"id":"328872474_Mapeamento_relacional_entre_padroes_de_metadados_educacionais","abstract":"RESUMO A diversidade de formatos utilizados para o desenvolvimento de objetos de aprendizagem contribui para que o processo de recuperação de informação relevante permaneça sendo um grande desafio para a Ciência da Informação e a Ciência da Computação. A adoção de metadados para a catalogação destes recursos vem sendo utilizada tanto em âmbito nacional quanto internacional. No entanto, não existe um consenso sobre qual é o melhor padrão de metadados. Tem como objetivo apresentar um mapeamento relacional entre principais padrões de metadados utilizados pelos repositórios de objetos de aprendizagem. A metodologia utilizada se fundamenta em análise exploratória e analítica de repositórios de objetos de aprendizagem para identificar os metadados de cada iniciativa e propor um modelo de correlação entre os padrões. Os resultados apontam que os padrões Dublin Core e LOM são referências para outros padrões de metadados. Assim, o mapeamento foi realizado a partir de uma correspondência entre esses padrões e para a validação foram analisados 140 objetos de aprendizagem disponíveis em repositórios na Web. Conclui-se que é possível estabelecer um modelo de correlação entre os metadados com um número significativo de elementos para colaborar com o processo de indexação automática e aprimorar a recuperação de informação.","authors":["Luciana Maria Vieira Pöttker","Edberto Ferneda","José Antonio Moreiro González"],"meta":["September 2018Perspectivas em Ciência da Informação 23(3):25-38","DOI:10.1590/1981-5344/2843"],"references":["264001734_Proposta_Brasileira_de_Metadados_para_Objetos_de_Aprendizagem_Baseados_em_Agentes_OBAA","236669555_Proposta_de_Padrao_para_Metadados_de_Objetos_de_Aprendizagem_Multiplataforma","225070375_The_Semantic_Web_A_New_Form_of_Web_Content_That_is_Meaningful_to_Computers_Will_Unleash_a_Revolution_of_New_Possibilities","26349874_Metadados_para_a_descricao_de_recursos_de_informacao_eletronica_utilizacao_do_padrao_Dublin_Core","221276124_Standards_for_Digital_Libraries_and_Archives_Digital_Longevity","220691626_Text_information_retrieval_systems","39578466_Los_Repositorios_de_Objetos_de_Aprendizaje_como_soporte_a_un_entorno_e-learning"]}