{"id":"328830169_Patterns_of_authorship_in_ecology_and_evolution_First_last_and_corresponding_authorship_vary_with_gender_and_geography","abstract":"The position of an author on the byline of a paper affects the inferences readers make about their contributions to the research. We examine gender differences in authorship in the ecology literature using two datasets: submissions to six journals between 2010 and 2015 (regardless of whether they were accepted), and manuscripts published by 151 journals between 2009 and 2015. Women were less likely to be last (i.e., “senior”) authors (averaging ~23% across journals, years, and datasets) and sole authors (~24%), but more likely to be first author (~38%), relative to their overall frequency of authorship (~31%). However, the proportion of women in all authorship roles, except sole authorship, has increased year‐on‐year. Women were less likely to be authors on papers with male last authors, and all‐male papers were more abundant than expected given the overall gender ratio. Women were equally well represented on papers published in higher versus lower impact factor journals at all authorship positions. Female first authors were less likely to serve as corresponding author of their papers; this difference increased with the degree of gender inequality in the author's home country, but did not depend on the gender of the last author. First authors from non‐English‐speaking countries were less likely to serve as corresponding author of their papers, especially if the last author was from an English‐speaking country. That women more often delegate corresponding authorship to one of their coauthors may increase the likelihood that readers undervalue their role in the research by shifting credit for their contributions to coauthors. We suggest that author contribution statements be more universally adopted and that these statements declare how and/or why the corresponding author was selected for this role.","authors":["Charles W Fox","Josiah P. Ritchey","C. E. Timothy Paine"],"meta":["November 2018Ecology and Evolution 8(2)","DOI:10.1002/ece3.4584"],"references":["345652461_Persistent_Underrepresentation_of_Women's_Science_in_High_Profile_Journals","324609859_The_gender_gap_in_science_How_long_until_women_are_equally_represented","323344042_Trends_in_female_authorship_in_research_papers_on_eating_disorders_20-year_bibliometric_study","323197652_The_Gender-Equality_Paradox_in_Science_Technology_Engineering_and_Mathematics_Education","323166113_Gender_bias_in_scholarly_peer_review","322217285_Gender_disparities_in_high-quality_research_revealed_by_Nature_Index_journals","320362449_Women_are_underrepresented_in_computational_biology_An_analysis_of_the_scholarly_literature_in_biology_computer_science_and_computational_biology","342982562_Towards_Assessing_Gender_Authorship_in_Aquaculture_Publications","321088046_Gender_Disparities_in_Science_Dropout_Productivity_Collaborations_and_Success_of_Male_and_Female_Computer_Scientists","320369990_Gender_Differences_in_the_Authorship_of_Original_Research_in_Pediatric_Journals_2001-2016"]}