{"id":"328825649_Interpreting_and_Navigating_Multiple_Representations_for_Computational_Thinking_in_a_Robotics_Programming_Environment","abstract":"Although researchers have proposed different definitions for Computational Thinking (CT), one commonality across these definitions is the emphasis on having students formulate and solve problems in various learning environments, including programming. The continuing attention to CT highlights the need for studies that examine students’, especially elementary students, problem-solving processes. The current study investigates how fifth graders engaged in CT problem-solving activities in a programming environment. Focusing on multiple representations embedded in the CT problemsolving processes, we analyze data of fifth graders who were engaged in a pairprogramming robotics interview. In the interview, students navigate multiple representations, such as task instructions, a coding window, and outputs, and in the case of robotics programming activities, a physical robot. The results show that as students were participating in a variety of coding and problem-solving practices, they were interpreting and navigating information within the code window, across the code window and task instructions, across the code window and physical robot, and across\nall three representations. Informed by these findings, we propose a framework to conceptualize how elementary students interpret and navigate multiple representations in CT problem-solving processes, which could guide future studies in analyzing problem-solving processes in similar contexts. Implications on the importance of multiple representations in programming may apply to other CT learning environments as well.","authors":["Lauren Barth-Cohen","Shiyan Jiang","Ji Shen","Guanhua Chen"],"meta":["December 2018Journal for STEM Education Research","DOI:10.1007/s41979-018-0006-2","Project: Transformative Robotics Experience for Elementary Students (TREES)"],"references":["293328412_Digital_Games_as_Multirepresentational_Environments_for_Science_Learning_Implications_for_Theory_Research_and_Design","288404651_Integrating_computational_thinking_with_K-12_science_education_A_theoretical_framework","285673846_Enactivism_Spatial_Reasoning_and_Coding","283155060_Defining_Computational_Thinking_for_Mathematics_and_Science_Classrooms","281495128_Digital_Fabrication_and_'Making'_in_Education_The_The_Democratization_of_Invention","343364402_Running_on_Empty_the_Failure_to_Teach_K--12_Computer_Science_in_the_Digital_Age","329654173_Changing_Minds_Computers_Learning_and_Literacy","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","301956189_A_Live_Multiple-Representation_Probabilistic_Programming_Environment_for_Novices","286873961_The_TangibleK_robotics_program_Applied_computational_thinking_for_young_children"]}