{"id":"328843987_Ship_Detection_in_SAR_Images_Based_on_Maxtree_Representation_and_Graph_Signal_Processing","abstract":"This paper discusses an image processing architecture and tools to address the problem of ship detection in synthetic-aperture radar images. The detection strategy relies on a tree-based representation of images, here a Maxtree, and graph signal processing tools. Radiometric as well as geometric attributes are evaluated and associated with the Maxtree nodes. They form graph attribute signals which are processed with graph filters. The goal of this filtering step is to exploit the correlation existing between attribute values on neighboring tree nodes. Considering that trees are specific graphs where the connectivity toward ancestors and descendants may have a different meaning, we analyze several linear, nonlinear, and morphological filtering strategies. Beside graph filters, two new filtering notions emerge from this analysis: tree and branch filters. Finally, we discuss a ship detection architecture that involves graph signal filters and machine learning tools. This architecture demonstrates the interest of applying graph signal processing tools on the tree-based representation of images and of going beyond classical graph filters. The resulting approach significantly outperforms state-of-the-art algorithms. Finally, a MATLAB toolbox allowing users to experiment with the tools discussed in this paper on Maxtree or Mintree has been created and made public.","authors":["Philippe Salembier","Sergi Liesegang","Carlos López-Martínez"],"meta":["November 2018IEEE Transactions on Geoscience and Remote Sensing PP(99):1-16","DOI:10.1109/TGRS.2018.2876603"],"references":["316723458_Towards_disruptions_in_Earth_observation_New_Earth_Observation_systems_and_markets_evolution_Possible_scenarios_and_impacts","322515718_Detection_and_Discrimination_of_Ship_Targets_in_Complex_Background_From_Spaceborne_ALOS-2_SAR_Images","320844058_An_Improved_Superpixel-Level_CFAR_Detection_Method_for_Ship_Targets_in_High-Resolution_SAR_Images","316903093_Center-weighted_median_graph_filters","314293314_The_SUMO_Ship_Detector_Algorithm_for_Satellite_Radar_Images","314200511_Learning_Attribute_Representations_for_Remote_Sensing_Ship_Category_Classification","313689493_An_Intensity-Space_Domain_CFAR_Method_for_Ship_Detection_in_HR_SAR_Images","312466408_Ship_Detection_for_Complex_Background_SAR_Images_Based_on_a_Multiscale_Variance_Weighted_Image_Entropy_Method","312169092_Detection_of_coherent_scatterers_in_SAR_data_algorithms_and_applications","311700384_Synthetic_Aperture_Radar_Ship_Detection_Using_Haar-Like_Features"]}