{"id":"328840339_Analysis_of_Lightweight_Feature_Vectors_for_Attack_Detection_in_Network_Traffic","abstract":"The consolidation of encryption and big data in network communications have made deep packet inspection no longer feasible in large networks. Early attack detection requires feature vectors which are easy to extract, process, and analyze, allowing their generation also from encrypted traffic. So far, experts have selected features based on their intuition, previous research, or acritically assuming standards, but there is no general agreement about the features to use for attack detection in a broad scope. We compared five lightweight feature sets that have been proposed in the scientific literature for the last few years, and evaluated them with supervised machine learning. For our experiments, we use the UNSW-NB15 dataset, recently published as a new benchmark for network security. Results showed three remarkable findings: (1) Analysis based on source behavior instead of classic flow profiles is more effective for attack detection; (2) meta-studies on past research can be used to establish satisfactory benchmarks; and (3) features based on packet length are clearly determinant for capturing malicious activity. Our research showed that vectors currently used for attack detection are oversized, their accuracy and speed can be improved, and are to be adapted for dealing with encrypted traffic.","authors":["Fares Meghdouri","Tanja Zseby","Félix Iglesias Vázquez"],"meta":["November 2018Applied Sciences 8(11):2196","DOI:10.3390/app8112196"],"references":["304847859_The_evaluation_of_Network_Anomaly_Detection_Systems_Statistical_analysis_of_the_UNSW-NB15_data_set_and_the_comparison_with_the_KDD99_data_set","287330529_UNSW-NB15_a_comprehensive_data_set_for_network_intrusion_detection_systems_UNSW-NB15_network_data_set","319575105_Botnet_Communication_Patterns","319047036_A_Meta-Analysis_Approach_for_Feature_Selection_in_Network_Traffic_Research","318920198_Machine_Learning_for_Encrypted_Malware_Traffic_Classification_Accounting_for_Noisy_Labels_and_Non-Stationarity","318279474_Pattern_Discovery_in_Internet_Background_Radiation","315988539_A_multiclass_cascade_of_artificial_neural_network_for_network_intrusion_detection","301305372_Internet_traffic_classification_based_on_flows'_statistical_properties_with_machine_learning_INTERNET_TRAFFIC_CLASSIFICATION_BASED_ON_FLOWS'_STATISTICAL_PROPERTIES","299515356_Time-Activity_Footprints_in_IP_Traffic","275376847_Robust_Network_Traffic_Classification"]}