{"id":"328838702_PANTHER_version_14_more_genomes_a_new_PANTHER_GO-slim_and_improvements_in_enrichment_analysis_tools","abstract":"PANTHER (Protein Analysis Through Evolutionary Relationships, http://pantherdb.org) is a resource for the evolutionary and functional classification of genes from organisms across the tree of life. We report the improvements we have made to the resource during the past two years. For evolutionary classifications, we have added more prokaryotic and plant genomes to the phylogenetic gene trees, expanding the representation of gene evolution in these lineages. We have refined many protein family boundaries, and have aligned PANTHER with the MEROPS resource for protease and protease inhibitor families. For functional classifications, we have developed an entirely new PANTHER GO-slim, containing over four times as many Gene Ontology terms as our previous GO-slim, as well as curated associations of genes to these terms. Lastly, we have made substantial improvements to the enrichment analysis tools available on the PANTHER website: users can now analyze over 900 different genomes, using updated statistical tests with false discovery rate corrections for multiple testing. The overrepresentation test is also available as a web service, for easy addition to third-party sites.","authors":["Huaiyu Mi","Anushya Muruganujan","Dustin Ebert","Xiaosong Huang"],"meta":["November 2018Nucleic Acids Research 47(D1)","DOI:10.1093/nar/gky1038"],"references":["322991344_UniProt_the_universal_protein_knowledgebase","321149384_The_Reactome_Pathway_Knowledgebase","317163814_Expansion_of_the_Gene_Ontology_knowledgebase_and_resources","311348427_InterPro_in_2017-beyond_protein_family_and_domain_annotations","284171903_PANTHER_version_10_Expanded_protein_families_and_functions_and_analysis_tools","264640666_Big_Data_and_Other_Challenges_in_the_Quest_for_Orthologs","258314707_TreeFam_v9_A_new_website_more_species_and_orthology-on-_The-fly","321149471_The_MEROPS_database_of_proteolytic_enzymes_their_substrates_and_inhibitors_in_2017_and_a_comparison_with_peptidases_in_the_PANTHER_database","305375456_The_Reactome_pathway_Knowledgebase","297917249_PANTHER_a_library_of_protein_families_and_subfamilies_indexed_by_function"]}