{"id":"328866159_GenEth_A_general_ethical_dilemma_analyzer","abstract":"We argue that ethically significant behavior of autonomous systems should be guided by explicit ethical principles determined through a consensus of ethicists. Such a consensus is likely to emerge in many areas in which intelligent autonomous systems are apt to be deployed and for the actions they are liable to undertake, as we are more likely to agree on how machines ought to treat us than on how human beings ought to treat one another. Given such a consensus, particular cases of ethical dilemmas where ethicists agree on the ethically relevant features and the right course of action can be used to help discover principles needed for ethical guidance of the behavior of autonomous systems. Such principles help ensure the ethical behavior of complex and dynamic systems and further serve as a basis for justification of this behavior. To provide assistance in discovering ethical principles, we have developed GenEth, a general ethical dilemma analyzer that, through a dialog with ethicists, uses inductive logic programming to codify ethical principles in any given domain. GenEth has been used to codify principles in a number of domains pertinent to the behavior of autonomous systems and these principles have been verified using an Ethical Turing Test, a test devised to compare the judgments of codified principles with that of ethicists.","authors":["Michael Anderson","Susan Leigh Anderson"],"meta":["November 2018Paladyn, Journal of Behavioral Robotics 9(1):337-357","DOI:10.1515/pjbr-2018-0024"],"references":["259495905_GENETH_A_General_Ethical_Dilemma_Analyzer","259084235_What_Statistics_Could_Do_for_Ethics_The_Idea_of_Common_Sense_Processing_Based_Safety_Valve","227059533_Rule_Extraction_from_Support_Vector_Machines_An_Overview_of_Issues_and_Application_in_Credit_Scoring","307175251_Induction_of_Decision_Trees","301753012_Modelling_morality_with_prospective_logic","275869431_Outline_of_a_Decision_Procedure_for_Ethics","237122806_Probabilistic_Inductive_Logic_Programming","236519218_Man-made_minds_The_promise_of_artificial_intelligence","228979051_Towards_the_Ethical_Robot","226222944_Induction_of_Decision_Trees","221604863_MedEthEx_A_Prototype_Medical_Ethics_Advisor","225689421_Rule_Extraction_from_Support_Vector_Machines_An_Introduction","224982542_Computing_Machinery_and_Intelligence","222659956_Extensionally_Defining_Principles_and_Cases_in_Ethics_An_AI_Model","220694524_Inductive_logic_programming_Techniques_and_applications"]}