{"id":"328874544_Scalable_K-Core_Decomposition_for_Static_Graphs_Using_a_Dynamic_Graph_Data_Structure","abstract":"The k-core of a graph is a metric used in a wide range of applications, including social networks analytics, visualization, and graph coloring. Finding the maximal k-core of a graph can be be done in near linear time. The low computational requirements for finding the maximal k-core makes effective parallelization challenging, especially for the iterative algorithms that prune vertices and edges that no longer meet the requirements of the maximal k-core and require rebuilding the graph every iteration. In this paper, we present a new parallel and scalable algorithm for finding the maximal k-core. Similar to past algorithms, our algorithm also prunes vertices and edges. Unlike past approaches, our new algorithm does not rebuild the graph in every iteration-rather, it uses a dynamic graph data structure and avoids one of the largest performance penalties of k-core. We also show how to extend our algorithm to support k-core edge decomposition for different size k-cores found in the graph. This can be used for visualization and community analysis. While our new algorithms are architecture independent, our implementations target NVIDIA GPUs. When comparing our algorithms against several highly optimized algorithms, including the sequential igraph implementation and the multi-thread ParK implementation, our new algorithms are significantly faster. For finding the maximal k-core in the graph, our new algorithm can be up-to 58× faster the igraph and up-to 4× faster than ParK executed on a 36 core (72 thread) system. For the k-core decomposition algorithm, we saw even greater and more consistent speedups for our algorithm where it was up-to 130× faster than igraph and up-to 8× faster than ParK. Our algorithms were executed on an NVIDIA P100 GPU.","authors":["Alok Tripathy","Frederick Matthew Hohman","Duen Horng Chau","Oded Green"],"meta":["November 2018","DOI:10.1109/BigData.2018.8622056","Conference: IEEE Big DataAt: Seattle, WA","Project: Hornet"],"references":["327569751_Hornet_An_Efficient_Data_Structure_for_Dynamic_Sparse_Graphs_and_Matrices_on_GPUs","313453110_CoreScope_Graph_Mining_Using_k-Core_Analysis_-_Patterns_Anomalies_and_Algorithms","305807129_K_-shell_decomposition_reveals_hierarchical_cortical_organization_of_the_human_brain","281186342_CORECLUSTER_A_degeneracy_based_graph_clustering_framework","272546777_Network_decomposition_into_fixed_points_of_degree_peeling","337390646_The_ubiquity_of_large_graphs_and_surprising_challenges_of_graph_processing","320578576_Accelerating_Core_Decomposition_in_Large_Temporal_Networks_Using_GPUs","301233247_Network_structure_and_minimum_degree","281996789_ParK_An_efficient_algorithm_for_k-core_decomposition_on_multicore_processors","281396085_Prediction_of_protein_functions_based_on_k-cores_of_protein-protein_interaction_networks_and_amino_acid_sequences"]}