{"id":"328888540_Integrated_Production_Scheduling_and_Distribution_Planning_with_Time_Windows_Optimization_Models_and_Algorithms","abstract":"Ensuring timely product deliveries in supply chains depends on the decisions made at various stages of the supply chain, including the production stage where commodities are made available, and the distribution stage where shipments are made to customers within requested time windows. Delivery times depend on the distribution plans, which are inherently linked to the production schedules, as a commodity must first be produced or procured before being sent onwards in the supply chain. One way to ensure that the delivery times are respected is to perform direct shipments, but this is often costly. In contrast, products can be consolidated whereby several customers are visited on a given vehicle route, but this may result in either early or late deliveries. The challenge is then to devise lean production and distribution schedules that eliminate any redundancy in delivery times. In this chapter, we present an integrated production and outbound distribution scheduling problem with time windows arising in a supply chain. The problem involves jointly deciding on production and distribution operations where a manufacturer is committed first to processing a given set of orders and then to distributing them to the respective customers in different locations. The orders first undergo single processing through a set of identical parallel machines. Once completed, they are delivered by a fleet of vehicles in such a way so as to meet the customer time windows. The objective is to improve the timeliness of the deliveries, which is achieved by minimizing the earliness or tardiness of each order in reaching the customer. The chapter formally introduces the problem, describes integer linear programming formulations for two variants of the problem, and presents computational results on solving randomly generated instances with the proposed formulations.","authors":["Saadettin Kesen","Tolga Bektaş"],"meta":["January 2019","DOI:10.1007/978-3-319-97511-5_8","In book: Lean and Green Supply Chain Management (pp.231-252)"],"references":["260947593_The_nuclear_medicine_production_and_delivery_problem","313043515_Supply_chain_scheduling_batching_and_delivery","305659728_The_coordinated_production_and_transportation_scheduling_problem_with_a_time-sensitive_product_a_branch-and-cut_algorithm","284666442_The_Newspaper_ProductionDistribution_Problem","273508379_An_enhanced_model_for_the_integrated_production_and_transportation_problem_in_a_multiple_vehicles_environment","270007590_Integrated_batch_production_and_distribution_scheduling_with_limited_vehicle_capacity","263225440_Supply_Chain_Scheduling_Makespan_reduction_potential","262975562_Integrated_Scheduling_of_Production_and_Rail_Transportation","262266434_Coordination_of_Production_Scheduling_and_Delivery_Problems_with_Heterogeneous_Fleet","257596660_Semi-online_two-level_supply_chain_scheduling_problems"]}