{"id":"328962610_Industrie_40_in_production_ramp-up_management","abstract":"Shorter product life cycles and the growing complexity of new products and processes are leading to a greater relevance of production ramp-up management in the future. This statement is verified by the increasing amount of journal articles that focus on the instability that is inherent in ramp-up processes. The time and cost sensitive ramp-up phase, which is often characterized by low production capacity but high production demand, has a significant impact on the productivity level and thereby on the success of the entire company. In order to master the increasing number of ramp-up phases successfully, firms more and more realize that the coordination of humans and technologies in instable ramp-up projects has to become daily business. One promising approach to master high complexity and instability in socio-technical systems is Industrie 4.0. If the forecasts can be believed, the technologies and data availability that come along with the fourth industrial revolution will lead to productivity growth of up to 30%. However, except for a few mentions in current literature there is no contribution existing that focuses on the interaction of production ramp-up management and Industrie 4.0. Based on the analysis of both approaches, in this paper, opportunities as well as limitations are identified that might help ramp-up managers to better master the instability in future ramp-up phases.","authors":["Uwe Dombrowski","Jonas Wullbrandt","Philipp Krenkel"],"meta":["November 2018Procedia Manufacturing 17:1015-1022","DOI:10.1016/j.promfg.2018.10.085"],"references":["274951856_Effiziente_Fabrik_40_Einzug_von_Industrie_40_in_bestehende_Produktionssysteme","271999102_Mensch-zentrierte_IKT-Losungen_in_einer_Smart_Factory","321609903_Anlaufmanagement_in_der_Automobilindustrie_erfolgreich_umsetzen_Ein_Leitfaden_fur_die_Praxis","318344035_Lean_Ramp-up_Ein_Organisationsmodell_fur_das_Anlaufmanagement","34239492_Simulationsbasierte_Anlaufunterstutzung_auf_Basis_der_Qualitatsfahigkeiten_von_Produktionsprozessen"]}