{"id":"328930075_The_Gene_Ontology_Resource_20_years_and_still_GOing_strong","abstract":"The Gene Ontology resource (GO; http://geneontology.org) provides structured, computable knowledge regarding the functions of genes and gene products. Founded in 1998, GO has become widely adopted in the life sciences, and its contents are under continual improvement, both in quantity and in quality. Here, we report the major developments of the GO resource during the past two years. Each monthly release of the GO resource is now packaged and given a unique identifier (DOI), enabling GO-based analyses on a specific release to be reproduced in the future. The molecular function ontology has been refactored to better represent the overall activities of gene products, with a focus on transcription regulator activities. Quality assurance efforts have been ramped up to address potentially out-of-date or inaccurate annotations. New evidence codes for high-throughput experiments now enable users to filter out annotations obtained from these sources. GO-CAM, a new framework for representing gene function that is more expressive than standard GO annotations, has been released, and users can now explore the growing repository of these models. We also provide the 'GO ribbon' widget for visualizing GO annotations to a gene; the widget can be easily embedded in any web page.","authors":["The Gene Ontology Consortium","including","Marcio Luis Acencio","Martin Kuiper"],"meta":["November 2018Nucleic Acids Research 49:gky1055","DOI:10.1093/nar/gky1055","Project: Crossover Research 2.0: Well constructed knowledge commons"],"references":["328539816_Complex_Portal_2018_extended_content_and_enhanced_visualization_tools_for_macromolecular_complexes","324611325_Sensing_the_cilium_digital_capture_of_ciliary_data_for_comparative_genomics_investigations","323248197_Exploring_autophagy_with_Gene_Ontology","323200370_Improving_Interpretation_of_Cardiac_Phenotypes_and_Enhancing_Discovery_With_Expanded_Knowledge_in_the_Gene_Ontology","321149384_The_Reactome_Pathway_Knowledgebase","321108585_The_Gene_Ontology_of_eukaryotic_cilia_and_flagella","320806609_Mouse_Genome_Database_MGD-2018_Knowledgebase_for_the_laboratory_mouse","320593085_The_MetaCyc_database_of_metabolic_pathways_and_enzymes","319414682_Best_practice_data_life_cycle_approaches_for_the_life_sciences","317163814_Expansion_of_the_Gene_Ontology_knowledgebase_and_resources"]}