{"id":"328929802_Investigating_Flipped_Classroom_and_Problem-based_Learning_in_a_programming_module_for_computing_conversion_course","abstract":"This research paper investigates the effectiveness of combined Flipped Classroom (FC) and Problem-based Learning (PBL) teaching approach in a computer programming module. Combined FC-PBL makes use of learning technologies and supports authentic learning in terms of authentic context, multiple perspectives through team work and collaboration. FC involves watching educational videos prior to class session, and using the class session for practical tasks, thus supporting programming skills development. PBL enables authentic learning activities through group work and helps students to develop 21st century skills such as self-direction, collaboration, creativity and innovation. A research case study was conducted that considered a three-stage based delivery of the module that involved traditional, only FC, and combined FC-PBL teaching approaches applied on a number of programming topics. Both the educational and edutainment benefits were analyzed. The results show that combined FC-PBL approach is effective and the knowledge acquired by students improves, in particular, for the weaker students. Only 1.9% of students have scored an assessment mark lower than 40% compared to 28.3% and 24.5% when the traditional teaching and FC-only approaches respectively were used. Overall, a 26.56% increase in the assessment results was noticed when combined FC-PBL was used. The edutainment element was investigated through a questionnaire that assessed learning environment, engagement, learner satisfaction and whether the students have enjoyed learning sessions. The survey analysis shows that the combined FC-PBL approach does aid in the edutainment of mature students and provides an enjoyable learning experience. © 2018 International Forum of Educational Technology & Society (IFETS).","authors":["Adriana E. Chis","A.-N. Moldovan","L. Murphy","P. Pathak"],"meta":["January 2018Educational Technology & Society 21(4):232-247"],"references":[]}