{"id":"328979210_Immersive_Educational_Systems_With_Procedure-Oriented_Combinations_of_Real_and_Virtual_Environments","abstract":"Virtual reality (VR) is becoming increasingly popular in\neducational applications, but insufficient users’ feel of\nimmersion often slows the further adoption of VR. Many\nsolutions with a focus on the results rather than the details of\nthe interactions between the objects in the real and virtual\nworlds have been developed. Therefore, the real procedures are\ndistorted and the users lose their perception of in-person\nparticipation.\nIn order to improve the users’ feel of immersion further\nand to simulate more realistic operations in VR, a procedure-oriented\napproach for the combination of real and virtual\nenvironments is proposed here. As its name implies, this\napproach emphasizes the details of the procedures, namely how\nto capture, track, operate and interoperate the real and virtual\nobjects in a mixed environment. In order to illustrate this idea,\na prototype of mixed real and virtual assembly, in con-junction\nwith object recognition and rigid-object tracking functions\nbased on robotic vision techniques, is presented as an example.\nThis prototype is designed based on a game-based virtual laoratory\nsystem, and the specific implementation is a planetary\ngear train experiment. In this experiment, all models of the\nparts with the information required for the assembly are\ncreated, labeled and added to the database of the virtual\nlaboratory system. The physical parts are marked in order to\nfacilitate object recognition and object tracking. During the\nexperiment, the main assembly with one missing planetary gear\nis accomplished in a purely virtual environment. In the real\nworld, the missing planetary gear is tracked by a Kinect while\nthe user is manipulating this gear. Then, the system recognizes\nthis gear based on the markers and couples the corresponding\nvirtual model of that gear with the avatar’s hand in the virtual\nenvironment. Afterward, the cam-era tracks the real part, and\nthe user can adjust its pose and location to finish the final\nassembly. The main benefit of this implementation is that the\nuser can take advantage of some simple real parts in\nconjunction with virtual models of sophisticated parts in order\nto get realistic experience with the assembly process.","authors":["Zhou Zhang","Andy Zhang","Mingshao Zhang","Sven Esche"],"meta":["November 2018","DOI:10.1115/IMECE2018-86597","Conference: International Mechanical Engineering Congress & Exposition 2018At: David L. Lawrence Convention Center Pittsburgh, PA","Project: Virtual Laboratories (VLs) Developed with Machine Design, Robotic Sensing,  Dynamics and Control"],"references":["324791627_Collaborative_Virtual_Laboratory_Environments_with_Hardware_in_the_Loop","313476867_Usability_Evaluation_of_a_Virtual_Educational_Laboratory_Platform","309873255_Evaluation_of_a_video_game_adaptation_for_mechanical_engineering_educational_laboratories","308795979_A_Virtual_Laboratory_System_with_Biometric_Authentication_and_Remote_Proctoring_Based_on_Facial_Recognition","285810494_Presence_pedagogy_Teaching_and_learning_in_a_3D_virtual_immersive_world","278966707_Real-Time_3D_Reconstruction_for_Facilitating_the_Development_of_Game-based_Virtual_Laboratories","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","304850578_Virtual_Reality_and_Computer_Simulation","290161416_Virtual_assembly_using_virtual_reality_techniques","284923825_Virtual_realities"]}