{"id":"328979587_Development_of_Telepresence_Teaching_Robots_With_Social_Capabilities","abstract":"A telepresence robot is a device that allows people to participate in video conferences on a moveable platform from a remote location. The users can remotely control the robot’s motion and interact with each other through a video screen. Such systems, which were originally designed to promote social interaction between people, have become popular in various application areas such as office environments, health care, independent living for the elderly, and distance learning. Although there is ample published empirical work surrounding the use of telepresence and computer-mediated communication in education, few studies have examined telepresence robots in the classroom. Although some studies have indicated positive learning experiences and outcomes in education facilitated by telepresence robots, further research is needed to better identify the possible effects such approaches have on student learning and perceptions of instructor credibility.\nIn order to maximize the students’ learning outcomes, it is very important to improve the usability of the telepresence robot platform for both the instructors and the students. In addition, the instructor credibility is also crucial to the overall learning experience. In the research presented here, an innovative remote teaching platform, which includes features of telepresence robots and social robots (which are autonomous robots that interact and communicate with humans by following social behaviors and rules associated with their roles), is developed. It is believed that telepresence robots equipped with the capabilities provided by social robots can improve the credibility of the instructor and the usability of the education platform, both of which contribute to the students’ overall learning outcomes.","authors":["Mingshao Zhang","Pengji Duan","Zhou Zhang","Sven Esche"],"meta":["November 2018","DOI:10.1115/IMECE2018-86686","Conference: International Mechanical Engineering Congress & Exposition 2018At: David L. Lawrence Convention Center Pittsburgh, PA"],"references":["313476867_Usability_Evaluation_of_a_Virtual_Educational_Laboratory_Platform","299576472_Evaluation_of_an_Assistive_Telepresence_Robot_for_Elderly_Healthcare","260736640_An_open_platform_telepresence_robot_with_natural_human_interface","224685452_A_Pilot_Study_on_Teleoperated_Mobile_Robots_in_Home_Environments","12076319_Changing_How_and_What_Children_Learn_in_School_with_Computer-Based_Technologies","321820850_Designing_telepresence_robots_for_K-12_education","308817887_Accelerating_real-time_face_detection_on_a_raspberry_pi_telepresence_robot","285212250_Beaming_Children_where_they_cannot_go_Telepresence_Robots_and_Inclusive_Education_An_Exploratory_Study","51815351_Stability_of_central_binaural_sound_localization_mechanisms_in_mammals_and_the_Heffner_hypothesis","5992661_Developing_a_Telepresence_Robot_for_Interpersonal_Communication_with_the_Elderly_in_a_Home_Environment"]}