{"id":"328913566_Subjective_and_Objective_Quality_Assessment_for_Volumetric_Video_Compression","abstract":"Volumetric video is becoming easier to capture and display with the recent technical developments in the acquisition, and display technologies. Using point clouds is a popular way to represent volumetric video for augmented or virtual reality applications. This representation, however, requires a large number of points to achieve a high quality of experience and needs compression before storage and transmission. In this paper, we study the subjective and objective quality assessment results for volumetric video compression, using a state-of-the-art compression algorithm: MPEG Point Cloud Compression Test Model Category 2 (TMC2). We conduct subjective experiments to find the perceptual impacts on compressed volumetric video with different quantization parameters and point counts. Additionally, we find the relationship between the state-of-the-art objective quality metrics and the acquired subjective quality assessment results. To the best of our knowledge, this study is the first to consider TMC2 compression for volumetric video represented as coloured point clouds and study its effects on the perceived quality. The results show that the effect of input point counts for TMC2 compression is not meaningful, and some geometry distortion metrics disagree with the perceived quality. The developed database is publicly available to promote the study of volumetric video compression.","authors":["Emin Zerman","Pan Gao","Cagri Ozcinar","Aljosa Smolic"],"meta":["January 2019Electronic Imaging 2019(10)","DOI:10.2352/ISSN.2470-1173.2019.10.IQSP-323","Conference: Image Quality and System PerformanceAt: Burlingame, USA","Project: V-SENSE - Extending Visual Sensation through Image-based Visual Computing"],"references":["328913425_The_Relation_Between_MOS_and_Pairwise_Comparisons_and_the_Importance_of_Cross-Content_Comparisons","321745352_A_practical_guide_and_software_for_analysing_pairwise_comparison_experiments","327513150_Point_Cloud_Quality_Assessment_Metric_Based_on_Angular_Similarity","327513048_Point_cloud_subjective_evaluation_methodology_based_on_reconstructed_surfaces","327513044_A_novel_methodology_for_quality_assessment_of_voxelized_point_clouds","327511557_Impact_of_Visualisation_Strategy_for_Subjective_Quality_Assessment_of_Point_Clouds","327511281_Point_Cloud_Subjective_Evaluation_Methodology_based_on_2D_Rendering","327028745_Beckett_in_VR_exploring_narrative_using_free_viewpoint_video","323973680_Affordable_Content_Creation_for_Free-Viewpoint_Video_and_VRAR_Applications","323352228_Geometric_distortion_metrics_for_point_cloud_compression"]}