{"id":"328949981_Quantum_No-Scale_Regimes_and_String_Moduli","abstract":"We review that in no-scale models in perturbative string theory, flat, homogeneous and isotropic cosmological evolutions found at the quantum level can enter into “quantum no-scale regimes” (QNSRs). When this is the case, the quantum effective potential is dominated by the classical kinetic energies of the no-scale modulus, dilaton and moduli not involved in the supersymmetry breaking. As a result, the evolutions approach the classical ones, where the no-scale structure is exact. When the one-loop potential is positive, a global attractor mechanism forces the initially expanding solutions to enter the QNSR describing a flat, ever-expanding universe. On the contrary, when the potential can reach negative values, the internal moduli induce in most cases some kind of instability of the growing universe. The latter stops expanding and eventually collapses, unless the initial conditions are tuned in a tiny region of the phase space. Finally, in QNSR, no gauge instability takes place, regardless of the details of the potential.","authors":["Hervé Partouche"],"meta":["November 2018Universe 4(11):123","DOI:10.3390/universe4110123"],"references":["324167250_Quantum_no-scale_regimes_and_moduli_dynamics","321936661_GUT_Precursors_and_Entwined_SUSY_The_Phenomenology_of_Stable_Non-Supersymmetric_Strings","321325775_Quantum_no-scale_regimes_in_string_theory","321139249_Exponential_suppression_of_the_cosmological_constant_in_nonsupersymmetric_string_vacua_at_two_loops_and_beyond","320619610_Tension_Between_a_Vanishing_Cosmological_Constant_and_Non-Supersymmetric_Heterotic_Orbifolds","312043147_N2_-_0_super_no-scale_models_and_moduli_quantum_stability","306226570_Chiral_Heterotic_Strings_with_Positive_Cosmological_Constant","304965337_Super_no-scale_models_in_string_theory","312760631_On_exponential_suppression_of_the_cosmological_constant_in_non-SUSY_strings_at_two_loops_and_beyond","303449171_More_on_Non-supersymmetric_Asymmetric_Orbifolds_with_Vanishing_Cosmological_Constant"]}