{"id":"328999647_Automated_identification_of_media_bias_in_news_articles_an_interdisciplinary_literature_review","abstract":"Media bias, i.e., slanted news coverage, can strongly impact the public perception of the reported topics. In the social sciences, research over the past decades has developed comprehensive models to describe media bias and effective, yet often manual and thus cumbersome, methods for analysis. In contrast, in computer science fast, automated, and scalable methods are available, but few approaches systematically analyze media bias. The models used to analyze media bias in computer science tend to be simpler compared to models established in the social sciences, and do not necessarily address the most pressing substantial questions, despite technically superior approaches. Computer science research on media bias thus stands to profit from a closer integration of models for the study of media bias developed in the social sciences with automated methods from computer science. This article first establishes a shared conceptual understanding by mapping the state of the art from the social sciences to a framework, which can be targeted by approaches from computer science. Next, we investigate different forms of media bias and review how each form is analyzed in the social sciences. For each form, we then discuss methods from computer science suitable to (semi-)automate the corresponding analysis. Our review suggests that suitable, automated methods from computer science, primarily in the realm of natural language processing, are already available for each of the discussed forms of media bias, opening multiple directions for promising further research in computer science in this area.","authors":["Felix Hamborg","Karsten Donnay","Bela Gipp"],"meta":["December 2019International Journal on Digital Libraries 20(2)","DOI:10.1007/s00799-018-0261-y","Project: Media Bias Analysis"],"references":["336746699_State-of-the-art_in_Detecting_Academic_Plagiarism","327289068_Doing_News_Framing_Analysis_II_Empirical_and_Theoretical_Perspectives","325228442_Bias-aware_news_analysis_using_matrix-based_news_aggregation","325176943_Extraction_of_Main_Event_Descriptors_from_News_Articles_by_Answering_the_Journalistic_Five_W_and_One_H_Questions","323582278_Giveme5W_Main_Event_Retrieval_from_News_Articles_by_Extraction_of_the_Five_Journalistic_W_Questions","344550448_The_Nature_and_Origins_of_Mass_Opinion","339502749_Opinion_Mining_and_Sentiment_Analysis","330189816_The_Gate_Keeper_A_Case_Study_In_the_Selection_of_News","325514102_Digital_Citizenship_The_Internet_Society_and_Participation","324630354_Selection_Bias_in_News_Coverage_Learning_it_Fighting_it"]}