{"id":"328992003_Betweenness_Centrality_for_Networks_with_Non-Overlapping_Community_Structure","abstract":"Evaluating the centrality of nodes in complex net-works is one of the major research topics being explored due toits wide range of applications. Among the various measures thathave been developed over the years, Betweenness centrality is oneof the most popular. Indeed, it has proved to be efficient in manyreal-world situations. In this paper, we propose an extensionof the Betweenness centrality designed for networks with non-overlapping community structure. It is a linear combination ofthe so-called ”local” and ”global” Betweenness measures. TheLocal measure takes into account the influence of a node atthe community level while the global measure depends onlyon the interactions between the communities. Depending of thecommunity structure strength, more or less importance is givento each of these two elements. By using the Susceptible-Infected-Recovered (SIR) model in epidemic spreading simulations, weshow that the ”Weighted Community Betweenness” centrality ismore efficient than the traditional Betweenness which is agnosticof the community structure. The proposed measure stands outalso the traditional measure by its low complexity, allowing itsuse in very large scale networks.","authors":["Zakariya Ghalmane","Mohammed El Hassouni","Hocine Cherifi"],"meta":["October 2018","DOI:10.1109/CompEng.2018.8536229","Conference: 2018 IEEE Workshop on Complexity in Engineering (COMPENG)"],"references":["305516349_Epidemic_spreading_on_complex_networks_with_community_structures","292071498_User_and_group_networks_on_YouTube_A_comparative_analysis","268748105_Community-based_Immunization_Strategies_for_Epidemic_Control","259492817_An_Efficient_Immunization_Strategy_for_Community_Networks","324634190_An_Efficient_Immunization_Strategy_Using_Overlapping_Nodes_and_Its_Neighborhoods","309095047_A_local_immunization_strategy_for_networks_with_overlapping_community_structure","305220214_Immunization_Strategies_Based_on_the_Overlapping_Nodes_in_Networks_with_Community_Structure","304744011_Vital_nodes_identification_in_complex_networks","301873976_Identifying_Influential_Spreaders_of_Epidemics_on_Community_Networks","294110152_Centrality_Measures_for_Networks_with_Community_Structure"]}