{"id":"328920026_A_Design_for_Challenge-Based_Learning_of_Programming","abstract":"Computer Science students are expected to acquire good programming skills. Both students and instructors accept that learning programming for first-year college students is fairly difficult. To assist students to achieve this goal, instructors will have to adopt a suitable design for programming courses. This paper reports on the design of a Computer Programming course based on the integrated course design approach, which was conducted by a research group at Universiti Kebangsaan Malaysia from the Faculty of Information Science and Technology. The course is designed to provide relevant teaching and learning activities, feedback, and assessment that will ultimately support the learning goals of students. The design will provide opportunities for preparation time, meaningful feedback, and a competitive feel to the course. The effectiveness of this approach is then evaluated via an online survey that was administered to first-year undergraduate students. The results obtained from 162 first-year students showed that the students were able to improve the results of their the first-year program with the utilization of PC², as it allowed them to obtain prompt feedback. The use of PC² also gives them a competitive atmosphere, which motivates them to perform better. The survey results also indicate that the students used their time to prepare for lab sessions via tutorials and self-learning. © International Journal on Advanced Science Engineering Information Technology.","authors":["Rodziah Latih","Marini Abu Bakar","Norleyza Jailani","Noorazean Mohd Ali"],"meta":["October 2018International Journal on Advanced Science Engineering and Information Technology 8(5):1912","DOI:10.18517/ijaseit.8.5.6455"],"references":["305081685_Towards_a_Systematic_Review_of_Automated_Feedback_Generation_for_Programming_Exercises","281759698_A_two-tier_test-based_approach_to_improving_students'_computer-programming_skills_in_a_web-based_learning_environment","257716774_Major_Problems_in_Basic_Programming_that_Influence_Student_Performance","257716773_Students'_Perception_and_Motivation_Towards_Programming","237487909_The_Power_of_Course_Design_to_Increase_Student_Engagement_and_Learning","323820257_Serious_games_for_effective_learning","277080577_Test-Enhanced_Learning_The_Potential_for_Testing_to_Promote_Greater_Learning_in_Undergraduate_Science_Courses","272984414_Challenges_and_Issues_of_Generation_Z","267407227_AC_2011-308_TEACHING_COMPUTER_PROGRAMMING_SKILLS_TO_ENGINEERING_AND_TECHNOLOGY_STUDENTS_WITH_A_MODULAR_PROGRAMMING_STRATEGY_Teaching_Computer_Programming_Skills_to_Engineering_and_Technology_Students_","224593099_Employability_and_service_science_Facing_the_challenges_via_curriculum_design_and_restructuring"]}