{"id":"328915881_Review_New_considerations_to_refine_breeding_objectives_of_dairy_cows_for_increasing_robustness_and_sustainability_of_grass-based_milk_production_systems","abstract":"Although food from grazed animals is increasingly sought by consumers because of perceived animal welfare advantages, grazing systems provide the farmer and the animal with unique challenges. The system is dependent almost daily on the climate for feed supply, with the importation of large amounts of feed from off farm, and associated labour and mechanisation costs, sometimes reducing economic viability. Furthermore, the cow may have to walk long distances and be able to harvest feed efficiently in a highly competitive environment because of the need for high levels of pasture utilisation. She must, also, be: (1) highly fertile, with a requirement for pregnancy within ~80 days post-calving; (2) ‘easy care’, because of the need for the management of large herds with limited labour; (3) able to walk long distances; and (4) robust to changes in feed supply and quality, so that short-term nutritional insults do not unduly influence her production and reproduction cycles. These are very different and are in addition to demands placed on cows in housed systems offered pre-made mixed rations. Furthermore, additional demands in environmental sustainability and animal welfare, in conjunction with the need for greater system-level biological efficiency (i.e. ‘sustainable intensification’), will add to the ‘robustness’ requirements of cows in the future. Increasingly, there is evidence that certain genotypes of cows perform better or worse in grazing systems, indicating a genotype×environment interaction. This has led to the development of tailored breeding objectives within countries for important heritable traits to maximise the profitability and sustainability of their production system. To date, these breeding objectives have focussed on the more easily measured traits and those of highest relative economic importance. In the future, there will be greater emphasis on more difficult to measure traits that are important to the quality of life of the animal in each production system and to reduce the system’s environmental footprint.","authors":["John R Roche","Donagh P Berry","L. Delaby","Patrick Dillon"],"meta":["November 2018animal 12(s2):1-13","DOI:10.1017/S1751731118002471"],"references":["316638655_Review_Deciphering_animal_robustness_A_synthesis_to_facilitate_its_use_in_livestock_breeding_and_management","341927890_A_meta-analysis_of_the_impact_of_stocking_rate_on_the_productivity_of_pasture-based_milk_production_systems","323496033_Dairy_cow_breed_interacts_with_stocking_rate_in_temperate_pasture-based_dairy_production_systems","321691518_Breeding_a_better_cow-Will_she_be_adaptable","321436250_A_100-Year_Review_A_century_of_change_in_temperate_grazing_dairy_systems","320834847_Using_models_to_establish_the_financially_optimum_strategy_for_Irish_dairy_farms","319166145_Nutrition_management_of_grazing_dairy_cows_in_temperate_environments","318459302_Seasonal_pasture-based_dairy_production_systems","317408636_Production_and_economic_responses_to_intensification_of_pasture-based_dairy_production_systems","313268990_Ability_of_dairy_cows_to_ensure_pregnancy_according_to_breed_and_genetic_merit_for_production_traits_under_contrasted_pasture-based_systems"]}