{"id":"329082162_OPENTD_PLATAFORMA_WEB_PARA_TELEDIAGNOSTICO_DE_EXAMES_DE_IMAGEM","abstract":"Na perspectiva de garantir a todos os brasileiros os princípios básicos do Sistema Único de Saúde (SUS), a integralidade e universalidade são comprometidas devido a dificuldade em atender as demandas e particularidades de um país de dimensões territoriais continentais. A desigualdade no acesso aos serviços de saúde provocada pela carência e má distribuição geográfica de profissionais de saúde em áreas remotas, principalmente no campo da radiologia, dificultam execução de uma política de saúde tão grande e ambiciosa. Nesse contexto, o estudo apresenta uma solução para essa problemática, oferecendo a oportunidade de todo o processo de laudagem ser feito de maneira descentralizada e a distância via web através de uma plataforma de telediagnóstico. Com relação a metodologia, utilizou-se para o desenvolvimento da referida plataforma, as seguintes tecnologias: o sistema de gerenciamento de banco de dados PostgresSQL, por sua grande estabilidade e confiabilidade, e o Laravel, que é um framework de desenvolvimento web. Como resultados alcançados, observou-se com a implementação do OpenTeleDiagnóstico (OpenTD), que é possível transpor barreiras importantes na área da radiologia, impactando de modo positivo o processo de trabalho hospitalar. Os usuários do OpenTD no HUOL mostraram-se satisfeitos com a plataforma. Outro fator significativo constatado no que tange a plataforma é o impacto ambiental e financeiro, proporcionado pela redução da utilização de papéis no serviço de saúde já que os laudos são digitalizados e armazenados de maneira segura.","authors":["Nícolas Vinícius Rodrigues Veras","Paulo Victor de Azevedo Guerra","Marcel da Câmara Ribeiro-Dantas","Isabele Magaldi Almeida de Freitas"],"meta":["November 2018Revista Brasileira de Inovação Tecnológica em Saúde ISSN 2236-1103","DOI:10.18816/r-bits.v8i2.15567","Project: OpenPACS"],"references":["273992640_A_Rede_de_Teleassistencia_de_Minas_Gerais_e_suas_contribuicoes_para_atingir_os_principios_de_universalidade_equidade_e_integralidade_do_SUS_-_relato_de_experiencia_-_DOI_103395reciisv7i2775pt","266468578_Telediagnostico_Auxiliado_por_Computador_e_Monitoramento_Atraves_de_Imagens_de_Reparacao_Tecidual_de_Ulceras_Troficas_de_Perna","255640682_Estrategia_para_Avaliacao_de_um_Sistema_de_Cooperacao_em_Saude_na_Web","245846190_Bioetica_e_vulnerabilidade_o_medico_e_o_paciente","12523364_An_Internet-based_telediagnosis_system_for_Chinese_medicine"]}