{"id":"329018485_Bringing_Semantics_to_Services_The_OWL-S_Approach","abstract":"Technological developments that occur different fields of life tend more and more to make human life easier in solution of various problems faced by humans in everyday life. One of the latest developments in the field of computer science it is the rapid development and greater use of web services in creation of various applications. Great reasons to use web services are many, however, great addition to their use also has numerous deficiencies such as difficult composition of web services in environments where implemented , lack of adequate finding web services that are required , inadequate ranking of web services etc. Through this paper we tried to present a brief description of one of the new technologies that tends to introduce semantics in creating and ranking of web services, respectively enables machine-machine communication, without human intervention. OWLS is technology which is trying to revolutionize the creation and ranking of web services , with purpose to offer customers more and more the best services that they need. We tried to present innovations that bring this technology , advantages compared with models that have been used in the past , and also we have given our approach for creating a web service based on OWLS , we created an extended model with all actors needed in process of creating a web service.","authors":["Festim Halili","Avni Rustemi"],"meta":["October 2016","Project: Book: Software Engineering - A perspective on Service Oriented Computing"],"references":["267917943_Bringing_Semantics_to_Web_Services_Model_driven_approach","221465983_A_Model_Driven_Approach_for_Building_OWL_DL_and_OWL_Full_Ontologies","221342188_On_the_Relationship_of_Ontologies_and_Models","221023204_Converting_UML_to_OWL_ontologies","4186813_A_model-driven_approach_for_specifying_semantic_Web_services","2561491_UML_for_the_Semantic_Web_Transformation-Based_Approaches","319395262_OWL_Web_Ontology_Language_Guide","262156730_The_Semantic_Web"]}