{"id":"329064586_Boundary_behaviours_of_Leishmania_mexicana_A_hydrodynamic_simulation_study","abstract":"It is well established that the parasites of the genus Leishmania exhibit complex surface interactions with the sandfly vector midgut epithelium, but no prior study has considered the details of their hydrodynamics. Here, the boundary behaviours of motile Leishmania mexicana promastigotes are explored in a computational study using the boundary element method, with a model flagellar beating pattern that has been identified from digital videomicroscopy. In particular a simple flagellar kinematics is observed and quantified using image processing and mode identification techniques, suggesting a simple mechanical driver for the Leishmania beat. Phase plane analysis and long-time simulation of a range of Leishmania swimming scenarios demonstrate an absence of stable boundary motility for an idealised model promastigote, with behaviours ranging from boundary capture to deflection into the bulk both with and without surface forces between the swimmer and the boundary. Indeed, the inclusion of a short-range repulsive surface force results in the deflection of all surface-bound promastigotes, suggesting that the documented surface detachment of infective metacyclic promastigotes may be the result of their particular morphology and simple hydrodynamics. Further, simulation elucidates a remarkable morphology-dependent hydrodynamic mechanism of boundary approach, hypothesised to be the cause of the well-established phenomenon of tip-first epithelial attachment of Leishmania promastigotes to the sandfly vector midgut.","authors":["Benjamin James Walker","Richard J Wheeler","Kenta Ishimoto","Eamonn A Gaffney"],"meta":["November 2018Journal of Theoretical Biology 462","DOI:10.1016/j.jtbi.2018.11.016"],"references":["319113439_The_global_burden_of_disease_study_2013_What_does_it_mean_for_the_NTDs","313186897_Use_of_chiral_cell_shape_to_ensure_highly_directional_swimming_in_trypanosomes","311611868_Mechanical_tuning_of_mammalian_sperm_behaviour_by_hyperactivation_rheology_and_substrate_adhesion_A_numerical_exploration","275052474_Fluid_flow_and_sperm_guidance_A_simulation_study_of_hydrodynamic_sperm_rheotaxis","263968032_Shape_Mode_Analysis_Exposes_Movement_Patterns_in_Biology_Flagella_and_Flatworms_as_Case_Studies","320250062_Guidance_of_microswimmers_by_wall_and_flow_Thigmotaxis_and_rheotaxis_of_unsteady_squirmers_in_two_and_three_dimensions","303919265_The_hydrodynamics_ofswimming_microorganisms","301798009_A_squirmer_across_Reynolds_numbers","267139107_Surface_accumulation_of_spermatozoa_A_fluid_dynamic_phenomenon","263862507_A_study_of_spermatozoan_swimming_stability_near_a_surface"]}