{"id":"329051001_Automated_detection_of_imaging_features_of_disproportionately_enlarged_subarachnoid_space_hydrocephalus_using_machine_learning_methods","abstract":"Objective\nCreate an automated classifier for imaging characteristics of disproportionately enlarged subarachnoid space hydrocephalus (DESH), a neuroimaging phenotype of idiopathic normal pressure hydrocephalus (iNPH).\n\nMethods\n1597 patients from the Mayo Clinic Study of Aging (MCSA) were reviewed for imaging characteristics of DESH. One core feature of DESH, the presence of tightened sulci in the high-convexities (THC), was used as a surrogate for the presence of DESH as the expert clinician-defined criterion on which the classifier was trained. Anatomical MRI scans were automatically segmented for cerebrospinal fluid (CSF) and overlaid with an atlas of 123 named sulcal regions. The volume of CSF in each sulcal region was summed and normalized to total intracranial volume. Area under the receiver operating characteristic curve (AUROC) values were computed for each region individually, and these values determined feature selection for the machine learning model. Due to class imbalance in the data (72 selected scans out of 1597 total scans) adaptive synthetic sampling (a technique which generates synthetic examples based on the original data points) was used to balance the data. A support vector machine model was then trained on the regions selected.\n\nResults\nUsing the automated classification model, we were able to classify scans for tightened sulci in the high convexities, as defined by the expert clinician, with an AUROC of about 0.99 (false negative ≈ 2%, false positive ≈ 5%). Ventricular volumes were among the classifier's most discriminative features but are not specific for DESH. The inclusion of regions outside the ventricles allowed specificity from atrophic neurodegenerative diseases that are also accompanied by ventricular enlargement.\n\nConclusion\nAutomated detection of tight high convexity, a key imaging feature of DESH, is possible by using support vector machine models with selected sulcal CSF volumes as features.","authors":["Nathaniel B. Gunter","Christopher G. Schwarz","Jonathan Graff-Radford","Jeffrey L Gunter"],"meta":["November 2018NeuroImage: Clinical 21","DOI:10.1016/j.nicl.2018.11.015"],"references":["304663875_High-Convexity_Tightness_Predicts_the_Shunt_Response_in_Idiopathic_Normal_Pressure_Hydrocephalus","303693560_A_large-scale_comparison_of_cortical_thickness_and_volume_methods_for_measuring_Alzheimer's_disease_severity","233773062_Guidelines_for_Management_of_Idiopathic_Normal_Pressure_Hydrocephalus_Second_Edition","224330873_ADASYN_Adaptive_Synthetic_Sampling_Approach_for_Imbalanced_Learning","220543125_SMOTE_Synthetic_Minority_Over-sampling_Technique","50418998_pROC_An_open-source_package_for_R_and_S_to_analyze_and_compare_ROC_curves","320522331_THE_MAYO_CLINIC_ADULT_LIFESPAN_TEMPLATE_BETTER_QUANTIFICATION_ACROSS_THE_LIFESPAN","312455832_R_A_Language_and_Environment_for_Statistical_Computing","261221919_Prevalence_of_idiopathic_normal-pressure_hydrocephalus","229093161_Head_size_age_and_gender_adjustment_in_MRI_studies_A_necessary_nuisance"]}