{"id":"329042258_Coherency_and_differential_Mueller_matrices_for_polarizing_media","abstract":"The elements of the coherency matrix give the strength of the components of a Mueller matrix in the coherency basis. The Z-matrix (called the polarization-coupling matrix or state-generating matrix) represents a partial sum of the coherency expansion. For transmission through a deterministic medium, the coherency elements can be used directly as generators to calculate the development of polarization upon propagation. The commutation properties of the coherency elements are investigated. New matrices that we call the W-matrix and the X-matrix, both different representations of the Z-matrix in a Jones basis, are introduced. The W-matrix controls the transformation of the Jones vector and also the covariance matrix. The product of the X-matrix with its complex conjugate gives the matrix representation of the Mueller matrix in the Jones basis. The development of Mueller matrix and coherency matrix elements upon propagation through some examples of a uniform medium is investigated. It is shown that the coherency matrix is more easily interpreted than the Mueller matrix. Analytic expressions are presented to calculate the elementary polarization properties from coherency matrix elements or Mueller matrix parameters.","authors":["Colin Sheppard","Artemi Bendandi","Aymeric Le Gratiet","Alberto Diaspro"],"meta":["November 2018Journal of the Optical Society of America A 35(12):2058-2069","DOI:10.1364/JOSAA.35.002058","Project: Mueller Matrix Microscopy"],"references":["323882615_Factorization_of_the_coherency_matrix_of_polarization_optics","318010142_A_table_of_some_coherency_matrices_coherency_matrix_factors_CMFs_and_their_respective_Mueller_matrices","315613186_Parameterization_of_the_deterministic_Mueller_matrix_Application_to_a_uniform_medium","311645910_Vector_and_matrix_states_for_Mueller_matrices_of_nondepolarizing_optical_media","309902261_Parameterization_of_the_Mueller_matrix","299379801_Expressions_for_parallel_decomposition_of_the_Mueller_matrix","281352684_Depolarizing_differential_Mueller_matrix_of_homogeneous_media_under_Gaussian_fluctuation_hypothesis","273473598_Differential_Mueller_matrix_of_a_depolarizing_homogeneous_medium_and_its_relation_to_the_Mueller_matrix_logarithm","273330176_Integral_decomposition_and_polarization_properties_of_depolarizing_Mueller_matrices","281233635_GROUP_THEORY_AND_POLARISATION_ALGEBRA"]}