{"id":"329043854_Intrusion_Detection_System_and_Neutrosophic_theory_for_MANETs_A_Comparative_study","abstract":"Mobile Ad hoc Network (MANET) is a system of wireless mobile nodes that dynamically self-organized in arbitrary and temporary network topologies without communication infrastructure. This network may change quickly and unforeseeable. The unique characteristics of MANET give an adversary the opportunity to launch numerous attacks against ad-hoc networks. So the security is an important role in MANETs. This article aims to present the concept of intrusion detection system (IDs) and surveys some of major intrusion detection approach against neutrosophic intrusion detection system in MANETs. Current IDS’s corresponding to those architectures are also reviewed and compared. This paper introduces the accuracy rate and false alarm rate of four completely different classifiers to observe the percentage and the efficiency of the classifiers in detecting attacks in MANETs. Results show that Neutrosophic intelligent system based on genetic algorithm could facilitate significantly in detecting malicious activities in MANETs. Hence, neutrosophic techniques could be utilized to suit the ambiguity nature of the IDs.","authors":["A. A. Salama","Haitham Elwahsh","Mona Gamal","Ibrahim Mahmoud El-henawy"],"meta":["November 2018","Project: New Trends in Neutrosophic Theory and Applications"],"references":["327390895_Neutrosophic_Approach_to_Grayscale_Images_Domain","327138664_A_Novel_approach_for_classify_MANETs_attacks_with_a_neutrosophic_intelligent_system_based_on_genetic_algorithm","321812783_Modeling_Neutrosophic_Data_by_Self-Organizing_Feature_Map_MANETs_Data_Case_Study","282442431_Basic_Structure_of_Some_Classes_of_Neutrosophic_Crisp_Nearly_Open_Sets_Possible_Application_to_GIS_Topology","268444118_Neutrosophic_Set_-_A_Generalization_of_the_Intuitionistic_Fuzzy_Set","325562556_Intelligent_intrusion_detection_system_using_clustered_self_organized_map","318279418_An_Efficient_Intrusion_Detection_System_based_on_Hypergraph_-_Genetic_Algorithm_for_Parameter_Optimization_and_Feature_Selection_in_Support_Vector_Machine","314814898_Ariadne_a_secure_on-demand_routing_protocol_for_ad_hoc_networks","290570326_Security_for_Wireless_Ad_Hoc_Networks","256992299_Intuitionistic_Fuzzy_Sets_Fuzzy_Sets_Syst"]}