{"id":"329043494_A_post-structuralist_revised_Weil-Levi-Strauss_transformation_formula_for_conceptual_value-fields","abstract":"Abstract. The structuralist André-Weil–Claude-Lévi-Strauss transformation formula (CF), initially applied to kinship systems, mythology, ritual, artistic design and architecture, was rightfully criticized for its rationalism and tendency to reduce complex transformations to analogical structures. I present a revised non-mathematical revision of the CF, a general transformation formula (rCF) applicable to networks of complementary semantic binaries in conceptual value-fields of culture, including comparative religion and mythology, ritual, art, literature and philosophy. The rCF is a rule-guided formula for combinatorial conceptualizing in non-representational, presentational mythopoetics and other cultural symbolizations. I consider poststructuralist category-theoretic and algebraic mathematical interpretations of the CF as themselves only mathematical analogies, which serve to stimulate further revision of the logic model of the rCF. The rCF can be used in hypothesis-making to advance nunderstanding of the evolution and prehistory of human symbolic behaviour in cultural space, philosophical ontologies and categories, definitions and concepts in art, religion, psychotherapy, and other cultural-value forms.\n\nKeywords: Lévi-Strauss; myth; symbol; law of myth; culture; evolution of culture; mind\n\nSign Systems Studies 46(2/3), 2018, 255–281","authors":["James B. Harrod"],"meta":["November 2018Sign Systems Studies 46(2/3):255","DOI:10.12697/SSS.2018.46.2-3.03","Project: Revising the André-Weil-Claude-Levi-Strauss canonical formula"],"references":["318761613_A_phylogenetic_interpretation_of_the_canonical_formula_of_myths_by_Levi-Strauss","305911389_Creating_a_New_Mathematics","286220144_Cortical_Tracking_of_Hierarchical_Linguistic_Structures_in_Connected_Speech","349808514_9_On_Some_Philosophical_Dynamic_and_Connectionist_Implications_of_the_Canonical_Formula_of_Myth_Seen_as_Space_Categorization","329230251_Structural_Models_in_Folklore_and_Transformational_Essays","328392744_Four_Forms_Make_A_Universe","318494453_Metaphors_We_Live_By","317660990_Metaphor_and_Reality","280629300_Towards_a_heterarchical_approach_to_biology_and_cognition","280058547_How_The_Living_Is_In_The_World_An_Inquiry_Into_The_Informational_Choreographies_Of_Life"]}