{"id":"329039142_Role_of_Multidisciplinary_and_Interdisciplinary_Education_in_Computer_Science_A_Literature_Review","abstract":"Disruption of economies, caused by the Internet and communications\ntechnology and its effect to other industries, has had and will continue to\nhave severe effect to the existing business models and production of goods\nfor the upcoming decades. In addition, increasing complexity of global\nproblems calls for the need of new problem solving competences. Complex\nproblem solvers, knowledge workers, are more and more working by collaborative\nstructures, where the solution creation benefits from multiprofessional\nway of working. This study is focusing on a trend of how higher\neducation, especially in the area of computer science and engineering, is\nresponding to the challenge of educating collaborative knowledge workers\nto a knowledge intensive work environment. The study was performed\nby a literature review covering publications indexed by the Scopus bibliographic\ndatabase to find relevant research articles and reviews published\nbetween the years 2000 and 2016. The results indicate a steadily growing\ninterest towards multi- and interdisciplinary education. Most of the interest\nis indicated among the health care, medicine and nursing, and social\nsciences disciplines, while the interest among engineering and computer\nscience is a clear minority. The results of this article can be used to study\nfurther the unused potential of engineering and computer science for the\nmulti- and interdisciplinary education.","authors":["Kari-Pekka Heikkinen","Teppo Räisänen"],"meta":["June 2018Managing Global Transitions 16(2):159-172","DOI:10.26493/1854-6935.16.159-172"],"references":["297392058_Digitalisation_of_the_Economy_and_its_Impact_on_Labour_Markets","255650663_Interdisciplinary_higher_education_Implications_for_teaching_and_learning","254306219_Boundary-Crossing_Competence_Theoretical_Considerations_and_Educational_Design","324525309_A_Stakeholder_Approach_to_Strategic_Management","291191903_Towards_expert_knowledge_A_comparison_between_a_constructivist_and_a_traditional_learning_environment_in_the_University","288702027_Walking_in_another's_shoes_Epistemological_challenges_in_participatory_planning","271789990_A_Proposal_for_Building_Interdisciplinary_Bridges","270197435_The_Flight_of_the_Creative_Class_The_New_Global_Competition_for_Talent","270031732_Interdisciplinarity_in_Higher_Education_in_the_United_Kingdom","250182418_Do_You_See_What_I_See_The_Epistemology_of_Interdisciplinary_Inquiry1"]}