{"id":"329068881_Voice_Stress_Analysis_A_New_Framework_for_Voice_and_Effort_in_Human_Performance","abstract":"People rely on speech for communication, both in a personal and professional context, and often under different conditions of physical, cognitive and/or emotional load. Since vocalization is entirely integrated within both our central (CNS) and autonomic nervous system (ANS), a mounting number of studies have examined the relationship between voice output and the impact of stress. In the current paper, we will outline the different stages of voice output, i.e., breathing, phonation and resonance in relation to a neurovisceral integrated perspective on stress and human performance. In reviewing the function of these three stages of voice output, we will give an overview of the voice parameters encountered in studies on voice stress analysis (VSA) and review the impact of the different types of physiological, cognitive and/or emotional load. In the section “Discussion,” with regard to physical load, a competition for ventilation processes required to speak and those to meet metabolic demand of exercised muscles is described. With regard to cognitive and emotional load, we will present the “Model for Voice and Effort” (MoVE) that comprises the integration of ongoing top-down and bottom-up activity under different types of load and combined patterns of voice output. In the MoVE, it is proposed that the fundamental frequency (F0) values as well as jitter give insight in bottom-up/arousal activity and the effort a subject is capable to generate but that its range and variance are related to ongoing top-down processes and the amount of control a subject can maintain. Within the MoVE, a key-role is given to the anterior cingulate cortex (ACC) which is known to be involved in both the equilibration between bottom-up arousal and top-down regulation and vocal activity. Moreover, the connectivity between the ACC and the nervus vagus (NV) is underlined as an indication of the importance of respiration. Since respiration is the driving force of both stress and voice production, it is hypothesized to be the missing-link in our understanding of the underlying mechanisms of the dynamic between speech and stress.","authors":["Martine Van Puyvelde","Xavier Neyt","Francis Mcglone","Nathalie Pattyn"],"meta":["November 2018Frontiers in Psychology 9","DOI:10.3389/fpsyg.2018.01994"],"references":["327552662_Bridging_Exercise_Science_Cognitive_Psychology_and_Medical_Practice_Is_Cognitive_Fatigue_a_Remake_of_The_Emperor's_New_Clothes","313695030_Toward_a_Theory_of_the_Dispositional_Bases_of_Functional_Dysphonia_and_Vocal_Nodules_Exploring_the_Role_of_Personality_and_Emotional_Adjustment","350441874_Foundations_of_Voice_Studies_An_Interdisciplinary_Approach_to_Voice_Production_and_Perception","339213333_Emotions_in_the_Human_Voice_Vol_I_Foundations","325675678_The_electrodermal_system","321604901_Neurobiology_of_Cingulate_Cortex_and_Limbic_Thalamus_A_Comprehensive_Handbook","317692872_Dynamic_features_of_vocal_folds_based_on_speech_production_model_for_detection_of_stressed_speech","316804757_Flow_Glottogram_and_Subglottal_Pressure_Relationship_in_Singers_and_Untrained_Voices","313617134_Emotions_and_speech_Some_acoustical_correlates","313205149_Prefrontal_cortical_amygdalar_metabolism_in_major_depression"]}