{"id":"329020777_Developing_stage-discharge_relationships_using_multivariate_empirical_mode_decomposition-based_hybrid_modeling","abstract":"This paper proposes an alternative method for modeling stage–discharge relationships by accounting significant information from different process scales employing the multivariate empirical mode decomposition (MEMD). First, the multivariate dataset comprising the discharge of current time step and appropriate lagged inputs of stage and discharge are decomposed using MEMD. Then, genetic programming (GP)-based models are developed for each sub-series to predict discharge of current time step, considering the sub-series of predictors at the corresponding timescale as inputs. Finally, the predicted sub-series are recombined to obtain the discharge of current time step. The method is applied for the prediction of the daily discharge from Pattazhy station of Kallada River in the state of Kerala, India. Statistical evaluation based on different performance criteria revealed the substantial improvement in performance of the proposed MEMD-based hybrid model over the popular nonlinear models like GP and M5 model trees. The application of the method for three more stations Ayilam, Thumpamon and Malakkara falling in different rivers in southern Kerala confirmed the robustness of the approach even in handing zero values and extreme flows in addition to the overall improvement in predictability of daily streamflow. The superiority of the proposed method is attributed to its capability in handling multiple causative inputs and capturing significant information from different timescales common to these input variables.","authors":["Adarsh Sankaran","Ajin P. John","R. N. Anagha","Abi Abraham"],"meta":["December 2018Applied Water Science 8(8)","DOI:10.1007/s13201-018-0874-8"],"references":["318682783_Multiscale_characterization_and_prediction_of_monsoon_rainfall_in_India_using_Hilbert-Huang_transform_and_time-dependent_intrinsic_correlation_analysis","301270336_Modeling_river_discharge_time_series_using_support_vector_machine_and_artificial_neural_networks","298898637_Streamflow_estimation_by_support_vector_machine_coupled_with_different_methods_of_time_series_decomposition_in_the_upper_reaches_of_Yangtze_River_China","283551606_Artificial_Intelligence_based_models_for_stream-flow_forecasting_2000-2015","281389386_Time-Frequency_Analysis_of_Nonstationary_Process_Based_on_Multivariate_Empirical_Mode_Decomposition","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","322361246_An_adaptive_middle_and_long-term_runoff_forecast_model_using_EEMD-ANN_hybrid_approach","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","286209214_Multivariate_empirical_mode_decomposition","285111988_The_empirical_mode_decomposition_and_the_Hilbert_spectrum_for_nonlinear_and_non-stationary_time_series_analysis"]}