{"id":"329038735_Revisiting_the_Metadiscursive_Aspect_of_Definitions_in_Academic_Writing","abstract":"This paper offers a critical examination of how the discourse function of definition is being used in academic writing. The main argument is that definitions do not only serve metadiscursive purposes but also ideational ones. As a form of elaboration in various discourse genres and disciplines, definitions have often been regarded as non-propositional because they help in explaining the meaning of utterances and ideas rather than in construing meaning or in building argumentation. In order to understand how definitional chunks fill both roles, that is, propositional and non-propositional ones, this paper investigates a corpus of research articles within two disciplines, Linguistics and Computer Science. Instances of definitions are classified in terms of their building units and their functions. Results indicate that definitions are neither homogeneous in their forms nor in the functions they serve in academic writing. The main conclusion is that the extent to which they serve propositional and non-propositional ends is governed, on the one hand, by functional reasons and on the second hand, by disciplinary practices.","authors":["Nesrine Triki"],"meta":["November 2018Journal of English for Academic Purposes 37","DOI:10.1016/j.jeap.2018.11.010"],"references":["285777445_Just_to_Give_You_Kind_of_a_Map_of_Where_We_Are_Going_A_Taxonomy_of_Metadiscourse_in_Spoken_and_Written_Academic_English","281959046_Revisiting_metadiscourse_Conceptual_and_methodological_issues_concerning_signalling_nouns","272930539_Academic_Writing_for_Graduate_Students_Essential_Tasks_and_Skills","249237384_Applying_a_Gloss_Exemplifying_and_Reformulating_in_Academic_Discourse","239572700_The_language_of_mathematics_making_the_invisible_visible","235768883_An_Introduction_to_Functional_Grammar","229255191_Communicative_aspects_of_definitions_in_classroom_interaction_Learning_to_define_in_class_for_first_and_second_language_learners","223035566_Contrastive_ESP_rhetoric_Metatext_in_Finnish-English_economics_texts","37715532_Understanding_the_Language_of_Science","28233645_English_for_Academic_Purposes_An_Advanced_Resource_Book"]}