{"id":"329034015_Learning_by_Teaching_with_Humanoid_Robot_A_New_Powerful_Experimental_Tool_to_Improve_Children's_Learning_Ability","abstract":"Browsing the literature shows that an increasing number of authors choose to use the learning by teaching approach in the field of educational robotics. The goal of this paper is, on the one hand, to produce a review of articles describing the effects of this approach on learning and, on the other hand, to review the literature in order to explore the characteristics at the core of this approach. We will only focus on the work using a humanoid robot. The areas of learning studied are writing, reading, vocabulary, and reasoning, but also there are some metacognitive abilities like task commitment and mental state attribution. Their targets are from very young children to preadolescents. We can already notice some studies on pupils with special educational needs. In all of these domains, the results show a nonnegligible effect of learning by teaching both on learning and on metacognitive abilities. If the concept of learning by teaching is clear, a careful investigation of the different studies shows that experimental paradigms do not use the same basic characteristics. For some, it is the robot’s weakness, the care that must be given to it, which is the main requirement for the approach, while for others it is the unbalanced distribution of knowledge which is at the heart of it. The learning by teaching approach we will study has two components: the robot and the child tutor. The characteristics of the robot and what is asked of the child to accomplish his or her task of the tutor will be analyzed.","authors":["Frank Jamet","Olivier Masson","Baptiste Jacquet","Jean-Louis Stilgenbauer"],"meta":["November 2018Journal of Robotics 2018(2)","DOI:10.1155/2018/4578762","Project: Mentor-Child & Naive-Pupil-Robot paradigm"],"references":["327046544_Social_robots_for_education_A_review","325707523_When_deictic_gestures_in_a_robot_can_harm_child-robot_collaboration","323592213_Do_Children_Perceive_Whether_a_Robotic_Peer_is_Learning_or_Not","322995069_Collaborative_learning_between_robots_and_children_with_potential_symptoms_of_a_developmental_disability","322887722_Robots_for_Learning_Inclusive_Learning","328343880_On_the_Lack_of_Pragmatic_Processing_in_Artificial_Conversational_Agents","328222129_Humanoid_Robots_in_Education_A_Short_Review","327006446_The_Gricean_Maxims_of_Quantity_and_of_Relation_in_the_Turing_Test","326964285_Team_Learning_in_Skills_Subjects_in_Intermediate_Grades","323672775_Dyadic_Stance_in_Natural_Language_Communication_with_a_Teachable_Robot"]}