{"id":"329081100_Multiple-Choice_Questions_in_Programming_Courses_Can_We_Use_Them_and_Are_Students_Motivated_by_Them","abstract":"Low performance of nontechnical engineering students in programming courses is a problem that remains unsolved. Over the years, many authors have tried to identify the multiple causes for that failure, but there is unanimity on the fact that motivation is a key factor for the acquisition of knowledge by students.\nTo better understand motivation, a new evaluation strategy has been adopted in a second programming course of a nontechnical degree, consisting of 91 students. The goals of the study were to identify if those students felt more motivated to answer multiple-choice questions in comparison to development questions, and what type of question better allows for testing student knowledge acquisition.\nPossibilities around the motivational qualities of multiple-choice questions in programming courses will be discussed in light of the results.\nIn conclusion, it seems clear that student performance varies according to the type of question. Our study points out that multiple-choice questions can be seen as a motivational factor for engineering students and it might also be a good way to test acquired programming concepts. Therefore, this type of question could be further explored in the evaluation points.","authors":["Pedro Henriques Abreu","Daniel Castro Silva","Anabela Gomes"],"meta":["November 2018ACM Transactions on Computing Education 19(1):1-16","DOI:10.1145/3243137"],"references":["312990037_Strategies_for_programming_instruction_in_high_school_Program_completion_vs_Program_generation","311491524_Developing_a_Computer_Science_Concept_Inventory_for_Introductory_Programming","309242491_Types_of_assessing_student-programming_knowledge","303058029_Teaching_Nondeterminism_Through_Programming","300918383_Teaching_Programming_Subjects_with_Emphasis_on_Programming_Paradigms","305081912_Employing_Multiple-Answer_Multiple_Choice_Questions","301793492_Measuring_the_Difficulty_of_Test_Items_in_Computing_Science_Education","301428165_Multiple-choice_vs_free-text_code-explaining_examination_questions","283649952_Evaluation_of_knowledge_in_Object_Oriented_Programming_course_with_computer_adaptive_tests","281893056_OJPOT_online_judge_practice_oriented_teaching_idea_in_programming_courses"]}