{"id":"329074044_Retinal_vascular_tortuosity_assessment_inter-intra_expert_analysis_and_correlation_with_computational_measurements","abstract":"Background: The retinal vascular tortuosity can be a potential indicator of relevant vascular and non-vascular diseases. However, the lack of a precise and standard guide for the tortuosity evaluation hinders its use for diagnostic and treatment purposes. This work aims to advance in the standardization of the retinal vascular tortuosity as a clinical biomarker with diagnostic potential, allowing, thereby, the validation of objective computational measurements on the basis of the entire spectrum of the expert knowledge.\nMethods: This paper describes a multi-expert validation process of the computational vascular tortuosity measurements of reference. A group of five experts, covering the different clinical profiles of an ophthalmological service, and a four-grade scale from non-tortuous to severe tortuosity as well as non-tortuous / tortuous and asymptomatic / symptomatic binary classifications are considered for the analysis of the the multi-expert validation procedure. The specialists rating process comprises two rounds involving all the experts and a joint round to establish consensual rates. The expert agreement is analyzed throughout the rating procedure and, then, the consensual rates\nare set as the reference to validate the prognostic performance of four computational tortuosity metrics of reference.\nResults: The Kappa indexes for the intra-rater agreement analysis were obtained between 0.35 and 0.83 whereas for the inter-rater agreement in the asymptomatic / symptomatic classification were between 0.22 and 0.76. The Area Under the Curve (AUC) for each expert against the consensual rates were placed between 0.61 and 0.83 whereas the prognostic performance of the best objective tortuosity metric was 0.80.\nConclusions: There is a high inter and intra-rater variability, especially for the case of the four grade scale. The prognostic performance of the tortuosity measurements is close to the experts’ performance, especially for Grisan measurement. However, there is a gap between the automatic effectiveness and the expert perception given the lack\nof clinical criteria in the computational measurements.","authors":["Lucía Ramos","Jorge Novo","José Rouco","Stephanie Romeo"],"meta":["November 2018BMC Medical Research Methodology 18(144):1-11","DOI:10.1186/s12874-018-0598-3"],"references":["269402532_Computer_aided_diagnosis_system_for_retinal_analysis_Automatic_assessment_of_the_vascular_tortuosity","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","318752547_Retinal_Vessel_Geometry_and_the_Incidence_and_Progression_of_Diabetic_Retinopathy","308834689_Quantifying_retinal_blood_vessels'_tortuosity_-_Review","301177859_Automatic_Analysis_of_the_Microaneurysm_Turnover_in_a_Web-Based_Framework_for_Retinal_Analysis","281595284_Semi-automatic_procedure_for_the_computation_of_the_arteriovenous_ratio_in_retinal_images","278742036_Retinal_Vessel_Tortuosity_and_Its_Relation_to_Traditional_and_Novel_Vascular_Risk_Markers_in_Persons_with_Diabetes","269765658_Arteriole_Tortuosity_Associated_with_Diabetic_Retinopathy_and_Cholesterol","261113563_Evaluation_of_SIRIUS_retinal_vessel_width_measurement_in_REVIEW_dataset","260674968_Unified_methodology_for_evaluating_vessel_tree_tortuosity_metrics_in_eye_fundus_images"]}