{"id":"329162007_Compliant_Mechanisms_Design_of_Flexure_Hinges","abstract":"Flexure hinges hold several advantages over classical rotation joints, including no friction losses, no need for lubrication, no hysteresis, compactness, capacity to be utilized in small-scale applications, ease of fabrication, virtually no assembly, and no required maintenance. Compliant Mechanisms: Design of Flexure Hinges provides practical answers to the present and future needs of efficient design, analysis, and optimization of devices that incorporate flexure hinges. With a highly original approach the text: • Discusses new and classical types of flexure hinges (single-, two- and multiple-axis) for two- and three-dimensional applications • Addresses a wide range of industrial applications, including micro- and nano-scale mechanisms • Quantifies flexibility, precision of rotation, sensitivity to parasitic loading, energy consumption, and stress limitations through closed-form compliance equations • Offers a unitary presentation of individual flexure hinges as fully-compliant members by means of closed-form compliance (spring rates) equations • Fully defines the lumped-parameter compliance, inertia and damping properties of flexure hinges • Develops a finite element approach to compliant mechanisms by giving the elemental formulation of new flexure hinge line elements • Incorporates more advanced topics dedicated to flexure hinges including large deformations, buckling, torsion, composite flexures, shape optimization and thermal effects Compliant Mechanisms: Design of Flexure Hinges provides practical answers and directions to the needs of efficiently designing, analyzing, and optimizing devices that include flexure hinges. It contains ready-to-use plots and simple equations describing several flexure types for the professional that needs quick solutions to current applications. The book also provides self-contained, easy-to-apply mathematical tools that provide sufficient guidance for real-time problem solving of further applications.","authors":["Nicolae Lobontiu"],"meta":["December 2002","DOI:10.1201/9781420040272","ISBN: 9780429121654"],"references":[]}