{"id":"329134199_Extended_Joint_Sparsity_Reconstruction_for_Spatial_and_Temporal_ERT_Imaging","abstract":"Electrical resistance tomography (ERT) is an imaging technique to recover the conductivity distribution with boundary measurements via attached electrodes. There are a wide range of applications using ERT for image reconstruction or parameter calculation due to high speed data collection, low cost, and the advantages of being non-invasive and portable. Although ERT is considered a high temporal resolution method, a temporally regularized method can greatly enhance such a temporal resolution compared to frame-by-frame reconstruction. In some of the cases, especially in the industrial applications, dynamic movement of an object is critical. In practice, it is desirable for monitoring and controlling the dynamic process. ERT can determine the spatial conductivity distribution based on previous work, and ERT potentially shows good performance in exploiting temporal information as well. Many ERT algorithms reconstruct images frame by frame, which is not optimal and would assume that the target is static during collection of each data frame, which is inconsistent with the real case. Although spatiotemporal-based algorithms can account for the temporal effect of dynamic movement and can generate better results, there is not that much work aimed at analyzing the performance in the time domain. In this paper, we discuss the performance of a novel spatiotemporal total variation (STTV) algorithm in both the spatial and temporal domain, and Temporal One-Step Tikhonov-based algorithms were also employed for comparison. The experimental results show that the STTV has a faster response time for temporal variation of the moving object. This robust time response can contribute to a much better control process which is the main aim of the new generation of process tomography systems.","authors":["Bo Chen","Juan F P J Abascal","Manuchehr Soleimani"],"meta":["November 2018Sensors 18(11):4014","DOI:10.3390/s18114014"],"references":["325400392_Electrical_Resistance_Tomography_for_Visualization_of_Moving_Objects_Using_a_Spatiotemporal_Total_Variation_Regularization_Algorithm","254257856_Sensitivity_distribution_visualizations_of_impedance_tomography_measurement_strategies","245314790_Dynamical_inversion_of_geophysical_ERT_data_State_estimation_in_the_vadose_zone","231004159_Dynamic_imaging_in_electrical_capacitance_tomography_and_electromagnetic_induction_tomography_using_a_Kalman_filter","286671975_A_fast_Kalman_filter_for_time-lapse_electrical_resistivity_tomography","277252374_A_comparison_framework_for_temporal_image_reconstructions_in_electrical_impedance_tomography","277252081_Comparison_of_total_variation_algorithms_for_electrical_impedance_tomography","258261972_Applied_Potential_Tomography","239981253_Existence_and_Uniqueness_for_Electrode_Models_for_Electric_Current_Computed_Tomography","236967359_The_effect_of_serial_data_collection_on_the_accuracy_of_electrical_impedance_tomography_images","220124333_The_Split_Bregman_Method_for_L1-Regularized_Problems","13723308_A_Kalman_filter_approach_to_track_fast_impedance_changes_in_electrical_impedance_tomography","13597370_Tikhonov_regularization_and_prior_information_in_electrical_impedance_tomography","14935198_Clinical_applications_of_electrical_impedance_tomography","6173814_Temporal_image_reconstruction_in_electrical_impedance_tomography"]}