{"id":"329157168_Mitigating_Chromatic_Dispersion_with_Hybrid_Optical_Metasurfaces","abstract":"Metasurfaces control various properties of light via scattering across a large number of subwavelength‐spaced nanostructures. Although metasurfaces appear to be ideal photonic platforms for realizing and designing miniaturized devices, their chromatic aberrations have hindered the large‐scale deployment of this technology in numerous applications. Wavelength‐dependent diffraction and resonant scattering effects usually limit their working operation wavelengths. In refractive optics, chromatic dispersion is a significant problem and is generally treated by cascading multiple lenses into achromatic doublets, triplets, and so on. Recently, broadband achromatic metalenses in the visible have been proposed to circumvent chromatic aberration but their throughput efficiency is still limited. Here, the dispersion of refractive components is corrected by leveraging the inherent dispersion of metasurfaces. Hybrid refractive‐metasurface devices, with nondispersive refraction in the visible, are experimentally demonstrated. The dispersion of this hybrid component, characterized by using a Fourier plane imaging microscopy setup, is essentially achromatic over about 150 nm in the visible. Broadband focusing with composite plano‐convex metasurface lenses is also proposed. These devices could find applications in numerous consumer optics, augmented reality components, and all applications including imaging for which monochromatic performance is not sufficient.","authors":["Rajath Sawant","Purva Bhumkar","Alexander Y. Zhu","Pei-Nan Ni"],"meta":["January 2019Advanced Materials 31(3):1805555","DOI:10.1002/adma.201805555"],"references":["327271083_Modelling_of_free-form_conformal_metasurfaces","322832487_A_broadband_achromatic_metalens_in_the_visible","322341325_Nanoscale_beam_splitters_based_on_gradient_metasurfaces","322191335_A_broadband_achromatic_metalens_for_focusing_and_imaging_in_the_visible","321845310_Differential_Wavevector_Distribution_of_Surface-Enhanced_Raman_Scattering_and_Fluorescence_in_a_Film-Coupled_Plasmonic_Nanowire_Cavity","318910494_Broadband_achromatic_optical_metasurface_devices","326608652_Metasurfaces_for_broadband_dispersion_engineering_through_custom-tailored_multi-resonances","326118973_Achromatic_Broadband_Super-Resolution_Imaging_by_Super-Oscillatory_Metasurface","323441613_A_Metalens_with_a_Near-Unity_Numerical_Aperture","321453628_Metasurface_optical_holography"]}