{"id":"329113536_PCEX_Interactive_Program_Construction_Examples_for_Learning_Programming","abstract":"A sizable body of research on instructional practices supports the use of worked examples for acquiring cognitive skills in domains such as mathematics and physics. Although examples are also important in the domain of programming, existing research on programming examples is limited. Program examples are used by instructors to achieve two important goals: to explain program behavior and to demonstrate program construction patterns. Program behavior examples are used to demonstrate the semantics of various program constructs (i.e., what is happening inside a program or an algorithm when it is executed). Program construction examples illustrate how to construct a program that achieves a specific purpose. While both functions of program examples are important for learning, most of the example-focused research in computer science education focused on technologies for augmenting program behavior examples such as program visualization, tracing tables, etc. In contrast, advanced technologies for presenting program construction examples were rarely explored. This work introduces interactive Program Construction Examples (PCEX) to begin a systematic exploration of worked-out program construction examples in the domain of computer science education. A classroom evaluation and analysis of the survey data demonstrated that the usage of PCEX examples is associated with better student's learning and performance.","authors":["Roya Hosseini","Kamil Akhuseyinoglu","Andrew Petersen","Christian D Schunn"],"meta":["November 2018","DOI:10.1145/3279720.3279726","Conference: the 18th Koli Calling International Conference","Projects: Worked Examples in Computer Science EducationInfrastructure for Computer Science Education"],"references":["325972778_Navigation_support_in_complex_open_learner_models_assessing_visual_design_alternatives","314278166_CODECAST_An_Innovative_Technology_to_Facilitate_Teaching_and_Learning_Computer_Programming_in_a_C_Language_Online_Course","301463457_Usability_and_Usage_of_Interactive_Features_in_an_Online_Ebook_for_CS_Teachers","266656951_Mastery_Grids_An_Open_Source_Social_Educational_Progress_Visualization","311489054_Subgoals_Help_Students_Solve_Parsons_Problems","309254394_Psychometric_Theory","305081969_Factors_for_Success_in_Online_CS1","292996253_Animated_Examples_as_Practice_Content_in_a_Java_Programming_Course","262394672_Codeassessor_an_interactive_web-based_tool_for_introductory_programming","262348747_Facilitating_code-writing_in_PI_classes"]}