{"id":"329153956_Wearable_sensors_for_Parkinson's_disease_which_data_are_worth_collecting_for_training_symptom_detection_models","abstract":"Machine learning algorithms that use data streams captured from soft wearable sensors have the potential to automatically detect PD symptoms and inform clinicians about the progression of disease. However, these algorithms must be trained with annotated data from clinical experts who can recognize symptoms, and collecting such data are costly. Understanding how many sensors and how much labeled data are required is key to successfully deploying these models outside of the clinic. Here we recorded movement data using 6 flexible wearable sensors in 20 individuals with PD over the course of multiple clinical assessments conducted on 1 day and repeated 2 weeks later. Participants performed 13 common tasks, such as walking or typing, and a clinician rated the severity of symptoms (bradykinesia and tremor). We then trained convolutional neural networks and statistical ensembles to detect whether a segment of movement showed signs of bradykinesia or tremor based on data from tasks performed by other individuals. Our results show that a single wearable sensor on the back of the hand is sufficient for detecting bradykinesia and tremor in the upper extremities, whereas using sensors on both sides does not improve performance. Increasing the amount of training data by adding other individuals can lead to improved performance, but repeating assessments with the same individuals—even at different medication states—does not substantially improve detection across days. Our results suggest that PD symptoms can be detected during a variety of activities and are best modeled by a dataset incorporating many individuals.","authors":["Luca Lonini","Andrew Dai","Nicholas Shawen","Tanya Simuni"],"meta":["December 2018npj Digital Medicine 1(1)","DOI:10.1038/s41746-018-0071-z"],"references":["325067670_Viewpoint_and_practical_recommendations_from_a_movement_disorder_specialist_panel_on_objective_measurement_in_the_clinical_management_of_Parkinson's_disease","319167644_Estimating_Bradykinesia_in_Parkinson's_Disease_with_a_Minimum_Number_of_Wearable_Sensors","315682294_Ensembles_of_Deep_LSTM_Learners_for_Activity_Recognition_using_Wearables","314164328_Freezing_of_gait_and_fall_detection_in_Parkinson's_disease_using_wearable_sensors_a_systematic_review","313775847_Home_detection_of_freezing_of_gait_using_Support_Vector_Machines_through_a_single_waist-worn_triaxial_accelerometer","313454263_Freezing_of_Gait_Detection_in_Parkinson's_Disease_A_Subject-Independent_Detector_Using_Anomaly_Scores","313275666_Epidemiology_of_Parkinson's_disease","324019109_Using_Smartphones_and_Machine_Learning_to_Quantify_Parkinson_Disease_Severity_The_Mobile_Parkinson_Disease_Score","322902192_The_spectrum_of_off_in_Parkinson's_disease_What_have_we_learned_over_40_years","320438480_Deep_learning_for_freezing_of_gait_detection_in_Parkinson's_disease_patients_in_their_homes_using_a_waist-worn_inertial_measurement_unit"]}