{"id":"329150218_An_Enhanced_Approach_for_the_Multiple_Vehicle_Routing_Problem_with_Heterogeneous_Vehicles_and_a_Soft_Time_Window","abstract":"The vehicle routing problem (VRP) is a challenging combinatorial optimization problem. This research focuses on the problem under which a manufacturer needs to outsource materials from other suppliers and to ship the materials back to the company. Heterogeneous vehicles are available to ship the materials, and each vehicle has a limited loading capacity and a limited travelling distance. The purpose of this research is to study a multiple vehicle routing problem (MVRP) with soft time window and heterogeneous vehicles. Two models, using mixed integer programming (MIP) and genetic algorithm (GA), are developed to solve the problem. The MIP model is first constructed to minimize the total transportation cost, which includes the assignment cost, travelling cost, and the tardiness cost, for the manufacturer. The optimal solution can present multiple vehicle routing and the loading size of each vehicle in each period. The GA is next applied to solve the problem so that a near-optimal solution can be obtained when the problem is too difficult to be solved using the MIP. A case of a food manufacturing company is used to examine the practicality of the proposed MIP model and the GA model. The results show that the MIP model can obtain the optimal solution under a short computational time when the scale of the problem is small. When the problem becomes non-deterministic polynomial hard (NP-hard), the MIP model cannot find the optimal solution. On the other hand, the GA model can obtain a near-optimal solution within a reasonable amount of computational time. This paper is related to several important topics of the Symmetry journal in the areas of mathematics and computer science theory and methods. In the area of mathematics, the theories of linear and non-linear algebraic structures and information technology are adopted. In the area of computer science, theory and methods, and metaheuristics are applied.","authors":["He-Yau Kang","Amy Lee"],"meta":["November 2018Symmetry 10(11):650","DOI:10.3390/sym10110650"],"references":["323224526_Dynamic_Vehicle_Routing_Problems_with_Enhanced_Ant_Colony_Optimization","318736031_Model_and_algorithm_for_bi-fuel_vehicle_routing_problem_to_reduce_GHG_emissions","310592004_A_genetic_algorithm_with_exact_dynamic_programming_for_the_green_vehicle_routing_scheduling_problem","319983110_An_Adaptive_Hybrid_Algorithm_for_Vehicle_Routing_Problems_with_Time_Windows","319411602_A_branch-and-cut_algorithm_for_the_Time_Window_Assignment_Vehicle_Routing_Problem","318020503_A_combined_Multistart_Random_Constructive_Heuristic_and_Set_Partitioning_based_formulation_for_the_Vehicle_Routing_Problem_with_Time_Dependent_Travel_Times","317970969_A_Simulation_Based_Restricted_Dynamic_Programming_Approach_for_the_Green_Time_Dependent_Vehicle_Routing_Problem","315320221_Heuristics_for_tactical_time_slot_management_a_periodic_vehicle_routing_problem_view_F_Hernandez_et_al","312507416_A_robust_approach_to_multiple_vehicle_location-routing_problems_with_time_windows_for_optimization_of_cross-docking_under_uncertainty","306372787_Modelling_and_solution_of_a_large-scale_vehicle_routing_problem_at_GE_appliances_lighting"]}