{"id":"329113150_Measurability_of_the_epidemic_reproduction_number_in_data-driven_contact_networks","abstract":"The basic reproduction number is one of the conceptual cornerstones of mathematical epidemiology. Its classical definition as the number of secondary cases generated by a typical infected individual in a fully susceptible population finds a clear analytical expression in homogeneous and stratified mixing models. Along with the generation time (the interval between primary and secondary cases), the reproduction number allows for the characterization of the dynamics of an epidemic. A clear-cut theoretical picture, however, is hardly found in real data. Here, we infer from highly detailed sociodemographic data two multiplex contact networks representative of a subset of the Italian and Dutch populations. We then simulate an infection transmission process on these networks accounting for the natural history of influenza and calibrated on empirical epidemiological data. We explicitly measure the reproduction number and generation time, recording all individual-level transmission events. We find that the classical concept of the basic reproduction number is untenable in realistic populations, and it does not provide any conceptual understanding of the epidemic evolution. This departure from the classical theoretical picture is not due to behavioral changes and other exogenous epidemiological determinants. Rather, it can be simply explained by the (clustered) contact structure of the population. Finally, we provide evidence that methodologies aimed at estimating the instantaneous reproduction number can operationally be used to characterize the correct epidemic dynamics from incidence data.","authors":["Quan-Hui Liu","Marco Ajelli","Alberto Aleta","Stefano Merler"],"meta":["November 2018Proceedings of the National Academy of Sciences 115(50):201811115","DOI:10.1073/pnas.1811115115"],"references":["325530657_The_2017_plague_outbreak_in_Madagascar_Data_descriptions_and_epidemic_modelling","320975329_Characterizing_the_reproduction_number_of_epidemics_with_early_subexponential_growth_dynamics","319308562_The_RAPIDD_Ebola_Forecasting_Challenge_Synthesis_and_Lessons_Learnt","307903489_Spatiotemporal_dynamics_of_the_Ebola_epidemic_in_Guinea_and_implications_for_vaccination_and_disease_elimination_A_computational_modeling_analysis","305623417_Results_from_the_centers_for_disease_control_and_prevention's_predict_the_2013-2014_Influenza_Season_Challenge","291422014_Model-Based_Comprehensive_Analysis_of_School_Closure_Policies_for_Mitigating_Influenza_Epidemics_and_Pandemics","286134728_A_generalized-growth_model_to_characterize_the_early_ascending_phase_of_infectious_disease_outbreaks","345128466_Multiplex_Networks_Basic_Formalism_and_Structural_Properties","313290593_Estimating_contact_patterns_relevant_to_the_spread_of_infectious_diseases_in_Russia","311899572_Epidemic_processes_in_complex_networks"]}