{"id":"329108263_Analise_da_complexidade_de_itens_do_ENADE_a_luz_da_Taxonomia_de_Bloom_Revisada_contributos_ao_ensino_de_Fisica","abstract":"A avaliação do Ensino Superior no Brasil é realizada pelo Sistema Nacional de Educação Superior (SINAES), que tem como um de seus indicadores o Exame Nacional de Desempenho dos Estudantes (ENADE). Neste trabalho foram analisados 120 (cento e vinte) itens objetivos e discursivos das provas ENADE para a Licenciatura em Física, nas edições de 2005, 2008, 2011 e 2014, buscando estudar a sua complexidade pela Taxonomia de Bloom Revisada (TBR). A TBR apresenta uma proposta de classificação bidimensional cruzando uma dimensão do conhecimento, isto é, “o que” o estudante deve saber para resolver a tarefa proposta, com os processos cognitivos envolvidos na resolução da tarefa proposta, refletindo “como” o problema é resolvido. Para a TBR o conhecimento pode ser compreendido nas dimensões: efetivo, conceitual, procedural e metacognitivo, que tratam, respectivamente, de conhecimentos básicos de terminologia, conhecimentos de conceitos, conhecimentos de metodologia procedimental e conhecimentos reflexivos e analíticos sobre a escolha para resolver a tarefa. Os processos cognitivos, apresentados por verbos na TBR, classificam quais habilidades o estudante requer para resolver a tarefa: lembrar, entender, aplicar, analisar, avaliar e criar. Para discriminar as capacidades requeridas nos itens discursivos, foram observados os padrões de respostas divulgados pelo MEC e, nos itens de múltipla escolha, a nossa resolução das questões. Em seguida, os itens foram alocados na tabela bidimensional proposta pela TBR, a qual nos fornece um panorama de cada prova. Observa-se na dimensão do conhecimento que apenas 17 (14%) dos itens avaliados nas quatro edições do exame estão no domínio do conhecimento efetivo, enquanto que 103 (86%) dos itens requerem os domínios do conhecimento conceitual e procedural (procedimental), os quais exigem níveis de maior complexidade. Entende-se tal resultado como compatível com o papel estratégico do ENADE como indicador balizador da qualidade do Ensino Superior Brasileiro. Pretende-se ampliar a atualização de docentes de Física do ensino superior acerca do Exame, possibilitando-lhes refletir sobre os aspectos da cognição envolvidos no ENADE, na perspectiva proposta pela TBR, incorporando seus pressupostos em sua práxis.","authors":["João Paulo de Castro Costa","Maria Ines Martins"],"meta":["December 2017Caderno Brasileiro de Ensino de Física 34(3):697-724","DOI:10.5007/2175-7941.2017v34n3p697"],"references":["317527797_Propriedades_psicometricas_das_provas_de_pedagogia_do_Enade_via_TRI","279163828_Possiveis_influencias_do_novo_Enem_nos_curriculos_educacionais_de_quimica","275952445_O_perfil_do_contador_e_os_niveis_de_habilidades_cognitivas_nos_exames_Enade_e_suficiencia_do_CFC_uma_analise_sob_a_perspectiva_da_taxonomia_de_Bloom","274786642_Avaliando_conhecimento_em_DST_de_graduandos_em_medicina_segundo_a_taxonomia_de_bloom","250984421_Taxonomia_de_Bloom_revisao_teorica_e_apresentacao_das_adequacoes_do_instrumento_para_definicao_de_objetivos_instrucionais","242757940_A_RELACAO_ENTRE_TEORIA_E_PRATICA_DOCENTE_E_AS_QUESTOES_DE_FISICA_DO_ENADE_UMA_REFLEXAO_A_PARTIR_DAS_DIRETRIZES_CURRICULARES_NACIONAIS_PARA_A_FORMACAO_DOS_PROFESSORES_DA_EDUCACAO_BASICA","343204436_AVALIACAO_DE_HABILIDADES_E_COMPETENCIAS_EM_CUSTOS_NO_EXAME_DE_SUFICIENCIA","307614638_As_posicoes-sujeito_Estado_e_gestores_diante_das_avaliacoes_em_larga_escala_no_Ensino_Superior_brasileiro","307610390_Politicas_de_avaliacao_em_larga_escala_o_ENADE_interfere_na_gestao_dos_cursos"]}