{"id":"329146139_Survey_on_IoV_routing_protocols_Security_and_network_architecture","abstract":"As today, vehicles are equipped with wireless sensors and on‐board computers capable of collecting and processing a large amount of data; they can communicate to each other via different communication types and through different relay nodes. Internet of Vehicles (IoV) routing protocols are deployed to monitor these communications with various strategies to achieve a high availability of communication. In this paper, we propose to extend an existing taxonomy representing the necessary criteria to build IoV routing algorithms, by adding two new important criteria: security aspect and network architecture. Enhanced vehicular routing protocols with different security mechanisms have been studied, compared, and classified with respect to the authentication, the integrity, the confidentiality, the nonrepudiation, and the availability of data and communications. Routing protocols using the software‐defined networking (SDN) paradigm have also been reviewed in order to compare with those with traditional network architectures. Three types of SDN routing protocols, namely, centralized, decentralized, and hybrid control planes, have been analyzed. This survey will be useful for the choice of IoV routing protocols that take into account the flexibility, the scalability, and the intelligence of vehicular networks, as well as the security mechanisms against cyberattacks while being cost aware.","authors":["Lylia Alouache","Nga Nguyen","Makhlouf Aliouat","Rachid Chelouah"],"meta":["January 2019International Journal of Communication Systems 32(4)","DOI:10.1002/dac.3849","Project: IoV & VANETs"],"references":["325171206_Toward_a_Hybrid_SDN_Architecture_for_V2V_Communication_in_IoV_Environment","324742446_State_of_the_Art_Routing_Protocols_in_VANETs_A_Review","322190614_Internet_of_vehicles_in_big_data_era","328263033_New_Robust_Protocol_for_IoV_Communications_Technology_Use_Ethics","326965126_A_Privacy-Preserving_Message_Forwarding_Framework_for_Opportunistic_Cloud_of_Things","324726936_A_trust_based_secure_communication_for_software_defined_VANETs","324650090_A_survey_on_Intrusion_Detection_Systems_and_Honeypot_based_proactive_security_mechanisms_in_VANETs_and_VANET_Cloud","323966328_Routing_in_Heterogeneous_Vehicular_Networks_using_an_adapted_Software_Defined_Networking_approach","323563336_SDCoR_Software_Defined_Cognitive_Routing_for_Internet_of_Vehicles","322994322_Hybrid_fuzzy_multi-criteria_decision_making_based_multi_cluster_head_dolphin_swarm_optimized_IDS_for_VANET"]}