{"id":"329159559_Section-Based_Focus_Time_Estimation_of_News_Articles","abstract":"Information Retrieval (IR) systems embed temporal information for retrieving the news documents related to temporal queries. One of the important aspects of a news document is the focus time, a time to which the content of document refers. The contemporary state-of-the-art does not exploit focus time to retrieve relevant news document. This paper investigates the inverted pyramid news paradigm to determine the focus time of news documents by extracting temporal expressions, normalizing their value and assigning them a score on the basis of their position in the text. In this method, the news documents are first divided into three sections following the inverted pyramid news paradigm. This paper presents a comprehensive analysis of four methods for splitting news document into sections: the Paragraph based Method (PBM), the Words Based Method (WBM), the Sentence Based Method (SBM), and the Semantic Based Method (SeBM). Temporal expressions in each section are assigned weights using a linear regression model. Finally, a scoring function is used to calculate a temporal score for each time expression appearing in the document. These temporal expressions are then ranked on the basis of their temporal score, where the most suitable expression appears on top. The effectiveness of proposed method is evaluated on a diverse dataset of news related to popular events; the results revealed that the proposed splitting methods achieved an average error of less than 5.6 years, whereas the SeBM achieved a high precision score of 0.35 and 0.77 at positions 1 and 2 respectively.","authors":["Shafiq Ur Rehman Khan","Arshad Islam","Muhammad Aleem","Muhammad Azhar Iqbal"],"meta":["November 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2882988"],"references":["329335036_Temporal_specificity-based_text_classification_for_information_retrieval","317049840_Algorithms_for_Big_Data_in_Advanced_Communication_Systems_and_Cloud_Computing","316501626_Semantically_Enhanced_Medical_Information_Retrieval_System_A_Tensor_Factorization_Based_Approach","301445796_A_Baseline_Temporal_Tagger_for_all_Languages","301404573_Mining_temporal_footprints_from_Wikipedia","297713912_Visualizing_structural_inverted_pyramids_in_English_news_discourse_across_levels","287998154_Time_sensitive_blog_retrieval_using_temporal_properties_of_queries","318330560_Exploring_Web_Archives_Through_Temporal_Anchor_Texts","311488290_Terms_in_Time_and_Times_in_Context_A_Graph-based_Term-Time_Ranking_Model","303406769_Temporal_patterns_of_scientific_information-seeking_on_Google_and_Wikipedia"]}