{"id":"329191637_A_Review_of_Learning_Planning_Action_Models","abstract":"Automated planning has been a continuous field of study since the 1960s, since the notion of accomplishing a task using an ordered set of actions resonates with almost every known activity domain. However, as we move from toy domains closer to the complex real world, these actions become increasingly difficult to codify. The reasons range from intense laborious effort, to intricacies so barely identifiable, that programming them is a challenge that presents itself much later in the process. In such domains, planners now leverage recent advancements in machine learning to learn action models, that is, blueprints of all the actions whose execution effectuates transitions in the system. This learning provides an opportunity for the evolution of the model toward a version more consistent and adapted to its environment, augmenting the probability of success of the plans. It is also a conscious effort to decrease laborious manual coding and increase quality. This paper presents a survey of the machine learning techniques applied for learning planning action models. It first describes the characteristics of learning systems. It then details the learning techniques that have been used in the literature during the past decades, and finally presents some open issues.","authors":["Ankuj Arora","Humbert Fiorino","Damien Pellier","Marc Métivier"],"meta":["November 2018The Knowledge Engineering Review 33","DOI:10.1017/S0269888918000188","Project: Learning planning domains"],"references":["317164570_Efficient_Safe_and_Probably_Approximately_Complete_Learning_of_Action_Models","311101865_Knowledge_engineering_tools_in_planning_State-of-the-art_and_future_challenges","298410822_Learning_Relational_Dynamics_of_Stochastic_Domains_for_Planning","351073556_A_Risk-Based_Framework_for_Incorporating_Navigation_Uncertainty_Into_Exploration_Strategies","344939366_Chapter_13_Time_for_Planning","319393723_Fast_algorithms_for_mining_association_rules","318829947_Efficient_Safe_and_Probably_Approximately_Complete_Learning_of_Action_Models","306119821_Opportunistic_Planning_for_Increased_Plan_Utility","306119743_Strategic_Planning_for_Autonomous_Systems_over_Long_Horizons","292449851_Learning_action_representations_using_kernel_perceptrons"]}