{"id":"329191085_Low-Power_Wide_Area_Network_Technologies_for_Internet-of-Things_A_Comparative_Review_IEEE_Internet_of_Things_Journal","abstract":"The rapid growth of Internet-of-Things (IoT) in the current decade has led to the development of a multitude of new access technologies targeted at low power, wide area networks (LP-WANs). However, this has also created another challenge pertaining to technology selection.\nThis paper reviews the performance of LP-WAN technologies for IoT, including design choices and their implications. We consider Sigfox, LoRaWAN, WavIoT, random phase multiple access (RPMA), narrow band IoT (NB-IoT) as well as LTE-M and assess their performance in terms of signal propagation, coverage and energy conservation. The comparative analyses are based on available data sheets and simulation results. A sensitivity analysis is also conducted to evaluate network performance in response to variations in system design parameters. Results show that each of RPMA,\nNB-IoT and LTE-M incurs at least 9 dB additional path loss relative to Sigfox and LoRaWAN. This study further reveals that with a 10% improvement in receiver sensitivity, NB-IoT 882 MHz and LoRaWAN can increase coverage by up to 398% and 142% respectively, without adverse effects on the energy requirements. Finally, extreme weather conditions can significantly reduce the active network life of LP-WANs. In particular, the results indicate that operating an IoT device\nin a temperature of -20 degree Celcius can shorten its life by about half; 53% (WavIoT, LoRaWAN, Sigfox, NB-IoT, RPMA) and 48% in LTE-M compared with environmental temperature of 40 degree Celcius.","authors":["Augustine Ikpehai","Bamidele Adebisi","Khaled M. Rabie","Kelvin Anoh"],"meta":["November 2018IEEE Internet of Things Journal","DOI:10.1109/JIOT.2018.2883728"],"references":["328578593_Effects_of_Traffic_Characteristics_on_Energy_Consumption_of_IoT_End_Devices_in_Smart_City","323855138_MAC_layer-based_evaluation_of_IoT_technologies_LoRa_SigFox_and_NB-IoT","322018958_A_comparative_study_of_LPWAN_technologies_for_large-scale_IoT_deployment","321513584_A_Survey_on_5G_Networks_for_the_Internet_of_Things_Communication_Technologies_and_Challenges","326645036_An_Outdoor_Localization_System_Based_on_SigFox","324960344_Offloading_in_fog_computing_for_IoT_Review_enabling_technologies_and_research_opportunities","324464515_Experimental_assessment_of_battery_lifetime_for_commercial_off-the-shelf_NB-IoT_module","324098255_Analysis_and_assessment_of_LoRaWAN","323527193_Long-range_wireless_technologies_for_IoT_applications_A_review","323137587_Addressing_Deep_Indoor_Coverage_in_Narrowband-5G"]}