{"id":"329111400_A_Noise-Resilient_Online_Learning_Algorithm_for_Scene_Classification","abstract":"The proliferation of remote sensing imagery motivates a surge of research interest in image processing such as feature extraction and scene recognition, etc. Among them, scene recognition (classification) is a typical learning task that focuses on exploiting annotated images to infer the category of an unlabeled image. Existing scene classification algorithms predominantly focus on static data and are designed to learn discriminant information from clean data. They, however, suffer from two major shortcomings, i.e., the noisy label may negatively affect the learning procedure and learning from scratch may lead to a huge computational burden. Thus, they are not able to handle large-scale remote sensing images, in terms of both recognition accuracy and computational cost. To address this problem, in the paper, we propose a noise-resilient online classification algorithm, which is scalable and robust to noisy labels. Specifically, ramp loss is employed as loss function to alleviate the negative affect of noisy labels, and we iteratively optimize the decision function in Reproducing Kernel Hilbert Space under the framework of Online Gradient Descent (OGD). Experiments on both synthetic and real-world data sets demonstrate that the proposed noise-resilient online classification algorithm is more robust and sparser than state-of-the-art online classification algorithms.","authors":["Ling Jian","Fuhao Gao","Peng Ren","Yunquan Song"],"meta":["November 2018Remote Sensing 10(11):1836","DOI:10.3390/rs10111836"],"references":["326575290_Dense_Connectivity_Based_Two-Stream_Deep_Feature_Fusion_Framework_for_Aerial_Scene_Classification","325577767_Region-Wise_Deep_Feature_Representation_for_Remote_Sensing_Images","324794465_Integration_of_Remote_Sensing_and_GIS_Techniques_for_Flood_Monitoring_and_Damage_Assessment_A_Case_Study_of_Naogaon_District_Bangladesh","347495711_Learning_Generative_Visual_Models_from_Few_Training_Examples_An_Incremental_Bayesian_Approach_Tested_on_101_Object_Categories","329218052_Urban_Remote_Sensing","327786695_Hypergraph_p-Laplacian_Regularization_for_Remotely_Sensed_Image_Recognition","327459374_Scene_Classification_With_Recurrent_Attention_of_VHR_Remote_Sensing_Images","327255287_Locality_and_Structure_Regularized_Low_Rank_Representation_for_Hyperspectral_Image_Classification","327170914_Laplace_error_penalty-based_M-type_model_detection_for_a_class_of_high_dimensional_semiparametric_models","322739718_Development_technology_of_principle_prototype_of_high-resolution_quantum_remote_sensing_imaging"]}