{"id":"329116204_Summarizing_Semantic_Graphs_A_Survey","abstract":"The explosion in the amount of the available RDF data has lead to the need to explore, query and understand such data sources. Due to the complex structure of RDF graphs and their heterogeneity, the exploration and understanding tasks are significantly harder than in relational databases, where the schema can serve as a first step toward understanding the structure. Summarization has been applied to RDF data to facilitate these tasks. Its purpose is to extract concise and meaningful information from RDF knowledge bases, representing their content as faithfully as possible. There is no single concept of RDF summary, and not a single but many approaches to build such summaries; each is better suited for some uses, and each presents specific challenges with respect to its construction. This survey is the first to provide a comprehensive survey of summarization method for semantic RDF graphs. We propose a taxonomy of existing works in this area, including also some closely related works developed prior to the adoption of RDF in the data management community; we present the concepts at the core of each approach and outline their main technical aspects and implementation. We hope the survey will help readers understand this scientifically rich area and identify the most pertinent summarization method for a variety of usage scenarios.","authors":["Šejla Čebirić","François Goasdoué","Haridimos Kondylakis","Dimitris Kotzinos"],"meta":["June 2019The VLDB Journal 28(1)","DOI:10.1007/s00778-018-0528-3","Project: LOD graph summarization"],"references":["330441009_RDFDigest_A_Summary-driven_System_for_KBs_Exploration","327706683_Exploring_RDFS_KBs_Using_Summaries_17th_International_Semantic_Web_Conference_Monterey_CA_USA_October_8-12_2018_Proceedings_Part_I","325032828_Quality_Metrics_For_RDF_Graph_Summarization","322329030_A_Comprehensive_Survey_of_Ontology_Summarization_Measures_and_Methods","319600468_Summarizing_static_and_dynamic_big_graphs","317178121_Exploring_Importance_Measures_for_Summarizing_RDFS_KBs","326028431_Graph_Summarization_Methods_and_Applications_A_Survey","324512132_Estimating_the_Cardinality_of_Conjunctive_Queries_over_RDF_Data_Using_Graph_Summarisation","322721516_The_NPD_Benchmark_Reality_Check_for_OBDA_Systems","316267109_Large-Scale_bisimulation_of_RDF_graphs"]}