{"id":"329224062_Solving_Incremental_Optimization_Problems_via_Cooperative_Coevolution","abstract":"Engineering designs can involve multiple stages, where at each stage, the design models are incrementally modified and optimized. In contrast to traditional dynamic optimization problems where the changes are caused by some objective factors, the changes in such incremental optimization problems are usually caused by the modifications made by the decision makers during the design process. While existing work in the literature is mainly focused on traditional dynamic optimization, little research has been dedicated to solving such incremental optimization problems. In this work, we study how to adopt cooperative coevolution to efficiently solve a specific type of incremental optimization problems, namely, those with increasing decision variables. First, we present a benchmark function generator on the basis of some basic formulations of incremental optimization problems with increasing decision variables and exploitable modular structure. Then, we propose a contribution based cooperative coevolutionary framework coupled with an incremental grouping method for dealing with them. On one hand, the benchmark function generator is capable of generating various benchmark functions with various characteristics. On the other hand, the proposed framework is promising in solving such problems in terms of both optimization accuracy and computational efficiency. In addition, the proposed method is further assessed using a real-world application, i.e., the design optimization of a stepped cantilever beam.","authors":["Ran Cheng","Mohammmad Nabi Omidvar","Amir H Gandomi","Bernhard Sendhoff"],"meta":["November 2018IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99):1-1","DOI:10.1109/TEVC.2018.2883599"],"references":["318359849_Gray-box_optimization_and_factorized_distribution_algorithms_where_two_worlds_collide","315696312_Experience-based_Optimization_A_Coevolutionary_Approach","311896837_Incremental_cooperative_coevolution_for_large-scale_global_optimization","311697788_Efficient_Resource_Allocation_in_Cooperative_Co-Evolution_for_Large-Scale_Global_Optimization","284178898_A_Competitive_Divide-and-Conquer_Algorithm_for_Unconstrained_Large_Scale_Black-Box_Optimization","279952972_Effective_decomposition_of_large-scale_separable_continuous_functions_for_cooperative_co-evolutionary_algorithms","316466354_DG2_A_Faster_and_More_Accurate_Differential_Grouping_for_Large-Scale_Black-Box_Optimization","309967630_Learning_anticipation_and_time-deception_in_evolutionary_online_dynamic_optimization","301686117_Gray_box_optimization_for_Mk_landscapes_NK_landscapes_and_MAX-kSAT","285771282_Benchmark_Generator_for_the_IEEE_WCCI-2012_Competition_on_Evolutionary_Computation_for_Dynamic_Optimization_Problems"]}