{"id":"329269682_Geostatistical_analysis_of_white_matter_lesions_in_MS_identifies_gender_differences_in_lesion_evolution","abstract":"Multiple sclerosis (MS) is a chronic inflammatory demyelinating disease of the central nervous system with presumed autoimmune origin. The development of lesions within the grey and white matter, which are highly variable with respect to number, total volume and spatial evolution and only show a limited correlation with clinical disability, is a hallmark of the disease. Interestingly, population-based studies indicate a distinct outcome depending on gender. Here, we studied gender-related differences in the evolution of white matter lesions in early MS by using geostatistical methods. Within a three years observation period, patients underwent standardized annual brain magnetic resonance imaging (MRI), accompanied by neurological examination. MS white matter lesions were automatically extracted and the derived binary lesion masks were subject to geostatistical analysis, yielding quantitative spatial-statistics measures on the lesion pattern geometries. Through the MS-lesion pattern discrimination plot, differences of white matter lesion pattern characteristics and evolution in male and female cohorts were disclosed: while at the individual level, both men and women show strongly varying lesion pattern evolution, at the cohort level spatial-statistics parameters are more distinct. The female cohort shows enhanced lesion pattern smoothness while the male cohort shows more complicated patterns with pronounced directional anisotropies. Regarding evolution of MS white matter lesion patterns in the three year observation period, the female cohort shows slightly increasing pattern smoothness while the male cohort is distinguished by a pronounced decrease of pattern smoothness and total lesion volume. Our results justify detailed studies on gender-related differences.","authors":["Robert Marschallinger","Mark Mühlau","Viola Pongratz","Paul Schmidt"],"meta":["November 2018Frontiers in Molecular Neuroscience 11","DOI:10.3389/fnmol.2018.00460","Project: Fingerprinting MS with Geostatistics"],"references":["323152297_Progressive_multiple_sclerosis_patients_show_substantial_lesion_activity_that_correlates_with_clinical_disease_severity_and_sex_a_retrospective_autopsy_cohort_analysis","321990229_Diagnosis_of_multiple_sclerosis_2017_revisions_of_the_McDonald_criteria","319177516_Cortical_pathology_in_MS_detected_by_the_T1T2-weighted_ratio_from_routine_MRI","292287046_A_MS-lesion_pattern_discrimination_plot_based_on_geostatistics","325231148_Conventional_and_advanced_MRI_in_multiple_sclerosis","324629554_Statistics_for_Spatial_Data","307589519_Modeling_Uncertainty_in_the_Earth_Sciences","285675605_Comparing_data_distributions","280693709_Clinical_and_Pathological_Insights_into_the_Dynamic_Nature_of_the_White_Matter_Multiple_Sclerosis_Plaque","259574840_Development_of_gray_matter_atrophy_in_relapsing-remitting_multiple_sclerosis_is_not_gender_dependent_Results_of_a_5-year_follow-up_study"]}