{"id":"329284112_Constructing_orthogonal_designs_in_powers_of_two_via_symbolic_computation_and_rewriting_techniques","abstract":"In the past few decades, design theory has grown to encompass a wide variety of research directions. It comes as no surprise that applications in coding theory and communications continue to arise, and also that designs have found applications in new areas. Computer science has provided a new source of applications of designs, and simultaneously a field of new and challenging problems in design theory. In this paper, we revisit a construction for orthogonal designs using the multiplication tables of Cayley-Dixon algebras of dimension 2ⁿ. The desired orthogonal designs can be described by a system of equations with the aid of a Gröbner basis computation. For orders greater than 16 the combinatorial explosion of the problem gives rise to equations that are unfeasible to be handled by traditional search algorithms. However, the structural properties of the designs make this problem possible to be tackled in terms of rewriting techniques, by equational unification. We establish connections between central concepts of design theory and equational unification where equivalence operations of designs point to the computation of a minimal complete set of unifiers. These connections make viable the computation of some types of orthogonal designs that have not been found before with the aforementioned algebraic modeling.","authors":["Ilias Kotsireas","Temur Kutsia","Dimitris Simos"],"meta":["March 2020Annals of Mathematics and Artificial Intelligence 88(3)","DOI:10.1007/s10472-018-9607-9"],"references":["287210472_Constructing_Orthogonal_Designs_in_Powers_of_Two_Grobner_Bases_Meet_Equational_Unification","279430309_Unification_Theory","325287775_Hadamard_matrices_orthogonal_designs_and_clifford-gastineau-hills_algebras","315384520_Division_algebras_octonions_quaternions_complex_numbers_and_the_algebraic_design_of_physics","268971320_Hadamard_Matrices_of_the_Williamson_Type","254728334_Orthogonal_Designs_of_Order_32_and_64_via_Computational_Algebra","243770673_Solving_and_Proving_in_Equational_Theories_with_Sequence_Variables_and_Flexible_Arity_Symbols","243032235_Hadamard_designs","242371333_The_Theory_of_Error_Correcting_Codes","241865271_Coding_decoding_and_combinatorics","233439574_Orthogonal_designs","238805472_Correction_to_quoteSpace-time_block_codes_from_orthogonal_designsquote","230693874_The_Design_of_Optimum_Multifactorial_Experiments","227733949_Orthogonal_designs_via_computational_algebra","220430944_A_Unification_Algorithm_for_Associative-Commutative_Functions"]}