{"id":"329242883_The_Lean_In_Collection_Women_Work_and_the_Will_to_Represent","abstract":"In February 2014, Getty Images, the largest international stock photography agency, and LeanIn. org, Facebook COO Sheryl Sandberg’s women’s empowerment foundation, announced a new partnership that aimed to change the way women are portrayed in stock photography. The “Lean In Collection” with Getty seeks to challenge visual gendered stereotypes ascribed to both sexes in the daily life of work, home, and family life in advertising imagery. While the overarching ambition of gender empowerment implicit in the mission of Lean In is a worthwhile goal, I look to the problematic relationship rooted in the partnership between Lean In’s gender empowerment initiative and the role of Getty Images in trafficking aesthetic stereotypes for profit. Using methods of visual analysis and feminist critique, I argue that the photographs idealise a concept of female empowerment that is steeped in the rationale of neoliberal economics, which narrowly circumscribes gender citizenship according to the mandates of market logic. The Lean In Collection describes gender equality not as a right of citizenship procured by the state, but as a depoliticised and individualised negotiation.","authors":["Caroline West"],"meta":["November 2018Open Cultural Studies 2(1):430-439","DOI:10.1515/culture-2018-0039"],"references":["329937573_Lean_in_-_Women_Work_and_the_Will_to_Lead","323322096_Undoing_the_Demos_Neoliberalism's_Stealth_Revolution","323322027_The_Queen_of_America_Goes_to_Washington_City_Essays_on_Sex_and_Citizenship","323321992_The_structural_transformation_of_the_public_sphere_an_inquiry_into_a_category_of_bourgeois_society","304367398_Post-postfeminism_new_feminist_visibilities_in_postfeminist_times","292845589_Authentic_The_politics_of_ambivalence_in_a_brand_culture","292047737_The_Confidence_Culture","277431859_The_Structural_Transformation_of_the_Public_Sphere_An_Inquiry_into_a_Category_of_Bourgeois_Society","276125880_Notes_on_the_Perfect_Competitive_Femininity_in_Neoliberal_Times","275504143_Facebook_Feminism_Like_It_or_Not"]}