{"id":"329272643_An_adaptive_parameterization_for_efficient_material_acquisition_and_rendering","abstract":"One of the key ingredients of any physically based rendering system is a detailed specification characterizing the interaction of light and matter of all materials present in a scene, typically via the Bidirectional Reflectance Distribution Function (BRDF). Despite their utility, access to real-world BRDF datasets remains limited: this is because measurements involve scanning a four-dimensional domain at sufficient resolution, a tedious and often infeasibly time-consuming process.\nWe propose a new parameterization that automatically adapts to the behavior of a material, warping the underlying 4D domain so that most of the volume maps to regions where the BRDF takes on non-negligible values, while irrelevant regions are strongly compressed. This adaptation only requires a brief 1D or 2D measurement of the material's retro-reflective properties. Our parameterization is unified in the sense that it combines several steps that previously required intermediate data conversions: the same mapping can simultaneously be used for BRDF acquisition, storage, and it supports efficient Monte Carlo sample generation.\nWe observe that the above desiderata are satisfied by a core operation present in modern rendering systems, which maps uniform variates to direction samples that are proportional to an analytic BRDF. Based on this insight, we define our adaptive parameterization as an invertible, retro-reflectively driven mapping between the parametric and directional domains. We are able to create noise-free renderings of existing BRDF datasets after conversion into our representation with the added benefit that the warped data is significantly more compact, requiring 16KiB and 544KiB per spectral channel for isotropic and anisotropic specimens, respectively.\nFinally, we show how to modify an existing gonio-photometer to provide the needed retro-reflection measurements. Acquisition then proceeds within a 4D space that is warped by our parameterization. We demonstrate the efficacy of this scheme by acquiring the first set of spectral BRDFs of surfaces exhibiting arbitrary roughness, including anisotropy.","authors":["Jonathan Dupuy","Wenzel Jakob"],"meta":["December 2018ACM Transactions on Graphics 37(6):1-14","DOI:10.1145/3272127.3275059","Conference: SIGGRAPH Asia 2018 Technical Papers"],"references":["345665905_Near-Infrared_Fusion_for_Photorealistic_Image_Dehazing","318610292_A_Two-Scale_Microfacet_Reflectance_Model_Combining_Reflection_and_Diffraction","318083039_A_Practical_Extension_to_Microfacet_Theory_for_the_Modeling_of_Varying_Iridescence","316998466_Scratch_iridescence_Wave-optical_rendering_of_diffractive_surface_structure","309761988_Geometrical_Considerations_and_Nomenclature_for_Reflectance","305743712_A_Non-Parametric_Factor_Microfacet_Model_for_Isotropic_BRDFs","305217674_Multiple-scattering_microfacet_BSDFs_with_the_Smith_model","303597776_BRDF_Representation_and_Acquisition","288873193_Predicting_Appearance_from_Measured_Microgeometry_of_Metal_Surfaces","283536223_On_Optimal_Minimal_BRDF_Sampling_for_Reflectance_Acquisition"]}