{"id":"329245020_Lifelong_Learning_of_Spatiotemporal_Representations_With_Dual-Memory_Recurrent_Self-Organization","abstract":"Artificial autonomous agents and robots interacting in complex environments are required to continually acquire and fine-tune knowledge over sustained periods of time. The ability to learn from continuous streams of information is referred to as lifelong learning and represents a long-standing challenge for neural network models due to catastrophic forgetting in which novel sensory experience interferes with existing representations and leads to abrupt decreases in the performance on previously acquired knowledge. Computational models of lifelong learning typically alleviate catastrophic forgetting in experimental scenarios with given datasets of static images and limited complexity, thereby differing significantly from the conditions artificial agents are exposed to. In more natural settings, sequential information may become progressively available over time and access to previous experience may be restricted. Therefore, specialized neural network mechanisms are required that adapt to novel sequential experience while preventing disruptive interference with existing representations. In this paper, we propose a dual-memory self-organizing architecture for lifelong learning scenarios. The architecture comprises two growing recurrent networks with the complementary tasks of learning object instances (episodic memory) and categories (semantic memory). Both growing networks can expand in response to novel sensory experience: the episodic memory learns fine-grained spatiotemporal representations of object instances in an unsupervised fashion while the semantic memory uses task-relevant signals to regulate structural plasticity levels and develop more compact representations from episodic experience. For the consolidation of knowledge in the absence of external sensory input, the episodic memory periodically replays trajectories of neural reactivations. We evaluate the proposed model on the CORe50 benchmark dataset for continuous object recognition, showing that we significantly outperform current methods of lifelong learning in three different incremental learning scenarios.","authors":["German I. Parisi","Jun Tani","Cornelius Weber","Stefan Wermter"],"meta":["November 2018Frontiers in Neurorobotics 12","DOI:10.3389/fnbot.2018.00078","Project: Cross-modal learning"],"references":["332235085_Continuous_learning_in_single-incremental-task_scenarios","330597827_A_Neurorobotic_Experiment_for_Crossmodal_Conflict_Resolution_in_Complex_Environments","323615303_Human_hippocampal_neurogenesis_drops_sharply_in_children_to_undetectable_levels_in_adults","323471514_A_Neurorobotic_Experiment_for_Crossmodal_Conflict_Resolution_in_Complex_Environments","323335071_Continual_Lifelong_Learning_with_Neural_Networks_A_Review","345780149_Exploring_Robotic_Minds_Actions_Symbols_and_Consciousness_as_Self-Organizing_Dynamic_Phenomena","338488196_Continual_Learning_Through_Synaptic_Intelligence","324237643_Human_Hippocampal_Neurogenesis_Persists_throughout_Aging","321374927_FearNet_Brain-Inspired_Model_for_Incremental_Learning","321067924_Learning_without_Forgetting"]}