{"id":"329210266_Wasan_Geometry_and_Division_by_Zero_Calculus","abstract":"In this paper, we will present some essential history and the logical points of the division by zero calculus. In order to see simply the results of the division by zero calculus, we will show the simple results in the typical and fundamental object triangles. Even the case of triangles, we will be able to derive new concepts and results from the division by zero property. In the second part of this paper, we will state several and typical applications to Wasan geometry. We will be able to see a great history and deep results of Wasan in the elementary geometry. Keywords. division by zero, division by zero calculus, Wasan geometry Mathematics Subject Classification (2010). 01A27, 03C99, 51M04 1. Global history on division by zero The global history of the division by zero is given by [36] in details. There, it is stated that Aristoteles (BC384-BC322) considered firstly the division by zero in the sense of physics, however, in a strict sense, Brahmagupta (598-668 ?) introduced zero and he already defined as 0/0 = 0 in Brhmasphuasiddhnta (628). However, our world history stated that his definition 0/0 = 0 is wrong over 1300 years, but, we showed that his definition is suitable. For the details, see the references and the site: http://okmr.yamatoblog.net/. In particular, we wrote the global book manuscript [40] with 211 pages. We will recall the recent articles on the division by zero. J. A. Bergstra, Y. Hirshfeld and J. V. Tucker [6] and J. A. Bergstra [7] discussed the relationship between fields and the division by zero, and the importance of the division by zero for computer science. They, however, seem that the relationship of the division by zero and field structures are abstract.","authors":["Hiroshi Okumura","S. Saitoh"],"meta":["November 2018","Projects: Wasan GeometryDivision by zero"],"references":["348281031_The_arbelos_in_Wasan_geometry_the_inscribed_semicircle_in_the_arbelos","339939041_A_generalization_of_Problem_2019-4_and_division_by_zero","338546924_A_four_circle_problem_and_division_by_zero","336999828_Remarks_on_Archimedean_circles_of_Nagata_and_Ootoba","333324368_Division_by_Zero_Calculus_and_Pompe's_Theorem","329453140_An_Analogue_to_Pappus_Chain_theorem_with_Division_by_Zero","327498437_APPLICATIONS_OF_THE_DIVISION_BY_ZERO_CALCULUS_TO_WASAN_GEOMETRY","326305488_Solution_to_2017-1_Problem_4_with_division_by_zero","325525997_Harmonic_Mean_and_Division_by_Zero","325380997_Is_It_Really_Impossible_To_Divide_By_Zero"]}