{"id":"329251365_Online_Bangla_handwritten_word_recognition","abstract":"Bangla word recognition is extremely challenging and a limited number of works has been reported on online cursive Bangla word recognition. Bangla is a complicated script and it requires rigorous investigations to implement a better recognition system. While we have sophisticated classifiers like Hidden Markov Models or BLSTM Neural Networks for recognition of complicated scripts, there has been a limited number of comparative studies about the appropriate feature sets for such scripts. In this paper, our aim is to implement an appropriate recognition system for writer-independent unconstrained Bangla online words where a modified feature set is proposed. To construct the modified feature set, we have modified the existing feature sets and included new features to improve the recognition accuracy. We have tested the performances of various existing feature sets and the proposed feature set on a single dataset for fair comparison and reported the comparative results using various lexicons up to 20,000-word lexicon. An HMM-based classifier has been used to test each feature set. Finally, a recognition system is built over the combination of existing and modified feature sets. © 2018, Faculty of Computer Science and Information Technology.","authors":["Nilanjana Bhattacharya","Partha Pratim Roy","Umapada Pal","Sanjit Kumar Setua"],"meta":["October 2018Malaysian Journal of Computer Science 31(4):300-310","DOI:10.22452/mjcs.vol31no4.4"],"references":["316108241_Real-Time_Vision-Based_Road_Sign_Recognition_Using_an_Artificial_Neural_Network","313416426_Automatic_ICD-10_multi-class_classification_of_cause_of_death_from_plaintext_autopsy_reports_through_expert-driven_feature_selection","261499607_Learning-Based_Candidate_Segmentation_Scoring_for_Real-Time_Recognition_of_Online_Overlaid_Chinese_Handwriting","313753822_Statistical_methods_for_speech_recognition","305233882_Overwriting_repetition_and_crossing-out_detection_in_online_handwritten_text","286594602_Design_of_Unsupervised_Feature_Extraction_System_for_On-line_Bangla_Handwriting_Recognition","261500198_Stroke_Segmentation_and_Recognition_from_Bangla_Online_Handwritten_Text","261147507_A_System_for_Bangla_Online_Handwritten_Text","240156067_Online_and_o_ine_handwriting_recognition_A_comprehensive_survey_PAMI","239723374_HTK-Hidden_Markov_Model_Toolkit"]}