{"id":"329248008_A_structural_transition_in_physical_networks","abstract":"In many physical networks, including neurons in the brain1,2, three-dimensional integrated circuits3 and underground hyphal networks4, the nodes and links are physical objects that cannot intersect or overlap with each other. To take this into account, non-crossing conditions can be imposed to constrain the geometry of networks, which consequently affects how they form, evolve and function. However, these constraints are not included in the theoretical frameworks that are currently used to characterize real networks5-7. Most tools for laying out networks are variants of the force-directed layout algorithm8,9-which assumes dimensionless nodes and links-and are therefore unable to reveal the geometry of densely packed physical networks. Here we develop a modelling framework that accounts for the physical sizes of nodes and links, allowing us to explore how non-crossing conditions affect the geometry of a network. For small link thicknesses, we observe a weakly interacting regime in which link crossings are avoided via local link rearrangements, without altering the overall geometry of the layout compared to the force-directed layout. Once the link thickness exceeds a threshold, a strongly interacting regime emerges in which multiple geometric quantities, such as the total link length and the link curvature, scale with the link thickness. We show that the crossover between the two regimes is driven by the non-crossing condition, which allows us to derive the transition point analytically and show that networks with large numbers of nodes will ultimately exist in the strongly interacting regime. We also find that networks in the weakly interacting regime display a solid-like response to stress, whereas in the strongly interacting regime they behave in a gel-like fashion. Networks in the weakly interacting regime are amenable to 3D printing and so can be used to visualize network geometry, and the strongly interacting regime provides insights into the scaling of the sizes of densely packed mammalian brains.","authors":["Nima Dehmamy","Soodabeh Milanlouei","Albert-László Barabási"],"meta":["November 2018Nature 563(7733)","DOI:10.1038/s41586-018-0726-6"],"references":["261327031_A_mesoscale_connectome_of_the_mouse_brain","236193595_Different_scaling_of_white_matter_volume_cortical_connectivity_and_gyrification_across_rodent_and_primate_brains","346355165_Scaling_and_Renormalization_in_Statistical_Physics","327333766_The_Spread_of_Va_Mycorrhizal_Fungal_Hyphae_in_the_Soil_Inoculum_Types_and_External_Hyphal_Architecture","316800954_Modern_Geometry_-_Methods_and_Applications","283617410_Emergence_of_Scaling_in_Random_Networks","281245500_The_spread_of_VA_mycorrhizal_fungal_hyphae_in_the_soil_inoculum_types_and_external_hyphal_architecture","280602211_From_Cosmos_to_Connectomes_The_Evolution_of_Data-Intensive_Science","265348630_Unknotting_Combinatorial_Balls","259950926_Principal_of_Condensed_Matter_Physics","224005436_The_economy_of_brain_network_organization","235489591_Lagrangian_theory_for_a_self-avoiding_random_chain","234854809_Modification_of_the_Overlap_Potential_to_Mimic_a_Linear_Site-Site_Potential","234778358_Dynamic_Processes_on_Complex_Networks","220281986_Graph_Drawing_by_Force-Directed_Placement"]}