{"id":"329240049_Returns_to_Investment_in_Higher_Education_Is_There_a_Difference_between_Distance_Learning_and_Traditional_Universities_in_the_Fields_of_Physics_Mathematics_Social_Studies_Computer_Science_and_Economic","abstract":"In this paper we extent the literature on the rate of returns to Investment in Higher Education towards studies in distance learning Universities. In particular, we explore the difference in returns between, on one hand, graduates of a distance learning university (the Hellenic Open University - HOU) and on the other hand, graduates from two traditional universities, in Greece. The data used in the analysis is collected with field research from graduates of Physics, Mathematics, Social Studies, Computer Science and Economics. Our findings show that the rate of return to investment in education for HOU graduates is about four times higher than that of the graduates of the two traditional Universities, for the first degree graduates and about double the rate for the Master’s degree graduates. From policy perspective, our results suggest that a distance learning University may not only be considered as a second chance to education for mature students, often facing time and budget restrictions, but, it may also be seen as a worthwhile investment enabling much higher private returns compared to the alternative route, i.e. following studies in traditional universities. Therefore, distance learning universities may be used by policy authorities as a vehicle to reduce income inequalities and increase social mobility.","authors":["George Myron Agiomirgianakis","Theodore P. Lianos","Nicholas Tsounis"],"meta":["December 2018Creative Education 9(16)","DOI:10.4236/ce.2018.916220","Projects: University Graduates in the Labour MarketWP7, HOU"],"references":["309571319_Does_it_pay_to_study_abroad_Evidence_from_Poland","286620726_Human_capital_and_rates_of_return","325374673_Can_Online_Delivery_Increase_Access_to_Education","324292382_Human_Capital_A_Theoretical_and_Empirical_Analysis_with_Special_Reference_to_Education","302019413_Structural_Models_of_Wage_and_Employment_Dynamics","288058912_Graduate_returns_degree_class_premia_and_higher_education_expansion_in_the_UK","287820913_Private_returns_to_education_in_Greece_A_review_of_the_empirical_literature","272720820_Investment_in_Human_Capital","272408032_Returning_from_earning_UK_graduates_returning_to_postgraduate_study_with_particular_respect_to_STEM_subjects_gender_and_ethnicity","262806919_The_impact_of_an_MBA_on_managerial_skills_and_career_advancement_The_Greek_case"]}