{"id":"329263648_Exploring_Topics_of_Interest_of_Mendeley_Users","abstract":"This paper presents a fine-grained overview of the usage behavior and topics of interest of different types of users in Mendeley. The analysis is based on 1.2 million Web of Science indexed publications published in 2012. The disciplinary differences in the reading (saving) patterns of different types of Mendeley users are identified and depicted using VOSviewer overlay visualizations. The findings show that compared to other fields, publications from Mathematics & Computer Science have the lowest coverage in Mendeley. Publications from the Social Sciences & Humanities receive on average the highest number of readers in Mendeley. The highest uptake of Mendeley is by students, but this differs across fields. Professors, students, and librarians are mainly active in the Social Sciences & Humanities, a field of science with a relatively low citation density in Web of Science. In contrast, researchers and other professionals are mainly active in fields with a relatively high citation density such as the Biomedical & Health Sciences and the Life & Earth Sciences. In addition, it seems that researchers and professionals are relatively more interested in practical, methodological, and technical oriented topics while professors and students are attracted by the more educational and theoretical oriented topics. These different usage patterns among user types possibly reflect the way in which scholarly publications are used for scientific, educational, or other professional purposes. This information could inform relevant stakeholders, such as researchers, librarians, publishers, funders, and policy makers of the scientific, educational, or professional values of publications.","authors":["Zohreh Zahedi","Nees Jan van Eck"],"meta":["November 2018Journal of Altmetrics 1(1):5","DOI:10.29024/joa.7"],"references":["326336691_Social_reference_managers_and_their_users_A_survey_of_demographics_and_ideologies","319191213_On_the_quest_for_currencies_of_science_Field_exchange_rates_for_citations_and_Mendeley_readership","287512822_Normalization_of_Mendeley_reader_counts_for_impact_assessment","277912014_The_thematic_orientation_of_publications_mentioned_on_social_media_Large-scale_disciplinary_comparison_of_social_media_metrics_with_citations","275670007_Networks_of_reader_and_country_status_An_analysis_of_Mendeley_reader_statistics","320674981_Are_Mendeley_reader_counts_useful_impact_indicators_in_all_fields","315489823_Mendeley_readership_as_a_filtering_tool_to_identify_highly_cited_publications","311500861_Does_Mendeley_provide_evidence_of_the_educational_value_of_journal_articles_Insights_from_Mendeley_student_readers","277724700_Mendeley_readership_counts_An_investigation_of_temporal_and_disciplinary_differences","276853125_Which_people_use_which_scientific_papers_An_evaluation_of_data_from_F1000_and_Mendeley"]}