{"id":"329270279_Continuous_and_orientation-preserving_correspondences_via_functional_maps","abstract":"We propose a method for efficiently computing orientation-preserving and approximately continuous correspondences between non-rigid shapes, using the functional maps framework. We first show how orientation preservation can be formulated directly in the functional (spectral) domain without using landmark or region correspondences and without relying on external symmetry information. This allows us to obtain functional maps that promote orientation preservation, even when using descriptors, that are invariant to orientation changes. We then show how higher quality, approximately continuous and bijective pointwise correspondences can be obtained from initial functional maps by introducing a novel refinement technique that aims to simultaneously improve the maps both in the spectral and spatial domains. This leads to a general pipeline for computing correspondences between shapes that results in high-quality maps, while admitting an efficient optimization scheme. We show through extensive evaluation that our approach improves upon state-of-the-art results on challenging isometric and non-isometric correspondence benchmarks according to both measures of continuity and coverage as well as producing semantically meaningful correspondences as measured by the distance to ground truth maps.","authors":["Jing Ren","Adrien Poulenard","Peter Wonka","Maks Ovsjanikov"],"meta":["December 2018ACM Transactions on Graphics 37(6):1-16","DOI:10.1145/3272127.3275040","Conference: SIGGRAPH Asia 2018 Technical Papers"],"references":["325638170_Efficient_Deformable_Shape_Correspondence_via_Kernel_Matching","320271702_A_Survey_on_Shape_Correspondence","318785369_Efficient_Deformable_Shape_Correspondence_via_Kernel_Matching","322058065_Deep_Functional_Maps_Structured_Prediction_for_Dense_Shape_Correspondence","320971351_Product_Manifold_Filter_Non-rigid_Shape_Correspondence_via_Kernel_Density_Estimation_in_the_Product_Space","320442229_Robust_Structure-Based_Shape_Correspondence","319117720_Deblurring_and_Denoising_of_Maps_between_Shapes","319115919_Adjoint_Map_Representation_for_Shape_Analysis_and_Matching","318757611_Computing_and_processing_correspondences_with_functional_maps","318612665_Spherical_orbifold_tutte_embeddings"]}