{"id":"329204199_An_efficient_heuristic_for_betweenness_estimation_and_ordering","abstract":"Centrality measures, erstwhile popular amongst the sociologists and psychologists, have seen broad and increasing applications across several disciplines of late. Amongst a plethora of application-specific definitions available in the literature to rank the vertices, closeness centrality, betweenness centrality and eigenvector centrality (page-rank) have been the widely applied ones. We are surrounded by networks where information, signal or commodities are flowing through the edges. Betweenness centrality comes as a handy tool to analyze such systems, but computation of these scores is a daunting task in large-size networks. Since computing the betweenness centrality of one node is conjectured to be same as time taken for computing the betweenness centrality of all the nodes, a fast algorithm was required that can efficiently estimate a node’s betweenness score. In this paper, we propose a heuristic that efficiently estimates the betweenness score of a given node. The algorithm incorporates a non-uniform node-sampling model which is developed based on the analysis of random Erdős-Rényi graphs. We apply the heuristic to estimate the ranking of an arbitrary k vertices, called betweenness-ordering problem, where k is much less than the total number of vertices. The proposed heuristic produces very efficient results even when runs for a linear time in the number of edges. An extensive experimental evidence is presented to demonstrate the performance of the proposed heuristic for betweenness estimation and ordering on several synthetic and real-world graphs.","authors":["Rishi Ranjan Singh","S. R. S. Iyengar","Shubham Chaudhary","Manas Agarwal"],"meta":["November 2018Social Network Analysis and Mining 8(1)","DOI:10.1007/s13278-018-0542-x"],"references":["336952483_Social_and_Economic_Networks","331307250_Social_and_Economic_Networks","275543389_Fully-Dynamic_Approximation_of_Betweenness_Centrality","300903823_Shattering_and_Compressing_Networks_for_Betweenness_Centrality","298552418_Network_analysis_-_Methodological_foundations_-_Introduction","283617410_Emergence_of_Scaling_in_Random_Networks","282484642_Efficient_algorithms_for_updating_betweenness_centrality_in_fully_dynamic_graphs","280743310_An_Efficient_Algorithm_for_Approximate_Betweenness_Centrality_Computation","280566512_Networks_An_Introduction","273771350_An_Efficient_Estimation_of_a_Node's_Betweenness","268369463_Deciding_on_the_Type_of_the_Degree_Distribution_of_a_Graph_from_Traceroute-like_Measurements","265967336_Approximating_Betweenness_Centrality_in_Large_Evolving_Networks","264920260_Networks_An_Introduction","263988955_CENTRALITY_ESTIMATION_IN_LARGE_NETWORKS","263542549_Design_for_Fault_Analysis_Using_Multi-Partite_Multi-attribute_Betweenness_Centrality_Measures"]}