{"id":"329218721_STRING_v11_protein-protein_association_networks_with_increased_coverage_supporting_functional_discovery_in_genome-wide_experimental_datasets","abstract":"Proteins and their functional interactions form the backbone of the cellular machinery. Their connectivity network needs to be considered for the full understanding of biological phenomena, but the available information on protein-protein associations is incomplete and exhibits varying levels of annotation granularity and reliability. The STRING database aims to collect, score and integrate all publicly available sources of protein-protein interaction information, and to complement these with computational predictions. Its goal is to achieve a comprehensive and objective global network, including direct (physical) as well as indirect (functional) interactions. The latest version of STRING (11.0) more than doubles the number of organisms it covers, to 5090. The most important new feature is an option to upload entire, genome-wide datasets as input, allowing users to visualize subsets as interaction networks and to perform gene-set enrichment analysis on the entire input. For the enrichment analysis, STRING implements well-known classification systems such as Gene Ontology and KEGG, but also offers additional, new classification systems based on high-throughput text-mining as well as on a hierarchical clustering of the association network itself. The STRING resource is available online at https://string-db.org/.","authors":["Damian Szklarczyk","Annika L Gable","David Lyon","Alexander Junge"],"meta":["November 2018Nucleic Acids Research 47(D1)","DOI:10.1093/nar/gky1131"],"references":["327854066_VirusesSTRING_A_virus-host_protein-protein_interaction_database","325855202_GeneMANIA_update_2018","324473820_Massive_mining_of_publicly_available_RNA-seq_data_from_human_and_mouse","324098571_TISSUES_20_an_integrative_web_resource_on_mammalian_tissue_expression","323234907_TISSUES_20_an_integrative_web_resource_on_mammalian_tissue_expression","322991344_UniProt_the_universal_protein_knowledgebase","331058184_treeClust_An_R_Package_for_Tree-Based_Clustering_Dissimilarities","324076640_Systematic_Evaluation_of_Molecular_Networks_for_Discovery_of_Disease_Genes","323650881_Structure_of_the_nuclear_exosome_captured_on_a_maturing_preribosome","323226330_Mapping_of_Protein-Protein_Interactions_Web-Based_Resources_for_Revealing_Interactomes"]}