{"id":"329219593_A_new_local_and_multidimensional_ranking_measure_to_detect_spreaders_in_social_networks","abstract":"Spreaders detection is a vital issue in complex networks because spreaders can spread information to a massive number of nodes in the network. There are many centrality measures to rank nodes based on their ability to spread information. Some local and global centrality measures including DIL, degree centrality, closeness centrality, betweenness centrality, eigenvector centrality, PageRank centrality and k-shell decomposition method are used to identify spreader nodes. However, they may have some problems such as finding inappropriate spreaders, unreliable spreader detection, higher time complexity or incompatibility with some networks. In this paper, a new local ranking measure is proposed to identify the influence of a node. The proposed method measures the spreading ability of nodes based on their important location parameters such as node degree, the degree of its neighbors, common links between a node and its neighbors and inverse cluster coefficient. The main advantage of the proposed method is to clear important hubs and low-degree bridges in an efficient manner. To test the efficiency of the proposed method, experiments are conducted on eight real and four synthetic networks. Comparisons based on Susceptible Infected Recovered and Susceptible Infected models reveal that the proposed method outperforms the compared well-known centralities.","authors":["Kamal Berahmand","Asgarali Bouyer","Negin Samadi"],"meta":["November 2019Computing 101(11)","DOI:10.1007/s00607-018-0684-8"],"references":["323524741_Effect_of_rich-club_on_diffusion_in_complex_networks","295244368_Evaluating_the_importance_of_nodes_in_complex_networks","323884200_A_new_centrality_measure_based_on_the_negative_and_positive_effects_of_clustering_coefficient_for_identifying_influential_spreaders_in_complex_networks","312970191_Scientific_collaboration_networks","309905307_Finding_spread_blockers_in_dynamic_networks","309095047_A_local_immunization_strategy_for_networks_with_overlapping_community_structure","306932429_Identifying_and_ranking_influential_spreaders_in_complex_networks_with_consideration_of_spreading_probability","304744011_Vital_nodes_identification_in_complex_networks","295244558_Selection_of_influential_spreaders_in_complex_networks_using_Pareto_Shell_decomposition","294110152_Centrality_Measures_for_Networks_with_Community_Structure"]}