{"id":"329224970_Targeting_autophagy_using_metallic_nanoparticles_a_promising_strategy_for_cancer_treatment","abstract":"Despite the extensive genetic and phenotypic variations present in the different tumors, they frequently share common metabolic alterations, such as autophagy. Autophagy is a self-degradative process in response to stresses by which damaged macromolecules and organelles are targeted by autophagic vesicles to lysosomes and then eliminated. It is known that autophagy dysfunctions can promote tumorigenesis and cancer development, but, interestingly, its overstimulation by cytotoxic drugs may also induce cell death and chemosensitivity. For this reason, the possibility to modulate autophagy may represent a valid therapeutic approach to treat different types of cancers and a variety of clinical trials, using autophagy modulators, are currently employed. On the other hand, recent progress in nanotechnology offers plenty of tools to fight cancer with innovative and efficient therapeutic agents by overcoming obstacles usually encountered with traditional drugs. Interestingly, nanomaterials can modulate autophagy and have been exploited as therapeutic agents against cancer. In this article, we summarize the most recent advances in the application of metallic nanostructures as potent modulators of autophagy process through multiple mechanisms, stressing their therapeutic implications in cancer diseases. For this reason, we believe that autophagy modulation with nanoparticle-based strategies would acquire clinical relevance in the near future, as a complementary therapy for the treatment of cancers and other diseases.","authors":["Marco Cordani","Alvaro Somoza"],"meta":["April 2019Cellular and Molecular Life Sciences 76(2011)","DOI:10.1007/s00018-018-2973-y"],"references":["327789737_Development_of_genistein-PEGylated_silica_hybrid_nanomaterials_with_enhanced_antioxidant_and_antiproliferative_properties_on_HT29_human_colon_cancer_cells","327161569_Development_of_genistein-PEGylated_silica_hybrid_nanomaterials_with_enhanced_antioxidant_and_antiproliferative_properties_on_HT29_human_colon_cancer_cells","326329384_Chiral_polymer_modified_nanoparticles_selectively_induce_autophagy_of_cancer_cells_for_tumor_ablation","330141957_Anticancer_Potential_of_Quercetin_A_Comprehensive_Review","327271794_The_toxicity_of_silica_nanoparticles_to_the_immune_system","327106977_Autophagic_response_to_cellular_exposure_to_titanium_dioxide_nanoparticles","327100947_Erratum_Autophagy_suppresses_tumor_progression_by_limiting_chromosomal_instability_Genes_and_Development_2007_21_1367-1381","326638176_Blocking_Autophagic_Flux_Enhances_Iron_Oxide_Nanoparticle_Photothermal_Therapeutic_Efficiency_in_Cancer_Treatment","326578796_Anticancer_potential_of_quercetin_A_comprehensive_review_Quercetin_as_an_anticancer_agent","325992825_Silica_nanoparticles_induce_autophagosome_accumulation_via_activation_of_the_EIF2AK3_and_ATF6_UPR_pathways_in_hepatocytes"]}