{"id":"329200330_Quantifying_the_complexity_of_black-and-white_images","abstract":"We propose a complexity measure for black-and-white (B/W) digital images, based on the detection of typical length scales in the depicted motifs. Complexity is associated with diversity in those length scales. In this sense, the proposed measure penalizes images where typical scales are limited to small lengths, of a few pixels –as in an image where gray levels are distributed at random– or to lengths similar to the image size –as when gray levels are ordered into a simple, broad pattern. We introduce a complexity index which captures the structural richness of images with a wide range of typical scales, and compare several images with each other on the basis of this index. Since the index provides an objective quantification of image complexity, it could be used as the counterpart of subjective visual complexity in experimental perception research. As an application of the complexity index, we build a “complexity map” for South-American topography, by analyzing a large B/W image that represents terrain elevation data in the continent. Results show that the complexity index is able to clearly reveal regions with intricate topographical features such as river drainage networks and fjord-like coasts. Although, for the sake of concreteness, our complexity measure is introduced for B/W images, the definition can be straightforwardly extended to any object that admits a mathematical representation as a function of one or more variables. Thus, the quantification of structural richness can be adapted to time signals and distributions of various kinds.","authors":["Damian Zanette"],"meta":["November 2018PLoS ONE 13(11):e0207879","DOI:10.1371/journal.pone.0207879"],"references":["323337430_Dense_Scale_Selection_Over_Space_Time_and_Space-Time","320846318_Predicting_perceived_visual_complexity_of_abstract_patterns_using_computational_measures_The_influence_of_mirror_symmetry_on_complexity_perception","319393405_An_Introduction_to_Kolmogorov_Complexity_and_Its_Applications","274719317_Idealized_Computational_Models_for_Auditory_Receptive_Fields","274094534_Measuring_Complexity_through_Average_Symmetry","354361612_An_Introduction_to_Complex_Systems_Society_Ecology_and_Nonlinear_Dynamics","316805467_An_Introduction_to_Kolmogorov_Complexity_and_Its_Applications","292396433_Fractals","279354845_Scale-Space_Theory_in_Computer_Vision","275292080_The_Major_Transitions_of_Evolution"]}