{"id":"329398896_Digital_writing_tools_from_the_student_perspective_Access_affordances_and_agency","abstract":"Along with digital development, new possibilities for communicating have emerged. The younger generation has adopted these new possibilities to a great extent. In order to be able to utilise the opportunities offered by digital tools when writing, access to digital tools is essential. Schools need to develop a writing education that meets students’ contemporary writing needs. In considering this, it is important to learn more about the gains and the losses in digital writing. The purpose of this study was to understand and discuss the relation between students’ digital access, students’ perceived affordances with digital writing, and student agency. The methods used were a statistical survey and qualitative interviews. Six classes from five different schools located in a municipality in the middle of Sweden were chosen as an informant group. The results indicate that the most common condition concerning students’ digital access was that students shared digital tools for writing with their families. An analysis of affordances was carried out to interpret the empirical findings from the qualitative data. Affordances that emerged were: write-ability, edit-ability, story-telling ability and accessibility. In addition, the ways in which digital access and the affordances perceived can be related to student agency were analysed. The main conclusion was that given the conditions of digital access and opportunities to practice, the affordances of digital writing can increase student agency. In turn, this suggests that writing education that focuses on student agency can contribute to equity in writing activities.","authors":["Helene Dahlström"],"meta":["March 2019Education and Information Technologies 24(3)","DOI:10.1007/s10639-018-9844-x"],"references":["322919483_Students'_voices_about_information_and_communication_technology_in_upper_secondary_schools","322708750_Revisiting_the_Pedagogy_of_Multiliteracies_Writing_Instruction_in_a_Multicultural_Context","321894941_Pros_and_Cons_Handwriting_Versus_Digital_Writing","301269936_Closing_the_gaps_-_Improving_literacy_and_mathematics_by_ict-enhanced_collaboration","338746845_Doing_Interviews","324352933_The_Ecological_Approach_to_Visual_Perception","317953471_Qualitative_Research_and_Case_Study_Applications_In_Education","313560324_Getting_research_into_the_real_world","304780482_Pen_or_keyboard_in_beginning_writing_instruction_Some_perspectives_from_embodied_cognition","301946991_Possibilities_and_challenges_for_TEL_from_a_student_perspective_through_the_uptake_and_use_of_digital_technologies_in_a_11_initiative"]}