{"id":"329324850_The_nature_of_science_identity_and_its_role_as_the_driver_of_student_choices","abstract":"Background\nA major concern in science education involves the under-representation of many groups in science and technology fields, especially by gender (Brotman and Moore, J Res Sci Teach 45:971–1002, 2008; Clark Blickenstaff, Gend Educ 17:369–386, 2006), stemming from an intersection of systemic obstacles (Cantú, Equity Excell Educ 45:472–487, 2012; Rosa and Mensah, Phys Rev Phys Educ Res 12:020113, 2016). Research on persistence of minoritized populations within science trajectories has often highlighted identity as particularly important (Archer et al., Sci Educ 94:617–639, 2010; Barton and Calabrese, Am Educ Res J 50:37–75, 2007; Barton et al., Am Educ Res J 50:37–75, 2013; Merolla and Serpe, Soc Psychol Educ 16:575–597, 2013).\n\nResults\nThis study quantitatively investigated the nature of science identity in over 1300 seventh and ninth grade students from a range of urban US public schools using survey data on science identity, choice preferences, and optional science experiences. Factor analyses validated this conceptualization of science identity as integrating perceived internal and external identity components. Regression analyses revealed the importance of this conceptualization of science identity for driving students’ choices at this crucial developmental period. Furthermore, science identity had a complex differential function in supporting students’ optional science choices by gender.\n\nConclusions\nThe novel contribution to the science identity field highlights the specific multi-component ways in which students endorse science identity in middle school and early high school. There was an important finding that science identity has a complex differential function in supporting student’s optional science choices by gender. Thus, at this age, developing a strong science identity is especially critical for girls.","authors":["Paulette Vincent-Ruz","Christian D Schunn"],"meta":["November 2018International Journal of STEM Education 5(1)","DOI:10.1186/s40594-018-0140-5"],"references":["320092427_The_Equity_Ethic_Black_and_Latinx_College_Students_Reengineering_Their_STEM_Careers_toward_Justice","309471804_Interest_and_the_Development_of_Pathways_to_Science","305786652_Educational_pathways_of_Black_women_physicists_Stories_of_experiencing_and_overcoming_obstacles_in_life","323023489_The_effects_of_school-related_and_home-related_optional_science_experiences_on_science_attitudes_and_knowledge","319261462_Greek_primary_school_students'_images_of_scientists_and_their_work_has_anything_changed","310393738_The_dimensions_and_impact_of_informal_science_learning_experiences_on_middle_schoolers'_attitudes_and_abilities_in_science","309695537_The_science_identity_and_entering_a_science_occupation","303919811_Alternative_ways_of_assessing_model_fit","290267596_Expectancies_Values_Identities_and_Self-Regulation","285196562_Opportunities"]}