{"id":"329373007_Quantum_Entanglement_in_Corpuses_of_Documents","abstract":"We show that data collected from corpuses of documents violate the Clauser-Horne-Shimony-Holt version of Bell’s inequality (CHSH inequality) and therefore indicate the presence of quantum entanglement in their structure. We obtain this result by considering two concepts and their combination and coincidence operations consisting of searches of co-occurrences of exemplars of these concepts in specific corpuses of documents. Measuring the frequencies of these co-occurrences and calculating the relative frequencies as approximate probabilities entering in the CHSH inequality, we obtain manifest violations of the latter for all considered corpuses of documents. In comparing these violations with those analogously obtained in an earlier work for the same combined concepts in psychological coincidence experiments with human participants, also violating the CHSH inequality, we identify the entanglement as being carried by the meaning connection between the two considered concepts within the combination they form. We explain the stronger violation for the corpuses of documents, as compared to the violation in the psychology experiments, as being due to the superior meaning domain of the human mind and, on the other side, to the latter reaching a broader domain of meaning and being possibly also actively influenced during the experimentation. We mention some of the issues to be analyzed in future work such as the violations of the CHSH inequality being larger than the ‘Cirel’son bound’ for all of the considered corpuses of documents.","authors":["Lester Beltran","Suzette Geriente"],"meta":["June 2019Foundations of Science 24(2)","DOI:10.1007/s10699-018-9570-2"],"references":["335200833_Quantum-Theoretic_Modeling_in_Computer_Science_A_Complex_Hilbert_Space_Model_for_Entangled_Concepts_in_Corpuses_of_Documents","323003828_The_Heart_of_an_Image_Quantum_Superposition_and_Entanglement_in_Visual_Perception","317356403_Spin_and_Wind_Directions_II_A_Bell_State_Quantum_Model","315454960_Towards_a_Quantum_World_Wide_Web","301480583_Exploration_of_Quantum_Interference_in_Document_Relevance_Judgement_Discrepancy","323130140_On_the_Einstein_Podolsky_Rosen_paradox","315740289_The_Information_Retrieval_Series","308929753_Quantum_cognition_and_Bell's_inequality_A_model_for_probabilistic_judgment_bias","288890386_On_the_Foundations_of_the_Brussels_Operational-Realistic_Approach_to_Cognition","285942923_Quantum_Models_of_Cognition_and_Decision"]}