{"id":"329331151_INFORMATION_TECHNOLOGY_IN_EDUCATIONAL_INFORMATICS_COURSE_IN_THE_CONTEXT_OF_THE_STRENGTHENING_OF_EDUCATION","abstract":"Problem and goal. The article deals with the historical aspects of teaching information technology in a school course of computer science, approaches to teaching information technology in the conditions of the fundamentalization of General education, the problems of teaching information technology to schoolchildren. The aim is to determine the possibility of development of the methodical system of information technology training in the context of the fundamentalization of education, the consideration of information technology as a content-methodical line and as a section of the General course of Informatics, the description of the stages of the organization of training in information technology students. Methodology. The scientific and methodical literature in the field of Informatics is studied, the analysis of educational programs on Informatics and methods of teaching Informatics is carried out, the analysis of school textbooks and teaching AIDS, educational and methodical support of the educational process in Informatics is made; the generalization and systematization of own experience of teaching Informatics and methods of teaching Informatics, including information technologies is made. Results. It is revealed that the training of students in information technology, the rational use of their tools to solve educational and practical problems can purposefully form the information culture of students, so necessary for life in modern society. It is proved that the process of teaching information technologies in the framework of General education course of Informatics is advisable to build, based on the principles of the fundamentalization of education (science, invariance and universality, consistency and integrity, continuity and continuity, integration, etc.), on the basis of system-activity approach. Conclusion. The results of the study allowed to conclude that it is necessary to apply the fundamental and system-activity approaches to the implementation of the content-methodical line “Information technology” and the relevant section in the General course of Informatics.","authors":["Irina Vital’evna Levchenko"],"meta":["December 2018RUDN Journal of Informatization in Education 15(3):282-293","DOI:10.22363/2312-8631-2018-15-3-282-293"],"references":[]}