{"id":"329332108_An_approach_for_automating_the_design_of_convolutional_neural_networks","abstract":"Image recognition is an independent field of the computer science nowadays. Image classification is one of its main domains, in which investigated objects can be represented by an image or a video stream. The objective of the image classification is correct assigning of objects to corresponding classes, and there exist many effective approaches for solving this problem. One of the most popular approaches is artificial neural networks, which are a method from the field of machine learning. Despite the fact that neural networks cover a wide range of machine learning problems, they are also able to solve the problem of the image classification. However, there is one more specific approach for neural networks-based images classification that applies the deep learning conception. The best-known deep learning algorithm is called the convolutional neural network (CNN). The CNN uses a principle of using the same parts of a neural network to manipulate with different local parts of an input image. As well as the standard neural network architecture, the convolutional neural network should be fine-tuned for solving a certain problem. Because of the CNN's depth and complexity, the tuning process usually is complex and needs huge computational efforts. In this study, we have proposed an approach for creating ensembles of previously trained convolutional neural networks. The approach allows to increase the performance of the image classification. The results of experiments for image classification problems are presented and discussed. The experiments show that the proposed approach is able to outperform the standard perceptron and single convolutional neural network.","authors":["Dmitry Plotnikov","Evgenii Sopov","Ilia Panfilov"],"meta":["November 2018IOP Conference Series Materials Science and Engineering 450(5):052004","DOI:10.1088/1757-899X/450/5/052004"],"references":["323141818_Hydra_An_Ensemble_of_Convolutional_Neural_Networks_for_Geospatial_Land_Classification","289917319_Deep_Neural_Networks_for_object_detection","221080312_Evaluation_of_Pooling_Operations_in_Convolutional_Architectures_for_Object_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","230675350_Receptive_Fields_of_Single_Neurons_in_the_Cat's_Striate_Cortex","216792879_Backpropagation_Applied_to_Handwritten_Zip_Code_Recognition","15829465_Neocognitron_A_self-organizing_neural_network_model_for_a_mechanism_of_pattern_recognition_unaffected_by_shift_in_position","9184022_Receptive_fields_of_single_neurons_in_the_cat's_striate_cortex"]}