{"id":"329335036_Temporal_specificity-based_text_classification_for_information_retrieval","abstract":"Time is an important aspect in temporal information retrieval (TIR), a subfield of information retrieval (IR). Web search engines like Google or Bing are common examples of IR systems. An important constituent of a search engine is news retrieval, where users present their information needs in the form of temporal queries. Users are usually interested in news documents focusing on a particular time period. Existing search engines rarely fulfill the temporal information requirements as they ignore the temporal information available in the content of news documents, also known as document focus time. Furthermore, information related to multiple time periods in a news document makes the identification of document focus time a challenging task. Therefore, it is necessary to classify news documents based on temporal specificity before it is possible to use the temporal information in the retrieval process. In this study, we formulate the temporal specificity problem as a time-based classification task by classifying news documents into three temporal classes, i.e. high temporal specificity, medium temporal specificity, and low temporal specificity. For such classification, rule-based and temporal specificity score (TSS)-based classification approaches are proposed. In the former approach, news documents are classified using a defined set of rules that are based on temporal features. The later approach classifies news documents based on a TSS score using the temporal features. The results of the proposed techniques are compared with four machine learning classification algorithms: Bayes net, support vector machine, random forest, and decision tree. The results show that the proposed rule-based classifier outperforms the four algorithms by achieving 82% accuracy, whereas TSS classification achieves 77% accuracy.","authors":["Shafiq Ur Rehman Khan","Arshad Islam","Muhammad Aleem","Muhammad Azhar Iqbal"],"meta":["November 2018Turkish Journal of Electrical Engineering and Computer Sciences 26(6):2916-2927","DOI:10.3906/elk-1711-136","Project: Identi\fcation of Temporal Speci\fcity and Focus Time Estimation in News Documents"],"references":["301404573_Mining_temporal_footprints_from_Wikipedia","270761883_Stylistic_Changes_for_Temporal_Text_Classification","270759584_Temporal_Text_Ranking_and_Automatic_Dating_of_Texts","265291779_Learning_Temporal-Dependent_Ranking_Models","262331545_Estimating_document_focus_time","314819081_Time-based_language_models","311488290_Terms_in_Time_and_Times_in_Context_A_Graph-based_Term-Time_Ranking_Model","278413991_Generic_method_for_detecting_focus_time_of_documents","262360780_Proximity_2_-aware_ranking_for_textual_temporal_and_geographic_queries","254004872_Time-aware_approaches_to_information_retrieval"]}