{"id":"329380705_Artificial_intelligence-enabled_healthcare_delivery","abstract":"In recent years, there has been massive progress in artificial intelligence (AI) with the development of deep neural networks, natural language processing, computer vision and robotics. These techniques are now actively being applied in healthcare with many of the health service activities currently being delivered by clinicians and administrators predicted to be taken over by AI in the coming years. However, there has also been exceptional hype about the abilities of AI with a mistaken notion that AI will replace human clinicians altogether. These perspectives are inaccurate, and if a balanced perspective of the limitations and promise of AI is taken, one can gauge which parts of the health system AI can be integrated to make a meaningful impact. The four main areas where AI would have the most influence would be: patient administration, clinical decision support, patient monitoring and healthcare interventions. This health system where AI plays a central role could be termed an AI-enabled or AI-augmented health system. In this article, we discuss how this system can be developed based on a realistic assessment of current AI technologies and predicted developments.","authors":["Sandeep Reddy","John Fox","Maulik P Purohit"],"meta":["December 2018Journal of the Royal Society of Medicine 112(1):014107681881551","DOI:10.1177/0141076818815510","Project: AI in medicine"],"references":["326751206_The_Practice_of_Medicine_in_the_Age_of_Information_Technology","325662153_Opportunities_and_challenges_in_developing_deep_learning_models_using_electronic_health_records_data_A_systematic_review","325408526_Groundhog_Day_for_Medical_Artificial_Intelligence","325162420_Artificial_Intelligence_for_Diabetes_Management_and_Decision_Support_Literature_Review","323823096_Chatbot-based_heathcare_service_with_a_knowledge_base_for_cloud_computing","322177050_Elements_of_Robotics","335141602_Artificial_Intelligence_Foundations_of_Computational_Agents","328525340_Making_sense_of_our_digital_medicine_Babel","325738844_Big_Data_and_AI_-_A_transformational_shift_for_government_So_what_next_for_research","323057035_Clinical_decision_support_system_for_chronic_obstructive_pulmonary_disease_using_machine_learning_techniques"]}