{"id":"329415008_A_Survey_on_using_online_database_by_faculty_members_and_graduate_students_at_Shahid_Beheshti_University","abstract":"Currtent paper study on using Shahid Beheshti's subscribed database by faculty members and graduate\nstudents of this University.This is a survey study with descriptive approach. The population of the study,\n780 faculty members and 2,300 students graduate Shahid Beheshti University who this number using\nMorgan table for sampling 330 graduate students and 260 faculty members randomly stratified the\nsamples were selected. Subscried databases Persian and Latin at the University martyr Beheshti also\nwere examined. For data gathering the questionnaire and log files were used. Current study indicated\nthat the indicators like amount of using and the degree of satisfaction of databases success rate by users\ninteract with the base in this study of middle-level users, as well as faculty members and Shahid\nBeheshti University graduate students about the need for training in the use of shared databases\npositive. The most frequent users of faculty members with expertise in computer science and academic\nrank of associate professor and graduate students with educational science, physics and chemistry and a\nmaster's degree. Current research revealed that Sciencedirect and Magiran had the most use by users.\nKeywords: Shahid Beheshti University; Graduate students; Faculty Members","authors":["Amir Reza Asnafi","Neda Dehghani","Mohsen Haji Zeinolabedini"],"meta":["December 2018Library Philosophy and Practice"],"references":["269398622_Usage_of_electronic_journals_e-journals_versus_print_journals_by_healthcare_professionals_in_H_M_Patel_Centre_for_Medical_Care_and_Education_HMPCME","267304874_Using_Data_to_Persuade_State_Your_Case_and_Prove_It","222288034_Use_of_Electronic_Journals_by_Faculty_at_Istanbul_University_Turkey_The_Results_of_a_Survey","220677117_An_evaluation_of_the_second_survey_on_electronic_databases_usage_at_Ankara_University_Digital_Library","28804485_An_Evaluation_of_Faculty_use_of_the_Digital_Library_at_Ankara_University_Turkey","291895787_End-user_acceptance_of_electronic_journals_A_case_study_from_a_major_academic_research_library","268402121_Use_of_Electronic_Information_Resources_A_Case_Study_of_Thapar_University","237062492_A_survey_of_students'_use_of_and_satisfaction_with_university_subscribed_online_resources_in_two_specialized_universities_in_a_developing_country"]}