{"id":"329422059_Towards_Adaptive_user_Interfaces_for_Mobile-Phone_in_Smart_World","abstract":"All applications are developed for context adaptation and provide communication with users through their interfaces. These applications offer new opportunities for developers as well as users by collecting context data and adapting systems behavior accordingly. Particularly, in mobile devices, these mechanisms provide usability increment tremendously. Rigid and non-adaptive interface blocks the features of context awareness. In this paper, we study methods, technologies and criteria which have been proposed specifically for adaptive interfaces. Based on these guidelines, we elaborate the intelligence of adaptivity and usage of context according to user mental model. Further, we have proposed a model to develop user context ontology (UCO) and adaptive interface ontology (AIO) to optimize the use of adaptive mobile interfaces in the context of user preferences. These ontologies organize the perceptions and thoughts of user. The philosophy of User Centered Design (UCD) is proposed to analyze the usability and validity of mobile device interfaces according to user contexts. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Muhammad Waseem Iqbal","Nadeem Ahmad","Syed Khuram Shahzad","Irum Feroz"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(11)","DOI:10.14569/IJACSA.2018.091177"],"references":["322873815_Model-based_adaptive_user_interface_based_on_context_and_user_experience_evaluation","320046236_Modeling_and_Reasoning_about_Preference-Based_Context-Aware_Agents_over_Heterogeneous_Knowledge_Sources","319445937_Usability_evaluation_of_adaptive_features_in_smartphones","306263450_How_Age_and_Gender_Affect_Smartphone_Usage","305458785_Context-Based_Mobile_User_Interface","321586732_Adaptive_Interface_for_Color-blind_People_in_Mobilephones","320464220_Smart_but_not_adapted_enough_Heuristic_evaluation_of_smartphone_launchers_with_an_adapted_interface_and_assistive_technologies_for_older_adults","303972246_Customizable_dynamic_user_interface_distribution","303399891_Ten_usability_heuristics","283204615_The_Design_of_Everyday_Things_by_Donald_Norman"]}