{"id":"329476241_Relational_Granulation_Method_based_on_Quotient_Space_Theory_for_Maximum_Flow_Problem","abstract":"Granular computing (GrC) is a problem-solving concept deeply rooted in human thinking. GrC, as a new and rapidly growing paradigm of information processing, has attracted the attention of many researchers and practitioners. GrC is related to granulation, i.e., a process of drawing a set of objects (or points) together based on their indiscernibility, similarity, proximity, or functionality. In general, two types of granulation processes exist: functional granulation and relational granulation. If the process is based entirely on the attributes of the objects, it is known as functional granulation, whereas if the granulation process is based on the relationship between objects, it is known as relational granulation. This paper proposes a novel method, called the maximum flow based on Quotient Space Theory (MF−QST), for solving the maximum flow problems based on Quotient Space Theory for relational granulation. Using the method MF−QST, substructures are first detected, and the community is described as a substructure. Next, the relational granulation criterion is discussed in detail. The substructure that satisfies the relational granulation criterion is regarded as a coarse-grained node. Subsequently, the construction of a quotient network that is coarser than the original network is described. Finally, the maximum flow algorithm is used to compute the maximum flow on the quotient network as the approximated maximum flow on the original network within a much shorter period of time. Experimental results demonstrate that the novel method MF−QST reduces the cumulative running time after simplifying the network structure with a low error rate. The size of the quotient network is significantly reduced, and the node and edge scales are reduced to 20.59% and 21.62% on average, respectively.","authors":["Shu Zhao","Xian Sun","Jie Chen","Zhen Duan"],"meta":["December 2018Information Sciences 507","DOI:10.1016/j.ins.2018.12.009"],"references":["318168871_Data-Driven_Granular_Cognitive_Computing"]}