{"id":"329464084_Iterative_Support_Detection-Based_Split_Bregman_Method_for_Wavelet_Frame-Based_Image_Inpainting","abstract":"The wavelet frame systems have been extensively studied due to their capability of sparsely approximating piece-wise smooth functions, such as images, and the corresponding wavelet frame-based image restoration models are mostly based on the penalization of the 1 norm of wavelet frame coefficients for sparsity enforcement. In this paper, we focus on the image inpainting problem based on the wavelet frame, propose a weighted sparse restoration model, and develop a corresponding efficient algorithm. The new algorithm combines the idea of iterative support detection method, first proposed by Wang and Yin for sparse signal reconstruction, and the split Bregman method for wavelet frame 1 model of image inpainting, and more important, naturally makes use of the specific multilevel structure of the wavelet frame coefficients to enhance the recovery quality. This new algorithm can be considered as the incorporation of prior structural information of the wavelet frame coefficients into the traditional 1 model. Our numerical experiments show that the proposed method is superior to the original split Bregman method for wavelet frame-based 1 norm image inpainting model as well as some typical p (0 ≤ p < 1) norm-based nonconvex algorithms such as mean doubly augmented Lagrangian method, in terms of better preservation of sharp edges, due to their failing to make use of the structure of the wavelet frame coefficients. Index Terms-Image inpainting, iterative support detection, augmented Lagrangian, split Bregman, wavelet frames, sparse optimization, nonconvex optimization.","authors":["Liangtian He","Yilun Wang"],"meta":["October 2014IEEE Transactions on Image Processing 23(12):16","Project: Image Enhancement and Image Restoration"],"references":["313529207_Augmented_Lagrangian_method_dual_methods_and_split_Bregman_iteration_for_ROF_model","282195204_Sparse_representations_and_bayesian_image_inpainting","321620115_Mathematical_Problems_in_Image_Processing_Partial_Differential_Equations_and_the_Calculus_of_Variations","313001335_De-noising_by_soft_thresholding","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","292741720_The_split_Bregman_algorithm_for_L1_regularized_problems","281266055_No_Free_Lunch_Theorems_for_Optimization","281131319_Rotationally_invariant_wavelet_shrinkage","281018137_Image_decomposition_via_the_combination_of_sparse_representations_and_a_variational_approach","279699874_Compressive_Sensing_MRI_with_wavelet_tree_sparsity"]}