{"id":"329452250_Bibliometric_and_Altmetric_Analysis_of_Three_Social_Science_Disciplines","abstract":"This article analyses scientific publications of international prestige in three social science disciplines (communication, economics, and sociology) to identify possible production patterns. Emphasis is placed on the study of impact and visibility, both through bibliometric and altmetric indicators to determine similarities and differences and to establish possible inter-variable relationships. The use of measures such as the presence in social media for the study of the visibility of documents is discussed. A total of 112,300 papers published from 2013 to 2015 in the three disciplines analyzed was retrieved from the Social Science Citation Index (SSCI). Economics accounted for the largest number and was observed to have a “stable” and consolidated output profile. Collaboration, impact, and visibility were found to be inter-related in the three fields. The proportion of papers with mentions in the social media was high (around 50%) in communication and sociology, suggesting a relationship between the object of study and the medium for disseminating the findings. Tweets were the most common type of mentions. While the correlation between academic impact (citation/doc) and mentions in blog posts and tweets was observed to be low, the percentage of papers cited (78 to 96%) and the mean number of citations per paper were greater among those with than those without mentions in the social media (especially those mentioned in Google+, MSM, videos, and Wikipedia). The proportion of open access (OA) papers with mentions in the social media was higher than the percentage of open access papers as a whole in two of the three disciplines.","authors":["Daniela De filippo","Elías Sanz Casado"],"meta":["December 2018Frontiers in Research Metrics and Analytics 3","DOI:10.3389/frma.2018.00034","Project: Open Science / Ciencia abierta, ciencia ciudadana"],"references":["324558712_Author-level_metrics_in_the_new_academic_profile_platforms_The_online_behaviour_of_the_Bibliometrics_community","324013015_Publication_patterns_in_the_social_sciences_and_humanities_evidence_from_eight_European_countries","318652743_Tweeting_about_journal_articles_Engagement_marketing_or_just_gibberish","311970909_Development_of_indicators_for_the_new_habits_of_scientific_communication_and_information_Desarrollo_de_indicadores_para_los_nuevos_habitos_de_informacion_y_comunicacion_cientifica","326538741_From_academia_to_citizenry_Study_of_the_flow_of_scientific_information_from_projects_to_scientific_journals_and_social_media_in_the_field_of_Energy_saving","325797631_Monitoring_the_Broader_Impact_of_the_Journal_Publication_Output_on_Country_Level_A_Case_Study_for_Austria","324266662_Has_hosting_on_science_direct_improved_the_visibility_of_Latin_American_scholarly_journals_A_preliminary_analysis_of_data_quality","324245396_Los_mil_y_un_reflejos_de_las_publicaciones_en_el_laberinto_de_espejos_de_las_nuevas_metricas","319642521_Applied_Evaluative_Informetrics","318185982_Wind_power_research_in_Wikipedia_Does_Wikipedia_demonstrate_direct_influence_of_research_publications_and_can_it_be_used_as_adequate_source_in_research_evaluation"]}