{"id":"329468475_Methodology_to_develop_machine_learning_algorithms_to_improve_performance_in_gastrointestinal_endoscopy","abstract":"Assisted diagnosis using artificial intelligence has been a holy grail in medical research for many years, and recent developments in computer hardware have enabled the narrower area of machine learning to equip clinicians with potentially useful tools for computer assisted diagnosis (CAD) systems. However, training and assessing a computer’s ability to diagnose like a human are complex tasks, and successful outcomes depend on various factors. We have focused our work on gastrointestinal (GI) endoscopy because it is a cornerstone for diagnosis and treatment of diseases of the GI tract. About 2.8 million luminal GI (esophageal, stomach, colorectal) cancers are detected globally every year, and although substantial technical improvements in endoscopes have been made over the last 10-15 years, a major limitation of endoscopic examinations remains operator variation. This translates into a substantial inter-observer variation in the detection and assessment of mucosal lesions, causing among other things an average polyp miss-rate of 20% in the colon and thus the subsequent development of a number of post-colonoscopy colorectal cancers. CAD systems might eliminate this variation and lead to more accurate diagnoses. In this editorial, we point out some of the current challenges in the development of efficient computer-based digital assistants. We give examples of proposed tools using various techniques, identify current challenges, and give suggestions for the development and assessment of future CAD systems.","authors":["Thomas de Lange","Pål Halvorsen","Michael Alexander Riegler"],"meta":["December 2018World Journal of Gastroenterology 24(45)","DOI:10.3748/wjg.v24.i45.5057","Project: Medico - Automatic detection of disease in the GI tract benchmark"],"references":["328410701_Development_and_validation_of_a_deep-learning_algorithm_for_the_detection_of_polyps_during_colonoscopy","326292661_Deep_Learning_and_Hand-Crafted_Feature_Based_Approaches_for_Polyp_Detection_in_Medical_Videos","327166800_Automatic_Polyp_Frame_Screening_using_Patch_based_Combined_Feature_and_Dictionary_Learning","327022255_Real-Time_Use_of_Artificial_Intelligence_in_Identification_of_Diminutive_Polyps_During_Colonoscopy_A_Prospective_Study","326334907_A_neural_network_algorithm_for_detection_of_GI_angiectasia_during_small-bowel_capsule_endoscopy","326100078_Deep_learning-based_endoscopic_image_recognition_for_detection_of_early_gastric_cancer_a_Chinese_perspective","323074064_Deep_Learning_and_Handcrafted_Feature_Based_Approaches_for_Automatic_Detection_of_Angiectasia","322509828_Application_of_artificial_intelligence_using_a_convolutional_neural_network_for_detecting_gastric_cancer_in_endoscopic_images","321959322_Classification_of_Ulcerative_Colitis_Severity_in_Colonoscopy_Videos_using_CNN","320114056_Comparison_of_hand-craft_feature_based_SVM_and_CNN_based_deep_learning_framework_for_automatic_polyp_classification"]}