{"id":"329423341_The_Role_of_user_Involvement_in_the_Success_of_Project_Scope_Management","abstract":"Greater emphasis is now being placed on User Involvement as a factor imperative to Success in Project Scope Management. Although Project Scope Management Processes have a tendency to centre on various factors pertaining to the collecting criteria, defining scope and verifying scope, controlling scope is viewed as being fundamental to the management process as a whole. Furthermore, Success in Project Scope Management in the modern-day competitive business setting is recognised as resting on efficient and effective processes applied across Project Scope Management. One essential factor in achieving success in this arena is that of User Involvement. In this regard, the point is presented that Project Scope Management and User Involvement may be implemented in such a way so as to enhance Successful Project Scope Management. A questionnaire-centred survey approach utilizing Project Scope Management Processes and User Involvement to Successful Project Scope Management, encompassing management- and strategy-level employees, totalling 295, was applied in order to establish the link, both indirect and direct, between particular elements influencing four different IT departments at the governmental level. The data gathered underwent analysis through the use of SPLS (Smart Partial Least Square). This work provides a valuable contribution for professionals in the field, both in terms of researchers and practitioners, and further highlights the different ways in which project managers can arrange and modify Project Scope Management Processes in pursuit of their efforts to enhance the mediation of Successful Project Scope Management through User Involvement. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Maha Mahdi Alkhaffaf"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(11)","DOI:10.14569/IJACSA.2018.091157","Project: article"],"references":["327565003_Risk_monitoring_through_better_knowledge-based_risk_processes","324936042_Factors_affecting_ERP_implementation_success_in_Jordanian_commercial_banks_sector","291196389_Determinants_of_the_Best_Practices_for_Successful_Project_Management","284364850_The_Use_of_Virtual_Project_Teams_for_Project_Management_in_Jordanian_Corporations","283171329_Implementation_of_Pre-defined_Potential_Scope_Reductions_in_Projects","314467575_Role_of_Project_Management_Consultancy_in_Construction_Project","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","309529355_Relationship_among_Project_Management_Processes_and_Knowledge_Repository_for_Project_Success","309254394_Psychometric_Theory","307630911_A_guide_to_project_management_body_of_knowledge_the_PMBOK_GuideR","275539061_Significance_of_Scope_in_Project_Success","273688905_How_to_Increase_the_Value_of_the_Project_Management_Maturity_Model_as_a_Business-Oriented_Framework","269700252_PROJECT_MANAGEMENT_STRATEGIC_MANAGEMENT_AND_SUSTAINABLE_DEVELOPMENT_A_REVIEW_OF_THE_LITERATURE_INTRODUCTION","268079312_A_Guide_To_Deal_With_Uncertainties_In_Software_Project_Management","281069890_Structural_equation_modeling_in_practice_A_review_and_recommended_two-step_approach"]}