{"id":"329452242_Efficient_parallel_implementation_of_reservoir_computing_systems","abstract":"Reservoir computing (RC) is a powerful machine learning methodology well suited for time-series processing. The hardware implementation of RC systems (HRC) may extend the utility of this neural approach to solve real-life problems for which software solutions are not satisfactory. Nevertheless, the implementation of massive parallel-connected reservoir networks is costly in terms of circuit area and power, mainly due to the requirement of implementing synapse multipliers that increase gate count to prohibitive values. Most HRC systems present in the literature solve this area problem by sequencializing the processes, thus loosing the expected fault-tolerance and low latency of fully parallel-connected HRCs. Therefore, the development of new methodologies to implement fully parallel HRC systems is of high interest to many computational intelligence applications requiring quick responses. In this article, we propose a compact hardware implementation for Echo-State Networks (an specific type of reservoir) that reduces the area cost by simplifying the synapses and using linear piece-wise activation functions for neurons. The proposed design is synthesized in a Field-Programmable Gate Array and evaluated for different time-series prediction tasks. Without compromising the overall accuracy, the proposed approach achieves a significant saving in terms of power and hardware when compared with recently published implementations. This technique pave the way for the low-power implementation of fully parallel reservoir networks containing thousands of neurons in a single integrated circuit.","authors":["Miquel L. Alomar","Erik Sebastian Skibinsky-Gitlin","C.F. Frasser","Vincent Canals"],"meta":["April 2020Neural Computing and Applications 32(3–4)","DOI:10.1007/s00521-018-3912-4","Project: Hardware implementation of Neural Networks (NEUROHARD)"],"references":["325885107_Reinforcement_Learning_in_a_large_scale_photonic_Recurrent_Neural_Network","324644695_Applied_Regression_Analysis","324281612_Applied_Regression_Analysis","313760442_A_heteroskedasticity_consistent_covariance_matrix_and_a_direct_test_for_heteroskedasticity","313448840_A_Stochastic_Spiking_Neural_Network_for_Virtual_Screening","312326936_NeuroSensor_A_3D_image_sensor_with_integrated_neural_accelerator","311609108_FPGA-Based_Low-Power_Speech_Recognition_with_Recurrent_Neural_Networks","309738650_Action2Activity_Recognizing_Complex_Activities_from_Sensor_Data","308732470_Real-Time_Reservoir_Computing_Network-Based_Systems_for_Detection_Tasks_on_Visual_Contents","305712802_Autonomous_bio-inspired_photonic_processor_based_on_reservoir_computing_paradigm","288932862_FPGA-Based_Stochastic_Echo_State_Networks_for_Time-Series_Forecasting","284514502_Minimum_complexity_echo_state_network","301723507_Non-linear_satellite_channel_equalization_based_on_a_low_complexity_Echo_State_Network","285987354_Applied_Regression_Analysis","284122025_From_Action_to_Activity_Sensor-Based_Activity_Recognition"]}