{"id":"329489311_GOnet_A_tool_for_interactive_Gene_Ontology_analysis","abstract":"Background\nBiological interpretation of gene/protein lists resulting from -omics experiments can be a complex task. A common approach consists of reviewing Gene Ontology (GO) annotations for entries in such lists and searching for enrichment patterns. Unfortunately, there is a gap between machine-readable output of GO software and its human-interpretable form. This gap can be bridged by allowing users to simultaneously visualize and interact with term-term and gene-term relationships.\n\nResults\nWe created the open-source GOnet web-application (available at http://tools.dice-database.org/GOnet/), which takes a list of gene or protein entries from human or mouse data and performs GO term annotation analysis (mapping of provided entries to GO subsets) or GO term enrichment analysis (scanning for GO categories overrepresented in the input list). The application is capable of producing parsable data formats and importantly, interactive visualizations of the GO analysis results. The interactive results allow exploration of genes and GO terms as a graph that depicts the natural hierarchy of the terms and retains relationships between terms and genes/proteins. As a result, GOnet provides insight into the functional interconnection of the submitted entries.\n\nConclusions\nThe application can be used for GO analysis of any biological data sources resulting in gene/protein lists. It can be helpful for experimentalists as well as computational biologists working on biological interpretation of -omics data resulting in such lists.","authors":["Mikhail Pomaznoy","Brendan Ha","Bjoern Peters"],"meta":["December 2018BMC Bioinformatics 19(1)","DOI:10.1186/s12859-018-2533-3"],"references":["326466336_GOATOOLS_A_Python_library_for_Gene_Ontology_analyses","321194620_Ensembl_2018","317163814_Expansion_of_the_Gene_Ontology_knowledgebase_and_resources","315463374_NaviGO_Interactive_tool_for_visualization_and_functional_similarity_and_coherence_analysis_with_gene_ontology","304806652_Systematic_and_integrative_analysis_of_large_gene_lists_using_DAVID_bioinformatics_resources","304190916_The_GeneCards_Suite_From_Gene_Data_Mining_to_Disease_Genome_Sequence_Analyses_The_GeneCards_Suite","328977178_Impact_of_Genetic_Polymorphisms_on_Human_Immune_Cell_Gene_Expression","324116100_Transcriptomic_Analysis_of_CD4_T_Cells_Reveals_Novel_Immune_Signatures_of_Latent_Tuberculosis","311348612_PANTHER_version_11_Expanded_annotation_data_from_Gene_Ontology_and_Reactome_pathways_and_data_analysis_tool_enhancements","304806762_Systematic_and_integrative_analysis_of_large_gene_lists_using_DAVID_bioinformatics_resources"]}