{"id":"329402636_Framework_for_Software_Code_Reviews_and_Inspections_in_a_Classroom_Environment","abstract":"Code reviews and inspections have the purpose to ensure that the code has sufficient quality to be released. It is generally seen as an economical way of finding errors, increase team productivity and sharing technical and product knowledge among team members. This approach is traditionally adopted in software development companies, but their practices may be useful in other contexts, such as in the process of learning software engineering. In this sense, this study proposes an innovative framework for conducting code reviews in a Computer Science course. The proposed framework can be applied in any object-oriented program language, and it is sufficiently concise to be applied in the classroom, namely in a 90-minute session in which all students are invited to collaborate in this process. The findings suggest that code reviews in an academic context can help students to strategically reflect about the performed work, enhance their soft skills, and increase their ability to work in groups. On the other hand, as the main challenges, the findings reveal that students typically don't have previous experience in performing inspections and it can become difficult to perform a complete inspection in a classroom session.","authors":["Fernando Almeida"],"meta":["December 2018International Journal of Modern Education and Computer Science 10(10):31-39","DOI:10.5815/ijmecs"],"references":["322416313_A_Case_Study_Software_Defect_Root_Causes","319852576_Strengths_and_Limitations_of_Qualitative_and_Quantitative_Research_Methods","308791131_A_Comparative_Study_of_Software_Inspection_Techniques_for_Quality_Perspective","308735251_Characteristics_of_Useful_Code_Reviews_An_Empirical_Study_at_Microsoft","304876962_Qualitative_Interviews_A_Methodological_Discussion_of_the_Interviewer_and_Respondent_Contexts","273695434_Evaluation_of_Code_Inspection_on_an_Outsourced_Software_Project_in_Mauritius","319898516_Investigating_the_Effectiveness_of_Peer_Code_Review_in_Distributed_Software_Development","314299323_Software_Reading_Techniques_Twenty_Techniques_for_More_Effective_Software_Review_and_Inspection","311475121_System_dynamics_model_for_simulation_of_the_software_inspection_process","269417652_Optimization_of_Software_Quality_Using_Management_and_Technical_Review_Techniques"]}