{"id":"329419024_Data_Flows_Management_and_Control_in_Computer_Networks","abstract":"In computer networks, loss of data packets is inevitable, because of the buffer memory overflow of at least one of the nodes located on the path from the source to the receiver, including the latter. Such losses associated with overflows are hereinafter referred to as congestion of network nodes. There are many ways to prevent and eliminate overloads; these methods, in the majority, are based on the management of data flows. A special place is taken by the maintenance of packages, taking into account their priorities. The ideas of these solutions are quite simple for their implementation in the development of appropriate software and hardware for telecommunication devices. The article considers a number of original solutions to these problems at a level sufficient for the development of new generations of telecommunication devices and systems such as allowing interrupting transmission of the low-priority packet practically at any stage, then to transmit a high-priority packet and only then resume the interrupted transfer, moreover warning in time the data source about the threat of overloading one or several nodes along the route in the propagation of data packets. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Ahmad A. Al Rababah"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(11)","DOI:10.14569/IJACSA.2018.091130","Projects: European Higher Education Area and other relevant issuesContemporary Social IssuesVitagenicy - Life Experience in EducationKnowledge exchange,How Scopus threw my research into the trashNaturalistsAchievements, Accomplishments and Scholarly ContributionsHost Link For The Interest Of Great Works🌹🌹🌹Global Education Members' Symposium (G.E.M.S)Computer NetworksSoftware Systems"],"references":["328096549_A_New_Model_of_Information_Systems_Efficiency_based_on_Key_Performance_Indicator_KPI","322727417_The_Pseudo-Equivalent_Groups_Approach_as_an_Alternative_to_Common-Item_Equating_The_Pseudo-Equivalent_Groups_Approach","319574898_A_dynamically_reconfigurable_VLSI_processor_with_hierarchical_structure_based_on_a_micropacket_transfer_scheme","312483915_Model-Driven_Engineering_for_Mission-Critical_IoT_Systems","320109884_A_novel_ship-borne_positive_pressure_solid_phase_extraction_device_to_enrich_organo_chlorinated_and_pyrethroid_pesticides_in_seawater","320091205_A_Programmable_Inbound_Transfer_Processor_for_Active_Messages_in_Embedded_Multicore_Systems","319647416_The_IoT_Identification_Procedure_Based_on_the_Degraded_Flash_Memory_Sector","319027058_Development_of_algorithm_flow_graph_mealy_automaton_graph_and_mathematical_models_of_microprogram_control_mealy_automaton_for_microprocessor_control_device","311998486_Prototyping_of_Concurrent_Control_Systems_Implemented_in_FPGA_Devices","311998308_Modelling_of_Concurrent_Systems_in_Hardware_Languages"]}