{"id":"329411017_Using_an_integrated_order_picking-vehicle_routing_problem_to_study_the_impact_of_delivery_time_windows_in_e-commerce","abstract":"European e-commerce sales are increasing every year. Nowadays, customers buy more frequently online in smallerquantities. Handling this large amount of customer orders puts the logistic activities of the supply chain underpressure. At the same time, customers have high expectations concerning the delivery of their online purchase. Inorder to meet these expectations at low cost, B2C e-commerce companies have to reconsider their logisticactivities. Instead of optimizing every single process of the supply chain, related problems need to be tackledsimultaneously. In the integrated order picking-vehicle routing problem(I-OP-VRP), picking lists and vehicle routesare determined simultaneously. One possibility to meet the high expectations of customers is to allow customers tochoose the time window in which they want to be delivered. However, the more customers select a time windowduring the purchasing process, the higher the total costs for the B2C e-commerce company since the company hasless flexibility to construct their delivery routes. To cover the cost increase, e-commerce companies often onlyprovide this service at an additional cost. The objective of this paper is to estimate the additional cost of allowingcustomers to choose a preferred delivery time window using the integrated order picking-vehicle routing problem.An experimental design is set up to investigate this service cost under varying circumstances depending oncustomer characteristics, time window characteristics and operator size. Based on the results of the ANOVA it canbe concluded that the investigated factors have a significant influence on the additional cost of allowing customersto select a delivery time window.","authors":["Katrien Ramaekers","An Caris","Stef Moons","Teun van Gils"],"meta":["June 2018European Transport Research Review 10(2)","DOI:10.1186/s12544-018-0333-5"],"references":["324568682_Integrated_order_picking_and_vehicle_routing_with_due_dates","320189093_Incorporating_online_shopping_into_travel_demand_modelling_challenges_progress_and_opportunities","318590469_E-commerce_last-mile_in_Belgium_Developing_an_external_cost_delivery_index","315639193_Integration_of_order_picking_and_vehicle_routing_in_a_B2C_e-commerce_context","330432181_The_value_of_integrating_order_picking_and_vehicle_routing_decisions_in_a_B2C_e-commerce_environment","322334479_Concurrent_manual-order-picking_warehouse_design_a_simulation-based_design_of_experiments_approach","319607712_Designing_Efficient_Order_Picking_Systems_by_Combining_Planning_Problems_State-of-the-art_Classification_and_Review","319278499_On-line_scheduling_of_order_picking_and_delivery_with_multiple_zones_and_limited_vehicle_capacity","318581208_Differentiated_Time_Slot_Pricing_Under_Routing_Considerations_in_Attended_Home_Delivery","302989325_Consequences_offailuretomeetassumptionsunderlying_thefixed_effects_analyses_of_variance_and_covariance"]}