{"id":"329481423_Reducing_Signal_Overload_by_Disconnection_Tolerant_Voice_Service_in_Heterogeneous_Networks","abstract":"Nowadays Over-The-Top (OTT) voice call service has become more popular than other Voice over Internet Protocol (VoIP) services provided by mobile operators due to cheaper costs. For devices with more than one network interfaces, the OTT software may need to handover between heterogeneous networks during a call. Unnecessary handover may lead to signal overload, especially in aWi-Fi intensive area where users may handover frequently between Wi-Fi and cellular networks. For example, if the period between when a user handovers from Wi-Fi to Long Term Evolution (LTE) and when the user handovers from LTE back to Wi-Fi is too short to transmit voice data, the handover procedures between Wi-Fi and LTE can be considered unnecessary and power-consuming. To tackle this issue, this paper proposes Delay-Handover- Mechanism (DHM) to avoid the unnecessary handover procedures by postponing the timing to handover from Wi-Fi to LTE. We then propose an analytical model as well as a simulation model to investigate how many handovers can be reduced. The analytical model is validated against the simulation model. With extensive simulation experiments, the performance evaluation of DHM offers a guideline to configure parameters based on the trade-off between reduced handover ratio and packet loss rate. As a whole, DHM is an application-based mechanism for avoiding unnecessary handovers as well as cutting down LTE usages.","authors":["Chia-Ying Lin","Hui-Ling Chang","Mong-Ting Wu","Yun-Zhan Cai"],"meta":["December 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2885361"],"references":["318574812_Smart_mobile_device_power_consumption_measurement_for_video_streaming_in_wireless_environments_WiFi_vs_LTE","239542449_RTP_Payload_Format_and_File_Storage_Format_for_the_Adaptive_Multi-Rate_AMR_and_Adaptive_Multi-Rate_Wideband_AMR-WB_Audio_Codecs","222553856_An_Overview_of_Vertical_Handover_Decision_Strategies_in_Heterogeneous_Wireless_Networks","317394258_Performance_Modeling_for_Multipath_Mobile_Data_Offloading_in_CellularWiFi_Networks","269302372_Performance_of_VoLTE_and_data_traffic_in_LTE_heterogeneous_networks","257675573_Vertical_Handover_Necessity_Estimation_Based_on_a_New_Dwell_Time_Prediction_Model_for_Minimizing_Unnecessary_Handovers_to_a_WLAN_Cell","244440797_RFC_3261SIP_Session_initiation_protocol","222558932_A_survey_of_vertical_handover_decision_algorithms_in_Fourth_Generation_heterogeneous_wireless_networks","221342579_Disconnection_tolerance_for_SIP-based_real-time_media_sessions","2518855_Performance_Modeling_of_Location_Tracking_Systems"]}