{"id":"329498249_Heterogeneous_Structured_Specifications_in_Logics_Without_Interpolation","abstract":"The world of software development has become intrinsically heterogeneous. Many formal languages have been made available to help analysts and designers model different aspects of software. Some examples in the logic realm are equational logic and classical first-order logic, propositional temporal logics such as LTL and CTL (and their first-order versions), multimodal logics such as the dynamic logic PDL and its first-order version, etc. One important feature of a specification language is the existence of structuring mechanisms enabling the modular construction of system descriptions. Structured specifications were introduced by Wirsing for first-order logic, and later presented in the language-independent setting of institutions by Sannella and Tarlecki. Afterwards, Borzyszkowski presented sufficient conditions for a calculus for (homogeneous) structured specifications to be complete. These conditions include some form of Craig’s interpolation, which results in a scenario that excludes many formalisms employed in the description of software. The contributions of this article are then summarised as follows: (a) We present a calculus for structured specifications whose completeness proof does not require any form of interpolation. (b) We extend this calculus to a complete calculus for heterogeneous structured specifications.","authors":["Carlos Gustavo Lopez Pombo","Marcelo F. Frias"],"meta":["January 2018","DOI:10.1007/978-3-319-97879-6_16","In book: Ewa Orłowska on Relational Methods in Logic and Computer Science (pp.403-439)","Project: Heterogeneous specification and design of software artefacts"],"references":["267179086_A_Relatively_Complete_Calculus_for_Structured_Heterogeneous_Specifications","329648496_Dynamic_Logic","321509003_Monographs_in_Theoretical_Computer_Science_An_EATCS_Series","319394472_Dynamic_Logic","302339631_General_Safety","291098752_A_Finite_Axiomatization_for_Fork_Algebras","285105964_Abstract_specification_theory_An_overview","283783801_Structured_Specifications_Syntax_Semantics_and_Proof_Calculus","271746291_Property-oriented_semantics_of_structured_specifications","269005083_Fork_algebras_in_algebra_logic_and_computer_science"]}