{"id":"329409181_Analytical_properties_of_generalized_Gaussian_distributions","abstract":"The family of Generalized Gaussian (GG) distributions has received considerable attention from the engineering community, due to the flexible parametric form of its probability density function, in modeling many physical phenomena. However, very little is known about the analytical properties of this family of distributions, and the aim of this work is to fill this gap.\nRoughly, this work consists of four parts. The first part of the paper analyzes properties of moments, absolute moments, the Mellin transform, and the cumulative distribution function. For example, it is shown that the family of GG distributions has a natural order with respect to second-order stochastic dominance.\nThe second part of the paper studies product decompositions of GG random variables. In particular, it is shown that a GG random variable can be decomposed into a product of a GG random variable (of a different order) and an independent positive random variable. The properties of this decomposition are carefully examined.\nThe third part of the paper examines properties of the characteristic function of the GG distribution. For example, the distribution of the zeros of the characteristic function is analyzed. Moreover, asymptotically tight bounds on the characteristic function are derived that give an exact tail behavior of the characteristic function. Finally, a complete characterization of conditions under which GG random variables are infinitely divisible and self-decomposable is given.\nThe fourth part of the paper concludes this work by summarizing a number of important open questions.","authors":["Alex Dytso","Ronit Bustin","H. Vincent Poor","Shlomo Shamai"],"meta":["December 2018Journal of Statistical Distributions and Applications 5(1)","DOI:10.1186/s40488-018-0088-5"],"references":["319022421_A_View_of_Information-Estimation_Relations_in_Gaussian_Networks","313541109_MaxEnt_Upper_Bounds_for_the_Differential_Entropy_of_Univariate_Continuous_Distributions","347491452_Infinite_Divisibility_of_Probability_Distributions_on_the_Real_Line","345136563_Matrix_Variate_Distributions","321789793_On_the_Minimum_Mean_p_th_Error_in_Gaussian_Noise_Channels_and_Its_Applications","320967926_On_Properties_of_the_Support_of_Capacity-Achieving_Distributions_for_Additive_Noise_Channel_Models_With_Input_Cost_Constraints","319367337_On_additive_channels_with_generalized_Gaussian_noise","317233031_Elements_of_information_theory_2nd_edition","313061242_A_theory_for_multiresolution_signal_decomposition_The_wavelet_representation","310329011_Gaussian_mixtures_Entropy_and_geometric_inequalities"]}