{"id":"329484018_Emerging_Trends_in_Hybrid_Wireless_Communication_and_Data_Management_for_the_Industry_40","abstract":"With the fast-paced realization of the Industry 4.0 paradigm, completely centralized networking solutions will no longer be sufficient to meet the stringent requirements of the related industrial applications. Besides requiring fast response time and increased reliability, they will necessitate computational resources at the edge of the network, which demands advanced communication and data management techniques. In this paper, we provide an overview of the network communications and data management aspects for the Industry 4.0. Our global perspective is to understand the key communication and data management challenges and peculiarities for the effective realization of the fourth industrial revolution. To address these challenges, this paper proposes hybrid communications management and decentralized data distribution solutions supported by a hierarchical and multi-tier network architecture. The proposed solutions combine local and decentralized management with centralized decisions to efficiently use the available network resources and meet the requirements of Industry 4.0 applications. To this end, the distributed management entities interact in order to coordinate their decisions and ensure the correct operation of the whole network. Finally, the use of Radio Access Network (RAN) slicing is proposed to achieve the required flexibility to efficiently meet the stringent and varying communication and data management requirements of industrial applications.","authors":["María del Carmen Lucas-Estañ","Miguel Sepulcre","Theofanis P. Raptis","Andrea Passarella"],"meta":["December 2018Electronics 7(12):400","DOI:10.3390/electronics7120400"],"references":["328213169_5G_Mobile_Services_and_Scenarios_Challenges_and_Solutions","327138483_Internet_of_Things_IoT_Operating_System_Applications_and_Protocols_Design_and_Validation_Techniques","326952794_Performance_Analysis_of_Latency-Aware_Data_Management_in_Industrial_IoT_Networks","326550973_An_Experimental_Evaluation_of_Redundancy_in_Industrial_Wireless_Communications","326282832_Impact_of_Quality_of_Service_on_Cloud_Based_Industrial_IoT_Applications_with_OPC_UA","326133188_Industrial_Internet_of_Things_Challenges_Opportunities_and_Directions","328987085_Software-_Defined_Networking_for_Dynamic_Control_of_Mobile_Industrial_Wireless_Sensor_Networks","328325550_Unlocking_5G_Spectrum_Potential_for_Intelligent_IoT_Opportunities_Challenges_and_Solutions","326001070_New_Trends_in_the_Practical_Deployment_of_Industrial_Wireless_From_Noncritical_to_Critical_Use_Cases","325985486_Maximizing_industrial_IoT_network_lifetime_under_latency_constraints_through_edge_data_distribution"]}