{"id":"329487854_Why_are_we_rich_or_poor","abstract":"It’s difficult to answer this question. Is it philosophical, is it economical, sociological, even ethical or religious? This topic is a really actual challenge in our Information Society.\nInformation Science tries to give an answer exactly to this question. Our world of work and life has to manage actually a too great amount of Information and Data. This scientific branch has the goal to come over this great challenge in a humanlike, scientific manner.\nScience should not only bring detailed special knowledge – like Old Greek Sophists – it should bring precious, mental, philosophical orientations.\nThe generation of Scientists, who has been growing up with the Computer and realised the broad influences of modern IT (Information Technology) to our whole society is now, about 70 years after finding first Computers, obliged to reorganise some terms in our society. We recognise that our children and grandchildren have no more experience of a life without a Computer. We called them - new - the Digital Generation.\nInformation Science was created parallel to Informatics about 1968, as an own branch of research, interested in all what was changed by the Computer. The fascination of the technically new facts has given her leading role to general new challenges and followings for our whole society.\nThese Scientists seek necessary results, because they worked responsibly in leading positions in Computer Science since their starting. Our society needs trust in future happenings. It can come worse – but it shouldn`t do so.\nThis article tries to keep economic happenings in Authors eye. Economy, Ecology and World of Work are in focus. Geo-political findings will be involved. Great, orienting guidelines will be researched and written down. Personal, human borders by being only one researcher can´t be negotiated – of course.","authors":["Franz Plochberger"],"meta":["December 2018","Project: Economy and Information Science"],"references":[]}