{"id":"329431892_How_does_serendipity_affect_diversity_in_recommender_systems_A_serendipity-oriented_greedy_algorithm","abstract":"Most recommender systems suggest items that are popular among all users and similar to items a user usually consumes. As a result, the user receives recommendations that she/he is already familiar with or would find anyway, leading to low satisfaction. To overcome this problem, a recommender system should suggest novel, relevant and unexpected i.e., serendipitous items. In this paper, we propose a serendipity-oriented, reranking algorithm called a serendipity-oriented greedy (SOG) algorithm, which improves serendipity of recommendations through feature diversification and helps overcome the overspecialization problem. To evaluate our algorithm, we employed the only publicly available dataset containing user feedback regarding serendipity. We compared our SOG algorithm with topic diversification, popularity baseline, singular value decomposition, serendipitous personalized ranking and Zheng’s algorithms relying on the above dataset. SOG outperforms other algorithms in terms of serendipity and diversity. It also outperforms serendipity-oriented algorithms in terms of accuracy, but underperforms accuracy-oriented algorithms in terms of accuracy. We found that the increase of diversity can hurt accuracy and harm or improve serendipity depending on the size of diversity increase.","authors":["Denis Kotkov","Jari Veijalainen","Shuaiqiang Wang"],"meta":["February 2020Computing 102(4)","DOI:10.1007/s00607-018-0687-5"],"references":["326164444_Investigating_serendipity_in_recommender_systems_based_on_real_user_feedback","325358320_A_Hybrid_Approach_to_Music_Playlist_Continuation_Based_on_Playlist-Song_Membership","317283429_A_Serendipity-Oriented_Greedy_Algorithm_for_Recommendations","315849260_Learning_to_Recommend_Accurate_and_Diverse_Items","306075233_A_Survey_of_Serendipity_in_Recommender_Systems","328441876_Recommending_Serendipitous_Items_using_Transfer_Learning","318869438_IR_evaluation_methods_for_retrieving_highly_relevant_documents","311784289_Diversity_Serendipity_Novelty_and_Coverage_A_Survey_and_Empirical_Analysis_of_Beyond-Accuracy_Objectives_in_Recommender_Systems","309457236_Improving_recommendation_lists_through_topic_diversification","302973713_Challenges_of_Serendipity_in_Recommender_Systems"]}