{"id":"329410685_Role_of_Modelling_in_International_Crop_Research_Overview_and_Some_Case_Studies","abstract":"Crop modelling has the potential to contribute to global food and nutrition security. This paper briefly examines the history of crop modelling by international crop research centres of the CGIAR (formerly Consultative Group on International Agricultural Research but now known simply as CGIAR), whose primary focus is on less developed countries. Basic principles of crop modelling building up to a Genotype × Environment × Management × Socioeconomic (G × E × M × S) paradigm, are explained. Modelling has contributed to better understanding of crop performance and yield gaps, better prediction of pest and insect outbreaks, and improving the efficiency of crop management including irrigation systems and optimization of planting dates. New developments include, for example, use of remote sensed data and mobile phone technology linked to crop management decision support models, data sharing in the new era of big data, and the use of genomic selection and crop simulation models linked to environmental data to help make crop breeding decisions. Socio-economic applications include foresight analysis of agricultural systems under global change scenarios, and the consequences of potential food system shocks are also described. These approaches are discussed in this paper which also calls for closer collaboration among disciplines in order to better serve the crop research and development communities by providing model based recommendations ranging from policy development at the level of governmental agencies to direct crop management support for resource poor farmers.","authors":["Matthew Reynolds","Martin Kropff","Jose Crossa","Jawoo Koo"],"meta":["December 2018Agronomy 8(12):291","DOI:10.3390/agronomy8120291","Project: Heat and Drought Wheat Improvement Consortium (HeDWIC)"],"references":["325425986_An_R_Package_for_Multi-Trait_and_Multi-Environment_Data_with_the_Item_Based_Collaborative_Filtering_Algorithm","324769671_Comparing_modeling_approaches_for_assessing_priorities_in_international_agricultural_research","324141716_Mapping_abiotic_stresses_for_rice_in_Africa_Drought_cold_iron_toxicity_salinity_and_sodicity","323618998_Impacts_of_climate_change_on_cropping_patterns_in_a_tropical_sub-humid_watershed","353868383_Insect_Life_Cycle_Modelling_ILCYM_software_-_a_generic_platform_for_developing_insect_phenology_models_population_analysis_and_risk_mapping","327253104_Decadal_analysis_of_impact_of_future_climate_on_wheat_production_in_dry_Mediterranean_environment_A_case_of_Jordan","324620495_Concepts_approaches_and_avenues_for_modelling_crop_health_and_crop_losses","324464215_Modelling_varietal_differences_in_response_to_phosphorus_in_West_African_sorghum","324263517_Coordinating_AgMIP_data_and_models_across_global_and_regional_scales_for_15C_and_20C_assessments","323720756_Can_we_use_crop_modelling_for_identifying_climate_change_adaptation_options"]}