{"id":"329464274_Some_Theoretical_Links_Between_Shortest_Path_Filters_and_Minimum_Spanning_Tree_Filters","abstract":"Edge-aware filtering is an important pre-processing step in many computer vision applications. In the literature, there exist several versions of collaborative edge-aware filters based on spanning trees and shortest path heuristics which work well in practice. For instance, tree filter (TF) which is recently proposed based on a minimum spanning tree (MST) heuristic yields promising results in many filtering applications. However, links between the tree-based filters and shortest path-based filters are faintly explored. In this article, we introduce an edge-aware generalization of the TF termed as UMST filter based on a subgraph generated by edges of all MSTs. The major contribution of this paper is establishing theoretical links between filters based on MSTs and filters based on geodesics via power watershed framework. More precisely, we show that union of minimum spanning trees (UMSTs) filter can be obtained as the limit of shortest path filters (SPFs). Intuitively, TF can be viewed as an approximate limit of the SPFs. We propose and provide a detailed analysis of two different implementations of the UMST filter based on shortest paths. Further, we establish empirically with the help of denoising experiments that TF is an approximate limit by showing that TF and one of our approximations yield similar results.","authors":["Sravan Danda","Aditya Challa","B. S Daya Sagar","Laurent Najman"],"meta":["July 2019Journal of Mathematical Imaging and Vision 61(9)","DOI:10.1007/s10851-018-0866-1"],"references":["322918441_Path-Value_Functions_for_Which_Dijkstra's_Algorithm_Returns_Optimal_Mapping","321414436_Extending_the_Power_Watershed_Framework_Thanks_to_Gamma-Convergence","319215171_An_Introduction_to_Gamma-Convergence_for_Spectral_Clustering","316048472_Power_Tree_Filter_A_Theoretical_Framework_Linking_Shortest_Path_Filters_and_Minimum_Spanning_Tree_Filters","313634582_Image_smoothing_via_L0_gradient_minimization","313487833_A_tutorial_on_spectral_clustering","308814887_Propagated_image_filtering","303145463_A_geodesic_framework_for_fast_interactive_image_and_video_segmentation_and_matting","292793744_Random_walks_for_image_segmentation","283630059_Graph-theoretical_methods_for_detecting_and_descibing_gestalt_clusters"]}