{"id":"329581899_Supervised_band_selection_in_hyperspectral_images_using_single-layer_neural_networks","abstract":"Hyperspectral images provide fine details of the scene under analysis in terms of spectral information. This is due to the presence of contiguous bands that make possible to distinguish different objects even when they have similar colour and shape. However, neighbouring bands are highly correlated, and, besides, the high dimensionality of hyperspectral images brings a heavy burden on processing and also may cause the Hughes phenomenon. It is therefore advisable to make a band selection pre-processing prior to the classification task. Thus, this paper proposes a new supervised filter-based approach for band selection based on neural networks. For each class of the data set, a binary single-layer neural network classifier performs a classification between that class and the remainder of the data. After that, the bands related to the biggest and smallest weights are selected, so, the band selection process is class-oriented. This process iterates until the previously defined number of bands is achieved. A comparison with three state-of-the-art band selection approaches shows that the proposed method yields the best results in 43.33% of the cases even with greatly reduced training data size, whereas the competitors have achieved between 13.33% and 23.33% on the Botswana, KSC and Indian Pines datasets.","authors":["Mateus Habermann","Vincent Fremont","Elcio Hideiti Shiguemori"],"meta":["December 2018International Journal of Remote Sensing 40(3):1-27","DOI:10.1080/01431161.2018.1553322"],"references":["321788660_Problem-based_band_selection_for_hyperspectral_images","321121592_Hyperspectral_Band_Selection_Based_on_Deep_Convolutional_Neural_Network_and_Distance_Density","320217847_A_New_Unsupervised_Hyperspectral_Band_Selection_Method_Based_on_Multiobjective_Optimization","345150894_Comparative_analysis_of_hyperspectral_feature_extraction_methods_in_vegetation_classification","327767128_Statistical_Learning_with_Sparsity_The_Lasso_and_Generalizations","321065828_Hyperspectral_Band_Selection_via_Rank_Minimization","320845910_Remote_Sensing_Image_Denoising_Using_Patch_Grouping-Based_Nonlocal_Means_Algorithm","320251688_Hyperspectral_Band_Selection_Using_Improved_Classification_Map","320250407_Multiview_Intensity-Based_Active_Learning_for_Hyperspectral_Image_Classification","320027925_Unsupervised_Band_Selection_Using_Block-Diagonal_Sparsity_for_Hyperspectral_Image_Classification"]}