{"id":"329575156_The_Sequent_Calculus_of_Skew_Monoidal_Categories","abstract":"Szlachányi's skew monoidal categories are a well-motivated variation of monoidal categories in which the unitors and associator are not required to be natural isomorphisms, but merely natural transformations in a particular direction. We present a sequent calculus for skew monoidal categories, building on the recent formulation by one of the authors of a sequent calculus for the Tamari order (skew semigroup categories). In this calculus, antecedents consist of a stoup (an optional formula) followed by a context (a list of formulae), and the connectives unit and tensor behave like in intuitionistic non-commutative linear logic (the logic of monoidal categories) except that the left rules may only be applied in stoup position. We show the admissibility of two forms cut (stoup cut and context cut), and prove the calculus sound and complete with respect to existence of maps in the free skew monoidal category. We then introduce an equivalence relation on sequent calculus derivations and prove that there is a one-to-one correspondence between equivalence classes of derivations and maps in the free skew monoidal category. Finally, we identify a subcalculus of focused derivations, and establish that it contains exactly one canonical representative from each equivalence class. As an end result, we obtain simple algorithms both for deciding equality of maps in the free skew monoidal category and for enumerating any homset without duplicates, in particular, for deciding whether there is a map. We have formalized this development in the dependently typed programming language Agda.","authors":["Tarmo Uustalu","Niccolò Veltri","Noam Zeilberger"],"meta":["December 2018Electronic Notes in Theoretical Computer Science 341:345-370","DOI:10.1016/j.entcs.2018.11.017"],"references":["324055429_A_sequent_calculus_for_a_semi-associative_law","256981637_The_Catalan_simplicial_set","321967087_Free_skew_monoidal_categories","319210122_Skew_monoidal_categories_and_skew_multicategories","272293273_Categories_for_the_Working_Mathematician_Graduate_Texts_in_Mathematics_5","267655694_Associahedra_Tamari_Lattices_and_Related_Structures_Tamari_Memorial_Festschrift","266215012_Categories_avec_multiplication","262974397_Coherence_for_Skew-Monoidal_Categories","238858126_On_MacLane's_conditions_for_coherence_of_natural_associativities_commutativities_etc","235645227_Triangulations_orientals_and_skew_monoidal_categories"]}