{"id":"329563598_Colombia_an_unknown_genetic_diversity_in_the_era_of_Big_Data","abstract":"Background\nLatin America harbors some of the most biodiverse countries in the world, including Colombia. Despite the increasing use of cutting-edge technologies in genomics and bioinformatics in several biological science fields around the world, the region has fallen behind in the inclusion of these approaches in biodiversity studies. In this study, we used data mining methods to search in four main public databases of genetic sequences such as: NCBI Nucleotide and BioProject, Pathosystems Resource Integration Center, and Barcode of Life Data Systems databases. We aimed to determine how much of the Colombian biodiversity is contained in genetic data stored in these public databases and how much of this information has been generated by national institutions. Additionally, we compared this data for Colombia with other countries of high biodiversity in Latin America, such as Brazil, Argentina, Costa Rica, Mexico, and Peru.\n\nResults\nIn Nucleotide, we found that 66.84% of total records for Colombia have been published at the national level, and this data represents less than 5% of the total number of species reported for the country. In BioProject, 70.46% of records were generated by national institutions and the great majority of them is represented by microorganisms. In BOLD Systems, 26% of records have been submitted by national institutions, representing 258 species for Colombia. This number of species reported for Colombia span approximately 0.46% of the total biodiversity reported for the country (56,343 species). Finally, in PATRIC database, 13.25% of the reported sequences were contributed by national institutions. Colombia has a better biodiversity representation in public databases in comparison to other Latin American countries, like Costa Rica and Peru. Mexico and Argentina have the highest representation of species at the national level, despite Brazil and Colombia, which actually hold the first and second places in biodiversity worldwide.\n\nConclusions\nOur findings show gaps in the representation of the Colombian biodiversity at the molecular and genetic levels in widely consulted public databases. National funding for high-throughput molecular research, NGS technologies costs, and access to genetic resources are limiting factors. This fact should be taken as an opportunity to foster the development of collaborative projects between research groups in the Latin American region to study the vast biodiversity of these countries using ‘omics’ technologies.","authors":["Alejandra Noreña Puerta","Andrea González-Muñoz","Jeanneth Mosquera","Kelly Botero"],"meta":["December 2018BMC Genomics 19(S8)","DOI:10.1186/s12864-018-5194-8","Project: Latin-Amercian Biodiversity"],"references":["319980152_Financial_mechanism_to_invest_in_knowledge_from_natural_resource_revenues_Experiences_from_Bolivia_Chile_Colombia_and_Peru","319449888_Bioinformatics_in_Latin_America_and_SoIBio_impact_a_tale_of_spin-off_and_expansion_around_genomes_and_protein_structures","315491552_A_Review_of_Bioinformatics_Tools_for_Bio-Prospecting_from_Metagenomic_Sequence_Data","309618184_Revision_of_the_status_of_bird_species_occurring_or_reported_in_Colombia_2016_and_assessment_of_BirdLife_International's_new_parrot_taxonomy","304576907_Reclassification_of_Clostridium_difficile_as_Clostridioides_difficile_Hall_and_O'Toole_1935_Prevot_1938","322853413_Database_resources_of_the_National_Center_for_Biotechnology_Information","322784327_Corrigendum_Spider_genomes_provide_insight_into_composition_and_evolution_of_venom_and_silk","317575278_Bioprospecting_of_functional_cellulases_from_metagenome_for_second_generation_biofuel_production_a_review","312268016_DNA_sequencing_technologies_2006-2016","305276256_Plant_Genetic_Resources_Needs_Rights_and_Opportunities"]}