{"id":"329518782_A_Language_for_Online_State_Processing_of_Binary_Sensors_Applied_to_Ambient_Assisted_Living","abstract":"There is a large variety of binary sensors in use today, and useful context-aware services can be defined using such binary sensors. However, the currently available approaches for programming context-aware services do not conveniently support binary sensors. Indeed, no existing approach simultaneously supports a notion of state, central to binary sensors, offers a complete set of operators to compose states, allows to define reusable abstractions by means of such compositions, and implements efficient online processing of these operators.\nThis paper proposes a new language for event processing specifically targeted to binary sensors. The central contributions of this language are a native notion of state and semi-causal operators for temporal state composition including: Allen's interval relations generalized for handling multiple intervals, and temporal filters for handling delays. Compared to other approaches such as CEP (complex event processing), our language provides less discontinued information, allows less restricted compositions, and supports reusable abstractions. We implemented an interpreter for our language and applied it to successfully rewrite a full set of real Ambient Assisted Living services. The performance of our prototype interpreter is shown to compete well with a commercial CEP engine when expressing the same services.","authors":["Nic Volanschi","Bernard Serpette","Adrien Carteron","Charles Consel"],"meta":["December 2018Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies 2(4)","DOI:10.1145/3287070"],"references":["324078015_PIE_A_Domain-Specific_Language_for_Interactive_Software_Development_Pipelines","323160411_Recent_Advancements_in_Event_Processing","320079018_Everyday_Functioning_Benefits_from_an_Assisted_Living_Platform_amongst_Frail_Older_Adults_and_Their_Caregivers","318175632_HomeAssist_An_Assisted_Living_Platform_for_Aging_in_Place_Based_on_an_Interdisciplinary_Approach","318015421_CCBL_A_Language_for_Better_Supporting_Context_Centered_Programming_in_the_Smart_Home","318015361_CCBL_A_new_language_for_End_User_Development_in_the_Smart_Homes","305695464_A_Survey_on_Domain-Specific_Modeling_and_Languages_in_Robotics","313218002_Timed_automata_Semantics_algorithms_and_tools","308183621_Self_determination-based_design_to_achieve_acceptance_of_assisted_living_technologies_for_older_adults","303890546_Edge_Computing_Vision_and_Challenges"]}