{"id":"329526066_Community_Detection_in_Complex_Networks_by_Detecting_and_Expanding_Core_Nodes_Through_Extended_Local_Similarity_of_Nodes","abstract":"As the community detection is able to facilitate the discovery of hidden information in complex networks, it has been drawn a lot of attention recently. However, due to the growth in computational power and data storage, the scale of these complex networks has grown dramatically. In order to detect communities by utilizing global approaches, it is required to have all the global information of the whole network; something which is impossible, because of the rapid growth in the size of the networks. In this paper, a local approach has been proposed based on the detection and expansion of core nodes. First, a community’s central node (core node) which has a high level of embeddedness is detected based on the similarity between graph’s nodes. By using this, the total weights of a weighted graph’s edges created. Following by that, the expansion of these nodes will be considered, by utilizing the concept of node’s membership based on the definition of strong community for weighted graphs. It can be seen that in detecting communities, the more accurate the weights of edges detected based on the node similarity, the more precise the local algorithm will be. In fact, the algorithm has the ability to detect all the graph’s communities in a network using local information as well as identifying various roles of nodes, either being (core or outlier). Test results on both real-world and artificial networks prove that the quality of the communities which are detected by the proposed algorithm is better than the results which are achieved by other state-of-the-art algorithms in the complex networks","authors":["Kamal Berahmand","Asgarali Bouyer","Mahdi Vasighi"],"meta":["December 2018IEEE Transactions on Computational Social Systems 5(4):1021 - 1033","DOI:10.1109/TCSS.2018.2879494","Project: Community Detection from aspecting Linear Time Complexity"],"references":["321535074_LP-LPA_A_link_influence-based_label_propagation_algorithm_for_discovering_community_structures_in_networks","312182253_Locating_Structural_Centers_A_Density-Based_Clustering_Method_for_Community_Detection","295395520_Community_detection_in_social_networks","319709299_Community_Mining_Using_Three_Closely_Joint_Techniques_Based_on_Community_Mutual_Membership_and_Refinement_Strategy","312970191_Scientific_collaboration_networks","311344563_Finding_community_structure_in_very_large_networks","310734356_A_community_integration_strategy_based_on_an_improved_modularity_density_increment_for_large-scale_networks","305780197_Community_detection_in_networks_A_user_guide","301232956_The_structure_and_function_of_networks","298806621_Circularly_Searching_Core_Nodes_Based_Label_Propagation_Algorithm_for_Community_Detection"]}