{"id":"329575666_Modeling_Individual_Strategies_in_Dynamic_Decision-making_with_ACT-R_A_Task_Toward_Decision-making_Assistance_in_HCI","abstract":"New findings from cognitive science, computer science, and psychology should be used to develop better artificial intelligence (AI). One of the important goals in AI development is the accurate understanding and prediction of the behaviors and decision-making processes of humans. It is especially demanding to achieve this for real dynamic settings, characterized by constant changes. Individual differences in decision-making and behavior make this even more challenging. The area of human-computer interaction looks at a series of decisions and multifactor situations which are influenced by corresponding feedback. Cognitive modeling provides us with a method to understand and explain how such dynamic decisions are made. This work is a demonstration of how cognitive modeling allows to flexible simulate decision-making in dynamic environments for different individual strategies. In this work an empirical study of an improved complex category learning task is presented, the study is based on previous work [8]. The task requires participants to categorize tones (consisting of different features) by applying acoustic strategies to define a target category and adapt to a reversal of feedback. Thus, a model based on the cognitive architecture ACT-R is developed. This model firstly tries out one-feature strategies (e.g. frequency) and then switches to two-feature strategies (e.g. frequency + volume) as a result of negative feedback. However, after comparing the model fit data and analyzing each individual’s data and answers, there is a great variance among some individuals and the first model which only considers acoustic feature strategies and cannot predict individuals who consider the uncertain correct button representing target tones. The upgraded second model contains two independent threshold count mechanisms for these two factors’ learning process. The result of the second model provides a better approximation of the values with the empirical data of those subjects who prefer to consider multi-factors in the tasks. It proves the extensibility of this ACT-R cognitive modeling approach for the different individual cases. A great potential of our approach is, that it can be applied to other HCI tasks and thus it can contribute to related AI approaches and help build AIs with a better understanding of human decision-making.","authors":["Ziying Zhang","Nele Russwinkel","Sabine Prezenski"],"meta":["January 2018Procedia Computer Science 145:668-674","DOI:10.1016/j.procs.2018.11.064"],"references":["318907533_A_Cognitive_Modeling_Approach_to_Strategy_Formation_in_Dynamic_Decision_Making","268690685_Carrot_and_stick_20_The_benefits_of_natural_and_motivational_prosody_in_computer-assisted_learning","227446072_Modeling_Managerial_Behavior_Misperceptions_of_Feedback_in_a_Dynamic_Decision_Making_Experiment","220102904_Feedback_in_human-computer_interaction_-_characteristics_and_recommendations","261430370_MOTI_A_Motivational_Prosody_Corpus_for_Speech-Based_Tutorial_Systems","256330843_Preattentive_mechanisms_of_change_detection_in_early_auditory_cortex_A_7Tesla_fMRI_study","222556226_Instance-based_learning_in_dynamic_decision_making","8059352_Sensory_and_cognitive_mechanisms_for_preattentive_change_detection_in_auditory_cortex"]}