{"id":"329552979_One-shot_domain_adaptation_in_multiple_sclerosis_lesion_segmentation_using_convolutional_neural_networks","abstract":"In recent years, several convolutional neural network (CNN) methods have been proposed for the automated white matter lesion segmentation of multiple sclerosis (MS) patient images, due to their superior performance compared with those of other state-of-the-art methods. However, the accuracies of CNN methods tend to decrease significantly when evaluated on different image domains compared with those used for training, which demonstrates the lack of adaptability of CNNs to unseen imaging data. In this study, we analyzed the effect of intensity domain adaptation on our recently proposed CNN-based MS lesion segmentation method. Given a source model trained on two public MS datasets, we investigated the transferability of the CNN model when applied to other MRI scanners and protocols, evaluating the minimum number of annotated images needed from the new domain and the minimum number of layers needed to re-train to obtain comparable accuracy. Our analysis comprised MS patient data from both a clinical center and the public ISBI2015 challenge database, which permitted us to compare the domain adaptation capability of our model to that of other state-of-the-art methods. In both datasets, our results showed the effectiveness of the proposed model in adapting previously acquired knowledge to new image domains, even when a reduced number of training samples was available in the target dataset. For the ISBI2015 challenge, our one-shot domain adaptation model trained using only a single case showed a performance similar to that of other CNN methods that were fully trained using the entire available training set, yielding a comparable human expert rater performance. We believe that our experiments will encourage the MS community to incorporate its use in different clinical settings with reduced amounts of annotated data. This approach could be meaningful not only in terms of the accuracy in delineating MS lesions but also in the related reductions in time and economic costs derived from manual lesion labeling.","authors":["Sergi Valverde","Mostafa Salem","Mariano Cabezas","Deborah Pareto"],"meta":["December 2018NeuroImage: Clinical 21:101638","DOI:10.1016/j.nicl.2018.101638"],"references":["327603771_Objective_Evaluation_of_Multiple_Sclerosis_Lesion_Segmentation_using_a_Data_Management_and_Processing_Infrastructure","324054911_Multiple_Sclerosis_Lesion_Segmentation_from_Brain_MRI_via_Fully_Convolutional_Neural_Networks","319577938_Tversky_Loss_Function_for_Image_Segmentation_Using_3D_Fully_Convolutional_Deep_Networks","319462000_Transfer_Learning_for_Domain_Adaptation_in_MRI_Application_in_Brain_Lesion_Segmentation","317673840_Tversky_loss_function_for_image_segmentation_using_3D_fully_convolutional_deep_networks","323641407_MIMoSA_An_Automated_Method_for_Intermodal_Segmentation_Analysis_of_Multiple_Sclerosis_Brain_Lesions_Method_For_Inter-Modal_Segmentation_Analysis","320150845_Multi-view_longitudinal_CNN_for_multiple_sclerosis_lesion_segmentation","318017449_Unsupervised_Domain_Adaptation_in_Brain_Lesion_Segmentation_with_Adversarial_Networks","313796963_Improving_automated_multiple_sclerosis_lesion_segmentation_with_a_cascaded_3D_convolutional_neural_network_approach","312199670_Longitudinal_multiple_sclerosis_lesion_segmentation_Resource_and_challenge"]}