{"id":"329537236_Brain_Network_Analysis_and_Classification_Based_on_Convolutional_Neural_Network","abstract":"Background: Convolution neural networks (CNN) is increasingly used in computer science and finds more and more applications in different fields. However, analyzing brain network with CNN is not trivial, due to the non-Euclidean characteristics of brain network built by graph theory.\nMethod: To address this problem, we used a famous algorithm “word2vec” from the field of natural language processing (NLP), to represent the vertexes of graph in the node embedding space, and transform the brain network into images, which can bridge the gap between brain network and CNN. Using this model, we analyze and classify the brain network from Magnetoencephalography (MEG) data into two categories: normal controls and patients with migraine.\nResults: In the experiments, we applied our method on the clinical MEG dataset, and got the mean classification accuracy rate 81.25%.\nConclusions: These results indicate that our method can feasibly analyze and classify the brain network, and all the abundant resources of CNN can be used on the analysis of brain network.","authors":["Lu Meng","Jing Xiang"],"meta":["December 2018Frontiers in Computational Neuroscience 12","DOI:10.3389/fncom.2018.00095"],"references":["308308533_BrainNetCNN_Convolutional_Neural_Networks_for_Brain_Networks_Towards_Predicting_Neurodevelopment","306357759_Small-World_Brain_Networks_Revisited","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318981936_Classifying_Graphs_as_Images_with_Convolutional_Neural_Networks","311609041_Deep_Residual_Learning_for_Image_Recognition","310752533_Visualizing_and_understanding_convolutional_networks","309076254_Gradientbased_learning_applied_to_document_recognition","307991731_Semi-Supervised_Classification_with_Graph_Convolutional_Networks","305997704_node2vec_Scalable_Feature_Learning_for_Networks"]}