{"id":"329525177_Mapeando_Imagens_de_Desinformacao_e_Fake_News_Politico-Eleitorais_com_Inteligencia_Artificial","abstract":"O fenômeno das chamadas \"fake news\" trouxe uma nova camada de complexidade aos estudos de democracia digital. Se estudos de mídias sociais com técnicas de monitoramento cresceram nos últimos anos, o fechamento tanto de APIs quanto a emergência de canais alternativos de circulação de informação-como o Whatsapp-traz novos desafios ao dimensionamento de fake news e desinformação no contexto eleitoral. O artigo é um relato de desenvolvimento e aplicação de metodologia experimental de reconhecimento e mapeamento automatizado de imagens ao contexto político-eleitoral. A partir do levantamento de 500 imagens de difamação e \"fake news\" sobre o ex-presidente e pré-candidato Luís Inácio Lula da Silva, foi aplicada técnica de varredura online de imagens (reconhecimento de imagens através da Google Vision) similares para o levantamento de websites que as (re)publicaram. Como resultado, apresentamos dados aplicados sobre os principais websites e seus tipos de conexões na rede.","authors":["Tarcízio Silva","Pedro Barciela","Pedro Meirelles"],"meta":["October 2018","Conference: CONEC: Congresso Nacional de Estudos ComunicacionaisAt: Poço de Caldas, Minas Gerais, Brasil","Project: Raça e Racialização em Tecnologias, Plataformas Digitais e Algoritmos"],"references":["329180162_Entre_fatos_boatos_e_vontades_de_verdades_os_sentidos_produzidos_pela_midia_na_politica_brasileira","326617642_Why_We_Can't_Have_Our_Facts_Back","314291553_Monitoramento_e_Pesquisa_e_Midias_Sociais_metodologias_aplicacoes_e_inovacoes","334907392_Medical_Image_Analysis_With_Deep_Neural_Networks","327747976_Can_We_Think_Without_Categories","323157055_The_diffusion_of_misinformation_on_social_media_Temporal_pattern_message_and_source","317973577_Twitter_and_tear_gas_The_power_and_fragility_of_networked_protest","312572377_Automated_Coding_of_Political_Video_Ads_for_Political_Science_Research","312287394_Post-truth_Study_epidemiology_of_fake_news","308814576_What_Makes_Photo_Cultures_Different","279448287_The_Exceptional_and_the_Everyday_144_Hours_in_Kiev","285385068_New_advances_in_visual_computing_for_intelligent_processing_of_visual_media_and_augmented_reality"]}