{"id":"329526806_A_novel_heuristic_method_for_misclassification_cost_tuning_in_imbalanced_data","abstract":"Currently, one of the most challenging problem in machine learning and data mining is the data imbalance problem. Many techniques and methods are researched and proposed to solve this problem. Fundamental solution is data balancing with under-sampling and over-sampling techniques. However, these conventional methods might be suffered from the potential loss of useful information leading to the generation of useless patterns. Therefore, the techniques that avoid adjusting the sample size of data are more interesting. One of such technique is misclassification cost adjustment. This paper focuses on improving the performance of classification model built from the misclassification cost adjustment technique by proposing the novel heuristic method. Our proposed method uses a heuristic based on the experience of practitioner working on many manufacturing data. The heuristic employs the relation between misclassification cost, imbalance ratio and a constant factor \"e\" (Euler's number). The experiment has been operated on 56 real-world datasets with various number of attributes and different degrees of imbalance ratio. The results confirm that our novel heuristic method can help improving the performance of the classification model. On datasets with high imbalance ratio, our method shows the improvement rate of AUC up to 29%. © 2018, International Association of Computer Science and Information Technology.","authors":["A. Hirunyawanakul","Nittaya Kerdprasop","K. Kerdprasop"],"meta":["December 2018","DOI:10.18178/ijmlc.2018.8.6.746"],"references":["315060244_AVC_Selecting_discriminative_features_on_basis_of_AUC_by_maximizing_variable_complementarity","285698707_AUC_A_misleading_measure_of_the_performance_of_predictive_distribution_models","261853221_A_Survey_of_Cost-Sensitive_Decision_Tree_Induction_Algorithms","318382275_Adaptive_Ensemble_Undersampling-Boost_A_Novel_Learning_Framework_for_Imbalanced_Data","316804946_Clustering-based_undersampling_in_class-imbalanced_data","288987576_Learning_Efficient_Classification_Procedures_and_Their_Application_to_Chess_End_Games","265129380_A_new_approach_for_imbalanced_data_classification_based_on_data_gravitation","256822725_Facial_age_estimation_based_on_label-sensitive_learning_and_age-oriented_regression","256822478_Inverse_random_under_sampling_for_class_imbalance_problem_and_its_application_to_multi-label_classification","255564894_An_empirical_study_of_cost-sensitive_learning_in_cultural_modeling"]}