{"id":"329556593_Effect_of_time_varying_transmission_rates_on_the_coupled_dynamics_of_epidemic_and_awareness_over_a_multiplex_network","abstract":"A non-linear stochastic model is presented to study the effect of time variation of transmission rates on the co-evolution of epidemics and its corresponding awareness over a two layered multiplex network. In the model, the infection transmission rate of a given node in the epidemic layer depends upon its awareness probability in the awareness layer. Similarly, the infection information transmission rate of a node in the awareness layer depends upon its infection probability in the epidemic layer. The spread of disease resulting from physical contacts is described in terms of a Susceptible Infected Susceptible process over the epidemic layer and the spread of information about the disease outbreak is described in terms of an Unaware Aware Unaware process over the virtual interaction mediated awareness layer. The time variation of the transmission rates and the resulting co-evolution of these mutually competing processes are studied in terms of a network topology dependent parameter ( α). Using a second order linear theory, it is shown that in the continuous time limit, the co-evolution of these processes can be described in terms of damped and driven harmonic oscillator equations. From the results of a Monte-Carlo simulation, it is shown that for a suitable choice of the parameter ( α ), the two processes can either exhibit sustained oscillatory or damped dynamics. The damped dynamics corresponds to the endemic state. Furthermore, for the case of an endemic state, it is shown that the inclusion of the awareness layer significantly lowers the disease transmission rate and reduces the size of the epidemic. The infection probability of the nodes in the endemic state is found to have a dependence on both the transmission rates and on their absolute degrees in each of the network layers and on the relative differences between their degrees in the respective layers.","authors":["Vikram Sagar","Yi Zhao","Abhijit Sen"],"meta":["November 2018Chaos (Woodbury, N.Y.) 28(11):113125","DOI:10.1063/1.5042575"],"references":["325256727_Immunity_of_multiplex_networks_via_acquaintance_vaccination","319056938_Enhancement_of_large_fluctuations_to_extinction_in_adaptive_networks","310467809_The_Impact_of_Heterogeneity_and_Awareness_in_Modeling_Epidemic_Spreading_on_Multiplex_Networks","301244032_Suppressing_disease_spreading_by_using_information_diffusion_on_multiplex_networks","275896883_Analysis_and_Control_of_Epidemics_A_Survey_of_Spreading_Processes_on_Complex_Networks","313892107_Collective_effect_of_personal_behavior_induced_preventive_measures_and_differential_rate_of_transmission_on_spread_of_epidemics","312082512_Hysteresis_loop_of_nonperiodic_outbreaks_of_recurrent_epidemics","305809093_Competing_spreading_processes_and_immunization_in_multiplex_networks","283617653_Emergence_of_Scaling_in_Random_Networks","276916446_Epidemic_Information_Dissemination_in_Mobile_Social_Networks_With_Opportunistic_Links"]}