{"id":"329587030_An_Automatic_Method_for_the_Analysis_of_Scientific_Literature_Collection","abstract":"When it comes to scientific and technological developments of any kind, the first step in producing them consists of research. It is the only possibility to understand a problem and to develop a solution. As the number and percentage of publications available in a digital format keep increasing, research is bound to become easier and more organized. Grouping publications on similar topics into one literature collection and performing an analysis in order to gain knowledge about a subject can be a difficult and time-consuming process. In this paper, we propose an innovative approach that automatically provides insights, results and statistics on a given set of scientific publications. We applied the automatic analysis tool on a combination of 2 literature collections, one regarding water management and one belonging to a research group at the Computer Science and Automatic Control Faculty of the „Politehnica” University of Bucharest and gained valuable insights about both topics.","authors":["Lidia Bajenaru","Adrian-Mihai Custura"],"meta":["December 2018Studies in Informatics and Control 27(4):423-430","DOI:10.24846/v27i4y201806","Project: Romanian literary heritage conservation and  intelligent digital solutions for knowledge extraction and systematization - INTELLIT"],"references":["321747011_Applying_Data_Mining_Techniques_in_Healthcare","281467531_Visual_Analysis_and_Dissemination_of_Scientific_Literature_Collections_with_SurVis","234144778_Mendeley_Creating_Communities_of_Scholarly_Inquiry_Through_Research_Collaboration","220365334_Agent-based_computing_from_multi-agent_systems_to_agent-based_Models_a_visual_survey","318335734_Natural_Language_Processing_and_Machine_Learning_Methods_for_Software_Development_Effort_Estimation","315366807_The_Use_of_Visual_Tools_in_the_Academic_Research_Process_A_Literature_Review","236121223_BibTeX_ing_Documentation_for_general_BibTeX_users","233003458_Zotero_A_Product_Review"]}