{"id":"329598188_Practical_Quantum_Computing_for_Developers_Programming_Quantum_Rigs_in_the_Cloud_using_Python_Quantum_Assembly_Language_and_IBM_QExperience","abstract":"Write algorithms and program in the new field of quantum computing. This book covers major topics such as the physical components of a quantum computer: qubits, entanglement, logic gates, circuits, and how they differ from a traditional computer. Also, Practical Quantum Computing for Developers discusses quantum computing in the cloud using IBM Q Experience including: the composer, quantum scores, experiments, circuits, simulators, real quantum devices, and more. You'll be able to run experiments in the cloud on a real quantum device. Furthermore, this book shows you how to do quantum programming using the QISKit (Quantum Information Software Kit), Python SDK, and other APIs such as QASM (Quantum Assembly). You'll learn to write code using these languages and execute it against simulators (local or remote) or a real quantum computer provided by IBM's Q Experience. Finally, you'll learn the current quantum algorithms for entanglement, random number generation, linear search, integer factorization, and others. You'll peak inside the inner workings of the Bell states for entanglement, Grover's algorithm for linear search, Shor's algorithm for integer factorization, and other algorithms in the fields of optimization, and more. Along the way you'll also cover game theory with the Magic Square, an example of quantum pseudo-telepathy where parties sharing entangled states can be observed to have some kind of communication between them. In this game Alice and Bob play against a referee. Quantum mechanics allows Alice and Bob to always win! By the end of this book, you will understand how this emerging technology provides massive parallelism and significant computational speedups over classical computers, and will be prepared to program quantum computers which are expected to replace traditional computers in the data center.","authors":["Vladimir Silva"],"meta":["January 2018","DOI:10.1007/978-1-4842-4218-6","ISBN: 978-1-4842-4217-9"],"references":[]}