{"id":"329589139_How_Metaphysical_Commitments_Shape_the_Study_of_Psychological_Mechanisms","abstract":"The study of psychological mechanisms is an interdisciplinary endeavour, requiring insights from many different domains (from electrophysiology, to psychology, to theoretical neuroscience, to computer science). In this article, I argue that philosophy plays an essential role in this interdisciplinary project, and that effective scientific study of psychological mechanisms requires that working scientists be responsible metaphysicians. This means adopting deliberate metaphysical positions when studying mechanisms that go beyond what is empirically justified regarding the nature of the phenomenon being studied, the conditions of its occurrence, and its boundaries. Such metaphysical commitments are necessary in order to set up experimental protocols, determine which variables to manipulate under experimental conditions, and which conclusions to draw from different scientific models and theories. It is important for scientists to be aware of the metaphysical commitments they adopt, since they can easily be led astray if invoked carelessly.","authors":["Eric Hochstein"],"meta":["December 2018Theory & Psychology 29(5)","DOI:10.1177/0959354319860591"],"references":["319269747_Basic_Emotions_in_Human_Neuroscience_Neuroimaging_and_Beyond","317033282_Integrating_cognitive_neuroscience_using_mechanisms","316282404_Recent_Work_in_The_Philosophy_of_Biology","314152161_Coordinated_Pluralism_as_a_Means_to_Facilitate_Integrative_Taxonomies_of_Cognition","309522109_Modularity_of_Mind_Is_It_Time_to_Abandon_This_Ship","301562754_Reading_Emotions_From_Faces_in_Two_Indigenous_Societies","292215848_The_Mind_is_Not_Just_a_System_of_Modules_Shaped_Just_by_Natural_Selection","329648268_Recollections_of_My_Life","321640421_Evolution_of_Cognitive_Function_Via_Redeployment_of_Brain_Areas","309665201_Crash_Testing_an_Engineering_Framework_in_Neuroscience_Does_the_Idea_of_Robustness_Break_Down"]}