{"id":"329506714_Exploring_the_Social_and_Emotional_Problems_of_Undergraduates_Business_Students_of_Pakistan_A_Qualitative_Case_Study","abstract":"Social and emotional health especially of young adults has been a considerable focus of scholarly research in the past few decades all over the world. Much of which is concerned about the number and statistics of people who are suffering from some kind of mental illnesses. This qualitative case study explored the experiences and perceptions of those business university students who are facing some social and emotional challenges and in this important phase of life which have a potential to be converted into something more serious i.e. mental disorders. This research identified those variables which are responsible for the social and emotional disturbances of young business university students. In addition, this study also examined those variables which are not specifically related to general culture of a society but to some subcultures which also impact student's social and emotional health. To understand the experiences and perception of those students this study employed focus group interviews, semi-structured open-ended one-on-one interviews, written responses, and projective technique like RISB in the form of self-description, of 15 students at a large private business school in Karachi city. Based on analysis of focus group interviews, Rotter incomplete sentences responses, and one-on-one interviews it was found that most of the variables which cause disturbance in students behavior are social, or social psychological, and one's subculture, specific brought up environment, daily hassles and the overall deteriorating conditions of law and order and other factors attributable to institutions play a pivotal role in the development and aggravation of these issues and challenges.","authors":["Najeeb Malik","Ismail Saad"],"meta":["October 2018Journal of Education & Social Sciences 6(2):53-63","DOI:10.20547/jess0621806205"],"references":[]}