{"id":"329665468_Big_Data_Driven_Oriented_Graph_Theory_Aided_tagSNPs_Selection_for_Genetic_Precision_Therapy","abstract":"Recently, the world-wide human genome related projects have been vigorously launched and implemented. Genesequencing techniques play a critical role in disease diagnosis, prediction, population stratification relying on efficiently mining genetic features in the gene pool. Exploring the association between the sites of the genetic mutation and the disease based population classification becomes a hot topic, which beneficially supports disease diagnosis and treatment on the molecular level. However, there are numerous variable sites even on a single chromosome in the human gene pool, and hence the traditional classifiers are not able to dig out all single nucleotide polymorphism (SNP) sites without clearly excavating characteristic SNP sites, termed as tagSNPs, in SNP clusters. By applying big data mining techniques, in this paper, we first of all propose a principal component analysis (PCA) based algorithm for reducing the gene data dimension in order to cluster SNP sites in the low dimensional space. Moreover, an oriented graph theory based tagSNPs selection algorithm is designed. Finally, relying on realworld 1000 Genomes Project dataset, we can achieve fewer tagSNPs than traditional methods by invoking the complete process of our designed SNP classifier.","authors":["Tianshuo Cong","Jingjing Wang","Sanghai Guan","Mu Yifei"],"meta":["December 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2886926"],"references":["325190436_Big_Data_Analytics_Machine_Learning_and_Artificial_Intelligence_in_Next-Generation_Wireless_Networks","321382986_A_Hybrid_Feature_Selection_Method_for_Complex_Diseases_SNPs","311649905_A_Novel_Cardiac_Arrhythmia_Detection_Method_Relying_on_Improved_DTW_Method","326918272_Krishna_Sudarsana_A_Z-Space_Similarity_Measure","313903872_Tag_SNP_Selection_Using_Clonal_Selection_and_Majority_Voting_Algorithms","312519926_New_multilocus_linkage_disequilibrium_measure_for_tag_SNP_selection","308134335_Visibility_Graph_From_Adaptive_Optimal-Kernel_Time-Frequency_Representation_for_Classification_of_Epileptiform_EEG","307534542_Algorithm_AS_136_A_K-means_vlustering_algorithm","301817148_A_Novel_Similarity_Measure_for_Intrusion_Detection_using_Gaussian_Function","220540997_An_Iterative_Algorithm_for_tagSNP_Selection_Based_on_Information_Entropy_Analysis"]}