{"id":"329600914_The_Urgent_Need_of_a_Naturalized_Logic","abstract":"The naturalization of logic aims at a revision of mainstream logic. In this article, I contend it is an urgent task to be completed. This new project will permit a new collaboration between logic and cognitive science. This can be accomplished doing for logic what many decades ago Quine and other philosophers undertook in the case of epistemology. First of all, this article analyzes how the naturalization can be achieved thanks to some insights provided by the recent John Woods’ book Errors of Reasoning: Naturalizing the Logic of Inference; important concepts that regard a naturalized logic are synthetically analyzed: errors (and the problem of fallacies), paradigm creep, third-way reasoning, consequence-having and consequence drawing, agent based reasoning. The article also takes advantage of my own studies, which are aimed both at exculpating the negative fallacious character of abduction (it is the fallacy of the affirming the consequent) and at illustrating the EC-model (Eco-Cognitive model) of it, I have recently proposed. Aiming at encouraging the project of naturalization of logic, the article specifically recommends the increase of logical research on abduction, and emphasizes how current philosophical and logical research on human inferences is indebted towards Charles Sanders Peirce, a philosopher whose importance and modernity are too often underestimated. The final part of the article will introduce an analysis of the importance of the so-called optimization of situatedness, a concept that is necessary to understand that maximization of “abducibility”, which characterizes modern science.","authors":["Lorenzo Magnani"],"meta":["December 2018Philosophies 3(4):44","DOI:10.3390/philosophies3040044"],"references":["313746792_Errors_of_Reasoning_Naturalizing_the_Logic_of_Inference","284595682_Are_Heuristics_Knowledge-Enhancing_Abduction_Models_and_Fictions_in_Science","277670064_Computational_Logic_and_Human_Thinking_-_How_to_be_Artificially_Intelligent","275283019_Is_abduction_ignorance-preserving_Conventions_models_and_fictions_in_science","271645848_Emergence_of_Cooperation_via_Intention_Recognition_Commitment_and_Apology","324429374_Articulating_Reasons_An_Introduction_to_Inferentialism","301753012_Modelling_morality_with_prospective_logic","291605551_The_Practical_Logic_of_Cognitive_Systems","291076695_Visual_Cognition_and_Cognitive_Modeling","290104766_Towards_Modeling_Morality_Computationally_with_Logic_Programming"]}