{"id":"329657796_Descriptive_theory_of_awareness_for_groupware_development","abstract":"People working in a cooperative manner need to be updated on events and informed about other users and their activities in their workspaces in order to collaborate effectively. It is necessary that group members feel they are part of the group, in particular when they are geographically dispersed. This kind of information is called awareness and it is an important research aspect in the computer supported cooperative work and computer supported collaborative learning areas. Supporting awareness has important, if subtle, benefits, such as increasing the effectiveness of collaborative work, fostering social relationships, and improving the general wellbeing of individuals. To create and define awareness mechanisms in collaborative environments supported by computers is a complex process that includes several steps that need to be considered, focused on understanding characteristics of interdependent group work with the objective of designing adequate computer-based technology to support cooperative work processes. However, in the literature it is so difficult to find out a structured method that allow designers to develop collaborative applications centered on awareness aspects. This paper proposes the definition of a framework that could assist groupware engineers to incorporate awareness mechanisms in their developments. This framework has a methodological proposal or set of phases to follow, as well as a taxonomy that includes the awareness information that should be incorporated to improve the collaborative experience. The paper presents a review of several awareness mechanisms, frameworks and uses proposed in the literature from a software engineering perspective, focusing on the aspects to be considered when designing and implementing awareness mechanisms in groupware tools. A descriptive theory of awareness for the purpose of supporting groupware development is thus generated. Finally, a case study is described using the framework proposed.","authors":["César A. Collazos","Francisco Luis Gutiérrez Vela","Jesús Gallardo","Manuel Ortega"],"meta":["December 2019Journal of Ambient Intelligence and Humanized Computing 10(1)","DOI:10.1007/s12652-018-1165-9"],"references":["328803080_How_to_Determine_the_Effectiveness_and_Efficiency_of_Coordination_and_Awareness_Support_Systems","327650836_Ambient_context-based_modeling_for_health_risk_assessment_using_deep_neural_network","325240242_Perspectives_on_engineering_more_usable_context-aware_systems","324664486_A_Design_Framework_for_Awareness_Cues_in_Distributed_Multiplayer_Games","322002434_DSL_for_collaborative_systems_with_awareness","321812604_Ambient_intelligence_middleware_architecture_based_on_awareness-cognition_framework","324867987_Affective_states_in_computer-supported_collaborative_learning_Studying_the_past_to_drive_the_future","324660702_Tangible_Awareness_How_Tangibles_on_Tabletops_Influence_Awareness_of_Each_Other's_Actions","321349892_A_framework_for_the_descriptive_specification_of_awareness_support_in_multimodal_user_interfaces_for_collaborative_activities","321215903_Designing_for_Situation_Awareness_An_Approach_to_User-Centered_Design_Second_Edition","319935167_Investigating_Notifications_and_Awareness_for_Multi-user_Multi-touch_Tabletop_Displays","315369700_A_comprehensive_framework_for_modeling_requirements_of_CSCW_systems","320207773_Customizing_workspace_awareness_by_non-programmers","319770818_Toward_a_theory_of_situation_awareness_in_dynamic_systems_Situation_awareness","315953486_Model-Driven_Software_Engineering_in_Practice_Second_Edition"]}