{"id":"329699399_Between_Innovation_and_Conservation_The_Narrow_Path_of_User_Interface_Design_for_Digital_Scholarly_Editions","abstract":"In 2016, the Edition Visualization Technology (EVT: evt.labcd.unipi.it/) team started the design phase necessary for the development of the next version of this tool aimed at easy publishing of TEI XML-based digital editions: the current version (EVT 1.2), in fact, only supports diplomatic transcriptions linked to the corresponding manuscript images; EVT 2.0 will fully support critical editions encoded according\nto the TEI parallel segmentation method. To reach this goal, a completely new approach based on the AngularJS framework and the MVC (Model View Controller) architectural pattern was necessary because the old architecture, relying on XSLT 2.0 transformations, was no longer flexible enough to meet all the UI and navigation requirements of critical editions. Furthermore, during the design phase we decided that in some cases keeping a layout inspired by traditional printed editions would be a great help for our final users. After a long but interesting development process, a beta version of EVT 2 is out: we believe that the UI layout and solutions we devised are both effective in the short term, for all the projects that will adopt EVT, and a significant contribution to the theoretical discussion revolving around the very\nconcept of DSE.","authors":["Roberto Rosselli Del Turco","Chiara Di Pietro"],"meta":["December 2018","In book: Digital Scholarly Editions as Interfaces (pp.133-163)Chapter: 7Publisher: Institute for Documentology and Scholarly Editing (IDE)","Project: Edition Visualization Technology"],"references":["317268641_After_the_editing_is_done_Designing_a_Graphic_User_Interface_for_digital_editions","264205341_A_Catalogue_of_Digital_Editions","312443397_AngularJS_A_modern_MVC_framework_in_JavaScript","291125836_The_digital_fate_of_the_critical_apparatus","238694756_The_Essential_Guide_to_User_Interface_Design_An_Introduction_to_GUI_Design_Principles_and_Techniques","220781065_Embodied_User_Interfaces_Towards_Invisible_User_Interfaces","213799949_The_Psychology_of_Human-Computer_Interaction","2448807_A_Description_of_the_Model-View-Controller_User_Interface_Paradigm_in_the_Smalltalk-80_System"]}