{"id":"329617174_An_overview_of_deep_learning_in_medical_imaging_focusing_on_MRI","abstract":"What has happened in machine learning lately, and what does it mean for the future of medical image analysis? Machine learning has witnessed a tremendous amount of attention over the last few years. The current boom started around 2009 when so-called deep artificial neural networks began outperforming other established models on a number of important benchmarks. Deep neural networks are now the state-of-the-art machine learning models across a variety of areas, from image analysis to natural language processing, and widely deployed in academia and industry. These developments have a huge potential for medical imaging technology, medical data analysis, medical diagnostics and healthcare in general, slowly being realized. We provide a short overview of recent advances and some associated challenges in machine learning applied to medical image processing and image analysis. As this has become a very broad and fast expanding field we will not survey the entire landscape of applications, but put particular focus on deep learning in MRI.\nOur aim is threefold: (i) give a brief introduction to deep learning with pointers to core references; (ii) indicate how deep learning has been applied to the entire MRI processing chain, from acquisition to image retrieval, from segmentation to disease prediction; (iii) provide a starting point for people interested in experimenting and perhaps contributing to the field of deep learning for medical imaging by pointing out good educational resources, state-of-the-art open-source code, and interesting sources of data and problems related medical imaging.","authors":["Alexander Lundervold","Arvid Lundervold"],"meta":["December 2018Zeitschrift für Medizinische Physik 29(2)","DOI:10.1016/j.zemedi.2018.11.002"],"references":["343695591_Deep_Learning_with_Neural_Networks","334116365_Universal_Language_Model_Fine-tuning_for_Text_Classification","332814678_Bayesian_SegNet_Model_Uncertainty_in_Deep_Convolutional_Encoder-Decoder_Architectures_for_Scene_Understanding","342926842_Predicting_brain_age_with_deep_learning_from_raw_imaging_data_results_in_a_reliable_and_heritable_biomarker","334118357_On_the_Automatic_Generation_of_Medical_Imaging_Reports","333256435_Research_for_practice_Troubling_trends_in_machine-learning_scholarship","332791612_Denoising_Gravitational_Waves_with_Enhanced_Deep_Recurrent_Denoising_Auto-encoders","332077618_DeepQSM_-_using_deep_learning_to_solve_the_dipole_inversion_for_quantitative_susceptibility_mapping","331299499_Blood_vessel_segmentation_algorithms-Review_of_methods_datasets_and_evaluation_metrics","329747212_An_Unsupervised_Learning_Model_for_Deformable_Medical_Image_Registration"]}