{"id":"329631979_Blockchain_and_Internet_of_Things_Opportunities_and_Challenges","abstract":"We are now living in the significant era where technologies are advancing very quickly. Among the leading technologies, Internet of Things or IoT in short is standing at the peak of inflated expectation in the Gartner Hype Cycle [1]. The application of IoT has evolved from home appliances in the smart home environment such as smart tv, smart refrigerator, smart door and has grown into smart building, smart city, smart healthcare, smart industry. We could imagine that everything could go online to cut cost, add value to businesses and increase users convenience. The prediction has been made [2] that there will be 50 Billion IoT devices by 2020.\nAlong the new revolution there has also been threats that significantly warned us if we didn't take security into account some bad things could happen, such as Mirai botnet [3] attacked dyn DNS server by using vulnerable IoT devices which turned smart devices became exploitable or vulnerable devices and named as the weakness link of the network. At the same time another hype among technology communities of using Blockchain Technology to secure the Internet of Things is getting mainstream.\nBlockchain is not a silver bullet to secure Internet of Things, in this paper we will propose an architecture model of using a Blockchain called Hyperledger Fabric to secure the Internet of Things network in a smart classroom scenario and integrated with The Thing Networks (TTN) cloud server and demonstrates the opportunities and challenges of this concept by taking security properties such as confidentiality, integrity, availability and non-repudiation to evaluate the concept.","authors":["Kimheng Sok","Jean-Noel Colin","Kimtho Po"],"meta":["December 2018","DOI:10.1145/3287921.3287933","Conference: the Ninth International Symposium"],"references":["336205625_On_the_security_aspects_of_Internet_of_Things_A_systematic_literature_review","320626951_Casper_the_Friendly_Finality_Gadget","309835552_Blockchain_for_the_Internet_of_Things_a_Systematic_Literature_Review","257918991_The_Computer_for_the_21st_Century","257129267_The_Computer_for_the_21st_Century","228640975_Bitcoin_A_Peer-to-Peer_Electronic_Cash_System","224927728_The_computer_for_the_21st_century"]}