{"id":"329608454_After_Ebola_in_West_Africa_-_Unpredictable_Risks_Preventable_Epidemics","abstract":"Copyright © 2016 Massachusetts Medical Society. All rights reserved. Between December 2013 and April 2016, the largest epidemic of Ebola virus disease (EVD) to date generated more than 28,000 cases and more than 11,000 deaths in the large, mobile populations of Guinea, Liberia, and Sierra Leone. Tracking the rapid rise and slower decline of the West African epidemic has reinforced some common understandings about the epidemiology and control of EVD but has also generated new insights. Despite having more information about the geographic distribution of the disease, the risk of human infection from animals and from survivors of EVD remains unpredictable over a wide area of equatorial Africa. Until human exposure to infection can be anticipated or avoided, future outbreaks will have to be managed with the classic approach to EVD control - extensive surveillance, rapid detection and diagnosis, comprehensive tracing of contacts, prompt patient isolation, supportive clinical care, rigorous efforts to prevent and control infection, safe and dignified burial, and engagement of the community. Empirical and modeling studies conducted during the West African epidemic have shown that large epidemics of EVD are preventable - a rapid response can interrupt transmission and restrict the size of outbreaks, even in densely populated cities. The critical question now is how to ensure that populations and their health services are ready for the next outbreak, wherever it may occur. Health security across Africa and beyond depends on committing resources to both strengthen national health systems and sustain investment in the next generation of vaccines, drugs, and diagnostics.","authors":["Junerlyn Agua-Agum","Benedetta Allegranzi","Archchun Ariyarajah","R Bruce Aylward"],"meta":["August 2016New England Journal of Medicine 375(6)","DOI:10.1056/NEJMsr1513109"],"references":["304350090_Mapping_the_zoonotic_niche_of_Ebola_virus_disease_in_Africa","292407438_Controlling_the_Last_Known_Cluster_of_Ebola_Virus_Disease_-_Liberia_vol_64_500_2015","289554978_Systematic_review_of_the_literature_on_viral_persistence_and_sexual_transmission_from_recovered_Ebola_survivors_Evidence_and_recommendations","282878211_Measuring_the_impact_of_Ebola_control_measures_in_Sierra_Leone","282876593_Ebola_RNA_Persistence_in_Semen_of_Ebola_Virus_Disease_Survivors_-_Preliminary_Report","282853503_Molecular_Evidence_of_Sexual_Transmission_of_Ebola_Virus","281036015_Decreased_Ebola_Transmission_after_Rapid_Response_to_Outbreaks_in_Remote_Areas_Liberia_2014","280586772_Community_Trust_and_the_Ebola_Endgame","279799747_Ebola_Virus_Disease_in_West_Africa_-_The_First_9_Months_of_the_Epidemic_and_Forward_Projections","299372468_Sequelae_of_Ebola_virus_disease_The_emergency_within_the_emergency"]}