{"id":"329601506_Inductive_verification_of_data_model_invariants_in_web_applications_using_first-order_logic","abstract":"Modern software applications store their data in remote cloud servers. Users interact with these applications using web browsers or thin clients running on mobile devices. A key concern for these applications is the correctness of the actions that update the data store, which are triggered by user requests. Considering that modern applications store and manage data for millions (even billions) of users, misuse or loss of user data can have catastrophic consequences. In this paper, we focus on automated discovery of data store bugs in applications that use development frameworks that are RESTful, enforce the Model–View–Controller architecture, and use Object Relational Mapping libraries to manipulate data. We present a formal data model for data stores and data store manipulation in such applications. We have developed a framework for verification of data models via translation to First Order Logic (FOL), followed by automated theorem proving. Due to the undecidability of FOL, this automated approach does not always produce a conclusive answer. We investigate the use of many-sorted logic in data model verification in order to improve the effectiveness of this approach. Many-sorted logic allows us to specify type information explicitly, thus lightening the burden of reasoning about type information during theorem proving. Our experimental results demonstrate that our verification approach is scalable to real-world web applications and is able to detect bugs in them.","authors":["Ivan Bocić","Tevfik Bultan","Nicolás Rosner"],"meta":["June 2019Automated Software Engineering 26(1)","DOI:10.1007/s10515-018-0249-2"],"references":["277679350_VeriCon_Towards_Verifying_Controller_Programs_in_Software-Defined_Networks","266860488_More_SPASS_with_Isabelle_--_Superposition_with_Hard_Sorts_and_Configurable_Simplification","266657659_VeriCon_Towards_Verifying_Controller_Programs_in_Software-Defined_Networks","345715512_Symbolic_Model_Extraction_for_Web_Application_Verification","308857425_Coexecutability_for_Efficient_Verification_of_Data_Model_Updates","305258490_JayHorn_A_Framework_for_Verifying_Java_programs","304286413_Efficient_Data_Model_Verification_with_Many-Sorted_Logic_T","300576535_Automatic_Atomicity_Verification_for_Clients_of_Concurrent_Data_Structures","287146681_DynAlloy_Upgrading_Alloy_with_Actions","266656206_Inductive_verification_of_data_model_invariants_for_web_applications","244954334_A_cookbook_for_using_the_model-view_controller_user_interface_paradigm_in_Smalltalk-80","262364242_Rubicon_Bounded_Verification_of_Web_Applications","262359193_First-Order_Theorem_Proving_and_Vampire","261113262_An_integrated_data_model_verifier_with_property_templates","248594981_Efficient_Incremental_E_-_matching_for_SMT_Solvers"]}