{"id":"329699394_A_Model-Based_Approach_to_Predicting_Graduate-Level_Performance_Using_Indicators_of_Undergraduate-Level_Performance","abstract":"The graduate admissions process is crucial for controlling the quality of higher education, yet, rules-of-thumb and domain-specific experiences often dominate evidence-based approaches. The goal of the present study is to dissect the predictive power of undergraduate performance indicators and their aggregates. We analyze 81 variables in 171 student records from a Bachelor's and a Master's program in Computer Science and employ state-of-the-art methods suitable for high-dimensional data-settings. We consider regression models in combination with variable selection and variable aggregation embedded in a double-layered cross-validation loop. Moreover, bootstrapping is employed to identify the importance of explanatory variables. Critically, the data is not confounded by an admission-induced selection bias, which allows us to obtain an unbiased estimate of the predictive value of undergraduate-level indicators for subsequent performance at the graduate level. Our results show that undergraduate-level performance can explain 54% of the variance in graduate-level performance. Significantly, we unexpectedly identified the third-year grade point average as the most significant explanatory variable, whose influence exceeds the one of grades earned in challenging first-year courses. Analyzing the structure of the undergraduate program shows that it primarily assesses a single set of student abilities. Finally, our results provide a methodological basis for deriving principled guidelines for admissions committees.","authors":["Judith Zimmermann","Kay H Brodersen","Hans Heinimann","Joachim M Buhmann"],"meta":["December 2018"],"references":["276494911_Efficiency_of_Selecting_Important_Variable_for_Longitudinal_Data","313767487_The_varimax_criterion_for_analytic_rotation_in_factor_analysis","289963578_Validity","288906520_Random_forests","280027862_Predicting_success_in_graduate_education","275633800_Success_in_College_The_Role_of_Personal_Qualities_and_Academic_Ability","275276454_Predicting_Success_in_a_Master_of_Information_Science_Degree_Programme","274841394_Response_To_Replicate_or_Not_to_Replicate_Is_That_Schuman's_Question","274232075_Relationship_of_TOEFL_iBTR_scores_to_academic_performance_Some_evidence_from_American_universities","273563102_Comment_Students'_Effort_and_Reward_in_College_Settings"]}