{"id":"329669181_The_role_of_bridge_nodes_between_layers_on_epidemic_spreading","abstract":"Real networks, like the international airport network and the Internet, are composed of interconnected layers (or communities) through a small fraction of nodes that we call here 'bridge nodes'. These nodes are crucial in the spreading of epidemics because they enable the spread the disease to the entire system. In this work we study the effect of the bridge nodes on the susceptible-infected-recovered model in a two layer network with a small fraction r of these nodes. In the dynamical process, we theoretically determine that at criticality and for the limit r → 0, the time t b at which the first bridge node is infected diverges as a power-law with r, while above criticality, it appears a crossover between a logarithmic and a power-law behavior. Additionally, in the steady state at criticality, the fraction of recovered nodes scales with r as a power-law whose exponent can be understood from the finite size cluster distribution at criticality. We also test our model on the real international airline network and show that 'high-degree bridge nodes' reduce the time t b © 2018 The Author(s). Published by IOP Publishing Ltd on behalf of Deutsche Physikalische Gesellschaft and the Institute of Physics.","authors":["L D Valdez","Hênio Henrique Aragão Rêgo","H. Eugene Stanley","Shlomo Havlin"],"meta":["December 2018New Journal of Physics 20(12):125003","DOI:10.1088/1367-2630/aaf3ea","Project: Epidemic Models, Social Model and Cascade of Failures in Networks of Networks"],"references":["324236713_Spontaneous_repulsion_in_the_A_B_0_reaction_on_coupled_networks","323770827_A_primer_on_the_use_of_probability_generating_functions_in_infectious_disease_modeling","307536753_Statistical_physics_of_vaccination","307469293_The_physics_of_spreading_processes_in_multilayer_networks","326444736_Introduction_To_Percolation_Theory","325885170_Resilience_of_networks_with_community_structure_behaves_as_if_under_an_external_field","313414448_A_novel_weight_neighborhood_centrality_algorithm_for_identifying_influential_spreaders_in_complex_networks","311899572_Epidemic_processes_in_complex_networks","311612620_Unification_of_theoretical_approaches_for_epidemic_spreading_on_complex_networks","283471159_Identify_influential_spreaders_in_complex_networks_the_role_of_neighborhood"]}