{"id":"329603581_Soft_Skill_Assessment_in_Higher_Education","abstract":"Soft skills are defined as socio-emotional abilities, important for personal development, social participation, academic and work achievement, and are ideally opposite to specific technical skills. University is today called to adapt to the demands of a complex and mutable labour market, where it is important to support the graduates’ employability and to prepare future professionals who possess, in addition to technical skills, also soft skills. The University of Turin has introduced a theoretical and methodological reflection about soft skills’assessment and development in its students, through the Passport.Unito Project. According to international literature, a model of 12 soft skills was set up (Ben-nett et al., 1999; Heckman & Kautz, 2016): area of task (problem solving and decision making, time and space management, adoption of strategies adequate in tackling the task); area of the self (self-enhancement, emotional self-regulation, enterprise); motivational area (goal orientation, causal attribution, resilience); area of the interpersonal relationships (teamwork, communication, conflict management). The Project considers the development of a soft skills self-assessment tool (PassporTest), aimed at providing a description of the level of the different soft skills in the model. In this study are presented the validation data (exploratory and confirmatory factor analysis, reliability, validity) and the results of a first survey on a large sample of students from different University degree programs (N = 1048). © 2018, Edizioni Universitarie di Lettere Economia Diritto. All rights reserved.","authors":["Ricchiardi Paola","Federica Emanuel"],"meta":["December 2018Journal of Educational Cultural and Psychological Studies (ECPS Journal) 2018(18)","DOI:10.7358/ecps-2018-018-ricc","Project: Passport.Unito"],"references":["317309738_Emotional_Intelligence_EI_A_Therapy_for_Higher_Education_Students","311808335_The_career_decision-making_competence_a_new_construct_for_the_career_realm","307552908_Trait_Emotional_Intelligence_Is_Related_to_Risk_Taking_when_Adolescents_Make_Deliberative_Decisions","303694724_Student_Self-Efficacy_and_Gender-Personality_Interactions","289099918_A_validation_of_the_proactive_personality_scale","282651179_Teachers'_conceptions_of_student_creatvity_in_higher_education","313072234_Policy_and_validity_prospects_for_performance-based_assessment","304377436_Emotional_Intelligence_Why_It_Can_Matter_More_Than_IQ","287648508_Ordinary_magic_Resilience_process_in_development","285109293_Problem-solving_assessment"]}