{"id":"329631982_A_Network_Coding_Based_Information_Spreading_Approach_for_Permissioned_Blockchain_in_IoT_Settings","abstract":"Permissioned Blockchain (PBC) has become a prevalent data structure to ensure that the records are immutable and secure. However, PBC still has significant challenges before it can be realized in different applications. One of such challenges is the overhead of the communication which is required to execute the Byzantine Agreement (BA) protocol that is needed for consensus building. As such, it may not be feasible to implement PBC for resource constrained environments such as Internet-of-Things (IoT). In this paper, we assess the communication overhead of running BA in an IoT environment that consists of wireless nodes (e.g., Raspberry PIs) with meshing capabilities. As the the packet loss ratio is significant and makes BA unfeasible to scale, we propose a network coding based approach that will reduce the packet overhead and minimize the consensus completion time of the BA. Specifically, various network coding approaches are designed as a replacement to TCP protocol which relies on unicasting and acknowledgements. The evaluation on a network of Raspberry PIs demonstrates that our approach can significantly improve scalability making BA feasible for medium size IoT networks.","authors":["Mumin Cebe","Berkay Kaplan","Kemal Akkaya"],"meta":["November 2018","DOI:10.1145/3286978.3286984","Conference: the 15th EAI International Conference"],"references":["324640508_Hyperledger_fabric_a_distributed_operating_system_for_permissioned_blockchains","323694477_Review_of_Blockchain_Technology_and_its_Expectations_Case_of_the_Energy_Sector","322929437_Block4Forensic_An_Integrated_Lightweight_Blockchain_Framework_for_Forensics_Applications_of_Connected_Vehicles","321147639_Blockchain_distributed_ledger_technologies_for_biomedical_and_health_care_applications","318870515_PB-PKI_A_Privacy-aware_Blockchain-based_PKI","318724655_Blockchain_in_Logistics_and_Supply_Chain_Trick_or_Treat","312218574_Blockchain_for_IoT_Security_and_Privacy_The_Case_Study_of_a_Smart_Home","315869370_Proposed_classification_of_blockchains_based_on_authority_and_incentive_dimensions","282375914_An_IoT_electric_business_model_based_on_the_protocol_of_bitcoin","228640975_Bitcoin_A_Peer-to-Peer_Electronic_Cash_System"]}