{"id":"329611941_Romans_1by1_Overview_of_a_Research_Project","abstract":"The current article presents the main scientific results extracted from the Romans 1by1 platform. While the database has been technically documented before, the analyses, based on it, is introduced here for the first time. After gathering and structuring all the prosopographical information on all the people, attested epigraphically in Roman Moesia Inferior, Moesia Superior and Dacia, we are able now to present exhaustive statistics and a comprehensive overview, as well as to get relevant conclusions regarding the epigraphic habits of each province. The database and its purpose The paper is based on the results of a research project, which was carried out between October 2015 and September 2017 at the Babeș-Bolyai University from Cluj-Napoca (Romania). The goal of the project was to create a database for ancient population, in which all the known individuals dating from the Roman period (exhaustively up to the end of the 3 rd c. AD), from the provinces of Dacia and Moesia are recorded. The project aimed at employing new techniques and methodologies that come from other fields (i.e. computer science), in order to approach the study of ancient population in an innovative way, to ease the research, and to create an open access tool, available for the academic community. Being a research database based on a continuous work in progress, we have opted for two versions of the database: a) one which has a restricted access (login via personalized accounts), and which is used only by the research team, due to the fact, that it is continuously updated and reviewed; and b) the other one which is open access and represents the cleansed, standardized and user-friendly version of the first one. 1 The database has been documented before, 2 thus we will only schematically present its architecture and the metadata. The purpose of this article is to present the macro-analyses, resulted from the gathered data-as for the first time all the data, on all the people of these provinces, are structured and available in one place. No doubt, one of the most important advantages, in this case, is the creation of a prosopogra-phical corpus. The corpus can be freely used for scientific purposes by anyone interested in the field, as well as for educational purposes or for disseminating aspects related to ancient history in a wider sector of the public, in an accessible and friendly manner. 1","authors":["Rada Varga","Annamária-Izabella Pázsint","Imola Boda","Dan Augustin Deac"],"meta":["December 2018","Project: Romans 1by1 - romans1by1.com"],"references":["329612018_Romans_1by1_v11_New_developments_in_the_study_of_Roman_population","344832195_Cultul_imperial_in_provincia_Moesia_Inferior_sec_I-III_pChr","294792040_New_Perspectives_on_the_Demography_of_the_Roman_Province_Moesia_Inferior","292516085_The_Roman_Government_of_Britain","278776387_Stele_funeraire_a_banquet_d'un_Palmyrenien_veteran_a_Potaissa_Dacia_superior","241738282_Best_Practices_with_Large_Databases_on_Historical_Populations"]}