{"id":"329662395_PPChecker_Towards_Accessing_the_Trustworthiness_of_Android_Apps'_Privacy_Policies","abstract":"Recent years have witnessed a sharp increase of malicious apps that steal users' personal information. To address users' concerns about privacy risks and to comply with data protection laws, more and more apps are supplied with privacy policies written in natural language to help users to understand an app's privacy practices. However, little is known whether these privacy policies are trustworthy or not. Questionable privacy policies may be prepared by careless app developers or someone with malicious intention. In this paper, we carry out a systematic study on privacy policy by proposing a novel approach to automatically identify five kinds of problems in privacy policy. After tackling several challenging issues, we implement the approach in a system, named PPChecker, and evaluate it with real apps and their privacy policies. The experimental results show that PPChecker can effectively identify questionable privacy policies with high precision. Applying PPChecker to 2,044 popular apps, we find that 1,429 apps (i.e., 69.9\\%) have at least one kind of problems. This study sheds light on the research of improving and regulating apps' privacy policies.","authors":["Le Yu","Xiapu Luo","Jiachi Chen","Hao Zhou"],"meta":["December 2018IEEE Transactions on Software Engineering PP(99):1-1","DOI:10.1109/TSE.2018.2886875"],"references":["325808251_Static_window_transition_graphs_for_Android","341364681_Getting_Started_with_Topic_Modeling_and_MALLET","329638504_GUILeak_tracing_privacy_policy_claims_on_user_input_data_for_Android_applications","326562541_Why_are_Android_apps_removed_from_Google_Play_a_large-scale_empirical_study","323933181_Adaptive_Unpacking_of_Android_Apps","322878679_How_do_Mobile_Apps_Violate_the_Behavioral_Policy_of_Advertisement_Libraries","318409054_UiRef_analysis_of_sensitive_user_inputs_in_Android_applications","316913716_Automated_Analysis_of_Privacy_Requirements_for_Mobile_Apps","316906925_Automatic_Forgery_of_Cryptographically_Consistent_Messages_to_Identify_Security_Vulnerabilities_in_Mobile_Services","315873912_SMARTGEN_Exposing_Server_URLs_of_Mobile_Apps_With_Selective_Symbolic_Execution"]}