{"id":"329698526_On_CCZ-Equivalence_Extended-Affine_Equivalence_and_Function_Twisting","abstract":"Two vectorial Boolean functions are “CCZ-equivalent” if there exists an affine permutation mapping the graph of one to the other. It preserves many of the cryptographic properties of a function such as its differential and Walsh spectra, which is why it could be used by Dillon et al. to find the first APN permutation on an even number of variables. However, the meaning of this form of equivalence remains unclear. In fact, to the best of our knowledge, it is not known how to partition a CCZ-equivalence class into its Extended-Affine (EA) equivalence classes; EA-equivalence being a simple particular case of CCZ-equivalence. In this paper, we characterize CCZ-equivalence as a property of the zeroes in the Walsh spectrum of a function F:F2ⁿ→F2m or, equivalently, of the zeroes in its Difference Distribution Table. We use this framework to show how to efficiently upper bound the number of distinct EA-equivalence classes in a given CCZ-equivalence class. More importantly, we prove that it is possible to go from a specific member of any EA-equivalence class to a specific member of another EA-equivalence class in the same CCZ-equivalence class using an operation called twisting; so that CCZ-equivalence can be reduced to the association of EA-equivalence and twisting. Twisting a function is a simple process and its possibility is equivalent to the existence of a particular decomposition of the function considered. Using this knowledge, we revisit several results from the literature on CCZ-equivalence and show how they can be interpreted in light of our new framework. Our results rely on a new concept, the “thickness” of a space (or linear permutation), which can be of independent interest.","authors":["Anne Canteaut","Léo Perrin"],"meta":["January 2018Finite Fields and Their Applications 56","DOI:10.1016/j.ffa.2018.11.008"],"references":["318927016_Differentially_4-Uniform_Permutations_with_the_Best_Known_Nonlinearity_from_Butterflies","309820197_Equivalences_among_plateaued_APN_functions","228468692_Weight_Divisibility_of_Cyclic_Codes_Highly_Nonlinear_Functions_on_F_2m_and_Crosscorrelation_of_Maximum-Length_Sequences","220679660_On_Almost_Perfect_Nonlinear_Functions_Over_F","220638788_CCZ-equivalence_of_bent_vectorial_functions_and_related_constructions","220638300_Codes_Bent_Functions_and_Permutations_Suitable_For_DES-like_Cryptosystems","23783691_Notes_on_Reed-Muller_Codes","3078989_The_permutation_group_of_affine-invariant_extended_cyclic_codes","2120754_New_Classes_of_Almost_Bent_and_Almost_Perfect_Nonlinear_Polynomials","331483655_On_the_generalization_of_butterfly_structure","314162769_A_generalisation_of_Dillon's_APN_permutation_with_the_best_known_differential_and_nonlinear_properties_for_all_fields_of_size_24k2","313472629_Differentially_uniform_mappings_for_cryptography","283303829_Links_between_differential_and_linear_cryptanalysis","273130028_The_Theory_of_Error-Correcting_Codes","265438233_APN_polynomials_and_related_codes","226173374_Shamir_A_Differential_Cryptanalysis_of_DES-like_Cryptosystems_Journal_of_Cryptology_41_3-72","225584745_Linear_cryptanalysis_method_for_DES_cipher_III","220638984_On_the_classification_of_APN_functions_up_to_dimension_5"]}