{"id":"329606579_A_Unified_Framework_for_Sparse_Relaxed_Regularized_Regression_SR3","abstract":"Regularized regression problems are ubiquitous in statistical modeling, signal processing, and machine learning. Sparse regression in particular has been instrumental in scientific model discovery, including compressed sensing applications, variable selection, and high-dimensional analysis.We propose a broad framework for sparse relaxed regularized regression, called SR3. The key idea is to solve a relaxation of the regularized problem, which has three advantages over the state-of-the-art: (1) solutions of the relaxed problem are superior with respect to errors, false positives, and conditioning, (2) relaxation allows extremely fast algorithms for both convex and nonconvex formulations, and (3) the methods apply to composite regularizers, essential for total variation (TV) as well as sparsity-promoting formulations using tight frames. We demonstrate the advantages of SR3 (computational efficiency, higher accuracy, faster convergence rates, greater flexibility) across a range of regularized regression problems with synthetic and real data, including applications in compressed sensing, LASSO, matrix completion, TV regularization, and group sparsity. Following standards of reproducible research, we also provide a companion Matlab package that implements these examples.","authors":["Peng Zheng","Travis Askham","Steven L. Brunton","J. Nathan Kutz"],"meta":["December 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2886528"],"references":["320754782_New_sufficient_conditions_of_signal_recovery_with_tight_frames_via_l_1-analysis","308412460_Generalized_Kalman_Smoothing_Modeling_and_Algorithms","342800895_Relax-and-split_method_for_nonconvex_inverse_problems","321344873_Proximity_Maps_for_Convex_Sets","312690325_Proximal_splitting_methods_in_signal_processing","312468992_Variable_selection_via_nonconcave_penalized_likelihood_and_its_oracle_properties","312453300_Proximal_algorithms","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","295684084_Computing_the_Proximity_Operator_of_the_ell_p_Norm_with_0_p_1","288927245_An_iterative_regularization_method_for_total_variation-based_image_restoration"]}