{"id":"329625840_Hyper_Dice_Backgammon_of_Finite_Size","abstract":"In this note we extend the notion of the standard backgammon to a more general setting and call it hyper dice backgammon (or HD-gammon for short) of size n ≥ 6 (a positive even integer) by extending the regular die to a hyper die (i.e., hyper cube) with n faces and the board from 24 pips to 4n pips, where n = 2k ≥ 6 with number of checkers for each player is 4k + 3. The rules of the game are similar to the rules of the standard backgammon when n = 2k = 6 and number of the n-sided dice depends on n. We also, in the end, write a selected list of references related to some theoretical studies on the standard backgammon. 1. A Generalization of the Standard Backgammon This note is intended to introduce mathematicians, computer scientists, artificial intelligence (AI) professionals, and game theorists to hyper dice backgammon. Also, we will introduce a new concept in this field. In this section we start with the definition (notion) of the hyper dice backgammon and conclude the section with a question and a motivational comment together with an open problem related to the (infinite) hyper dice backgammon. In the second section, we recall the rules of the standard backgammon with a brief motivational history on complex board games and conclude the paper with a selected list of references related to some theoretical studies on the standard backgammon. Definition 1.1. A hyper die of size n = 2k ≥ 6 is a hyper cube with n faces, where each face (or side) is marked (denoted) by exactly one distinct number from 1 to n. For the sake of convenience, by an n-die (or n-dice for plural case), we mean a hyper die of size n or an n-sided cube. We now extend the notion of the standard (classic) backgammon to a more general setting and call it hyper dice backgammon. Definition 1.2. The hyper dice backgammon (or HD-gammon for short) of size n = 2k ≥ 6 (a positive integer) is defined to be as follows: This research was in part supported by grant no.96130029 from IPM.","authors":["Amir M. Rahimi"],"meta":["December 2018Missouri Journal of Mathematical Sciences 30(02):132-139","DOI:10.35834/mjms/1544151690"],"references":["269008996_Backgammon_the_optimal_strategy_for_the_pure_running_game","263242305_Co-Evolution_in_the_Successful_Learning_of_Backgammon_Strategy","322808208_Temporal_Difference_Learning_and_TD-Gammon","312986214_Some_studies_in_machine_learning_using_the_game_of_checkers","298885781_Efficient_Approximation_of_Backgammon_Race_Equities1","288988289_Improving_Temporal_Difference_Learning_Performance_in_Backgammon_Variants","274200730_Letter_to_the_Editor-A_Comment_on_Optimal_Doubling_in_Backgammon","265768552_Optimal_Doubling_in_Backgammon","263757661_Learning_to_Predict_by_the_Methods_of_Temporal_Differences","250802923_Computer_Backgammon"]}