{"id":"329617268_Using_a_Deep_Learning_Algorithm_and_Integrated_Gradients_Explanation_to_Assist_Grading_for_Diabetic_Retinopathy","abstract":"Purpose: \nTo understand the impact of deep learning diabetic retinopathy (DR) algorithms on physician readers in computer-assisted settings.\n\nDesign: \nEvaluation of diagnostic technology.\n\nParticipants: \nOne thousand seven hundred ninety-six retinal fundus images from 1612 diabetic patients.\n\nMethods: \nTen ophthalmologists (5 general ophthalmologists, 4 retina specialists, 1 retina fellow) read images for DR severity based on the International Clinical Diabetic Retinopathy disease severity scale in each of 3 conditions: unassisted, grades only, or grades plus heatmap. Grades-only assistance comprised a histogram of DR predictions (grades) from a trained deep-learning model. For grades plus heatmap, we additionally showed explanatory heatmaps.\n\nMain outcome measures: \nFor each experiment arm, we computed sensitivity and specificity of each reader and the algorithm for different levels of DR severity against an adjudicated reference standard. We also measured accuracy (exact 5-class level agreement and Cohen's quadratically weighted κ), reader-reported confidence (5-point Likert scale), and grading time.\n\nResults: \nReaders graded more accurately with model assistance than without for the grades-only condition (P < 0.001). Grades plus heatmaps improved accuracy for patients with DR (P < 0.001), but reduced accuracy for patients without DR (P = 0.006). Both forms of assistance increased readers' sensitivity moderate-or-worse DR: unassisted: mean, 79.4% [95% confidence interval (CI), 72.3%-86.5%]; grades only: mean, 87.5% [95% CI, 85.1%-89.9%]; grades plus heatmap: mean, 88.7% [95% CI, 84.9%-92.5%] without a corresponding drop in specificity (unassisted: mean, 96.6% [95% CI, 95.9%-97.4%]; grades only: mean, 96.1% [95% CI, 95.5%-96.7%]; grades plus heatmap: mean, 95.5% [95% CI, 94.8%-96.1%]). Algorithmic assistance increased the accuracy of retina specialists above that of the unassisted reader or model alone; and increased grading confidence and grading time across all readers. For most cases, grades plus heatmap was only as effective as grades only. Over the course of the experiment, grading time decreased across all conditions, although most sharply for grades plus heatmap.\n\nConclusions: \nDeep learning algorithms can improve the accuracy of, and confidence in, DR diagnosis in an assisted read setting. They also may increase grading time, although these effects may be ameliorated with experience.","authors":["Rory Sayres","Ankur Taly","Ehsan Rahimy","Katy Blumer"],"meta":["December 2018Ophthalmology 126(4)","DOI:10.1016/j.ophtha.2018.11.016"],"references":["321325553_Validation_of_automated_screening_for_referable_diabetic_retinopathy_with_the_IDx-DR_device_in_the_Hoorn_Diabetes_Care_System","319415855_Predicting_Cardiovascular_Risk_Factors_from_Retinal_Fundus_Photographs_using_Deep_Learning","318920618_Google_Vizier_A_Service_for_Black-Box_Optimization","322914841_Why_CAD_Failed_in_Mammography","322057595_Interpretable_Explanations_of_Black_Boxes_by_Meaningful_Perturbation","321755280_Development_and_Validation_of_a_Deep_Learning_System_for_Diabetic_Retinopathy_and_Related_Eye_Diseases_Using_Retinal_Images_From_Multiethnic_Populations_With_Diabetes","320223300_Grader_Variability_and_the_Importance_of_Reference_Standards_for_Evaluating_Machine_Learning_Models_for_Diabetic_Retinopathy","320076162_Case_Study_Explaining_Diabetic_Retinopathy_Detection_Deep_CNNs_via_Integrated_Gradients","318575915_Unintended_Consequences_of_Machine_Learning_in_Medicine","317715245_Tele-Ophthalmology_for_Age-Related_Macular_Degeneration_and_Diabetic_Retinopathy_Screening_A_Systematic_Review_and_Meta-Analysis"]}