{"id":"329659323_Near_real-time_agriculture_monitoring_at_national_scale_at_parcel_resolution_Performance_assessment_of_the_Sen2-Agri_automated_system_in_various_cropping_systems_around_the_world","abstract":"The convergence of new EO data flows, new methodological developments and cloud computing infrastructure calls for a paradigm shift in operational agriculture monitoring. The Copernicus Sentinel-2 mission providing a systematic 5-day revisit cycle and free data access opens a completely new avenue for near real-time crop specific monitoring at parcel level over large countries. This research investigated the feasibility to propose methods and to develop an open source system able to generate, at national scale, cloud-free composites, dynamic cropland masks, crop type maps and vegetation status indicators suitable for most cropping systems. The so-called Sen2-Agri system automatically ingests and processes Sentinel-2 and Landsat 8 time series in a seamless way to derive these four products, thanks to streamlined processes based on machine learning algorithms and quality controlled in situ data. It embeds a set of key principles proposed to address the new challenges arising from countrywide 10 m resolution agriculture monitoring. The full-scale demonstration of this system for three entire countries (Ukraine, Mali, South Africa) and five local sites distributed across the world was a major challenge met successfully despite the availability of only one Sentinel-2 satellite in orbit. In situ data were collected for calibration and validation in a timely manner allowing the production of the four Sen2-Agri products over all the demonstration sites. The independent validation of the monthly cropland masks provided for most sites overall accuracy values higher than 90%, and already higher than 80% as early as the mid-season. The crop type maps depicting the 5 main crops for the considered study sites were also successfully validated: overall https://doi. T accuracy values higher than 80% and F1 Scores of the different crop type classes were most often higher than 0.65. These respective results pave the way for countrywide crop specific monitoring system at parcel level bridging the gap between parcel visits and national scale assessment. These full-scale demonstration results clearly highlight the operational agriculture monitoring capacity of the Sen2-Agri system to exploit in near real-time the observation acquired by the Sentinel-2 mission over very large areas. Scaling this open source system on cloud computing infrastructure becomes instrumental to support market transparency while building national monitoring capacity as requested by the AMIS and GEOGLAM G-20 initiatives.","authors":["Pierre Defourny","Sophie Bontemps","Nicolas Bellemans","Cosmin Cara"],"meta":["December 2018Remote Sensing of Environment 221 (2019):551–568","DOI:10.1016/j.rse.2018.11.007","Projects:  Sentinel-2 for Agriculture  Sentinel 2 for Agriculture (sen2agri)"],"references":["323396059_Atmospheric_Correction_Inter-Comparison_Exercise","318237701_Orfeo_ToolBox_open_source_processing_of_remote_sensing_images","306358668_Best_Accuracy_Land_UseLand_Cover_LULC_Classification_to_Derive_Crop_Types_Using_Multitemporal_Multisensor_and_Multi-Polarization_SAR_Satellite_Images","304781984_Towards_a_set_of_agrosystem-specific_cropland_mapping_methods_to_address_the_global_cropland_diversity","304369250_Crop_Monitoring_Based_on_SPOT-5_Take-5_and_Sentinel-1A_Data_for_the_Estimation_of_Crop_Water_Requirements","304357094_COMBINED_ANALYSIS_OF_SENTINEL-1_AND_RAPIDEYE_DATA_FOR_IMPROVED_CROP_TYPE_CLASSIFICATION_AN_EARLY_SEASON_APPROACH_FOR_RAPESEED_AND_CEREALS","298314047_Cropland_Mapping_over_Sahelian_and_Sudanian_Agrosystems_A_Knowledge-Based_Approach_Using_PROBA-V_Time_Series_at_100-m","294260044_A_general_method_to_normalize_Landsat_reflectance_data_to_nadir_BRDF_adjusted_reflectance","290213639_Production_of_a_Dynamic_Cropland_Mask_by_Processing_Remote_Sensing_Image_Series_at_High_Temporal_and_Spatial_Resolutions","326630444_A_comparison_of_global_agricultural_monitoring_systems_and_current_gaps"]}