{"id":"329687430_Quantifying_user_experience_in_using_learning_gamification_website","abstract":"User experience is all about the user (which is why personas are important) because it deals with our users' needs such as learn programming languages course. Currently, all new students always suffering to learn programming languages course in computer science departments. The preliminary investigation has showed that students have experienced ineffective learning, lack of interest towards this course and lack of motivation. In order to encourage user to interact with a learning website, adding game elements such as a challenge. Gamification has to be implemented well and has to be adequate for good user experiences. Previous studies have shown that applying Gamification elements in websites engages users. Gamification refers to the use of game elements in a non-game context to increase engagement between human and computer. Gamification Website was designed based on the gamification framework that has been constructed. This paper is discussing on quantifying user experience in term of usability and motivation in using the learning gamification website. The result of evaluation have shown that the gamification website has good (mean > 4.00) for all usability elements. On the other hand has a positive motivation in students' performance. Finally, the finding of evaluation suggested that gamification website can be used as a motivation tool to promote students learning programming language subject.","authors":["Firas Layth Khaleel","Tengku Siti Meriam Tengku Wook","Noraidah Sahari Ashaari"],"meta":["December 2018Journal of Theoretical and Applied Information Technology 96(23):7783-7793"],"references":["328416420_Wireless_Mesh_Networks_Based_on_MBPSO_Algorithm_to_Improvement_Throughput","323822722_Gamification-based_learning_framework_for_a_programming_course","323818035_Methodology_for_developing_gamification-based_learning_programming_language_framework","319235279_Teaching_and_Learning_Computer_Programming_Using_Gamification_and_Observation_through_Action_Research","316319522_Programming_Learning_Requirements_Based_on_Multi_Perspectives","311859411_Recruitment_and_Job_Search_Application","310830934_Gamification_Elements_for_Learning_Applications","304639660_The_Architecture_of_Dynamic_Gamification_Elements_Based_Learning_Content","304627725_The_study_of_gamification_application_architecture_for_programming_language_course","316600285_Quantifying_the_User_Experience"]}