{"id":"329613236_A_Systematic_Review_of_Ayres_Sensory_Integration_Intervention_for_Children_with_Autism","abstract":"Sensory integration is one of the most highly utilized interventions in autism, however, a lack of consensus exists regarding its evidence base. An increasing number of studies are investigating the effectiveness of this approach. This study used the Council for Exceptional Children (CEC) Standards for Evidence‐based Practices in Special Education to evaluate the effectiveness research from 2006 to 2017 on Ayres Sensory Integration (ASI) intervention for children with autism. A systematic review was conducted in three stages. Stage 1 involved an extensive database search for relevant studies using search terms related to sensory integration and autism, interventions suggesting a sensory integration approach, and high‐quality study designs. Searches yielded 19 studies that were evaluated in Stage 2. Six of these met inclusion criteria of being peer‐reviewed, written in English, description of intervention this is consistent with ASI intervention, and comparison group design or single subject method employed. Prior to analysis using CEC standards, three articles were excluded because intervention details were not consistent with the core principles of ASI, or because of major methodological flaws. In Stage 3, the remaining three studies were rated using the CEC quality indicators and standards for an evidence‐based practice. Two randomized controlled trials respectively met 100% and 85% of the CEC criteria items. One additional study met more than 50% of the criteria. Based on CEC criteria, ASI can be considered an evidence‐based practice for children with autism ages 4–12 years old. Autism Res 2018. © 2018 International Society for Autism Research, Wiley Periodicals, Inc.\n\nLay Summary\nAyres Sensory Integration intervention is one of the most frequently requested and highly utilized interventions in autism. This intervention has specific requirements for therapist qualifications and the process of therapy. This systematic review of studies providing Ayres Sensory Integration therapy to children with autism indicates that it is an evidence‐based practice according to the criteria of the Council for Exceptional Children.","authors":["Sarah Schoen","Shelly J Lane","Zoe Mailloux","Teresa A May-Benson"],"meta":["December 2018Autism Research 12(4)","DOI:10.1002/aur.2046"],"references":["321816139_Efficacy_of_Occupational_Therapy_Using_Ayres_Sensory_Integration_R_A_Systematic_Review","305701841_The_Single-Case_Reporting_Guideline_In_BEhavioural_Interventions_SCRIBE_2016_Statement","304563239_The_Single-Case_Reporting_Guideline_In_BEhavioural_Interventions_SCRIBE_2016_Statement","301316746_The_Single-Case_Reporting_Guideline_In_BEhavioural_Interventions_SCRIBE_2016_statement","301316594_The_Single-Case_Reporting_Guideline_In_BEhavioural_Interventions_SCRIBE_2016_Explanation_and_elaboration","326892114_Evidence-based_practices_for_children_youth_and_young_adults_with_Autism_Spectrum_Disorder_A_comprehensive_Review","322122106_The_Effect_of_Sensory_Integration_Therapy_on_Occupational_Performance_in_Children_With_Autism","317227151_Interventions_Targeting_Sensory_Challenges_in_Autism_Spectrum_Disorder_A_Systematic_Review","302391203_Social_Responsiveness_Scale","284675525_A_pilot_study_comparison_of_sensory_integration_treatment_and_integrated_preschool_activities_for_children_with_autism"]}