{"id":"329784509_Digital_competences_computer_skills_and_information_literacy_in_secondary_education_mapping_and_visualization_of_trends_and_concepts","abstract":"Digital competences, computer skills, information literacy and related abilities represent a crucial element in ICT education (Information and Communication Technologies). They are less frequently investigated in the frame of secondary education than in higher education. We assess these contexts in secondary education through science mapping and visualizing techniques, examining publishing patterns and trends. Databases Web of Science (WOS) and Scopus are used. Publishing exhibits logarithmic inverse relationship between rank and frequency (power laws). Only a few chief publications among hundreds account for an important share of all published research. WOS-based visualizations (VOSviewer software) of concepts used in titles, abstracts and keywords show several clusters of research: computer-, information-, as well as digital-related. Further analysis reveals that the major terms which define these clusters predominate in different periods. Computer-related are earlier terms, followed by information-related, and now digital-related. As some concepts mature terminology embraces more trendy novel concepts. Clusters of co-citing and co-cited sources shows differences among publications. Proceedings play an important role as sources of co-citations but are cited more weakly. Both co-citing and co-cited sources exhibit well defined clusters with little convergence between Library and Information Science on one side and Education and Educational Research, and Computer Science on the other even though the respective publications employ similar terminological concepts. The lack of exchange between these research domains calls for more co-operation in order to boost synergy in these critical twenty-first century skills.","authors":["Karmen Stopar","Tomaž Bartol"],"meta":["December 2018Scientometrics 118(3)","DOI:10.1007/s11192-018-2990-5"],"references":["340375234_Mapping_Digital_Competence_Towards_a_Conceptual_Understanding","319111373_Co-word_analysis_and_thematic_landscapes_in_Spanish_information_science_literature_1985-2014","316153804_Global_research_on_information_literacy_A_bibliometric_analysis_from_2005_to_2014","311573785_Unraveling_the_Digital_Literacy_Paradox_How_Higher_Education_Fails_at_the_Fourth_Literacy","322987902_Information_Literacy_in_the_Workplace_5th_European_Conference_ECIL_2017_Saint_Malo_France_September_18-21_2017_Revised_Selected_Papers","322639362_Mapping_the_literature_structure_of_'quality_in_higher_education'_using_co-word_analysis","322576631_Information_Literacy_Quest_In_Search_of_Graduate_Employability","321585057_Global_analysis_of_the_E-learning_scientific_domain_a_declining_category","320808388_Distribution_features_and_intellectual_structures_of_digital_humanities_A_bibliometric_analysis","314217019_The_relation_between_21st-century_skills_and_digital_skills_A_systematic_literature_review"]}