{"id":"329788661_Application_of_Genetic_Algorithms_for_Finding_Edit_Distance_between_Process_Models","abstract":"Finding graph-edit distance (graph similarity) is an important task in many computer science areas, such as image analysis, machine learning, chemicalinformatics. Recently, with the development of process mining techniques, it became important to adapt and apply existing graph analysis methods to examine process models (annotated graphs) discovered from event data. In particular, finding graph-edit distance techniques can be used to reveal patterns (subprocesses), compare discovered process models. As it was shown experimentally and theoretically justified, exact methods for finding graph-edit distances between discovered process models (and graphs in general) are computationally expensive and can be applied to small models only. In this paper, we present and assess accuracy and performance characteristics of an inexact genetic algorithm applied to find distances between process models discovered from event logs. In particular, we find distances between BPMN (Business Process Model and Notation) models discovered from event logs by using different process discovery algorithms. We show that the genetic algorithm allows us to dramatically reduce the time of comparison and produces results which are close to the optimal solutions (minimal graph edit distances calculated by the exact search algorithm).","authors":["Anna Kalenkova","Danil A. Kolesnikov"],"meta":["December 2018Modeling and Analysis of Information Systems 25(6):711-725","DOI:10.18255/1818-1015-2018-6-711-725"],"references":["3297301_Workflow_Mining_Discovering_Process_Models_from_Event_Logs","312596129_Process_Mining_Data_Science_in_Action","267034411_Improving_Approximate_Graph_Edit_Distance_Using_Genetic_Algorithms","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","222471133_Inexact_graph_matching_using_genetic_search","51986583_Binary_Codes_Capable_of_Correcting_Deletions_Insertions_and_Reversals","3479333_A_Formal_Basis_for_the_Heuristic_Determination_of_Minimum_Cost_Paths"]}