{"id":"329779624_Semi-global_visco-acoustic_full_waveform_inversion","abstract":"Full-waveform inversion deals with estimating physical properties of the earth's subsurface by matching simulated to recorded seismic data. Intrinsic attenuation in the medium leads to the dispersion of propagating waves and the absorption of energy - media with this type of rheology are not perfectly elastic. Accounting for that effect is necessary to simulate wave propagation in realistic geologic media, leading to the need to estimate intrinsic attenuation from the seismic data. That increases the complexity of the constitutive laws leading to additional issues related to the ill-posed nature of the inverse problem. In particular, the joint estimation of several physical properties increases the null space of the parameter space, leading to a larger domain of ambiguity and increasing the number of different models that can equally well explain the data. We have evaluated a method for the joint inversion of velocity and intrinsic attenuation using semiglobal inversion; this combines quantum particle-swarm optimization for the estimation of the intrinsic attenuation with nested gradient-descent iterations for the estimation of the P-wave velocity. This approach takes advantage of the fact that some physical properties, and in particular the intrinsic attenuation, can be represented using a reduced basis, substantially decreasing the dimension of the search space. We determine the feasibility of the method and its robustness to ambiguity with 2D synthetic examples. The 3D inversion of a field data set for a geologic medium with transversely isotropic anisotropy in velocity indicates the feasibility of the method for inverting large-scale real seismic data and improving the data fitting. The principal benefits of the semiglobal multiparameter inversion are the recovery of the intrinsic attenuation from the data and the recovery of the true undispersed infinite-frequency P-wave velocity, while mitigating ambiguity between the estimated parameters.","authors":["Nuno V. da Silva","G. Yao","Michael Warner"],"meta":["December 2018Geophysics 84(2):1-78","DOI:10.1190/geo2017-0773.1"],"references":["328658086_Wave_modeling_in_visco-acoustic_media_with_transverse_isotropy_TI","322630755_Separation_of_Migration_and_Tomography_Modes_of_Full-Waveform_Inversion_in_the_Plane_Wave_Domain","322236166_An_effective_absorbing_layer_for_the_boundary_condition_in_acoustic_seismic_wave_simulation","319933208_Reflection_full_waveform_inversion","311784128_Locally_solving_fractional_Laplacian_viscoacoustic_wave_equation_using_Hermite_distributed_approximating_functional_method","306110378_Three-dimensional_anisotropic_full-waveform_inversion","327349280_Semi-global_inversion_of_Vp_to_Vs_ratio_for_elastic_wavefield_inversion","326653885_Addressing_viscous_effects_in_acoustic_full-waveform_inversion","314990384_Visco-acoustic_Full_Waveform_Inversion","312421021_Impact_of_high-resolution_FWI_in_the_Western_Black_Sea_Revealing_overburden_and_reservoir_complexity"]}