{"id":"3297963_Text_Document_Preprocessing_with_the_Bayes_Formula_for_Classification_Using_the_Support_Vector_Machine","abstract":"This work implements an enhanced hybrid classification method through the utilization of the naïve Bayes classifier and the Support Vector Machine (SVM). In this project, the Bayes formula was used to vectorize (as opposed to classify) a document according to a probability distribution reflecting the probable categories that the document may belong to. The Bayes formula gives a range of probabilities to which the document can be assigned according to a pre determined set of topics such as those found in the \"20 newsgroups\" dataset for instance. Using this probability distribution as the vectors to represent the document, the SVM can then be used to classify the documents on a multi  dimensional level. The effects of an inadvertent dimensionality reduction caused by classifying using only the highest probability using the naïve Bayes classifier can be overcome using the SVM by employing all the probability values associated with every category for each document. This method can be used for any dataset and shows a significant reduction in training time as compared to the LSquare method and significant improvement in classification accuracy when compared to pure naïve Bayes systems and also the TF-IDF/SVM hybrids.","authors":["Dino Isa","Lam Hong Lee","Vish P Kallimani","Rajprasad Rajkumar"],"meta":["October 2008IEEE Transactions on Knowledge and Data Engineering 20(9):1264-1272","DOI:10.1109/TKDE.2008.76","SourceIEEE Xplore"],"references":["306150595_Neural_Networks_A_Comprehensive_Foundation","304425264_A_Tutorial_on_Support_Vector_Machines_for_Pattern_Recognition","288942943_Support_vector_machines","285278428_Text_Categorization_with_Support_Vector_Machines_Learning_with_Many_Relevant_Features","278651717_The_Nature_of_Statistical_Learning_Theory","270034913_Book_Review_The_Nature_of_Statistical_Learning_Theory","265811050_A_Simple_Introduction_to_Support_Vector_Machines","243769112_A_Text_Categorization_Perspective_for_Ontology_Mapping","243763580_The_Nature_Of_Statistical_Learning_Theory","238674425_Text_Categorization_Using_Weight_Adjusted_k-Nearest_Neighbor_Classica_tion"]}