{"id":"329752129_Impact-Seismic_Investigations_of_the_InSight_Mission","abstract":"Impact investigations will be an important aspect of the InSight mission. One of the scientific goals of the mission is a measurement of the current impact rate at Mars. Impacts will additionally inform the major goal of investigating the interior structure of Mars.\nIn this paper, we review the current state of knowledge about seismic signals from impacts on the Earth, Moon, and laboratory experiments. We describe the generalized physical models that can be used to explain these signals. A discussion of the appropriate source time function for impacts is presented, along with spectral characteristics including the cutoff frequency and its dependence on impact momentum. Estimates of the seismic efficiency (ratio between seismic and impact energies) vary widely. Our preferred value for the seismic efficiency at Mars is 5×10−4\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$5 \\times 10^{- 4}$\\end{document}, which we recommend using until we can measure it during the InSight mission, when seismic moments are not used directly. Effects of the material properties at the impact point and at the seismometer location are considered. We also discuss the processes by which airbursts and acoustic waves emanate from bolides, and the feasibility of detecting such signals.\nWe then consider the case of impacts on Mars. A review is given of the current knowledge of present-day cratering on Mars: the current impact rate, characteristics of those impactors such as velocity and directions, and the morphologies of the craters those impactors create. Several methods of scaling crater size to impact energy are presented. The Martian atmosphere, although thin, will cause fragmentation of impactors, with implications for the resulting seismic signals.\nWe also benchmark several different seismic modeling codes to be used in analysis of impact detections, and those codes are used to explore the seismic amplitude of impact-induced signals as a function of distance from the impact site. We predict a measurement of the current impact flux will be possible within the timeframe of the prime mission (one Mars year) with the detection of ∼ a few to several tens of impacts. However, the error bars on these predictions are large.\nSpecific to the InSight mission, we list discriminators of seismic signals from impacts that will be used to distinguish them from marsquakes. We describe the role of the InSight Impacts Science Theme Group during mission operations, including a plan for possible night-time meteor imaging. The impacts detected by these methods during the InSight mission will be used to improve interior structure models, measure the seismic efficiency, and calculate the size frequency distribution of current impacts.","authors":["Ingrid J Daubar","Philippe Lognonné","Nicholas A. Teanby","Katarina Miljkovic"],"meta":["December 2018Space Science Reviews 214(8)","DOI:10.1007/s11214-018-0562-x","Projects: InSight mission on MarsInSight"],"references":["331604745_Recently_Formed_Crater_Clusters_on_Mars","330695935_SEIS_Insight's_Seismic_Experiment_for_Internal_Structure_of_Mars","329716672_Pre-mission_InSights_on_the_Interior_of_Mars","327311503_The_Color_Cameras_on_the_InSight_Lander","327194361_A_Pre-Landing_Assessment_of_Regolith_Properties_at_the_InSight_Landing_Site","325998973_Geology_and_Physical_Properties_Investigations_by_the_InSight_Lander","323799637_Planetary_Seismology","334413308_Bolide_Airbursts_as_a_Seismic_Source_for_the_2018_Mars_InSight_Mission","328988328_Meteor_Impact_Detection_on_Mars_with_Change_Detection_Framework","326453215_Magnitude_Scales_for_Marsquakes","320710143_The_colour_and_stereo_surface_imaging_system_CaSSIS_for_the_ExoMars_Trace_Gas_Orbiter","318713613_Analysis_of_Regolith_Properties_Using_Seismic_Signals_Generated_by_InSight's_HP3_Penetrator","323434528_Present-Day_Mars'_Seismicity_Predicted_From_3-D_Thermal_Evolution_Models_of_Interior_Dynamics","322780217_Martian_cratering_12_Utilizing_primary_crater_clusters_to_study_crater_populations_and_meteoroid_properties","320545133_Empirical_Recurrence_Rates_for_Ground_Motion_Signals_on_Planetary_Surfaces"]}