{"id":"3297301_Workflow_Mining_Discovering_Process_Models_from_Event_Logs","abstract":"Contemporary workflow management systems are driven by explicit process models, i.e., a completely specified workflow design is required in order to enact a given workflow process. Creating a workflow design is a complicated time-consuming process and, typically, there are discrepancies between the actual workflow processes and the processes as perceived by the management. Therefore, we have developed techniques for discovering workflow models. The starting point for such techniques is a so-called \"workflow log\" containing information about the workflow process as it is actually being executed. We present a new algorithm to extract a process model from such a log and represent it in terms of a Petri net. However, we also demonstrate that it is not possible to discover arbitrary workflow processes. We explore a class of workflow processes that can be discovered. We show that the α-algorithm can successfully mine any workflow represented by a so-called SWF-net.","authors":["Wil Van der Aalst","A. J. M. M. Weijters","Laura Măruşter"],"meta":["October 2004IEEE Transactions on Knowledge and Data Engineering 16(9):1128 - 1142","DOI:10.1109/TKDE.2004.47","SourceIEEE Xplore"],"references":["279896778_Rediscovering_Workflow_Models_from_Event-Based_Data_using_Little_Thumb","261313258_Workflow-based_process_monitoring_and_controlling-technical_and_organizational_issues","229125175_Decomposing_Event_Sequences_into_Independent_Components","313570462_Inductive_inference_DFAs_and_computational_complexity","285842809_Petri_Nets_Properties_Analysis_and_Applications","251442367_ARIS_Process_Performance_Manager_ARIS_PPM_Measure_Analyze_and_Optimize_Your_BusinessProcess_Performance_whitepaper","243766928_Process_Mining_elektronischer_Geschaftsprozesse","238719283_Business_Process_Management_Models_Techniquesand_Empirical_Studies","235949938_Staffware_Process_Monitor_SPM","235949933_Workflow_Handbook_2001_Workflow_Management_Coalition"]}