{"id":"329781212_Impact_of_Overcrowded_Classroom_on_Academic_Performance_of_Students_in_Selected_Public_Secondary_Schools_in_Surelere_Local_Government_of_Lagos_State","abstract":"The study examined the impact of crowded classroom on academic performance of public secondary schools students in Surulere Local Government, Lagos State. It specifically investigated the factors responsible for over-crowding of classroom. It also examined the relationship between overcrowding of classroom students attitude and behaviour. It assessed the effect of overcrowding on teaching and learning. It hypothesized if overcrowding had significant effect on academic achievement of students as well as examined the relationship between overcrowding of classroom and general standard of education. The population for this study consisted of all the teachers and students in public secondary schools in Surulere Local Government area of Lagos State. A total of thirty (30) students and (10) teachers were randomly selected from four selected four schools. One Hundred and sixty (160) students, forty (40) per school were selected for the study. Both primary and secondary sources of data were used to gather information for the study. The information obtained was then analyzed using descriptive and inferential statistics. The result revealed that 97.3% of the respondents were of the opinion that there was shortage of infrastructural facilities due to overcrowding of classrooms. The analysis also indicated that overcrowding of classroom significantly influenced behavioural attitude of students to their studies. It also showed that overcrowding of classrooms significantly affect effective teaching and learning. The analysis further indicated that overcrowding of classroom negatively affected academic performance of students, being the major factor responsible for poor performance of students in public schools. The study concluded that overcrowding of classroom had significantly influence on student’s behavioural attitude of students to their studies.","authors":["Favour Olaleye","A Ajayi","Blessed Olalekan Oyebola"],"meta":["January 2017"],"references":["11137416_Microcomputers_for_education_in_the_developing_world"]}