{"id":"329724562_Persistent-Homology-Based_Machine_Learning_and_Its_Applications_--_A_Survey","abstract":"A suitable feature representation that can both preserve the data intrinsic information and reduce data complexity and dimensionality is key to the performance of machine learning models. Deeply rooted in algebraic topology, persistent homology (PH) provides a delicate balance between data simplification and intrinsic structure characterization, and has been applied to various areas successfully. However, the combination of PH and machine learning has been hindered greatly by three challenges, namely topological representation of data, PH-based distance measurements or metrics, and PH-based feature representation. With the development of topological data analysis, progresses have been made on all these three problems, but widely scattered in different literatures. In this paper, we provide a systematical review of PH and PH-based supervised and unsupervised models from a computational perspective. Our emphasis is the recent development of mathematical models and tools, including PH softwares and PH-based functions, feature representations, kernels, and similarity models. Essentially, this paper can work as a roadmap for the practical application of PH-based machine learning tools. Further, we consider different topological feature representations in different machine learning models, and investigate their impacts on the protein secondary structure classification.","authors":["Chi Seng Pun","Kelin Xia","Si Xian Lee"],"meta":["December 2018SSRN Electronic Journal","DOI:10.2139/ssrn.3275996"],"references":["350338846_A_Sparse_Learning_Approach_to_Relative-Volatility-Managed_Portfolio_Selection","329365789_Persistence_Diagrams_with_Linear_Machine_Learning_Models","327053111_Mathematical_deep_learning_for_pose_and_binding_affinity_prediction_and_ranking_in_D3R_Grand_Challenges","320667956_A_Study_on_Topological_Descriptors_for_the_Analysis_of_3D_Surface_Texture","320389647_Signal_classification_with_a_point_process_distance_on_the_space_of_persistence_diagrams","327606791_Classification_And_Regression_Trees","327197906_A_Linear_Programming_Model_for_Selection_of_Sparse_High-Dimensional_Multiperiod_Portfolios","323410946_Persistent_homology_analysis_of_ion_aggregation_and_hydrogen-bonding_network","321768518_Quantitative_Toxicity_Prediction_Using_Topology_Based_Multitask_Deep_Neural_Networks","319433776_Analysis_and_prediction_of_protein_folding_energy_changes_upon_mutation_by_element_specific_persistent_homology"]}