{"id":"329702020_A_Corpus-assisted_Discourse_Analysis_of_Music-related_Practices_Discussed_within_Chipmusicorg","abstract":"This study examined discussion forum posts within a website dedicated to a medium and genre of music (chiptunes) with potential for music-centered making, a phrase I use to describe maker culture practices that revolve around music-related purposes. Three research questions guided this study: (1) What chiptune-related practices did members of chipmusic.org discuss between December 30th, 2009 and November 13th, 2017? (2) What do chipmusic.org discussion forum posts reveal about the multidisciplinary aspects of chiptunes? (3) What import might music-centered making evident within chipmusic.org discussion forum posts hold for music education? To address these research questions, I engaged in corpus-assisted discourse analysis tools and techniques to reveal and analyze patterns of discourse within 245,098 discussion forum posts within chipmusic.org. The analysis cycle consisted of (a) using corpus analysis techniques to reveal patterns of discourse across and within data consisting of 10,892,645 words, and (b) using discourse analysis techniques for a close reading of revealed patterns.\n\nFindings revealed seven interconnected themes of chiptune-related practices: (a) composition practices, (b) performance practices, (c) maker practices, (d) coding practices, (e) entrepreneurial practices, (f), visual art practices, and (g) community practices. Members of chipmusic.org primarily discussed composing and performing chiptunes on a variety of instruments, as well as through retro computer and video game hardware. Members also discussed modifying and creating hardware and software for a multitude of electronic devices. Some members engaged in entrepreneurial practices to promote, sell, buy, and trade with other members. Throughout each of the revealed themes, members engaged in visual art practices, as well as community practices such as collective learning, collaborating, constructive criticism, competitive events, and collective efficacy.\n\nFindings suggest the revealed themes incorporated practices from a multitude of academic disciplines or fields of study for music-related purposes. However, I argue that many of the music-related practices people discussed within chipmusic.org are not apparent within music education discourse, curricula, or standards. I call for an expansion of music education discourse and practices to include additional ways of being musical through practices that might borrow from multiple academic disciplines or fields of study for music-related purposes.","authors":["Jared O'Leary"],"meta":["December 2018","DOI:10.13140/RG.2.2.19291.82725","Thesis for: PhD in Music EducationAdvisor: Evan Tobias and Roger Mantie"],"references":["330332667_Playing_with_Sound_A_Theory_of_Interacting_with_Sound_and_Music_in_Video_Games","325701621_Making_Grooves_with_Needles_Using_e-textiles_to_Encourage_Gender_Diversity_in_Embedded_Audio_Systems_Design","325548182_People_Means_and_Activities_A_Conceptual_Framework_for_Realizing_the_Educational_Potential_of_Makerspaces","347982991_DJ_Skills_The_essential_guide_to_Mixing_and_Scratching","346949327_Unified_Discourse_Analysis_Language_reality_virtual_worlds_and_video_games","345929424_Engineering_Design_Of_Musical_Instruments_As_A_Context_For_Math_Physics_And_Technical_Writing_In_A_Freshman_Learning_Community_Course","328741184_Integrating_Computational_Thinking_with_a_Music_Education_Context","325705982_We_Are_Not_All_Makers_The_Paradox_of_Plurality_In_The_Maker_Movement","325317137_Making_Learners_A_Framework_for_Evaluating_Making_in_STEM_Education","325032267_Space_to_Share_Interactions_Among_Music_Teachers_in_an_Online_Community_of_Practice","324783054_Re-engaging_the_Body_and_Gesture_in_Musical_Live_Coding","319249776_Makerspace_in_STEM_for_girls_a_physical_space_to_develop_twenty-first-century_skills","318360369_Making_and_breaking_in_an_art_education_makerspace","318426132_Using_Program_Music_for_Interdisciplinary_Study_In_an_interdisciplinary_program_for_preservice_elementary_teachers_music_serves_as_the_focal_point_for_one_of_their_projects","316823281_Self-efficacy_the_exercise_of_control"]}