{"id":"329711536_The_characteristics_of_geographical_information_systems_in_terms_of_their_current_use","abstract":"From the beginning of human existence, man collected and analysed information about the space that surrounded him. Nowadays, due to the huge amount of data, it would be impossible without geographic information systems. According to the definition, the main function of GIS (Geographic Information Systems) is to collect, process, integrate, analyse and present data directly collected in the database or obtained through analysis. The basis of each information system’s functioning is the collection of relevant data about real-world objects, in terms of their completeness, quality and reliability. Due to the very rapid development of information technology, GIS systems have found a wide application, eg. in spatial planning, real estate management, administration, infrastructure management and many other areas of life. The authors within the article have made a detailed review of the current using of GIS, with particular emphasis on the mining industry. In the latter, particular attention was focused on the use of this type of tools to monitor and analyse the effects of mining activities. At the same time, the authors indicated new possibilities related to the application of geographic information systems in this branch.","authors":["Aleksandra Mierzejowska","Monika Żogała"],"meta":["December 2018Journal of Water and Land Development 39(1):101-108","DOI:10.2478/jwld-2018-0064"],"references":["327158584_The_Adoption_of_the_Arcgis_System_to_Support_the_Analyses_of_the_Influence_of_the_Mining_Tremors_on_the_Building_Objects","321128991_Projekty_GIS_Administracja_i_uzytkowanie","310829161_Wykorzystanie_programu_ArcGIS_w_analizach_funkcjonowania_transportu_miejskiego_na_przykladzie_komunikacji_publicznej_w_Gdansku","309489442_ZASTOSOWANIE_TECHNOLOGII_GIS_W_LOKALIZACJI_STANOWISK_ARCHEOLOGICZNYCH_PODCZAS_PROSPEKCJI_TERENOWEJ_APPLICATION_OF_GIS_TECHNOLOGY_IN_LOCATION_OF_ARCHAEOLOGICAL_SITES_DURING_FIELD_SURVEY","272620790_System_informacji_przestrzennej_jako_narzedzie_podejmowania_decyzji_w_gminach-badania_wsrod_pracownikow_urzedow_miast_Lodzkiego_Obszaru_Metropolitalnego","266195153_GIs_w_Nauce","44335326_Analytical_and_computer_cartography_Keith_C_Clarke"]}