{"id":"329772569_Clustered_or_scattered_The_impact_of_habitat_fragmentation_on_establishment_and_early_spread","abstract":"The match between the environmental conditions of an introduction area and the preferences of an introduced species is the first prerequisite for establishment. Yet, introduction areas are usually landscapes, i.e. heterogeneous sets of habitats that are more or less favourable to the introduced species. Because individuals are able to disperse after their introduction, the quality of the habitat surrounding the introduction site is as critical to the persistence of introduced populations as the quality of the introduction site itself. Moreover, demographic mechanisms such as Allee effects or dispersal mortality can hamper dispersal and affect spread across the landscape, in interaction with the spatial distribution of favourable habitat patches. In this study, we investigate the impact of the spatial distribution of heterogeneous quality habitats on establishment and early spread. First, we simulated introductions in one-dimensional landscapes for different dispersal rates and either dispersal mortality or Allee effects. The landscapes differed by the distribution of favourable and less favourable habitats, which were either clustered into few large aggregates of the same quality or scattered into multiple smaller ones. Second, we tested the predictions of simulations by performing experimental introductions of hymenopteran parasitoids (Trichogramma chilonis) in \"clustered\" and \"scattered\" microcosm landscapes. Results highlighted two impacts of the clustering of favourable habitat: by decreasing the risks of dispersal from the introduction site to unfavourable habitat early during the invasion, it increased establishment success. However, by increasing the distance between favourable habitat patches, it also hindered the subsequent spread of introduced species over larger areas.","authors":["Thibaut Morel-Journel","Maud Hautier","Elodie Vercken","Ludovic Mailleret"],"meta":["October 2018"],"references":["320542180_Invasion_pinning_in_a_periodically_fragmented_habitat","315497997_A_modeling_framework_for_the_establishment_and_spread_of_invasive_species_in_heterogeneous_environments","281672625_The_highs_and_lows_of_dispersal_How_connectivity_and_initial_population_size_jointly_shape_establishment_dynamics_in_discrete_landscapes","324326787_Principles_of_Animal_Ecology","313020877_Rapid_evolution_of_dispersal_ability_makes_biological_invasions_faster_and_more_variable","313018524_Rapid_trait_evolution_drives_increased_speed_and_variance_in_experimental_range_expansions","312453530_Landscape_Ecology_in_Theory_and_Practice","308490324_Invasion_in_patchy_landscapes_is_affected_by_dispersal_mortality_and_mate-finding_failure","286335777_Stochastic_population_dynamics_in_ecology_and_conservation_Oxford_University_Press","285623487_Comparative_evaluation_of_experimental_approaches_to_the_study_of_habitat_fragmentation_effects"]}