{"id":"329857976_Social_Network_Rumor_Diffusion_Predication_Based_on_Equal_Responsibility_Game_Model","abstract":"Because billions of mobile phones build a bridge between mobile sensor networks and social networks, the content of a rumor is diffused faster than ever. Therefore, rumor diffusion becomes an important issue in those two networks and how to predicate rumor diffusion becomes more important in handling rumors when they cause a little impact at the beginning. However, the state-of-the-art diffusion models focus on the macroscopic group impact and ignore the microcosmic individual impact. Therefore, they are not suitable to perform the rumor diffusion predication in the condition of only one rumor spreader at the beginning stage of rumor diffusion. To solve that problem and predicate the rumor diffusion process, we propose a novel game theory based model, called Equal Responsibility Rumor Diffusion Game Model (ERRDGM), to simulate the rumor diffusion process. In this model, we first depict the diffusion process as a game between the individuals and their neighbors who choose to retweet or not according to their diffusion game revenues; secondly, the players will share the responsibility of diffusing a rumor in calculating their game revenues; finally, when the game reaches the Nash equilibrium state, we build the rumor diffusion predication graph which indicates the diffusion scale and network structure of rumor diffusion in a social network. According to this idea, our ERRDGM model can capture the diffusion impact of microcosmic individuals and enable us to perform the rumor diffusion process when there are only a few rumor spreaders at the beginning stage of rumor diffusion. Our experiment results indicate that our ERRDGM model can give a more accurate rumor diffusion predication results not only from the diffusion scale but also from the social network structure.","authors":["Dazhen Lin","Ben Ma","Min Jiang","Naixue Xiong"],"meta":["December 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2889074"],"references":["301455688_Rumor_Spreading_Modeling_Profusion_versus_Scarcity","262170458_A_new_rumor_propagation_model_and_control_strategy_on_social_networks","257866651_An_epidemic_model_of_rumor_diffusion_in_online_social_networks","234139130_Twitter_Under_Crisis_Can_we_trust_what_we_RT","45926348_A_Game_Theoretical_Approach_to_Modeling_Information_Dissemination_in_Social_Networks","323649207_The_spread_of_true_and_false_news_online","313121282_Effect_of_rumor_propagation_on_stock_market_dynamics_using_cellular_automata","312507136_Competitive_Rumor_Spread_in_Social_Networks","310820677_A_Novel_Agent-Based_Rumor_Spreading_Model_in_Twitter","301476535_Rumor_diffusion_purpose_analysis_from_social_attribute_to_social_content","282852546_How_Information_Snowballs_Exploring_the_Role_of_Exposure_in_Online_Rumor_Propagation","282852370_Keeping_Up_with_the_Tweet-dashians_The_Impact_of_'Official'_Accounts_on_Online_Rumoring","261961401_The_multi_agent_based_information_diffusion_model_for_false_rumordiffusion_analysis","240566039_Rumor_and_Public_Opinion","231063599_A_media_information_analysis_for_implementing_effective_countermeasure_against_harmful_rumor","221615552_A_study_of_rumor_control_strategies_on_social_networks","220747378_Design_of_a_Trust_Model_and_Finding_Key-Nodes_in_Rumor_Spreading_Based_on_Monte-Carlo_Method","31437601_A_Psychology_of_Rumor","5670174_A_rumor_transmission_model_with_various_contact_interactions"]}