{"id":"329815238_Experiential_Learning_in_Bioinformatics_-_Learner_Support_for_Complex_Workflow_Modelling_and_Analysis","abstract":"Bioinformatics is focused on deriving biological understanding from large amounts of data with specialized skills and computational tools. Students, who wish to pursue a career as a bioinformatician, are required to have a good understanding in biology and computer science. One of the challenging areas for a student learning in bioinformatics is complex workflow modelling and analysis; it incorporates several threshold concepts and liminal spaces for student learning, which demands higher levels of cognitive skills, active exploration and reflective reinforcement in student learning. Hence, proper learning material and interactive tools are required to support student learning through active exploration and experiential learning. The study presents the successful use of such a learner support tool, BioWorkflow [1], we developed to be used in bioinformatics teaching and research. An evaluation was done with a student sample (n=80), where the first group (n1=40) was given only the relevant course material and the second group (n2=40) was given the course material along with BioWorkflow to visualize concepts relevant to sequence alignment and workflow modelling. Better learning engagement during the experiment, better performance at advanced questions and a positive user response were observed from the students who used BioWorkflow tool, compared to the control group. Student feedback strongly supported the fact that tools similar to BioWorkflow are an essential element for enhancing teaching and learner support in bioinformatics; students appreciated the tool usability and its help obtained for scoring high grades at the assessment.","authors":["Vijini Mallawaarachchi","Anuradha Wickramarachchi","Anuradha Welivita","Indika Perera"],"meta":["December 2018International Journal of Emerging Technologies in Learning (iJET) 13(12):19-34","DOI:10.3991/ijet.v13i12.8608","Projects: Bio-Health InformaticsAn Interactive Workflow Solution to Support Bioinformatics Analyses"],"references":["345061095_Biopipe_A_Lightweight_System_Enabling_Comparison_of_Bioinformatics_Tools_and_Workflows","322406982_Assessing_an_effective_undergraduate_module_teaching_applied_bioinformatics_to_biology_students","321986530_An_Interactive_Workflow_Generator_to_Support_Bioinformatics_Analysis_Through_GPU_Acceleration","320512078_Unmet_needs_for_analyzing_biological_big_data_A_survey_of_704_NSF_principal_investigators","282954083_Volition","281931799_Simulated_Interactive_Research_Experiments_as_Educational_Tools_for_Advanced_Science","269185493_A_Survey_of_Scholarly_Literature_Describing_the_Field_of_Bioinformatics_Education_and_Bioinformatics_Educational_Research","235701029_Experiential_Learning_Experience_As_The_Source_Of_Learning_And_Development","309524854_Effective_Educational_Videos_Principles_and_Guidelines_for_Maximizing_Student_Learning_from_Video_Content","275586892_The_Synthesis_Map_Is_a_Multidimensional_Educational_Tool_That_Provides_Insight_into_Students'_Mental_Models_and_Promotes_Students'_Synthetic_Knowledge_Generation"]}