{"id":"329819703_A_multitask_bi-directional_RNN_model_for_named_entity_recognition_on_Chinese_electronic_medical_records","abstract":"Background\nElectronic Medical Record (EMR) comprises patients’ medical information gathered by medical stuff for providing better health care. Named Entity Recognition (NER) is a sub-field of information extraction aimed at identifying specific entity terms such as disease, test, symptom, genes etc. NER can be a relief for healthcare providers and medical specialists to extract useful information automatically and avoid unnecessary and unrelated information in EMR. However, limited resources of available EMR pose a great challenge for mining entity terms. Therefore, a multitask bi-directional RNN model is proposed here as a potential solution of data augmentation to enhance NER performance with limited data.\n\nMethods\nA multitask bi-directional RNN model is proposed for extracting entity terms from Chinese EMR. The proposed model can be divided into a shared layer and a task specific layer. Firstly, vector representation of each word is obtained as a concatenation of word embedding and character embedding. Then Bi-directional RNN is used to extract context information from sentence. After that, all these layers are shared by two different task layers, namely the parts-of-speech tagging task layer and the named entity recognition task layer. These two tasks layers are trained alternatively so that the knowledge learned from named entity recognition task can be enhanced by the knowledge gained from parts-of-speech tagging task.\n\nResults\nThe performance of our proposed model has been evaluated in terms of micro average F-score, macro average F-score and accuracy. It is observed that the proposed model outperforms the baseline model in all cases. For instance, experimental results conducted on the discharge summaries show that the micro average F-score and the macro average F-score are improved by 2.41% point and 4.16% point, respectively, and the overall accuracy is improved by 5.66% point.\n\nConclusions\nIn this paper, a novel multitask bi-directional RNN model is proposed for improving the performance of named entity recognition in EMR. Evaluation results using real datasets demonstrate the effectiveness of the proposed model.","authors":["Shanta Chowdhury","Xishuang Dong","Lijun Qian","Xiangfang Li"],"meta":["December 2018BMC Bioinformatics 19(S17)","DOI:10.1186/s12859-018-2467-9"],"references":["323664116_Deep_learning_with_word_embeddings_improves_biomedical_named_entity_recognition","314232058_Named_Entity_Recognition_in_Swedish_Health_Records_with_Character-Based_Deep_Bidirectional_LSTMs","312571645_ML-CNN_A_novel_deep_learning_based_disease_named_entity_recognition_architecture","309738361_Building_a_comprehensive_syntactic_and_semantic_corpus_of_Chinese_clinical_texts","309572627_Towards_Deep_Learning_in_Hindi_NER_An_approach_to_tackle_the_Labelled_Data_Sparsity","305695642_A_Convolutional_Neural_Network_Model_for_Online_Medical_Guidance","321897425_Transfer_bi-directional_LSTM_RNN_for_named_entity_recognition_in_Chinese_electronic_medical_records","318721204_A_Survey_on_Multi-Task_Learning","310622391_A_multiclass_classification_method_based_on_deep_learning_for_named_entity_recognition_in_electronic_medical_records","306093774_Achieving_Open_Vocabulary_Neural_Machine_Translation_with_Hybrid_Word-Character_Models"]}