{"id":"329816443_Organizacao_de_recursos_bibliograficos_e_multimidia_na_web_contribuicoes_interdisciplinares","abstract":"Introdução: O artigo elucida a fertilização cruzada de tecnologias, teorias e metodologias interdisciplinares endereçada ao processo de construção de modelos ontológicos de qualidade centrados no usuário e destinados à representação de recursos bibliográficos e multimídia na Web. Objetivo: Apresentar as interlocuções de disciplinas seminais à área da organização da informação e do conhecimento oriundas dos campos da Ciência da Informação e da Ciência da Computação mostrando, em especial, o avanço contínuo da catalogação descritiva para ambientes de informações digitais, propiciando, assim, melhorias nos sistemas de recuperação da informação. Metodologia: A pesquisa foi delineada a partir de um levantamento bibliográfico e documental à luz de literatura específica, buscando explorar, descrever e explicar o fenômeno presente no campo da realidade documental em ambientes digitais. Resultados: O panorama atual concernente à representação de documentos bibliográficos e multimídia na Web indica a participação efetiva de dois campos de conhecimento – a Ciência da Informação e a Ciência da Computação – juntamente com suas disciplinas e princípios teóricos e metodológicos imprescindíveis para a evolução dos metadados às anotações semânticas. Conclusões: Os produtos e processos da organização e representação da informação e do conhecimento apresentados e discutidos no artigo mostraram a importância histórica e interdisciplinar de disciplinas fundadoras bem como tecnológicas no progresso da área de tratamento da informação. Tais disciplinas, como a representação descritiva, representação temática e modelagem conceitual contribuem sobremaneira com seus princípios teóricos e metodológicos no processo de construção de modelos ontológicos destinados a representar semanticamente documentos de natureza bibliográfica e multimídia na Web.","authors":["Daniela Lucas da Silva Lemos","Renato Rocha Souza"],"meta":["September 2018Informação & Informação 23(2):98","DOI:10.5433/1981-8920.2018v23n2p98"],"references":["334619962_Modelos_de_anotacao_para_representacao_de_documentos_uma_proposta_ontologica_para_o_dominio_de_anotacao_multimidia","311775899_Europeana_no_Linked_Open_Data_conceitos_de_Web_Semantica_na_dimensao_aplicada_das_Humanidades_Digitais","285929806_Fundamentals_of_Knowledge_Organization","256441144_Revisiting_Ontologies_A_Necessary_Clarification","251341842_Ontology_and_Information_Systems","329931718_The_Intellectual_Foundation_of_Information_Organization","319393666_Modern_Information_Retrieval","294380663_Knowledge_organization_Its_scope_and_possibilities","290053495_Ontologies_Taxonomies_and_Thesauri_in_Systems_Science_and_Systematics","271263447_Annual_Review_of_Information_Science_and_Technology_Book_Review","245584936_WonderWeb_Deliverable_D18_Ontology_Library","240602491_Thesauri_taxonomies_and_ontologies_-_An_etymological_note","238742296_A_importancia_de_Ontologias_de_Fundamentacao_para_a_Engenharia_de_Ontologias_de_Dominio_o_caso_do_dominio_de_Processos_de_Software","247695563_Systems_of_Knowledge_Organization_for_Digital_Libraries_Beyond_Traditional_Authority_Files","237024553_REPRESENTACAO_DO_CONHECIMENTO_NA_PERSPECTIVA_DA_CIENCIA_DA_INFORMACAO_EM_TEMPO_E_ESPACO_DIGITAIS"]}