{"id":"329817207_Analysis_of_Factors_Associated_to_the_Enrollment_and_Demand_of_Computing-Related_Careers","abstract":"Despite the great need for computer-related career professionals, some universities that offer specialties to develop professionals with knowledge to cover the mention need, present a decrease in enrollment, which can cause a wide variety of problems. That is why in this paper we set out to investigate what the main factors that directly or indirectly affect student enrollment in computer-related careers are, to establish a literature-based starting point, and to help select the best possible strategy to improve enrollment. To reach this goal, we did a documentary research, categorizing each one of the factors with its respective analysis. In the results, we explain several challenges that educators face, due to the evolution of society needs, two of them are: teaching-learning models and technology; besides, it became evident that the relevance of this academic programs remain available since there is a high demand for these professionals in Mexico, as well as in the world; finally, we showed some intrinsic and extrinsic motivational factors that have an essential relevance at the time that a student chooses the career to study. On the other hand, we reflected that the perception of everything that involves the study of a Computing-related career is a factor to be considered in the selection of an educational program of higher education. This study could be a reference for universities that are facing decreasing enrollment concerns. In conclusion, we analyzed and identified the main factors that have an impact on the demand for a career related to engineering, providing possible lines of action for increasing school enrollment.","authors":["Walter Mata","Sergio Tobon"],"meta":["December 2018","DOI:10.3390/socsci8010001","Project: Formación por competencias y TIC para la educación"],"references":["327651095_Cross-national_comparison_of_gender_differences_in_the_enrollment_in_and_completion_of_science_technology_engineering_and_mathematics_Massive_Open_Online_Courses","327468426_Essential_axes_of_knowledge_society_and_socioformation","327352929_O_problema_das_matriculas_escolares_uma_discussao_sobre_a_melhoria_das_regras_utilizadas_em_Sao_Paulo","349878609_Proyeccion_de_Matricula_para_el_Analisis_de_la_Infraestructura_de_Programas_Academicos_en_Via_de_Acreditacion","344818273_High-Enrollment_Mechanical_Engineering_Programs_Meeting_the_Challenge_of_Career_Advising_Through_a_Seminar_Course","344811840_Board_93_Ten_Ways_Academic_Libraries_Can_Help_their_Departments_Increase_Retention_of_Women_Engineering_Students","344540474_An_Interdisciplinary_Strategy_for_Improving_Enrollments_in_ET_Programs","327338115_The_effect_of_birth_order_on_the_probability_of_university_enrolment","327312652_Enrollment_and_degree_completion_in_higher_education_without_admission_standards","326395523_Assessing_and_responding_to_the_growth_of_computer_science_undergraduate_enrollments"]}