{"id":"329817344_The_Internet_of_Things_A_Review_of_Enabled_Technologies_and_Future_Challenges","abstract":"The Internet of Things (IoT) is an emerging classical model, envisioned as a system of billions of small interconnected devices for posing state-of-the-art findings to real world glitches. Over the last decade, there has been an increasing research concentration in the IoT as an essential design of the constant convergence between human behaviors and theirs images on the Information Technology. With the development of technologies, the IoT drives the deployment of across-the-board and self-organizing wireless networks. The IoT model is progressing towards the notion of a cyber-physical world where things can be originated, driven, intermixed, and modernized to facilitate the emergence of any feasible association. This paper provides a summary of the existing IoT research that underline enabling technologies, such as fog computing, wireless sensor networks (WSNs), data mining, context awareness, real-time analytics, virtual reality, and cellular communications. Also, we present the lessons learned after acquiring a thorough representation of the subject. Thus, by identifying numerous open research challenges, it is presumed to drag more consideration into this novel paradigm.","authors":["Ikram Ud Din","Mohsen Guizani","Suhaidi Hassan","Byung-Seo Kim"],"meta":["December 2018IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2886601","Projects: Smart MicrogridsComputer Science and EngineeringArtificial IntelligenceSmart CitiesFuture Internet ArchitecturesCaching strategy for Information-Centric NetworkingData ScienceIoT-Blockchain Digital Trust"],"references":["337242257_Information-Centric_Network-Based_Vehicular_Communications_Overview_and_Research_Opportunities","329567113_Big_Data_Using_SMART_Big_Data_Analytics_and_Metrics_To_Make_Better_Decisions_and_Improve_Performance","328894422_Trust_Management_Techniques_for_the_Internet_of_Things_A_Survey","323310219_Green_Massive_Traffic_Offloading_for_Cyber-Physical_Systems_over_Heterogeneous_Cellular_Networks","323059293_How_Can_Heterogeneous_Internet_of_Things_Build_Our_Future_A_Survey","333308666_Smart_Cities_in_Europe_and_the_ALMA_Logistics_Project","329631979_Blockchain_and_Internet_of_Things_Opportunities_and_Challenges","328378542_Knowledge_discovery_from_data_streams","323410896_Information_and_Communications_Technologies_for_Sustainable_Development_Goals_State-of-the-Art_Needs_and_Perspectives","322040200_Caching_in_Information-Centric_Networking_Strategies_Challenges_and_Future_Research_Directions"]}