{"id":"329876077_Cosine-Transform-Based_Chaotic_System_for_Image_Encryption","abstract":"Chaos is known as a natural candidate for cryptography applications owing to its properties such as unpredictability and initial state sensitivity. However, certain chaos-based cryptosystems have been proven to exhibit various security defects because their used chaotic maps do not have complex dynamical behaviors. To address this problem, this paper introduces a cosine-transform-based chaotic system (CTBCS). Using two chaotic maps as seed maps, the CTBCS can produce chaotic maps with complex dynamical behaviors. For illustration, we produce three chaotic maps using the CTBCS and analyze their chaos complexity. Using one of the generated chaotic maps, we further propose an image encryption scheme. The encryption scheme uses high-efficiency scrambling to separate adjacent pixels and employs random order substitution to spread a small change in the plain-image to all pixels of the cipher-image. The performance evaluation demonstrates that the chaotic maps generated by the CTBCS exhibit substantially more complicated chaotic behaviors than the existing ones. The simulation results indicate the reliability of the proposed image encryption scheme. Moreover, the security analysis demonstrates that the proposed image encryption scheme provides a higher level of security than several advanced image encryption schemes.","authors":["Zhongyun Hua","Yicong Zhou","Hejiao Huang"],"meta":["December 2018Information Sciences 480","DOI:10.1016/j.ins.2018.12.048"],"references":["345648723_Double-image_compression_and_encryption_algorithm_based_on_co-sparse_representation_and_random_pixel_exchanging","330047385_Modified_integral_imaging_reconstruction_and_encryption_using_an_improved_SR_reconstruction_algorithm","323827708_2D_Logistic-Sine-Coupling_Map_for_Image_Encryption","322171306_Error-free_holographic_frames_encryption_with_CA_pixel-permutation_encoding_algorithm","322090239_Designing_permutation-substitution_image_encryption_networks_with_Henon_map","320890967_Cryptanalyzing_an_Image_Encryption_Algorithm_Based_on_Autoblocking_and_Electrocardiography","320229438_Medical_image_encryption_using_high-speed_scrambling_and_pixel_adaptive_diffusion","319401178_A_novel_bit-level_image_encryption_algorithm_based_on_2D-LICM_hyperchaotic_map","318975239_Sine-Transform-Based_Chaotic_System_with_FPGA_Implementation","318848358_Cryptanalyzing_an_Image-Scrambling_Encryption_Algorithm_of_Pixel_Bits"]}