{"id":"329867922_Benders_Decomposition_for_Very_Large_Scale_Partial_Set_Covering_and_Maximal_Covering_Location_Problems","abstract":"Covering problems constitute a fundamental family of facility location problems. This paper introduces a new exact algorithm for two important members of this family: (i) the maximal covering location problem (MCLP), which requires finding a subset of facilities that maximizes the amount of customer demand covered while respecting a budget constraint on the cost of the facilities; and (ii) the partial set covering location problem (PSCLP), which minimizes the cost of the open facilities while forcing a certain amount of customer demand to be covered. We study an effective decomposition approach to the two problems based on the branch-and-Benders-cut reformulation. Our new approach is designed for the realistic case in which the number of customers is much larger than the number of potential facility locations. We report the results of a series of computational experiments demonstrating that, thanks to this decomposition techniques, optimal solutions can be found very quickly for some benchmark instances with one hundred potential facility locations and involving up to 15 and 40 million customer demand points for the MCLP and the PSCLP, respectively.","authors":["Jean-François Cordeau","Fabio Furini","Ivana Ljubic"],"meta":["December 2018European Journal of Operational Research 275(3)","DOI:10.1016/j.ejor.2018.12.021"],"references":["304187587_Redesigning_Benders_Decomposition_for_Large-Scale_Facility_Location","300913847_Covering_Location_Problems","297720991_Benders_decomposition_without_separability_A_computational_study_for_capacitated_facility_location_problems","325468060_Two_New_Location_Covering_Problems_The_Partial_P_-Center_Problem_and_the_Partial_Set_Covering_Problem","325408841_Facet_separation_with_one_linear_program","312580792_The_Location_of_Emergency_Service_Facilities","308004625_Intelligent-Guided_Adaptive_Search_for_the_Maximum_Covering_Location_Problem","301325872_Optimum_distribution_of_switching_centers_in_a_communication_network_and_some_related_group_theoretic_problems","286524960_Maximal_Coverage_Location_Problem_Impacts_Significance_and_Evolution","280743478_The_Maximal_Covering_Location_Problem"]}