{"id":"329898820_Qn_Quality_and_Quantity_Based_Unified_Approach_for_Secure_and_Trustworthy_Mobile_Crowdsensing","abstract":"A major challenge in mobile Crowdsensing is the generation of false contributions which induce loss of revenue owing to undue incentivization, and also affect the operational reliability of the applications. To counter these, we propose an event-trust and user-reputation model, called QnQ, to segregate different user classes such as honest, selfish, or malicious. The resultant user reputation scores, are based on both ‘quality’ (accuracy of contribution) and ‘quantity’ (degree of participation) of their contributions. Specifically, QnQ exploits a rating feedback mechanism for evaluating an event-specific expected truthfulness, which is then transformed into a robust quality of information (QoI) metric. Eventually, the QoIs of various events in which a user has participated are aggregated to compute his reputation score, which is then used to judiciously disburse incentives with a goal to reduce the incentive losses of the CS application. Subsequently, we propose a risk tolerance and reputation aware decision scheme to accurately determine whether an event should be published or not. To evaluate QnQ experimentally, we consider a vehicular crowdsensing application as a proof-of-concept. Experimental results demonstrate that QnQ is able to better capture subtle differences in user behaviors based on both quality and quantity, reduces incentive losses and significantly improves operational accuracy in presence of rogue contribution.","authors":["Shameek Bhattacharjee","Nirnay Ghosh","Vijay K. Shah","Sajal K. Das"],"meta":["December 2018IEEE Transactions on Mobile Computing PP(99):1-1","DOI:10.1109/TMC.2018.2889458"],"references":["321320514_QnQ_A_Reputation_Model_to_Secure_Mobile_Crowdsourcing_Applications_from_Incentive_Losses","319176781_An_Incentive_Mechanism_Integrating_Joint_Power_Channel_and_Link_Management_for_Social-Aware_D2D_Content_Sharing_and_Proactive_Caching","318829984_A_Trust-based_Mixture_of_Gaussian_Processes_Model_for_Reliable_Regression_in_Participatory_Sensing","316722073_W2Q_A_dual_weighted_QoI_scoring_mechanism_in_social_sensing_using_community_confidence","305674072_Enhancing_Reliability_of_Vehicular_Participatory_Sensing_Network_A_Bayesian_Approach","325670738_Multiphase_mixed-effects_models_for_repeated_measures_data","319022388_A_Secure_Mobile_Crowdsensing_Game_With_Deep_Reinforcement_Learning","317557430_Data_Quality_Guided_Incentive_Mechanism_Design_for_Crowdsensing","308845738_Providing_long-term_participation_incentive_in_participatory_sensing","304358731_Defending_against_Sybil_Devices_in_Crowdsourced_Mapping_Services"]}