{"id":"329985182_Security_Challenges_and_Solutions_in_theInternet_of_Things","abstract":"The Internet of Things (IoT) concept is emerging and evolving rapidly. Various technical solutions for multiple purposes have been proposed for its implementation. The rapid evolution and utilization of IoT technologies has raised security concerns and created a feeling of uncertainty among IoT adopters. The purpose of this article is to examine the current research trends related to security concerns of the IoT concept and provide a detailed understanding of the topic. We thus applied two types of literature reviews as the methodological approach. The manual systematic mapping study was performed over 3500 articles, out of which 38 were selected for a closer examination. Out of these articles, the concerns, solutions and research gaps for the security in the IoT concept were extracted. This mapping study identified 9 main concerns and 11 solutions. The findings also revealed challenges, such as secure privacy management and cloud integration that still require efficient solutions. The results of the manual systematic mapping study were extended by using automatic content analysis tools on two datasets (–2016 and –2018) from Web of Science. This content analysis produces trends over the years on IoT security.","authors":["Jari Porras","Jayden Khakurel","Antti Knutas","Jouni Pänkäläinen"],"meta":["December 2018Nordic and Baltic Journal of Information and Communications Technologies 2018(1):177-206","DOI:10.13052/nbjict1902-097X.2018.010"],"references":["323912995_Internet_of_Things_Security_a_top-down_survey","323378452_Security_In_The_Internet_Of_Things_-_A_Systematic_Mapping_Study","320971295_A_Systematic_Mapping_Study_on_Modeling_for_Industry_40","319332148_Tapping_into_the_Wearable_Device_Revolution_in_the_Work_Environment_A_systematic_review","319279867_Security_and_privacy_in_the_internet_of_things","313112342_Internet_of_Things_IoT_in_5G_Wireless_Communications","309662613_The_Internet_of_Things_and_the_explosion_of_interconnectivity","336573400_Systematic_Mapping_Studies_in_Software_Engineering","307695672_Security_and_privacy_grand_challenges_for_the_Internet_of_Things","305909328_Security_challenges_of_the_internet_of_things"]}