{"id":"329944687_ALT_SINIR_TEMELINE_DAYALI_AGIRLIKLI_TAVLAMA_YONTEMI_ILE_KUTULAMA_PROBLEMININ_COZUMU_SOLUTION_OF_BIN_PACKING_PROBLEM_WITH_WEIGHTED_ANNEALING_METHOD_BASED_ON_LOWER_BOUND","abstract":"Background\nThe bin packing problem, which is a combinatorial optimization problem with some similarities with the classical knapsack problems, is defined in different forms such as stock-cutting, vehicle loading, air cargo loading, container loading, scheduling, knapsack problem depending on the application being discussed. The bin packing problem, which is the problem of how to best locate the objects with the least usable length, area or volume, is classified as one, two or three dimensional according to the number of dimensions used. Regardless of the size of the bin packing problem, the solution is a non-polynomial NP-hard problem. This problem is confronted in many areas such as logistics, textile, and computer science in real life. While there are exact solutions for small scale problems, it is not possible to find an exact solution for large scale problems. Heuristic methods such as genetic algorithms, simulated annealing, weighted simulated annealing, tabu search are the most used solution approaches in the literature to obtain optimal or near optimal solutions for large scale problems.\nResearch Problem\nIn this study, one-dimensional bin-packing problem is considered where it is aimed to place objects in a single dimension with a minimum length within a certain length in one dimensional bin packing problems. \nMethodology\nIn this study, a new two-stage, heuristic and hybrid solution method is presented for one dimensional bin packing problem. A heuristic initial solution algorithm based on the lower bound is used to create the initial solution. \nAs the second stage of the problem solution phase, weights were assigned to the elements together with the weighted annealing method and the initial solutions were rearranged using swapping operations. Along with the weighted annealing and swapping operations, fewer number of bins have been used than the total number of bins used for the initial solution. In this study, Swap (1,0), Swap (1,1) and Swap (1,2) algorithms are used as swapping operations. \nLiterature Review\nFor the one dimensional bin-packing problem, a similar two-stage solution method is used by Loh et al (2006) where the initial solutions are obtained by using first fit decreasing, a weighted annealing method is used with swapping operations whereas Swap(2,2) is also used. In our study, the point of origin is to show that better results in a shorter time could be obtained than the results given in Loh et al (2006).\nResults and Conclusions\nThe test sets in the literature are solved, the resolution times and the results obtained are compared with the best known solution in the literature and other developed methods. In comparisons with Loh et al (2006), it has been observed that the proposed heuristic method achieves the solutions in a shorter time. In addition, two solutions of the solved test set yielded better solutions than the best known solution of Loh et al (2006). In this context, the analysis suggested that the proposed two-stage, heuristic and hybrid solution approach is a promising approach. As a further study, this method can be investigated for two-dimensional and three-dimensional bin packing problems. In addition, it may contribute to the development of a new perspective in the research studies on the solutions of combinatorial problems such as traveling salesman problem, knapsack problem, maximum satisfaction problem and vehicle routing problem.","authors":["Neriman İnak","Sezai Tokat","Kenan Karagül"],"meta":["December 2018Mehmet Akif Ersoy Üniversitesi İktisadi ve İdari Bilimler Fakültesi Dergisi 5(3):549-567","DOI:10.30798/makuiibf.414467"],"references":["314657529_Optimization_of_heterogeneous_Bin_packing_using_adaptive_genetic_algorithm","308543745_A_Novel_Grouping_Genetic_Algorithm_for_the_One-Dimensional_Bin_Packing_Problem_on_GPU","303883169_Activities_planning_and_resource_assignment_on_multi-place_hospital_system_Exact_and_approach_methods_adapted_from_the_bin_packing_problem","289000475_An_Analogy_between_Bin_Packing_Problem_and_Permutation_Problem_A_New_Encoding_Scheme","266478800_A_Linear_Programming_Approach_to_the_Cutting_Stock_Problem_I","265461353_A_Linear_Programming_Approach_to_the_Cutting_Stock_Problem-Part_II","320112138_A_review_on_application_of_1D_2D_and_3D_bin_packing_Techniquies","301742582_Bin_Packing_and_Cutting_Stock_Problems_Mathematical_Models_and_Exact_Algorithms","281800632_Algorithms_for_Knapsack_Problems","277069147_Weight_Annealing_Heuristics_for_Solving_Bin_Packing_and_other_Combinatorial_Optimization_Problems_Concepts_Algorithms_and_Computational_Results","238836618_A_New_Linear_Programming_Approach_to_the_Cutting_Stock_Problem","265366886_An_Introduction_to_Variable_Neighborhood_Search","263047822_A_Decomposition_Principle_for_Linear_Programs","258052654_Bin_Packing_and_Related_Problems_General_Arc-flow_Formulation_with_Graph_Compression","244959789_A_New_Lower_Bound_for_the_Bin-Packing_Problem_and_Its_Integration_Into_MTP"]}