{"id":"329977676_Live_Programming_in_Practice_a_Controlled_Experiment_on_State_Machines_for_Robotic_Behaviors","abstract":"Context: Live programming environments are gaining momentum across multiple programming languages. A tenet of live programming is a development feedback cycle, resulting in faster development practices. Although practitioners of live programming consider it a positive inclusion in their workflow, no in-depth investigations have yet been conducted on its benefits in a realistic scenario, nor using complex API. Objective: This paper carefully studies the advantage of using live programming in defining nested state machines for robot behaviors. We analyzed two important aspects of developing robotic behaviors using these machines: program comprehension and program writing. We analyzed both development practices in terms of speed and accuracy. Method: We conducted two controlled experiments, one for program comprehension and another for program writing. We measured the speed and accuracy of randomized assigned participants on completing programming tasks, against a baseline. Results: In a robotic behavior context, we found that a live programming system for nested state machine programs does not significantly outperform a non-live language in program comprehension nor in program writing in terms of speed and accuracy. However, the feedback of test subjects indicates their preference for the live programming system. Conclusions: The results of this work seem to contradict the studies of live programming in other areas, even while participants still favor using live programming techniques. We learned that the complex API chosen in this work has a strong negative influence on the results. To the best of our knowledge, this is the first in-depth live programming experiment in a complex domain.","authors":["Miguel Campusano","Johan Fabry","Alexandre Bergel"],"meta":["December 2018Information and Software Technology 108","DOI:10.1016/j.infsof.2018.12.008","Project: Live Robot Programming"],"references":["325730367_The_road_to_live_programming_insights_from_the_practice","261151702_A_CASE_Tool_for_Robot_Behavior_Development","232715328_RobotML_a_Domain-Specific_Language_to_Design_Simulate_and_Deploy_Robotic_Applications","318494157_Real-time_programming_and_the_big_ideas_of_computational_literacy","304531584_Live_Robot_Programming_The_Language_its_Implementation_and_Robot_API_Independence","289876669_Live_Robot_Programming","279355975_Experimentation_in_Software_Engineering","271545217_How_live_coding_affects_developers'_coding_behavior","233881999_ROS_an_open-source_Robot_Operating_System","224204236_The_SMACH_high-level_executive"]}