{"id":"329981952_Computacao_Desplugada_Um_Mapeamento_Sistematico_da_Literatura_Nacional","abstract":"Diante da eminente necessidade de ensinar Ciência da Computação no ensino básico e das dificuldades enfrentadas no seu processo de ensino e aprendizagem, nos últimos anos uma série de estudos têm usado uma estratégia conhecida por Computação Desplugada. No entanto, diversos questionamentos têm sido feitos, por exemplo: i) em quais níveis de ensino a Computação Desplugada tem sido trabalhada?; ii) quais atividades de Computação Desplugada têm sido implementadas?; e iii) como as pesquisas em Computação Desplugada têm sido avaliadas? No intuito de responder essas questões, esse artigo apresenta os resultados de um Mapeamento Sistemático da Literatura sobre Computação Desplugada no Brasil. Os principais resultados indicam que a maioria das abordagens baseiam-se nas atividades do livro “Computer Science Unplugged” e se concentram entre os níveis de ensino fundamental e médio, bem como, é notável a falta de estudos estatísticos sobre a Computação Desplugada no âmbito nacional.","authors":["Wilk Oliveira","Fernando Carvalho Silva","Lucas Hinterholz","Seiji Isotani"],"meta":["December 2018RENOTE 16(2)","DOI:10.22456/1679-1916.89241","Project: Licenciatura em Computação como Curso Formador de Profissionais para Atuação em Informática na Educação Básica"],"references":["320970271_Aprendizagem_Baseada_em_Projetos_Relato_de_Introducao_da_Logica_no_Ensino_Fundamental","320970163_Licenciatura_em_Computacao_Desafios_e_Oportunidades_na_Perspectiva_do_Estudante","320963974_Licenciatura_em_Computacao_Desafios_e_Oportunidades_na_Perspectiva_do_Professor","299666357_Proposta_de_Atividades_para_o_Desenvolvimento_do_Pensamento_Computacional_no_Ensino_Fundamental","280601823_Relato_de_Experiencia_de_Ensino_de_Computacao_no_Ensino_Fundamental_em_Estagio_Supervisionado_da_Universidade_de_Pernambuco_no_Campus_Garanhuns","274309848_Computational_Thinking","228756057_Procedures_for_Performing_Systematic_Reviews","220420371_Computational_thinking","342645618_Base_Nacional_Comum_Curricular","279355975_Experimentation_in_Software_Engineering"]}