{"id":"329941610_Ultra-Low-Dose_18_F-Florbetaben_Amyloid_PET_Imaging_Using_Deep_Learning_with_Multi-Contrast_MRI_Inputs","abstract":"Purpose To reduce radiotracer requirements for amyloid PET/MRI without sacrificing diagnostic quality by using deep learning methods. Materials and Methods Forty data sets from 39 patients (mean age ± standard deviation [SD], 67 years ± 8), including 16 male patients and 23 female patients (mean age, 66 years ± 6 and 68 years ± 9, respectively), who underwent simultaneous amyloid (fluorine 18 [18F]-florbetaben) PET/MRI examinations were acquired from March 2016 through October 2017 and retrospectively analyzed. One hundredth of the raw list-mode PET data were randomly chosen to simulate a low-dose (1%) acquisition. Convolutional neural networks were implemented with low-dose PET and multiple MR images (PET-plus-MR model) or with low-dose PET alone (PET-only) as inputs to predict full-dose PET images. Quality of the synthesized images was evaluated while Bland-Altman plots assessed the agreement of regional standard uptake value ratios (SUVRs) between image types. Two readers scored image quality on a five-point scale (5 = excellent) and determined amyloid status (positive or negative). Statistical analyses were carried out to assess the difference of image quality metrics and reader agreement and to determine confidence intervals (CIs) for reading results. Results The synthesized images (especially from the PET-plus-MR model) showed marked improvement on all quality metrics compared with the low-dose image. All PET-plus-MR images scored 3 or higher, with proportions of images rated greater than 3 similar to those for the full-dose images (-10% difference [eight of 80 readings], 95% CI: -15%, -5%). Accuracy for amyloid status was high (71 of 80 readings [89%]) and similar to intrareader reproducibility of full-dose images (73 of 80 [91%]). The PET-plus-MR model also had the smallest mean and variance for SUVR difference to full-dose images. Conclusion Simultaneously acquired MRI and ultra-low-dose PET data can be used to synthesize full-dose-like amyloid PET images. © RSNA, 2018 Online supplemental material is available for this article. See also the editorial by Catana in this issue.","authors":["Kevin T. Chen","Enhao Gong","Fabiola Macruz","Junshen Xu"],"meta":["December 2018Radiology 290(3):180940","DOI:10.1148/radiol.2018180940"],"references":["313212083_Low-Dose_CT_With_a_Residual_Encoder-Decoder_Convolutional_Neural_Network","323647599_MR-assisted_PET_motion_correction_in_simultaneous_PETMRI_studies_of_dementia_subjects_MR-Assisted_PET_Motion_correction","319916613_Deep_Learning_MR_Imaging-based_Attenuation_Correction_for_PETMR_Imaging","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","318560383_Prospective_motion_correction_using_coil-mounted_cameras_Cross-calibration_considerations_Prospective_Motion_Correction_Using_Coil-Mounted_Cameras","318027918_Deep_Auto-context_Convolutional_Neural_Networks_for_Standard-Dose_PET_Image_Estimation_from_Low-Dose_PETMRI","315187326_Deep_Learning_in_Medical_Image_Analysis","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","307527093_The_antibody_aducanumab_reduces_Ab_plaques_in_Alzheimer's_disease","296635125_Towards_tracer_dose_reduction_in_PET_studies_Simulation_of_dose_reduction_by_retrospective_randomized_undersampling_of_list-mode_data"]}