{"id":"329926875_NUMEROS_INTEIROS_E_DECIMAIS_UMA_ABORDAGEM_DOS_CONTEUDOS_DE_MATEMATICA_POR_MEIO_DE_UM_JOGO_FRENTE_AS_DIFICULDADES_DO_CENARIO_TECNOLOGICO_DA_EDUCACAO_BASICA","abstract":"Resumo: Com a intencionalidade de contribuir para pesquisas em Educação Matemática, ao delimitar o campo de estudos aos Números Inteiros e Decimais, esse artigo relata os resultados de uma proposta de promoção do uso das tecnologias no ensino de Matemática, que objetivou auxiliar os alunos na compreensão dos conteúdos de Números Inteiros – Decimais e suas operações. A proposta consistiu na adaptação e aplicação de um jogo de trilhas em formato digital, que utilizou o software Excel. Os participantes foram alunos entre 11 e 13 anos de idade, de uma escola pública do Paraná. Desse modo, houve três momentos: Pré-teste, Proposta e Pós-teste, fases essas que permitiram uma visão das compreensões dos estudantes a respeito do conteúdo, anterior e posterior à sua aplicação. Ao final, conclui-se que os discentes possuem consideráveis habilidades em relação ao emprego de algoritmos da adição de números inteiros e decimais, entretanto, no emprego da operação de subtração, no mesmo contexto, apresentaram consideráveis dificuldades que foram cuidadosamente sanadas após a aplicação da proposta.Palavras-chave: Educação Matemática. Números Inteiros e Decimais. Educação Básica. Tecnologias. Abstract: Seeking to contribute to research in Mathematics Education, delimiting the field of studies to the Whole and Decimal Numbers, here is presented the results of a proposal, to promote the use of technologies in Mathematics teaching, which aimed to help students in understanding the contents of Numbers Integer - Decimals and their operations. The proposal consisted in the adaptation and application of a trail game in digital format, using Excel software. The participants were students between 11 and 13 years old, from a public school in Paraná. Happening in three moments: Pre-test, Proposal and Post-test, allowed a view of the students' understandings about the content, before and after the application of the proposal. At the end, it is concluded that the students have considerable abilities regarding the use of algorithms of the addition of integers and decimals, already in the use of the subtraction operation, in the same context, presented considerable difficulties, which were considerably remedied after the application of the proposal.Keywords: Mathematical Education. Integers and Decimal Numbers. Basic Education. Technologies.","authors":["Fernando Francisco Pereira","Iara Souza Doneze","Luciano T. E. Pansanato"],"meta":["December 2018Revista Prática Docente 3(2):386","DOI:10.23926/RPD.2526-2149.2018.v3.n2.p386-405.id231"],"references":["322016116_TECNOLOGIAS_DIGITAIS_NO_ENSINO_SUPERIOR_UM_ZOOM","276156858_A_implantacao_do_Programa_Nacional_de_Tecnologia_Educacional_ProInfo_revelacoes_de_pesquisas_realizadas_no_Brasil_entre_2007_e_2011","272678942_REFLEXOES_SOBRE_IMPLEMENTACAO_E_USO_DE_LABORATORIOS_DE_INFORMATICA_NA_ESCOLA_PUBLICA_Reflections_on_implementation_and_use_of_computer_laboratories_in_public_schools","246986448_O_computador_na_sociedade_do_conhecimento","335075315_Levantamento_da_producao_academica_em_teses_e_dissertacoes_brasileiras_sobre_ensino_e_aprendizagem_de_numeros_decimais_no_periodo_de_1995_a_2015","242214220_Construindo_um_Jogo_Para_Uso_na_Educacao_Matematica"]}