{"id":"329964570_The_new_Multicast_Repair_M-REP_IP_fast_reroute_mechanism_Multicast_Repair_IP_Fast_Reroute_Mechanism","abstract":"The network convergence time may take hundreds of milliseconds or more. Since this repair performance may be unsatisfactory, IP fast reroute (IPFRR) approaches have been developed to decrease the network convergence time and minimize traffic loss. These IPFRR mechanisms are usually based on the proactive precomputation of a backup path before a failure occurs. Once a failure is detected, the router running IPFRR will immediately use this backup path in response to the failure, rather than computing a replacement path only after a failure has occurred. The computation of an alternative path in many IPFRR mechanisms requires that the computing node (router) knows the exact network topology. In this paper, we present a new IPFRR mechanism called the multicast repair (M‐REP) IPFRR mechanism, which provides an advanced fast reroute technique for Internet service providers‘ (ISP‘s) core networks. The M‐REP IPFRR mechanism is based on IP multicast and utilizes Protocol Independent Multicast – Dense Mode (PIM‐DM) with the modification of an internal reverse path forwarding (RPF) check. The M‐REP IPFRR mechanism does not depend on any particular routing protocol type (distance‐vector or link‐state) and requires less system resources because of its precomputation‐less character but still provides immediate reaction to failure.","authors":["Jozef Papan","Pavel Segeč","Peter Palúch","Jana Uramova"],"meta":["December 2018Concurrency and Computation Practice and Experience 32(2):e5105","DOI:10.1002/cpe.5105","Project: M-REP IPFRR"],"references":["319347730_Network_failure-aware_redundant_virtual_machine_placement_in_a_cloud_data_center","312334356_The_Survey_of_Current_IPFRR_Mechanisms","312038522_The_IPFRR_mechanism_inspired_by_BIER_algorithm","349548171_Network_Routing_Fundamentals_Applications_and_Emerging_Technologies","319929151_Improvement_of_flow-oriented_fast_reroute_model_based_on_scalable_protection_solutions_for_telecommunication_network_elements","318667725_Performance_comparison_of_resilience_mechanisms_for_stateless_multicast_using_BIER","316535121_Mathematical_Evaluation_of_Context_Transfer_and_Multicast_Fast_Reroute_in_Multicast_Enabled_Network_Mobility_Management","314228818_Reliability_and_Fault-Tolerant_and_Delay-Tolerant_Routing","312469804_An_overview_of_the_OMNET_simulation_environment","311953010_A_Fault-Tolerant_Routing_Strategy_for_KNS_Topologies_Based_on_Intermediate_Nodes"]}