{"id":"330006432_TERMINOLOGIA_TRADUCAO_E_LIBRAS_ALGUNS_CAMINHOS_PARA_PESQUISAS","abstract":"RESUMO: Após um panorama sobre três principais teorias terminológicas (Teoria Geral da Terminologia, Teoria Comunicativa da Terminologia e Teoria Sociocognitiva da Terminologia), este trabalho tem o objetivo de apresentar algumas possibilidades de pesquisas envolvendo Terminologia, Tradução e Libras. Para isso, em primeiro lugar, são discutidos pontos principais dessas três teorias. Depois, são sugeridas algumas possibilidades de pesquisa em áreas que reclamam estudos: Informática, Medicina, Direito etc. Em seguida, é apresentado um programa para transcrição de sinais da Libras, o EUDICO Linguistic Annotator (ELAN), que também viabiliza pesquisas em Terminologia. Por último, é proposta uma ficha terminológica baseada em uma tradução de linguagem especializada, mais especificamente da metáfora especializada. Palavras-chave: Terminologia. Tradução. Libras. Pesquisas. \n\nABSTRACT: After an overview of three main terminological theories (General Theory of Terminology, Communicative Theory of Terminology and socio-cognitive theory of Terminology), this paper has the objective to present some possibilities of researches involving Terminology, translation and Brazilian Sign Language (LSB). First of all, we discuss essential points from three theories. After, some research possibilities are suggested in areas requiring studies: computer science area, Medicine, Law, and so on. Then, we introduce the EUDICO Linguistic Annotator (ELAN), a sign transcription program that enables possible researches in Terminology. Finally, we propose a terminology record based on specialized language translation, more specifically of the specialized metaphor.","authors":["Emerson Cristian Pereira dos Santos","Dos Santos"],"meta":["December 2018transversal 4(8):96-109"],"references":["316911257_Metaforas_conceituais_baseadas_em_vida_morte_e_ressurreicao_e_sua_traducao_para_a_Libras","242257024_Do_ensino_da_terminologia_para_tradutores_diretrizes_basicas","344497386_Towards_New_Ways_of_Terminology_Description_The_sociocognitive_approach","329109562_No_principio_era_a_palavra_mas_a_palavra_foi_traduzida_para_os_sinais","318494453_Metaphors_We_Live_By","49495764_Introduction_a_la_terminologie"]}