{"id":"330065177_Artificial_intelligence-based_decision-making_for_age-related_macular_degeneration","abstract":"Artificial intelligence (AI) based on convolutional neural networks (CNNs) has a great potential to enhance medical workflow and improve health care quality. Of particular interest is practical implementation of such AI-based software as a cloud-based tool aimed for telemedicine, the practice of providing medical care from a distance using electronic interfaces.\nMethods: In this study, we used a dataset of labeled 35,900 optical coherence tomography (OCT) images obtained from age-related macular degeneration (AMD) patients and used them to train three types of CNNs to perform AMD diagnosis.\nResults: Here, we present an AI- and cloud-based telemedicine interaction tool for diagnosis and proposed treatment of AMD. Through deep learning process based on the analysis of preprocessed optical coherence tomography (OCT) imaging data, our AI-based system achieved the same image discrimination rate as that of retinal specialists in our hospital. The AI platform's detection accuracy was generally higher than 90% and was significantly superior (p < 0.001) to that of medical students (69.4% and 68.9%) and equal (p = 0.99) to that of retinal specialists (92.73% and 91.90%). Furthermore, it provided appropriate treatment recommendations comparable to those of retinal specialists.\nConclusions: We therefore developed a website for realistic cloud computing based on this AI platform, available at https://www.ym.edu.tw/~AI-OCT/. Patients can upload their OCT images to the website to verify whether they have AMD and require treatment. Using an AI-based cloud service represents a real solution for medical imaging diagnostics and telemedicine.","authors":["De-Kuang Hwang","Chih-Chien Hsu","Kao-Jung Chang","Daniel Chao"],"meta":["January 2019Theranostics 9(1):232-245","DOI:10.7150/thno.28447"],"references":["325345701_Telemedicine_in_Complex_Diabetes_Management","321692164_Fully_Automated_Detection_and_Quantification_of_Macular_Fluid_in_OCT_Using_Deep_Learning","320980748_OCT-based_deep_learning_algorithm_for_the_evaluation_of_treatment_indication_with_anti-vascular_endothelial_growth_factor_medications","317852643_Deep-learning_based_automated_segmentation_of_macular_edema_in_optical_coherence_tomography","275208824_A_scoping_review_of_cloud_computing_in_healthcare","324488106_In_Silico_Labeling_Predicting_Fluorescent_Labels_in_Unlabeled_Images","323373904_Identifying_Medical_Diagnoses_and_Treatable_Diseases_by_Image-Based_Deep_Learning","320461168_Automated_drusen_detection_in_dry_age-related_macular_degeneration_by_multiple-depth_en_face_optical_coherence_tomography","315719231_Economic_Evaluation_of_a_Home-Based_Age-Related_Macular_Degeneration_Monitoring_System","303635323_EFFECTIVENESS_OF_DIFFERENT_MONITORING_MODALITIES_IN_THE_DETECTION_OF_NEOVASCULAR_AGE-RELATED_MACULAR_DEGENERATION_The_Home_Study_Report_Number_3"]}