{"id":"330092341_Taxonomy-aware_collaborative_denoising_autoencoder_for_personalized_recommendation","abstract":"Taxonomies are ubiquitous in many real-world recommendation scenarios where each item is classified into a category of a predefined hierarchical taxonomy and provide important auxiliary information for inferring user preferences. However, traditional collaborative filtering approaches have focused on user-item interactions (e.g., ratings) and neglected the impact of taxonomy information on recommendation. In this paper, we present a taxonomy-aware denoising autoencoder based model which incorporates taxonomy-aware side information into denoising autoencoder based recommendation models to enhance recommendation accuracy and alleviate data sparsity and cold start problems in recommendation systems. We propose two types of taxonomic side information, namely the topological representation of tree-structured taxonomy and the statistical properties of the taxonomy. By integrating taxonomic side information, our model can learn more effective user latent vectors which are not only determined by user ratings but also rely on the taxonomy information. We conduct a comprehensive set of experiments on two real-world datasets which provide several outcomes: first, our proposed taxonomy-aware method outperforms the baseline method on RMSE metric. Next, information extracted from taxonomy can help alleviate data sparsity and cold start problems. Moreover, we conduct supplementary experiments to explore the reason why our proposed taxonomic side information improves recommendation performance.","authors":["Chunhong Zhang","Tiantian Li","Zhibin Ren","Zheng Hu"],"meta":["June 2019Applied Intelligence 49(3)","DOI:10.1007/s10489-018-1378-9"],"references":["319480870_Independent_travel_recommendation_algorithm_based_on_analytical_hierarchy_process_and_simulated_annealing_for_professional_tourist","318671349_Deep_Learning_Based_Recommender_System_A_Survey_and_New_Perspectives","316167917_Personalized_recommendation_algorithm_for_social_networks_based_on_comprehensive_trust","311491420_AutoRec_Autoencoders_Meet_Collaborative_Filtering","308270795_Attributes_coupling_based_matrix_factorization_for_item_recommendation","318126863_Taxonomy-Induced_Matrix_Factorization_for_Inferring_Preference_of_Mobile_Telecom_Users","316939884_Hybrid_Recommender_System_based_on_Autoencoders","311488341_Collaborative_Denoising_Auto-Encoders_for_Top-N_Recommender_Systems","309457236_Improving_recommendation_lists_through_topic_diversification","307573656_Deep_Neural_Networks_for_YouTube_Recommendations","301839500_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","304494685_Probabilistic_matrix_factorization","304484566_Hybrid_Recommender_System_based_on_Autoencoders","303521361_Structural_Analysis_of_User_Choices_for_Mobile_App_Recommendation","301417809_Deep_Collaborative_Filtering_via_Marginalized_Denoising_Auto-encoder"]}