{"id":"330059922_A_Semantic_Approach_for_Generating_Government_Processes","abstract":"In the last years, governments embraced business process management practices to improve their interactions and services with various stakeholders such as citizens, businesses and other government agencies. Nevertheless, current government process management solutions are still very limited at the semantic level, leading to challenges in dealing with legal, social, organisational, political and economic constraints, collectively referred to as 'context'. In this paper, we introduce a semantic government process management (SGPM) approach for the design and deployment of legally compliant government processes. The developed solution is mainly articulated around an ontological framework, with a high level of abstraction, allowing the explicit representation of legal context associated with government processes. It is connected to a defined legal meta-model that acts as legal context extraction guidelines and knowledge source. Moreover, this framework is substantiated by a legal features model allowing the semantic representation of structural relationships and dependencies between processes, sub-processes, as well as activities. The ontological framework is implemented as software assets, using OWL-DL, that constitute the kernel from which BPEL executable government processes are automatically generated.","authors":["Amina Cherouana","Latifa Mahdaoui","Ladjel Bellatreche","Brahim Medjahed"],"meta":["January 2019International Journal of Web and Grid Services 15(1):59","DOI:10.1504/IJWGS.2019.096536"],"references":["278851131_Model-driven_engineering_A_survey_supported_by_A_unified_conceptual_model","274074382_Towards_a_Better_Understanding_of_Context_and_Context-Awareness","300410848_Linking_Context_to_Ontologies","283909804_A_Workflow-Based_Solution_for_the_Law_Study_Process_Management","282183950_Legal_Requirements_and_Modeling_of_Processes","280113615_Business_Process_Execution_Language_for_Web_Services","278713495_Semantic_Data_Warehouse_Design_From_ETL_to_Deployment_a_la_Carte","275891572_Supporting_Legal_Requirements_in_the_Design_of_Public_Processes","273480303_An_analysis_of_metamodeling_practices_for_MOF_and_OCL","267689222_A_Context_Information_Ontology_Hierarchy_Model_for_Tourism-oriented_Mobile_E-commerce"]}