{"id":"330076830_Evaluating_the_Applicability_of_a_Social_Content_Management_Framework_A_Case_Analysis","abstract":"Social media platform plays an important role in engaging customers. The social content resulting from social media interactions between the organisations and the customers need a proper management. Therefore, in this work, a framework for social content management is introduced to support the management of social content. This framework is developed based on two main concepts. The first is the existing concepts that are present in content management, whilst the second concept is derived from the theory of service science. This approach is adopted to cater for existing concepts in enterprise content management, that are relevant to social content management and also to cater for the concept of value co-creation which forms the basis of engagement between the organisations and the customers. The applicability of the proposed social content management framework needs to be evaluated in order to determine the extent of its applicability in practical situations. Therefore, the main focus of this article is to report the usability of the proposed framework against the practices of the government agencies of Malaysia in managing the social content. The evaluation method used is based on the score of system usability scale. The results from the evaluation revealed that the proposed framework is usable and is deemed practical to be used in organisations. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Wan Azlin Zurita Wan Ahmad","Muriati Mukhta","Yazrina Yahya"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(12)","DOI:10.14569/IJACSA.2018.091249","Project: Social Content Management"],"references":["328190164_Developing_the_Dimensions_of_a_Social_Content_Management_Framework","326122488_Political_Engagement_on_Social_Media_as_Antecedent_for_Political_Support_among_Voters_in_Malaysia","311235115_Social_media_mediated_interaction_with_peers_experts_and_anonymous_authors_Conversation_partner_and_message_framing_effects_on_risk_perception_and_sense-making_of_organic_food","306254446_Digital_Innovation_Management_Reinventing_Innovation_Management_Research_in_a_Digital_World","305131211_Generation_Y's_Political_Participation_and_Social_Media_in_Malaysia","304942589_Enterprise_architecture_development_and_implementation_in_public_sector_The_Malaysian_perspective","282540931_Institutions_and_axioms_an_extension_and_update_of_service-dominant_logic","312502825_Promoting_Open_Innovation_in_the_Public_Sector_Through_Social_Media_Monitoring","292794386_The_Future_of_Competition_Co-Creating_Unique_Value_with_Customers","263602261_Venkat_Ramaswamy_-_a_ten-year_perspective_on_how_the_value_co-creation_revolution_is_transforming_competition"]}