{"id":"330078381_Sensual_Semantic_Analysis_for_Effective_Query_Expansion","abstract":"The information has evolved rapidly over the World Wide Web in the past few years. To satisfy information needs, users mostly submit a query via traditional search engines, which retrieve results on the basis of keyword matching principle. However, a keyword-based search cannot recognize the meanings of keywords and the semantic relationship among the terms in the user's query; thus, this technique cannot retrieve satisfactory results. The expansion of an initial query with relevant meaningful terms can solve this issue and enhance information retrieval. Generally, query expansion methods consider concepts that are semantically related to query terms within the ontology as candidates in expanding the initial query. An analysis of the correct sense of query terms, rather than only considering semantic relations, is necessary to overcome language ambiguity problems. In this work, we proposed a query expansion framework on the basis of query sense analysis and semantics mining using computer science domain ontology, followed by working prototype of the system. The experts analyzed the results of system prototype over test dataset and Web data, and found a remarkable improvement in the overall search performance. Furthermore, the proposed framework demonstrated better mean average precision and recall values than the baseline method. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Muhammad Ahsan Raza","Rahmah Binti Mokhtar","Noraziah Ahmad","Mahmood Ashraf"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(12)","DOI:10.14569/IJACSA.2018.091208"],"references":["320129535_DBpedia_based_Ontological_Concepts_Driven_Information_Extraction_from_Unstructured_Text","318849626_Query_Expansion_Techniques_for_Information_Retrieval_a_Survey","308084649_Ontology-based_Query_Expansion_for_Arabic_Text_Retrieval","303123623_Pattern_and_semantic_analysis_to_improve_unsupervised_techniques_for_opinion_target_identification","319373935_An_Interoperable_Model_for_the_Intelligent_Content_Object_Based_on_a_Knowledge_Ontology_and_the_SCORM_Specification","318705274_Ontology-Based_Recommender_System_for_COTS_Components","316636674_Collective_evolutionary_concept_distance_based_query_expansion_for_effective_web_document_retrieval","301249509_A_Framework_of_Query_Expansion_for_Image_Retrieval_based_on_Knowledge_Base_and_Concept_Similarity","301222516_Extended_Boolean_information_retrieval","295875978_Improving_Query_Expansion_for_Information_Retrieval_Using_Wikipedia"]}