{"id":"330037277_Description_on_Research_Article_Introduction_Section_by_Computer_Science_Researchers_in_Malaysian_Private_Universities","abstract":"The competition and pursuit for better ranking within the academia drive a more prevailing and urgent need to increase the number of research publications. This paper examines twenty research article introduction sections written in English to identify the rhetorical patterns and structures for better understanding on how the writers write. The research articles are written by the Computer Science researchers in Malaysian private universities. This paper presents the results of the move analysis on the rhetorical structure of the selected text and the descriptions on how the moves were accomplished by the writers. In general, the results show that the writers utilised the Create a Research Space (CARS) model by Swales (2004). The three moves suggested in CARS model are establishing the research territory, establishing the research niche and presenting the present work. While all the three moves suggested in the model are fulfilled by the writers, some of the rhetorical steps which are proposed as obligatory steps in CARS model are being underutilised. Such underutilisation calls for more emphasis and employment on the respective rhetorical steps. The respective rhetorical steps are presenting positive justification, summarising methods, announcing principle outcomes and stating the value of the present research.","authors":["Ina Suryani","Norkhairi Bin Ahmad","Faharol Zubir","Norlizawati Ghazali"],"meta":["January 2018Journal of Human Development 7(1):1-8","Project: Covid-19, Edisi Khas 2020, PENDETA, Journal of Malay Language,  Education and Literature"],"references":["315041228_Research_Publication_Output_by_Academicians_in_Public_and_Private_Universities_in_Malaysia","300902976_Rhetorical_Structure_Analysis_of_the_Indonesian_Research_Articles","289269972_The_research_imperative_in_the_evolving_environment_of_public_universities_in_Malaysia","285120337_Introduction_Sections_of_Research_Articles_with_High_and_Low_Citation_Indices","276941928_An_Approach_to_Corpus-based_Discourse_Analysis_The_Move_Analysis_as_Example","261403714_Promotional_Strategy_in_Computer_Science_Research_Articles_of_A_Malaysian_Journal","257991938_Introduction_of_Computer_Science_Paper_Divergence_from_CARS","257717326_Key_Performance_Indicators_vs_Key_Intangible_Performance_Among_Academic_Staff_A_Case_Study_of_a_Public_University_in_Malaysia","277335008_Factors_Associated_With_Scholarly_Publication_Productivity_among_Academic_Staff_Case_of_a_Malaysian_Public_University","265628154_INVESTIGATING_TEXTUAL_STRUCTURE_IN_NATIVE_AND_NON-NATIVE_ENGLISH_RESEARCH_ARTICLES_STRATEGY_DIFFERENCES_BETWEEN_ENGLISH_AND_INDONESIAN_WRITERS"]}