{"id":"330038871_Okul_Oncesi_Donemi_Cocuklari_icin_Bilgisayar_Programlama","abstract":"21. yüzyıl ile birlikte teknoloji hızla gelişmiş ve bu yüzyılı teknoloji çağı olarak adlandırmıştır. Teknoloji odaklı olan günümüz dünyasında üretebilen bir toplum olabilmek için yeni yetişen nesillere var olan programları tüketmek yerine yeni programlar üretmeleri için yol göstermek önem kazanmaktadır. Bu durum ise okullarda bilgisayar programlama eğitimini popüler hale getirmiştir. Bilgisayar programlama günümüzde yeni okuryazarlık olarak kabul edilmektedir. Tıpkı okuma yazma öğrenmek gibi bilgisayar programlama da çocukların düşünme becerilerini geliştirmekte ve kendilerini ifade etmelerine olanak sağlamaktadır. Bilgisayar bilimi uygulamalarına erken yıllarda başlamak, çocuklara bilgisayar dünyasını nasıl şekillendirdiğini fark etmelerine, bilgisayar ve programlama ile ilgili bazı temel kavramları adlandırmalarına ve bunları tanımalarına yardımcı olmaktadır. Günümüzde okul öncesi dönemi çocuklarının bilgisayar programlamalarına olanak sağlayan birçok ara yüz ve araç bulunmaktadır. Bu ara yüz ve araçlar grafik tabanlı programlama araçları ve somut programlama araçları olarak iki başlık altında toplanmıştır. Bu derleme çalışması bilgisayar programlama eğitiminin okul öncesi dönemi çocuklarıyla uygulanmasına dair bilgi vermeyi, verilen bilgilerle Türkiye'de bu alanda yapılacak çalışmalara ve uygulamalara yardımcı olmayı amaçlamaktadır. Bu çalışmanın okul öncesi dönemi çocuklarıyla bilgisayar programlama ve kodlama üzerine yapılacak yeni araştırmalara yol göstereceği ve katkı sağlayacağı umulmaktadır. ABSTRACT Technology has developed rapidly with the 21st century and this century called as the age of technology. In order to become a society that can produce in today's technology-oriented world, it becomes important to guide the new generations to produce new programs instead of consuming existing ones. Therefore computer programming education has become popular in schools. Computer programming is now regarded as a new literacy. Just as learning to read and write, computer programming also allows children to develop their thinking skills and express themselves. To begin early with the computer science practices, helps children to realize how they shape the computer world and to name and identify some basic concepts related to computer and programming. Nowadays, there are many interfaces and tools that enable computer programming for preschool children. These interfaces and tools are grouped under two headings: graphical programming tools and tangible programming tools. The aim of this review paper is to give information about the practice of computer programming education with preschool children and to serve information for the works and practices which will be made in this field in Turkey. It is hoped that this study will","authors":["Büşra Somuncu","Durmuş Aslan"],"meta":["December 2018"],"references":["320759897_Education_on_Programming_with_Robots_Examining_Students'_Experiences_and_Views","309312391_A_Mobile_Application_That_Allows_Children_in_the_Early_Childhood_to_Program_Robots","303813756_PROGRAMMING_EDUCATION_AND_NEW_APPROACHES_AROUND_THE_WORLD_AND_IN_TURKEY_DUNYADA_VE_TURKIYE'DE_PROGRAMLAMA_EGITIMI_VE_YENI_YAKLASIMLAR","322585181_Cubetto_for_preschoolers_Computer_programming_code_to_code","311759496_The_Life_and_Contributions_of_Countess_Ada_Lovelace_Unintended_Consequences_of_Exclusion_Prejudice_and_Stereotyping","308183995_Programming_with_the_KIBO_Robotics_Kit_in_Preschool_Classrooms","300481246_A_TUI-based_Programming_Tool_for_Children","289078830_Bilgi_toplumu_okullaridotlessnda_programlama_egitimi_gereksinimi","286873961_The_TangibleK_robotics_program_Applied_computational_thinking_for_young_children","284136219_Computing_education_in_children's_early_years_A_call_for_debate","279892528_Preschool_cookbook_of_computer_programming_topics","269704129_Evaluating_children_performance_with_graphical_and_tangible_robot_programming_tools","265286561_Computational_Thinking_is_Pervasive","262253499_Designing_ScratchJr_support_for_early_childhood_learning_through_computer_programming","257556889_The_Effect_of_a_Classroom-Based_Intensive_Robotics_and_Programming_Workshop_on_Sequencing_Ability_in_Early_Childhood"]}