{"id":"330097669_Dynamic_vaccination_in_partially_overlapped_multiplex_network","abstract":"In this work we propose and investigate a strategy of vaccination which we call “dynamic vaccination.” In our model, susceptible people become aware that one or more of their contacts are infected and thereby get vaccinated with probability ω, before having physical contact with any infected patient. Then the nonvaccinated individuals will be infected with probability β. We apply the strategy to the susceptible-infected-recovered epidemic model in a multiplex network composed by two networks, where a fraction q of the nodes acts in both networks. We map this model of dynamic vaccination into bond percolation model and use the generating functions framework to predict theoretically the behavior of the relevant magnitudes of the system at the steady state. We find a perfect agreement between the solutions of the theoretical equations and the results of stochastic simulations. In addition, we find an interesting phase diagram in the plane β−ω, which is composed of an epidemic and a nonepidemic phase, separated by a critical threshold line βc, which depends on q. As q decreases, βc increases, i.e., as the overlap decreases, the system is more disconnected, and therefore more virulent diseases are needed to spread epidemics. Surprisingly, we find that, for all values of q, a region in the diagram where the vaccination is so efficient that, regardless of the virulence of the disease, it never becomes an epidemic. We compare our strategy with random immunization and find that, using the same amount of vaccines for both scenarios, we obtain that the spread of disease is much lower in the case of dynamic vaccination when compared to random immunization. Furthermore, we also compare our strategy with targeted immunization and we find that, depending on ω, dynamic vaccination will perform significantly better and in some cases will stop the disease before it becomes an epidemic.","authors":["Lucila Alvarez-Zuzek","Matías Alberto Di Muro","Shlomo Havlin","Lidia Adriana Braunstein"],"meta":["January 2019PHYSICAL REVIEW E 99(1)","DOI:10.1103/PhysRevE.99.012302","Project: Epidemic Models, Social Model and Cascade of Failures in Networks of Networks"],"references":["325256727_Immunity_of_multiplex_networks_via_acquaintance_vaccination","320368299_Ring_vaccination_with_rVSV-ZEBOV_under_expanded_access_in_response_to_an_outbreak_of_Ebola_virus_disease_in_Guinea_2016_An_operational_and_vaccine_safety_report","309657503_Containing_Ebola_at_the_Source_with_Ring_Vaccination","307536753_Statistical_physics_of_vaccination","307469293_The_physics_of_spreading_processes_in_multilayer_networks","282181714_Disease_Localization_in_Multilayer_Networks","280537968_Coupled_disease-behavior_dynamics_on_complex_networks_A_review","326165091_Local_structure_can_identify_and_quantify_influential_global_spreaders_in_large_scale_social_networks","311612620_Unification_of_theoretical_approaches_for_epidemic_spreading_on_complex_networks","285857230_Smallpox_and_Its_Eradication"]}