{"id":"330089092_Visibilidad_e_impacto_de_la_literatura_gris_cientifica_en_repositorios_institucionales_de_acceso_abierto_Estudio_de_caso_bibliometrico_del_repositorio_Gredos_de_la_Universidad_de_Salamanca","abstract":"Objetivo. El principal objetivo de este trabajo es demostrar los beneficios del acceso abierto como modelo de comunicación científica para la literatura gris científica en general y para las tesis doctorales electrónicas en particular. El trabajo de investigación que se presenta pretende dar respuesta a la pregunta sobre la visibilidad, usabilidad e impacto de las tesis doctorales depositadas en repositorios de acceso abierto, a través de un estudio de caso bibliométrico del repositorio Gredos de la Universidad de Salamanca. Método. La presente investigación se compone de dos partes: una teórica y otra práctica. Para la localización y selección de la literatura pertinente en la que sustentar las dos partes de la investigación se llevó a cabo una revisión sistemática de la literatura. En la parte teórica se realizó un estudio pormenorizado del estado de la cuestión sobre el conocimiento científico en acceso abierto, sobre los repositorios institucionales como base para el caso de estudio del repositorio Gredos de la Universidad de Salamanca, sobre la literatura gris científica y las tesis doctorales, y sobre las métricas alternativas para medir su uso y su impacto teniendo en cuenta los estudios realizados sobre el tema. La parte práctica se basó en el análisis cuantitativo de visibilidad, uso y citación de las tesis doctorales de la Universidad de Salamanca leídas en el período comprendido entre 2006 y 2011. Para obtener la muestra analizada se tuvieron en cuenta, en primer lugar, los datos proporcionados por la base de datos TESEO y los datos proporcionados por Blázquez Ochando (2015) sobre TESEO; para las tesis en acceso abierto se han empleado los datos proporcionados por el propio repositorio. Para realizar el análisis de uso y citación de las tesis doctorales se utilizaron los datos sobre visitas y descargas extraídos del módulo de estadísticas de la universidad de Tasmania instalado en el repositorio Gredos y los datos sobre citas proporcionados por Google Scholar Citation, previamente también se rastrearon y extrajeron los datos sobre las tesis citadas de la base de datos Web of Science. Se elaboró una base de datos con la muestra de tesis a analizar, en la que se recogió una serie de variables e indicadores sobre el uso, la visibilidad y la citación de las mismas. Para trabajar con los datos se utilizaron Excel y SPSS. Se realizó un análisis descriptivo y comparativo de las variables objeto de estudio. Las pruebas de distribución de normalidad se realizaron con el test de Kolmogórov-Smirnov. Mediante el coeficiente de correlación de Spearman se estimó la relación entre las variables cuantitativas del estudio. Para analizar la comparación de los indicadores de visibilidad e impacto según las áreas de conocimiento se utilizó el test de Kruskal-Wallis. Para saber entre qué par de grupos había diferencias se realizaron comparaciones por pares (post-hoc) con el test Dunn. Resultados. Se demuestra que las tesis depositadas en repositorios de acceso abierto alcanzan un grado de visibilidad y uso que no tienen de ninguna forma las tesis que no están en acceso abierto; también se demuestra que las tesis doctorales difundidas a través de repositorios son citadas aunque la relación entre uso y citas recibidas no es proporcional, hecho que permite deducir la falta de buenas prácticas de citación sobre la literatura gris. Conclusiones. Los repositorios institucionales son un canal válido para la difusión de la literatura gris científica, particularmente de las tesis doctorales.\nObject The main objective of this work is to prove the benefits of open access as a model of scientific communication for scientific gray literature, in general, and for electronic doctoral theses, in particular. This research work aims to answer the question on visibility, usability and impact of doctoral theses deposited in open access repositories, through a bibliometric case study of Gredos repository of the University of Salamanca. Method This research comprises two parts: a theory and practice. For locating and selecting of relevant literature that support both parts of the research it conducted a systematic review of the literature. In theory part it carried a detailed study of the state of the scientific knowledge on open access, on institutional repositories as a basis for conducting the case of study of Gredos Repository of the University of Salamanca, on grey literature and doctoral theses, and on altmetrics to mesure their use and impact according the impact studies about the subject. Practice part is based on quantitative analysis of visibility, use and citation of doctoral thesis at the University of Salamanca presented in the period between 2006 and 2011. To obtain the analyzed sample it took into account, first, the data provided by TESEO database and data provided by Blázquez Ochando (2015) about TESEO; for open access PhD theses it used data provided by the repository itself. To make the use and citation analysis of PhD theses it used data about visits and downloads which were extracted of statistics module of Tasmania University installed in Gredos repository and the citation data provided by Google Scholar Citation, previously it also screened and extracted PhD theses data of Web of Science database. It developed a database with the sample of PhD theses to analyze, where it collected a number of variables and indicators on the use, visibility and citation. To work with data it used Excel and SPSS. It carried a descriptive and comparative analysis of the variables under study. The normal distribution tests were performed with the Kolmogorov-Smirnov test. By Spearman correlation coefficient it estimated the relationship between quantitative variables of the study. To analyze the comparison of visibility and impact indicators according to areas of knowledge he used the Kruskal-Wallis tests. To find between what two groups had differences it carried comparisons (post-hoc) pairs with Dunn test. Results It is shown that the doctoral theses deposited in open access repositories reach a degree of visibility and use that not open access doctoral theses are not in any way; also it shows that doctoral theses disseminated through repositories are cited although the relationship between use and citations received is not proportional, a fact that allows us to deduce the lack of good practices on grey literature citation. Conclusions Institutional repositories are a valid channel to the dissemination of scientific grey literature, particularly the doctoral theses. It can establish a viable bibliometric analysis system for measuring visibility, use, citation and impact of theses deposited in institutional open access repositories.","authors":["Tránsito Ferreras-Fernández"],"meta":["December 2016","Thesis for: DoctorAdvisor: José AntonioMerlo Vega ; Francisco José García-Peñalvo","Project: Visibility and impact of sciwntific grey literature in open access repositories"],"references":[]}