{"id":"330045987_Unifying_the_Debates_Mathematical_and_Non-Causal_Explanations","abstract":"In the last couple of years, a few seemingly independent debates on scientific explanation have emerged, with several key questions that take different forms in different areas. For example, the question what makes an explanation distinctly mathematical and are there any non-causal explanations in sciences (i.e. explanations that don’t cite causes in the explanans) sometimes take a form of the question what makes mathematical models explanatory, especially whether highly idealized models in science can be explanatory and in virtue of what they are explanatory. These questions raise further issues about counterfactuals, modality and explanatory asymmetries, i.e. do mathematical and non-causal explanations support counterfactuals, and how to understand explanatory asymmetries in non-causal explanations. Even though these are very common issues in the philosophy of physics and mathematics, they can be found in different guises in the philosophy of biology, where there is the statistical interpretation of the Modern Synthesis theory of evolution, according to which the post-Darwinian theory of natural selection explains evolutionary change by citing statistical properties of populations and not the causes of changes. These questions also arise in the philosophy of ecology or neuroscience in regard to the nature of topological explanations. The question here is whether in network models in biology, ecology, neuroscience, and computer science the mathematical or more precisely topological properties can be explanatory of physical phenomena, or they are just different ways to represent causal structures. The aim of the special issue is to unify all these debates around several overlapping questions.","authors":["Daniel Kostic"],"meta":["January 2019Perspectives on Science 27(1)","DOI:10.1162/posc_e_00296","Project: Philosophical foundations of topological explanations"],"references":["309701576_Mechanistic_and_topological_explanations_an_introduction","309519112_The_topological_realization","345214834_Because_Without_Cause_Non-Causal_Explanations_in_Science_and_Mathematics","328824518_Explanation_in_Computational_Neuroscience_Causal_and_Non-causal","312323809_Dimensional_Explanations_Non-Causal_Explanations_in_Science_and_Mathematics","309665979_Explanation_Beyond_Causation_New_Directions_in_the_Philosophy_of_Scientific_Explanation","308261382_Explanatory_Abstractions","305400829_Does_the_Counterfactual_Theory_of_Explanation_Apply_to_Non-Causal_Explanations_in_Metaphysics","304044060_Explanatory_Asymmetries_Laws_of_Nature_Rehabilitated","303576399_Reassessing_Woodward's_account_of_explanation_regularities_counterfactuals_and_non-causal_explanations","282499901_Diversifying_the_picture_of_explanations_in_biological_sciences_ways_of_combining_topology_with_mechanisms","292115061_Studies_in_the_Logic_of_Explanation","286004317_Explaining_the_Brain","274412756_What_Makes_a_Scientific_Explanation_Distinctively_Mathematical","272551190_Minimal_Model_Explanations"]}