{"id":"330077650_A_Novel_Approach_to_Rule_Placement_in_Software-Defined_Networks_Based_on_OPTree","abstract":"Software-Defined Networks( SDN) are a trend of research in networks. Rule placement, a common SDN operation becomes a challenging problem due to the capacity limitation of devices in which a large number of rules need to be deployed. Prior works mostly consider rule placement in a single device. However, the position relationships between neighbor devices also have influences on rule placement and should be considered. Our basic idea is to classify the devices position relationships into two categories: the serial relationship and the parallel relationship, and we present novel strategies for rule placement based on the two different position relationships, respectively. There are two challenges of implementing our strategies: to check whether a rule is contained by a rule set or not and to check whether a rule can be merged by other rules or not. To handle the challenges, we propose a novel data structure called OPTree to represent the rules, which is convenient to check whether a rule is covered by other rules. We design an insertion algorithm and a search algorithm for OPTree. Extensive experiments show that our approach can effectively reduce the number of rules while ensuring placed rules work. On the other hand, the experimental results also demonstrate that it is necessary to consider the position relationships between neighbor devices when placing rules.","authors":["li Wenjie","Zheng Qin","Keqin Li","Hui Yin"],"meta":["January 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2018.2889194"],"references":["268810261_An_Adaptable_Rule_Placement_for_Software-Defined_Networks","262213884_Optimizing_the_One_big_switch_abstraction_in_software-defined_networks","260358172_Compressing_Network_Access_Control_Lists","260064541_A_Survey_of_Software-Defined_Networking_Past_Present_and_Future_of_Programmable_Networks","328243917_Study_of_Rule_Placement_Schemes_for_Minimizing_TCAM_Space_and_Effective_Bandwidth_Utilization_in_SDN","327636369_A_Novel_Algorithm_for_Flow-Rule_Placement_in_SDN_Switches","322647780_Raptor_Scalable_rule_placement_over_multiple_path_in_software_defined_networks","311478361_Rule-Minimization_for_Traffic_Evolution_in_Software-Defined_Networks","310821835_An_Approach_to_Rule_Placement_in_Software-Defined_Networks","261084304_Palette_Distributing_Tables_in_Software-Defined_Networks"]}