{"id":"330078605_STEAM-Education_as_Innovative_Technology_for_Industry_40","abstract":"The article is devoted to the development of STEAM-education design model, which is based on project training in the so-called “creative spaces.” “Creative spaces” are integration platforms for schoolchildren, students and postgraduates working in the format of joint work on projects initiated by various structures of society and business. The relevance of the study is due to the fact that among the skills necessary for successful professional activity in the era of the digital industry, according to experts, the ability to artistic creativity takes a special place. The analysis of the experience of various countries in the implementation of STEM and STEAM-education is made and effective ways of structuring technical disciplines, art and creative activity in a single integration program are identified. The article presents the results of experimental work on determining the level of formation of such competencies as the ability to manage projects and processes, system thinking, the ability to artistic creativity, the ability to work with teams, groups and individuals, the ability to work in a mode of high uncertainty and rapid change of conditions of tasks. It is shown that the use of “creative spaces” for the implementation of project activities of schoolchildren and students, the inclusion of the category “art” in its content allows students to form skills and competencies necessary for industry 4.0, that is, the proposed model can be considered as a universal tool for high-quality training of schoolchildren and students for professional activities in modern conditions.","authors":["T. I. Anisimova","O. V. Shatunova","F. M. Sabirova"],"meta":["November 2018Nauchnyy Dialog","DOI:10.24224/2227-1295-2018-11-322-332"],"references":["325117400_The_creation_of_junior_schoolchildren's_interest_in_the_experimental_study_of_physical_phenomena_using_the_elements_of_the_technology_of_problem-based","325072960_Scientists_for_Tomorrow_-_A_Self-Sustained_Initiative_to_Promote_STEM_in_Out-of-School_Time_Frameworks_in_Under-served_Community-Based_Organizations_Evaluation_and_Lessons_Learned","322289878_Instructional_designing_the_STEM_education_model_for_fostering_creative_thinking_abilities_in_physics_laboratory_environment_classes","317574934_The_sound_of_STEAM_Acoustics_as_the_bridge_between_the_arts_and_STEM"]}