{"id":"330077734_A_Mapping_Approach_for_Fully_Virtual_Data_Integration_System_Processes","abstract":"Nowadays, organizations cannot satisfy their information needs from one data source. Moreover, multiple data sources across the organization fuels the need for data integration. Data integration system's users pose queries in terms of an integrated schema and expect accurate, unambiguous, and complete answers. So the data integration system is not limited to, getting the answers to the queries from the sources, but also it is extended to detect and resolve the data quality problems appeared due to the integration process. The most crucial component in any data integration system is the mappings constructed between the data sources and the integrated schema. In this paper a new mapping approach is proposed to map not only the elements of the integrated schema as done by the existing approaches, but also it maps other elements required in detecting and resolving the duplicates. It provides a means to facilitate future extensibility and changes to both the sources and the integrated schema. The proposed approach provides a linkage between the fundamental components required to provide accurate and unambiguous answers to the users' queries from the integration system. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Ali Zidane","Mhdia Osman","Hasnaa Ali"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(12)","DOI:10.14569/IJACSA.2018.091216","Project: A Clinical and Pharmacogenomic Study of Breast Cancer Therapy"],"references":["327019232_Cloud-Scale_Entity_Resolution_Current_State_and_Open_Challenges","305442247_The_Case_for_Holistic_Data_Integration","289520919_A_Survey_of_Current_Link_Discovery_Frameworks","276842475_Query-Time_Record_Linkage_and_Fusion_over_Web_Databases","329418252_A_Method_for_Implementing_Probabilistic_Entity_Resolution","325374535_Deep_Learning_for_Entity_Matching_A_Design_Space_Exploration","316849775_Data_Integration_After_the_Teenage_Years","299969949_Entity_Matching_across_Heterogeneous_Sources","299579631_ORLF_A_Flexible_Framework_for_Online_Record_Linkage_and_Fusion","283620965_Trends_in_Cleaning_Relational_Data_Consistency_and_Deduplication","258402804_Inferring_Data_Currency_and_Consistency_for_Conflict_Resolution","221350987_Clio_Schema_Mapping_Creation_and_Data_Exchange","276465221_Incremental_record_linkage","274404144_Propagation_of_Data_Fusion","226225932_Data_Integration_under_Integrity_Constraints"]}