{"id":"330071289_Clustering-driven_evolutionary_algorithms_an_application_of_path_relinking_to_the_quadratic_unconstrained_binary_optimization_problem","abstract":"A long-standing challenge in the metaheuristic literature is to devise a way to select parent solutions in evolutionary population-based algorithms to yield better offspring, and thus provide improved solutions to populate successive generations. We identify a way to achieve this goal that simultaneously improves the efficiency of the evolutionary process. Our strategy derives from a proposal associated with the scatter search and path relinking evolutionary algorithms that prescribes clustering the solutions and focusing on the two classes of solution combinations where the parents alternatively belong to the same cluster or to different clusters. We demonstrate the efficacy of our approach for selecting parents within this scheme by applying it to the important domain of quadratic unconstrained binary optimization (QUBO), which provides a model for solving a wide range of binary optimization problems. Within this setting, we focus on the path relinking algorithm, which together with tabu search has provided one of the most effective methods for QUBO problems. Computational tests disclose that our solution combination strategy improves the best results in the literature for hard QUBO instances.","authors":["Michele Samorani","Yang Wang","Zhipeng Lv","Fred Glover"],"meta":["October 2019Journal of Heuristics 25(4)","DOI:10.1007/s10732-018-9403-z"],"references":["332109233_A_history_of_metaheuristics","315811561_A_History_of_Metaheuristics","297587437_A_learning-based_path_relinking_algorithm_for_the_bandwidth_coloring_problem","281886731_A_History_of_Metaheuristics","262842656_The_unconstrained_binary_quadratic_programming_problem_A_survey","262233705_Data-Mining-Driven_Neighborhood_Search","257196249_Path_relinking_for_unconstrained_binary_quadratic_programming","323865240_Adaptive_tabu_search_with_strategic_oscillation_for_the_bipartite_boolean_quadratic_programming_problem_with_partitioned_variables_Revised_Version","309380904_Effective_metaheuristic_algorithms_for_the_minimum_differential_dispersion_problem","268014067_Iterated_Tabu_Search_for_the_Unconstrained_Binary_Quadratic_Optimization_Problem"]}