{"id":"330078388_A_Correlation_based_Approach_to_Differentiate_between_an_Event_and_Noise_in_Internet_of_Things","abstract":"Internet of Things (IoT) is considered a huge enhancement in the field of information technology. IoT is the integration of physical devices which are embedded with electronics, software, sensors, and connectivity that allow them to interact and exchange data. IoT is still in its beginning so it faces a lot of obstacles ranging from data management to security concerns. Regarding data management, sensors generate huge amounts of data that need to be handled efficiently to have successful employment of IoT applications. Detection of data anomalies is a great challenge that faces the IoT environment because, the notion of anomaly in IoT is domain dependent. Also, the IoT environment is susceptible to a high noise rate. Actually, there are two main sources of anomalies, namely: an event and noise. An event refers to a certain incident which occurred at a specific time, whereas noise denotes an error. Both event and noise are considered anomalies as they deviate from the remaining data points, but actually they have two different interpretations. To the best of our knowledge, no research exists addressing the question of how to differentiate between an event and noise in IoT. As a result, in this paper, an algorithm is proposed to differentiate between an event and noise in the IoT environment. At first, anomalies are detected using exponential moving average technique, then the proposed algorithm is applied to differentiate between an event and noise. The algorithm uses the sensors' values and correlation existence between sensors to detect whether the anomaly is an event or noise. Moreover, the algorithm was applied on a real traffic dataset of size 5000 records to evaluate its effectiveness and the experiments showed promising results. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Dina ElMenshawy","Waleed Helmy"],"meta":["December 2018International Journal of Advanced Computer Science and Applications 9(12)","DOI:10.14569/IJACSA.2018.091212"],"references":["322737614_A_survey_on_applications_of_internet_of_things","308189869_Behavioral_Modeling_Intrusion_Detection_System_BMIDS_Using_Internet_of_Things_IoT_Behavior-Based_Anomaly_Detection_via_Immunity-Inspired_Algorithms","318895893_Advanced_correlation-based_anomaly_detection_method_for_predictive_maintenance","317639552_Urban_Heartbeat_From_Modelling_to_Applications","313808874_An_anomaly_detection_in_smart_cities_modeled_as_wireless_sensor_network","313688799_Mobile_RFID_in_Internet_of_Things_Security_attacks_privacy_risks_and_countermeasures","309150269_Unsupervised_Anomaly_Detection_Using_Light_Switches_for_Smart_Nursing_Homes","308703563_Detection_of_anomalies_in_data_for_monitoring_of_security_components_in_the_Internet_of_Things","305287576_Introduction_to_the_Internet_of_Things_security_Standardization_and_research_challenges","304409834_Internet_of_things_Architecture_technology_and_key_problems_in_implementation","281835622_Anomaly_detection_and_privacy_preservation_in_cloud-centric_Internet_of_Things","256326897_API_design_for_machine_learning_software_Experiences_from_the_scikit-learn_project","304406887_A_survey_on_internet_of_things_architecture_protocols_possible_applications_security_privacy_real-world_implementation_and_future_trends","301078183_Outlier_Detection","293640481_The_Changing_Computing_Paradigm_With_Internet_of_Things_A_Tutorial_Introduction"]}