{"id":"330147584_Detecting_Seizures_From_EEG_Signals_Using_the_Entropy_of_Visibility_Heights_of_Hierarchical_Neighbors","abstract":"Epilepsy is a chronic disorder that causes unprovoked, recurrent sudden abnormal reactions of the brain. Characterizing electroencephalogram (EEG) signals of the patient is an effective way for the early prediction of epileptic seizures. In this work, a new method called the entropy of visibility heights of hierarchical neighbors (EVHHN) is proposed to detect seizures from the EEG signals. Firstly, the visibility relationships of three nearest neighbors are determined by a visibility criterion. Then we compute the visibility heights of three nearest neighbors for each data point. Next, four different kinds of entropy associated with neighbor visibility states are calculated to characterize the EEG signals and finally these features are validated by LS-SVM classifiers. In the experiment, the normal and ictal EEG signals are classified with accuracy of 99.6%, meanwhile, the interictal and ictal EEG signals are distinguished with accuracy of 98.35%, which proves the effectiveness of our proposed method. Notably, the computational time of extracting features for each set is 1.751s, which is largely reduced compared with other weighted visibility graph (WVG) based methods. In conclusion, the EVHHN can potentially be a effective method for characterizing complicated EEG signals and real-time detection of epileptic seizures.","authors":["Ming Zeng","Chunyu Zhao","qing-hao Meng"],"meta":["January 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2890895"],"references":["318431807_EEG_Analysis_of_Seizure_Patterns_using_Visibility_Graphs_for_Detection_of_Generalized_Seizures","318355314_Epileptic_seizure_detection_in_EEGs_signals_based_on_the_weighted_visibility_graph_entropy","314490179_A_high-performance_seizure_detection_algorithm_based_on_Discrete_Wavelet_Transform_DWT_and_EEG","309296234_Multiscale_limited_penetrable_horizontal_visibility_graph_for_analyzing_nonlinear_time_series","308329605_Weighted_Visibility_Graph_With_Complex_Network_Features_in_the_Detection_of_Epilepsy","304672140_DWT_based_Epileptic_Seizure_Detection_from_EEG_Signals_using_Naive_Bayesk-NN_Classifiers","312933026_Detection_of_epileptic_seizure_using_Kraskov_entropy_applied_on_tunable-Q_wavelet_transform_of_EEG_signals","312538118_Support-vector_networks","304659583_Automated_Diagnosis_of_Epilepsy_Using_Key-Point-Based_Local_Binary_Pattern_of_EEG_Signals","296621008_A_novel_robust_diagnostic_model_to_detect_seizures_in_electroencephalography"]}