{"id":"330117766_Understanding_Human_Mobility_Patterns_in_a_Developing_Country_Using_Mobile_Phone_Data","abstract":"This study demonstrates the use of mobile phone data to derive country-wide mobility patterns. We identified significant locations of users such as home, work, and other based on a combined measure of frequency, duration, time, and day of mobile phone interactions. Consecutive mobile phone records of users are used to identify stay and pass-by locations. A stay location is where users spend a significant amount of their time measured through their mobile phone usage. Trips are constructed for each user between two consecutive stay locations in a day and then categorized by purpose and time of the day. Three measures of entropy are used to further understand the regularity of user’s spatiotemporal mobility patterns. The results show that user’s in a high entropy cluster has high percentage of non-home based trips (77%), and user’s in a low entropy cluster has high percentage of commuting trips (49%), indicating high regularity. A set of doubly constrained trip distribution models is estimated. To measure travel cost, the concept of a centroid point that assumes the origins and destinations of all trips are concentrated at an arbitrary location such as the centroid of a zone is replaced by multiple origins and destinations represented by cell tower locations. Note that a cell tower location can only be used as trips origin/destination location when a stay is detected. The travel cost measured between cell tower locations has resulted in shorter trip distances and the model estimation shows less sensitivity to the distance-decay effect.","authors":["Merkebe Demissie","Santi Phithakkitnukoon","Lina Kattan","Ali Farhan"],"meta":["January 2019Data Science Journal 18(1):1-13","DOI:10.5334/dsj-2019-001"],"references":["328313715_Trip_Distribution_Modeling_Using_Mobile_Phone_Data_Emphasis_on_Intra-Zonal_Trips","317905062_Inferring_social_influence_in_transport_mode_choice_using_mobile_phone_data","303990733_Urban_Modelling_Algorithms_Calibrations_Predictions","276074642_The_path_most_traveled_Travel_demand_estimation_using_big_data_resources","329933867_Modelling_transport","325550172_Road_Network_Design_in_a_Developing_Country_Using_Mobile_Phone_Data_An_Application_to_Senegal","318393858_R_A_Language_and_Environment_for_Statistical_Computing","301734453_Travel_demand_estimation_and_network_assignment_based_on_cellular_network_data","290105687_Inferring_Passenger_Travel_Demand_to_Improve_Urban_Mobility_in_Developing_Countries_Using_Cell_Phone_Data_A_Case_Study_of_Senegal","280154449_COMBINING_DATASETS_FROM_MULTIPLE_SOURCES_FOR_URBAN_AND_TRANSPORTATION_PLANNING_emphasis_on_cellular_network_data"]}