{"id":"330142454_A_Gentle_Introduction_to_Computational_Complexity_Through_an_Examination_of_Noodle_Making","abstract":"Computational complexity is regarded by many Computer Science students as extremely difficult and as a topic to be avoided. However, the concepts of an algorithm and of computational complexity as a means of characterizing the resource consumption of algorithms are fundamental in Computer Science and are included in all curricula for it. To better motivate students and to increase their interest in computational complexity, this paper suggests introducing it by examining algorithms, a.k.a. recipes, for making noodles. This paper describes several traditional algorithms for making Chinese and Italian noodles and classifies each according to its computational complexity. It compares the power of the algorithms. It considers the nature of variations of the traditional algorithms. It examines machines that implement some of the algorithms. It cites a world speed record for making a large number of noodles using the algorithm with the maximal complexity. It shows how computational thinking and other topics can be introduced in the same manner. It concludes by mentioning avenues for further studies.","authors":["Luisa Mich","Daniel Berry"],"meta":["January 2018Journal of E-Learning and Knowledge Society 14(3):77-92","DOI:10.20368/1971-8829/1399"],"references":["315636456_Computational_thinking_for_teacher_education","299605105_The_Computational_Complexity_of_Chinese_and_Italian_Noodle_Making","262206587_Students_misconceptions_in_analysis_of_algorithmic_and_computational_complexity_of_problems","234812396_Education_Paving_the_way_for_computational_thinking","220420371_Computational_thinking","2953834_Computing_as_a_discipline","234830142_The_Art_of_Computer_Programming_Volume_1_Fascicle_1_MMIX_--_A_RISC_Computer_for_the_New_Millennium_Art_of_Computer_Programming","220425566_Curriculum_68_Recommendations_for_academic_programs_in_computer_science_A_report_of_the_ACM_curriculum_committee_on_computer_science"]}