{"id":"330180412_SKEW_CYCLIC_CODES_OVER_F_4_R","abstract":"This paper considers a new alphabet set, which is a ring that we call F 4 R, to construct linear error-control codes. Skew cyclic codes over the ring are then investigated in details. We define a nondegenerate inner product and provide a criteria to test for self-orthogonality. Results on the algebraic structures lead us to characterize F 4 R-skew cyclic codes. Interesting connections between the image of such codes under the Gray map to linear cyclic and skew-cyclic codes over F 4 are shown. These allow us to learn about the relative dimension and distance profile of the resulting codes. Our setup provides a natural connection to DNA codes where additional biomolecular constraints must be incorporated into the design. We present a characterization of R-skew cyclic codes which are reversible complement. 1. Introduction. The use of noncommutative rings to construct error control codes has recently been an active research area, initiated by the seminal works of Boucher et al. in [8] and [9] as well as that of Abualrub et al. in [1]. In the first two, Boucher and collaborators generalized the notion of cyclic codes by using generator polynomials in a noncommutative polynomial ring called the skew polynomial ring. They supplied examples of skew cyclic codes with Hamming distances larger than previously best-known linear codes of the same length and dimension. In [1], Abualrub et al. generalized the concept of skew cyclic codes to skew quasi-cyclic codes. They then constructed several new codes with Hamming distances exceeding the Hamming distances of the previously best-known linear codes with comparable parameters.","authors":["Nasreddine Benbelkacem","Frederic Martianus","Martianus Frederic Ezerman","Taher Abualrub"],"meta":["December 2018","Project: Skew Cylic Codes over F4R"],"references":["308603176_24-additive_cyclic_codes","304759600_The_Art_of_DNA_Strings_Sixteen_Years_of_DNA_Coding_Theory","284777052_On_combinatorial_DNA_word_design","278114792_-Additive_Cyclic_Codes","277335075_New_DNA_Cyclic_Codes_over_Rings","265024268_Skew_Constacyclic_Codes_over_Galois_Rings","262277871_Some_Results_on_Cyclic_Codes_Over","295399187_A_new_faster_algorithm_for_factoring_skew_polynomials_over_finite_fields","279768377_Construction_of_skew_cyclic_codes_over_mathbb_F_qvmathbb_F_q","279169702_Codes_over_F_4vF_4_and_some_DNA_applications"]}