{"id":"330217146_Socioecologically_informed_use_of_remote_sensing_data_to_predict_rural_household_poverty","abstract":"Tracking the progress of the Sustainable Development Goals (SDGs) and targeting interventions requires frequent, up-to-date data on social, economic, and ecosystem conditions. Monitoring socioeconomic targets using household survey data would require census enumeration combined with annual sample surveys on consumption and socioeconomic trends. Such surveys could cost up to $253 billion globally during the lifetime of the SDGs, almost double the global development assistance budget for 2013. We examine the role that satellite data could have in monitoring progress toward reducing poverty in rural areas by asking two questions: ( i ) Can household wealth be predicted from satellite data? ( ii ) Can a socioecologically informed multilevel treatment of the satellite data increase the ability to explain variance in household wealth? We found that satellite data explained up to 62% of the variation in household level wealth in a rural area of western Kenya when using a multilevel approach. This was a 10% increase compared with previously used single-level methods, which do not consider details of spatial landscape use. The size of buildings within a family compound (homestead), amount of bare agricultural land surrounding a homestead, amount of bare ground inside the homestead, and the length of growing season were important predictor variables. Our results show that a multilevel approach linking satellite and household data allows improved mapping of homestead characteristics, local land uses, and agricultural productivity, illustrating that satellite data can support the data revolution required for monitoring SDGs, especially those related to poverty and leaving no one behind.","authors":["Gary R Watmough","Charlotte LJ Marcinko","Clare C Sullivan","Kevin Tschirhart"],"meta":["January 2019Proceedings of the National Academy of Sciences 116(4):201812969","DOI:10.1073/pnas.1812969116","Project: Understanding Social-Ecological Systems"],"references":["313256952_Mapping_poverty_using_mobile_phone_and_satellite_data","312921701_Costing_Household_Surveys_for_Monitoring_Progress_Toward_Ending_Extreme_Poverty_and_Boosting_Shared_Prosperity","308958238_An_operational_framework_for_object-based_land_use_classification_of_heterogeneous_rural_landscapes","347512657_Costing_Household_Surveys_for_Monitoring_Progress_Toward_Ending_Extreme_Poverty_and_Boosting_Shared_Prosperity","321458626_Using_volunteered_geographic_information_to_assess_park_visitation_Comparing_three_on-line_platforms","314434689_Mind_the_Gap_Analyzing_the_Impact_of_Data_Gap_in_Millennium_Development_Goals'_MDGs_Indicators_on_the_Progress_toward_MDGs","313784503_Satellite-based_assessment_of_yield_variation_and_its_determinants_in_smallholder_African_systems","309436560_Market_Access_Well-being_and_Nutrition_Evidence_from_Ethiopia","306300024_Combining_satellite_imagery_and_machine_learning_to_predict_poverty","301578303_Toward_the_Integrated_Framework_Analysis_of_Linkages_among_Agrobiodiversity_Livelihood_Diversification_Ecological_Systems_and_Sustainability_amid_Global_Change"]}