{"id":"330252186_Some_Topological_and_Algebraic_Properties_of_a-level_Subsets'_Topology_of_a_Fuzzy_Subset","abstract":"The theory of fuzzy sets, since its foundation, has advanced in a wide range of means and in many fields. One of the areas to which fuzzy set theory has been applied extensively is mathematical programming. Nevertheless, the applications of fuzzy theory can be found in e.g. logic, decision theory, artificial intelligence, computer science, control engineering, expert systems, management science, operations research, robotics, and others. Theoretical improvements have been made in many directions. Nowadays it has a lot of applications also on possibility theory, actuarial credibility theory, fuzzy logic and approximate reasoning, fuzzy control, fuzzy data analysis, fuzzy set models in operations research, etc. The aim of this paper is to investigate some topological properties of a set X when the topology defined on it is the collection of all the α-level subsets of a fuzzy subset A of X .\nWe have been able to establish some results regarding fuzzy cluster level subsets, convergence of level subsets and quasicompactness among others.","authors":["Babatunde Oluwaseun Onasanya","Šárka Hošková-Mayerová"],"meta":["December 2018Analele Universitatii Ovidius Constanta - Seria Matematica 26(3):213-227","DOI:10.2478/auom-2018-0042"],"references":["323382932_Some_connections_between_BCK-algebras_and_n-ary_block_codes","322340249_Height_of_prime_hyperideals_in_Krasner_hyperrings","284206775_SOME_TOPOLOGICAL_CONCEPTS_VIA_LEVEL_SUBSETS_OF_A_FUZZY_SUBSET","323982256_An_overview_of_topological_hypergroupoids","318186080_Consensus_in_Multiperson_Decision_Making_Using_Fuzzy_Coalitions","314127196_A_new_type_of_fuzzy_subsemihypermodules","282819924_Comparison_Of_regression_and_fuzzy_estimates_on_field_oil_data","268720526_On_the_level_spaces_of_fuzzy_topological_spaces","267463651_Fuzziness_in_Chang's_fuzzy_topological_spaces","265897703_Some_results_on_fuzzy_topology_on_fuzzy_sets"]}