{"id":"330264946_Fairness_and_Abstraction_in_Sociotechnical_Systems","abstract":"A key goal of the fair-ML community is to develop machine-learning based systems that, once introduced into a social context, can achieve social and legal outcomes such as fairness, justice, and due process. Bedrock concepts in computer science---such as abstraction and modular design---are used to define notions of fairness and discrimination, to produce fairness-aware learning algorithms, and to intervene at different stages of a decision-making pipeline to produce \"fair\" outcomes. In this paper, however, we contend that these concepts render technical interventions ineffective, inaccurate, and sometimes dangerously misguided when they enter the societal context that surrounds decision-making systems. We outline this mismatch with five \"traps\" that fair-ML work can fall into even as it attempts to be more context-aware in comparison to traditional data science. We draw on studies of sociotechnical systems in Science and Technology Studies to explain why such traps occur and how to avoid them. Finally, we suggest ways in which technical designers can mitigate the traps through a refocusing of design in terms of process rather than solutions, and by drawing abstraction boundaries to include social actors rather than purely technical ones.","authors":["Andrew D. Selbst","danah boyd","Sorelle A. Friedler","Suresh Venkatasubramanian"],"meta":["January 2019","DOI:10.1145/3287560.3287598","Conference: the Conference"],"references":["322049042_Interventions_over_Predictions_Reframing_the_Ethical_Debate_for_Actuarial_Risk_Assessment","333054437_Where_fairness_fails_data_algorithms_and_the_limits_of_antidiscrimination_discourse","330550324_Data_Statements_for_Natural_Language_Processing_Toward_Mitigating_System_Bias_and_Enabling_Better_Science","330268857_Model_Cards_for_Model_Reporting","329645053_Wired_Shut_Copyright_and_the_Shape_of_Digital_Culture","324956353_Algorithmic_psychometrics_and_the_scalable_subject","324717356_A_Nutritional_Label_for_Rankings","324377612_Artificial_Experts_Social_Knowledge_and_Intelligent_Machines","324055506_Datasheets_for_Datasets","323627230_A_Reductions_Approach_to_Fair_Classification"]}