{"id":"330223326_The_statistical_physics_of_real-world_networks","abstract":"Statistical physics is the natural framework to model complex networks. In the last twenty years, it has brought novel physical insights on a variety of emergent phenomena, such as self-organisation, scale invariance, mixed distributions and ensemble non-equivalence, which cannot be deduced from the behaviour of the individual constituents. At the same time, thanks to its deep connection with information theory, statistical physics and the principle of maximum entropy have led to the definition of null models reproducing some features of empirical networks, but otherwise as random as possible. We review here the statistical physics approach for complex networks and the null models for the various physical problems, focusing in particular on the analytic frameworks reproducing the local features of the network. We show how these models have been used to detect statistically significant and predictive structural patterns in real-world networks, as well as to reconstruct the network structure in case of incomplete information. We further survey the statistical physics frameworks that reproduce more complex, semi-local network features using Markov chain Monte Carlo sampling, and the models of generalised network structures such as multiplex networks, interacting networks and simplicial complexes.","authors":["Giulio Cimini","Tiziano Squartini","Fabio Saracco","Diego Garlaschelli"],"meta":["January 2019","DOI:10.1038/s42254-018-0002-6"],"references":["326257450_Reconstruction_methods_for_networks_The_case_of_economic_and_financial_systems","320975965_Maximum_Caliber_a_general_variational_principle_for_dynamical_systems","320975934_Breaking_the_spell_of_nestedness","318487899_Unfolding_the_innovation_system_for_the_development_of_countries_co-evolution_of_Science_Technology_and_Production","317230341_Construction_of_and_efficient_sampling_from_the_simplicial_configuration_model","316884901_Enhanced_capital-asset_pricing_model_for_bipartite_financial_networks_reconstruction","346922316_Breaking_the_spell_of_nestedness","320755216_Reconnecting_statistical_physics_and_combinatorics_beyond_ensemble_equivalence","317246904_The_missing_links_A_global_study_on_uncovering_financial_network_structures_from_partial_data","314943337_Grand_canonical_validation_of_the_bipartite_International_Trade_Network"]}