{"id":"330213345_Beyond_the_Here_and_Now_of_News_Audiences_A_Process-Based_Framework_for_Investigating_News_Repertoires","abstract":"Research into people’s digital news use centres on the here and now, which means sustained attention to the processes influencing changing consumption patterns is often perfunctory. Accordingly, this article advances journalism studies scholarship by developing a comprehensive analytical framework to investigate such processes, focusing on the emergence, maintenance, and (re)formation of audiences’ news repertoires in everyday life and across the lifespan. First, we delineate the repertoire concept and its insights for audience research, before crafting a heuristic to illustrate how faster and slower timescales interact to influence these practices. We then synthesize diverse concepts of different theoretical ancestry to develop analytical prisms around socio-spatial context, technology, and the individual, which guide research inquiries alert to the transformational processes of news repertoires. Finally, we introduce an empirical agenda to operationalize our conceptual treatment, elucidating methodological premises around diachronic change, identity-formation, and sense-making that capture why publics develop a relationship with journalism.","authors":["Chris Peters","Kim Christian Schrøder"],"meta":["December 2018Journal of Communication 68(6):1079-1103","DOI:10.1093/joc/jqy060","Project: Beyond the Here and Now of News"],"references":["325174319_Fusion_cuisine_A_functional_approach_to_interdisciplinary_cooking_in_journalism_studies","324949376_Shedding_light_on_the_dark_social_The_connective_role_of_news_and_journalism_in_social_media_communities","324807890_Approximately_Informed_Occasionally_Monitorial_Reconsidering_Normative_Citizen_Ideals","324551228_I_Just_Google_It_Folk_Theories_of_Distributed_Discovery","345530881_Making_Audience_Engagement_Visible","345242790_Journalism_and_New_Media","325954333_The_crisis_of_journalism_reconsidered_Democratic_culture_professional_codes_digital_future","324685739_From_Liberal_to_Polarized_Liberal_Contemporary_US_News_in_Hallin_and_Mancini's_Typology_of_News_Systems","323766582_Temporal_reflexivity_in_journalism_studies_Making_sense_of_change_in_a_more_timely_fashion","323196467_Journalism_Studies_and_its_Core_Commitments_The_Making_of_a_Communication_Field"]}