{"id":"330222294_Learning_a_Set_of_Interrelated_Tasks_by_Using_a_Succession_of_Motor_Policies_for_a_Socially_Guided_Intrinsically_Motivated_Learner","abstract":"We aim at a robot capable to learn sequences of actions to achieve a field of complex tasks. In this paper, we are considering the learning of a set of interrelated complex tasks hierarchically organized. To learn this high-dimensional mapping between a continuous high-dimensional space of tasks and an infinite dimensional space of unbounded sequences of actions, we introduce a new framework called \"procedures\", which enables the autonomous discovery of how to combine previously learned skills in order to learn increasingly complex combinations of motor policies. We propose an active learning algorithmic architecture, capable of organizing its learning process in order to achieve a field of complex tasks by learning sequences of primitive motor policies. Based on heuristics of active imitation learning, goal-babbling and strategic learning using intrinsic motivation, our algorithmic architecture leverages our procedures framework to actively decide during its learning process which outcome to focus on and which exploration strategy to apply. We show on a simulated environment that our new architecture is capable of tackling the learning of complex motor policies by adapting the complexity of its policies to the task at hand. We also show that our \"procedures\" enable the learning agent to discover the task hierarchy and exploit his experience of previously learned skills to learn new complex tasks.","authors":["Nicolas Duminy","Sao Mai Nguyen","Dominique Duhaut"],"meta":["January 2019Frontiers in Neurorobotics 12:87","DOI:10.3389/fnbot.2018.00087","Project: Intrinsic Motivation and Active Imitation"],"references":["324251060_Learning_a_Set_of_Interrelated_Tasks_by_Using_Sequences_of_Motor_Policies_for_a_Strategic_Intrinsically_Motivated_Learner","313541747_Strategic_and_interactive_learning_of_a_hierarchical_set_of_tasks_by_the_Poppy_humanoid_robot","311959082_Autonomous_exploration_of_motor_skills_by_skill_babbling","303358934_GRAIL_A_Goal-Discovering_Robotic_Architecture_for_Intrinsically-Motivated_Learning","323184404_GEP-PG_Decoupling_Exploration_and_Exploitation_in_Deep_Reinforcement_Learning_Algorithms","318981596_Intrinsically_Motivated_Goal_Exploration_Processes_with_Automatic_Curriculum_Learning","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","314237753_A_Laplacian_Framework_for_Option_Discovery_in_Reinforcement_Learning","301880279_Hierarchical_Deep_Reinforcement_Learning_Integrating_Temporal_Abstraction_and_Intrinsic_Motivation","285433839_Behavioral_Hierarchy_Exploration_and_Representation"]}