{"id":"330238993_D-SKY_A_Framework_for_Processing_Skyline_Queries_in_a_Dynamic_and_Incomplete_Database","abstract":"Processing skyline queries in incomplete data is challenging, particularly, for a database with dynamic contents in which the database is frequently updated. These update operations not only affect the skyline computation, but also influence the skyline results. Furthermore, the incompleteness of data raises the issue of losing transitivity property of skyline technique, which leads to the problem of cyclic dominance. It is undesirable to process skyline queries on a dynamic and incomplete database by directly applying skyline process over the entire updated database due to the prohibitive cost. Thus, this paper proposes a framework called D-SKY for processing skyline queries in a dynamic and incomplete database. D-SKY aims at avoiding scanning the whole database after an update operation is performed to identify the new skylines. In this paper, we consider the case of an insert operation, in which database is updated by adding new data items. D-SKY framework exploits the existing skylines to identify the newly added dominated data items before applying the skyline process. Therefore, a large amount of dominated data items is pruned, which reduces the number of domination tests to be conducted and helps in avoiding scanning the whole data after an update operation is performed. Experiment result conducted on both real and synthetic datasets demonstrates that our solution outperforms the existing solutions in terms of reducing the number of pairwise comparisons and processing time.","authors":["Yonis Gulzar","Ali Amer Alwan","Hamidah Ibrahim","Qin Xin"],"meta":["November 2018","DOI:10.1145/3282373.3282389","Conference: The 20th International Conference on Information Integration and Web-based Applications & Services (iiWAS2018)At: Yogyakarta, Indonesia","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["321488533_A_Model_for_Processing_Skyline_Queries_in_Crowd-sourced_Databases","321026185_Processing_Skyline_Queries_in_Incomplete_Data_Issues_Challenges_and_Future_Trends","317011909_Skyline_Query_Processing_for_Incomplete_Data_in_Cloud_Environment","313249480_Imperfect_Top-k_Skyline_Query_with_Confidence_Level","311381585_A_Model_for_Skyline_Query_Processing_in_a_Partially_Complete_Database","321123046_Skyline_Queries_over_Possibilistic_RDF_Data","317611464_Processing_skyline_queries_in_temporal_databases","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries","313830633_Skyline_Preference_Query_Based_on_Massive_and_Incomplete_Dataset","311755784_A_new_efficient_algorithm_for_continuous_skyline_queries"]}