{"id":"330203191_Designing_neural_networks_through_neuroevolution","abstract":"Much of recent machine learning has focused on deep learning, in which neural network weights are trained through variants of stochastic gradient descent. An alternative approach comes from the field of neuroevolution, which harnesses evolutionary algorithms to optimize neural networks, inspired by the fact that natural brains themselves are the products of an evolutionary process. Neuroevolution enables important capabilities that are typically unavailable to gradient-based approaches, including learning neural network building blocks (for example activation functions), hyperparameters, architectures and even the algorithms for learning themselves. Neuroevolution also differs from deep learning (and deep reinforcement learning) by maintaining a population of solutions during search, enabling extreme exploration and massive parallelization. Finally, because neuroevolution research has (until recently) developed largely in isolation from gradient-based neural network research, it has developed many unique and effective techniques that should be effective in other machine learning areas too. This Review looks at several key aspects of modern neuroevolution, including large-scale computing, the benefits of novelty and diversity, the power of indirect encoding, and the field’s contributions to meta-learning and architecture search. Our hope is to inspire renewed interest in the field as it meets the potential of the increasing computation available today, to highlight how many of its ideas can provide an exciting resource for inspiration and hybridization to the deep learning, deep reinforcement learning and machine learning communities, and to explain how neuroevolution could prove to be a critical tool in the long-term pursuit of artificial general intelligence.","authors":["Kenneth O. Stanley","Jeff Clune","Joel Lehman","Risto Miikkulainen"],"meta":["January 2019Nature Machine Intelligence 1(1)","DOI:10.1038/s42256-018-0006-z"],"references":["326546430_The_Surprising_Creativity_of_Digital_Evolution","338681644_Neural_Architecture_Search_A_Survey","338511824_AutoAugment_Learning_Augmentation_Strategies_From_Data","338488196_Continual_Learning_Through_Synaptic_Intelligence","334381452_Evolutionary_computation_a_unified_approach","333493043_Human-level_performance_in_3D_multiplayer_games_with_population-based_reinforcement_learning","330466330_Evolving_embodied_intelligence_from_materials_to_machines","329745708_Learning_Transferable_Architectures_for_Scalable_Image_Recognition","326609848_Differentiable_Image_Parameterizations","326164138_Evolutionary_architecture_search_for_deep_multitask_networks"]}