{"id":"330214312_Area_Equivalent_WKB_Compact_Modeling_Approach_for_Tunneling_Probability_in_Hetero-Junction_TFETs_Including_Ambipolar_Behavior","abstract":"This paper introduces an innovative modeling approach\nfor calculating the band-to-band (B2B) tunneling probability\nin tunnel-field effect transistors (TFETs). The field of\napplication is the usage in TFET compact models.\nLooking at a tunneling process in TFETs, carriers try to\ntunnel through an energy barrier which is defined by the device\nband diagram. The tunneling energy barrier is approximated by\nan approach which assumes an area equivalent (AE) triangular\nshaped energy profile. The simplified energy triangle is suitable to\nbe used in theWentzel-Kramers-Brillouin (WKB) approximation.\nReferring to the area instead of the electric field at individual\npoints is shown to be a more robust approach in terms of\nnumerical stability. The derived AE approach is implemented\nin an existing compact model for double-gate (DG) TFETs.\n\nIn order to verify and show the numerical stability of this\napproach, modeling results are compared to TCAD Sentaurus\nsimulation data for various sets of device parameters, whereby\nthe simulations include both ON- and AMBIPOLAR-state of\nthe TFET. In addition to the various device dimensions, the\nsource material is also changed to demonstrate the feasibility of\nsimulating hetero-junctions. Comparing the modeling approach\nwith TCAD data shows a good match. Apart the limitations\ndemonstrated and discussed in this paper, the main advantage\nof the AE approach is the simplicity and a better fit to TCAD\ndata in comparison to the quasi-2D WKB approach.\n------------\nPublished in: International Journal of Microelectronics and Computer Science 2018, Volume 9, Number 2.\n\n(URL: https://ijmcs.dmcs.pl/documents/10630/360081/IJMCS_2_2018_1.pdf )","authors":["Fabian Horst","Atieh Farokhnejad","Ghader Darbandy","Benjamin Iniguez"],"meta":["December 2018","Project: Compact Modeling and Device Physics of TFETs, Junctionless FETs, TriGate FETs, Organic FETs, Neuromorphic, etc."],"references":["230667746_Complex_2D_electric_field_solution_in_undoped_double-gate_MOSFETs","327092377_An_Area_Equivalent_WKB_Approach_to_Calculate_the_B2B_Tunneling_Probability_for_a_Numerical_Robust_Implementation_in_TFET_Compact_Models","326726128_2-D_Physics-Based_Compact_DC_Modeling_of_Double-Gate_Tunnel-FETs","309343115_Implementation_of_a_DC_compact_model_for_double-gate_Tunnel-FET_based_on_2D_calculations_and_application_in_circuit_simulation","287243947_Physics_of_Semiconductor_Devices_Third_Edition","271417181_Improved_analytical_potential_modeling_in_double-gate_tunnel-FETs","262806173_A_2D_closed_form_model_for_the_electrostatics_in_hetero-junction_double-gate_tunnel-FETs_for_calculation_of_band-to-band_tunneling_current","260712092_SPICE_modeling_of_double-gate_tunnel-FETs_including_channel_transports","251947218_Tunnel_field-effect_transistors_-_Status_and_prospects","230660702_Simulation_of_Tunneling_in_Semiconductor_Devices"]}