{"id":"330218353_Anomalous_one-dimensional_fluctuations_of_a_simple_two-dimensional_random_walk_in_a_large-deviation_regime","abstract":"The following question is the subject of our work: could a two-dimensional (2D) random path pushed by some constraints to an improbable “large-deviation regime” possess extreme statistics with one-dimensional (1D) Kardar-Parisi-Zhang (KPZ) fluctuations? The answer is positive, though nonuniversal, since the fluctuations depend on the underlying geometry. We consider in detail two examples of 2D systems for which imposed external constraints force the underlying stationary stochastic process to stay in an atypical regime with anomalous statistics. The first example deals with the fluctuations of a stretched 2D random walk above a semicircle or a triangle. In the second example we consider a 2D biased random walk along a channel with forbidden voids of circular and triangular shapes. In both cases we are interested in the dependence of a typical span d(t)∼tγ of the trajectory of t steps above the top of the semicircle or the triangle. We show that γ=13, i.e., d(t) shares the KPZ statistics for the semicircle, while γ=0 for the triangle. We propose heuristic derivations of scaling exponents γ for different geometries, justify them by explicit analytic computations, and compare with numeric simulations. For practical purposes, our results demonstrate that the geometry of voids in a channel might have a crucial impact on the width of the boundary layer and, thus, on the heat transfer in the channel.","authors":["Sergei Nechaev","Kirill Polovnikov","Семён Шлосман","Alexander Valov"],"meta":["January 2019PHYSICAL REVIEW E 99(1)","DOI:10.1103/PhysRevE.99.012110"],"references":["260992855_An_Invariance_Principle_to_Ferrari-Spohn_Diffusions","231082550_Exact_solution_of_a_1D_asymmetric_exclusion_model_using_a_matrix_formulation","228541221_Roughness_in_surface_growth_equations","316268109_Springer_Series_in_Materials_Science","311612207_Statistics_of_the_maximal_distance_and_momentum_in_a_trapped_Fermi_gas_at_low_temperature","262032184_Universal_Distributions_for_Growth_Processes_in_1_1_Dimensions_and_Random_Matrices","258309109_Bethe_ansatz_replica_derivation_of_the_GOE_Tracy-Widom_distribution_in_one-dimensional_directed_polymers_with_free_endpoints","253446698_Theory_of_Fluctuation_Levels_in_Disordered_Systems","225962706_Limiting_Distributions_for_a_Polynuclear_Growth_Model_with_External_Sources","224043978_Ballistic_Deposition_on_Surfaces"]}