{"id":"330293336_Determining_the_operational_status_of_a_Three_Phase_Induction_Motor_using_a_predictive_data_mining_model","abstract":"The operational performance of a three-phase induction motor is impaired by unbalanced voltage supply due to the generation of negative sequence currents, and negative sequence torque which increase motor losses and also trigger torque pulsations. In this study, data mining approach was applied in developing a predictive model using the historical, simulated operational data of a motor for classifying sample motor data under the appropriate type of voltage supply i.e. balanced (BV) and unbalance voltage supply (UB = 1% to 5%). A dataset containing the values of a three-phase induction motor’s performance parameter values was analysed using KNIME (Konstanz Information Miner) analytics platform. Three predictive models; the Naïve Bayes, Decision Tree and the Probabilistic Neural Network (PNN) Predictors were deployed for comparative analysis. The dataset was divided into two; 70% for model training and learning, and 30% for performance evaluation. The three predictors had accuracies of 98.649%, 100% and 98.649% respectively, and this confirms the suitability of data mining methods for predictive evaluation of a three-phase induction motor’s performance using machine learning. © 2019 Institute of Advanced Engineering and Science. All rights reserved.","authors":["A.I. Adekitan","Adeyinka Ajao Adewale","Olaitan Alashiri"],"meta":["March 2019International Journal of Power Electronics and Drive Systems 10(1):93-103","DOI:10.11591/ijpeds.v10.i1.pp93-103","Project: Performance investigation of Three Phase Induction Motor (TPIM)"],"references":["330653173_A_Novel_Control_Strategy_for_Compensation_of_Voltage_Quality_Problem_in_AC_Drives","326684081_Cost_implication_of_Line_Voltage_variation_on_Three_Phase_Induction_Motor_operation","326490817_Supply_instability_induced_torque_variations_of_a_three_phase_asynchronous_motor","326050492_Detection_of_Voltage_Unbalance_on_Three_Phase_Induction_Motor_Using_Artificial_Neural_Network","321164553_The_performance_of_a_3-Phase_Induction_Machine_under_Unbalance_Voltage_Regime","320748312_Optimizing_Parallelism_of_Big_Data_Analytics_at_Distributed_Computing_System","319404075_A_Survey_on_Web_Mining_Techniques_and_Applications","317830107_Classification_of_Power_Quality_Disturbances_at_Transmission_System_Using_Support_Vector_Machines","328138162_Precise_derating_of_three_phase_induction_motors_with_unbalanced_voltages","324163989_Detection_and_diagnosis_of_induction_motor_bearing_faults_using_multiwavelet_transform_and_naive_Bayes_classifier"]}