{"id":"330252248_A_Framework_for_Multidisciplinary_Business_Simulations","abstract":"In this paper, the design and introduction of a framework for multidisciplinary business simulations at the School of Public Administration of Kehl University will be presented. Within Kehl’s Public Administration study program, various subjects like organization, law, human resources, computer sciences, finance, psychology and economics are supported in an interdisciplinary way. Both theoretical and scientific skills as well as soft skills such as teamwork, project management and coordination will be further developed by using an interdisciplinary approach. A framework for multidisciplinary business simulations has been developed to support this interdisciplinary approach. The framework integrates realistic and practical simulations of interdisciplinary case studies into the study program of Public administration at Kehl University. In order to reduce costs for case study development, the framework offers a generic case study pattern. This pattern was purposefully developed and covers very different disciplines in the best possible way so that the students can conduct simulations that are realistic and possible during their studies. Further, two different simulation implementations of the case studies were designed within the framework for multidisciplinary business simulations. A short-term simulation intends to check the ongoing learning success. A long-term simulation aims for giving students feedback concerning their skills just before graduating. The case studies based on the generic case study pattern come from a wide variety of public administration tasks. Examples of currently conceived case studies include e-invoicing, IT-infrastructure for schools and IT-office workplaces. The case studies were developed together with practitioners from municipalities and local agencies in order to create realistic simulations. This addresses the actual complexity of the future working environment of students. The comprehensive application of knowledge learnt in different subjects motivates students to work on these case studies.","authors":["Uwe Busbach","Antje Dietrich"],"meta":["December 2018Economics and Culture 15(2):55-63","DOI:10.2478/jec-2018-0020"],"references":["347466707_Managing_the_Inclusion_Process_in_Collaborative_Governance","345597935_Concluding_Thoughts_Perspectives_on_Training_and_Education_for_the_Public_Service","331179638_Adaptive_Administration_Practice_Strategies_for_Dealing_with_Constant_Change_in_Public_Administration_and_Policy","330332050_The_Future_of_Learning_Institutions_in_a_Digital_Age","326026622_What_individual_and_organizational_competencies_facilitate_effective_collaboration_Findings_from_a_collaborative_governance_simulation","321370051_Education_and_Training_in_Public_Administration_and_Management_in_Europe","320688306_A_meta-analysis_with_examination_of_moderators_of_student_cognition_affect_and_learning_outcomes_while_using_serious_educational_games_serious_games_and_simulations","318590835_Experiential_Learning_in_Management_Education","318528595_A_study_of_supplementing_conventional_business_education_with_digital_games","313252842_An_assessment_of_the_effectiveness_of_moodle_e-learning_system_for_undergraduate_Public_Administration_education","312323717_An_assessment_of_the_effectiveness_of_Moodle_e-learning_system_for_undergraduate_public_administration_education","261966743_Managing_the_Inclusion_Process_in_Collaborative_Governance","313080007_Collaborative_governance_in_theory_and_practice","297167578_A_practical_approach_to_the_complex_problem_of_environmental_sustainability_The_UVa_Bay_Game","290619774_Viewpoints_on_learning_and_education_with_simulation_games"]}