{"id":"330277469_La_motivation_des_apprenants_dans_une_situation_de_formation_a_distance_mediatee_par_un_dispositif_immersif","abstract":"Le concept de « motivation » se distingue par une multitude d’approches et d’études déterminant ses aspects et ses impacts dans le champ des sciences humaines et sociales. Il se présente comme un élément important pour mobiliser le facteur humain et stimuler son niveau de performance. En référence aux sciences de l’information et de la communication et aux sciences de l’éducation, la motivation, de type intrinsèque ou extrinsèque, se manifeste dans un environnement qui favorise, parmi d’autres, l’expression, l’interaction et l’engagement. Dans une vision d’apprentissage, les pratiques de formation évoluent introduisant de nouvelles techniques sophistiquées, plus efficaces, telles que l’usage de dispositifs immersifs de formation à distance. Dès lors, notre thèse se penche sur l’étude du phénomène de la motivation au sein d’un dispositif sociotechnique animé par des avatars. Ceci va montrer la force de l’immersion dans le monde virtuel et son impact sur la motivation de l’usager de ce système de communication. Il s’agit donc de traiter une problématique traduisant les ambitions de l’apprenant de réussir son concours de Ma thèse en 180 secondes en combinant les pratiques et l’environnement qui stimulent son comportement au cours de sa formation. Un apprentissage favorisant la motivation par l’usage des personnages virtuels reproduisant les mouvements et les émotions de l’usager est un nouveau modèle de médiation porteur dans les sciences de l’information et de la communication.Notre thèse est d’avancer un outil de formation à distance qui optimise la communication entre les apprenants et leurs enseignants et développe un cercle d’apprentissage basé sur la motivation. Notre choix méthodologique est fondé sur une approche compréhensive permettant d’élucider la nature des liens conçus entre le monde réel et le monde virtuel mettant en interaction un sujet et son avatar. Pour ce faire, une expérimentation est engagée sur notre terrain de recherche, balisée par des techniques d’observations et d’entretiens qualitatifs afin de comprendre la nature des liens forgés entre les acteurs du système immersif et de saisir les stimuli de la motivation de l’apprenant dans une mise en situation de formation à distance.","authors":["Adil Boujibar"],"meta":["December 2017"],"references":[]}