{"id":"330298395_Fully_Automatic_Treatment_Planning_for_External-Beam_Radiation_Therapy_of_Locally_Advanced_Cervical_Cancer_A_Tool_for_Low-Resource_Clinics","abstract":"Purpose: \nThe purpose of this study was to validate a fully automatic treatment planning system for conventional radiotherapy of cervical cancer. This system was developed to mitigate staff shortages in low-resource clinics.\n\nMethods: \nIn collaboration with hospitals in South Africa and the United States, we have developed the Radiation Planning Assistant (RPA), which includes algorithms for automating every step of planning: delineating the body contour, detecting the marked isocenter, designing the treatment-beam apertures, and optimizing the beam weights to minimize dose heterogeneity. First, we validated the RPA retrospectively on 150 planning computed tomography (CT) scans. We then tested it remotely on 14 planning CT scans at two South African hospitals. Finally, automatically planned treatment beams were clinically deployed at our institution.\n\nResults: \nThe automatically and manually delineated body contours agreed well (median mean surface distance, 0.6 mm; range, 0.4 to 1.9 mm). The automatically and manually detected marked isocenters agreed well (mean difference, 1.1 mm; range, 0.1 to 2.9 mm). In validating the automatically designed beam apertures, two physicians, one from our institution and one from a South African partner institution, rated 91% and 88% of plans acceptable for treatment, respectively. The use of automatically optimized beam weights reduced the maximum dose significantly (median, -1.9%; P < .001). Of the 14 plans from South Africa, 100% were rated clinically acceptable. Automatically planned treatment beams have been used for 24 patients with cervical cancer by physicians at our institution, with edits as needed, and its use is ongoing.\n\nConclusion: \nWe found that fully automatic treatment planning is effective for cervical cancer radiotherapy and may provide a reliable option for low-resource clinics. Prospective studies are ongoing in the United States and are planned with partner clinics.","authors":["Kelly Kisling","Lifei Zhang","Hannah Simonds","Nazia Fakie"],"meta":["January 2019Journal of Global Oncology 5(2019):1-9","DOI:10.1200/JGO.18.00107"],"references":["327058159_Retrospective_Validation_and_Clinical_Implementation_of_Automated_Contouring_of_Organs_at_Risk_in_the_Head_and_Neck_A_Step_Toward_Automated_Radiation_Treatment_Planning_for_Low-_and_Middle-Income_Coun","324481558_Radiation_Planning_Assistant_-_A_Streamlined_Fully_Automated_Radiotherapy_Treatment_Planning_System","303536745_Management_and_Care_of_Women_With_Invasive_Cervical_Cancer_American_Society_of_Clinical_Oncology_Resource-Stratified_Clinical_Practice_Guideline","268695533_Need_for_Radiotherapy_in_Low_and_Middle_Income_Countries_-_The_Silent_Crisis_Continues","319314808_Measuring_Safety_Culture_Application_of_The_Hospital_Survey_on_Patient_Safety_Culture_to_Radiotherapy_Departments_Worldwide","311524778_Cardiac_atlas_development_and_validation_for_automatic_segmentation_of_cardiac_substructures","309106554_Transitions_in_human_development_and_the_global_cancer_burden","304404553_Cancer_incidence_and_mortality_worldwide_Sources_methods_and_major_patterns_in_GLOBOCAN_2012","262786280_A_streamlined_failure_mode_and_effects_analysis","262386354_Estimating_the_demand_for_radiotherapy_from_the_evidence_A_review_of_changes_from_2003_to_2012"]}