{"id":"330220322_BO-LSTM_Classifying_relations_via_long_short-term_memory_networks_along_biomedical_ontologies","abstract":"Background\nRecent studies have proposed deep learning techniques, namely recurrent neural networks, to improve biomedical text mining tasks. However, these techniques rarely take advantage of existing domain-specific resources, such as ontologies. In Life and Health Sciences there is a vast and valuable set of such resources publicly available, which are continuously being updated. Biomedical ontologies are nowadays a mainstream approach to formalize existing knowledge about entities, such as genes, chemicals, phenotypes, and disorders. These resources contain supplementary information that may not be yet encoded in training data, particularly in domains with limited labeled data.\n\nResults\nWe propose a new model to detect and classify relations in text, BO-LSTM, that takes advantage of domain-specific ontologies, by representing each entity as the sequence of its ancestors in the ontology. We implemented BO-LSTM as a recurrent neural network with long short-term memory units and using open biomedical ontologies, specifically Chemical Entities of Biological Interest (ChEBI), Human Phenotype, and Gene Ontology. We assessed the performance of BO-LSTM with drug-drug interactions mentioned in a publicly available corpus from an international challenge, composed of 792 drug descriptions and 233 scientific abstracts. By using the domain-specific ontology in addition to word embeddings and WordNet, BO-LSTM improved the F1-score of both the detection and classification of drug-drug interactions, particularly in a document set with a limited number of annotations. We adapted an existing DDI extraction model with our ontology-based method, obtaining a higher F1 score than the original model. Furthermore, we developed and made available a corpus of 228 abstracts annotated with relations between genes and phenotypes, and demonstrated how BO-LSTM can be applied to other types of relations.\n\nConclusions\nOur findings demonstrate that besides the high performance of current deep learning techniques, domain-specific ontologies can still be useful to mitigate the lack of labeled data.","authors":["Andre Lamurias","Diana Sousa","Luka A Clarke","Francisco M Couto"],"meta":["January 2019BMC Bioinformatics 20(1)","DOI:10.1186/s12859-018-2584-5","Project: DeST: Deep Semantic Tagger"],"references":["323220245_Text_Mining_for_Bioinformatics_Using_Biomedical_Literature","323219905_Semantic_Similarity_Definition","322107890_Dependency-based_long_short_term_memory_network_for_drug-drug_interaction_extraction","321780074_Assessing_Public_Metabolomics_Metadata_Towards_Improving_Quality","321660638_Identifying_interactions_between_chemical_entities_in_biomedical_text","321011093_DrugBank_50_A_major_update_to_the_DrugBank_database_for_2018","320691716_Drug-drug_Interaction_Extraction_via_Hierarchical_RNNs_on_Sequence_and_Shortest_Dependency_Paths","320309289_An_attention-based_effective_neural_model_for_drug-drug_interactions_extraction","325708101_Leveraging_Biomedical_Resources_in_Bi-LSTM_for_Drug_Drug_Interaction_Extraction","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality"]}