{"id":"330201530_Explainable_artificial_intelligence_for_breast_cancer_A_visual_case-based_reasoning_approach","abstract":"Case-Based Reasoning (CBR) is a form of analogical reasoning in which the solution for a (new) query case is determined using a database of previous known cases with their solutions. Cases similar to the query are retrieved from the database, and then their solutions are adapted to the query. In medicine, a case usually corresponds to a patient and the problem consists of classifying the patient in a class of diagnostic or therapy. Compared to \"black box\" algorithms such as deep learning, the responses of CBR systems can be justified easily using the similar cases as examples. However, this possibility is often under-exploited and the explanations provided by most CBR systems are limited to the display of the similar cases.\nIn this paper, we propose a CBR method that can be both executed automatically as an algorithm and presented visually in a user interface for providing visual explanations or for visual reasoning. After retrieving similar cases, a visual interface displays quantitative and qualitative similarities between the query and the similar cases, so as one can easily classify the query through visual reasoning, in a fully explainable manner. It combines a quantitative approach (visualized by a scatter plot based on Multidimensional Scaling in polar coordinates, preserving distances involving the query) and a qualitative approach (set visualization using rainbow boxes). We applied this method to breast cancer management. We showed on three public datasets that our qualitative method has a classification accuracy comparable to k-Nearest Neighbors algorithms, but is better explainable. We also tested the proposed interface during a small user study. Finally, we apply the proposed approach to a real dataset in breast cancer. Medical experts found the visual approach interesting as it explains why cases are similar through the visualization of shared patient characteristics.","authors":["Jean-Baptiste Lamy","Booma devi Sekar","Gilles Guezennec","Jacques Bouaud"],"meta":["March 2019Artificial Intelligence in Medicine 94","DOI:10.1016/j.artmed.2019.01.001","Projects: Rainbow boxesDesiree"],"references":["330179947_Donner_un_sens_a_l'intelligence_artificielle_Pour_une_strategie_nationale_et_europeenne","327645200_Case-Based_Decision_Support_System_for_Breast_Cancer_Management","327123230_Machine_Learning_Applications_in_Plasmonics","325532209_Reconciliation_of_multiple_guidelines_for_decision_support_a_case_study_on_the_multidisciplinary_management_of_breast_cancer_within_the_DESIREE_project","324908900_Using_preference_learning_for_detecting_inconsistencies_in_clinical_practice_guidelines_Methods_and_application_to_antibiotherapy","333163394_What_hinders_the_uptake_of_computerized_decision_support_systems_in_hospitals_A_qualitative_study_and_framework_for_implementation","328903356_Intelligent_Clinical_Decision_Support_Systems_for_Patient-Centered_Healthcare_in_Breast_Cancer_Oncology","328250607_Semantically_Structured_Web_Form_and_Data_Storage_A_Generic_Ontology-Driven_Approach_Applied_to_Breast_Cancer","325477281_Artificial_Feeding_Birds_AFB_A_New_Metaheuristic_Inspired_by_the_Behavior_of_Pigeons","324686734_Combining_the_Generic_Entity-Attribute-Value_Model_and_Terminological_Models_into_a_Common_Ontology_to_Enable_Data_Integration_and_Decision_Support"]}