{"id":"330295707_Video_Summarization_via_Nonlinear_Sparse_Dictionary_Selection","abstract":"Video summarization (VS) is to identify important content from a given video, which can help users quickly comprehend video content. Recently, sparse dictionary selection (SDS) has demonstrated to be an effective solution for VS problems, which generally assumes a linear relationship between keyframes and non-keyframes. However, this assumption is not always true for video frames which possess intrinsic nonlinear structures and properties. In this paper, by exploiting the nonlinearity between video frames, a nonlinear SDS (NSDS) model is formulated for VS, in which the nonlinearity is transformed to linearity by projecting a video to a high dimensional feature space induced by a kernel function. We also propose two greedy optimization algorithms to solve the resulting model, namely standard kernel SDS (KSDS) greedy algorithm and robust KSDS (R-KSDS) greedy algorithm with a backtracking strategy. In order to achieve an intuitive and flexible configuration of the VS process, an adaptive criterion, namely energy ratio (ER), is devised to produce video summaries with different lengths for different video content. Experimental results on two different benchmark video datasets demonstrate that the proposed algorithm outperforms several state-of-the-art VS algorithms.","authors":["Ma Mingyang","Shaohui Mei","Shuai Wan","Zhiyong Wang"],"meta":["January 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2891834"],"references":["324381528_Dynamic_Mode_Decomposition_Based_Video_Shot_Detection","319003279_Unsupervised_Video_Summarization_with_Adversarial_LSTM_Networks","318716816_Key-frame_selection_for_video_summarization_an_approach_of_multidimensional_time_series_analysis","317782995_Multi-Modal_Visual_Features-Based_Video_Shot_Boundary_Detection","320388865_Image_Denoising_via_Sparse_Representation_Over_Grouped_Dictionaries_With_Adaptive_Atom_Size","319569598_Nonlinear_kernel_sparse_dictionary_selection_for_video_summarization","319415984_Video_Summarization_With_Attention-Based_Encoder-Decoder_Networks","318916194_Single_Image_Super-Resolution_Based_on_Deep_Learning_Features_and_Dictionary_Model","312641615_Instance_Selection_Using_Non-linear_Sparse_Modeling","309417112_Adaptive_Greedy_Dictionary_Selection_for_Web_Media_Summarization"]}