{"id":"330320840_Smart_Water_Management_Platform_IoT-Based_Precision_Irrigation_for_Agriculture","abstract":"The smart management of freshwater for precision irrigation in agriculture is essential for increasing crop yield and decreasing costs, while contributing to environmental sustainability. The intense use of technologies offers a means for providing the exact amount of water needed by plants. The Internet of Things (IoT) is the natural choice for smart water management applications, even though the integration of different technologies required for making it work seamlessly in practice is still not fully accomplished. The SWAMP project develops an IoT-based smart water management platform for precision irrigation in agriculture with a hands-on approach based on four pilots in Brazil and Europe. This paper presents the SWAMP architecture, platform, and system deployments that highlight the replicability of the platform, and, as scalability is a major concern for IoT applications, it includes a performance analysis of FIWARE components used in the Platform. Results show that it is able to provide adequate performance for the SWAMP pilots, but requires specially designed configurations and the re-engineering of some components to provide higher scalability using less computational resources.","authors":["Carlos Alberto Kamienski","Juha-Pekka Soininen","Markus Taumberger","Attilio Toscano"],"meta":["January 2019Sensors 19(2):276","DOI:10.3390/s19020276","Project: SWAMP - Smart Water Management Platform"],"references":["328766035_Internet_of_Things_A_Comprehensive_Study_of_Security_Issues_and_Defense_Mechanisms","328389999_Scalability_of_an_Internet_of_Things_Platform_for_Smart_Water_Management_for_Agriculture","325273450_SWAMP_Smart_Water_Management_Platform_-_Overview_and_Security_Challenges","324780068_Scalability_of_Real-Time_IoT-based_Applications_for_Smart_Cities","324703465_Dynamic_linked_data_A_SPARQL_event_processing_architecture","322018958_A_comparative_study_of_LPWAN_technologies_for_large-scale_IoT_deployment","327126139_Dual-Mode_Wake-Up_Nodes_for_IoT_Monitoring_Applications_Measurements_and_Algorithms","324597321_SWAMP_an_IoT-based_Smart_Water_Management_Platform_for_Precision_Irrigation_in_Agriculture","323544669_Performance_evaluation_of_IoT_middleware","319609877_IoT_in_Agriculture_Designing_a_Europe-Wide_Large-Scale_Pilot"]}