{"id":"330376797_Deep_image_reconstruction_from_human_brain_activity","abstract":"The mental contents of perception and imagery are thought to be encoded in hierarchical representations in the brain, but previous attempts to visualize perceptual contents have failed to capitalize on multiple levels of the hierarchy, leaving it challenging to reconstruct internal imagery. Recent work showed that visual cortical activity measured by functional magnetic resonance imaging (fMRI) can be decoded (translated) into the hierarchical features of a pre-trained deep neural network (DNN) for the same input image, providing a way to make use of the information from hierarchical visual features. Here, we present a novel image reconstruction method, in which the pixel values of an image are optimized to make its DNN features similar to those decoded from human brain activity at multiple layers. We found that our method was able to reliably produce reconstructions that resembled the viewed natural images. A natural image prior introduced by a deep generator neural network effectively rendered semantically meaningful details to the reconstructions. Human judgment of the reconstructions supported the effectiveness of combining multiple DNN layers to enhance the visual quality of generated images. While our model was solely trained with natural images, it successfully generalized to artificial shapes, indicating that our model was not simply matching to exemplars. The same analysis applied to mental imagery demonstrated rudimentary reconstructions of the subjective content. Our results suggest that our method can effectively combine hierarchical neural representations to reconstruct perceptual and subjective images, providing a new window into the internal contents of the brain.","authors":["Guohua Shen","Tomoyasu Horikawa","Kei Majima","Yukiyasu Kamitani"],"meta":["January 2019PLoS Computational Biology 15(1):e1006633","DOI:10.1371/journal.pcbi.1006633"],"references":["330521293_Variational_Autoencoder_An_Unsupervised_Model_for_Modeling_and_Decoding_fMRI_Activity_in_Visual_Cortex","327456106_Brain-Score_Which_Artificial_Neural_Network_for_Object_Recognition_is_most_Brain-Like","345698628_Generative_adversarial_networks_for_reconstructing_natural_images_from_brain_activity","326526790_Generative_adversarial_networks_for_reconstructing_natural_images_from_brain_activity","324615498_A_Task-Optimized_Neural_Network_Replicates_Human_Auditory_Behavior_Predicts_Brain_Responses_and_Reveals_a_Cortical_Processing_Hierarchy","319770355_Generative_Adversarial_Nets","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","317040540_Deep_adversarial_neural_decoding","311610841_Image_Style_Transfer_Using_Convolutional_Neural_Networks","303682017_Synthesizing_the_preferred_inputs_for_neurons_in_neural_networks_via_deep_generator_networks","307822569_Understanding_deep_image_representations_by_inverting_them","306186676_Neural_Encoding_and_Decoding_with_Deep_Learning_for_Dynamic_Natural_Vision","303743787_Reconstructing_Perceived_and_Retrieved_Faces_from_Activity_Patterns_in_Lateral_Parietal_Cortex","301847900_Generating_Images_with_Perceptual_Similarity_Metrics_based_on_Deep_Networks"]}