{"id":"330314701_An_Online_Integrated_Fingerprint_Image_System","abstract":"Fingerprint analysis is one of the most commonly-used biometrics technologies, primarily used in forensic science to identify people. Due to various reasons, most fingerprint related studies are conducted in an isolated environment which makes it hard for researchers to collaborate across institutes. Web-based client/server applications have become an important component for international collaboration because such an application allows users from different locations to execute the same program on the same data. Such systems can be quickly developed and are easy to use. In this paper, a 3-tier integrated online fingerprint system was developed to manage and process fingerprint images in real-time. This system allows users all over the world to access the public NIST-14 fingerprint dataset and collaborate with other researchers to conduct the research task. The front-end of the system is an advanced web-based interface that allows users to view fingerprint images in different resolution, singular points, enter, and update the location of singular points. This system can also preserve the entered information in the back-end database. © 2019 International Association of Computer Science and Information Technology.","authors":["Ching-Yu Huang","Limin Liu","Yui-Liang Chen"],"meta":["February 2019","DOI:10.18178/ijmlc.2019.9.1.764"],"references":["320417940_Fingerprint_Pattern_Classification_Using_Convolution_Neural_Network","318448194_Classification_of_Fingerprint_Images_with_the_aid_of_Morphological_Operation_and_AGNN_Classifier","317670255_Toward_online_education_for_fingerprint_recognition_A_proof-of-concept_web_platform","323137619_Fingerprint_classification_using_convolutional_neural_networks_and_ridge_orientation_images","313541586_Fingerprinting_for_Web_Applications_From_Devices_to_Related_Groups","267561557_Fingerprinting_Information_in_JavaScript_Implementations","243773865_Classification_and_Uses_of_Finger_Prints","222046993_Fingerprint_analysis_and_singular_point_detection","222016048_Detection_of_singular_points_in_fingerprint_images"]}