{"id":"330371844_Teachers'_perception_of_STEM_integration_and_education_a_systematic_literature_review","abstract":"Background\nFor schools to include quality STEM education, it is important to understand teachers’ beliefs and perceptions related to STEM talent development. Teachers, as important persons within a student’s talent development, hold prior views and experiences that will influence their STEM instruction. This study attempts to understand what is known about teachers’ perceptions of STEM education by examining existing literature.\n\nResults\nStudy inclusion criteria consisted of empirical articles, which aligned with research questions, published in a scholarly journal between 2000 and 2016 in English. Participants included in primary studies were preK-12 teachers. After quality assessment, 25 articles were included in the analysis. Thematic analysis was used to find themes within the data. Findings indicate that while teachers value STEM education, they reported barriers such as pedagogical challenges, curriculum challenges, structural challenges, concerns about students, concerns about assessments, and lack of teacher support. Teachers felt supports that would improve their effort to implement STEM education included collaboration with peers, quality curriculum, district support, prior experiences, and effective professional development.\n\nConclusions\nRecommendations for practice include quality in-service instruction over STEM pedagogy best practices and district support of collaboration time with peer teachers. Recommendations for future research are given.","authors":["Kelly C. Margot","Todd Kettler"],"meta":["January 2019International Journal of STEM Education 6(1)","DOI:10.1186/s40594-018-0151-2"],"references":["328743605_The_reality_of_STEM_education_design_and_technology_teachers'_perceptions_a_phenomenographic_study","326345719_Perceptions_of_in-service_teachers_toward_Teaching_STEM_in_Thailand","301298911_Teachers'_Perceptions_and_Practices_of_STEAM_Education_in_South_Korea","354509997_Infrastructure_of_Comprehensive_STEM_Programming_for_Advanced_Learners","322704582_Context_of_STEM_Integration_in_Schools_Views_from_In-service_Science_Teachers","315169721_Journal_for_the_Education_of_the_Gifted","309109591_STEM_integration_in_K-12_education_status_prospects_and_an_agenda_for_research","305460380_Exploring_teachers'_perceptions_of_STEAM_teaching_through_professional_development_implications_for_teacher_educators","299896604_Supporting_Middle_School_Teachers'_Implementation_of_STEM_Design_Challenges","293122140_National_action_plan_for_addressing_the_critical_needs_of_the_US_science_technology_engineering_and_mathematics_education_system"]}