{"id":"330397681_Dialectones_Finding_Statistically_Significant_Dialectal_Boundaries_Using_Twitter_Data","abstract":"Most NLP applications assume that a particular language is homogeneous in the regions where it is spoken. However, each language varies considerably throughout its geographical distribution. To make NLP sensitive to dialects, a reliable, representative and up-to-date source of information that quantitatively represents such geographical variation is necessary. However, some of the current approaches have disadvantages such as the need for parameters, the disregard of the geographical coordinates in the analysis, and the use of linguistic alternations that presuppose the existence of specific dialectal varieties. Detection of \"ecotones\" is an analogous problem in the field of ecology that focuses on the identification of boundaries, instead of regions, in ecosystems facilitating the construction of statistical tests. We adapted the concept of \"ecotone\" to \"dialectone\" for the detection of dialectal boundaries by using two non-parametric statistical tests: the Hilbert-Schmidt independence criterion (HSIC) and the Wilcoxon signed-rank. The proposed method was applied to a large corpus of Spanish tweets produced in 160 locations in Colombia through the analysis of unigram features. The resulting dialectones showed to be meaningful but difficult to compare against regions identified by other authors using classical dialectometry. We concluded that the automatic detection of dialectones is convenient alternative to classical methods in dialectometry and a potential source of information for automatic language applications.","authors":["Carlos Alberto Rodríguez","Sergio Jimenez","George Dueñas","Johnatan Estiven Bonilla"],"meta":["December 2018Computacion y Sistemas 22(4)","DOI:10.13053/CyS-22-4-3104"],"references":["322642422_PROCESAMIENTO_INFORMATICO_DE_LOS_MATERIALES_DEL_ATLAS_LINGUISTICO-ETNOGRAFICO_DE_COLOMBIA_SISTEMA_DE_INFORMACION","255608026_Ecotones_Marginal_or_Central_Areas_of_Transition","301873979_A_Kernel_Independence_Test_for_Geographical_Language_Variation","301405086_Mapping_Dialectal_Variation_by_Querying_Social_Media","290506269_Human_Behavior_and_the_Principle_of_Least_Effort_An_Introduction_to_Human_Ecology","288933024_Understanding_US_regional_linguistic_variation_with_Twitter_data_analysis","274919786_Ecotones_The_Role_of_Landscape_Boundaries_in_the_Management_and_Restoration_of_Changing_Environments","269860233_Ecology_A_Bridge_between_Science_and_Society","269421684_Fundamentals_of_Ecology","255981731_Boundary_dynamics_a_conceptual_framework","226066854_Ecotones_in_vegetation_ecology_Methodologies_and_definitions_revisited","208033856_Toward_a_Dialectological_Yardstick","200744526_A_kernel_statistical_test_of_independence","8766410_Differential_Systematics"]}