{"id":"330305084_Linear_Repairing_Codes_and_Side-Channel_Attacks","abstract":"To strengthen the resistance of countermeasures based on secret sharing,several works have suggested to use the scheme introduced by Shamir in 1978, which proposes to use the evaluation of a random d-degree polynomial into n ≥ d + 1 public points to share the sensitive data. Applying the same principles used against the classical Boolean sharing, all these works have assumed that the most efficient attack strategy was to exploit the minimum number of shares required to rebuild the sensitive value; which is d + 1 if the reconstruction is made with Lagrange’s interpolation. In this paper, we highlight first an important difference between Boolean and Shamir’s sharings which implies that, for some signal-to-noise ratio, it is more advantageous for the adversary to observe strictly more than d + 1 shares. We argue that this difference is related to the existence of so-called linear exact repairing codes, which themselves come with reconstruction formulae that need (much) less information (counted in bits) than Lagrange’s interpolation. In particular, this result implies that the choice of the public points in Shamir’s sharing has an impact on the countermeasure strength, which confirms previous observations made by Wang et al. at CARDIS 2016 for the so-called inner product sharing which is a generalization of Shamir’s scheme. As another contribution, we exhibit a positive impact of the existence of linear exact repairing schemes; we indeed propose to use them to improve the state-of-the-art multiplication algorithms dedicated to Shamir’s sharing. We argue that the improvement can be effective when the multiplication operation in the sub-fields is at least two times smaller than that of the base field.","authors":["Hervé Chabanne","Houssem Maghrebi","Emmanuel Prouff"],"meta":["February 2018","DOI:10.13154/tches.v2018.i1.118-141"],"references":["284511462_ChipWhisperer_An_Open-Source_Platform_for_Hardware_Embedded_Security_Research","265565052_Behind_the_Scene_of_Side_Channel_Attacks","259212107_A_repair_framework_for_scalar_MDS_codes","326286619_Secret_Sharing_with_Optimal_Decoding_and_Repair_Bandwidth","324109758_Masking_Proofs_Are_Tight_and_How_to_Exploit_it_in_Security_Evaluations","322465158_Making_Masking_Security_Proofs_Concrete_Or_How_to_Evaluate_the_Security_of_Any_Leaking_Device_Extended_Version","319144435_Secret_sharing_with_optimal_decoding_and_repair_bandwidth","306115219_Explicit_constructions_of_MDS_array_codes_and_RS_codes_with_optimal_repair_bandwidth","303901545_Repairing_Reed-solomon_codes","283518032_Inner_Product_Masking_Revisited"]}