{"id":"330395254_Science_audiences_misinformation_and_fake_news","abstract":"Concerns about public misinformation in the United States—ranging from politics to science—are growing. Here, we provide an overview of how and why citizens become (and sometimes remain) misinformed about science. Our discussion focuses specifically on misinformation among individual citizens. However, it is impossible to understand individual information processing and acceptance without taking into account social networks, information ecologies, and other macro-level variables that provide important social context. Specifically, we show how being misinformed is a function of a person’s ability and motivation to spot falsehoods, but also of other group-level and societal factors that increase the chances of citizens to be exposed to correct(ive) information. We conclude by discussing a number of research areas—some of which echo themes of the 2017 National Academies of Sciences, Engineering, and Medicine’s Communicating Science Effectively report—that will be particularly important for our future understanding of misinformation, specifically a systems approach to the problem of misinformation, the need for more systematic analyses of science communication in new media environments, and a (re)focusing on traditionally underserved audiences.","authors":["Dietram A. Scheufele","Nicole M. Krause"],"meta":["January 2019Proceedings of the National Academy of Sciences 116(16):201805871","DOI:10.1073/pnas.1805871115"],"references":["323650280_The_science_of_fake_news","322536604_The_Elusive_Backfire_Effect_Mass_Attitudes'_Steadfast_Factual_Adherence","321791293_Leveraging_Institutions_Educators_and_Networks_to_Correct_Misinformation_A_Commentary_on_Lewandosky_Ecker_and_Cook","330687979_Protecting_or_polluting_the_science_communication_environment_The_case_of_childhood_vaccines","330687506_Is_there_a_hype_problem_in_science_If_so_how_is_it_addressed","327049923_Priming_and_Fake_News_The_Effects_of_Elite_Discourse_on_Evaluations_of_News_Media","324420260_Is_Facebook_Making_Us_Dumber_Exploring_Social_Media_Use_as_a_Predictor_of_Political_Knowledge","324338439_Voting_a_Study_of_Opinion_Formation_in_a_Presidential_Campaign","324307634_Voting_A_Study_of_Opinion_Formation_in_a_Presidential_Campaign","323649207_The_spread_of_true_and_false_news_online"]}