{"id":"330398229_How_is_the_discourse_of_performance-based_financing_shaped_at_the_global_level_A_poststructural_analysis","abstract":"Background\nPerformance-based financing (PBF) in low- and middle-income settings has diffused at an unusually rapid pace. While many studies have looked at PBF implementation processes and effects, there is an empirical research gap investigating the ways PBF has diffused. Discursive processes are paramount elements of policy diffusion because they explain the origins of essential elements of the political debate on PBF. Using Bacchi's poststructural approach that emphasises problem representations embedded in the discourse, the present study analyses the construction of the global discourse on PBF.MethodsA rich corpus of qualitative data (57 in-depth interviews and 10 observation notes) was collected. The transcribed material was coded using QDAMiner (c). Codes were assembled to populate analytical categories informed by the framework on diffusion entrepeneurs and Bacchi's poststructural approach.ResultsOur results feature problem representations shaped and spread by PBF global diffusion entrepreneurs. We explain how these representations reflected diffusion entrepreneurs' own belief systems and interests, and conflicted with those of non-diffusion entrepreneurs. This research also reveals the specific strategies global diffusion entrepreneurs engaged in to effectively diffuse PBF, through reflecting problem representations based on the discourse on PBF, and inducing certain forms of policy experimentation, emulation, and learning.Conclusions\nBacchi's poststructural approach is useful to analyse the construction of global health problem representations and the strategies set by global diffusion entrepreneurs to spread these representations. Future research is needed to investigate the belief systems, motivations, resources, and strategies of actors that shape the construction of global health discourses.","authors":["Lara Gautier","Manuela De Allegri","Valéry Ridde"],"meta":["January 2019Globalization and Health 15(6)","DOI:10.1186/s12992-018-0443-9","Project: From ideas to policymaking: the political economy of the diffusion of performance-based financing at the global, continental, and national levels."],"references":["329725866_Did_the_learning_agenda_of_the_World_Bank-administrated_Health_Results_Innovation_Trust_Fund_shape_politicised_evidence_on_performance-based_financing_A_documentary_analysis","322487563_Performance-based_financing_in_low-income_and_middle-income_countries_Isn't_it_time_for_a_rethink","320454902_Will_markets_be_master_or_servant_to_health_at_the_World_Bank","319752171_Saturation_in_qualitative_research_exploring_its_conceptualization_and_operationalization","353766193_Trouver_des_problemes_aux_solutions_Vingt_ans_d'aide_au_Sahel","346692967_The_SAGE_Encyclopedia_of_Qualitative_Research_Methods","325938089_Performance-based_Financing_in_Africa_Time_to_Test_Measures_for_Equity","325472422_How_do_diffusion_entrepreneurs_spread_policies_Insights_from_performance-based_financing_in_Sub-Saharan_Africa","324567662_Three_habits_of_successful_policy_entrepreneurs","321878616_Political_Analysis_A_Critical_Introduction"]}