{"id":"330316653_Detection_and_Tracking_of_Faces_in_3D_Using_a_Stereo_Camera_Arrangements","abstract":"3D facial tracking has become vital to the continued integration of computers, technology, and human society. In recent decades, the integration of technology has increased, and the use of surveillance, conference calls, gaming components, and other similar applications has spurred demand for the ability to recognize the distinctive features of humans. However, in order for these new technologies to function effectively and reach their fullest potential, a great deal of work is still needed. The field of facial mapping and tracking is still in its early developmental stages, necessitating additional research into the best methods of tracking and monitoring specific human faces. To this end, an algorithm has been created that would allow for improvements in this area; however, a video was first required that could be used effectively for the algorithm. Two web cameras running on Raspberry Pi were used to gather the footage necessary for detecting and tracking specific facial features. While certain limitations were identified throughout the process, the algorithm still achieved significant successful tracking results. In spite of this success, further efforts are still needed to effectively explore the proposed algorithm and improve upon these initial results. © 2019 International Association of Computer Science and Information Technology.","authors":["Faleh Alqahtani","Jasmine Banks","V. Chandran","Jinglan Zhang"],"meta":["February 2019","DOI:10.18178/ijmlc.2019.9.1.762"],"references":["327194829_3D_Face_Tracking_Using_Stereo_Camera","313960485_Building_a_Large_Database_of_Facial_Movements_for_Deformation_Model-Based_3D_Face_Tracking_Deformation_Model-Based_3D_Face_Tracking","311609522_You_Only_Look_Once_Unified_Real-Time_Object_Detection","308746889_Comparative_Study_of_Camshift_and_KLT_algorithms_for_Real_Time_Face_Detection_and_Tracking_Applications","308190438_A_Discriminative_Feature_Learning_Approach_for_Deep_Face_Recognition","305997219_The_Face-Tracking_of_Sichuan_Golden_Monkeys_via_S-TLD","305455475_Demo_of_Face2Face_real-time_face_capture_and_reenactment_of_RGB_videos","301723501_Incorporating_skin_color_for_improved_face_detection_and_tracking_system","301402500_A_human_face_detection_method_based_on_connected_component_analysis","286734329_Incremental_Face_Alignment_in_the_Wild"]}