{"id":"330468564_Assessment_of_Critical_Success_Factors_CSFs_for_the_Deployment_of_Construction_Risk_Management_Practices_in_Sri_Lanka","abstract":"Risk is an uncertain occurrence that, if befalls, has direct and indirect effects on project objectives. In particular, construction projects in developing countries are likely to face a wide range of uncertainties. The evidence available for the effective implementation of risk management practices in developing countries is very little. The existing studies on risk management in developing countries like Sri Lanka, have generally concentrated on identifying and evaluating risks rather than applying risk management systems. This study is aimed to explore the Critical Success Factors (CSFs) for Implementing Risk Management Systems (IRMS) in the Sri Lankan construction industry. The study applied Delphi technique with fifteen industry experts through three rounds of the survey as the methodology to assess CSFs. Analytical Hierarchy Process (AHP) was used in the third round to analytically asses CSFs. The findings of the study disclose that 'Including the costs within projects' budgets for IRMS' and 'Request for Implementation of Risk Management Systems (IRMS) on projects by clients and end users' is considered as exceedingly imperative CSFs. In the meantime the meantime 'Attempting to deliver projects systematically on time and within the project's budget', 'Inclusion of risk management systems in engineering education and training modules of construction practitioners', and 'Awareness of risk management systems among stakeholders' is regarded as important factors for IRMS. The study also revealed that a substantial alignment is not found between the current findings of the research and the previous findings of similar studies in the developing world.","authors":["A.L.M. Risath","Chandana Siriwardana"],"meta":["August 2018International Journal of Civil Engineering 7(5):1-12","Project: Risk Management"],"references":["297282925_Critical_success_factors_for_implementing_risk_management_systems_in_developing_countries","288007778_A_review_on_critical_risk_factors_in_the_life_cycle_of_construction_projects","280877296_Risk_management_in_construction_projects","262143815_Enhancing_the_effectiveness_of_risk_management_practices_in_Sri_Lankan_road_construction_projects_A_Delphi_approach","262049517_Critical_success_factors_for_implementation_of_risk_assessment_and_management_practices_within_the_Tanzanian_construction_industry","256417595_Critical_factors_in_project_implementation_A_comparison_of_construction_and_RD_projects","313770750_An_experimental_application_of_the_delphi_method_to_the_use_of_experts","284194124_Gazing_Into_the_Oracle_the_Delphi_Method_and_its_Application_to_Social_Policy_and_Public_Health","275027034_CRITICAL_SUCCESS_FACTORS_IN_SUPPLY_CHAIN_MANAGEMENT_IN_THE_BANKING_SECTOR_IN_GHANA","263500449_Integrating_risk_management_in_the_innovation_project"]}