{"id":"330403943_Machine_learning_algorithms_for_systematic_review_Reducing_workload_in_a_preclinical_review_of_animal_studies_and_reducing_human_screening_error","abstract":"Background\nHere, we outline a method of applying existing machine learning (ML) approaches to aid citation screening in an on-going broad and shallow systematic review of preclinical animal studies. The aim is to achieve a high-performing algorithm comparable to human screening that can reduce human resources required for carrying out this step of a systematic review.\n\nMethods\nWe applied ML approaches to a broad systematic review of animal models of depression at the citation screening stage. We tested two independently developed ML approaches which used different classification models and feature sets. We recorded the performance of the ML approaches on an unseen validation set of papers using sensitivity, specificity and accuracy. We aimed to achieve 95% sensitivity and to maximise specificity. The classification model providing the most accurate predictions was applied to the remaining unseen records in the dataset and will be used in the next stage of the preclinical biomedical sciences systematic review. We used a cross-validation technique to assign ML inclusion likelihood scores to the human screened records, to identify potential errors made during the human screening process (error analysis).\n\nResults\nML approaches reached 98.7% sensitivity based on learning from a training set of 5749 records, with an inclusion prevalence of 13.2%. The highest level of specificity reached was 86%. Performance was assessed on an independent validation dataset. Human errors in the training and validation sets were successfully identified using the assigned inclusion likelihood from the ML model to highlight discrepancies. Training the ML algorithm on the corrected dataset improved the specificity of the algorithm without compromising sensitivity. Error analysis correction leads to a 3% improvement in sensitivity and specificity, which increases precision and accuracy of the ML algorithm.\n\nConclusions\nThis work has confirmed the performance and application of ML algorithms for screening in systematic reviews of preclinical animal studies. It has highlighted the novel use of ML algorithms to identify human error. This needs to be confirmed in other reviews with different inclusion prevalence levels, but represents a promising approach to integrating human decisions and automation in systematic review methodology.\n\nElectronic supplementary material\nThe online version of this article (10.1186/s13643-019-0942-7) contains supplementary material, which is available to authorized users.","authors":["Alexandra Bannach Brown","Piotr Przybyła","James Thomas","Andrew S. C. Rice"],"meta":["January 2019Systematic Reviews 8(1)","DOI:10.1186/s13643-019-0942-7","Project: Understanding in vivo modelling of depression: a systematic review"],"references":["345648700_Automation_of_citation_screening_in_pre-clinical_systematic_reviews","326062022_Prioritising_references_for_systematic_reviews_with_RobotAnalyst_A_user_study","322344628_Machine_Learning_for_Identifying_Randomized_Controlled_Trials_an_evaluation_and_practitioner's_guide","315971112_Understanding_in_vivo_modelling_of_depression_in_non-human_animals_a_systematic_review_protocol_BANNACH-BROWN_et_al","314107862_Analysis_of_the_time_and_workers_needed_to_conduct_systematic_reviews_of_medical_interventions_using_data_from_the_PROSPERO_registry","310745653_A_comparative_analysis_of_semi-supervised_learning_The_case_of_article_selection_for_medical_systematic_reviews","319628096_Living_systematic_review_1_Introduction_-_the_Why_What_When_and_How","318393858_R_A_Language_and_Environment_for_Statistical_Computing","317834778_A_semi-supervised_approach_using_label_propagation_to_support_citation_screening","308161218_Introduction_to_information_retrieval_chapt","305386496_Scikit-Iearn_Machine_learning_in_python","303482552_SWIFT-Review_A_text-mining_workbench_for_systematic_review","281842987_Using_text_mining_for_study_identification_in_systematic_reviews_A_systematic_review_of_current_approaches","278331090_Faster_title_and_abstract_screening_Evaluating_Abstrackr_a_semi-automated_online_screening_program_for_systematic_reviewers","305081532_Engineering_Quality_and_Reliability_in_Technology-Assisted_Review"]}