{"id":"330406766_UROKI_KRIZI_KLASICNOI_KIBERNETIKI_PRICINI_TA_SUTNIST","abstract":"It is performed an analysis of the causes and consequences of the crisis of classical cybernetics, created by N. Wiener and W. R. Anby. N. Viener has shown that the basis of the crisis is the exclusion from the consideration of the process of forming the goal of activity for physiological and cybernetic systems. However, the study of the crisis of classical cybernetics is conducted from the historical point of view. N. Wiener's opinion on the role of the goal of the cybernetic system in management processes is not taken into account. The main focus is on the study of information management and transfer processes. The main direction of the development of classical cybernetics is determined by the further development of computer science, as well as new cybernetics. In the study of the crisis of classical cybernetics, an analysis of its initial hypotheses is not conducted in the formation of the principles of organisation and self-organization. Therefore, in the article the formation of the content of these concepts was made and on their basis an attempt was made to form initial hypotheses of the organization of physiological and cybernetic systems in their \"existence\", as well as self-organization in their \"activities\". It is shown that for the principle of organization and for the principle of self-organization in classical cybernetics, there is no unambiguous content. It is also shown that the crisis of classical cybernetics is due to the crisis of the methodology of the general theory of systems. The main lesson of the crisis of classical cybernetics is that the very purpose of the activity, the mechanism of formation of which was derived outside the cybernetic system, proved to be a fundamental factor both for the formation of the principle of organization of the system in its existence and for the formulation of the principle of its self-organization in its activities. Therefore, classical cybernetics should go to the research of information-open systems. To know the mechanism of the formation of the purpose of the activity, it is necessary to investigate the mechanism of the formation of heuristics in the model of the natural neural network by analogy with the problem of self-organization on the basis of heuristics for the model of the Rosenblatt perceptron, which was considered by A. G. Ivakhnenko. To know the mechanism of the change of the sign of feedback it is necessary to study the architecture of the functional system in accordance with the theory of functional systems of Academician P. K. Anokhin","authors":["Sergiy Dotsenko"],"meta":["January 2019RADIOELECTRONIC AND COMPUTER SYSTEMS","DOI:10.32620/reks.2018.4.01"],"references":["308739195_General_Theory_of_Systems_Cybernetics_and_Evaluation_of_Human_Competence_by_Solving_Present_Crisis_Problems_of_Civilisation","288068673_Chaos_bifurcations_self-organization_Dynamical_extensions_of_neurological_positivism_ecological_psychology","323299590_The_Collapse_and_Afterlife_of_CyberneticsMalapi-NelsonAlcibiadesThe_Nature_of_the_Machine_and_the_Collapse_of_Cybernetics_A_Transhumanist_Lesson_for_Emerging_Technologies_Cham_Switzerland_Palgrave_Mac","313102579_General_system_theory_A_critical_review","303583397_Some_Explanatory_Boundaries_of_Organismic_Analogies_for_the_Understanding_of_Social_Systems","247998080_The_Second_Cybernetics_Deviation-Amplifying_Mutual_Causal_Processes","27292415_Encyclopedia_of_Artificial_Intelligence"]}