{"id":"330462588_Deep_Learning_in_Spiking_Neural_Networks_for_Brain-Inspired_Artificial_Intelligence","abstract":"Brain-inspired AI (BI-AI) is the contemporary phase in the AI development that is concerned with the design and implementation of highly intelligent machines that utilise information processing principles from the human brain, along with their applications. Artificial neural networks (ANN), in their early developments world-wide (the first publication in Bulgarian was in 1990 [1] and then [2, 3])) were promising techniques for AI from the very beginning. But their full potential is just being realised through the latest brain-inspired spiking neural networks (SNN) and their deep learning algorithms, that make it possible for AI to gain a fast progress nowadays [3-14].\nThis presentation has two parts. The first part covers generic methodological aspects of AI and neural networks, including: Learning evolving processes in space and time; Data, Information and Knowledge; The human brain as a deep learning system; Classical methods of ANN; Methods of SNN; Deep learning in brain-inspired SNN architectures; Evolutionary and quantum-inspired optimisation of SNN systems.\nThe second part presents specific methods, systems and applications based on deep learning in SNN and BI-AI for various problems and data, including audio/visual data, brain EEG and fMRI data, Brain-Computer Interfaces (BCI), Bio/Neuroinformatics data, Multisensory data for predictive modelling in ecology, environment, finance. It concludes with discussions about the future of computers and AI. A development software system NeuCube and application systems can be found on: http://www.kedri.aut.ac.nz/neucube/. Details of this presentation are included in [15].","authors":["Nikola Kirilov Kasabov"],"meta":["September 2018","DOI:10.1145/3274005.3274006","Conference: the 19th International Conference"],"references":["283871215_Evolving_spatio-temporal_data_machines_based_on_the_NeuCube_neuromorphic_framework_Design_methodology_and_selected_applications","260585643_Overview_of_the_SpiNNaker_System_Architecture","260015399_NeuCube_A_spiking_neural_network_architecture_for_mapping_learning_and_understanding_of_spatio-temporal_brain_data","257786595_Evolving_spiking_neural_networks_A_Survey","281538624_Incorporating_neural_networks_into_production_systems_and_a_practical_approach_towards_the_realisation_of_fuzzy_expert_systems","278751137_NeuCube_Neuromorphic_Framework_for_Spatio-temporal_Brain_Data_and_Its_Python_Implementation","262261127_Molecular_networks_their_analysis_and_representation_Springer_Handbook_of_Bio-_and_Neuroinformatics","260912018_Evolving_spiking_neural_networks_for_personalised_modelling_classification_and_prediction_of_spatio-temporal_patterns_with_a_case_study_on_stroke","235247313_Dynamic_evolving_spiking_neural_networks_for_on-line_spatio-_and_spectro-temporal_pattern_recognition","232588961_A_Connectionist_Production_System_with_Partial_Match_and_its_Use_for_Approximate_Reasoning"]}