{"id":"330422329_Contact_Algebras_and_Region-based_Theory_of_Space_Proximity_Approach-II","abstract":"This paper is the second part of the paper [2]. Both of them are in the field of region-based (or Whitehedian) theory of space, which is an important subfield of Qualitative Spatial Reasoning (QSR). The paper can be considered also as an application of abstract algebra and topology to some problems arising and motivated in Theoretical Computer Science and QSR. In [2], different ax-iomatizations for region-based theory of space were given. The most general one was introduced under the name \"Contact Algebra\". In this paper some categories defined in the language of contact algebras are introduced. It is shown that they are equivalent to the category of all semiregular T 0-spaces and their continuous maps and to its full subcategories having as objects all regular (re-spectively, completely regular; compact; locally compact) Hausdorff spaces. An algorithm for a direct construction of all, up to homeomorphism, finite semiregular T 0-spaces of rank n is found. An example of an RCC model which has no regular Hausdorff representation space is presented. The main method of investigation in both parts is a lattice-theoretic generalization of methods and constructions from the theory of proximity spaces. Proximity models for various kinds of contact algebras are given here. In this way, the paper can be regarded as a full realization of the proximity approach to the region-based theory of space.","authors":["Georgi Dimov","Dimiter Vakarelov"],"meta":["January 2006Fundamenta Informaticae 74(2-3):251-282","Project: Mereotopology: static and dynamic"],"references":["330422421_Contact_Algebras_and_Region-based_Theory_of_Space_Proximity_Approach-II","330422013_Contact_Algebras_and_Region-based_Theory_of_Space_A_Proximity_Approach-I","264960810_Sa_spaces_and_regular_Hausdorff_extensions","220202763_A_Proximity_Approach_to_Some_Region-Based_Theories_of_Space","322949017_On_the_Number_of_Topologies_on_a_Finite_Set","246194780_Finite_Topological_Spaces","243768073_Abstract_and_Concrete_Categories","226652681_Local_proximity_spaces","222410062_A_representation_theorem_for_Boolean_contact_algebras","220423040_On_the_computer_enumeration_of_finite_topologies"]}