{"id":"330400456_Fueled_by_methane_deep-sea_sponges_from_asphalt_seeps_gain_their_nutrition_from_methane-oxidizing_symbionts","abstract":"Sponges host a remarkable diversity of microbial symbionts, however, the benefit their microbes provide is rarely understood. Here, we describe two new sponge species from deep-sea asphalt seeps and show that they live in a nutritional symbiosis with methane-oxidizing (MOX) bacteria. Metagenomics and imaging analyses revealed unusually high amounts of MOX symbionts in hosts from a group previously assumed to have low microbial abundances. These symbionts belonged to the Marine Methylotrophic Group 2 clade. They are host-specific and likely vertically transmitted, based on their presence in sponge embryos and streamlined genomes, which lacked genes typical of related free-living MOX. Moreover, genes known to play a role in host-symbiont interactions, such as those that encode eukaryote-like proteins, were abundant and expressed. Methane assimilation by the symbionts was one of the most highly expressed metabolic pathways in the sponges. Molecular and stable carbon isotope patterns of lipids confirmed that methane-derived carbon was incorporated into the hosts. Our results revealed that two species of sponges, although distantly related, independently established highly specific, nutritional symbioses with two closely related methanotrophs. This convergence in symbiont acquisition underscores the strong selective advantage for these sponges in harboring MOX bacteria in the food-limited deep sea.","authors":["Maxim Rubin-Blum","• Chakkiath","Chakkiath Paul Antony","Lizbeth Sayavedra"],"meta":["January 2019The ISME Journal 13(5)","DOI:10.1038/s41396-019-0346-7","Projects: H2020 SponGES - Deep-sea Sponge Grounds Ecosystems of the North Atlantic:  an integrated approach towards their preservation  and sustainable exploitationInvertebrate-microbial symbiosis at deep-sea natural gas and oil seeps"],"references":["340768523_MEGA7_Molecular_Evolutionary_Genetics_Analysis_Version_70_for_Bigger_Datasets","329324808_High_throughput_ANI_analysis_of_90K_prokaryotic_genomes_reveals_clear_species_boundaries","327256244_A_standardized_bacterial_taxonomy_based_on_genome_phylogeny_substantially_revises_the_tree_of_life","323029987_Single-bacterial_genomics_validates_rich_and_varied_specialized_metabolism_of_uncultivated_Entotheonella_sponge_symbionts","318348342_Metagenomic_binning_of_a_marine_sponge_microbiome_reveals_unity_in_defense_but_metabolic_specialization","317663869_Short-chain_alkanes_fuel_mussel_and_sponge_Cycloclasticus_symbionts_from_deep-sea_gas_and_oil_seeps","316740450_Predicting_the_HMA-LMA_Status_in_Marine_Sponges_by_Machine_Learning","315634040_Integrated_metabolism_in_sponge-microbe_symbiosis_revealed_by_genome-centered_metatranscriptomics","315503124_Genome_Reduction_and_Microbe-Host_Interactions_Drive_Adaptation_of_a_Sulfur-Oxidizing_Bacterium_Associated_with_a_Cold_Seep_Sponge","325997407_Ongoing_Transposon-Mediated_Genome_Reduction_in_the_Luminous_Bacterial_Symbionts_of_Deep-Sea_Ceratioid_Anglerfishes"]}