{"id":"330471205_Educational_robotics_as_a_prospective_trend_in_stem-education_development","abstract":"The article is devoted to the issues of implementing educational robotics in the educational process as a component of STEM-educationRobotics is a universal education tool suitable for all ages. This age are from kids to students and scholars. Educational robotics helps teachers an early stage to identify the technical inclinations of students and develop them in this direction and the direction of the formation of STEM competencies too.We analyzed the prospective trends of modern education. STEM education and educational robotics are one of them. As a result, there is a need for training specialists in the field of robotics and future teachers of educational robotics. The concept of educational robotics is described, and the purpose and main tasks of its introduction into educational process of educational institutions are substantiated. The authors have analyzed the development and implementation of robotics in the Ukrainian educational process, it is indicated that in Ukraine, the development of educational robotics in the educational process occurs episodically at the subject level, in the teaching of computer science and ICT, in extracurricular education, but there is no systematic approach. Therefore, the introduction of robotics in the educational process of secondary and higher educational institutions as one of the areas of STEM-education, the development of appropriate curricula for students, future teachers and for the teacher training system is essential.The ways of using educational robotics in the process of teaching STEM subjects are considered.","authors":["Nataliia Morze","Oksana Strutynska","Mariia Umryk"],"meta":["December 2018OPEN EDUCATIONAL E-ENVIRONMENT OF MODERN UNIVERSITY","DOI:10.28925/2414-0325.2018.5.178187","Project: Educational robotics"],"references":["323941723_Systematic_Review_of_Research_Trends_in_Robotics_Education_for_Young_Children","261579740_Interdisciplinary_Studies_A_Matter_of_Definition"]}