{"id":"330495027_GEOBIA_at_the_Terapixel_Scale_Toward_Efficient_Mapping_of_Small_Woody_Features_from_Heterogeneous_VHR_Scenes","abstract":"Land cover mapping has benefited a lot from the introduction of the Geographic Object-Based Image Analysis (GEOBIA) paradigm, that allowed to move from a pixelwise analysis to a processing of elements with richer semantic content, namely objects or regions. However, this paradigm requires to define an appropriate scale, that can be challenging in a large-area study where a wide range of landscapes can be observed. We propose here to conduct the multiscale analysis based on hierarchical representations, from which features known as differential attribute profiles are derived over each single pixel. Efficient and scalable algorithms for construction and analysis of such representations, together with an optimized usage of the random forest classifier, provide us with a semi-supervised framework in which a user can drive mapping of elements such as Small Woody Features at a very large area. Indeed, the proposed open-source methodology has been successfully used to derive a part of the High Resolution Layers (HRL) product of the Copernicus Land Monitoring service, thus showing how the GEOBIA framework can be used in a big data scenario made of more than 38,000 Very High Resolution (VHR) satellite images representing more than 120 TB of data.","authors":["François Merciol","Loïc Faucqueur","Bharath Bhushan","Pierre-Yves Rémy"],"meta":["January 2019International Journal of Geo-Information 8(1):46","DOI:10.3390/ijgi8010046"],"references":["324487212_Attribute_Profiles_on_Derived_Textural_Features_for_Highly_Textured_Optical_Image_Classification","322893986_Partition_and_Inclusion_Hierarchies_of_Images_A_Comprehensive_Survey","320600284_Local_Feature-Based_Attribute_Profiles_for_Optical_Remote_Sensing_Image_Classification","318237701_Orfeo_ToolBox_open_source_processing_of_remote_sensing_images","317014138_Attribute_Profiles_from_Partitioning_Trees","303497515_Efficient_Tree_Construction_for_Multiscale_Image_Representation_and_Processing","337070731_An_Entropic_Optimal_Transport_loss_for_learning_deep_neural_networks_under_label_noise_in_remote_sensing_images","321236230_Feature_Profiles_from_Attribute_Filtering_for_Classification_of_Remote_Sensing_Images","316064732_Attribute_Profiles_from_Partitioning_Trees","294577401_Random_forest_in_remote_sensing_A_review_of_applications_and_future_directions"]}