{"id":"330455651_In_the_uncanny_valley_transportation_predicts_narrative_enjoyment_more_than_empathy_but_only_for_the_tragic_hero","abstract":"The uncanny valley is a term used to describe the phenomenon that human simulations that are nearly but not quite realistic often give viewers an uneasy, eerie feeling. Given the prevalence of computer-animated human characters and a narrative framework in videogames, serious games, and health-related scenarios, it is important to examine how the uncanny valley influences narrative empathy and enjoyment. In a 2 × 2 × 2 between-groups posttest-only experiment, 738 participants took the role of a patient in a virtual consultation with a doctor; the consultation varied in the doctor's character (hero or villain), its subplot ending (happy or tragic), and its depiction (computer animated or real). The participants’ posttest results showed greater emotional empathy and enjoyment in the hero condition and no significant difference in emotional empathy for the computer animation but greater narrative enjoyment and persuasion. Just endings (hero rewarded, villain punished) elicited much greater pleasure than unjust endings. In comparing computer animation with recorded video, emotional empathy was a significantly stronger predictor of narrative enjoyment than transportation only for the real hero with a tragic ending. The enjoyment and persuasiveness of the computer-animated doctor–patient consultation bodes well for the use of animation in interactive visual narratives.","authors":["Karl F. MacDorman"],"meta":["May 2019Computers in Human Behavior 94","DOI:10.1016/j.chb.2019.01.011","Project: Uncanny Valley"],"references":["328889140_The_doctor's_digital_double_how_warmth_competence_and_animation_promote_adherence_intention","322673843_The_Effect_of_Realistic_Appearance_of_Virtual_Characters_in_Immersive_Environments_-_Does_the_Character's_Personality_Play_a_Role","311466946_Circling_Around_the_Uncanny_Valley_Design_Principles_for_Research_Into_the_Relation_Between_Human_Likeness_and_Eeriness","308365514_Testing_the_'uncanny_valley'_hypothesis_in_semirealistic_computer-animated_film_characters_An_empirical_evaluation_of_natural_film_stimuli","306011572_Familiar_faces_rendered_strange_Why_inconsistent_realism_drives_characters_into_the_uncanny_valley","305725103_Measuring_the_Uncanny_Valley_Effect_Refinements_to_Indices_for_Perceived_Humanness_Attractiveness_and_Eeriness","304469919_The_emotional_arcs_of_stories_are_dominated_by_six_basic_shapes","301951990_The_Uncanny_Valley_A_Focus_on_Misaligned_Cues","332450674_Advertising_Theory_in_the_Digital_Age","318794768_Human_Perception_of_Animacy_in_Light_of_the_Uncanny_Valley_Phenomenon"]}