{"id":"330422860_Varieties_of_economization_in_competition_policy_institutional_change_in_German_and_American_antitrust_1960-2000_Timur_Ergen_Sebastian_Kohl","abstract":"This paper explains the different trajectories of German and American competition policy and its permissiveness toward economic concentration in the last few decades. While the German political economy had moved to a stronger antitrust regime after 1945 and stuck to it even after the economic governance shifts of the 1980s, the traditional antitrust champion, the United States, has shed considerable parts of its basic governance toolkit against anticompetitive conduct since the 1960s. Drawing on theories of institutional change driven by bureaucratic and professional elites, the paper claims that different pathways of professional ideas in competition policy can account for the crosscountry differences. In the 1960s and early 1970s, movements to strengthen competition policy enforcement emerged in both countries. While German as well as American professionals reacted to the seemingly increasing encroachment of societal concerns into antitrust with economized notions of the policies' goals, they did so in fundamentally different ways. Whereas US professionals proposed an effect-based approach in which consumer welfare and gains in efficiency may justify less competition , the more strongly law-based profession in Germany to a degree strengthened a form-based approach aiming at the preservation of competitive market structures. Such extrapolitical pathways of ideas, we argue, provide important guidelines for the implementation of competition policy by administrations and courts, whose decisions can have a far-reaching impact on industries and political economies as a whole.","authors":["Timur Ergen","Sebastian Kohl"],"meta":["January 2019Review of International Political Economy 26(2)","DOI:10.1080/09692290.2018.1563557","Project: Competition"],"references":["321458726_De-constitutionalisation_and_majority_rule_A_democratic_vision_for_Europe","347534003_The_Land_of_Too_Much_American_Abundance_and_the_Paradox_of_Poverty","346817065_IDEAS_AND_POLITICS_THE_ACCEPTANCE_OF_KEYNESIANISM_IN_BRITAIN_AND_THE_UNITED_STATES","345186873_The_Great_Leveler_Capitalism_and_Competition_in_the_Court_of_Law","344522594_The_Greenest_Nation_A_New_History_of_German_Environmentalism","328274136_Adaptation_Recombination_and_Reinforcement_The_Story_of_Antitrust_and_Competition_Law_in_Germany_And_Europe","328088627_A_Legal_Theory_without_Law","326070295_Professional_networks_in_transnational_governance","322962666_Losing_Time_The_Industrial_Policy_Debate","320942374_The_great_leveler_capitalism_and_competition_in_the_court_of_law"]}