{"id":"330474820_Analisis_Kesalahan_Mahasiswa_Dalam_Menyelesaikan_Soal_Matematika_Pada_Pokok_Bahasan_Vektor","abstract":"Kajian Matematika SMA merupakan salah satu mata kuliah yang sangat penting dalam perkuliahan, sebab akan menjadi bekal mahasiswa ketika sudah menjadi seorang pendidik SMA. Jenis penelitian yang dilakukan adalah penelitian kualitatif, karena peneliti melalui investigasi juga mengumpulkan data dengan cara bertatap muka langsung dan berinteraksi dengan objek yang akan diteliti. Tujuan penelitian ini adalah mengidentifikasi kesalahan dan jenis kesalahan mahasiswa dalam menyelesaikan soal Vektor pada mata kuliah Kajian matematika SMA menurut panduan Polya. Dalam mengetahui dan mengidentifikasi kesalahan dan jenis kesalahan mahasiswa diambil subjek penelitian tiga mahasiswa dari kelas penelitian, selanjutnya dilakukan wawancara untuk menggali informasi lebih detail. Manfaat penelitian ini adalah setelah mengetahui kesalahan dan jenis kesalahan dapat dilakukan penelitian lanjutan untuk mengatasi permasalahan tersebt dikemudian hari. Pengambilan subjek dalam penelitian ini berdasar pada keberagaman jenis kesalahan yang dilakaukan mahasiswa dan soal tes berupa soal uraian sebanyak lima soal. Analisis data yang dilakukan meliputi uji instrumen, reduksi data dan penarikan kesimpulan. Berdasarkan analisis data kesalahan paling sering dilakukan tiap nomor terletak pada kesalahan teknis dalam perhitungan dengan rata-rata 59%, rata-rata kesalahan penggunaan data sebesar 39,6%, rata-rata kesalahan pemahaman konsep sebesar 33%, rata-rata kesalahan interpretasi bahasa sebesar 19,8% dan rata-rata kesalahan dalam penarikan kesimpulan sebesar 46,2%. Hasil tersebut dapat dijadikan bahan diskusi dan penelitian selanjutnya, khususnya pada bagian analisis penyebab kesalahan pada teknis penghitungan karena pada tahap ini persentase kesalahannya cukup besar.","authors":["Padrul Jana"],"meta":["April 2018Jurnal Mercumatika Jurnal Penelitian Matematika dan Pendidikan Matematika 2(2):8","DOI:10.26486/jm.v2i2.398"],"references":["321830432_IDENTIFIKASI_KESULITAN_MAHASISWA_DALAM_MEMECAHKAN_MASALAH_OPEN_ENDED_MATERI_NILAI_MUTLAK","318964650_Meningkatkan_Kemampuan_Pemecahan_Masalah_Mahasiswa_Pendidikan_Matematika_UPY_Pada_Mata_Kuliah_Teori_Bilangan_Melalui_Model_Pembelajaran_Creative_Problem_Solving_CPS","262231403_Error_Analysis_of_Mathematical_Word_Problem_Solving_Across_Students_with_and_without_Learning_Disabilities"]}