{"id":"330452434_L'Europe_numerique_Entre_singularites_faiblesses_et_promesses","abstract":"L'activité numérique des économies est devenue un marqueur de leur compétitivité et de leur capacité à relever les défis technologiques futurs. Cette activité s'est clairement intensifiée depuis les années 2000 et a entraîné de nombreuses mutations. La pénétration croissante des nouvelles technologies de l'information et des communications dans les usages est à l'origine de la transformation des modes de production, de consommation, de communication et ouvre la voie à de nouvelles formes de partage, de création, de collaboration et d'innovation. Elle s'est accompagnée d'une montée de la contribution à la production nationale des secteurs des services informatiques et numériques. Cet article s'intéresse à la place de l'Europe dans la révolution numérique en comparaison de celle des États-Unis et de la Chine. Pour ce faire, nous mobilisons trois approches complémentaires : la première, macro-sectorielle, évalue le tissu productif numérique, la deuxième, microéconomique, discute le rôle des acteurs de l'économie des plateformes, la troisième couvre les environnements financier et institutionnel. Il apparaît que l'Europe peine à se constituer en puissance numérique. Elle est marquée par des disparités entre ses États membres et par un retard vis-à-vis des États-Unis et de la Chine dans les secteurs associés à la révolution numérique. Toutefois, à certains égards, l'économie européenne dispose d'atouts pro-metteurs, notamment dans les services. La valeur ajoutée des services informatiques et numériques explique 36 % de la valeur ajoutée numérique totale créée en Europe. Avec 48 % des parts de marché détenues, l'Europe s'impose sur le marché mondial des services numériques. Elle devance les États-Unis et la Chine dans la consommation numérique des activités financières (9,5 %). Forte de son vaste marché de consommateurs qualifiés, l'Europe se montre très active en matière de régulation numérique et de prise en compte des enjeux sociétaux. Les efforts entrepris par les institutions européennes dans le cadre du marché unique numérique et pour la construction d'une Europe numérique restent à intensifier.\n\nMots clés : Europe numérique, services informatiques et numériques, activités de plateformes, capital-risque, politiques européennes, marché unique numérique.","authors":["Cyrielle Gaglio","Sarah Guillou"],"meta":["January 2019Revue de l OFCE 158(4):14-36","DOI:10.3917/reof.158.0011","Project: </ Transformation numérique >"],"references":["325781277_A_taxonomy_of_digital_intensive_sectors","325264574_How_Big_is_China's_Digital_Economy","274731196_An_Illustrated_User_Guide_to_the_World_Input-Output_Database_The_Case_of_Global_Automotive_Production","228122446_BACI_International_Trade_Database_at_the_Product-Level_the_1994-2007_Version"]}