{"id":"330459213_CONSTRUCTION_METHODOLOGY_OF_INFORMATION_SECURITY_SYSTEM_OF_BANKING_INFORMATION_IN_AUTOMATED_BANKING_SYSTEMS","abstract":"The monograph presents modern methodology of building information security systems ofbanking information systems. The methodology is based on a new concept of building a threat model, constructed on synergistic principles. As a result, for the first time a three-tier security model of strategic management of banking information technologies has being built for the automated banking system. This system takes into account threats of cybersecurity, information security and threats for the security of banking information at the same time.\nSpecial attention should be given to the methods proposed in the monograph to ensure the confidentiality, integrity and authenticity of information in banking information systems. In contrast to the known ones, the proposed methods are built on hybrid cryptographic structures with redundant codes. Principles of the methods are mathematical models of hybrid cryptocodic constructions with using asymmetric crypto-modified McEliece and Niederreiter codes and modified geometric codes.\nThe book is full of applied examples that confirm the validity of the developed methods and the adequacy of the proposed models.\nIn this way a comprehensive solution has been proposed from a systemic position on the base of a synergistic approach, to ensure the information security of banking information systems. The proposed methodology opens up the new methods to building security systems for the critical information infrastructures of the state and business which is new in terms of security and a rational in terms of money spent\nThe results are proposed to be used at planning measures to ensure the information security of automated banking systems for minimization of risks from new threats to the security of banking information.\nThe monograph will be useful for researchers and applicants for scientific degrees, and can also be used by students during training to raise awareness of information and cybersecurity issues of modern information technologies.","authors":["Ruslan Hryshchuk","Serhii Yevseiev","Alexander Shmatko"],"meta":["November 2018","DOI:10.29013/R.HRYSHCHUK_S.YEVSEIEV_A.SHMATKO.CMISSBIABS.284.2018","ISBN: 9783903197503","Project: McElis and Niederreiter Crypto Code Structures"],"references":["342480404_PHISHING_AND_E-COMMERCE_AN_INFORMATION_SECURITY_MANAGEMENT_PROBLEM","317584526_QuickCash_Secure_Transfer_Payment_Systems","311957471_Developing_of_multi-factor_authentication_method_based_on_Niederreiter_Mceliece_modified_crypto-code_system","311655881_Review_of_the_Main_Security_Problems_with_Multi-Agent_Systems_used_in_E-commerce_Applications","228748022_Security_issues_of_Internet-based_biometric_authentication_systems_risks_of_Man-in-the-Middle_and_BioPhishing_on_the_example_of_BioWebAuth_-_art_no_68190R","308850069_Modeling_Network_Medium_Access_Protocols_for_Network_Quality_of_Service_Analysis","282461004_TWO-FACTOR_AUTHENTICATION_METHODS_THREATS_ANALYSIS","258402598_NIST_Special_Publication_800-22_A_Statistical_Test_Suite_for_the_Validation_of_Random_Number_Generators_and_Pseudo_Random_Number_Generators_for_Cryptographic_Applications","243776483_Knapsack_Type_Cryptosystems_and_Algebraic_Coding_Theory","242371333_The_Theory_of_Error_Correcting_Codes","220639017_Provable_security_of_block_ciphers_against_linear_cryptanalysis_a_mission_impossible","220591608_An_Information_Systems_Security_Risk_Assessment_Model_Under_Dempster-Shafer_Theory_of_Belief_Functions","225401165_Instant_Ciphertext-Only_Cryptanalysis_of_GSM_Encrypted_Communication","2238097_Practically_Secure_Feistel_Ciphers"]}