{"id":"330519950_TEACHING_AND_LEARNING_MOTIVATION_IN_ENGLISH_MASTERY_FOR_EARLY_SEMESTER_STUDENT_OF_ENGLISH_DEPARTMENT","abstract":"Student can be said master the English if they can master four skills of language, there are speaking skill, writing skill, listening skill, and reading skill. Those skills are will be impossible to achieve if the student do not have motivation, both internal and external The aims of this research is to explain and describe what kinds of motivations that students required to support their expectable achievement related to four skills of language. This research uses qualitative approach, with field research scheme, because the data and instruments are implemented in real condition. The research instruments consist of observation, interview, script interview, and study document. The interview conducted to 10 English lecturers to find out the students’ problems and lecturers’ suggestion regarding to students’ motivation to support teaching and learning process in English department. The result of this research shows that Early semester students are having trouble in adapting English at their university, because of some problems, such as; unconfident in performing English as their instruction language in the classroom, because of their vocabulary limit, difficult in understanding lecturer’s English explanation, and difficult to interact among others in using English. Therefore, they need motivation, both internal and external.","authors":["Arjulayana Arjulayana","Cut Novita Srikandi"],"meta":["December 2018","DOI:10.32665/jec.v1i2.56"],"references":["297928684_Learners'_motivation_and_identity_in_the_Vietnamese_EFL_writing_classroom","251735565_Theories_of_Learning_and_Teaching_What_Do_They_Mean_for_Educators","346643591_Curriculum_Development_in_Language_Teaching","313440196_A_constructivist_approach_to_teaching","308966451_Analyzing_Classroom_Strategy_Evaluating_the_Concept_Mapping_Technique_at_SSC_Level_in_Pakistan","274998135_Teaching_the_Spoken_Language","263588465_Approach_and_Avoidance_Motivation","247564369_Social_Psychology_and_Second_Language_Learning_The_Role_of_Attitudes_and_Motivation","231958433_Motivation_in_Second_and_Foreign_Language_Learning","227795010_Motivation_Reopening_the_Research_Agenda"]}