{"id":"330573471_Digital_Forensics_in_the_Context_of_the_Internet_of_Things","abstract":"The pervasive nature of IoT, envisioned with the characteristics of diversity, heterogeneity, and complexity, is diluting the boundaries between the physical and digital worlds. IoT being widely distributed qualifies it as the breeding ground for cyber-attacks. Although remarkable work is being done to ensure security in IoT infrastructure, security vulnerabilities persist. The IoT infrastructure can either be used as a direct target in a cyber-attack or exploited as a tool to carry a cyber-attack. In either case, the security measures in IoT infrastructure is compromised. The enormous IoT data is sensitive that can act as a gold mine to both the criminals for illicit exploitation or investigators to act as digital witness. IoT forensics help the investigators to acquire intelligence from this smart infrastructure to reconstruct the historical events occurred. However, due to sophisticated IoT architecture, the digital investigators face myriad challenges in IoT-related investigations using existing investigation methodologies and, hence, demand a separate dedicated forensic framework.","authors":["Mariya Shafat Kirmani","M. Tariq Banday"],"meta":["January 2019","DOI:10.4018/978-1-5225-5742-5.ch011","In book: Cryptographic Security Solutions for the Internet of Things (pp.296-324)"],"references":["323384894_Adding_Digital_Forensic_Readiness_as_a_Security_Component_to_the_IoT_Domain","319279867_Security_and_privacy_in_the_internet_of_things","318981575_Evaluation_of_Digital_Forensic_Process_Models_with_Respect_to_Digital_Forensics_as_a_Service","316867894_IoT_Forensic_Bridging_the_Challenges_in_Digital_Forensic_and_the_Internet_of_Things","316788671_Evaluation_of_Digital_Forensic_Process_Models_with_Respect_to_Digital_Forensics_as_a_Service","315835782_Internet_of_things_Security_A_Survey","327292541_IoT_Device_Forensics_and_Data_Reduction","327002783_IoT_Forensic_identification_and_classification_of_evidence_in_criminal_investigations","318715070_Internet_of_Things_Security_and_Forensics_Challenges_and_Opportunities","316734250_An_improved_digital_evidence_acquisition_model_for_the_Internet_of_Things_forensic_I_A_theoretical_framework"]}