{"id":"330584128_International_clinical_practice_recommendations_on_the_definition_diagnosis_assessment_intervention_and_psychosocial_aspects_of_developmental_coordination_disorder","abstract":"Aim\nThese international clinical practice recommendations (CPR) for developmental coordination disorder (DCD), initiated by the European Academy of Childhood Disability (EACD), aim to address key questions on the definition, diagnosis, assessment, intervention, and psychosocial aspects of DCD relevant for clinical practice.\n\nMethod\nKey questions in five areas were considered through literature reviews and formal expert consensus. For recommendations based on evidence, literature searches on ‘mechanisms’, ‘assessment’, and ‘intervention’ were updated since the last recommendations in 2012. New searches were conducted for ‘psychosocial issues’ and ‘adolescents/adults’. Evidence was rated according to the Oxford Centre for Evidence‐Based Medicine (level of evidence [LOE] 1–4) and transferred into recommendations. For recommendations based on formal consensus, two meetings of an international, multidisciplinary expert panel were conducted with a further five Delphi rounds to develop good clinical practice (GCP) recommendations.\n\nResults\nThirty‐five recommendations were made. Eight were based on the evidence from literature reviews (three on ‘assessment’, five on ‘intervention’). Twenty‐two were updated from the 2012 recommendations. New recommendations relate to diagnosis and assessment (two GCPs) and psychosocial issues (three GCPs). Additionally, one new recommendation (LOE) reflects active video games as adjuncts to more traditional activity‐oriented and participation‐oriented interventions, and two new recommendations (one GCP, one LOE) were made for adolescents and adults with DCD.\n\nInterpretation\nThe CPR–DCD is a comprehensive overview of DCD and current understanding based on research evidence and expert consensus. It reflects the state of the art for clinicians and scientists of varied disciplines. The international CPR–DCD may serve as a basis for national guidelines.\n\nWhat this paper adds\n\n• Updated international clinical practice guidelines on developmental coordination disorder (DCD).\n• Refined and extended recommendations on clinical assessment and intervention for DCD.\n• A critical synopsis of current research on mechanisms of DCD.\n• A critical synopsis of psychosocial issues in DCD, with implications for clinical practice.\n• The first international recommendations to consider adolescents and adults with DCD.","authors":["Rainer Blank","Anna Louise Barnett","John Cairney","Dido Green"],"meta":["January 2019Developmental Medicine & Child Neurology 61(Suppl. 4)","DOI:10.1111/dmcn.14132"],"references":["323016262_Evaluating_the_evidence_for_motor-based_interventions_in_developmental_coordination_disorder_A_systematic_review_and_meta-analysis","319113038_Cognitive_and_neuroimaging_findings_in_Developmental_Coordination_Disorder_New_insights_from_a_systematic_review_of_recent_research","318706261_Feasibility_of_Motor_Imagery_Training_for_Children_with_Developmental_Coordination_Disorder_-_A_Pilot_Study","318167157_Toward_a_Hybrid_Model_of_Developmental_Coordination_Disorder","317006034_Mental_health_outcomes_of_developmental_coordination_disorder_in_late_adolescence","315560929_Learning_better_by_repetition_or_variation_Is_transfer_at_odds_with_task_specific_training","314260525_Fundamental_movement_skills_proficiency_in_children_with_developmental_coordination_disorder_Does_physical_self-concept_matter","311960723_Effectiveness_of_Interventions_for_Children_With_Developmental_Coordination_Disorder_in_Physical_Therapy_Contexts_A_Systematic_Literature_Review_and_Meta-Analysis","321971944_Mirror_neuron_system_activation_in_children_with_developmental_coordination_disorder_A_replication_functional_MRI_study","312059461_Developmental_Coordination_Disorder"]}