{"id":"330502885_Effective_Assessment_of_Student_Outcomes_in_Computer_Engineering_Programs_using_a_Minimalistic_Framework","abstract":"Effective frameworks for the assessment of student outcomes are vital to the success of a technical higher-education program. While ensuring the accuracy of the student outcomes assessment usually translates to employing complicated setups, thoughtful abstraction can lead to the desired reliability of assessment with great simplicity. In this paper, a minimalistic framework for the assessment of student outcomes is proposed. The proposed framework is based on senior design experiences of undergraduate computer engineering students. Senior design experiences provide unique opportunities for students to demonstrate their abilities, skills, and experiences that are attained throughout a Bachelor of Engineering program. The proposed framework is based on capstone design projects and a selection of senior design courses of complementary nature. The learning outcomes of the proposed selection of courses are carefully designed to map to all student outcomes. The proposed minimalistic assessment framework leads to results that are only marginally different from those based on a large bouquet of courses ranging from sophomore to senior years of study and thus demonstrates its reliability. The effectiveness of the proposed framework is supported by evaluative and comparative statistical analysis of student outcomes assessments within a multi-year case-study.","authors":["Issam Damaj","Jibran Yousafzai"],"meta":["January 2019International Journal of Engineering Education 35(1):59-75","Project: Methodologies for Assessment and Quality Assurance in Engineering Education"],"references":["320111505_Assessment_and_Evaluation_Framework_with_Successful_Application_in_ABET_Accreditation","318531921_Programmable_Logic_Arrays","304161903_A_Lean_Approach_to_Manage_a_Capstone_Senior_Project_Course","289944504_A_Rubrics_Based_Quality_Improvement_Methodology_for_ABET_Accreditation","267392014_Preparing_Engineering_Students_for_Professional_Practice_Using_Capstone_to_Drive_Continuous_Improvement","265568911_Assessment_Framework_for_Capstone_Design_Courses","258792942_A_Successful_Experience_of_ABET_Accreditation_of_an_Electrical_Engineering_Program","294506335_Planning_and_Implementing_an_Assessment_Process_with_Performance_Criteria_for_ABET_Accreditation","281654585_Capstone_design_courses_and_assessment_A_national_study","261047268_A_semi-autonomous_embedded_systems_course"]}