{"id":"330590831_Computer_Vision_for_Medical_Infant_Motion_Analysis_State_of_the_Art_and_RGB-D_Data_Set_Munich_Germany_September_8-14_2018_Proceedings_Part_VI","abstract":"Assessment of spontaneous movements of infants lets trained experts predict neurodevelopmental disorders like cerebral palsy at a very young age, allowing early intervention for affected infants. An automated motion analysis system requires to accurately capture body movements, ideally without markers or attached sensors to not affect the movements of infants. A vast majority of recent approaches for human pose estimation focuses on adults, leading to a degradation of accuracy if applied to infants. Hence, multiple systems for infant pose estimation have been developed. Due to the lack of publicly available benchmark data sets, a standardized evaluation, let alone a comparison of different approaches is impossible. We fill this gap by releasing the Moving INfants In RGB-D (MINI-RGBD) (Data set available for research purposes at http://s.fhg.de/mini-rgbd) data set, created using the recently introduced Skinned Multi-Infant Linear body model (SMIL). We map real infant movements to the SMIL model with realistic shapes and textures, and generate RGB and depth images with precise ground truth 2D and 3D joint positions. We evaluate our data set with state-of-the-art methods for 2D pose estimation in RGB images and for 3D pose estimation in depth images. Evaluation of 2D pose estimation results in a PCKh rate of 88.1% and 94.5% (depending on correctness threshold), and PCKh rates of 64.2%, respectively 90.4% for 3D pose estimation. We hope to foster research in medical infant motion analysis to get closer to an automated system for early detection of neurodevelopmental disorders.","authors":["Nikolas Hesse","Christoph Bodensteiner","Michael Arens","Ulrich G. Hofmann"],"meta":["January 2019","DOI:10.1007/978-3-030-11024-6_3","In book: Computer Vision – ECCV 2018 Workshops (pp.32-49)"],"references":["327624829_Learning_an_Infant_Body_Model_from_RGB-D_Data_for_Accurate_Full_Body_Motion_Analysis","320362123_On_the_Estimation_of_Children's_Poses","327805241_3D_Human_Pose_Estimation_in_RGBD_Images_for_Robotic_Task_Learning","325373839_Movements_analysis_of_preterm_infants_by_using_depth_sensor","324040544_Stereo_3D_tracking_of_infants_in_natural_play_conditions","323626999_3D_Human_Pose_Estimation_in_RGBD_Images_for_Robotic_Task_Learning","320971099_Hand_Keypoint_Detection_in_Single_Images_Using_Multiview_Bootstrapping","320963917_Realtime_Multi-person_2D_Pose_Estimation_Using_Part_Affinity_Fields","320120875_A_videoIMU_hybrid_system_for_movement_estimation_in_infants","319770228_Convolutional_Pose_Machines"]}