{"id":"330526453_Student_Outcomes_Assessment_Methodology_for_ABET_Accreditation_A_Case_Study_of_Computer_Science_and_Computer_Information_Systems_Programs","abstract":"Acquiring academic accreditation for degree programs is a top priority for Universities across the world. This is understandable because accreditation not only leads to better content and delivery of these programs, but also allows these institutes to acquire good quality students and faculty members. One respectable body that has the mandate to accredit computing programs is Accreditation Board for Engineering and Technology (ABET). In this paper we provide details of our assessment and evaluation strategies for ABET-defined Student Outcomes (SOs) of Computer Science and Computer Information Systems programs. The assessment is mainly carried out through a range of direct and indirect assessment methods including Summative Data Analysis, Formative Data Analysis, Exit Exam, Faculty Survey, and Alumni Survey. Later data gathered from these sources is aggregated and analyzed to quantify attainment of SOs. This also forms the basis of the continuous improvement process activities that are the cornerstone of any accreditation related activity. While presenting this, the paper provides details on the challenges that were faced during the process. The most important contribution includes strategies that were adopted to tackle these issues. A unique aspect of our institute is the academic environment that consists of segregated male and female students and faculty members in order to respect the cultural norms of the society. Another contribution of the paper is that it acts as a guide for institutes and their management that plan to embark upon the journey of accrediting their computing programs.","authors":["Aamir Shafi","Saqib Saeed","Yasser A. Bamarouf","Sardar Zafar Iqbal"],"meta":["January 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2894066","Projects: Pedagogical and Quality Assurance Issues in Higher EducationWireless sensor network"],"references":["319439056_A_Multidisciplinary_Industrial_Robot_Approach_for_Teaching_Mechatronics-Related_Courses","311317587_Successful_accreditation_of_the_Electrical_Engineering_Program_offered_in_two_campuses_at_Caribbean_University","307552008_An_outcome-based_assessment_process_for_accrediting_computing_programmes","323371680_Toward_Standards_in_Undergraduate_Cybersecurity_Education_in_2018","319993788_Comprehensive_guidelines_for_ABET_accreditation_of_a_computer_science_program_the_case_of_the_American_University_of_Kuwait","314201594_The_Expansive_DisIntegration_of_Electrical_Engineering_Education","309450592_The_computing_professional_skills_assessment_An_innovative_method_for_assessing_ABET's_student_outcomes","308816061_Assessment_of_a_cooperative_training_course_using_faculty_course_assessment_report_in_an_ABET_accredited_engineering_technology_program","308808732_On_combining_gamification_theory_and_ABET_criteria_for_teaching_and_learning_engineering","302480460_A_successful_EAC-ABET_accredited_undergraduate_program_in_modeling_and_simulation_engineering_MSE"]}