{"id":"330653968_Quantum_generative_adversarial_learning_in_a_superconducting_quantum_circuit","abstract":"Generative adversarial learning is one of the most exciting recent breakthroughs in machine learning. It has shown splendid performance in a variety of challenging tasks such as image and video generation. More recently, a quantum version of generative adversarial learning has been theoretically proposed and shown to have the potential of exhibiting an exponential advantage over its classical counterpart. Here, we report the first proof-of-principle experimental demonstration of quantum generative adversarial learning in a superconducting quantum circuit. We demonstrate that, after several rounds of adversarial learning, a quantum-state generator can be trained to replicate the statistics of the quantum data output from a quantum channel simulator, with a high fidelity (98.8% on average) so that the discriminator cannot distinguish between the true and the generated data. Our results pave the way for experimentally exploring the intriguing long-sought-after quantum advantages in machine learning tasks with noisy intermediate–scale quantum devices.","authors":["Ling Hu","Shu-Hao Wu","Weizhou Cai","Ma Yuwei"],"meta":["January 2019Science Advances 5(1):eaav2761","DOI:10.1126/sciadv.aav2761"],"references":["331030065_Quantum_error_correction_and_universal_gate_set_operation_on_a_binomial_bosonic_logical_qubit","329511339_A_quantum_machine_learning_algorithm_based_on_generative_models","323392627_Programmable_Interference_between_Two_Microwave_Quantum_Memories","322537646_Deterministic_teleportation_of_a_quantum_gate_between_two_logical_qubits","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","337759825_Programmable_Interference_between_Two_Microwave_Quantum_Memories","329119697_Experimental_repetitive_quantum_channel_simulation","324744952_Quantum_generative_adversarial_networks","324744809_Quantum_Generative_Adversarial_Learning","323562671_Machine_learning_artificial_intelligence_in_the_quantum_domain_A_review_of_recent_progress"]}