{"id":"330662219_ISSN_2394-4714_Foundation_of_Computer_Science_FCS","abstract":"This paper examines the suitability of applying blended electronic learning at High School MANAR SDEER Special (HSMSS) in Riyadh City through analyzing students' views on blended learning environment. Saudi High School began to move with the international trend towards blending and face-to-face with online help when developing new educational processes.This study is to describe the opinions of the realizations of students in learning styles and blended electronic learning Riyadh city high school. The study was carried out on (50) students in High School MANAR SDEER Special (HSMSS) in Riyadh City and pedagogical design to assessment courses 1433-1434H fall semesters. Researcher through a questionnaire to determine the status of students High School MANAR SDEER Special (HSMSS) opinions on blended electronic learning and its performance process; open questions develop to be managed students in sometimes; some students achieve, and records, prove to students participating Internet environment, and the data collected for this study. The results indicated that the more the level of educational attainment for students a positive way towards traditional education face-to-face more interested by the students, the highest score mean = 8.01, and offset directly from this process Electronic learning (EL) (7.88) the combination of these two styles of education resulting in a blended electronic learning (EL) after reaching import content (7.83) Assessment Report 7.86. With the increased interest in the context of adopting blended electronic learning approach at secondary education environment, this work may be of interest to those engaged in conducting research training as well as other stakeholders in the academe to improve the conduct of action research in their respective educational.","authors":["Walid Qwaider"],"meta":["October 2016","Project: E-Learning"],"references":["274753141_How_Much_Does_Subject_Matter_Matter_A_Study_of_Disciplinary_Effects_in_On-Line_MBA_Courses","266370424_TURETMC_COKLU_ORTAM_OGRENME_KURAMI_GENERATIVE_THEORY_OF_MULTIMEDIA_LEARNING","237522363_OPEN_EDUCATIONAL_RESOURCES_FOR_BLENDED_LEARNING_IN_HIGH_SCHOOLS_OVERCOMING_IMPEDIMENTS_IN_DEVELOPING_COUNTRIES","222863721_Blended_Learning_Uncovering_Its_Transformative_Potential_in_Higher_Education","313706668_Blended_learning_systems_Definition_current_trends_and_future_directions","284024298_Blended_learning","265092056_Web_20_for_Content_for_Learning_and_Teaching_in_Higher_Education","254693323_Blended_e-Learning_Model_for_Geomatics_Curriculum_Design_Implementation_and_Evaluation","242267961_Blended_Learning_Experiences_of_Adult_Learners_in_Hong_Kong"]}