{"id":"330672218_Multivariate_statistical_approach_and_water_quality_assessment_of_natural_springs_and_other_drinking_water_sources_in_Southeastern_Nigeria","abstract":"This baseline study investigated the physico-chemical and trace elements (including potentially toxic elements, PTEs) contents of ground and surface water sources used for domestic purposes in some districts within the shale bedrock terrain of Southeastern Nigeria. A total of 124 water samples from 13 natural springs, 24 streams, 80 boreholes and 7 hand-dug wells were collected from rural and urban areas and analysed by ICP-OES, GF-AAS and CV-AFS for 21 elements. The distribution pattern, sources of contamination, health risk of potentially toxic elements (PTEs), together with water quality index were investigated. The results were compared with national and international guidelines for drinking water. Al and Fe were implicated as the dominant pollutants in the water bodies. Water quality index (WQI) indicated that all the water sources had either excellent or good water quality (WQ) with the exception of a borehole, which had poor WQ. Different multivariate statistical approaches applied to evaluate the origins of the elements in the water bodies identified six source types that accounted for 70.88% of the total variance. Anthropogenic activities were considered to contribute much of Cu, Pb, Cd, Cr, Li and P, while Al, As, Co, Fe, Se, Ni, Y and V were likely from crustal materials, minerals and ores, and natural environments. Both anthropogenic and natural sources accounted for the Hg, Mn and Zn. Cluster analysis (CA) was adopted to classify 124 sample points into two groups of water pollution, reflecting influences from crustal materials and anthropogenic sources. From the result of hazard quotient and index (HQ/HI), there is little or no health risks arising from PTEs in using water from the region.","authors":["Innocent C Nnorom","Ugochukwu Ewuzie","Sunday Eze"],"meta":["January 2019Heliyon 5(1):e01123","DOI:10.1016/j.heliyon.2019.e01123","Project: Quality assessment of domestic water sources (springs, streams, hand dug wells and boreholes) in Abia and Imo States of Nigeria."],"references":["323237901_Dependence_of_precipitation_of_trace_elements_on_pH_in_standard_water","316735769_Assessment_of_the_quality_of_groundwater_from_different_parts_of_southeastern_Nigeria_for_potable_use","335099454_Physicochemical_properties_of_waters_in_Soutern_Banat_Serbia_Potential_leaching_of_some_trace_elements_from_ground_and_human_health_risk","325248743_Preliminary_Lithologic_deductions_for_Michael_Okpara_University_of_Agriculture_Umudike_Abia_State_Nigeria_using_Vertical_Electrical_Sounding_method","325034573_Statistical_study_on_distribution_of_multiple_dissolved_elements_and_a_water_quality_assessment_around_a_simulated_stackable_fly_ash","324513924_Groundwater_chemistry_and_human_health_risk_assessment_in_the_mining_region_of_East_Singhbhum_Jharkhand_India","323383331_Assessment_of_heavy_metal_pollution_and_human_health_risks_in_urban_soils_around_an_electronics_manufacturing_facility","319908573_Arsenic_and_trace_elements_in_soil_water_grapevine_and_onion_in_Jachal_Argentina","318352829_Trace_element_concentrations_in_the_groundwater_of_the_Tamiraparani_river_basin_South_India_Insights_from_human_health_risk_and_multivariate_statistical_techniques","308761121_A_study_of_trace_element_contamination_using_multivariate_statistical_techniques_and_health_risk_assessment_in_groundwater_of_Chhaprola_Industrial_Area_Gautam_Buddha_Nagar_Uttar_Pradesh_India"]}