{"id":"330691978_Information_Processing_Artifacts","abstract":"What is a computer? What distinguishes computers from other artificial or natural systems with alleged computational capacities? What does use of a physical system for computation entail, and what distinguishes such use from otherwise identical transformation of that same system when it is not so used? This paper addresses such questions through a theory of information processing artifacts (IPAs), the class of technical artifacts with physical capacities that enable agents to use them as means to their computational ends. Function ascription, use plan requirements, malfunction, and efficacy of IPAs are all addressed in this theory, with emphasis on artifacts that can be used—reliably or otherwise—for digital computation. By explicitly distinguishing physically grounded computational capacities from user-ascribed computational functions, and by recognizing the distinct roles of each for the implementation of computations in artifacts, this theory clearly distinguishes the use of physical systems for computation from the transformations of physical system states that enable such use. As such, it provides a rigorous basis for distinguishing “computers” from other artificial and natural systems—a distinction whose nature and legitimacy faces ever-evolving challenges from multiple disciplines. This theory, and the associated “instrumental” view of computation in artifacts, naturally accommodates the openminded but scrupulous consideration of radically unconventional physical systems as potential substrates for future computers.","authors":["Neal G. Anderson"],"meta":["June 2019Minds and Machines 29(2046)","DOI:10.1007/s11023-019-09491-w"],"references":["326802691_A_unified_mechanistic_account_of_teleological_functions_for_psychology_and_neuroscience","321406967_Computing_Based_on_Material_Training_Application_to_Binary_Classification_Problems","345402963_Representation_and_Reality","341350392_The_Rediscovery_of_the_Mind","331940600_A_Simplicity_Criterion_for_Physical_Computation","326327276_Computational_Artifacts_Towards_a_Philosophy_of_Computer_Science","325205658_AbstractionRepresentation_Theory_and_the_Natural_Science_of_Computation","318061332_Information_as_a_Physical_Quantity","316806956_Technical_Functions","313613612_Pancomputationalism_and_the_Computational_Description_of_Physical_Systems","301340496_The_Computational_Theory_of_Cognition","278732227_Slime_mould_processors_logic_gates_and_sensors","272790785_Unconventional_Computing_Catechism","301340622_Physical_Computation_A_Mechanistic_Account","282744016_A_Perspective_on_Putnam's_Realizability_Theorem_in_the_Context_of_Unconventional_Computation"]}