{"id":"330609901_Modelling_Early_Word_Acquisition_through_Multiplex_Lexical_Networks_and_Machine_Learning","abstract":"Early language acquisition is a complex cognitive task. Recent data-informed approaches showed that children do not learn words uniformly at random but rather follow specific strategies based on the associative representation of words in the mental lexicon, a conceptual system enabling human cognitive computing. Building on this evidence, the current investigation introduces a combination of machine learning techniques, psycholinguistic features (i.e., frequency, length, polysemy and class) and multiplex lexical networks, representing the semantics and phonology of the mental lexicon, with the aim of predicting normative acquisition of 529 English words by toddlers between 22 and 26 months. Classifications using logistic regression and based on four psycholinguistic features achieve the best baseline cross-validated accuracy of 61.7% when half of the words have been acquired. Adding network information through multiplex closeness centrality enhances accuracy (up to 67.7%) more than adding multiplex neighbourhood density/degree (62.4%) or multiplex PageRank versatility (63.0%) or the best single-layer network metric, i.e., free association degree (65.2%), instead. Multiplex closeness operationalises the structural relevance of words for semantic and phonological information flow. These results indicate that the whole, global, multi-level flow of information and structure of the mental lexicon influence word acquisition more than single-layer or local network features of words when considered in conjunction with language norms. The highlighted synergy of multiplex lexical structure and psycholinguistic norms opens new ways for understanding human cognition and language processing through powerful and data-parsimonious cognitive computing approaches.","authors":["Massimo Stella"],"meta":["January 2019Big Data and Cognitive Computing 3(1):10","DOI:10.3390/bdcc3010010","Project: Cognitive Networks and Data Science approaches to understanding cognition"],"references":["329079116_Bots_increase_exposure_to_negative_and_inflammatory_content_in_online_social_systems","328584040_Structural_differences_in_the_semantic_networks_of_younger_and_older_adults","328176445_Cognitive_Network_Science_A_review_of_research_on_cognition_through_the_lens_of_network_representations_processes_and_dynamics","327726351_Cohort_and_Rhyme_Priming_Emerge_from_the_Multiplex_Network_Structure_of_the_Mental_Lexicon","327511572_Filling_gaps_in_early_word_learning","324240372_A_phonological_lexical_and_phonetic_analysis_of_the_new_words_that_young_children_imitate","323471074_Distance_Entropy_Cartography_Characterises_Centrality_in_Complex_Networks","323166521_The_multiplex_structure_of_the_mental_lexicon_influences_picture_naming_in_people_with_aphasia","328457453_Using_network_science_to_analyze_concept_maps_of_psychology_undergraduates","327105752_What_can_quantitative_measures_of_semantic_distance_tell_us_about_creativity"]}