{"id":"330601180_The_Next_Production_Revolution_implications_for_government_and_business_--_3D_printing_and_its_environmental_implications","abstract":"This chapter examines the potential environmental sustainability implications of 3D printing (also called “additive manufacturing”) as it displaces other manufacturing technologies, and lists top priorities for policy interventions to improve environmental sustainability. It considers several of the most widely used 3D printing technologies as they are today and describes trends related to 3D printing’s ability to supplant other technologies in the near future as this method evolves. This analysis compares the environmental impact of today’s typical 3D printing with two classic manufacturing methods, citing life-cycle assessments, scoring greenhouse gas emissions and other air pollutants, material toxicity, resource depletion, and other factors. It also explores how 3D printing will expand into more industries. While this chapter mostly concerns plastic processes, other materials such as metal are also considered. While widespread 3D printing would not automatically be an environmental benefit as practised today, technologies already exist that, if brought from the industry’s fringes to its status quo, could dramatically shift manufacturing towards more sustainable production. Since the industry is at a crossroads, well-placed incentives today might establish beneficial technologies for decades to come, to make widespread 3D printing an important part of a more sustainable future.","authors":["Jeremy Faludi","Natasha Cline-Thomas","Shardul Agrawala"],"meta":["May 2017","In book: The Next Production Revolution- Implications for Governments and Business (pp.171-213)Publisher: Organisation for Economic Cooperation and Development (OECD)","Project: Green 3D Printing"],"references":["309857895_3D_printing_with_biomaterials_Towards_a_sustainable_and_circular_economy","302559709_ReCiPE_2008_A_life_cycle_impact_assessment_method_which_comprises_harmonised_category_indicators_at_the_midpoint_and_the_endpoint_level","314644279_3D_Printing_for_Development_in_the_Global_South","309532857_Water-Based_Robotic_Fabrication_Large-Scale_Additive_Manufacturing_of_Functionally_Graded_Hydrogel_Composites_via_Multichamber_Extrusion","303748246_3D_printing_a_future_collapse-compliant_means_of_production","297933997_Additive_manufacturing_state_of_the_industry","297465731_Despite_Good_Intentions_Why_development_assistance_to_the_third_world_has_failed","291849660_3-D_printing_takes_shape","291302832_The_M-1_rocket_engine","289534874_Emissions_of_ultrafine_particles_and_volatile_organic_compounds_from_commercially_available_desktop_3D_printers_with_multiple_filaments"]}