{"id":"330605411_The_Influence_of_Using_Collapsed_Sub-processes_and_Groups_on_the_Understandability_of_Business_Process_Models","abstract":"Many factors influence the creation of business process models which are understandable for a target audience. Understandability of process models becomes more critical when size and complexity of the models increase. Using vertical modularization to decompose such models hierarchically into modules is considered to improve their understandability. To investigate this assumption, two experiments were conducted. The experiments involved 2 large-scale real-life business process models that were modeled using BPMN v2.0 (Business Process Model and Notation) in the form of collaboration diagrams. Each process was modeled in 3 modularity forms: fully-flattened, flattened where activities are clustered using BPMN groups, and modularized using separately viewed BPMN sub-processes. The objective was to investigate if and how different forms of modularity representation (used for vertical modularization) in BPMN collaboration diagrams influence the understandability of process models. In addition to the forms of modularity representation, the presentation medium (paper vs. computer) and model reader’s level of business process modeling competency were investigated as factors that potentially influence model comprehension. 60 business practitioners from a large organization and 140 graduate students participated in our experiments. The results indicate that, when these three modularity representations are considered, it is best to present the model in a ‘flattened’ form (with or without the use of groups) and in the ‘paper’ format in order to optimally understand a BPMN model. The results also show that the model reader’s business process modeling competency is an important factor of process model comprehension.","authors":["Oktay Turetken","Ahmet Dikici","Irene T. P. Vanderfeesten","Tessa Rompen"],"meta":["April 2020Business & Information Systems Engineering 62(4):1-21","DOI:10.1007/s12599-019-00577-4","Project: Business Process Models: Quality and Human Aspects"],"references":["322949569_The_State_of_Business_Process_Management_2018","319881495_The_State_of_Business_Process_Management_2016","319578153_Factors_Influencing_the_Understandability_of_Process_Models_A_Systematic_Literature_Review","318637986_Influential_Characteristics_of_Enterprise_Information_System_User_Interfaces","316715861_Cognitive_Style_and_Business_Process_Model_Understanding","313388353_How_much_language_is_enough_theoretical_and_practical_use_of_the_business_process_modeling_notation","312036625_Comprehension_of_Procedural_Visual_Business_Process_Models_A_Literature_Review","310494843_Quality_in_Business_Process_Modeling","323976981_Fundamentals_of_Business_Process_Management","310494742_Quality_of_Business_Process_Models"]}