{"id":"330692272_Accelerating_Large-Scale_Multiobjective_Optimization_via_Problem_Reformulation","abstract":"In this work, we propose a framework to accelerate the computational efficiency of evolutionary algorithms on large-scale multiobjective optimization. The main idea is to track the Pareto optimal set directly via problem reformulation. To begin with, the algorithm obtains a set of reference directions in the decision space and associates them with a set of weight variables for locating the Pareto optimal set. Afterwards, the original large-scale multiobjective optimization problem is reformulated into a low-dimensional single-objective optimization problem. In the reformulated problem, the decision space is reconstructed by the weight variables and the objective space is reduced by an indicator function. Thanks to the low dimensionality of the weight variables and reduced objective space, a set of quasi-optimal solutions can be obtained efficiently. Finally, a multiobjective evolutionary algorithm is used to spread the quasi-optimal solutions over the approximate Pareto optimal front evenly. Experiments have been conducted on a variety of large-scale multiobjective problems with up to 5000 decision variables. Four different types of representative algorithms are embedded into the proposed framework and compared with their original versions respectively. Furthermore, the proposed framework has been compared with two state-of-the-art algorithms for large-scale multiobjective optimization. Experimental results have demonstrated the significant improvement benefited from the framework in terms of its performance and computational efficiency in large-scale multiobjective optimization.","authors":["Cheng He","Lianghao Li","Ye Tian","Xingyi Zhang"],"meta":["January 2019IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99):1-1","DOI:10.1109/TEVC.2019.2896002","Project: Large-scale optimization"],"references":["328459927_Sampling_Reference_Points_on_the_Pareto_Fronts_of_Benchmark_Multi-Objective_Optimization_Problems","320004947_Effectiveness_and_efficiency_of_non-dominated_sorting_for_evolutionary_multi-_and_many-objective_optimization","312061859_PlatEMO_A_MATLAB_Platform_for_Evolutionary_Multi-Objective_Optimization","309546550_A_Multi-objective_Evolutionary_Algorithm_Based_on_an_Enhanced_Inverted_Generational_Distance_Metric","306082311_A_Decision_Variable_Clustering-Based_Evolutionary_Algorithm_for_Large-Scale_Many-Objective_Optimization","320638294_Coevolutionary_Multi-objective_Evolutionary_Algorithms_A_Survey_of_the_State-of-the-Art","320458244_A_Competitive_Mechanism_Based_Multi-objective_Particle_Swarm_Optimizer_with_Fast_Convergence","317054094_A_Framework_for_Large-Scale_Multiobjective_Optimization_Based_on_Problem_Transformation","316466354_DG2_A_Faster_and_More_Accurate_Differential_Grouping_for_Large-Scale_Black-Box_Optimization","309443695_Cooperative_co-evolution_with_graph-based_differential_grouping_for_large_scale_global_optimization"]}