{"id":"330624213_3D-printed_breast_phantom_for_multi-purpose_and_multi-modality_imaging","abstract":"Background: \nBreast imaging technology plays an important role in breast cancer planning and treatment. Recently, three-dimensional (3D) printing technology has become a trending issue in phantom constructions for medical applications, with its advantages of being customizable and cost-efficient. However, there is no current practice in the field of multi-purpose breast phantom for quality control (QC) in multi-modalities imaging. The purpose of this study was to fabricate a multi-purpose breast phantom with tissue-equivalent materials via a 3D printing technique for QC in multi-modalities imaging.\n\nMethods: \nWe used polyvinyl chloride (PVC) based materials and a 3D printing technique to construct a breast phantom. The phantom incorporates structures imaged in the female breast such as microcalcifications, fiber lesions, and tumors with different sizes. Moreover, the phantom was used to assess the sensitivity of lesion detection, depth resolution, and detectability thresholds with different imaging modalities. Phantom tissue equivalent properties were determined using computed tomography (CT) attenuation [Hounsfield unit (HU)] and magnetic resonance imaging (MRI) relaxation times.\n\nResults: \nThe 3D-printed breast phantom had an average background value of 36.2 HU, which is close to that of glandular breast tissue (40 HU). T1 and T2 relaxation times had an average relaxation time of 206.81±17.50 and 20.22±5.74 ms, respectively. Mammographic imaging had improved detection of microcalcification compared with ultrasound and MRI with multiple sequences [T1WI, T2WI and short inversion time inversion recovery (STIR)]. Soft-tissue lesion detection and cylindrical tumor contrast were superior with mammography and MRI compared to ultrasound. Hemispherical tumor detection was similar regardless of the imaging modality used.\n\nConclusions: \nWe developed a multi-purpose breast phantom using a 3D printing technique and determined its value for multi-modal breast imaging studies.","authors":["Yaoyao He","Yulin Liu","Brandon Alan Dyer","John M. Boone"],"meta":["January 2019Quantitative Imaging in Medicine and Surgery 9(1):63-74","DOI:10.21037/qims.2019.01.05"],"references":["320781898_Using_3D_Printing_Techniques_to_Create_an_Anthropomorphic_Thorax_Phantom_for_Medical_Imaging_Purposes","315470930_An_Anthropomorphic_Abdominal_Phantom_for_Deformable_Image_Registration_Accuracy_Validation_in_Adaptive_Radiation_Therapy","314097984_A_tissue-equivalent_phantom_series_for_mammography_dosimetry","303087130_Construction_of_an_anthropopathic_abdominal_phantom_for_accuracy_validation_of_deformable_image_registration","320125333_Electrical_properties_of_phantoms_for_mimicking_breast_tissue","314651483_Accuracy_of_fully_automated_quantitative_volumetric_measurement_of_the_amount_of_fibroglandular_breast_tissue_using_MRI_Correlation_with_anthropomorphic_breast_phantoms","308573719_Polyvinyl_chloride_as_a_multimodal_tissue-mimicking_material_with_tuned_mechanical_and_medical_imaging_properties","306939895_World_Cancer_Report","301665739_Technical_Note_Multipurpose_CT_ultrasound_and_MRI_breast_phantom_for_use_in_radiotherapy_and_minimally_invasive_interventions","301625881_Polyvinyl_chloride_plastisol_breast_phantoms_for_ultrasound_imaging"]}