{"id":"330629401_Extended_Contact_Algebras_and_Internal_Connectedness","abstract":"The notion of contact algebra is one of the main tools in the region-based theory of space. It is an extension of Boolean algebra with an additional relation C, called contact. Standard models of contact algebras are topological and are the contact algebras of regular closed sets in a given topological space. In such a contact algebra we add the predicate of internal connectedness with the following meaning—a regular closed set is internally connected if and only if its interior is a connected topological space in the subspace topology. We add also a ternary relation ⊢ meaning that the intersection of the first two arguments is included in the third. In this paper the extension of a Boolean algebra with ⊢, contact and internal connectedness, satisfying certain axioms, is called an extended contact algebra. We prove a representation theorem for extended contact algebras and thus obtain an axiomatization of the theory, consisting of the universal formulas, true in all topological contact algebras with added relations of internal connectedness and ⊢.","authors":["Tatyana Ivanova"],"meta":["January 2019Studia Logica 108(1–3)","DOI:10.1007/s11225-019-09845-6","Project: Space, Time and Modality: Relational, Algebraic and Topological Models"],"references":["330422013_Contact_Algebras_and_Region-based_Theory_of_Space_A_Proximity_Approach-I","322645201_A_mereotopology_based_on_sequent_algebras","268365827_Qualitative_Spatio-_Temporal_Representation_and_Reasoning_Trends_and_Future_Directions","251218417_Topological_logics_over_Euclidean_spaces","242949157_Real_functions_and_near-normal_spaces","285350971_Point_line_and_surface_as_sets_of_solids","264959898_Distributive_Lattices","254890934_G-spaces_compactifications_and_pseudocompactness","251470850_Chapter_13_Qualitative_Spatial_Representation_and_Reasoning","243785843_Topological_representation_of_distributive_lattices_and_Brouwerian_logics"]}