{"id":"330664913_Alternative_parameterizations_of_Metric_Dimension","abstract":"A set of vertices W in a graph G is called resolving if for any two distinct x,y∈V(G), there is v∈W such that dG(v,x)≠dG(v,y), where dG(u,v) denotes the length of a shortest path between u and v in the graph G. The metric dimension md(G) of G is the minimum cardinality of a resolving set. The METRIC DIMENSION problem, i.e. deciding whether md(G)⩽k, is NP-complete even for interval graphs (Foucaud et al., 2017). We study METRIC DIMENSION (for arbitrary graphs) from the lens of parameterized complexity. The problem parameterized by k was proved to be W[2]-hard by Hartung and Nichterlein (2013) and we study the dual parameterization, i.e., the problem of whether md(G)⩽n−k, where n is the order of G. We prove that the dual parameterization admits (a) a kernel with at most 6(k+1) vertices and (b) a randomized algorithm of runtime O⁎(4k+o(k)). Hartung and Nichterlein (2013) also observed that METRIC DIMENSION is fixed-parameter tractable when parameterized by the vertex cover number vc(G) of the input graph. We complement this observation by showing that it does not admit a polynomial kernel even when parameterized by vc(G)+k, unless NP ⊆ coNP/poly. Our reduction also gives evidence for non-existence of polynomial Turing kernels. We also prove that METRIC DIMENSION parameterized by bandwidth or cutwidth does not admit a polynomial kernel, unless NP ⊆ coNP/poly. Finally, using Eppstein's results (2015) we show that METRIC DIMENSION parameterized by max-leaf number does admit a polynomial kernel.","authors":["Gregory Gutin","Ramanujan M S","Felix Reidl","Magnus Wahlström"],"meta":["January 2019Theoretical Computer Science 806","DOI:10.1016/j.tcs.2019.01.028"],"references":["309022765_Kernelization_Using_Structural_Parameters_on_Sparse_Graph_Classes","301856554_Metric_Dimension_of_Bounded_Tree-length_Graphs","330392836_Kernelization_Theory_of_Parameterized_Preprocessing","305384860_Complexity_of_metric_dimension_on_planar_graphs","303653804_A_polynomial_Turing-kernel_for_weighted_independent_set_in_bull-free_graphs","303151748_Leaves_of_trees","289202822_Partially_polynomial_kernels_for_Set_Cover_and_Test_Cover","286276456_Kernelization_Lower_Bounds_Through_Colors_and_IDs","285766852_Recent_developments_in_kernelization_A_survey","277895482_Metric_Dimension_Parameterized_by_Max_Leaf_Number"]}