{"id":"330642615_Evaluating_Moodle_use_via_Smart_Mobile_Phones_A_case_study_in_a_Greek_University","abstract":"The use of learning management systems (LMS) has grown considerably in universities around the world. LMSs can offer a great variety of channels and workspaces to facilitate information sharing and communication among participants in a course. One of the most commonly used is Moodle, a free learning management system enabling the creation of powerful, flexible and engaging online courses and experiences. A course can consist of a number of lessons. Each lesson consists of reading materials; activities such as quizzes, tests, surveys, and projects; and social elements that encourage interaction and group work among students. This study investigated how often students used a mobile phone to access various activities on Moodle. The students’ point of view is important since they are the main users of the offered teaching technique and can cooperate in implementing and improving an e-course as a very important stakeholder in the e-learning process. A survey on self-reported usage was filled by 122 university students in a course offered by the faculty of Preschool Education at the University of Crete. Follow-up interviews were conducted to solicit students’ perceptions on mobile access to Moodle and the underlying reasons. The results show significant differences in students’ usage of various Moodle activities via mobile phones. Students’ responses also suggest that Moodle is used merely as an electronic document repository and not as an effective learning tool due to the limitations of mobile access on usability and reliability.","authors":["Stamatios J Papadakis","Michail Kalogiannakis","Eirini Sifaki","Nikolas Vidakis"],"meta":["July 2018EAI Endorsed Transactions on Creative Technologies 5(16):156382","DOI:10.4108/eai.10-4-2018.156382"],"references":["330058813_Evaluating_pre-service_kindergarten_teachers'_intention_to_adopt_and_use_tablets_into_teaching_practice_for_natural_sciences","323265826_Teaching_natural_science_concepts_to_young_children_with_mobile_devices_and_hands-on_activities_A_case_study","323181812_The_use_of_computer_games_in_classroom_environment","320546761_A_proposal_for_teaching_ScratchJr_programming_environment_in_preservice_kindergarten_teachers","320546661_An_evaluation_of_Greek_educational_Android_apps_for_preschoolers","318665186_Mobile_educational_applications_for_children_What_educators_and_parents_need_to_know","315137160_Mobile_educational_applications_for_children_What_educators_and_parents_need_to_know","315066728_The_Combined_Use_of_Lego_Mindstorms_NXT_and_App_Inventor_for_Teaching_Novice_Programmers","313591909_Perceptions_of_Digital_Competency_among_Student_Teachers_Contributing_to_the_Development_of_Student_Teachers'_Instructional_Self-Efficacy_in_Technology-Rich_Classrooms","313087810_Designing_and_creating_an_educational_app_rubric_for_preschool_teachers"]}