{"id":"330798150_Difficulty_Orientations_Gender_and_RaceEthnicity_An_Intersectional_Analysis_of_Pathways_to_STEM_Degrees","abstract":"Is there a relationship between mathematics ability beliefs and STEM degrees? Fields such as physics, engineering, mathematics, and computer science (PEMC) are thought to require talent or brilliance. However, the potential effects of difficulty perceptions on students’ participation in STEM have yet to be examined using a gender and race/ethnicity intersectional lens. Using nationally representative U.S. longitudinal data, we measure gender and racial/ethnic variation in secondary students’ orientation towards mathematics difficulty. We observed nuanced relationships between mathematics difficulty orientation, gender, race/ethnicity, and PEMC major and degree outcomes. In secondary school, the gap between boys’ and girls’ mathematics difficulty orientations were wider than gaps between White and non-White students. Mathematics difficulty orientation was positively associated with both declaring majors and earning degrees in PEMC. This relationship varied more strongly based on gender than race/ethnicity. Notably, Black women show higher gains in predicted probability to declare a mathematics-intensive major as compared to all other women, given their mathematics difficulty orientations. This study’s findings show that both gender and racial/ethnic identities may influence the relationship between mathematics difficulty orientation and postsecondary STEM outcomes.","authors":["Samantha Nix","Lara Perez-Felkner"],"meta":["January 2019","DOI:10.3390/socsci8020043","Project: Mathematics Ability Beliefs, Gender, and Challenge"],"references":["345726320_Venus_Mars_and_Math_Gender_Societal_Affluence_and_Eighth_Graders'_Aspirations_for_STEM","323791502_Societal_inequalities_amplify_gender_gaps_in_math","322372706_Girl_Power_Gendered_Academic_and_Workplace_Experiences_of_College_Women_in_Engineering","318919524_The_Troubled_Success_of_Black_Women_in_STEM","318839581_Counterspaces_for_women_of_color_in_STEM_higher_education_Marginal_and_central_spaces_for_persistence_and_success_COUNTERSPACES_FOR_WOMEN_OF_COLOR_IN_STEM_EDUCATION","332653842_Gender_Achievement_Gaps_in_US_School_Districts","330480989_Barriers_to_Success_Disadvantages_of_Gender_Normative_Language_to_Women_in_STEM","327252722_Anatomy_of_an_Enduring_Gender_Gap_The_Evolution_of_Women's_Participation_in_Computer_Science","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","317830625_Factors_influencing_black_males'_preparation_for_college_and_success_in_STEM_majors_A_mixed_methods_study"]}