{"id":"330765725_Auditory_Accommodation_to_Poorly_Matched_Non-Individual_Spectral_Localization_Cues_Through_Active_Learning","abstract":"This study examines the effect of adaptation to non-ideal auditory localization cues represented by the Head-Related Transfer Function (HRTF) and the retention of training for up to three months after the last session. Continuing from a previous study on rapid non-individual HRTF learning, subjects using non-individual HRTFs were tested alongside control subjects using their own measured HRTFs. Perceptually worst-rated non-individual HRTFs were chosen to represent the worst-case scenario in practice and to allow for maximum potential for improvement. The methodology consisted of a training game and a localization test to evaluate performance carried out over 10 sessions. Sessions 1–4 occurred at 1 week intervals, performed by all subjects. During initial sessions, subjects showed improvement in localization performance for polar error. Following this, half of the subjects stopped the training game element, continuing with only the localization task. The group that continued to train showed improvement, with 3 of 8 subjects achieving group mean polar errors comparable to the control group. The majority of the group that stopped the training game retained their performance attained at the end of session 4. In general, adaptation was found to be quite subject dependent, highlighting the limits of HRTF adaptation in the case of poor HRTF matches. No identifier to predict learning ability was observed.","authors":["Peter Stitt","Lorenzo Picinali","Brian F G Katz"],"meta":["January 2019Scientific Reports 9(1):1063","DOI:10.1038/s41598-018-37873-0"],"references":["344006275_Spatial_Hearing_The_Psychophysics_of_Human_Sound_Localization","319715262_The_Generalization_of_Auditory_Accommodation_to_Altered_Spectral_Cues","315812259_Measurement_of_a_head-related_transfer_function_database_with_high_spatial_resolution","303882160_Investigation_on_Subjetive_HRTF_Rating_Repeatability","298421012_On_the_Improvement_of_Localization_Accuracy_with_Non-individualized_HRTF-Based_Sounds","287505649_Comparison_of_Different_Egocentric_Pointing_Methods_for_3D_Sound_Localization_Experiments","306046002_Fast_and_persistent_adaptation_to_new_spectral_cues_for_sound_localization_suggests_a_many-to-one_mapping_mechanism","302554212_Comparative_study_on_the_effect_of_Parameter_Mapping_Sonification_on_perceived_instabilities_efficiency_and_accuracy_in_real-time_interactive_exploration_of_noisy_data_streams","298718854_Subjective_HRTF_evaluations_for_obtaining_global_similarity_metrics_of_assessors_and_assessees","292863704_Effects_of_headtracker_latency_in_virtual_audio_displays"]}