{"id":"330766076_POD-Based_Data_Mining_of_Turbulent_Flows_in_Front_of_and_on_Top_of_Smooth_and_Roughness-Resolved_Forward-Facing_Steps","abstract":"A new application of proper orthogonal decomposition (POD) to uncover the relation of the instantaneous energetic large-scale turbulent structures to the dominant POD modes had been reported. Motivated on this method, the data mining from the velocity vector fields measured by the particle image velocimetry (PIV) and structural analysis on the selected POD-based reconstructed turbulent flows in front of and on top of smooth and roughness-resolved forward-facing steps (FFSs) has been performed. The velocity fields containing the most energetic large-scale structures are conditionally chosen. The conditional criterion is that the chosen velocity fields whose POD temporal coefficients of the first or second mode are correspondingly larger than twice of their root mean square (RMS) values. Typically, the most energetic instantaneous structures are the large-scale second-quadrant (Q2) or fourth-quadrant (Q4) events and the mostly open separation bubbles in front of these FFSs; while the large-scale structures behave as a strong shear layer, and near or in which are a few spanwise prograde or retrograde vortices; and sometimes the alternating node and saddle points are appeared. Similarly, for the flow on top of the FFSs, the most energetic structures are presented as a great many large-scale Q4 or Q2 events and a few secondary vortices at the very near wall; while the large-scale structures are overall exhibited as a strong shear layer, and in which a large number of vertex structures are created. These energetic large-scale structures here are not only sensitive to the surface roughness conditions but also to the spanwise locations.","authors":["Yang Shaoqiong","Wang Yanhui","Ming Yang","Yang Song"],"meta":["January 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2894715"],"references":["328330273_Coherent_structures_over_riblets_in_turbulent_boundary_layer_studied_by_combining_time-resolved_particle_image_velocimetry_TRPIV_proper_orthogonal_decomposition_POD_and_finite-time_Lyapunov_exponent_F","318497530_Extremal-point_density_of_scaling_processes_From_fractional_Brownian_motion_to_turbulence_in_one_dimension","312234881_Turbulence_and_the_dynamics_of_coherent_structures_I_Coherent_structures","298737112_Structure_of_Turbulent_Flows_Over_Forward_Facing_Steps_With_Adverse_Pressure_Gradient","285636361_Identification_of_dominant_structures_and_their_flow_dynamics_in_the_turbulent_two-phase_flow_using_POD_technique","273381551_Proper_orthogonal_decomposition_based_outlier_correction_for_PIV_data","317183206_Proper-Orthogonal-Decomposition_Study_of_Turbulent_Near_Wake_of_S805_Airfoil_in_Deep_Stall","289694059_Quadrant_Analysis_in_Turbulence_Research_History_and_Evolution","281479125_Turbulent_Flows_Over_Forward_Facing_Steps_With_Surface_Roughness","275893551_Influence_of_incident_vortex_street_on_separated_flow_around_a_finite_blunt_plate_PIV_measurement_and_POD_analysis"]}