{"id":"330740195_Examining_the_impact_of_a_university_mentorship_program_on_student_outcomes","abstract":"Purpose\nThe purpose of this paper is to examine the outcomes of a formal university mentorship program that paired junior and senior (third and fourth year) undergraduate student mentees with mentors from industry. Specifically, the researchers examined the effects of mentorship on mentees’ psychological sense of community at the university, and job search self-efficacy (confidence).\n\nDesign/methodology/approach\nThe researchers used a mixed-methods design that incorporated survey data and qualitative data from interviews and focus groups. Where relevant, mentees were compared to a control group of students who did not participate in the mentorship program.\n\nFindings\nThe results demonstrate that the mentees accrued several benefits from participating in the mentorship program. For mentees (but not the control group), job search self-efficacy increased over time as a result of participating in the program. Mentees valued receiving practical career-related support such as opportunities for networking, resume development and job interviewing skills. Mentees also gained a more realistic view about the workplace and their potential career options, and received important psychosocial support from their mentor.\n\nOriginality/value\nResults suggest that junior and senior undergraduate student mentees gained professional and career-related benefits including increased job search self-efficacy from participation in a mentorship program that paired them with mentors from industry. In addition, the qualitative results indicate that mentees reported psychosocial benefits including an increased sense of connection to the university. Altogether, results indicate that undergraduate students experience positive outcomes from participating in mentorship programs designed to prepare them for the transition from university to the workplace.","authors":["Leah K. Hamilton","Jennifer Boman","Harris Rubin","Balreen Sahota"],"meta":["January 2019International Journal of Mentoring and Coaching in Education 8(1)","DOI:10.1108/IJMCE-02-2018-0013"],"references":["306145850_Social_cognitive_career_theory","282206721_Developing_business_students'_employability_skills_through_working_in_partnership_with_a_local_business_to_deliver_an_undergraduate_mentoring_programme","276053861_A_Longitudinal_Examination_of_the_Influence_of_Mentoring_on_Organizational_Commitment_and_Turnover","346485278_Collegiate_psychological_sense_of_community_in_relation_to_size_of_collegeuniversity_and_extroversion","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","312516154_Sources_of_self-efficacy_and_outcome_expectations_for_career_exploration_and_decision-making_A_test_of_the_social_cognitive_model_of_career_self-management","311263609_Mentoring_for_educators'_professional_learning_and_development_A_meta-synthesis_of_IJMCE_volumes_1-4","289050410_Strong_faculty_relationships_and_academic_motivation_as_potential_outcomes_of_undergraduate_research","281760954_Student-Faculty_Mentorship_Outcomes","276376926_Building_a_sustainable_structure_to_support_the_Adaptive_Mentorship_model_in_teacher_education"]}