{"id":"330753840_Development_and_Acceptability_of_the_Simplified_Text_in_Differential_Calculus_for_Engineering","abstract":"Differential Calculus is a course that introduces the concepts and theories of higher mathematics and their applications to engineering. A large majority of engineering students fail to attain proficiency in mathematics as the foundation course of engineering programs. One way to help students obtain skills and competency is to develop an effective instructional material (IM). In an attempt to provide the engineering students IM that can supplement their learning process, this study aimed to develop a Simplified Text in Differential Calculus for engineering and determine its acceptability. The study utilized the ADDIE (Analysis, Design, Develop, Implement, and Evaluate) model in developing the IM. The acceptability of the objectives, contents, presentation and style, and exercises in the IM was determined using a validated evaluation instrument. The instrument together with the IM was distributed to 22 engineering professors from the different academic institutions in the Bicol Region using the expert-based method of obtaining the evaluation. The weighted mean was the statistical tool used. Results showed that all text features are highly acceptable. The study is important in providing an effective IM for engineering students to improve their proficiency in higher mathematics.","authors":["Harold Jan Terano"],"meta":["December 2015","DOI:10.7828/jmds.v4i1.851"],"references":["333809181_Development_and_Acceptability_of_the_Simplified_Text_with_Workbook_in_Differential_Equations_as_an_Instructional_Material_for_Engineering","321568355_A_Splintered_Vision_An_Investigation_of_US_Science_and_Mathematics_Education","309109591_STEM_integration_in_K-12_education_status_prospects_and_an_agenda_for_research","290467955_Instructional_Design_Models","288937204_Bringing_ADDIE_to_life_Instructional_design_at_its_best","286705288_A_critical_analysis_of_the_ESP_textbooks_for_Japanese_university_students_of_science_and_engineering","284494622_Expert_Judgments_Versus_Reader_Feedback_A_Comparison_of_Text_Evaluation_Techniques","283815556_Development_of_a_Taxonomy_of_Keywords_for_Engineering_Education_Research","283296486_Dynamics_in_Document_Design_Creating_Texts_for_Readers","264365195_Transforming_Engineering_Education_Through_Educational_Scholarship"]}