{"id":"330763985_MAPAS_CONCEITUAIS_COMO_RECURSO_DE_APRENDIZAGEM_UMA_EXPERIENCIA_NOS_ANOS_INICIAIS","abstract":"____________________________________________________________________________________________________Revista de Educação, Ciências e Matemática v.8 n.2 mai/ago 2018 ISSN 2238-2380 32MAPAS CONCEITUAIS COMO RECURSO DE APRENDIZAGEM: UMA EXPERIÊNCIA NOS ANOS INICIAISCONCEPT MAPS ASALEARNING RESOURCE: AN EXPERIENCE IN INITIAL YEARSGraziela Ferreira de Souza1Nilcéia Aparecida Maciel Pinheiro2Awdry Feisser Miquelin3ResumoEste artigo apresenta parte de uma pesquisa de mestrado que se orientoupara o desenvolvimento de atividades envolvendo o uso de Mapas Conceituais no ensinodeciências para alunos dos anos iniciais do Ensino Fundamental. Nesse estudo destacamos a importância do desenvolvimento de atividadesintrodutórias sobre Mapas Conceituais, de modo a garantir a eficiência desse instrumento como forma de representação da estrutura cognitiva dos alunos.Àluz da Teoria da Aprendizagem Significativa e dos pressupostos sobre Mapas Conceituais, aplicou-se uma sequência de atividadesenvolvendo mapeamento cognitivo a 30 alunos do 5° ano de uma escola municipal da cidade de Ponta Grossa-PR. Os critérios de análise basearam-se no percurso de aprendizagem visualizado por meio dos mapas conceituais produzidos, bem como nos referenciais para classificação de mapas conceituais propostos por Joseph Novak.A partir da análise dos mapas conceituais produzidos durante a pesquisa pode-se observar evolução no domínio dos aspectos referentes ao mapeamento cognitivo e maior significado dado as construções elaboradas para revelara aprendizagem. Isso revelou que os mapas conceituais são um recurso facilitadorda visualização das estruturas e relações conceituais dos alunos quando são bem elaborados e construídos. Portanto, faz-se necessário introduzir este recurso por meio de atividades de treinamento, para que os mapas possam oferecer suporteàs investigações do processo de aprendizagem.Palavras-chave:Mapas Conceituais. Ensino de Ciências. Aprendizagem Significativa. Anos Iniciais.AbstractThis article presents part of a mastersstudy that focuses on the development of activities involving the use of Concept Maps for teaching Science to elementary students. In this study it is emphasized the importance of the development of introductory activities on Concept Maps, in order to guarantee the efficiency of this instrument as a form of representation of the students' cognitive structure. In the light of Meaningful Learning Theory and the assumptions about Concept Maps, a sequence of activities involving cognitive mapping was applied to 30 students of the 5th grade of a municipal school in the city of Ponta Grossa -PR. The analysis criteria were based on the learning visualized through the concept maps produced, as well as on the concept maps classification proposed by Joseph Novak. From the analysis of the concept maps produced during the research it could be observed some evolution in the mastering of the aspects referring to the cognitive mapping, and also a greater meaning given to the constructions elaborated to reveal the learningprocess. Thisrevealed that Concept Maps are facilitatorsof the visualization of students' structures and conceptual relationships when they are well designed and constructed. Therefore, it is necessary to introduce this resource through training activities, so that the maps can support the investigations of the learning process.","authors":["Graziela Ferreira de Souza","Nilcéia Aparecida Maciel Pinheiro","Awdry Miquelin"],"meta":["November 2018"],"references":["329716249_MAPAS_CONCEITUAIS_NO_ENSINO_DE_CIENCIAS_UMA_PROPOSTA_PARA_A_APRENDIZAGEM_SIGNIFICATIVA_DE_CONCEITOS_CIENTIFICOS_NOS_ANOS_INICIAIS","273665181_Nova_abordagem_para_identificar_conexoes_disciplinares_usando_mapas_conceituais_em_busca_da_interdisciplinaridade_no_Ensino_Superior","260082048_Como_fazer_bons_mapas_conceituais_Estabelecendo_parametros_de_referencias_e_propondo_atividades_de_treinamento","45363297_A_teoria_subjacente_aos_mapas_conceituais_e_como_elabora-los_e_usa-los","319475203_Uma_revisao_da_literatura_sobre_trabalhos_com_mapas_conceituais_no_ensino_de_ciencia_do_pre-escolar_as_series_iniciais_do_ensino_fundamental"]}