{"id":"330762633_On_discovering_functions_in_actin_filament_automata","abstract":"We simulate an actin filament as an automaton network. Every atom takes two or three states and updates its state, in discrete time, depending on a ratio of its neighbours in some selected state. All atoms/automata simultaneously update their states by the same rule. Two state transition rules are considered. In semi-totalistic Game of Life like actin filament automaton atoms take binary states ‘0’ and ‘1’ and update their states depending on a ratio of neighbours in the state ‘1’. In excitable actin filament automaton atoms take three states: resting, excited and refractory. A resting atom excites if a ratio of its excited neighbours belong to some specified interval; transitions from excited state to refractory state and from refractory state to resting state are unconditional. In computational experiments, we implement mappings of an 8-bit input string to an 8-bit output string via dynamics of perturbation/excitation on actin filament automata. We assign eight domains in an actin filament as I/O ports. To write True to a port, we perturb/excite a certain percentage of the nodes in the domain corresponding to the port. We read outputs at the ports after some time interval. A port is considered to be in a state True if a number of excited nodes in the port's domain exceed a certain threshold. A range of eight-argument Boolean functions is uncovered in a series of computational trials when all possible configurations of eight-elements binary strings were mapped onto excitation outputs of the I/O domains.","authors":["Andrew Adamatzky"],"meta":["January 2019Royal Society Open Science 6(1):181198","DOI:10.1098/rsos.181198"],"references":["323521900_On_the_Dynamics_of_Excitation_and_Information_Processing_in_F-actin_Automaton_Model","319880174_Logical_gates_in_actin_monomer","317185916_On_dynamics_of_excitation_in_F-actin_automaton_model","313335366_Localized_discrete_breather_modes_in_neuronal_microtubules","305119335_Discovering_Boolean_Gates_in_Slime_Mould","320674006_Discovering_Boolean_Gates_in_Slime_Mould","314117841_Probing_attosecond_dynamics_of_molecules_by_an_intense_a-few-pulse_attosecond_pulse_train","311987949_Vibrations_of_microtubules_Physics_that_has_not_met_biology_yet","306370003_Information_Processing_in_Microtubules_Biomolecular_Automata_and_Nanocomputers","305673955_Models_of_Computing_on_Actin_Filaments"]}