{"id":"330740033_Advances_in_research_on_the_impacts_of_anti-submarine_sonar_on_beaked_whales","abstract":"Mass stranding events (MSEs) of beaked whales (BWs) were extremely rare prior to the 1960s but increased markedly after the development of naval mid-frequency active sonar (MFAS). The temporal and spatial associations between atypical BW MSEs and naval exercises were first observed in the Canary Islands, Spain, in the mid-1980s. Further research on BWs stranded in association with naval exercises demonstrated pathological findings consistent with decompression sickness (DCS). A 2004 ban on MFASs around the Canary Islands successfully prevented additional BW MSEs in the region, but atypical MSEs have continued in other places of the world, especially in the Mediterranean Sea, with examined individuals showing DCS. A workshop held in Fuerteventura, Canary Islands, in September 2017 reviewed current knowledge on BW atypical MSEs associated with MFAS. Our review suggests that the effects of MFAS on BWs vary among individuals or populations, and predisposing factors may contribute to individual outcomes. Spatial management specific to BW habitat, such as the MFAS ban in the Canary Islands, has proven to be an effective mitigation tool and mitigation measures should be established in other areas taking into consideration known population-level information. © 2019 The Author(s) Published by the Royal Society. All rights reserved.","authors":["Yara Bernaldo de Quiros","Antonio Fernandez","Robin William Baird","Robert Brownell"],"meta":["January 2019Proceedings of the Royal Society B: Biological Sciences 286(1895):20182533","DOI:10.1098/rspb.2018.2533","Project: What is new in Cetacean Pathology ?"],"references":["328107976_Pathologic_findings_and_causes_of_death_of_stranded_cetaceans_in_the_Canary_Islands_2006-2012","325607978_Stress_in_Mammals_The_potential_influence_of_fishery-induced_stress_on_dolphins_in_the_eastern_tropical_Pacific_Ocean_US_Department_of_Commerce_NOAA_Technical_Memorandum_NMFS_No_260_133_pp","324747456_Pulmonary_ventilation-perfusion_mismatch_a_novel_hypothesis_for_how_diving_vertebrates_may_avoid_the_bends","320506326_Deadly_acute_Decompression_Sickness_in_Risso's_dolphins","319390264_Diving_behaviour_of_Cuvier's_beaked_whales_exposed_to_two_types_of_military_sonar","317262528_Diet_of_Cuvier's_beaked_whales_Ziphius_cavirostris_from_the_North_Pacific_and_a_comparison_with_their_diet_world-wide","348863200_Diving_and_Subaquatic_Medicine","322051905_Regional_blood_flow_during_simulated_diving_in_the_conscious_Weddell_seal","321660157_Paradoxical_escape_responses_by_narwhals_Monodon_monoceros","321010891_Dive_heart_rate_in_harbour_porpoises_is_influenced_by_exercise_and_expectations"]}