{"id":"330755480_Building_Moral_Robots_Ethical_Pitfalls_and_Challenges","abstract":"This paper examines the ethical pitfalls and challenges that non-ethicists, such as researchers and programmers in the fields of computer science, artificial intelligence and robotics, face when building moral machines. Whether ethics is “computable” depends on how programmers understand ethics in the first place and on the adequacy of their understanding of the ethical problems and methodological challenges in these fields. Researchers and programmers face at least two types of problems due to their general lack of ethical knowledge or expertise. The first type is so-called rookie mistakes, which could be addressed by providing these people with the necessary ethical knowledge. The second, more difficult methodological issue concerns areas of peer disagreement in ethics, where no easy solutions are currently available. This paper examines several existing approaches to highlight the ethical pitfalls and challenges involved. Familiarity with these and similar problems can help programmers to avoid pitfalls and build better moral machines. The paper concludes that ethical decisions regarding moral robots should be based on avoiding what is immoral (i.e. prohibiting certain immoral actions) in combination with a pluralistic ethical method of solving moral problems, rather than relying on a particular ethical approach, so as to avoid a normative bias.","authors":["John-Stewart Gordon"],"meta":["February 2020Science and Engineering Ethics 26(e93)","DOI:10.1007/s11948-019-00084-5"],"references":["324817606_What_do_we_owe_to_intelligent_robots","321676202_The_Artificial_Moral_Advisor_The_Ideal_Observer_Meets_Artificial_Intelligence","321037334_Self-Driving_Cars_and_Engineering_Ethics_The_Need_for_a_System_Level_Analysis","311586220_A_General_Approach_for_Predicting_the_Behavior_of_the_Supreme_Court_of_the_United_States","310615519_Predicting_Judicial_Decisions_of_the_European_Court_of_Human_Rights_A_Natural_Language_Processing_Perspective","312446257_When_is_a_robot_a_moral_agent","308365857_Robots_and_the_Limits_of_Morality","308127260_Should_Moral_Enhancement_Be_Compulsory","301753012_Modelling_morality_with_prospective_logic","297971130_The_moral_law_Groundwork_of_the_metaphysic_of_morals","297608636_Human_Rights_and_Cultural_Identity","293108862_Ethics_for_self-improving_machines","291173065_Clinical_ethics_consultation_Theories_and_methods_implementation_evaluation","290890495_How_machines_might_help_us_achieve_breakthroughs_in_ethical_theory_and_inspire_us_to_behave_better","290565392_Philosophical_concerns_with_machine_ethics"]}