{"id":"330735186_Developing_a_UX_KPI_based_on_the_User_Experience_Questionnaire","abstract":"Decisions in Companies are made typically by using a number of entirely different key figures. A user experience key figure is one of many important key figures that represents one aspect of the success of the company or its products. What we aim in this article is to present to those responsible for a product a method of how a user experience key performance indicator (UX KPI) can be developed using a UX questionnaire. We have developed a UX KPI for use in organizations based on the User Experience Questionnaire (UEQ). To achieve this, we added six questions to the UEQ to measure the importance of the UEQ scales. Based on the UEQ scales and the scores given for importance, we then developed a User Experience Questionnaire KPI (UEQ KPI). In a first study with 882 participants, we calculated and discussed the UEQ KPI using Amazon and Skype. The results show that the six supplementary questions could be answered independently of the UEQ itself. In our opinion, the extension can be implemented without any problems. The resulting UEQ KPI can be used for communication within an organization as a key performance indicator.","authors":["Andreas Hinderks","Martin Schrepp","Francisco José Domínguez Mayo","M.J. Escalona"],"meta":["July 2019Computer Standards & Interfaces 65","DOI:10.1016/j.csi.2019.01.007","Projects: POLOLAS- Guided solutions for the systematization of early quality assurance in software engineeringUX KPI"],"references":["319863058_Design_and_Evaluation_of_a_Short_Version_of_the_User_Experience_Questionnaire_UEQ-S","319454137_Cultural_Differences_in_the_Perception_of_User_Experience","311982961_Construction_of_a_Benchmark_for_the_User_Experience_Questionnaire_UEQ","305077450_Adaption_of_user_experience_questionnaires_for_different_user_groups","304380643_Universals_in_the_content_and_structure_of_values_Theory_and_empirical_tests_in_20_countries","324367465_The_Measurement_of_Meaning","323424582_Statistical_power_analysis_for_the_behavioral_sciences","291326993_Chichester_West_Sussex","284666581_There's_a_SMART_way_to_write_management's_goals_and_objectives","282989000_Communicating_the_UX_Vision_13_Anti-Patterns_That_Block_Good_Ideas"]}