{"id":"330744852_The_Effect_of_Market_Orientation_on_Performance_of_Sharing_Economy_Business_Focusing_on_Marketing_Innovation_and_Sustainable_Competitive_Advantage","abstract":"This study investigated relationships among the market orientation of sharing economy business, marketing innovation, sustainable competitive advantage (SCA), and performance. Attempts are made to understand market orientation from cultural and behavioral perspectives to accelerate marketing innovation and identify measures for SCA and performance building. Frequency, reliability, validity, fitness, and path analyses were performed on 400 respondents, and a structural model was used. The results are as follows. First, functional coordination of the cultural market orientation of sharing economy business with consumer orientation significantly affected product innovation, but competitive orientation’s effect on product innovation was not significant. Competitive orientation and functional coordination significantly affected communication innovation, but consumer orientation’s effect on communication innovation was not significant. Second, market information generation and response to market information of behavioral market orientation of sharing economy business significantly influenced product innovation, but market information exchange’s influence on product innovation was not significant. Even though market information exchange and response to market information had a significant influence on communication innovation, the influence of market information generation on communication innovation was not significant. Third, both product and communication innovation of the marketing innovation of sharing economy business significantly influenced SCA. Fourth, the SCA of sharing economy business significantly influenced market dominating power.","authors":["Youn  Kue Na","Sungmin Kang","Hye  Yeon Jeong"],"meta":["January 2019Sustainability 11(3):729","DOI:10.3390/su11030729"],"references":["343785864_CUSTOMER_POWER_STRATEGIC_INVESTMENT_AND_THE_FAILURE_OF_LEADING_FIRMS","341926199_Strategic_networks","341545787_The_Effect_of_Entrepreneurial_Orientation_on_Marketing_Capability","336727816_The_Study_on_the_Relationships_of_Market_Orientation_Resource_Orientation_Marketing_Innovation_Competitive_Advantage_and_Performance_in_the_Domestic_Firms","329447329_Market_Orientation_Antecedents_and_Consequences","329261641_Market_Orientation_The_Construct_Research_Propositions_and_Managerial_Implications","329261404_The_Effect_of_a_Market_Orientation_on_Business_Profitability","329261160_The_Capabilities_of_Market-Driven_Organizations","329054982_Market_Orientation_and_Organizational_Performance_Is_Innovation_a_Missing_Link","328710885_Assessing_Advantage_A_Framework_for_Diagnosing_Competitive_Superiority"]}