{"id":"330855103_Curating_Simulated_Storyworlds","abstract":"There is a peculiar method in the area of procedural narrative called emergent narrative: instead of automatically inventing stories or deploying authored narrative content, a system simulates a storyworld out of which narrative may emerge from the happenstance of character activity in that world. It is the approach taken by some of the most successful works in the history of computational media (The Sims, Dwarf Fortress), but curiously also some of its most famous failures (Sheldon Klein's automatic novel writer, Tale-Spin). How has this been the case? To understand the successes, we might ask this essential question: what is the pleasure of emergent narrative? I contend that the form works more like nonfiction than fiction---emergent stories actually happen---and this produces a peculiar aesthetics that undergirds the appeal of its successful works. What then is the pain of emergent narrative? There is a ubiquitous tendency to misconstrue the raw transpiring of a simulation (or a trace of that unfolding) as being a narrative artifact, but such material will almost always lack story structure.\n\nSo, how can the pain of emergent narrative be alleviated while simultaneously maintaining the pleasure? This dissertation introduces a refined approach to the form, called curationist emergent narrative (or just curationism), that aims to provide an answer to this question. Instead of treating the raw material of simulation as a story, in curationism that material is curated to construct an actual narrative artifact that is then mounted in a full-fledged media experience (to enable human encounter with the artifact). This recasts story generation as an act of recounting, rather than invention. I believe that curationism can also explain how both wild successes and phenomenal failures have entered the oeuvre of emergent narrative: in successful works, humans have taken on the burden of curating an ongoing simulation to construct a storied understanding of what has happened, while in the failures humans have not been willing to do the necessary curation. Without curation, actual stories cannot obtain in emergent narrative.\n\nBut what if a storyworld could curate itself? That is, can we build systems that automatically recount what has happened in simulated worlds? In the second half of this dissertation, I provide an autoethnography and a collection of case studies that recount my own personal (and collaborative) exploration of automatic curation over the course of the last six years. Here, I report the technical, intellectual, and media-centric contributions made by three simulation engines (World, Talk of the Town, Hennepin) and three second-order media experiences that are respectively driven by those engines (Diol/Diel/Dial, Bad News, Sheldon County). In total, this dissertation provides a loose history of emergent narrative, an apologetics of the form, a polemic against it, a holistic refinement (maintaining the pleasure while killing the pain), and reports on a series of artifacts that represent a gradual instantiation of that refinement. To my knowledge, this is the most extensive treatment of emergent narrative to yet appear.","authors":["James Ryan"],"meta":["December 2018","Thesis for: PhD in Computational MediaAdvisor: Michael Mateas, Noah Wardrip-Fruin"],"references":[]}