{"id":"330804118_Science_of_Scientific_Team_Science_A_survey","abstract":"Scientific teamwork collaboration is an integral element of the scientific process that often leads to significant findings. Systematic analysis of scientific teamwork collaboration continues to influence both the advance in science and knowledge production. This paper presents an overview of Science of Scientific Team Science (SSTS). SSTS explores the behaviors and attributes of teamwork and team-based collaboration specific to scientific teams from the perspective of quantitative analysis, which refers to a branch of science that analyzes and discovers scientific collaboration patterns inter- or extra-team. Aiming at assisting scientific team formation, improving collaboration environment, evaluating team performance, and fostering collaborative behaviors, this survey presents an overview in SSTS. Theoretical background of SSTS at different team development stages has been discussed. In addition, three classifications of SSTS, including interdisciplinary, multidisciplinary, and transdisciplinary research approaches have been investigated. Their associated similarities and differences, challenges and benefits, are also examined. This paper also summarizes web-based tools that enhance one's understanding and opinion of SSTS. Key technologies and open issues are then discussed. The association among scientific collaboration, scientific teamwork, SSTS, and cross-disciplinary research gives rise to critical implications for scholars who wish to employ and invest in those issues.","authors":["Shuo Yu","Hayat Dino Bedru","Ivan Lee","Feng Xia"],"meta":["February 2019Computer Science Review 31:72-83","DOI:10.1016/j.cosrev.2018.12.001"],"references":["325252792_Interdisciplinary_relations_of_converging_technologies_Nano-Bio-Info-Cogno_NBIC","320678663_Gaining_insight_into_interdisciplinary_research_and_education_programmes_A_framework_for_evaluation","317904989_Author_contributions_to_ecological_publications_What_does_it_mean_to_be_an_author_in_modern_ecological_research","326101935_The_globalisation_of_scientific_mobility_1970-2014","324433981_In_the_eyes_of_the_beholder_The_effect_of_participant_diversity_on_perceived_merits_of_collaborative_innovations","324178281_Perspective-Rethinking_Teams_From_Bounded_Membership_to_Dynamic_Participation","322620094_Integrating_Diversity_at_Different_Levels_Multilevel_Human_Capital_Social_Capital_and_Demographic_Diversity_and_Their_Implications_for_Team_Effectiveness","322410495_Is_Scientific_Collaboration_Sustainability_Predictable","322409958_Evaluating_the_Impact_of_Articles_with_Geographical_Distances_between_Institutions","313560550_Establishing_Effective_Global_Virtual_Student_Teams"]}