{"id":"330893720_Artificial_intelligence_in_cancer_imaging_Clinical_challenges_and_applications","abstract":"Judgement, as one of the core tenets of medicine, relies upon the integration of multilayered data with nuanced decision making. Cancer offers a unique context for medical decisions given not only its variegated forms with evolution of disease but also the need to take into account the individual condition of patients, their ability to receive treatment, and their responses to treatment. Challenges remain in the accurate detection, characterization, and monitoring of cancers despite improved technologies. Radiographic assessment of disease most commonly relies upon visual evaluations, the interpretations of which may be augmented by advanced computational analyses. In particular, artificial intelligence (AI) promises to make great strides in the qualitative interpretation of cancer imaging by expert clinicians, including volumetric delineation of tumors over time, extrapolation of the tumor genotype and biological course from its radiographic phenotype, prediction of clinical outcome, and assessment of the impact of disease and treatment on adjacent organs. AI may automate processes in the initial interpretation of images and shift the clinical workflow of radiographic detection, management decisions on whether or not to administer an intervention, and subsequent observation to a yet to be envisioned paradigm. Here, the authors review the current state of AI as applied to medical imaging of cancer and describe advances in 4 tumor types (lung, brain, breast, and prostate) to illustrate how common clinical problems are being addressed. Although most studies evaluating AI applications in oncology to date have not been vigorously validated for reproducibility and generalizability, the results do highlight increasingly concerted efforts in pushing AI technology to clinical use and to impact future directions in cancer care.","authors":["Wenya Linda Bi","Ahmed Hosny","Matthew B. Schabath","Maryellen L. Giger"],"meta":["February 2019CA A Cancer Journal for Clinicians 69(2)","DOI:10.3322/caac.21552","Project: Radiomics and Lung Cancer"],"references":["336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","327287174_Unsupervised_Medical_Image_Segmentation_Based_on_the_Local_Center_of_Mass","327046649_Data_analysis_strategies_in_medical_imaging","327013943_MRI-Targeted_or_Standard_Biopsy_for_Prostate-Cancer_Diagnosis","325076728_An_anatomic_transcriptional_atlas_of_human_glioblastoma","327586244_Medical_Image_Synthesis_for_Data_Augmentation_and_Anonymization_Using_Generative_Adversarial_Networks_Third_International_Workshop_SASHIMI_2018_Held_in_Conjunction_with_MICCAI_2018_Granada_Spain_Septe","327511185_MGMT_promoter_methylation_status_testing_to_guide_therapy_for_glioblastoma_Refining_the_approach_based_on_emerging_evidence_and_current_challenges","327026577_A_radiomics_approach_to_assess_tumour-infiltrating_CD8_cells_and_response_to_anti-PD-1_or_anti-PD-L1_immunotherapy_an_imaging_biomarker_retrospective_multicohort_study","325209967_Artificial_intelligence_in_radiology","324552563_Pembrolizumab_plus_Chemotherapy_in_Metastatic_Non-Small-Cell_Lung_Cancer"]}