{"id":"330834020_University_Graduates'_Soft_Skills_the_Employers'_Opinion","abstract":"The relevance of the issues addressed in the article is determined by the importance of organizing the dialogue between education and business to ensure the high quality of training specialists. Soft skills are considered from the standpoint of the unity of requirements for training, evaluation and development of human resources. The main focus is on analyzing the attitude of employers towards soft skills, approved by the Ministry of Education and Science of the Russian Federation for the preparation of bachelors and masters: the significance of soft skills for employees of the enterprise (organization); the level of the formation of soft skills among university graduates who apply or work at the enterprise; functions (tasks), in which the relevant competences are important. This article presents the results of a survey of employers on the soft skills of university graduates, in which 36 people took part - heads of organizations and representatives of personnel services from different spheres (health, culture, education, radio electronics, petro chemistry, housing and communal services, tourism, construction, etc.), different forms of ownership and the enterprise (organization) size. The survey was conducted in the form of an individual interview. The key positions of the interview were to identify the employers' opinion on the importance of soft skills for the employees of the enterprise (organization); the level of the formation of soft skills among university graduates who apply or work at the enterprise; functions (tasks), in which the relevant competences are important.","authors":["M.V. Gruzdev","I.V. Kuznetsova","I.Y. Tarkhanova","E.I. Kazakova"],"meta":["December 2018","DOI:10.13187/ejced.2018.4.690"],"references":["222051009_Measuring_the_Academic_Skills_of_University_Students_Evaluation_of_a_diagnostic_procedure","301377742_Operation_and_Management_of_Urban_Rail_Transit_Education_Reform_Based_on_CDIO","287422765_A_new_assessment_and_evaluation_system_for_an_engineering_course_based_on_the_CDIO_model","222227362_Transferable_Skills_Promoting_Student_Research"]}