{"id":"330863744_Binary_multi-verse_optimization_algorithm_for_global_optimization_and_discrete_problems","abstract":"Multi-verse optimizer is one of the recently proposed nature-inspired algorithms that has proven its efficiency in solving challenging optimization problems. The original version of Multi-verse optimizer is able to solve problems with continuous variables. This paper proposes a binary version of this algorithm to solve problems with discrete variables such as feature selection. The proposed Binary Multi-verse optimizer is equipped with a V-shaped transfer function to covert continuous values to binary, and update the solutions over the course of optimization. A comparative study is conducted to compare Binary Multi-verse optimizer with other binary optimization algorithms such as Binary Bat Algorithm, Binary Particle Swarm Optimization, Binary Dragon Algorithm, and Binary Grey Wolf Optimizer. As case studies, a set of 13 benchmark functions including unimodal and multimodal is employed. In addition, the number of variables of these test functions are changed (5, 10, and 20) to test the proposed algorithm on problems with different number of parameters. The quantitative results show that the proposed algorithm significantly outperforms others on the majority of benchmark functions. Convergence curves qualitatively show that for some functions, proposed algorithm finds the best result at early iterations. To demonstrate the applicability of proposed algorithm, the paper considers solving feature selection and knapsack problems as challenging real-world problems in data mining. Experimental results using seven datasets for feature selection problem show that proposed algorithm tends to provide better accuracy and requires less number of features compared to other algorithms on most of the datasets. For knapsack problem 17 benchmark datasets were used, and the results show that the proposed algorithm achieved higher profit and lower error compared to other algorithms.","authors":["Nailah Al-Madi","Hossam Faris","Seyedali Mirjalili"],"meta":["December 2019International Journal of Machine Learning and Cybernetics 10(3)","DOI:10.1007/s13042-019-00931-8","Project: Multi-Verse Optimizer (MVO): theories, variants, and applications"],"references":["326861200_An_Intelligent_System_for_Spam_Detection_and_Identification_of_the_most_Relevant_Features_based_on_Evolutionary_Random_Weight_Networks_Information_Fusion_Impact_Factor_12975","326592467_Asynchronous_Accelerating_Multi-leader_Salp_Chains_for_Feature_Selection","324109194_Feature_Selection_Using_Salp_Swarm_Algorithm_with_Chaos","317649369_Grey_Wolf_Optimization_Applied_to_the_01_Knapsack_Problem","333319088_Subset_Selection_Noise","327737909_Binary_Grasshopper_Optimisation_Algorithm_Approaches_for_Feature_Selection_Problems","318830306_On_Subset_Selection_with_General_Cost_Constraints","318594207_Solving_0-1_Knapsack_Problems_by_Binary_Dragonfly_Algorithm","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","313151683_Test_functions_for_optimization_needs"]}