{"id":"330876717_Isomorphic_Relationships_Between_Voltage-Source_and_Current-Source_Converters","abstract":"Graph isomorphism phenomenon has been identified since the 1930s, which was firstly addressed in the graph-theoretical field and was thoroughly studied as a critical topic of computer science. In many research disciplines, isomorphism theory and dual principles are identified as powerful tools in the study of related subjects. However, during the development of power converters, only dual principles have been adopted, such as in the study of relationships between voltage-source converter (VSC) and current-source converter (CSC), while the isomorphic relationship between them was never discovered. This indeed limits the understanding of relationships among converter topologies. In this paper, such isomorphic relationships are firstly revealed in the power converter field. Several topologies are discovered as isomorphic pairs, and the modulation isomorphism between single-phase three-level VSC and three-phase CSC is also demonstrated. The experimental results verify that the physical meaning of direct PWM for CSC is the modulation process of the DC-side voltage of three-phase CSC as its isomorphic pair shows. With the aid of isomorphic transformation, the existing knowledge of VSCs can be directly transformed into corresponding CSCs to deal with problems where dual principle has difficulties, which provides another opportunity for innovation of power converters.","authors":["Yuzhuo Li","Li Ding","Yunwei Ryan Li"],"meta":["February 2019IEEE Transactions on Power Electronics PP(99):1-1","DOI:10.1109/TPEL.2019.2895827","Project: Multilevel Converter: Topologies, PWM and Control"],"references":["324961091_A_Novel_Carrier-Overlapped_PWM_Method_for_Four-Level_Neutral-Point_Clamped_Converters","323564141_Carrier_Based_Stair_Edge_PWM_SEPWM_for_Capacitor_Balancing_In_Multilevel_Converters_with_Floating_Capacitors","324872982_Electrical_Networks_and_Algebraic_Graph_Theory_Models_Properties_and_Applications","321991031_A_Guide_to_Matching_Medium_Voltage_Drive_Topology_to_Petrochemical_Applications","321814288_A_guide_to_matching_medium_voltage_drive_topology_to_petrochemical_applications","292215685_General_topological_properties_of_switching_structures","281479518_2-Isomorphic_Graphs","271461172_A_novel_carrier_based_PWM_for_current_source_converter","265354140_Categories_for_the_working_mathematician_2nd_ed","260359996_A_Carrier-Based_PWM_Strategy_With_the_Offset_Voltage_Injection_for_Single-Phase_Three-Level_Neutral-Point-Clamped_Converters"]}