{"id":"330872439_Face_Recognition_Techniques_A_Critical_Review","abstract":"Humans have the ability to identify each other. Identification of a person by his facial image is known as face recognition. To identify a person by comparing image data or live capture with stored data is the biometric method of face recognition. A set of measurable and unique characteristics of a person can be used to recognize an individual automatically. To recognize a person automatically is one of the challenging problems in computer science. Face recognition is a technique of biometrics, which operates on image data from the obtained data. Face Recognition is used for security purposes. Physical interaction is not required in case of face recognition on behalf of the user. Face recognition is used for both verification and identification. This study of face recognition provides a review of various face recognition algorithms based on local feature extraction methods, dimensionality reduction approaches and hybrid methods. It provides a collection of face recognition techniques, critical review, and description of major face recognition algorithms. In addition, a classification of face recognition has also been provided. This work would be an attempt to study the major methods/techniques involved in the recognition of faces.","authors":["Akib Khanday","Rumaan Bashir"],"meta":["January 2018","Project: Face Recognition"],"references":["317083802_Eigenfaces_vs_Fisherfaces_Recognition_Using_Class_Specific_Linear_Projection","280739845_An_Efficient_Real_Time_Hybrid_Face_Recognition_Algorithm_in_Java_Environment","321619782_Handbook_of_Biometrics","320112472_Face_recognition_by_Elastic_Bunch_Graph_Matching","314946314_Elastic_Bunch_Graph_Matching","285090956_Face_Recognition_The_Problem_of_Compensating_for_Changes_in_Illumination_Direction","274467188_Performance_Analysis_of_PCA-based_and_LDA-based_Algorithms_for_Face_Recognition","264006142_Good_match_exploration_for_infrared_face_recognition","260869480_The_Use_of_Multiple_Measurements_in_Taxonomic_Problems","260135725_A_Tutorial_on_Principal_Components_Analysis"]}