{"id":"330896425_Clustering_based_Semi-Supervised_Machine_Learning_for_DDoS_Attack_Classification","abstract":"Semi-supervised machine learning can be used for obtaining subsets of unlabeled or partially labeled dataset based on the applicable metrics of dissimilarity. At later stage, the data is completely assigned the labels as per the observed differentiation. This paper provides a clustering based approach to distinguish the data representing flows of network traffic which include both normal and Distributed Denial of Service (DDoS) traffic. The features are taken for victim-end identification of attacks and the work is demonstrated with three features which can be monitored at the target machine. The clustering methods include agglomerative and K-means with feature extraction under Principal Component Analysis (PCA). A voting method is also proposed to label the data and obtain classes to distinguish attacks from normal traffic. After labeling, supervised machine learning algorithms of k-Nearest Neighbors (kNN), Support Vector Machine (SVM) and Random Forest (RF) are applied to obtain the trained models for future classification. The kNN, SVM and RF models in experimental results provide 95%, 92% and 96.66% accuracy scores respectively under optimized parameter tuning within given sets of values. In the end, the scheme is also validated using a subset of benchmark dataset with new vectors of attack.","authors":["Muhammad Aamir","Syed Mustafa Ali Zaidi"],"meta":["February 2019Journal of King Saud University - Computer and Information Sciences 33(2)","DOI:10.1016/j.jksuci.2019.02.003"],"references":["325423440_Intrusion_Detection_in_Network_Systems_Through_Hybrid_Supervised_and_Unsupervised_Machine_Learning_Process_A_Case_Study_on_the_ISCX_Dataset","324824830_Multivariate_network_traffic_analysis_using_clustered_patterns","323149184_Semi-supervised_machine_learning_approach_for_DDoS_detection","321881509_Multiple-Features-Based_Semisupervised_Clustering_DDoS_Detection_Method","313809055_The_Role_of_Machine_Learning_in_Botnet_Detection","324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","322870768_Toward_Generating_a_New_Intrusion_Detection_Dataset_and_Intrusion_Traffic_Characterization","321066309_Millions_of_targets_under_attack_a_macroscopic_characterization_of_the_DoS_ecosystem","320650717_Development_of_a_network_intrusion_detection_system_using_Apache_Hadoop_and_Spark","315365828_Review_of_semi-supervised_method_for_Intrusion_Detection_System"]}