{"id":"330808875_Artificial_intelligence_systems_for_complex_decision-making_in_acute_care_medicine_A_review","abstract":"The integration of artificial intelligence (AI) into acute care brings a new source of intellectual thought to the bedside. This offers great potential for synergy between AI systems and the human intellect already delivering care. This much needed help should be embraced, if proven effective. However, there is a risk that the present role of physicians and nurses as the primary arbiters of acute care in hospitals may be overtaken by computers. While many argue that this transition is inevitable, the process of developing a formal plan to prevent the need to pass control of patient care to computers should not be further delayed.\nThe first step in the interdiction process is to recognize; the limitations of existing hospital protocols, why we need AI in acute care, and finally how the focus of medical decision making will change with the integration of AI based analysis. The second step is to develop a strategy for changing the focus of medical education to empower physicians to maintain oversight of AI. Physicians, nurses, and experts in the field of safe hospital communication must control the transition to AI integrated care because there is significant risk during the transition period and much of this risk is subtle, unique to the hospital environment, and outside the expertise of AI designers.\nAI is needed in acute care because AI detects complex relational time-series patterns within datasets and this level of analysis transcends conventional threshold based analysis applied in hospital protocols in use today. For this reason medical education will have to change to provide healthcare workers with the ability to understand and over-read relational time pattern centered communications from AI. Medical education will need to place less emphasis on threshold decision making and a greater focus on detection, analysis, and the pathophysiologic basis of relational time patterns. This should be an early part of a medical student’s education because this is what their hospital companion (the AI) will be doing.\nEffective communication between human and artificial intelligence requires a common pattern centered knowledge base. Experts in safety focused human to human communication in hospitals should lead during this transition process.","authors":["Lawrence A. Lynn"],"meta":["February 2019Patient Safety in Surgery 13(1)","DOI:10.1186/s13037-019-0188-2"],"references":["324240469_Opportunities_and_obstacles_for_deep_learning_in_biology_and_medicine","262383338_Dynamic_diagnostic_relationism_A_new_diagnostic_paradigm_for_complex_rapidly_changing_clinical_conditions","235893521_Sepsis_definitions_Time_for_change","49830091_Patterns_of_unexpected_in-hospital_deaths_A_root_cause_analysis","7442104_Communication_failures_in_patient_sign-out_and_suggestions_for_improvement_A_critical_incident_analysis","329550484_Personalized_evidence_based_medicine_Predictive_approaches_to_heterogeneous_treatment_effects","322133343_An_Interpretable_Machine_Learning_Model_for_Accurate_Prediction_of_Sepsis_in_the_ICU","236225206_Effect_of_a_Systems_Intervention_on_the_Quality_and_Safety_of_Patient_Handoffs_in_an_Internal_Medicine_Residency_Program","15831736_The_Threshold_Approach_to_Clinical_Decision_Making"]}