{"id":"330812567_A_review_of_screening_tools_for_the_identification_of_autism_spectrum_disorders_and_developmental_delay_in_infants_and_young_children_recommendations_for_use_in_low-_and_middle-income_countries","abstract":"Without intervention, developmental delay (DD) and autism spectrum disorders (ASDs) severely restrict children from reaching their developmental potential. Monitoring child development through the use of screening tools can help identify children who need further assessment or intervention. Screening has been widely encouraged to identify children with ASD or DD, and a large variety of screening instruments are suggested in the literature. There is a lack of consensus around which screening tools are most effective, especially where tools are used in cultures other than those in which they were created. We conducted a review of the literature for screening tools for DD and autism to make recommendations for tool selection and use in low‐ and middle‐income countries (LMIC). We included 99 screening tools in the review and created profiles for each tool to evaluate their properties and determine which tools could be effectively used in various LMIC. Our review identified a substantial number (35 for DD and 6 for ASD) of screening tools from LMIC. We identified 10 tools which show promise for use across settings; these tools are brief, low‐cost and can be implemented by paraprofessionals or lay community health workers. Routine screening is an important first step toward addressing the need for services in LMIC, but high‐quality tools take time to be conceptualized, developed, piloted, and validated, before implementation can happen. A focus on improving the scientific rigor of early detection approaches and on enhancing the reach to underserved populations should be prioritized. Autism Research 2019. © 2019 International Society for Autism Research, Wiley Periodicals, Inc.\n\nLay Summary\nScreening tools are short questionnaires or brief assessments used to identify children at risk of a developmental disability such as autism. Many screening tools exist, but there is uncertainty about which tools work best in non‐Western cultures or low‐resource settings. We reviewed over 90 screening tools to identify which tools can be easily used in these settings. Selecting tools that are affordable and easy to use will make it easier to identify and support children with developmental difficulties.","authors":["Marguerite B Marlow","Chiara Servili","Mark Tomlinson"],"meta":["February 2019Autism Research 12(11)","DOI:10.1002/aur.2033"],"references":["319892251_Global_services_and_support_for_children_with_developmental_delays_and_disabilities_Bridging_research_and_policy_gaps","316140289_Screening_for_developmental_delay_in_preschoolaged_children_using_parent-completed_Ages_and_Stages_Questionnaires_Additional_insights_into_child_development","314292696_Is_a_Positive_Developmental-Behavioral_Screening_Score_Sufficient_to_Justify_Referral_A_Review_of_Evidence_and_Theory","313538878_Development_and_validation_of_an_early_childhood_development_scale_for_use_in_low-resourced_settings","313415997_Culturally_adapted_pictorial_screening_tool_for_autism_spectrum_disorder_A_new_approach","309586136_A_Systematic_Review_of_Research_on_Autism_Spectrum_Disorders_in_Sub-Saharan_Africa","309581720_Requirements_for_Minimum_Sample_Size_for_Sensitivity_and_Specificity_Analysis","313444682_An_abbreviated_screening_instrument_for_autism_spectrum_disorders","307968141_Selecting_measures_for_the_neurodevelopmental_assessment_of_children_in_low-_and_middle-income_countries","306135926_Validity_of_parents'_evaluation_of_developmental_status_PEDS_in_detecting_developmental_disorders_in_3-12_month_old_infants"]}