{"id":"330895121_Fog_vs_Cloud_Computing_Should_I_Stay_or_Should_I_Go","abstract":"In this article, we work toward the answer to the question “is it worth processing a data stream on the device that collected it or should we send it somewhere else?”. As it is often the case in computer science, the response is “it depends”. To find out the cases where it is more profitable to stay in the device (which is part of the fog) or to go to a different one (for example, a device in the cloud), we propose two models that intend to help the user evaluate the cost of performing a certain computation on the fog or sending all the data to be handled by the cloud. In our generic mathematical model, the user can define a cost type (e.g., number of instructions, execution time, energy consumption) and plug in values to analyze test cases. As filters have a very important role in the future of the Internet of Things and can be implemented as lightweight programs capable of running on resource-constrained devices, this kind of procedure is the main focus of our study. Furthermore, our visual model guides the user in their decision by aiding the visualization of the proposed linear equations and their slope, which allows them to find if either fog or cloud computing is more profitable for their specific scenario. We validated our models by analyzing four benchmark instances (two applications using two different sets of parameters each) being executed on five datasets. We use execution time and energy consumption as the cost types for this investigation.","authors":["Flávia Pisani","Vanderson Rosario","Edson Borin"],"meta":["February 2019Future Internet 11(2):34","DOI:10.3390/fi11020034"],"references":["326853887_Fog-Assisted_Translation_Towards_Efficient_Software_Emulation_on_Heterogeneous_IoT_Devices","324536376_EMPIOT_An_energy_measurement_platform_for_wireless_IoT_devices","320971096_Beyond_the_Fog_Bringing_Cross-Platform_Code_Execution_to_Constrained_IoT_Devices","302919660_Optimal_Workload_Allocation_in_Fog-Cloud_Computing_Towards_Balanced_Delay_and_Power_Consumption","268983318_CARPAD_A_Scalable_Energy-Efficient_Context_Aware_Distributed_Mobile_Data_Analytics_Platform_for_the_Fog","327407741_Impact_of_Edge_Computing_Paradigm_on_Energy_Consumption_in_IoT","321638078_Multi-objective_Optimization_for_Computation_Offloading_in_Fog_Computing","313470019_Online_Learning_for_Offloading_and_Autoscaling_in_Renewable-Powered_Mobile_Edge_Computing","289742656_Finding_your_way_in_the_fog_Towards_a_comprehensive_definition_of_fog_computing","286243790_Finding_your_Way_in_the_Fog"]}