{"id":"330892543_The_Community_of_Inquiry_Model_Training_Using_the_Cognitive_Apprenticeship_Approach_to_Improve_Students'_Learning_Strategy_in_the_Asynchronous_Discussion_Forum","abstract":"An online discussion forum has the potential to facilitate collaborative learning that improves students’ critical thinking. To explain the collaborative online learning experience, the Community of Inquiry (CoI) model has been proposed by a group of researchers. The model captures an in-depth and meaningful collaborative online learning process as the dynamics of social presence, cognitive presence, and teaching presence. Experts agree that collaborative learning using an online discussion forum requires different skills as compared to face-to-face learning activities. Currently available research on how to develop e-learning skills is still limited. This study aims to propose a training strategy of the CoI model by using the cognitive apprenticeship approach. The training is integrated with Linear Algebra classes involving 89 first-year Computer Science students at a large public university in Indonesia. The students were divided into two classes, each designed with a different learning experience. The metacognitive ability of students with the CoI training increased. They were exposed to the different learning strategies of other participants, which encouraged them to change their own strategy if needed. There was no significant change of metacognitive ability in the students who did not participate in the training. The average scores of the midterm and final exams of both classes did not differ significantly; however, students with the CoI training gave better answers to open questions that required them to argue their answer.","authors":["Kasiyah Junus","Heru Suhartanto","B. Sri Hartati R-Suradujono","Harry B. Santoso"],"meta":["January 2019Journal of Educators Online 16(1)","DOI:10.9743/jeo.2019.16.1.7"],"references":["303401569_Community_of_Inquiry_applied_meta-analysis_Research_and_community","287938340_Critical_Thinking_in_Asynchronous_Online_Discussion_An_Investigation_of_Student_Facilitation_Techniques","327820323_The_Community_of_Inquiry_Model_Training_for_Beginners_Patterns_of_Interaction_and_Student_Learning_Strategies","325018330_Assessing_students'_e-learning_competencies_in_online_learning_environment","313554152_Learning_presence_as_a_moderator_in_the_community_of_inquiry_model","312341574_The_cognitive_apprenticeship_model_in_educational_practice","305377322_What_do_infit_and_outfit_mean-square_and_standardized_mean","303270804_Cognitive_apprenticeship_Teaching_the_crafts_of_reading_writing_mathematics","291101669_Cognitive_Apprenticeship","281605236_Balancing_pedagogy_student_readiness_and_accessibility_A_case_study_in_collaborative_online_course_development"]}