{"id":"330861887_Resource-rational_analysis_Understanding_human_cognition_as_the_optimal_use_of_limited_computational_resources","abstract":"Modeling human cognition is challenging because there are infinitely many mechanisms that can generate any given observation. Some researchers address this by constraining the hypothesis space through assumptions about what the human mind can and cannot do, while others constrain it through principles of rationality and adaptation. Recent work in economics, psychology, neuroscience, and linguistics has begun to integrate both approaches by augmenting rational models with cognitive constraints, incorporating rational principles into cognitive architectures, and applying optimality principles to understanding neural representations. We identify the rational use of limited resources as a unifying principle underlying these diverse approaches, expressing it in a new cognitive modeling paradigm called resource-rational analysis . The integration of rational principles with realistic cognitive constraints makes resource-rational analysis a promising framework for reverse-engineering cognitive mechanisms and representations. It has already shed new light on the debate about human rationality and can be leveraged to revisit classic questions of cognitive psychology within a principled computational framework. We demonstrate that resource-rational models can reconcile the mind's most impressive cognitive skills with people's ostensive irrationality. Resource-rational analysis also provides a new way to connect psychological theory more deeply with artificial intelligence, economics, neuroscience, and linguistics.","authors":["Falk Lieder","Thomas L. Griffiths"],"meta":["February 2019Behavioral and Brain Sciences 43:1-85","DOI:10.1017/S0140525X1900061X"],"references":["345723661_Amortized_Hypothesis_Generation","345680833_Remembrance_of_Inferences_Past","326485879_Efficient_compression_in_color_naming_and_its_evolution","326073111_Efficient_coding_of_subjective_value","324767218_Rational_metareasoning_and_the_plasticity_of_cognitive_control","322818891_Over-representation_of_Extreme_Events_in_Decision-Making_A_Rational_Metacognitive_Account","356310222_Risk_Aversion_as_a_Perceptual_Bias","329348774_Speed_Accuracy_and_the_Optimal_Timing_of_Choices","328978995_Decision_by_sampling_implements_efficient_coding_of_psychoeconomic_functions","325672155_Teaching_Bayesian_reasoning_in_less_than_two_hours"]}