{"id":"330896417_Academic_social_networks_Modeling_analysis_mining_and_applications","abstract":"In the fast-growing scholarly big data background, social network technologies have recently aroused widespread attention in academia and industry. The concept of academic social networks is created precisely in the context of scholarly big data, which refers to the complicated academic network formed by academic entities and their relationships. There are a wealth of scholarly big data processing methods to analyze the rich structural types and related information about academic social networks. Nowadays, various academic data can be easily obtained, which makes it easier for us to analyze and study academic social networks. This study investigates the background, the current status, and trends of academic social networks. We first elaborate on the concept of academic social networks and related research background. Secondly, we analyze models based on nodes’ types and timeliness. Thirdly, we review analytical methods, including relevant metrics, network properties, and available academic analysis tools. Furthermore, we sort out some key mining technologies for academic social networks. Finally, we systematically review representative research tasks in this domain from three levels: actor, relationship, and network. In addition, some academic social networking sites are presented. This survey concludes with the current challenges and open issues.","authors":["Xiangjie Kong","Yajie Shi","Shuo Yu","Jiaying Liu"],"meta":["February 2019","DOI:10.1016/j.jnca.2019.01.029","Project: Data-Driven Academic Collaboration Behaviors Analytics"],"references":["324787467_VOPRec_Vector_Representation_Learning_of_Papers_with_Text_Information_and_Structural_Identity_for_Recommendation","323836201_Finding_Rising_Stars_in_Social_Networks","321891283_Vehicular_Social_Networks_A_survey","320138264_A_co-authorship_network-based_method_for_understanding_the_evolution_of_a_research_area_A_case_of_information_systems_research","319118074_Implicit_Multi-Feature_Learning_for_Dynamic_Time_Series_Prediction_of_the_Impact_of_Institutions","345153150_Shifu_Deep_Learning_Based_Advisor-advisee_Relationship_Mining_in_Scholarly_Big_Data","326340402_FaBIO_and_CiTO_Ontologies_for_Describing_Bibliographic_Resources_and_Citations","322826651_Influence_analysis_in_social_networks_A_survey","321247918_An_experimental_study_of_the_small_world_problem","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}