{"id":"330859592_Research_on_Topic_Recognition_of_Network_Sensitive_Information_Based_on_SW-LDA_Model","abstract":"The mining of network sensitive information is of great significance for understanding the social stability of the network. Obtaining the network public opinion of the sensitive information is helpful to master Internet users' attitudes towards the important social events. The related artificial intelligence technology can achieve the topics from the network texts. At present, the current topic recognition model has the low recognition rate for the sensitive information and usually generates some inaccurate topic keywords. In this paper, a topic recognition method of the network sensitive information based on Sensitive word weighted-LDA model (SW-LDA) is proposed. Firstly, the basic sensitive word vocabulary is constructed by manual collection, and the Embedding representation of the word is obtained through the training of a large amount of network corpus based on Word2vec. The semantic similarity between the word embedding is calculated to extend the basic sensitive word vocabulary. Secondly, the extended sensitive word vocabulary is embedded into the LDA model. On the one hand, it can improve the semantic understanding and the recognition ability of LDA for the sensitive topic words, and promote the quality of the generated topic words. On the other hand, it can also improve the relevance of the topic keywords and the related topics, and find more fine-grained keywords. The experimental results show that the Sensitive word weighted-LDA model can effectively improve the topic recognition quantity and quality of the sensitive information. The research is helpful to the development of the artificial intelligence. The generated corpus in the research is meaningful to the research of text classification, clustering and information retrieval and so on.","authors":["Guixian Xu","Xu Wu","Haishen Yao","Fan Li"],"meta":["February 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2897475"],"references":["327291144_CrossRec_Cross-Domain_Recommendations_Based_on_Social_Big_Data_and_Cognitive_Computing","316461781_TempoRec_Temporal-Topic_Based_Recommender_for_Social_Network_Services","308092465_Multivariate_Beta_Mixture_Model_for_Automatic_Identification_of_Topical_Authoritative_Users_in_Community_Question_Answering_Sites","272524309_Fast_incremental_LDA_feature_extraction","262244963_A_biterm_topic_model_for_short_texts","257882504_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","329917767_iBike_Intelligent_public_bicycle_services_assisted_by_data_analytics","325864973_EARS_Emotion-Aware_Recommender_System_Based_on_Hybrid_Information_Fusion","324071524_Advanced_Sentiment_Classification_of_Tibetan_Microblogs_on_Smart_Campuses_Based_on_Multi-Feature_Fusion","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","303802749_Indexing_by_Latent_Semantic_Analysis","301232584_SBTM_Topic_Modeling_over_Short_Texts","285704049_Neural_Probabilistic_Language_Models","284312540_Analysis_of_the_research_subject_of_information_science_based_on_the_keyword","262320646_A_Research_of_Hot_Topic_Detection_through_Microblogging","245569053_Topic_analysis_based_on_LDA_model","221297828_Characterizing_Microblogs_with_Topic_Models","220319974_Latent_Dirichlet_Allocation","220017593_Probabilistic_Latent_Semantic_Indexing"]}