{"id":"330883986_Spam_review_detection_using_spiral_cuckoo_search_clustering_method","abstract":"Nowadays, online reviews play an important role in customer’s decision. Starting from buying a shirt from an e-commerce site to dining in a restaurant, online reviews has become a basis of selection. However, peoples are always in a hustle and bustle since they don’t have time to pay attention to the intrinsic details of products and services, thus the dependency on online reviews have been hiked. Due to reliance on online reviews, some people and organizations pompously generate spam reviews in order to promote or demote the reputation of a person/product/organization. Thus, it is impossible to identify whether a review is a spam or a ham by the naked eye and it is also impractical to classify all the reviews manually. Therefore, a spiral cuckoo search based clustering method has been introduced to discover spam reviews. The proposed method uses the strength of cuckoo search and Fermat spiral to resolve the convergence issue of cuckoo search method. The efficiency of the proposed method has been tested on four spam datasets and one Twitter spammer dataset. To validate the efficacy of proposed clustering method it is compared with six metaheuristics clustering methods namely; particle swarm optimization, differential evolution, genetic algorithm, cuckoo search, K-means, and improved cuckoo search. The experimental results and statistical analysis validate that the proposed method outruns the existing methods.","authors":["Avinash Pandey","Dharmveer Singh Rajpoot"],"meta":["June 2019Evolutionary Intelligence 12(1)","DOI:10.1007/s12065-019-00204-x"],"references":["326908156_Detection_of_spam-posting_accounts_on_Twitter","322363812_Discovering_spammer_communities_in_twitter","322347385_Web-Spam_Features_Selection_Using_CFS-PSO","322158406_Intelligent_Twitter_Spam_Detection_A_Hybrid_Approach","351411780_Importance_of_Online_Product_Reviews_from_a_Consumer's_Perspective","347567878_SURVEY_ON_REVIEW_SPAM_DETECTION","326255716_Spam_Review_Detection_Using_Ensemble_Machine_Learning","325760099_A_Unified_Framework_for_Detecting_Author_Spamicity_by_Modeling_Review_Deviation","324285903_Introduction_to_Probability_and_Statistics","323059675_Hybrid_step_size_based_cuckoo_search","321693172_Web_Spam_Classification_Method_Based_on_Deep_Belief_Networks","321287836_Twitter_spam_detection_Survey_of_new_approaches_and_comparative_study","321083043_Detecting_Users_Who_Share_Extremist_Content_on_Twitter","321068302_Case_Study_of_Fake_Web_Reviews","320819092_Ensemble_based_spam_detection_in_social_IoT_using_probabilistic_data_structures"]}