{"id":"330935962_A_review_on_lung_boundary_detection_in_chest_X-rays_rule-based_to_data-driven_approaches","abstract":"open access link : https://rdcu.be/blOkb \n\nChest radiography is the most common imaging modality for pulmonary diseases. Due to its wide usage, there is a rich literature addressing automated detection of cardiopulmonary diseases in digital chest X-rays (CXRs). One of the essential steps for automated analysis of CXRs is localizing the relevant region of interest, i.e., isolating lung region from other less relevant parts, for applying decision-making algorithms there. This article provides an overview of the recent literature on lung boundary detection in CXR images.\n\nMethods\nWe review the leading lung segmentation algorithms proposed in period 2006–2017. First, we present a review of articles for posterior–anterior view CXRs. Then, we mention studies which operate on lateral views. We pay particular attention to works that focus their efforts on deformed lungs and pediatric cases. We also highlight the radiographic measures extracted from lung boundary and their use in automatically detecting cardiopulmonary abnormalities. Finally, we identify challenges in dataset curation and expert delineation process, and we listed publicly available CXR datasets.\n\nResults\n(1) We classified algorithms into four categories: rule-based, pixel classification-based, model-based, hybrid, and deep learning-based algorithms. Based on the reviewed articles, hybrid methods and deep learning-based methods surpass the algorithms in other classes and have segmentation performance as good as inter-observer performance. However, they require long training process and pose high computational complexity. (2) We found that most of the algorithms in the literature are evaluated on posterior–anterior view adult CXRs with a healthy lung anatomy appearance without considering challenges in abnormal CXRs. (3) We also found that there are limited studies for pediatric CXRs. The lung appearance in pediatrics, especially in infant cases, deviates from adult lung appearance due to the pediatric development stages. Moreover, pediatric CXRs are noisier than adult CXRs due to interference by other objects, such as someone holding the child’s arms or the child’s body, and irregular body pose. Therefore, lung boundary detection algorithms developed on adult CXRs may not perform accurately in pediatric cases and need additional constraints suitable for pediatric CXR imaging characteristics. (4) We have also stated that one of the main challenges in medical image analysis is accessing the suitable datasets. We listed benchmark CXR datasets for developing and evaluating the lung boundary algorithms. However, the number of CXR images with reference boundaries is limited due to the cumbersome but necessary process of expert boundary delineation.\n\nConclusions\nA reliable computer-aided diagnosis system would need to support a greater variety of lung and background appearance. To our knowledge, algorithms in the literature are evaluated on posterior–anterior view adult CXRs with a healthy lung anatomy appearance, without considering ambiguous lung silhouettes due to pathological deformities, anatomical alterations due to misaligned body positioning, patient’s development stage and gross background noises such as holding hands, jewelry, patient’s head and legs in CXR. Considering all the challenges which are not very well addressed in the literature, developing lung boundary detection algorithms that are robust to such interference remains a challenging task. We believe that a broad review of lung region detection algorithms would be useful for researchers working in the field of automated detection/diagnosis algorithms for lung/heart pathologies in CXRs.","authors":["Sema Candemir","Sameer K Antani"],"meta":["February 2019International Journal of Computer Assisted Radiology and Surgery 14(2):563-576","DOI:10.1007/s11548-019-01917-1"],"references":["328800804_Deep_Learning_for_Grading_Cardiomegaly_Severity_in_Chest_X-Rays_An_Investigation","328170248_Implementing_a_mobile_diagnostic_unit_to_increase_access_to_imaging_and_laboratory_services_in_western_Kenya","323437518_Comparing_deep_learning_models_for_population_screening_using_chest_radiography","322749812_SegNet_A_Deep_Convolutional_Encoder-Decoder_Architecture_for_Image_Segmentation","321199090_Automated_Chest_X-Ray_Screening_Can_Lung_Region_Symmetry_Help_Detect_Pulmonary_Abnormalities","319167281_Assisted_ground_truth_generation_using_interactive_segmentation_on_a_visualization_and_annotation_tool","325107099_Deep_Learning_with_Lung_Segmentation_and_Bone_Shadow_Exclusion_Techniques_for_Chest_X-Ray_Analysis_of_Lung_Cancer","320961220_Circle-like_foreign_element_detection_in_chest_x-rays_using_normalized_cross-correlation_and_unsupervised_clustering","319770355_Generative_Adversarial_Nets","319633774_Accurate_Lung_Segmentation_via_Network-Wise_Training_of_Convolutional_Networks"]}