{"id":"330919040_Almost_event-rate_independent_monitoring","abstract":"A monitoring algorithm is trace-length independent if its space consumption does not depend on the number of events processed. The analysis of many monitoring algorithms has aimed at establishing their trace-length independence. But a monitor’s space consumption can depend on characteristics of the trace other than its size. We put forward the stronger notion of event-rate independence, where a monitor’s space usage does not depend on the event rate, i.e., the number of events in a fixed time unit. This property is critical for monitoring voluminous streams of events with a high arrival rate. We propose a new algorithm for metric temporal logic (MTL) that is almost event-rate independent, where “almost” denotes a logarithmic dependence on the event rate: the algorithm must store the event rate as a number. Afterwards, we investigate more expressive logics. In particular, we extend linear dynamic logic with past operators and metric features. The resulting metric dynamic logic (MDL) offers the quantitative temporal conveniences of MTL while increasing its expressiveness. We show how to modify our MTL algorithm in a modular way, yielding an almost event-rate independent monitor for MDL. Finally, we compare our algorithms with traditional monitoring approaches, providing empirical evidence that almost event-rate independence matters in practice.","authors":["David Basin","Bhargav NAGARAJA Bhatt","Srđan Krstić","Dmitriy Traytel"],"meta":["November 2019Formal Methods in System Design 54(2)","DOI:10.1007/s10703-018-00328-3"],"references":["330232857_First-order_temporal_logic_monitoring_with_BDDs","326952117_DejaVu_A_Monitoring_Tool_for_First-Order_Temporal_Logic","326166719_TeSSLa_runtime_verification_of_non-synchronized_real-time_streams","314217952_Algorithms_for_monitoring_real-time_properties","333478111_Trace-Length_Independent_Runtime_Monitoring_of_Quantitative_Policies","328797226_Striver_Stream_Runtime_Verification_for_Real-Time_Event-Streams_18th_International_Conference_RV_2018_Limassol_Cyprus_November_10-13_2018_Proceedings","323627447_On_the_Expressiveness_and_Monitoring_of_Metric_Temporal_Logic","319489250_Almost_Event-Rate_Independent_Monitoring_of_Metric_Dynamic_Logic","318369747_Montre_A_Tool_for_Monitoring_Timed_Regular_Expressions","315857005_Almost_Event-Rate_Independent_Monitoring_of_Metric_Temporal_Logic","303367517_Montre_A_Tool_for_Monitoring_Timed_Regular_Expressions","311487965_Symbolic_Algorithms_for_Language_Equivalence_and_Kleene_Algebra_with_Tests","308743376_GNU_Parallel_20150322_'Hellwig'","305750181_Parametric_Linear_Dynamic_Logic","304535150_Big_data_The_management_revolution"]}