{"id":"330975389_Quantum_risk_analysis","abstract":"We present a quantum algorithm that analyzes risk more efficiently than Monte Carlo simulations traditionally used on classical computers. We employ quantum amplitude estimation to price securities and evaluate risk measures such as Value at Risk and Conditional Value at Risk on a gate-based quantum computer. Additionally, we show how to implement this algorithm and how to trade-off the convergence rate of the algorithm and the circuit depth. The shortest possible circuit depth—growing polynomially in the number of qubits representing the uncertainty—leads to a convergence rate of O(M−2/3), where M is the number of samples. This is already faster than classical Monte Carlo simulations which converge at a rate of O(M−1/2). If we allow the circuit depth to grow faster, but still polynomially, the convergence rate quickly approaches the optimum of O(M−1). Thus, for slowly increasing circuit depths our algorithm provides a near quadratic speed-up compared to Monte Carlo methods. We demonstrate our algorithm using two toy models. In the first model we use real hardware, such as the IBM Q Experience, to price a Treasury-bill (T-bill) faced by a possible interest rate increase. In the second model, we simulate our algorithm to illustrate how a quantum computer can determine financial risk for a two-asset portfolio made up of government debt with different maturity dates. Both models confirm the improved convergence rate over Monte Carlo methods. Using simulations, we also evaluate the impact of cross-talk and energy relaxation errors.","authors":["Stefan Woerner","Daniel J. Egger"],"meta":["December 2019npj Quantum Information 5(1)","DOI:10.1038/s41534-019-0130-6"],"references":["331307552_Quantum_computing_for_finance_Overview_and_prospects","324536290_Entanglement_Generation_in_Superconducting_Qubits_Using_Holonomic_Operations","320196037_Quantum_optimization_using_variational_algorithms_on_near-term_quantum_devices","311067084_Quantum_Machine_Learning","285270906_Quantum_Algorithms_and_Circuits_for_Scientific_Computing","275588201_Quantum_speedup_of_Monte_Carlo_methods_Table_1","330097783_Quantum_analog-digital_conversion","327124324_Quantum_computational_finance_Monte_Carlo_pricing_of_financial_derivatives","321540030_Turbulent_Mixing_Simulation_via_a_Quantum_Algorithm","301840114_Procedure_for_systematically_tuning_up_crosstalk_in_the_cross_resonance_gate"]}