{"id":"330902294_Episodic_Memory_Assessment_and_Remediation_in_Normal_and_Pathological_Aging_Using_Virtual_Reality_A_Mini_Review","abstract":"Life expectancy is constantly increasing in developed countries. Unfortunately, a longer life does not always correspond to a healthier life, as even normal aging is associated with cognitive decline and increased risk factors for neurodegenerative diseases. Episodic memory (EM) is one of the most vulnerable cognitive functions in aging, and its decline is the hallmark of typical Alzheimer's disease. This memory system is defined as the ability to acquire and recollect personally experienced episodes associated with a specific affective, spatial, and temporal context. However, most of the neuropsychological and experimental tasks currently employed to assess EM consist in learning simple material (e.g., list of words) in highly stereotyped contexts. In the same vein, classical paper-and-pencil or numeric remediation tools have shown their limitations in the transfer of acquired skills to daily life. Virtual reality (VR), thanks to its immersive properties, and the possibility of delivering realistic and complex scenarios, seems a promising tool to address the limitations of the assessment and remediation of EM. Here, we review existing studies employing VR in normal and pathological aging to assess and reeducate EM. Overall, we show that VR has been mainly used via non-immersive systems. Further studies should, therefore, test the impact of different degrees of immersion. Moreover, there is a lack of VR remediation tools specifically targeting EM. We propose that future studies should fill this gap, addressing in particular the adaptivity of VR remediation protocols.","authors":["Valentina La Corte","Marco Sperduti","Kouloud Abichou","Pascale Piolino"],"meta":["February 2019Frontiers in Psychology 10","DOI:10.3389/fpsyg.2019.00173","Project: Toward an Ecological Approach to Human Memory"],"references":["328759742_The_Past_Present_and_Future_of_Virtual_and_Augmented_Reality_Research_A_Network_and_Cluster_Analysis_of_the_Literature","325425474_Use_of_immersive_virtual_reality_to_assess_episodic_memory_A_validation_study_in_older_adults","325307156_Neural_correlates_of_episodic_memory_in_the_Memento_cohort","325074334_Viewing_one's_body_during_encoding_boosts_episodic_memory","323980993_The_Virtual_Shop_A_new_Immersive_Virtual_Reality_Environment_and_Scenario_for_the_Assessment_of_Everyday_Memory","321918324_How_virtual_embodiment_affects_episodic_memory_functioning_a_proof-of-concept_study","321857120_Virtual_reality_in_cognitive_interventions_for_older_adults_and_its_application_in_the_GRADYS_training_softwareWirtualna_rzeczywistosc_w_interwencjach_poznawczych_skierowanych_do_osob_starszych_oraz_j","332940258_Embodied_Cognition","326598315_Cognitive_Stimulation_of_Elderly_Individuals_with_Instrumental_Virtual_Reality-Based_Activities_of_Daily_Life_Pre-Post_Treatment_Study","325634127_Ecologically_Relevant_Episodic_Memory_Assessment_Indicates_an_Attenuated_Age-Related_Memory_Loss_-_A_Virtual_Reality_Study"]}