{"id":"330976368_Combining_RSS-SVM_with_genetic_algorithm_for_Arabic_opinions_analysis","abstract":"Due to the large-scale users of the Arabic language, researchers are drawn to the Arabic sentiment analysis and precisely the classification areas. Thus, the most accurate classification technique used in this area is the support vector machine (SVM) classifier. This last, is able to increase the rates in opinion mining but with use of very small number of features. Hence, reducing feature’s vector can alternate the system performance by deleting some pertinent ones. To overcome these two constraints, our idea is to use random sub space (RSS) algorithm to generate several features vectors with limited size; and to replace the decision tree base classifier of RSS with SVM. Later, another proposition was implemented in order to enhance the previous algorithm by using the genetic algorithm as subset features generator based on correlation criteria to eliminate the random choice used by RSS and to prevent the use of incoherent features subsets.","authors":["Amel Ziani","Nabiha Azizi","Djamel Zenakhra","Soraya Cheriguene"],"meta":["January 2019International Journal of Intelligent Systems Technologies and Applications 18(1/2):152","DOI:10.1504/IJISTA.2019.097754"],"references":["339982951_The_Role_of_Pre-processing_in_Twitter_Sentiment_Analysis","328581496_Different_Feature_Selection_for_Sentiment_Classification_Different_Feature_Selection_for_Sentiment_Classification","313784634_Survey_on_Sentiment_Analysis_A_Comparative_Study","312749006_Survey_on_mining_subjective_data_on_the_web","301649355_A_Survey_on_Sentiment_Analysis_Challenges","324286028_Aspects_of_the_Theory_of_Syntax","321619657_Arabic_Computational_Morphology_Knowledge-based_and_Empirical_Methods","316714492_A_New_Hybrid_Classification_System_for_Subjectivity_Detection","313442779_Minimum_redundancy_feature_selection_from_microarray_gene_expression_data","301405083_A_Joint_Segmentation_and_Classification_Framework_for_Sentiment_Analysis"]}