{"id":"330982251_Adaptive_Dynamic_Network_Slicing_in_LoRa_Networks","abstract":"Knowing the heterogeneity of applications and services that need to be supported in the internet of things (IoT), network slicing came out as a potential solution that virtually isolates 5G networks with various service requirements over a common physical network infrastructure. The latter needs to virtualy isolate traffic that comes from machine services to provide each service with specific QoS guarantees. In this paper, network slicing is investigated in LoRa networks using various slicing strategies as well as different spreading factor distributions. We propose an adaptive dynamic inter-slicing resource reservation algorithm based on a maximum likelihood estimation that avoids resource starvation and prioritizes a slice over another depending on its urgency and reliability. Moreover, a novel intra-slicing strategy is evaluated that maximizes resource allocation efficiency in each slice with regard to its QoS requirements. Simulation results performed in realistic IoT scenarios highlight the utility of our proposition in improving IoT devices QoS and providing isolation between LoRa slices.","authors":["Samir Dawaliby","Abbas Bradai","Yannis Pousset"],"meta":["April 2019Future Generation Computer Systems","DOI:10.1016/j.future.2019.01.042"],"references":["328327848_Poster_A_SDNNFV-Based_IoT_Network_Slicing_Creation_System","345162623_On_the_application_of_LoRa_LPWAN_technology_in_Sailing_Monitoring_System","330584673_Joint_Spreading_Factor_and_Coding_Rate_Assignment_in_LoRaWAN_Networks","327855475_SDN-based_Multi-Protocol_Edge_Switching_for_IoT_Service_Automation","326758128_A_survey_on_emerging_SDN_and_NFV_security_mechanisms_for_IoT_systems","326276605_Adaptive_configuration_of_lora_networks_for_dense_IoT_deployments","326199645_Energy_consumption_modeling_for_communicating_sensors_using_LoRa_technology","325294403_An_adaptive_network_slicing_for_LTE_radio_access_networks","325290202_An_Intelligent_Traffic_Load_Prediction_Based_Adaptive_Channel_Assignment_Algorithm_in_SDN-IoT_A_Deep_Learning_Approach","324468690_Network_Slicing_Technology_in_a_5G_Wearable_Network"]}