{"id":"330967533_Real-Time_Monocular_Visual_Odometry_for_Turbid_and_Dynamic_Underwater_Environments","abstract":"In the context of underwater robotics, the visual degradation induced by the medium properties make difficult the exclusive use of cameras for localization purpose. Hence, many underwater localization methods are based on expensive navigation sensors associated with acoustic positioning. On the other hand, pure visual localization methods have shown great potential in underwater localization but the challenging conditions, such as the presence of turbidity and dynamism, remain complex to tackle. In this paper, we propose a new visual odometry method designed to be robust to these visual perturbations. The proposed algorithm has been assessed on both simulated and real underwater datasets and outperforms state-of-the-art terrestrial visual SLAM methods under many of the most challenging conditions. The main application of this work is the localization of Remotely Operated Vehicles used for underwater archaeological missions, but the developed system can be used in any other applications as long as visual information is available.","authors":["Maxime Ferrera","Julien Moras","Pauline Trouvé","Vincent Creuze"],"meta":["February 2019Sensors 19(3):687","DOI:10.3390/s19030687","Projects: Robotics for underwater archaeologyUnderwater sensing (acoustics and computer vision)"],"references":["328410139_Monocular_Odometry_for_Underwater_Vehicles_with_Online_Estimation_of_the_Scale_Factor","318694580_Underwater_cave_mapping_using_stereo_vision","317672384_AEKF-SLAM_A_new_algorithm_for_robotic_underwater_navigation","313417323_The_Pinax-model_for_accurate_and_efficient_refraction_correction_of_underwater_cameras_in_flat-pane_housings","312120454_SVO_Semidirect_Visual_Odometry_for_Monocular_and_Multicamera_Systems","324142020_AUV_homing_and_docking_for_remote_operations","319770169_LSD-SLAM_large-scale_direct_monocular_SLAM","318203193_Autonomous_aerial_navigation_using_monocular_visual-inertial_fusion_LIN_et_al","313658583_Bundle_adjustment_-_A_modern_synthesis","310751683_Detection_of_interest_points_in_turbid_underwater_images"]}