{"id":"330900887_A_Systematic_Review_of_Perception_System_and_Simulators_for_Autonomous_Vehicles_Research","abstract":"This paper presents a systematic review of the perception systems and simulators for autonomous vehicles (AV). This work has been divided into three parts. In the first part, perception systems are categorized as environment perception systems and positioning estimation systems. The paper presents the physical fundamentals, principle functioning, and electromagnetic spectrum used to operate the most common sensors used in perception systems (ultrasonic, RADAR, LiDAR, cameras, IMU, GNSS, RTK, etc.). Furthermore, their strengths and weaknesses are shown, and the quantification of their features using spider charts will allow proper selection of different sensors depending on 11 features. In the second part, the main elements to be taken into account in the simulation of a perception system of an AV are presented. For this purpose, the paper describes simulators for model-based development, the main game engines that can be used for simulation, simulators from the robotics field, and lastly simulators used specifically for AV. Finally, the current state of regulations that are being applied in different countries around the world on issues concerning the implementation of autonomous vehicles is presented.","authors":["Francisca Rosique","Pedro Javier Navarro Lorente","Carlos Fernandez","Antonio Padilla"],"meta":["February 2019Sensors 19(Perception Sensors for Road Applications):648","DOI:10.3390/s19030648","Project: INTELLIGENT DECISION-MAKING SYSTEM FOR AUTONOMOUS DRIVING IN URBAN SCENARIOS BASED ON BEHAVIORAL LEARNING GUIDELINES"],"references":["330486072_The_Role_of_Simulation_in_Development_and_Testing_of_Autonomous_Vehicles","328765564_CNN-LIDAR_pedestrian_classification_combining_range_and_reflectance_data","325200998_The_Governance_of_Risks_in_Ridesharing_A_Revelatory_Case_from_Singapore","324732654_Comparison_of_Agent-based_Simulation_Frameworks_for_Unmanned_Aerial_Transportation_Applications","324417067_The_CAT_Vehicle_Testbed_A_Simulator_with_Hardware_in_the_Loop_for_Autonomous_Vehicle_Applications","323280345_Cloud_Incubator_Car_A_Reliable_Platform_for_Autonomous_Driving","321048628_PaTAVTT_A_Hardware-in-the-Loop_Scaled_Platform_for_Testing_Autonomous_Vehicle_Trajectory_Tracking","316355806_In-Field_High-Throughput_Phenotyping_of_Cotton_Plant_Height_Using_LiDAR","340524597_Automated_Driving_with_ROS_at_BMW","327282290_Obstacle_Detection_using_a_Time_of_Flight_Range_Camera"]}