{"id":"330919440_Analysis_of_Self-Reported_Walking_for_Transit_in_a_Sprawling_Urban_Metropolitan_Area_in_the_Western_US","abstract":"Walkability is associated with increased levels of physical activity and improved health and sustainability. The sprawling design of many metropolitan areas of the western U.S., such as Las Vegas, influences their walkability. The purpose of this study was to consider sprawl characteristics along with well-known correlates of walkability to determine what factors influence self-reported minutes of active transportation. Residents from four neighborhoods in the Las Vegas Metropolitan Area, targeted for their high and low walkability scores, were surveyed for their perceptions of street-connectivity, residential-density, land-use mix, and retail–floor-area ratio and sprawl characteristics including distance between crosswalks, single-entry-communities, high-speed streets, shade, and access to transit. A Poisson model provided the best estimates for minutes of active transportation and explained 11.28% of the variance. The model that included sprawl characteristics resulted in a better estimate of minutes of active transportation compared to the model without them. The results indicate that increasing walkability in urban areas such as Las Vegas requires an explicit consideration of its sprawl characteristics. Not taking such design characteristics into account may result in the underestimation of the influence of sprawl on active transportation and may result in a missed opportunity to increase walking. Understanding the correlates of walkability at the local level is important in successfully promoting walking as a means to increase active transportation and improve community health and sustainability.","authors":["Courtney Coughenour","Hanns de la Fuente-Mella","Alexander Paz"],"meta":["February 2019Sustainability 11(3):852","DOI:10.3390/su11030852"],"references":["326473940_Effects_of_Leisure-Time_and_Transport-Related_Physical_Activities_on_the_Risk_of_Incident_and_Recurrent_Myocardial_Infarction_and_Interaction_With_Traffic-Related_Air_Pollution_A_Cohort_Study","311469451_A_comparison_of_direct_versus_self-report_measures_for_assessing_physical_activity_in_adults_A_systematic_review","278794844_A_century_of_sprawl_in_the_United_States","322762417_Perceived_Environments_as_Physical_Activity_Correlates_and_Moderators_of_Intervention_in_Five_Studies","321509064_Analysis_of_Urban_Growth_and_Sprawl_from_Remote_Sensing_Data","292800963_Urban_Sprawl_as_a_Risk_Factor_in_Motor_Vehicle_Occupant_and_Pedestrian_Fatalities_Update_and_Refinement","286405916_Analysis_of_satisfaction_of_students_of_the_faculty_of_engineering_of_universidad_de_talca","284937395_Relationship_Between_Urban_Sprawl_and_Physical_Activity_Obesity_and_Morbidity","271593425_A_Study_of_the_Combined_Effects_of_Physical_Activity_and_Air_Pollution_on_Mortality_in_Elderly_Urban_Residents_The_Danish_Diet_Cancer_and_Health_Cohort","270676646_Association_between_neighborhood_walkability_and_GPS-measured_walking_bicycling_and_vehicle_time_in_adolescents"]}