{"id":"330907948_Future_of_scholarly_publishing_and_scholarly_communication_Report_of_the_Expert_Group_to_the_European_Commission","abstract":"The Expert Group on the Future of Scholarly Publishing and Scholarly Communication was set up to support the policy development of the European Commission on Open Science. The Expert Group was asked to assess the current situation with regard to scholarly communication and publishing and to establish general principles for the future. This report analyses the recent past and present states of scholarly communication and publishing. It proposes ten principles through which a vision for scholarly communication is shaped over the next 10-15 years. These principles also serve as a way to examine shortcomings of the current scholarly communication and publishing system. The report then offers recommendations to key actors in the scholarly communication system about the best ways to address these shortcomings. The discussion in the report focuses mainly on journals and articles, although books and monographs are also considered, as well as the significance of new and emerging forms of scholarly communication. The perspective for improvements is researcher-centric, with research contributions considered as a public good. Locating research within society at large, and taking into account the needs and possibilities of those who are not professional researchers – the majority of people – is another fundamental reference point for this report. H. G. Wells’ image of the world brain provides a useful metaphor to sketch the shape of the desired outcome. Scholarly publishing (and, in particular scientific publishing) has deeply changed since the Second World War. With few exceptions, society and association-based publishing have declined in importance, while commercial publishing has become dominant. Then, in the 1970s, the “Science Citation Index”, a bibliographic tool based on citations and designed by Eugene Garfield has led to the development of a journal metric called the Journal Impact Factor (JIF). This metric has contributed to re-organizing the competition among scholarly journals, and has led to a mode of research evaluation based on which journal researchers manage to publish. Finally, the prices of scholarly literature began to rise well beyond the inflation rates observed since the 1980s, and the growth of the scholarly literature, while significant, does not entirely account for a trend that has increasingly burdened universities and research centres. Digitisation (online publishing) also began to transform scholarly publishing in the mid-1990s. Its main consequence was to shift the commercial transactions from buying copies of the literature to negotiating rights of access (licensing). It also led to the practise of bundling journals into “Big Deals”, where libraries buy access to entire collections of journals from publishers. This business model deeply affects the market structure of journals. A system of sharing research outputs has been established across the planet, but it does not reach everyone in an equitable manner. Some innovative features have been added to that output, but much more could be done. Open access is made possible by digitisation. The motives behind its emergence are linked to the desire of making the fullest use of the possibilities opened up by computers and networks. Finding a way to constrain prices was a second motive. The same innovative spirit leading to open access also led to exploring new publishing models with open access as a basis.","authors":["Directorate-General for Research and Innovation (European Commission","Jean-Claude Guédon","United Kingdom Jubb Consulting","Bianca Kramer"],"meta":["January 2019","DOI:10.2777/836532","Affiliation: European Commission"],"references":["323285072_Prestigious_Science_Journals_Struggle_to_Reach_Even_Average_Reliability","323152260_The_state_of_OA_A_large-scale_analysis_of_the_prevalence_and_impact_of_Open_Access_articles","320741987_A_journal_is_a_club_a_new_economic_model_for_scholarly_publishing","320194592_Untangling_academic_publishing_A_history_of_the_relationship_between_commercial_interests_academic_prestige_and_the_circulation_of_research","303620134_Monitoring_the_transition_to_open_access_A_report_for_Universities_UK","303545963_A_Gold-centric_implementation_of_open_access_Hybrid_journals_the_Total_cost_of_publication_and_policy_development_in_the_UK_and_beyond","301799020_The_Republic_vs_The_Collective_Two_Histories_of_Collaboration_and_Competition_in_Modern_Science","288856380_Evaluation_practices_and_effects_of_indicator_use-a_literature_review","331112163_Learning_Through_Citizen_Science_Enhancing_Opportunities_by_Design","315377370_Opening_the_Black_Box_of_Scholarly_Communication_Funding_A_Public_Data_Infrastructure_for_Financial_Flows_in_Academic_Publishing"]}