{"id":"330916660_Following_the_Trail_of_eSports_The_Multidisciplinary_Boom_of_Research_on_the_Competitive_Practice_of_Video_Games","abstract":"Despite eSports' relatively long history, the attention paid by academia to this phenomenon has been much more recent and is still in an embryonic state in all of the views. The scientific production has grown because of the global success associated with the widespread growth of live events and the large following of competitions retransmitted via streaming. This article aims to offer a literature review of the research carried out on eSports to date, based upon a systematic review on the sample of selected research. The results confirm the growing variety of approaches to the issue, but also a clear dominance of computer science perspectives rather than to sport science or game studies. While showing some balance between qualitative and quantitative approaches, the prevalence of theoretical perspectives may be taken as a sign of struggle for consolidation as a field. Finally, a discussion about main matters and an author and institution average profile are also provided.","authors":["José Agustín Carrillo Vera","Juan Miguel Aguado","Salvador Gómez"],"meta":["October 2018International Journal of Gaming and Computer-Mediated Simulations 10(4):42-61","DOI:10.4018/IJGCMS.2018100103","Project: \"Politaitment en el entorno de la posverdad\""],"references":["325156296_Women's_Experiences_in_eSports_Gendered_Differences_in_Peer_and_Spectator_Feedback_During_Competitive_Video_Game_Play","316615487_eSports_as_An_Emerging_Research_Context_at_CHI_Diverse_Perspectives_on_Definitions","297891315_Virtually_Athletes_Where_eSports_Fit_Within_the_Definition_of_Sport","292930986_La_dimension_social_de_los_videojuegos_online_de_las_comunidades_de_jugadores_a_los_e-sports","277340377_On_being_'Systematic'_in_Literature_Reviews_in_IS","328069714_DoingUndoing_Gender_with_the_Girl_Gamer_in_High-Performance_Play","321920796_Metagaming_Playing_Competing_Spectating_Cheating_Trading_Making_and_Breaking_Videogames","291078514_Bibliometric_Analysis_on_E-Sports_in_China","282888241_Korea's_Online_Gaming_Empire","282070862_A_Realm_of_Mere_Representation"]}