{"id":"330943996_Influence_de_la_filiere_d'appartenance_sur_l'acquisition_de_competences_numeriques_d'etudiants_de_premiere_annee_en_lettres_sciences_humaines_et_sociales","abstract":"Objectif : Ce travail s’interroge sur l’influence du cadre de pratique (milieu didactique) sur l’acquisition des compétences numériques d’étudiants candidats au certificat Informatique et Internet de niveau 1 (C2i®1).\nMéthode : Les analyses s’appuient sur les résultats obtenus à la certification et aux épreuves théoriques et pratiques de 3 796 étudiants issus de huit filières disciplinaires d’une université française, au cours de trois sessions de formation rendant compte de trois dispositifs de formation différents (sans formation spécifique, avec une formation disciplinaire ou avec une formation transversale) entre 2005 et 2008.\nRésultats : Les taux de réussite relativement faibles mettent en évidence la difficulté pour les étudiants de concilier compétences théoriques et pratiques, nécessaires à la certification. Sans formation spécifique, les candidats se présentant à la certification sont des candidats sensibilisés aux usages (forts en pratique), mais ayant un manque de connaissances théoriques les pénalisant pour l’obtention du C2i®1. Une formation disciplinaire, basée sur un programme commun mais enseignée au sein des filières d’appartenance des étudiants, produit des effets inverses, les étudiants étant davantage formés à la théorie au détriment de son application pratique. Enfin, un dispositif de formation centralisé et commun à l’ensemble des filières semble apporter une meilleure adéquation théorie-pratique allant dans le sens d’une amélioration du taux de réussite à la certification.\nConclusion : Ce travail met en évidence l’influence du contexte et du dispositif de formation sur l’acquisition des compétences numériques des étudiants. Il contribue ainsi à enrichir les connaissances et réflexions sur la définition d’un milieu didactique propice à l’apprentissage et à la transposition des compétences hors contexte.","authors":["Laurent Jeannin"],"meta":["January 2018","DOI:10.18162/ritpu-2018-v15n3-01"],"references":["286926318_Les_nouveaux_etudiants_d'hier_a_aujourd'hui","275863823_De_l'acces_aux_documents_a_l'institutionnalisation_d'une_culture_participative_en_ligne_a_l'universit","272505180_La_contribution_de_l'usage_des_TIC_a_l'insertion_socioprofessionnelle_du_jeune_libanais_Enquete_sur_leurs_pratiques_et_discours_d'acteurs_du_monde_de_l'entreprise_et_de_l'education","311577890_De_l'inscription_a_un_MOOC_a_la_certification_academique_Le_cas_de_la_collection_de_MOOC_competences_du_numerique_et_C2i_Niveau_1","299433024_La_formation_au_numerique_dans_les_etablissements_d'enseignement_superieur_des_espaces_d'heterogeneite_au_coeur_du_dispositif_C2i","289066558_Construire_des_competences_des_l'ecole","281658146_Metier_d'eleve_metier_d'enseignant_a_l'ere_numerique","266218507_Pour_un_enseignement_de_plus_en_plus_strategique","47362849_Le_curriculum_des_grandes_ecoles_en_France_un_modele_d'analyse_inspire_de_Basil_Bernstein","36380797_Conception_de_dispositifs_et_changement_de_paradigme_en_formation"]}