{"id":"330980336_Gender_differences_in_participation_and_reward_on_Stack_Overflow","abstract":"Programming is a valuable skill in the labor market, making the underrepresentation of women in computing an increasingly important issue. Online question and answer platforms serve a dual purpose in this field: they form a body of knowledge useful as a reference and learning tool, and they provide opportunities for individuals to demonstrate credible, verifiable expertise. Issues, such as male-oriented site design or overrepresentation of men among the site’s elite may therefore compound the issue of women’s underrepresentation in IT. In this paper we audit the differences in behavior and outcomes between men and women on Stack Overflow, the most popular of these Q&A sites. We observe significant differences in how men and women participate in the platform and how successful they are. For example, the average woman has roughly half of the reputation points, the primary measure of success on the site, of the average man. Using an Oaxaca-Blinder decomposition, an econometric technique commonly applied to analyze differences in wages between groups, we find that most of the gap in success between men and women can be explained by differences in their activity on the site and differences in how these activities are rewarded. Specifically, 1) men give more answers than women and 2) are rewarded more for their answers on average, even when controlling for possible confounders such as tenure or buy-in to the site. Women ask more questions and gain more reward per question. We conclude with a hypothetical redesign of the site’s scoring system based on these behavioral differences, cutting the reputation gap in half.","authors":["Anna May","Johannes Wachs","Aniko Hannak"],"meta":["August 2019Empirical Software Engineering 24(1)","DOI:10.1007/s10664-019-09685-x","Project: Social Computing and the Future of Work"],"references":["336681027_Programming_Languages_in_GitHub_A_Visualization_in_Hyperbolic_Plane","328581352_Are_There_Gender_Differences_in_Professional_Self-Promotion_An_Empirical_Case_Study_of_LinkedIn_Profiles_among_Recent_MBA_Graduates","324668283_We_Don't_Do_That_Here_How_Collaborative_Editing_with_Mentors_Improves_Engagement_in_Social_QA_Communities","319244743_Someone_Like_Me_How_Does_Peer_Parity_Influence_Participation_of_Women_on_Stack_Overflow","318976878_Estimates_of_Non-Heterosexual_Prevalence_The_Roles_of_Anonymity_and_Privacy_in_Survey_Methodology","342817112_Racial_discrimination_in_transportation_network_companies","327252722_Anatomy_of_an_Enduring_Gender_Gap_The_Evolution_of_Women's_Participation_in_Computer_Science","323465584_The_Pipeline_of_Online_Participation_Inequalities_The_Case_of_Wikipedia_Editing","321088046_Gender_Disparities_in_Science_Dropout_Productivity_Collaborations_and_Success_of_Male_and_Female_Computer_Scientists","319593047_The_Gender_Wage_Gap_Extent_Trends_and_Explanations"]}