{"id":"330905875_Feature-Rich_GPU-Assisted_Scatterplots_for_Millions_of_Call_Events","abstract":"The contact center industry represents a large proportion of many country’s economies. For example, 4% of the entire United States and UK’s working population is employed in this sector. As in most modern industries, contact centers generate gigabytes of operational data that require analysis to provide insight and to improve efficiency. Visualization is a valuable approach to data analysis, enabling trends and correlations to be discovered, particularly when using scatterplots. We present a feature-rich application that visualizes large call center data sets using scatterplots that support millions of points. The application features a scatterplot matrix to provide an overview of the call center data attributes, animation of call start and end times, and utilizes both the CPU and GPU acceleration for processing and filtering. We illustrate the use of the Open Computing Language (OpenCL) to utilize a commodity graphics card for the fast filtering of fields with multiple attributes. We demonstrate the use of the application with millions of call events from a month’s worth of real-world data and report domain expert feedback from our industry partner.","authors":["Dylan Rees","Richard  C. Roberts","Roberts  S. Laramee","Paul Brookes"],"meta":["February 2019Computers 8(1):12","DOI:10.3390/computers8010012"],"references":["319751969_Real-Time_Rendering_of_Molecular_Dynamics_Simulation_Data_A_Tutorial","318205922_Survey_of_Surveys_SoS_-_Mapping_The_Landscape_of_Survey_Papers_in_Information_Visualization","287995118_The_Elicitation_Interview_Technique_Capturing_People's_Experiences_of_Data_Representations","330421843_A_Survey_of_Information_Visualization_Books_Survey_of_Information_Visualization_Books","323404709_Smart_Brushing_for_Parallel_Coordinates","319326457_Scatterplots_Tasks_Data_and_Designs","305092627_The_OpenCL_specification","303974033_State-of-the-Art_Report_in_Web-based_Visualization","291140162_Call_Center_Operation_Design_Operation_and_Maintenance","281401215_Performance_analysis_and_improvement_of_a_typical_telephone_response_system_of_VA_hospitals"]}