{"id":"330970649_An_ab_initio_definition_of_life_pertaining_to_Astrobiology","abstract":"Many definitions of life have been put forward in the course of time, but none have emerged to entirely encapsulate life. Putting forward an adequate definition is not a simple matter to do, despite many people seeming to believe they have an intuitive understanding of what is meant when it is stated that something is life. However, it is important to define life, because we ourselves, individually and collectively, are life, which entails an importance in itself. Furthermore, humankind's capability to look for life on other planets is steadily becoming a real possibility. But in order to realize that search, a definition of life is required. Progress has been made. Life is a complex, but natural phenomena that emerged and has been maintained under the dual demands of thermodynamics and evolution. Thus, any definition of life must include thermodynamics specifically, as well as evolution generally. A definition of life can be obtained through the application of first principles from physics, chemistry and biology. It must encapsulate the minimal properties that are shared between all life and demonstrate that the interconnected aspects of life are unique for precisely life and that it collectively does things other phenomena do not, as well as describe what life is. Thus, the following ab initio definition can be put forward: Life Terra is a genome-containing, self-sustaining, chemical dissipative system that maintains its localized level of organization at the expense of producing entropy in the environment; which has developed its numerous characteristics through pluripotential Darwinian evolution.","authors":["Ian von Hegner"],"meta":["January 2019","DOI:10.13140/RG.2.2.16009.90722"],"references":["327065850_The_last_universal_common_ancestor_between_ancient_Earth_chemistry_and_the_onset_of_genetics","316985613_Exoplanet_Biosignatures_A_Review_of_Remotely_Detectable_Signs_of_Life","314286700_Is_defining_life_pointless_Operational_definitions_at_the_frontiers_of_Biology","270291368_Analysis_of_Metabolism_in_Dormant_Spores_of_Bacillus_Species_by_31P-NMR_of_Low_Molecular_Weight_Compounds","237044744_Thermodynamic_dissipation_theory_for_the_origin_of_life","308449496_Order_out_of_chaos_man's_dialogue_with_nature","300992490_The_Problem_of_Stages_in_Biopoesis","289979040_A_modern_view_of_entropy","287727409_Principles_of_Biochemistry","238824055_Cool_is_not_enough"]}