{"id":"330968352_Confronting_data_sparsity_to_identify_potential_sources_of_Zika_virus_spillover_infection_among_primates","abstract":"The recent Zika virus (ZIKV) epidemic in the Americas ranks among the largest outbreaks in modern times. Like other mosquito-borne flaviviruses, ZIKV circulates in sylvatic cycles among primates that can serve as reservoirs of spillover infection to humans. Identifying sylvatic reservoirs is critical to mitigating spillover risk, but relevant surveillance and biological data remain limited for this and most other zoonoses. We confronted this data sparsity by combining a machine learning method, Bayesian multi-label learning, with a multiple imputation method on primate traits. The resulting models distinguished flavivirus-positive primates with 82% accuracy and suggest that species posing the greatest spillover risk are also among the best adapted to human habitations. Given pervasive data sparsity describing animal hosts, and the virtual guarantee of data sparsity in scenarios involving novel or emerging zoonoses, we show that\ncomputational methods can be useful in extracting actionable inference from available data to support improved epidemiological response and prevention.","authors":["Barbara Han","Subhabrata Majumdar","Flavio P. Calmon","Benjamin Glicksberg"],"meta":["March 2019Epidemics","DOI:10.1016/j.epidem.2019.01.005"],"references":["320773400_Could_Zika_virus_emerge_in_Mainland_China_Virus_isolation_from_nature_in_Culex_quinquefasciatus_2016","301532553_Mapping_global_environmental_suitability_for_Zika_virus_-_Supplementary_Information_2","221654469_Learning_classifiers_from_only_positive_and_unlabeled_data","215803762_PanTHERIA_a_species-level_database_of_life_history_ecology_and_geography_of_extant_and_recently_extinct_mammals","267439942_Hyperparameter_and_model_selection_for_nonparametric_Bayes_problems_via_Radon-Nikodym_derivatives","246221176_Formalizing_Subjective_Notions_About_the_Effect_of_Nonrespondents_in_Sample_Surveys","38363224_Inference_From_Iterative_Simulation_Using_Multiple_Sequences"]}