{"id":"331068957_Constrained-CNN_Losses_for_Weakly_Supervised_Segmentation","abstract":"Weakly-supervised learning based on, e.g., partially labelled images or image-tags, is currently attracting significant attention in CNN segmentation as it can mitigate the need for full and laborious pixel/voxel annotations. Enforcing high-order (global) inequality constraints on the network output (for instance, to constrain the size of the target region) can leverage unlabeled data, guiding the training process with domain-specific knowledge. Inequality constraints are very flexible because they do not assume exact prior knowledge. However, constrained Lagrangian dual optimization has been largely avoided in deep networks, mainly for computational tractability reasons. To the best of our knowledge, the method of Pathak et al. (2015a) is the only prior work that addresses deep CNNs with linear constraints in weakly supervised segmentation. It uses the constraints to synthesize fully-labeled training masks (proposals) from weak labels, mimicking full supervision and facilitating dual optimization. We propose to introduce a differentiable penalty, which enforces inequality constraints directly in the loss function, avoiding expensive Lagrangian dual iterates and proposal generation. From constrained-optimization perspective, our simple penalty-based approach is not optimal as there is no guarantee that the constraints are satisfied. However, surprisingly, it yields substantially better results than the Lagrangian-based constrained CNNs in Pathak et al. (2015a), while reducing the computational demand for training. By annotating only a small fraction of the pixels, the proposed approach can reach a level of segmentation performance that is comparable to full supervision on three separate tasks. While our experiments focused on basic linear constraints such as the target-region size and image tags, our framework can be easily extended to other non-linear constraints, e.g., invariant shape moments (Klodt and Cremers, 2011) and other region statistics (Lim et al., 2014). Therefore, it has the potential to close the gap between weakly and fully supervised learning in semantic medical image segmentation. Our code is publicly available.","authors":["Hoel Kervadec","Jose Dolz","Meng Tang","Eric Granger"],"meta":["February 2019Medical Image Analysis 54","DOI:10.1016/j.media.2019.02.009","Projects: Regularized Losses for Weakly-supervised CNN SegmentationSemantic segmentation of medical images"],"references":["329747523_Normalized_Cut_Loss_for_Weakly-Supervised_CNN_Segmentation","324387467_Semi-supervised_multi-organ_segmentation_via_multi-planar_co-training","322412623_Conditional_Random_Fields_Meet_Deep_Neural_Networks_for_Semantic_Segmentation_Combining_Probabilistic_Graphical_Models_with_Deep_Learning_for_Structured_Prediction","322058612_Curriculum_Domain_Adaptation_for_Semantic_Segmentation_of_Urban_Scenes","316244066_3D_fully_convolutional_networks_for_subcortical_segmentation_in_MRI_A_large-scale_study","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","320967940_Learning_Random-Walk_Label_Propagation_for_Weakly-Supervised_Semantic_Segmentation","320964499_Simple_Does_It_Weakly_Supervised_Instance_and_Semantic_Segmentation","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","319462786_Semi-supervised_Learning_for_Network-Based_Cardiac_MR_Image_Segmentation"]}