{"id":"331054421_Time_Evolution_of_Underwater_Sensor_Networks_Coverage_and_Connectivity_Using_Physically_Based_Mobility_Model","abstract":"Underwater mobile acoustic sensor networks (UW-ASNs) require the design of new networking protocols due to fundamental differences with terrestrial wireless sensor networks. The performance of these protocols is highly impacted by the mobility of sensors, especially when they are freely floating. In such mobile UW-ASNs, nodes move with the water currents but are constrained by the gravitational weight of the sensor along with the water resistance and the buoyant force. A realistic mobility model that can reflect the physical movement of randomly scattered and freely floating sensor nodes under ocean currents provides clearer understanding of the communication challenges and hence helps conceiving efficient communication protocols. In this paper, we first propose an exhaustive physically inspired mobility model which meticulously captures the dynamics of underwater environments. We, then, study the resulting time evolution of network coverage and connectivity. Our objective is to provide the underwater network research community with a realistic mobility model that could be exploited in conceiving networking communication protocols such as routing, localization, and medium access. Namely, we show that the network mobility effect on coverage and connectivity is more significant in intermediately dense UW-ASNs. Less effect is recorded on the coverage and connectivity for low- and high-density UW-ASNs.","authors":["Fatma Bouabdallah"],"meta":["February 2019Wireless Communications and Mobile Computing 2019(4):1-9","DOI:10.1155/2019/9818931"],"references":["328883546_A_Stateless_Opportunistic_Routing_Protocol_for_Underwater_Sensor_Networks","301868615_On_the_Relationship_between_Transmission_Power_and_Capacity_of_an_Underwater_Acoustic_Communication_Channel","327853229_Collision_Avoidance_Energy_Efficient_Multi-Channel_MAC_Protocol_for_UnderWater_Acoustic_Sensor_Networks","301408693_MPDF_Movement_predicted_data_forwarding_protocol_for_Underwater_Acoustic_Sensor_Networks","294283303_Routing_design_avoiding_energy_holes_in_underwater_acoustic_sensor_networks","290270531_Modeling_Waves_and_Circulation_in_Lake_Pontchartrain_ABSTRACT","286950752_Multiple-rendezvous_multichannel_MAC_protocol_design_for_underwater_sensor_networks","268513844_Localization_for_Wireless_Sensor_and_Actor_Networks_with_Meandering_Mobility","264937814_A_Survey_on_MAC_Protocols_for_Underwater_Wireless_Sensor_Networks","263733883_Game-Theoretic_Topology_Controlfor_Opportunistic_Localizationin_Sparse_Underwater_Sensor_Networks"]}