{"id":"331012943_Le_role_de_la_formation_des_enseignants_dans_l'acquisition_des_competences_par_les_eleves_du_secondaire_1_au_Togo","abstract":"La qualité de l’éducation dépend non seulement des conditions d’enseignement, de supervision, des méthodes et outils d’enseignement, etc. mais aussi de la formation des enseignants qui constitue une composante très importante. De nos jours, la plupart des pays mettent l’accent sur la formation initiale des enseignants, car c’est un facteur déterminant dans l’acquisition des compétences par les apprenants. L’étude est réalisée dans la région éducative Lomé-Golfe au Togo. La population étudiée est composée des enseignants et des élèves. La collecte des données est faite à partir des recherches documentaires, des enquêtes par questionnaires et des observations. Les résultats de l’étude ont révélé que le niveau de qualification de la plupart des enseignants du secondaire I au Togo est faible. Nombreux sont les enseignants qui n’ont suivi que la formation académique et pratiquement pas la formation initiale et qui ne bénéficient pas non plus de la formation continue. En ce qui concerne l’action pédagogique, les méthodes d’enseignement dans les collèges sont passives et caduques, par conséquent, le niveau d’acquisition des compétences par les élèves devient de plus en plus faible.","authors":["Kossi Eli Senayah","Sena Yawo Akakpo-Numado","Tchagnaou Akimou","Ella Ella Djagnikpo"],"meta":["February 2019","Project: Le rôle de la formation des enseignants dans l'acquisition des compétences par les élèves du secondaire 1 au Togo"],"references":["267737283_Les_effets_du_contexte_scolaire_sur_les_acquisitions_des_eleves_effet-ecole_et_effets-classes_en_lecture","242386932_LES_RECHERCHES_SUR_LES_EFFETS-ECOLES_ET_LES_EFFETS-MAITRES","271691205_Le_deroulement_de_la_scolarite_au_college_le_contexte_fait_des_differences","239062370_Toward_a_Knowledge_Base_for_School_Learning","44831975_Peut-on_lutter_contre_l'echec_scolaire","44462082_La_formation_des_enseignants_Gaston_Mialaret"]}