{"id":"331027351_Toward_a_multi-faceted_conception_of_co-production_of_climate_services","abstract":"Increasing numbers of scholars and practitioners appeal to procedural theories of ‘co-production’ as they work to transform climate science into climate services. Most work in this direction theorises co-production as an ‘iterative and interactive’ process between climate service providers and users, with success measured mainly in terms of the usefulness and usability of the information product for the user. But notwithstanding these first important steps, this perspective paper argues that the current study of climate service co-production is too narrowly framed, and fails to properly engage with the broad and rich literature that conceives of co-production processes in a diversity of ways. The authors suggest a fresh look on co-production as a process best examined simultaneously from several complimentary perspectives, with reference to recent work reconceptualising co-production as an eight-sided ‘prism’. Using an illustrative example of climate services developed to predict and visualise future flooding in the municipality of Voss, in Norway, the paper demonstrates how this prism concept of co-production can enable a more comprehensive view on co-production as a multi-faceted phenomenon, improve mutual understanding among actors and, ultimately, help design climate services that are better tailored for climate change responses in particular contexts. Keywords: Climate services, Co-production, Evaluation, Voss","authors":["Scott Bremer","Arjan Wardekker","Suraje Dessai","Stefan Sobolowski"],"meta":["February 2019Climate Services 13:42-50","DOI:10.1016/j.cliser.2019.01.003"],"references":["323857065_The_Dutch_adaptation_web_portal_seven_lessons_learnt_from_a_co-production_point_of_view","319421413_Spatially_enabling_the_Global_Framework_for_Climate_Services_Reviewing_geospatial_solutions_to_efficiently_share_and_integrate_climate_data_information","318698589_Mini-me_Why_do_climate_scientists'_misunderstand_users_and_their_needs","317565428_Conditions_for_a_market_uptake_of_climate_services_for_adaptation_in_France","317564098_Stakeholder_involvement_in_strategic_adaptation_planning_Transdisciplinarity_and_co-production_at_stake","313480549_Have_we_given_up_too_much_On_yielding_climate_representation_to_experts","322903267_Surveying_Climate_Services_What_Can_We_Learn_from_a_Bird's-Eye_View","319431235_Improving_the_use_of_climate_information_in_decision-making","318572993_Co-production_in_climate_change_research_reviewing_different_perspectives","318140520_Local_knowledge_in_climate_adaptation_research_moving_knowledge_frameworks_from_extraction_to_co-production_Local_knowledge_in_climate_adaptation_research"]}