{"id":"331047437_Boosting_Decision_Stumps_for_Dynamic_Feature_Selection_on_Data_Streams","abstract":"Feature selection targets the identification of which features of a dataset are relevant to the learning task. It is also widely known and used to improve computation times, reduce computation requirements, and to decrease the impact of the curse of dimensionality and enhancing the generalization rates of classifiers. In data streams, classifiers shall benefit from all the items above, but more importantly, from the fact that the relevant subset of features may drift over time. In this paper, we propose a novel dynamic feature selection method for data streams called Adaptive Boosting for Feature Selection (ABFS). ABFS chains decision stumps and drift detectors, and as a result, identifies which features are relevant to the learning task as the stream progresses with reasonable success. In addition to our proposed algorithm, we bring feature selection-specific metrics from batch learning to streaming scenarios. Next, we evaluate ABFS according to these metrics in both synthetic and real-world scenarios. As a result, ABFS improves the classification rates of different types of learners and eventually enhances computational re","authors":["Jean Paul Barddal","Fabrício Enembreck","Heitor Murilo Gomes","Albert Bifet"],"meta":["February 2019Information Systems 83","DOI:10.1016/j.is.2019.02.003","Project: Dynamic Feature Selection for Data Streams"],"references":["317579226_Adaptive_random_forests_for_evolving_data_stream_classification","305083748_Advancing_feature_selection_research","305077794_A_Survey_on_Feature_Drift_Adaptation_Definition_Benchmark_Challenges_and_Future_Directions","340771713_Learning_in_the_Presence_of_Concept_Drift_and_Hidden_Contexts","326028747_A_simple_multi-class_boosting_framework_with_theoretical_guarantees_and_empirical_proficiency","317607823_Feature_ranking_in_hoeffding_algorithms_for_regression","314152976_Gradient_Boosting_on_Stochastic_Data_Streams","313524724_Database_mining_A_performance_perspective","308124967_Online_Bagging_and_Boosting_for_Imbalanced_Data_Streams","303166622_On_evaluating_stream_learning_algorithms"]}