{"id":"331040697_Design_of_an_Open_Platform_for_Multi-Disciplinary_Approach_in_Project-Based_Learning_of_an_EPICS_Class","abstract":"Nowadays, global engineers need to be equipped with professional skills and knowledge to solve 21st century problems. The educational program, created in digital learning rooms of the Higher Engineering Education Alliance Program (HEEAP) program supported by Arizona State University, became a pioneer in teaching learners to work within the community. First, the combination of a novel instructional strategy and an integrated education in which project-based approach is employed to apply the technical knowledge. During this, students in mechatronics, computer science, and mechanics must collaborate with peers from industrial systems engineering. Second, in this paper, the design of an open structure connecting multi-disciplinary major is illustrated with a new teaching approach. It is proved to be better by combining specialized understandings of various types in a wide range of applications. From this basis support, participants could implement additional components quickly while keeping the cost low, making the products feasible and user-friendly. Last but not least, students are facilitated with a free library that helps to control simply despite lacking experience in robotics or automation. Several examples show that students are capable of developing things by themselves on open design. In brief, this platform might be an excellent tool to teach and visualize the practical scenario in a multi-disciplinary field.","authors":["Ha Quang Thinh Ngo","Mai-Ha Phan"],"meta":["February 2019Electronics 8(2):200","DOI:10.3390/electronics8020200"],"references":["338659739_Design_and_Development_of_a_Low-Cost_Open-Source_Robotics_Education_Platform","329593624_PiBot_An_Open_Low-Cost_Robotic_Platform_with_Camera_for_STEM_Education","325511393_University_Social_Responsibility_towards_Engineering_Undergraduates_The_Effect_of_Methodology_on_a_Service-Learning_Experience","324162489_High_School_Students'_Views_on_the_PBL_Activities_Supported_via_Flipped_Classroom_and_LEGO_Practices","321896555_HeRo_An_open_platform_for_robotics_research_and_education","324053370_Learning_by_Doing_Reflections_of_the_EPICS_Program","320115519_Experimental_comparison_of_Complementary_filter_and_Kalman_filter_design_for_low-cost_sensor_in_quadcopter","317040299_Agent-based_simulation_of_the_learning_dissemination_on_a_Project-Based_Learning_context_considering_the_human_aspects","316945858_Design_and_implementation_of_high_performance_motion_controller_for_2-D_delta_robot","314038654_Introducing_Logistics_Systems"]}