{"id":"331097271_Shaping_the_Future_of_the_Fourth_Industrial_Revolution","abstract":"The Fourth Industrial Revolution is changing everything - from the way we relate to each other, to the work we do, the way our economies work, and what it means to be human. We cannot let the brave new world that technology is currently creating simply emerge. All of us need to help shape the future we want to live in. But what do we need to know and do to achieve this?\n\nIn Shaping the Fourth Industrial Revolution, Klaus Schwab and Nicholas Davis explore how people from all backgrounds and sectors can influence the way that technology transforms our world. Drawing on contributions by more than 200 of the world's leading technology, economic and sociological experts to present a practical guide for citizens, business leaders, social influencers and policy-makers this book outlines the most important dynamics of the technology revolution, highlights important stakeholders that are often overlooked in our discussion of the latest scientific breakthroughs, and explores 12 different technology areas central to the future of humanity.\n\nEmerging technologies are not predetermined forces out of our control, nor are they simple tools with known impacts and consequences. The exciting capabilities provided by artificial intelligence, distributed ledger systems and cryptocurrencies, advanced materials and biotechnologies are already transforming society. The actions we take today - and those we don't - will quickly become embedded in ever-more powerful technologies that surround us and will, very soon, become an integral part of us.\n\nBy connecting the dots across a range of often-misunderstood technologies, and by exploring the practical steps that individuals, businesses and governments can take, Shaping the Fourth Industrial Revolution helps equip readers to shape a truly desirable future at a time of great uncertainty and change.","authors":["Nicholas Davis","Klaus Schwab"],"meta":["November 2018","Publisher: Portfolio PenguinISBN: 9780241366370"],"references":[]}