{"id":"331058911_Digital_Mammography_in_Breast_Cancer_Additive_Value_of_Radiomics_of_Breast_Parenchyma","abstract":"Background Previous studies have suggested that breast parenchymal texture features may reflect the biologic risk factors associated with breast cancer development. Therefore, combining the characteristics of normal parenchyma from the contralateral breast with radiomic features of breast tumors may improve the accuracy of digital mammography in the diagnosis of breast cancer. Purpose To determine whether the addition of radiomic analysis of contralateral breast parenchyma to the characterization of breast lesions with digital mammography improves lesion classification over that with radiomic tumor features alone. Materials and Methods This HIPAA-compliant, retrospective study included 182 patients (age range, 25-90 years; mean age, 55.9 years ± 14.9) who underwent mammography between June 2002 and July 2009. There were 106 malignant and 76 benign lesions. Automatic lesion segmentation and radiomic analysis were performed for each breast lesion. Radiomic texture analysis was applied in the normal regions of interest in the contralateral breast parenchyma to assess the mammographic parenchymal patterns. The classification performance of both individual features and the output from a Bayesian artificial neural network classifier was evaluated with the leave-one-patient-out method by using the area under the receiver operating characteristic curve (AUC) as the figure of merit in the task of differentiating between malignant and benign lesions. Results The performance of the combined lesion and parenchyma classifier in the differentiation between malignant and benign mammographic lesions was better than that with the lesion features alone (AUC = 0.84 ± 0.03 vs 0.79 ± 0.03, respectively; P = .047). Overall, six radiomic features-spiculation, margin sharpness, size, circularity from the tumor feature set, and skewness and power law beta from the parenchymal feature set-were selected more than 50% of the time during the feature selection process on the combined feature set. Conclusion Combining quantitative radiomic data from tumors with contralateral parenchyma characterizations may improve diagnostic accuracy for breast cancer. © RSNA, 2019 Online supplemental material is available for this article. See also the editorial by Shaffer in this issue.","authors":["Hui Li","Kayla Mendel","Li Lan","Deepa Sheth"],"meta":["February 2019Radiology 291(1):181113","DOI:10.1148/radiol.2019181113"],"references":["308399223_Beyond_breast_density_A_review_on_the_advancing_role_of_parenchymal_texture_analysis_in_breast_cancer_risk_assessment","269940104_Relationships_between_computer-extracted_mammographic_texture_pattern_features_and_BRCA12_mutation_status_A_cross-sectional_study","279990120_Comparative_analysis_of_image-based_phenotypes_of_mammographic_density_and_parenchymal_patterns_in_distinguishing_between_BRCA12_cases_unilateral_cancer_cases_and_controls","274202844_Neural_Networks_for_Pattern_Recognition","232745613_Stromal_cells_in_tumor_microenvironment_and_breast_cancer","225841601_Mammographic_densities_as_a_marker_of_human_breast_cancer_risk_and_their_use_in_chemoprevention","223649488_Unraveling_the_microenvironmental_influences_on_the_normal_mammary_gland_and_breast_cancer","221756340_Evaluating_feature_selection_strategies_for_high_dimensional_small_sample_size_datasets","221748493_Computerized_Analysis_of_Mammographic_Parenchymal_Patterns_on_a_Large_Clinical_Dataset_of_Full-Field_Digital_Mammograms_Robustness_Study_with_Two_High-Risk_Datasets","216300794_A_Simple_Sequentially_Rejective_Multiple_Test_Procedure"]}