{"id":"331085879_Large_teams_develop_and_small_teams_disrupt_science_and_technology","abstract":"One of the most universal trends in science and technology today is the growth of large teams in all areas, as solitary researchers and small teams diminish in prevalence1–3. Increases in team size have been attributed to the specialization of scientific activities³, improvements in communication technology4,5, or the complexity of modern problems that require interdisciplinary solutions6–8. This shift in team size raises the question of whether and how the character of the science and technology produced by large teams differs from that of small teams. Here we analyse more than 65 million papers, patents and software products that span the period 1954–2014, and demonstrate that across this period smaller teams have tended to disrupt science and technology with new ideas and opportunities, whereas larger teams have tended to develop existing ones. Work from larger teams builds on more-recent and popular developments, and attention to their work comes immediately. By contrast, contributions by smaller teams search more deeply into the past, are viewed as disruptive to science and technology and succeed further into the future—if at all. Observed differences between small and large teams are magnified for higher-impact work, with small teams known for disruptive work and large teams for developing work. Differences in topic and research design account for a small part of the relationship between team size and disruption; most of the effect occurs at the level of the individual, as people move between smaller and larger teams. These results demonstrate that both small and large teams are essential to a flourishing ecology of science and technology, and suggest that, to achieve this, science policies should aim to support a diversity of team sizes.","authors":["Lingfei Wu","Dashun Wang","James A. Evans"],"meta":["February 2019Nature 566(7744):1","DOI:10.1038/s41586-019-0941-9"],"references":["323712303_Measuring_discursive_influence_across_scholarship","313751049_The_Function_of_Measurement_in_Modern_Physical_Science","306025253_Open_Content_Linus'_Law_and_Neutral_Point_of_View","303470594_From_Solo_Investigator_to_Team_Scientist_Trends_in_the_Practice_and_Study_of_Research_Collaboration","299374576_A_Dynamic_Network_Measure_of_Technological_Change","284799490_Selforganised_criticality_An_explanation_of_1f_noise","284389044_Exploration_and_Exploitation_in_Organizational_Learning","284238591_Quantentheorie_des_idealen_Gases","280685184_The_Burden_of_Knowledge_and_the_Death_of_the_Renaissance_Man_Is_Innovation_Getting_Harder","277334799_Defining_and_identifying_Sleeping_Beauties_in_science","271728518_Cross-disciplinary_research_What_configurations_of_fields_of_science_are_found_in_grant_proposals_today","263856041_Understanding_the_group_dynamics_and_success_of_teams","264390669_Why_Two_Heads_Apart_Are_Better_Than_Two_Heads_Together_Multiple_Mechanisms_Underlie_the_Collaborative_Inhibition_Effect_in_Memory","262582475_Undemocracy_Inequalities_in_science","262416109_Distributed_Representations_of_Sentences_and_Documents"]}