{"id":"331094810_Systematic_Composition_of_Independent_Language_Features","abstract":"Systematic reuse is crucial to efficiently engineer and deploy software languages to software experts and domain experts alike. But “software languages are software too” and hence their engineering, customization, and reuse are subject to similar challenges. To this effect, we propose an approach for composing independent, grammar-based language syntax modules in a structured way that realizes a separation of concerns among the participants in the life cycle of the languages. We present a refined concept of systematic and controlled syntactic variability of extensible software language product lines through identification of syntax variation points and derivation of variants from independently developed features. This facilitates reuse of software languages and reduces the efforts of engineering and customizing languages for specific domains. We realized our concept with the MontiCore language workbench and assessed it through a case study on architecture description languages. Ultimately, systematic and controlled software language reuse reduces the effort of software language engineering and fosters the applicability of software languages.","authors":["Arvid Butting","Robert Eikermann","Oliver Kautz","Bernhard Rumpe"],"meta":["February 2019Journal of Systems and Software 152","DOI:10.1016/j.jss.2019.02.026","Project: Collaborative Reactive Systems (CrESt)"],"references":["328508334_Modular_language_composition_for_the_masses","327786515_Modeling_language_variability_with_reusable_language_components","327265621_Software_Language_Engineering_in_the_Large_Towards_Composing_and_Deriving_Languages","322871008_Retrofitting_Type-safe_Interfaces_into_Template-based_Code_Generators","322589044_Controlled_and_Extensible_Variability_of_Concrete_and_Abstract_Syntax_with_Independent_Language_Features","320971295_A_Systematic_Mapping_Study_on_Modeling_for_Industry_40","320971188_Revisiting_Visitors_for_Modular_Extension_of_Executable_DSMLs","328505358_Deriving_fluent_internal_domain-specific_languages_from_grammars","320438520_Robust_projectional_editing","320389381_Reliable_and_automatic_composition_of_language_extensions_to_C_the_ableC_extensible_language_framework"]}