{"id":"331046751_Defining_host-pathogen_interactions_employing_an_artificial_intelligence_workflow","abstract":"For image-based infection biology, accurate unbiased quantification of host-pathogen interactions is essential, yet often performed manually or using limited enumeration employing simple image analysis algorithms based on image segmentation. Host protein recruitment to pathogens is often refractory to accurate automated assessment due to its heterogeneous nature. An intuitive intelligent image analysis program to assess host protein recruitment within general cellular pathogen defense is lacking. We present HRMAn (Host Response to Microbe Analysis), an open-source image analysis platform based on machine learning algorithms and deep learning. We show that HRMAn has the capacity to learn phenotypes from the data, without relying on researcher-based assumptions. Using Toxoplasma gondii and Salmonella enterica Typhimurium we demonstrate HRMAn's capacity to recognize, classify and quantify pathogen killing, replication and cellular defense responses. HRMAn thus presents the only intelligent solution operating at human capacity suitable for both single image and high content image analysis.\n\nEditorial note: \nThis article has been through an editorial process in which the authors decide how to respond to the issues raised during peer review. The Reviewing Editor's assessment is that all the issues have been addressed (see decision letter).","authors":["Daniel Fisch","Artur Yakimovich","Barbara Clough","Joseph Wright"],"meta":["February 2019eLife Sciences 8(8)","DOI:10.7554/elife.40560"],"references":["327347975_CDeep3M-Plug-and-Play_cloud-based_deep_learning_for_image_segmentation","327290487_High-content_imaging_assay_to_evaluate_Toxoplasma_gondii_infection_and_proliferation_A_multiparametric_assay_to_screen_new_compounds","326706832_High_throughput_screen_identifies_IFN-I-dependent_inhibitors_of_Toxoplasma_gondii_growth","317102555_Linear_ubiquitination_of_cytosolic_Salmonella_Typhimurium_activates_NF-kappaB_and_restricts_bacterial_proliferation","326066656_Phenotypic_Image_Analysis_Software_Tools_for_Exploring_and_Understanding_Big_Image_Data_from_Cell-Based_Assays","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318984637_Expanding_the_host_cell_ubiquitylation_machinery_targeting_cytosolic_Salmonella","317209410_LUBAC-synthesized_linear_ubiquitin_chains_restrict_cytosol-invading_bacteria_by_activating_autophagy_and_NF-kB","311609041_Deep_Residual_Learning_for_Image_Recognition","310752533_Visualizing_and_understanding_convolutional_networks"]}