{"id":"331142600_A_Novel_Two-Stage_Deep_Learning_Model_for_Efficient_Network_Intrusion_Detection","abstract":"The Network Intrusion Detection System (NIDS) is an important tool for protecting computer networks against threats and malicious attacks. Many techniques have recently been proposed, however, these techniques face significant challenges due to the continuous emergence of new threats that are not recognized by existing detection systems. In this paper, we propose a novel two-stage deep learning (TSDL) model based on a stacked auto-encoder with a soft-max classifier for efficient network intrusion detection. The model comprises two decision stages: an initial stage responsible for classifying network traffic as normal or abnormal using a probability score value. This is then used in the final decision stage as an additional feature for detecting the normal state and other classes of attacks. The proposed model is able to learn useful feature representations from large amounts of unlabeled data and classifies them automatically and efficiently. To evaluate and test the effectiveness of the proposed model, several experiments are conducted on two public datasets: an older benchmark dataset, the KDD99, and a newer one, the UNSW-NB15. Comparative experimental results demonstrate that our proposed model significantly outperforms existing models and methods and achieves high recognition rates, up to 99.996% and 89.134%, for the KDD99 and UNSW-NB15 datasets respectively. We conclude that our model has the potential to serve as a future benchmark for the deep learning and network security research communities.","authors":["Farrukh Aslam Khan","Abdu Gumaei","Abdelouahid Derhab","Amir Hussain"],"meta":["February 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2899721"],"references":["323272069_Guided_Policy_Search_for_Sequential_Multitask_Learning","321902204_Cyberattack_Detection_in_Mobile_Cloud_Computing_A_Deep_Learning_Approach","321133749_Network_Intrusion_Detection_through_Stacking_Dilated_Convolutional_Autoencoders","321069732_Applications_of_Deep_Learning_and_Reinforcement_Learning_to_Biological_Data","327362951_Multi-classification_of_UNSW-NB15_dataset_for_network_anomaly_detection_system","325851869_Ramp_loss_one-class_support_vector_machine_A_robust_and_effective_approach_to_anomaly_detection_problems","323927142_Learning_Latent_Features_With_Infinite_Nonnegative_Binary_Matrix_Trifactorization","322866638_A_Deep_Learning_Approach_to_Network_Intrusion_Detection","320366926_A_Deep_Learning_Approach_for_Intrusion_Detection_Using_Recurrent_Neural_Networks","319486374_Hierarchical_Temporal_Memory_Method_for_Time-series-based_Anomaly_Detection"]}