{"id":"331147550_eTDP_Enhanced_Topology_Discovery_Protocol_for_Software-Defined_Networks","abstract":"Discovering network elements in a dynamic and optimized manner and being able to contend with ever-growing traffic is a key requirement for current networking environments. In Software-Defined Networks (SDN), the controller collects the topology information from the data plane and maintains an abstract view of the entire network, which is crucial for the proper functioning of applications and network services. However, there is still the need for an enhanced protocol for automatic discovery and mechanisms of autoconfiguration of network elements according to new policies and business requirements. To overcome this challenge, this paper presents a novel protocol, that, unlike existing approaches, enables a distributed layer 2 discovery without the need for previous network configurations or controller knowledge of the network. By using this mechanism, the SDN controller can discover the network view without incurring scalability issues, while taking advantage of the shortest control paths toward each switch. Obtained results show that our enhanced protocol is efficient in terms of time and message load over a wide range of generated networks and outperforms state-of-the-art techniques.","authors":["Leonardo Ochoa-Aday","Cristina Cervelló-Pastor","Adriana Fernández-Fernández"],"meta":["February 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2899653","Projects: Adaptive Management of 5G Services to Support Critical Events in Cities\", 5GCity (TEC2016-76795-C6-1-R)Optimized Topology Discovery Protocol for Self-Healing SDN Environments"],"references":["320402300_Efficient_Topology_Discovery_in_Software_Defined_Networks_Revisited","316921280_sOFTDP_Secure_and_Efficient_OpenFlow_Topology_Discovery_Protocol","316643101_Limitations_of_OpenFlow_Topology_Discovery_Protocol","312379919_State_of_the_Art_and_Recent_Research_Advances_in_Software_Defined_Networking","325656185_TEDP_An_Enhanced_Topology_Discovery_Service_for_Software-Defined_Networking","324468425_A_comprehensive_analysis_on_control_plane_deployment_in_SDN_In-band_versus_out-of-band_solutions","323863527_Self-Healing_Topology_Discovery_Protocol_for_Software-Defined_Networks","319127165_An_efficient_topology_discovery_algorithm_for_Software-Defined_Networks","319053686_Limitations_of_openflow_topology_discovery_protocol","318476240_A_Self-Organizing_Distributed_and_In-Band_SDN_Control_Plane"]}