{"id":"331102843_Improving_solutions_by_embedding_larger_subproblems_in_a_D-Wave_quantum_annealer","abstract":"Quantum annealing is a heuristic algorithm that solves combinatorial optimization problems, and D-Wave Systems Inc. has developed hardware implementation of this algorithm. However, in general, we cannot embed all the logical variables of a large-scale problem, since the number of available qubits is limited. In order to handle a large problem, qbsolv has been proposed as a method for partitioning the original large problem into subproblems that are embeddable in the D-Wave quantum annealer, and it then iteratively optimizes the subproblems using the quantum annealer. Multiple logical variables in the subproblem are simultaneously updated in this iterative solver, and using this approach we expect to obtain better solutions than can be obtained by conventional local search algorithms. Although embedding of large subproblems is essential for improving the accuracy of solutions in this scheme, the size of the subproblems are small in qbsolv since the subproblems are basically embedded by using an embedding of a complete graph even for sparse problem graphs. This means that the resource of the D-Wave quantum annealer is not exploited efficiently. In this paper, we propose a fast algorithm for embedding larger subproblems, and we show that better solutions are obtained efficiently by embedding larger subproblems.","authors":["Shuntaro Okada","Masayuki Ohzeki","Masayoshi Terabe","Shinichiro Taguchi"],"meta":["February 2019Scientific Reports 9(1):2098","DOI:10.1038/s41598-018-38388-4"],"references":["323597968_Observation_of_topological_phenomena_in_a_programmable_lattice_of_1800_qubits","321945163_Traffic_Flow_Optimization_Using_a_Quantum_Annealer","321416021_Quantum-Assisted_Learning_of_Hardware-Embedded_Probabilistic_Graphical_Models","319101443_Combinatorial_Optimization_by_Decomposition_on_Hybrid_CPU--non-CPU_Solver_Architectures","316280481_Nonnegativebinary_matrix_factorization_with_a_D-Wave_quantum_annealer","315835538_Optimizing_Adiabatic_Quantum_Program_Compilation_using_a_Graph-Theoretic_Framework","315806992_NonnegativeBinary_matrix_factorization_with_a_D-Wave_quantum_annealer","314107982_Deploying_a_quantum_annealing_processor_to_detect_tree_cover_in_aerial_imagery_of_California","311842097_Identifying_the_minor_set_cover_of_dense_connected_bipartite_graphs_via_random_matching_edge_sets","326399373_Phase_transitions_in_a_programmable_quantum_spin_glass_simulator"]}