{"id":"331134821_Sentido_de_Coherencia_y_Estilos_de_Vida_Saludable_en_Estudiantes_de_una_Universidad_Publica_Venezolana","abstract":"El sentido de coherencia ha resultado ser un recurso que ayuda a enfrentar\neventos estresantes producidos por el riesgo y/o la enfermedad. Las\nevidencias empíricas han demostrado que un alto sentido de coherencia está\nrelacionado con la puesta en práctica de hábitos más saludables en diversas\npoblaciones. Los estudios en torno a la relación entre el sentido de coherencia\ny los estilos de vida saludable son escasamente explorados en población\nuniversitaria. Objetivo: determinar la relación entre el sentido de coherencia\ny los estilos de vida saludables en estudiantes universitarios. Metodología:\nestudio descriptivo, correlacional, de corte transversal. Participaron 861\nestudiantes regulares de una universidad pública de la ciudad de\nBarquisimeto, Venezuela, seleccionados a través de un muestreo no\nprobabilístico de tipo intencional. Para evaluar el sentido de coherencia y los\nestilos de vida saludable fueron aplicadas dos escalas validadas en población\nvenezolana, previo cumplimiento de los principios éticos establecidos para\neste tipo de estudio. Resultados: el sentido de coherencia se relaciona de\nmanera positiva y significativa con el estilo de vida a nivel global (r=0,478;\np<0,001) y en las dimensiones de alimentación (r=0,201; p>0,001), actividad\nfísica (r=0,293; p>0,001), conductas preventivas (r=0,420; p>0,001), sueño\n(r=0,426; p>0,001), no consumo de drogas ((r=0,252; p>0,001) y chequeo\nmédico (r=0,205; p>0,001). Además, los estilos de vida saludable varían en\nfunción del nivel de sentido de coherencia. Conclusión: estos resultados\nresaltan la importancia de poner en práctica estrategias de promoción y\nprevención de salud que ayuden a incrementar el sentido de coherencia en los\nuniversitarios.\nPalabras Clave: sentido de coherencia, estilos de vida saludable, estudiantes\n(DeCS).\n\nSENSE OF COHERENCE AND HEALTHY LIFESTYLES IN STUDENTS OF\nA VENEZUELAN PUBLIC UNIVERSITY\n\nIntroduction: the sense of coherence has turned out to be a resource that\nhelps to face stressful events produced by the risk and/or disease. Empirical\nevidence has shown that a high sense of coherence is related to the\nimplementation of healthier habits in diverse populations. Studies on the\nrelationship between the sense of coherence and healthy lifestyles are scarcely\nexplored in the university population. Objective: to determine the\nrelationship between the sense of coherence and healthy lifestyles in\nuniversity students. Methodology: descriptive, correlational, cross-sectional\nstudy. 861 regular students of a public university of the city of Barquisimeto,\nVenezuela, selected through a non-probabilistic sampling of intentional type.\nTo assess the sense of coherence and healthy lifestyles, two validated scales\nwere applied in the Venezuelan population, after compliance with the ethical\nprinciples established for this type of study. Results: the sense of coherence is\nrelated in a positive and significant way to the global lifestyle (r= 0.478, p\n<0.001) and in the feeding dimensions (r=0.201; p> 0.001), physical activity\n(r= 0.293, p>0.001), preventive behaviors (r=0.420, p> 0.001), sleep (r=\n0.426, p>0.001), no drug use ((r= 0.252, p> 0.001) and medical check-up (r=\n0.205; p> 0.001) In addition, healthy lifestyles vary according to the level of\nsense of coherence. Conclusion: these results highlight the importance of\nimplementing health promotion and prevention strategies that help increase\nthe sense of coherence in university students.\n\nKey word: sense of coherence, healthy lifestyles, students. (MeSH)","authors":["Arte Y Cuidado Vol","Jesús Manuel Guerrero Alcedo"],"meta":["February 2019","Project: Factores protectores y estilos de vida saludable"],"references":["305296738_Calidad_del_dormir_insomnio_y_rendimiento_academico_en_estudiantes_de_medicina","280955784_Impact_of_Sense_of_Coherence_on_Oral_Health_Behaviors_A_Systematic_Review","278794808_AGENCIA_DE_AUTOCUIDADO_EN_ALUMNOS_DE_NUEVO_INGRESO_EN_LA_UNIDAD_ACADEMICA_MULTIDISCIPLINARIA_ZONA_MEDIA","277658489_Estilos_de_vida_de_estudiantes_universitarios_admitidos_al_pregrado_de_la_carrera_de_medicina_Bogota_2010-2011","260604966_Sense_of_coherence_and_substance_use_Examining_mutual_influences","41805306_Comportamiento_y_salud_de_los_jovenes_universitarios_satisfaccion_con_el_estilo_de_vida","320948397_Estilos_de_vida_en_estudiantes_universitarios","283582550_Estilos_de_vida_saludable_en_estudiantes_de_sexto_ano_de_Medicina_de_la_Facultad_de_Ciencias_Medicas_de_la_Universidad_Nacional_Autonoma_de_Honduras_2011","45503939_Psychosocial_factors_and_health-related_behavior_among_students_from_South-East_Poland","10828269_A_3_year_follow-up_study_of_health_care_students'_sense_of_coherence_and_related_smoking_drinking_and_physical_exercise_factors"]}