{"id":"331103912_Generating_Photographic_Faces_From_the_Sketch_Guided_by_Attribute_Using_GAN","abstract":"From a sketch image or text description, generating a semantic and photographic face image has always been an extremely important issue in computer vision. Sketch images generally contain only simple profile information but not the detail of the face. Therefore, it is difficult to generate facial attributes accurately. In this paper, we treat the sketch to face problem as a face hallucination reconstruction problem. In order to solve this problem, we propose an image translation network by exploiting attributes with generated adversarial network (GAN). And it can significantly contribute to the authenticity of the generated face by supplementing sketch image with the additional facial attribute feature. The generator network is composed of a feature extracting network and a downsampling-upsampling network, both networks use skip-connection to reduce the number of layers without affecting network performance. The discriminator network is designed to examine whether the generated faces contain the desired attributes or not. In the underlying feature extraction phase, our network is different from most attribute-embedded networks, we fuse the sketch images and attributes perceptually. We set the network sub Branch A and B, which receive sketch image and attribute vector in order to extract low-level profile information and highlevel semantic features. Compared with the state-of-the-arts methods of image translation, the performance of the proposed network is excellent.","authors":["Jian Zhao","Xie Xie","Lin Wang","Meng Cao"],"meta":["February 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2899466"],"references":["322221005_Face_Synthesis_from_Visual_Attributes_via_Sketch_using_Conditional_VAEs_and_GANs","322060135_Unpaired_Image-to-Image_Translation_Using_Cycle-Consistent_Adversarial_Networks","320966887_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","322058318_StackGAN_Text_to_Photo-Realistic_Image_Synthesis_with_Stacked_Generative_Adversarial_Networks","322058208_DualGAN_Unsupervised_Dual_Learning_for_Image-to-Image_Translation","320971420_Hallucinating_Very_Low-Resolution_Unaligned_and_Noisy_Face_Images_by_Transformative_Discriminative_Autoencoders","320967385_Attention-Aware_Face_Hallucination_via_Deep_Reinforcement_Learning","320723945_Two-Stream_Multi-Rate_Recurrent_Neural_Network_for_Video-Based_Pedestrian_Re-Identification","319770355_Generative_Adversarial_Nets","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification"]}