{"id":"331177647_Maximum_power_point_tracking_of_the_solar_power_plants_in_shadow_mode_through_artificial_neural_network","abstract":"The use of solar cells despite being free of contamination and unlimited in terms of the amount of energy is considered as a costly way to generate energy. Two main factors may be enumerated as follows. First of all, the amount of sunlight and ambient temperature affected the amount of energy received from sunlight by solar panels, as long as the amount of sunlight changes overnight in line with changing weather conditions and the second one is the low efficiency of the energy conversion. The main reason for the low electrical efficiency is the nonlinear variation of the output voltage and current along with the change of the amount of radiation, the change of the temperature of the operating environment and the change of the electric charge, respectively. To address this concern, the maximum point of the photovoltaic system can be tracked through an appropriate algorithm and pushes the system point to the optimal point. In a word, the key goal of the investigation presented here is to provide an approach that in the high speed and precision of convergence to the maximum power point is well considered. So far, a large number of available methods have been used to increase the efficiency of solar cells. Some of these are associated with problems in the tracking process or they respond slowly. It should be noted that a set of them are depended on the types and structures of solar cells and also their implementation is very complex and costly. Therefore, this study has focused on intelligence-based techniques such as artificial neural networks to solve all the problems mentioned. The investigated outcomes verify the effectiveness of the approach performance proposed.","authors":["Z. Zandi","A. H. Mazinan"],"meta":["February 2019Complex & Intelligent Systems 5(11)","DOI:10.1007/s40747-019-0096-1"],"references":["325085281_Experimental_Investigation_on_Fuzzy_PID_Control_of_Dual_Axis_Turntable_Servo_System","322211045_Super-twisting_sliding_mode_control_approach_with_its_application_to_wind_turbine_systems","320738996_On_transient_stability_of_multi-machine_power_systems_through_Takagi-Sugeno_fuzzy-based_sliding_mode_control_approach","277977061_Highly_efficient_maximum_power_point_tracking_using_DC-DC_coupled_inductor_single-ended_primary_inductance_converter_for_photovoltaic_power_systems","276422065_Double_Integral_Sliding_Mode_MPPT_Control_of_a_Photovoltaic_System","329237508_Wind_and_Solar_Power_Systems_Design_Analysis_and_Operation_Second_Edition","326128032_Maximum_power_point_tracking_using_Hill_Climbing_and_ANFIS_techniques_for_PV_applications_A_review_and_a_novel_hybrid_approach","314113864_Improved_double_integral_sliding_mode_MPPT_controller_based_parameter_estimation_for_a_stand-alone_photovoltaic_system","305730538_Maximum_power_point_tracking_in_photovoltaic_PV_systems_A_review_of_different_approaches","275245432_Analysis_and_enhancement_of_PV_efficiency_with_incremental_conductance_MPPT_technique_under_non-linear_loading_conditions"]}