{"id":"331171107_Computer-Based_Concept_Mapping_as_a_Method_for_Enhancing_the_Effectiveness_of_Concept_Learning_in_Technology-Enhanced_Learning","abstract":"Technology enhanced learning is a wide area that covers all uses of digital technology to support learning and teaching activities. The computer-based concept mapping has shown potential in enhancing meaningful learning in education. Concept mapping is an important tool that is used in the field of education to help students in understanding the basic concepts and the relationships between them. This research proposes a computer-based concept mapping (CBCM) environment combined with Google classroom to help students reduce their misconceptions and to improve their problem solving skills. Furthermore, it examines the effect of CBCM on the sustainability of concept learning according to student views. The participants were first-year engineering students. The study was conducted in a physics class, and a true-experimental design was used. The experimental group students learned with the Google classroom combined with computer-based concept mapping (CBCM), while the concept group students learned with Google classroom and the traditional method. Data were collected from a physics concept test, problem solving inventory, and semi-structured interviews. The research results indicated that teaching in the CBCM environment combined with Google Classroom provides meaningful learning by correcting the misconceptions of the students. Moreover, there was a significant increase in the problem solving skills of the experimental group as compared to the control group. According to the students’ views, it was determined that CBCM enhances the sustainability of concept learning. The results of this study can help educators and researchers to integrate computer-based concept mapping (CBCM) techniques into Google Classroom.","authors":["Gülsüm Aşıksoy"],"meta":["February 2019Sustainability 11(4):1005","DOI:10.3390/su11041005"],"references":["343975475_Comparison_of_the_reliability_and_validity_of_scores_from_two_concept-mapping_techniques","329647979_Academics'_Perceptions_on_Quality_in_Higher_Education_Shaping_Key_Performance_Indicators","328511486_Sustainable_Higher_Education_and_Technology-Enhanced_Learning_TEL","327159823_Social_Networks_Research_for_Sustainable_Smart_Education","326420920_Influence_of_Computer_Assisted_Concept_Mapping_Instructional_Strategy_on_Students_Performance_in_Chemistry","326352066_The_effects_of_mind_games_in_math_and_grammar_courses_on_the_achievements_and_perceived_problem-solving_skills_of_secondary_school_students_The_effects_of_mind_games_in_math_and_grammar","328892240_Chapter_19_Education_Innovation_and_the_Prospect_of_Sustainable_Growth_and_Development","327909091_Effects_of_integrating_a_concept_mapping-based_summarization_strategy_into_flipped_learning_on_students'_reading_performances_and_perceptions_in_Chinese_courses","322881470_Using_Cognitive_Mapping_to_Foster_Deeper_Learning_with_Complex_Problems_in_a_Computer-Based_Environment","320147908_The_Effects_of_a_Collaborative_Computer-based_Concept_Mapping_Strategy_on_Geographic_Science_Performance_in_Junior_High_School_Students"]}