{"id":"331113706_Engaging_Students_in_Open_Source_Establishing_FOSS_Development_at_a_University","abstract":"Open source is widely used for educational purposes in higher education around the world. While many educators use open source resources for teaching, there seems to be few contributions to such projects of students as part of their university courses. In this work we present our experience on establishing open source development from student contributors as part of their university curriculum. Since 2010 more than 300 students from Graz University of Technology have been involved in the presented Catrobat project and have gained knowledge about agile software development as well as several related domains, e.g., project management, marketing, or graphical design. In this paper we provide detailed insights into the project's organization and evaluate in a study how students feel in this setting. As we conclude, bringing open source to university courses is an effective practical approach based on social learning and provides benefits for students and researchers.","authors":["Matthias Müller","Christian Schindler","Wolfgang Slany"],"meta":["January 2019","Conference: Hawaii International Conference on System Sciences 2019 (HICSS)At: Wailea, HI, USA"],"references":["319552273_Training_Software_Engineers_Using_Open-Source_Software_The_Professors'_Perspective","317396112_Open_Source_Project_Collapse_-_Sources_and_Patterns_of_Failure","317381431_Can_FOSS_projects_benefit_from_integrating_Kanban_a_case_study","312483810_How_Best_to_Teach_Global_Software_Engineering_Educators_Are_Divided","314814272_Evolution_patterns_of_open-source_software_systems_and_communities","301465587_Pocket_code_a_scratch-like_integrated_development_environment_for_your_phone","285650432_Open_source_software_in_education","276352679_Scaling_Internationalizing_an_Agile_FOSS_Project_Lessons_Learned","246477753_Innovation_by_User_Communities_Learning_from_Open-Source_Software","243757657_The_Cathedral_and_the_Bazaar"]}