{"id":"331126711_Modern_Education_and_Computer_Science","abstract":"Open Source Software (OSS) provide a number of advantages to Higher Learning Institutions (HLIs) in developing countries, such as Tanzania. This is because they are freely available, free to make copies and free to distribute. Through literature reviewed, it has been observed that OSS usage in HLIs in Tanzania is low due to lack of awareness of OSS designed for academic purposes. This paper presents a study on how to implement a reliable and effective web-based application tool for recommendation of OSS for enhancing awareness of HLIs on existing OSS designed for academic purposes. There are three recommendation algorithms that were employed for filtering the OSS in this study: the content-based, collaborative, and demographic filtering. We used various web technologies for the implementation of application functionalities. The result is the reliable and effective web-based application tool that recommends OSS to individuals in HLIs for enhancing their awareness of OSS designed for academic purposes.","authors":["Ambokile Okey","Anael Sam"],"meta":["February 2019International Journal of Modern Education and Computer Science 11(2):33-41","DOI:10.5815/ijmecs.2019.02.05","Project: A Web-based Application for Recommendation of Open Source Software for Higher Learning Institutions in Tanzania"],"references":["328829856_An_Online_Collaborative_Discussion_Platform_for_Bridging_a_Technological_Reliance_Gap_in_Higher_Learning_Institutions_in_Tanzania","320057944_OPEN_EDUCATIONAL_RESOURCES_UTILIZATION_I_N_TANZANIAN_HIGHER_LEARNING_INSTITUTIONS","313857654_Adoption_of_free_and_open_source_software_using_alternative_educational_framework_in_college_of_applied_sciences","303137189_Comparing_Moodle_and_eFront_for_LMS","241702072_Making_learning_and_Web_20_technologies_work_for_higher_learning_institutions_in_Africa","225188645_New_technologies_for_teaching_and_learning_Challenges_for_higher_learning_institutions_in_developing_countries","329065134_Cross-Domain_Recommendation_Model_based_on_Hybrid_Approach","321521813_Pro_JavaScript_RIA_Techniques","248732392_Essentials_of_System_Analysis_and_Design"]}