{"id":"331179824_How_People_Learn_II_Learners_Contexts_and_Cultures","abstract":"There are many reasons to be curious about the way people learn, and the past several decades have seen an explosion of research that has important implications for individual learning, schooling, workforce training, and policy. In 2000, How People Learn: Brain, Mind, Experience, and School: Expanded Edition was published and its influence has been wide and deep. The report summarized insights on the nature of learning in school-aged children; described principles for the design of effective learning environments; and provided examples of how that could be implemented in the classroom. Since then, researchers have continued to investigate the nature of learning and have generated new findings related to the neurological processes involved in learning, individual and cultural variability related to learning, and educational technologies. In addition to expanding scientific understanding of the mechanisms of learning and how the brain adapts throughout the lifespan, there have been important discoveries about influences on learning, particularly sociocultural factors and the structure of learning environments. How People Learn II: Learners, Contexts, and Cultures provides a much-needed update incorporating insights gained from this research over the past decade. The book expands on the foundation laid out in the 2000 report and takes an in-depth look at the constellation of influences that affect individual learning. How People Learn II will become an indispensable resource to understand learning throughout the lifespan for educators of students and adults. © 2018 by the National Academy of Sciences. All rights reserved.","authors":["Committee on How People Learn II: The Science and Practice of Learning","Board on Behavioral, Cognitive, and Sensory Sciences","Board on Science Education","Division of Behavioral and Social Sciences and Education"],"meta":["October 2018","DOI:10.17226/24783","ISBN: 978-0-309-45964-8"],"references":[]}