{"id":"331158159_An_empirical_study_on_gamification_for_learning_programming_language_website","abstract":"Computer science novice students find it hard to learn and master programming language subjects. In previous work, an investigation was done to confirm this assumption. The finding showed that students experienced ineffective learning, lacked interest towards this course, and lacked motivation. Previous studies have shown that applying Gamification elements in websites engages users. Gamification refers to the use of game elements in a non-game context in order to increase engagement between human and computer. In priory, a gamification-based learning website for programming language course was developed. This study aimed to measure the effectiveness and motivation level of using a Gamification website for programming language learning for first year students. Quantitative research approach was used. The effectiveness of the gamification website was tested using Quasi experiment. Student motivation was measured using ARCS motivation model. The findings showed that there were significant differences in the overall results of student performance (effectiveness and motivation) between the experimental and control groups.","authors":["Firas Layth Khaleel","Noraidah Sahari Ashaari","Tengku Siti Meriam Tengku Wook Tengku Wook"],"meta":["February 2019Jurnal Teknologi 81(2)","DOI:10.11113/jt.v81.11133","Project: Right now I'm going to finalise the effectiveness of gamification on student learning..."],"references":["330653044_Wireless_Mesh_Networks_Based_on_MBPSO_Algorithm_to_Improvement_Throughput","329687430_Quantifying_user_experience_in_using_learning_gamification_website","323822722_Gamification-based_learning_framework_for_a_programming_course","323818035_Methodology_for_developing_gamification-based_learning_programming_language_framework","316319522_Programming_Learning_Requirements_Based_on_Multi_Perspectives","311859411_Recruitment_and_Job_Search_Application","310830934_Gamification_Elements_for_Learning_Applications","304639660_The_Architecture_of_Dynamic_Gamification_Elements_Based_Learning_Content","304627725_The_study_of_gamification_application_architecture_for_programming_language_course","286592843_Audio-communication_subsystem_module_for_yrobot_-_A_modular_educational_robotic_platform"]}