{"id":"331126668_Categorical_Features_Transformation_with_Compact_One-Hot_Encoder_for_Fraud_Detection_in_Distributed_Environment_16th_Australasian_Conference_AusDM_2018_Bahrurst_NSW_Australia_November_28-30_2018_Revis","abstract":"Fraud detection for online banking is an important research area, but one of the challenges is the heterogeneous nature of transactions data i.e. a combination of numeric as well as mixed attributes. Usually, numeric format data gives better performance for classification, regression and clustering algorithms. However, many machine learning problems have categorical, or nominal features, rather than numeric features only. In addition, some machine learning platforms such as Apache Spark accept numeric data only. One-hot Encoding (OHE) is a widely used approach for transforming categorical features to numerical features in traditional data mining tasks. The one-hot approach has some challenges as well: the sparseness of the transformed data and that the distinct values of an attribute are not always known in advance. Other than the model accuracy, compactness of machine learning models is equally important due to growing memory and storage needs. This paper presents an innovative technique to transform categorical features to numeric features by compacting sparse data even if all the distinct values are not known. The transformed data can be used for the development of fraud detection systems. The accuracy of the results has been validated on synthetic and real bank fraud data and a publicly available anomaly detection (KDD-99) dataset on a multi-node data cluster.","authors":["Ikram Ul Haq","Iqbal Gondal","Peter Vamplew","Simon Brown"],"meta":["January 2019","DOI:10.1007/978-981-13-6661-1_6","In book: Data Mining (pp.69-80)"],"references":["317040893_Embedding-based_Representation_of_Categorical_Data_by_Hierarchical_Value_Coupling_Learning","316878436_Generating_Synthetic_Datasets_for_Experimental_Validation_of_Fraud_Detection","267680144_Similarity_Measures_for_Categorical_Data-A_Comparative_Study_Similarity_Measures_for_Categorical_Data-A_Comparative_Study","262010976_Internet_Banking_Fraud_Detection_Using_Prudent_Analysis","225104319_An_Effective_Pattern_Based_Outlier_Detection_Approach_for_Mixed_Attribute_Data","297582750_Large_Scale_Distributed_Data_Science_using_Apache_Spark","282589317_Space_Structure_and_Clustering_of_Categorical_Data","277334549_MLlib_Machine_Learning_in_Apache_Spark","228788380_A_Two-Step_Method_for_Clustering_Mixed_Categroical_and_Numeric_Data","228611528_Clustering_Large_Data_Sets_With_Mixed_Numeric_and_Categorical_Values"]}