{"id":"331182158_CirGO_An_alternative_circular_way_of_visualising_gene_ontology_terms","abstract":"Background\nPrioritisation of gene ontology terms from differential gene expression analyses in a two-dimensional format remains a challenge with exponentially growing data volumes. Typically, gene ontology terms are represented as tree-maps that enclose all data into defined space. However, large datasets make this type of visualisation appear cluttered and busy, and often not informative as some labels are omitted due space limits, especially when published in two-dimensional (2D) figures.\n\nResults\nHere we present an open source CirGO (Circular Gene Ontology) software that visualises non-redundant two-level hierarchically structured ontology terms from gene expression data in a 2D space. Gene ontology terms based on statistical significance were summarised with a semantic similarity algorithm and grouped by hierarchical clustering. This software visualises the most enriched gene ontology terms in an informative, comprehensive and intuitive format that is achieved by organising data from the most relevant to the least, as well as the appropriate use of colours and supporting information. Additionally, CirGO is an easy to use software that supports researchers with little computational background to present their gene ontology data in a publication ready format.\n\nConclusions\nOur easy to use open source CirGO Python software package provides biologists with a succinct presentation of terms and functions that are most represented in a specific gene expression data set in a visually appealing 2D format (e.g. for reporting research results in scientific articles). CirGO is freely available at https://github.com/IrinaVKuznetsova/CirGO.git.\n\nElectronic supplementary material\nThe online version of this article (10.1186/s12859-019-2671-2) contains supplementary material, which is available to authorized users.","authors":["Irina Kuznetsova","Artur Lugmayr","Stefan Siira","Oliver Rackham"],"meta":["February 2019BMC Bioinformatics 20(1)","DOI:10.1186/s12859-019-2671-2"],"references":["321990784_RNA-Seq_differential_expression_analysis_An_extended_review_and_a_software_tool","317163814_Expansion_of_the_Gene_Ontology_knowledgebase_and_resources","314142494_Cognitive_Big_Data_-_Survey_and_Review_on_Big_Data_Research_and_It's_Implications_What_is_Really_New_in_Big_Data","312008202_Gene-Category_Analysis","305924867_Hierarchical_RNA_Processing_Is_Required_for_Mitochondrial_Ribosome_Assembly","304806652_Systematic_and_integrative_analysis_of_large_gene_lists_using_DAVID_bioinformatics_resources","306048628_Colorgorical_Creating_Discriminable_and_Preferable_Color_Palettes_for_Information_Visualization","304806762_Systematic_and_integrative_analysis_of_large_gene_lists_using_DAVID_bioinformatics_resources","297917249_PANTHER_a_library_of_protein_families_and_subfamilies_indexed_by_function","286215327_The_Neighbor-Joining_Method_A_New_Method_for_Reconstructing_Phylogenetic_Trees"]}