{"id":"331150346_Beyond_the_clustering_coefficient_A_topological_analysis_of_node_neighbourhoods_in_complex_networks","abstract":"In Network Science, node neighbourhoods, also called ego-centered networks, have attracted significant attention. In particular the clustering coefficient has been extensively used to measure their local cohesiveness. In this paper, we show how, given two nodes with the same clustering coefficient, the topology of their neighbourhoods can be significantly different, which demonstrates the need to go beyond this simple characterization. We perform a large scale statistical analysis of the topology of node neighbourhoods of real networks by first constructing their clique complexes, and then computing their Betti numbers. We are able to show significant differences between the topology of node neighbourhoods of real networks and the stochastic topology of null models of random simplicial complexes revealing local organisation principles of the node neighbourhoods. Moreover we observe that a large scale statistical analysis of the topological properties of node neighbourhoods is able to clearly discriminate between power-law networks, and planar road networks.","authors":["Alexander P. Kartun-Giles","Ginestra Bianconi"],"meta":["February 2019Chaos Solitons & Fractals X 1:100004","DOI:10.1016/j.csfx.2019.100004"],"references":["333642405_Simplicial_models_of_social_contagion","328241551_Simplicial_complexes_and_complex_systems","324457741_Towards_a_new_approach_to_reveal_dynamical_organization_of_the_brain_using_topological_data_analysis","323302383_Simplicial_Closure_and_Higher-order_Link_Prediction","322076279_Introducing_Quantum_Ricci_Curvature","313465896_Emergent_Hyperbolic_Network_Geometry","309489273_Insights_into_Brain_Architectures_from_the_Homological_Scaffolds_of_Functional_Connectivity_Networks","329293498_Simplicial_Activity_Driven_Model","329112398_Topological_percolation_on_hyperbolic_simplicial_complexes","314237974_Weighted_Growing_Simplicial_Complexes"]}