{"id":"331114002_Ground_Classification_of_UAV_Image-based_Point_Clouds_through_Different_Algorithms_Open_Source_vs_Commercial_Software","abstract":"Point cloud data constitute an important source for assessment of the 3D structure of the environment and are often used in geomorphology, hydrology, ecology and forestry, and other fields. Although airborne laser scanning (ALS) is a major source of such point clouds, photogrammetry in combination with UAV platforms equipped with consumer grade cameras is increasingly used, due to considerably lower costs. The acquired point clouds are subsequently classified to obtain information on terrain or vegetation structure. Regardless of the final product needed, the most critical part of the classification process is the ground points identification (i.e., points that represent bare ground). With ground points correctly classified, one can derive various products, such as canopy height models (CHMs) or digital terrain models (DTMs). However, classification of ground points is affected by the character of vegetation and terrain. Therefore, the generation of accurate DTMs under a vegetation canopy and the role of vegetation structure on DTMs accuracy has been of interest in several recent studies, particularly for UAV image-based point clouds that are less suitable for bare ground data acquisition than ALS. Alternatively, in the case of deciduous forest stands, data acquisition under leaf-off conditions can be considered; this has been however only scarcely tested for image-based point clouds.","authors":["Petr Klápště"],"meta":["June 2018","Conference: UAS 4 ENVIRO 2018 - 6th International Conference on \"Small Unmanned Aerial Systems for Environmental Research\"At: Split, Croatia"],"references":["316588344_Accuracy_of_Photogrammetric_UAV-Based_Point_Clouds_under_Conditions_of_Partially-Open_Forest_Canopy","303975654_An_Easy-to-Use_Airborne_LiDAR_Data_Filtering_Method_Based_on_Cloth_Simulation","289536406_Assessment_of_Image-Based_Point_Cloud_Products_to_Generate_a_Bare_Earth_Surface_and_Estimate_Canopy_Heights_in_a_Woodland_Ecosystem","256850087_High_spatial_resolution_three-dimensional_mapping_of_vegetation_spectral_dynamics_using_computer_vision","320700985_Assessment_of_Errors_Caused_by_Forest_Vegetation_Structure_in_Airborne_LiDAR-Derived_DTMs","320170932_Rough_wave-like_heaped_overburden_promotes_establishment_of_woody_vegetation_while_leveling_promotes_grasses_during_unassisted_post_mining_site_development","222707611_Segmentation_of_airborne_laser_scanning_data_using_a_slope_adaptive_neighborhood_ISPRS_Journal_of_Photogrammetry_and_Remote_Sensing_60_2","222418489_Accuracy_assessment_of_digital_elevation_models_by_means_of_robust_statistical_methods"]}