{"id":"331184268_ABNE_An_Attention_Based_Network_Embedding_for_User_Alignment_Across_Social_Networks","abstract":"User alignment across social networks can facilitate more information/knowledge transferring across networks and thereby benefit several applications including social link prediction, cross-domain recommendation, information diffusion, and etc. Several works try to learn a common subspace for networks by preserving the structural proximities, such that different contribution weights of neighbors are ignored as users were always connected by unweighted edges. In this paper, we propose an attention based network embedding model that exploits the social structures for user alignment. In particular, two main components are contained in our model framework: a masked graph attention mechanism which tries to learn the alignment task driven attention weights by the supervision of pre-aligned user pairs, and an embedding algorithm tries to learn a common vector space by explicitly modeling the weighted contribution probabilities between follower-ships and followee-ships.With the learned weights and embeddings transferring between these two components, we construct a unified model for user embedding and alignment. Stochastic gradient descent and negative sampling are adopted for the efficient learning and scalability. Extensive experiments on realworld social network datasets demonstrate the effectiveness and robustness of the proposed model compared with several state-of-the-art methods.","authors":["Li Liu","Youmin Zhang","Shun Fu","Fujin Zhong"],"meta":["February 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2900095"],"references":["328439947_Distribution_Distance_Minimization_for_Unsupervised_User_Identity_Linkage","328434933_MEgo2Vec_Embedding_Matched_Ego_Networks_for_User_Alignment_Across_Social_Networks","327164312_User_Alignment_via_Structural_Interaction_and_Propagation","326551541_Aligning_Users_across_Social_Networks_Using_Network_Embedding","325391705_MASTER_across_Multiple_social_networks_integrate_Attribute_and_STructure_Embedding_for_Reconciliation","323185061_CoLink_An_Unsupervised_Framework_for_User_Identity_Linkage","328434237_REGAL_Representation_Learning-based_Graph_Alignment","326354420_Learning_to_Map_Social_Network_Users_by_Unified_Manifold_Alignment_on_Hypergraph","324055757_AAANE_Attention-based_Adversarial_Autoencoder_for_Multi-scale_Network_Embedding","323672298_Inferring_Anchor_Links_Based_on_Social_Network_Structure"]}