{"id":"331279597_A_general_framework_for_Noetherian_well_ordered_polynomial_reductions","abstract":"Polynomial reduction is one of the main tools in computational algebra with innumerable applications in many areas, both pure and applied. Since many years both the theory and an efficient design of the related algorithm have been solidly established. This paper presents a definition of the generic concept of polynomial reduction structure, studies its features and highlights the aspects needed in order to grant and to efficiently test the main properties (Noetherianity, confluence, ideal membership). The most significant aspect of this analysis is a negative reappraisal of the role of the notion of term ordering which is usually considered a central and crucial tool in the theory. In fact, as it was already established in the computer science context in relation with termination of algorithms, most of the properties can be obtained simply considering a well founded order, while the classical requirement that it be preserved by multiplication is irrelevant. The last part of the paper shows how the polynomial basis concepts present in literature are interpreted in our language and their properties are consequences of the general results established in the first part of the paper.","authors":["Michela Ceria","Teo Mora","Margherita Roggero"],"meta":["February 2019Journal of Symbolic Computation 95(2019):100-133","DOI:10.1016/j.jsc.2019.02.002"],"references":["318336776_Combinatorics_of_involutive_divisions","312170278_Buchberger-Zacharias_Theory_of_Multivariate_Ore_Extensions","310435838_Buchberger-Weispfenning_Theory_for_Effective_Associative_Rings","300400171_De_Nugis_Groebnerialium_4","290329825_Solving_polynomial_equation_systems_III","281421067_Sur_la_forme_canonique_des_equations_algebriques","268927115_On_the_algebraic_theory_of_modular_systems_or_modules_of_polynomials","268246099_On_the_structure_of_ordered_real_vector_spaces","266014239_De_l'existence_des_integrales_dans_un_systeme_differentiel_quelconque","265442307_Algebraic_Simplification"]}