{"id":"331209845_Predicting_Activities_of_Daily_Living_of_People_Occupying_Smart_Environments","abstract":"Aims/ objectives: To interpret the trends of Activities of Daily Living (ADL) and Activities of Daily Working (ADW) of people who are occupying Ambient Intelligence (AmI) environments and predict the next activities’ time values. This research has two main contributions; A novel proposed technique called Activity Prediction Moving Average (APMA) based on Exponentially Weighted Moving Average (EWMA) and propose a new framework to be used in our research based on the Adaptive-Network based Fuzzy Inference System (ANFIS).Study Design: Cross-sectional study.Place and Duration of Study: Department of Computer science, Institute of Science and Technology, between August 2018 and November 2018.Methodology: Three datasets are included in this research of people who are occupying smart environments. These datasets are examined using APMA and ANFIS techniques.Results: The results of the applied techniques show a good indicator of using them in human behaviour forecasting.Conclusion: we investigated prediction techniques that can be applied to the human behaviours’ data. The proposed solutions demonstrate the feasibility of interpreting this kind of data. These techniques will support the supervisor to get clear information about the situation of the participant who occupying a smart environment.","authors":["Abubaker Mohamed Elbayoudi"],"meta":["February 2019Current Journal of Applied Science and Technology","DOI:10.9734/cjast/2019/v32i630035"],"references":["280865070_Analyzing_Activity_Behavior_and_Movement_in_a_Naturalistic_Environment_Using_Smart_Home_Techniques","248548783_Long-term_Behavioural_Change_Detection_Through_Pervasive_Sensing","3113825_ANFIS_Adaptive-Network-based_Fuzzy_Inference_System","223447889_An_Adaptive_Network-Based_Fuzzy_Inference_System_ANFIS_for_the_prediction_of_stock_market_return_The_case_of_the_Istanbul_Stock_Exchange","222431820_Exponential_smoothing_The_state_of_the_art-Part_II","222058621_Forecasting_Seasonals_and_Trends_by_Exponential_Weighted_Moving_Averages"]}