{"id":"331260198_All_Advanced_Placement_AP_Computer_Science_is_Not_Created_Equal_A_Comparison_of_AP_Computer_Science_A_and_Computer_Science_Principles","abstract":"This article compares the two most prominent courses of Advanced Placement (AP) computer science study offered throughout 9-12 grades in the U.S. The structure, guidelines, components, and exam formats of the traditional AP Computer Science A course and the relatively newer AP Computer Science Principles course were compared to examine differences in content and emphases. A depth-of-learning analysis was conducted employing Bloom’s Revised Taxonomy to examine potential differences in rigor and challenge represented by the two options, particularly as it relates to acquiring computer programming proficiency. Analyses suggest structural differences in both course content and end-of-course exam components likely result in less depth and rigor in the new Computer Science Principles course as compared to the Computer Science A course. A lower minimum standard for learning programming skills in the Computer Science Principles course was observed, making it a less viable option for students looking to acquire skills transferable to future computer science study or employment. The potential implications for students choosing the new course over the traditional offering, as well as for schools opting for the new course as its sole or primary offering are discussed.","authors":["Doug Havard","Keith Howard"],"meta":["February 2019","DOI:10.26716/jcsi.2019.02.1.2"],"references":["331260314_Advanced_Placement_AP_Computer_Science_Principles_Searching_for_Equity_in_a_Two-Tiered_Solution_to_Underrepresentation","274309848_Computational_Thinking","334585057_A_Framework_For_Representing_Knowledge","331145296_Advanced_Placement_AP_Computer_Science_Principles_Searching_for_Equity_in_a_Two-Tiered_Solution_to_Underrepresentation","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","317158625_Remaining_trouble_spots_with_computational_thinking","310792069_The_long_quest_for_computational_thinking","286875785_Transforming_K-12_computing_education_APR_computer_science_principles","284206160_APR_computer_science_principles","262309212_Computation_and_Computational_Thinking"]}