{"id":"331284639_CHATBOTS_UMA_ANALISE_BIBLIOMETRICA_DO_ESTADO_DA_ARTE_DA_LITERATURA","abstract":"RESUMO Considerando o contexto da Ciência da Computação, Chatbots são programas de computador que, através de técnicas de Inteligência Artificial, objetivam simular o comportamento humano quando no momento de um diálogo através de mensagens de texto. Quão maior for o grau de dificuldade em se identificar a sua presença, maior será a sua eficiência. Apesar de ser uma área de estudo relativamente nova, a aplicação deste conceito tem aumentado consideravelmente, seja em ambientes acadêmicos ou em aplicações comerciais, como, por exemplo, em situações que envolvem assistentes para esclarecimentos de dúvidas em sites de fabricantes de produtos eletrônicos, serviços de atendimento ao cliente ou mesmo em serviços como telefonia. Assim, dado o universo de aplicações associados ao tema, propõe-se neste artigo uma análise do estado da arte das pesquisas a nível mundial através de uma análise bibliométrica qualitativo-quantitativa. Palavras-chave: Chatbots. Inteligência Artificial. Interdisciplinaridade. INTRODUÇÃO Na concepção de Coppin (2015), a Inteligência Artificial (IA) denota-se como uma ciência que se dedica ao estudo de sistemas que, na ótica de um observador qualquer, agem de forma inteligente. Para Rover (2010, p. 59), \"É a ciência do conhecimento que busca a melhor forma de representá-lo, como também é a ciência que estuda o raciocínio e os processos de aprendizagem em máquinas.\". De acordo com Russel e Norvig (2013), trata-se de um campo de pesquisa novo, quando comparado a outras ciências, uma vez que teve seu início em 1956 1 , logo após a Segunda Guerra Mundial. Nos últimos anos, complementa Franco (2014), com o 1 O termo Inteligência Artificial foi cunhado por John McCarthy, cientista norte americano, em um congresso sobre o tema realizado na Universidade de Dartmouth em 1956 (FRANCO, 2014).","authors":["Andréia Ana Bernardini","Arildo Antônio Sônego","Eliane Pozzebon"],"meta":["January 2018","Project: MAZK  UFSC"],"references":["262327048_Detecting_Deceptive_Chat-Based_Communication_Using_Typing_Behavior_and_Message_Cues","291154910_Bots_as_language_learning_tools","2832779_Legal_Knowledge_Based_Systems"]}