{"id":"331238632_Predictive_Modeling_of_the_Hospital_Readmission_Risk_from_Patients'_Claims_Data_Using_Machine_Learning_A_Case_Study_on_COPD","abstract":"Chronic Obstructive Pulmonary Disease (COPD) is a prevalent chronic pulmonary condition that affects hundreds of millions of people all over the world. Many COPD patients got readmitted to hospital within 30 days after discharge due to various reasons. Such readmission can usually be avoided if additional attention is paid to patients with high readmission risk and appropriate actions are taken. This makes early prediction of the hospital readmission risk an important problem. The goal of this paper is to conduct a systematic study on developing different types of machine learning models, including both deep and non-deep ones, for predicting the readmission risk of COPD patients. We evaluate those different approaches on a real world database containing the medical claims of 111,992 patients from the Geisinger Health System from January 2004 to September 2015. The patient features we build the machine learning models upon include both knowledge-driven ones, which are the features extracted according to clinical knowledge potentially related to COPD readmission, and data-driven features, which are extracted from the patient data themselves. Our analysis showed that the prediction performance in terms of Area Under the receiver operating characteristic (ROC) Curve (AUC) can be improved from around 0.60 using knowledge-driven features, to 0.653 by combining both knowledge-driven and data-driven features, based on the one-year claims history before discharge. Moreover, we also demonstrate that the complex deep learning models in this case cannot really improve the prediction performance, with the best AUC around 0.65.","authors":["Xu Min","Bin Yu","Fei Wang"],"meta":["February 2019Scientific Reports 9(1):2362","DOI:10.1038/s41598-019-39071-y"],"references":["324547713_Predicting_Hospital_Readmission_via_Cost-Sensitive_Deep_Learning","324372333_Readmission_prediction_via_deep_contextual_embedding_of_clinical_concepts","322695006_Scalable_and_accurate_deep_learning_for_electronic_health_records","316525330_Hospital_readmissions_for_COPD_A_retrospective_longitudinal_study","328266247_Reducing_30-Day_Readmissions_for_Chronic_Obstructive_Pulmonary_Disease","321610288_Feature_Extraction_Construction_and_Selection_A_Data_Mining_Perspective","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","312538118_Support-vector_networks","311469848_Recurrent_neural_network_based_language_model"]}