{"id":"331271611_An_Improved_Calibration_Technique_for_Polarization_Images","abstract":"Polarization imaging can be used to improve image quality by reducing the effects of unwanted light reflection, enhancing the quality of images taken in non-ideal conditions such as foggy weather, or reconstructing the 3D form of an object based on the shape from polarization. Reconstructing a 3D form requires the acquisition of multiple images and inference of polarization parameters, such as the degree of polarization and angle of polarization, from these experimental data. The light polarization extraction process should begin by performing photometric calibration to improve the performance of polarize instrument measurements by reducing measurement errors and improving the consistency between measurements. We propose an algorithm based on the kernel ridge regression method to estimate both the polarization parameters and the measurement (angle) errors in the placement of the polarizer. The algorithm was tested on four different sets of images containing different objects based on their responses to light and polarization. The algorithm that uses the mixed kernel function gives the best results.","authors":["Eri Prasetyo","Aini Suri Talita","Mohammad Iqbal","Achmad Benny Mutiara"],"meta":["February 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2900538"],"references":["302567757_Shape_from_Mixed_Polarization","285574706_Fuzzy_kernel_K-medoids_algorithm_for_multiclass_multidimensional_data_classification","221362538_Face_Recognition_Using_Kernel_Ridge_Regression","215561879_Polarization_imaging_for_industrial_inspection","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond","315846957_Surface_normal_estimation_of_black_specular_objects_from_multiview_polarization_images","315039926_3D_Reconstruction_and_Dehazing_with_Polarization_Vision","301754129_Nonlinear_forecasting_with_many_predictors_using_kernel_ridge_regression","264958335_An_Introduction_to_Linear_Regression_Analysis","262172950_Polarization-Based_Dehazing_Using_Two_Reference_Objects"]}