{"id":"331205523_It's_not_just_technology_it's_people_A_Conceptual_Model_of_Shared_Health_Informatics_for_chronic_illness_Preprint","abstract":"Background: \nFor many people, tracking health indicators is central to managing a chronic illness. However, previous informatics research has largely viewed tracking as a solitary process that lacks the characteristics essential to tracking in support of chronic illness management.\n\nObjective: \nTo inform development of effective technologies that aid tracking of health indicators to support chronic illness management, this study aimed to construct a health informatics model that accurately describes the work and social context of that tracking work.\n\nMethods: \nAs part of a larger project, we conducted semistructured interviews with 40 adults concerning their chronic illness management practices, including tracking and communication. We also assembled transcripts of 30 publicly available videos of 24 adults discussing tracking processes for managing their own chronic illness. We used qualitative methods to analyze interviews and video transcripts through the lens of ongoing personal and health informatics research.\n\nResults: \nWe have described the people and work involved in tracking in support of chronic illness management and contributed a Conceptual Model of Shared Health Informatics (CoMSHI). Specifically, we identified the need for a health informatics model that (1) incorporates the ongoing nature of tracking work and (2) represents the social dimension of tracking for illness management. Our model depicts communication, information, collection, integration, reflection, and action work in the social context of the person with chronic illness, informal carers, health care providers, and community members.\n\nConclusions: \nThe resulting CoMSHI yields a more detailed and nuanced viewpoint of tracking in support of chronic illness management and can inform technology design to improve tracking tools to support people in more confident and capable chronic illness management.","authors":["Lisa M. Vizer","Jordan Eschler","Bonmi Koo","James Ralston"],"meta":["April 2018Journal of Medical Internet Research 21(4)","DOI:10.2196/10830"],"references":["328689561_Personal_Informatics_in_Interpersonal_Contexts_Towards_the_Design_of_Technology_that_Supports_the_Social_Ecologies_of_Long-Term_Mental_Health_Management","328291000_Smartphone_Applications_to_Support_Sleep_Self-Management_Review_and_Evaluation","326473701_Insights_into_Older_Adult_Patient_Concerns_around_Caregiver_Proxy_Portal_Use_Preprint","325130069_Too_Important_to_Ignore_Leveraging_Digital_Technology_to_Improve_Chronic_Illness_Management_Among_Black_Men","324951217_Supporting_Collaborative_Health_Tracking_in_the_Hospital_Patients'_Perspectives","324658366_Supporting_Collaborative_Health_Tracking_in_the_Hospital_Patients'_Perspectives","320147586_Personal_Discovery_in_Diabetes_Self-Management_Discovering_Cause_and_Effect_Using_Self-Monitoring_Data","318871599_The_Potential_of_Mobile_Apps_for_Improving_Asthma_Self-Management_A_Review_of_Publicly_Available_and_Well-Adopted_Asthma_Apps","323908762_Self-Tracking_Social_Media_and_Personal_Health_Records_for_Patient_Empowered_Self-Care_Contribution_of_the_IMIA_Social_Media_Working_Group","321639732_Self-Tracking_for_Fertility_Care_Collaborative_Support_for_a_Highly_Personalized_Problem"]}