{"id":"331292654_Implementing_artificial_neural_networks_through_bionic_construction","abstract":"It is evident through biology research that, biological neural network could be implemented through two means: by congenital heredity, or by posteriority learning. However, traditionally, artificial neural network, especially the Deep learning Neural Networks (DNNs) are implemented only through exhaustive training and learning. Fixed structure is built, and then parameters are trained through huge amount of data. In this way, there are a lot of redundancies in the implemented artificial neural network. This redundancy not only requires more effort to train the network, but also costs more computing resources when used. In this paper, we proposed a bionic way to implement artificial neural network through construction rather than training and learning. The hierarchy of the neural network is designed according to analysis of the required functionality, and then module design is carried out to form each hierarchy. We choose the Drosophila’s visual neural network as a test case to verify our method’s validation. The results show that the bionic artificial neural network built through our method could work as a bionic compound eye, which can achieve the detection of the object and their movement, and the results are better on some properties, compared with the Drosophila’s biological compound eyes.","authors":["Hu He","Xu Yang","Zhiheng Xu","Ning Deng"],"meta":["February 2019PLoS ONE 14(2):e0212368","DOI:10.1371/journal.pone.0212368","Project: Spking neural network learning methodology"],"references":["307560165_Deep_neural_networks_are_easily_fooled_High_confidence_predictions_for_unrecognizable_images","271556459_Connectivity_and_path_analysis_for_neuron_network_in_the_Drosophila_brain","269280482_Deep_Neural_Networks_Are_Easily_Fooled_High_Confidence_Predictions_for_Unrecognizable_Images","260117884_Optogenetic_and_Pharmacologic_Dissection_of_Feedforward_Inhibition_in_Drosophila_Motion_Vision","315975525_Visual_acuity_of_the_honey_bee_retina_and_the_limits_for_feature_detection","301331350_Bio-inspired_neural_network_with_application_to_license_plate_recognition_Hysteretic_ELM_approach","300095045_ANN-based_Classifiers_Automatically_Generated_by_New_Multi-objective_Bionic_Algorithm","291042213_A_Hierarchical_Modular_Echo_State_Network_Based_on_Brain_Networks","262030045_Deep_Learning_in_Neural_Networks_An_Overview","261163067_A_spiking_network_for_spatial_memory_formation_Towards_a_fly-inspired_ellipsoid_body_model"]}