{"id":"331262028_Scientific_Maps_Methods_and_Techniques_nqshh_hay_lmy_fnwn_w_rwsh_ha","abstract":"Scientific publications are rapidly developing as a result of science domains development. Therfore tracing research trends in various domains of science has become a challenge. In fact, limitations of conventional methods of analysis of various domains of science and their weaknesses in representing a comprehensive view of knowledge, has led specialists of scientometrics and computer science to develop new methods to overcome it. In this direction, scientometrics specialists have been combined scientometrics indicators and methods with new visualization techniques to provide tools in order to study science and their relations. The aim of this study is to introduce methods of mapping the scientific maps especially co-word analysis and methods of text-mining analysis. This study tries to guide researchers to new fields of analyzing sciences structure. Therefore this paper focuses on the concepts of mapping scientific maps and verifing their methods try to explain theoretical foundations of scientific maps. Consequently suggests these maps to be used as a solution to convert the implicit knowledge into explicit knowledge. Keywords: Scientometrics, Scientific maps, Visualization, Data-mining, Text-mining با رشد حوزه‌های دانش، انتشارات علمی نیز به‌سرعت توسعه یافته و در نتیجه این رشد، رصد روندهای پژوهشی در حوزه‌های گوناگون علم دشوار شده است. با توجه به محدودیت‌های روش‌های مرسوم تجزیه و تحلیل حوزه‌های مختلف علوم در دنیای جدید و عدم تصور کامل و جامع آن‌ها از علوم مختلف، روش‌های نوینی توسط متخصصان علم‌سنجی و علوم رایانه ارائه شده است. در این راستا، متخصصان علم‌سنجی در تلاشند تا نقشه‌های حوزه‌های مختلف علمی را ترسیم نمایند. به‌همین دلیل، آن‌ها شاخص‌ها و روش‌های علم‌سنجی را با فنون نوین مصورسازی ترکیب کرده‌اند تا برای سیاست‌گذاران و جوامع علمی، بررسی و پیمایش در مسیرهای مختلف آن میسر گردد. مطالعه حاضر، با هدف معرفی روش‌های نگاشت نقشه‌های علمی؛ علی‌الخصوص تحلیل هم‌رخدادی واژگان و روش‌های متن‌کاوی، سعی دارد تا نظر محققان را به سمت حوزه‌های جدید تحلیل ساختار علوم رهنمون سازد. این مقاله ضمن توجه بر مفاهیم نگاشت نقشه‌های علمی و بررسی روش‌های آن، به توضیح بنیان‌‌های نظری نقشه‌های علمی پرداخته و در نتیجه این نوع نقشه‌ها را به عنوان راه‌‌حلی برای بازنمون دانش ضمنی در جهت تبدیل آن به دانش آشکار، برای جامعه علمی پیشنهاد می‌نماید. کلیدواژه‌ها: علم‌سنجی، نقشه‌های علمی، مصورسازی، داده‌کاوی، متن‌کاوی","authors":["Hadi Ramezani","Mehdi Alipour Hafezi","Esmat Momeni"],"meta":["February 2014","Project: Knowledge map of digital libraries in Iran"],"references":["298843110_Implicit_Text_Linkages_between_Medline_Records_Using_Arrowsmith_as_an_Aid_to_Scientific_Discovery","252130249_Supporting_Systematic_Reviews_Using_Text_Mining","321608199_Handbook_of_Quantitative_Science_and_Technology_Research_The_Use_of_Publication_and_Patent_Statistics_in_Studies_of_ST_Systems","321599917_Mapping_the_Dynamics_of_Science_and_Technology_Sociology_of_Science_in_the_Real_World","286354867_From_Patient_Data_to_Medical_Knowledge_The_Principles_and_Practice_of_Health_Informatics","285748561_Cluster_Analysis_Basic_Concepts_and_Algorithms","280895340_Visualizing_a_discipline_An_author_co-citation_analysis_of_information_science_1972-1995","279906809_Multiple_Authors_Multiple_Problems_-_Bibliometrics_and_the_Study_of_Scholarly_Collaboration_A_Literature_Review","247373685_Reference_Analysis_of_the_American_Historical_Review","246258038_From_translations_to_problematic_networks_An_introduction_to_co-word_analysis"]}