{"id":"331275391_TEXT_MINING_AUTHORSHIP_DETECTION_METHODS_DEVELOPMENT","abstract":"Stylometric Authorship attribution is one of the new approaches in the text mining and recently been under focus of many researchers and institutes because of its delicateness, especially for museums and authorized grand libraries which are very concerned about the value of their books and literature belongings educationally and financially, this worthiness obviously depends on the certification and the authentication of these valuable books. This approach is concerned about analyzing texts, e.g. novels and plays that famous authors wrote, trying to measure the author style, by choosing some attributes that shows the author style of writing, assuming that these writers have a special way of writing, that no other writer has; To achieve that, this paper discusses several algorithms which are used frequently and skipping the one time, ad-hoc adventures in this field. This paper also opens the way for future works to merge and improve these techniques, to get more efficient, accurate and trustable measures. Keywords - component: Authorship attribution, Stylometric, Text mining.","authors":["Tareef Kamil Mustafa"],"meta":["December 2018","Project: Authorship attribution"],"references":["328642340_Stylometric_authorship_balanced_attribution_prediction_method","328642251_Authorship_Arabic_Text_Detection_According_to_Style_of_Writing_by_using_SABA_Method","328642085_Burrows-Delta_Method_Fitness_for_Arabic_Text_Authorship_Stylometric_Detection","227400685_Fixing_the_Federalist_Correcting_Results_and_Evaluating_Editions_for_Automated_Attribution","221654684_Style_Mining_of_Electronic_Messages_for_Multiple_Authorship_Discrimination_First_Results","220946989_Automatic_Authorship_Attribution","220873386_Text_Chunking_using_Regularized_Winnow","47554389_Dropping_down_the_Maximum_Item_Set_Improving_the_Stylometric_Authorship_Attribution_Algorithm_in_the_Text_Mining_for_Authorship_Investigation","222061128_Authorship_attribution_of_texts_a_review","220017639_Content_Analysis_An_Introduction_To_Its_Methodology"]}