{"id":"331295577_Efficient_frequent_subgraph_mining_on_large_streaming_graphs","abstract":"We propose an efficient, approximate algorithm to solve the problem of finding frequent subgraphs in large streaming graphs. The graph stream is treated as batches of labeled nodes and edges. Our proposed algorithm finds the set of frequent subgraphs as the graph evolves after each batch. The computational complexity is bounded to linear limits by looking only at the changes made by the most recent batch, and the historical set of frequent subgraphs. As a part of our approach, we also propose a novel sampling algorithm that samples regions of the graph that have been changed by the most recent update to the graph. The performance of the proposed approach is evaluated using five large graph datasets, and our approach is shown to be faster than the state of the art large graph miners while maintaining their accuracy. We also compare our sampling algorithm against a well known sampling algorithm for network motif mining, and show that our sampling algorithm is faster, and capable of discovering more types of patterns. We provide theoretical guarantees of our algorithm's accuracy using the well known Chernoff bounds, as well as an analysis of the computational complexity of our approach.","authors":["Abhik Ray","Lawrence B. Holder","Albert Bifet"],"meta":["February 2019Intelligent Data Analysis 23(1):103-132","DOI:10.3233/IDA-173705"],"references":["271020414_Blogel_A_Block-Centric_Framework_for_Distributed_Computation_on_Real-World_Graphs","265603680_Effectively_and_Efficiently_Mining_Frequent_Patterns_from_Dense_Graph_Streams_on_Disk","254639513_Network_Sampling_via_Edge-based_Node_Selection_with_Graph_Induction","228939080_Frequent_subgraph_discovery_in_dynamic_networks","313550942_Mining_molecular_fragments_Finding_relevant_substructures_of_molecules","294090184_Big_Graph_Mining_Frameworks_and_Techniques","262212502_An_iterative_MapReduce_approach_to_frequent_subgraph_mining_in_biological_datasets","262160747_GraphX_a_resilient_distributed_graph_system_on_Spark","261912829_Density-based_data_partitioning_strategy_to_approximate_large-scale_subgraph_mining","250428492_Laws_of_Graph_Evolution_Densiflcation_and_Shrinking_Diameters"]}