{"id":"331290290_Exponential_Integrators_with_Parallel-in-Time_Rational_Approximations_for_the_Shallow-Water_Equations_on_the_Rotating_Sphere","abstract":"High-performance computing trends towards many-core systems are expected to continue over the next decade. As a result, parallel-in-time methods, mathematical formulations which exploit additional degrees of parallelism in the time dimension, have gained increasing interest in recent years. In this work we study a massively parallel rational approximation of exponential integrators (REXI). This method replaces a time integration of stiff linear oscillatory and diffusive systems by the sum of the solutions of many decoupled systems, which can be solved in parallel. Previous numerical studies showed that this reformulation allows taking arbitrarily long time steps for the linear oscillatory parts. The present work studies the non-linear shallow-water equations on the rotating sphere, a simplified system of equations used to study properties of space and time discretization methods in the context of atmospheric simulations. After introducing time integrators, we first compare the time step sizes to the errors in the simulation, discussing pros and cons of different formulations of REXI. Here, REXI already shows superior properties compared to explicit and implicit time stepping methods. Additionally, we present wallclock-time-to-error results revealing the sweet spots of REXI obtaining either an over 6 × higher accuracy within the same time frame or an about 3 × reduced time-to-solution for a similar error threshold. Our results motivate further explorations of REXI for operational weather/climate systems.","authors":["Martin Schreiber","Nathanaël Schaeffer","Richard Loft"],"meta":["February 2019Parallel Computing 85","DOI:10.1016/j.parco.2019.01.005","Project: Next generation time integration methods targeting climate and weather simulations"],"references":["328585602_A_Parallel_Time-Integrator_for_Solving_the_Linearized_Shallow_Water_Equations_on_the_Rotating_Sphere","305803519_Windspharm_A_High-Level_Library_for_Global_Wind_Field_Computations_Using_Spherical_Harmonics","328057474_Multi-level_spectral_deferred_corrections_scheme_for_the_shallow_water_equations_on_the_rotating_sphere","312359934_An_initial-value_problem_for_testing_numerical_models_of_the_global_shallow-water_equations","312091529_Turbulent_geodynamo_simulations_A_leap_towards_Earth's_core","311615364_Beyond_spatial_scalability_limitations_with_a_massively_parallel_method_for_linear_oscillatory_problems","311458072_Tropical_Vorticity_Forcing_and_Superrotation_in_the_Spherical_Shallow_Water_Equations","308327296_Supergranulation_and_multiscale_flows_in_the_solar_photosphere_Global_observations_vs_A_theory_of_anisotropic_turbulent_convection","293041770_Fast_evaluation_of_transient_acoustic_fields","284387288_A_Semi-Lagrangian_and_Semi-Implicit_Numerical_Integration_Scheme_for_the_Primitive_Meteorological_Equations"]}