{"id":"331298452_What_is_the_Relationship_between_Students'_Computational_Thinking_Performance_and_School_Achievement","abstract":"This study investigates the relationship between computational thinking performance and general school achievement and explores if computational thinking performance can be predicted by algebra and informatics achievement. The sample group of 775 grade 8 students are drawn from 28 secondary schools across Kazakhstan. Students responded to a Computational Thinking Performance test of 50 multiple-choice questions and Computational Thinking Scale questionnaire. The test covers the concepts: logical thinking, generalisation and abstraction. The validity and reliability of the multiple-choice questions are tested using Item Response Theory. The Likert type questionnaire covers five factors: creativity, algorithmic thinking, cooperation, critical thinking and problem solving. School achievement results (secondary data) include scores for a number of school subjects. The results of the study showed that the multiple-choice questions are valid and reliable tool to measure computational thinking performance of students, algebra, general school achievement and students’ perception of their computational thinking skills were significant predictors of computational thinking performance. The results revealed no gender difference in computational thinking performance and perceptions of computational thinking. The findings regarding the relationship between computational thinking performance of the students’ general school achievement and perceptions of computational thinking skills are compared and discussed.","authors":["Amankeldiuly Mindetbay Yerkhan","Christian Bokhove","John Woollard"],"meta":["January 2019International Journal of Computer Science Education in Schools","DOI:10.21585/ijcses.v0i0.45"],"references":["327302966_Computational_thinking_-_a_guide_for_teachers","319470426_Developing_Analyzing_and_Using_Distractors_for_Multiple-Choice_Tests_in_Education_A_Comprehensive_Review","311163542_Comparing_Students'_Scratch_Skills_with_Their_Computational_Thinking_Skills_in_Terms_of_Different_Variables","299464834_How_can_the_teaching_of_programming_be_used_to_enhance_computational_thinking_skills","296148316_Comparing_Computational_Thinking_Development_Assessment_Scores_with_Software_Complexity_Metrics","319907288_Analysis_of_the_relation_between_computational_thinking_skills_and_various_variables_with_the_structural_equation_model","317158625_Remaining_trouble_spots_with_computational_thinking","312253565_A_validity_and_reliability_study_of_the_Computational_Thinking_Scales_CTS","308840959_Computational_Thinking_Curriculum_for_K-12_Education_--_A_Delphi_Survey","308654282_Which_cognitive_abilities_underlie_computational_thinking_Criterion_validity_of_the_Computational_Thinking_Test"]}