{"id":"331206656_Machine_Learning_in_Amyotrophic_Lateral_Sclerosis_Achievements_Pitfalls_and_Future_Directions","abstract":"Background: Amyotrophic Lateral Sclerosis (ALS) is a relentlessly progressive neurodegenerative condition with limited therapeutic options at present. Survival from symptom onset ranges from 3 to 5 years depending on genetic, demographic, and phenotypic factors. Despite tireless research efforts, the core etiology of the disease remains elusive and drug development efforts are confounded by the lack of accurate monitoring markers. Disease heterogeneity, late-stage recruitment into pharmaceutical trials, and inclusion of phenotypically admixed patient cohorts are some of the key barriers to successful clinical trials. Machine Learning (ML) models and large international data sets offer unprecedented opportunities to appraise candidate diagnostic, monitoring, and prognostic markers. Accurate patient stratification into well-defined prognostic categories is another aspiration of emerging classification and staging systems.\nMethods: The objective of this paper is the comprehensive, systematic, and critical review of ML initiatives in ALS to date and their potential in research, clinical, and pharmacological applications. The focus of this review is to provide a dual, clinical-mathematical perspective on recent advances and future directions of the field. Another objective of the paper is the frank discussion of the pitfalls and drawbacks of specific models, highlighting the shortcomings of existing studies and to provide methodological recommendations for future study designs.\nResults: Despite considerable sample size limitations, ML techniques have already been successfully applied to ALS data sets and a number of promising diagnosis models have been proposed. Prognostic models have been tested using core clinical variables, biological, and neuroimaging data. These models also offer patient stratification opportunities for future clinical trials. Despite the enormous potential of ML in ALS research, statistical assumptions are often violated, the choice of specific statistical models is seldom justified, and the constraints of ML models are rarely enunciated.\nConclusions: From a mathematical perspective, the main barrier to the development of validated diagnostic, prognostic, and monitoring indicators stem from limited sample sizes. The combination of multiple clinical, biofluid, and imaging biomarkers is likely to increase the accuracy of mathematical modeling and contribute to optimized clinical trial designs.","authors":["Vincent Grollemund","Pierre-François Pradat","Giorgia Querin","Francois Delbot"],"meta":["February 2019Frontiers in Neuroscience 13","DOI:10.3389/fnins.2019.00135","Project: Machine Learning and e-santé"],"references":["330179883_Data-Driven_Based_Approach_to_Aid_Parkinson's_Disease_Diagnosis","326050110_TDP-43_as_a_potential_biomarker_for_amyotrophic_lateral_sclerosis_A_systematic_review_and_meta-analysis","325762711_Unraveling_the_Complexity_of_Amyotrophic_Lateral_Sclerosis_Survival_Prediction","331476185_Medical_Image_Synthesis_with_Context-Aware_Generative_Adversarial_Networks","329073073_A_Brief_Survey_on_Random_Forest_Ensembles_in_Classification_Model_Proceedings_of_ICICC_2018_Volume_2","327276141_A_Dynamic_Gradient_Boosting_Machine_Using_Genetic_Optimizer_for_Practical_Breast_Cancer_Prognosis","326746419_P48_Progression_of_cerebellar_involvement_in_amyotrophic_lateral_sclerosis_as_seen_by_SUIT_CAT12_voxel-based_morphometry_and_D50_disease_modelling","326376220_Deconstructing_progression_of_amyotrophic_lateral_sclerosis_in_stages_a_Markov_modeling_approach","325560522_Multicenter_validation_of_18_F-FDG_PET_and_support-vector_machine_discriminant_analysis_in_automatically_classifying_patients_with_amyotrophic_lateral_sclerosis_versus_controls","325517330_Progress_and_new_frontiers_in_biomarkers_for_amyotrophic_lateral_sclerosis"]}