{"id":"331216044_When_an_optimal_dominating_set_with_given_constraints_exists","abstract":"A dominating set is a set S of vertices in a graph such that every vertex not in S is adjacent to a vertex in S. In this paper, we consider the set of all optimal (i.e. smallest) dominating sets S, and ask of the existence of at least one such set S with given constraints. The constraints say that the number of neighbors in S of a vertex inside S must be in a given set ρ, and the number of neighbors of a vertex outside S must be in a given set σ. For example, if ρ is [1,k], and σ is the nonnegative integers, this corresponds to “[1,k]-domination.”\nFirst, we consider the complexity of recognizing whether an optimal dominating set with given constraints exists or not. We show via two different reductions that this problem is NP-hard for certain given constraints. This, in particular, answers a question of [M. Chellali et al., [1,2]-dominating sets in graphs, Discrete Applied Mathematics 161 (2013) 2885–2893] regarding the constraint that the number of neighbors in the set be upper-bounded by 2. We also consider the corresponding question regarding “total” dominating sets.\nNext, we consider some well-structured classes of graphs, including permutation and interval graphs (and their subfamilies), and determine exactly the smallest k such that for all graphs in that family an optimal dominating set exists where every vertex is dominated at most k times. We also consider the problem for trees (with implications for chordal and comparability graphs) and graphs with bounded “asteroidal number”.","authors":["Omid Etesami","Narges Ghareghani","Michel Habib","Mohammadreza Hooshmandasl"],"meta":["February 2019Theoretical Computer Science 780","DOI:10.1016/j.tcs.2019.02.012"],"references":["261187028_Faster_algorithms_for_vertex_partitioning_problems_parameterized_by_clique-width","236260582_New_width_parameters_of_graphs","289606301_1_2-sets_and_1_2-total_Sets_in_Trees_with_Algorithms","280688730_Algorithms_for_vertex_partitioning_problems_on_partial_-trees","264955342_All_parity_realizable_trees","246925786_Neighborhood_Domination_with_Parity_Restriction_in_Graphs","243769981_Domination_in_Graphs_Advanced_Topics","242619830_Fundamentals_of_Domination_in_Graphs","242402935_Vertex_Partitioning_Problems_Characterization_Complexity_and_Algorithms_on_Partial_k-Trees","236260578_Fast_dynamic_programming_for_locally_checkable_vertex_subset_and_vertex_partitioning_problems"]}