{"id":"331292845_Sentiment_analysis_of_Kazakh_text_and_their_polarity","abstract":"Sentiment analysis is one of the most important and interesting tasks in natural languages. A number of resources and tools have been developed for sentiment analysis of English, Turkish, Russian and other languages. Unfortunately, there were no data and tools available for sentiment analysis in Kazakh. The Dictionary of Kazakh sentiment words has been created during this study. In this work, we described the rule-based method using a dictionary of emotional words for sentiment analysis of texts in the Kazakh language, based on the morphological rules and ontological model. We studied the texts in Kazakh and determined the parts of speech that define the text mood. Based on the conducted studies, a lot of phrases were identified as determining the text polarity. This paper is an extended version of the paper published in [in: Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), LNCS,2017, pp. 669-677]. In addition to the original material, the paper includes additional rules for determining sentiment on a 5-point scale.","authors":["Banu Yergesh","Gulmira Bekmanova","Altynbek Amiruly Sharipbay"],"meta":["February 2019","DOI:10.3233/WEB-190396"],"references":["323746790_Automatic_Detection_of_Online_Jihadist_Hate_Speech","311420923_Semantic_Sentiment_Analysis_in_Arabic_Social_Media","320829528_Sentiment_analysis_on_the_hotel_reviews_in_the_Kazakh_language","319048080_SEMO_a_semantic_model_for_emotion_recognition_in_web_objects","318399574_Ontology-Based_Sentiment_Analysis_of_Kazakh_Sentences","313735345_Emotion_Recognition_from_Scrambled_Facial_Images_via_Many_Graph_Embedding","313456493_Convolutional_MKL_Based_Multimodal_Emotion_Recognition_and_Sentiment_Analysis","313373645_Deep_learning_model_for_bilingual_sentiment_classification_of_short_texts","311621730_Web-based_similarity_for_emotion_recognition_in_web_objects","311168691_On_One_Approach_of_Solving_Sentiment_Analysis_Task_for_Kazakh_and_Russian_Languages_Using_Deep_Learning"]}