{"id":"331398668_Gameful_Experience_Questionnaire_GAMEFULQUEST_an_instrument_for_measuring_the_perceived_gamefulness_of_system_use","abstract":"In this paper, we present the development and validation of an instrument for measuring users' gameful experience while using a service. Either intentionally or unintentionally , systems and services are becoming increasingly gamified and having a gameful experience is progressively important for the user's overall experience of a service. Gamification refers to the transformation of technology to become more game-like, with the intention of evoking similar positive experiences and motivations that games do (the gameful experience) and affecting user behavior. In this study, we used a mixed-methods approach to develop an instrument for measuring the gameful experience. In a first qualitative study, we developed a model of the gameful experience using data from a questionnaire consisting of open-ended questions posed to users of Zombies, Run!, Duolingo, and Nike+ Run Club. In a second study, we developed the instrument and evaluated its dimensionality and psycho-metric properties using data from users of Zombies, Run! (N = 371). Based on the results of this second study, we further developed the instrument in a third study using data from users of Duolingo (N = 507), in which we repeated the assessment of dimensionality and psychometric properties, this time including confirmation of the model. As a result of this work, we devised GAMEFULQUEST, an instrument that can be used to model and measure an individual user's gameful experience in systems and services, which can be used for user-adapted gamification and for informing user-modeling research within a gamification context.","authors":["Johan Högberg","Juho Hamari","Erik Wästlund"],"meta":["July 2019User Modeling and User-Adapted Interaction 29(2)","DOI:10.1007/s11257-019-09223-w"],"references":["327098420_Systematic_Review_and_Validation_of_the_Game_Experience_Questionnaire_GEQ_-_Implications_for_Citation_and_Reporting_Practice","324831143_Towards_Customizing_Gameful_Systems_by_Gameful_Design_Elements","322689691_Gamification_quantified-self_or_social_networking_Matching_users'_goals_with_motivational_technology","318330289_A_Gamified_System_for_Influencing_Healthy_E-commerce_Shopping_Habits","317687382_TOWARDS_ADAPTIVE_GAMIFICATION_A_SYNTHESIS_OF_CURRENT_DEVELOPMENTS","317419636_Determining_Parallel_Analysis_Criteria","316653774_Towards_Personality-driven_Persuasive_Health_Games_and_Gamified_Systems","327275274_Defining_Gameful_Experience_as_a_Psychological_State_Caused_by_Gameplay_Replacing_the_Term_'Gamefulness'_with_Three_Distinct_Constructs","327119108_Systematic_Review_and_Validation_of_the_Game_Experience_Questionnaire_GEQ_-_Implications_for_Citation_and_Reporting_Practice","325401721_Gameful_Experience_in_Gamification_Construction_and_Validation_of_a_Gameful_Experience_Scale_GAMEX"]}