{"id":"331301103_Intrusion_Detection_Using_Mouse_Dynamics","abstract":"Compared to other behavioural biometrics, mouse dynamics is a less explored area. General purpose data sets containing unrestricted mouse usage data are usually not available. The Balabit data set was released in 2016 for a data science competition which, despite the few users covered, can be considered the first adequate publicly available data set. This paper presents a performance evaluation study on this data set for impostor detection. The existence of very short benchmark test sessions makes this data set challenging. Raw data were segmented into mouse actions, such as: mouse move, point and click and drag and drop, then several features were extracted. Mouse data is not sensitive, therefore it is possible to collect negative mouse dynamics data and to use two-class classifiers. Impostor detection performance was measured using decisions based on several actions. The best performance of 0.92 Area Under Curve (AUC) was obtained on the benchmark test sessions of the data set. Drag and drop mouse actions proved to be the best actions for impostor detection despite the fact that this type of action represented only 10% of the data set.","authors":["Margit Antal","Elod Egyed-Zsigmond"],"meta":["February 2019IET Biometrics","DOI:10.1049/iet-bmt.2018.5126","Project: Behavioural Biometrics"],"references":["322986321_Recognition_of_web_users_with_the_aid_of_biometric_user_model","309463613_Keystroke_Biometrics_Ongoing_Competition","301331448_An_Efficient_User_Verification_System_Using_Angle-Based_Mouse_Movement_Biometrics","312752328_Dynamic_User_Authentication_Based_on_Mouse_Movements_Curves","305054675_Mouse_Clicks_Can_Recognize_Web_Page_Visitors","286195988_Usage_of_computer_mouse_characteristics_for_identification_in_web_browsing","282177517_Using_Mouse_Dynamics_to_Assess_Stress_During_Online_Exams","281624252_Performance_evaluation_of_continuous_authentication_systems","279054322_An_Evaluation_of_One-Class_and_Two-Class_Classification_Algorithms_for_Keystroke_Dynamics_Authentication_on_Mobile_Devices","267440007_Game-Theoretic_Energy_Trading_Network_Topology_Control_for_Electric_Vehicles_in_Mobile_Smart_Grid"]}