{"id":"331385030_Yo_te_cito_tu_me_citas_la_importancia_de_las_referencias","abstract":"En 1955, el lingüista norteamericano Eugene Garfield fundó el Institute for Scientific Information (ISI). Su idea original fue establecer un listado de las mejores publicacio-nes seriadas que reuniera en uno solo todos los campos de la ciencia. La idea no era completamente nueva; el Index Medicus-un listado de publicaciones médicas, predecesor de Medline y de Pubmed-, había sido fundado en Inglaterra en 1872 (1). Pero esta nueva creación de Garfield, que bautizó con el nombre Science Citation Index (SCI), no solo fue original en la amplitud del conocimiento que abarcaba, sino en el mecanismo que empleó para seleccionar las revistas que entrarían a su índice. La idea que haría a Garfield famoso y poderoso (bueno, y rico, ya que ISI fue vendida en 1982 a la multinacional Thomson Reuters por 210 millones de dólares) fue la de determinar la importancia de las revistas basándose en el número de veces que fueran citadas (2). EL FACTOR DE IMPACTO Y así nació no solo el factor de impacto (impact factor), sino también la bibliometría, la disciplina para la evaluación cuantitativa, y de alguna manera cualitativa, de la producción científica. Por muchos años el factor de impacto, que es el número de veces que en promedio cada artículo de una revista es citado en los dos años siguientes a su publicación, fue el único indicador bibliométrico. Con este número, calculado cada año y publicado por ISI en el mes de agosto, se hacían los rankings de todas las revistas del SCI, disciplina por disciplina. Desde el principio, el factor de impacto recibió muchos cues-tionamientos. ¿Por qué dos años? Hay disciplinas en las que la vigencia de los datos es corta, y los conocimientos cambian con rapidez, así como hay otras en las que la importancia de una nueva hipótesis toma años en recibir reconocimiento, y su efecto se puede prolongar mucho más en el futuro. El factor de impacto no tuvo eso en cuenta. Aquí las únicas citas que se cuentan son las que aparezcan en revistas que estén indexadas en el SCI (en donde los países de medianos y bajos ingresos están sistemáticamente excluidos). El indicador no ajusta por las autocitaciones (ya sea cuando una revista, o un autor, se citan a sí mismos), ni por la importancia de la revista en la que se hace la citación (no es lo mismo ser citado en Lancet que en… por ejemplo, Acta Neurológica Colombiana). A pesar de esas limitaciones, el factor de impacto se man-tuvo durante decenios como el indicador bibliométrico principal , casi el único (aparte del recuento del número absoluto de publicaciones). Pero con la llegada del siglo XXI, las cosas cambiaron. En 2004, la multinacional de las publicaciones científicas Elsevier introdujo su base de datos y sistema de análisis bibliométrico Scopus (que vino a complementar y en gran medida reemplazar a Embase, que solo se limitaba a publicaciones biomédicas). Scopus se alió con Scimago, un consorcio de universidades españolas, y en diciembre de ese año introdujeron otro indicador: el Scimajo Journal Ranking (SJR). EL SJR controla por autocitaciones, y pondera las cita-ciones de acuerdo con el SJR de la revista en la cual aparece la citación. Además, toma no dos, sino tres años como ventana, y lo hace de manera retrospectiva, así: mientras que el factor de impacto de 2014 cuenta las veces que la revista fue citada en 2015 y 2016, el SJR de 2017 incluye las citaciones de los tres años anteriores, en este ejemplo, 2014, 2015 y 2016. Así como el factor de impacto solo contabiliza citaciones en revistas del SCI (hoy analizada a través del portal Web of Science, que para la fecha incluye 12.298 títulos), el SJR solo considera citaciones en revistas indexadas en Scopus (que incluye 34.171 títulos). LOS RANKINGS DE LAS REVISTAS Además de calcular el SJR para cada revista, Scimago produce unos rankings de las revistas por disciplina, lo que permite clasificarlas en cuatro categorías que, en orden des-cendente se designan de Q1 a Q4. Así, por ejemplo, bajo la clasificación \"Neurology (clinical)\" aparecen 359 revistas Yo te cito tú me citas: la importancia de las referencias I cite you, you cite me: the importance of references","authors":["Diego Rosselli"],"meta":["February 2019Acta Neurológica Colombiana 35(1)","DOI:10.22379/24224022225"],"references":["328086436_Navegando_por_mares_inciertos_el_futuro_de_las_revistas_cientificas_en_Colombia","322192135_Una_nueva_etapa_de_Publindex_Dolores_de_crecimiento","313743397_Publindex_Mas_que_un_proceso_de_indexacion","301554444_The_language_of_biomedical_publications","7380639_The_History_and_Meaning_of_the_Journal_Impact_Factor"]}