{"id":"331344326_Mejorando_las_posibilidades_de_aprender_a_programar_ampliacion_del_robot_educativo_Multiplo_N6_MAX_a_Frankestito","abstract":"Se considera que la formación en conceptos fundamentales de Ciencias de la Computación es prioritaria para ampliar las posibilidades de comprender e intervenir mejor el mundo moderno. La robótica educativa es un dispositivo metodológico ampliamente difundido como ambiente para la enseñanza de la disciplina a estudiantes sin formación previa en la temática. \n\nFrankestito, es el robot educativo desarrollado por la Facultad de Informática con capacidad de visión y comunicación vía wireless. \nLa construcción de aprendizajes sobre programación implica, entre otras actividades, observar de comportamiento de las estructuras de programación durante la ejecución del programa. El proceso de revisión del código como momento ligado a mejorar las posibilidades de aprender requiere implementar la interacción con los robots educativos durante la ejecución de programas. Por otro lado, integrar funcionalidades de visión a los robots educativos amplía las posibilidades de abordar la enseñanza de aspectos más complejos. \n\nEn este trabajo se presentan las modificaciones realizadas al robot educativo Multiplo N6 Max con intención de dotarlo con las capacidades de visión y comunicación vía wireless presentes en Frankestito y un grupo de experiencias realizadas con el robot en actividades de Extensión Universitaria en las que participa la Facultad de Informática.","authors":["Rafael Zurita","Juan de la Fuente","Martín Bucarey","Daiana Bonet"],"meta":["June 2017","Conference: Tecnología en Educación & Educación en TecnologíaAt: Universidad Nacional de la Matanza, San Justo, Buenos Aires, Argentina.","Project: AGENTES INTELIGENTES. MODELOS FORMALES Y APLICACIONES PARA LA EDUCACIÓN."],"references":["343364402_Running_on_Empty_the_Failure_to_Teach_K--12_Computer_Science_in_the_Digital_Age","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas"]}