{"id":"331340619_Analysing_discussion_forum_data_a_replication_study_avoiding_data_contamination","abstract":"The widespread use of online discussion forums in educational settings provides a rich source of data for researchers interested in how collaboration and interaction can foster effective learning. Such online behaviour can be understood through the Community of Inquiry framework, and the cognitive presence construct in particular can be used to characterise the depth of a student's critical engagement with course material. Automated methods have been developed to support this task, but many studies used small data sets, and there have been few replication studies.\nIn this work, we present findings related to the robustness and generalisability of automated classification methods for detecting cognitive presence in discussion forum transcripts. We closely examined one published state-of-the-art model, comparing different approaches to managing unbalanced classes in the data. By demonstrating how commonly-used data preprocessing practices can lead to over-optimistic results, we contribute to the development of the field so that the results of automated content analysis can be used with confidence.","authors":["Elaine Farrow","Johanna D Moore","Dragan Gasevic"],"meta":["March 2019","DOI:10.1145/3303772.3303779","Conference: LAK19"],"references":["326999572_Automated_Analysis_of_Cognitive_Presence_in_Online_Discussions_Written_in_Portuguese","325263772_Replicating_MOOC_Predictive_Models_at_Scale","323851103_On_feature_selection_protocols_for_very_low-sample-size_data","291445101_Facts_are_more_important_than_novelty_Replication_in_the_educational_sciences","283463324_Structure_Matters_Adoption_of_Structured_Classification_Approach_in_the_Context_of_Cognitive_Presence_Classification","319030263_Persistence_Patterns_in_Massive_Open_Online_Courses_MOOCs","317004224_MOOC_Dropout_Prediction_How_to_Measure_Accuracy","293479059_Persistence_Patterns_in_Massive_Open_Online_Courses_MOOCs","286069528_Automated_evaluation_of_text_and_discourse_with_Coh-Metrix","285624341_Assessing_discussion_forum_participation_In_search_of_quality"]}