{"id":"331362529_Edge_computing_A_survey","abstract":"In recent years, the Edge computing paradigm has gained considerable popularity in academic and industrial circles. It serves as a key enabler for many future technologies like 5G, Internet of Things (IoT), augmented reality and vehicle-to-vehicle communications by connecting cloud computing facilities and services to the end users. The Edge computing paradigm provides low latency, mobility, and location awareness support to delay-sensitive applications. Significant research has been carried out in the area of Edge computing, which is reviewed in terms of latest developments such as Mobile Edge Computing, Cloudlet, and Fog computing, resulting in providing researchers with more insight into the existing solutions and future applications. This article is meant to serve as a comprehensive survey of recent advancements in Edge computing highlighting the core applications. It also discusses the importance of Edge computing in real life scenarios where response time constitutes the fundamental requirement for many applications. The article concludes with identifying the requirements and discuss open research challenges in Edge computing.","authors":["Wazir Zada Khan","Ejaz Ahmed","Saqib Hakak","Ibrar Yaqoob"],"meta":["February 2019Future Generation Computer Systems 97","DOI:10.1016/j.future.2019.02.050"],"references":["331446173_Data_and_Privacy_Getting_Consumers_to_Trust_Products_Enabled_by_the_Internet_of_Things","330984511_Context-Awareness_Enhances_5G_Multi-Access_Edge_Computing_Reliability","330301833_Complex_Attack_Linkage_Decision-Making_in_Edge_Computing_Networks","330009592_Blockchain_for_AI_Review_and_Open_Research_Challenges","331443619_Cloud-assisted_gamification_for_education_and_learning_-_Recent_advances_and_challenges","330592108_Integrated_Blockchain_and_Edge_Computing_Systems_A_Survey_Some_Research_Issues_and_Challenges","330423741_How_we_created_edge_computing","330372344_An_Edge-Computing_Based_Architecture_for_Mobile_Augmented_Reality","330327893_Satellite_Mobile_Edge_Computing_Improving_QoS_of_High-Speed_Satellite-Terrestrial_Networks_Using_Edge_Computing_Techniques","329664956_Data-Aware_Task_Allocation_for_Achieving_Low_Latency_in_Collaborative_Edge_Computing"]}