{"id":"331394303_Self-calibration_of_in_situ_monoscopic_deflectometric_measurement_in_precision_optical_manufacturing","abstract":"Accurate in situ measurement of complex optical surfaces is desired for precision manufacturing, and deflectometry is a promising measuring method. However, deflectometry’s measurement accuracy depends heavily on the geometric calibration’s reliability. Existing calibration methods suffer from the limitations of low efficiency, complicated operations, and expensive equipment. Therefore, a self-calibration method is proposed for the monoscopic deflectometry in order to determine the camera and screen positions. A flat mirror without markers, rather than high-precision metrological instruments, is employed to assist with the self-calibration work, and a re-projection model is adopted in order to trace the rays from the screen to the camera. Numerical optimization is performed on the global parameters—including the camera intrinsic parameters, the screen intrinsic parameters, and the geometric transformations—in order to improve the geometric calibration’s reliability. This self-calibration method only requires that four images be captured, hereby reducing the operating complexity and improving the measuring efficiency. Experiments demonstrate that the re-projection error can be significantly decreased, and also that the measuring accuracy of specular surfaces is comparable to high-precision interferometry.","authors":["Xueyang Xu","Xiangchao Zhang","Zhenqi Niu","Wei Wang"],"meta":["March 2019Optics Express 27(5):7523-7536","DOI:10.1364/OE.27.007523","Projects: High-Precision In-situ Deflectometric Measurement of Optical Freeform Surfaces  (NSFC 51875107)the National Natural Science Foundation of China under Grant No. 61205132Reference fitting algorithms for aspheric and freeform surfaces (15SIB01: FreeFORM)"],"references":["326683085_Enhancement_of_measurement_accuracy_of_optical_stereo_deflectometry_based_on_imaging_model_analysis","319404061_Full-field_3D_shape_measurement_of_discontinuous_specular_objects_by_direct_phase_measuring_deflectometry","309580748_Modal_phase_measuring_deflectometry","281778275_Iterative_optimization_calibration_method_for_stereo_deflectometry","281139793_High-accuracy_aspheric_x-ray_mirror_metrology_using_Software_Configurable_Optical_Test_Systemdeflectometry","273561446_Aspheric_and_freeform_surfaces_metrology_with_software_configurable_optical_test_system_A_computerized_reverse_Hartmann_test","322550167_3D_shape_measurement_of_discontinuous_specular_objects_based_on_advanced_PMD_with_bi-telecentric_lens","317574793_Three-dimensional_shape_measurement_with_modal_phase_measuring_deflectometry","283887374_Flexible_geometrical_calibration_for_fringe-reflection_optical_three-dimensional_shape_measurement","275102476_Modal_wavefront_reconstruction_from_its_gradient"]}