{"id":"331354228_THE_CHALLENGES_AND_PROBLEMS_FACED_BY_STUDENTS_IN_THE_EARLY_STAGE_OF_WRITING_RESEARCH_PROJECTS_IN_L2_UNIVERSITY_OF_BISHA_SAUDI_ARABIA","abstract":"Research, by its nature, is a critical challenging task requires in depth knowledge of the subject matter, planning, care, and hard work. From the students' point of view, this paper attempts to explore the challenges that are faced by undergraduates when they are writing proposals and research projects at the early stages. The study target group comprised undergraduates in the final year in the College of Science and Arts, Al-Namas, University of Bisha, Saudi Arabia. Around 60 subjects participated in this study and they were from Department of English and Department of Computer Science who conducted their research projects in English as Second Language (ESL). The Research tools of the study include questionnaire and informal interviews with students and teachers of the target groups. Clearly, the results from study showed that around 70 % of the participants who are writing research or conducting research projects in English is one of the predominant challenges for them. Around 50% prefer to conduct their research in L1. The study explored various and common challenges/difficulties during writing the research proposals and projects such as: difficulty in deciding the topic for research, lack of good knowledge of the methodology, inability of finding modern, specialized and related references, lack of interest in research, lack of understanding of the subject matter, lack of time, and research guiding. The study also attempts to give some suggestions/recommendations for developing the process of writing research proposals and research projects.","authors":["Fawaz Qasem","Elrasheed Ismail M. Zayid"],"meta":["January 2019","DOI:10.5281/zenodo.2557036"],"references":["324135965_Common_Mistakes_Committed_and_Challenges_Faced_in_Research_Proposal_Writing_by_University_of_Zambia_Postgraduate_Students","317495013_A_Training_Program_to_Enhance_Postgraduate_Students'_Research_Skills_in_Preparing_a_Research_Proposal_in_the_Field_of_Curriculum_and_Instruction_Methods_of_Arabic_Language","297120710_ANALYSIS_OF_RESEARCH_PROPOSALS_AND_CHALLENGES_FACED_BY_POSTGRADUATE_TRAINEES_IN_INTERNAL_MEDICINE_AND_ALLIED_DISCIPLINES_DURING_FELLOWSHIP_TRAINING_PROGRAMME","274704333_An_investigation_on_the_language_anxiety_and_fear_of_negative_evaluation_among_Turkish_EFL_Learners","268361605_Challenges_of_teaching_English_in_the_Arab_world_Why_can't_EFL_programs_deliver_as_expected","321712382_Writing_Anxiety_EFL_Postgraduate_Students_Writing_Research_Papers_in_English","304582437_Students'_writing_from_sources_for_academic_purposes_A_synthesis_of_recent_research","272688583_Saudi_English-Major_Undergraduates'_Academic_Writing_Problems_A_Taif_University_Perspective","272495170_Research_Methodology_Methods_Techniques","267772429_Guidelines_for_Writing_Research_Proposals_and_Dissertations"]}