{"id":"331301766_Using_GitHub_in_the_Classroom_Predicts_Student_Learning_Outcomes_and_Classroom_Experiences_Findings_from_a_Survey_of_Students_and_Teachers","abstract":"GitHub is a widely-used software development platform that supports version control, collaborative development, and project hosting. Currently, an estimated 18,000 educators use GitHub in programming classrooms. Depending on how GitHub is implemented in the classroom, students may rely on GitHub for activities such as, submitting assignments, collaborating on group projects, and receiving feedback. Despite GitHub's growing presence in programming classrooms, to date, few studies have explored how GitHub and the design of its implementation shape students' learning outcomes and classroom experiences. Building on previous research, we investigated how students in classrooms that used GitHub (GitHub classrooms), as opposed to classrooms that did not use GitHub (non-GitHub classrooms), differed across key variables. We surveyed 7530 students and 300 educators from GitHub and non-GitHub classrooms. Overall, we found that using GitHub in the classroom predicted better learning outcomes and classroom experiences. For example, students felt more prepared for the future, and they felt a greater sense of belonging in the classroom and in the field. Importantly, the design of implementation affected learning outcomes. For example, of the students who used GitHub in the classroom and received instructor feedback, those who received (versus did not receive) feedback via GitHub benefited more from the feedback. We discuss best practices for maximizing benefits to student learning when implementing GitHub in the classroom, study limitations, and future research directions. Our research is a step towards understanding how GitHub, a tool with a growing presence in programming classrooms, impacts students' learning experiences.","authors":["Courtney Hsing","Vanessa Gennarelli"],"meta":["February 2019","DOI:10.1145/3287324.3287460","Conference: the 50th ACM Technical Symposium"],"references":["350328002_The_Challenges_and_Opportunities_of_Designing_AR_to_Support_Complex_Problem_Solving","264865210_Getting_Ready_for_the_Real_World_Student_Perspectives_on_Bringing_Industry_Collaboration_into_the_Classroom","260486288_Considering_the_Role_of_Affect_in_Learning_Monitoring_Students'_Self-Efficacy_Sense_of_Belonging_and_Science_Identity","243774262_Feedback_and_Self-Regulated_Learning_A_Theoretical_Synthesis","319523471_A_sense_of_belonging_Improving_student_retention","318819578_Cultivating_a_sense_of_belonging_in_part-time_students","305067442_Using_GitHub_in_the_classroom_-_a_collaborative_learning_experience","303296557_Student_experiences_using_GitHub_in_software_engineering_courses_a_case_study","300918101_The_Emergence_of_GitHub_as_a_Collaborative_Platform_for_Education","263081388_Supporting_and_structuring_contributing_student_pedagogy_in_Computer_Science_curricula","257925911_Feedback_and_self-regulated_learning_A_therethical_synthesis","254346913_Sense_of_Belonging_in_College_Freshmen_at_the_Classroom_and_Campus_Levels","239060654_Self-Efficacy_Beliefs_in_Academic_Settings","51738975_Mere_Belonging_The_Power_of_Social_Connections"]}