{"id":"331479045_Artificial_Intelligence_in_Diagnosing_Tuberculosis_A_Review","abstract":"Tuberculosis (TB) is among top ten causes of deaths worldwide. It is the single most cause of deaths by an infectious disease and is ranked 2nd only after the HIV/AIDS. In third world countries, the diagnosis of TB is done through conventional methods. To diagnostic results are obtain from conventional methods such as blood, culture, sputum and biopsies. They are tedious as well as take long time like 1-2 weeks or maybe evenmore. Therefore, to lower the detection time and raise the accuracy of diagnosis several researches have been carried out. In the past fifty years, due to the advanced and sophisticated technologies, in medical as well as computer science fields, have paved a way to utilize the essence of both the areas. In Artificial Intelligence (AI) various Machine Learning (ML) algorithms have furthered the interests in Computer-aided Detection (CADe) and Diagnosis (CADx) methods. These methodologies assist in medical field for diagnosing the diseases through clinical signs and symptoms as well as radiological images of the patient. They have been implemented for the diagnosis of TB. Advances in AI algorithms, has unveiled great promises in identifying the presence and absence of TB. As of late, many attempts have been made to formulate the strategies to increase the classification accuracy of TB diagnosis using the AI and machine learning approach. This review paper, aims to describes the diverse AI approaches employed in the diagnosis of TB.","authors":["Syeda Meraj","Razali Yaakob","Azreen Azman","Siti Nuralain Mohd Rum"],"meta":["January 2019International Journal on Advanced Science Engineering and Information Technology 9(1):81","DOI:10.18517/ijaseit.9.1.7567"],"references":["317934321_A_Framework_for_Designing_the_Architectures_of_Deep_Convolutional_Neural_Networks","317230543_Abnormality_Detection_and_Localization_in_Chest_X-Rays_using_Deep_Convolutional_Neural_Networks","314139647_Heading_toward_Artificial_Intelligence_20","313829860_Intraocular_Manifestations_of_Mycobacterium_tuberculosis_A_Review_of_the_Literature","319945373_Acquaintance_to_Artificial_Neural_Networks_and_use_of_artificial_intelligence_as_a_diagnostic_tool_for_tuberculosis_A_review","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318919632_Pre-trained_convolutional_neural_networks_as_feature_extractors_for_tuberculosis_detection","316443493_Deep_Learning_at_Chest_Radiography_Automated_Classification_of_Pulmonary_Tuberculosis_by_Using_Convolutional_Neural_Networks","316261702_A_brief_history_of_tuberculosis_in_the_Czech_Lands","316087262_Improving_Tuberculosis_Diagnostics_using_Deep_Learning_and_Mobile_Health_Technologies_among_Resource-poor_Communities_in_Peru"]}