{"id":"331451948_Fabricated_Truths_and_the_Pathos_of_Proximity_What_Would_be_a_Nietzschean_Philosophy_of_Contemporary_Technoscience","abstract":"In recent years, Nietzsche’s views on (natural) science attracted a considerable amount of scholarly attention. Overall, his attitude towards science tends to be one of suspicion, or ambivalence at least. My article addresses the “Nietzsche and science” theme from a slightly different perspective, raising a somewhat different type of question, more pragmatic if you like, namely: how to be a Nietzschean philosopher of science today? What would the methodological contours of a Nietzschean approach to present-day research areas (such as neuroscience, astrophysics, synthetic biology or climate studies) amount to? In other words, my paper reflects a shift of focus from author studies to extrapolation. The design of my article is as follows. I will start with the question (already widely discussed in the expert literature) to what extent Friedrich Nietzsche (a classical philologist by training) managed to familiarise himself with the natural sciences of his epoch. Subsequently, I will outline some basic methodological and conceptual ingredients of Nietzsche’s philosophy of science, focussing on core issues such as “genealogy”, “interpretation”, “enhancement” and “truth”. Next, I will elucidate Nietzsche’s genealogical methodology with the help of three case studies (three representative samples if you will) taken from Nietzsche’s writings and dealing with physiology, astronomy and neuro-psychology respectively. Finally, I will present the methodological contours of a Nietzschean understanding of contemporary technoscience.","authors":["Hub Zwart"],"meta":["September 2019Foundations of Science 24(3)","DOI:10.1007/s10699-019-09599-3","Project: Science and dialectics"],"references":["349687158_Nietzsche's_Anti-Scientistic_Naturalism","349687143_Wozu_Wissenschaft_Uberlegungen_zu_Fragen_der_Rangordnung_im_Wissenschaftsdiskurs_nach_Nietzsche","349686997_Nietzsche's_Naturalism_and_the_Falsification_Thesis","345910009_Nietzsches_Wissenschaftsphilosophie_Struktur_Wurzeln_Wirkungen","345896524_Ein_Problem_mit_Hornern_-_Nietzsche_als_Wissenschaftsphilosoph","345896293_Science_and_philosophy_in_Nietzsche's_Genealogy_of_Morality","345817247_Irritating_Experiments_Haller's_Concept_and_the_European_Controversy_on_Irritability_and_Sensibility_1750-90","344882030_The_little_independent_clockwork_Nietzsche_on_science_and_the_will","344830458_Nietzsches_hermeneutische_phunomenologische_Wissenschaftsphilosophie_Unzeitgemusse_Betrachtungen_zu_Altphilologie_und_Physiologie","344590996_Nietzsche's_Last_View_of_Science"]}