{"id":"331446379_Optimisation_du_service_d'urgences_a_l'aide_d'un_modele_de_simulation_efficace","abstract":"Introduction\nL’encombrement et la demande croissante des activités des services d’urgences des hôpitaux allongent le temps d’attente des patients et impacte l’usage optimal des ressources qui garantissent la qualité des soins. Structurellement, le service d’accueil des urgences de Troyes est adossé à la maison médicale de garde, avec une infirmière d’accueil et d’orientation, et différents circuits patients (court, long, entrées directes dans les services). Dans ce contexte local, nous avons développé une approche d’optimisation basée sur la simulation. Notre objectif est de tester et de valider plusieurs stratégies afin de minimiser le temps moyen d’attente et le temps de prise en charge et de planifier les ressources au Centre hospitalier de Troyes (CHT).\n\nMéthodes\nUn modèle de simulation à événements discrets est créé et développé sur le logiciel de simulation ARENA. Les prévisions d’arrivées journalières des patients sont prises en compte dans ce modèle, qui servira d’outil d’évaluation des performances des services d’urgences (temps moyen d’attente et temps de prise en charge des patients). Ce modèle de simulation est couplé avec une approche d’optimisation (algorithme génétique) visant à optimiser l’allocation des ressources humaines.\n\nRésultats\nL’écart entre les temps moyens d’attente réels et les temps de prise en charge et ceux simulés varie de 1 % à 9 %, un écart considéré comme acceptable pour validation. Sans aucun changement dans le nombre actuel de ressources humaines, notre algorithme génétique couplé avec le modèle de simulation peut réduire le temps d’attente et le temps de prise en charge respectivement de 12 minutes et 21 minutes. Les résultats sur l’impact de l’ajout de personnel médical et paramédical montrent que l’ajout d’une infirmière diminue de 25 minutes le temps moyen d’attente des patients.\n\nDiscussion/Conclusion\nNotre approche a prouvé qu’il était possible de réduire temps d’attente et temps de prise en charge en analysant et en évaluant différents scénarios associés à l’approche génétique afin d’optimiser les facteurs clés influençant la qualité des services d’urgences.","authors":["Ibtissem Chouba","Taha Arbaoui","Lionel Amodeo","Farouk Yalaoui"],"meta":["March 2019Revue d Épidémiologie et de Santé Publique 67:S86","DOI:10.1016/j.respe.2019.01.044"],"references":["320310451_Simulation-Based_Optimization_for_Improving_Hospital_Performance","319561839_Simulation-Based_Design_of_ED_Operations_with_Care_Streams_to_Optimize_Care_Delivery_and_Reduce_Length_of_Stay_in_the_Emergency_Department","303844829_Forecasting_the_Emergency_Department_Patients_Flow","281887778_Fitdistrplus_An_R_Package_for_Fitting_Distributions","222577768_Simulation_optimization_for_an_emergency_department_healthcare_unit_in_Kuwait","30869230_Handbook_Of_Genetic_Algorithms"]}