{"id":"331416792_Automated_Reconfiguration_of_Modular_Robots_Using_Robot_Manipulators","abstract":"Self-reconfigurability in modular robots is a challenging\ntask that usually requires complex module designs and\nalgorithms. To make the reconfigurability easier, unpowered\npermanent magnet-based modules can be reconfigured by an\nexternal robotic manipulator. These modules are, thereby, not\ndependent on each separate module’s inclusion of batteries\nand control circuitry since they can be reconfigured in their\nunpowered state, and the reconfiguration movements are not\nrestricted to the kinematic chain of the modular robot. In this\npaper, we discuss how we can utilize an active or passive gripper\nto assemble and disassemble modular robots. We furthermore\ndemonstrate that the use of fiducial markers allows the robot\narm to accurately pick and place the modules to reconfigure\nthe morphologies. The utilization of robotic arms and a visual\nfeedback system allows us to quickly create robot morphologies\nfrom modules, which can be evaluated in the real world and then\nreshaped using the same components. This technique is especially\nvaluable to enable the rapid generation and evaluation of robot\nmorphologies in the real world that would traditionally need to be\nreconstructed or reassembled with complex modules or complex\nattachment mechanisms.","authors":["Rodrigo Moreno","Frank Veenstra","David Silvera","Julian Franco"],"meta":["November 2018","DOI:10.1109/SSCI.2018.8628628","Conference: 2018 IEEE Symposium Series on Computational Intelligence (SSCI)","Project: Emerge"],"references":["321814072_A_decentralized_algorithm_for_assembling_structures_with_modular_robots","318374947_The_EMeRGE_modular_robot_an_open_platform_for_quick_testing_of_evolved_robot_morphologies","317005373_Automating_the_Incremental_Evolution_of_Controllers_for_Physical_Robots","300209386_Rapid_Evolution_of_Robot_Gaits","281389178_Morphological_Evolution_of_Physical_Robots_through_Model-Free_Phenotype_Development","264825550_A_Simplified_Approach_to_Realize_Cellular_Automata_for_UBot_Modular_Self-Reconfigurable_Robots","320812133_The_EMeRGE_modular_robot_an_open_platform_for_quick_testing_of_evolved_robot_morphologies","318697448_Modular_robot_using_helical_magnet_for_bonding_and_transformation","285599287_Introduction_to_Electrodynamics","265052601_An_evolution_friendly_modular_architecture_to_produce_feasible_robots"]}