{"id":"331490832_Finding_College_Student_Social_Networks_by_Mining_the_Records_of_Student_ID_Transactions","abstract":"Information about college students’ social networks plays a pivotal role in college students’ mental health monitoring and student management. While there have been many studies to infer social networks by data mining, the mining of college students’ social networks lacks consideration of homophily. College students’ social behaviors show significant homophily in the aspect of major and grade. Consequently, the inferred inter-major and inter-grade social ties will be erroneously omitted without considering such an effect. In this work, we aimed to increase the fidelity of the extracted networks by alleviating the homophily effect. To achieve this goal, we propose a method that combines the sliding time-window method with the hierarchical encounter model based on association rules. Specifically, we first calculated the counts of spatial–temporal co-occurrences of each student pair. The co-occurrences were acquired by the sliding time-window method, which takes advantage of the symmetry of the social ties. We then applied the hierarchical encounter model based on association rules to extract social networks by layer. Furthermore, we propose an adaptive method to set co-occurrence thresholds. Results suggested that our model infers the social networks of students with better fidelity, with the proportion of extracted inter-major social ties in entire social ties increasing from 0.89% to 5.45% and the proportion of inter-grade social ties rising from 0.92% to 4.65%.","authors":["Jing-Ya Xu","Tao Liu","Lin-Tao Yang","Mark Davison"],"meta":["March 2019Symmetry 11(3):307","DOI:10.3390/sym11030307"],"references":["326513130_Disciplinary_homogeneity_in_university_departments_following_the_Gelmini_law_an_exploratory_analysis_through_social_networks","317292668_Inferring_and_analysis_of_social_networks_using_RFID_check-in_data_in_China","315461588_Predicting_Academic_Performance_via_Semi-supervised_Learning_with_Constructed_Campus_Social_Network","276103402_Birds_of_a_Feather_A_Case_Study_of_Friendship_Networks_of_Mainland_Chinese_College_Students_in_Hong_Kong","275057725_Inferring_social_structure_from_temporal_data","271735150_Friendship_in_School_Gender_and_Racial_Homophily","321401609_Analysis_and_Data_Mining_of_Students'_Consumption_Behavior_Based_on_a_Campus_Card_System","313606501_Mining_Association_rules_between_sets_of_items_in_large_databases","304298558_Population_Behavior_Analysis_of_Chinese_University_Students_via_Digital_Campus_Cards","279233983_Indicators_for_Determining_Collaborative_Security_Level_in_Organizational_Environments"]}