{"id":"331474581_Deep_learning_for_time_series_classification_a_review","abstract":"Time Series Classification (TSC) is an important and challenging problem in data mining. With the increase of time series data availability, hundreds of TSC algorithms have been proposed. Among these methods, only a few have considered Deep Neural Networks (DNNs) to perform this task. This is surprising as deep learning has seen very successful applications in the last years. DNNs have indeed revolutionized the field of computer vision especially with the advent of novel deeper architectures such as Residual and Convolutional Neural Networks. Apart from images, sequential data such as text and audio can also be processed with DNNs to reach state-of-the-art performance for document classification and speech recognition. In this article, we study the current state-of-the-art performance of deep learning algorithms for TSC by presenting an empirical study of the most recent DNN architectures for TSC. We give an overview of the most successful deep learning applications in various time series domains under a unified taxonomy of DNNs for TSC. We also provide an open source deep learning framework to the TSC community where we implemented each of the compared approaches and evaluated them on a univariate TSC benchmark (the UCR/UEA archive) and 12 multivariate time series datasets. By training 8730 deep learning models on 97 time series datasets, we propose the most exhaustive study of DNNs for TSC to date.","authors":["Hassan Ismail Fawaz","Germain Forestier","Jonathan Weber","Lhassane Idoumghar"],"meta":["July 2019Data Mining and Knowledge Discovery 33(2)","DOI:10.1007/s10618-019-00619-1"],"references":["332310667_Cost-sensitive_convolutional_neural_networks_for_imbalanced_time_series_classification","330979222_A_deep_transfer_learning_approach_for_improved_post-traumatic_stress_disorder_diagnosis","330912050_Proximity_Forest_an_effective_and_scalable_distance-based_classifier_for_time_series","328760450_Transfer_learning_for_time_series_classification","334795549_Accurate_and_interpretable_evaluation_of_surgical_skills_from_kinematic_data_using_fully_convolutional_neural_networks","329396379_A_Deep_Reinforcement_Learning_Approach_for_Early_Classification_of_Time_Series","329160732_Detecting_and_interpreting_myocardial_infarction_using_fully_convolutional_neural_networks","328990475_A_Generative_Modeling_Approach_to_Limited_Channel_ECG_Classification","327629697_Evaluating_Surgical_Skills_from_Kinematic_Data_Using_Convolutional_Neural_Networks","327048119_Time_Series_Classification_With_Multivariate_Convolutional_Neural_Network"]}