{"id":"331474946_Um_panorama_do_ensino_superior_em_gestao_da_informacao_no_Brasil","abstract":"Resumo A importância da Gestão da Informação enquanto área de pesquisa e de mercado vêm se tornando cada vez mais clara e necessária sob os mais variados aspectos. No âmbito de suas contribuições e avanços, é notável a interdisciplinaridade com áreas como a Administração, Ciência da Informação, Ciência da Computação, além de outras, permitindo a concepção de metodologias, estratégicas e processos voltados a fomentar a inovação e o melhor uso da informação. Entretanto, a própria característica interdisciplinar da Gestão da Informação acaba por gerar diferentes visões e interpretações no que se refere ao conjunto básico de disciplinas que a compõe, como pode ser observado nos Projetos Pedagógicos dos cursos superiores de graduação no Brasil. Neste contexto, este artigo se propõe a tecer um panorama da Gestão da Informação no Brasil, através do desenvolvimento de uma análise exploratória, quantitativa e qualitativa, acerca dos cursos superiores nesta área, a fim de promover subsídios e dados para discussões sobre suas tendências e necessidades, apresentando resultados numéricos e grafos de similaridade entre termos, com base na utilização de métodos estatísticos e de classificação textual. Finalmente, são tecidas discussões sobre os perfis dos cursos com base nas análises realizadas, revelando particularidades e características de cada um deles, as quais fortalecem e compravam o caráter interdisciplinar da Gestão da Informação, e suas faces conectivas com outras áreas.","authors":["Douglas Farias Cordeiro","Katia Cassiano"],"meta":["December 2018Perspectivas em Ciência da Informação 23(4):205-220","DOI:10.1590/1981-5344/3617"],"references":["287823467_Gestao_da_Informacao_em_Portugal_formacao_mercado_e_perspectivas","284279891_Praticas_de_gestao_da_informacao_e_do_conhecimento_em_pequenas_e_medias_empresas_organizadas_em_rede_um_estudo_multicasos_na_industria_brasileira","257718771_Disciplinary_Perspectives_on_Information_Management","250991355_Um_modelo_de_gestao_da_informacao_para_aprendizagem_organizacional_em_projetos_empresariais","250990276_Ciencia_da_Informacao_como_area_do_conhecimento_abordagem_no_contexto_da_pesquisa_e_da_Pos-Graduacao_no_Brasil","305736330_Big_Data_From_Beginning_to_Future","292768188_Une_methodologie_d'analyse_des_donnees_textuelles_et_une_application_Aure1ia_de_G_de_Nerval","241644127_ALCESTE_Une_methodologie_d'analyse_des_donnees_textuelles_et_une_application_Aurelia_de_Gerard_de_NervalALCESTE_A_methodology_for_analyzing_textual_data_and_application_Aurelia_de_Gerard_de_Nerval"]}