{"id":"331424647_Teachers'_goals_predict_computational_thinking_gains_in_robotics","abstract":"Purpose\nComputational thinking (CT) is widely considered to be an important component of teaching generalizable computer science skills to all students in a range of learning environments, including robotics. However, despite advances in the design of robotics curricula that can teach CT, actual enactment in classrooms may often fail to reach this target. This study aims to understand whether the various instructional goals teachers’ hold when using these curricula may offer one potential explanation for disparities in outcomes.\n\nDesign/methodology/approach\nIn this study, the authors examine results from N = 206 middle-school students’ pre- and post-tests of CT, attitudinal surveys and surveys of their teacher’s instructional goals to determine if student attitudes and learning gains in CT are related to the instructional goals their teachers endorsed while implementing a shared robotics programming curriculum.\n\nFindings\nThe findings provide evidence that despite using the same curriculum, students showed differential learning gains on the CT assessment when in classrooms with teachers who rated CT as a more important instructional goal; these effects were particularly strong for women. Students in classroom with teachers who rated CT more highly also showed greater maintenance of positive attitudes toward programming.\n\nOriginality/value\nWhile there is a growing body of literature regarding curricular interventions that provide CT learning opportunities, this study provides a critical insight into the role that teachers may play as a potential support or barrier to the success of these curricula. Implications for the design of professional development and teacher educative materials that attend to teachers’ instructional goals are discussed.","authors":["Eben B Witherspoon","Christian D Schunn"],"meta":["February 2019Information and Learning Sciences 120(2)","DOI:10.1108/ILS-05-2018-0035","Project: Changing Cultures in Robotics Classrooms"],"references":["317644528_Assessment_Design_Patterns_for_Computational_Thinking_Practices_in_Secondary_Computer_Science_A_First_Look","304674511_Ensuring_Exemplary_Teaching_in_an_Essential_Discipline_Addressing_the_Crisis_in_Computer_Science_Teacher_Certification_-_Final_Report_of_the_CSTA_Teacher_Certification_Task_Force","321137502_Attending_to_structural_programming_features_predicts_differences_in_learning_and_motivation_in_a_virtual_robotics_programming_curriculum","321011977_Diagnosing_Learning_Goals_An_Often-Overlooked_Teaching_Competency","320679330_Developing_Computational_Thinking_through_a_Virtual_Robotics_Programming_Curriculum","310750355_Expectancy-value_theory_of_achievement_motivation","310743832_Ten_Lessons_for_Computer_Science_for_All","299518446_Teachers_and_science_curriculum_materials_where_we_are_and_where_we_need_to_go","295541247_Social_Cognitive_Predictors_of_Academic_Persistence_and_Performance_in_Engineering_Applicability_across_Gender_and_RaceEthnicity","291101669_Cognitive_Apprenticeship"]}