{"id":"331462641_The_flipped_learning_model_in_online_based_education_for_secondary_teachers","abstract":"The online-based model known as “flipped learning” raises new challenges that are different from those of face-to-face teaching. The flipped learning model enhances the active and autonomous learning of students, changes the relationships between them and with the teacher, and encourages innovation within the learning process. The following paper presents a descriptive, poll-based study after having implemented the model in the Curricular design course offered in two different departments, Mathematics and Technology and Computer Science, as part of the Master's Degree program in Secondary Education Teacher Training, taught online by the International University of La Rioja (UNIR). For this purpose, we have designed a learning model with a series of stages based on the events proposed by Gagné for the design of a teaching unit. In order to analyze the impact that the model has on student performance, the final grades obtained by the students are collected after individually designing a didactic unit, as required to demonstrate their learning, analyzing the difference between the control group and those participating in the designing experience. The results revolve around several axes, such as student satisfaction, the training they received, the perceived usefulness of the training received, the evaluation of the entire training process as it was carried out, and the performance achieved. This model ensures that the student is satisfied with and finds the usefulness of the training received, attains better academic performance and fosters very positive attitudes among the students as a whole.","authors":["María del Carmen Romero","Olga Buzón-García","Javier Tourón"],"meta":["March 2019Journal of Technology and Science Education 9(2):109","DOI:10.3926/jotse.435"],"references":["339339697_A_WHITE_PAPER_BASED_ON_THE_LITERATURE_REVIEW_TITLED_A_REVIEW_OF_FLIPPED_LEARNING","317634498_El_enfoque_flipped_learning_en_estudios_de_magisterio_percepcion_de_los_alumnos","314715867_Estudio_de_evidencias_de_aprendizaje_significativo_en_un_aula_bajo_el_modelo_Flipped_Classroom","299585125_Flipped_Learning_en_la_formacion_del_profesorado_de_secundaria_y_bachillerato_Formacion_para_el_cambio","299584811_Metodologias_Inductivas_El_desafio_de_ensenar_mediante_el_cuestionamiento_y_los_retos","281098986_The_flipped_classroom_Como_convertir_la_escuela_en_un_espacio_de_aprendizaje","298104704_How_flipping_the_classroom_can_improve_the_traditional_lecture_The_Chronicle_of_Higher_Education","286993943_Evidence_on_flipped_classrooms_is_still_coming_in","284883913_El_estudio_de_las_buenas_practicas_docentes_en_la_ensenanza_universitaria","277272218_El_modelo_docente_universitario_y_el_uso_de_nuevas_metodologias_en_la_ensenanza_aprendizaje_y_evaluacion"]}