{"id":"331474026_Leveraging_Machine_Learning_to_Extend_Ontology-Driven_Geographic_Object-Based_Image_Analysis_O-GEOBIA_A_Case_Study_in_Forest-Type_Mapping","abstract":"Ontology-driven Geographic Object-Based Image Analysis (O-GEOBIA) contributes to the identification of meaningful objects. In fusing data from multiple sensors, the number of feature variables is increased and object identification becomes a challenging task. We propose a methodological contribution that extends feature variable characterisation. This method is illustrated with a case study in forest-type mapping in Tasmania, Australia. Satellite images, airborne LiDAR (Light Detection and Ranging) and expert photo-interpretation data are fused for feature extraction and classification. Two machine learning algorithms, Random Forest and Boruta, are used to identify important and relevant feature variables. A variogram is used to describe textural and spatial features. Different variogram features are used as input for rule-based classifications. The rule-based classifications employ (i) spectral features, (ii) vegetation indices, (iii) LiDAR, and (iv) variogram features, and resulted in overall classification accuracies of 77.06%, 78.90%, 73.39% and 77.06% respectively. Following data fusion, the use of combined feature variables resulted in a higher classification accuracy (81.65%). Using relevant features extracted from the Boruta algorithm, the classification accuracy is further improved (82.57%). The results demonstrate that the use of relevant variogram features together with spectral and LiDAR features resulted in improved classification accuracy.","authors":["Sachit Rajbhandari","Jagannath Aryal","Jonathan Osborn","Arko Lucieer"],"meta":["March 2019Remote Sensing 11(5):503","DOI:10.3390/rs11050503"],"references":["321354869_Benchmarking_the_Applicability_of_Ontology_in_Geographic_Object-Based_Image_Analysis","320993970_Forest_Types_Classification_Based_on_Multi-Source_Data_Fusion","320929886_Geographic_object-based_image_analysis_GEOBIA_A_new_name_for_a_new_discipline","320505932_Evaluation_of_variable_selection_methods_for_random_forests_and_omics_data_sets","315931199_An_Object-Based_Semantic_Classification_Method_for_High_Resolution_Remote_Sensing_Imagery_Using_Ontology","311695249_Data_Fusion_and_Remote_Sensing_-_An_Ever-Growing_Relationship","326338097_Pellet_A_Practical_OWL-DL_Reasoner","325280392_Employing_Ontology_to_Capture_Expert_Intelligence_within_GEOBIA_Automation_of_the_Interpretation_Process","324847568_The_semantic_web_and_computer_vision_old_AI_meets_new_AI","319393573_OWL_2_Web_Ontology_Language_Structural_Specification_and_Functional-Style_Syntax"]}