{"id":"331441307_The_phonographic_language_network_Using_network_science_to_investigate_the_phonological_and_orthographic_similarity_structure_of_language","abstract":"Orthographic effects in spoken word recognition and phonological effects in visual word recognition have been observed in a variety of experimental tasks, strongly suggesting that a close interrelationship exists between phonology and orthography. However, the metrics used to investigate these effects, such as consistency and neighborhood size, fail to generalize to words of various lengths or syllable structures, and do not take into account the more global similarity structure that exists between phonological and orthographic representations in the language. To address these limitations, the tools of Network Science were used to simultaneously characterize the phonological as well as orthographic similarity structure of words in English. In the phonographic network of language, links are placed between words that are both phonologically and orthographically similar to each other (e.g., words such as pant (/pænt/) and punt (/pʌnt/)). Conventional psycholinguistic experiments (auditory naming and auditory lexical decision) and an archival analysis of the English Lexicon Project (visual naming and visual lexical decision) were conducted to investigate the influence of 2 network science metrics derived from the phonographic network-phonographic degree and phonographic clustering coefficient-on spoken and visual word recognition. Results indicated a facilitatory effect of phonographic degree on visual word recognition, and a facilitatory effect of phonographic clustering coefficient on spoken word recognition. Implications of the present findings for theoretical models of spoken and visual word recognition are discussed. (PsycINFO Database Record (c) 2019 APA, all rights reserved).","authors":["Cynthia Siew","Michael S Vitevitch"],"meta":["March 2019Journal of Experimental Psychology General 148(3):475-500","DOI:10.1037/xge0000575"],"references":["325985221_The_orthographic_similarity_structure_of_English_words_Insights_from_network_science","322220972_The_origins_of_Zipf's_meaning-frequency_law","320036700_The_Influence_of_Closeness_Centrality_on_Lexical_Processing","312521185_Mixed_Effects_Models_are_Sometimes_Terrible","309725867_LmerTest_Tests_in_linear_mixed_effects_models","304992831_The_influence_of_2-hop_network_density_on_spoken_word_recognition","332862957_Scale-free_networks_in_phonological_and_orthographic_wordform_lexicons","316360101_lme4_Linear_mixed-effects_models_using_Eigen_and_S4","313609388_On_the_evolution_of_random_graphs","285873774_Sizing_up_the_Hoosier_mental_lexicon_Measuring_the_familiarity_of_20000_words"]}