{"id":"331403054_ZASTOSUVANNA_TEHNOLOGIJ_VIRTUALIZACII_UNIX-PODIBNIH_OPERACIJNIH_SISTEM_U_PIDGOTOVCI_BAKALAVRIV_INFORMATIKI","abstract":"Despite the widespread use of virtualization technologies in education the problem of individual selection of virtualization tools for teaching certain courses, including teaching operating systems to Bachelors of Computer Science, remains scarcely studied. Research of operating systems teaching process to Bachelors of Computer Science found a range of issues in using virtualization technologies. These are as listed: hardware and software failures; low performance of virtualized operating systems; lack of adapted instructions; dependence on specific computer laboratories; unequal conditions of independent work with virtualized operating systems. Comparison of Bachelors of Computer Science scores in Operating Systems course which included studying Linux and Windows operating systems and also Fundamentals of Operating Systems Theory, resulted in general lower level of learning outcomes in Linux compared to the ones of the entire academic subject. A survey of Ukrainian teachers of Operating Systems course shows a number of differences in teaching process. It includes differences in teachers’ experience of using virtualization technologies, variety of virtualization technologies applied during the course, factors estimation for selecting virtualization tools. The article proposes the methodology of using unix-like operating systems virtualization technologies in professional training of Bachelors of Computer Science based on the variable approach to using mentioned technologies. The approach involves combining several virtualization tools in the frames of one course of Operating Systems to meet specific features of teaching the course as well as individual students’ needs and ensures hardware and software fault tolerance. Didactic model underlying the proposed methodology is described in the article. Experimental results on methodology effectiveness are provided.","authors":["Oleg Spirin","Olena S. Holovnia"],"meta":["July 2018Information Technologies and Learning Tools 65(3):201","DOI:10.33407/itlt.v65i3.2055"],"references":["350204431_Theoretical_and_methodological_bases_of_designing_the_educational_institution_information_and_consulting_environment","325773468_IN_WHAT_WAY_SHOULD_MODERN_COMPUTER_SCIENCE_TEACHERS_IMPROVE_THEIR_TEACHING_SKILLS_TO_DEVELOP_STUDENTS'_KEY_AND_IC_COMPETENCE","344534833_Teaching_Operating_Systems_Concepts_with_Execution_Visualization","338364958_PROEKTUVANNA_ARHITEKTURI_HMARO-ORIENTOVANOGO_INFORMACIJNO-OSVITNOGO_SEREDOVISA_DLA_PIDGOTOVKI_MAJBUTNIH_FAHIVCIV_Z_INFORMACIJNIH_TEHNOLOGIJ","322522089_CLOUD_SERVICES_IN_EDUCATION","322501675_TECHNOLOGIES_OF_CLOUD_COMPUTING_ICT-OUTSOURCING_AND_NEW_FUNCTIONS_OF_ICT-DEPARTMENTS_OF_EDUCATIONAL_AND_SCIENTIFIC_INSTITUTIONS","321495667_VIRTUALIZATION_TECHNOLOGIES_SYSTEMATIZATION","311885652_Virtualization_issues_security_threats_and_solutions","262165850_Evaluation_of_Android_Dalvik_virtual_machine","261211153_Intrusion_detection_and_honeypots_in_nested_virtualization_environments"]}