{"id":"331586422_Human_impact_erodes_chimpanzee_behavioral_diversity","abstract":"Many animals show population specific behavioral variation, with chimpanzees (Pan troglodytes) exhibiting exceptionally high levels of behavioral diversity (1, 2). This diversity has been documented in a variety of contexts, including communication , thermoregulation and extractive foraging (table S1). Chimpanzees are also proficient tool-users, using sticks, leaves and stones to access honey, insects, meat, nuts and algae (table S1). Many of these behaviors are inferred to be socially learned and therefore cultural (2), although the influence of genetic and environmental variation cannot always be ruled out (3). Culture in chimpanzees is supported by the occurrence of local traditions irrespective of resource or tool abundance (1, 2), and controlled experiments demonstrating that naïve chimpanzees can socially learn new behaviors (4, 5). Moreover, new behaviors, or variants, are regularly discovered when observing previously unstudied populations (5) Chimpanzees possess a large number of behavioral and cultural traits among non-human species. The 'disturbance hypothesis' predicts that human impact depletes resources and disrupts social learning processes necessary for behavioral and cultural transmission. We used an unprecedented data set of 144 chimpanzee communities, with information on 31 behaviors, to show that chimpanzees inhabiting areas with high human impact have a mean probability of occurrence reduced by 88%, across all behaviors, compared to low impact areas. This behavioral diversity loss was evident irrespective of the grouping or categorization of behaviors. Therefore, human impact may not only be associated with the loss of populations and genetic diversity, but also affects how animals behave. Our results support the view that 'culturally significant units' should be integrated into wildlife conservation.","authors":["Hjalmar S. Kühl","Christophe Boesch","Lars Kulik","Fabian Haas"],"meta":["March 2019Science 363(6434)","DOI:10.1126/science.aau4532","Projects: Pan African Programme: The Cultured ChimpanzeeComoé Chimpanzee Conservation ProjectChimpanzee ecology, behaviour and culturePan African Chimpanzee Research Project, Max PlanK Institute of Evolutionary Research"],"references":["324764179_Guns_germs_and_trees_determine_density_and_distribution_of_gorillas_and_chimpanzees_in_Western_Equatorial_Africa","323155244_On_the_absence_of_a_correlation_between_population_size_and_'toolkit_size'_in_ethnographic_hunter-gatherers","319337223_brms_An_R_Package_for_Bayesian_Multilevel_Models_Using_Stan","318128798_The_Critically_Endangered_western_chimpanzee_declines_by_80","316652991_Extraction_of_honey_from_underground_bee_nests_by_central_African_chimpanzees_Pan_troglodytes_troglodytes_in_Loango_National_Park_Gabon_Techniques_and_individual_differences","344550789_Behavioural_Diversity_in_Pan","329907480_Statistical_Rethinking_A_Bayesian_Course_with_Examples_in_R_and_Stan","327224298_18_Cultural_Evolution_in_Chimpanzees_and_Humans","321610027_The_Chimpanzees_of_Bossou_and_Nimba","318392950_An_Introduction_to_Generalized_Linear_Models_Third_Edition"]}