{"id":"331537269_Efficiently_embedding_QUBO_problems_on_adiabatic_quantum_computers","abstract":"Adiabatic quantum computers like the D-Wave 2000Q can approximately solve the QUBO problem, which is an NP-hard problem, and have been shown to outperform classical computers on several instances. Solving the QUBO problem literally means solving virtually any NP-hard problem like the traveling salesman problem, airline scheduling problem, protein folding problem, genotype imputation problem, thereby enabling significant scientific progress, and potentially saving millions/billions of dollars in logistics, airlines, healthcare and many other industries. However, before QUBO problems are solved on quantum computers, they must be embedded (or compiled) onto the hardware of quantum computers, which in itself is a very hard problem. In this work, we propose an efficient embedding algorithm, that lets us embed QUBO problems fast, uses less qubits and gets the objective function value close to the global minimum value. We then compare the performance of our embedding algorithm to that of D-Wave’s embedding algorithm, which is the current state of the art, and show that our embedding algorithm convincingly outperforms D-Wave’s embedding algorithm. Our embedding approach works with perfect Chimera graphs, i.e., Chimera graphs with no missing qubits.","authors":["Prasanna Date","Robert Patton","Catherine D. Schuman","Thomas E Potok"],"meta":["March 2019Quantum Information Processing 18(4)","DOI:10.1007/s11128-019-2236-3"],"references":["317230420_Quadratic_Unconstrained_Binary_Optimization_Problem_Preprocessing_Theory_and_Empirical_Analysis","315835538_Optimizing_Adiabatic_Quantum_Program_Compilation_using_a_Graph-Theoretic_Framework","313354026_Investigating_TSP_Heuristics_for_Location-Based_Services","311842097_Identifying_the_minor_set_cover_of_dense_connected_bipartite_graphs_via_random_matching_edge_sets","302655912_Methods_of_adiabatic_quantum_computation","322781740_Adiabatic_quantum_computation","319339569_Solving_SAT_and_MaxSAT_with_a_Quantum_Annealer_Foundations_and_a_Preliminary_Report","316800957_Multiprocessor_Scheduling_for_Real-Time_Systems","313110430_A_Study_of_Complex_Deep_Learning_Networks_on_High_Performance_Neuromorphic_and_Quantum_Computers","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem"]}