{"id":"331500645_On_relationship_formation_in_heterogeneous_information_networks_An_inferring_method_based_on_multilabel_learning","abstract":"This paper studies how relationships form in heterogeneous information networks (HINs). The objective is not only to predict relationships in a given HIN more accurately but also to discover the interdependency between different type of relationships. A new relationship prediction method MULRP based on multilabel learning (MLL in brief) is proposed. In MULRP, the types of relationship between two nodes are represented by the meta‐paths between nodes and each type of relationship is given a label. Under the framework of MLL, any potential relationships including the target relationship can be predicted. Moreover, the method can output the reasonable dependency scores between relationships. Thus, more viable paths will be provided to facilitate the formation of new relationships. The proposed method is evaluated on two real datasets: The DBLP Computer Science Bibliography(abbr. DBLP) network and Twitter network. The experimental results show that by using heterogeneous information in a supervised MLL setting, MULRP achieves better performance in comparison to several baseline binary classification methods and a state‐of‐art relationship prediction method.","authors":["Ke-Jia Chen","Hao Lu","Yun Li","Bin Liu"],"meta":["March 2019Statistical Analysis and Data Mining 12(1)","DOI:10.1002/sam.11405"],"references":["317523407_Meta-Graph_Based_Recommendation_Fusion_over_Heterogeneous_Information_Networks","313827436_Meta-path-based_link_prediction_in_schema-rich_heterogeneous_information_network","303549558_Semantic_Proximity_Search_on_Graphs_with_Metagraph-based_Learning","277289291_Link_Prediction_Using_Supervised_Learning","263813673_A_Review_On_Multi-Label_Learning_Algorithms","301317630_Transfer_Learning_to_Infer_Social_Ties_across_Heterogeneous_Networks","299970688_CoupledLP","284096805_A_Survey_of_Heterogeneous_Information_Network_Analysis","282681034_Collective_Prediction_of_Multiple_Types_of_Links_in_Heterogeneous_Information_Networks","266660253_Meta-path_based_multi-network_collective_link_prediction"]}