{"id":"331533882_Arabic_Voice_Recognition_Using_Fuzzy_Logic_and_Neural_Network","abstract":"This research adapted and implemented an algorithm for commanding using speech recognition in ARABIC language in addition to English, and the ability to train the system using other languages. The recognition based on discrete coefficient of the wavelet transform. Intelligent recognizer is built for two models, the first is Neural Networks, and the second is Fuzzy Logic Recognizer. The proposed speech recognition system consists of three phases; preprocessing phase (two processes are performed on the sound, DC level removal and resizing of sample for 2000 samples for each sound), feature extraction phase (features that distinguish each sound from another, it is wavelet transform coefficients), and recognition phase (many classifiers could be used for speaker recognition, in this research supervised neural networks, MLP and Fuzzy Logic classifiers are used. This research is also concerned with studying the recognition ability of MLP neural Network and Suggeno type Fuzzy Logic systems, for the recognition of Arabic and English Languages. The neural networks trained with features extracted from discrete wavelet transform. The use of Wavelet Transformation enables to extract an exact features form the speech. The research illustrates the effect of using two different intelligent approaches using MATLAB, and by applying the voice commands directly to an automated wheeled vehicle.","authors":["Lubna Eljawad","Rami Aljamaeen","Mutasem K Alsmadi","Ibrahim Almarashdeh"],"meta":["January 2019International Journal of Applied Engineering Research 14(3):651-662","Project: Arabic Voice Recognition Using Fuzzy Logic and Neural Network"],"references":["330841416_Developing_and_Implementing_Web-based_Online_University_Facilities_Reservation_System","330841291_Analyzing_and_Implementing_an_Online_Metro_Reservation_System","328335250_An_Elite_Pool-Based_Big_Bang-Big_Crunch_Metaheuristic_for_Data_Clustering","326801245_An_overview_of_technology_evolution_Investigating_the_factors_influencing_non-bitcoins_users_to_adopt_bitcoins_as_online_payment_transaction_method","325737624_The_important_of_service_quality_and_the_trust_in_technology_on_users_perspectives_to_continues_use_of_mobile_services","325361012_Looking_Inside_and_Outside_the_System_Examining_the_Factors_Influencing_Distance_Learners_Satisfaction_in_Learning_Management_System","324174644_Real-Time_Elderly_Healthcare_Monitoring_Expert_System_Using_Wireless_Sensor_Network","323572885_A_Novel_Technique_Based_on_Visual_Words_Fusion_Analysis_of_Sparse_Features_for_Effective_Content-Based_Image_Retrieval","323397735_Hybrid_Elitist-Ant_System_for_Nurse-Rostering_Problem","323380324_An_enhanced_artificial_bee_colony_optimizer_and_its_application_to_multi-level_threshold_image_segmentation"]}