{"id":"331532108_Efficient_parallel_tabu_search_for_the_blocking_job_shop_scheduling_problem","abstract":"The Blocking Job Shop Scheduling (BJSS) is an NP-hard scheduling problem. It is obtained from the classical job shop scheduling problem by replacing the infinite buffer capacity constraint by a zero buffer capacity which introduces the blocking constraint. This constraint affects deeply the ability of meta-heuristics to find good solutions due to the low ratio of feasible to explored solutions. In this paper, we discuss the parallelization of the Tabu Search algorithm (TS) which represents one of the most widely used heuristics. Applying the classical TS neighborhood to the BJSS problem produces infeasible solutions in 98% of cases which leads to waste a valuable time in exploring infeasible solutions. For this reason, the use of a feasibility recovery strategy is unavoidable; however, the recovery step slows down considerably the TS algorithm. Therefore, incurring a huge time to explore a small area in the search space. To overcome this drawback and to accelerate the TS algorithm, we propose in this paper parallel multi-start TS approaches where several processes explore simultaneously the search space. Our parallelization exploits a cluster-based architecture with 512 CPU-cores. The obtained results show the positive impact of our proposed parallelization on the solution quality. Moreover, combining both the parallelism and the recovery strategy allowed us to improve the best result in the literature for a large number of known benchmarks.","authors":["Adel Dabah","Ahcene Bendjoudi","Abdelhakim AitZai","Nadia Nouali-Taboudjemat"],"meta":["December 2019Soft Computing 23(3)","DOI:10.1007/s00500-019-03871-1"],"references":["277474071_Tabu_search-part_II","266458105_Iterative_Improvement_Algorithms_for_the_Blocking_Job_Shop","323397499_Hybrid_multi-core_CPU_and_GPU-based_BB_approaches_for_the_blocking_job_shop_scheduling_problem","316026465_An_efficient_Tabu_Search_neighborhood_based_on_reconstruction_strategy_to_solve_the_blocking_job_shop_scheduling_problem","308189521_Multi_and_many-core_parallel_BB_approaches_for_the_Blocking_Job_Shop_Scheduling_problem","308189513_Efficient_parallel_BB_method_for_the_blocking_job_shop_scheduling_problem","305569043_GPU-based_two_level_parallel_BB_for_the_Blocking_Job_Shop_Scheduling_Problem","273302077_An_iterated_greedy_metaheuristic_for_the_blocking_job_shop_scheduling_problem","264836537_A_branch_and_bound_and_parallel_genetic_algorithm_for_the_job_shop_scheduling_problem_with_blocking","242579007_Job_Shop_Scheduling_by_Simulated_Annealing"]}