{"id":"331525817_Temporal_Convolutional_Neural_Network_for_the_Classification_of_Satellite_Image_Time_Series","abstract":"Latest remote sensing sensors are capable of acquiring high spatial and spectral Satellite Image Time Series (SITS) of the world. These image series are a key component of classification systems that aim at obtaining up-to-date and accurate land cover maps of the Earth’s surfaces. More specifically, current SITS combine high temporal, spectral and spatial resolutions, which makes it possible to closely monitor vegetation dynamics. Although traditional classification algorithms, such as Random Forest (RF), have been successfully applied to create land cover maps from SITS, these algorithms do not make the most of the temporal domain. This paper proposes a comprehensive study of Temporal Convolutional Neural Networks (TempCNNs), a deep learning approach which applies convolutions in the temporal dimension in order to automatically learn temporal (and spectral) features. The goal of this paper is to quantitatively and qualitatively evaluate the contribution of TempCNNs for SITS classification, as compared to RF and Recurrent Neural Networks (RNNs) —a standard deep learning approach that is particularly suited to temporal data. We carry out experiments on Formosat-2 scene with 46 images and one million labelled time series. The experimental results show that TempCNNs are more accurate than the current state of the art for SITS classification. We provide some general guidelines on the network architecture, common regularization mechanisms, and hyper-parameter values such as batch size; we also draw out some differences with standard results in computer vision (e.g., about pooling layers). Finally, we assess the visual quality of the land cover maps produced by TempCNNs.","authors":["Charlotte Pelletier","Geoffrey I Webb","François Petitjean"],"meta":["March 2019Remote Sensing 11(5):523","DOI:10.3390/rs11050523","Project: Satelite image time series analysis"],"references":["331474581_Deep_learning_for_time_series_classification_a_review","330043372_formula_M3textFusion_A_Deep_Learning_Architecture_for_Multiscale_Multimodal_Multitemporal_Satellite_Data_Fusion","326836028_Deep_Recurrent_Neural_Network_for_Agricultural_Classification_using_multitemporal_SAR_Sentinel-1_for_Camargue_France","329799510_Deep_learning_based_multi-temporal_crop_classification","328317939_Using_long_short-term_memory_recurrent_neural_network_in_land_cover_classification_on_Landsat_and_Cropland_data_layer_time_series","326648955_How_much_does_multi-temporal_Sentinel-2_data_improve_crop_type_classification","326229375_Time_Series_Classification_with_HIVE-COTE_The_Hierarchical_Vote_Collective_of_Transformation-Based_Ensembles","324669600_3-D_Deep_Learning_Approach_for_Remote_Sensing_Image_Classification","324142290_A_comparison_of_resampling_methods_for_remote_sensing_classification_and_accuracy_assessment","323627274_Learning_Spectral-Spatial-Temporal_Features_via_a_Recurrent_Convolutional_Neural_Network_for_Change_Detection_in_Multispectral_Imagery"]}