{"id":"331594199_A_convolutional_neural_network_trained_with_dermoscopic_images_performed_on_par_with_145_dermatologists_in_a_clinical_melanoma_image_classification_task","abstract":"Background: \nRecent studies have demonstrated the use of convolutional neural networks (CNNs) to classify images of melanoma with accuracies comparable to those achieved by board-certified dermatologists. However, the performance of a CNN exclusively trained with dermoscopic images in a clinical image classification task in direct competition with a large number of dermatologists has not been measured to date. This study compares the performance of a convolutional neuronal network trained with dermoscopic images exclusively for identifying melanoma in clinical photographs with the manual grading of the same images by dermatologists.\n\nMethods: \nWe compared automatic digital melanoma classification with the performance of 145 dermatologists of 12 German university hospitals. We used methods from enhanced deep learning to train a CNN with 12,378 open-source dermoscopic images. We used 100 clinical images to compare the performance of the CNN to that of the dermatologists. Dermatologists were compared with the deep neural network in terms of sensitivity, specificity and receiver operating characteristics.\n\nFindings: \nThe mean sensitivity and specificity achieved by the dermatologists with clinical images was 89.4% (range: 55.0%-100%) and 64.4% (range: 22.5%-92.5%). At the same sensitivity, the CNN exhibited a mean specificity of 68.2% (range 47.5%-86.25%). Among the dermatologists, the attendings showed the highest mean sensitivity of 92.8% at a mean specificity of 57.7%. With the same high sensitivity of 92.8%, the CNN had a mean specificity of 61.1%.\n\nInterpretation: \nFor the first time, dermatologist-level image classification was achieved on a clinical image classification task without training on clinical images. The CNN had a smaller variance of results indicating a higher robustness of computer vision compared with human assessment for dermatologic image classification tasks.","authors":["Titus J. Brinker","Achim Hekler","Alexander H Enk","Joachim Klode"],"meta":["March 2019European journal of cancer (Oxford, England: 1990) 111:148-154","DOI:10.1016/j.ejca.2019.02.005","Project: Artificial Intelligence in Skin Lesion Diagnosis: The Skin Classification Project"],"references":["331287430_Comparing_artificial_intelligence_algorithms_to_157_German_dermatologists_the_melanoma_classification_benchmark","328346240_Skin_Cancer_Classification_Using_Convolutional_Neural_Networks_Systematic_Review","325473733_Man_against_Machine_Diagnostic_performance_of_a_deep_learning_convolutional_neural_network_for_dermoscopic_melanoma_recognition_in_comparison_to_58_dermatologists","324078202_The_HAM10000_Dataset_A_Large_Collection_of_Multi-Source_Dermatoscopic_Images_of_Common_Pigmented_Skin_Lesions","306187421_SGDR_Stochastic_Gradient_Descent_with_Warm_Restarts","301884122_Skin_Lesion_Analysis_toward_Melanoma_Detection_A_Challenge_at_the_International_Symposium_on_Biomedical_Imaging_ISBI_2016_hosted_by_the_International_Skin_Imaging_Collaboration_ISIC","327409786_Deep_Learning-A_Technology_With_the_Potential_to_Transform_Health_Care","320128717_Results_of_the_2016_International_Skin_Imaging_Collaboration_International_Symposium_on_Biomedical_Imaging_challenge_Comparison_of_the_accuracy_of_computer_algorithms_to_dermatologists_for_the_diagnos","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","276421885_MED-NODE_A_Computer-Assisted_Melanoma_Diagnosis_System_using_Non-Dermoscopic_Images"]}