{"id":"331563327_Efficient_phase_retrieval_of_two-directional_phase-shifting_fringe_patterns_using_geometric_constraints_of_deflectometry","abstract":"In the phase measuring deflectometry, two groups of fringe patterns in orthogonal directions are usually applied to establish the correspondences between the pixel pairs on the screen and camera. Usually, 16 phase-shifting fringe patterns with different spatial frequencies are required in order to calculate the absolute phases in the conventional temporal phase unwrapping algorithms. This requirement makes the measurement inefficient and not robust against environmental noise. In this paper, an efficient phase retrieval strategy is developed, which requires only six fringe patterns. The modulating information in one-direction is obtained by first using four fringe patterns, and then it is applied to assist the phase calculation in the other direction, so that only two extra fringe patterns are needed. Subsequently the phases are unwrapped by using the geometric constraints of the software configurable optical test system without additional image acquisition. The measurement time is saved by 5/8, compared to the conventional methods. In this way, the influence of the low-frequency disturbances can be suppressed in the workshop condition. Experiments demonstrate that the proposed method can reliably retrieve the absolute phases, and it is of significance to improve the measuring efficiency and stability of in situ deflectometry.","authors":["Zhenqi Niu","Xueyang Xu","Xiangchao Zhang","Wei Wang"],"meta":["March 2019Optics Express 27(6):8195-8207","DOI:10.1364/OE.27.008195","Projects: Reference fitting algorithms for aspheric and freeform surfaces (15SIB01: FreeFORM)High-Precision In-situ Deflectometric Measurement of Optical Freeform Surfaces  (NSFC 51875107)"],"references":["328707904_Precision_measurement_of_specular_spherical_surfaces_based_on_monoscopic_phase_measuring_deflectometry","327294693_Region-adaptive_path_planning_for_precision_optical_polishing_with_industrial_robots","319404061_Full-field_3D_shape_measurement_of_discontinuous_specular_objects_by_direct_phase_measuring_deflectometry","281778275_Iterative_optimization_calibration_method_for_stereo_deflectometry","273561446_Aspheric_and_freeform_surfaces_metrology_with_software_configurable_optical_test_system_A_computerized_reverse_Hartmann_test","260153720_Absolute_three-dimensional_shape_measurement_using_coded_fringe_patterns_without_phase_unwrapping_or_projector_calibration","328663473_Generic_exponential_fringe_model_for_alleviating_phase_error_in_phase_measuring_profilometry","308050327_Evaluation_of_measurement_data_-_Guide_to_the_expression_of_uncertainty_in_measurement","305825198_Pixel-wise_absolute_phase_unwrapping_using_geometric_constraints_of_structured_light_system","303555657_Enhanced_two-frequency_phase-shifting_method"]}