{"id":"331529245_Quantifying_Molecular_Bias_in_DNA_Data_Storage","abstract":"DNA has recently emerged as an attractive medium for future digital data storage because of its extremely high information density and potential longevity. Recent work has shown promising results in developing proof-of-principle prototype systems. However, very uneven (biased) sequencing coverage distributions have been reported, which indicates inefficiencies in the storage process and points to optimization opportunities. These deviations from the average coverage in oligonucleotide copy distribution result in sequence drop-out and make error-free data retrieval from DNA more challenging. The uneven copy distribution was believed to stem from the underlying molecular processes, but the interplay between these molecular processes and the copy number distribution has been poorly understood until now. In this paper, we use millions of unique sequences from a DNA-based digital data archival system to study the oligonucleotide copy unevenness problem and show that two important sources of bias are the synthesis process and the Polymerase Chain Reaction (PCR) process. By mapping the sequencing coverage of a large complex oligonucleotide pool back to its spatial distribution on the synthesis chip, we find that significant bias comes from array-based oligonucleotide synthesis. We also find that PCR stochasticity is another main driver of oligonucleotide copy variation. Based on these findings, we develop a statistical model for each molecular process as well as the overall process and compare the predicted bias with our experimental data. We further use our model to explore the trade-offs between synthesis bias, storage physical density and sequencing redundancy, providing insights for engineering efficient, robust DNA data storage systems.","authors":["Yuan-Jyue Chen","Christopher N. Takahashi","Lee Organick","Kendall Stewart"],"meta":["March 2019","DOI:10.1101/566554"],"references":["323271462_Random_access_in_large-scale_DNA_data_storage","318406357_Portable_and_Error-Free_DNA-Based_Data_Storage","280135754_Sources_of_PCR-induced_distortions_in_high-throughput_sequencing_data_sets","276211156_A_Rewritable_Random-Access_DNA-Based_Storage_System","314195927_DNA_Fountain_enables_a_robust_and_efficient_storage_architecture","305978479_Modelling_the_PCR_amplification_process_by_a_size-dependent_branching_process_and_estimation_of_the_efficiency","303905278_A_DNA-Based_Archival_Storage_System","299406656_Nucleic_acid_memory","272029638_Robust_Chemical_Preservation_of_Digital_Information_on_DNA_in_Silica_with_Error-Correcting_Codes","261997387_Large-scale_de_novo_DNA_synthesis_Technologies_and_applications"]}