{"id":"331549735_A_comparison_of_deep_learning_and_citizen_science_techniques_for_counting_wildlife_in_aerial_survey_images","abstract":"Fast and accurate estimates of wildlife abundance are an essential component of efforts to conserve ecosystems in the face of rapid environmental change. A widely used method for estimating species abundance involves flying aerial transects, taking photographs, counting animals within the images and then inferring total population size based on a statistical estimate of species density in the region. The intermediate task of manually counting the aerial images is highly labour intensive and is often the limiting step in making a population estimate. Here, we assess the use of two novel approaches to perform this task by deploying both citizen scientists and deep learning to count aerial images of the 2015 survey of wildebeest (Connochaetes taurinus) in Serengeti National Park, Tanzania. Through the use of the online platform Zooniverse, we collected multiple non-expert counts by citizen scientists and used three different aggregation methods to obtain a single count for the survey images. We also counted the images by developing a bespoke deep learning method via the use of a convolutional neural network. The results of both approaches were then compared. After filtering of the citizen science counts, both approaches provided highly accurate total estimates. The deep learning method was far faster and appears to be a more reliable and predictable approach; however, we note that citizen science volunteers played an important role when creating training data for the algorithm. Notably, our results show that accurate, species-specific, automated counting of aerial wildlife images is now possible. © 2019 The Authors. Methods in Ecology and Evolution","authors":["Colin J. Torney","David Lloyd-Jones","Mark Chevallier","David Moyer"],"meta":["March 2019Methods in Ecology and Evolution 10(6)","DOI:10.1111/2041-210X.13165"],"references":["329750896_Deep_Learning_Object_Detection_Methods_for_Ecological_Camera_Trap_Data","324899822_An_approach_for_using_off-the-shelf_object-based_image_analysis_software_to_detect_and_count_birds_in_large_volumes_of_aerial_imagery","324593336_Counteracting_estimation_bias_and_social_influence_to_improve_the_wisdom_of_crowds","324104740_Deep_Learning_Object_Detection_Methods_for_Ecological_Camera_Trap_Data","322648366_trackdem_Automated_particle_tracking_to_obtain_population_counts_and_size_distributions_from_videos_in_R","322636111_Bat_Detective_-_Deep_learning_tools_for_bat_acoustic_signal_detection","338268571_The_Gnu's_World_Serengeti_Wildebeest_Ecology_and_Life_History","334265191_Applications_for_Deep_Learning_in_Ecology","324387691_YOLOv3_An_Incremental_Improvement","320967941_YOLO9000_Better_Faster_Stronger"]}