{"id":"331549658_Using_the_U-net_convolutional_network_to_map_forest_types_and_disturbance_in_the_Atlantic_rainforest_with_very_high_resolution_images","abstract":"Mapping forest types and tree species at regional scales to provide information for ecologists and forest managers is a new challenge for the remote sensing community. Here, we assess the potential of a U-net convolutional network, a recent deep learning algorithm, to identify and segment (1) natural forests and eucalyptus plantations, and (2) an indicator of forest disturbance, the tree species Cecropia hololeuca, in very high resolution images (0.3 m) from the WorldView-3 satellite in the Brazilian Atlantic rainforest region. The networks for forest types and Cecropia trees were trained with 7611 and 1568 red-green-blue (RGB) images, respectively, and their dense labeled masks. Eighty per cent of the images were used for training and 20% for validation. The U-net network segmented forest types with an overall accuracy >95% and an intersection over union (IoU) of 0.96. For C. hololeuca, the overall accuracy was 97% and the IoU was 0.86. The predictions were produced over a 1600 km ² region using WorldView-3 RGB bands pan-sharpened at 0.3 m. Natural and eucalyptus forests compose 79 and 21% of the region's total forest cover (82 250 ha). Cecropia crowns covered 1% of the natural forest canopy. An index to describe the level of disturbance of the natural forest fragments based on the spatial distribution of Cecropia trees was developed. Our work demonstrates how a deep learning algorithm can support applications such as vegetation, tree species distributions and disturbance mapping on a regional scale. © 2019 The Authors. Remote Sensing in Ecology and Conservation published by John Wiley & Sons Ltd.","authors":["Fabien H. Wagner","Alber Ipia","Yuliya Tarabalka","Rodolfo Georjute Lotte"],"meta":["March 2019Remote Sensing in Ecology and Conservation 5(4)","DOI:10.1002/rse2.111"],"references":["328993726_Large-Scale_Semantic_Classification_Outcome_of_the_First_Year_of_Inria_Aerial_Image_Labeling_Benchmark","325924268_Landsat-Based_Land_Use_Change_Assessment_in_the_Brazilian_Atlantic_Forest_Forest_Transition_and_Sugarcane_Expansion","325860737_Land_Cover_Segmentation_of_Airborne_LiDAR_Data_Using_Stochastic_Atrous_Network","323893542_Long-Term_Annual_Mapping_of_Four_Cities_on_Different_Continents_by_Applying_a_Deep_Information_Learning_Method_to_Landsat_Data","323714841_Scene_Classification_Based_on_a_Deep_Random-Scale_Stretched_Convolutional_Neural_Network","323476765_Disturbance_Regimes_Drive_The_Diversity_of_Regional_Floristic_Pools_Across_Guianan_Rainforest_Landscapes","323177290_Global_patterns_of_tropical_forest_fragmentation","322639684_Building_Extraction_in_Very_High_Resolution_Remote_Sensing_Imagery_Using_Deep_Learning_and_Guided_Filters","325852497_Developing_a_multi-filter_convolutional_neural_network_for_semantic_segmentation_using_high-resolution_aerial_imagery_and_LiDAR_data","324202037_Ecology's_remote-sensing_revolution"]}