{"id":"331501146_Complejidad_y_Pensamiento_Complejo_para_innovar_los_procesos_formativos_en_ingenieria","abstract":"Innovación, desarrollo, creatividad e internacionalización son términos que se relacionan desde hace tiempo con la ingeniería y que, en este siglo, con el incremento de la complejidad de los problemas que esta profesión debe resolver, tienen más vigencia que nunca antes. Los ingenieros de hoy deben pensar, analizar, razonar y actuar de forma diferente a sus predecesores, porque los cambios y las revoluciones en el conocimiento lo exigen y porque la sociedad espera mucho más de ellos. Este es el verdadero reto de las facultades de ingeniería: innovar los procesos formativos para que sus profesionales desarrollen creatividad y ofrezcan soluciones eficientes y eficaces, que permitan el desarrollo y la internacionalización del país. Pero si continuamos trabajando como en el siglo XX no se podrá superar este desafío, porque el contexto, el mundo, las necesidades, las exigencias, los retos y los estudiantes han cambiado. Se necesita una nueva forma de pensar y actuar acerca de la formación de los ingenieros de hoy y del futuro cercano. En este artículo se propone la integración de nuevos términos y principios en la construcción de planes de estudios y contenidos de los programas de ingeniería, con el objetivo de innovar la formación, para que los ingenieros gestionen el conocimiento y lo utilicen en la solución de problemas. La propuesta consiste de tres aspectos centrales: 1) dejar de lado el pensamiento lineal y comenzar a ver el mundo de forma holística, 2) formar desde la transdisciplina para el desarrollo de la creatividad, y 3) integrar al Pensamiento Complejo en la formación ingenieril como principio de innovación y de análisis. Se trata de una apuesta para mejorar la impresión que la sociedad tiene de la ingeniería, porque es una de las profesiones que más llama la atención y porque últimamente no hemos hecho mucho por recobrar el protagonismo que tenía en años anteriores.","authors":["Edgar Serna M.","Alexei Serna"],"meta":["March 2017","Conference: VII Conferencia Iberoamericana de Complejidad, Informática y CibernéticaAt: Orlando, USA"],"references":["289069351_Transformational_Innovation_Reflections_on_How_to_Foster_it_in_Engineering_Education_Systems","283542107_CIENCIA_Y_PENSAMIENTO_COMPLEJO_-_Desarrollo_Transdisciplinar_de_un_Paradigma","277291833_CDIO_An_international_initiative_for_reforming_engineering_education","277270786_The_Creativity_Model_for_Fostering_Greater_Synergy_between_Engineering_Classroom_and_Industrial_Activities_for_Advancement_of_Students'_Creativity_and_Innovation","263063836_Engineering_Design_Thinking_Teaching_and_Learning","337400574_The_Concept_of_Space_in_Philosophy_and_in_Computer_Science","292285495_Technological_Innovation_and_Engineering_Education_Beware_the_Da_Vinci_Requirement","264409926_On_Becoming_a_21st_Century_Engineer","264302433_Redefining_Quality_in_Engineering_Education_Through_Hybrid_Instruction","261684323_Re-engineering_the_curriculum_for_the_21st_century"]}