{"id":"331508170_Blending_integrated_knowledge_translation_with_global_health_governance_An_approach_for_advancing_action_on_a_wicked_problem","abstract":"Background\nThe persistence of health inequities is a wicked problem for which there is strong evidence of causal roots in the maldistribution of power, resources and money within and between countries. Though the evidence is clear, the solutions are far from straightforward. Integrated knowledge translation (IKT) ought to be well suited for designing evidence-informed solutions, yet current frameworks are limited in their capacity to navigate complexity. Global health governance (GHG) also ought to be well suited to advance action, but a lack of accountability, inclusion and integration of evidence gives rise to politically driven action. Recognising a persistent struggle for meaningful action, we invite contemplation about how blending IKT with GHG could leverage the strengths of both processes to advance health equity.\n\nDiscussion\nAction on root causes of health inequities implicates disruption of structures and systems that shape how society is organised. This infinitely complex work demands sophisticated examination of drivers and disrupters of inequities and a vast imagination for who (and what) should be engaged. Yet, underlying tendencies toward reductionism seem to drive superficial responses. Where IKT models lack consideration of issues of power and provide little direction for how to support cohesive efforts toward a common goal, recent calls from the field of GHG may provide insight into these issues. Additionally, though GHG is criticised for its lack of attention to using evidence, IKT offers approaches and strategies for collaborative processes of generating and refining knowledge. Contemplating the inclusion of governance in IKT requires re-examining roles, responsibilities, power and voice in processes of connecting knowledge with action. We argue for expanding IKT models to include GHG as a means of considering the complexity of issues and opening new possibilities for evidence-informed action on wicked problems.\n\nConclusion\nIntegrated learning between these two fields, adopting principles of GHG alongside the strategies of IKT, is a promising opportunity to strengthen leadership for health equity action.","authors":["Katrina M Plamondon","Julia Pemberton"],"meta":["March 2019Health Research Policy and Systems 17(1)","DOI:10.1186/s12961-019-0424-3"],"references":["327396546_The_Politics_of_Disease_Epidemics_a_Comparative_Analysis_of_the_SARS_Zika_and_Ebola_Outbreaks","323783594_The_implementation_of_Health_in_All_Policies_initiatives_A_systems_framework_for_government_action","322419946_Addressing_trade_policy_as_a_macro-structural_determinant_of_health_The_role_of_institutions_and_ideas","321482212_Global_action_on_the_social_determinants_of_health","321080558_Health_Equity_Talk_Understandings_of_Health_Equity_among_Health_Leaders","320976933_From_reflexivity_to_collectivity_Challenging_the_benevolence_narrative_in_global_health","319753702_Practicing_governance_towards_equity_in_health_systems_LMIC_perspectives_and_experience","329435192_The_integration_of_evidence_from_the_Commission_on_Social_Determinants_of_Health_in_the_field_of_health_equity_a_scoping_review","323322096_Undoing_the_Demos_Neoliberalism's_Stealth_Revolution","321584806_What_is_the_Dialogical_Method_of_Teaching"]}