{"id":"331512413_Examining_the_Use_of_an_Educational_Escape_Room_for_Teaching_Programming_in_a_Higher_Education_Setting","abstract":"In addition to being a well-liked form of recreation, escape rooms have drawn the attention of educators due to their ability to foster teamwork, leadership, creative thinking and communication in a way that is engaging for students. As a consequence, educational escape rooms are emerging as a new type of learning activity under the promise of enhancing students’ learning through highly engaging experiences. These activities consist of escape rooms that incorporate course materials within their puzzles in such a way that students are required to master these materials in order to succeed. Although several studies have reported on the use of escape rooms in a wide range of disciplines, prior research falls short of addressing the use of educational escape rooms for teaching programming, one of the most valuable skills of the twenty-first century that students often have difficulties grasping. This paper reports on the use of an educational escape room in a programming course at a higher education institution and provides, for the first time, insights on the instructional effectiveness of using educational escape rooms for teaching programming. The results of this work show that appropriate use of educational escape rooms can have significant positive impacts on student engagement and learning in programming courses. These results also suggest that students prefer these activities over traditional computer laboratory sessions. Finally, another novel contribution of this paper is a set of recommendations and proposals for educators in order to help them create effective educational escape rooms for teaching programming.","authors":["Sonsoles López-Pernas","Aldo Gordillo","Enrique Barra","Juan Quemada"],"meta":["March 2019IEEE Access 7:31723-31737","DOI:10.1109/ACCESS.2019.2902976","Project: Educational Escape Rooms"],"references":["348870975_Escape_Room_Games_Can_you_transform_an_unpleasant_situation_into_a_pleasant_one","329192854_1311_Incorporating_an_Escape_Room_Game_Design_in_Infectious_Diseases_Instruction","328154805_Layered_Software_Architecture_for_the_Development_of_Mobile_Learning_Objects_With_Augmented_Reality","328088496_Integrated_Virtual_Laboratory_in_Engineering_Mathematics_Education_Fourier_Theory","352301370_The_Toxiscape_Hunt_An_Escape_Room-Scavenger_Hunt_for_Toxicology_Education","330199679_Leveraging_Escape_Room_Popularity_to_Provide_First-Year_Students_with_an_Introduction_to_Engineering_Information","330072341_Development_of_an_Interactive_Escape_Room_Intervention_to_Educate_College_Students_about_Earthquake_Preparedness","329228439_AUGMENTED_REALITY_ESCAPE_ROOMS_AS_HIGH-ENGAGEMENT_EDUCATIONAL_RESOURCES","329075208_RESCORM_A_boilerplate_for_creating_SCORM-compliant_React_applications","328922483_The_impact_on_nursing_students'_opinions_and_motivation_of_using_a_Nursing_Escape_Room_as_a_teaching_game_A_descriptive_study"]}