{"id":"331559807_NSF_ADVANCE_and_gender_equity_Past_present_and_future_of_systemic_institutional_transformation_strategies","abstract":"Purpose\nSupporting the advancement of science, technology, engineering and mathematics (STEM) in ways that help to ensure the health, prosperity, welfare and security of the nation has been central to the mission of the US National Science Foundation (NSF) since 1950, the year Congress created the agency. Preparing a highly qualified and diverse STEM workforce plays a central role in supporting this mission. The paper aims to discuss these issues.\n\nDesign/methodology/approach\nOver the past several decades, many positive steps have been taken throughout the US education system to help ensure a more diverse STEM workforce. Even so, women remain underrepresented among STEM faculty in higher education, especially at the upper ranks. Contributing to women’s underrepresentation are systemic obstacles to the recruitment, retention and promotion of women of different racial, ethnic, disability, sexual orientations and nationality statuses.\n\nFindings\nThe NSF ADVANCE Program is designed to address these barriers. Success for ADVANCE is, therefore, best defined in terms of the changes made to the structures and climates of academic workplaces, rather than in numbers of women hired, retained or promoted in any one institution at a given point in time.\n\nOriginality/value\nThis introduction briefly examines the origins of ADVANCE, key transitions in the program over time, its reach nationally and internationally, and its future.","authors":["Jessie DeAro","Sharon R. Bird","Shermaine Mitchell-Ryan"],"meta":["March 2019Equality, Diversity and Inclusion: An International Journal 38(2):131-139","DOI:10.1108/EDI-09-2017-0188"],"references":["309619669_Intersectionality_and_Dismantling_Institutional_Privilege_The_Case_of_NSF_ADVANCE_program","308135033_The_Dynamic_between_Knowledge_Production_and_Faculty_Evaluation_Perceptions_of_the_Promotion_and_Tenure_Process_across_Disciplines","283822708_Now_Hiring_Empirically_Testing_a_Three-Step_Intervention_to_Increase_Faculty_Gender_Diversity_in_STEM_Figure_1","324428769_Men_and_Women_of_the_Corporation","302930119_Mapping_the_margins_Intersectionality_identity_politics_and_violence_against_women_of_color","299355720_The_Intersectional_Matrix_Rethinking_Institutional_Change_for_URM_Women_in_STEM","297278815_Asian_Women_in_STEM_Careers_An_Invisible_Minority_in_a_Double_Bind","290560059_The_Science_Glass_Ceiling_Academic_Women_Scientist_and_the_Struggle_to_Succeed","290194884_Do_Babies_Matter_Gender_and_Family_in_the_Ivory_Tower","279250901_Starting_at_the_Crossroads_Intersectional_Approaches_to_Supporting_Underrepresented_Minority_Women_STEM_Faculty"]}