{"id":"331635216_Understanding_SaaS_adoption_The_moderating_impact_of_the_environment_context","abstract":"In the information management literature, Software-as-a-Service (SaaS) is recognized as a technology capable of providing operational and financial benefits to firms, and it is rising as the dominant IT service delivery model. Considered to be a promising solution it is garnering interest among researchers and professionals. However, SaaS can represent a vulnerability to firms due to its nature. The weighing of the pros and cons leads to firms' uncertainty regarding SaaS adoption. Through the lenses of technology-organization-environment (TOE) framework we examine the contextual factors that influence the adoption of SaaS. Furthermore, this study explores the moderating effects of the environmental context in the adoption of SaaS and how it shapes the direct influences of technological and organizational contexts of the TOE framework. Data collected from 259 firms were used to test the proposed model. The study found the significance of the technology, organization, and environment context for SaaS adoption. Moreover, it was found the moderator influence of the environment context between the organization context and SaaS adoption. This study contributes to a deepest understanding of the determinants of SaaS adoption by providing a holistic theoretical lens, advancing newer paths of approaching the TOE framework.","authors":["Tiago Oliveira","Ricardo Martins","Saonee Sarker","Manoj A. Thomas"],"meta":["December 2019International Journal of Information Management 49:1-12","DOI:10.1016/j.ijinfomgt.2019.02.009","Project: Digitalization"],"references":["305398019_The_technology-organization-environment_framework","329658691_State_ownership_effect_on_firms'_FDI_ownership_decisions_under_institutional_pressure_A_study_of_Chinese_outward-investing_firms","325671485_Accounting_for_common_method_variance_in_cross-sectional_research_designs","320346181_Cloud_computing_research_A_review_of_research_themes_frameworks_methods_and_future_research_directions","313526563_The_context_for_change_Organization_technology_and_environment","313500672_Understanding_the_determinants_of_cloud_computing_adoption","312616340_Commentary_Issues_and_opinion_on_structural_equation_modeling","311344281_A_survey_on_security_issues_in_service_delivery_models_of_cloud_computing","309042215_A_comparative_analysis_of_two_structural_equation_models_LISREL_and_PLS_applied_to_market_data","308018952_An_assessment_of_the_use_of_partial_least_squares_structural_equation_modeling_in_marketing_research"]}