{"id":"331654899_Socially-aware_congestion_control_in_ad-hoc_networks_Current_status_and_the_way_forward","abstract":"Ad-hoc social networks (ASNETs) represent a special type of traditional ad-hoc network in which a user's social properties (such as the social connections and communications metadata as well as application data) are leveraged for offering enhanced services in a distributed infrastructureless environments. However, the wireless medium, due to limited bandwidth, can easily suffer from the problem of congestion when social metadata and application data are exchanged among nodes---a problem that is compounded by the fact that some nodes may act selfishly and not share its resources. While a number of congestion control schemes have been proposed for the traditional ad-hoc networks, there has been limited focus on incorporating social awareness into congestion control schemes. We revisit the existing traditional ad-hoc congestion control and data distribution protocols and motivate the need for embedding social awareness into these protocols to improve performance. We report that although some work is available in opportunistic network that uses socially-aware techniques to control the congestion issue, this area is largely unexplored and warrants more research attention. In this regards, we highlight the current research progress and identify multiple future directions of research.","authors":["Hannan Bin Liaqat","Amjad Ali","Junaid Qadir","Ali Kashif Bashir"],"meta":["March 2019Future Generation Computer Systems 97","DOI:10.1016/j.future.2019.02.017"],"references":["327138483_Internet_of_Things_IoT_Operating_System_Applications_and_Protocols_Design_and_Validation_Techniques","323328596_A_Survey_on_Resource_Management_in_IoT_Operating_Systems","322258158_A_survey_on_routing_protocols_supported_by_the_Contiki_Internet_of_things_operating_system","316279604_Congestion_Control_in_Wireless_Sensor_Networks_Based_on_Bird_Flocking_Behavior","317693008_A_social_cognitive_heuristic_for_adaptive_data_dissemination_in_mobile_Opportunistic_Networks","317660794_Privacy-Preserving_Schemes_for_Ad_Hoc_Social_Networks_A_Survey","316236498_Reducing_Congestion_Effects_by_Multipath_Routing_in_Wireless_Networks","314835049_CODA_congestion_detection_and_avoidance_in_sensor_networks","313491236_Random_early_detection_gateways_for_congestion_avoidance","301762137_Congestion_control_in_named_data_networking_-_A_survey"]}