{"id":"331625384_Visual_Tea_Leaf_Disease_Recognition_Using_a_Convolutional_Neural_Network_Model","abstract":"The rapid, recent development of image recognition technologies has led to the widespread use of convolutional neural networks (CNNs) in automated image classification and in the recognition of plant diseases. Aims: The aim of the present study was to develop a deep CNNs to identify tea plant disease types from leaf images. Materials: A CNNs model named LeafNet was developed with different sized feature extractor filters that automatically extract the features of tea plant diseases from images. DSIFT (dense scale-invariant feature transform) features are also extracted and used to construct a bag of visual words (BOVW) model that is then used to classify diseases via support vector machine(SVM) and multi-layer perceptron(MLP) classifiers. The performance of the three classifiers in disease recognition were then individually evaluated. Results: The LeafNet algorithm identified tea leaf diseases most accurately, with an average classification accuracy of 90.16%, while that of the SVM algorithm was 60.62% and that of the MLP algorithm was 70.77%. Conclusions: The LeafNet was clearly superior in the recognition of tea leaf diseases compared to the MLP and SVM algorithms. Consequently, the LeafNet can be used in future applications to improve the efficiency and accuracy of disease diagnoses in tea plants.","authors":["Jing Chen","Qi Liu","lwgao_ipm Gao"],"meta":["March 2019Symmetry 11(3):343","DOI:10.3390/sym11030343"],"references":["342004011_An_Overview_of_Machine_Learning_and_Deep_Learning","325493786_Recognition_and_detection_of_tea_leaf's_diseases_using_support_vector_machine","322454562_Building_A_Globally_Optimized_Computational_Intelligent_Image_Processing_Algorithm_for_On-Site_Nitrogen_Status_Analysis_in_Plants","322142005_Identification_of_Apple_Leaf_Diseases_Based_on_Deep_Convolutional_Neural_Networks","330251390_Tea_Diseases_Detection_Based_on_Fast_Infrared_Thermal_Image_Processing_Technology","328907857_Tomato_Leaf_Disease_Detection_Using_Convolutional_Neural_Networks","328664988_A_recognition_method_for_cucumber_diseases_using_leaf_symptom_images_based_on_deep_convolutional_neural_network","327265550_Corn_Disease_Identification_from_Leaf_Images_Using_Convolutional_Neural_Networks","325612493_Identification_of_Maize_Leaf_Diseases_Using_Improved_Deep_Convolutional_Neural_Networks","322941653_Deep_learning_models_for_plant_disease_detection_and_diagnosis"]}