{"id":"331682212_Email_Spam_Detection_Using_Integrated_Approach_of_Naive_Bayes_and_Particle_Swarm_Optimization","abstract":"Now-a-days, communication through email has become one of the cheapest and easy ways for the official and business users due to easy availability of internet access. Most of the people prefer to use email to share important information and to maintain their official records. But just like the two sides of coin, many people misuse this easy way of communication by sending unwanted & useless bulk emails to others. These unwanted emails are spam emails that affect the normal user to face the problems like excessive usage of their mailbox memory and filtration of useful email from unwanted useless emails. So, there is the need of some autonomous approach that filters the excessive data of emails in the form of spam emails. In this paper, an integrated approach of machine learning based Naive Bayes (NB) algorithm and computational intelligence based Particle Swarm Optimization (PSO) is used for the email spam detection. Here, Naive Bayes algorithm is used for the learning and classification of email content as spam and non-spam. PSO has the stochastic distribution & swarm behavior property and considered for the global optimization of the parameters of NB approach. For experimentation, dataset of Ling spam dataset is considered and evaluated the performance in terms of precision, recall, f-measure and accuracy. Based on the evaluated results, PSO outperforms in comparison with individual NB approach.","authors":["Kriti Agarwal","Tarun Kumar"],"meta":["June 2018","DOI:10.1109/ICCONS.2018.8662957","Conference: 2018 Second International Conference on Intelligent Computing and Control Systems (ICICCS)"],"references":["283837230_An_evaluation_on_the_efficiency_of_hybrid_feature_selection_in_spam_email_classification","269725516_A_combined_negative_selection_algorithm-particle_swarm_optimization_for_an_email_spam_detection_system","317724038_Extreme_Learning_machines_and_Support_Vector_Machines_models_for_email_spam_detection","316307967_E-mail_spam_classification_using_S-cuckoo_search_and_support_vector_machine","315884187_E-mail_spam_classification_using_S-cuckoo_search_and_support_vector_machine","315511749_Email_Spam_filtering_using_BPNN_classification_algorithm","315364242_Improved_email_spam_classification_method_using_integrated_particle_swarm_optimization_and_decision_tree","312571817_A_support_vector_machine_based_naive_Bayes_algorithm_for_spam_filtering","286492968_Latent_Semantic_Indexing_Based_SVM_Model_for_Email_Spam_Classification","284677567_Particle_swarm_optimization_Developments_application_and_resources"]}