{"id":"331678234_PERFORMANCE_ANALYSIS_OF_AODV_IN_PRESENCE_OF_MALICIOUS_NODE","abstract":"Un-wired Computers (Mobile Computers) such as Laptops, Net-books, Notebooks and Personal Digital Assistants\n(PDAs) are the fastest growing segments of Computing Industry; this changing aspect of computing has led to the\ninvention of Mobile Ad-Hoc Networks (MANET). Mobile Ad Hoc networking is a new era of infrastructure less\ncommunication networks for mobile devices (hosts, nodes etc.), where mobile nodes that are in radio range for each\nother can directly communicate with each other when in range and can even use intermediate nodes as routers when\nare moving away or are getting out of range from the connected nodes, this property along with the ability of switching\nfrom one network topology to another help in improving node mobility. Due to this mobility factor and undefined\ninfrastructure security is a major concern in mobile Ad Hoc networks. In this paper we are providing a detailed\nanalysis of the performance of ad-hoc routing protocol AODV in Mobile Ad Hoc networks with and without the\npresence of malicious node. We have used Qualnet version 5.0 (simulator) to measure the effect of attack on mobile\nad-hoc networks that gives a clear picture for the throughput, variations in CBR, packet delivery delay, average jitter\nand end-to-end delay in mobile ad-hoc networks when attack effects the mobile ad-hoc network.","authors":["Rohit Rana","Rajendra Kumar"],"meta":["January 2019Acta Electronica Malaysia 3(1):01-05","DOI:10.26480/aem.01.2019.01.05"],"references":["288890329_Modelling_and_Verifying_the_AODV_Routing_Protocol","232640697_Detecting_Wormhole_Attacks_in_Mobile_Ad_Hoc_Networks_through_Protocol_Breaking_and_Packet_Timing_Analysis","220996481_Black_hole_attack_in_mobile_Ad_Hoc_networks","314081242_Consequences_and_Measures_of_Wormhole_Attack_in_MANET","281430800_Comparative_analysis_of_CBRP_DSR_AODV_routing_protocol_in_MANET","238808228_Wireless_sensor_and_actor_networks_research_challenges1","3236237_Wormhole_Attacks_in_Wireless_Networks"]}