{"id":"331627540_Generating_image_descriptions_using_capsule_network","abstract":"Using Capsule network to generate natural language descriptions of images with different orientation, shapes, sizes and regions is a novel technique to address image to text problem. In this paper we are going to present a model that generates image descriptions using convolutional neural network and capsule network. First, the model will be trained on MNIST dataset for testing the accuracy of identifying the images with different orientation using capsule network and after that we used Flickr8K [3] and Flickr30K [4, 5] datasets over CNN and bidirectional recurrent neural network to generate text descriptions. We have added an additional steps to change the orientation of these images by rotating them to certain angles which will help in creating a new set of training samples for images with different orientations. Second, we analysed the performance of both the system separately and combined, calculate the aggregated result while taking in account the complexity of image descriptor and pose content of images. We found that this idea outperform significantly on describing images with different orientations and scalable to adapt new images apart from the training samples without predefined set of guidelines.","authors":["Pankaj Kumar","Sanjib Kumar Sahu","Amit Prakash Singh"],"meta":["February 2019Journal of Information and Optimization Sciences 40(2):479-492","DOI:10.1080/02522667.2019.1587822"],"references":["265295439_ImageNet_Large_Scale_Visual_Recognition_Challenge","224649475_Rotation-Invariant_Neoperceptron","221080071_Transforming_Auto-Encoders","220659463_The_Pascal_Visual_Object_Classes_VOC_challenge","329958814_Dynamic_Routing_Using_Inter_Capsule_Routing_Protocol_between_Capsules","303721259_From_image_descriptions_to_visual_denotations_New_similarity_metrics_for_semantic_inference_over_event_descriptions","301896225_Learning_Covariant_Feature_Detectors","262256563_Framing_Image_Description_as_a_Ranking_Task_Data_Models_and_Evaluation_Metrics","260302048_Im2Text_Describing_Images_Using_1_Million_Captioned_Photographs","228917508_Composing_Simple_Image_Descriptions_using_Web-scale_N-grams"]}