{"id":"331673716_LRSPPP_Lightweight_R-LWE-based_Secure_and_Privacy-Preserving_Scheme_for_Prosumer_Side_Network_in_Smart_Grid","abstract":"In recent years, researchers have made tremendous progress to address an important question of how to provide security and privacy in Internet of Things systems. Privacy protection refers to safeguarding leakage of private information of the customers. In the context of Smart Grid, majority of the studies are based on addressing consumer side privacy. A recent research work has revealed that consumer side network has evolved into prosumer side network. Prosumer refers to consumer and producer, which means a dual role of a customer in the smart grid network. In this paper, we attempt to address the security and privacy issues at the prosumer side of smart grid network. Our work is different from the previous works in two ways. The paper proposes a lightweight encryption based privacy preservation scheme; Lightweight R-LWE-based Secure and Privacy-Preserving Scheme for Prosumer side network (LRSPPP). In LRSPPP, a new messaging scheme is defined which effectively minimizes the number of messages thus making it lightweight. Furthermore, the proposed privacy preservation scheme is using Learning With Errors over Rings (R-LWE) lattice cryptography. There is no previous evidence of use of R-LWE based encryption for prosumer's privacy protection in smart grid. The security and performance analysis shows that the LRSPPP is superior compared to three other existing schemes.","authors":["Aarti Amod Agarkar","Himanshu Agrawal"],"meta":["March 2019Heliyon 5(3):1-31","DOI:10.1016/j.heliyon.2019.e01321","Project: Lightweight authentication and privacy preservation in smart grid"],"references":["319115826_Achieving_privacy-preserving_big_data_aggregation_with_fault_tolerance_in_smart_grid","319062609_Security_and_Privacy-Preserving_Metering_Service_in_the_Smart_Grid","316817678_Lightweight_Data_Aggregation_Scheme_against_Internal_Attackers_in_Smart_Grid_Using_Elliptic_Curve_Cryptography","316614060_R-LWE_based_lightweight_privacy_preserving_scheme_for_Smart_Grid","319583654_A_Secure_ECC-based_Privacy_Preserving_Data_Aggregation_Scheme_for_Smart_Grids","316443190_Privacy-preserving_protocols_for_secure_and_reliable_data_aggregation_in_IoT-enabled_Smart_Metering_systems","316244728_Privacy-Friendly_Forecasting_for_the_Smart_Grid_Using_Homomorphic_Encryption_and_the_Group_Method_of_Data_Handling","309452740_Privacy-friendly_Secure_Bidding_for_Smart_Grid_Demand-Response","301307143_A_Lightweight_Lattice-Based_Homomorphic_Privacy-Preserving_Data_Aggregation_Scheme_for_Smart_Grid","300717586_Efficient_Software_Implementation_of_Ring-LWE_Encryption"]}