{"id":"331641090_UN_NUEVO_INDICE_BIBLIOMETRICO_PARA_MEDIR_EL_IMPACTO_DE_LA_PRODUCCION_CIENTIFICA_A_New_Bibliometric_Index_to_Measure_the_Impact_of_Scientific_Production","abstract":"RESUMEN. Un nuevo índice bibliométrico (iX) permite medir el impacto de la producción científica con mayor objetividad que el factor de impacto de Clarivate Analytics o el CiteScore de Scopus. En vez de enfatizar la relevancia de las citas recibidas frente a las publicaciones efectuadas, ahora se propone poner en pie de igualdad ambos parámetros, haciendo que sean directamente proporcionales al impacto medido. Los resultados obtenidos confirman la bondad de esta nueva técnica y recomiendan su uso generalizado para evaluar revistas académicas, investigadores, instituciones o países. Como prueba fehaciente, se aporta una lista con los cien primeros estados clasificados en función del iX. ENGLISH: A new bibliometric index (iX) allows for the measurement of the impact of scientific production with greater objectivity than the impact factor of Clarivate Analytics or the CiteScore of Scopus. Instead of privileging the relevance of the citations received over the publications made, this index proposes to consider both parameters equally, making them directly proportional to the measured impact. The results obtained confirm the value of this new technique and recommend its widespread use to evaluate academic journals, researchers, institutions or countries. As proof, a list is given with the first hundred states classified according to the iX.","authors":["Pascual Izquierdo-Egea"],"meta":["March 2019Arqueologia Iberoamericana 41:41-44","Project: TOWARDS A NEW BIBLIOMETRICS"],"references":["325959977_IMPLEMENTANDO_UN_INDICE_MAS_OBJETIVO_PARA_MEDIR_LA_RELEVANCIA_Y_EL_IMPACTO_DE_LAS_REVISTAS_CIENTIFICAS_Implementing_a_More_Objective_Index_to_Measure_the_Relevance_and_Impact_of_Scientific_Journals","323228086_IMPLEMENTANDO_UN_INDICE_QUE_PONDERE_EL_IMPACTO_DE_UNA_REVISTA_CIENTIFICA_EN_FUNCION_DE_SU_JUVENTUD_Implementing_an_Index_that_Weighs_the_Impact_of_a_Scientific_Journal_Based_on_its_Early_Age","277415847_Citation_Indexing_for_Studying_Science","19638266_Which_Medical_Journals_Have_the_Greatest_Impact","18088520_Citation_Analysis_as_a_Tool_in_Journal_Evaluation"]}