{"id":"331600447_Scrutinizing_News_Media_Cooperation_in_Facebook_and_Twitter","abstract":"In recent times, news medias avail oneself of online social media platforms for news promotion, sharing and commentary to a large extent mainly in Twitter, Facebook, and Reddit. Therefore, in the literature, researchers have been used machine learning and text mining techniques to attain useful insights from the news media data in social media in-order to understand the factors for gaining large audience attention. Different to the previous studies, analyses of the news media in this work are based on a set of new features; content features such as the originality of a news item, context features such as time and circadian patterns of a news media, and reader reactions. Our dataset includes 238K tweets and 128K Facebook posts of 48 most popular news medias shared during May-June 2017. In this study we explored; news producers, news consumers, inter news production patterns, inter news dissemination behaviors, sharing similar news items within Twitter and Facebook (cross-posts), and news readers reactions\non news items. In addition, we investigated the best time period to receive highest readers’ attention towards their news items as this information is useful for other news medias to understand the best time duration to publish news items. Finally, we proposed a predictive model to increase news media popularity among readers and the results manifested that, a news media should disperse its own content and need to publish at first before other news media publish the same content in social media in-order to be popular and attract the\nattention from readers.","authors":["Praboda Rajapaksha","Reza Farahbakhsh","Noel Crespi"],"meta":["March 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2902491"],"references":["316940455_The_News_User_on_Social_Media_A_comparative_study_of_interacting_with_media_organizations_on_Facebook_and_Instagram","287091553_Transient_news_crowds_in_social_media","280227144_Reciprocity_and_the_News_The_Role_of_Personal_and_Social_Media_Reciprocity_in_News_Creation_and_Consumption","277326271_Comparing_Events_Coverage_in_Online_News_and_Social_Media_The_Case_of_Climate_Change","233852041_On_Saliency_Affect_and_Focused_Attention","221661401_The_Pulse_of_News_in_Social_Media_Forecasting_Popularity","221118337_Toward_Predicting_Popularity_of_Social_Marketing_Messages","328525494_Inspecting_Interactions_Online_News_Media_Synergies_in_Social_Media","322515000_Identifying_Content_Originator_in_Social_Networks","321653034_Spreading_One's_Tweets_How_Can_Journalists_Gain_Attention_for_their_Tweeted_News","303362925_Spreading_the_News_How_Can_Journalists_Gain_More_Engagement_for_Their_Tweets","289877233_Facebook_twitter_and_google_plus_for_breaking_news_Is_there_awinner","263335309_Share_like_recommend","214640678_What_Is_Twitter_a_Social_Network_or_a_News_Media"]}