{"id":"331658525_Assessment_of_the_effectiveness_of_learning_theories_using_gamified_android_app_in_teaching_C_programming","abstract":"New knowledge of learners can be easily attained by applying different strategies in the classroom instructions. In the pedagogical domain, learning theories had been enforced and embedded to all instructional materials especially on gamification. Gamification is a concept of game-based approach in the teaching and learning process by offering challenges, tasks, rewards, badges and assessment. An android-based application called C-Rocks had been used in this study which comprises three learning theories: constructivism, behaviourism and instructivism. A pretest was conducted to the fifty first year IT students who learned C programming in a traditional way of teaching to determine their prior knowledge. After that, the C-rocks was used by the students to facilitate the learning of C programming. A post-test was conducted to determine the post-knowledge gained after using the android app. The students were clustered using the k-means clustering algorithm of educational data mining to good, medium, and poor standard students. It was found out that most students excelled in variable topic while they performed least in the control statement topic. A T-test was also utilized and showed that the result of pretest and post-test is highly significant with a t-value of 7.236 and a probability of 0.000. With the result established, the C-android app containing three learning theories is an effective Gamified tool in learning C programming as students can achieve greater learning.","authors":["Janelyn Ambre Talingdan","Christopher John Llanda"],"meta":["March 2019IOP Conference Series Materials Science and Engineering 482:012030","DOI:10.1088/1757-899X/482/1/012030"],"references":["281226038_Five_Cs_Framework_A_Student-centered_Approach_for_teaching_programming_courses_to_students_with_diverse_disciplinary_background","273851906_Analysis_of_Research_in_Programming_Teaching_Tools_An_Initial_Review","265789392_Gamification_for_Engaging_Computer_Science_Students_in_Learning_Activities_A_Case_Study","319139246_Using_Gamification_to_Teach_Students_Programming_Concepts","272863845_Gamified_Approach_to_Database_Normalization","234639732_Understanding_and_Promoting_Transformative_Learning_A_Guide_for_Educators_of_Adults_Jossey-Bass_Higher_and_Adult_Education_Series","220017733_Connectivism_A_Learning_Theory_for_the_Digital_Age","27399212_Constructivist_or_instructivist_Pedagogical_concepts_practically_applied_to_a_computer_learning_environment"]}