{"id":"331677136_Real-Time_Healthcare_Data_Transmission_for_Remote_Patient_Monitoring_in_Patch-Based_Hybrid_OCCBLE_Networks","abstract":"Research on electronic healthcare (eHealth) systems has increased dramatically in recent years. eHealth represents a significant example of the application of the Internet of Things (IoT), characterized by its cost effectiveness, increased reliability, and minimal human eff ort in nursing assistance. The remote monitoring of patients through a wearable sensing network has outstanding potential in current healthcare systems. Such a network can continuously monitor the vital health conditions (such as heart rate variability, blood pressure, glucose level, and oxygen saturation) of patients with chronic diseases. Low-power radio-frequency (RF) technologies, especially Bluetooth low energy (BLE), play significant roles in modern healthcare. However, most of the RF spectrum is licensed and regulated, and the effect of RF on human health is of major concern. Moreover, the signal-to-noise-plus-interference ratio in high distance can be decreased to a considerable extent, possibly leading to the increase in bit-error rate. Optical camera communication (OCC), which uses a camera to receive data from a light-emitting diode (LED), can be utilized in eHealth to mitigate the limitations of RF. However, OCC also has several limitations, such as high signal-blockage probability. Therefore, in this study, a hybrid OCC/BLE system is proposed to ensure efficient, remote, and real-time transmission of a patient’s electrocardiogram (ECG) signal to a monitor. First, a patch circuit integrating an LED array and BLE transmitter chip is proposed. The patch collects the ECG data according to the health condition of the patient to minimize power consumption. Second, a network selection algorithm is developed for a new network access request generated in the patch circuit. Third, fuzzy logic is employed to select an appropriate camera for data reception. Fourth, a handover mechanism is suggested to ensure efficient network allocation considering the patient’s mobility. Finally, simulations are conducted to demonstrate the performance and reliability of the proposed system.","authors":["Moh Khalid Hasan","Md. Shahjalal","Mostafa Zaman Chowdhury","Yeong Min Jang"],"meta":["March 2019Sensors 19(5):1208","DOI:10.3390/s19051208","Projects: QoS ManagementOptical Wireless CommunicationsOptical camera communications"],"references":["329466761_Performance_Analysis_and_Improvement_of_Optical_Camera_Communication","329045999_Fuzzy_Based_Network_Assignment_and_Link-Switching_Analysis_in_Hybrid_OCCLiFi_System","328094325_An_Implementation_Approach_and_Performance_Analysis_of_Image_Sensor_Based_Multilateral_Indoor_Localization_and_Navigation_System","327613782_Integrated_RFOptical_Wireless_Networks_for_Improving_QoS_in_Indoor_and_Transportation_Applications","326218672_A_Survey_on_the_Roles_of_Communication_Technologies_in_IoT-Based_Personalized_Healthcare_Applications","323707977_Heart-Beats_Based_Biometric_Random_Binary_Sequences_Generation_to_Secure_Wireless_Body_Sensor_Networks","322348343_Wireless_Wearable_Magnetometer-Based_Sensor_for_Sleep_Quality_Monitoring","321383073_Internet_of_Things_for_Smart_Healthcare_Technologies_Challenges_and_Opportunities","329233635_Access_Point_Selection_in_Hybrid_OCCRF_eHealth_Architecture_for_Real-Time_Remote_Patient_Monitoring","325436902_Noncontact_Wearable_Wireless_ECG_Systems_for_Long-Term_Monitoring","317612417_Virtual_Respiratory_Rate_Sensors_An_Example_of_A_Smartphone-Based_Integrated_and_Multiparametric_mHealth_Gateway","312462395_Automatic_Sleep_Monitoring_Using_Ear-EEG","314934742_SpO2_and_Heart_Rate_Measurement_with_Wearable_Watch_Based_on_PPG","311488460_Uncovering_Privacy_Leakage_in_BLE_Network_Traffic_of_Wearable_Fitness_Trackers","306928440_Optical_Camera_Communications"]}