{"id":"331638347_A_class_of_discrete_dynamical_systems_with_properties_of_both_cellular_automata_and_L-systems","abstract":"We introduce and explore a type of discrete dynamic system inheriting some properties of both cellular automata (CA) and L-systems. Originally suggested by Jean Della Dora, and thus called DEM-systems after him and the two current authors, these systems can have the structural flexibility of an L-system as well as algebraic properties of CA. They are defined as sequences on a one-dimensional loop with rules governing dynamics in which new sites can be created, depending on the states of a neighbourhood of sites, and complex behaviour can be generated. Although the definition of DEM-systems is quite broad, we define some subclasses, for which more complete results can be obtained. For example, we define an additive subclass, for which algebraic results on asymptotic growth are possible, and an elementary class of particularly simple rules, for which nevertheless impressive complexity is achievable. Unlike for CA, finite initial sequences can produce positive spatial entropy over time. However, even in cases where the entropy is zero, considerable complexity is possible, especially when the sequence length grows to infinity, and we demonstrate and study behaviours of DEM-systems including fragmentation of sequences, self-reproducing patterns, self-similar but irregular patterns, patterns that not only produce new sites but produce producers of new sites, and sequences whose growth rate is sublinear, linear, quadratic, cubic, or exponential. The most complex behaviour from small finite initial conditions and the simplest class of rules appear to have positive entropy, a suggestion for which we have so far only stong numerical evidence, though we present a proof for these ‘elementary’ DEM-systems that entropy cannot reach the theoretical maximum of 1.","authors":["Roderick Edwards","Aude Maignan"],"meta":["September 2020Natural Computing 19(3)","DOI:10.1007/s11047-019-09739-5"],"references":["320565753_Modeling_the_behavior_of_human_induced_pluripotent_stem_cells_seeded_on_melt_electrospun_scaffolds","304316411_DEM-System_a_new_type_of_adaptive_system","263370178_Complex_Self-Reproducing_Systems","329230353_Classification_of_Cellular_Automata_A_Volume_in_the_Encyclopedia_of_Complexity_and_Systems_Science_Second_Edition","292383575_Cellular_automata_Classification_of","289587677_Stochastic_spatial_model_for_the_division_of_labor_in_social_insects","283617631_Cellular_automata_as_models_of_complexity","268159440_From_One-dimensional_to_Two-dimensional_Cellular_Automata","266853637_Plemmons_RJ_Nonnegative_Matrices_in_the_Mathematical_Sciences_SIAM_Philadelphia_PA","265782502_The_algorithmic_beauty_of_plants_With_James_S_Hanan_F_David_Fracchia_Deborah_R_Fowler_Martin_J_M_de_Boer_Lynn_Mercer","242083185_Generic_Emergence_of_Cognitive_Behaviour_in_Self-Generating_Neural_Networks","260881474_On_the_relationship_between_cellular_automata_and_L-systemsThe_self-replication_case","257930748_Periodic_Orbits_and_Dynamical_Complexity_in_Cellular_Automata","244960072_A_new_kind_of_science_Wolfram_Publishing","242008618_Cellular_AutomataCellular_automata_CA_Classification_of"]}