{"id":"331607136_Automatic_Identification_of_Ineffective_Online_Student_Questions_in_Computing_Education","abstract":"This Research Full Paper explores automatic identification of ineffective learning questions in the context of large-scale computer science classes. The immediate and accurate identification of ineffective learning questions opens the door to possible automated facilitation on a large scale, such as alerting learners to revise questions and providing adaptive question revision suggestions. To achieve this, 983 questions were collected from a question & answer platform implemented by an introductory programming course over three semesters in a large research university in the Southeastern United States. Questions were firstly manually classified into three hierarchical categories: 1) learning-irrelevant questions, 2) effective learning-relevant questions, 3) ineffective learning-relevant questions. The inter-rater reliability of the manual classification (Cohen's Kappa) was .88. Four different machine learning algorithms were then used to automatically classify the questions, including Naive Bayes Multinomial, Logistic Regression, Support Vector Machines, and Boosted Decision Tree. Both flat and single path strategies were explored, and the most effective algorithms under both strategies were identified and discussed. This study contributes to the automatic determination of learning question quality in computer science, and provides evidence for the feasibility of automated facilitation of online question & answer in large scale computer science classes.","authors":["Qiang Hao","April Galyardt","Bradley Barnes","Robert Maribe Branch"],"meta":["October 2018","DOI:10.1109/FIE.2018.8658642","Conference: 2018 IEEE Frontiers in Education Conference (FIE)"],"references":["315043681_Predicting_Computer_Science_Students'_Online_Help-Seeking_Tendencies","305679079_The_influence_of_achievement_goals_on_online_help_seeking_of_computer_science_students","264839902_Community_QA_Question_Classification_Is_the_Asker_Looking_for_Subjective_Answers_or_Not","260282048_An_evaluation_of_classification_models_for_question_topic_categorization","258169536_Adaptive_Intelligent_Support_to_Improve_Peer_Tutoring_in_Algebra","255614416_Perception_of_Teacher_Support_and_Reaction_Towards_Questioning_Its_Relation_to_Instrumental_Help-seeking_and_Motivation_to_Learn","301340946_What_are_the_most_important_predictors_of_computer_science_students'_online_help-seeking_behaviors","266620573_Naturally_occurring_help-seeking_exchanges_on_a_homework_help_forum","261258527_Macho-man_in_school_Toward_the_role_of_gender_role_self-concepts_and_help_seeking_in_school_performance","259514434_University_students'_achievement_goals_and_help-seeking_strategies_in_an_intelligent_tutoring_system"]}