{"id":"331613006_Multistage_classification_scheme_to_enhance_speech_emotion_recognition","abstract":"During the past decades, emotion recognition from speech has become one of the most explored areas in affective computing. These systems lack universality due to multilingualism. Research in this direction is restrained due to unavailability of emotional speech databases in various spoken languages. Arabic is one such language, which faces this inadequacy. The proposed work aims at developing a speech emotion recognition system for Arabic speaking community. A speech database with elicited emotions—anger, happiness, sadness, disgust, surprise and neutrality are recorded from 14 subjects, who are non-native, but proficient speakers in the language. The prosodic, spectral and cepstral features are extracted after pre-processing. Subsequently the features were subjected to single stage classification using supervised learning methods viz. Support vector machine and Extreme learning machine. The performance of the speech emotion recognition systems implemented are compared in terms of accuracy, specificity, precision and recall. Further analysis is carried out by adopting three multistage classification schemes. The first scheme followed a two stage classification by initially identifying gender and then the emotions. The second used a divide and conquer approach, utilizing cascaded binary classifiers and the third, a parallel approach by classification with individual features, followed by a decision logic. The result of the study depicts that, these multistage classification schemes an bring improvement in the performance of speech emotion recognition system compared to the one with single stage classification. Comparable results were obtained for same experiments carried out using Emo-DB database.","authors":["Poorna S S","G. J. Nair"],"meta":["June 2019International Journal of Speech Technology 22(3)","DOI:10.1007/s10772-019-09605-w","Project: emotion recognition"],"references":["328534439_Can_Computers_Become_Conscious_and_Overcome_Humans","325570762_Gender_Differences_in_the_Recognition_of_Vocal_Emotions","323755552_Emotion_recognition_in_Arabic_speech","322868648_Choice_of_a_classifier_based_on_properties_of_a_dataset_case_study-speech_emotion_recognition","322602563_Databases_features_and_classifiers_for_speech_emotion_recognition_a_review","342232632_Extreme_Learning_Machine_Theory_and_Applications","337994382_Recognition_of_emotion_in_a_realistic_dialogue_scenario","327842042_A_Weight_Based_Approach_for_Emotion_Recognition_from_Speech_An_Analysis_Using_South_Indian_Languages_Second_International_Conference_ICSCS_2018_Kollam_India_April_19-20_2018_Revised_Selected_Papers","323096489_Detecting_Unipolar_and_Bipolar_Depressive_Disorders_from_Elicited_Speech_Responses_Using_Latent_Affective_Structure_Model","321402797_Emotion_recognition_in_Arabic_speech","319111172_A_Two-Stage_Hierarchical_Bilingual_Emotion_Recognition_System_Using_a_Hidden_Markov_Model_and_Neural_Networks","309740301_Towards_Improving_Sentiment_Analysis_in_Arabic","319947825_IVR_Wizard_of_OZ_Field_Experiment_with_Less-Literate_Telecom_Customers","319196967_Speech_emotion_recognition_based_on_feature_selection_and_extreme_learning_machine_decision_tree","315507135_Evaluating_deep_learning_architectures_for_Speech_Emotion_Recognition"]}