{"id":"331608545_A_Topic-Agnostic_Approach_For_Identifying_Fake_News_Pages","abstract":"Fake news and misinformation have been increasingly used to manipulate popular opinion and influence political processes. To better understand fake news, how they are propagated, and how to counter their effect, it is necessary to first identify them. Recently, approaches have been proposed to automatically classify articles as fake based on their content. An important challenge for these approaches comes from the dynamic nature of news: as new political events are covered, topics and discourse constantly change and thus, a classifier trained using content from articles published at a given time is likely to become ineffective in the future. To address this challenge, we propose a topic-agnostic (TAG) classification strategy that uses linguistic and web-markup features to identify fake news pages. We report experimental results using multiple data sets which show that our approach attains high accuracy in the identification of fake news, even as topics evolve over time.","authors":["Sonia Castelo","Thais Almeida","Anas Elghafari","Aécio Santos"],"meta":["March 2019","Conference: International Workshop on Misinformation, Computational Fact-Checking and Credible Web (Co-located with WWW'2019)At: San Francisco, CA, USA"],"references":["335204039_Proppy_A_System_to_Unmask_Propaganda_in_Online_News","327286998_Predicting_Factuality_of_Reporting_and_Bias_of_News_Media_Sources","323650280_The_science_of_fake_news","322590929_Truth_of_Varying_Shades_Analyzing_Language_in_Fake_News_and_Political_Fact-Checking","321994372_Exploiting_Tri-Relationship_for_Fake_News_Detection","321485003_Tracing_Fake-News_Footprints_Characterizing_Social_Media_Messages_by_How_They_Propagate","319255985_Automatic_Detection_of_Fake_News","318981549_Fake_News_Detection_on_Social_Media_A_Data_Mining_Perspective","318575699_Fake_News_and_The_Economy_of_Emotions_Problems_causes_solutions","316712634_Social_Media_and_Fake_News_in_the_2016_Election"]}