{"id":"331687595_Introducing_Programming_Skills_for_Life_Science_Students","abstract":"The advent of the high‐throughput next‐generation sequencing produced a large number of biological data. Knowledge discovery from the huge amount of available biological data requires researchers to develop solid skills in biology and computer science. As the majority of the Bioinformatics professionals are either computer science or life sciences graduates, to teach biology skills to computer science students and computational skills to life science students has become usual. In this article, we reported the experience of teaching programming for life science students. Our strategy is composed by explaining basic concepts of algorithms, abstraction of biological problems, and script programming using Python language. Based on the student's answers to an assessment questionnaire, we conclude that the course achieved positive results. They reported an improvement in their skills in programming and bioinformatics. Furthermore, the students approved the didactic adopted in the classes and evaluation methods (programming exercises and final presentation). This article is useful for other professors who want to implement an initial bioinformatics training for undergraduate or graduate students in life sciences. We believe that the strategies here demonstrated could be reproduced, which could help in the formation of a new generation of bioinformaticians with hybrid abilities in computation and biology.","authors":["Diego Mariano","Pedro Magalhães Martins","Lucianna Helene Santos","Raquel Melo-Minardi"],"meta":["March 2019Biochemistry and Molecular Biology Education 47(3)","DOI:10.1002/bmb.21230"],"references":["322406982_Assessing_an_effective_undergraduate_module_teaching_applied_bioinformatics_to_biology_students","319197000_Characterization_of_glucose-tolerant_b-glucosidases_used_in_biofuel_production_under_the_bioinformatics_perspective_A_systematic_review","303337342_An_Introduction_to_Programming_for_Bioscientists_A_Python-Based_Primer","280868044_Learning_Nucleic_Acids_Solving_by_Bioinformatics_Problems","51042244_The_Roots_of_Bioinformatics_in_Theoretical_Biology","8962087_Evolving_Strategies_for_the_Incorporation_of_Bioinformatics_Within_the_Undergraduate_Cell_Biology_Curriculum","7445856_Bioinformatics_Education-Perspectives_and_Challenges","5600272_A_comparison_of_common_programming_languages_used_in_bioinformatics","5411385_NCB_Blast_a_better_web_interface","258117204_Comparative_Modeling_of_Proteins_A_Method_for_Engaging_Students'_Interest_in_Bioinformatics_Tools","228343359_Interdisciplinary_Introductory_Course_in_Bioinformatics","51251282_Bioinformatics_in_undergraduate_education_Practical_examples"]}