{"id":"331603083_On_Structural_Entropy_and_Spatial_Filling_Factor_Analysis_of_Colonoscopy_Pictures","abstract":"Colonoscopy is the standard device for diagnosing colorectal cancer, which develops from little lesions on the bowel wall called polyps. The Rényi entropies-based structural entropy and spatial filling factor are two scale- and resolution-independent quantities that characterize the shape of a probability distribution with the help of characteristic curves of the structural entropy–spatial filling factor map. This alternative definition of structural entropy is easy to calculate, independent of the image resolution, and does not require the calculation of neighbor statistics, unlike the other graph-based structural entropies.The distant goal of this study was to help computer aided diagnosis in finding colorectal polyps by making the Rényi entropy based structural entropy more understood. The direct goal was to determine characteristic curves that can differentiate between polyps and other structure on the picture. After analyzing the distribution of colonoscopy picture color channels, the typical structures were modeled with simple geometrical functions and the structural entropy–spatial filling factor characteristic curves were determined for these model structures for various parameter sets. A colonoscopy image analying method, i.e., the line- or column-wise scanning of the picture, was also tested, with satisfactory matching of the characteristic curve and the image.","authors":["Szilvia Nagy","Brigita Sziová","Janos Pipek"],"meta":["March 2019Entropy 21(3):256","DOI:10.3390/e21030256","Project: Image processing based on wavelets, entropy and artificial intelligence"],"references":["329134011_Ultrasound_Entropy_Imaging_of_Nonalcoholic_Fatty_Liver_Disease_Association_with_Metabolic_Syndrome","329111277_Improving_Entropy_Estimates_of_Complex_Network_Topology_for_the_Characterization_of_Coupling_in_Dynamical_Systems","328481053_A_Brief_Review_of_Generalized_Entropies","328362774_Deep_Radiomic_Analysis_of_MRI_Related_to_Alzheimer's_Disease","344558787_The_effect_of_background_and_outlier_subtraction_on_the_structural_entropy_of_two-dimensional_measured_data","331921789_The_application_of_structural_entropy_in_tissue_based_diagnosis","329200055_Classification_of_colorectal_cancer_based_on_the_association_of_multidimensional_and_multiresolution_features","328400591_The_effect_of_image_feature_qualifiers_on_fuzzy_colorectal_polyp_detection_schemes_using_KH_interpolation_-_towards_hierarchical_fuzzy_classification_of_coloscopic_still_images","328374944_Multidimensional_and_fuzzy_sample_entropy_SampEnMF_for_quantifying_HE_histological_images_of_colorectal_cancer","325981300_Bi-dimensional_multiscale_entropy_Relation_with_discrete_Fourier_transform_and_biomedical_application"]}