{"id":"331717080_MODERN_TRENDS_IN_THE_DEVELOPMENT_OF_SCHOOL_INFORMATICS_IN_RUSSIA_AND_ABROAD","abstract":"The second decade of the 21st century is characterized throughout the world by keen interest of general public in school informatics courses. It is due both to natural interest of children in everything digital in context of modern world, position of parents who believe that informatics has huge importance for the future career of their children, and to pressure of professional associations, businesses, universities concerned about status and content of school informatics courses.\nThe research discusses the historical aspects of formation and development of the national school informatics course, modern approaches to the formulation of its purposes and the selection of content. The purpose of the research is to identify and compare the main trends in the development of school informatics in Russia and in the world, to determine on this basis the possibilities of developing the methodical system of teaching informatics.\nThe results of the research led to the conclusion that Russia has been and still remain one of the world leaders in the field of general education in informatics: in our schools since 1985 to the present day there has been compulsory study of informatics, and the fundamental component occupies an important place in the content of the informatics course. Three key trends in the development of school informatics abroad have been identified: strengthening of fundamentality, compulsory, continuity. It is revealed that abroad priority attention is paid to the use of potential of informatics for the development and formation of computational (computer) thinking of younger schoolchildren. Introduction of compulsory informatics education in the early stages of general education is defined as a strategic direction for the development of Russian school informatics course.","authors":["L. L. Bosova"],"meta":["March 2019Informatics and Education","DOI:10.32517/0234-0453-2019-34-1-22-32"],"references":["297721040_Computer_science_CS_in_the_compulsory_education_curriculum_Implications_for_future_research"]}