{"id":"331785003_sCool_-_Game_Based_Learning_in_STEM_Education_A_Case_Study_in_Secondary_Education","abstract":"The game sCool [10] is a game-based tool to support learners in STEM education. It is a multi-platform mobile learning game designed for school children supporting a flexible and easy integration of various subjects and different courses. Based on the tool sCool, we present a first integrated course, which encourages children to learn computational thinking and coding in Python in a playful way. The course consists of an exploration mode and a practical mode. Thus, first, the students learn different concepts in an exploratory way and then apply the acquired knowledge in a practical mode through small programming tasks. In this paper, we present a practical approach of the tool in a classroom experience. We conducted an experiment with a group of students and evaluated different dimensions, i.e. aspects of motivation, engagement, emotions, and gender-specific issues. In this first evaluation, we found that the learners were highly motivated and encouraged to learn more about programming. It showed that both male and female participants achieved about the same performance in the game. However, results also suggests that the participants had problems to transfer the learned concepts into similar problems.","authors":["Alexander Steinmaurer","Johanna Pirker","Christian Guetl"],"meta":["January 2020","DOI:10.1007/978-3-030-11932-4_58","In book: The Challenges of the Digital Transformation in Education (pp.614-625)","Project: sCool - Serious Game for Computational Skills"],"references":["320496777_Developing_and_Application_of_Mobile_Game_Based_Learning_M-GBL_for_High_School_Students_Performance_in_Chemistry","320264162_Game-Based_Learning_for_Learning_to_Program_From_Learning_Through_Play_to_Learning_Through_Game_Development","304490353_GAME-BASED_LEARNING_AND_GAME_CONSTRUCTION_AS_AN_E-_LEARNING_STRATEGY_IN_PROGRAMMING_EDUCATION","283352600_An_Implementation_of_Game-Based_Learning_using_Alice_Programming_Environment","274309848_Computational_Thinking","266656465_Gamification_and_serious_game_approaches_for_introductory_computer_science_tablet_software","264156313_Engaging_Students_With_a_Mobile_Game-Based_Learning_System_in_University_Education","227061851_On_the_Assessment_of_Situational_Intrinsic_and_Extrinsic_Motivation_The_Situational_Motivation_Scale_SIMS","310540341_GameSchool_Teaching_Through_Gaming_and_Mobile-Based_Tutoring_Systems","254777440_Teaching_Electrical_Engineering_with_a_Serious_Game"]}