{"id":"331758289_Social_Media_Usage_Patterns_in_Higher_Education_Institutions_-_An_Empirical_Study","abstract":"The main goal of this research is to identify some notable trends, opportunities and limitations regarding the application of social media in higher education based on studying the way students use social media during their education. The re-search is focused on the impact of social media on the process of learning, creation and distribution of education related content, as well as on education related communication. The target groups of the research are students in University of Economics Varna enrolled in different bachelor and master programs.\nAn association analysis was implemented to identify the most common pat-terns regarding the application of social media in the education process. Statistical methods for testing hypothesis were used to assess the relationship between students’ specialty and derived social media patterns.\nThe findings show that Facebook groups are а preferable social media tool for communication with colleagues, content sharing and distribution, while wikis and university Learning Management Systems (LMSs) are most used for content creation and additional learning. Some social media channels are more preferable for content creation and additional learning compared to scientific databases and e-books.\nFollowing the research results a conclusion can be drawn regarding the leading part of the students in initiating the use of social media compared to the relatively smaller role of the academic staff in this process. A medium to small relationships were discovered between students’ specialty and the application of con-tent sharing communities and forums in knowledge process with students in computer science more likely to use these social media types compared to students in economics.","authors":["Yanka Aleksandrova","Silvia Parusheva"],"meta":["March 2019International Journal of Emerging Technologies in Learning (iJET) 14(05):108","DOI:10.3991/ijet.v14i05.9720","Project: Social Media in Business and Education - Innovative Models, Opportunities and Challenges (Социалните медии в бизнеса и образованието – иновативни модели, възможности и предизвикателства)"],"references":["323565839_Influencing_Factors_of_University_Students'_Use_of_Social_Network_Sites_An_Empirical_Analysis_in_China","317975285_Content_in_context_analyzing_interactions_in_a_graduate-level_academic_Facebook_group","314145315_Analysis_of_the_use_of_social_media_in_Higher_Education_Institutions_HEIs_using_the_Technology_Acceptance_Model","312934097_Taking_social_media_to_a_university_classroom_teaching_and_learning_using_Twitter_and_blogs","276400742_How_Jordanian_University_Students_Perceive_the_Opportunities_and_Challenges_of_Using_Facebook_as_a_Supplementary_Learning_Resource","222403703_Users_of_the_World_Unite_The_Challenges_and_Opportunities_of_Social_Media","311843077_Using_Twitter_for_education_Beneficial_or_simply_a_waste_of_time","311237864_Effects_of_social_media_usage_and_social_media_multitasking_on_the_academic_performance_of_university_students","292551111_Facebook_and_the_Others_Potentials_and_obstacles_of_Social_Media_for_teaching_in_higher_education","288918783_Students'_learning_styles_and_their_effects_on_the_use_of_social_media_technology_for_learning"]}