{"id":"331772621_Running_Measurement_Protocol_for_the_Quantum_First-detection_Problem","abstract":"The problem of the detection statistics of a quantum walker has received increasing interest, connected as it is to the problem of quantum search. We investigate the effect of employing a moving detector, using a projective measurement approach with fixed sampling time τ , with the detector moving right before every detection attempt. For a tight-binding quantum walk on the line, the moving detector allows one to target a specific range of group velocities of the walker, qualitatively modifying the behavior of the quantum first-detection probabilities. We map the problem to that of a stationary detector with a modified unitary evolution operator and use established methods for the solution of that problem to study the first-detection statistics for a moving detector on a finite ring and on an infinite 1D lattice. On the line, the system exhibits a dynamical phase transition at a critical value of τ , from a state where the probability of detection decreases exponentially in time and the total detection probability is very small, to a state with power-law decay and a significantly higher total probability to detect the particle. The exponent describing the power-law decay of the detection probability at this critical τ is 10/3, as opposed to 3 for every larger τ. In addition, the moving detector strongly modifies the Zeno effect.","authors":["Dror Meidan","Eli Barkai","David Kessler"],"meta":["March 2019Journal of Physics A Mathematical and Theoretical 52(35)","DOI:10.1088/1751-8121/ab3305"],"references":["329227484_Quantum_spatial_search_on_graphs_subject_to_dynamical_noise","323217502_The_spectral_dimension_controls_the_decay_of_the_quantum_first_detection_probability","322692523_First_Detected_Arrival_of_a_Quantum_Walker_on_an_Infinite_Line","321414221_Spectroscopic_signatures_of_localization_with_interacting_photons_in_superconducting_qubits","310462145_Quantum_walks_The_first_detected_passage_time_problem","324333879_Table_of_Integrals_Series_and_Products","282681583_Detection_of_a_quantum_particle_on_a_lattice_under_repeated_projective_measurements","278925254_Quantum_random_walks","275062996_The_Exponentially_Convergent_Trapezoidal_Rule","268068294_A_Guide_to_First_Passage_Time_Processes"]}