{"id":"331719678_Enhancing_achievement_and_interest_in_mathematics_learning_through_Math-Island","abstract":"Abstract Conventional teacher-led instruction remains dominant in most elementary mathematics classrooms in Taiwan. Under such instruction, the teacher can rarely take care of all students. Many students may then continue to fall behind the standard of mathematics achievement and lose their interest in mathematics; they eventually give up on learning mathematics. In fact, students in Taiwan generally have lower interest in learning mathematics compared to many other regions/countries. Thus, how to enhance students’ mathematics achievement and interest are two major problems, especially for those low-achieving students. This paper describes how we designed a game-based learning environment, called Math-Island, by incorporating the mechanisms of a construction management game into the knowledge map of the elementary mathematics curriculum. We also report an experiment conducted with 215 elementary students for 2 years, from grade 2 to grade 3. In this experiment, in addition to teacher-led instruction in the classroom, students were directed to learn with Math-Island by using their own tablets at school and at home. As a result of this experiment, we found that there is an increase in students’ mathematics achievement, especially in the calculation and word problems. Moreover, the achievements of low-achieving students in the experimental school outperformed the low-achieving students in the control school (a control group in another school) in word problems. Moreover, both the low-achieving students and the high-achieving students in the experimental school maintained a rather high level of interest in mathematics and in the system.","authors":["Charles Y. C. Yeh","Hercy N.H. Cheng","Zhi-Hong Chen","Chang-Yen Liao"],"meta":["December 2019Research and Practice in Technology Enhanced Learning 14(1)","DOI:10.1186/s41039-019-0100-9"],"references":["317452858_Knowledge_mapping_as_a_technique_to_support_knowledge_translation","282833079_Scaffold_Seeking_A_Reverse_Design_of_Scaffolding_in_Computer-Supported_Word_Problem_Solving","317953584_Adding_it_up_Helping_children_learn_mathematics","315136514_Supporting_parental_engagement_in_a_BYOD_bring_your_own_device_school","311648487_A_Computer-Based_Game_that_Promotes_Mathematics_Learning_More_than_a_Conventional_Approach","309347284_Study_of_achievement_motivation_in_relation_to_academic_achievement_of_students","307682627_shuxuedichengjiuxuexidongjizhileixingyuqubiefenxizhongxiaoxueruoshixueshengyuyibanxueshengzhibijiao_Discriminating_Math_Low-Achievement_Motivation_Patterns_Comparing_Disadvantaged_and_Other_Students_i","303781853_Examining_Motivational_Orientation_and_Learning_Strategies_in_Computer-Supported_Self-Directed_Learning_CS-SDL_for_Mathematics_The_Perspective_of_Intrinsic_and_Extrinsic_Goals","292853113_Variation_based_discovery_learning_design_in_1_to_1_mathematics_classroom","286178133_The_Effects_of_Game-Based_Learning_on_Mathematical_Confidence_and_Performance_High_Ability_vs_Low_Ability"]}