{"id":"331719791_Supervised_learning_with_quantum-enhanced_feature_spaces","abstract":"Machine learning and quantum computing are two technologies that each have the potential to alter how computation is performed to address previously untenable problems. Kernel methods for machine learning are ubiquitous in pattern recognition, with support vector machines (SVMs) being the best known method for classification problems. However, there are limitations to the successful solution to such classification problems when the feature space becomes large, and the kernel functions become computationally expensive to estimate. A core element in the computational speed-ups enabled by quantum algorithms is the exploitation of an exponentially large quantum state space through controllable entanglement and interference. Here we propose and experimentally implement two quantum algorithms on a superconducting processor. A key component in both methods is the use of the quantum state space as feature space. The use of a quantum-enhanced feature space that is only efficiently accessible on a quantum computer provides a possible path to quantum advantage. The algorithms solve a problem of supervised learning: the construction of a classifier. One method, the quantum variational classifier, uses a variational quantum circuit 1,2 to classify the data in a way similar to the method of conventional SVMs. The other method, a quantum kernel estimator, estimates the kernel function on the quantum computer and optimizes a classical SVM. The two methods provide tools for exploring the applications of noisy intermediate-scale quantum computers ³ to machine learning. © 2019, The Author(s), under exclusive licence to Springer Nature Limited.","authors":["Vojtěch Havlíček","A. Córcoles","Kristan Temme","Aram W. Harrow"],"meta":["March 2019Nature 567(7747):209-212","DOI:10.1038/s41586-019-0980-2"],"references":["324167347_Circuit-centric_quantum_classifiers","323722413_Learning_the_quantum_algorithm_for_state_overlap","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","318721159_Quantum_machine_learning_A_classical_perspective","323904931_Quantum_Machine_Learning_in_Feature_Hilbert_Spaces","323562671_Machine_learning_artificial_intelligence_in_the_quantum_domain_A_review_of_recent_progress","323549997_Quantum_Circuit_Learning","323257435_Classification_with_Quantum_Neural_Networks_on_Near_Term_Processors","319683740_Hardware-efficient_variational_quantum_eigensolver_for_small_molecules_and_quantum_magnets","317572179_Guest_Column_A_Survey_of_Quantum_Learning_Theory","311514664_Quantum_autoencoders_for_efficient_compression_of_quantum_data","311430180_Quantum_generalisation_of_feedforward_neural_networks","315454786_Quantum_Algorithms_for_Fixed_Qubit_Architectures","311668506_Classical_verification_of_quantum_circuits_containing_few_basis_changes","311492464_Error_Mitigation_for_Short-Depth_Quantum_Circuits"]}