{"id":"331772656_Where_is_the_theory_within_the_field_of_educational_technology_research","abstract":"Critics often characterise the study of educational technology as under-theorised. To\ntest this assertion and to determine the extent of this criticism, the present paper reports\nan in-depth analysis of the 503 most recent empirical articles published in three selected\neducation-technology-related journals (Computers & Education; Learning, Media and\nTechnology; and British Journal of Educational Technology). These journals were\nselected because they publish studies related to all education settings rather than\nfocusing on only a certain segment such as higher education; they have broad\ngeographical catchment; and they were the most highly ranked journals in terms of\ntheir 2017 journal citation impact factor. The present paper examines how explicitly\nexisting theory was identified in previous research, how theories were applied and how\noften these theories were advanced in education technology research. In the majority of\ncases, explicit engagement with theory was absent. Many studies either were wholly\nbereft of theories or made vague use of theory. Where theory was explicit, the articles\nwere more likely to use theory to conceptualise the research, to inform the data\ncollection or analysis process and to discuss the results. Very few articles reported\nfindings that help us to learn something new about a particular theory (ie, little evidence\nof theory advancement).\n\n(Please send me a request through ResearchGate if you wish to read the full paper).","authors":["Khe Foon Hew","Min Lan","Ying Tang","Chengyuan Jia"],"meta":["March 2019British Journal of Educational Technology 50(3):956-971","DOI:10.1111/bjet.12770"],"references":["322498276_Information_and_Communication_Technology_in_Educational_Policies_in_the_Asian_Region","321505356_What_is_Technological_Pedagogical_Content_Knowledge_TPACK","316103329_Understanding_the_Why_What_and_How_of_Theories_in_IS_Research","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","326133332_Investigation_of_community_of_inquiry_framework_in_regard_to_self-regulation_metacognition_and_motivation","326132622_Using_tablets_in_free_play_The_implementation_of_the_digital_play_framework_in_Greece","326048431_The_influences_of_self-regulated_learning_support_and_prior_knowledge_on_improving_learning_performance","320468913_The_definition_of_educational_technology_An_emerging_stability","317953561_Mind_in_society_The_development_of_higher_psychological_processes","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior"]}