{"id":"331762020_A_Pornographic_Image_and_Video_Filtering_Application_Using_Optimized_Nudity_Recognition_and_Detection_Algorithm","abstract":"The combination of multimedia technology and Internet provides an amiss channel for pornographic contents accessible by certain sensitive groups of people. Furthermore, the same channel provides the easiest medium to distribute illicit images and videos without an autonomous content supervision process. In this study, an application was developed grounded from a pixel-based approach and a skin tone detection filter to identify images and videos with a large skin color count and considered as pornographic in nature. With nudity detection algorithm as the foundation of the system, all multimedia files were preprocessed, segmented, and filtered to analyze skin-colored pixels by processing in YCbCr space and then classifying it as skin or non-skin pixels. Afterwards, the percentage of skin pixels relative to the size of the frames is calculated to be part of the mean baseline for nudity and non-nudity materials. Lastly, the application classifies the files as nude or not, and then filter it. The application was evaluated by supplying a dataset of 1,239 multimedia files (Images = 986; Videos = 253) collected from the Web. On the final testing set, the application obtained a precision of 90.33% and accuracy of 80.23% using the supplied dataset.","authors":["Beau Gray Magbanua Habal","Manuel B. Garcia","Teodoro Feria Revano","Mutaz Habal"],"meta":["November 2018","DOI:10.1109/HNICEM.2018.8666227","Conference: 2018 IEEE 10th International Conference on Humanoid, Nanotechnology, Information Technology,Communication and Control, Environment and Management (HNICEM)At: Baguio City, Philippines"],"references":["323576195_E-Learning_Technology_Adoption_in_the_Philippines_An_Investigation_of_Factors_Affecting_Filipino_College_Students'_Acceptance_of_Learning_Management_Systems","277411157_Deep_Learning","269801857_Segmentation_Algorithm_for_Multiple_Face_Detection_in_Color_Images_with_Skin_Tone_Regions_using_Color_Spaces_and_Edge_Detection_Techniques","267397987_Filter_and_Filter_Bank_Design_for_Image_Texture_Recognition","266212449_The_Nigerian_Web_Content_Combating_Pornography_using_Content_Filters","266030071_Skin_Sheriff_A_Machine_Learning_Solution_for_Detecting_Explicit_Images","249767252_An_Algorithm_for_Nudity_Detection","239798839_The_Impact_of_Internet_Pornography_on_Adolescents_A_Review_of_the_Research","312594389_Fast_and_Efficient_Skin_Detection_for_Facial_Detection","311551085_Video_pornography_detection_through_deep_learning_techniques_and_motion_information"]}