{"id":"331733147_An_Investigation_into_the_pre-enrolment_characteristics_of_students_to_identify_factors_predictive_of_academic_performance_within_first_year_computing_and_engineering_programmes_of_study_in_a_Higher_E","abstract":"First year progression rates are a key performance indicator within the higher education sector. Business intelligence can inform initiatives, interventions and supports aimed at specific student cohorts in attempts to improve progression rates. This study investigates prior educational performance, particularly in the Science Technology Engineering and Mathematics (STEM) subject categories, English and foreign languages to identify significant factors predictive of academic performance of computing and engineering first year students within the Institute of Technology Blanchardstown (ITB).\n\nThe methodology was quantitative with correlation and multiple regression employed for data analysis. First year computing (n=197) and engineering (n=247) samples were analysed for the academic terms 2013/14, 2014/15 and 2015/16. The attribute accounting for the most variance in the end of first year Grade Point Average (GPA) for the computing sample was found to be the total Leaving Certificate points attained per student. For the engineering sample, the most significant factors predictive of end of first year GPA were Mathematics points achieved in the Leaving Certificate, age and to a lesser degree total Leaving Certificate points.\n\nThe results of this analysis support the hypotheses that prior educational attainment in the Leaving Certificate is an important predictor of tertiary academic performance (R2 = .22) and that mathematical ability is an important factor influencing academic performance in engineering programmes. Outside of Mathematics, support for the hypothesis that prior educational attainment in STEM Leaving Certificate subjects is a significant influencing factor in the academic performance of computing and engineering students, proved less conclusive. Also of note, and in contrast to previous studies, Leaving Certificate performance in English was not found to be a predictor of tertiary academic performance within either of the computing and engineering cohorts analysed.","authors":["Michael Keane","Geraldine Gray"],"meta":["February 2019","Project: An investigation into the pre-enrolment characteristics of students to identify factors predictive of academic performance within first year computing and engineering programmes of study in a Higher Educational Institution"],"references":["286368488_An_Investigation_of_Psychometric_Measures_for_Modelling_Academic_Performance_in_Tertiary_Education","277129758_The_Leaving_Certificate_and_first_year_university_performance","272178031_Student_Performance_Prediction_by_Using_Data_Mining_Classification_Algorithms","264977575_A_Review_of_Psychometric_Data_Analysis_and_Applications_in_Modelling_of_Academic_Achievement_in_Tertiary_Education","318517973_Leaving_College_Rethinking_the_Causes_and_Cures_of_Student_Attrition","305686945_Non-Cognitive_Factors_of_Learning_as_Early_Indicators_of_Students_at-Risk_of_Failing_in_Tertiary_Education","279929283_Personality_and_Cognitive_Ability_Predictors_of_Performance_in_Graduate_Business_School","272177991_An_examination_of_indicators_of_engineering_students'_success_and_persistence","262218331_Review_Educational_data_mining_A_survey_and_a_data_mining-based_analysis_of_recent_works","252494664_Identifying_Factors_Influencing_Engineering_Student_Graduation_A_Longitudinal_and_Cross-Institutional_Study"]}