{"id":"331708215_Structural_transition_in_social_networks_The_role_of_homophily","abstract":"We introduce a model for the formation of social networks, which takes into account the homophily or the tendency of individuals to associate and bond with similar others, and the mechanisms of global and local attachment as well as tie reinforcement due to social interactions between people. We generalize the weighted social network model such that the nodes or individuals have F features and each feature can have q different values. Here the tendency for the tie formation between two individuals due to the overlap in their features represents homophily. We find a phase transition as a function of F or q, resulting in a phase diagram. For fixed q and as a function of F the system shows two phases separated at Fc. For F < Fc large, homogeneous, and well separated communities can be identified within which the features match almost perfectly (segregated phase). When F becomes larger than Fc, the nodes start to belong to several communities and within a community the features match only partially (overlapping phase). Several quantities reflect this transition, including the average degree, clustering coefficient, feature overlap, and the number of communities per node. We also make an attempt to interpret these results in terms of observations on social behavior of humans.","authors":["Yohsuke Murase","Hang-Hyun Jo","János Török","János Kertész"],"meta":["March 2019Scientific Reports 9(1):4310","DOI:10.1038/s41598-019-40990-z"],"references":["326558651_Homophily_influences_ranking_of_minorities_in_social_networks","321165408_An_open-source_job_management_framework_for_parameter-space_exploration_OACIS","320609146_Homophily_explains_perception_biases_in_social_networks","318720937_Fragmentation_transitions_in_a_coevolving_nonlinear_voter_model","316883680_Layered_social_influence_promotes_multiculturality_in_the_Axelrod_model","312153320_Mixing_beliefs_among_interacting_agents","304757373_Modeling_confirmation_bias_and_polarization","311899572_Epidemic_processes_in_complex_networks","307996851_Homophily_group_size_and_the_diffusion_of_political_information_in_social_networks_Evidence_from_Twitter","305780197_Community_detection_in_networks_A_user_guide"]}