{"id":"331836693_Character_level_embedding_with_deep_convolutional_neural_network_for_text_normalization_of_unstructured_data_for_Twitter_sentiment_analysis","abstract":"On social media platforms such as Twitter and Facebook, people express their views, arguments, and emotions of many events in daily life. Twitter is an international microblogging service featuring short messages called “tweets” from different languages. These texts often consist of noise in the form of incorrect grammar, abbreviations, freestyle, and typographical errors. Sentiment analysis (SA) aims to predict the actual emotions from the raw text expressed by the people through the field of natural language processing (NLP). The main aim of our work is to process the raw sentence from the Twitter dataset and find the actual polarity of the message. This paper proposes a text normalization with deep convolutional character level embedding (Conv-char-Emb) neural network model for SA of unstructured data. This model can tackle the problems: (1) processing the noisy sentence for sentiment detection (2) handling small memory space in word level embedded learning (3) accurate sentiment analysis of the unstructured data. The initial preprocessing stage for performing text normalization includes the following steps: tokenization, out of vocabulary (OOV) detection and its replacement, lemmatization and stemming. A character-based embedding in convolutional neural network (CNN) is an effective and efficient technique for SA that uses less learnable parameters in feature representation. Thus, the proposed method performs both the normalization and classification of sentiments for unstructured sentences. The experimental results are evaluated in the Twitter dataset by a different point polarity (positive, negative and neutral). As a result, our model performs well in normalization and sentiment analysis of the raw Twitter data enriched with hidden information.","authors":["Monika Arora","Vineet Kansal"],"meta":["March 2019Social Network Analysis and Mining 9(1)","DOI:10.1007/s13278-019-0557-y"],"references":["323750220_Sentic_LSTM_a_Hybrid_Network_for_Targeted_Aspect-Based_Sentiment_Analysis","322794225_DataStories_at_SemEval-2017_Task_4_Deep_LSTM_with_Attention_for_Message-level_and_Topic-based_Sentiment_Analysis","322793610_SiTAKA_at_SemEval-2017_Task_4_Sentiment_Analysis_in_Twitter_Based_on_a_Rich_Set_of_Features","322793086_SemEval-2017_Task_4_Sentiment_Analysis_in_Twitter","325064348_An_unsupervised_aspect_extraction_strategy_for_monitoring_real-time_reviews_stream","322795599_ej-sa-2017_at_SemEval-2017_Task_4_Experiments_for_Target_oriented_Sentiment_Analysis_in_Twitter","322794737_NILC-USP_at_SemEval-2017_Task_4_A_Multi-view_Ensemble_for_Twitter_Sentiment_Analysis","322794228_OMAM_at_SemEval-2017_Task_4_English_Sentiment_Analysis_with_Conditional_Random_Fields","322588027_Recurrent_Attention_Network_on_Memory_for_Aspect_Sentiment_Analysis","321936382_DeepNorm-A_Deep_Learning_Approach_to_Text_Normalization","321718880_A_Deep_Network_Model_for_Paraphrase_Detection_in_Short_Text_Messages","320402302_Text_Normalization_Algorithm_on_Twitter_in_Complaint_Category","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319347689_T-SAF_Twitter_sentiment_analysis_framework_using_a_hybrid_classification_scheme"]}