{"id":"331874525_A_new_wave_of_innovation_in_Semantic_web_tools_for_drug_discovery","abstract":"Introduction: The use of semantic web technologies to aid drug discovery has gained momentum over recent years. Researchers in this domain have realized that semantic web technologies are key to dealing with the high levels of data for drug discovery. These technologies enable us to represent the data in a formal, structured, interoperable and comparable way, and to tease out undiscovered links between drug data (be it identifying new drug-targets or relevant compounds, or links between specific drugs and diseases).\nAreas covered: This review focuses on explaining how semantic web technologies are being used to aid advances in drug discovery. The main types of semantic web technologies are explained, outlining how they work and how they can be used in the drug discovery process, with a consideration of how the use of these technologies has progressed from their initial usage.\nExpert opinion: The increased availability of shared semantic resources (tools, data and importantly the communities) have enabled the application of semantic web technologies to facilitate semantic (context dependent) search across multiple data sources, which can be used by machine learning to produce better predictions by exploiting the semantic links in knowledge graphs and linked datasets.","authors":["Samantha Kanza","Jeremy Graham Frey"],"meta":["March 2019Expert Opinion on Drug Discovery 14(5):1-12","DOI:10.1080/17460441.2019.1586880","Project: AI3SD Network+ (Artificial Intelligence and Augmented Intelligence for Automated Investigations for Scientific Discovery)"],"references":["330932810_The_gut_microbiome_from_patients_with_schizophrenia_modulates_the_glutamate-glutamine-GABA_cycle_and_schizophrenia-relevant_behaviors_in_mice","328256103_Explicit_interaction_information_from_WikiPathways_in_RDF_facilitates_drug_discovery_in_the_Open_PHACTS_Discovery_Platform","326691924_How_far_have_we_come_with_contextual_data_integration_in_drug_discovery","325535320_Recommendations_toward_a_human_pathway-based_approach_to_disease_research","325479312_Connecting_genetics_and_gene_expression_data_for_target_prioritisation_and_drug_repositioning","325445807_SemaTyP_A_knowledge_graph_based_literature_mining_method_for_drug_discovery","325272446_RepTB_a_gene_ontology_based_drug_repurposing_approach_for_tuberculosis","328720763_ProvCaRe_Characterizing_Scientific_Reproducibility_of_Biomedical_Research_Studies_using_Semantic_Provenance_Metadata","327018838_Identification_of_novel_immune-relevant_drug_target_genes_for_Alzheimer's_Disease_by_combining_ontology_inference_with_network_analysis","324762374_Computer-Aided_Drug_Discovery"]}