{"id":"331841671_Modelagem_de_processos_de_negocio_efeito_do_metodo_de_notacao_no_nivel_de_ambiguidade","abstract":"Resumo A proposta deste estudo experimental controlado e aleatorizado foi analisar a especificação de requisitos funcionais. Avaliaram-se os possíveis impactos do método de notação de modelagem de processo no nível de ambiguidade presente na especificação em linguagem natural. As notações foram utilizadas como instrumento para manifestar as necessidades do usuário quanto ao processo de compra em aplicações de comércio eletrônico - caso de uso típico de sistemas de informação empresarial. A partir de um protótipo de baixa fidelidade, que representa o processo de compra numa loja virtual, 43 estudantes de graduação em ciência da computação foram agrupados de acordo com as notações desempenhadas: grupo controle linguagem natural (GC); grupo experimental máquina de estados finitos (GEMEF); e o grupo experimental notação combinada (GENC), que utilizou anotação manual de papéis semânticos baseados em máquina de estados finitos. Foi utilizado o conceito que trata da ambiguidade como informações inconsistentes que levam a múltiplas interpretações do documento de especificação dos requisitos funcionais. Pela técnica de leitura baseada em teste, associada à utilização da métrica de qualidade apropriada, foi conduzida uma análise de variância de fator único com delineamento completamente casualizado para saber se o método de notação, como fator primário, afeta o nível de ambiguidade. A comparação intergrupo sugere que: a notação combinada é o melhor método para reduzir o nível de ambiguidade da especificação de requisitos; e que a especificação de requisitos expressa em máquina de estados finitos gera o maior o nível de ambiguidade dentre as notações avaliadas. No entanto, estas tendências não são estatisticamente significativas. De forma geral, observou-se que a variável independente, método de notação, não afeta o nível de ambiguidade do processo descrito na especificação de requisitos funcionais.","authors":["Antônio Eduardo Carvalho e Silva","Rogério Atem De Carvalho","Hudson Silva Ferreira"],"meta":["March 2019Gestão & Produção 26(1)","DOI:10.1590/0104-530x1624-19"],"references":["290580324_Business_Language_Driven_Development_Joining_business_process_models_to_automated_tests","233952392_Metrics_for_Requirements_Engineering_and_Automated_Requirements_Tools","227300599_Effective_Communication_in_Requirements_Elicitation_A_Comparison_of_Methodologies","328955298_Advances_in_Enterprise_Information_Systems_II","312455832_R_A_Language_and_Environment_for_Statistical_Computing","308468610_Speech_and_language_processing_An_introduction_to_natural_language_processing_computational_linguistics_and_speech_recognition","251137164_Process_Modeling_and_Analysis","243777430_Lab_Package_for_the_Empirical_Investigation_of_Perspective-Based_Reading_Available_at_httpwww","236896091_Modeling_and_Measuring_Process_Conformance_in_Empirical_Studies_of_Software_Development","235616363_User_Stories_Applied_For_Agile_Software_Development","226556295_Tracing_Requirements_Errors_to_Problems_in_the_Requirements_Engineering_Process","221630852_Involving_Business_Users_in_Formal_Modeling_Using_Natural_Language_Pattern_Sentences","221250632_Semantic_Business_Process_Modeling_-_Benefits_and_Capability","222584164_Communication_issues_in_requirements_elicitation_A_content_analysis_of_stakeholder_experiences","222515733_A_systematic_literature_review_to_identify_and_classify_software_requirement_errors"]}