{"id":"331880680_A_Decision_Support_System_for_Dynamic_Job-Shop_Scheduling_Using_Real-Time_Data_with_Simulation","abstract":"The wide usage of information technologies in production has led to the Fourth Industrial Revolution, which has enabled real data collection from production tools that are capable of communicating with each other through the Internet of Things (IoT). Real time data improves production control especially in dynamic production environments. This study proposes a decision support system (DSS) designed to increase the performance of dispatching rules in dynamic scheduling using real time data, hence an increase in the overall performance of the job-shop. The DSS can work with all dispatching rules. To analyze its effects, it is run with popular dispatching rules selected from the literature on a simulation model created in Arena®. When the number of jobs waiting in the queue of any workstation in the job-shop falls to a critical value, the DSS can change the order of schedules in its preceding workstations to feed the workstation as soon as possible. For this purpose, it first determines the jobs in the preceding workstations to be sent to the current workstation, then finds the job with the highest priority number according to the active dispatching rule, and lastly puts this job in the first position in its queue. The DSS is tested under low, normal, and high demand rate scenarios with respect to six performance criteria. It is observed that the DSS improves the system performance by increasing workstation utilization and decreasing both the number of tardy jobs and the amount of waiting time regardless of the employed dispatching rule.","authors":["Ahmet Kursad Turker","Adnan Aktepe","Ali Firat Inal","Olcay  Ozge Ersoz"],"meta":["March 2019","DOI:10.3390/math7030278"],"references":["329009071_Solving_the_Job-Shop_Scheduling_Problem_in_the_Industry_40_Era","328585765_Energy-Efficient_Scheduling_for_a_Job_Shop_Using_an_Improved_Whale_Optimization_Algorithm","327294794_IoT-enabled_dynamic_lean_control_mechanism_for_typical_production_systems","326823239_Industry_40_Smart_Scheduling","324455029_A_Review_of_Automated_Decision_Support_System","322566556_Data-driven_smart_manufacturing","320270296_Dispatching_algorithm_for_production_programming_of_flexible_job-shop_systems_in_the_smart_factory_industry","324622488_Simulation_Modeling_and_Analysis","324545685_A_framework_for_dynamic_rescheduling_problems","322322213_Real-time_job_shop_scheduling_based_on_simulation_and_Markov_decision_processes"]}