{"id":"331854683_Unraveling_the_molecular_mechanisms_of_color_expression_in_anthocyanins","abstract":"Anthocyanins are a broad family of natural dyes, increasingly finding application as substitutes for artificial colorants in the food industry. In spite of their importance and ubiquity, the molecular principles responsible for their extreme color variability are poorly known. We address these mechanisms by computer simulations and photoabsorption experiments of cyanidin-3-O-glucoside in water solution, as a proxy for more complex members of the family. Experimental results are presented in the range of pH 1-9, accompanied by a comprehensive systematic computational study across relevant charge states and tautomers. The computed spectra are in excellent agreement with the experiments, providing unprecedented insight into the complex behavior underlying color expression in these molecules. Besides confirming the importance of the molecule's charge state, we also unveil the hitherto unrecognized role of internal distortion in the chromophore, which affects its degree of conjugation, modulating the optical gap and in turn the color. This entanglement of structural and electronic traits is also shared by other members of the anthocyanin family (e.g. pelargonin and delphinidin) highlighting a common mechanism for color expression across this important family of natural dyes.","authors":["Mariami Rusishvili","Luca Grisanti","Sara Laporte","Marco Micciarelli"],"meta":["March 2019Physical Chemistry Chemical Physics 21(7)","DOI:10.1039/C9CP00747D","Project: Marissa"],"references":["311849814_Comparison_of_food_colour_regulations_in_the_EU_and_the_US_-_review_of_current_provisions","309957435_Spectral_and_Colorimetric_Characteristics_of_Metal_Chelates_of_Acylated_Cyanidin_Derivatives","303747461_Predicting_light_absorption_properties_of_anthocyanidins_in_solution_a_multi-level_computational_approach","297722276_Stabilizing_and_Modulating_Color_by_Copigmentation_Insights_from_Theory_and_Experiment","287996327_Canonical_Dynamics_Equilibrium_Phase-Space_Distributions","326163631_On_the_importance_of_accurate_structures_for_quantum-chemistry_embedding_methods_Which_strategy_is_better","323553815_The_modeling_of_the_absorption_lineshape_for_embedded_molecules_through_a_polarizable_QMMM_approach","305497823_Multimodel_Approach_to_the_Optical_Properties_of_Molecular_Dyes_in_Solution","286354964_Measuring_Colour_Fourth_Edition","284575918_Effects_of_substitution_for_hydroxyl_in_the_B-ring_of_the_flavylium_cation"]}