{"id":"331848759_Computational_and_natural_language_processing_based_studies_of_hadith_literature_a_survey","abstract":"Hadith is one of the most celebrated resources of Classical Arabic text. The hadiths, or Prophetic traditions (tradition for short), are narrations originating from the sayings and conduct of Prophet Muhammad. For Muslims, hadiths are the second most important source of Islamic jurisprudence after the Holy Qur’an. Each hadith consists of two parts, isnad and matn. Matn represents the actual text of the hadith, while isnad unwinds the chain of the authorities which precede and introduce the matn, the succession of people through whose channel the hadith reaches the last transmitter. The hadith corpus is huge and runs into hundreds of volumes. It has an even larger supporting work, e.g., commentaries, biographic material etc. Recently, there has been a renewed interest of this important subject by non-specialists. There are many research studies which have been published regarding hadith, specifically applying computational and natural language processing (NLP) techniques to help address some of the outstanding issues, or derive new insight into this classic resource. This paper surveys all major works that have addressed the subject of hadith through various computational and NLP methods, grouping them under three categories: hadith content-based studies, narration-based studies, and overall studies. We also take an in-depth look into pioneering works with many details appearing for the first time. Finally, we outline future research directions in Arabic hadith literature, including novel application of emerging natural language concept based sentiment and emotion mining techniques.","authors":["Aqil Azmi","Abdulaziz Omar Al-Qabbany","Amir Hussain"],"meta":["August 2019Artificial Intelligence Review 52(1)","DOI:10.1007/s10462-019-09692-w"],"references":["344774928_SHEIKH_AL-AZAMI'S_PIONEERING_WORK_ON_QUR'AN_AND_HADITH-BRINGING_THEM_INTO_THE_DIGITAL_ERA","335526746_Using_non-conventional_search_schemes_to_retrieve_Hadiths","335526741_A_novel_method_to_automatically_pass_hukm_on_Hadith","323750220_Sentic_LSTM_a_Hybrid_Network_for_Targeted_Aspect-Based_Sentiment_Analysis","321164568_Comparative_Study_of_Machine_Learning_Approach_on_Malay_Translated_Hadith_Text_Classification_based_on_Sanad","321069732_Applications_of_Deep_Learning_and_Reinforcement_Learning_to_Biological_Data","320972227_A_Rich_Arabic_WordNet_Resource_for_Al-Hadith_Al-Shareef","331421739_BabelSenticNet_A_Commonsense_Reasoning_Framework_for_Multilingual_Sentiment_Analysis","330272705_On_the_Usage_of_a_Classical_Arabic_Corpus_as_a_Language_Resource_Related_Research_and_Key_Challenges","320496995_Semi-Supervised_Learning_for_Big_Social_Data_Analysis"]}