{"id":"331880546_Guidance_in_Cinematic_Virtual_Reality-Taxonomy_Research_Status_and_Challenges","abstract":"In Cinematic Virtual Reality (CVR), the viewer of an omnidirectional movie can freely choose the viewing direction when watching a movie. Therefore, traditional techniques in filmmaking for guiding the viewers’ attention cannot be adapted directly to CVR. Practices such as panning or changing the frame are no longer defined by the filmmaker; rather it is the viewer who decides where to look. In some stories, it is necessary to show certain details to the viewer, which should not be missed. At the same time, the freedom of the viewer to look around in the scene should not be destroyed. Therefore, techniques are needed which guide the attention of the spectator to visual information in the scene. Attention guiding also has the potential to improve the general viewing experience, since viewers will be less afraid to miss something when watching an omnidirectional movie where attention-guiding techniques have been applied. In recent years, there has been a lot of research about attention guiding in images, movies, virtual reality, augmented reality and also in CVR. We classify these methods and offer a taxonomy for attention-guiding methods. Discussing the different characteristics, we elaborate the advantages and disadvantages, give recommendations for use cases and apply the taxonomy to several examples of guiding methods.","authors":["Sylvia Rothe","Daniel Buschek","Heinrich Hussmann"],"meta":["March 2019Multimodal Technologies and Interaction 3(1):19","DOI:10.3390/mti3010019","Project: Guidance in Cinematic Virtual Reality"],"references":["329494516_VRHapticDrones_Providing_Haptics_in_Virtual_Reality_through_Quadcopters","329493859_GazeRecall_Using_Gaze_Direction_to_Increase_Recall_of_Details_in_Cinematic_Virtual_Reality","326025677_Dynamic_Subtitles_in_Cinematic_Virtual_Reality","325415889_Beyond_Halo_and_Wedge_Visualizing_Out-of-View_Objects_on_Head-mounted_Virtual_and_Augmented_Reality_Devices","329245656_Virtual_Reality_as_a_Learning_Tool_How_and_Where_to_Start_with_Immersive_Teaching","328321300_FacePush_Introducing_Normal_Force_on_Face_with_Head-Mounted_Displays","327490043_Towards_Efficient_Visual_Guidance_in_Limited_Field-of-View_Head-Mounted_Displays","327324541_Attention_Guiding_Using_Augmented_Reality_in_Complex_Environments","326371428_Guiding_the_Viewer_in_Cinematic_Virtual_Reality_by_Diegetic_Cues","324835040_Snap-changes_a_Dynamic_Editing_Strategy_for_Directing_Viewer's_Attention_in_Streaming_Virtual_Reality_Videos"]}