{"id":"331864343_On_the_Automated_Evolutionary_Design_of_Neural_Networks-Past_Present_and_Future","abstract":"Neuroevolution is the name given to a field of computer science that applies evolutionary computation for evolving some aspects of neural networks. After the AI Winter came to an end, neural networks reemerged to solve a great variety of problems. However, their usage requires designing their topology, a decision with a potentially high impact on performance. Whereas many works have tried to suggest rules-of-thumb for designing topologies, the truth is that there are not analytic procedures for determining the optimal one for a given problem, and trial-and-error is often used instead. Neuroevolution arose almost three decades ago, with some works focusing on the evolutionary design of the topology and most works describing techniques for learning connection weights. Since then, evolutionary computation has been proved to be a convenient approach for determining the topology and weights of neural networks, and neuroevolution has been applied to a great variety of fields. However, for more than two decades neuroevolution has mainly focused on simple artificial neural networks models, far from today's deep learning standards. This is insufficient for determining good architec-tures for modern networks extensively used nowadays, which involve multiple hidden layers, recurrent cells, etc. More importantly, deep and convolutional neural networks have become a de facto standard in representation learning","authors":["Alejandro Baldominos","Yago Sáez","Pedro Isasi"],"meta":["January 2020Neural Computing and Applications 32(2):519-545","DOI:10.1007/s00521-019-04160-6","Project: Automatic design of deep neural networks"],"references":["328816477_Model_Selection_in_Committees_of_Evolved_Convolutional_Neural_Networks_Using_Genetic_Algorithms","324694064_Evolutionary_Design_of_Convolutional_Neural_Networks_for_Human_Activity_Recognition_in_Sensor-Rich_Environments","340179374_Theano_A_CPU_and_GPU_Math_Compiler_in_Python","334221508_NSGA-Net_neural_architecture_search_using_multi-objective_genetic_algorithm","330052567_Evolving_Deep_Neural_Networks","327314064_Limited_Evaluation_Evolutionary_Optimization_of_Large_Neural_Networks_41st_German_Conference_on_AI_Berlin_Germany_September_24-28_2018_Proceedings","327122063_Lamarckian_Evolution_of_Convolutional_Neural_Networks_15th_International_Conference_Coimbra_Portugal_September_8-12_2018_Proceedings_Part_II","326202443_A_Genetic_Programming_Approach_to_Designing_Convolutional_Neural_Network_Architectures","325800590_Evolutionary_Approach_to_Machine_Learning_and_Deep_Neural_Networks","325799313_Evolutionary_Approach_to_Deep_Learning"]}