{"id":"331854736_Resilient_Supplier_Selection_and_Optimal_Order_Allocation_Under_Disruption_Risks","abstract":"Resilient supplier selection is a key strategic decision in the context of the supply chain (SC) disruption management.\nWe offer an efficient solution to the resilient supplier selection and optimal order allocation problem.\nWe first show how to compute the likelihood of disruption scenarios for the supplier selection problem using a\nprobabilistic graphical model. That model can capture (i) a large number of disruptive events with no computational\nburden, and (ii) the dependencies among disruptive events and their impacts on supplier performance,\ni.e., the ripple effect. We then propose a stochastic bi-objective mixed integer programming model to support the\ndecision-making in how and when to use both proactive and reactive strategies in supplier selection and order\nallocation. The outcomes of this research, if utilized properly, can benefit suppliers to find the optimal set of\noperational decisions (e.g., the optimal level of surplus capacity and restorative capacity) that enhance their\nresilience capabilities. Finally, the proposed model can be utilized as a decision support tool to assist manufacturers\nin performance assessment of supplier alternatives when costs and resilience are considered simultaneously,\nwhich helps to build up both efficient and resilient SC (i.e., to achieve the SC resilience) to ensure the\noperations continuity. These outcomes can help SC managers organize their disruption risk mitigation efforts\nwith balancing the efficiency and resilience while focusing on critical suppliers and order (re)-allocation that will\nhave a more significant impact on the performance of the SC when disrupted.","authors":["Seyedmohsen Hosseini","Nazanin Morshedlou","Dmitry Ivanov","M.D. Sarder"],"meta":["March 2019International Journal of Production Economics 213","DOI:10.1016/j.ijpe.2019.03.018","Project: Supply chain design resilience assessment with structure dynamics considerations"],"references":["332105861_Review_of_quantitative_methods_for_supply_chain_resilience_analysis","247522867_Agent-based_modelling_of_complex_productiondistribution_systems_to_improve_resilience"]}