{"id":"331809605_Influence_d'un_amorcage_olfactif_chez_des_adultes_de_statut_ponderal_different","abstract":"Discipline\nClinique.\n\nIntroduction et but de l’étude\nDes études suggèrent que les biais attentionnels (BA) envers les aliments (tendance des stimuli alimentaires à attirer automatiquement l’attention) jouent un rôle dans le maintien/développement de l’obésité. Notre objectif est de caractériser ces BA chez des adultes normo-pondéraux (NP), en surpoids (S) et obèses (O), ainsi que la manière dont l’environnement olfactif peut les influencer afin de mieux comprendre des choix alimentaires délétères pour la santé.\n\nMatériel et méthodes\nUne mesure d’orientation de l’attention visuelle envers les stimuli alimentaires a été développée. Les participants (36 NP, 26 S, 24 O) ont réalisé une tâche informatique (Food Adapted Visual Probe Task) couplée à un paradigme d’amorçage olfactif, nous permettant d’évaluer l’influence d’odeurs alimentaires non-attentivement perçues (séance implicite) vs. attentivement perçues (séance explicite) sur les biais attentionnels. L’exposition à des odeurs signalant des aliments à haute densité énergétique (HDE) (odeur de quatre quarts) vs. faible densité énergétique (LDE) (odeur de poire) nous permet de mesurer la différence d’impact de signaux sensoriels sur ces individus de statuts pondéraux différents.\n\nRésultats et analyse statistique\nLes résultats ont été analysés en utilisant un modèle linéaire mixte estimé à l’aide du package nlme du logiciel R (v. 3,4.3.). Les résultats indiquent un BA envers l’alimentation, quel que soit le statut pondéral des individus (p < 0,0001). Ce BA est exacerbé lorsque les aliments sont à HDE (p < 0,0001). Un effet d’amorçage significatif est observé uniquement lorsque les odeurs sont non-attentivement perçues (séance implicite). Dans cette condition implicite, les O et NP ne réagissent pas de la même façon aux odeurs alimentaires (p = 0,02). En effet, les O ont une orientation plus prononcée de l’attention envers les stimuli alimentaires lorsqu’ils sont non attentivement exposés à une odeur HDE (quatre-quarts) comparé à l’odeur LDE (poire (p = 0,02).\n\nConclusion\nFinalement, nos résultats confirment l’intérêt d’étudier des facteurs cognitifs (les BA), et soulignent la pertinence d’utiliser l’amorçage pour impacter ces derniers, afin de mieux comprendre les liens entre l’environnement et le comportement alimentaire. Des études à venir chercheront à confirmer ces résultats en utilisant des techniques EEG et tenteront de relier la présence de tels biais à des choix alimentaires délétères pour la santé.","authors":["Marine Mas","Stephanie Chambaron","Claire Chabanet","M-C Brindisi"],"meta":["March 2019Nutrition Clinique et Metabolisme 33(1):84-85","DOI:10.1016/j.nupar.2019.01.381","Projects: Cognitive biases and Obesity in adultsIMPLICEAT : Importance of IMPLICit factors in EATing behaviour:IMPLICEAT : Importance of IMPLICit factors in EATing behaviour"],"references":[]}