{"id":"331872694_Semi-Supervised_Self-Training_Method_Based_on_An_Optimum-Path_Forest","abstract":"Semi-supervised self-training method can train an effective classifier by exploiting labeled and unlabeled samples. Recently, a self-training method based on density peaks of data (STDP) is proposed. However, it still suffers from some shortcomings to be addressed. For example, STDP is affected by cut-off distance dc. As a result, it’s tricky for STDP to select an optimal parameter dc on each data set. Furthermore, STDP have a poor performance on data sets with some variations in density because of cut-off distance dc. In order to solve these problems, we present a new self-training method which connects unlabeled and labeled samples as vertexes of an optimum path forest to discover the underlying structure of feature space. Next, the underlying structure of feature space is used to guide self-training method to train a classifier. Compared with STDP, our algorithm is free of parameters and can work better on data sets with some variations in density. Moreover, we are surprised to find that our algorithm also has some advantages in dealing with overlapping data sets. Experimental results on real data sets clearly demonstrate that our algorithm has better performance than some previous works in improving the performance of base classifiers of k-nearest neighbor, support vector machine and cart.","authors":["Junnan Li","Qingsheng Zhu"],"meta":["March 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2903839"],"references":["326756191_Dynamic_graph-based_label_propagation_for_density_peaks_clustering","326092524_Multi-Label_Semi-Supervised_Classification_Through_Optimum-Path_Forest","325851322_Fractional-order_Darwinian_PSO-Based_Feature_Selection_for_Media-Adventitia_Border_Detection_in_Intravascular_Ultrasound_Images","325306289_Natural_Neighborhood_Graph-based_Instance_Reduction_Algorithm_without_Parameters","324813624_Safety-aware_Graph-based_Semi-Supervised_Learning","324493581_Revisiting_Transductive_Support_Vector_Machines_with_Margin_Distribution_Embedding","323870976_Shared-Nearest-Neighbor-Based_Clustering_by_Fast_Search_and_Find_of_Density_Peaks","321710211_An_improved_optimum-path_forest_clustering_algorithm_for_remote_sensing_image_segmentation","320678770_SSEL-ADE_A_semi-supervised_ensemble_learning_framework_for_extracting_adverse_drug_events_from_social_media","320382670_Effective_Semi-Supervised_Learning_Strategies_for_Automatic_Sentence_Segmentation"]}