{"id":"331974972_Invasive_buffelgrass_detection_using_high-resolution_satellite_and_UAV_imagery_on_Google_Earth_Engine","abstract":"Abstract Methods to detect and monitor the spread of invasive grasses are critical to avoid ecosystem transformations and large economic costs. The rapid spread of non‐native buffelgrass(Pennisetum ciliare) has intensified fire risk and is replacing fire intolerant native vegetation in the Sonoran Desert of the southwestern US. Coarse‐resolution satellite imagery has had limited success in detecting small patches of buffelgrass, whereas ground‐based and aerial survey methods are often cost prohibitive. To improve detection, we trained 2 m resolution DigitalGlobe WorldView‐2 satellite imagery with 12 cm resolution unmanned aerial vehicle (UAV) imagery and classified buffelgrass on Google Earth Engine, a cloud computing platform, using Random Forest (RF) models in Saguaro National Park, Arizona, USA. Our classification models had an average overall accuracy of 93% and producer's accuracies of 94–96% for buffelgrass, although user's accuracies were low. We detected a 2.92 km2 area of buffelgrass in the eastern Rincon Mountain District (1.07% of the total area) and a 0.46 km2 area (0.46% of the total area) in the western Tucson Mountain District of Saguaro National Park. Buffelgrass cover was significantly greater in the Sonoran Paloverde‐Mixed Cacti Desert Scrub vegetation type, on poorly developed Entisols and Inceptisol soils and on south‐facing topographic aspects compared to other areas. Our results demonstrate that high‐resolution imagery improve on previous attempts to detect and classify buffelgrass and indicate potential areas where the invasive grass might spread. The methods demonstrated in this study could be employed by land managers as a low‐cost strategy to identify priority areas for control efforts and continued monitoring.","authors":["Kaitlyn Elkind","Temuulen Tsagaan Sankey","Seth Munson","Clare E Aslan"],"meta":["March 2019Remote Sensing in Ecology and Conservation 5(4)","DOI:10.1002/rse2.116"],"references":["318246365_Google_Earth_Engine_Planetary-scale_geospatial_analysis_for_everyone","307970100_Global_threats_from_invasive_alien_species_in_the_twenty-first_century_and_national_response_capacities","304455827_Mapping_Presence_and_Predicting_Phenological_Status_of_Invasive_Buffelgrass_in_Southern_Arizona_Using_MODIS_Climate_and_Citizen_Science_Observation_Data","274675038_Do_additional_bands_Coastal_NIR-2_Red-Edge_and_Yellow_in_worldview-2_multispectral_imagery_improve_discrimination_of_an_invasive_Tussock_Buffel_Grass_Cenchrus_Ciliaris","288906520_Random_forests","286740584_Cost-Effective_Mapping_Using_Unmanned_Aerial_Vehicles_in_Ecology_Monitoring_Applications","282271011_Buffel_grass_and_climate_change_a_framework_for_projecting_invasive_species_distributions_when_data_are_scarce","281562704_Buffelgrass_South_Texas_wonder_grass","275700703_Ecological_Characteristics_of_Sites_Invaded_by_Buffelgrass_Pennisetum_ciliare","260852038_The_Shuttle_Radar_Topography_Mission"]}