{"id":"331929461_International_Journal_of_Parallel_Emergent_and_Distributed_Systems_Time-varying_graphs_and_dynamic_networks_Time-varying_graphs_and_dynamic_networks","abstract":"The past few years have seen intensive research efforts carried out in some apparently unrelated areas of dynamic systems-delay-tolerant networks, opportunistic-mobility networks and social networks-obtaining closely related insights. Indeed, the concepts discovered in these investigations can be viewed as parts of the same conceptual universe, and the formal models proposed so far to express some specific concepts are the components of a larger formal description of this universe. The main contribution of this paper is to integrate the vast collection of concepts, formalisms and results found in the literature into a unified framework, which we call time-varying graphs (TVGs). Using this framework, it is possible to express directly in the same formalism not only the concepts common to all those different areas, but also those specific to each. Based on this definitional work, employing both existing results and original observations, we present a hierarchical classification of TVGs; each class corresponds to a significant property examined in the distributed computing literature. We then examine how TVGs can be used to study the evolution of network properties, and propose different techniques, depending on whether the indicators for these properties are atemporal (as in the majority of existing studies) or temporal. Finally, we briefly discuss the introduction of randomness in TVGs.","authors":["Arnaud Casteigts","Paola Flocchini","Walter Quattrociocchi","Nicola Santoro"],"meta":["April 2012","DOI:10.1080/17445760.2012.668546"],"references":["262334561_Graph_relabelling_systems_and_distributed_algorithms","260346239_Acknowledgment-Based_Broadcast_Protocol_for_Reliable_and_Efficient_Data_Dissemination_in_Vehicular_Ad_Hoc_Networks","242399200_ROUTING_IN_WIRELESS_NETWORKS_WITH_INTERMITTENT_CONNECTIVITY","234762725_Analysing_Information_Flows_and_Key_Mediators_through_Temporal_Centrality_Metrics","313203504_Reality_mining_Sensing_complex_social_systems","281014426_Middleware_for_service_provision_in_disconnected_mobile_ad_hoc_networks","278627585_Computing_shortest_fastest_and_foremost_journeys_in_dynamic_networks","263875422_COMPUTING_SHORTEST_FASTEST_AND_FOREMOST_JOURNEYS_IN_DYNAMIC_NETWORKS","251588646_Social_networks_Evolving_graphs_with_memory_dependent_edges","246785829_Maxprop_Routing_for_vehicle-based_delay-tolerant_networks"]}