{"id":"331958860_Humans_can_decipher_adversarial_images","abstract":"Does the human mind resemble the machine-learning systems that mirror its performance? Convolutional neural networks (CNNs) have achieved human-level benchmarks in classifying novel images. These advances support technologies such as autonomous vehicles and machine diagnosis; but beyond this, they serve as candidate models for human vision itself. However, unlike humans, CNNs are “fooled” by adversarial examples—nonsense patterns that machines recognize as familiar objects, or seemingly irrelevant image perturbations that nevertheless alter the machine’s classification. Such bizarre behaviors challenge the promise of these new advances; but do human and machine judgments fundamentally diverge? Here, we show that human and machine classification of adversarial images are robustly related: In 8 experiments on 5 prominent and diverse adversarial imagesets, human subjects correctly anticipated the machine’s preferred label over relevant foils—even for images described as “totally unrecognizable to human eyes”. Human intuition may be a surprisingly reliable guide to machine (mis)classification—with consequences for minds and machines alike.","authors":["Zhenglong Zhou","Chaz Firestone"],"meta":["March 2019Nature Communications 10(1)","DOI:10.1038/s41467-019-08931-6"],"references":["329380147_Deep_learning-Using_machine_learning_to_study_biological_vision","329348297_Predicting_eye_movement_patterns_from_fMRI_responses_to_natural_scenes","327163943_Human_Decisions_on_Targeted_and_Non-Targeted_Adversarial_Samples","326593299_Shared_spatiotemporal_category_representations_in_biological_and_artificial_deep_neural_networks","326381669_Large-Scale_High-Resolution_Comparison_of_the_Core_Visual_Object_Recognition_Behavior_of_Humans_Monkeys_and_State-of-the-Art_Deep_Artificial_Neural_Networks","323355774_Adversarial_Examples_that_Fool_both_Human_and_Computer_Vision","337653711_Adversarial_Vision_Challenge","329750836_Robust_Physical-World_Attacks_on_Deep_Learning_Visual_Classification","322328943_LaVAN_Localized_and_Visible_Adversarial_Noise","321718936_Wild_Patterns_Ten_Years_After_the_Rise_of_Adversarial_Machine_Learning"]}