{"id":"331933777_Adaptability_of_Learning_Games_Based_on_Learner_Profiles_in_the_Context_of_Autonomous_Training","abstract":"Learning games are widely used as teaching resources, because of their capacity to help learners’ increase their knowledge in conditions of autonomous learning, especially in domains for which training is expensive. However, to get the best productivity of these learning games, they should be adapted to the learners’ profile. To propose content in an application that satisfies the uniqueness of each learner is difficult. We therefore want to provide learners with learning games that meet their profiles and improve the proposal by tacking their new skills into account, so that they are always in the presence of games adapted to their needs. The idea of this paper is to propose a model, that provides a training plan based on learning games, adapted to the learners’ profile. The ALGP (Adaptive Learning Games Provider) model defines the learning profiles of individuals, then characterizes learning games to make a mapping between the profiles and characteristics of the games. But, to meet the needs of learners throughout the lessons, monitoring data are added, to dynamically adapt the content according to their progress. An evaluation of the model through learner follow-up in two separate classes, a first class assisted by the ALGP model and a second class with the traditional system without assistance of the model were carried out, and the results obtained show that the learners in the assisted class, are more motivated and more involved than in the non-assisted class, which increases their productivity.","authors":["Morie Wielfrid","Bi Tra Goore"],"meta":["January 2019","DOI:10.1007/978-3-030-16042-5_25","In book: e-Infrastructure and e-Services for Developing Countries (pp.284-293)"],"references":["318421382_Les_effets_d'une_ludification_adaptative_sur_l'engagement_des_apprenants","317642379_School_performance_social_networking_effects_and_learning_of_school_children_Evidence_of_reciprocal_relationships_in_Abu_Dhabi","312470401_Learningteaching_styles_in_engineering_education","278796983_Un_profil_d'application_de_LOM_pour_les_Serious_Games","266462473_Classifying_Serious_Games_the_GPS_model","259167084_BrainHex_A_neurobiological_gamer_typology_survey","257719751_Towards_a_Comprehensive_Methodology_for_the_Research_and_Evaluation_of_Serious_Games","228855301_Indexation_multi-facettes_des_ressources_pedagogiques_pour_faciliter_leur_re-utilisation","221572335_Reusable_learning_objects_A_survey_of_LOM-based_repositories","303393425_Relationship_between_learning_styles_and_genres_of_games","286227380_Adaptive_Learning_in_Games_Defining_Profiles_of_Competitor_Players","265092541_'Engage_Me_or_Enrage_Me'_What_Today's_Learners_Demand","246670283_Learning_Styles_And_Pedagogy_In_Post-16_Learning_A_Systematic_And_Critical_Review","227842091_Learning_styles_Implications_for_distance_learning","6598675_Motivations_for_Play_in_Online_Games","2956388_From_Visual_Simulation_to_Virtual_Reality_to_Games"]}