{"id":"331906372_Multi-scale_Model_of_Reactive_Transport_in_Fractured_Media_Diffusion_Limitations_on_Rates","abstract":"Reactive transport in fractured media is conceptualized as a multi-scale problem that couples a pore-scale component, which comprises Navier–Stokes flow, multi-component transport and aqueous equilibrium in the fracture, and a Darcy-scale component, which comprises multi-component diffusive transport, aqueous equilibrium and mineral reactions in the porous matrix. The model that implements this multi-scale approach builds on an existing pore-scale model and is able to capture complex fracture geometries with the embedded-boundary method. The embedded boundary acts as the interface between pore- and Darcy-scale domains. Adaptive mesh refinement is used to match resolutions at the interface while using coarser resolution away from the interface when not needed in the Darcy-scale domain. The new model is validated and then compared to results from a pore-scale model. Multi-scale model results are shown to be equivalent to pore-scale results under diffusion-controlled reactions in the pore scale and very fast dissolution in the Darcy scale. The multi-scale model provides a more accurate solution for a given resolution as it effectively sets the equilibrium concentrations as boundary conditions. The multi-scale model is capable to capture flow channelization observed in an experimental fractured core and, at the same time, limitations in the dissolution of calcite by diffusive transport through an altered porous layer. Discrepancies in effluent calcium concentrations between the multi-scale results and results from a reduced-dimension Darcy-scale model for this fractured core experiment are attributed to the solution of the flow field and the gradients that develop inside the fracture. Discrepancies in effluent magnesium concentrations exemplify the limitations of the approach because the multi-scale model requires calibration of reactive surface areas as Darcy-scale continuum models.","authors":["Sergi Molins","David Trebotich","Bhavna Arora","Carl Steefel"],"meta":["June 2019Transport in Porous Media 128(1)","DOI:10.1007/s11242-019-01266-2"],"references":["329046819_Coupled_Processes_in_a_Fractured_Reactive_System_Subsurface_Seals_and_Caprock_Integrity","326363367_Hydrodynamic_dispersion_in_thin_channels_with_micro-structured_porous_walls","322133929_Fracture_Evolution_in_Multi-mineral_Systems_The_Role_of_Mineral_Composition_Flow_Rate_and_Fracture_Aperture_Heterogeneity","319281262_Mineral_dissolution_and_wormholing_from_a_pore-scale_perspective","318250996_Alteration_and_Erosion_of_Rock_Matrix_Bordering_a_Carbonate-Rich_Shale_Fracture","316529010_Physics-based_hybrid_method_for_multiscale_transport_in_porous_media","316010512_Mineralogical_and_transport_controls_on_the_evolution_of_porous_media_texture_using_direct_numerical_simulation","312894138_Adaptive_mesh_refinement_for_hypervelocity_partial_differential_equations","306352535_Three-dimensional_simulations_of_fracture_dissolution","304667865_A_25D_reactive_transport_model_for_fracture_alteration"]}