{"id":"331913389_Recent_advances_in_physical_reservoir_computing_A_review","abstract":"Reservoir computing is a computational framework suited for temporal/sequential data processing. It is derived from several recurrent neural network models, including echo state networks and liquid state machines. A reservoir computing system consists of a reservoir for mapping inputs into a high-dimensional space and a readout for pattern analysis from the high-dimensional states in the reservoir. The reservoir is fixed and only the readout is trained with a simple method such as linear regression and classification. Thus, the major advantage of reservoir computing compared to other recurrent neural networks is fast learning, resulting in low training cost. Another advantage is that the reservoir without adaptive updating is amenable to hardware implementation using a variety of physical systems, substrates, and devices. In fact, such physical reservoir computing has attracted increasing attention in diverse fields of research. The purpose of this review is to provide an overview of recent advances in physical reservoir computing by classifying them according to the type of the reservoir. We discuss the current issues and perspectives related to physical reservoir computing, in order to further expand its practical applications and develop next-generation machine learning systems.","authors":["Gouhei Tanaka","Toshiyuki Yamane","Jean Benoit Heroux","Ryosho Nakane"],"meta":["March 2019Neural networks: the official journal of the International Neural Network Society 115","DOI:10.1016/j.neunet.2019.03.005","Project: Reservoir Computing"],"references":["328352008_Tutorial_Photonic_neural_networks_in_delay_systems","327337311_Echo_state_networks_are_universal","345135012_Application_of_FPGA_to_Real-Time_Machine_Learning_Hardware_Reservoir_Computers_and_Software_Image_Processing","336166868_Analysis_on_Characteristics_of_Multi-Step_Learning_Echo_State_Networks_for_Nonlinear_Time_Series_Prediction","331794148_Spatially_Arranged_Sparse_Recurrent_Neural_Networks_for_Energy_Efficient_Associative_Memory","329316061_Reservoir_Computing_with_Untrained_Convolutional_Neural_Networks_for_Image_Recognition","328399404_Optoelectronic_Reservoir_Computing_with_VCSEL","327923364_Macromagnetic_Simulation_for_Reservoir_Computing_Utilizing_Spin_Dynamics_in_Magnetic_Tunnel_Junctions","327921123_Distributive_Dynamic_Spectrum_Access_Through_Deep_Reinforcement_Learning_A_Reservoir_Computing-Based_Approach","327519925_Scaling_Up_Echo-State_Networks_With_Multiple_Light_Scattering"]}