{"id":"331992411_Can_We_Accurately_Identify_Peritoneal_Metastases_Based_on_Their_Appearance_An_Assessment_of_the_Current_Practice_of_Intraoperative_Gastrointestinal_Cancer_Staging","abstract":"Background\nPeritoneal lesions are common findings during operative abdominal cancer staging. The decision to perform biopsy is made subjectively by the surgeon, a practice the authors hypothesized to be imprecise. This study aimed to describe optical characteristics differentiating benign peritoneal lesions from peritoneal metastases.\n\nMethods\nThe study evaluated laparoscopic images of 87 consecutive peritoneal lesions biopsied during staging laparoscopies for gastrointestinal malignancies from 2014 to 2017. A blinded survey assessing these lesions was completed by 10 oncologic surgeons. Three senior investigators categorized optical features of the lesions. Computer-aided digital image processing and machine learning was used to classify the lesions.\n\nResults\nOf the 87 lesions, 28 (32%) were metastases. On expert survey, surgeons on the average misidentified 36 ± 19% of metastases. Multivariate analysis identified degree of nodularity, border transition, and degree of transparency as independent predictors of metastases (each p < 0.03), with an area under the receiver operating characteristics curve (AUC) of 0.82 (95% confidence interval [CI], 0.72–0.91). Image processing demonstrated no difference using image color segmentation, but showed a difference in gradient magnitude between benign and metastatic lesions (AUC, 0.66; 95% CI 0.54–0.78; p = 0.02). Machine learning using a neural network with a tenfold cross-validation obtained an AUC of only 0.47.\n\nConclusions\nTo date, neither experienced oncologic surgeons nor computerized image analysis can differentiate peritoneal metastases from benign peritoneal lesions with an accuracy that is clinically acceptable. Although certain features correlate with the presence of metastases, a substantial overlap in optical appearance exists between benign and metastatic peritoneal lesions. Therefore, this study suggested the need to perform biopsy for all peritoneal lesions during operative staging, or at least to lower the threshold significantly.","authors":["Thomas Schnelldorfer","Matthew P. Ware","Li Ping Liu","Michael G. Sarr"],"meta":["March 2019Annals of Surgical Oncology 26(6):1-10","DOI:10.1245/s10434-019-07292-0"],"references":["280242154_Laparoscopic_narrow_band_imaging_for_detection_of_occult_cancer_metastases_a_randomized_feasibility_trial","236459494_Micrometastasis_in_Gastric_Cancer","221828242_Image-enhanced_laparoscopy_A_promising_technology_for_detection_of_peritoneal_micrometastases","221766738_EMT_and_Dissemination_Precede_Pancreatic_Tumor_Formation","22310512_The_Measurement_Of_Observer_Agreement_For_Categorical_Data"]}