{"id":"331981680_Opening_up_curricula_to_redistribute_epistemic_agency_A_framework_for_supporting_science_teaching","abstract":"This study proposes a strategic framework to guide teachers’ curriculum adaptation, planning, and enactment as a lever for redistributing epistemic agency. This framework intends to position teachers as strategic decision‐makers around when and how to open up aspects of their curriculum. We argue that seeing the aspects of Next Generation Science Standards‐aligned curricula—the methods of investigation, the anchoring phenomena, and the explanatory models students construct—as entry points for redistributing epistemic agency may help teachers make inroads to shifting their classroom practice towards more responsive instruction. Importantly, our tool acknowledges that there are different “levels” at which teachers might strategically decide to open up space for student decision‐making. These decisions may have a differential impact on students’ subsequent participation in science practices. In this paper, we will use three cases to highlight the specific and incremental ways that teachers can open up aspects of the curriculum and how those openings redistributed epistemic agency in their classroom. We argue that this framework may be used as a tool for engaging teachers in conversation about how they can begin to position students as partners in the epistemic decisions that drive classroom activity.","authors":["Mon-Lin Monica Ko","Christina Krist"],"meta":["March 2019Science Education 103(4)","DOI:10.1002/sce.21511"],"references":["340358042_Examining_how_classroom_communities_developed_practice-based_epistemologies_for_science_through_analysis_of_longitudinal_video_data","328934897_Identifying_Essential_Epistemic_Heuristics_for_Guiding_Mechanistic_Reasoning_in_Science_Learning","326595031_Fostering_students'_epistemic_agency_through_the_co-configuration_of_moth_research","325066054_Science_Education_and_Student_Autonomy","324573777_Addressing_the_epistemic_elephant_in_the_room_Epistemic_agency_and_the_next_generation_science_standards","346672464_Teaching_and_Its_Predicaments","344591320_Education_and_Power","339629685_Krajcik_and_Mamlok_Using_Driving_Questions_to_Motivate_and_Sustain_Student_Interest_in_Learning_Science","324985025_Supporting_teachers_to_negotiate_uncertainty_for_science_students_and_teaching","324127978_Measuring_what_matters_Using_technology_to_assess_multidimensional_learning"]}