{"id":"331991352_A_New_Network_Feature_Affects_the_Intervention_Performance_on_Public_Opinion_Dynamic_Networks","abstract":"The neighborhood network structure plays an important role in the collective opinion of an opinion dynamic system. Does it also affect the intervention performance? To answer this question, we apply three intervention methods on an opinion dynamic model, the weighted DeGroot model, to change the convergent opinion value x¯. And we define a new network feature Ω, called ‘network differential degree’, to measure how node degrees couple with influential values in the network, i.e., large Ω indicates nodes with high degree is more likely to couple with large influential value. We investigate the relationship between the intervention performance and the network differential degree Ω in the following three intervention cases: (1) add one special agent (shill) to connect to one normal agent; (2) add one edge between two normal agents; (3) add a number of edges among agents. Through simulations we find significant correlation between the intervention performance, i.e., |Δx¯⁎| (the maximum value of the change of convergent opinion value |Δx¯|) and Ω in all three cases: the intervention performance |Δx¯⁎| is higher when Ω is smaller. So Ω could be used to predict how difficult it is to intervene and change the convergent opinion value of the weighted DeGroot model. Meanwhile, a theorem of adding one edge and an algorithm for adding optimal edges are given.","authors":["Caiyun Wang","Huawei Han","Jing Han"],"meta":["March 2019Scientific Reports 9(1):5089","DOI:10.1038/s41598-019-41555-w"],"references":["336952483_Social_and_Economic_Networks","331307250_Social_and_Economic_Networks","323205145_How_does_the_interaction_radius_affect_the_performance_of_intervention_on_collective_behavior","313450415_Edge_Weight_Prediction_in_Weighted_Signed_Networks","312153320_Mixing_beliefs_among_interacting_agents","339014371_Testing_Models_of_Social_Learning_on_Networks_Evidence_From_Two_Experiments","321245909_The_structure_of_scientific_collaboration_networks","320121450_Network_feature_and_the_intervention_performance","315467637_Soft-control_for_collective_opinion_of_weighted_DeGroot_model","312970191_Scientific_collaboration_networks","309738153_Finite-Time_Elimination_of_Disagreement_of_Opinion_Dynamics_via_Covert_Noise","308835692_Intervention_of_DeGroot_model_by_soft_control","308498392_The_impact_of_interaction_radius_on_soft_control_performance_based_on_the_Vicsek_Model","301233247_Network_structure_and_minimum_degree","283617410_Emergence_of_Scaling_in_Random_Networks"]}