{"id":"331994155_Reconceptualizing_Music_Making_Music_Technology_and_Freedom_in_the_Age_of_Neoliberalism","abstract":"Recent initiatives by for-profit corporations and funding measures instituted by governments intend to support the preparation of students for careers in computer science and technology. Although such initiatives and measures can indeed increase opportunities for students’ engagement with computer science and technology in K-12 schools, we question whose needs are being served, for what purposes, and at what cost. In particular, we ask whether music educators might be complicit in advancing technology that subordinates human needs—specifically students’ interests in making music in their own creative ways—to modes of production that benefit certain dominant commercial interests in society. After discussing how current computer technology narrows students’ choices, we counter this determinism by highlighting a music subculture that creates and appropriates music technologies for music-related purposes. Our example of the “chipscene” illustrates how music educators might reconceptualize “music making” through modification of existing music technology and thereby restore students’ freedom to “reclaim making” in the age of neoliberalism.","authors":["Cathy Benedict","Jared O'Leary"],"meta":["March 2019"],"references":["330332667_Playing_with_Sound_A_Theory_of_Interacting_with_Sound_and_Music_in_Video_Games","329702020_A_Corpus-assisted_Discourse_Analysis_of_Music-related_Practices_Discussed_within_Chipmusicorg","328220887_The_Terror_of_Neoliberalism","314406624_A_Critical_Theory_of_Technology","296706069_Questioning_Technology","327109256_Algorithms_of_Oppression_How_Search_Engines_Reinforce_Racism","319088194_Oxford_Handbook_of_Technology_and_Music_Education","312080801_Racist_in_the_Machine_The_Disturbing_Implications_of_Algorithmic_Bias","301996134_Geeks_on_Stage_Investigations_in_the_World_of_Live_Chipmusic","292570847_Chip_music_Low-tech_data_music_sharing"]}