{"id":"331997599_Three_levels_quality_analysis_tool_for_object_oriented_programming","abstract":"In terms of evolution of software engineering methods for complex software developments techniques, new concepts have been emerged in the software languages, which used to develop software quality models. In this research, the Multi Levels Quality Analysis Tool (MLQA) is proposed as a tool for computer-aid software engineering, which classifies software complexity into three levels of analysis, namely the program package analysis, class analysis (program class) and finally the analysis at the level of the program method. MLQA is able to support a method of visual analysis of the software contents with color alerts, and recommendations systems, which can give a quick view of the software development and its complexity. The methodology of this work is a new suggested software quality model based on the standards object-oriented programming complexity metrics as well as threshold limits. In addition, a new quality attribute namely clean code attribute has been proposed and integrating it with the proposed software quality model in a way that enables the user of the model relies on this attribute and reduces the dependence on the software experience, which is expensive and rare at times. © 2018 International Journal of Advanced Computer Science and Applications.","authors":["Mustafa Saeed","Kamaran Faraj","Maher Talal Alasaady","Fahad Layth Malallah"],"meta":["January 2018International Journal of Advanced Computer Science and Applications 9(11):522-536"],"references":["322372758_A_Suite_of_Object_Oriented_Cognitive_Complexity_Metrics","269670226_Advanced_Program_Complexity_Metrics_and_Measurement","266552159_Software_Metrics_and_Software_Metrology","305296096_Towards_a_Metrics_Suite_for_Object_Oriented_Design","272854121_Software_Quality_Role_and_Value_of_Quality_Models","268275256_Product_Software_Quality","265810688_Analysis_of_Software_Quality_Models_for_Organizations","265101755_Class_Break_Point_Determination_Using_CK_Metrics_Thresholds","237459966_Assessing_Software_Quality_Attributes_with_Source_Code_Metrics","234793613_Clean_Code_A_Handbook_of_Agile_Software_Craftsmanship"]}