{"id":"331929395_The_spreading_of_misinformation_online","abstract":"The wide availability of user-provided content in online social media facilitates the aggregation of people around common interests, worldviews, and narratives. However, the World Wide Web (WWW) also allows for the rapid dissemination of unsubstantiated rumors and conspiracy theories that often elicit rapid, large, but naive social responses such as the recent case of Jade Helm 15-where a simple military exercise turned out to be perceived as the beginning of a new civil war in the United States. In this work, we address the determinants governing misinformation spreading through a thorough quantitative analysis. In particular, we focus on how Facebook users consume information related to two distinct narratives: scientific and conspiracy news. We find that, although consumers of scientific and conspiracy stories present similar consumption patterns with respect to content, cascade dynamics differ. Selective exposure to content is the primary driver of content diffusion and generates the formation of homogeneous clusters, i.e., \"echo chambers .\" Indeed, homogeneity appears to be the primary driver for the diffusion of contents and each echo chamber has its own cascade dynamics. Finally, we introduce a data-driven percolation model mimicking rumor spreading and we show that homogeneity and polarization are the main determinants for predicting cascades' size. misinformation | virality | Facebook | rumor spreading | cascades","authors":["Michela Del Vicario","Alessandro Bessi","Fabiana Zollo","Fabio Petroni"],"meta":["March 2019"],"references":["331929628_Opinion_dynamics_on_interacting_networks_Media_competition_and_social_influence","281274326_Viral_Misinformation_The_Role_of_Homophily_and_Polarization","279957162_Research_Note_-The_Allure_of_Homophily_in_Social_Media_Evidence_from_Investor_Responses_on_Virtual_Communities","278703799_TweetCred_Real-Time_Credibility_Assessment_of_Content_on_Twitter","277523673_Emotional_Dynamics_in_the_Age_of_Misinformation","276350004_The_economy_of_attention_in_the_age_of_misinformation","275279899_Trend_of_Narratives_in_the_Age_of_Misinformation","285818573_A_model_for_recalibrating_credibility_in_different_contexts_and_languages_-_A_twitter_case_study","272194238_Knowledge-Based_Trust_Estimating_the_Trustworthiness_of_Web_Sources","264811518_Extremism_and_the_Psychology_of_Uncertainty"]}