{"id":"331965710_Identity_Management_in_Knowledge_Graphs","abstract":"In the absence of a central naming authority in the Web of Data, it is common for different knowledge graphs to refer to the same thing by different names (IRIs). Whenever multiple names are used to denote the same thing, owl:sameAs statements are needed in order to link the data and foster reuse. Such identity statements have strict logical semantics, indicating that every property asserted to one name, will also be inferred to the other, and vice versa. While such inferences can be extremely useful in enabling and enhancing knowledge-based systems such as search engines and recommendation systems, incorrect use of identity can have wide-ranging effects in a global knowledge space like the Web of Data. With several studies showing that owl:sameAs is indeed misused for different reasons, a proper approach towards the handling of identity links is required in order to make the Web of Data succeed as an integrated knowledge space. By relying on a collection of 558 million identity statements, this thesis shows how network metrics such as the community structure of the owl:sameAs graph can be used in order to detect possibly erroneous identity assertions. In addition, as a way to limit the excessive and incorrect use of owl:sameAs, we define a new relation for asserting the identity of two class instances in a specific context. This identity relation is accompanied by an approach for automatically detecting these links, with the ability of using certain expert constraints for filtering irrelevant contexts. As a first experiment, the detection and exploitation of the detected contextual identity links are conducted on a knowledge graph for life sciences, constructed in the context of this thesis in a collaboration with experts from the French National Institute of Agricultural Research (INRA).","authors":["Joe Raad"],"meta":["November 2018","Project: Identity Management in the Web of Data"],"references":["338107855_A_More_Decentralized_Vision_for_Linked_Data","330695615_Detection_de_liens_d'identite_errones_en_utilisant_la_detection_de_communautes_dans_les_graphes_d'identite","329860559_Comment_representer_et_decouvrir_des_liens_d'identite_contextuelle_dans_une_base_de_connaissances_Application_a_des_donnees_experimentales_en_sciences_du_vivant","326337776_Triple_Pattern_Fragments_A_Low-Cost_Knowledge_Graph_Interface_for_the_Web","326335033_SOSA_A_lightweight_ontology_for_sensors_observations_samples_and_actuators","321832248_Detection_of_Contextual_Identity_Links_in_a_Knowledge_Base","321576458_AgroPortal_A_vocabulary_and_ontology_repository_for_agronomy","326474061_Searching_and_Browsing_Linked_Data_with_SWSE_The_Semantic_Web_Search_Engine","326338196_Scalable_and_Distributed_Methods_for_Entity_Matching_Consolidation_and_Disambiguation_Over_Linked_Data_Corpora","326335568_Where_to_Publish_and_Find_Ontologies_A_Survey_of_Ontology_Libraries","320202418_LOD-a-lot","320170332_Detection_de_liens_d'identite_contextuels_dans_une_base_de_connaissances","318136130_Constructing_Disease-Centric_Knowledge_Graphs_A_Case_Study_for_Depression_short_Version","317385650_CEDAL_Time-Efficient_Detection_of_Erroneous_Links_in_Large-Scale_Link_Repositories","316823839_Advanced_Methods_for_Inconsistent_Knowledge_Management"]}