{"id":"332051551_Error_mitigation_extends_the_computational_reach_of_a_noisy_quantum_processor","abstract":"Quantum computation, a paradigm of computing that is completely different from classical methods, benefits from theoretically proved speed-ups for certain problems and can be used to study the properties of quantum systems1. Yet, because of the inherently fragile nature of the physical computing elements (qubits), achieving quantum advantages over classical computation requires extremely low error rates for qubit operations, as well as substantial physical qubits, to realize fault tolerance via quantum error correction2,3. However, recent theoretical work4,5 has shown that the accuracy of computation (based on expectation values of quantum observables) can be enhanced through an extrapolation of results from a collection of experiments of varying noise. Here we demonstrate this error mitigation protocol on a superconducting quantum processor, enhancing its computational capability, with no additional hardware modifications. We apply the protocol to mitigate errors in canonical single- and two-qubit experiments and then extend its application to the variational optimization6–8 of Hamiltonians for quantum chemistry and magnetism9. We effectively demonstrate that the suppression of incoherent errors helps to achieve an otherwise inaccessible level of accuracy in the variational solutions using our noisy processor. These results demonstrate that error mitigation techniques will enable substantial improvements in the capabilities of near-term quantum computing hardware. The accuracy of computations on noisy, near-term quantum systems can be enhanced by extrapolating results from experiments with various noise levels, without requiring additional hardware modifications.","authors":["Abhinav Kandala","Kristan Temme","A. Córcoles","Antonio Mezzacapo"],"meta":["March 2019Nature 567(7749):491-495","DOI:10.1038/s41586-019-1040-7"],"references":["331719791_Supervised_learning_with_quantum-enhanced_feature_spaces","324078174_Quantum_Chemistry_Calculations_on_a_Trapped-Ion_Quantum_Simulator","323130113_Computation_of_Molecular_Spectra_on_a_Quantum_Processor_with_an_Error-Resilient_Algorithm","322419167_Cloud_Quantum_Computing_of_an_Atomic_Nucleus","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","322075998_Practical_Quantum_Error_Mitigation_for_Near-Future_Applications","324472199_Effective_Hamiltonian_models_of_the_cross-resonance_gate","323410763_Pulsed_Reset_Protocol_for_Fixed-Frequency_Superconducting_Qubits","319683740_Hardware-efficient_variational_quantum_eigensolver_for_small_molecules_and_quantum_magnets","313097465_Tapering_off_qubits_to_simulate_fermionic_Hamiltonians","311067037_Efficient_Variational_Quantum_Simulator_Incorporating_Active_Error_Minimization","311492464_Error_Mitigation_for_Short-Depth_Quantum_Circuits","311430113_Efficient_Z-Gates_for_Quantum_Computing","302935886_The_approximate_arithmetical_solution_by_finite_differences_of_physical_problems_including_differential_equations_with_an_application_to_the_stresses_in_a_masonry_dam","301840114_Procedure_for_systematically_tuning_up_crosstalk_in_the_cross_resonance_gate"]}