{"id":"332055799_Visualization_software_for_Hydrophobic-polar_protein_folding_model","abstract":"The simplest and most used models of protein folding is the Hydrophobic-Polar (HP) model. The HP model labeling the amino acids as Hydrophilic (H) or Polar/ydrophilic (P). The folding of amino acids sequence is configured as self-avoiding walks on the 2D or 3D lat-tice, where the optimal conformation has maximum number of contacts between H amino acids (H-H contacts) that are not adjustment in amino acid sequence. In this paper, we de-velop and present software for visualization of HP protein folding problem under the HP model on the 2D square lattice. For the development of HP folding visualization software, we used MS Visual Studio, .NET Framework 2.0 and C# language. If we have HP sequence and folding results for this sequence, obtained by optimization software as CPLEX or GUROBI, then using the 2D visualization software we can visualize the obtained results in square lat-tice. This visualization software is a valuable tool for the study of HP folding and is a great pedagogic instrument. All figures of HP folding included in this paper are actual screenshots of our visualization program. © 2019 National Research Nuclear University. All rights reserved.","authors":["Radoslav Mavrevski","Metodi Traykov"],"meta":["January 2019Scientific Visualization 11(1)","DOI:10.26583/sv.11.1.02"],"references":["236193297_Transitions_to_catalytically_inactive_conformations_in_EGFR_kinase","228853142_Combinatorial_Algorithms_for_Protein_Folding_in_Lattice_Models_A_Survey_of_Mathematical_Results","26587271_Protein_Folding_in_the_HP-Model_Solved_With_a_Hybrid_Population_Based_ACO_Algorithm","311241895_Protein_Folding_Prediction_in_a_Cubic_Lattice_in_Hydrophobic-Polar_Model","231691677_A_Lattice_Statistical_Mechanics_Model_of_the_Conformational_and_Sequence_Spaces_of_Proteins","47349129_Stable_and_Metastable_States_of_Human_Amylin_in_Solution","36137006_Optimization_approaches_to_protein_folding_electronic_resource","15586604_Principles_of_Protein_Folding-A_Perspective_from_Simple_Exact_Models"]}