{"id":"332066016_A_method_framework_and_tutorial_for_efficiently_simulating_models_of_decision-making","abstract":"Evidence accumulation models (EAMs) have become the dominant models of rapid decision-making. Several variants of these models have been proposed, ranging from the simple linear ballistic accumulator (LBA) to the more complex leaky-competing accumulator (LCA), and further extensions that include time-varying rates of evidence accumulation or decision thresholds. Although applications of the simpler variants have been widespread, applications of the more complex models have been fewer, largely due to their intractable likelihood function and the computational cost of mass simulation. Here, I present a framework for efficiently fitting complex EAMs, which uses a new, efficient method of simulating these models. I find that the majority of simulation time is taken up by random number generation (RNG) from the normal distribution, needed for the stochastic noise of the differential equation. To reduce this inefficiency, I propose using the well-known concept within computer science of “look-up tables” (LUTs) as an approximation to the inverse cumulative density function (iCDF) method of RNG, which I call “LUT-iCDF”. I show that when using an appropriately sized LUT, simulations using LUT-iCDF closely match those from the standard RNG method in R. My framework, which I provide a detailed tutorial on how to implement, includes C code for 12 different variants of EAMs using the LUT-iCDF method, and should make the implementation of complex EAMs easier and faster.","authors":["Nathan J. Evans"],"meta":["March 2019Behavior Research Methods 51(3)","DOI:10.3758/s13428-019-01219-z"],"references":["328818485_Optimal_or_not_depends_on_the_task","326100487_Refining_the_law_of_practice","321316487_The_computations_that_support_simple_decision-making_A_comparison_between_the_diffusion_and_urgency-gating_models","317386969_Need_for_closure_is_associated_with_urgency_in_perceptual_decision-making","325602868_Modeling_the_Covariance_Structure_of_Complex_Datasets_Using_Cognitive_Models_An_Application_to_Individual_Differences_and_the_Heritability_of_Cognitive_Ability","324513440_Response_of_Neurons_in_the_Lateral_Intraparietal_Area_during_a_Combined_Visual_Discrimination_Reaction_Time_Task","321985478_Competing_Theories_of_Multialternative_Multiattribute_Preferential_Choice","318393858_R_A_Language_and_Environment_for_Statistical_Computing","318393770_R_A_Language_and_Environment_for_Statistical_Computing","317500964_Bayesian_analysis_of_the_piecewise_diffusion_decision_model"]}