{"id":"332042018_The_Adoption_of_Agile_Software_Methodology_with_Team_Software_Process_TSPI_Practices_in_the_Software_Engineering_Undergraduate_Course","abstract":"In computer science, software engineering courses expose the undergraduate students to both the technical and methodological aspects of software development. The traditional software development methods and techniques represent a huge proportion of the courses and hence contribute an essential part of software engineering students’ development process. This plan-driven development is dependent on a set of predefined phases and ongoing documentation which found to be problematic; such as time-consuming, slipped requirements and complicated processes. The main aim of this paper is to study and review the adoption of Agile Software Methodology and Team Software Process (TSPi) practices in the undergraduate course focus on software development. The framework and course plan will be designed to apply and observe the implementation. Furthermore, this study will help to gather the teams’ viewpoint regarding the importance of Agile and TSPi practices in handling small projects with real clients.","authors":["Nurfauza Jali","Azman Masli","Wai Shiang Cheah","Yanti Rosmunie Bujang"],"meta":["January 2018Journal of IT in Asia 7(1):1-8","DOI:10.33736/jita.613.2017","Project: Software Development in Software Engineering Course - Looking into Project Planning and Estimation Using Team Software Process (TSPi) and Scrum"],"references":["280144622_Scrum_in_software_engineering_courses_An_outline_of_the_literature","276273060_Significance_of_the_teamwork_in_agile_software_engineering","262412335_Using_Scrum_in_a_quarter-length_undergraduate_software_engineering_course","235042947_Team_Software_Process_TSP_Coach_Mentoring_Program_Guidebook","221538658_Teaching_a_software_project_course_using_the_team_software_process","261047286_Using_scrum_to_teach_software_engineering_A_case_study","240106325_Manifesto_for_Agile_Software_Development","234808592_Applying_UML_and_Patterns_An_Introduction_to_Object-Oriented_Analysis_and_Design_and_the_Unified_Pr","31686350_Introduction_to_the_team_software_process_WS_Humphrey","4365409_Moving_from_Waterfall_to_Agile"]}