{"id":"332022850_Ontologies_to_interpret_remote_sensing_images_Why_do_we_need_them","abstract":"The development of new sensors and easier access to remote sensing data are significantly transforming both the theory and practice of remote sensing. Although data-driven approaches based on innovative algorithms and enhanced computing capacities are gaining importance to process big Earth Observation data, the development of knowledge-driven approaches is still considered by the remote sensing community to be one of the most important directions of their research. In this context, the future of remote sensing science should be supported by knowledge representation techniques such as ontologies. However, ontology-based remote sensing applications still have difficulty capturing the attention of remote sensing experts. This is mainly because of the gap between remote sensing experts’ expectations of ontologies and their real possible contribution to remote sensing. This paper provides insights to help reduce this gap. To this end, the conceptual limitations of the knowledge-driven approaches currently used in remote sensing science are clarified first. Then, the different modes of definition of geographic concepts, their duality, vagueness and ambiguity, and the sensory and semantic gaps are discussed in order to explain why ontologies can help address these limitations. In particular, this paper focuses on the capacity of ontologies to represent both symbolic and numeric knowledge, to reason based on cognitive semantics and to share knowledge on the interpretation of remote sensing images. Finally, a few recommendations are provided for remote sensing experts to comprehend the advantages of ontologies in interpreting satellite images.","authors":["Damien Arvor","Mariana Belgiu","Zoe Falomir","Isabelle Mougenot"],"meta":["March 2019GIScience & Remote Sensing 56(1):1-29","DOI:10.1080/15481603.2019.1587890"],"references":["331984216_Graph_of_Concepts_for_Semantic_Annotation_of_Remotely_Sensed_Images_based_on_Direct_Neighbors_in_RAG","327763236_TOWARDS_AN_ONTOLOGY_FOR_THE_STRUCTURING_OF_REMOTE_SENSING_OPERATIONS_SHARED_BY_DIFFERENT_PROCESSING_CHAINS","327085565_Big_earth_observation_time_series_analysis_for_monitoring_Brazilian_agriculture","325288744_An_Observation_Capability_Semantic-Associated_Approach_to_the_Selection_of_Remote_Sensing_Satellite_Sensors_A_Case_Study_of_Flood_Observations_in_the_Jinsha_River_Basin","325070804_Ontology_Usability_Scale_Context-aware_Metrics_for_the_Effectiveness_Efficiency_and_Satisfaction_of_Ontology_Uses","324755790_2018_Definitions_of_Forest_Deforestation_Afforestation_and_Reforestation","322544859_A_Knowledge_Base_for_Automatic_Feature_Recognition_from_Point_Clouds_in_an_Urban_Scene","326948561_Theoretical_and_practical_perspectives","325350564_Towards_a_hybrid_approach_for_remote_sensing_ontology_construction","322367962_Geographic_Object-based_Image_Analysis_GEOBIA_Emerging_trends_and_future_opportunities"]}