{"id":"332069196_Born_Again_Neural_Networks","abstract":"Knowledge Distillation (KD) consists of transferring “knowledge” from one machine learning model (the teacher) to another (the student). Commonly, the teacher is a high-capacity model with formidable performance, while the student is more compact. By transferring knowledge, one hopes to benefit from the student’s compactness, without sacrificing too much performance. We study KD from a new perspective: rather than compressing models, we train students parameterized identically to their teachers. Surprisingly, these Born-Again Networks (BANs), outperform their teachers significantly, both on computer vision and language modeling tasks. Our experiments with BANs based on DenseNets demonstrate state-of-the-art performance on the CIFAR-10 (3.5%) and CIFAR-100 (15.5%) datasets, by validation error. Additional experiments explore two distillation objectives: (i) Confidence-Weighted by Teacher Max (CWTM) and (ii) Dark Knowledge with Permuted Predictions (DKPP). Both methods elucidate the essential components of KD, demonstrating the effect of the teacher outputs on both predicted and non-predicted classes.","authors":["Tommaso Furlanello","Zachary Chase Lipton","Michael Tschannen","Laurent Itti"],"meta":["July 2018","Conference: International Conference on Machine Learning (ICML)Volume: 80"],"references":["321325065_Distilling_a_Neural_Network_Into_a_Soft_Decision_Tree","320968593_Deep_Pyramidal_Residual_Networks","320966701_A_Gift_from_Knowledge_Distillation_Fast_Optimization_Network_Minimization_and_Transfer_Learning","319135616_Improved_Regularization_of_Convolutional_Neural_Networks_with_Cutout","318740426_Using_the_Output_Embedding_to_Improve_Language_Models","317615661_Sobolev_Training_for_Neural_Networks","317194083_Wide_Residual_Networks","317101000_Continual_Learning_with_Deep_Generative_Replay","317061748_Shake-Shake_regularization","312607081_Building_a_large_annotated_corpus_of_english_The_penn_treebank"]}