{"id":"332046995_Mapping_changes_in_housing_in_sub-Saharan_Africa_from_2000_to_2015","abstract":"Access to adequate housing is a fundamental human right, essential to human security, nutrition and health, and a core objective of the United Nations Sustainable Development Goals1,2. Globally, the housing need is most acute in Africa, where the population will more than double by 2050. However, existing data on housing quality across Africa are limited primarily to urban areas and are mostly recorded at the national level. Here we quantify changes in housing in sub-Saharan Africa from 2000 to 2015 by combining national survey data within a geostatistical framework. We show a marked transformation of housing in urban and rural sub-Saharan Africa between 2000 and 2015, with the prevalence of improved housing (with improved water and sanitation, sufficient living area and durable construction) doubling from 11% (95% confidence interval, 10–12%) to 23% (21–25%). However, 53 (50–57) million urban Africans (47% (44–50%) of the urban population analysed) were living in unimproved housing in 2015. We provide high-resolution, standardized estimates of housing conditions across sub-Saharan Africa. Our maps provide a baseline for measuring change and a mechanism to guide interventions during the era of the Sustainable Development Goals. The prevalence of improved housing (with improved drinking water and sanitation, sufficient living area and durable construction) in urban and rural sub-Saharan Africa doubled between 2000 and 2015.","authors":["Lucy S Tusting","Donal Bisanzio","Graham Alabaster","Ewan Cameron"],"meta":["April 2019Nature 568(7752)","DOI:10.1038/s41586-019-1050-5"],"references":["323102145_Rapid_improvements_to_rural_Ugandan_housing_and_their_association_with_malaria_from_intense_to_reduced_transmission_a_cohort_study","322368535_A_global_map_of_travel_time_to_cities_to_assess_inequalities_in_accessibility_in_2015","321095731_Spatial_Mapping_with_Gaussian_Processes_and_Nonstationary_Fourier_Features","317614298_Breaking_new_ground_in_mapping_human_settlements_from_space_-The_Global_Urban_Footprint-","315371976_Housing_Improvements_and_Malaria_Risk_in_Sub-Saharan_Africa_A_Multi-Country_Analysis_of_Survey_Data","281837736_The_effect_of_malaria_control_on_Plasmodium_falciparum_in_Africa_between_2000_and_2015","313123306_High_resolution_global_gridded_data_for_use_in_population_studies","309532479_Random_features_for_large_scale_kernel_machines","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting","285599593_A_Global_Geometric_Framework_for_Nonlinear_Dimensionality_Reduction"]}