{"id":"332074609_Mappism_Formalizing_classical_and_artificial_life_views_on_mind_and_consciousness","abstract":"Throughout centuries philosophers have attempted to understand the disparity between the conscious experience and the material world – i.e., the problem of consciousness and the apparent mind–body dualism. Achievements in the fields of biology, neurology, and information science in the last century granted us more insight into processes that govern our minds. While there are still many mysteries to be solved when it comes to fully understanding the inner workings of our brains, new discoveries suggest stepping away from the metaphysical philosophy of mind, and closer to the computational viewpoint. In light of the advent of strong artificial intelligence and the development of increasingly complex artificial life models and simulations, we need a well-defined, formal theory of consciousness. In order to facilitate this, in this work we introduce mappism. Mappism is a framework in which alternative views on consciousness can be formally expressed in a uniform way, thus allowing one to analyze and compare existing theories, and enforcing the use of the language of mathematics, i.e, explicit functions and variables. Using this framework, we describe classical and artificial life approaches to consciousness.","authors":["Iwo Błądek","Maciej Komosinski","Konrad Miazga"],"meta":["March 2019Foundations of Computing and Decision Sciences 44(1):55-99","DOI:10.2478/fcds-2019-0005"],"references":["329650273_Sweet_Dreams_Philosophical_Obstacles_to_a_Science_of_Consciousness","328558063_Universes_and_simulations_Civilizational_development_in_nested_embedding","322113871_PyPhi_A_toolbox_for_integrated_information_theory","301567963_Neural_correlates_of_consciousness_Progress_and_problems","324311065_Seeing_Is_Deceiving_The_Psychology_of_Visual_Illusions","324298157_Consciousness_Explained","315424954_Phenomenological_Approaches_to_Consciousness","310752135_Facing_Up_to_the_Problem_of_Consciousness","306040450_Tractatus_logico-philosophicus","301974526_'What_Is_It_Like_to_Be_a_Bat'"]}