{"id":"332076103_Can_a_Quantum_Walk_Tell_Which_Is_WhichA_Study_of_Quantum_Walk-Based_Graph_Similarity","abstract":"We consider the problem of measuring the similarity between two graphs using continuous-time quantum walks and comparing their time-evolution by means of the quantum Jensen-Shannon divergence. Contrary to previous works that focused solely on undirected graphs, here we consider the case of both directed and undirected graphs. We also consider the use of alternative Hamiltonians as well as the possibility of integrating additional node-level topological information into the proposed framework. We set up a graph classification task and we provide empirical evidence that: (1) our similarity measure can effectively incorporate the edge directionality information, leading to a significant improvement in classification accuracy; (2) the choice of the quantum walk Hamiltonian does not have a significant effect on the classification accuracy; (3) the addition of node-level topological information improves the classification accuracy in some but not all cases. We also theoretically prove that under certain constraints, the proposed similarity measure is positive definite and thus a valid kernel measure. Finally, we describe a fully quantum procedure to compute the kernel.","authors":["Giorgia Minello","Luca Rossi","Andrea Torsello"],"meta":["March 2019Entropy 21(3):328","DOI:10.3390/e21030328"],"references":["328037337_Thermodynamic_Analysis_of_Time_Evolving_Networks","273127551_Measuring_graph_similarity_through_continuous-time_quantum_walks_and_the_quantum_Jensen-Shannon_divergence","267741533_Approximate_von_Neumann_entropy_for_directed_graphs","321610148_Riemannian_Geometry_and_Geometric_Analysis","320181016_Network_Analysis_using_Entropy_Component_Analysis","309710940_fMRI_Activation_Network_Analysis_Using_Bose-Einstein_Entropy","288945826_Divergence_measures_based_on_the_Shannon_entropy","285096539_Quantum_random_walks_An_introductory_overview","272623654_Libsvm","262273541_Effective_graph_classification_based_on_topological_and_label_attributes"]}