{"id":"332062131_Ants_Go_Marching-Integrating_Computer_Science_into_Teacher_Professional_Development_with_NetLogo","abstract":"There is a clear call for pre-collegiate students in the United States to become literate in computer science (CS) concepts and practices through integrated, authentic experiences and instruction. Yet, a majority of in-service and pre-service pre-collegiate teachers (instructing children aged five to 18) lack the fundamental skills and self-efficacy to adequately and effectively integrate CS into existing curricula. In this study, 30 pre-collegiate teachers who represent a wide band of experience, grade-levels, and prior CS familiarity participated in a 16-day professional development (PD) course to enhance their content knowledge and self-efficacy in integrating CS into existing lessons and curricula. Using both qualitative and quantitative methodology, a social constructivist approach guided the researchers in the development of the PD, as well as the data collection and analysis on teacher content knowledge and perceptions through a mixed-methods study. Ultimately, participants were introduced to CS concepts and practices through NetLogo, which is a popular multi-agent simulator. The results show that although the pre-collegiate teachers adopted CS instruction, the CS implementation within their curricula was limited to the activities and scope of the PD with few adaptations and minimal systemic change in implementation behaviors.","authors":["Mike Borowczak","Andrea Burrows"],"meta":["March 2019Education Sciences 9(1)","DOI:10.3390/educsci9010066","Project: RAMPED - Robotics, Applied Mathematics, Physics, and Engineering Design"],"references":["318215513_Interactive_Web_Notebooks_Using_the_Cloud_to_Enable_CS_in_K-16","309399047_Partnerships_A_Systemic_Study_of_Two_Professional_Developments_with_University_Faculty_and_K-12_Teachers_of_Science_Technology_Engineering_and_Mathematics","303806832_Using_Robotics_and_Game_Design_to_Enhance_Children's_Self-Efficacy_STEM_Attitudes_and_Computational_Thinking_Skills","303720286_AUTHENTIC_SCIENCE_EXPERIENCES_PRE-COLLEGIATE_SCIENCE_EDUCATORS'_SUCCESSES_AND_CHALLENGES_DURING_PROFESSIONAL_DEVELOPMENT","292722310_A_Global_Snapshot_of_Computer_Science_Education_in_K-12_Schools","282734410_CTSiM_A_Computational_Thinking_Environment_for_Learning_Science_through_Simulation_and_Modeling","281825436_Teaching_computer_science_engineering_through_robotics_Science_art_form","281495128_Digital_Fabrication_and_'Making'_in_Education_The_The_Democratization_of_Invention","277679294_Fostering_Computational_Literacy_in_Science_Classrooms","272177975_Complex_Systems_in_Education_Scientific_and_Educational_Importance_and_Implications_for_the_Learning_Sciences"]}