{"id":"332030055_Utilization_of_trapezoidal_intuitionistic_fuzzy_numbers_and_extended_fuzzy_preference_relation_for_multi-criteria_group_decision-making_based_on_individual_differentiation_of_decision-makers","abstract":"In 2015, Li and Chen proposed a multi-criteria group decision-making (MCGDM) method, as similar as technique for order preference by similarity to ideal solution (TOPSIS), with trapezoidal intuitionistic fuzzy information to derive preference values (i.e., alternative ratings) based on individual differentiation of decision-makers. The individual differentiation consideration of decision-makers was useful because alternative ratings and criteria weights in group were generally derived by mean computation in the past. Additionally, MCGDM with trapezoidal intuitionistic fuzzy information is regarded to be the extension of multi-criteria decision-making (MCDM) with group decision-making under fuzzy environment. Practically, fuzzy extension of MCDM is commonly complicated based on the characteristics of fuzzy numbers, especially for intuitionistic fuzzy numbers that may be the most complex one for all kinds of fuzzy numbers. Obviously, Li and Chen’s contribution was extending MCGDM based on individual differentiation of decision-makers under trapezoidal intuitionistic fuzzy environment. Unfortunately, Li and Chen’s method merely expressed the importance difference of decision-makers for yielding preference values, but they derived criteria weights by mean computation. Therefore, the computations of preference values and criteria weights are inconsistent on considering the importance of decision-makers. Besides, their fuzzy extension was complicated and hard for MCGDM with trapezoidal intuitionistic fuzzy information. To resolve the importance inconsistent of yielding ratings and weights as well as fuzzy operation complicated ties, we utilize trapezoidal intuitionistic fuzzy numbers and extended fuzzy preference relation for MCGDM based on individual differentiation of decision-makers in this paper. By utilization of extended fuzzy preference relation, both alternative ratings and criteria weights of MCGDM under intuitionistic fuzzy environment are yielded based on individual differentiation of decision-makers, and decision-making problems are easily and reasonably solved. Furthermore, we also use the simplified version of the MCGDM with trapezoidal intuitionistic fuzzy numbers to evaluate alternatives in the illustrating example of Li and Chen, and compare their evaluating result with the result of proposed method based on individual differentiation of decision-makers.","authors":["Yu-Jie Wang"],"meta":["January 2020Soft Computing 24(1)","DOI:10.1007/s00500-019-03921-8"],"references":["335154668_Aggregation_operators_on_cubic_linguistic_hesitant_fuzzy_numbers_and_their_application_in_group_decision-making","333546912_Triangular_Cubic_Hesitant_Fuzzy_Einstein_Hybrid_Weighted_Averaging_Operator_and_Its_Application_to_Decision_Making","326778028_Cubic_fuzzy_Einstein_aggregation_operators_and_its_application_to_decision-making","325390426_Trapezoidal_cubic_fuzzy_number_Einstein_hybrid_weighted_averaging_operators_and_its_application_to_decision_making","323455928_Triangular_cubic_linguistic_hesitant_fuzzy_aggregation_operators_and_their_application_in_group_decision_making","326243454_Some_geometric_operators_with_triangular_cubic_linguistic_hesitant_fuzzy_number_and_their_application_in_group_decision-making","321980874_Weighted_Average_Rating_War_Method_for_Solving_Group_Decision_Making_Problem_Using_Triangular_Cubic_Fuzzy_Hybrid_Aggregation_Tcfha_Operator","320391819_Aggregation_operators_on_triangular_cubic_fuzzy_numbers_and_its_application_to_multi-criteria_decision_making_problems","320228222_Precursor_Selection_for_Sol-Gel_Synthesis_of_Titanium_Carbide_Nanopowders_by_a_New_Cubic_Fuzzy_Multi-Attribute_Group_Decision-Making_Model","313884299_Multiple_Attribute_Decision_Making_Based_on_Interval-Valued_Intuitionistic_Fuzzy_Sets_Linear_Programming_Methodology_and_the_Extended_TOPSIS_Method","272373632_Multi-criteria_group_decision_making_based_on_trapezoidal_intuitionistic_fuzzy_information","313443517_Multiple_attribute_decision_making_Methods_and_applications","309457075_Intuitionistic_fuzzy_sets","302934093_The_hamming_distance_between_intuitionistic_fuzzy_sets","273400873_A_fuzzy_multi-criteria_decision-making_model_based_on_simple_additive_weighting_method_and_relative_preference_relation"]}