{"id":"332068073_The_State_of_the_Art_in_Multi-Layer_Network_Visualization","abstract":"Modelling relationship between entities in real-world systems with a simple graph is a standard approach. However, reality is better embraced as several interdependent subsystems (or layers). Recently, the concept of a multi-layer network model has emerged from the field of complex systems. This model can be applied to a wide range of real-world data sets. Examples of multi-layer networks can be found in the domains of life sciences, sociology, digital humanities and more. Within the domain of graph visualization, there are many systems which visualize data sets having many characteristics of multi-layer graphs. This report provides a state of the art and a structured analysis of contemporary multi-layer network visualization, not only for researchers in visualization, but also for those who aim to visualize multi-layer networks in the domain of complex systems, as well as those developing systems across application domains. We have explored the visualization literature to survey visualization techniques suitable for multi-layer graph visualization, as well as tools, tasks and analytic techniques from within application domains. This report also identifies the outstanding challenges for multi-layer graph visualization and suggests future research directions for addressing them. © 2019 The Authors Computer Graphics Forum published by John Wiley & Sons Ltd.","authors":["Fintan Mcgee","Mohammad Ghoniem","Guy Melançon","B. Otjacques"],"meta":["March 2019Computer Graphics Forum 38(6)","DOI:10.1111/cgf.13610"],"references":["339593592_Towards_Visual_Analytics_of_Multilayer_Graphs_for_Digital_Cultural_Heritage","330190830_Exploring_the_limits_of_complexity_A_survey_of_empirical_studies_on_graph_visualisation","329067287_Generating_Visual_Clouds_from_Multiplex_Networks_for_TV_News_Archive_Query_Visualization","327085202_Node-Link_or_Adjacency_Matrices_Old_Question_New_Insights","326309918_Information_Visualization_Evaluation_Using_Crowdsourcing","326309061_SetCoLa_High-Level_Constraints_for_Graph_Layout","325742135_Multilayer_social_networks","322326662_Graph_Thumbnails_Identifying_and_Comparing_Multiple_Graphs_at_a_Glance","320848558_Network_Science_of_Biological_Systems_at_Different_Scales_A_Review","320074647_Crowdsourcing_for_Information_Visualization_Promises_and_Pitfalls"]}