{"id":"332064678_Multi-Objective_Optimization_In_Theory_and_Practice_II_Metaheuristic_Algorithms","abstract":"This second part of a study on multi-objective optimization (MOO) concerns the use of metaheuristic methods in challenging practical situations. These difficulties include the size of the real-world application, the nonlinearities, and discontinuities of the Pareto-optimal front we may have. Metaheuristic algorithms include evolutionary computation, such as an evolution strategy, evolution programming, and genetic algorithm. Thus, a particle swarm optimization algorithm is inspired by the social behavior of birds in flocks in search of food. Their extension to MOO problems required new concepts, such as Pareto domination ranking and fitness sharing. The goal is to maintain diversity in the population of solutions through successive generations. Collective strategies are possible within a population. Co-evolutionary models involve different populations or species. Solving MOO problems may use a decomposition into a sequence of subproblems. The hybrid evolutionary algorithm is another efficient method in which different metaheuristics or heuristics combine. This book is an attempt to handle the most significant aspects of the real-life complexities in decision-making. This book is typically user-oriented with theoretical and practical aspects. This book reviews and evaluates multi-objective programming models using several software packages. This book includes detailed examples, figures, test functions, and small-size applications from the literature. It is extended to other practical challenges as with many-objective (more than three objectives) optimization problems, and the requirement of parallel computations. This study presents and compares a variety of fifty test functions for which Pareto-fronts are determined. This book uses commercial and free packages like Mathematica ® and SciLab, respectively.","authors":["Andre A Keller"],"meta":["March 2019","DOI:10.2174/97816810870541190101","ISBN: 9781681087054"],"references":[]}