{"id":"332058299_UAV-Based_Photogrammetric_Tree_Height_Measurement_for_Intensive_Forest_Monitoring","abstract":"The measurement of tree height has long been an important tree attribute for the purpose of calculating tree growth, volume, and biomass, which in turn deliver important ecological and economical information to decision makers. Tree height has traditionally been measured by indirect field-based techniques, however these methods are rarely contested. With recent advances in Unmanned Aerial Vehicle (UAV) remote sensing technologies, the possibility to acquire accurate tree heights semi-automatically has become a reality. In this study, photogrammetric and field-based tree height measurements of a Scots Pine stand were validated using destructive methods. The intensive forest monitoring site implemented for the study was configured with permanent ground control points (GCPs) measured with a Total Station (TS). Field-based tree height measurements resulted in a similar level of error to that of the photogrammetric measurements, with root mean square error (RMSE) values of 0.304 m (1.82%) and 0.34 m (2.07%), respectively (n = 34). A conflicting bias was, however, discovered where field measurements tended to overestimate tree heights and photogrammetric measurements were underestimated. The photogrammetric tree height measurements of all trees (n = 285) were validated against the field-based measurements and resulted in a RMSE of 0.479 m (2.78%). Additionally, two separate photogrammetric tree height datasets were compared (n = 251), and a very low amount of error was observed with a RMSE of 0.138 m (0.79%), suggesting a high potential for repeatability. This study shows that UAV photogrammetric tree height measurements are a viable option for intensive forest monitoring plots and that the possibility to acquire within-season tree growth measurements merits further study. Additionally, it was shown that negative and positive biases evident in field-based and UAV-based photogrammetric tree height measurements could potentially lead to misinterpretation of results when field-based measurements are used as validation.","authors":["Stuart Krause","Tanja G M Sanders","Jan-Peter Mund","Klaus Greve"],"meta":["March 2019Remote Sensing 11(7):758","DOI:10.3390/rs11070758","Project: UAV Sensor based forest analytics and Forest 4.0 methods"],"references":["331166801_Environmental_Science_Environmental_Science","329151919_Is_field-measured_tree_height_as_reliable_as_believed_-_A_comparison_study_of_tree_height_estimates_from_field_measurement_airborne_laser_scanning_and_terrestrial_laser_scanning_in_a_boreal_forest","326823804_UAV_Multispectral_Imagery_Can_Complement_Satellite_Data_for_Monitoring_Forest_Health","326683703_International_benchmarking_of_terrestrial_laser_scanning_approaches_for_forest_inventories","326195969_Estimating_Individual_Tree_Height_and_Diameter_at_Breast_Height_DBH_from_Terrestrial_Laser_Scanning_TLS_Data_at_Plot_Level","325002326_Adaptive_measures_integrating_adaptive_forest_management_and_forest_landscape_restoration","324944340_Direct_Reflectance_Measurements_from_Drones_Sensor_Absolute_Radiometric_Calibration_and_System_Tests_for_Forest_Reflectance_Characterization","323858313_Large-area_mapping_of_Canadian_boreal_forest_cover_height_biomass_and_other_structural_attributes_using_Landsat_composites_and_lidar_plots","323113518_Estimation_and_Extrapolation_of_Tree_Parameters_Using_Spectral_Correlation_between_UAV_and_Pleiades_Data","325465707_Testing_and_evaluating_different_LiDAR-derived_canopy_height_model_generation_methods_for_tree_height_estimation"]}