{"id":"332116970_Design_and_Development_of_Web_Information_Systems","abstract":"This book describes the research of the authors over more than a decade on an end-to-end methodology for the design and development of Web Information Systems (WIS). It covers syntactics, semantics and pragmatics of WIS, introduces sophisticated concepts for conceptual modelling, provides integrated foundations for all these concepts and integrates them into the co-design method for systematic WIS development. WIS, i.e. data-intensive information systems that are realized in a way that arbitrary users can access them via web browsers, constitute a prominent class of information systems, for which acceptance by its a priori unknown users in varying contexts with respect to the presented content, the ease of functionality provided and the attraction of the layout adds novel challenges for modelling, design and development.\n\nThis book is structured into four parts. Part I, Web Information Systems – General Aspects, gives a general introduction to WIS describing the challenges for their development, and provides a characterization by six decisive aspects: intention, usage, content, functionality, context and presentation. Part II, High-Level WIS Design – Strategic Analysis and Usage Modelling with Storyboarding, introduces methods for high-level design of WIS covering strategic aspects and the storyboarding method, which is discussed from syntactic, semantic and pragmatic perspectives. Part III, Conceptual WIS Design – Rigorous Modelling of Web Information Systems and their Layout with Web Interaction Types and Screenography, continues with conceptual design of WIS including layout and playout. This introduces the decisive web interaction types, the screenography method and adaptation aspects. The final Part IV, Rationale of the Co-Design Methodology and Systematic Development of Web Information Systems, describes the co-design method for WIS development and its application for the systematic engineering of systems.\n\nThe book addresses the research community, and at the same time can be used for education of graduate students and as methodological support for professional WIS developers. For the WIS research community it provides methods for WIS modelling on all levels of abstraction including theoretical foundations and inference mechanisms as well as a sophisticated end-to-end methodology for systematic WIS engineering from requirements elicitation over conceptual modelling to aspects of implementation, layout and playout. For students and professional developers the book can be used as a whole for educational courses on WIS design and development, as well as for more specific courses on conceptual modelling of WIS, WIS foundations and reasoning, co-design and WIS engineering or WIS layout and playout development.","authors":["Klaus-dieter Schewe","Bernhard Thalheim"],"meta":["January 2019","DOI:10.1007/978-3-662-58824-6","ISBN: 978-3-662-58822-2"],"references":[]}