{"id":"332180067_Teaching_Tip_Learning_by_Teaching_through_Collaborative_Tutorial_Creation_Experience_using_GitHub_and_AsciiDoc","abstract":"Learning by teaching is a pedagogical technique that encourages mastery of a topic by having students teach each other. Student presentations, group discussions, and face-to-face teaching are frequently used to have students teach their peers. In this paper, we describe the use of a novel assignment to implement learning by teaching. In a course assignment, learners created a tutorial using the AsciiDoc markup language. The tutorials were uploaded to a Git source control repository on the GitHub platform and combined into a single electronic book. Students were asked to complete their peers’ tutorials and provide constructive feedback. The assignment had several goals. First, students would master the topic chosen for the tutorial. Also, students would gain experience creating their own learning plans to master the topic. Next, students would learn about source control and markup languages. Finally, students would publish the resources to make the tutorials publicly available to contribute to the existing corpus of open educational resources. A survey was conducted after the final assignment submission. Results from the reflection survey show that students generally favored the assignment and found it to be a useful learning experience despite some challenges working with the technology stack. Experiences from the instructor’s point of view are shared to provide guidance for implementing this type of exercise effectively.","authors":["Jim Marquardson","Ryan Schuetzler"],"meta":["January 2019Journal of Information Systems Education 30(1):10-18"],"references":["327474223_Learning_by_teaching_developing_transferable_skills","286689967_An_OER_COUP_College_Teacher_and_Student_Perceptions_of_Open_Educational_Resources","225557983_Millennials_and_the_World_of_Work_An_Organization_and_Management_Perspective","308494489_Open_Content_and_Open_Educational_Resources_Enabling_universal_education","306205000_Teaching_Smart_People_How_to_Learn","285538622_Bridging_the_Qualitative-Quantitative_Divide_Guidelines_for_Conducting_Mixed_Methods_Research_in_Information_Systems","246255758_From_Sage_on_the_Stage_to_Guide_on_the_Side","233057723_The_didactic_model_LdL_Lernen_durch_Lehren_as_a_way_of_preparing_students_for_communication_in_a_knowledge_society","228328452_Active_Learning_Creating_Excitement_in_the_Classroom","41163334_Open_Educational_Resources_and_Open_Content_for_Higher_Education","31066187_Peer_teaching_peer_learning_One_model"]}