{"id":"332177565_Machine_Learning_and_Artificial_Intelligence_as_a_Complement_to_Condition_Monitoring_in_a_Predictive_Maintenance_Setting","abstract":"In recent years, the oil and gas industry has gained greater operational efficiencies and productivity by deploying advanced technologies, such as smart sensors, data analytics, artificial intelligence and machine learning — all linked via Internet of Things connectivity. This transformation is profound, but just starting. Leading offshore E&P operators envision using such applications to help drive their production costs to as low as $7 per barrel or less. A large North Sea operator among them successfully deployed a low-manned platform in the Ivar Aasen field in December 2016, operating it via redundant control rooms — one on the platform, the other onshore 1,000 kilometers away in Trondheim, Norway. In January 2019, the offshore control room operators handed over the platform's control to the onshore operators, and it is now managed exclusively from the onshore one. One particular application — remote condition monitoring of equipment — supports a proactive, more predictive condition-based maintenance program, which is helping to ensure equipment availability, maximize utilization, and find ways to improve performance. This paper will explain the use case in greater detail, including insights into how artificial intelligence and machine learning are incorporated into this operational model. Also described will be the application of a closed-loop lifecycle platform management model, using the concepts of digital twins from pre-FEED and FEED phases through construction, commissioning, and an expected lifecycle spanning 20 years of operations. It is derived from an update to a paper presented at the 2018 SPE Offshore Technology Conference (OTC) that introduced the use case in its 2017-18 operating model, but that was before the debut of the platform's exclusive monitoring of its operations by its onshore control room.","authors":["Stig Settemsdal"],"meta":["April 2019","DOI:10.2118/194590-MS","Conference: SPE Oil and Gas India Conference and Exhibition"],"references":[]}