{"id":"332163254_Success_with_EASE_Who_benefits_from_a_STEM_learning_community","abstract":"During the past few decades, there has been a nationwide push to improve performance and persistence outcomes for STEM undergraduates. As part of this effort, recent research has emphasized the need for focus on not only improving the delivery of course content, but also addressing the social-psychological needs of students. One promising intervention type that has been proposed as a multifaceted way to address both cognitive and social-psychological aspects of the learning process is the learning community. Learning communities provide students with opportunities to build a strong support system in college and are generally associated with increased student engagement and integration with campus systems and cultures. In this study, we examine the impact of a learning community intervention for first-year biological sciences majors, the Enhanced Academic Success Experience (EASE) program. Incoming freshmen are assigned to EASE based on their SAT (or ACT equivalent) Math score, a metric demonstrated to be a key predictor of student success in the program. We find that enrollment in EASE is correlated with higher STEM course grades; an increase of 0.25 (on a 0–4 point scale) in cumulative first-year GPA; and gains in non-academic outcomes, such as measures of sense of belonging and academic integration. Further, these outcomes are more pronounced for particular subgroup populations. For example, whereas surveyed male students seemed to benefit academically from participating in a learning community, female students reported a greater sense of belonging in regard to the biological sciences major and reported higher values for behavioral indicators of academic integration. Lastly, we find that the EASE program is positively correlated with students’ intention to stay in the biological sciences major. And, among the three race-oriented groups, this impact is most pronounced for under-represented students. In light of these findings, we discuss the potential of discipline-specific learning community programs to improve academic outcomes for students most at risk of leaving STEM majors, such as students underprepared for college level coursework.","authors":["Sabrina Solanki","Peter Mcpartlan","Di Xu","Brian K. Sato"],"meta":["March 2019PLoS ONE 14(3)","DOI:10.1371/journal.pone.0213827"],"references":["319549711_Bridging_the_Gap_Academic_Preparation_and_Postsecondary_Success_of_First-Generation_Students","290495197_Race_and_Belonging_in_School_How_Anticipated_and_Experienced_Belonging_Affect_Choice_Persistence_and_Performance","283455848_Closing_Achievement_Gaps_With_a_Utility-Value_Intervention_Disentangling_Race_and_Social_Class","349042124_Learning_Communities_Creating_Connections_among_Students_Faculty_and_Disciplines","318517973_Leaving_College_Rethinking_the_Causes_and_Cures_of_Student_Attrition","305166663_Dropout_from_Higher_Education_A_Theoretical_Synthesis_of_Recent_Research","287771101_Achievement_and_achievement_motives_psychological_and_sociological_approaches","287041785_College_Students'_Sense_of_Belonging_A_Key_to_Educational_Success_for_All_Students","286338460_Fostering_Positive_Narratives_Social-Psychological_Interventions_to_Maximize_Motivation_in_the_Classroom_and_Beyond","283296762_Learning_Communities_Reforming_Undergraduate_Educatiom"]}