{"id":"332165523_Survey_on_deep_learning_with_class_imbalance","abstract":"The purpose of this study is to examine existing deep learning techniques for addressing class imbalanced data. Effective classification with imbalanced data is an important area of research, as high class imbalance is naturally inherent in many real-world applications, e.g., fraud detection and cancer detection. Moreover, highly imbalanced data poses added difficulty, as most learners will exhibit bias towards the majority class, and in extreme cases, may ignore the minority class altogether. Class imbalance has been studied thoroughly over the last two decades using traditional machine learning models, i.e. non-deep learning. Despite recent advances in deep learning, along with its increasing popularity, very little empirical work in the area of deep learning with class imbalance exists. Having achieved record-breaking performance results in several complex domains, investigating the use of deep neural networks for problems containing high levels of class imbalance is of great interest. Available studies regarding class imbalance and deep learning are surveyed in order to better understand the efficacy of deep learning when applied to class imbalanced data. This survey discusses the implementation details and experimental results for each study, and offers additional insight into their strengths and weaknesses. Several areas of focus include: data complexity, architectures tested, performance interpretation, ease of use, big data application, and generalization to other domains. We have found that research in this area is very limited, that most existing work focuses on computer vision tasks with convolutional neural networks, and that the effects of big data are rarely considered. Several traditional methods for class imbalance, e.g. data sampling and cost-sensitive learning, prove to be applicable in deep learning, while more advanced methods that exploit neural network feature learning abilities show promising results. The survey concludes with a discussion that highlights various gaps in deep learning from class imbalanced data for the purpose of guiding future research.","authors":["Justin Johnson","Taghi Khoshgoftaar"],"meta":["March 2019Journal of Big Data 6(1):27","DOI:10.1186/s40537-019-0192-5"],"references":["328678792_A_survey_on_addressing_high-class_imbalance_in_big_data","327432720_Big_Data_fraud_detection_using_multiple_medicare_data_sources","327410730_The_effects_of_varying_class_distribution_on_learner_behavior_for_medicare_fraud_detection_with_imbalanced_big_data","325551337_Dynamic_Sampling_in_Convolutional_Neural_Networks_for_Imbalanced_Data_Classification","324926148_Imbalanced_Deep_Learning_by_Minority_Class_Incremental_Rectification","342232632_Extreme_Learning_Machine_Theory_and_Applications","330474699_An_Empirical_Study_on_Class_Rarity_in_Big_Data","329747335_Data_Sampling_Approaches_with_Severely_Imbalanced_Big_Data_for_Medicare_Fraud_Detection","328996603_Classification_of_Rare_Building_Change_Using_CNN_with_Multi-Class_Focal_Loss","326707856_Image_classification_with_category_centers_in_class_imbalance_situation"]}