{"id":"332182707_AN_AN_IN-DEPTH_IN-DEPTH_STUDY_STUDY_OF_OF_TYPICAL_TYPICAL_MACHINE_MACHINE_LEARNING_LEARNING_METHODS_METHODS_VIA_VIA_COMPUTATIONAL_COMPUTATIONAL_TECHNIQUES_TECHNIQUES","abstract":"The ability to model and perform decision modeling and analysis is an essential feature of many real-world applications ranging from emergency medical treatment in intensive care units to military command and control systems. Models are essential in providing support for businesses processes, systems and dealing with complex problems. The development of appropriate models for planning and management is a tool for improving efficiency in real world problems. Consequently, a thorough study of common machine learning techniques is undertaken with the aim of comparing the techniques and identifying a suitable technique that is applicable to modeling and forecasting real world data. Modeling helps make informed decisions, using techniques for analysis, estimation and, forecasting. There is a lot of research published about machine learning techniques, with the intention of developing models for estimations. In order to identify an appropriate machine learning technique, it is necessary to carry out a comparative study of commonly used machine learning techniques. For this purpose, a review of Box-Jenkins technique, regression method and artificial neural network (ANN) is undertaken with the aim of identifying a reliable and accurate technique for modeling data.","authors":["Patrick Ozoh Phd","Olayiwola M O","Adepeju Abeke Adigun"],"meta":["November 2018Analele Universitatii Ovidius Constanta 16(2):77-81","Project: improving method of evaluating semantic filtering for human computer interaction in an adaptive collaborative learning environment"],"references":["224155275_Real-Time_Recognition_and_Profiling_of_Appliances_through_a_Single_Electricity_Sensor","221053237_Power_Prediction_in_Smart_Grids_with_Evolutionary_Local_Kernel_Regression","313218385_Artificial_neural_networks_An_introduction","280806206_Applications_of_artificial_neural-networks_for_energy_systems","221995190_Wavelet_transform_and_neural_networks_for_short-term_electrical_load_forecasting","3213451_Forecasting_Next-Day_Electricity_Prices_by_Time_Series_Models"]}