{"id":"332145066_Reflectance_computation_for_a_specular_only_V-cavity","abstract":"The color of a surface structured at the mesoscopic scale differs from the one of a flat surface of the same material because of the light interreflec-tions taking place in the concavities of the surface, as well as the shadowing effect. The color variation depends not only on the surface topology but also on the spectral reflectance of the material, its matte or glossy finishing, and the angular distribution of the incident light. For an accurate prediction of the radiance perceived from each point of the object by an observer or a camera, we must take into account comprehensively the multiple paths of light which can be reflected, scattered or absorbed by the material and its surface. In this paper, we focus on the light reflection component due to the material-air interface, in the special case of a surface structured with parallel, periodical, specular V-shaped ridges, illuminated either by collimated light from any direction of the hemisphere, or by diffuse light. Thanks to an analytical model, we compute the radiance reflected in every direction of the hemisphere by accounting for the different interreflections, according to the angular reflectance of the panels and the aperture angle of the cavity. We can then deduce the apparent reflectance of the cavity when viewed from a large distance.","authors":["Dorian Saint-Pierre","Lionel Simonot","Mathieu Hébert"],"meta":["March 2019","Conference: CCIW 2019At: Chiba - Japan","Project: Models for material appearance"],"references":["329274014_Practical_multiple_scattering_for_rough_surfaces","323571736_Spectral_reflectance_estimation_from_one_RGB_image_using_self-interreflections_in_a_concave_object","323027301_Light_interreflections_and_shadowing_effects_in_a_Lambertian_V-cavity_under_diffuse_illumination","249655372_Effect_of_light_scatter_on_halftone_color","242421402_Theory_for_Off-Specular_Reflection_From_Roughened_Surfaces","231075466_Physics_of_structural_colors","305217674_Multiple-scattering_microfacet_BSDFs_with_the_Smith_model","265556326_Characterization_of_the_gonioapparent_character_of_colored_anodized_titanium_surfaces","239588647_The_Effect_of_Multiple_Internal_Reflections_on_the_Densities_of_Halftone_Prints_on_Paper","234417243_The_Scattering_of_Electromagnetic_Waves_From_Rough_Surfaces"]}