{"id":"332146320_Science_teachers'_pedagogical_content_knowledge_development_during_enactment_of_socioscientific_curriculum_materials","abstract":"The purpose of this study is to provide insight into short‐term professionalization of teachers regarding teaching socioscientific issues (SSI). The study aimed to capture the development of science teachers' pedagogical content knowledge (PCK) for SSI teaching by enacting specially designed SSI curriculum materials. The study also explores indicators of stronger and weaker development of PCK for SSI teaching. Thirty teachers from four countries (Cyprus, Israel, Norway, and Spain) used one module (30–60 min lesson) of SSI materials. The data were collected through: (a) lesson preparation form (PCK‐before), (b) lesson reflection form (PCK‐after), (c) lesson observation table (PCK‐in‐action). The data analysis was based on the PCK model of Magnusson, Krajcik, and Borko (1999). Strong development of PCK for SSI teaching includes “Strong interconnections between the PCK components,” “Understanding of students' difficulties in SSI learning,” “Suggesting appropriate instructional strategies,” and “Focusing equally on science content and SSI skills.” Our findings point to the importance of these aspects of PCK development for SSI teaching. We argue that when professional development programs and curriculum materials focus on developing these aspects, they will contribute to strong PCK development for SSI teaching. The findings regarding the development in the components of PCK for SSI provide compelling evidence that science teachers can develop aspects of their PCK for SSI with the use of a single module. Most of the teachers developed their knowledge about students' understanding of science and instructional strategies. The recognition of student difficulties made the teacher consider specific teaching strategies which are in line with the learning objectives. There is an evident link between the development of PCK in instructional strategies and students' understanding of science for SSI teaching.","authors":["Dürdane (Dury) Bayram-Jacobs","Ineke Henze","Maria Evagorou","Yael Shwartz"],"meta":["April 2019Journal of Research in Science Teaching 56(9)","DOI:10.1002/tea.21550","Project: Engaging Science"],"references":["321110274_Responsible_Research_and_Innovation_in_Science_Education_The_Solution_or_The_Emperor's_New_Clothes","319966954_Relating_Teacher_PCK_and_Teacher_Practice_Using_Classroom_Observation","319903036_Exploring_Pedagogical_Content_Knowledge_of_European_Science_Teachers_Using_Educative_Materials_on_SSI","330693754_Unravelling_Student_Science_Teachers'_pPCK_Development_and_the_Influence_of_Personal_Factors_Using_Authentic_Data_Sources","324579406_From_professional_knowledge_to_professional_performance_The_impact_of_CK_and_PCK_on_teaching_quality_in_explaining_situations","321610032_Socio-scientific_Issues_in_the_Classroom_Teaching_Learning_and_Research","321526437_Science_and_Technology_Education_Promoting_Wellbeing_for_Individuals_Societies_and_Environments_STEPWISE","320389507_Design_of_a_Socio-scientific_Issue_Curriculum_Unit_Antibiotic_Resistance_Natural_Selection_and_Modeling","318586604_Understanding_and_Developing_Science_Teachers'_Pedagogical_Content_Knowledge","318156213_Students'_Social_Studies_Influences_on_Their_Socioscientific_Actions"]}