{"id":"332154069_ISSN_2249-0868_Foundation_of_Computer_Science_FCS","abstract":"The generation of timetables has always been tedious right from time and apart from being tedious, the timetable created has always been filled with series of errors and mistakes. So many techniques have been put forward to solving this problem. In this paper, genetic Algorithm was used by creating a group of time series randomly from a given time and courses in other to find a solution to the timetable problems. The courses thus formed are evaluated with the help of the evaluation function. system administrator logs into the system and then the administrator input the courses with their codes and the unit. At that point, the admin will keep adding until the number of courses needed has been inputted. The admin can remove a course that has been inputted in the case of error. After inputting the courses, it moves to the next page where all the lecture halls or rooms that will be used will be inputted. After inputting these, the system then generates the timetable system. This technique (genetic algorithm) used helps in reducing to barest minimum, errors and mistakes in encountered in developing an automatic timetable.","authors":["Kehinde Williams","Ajayi Olutayo Bamidele","Ajinaja Micheal Olalekan"],"meta":["February 2019","Project: Automatic Timetable Generation using Genetic Algorithm"],"references":["319449795_Integer_Linear_Programming","330689937_The_practical_handbook_of_genetic_algorithms_Applications_second_edition","313629838_A_template_for_scatter_search_and_path_relinking","268496630_Genetic_Algorithms_and_Fuzzy_Logic_Systems_Soft_Computing_Perspectives","267482063_Ist_Numerical_Schemes_for_Nonlinear_Evolution_Equations_of_Physical_Interest","266753356_Computer_Simulation_in_Genetics","224982542_Computing_Machinery_and_Intelligence","221419611_An_Evolutionary_Approach_to_Constraint-Based_Timetabling","201976957_Evolutionary_Algorithms_in_Theory_and_Practice","30870312_Genetic_Algorithm_in_Search_Optimization_and_Machine_Learning","2334019_Problem_Independent_Distributed_Simulated_Annealing_and_its_Applications","2251422_Constructing_School_Timetables_Using_Simulated_Annealing_Sequential_and_Parallel_Algorithms"]}