{"id":"332122595_Robotics_to_develop_computational_thinking_in_early_Childhood_Education","abstract":"The development of programming skills is currently promoting from an early school age, trying to get children to take an active and creative role in the use of technologies. The objective of this article is to verify the repercussion of educational robotics activities on kindergarten students in the acquisition of computational thinking and programming skills. The research design is quasi-experimental, with pre-test and post-test measures, using experimental and control groups. The sample consists of 131 students from the second cycle of early education (between 3 and 6 years old), all from the same Spanish school. Computational thinking is measured through three dimensions: sequences (algorithms), action-instruction correspondence and debugging. The intervention sessions, as well as the structure of the challenges that were used in the pre- and post-test evaluations, were designed based on the reference program of robotics studies called \"TangibleK\". The intervention, carried out doing learning activities using educational robotics resources, presents positive results in relation to the computational thinking skills achieved. The differences between the pre-test and the post-test in the experimental and control groups are statistically significant, in that children engaged in robotics program achieves a greater advance in the three dimensions of computational competence through this method.","authors":["Ana García-Valcárcel-Muñoz-Repiso","Yen Caballero Gonzalez"],"meta":["April 2019Comunicar 27(59)","DOI:10.3916/C59-2019-06","Project: Aprendizaje Colaborativo y Pensamiento Computacional a través de TIC y Robots Programables"],"references":["324601210_Iniciacion_al_algebra_en_Educacion_Infantil_a_traves_del_pensamiento_computacional_una_experiencia_sobre_patrones_con_robots_educativos_programables","322246358_Enhancing_learning_as_theoretical_thinking_in_robotic_surgery","322021418_Breakdowns_in_children's_interactions_with_a_robotic_tutor_A_longitudinal_study","321350423_Development_of_computational_thinking_skills_and_collaborative_learning_in_initial_education_students_through_educational_activities_supported_by_ICT_resources_and_programmable_educational_robots","320637894_Implementing_a_Robotics_Curriculum_in_an_Early_Childhood_Montessori_Classroom","320447583_Educational_robots_and_children's_imagery_a_preliminary_investigation_in_the_first_year_of_primary_school","345072407_Computational_Thinking_and_Multifaceted_Skills_A_Qualitative_Study_in_Primary_Schools","322179197_Robotics-Based_Learning_Interventions_and_Experiences_From_our_Implementations_in_the_RobESL_Framework","322179105_The_RoboESL_Project_Development_Evaluation_and_Outcomes_Regarding_the_Proposed_Robotic_Enhanced_Curricula","320849825_Introducing_computational_thinking_to_5_and_6_year_old_students_in_dutch_primary_schools_an_educational_design_research_study"]}