{"id":"332140232_Jobseeker-industry_matching_system_using_automated_keyword_selection_and_visualization_approach","abstract":"Learning opportunities are available with the accessibility of new learning technologies, discovery of untraditional learning pathways and awareness of the importance of connecting current knowledge with new learning. Such situation allows the expansion in the number of courses, programs and professional certifications offered to the students resulting to the increment of the number of graduates annually. The graduates then employed by the industry for executing the job. However, there is a growing concern about the increment of unemployed graduates in the job market. One of the reasons of the mismatch between graduates’ skills and employers’ needs is that the jobseekers tend to choose wrong job because they are overwhelmed by the choices and typically they just randomly send the application because it is time consuming to filter relevant advert. Such action may have repercussion to the industry because the employers need to select relevant candidates to fill up the post from the unfiltered pile of applications making the selection process lengthy and time consuming. In this paper we proposed an automated approach to match the graduates’ and employers’ needs using a hybrid of text mining and visualization approach to facilitate jobseekers’ task of relevant job application. The important keywords are automatically extracted based on the frequency of the word used in the adverts. Then, the graduates’ skills are matched from their personalized profile. Relevant visualization approaches are incorporated to facilitate the selection. It is practical and feasible for the proposed approach to be incorporated in job searching websites that can optimize jobseekers and employers time and effort for a suitable match.","authors":["Norhaslinda Kamaruddin","Abdul Wahab Abdul Rahman","Ramizah Amirah Mohd Lawi"],"meta":["March 2019Indonesian Journal of Electrical Engineering and Computer Science 13(3):1124-1129","DOI:10.11591/ijeecs.v13.i3.pp1124-1129"],"references":["325863527_Assessment_Analytic_Theoretical_Framework_Based_on_Learners'_Continuous_Learning_Improvement","290169681_Automatic_keyword_extraction_from_documents_using_conditional_random_fields","288002835_Classification_of_Web_Job_Advertisements_A_Case_Study","281401625_Matching_GitHub_Developer_Profiles_to_Job_Advertisements","273569918_Increase_in_the_demand_for_private_higher_education_unmasking_the_paradox","321897520_Data-Driven_Job_Search_Engine_Using_Skills_and_Company_Attribute_Filters","221024092_Finding_advertising_keywords_on_web_pages","2955108_Research_Feature_Digital_Libraries_and_Autonomous_Citation_Indexing"]}