{"id":"332131001_Syntactic_Complexity_and_Writing_Quality_in_Assessed_First-Year_L2_Writing","abstract":"This study explores the relationship between syntactic complexity and writing quality in assessed source-based research papers produced by ESL undergraduate writers in a first-year writing course through a combination of holistic and fine-grained measures of complexity. The analysis is based on a corpus of 280 student papers across three grade tiers: high, mid, and low. A one-way MANOVA was used to explore the statistical significance of differences of five commonly used syntactic complexity measures (assessed using Lu’s Second Language Syntactic Complexity Analyzer, 2010) across these grade tiers. Results reveal little variation in clausal subordination and coordination, but statistically significant lower complex nominal densities, mean length of clauses (phrasal measures), and mean length of T-units (global measure) in low-rated papers. Analysis of complex nominal composition using the Stanford Tregex with differences assessed with a one-way MANOVA shows that the highest densities of complex nominal types are present in high-rated papers, with statistical significance in adjectival pre-, prepositional post-, and participle modification, and the lowest densities in low-rated papers. While clausal complexity did not demonstrate a relationship with assessed quality, both global and phrasal complexity features appear to be important components. We conclude with implications for syntactic complexity research and ESL composition pedagogy.\n\nYou can view this article for free until May 20th with the following link: https://authors.elsevier.com/a/1YpoU3n6UYaaTi","authors":["J. Elliott Casal","Joseph J. Lee"],"meta":["June 2019Journal of Second Language Writing 44:51-62","DOI:10.1016/j.jslw.2019.03.005","Project: The Corpus of Ohio Learner and Teacher English (COLTE)"],"references":["322381900_Citation_practices_of_L2_university_students_in_first-year_writing_Form_function_and_stance","322333127_Phrasal_complexity_in_academic_writing_A_comparison_of_abstracts_written_by_graduate_students_and_expert_writers_in_applied_linguistics","280289927_Does_writing_development_equal_writing_quality_A_computational_investigation_of_syntactic_complexity_in_L2_learners","319913659_Automated_measurement_of_syntactic_complexity_in_corpus-based_L2_writing_research_and_implications_for_writing_assessment","318199378_Comparing_L1_and_L2_Texts_and_Writers_in_First-Year_Composition","315894010_Linguistic_complexity_in_L2_writing_revisited_Issues_of_topic_proficiency_and_construct_multidimensionality","313887391_An_Investigation_of_Native_and_Non-Native_English_Speakers'_Levels_of_Written_Syntactic_Complexity_in_Asynchronous_Online_Discussions","302054558_The_Linguistic_Development_of_Students_of_English_as_a_Second_Language_in_Two_Written_Genres","298724135_Understanding_first-year_L2_writing_A_lexico-grammatical_analysis_across_L1s_genres_and_language_ratings","282628496_Syntactic_complexity_in_L2_writing_Progress_and_expansion"]}