{"id":"332236198_Multiple_features_fusion_based_video_face_tracking","abstract":"With the development of monitoring equipment and artificial intelligence technology, video face tracking under the big data background has become an important research hot spot in the field of public security. In order to track robustly under the circumstances of illumination variation, background clutter, fast motion, partial occlusion and so on, this paper proposed an algorithm combining a multi-feature fusion in the frame of particle filter and an improved mechanism, which consists of three main steps. At first, the color and edge features of human face were extracted from the video sequence. Meanwhile, color histograms and edge orientation histograms (EOH) were used to describe the facial features and beneficial to improve the efficiency of calculation. Then we employed a self-adaptive features fusion strategy to calculate the particle weight, which can effectively enhance the reliability of face tracking. Moreover, in order to solve the computational efficiency problem caused by too many particles, we added the integral histogram method to simplify the calculation complexity. At last, the object model was updated between the current object model and the initial model for alleviating the model drifts. Experiments conducted on testing dataset show that this proposed approach can robustly track single face with the cases of complex backgrounds, such as similar skin color, illumination change and occlusion, and perform better than color-based and edge-based methods in terms of both quantitative metrics and visual quality.","authors":["Tianping Li","Pingping Zhou","Hui Liu"],"meta":["August 2019Multimedia Tools and Applications 78(2):1-18","DOI:10.1007/s11042-019-7414-x"],"references":["322058609_Tracking_the_Untrackable_Learning_to_Track_Multiple_Cues_with_Long-Term_Dependencies","320449428_Distance_Metric_Optimization_Driven_Convolutional_Neural_Network_for_Age_Invariant_Face_Recognition","312170101_Tracking_The_Untrackable_Learning_To_Track_Multiple_Cues_with_Long-Term_Dependencies","303017137_An_Introduction_to_the_Kalman_Filter","289885934_Face_tracking_based_on_particle_filter_using_color_histogram_and_contour_distributions","284122025_From_Action_to_Activity_Sensor-Based_Activity_Recognition","283803754_An_Improved_Spatial_Histogram_and_Particle_Filter_Face_Tracking","281944060_Bayesian_Multi-object_Tracking_Using_Motion_Context_from_Multiple_Objects","276485126_A_fusion_method_for_robust_face_tracking","263546955_Visual_Tracking_Via_Kernel_Sparse_Representation_With_Multikernel_Fusion","224207676_Dynamic_weighted_discrimination_power_analysis_A_novel_approach_for_face_and_palmprint_recognition_in_DCT_domain","261019002_Face_tracking_with_an_Adaptive_Adaboost-based_Particle_Filter","236080804_Visual_Tracking_With_Spatio-Temporal_Dempster-Shafer_Information_Fusion","225249640_Color_Indexing","224730474_Kailath_T_The_divergence_and_Bhattacharyya_distance_measures_in_signal_selection_IEEE_Trans_on_Comm_Tech_151_52-60"]}