{"id":"332249025_Restricted_cascade_and_wreath_products_of_fuzzy_finite_switchboard_state_machines","abstract":"A finite switchboard state machine is a specialized finite state machine. It is built by binding the concepts of switching state machines and commutative state machines. The main purpose of this paper is to give a specific algorithm for fuzzy finite switchboard state machine and also, investigates the concepts of switching relation, covering, restricted cascade products and wreath products of fuzzy finite switchboard state machines. More precisely, we study that the direct products/Cartesian compositions of two such fuzzy finite switchboard state machines is again a fuzzy finite switchboard state machine. In addition, we introduce the perfect switchboard machine and establish its Cartesian composition. The relations among the products also been examined. Finally, we introduce asynchronous fuzzy finite switchboard state machine and study the switching homomorphic image of asynchronous fuzzy finite switchboard state machine. We illustrate the definition of a restricted product of fuzzy finite switchboard state machine with the single pattern example. © 2019, University of Sistan and Baluchestan. All rights reserved.","authors":["Kavikumar Jacob","S. P. Tiwari","Nor Shamsidah Amir Hamzah","Dr. Shambhu Sharan"],"meta":["January 2019Iranian Journal of Fuzzy Systems 16(1):75-88"],"references":["320006854_Bipolar_fuzzy_finite_state_machines","272947883_On_the_State_Minimization_of_Fuzzy_Automata","318828275_Quantitative_model_checking_of_linear-time_properties_based_on_generalized_possibility_measures","304403210_State-Based_Decentralized_Diagnosis_of_Bi-Fuzzy_Discrete_Event_Systems","276378544_Bi-Fuzzy_Discrete_Event_Systems_and_Their_Supervisory_Control_Theory","273393616_Supervisory_Control_of_Fuzzy_Discrete-Event_Systems_for_Simulation_Equivalence","265826721_Fuzzy_finite_switchboard_state_machines","262878577_The_universal_fuzzy_automaton","257391654_Fuzzy_relation_equations_and_subsystems_of_fuzzy_transition_systems","256721345_Algebraic_properties_of_L-fuzzy_finite_automata"]}