{"id":"332224186_A_gestao_documental_associada_a_modelagem_de_processos_de_negocios_praticas_interdisciplinares_na_especificacao_de_sistemas_de_recuperacao_da_informacao_-_Records_management_associated_with_business_p","abstract":"The technological and informational scenario of contemporary society has demanded from the information professionals diversified knowledge to be applied in different\nperspectives, especially in contexts that involve the improvement of corporate processes. In the meantime, managing documents and information is a prerequisite in process mapping and modeling projects, since they support activities and record all legal and regulatory information in the context. This work presents a stage of the Aurus Project.\nThe purpose of the Project was to specify the requirements for the development of an information retrieval system. The step here presented presents the follow-up of Information Science professionals during the business process modeling activities performed by Computer Science professionals. The skills and abilities of the information professional developed at the stage, initially little recognized, resulted in documentary modeling of the process, impacting greatly on the final product of the Project. The results show the importance of interdisciplinarity by linking the practice of documentary studies to the specification of requirements of a management technology, besides demonstrating the applicability of the practice to other organizational contexts.","authors":["Livia Marangon Duffles Teixeira","Elisângela C Aganette"],"meta":["March 2019","DOI:10.36311/1981-1640.2019.v13n1.05.p33"],"references":["250991531_Analise_arquivistica_e_recomendacoes_sobre_documentos_de_arquivo_do_Estado_de_Minas_Gerais","237626939_Business_Modeling_with_UML_The_Light_at_the_End_of_the_Tunnel","339014070_A_gestao_da_informacao_e_a_modelagem_de_processos","311665741_Ontologias_no_suporte_a_caracterizacao_de_processos_uma_proposta_de_estudo_-_Ontologies_supporting_the_characterization_of_processes_a_proposal_for_study"]}