{"id":"332203589_Deep_Learning_Approach_for_Intelligent_Intrusion_Detection_System","abstract":"Machine learning techniques are being widely used to develop an intrusion detection system (IDS) for detecting and classifying cyber-attacks at the network-level and host-level in a timely and automatic manner. However, many challenges arise since malicious attacks are continually changing and are occurring in very large volumes requiring a scalable solution. There are different malware datasets available publicly for further research by cyber security community. However, no existing study has shown the detailed analysis of the performance of various machine learning algorithms on various publicly available datasets. Due to the dynamic nature of malware with continuously changing attacking methods, the malware datasets available publicly are to be updated systematically and benchmarked. In this paper, deep neural network (DNN), a type of deep learning model is explored to develop a flexible and effective IDS to detect and classify unforeseen and unpredictable cyber-attacks. The continuous change in network behaviour and rapid evolution of attacks makes it necessary to evaluate various datasets which are generated over the years through static and dynamic approaches. This type of study facilitates to identify the best algorithm which can effectively work in detecting future cyber-attacks. A comprehensive evaluation of experiments of DNNs and other classical machine learning classifiers are shown on various publicly available benchmark malware datasets. The optimal network parameters and network topologies for DNNs is chosen through following hyper parameter selection methods with KDDCup 99 dataset. All experiments of DNNs are run till 1,000 epochs with learning rate varying in the range [0.01-0.5]. The DNN model which performed well on KDDCup 99 is applied on other datasets such as NSL-KDD, UNSW-NB15, Kyoto, WSN-DS and CICIDS 2017 to conduct the benchmark. Our DNN model learns the abstract and high dimensional feature representation of the IDS data by passing them into many hidden layers. Through a rigorous experimental testing it is confirmed that DNNs perform well in comparison to the classical machine learning classifiers. Finally, we propose a highly scalable and hybrid DNNs framework called Scale-Hybrid-IDS-AlertNet (SHIA) which can be used in real time to effectively monitor the network traffic and host-level events to proactively alert possible cyber-attacks","authors":["Vinayakumar Ravi","Mamoun Alazab","Soman Kp","Prabaharan Poornachandran"],"meta":["April 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2895334","Projects: Network Traffic AnalysisNetwork Intrusion Detection System"],"references":["329370125_Use_of_Data_Visualisation_for_Zero-Day_Malware_Detection","327085273_Enhanced_Network_Anomaly_Detection_Based_on_Deep_Neural_Networks","322218531_Host_based_intrusion_detection_system_using_frequency_analysis_of_n-gram_terms","321738892_HAST-IDS_Learning_Hierarchical_Spatial-Temporal_Features_using_Deep_Neural_Networks_to_Improve_Intrusion_Detection","327146158_A_Multimodal_Deep_Learning_Method_for_Android_Malware_Detection_Using_Various_Features","325802231_A_Detailed_Investigation_and_Analysis_of_Using_Machine_Learning_Techniques_for_Intrusion_Detection","323595391_A_Bi-objective_Hyper-Heuristic_Support_Vector_Machines_for_Big_Data_Cyber-Security","322905134_Distributed_Privacy-Preserving_Collaborative_Intrusion_Detection_Systems_For_VANETs","322870768_Toward_Generating_a_New_Intrusion_Detection_Dataset_and_Intrusion_Traffic_Characterization","321846488_Ensemble_classifier_for_misuse_detection_using_N-gram_feature_vectors_through_operating_system_call_traces"]}