{"id":"332231937_Cognitive_Heterogeneity_of_Math_Difficulties_A_Bottom-up_Classification_Approach","abstract":"Math learning difficulties (MD) correspond to math achievement below the 25th percentile and are cognitively heterogeneous. It is not known precisely how cognitive mechanisms underlie distinct subtypes of MD. A bottom-up, cluster-analytic strategy, based on visuoconstructional, visuospatial and phonological working memory, and non-symbolic and symbolic magnitude processing accuracy, was used to form subgroups of children from 3rd to 5th grades according to their math achievement. All children had nonverbal intelligence above the 20th percentile and presented a broad spectrum of variation in math ability. External validity of subgroups was examined considering intelligence and math achievement. Groups did not differ in age. Two groups with a high incidence of MD were associated, respectively, with low visuospatial/visuoconstructional and low magnitude processing accuracy. One group with average cognitive performance also presented above average intelligence and a small incidence of MD. A fourth group with high cognitive performance presented high math performance and high intelligence. Phonological working memory was associated with high but not with low math achievement. MD may be related to complex patterns of associations and dissociations between intelligence and specific cognitive abilities in distinct subgroups. Consistency and stability of these subgroups must be further characterized. However, a bottom-up classification strategy contributes to reducing the cognitive complexity of MD.","authors":["Larissa Salvador","Ricardo Moura","Guilherme M de O. Wood","Vitor Geraldi Haase"],"meta":["April 2019Journal of Numerical Cognition 5(1):55-85","DOI:10.5964/jnc.v5i1.60"],"references":["315698680_Bringing_Back_the_Balance_Domain-General_Processes_Are_Also_Important_in_Numerical_Cognition","305644920_Numerosity_but_not_Texture-Density_Discrimination_Correlates_With_Math_Ability_in_Children","301620989_Mathematics_Anxiety_What_Have_We_Learned_in_60_Years","297662500_Significant_Inter-Test_Reliability_Across_Approximate_Number_System_Assessments","292643465_What_Is_Specific_and_What_Is_Shared_Between_Numbers_and_Words","321193995_Basic_numerical_competences_in_large-scale_assessment_data_Structure_and_long-term_relevance","320404229_Data-driven_heterogeneity_in_mathematical_learning_disabilities_based_on_the_triple_code_model","320042603_Developmental_trajectories_of_children's_symbolic_numerical_magnitude_processing_skills_and_associated_cognitive_competencies","301826273_Place-value_understanding_in_number_line_estimation_predicts_future_arithmetic_performance","298334125_Number-specific_and_general_cognitive_markers_of_preschoolers'_math_ability_profiles"]}