{"id":"332292593_Longest_Common_Substring_with_Approximately_k_Mismatches","abstract":"In the longest common substring problem, we are given two strings of length n and must find a substring of maximal length that occurs in both strings. It is well known that the problem can be solved in linear time, but the solution is not robust and can vary greatly when the input strings are changed even by one character. To circumvent this, Leimeister and Morgenstern introduced the problem of the longest common substring with k mismatches. Lately, this problem has received a lot of attention in the literature. In this paper, we first show a conditional lower bound based on the SETH hypothesis implying that there is little hope to improve existing solutions. We then introduce a new but closely related problem of the longest common substring with approximately k mismatches and use locality-sensitive hashing to show that it admits a solution with strongly subquadratic running time. We also apply these results to obtain a strongly subquadratic-time 2-approximation algorithm for the longest common substring with k mismatches problem and show conditional hardness of improving its approximation ratio.","authors":["Tatiana Starikovskaya","Jakub Radoszewski","Tomasz Kociumaka"],"meta":["April 2019Algorithmica 81(2)","DOI:10.1007/s00453-019-00548-x"],"references":["323276729_Linear-Time_Algorithm_for_Long_LCF_with_k_Mismatches","312627409_Sublinear_space_algorithms_for_the_longest_common_substring_problem","324577783_Algorithmic_Framework_for_Approximate_Matching_Under_Bounded_Edits_with_Applications_to_Sequence_Analysis","319770399_Approximate_nearest_neighbors_towards_removing_the_curse_of_dimensionality","319394814_Algorithms_on_strings_trees_and_sequences_computer_science_and_computational_biology","313903170_Parameterized_Algorithms","313744319_Color_set_size_problem_with_application_to_string_matching","308806447_Quadratic_Conditional_Lower_Bounds_for_String_Problems_and_Dynamic_Time_Warping","300080198_A_Provably_Efficient_Algorithm_for_the_k-Mismatch_Average_Common_Substring_Problem","280546196_More_Applications_of_the_Polynomial_Method_to_Algorithm_Design"]}