{"id":"332239770_Nested_Dilation_Networks_for_Brain_Tumor_Segmentation_Based_on_Magnetic_Resonance_Imaging","abstract":"Aim: Brain tumors are among the most fatal cancers worldwide. Diagnosing and manually segmenting tumors are time-consuming clinical tasks, and success strongly depends on the doctor's experience. Automatic quantitative analysis and accurate segmentation of brain tumors are greatly needed for cancer diagnosis.\nMethods:This paper presents an advanced three-dimensional multimodal segmentation algorithm called nested dilation networks (NDNs). It is inspired by the U-Net architecture, a convolutional neural network (CNN) developed for biomedical image segmentation and is modified to achieve better performance for brain tumor segmentation. Thus, we propose residual blocks nested with dilations (RnD) in the encoding part to enrich the low-level features and use squeeze-and-excitation (SE) blocks in both the encoding and decoding parts to boost significant features. To prove the reliability of the network structure, we compare our results with those of the standard U-Net and its transmutation networks. Different loss functions are considered to cope with class imbalance problems to maximize the brain tumor segmentation results. A cascade training strategy is employed to run NDNs for coarse-to-fine tumor segmentation. This strategy decomposes the multiclass segmentation problem into three binary segmentation problems and trains each task sequentially. Various augmentation techniques are utilized to increase the diversity of the data to avoid overfitting.\nResults: This approach achieves Dice similarity scores of 0.6652, 0.5880, and 0.6682 for edema, non-enhancing tumors, and enhancing tumors, respectively, in which the Dice loss is used for single-pass training. After cascade training, the Dice similarity scores rise to 0.7043, 0.5889, and 0.7206, respectively.\nConclusion: Experiments show that the proposed deep learning algorithm outperforms other U-Net transmutation networks for brain tumor segmentation. Moreover, applying cascade training to NDNs facilitates better performance than other methods. The findings of this study provide considerable insight into the automatic and accurate segmentation of brain tumors.","authors":["Liansheng Wang","Shuxin Wang","Rongzhen Chen","Xiaobo Qu"],"meta":["April 2019Frontiers in Neuroscience 13:285","DOI:10.3389/fnins.2019.00285"],"references":["330323409_Machine_Learning_Models_for_Multiparametric_Glioma_Grading_With_Quantitative_Result_Interpretations","328973442_Glioma_Grading_on_Conventional_MR_Images_A_Deep_Learning_Study_With_Transfer_Learning","328752197_Convolutional_Neural_Networks-Based_MRI_Image_Analysis_for_the_Alzheimer's_Disease_Prediction_From_Mild_Cognitive_Impairment","327703362_Brain_tumour_segmentation_using_U-Net_based_fully_convolutional_networks_and_extremely_randomized_trees","323471060_Brain_Tumor_Segmentation_and_Radiomics_Survival_Prediction_Contribution_to_the_BRATS_2017_Challenge","322651286_Brain_tumor_segmentation_in_multi-spectral_MRI_using_convolutional_neural_networks_CNN","328926979_Automatic_Brain_Tumor_Segmentation_using_Cascaded_Anisotropic_Convolutional_Neural_Networks","327370201_Brain_Tumor_Segmentation_and_Radiomics_Survival_Prediction_Contribution_to_the_BRATS_2017_Challenge","326566753_Focal_Loss_for_Dense_Object_Detection","324996175_Understanding_Convolution_for_Semantic_Segmentation"]}