{"id":"332296554_ViraMiner_Deep_Learning_on_Raw_DNA_Sequences_for_Identifying_Viral_Genomes_in_Human_Samples","abstract":"Despite its clinical importance, detection of highly divergent or yet unknown viruses is a major challenge. When human samples are sequenced, conventional alignments classify many assembled contigs as “unknown” since many of the sequences are not similar to known genomes. In this work, we developed ViraMiner, a deep learning-based method to identify viruses in various human biospecimens. ViraMiner contains two branches of Convolutional Neural Networks designed to detect both patterns and pattern-frequencies on raw metagenomics contigs. The training dataset included sequences obtained from 19 metagenomic experiments which were analyzed and labeled by BLAST. The model achieves significantly improved accuracy compared to other machine learning methods for viral genome classification. Using 300 bp contigs ViraMiner achieves 0.923 area under the ROC curve. To our knowledge, this is the first machine learning methodology that can detect the presence of viral sequences among raw metagenomic contigs from diverse human samples. We suggest that the proposed model captures different types of information of genome composition, and can be used as a recommendation system to further investigate sequences labeled as “unknown” by conventional alignment methods. Exploring these highly-divergent viruses, in turn, can enhance our knowledge of infectious causes of diseases.","authors":["Ardi Tampuu","Zurab Bzhalava","Joakim Dillner","Raul Vicente"],"meta":["April 2019","DOI:10.1101/602656"],"references":["327851798_Machine_Learning_for_detection_of_viral_sequences_in_human_metagenomic_datasets","326876672_MARVEL_a_Tool_for_Prediction_of_Bacteriophage_Sequences_in_Metagenomic_Bins","322610845_Extension_of_the_viral_ecology_in_humans_using_viral_profile_hidden_Markov_models","318252569_VirFinder_a_novel_k-mer_based_tool_for_identifying_viral_sequences_from_assembled_metagenomic_data","305746294_Deep_learning_for_computational_biology","304036022_SOAPdenovo2_an_empirically_improved_memory-efficient_short-read_de_novo_assembler","301831847_Basset_Learning_the_regulatory_code_of_the_accessible_genome_with_deep_convolutional_neural_networks","326381830_Massively_Parallel_Implementation_of_Sequence_Alignment_with_Basic_Local_Alignment_Search_Tool_Using_Parallel_Computing_in_Java_Library","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","303208584_Trinity_reconstructing_a_full-length_transcriptome_without_a_genome_from_RNA-Seq_data"]}