{"id":"332211506_Por_um_pensamento_informacional_ibero-americano","abstract":"A ciência da informação surgiu na década de 1960, nos Estados Unidos e na União Soviéti-ca. Profundamente marcada pelo contexto de seu surgimento, ela nasceu voltada para o estudo dos usos estratégicos da informação científica e tecno-lógica no contexto da competição geopolítica entre os dois países pela hegemonia mundial no fenôme-no que ficou conhecido como guerra fria. A ciência da informação estadunidense, particularmente, tornou-se referência mundial em termos de agenda de pesquisa em ciência da informação, desen-volvendo, ao longo dos anos, duas características. A primeira, sua forte ligação com a dimensão tec-nológica dos fenômenos informacionais, elegendo como interlocutora preferencial a área de ciência da computação. A segunda, sua inserção nos am-bientes empresariais, mantendo a mesma lógica de compreensão da informação numa perspectiva de uso estratégico para a competição. Na Europa, especialmente na Alemanha e nos países nórdicos, a área acolheu o nome \"library and information science\", mantendo um vínculo mais forte com a biblioteconomia. Nestes contex-tos, a ciência da informação permaneceu vincula-da a uma perspectiva mais humanista e centrou-se em estudos sobre organização do conhecimen-to, atuação de bibliotecas, arquivos e centros de documentação. A preocupação com os fluxos e o acesso à informação vinculou-se a uma perspecti-va culturalista e educacional. Já na Ibero-América, o ponto de partida para os estudos informacionais foi outro: as contradições, as exclusões, os vínculos entre informação e po-der, informação e democracia, direito à informa-ção. Ainda que essas questões estejam presentes em outras tradições do campo, foi aqui que elas ga-nharam centralidade, o que fez com que conceitos como cultura, memória e identidade estivessem na prioridade da agenda de pesquisa. A ciência da informação ibero-americana, assim, representa ao mesmo tempo um fortalecimento do acúmulo de conhecimentos sobre a informação (apropriando-se de conceitos e teorias estadunidenses e euro-peus, acrescentando a eles novos achados empíri-cos e análises) como, também, uma certa ruptura, ou, em outros termos, uma novidade, uma origina-lidade, uma contribuição singular. É deste âmbito, inclusive, que surgem propos-tas para compreender e atuar na realidade infor-macional contemporânea. Afinal, nos anos 1960, falava-se em uma \"explosão da informação\" e, naquele momento, os desafios eram o de fazer circular os documentos, dinamizar os fluxos, pro-mover formas de recuperar informação em meio ao crescimento documental. Nos anos 1980, fala-vase da necessidade de atender os usuários, cons-truir sistemas adequados para suas buscas. Hoje, tais questões não ocupam mais a centralidade da agenda.","authors":["Carlos Alberto Avila Araujo","Carlos Luis González-Valiente"],"meta":["April 2019","Project: Pensamiento informacional iberoamericano"],"references":[]}