{"id":"332238393_Evaluacion_experimental_de_la_solucion_analitica_exacta_de_la_ecuacion_de_Colebrook-White","abstract":"En el presente trabajo se diseñó y construyó un sistema hidráulico para la determinación experimental delfactor de fricción en una tubería de PVC bajo flujo turbulento. Este sistema permite conducir el agua por una tubería donde se midieron el caudal y la diferencia de presión para calcular la pérdida de carga entre dos puntos de control, considerando las propiedades asociadas a la tubería como es la rugosidad relativa, su diámetro y longitud. Utilizando la ecuación de Darcy-Weisbach se determinó el factor de fricción experimental. El objetivo del presente trabajo fue evaluar en forma experimental el factor de fricción y compararlo con el obtenido utilizando la fórmula n-ésima como aproximación de la solución exacta de la ecuación de Colebrook-White propuesta por Mikata y Walczak en 2015. La fórmula n-ésima predice el factor de fricción con un error relativo que tiende a disminuir dependiendo de la profundidad de la recursión. En nuestro análisis, para un valor de n igual a 15 el error en la determinación del factor de fricción reportó valores inferiores a 1E-16. Se desarrolló una macro de Excel en lenguaje VBA para evaluar la recursión dada la dificultad numérica de resolver el valor analítico exacto de la ecuación de Colebrook-White. La originalidad del presente trabajo corresponde a la evaluación de la fórmula n-ésima del factor de fricción y su comparación con los resultados experimentales obtenidos en el laboratorio, lo que permite probar la validez de la predicción de la fórmula con un caso real. Esto permitió encontrar el error relativo porcentual respecto al valor experimental.","authors":["Alan Paulo Olivares Gallardo","Rodrigo Guerra","Marco Antonio Alfaro Guerra"],"meta":["April 2019Ingeniería Investigación y Tecnología 20(2):1-11","DOI:10.22201/fi.25940732e.2019.20n2.021"],"references":["319739072_Solution_of_the_Implicit_Colebrook_Equation_for_Flow_Friction_Using_Excel","315904900_New_approximations_to_the_principal_real-valued_branch_of_the_Lambert_W-function","290361220_Pipe_Sizing_of_District_Cooling_Distribution_Network_Using_Implicit_Colebrook-White_Equation","283993267_A_new_explicit_equation_for_the_friction_coefficient_in_the_Darcy-Weisbach_equation_Proceedings_of_the_Tenth_Conference_on_Protection_and_Restoration_of_the_Environment_PRE10_July_6-9_2010","326120610_Solution_of_the_Implicit_Colebrook_Equation_for_Flow_Friction_Using_Excel","319424287_Closure_to_Exact_Analytical_Solutions_of_the_Colebrook-White_Equation_by_Yozo_Mikata_and_Walter_S_Walczak","317295815_Prediction_of_the_friction_factor_in_pipes_using_model_tree","284050144_Hydraulic_Resistance_in_Pipes","282418948_Exact_Analytical_Solutions_of_the_Colebrook-White_Equation","279541373_Calculating_friction_in_one_step"]}