{"id":"332224272_Modelisation_de_praxeologies_personnelles_a_priori_dans_une_situation_de_conception_experimentale_en_biologie","abstract":"Abstract. The study consists in modelling errors in a biology situation implemented in a TEL system. The inquiry-based learning is used in this activity. We introduce the personal praxeology to model errors a priori in this situation. The model has been tested with student's work in high school classes in France. This modelling work is necessary in order to improve the platform in a future work, which consists in implementing an automatic diagnosis of error. \n\nResumen. El estudio se centra en modelar el error en una situación de biología diseñada en un entorno informático para el aprendizaje humano y proponer una actividad que incluya el proceso de investigación. Esto da lugar a un modelo de praxeologías personales a priori, puesto a prueba por el análisis de las producciones de los estudiantes de secundaria en Francia. Este modelado, innovador en biología, participará en la segunda etapa de la evolución de la plataforma hacia el establecimiento de un diagnóstico automático de errores. \n\nRésumé. L'étude porte sur une modélisation de l'erreur dans une situation de biologie conçue dans un environnement informatique pour l'apprentissage humain et qui propose une activité incluant la démarche d'investigation. Cela se traduit par une modélisation de praxéologies personnelles a priori, mises à l'épreuve par l'analyse de productions d'élèves au lycée en France. Cette modélisation, novatrice en biologie, participera dans un second temps à l'évolution de la plateforme vers la mise en place d'un diagnostic automatique des erreurs.","authors":["Catherine Bonnat"],"meta":["April 2019","Conference: 6ème Congrès International de la Théorie Anthropologique du DidactiqueAt: Autrans, France"],"references":["333737787_La_notion_de_variable_dans_le_modele_praxeologique","326467103_Une_reponse_a_la_prise_en_compte_de_l'apprenant_dans_la_TAD_la_praxeologie_personnelle","320083168_LabBook_a_web_environment_for_active_science_learning","318587852_Etayage_de_l'activite_de_conception_experimentale_par_un_EIAH_pour_apprendre_la_notion_de_metabolisme_cellulaire_en_terminale_scientifique_Specialite_CIA_-Ingenierie_de_la_Cognition_de_l'interaction_d","279258616_Utilisation_du_modele_praxeologique_de_reference_dans_un_EIAH","248942283_Design_and_Reflection_Help_Students_Develop_Scientific_Abilities_Learning_in_Introductory_Physics_Laboratories","27616982_Le_fonctionnement_intellectuel_d'etudiants_realisant_des_experiences_observation_de_seances_de_travaux_pratiques_en_premier_cycle_universitaire_scientifique"]}