{"id":"332309499_Thermodynamic_Modeling_of_Calcium_Sulfate_Hydrates_in_the_CaSO_4_-H_2_O_System_from_27315_to_47315_K_with_Extension_to_54815_K","abstract":"Calcium sulfate is one of the most common inorganic salts with a high scaling potential. The solubility of calcium sulfate was modeled with the Pitzer equation at a temperature range from 273.15 to 473.15 K from published solubility data, which was critically evaluated. Only two Pitzer parameters, β⁽¹⁾ and β⁽²⁾, with simple temperature dependency are required to model the solubility with excellent extrapolating capabilities up to 548.15 K. The stable temperature range for gypsum is 273.15–315.95 K, whereas above 315.95 K the stable phase is anhydrite. Hemihydrate is in the metastable phase in the whole temperature range, and the obtained metastable invariant temperature from gypsum to hemihydrate is 374.55 K. The obtained enthalpy and entropy changes at 298.15 K for the solubility reactions are in good agreement with literature values yielding solubility products of 2.40 × 10–05, 3.22 × 10–05, and 8.75 × 10–05 for gypsum, anhydrite, and hemihydrate, respectively. The obtained Pitzer model for the CaSO4–H2O system is capable of predicting the independent activity and osmotic coefficient data with experimental accuracy. The mean absolute average error of activity coefficient data at 298.15 K is less than 2.2%. Our model predicts the osmotic coefficient on the ice curve within 1.5% maximum error.","authors":["Leiting Shen","Hannu Sippola","Xiao-bin Li","Daniel K Lindberg"],"meta":["April 2019Journal of Chemical & Engineering Data 64(6):2697-2709","DOI:10.1021/acs.jced.9b00112","Projects: Protocol development for evaluation of water-saving alternatives in minerals processingAqueous thermodynamicsThermodynamic Modelling of Aqueous Solutions"],"references":["326659958_Activity_of_Supercooled_Water_on_the_Ice_Curve_and_Other_Thermodynamic_Properties_of_Liquid_Water_up_to_the_Boiling_Point_at_Standard_Pressure","325459625_Temperature_Dependence_of_Mineral_Solubility_in_Water_Part_3_Alkaline_and_Alkaline_Earth_Sulfates","316817360_Scheelite_conversion_in_sulfuric_acid_together_with_tungsten_extraction_by_ammonium_carbonate_solution","292268727_Untersuchungen_uber_die_calcium_sulfate","291784164_The_solubilities_conductivities_and_X-ray_analyses_of_anhydrous_and_semihydrated_calcium_sulphate","286821876_Chemical_modeling_of_calcium_sulphate_solubility_in_hydrometallurgical_process_solutions","286013512_Thermodynamics_of_concentrated_aqueous_solution_of_NiSO4","285348888_The_Gypsum-Anhydrite_Equilibrium_at_One_Atmosphere_Pressure","285223440_Solubilities_-_Inorganic_and_Metal-Organic_Compounds","284590345_Anhydrite-gypsum_equilibrium_relations"]}