{"id":"332326063_INTELIGENCIA_ARTIFICIAL_E_DIREITOS_DA_PERSONALIDADE_UMA_CONTRADICAO_EM_TERMOS_ARTIFICIAL_INTELLIGENCE_AND_PERSONALITY_RIGHTS_A_CONTRADICTION_IN_TERMS","abstract":"Resumo: A inteligência artificial surgiu concomitantemente com a eletrônica e a ciência da computação na década de 1950. Tem sido aplicada cada vez mais em diversas áreas e potencializou-se com a maior capacidade de armazenamento e tráfego de dados pela Internet. Todavia, especialmente em 2018, ampliou-se a percepção da sociedade para os efeitos positivos e negativos do emprego dessa tecnologia, do ponto de vista não apenas político, mas também dos direitos da personalidade, sobretudo o direito à privacidade. Neste artigo, faz-se a apresentação da inteligência artificial, os problemas que esta pode causar às pessoas e os desafios dos direitos da personalidade na defesa da dignidade humana. Palavras-chave: Inteligência artificial. Direitos da personalidade. Direito à privacidade. Internet. Controle social. Abstract: Artificial intelligence has developed concomitant with electronics and computer science since the 1950s. It has been increasingly applied in the most diverse areas, enhanced due to the huge capacity of data storage and traffic over the Internet. However, in 2018, society's perception of the positive and negative effects of the use of artificial intelligence, not only from a political point of view, but also from the personality rights, especially the right to privacy, was broadened. In this paper, the author made a presentation of artificial intelligence, the problems that it can cause to the people and the challenges of the rights of the personality in the defense of the human dignity. Introdução Do ponto de vista cultural, a modernidade corresponde ao período histórico de aproximadamente duzentos anos, que se iniciou no século XVIII com o Iluminismo, o liberalismo econômico, a Revolução Industrial e as Revoluções políticas decorrentes da crise do Antigo Regime. O marco final desse período é a Segunda Guerra Mundial, com a conscientização de que nem sempre a humanidade evolui em termos de relacionamentos * Professor Associado do","authors":["Eduardo Tomasevicius Filho"],"meta":["April 2019Revista da Faculdade de Direito Universidade de São Paulo 113:133-149","DOI:10.11606/issn.2318-8235.v113i0p133-149","Project: Artificial Intelligence and Private Law"],"references":["330500758_A_natureza_juridica_do_software_a_luz_da_linguistica","323302750_The_Malicious_Use_of_Artificial_Intelligence_Forecasting_Prevention_and_Mitigation","332170173_Privacy_and_Freedom","319394978_Artificial_Intelligence_---_A_Modern_Approach","242629864_Speculation_on_the_relation_of_the_computer_to_individual_freedom_and_the_right_to_privacy","238977455_Privacy_as_an_aspect_of_human_dignity_An_answer_to_Dean_Prosser","2552293_Programs_with_Common_Sense"]}