{"id":"332338713_Towards_Designing_Tools_for_Universities'_RD_Performance_Measurement_on_Mobile_Platform","abstract":"p class=\"Abstract\">At the moment, there is a great interest in most universities to achieve higher ranking for better international standings and visibility. With shrinking resources such as financial and infrastructures, there is also a huge demand for the university to move forward and perform better in Research and Development (R&D) in each evaluation year. Key Performance Indicator (KPI) is an excellent tool to enculturate research in a Higher Education Institution (HEI). The culture must be built upon HEI’s strength and weaknesses. Hence, the right decision making tool must be develop to priorities different agendas such as QSWUR, THE, etc. Mobile platform provide an efficient way to engage with stakeholders particularly to measure HEI performance on R&D. There are three main activities involves for developing a decision support tool for measuring R&D impact in HEIs i.e. development of decision model using multi criteria decision making, dashboard prototype development including and UI/UX for mobile platform. This paper describe the importance of measuring the impact of R&D, prioritization technique and the process of prototype development. It is anticipates that our work could mitigate the gaps and improve the research ecosystem in HEIs.</p","authors":["Mohd Faizal Omar","Siti RASIFAH Ahmad Roshidi","Jastini Mohd Jamil","Fazillah Kamal"],"meta":["April 2019International Journal of Interactive Mobile Technologies (iJIM) 13(04):178","DOI:10.3991/ijim.v13i04.10547"],"references":["328806954_CHALLENGES_AND_EVOLUTION_OF_HIGHER_EDUCATION_IN_MALAYSIA","311918154_Measuring_the_Efficiency_of_Public_Universities_Using_Data_Envelopment_Analysis_DEA_to_Examine_Public_Universities_in_Saudi_Arabia","311808590_PRIORITIZATION_OF_PERFORMANCE_MEASURES_USING_ANALYTIC_HIERARCHY_PROCESS","299574836_Accidents_Preventive_Practice_for_High-Rise_Construction","281206950_Decision_support_evaluation_for_building_information_modeling_software_selection","327283683_MEASURING_PERFORMANCE_OF_UNIVERSITIES_IN_FRAGILE_COUNTRIES_USING_ANALYTIC_HIERARCHY_PROCESS","318727085_Globalisation_and_the_university_Myths_and_realities_in_an_unequal_world","313417200_What_Counts_for_Academic_Productivity_in_Research_Universities","286181004_Selection_of_Robotic_Grippers_Under_MCDM_Environment_An_Optimized_Trade_Off_Technique","281895814_Performance_Analysis_and_Prediction_in_Educational_Data_Mining_A_Research_Travelogue"]}