{"id":"332339812_Graph_Networks_as_a_Universal_Machine_Learning_Framework_for_Molecules_and_Crystals","abstract":"Graph networks are a new machine learning (ML) paradigm that supports both relational reasoning and combinatorial generalization. Here, we develop universal MatErials Graph Network (MEGNet) models for accurate property prediction in both molecules and crystals. We demonstrate that the MEGNet models outperform prior ML models such as the SchNet in 11 out of 13 properties of the QM9 molecule data set. Similarly, we show that MEGNet models trained on 60,000 crystals in the Materials Project substantially outperform prior ML models in the prediction of the formation energies, band gaps and elastic moduli of crystals, achieving better than DFT accuracy over a much larger data set. We present two new strategies to address data limitations common in materials science and chemistry. First, we demonstrate a physically-intuitive approach to unify four separate molecular MEGNet models for the internal energy at 0 K and room temperature, enthalpy and Gibbs free energy into a single free energy MEGNet model by incorporating the temperature, pressure and entropy as global state inputs. Second, we show that the learned element embeddings in MEGNet models encode periodic chemical trends and can be transfer-learned from a property model trained on a larger data set (formation energies) to improve property models with smaller amounts of data (band gaps and elastic moduli).","authors":["Chi Chen","Weike Ye","Yunxing Zuo","Chen Zheng"],"meta":["April 2019Chemistry of Materials 31(9)","DOI:10.1021/acs.chemmater.9b01294"],"references":["326608140_Machine_learning_for_molecular_and_materials_science","326004751_Learning_atoms_for_materials_discovery","324101624_SchNet_-_A_deep_learning_architecture_for_molecules_and_materials","321604637_Deep_Neural_Networks_for_Accurate_Predictions_of_Crystal_Stability","332245308_Machine_learning_unifies_the_modeling_of_materials_and_molecules","328885370_Feature_Optimization_for_Atomistic_Machine_Learning_Yields_a_Data-Driven_Construction_of_the_Periodic_Table_of_the_Elements","328774878_Hierarchical_visualization_of_materials_space_with_graph_convolutional_neural_networks","326430618_Machine_Learning_Directed_Search_for_Ultraincompressible_Superhard_Materials","323274120_Mining_Unexplored_Chemistries_for_Phosphors_for_High-Color-Quality_White-Light-Emitting_Diodes","321840798_Discovery_of_Intermetallic_Compounds_from_Traditional_to_Machine-Learning_Approaches"]}