{"id":"332352919_Eikonal-based_models_of_random_tessellations","abstract":"In this article, we propose a novel, efficient method for computing a random tessellation from its vectorial representation at each voxel of a discretized domain. This method is based upon the resolution of the Eikonal equation and has a complexity in O(N log N), N being the number of voxels used to discretize the domain. By contrast, evaluating the implicit functions of the vectorial representation at each voxel location has a complexity of O(N²) in the general case. The method also enables us to consider the generation of tessellations with rough interfaces between cells by simulating the growth of the germs on a domain where the velocity varies locally. This aspect constitutes the main contribution of the article. A final contribution is the development of an algorithm for estimating the multi-scale tortuosity of the boundaries of the tessellation cells. The algorithm computes the tortuosity of the boundary at several scales by iteratively deforming the boundary until it becomes a straight line. Using this algorithm, we demonstrate that depending on the local velocity model, it is possible to control the roughness amplitude of the cells boundaries.","authors":["Bruno Figliuzzi"],"meta":["April 2019Image Analysis and Stereology 38(1):15","DOI:10.5566/ias.2061"],"references":["326283597_Morphological_modeling_of_cold_spray_coatings","295120696_Modelling_the_microstructure_and_the_viscoelastic_behaviour_of_carbon_black_filled_rubber_materials_from_3D_simulations","278619568_A_Fourier-based_numerical_homogenization_tool_for_an_explosive_material","324958620_New_parameterizations_for_Bayesian_seismic_tomography","320053750_Computational_material_design_of_filled_rubbers_using_multi-objective_design_exploration","305978989_Random_tessellations_in_Rd","305977186_Random_Johnson-Mehl_tessellations","287792768_Boolean_Random_Functions","285398816_3D_Images_of_Materials_Structures_Processing_and_Analysis","281143288_Modelling_mesoporous_alumina_microstructure_with_3D_random_models_of_platelets"]}