{"id":"332312961_GOVERNANCA_E_PLANEJAMENTO_DE_TECNOLOGIA_DA_INFORMACAO_UM_ESTUDO_EXPLORATORIO_DA_PRODUCAO_STRICTO_SENSU_NO_BRASIL_ENTRE_1995_e_2014","abstract":"O objetivo desta pesquisa é o de explorar a produção científica no Brasil sobre a temática governança e planejamento de TI, a partir das dissertações e teses publicadas no país provenientes de cursos de pós-graduação stricto sensu, no período de 1995 a 2014. Esta temática se destacou em 2012 como uma das maiores preocupações da gestão nas organizações no mundo segundo a ‘Society for Information Management’. É realizada uma pesquisa descritiva documental com a utilização da bibliometria, tendo como base de dados à plataforma CNPq Lattes. Foram identificados 263 trabalhos, sendo 34 (D), 160 (ME) e 69 (MP). Com 259 egressos, 104 programas em 67 diferentes IES e 176 orientadores, mais da metade dos trabalhos são oriundos de programas de excelente qualidade (sem MP). Maioria das instituições e pesquisadores, igualmente participando em congressos científicos específicos refletindo avanço na área. IES particulares sem fins lucrativos, o Sudeste, o estado de São Paulo, a Universidade Católica de Brasília (UCB) e João Souza Neto foram os mais profícuos. A temática analisada tem sido assunto de interesse de pesquisa, notadamente pelo pleno crescimento no decorrer do período analisado, com destaque para o ano 2012 e categoria temática governança de TI. Metade dos estudos tem sido realizada na área da Administração, Ciências Contábeis e Turismo, mas também se verificou a ocorrência de trabalhos nas áreas: Engenharias III, Interdisciplinar, Ciência da Computação e Engenharias IV, entre outras, de um total de dez das 48 áreas de avaliação da CAPES.","authors":["Fábio Luís Falchi de Magalhães","Fabio Kazuo Ohashi","Lidiane Silva","Marcos Antonio Gaspar"],"meta":["April 2018","DOI:10.22277/rgo.v10i1.3306"],"references":["326503212_Estudo_do_Impacto_da_Governanca_de_Tecnologia_da_Informacao_no_Desempenho_das_Empresas_Brasileiras_uma_Analise_a_partir_da_Perspectiva_dos_Executivos_Usuarios_e_Membros_de_Equipes_de_TI","312176006_Uma_Visao_sobre_a_Pesquisa_Academica_em_SI_no_Brasil_1994_a_2013","307445481_Governanca_de_Tecnologia_da_Informacao_Uma_Analise_do_Nivel_de_Maturidade_em_Empresas_Atuantes_no_Brasil","304019395_Company_Divestment_-_Applicability_of_existing_IT_Governance_Frameworks","303276436_Successful_IT_governance_in_SMES_An_application_of_the_Technology-Organisation-Environment_theory","302548838_Governanca_de_tecnologia_da_informacao_uma_investigacao_sobre_a_representacao_do_conceito","284094098_Governance_and_Assessment_Insights_in_Information_Technology_the_Val_IT_Model","283706644_PERFIL_DE_PRODUCAO_ACADEMICA_DOS_PROGRAMAS_BRASILEIROS_DE_POS-GRADUACAO_EM_CIENCIA_DA_INFORMACAO_2008-2012","282893445_Enhancing_the_measurement_of_information_technology_IT_business_alignment_and_its_influence_on_company_performance","281464015_O_que_e_bibliometria_Uma_introducao_ao_Forum"]}