{"id":"332394570_Taxonomy_of_Memory_Usage_in_Swarm_Intelligence-Based_Metaheuristics","abstract":"Metaheuristics under the swarm intelligence (SI) class have proven to be efficient and have become popular methods for solving different optimization problems. Based on the usage of memory, metaheuristics can be classified into algorithms with memory and without memory (memory-less). The absence of memory in some metaheuristics will lead to the loss of the information gained in previous iterations. The metaheuristics tend to divert from promising areas of solutions search spaces which will lead to non-optimal solutions. This paper aims to review memory usage and its effect on the performance of the main SI-based metaheuristics. Investigation has been performed on SI metaheuristics, memory usage and memory-less metaheuristics, memory characteristics and memory in SI-based metaheuristics. The latest information and references have been further analyzed to extract key information and mapped into respective subsections. A total of 50 references related to memory usage studies from 2003 to 2018 have been investigated and show that the usage of memory is extremely necessary to increase effectiveness of metaheuristics by taking the advantages from their previous successful experiences. Therefore, in advanced metaheuristics, memory is considered as one of the fundamental elements of an efficient metaheuristic. Issues in memory usage have also been highlighted. The results of this review are beneficial to the researchers in developing efficient metaheuristics, by taking into consideration the usage of memory.","authors":["Shaymah Akram Yasear","Ku Ruhana Ku-Mahamud"],"meta":["March 2019Baghdad Science Journal 16(2):0445","DOI:10.21123/bsj.2019.16.2(SI).0445"],"references":["324943993_Application_of_Hybrid_Meta-Heuristic_Techniques_for_Optimal_Load_Shedding_Planning_and_Operation_in_an_Islanded_Distribution_Network_Integrated_with_Distributed_Generation","324532717_Metaheuristics_for_Maritime_Operations","323465713_Recent_Research_Trends_in_Genetic_Algorithm_Based_Flexible_Job_Shop_Scheduling_Problems","319631096_A_Modified_Mean_Gray_Wolf_Optimization_Approach_for_Benchmark_and_Biomedical_Problems","327530523_Decision_Sciences_Theory_and_Practice","322168873_Advanced_Optimization_by_Nature-Inspired_Algorithms","322058709_Nature_Inspired_Methods_and_Their_Industry_Applications_-_Swarm_Intelligence_Algorithms","320182358_The_Origin_of_Species","319974643_Ensemble_of_differential_evolution_variants","318674598_Salp_Swarm_Algorithm_A_bio-inspired_optimizer_for_engineering_design_problems"]}