{"id":"332388436_Toward_understanding_the_impact_of_artificial_intelligence_on_labor","abstract":"Rapid advances in artificial intelligence (AI) and automation technologies have the potential to significantly disrupt labor markets. While AI and automation can augment the productivity of some workers, they can replace the work done by others and will likely transform almost all occupations at least to some degree. Rising automation is happening in a period of growing economic inequality, raising fears of mass technological unemployment and a renewed call for policy efforts to address the consequences of technological change. In this paper we discuss the barriers that inhibit scientists from measuring the effects of AI and automation on the future of work. These barriers include the lack of high-quality data about the nature of work (e.g., the dynamic requirements of occupations), lack of empirically informed models of key microlevel processes (e.g., skill substitution and human–machine complementarity), and insufficient understanding of how cognitive technologies interact with broader economic dynamics and institutional mechanisms (e.g., urban migration and international trade policy). Overcoming these barriers requires improvements in the longitudinal and spatial resolution of data, as well as refinements to data on workplace skills. These improvements will enable multidisciplinary research to quantitatively monitor and predict the complex evolution of work in tandem with technological progress. Finally, given the fundamental uncertainty in predicting technological change, we recommend developing a decision framework that focuses on resilience to unexpected scenarios in addition to general equilibrium behavior.","authors":["Morgan R. Frank","David Autor","James Bessen","Erik Brynjolfsson"],"meta":["April 2019Proceedings of the National Academy of Sciences 116(14):6531-6539","DOI:10.1073/pnas.1900949116"],"references":["328430612_The_k-core_as_a_predictor_of_structural_collapse_in_mutualistic_ecosystems","326486266_Unpacking_the_polarization_of_workplace_skills","335242537_A_New_Model_for_Industry-Academic_Partnerships","333891223_The_Race_between_Education_and_Technology","333047261_Work_of_the_Past_Work_of_the_Future","325306240_What_Can_Machines_Learn_and_What_Does_It_Mean_for_Occupations_and_the_Economy","322210221_Skill_Requirements_across_Firms_and_Labor_Markets_Evidence_from_Job_Postings_for_Professionals","321991370_What_can_machine_learning_do_Workforce_implications","321790548_AI_and_Jobs_The_Role_of_Demand","318004023_Robots_and_Jobs_Evidence_from_US_Labor_Markets"]}