{"id":"332359016_Eye-tracking_for_assessing_medical_image_interpretation_A_pilot_feasibility_study_comparing_novice_vs_expert_cardiologists","abstract":"Introduction\nAs specialized medical professionals such as radiologists, pathologists, and cardiologists gain education and experience, their diagnostic efficiency and accuracy change, and they show altered eye movement patterns during medical image interpretation. Existing research in this area is limited to interpretation of static medical images, such as digitized whole slide biopsies, making it difficult to understand how expertise development might manifest during dynamic image interpretation, such as with angiograms or volumetric scans.\n\nMethods\nA two-group (novice, expert) comparative pilot study examined the feasibility and utility of tracking and interpreting eye movement patterns while cardiologists viewed video-based coronary angiograms. A non-invasive eye tracking system recorded cardiologists’ (n = 8) visual behaviour while they viewed and diagnosed a series of eight angiogram videos. Analyses assessed frame-by-frame video navigation behaviour, eye fixation behaviour, and resulting diagnostic decision making.\n\nResults\nRelative to novices, expert cardiologists demonstrated shorter and less variable video review times, fewer eye fixations and saccadic eye movements, and less time spent paused on individual video frames. Novices showed repeated eye fixations on critical image frames and regions, though these were not predictive of accurate diagnostic decisions.\n\nDiscussion\nThese preliminary results demonstrate interpretive decision errors among novices, suggesting they identify and process critical diagnostic features, but sometimes fail to accurately interpret those features. Results also showcase the feasibility of tracking and understanding eye movements during video-based coronary angiogram interpretation and suggest that eye tracking may be valuable for informing assessments of competency progression during medical education and training.","authors":["Tad T Brunyé","Brahmajee K. Nallamothu","Joann G Elmore"],"meta":["April 2019Perspectives on Medical Education 8(2)","DOI:10.1007/s40037-019-0505-6"],"references":["311469386_Heart_disease_and_stroke_statistics-2015_update_a_report_from_the_American_Heart_Association","307944473_Gaze_behavior_during_curb_approach_The_effect_of_mobile_device_use_while_walking","302979036_Language_and_memory_for_object_location","330762496_A_Survey_on_Video_Summarization_Techniques","317340000_Effects_of_eye_movement_modeling_examples_on_adaptive_expertise_in_medical_image_diagnosis","312257113_Accuracy_is_in_the_Eyes_of_the_Pathologist_The_Visual_Interpretive_Process_and_Diagnostic_Accuracy_with_Digital_Whole_Slide_Images","308522601_Eye_tracking_to_investigate_cue_processing_in_medical_decision_makingA_scoping_review","307632600_Writing_Group_Members_American_Heart_Association_Statistics_Committee_Stroke_Statistics_Subcommittee_Heart_disease_and_stroke_statistics-2016_update_A_report_from_the_American_Heart_Association","303541499_Decoupling_Light_Reflex_from_Pupillary_Dilation_to_Measure_Emotional_Arousal_in_Videos","303018781_Heart_Disease_and_Stroke_Statistics-2015_Update_A_Report_from_the_American_Heart_Association"]}