{"id":"332434278_Feedback_In_The_Educational_Process_Experience_Of_Using_Byod-Technology","abstract":"Formulating of the problem. Feedback in pedagogy is an integral part of the educational process. Due to feedback in the learning process, the teacher's activity is integrated with the student's activities. A well-known way of feedback is the questioning. However, oral questioning requires a significant part of the class-time, written questioning requires extra time to check answers. Computer testing requires the availability of a local software and also restricts the location of the classes. The novel information technologies allow for personalized feedback in the learning process. BYOD (Bring Your Own Device) is a technology of using your own devices. Using of \"cloud\" technologies, on the one hand, provides access to a training facility from an arbitrary location, on the other hand, allows the teacher analyse quickly the individual growth of each student, or to generalize it for groups of students.\nMaterials and methods. Devices brought by students (BYOD) and \"cloud\" survey service from google. The coefficient of complexity, the coefficient of discrimination of the test task, the coefficient of correlation of the results of the answer to the test task and the overall test result were determined.\nResults. Using BYOD and the cloud google-form service reduced the time for student surveys to 3-5 minutes and increased of interest in computer science. Imperfect test tasks were replaced immediately after detection. The impact of changes was checked in the following groups.\nConclusions. The combination of BYOD technology with \"cloud\" technologies creates opportunities for flexible feedback with students during the training, increasing their interest in using modern information technology. The ultimate goal of introducing such an element of learning is to increase the efficiency of students' acquisition of theoretical and practical course material.","authors":["Maria A. Ivanchuk","Victor Kulchynsky"],"meta":["April 2019","DOI:10.31110/2413-1571-2019-019-1-010","Project: Teaching Medical Informatics"],"references":[]}