{"id":"332423028_A_Chaotic_Electromagnetic_Field_Optimization_Algorithm_Based_on_Fuzzy_Entropy_for_Multilevel_Thresholding_Color_Image_Segmentation","abstract":"Multilevel thresholding segmentation of color images is an important technology in various applications which has received more attention in recent years. The process of determining the optimal threshold values in the case of traditional methods is time-consuming. In order to mitigate the above problem, meta-heuristic algorithms have been employed in this field for searching the optima during the past few years. In this paper, an effective technique of Electromagnetic Field Optimization (EFO) algorithm based on a fuzzy entropy criterion is proposed, and in addition, a novel chaotic strategy is embedded into EFO to develop a new algorithm named CEFO. To evaluate the robustness of the proposed algorithm, other competitive algorithms such as Artificial Bee Colony (ABC), Bat Algorithm (BA), Wind Driven Optimization (WDO), and Bird Swarm Algorithm (BSA) are compared using fuzzy entropy as the fitness function. Furthermore, the proposed segmentation method is also compared with the most widely used approaches of Otsu's variance and Kapur's entropy to verify its segmentation accuracy and efficiency. Experiments are conducted on ten Berkeley benchmark images and the simulation results are presented in terms of peak signal to noise ratio (PSNR), mean structural similarity (MSSIM), feature similarity (FSIM), and computational time (CPU Time) at different threshold levels of 4, 6, 8, and 10 for each test image. A series of experiments can significantly demonstrate the superior performance of the proposed technique, which can deal with multilevel thresholding color image segmentation excellently.","authors":["Suhang Song","Heming Jia","Benedict Jun Ma"],"meta":["April 2019Entropy 21(4):398","DOI:10.3390/e21040398","Project: intelligent optimization algorithm for multilevel color image segmentation problem"],"references":["332138212_Multilevel_Thresholding_Segmentation_for_Color_Image_Using_Modified_Moth-Flame_Optimization","330300899_Modified_Grasshopper_Algorithm_Based_Multilevel_Thresholding_for_Color_Image_Segmentation","327409902_A_new_heuristic_for_multilevel_thresholding_of_images","327129539_Extracting_tumor_in_MR_brain_and_breast_image_with_Kapur's_entropy_based_Cuckoo_Search_Optimization_and_morphological_reconstruction_filters","326872990_Optimal_Multilevel_Thresholding_Selection_for_Brain_MRI_Image_Segmentation_based_on_Adaptive_Wind_Driven_Optimization","326454126_Sensitive_Association_Rules_Hiding_Using_Electromagnetic_Field_Optimization_Algorithm","324934107_Edge-based_target_detection_for_unmanned_aerial_vehicles_using_competitive_Bird_Swarm_Algorithm","321369430_Visual_tracking_using_improved_flower_pollination_algorithm","317623198_An_optimal_Color_Image_Multilevel_Thresholding_Technique_using_Grey-Level_Co-occurrence_Matrix","316369856_Whale_Optimization_Algorithm_and_Moth-Flame_Optimization_for_Multilevel_Thresholding_Image_Segmentation"]}