{"id":"332414443_Current_knowledge_and_future_research_opportunities_for_modeling_annual_crop_mixtures_A_review","abstract":"Growing mixtures of annual arable crop species or genotypes is a promising way to improve crop production without increasing agricultural inputs. To design optimal crop mixtures, choices of species, genotypes, sowing proportion, plant arrangement, and sowing date need to be made but field experiments alone are not sufficient to explore such a large range of factors. Crop modeling allows to study, understand, and ultimately design cropping systems and is an established method for sole crops. Recently, modeling started to be applied to annual crop mixtures as well. Here, we review to what extent crop simulation models and individual-based models are suitable to capture and predict the specificities of annual crop mixtures. We argued that (1) the crop mixture spatio-temporal heterogeneity (influencing the occurrence of ecological processes) determines the choice of the model-ing approach (plant or crop centered). (2) Only few crop models (adapted from sole crop models) and individual-based models currently exist to simulate annual crop mixtures. Crop models are mainly used to address issues related to both crop mixtures management and the integration of crop mixtures into larger scales such as the rotation. In contrast, individual-based models are mainly used to identify plant traits involved in crop mixture performance and to quantify the relative contribution of the different ecological processes (niche complementarity, facilitation, competition, plasticity) to crop mixture functioning. This review highlights that modeling of annual crop mixtures is in its infancy and gives to model users some important keys to choose the model based on the questions they want to answer, with awareness of the strengths and weaknesses of each of the modeling approaches.","authors":["Noémie Gaudio","Abraham J Escobar-Gutiérrez","Pierre Casadebaig","Jochem B Evers"],"meta":["April 2019Agronomy for Sustainable Development 39:20","DOI:10.1007/s13593-019-0562-6.","Projects: ReMIX EU Intercrops - web site: https://www.remix-intercrops.euIndividual-based modelling of multi-species grasslandsIntercropping as a way of agroecology to enhance the production in low input arable cropping systems and organic farming"],"references":["329410685_Role_of_Modelling_in_International_Crop_Research_Overview_and_Some_Case_Studies","327644991_A_generic_individual-based_model_can_predict_yield_nitrogen_content_and_species_abundance_in_experimental_grassland_communities","327209563_Genetic_and_environmental_dissection_of_biomass_accumulation_in_multi-genotype_maize_canopies","341773445_The_Agricultural_Model_Intercomparison_and_Improvement_Project_AgMIP_Protocols_and_pilot_studies","329591071_Investigation_of_complex_canopies_with_a_functional-structural_plant_model_as_exemplified_by_leaf_inclination_effect_on_the_functioning_of_pure_and_mixed_stands_of_wheat_during_grain_filling","327346312_Understanding_and_optimizing_species_mixtures_using_functional-structural_plant_modelling","326550871_Simulating_plant_water_stress_dynamics_in_a_wide_range_of_bi-specific_agrosystems_in_a_region_using_the_BISWAT_model","325357443_Ecology_for_Sustainable_and_Multifunctional_Agriculture","325307075_Modelling_crops_and_cropping_systems-Evolving_purpose_practice_and_prospects","325084175_Computational_botany_Advancing_plant_science_through_functional-structural_plant_modelling"]}