{"id":"332452088_Performance_analysis_of_bi-directional_relay_selection_strategy_for_wireless_cooperative_communications","abstract":"This paper proposes a new two-way double-relay selection strategy for wireless cooperative communication systems with its bit error rate (BER) performance analysis. In this work, two relays are first chosen to maximize the overall system performance in terms of BER. Then, either the two-phase or three-phase protocol is performed to achieve two-directional communications between the communicating terminals through the selected relay nodes that apply orthogonal space-time coding (STC) scheme in a distributed fashion to improve the overall system performance with linear decoding complexity. In other words, the proposed strategy offers an improvement in the reliability of the system and enjoys very low decoding complexity by enabling a symbol-wise decoder. On the other hand, another improvement in the performance at the communication terminals is achieved by performing a network coding method at the selected relay nodes. Furthermore, we offer also analytical approximation of the BER performance for the proposed strategy where the simulation results match perfectly the analytical ones. From the simulation results section, the proposed strategy shows a substantially improved BER performance as compared to the current ones.","authors":["Samer Alabed"],"meta":["April 2019EURASIP Journal on Wireless Communications and Networking 2019(1)","DOI:10.1186/s13638-019-1417-1"],"references":["326628385_Performance_Analysis_of_Differential_Beamforming_in_Decentralized_Networks","326628296_Computationally_Efficient_Multi-Antenna_Techniques_for_Multi-User_Two-Way_Wireless_Relay_Networks","319697895_Design_and_Analysis_of_Relay-Selection_Strategies_for_Two-Way_Relay_Network-Coded_DCSK_Systems","308494684_A_Square-Constellation-Based_M-ary_DCSK_Communication_System","308004896_Performance_analysis_of_two-way_DF_relay_selection_techniques","329151745_Performance_Enhancement_for_Energy_Harvesting_Based_Two-Way_Relay_Protocols_in_Wireless_Ad-hoc_Networks_with_Partial_and_Full_Relay_Selection_Methods","308610687_Design_of_an_Adaptive_Multiresolution_M-ary_DCSK_System","299943175_SNR_Estimation_for_FM-DCSK_System_over_Multipath_Rayleigh_Fading_Channels","299472448_A_Survey_on_DCSK-based_Communication_Systems_and_Their_Application_to_UWB_Scenarios","290785596_Relay_selection_based_space-time_coding_for_two-way_wireless_relay_networks_using_digital_network_coding"]}