{"id":"332406832_Designing_the_Sensing_as_a_Service_Ecosystem_for_the_Internet_of_Things","abstract":"The Internet of Things envisions the creation of an environment where everyday objects (e.g., microwaves, fridges, cars, coffee machines) are connected to the Internet and make users’ lives more productive, efficient, and convenient. During this process, everyday objects capture a vast amount of data that can be used to understand individuals and their behaviors. \nIn the current IoT ecosystems, such data is collected and used only by the respective IoT solutions. There is no formal way to share data with external entities. We believe this is very inefficient and unfair for users. We believe that users, as data owners, should be able to control, manage, and share data about them in any way that they choose and make or gain value out of them. To achieve this, we proposed the sensing as a service (S2aaS) model. In this article, we discuss the (S2aaS) ecosystem in terms of its architecture, components, and related user interaction designs. This article aims to highlight the weaknesses of the current IoT ecosystem and to explain how S2aaS would eliminate those weaknesses. We also discuss how an everyday user may engage with the S2aaS ecosystem as well as design challenges.","authors":["Charith Perera","Mahmoud Barhamgi","Suparna De","Tim Baarslag"],"meta":["December 2018","DOI:10.1109/IOTM.2019.1800023"],"references":["309585306_Sensing_as_a_Service_for_Internet_of_Things_A_Roadmap","307992312_Valorising_the_IoT_Databox_Creating_Value_for_Everyone","279982487_Trust_Mechanism_for_Enforcing_Compliance_to_Secondary_Data_Use_Contracts","271585638_The_Emerging_Internet_of_Things_Marketplace_From_an_Industrial_Perspective_A_Survey","271585522_A_Survey_on_Internet_of_Things_From_Industrial_Market_Perspective","322324647_Exploring_personal_data_futures_trading_with_design_fiction_based_hybrid_simulation","317724701_An_iterative_auction_mechanism_for_data_trading","313692372_Data_Trading_With_Multiple_Owners_Collectors_and_Users_An_Iterative_Auction_Mechanism","304298665_Valuating_Queries_for_Data_Trading_in_Modern_Cities","302074071_Negotiation_as_an_Interaction_Mechanism_for_Deciding_App_Permissions"]}