{"id":"332421874_MeshMonk_Open-source_large-scale_intensive_3D_phenotyping","abstract":"Dense surface registration, commonly used in computer science, could aid the biological sciences in accurate and comprehensive quantification of biological phenotypes. However, few toolboxes exist that are openly available, non-expert friendly, and validated in a way relevant to biologists. Here, we report a customizable toolbox for reproducible high-throughput dense phenotyping of 3D images, specifically geared towards biological use. Given a target image, a template is first oriented, repositioned, and scaled to the target during a scaled rigid registration step, then transformed further to fit the specific shape of the target using a non-rigid transformation. As validation, we use n = 41 3D facial images to demonstrate that the MeshMonk registration is accurate, with 1.26 mm average error, across 19 landmarks, between placements from manual observers and using the MeshMonk toolbox. We also report no variation in landmark position or centroid size significantly attributable to landmarking method used. Though validated using 19 landmarks, the MeshMonk toolbox produces a dense mesh of vertices across the entire surface, thus facilitating more comprehensive investigations of 3D shape variation. This expansion opens up exciting avenues of study in assessing biological shapes to better understand their phenotypic variation, genetic and developmental underpinnings, and evolutionary history.","authors":["Julie D White","Alejandra Ortega-Castrillón","Harold Matthews","Arslan A. Zaidi"],"meta":["April 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-42533-y"],"references":["322316147_Ensemble_landmarking_of_3D_facial_surface_scans","322315834_In_situ_immune_response_and_mechanisms_of_cell_damage_in_central_nervous_system_of_fatal_cases_microcephaly_by_Zika_virus_OPEN","315886448_Large_Scale_3D_Morphable_Models","323576175_Estimating_age_and_synthesising_growth_in_children_and_adolescents_using_3D_facial_prototypes","323557788_Automatic_3-dimensional_cephalometric_landmarking_based_on_active_shape_models_in_related_projections","313730987_Method_for_registration_of_3D_shapes","313565968_Measurement_in_medicine_The_analysis_of_method_comparison_studies","312301984_Rapid_automated_landmarking_for_morphometric_analysis_of_three-dimensional_facial_scans","311610666_A_3D_Morphable_Model_Learnt_from_10000_Faces","309638471_Fully_Automated_and_Highly_Accurate_Dense_Correspondence_for_Facial_Surfaces"]}