{"id":"332447694_Personalized_Estimation_of_Engagement_From_Videos_Using_Active_Learning_With_Deep_Reinforcement_Learning","abstract":"Perceiving users' engagement accurately is important for technologies that need to respond to learners in a natural and intelligent way. In this paper, we address the problem of automated estimation of engagement from videos of child-robot interactions recorded in unconstrained environments (kindergartens). This is challenging due to diverse and person-specific styles of engagement expressions through facial and body gestures, as well as because of illumination changes, partial occlusion, and a changing background in the classroom as each child is active. To tackle these difficult challenges, we propose a novel deep reinforcement learning architecture for active learning and estimation of engagement from video data. The key to our approach is the learning of a personalized policy that enables the model to decide whether to estimate the child's engagement level (low, medium, high) or, when uncertain, to query a human for a video label. Queried videos are labeled by a human expert in an offline manner, and used to personalize the policy and engagement classifier to a target child over time. We show on a database of 43 children involved in robot-assisted learning activities (8 sessions over 3 months), that this combined human-AI approach can easily adapt its interpretations of engagement to the target child using only a handful of labeled videos, while being robust to the many complex influences on the data. The results show large improvements over a non-personalized approach and over traditional active learning methods.","authors":["Ognjen Rudovic","Hae Won Park","John Busche","Rosalind W. Picard"],"meta":["April 2019","DOI:10.1109/CVPRW.2019.00031","Conference: IEEE Computer Vision and Pattern Recognition, Analysis and Modeling of Faces and Gestures 2019At: Long Beach, CA"],"references":["335812064_A_Model-Free_Affective_Reinforcement_Learning_Approach_to_Personalization_of_an_Autonomous_Social_Robot_Companion_for_Early_Literacy_Education","327046544_Social_robots_for_education_A_review","322950256_Personalized_Machine_Learning_for_Robot_Perception_of_Affect_and_Engagement_in_Autism_Therapy","322518047_Feature_Space_Transfer_for_Data_Augmentation","319770438_Long-Term_Recurrent_Convolutional_Networks_for_Visual_Recognition_and_Description","356295511_CultureNet_A_Deep_Learning_Approach_for_Engagement_Intensity_Estimation_from_Face_Images_of_Children_with_Autism","334118013_Learning_to_Actively_Learn_Neural_Machine_Translation","328370556_Synopsis_of_the_PhD_Thesis_-_Network_Computations_in_Artificial_Intelligence","322590933_Learning_how_to_Active_Learn_A_Deep_Reinforcement_Learning_Approach","320971251_Quo_Vadis_Action_Recognition_A_New_Model_and_the_Kinetics_Dataset"]}