{"id":"332478086_The_phantom_of_technological_unemployment","abstract":"Nowadays there are many gloomy prophecies provided by both technologists and economists about the detrimental effects of the so-called Fourth Industrial Revolution on aggregate employment and its composition. These prophecies imply that in the near future we will face Robocalypse — a massive replacement of people by machines alongside an explosion in joblessness. This paper provides theoretical, empirical and historical evidence that the phenomenon of technological unemployment is a phantom. The most general results can be summarized as follows: in the long run, reduction in labor demand under the impact of new technologies is merely a theoretical possibility that has never before been realized in practice; at the level of individual firms, there is a strong positive relationship between innovations and employment growth; at the sectoral level, technological changes cause a multidirectional employment response, since different industries are at different stages of the life cycle; at the macro level, technological progress acts as a positive or neutral, but not a negative factor; a surge in technological unemployment, even in the short-term, seems a remote prospect since in coming decades the pace of technological change is unlikely to be fast enough by historical standards; the impact of new technologies on labor supply may be a more serious problem than their impact on labor demand; technological changes seem to have a much greater effect on the composition of employment than on its level.","authors":["Rostislav Kapeliushnikov"],"meta":["April 2019","DOI:10.32609/j.ruje.5.35507"],"references":["337292515_Total_Factor_Productivity_in_Advanced_Countries_A_Longterm_Perspective","356343618_Are_Robots_Stealing_Our_Jobs","356322231_Technological_Change_and_Employment_Were_Ricardo_and_Marx_Right","332096664_Polarization_or_upgrading_Evolution_of_Employment_in_Transitional_Russia","330937446_Changes_in_the_Relative_Demand_for_Skills_in_the_UK_Labour_Market","324659522_Automation_and_Jobs_When_Technology_Boosts_Employment","324629669_The_Principles_of_Political_Economy_and_Taxation","324305921_History_of_Economic_Analysis","318004023_Robots_and_Jobs_Evidence_from_US_Labor_Markets","315307685_Are_We_Approaching_an_Economic_Singularity_Information_Technology_and_the_Future_of_Economic_Growth"]}