{"id":"332433053_sCool_-_Game-Based_Learning_in_Computer_Science_Class_A_Case_Study_in_Secondary_Education","abstract":"In this paper we present a case study of the mobile learning game sCool [1]. Based on previous work presented Steinmaurer et. al. (2018) [2] we expand-ed our study by a second experiment and additional aspects. sCool is a mul-ti-platform game that should encourage children learning computational thinking and coding in Python. The learning content is highly adaptable; therefore, educators can create own courses, individual for the needs of the students. These courses involve a concept-learning and a practical mode. First, the students learn a certain concept and in a second step, they have to apply it in a practical task. For this purpose, we created a course to teach some basic programming concepts. Two student groups of different school types participated in class as a formal learning activity. In this paper we pre-sent the results of the evaluation of sCool in coding classes. Therefore, we focus on the performance, game engagement, emotions and the girls’ percep-tion. Within this study we found out, that the students are interested in learn-ing to code but do have problems to transfer the learned content to similar fields. We also found out, that there are slightly differences in the perfor-mance of the different types of students in terms of gender and school type.","authors":["Alexander Steinmaurer","Johanna Pirker","Christian Guetl"],"meta":["April 2019","DOI:10.3991/ijep.v9i2.9942","Project: sCool - Serious Game for Computational Skills"],"references":["331785003_sCool_-_Game_Based_Learning_in_STEM_Education_A_Case_Study_in_Secondary_Education","328816487_A_Cross-Platform_Mobile_Application_for_Learning_Programming_Basics","324097167_Mobile_Application_Tools_for_Students_in_Secondary_Education_An_Evaluation_Study","321285516_Programming_Basics_for_Beginners_Experience_of_the_Institute_of_Informatics_at_Tallinn_University_of_Technology","272818467_Can_Serious_Games_Contribute_to_Developing_and_Sustaining_21st-Century_Skills","264156313_Engaging_Students_With_a_Mobile_Game-Based_Learning_System_in_University_Education","228328491_Learning_to_program_-_difficulties_and_solutions","325088307_Computational_Thinking_in_K-2_Classrooms_Evidence_from_Student_Artifacts_Fundamental","302073310_Enhancing_online_and_mobile_experimentations_using_gamification_strategies","293328392_Foundations_of_Game-Based_Learning"]}