{"id":"332591698_A_Holistic_Approach_for_Computer_Science_Education_in_Secondary_Schools","abstract":"In this study, effectiveness of a computer science course at the secondary school level is investigated through a holistic approach addressing the dimensions of instructional content design, development, implementation and evaluation framed according to ADDIE instructional design model where evaluation part constituted the research process for the current study. The process has initiated when the computer science curriculum had major revisions in order to provide in-service teachers with necessary support and guidance. The study is carried through as a project, which lasted more than one year and both quantitative and qualitative measures were used through a sequential explanatory method approach. The intention was to investigate the whole process in detail in order to reveal the effectiveness of the process and the products. In this regard, not only teachers' perceptions but also students' developments in their perceptions of academic achievement and computational thinking, as well as correlations between the computational thinking sub-factors were investigated. The findings showed that the instructional materials and activities developed within the scope of the study, positively affected the computational thinking and academic achievement of students aged 10 and 12 years old. The teachers' weekly feedbacks regarding application structures and implementation processes were also supported the findings and revealed some more details that will be useful both for instructional designers and teachers.","authors":["Serhat Bahadir Kert","Filiz Kalelioglu","Yasemin Gulbahar"],"meta":["April 2019Informatics in Education 18(1):131-150","DOI:10.15388/infedu.2019.06"],"references":["328317728_The_Self-Efficacy_Perception_Scale_for_Computational_Thinking_Skill_Validity_and_Reliability_Study","312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","305084574_Examples_of_Algorithmic_Thinking_in_Programming_Education","338299459_Instructional_Design_for_Simulations_in_Special_Education_Virtual_Learning_Spaces","322409300_Assessing_primary_school_students'_intrinsic_motivation_of_computational_thinking","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","319890662_Girls_and_computer_science_experiences_perceptions_and_career_aspirations","317953655_Designing_and_conducting_mixed_methods_research","301429175_Introducing_teachers_to_computational_thinking_using_unplugged_storytelling","276441911_Reaching_a_Broader_Population_of_Students_through_Unplugged_Activities"]}