{"id":"332568219_From_Computer_Science_to_the_Informational_Worldview_Philosophical_Interpretations_of_Some_Computer_Science_Concepts","abstract":"In this article I defend the thesis that modern computer science has a significant philosophical potential, which is expressed in a form of worldview, called here informational worldview (IVW). It includes such theses like: a) each being contains a certain informational content (which may be revealed by computer science concepts, such as code or algorithm), b) the mind is an information processing system (which should be modeled by means of data processing systems), c) cognition is a type of computation. These (pre)philosophical theses are accepted in many sciences (e.g. in cognitive science), and this is both an expression and strengthening of the IWV. After a general discussion of the relations between philosophy, particular sciences and the worldview, and then the presentation of the basic assumptions and theses of the IWV, I analyze a certain specification of thesis b) expressed in the statement that \"the mind is the Turing machine\". I distinguish three concepts of mind (static, variable and minimal) and explain how each of them is connected with the concept of the Turing machine.","authors":["Paweł Stacewicz"],"meta":["March 2019Foundations of Computing and Decision Sciences 44(1):27-43","DOI:10.2478/fcds-2019-0003"],"references":["315437334_Informational_Worldview_Scientific_Foundations_and_Philosophical_Perspectives","311861937_Computing_Nature","353092773_Philosophy_of_Computing_and_Information_5_Questions","346646183_Algorithmics","334775107_The_Informational_Worldview_and_Conceptual_Apparatus","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","275737110_Turing's_Man_Western_Culture_in_the_Computer_Age","243773038_The_Computer_and_the_Mind_An_Introduction_to_Cognitive_Science","239578559_Turing_AM_On_computable_numbers_with_an_application_to_the_Entscheidungs_problem_Proc_Lond_Math_Soc_Ser_2_42_230-265","236880605_Explaining_the_Computational_Mind"]}