{"id":"332536137_Industry_40_applications_in_medical_field_A_brief_review","abstract":"Abstract\nBackground\nIndustry 4.0 is an established reality that seems to fulfil various requirements of the medical field with extensive research is going in this area. Thus, there is a need to understand how Industry 4.0 can be a useful paradigm to fulfil various requirements of medical field using different technologies.\n\nAim of this work\nThe purpose of this study is to understand the role of Industry 4.0 in the medical field and identify research status along-with future applications.\n\nMaterials and methods\nResearch papers on Industry 4.0 in medical and related articles were studied to identify applications and research direction.\n\nResult\nThrough this study, we identified different technologies, capabilities, research status of Industry 4.0 in the medical field. Further, we have also identified nineteen important applications of Industry 4.0 in the medical field to provide a significant contribution to the research & development of new medical models and devices. Industry 4.0 seems to be an essential part of tomorrow's medical field and smart factories, where software, technologies and processes provide efficient and world-class results with lesser time and cost.\n\nConclusion\nIndustry 4.0 shows the extensive capability of manufacturing of newly customised implants, innovative tools and instruments for the medical field. It provides a type of digital hospital and a complete monitoring system that fulfils the individual requirements of the patient/ medical industry with optimised time and cost. Industry 4.0 is an innovative approach to generate new concept and undertake development in the medical field through the integration of technologies, smart machines and different software. Industry 4.0 manufactures, high quality, regulated medical devices which are highly customised as per patient requirements. This revolution embraces automation and creates new manufacturing opportunities in the medical world. With the help of the Internet of Things (IoT) and the Internet of services (IoS), it creates a new virtual world. It creates connectivity and data exchange with the help of new manufacturing technologies, software, sensors, robots and other advanced information technologies. In future, Industry 4.0 can create new opportunities and innovative routes for patient care.","authors":["Mohd Javaid","Abid Haleem"],"meta":["April 2019Current Medicine Research and Practice 9(3)","DOI:10.1016/j.cmrp.2019.04.001"],"references":["330011681_Industry_50_and_its_applications_in_orthopaedics","327885618_4D_printing_applications_in_medical_field_A_brief_review","325489301_3D_Scanning_Applications_in_Medical_field_A_Literature-based_Review","325450826_Sustainable_Industry_40_framework_A_systematic_literature_review_identifying_the_current_trends_and_future_perspectives","325278735_Current_status_and_challenges_of_Additive_manufacturing_in_orthopaedics_An_overview","324681846_Additive_manufacturing_applications_in_orthopaedics_A_review","327947052_Industry_40_and_its_applications_in_orthopaedics","326019448_The_future_of_manufacturing_industry_a_strategic_roadmap_toward_Industry_40","324878319_Evaluating_challenges_to_Industry_40_initiatives_for_supply_chain_sustainability_in_emerging_economies","323611026_Immersive_and_interactive_virtual_reality_to_improve_learning_and_retention_of_neuroanatomy_in_medical_students_a_randomized_controlled_study"]}