{"id":"332595657_Optimal_access_point_location_algorithm_based_real_measurement_for_indoor_communication","abstract":"The deployment of access points (AP's) with optimum location has particular importance in optimizing the coverage, operation, and management of the networks. In addition, the most interesting researcher topics recently were finding the lowest cost localization algorithm and methods for indoor communication. The most utilizing approach was based on the use of Received Signal Strength (RSS) measurement, due to reasons related to its availability in the wireless network. As well as, it can be easily accessed from a different operating system. In this paper, a localization algorithm for optimal AP deployment based on RSS measurement has been presented. RSS measurement obtained from different received points in a real-world environment. Measurement results obtained using specialized software was considered the optimum direction in each received point. Our algorithm uses these measurements and considered two-step localization approach, data collecting phase, and localization phase. It is worth to mention, that the same location was considered to be the optimum for both real-world measurement scenario and simulation scenario that has been clarified in previous work. This study may be considered as a quite verification for simulating results obtained using 3D-Ray Tracing approach based wireless InSite software. Furthermore, it is a low-cost method for achieving the optimum location for AP deployment and enhancing the network coverage area.","authors":["Maan Muataz Abdulwahid","Oras A. Al-Ani","Mahmood Farhan Mosleh","Raed Abd-Alhameed"],"meta":["April 2019","DOI:10.1145/3321289.3321300","Conference: the International Conference","Projects: Combination of LMS and RLS Adaptive Equalizer for Selective Fading ChannelIndoor localization"],"references":["315483214_Drive-By_Localization_of_Roadside_WiFi_Networks","313816052_A_Survey_on_Wireless_Transmitter_Localization_Using_Signal_Strength_Measurements","288484594_Comparative_Survey_of_Indoor_Positioning_Technologies_Techniques_and_Algorithms","276902496_Indoor_Mobile_Localization_Based_on_Wi-Fi_Fingerprint's_Important_Access_Point","276493313_RSSI-based_Algorithm_for_Indoor_Localization","275055727_Distance-Based_Interpolation_and_Extrapolation_Methods_for_RSS-Based_Localization_With_Indoor_Wireless_Signals","325000426_A_Survey_on_the_Impact_of_Multipath_on_Wideband_Time-of-Arrival-Based_Localization","292079340_An_improved_location_estimation_method_for_Wifi_fingerprint-based_indoor_localization","283100227_Entropy-based_non-line_of_sight_identification_for_wireless_positioning_systems","261342612_Indoor_localization_improvement_via_adaptive_RSS_fingerprinting_database"]}