{"id":"332586206_Desenvolvimento_e_Avaliacao_de_um_Protocolo_Eletronico_para_Atendimento_e_Monitoramento_do_Paciente_com_Doenca_Celiaca","abstract":"Resumo. Um protocolo clínico é uma forma para padronizar o estudo de um problema médico e as indicações de terapia. A doença celíaca é uma intolerância permanente ao glúten, proteína presente no trigo, centeio e cevada, que se caracteriza por ser uma enteropatia mediada por células T, e que acomete indivíduos geneticamente susceptíveis. A dificuldade de diagnóstico da doença celíaca se deve à diversidade de sinais e sintomas que esta enfermidade pode apresentar. O objetivo deste trabalho é desenvolver um protocolo eletrônico com informações estruturadas e específicas para o atendimento e monitoramento do paciente com doença celíaca, disponível na web, e avaliá-lo em termos de usabilidade. A análise de formulários para consulta, prontuários e um documento científico possibilitaram a estruturação dos dados clínicos. Um sistema computacional web foi modelado e construído. Para a avaliação da usabilidade, foi utilizado o questionário SUS. A avaliação da usabilidade mostrou que o protocolo é condizente com as necessidades dos usuários, visto que a avaliação do questionário SUS resultou em um valor médio de 83,5 ± 10,0. A utilização do protocolo eletrônico mostrou-se válida para o atendimento e monitoramento do paciente celíaco, pois manteve a especificidade dos dados clínicos e a rotina dos profissionais envolvidos. Abstract. A clinical protocol is a set of guidelines aimed at standardizing the study of a medical case. It may include decision algorithms and therapies to be followed. Celiac disease is a permanent intolerance to gluten, a protein present in wheat, rye and barley. This disease affects genetically susceptible individuals and is characterized by a T-cells-mediated enteropathy. The diversity of signs and symptoms that the disease can present makes its diagnosing difficult. The goal of this study was to develop and evaluate the usability of a web-available electronic medical protocol containing structured information, specific to treating and monitoring patients with celiac disease. The electronic documents created for the current protocol were based on existing clinical forms and medical records, and on the study of a scientific document. A web computational system was modeled and implemented. The protocol usability was assessed through SUS questionnaire, which showed that the protocol met the requirements of its users (average usability score of 83.5% ± 10.0%). The electronic protocol proved to be clinically specific and effective, as the routine of the professionals involved was not disrupted and the expected medical specificity was maintained.","authors":["Josceli Tenorio","Frederico Molina Cohrs","Vera Lucia Sdepanian","Ivan Torres Pisa"],"meta":["March 2011","DOI:10.22456/2175-2745.12119"],"references":["319394819_SUS_--_a_quick_and_dirty_usability_scale","246139556_Doenca_celiaca_caracteristicas_clinicas_e_metodos_utilizados_no_diagnostico_de_pacientes_cadastrados_na_Associacao_dos_Celiacos_do_Brasil","228593520_SUS_A_quick_and_dirty_usability_scale","26340800_Doenca_celiaca_a_evolucao_dos_conhecimentos_desde_sua_centenaria_descricao_original_ate_os_dias_atuais","12152109_Current_Approaches_To_Diagnosis_And_Treatment_Of_Celiac_Disease_An_Evolving_Spectrum","11297474_Decision_support_and_safety_of_clinical_environments","285838148_Usability_101_introduction_to_usability","228368593_Determining_What_Individual_SUS_Scores_Mean_Adding_an_Adjective_Rating_Scale","12623168_Developing_and_Implementing_Computerized_Protocols_for_Standardization_of_Clinical_Decisions","11407867_A_review_of_evidence_of_health_benefit_from_artificial_neural_networks_in_medical_intervention"]}