{"id":"332510524_Drug_prioritization_using_the_semantic_properties_of_a_knowledge_graph","abstract":"Compounds that are candidates for drug repurposing can be ranked by leveraging knowledge available in the biomedical literature and databases. This knowledge, spread across a variety of sources, can be integrated within a knowledge graph, which thereby comprehensively describes known relationships between biomedical concepts, such as drugs, diseases, genes, etc. Our work uses the semantic information between drug and disease concepts as features, which are extracted from an existing knowledge graph that integrates 200 different biological knowledge sources. RepoDB, a standard drug repurposing database which describes drug-disease combinations that were approved or that failed in clinical trials, is used to train a random forest classifier. The 10-times repeated 10-fold cross-validation performance of the classifier achieves a mean area under the receiver operating characteristic curve (AUC) of 92.2%. We apply the classifier to prioritize 21 preclinical drug repurposing candidates that have been suggested for Autosomal Dominant Polycystic Kidney Disease (ADPKD). Mozavaptan, a vasopressin V2 receptor antagonist is predicted to be the drug most likely to be approved after a clinical trial, and belongs to the same drug class as tolvaptan, the only treatment for ADPKD that is currently approved. We conclude that semantic properties of concepts in a knowledge graph can be exploited to prioritize drug repurposing candidates for testing in clinical trials.","authors":["Tareq Malas","Wytze J. Vlietstra","Roman Kudrin","Sergey Starikov"],"meta":["April 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-42806-6"],"references":["319991895_Systematic_integration_of_biomedical_knowledge_prioritizes_drugs_for_repurposing","315006632_A_standard_database_for_drug_repositioning","312721287_Scientific_Lenses_to_Support_Multiple_Views_over_Linked_Chemistry_Data","311612523_Neuro-symbolic_representation_learning_on_biological_knowledge_graphs","310741676_REPRODUCIBLE_DRUG_REPURPOSING_WHEN_SIMILARITY_DOES_NOT_SUFFICE","308738579_Prediction_of_new_drug_indications_based_on_clinical_data_and_network_modularity","296055302_The_Implicitome_A_Resource_for_Rationalizing_Gene-Disease_Associations","292671738_Network-based_in_silico_drug_efficacy_screening","325047219_Targeted_Therapies_for_Autosomal_Dominant_Polycystic_Kidney_Disease","295673741_Effect_of_Sirolimus_on_Disease_Progression_in_Patients_with_Autosomal_Dominant_Polycystic_Kidney_Disease_and_CKD_Stages_3b-4"]}