{"id":"332504027_PGxO_and_PGxLOD_A_reconciliation_of_pharmacogenomic_knowledge_of_various_provenances_enabling_further_comparison","abstract":"Background\nPharmacogenomics (PGx) studies how genomic variations impact variations in drug response phenotypes. Knowledge in pharmacogenomics is typically composed of units that have the form of ternary relationships gene variant – drug – adverse event. Such a relationship states that an adverse event may occur for patients having the specified gene variant and being exposed to the specified drug. State-of-the-art knowledge in PGx is mainly available in reference databases such as PharmGKB and reported in scientific biomedical literature. But, PGx knowledge can also be discovered from clinical data, such as Electronic Health Records (EHRs), and in this case, may either correspond to new knowledge or confirm state-of-the-art knowledge that lacks “clinical counterpart” or validation. For this reason, there is a need for automatic comparison of knowledge units from distinct sources.\n\nResults\nIn this article, we propose an approach, based on Semantic Web technologies, to represent and compare PGx knowledge units. To this end, we developed PGxO, a simple ontology that represents PGx knowledge units and their components. Combined with PROV-O, an ontology developed by the W3C to represent provenance information, PGxO enables encoding and associating provenance information to PGx relationships. Additionally, we introduce a set of rules to reconcile PGx knowledge, i.e. to identify when two relationships, potentially expressed using different vocabularies and levels of granularity, refer to the same, or to different knowledge units. We evaluated our ontology and rules by populating PGxO with knowledge units extracted from PharmGKB (2701), the literature (65,720) and from discoveries reported in EHR analysis studies (only 10, manually extracted); and by testing their similarity. We called PGxLOD (PGx Linked Open Data) the resulting knowledge base that represents and reconciles knowledge units of those various origins.\n\nConclusions\nThe proposed ontology and reconciliation rules constitute a first step toward a more complete framework for knowledge comparison in PGx. In this direction, the experimental instantiation of PGxO, named PGxLOD, illustrates the ability and difficulties of reconciling various existing knowledge sources.\n\nElectronic supplementary material\nThe online version of this article (10.1186/s12859-019-2693-9) contains supplementary material, which is available to authorized users.","authors":["Pierre Monnin","Joël Legrand","Graziella Husson","Patrice Ringot"],"meta":["April 2019BMC Bioinformatics 20(S4)","DOI:10.1186/s12859-019-2693-9"],"references":["322584616_MIRO_Guidelines_for_minimum_information_for_the_reporting_of_an_ontology","316309691_Learning_from_biomedical_linked_data_to_suggest_valid_pharmacogenes","311502214_Multichannel_Convolutional_Neural_Network_for_Biological_Relation_Extraction","321273775_The_Influence_of_Big_Clinical_Data_and_Genomics_on_Precision_Medicine_and_Drug_Development","321163581_Clinical_Pharmacogenetics_Implementation_Consortium_CPIC_Guideline_for_Dihydropyrimidine_Dehydrogenase_Genotype_and_Fluoropyrimidine_Dosing_2017_Update","320333535_PROV-O_The_PROV_Ontology","317189023_Genome-wide_association_and_pathway_analysis_of_left_ventricular_function_after_anthracycline_exposure_in_adults","313815547_The_Georges_Pompidou_University_Hospital_Clinical_Data_Warehouse_A_8-years_follow-up_experience","295814101_The_effect_of_genetic_variation_in_PCSK9_on_the_LDL-cholesterol_response_to_statin_therapy","289176734_Word_Embeddings_through_Hellinger_PCA"]}