{"id":"332521035_Deep_Learning_for_Multi-Class_Identification_From_Domestic_Violence_Online_Posts","abstract":"Domestic violence (DV) is not only a major health and welfare issue but also a violation of human rights. In recent years, domestic violence crisis support (DVCS) groups active on social media have proven indispensable in the support services provided to victims and their families. In the deluge of online-generated content, the significant challenge arises for DVCS groups’ to manually detect the critical situation in a timely manner. For instance, the reports of abuse or urgent financial help solicitation are typically obscured by a vast amount of awareness campaigns or prayers for the victims. The state-of-the-art deep learning models with the embeddings approach have already demonstrated superior results in online text classification tasks. The automatic content categorization would address the scalability issue and allow the DVCS groups to intervene instantly with the exact support needed. Given the problem identified, the study aims to: 1) construct the novel “gold standard’ dataset from social media with multi-class annotation; 2) perform the extensive experiments with multiple deep learning architectures; 3) train the domain-specific embeddings for performance improvement and knowledge discovery; and 4) produce the visualizations to facilitate models analysis and results in interpretation. The empirical evidence on a ground truth dataset has achieved an accuracy of up to 92% in classes prediction. The study validates an application of cutting edge technology to a real-world problem and proves beneficial to DVCS groups, health care practitioners, and most of all victims.","authors":["Sudha Subramani","Sandra Michalska","Hua Wang","Jiahua Du"],"meta":["January 2019IEEE Access 7:46210-46224","DOI:10.1109/ACCESS.2019.2908827"],"references":["327783112_Domestic_Violence_Crisis_Identification_From_Facebook_Posts_Based_on_Deep_Learning","326548433_Aggression_Identification_Using_Deep_Learning_and_Data_Augmentation","325434599_Extracting_Actionable_Knowledge_from_Domestic_Violence_Discourses_on_Social_Media","329562183_A_Modified_Deep_Convolutional_Neural_Network_for_Abnormal_Brain_Image_Classification","328386253_Topic-Net_Conversation_Model_19th_International_Conference_Dubai_United_Arab_Emirates_November_12-15_2018_Proceedings_Part_I","328245688_Intent_Classification_Using_Feature_Sets_for_Domestic_Violence_Discourse_on_Social_Media","327810239_Text_Mining_and_Real-Time_Analytics_of_Twitter_Data_A_Case_Study_of_Australian_Hay_Fever_Prediction_7th_International_Conference_HIS_2018_Cairns_QLD_Australia_October_5-7_2018_Proceedings","327633269_HowIWillChange_Engaging_Men_and_Boys_in_the_MeToo_Movement","325936534_Bayesian_Sparse_Topical_Coding","325812801_Machine_Learning_on_Big_Data_A_Developmental_Approach_on_Societal_Applications"]}