{"id":"332518422_Beachcombing_on_strips_and_islands","abstract":"A group of mobile robots (beachcombers)have to search collectively every point of a given domain. At any given moment, each robot can be in walking mode or in searching mode. It is assumed that each robot's maximum allowed searching speed is strictly smaller than its maximum allowed walking speed. A point of the domain is searched if at least one of the robots visits it in searching mode. The Beachcombers' Problem consists in developing efficient schedules (algorithms)for the robots which collectively search all the points of the given domain as fast as possible. We consider searching schedules in the following one-dimensional geometric domains: the cycle of a known circumference L, the finite straight line segment of a known length L, and the semi-infinite line [0,+∞). We first consider the online Beachcombers' Problem (i.e. the scenario when the robots do not know in advance the length of the segment to be searched), where the robots are initially collocated at the origin of a semi-infinite line. It is sought to design a schedule A with maximum speed S, defined as S=inf ℓ ⁡ [Formula presented], where t A (ℓ)denotes the time when the search of the segment [0,ℓ]is completed under A. We consider a discrete and a continuous version of the problem, depending on whether the infimum is taken over ℓ∈N ⁎ or ℓ≥1. We prove that the LeapFrog algorithm, which was proposed in Czyzowicz et al. (2015)[12], is in fact optimal in the discrete case. This settles in the affirmative a conjecture from that paper. We also show how to extend this result to the more general continuous online setting. For the offline version of the Beachcombers' Problem (i.e. the scenario when the robots know in advance the length of the segment to be searched), we consider the t-source Beachcombers' Problem (i.e. all robots start from a fixed number t≥1 of starting positions)on the cycle and on the finite segment. For the t-source Beachcombers' Problem on the cycle, we show that the structure of the optimal solutions is identical to the structure of the optimal solutions to the 2t-source Beachcombers' Problem on a finite segment. In consequence, by using results from Czyzowicz et al. (2014)[13], we prove that the 1-source Beachcombers' Problem on the cycle is NP-hard, and we derive approximation algorithms for the problem. For the t-source variant of the Beachcombers' Problem on the cycle and on the finite segment, we also derive efficient approximation algorithms. One important contribution of our work is that, in all variants of the offline Beachcombers' Problem that we discuss, we allow the robots to change direction of movement and search points of the domain on both sides of their respective starting positions. This represents a significant generalization compared to the model considered in Czyzowicz et al. (2014)[13], in which each robot had a fixed direction of movement that was specified as part of the solution to the problem. We manage to prove that changes of direction do not help the robots achieve optimality.","authors":["Evangelos Bampas","Jurek Czyzowicz","David Ilcinkas","Ralf Klasing"],"meta":["April 2019Theoretical Computer Science 806(4)","DOI:10.1016/j.tcs.2019.04.001"],"references":["225802316_Boundary_Patrolling_by_Mobile_Agents_with_Distinct_Maximal_Speeds","314670824_The_Beachcombers'_Problem_Walking_and_Searching_from_an_Inner_Point_of_a_Line","313502462_Online_graph_exploration_algorithms_for_cycles_and_trees_by_multiple_searchers","295122009_The_Multi-source_Beachcombers'_Problem","290882735_Online_Algorithms_-_What_Is_It_Worth_to_Know_the_Future","275064283_An_Optimal_Search","264425341_Fence_Patrolling_by_Mobile_Agents_with_Distinct_Speeds","257586217_Online_graph_exploration_algorithms_for_cycles_and_trees_by_multiple_searchers","257285777_Searching_in_the_Plane","236455989_The_Beachcombers'_Problem_Walking_and_Searching_with_Mobile_Robots","225363679_On_the_Linear_Search_Problem","223206196_Map_construction_of_unknown_graphs_by_multiple_agents","222678896_Online_Searching_with_Turn_Cost","222539031_An_annotated_bibliography_on_guaranteed_graph_searching","221498607_How_to_Learn_an_Unknown_Environment_Extended_Abstract"]}