{"id":"332535840_Le_codesign_d'une_plateforme_numerique_fonde_sur_des_principes_au_service_de_l'agentivite_des_enseignantes_et_des_enseignants_en_contexte_de_developpement_professionnel_Co-Design_of_a_Digital_Platform","abstract":"Les enseignantes et les enseignants du collégial partagent avec les établissements d’enseignement la responsabilité de leur développement professionnel. Cet article a trait au codesign d’une plateforme numérique au service de l’agentivité des enseignants en situation de développement professionnel. Le processus de codesign a inclus le repérage des freins au développement professionnel ainsi que l’identification des buts de niveau motivationnel. Les résultats mettent l’accent sur les buts fonctionnels et opérationnels qui permettent de soutenir les buts de niveau motivationnel.\n\nCollege teachers share with educational institutions the responsibility for their professional development. This article deals with the co-design of a digital platform supporting teachers’ agency in the context of their professional development. The co-design process included the identification of barriers to professional development, as well as the identification of goals at the motivational level. Results emphasize the functional and operational goals supporting motivational goals.","authors":["Michelle Deschenes","Thérèse Laferrière"],"meta":["April 2019Canadian Journal of Learning and Technology / La revue canadienne de l’apprentissage et de la technologie 45(1)","DOI:10.21432/cjlt27798","Project: Le numérique pour soutenir l’agentivité des enseignantes et des enseignants au collégial en contexte de développement professionnel"],"references":["319561592_CODEsign_building_a_shared_dialogue_around_analysis_within_co-design","304662507_Organizing_for_Teacher_Agency_in_Curricular_Co-Design","347493901_Developing_Teachers_The_Challenges_of_Lifelong_Learning","346864770_Apprendre_par_l'experience_Un_modele_applicable_a_la_formation_continue","330303991_Favoriser_le_developpement_professionnel_des_professeurs_du_collegial_pistes_de_reflexion_issues_de_la_recherche","329645340_Participatory_IT_Design_Designing_for_Business_and_Workplace_Realities","316823281_Self-efficacy_the_exercise_of_control","315118880_Self-Directed_Learning","313719013_Social_cognitive_theory_An_agentive_perspective","312153345_Co-creation_and_the_new_landscapes_of_design_co-design"]}