{"id":"332518130_Pedestrian_Flow_Tracking_and_Statistics_of_Monocular_Camera_Based_on_Convolutional_Neural_Network_and_Kalman_Filter","abstract":"Pedestrian flow statistics and analysis in public places is an important means to ensure urban safety. However, in recent years, a video-based pedestrian flow statistics algorithm mainly relies on binocular vision or a vertical downward camera, which has serious limitations on the application scene and counting area, and cannot make use of the large number of monocular cameras in the city. To solve this problem, we propose a pedestrian flow statistics algorithm based on monocular camera. Firstly, a convolution neural network is used to detect the pedestrian targets. Then, with a Kalman filter, the motion models for the targets are established. Based on these motion models, data association algorithm completes target tracking. Finally, the pedestrian flow is counted by the pedestrian counting method based on virtual blocks. The algorithm is tested on real scenes and public data sets. The experimental results show that the algorithm has high accuracy and strong real-time performance, which verifies the reliability of the algorithm.","authors":["Miao He","Haibo Luo","Hui Bin","Zhenxing Chang"],"meta":["April 2019Applied Sciences 9(8):1624","DOI:10.3390/app9081624"],"references":["322059721_Channel_Pruning_for_Accelerating_Very_Deep_Neural_Networks","321511662_FSSD_Feature_Fusion_Single_Shot_Multibox_Detector","329488196_R-fcn_Object_detection_via_region-based_fully_convolutional_networks","326749164_People_Counting_with_Overhead_Camera_Using_Fuzzy-Based_Detector_ICCI-2017","324387691_YOLOv3_An_Incremental_Improvement","322058119_Soft-NMS_-_Improving_Object_Detection_with_One_Line_of_Code","320964510_Feature_Pyramid_Networks_for_Object_Detection","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}