{"id":"332566029_Improved_Bounds_for_Quantified_Derandomization_of_Constant-Depth_Circuits_and_Polynomials","abstract":"This work studies the question of quantified derandomization, which was introduced by Goldreich and Wigderson (STOC 2014). The generic quantified derandomization problem is the following: For a circuit class C\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$${\\mathcal{C}}$$\\end{document} and a parameter B=B(n), given a circuit C∈C\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$${C\\in\\mathcal{C}}$$\\end{document} with n input bits, decide whether C rejects all of its inputs, or accepts all but B(n) of its inputs. In the current work, we consider three settings for this question. In each setting, we bring closer the parameter setting for which we can unconditionally construct relatively fast quantified derandomization algorithms, and the “threshold” values (for the parameters) for which any quantified derandomization algorithm implies a similar algorithm for standard derandomization.\nFor constant-depth circuits, we construct an algorithm for quantified derandomization that works for a parameter B(n) that is only slightly smaller than a “threshold” parameter and is significantly faster than the best currently known algorithms for standard derandomization. On the way to this result, we establish a new derandomization of the switching lemma, which significantly improves on previous results when the width of the formula is small. For constant-depth circuits with parity gates, we lower a “threshold” of Goldreich and Wigderson from depth five to depth four and construct algorithms for quantified derandomization of a remaining type of layered depth-3 circuit that they left as an open problem. We also consider the question of constructing hitting-set generators for multivariate polynomials over large fields that vanish rarely and prove two lower bounds on the seed length of such generators.\nSeveral of our proofs rely on an interesting technique, which we call the randomized tests technique. Intuitively, a standard technique to deterministically find a “good” object is to construct a simple deterministic test that decides the set of good objects, and then “fool” that test using a pseudorandom generator. We show that a similar approach works also if the simple deterministic test is replaced with a distribution over simple tests, and demonstrate the benefits in using a distribution instead of a single test.","authors":["Roei Tell"],"meta":["June 2019computational complexity 28(4)","DOI:10.1007/s00037-019-00179-2"],"references":["321337672_Introduction_to_Property_Testing","301880912_Randomness_Extraction_in_AC0_and_with_Small_Locality","287368677_On_derandomizing_algorithms_that_err_extremely_rarely","268608520_Analysis_of_Boolean_Functions","268458711_A_Derandomized_Switching_Lemma_and_an_Improved_Derandomization_of_AC0","238697958_Lower_bounds_on_the_size_of_bounded_depth_networks_over_a_complete_basis_with_logical_addition","235008639_Hardness_vs_randomness","226375948_Lower_bounds_on_the_size_of_bounded_depth_circuits_over_a_complete_basis_with_logical_addition","225761534_Improved_Pseudorandom_Generators_for_Depth_2_Circuits","224967876_DNF_Sparsification_and_a_Faster_Deterministic_Counting_Algorithm","221462734_Pseudorandom_Bit_Generators_That_Fool_Modular_Sums","221591876_Pseudorandom_generators_for_low_degree_polynomials","221498815_The_Monotone_Complexity_of_k-Clique_on_Random_Graphs","220616932_Pseudorandom_Bits_for_Polynomials","220139097_The_Sum_of_D_Small-Bias_Generators_Fools_Polynomials_of_Degree_D"]}