{"id":"332580061_Indicadores_da_producao_colaborativa_na_arquitetura_da_informacao","abstract":"A arquitetura da informação é considerada como um domínio estratégico de produção colaborativa da Ciência da Informação. Descrevem-se as condições da produção colaborativa na arquitetura da informação, considerando-a como subárea de estudo da Ciência a Informação. Para tanto, abordam-se, especificamente, indicadores da produção científica que compreendem temáticas de estudo, tipologia e formação da autoria, programas de pós-graduação e áreas a que se encontra vinculada, entre outros. Trata-se de uma pesquisa exploratória e descritiva. Mapeia-se a produção científica do Encontro Nacional de Pesquisa em Ciência da Informação (ENANCIB), no período de 2003 a 2013, no repositório “Questões em Rede”. Utiliza-se a bibliometria para identificar elementos paratextuais e textuais que formam indícios da produção colaborativa na arquitetura da informação. Constatou-se a pluralidade na formação acadêmica dos pesquisadores que abordam a arquitetura da informação, o compartilhamento de linguagens, alguns indícios das convergências disciplinares a partir da colaboração em coautoria, bem como um plexo de relações através das citações indiretas que representam o compartilhamento de elementos teórico-metodológicos na produção interdisciplinar. Além disso, a formação acadêmica dos pesquisadores com maior índice de produtividade é vinculada principalmente à Biblioteconomia e à Ciência da Computação. Considera-se que a produção colaborativa na arquitetura da informação se apresenta como processo de produção multidisciplinar, constituindo-se em um domínio convergente que possibilita a efetividade de práticas interdisciplinares na Ciência da Informação.Palavras-chave: Ciência da informação. Epistemologia da ciência da informação. Produção colaborativa na arquitetura da informação. Produção colaborativa na ciência da informação. Link: https://periodicos.sbu.unicamp.br/ojs/index.php/rdbci/article/view/8647357/pdf","authors":["Zayr Claudio Gomes da Silva","Edivanio Duarte de Souza"],"meta":["October 2017Pesquisa Brasileira em Ciência da Informação e Biblioteconomia 12(2)","DOI:10.22478/ufpb.1981-0695.2017v12n2.36731"],"references":["326157136_A_Epistemologia_Interdisciplinar_na_Ciencia_da_Informacao_dos_indicios_aos_efeitos_de_sentido_na_consolidacao_do_campo_disciplinar","281808108_Epistemologia_da_Interdisciplinaridade_Epistemology_of_Interdisciplinarity","277166886_Para_uma_reflexao_epistemologica_acerda_da_Ciencia_da_Informacao","44837374_Information_Architecture_for_the_World_Wide_Web","30876319_Information_Architects"]}