{"id":"332580375_ANALYSIS_ON_ENTREPRENEURIAL_INTENTION_MOTIVATION_AND_PERSONALITY_TRAITS_STUDY_AT_UNIVERSITAS_INDONESIA","abstract":"In the era of disruption, organization needs people who posses the entrepreneurial profile. The study aims to provide a general description on the level of entrepreneurial intention, motivation, and personality traits of final years students of the University of Indonesia. Entrepreneurial Intention is measured by two dimensions, i.e. Immediate Term Intention and Future Intention. Meanwhile, Entrepreneurial Motivation is measured by three dimensions, namely Ambition for Freedom, Self-Realization, and Pushing Factors. Personality Traits are measured by four dimensions, namely Personality Traits, Business Relation, Behavior in Organization, and Other Characteristics. The study compiled as respondents 150 final year students from 5 faculties, namely: Faculty of Economics and Business, Faculty of Administrative Science, Faculty of Pharmacy, Faculty of Computer Science and Faculty of Engineering. Afterwards, it applied mean value to analyze respondents’ answers. The results show that final year students from the Faculty of Economics and Business, Faculty of Administrative Science, Faculty of Pharmacy, Faculty of Computer Science and Faculty of Engineering, have high intention, high motivation, as well as strong personality to become entrepreneur.","authors":["Razanah Mahdi","Eko Sakapurnama"],"meta":["February 2019Hasanuddin Economics and Business Review 2(3):201","DOI:10.26487/hebr.v2i3.1679"],"references":["317638944_Theory_of_Planned_Behavior_Undergraduates'_Entrepreneurial_Motivation_and_Entrepreneurship_Career_Intention_at_a_Public_University","24137730_Students'_Attitudes_and_Intentions_toward_Entrepreneurship_at_Tallinn_University_of_Technology","312127316_Measuring_entrepreneurship_profiles_in_higher_education_case_study_in_universitas_Indonesia","308469038_The_theory_of_planned_behavior","241080604_The_entrepreneurial_university_Examining_the_underlying_academic_tensions","228247192_The_Theory_of_Economic_Development_An_Inquiry_Into_Profits_Capital_Credit_Interest_and_the_Business_Cycle","4967860_Competing_Models_of_Entrepreneurial_Intention"]}