{"id":"332699334_Network_Anomaly_Intrusion_Detection_Using_a_Nonparametric_Bayesian_Approach_and_Feature_Selection","abstract":"Anomaly-based intrusion detection systems (IDSs) have been deployed to monitor network activity and to protect systems and the Internet of Things (IoT) devices from attacks (or intrusions). The problem with these systems is that they generate a huge amount of inappropriate false alarms whenever abnormal activities are detected and they are not too flexible for a complex environment. The high-level rate of the generated false alarms reduces the performance of IDS against cyber-attacks and makes the tasks of the security analyst particularly difficult and the management of intrusion detection process computationally expensive. We study here one of the challenging aspects of computer and network security and we propose to build a detection model for both known and unknown intrusions (or anomaly detection) via a novel nonparametric Bayesian model. The design of our framework can be extended easily to be adequate for IoT technology and notably for intelligent smart city web-based applications. In our method, we learn the patterns of the activities (both normal and anomalous) through a Bayesian-based MCMC inference for infinite bounded generalized Gaussian mixture models. Contrary to classic clustering methods, our approach does not need to specify the number of clusters, takes into consideration the uncertainty via the introduction of prior knowledge for the parameters of the model, and permits to solve problems related to over- and under-fitting. In order to get better clustering performance, feature weights, model’s parameters, and the number of clusters are estimated simultaneously and automatically. The developed approach was evaluated using popular data sets. The obtained results demonstrate the efficiency of our approach in detecting various attacks.","authors":["Wajdi Alhakami","Abdullah ALharbi","Sami Bourouis","Roobaea Alroobaea"],"meta":["January 2019IEEE Access 7:52181-52190","DOI:10.1109/ACCESS.2019.2912115"],"references":["330832354_Bayesian_frameworks_for_traffic_scenes_monitoring_via_view-based_3D_cars_models_recognition","330774221_Unsupervised_learning_of_finite_full_covariance_multivariate_generalized_Gaussian_mixture_models_for_human_activity_recognition","329581221_Deriving_Probabilistic_SVM_Kernels_From_Flexible_Statistical_Mixture_Models_and_its_Application_to_Retinal_Images_Classification","325322263_Bayesian_inference_by_reversible_jump_MCMC_for_clustering_based_on_finite_generalized_inverted_Dirichlet_mixtures","323320437_Image_and_video_denoising_by_combining_unsupervised_bounded_generalized_gaussian_mixture_modeling_and_spatial_information","327331938_A_Fixed-Point_Estimation_Algorithm_for_Learning_the_Multivariate_GGMM_Application_to_Human_Action_Recognition","326062495_Spatially_Constrained_Mixture_Model_with_Feature_Selection_for_Image_and_Video_Segmentation","325353183_Color_image_segmentation_with_bounded_generalized_Gaussian_mixture_model_and_feature_selection","320005214_Network_Anomaly_Detection_System_using_Genetic_Algorithm_and_Fuzzy_Logic","313863463_A_Survey_of_Intrusion_Detection_in_I_nternet_of_Things"]}