{"id":"332627246_A_Device_Performance_and_Data_Analytics_Concept_for_Smartphones'_IoT_Services_and_Machine-Type_Communication_in_Cellular_Networks","abstract":"With the advancement of new technologies, the number of connected devices, the amount of data generated, and the need to build an intelligently connected network of things to improve and enrich the human ecosystem open new doors to modifications and adaptations of current cellular network infrastructures. While more focus is given to low power wide area (LPWA) applications and devices, a significant challenge is the definition of Internet of Things (IoT) use cases and the value generation of applications on already existing IoT devices. Smartphones and related devices are currently manufactured with a wide range of smart sensors such as accelerometers, video sensors, compasses, gyros, proximity sensors, fingerprint sensors, temperature sensors, and biometric sensors used for various purposes. Many of these sensors can be automatically expanded to monitor a user's daily activities (e.g., fitness workouts), locations, movements, and real-time body temperatures. Mobile network operators (MNOs) play a substantial role in providing IoT communications platforms, as they manage traffic flow in the network. In this paper, we discuss the global concept of IoT and machine-type communication (MTC), and we conduct device performance analytics based on data traffic collected from a cellular network. The experiment equips service providers with a model and framework to monitor device performance in a network.","authors":["Kingsley Ogudo. A","Dahj Muwawa","Dahj Muwawa Jean Nestor","Osamah Ibrahem Khalaf"],"meta":["April 2019Symmetry 11(4)","DOI:10.3390/sym11040593","Projects: Traning , Encoding and Decoding Data Packets by Machine Learning and Artificial Intelligence and Its application in Blockchain Technology in Video Transmisions and TelecommunicationsMARCONI 2MARCONI 1"],"references":["327208154_Modeling_Of_An_Efficient_Low_Cost_Tree_Based_Data_Service_Quality_Management_For_Mobile_Operators_Using_In-Memory_Big_Data_Processing_And_Business_Intelligence_Use_Cases","327207832_Practical_Implementation_of_Machine_Learning_And_Predictive_Analytics_In_Cellular_Network_Transactions_In_Real_Time","319473451_A_mechanism_to_control_the_congestion_in_machine-to-machine_communication_in_LTE-A_networks","327207393_Practical_Implementation_of_Machine_Learning_And_Predictive_Analytics_In_Cellular_Network_Transactions_In_Real_Time","322004361_Smart_energy_metering_and_power_theft_control_using_arduino_GSM","318474683_Machine_to_Machine_Trust_in_Smart_Cities","318393858_R_A_Language_and_Environment_for_Statistical_Computing","317639490_A_navigation_and_reservation_based_smart_parking_platform_using_genetic_optimization_for_smart_cities","317573397_Toward_Enforcing_Network_Slicing_on_RAN_Flexibility_and_Resources_Abstraction","317071782_Data_Traffic_Model_in_Machine_to_Machine_Communications_over_5G_Network_Slicing"]}