{"id":"332658918_Second-order_autoregressive_model-based_Kalman_filter_for_the_estimation_of_a_slow_fading_channel_described_by_the_Clarke_model_Optimal_tuning_and_interpretation","abstract":"This paper treats the estimation of a flat fading Rayleigh channel with Jakes’ Doppler spectrum model and slow fading variations. A common method is to use a Kalman filter (KF) based on an auto-regressive model of order p (AR(p)). The parameters of the AR model can be simply tuned by using the correlation matching (CM) criterion. However, the major drawback of this method is that high orders are required to approach the Bayesian Cramer–Rao lower bound. The choice of p together with the tuning of the model parameters is thus critical, and a tradeoff must be found between the numerical complexity and the performance. The reasonable tradeoff arising from setting p=2 has received much attention in the literature. However, the methods proposed for tuning the model parameters are either based on an extensive grid-search analysis or experimental results, which limits their applicability. A general solution for any scenario is simply missing for p=2 and this paper aims at filling this gap. We propose using a Minimization of Asymptotic Variance (MAV) criterion, for which a general closed-form formula has been derived for the optimal tuning of the model and the mean square error. This provides deeper insight into the behavior of the KF with respect to the channel state (Doppler frequency and signal to noise ratio). Moreover, the paper interprets the proposed solution, especially the dependence of the shape of the optimal AR(2) spectrum on the channel state. Analytic and numerical comparisons with first- and second-order algorithms in the literature are also performed. Simulation results show that the proposed AR(2)-MAV model performs better than the literature and similarly to AR(p)-CM models with p≥15.","authors":["Ali el Husseini","E.P. Simon","L. Ros"],"meta":["April 2019Digital Signal Processing 90","DOI:10.1016/j.dsp.2019.04.008"],"references":["328908555_Estimation_of_UFMC_Time-Varying_Fading_Channel_Using_Adaptive_Filters","323158070_Fractional-order_algorithms_for_tracking_Rayleigh_fading_channels","311251929_Estimation_and_performance_-_Kalman_based_approach_A_review","292186628_Performance_of_a_digital_transmitter_leakage_LMS-based_cancellation_algorithm_for_multi-standard_radio-frequency_transceivers","277405384_AR-model_of_faded_MIMO_set-up_optimized_for_ITU_channels","326849157_Closed-Form_Approximation_for_the_Convergence_Time_of_pth-Order_Kalman_Filters","325864799_Joint_Carrier_Frequency_Offset_and_Doubly_Selective_Channel_Estimation_for_MIMO-OFDMA_Uplink_with_Kalman_and_Particle_Filtering","321904895_Bayesian_bounds_for_parameter_estimation_and_nonlinear_filteringtracking","308823559_Low_complexity_channel_estimation_using_fuzzy_Kalman_Filter_for_fast_time_varying_MIMO-OFDM_systems","268781169_On_the_solution_of_the_discrete_algebraic_Riccati_equation"]}