{"id":"332676137_An_innovative_hybrid_approach_for_extracting_named_entities_from_unstructured_text_data","abstract":"Named entity recognition (NER) is the core part of information extraction that facilitates the automatic detection and classification of entities in natural language text into predefined categories, such as the names of persons, organizations, locations, and so on. The output of the NER task is crucial for many applications, including relation extraction, textual entailment, machine translation, information retrieval, etc. Literature shows that machine learning and deep learning approaches are the most widely used techniques for NER. However, for entity extraction, the abovementioned approaches demand the availability of a domain‐specific annotated data set. Our goal is to develop a hybrid NER system composed of rule‐based deep learning as well as clustering‐based approaches, which facilitates the extraction of generic entities (such as person, location, and organization) out of natural language texts of domains that lack generic named entities labeled domain data sets. The proposed approach takes the advantages of both deep learning and clustering approaches but separately, in combination with a knowledge‐based approach by using a postprocessing module. We evaluated the proposed methodology on court cases (judgments) as a use case since it contains generic named entities of different forms that are poorly or not present in open‐source NER data sets. We also evaluated our hybrid models on two benchmark data sets, namely, Computational Natural Language Learning (CoNLL) 2003 and Open Knowledge Extraction (OKE) 2016. The experimental results obtained from benchmark data sets show that our hybrid models achieved substantially better performance in terms of the F‐score in comparison to other competitive systems.","authors":["Anu Thomas","Sangeetha S."],"meta":["April 2019Computational Intelligence 35(1)","DOI:10.1111/coin.12214","Project: Information Extraction"],"references":["318093829_Developing_an_innovative_entity_extraction_method_for_unstructured_data","317837337_A_rule-based_named-entity_recognition_method_for_knowledge_extraction_of_evidence-based_dietary_recommendations","313443663_Comparative_Study_of_CNN_and_RNN_for_Natural_Language_Processing","328163161_TIEx-A_Tool_for_Extracting_Structured_and_Semantic_Information_from_Text_Document","324256463_Phrase_Embedding_Learning_Based_on_External_and_Internal_Context_with_Compositionality_Constraint","323883066_Inter-Subdomain_Relation_Extraction_for_Agriculture_Domain","323861814_Information_extraction_on_novel_text_using_machine_learning_and_rule-based_system","322651048_Double_Hydrophilic_Block_Copolymer_Self-Assembly_in_Aqueous_Solution","321075249_Deep_Recurrent_Neural_Network_vs_Support_Vector_Machine_for_Aspect-Based_Sentiment_Analysis_of_Arabic_Hotels'_Reviews","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space"]}