{"id":"332692715_SANA_Sentiment_Analysis_on_Newspapers_comments_in_Algeria","abstract":"It is very current in today life to seek for tracking the people opinion from their interaction with occurring events. A very common way to do that is comments in articles published in newspapers web sites dealing with contemporary events. Sentiment analysis or opinion mining is an emergent field who's the purpose is finding the behind phenomenon masked in opinionated texts. We are interested in our work by comments in Algerian newspaper websites. For this end, two corpora were used; SANA and OCA. SANA corpus is created by collection of comments from three Algerian newspapers, and annotated by two Algerian Arabic native speakers, while OCA is a freely available corpus for sentiment analysis. For the classification we adopt Supports vector machines, naïve Bayes and k-nearest neighbors. Obtained results are very promising and show the different effects of stemming in such domain, also k-nearest neighbors gives important improvement comparing to other classifiers unlike similar works where SVM is the most dominant. From this study we observe the importance of dedicated resources and methods the newspaper comments sentiment analysis which we look forward in future works.","authors":["Hichem Rahab","Abdelhafid Zitouni","Mahieddine Djoudi"],"meta":["April 2019Journal of King Saud University - Computer and Information Sciences 33(7)","DOI:10.1016/j.jksuci.2019.04.012","Project: Arabic opinion mining"],"references":["330976368_Combining_RSS-SVM_with_genetic_algorithm_for_Arabic_opinions_analysis","330201729_Twitter_Benchmark_Dataset_for_Arabic_Sentiment_Analysis","318175802_Introduction_The_Handbook_of_Linguistic_Annotation","317139630_Document-level_sentiment_classification_using_hybrid_machine_learning_approach","311522750_Curras_an_annotated_corpus_for_the_Palestinian_Arabic_dialect","310611303_Data_and_text_mining_techniques_for_classifying_Arabic_tweet_polarity","320972135_Altruistic_Crowdsourcing_for_Arabic_Speech_Corpus_Annotation","319870745_ARAACOM_ARAbic_Algerian_Corpus_for_Opinion_Mining","319491828_SIAAC_Sentiment_Polarity_Identification_on_Arabic_Algerian_Newspaper_Comments","305034541_Extending_the_Knowledge_of_the_Arabic_Sentiment_Classification_Using_a_Foreign_External_Lexical_Source"]}