{"id":"332623468_The_Global_Fire_Atlas_of_individual_fire_size_duration_speed_and_direction","abstract":"Natural and human-ignited fires affect all major biomes, altering ecosystem structure, biogeochemical cycles and atmospheric composition. Satellite observations provide global data on spatiotemporal patterns of biomass burning and evidence for the rapid changes in global fire activity in response to land management and climate. Satellite imagery also provides detailed information on the daily or sub-daily position of fires that can be used to understand the dynamics of individual fires. The Global Fire Atlas is a new global dataset that tracks the dynamics of individual fires to determine the timing and location of ignitions, fire size and duration, and daily expansion, fire line length, speed, and direction of spread. Here, we present the underlying methodology and Global Fire Atlas results for 2003–2016 derived from daily moderate-resolution (500 m) Collection 6 MCD64A1 burned-area data. The algorithm identified 13.3 million individual fires over the study period, and estimated fire perimeters were in good agreement with independent data for the continental United States. A small number of large fires dominated sparsely populated arid and boreal ecosystems, while burned area in agricultural and other human-dominated landscapes was driven by high ignition densities that resulted in numerous smaller fires. Long-duration fires in boreal regions and natural landscapes in the humid tropics suggest that fire season length exerts a strong control on fire size and total burned area in these areas. In arid ecosystems with low fuel densities, high fire spread rates resulted in large, short-duration fires that quickly consumed available fuels. Importantly, multiday fires contributed the majority of burned area in all biomass burning regions. A first analysis of the largest, longest and fastest fires that occurred around the world revealed coherent regional patterns of extreme fires driven by large-scale climate forcing. Global Fire Atlas data are publicly available through http://www.globalfiredata.org (last access: 9 August 2018) and https://doi.org/10.3334/ORNLDAAC/1642, and individual fire information and summary data products provide new information for benchmarking fire models within ecosystem and Earth system models, understanding vegetation–fire feedbacks, improving global emissions estimates, and characterizing the changing role of fire in the Earth system.","authors":["Niels Andela","Douglas C. Morton","Louis Giglio","Ronan Paugam"],"meta":["April 2019Earth System Science Data 11(2):529-552","DOI:10.5194/essd-11-529-2019"],"references":["330075525_Development_of_a_Sentinel-2_burned_area_algorithm_Generation_of_a_small_fire_database_for_sub-Saharan_Africa","327729221_The_Collection_6_MODIS_burned_area_mapping_algorithm_and_product","326307437_FRY_a_global_database_of_fire_patch_functional_traits_derived_from_space-borne_burned_area_products","324655863_Using_the_Fire_Weather_Index_FWI_to_improve_the_estimation_of_fire_emissions_from_fire_radiative_power_FRP_observations","323151084_21st_Century_drought-related_fires_counteract_the_decline_of_Amazon_deforestation_carbon_emissions","322964672_Spatial_and_temporal_intercomparison_of_four_global_burned_area_products","331346826_How_well_do_global_burned_area_products_represent_the_fire_patterns_in_the_Brazilian_Savannas_biome_An_accuracy_assessment_of_the_MCD64_collections","330051198_Detection_rates_and_biases_of_fire_observations_from_MODIS_and_agency_reports_in_the_conterminous_United_States","326521051_Ground-Based_Field_Measurements_of_PM_25_Emission_Factors_From_Flaming_and_Smoldering_Combustion_in_Eucalypt_Forests","323325587_Spatial_and_Temporal_Variability_and_Trends_in_2001-2016_Global_Fire_Activity"]}