{"id":"332680571_Wireless_Communication_A_Conceptual_Model_of_IoT_Services_Success_for_Government_Agencies","abstract":"The Internet-of-Things (IoT) is a wireless technology that offers opportunities for Government-Agencies (GA) to improve services to citizens. However, the challenge is to ensure that the IoT is fully utilized as the real value of using IoT services comes from the establishments of services through effective utilization of technologies. This paper aims to develop a conceptual model for successful implementation of IoT services in GA which is one of the least essential studied aspects of utilization of Digital-Government services. This study proposes a new integrated success model that combines the dimensions of Technology-Readiness-Index (TRI) 2.0 with other success factors – service quality, information quality, system quality, user satisfaction, use (from DeLone&McLean Information-System-Success-Model), perceived usefulness (from Technology-Acceptance-Model), and trust construct to understand the determinants of IoT services success model in GA from the perspective of government officers. Interviews with Government-IoT experts are conducted to define and delineate the research problem. The proposed model could bring a better perspective of the critical factors that contribute to the success of IoT services implementation process particularly in GA as well as providing a groundwork for further empirical testing. Moreover, it will suggest an appropriate implementation mechanism to help GA increase the use of IoT services.","authors":["Norliza Binti Sidek","Nor’Ashikin Binti Ali","Romzie Bin Rosman"],"meta":["November 2018International Journal of Engineering & Technology 7(4.35):857","DOI:10.14419/ijet.v7i4.35.26270","Project: IoT-based Services Success Model for Government Agencies"],"references":["331642222_MEASURING_THE_DELONE_AND_MCLEAN_MODEL_OF_INFORMATION_SYSTEMS_SUCCESS_APPLIED_TO_BANKING_SECTOR_OF_TURKEY","329356057_The_moderating_Effect_of_User_Involvement_and_Self-Readiness_and_Factors_that_Influence_Information_System_Net_Benefits_among_Malaysian_Public_Sector_Employees","325520372_The_Prospect_of_Internet_of_Things_and_Big_Data_Analytics_in_Transportation_System","323447391_Modified_technology_acceptance_model_for_hospital_information_system_evaluation_-_a_case_study","323388900_Internet_of_Things_IoT_in_high-risk_Environment_Health_and_Safety_EHS_industries_A_comprehensive_review","322506319_Human_factors_for_IoT_services_utilization_for_health_information_exchange","325278947_Success_of_IoT_in_Smart_Cities_of_India_An_empirical_analysis","324256726_Healthcare_service_evolution_towards_the_Internet_of_Things_An_end-user_perspective","321737413_Examining_intention_to_adopt_to_internet_of_things_in_healthcare_technology_products","320541731_Toward_efficient_smartification_of_the_Internet_of_Things_IoT_services"]}