{"id":"332616180_A_full_convolutional_network_based_on_DenseNet_for_remote_sensing_scene_classification","abstract":"The convolutional neural networks (CNN) applied in remote sensing scene classification have two common problems. One is that these models have large number of parameters, which causes over-fitting easily. The other is that the network is not deep enough, thus more abstract semantic information cannot be extracted. To solve these two problems, we propose a simple and efficient full convolutional network based on DenseNet for remote sensing scene classification. We construct a small number of convolutional kernels to generate a large number of reusable feature maps by dense connections, which makes the network deeper, but does not increase the number of parameters significantly. Our network is so deep that it has more than 100 layers. However, it has only about 7 million parameters, which is far less than the number of VGG’s parameters. Then we incorporate an adaptive average 3D pooling operation in our network. This operation fixes feature maps of size 7 × 7 from the last DenseBlock to 1 × 1 and decreases the number of channels from 1024 to 512, thus the whole network can accept input images with different sizes. Furthermore, we design the convolutional layer instead of the fully connected layer that is used as a classifier usually, so that the output features of the network can be classified without flattening operation, which simplifies the classification operation. Finally, a good model is trained by exploiting pre-trained weights and data augmentation technology. Compared with several state-of-the-art algorithms, our algorithm improves classification performance significantly on UCM dataset, AID dataset, OPTIMAL-31 dataset and NWPU-RESISC45 dataset.","authors":["Jianming Zhang","Chaoquan Lu","Xudong Li","Hye-Jin Kim"],"meta":["April 2019Mathematical biosciences and engineering: MBE 16(5):3345-3367","DOI:10.3934/mbe.2019167"],"references":["329898301_A_Fast_Object_Tracker_Based_on_Integrated_Multiple_Features_and_Dynamic_Learning_Rate","327188485_Spatial_and_semantic_convolutional_features_for_robust_visual_object_tracking","326575290_Dense_Connectivity_Based_Two-Stream_Deep_Feature_Fusion_Framework_for_Aerial_Scene_Classification","330996959_Segmentation_of_digital_rock_images_using_deep_convolutional_autoencoder_networks","330267598_Image-based_velocity_estimation_of_rock_using_Convolutional_Neural_Networks","328423533_Improved_VGG_Model_for_Road_Traffic_Sign_Recognition","327459374_Scene_Classification_With_Recurrent_Attention_of_VHR_Remote_Sensing_Images","326254158_Reversible_natural_language_watermarking_using_synonym_substitution_and_arithmetic_coding","325699293_Semi-supervised_learning_with_generative_adversarial_networks_on_digital_signal_modulation_classification","325554645_Adversarial_learning_for_distant_supervised_relation_extraction"]}