{"id":"332637795_Examining_the_Limits_of_Predictability_of_Human_Mobility","abstract":"We challenge the upper bound of human-mobility predictability that is widely used to corroborate the accuracy of mobility prediction models. We observe that extensions of recurrent-neural network architectures achieve significantly higher prediction accuracy, surpassing this upper bound. Given this discrepancy, the central objective of our work is to show that the methodology behind the estimation of the predictability upper bound is erroneous and identify the reasons behind this discrepancy. In order to explain this anomaly, we shed light on several underlying assumptions that have contributed to this bias. In particular, we highlight the consequences of the assumed Markovian nature of human-mobility on deriving this upper bound on maximum mobility predictability. By using several statistical tests on three real-world mobility datasets, we show that human mobility exhibits scale-invariant long-distance dependencies, contrasting with the initial Markovian assumption. We show that this assumption of exponential decay of information in mobility trajectories, coupled with the inadequate usage of encoding techniques results in entropy inflation, consequently lowering the upper bound on predictability. We highlight that the current upper bound computation methodology based on Fano’s inequality tends to overlook the presence of long-range structural correlations inherent to mobility behaviors and we demonstrate its significance using an alternate encoding scheme. We further show the manifestation of not accounting for these dependencies by probing the mutual information decay in mobility trajectories. We expose the systematic bias that culminates into an inaccurate upper bound and further explain as to why the recurrent-neural architectures, designed to handle long-range structural correlations, surpass this upper limit on human mobility predictability.","authors":["Vaibhav Kulkarni","Abhijit Mahalunkar","Benot Garbinato","John D. Kelleher"],"meta":["April 2019Entropy 21(4):432","DOI:10.3390/e21040432"],"references":["322243714_Recent_Advances_in_Recurrent_Neural_Networks","318172642_An_alternative_approach_to_the_limits_of_predictability_in_human_mobility","317865834_Critical_Behavior_in_Physics_and_Probabilistic_Formal_Languages","334116459_Sharp_Nearby_Fuzzy_Far_Away_How_Neural_Language_Models_Use_Context","330754993_Estimating_the_Entropy_Rate_of_Finite_Markov_Chains_With_Application_to_Behavior_Studies","328207819_The_scale_of_predictability","328008508_Using_Regular_Languages_to_Explore_the_Representational_Capacity_of_Recurrent_Neural_Architectures","321025515_Estimating_the_Entropy_Rate_of_Finite_Markov_Chains_with_Application_to_Behavior_Studies","320056981_Extracting_Hotspots_without_A-priori_by_Enabling_Signal_Processing_over_Geospatial_Data","319770231_Pointer_Sentinel_Mixture_Models"]}