{"id":"332699763_Deep_Learning_for_Hyperspectral_Image_Classification_An_Overview","abstract":"Hyperspectral image (HSI) classification has become a hot topic in the field of remote sensing. In general, the complex characteristics of hyperspectral data make the accurate classification of such data challenging for traditional machine learning methods. In addition, hyperspectral imaging often deals with an inherently nonlinear relation between the captured spectral information and the corresponding materials. In recent years, deep learning has been recognized as a powerful feature-extraction tool to effectively address nonlinear problems and widely used in a number of image processing tasks. Motivated by those successful applications, deep learning has also been introduced to classify HSIs and demonstrated good performance. This survey paper presents a systematic review of deep learning-based HSI classification literatures and compares several strategies for this topic. Specifically, we first summarize the main challenges of HSI classification which cannot be effectively overcome by traditional machine learning methods, and also introduce the advantages of deep learning to handle these problems. Then, we build a framework that divides the corresponding works into spectral-feature networks, spatial-feature networks, and spectral-spatial-feature networks to systematically review the recent achievements in deep learning-based HSI classification. In addition, considering the fact that available training samples in the remote sensing field are usually very limited and training deep networks require a large number of samples, we include some strategies to improve classification performance, which can provide some guidelines for future studies on this topic. Finally, several representative deep learning-based classification methods are conducted on real HSIs in our experiments.","authors":["Shutao Li","Weiwei Song","Leyuan Fang","Yushi Chen"],"meta":["April 2019IEEE Transactions on Geoscience and Remote Sensing PP(99):1-20","DOI:10.1109/TGRS.2019.2907932"],"references":["327922062_New_Frontiers_in_Spectral-Spatial_Hyperspectral_Image_Classification_The_Latest_Advances_Based_on_Mathematical_Morphology_Markov_Random_Fields_Segmentation_Sparse_Representation_and_Deep_Learning","331623697_Deep_Hashing_Neural_Networks_for_Hyperspectral_Image_Feature_Extraction","331600148_Cascaded_Recurrent_Neural_Networks_for_Hyperspectral_Image_Classification","328821233_Unsupervised_Feature_Extraction_in_Hyperspectral_Images_Based_on_Wasserstein_Generative_Adversarial_Network","328528239_Capsule_Networks_for_Hyperspectral_Image_Classification","327637318_Hyperspectral_Image_Classification_With_Squeeze_Multibias_Network","327215979_Deep_Pyramidal_Residual_Networks_for_Spectral-Spatial_Hyperspectral_Image_Classification","327080377_Feature_Extraction_With_Multiscale_Covariance_Maps_for_Hyperspectral_Image_Classification","325936205_Exploring_Hierarchical_Convolutional_Features_for_Hyperspectral_Image_Classification","325890477_Active_Learning_With_Convolutional_Neural_Networks_for_Hyperspectral_Image_Classification_Using_a_New_Bayesian_Approach"]}