{"id":"332662596_A_Distributed_Swarm_Optimizer_With_Adaptive_Communication_for_Large-Scale_Optimization","abstract":"Large-scale optimization with high dimensionality and high computational cost becomes ubiquitous nowadays. To tackle such challenging problems efficiently, devising distributed evolutionary computation algorithms is imperative. To this end, this paper proposes a distributed swarm optimizer based on a special master-slave model. Specifically, in this distributed optimizer, the master is mainly responsible for communication with slaves, while each slave iterates a swarm to traverse the solution space. An asynchronous and adaptive communication strategy based on the request-response mechanism is especially devised to let the slaves communicate with the master efficiently. Particularly, the communication between the master and each slave is adaptively triggered during the iteration. To aid the slaves to search the space efficiently, an elite-guided learning strategy is especially designed via utilizing elite particles in the current swarm and historically best solutions found by different slaves to guide the update of particles. Together, this distributed optimizer asynchronously iterates multiple swarms to collaboratively seek the optimum in parallel. Extensive experiments on a widely used large-scale benchmark set substantiate that the distributed optimizer could: 1) achieve competitive effectiveness in terms of solution quality as compared to the state-of-the-art large-scale methods; 2) accelerate the execution of the algorithm in comparison with the sequential one and obtain almost linear speedup as the number of cores increases; and 3) preserve a good scalability to solve higher dimensional problems.","authors":["Qiang Yang","Wei-neng Chen","Gu Tianlong","Huaxzhang Zhang"],"meta":["April 2019IEEE Transactions on Cybernetics PP(99):1-16","DOI:10.1109/TCYB.2019.2904543","Project: huaxiang zhang"],"references":["330462239_A_Cooperative_Co-Evolutionary_Approach_to_Large-Scale_Multisource_Water_Distribution_Network_Optimization","328549029_ACO-A_Ant_Colony_Optimization_Plus_A_for_3D_Traveling_in_Environments_with_Dense_Obstacles","321765332_An_Adaptive_Estimation_of_Distribution_Algorithm_for_Multi-Policy_Insurance_Investment_Planning","321358257_A_Recursive_Decomposition_Method_for_Large_Scale_Continuous_Optimization","319497669_A_Level-Based_Learning_Swarm_Optimizer_for_Large-Scale_Optimization","327768228_Evolution_Consistency_Based_Decomposition_for_Cooperative_Coevolution","323927038_Distributed_Cooperative_Co-Evolution_With_Adaptive_Computing_Resource_Allocation_for_Large_Scale_Optimization","320182358_The_Origin_of_Species","313749844_Particle_swarm_optimization","313636056_A_modified_particle_swarm_optimizer"]}