{"id":"332614548_The_role_of_subject_presence_type_on_student_motivation_in_a_PBL_learning_environment","abstract":"Students have been observed as underprepared or skipping steps during the problem-based learning (PBL) process due to fatigue or low motivation, potentially creating a barrier for effective learning. One way to explore resolving this issue is to consider whether variables of problem scenario design can be altered to optimize motivation. This mixed method study considered the impact of presentation modality of the PBL problem subject (i.e., the key character involved in the problem) on student motivation within the context of Speech and Voice Science curricula for forty-six undergraduate students at a midwestern, US university. The frequency of verbal and non-verbal engagement behaviors was monitored during four consecutive PBL problems. The problems were designed to provide increasing levels of social presence and used varied case presentation modalities (e.g., paper, audio-visual, face to face). Although the frequency of engagement behaviors declined during the study and fatigue appeared to play a role, most students identified problems with combination of higher subject presence (i.e., audio-visual, face-to-face) and challenging content as motivating. Students were able to develop a sense of ownership and responsibility for their problem-solving efforts with a problem designed with direct interaction (i.e., face to face) with the problem subject. This study sheds light on the impact of affective problem features (e.g., emotion, personal psychological connection) on students’ motivation in the presence of fatigue, which is often undervalued during the design of PBL modules.","authors":["Elaine Pyle","Woei Hung"],"meta":["October 2019Advances in Health Sciences Education 24(1)","DOI:10.1007/s10459-019-09889-2"],"references":["305803021_All_PBL_starts_here_The_problem","296480886_Using_Standardized_Patients_vs_Video_Cases_for_Representing_Clinical_Problems_in_Problem-Based_Learning","278722219_Learning_Theories_and_Problem-Based_Learning","278716228_A_Self-determination_Theory_Perspective_on_Student_Engagement","343924606_OVERVIEW_OF_PROBLEM-BASED_LEARNING_DEFINITIONS_AND_DISTINCTIONS","333160470_Problem_Design_in_PBL","333159512_The_Wiley_Handbook_of_Problem-Based_Learning","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","284890181_New_directions_for_teaching_and_learning_Vol_68_Bringing_problem-based_learning_to_higher_education_Theory_and_practice","283762612_A_review_of_the_instructional_practices_for_promoting_online_learning_communities","267844210_Problem-based_Learning_Revisited_introduction_of_Active_and_Self-directed_Learning_to_reduce_fatigue_among_students","257810235_The_Relationships_Between_Problem_Design_and_Learning_Process_in_Problem-Based_Learning_Environments_Two_Cases","276241257_New_Approaches_to_Problem-Based_Learning_Revitalizing_Your_Practice_in_Higher_Education","271154029_Creating_a_Learning_Space_in_Problem-based_Learning","245968667_Problem-Based_Learning_A_Review_of_Literature_on_Its_Outcomes_and_Implementation_Issues"]}