{"id":"332683294_La_ensenanza_de_los_arrays_estaticos_dinamicos_y_listas_enlazadas_cual_usar_Analisis_de_codigos_The_teaching_of_static_arrays_dynamics_and_linked_lists_What_to_use_Code_analysis","abstract":"Resumen El presente trabajo, encaminado a profesores de programación, programadores, estudiantes de Ingeniería Informática y de Ciencias de la Computación, tiene como objetivo argumentar las potencialidades que brindan las listas enlazadas al compararlas con los arrays de tamaño estático y los arrays dinámicos, estructuras que históricamente han coexistido en los lenguajes de programación más empleados. Se obtuvieron los algoritmos y códigos para la creación, impresión, borrado y búsqueda de elementos en las estructuras de datos mencionadas, con el uso de los lenguajes de programación Java y C# y para ello se aplicaron métodos de investigación científica, entre ellos: El análisis documental, la modelación, enfoque de sistema, la observación, las tormentas de ideas unido a las experiencias de los autores como profesores de programación. Entre las conclusiones se pudo constatar que tanto las listas contiguas como las enlazadas se emplean cuando se desconoce la cantidad de elementos con las que trabajará un programa, y que la selección del tipo de lista (simple, doble, circular) depende de las exigencias del problema, el lenguaje de programación y los conocimientos del programador, y por otro lado, los arrays de tamaño estático se emplean cuando se conoce de antemano la cantidad de elementos que se almacenarán, y esa cantidad no corre el riesgo de ser alterada en tiempo de ejecución del programa. También, se formularon un conjunto de recomendaciones válidas para alumnos, profesores de programación y programadores.","authors":["Juan Carlos Fonden Calzadilla","Fonden Calzadilla","Agustín Navarrete Herrera","Edgar Delfino Tchissingui"],"meta":["April 2019","Project: Enseñanza de la Programación"],"references":["331438854_Problemas_de_ensenanza_y_aprendizaje_de_los_fundamentos_de_programacion_Problems_of_teaching_and_learning_the_basics_of_programming_Problemas_de_ensino_e_aprendizagem_dos_fundamentos_de_programacao"]}