{"id":"332658101_A_review_on_the_self_and_dual_interactions_between_machine_learning_and_optimisation","abstract":"Machine learning and optimisation are two growing fields of artificial intelligence with an enormous number of computer science applications. The techniques in the former area aim to learn knowledge from data or experience, while the techniques from the latter search for the best option or solution to a given problem. To employ these techniques automatically and effectively aligning with the real aim of artificial intelligence, both sets of techniques are frequently hybridised, interacting with each other and themselves. This study focuses on such interactions aiming at (1) presenting a broad overview of the studies on self and dual interactions between machine learning and optimisation; (2) providing a useful tutorial for researchers and practitioners in both fields in support of collaborative work through investigation of the recent advances and analyses of the advantages and disadvantages of different techniques to tackle the same or similar problems; (3) clarifying the overlapping terminologies having different meanings used in both fields; (4) identifying research gaps and potential research directions.","authors":["Heda Song","Isaac Triguero","Ender Özcan"],"meta":["April 2019Progress in Artificial Intelligence 8(1)","DOI:10.1007/s13748-019-00185-z"],"references":["332366904_Meta_Inverse_Reinforcement_Learning_via_Maximum_Reward_Sharing_for_Human_Motion_Analysis","338681645_Automated_Machine_Learning_-_Methods_Systems_Challenges","333181674_Meta-Learning","329740443_Few-Shot_Image_Recognition_by_Predicting_Parameters_from_Activations","329740353_Learning_to_Compare_Relation_Network_for_Few-Shot_Learning","329200331_Automated_Algorithm_Selection_Survey_and_Perspectives","328554450_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","326898608_Applying_Algorithm_Selection_-_a_Case_Study_for_the_Generalised_Assignment_Problem","325558636_Multiobjective_Metaheuristic_to_Design_RNA_Sequences","324634396_A_Taxonomy_for_Metamodeling_Frameworks_for_Evolutionary_Multi-Objective_Optimization"]}