{"id":"332649063_Revisiting_the_Isoperimetric_Graph_Partitioning_Problem","abstract":"Isoperimetric graph partitioning, which is also known as the Cheeger cut, is NP-hard in its original form. In the literature, multiple modifications to this problem have been proposed to obtain approximation algorithms for clustering applications. In the context of image segmentation, a heuristic continuous relaxation to this problem introduced by Leo Grady and Eric L. Schwartz has yielded good quality results. This algorithm is based on solving a linear system of equations involving the Laplacian of the image graph. Furthermore, the same algorithm applied to a maximum spanning tree (MST) of the image graph was shown to produce similar results at a much lesser computational cost. However, the data reduction step (i.e., considering an MST, a much sparser graph compared to the original graph) leading to a faster yet useful algorithm has not been analyzed. In this paper, we revisit the isoperimetric graph partitioning problem and rectify a few discrepancies in the simplifications of the heuristic continuous relaxation, leading to a better interpretation of what is really done by this algorithm. We then use the power watershed (PW) framework to show that is enough to solve the relaxed isoperimetric graph partitioning problem on the graph induced by the union of MSTs (UMST) with a seed constraint. The UMST has a lesser number of edges compared to the original graph, thus improving the speed of sparse matrix multiplication. Furthermore, given the interest of PW framework in solving the relaxed seeded isoperimetric partitioning problem, we discuss the links between the PW limit of the discrete isoperimetric graph partitioning and watershed cuts. We then illustrate with experiments, a detailed comparison of solutions to the relaxed seeded isoperimetric partitioning problem on the original graph with the ones on the UMST and an MST. Our study opens many research directions, which are discussed in the conclusion section.","authors":["Sravan Danda","Aditya Challa","B. S Daya Sagar","Laurent Najman"],"meta":["January 2019IEEE Access 7:50636-50649","DOI:10.1109/ACCESS.2019.2901094"],"references":["329464274_Some_Theoretical_Links_Between_Shortest_Path_Filters_and_Minimum_Spanning_Tree_Filters","324441806_Graph_and_Nonlocal_Framework","321793008_Power_spectral_clustering_on_hyperspectral_data","321414436_Extending_the_Power_Watershed_Framework_Thanks_to_Gamma-Convergence","320438053_Convex_Regularization_of_Multi-Channel_Images_Based_on_Variants_of_the_TV-Model","319215171_An_Introduction_to_Gamma-Convergence_for_Spectral_Clustering","317798075_Modified_Cheeger_and_ratio_cut_methods_using_the_Ginzburg-Landau_functional_for_classification_of_high-dimensional_data","316048472_Power_Tree_Filter_A_Theoretical_Framework_Linking_Shortest_Path_Filters_and_Minimum_Spanning_Tree_Filters","313487833_A_tutorial_on_spectral_clustering","313078619_Applications_of_parametric_maxflow_in_computer_vision"]}