{"id":"332665941_A_Survey_of_Techniques_for_Mobile_Service_Encrypted_Traffic_Classification_Using_Deep_Learning","abstract":"The rapid adoption of mobile devices has dramatically changed the access to various networking services and led to explosion of mobile service traffic. Mobile service traffic classification has been a crucial task that attracts strong interest in mobile network management and security as well as machine learning communities for past decades. However, with more and more adoptions of encryption over mobile services, it brings a lot of challenges about mobile traffic classification. Although classical machine learning approaches can solve many issues that port and payload based methods cannot solve, it still has some limitations, such as time-consuming and costly handcrafted features, frequent features update. With the excellent ability of automatic feature learning, Deep Learning (DL) undoubtedly becomes a highly desirable approach for mobile services traffic classification, especially encrypted traffic. This survey paper looks at emerging research into the application of DL methods to encrypted traffic classification of mobile services and presents a general framework of Deep Learning based mobile encrypted traffic classification. Moreover, we review most of the recent existing work according to dataset selection, model input design and model architecture, etc. Furthermore, we propose some noteworthy issues and challenges about DL based mobile services traffic classification.","authors":["Pan Wang","Xuejiao Chen","Feng Ye","Sun Zhixin"],"meta":["April 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2912896","Project: Traffic identification"],"references":["331272016_A_Novel_QUIC_Traffic_Classifier_Based_on_Convolutional_Neural_Networks","330863909_Exploratory_Study_on_Class_Imbalance_and_Solutions_for_Network_Traffic_Classification","328305824_MuseGAN_Multi-track_Sequential_Generative_Adversarial_Networks_for_Symbolic_Music_Generation_and_Accompaniment","327921741_DataNet_Deep_Learning_based_Encrypted_Network_Traffic_Classification_in_SDN_Home_Gateway","325434551_A_Smart_Automated_Signature_Extraction_Scheme_for_Mobile_Phone_Number_in_Human-Centered_Smart_Home_Systems","325367588_Bringing_a_GAN_to_a_Knife-Fight_Adapting_Malware_Communication_to_Avoid_Detection","324218934_A_Smart_Home_Gateway_Platform_for_Data_Collection_and_Awareness","323988691_Smart_Devices_Information_Extraction_in_Home_Wi-Fi_Networks","329317286_An_Effective_Deep_Learning_Based_Scheme_for_Network_Intrusion_Detection","325437219_Performance_Modeling_and_Suitability_Assessment_of_Data_Center_Based_on_Fog_Computing_in_Smart_Systems"]}