{"id":"332640782_A_Combined_Model_Based_on_Feature_Selection_and_WOA_for_PM25_Concentration_Forecasting","abstract":"As people pay more attention to the environment and health, P M 2.5 receives more and more consideration. Establishing a high-precision P M 2.5 concentration prediction model is of great significance for air pollutants monitoring and controlling. This paper proposed a hybrid model based on feature selection and whale optimization algorithm (WOA) for the prediction of P M 2.5 concentration. The proposed model included five modules: data preprocessing module, feature selection module, optimization module, forecasting module and evaluation module. Firstly, signal processing technology CEEMDAN-VMD (Complete Ensemble Empirical Mode Decomposition with Adaptive Noise and Variational Mode Decomposition) is used to decompose, reconstruct, identify and select the main features of P M 2.5 concentration series in data preprocessing module. Then, AutoCorrelation Function (ACF) is used to extract the variables which have relatively large correlation with predictor, so as to select input variables according to the order of correlation coefficients. Finally, Least Squares Support Vector Machine (LSSVM) is applied to predict the hourly P M 2.5 concentration, and the parameters of LSSVM are optimized by WOA. Two experiment studies reveal that the performance of the proposed model is better than benchmark models, such as single LSSVM model with default parameters optimization, single BP neural networks (BPNN), general regression neural network (GRNN) and some other combined models recently reported.","authors":["Fang Zhao","Weide Li"],"meta":["April 2019Atmosphere 10(4):223","DOI:10.3390/atmos10040223","Project: Machine Learning and its application"],"references":["327876772_Short-Term_PM25_Forecasting_Using_Exponential_Smoothing_Method_A_Comparative_Analysis","325808855_A_dynamic_multiple_equation_approach_for_forecasting_PM25_pollution_in_Santiago_Chile","325613236_Prediction_of_daily_PM25_concentration_in_China_using_partial_differential_equations","324698665_A_Hybrid_Seasonal_Mechanism_with_a_Chaotic_Cuckoo_Search_Algorithm_with_a_Support_Vector_Regression_Model_for_Electric_Load_Forecasting","324686305_Development_of_a_stacked_ensemble_model_for_forecasting_and_analyzing_daily_average_PM25_concentrations_in_Beijing_China","329031993_Forecasting_concentrations_of_PM25_in_main_urban_area_of_Hangzhou_and_mapping_using_SARIMA_model_and_ordinary_Kringing_method","325519674_Highly_Efficient_Picture-Based_Prediction_of_PM25_Concentration","325340994_Forecasting_PM_10_hourly_concentrations_in_northern_Italy_Insights_on_models_performance_and_PM_10_drivers_through_self-organizing_maps","325291450_Short_term_load_forecasting_based_on_phase_space_reconstruction_algorithm_and_bi-square_kernel_regression_model","324268121_PM_25_forecasting_using_SVR_with_PSOGSA_algorithm_based_on_CEEMD_GRNN_and_GCA_considering_meteorological_factors"]}