{"id":"332659226_A_Comparative_Study_on_Brain_Tumor_Diagnosis_Techniques_Using_MRI_Image_Processing","abstract":"Image processing is a technique to carry out certain operations on an image so as to obtain some helpful information from it i.e., an enhanced image would be more advantageous. It is a similar to that of signal processing where input would be the image and the output obtained through this processing would be attributes/characteristics corresponding to that image. Currently, Image processing is one among the trending technologies. It is definitely one significant study area in the fields of engineering and computer science. Medical images have a vital role in the diagnosis of disorders & for checking the accurate functioning of organs. Hence, this is an active research area where several methods are being used and developed in order to make diagnosis facile. This medicinal imaging technology gave the doctors an insight for diagnosis of internal parts of the body. Also it helped doctors in performing Minimally Invasive Surgery, more commonly called as the keyhole surgeries which is done by inserting long and thin instruments into the body through small incisions to reach the internal organs instead of traditional operation techniques. The brain is the utmost important internal organ in our body and tumors effecting it could be very critical and hazardous situation. The brain tumor is a soft intracranial mass made up by irregular growth of cells of the tissue in the brain or around the brain. MRI Imaging play a vital role in brain tumors for evaluation, diagnosis and treatment arrangement.","authors":["Pradeepini Gera","B Sekhar Babu","T. Tejaswini","D Priyanka"],"meta":["May 2018International Journal of Engineering & Technology 7(2.32):486","DOI:10.14419/ijet.v7i2.32.16274"],"references":["317547838_A_Review_Paper_on_Brain_Tumor_Segmentation_and_Detection","314257965_Image_Analysis_for_MRI_Based_Brain_Tumor_Detection_and_Feature_Extraction_Using_Biologically_Inspired_BWT_and_SVM","281063580_Improved_Edge_Detection_Algorithm_for_Brain_Tumor_Segmentation","273258945_Brain_tumor_segmentation_based_on_a_hybrid_clustering_technique","320653801_Brain_tumor_classification_using_mixed_method_approach","319645298_Neuroendoscopy_Adapter_Module_Development_for_Better_Brain_Tumor_Image_Visualization","315922311_Noise_Removal_and_Filtering_Techniques_used_in_Medical_Images","309109359_A_Texture_based_Tumor_detection_and_automatic_Segmentation_using_Seeded_Region_Growing_Method","308828809_Brain_tumor_diagnosis_from_MRI_feature_analysis_-_A_comparative_study","303369339_Boundary_detection_algorithm_for_brain_tumor_position_and_area_detection_using_OPENCV","261764790_Fuzzy_anisotropic_diffusion_based_segmentation_and_texture_based_ensemble_classification_of_brain_tumor","12039763_Segmentation_of_Brain_MR_Images_through_a_Hidden_Markov_Random_Field_Model_and_the_Expectation_Maximization_Algorithm"]}