{"id":"332695483_Satisfiability_Calculus_An_Abstract_Formulation_of_Semantic_Proof_Systems","abstract":"The theory of institutions, introduced by Goguen and Burstall in 1984, can be thought of as an abstract formulation of model theory. This theory has been shown to be particularly useful in computer science, as a mathematical foundation for formal approaches to software construction. Institution theory was extended by a number of researchers, José Meseguer among them, who, in 1989, presented General Logics, wherein the model theoretical view of institutions is complemented by providing (categorical) structures supporting the proof theory of any given logic. In other words, Meseguer introduced the notion of proof calculus as a formalisation of syntactical deduction, thus \"implementing\" the entailment relation of a given logic. In this paper we follow the approach initiated by Goguen and introduce the concept of Satisfiability Calculus. This concept can be regarded as the semantical counterpart of Meseguer's notion of proof calculus, as it provides the formal foundations for those proof systems that resort to model construction techniques to prove or disprove a given formula, thus \"implementing\" the satisfiability relation of an institution. These kinds of semantic proof methods have gained a great amount of interest in computer science over the years, as they provide the basic means for many automated theorem proving techniques.","authors":["Carlos Gustavo Lopez Pombo","Pablo F. Castro","Nazareno M. Aguirre","Thomas S.E. Maibaum"],"meta":["April 2019Fundamenta Informaticae 166(4):297-347","DOI:10.3233/FI-2019-1804","Project: Heterogeneous specification and design of software artefacts"],"references":["329498249_Heterogeneous_Structured_Specifications_in_Logics_Without_Interpolation","305953366_Goal-Conflict_Detection_Based_on_Temporal_Satisfiability_Checking","277940679_Categorical_foundations_for_structured_specifications_in_Z","313596653_Untersuchungen_fiber_das_logische_Schliessen","289302151_Kan_Extensions_of_Institutions","284528353_A_Machine-Oriented_Logic_based_on_the_Resolution_Principle","275980738_The_Foundations_of_Mathematics","266592690_Semantical_Considerations_on_Modal_Logic","243780332_Semantic_Entailment_and_Formal_Derivability","243702441_FORK_ALGEBRAS_AS_ALGEBRAS_OF_LOGIC","243700228_Investigations_in_proof_theory","242909357_First-Order_Modal_Logic","239665785_Cambridge_tracts_in_theoretical_computer_science","238719836_The_Collected_Papers_of_Gerard_Gentzen","237128841_The_Temporal_Logic_of_Reactive_and_Concurrent_Systems_Safety"]}