{"id":"332742446_Neighbourhood_contacts_and_trade_movements_drive_the_regional_spread_of_bovine_viral_diarrhoea_virus_BVDV","abstract":"To explore the regional spread of endemic pathogens, investigations are required both at within and between population levels. The bovine viral diarrhoea virus (BVDV) is such a pathogen, spreading among cattle herds mainly due to trade movements and neighbourhood contacts, and causing an endemic disease with economic consequences. To assess the contribution of both transmission routes on BVDV regional and local spread, we developed an original epidemiological model combining data-driven and mechanistic approaches, accounting for heterogeneous within-herd dynamics, animal movements and neighbourhood contacts. Extensive simulations were performed over 9 years in an endemic context in a French region with high cattle density. The most uncertain model parameters were calibrated on summary statistics of epidemiological data, highlighting that neighbourhood contacts and within-herd transmission should be high. We showed that neighbourhood contacts and trade movements complementarily contribute to BVDV spread on a regional scale in endemically infected and densely populated areas, leading to intense fade-out/colonization events: neighbourhood contacts generate the vast majority of outbreaks (72%) but mostly in low immunity herds and correlated to a rather short presence of persistently infected animals (P); trade movements generate fewer infections but could affect herds with higher immunity and generate a prolonged presence of P. Both movements and neighbourhood contacts should be considered when designing control or eradication strategies for densely populated region.","authors":["Luyuan Qi","Gael Beaunée","Sandie Arnoux","Bhagat Lal Dutta"],"meta":["December 2019Veterinary Research 50(1)","DOI:10.1186/s13567-019-0647-x"],"references":["315777123_Quantifying_the_roles_of_host_movement_and_vector_dispersal_in_the_transmission_of_vector-borne_diseases_of_livestock","312183075_Analysis_of_the_Spatial_Organization_of_Pastures_as_a_Contact_Network_Implications_for_Potential_Disease_Spread_and_Biosecurity_in_Livestock_France_2010","306074864_Data-driven_network_modelling_of_disease_transmission_using_complete_population_movement_data_spread_of_VTEC_O157_in_Swedish_cattle","300032973_Spread_of_Coxiella_burnetii_between_dairy_cattle_herds_in_an_enzootic_region_Modelling_contributions_of_airborne_transmission_and_trade","290508702_Evidence_of_shared_bovine_viral_diarrhea_infections_between_red_deer_and_extensively_raised_cattle_in_south-central_Spain","330836515_Farm_productive_contexts_and_the_dynamics_of_bovine_viral_diarrhea_BVD_transmission","321273559_Eradicating_BVD_reviewing_Irish_programme_data_and_model_predictions_to_support_prospective_decision_making","319871665_Controlling_bovine_paratuberculosis_at_a_regional_scale_Towards_a_decision_modelling_tool","299356290_Presente_y_futuro_de_la_lucha_contra_el_virus_de_la_diarrea_viral_bovina_en_Europa","291419969_Quantifying_the_risk_of_spread_of_bovine_viral_diarrhoea_virus_BVDV_between_contiguous_herds_in_Ireland"]}