{"id":"332786049_Information_diffusion_backbones_in_temporal_networks","abstract":"Progress has been made in understanding how temporal network features affect the percentage of nodes reached by an information diffusion process. In this work, we explore further: which node pairs are likely to contribute to the actual diffusion of information, i.e., appear in a diffusion trajectory? How is this likelihood related to the local temporal connection features of the node pair? Such deep understanding of the role of node pairs is crucial to tackle challenging optimization problems such as which kind of node pairs or temporal contacts should be stimulated in order to maximize the prevalence of information spreading. We start by using Susceptible-Infected (SI) model, in which an infected (information possessing) node could spread the information to a susceptible node with a given infection probability β whenever a contact happens between the two nodes, as the information diffusion process. We consider a large number of real-world temporal networks. First, we propose the construction of an information diffusion backbone GB(β) for a SI spreading process with an infection probability β on a temporal network. The backbone is a weighted network where the weight of each node pair indicates how likely the node pair appears in a diffusion trajectory starting from an arbitrary node. Second, we investigate the relation between the backbones with different infection probabilities on a temporal network. We find that the backbone topology obtained for low and high infection probabilities approach the backbone GB(β → 0) and GB(β = 1), respectively. The backbone GB(β → 0) equals the integrated weighted network, where the weight of a node pair counts the total number of contacts in between. Finally, we explore node pairs with what local connection features tend to appear in GB(β = 1), thus actually contribute to the global information diffusion. We discover that a local connection feature among many other features we proposed, could well identify the (high-weight) links in GB(β = 1). This local feature encodes the time that each contact occurs, pointing out the importance of temporal features in determining the role of node pairs in a dynamic process.","authors":["Xiu-Xiu Zhan","Alan Hanjalic","Huijuan Wang"],"meta":["May 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-43029-5"],"references":["330672289_Coevolution_spreading_in_complex_networks","324390729_Coupling_dynamics_of_epidemic_spreading_and_information_diffusion_on_complex_networks","322419245_Optimal_resource_diffusion_for_suppressing_disease_spreading_in_multiplex_networks","319637723_Spectral_Analysis_of_Epidemic_Thresholds_of_Temporal_Networks","317971418_Reconstruction_of_stochastic_temporal_networks_through_diffusive_arrival_times","328248593_Burstiness_and_spreading_on_temporal_networks","322002786_Social_contagions_on_correlated_multiplex_networks","313203504_Reality_mining_Sensing_complex_social_systems","311899572_Epidemic_processes_in_complex_networks","305488779_Dynamics_of_information_diffusion_and_its_applications_on_complex_networks"]}