{"id":"332737004_Developing_A_Case-Based_Reasoning_Model_for_Safety_Accident_Pre-Control_and_Decision_Making_in_the_Construction_Industry","abstract":"Case-based reasoning (CBR) has been extensively employed in various construction management areas, involving construction cost prediction, duration estimation, risk management, tendering, bidding and procurement. However, there has been a dearth of research integrating CBR with construction safety management for preventing safety accidents. This paper proposes a CBR model which focuses on case retrieval and reuse to provide safety solutions for new problems. It begins with the identification of case problem attribute and solution attribute, the state of hazard is used to describe the problem attribute based on principles of people’s unsafe behavior and objective’s unsafe state. Frame-based knowledge representation method is adopted to establish the case database from dimensions of slot, facet and facet’s value. Besides, cloud graph method is introduced to determine the attribute weight through analyzing the numerical characteristics of expectation value, entropy value and hyper entropy value. Next, thesaurus method is employed to calculate the similarity between cases including word level similarity and sentence level similarity. Principles and procedures have been provided on case revise and case retain. Finally, a real-world case is conducted to illustrate the applicability and effectiveness of the proposed model. Considering the high potential for pre-control and decision-making of construction safety accident, the proposed model is expected to contribute safety managers to take decisions on prevention measures more efficiently.","authors":["Yikun Su","Shijing Yang","Kangning Liu","Kaicheng Hua"],"meta":["April 2019International Journal of Environmental Research and Public Health 16(9):1511","DOI:10.3390/ijerph16091511"],"references":["324188380_Factors_Causing_Health_and_Safety_Hazards_in_Construction_Projects_in_Pakistan","322500751_Accident_Causal_Factors_on_the_Building_Construction_Sites_A_Review","333535870_Accident_prevention_through_design_PtD_Integration_of_building_information_modeling_and_PtD_knowledge_base","330800033_Causal_factors_and_connections_in_construction_accidents","330095214_Applicability_of_accident_analysis_methods_to_Chinese_construction_accidents","328235297_Development_of_Hazard_Prevention_Strategies_for_Inherent_Safety_Assessment_during_Early_Stage_of_Process_Design","326524896_Fatal_accident_patterns_of_building_construction_activities_in_China","317223115_Trends_of_Fall_Accidents_in_the_US_Construction_Industry","314953121_Ontology_Techniques_for_Representing_the_Problem_of_Discourse_Design_of_Solution_Application_Perspective","314517227_Metro_Railway_Safety_An_Analysis_of_Accident_Precursors"]}