{"id":"332724947_An_Overview_of_Computational_Thinking","abstract":"Computers and smart devices have become ubiquitous staples of our lives. Computers and computer-controlled devices are used in all industries from medicine to engineering, and textile production. One field where computers have inevitably spread into is education, and one pre-requisite of controlling computers, or increasing the level and efficiency of our control over them, is making human-computer interaction as efficient as possible. This process of efficient and effective computer use, known as “Computer-like Thinking” or “Computational Thinking”, is seen as a field with the potential to support individual and societal development in our rapidly progressing world and to provide significant economic benefits. The fundamental concepts and scope of this field have been delineated in diverse manners by different researchers. Similarly, researchers have also advanced distinct critical viewpoints towards and potential benefits of computational thinking. This study aims to first define the concept of computational thinking by referencing source literature, then analyze the aims of certain criticisms of the field, and discuss the fundamental elements of computational thinking and contemporary research on these elements.","authors":["Fatih Kursat Cansu","Sibel Kilicarslan Cansu"],"meta":["April 2019International Journal of Computer Science Education in Schools 3(1):3","DOI:10.21585/ijcses.v3i1.53"],"references":["305140678_A_K-6_Computational_Thinking_Curriculum_Framework_Implications_for_Teacher_Knowledge","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","299450690_Computational_thinking_the_developing_definition","282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","281614198_SCRATCH_ILE_PROGRAMLAMA_EGITIMI_ALAN_OGRENCILERIN_PROBLEM_COZME_BECERILERININ_INCELENMESI_INVESTIGATING_THE_PROBLEM_SOLVING_SKILLS_OF_STUDENTS_ATTENDED_SCRATCH_PROGRAMMING_COURSE","276852167_Designing_for_deeper_learning_in_a_blended_computer_science_course_for_middle_school_students","338101501_The_effect_of_Scratch_environment_on_student's_achievement_in_teaching_algorithm","319907288_Analysis_of_the_relation_between_computational_thinking_skills_and_various_variables_with_the_structural_equation_model","308654282_Which_cognitive_abilities_underlie_computational_thinking_Criterion_validity_of_the_Computational_Thinking_Test","297900236_Conversations_with_Jean_Piaget"]}