{"id":"332779980_Ghost_Imputation_Accurately_Reconstructing_Missing_Data_of_the_Off_Period","abstract":"Noise and missing data are intrinsic characteristics of real-world data, leading to uncertainty that negatively affects the quality of knowledge extracted from the data. The burden imposed by missing data is often severe in sensors that collect data from the physical world, where large gaps of missing data may occur when the system is temporarily off or disconnected. How can we reconstruct missing data for these periods? We introduce an accurate and efficient algorithm for missing data reconstruction (imputation), that is specifically designed to recover off-period segments of missing data. This algorithm, Ghost, searches the sequential dataset to find data segments that have a prior and posterior segment that matches those of the missing data. If there is a similar segment that also satisfies the constraint-such as location or time of day-then it is substituted for the missing data. A baseline approach results in quadratic computational complexity, therefore we introduce a caching approach that reduces the search space and improves the computational complexity to linear in the common case. Experimental evaluations on five real-world datasets show that our algorithm significantly outperforms four state-of-the-art algorithms with an average of 18% higher F-score.","authors":["Reza Rawassizadeh","Hamidreza Keshavarz","Michael Pazzani"],"meta":["May 2019IEEE Transactions on Knowledge and Data Engineering PP(99)","DOI:10.1109/TKDE.2019.2914653"],"references":["330588572_Indexing_Multivariate_Mobile_Data_through_Spatio-Temporal_Event_Detection_and_Clustering","326210575_Comparison_of_methods_for_transcriptome_imputation_through_application_to_two_common_complex_diseases","323784540_NoCloud_Exploring_Network_Disconnection_through_On-Device_Data_Analysis","318266675_Continuous_Imputation_of_Missing_Values_in_Streams_of_Pattern-Determining_Time_Series","317185818_Multimodal_Machine_Learning_A_Survey_and_Taxonomy","305695923_Scalable_Daily_Human_Behavioral_Pattern_Mining_from_Multivariate_Temporal_Data","319770472_A_symbolic_representation_of_time_series_with_implications_for_streaming_algorithms","314755797_Statistical_Analysis_with_Missing_Data","308339846_Multiple_imputation_by_chained_equations_for_systematically_and_sporadically_missing_multilevel_data","305628704_Computational_Biology_in_the_21st_Century_Scaling_with_Compressive_Algorithms"]}