{"id":"332744148_Teachers'_Perceptions_of_Student_Misconceptions_in_Introductory_Programming","abstract":"A quality computer science (CS) teacher needs to understand students’ common misconceptions in learning CS. This study explored one aspect of CS teachers’ understanding of student misconceptions: their perceptions of student misconceptions related to introductory programming. Perceptions in this study included three parts: teachers’ perceived frequency of a student misconception, teachers’ perceived importance of a misconception in learning, and teachers’ confidence in addressing a misconception. Teachers in our study taught a Python-based CS course for high schools students. A survey was designed and administered to assess teachers’ perceptions of students’ misconceptions. Our results indicated that teachers’ confidence of addressing misconceptions and the teaching context may affect their perceptions of student misconceptions. We also found that some latent misconceptions are likely to lead to a perception of low frequency as they can be more difficult to detect. Moreover, our study found that teachers’ degrees and additional computing training showed positive relationships with their confidence of addressing student misconceptions and that additional computing training also showed a positive relationship with teachers’ perceived importance of student misconceptions. Implications of the findings for future research and practice of CS education are discussed.","authors":["Yizhou Qian","Susanne E. Hambrusch","Aman Yadav","Sarah Gretter"],"meta":["April 2019Journal of Educational Computing Research 58(1):073563311984541","DOI:10.1177/0735633119845413","Project: PD4CS: Leading the Way to CS10K: Assessing a Just-in-Time Professional Development Approach for Teacher Knowledge Growth in Computer Science"],"references":["323373968_Who_Needs_What_Recommendations_for_Designing_Effective_Online_Professional_Development_for_Computer_Science_Teachers","320679287_Students'_Misconceptions_and_Other_Difficulties_in_Introductory_Programming_A_Literature_Review","316947290_iSnap_Towards_Intelligent_Tutoring_in_Novice_Programming_Environments","311425641_Expanding_computer_science_education_in_schools_Understanding_teacher_experiences_and_challenges","309086464_Measuring_computer_science_pedagogical_content_knowledge_An_exploratory_analysis_of_teaching_vignettes_to_measure_teacher_knowledge","303939858_An_Effective_Approach_to_Enhancing_Compiler_Error_Messages","317223917_Novice_Java_Programming_Mistakes_Large-Scale_Data_vs_Educator_Beliefs","316799068_Modelling_Learners_and_Learning_in_Science_Education","305257562_Centralized_Mindset_A_Student_Problem_with_Object-Oriented_Programming","302944837_Misconceptions_and_attitudes_that_infere_with_learning_to_program"]}