{"id":"332747365_Pixel_super-resolution_for_lens-free_holographic_microscopy_using_deep_learning_neural_networks","abstract":"Lens-free holographic microscopy (LFHM) provides a cost-effective tool for large field-of-view imaging in various biomedical applications. However, due to the unit optical magnification, its spatial resolution is limited by the pixel size of the imager. Pixel super-resolution (PSR) technique tackles this problem by using a series of sub-pixel shifted low-resolution (LR) lens-free holograms to form the high-resolution (HR) hologram. Conventional iterative PSR methods require a large number of measurements and a time-consuming reconstruction process, limiting the throughput of LFHM in practice. Here we report a deep learning-based PSR approach to enhance the resolution of LFHM. Compared with the existing PSR methods, our neural network-based approach outputs the HR hologram in an end-to-end fashion and maintains consistency in resolution improvement with a reduced number of LR holograms. Moreover, by exploiting the resolution degradation model in the imaging process, the network can be trained with a data set synthesized from the LR hologram itself without resorting to the HR ground truth. We validated the effectiveness and the robustness of our method by imaging various types of samples using a single network trained on an entirely different data set. This deep learning-based PSR approach can significantly accelerate both the data acquisition and the HR hologram reconstruction processes, therefore providing a practical solution to fast, lens-free, super-resolution imaging.","authors":["Zhenxiang Luo","Abdulkadir Yurt","Richard Stahl","Andy Lambrechts"],"meta":["May 2019Optics Express 27(10):13581","DOI:10.1364/OE.27.013581"],"references":["333440390_Deep_Learning_for_Single_Image_Super-Resolution_A_Brief_Review","329715953_Deep_learning_enables_cross-modality_super-resolution_in_fluorescence_microscopy","327914814_Deep_learning_approach_for_Fourier_ptychography_microscopy","324549998_Deep_learning_massively_accelerates_super-resolution_localization_microscopy","321761248_Deep_Learning_Enhanced_Mobile-Phone_Microscopy","343546193_GANs_for_Medical_Image_Analysis","326664752_Lensfree_dynamic_super-resolved_phase_imaging_based_on_active_micro-scanning","322787838_Deep-STORM_Super_Resolution_Single_Molecule_Microscopy_by_Deep_Learning","320968363_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","319277381_Enhanced_Deep_Residual_Networks_for_Single_Image_Super-Resolution"]}