{"id":"332741740_Like_A_Second_Skin_Understanding_How_Epidermal_Devices_Affect_Human_Tactile_Perception","abstract":"\" The emerging class of epidermal devices opens up new opportunities for skin-based sensing, computing, and interaction. Future design of these devices requires an understanding of how skin-worn devices affect the natural tactile perception. In this study, we approach this research challenge by proposing a novel classification system for epidermal devices based on flexural rigidity and by testing advanced adhesive materials, including tattoo paper and thin films of poly (dimethylsiloxane) (PDMS). We report on the results of three psychophysical experiments that investigated the effect of epidermal devices of different rigidity on passive and active tactile perception. We analyzed human tactile sensitivity thresholds, two-point discrimination thresholds, and roughness discrimination abilities on three different body locations (fingertip, hand, forearm). Generally, a correlation was found between device rigidity and tactile sensitivity thresholds as well as roughness discrimination ability. Surprisingly, thin epidermal devices based on PDMS with a hundred times the rigidity of commonly used tattoo paper resulted in comparable levels of tactile acuity. The material offers the benefit of increased robustness against wear and the option to re-use the device. Based on our findings, we derive design recommendations for epidermal devices that combine tactile perception with device robustness.","authors":["Aditya Shekhar Nittala","Klaus Kruttwig","Jaeyeon Lee","Roland Bennewitz"],"meta":["May 2019","DOI:10.1145/3290605.3300610","Conference: the 2019 CHI Conference"],"references":["334668624_MDPI_MOL2NET_International_Conference_Series_on_Multidisciplinary_Sciences_ANTITRYPANOSOMAL_POTENTIAL_OF_BUCHHOLZIA_CORIACEA_SEED_EXTRACTS_IN_MICE","325888226_Prosthesis_with_neuromorphic_multilayered_e-dermis_perceives_touch_and_pain","324664276_Silicone_Devices_A_Scalable_DIY_Approach_for_Fabricating_Self-Contained_Multi-Layered_Soft_Circuits_using_Microfluidics","350684994_Psychophysics","345181349_Springer_Handbook_of_Condensed_Matter_and_Materials_Data","328326649_Tacttoo_A_Thin_and_Feel-Through_Tattoo_for_On-Skin_Tactile_Output","325444120_EGaIn-Assisted_Room-Temperature_Sintering_of_Silver_Nanoparticles_for_Stretchable_Inkjet-Printed_Thin-Film_Electronics","324665310_Multi-Touch_Skin_A_Thin_and_Flexible_Multi-Touch_Sensor_for_On-Skin_Input","324664956_LumiWatch_On-Arm_Projected_Graphics_and_Touch_Input","324663602_It's_a_Wrap_Mapping_On-Skin_Input_to_Off-Skin_Displays"]}