{"id":"332770539_Distance_and_Consensus_for_Preference_Relations_Corresponding_to_Ordered_Partitions","abstract":"Ranking is an important part of several areas of contemporary research, including social sciences, decision theory, data analysis, and information retrieval. The goal of this paper is to align developments in quantitative social sciences and decision theory with the current thought in Computer Science, including a few novel results. Specifically, we consider binary preference relations, the so-called weak orders that are in one-to-one correspondence with rankings. We show that the conventional symmetric difference distance between weak orders, considered as sets of ordered pairs, coincides with the celebrated Kemeny distance between the corresponding rankings, despite the seemingly much simpler structure of the former. Based on this, we review several properties of the geometric space of weak orders involving the ternary relation “between,” and contingency tables for cross-partitions. Next, we reformulate the consensus ranking problem as a variant of finding an optimal linear ordering, given a correspondingly defined consensus matrix. The difference is in a subtracted term, the partition concentration that depends only on the distribution of the objects in the individual parts. We apply our results to the conventional Likert scale to show that the Kemeny consensus rule is rather insensitive to the data under consideration and, therefore, should be supplemented with more sensitive consensus schemes.","authors":["Boris G Mirkin","Trevor Ian Fenner"],"meta":["April 2019Journal of Classification 36(7)","DOI:10.1007/s00357-018-9290-x"],"references":["282751998_Clustering_and_Prediction_of_Rankings_Within_a_Kemeny_Distance_Framework","314243659_Utility_Maximization_Choice_and_Preference","313199527_Spearman's_footrule_as_a_measure_of_disarray","281399675_The_Relation_Between_Measures_of_Correlation_in_the_Universe_of_Sample_Permutations","279898134_Likert_scales_and_data_analyses","277934650_Integrative_Cluster_Analysis_in_Bioinformatics","276275927_Mathematics_Without_Numbers","275741210_Metric_Methods_for_Analyzing_Partially_Ranked_Data","274910260_Mathematical_Models_in_the_Social_Sciences","266410882_Clustering_for_Data_Mining_A_Data_Recovery_Approach"]}