{"id":"332732341_Gaze_Information_Channel_in_Cognitive_Comprehension_of_Poster_Reading","abstract":"Today, eye trackers are extensively used in studying human cognition. However, it is hard to analyze and interpret eye movement data from the cognitive comprehension perspective of poster reading. To find quantitative links between eye movements and cognitive comprehension, we tracked observers’ eye movement for reading scientific poster publications. We model in this paper eye tracking fixation sequences between content-dependent Areas of Interests (AOIs) as a Markov chain. Furthermore, we use the fact that a Markov chain is a special case of information or communication channel. Then, the gaze transition can be modeled as a discrete information channel, the gaze information channel. Next, some traditional eye tracking metrics, together with the gaze entropy and mutual information of the gaze information channel are calculated to quantify cognitive comprehension for every participant. The analysis of the results demonstrate that the gaze entropy and mutual information from individual gaze information channel are related to participants’ individual differences. This is the first study that eye tracking technology has been used to assess the cognitive comprehension of poster reading. The present work provides insights into human cognitive comprehension by using the novel gaze information channel methodology.","authors":["Qiaohong Hao","Mateu Sbert","Lijing Ma"],"meta":["April 2019Entropy 21(5):444","DOI:10.3390/e21050444"],"references":["327475082_Creating_Posters_for_Effective_Scientific_Communication","324564050_How_to_Prepare_a_Poster_for_a_Scientific_Presentation","324029217_Scanpath_visualization_and_comparison_using_visual_aggregation_techniques","351894645_Markov_Chains_From_Theory_to_Implementation_and_Experimentation","338803190_Predicting_webpage_aesthetics_with_heatmap_entropy","330226543_A_review_of_gaze_entropy_as_a_measure_of_visual_scanning_efficiency","327365838_Information_Theory_Tools_for_Visualization","325641203_Useful_approaches_to_exploratory_analysis_of_gaze_data_enhanced_heatmaps_cluster_maps_and_transition_maps","323571243_Predicting_Webpage_Aesthetics_with_Heatmap_Entropy","320510067_EYE-TRACKING_IN_THE_STUDY_OF_VISUAL_EXPERTISE_METHODOLOGY_AND_APPROACHES_IN_MEDICINE"]}