{"id":"332730636_Device-independent_certification_of_non-classical_joint_measurements_via_causal_models","abstract":"Quantum measurements are crucial for quantum technologies and give rise to some of the most classically counter-intuitive quantum phenomena. As such, the ability to certify the presence of genuinely non-classical joint measurements in a device-independent fashion is vital. However, previous work has either been non-device-independent, or has relied on post-selection—the ability to discard all runs of an experiment in which a specific event did not occur. In the case of entanglement, the post-selection approach applies an entangled measurement to independent states and post-selects the outcome, inducing non-classical correlations between the states that can be device-independently certified using a Bell inequality. That is, it certifies measurement non-classicality not by what it is, but by what it does. This paper remedies this discrepancy by providing a novel notion of what measurement non-classicality is, which, in analogy with Bell’s theorem, corresponds to measurement statistics being incompatible with an underlying classical causal model. It is shown that this provides a more fine-grained notion of non-classicality than post-selection, as it certifies the presence of non-classicality that cannot be revealed by examining post-selected outcomes alone.","authors":["Ciaran Lee"],"meta":["April 2019npj Quantum Information 5(1):34","DOI:10.1038/s41534-019-0151-1"],"references":["332075175_Entanglement_25_Years_after_Quantum_Teleportation_Testing_Joint_Measurements_in_Quantum_Networks","329850212_Self-Testing_Entangled_Measurements_in_Quantum_Networks","324513812_Classical_Causal_Models_for_Bell_and_Kochen-Specker_Inequality_Violations_Require_Fine-Tuning","319929034_Causal_Compatibility_Inequalities_Admitting_of_Quantum_Violations_in_the_Triangle_Structure","317824548_Towards_Device-Independent_Information_Processing_on_General_Quantum_Networks","316235117_Ruling_out_Higher-Order_Interference_from_Purity_Principles","316184617_Oracles_and_Query_Lower_Bounds_in_Generalised_Probabilistic_Theories","315956526_Causal_Inference_via_Algebraic_Geometry_Feasibility_Tests_for_Functional_Causal_Structures_with_Two_Binary_Observed_Variables","314115451_The_computational_landscape_of_general_physical_theories","329850712_Noise-Resistant_Device-Independent_Certification_of_Bell_State_Measurements"]}