{"id":"332774639_Large-Scale_Person_Re-Identification_Based_on_Deep_Hash_Learning","abstract":"Person re-identification in the image processing domain has been a challenging research topic due to the influence of pedestrian posture, background, lighting, and other factors. In this paper, the method of harsh learning is applied in person re-identification, and we propose a person re-identification method based on deep hash learning. By improving the conventional method, the method proposed in this paper uses an easy-to-optimize shallow convolutional neural network to learn the inherent implicit relationship of the image and then extracts the deep features of the image. Then, a hash layer with three-step calculation is incorporated in the fully connected layer of the network. The hash function is learned and mapped into a hash code through the connection between the network layers. The generation of the hash code satisfies the requirements that minimize the error of the sum of quantization loss and Softmax regression cross-entropy loss, which achieve the end-to-end generation of hash code in the network. After obtaining the hash code through the network, the distance between the pedestrian image hash code to be retrieved and the pedestrian image hash code library is calculated to implement the person re-identification. Experiments conducted on multiple standard datasets show that our deep hashing network achieves the comparable performances and outperforms other hashing methods with large margins on Rank-1 and mAP value identification rates in pedestrian re-identification. Besides, our method is predominant in the efficiency of training and retrieval in contrast to other pedestrian re-identification algorithms.","authors":["Xian-Qin Ma","Chong-Chong Yu","Xiuxin Chen","Lan Zhou"],"meta":["April 2019Entropy 21(5):449","DOI:10.3390/e21050449"],"references":["322060624_Unlabeled_Samples_Generated_by_GAN_Improve_the_Person_Re-identification_Baseline_in_Vitro","321347407_Camera_Style_Adaptation_for_Person_Re-identification","315807887_Beyond_Triplet_Loss_A_Deep_Quadruplet_Network_for_Person_Re-identification","315806890_Beyond_triplet_loss_a_deep_quadruplet_network_for_person_re-identification","315514719_In_Defense_of_the_Triplet_Loss_for_Person_Re-Identification","315489606_Improving_Person_Re-identification_by_Attribute_and_Identity_Learning","312976582_Pose-Invariant_Embedding_for_Deep_Person_Re-Identification","321604670_Pose-Normalized_Image_Generation_for_Person_Re-identification","321306508_Person_Transfer_GAN_to_Bridge_Domain_Gap_for_Person_Re-Identification","316445659_Person_re-identification_using_CNN_features_learned_from_combination_of_attributes"]}