{"id":"332753070_tftysh_almnzwmt_almlwmatyt_whjz_almtyat_fy_altshry_aljzayr","abstract":"ملخص \nحققت الثورة التكنولوجية قفزة هائلة في مجال تقنية المعلومات، بالمقابل أدى سوء استخدامها إلى ظهور جرائم مستحدثة عرفت بالجرائم المعلوماتية، ممـا صعب من مكافحتها نظرا لطبيعتها و خصوصية إجراءات التحقيق فيها، عبر هذه البيئة الافتراضية لتعقّب المجرم المعلوماتي. في هذا الصدد، نص القانون رقم: 09-04 المؤرخ في:05 أوت 2009 يتضمن القواعد الخاصة للوقاية من الجرائم المتصلة بتكنولوجيات الإعلام و الإتصال و مكافحتهما، على جملة من القواعد الإجرائية المتعلقة بتفتيش المنظومة المعلوماتية و حجز المعطيات، لكن تبقى هذه الإجراءات قاصرة في الكشف عن هذه الجرائم أمام التطورات التقنية المذهلة في مجال المعلوماتية، مما يستوجب مراجعتها بما يتماشى و هذا التطور.\n\nRésumé \nLa révolution technologique a fait un saut considérable dans la technologie de l'information. En contrepartie, l'utilisation abusive de cette technologie a fait apparaitre un nouveau genre de crime dit\" la cyber criminalité\". Cela a engendré des difficultés pour la combattre, vu sa nature et la spécificité des procédures investigatrices afin de poursuivre \"le criminel informatique \", dans cet environnement virtuel. Dans ce contexte, la loi n°09-04 du 05 août 2009 portant règles particulières relatives à la prévention et à la lutte contre les infractions liées aux technologies de l'information et de la communication, a édicté un ensemble de règles procédurales concernant l'inspection du système informatique, et la saisie de ses données. Mais cela reste insuffisant devant l'hallucinant progrès technique dans le domaine de l'informatique, d'où la nécessité de revoir ces règles, et les adapter selon l'évaluation de cette technologie. Mots-clés: Système informatique, données informatiques, traitement automatisés des données, perquisition. Search of the information system and data entry in the Algerian legislation Abstract The Progressing technological revolution has realized a huge area of information, In return, negative effects has esmerged among them is \"cybercrimes\", which creates enorunus difficulties, that are hard to fight them by all means. For this purpose, the law n°, 09-04 of August 05 Th 2009 includes special rules relating to the search of the information system and data entry. But, in spite of that, legal texts remain insufficient to detect the crimes. This is time to be reviewed and updated with this revolution.","authors":["Bouhalit Yazid"],"meta":["December 2016"],"references":[]}