{"id":"332775929_Laboratorios_reales_versus_laboratorios_virtuales_en_las_carreras_de_ciencias_de_la_computacion_Real_laboratory_versus_virtual_laboratory_in_computer_science_careers","abstract":"El uso de laboratorios en las carreras de informática y ciencias de la computación es indudablemente valioso para los estudiantes. Gracias a la evolución de las comunicaciones, a través de Internet es posible implementar laboratorios virtuales con costos mucho más bajos que los de uno real, con la ventaja de estar disponible para todos los alumnos a la vez, a cualquier hora y lugar. El presente estudio tiene por objetivo determinar las preferencias de los estudiantes por laboratorios reales y laboratorios virtuales. La investigación es descriptiva correlacional con un enfoque cuantitativo. La técnica de recopilación de datos se realizó con una encuesta aplicada a 483 universitarios mexicanos a través de Internet con la herramienta Google Forms. Entre los principales resultados se obtuvo que el 100% de los estudiantes encuestados afirma poseer un teléfono inteligente, medio para acceder a los servicios virtuales que ofrece Internet. El 82% de los sujetos de estudio está satisfecho con los laboratorios físicos, encontrando una preferencia en el uso de laboratorios en línea entre los alumnos que no residen en la localidad donde se ubica su institución educativa, con un coeficiente de correlación r=0.858. Se encontraron tendencias en cuanto al tipo de carrera que cursan los sujetos de estudio; los de ingeniería (ingeniería en sistemas computacionales, ingeniería en sistemas de información, ingeniería mecatrónica e ingeniería de software) se inclinan más al uso de los laboratorios físicos que los alumnos de licenciatura (licenciatura en informática, licenciado en tecnologías de la información y licenciatura en sistemas computacionales). Los universitarios que no residen en la misma ciudad de su institución preferirían el laboratorio virtual. En general, hay una opinión favorable hacia los dos tipos de laboratorios; los estudiantes se sienten satisfechos con su uso y perciben mejoría en las materias de programación y en su rendimiento en general.","authors":["Aníbal Zaldivar"],"meta":["April 2019IE Revista de Investigación Educativa de la REDIECH 10(18):9","DOI:10.33010/ie_rie_rediech.v10i18.454"],"references":["318084218_M-learning_and_Augmented_Reality_A_Review_of_the_Scientific_Literature_on_the_WoS_Repository","302869294_Virtual_Metrology_Laboratory_for_e-Learning","331809003_Correlacion_y_Regresion_Lineal_de_la_evaluacion_tiempo_y_puntaje_con_recurso_interactivo_Flash","319054498_Using_a_Modified_Jigsaw_Technique_in_E-Learning_Laboratory_Classes_for_Engineering_Students","318294642_Adaptive_access_to_robotic_learning_experiences_in_a_remote_laboratory_setting","317420914_Virtual_cloud_network_laboratory_based_on_IaaS_for_university_IT_education","316512252_E-learning_Applications_for_Remotely_Accessible_Photovoltaic_Array_Educational_Laboratories","310665435_Virtual_laboratories_in_science_education_students'_motivation_and_experiences_in_two_tertiary_biology_courses","305695309_A_Methodology_to_Obtain_Learning_Effective_Laboratories_with_Learning_Management_System_Integration","301573495_An_Efficient_Virtualization_Server_Infrastructure_for_e-Schools_of_India"]}