{"id":"332785862_Quality_Frameworks_and_Learning_Design_for_Open_Education","abstract":"This article discusses the need to innovate education due to global changes to keep its status as a human right and public good and introduces Open Education as a theory to fulfil these requirements. A systematic literature review confirms the hypothesis that a holistic quality framework for Open Education does not exist. For its development, a brief history and definition of Open Education are provided first. It is argued that Open Education improves learning quality through the facilitation of innovative learning designs and processes. Therefore, sources of learning quality and dimensions of quality development are discussed. To support the improvement of the learning quality and design of Open Education, the Reference Process Model of ISO/IEC 40180 (former ISO/IEC 19796-1) is introduced and modified for Open Education. Adapting the three quality dimensions and applying the macro, meso, and micro levels, the OpenEd Quality Framework is developed. This framework combines and integrates the different quality perspectives in a holistic approach that is mapping them to the learning design, processes, and results. Finally, this article illustrates potential adaptations and benefits of the OpenEd Quality Framework. The OpenEd Quality Framework can be used in combination with other tools to address the complexity of and to increase the quality and impact of Open Education. To summarize, the OpenEd Quality Framework serves to facilitate and foster future improvement of the learning design and quality of Open Education.","authors":["Christian M. Stracke"],"meta":["April 2019International Review of Research in Open and Distance Learning 20(2)","DOI:10.19173/irrodl.v20i2.4213"],"references":["334746188_Como_a_Educacao_Aberta_pode_melhorar_a_qualidade_de_aprendizagem_e_produzir_impacto_em_alunos_organizacoes_e_na_sociedade","331773694_Process-oriented_Quality_Management","331742223_The_Evaluation_Framework_for_Impact_Assessment","331741445_The_Concept_of_Open_Learning_for_Opening_Up_Education","327000678_Gap_between_MOOC_Designers'_and_MOOC_Learners'_Perspectives_on_Interaction_and_Experiences_in_MOOCs_Findings_from_the_Global_MOOC_Quality_Survey","325047383_The_Quality_of_Open_Online_Education_and_Learning_A_Quality_Reference_Framework_for_MOOCs","318236848_The_Quality_of_MOOCs_How_to_Improve_the_Design_of_Open_Education_and_Online_Courses_for_Learners","317417710_Open_education_and_learning_quality_The_need_for_changing_strategies_and_learning_experiences","331183642_The_History_and_Emergent_Paradigm_of_Open_Education","322608765_Measuring_Quality_in_Online_Education_A_Meta-synthesis"]}