{"id":"332775941_A_Local_Potential-Based_Clustering_Algorithm_for_Unsupervised_Hyperspectral_Band_Selection","abstract":"pervised band selection plays an increasingly important role in HSI classification because of inadequate labeling samples. However, how to select more representative, less redundant and informative bands is an open problem. Recently, a fast density-peak-based clustering (FDPC) algorithm has been proposed. The FDPC chooses the cluster center through the local density and the intracluster distance of each point and ranks each point through certain rule. For HSI band selection, the FDPC has the following problems. First, when calculating the local density of bands, the difference between bands is not considered, so the local density cannot better characterize the band distribution. Second, the ranking rule in FDPC is more inclined to select bands with larger density and intracluster distance values. However, some boundary bands with abundant information and low redundancy cannot be found. This paper proposes a local potential-based clustering algorithm for unsupervised Hyperspectral band selection (LPC). The LPC algorithm improves the FDPC algorithm in three aspects for band selection: 1) the local potential of each band is calculated according to the similarity of between bands, and the larger similarity has greater effect on the local potential. The local potential can better characterize the band distribution. 2) the LPC proposes a weighted ranking rule, which integrates the three factors of local potential, intracluster distance and standard deviation to guide the algorithm to select more discriminative bands. In particular, some boundary bands with abundant information and low redundancy can be found. 3) an effective method is designed to automatically select the appropriate number of bands. Experimental results on three real hyperspectral data sets demonstrate that the proposed method outperforms the other state-of-the-art methods.","authors":["Zhaokui li","Lin Hunag","Jinrong He","Cuiwei Liu"],"meta":["April 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2914161","Project: A Local Potential-based Clustering Algorithm for Unsupervised Hyperspectral Band Selection"],"references":["327080377_Feature_Extraction_With_Multiscale_Covariance_Maps_for_Hyperspectral_Image_Classification","326452585_Superpixel-Based_Unsupervised_Band_Selection_for_Classification_of_Hyperspectral_Images","322844253_Graph-Regularized_Fast_and_Robust_Principal_Component_Analysis_for_Hyperspectral_Band_Selection","317272305_Remote_Sensing_Scene_Classification_by_Unsupervised_Representation_Learning","316079297_A_Sparse_and_Low-Rank_Near-Isometric_Linear_Embedding_Method_for_Feature_Extraction_in_Hyperspectral_Imagery_Classification","313483734_Re-weighted_Discriminatively_Embedded_K-Means_for_Multi-view_Clustering","309146874_Hyperspectral_Band_Selection_by_Discovering_Diverse_Subset_in_Multiple_Graphs","305459278_Deep_Feature_Extraction_and_Classification_of_Hyperspectral_Images_Based_on_Convolutional_Neural_Networks","297597771_Spectral-Spatial_Sparse_Subspace_Clustering_for_Hyperspectral_Remote_Sensing_Images","290994714_Kernel-Based_Domain-Invariant_Feature_Selection_in_Hyperspectral_Images_for_Transfer_Learning"]}