{"id":"332714703_Multi-sink_distributed_power_control_algorithm_for_Cyber-physical-systems_in_coal_mine_tunnels","abstract":"A coal mine tunnel usually has a long-strip shape. Traditional single-sink cyber-physical-systems(CPS) cannot ensure that sensor nodes far from the entrance of a coal mine tunnel promptly and accurately transmit abnormal data from deep in the tunnel to the ground control center via the sink at the tunnel entrance. At the same time, it causes the “hot spot” problem easily around the Sink and limits the lifetime of the whole network. In order to solve these problems, this paper proposes a Multi-sink distributed power control algorithm (MSDPC-SRMS) suitable for a coal mine tunnel. This algorithm uses the Multiple Sink network structure and the idea of non-uniform cluster, combines the Multi-sink network with the clustering Voronoi scoping routing algorithm. It allocates the optimal transmission range and power for each sink, uses each sink as the cluster head and the network clustering is performed. The network topology is optimized on the basis of a good network coverage rate. Simulation results compared with CNP strategy show that the new algorithm exhibits superior connectivity, power consumption validity, clustering interference, and network performance, can effectively reduce the overall power consumption and prolong the lifetime of the network, thus ensure the monitoring data transmitted to the monitoring center rapidly and quickly.","authors":["Wei W","Xu Xia","Wozniak Marcin","Xunli Fan"],"meta":["April 2019Computer Networks 161(5)","DOI:10.1016/j.comnet.2019.04.017"],"references":["319638557_Video_tamper_detection_based_on_multi-scale_mutual_information","317210626_CDMA-based_anti-collision_algorithm_for_EPC_global_C1_Gen2_systems","332089185_Crypt-DAC_Cryptographically_Enforced_Dynamic_Access_Control_in_the_Cloud","327612632_Fractal_Intelligent_Privacy_Protection_in_Online_Social_Network_Using_Attribute-Based_Encryption_Schemes","322140714_Big_Data_Analytics_Enabled_by_Feature_Extraction_Based_on_Partial_Independence","316913200_FBS-Radar_Uncovering_Fake_Base_Stations_at_Scale_in_the_Wild","316520598_Gradient-Driven_Parking_Navigation_Using_a_Continuous_Information_Potential_Field_Based_on_Wireless_Sensor_Network","315463935_Energy_Balance-Based_Steerable_Arguments_Coverage_Method_in_WSNs","314970699_Research_and_Simulation_of_Queue_Management_Algorithms_in_Ad_Hoc_Networks_Under_DDoS_Attack","313146815_Towards_a_full-stack_devops_environment_platform-as-a-service_for_cloud-hosted_applications"]}