{"id":"332837521_Automated_segmentation_of_changes_in_FLAIR-hyperintense_white_matter_lesions_in_multiple_sclerosis_on_serial_magnetic_resonance_imaging","abstract":"Longitudinal analysis of white matter lesion changes on serial MRI has become an important parameter to study diseases with white-matter lesions. Here, we build on earlier work on cross-sectional lesion segmentation; we present a fully automatic pipeline for serial analysis of FLAIR-hyperintense white matter lesions. Our algorithm requires three-dimensional gradient echo T1- and FLAIR- weighted images at 3 Tesla as well as available cross-sectional lesion segmentations of both time points. Preprocessing steps include lesion filling and intrasubject registration. For segmentation of lesion changes, initial lesion maps of different time points are fused; herein changes in intensity are analyzed at the voxel level. Significance of lesion change is estimated by comparison with the difference distribution of FLAIR intensities within normal appearing white matter. The method is validated on MRI data of two time points from 40 subjects with multiple sclerosis derived from two different scanners (20 subjects per scanner). Manual segmentation of lesion increases served as gold standard. Across all lesion increases, voxel-wise Dice coefficient (0.7)as well as lesion-wise detection rate (0.8)and false-discovery rate (0.2)indicate good overall performance. Analysis of scans from a repositioning experiment in a single patient with multiple sclerosis did not yield a single false positive lesion. We also introduce the lesion change plot as a descriptive tool for the lesion change of individual patients with regard to both number and volume. An open source implementation of the algorithm is available at http://www.statistical-modeling.de/lst.html.","authors":["Paul Schmidt","Viola Pongratz née Biberacher","Pascal Küster","Dominik Meier"],"meta":["May 2019NeuroImage: Clinical 23:101849","DOI:10.1016/j.nicl.2019.101849","Project: MS Imaging"],"references":["321990229_Diagnosis_of_multiple_sclerosis_2017_revisions_of_the_McDonald_criteria","321185185_A_supervised_framework_with_intensity_subtraction_and_deformation_field_features_for_the_detection_of_new_T2-w_lesions_in_multiple_sclerosis","318767014_A_novel_imaging_technique_for_better_detecting_new_lesions_in_multiple_sclerosis","311786543_Two_Time_Point_MS_Lesion_Segmentation_in_Brain_MRI_An_Expectation-Maximization_Framework","283974973_Quantifying_brain_tissue_volume_in_multiple_sclerosis_with_automated_lesion_segmentation_and_filling","328114822_Survey_of_automated_multiple_sclerosis_lesion_segmentation_techniques_on_magnetic_resonance_imaging","312199670_Longitudinal_multiple_sclerosis_lesion_segmentation_Resource_and_challenge","305393471_Intra-_and_interscanner_variability_of_magnetic_resonance_imaging_based_volumetry_in_multiple_sclerosis","303892358_Improved_Automatic_Detection_of_New_T2_Lesions_in_Multiple_Sclerosis_Using_Deformation_Fields","284400357_Measures_of_the_Amount_of_Ecologic_Association_Between_Species"]}