{"id":"332851411_Spatial_Pricing_in_Ride-Sharing_Networks","abstract":"We explore spatial price discrimination in the context of a ride-sharing platform that serves a network of locations. Riders are heterogeneous in terms of their destination preferences and their willingness to pay for receiving service. Drivers decide whether and where to provide service so as to maximize their expected earnings given the platform’s pricing and compensation policy. Our findings highlight the impact of the demand pattern on the platform’s prices, profits, and the induced consumer surplus. In particular, we establish that profits and consumer surplus at the equilibrium corresponding to the platform’s optimal pricing and compensation policy are maximized when the demand pattern is “balanced” across the network’s locations. In addition, we show that they both increase monotonically with the balancedness of the demand pattern (as formalized by its structural properties). Furthermore, if the demand pattern is not balanced, the platform can benefit substantially from pricing rides differently depending on the location from which they originate. Finally, we consider a number of alternative pricing and compensation schemes that are commonly used in practice and explore their performance for the platform.","authors":["Kostas Bimpikis","Ozan Candogan","Daniela Saban"],"meta":["May 2019Operations Research 67(3)","DOI:10.1287/opre.2018.1800"],"references":["332908121_Buyer_Uncertainty_About_Seller_Capacity_Causes_Consequences_and_a_Partial_Solution","326566329_On-Demand_Service_Platforms","326046362_Coordinating_Supply_and_Demand_on_an_On-Demand_Service_Platform_with_Impatient_Customers","325184778_Peer-to-Peer_Product_Sharing_Implications_for_Ownership_Usage_and_Social_Welfare_in_the_Sharing_Economy","317295866_The_Role_of_Surge_Pricing_on_a_Service_Platform_with_Self-Scheduling_Capacity","315944522_Crowdsourcing_Exploration","303556463_Matching_markets_in_the_digital_age","301844574_Mean_Field_Equilibria_for_Competitive_Exploration_in_Resource_Sharing_Settings","300494012_Pricing_in_Ride-Sharing_Platforms","5110469_An_Analysis_of_the_Market_for_Taxicab_Rides_in_New_York_City","4995362_The_Existence_of_Equilibrium_in_Discontinuous_Economic_Games_I_Theory","4896501_Envelope_Theorems_for_Arbitrary_Choice_Sets"]}