{"id":"332819279_A_Comprehensive_Review_of_Simulation_Tools_for_Wireless_Sensor_Networks_WSNs","abstract":"The trend towards adoption of Wireless Sensor Networks is increasing in recent years because of its diverse use in various fields. Wireless Sensor Network is formed via interconnection of large number of sensor nodes. Each and every sensor node deployed in network monitors various parameters like Temperature, Humidity, Ambient Light, Gas etc. and send the data to the master node. Despite of several applications and diverse uses, sensor networks face various shortcomings like energy, localization, security, self-organization, fault tolerance and many more. So, the area of Wireless Sensor Network is under rigorous research and development by various researchers across the globe to develop new algorithms, protocols and techniques to make WSN network more efficient and reliable. Before live implementation, testing of the developed technique requires rigorous testing. But it is not always possible to have live sensor network environment. So, in that case, Simulation is the only way to test the research before moving towards live implementation. Large numbers of simulation tools are available for WSN network till date, out of which some are dedicated towards wireless sensor networks and some for both wireless and wired networks. The main objective behind this research paper is to do a comprehensive review of various simulation tools of Wireless Sensor Networks to enable researcher to select the most competent tool for simulating wireless sensor networks and testing the research proposed. A comprehensive review of 31 WSN simulators is being presented along with their respective features comparison to assist researchers in advanced WSN based research.","authors":["Anand Nayyar","Rajeshwar Singh"],"meta":["January 2015","DOI:10.5923/j.jwnc.20150501.03"],"references":["299858617_Simulation_Framework_of_Wireless_Sensor_Network_WSN_Using_MATLABSIMULINK_Software","273093871_A_Comprehensive_Review_of_Ant_Colony_Optimization_ACO_based_Energy-Efficient_Routing_Protocols_for_Wireless_Sensor_Networks","348868465_The_Practical_OPNET_User_Guide_for_Computer_Network_Simulation","316798995_Introduction_to_Network_Simulator_NS2","292567057_Unlocking_the_power_of_OPNET_modeler","291572191_Wireless_sensor_network_simulators_a_survey_and_comparisons","278380900_DRMSim_A_Routing-Model_Simulator_for_Large-Scale_Networks","268380819_NCTUns_distributed_network_emulator","268326494_SENS_A_Simple_Extensible_Sensor_Network_Simulator_for_Exploring_Approximate_Aggregation_Techniques","265040082_The_Protocol_Developer_Manual_for_the_NCTUns_60_Network_Simulator_and_Emulator_Authors"]}