{"id":"332812199_A_Generic_Exact_Solver_for_Vehicle_Routing_and_Related_Problems","abstract":"Major advances were recently obtained in the exact solution of Vehicle Routing Problems (VRPs). Sophisticated Branch-Cut-and-Price (BCP) algorithms for some of the most classical VRP variants now solve many instances with up to a few hundreds of customers. However, adapting and reimplementing those successful algorithms for other variants can be a very demanding task. This work proposes a BCP solver for a generic model that encompasses a wide class of VRPs. It incorporates the key elements found in the best recent VRP algorithms: ng-path relaxation, rank-1 cuts with limited memory, and route enumeration; all generalized through the new concept of “packing set”. This concept is also used to derive a new branch rule based on accumulated resource consumption and to generalize the Ryan and Foster branch rule. Extensive experiments on several variants show that the generic solver has an excellent overall performance, in many problems being better than the best existing specific algorithms. Even some non-VRPs, like bin packing, vector packing and generalized assignment, can be modeled and effectively solved.","authors":["Artur Pessoa","Ruslan Sadykov","Eduardo Uchoa","François Vanderbeck"],"meta":["April 2019","DOI:10.1007/978-3-030-17953-3_27","In book: Integer Programming and Combinatorial Optimization (pp.354-369)"],"references":["355928331_BaPCod_-_a_generic_branch-and-price_code","344515888_A_Bucket_Graph_Based_Labeling_Algorithm_with_Application_to_Vehicle_Routing","324647959_A_branch-and-price_algorithm_for_the_Minimum_Latency_Problem","324456963_Enhanced_Branch-Cut-and-Price_algorithm_for_Heterogeneous_Fleet_Vehicle_Routing_Problems","317558435_The_Vehicle_Routing_Problem_with_Service_Level_Constraints","335954492_Comparative_Analysis_of_Capacitated_Arc_Routing_Formulations_for_Designing_a_New_Branch-Cut-and-Price_Algorithm","325001528_Stabilized_Branch-and-Price_Algorithms_for_Vector_Packing_Problems","320128343_Bidirectional_Labeling_in_Column-Generation_Algorithms_for_Pickup-and-Delivery_Problems","318828253_New_Enhancements_for_the_Exact_Solution_of_the_Vehicle_Routing_Problem_with_Time_Windows","315894097_A_branch-and-cut_algorithm_for_the_Team_Orienteering_Problem"]}