{"id":"332820186_From_spatio-temporal_data_to_chronological_networks_An_application_to_wildfire_analysis","abstract":"Network theory has established itself as an appropriate tool for complex systems analysis and pattern recognition. In the context of spatiotemporal data analysis, correlation networks are used in the vast majority of works. However, the Pearson correlation coefficient captures only linear relationships and does not correctly capture recurrent events. This missed information is essential for temporal pattern recognition. In this work, we propose a chronological network construction process that is capable of capturing various events. Similar to the previous methods, we divide the area of study into grid cells and represent them by nodes. In our approach, links are established if two consecutive events occur in two different nodes. Our method is computationally efficient, adaptable to different time windows and can be applied to any spatiotemporal data set. As a proof-of-concept, we evaluated the proposed approach by constructing chronological networks from the MODIS dataset for fire events in the Amazon basin. We explore two data analytic approaches: one static and another temporal. The results show some activity patterns on the fire events and a displacement phenomenon over the year. The validity of the analyses in this application indicates that our data modeling approach is very promising for spatio-temporal data mining.","authors":["Didier Augusto Vega-Oliveros","Moshé Cotacallapa","Leonardo Ferreira","Marcos G. Quiles"],"meta":["May 2019","DOI:10.1145/3297280.3299802","Conference: SAC '19 Proceedings of the 34th ACM/SIGAPP Symposium on Applied ComputingAt: Limassol, Cyprus","Projects: Network science and applicationsComplex Networks ApplicationsWildfire Analysis"],"references":["328399451_A_Comparison_of_Graph_Construction_Methods_for_Semi-Supervised_Learning","326699466_A_Review_on_the_Dynamics_of_Prescribed_Fire_Tree_Mortality_and_Injury_in_Managing_Oak_Natural_Communities_to_Minimize_Economic_Loss_in_North_America","318194257_Network_analysis_reveals_strongly_localized_impacts_of_El_Nino","315666946_Forecasting_the_magnitude_and_onset_of_El_Nino_based_on_climate_network","334642462_About_Interfaces_Between_Machine_Learning_Complex_Networks_Survivability_Analysis_and_Disaster_Risk_Reduction","327636491_Classifying_drivers_of_global_forest_loss","318164874_Deforestation_effects_on_Amazon_forest_resilience","308883692_Rumor_propagation_with_heterogeneous_transmission_in_social_networks","305780197_Community_detection_in_networks_A_user_guide","304744011_Vital_nodes_identification_in_complex_networks"]}