{"id":"332811531_PhysNet_A_Neural_Network_for_Predicting_Energies_Forces_Dipole_Moments_and_Partial_Charges","abstract":"In recent years, machine learning (ML) methods have become increasingly popular in computational chemistry. After being trained on appropriate ab initio reference data, these methods allow to accurately predict the properties of chemical systems, circumventing the need for explicitly solving the electronic Schrödinger equation. Because of their computational efficiency and scalability to large datasets, deep neural networks (DNNs) are a particularly promising ML algorithm for chemical applications. This work introduces PhysNet, a DNN architecture designed for predicting energies, forces and dipole moments of chemical systems. PhysNet achieves state-of-the-art performance on the QM9, MD17 and ISO17 benchmarks. Further, two new datasets are generated in order to probe the performance of ML models for describing chemical reactions, long-range interactions, and condensed phase systems. It is shown that explicitly including electrostatics in energy predictions is crucial for a qualitatively correct description of the asymptotic regions of a potential energy surface (PES). PhysNet models trained on a systematically constructed set of small peptide fragments (at most eight heavy atoms) are able to generalize to considerably larger proteins like deca-alanine (Ala10): The optimized geometry of helical Ala10 predicted by PhysNet is virtually identical to ab initio results (RMSD = 0.21 Å). By running unbiased molecular dynamics (MD) simulations of Ala10 on the PhysNet-PES in gas phase, it is found that instead of a helical structure, Ala10 folds into a \"wreath-shaped\" configuration, which is more stable than the helical form by 0.46 kcal mol⁻¹ according to the reference ab initio calculations.","authors":["Oliver Thorsten Unke","Markus Meuwly"],"meta":["May 2019Journal of Chemical Theory and Computation 15(6)","DOI:10.1021/acs.jctc.9b00181"],"references":["335712418_Quantum-Chemical_Insights_from_Interpretable_Atomistic_Neural_Networks","323722706_Transferable_Molecular_Charge_Assignment_Using_Deep_Neural_Networks","323410549_Towards_Exact_Molecular_Dynamics_Simulations_with_Machine-Learned_Force_Fields","321160645_The_TensorMol-01_Model_Chemistry_a_Neural_Network_Augmented_with_Long-Range_Physics","320660707_A_Look_at_the_Density_Functional_Theory_Zoo_with_the_Advanced_GMTKN55_Database_for_General_Main_Group_Thermochemistry_Kinetics_and_Noncovalent_Interactions","320180595_Hierarchical_modeling_of_molecular_energies_using_a_deep_neural_network","323793084_A_reactive_scalable_and_transferable_model_for_molecular_energies_from_a_neural_network_approach_based_on_local_information","323297202_Machine_Learning_of_Partial_Charges_Derived_From_High-Quality_Quantum-Mechanical_Calculations","319927207_Prediction_Errors_of_Molecular_Machine_Learning_Models_Lower_than_Hybrid_DFT_Error","319770414_Identity_Mappings_in_Deep_Residual_Networks"]}