{"id":"332804888_Wearable_Sensor-Based_Human_Activity_Recognition_via_Two-Layer_Diversity-Enhanced_Multiclassifier_Recognition_Method","abstract":"Sensor-based human activity recognition can benefit a variety of applications such as health care, fitness, smart homes, rehabilitation training, and so forth. In this paper, we propose a novel two-layer diversity-enhanced multiclassifier recognition method for single wearable accelerometer-based human activity recognition, which contains data-based and classifier-based diversity enhancement. Firstly, we introduce the kernel Fisher discriminant analysis (KFDA) technique to spatially transform the training samples and enhance the discrimination between activities. In addition, bootstrap resampling is utilized to increase the diversities of the dataset for training the base classifiers in the multiclassifier system. Secondly, a combined diversity measure for selecting the base classifiers with excellent performance and large diversity is proposed to optimize the performance of the multiclassifier system. Lastly, majority voting is utilized to combine the preferred base classifiers. Experiments showed that the data-based diversity enhancement can improve the discriminance of different activity samples and promote the generation of base classifiers with different structures and performances. Compared with random selection and traditional ensemble methods, including Bagging and Adaboost, the proposed method achieved 92.3% accuracy and 90.7% recall, which demonstrates better performance in activity recognition.","authors":["Yiming Tian","Xitai Wang","Lingling Chen","Zuojun Liu"],"meta":["April 2019Sensors 19(9):2039","DOI:10.3390/s19092039"],"references":["324544680_Human_Activity_Recognition_from_Body_Sensor_Data_using_Deep_Learning","317616383_Breathing_Analysis_Using_Thermal_and_Depth_Imaging_Camera_Video_Records","317394505_Robust_Human_Activity_Recognition_Using_Smartphone_Sensors_via_CT-PCA_and_Online_SVM","315879776_OKRELM_online_kernelized_and_regularized_extreme_learning_machine_for_wearable-based_activity_recognition","312642887_A_Comprehensive_Review_on_Handcrafted_and_Learning-Based_Action_Representation_Approaches_for_Human_Activity_Recognition","318916430_Optimizing_multi-sensor_deployment_via_ensemble_pruning_for_wearable_activity_recognition","313581243_Diversity_versus_quality_in_classification_ensembles_based_on_feature_selection","312143506_Kernel_Fusion_based_Extreme_Learning_Machine_for_Cross-location_Activity_Recognition","310394238_A_Survey_on_Activity_Detection_and_Classification_Using_Wearable_Sensors","308129451_Multi-Sensor_Fusion_in_Body_Sensor_Networks_State-of-the-art_and_research_challenges"]}