{"id":"332805654_Filtering_Airborne_LiDAR_Data_Through_Complementary_Cloth_Simulation_and_Progressive_TIN_Densification_Filters","abstract":"Separating point clouds into ground and non-ground points is a preliminary and essential step in various applications of airborne light detection and ranging (LiDAR) data, and many filtering algorithms have been proposed to automatically filter ground points. Among them, the progressive triangulated irregular network (TIN) densification filtering (PTDF) algorithm is widely employed due to its robustness and effectiveness. However, the performance of this algorithm usually depends on the detailed initial terrain and the cautious tuning of parameters to cope with various terrains. Consequently, many approaches have been proposed to provide as much detailed initial terrain as possible. However, most of them require many user-defined parameters. Moreover, these parameters are difficult to determine for users. Recently, the cloth simulation filtering (CSF) algorithm has gradually drawn attention because its parameters are few and easy-to-set. CSF can obtain a fine initial terrain, which simultaneously provides a good foundation for parameter threshold estimation of progressive TIN densification (PTD). However, it easily causes misclassification when further refining the initial terrain. To achieve the complementary advantages of CSF and PTDF, a novel filtering algorithm that combines cloth simulation (CS) and PTD is proposed in this study. In the proposed algorithm, a high-quality initial provisional digital terrain model (DTM) is obtained by CS, and the parameter thresholds of PTD are estimated from the initial provisional DTM based on statistical analysis theory. Finally, PTD with adaptive parameter thresholds is used to refine the initial provisional DTM. These contributions of the implementation details achieve accuracy enhancement and resilience to parameter tuning. The experimental results indicate that the proposed algorithm improves performance over their direct predecessors. Furthermore, compared with the publicized improved PTDF algorithms, our algorithm is not only superior in accuracy but also practicality. The fact that the proposed algorithm is of high accuracy and easy-to-use is desirable for users.","authors":["Shangshu Cai","Wuming Zhang","Xinlian Liang","Wan Peng"],"meta":["May 2019Remote Sensing 11(9):1037","DOI:10.3390/rs11091037","Project: Point cloud processing of trees in forest plot"],"references":["328759469_Automatic_DTM_extraction_from_airborne_LiDAR_based_on_expectation-maximization","324169394_A_simple_terrain_relief_index_for_tuning_slope-related_parameters_of_LiDAR_ground_filtering_algorithms","322518469_Joint_Clusters_and_Iterative_Graph_Cuts_for_ALS_Point_Cloud_Filtering","321500340_LiDAR_Point_Clouds_to_3D_Urban_Models_A_Review","320722130_Airborne_LiDAR_Data_Filtering_Based_on_Geodesic_Transformations_of_Mathematical_Morphology","316022507_LiDAR_Filtering_of_Urban_Areas_With_Region_Growing_Based_on_Moving-Window_Weighted_Iterative_Least-Squares_Fitting","328877380_A_Comparison_of_LiDAR_Filtering_Algorithms_in_Vegetated_Mountain_Areas","324891995_A_parameter-free_progressive_TIN_densification_filtering_algorithm_for_lidar_point_clouds","322249626_Investigating_the_performances_of_commercial_and_non-commercial_software_for_ground_filtering_of_UAV-based_point_clouds","314288313_A_revised_progressive_TIN_densification_for_filtering_airborne_LiDAR_data","312480759_State-of-the-art_DTM_generation_using_airborne_LIDAR_data","305768718_Two-step_adaptive_extraction_method_for_ground_points_and_breaklines_from_lidar_point_clouds","304031267_International_Benchmarking_of_the_Individual_Tree_Detection_Methods_for_Modeling_3-D_Canopy_Structure_for_Silviculture_and_Forest_Ecology_Using_Airborne_Laser_Scanning","314107006_Airborne_laser_scanning_point_clouds_filtering_method_based_on_the_construction_of_virtual_ground_seed_points","313687636_Aerial_Lidar_Point_Cloud_Voxelization_with_its_3D_Ground_Filtering_Application"]}