{"id":"332888576_The_effects_of_exercise_and_ambient_temperature_on_dietary_intake_appetite_sensation_and_appetite_regulating_hormone_concentrations","abstract":"Background: \nIt is not clear whether the frequently reported phenomenon of exercise-induced anorexia is exacerbated or blunted in warm or cold environments. Therefore, this study investigated the effects of exercise in three different environmental temperatures vs. rest, on perceptions of appetite, appetite regulating hormones, and food intake.\n\nMethods: \nIn a randomized repeated-measures design, 18 Canadian Armed Forces members (14 male, 4 female) completed four 8-h trials in a thermally-controlled chamber: one 8-h resting trial at 21 째C (Sedentary); and three trials where participants completed two 2-h circuits of standardized military tasks interspersed with two 2-h rest periods, once at 30 째C (Hot), once at 21 째C (Temperate), and once at - 10 째C (Cold). Participants consumed military field rations ad libitum and had their appetite assessed with visual analogue scales. Plasma concentrations of GLP-1, PYY, acylated ghrelin, and leptin were also determined.\n\nResults: \nAppetite was perceived as being suppressed in the heat compared to the cold (p < 0.05). While neither exercise nor environmental temperature altered circulating GLP-1 levels, exercise in all environments increased blood concentrations of PYY (p < 0.05). Leptin concentrations were elevated in the heat and diminished in the cold (p < 0.05), and acylated ghrelin concentrations were affected by both exercise and ambient temperature resulting in Sedentary = Cold>Temperate = Hot (p < 0.05). Contrary to the changes in appetite perceptions and hormonal concentrations, dietary intake was not different between conditions (p > 0.05). Relative energy intake (total 24 h energy intake minus 24 h energy expenditure) on the other hand, was significantly higher during the Sedentary condition than it was during any of the active conditions (p < 0.05). Most (83%) of the participants were in a positive energy balance during the Sedentary condition, whereas during most (80%) of the active conditions (Hot, Temperate, Cold) participants were in a negative energy balance.\n\nConclusions: \nIn this study where food was freely available, variations in ambient temperature, exercise vs. rest, appetite-regulating hormone concentrations, and subjective appetite sensation were not associated with any changes in dietary intake within 24-h of acute, prolonged exercise.","authors":["Iva Mandic","Mavra Ahmed","Shawn Rhind","Len Goodman"],"meta":["May 2019Nutrition & Metabolism 16(1)","DOI:10.1186/s12986-019-0348-5"],"references":["320756234_Mild_cold_effects_on_hunger_food_intake_satiety_and_skin_temperature_in_humans","318463543_Acute_effects_of_exercise_on_appetite_ad_libitum_energy_intake_and_appetite-regulatory_hormones_in_lean_and_overweightobese_men_and_women","309470690_The_Effect_of_a_20_km_Run_on_Appetite_Regulation_in_Long_Distance_Runners","301480600_No_Effect_of_Exercise_Intensity_on_Appetite_in_Highly-Trained_Endurance_Women","281394097_Warm_Ambient_Temperature_Decreases_Food_Intake_in_a_Simulated_Office_Setting_A_Pilot_Randomized_Controlled_Trial","275772541_The_influence_of_environmental_temperature_on_appetite-related_hormonal_responses","352356837_Dietary_Intakes_From_Ad_Libitum_Consumption_of_Canadian_Armed_Forces_Field_Rations_Compared_With_Usual_Home_Dietary_Intakes_and_Military_Dietary_Reference_Intakes","311615043_Acute_effect_of_exercise_intensity_and_duration_on_acylated_ghrelin_and_hunger_in_men","306189906_The_Physical_Activity_Readiness_Questionnaire_for_Everyone_PAR-Q_and_electronic_Physical_Activity_Readiness_Medical_Examination_ePARmed-_X","305275698_Effect_of_heat_exposure_and_exercise_on_food_intake_regulation_A_randomized_crossover_study_in_young_healthy_men"]}