{"id":"332893829_Predicting_Students'_Performance_Using_Machine_Learning_Techniques","abstract":"The ultimate goal of any educational institution is offering the best educational experience and knowledge to the students. Identifying the students who need extra support and taking the appropriate actions to enhance their performance plays an important role in achieving that goal. In this research, four machine learning techniques have been used to build a classifier that can predict the performance of the students in a computer science subject that is offered by Al-Muthanna University (MU), College Of Humanities. The machine learning techniques include Artificial Neural Network, Naïve Bayes, Decision Tree, and Logistic Regression. This research pays extra attention to the effect of using the internet as a learning resource and the effect of the time spent by students on social networks on the students’ performance. These effects introduced by using features that measure whether the student uses the internet for learning and the time spent on the social networks by the students. The models have been compared using the ROC index performance measure and the classification accuracy. In addition, different measures have been computed such as the classification error, precision, recall, and the F measure. The dataset used to build the models is collected based on a survey given to the students and the students’ grade book. The ANN (fully connected feed forward multilayer ANN) model achieved the best performance that is equal to 0.807 and achieved the best classification accuracy that is equal to 77.04%. In addition, the decision tree model identified five factors as important factors which influence the performance of the students.","authors":["Hussein Altabrawee","Osama Ali","Samir Qaisar"],"meta":["April 2019Journal of University of Babylon for Pure and Applied Sciences 27(1):194-205","DOI:10.29196/jubpas.v27i1.2108"],"references":["308571602_Student_Academic_Performance_Prediction_Model_Using_Decision_Tree_and_Fuzzy_Genetic_Algorithm","289991570_A_Review_on_Predicting_Student's_Performance_Using_Data_Mining_Techniques","281084430_Predicting_Grades","271547000_An_application_of_classification_models_to_predict_learner_progression_in_tertiary_education","316022172_A_Machine_Learning_Approach_for_Tracking_and_Predicting_Student_Performance_in_Degree_Programs","312564259_The_influence_of_sports_participation_on_academic_performance_among_students_in_higher_education","308672789_Data_mining_techniques_for_predicting_student_performance","307572433_Using_data_mining_techniques_to_predict_students_at_risk_of_poor_performance","301476516_Educational_data_mining_for_prediction_and_classification_of_engineering_students_achievement","286678876_Predicting_student_performance_using_decision_tree_classifiers_and_information_gain"]}