{"id":"332963377_How_Can_Computer_Science_Faculties_Increase_the_Proportion_of_Women_in_Computer_Science_by_Using_Robots","abstract":"As women belong to a minority in computer\nscience, this work aims to provide possible K-12 STEM\neducation initiatives how computer science faculties can\ncontribute to increasing the proportion of women in computer\nscience by using robots. Through applying these initiatives,\nfaculties can help to reduce the gender imbalance, increase\ndiversity and the amount of computer science specialists, who\nare requested immensely. Based on the results of conducted\nrequirements elicitation a concept for programming an\napplication with the NAO robot which trains vocabularies, as\nwell as a concept with the Cozmo robot which piles up cubes,\nwere developed. First tests were performed with female and\nmale high school students. Either concept consists of an\nintroduction of possible robotics application fields, a\npresentation explaining the Python program code of the\nconcept as well as corresponding exercises with the robot and\nPython. Evaluation of the workshop concepts through\nquestionnaires showed that both concepts have the potential to\nincrease the proportion of women and to motivate female as\nwell as male students for computer science. Moreover,\nrecommendations for further robotics projects with respect to\nmotivating young women for STEM can be made based on the\ninsights of the requirements elicitation and the evaluation of\nthe concepts. Nevertheless, further refinement and validation\nhas to be undertaken. Long-term as well as short-term\ninitiatives are feasible with the developed concepts. All\nparticipating schools showed high interest in both types of\ninitiatives and further cooperation.","authors":["Lisa Keller","Isabel John"],"meta":["April 2019","DOI:10.1109/EDUCON.2019.8725212","Conference: 2019 IEEE Global Engineering Education Conference (EDUCON)At: Dubai","Project: How Can Computer Science Faculties Increase the Proportion of Women in Computer Science by Using Robots?"],"references":["331207272_How_Can_Educational_Institutions_Increase_the_Proportion_of_Women_in_Computer_Science_by_Using_Robots","322177050_Elements_of_Robotics","228918259_The_impact_of_robot_projects_on_girls'_attitudes_toward_science_and_engineering","51072674_The_thing_that_should_not_be_predictive_coding_and_the_uncanny_valley_in_perceiving_human_and_humanoid_robot_actions","309777746_Robotics_and_programming_Attracting_girls_to_technology","305719523_Robotics_for_Education","272087835_The_Uncanny_Valley","243784891_Requirements-Engineering_und-Management"]}