{"id":"332997468_Parameter_Estimation_of_Multi_Frequency_Hopping_Signals_Based_on_Space-Time-Frequency_Distribution","abstract":"Frequency hopping spread spectrum (FHSS) communication is widely used in military and civil communication, and the parameter estimation of frequency hopping (HF) signals is of great significance. In order to estimate the parameters of multiple frequency hopping signals effectively, a blind parameter estimation algorithm based on space-time frequency analysis (STFA) and matrix joint diagonalization (JDM) is proposed. Firstly, the time domain signal received by the linear array is converted to the space-time frequency domain through the space-time frequency transformation, and the space-time frequency distribution (STFD) of the signal is obtained. Then the time-frequency point is extracted from the space-time frequency distribution map, the extraction of the hop is completed by the method of finding an “island”, and the space-time frequency matrix of each hop is constructed, and then the preliminary estimation of each jump frequency, jump time and jump period is completed. Finally, the space-time-frequency matrix of the same hop received by different array elements is jointly diagonalized by the matrix joint diagonalization algorithm, and the diagonalization matrix is obtained. On the basis of the diagonalization matrix, the root-MUSIC algorithm is used to complete the direction of arrival (DOA) estimation of the frequency hopping signal and the separation of the frequency hopping radio. The simulation results show that the proposed algorithm is effective in parameter estimation of multi-hopping signals. It can estimate the parameters of −4 dB signal-to-noise ratio (SNR). The accuracy rate of parameter (hop period, DOA, hop start time, hop end time, frequency hopping frequency set) estimation reaches 73.26%, and the sparse linear regression (SLR) algorithm reaches 70.15%. When the signal-to-noise ratio reaches 5 dB, the accuracy of estimation can reach 94.74%, and the SLR reach 85.64%. It has a good effect on parameter estimation of multi-hopping signals.","authors":["Wan","Zhang","Longfei Xu","Guo Anfu"],"meta":["May 2019Symmetry 11(5):648","DOI:10.3390/sym11050648"],"references":["332136324_A_New_Interpretation_of_S-Transform_Spectrum_Phase_Hopping_Analysis_and_Estimation","327645755_Harmonic_Sierpinski_Gasket_and_Applications","326855803_Hardware-in-the-Loop_Methods_for_Real-Time_Frequency-Response_Measurements_of_on-Board_Power_Distribution_Systems","324225860_Parameter_Estimation_of_Multiple_Frequency-Hopping_Signals_with_Two_Sensors","319579503_A_Parameter_Estimation_Algorithm_for_Multiple_Frequency-Hopping_Signals_Based_on_Sparse_Bayesian_Method","333535504_Cascading_time-frequency_domain_filtered-x_LMS_algorithm_for_active_control_of_uncorrelated_disturbances","330234523_A_Parameter_Estimation_Algorithm_for_Frequency-Hopping_Signals_with_a_Stable_Noise","328328480_Blind_Separation_of_Temporally_Correlated_Noncircular_Sources_Using_Complex_Matrix_Joint_Diagonalization","323998988_Adaptive_frequency-hopping_schemes_for_CR-based_multi-link_satellite_networks_Adaptive_frequency-hopping_schemes_for_CR-based_multilink_satellite_networks","320986570_A_robust_parameter_estimation_of_FHSS_signals_using_time-frequency_analysis_in_a_non-cooperative_environment"]}