{"id":"332996647_CHALLENGES_IN_THE_DEPLOYMENT_AND_OPERATION_OF_MACHINE_LEARNING_IN_PRACTICE","abstract":"Machine learning has recently emerged as a powerful technique to increase operational efficiency or to develop new value propositions. However, the translation of a prediction algorithm into an operationally usable machine learning model is a time-consuming and in various ways challenging task. In this work, we target to systematically elicit the challenges in deployment and operation to enable broader practical dissemination of machine learning applications. To this end, we first identify relevant challenges with a structured literature analysis. Subsequently, we conduct an interview study with machine learning practitioners across various industries, perform a qualitative content analysis, and identify challenges organized along three distinct categories as well as six overarching clusters. Eventually, results from both literature and interviews are evaluated with a comparative analysis. Key issues identified include automated strategies for data drift detection and handling, standardization of machine learning infrastructure, and appropriate communication and expectation management.","authors":["Lucas Baier","Fabian Jöhren","Stefan Seebacher"],"meta":["May 2019","Conference: ECIS 2019 - 27th European Conference on Information SystemsAt: Stockholm"],"references":["325156808_Massive_datasets_and_machine_learning_for_computational_biomedicine_trends_and_challenges","325152736_A_local_expansion_propagation_algorithm_for_social_link_identification","325107577_A_Comprehensive_Survey_on_Machine_Learning_for_Networking_Evolution_Applications_and_Research_Opportunities","324088381_Machine_learning_challenges_and_impact_An_interview_with_Thomas_Dietterich","322557880_Machine_learning_and_statistical_approaches_for_big_data_Issues_challenges_and_research_directions","325637617_SCALENet_A_SCalable_Low_power_AccELerator_for_Real-time_Embedded_Deep_Neural_Networks","324100898_Applied_Machine_Learning_at_Facebook_A_Datacenter_Infrastructure_Perspective","323661651_Feature_selection_in_machine_learning_A_new_perspective","323347934_Machine_learning_for_engineering","322672201_Novel_Trends_in_Scaling_Up_Machine_Learning_Algorithms"]}