{"id":"332974035_Modelagem_Matematica_como_Estrategia_de_Ensino_de_Topicos_de_Estatistica_na_Formacao_Basica_Tecnica_uma_Aplicacao_na_Criacao_de_Frangos_Caipiras","abstract":"Resumo Este trabalho propõe uma abordagem de ensino de tópicos de estatística no ensino médio técnico, tendo como referência os procedimentos adotados pela modelagem matemática e inseridos num ambiente investigativo, contextualizado e interdisciplinar com contribuições para o ensino de estatística, sendo considerada uma ferramenta metodológica na orientação e direcionamento do ensino, por meio das etapas de interação do conteúdo abordado, matematização da situação e avaliação dos resultados. Tem-se como proposta uma aplicação na criação de frangos caipiras, que conduziu à análise de dois modelos de regressão para representar a relação entre as variáveis envolvidas, sendo estes: modelo linear e modelo quadrático. A avaliação dos modelos permitiu a escolha da regressão mais adequada, optando pelo modelo quadrático por apresentar maior coeficiente de explicação (R-quadrado). A culminância do trabalho reflete na utilização da \"tríplice\": planejamento de ações, inserção dos conteúdos à realidade dos discentes e na associação estabelecida entre as diversas disciplinas, como tendência na promoção de um efetivo aprendizado. Palavras-chave: Estatística, Modelagem Matemática, Aplicação.","authors":["José Ailton Rodrigues","Aline Amorim","Eudes Antonio Costa","Idemar Vizolli"],"meta":["May 2019Revista de Ensino de Ciências e Matemática 9(5)","DOI:10.26843/rencima.v9i5.1849"],"references":["335075111_Educacao_Estatistica_critica_um_olhar_sobre_os_processos_educativos","325973867_Modelagem_Matematica_no_Ensino_Medio_uma_possibilidade_de_aprendizagem_a_partir_de_contas_de_agua","282497035_Niveis_de_inclusao_do_bagaco_de_mandioca_na_racao_de_frangos_de_crescimento_lento_caracteristicas_fisico-quimicas_da_carne","242289078_Modelagem_Matematica_Uma_disciplina_emergente_nos_programas_de_formac_ao_de_professores","335073140_PENSAMENTO_ESTATISTICO_EM_UMA_ATIVIDADE_DE_MODELAGEM_MATEMATICA_RESSIGNIFICANDO_O_LANCAMENTO_DE_AVIOES_DE_PAPEL","242782389_Uma_Proposta_de_Modelagem_Matematica_como_Estrategia_de_Ensino"]}