{"id":"332987868_The_Influence_of_Critical_Factors_on_Business_Model_at_a_Smart_Factory_A_Case_Study","abstract":"Background: The crucial elements of a smart factory, employees, machines, and products, have an important effect on current business models. Objectives: The main aim of our study is to present a case study of the impact of Industry 4.0 on the business model in a smart factory. The paper discusses the changes of business models of the organisation and determines critical factors that influence the business models in a knowledge society. Methods/Approach: Our sample included managers, from the company TPV, who are in charge of implementing a digital business model, and who are the most knowledgeable informants on the topic of our study. Data was obtained from, most widely used method for data collection in qualitative research, semi-structured interviews with managers. Content analysis was conducted for the purpose of our study. Results: Results of our study show that the major change will be that machines will have a “mind” of their own, whose main goal will be to work in production, and the role of employees will be primarily in expressing their creativity, carrying out urgent interventions and performing custody of processes. The key critical factors influencing business models in a smart factory are top management and leadership orientations, motivation of employees, collective wisdom, creativity and innovations. Conclusions: The study represents useful guidelines for strategic management of innovative companies in the earliest stages of the process of decision-making process.","authors":["Andrej Jerman","Ivan Erenda","Andrej Bertoncelj"],"meta":["April 2019Business Systems Research Journal 10(1):42-52","DOI:10.2478/bsrj-2019-0004"],"references":["323454811_KNOWLEDGE_MANAGEMENT_AND_E-BUSINESS","315119305_The_Challenges_of_Sustainable_Business_Development_in_the_Post-Industrial_Society_in_the_First_Half_of_the_21st","301860128_A_complexity_view_of_Industry_40","343976160_The_Challenges_of_Sustainable_Business_Development_in_the_Post-Industrial_Society_in_the_First_Half_of_the_21st_Century","333853986_Digital_Transformation_in_Education","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","316816417_Managing_Green_Business_Model_Transformations","313660971_Sustainable_management_models_innovating_through_Permaculture","313082025_Knowledge_management_and_knowledge_management_systems_conceptual_foundations_and_research_issues","296159902_Business_Models_for_Sustainability_A_Co-Evolutionary_Analysis_of_Sustainable_Entrepreneurship_Innovation_and_Transformation"]}