{"id":"332917250_PELICAN_deeP_architecturE_for_the_LIght_Curve_ANalysis","abstract":"We developed a deeP architecturE for the LIght Curve ANalysis (PELICAN) for the characterization and the classification of supernovae light curves. It takes light curves as input, without any additional features. PELICAN can deal with the sparsity and the irregular sampling of light curves. It is designed to remove the problem of non-representativeness between the training and test databases coming from the limitations of the spectroscopic follow-up. We applied our methodology on different supernovae light curve databases. First, we tested PELICAN on the Supernova Photometric Classification Challenge for which we obtained the best performance ever achieved with a non-representative training database, by reaching an accuracy of 0.811. Then we tested PELICAN on simulated light curves of the LSST Deep Fields for which PELICAN is able to detect 87.4% of supernovae Ia with a precision higher than 98%, by considering a non-representative training database of 2k light curves. PELICAN can be trained on light curves of LSST Deep Fields to classify light curves of the LSST main survey, which have a lower sampling rate and are more noisy. In this scenario, it reaches an accuracy of 96.5% with a training database of 2k light curves of the Deep Fields. This constitutes a pivotal result as type Ia supernovae candidates from the main survey might then be used to increase the statistics without additional spectroscopic follow-up. Finally we tested PELICAN on real data from the Sloan Digital Sky Survey. PELICAN reaches an accuracy of 86.8% with a training database composed of simulated data and a fraction of 10% of real data. The ability of PELICAN to deal with the different causes of non-representativeness between the training and test databases, and its robustness against survey properties and observational conditions, put it in the forefront of light curve classification tools for the LSST era.","authors":["Johanna Pasquet","Jérôme Pasquet","Marc Chaumont","Dominique Fouchez"],"meta":["May 2019Astronomy and Astrophysics 627","DOI:10.1051/0004-6361/201834473","Project: A CNN adapted to time series for the classification of Supernovae"],"references":["329103170_Photometric_redshifts_from_SDSS_images_using_a_convolutional_neural_network","321124896_Improving_galaxy_morphologies_for_SDSS_with_Deep_Learning","320195365_The_Complete_Light-curve_Sample_of_Spectroscopically_Confirmed_Type_Ia_Supernovae_from_Pan-STARRS1_and_Cosmological_Constraints_from_The_Combined_Pantheon_Sample","312594350_Photometric_classification_and_redshift_estimation_of_LSST_Supernovae","345503484_A_CNN_adapted_to_time_series_for_the_classification_of_Supernovae","321665815_Deep_learning_Approach_for_Classifying_Detecting_and_Predicting_Photometric_Redshifts_of_Quasars_in_the_Sloan_Digital_Sky_Survey_Stripe_82","319391576_Convolutional_Neural_Networks_for_Transient_Candidate_Vetting_in_Large-Scale_Surveys","306357400_Photometric_classification_of_type_Ia_supernovae_in_the_SuperNova_Legacy_Survey_with_supervised_learning","304470293_Deep_Recurrent_Neural_Networks_for_Supernovae_Classification","301872699_Photometric_Supernova_Classification_With_Machine_Learning"]}