{"id":"332996102_Centrality_in_modular_networks","abstract":"Identifying influential nodes in a network is a fundamental issue due to its wide applications, such as accelerating information diffusion or halting virus spreading. Many measures based on the network topology have emerged over the years to identify influential nodes such as Betweenness, Closeness, and Eigenvalue centrality. However, although most real-world networks are made of groups of tightly connected nodes which are sparsely connected with the rest of the network in a so-called modular structure, few measures exploit this property. Recent works have shown that it has a significant effect on the dynamics of networks. In a modular network, a node has two types of influence: a local influence (on the nodes of its community) through its intra-community links and a global influence (on the nodes in other communities) through its inter-community links. Depending on the strength of the community structure, these two components are more or less influential. Based on this idea, we propose to extend all the standard centrality measures defined for networks with no community structure to modular networks. The so-called “Modular centrality” is a two-dimensional vector. Its first component quantifies the local influence of a node in its community while the second component quantifies its global influence on the other communities of the network. In order to illustrate the effectiveness of the Modular centrality extensions, comparison with their scalar counterparts is performed in an epidemic process setting. Simulation results using the Susceptible-Infected-Recovered (SIR) model on synthetic networks with controlled community structure allows getting a clear idea about the relation between the strength of the community structure and the major type of influence (global/local). Furthermore, experiments on real-world networks demonstrate the merit of this approach.","authors":["Zakariya Ghalmane","Mohammed El Hassouni","Chantal Cherifi","Hocine Cherifi"],"meta":["December 2019EPJ Data Science 8(1)","DOI:10.1140/epjds/s13688-019-0195-7"],"references":["335091513_Immunization_of_networks_with_non-overlapping_community_structure","328992003_Betweenness_Centrality_for_Networks_with_Non-Overlapping_Community_Structure","326385494_Social_centrality_using_network_hierarchy_and_community_structure","323355763_Community_Detection_with_Metadata_in_a_Network_of_Biographies_of_Western_Art_Painters","320223718_Epidemic_spreading_in_modular_time-varying_networks","324634190_An_Efficient_Immunization_Strategy_Using_Overlapping_Nodes_and_Its_Neighborhoods","317550406_Vaccination_and_epidemics_in_networked_populations-An_introduction","309095047_A_local_immunization_strategy_for_networks_with_overlapping_community_structure","305780197_Community_detection_in_networks_A_user_guide","305488779_Dynamics_of_information_diffusion_and_its_applications_on_complex_networks"]}