{"id":"332914171_Vertex_colouring_using_the_adjacency_matrix","abstract":"Recently, graph theory is one of the most rapidly developing sciences. Graphs in its applications are generally used to represent discrete objects and relationships between these objects. The visual representation of a graph is to declare an object as a vertex, while the relationship between objects is expressed as an edge. One topic in graph theory is colouring. This graph colouring is divided into vertex colouring, edge colouring and area colouring. The problem of the vertex colouring is to determine the minimum number of colours to colour the vertex so that the interconnected vertex has different colours. The problem of edge colouring is to determine the minimum number of colours to colour the edge so that the interconnected edge has different colours. The problem with area colouring is to determine the minimum number of colours to colour the area so that the adjacent area has a different colour. In this article the discussion will focus on the problem of vertex colouring. Previously there have been several vertex colouring methods, such as the Welch Powell method and the backtracking method. In this paper we will discuss the method of vertex colouring using the adjacent matrix. Adjacent matrix (M) is a square matrix where the element Mij is 1 if ViVj is connected and element Mij is 0 if ViVj is not connected. In the discussion, this method is presented in the form of the pseducode and flowchart so that it can be computerized more easily. The novelty of this research is to detect the character of the adjacency matrix so that it can apply to vertex colouring through the matrix.","authors":["Kiswara Agung Santoso","D. Dafik","Ika Hesti Agustin","Rafiantika Megahnia Prihandini"],"meta":["April 2019Journal of Physics Conference Series 1211(1):012019","DOI:10.1088/1742-6596/1211/1/012019","Project: Vertex colouring using the adjacency matrix"],"references":["311452801_FUZZY_TOTAL_COLORING_OF_FUZZY_GRAPHS","242793996_On_automorphisms_of_fuzzy_graphs","220646312_Fuzzy_line_graphs","220397986_A_Generalization_of_the_Gallai-Roy_Theorem","220397574_Simple_Proofs_of_Results_on_Paths_Representing_All_Colors_in_Proper_Vertex-Colorings","4110151_Automatic_channel_allocation_for_small_Wireless_Local_Area_networks_using_graph_colouring_algorithm_approach"]}