{"id":"332980065_Microbial_gardening_by_a_seaweed_holobiont_Surface_metabolites_attract_protective_and_deter_pathogenic_epibacterial_settlement","abstract":"1. Epimicrobial communities on seaweed surfaces usually contain not only potentially pathogenic but also potentially beneficial microorganisms. Capacity of terrestrial plants for chemically mediated recruitment, that is, \"gardening\" of bacterial communities in the rhizosphere was recently demonstrated. Empirical evidence directly linking such chemical \"gardening\" with the beneficial role of gardened microbes in terrestrial plants is rare and largely missing for aquatic macrophytes. 2. Here, we demonstrate that our model invasive seaweed holobiont Agarophyton vermiculophyllum possesses beneficial microbiota on its surface that provide protection from bacterial pathogens. Metabolites from the algal holobiont's surface reduced settlement of opportunistic pathogens but attracted protective epibacte-rial settlement. 3. We tested 58 different bacterial species (isolated from the surface of A. vermicu-lophyllum) individually in tip bleaching assays. Kordia algicida was identified as a \"significant pathogen\" inducing a bleaching disease. In addition, nine other species significantly reduced the risk of algal bleaching and were thus \"significantly protective\". Additionally, two \"potential pathogens\" and 10 \"potential protectors\" were identified. When 19 significant and potential protectors and 3 significant and potential pathogens were tested together, the protective strains fully prevented bleaching, suggesting that a component of A. vermiculophyllum's epimicrobiome provides an associational defence against pathogens. Chemically mediated selective recruitment of microbes was demonstrated in bioassays, where A. vermicu-lophyllum surface metabolites attracted the settlement of protective strains, but reduced settlement of pathogens. 4. Synthesis. The capacity of an aquatic macrophyte to chemically \"garden\" protective microorganisms to the benefit of strengthened disease resistance is demonstrated for the first time. Such a role of surface chemistry in \"gardening\" of microbes as found in the current study could also be applicable to other host plant-microbe interactions. Our results may open new avenues towards manipulation of the surface microbiome of seaweeds via chemical \"gardening,\" enhancing sustainable production of healthy seaweeds.","authors":["Mahasweta Saha","Florian Weinberger"],"meta":["April 2019Journal of Ecology 107(2):1-11","DOI:10.1111/1365-2745.13193","Project: Antifouling defence of Seaweeds"],"references":["330862984_Interactions_within_the_microbiome_alter_microbial_interactions_with_host_chemical_defences_and_affect_disease_in_a_marine_holobiont","328674201_Systematics_of_the_Gracilariales_Rhodophyta_including_new_subfamilies_tribes_subgenera_and_two_new_genera_Agarophyton_gen_nov_and_Crassa_gen_nov","320906117_Minireview_algal_natural_compounds_and_extracts_as_antifoulants","315742091_Mechanisms_for_Pseudoalteromonas_piscicida-Induced_Killing_of_Vibrios_and_Other_Bacterial_Pathogens","303333741_Rapid_adaptation_to_controlling_new_microbial_epibionts_in_the_invaded_range_promotes_invasiveness_of_an_exotic_seaweed","292608092_The_role_of_chemically_defended_seaweeds_as_biodiversity_sources","289366929_Plant_root-microbe_communication_in_shaping_root_microbiomes","322159031_Macroalgal-bacterial_interactions_Role_of_dimethylsulfoniopropionate_in_microbial_gardening_by_Ulva_Chlorophyta","302450070_Marine_epibiosis_I_Fouling_and_antifouling_some_basic_aspects","282104780_Relative_roles_of_niche_and_neutral_processes_in_structuring_a_soil_microbial_community"]}