{"id":"332990752_A_convolutional_neural_network-based_system_to_prevent_patient_misidentification_in_FDG-PET_examinations","abstract":"Patient misidentification in imaging examinations has become a serious problem in clinical settings. Such misidentification could be prevented if patient characteristics such as sex, age, and body weight could be predicted based on an image of the patient, with an alert issued when a mismatch between the predicted and actual patient characteristic is detected. Here, we tested a simple convolutional neural network (CNN)-based system that predicts patient sex from FDG PET-CT images. This retrospective study included 6,462 consecutive patients who underwent whole-body FDG PET-CT at our institute. The CNN system was used for classifying these patients by sex. Seventy percent of the randomly selected images were used to train and validate the system; the remaining 30% were used for testing. The training process was repeated five times to calculate the system’s accuracy. When images for the testing were given to the learned CNN model, the sex of 99% of the patients was correctly categorized. We then performed an image-masking simulation to investigate the body parts that are significant for patient classification. The image-masking simulation indicated the pelvic region as the most important feature for classification. Finally, we showed that the system was also able to predict age and body weight. Our findings demonstrate that a CNN-based system would be effective to predict the sex of patients, with or without age and body weight prediction, and thereby prevent patient misidentification in clinical settings.","authors":["Keisuke Kawauchi","Kenji Hirata","Chietsugu Katoh","Seiya Ichikawa"],"meta":["May 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-43656-y"],"references":["329941610_Ultra-Low-Dose_18_F-Florbetaben_Amyloid_PET_Imaging_Using_Deep_Learning_with_Multi-Contrast_MRI_Inputs","324511389_Automatic_lesion_detection_and_segmentation_of_18F-FET_PET_in_gliomas_A_full_3D_U-Net_convolutional_neural_network_study","322336604_Automated_Whole-Body_Bone_Lesion_Detection_for_Multiple_Myeloma_on_68_Ga-Pentixafor_PETCT_Imaging_Using_Deep_Learning_Methods","322112114_Modeling_the_effects_of_age_and_gender_on_normal_pediatric_brain_metabolism_using_F18-FDG_PETCT","321933558_Computer-Aided_Diagnosis_Based_on_Convolutional_Neural_Network_System_for_Colorectal_Polyp_Classification_Preliminary_Experience","328779237_Full-Dose_PET_Image_Estimation_from_Low-Dose_PET_Image_Using_Deep_Learning_a_Pilot_Study","328727048_Automated_Detection_of_Lung_Cancer_at_Ultralow_dose_PETCT_by_Deep_Neural_Networks_-_Initial_results","321658445_Generation_of_Structural_MR_Images_from_Amyloid_PET_Application_to_MR-Less_Quantification","321435989_From_Images_to_Actions_Opportunities_for_Artificial_Intelligence_in_Radiology","321429690_When_Machines_Think_Radiology's_Next_Frontier"]}