{"id":"332925519_Percepcoes_de_alunos_da_primeira_serie_do_ensino_medio_acerca_das_mudancas_climaticas_globais","abstract":"Evidências têm apontado para uma relação entre o atual cenário das mudanças climáticas globais e a crescente emissão de Gases de Efeito Estufa (GEE) através de fontes antrópicas. Tal relação mostra a urgente necessidade da formação de cidadãos engajados com as questões ambientais. O presente trabalho buscou verificar as percepções de alunos da 1ª série do ensino médio de uma escola da rede estadual do município de Aracaju, SE, acerca das mudanças climáticas globais e fenômenos relacionados. Também teve por objetivos levantar as principais fontes de informação a respeito do tema e mediar o conhecimento acadêmico sobre as mudanças climáticas através de uma aula expositiva com posterior análise da estrutura conceitual dos alunos através do uso de mapas conceituais. A escola, internet e televisão foram os principais meios através dos quais os alunos obtiveram informações a respeito da temática. A maioria dos alunos participantes da pesquisa acredita que suas ações não contribuem para o aquecimento global, o que sugere uma dificuldade por parte destes em visualizarem as relações existentes entre suas práticas cotidianas e as emissões de GEE, demonstrando pouco conhecimento sobre os temas em estudo. O planejamento da aula teve como base os conhecimentos prévios dos alunos. No entanto, apesar da correção de equívocos conceituais em relação ao assunto, a comparação entre os MCs elaborados pelos alunos antes e após a aula de intervenção mostrou pouca aquisição dos conhecimentos mediados, evidenciando a necessidade do uso de abordagens complementares às tradicionais aulas expositivas dialogadas visando a aprendizagem significativa.","authors":["Maiara Pedral Dos Santos","Luzia Cristina de Melo Santos Galvão","Alexandre De Siqueira Pinto"],"meta":["February 2019Scientia Plena 15(1)","DOI:10.14808/sci.plena.2019.012701"],"references":["309825032_MUDANCAS_CLIMATICAS_EM_PUBLICACOES_BRASILEIRAS_DE_EDUCACAO_AMBIENTAL","279469927_ANIMACOES_INTERATIVAS_E_MAPAS_CONCEITUAIS_UMA_PROPOSTA_PARA_FACILITAR_A_APRENDIZAGEM_SIGNIFICATIVA_EM_CIENCIAS","277879838_Dirigindo_o_olhar_para_o_Efeito_Estufa_nos_Livros_Didaticos_de_Ensino_Medio_e_simples_entender_esse_fenomeno","270198753_Conceitos_culturais_e_a_experiencia_dolorosa","268360743_Elementos_para_desenvolver_abordagens_tematicas_na_perspectiva_socioambiental_complexa_e_reflexiva","267232469_Mudanca_climatica_protocolo_de_Kyoto_e_mercado_de_creditos_de_carbono_desafios_a_governanca_ambiental_global","266374402_Causa_do_aquecimento_global_antropogenica_versus_natural","291439894_Os_mitos_a_respeito_das_doencas_cardiovasculares","277152662_MUDANCAS_CLIMATICAS_E_AQUECIMENTO_GLOBAL_CONTROVERSIAS_INCERTEZAS_E_A_DIVULGACAO_CIENTIFICA","270719582_Jornalismo_Ambiental_explorando_alem_do_conceito"]}