{"id":"333044653_Trajectoires_et_processus_fluviaux_dans_la_moyenne_vallee_du_Cher_du_Tardiglaciaire_a_la_periode_actuelle_Metamorphose_fluviale_reponses_aux_forcages_societaux_et_ajustements_des_chenaux_et_des_bras_m","abstract":"Ces recherches doctorales proposent l’étude à plusieurs échelles temporelles d’un système fluvial de taille moyenne, peu énergique, dans un contexte marqué par la variabilité des forçages climatiques et anthropiques (Tardiglaciaire et Holocène). La démarche scientifique s’articule autour de trois objectifs principaux : mettre en lumière le processus de métamorphose fluviale sous contrôle climatique à la transition entre le Tardiglaciaire et l’Holocène ; caractériser l’évolution morphologique et fonctionnelle des chenaux sinueux sous contrôle climato-anthropique ; étudier les évolutions des bras morts au pas de temps pluri-centennal à pluri-millénaire ainsi que leur rôle dans le fonctionnement hydrologique actuel de la plaine d’inondation. Les résultats mettent tout d’abord en évidence l’occurrence d’une métamorphose fluviale enregistrée à la charnière entre le Tardiglaciaire et l’Holocène. Cette mutation morphologique semble présenter une certaine originalité par rapport aux systèmes fluviaux analogues. En effet, elle se caractérise par une série d’ajustements latéraux et présente peu de marqueurs d’une instabilité morphodynamique forte. Ensuite, treize recoupements de paléochenaux sinueux ont été datés entre ca 6000 cal BP et le Moyen-Age central dans un contexte\nd’anthropisation croissante. Cet assemblage de chenaux, puis de bras morts, est bien loin de constituer un corpus homogène du point de vue morphologique et fonctionnel. Enfin, l’étude sur le temps long de l’évolution post-abandon des bras morts nous a permis de démontrer que les paléochenaux jouent un rôle déterminant dans les processus d’inondation de la plaine alluviale, illustrant ainsi la notion d’héritage. Cette approche témoigne également du fait que le fonctionnement actuel des paléochenaux trouve un écho dans l’évolution, en particulier historique, du paysage fluvial.","authors":["Anaëlle Vayssière"],"meta":["May 2019","Thesis for: PhDAdvisor: Emmanuèle Gautier - Cyril Castanet","Project: AGES - Ancient Geomorphological EvolutionS - Evolutions géomorphologiques anciennes dans le bassin de la Loire"],"references":[]}