{"id":"333040574_Optimization_of_multi-period_supply_planning_under_stochastic_lead_times_and_a_dynamic_demand","abstract":"Supply planning and inventory control are vital in Supply Chain (SC) optimization processes for companies that aim to produce highest-quality finished product at lowest cost and right on time. Optimization means planners’ need to reduce average stock levels and determine the optimal safety lead-times. This study deals with a multi-period production planning problem with a known dynamic demand. Order lead-times are independent, discrete random variables with known and bounded probability distributions. A general probabilistic model, including a recursive procedure to calculate the expected total cost (ETC), is derived. A genetic algorithm (GA) is developed for this model to determine planned lead-times and safety stock level while minimizing the ETC, where ETC is the sum of expected backlogging cost (ETBC) and expected inventory holding cost (ETHC). This approach is then compared to three other classical models to test its efficiency. The results prove that, under certain assumptions, it could be better to optimize planned lead-times rather than implement safety stocks. To understand the effect of lead-time dispersion on solution robustness, different levels of variance and different shapes of lead-time distributions are studied. Analysis proves that the lead-time variability has little effect on ETC when unit inventory holding cost is close to unit backlogging cost.","authors":["Oussama Ben-Ammar","Belgacem Bettayeb","Alexandre Dolgui"],"meta":["December 2019International Journal of Production Economics 218:106-117","DOI:10.1016/j.ijpe.2019.05.003","Project: Supply chain design resilience assessment with structure dynamics considerations"],"references":["321271540_Planned_lead_times_optimization_for_multi-level_assembly_systems_under_uncertainties","320404157_Supply_planning_optimization_for_linear_production_system_with_stochastic_lead-times_and_quality_control","318019755_Review_of_Multi-Supplier_Inventory_Models_in_Supply_Chain_Management_An_Update","317989346_Applying_inventory_classification_to_a_large_inventory_management_system","298902095_On_Theory_in_Supply_Chain_Uncertainty_and_its_Implications_for_Supply_Chain_Integration","313191413_Estimating_flow_times_for_containerized_imports_from_Asia_to_the_United_States_through_the_Western_rail_network","305484173_Impact_of_lead_time_variability_in_supply_chain_risk_management","305462885_Supply_and_Demand_Uncertainty_Reduction_Efforts_and_Cost_Comparison","289365295_A_dynamic_programming_approach_to_integrated_assembly_planning_and_supplier_assignment_with_lead_time_constraints","284331710_Determining_Optimal_Number_of_Suppliers_in_a_Multiple_Sourcing_Model_under_Stochastic_Lead_Times"]}