{"id":"333050573_Word_Sense_Disambiguation_Using_Cosine_Similarity_Collaborates_with_Word2vec_and_WordNet","abstract":"Words have different meanings (i.e., senses) depending on the context. Disambiguating the correct sense is important and a challenging task for natural language processing. An intuitive way is to select the highest similarity between the context and sense definitions provided by a large lexical database of English, WordNet. In this database, nouns, verbs, adjectives, and adverbs are grouped into sets of cognitive synonyms interlinked through conceptual semantics and lexicon relations. Traditional unsupervised approaches compute similarity by counting overlapping words between the context and sense definitions which must match exactly. Similarity should compute based on how words are related rather than overlapping by representing the context and sense definitions on a vector space model and analyzing distributional semantic relationships among them using latent semantic analysis (LSA). When a corpus of text becomes more massive, LSA consumes much more memory and is not flexible to train a huge corpus of text. A word-embedding approach has an advantage in this issue. Word2vec is a popular word-embedding approach that represents words on a fix-sized vector space model through either the skip-gram or continuous bag-of-words (CBOW) model. Word2vec is also effectively capturing semantic and syntactic word similarities from a huge corpus of text better than LSA. Our method used Word2vec to construct a context sentence vector, and sense definition vectors then give each word sense a score using cosine similarity to compute the similarity between those sentence vectors. The sense definition also expanded with sense relations retrieved from WordNet. If the score is not higher than a specific threshold, the score will be combined with the probability of that sense distribution learned from a large sense-tagged corpus, SEMCOR. The possible answer senses can be obtained from high scores. Our method shows that the result (50.9% or 48.7% without the probability of sense distribution) is higher than the baselines (i.e., original, simplified, adapted and LSA Lesk) and outperforms many unsupervised systems participating in the SENSEVAL-3 English lexical sample task.","authors":["Korawit Orkphol","Wu Yang"],"meta":["May 2019Future Internet 11(5):114","DOI:10.3390/fi11050114"],"references":["311314265_Short_Text_Similarity_with_Word_Embeddings","308896339_Comparative_study_of_LSA_vs_Word2vec_embeddings_in_small_corpora_a_case_study_in_dreams_database","284576917_Glove_Global_Vectors_for_Word_Representation","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","318740751_Beyond_Binary_Labels_Political_Ideology_Prediction_of_Twitter_Users","308161218_Introduction_to_information_retrieval_chapt","305388986_Enriching_Word_Vectors_with_Subword_Information","292766142_Modern_Information_Retrieval_A_Brief_Overview","289629796_Discovering_Consumer_Insight_from_Twitter_via_Sentiment_Analysis"]}