{"id":"333007034_Split_Multiplicative_Multi-View_Subspace_Clustering","abstract":"Various subspace clustering methods have been successively developed to process multi-view datasets. Most of the existing methods try to obtain a consensus structure coefficient matrix based on view-specific subspace recoveries. However, since view-specific structures contain individualized components that are intrinsically different from the consensus structure, directly adopting view-specific subspace structures might not be a reasonable choice. With this concern in mind, our goal in this paper is to seek novel strategies to extract valuable components from view-specific structures that are consistent with the consensus subspace structure. To this end, we propose a novel multi-view subspace clustering method named Split Multiplicative Multi-view Subspace Clustering (SM2SC) with the joint strength of a multiplicative decomposition scheme and a variable splitting scheme. Specifically, the multiplicative decomposition scheme effectively guarantees the structural consistency of the extracted components. Then the variable splitting scheme takes a step further via extracting the structural consistent components from view-specific structures. Furthermore, an alternating optimization algorithm is proposed to optimize the resulting optimization problem, which is non-convex and constrained. We prove that this algorithm could converge to a critical point. Finally, we provide empirical studies on real-world datasets that speak to the practical efficacy of our proposed method. The source code is released on GitHub.","authors":["Zhiyong Yang","Qianqian Xu","Weigang Zhang","Xiaochun Cao"],"meta":["May 2019IEEE Transactions on Image Processing PP(99):1-1","DOI:10.1109/TIP.2019.2913096"],"references":["328479701_Generalized_Latent_Multi-View_Subspace_Clustering","322549344_Subspace_Clustering_by_Block_Diagonal_Representation","320971546_Latent_Multi-view_Subspace_Clustering","311609883_Discriminatively_Embedded_K-Means_for_Multi-view_Clustering","330768940_Adaptive_ADMM_for_Dictionary_Learning_in_Convolutional_Sparse_Representation","320964496_Exclusivity-Consistency_Regularized_Multi-view_Subspace_Clustering","320481042_Implicit_Block_Diagonal_Low-Rank_Representation","318830614_Self-weighted_Multiview_Clustering_with_Multiple_Graphs","316447892_Manifold_Regularized_Multi-view_Subspace_Clustering_for_image_representation","313487833_A_tutorial_on_spectral_clustering"]}