{"id":"333064921_Predictive_Models_of_Student_College_Commitment_Decisions_Using_Machine_Learning","abstract":"Every year, academic institutions invest considerable effort and substantial resources to influence, predict and understand the decision-making choices of applicants who have been offered admission. In this study, we applied several supervised machine learning techniques to four years of data on 11,001 students, each with 35 associated features, admitted to a small liberal arts college in California to predict student college commitment decisions. By treating the question of whether a student offered admission will accept it as a binary classification problem, we implemented a number of different classifiers and then evaluated the performance of these algorithms using the metrics of accuracy, precision, recall, F-measure and area under the receiver operator curve. The results from this study indicate that the logistic regression classifier performed best in modeling the student college commitment decision problem, i.e., predicting whether a student will accept an admission offer, with an AUC score of 79.6%. The significance of this research is that it demonstrates that many institutions could use machine learning algorithms to improve the accuracy of their estimates of entering class sizes, thus allowing more optimal allocation of resources and better control over net tuition revenue.","authors":["Kanadpriya Basu","Treena Basu","Ron Buckmire","Nishu Lal"],"meta":["May 2019Data 4(2):65","DOI:10.3390/data4020065","Project: Data Science and Machine Learning"],"references":["345729199_Predicting_Dropout_Student_An_Application_of_Data_Mining_Methods_in_an_Online_Education_Program","327931490_Improving_the_evaluation_process_of_students'_performance_utilizing_a_decision_support_software","322371678_Machine_Learning-Based_App_for_Self-Evaluation_of_Teacher-Specific_Instructional_Style_and_Tools","317585044_A_note_on_large-scale_logistic_prediction_Using_an_approximate_graphical_model_to_deal_with_collinearity_and_missing_data","313105048_Collinearity_a_review_of_methods_to_deal_with_it_and_a_simulation_study_evaluating_their_performance","326462902_Prediction_of_Students'_Graduation_Time_Using_a_Two-Level_Classification_Algorithm","320757729_Geospatial_Data_Science_Techniques_and_Applications","318392848_An_Introduction_to_Statistical_Learning_With_Applications_in_R","317284025_DSS-PSP_-_A_Decision_Support_Software_for_Evaluating_Students'_Performance","267664204_Springer_Texts_in_Statistics"]}