{"id":"333091143_Interactive_Approach_to_Learning_of_Sorting_Algorithms","abstract":"p class=\"abstract\"> Today we live in a society of high technologies, advanced information and com-munication systems in every field, including education. So, in modern education, teachers make full use of the possibilities of modern Information and Communi-cation Technologies (ICT). In this case, the attitude of the teachers towards the use of computers, to achieve the educational goals, is very important. To have the technologies sustained and significant effect, students in secondary and higher schools need to understand how to use them. The goal of this article is to help of students in secondary and higher schools to acquire enough practical program-ming skills and to learn the sorting algorithms, i.e. the article considers basic sort-ing algorithms. We developed and describe here software with name “Visual sorting” that shows visual, the execution of the basic sorting algorithms: Bubble sort; Selection sort; Insertion sort; Merge sort. Also, our software provides inter-active tracking of the performance (step by step) of different sorting algorithms. </p","authors":["Radoslav Mavrevski","Metodi Traykov","Iavn Trenchev"],"meta":["May 2019International Journal of Online and Biomedical Engineering (iJOE) 15(08):120","DOI:10.3991/ijoe.v15i08.10530"],"references":["324924427_Approaches_to_modeling_of_biological_experimental_data_with_Graphpad_prism_software","324448336_VisComposer_A_Visual_Programmable_Composition_Environment_for_Information_Visualization","311864493_Using_Partial_Differential_Equations_for_Pricing_of_Goods_and_Services","286214602_Selection_and_comparison_of_regression_models_Estimation_of_torque-angle_relationships","275542076_The_Role_of_Multimedia_Strategies_in_Educational_Process","332055799_Visualization_software_for_Hydrophobic-polar_protein_folding_model","262919968_Sweep_maps_A_continuous_family_of_sorting_algorithms","240239617_Visual-Action_Code_Processing_by_Deaf_and_Hearing_Children","222657410_A_high-level_modular_definition_of_the_semantics_of_C","220692549_Introduction_to_Algorithms_3_ed"]}