{"id":"333029830_Image_Super-Resolution_Reconstruction_A_Granular_Computing_Approach_from_the_Viewpoint_of_Cognitive_Psychology","abstract":"Image super-resolution reconstruction is the current research focus and important field of digital image processing, and widely applied in public security, medical diagnosis, etc. Inspired by the idea of granular computing, we explore the granular computing models and algorithms of image super-resolution reconstruction integrating theories and methods of computer science, mathematics, and cognitive psychology. The research includes the following aspects. (1) The granulation method of image is proposed to transform the image space into granularity space. (2) The join operator and the meet operator between two granules are designed for the fuzzy inclusion measure mu and sigma between two granules, are used to realize the transformation between two granularity spaces with different granularities, to obtain the prior knowledge to guide the design of image super-resolution reconstruction algorithms. (3) According to up–down and bottom-up computing models, the granular computing algorithms of image super-resolution reconstruction are designed to realize the transformation from granularity space to image space in terms of the prior knowledge. Research can be summarized for learning process and reconstruction process, the learning process obtains the prior knowledge of image by granulation and forms granular computing model, and the reconstruction process reconstructs the high-resolution image of the given low-resolution image by granulation and the obtained prior knowledge. The feasibility of the preliminary study was verified by experiments. The research aims to build image super-resolution reconstruction models and algorithms satisfying human cognition.","authors":["Hongbing Liu","Xiaoyu Diao","Huaping Guo"],"meta":["May 2019Sensing and Imaging 20(1)","DOI:10.1007/s11220-019-0241-3"],"references":["319284647_NTIRE_2017_Challenge_on_Single_Image_Super-Resolution_Methods_and_Results","327128574_Sequential_three-way_classifier_with_justifiable_granularity","322344589_Fast_Image_Super-Resolution_via_Local_Adaptive_Gradient_Field_Sharpening_Transform","322108646_Local_Patch_Encoding-Based_Method_for_Single_Image_Super-Resolution","322059982_Anchored_Regression_Networks_Applied_to_Age_Estimation_and_Super_Resolution","321600523_Towards_a_Unified_Modeling_and_Knowledge-Representation_based_on_Lattice_Theory_Computational_Intelligence_and_Soft_Computing_Applications","321057435_Random_Access_Memories_A_New_Paradigm_for_Target_Detection_in_High_Resolution_Aerial_Remote_Sensing_Images","319284588_NTIRE_2017_Challenge_on_Single_Image_Super-Resolution_Dataset_and_Study","317741320_Measurement_of_General_Granules","311245628_Grouping_granular_structures_in_human_granulation_intelligence","301818290_Deep_Edge_Guided_Recurrent_Residual_Learning_for_Image_Super-Resolution","298907360_Three-Way_Decisions_and_Cognitive_Computing","310387019_Long-term_forecasting_of_time_series_based_on_linear_fuzzy_information_granules_and_fuzzy_inference_system","302056344_Robust_Single_Image_Super-Resolution_via_Deep_Networks_With_Sparse_Prior","301920721_Three-way_cognitive_concept_learning_via_multi-granularity"]}