{"id":"333033011_A_Study_on_the_Most_Prominent_Areas_of_Research_in_Microservices","abstract":"Microservices have recently gained a lot of attention in the software industry. Their modularity and smaller size offer flexibility advantageous to both development and operational teams. However, the bigger picture is still lacking despite numerous researches on microservices. There are few aspects of microservices that have never been discussed in depth despite being acknowledged repeatedly. The current research is the continuation of our previous paper, \"A systematic mapping on microservices\". In the named paper we have identified the focus areas of microservices' researches. Along with our previous findings we have spotted several crucial key points that require further discussions. These includes: definition of microservices, their sizes and boundaries. We have also explored the relationship of microservices with SOA and DDD. These are the two terms that are frequently associated with microservices. Finally, we have discussed DevOps, cloud and virtualization as three of the most essential factors in microservices ecosystem. We attempted to clarify the role of each of these factors. Based on our findings, there is still no standardized definition for microservices to-date. In absence of clear guidelines, SOA and DDD concepts are widely being used to develop microservices. DevOps practices together with the cloud environment are playing an important role in facilitating the implementation of microservices. We have also identified containerization as an effective method to overcome the hardware limitation besides speeding up the delivery process. © 2019, International Association of Computer Science and Information Technology.","authors":["Mohammad Hamzehloui","Shamsul Sahibuddin","Ardavan Ashabi"],"meta":["April 2019","DOI:10.18178/ijmlc.2019.9.2.793"],"references":["326258016_Configuration_based_process_and_knowledge_management_by_structuring_the_software_landscape_of_global_operating_industrial_enterprises_with_Microservices","323944215_Microservices_Architecting_for_Continuous_Delivery_and_DevOps","322878804_Towards_a_Taxonomy_of_Microservices_Architectures","320823533_Towards_an_understanding_of_microservices","320685628_Microservice_Design_for_Container_based_Multi-cloud_Deployment","318200279_Delivering_Elastic_Containerized_Cloud_Applications_to_Enable_DevOps","345873402_Supporting_Microservice_Evolution","320834525_Engineering_design_analysis_utilizing_a_cloud_platform","318452340_Advanced_Microservices","317922844_Decision_Guidance_Models_for_Microservice_Monitoring"]}