{"id":"333010800_A_hierarchical_approach_to_analyzing_knowledge_integration_between_two_fields-a_case_study_on_medical_informatics_and_computer_science","abstract":"As a driver in modern science, interdisciplinary research has attracted a lot of attention. Major foci are laid on exploring the relations of multiple involved disciplines as well as the knowledge structure in interdisciplinary field. However, there is still a lack of decomposing the knowledge structure of interdisciplinary field to investigate how knowledge from relevant disciplines is integrated in the field. This study proposes an approach to investigating knowledge integration relationships between two research fields from a perspective of hierarchy. Medical Informatics (MI) and its most relevant field of Computer Science (CS) are chosen in the case study. This study decomposed each keyword network of the two fields into four layers by using the K-core method, then quantified the knowledge integration relationships between different layers of the two fields together. The results present that the MI basic layer shows the strongest knowledge integration with CS, followed by the middle layer, with the detail layer the weakest. And all MI layers have the greatest breadth and strength of knowledge integration with the CS middle layer, followed by the CS marginal layer and detail layer, but with the CS basic layer the weakest. A time series analysis shows that the integration of new CS knowledge into MI is a gradual process without explosive growth and the path of knowledge integration between the two fields were identified. The proposed approach could be applied to deeply understanding the integration of one discipline knowledge by an interdisciplinary field.","authors":["Zhichao Ba","Yujie Cao","Jin Mao","Gang Li"],"meta":["May 2019Scientometrics 119(11)","DOI:10.1007/s11192-019-03103-1"],"references":["315963268_An_ensemble_of_visual_features_for_Gaussians_of_local_descriptors_and_non-binary_coding_for_texture_descriptors","304744914_Exploring_the_topic_hierarchy_of_digital_library_research_in_China_using_keyword_networks_a_K-core_decomposition_approach","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","323531808_An_integrated_method_for_interdisciplinary_topic_identification_and_prediction_a_case_study_on_information_science_and_library_science","322895651_Functional_structure_identification_of_scientific_documents_in_computer_science","318911335_Discovering_interdisciplinary_interactions_between_two_research_fields_using_citation_networks","316790740_Discovering_the_Interdisciplinary_Nature_of_Big_Data_Research_Through_Social_Network_Analysis_and_Visualization","308870145_Subject-method_topic_network_analysis_in_communication_studies","295078408_The_Interdisciplinarity_of_Collaborations_in_Cognitive_Science","292671668_K-core_decomposition_of_large_networks_on_a_single_PC"]}