{"id":"333063913_Effects_of_Digital_Game-Based_Learning_on_Elementary_Science_Learning_A_Systematic_Review","abstract":"Digital game-based learning (DGBL) has been perceived as an engaging teaching approach to foster students’ learning and motivation. There are different opinions about the potential benefits of gaming on students’ academic achievements, motivation, and skills in science courses due to the lack of empirical evidence and mixed results. To address this issue, the present research paper provides a review of relevant literature from 2006 to 2017 to examine the effects of using educational computer games in teaching science at the elementary education level. This study employed a multidimensional framework to classify learning outcomes from studies of DGBL applications in the area of elementary science education. The findings of this review show a promising potential of DGBL, particularly in the area of content understanding. However, the findings of the review also suggest that there is a need to provide additional research in order to gain a more comprehensive picture of the educational effectiveness of DGBL. Hence, researchers are advised to conduct more randomized controlled trials (RCTs) various learning modes (e.g., collaborative, and individual), and comparisons of DGBL to traditional methods of teaching. Furthermore, researchers are highly encouraged to examine the effectiveness of DGBL applications in other areas, such as problem-solving and critical thinking. The findings of this review can benefit educational computer game designers, educators, and practitioners in the area of science education, particularly at the elementary level.","authors":["Mahmood H. Hussein","Siew hock Ow","Sau Cheong Loh","Meow-Keong Thong"],"meta":["May 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2916324"],"references":["309228994_Woes_of_an_RCT_for_Game-Based_Learning_Research_-_Past_Problems_and_Potential_Solutions","322708491_The_Effect_of_Gender_on_Motivation_and_Student_Achievement_in_Digital_Game-based_Learning_A_Case_Study_of_a_Contented-Based_Classroom","314502785_A_Qualitative_Meta-Analysis_of_Computer_Games_as_Learning_Tools","313687569_Facilitating_effective_digital_game-based_learning_behaviors_and_learning_performances_of_students_based_on_a_collaborative_knowledge_construction_strategy","312561685_Key_factor_to_improve_Adversity_Quotient_in_children_through_mobile_game-based_learning","308469036_The_effects_of_violent_video_game_habits_on_adolescent_hostility_aggressive_behaviors_and_school_performance","307992747_A_systematic_literature_review_of_games-based_learning_empirical_evidence_in_primary_education","307573774_Effects_of_Knowledge_Construction_Tools_on_Students'_Learning_Patterns_in_Collaborative_Game-Based_Learning_Activities","306154695_Towards_a_pedagogy_of_learning","303110836_Game-based_Learning_and_21st_century_skills_A_review_of_recent_research"]}