{"id":"333002685_I_Am_Conscious_Therefore_I_Am_Imagery_Affect_Action_and_a_General_Theory_of_Behavior","abstract":"Abstract: Organisms are adapted to each other and the environment because there is an inbuilt striving toward security, stability, and equilibrium. A General Theory of Behavior connects imagery, affect, and action with the central executive system we call consciousness, a direct emergent property of cerebral activity. The General Theory is founded on the assumption that the primary motivation of all of consciousness and intentional behavior is psychological homeostasis. Psychological homeostasis is as important to the organization of mind and behavior as physiological homeostasis is to the organization of bodily systems. Consciousness processes quasi-perceptual images independently of the input to the retina and sensorium. Consciousness is the “I am” control\ncenter for integration and regulation of (my) thoughts, (my) feelings, and (my) actions with (my) conscious mental imagery as foundation stones. The fundamental, universal conscious desire for psychological homeostasis benefits from the degree of vividness of inner imagery. Imagery vividness, a combination of clarity and liveliness, is beneficial to imagining, remembering, thinking, predicting, planning, and acting. Assessment of vividness using introspective report is validated by objective means such as functional magnetic resonance imaging (fMRI). A significant body of work shows that vividness of visual imagery is determined by the similarity of neural responses in imagery to those occurring in perception of actual objects and performance of activities. I am conscious; therefore, I am.","authors":["David F Marks"],"meta":["May 2019Brain Sciences 9(5):107","DOI:10.3390/brainsci9050107","Project: GENERAL THEORY OF BEHAVIOUR"],"references":["338744134_A_General_Theory_of_Behaviour","331398322_Measuring_the_multisensory_imagery_of_wine_The_Vividness_of_Wine_Imagery_Questionnaire","321052345_Chasing_the_Rainbow_The_Non-conscious_Nature_of_Being","329785853_The_experience_of_virtual_reality_are_individual_differences_in_mental_imagery_associated_with_sense_of_presence","328481982_Author_accepted_manuscript_Action_dual-tasks_reveal_differential_effects_of_visual_imagery_perspectives_on_performance","323405939_Volitional_and_Automatic_Control_of_the_Hand_When_Reaching_to_Grasp_Objects","323018037_The_role_of_first_person_perspective_and_vivid_imagery_in_memory_for_written_narratives","322892944_Triple_representation_of_language_working_memory_social_and_emotion_processing_in_the_cerebellum_Convergent_evidence_from_task_and_seed-based_resting-state_fMRI_analyses_in_a_single_large_cohort","322294603_Mental_practice_A_review_and_discussion_part_i","321399625_Individual_Ratings_of_Vividness_Predict_Aesthetic_Appeal_in_Poetry"]}