{"id":"333007410_AQ-Routing_mobility-_stability-aware_adaptive_routing_protocol_for_data_routing_in_MANET-IoT_systems","abstract":"Internet of Things, is an innovative technology which allows the connection of physical things with the digital world through the use of heterogeneous networks and communication technologies. In an IoT system, a major role is played by the wireless sensor network as its components comprise: sensing, data acquiring, heterogeneous connectivity and data processing. Mobile ad-hoc networks are highly self reconfiguring networks of mobile nodes which communicate through wireless links. In such a network, each node acts both as a router and host at the same time. The interaction between MANETs and Internet of Things opens new ways for service provision in smart environments and challenging issues in its networking aspects. One of the main issues in MANET–IoT systems is the mobility of the network nodes: routing protocol must react effectively to the topological changes into the algorithm design. We describe the design and implementation of AQ-Routing, and analyze its performance using both simulations and measurements based on our implementation. In general, the networking of such a system is very challenging regarding routing aspects. Also, it is related to system mobility and limited network sensor resources. This article builds upon this observation an adaptive routing protocol (AQ-Routing) based on Reinforcement Learning (RL) techniques, which has the ability to detect the level of mobility at different points of time so that each individual node can update routing metric accordingly. The proposed protocol introduces: (i) new model, developed via Q-learning technique, to detect the level of mobility at each node in the network; (ii) a new metric, called \\(Q_{\\textit{metric}},\\) which account for the static and dynamic routing metrics, and which are combined and updated to the changing network topologies. The protocol can efficiently handle network mobility by a way of preemptively adapting its behaviour thanks to the mobility detection model. The presented results of simulation provide an effective approach to improve the stability of links in both static and mobile scenario and, hence, increase the packet delivery ratio in the global MANET–IoT system.","authors":["Abdellatif Serhani","Najib Naja","Abdellah Jamali"],"meta":["March 2020Cluster Computing 23(1)","DOI:10.1007/s10586-019-02937-x","Project: Routing in Ad hoc Network"],"references":["321633316_Networking_for_IoT_and_applications_using_existing_communication_technology","319635789_Novel_routing_protocol_scheme_for_real-time_applications_in_mobile_Ad_Hoc_networks","346747631_MANETS_and_Internet_of_Things_The_Development_of_a_Data_Routing_Algorithm","327814432_Secure_Routing_for_MANET_Connected_Internet_of_Things_Systems","320652759_An_analysis_of_routing_protocols_in_manets_and_Internet_of_things","313135362_Q-learning","312966021_Packet_routing_in_dynamically_changing_networks_A_reinforcement_learning_approach","312388360_Q-learning","297728761_Secure_routing_for_internet_of_things_A_survey","284602927_Ad_hoc_on-demand_distance_vector_AODV_routing","282221189_A_novel_encounter-based_metric_for_mobile_ad-hoc_networks_routing","263641834_A_Novel_Self-Adaptive_Proactive_Routing_Scheme_for_Mobile_Ad_Hoc_Networks","279334147_A_high-throughput_path_metric_for_multi-_wireless_routing","267328308_Simplified_Multicast_Forwarding","261169014_Fuzzy-based_Adaptive_Cross_layer_Routing_Protocol_for_Delay_Sensitive_Applications_in_MANET"]}