{"id":"333024891_Blockchain-based_reputation_management_for_custom_manufacturing_service_in_the_peer-to-peer_networking_environment","abstract":"Blockchain enables users to be autonomous without the need of trust by using a digital ledger of decentralized consensus. Blockchain-based IoT allows service providers to transfer the security and maintenance responsibility to self-maintaining customers. Adopting peer-to-peer (P2P) networking and computing for more than billions of transactions can reduce the costs arising from the installation and maintenance of centralized systems. Small manufacturers providing industrial IoT (IIoT) services can participate more actively in blockchain-based IIoT applications with three-dimensional printing and digital manufacturing technologies, but the measure to maintain privacy on a blockchain is not robust. Here, we propose a P2P networking-based custom manufacturing service, which is an order-driven trading service between a manufacturer and a customer in the blockchain-based IIoT architecture. The proposed system consists of reputation management and service architecture. We propose a new reputation assessment method customized to increase the reliability and accuracy of industrial manufacturing systems. We also propose a manufacturer rating classification to guide the customers’ decision making in a reliable manner and a malicious evaluator identification to exclude feedbacks from malicious evaluators. The proposed service architecture is composed of trustless P2P protocols designed for preserving privacy and providing non-repudiation. We used a cryptographic algorithm for ensuring transaction privacy and the digital signing of blockchain for non-repudiation. We also analyzed the proposed service architecture and the possible attack scenarios to verify the security requirements. We verified that the reputation management system was influenced by each feedback dynamically and guided the customer’s present decision making with reliable and classified manners, by simulating reputation classification and malicious evaluator identification. Further, we have summarized the originality and the characteristics of the proposed approach by comparing closely related studies and concluded with a future research guide.","authors":["YongJoo Lee","Keon Myung Lee","Sang Ho Lee"],"meta":["March 2020Peer-to-Peer Networking and Applications 13(4)","DOI:10.1007/s12083-019-00730-6"],"references":["326749839_Hierarchical_P2P_architecture_for_efficient_content_distribution","323562983_Blockchain_Meets_IoT_An_Architecture_for_Scalable_Access_Management_in_IoT","319249505_A_Survey_on_the_Security_of_Blockchain_Systems","317776592_sureTrust_a_super_peer-aware_trust_model_for_2-level_P2P_networks","308925663_Distributed_scheduling_using_belief_propagation_for_internet-of-things_IoT_networks","324021549_A_Survey_on_Anonymity_and_Privacy_in_Bitcoin-Like_Digital_Cash_Systems","323138433_An_SDN-based_publishsubscribe-enabled_communication_platform_for_IoT_services","322780625_Secure_Pub-Sub_Blockchain-Based_Fair_Payment_With_Reputation_for_Reliable_Cyber_Physical_Systems","319172270_Can_Blockchain_Strengthen_the_Internet_of_Things","316134122_User_Reputation_computation_Method_Based_on_Implicit_Ratings_on_Social_Media","262344014_Trustworthiness_Management_in_the_Social_Internet_of_Things","304455192_Analiz_rezultatov_lecenia_bolnyh_hroniceskim_pankreatitom","302919497_Blockchains_and_Smart_Contracts_for_the_Internet_of_Things","296684539_Bitcoin_and_Beyond_A_Technical_Survey_on_Decentralized_Digital_Currencies","261104622_A_Survey_on_Trust_Management_for_Internet_of_Things"]}