{"id":"333033248_Evaluating_on_the_Transfer_Learning_of_CNN_Architectures_to_a_Construction_Material_Image_Classification_Task","abstract":"Various sub-tasks on modern construction management system require automatic or semi-automatic processes in handling the operation inside. Especially for construction progress monitoring task, the automatic process in classifying the difference of each construction material from an image is necessary in the preliminary stage. The more the preciseness in automatic classifying, the more the exactness in assessment of each material had been used. Subsequently, the progress of the construction can be evaluated with the highest degree of reliability. As a result, classification of construction material images is very essential process for automatic progress monitoring. Whereas, the similarities in material image appearances are the major classifying challenges. All most all existing related works have been studied based on hand-designed features of which the classified accuracy still not much appreciated from different studied datasets. In our work, automatic feature extracted method from the prominent technique in deep learning, convolution neural network (CNN), is proposed. The pre-trained CNN architectures of AlexNet and GoogleNet are adopt with the task of construction material images classification in the concept of transfer learning. Both of fixed feature extractor and fine-tuning schemes of transfer learning are technically implemented and evaluated. Analyzing results from the two pre-trained architectures expose very impressive and interesting circumstances to the studied dataset. Entirely, fine-tuning scheme of GoogleNet reveals the highest classification result by 95.50 percent of accuracy. © 2019, International Association of Computer Science and Information Technology.","authors":["Supaporn Bunrit","Nittaya Kerdprasop","Kittisak Kerdprasop"],"meta":["April 2019","DOI:10.18178/ijmlc.2019.9.2.787"],"references":["305196650_Going_deeper_with_convolutions","268079628_How_transferable_are_features_in_deep_neural_networks","239386698_Concrete_Column_Recognition_in_Images_and_Videos","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311609514_Geometry-Informed_Material_Recognition","310752533_Visualizing_and_understanding_convolutional_networks","286512696_Deep_Residual_Learning_for_Image_Recognition","282963055_An_analogy_between_various_machine-learning_techniques_for_detecting_construction_materials_in_digital_images","259522896_Vision-based_material_recognition_for_automated_monitoring_of_construction_progress_and_generating_building_information_modeling_from_unordered_site_image_collections","222817078_Construction_Site_Image_Retrieval_Based_on_Material_Cluster_Recognition"]}