{"id":"333090559_Didactic_potential_of_using_systems_for_visualization_of_algorithms_in_the_process_of_teaching_programming","abstract":"The article is devoted to the didactic potential on the use of the visualizer of algorithms as software, which graphically demonstrates the work of algorithms for processing input data. There are described the difficulties arising during the study of the fundamentals of algorithmization and programming. The author proposed to use the algorithm visualizer, as an auxiliary visual means of teaching algorithmization, for more successful mastering the mechanism of the algorithms at lectures. The article discusses the functional requirements for the visualizer of algorithms, describes its main elements and guidelines for the use of visualizers of algorithms in the educational process. In order to increase the effectiveness of the educational process, it is proposed to use the visualizer of algorithms for teaching algorithms and programming for students of the “Applied Informatics” direction as future specialists in the information technologies.\nThe purpose of the study is to increase the efficiency of the development of algorithmic thinking among students of the specialty “Computer Science”, due to the support and active use of the algorithm visualizer as an additional visual tool for learning when studying the course “Fundamentals of Programming”.\nMaterials and research methodsinclude the analysis of scientific and methodological literature on the subject under study, the analysis of the problem of developing algorithmic thinking by students, the practical implementation of the learning process of the basics of algorithmization and programming using the developed algorithms visualizer, the analysis of students’ survey results.\nResults. The research conducted by the author allowed the creation of an instrumental environment an algorithm visualizer that supports the formation of problem solving skills, enhancing the effectiveness of the learning process in the fundamentals of algorithmization and programming and the development of algorithmic thinking. Have been implemented visualizers, that allowing online demonstration of the work of algorithms for processing static data structures (arrays), which contributes to the comprehension and consolidation of theoretical material. Visualizers are introduced into the educational process at Balti State University A. Russo and are used in studying the course “Fundamentals of Programming”.\nConclusion. The author comes to the conclusions about the expediency of the visual description of the algorithm, proposes methods for using the algorithms visualizer in the educational process, and highlights positive factors that affect the understanding the mechanism of algorithm execution when organizing training using visualizers.","authors":["V. D. Moglan"],"meta":["May 2019Open Education 23(2):31-41","DOI:10.21686/1818-4243-2019-2-31-41"],"references":["220613467_Exploring_the_Role_of_Visualization_and_Engagement_in_Computer_Science_Education","320655753_Usability_and_Pedagogical_Assessment_of_an_Algorithm_Learning_Tool_A_Case_Study_for_an_Introductory_Programming_Course_for_High_School","319393897_Taxonomy_of_educational_objectives_The_classification_of_educational_goals_Handbook_I_cognitive_domain","223240429_On_the_role_of_senses_in_education","222408779_A_Meta-Study_of_Algorithm_Visualization_Effectiveness"]}