{"id":"333057634_Quantum-assisted_quantum_compiling","abstract":"Compiling quantum algorithms for near-term quantum computers (accounting for connectivity and native gate alphabets) is a major challenge that has received significant attention both by industry and academia. Avoiding the exponential overhead of classical simulation of quantum dynamics will allow compilation of larger algorithms, and a strategy for this is to evaluate an algorithm's cost on a quantum computer. To this end, we propose a variational hybrid quantum-classical algorithm called quantum-assisted quantum compiling (QAQC). In QAQC, we use the overlap between a target unitary U and a trainable unitary V as the cost function to be evaluated on the quantum computer. More precisely, to ensure that QAQC scales well with problem size, our cost involves not only the global overlap Tr(V†U) but also the local overlaps with respect to individual qubits. We introduce novel short-depth quantum circuits to quantify the terms in our cost function, and we prove that our cost cannot be efficiently approximated with a classical algorithm under reasonable complexity assumptions. We present both gradient-free and gradient-based approaches to minimizing this cost. As a demonstration of QAQC, we compile various one-qubit gates on IBM's and Rigetti's quantum computers into their respective native gate alphabets. Furthermore, we successfully simulate QAQC up to a problem size of 9 qubits, and these simulations highlight both the scalability of our cost function as well as the noise resilience of QAQC. Future applications of QAQC include algorithm depth compression, black-box compiling, noise mitigation, and benchmarking.","authors":["Sumeet Khatri","Ryan LaRose","Alexander Poremba","Lukasz Cincio"],"meta":["May 2019Quantum 3:140","DOI:10.22331/q-2019-05-13-140"],"references":["334037097_Variational_quantum_state_diagonalization","326596523_Quantum_compiling_with_diffusive_sets_of_gates","324104887_Barren_plateaus_in_quantum_neural_network_training_landscapes","324104666_The_Glassy_Phase_of_Optimal_Quantum_Control","323867333_Comparing_and_Integrating_Constraint_Programming_and_Temporal_Planning_for_Quantum_Circuit_Compilation","323722413_Learning_the_quantum_algorithm_for_state_overlap","330099792_Optimizing_quantum_optimization_algorithms_via_faster_quantum_gradient_computation","325623598_Greedy_Randomized_Search_for_Scalable_Compilation_of_Quantum_Circuits","325212657_Impossibility_of_Classically_Simulating_One-Clean-Qubit_Model_with_Multiplicative_Error","323549997_Quantum_Circuit_Learning"]}