{"id":"333033012_SAP_Standard_Arabic_Profiling_Toolset_for_Textual_Analysis","abstract":"This paper defines a Standard Arabic Profiling (SAP) toolset that helps researchers for textual analysis and comparing between different Arabic corpora. Since tools for Arabic language are needed, we present the SAP toolset to simplify the textual analysis process. The approach consists of three profilers: The Part of Speech (POS) profiler that gives statistical analysis for a given document, vocabulary profiler which provides user with an indication out the vocabulary used in a document with reference to Open Source Arabic Corpus (OSAC) of two news agencies (CNN and BBC). The process is accomplished by computing similarity between documents and corpus using Log likelihood measure. Lastly the newly added profiler is the Readability profiler which is used to 1) assess the readability level for a document according to Flesch Reading Ease Readability Formula, and 2) measure the simplicity and ambiguity levels of the document. We described the current part-of-speech for this toolset and how we can extend its functionality to embrace vocabulary and readability profiling. © 2019, International Association of Computer Science and Information Technology.","authors":["Khalid Nahar","Ahmed F. Al Eroud","Malek Barhoush","Abdallah Al-Akhras"],"meta":["April 2019","DOI:10.18178/ijmlc.2019.9.2.790"],"references":["327682339_NLP_and_IR_based_solution_for_confirming_classification_of_research_papers","318913269_Off-line_Arabic_Hand-WritingRecognition_Using_Artificial_Neural_Networkwith_Genetics_Algorithm","313269307_Towards_a_standard_Part_of_Speech_tagset_for_the_Arabic_language","303836091_MADAMIRA_A_Fast_Comprehensive_Tool_for_Morphological_Analysis_and_Disambiguation_of_Arabic","301537230_Improving_Arabic_morphological_analyzers_benchmark","301404530_Recognition_of_Sentiment_Sequences_in_Online_Discussions","295667551_Combining_strategies_for_tagging_and_parsing_Arabic","292152344_OSMAN_-_A_Novel_Arabic_Readability_Metric","282937305_Revisiting_Arabic_Part_of_Speech_Tagsets","284339660_Derivation_of_New_Readability_Formulas_Automated_Readability_Index_Fog_Count_and_Flesch_Reading_Ease_Formula_for_Navy_Enlisted_Personnel"]}