{"id":"333164621_NURBS_hyper-surfaces_for_3D_topology_optimization_problems","abstract":"A general topology optimization strategy is presented in this study for three-dimensional applications. The approach is based on the combination of a well-established density-based method and the Non-uniform rational basis spline (NURBS) hyper-surfaces formalism. The topology of the structure to be optimized can be embedded in a reference domain and it is opportunely described by means of a suitable NURBS hyper-surface. This choice implies several advantages. On the one hand, the number of design variables (control points and weights of the NURBS hyper-surface) is drastically reduced, when compared to classical density-based approaches, and it is unrelated to the mesh of the finite element model. On the other hand, the topology is described through a purely geometrical entity, while the mesh is utilized only to perform the computation of the relevant physical quantities for the problem at hand. A sensitivity analysis with respect to the new variables set is carried out. The effectiveness of the method as well as the effects of some discrete parameters tuning the NURBS hyper-surface shape are investigated on meaningful benchmarks and results are compared with those provided by the classical Solid Isotropic Material with Penalization approach.","authors":["Giulio Costa","Marco Montemurro","Jérôme Pailhès"],"meta":["May 2019Mechanics of Advanced Materials and Structures 28(7):1-20","DOI:10.1080/15376494.2019.1582826","Project: Design and optimization methodologies for Additive Manufacturing structures"],"references":["328556863_A_general_B-Spline_surfaces_theoretical_framework_for_optimisation_of_variable_angle-tow_laminates","325277382_A_surrogate_model_based_on_Non-Uniform_Rational_B-Splines_hypersurfaces","321268212_A_2D_Topology_Optimisation_algorithm_in_NURBS_framework_with_geometric_constraints","321026025_A_General_Hybrid_Optimization_Strategy_for_Curve_Fitting_in_the_Non-Uniform_Rational_Basis_Spline_Framework","313839988_A_NURBS-BASED_TOPOLOGY_OPTIMIZATION_METHOD_INCLUDING_ADDITIVE_MANUFACTURING_CONSTRAINTS","310504235_Geometrically_constrained_isogeometric_parameterized_level-set_based_topology_optimization_via_trimmed_elements","309785612_On_the_effective_integration_of_manufacturability_constraints_within_the_multi-scale_methodology_for_designing_variable_angle-tow_laminates","321531497_Variational_Analysis_and_Aerospace_Engineering_Mathematical_Challenges_for_the_Aerospace_of_the_Future","311954557_A_New_Paradigm_for_the_Optimum_Design_of_Variable_Angle_Tow_Laminates","308631836_A_Practical_Guide_to_Splines"]}