{"id":"333121613_A_Rule-Based_Method_for_Cognitive_Competency_Assessment_in_Computer_Programming_Using_Bloom's_Taxonomy","abstract":"Assessment of students in computer programming is a challenge for instructors, especially at the introductory programming level, where the number of student enrollment is typically high. Therefore, this study presents a novel approach to assessing students’ competency in programming using Bloom’s taxonomy. The novelty of the presented approach is based on some rules that quantify the attained competencies with respect to the cognitive levels of Bloom’s taxonomy. Unlike previous studies, in which cognitive levels were used as a scale for making the questions while the competency assessment were manually performed, in this study, the rule-based assessment method uses the automatic decision-making process to map the students’ competency level directly to the corresponding cognitive levels from the written code without prior mapping of questions to the cognitive levels. For this reason, the study focuses on the basic topics of the structured Java programming language (i.e. Selection, Repetition, and Modular). The rule-based assessment method has been applied to students’ programming code in the introductory level Java course. Data collection has been carried out through conducting an empirical test in which the valid responses of 213 students were collected, which was processed through the rule-based method for competency assessment. Moreover, the quantitative results achieved from the rule-based assessment method were validated by comparing them to the results achieved from the manual assessment. Furthermore, for comparative analysis, several statistical methods were used to identify the difference between the results of the two assessment methods. The outcomes of the comparative analysis have shown the reliability of the proposed rule-based assessment method.","authors":["Zahid Ullah","Adidah Lajis","Mona Jamjoom","Abdulrahman H. Altalhi"],"meta":["May 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2916979"],"references":["345045702_Investigating_the_Feasibility_of_Automatic_Assessment_of_Programming_Tasks","330380587_Block-based_versus_text-based_programming_environments_on_novice_student_learning_outcomes_a_meta-analysis_study","325446924_The_effect_of_automatic_assessment_on_novice_programming_Strengths_and_limitations_of_existing_systems","325209253_Proposed_Assessment_Framework_Based_on_Bloom_Taxonomy_Cognitive_Competency_Introduction_to_Programming","307593603_Increasing_the_Similarity_of_Programming_Code_Structures_to_Accelerate_the_Marking_Process_in_a_New_Semi-Automated_Assessment_Approach","303809631_Bloom's_taxonomy_for_CS_assessment","323949320_Teaching_programming_A_mind_map_based_methodology_to_improve_learning_outcomes","323424582_Statistical_power_analysis_for_the_behavioral_sciences","317160209_Learnable_Programming_Blocks_and_Beyond","314721314_Introductory_programming_criterion-referencing_and_bloom"]}