{"id":"333186147_An_Evolutionary_Algorithm_for_Large-Scale_Sparse_Multi-Objective_Optimization_Problems","abstract":"In the last two decades, a variety of different types of multi-objective optimization problems (MOPs) have been extensively investigated in the evolutionary computation community. However, most existing evolutionary algorithms encounter difficulties in dealing with MOPs whose Pareto optimal solutions are sparse (i.e., most decision variables of the optimal solutions are zero), especially when the number of decision variables is large. Such large-scale sparse MOPs exist in a wide range of applications, for example, feature selection that aims to find a small subset of features from a large number of candidate features, or structure optimization of neural networks whose connections are sparse to alleviate overfitting. This paper proposes an evolutionary algorithm for solving large-scale sparse MOPs. The proposed algorithm suggests a new population initialization strategy and genetic operators by taking the sparse nature of the Pareto optimal solutions into consideration, to ensure the sparsity of the generated solutions. Moreover, this paper also designs a test suite to assess the performance of the proposed algorithm for large-scale sparse MOPs. Experimental results on the proposed test suite and four application examples demonstrate the superiority of the proposed algorithm over seven existing algorithms in solving large-scale sparse MOPs.","authors":["Ye Tian","Xingyi Zhang","Chao Wang","Yaochu Jin"],"meta":["May 2019IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99)","DOI:10.1109/TEVC.2019.2918140","Projects: Evolutionary multi-objective optimization and its applicationsLarge-scale optimization"],"references":["328459927_Sampling_Reference_Points_on_the_Pareto_Fronts_of_Benchmark_Multi-Objective_Optimization_Problems","321823477_Evolving_Unsupervised_Deep_Neural_Networks_for_Learning_Meaningful_Representations","321358257_A_Recursive_Decomposition_Method_for_Large_Scale_Continuous_Optimization","320004947_Effectiveness_and_efficiency_of_non-dominated_sorting_for_evolutionary_multi-_and_many-objective_optimization","319446935_The_Bi-Objective_Critical_Node_Detection_Problem","329475599_Regression_Shrinkage_and_Selection_Via_the_Lasso","325159151_A_Review_of_Features_and_Limitations_of_Existing_Scalable_Multi-Objective_Test_Suites","324868408_The_Critical_Node_Detection_Problem_in_networks_A_survey","322810231_Network_Structural_Vulnerability_A_Multiobjective_Attacker_Perspective","320458244_A_Competitive_Mechanism_Based_Multi-objective_Particle_Swarm_Optimizer_with_Fast_Convergence"]}