{"id":"333176109_Application_of_Machine_Learning_in_Predicting_Performance_for_Computer_Engineering_Students_A_Case_Study","abstract":"The present work proposes the application of machine learning techniques to predict the final grades (FGs) of students based on their historical performance of grades. The proposal was applied to the historical academic information available for students enrolled in the computer engineering degree at an Ecuadorian university. One of the aims of the university's strategic plan is the development of a quality education that is intimately linked with sustainable development goals (SDGs). The application of technology in teaching-learning processes (Technology-enhanced learning) must become a key element to achieve the objective of academic quality and, as a consequence, enhance or benefit the common good. Today, both virtual and face-to-face educational models promote the application of information and communication technologies (ICT) in both teaching-learning processes and academic management processes. This implementation has generated an overload of data that needs to be processed properly in order to transform it into valuable information useful for all those involved in the field of education. Predicting a student's performance from their historical grades is one of the most popular applications of educational data mining and, therefore, it has become a valuable source of information that has been used for different purposes. Nevertheless, several studies related to the prediction of academic grades have been developed exclusively for the benefit of teachers and educational administrators. Little or nothing has been done to show the results of the prediction of the grades to the students. Consequently, there is very little research related to solutions that help students make decisions based on their own historical grades. This paper proposes a methodology in which the process of data collection and pre-processing is initially carried out, and then in a second stage, the grouping of students with similar patterns of academic performance was carried out. In the next phase, based on the identified patterns, the most appropriate supervised learning algorithm was selected, and then the experimental process was carried out. Finally, the results were presented and analyzed. The results showed the effectiveness of machine learning techniques to predict the performance of students.","authors":["Diego Buenaño-Fernández","David Gil","Sergio Luján-Mora"],"meta":["May 2019Sustainability 11(10)","DOI:10.3390/su11102833"],"references":["330235780_Large-scale_e-learning_recommender_system_based_on_Spark_and_Hadoop","327949003_The_Effect_of_Green_Software_A_Study_of_Impact_Factors_on_the_Correctness_of_Software","316439809_Catalysing_Change_in_Higher_Education_for_Sustainable_Development_A_Review_of_Professional_Development_Initiatives_for_University_Educators","330930942_The_use_of_tools_of_data_mining_to_decision_making_in_engineering_education-A_systematic_mapping_study","329719703_Understand_develop_and_enhance_the_learning_process_with_big_data","328892240_Chapter_19_Education_Innovation_and_the_Prospect_of_Sustainable_Growth_and_Development","325350832_Evaluation_of_grade_prediction_using_model-based_collaborative_filtering_methods","324971287_Applying_learning_analytics_for_the_early_prediction_of_students'_academic_performance_in_blended_learning","324399006_Equality_of_Educational_Opportunity","317944380_What_affects_learner's_higher-order_thinking_in_technology-enhanced_learning_environments_The_effects_of_learner_factors"]}