{"id":"333125429_Temporal_and_spectral_fingerprints_of_ultrafast_all-coherent_spin_switching","abstract":"Future information technology demands ever-faster, low-loss quantum control. Intense light fields have facilitated milestones along this way, including the induction of novel states of matter1–3, ballistic acceleration of electrons4–7 and coherent flipping of the valley pseudospin⁸. These dynamics leave unique ‘fingerprints’, such as characteristic bandgaps or high-order harmonic radiation. The fastest and least dissipative way of switching the technologically most important quantum attribute—the spin—between two states separated by a potential barrier is to trigger an all-coherent precession. Experimental and theoretical studies with picosecond electric and magnetic fields have suggested this possibility9–11, yet observing the actual spin dynamics has remained out of reach. Here we show that terahertz electromagnetic pulses allow coherent steering of spins over a potential barrier, and we report the corresponding temporal and spectral fingerprints. This goal is achieved by coupling spins in antiferromagnetic TmFeO3 (thulium orthoferrite) with the locally enhanced terahertz electric field of custom-tailored antennas. Within their duration of one picosecond, the intense terahertz pulses abruptly change the magnetic anisotropy and trigger a large-amplitude ballistic spin motion. A characteristic phase flip, an asymmetric splitting of the collective spin resonance and a long-lived offset of the Faraday signal are hallmarks of coherent spin switching into adjacent potential minima, in agreement with numerical simulations. The switchable states can be selected by an external magnetic bias. The low dissipation and the antenna’s subwavelength spatial definition could facilitate scalable spin devices operating at terahertz rates.","authors":["S. Schlauderer","Christoph Lange","S. Baierl","T. Ebnet"],"meta":["May 2019Nature 569(7756):383-387","DOI:10.1038/s41586-019-1174-7"],"references":["324898009_Lightwave_valleytronics_in_a_monolayer_of_tungsten_diselenide","321242122_THz_electrical_writing_speed_in_an_antiferromagnetic_memory","320907922_Interplay_of_Fe_and_Tm_moments_through_the_spin-reorientation_transition_in_TmFeO_3","305322421_Light-field_driven_currents_in_graphene","344849866_High_Frequency_Processes_in_Magnetic_Materials","325118968_Precessional_switching_of_antiferromagnets_by_electric_field_induced_Dzyaloshinskii-Moriya_torque","318577235_Tailored_semiconductors_for_high-harmonic_optoelectronics","309274922_Multi-petahertz_electronic_metrology","309252055_Nonlinear_spin_control_by_terahertz-driven_anisotropy_fields","308321207_Ultrafast_photo-magnetic_recording_in_transparent_medium","299421511_Resolving_the_spin_reorientation_and_crystal-field_transitions_in_TmFeO3_with_terahertz_transient","297917161_Terahertz-field-induced_insulator-to-metal_transition_in_vanadium_dioxide_metamaterial","287853712_An_effective_magnetic_field_from_optically_driven_phonons","303409405_Coherent_Two-Dimensional_Terahertz_Magnetic_Resonance_Spectroscopy_of_Collective_Spin_Waves","293190603_Possible_light-induced_superconductivity_in_K3C60_at_high_temperature"]}