{"id":"333156194_Attention-Based_Convolutional_Neural_Network_for_Weakly_Labeled_Human_Activities'_Recognition_With_Wearable_Sensors","abstract":"Traditional methods of human activity recognition usually require a large amount of strictly labeled data for training classifiers. However, it is hard for one to keep a fixed activity when collecting desired activity data by wearable sensors, and the weakly labeled data inevitably occurs in the process of data collection. For now, human activity recognition methods have seldom been researched according to weakly labeled data, which deserves deep investigation. In the paper, we proposed a novel attention-based human activity recognition method to process weakly labeled activity data. The traditional CNN-based human activity recognition is modified by attention mechanism, which computes the compatibility between the global features extracted at the final fully connected layers and local features extracted at a given convolutional layer. The attention-based CNN architecture can amplify the salient activity information and suppress the irrelevant and potentially confusing information by weighing up their compatibility. Our methods are compared with two state-of-the-art methods CNN and DeepConvLSTM. The experimental results show that our model is comparably well on the traditional UCI HAR Dataset and outperforms them on the weakly labeled dataset in accuracy. Our method can greatly facilitate the process of sensor data annotation and makes data collection more easy.","authors":["Kun Wang","Jun He","Lei Zhang"],"meta":["May 2019IEEE Sensors Journal PP(99):1-1","DOI:10.1109/JSEN.2019.2917225"],"references":["326458979_Human_Activity_Recognition_Based_on_Wearable_Sensor_Data_A_Standardization_of_the_State-of-the-Art","326279615_Automatic_Annotation_for_Human_Activity_Recognition_in_Free_Living_Using_a_Smartphone","324387531_Learn_To_Pay_Attention","319770314_Deep_Convolutional_Neural_Networks_On_Multichannel_Time_Series_For_Human_Activity_Recognition","311489852_Human_Activity_Recognition_Using_Wearable_Sensors_by_Deep_Convolutional_Neural_Networks","310394238_A_Survey_on_Activity_Detection_and_Classification_Using_Wearable_Sensors","304293475_A_Deep_Learning_Approach_to_Human_Activity_Recognition_Based_on_Single_Accelerometer","303931237_Deep_Convolutional_Neural_Networks_for_Human_Activity_Recognition_with_Smartphone_Sensors","303858804_Hierarchical_Attention_Networks","298412360_A_Public_Domain_Dataset_for_Human_Activity_Recognition_using_Smartphones"]}