{"id":"333104668_Limbic-predominant_age-related_TDP-43_encephalopathy_LATE_Consensus_working_group_report","abstract":"We describe a recently recognized disease entity, limbic-predominant age-related TDP-43 encephalopathy (LATE). LATE neuropathological change (LATE-NC) is defined by a stereotypical TDP-43 proteinopathy in older adults, with or without coexisting hippocampal sclerosis pathology. LATE-NC is a common TDP-43 proteinopathy, associated with an amnestic dementia syndrome that mimicked Alzheimer's-type dementia in retrospective autopsy studies. LATE is distinguished from frontotemporal lobar degeneration with TDP-43 pathology based on its epidemiology (LATE generally affects older subjects), and relatively restricted neuroanatomical distribution of TDP-43 proteinopathy. In community-based autopsy cohorts, ∼25% of brains had sufficient burden of LATE-NC to be associated with discernible cognitive impairment. Many subjects with LATE-NC have comorbid brain pathologies, often including amyloid-β plaques and tauopathy. Given that the 'oldest-old' are at greatest risk for LATE-NC, and subjects of advanced age constitute a rapidly growing demographic group in many countries, LATE has an expanding but under-recognized impact on public health. For these reasons, a working group was convened to develop diagnostic criteria for LATE, aiming both to stimulate research and to promote awareness of this pathway to dementia. We report consensus-based recommendations including guidelines for diagnosis and staging of LATE-NC. For routine autopsy workup of LATE-NC, an anatomically-based preliminary staging scheme is proposed with TDP-43 immunohistochemistry on tissue from three brain areas, reflecting a hierarchical pattern of brain involvement: amygdala, hippocampus, and middle frontal gyrus. LATE-NC appears to affect the medial temporal lobe structures preferentially, but other areas also are impacted. Neuroimaging studies demonstrated that subjects with LATE-NC also had atrophy in the medial temporal lobes, frontal cortex, and other brain regions. Genetic studies have thus far indicated five genes with risk alleles for LATE-NC: GRN, TMEM106B, ABCC9, KCNMB2, and APOE. The discovery of these genetic risk variants indicate that LATE shares pathogenetic mechanisms with both frontotemporal lobar degeneration and Alzheimer's disease, but also suggests disease-specific underlying mechanisms. Large gaps remain in our understanding of LATE. For advances in prevention, diagnosis, and treatment, there is an urgent need for research focused on LATE, including in vitro and animal models. An obstacle to clinical progress is lack of diagnostic tools, such as biofluid or neuroimaging biomarkers, for ante-mortem detection of LATE. Development of a disease biomarker would augment observational studies seeking to further define the risk factors, natural history, and clinical features of LATE, as well as eventual subject recruitment for targeted therapies in clinical trials.","authors":["Sally Hunter"],"meta":["April 2019Brain 142(6)","DOI:10.1093/brain/awz099"],"references":["331026449_Tau_and_TDP-43_proteinopathies_kindred_pathologic_cascades_and_genetic_pleiotropy","330572442_Prediction_models_for_dementia_and_neuropathology_in_the_oldest_old_the_Vantaa_85_cohort_study","330099995_Pathological_imaging_and_genetic_characteristics_support_the_existence_of_distinct_TDP-43_types_in_non-FTLD_brains","329780418_Dichotomous_scoring_of_TDP-43_proteinopathy_from_specific_brain_regions_in_27_academic_research_centers_associations_with_Alzheimer's_disease_and_cerebrovascular_disease_pathologies","329715906_TDP-43_extracted_from_frontotemporal_lobar_degeneration_subject_brains_displays_distinct_aggregate_assemblies_and_neurotoxic_effects_reflecting_disease_progression_rates","333163395_Hippocampal_sclerosis_hippocampal_neuron_loss_patterns_and_Tdp-43_in_the_aged_population","331695036_Role_of_Amyloid-b_and_Tau_Proteins_in_Alzheimer's_Disease_Confuting_the_Amyloid_Cascade","330759848_Associations_of_Amygdala_Volume_and_Shape_with_Transactive_Response_DNA-binding_Protein_43_TDP-43_Pathology_in_a_Community_Cohort_of_Older_Adults","330641942_TDP-43_proteinopathy_in_aging_Associations_with_risk-associated_gene_variants_and_with_brain_parenchymal_thyroid_hormone_levels","330581947_Postmortem_neurodegenerative_markers_and_trajectories_of_decline_in_cognitive_systems"]}