{"id":"333156304_Local_Learning_With_Deep_and_Handcrafted_Features_for_Facial_Expression_Recognition","abstract":"We present an approach that combines automatic features learned by convolutional neural networks (CNN) and handcrafted features computed by the bag-of-visual-words (BOVW) model in order to achieve state-of-the-art results in facial expression recognition. To obtain automatic features, we experiment with multiple CNN architectures, pre-trained models and training procedures, e.g. Dense-Sparse-Dense. After fusing the two types of features, we employ a local learning framework to predict the class label for each test image. The local learning framework is based on three steps. First, a k-nearest neighbors model is applied in order to select the nearest training samples for an input test image. Second, a one-versus-all Support Vector Machines (SVM) classifier is trained on the selected training samples. Finally, the SVM classifier is used to predict the class label only for the test image it was trained for. Although we have used local learning in combination with handcrafted features in our previous work, to the best of our knowledge, local learning has never been employed in combination with deep features. The experiments on the 2013 Facial Expression Recognition (FER) Challenge data set, the FER+ data set and the AffectNet data set demonstrate that our approach achieves state-of-the-art results. With a top accuracy of 75.42% on FER 2013, 87.76% on the FER+, 59.58% on AffectNet 8-way classification and 63.31% on AffectNet 7-way classification, we surpass the state-of-the-art methods by more than 1% on all data sets.","authors":["Mariana Iuliana Georgescu","Radu Tudor Ionescu","Marius Popescu"],"meta":["May 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2917266","Project: Computer Vision"],"references":["322656939_Improving_Bag-of-Visual-Words_Towards_Effective_Facial_Expressive_Image_Classification","320478145_Facial_Expression_Recognition_Using_a_Hybrid_CNN-SIFT_Aggregator","319465860_MRMR-based_ensemble_pruning_for_facial_expression_recognition","345714470_FaceNet2ExpNet_Regularizing_a_Deep_Face_Recognition_Net_for_Expression_Recognition","331214969_HERO_Human_Emotions_Recognition_for_Realizing_Intelligent_Internet_of_Things","329316032_Patch-Gated_CNN_for_Occlusion-aware_Facial_Expression_Recognition","320965108_Reliable_Crowdsourcing_and_Deep_Locality-Preserving_Learning_for_Expression_Recognition_in_the_Wild","320410245_Deep_Learning_Approaches_for_Facial_Emotion_Recognition_A_Case_Study_on_FER-2013","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}