{"id":"333192119_Visual_environment_of_cognitive_graphics_for_end-to-end_engineering_project-based_education","abstract":"This article is concerned with the prospects for the implementation of synchronous technology for knowledge processing and transfer by visual methods in the context of end-to-end engineering project-based training. A formal characterization of information about complex systems based on the visual cognitive meta-language VI-XML, forming a synchronous project-based educational environment, is proposed. This environment is a set of methods, using visualization metaphors, while the object under study is presented from different points of view and levels of detail (expertise). Visualization metaphors form the mechanisms for processing and transferringknowledge by comparing abstract or real objects to visually perceptible images. Visual modeling languages, in turn, are formed by fixed sets of metaphors and rules for construction of visual models from them. The proposed approach to the presentation of models underlies the universal visual modeling environment, which provides a single interface for creating and editing visual conceptual, structural-functional, and object models. It provides the ability to encapsulate the levels of visual modeling in a single closed hierarchy, accompanying the stages of system analysis and design. The experience of using a universal visual modeling environment in the frame of practical work and group design has proven itself to be good for the solution of educational problems in the field of knowledge transfer in a visual form that is easily interpreted by students.","authors":["A.I. Vlasov","L.V. Juravleva","V.A. Shakhnov"],"meta":["January 2019Istrazivanja i Projektovanja za Privredu 17(1):99-106","DOI:10.5937/jaes17-20262"],"references":["324128745_Entrepreneurship_and_Information_Technology_Businesses_in_Economic_Crisis","318851198_Unlocking_digital_entrepreneurship_through_technical_business_process","318156005_A_visual_information_tool_for_user_participation_during_the_lifecycle_of_school_building_design_BIM_KOUTAMANIS_et_al","327389735_Challenging_Intensive_Project-Based_Education_Short-Term_Class_on_Mobile_Robotics_with_Mechatronic_Elements_Methods_and_Applications_for_Teaching_and_Learning","322260559_Visual_methods_of_formalization_of_knowledge_in_the_conditions_of_the_synchronous_technologies_of_system_engineering","308576707_Mobile_phones'_social_impacts_on_sustainable_human_development_case_studies_Morocco_and_Italy","282637981_View_to_view_transformations_in_domain_specific_modeling","266630224_Teaching_to_Write_Software_Engineering_Documents_with_Focus_on_Document_Design_by_Means_of_Mind_Maps","261052744_Visual_learning_environment_in_electronic_engineering_education","215863688_The_Unified_Modeling_Language_Reference_Manual"]}