{"id":"333173074_Relevant_visualization_technologies_for_latent_fingerprints_on_wet_objects_and_its_challenges_a_review","abstract":"Fingerprint has been one of the powerful evidence in forensic investigation as it is useful for human identification, associating an individual to an item and/or location of interest, as well as reconstructing the crime scenes. Considering that latent fingerprints are commonly found at crime scenes and that it requires the use of fingerprint visualization methods due to its hidden nature, continuous research in developing suitable methods has been reported. However, the underlying physical and/or chemical interactions for certain visualization methods that have successfully visualized wet fingerprints remains unreported. This is probably because previous studies were primarily focused on establishing the fingerprint contrast rather than the comprehension of the physical and chemical aspects behind it. A good understanding on such aspects may prove useful in guiding future improvements, or modifications of existing fingerprint visualization methods. Hence, this review paper focuses on wet latent fingerprints, difficulties in the available wet fingerprint visualization methods, as well as its overview of the challenges and future insights.","authors":["Aida Rasyidah Azman","Naji A. Mahat","Roswanira A. B. Wahab","Wan Azlina Ahmad"],"meta":["May 2019Egyptian Journal of Forensic Sciences 9(1)","DOI:10.1186/s41935-019-0129-3","Projects: FingerprintForensic SciencesBiotechnological route for visualizing latent fingerprints immersed in water"],"references":["328791038_Nanocarbon_powder_for_latent_fingermark_development_a_green_chemistry_approach","325398889_Novel_Safranin-Tinted_Candida_rugosa_Lipase_Nanoconjugates_Reagent_for_Visualizing_Latent_Fingerprints_on_Stainless_Steel_Knives_Immersed_in_a_Natural_Outdoor_Pond","318504594_Development_of_latent_fingerprints_on_non-porous_surfaces_recovered_from_fresh_and_sea_water","308536751_Small_particle_reagent_SPR_method_for_detection_of_latent_fingermarks_A_review","331261789_Fundamentals_of_Fingerprint_Analysis","324264789_Liquid_phase_selective_deposition_techniques_Theory_and_Application","308603038_Guidelines_for_the_assessment_of_fingermark_detection_techniques","308415198_Chemistry_of_Print_Residue","308274006_Comparison_of_various_alkyl_cyanoacrylates_for_fingerprint_development","308054930_In_IARC_monographs_on_the_evaluation_of_carcinogenic_risks_to_humans"]}