{"id":"333114268_Resource-Rich_versus_Resource-Poor_Assessment_in_Introductory_Computer_Science_and_its_Implications_on_Models_of_Cognition_An_in-Class_Experimental_Study","abstract":"Outside university, students encounter disciplinary practices mediated by technological resources. In this sense, the real world is decidedly resource-rich. In contrast, most educational assessments remain decidedly resource-poor. Situated versus mindbased perspectives of cognition fundamentally differ in the role they ascribe to such resources in cognition and learning. To mindbased perspectives, they are a source of input, to situated perspectives they are constitutive to cognition itself. We assessed the validity of resource-rich versus resource-poor assessments of learning outcomes from resource-rich versus resource-poor learning activities. The study implemented an in-class 2x2 between-subjects experimental design in an introductory programming course with 192 first semester BSc engineering students. Both types of assessment were sensitive to differences in learning outcomes, indicating validity for both. Results indicate resource-rich assessments may be more ecologically valid, while-intriguingly-the resource-poor assessments were more sensitive to transfer of learning. Furthermore, the resource-rich learning activities better facilitated learning for transfer.","authors":["Tobias Halbherr","Hermann Lehner","Manu Kapur"],"meta":["July 2019","Conference: 41st Annual Conference of the Cognitive Science SocietyAt: Montreal, CanadaVolume: Proceedings of the 41st Annual Conference of the Cognitive Science Society","Project: Resource-Rich Examinations in Higher Education"],"references":["302062047_Using_e-Assessment_to_enhance_student_learning_and_evidence_learning_outcomes","273064367_Randy_Elliot_Bennett_The_Changing_Nature_of_Educational_Assessment_Review_of_Research_in_Education_March_2015_39_370-407_doi1031020091732X14554179","332943147_Standard_cognitive_science","327495702_Learning_through_Problem_Solving","315118862_Embodied_Embedded_Cognition","310902720_Developing_and_Validating_Cognitive_Models_in_Assessment","307534272_The_theory_of_affordances","299201115_Knowing_what_students_know","289963578_Validity","285678076_Introduction_The_new_science_of_learning"]}