{"id":"333127108_Learning_sensorimotor_control_with_neuromorphic_sensors_Toward_hyperdimensional_active_perception","abstract":"The hallmark of modern robotics is the ability to directly fuse the platform’s perception with its motoric ability—the concept often referred to as “active perception.” Nevertheless, we find that action and perception are often kept in separated spaces, which is a consequence of traditional vision being frame based and only existing in the moment and motion being a continuous entity. This bridge is crossed by the dynamic vision sensor (DVS), a neuromorphic camera that can see the motion. We propose a method of encoding actions and perceptions together into a single space that is meaningful, semantically informed, and consistent by using hyperdimensional binary vectors (HBVs). We used DVS for visual perception and showed that the visual component can be bound with the system velocity to enable dynamic world perception, which creates an opportunity for real-time navigation and obstacle avoidance. Actions performed by an agent are directly bound to the perceptions experienced to form its own “memory.” Furthermore, because HBVs can encode entire histories of actions and perceptions—from atomic to arbitrary sequences—as constant-sized vectors, autoassociative memory was combined with deep learning paradigms for controls. We demonstrate these properties on a quadcopter drone ego-motion inference task and the MVSEC (multivehicle stereo event camera) dataset.","authors":["Anton Mitrokhin","Peter Sutor","Cornelia Fermüller","Yiannis Aloimonos"],"meta":["May 2019Science Robotics 4(30):eaaw6736","DOI:10.1126/scirobotics.aaw6736"],"references":["330592254_Event-Based_Moving_Object_Detection_and_Tracking","326525791_A_Computational_Theory_for_Life-Long_Learning_of_Semantics_11th_International_Conference_AGI_2018_Prague_Czech_Republic_August_22-25_2018_Proceedings","322851382_The_Multi_Vehicle_Stereo_Event_Camera_Dataset_An_Event_Camera_Dataset_for_3D_Perception","322517114_Ultimate_SLAM_Combining_Events_Images_and_IMU_for_Robust_Visual_SLAM_in_HDR_and_High_Speed_Scenarios","301842249_Revisiting_Active_Perception","301648615_End_to_End_Learning_for_Self-Driving_Cars","350078889_Unsupervised_Learning_of_Dense_Optical_Flow_Depth_and_Egomotion_with_Event-Based_Sensors","339291017_EV-IMO_Motion_Segmentation_Dataset_and_Learning_Pipeline_for_Event_Cameras","338946008_EV-IMO_Motion_Segmentation_Dataset_and_Learning_Pipeline_for_Event_Cameras","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space"]}