{"id":"333103959_Visualization_and_Scientometric_Mapping_of_Global_Agriculture_Big_Data_Research","abstract":"The present paper is a scientometric and visualization study of global Agriculture Big Data (ABD) research. however as per the quantification is concern, very little research have performed in the area of Agriculture Big Data. The study aims to traverse the present status of Agriculture Big Data research through network analysis and visualizations study of the ABD publications. A total of 379 publication data were downloaded from Clarivate Analytics Web of Science database within the time span of \"all years\". VOSviewer, MS-Excel and R statistical software is used for data analysis. Various results are drawn based on annual scientific production, most cited papers, most cited authors, most cited affiliations, most prolific nations, author's h-index, co-authorship analysis of countries and organizations, co-citation analysis of sources, the keyword co-occurrence analysis and density visualization. This study investigates the growth status in ABD related research which can help the policy maker, researchers and people of agriculture and allied sector to have an exhaustive understanding on Agriculture Big Data research for the further study.","authors":["Guptnath Trivedi"],"meta":["January 2019"],"references":["322410635_A_Bibliometric_Analysis_and_Visualization_of_Medical_Big_Data_Research","320166453_A_Review_on_the_Practice_of_Big_Data_Analysis_in_Agriculture","313448667_Big_Data_in_Smart_Farming_-_A_review","309595944_A_Bibliometric_Analysis_of_Fuzzy_Decision_Research_During_1970-2015","307993518_The_ethics_of_big_data_in_big_agriculture","304190397_Big_Data_in_food_and_agriculture","319669738_bibliometrix_An_R-tool_for_comprehensive_science_mapping_analysis","272493984_An_overview_of_fuzzy_research_with_bibliometric_indicators","270595589_25_years_at_KnoSys_A_bibliometric_analysis","260123038_A_Bibliographic_Analysis_of_Recent_Solar_Energy_Literatures_The_Expansion_and_Evolution_of_a_Research_Field"]}