{"id":"333182800_Semi-Supervised_K-Means_DDoS_Detection_Method_Using_Hybrid_Feature_Selection_Algorithm","abstract":"Distributed Denial of Service (DDoS) attack is an attempt to make an online service unavailable by overwhelming it with traffic from multiple sources. Therefore, it is necessary to propose an effective method to detect DDoS attack from massive data traffics. However, the existing schemes have some limitations, including that supervised learning methods need large numbers of labeled data and unsupervised learning algorithms have relatively low detection rate and high false positive rate. In order to tackle these issues, this paper presents a semi-supervised weighted k-means detection method. Specifically, we firstly present a hadoop-based hybrid feature selection algorithm to find the most effective feature sets and propose an improved density-based initial cluster centers selection algorithm to solve the problem of outliers and local optimal. Then, we provide the Semi-supervised K-Means algorithm using Hybrid Feature Selection (SKM-HFS) to detect attacks. Finally, we exploit DARPA DDoS dataset, CAIDA \"DDoS attack 2007\" dataset, CICIDS \"DDoS attack 2017\" dataset and real-world dataset to carry out the verification experiment. The experiment results have demonstrated that the proposed method outperforms the benchmark in the respect of detection performance and Technique for Order Preference by Similarity to an Ideal Solution (TOPSIS) evaluation factor.","authors":["Y.H. Gu","Kaiyue Li","Zhenyang Guo","Yongfei Wang"],"meta":["May 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2917532","Project: DDoS Detection"],"references":["332720402_A_Modified_DBSCAN_Clustering_Algorithm_for_Proactive_Detection_of_DDoS_Attacks","329067094_Flow_Correlation_Degree_Optimization_Driven_Random_Forest_for_Detecting_DDoS_Attacks_in_Cloud_Computing","322780374_Adaptive_feature_selection_for_denial_of_services_DoS_attack","321881509_Multiple-Features-Based_Semisupervised_Clustering_DDoS_Detection_Method","320100067_Entropy-Based_Application_Layer_DDoS_Attack_Detection_Using_Artificial_Neural_Networks","318410794_A_modified_DBSCAN_clustering_algorithm_for_proactive_detection_of_DDoS_attacks","325017785_Research_on_Application_of_Improved_K-means_Algorithm_in_Network_Intrusion_Detection","318410795_DDoS_attack_detection_approach_using_an_efficient_cluster_analysis_in_large_data_scale","317281665_Real-time_DDoS_attack_detection_using_FPGA","314187816_Detection_of_DDoS_attacks_and_Flash_Events_using_Novel_Information_theory_Metrics"]}