{"id":"333167029_End-to-end_capacities_of_a_quantum_communication_network","abstract":"In quantum mechanics, a fundamental law prevents quantum communications to simultaneously achieve high rates and long distances. This limitation is well known for point-to-point protocols, where two parties are directly connected by a quantum channel, but not yet fully understood in protocols with quantum repeaters. Here we solve this problem bounding the ultimate rates for transmitting quantum information, entanglement and secret keys via quantum repeaters. We derive single-letter upper bounds for the end-to-end capacities achievable by the most general (adaptive) protocols of quantum and private communication, from a single repeater chain to an arbitrarily complex quantum network, where systems may be routed through single or multiple paths. We analytically establish these capacities under fundamental noise models, including bosonic loss which is the most important for optical communications. In this way, our results provide the ultimate benchmarks for testing the optimal performance of repeater-assisted quantum communications.","authors":["Stefano Pirandola"],"meta":["May 2019Communications Physics 2(1):51","DOI:10.1038/s42005-019-0147-3"],"references":["340061022_Linear_programs_for_entanglement_and_key_distribution_in_the_quantum_internet","327063836_Phase-Matching_Quantum_Key_Distribution","326621713_Teleportation_simulation_of_bosonic_Gaussian_channels_Strong_and_uniform_convergence","324898255_Overcoming_the_rate-distance_limit_of_quantum_key_distribution_without_quantum_repeaters","324501480_On_the_Energy-Constrained_Diamond_Norm_and_Its_Application_in_Quantum_Information_Theory","323654999_Fundamental_limits_to_quantum_channel_discrimination","330478391_Secure_Quantum_Network_Code_without_Classical_Communication","329257690_Conditional_channel_simulation","325200878_The_Theory_of_Quantum_Information","324717473_Converse_bounds_for_quantum_and_private_communication_over_Holevo-Werner_channels"]}