{"id":"333208622_An_adaptation_and_personalisation_methodology_for_Serious_Games_design","abstract":"Serious games (SG) are considered to induce positive effects in the areas of learning motivation and learning gains. The use of SG in education is a large deviation from the common education standards, which usually are based on mass systems of instruction, assessment, grading and reporting students' knowledge and skills. SG encourage self-directness and independency of student, thus providing a framework for self-learning activities. But while SG can be engaging and motivating, and appealing to learners their contribution in education cannot be assessed. What is most interesting is that the assessment of the SG could help to create personalized educational material that provide the right balance between gaming and educational experience to each user. It has been suggested that SG can take advantage of Artificial Intelligence (AI) methods for automated adaptation to the learner. However, research still witnesses a lack of methodologies, guidelines and best practices on how to develop effective adaptive and personalised SG and how to integrate them in the actual learning and training processes. In previous work we proposed a framework on adaptive and personalised SG using AI methods based on user generated data. This work extends previous work by adding a methodology for an adaptive and personalised SG design. The so far developed methodologies are usually based on a linear approach. So the adaption is usually on micro level inside this linear game developing perspective. But a non-linear approach is more flexible and provides some space for macro adaptation, meaning adapting both the game development and the learning objectives to the user. In fact, a modular approach with multiple possible routes in game development is mostly suitable since it offers best opportunities for macro adaptation and set of different learning sequences. The development of a complex tutoring system like the one described above faces lots of challenges: Cold-start, co-adaptation and the fact that the Instructional Content adaptivity should be based on didactic models which should be based on learning theories. This paper will be used as a basis for further development of an adaptive and personalised SG.","authors":["Spyridon Blatsios","Refanidis Ioannis"],"meta":["May 2019","DOI:10.13140/RG.2.2.25266.45763","Project: Adaptive and Personalized educational games"],"references":["321425524_Approaches_for_Serious_Game_Design_A_Systematic_Literature_Review","308901673_Personalized_and_Adaptive_Serious_Games","275594541_A_New_Methodology_of_Design_and_Development_of_Serious_Games","246388980_How_Including_Prior_Knowledge_As_a_Subject_Variable_May_Change_Outcomes_of_Learning_Research","228570331_Towards_Flexible_Learning_Object_Metadata","224611929_Adaptive_Experience_Engine_for_Serious_Games","224357824_Adaptive_Educational_Games_Providing_Non-invasive_Personalised_Learning_Experiences","221588233_Solving_the_Narrative_Paradox_in_VEs_-_Lessons_from_RPGs","244956114_A_Framework_for_Task-Based_Learning","222427588_Selecting_learning_tasks_Effects_of_adaptation_and_shared_control_on_learning_efficiency_and_task_involvement"]}