{"id":"333207812_Experimental_analysis_of_Roman_coin_minting","abstract":"Historic coins are an artifact used for analysis in different research areas. This study contributes to the topic ofhistoric coin minting. Consulting ideas from thefield of experimental numismatics, an approach is proposed toevaluate minting of certain coins supported by real test samples. Therefore, a test setup is implemented for themanufacturing of coins under controlled process conditions. In this work, the main focus lies on the coin blanktemperature used for striking and thus, to contribute to the controversial problem, if minting is done“cold”,“warm”or“hot”. In order to prevent confusion, a suitable definition of the terms“cold”,“warm”or“hot”withrespect to the materials recrystallization temperature is given. Various test samples of copper-based material aremanufactured for different process conditions and initial coin blank temperatures, ranging from ambient tem-perature to 900 °C. Roman coins values,Dupondiiand late Roman AE coins, are conducted for a comparativeanalysis. All coins are evaluated and compared based on metallographic micro-sections. On the basis of theconducted test, strong indications are found for a“hot”striking process.","authors":["Christoph Hartmann","Franz Hammerl","Wolfram Volk"],"meta":["May 2019Journal of Archaeological Science: Reports 25:498-506","DOI:10.1016/j.jasrep.2019.05.007"],"references":["289697739_The_production_supply_and_use_of_late_Roman_and_early_Byzantine_copper_coinage_in_the_eastern_empire","259748818_Five_Small_Bronze_Hoards_from_Sardis_and_Their_Implications_for_Coin_Circulation_in_the_Fifth_Century_ce","270864108_Gold_Coinage_and_Its_Use_in_the_Post-Roman_West","259436788_The_Monetization_of_Temperate_Europe","230313690_The_early_Roman_Imperial_AES_coinage_II_Tracing_the_copper_sources_by_analysis_of_lead_and_copper_isotopes-Copper_coins_of_Augustus_and_Tiberius","229601180_The_Roman_denarius_under_the_Julio-Claudian_emperors_Mints_metallurgy_and_technology"]}