{"id":"333268073_Comment_entendre_le_passe_Quelques_lecons_d'une_collaboration_de_recherche_entre_acousticiens_et_specialistes_d'etudes_theatralesHow_to_Hear_the_Past_Some_Lessons_from_a_Collaborative_Research_between","abstract":"Comment entendre les sons du passé ? Même si les objets sonores et l’acoustique des bâtiments étaient restés exactement les mêmes, notre écoute, elle, n’est plus celle des auditeurs d’autrefois, un phénomène vérifié pour l’époque peu lointaine – la seconde moitié du xxe siècle – étudiée dans le projet ECHO. Les facteurs objectifs existent cependant et ils doivent être pris en compte. Pour tenter d’approcher la composante auditive de l’expérience vécue par les spectateurs dans les deux salles sélectionnées (la grande salle du Palais de Chaillot, la grande salle du Théâtre de l’Athénée), plusieurs méthodes ont été utilisées, relevant soit des SHS (sciences de l’homme et de la société), soit des STIC (sciences et technologies de l’information et de la communication) : étude d’archives – en particulier audio – et de témoignages par les chercheurs en études théâtrales (histoire, anthropologie, esthétique) ; reconstitution, simulation et auralisation de l’acoustique des salles par les acousticiens-informaticiens. L’enjeu était de faire dialoguer ces approches. L’article, écrit à quatre mains, propose un bilan détaillé de la collaboration, ses principes, ses difficultés, ses résultats attendus et inattendus.\n\nHow can we listen to the sounds of the past? Even if the sounding objects and acoustics of buildings have remained exactly the same, our listening is no longer that of listeners in the past, a phenomenon verified for a recent epoch – the second half of the 20th century – studied in the ECHO project. Objective factors exist though, and they need to be taken into account. In an attempt to explore the auditory aspect of spectator experience in two selected halls (the main halls of the Palais de Chaillot and Théâtre de l’Athénée), several methods were employed, coming from either the fields of the humanities and social sciences (HSS) or information and communication technologies (ICT): the study of archives – audio in particular – and testimonies by researchers in theatrical studies (history, anthropology, aesthetics); the re-creation, simulation, and auralization of room acoustics by acousticians and computer scientists. The challenge was to establish a dialogue between these two approaches. This article, a joint effort, offers a detailed overview of the collaboration including its principles, difficulties, and results, both expected and unexpected.","authors":["Brian F G Katz","Marie-Madeleine Mervant-Roux"],"meta":["February 2019Revue Sciences/Lettres","DOI:10.4000/rsl.1645"],"references":["268052373_Audio_visual_and_audio-visual_egocentric_distance_perception_in_virtual_environments","259871846_Audio_Visual_and_Audio-Visual_Egocentric_Distance_Perception_by_Moving_Subjects_in_Virtual_Environments","228347731_Ecological_Validity_of_soundscape_reproduction","44676345_Structural_properties_of_spatial_representations_in_blind_people_Scanning_images_constructed_from_haptic_exploration_or_from_locomotion_in_a_3-D_audio_virtual_environment","311749967_Perceptive_and_objective_evaluation_of_calibrated_room_acoustic_simulation_auralizations","309958179_Perceptual_attributes_for_the_comparison_of_head-related_transfer_functions","282894528_Creation_and_calibration_method_of_acoustical_models_for_historic_virtual_reality_auralizations","215514672_Auralization---An_overview"]}