{"id":"333295616_O_uso_de_ontologias_no_registro_de_licoes_aprendidas_em_projetos_gerenciados_com_Scrum","abstract":"O objetivo deste artigo é discorrer como, por meio do uso de ontologias como suporte à aplicação de métodos de apuração de lições aprendidas, pode ser estabelecida uma relação entre Gestão do\nConhecimento e Gestão de Projetos gerenciados segundo os preceitos do Scrum. Neste intuito, é realizada uma pesquisa bibliográfica, qualitativa e exploratória, buscando textos em bases de dados, livros e periódicos eu abordam as temáticas estudadas. Foram encontrados textos na Ciência da Informação, Ciência da Computação e Administração de Empresas que tratam de aspectos do relacionamento entre os temas pesquisados. A análise da literatura mostra que a Gestão do Conhecimento e a Gestão de Projetos são atividades complementares, que possuem pontos de\nencontro orientados ao fortalecimento do aprendizado e, portanto, devem ser conduzidas de maneira integrada, através de indivíduos, medidas organizacionais e tecnologias da informação e comunicação. Como parte da análise dos resultados é construído um mapa conceitual para ilustrar como os temas estudados se relacionam. O estudo conclui que o uso de ontologias favorece a aplicação de métodos de registro de lições aprendidas em projetos gerenciados através do Scrum, para validar, organizar e representar o considerável conhecimento tácito que é comumente empregado estes projetos.","authors":["Mauricio Augusto Cabral Ramos Junior","Regina Cianconi"],"meta":["May 2019","DOI:10.21714/2236-417X2019v9n1","Project: Elaboração de um método de registro de lições aprendidas baseado em ontologia e processamento semântico de acervos documentais textuais de projetos"],"references":["318216597_Ba_Um_Fator_Determinante_no_Uso_de_Sistemas_de_Gestao_do_conhecimento","287352161_Metodos_para_Captura_de_Licoes_Aprendidas_Em_Direcao_a_Melhoria_Continua_na_Gestao_de_Projetos","280677167_CoMMA_Corporate_Memory_Management_through_Agents_Corporate_Memory_Management_through_Agents_The_CoMMA_project_final_report","278645047_An_organizational_ontology_for_multiagent-based_Enterprise_Process_modeling_and_automation","278327586_Knowledge_Management_Intellectual_Capital_and_Project_Management_Connecting_the_Dots","275222742_Project_Knowledge_Management_How_Organizations_Learn_from_Experience","344516335_Knowledge_Management_Business_Intelligence_and_Content_Management_The_IT_Practitioner's_Guide","329593895_Barreiras_ao_compartilhamento_do_conhecimento_nas_organizacoes","313713566_The_new_new_product_development_game","288623597_Semantic_web_technologies_trends_and_research_in_ontology-based_systems"]}