{"id":"333238319_Edimbrujo_Hacia_la_definicion_de_un_modelo_didactico_para_la_ensenanza_de_la_Inteligencia_Artificial_en_Juegos","abstract":"Resumen La amplitud de los campos disciplina-res intervinientes en la enseñanza de las Ciencias de la Computación presenta serios desafíos para quienes intenten construir mo-delos didácticos para su enseñanza. Una de lasáreaslasáreas de conocimiento que mayor complejidad reviste en la percepción general es la enseñanza de la Inteligencia Artificial , disciplina entendida como el diseño y análisis de agentes autónomos que perciben el entorno e interactúan de forma racional conélconél. Por tratarse de unáreaunárea emergente en ma-teria de avances y estratégica respecto a sus implicancias futuras, resulta cada vez más necesario considerar su incorporar en los planes de estudio. Las fronteras de su aplicación se encuentran en permanente expansión y re-sulta necesario sostener una correspondencia con dicha progresión desde la dimensión cu-rricular. Este trabajo presenta una Línea de Inves-tigación tendiente a consolidar una estrategia de abordaje para la enseñanza del núcleo dis-ciplinar de la Inteligencia Artificial desde un enfoque lúdico. A tal efecto se describe un ecosistema digital construido como platafor-ma de soporte al proceso de enseñanza y de aprendizaje de las técnicas que sustancian el razonamiento artificial, siempre en el contex-to de su aplicación a los juegos. Palabras Clave: Enseñanza de las Cien-cias de la Computación, Agentes, Inteli-gencia Artificial. Contexto Esta propuesta se ubica en el contexto de las iniciativas promovidas por el Grupo de Investigación en Lenguajes e Inteligencia Artificial de la Facultad de Informática. Este trabajo se desarrolla en eí ambito del proyecto de investigación Agentes Inteligen-tes. Modelos Formales y Aplicaciones para la Educación (04/F015) que está financiado por la Universidad Nacional del Comahue a través de la Secretaría de Ciencia y Técnica. El proyecto tiene prevista una duración de cuatro años a partir de enero del 2017.","authors":["Federico Amigone","Pablo Kogan","Gastón Michelan","Jorge Rodriguez"],"meta":["May 2019","Project: AGENTES INTELIGENTES. MODELOS FORMALES Y APLICACIONES PARA LA EDUCACIÓN."],"references":["321009873_A_Game-Based_Competition_as_Instrument_for_Teaching_Artificial_Intelligence","282847268_From_Classroom_to_Mobile_Robots_Competition_Arena_An_Experience_on_Artificial_Intelligence_Teaching","264125333_Open_classroom_Enhancing_student_achievement_on_artificial_intelligence_through_an_international_online_competition"]}