{"id":"333238323_Enfoques_metodologicos_para_la_ensenanza_de_la_programacion_en_la_escuela_secundaria","abstract":"Resumen La enseñanza de la informática en la escue-la secundaria está transitando una profunda transformación. Existe un amplio consenso en incorporar contenidos sobre Ciencias de la Computación en las propuestas curriculares para la educación obligatoria. Eí area de conocimiento Algoritmos y Pro-gramación ocupa un lugar importante en las iniciativas y propuestas curriculares que se elaboran en este contexto. En losúltimoslos´losúltimos años se han desarrollado entornos dedicados específicamente a la enseñanza de la progra-mación. La definición de enfoques para la en-señanza y aprendizaje de la programación en eí ambito escolar es una pieza clave para el desarrollo y consolidación de los procesos que buscan aproximar las Ciencias de la Compu-tación a la Escuela Secundaria. En este trabajo se presenta una Línea de Investigación que busca producir cono-cimiento para favorecer los procesos de en-señanza y aprendizaje de la programación en ambientes escolares. Esta línea se basa en in-vestigaciones recientes acerca de la enseñan-za de la programación, en particular en el campo de Embodied Programming, enfoques que proponen la enseñanza de la programa-ción a partir de la modificación de código existente y estudios sobre cómo facilitar los procesos de transición de lenguajes basados en bloque a lenguajes basados en texto. Palabras Clave: Ciencias de la Compu-tación, Enseñanza de la Programación. Contexto Esta propuesta se ubica en el contexto de las iniciativas promovidas por el Grupo de Investigación en Lenguajes e Inteligencia Artificial de la Facultad de Informática. Este trabajo se desarrolla en eí ambito del proyecto de investigación Agentes Inteligen-tes. Modelos Formales y Aplicaciones para la Educación (04/F015) que está financiado por la Universidad Nacional del Comahue a través de la Secretaría de Ciencia y Técnica. El proyecto tiene prevista una duración de cuatro años a partir de enero del 2017.","authors":["Federico Amigone","Ruben Ramirez","Daniel Dolz","Gerardo Parra"],"meta":["May 2019","Project: AGENTES INTELIGENTES. MODELOS FORMALES Y APLICACIONES PARA LA EDUCACIÓN."],"references":["326668706_Embodied_Cognition_and_Its_Implications_in_Education_An_Overview_of_Recent_Literature","318754784_Introducing_Computational_Thinking_to_Young_Learners_Practicing_Computational_Perspectives_Through_Embodiment_in_Mathematics_Education","287209315_Frame-Based_Editing_Easing_the_Transition_from_Blocks_to_Text-Based_Programming","284895759_Distributed_Pair_Programming_Using_Collaboration_Scripts_An_Educational_System_and_Initial_Results","331302001_Teachers'_Experiences_of_using_PRIMM_to_Teach_Programming_in_School"]}