{"id":"333238002_Ciencias_de_la_Computacion_en_la_Escuela_Secundaria_El_desafio_de_la_Formacion_Docente","abstract":"Conocer sobre Ciencias de la Computación es crucial para mejorar las posibilidades de comprender e intervenir un mundo fuerte-mente influenciado por la informática, además de constituir un tipo de conocimiento fundamental para el ejercicio de la ciudadanía. En este contexto, muchos países en el mundo están realizando esfuerzos por es-tablecer a las Ciencias de la Computación como una disciplina académica en eí ambito de la educación primaria y secundaria. Uno de los aspec-tos más desafiantes lo constituye el proceso de formación continua de docentes en Ciencias de la Computación para le nivel secundario. El pre-sente trabajo analiza la problemática que el desafío representa y propone un enfoque didáctico específico para abordarlo. También establece preci-siones respecto de la vinculación que debe tener el enfoque en su praxis y el contexto académico que lo formula. 1 Introducción Conocer sobre Ciencias de la Computación es crucial para mejorar las posibil-idades de comprender e intervenir un mundo fuertemente influenciado por la informática, además de constituir un tipo de conocimiento fundamental para el ejercicio de la ciudadanía [9, 16]. En este contexto, muchos países en el mundo están realizando esfuerzos por establecer a las Ciencias de la Computación como una disciplina académica en eí ambito de la educación primaria y secundaria [13, 15]. La incorporación de nuevos contenidos y espacios curriculares en los planes de estudio requiere de la formación de un cuerpo docente destinado a enseñar estos saberes. En este marco se plantea que la formación docente continua y situada es una pieza clave para el desarrollo y consolidación de los procesos tendientes a favorecer la inclusión de forma sostenible y rigurosa de las Ciencias de la Computación en las escuelas[17, 5, 12]. Varios países realizan esfuerzos por capacitar a los docentes de computación, en Estados Unidos se llevó adelante el Proyecto CS10K que buscó formar a 10000 docentes en aspectos pedagógicos, disciplinares y didáctico-disciplinares [17]. En argentina la iniciativa Program.Ar, en articulación con un conjunto","authors":["Federico Amigone","Jorge Rodriguez"],"meta":["May 2019","Project: AGENTES INTELIGENTES. MODELOS FORMALES Y APLICACIONES PARA LA EDUCACIÓN."],"references":["316321578_An_evaluation_of_a_professional_learning_network_for_computer_science_teachers","312103979_La_formacion_docente_en_las_politicas_publicas_el_campo_de_las_practicas_como_posibilidad","311425641_Expanding_computer_science_education_in_schools_Understanding_teacher_experiences_and_challenges","301716623_Computer_science_in_K-12_school_curricula_of_the_2lst_century_Why_what_and_when","301237469_Computing_in_the_curriculum_Challenges_and_strategies_from_a_teacher's_perspective","292722310_A_Global_Snapshot_of_Computer_Science_Education_in_K-12_Schools","265884701_La_formacion_docente_como_politica_publica_consideraciones_y_debates","262470188_Computer_Science_in_Secondary_Schools_in_the_UK_Ways_to_Empower_Teachers","350952356_Who_am_I_understanding_high_school_computer_science_teachers'_professional_identity","304825112_TEALS_Teacher_Professional_Development_Using_Industry_Volunteers","262401690_Learning_to_Teach_Computer_Science_The_Need_for_a_Methods_Course","44556915_El_derecho_de_aprender_crear_buenas_escuelas_para_todos_Linda_Darling-Hammond"]}