{"id":"333224075_DELTA-LD_A_Change_Detection_Approach_for_Linked_Datasets","abstract":"This paper presents DELTA-LD, an approach that detects and classifies the changes between two versions of a linked dataset. It contributes to the state-of-art: firstly, by proposing a classification to distinctly identify the resources that have had both their IRIs and representation changed and the resources that have had only their IRI changed; secondly by automatically selecting the appropriate resource properties to identify the same resources in different versions of a linked dataset with different IRIs and similar representation. The paper also presents the DELTA-LD change model to represent the detected changes. This model captures the information of both changed resources and triples in linked datasets during its evolution, bridging the gap between resource-centric and triple-centric views of changes. As a result, a single change detection mechanism can support several diverse use cases like interlink maintenance and replica synchronization. The paper, in addition, describes an experiment conducted to examine the accuracy of DELTA-LD in detecting the changes between the person snapshots of DBpedia. The result indicates that the accuracy of DELTA-LD outperforms the state-of-art approaches by up to 4%, in terms of F-measure. It is demonstrated that the proposed classification of changes helped to identify up to 1529 additional updated resources as compared to the existing classification of resource level changes. By means of a case study, we also demonstrate the automatic repair of broken interlinks using the changes detected by DELTA-LD and represented in DELTA-LD change model, showing how 100% of the broken interlinks were repaired between DBpedia person snapshot 3.7 and Freebase.","authors":["Anuj Singh","Rob Brennan","Declan O’Sullivan"],"meta":["May 2019","Conference: MEPDAW @ ESWC 2018At: Greece"],"references":["309229687_Validating_Interlinks_Between_Linked_Data_Datasets_with_the_SUMMR_Methodology","305953258_Similarity-based_Change_Detection_for_RDF_in_MapReduce","284173648_A_Flexible_Framework_for_Understanding_the_Dynamics_of_Evolving_RDF_Datasets","262326610_Repairing_broken_RDF_links_in_the_web_of_data","260061783_Layered_Change_Log_Model_Bridging_between_Ontology_Change_Representation_and_Pattern_Mining_Layered_Change_Log_Model_Bridging_between_Ontology_Change_Representation_and_Pattern_Mining","240615147_Bootstrapping_the_Linked_Data_Web","321792848_Diagnosing_and_Minimizing_Semantic_Drift_in_Iterative_Bootstrapping_Extraction","262411115_High-level_change_detection_in_RDFS_KBs","260401746_Dataset_Dynamics_Compendium_A_Comparative_Study","220876997_Dasher---a_data_entry_interface_using_continuous_gestures_and_language_models"]}