{"id":"333200973_How_much_do_you_drink_A_mobile_application_for_empowerment_and_increase_awareness_in_young_users_of_alcohol","abstract":"OBJETIVO: Estudos sobre a epidemiologia do álcool no Brasil indicam que seu consumo tem se realizado em faixas etárias cada vez mais jovens, sugerindo a necessidade de revisão das medidas de controle, prevenção e tratamento. Para tanto, são necessários os mais diversos tipos de abordagens para o alcance dos usuários de álcool, que podem ser feitas com novos recursos da tecnologia, no caso do presente trabalho, por meio de uma tecnologia mHealth. Portanto, o presente estudo objetiva criar um aplicativo para dispositivos móveis que empodere o usuário quanto ao nível pessoal de consumo do álcool, as implicações e riscos associados, bem como permite o usuário a criar metas de redução de consumo. MÉTODOS: A concepção da tecnologia se deu por meio de reuniões semanais com uma equipe multidisciplinar composta por alunos e pesquisadores de Psicologia, Serviço Social e Ciências da Computação, pautadas no design de interação Participativo, levantando pontos importantes e fundamentais para abordagem com usuários de álcool. RESULTADOS: Observa-se que foi possível construir uma ferramenta concreta e aplicável que encontra-se em fase final de teste. CONCLUSÃO: O aplicativo concebido, em sua versão beta, apresenta funcionalidades para autoconscientização do consumo de álcool, que se estende nas diversas intensidades de uso, facilitando tanto a prevenção, como a identificação de problemas já instalados.","authors":["José Eurico Vasconcelos Filho","Ihan Souza Cavalcante","Cynthia de Freitas Melo","Tauily Taunay"],"meta":["June 2018"],"references":["291580843_Adolescencia_alcool_e_drogas_uma_revisao_na_perspectiva_da_promocao_da_saude","269399106_Entrevista_Motivacional_em_grupo_com_alcoolistas","250026801_Dependencia_quimica_problema_biologico_psicologico_ou_social","14491935_Alcoholic_beverage_consumption_and_associated_factors_in_Porto_Alegre_a_southern_Brazilian_city_A_population-based_survey"]}