{"id":"333238992_SD-IoV_SDN_enabled_routing_for_internet_of_vehicles_in_road-aware_approach","abstract":"Proposing an optimal routing protocol for internet of vehicles with reduced overhead has endured to be a challenge owing to the incompetence of the current architecture to manage flexibility and scalability. The proposed architecture, therefore, consolidates an evolving network standard named as software defined networking in internet of vehicles. Which enables it to handle highly dynamic networks in an abstract way by dividing the data plane from the control plane. Firstly, road-aware routing strategy is introduced: a performance-enhanced routing protocol designed specifically for infrastructure-assisted vehicular networks. In which roads are divided into road segments, with road side units for multi-hop communication. A unique property of the proposed protocol is that it explores the cellular network to relay control messages to and from the controller with low latency. The concept of edge controller is introduced as an operational backbone of the vehicle grid in internet of vehicles, to have a real-time vehicle topology. Last but not least, a novel mathematical model is estimated which assists primary controller in a way to find not only a shortest but a durable path. The results illustrate the significant performance of the proposed protocol in terms of availability with limited routing overhead. In addition, we also found that edge controller contributes mainly to minimizes the path failure in the network.","authors":["Tahir Abbas","Afaq Muhammad","Wang-Cheol Song"],"meta":["March 2020Journal of Ambient Intelligence and Humanized Computing 11(1)","DOI:10.1007/s12652-019-01319-w","Project: Future Network Technologies"],"references":["331259858_Congestion_avoidance_through_fog_computing_in_internet_of_vehicles","325519417_Routing_protocols_in_VANET_-_A_survey","322552954_Differential_flow_space_allocation_scheme_in_SDN_based_fog_computing_for_IoT_applications","318737704_A_path_analysis_of_two-level_hierarchical_road_aware_routing_in_VANETs","318504568_A_Newton-type_Forward_Backward_Greedy_Method_for_Multi-Snapshot_Compressed_Sensing","345815609_Fundamentals_of_Transportation_and_Traffic_Operations","317566854_SCGRP_SDN-enabled_Connectivity-aware_Geographical_Routing_Protocol_of_VANETs_for_urban_environment","316793556_Understanding_Complex_Systems","305422685_MoZo_A_Moving_Zone_Based_Routing_Protocol_Using_Pure_V2V_Communication_in_VANETs","305417387_SDVN_Enabling_rapid_network_innovation_for_heterogeneous_vehicular_communication"]}