{"id":"333299711_Designer_educacional_ou_instrucional_o_novo_pedagogo_da_era_digital","abstract":"O Design Educacional ou Instrucional (DI) surge a partir do trabalho multidisciplinar das áreas de psicologia, ciência da computação, engenharia, educação e negócios. Tem a sua origem durante a II Guerra Mundial, período em que um grande número de psicólogos foi chamado pelo exército dos EUA para realizar pesquisas e desenvolver materiais de treinamento com fins militares, focados nos diversos recursos de mídia. Houve, na época, significativa influência de como materiais de educação e treinamento vinham sendo desenvolvidos, assim, conhecimentos eram usados sobre avaliação e testagem para verificar as competências dos indivíduos que fossem capazes de se beneficiar de um determinado programa de treinamento. Como resultado, este caráter utilitário dos recursos audiovisuais ou de mídias migrou rapidamente nas décadas seguintes para o processo de ensino, utilizando estratégias de aprendizagem testadas para planejar atividades da prática educativa e alcançar os resultados desejados [1].Atualmente o conceito de Design Educacional significa uma ação intencional e sistemática do conhecimento utilizando-se as tecnologias de informação e comunicação para alcançar os objetivos propostos, motivando o desenvolvimento de capacidade e habilidades de indivíduos em comunidades de aprendizagem.É neste novo contexto de aprendizagem ou processo de instrução que surge um grande desafio: implementar um adequado ambiente de ensino no qual o aluno dite o andamento da aprendizagem a seu modo, concentrando-se no trabalho, na exploração e entretenimento. É o Designer Educacional ou Instrucional (DE) que delineará o projeto a ser definido para a sua implementação com o objetivo de proporcionar um ambiente dinâmico e interativo para a assimilação e desenvolvimento do conhecimento [1].Este profissional definirá o tema, a arquitetura da informação e as tecnologias a serem utilizadas no decorrer do projeto; fará o respaldo pedagógico para questionamentos, como exemplo, se uma animação em flash é realmente válida e relevante para o processo de aprendizagem. O Designer Educacional surge, assim, como o profissional que deve ter um olho hábil para identificar dentro dos assuntos todas as potencialidades pedagógicas e tecnológicas, com a finalidade de transformá-lo em um curso efetivo.Ele faz a adequação dos conteúdos às mídias digitais ou impressas, buscando sempre uma solução educacional adequada aos alunos que participam do curso. A sua ferramenta de garimpagem, ou seja, o instrumento de trabalho primordial é a pedagogia/andragogia e seus modelos e abordagens. Saber como extrair, combinar e aplicar as teorias ao público-alvo do seu projeto garante uma aprendizagem de qualidade. Este olhar do DE, com foco na educação, precisa perpassar todo o desenvolvimento do curso e, como um artesão, esse profissional tem como missão costurar o viés pedagógico ao técnico e estético, transformando o produto final não em um objeto de adorno, mas em uma preciosidade significativa para o aprendizado do aluno. Designers Educacionais (DEs) muitas vezes seguem um modelo tradicional de DI chamado o modelo ou método ADDIE. O mais simples e um dos mais utilizados que consiste nas seguintes etapas: Analyze (analisar), Design (planejar), Develop (desenvolver), Implement (implementar) and Evaluate (avaliar) [2].As competências profissionais necessárias ao exercício profissional do Designer Instrucional foram analisadas pelo International Board of Standards for Training, Performance and Instruction. Trata-se de uma listagem detalhada, obtida através de pesquisas junto a profissionais dessa área em diferentes países [3].No Brasil, o Ministério do Trabalho, por meio da CBO (Classificação Brasileira de Ocupações), classificou em março de 2008 a ocupação do Designer Educacional e a sua família: 2394 Programadores, avaliadores e orientadores de ensino - 2394-35 – Designer educacional/Designer instrucional – Desenhista instrucional, Projetista instrucional [4].","authors":["Adilia Sciarra","Luciano Garcia Lourenção"],"meta":["May 2019","DOI:10.33233/eb.v18i2.2867"],"references":["250991229_Navegando_nas_ondas_da_educacao_online_competencias_do_designer_educativo","225552234_A_history_of_instructional_design_and_technology_Part_I_A_history_of_instructional_media"]}