{"id":"333232575_Corporate_Editors_in_the_Evolving_Landscape_of_OpenStreetMap","abstract":"OpenStreetMap (OSM), the largest Volunteered Geographic Information project in the world, is characterized both by its map as well as the active community of the millions of mappers who produce it. The discourse about participation in the OSM community largely focuses on the motivations for why members contribute map data and the resulting data quality. Recently, large corporations including Apple, Microsoft, and Facebook have been hiring editors to contribute to the OSM database. In this article, we explore the influence these corporate editors are having on the map by first considering the history of corporate involvement in the community and then analyzing historical quarterly-snapshot OSM-QA-Tiles to show where and what these corporate editors are mapping. Cumulatively, millions of corporate edits have a global footprint, but corporations vary in geographic reach, edit types, and quantity. While corporations currently have a major impact on road networks, non-corporate mappers edit more buildings and points-of-interest: representing the majority of all edits, on average. Since corporate editing represents the latest stage in the evolution of corporate involvement, we raise questions about how the OSM community—and researchers—might proceed as corporate editing grows and evolves as a mechanism for expanding the map for multiple uses.","authors":["Jennings Anderson","Dipto Sarkar","Leysia Palen"],"meta":["May 2019International Journal of Geo-Information 8(5):232","DOI:10.3390/ijgi8050232"],"references":["325776845_Accuracy_Evaluation_of_the_Canadian_OpenStreetMap_Road_Networks","323029213_Participation_and_marginality_on_the_geoweb_The_politics_of_non-mapping_on_OpenStreetMap_Jerusalem","322809506_The_Crowd_is_the_Territory_Assessing_Quality_in_Peer-Produced_Spatial_Data_During_Disasters","320878311_A_review_of_OpenStreetMap_data","316185463_Crowdsourced_Geographic_Information_Use_in_Government","301645708_Models_of_direct_editing_of_government_spatial_data_challenges_and_constraints_to_the_acceptance_of_contributed_data","322912939_Volunteered_Geographic_Information_constructions_in_a_contested_terrain_A_case_of_OpenStreetMap_in_China","320941947_How_geopolitical_conflict_shapes_the_mass-produced_online_map","311341019_OpenStreetMap_in_Israel_and_Palestine_-_'Game_changer'_or_reproducer_of_contested_cartographies","291957500_Building_generic_quality_indicators_for_OpenStreetMap"]}