{"id":"333270350_Multi-scale_shape_optimisation_of_lattice_structures_an_evolutionary-based_approach","abstract":"This study deals with the problem of the least-weight design of a lattice structure subject to constraints of different nature. To face this problem, a general multi-scale optimisation procedure is proposed. This approach aims at optimising both global and local geometric parameters defining the shape of the representative volume element of the lattice at the mesoscopic scale. The optimisation procedure involves design requirements defined at different scales: geometric and manufacturing constraints are involved at the mesoscopic scale, whilst thermodynamic constraints on the positive definiteness of the stiffness tensor of the lattice (modelled as an equivalent homogeneous anisotropic medium) intervene at the macroscopic scale. Finally, since lattice structures usually undergo compressive loads, a requirement on the first local buckling load is considered too. The proposed approach is based on (a) the non-uniform rational basis splines curves theory to describe the shape of the struts composing the lattice, (b) the strain energy homogenisation technique of periodic media to perform the scale transition and (c) a special genetic algorithm to perform optimisation calculations. The optimised solutions provided by the presented method are characterised by a weight saving of about 39% with slightly enhanced mechanical properties when compared to conventional octahedral lattice structures.","authors":["Giulia Bertolino","Marco Montemurro","Giorgio De Pasquale"],"meta":["December 2019International Journal on Interactive Design and Manufacturing (IJIDeM)","DOI:10.1007/s12008-019-00580-9"],"references":["333164621_NURBS_hyper-surfaces_for_3D_topology_optimization_problems","330495437_Determination_of_the_effective_elastic_properties_of_titanium_lattice_structures","330442520_Least-weight_composite_plates_with_unconventional_stacking_sequences_Design_analysis_and_experiments","329047315_Mechanical_behaviour_of_additively-manufactured_polymeric_octet-truss_lattice_structures_under_quasi-static_and_dynamic_compressive_loading","328556863_A_general_B-Spline_surfaces_theoretical_framework_for_optimisation_of_variable_angle-tow_laminates","328483458_Finite-Element-Mesh_Based_Method_for_Modeling_and_Optimization_of_Lattice_Structures_for_Additive_Manufacturing","327946463_Configuration_Optimization_Design_of_Ti6Al4V_Lattice_Structure_Formed_by_SLM","333602754_A_contribution_to_the_development_of_design_strategies_for_the_optimisation_of_lightweight_structures","331237343_Experimental_Characterization_of_SLM_and_EBM_Cubic_Lattice_Structures_for_Lightweight_Applications","327936851_Experimental_evaluation_of_selective_laser_melting_process_for_optimized_lattice_structures"]}