{"id":"333240516_Fair_division_in_the_presence_of_externalities","abstract":"The problem of fair division of payoff is one of the key issues when considering cooperation of strategic individuals. It arises naturally in a number of applications related to operational research, including sharing the cost of transportation or dividing the profit among supply chain agents. In this paper, we consider the problem of extending the Shapley Value—a fundamental payoff division scheme—to cooperative games with externalities. While this problem has raised a lot of attention in the literature, most works focused on developing alternative axiomatizations for an extension. Instead, in this paper we focus on the coalition formation process that naturally leads to an extended payoff division scheme. Specifically, building upon recent literature, we view coalition formation as a discrete-time stochastic process, characterized by the underlying family of probability distributions on the set of partitions of players. Given this, we analyse how various properties of the probability distributions that underlie the stochastic processes relate to the game-theoretic properties of the corresponding payoff division scheme. Finally, we prove that the Stochastic Shapley value—a known payoff division scheme from the literature—is the only one that satisfies all aforementioned axioms.","authors":["Oskar Skibski","Tomasz Michalak"],"meta":["March 2020International Journal of Game Theory 49(01)","DOI:10.1007/s00182-019-00682-4"],"references":["271201799_New_Developments_in_Coalition_Theory_An_Application_to_the_Case_of_Global_Pollution","261665092_The_Shapley_value_for_partition_function_form_games","325795891_Axiomatic_Characterization_of_Game-Theoretic_Centrality","325310670_The_Shapley-value","316782270_The_Stochastic_Shapley_Value_for_Coalitional_Games_with_Externalities","284289939_A_Value_for_n-Person_Games","263981681_Null_players_out_Linear_values_for_games_with_variable_supports","256755856_Cumulants_in_noncommutative_probability_theory_IV_Noncrossing_cumulants_De_Finetti's_theorem_and_LpLp-inequalities","245580535_Bargaining_Coalitions_and_Externalities","243786155_The_Representation_of_Partition_Structures"]}