{"id":"333366518_Teachers'_involvement_and_students'_self-efficacy_Keys_to_achievement_in_higher_education","abstract":"We study the relative importance of the three dimensions of need-supportive teaching (NST) and students’ self-efficacy to gain new knowledge about students’ achievement in higher education. NST assumes that teachers are key to the motivation of students, providing autonomy support, structure (support of competence), and involvement (support of relatedness). In turn, self-efficacy raises students’ confidence in their ability to succeed in academic tasks. Drawing on 86,000 records of teaching evaluations by students at the University of Girona (Spain), we present evidence that teachers’ involvement and students’ self-efficacy are the two elements most strongly and positively related to achievement. Students obtain higher marks when they believe that their teachers are dependable and available to offer resources, and when they feel capable of organizing and implementing the courses of action necessary to acquire knowledge. We also find that students’ experience of autonomy support and structure are negatively (or not) correlated with achievement. Subgroup analyses also indicate that students have different needs in different knowledge areas.","authors":["Sara Ayllón","Alsina Angel","Jordi Colomer"],"meta":["May 2019PLoS ONE 14(5):e0216865","DOI:10.1371/journal.pone.0216865","Project: Reflective learning in higher education"],"references":["319278741_Effects_of_self-assessment_on_self-regulated_learning_and_self-efficacy_Four_meta-analyses","318162260_Instructors'_teaching_styles_relation_with_competences_self-efficacy_and_commitment_in_pre-service_teachers","321606810_Trends_and_Prospects_in_Motivation_Research","321392450_The_Effects_of_Self-Regulation_and_Self-Efficacy_on_Academic_Outcome","320296361_When_Should_You_Adjust_Standard_Errors_for_Clustering","320034637_Need-supportive_teaching_in_higher_education_Configurations_of_autonomy_support_structure_and_involvement","316823281_Self-efficacy_the_exercise_of_control","313060183_Extrinsic_rewards_and_inner_motivation","311556851_A_practitioner's_guide_to_cluster-robust_inference","309344607_Network_science_on_belief_system_dynamics_under_logic_constraints"]}