{"id":"333336393_Computer_Science_Pedagogical_Content_Knowledge_Characterizing_Teacher_Performance","abstract":"Computer science education efforts are expanding across the globe to equip students with the necessary computing skills for today’s digital world. However, preparing students to become literate in computing activities requires the training of tens of thousands of teachers in computer science. The discrepancy between student needs and teacher preparation in computer science has raised questions of quality teachers, particularly for teachers who do not possess adequate content or pedagogical knowledge to teach computer science efficiently. To address this issue, we designed an instrument to measure knowledge needed to teach computer science (i.e., computer science pedagogical content knowledge). Results exhibited that our instrument measured aspects of teachers’ computer science pedagogical content knowledge; however, teachers’ prior background in teaching did not influence their performance. We discuss implications for future research and practice.","authors":["Aman Yadav","Marc Berges"],"meta":["May 2019ACM Transactions on Computing Education 19(3):1-24","DOI:10.1145/3303770","Project: PD4CS: Leading the Way to CS10K: Assessing a Just-in-Time Professional Development Approach for Teacher Knowledge Growth in Computer Science"],"references":["320679287_Students'_Misconceptions_and_Other_Difficulties_in_Introductory_Programming_A_Literature_Review","311425641_Expanding_computer_science_education_in_schools_Understanding_teacher_experiences_and_challenges","309086464_Measuring_computer_science_pedagogical_content_knowledge_An_exploratory_analysis_of_teaching_vignettes_to_measure_teacher_knowledge","343975330_Developing_science_teachers'_pedagogical_content_knowledge","341412627_What_the_student_does_Teaching_for_enhanced_learning","321512261_Those_who_Understand_Knowledge_Growth_in_Teaching","316801486_Guide_to_Teaching_Computer_Science","313635239_Teachers_of_substance_Subject_matter_knowledge_for_teaching","313223747_Teachers_of_substance_Subject_matter_knowledge_for_teaching","306160222_What_the_student_does_Teaching_for_advanced_learning"]}