{"id":"333469185_Tree_Height_Estimation_of_Forest_Plantation_in_Mountainous_Terrain_from_Bare-Earth_Points_Using_a_DoG-Coupled_Radial_Basis_Function_Neural_Network","abstract":"Tree heights are the principal variables for forest plantation inventory. The increasing availability of high-resolution three-dimensional (3D) point clouds derived from low-cost Unmanned Aerial Vehicle (UAV) and modern photogrammetry offers an opportunity to generate a Canopy Height Model (CHM) in the mountainous areas. In this paper, we assessed the capabilities of tree height estimation using UAV-based Structure-from-Motion (SfM) photogrammetry and Semi-Global Matching (SGM). The former is utilized to generate 3D geometry, while the latter is used to generate dense point clouds from UAV imagery. The two algorithms were coupled with a Radial Basis Function (RBF) neural network to acquire CHMs in mountainous areas. This study focused on the performance of Digital Terrain Model (DTM) interpolation over complex terrains. With the UAV-based image acquisition and image-derived point clouds, we constructed a 5 cm-resolution Digital Surface Model (DSM), which was assessed against 14 independent checkpoints measured by a Real-Time Kinematic Global Positioning System RTK GPS. Results showed that the Root Mean Square Errors (RMSEs) of horizontal and vertical accuracies are approximately 5 cm and 10 cm, respectively. Bare-earth Index (BEI) and Shadow Index (SI) were used to separate ground points from the image-derived point clouds. The RBF neural network coupled with the Difference of Gaussian (DoG) was exploited to provide a favorable generalization for the DTM from 3D ground points with noisy data. CHMs were generated using the height value in each pixel of the DSM and by subtracting the corresponding DTM value. Individual tree heights were estimated using local maxima algorithm under a contour-surround constraint. Two forest plantations in mountainous areas were selected to evaluate the accuracy of estimating tree heights, rather than field measurements. Results indicated that the proposed method can construct a highly accurate DTM and effectively remove nontreetop maxima. Furthermore, the proposed method has been confirmed to be acceptable for tree height estimation in mountainous areas given the strong linear correlation of the measured and estimated tree heights and the acceptable t-test values. Overall, the low-cost UAV-based photogrammetry and RBF neural network can yield a highly accurate DTM over mountainous terrain, thereby making them particularly suitable for rapid and cost-effective estimation of tree heights of forest plantation in mountainous areas.","authors":["Haiqing He","Yeli Yan","Ting Chen","Penggen Cheng"],"meta":["May 2019Remote Sensing 11(11):1271","DOI:10.3390/rs11111271"],"references":["332808303_Building_Extraction_from_UAV_Images_Jointly_Using_6D-SLIC_and_Multiscale_Siamese_Convolutional_Networks","332302124_UAV-Based_Automatic_Detection_and_Monitoring_of_Chestnut_Trees","332058299_UAV-Based_Photogrammetric_Tree_Height_Measurement_for_Intensive_Forest_Monitoring","331919475_Automatic_Single_Tree_Detection_in_Plantations_using_UAV-based_Photogrammetric_Point_clouds","330031597_A_Single-Tree_Processing_Framework_Using_Terrestrial_Laser_Scanning_Data_for_Detecting_Forest_Regeneration","329189950_Application_of_UAV_Photogrammetric_System_for_Monitoring_Ancient_Tree_Communities_in_Beijing","328360958_Evaluation_of_the_Newly_Released_Worldwide_AW3D30_DEM_Over_Typical_Landforms_of_China_Using_Two_Global_DEMs_and_ICESatGLAS_Data","320722143_Assessment_of_UAV_and_Ground-Based_Structure_from_Motion_with_Multi-View_Stereo_Photogrammetry_in_a_Gullied_Savanna_Catchment","318401968_Vertical_stratification_of_forest_canopy_for_segmentation_of_understory_trees_within_small-footprint_airborne_LiDAR_point_clouds","323656273_Accuracy_and_effectiveness_of_low_cost_UASs_and_open_source_photogrammetric_software_for_foredunes_mapping"]}