{"id":"333430906_Beliefs_in_Brilliance_and_Belonging_Uncertainty_in_Male_and_Female_STEM_StudentsTable_1docx","abstract":"A wide-spread stereotype that influences women's paths into STEM (or non-STEM) fields is the implicit association of science and mathematics with \"male\" and with requiring high levels of male-associated \"brilliance.\" Recent research on such \"field-specific ability beliefs\" has shown that a high emphasis on brilliance in a specific field goes along with a low share of female students among its graduates. A possible mediating mechanisms between cultural expectations and stereotypes on the one hand, and women's underrepresentation in math-intensive STEM fields on the other hand, is that women may be more likely than men to feel that they do not belong in these fields. In the present study, we investigated field-specific ability beliefs as well as belonging uncertainty in a sample of n = 1294 male and female university students from five STEM fields (Mathematics, Physics, Computer Science, Electrical Engineering, and Mechanical Engineering) at a prestigious technical university in Switzerland. Field-specific ability beliefs of both men and women emphasized brilliance more in more math-intensive fields (Mathematics, Physics) than in less math-intensive fields (Engineering). Women showed higher beliefs in brilliance than men did, and also reported higher levels of belonging uncertainty. For both genders, there was a small, positive correlation (r = 0.19) of belief in brilliance and belonging uncertainty. A relatively small, but significant portion of the effect of gender on belonging uncertainty was mediated by women's higher belief in brilliance.","authors":["Anne Deiglmayr","Elsbeth Stern","Renate Schubert"],"meta":["May 2019Frontiers in Psychology 10","DOI:10.3389/fpsyg.2019.01114"],"references":["328549484_Which_Cognitive_Abilities_Make_the_Difference_Predicting_Academic_Achievements_in_Advanced_STEM_Studies","326279409_Segregation_stereotypes_and_STEM","323197652_The_Gender-Equality_Paradox_in_Science_Technology_Engineering_and_Mathematics_Education","321082645_Messages_about_Brilliance_Undermine_Women's_Interest_in_Educational_and_Professional_Opportunities","290478335_Gender_Gap_in_Science_Technology_Engineering_and_Mathematics_STEM_Current_Knowledge_Implications_for_Practice_Policy_and_Future_Directions","285358562_Studying_Gender_Bias_in_Physics_Grading_The_role_of_teaching_experience_and_country","281910089_A_Gender_Bias_in_the_Attribution_of_Creativity_Archival_and_Experimental_Evidence_for_the_Perceived_Association_Between_Masculinity_and_Creative_Thinking","280295804_Women's_Representation_in_Science_Predicts_National_Gender-Science_Stereotypes_Evidence_From_66_Nations","309021383_Why_are_some_STEM_fields_more_gender_balanced_than_others","289066201_Introduction_to_Mediation_Moderation_and_Conditional_Process_Analysis_A_Regression-Based_Approach"]}