{"id":"333472917_Learning_the_signatures_of_the_human_grasp_using_a_scalable_tactile_glove","abstract":"Humans can feel, weigh and grasp diverse objects, and simultaneously infer their material properties while applying the right amount of force—a challenging set of tasks for a modern robot1. Mechanoreceptor networks that provide sensory feedback and enable the dexterity of the human grasp2 remain difficult to replicate in robots. Whereas computer-vision-based robot grasping strategies3–5 have progressed substantially with the abundance of visual data and emerging machine-learning tools, there are as yet no equivalent sensing platforms and large-scale datasets with which to probe the use of the tactile information that humans rely on when grasping objects. Studying the mechanics of how humans grasp objects will complement vision-based robotic object handling. Importantly, the inability to record and analyse tactile signals currently limits our understanding of the role of tactile information in the human grasp itself—for example, how tactile maps are used to identify objects and infer their properties is unknown6. Here we use a scalable tactile glove and deep convolutional neural networks to show that sensors uniformly distributed over the hand can be used to identify individual objects, estimate their weight and explore the typical tactile patterns that emerge while grasping objects. The sensor array (548 sensors) is assembled on a knitted glove, and consists of a piezoresistive film connected by a network of conductive thread electrodes that are passively probed. Using a low-cost (about US$10) scalable tactile glove sensor array, we record a large-scale tactile dataset with 135,000 frames, each covering the full hand, while interacting with 26 different objects. This set of interactions with different objects reveals the key correspondences between different regions of a human hand while it is manipulating objects. Insights from the tactile signatures of the human grasp—through the lens of an artificial analogue of the natural mechanoreceptor network—can thus aid the future design of prosthetics7, robot grasping tools and human–robot interactions1,8–10. Tactile patterns obtained from a scalable sensor-embedded glove and deep convolutional neural networks help to explain how the human hand can identify and grasp individual objects and estimate their weights.","authors":["Subramanian Sundaram","Petr Kellnhofer","Yunzhu Li","Jun-Yan Zhu"],"meta":["May 2019Nature 569(7758):698-702","DOI:10.1038/s41586-019-1234-z"],"references":["326738358_Closing_the_Loop_for_Robotic_Grasping_A_Real-time_Generative_Grasp_Synthesis_Approach","325888226_Prosthesis_with_neuromorphic_multilayered_e-dermis_perceives_touch_and_pain","318663148_Simulating_tactile_signals_from_the_whole_hand_with_millisecond_precision","317944162_Simulating_tactile_signals_from_the_whole_hand_with_millisecond_precision","312112438_Combining_sensory_modalities_and_exploratory_procedures_to_improve_haptic_object_recognition_in_robotics","330443019_Learning_ambidextrous_robot_grasping_policies","320971142_Network_Dissection_Quantifying_Interpretability_of_Deep_Visual_Representations","320971099_Hand_Keypoint_Detection_in_Single_Images_Using_Multiview_Bootstrapping","311757026_Robust_material_classification_with_a_tactile_skin_using_deep_learning","311755105_Distinguishing_sliding_from_slipping_during_object_pushing","308994536_Combining_Finger_Vision_and_Optical_Tactile_Sensing_Reducing_and_Handling_Errors_While_Cutting_Vegetables","311609041_Deep_Residual_Learning_for_Image_Recognition","310452461_Robots_with_a_sense_of_touch","307719713_Efficient_object_localization_using_Convolutional_Networks","304812043_Pursuing_prosthetic_electronic_skin"]}