{"id":"333489187_Deep_Learning_based_Automatic_Approach_using_Hybrid_Global_and_Local_Activated_Features_towards_Large-scale_Multi-class_Pest_Monitoring","abstract":"Monitoring pest in agriculture has been a high-priority issue all over the world. Computer vision techniques are widely utilized in practical crop pest prevention applications due to the rapid development of artificial intelligence technology. However, current deep learning image analytic approaches achieve low accuracy and poor robustness in agriculture pest monitoring task. This paper targets at this challenge by proposing a novel two-stage deep learning based automatic pest monitoring system with hybrid global and local activated feature. In this approach, a Global activated Feature Pyramid Network (GaFPN) is firstly proposed for extracting highly representative features of pests over both depth and spatial position activation levels. Then, an improved Local activated Region Proposal Network (LaRPN) augmenting contextual and attentional information is represented for precisely locating pest objects. Finally, we design a fully connected neural network to estimate the severity of input image under the detected pests. The experimental results on our 88.6K images dataset (with 16 types of common pests) show that our approach outweighs the state-of-the-art methods in industrial circumstances.","authors":["Liu Liu","Rujing Wang","Chengjun Xie","Po Yang"],"meta":["May 2019","DOI:10.1109/INDIN41052.2019.8972026","Conference: IEEE International Conference on Industrial Informatics 2019At: Helsinki-Espoo, Finland","Project: Innovate UK (UK-China: Precision for Enhancing Agriculture Productivity): \"Farmer-centred Interoperable Mobile-Cloud System: Integrating Data from Farming Activities and Environmental Information for Sustainable Fertiliser Management\""],"references":["320070245_A_Multispectral_3-D_Vision_System_for_Invertebrate_Detection_on_Crops","324996175_Understanding_Convolution_for_Semantic_Segmentation","322060396_Mask_R-CNN","320971779_Finding_Tiny_Faces","320964510_Feature_Pyramid_Networks_for_Object_Detection","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","314200288_Automatic_Adjustable_Spraying_Device_for_Site-Specific_Agricultural_Application","311609041_Deep_Residual_Learning_for_Image_Recognition","311573567_Feature_Pyramid_Networks_for_Object_Detection","310390982_Regularized_Neural_Networks_Fusion_and_Genetic_Algorithm_Based_On-Field_Nitrogen_Status_Estimation_of_Wheat_Plants"]}