{"id":"333468754_Minimum_length_scale_control_in_a_NURBS-based_SIMP_method","abstract":"Controlling the minimum size (or length scale) of geometric features in topology optimisation analyses is of paramount\nimportance. Particularly, the minimum length scale must always be considered according to the smallest manufacturable size.\nThe goal of this work is to provide an intuitive methodology for controlling the minimum length scale in a NURBS density-based\nalgorithm for topology optimisation. In this framework, the minimum length scale can be properly tailored by acting\non some parameters tuning the shape of the NURBS geometric entity, i.e. degrees, number of control points and knot vectors\ncomponents. The main consequence is that the proposed method does not need the introduction of an explicit optimisation\nconstraint into the problem formulation to take into account for the minimum length scale requirement. The effectiveness of the\nproposed method is proven on meaningful benchmarks for both 2D and 3D applications. Results show that the minimum\nlength scale requirement is properly met on the reassembled geometry at the end of the optimisation process.","authors":["Giulio Costa","Marco Montemurro","Jérôme Pailhès"],"meta":["May 2019Computer Methods in Applied Mechanics and Engineering","DOI:10.1016/j.cma.2019.05.026","Project: Design and optimization methodologies for Additive Manufacturing structures"],"references":["333164621_NURBS_hyper-surfaces_for_3D_topology_optimization_problems","325966440_A_geometry-based_method_for_3D_Topology_Optimization","321268212_A_2D_Topology_Optimisation_algorithm_in_NURBS_framework_with_geometric_constraints","313839988_A_NURBS-BASED_TOPOLOGY_OPTIMIZATION_METHOD_INCLUDING_ADDITIVE_MANUFACTURING_CONSTRAINTS","291185057_Length_scale_and_manufacturability_in_density-based_topology_optimization","280899793_Manufacturing_Constraints_and_Multi-Phase_Shape_and_Topology_Optimization_via_a_Level-Set_Method","278828585_Thickness_control_in_structural_optimization_via_a_level_set_method","333602754_A_contribution_to_the_development_of_design_strategies_for_the_optimisation_of_lightweight_structures","314607206_B-Spline_Based_Robust_Topology_Optimization","277337584_Minimum_length_scale_in_topology_optimization_by_geometric_constraints"]}