{"id":"333487946_Over-optimization_of_academic_publishing_metrics_Observing_Goodhart's_Law_in_action","abstract":"Background\nThe academic publishing world is changing significantly, with ever-growing numbers of publications each year and shifting publishing patterns. However, the metrics used to measure academic success, such as the number of publications, citation number, and impact factor, have not changed for decades. Moreover, recent studies indicate that these metrics have become targets and follow Goodhart’s Law, according to which, “when a measure becomes a target, it ceases to be a good measure.”\n\nResults\nIn this study, we analyzed >120 million papers to examine how the academic publishing world has evolved over the last century, with a deeper look into the specific field of biology. Our study shows that the validity of citation-based measures is being compromised and their usefulness is lessening. In particular, the number of publications has ceased to be a good metric as a result of longer author lists, shorter papers, and surging publication numbers. Citation-based metrics, such citation number and h-index, are likewise affected by the flood of papers, self-citations, and lengthy reference lists. Measures such as a journal’s impact factor have also ceased to be good metrics due to the soaring numbers of papers that are published in top journals, particularly from the same pool of authors. Moreover, by analyzing properties of >2,600 research fields, we observed that citation-based metrics are not beneficial for comparing researchers in different fields, or even in the same department.\n\nConclusions\nAcademic publishing has changed considerably; now we need to reconsider how we measure success.","authors":["Michael Fire","Carlos Guestrin"],"meta":["June 2019GigaScience 8(6)","DOI:10.1093/gigascience/giz053"],"references":["330074468_An_empirical_investigation_of_the_tribes_and_their_territories_Are_research_specialisms_rural_and_urban","327263408_The_continuing_evolution_of_publishing_in_the_biological_sciences","325160693_c-index_and_Subindices_of_the_h-index_New_Variants_of_the_h-index_to_Account_for_Variations_in_Author_Contribution","323502497_Science_of_science","321636142_Authorship_and_citation_manipulation_in_academic_research","319236709_Altmetrics_Can_you_afford_to_ignore_it","330546887_What_bioRxiv's_first_30000_preprints_reveal_about_biologists","327102262_Tide_of_lies","320262612_The_unsung_heroes_of_gravitational_waves","319020978_Comment_Measure_for_measure"]}