{"id":"333411629_Transtech_development_of_a_novel_translator_for_Roman_Urdu_to_English","abstract":"Advances in machine and language translation immerge new fields and research opportunities for researchers, whereas Natural Language Processing and Computational Linguistics deal with communication between natural languages and their interaction. The objective of this research is to develop and test a novel tactic to solve the issue of translation from Roman Urdu to the English language. The approach used to construct this practical model is divided into three stages; each stage works out to achieve its desired task. Self-maintained corpus alongwith its corresponding tag-set is used for tokenization. The syntactical structure is covered by writing Urdu POS tagger\nbased on grammatical rules. We prepared the grammatical structures of different sentences for Roman Urdu to English translation. Since Roman script can be expressed in numerous ways, our grammatical structures fulfill the maximum possible needs of writing and produce the best possible English translation. We entered a sentence in\nRoman Urdu which gave the best possible translation in the English language. In comparison with Google Translator, Transtech worked better and gives more accurate results.","authors":["Hafsa Masroor","Muhammad Saeed","Maryam Feroz","Kamran Ahsan"],"meta":["May 2019Heliyon 5(5):e01780","DOI:10.1016/j.heliyon.2019.e01780"],"references":["303748038_Urdu_language_processing_a_survey","221102079_Urdu_and_Hindi_Translation_and_sharing_of_linguistic_resources","220816695_Urdu_Word_Segmentation","215904200_Latent_Dirichlet_allocation_LDA_and_topic_modeling_models_applications_future_challenges_a_survey","318133980_Word_Embedding_for_Understanding_Natural_Language_A_Survey","238091753_Developing_a_tagset_for_automated_part-of-speech_tagging_in_Urdu","221614533_Towards_an_error-free_Arabic_stemming","221614149_Baseline_for_Urdu_IR_evaluation","200044309_WordNet_A_Lexical_Database_for_English"]}