{"id":"333497842_Metaheuristic_Algorithms_for_Independent_Task_Scheduling_in_Symmetric_and_Asymmetric_Cloud_Computing_Environment","abstract":"Cloud computing (CC) is a recent technology in the Information and Communication Technology (ICT) field. It provides an on-demand access to the shared pool of resources via virtualization. Large enterprises move toward CC due to its flexibility and scalability driven from its elastic pay-per-use model. To provide ensured efficient performance to users, tasks should be efficiently mapped to available resources. Therefore, task scheduling (TS) is significant issue in the CC technology. TS is a NP complete optimization problem, so a deep investigation of different metaheuristic and heuristic TS algorithms is presented here. Particle Swarm Optimization (PSO), and Genetic Algorithms (GA) as metaheuristic algorithms are implemented and their performance have been compared to heuristic techniques (First Come First Serve (FCFS) and Shortest Job First (SJF)) on symmetric and asymmetric environment. The cloud service providers and users have different performance requirements. Six performance metrics including makespan, flow time, response time, resource utilization, throughput time and degree of imbalance have been measured. For asymmetric environment, real environment, metaheuristic TS algorithms surpassed the heuristic methods. PSO accomplished a saving of 53.33%, 35.61%, 11.96%, 76.03, and37.41% for optimizing the makespan, flow time, response time, degree of imbalance, and throughput using synthetic and 68.25%, 49.2%, 9.78%, 40.70%, and 53.33% using real workload traces in asymmetric environment. However, heuristic methods have yielded a better enactment in symmetric environment.","authors":["Nagwan M. Abdel Samee","Sara Sayed Ahmed","Rania Ahmed Abul Seoud"],"meta":["April 2019Journal of Computer Science 15(4):594-611","DOI:10.3844/jcssp.2019.594.611","Project: Cloud Computing Environment"],"references":["316058020_A_review_of_task_scheduling_based_on_meta-heuristics_approach_in_cloud_computing","312650222_Task_Scheduling_in_Distributed_Systems_Using_Heap_Intelligent_Discrete_Particle_Swarm_Optimization_HIDPSO","311771195_Recent_advancements_in_resource_allocation_techniques_for_cloud_computing_environment_A_systematic_review","308647457_Meta-Heuristics_Based_Approach_for_Workflow_Scheduling_in_Cloud_Computing_A_Survey","324295699_Dynamic_heterogeneous_shortest_job_first_DHSJF_a_task_scheduling_approach_for_heterogeneous_cloud_computing_systems","322566740_A_Survey_on_Virtual_Machine_Migration_Challenges_Techniques_and_Open_Issues","317060086_Heuristic_based_Independent_Task_Scheduling_Techniques_in_Cloud_Computing_A_Review","313902309_An_Improved_SJF_Scheduling_Algorithm_in_Cloud_Computing_Environment","311935750_Task_Scheduling_Algorithm_in_Cloud_Computing_Environment_Based_on_Cloud_Pricing_Models","308295736_Metaheuristics_-_A_Short_Introduction"]}