{"id":"333449559_High-efficiency_large-area_topology-optimized_metasurfaces","abstract":"Metasurfaces are ultrathin optical elements that are highly promising for constructing lightweight and compact optical systems. For their practical implementation, it is imperative to maximize the metasurface efficiency. Topology optimization provides a pathway for pushing the limits of metasurface efficiency; however, topology optimization methods have been limited to the design of microscale devices due to the extensive computational resources that are required. We introduce a new strategy for optimizing large-area metasurfaces in a computationally efficient manner. By stitching together individually optimized sections of the metasurface, we can reduce the computational complexity of the optimization from high-polynomial to linear. As a proof of concept, we design and experimentally demonstrate large-area, high-numerical-aperture silicon metasurface lenses with focusing efficiencies exceeding 90%. These concepts can be generalized to the design of multifunctional, broadband diffractive optical devices and will enable the implementation of large-area, high-performance metasurfaces in practical optical systems.","authors":["Thaibao Phan","David Sell","Evan W. Wang","Sage Doshay"],"meta":["May 2019Light: Science & Applications 8(1):48","DOI:10.1038/s41377-019-0159-5"],"references":["328784727_Broadband_achromatic_dielectric_metalenses","326691620_Nano-optic_endoscope_for_high-resolution_optical_coherence_tomography_in_vivo","322652559_Outlook_for_inverse_design_in_nanophotonics","322191335_A_broadband_achromatic_metalens_for_focusing_and_imaging_in_the_visible","325633950_Imaging-based_molecular_barcoding_with_pixelated_dielectric_metasurfaces","323792072_Ultra-High-Efficiency_Anomalous_Refraction_with_Dielectric_Metasurfaces","323441613_A_Metalens_with_a_Near-Unity_Numerical_Aperture","320425438_Periodic_Dielectric_Metasurfaces_with_High-Efficiency_Multiwavelength_Functionalities","319946057_Analysis_of_material_selection_on_dielectric_metasurface_performance","319875393_Freeform_Metagratings_Based_on_Complex_Light_Scattering_Dynamics_for_Extreme_High_Efficiency_Beam_Steering"]}