{"id":"333407340_Convolutional_Neural_Network-Based_Real-Time_Object_Detection_and_Tracking_for_Parrot_AR_Drone_2","abstract":"Recent advancements in the field of Artificial Intelligence (AI) have provided opportunity to create autonomous devices, robots, and machines characterized particularly with the ability to make decisions and perform tasks without human mediation. One of these devices, Unmanned Aerial Vehicles (UAVs) or drones are widely used to perform tasks like surveillance, search and rescue, object detection and target tracking, parcel delivery (recently started by Amazon), and many more. The sensitivity in performing said tasks demands that drones must be efficient and reliable. For this, in this work, an approach to detect and track the target object, moving or still, for a drone is presented. Parrot AR Drone 2 is used for this application. Convolutional Neural Network (CNN) is used for object detection and target tracking. The object detection results show that CNN detects and classifies object with a high level of accuracy (98%). For real-time tracking, tracking algorithm responds faster than conventionally used approaches, efficiently tracking the detected object without losing it from sight. Calculated based on several iterations, the efficiency achieved for target tracking is 96.5%.","authors":["Ali Rohan","Mohamed Rabah","Sung-Ho Kim"],"meta":["May 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2919332","Project: Real-time object detection and tracking based on CNN"],"references":["331911373_Autonomous_Moving_Target-Tracking_for_a_UAV_Quadcopter_based_on_Fuzzy-PI","331134335_Advanced_Drone_Battery_Charging_System","329423087_Autonomous_Vision-based_Target_Detection_and_Safe_Landing_for_UAV","328620069_Autonomous_Vision-based_Target_Detection_and_Safe_Landing_for_UAV","326223085_UAV_based_wilt_detection_system_via_convolutional_neural_networks","326009674_Detection_of_Cattle_Using_Drones_and_Convolutional_Neural_Networks","325605814_Fuzzy_Logic-Based_Robust_and_Autonomous_Safe_Landing_for_UAV_Quadcopter","319503347_A_Study_on_Detecting_Drones_Using_Deep_Convolutional_Neural_Networks","329488196_R-fcn_Object_detection_via_region-based_fully_convolutional_networks","319926266_Low-complexity_object_detection_with_deep_convolutional_neural_network_for_embedded_systems"]}