{"id":"333408704_Identification_of_Epileptic_Seizures_by_Characterizing_Instantaneous_Energy_Behavior_of_EEG","abstract":"Automatic seizure detection has been often treated as a classification problem that aims at determining the label of electroencephalogram (EEG) signals by computer science, as EEG monitoring is a helpful adjunct to the diagnosis of epilepsy. In most existing work, the traditional signal energy of EEG has been applied for classification, since the energy pattern of epileptic seizures differs from that of nonseizures. Although they are effective, the accuracy either heavily depends on additional information besides energy or is limited by the shortcoming of energy-based features. To address this issue, the proposed approach achieves the classification based on the instantaneous energy of EEG signals instead. The proposed approach first measures the instantaneous energy related to changes in EEG signals. Then the energy behavior over time is characterized by instantaneous energy-based features from different aspects. Finally, the classification is carried out on the features to produce output labels. By processing instantaneous energy, the information of energy evolution is involved. As such, the accuracy is improved without bringing in extra information besides energy, or complicated transformation. In multi-class problems, the proposed approach has obtained promising results for identifying ictal EEG, which indicates the tremendous potential of the proposed approach for epileptic seizure detection.","authors":["Xian Zhao","Renjie Zhang","Zhenning Mei","Chen Chen"],"meta":["May 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2919158"],"references":["330147584_Detecting_Seizures_From_EEG_Signals_Using_the_Entropy_of_Visibility_Heights_of_Hierarchical_Neighbors","325418795_Bio-Signal_Complexity_Analysis_in_Epileptic_Seizure_Monitoring_A_Topic_Review","324868974_EEG_based_epileptiform_pattern_recognition_inside_and_outside_the_seizure_states","323531746_MRMR_based_feature_selection_for_the_classification_of_stress_using_EEG","318904019_A_revised_glossary_of_terms_most_commonly_used_by_clinical_electroencephalographers_and_updated_proposal_for_the_report_format_of_the_EEG_findings","318355314_Epileptic_seizure_detection_in_EEGs_signals_based_on_the_weighted_visibility_graph_entropy","326907137_Denoising_Sparse_Autoencoder_Based_Ictal_EEG_Classification","321204987_A_Novel_Multi-Class_EEG-Based_Sleep_Stage_Classification_System","319023789_Classify_Epileptic_EEG_Signals_Using_Weighted_Complex_Networks_Based_Community_Structure_Detection","318303874_Seizure_detection_from_EEG_signals_using_Multivariate_Empirical_Mode_Decomposition"]}