{"id":"333507541_Technology_Use_and_Attitudes_in_Music_Learning","abstract":"While the expansion of technologies into the music education classroom has been studied in great depth, there is a lack of published literature regarding the use of digital technologies by students learning in individual settings. Do musicians take their technology use into the practice room and teaching studio, or does the traditional nature of the master-apprentice teaching model promote different attitudes among musicians toward their use of technology in learning to perform? To investigate these issues, we developed the Technology Use and Attitudes in Music Learning Survey, which included adaptations of Davis's 1989 scales for Perceived Usefulness and Perceived Ease of Use of Technology. Data were collected from an international cohort of 338 amateur, student, and professional musicians ranging widely in age, specialism, and musical experience. Results showed a generally positive attitude toward current and future technology use among musicians and supported the Technology Acceptance Model (TAM), wherein technology use in music learning was predicted by perceived ease of use via perceived usefulness. Musicians' self-rated skills with smartphones, laptops, and desktop computers were found to extend beyond traditional audio and video recording devices, and the majority of musicians reported using classic music technologies (e.g., metronomes and tuners) on smartphones and tablets rather than bespoke devices. Despite this comfort with and access to new technology, availability reported within one-to-one lessons was half of that within practice sessions, and while a large percentage of musicians actively recorded their playing, these recordings were not frequently reviewed. Our results highlight opportunities for technology to take a greater role in improving music learning through enhanced student-teacher interaction and by facilitating self-regulated learning.","authors":["George Waddell","Aaron Williamon"],"meta":["May 2019Frontiers in ICT 6(11):1-14","DOI:10.3389/fict.2019.00011","Project: Technology Enhanced Learning of Musical Instrument Performance"],"references":["331757367_Automatic_Assessment_of_Tone_Quality_in_Violin_Music_Performance","319285634_A_multimodal_corpus_for_technology-enhanced_learning_of_violin_playing","315694728_Where's_the_Transformation_Unlocking_the_Potential_of_Technology_Enhanced_Assessment","312115559_Teachers'_Intention_to_Use_Educational_Video_Games_A_Technology_Acceptance_Model_Approach","309366394_Recordings_as_learning_and_practising_resources_for_performance_Exploring_attitudes_and_behaviours_of_music_students_and_professionals","318722955_Partial_Least_SquaresRegression_and_Structural_Equation_Models","313092238_Perceived_usefulness_ease_of_use_and_usage_of_information","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","309687241_Continuance_intention_to_use_MOOCs_Integrating_the_technology_acceptance_model_TAM_and_task_technology_fit_TTF_model","304908174_Instrumental_practice_in_the_contemporary_music_academy_A_three-phase_cycle_of_Self-Regulated_Learning_in_music_students"]}