{"id":"333593542_Seizure_Type_Classification_on_EEG_Signal_using_Support_Vector_Machine","abstract":"One instrument to record the activity of brainwave in a specific time is called Electroencephalography (EEG). EEG signal can be used to analyze the epilepsy disease. Brainwave of seizure patient has a low frequency with a tighter pattern than brainwave of normal people. We use data from Temple University Hospital Seizure Corpus (TUSZ) that represents an accurate clinical condition characterization. Based on neurologist report, several types of seizure can be found in the dataset. In this research, we classify three types of seizure, Generalized Non-Specific Seizure (GNSZ), Focal Non-Specific Seizure (FNSZ) and Tonic-Clonic Seizure (TCSZ). We added a normal EEG signal, so we have four classes to be classified using Support Vector Machine (SVM). The training dataset consists from 120 data (20 GNSZ, 50 FNSZ, 25 TCSZ and 25 Normal), while the evaluation dataset is 90 datasets (20 GNSZ, 50 FNSZ, 5 TCSZ and 15 Normal). We observe the combination of three feature extraction method, Mel Frequency Cepstral Coefficients (MFCC), Hjorth Descriptor and Independent Component Analysis (ICA). The best result obtained by combining MFCC and Hjorth descriptor that can detect seizure type with 90.25%, 97.83%, and 91.4% of average sensitivity, average specificity, and accuracy respectively.","authors":["Inggi Ramadhani Dwi Saputro","Nita Dwi Maryati","Siti Rizqia Solihati","Inung Wijayanto"],"meta":["May 2019Journal of Physics Conference Series 1201(1):012065","DOI:10.1088/1742-6596/1201/1/012065"],"references":["328980695_Multilevel_Wavelet_Packet_Entropy_and_Support_Vector_Machine_for_Epileptic_EEG_Classification","327629828_Sample_Entropy_on_Multidistance_Signal_Level_Difference_for_Epileptic_EEG_Classification","322695447_The_Temple_University_Hospital_Seizure_Detection_Corpus","317254959_Automatic_Epileptic_Seizure_Detection_in_EEG_Signals_Using_Multi-Domain_Feature_Extraction_and_Nonlinear_Analysis","314231877_Classification_of_Normal_Ictal_and_Inter-ictal_EEG_via_Direct_Quadrature_and_Random_Forest_Tree","322537718_An_Automated_System_for_Epilepsy_Detection_using_EEG_Brain_Signals_based_on_Deep_Learning_Approach","315910113_Epileptic_seizure_detection_in_EEG_signal_with_GModPCA_and_support_vector_machine","307935560_Support_vector_machines","304407657_Automated_identification_of_abnormal_adult_EEGs","287016055_A_proposed_feature_extraction_method_for_EEG-based_person_identification"]}