{"id":"333523357_Artificial_Intelligence_and_the_Implementation_Challenge_Preprint","abstract":"Background: \nApplications of artificial intelligence (AI) in health care have garnered much attention in recent years, but the implementation issues posed by AI have not been substantially addressed.\n\nObjective: \nIn this paper, we have focused on machine learning (ML) as a form of AI and have provided a framework for thinking about use cases of ML in health care. We have structured our discussion of challenges in the implementation of ML in comparison with other technologies using the framework of Nonadoption, Abandonment, and Challenges to the Scale-Up, Spread, and Sustainability of Health and Care Technologies (NASSS).\n\nMethods: \nAfter providing an overview of AI technology, we describe use cases of ML as falling into the categories of decision support and automation. We suggest these use cases apply to clinical, operational, and epidemiological tasks and that the primary function of ML in health care in the near term will be decision support. We then outline unique implementation issues posed by ML initiatives in the categories addressed by the NASSS framework, specifically including meaningful decision support, explainability, privacy, consent, algorithmic bias, security, scalability, the role of corporations, and the changing nature of health care work.\n\nResults: \nUltimately, we suggest that the future of ML in health care remains positive but uncertain, as support from patients, the public, and a wide range of health care stakeholders is necessary to enable its meaningful implementation.\n\nConclusions: \nIf the implementation science community is to facilitate the adoption of ML in ways that stand to generate widespread benefits, the issues raised in this paper will require substantial attention in the coming years.","authors":["James Shaw","Frank Rudzicz","Trevor Jamieson","Avi Goldfarb"],"meta":["February 2019Journal of Medical Internet Research 21(7)","DOI:10.2196/13659"],"references":["328773479_Machine_learning_in_medicine_Addressing_ethical_challenges","327777850_Beyond_implementation_digital_health_innovation_and_service_design","327291183_Artificial_Intelligence_in_Public_Health_and_Epidemiology","332617196_The_Regulatory_Challenge_of_Mobile_Health_Lessons_for_Canada","331536741_Normal_Accidents_Living_with_High_Risk_Technologies_-_Updated_Edition","330052041_Economic_Policy_for_Artificial_Intelligence","328133753_Framing_the_challenges_of_artificial_intelligence_in_medicine","327407622_On_the_Prospects_for_a_Deep_Learning_Health_Care_System","325890224_Health_Data_and_Privacy_in_the_Digital_Era","325003693_2_How_Actors_Change_Institutions_Towards_a_Theory_of_Institutional_Entrepreneurship"]}