{"id":"333586383_Resynthesizing_behavior_through_phylogenetic_refinement","abstract":"This article proposes that biologically plausible theories of behavior can be constructed by following a method of “phylogenetic refinement,” whereby they are progressively elaborated from simple to complex according to phylogenetic data on the sequence of changes that occurred over the course of evolution. It is argued that sufficient data exist to make this approach possible, and that the result can more effectively delineate the true biological categories of neurophysiological mechanisms than do approaches based on definitions of putative functions inherited from psychological traditions. As an example, the approach is used to sketch a theoretical framework of how basic feedback control of interaction with the world was elaborated during vertebrate evolution, to give rise to the functional architecture of the mammalian brain. The results provide a conceptual taxonomy of mechanisms that naturally map to neurophysiological and neuroanatomical data and that offer a context for defining putative functions that, it is argued, are better grounded in biology than are some of the traditional concepts of cognitive science.","authors":["Paul Cisek"],"meta":["June 2019Attention Perception & Psychophysics 81(Supp. 1)","DOI:10.3758/s13414-019-01760-1"],"references":["335667994_No_one_knows_what_attention_is","326958417_Economic_Choice_as_an_Untangling_of_Options_into_Actions","325017687_Desirability_availability_credit_assignment_category_learning_and_attention_Cognitive-emotional_and_working_memory_dynamics_of_orbitofrontal_ventrolateral_and_dorsolateral_prefrontal_cortices","323266766_Amphioxus_motion_detection_and_the_evolutionary_origin_of_the_vertebrate_retinotectal_map","346431487_The_Neurobiology_of_the_Prefrontal_Cortex_Anatomy_Evolution_and_the_Origin_of_Insight","332089384_Being_There_Putting_Brain_Body_and_World_Together_Again","330866772_Is_coding_a_relevant_metaphor_for_the_brain","329650362_Radical_Embodied_Cognitive_Science","324352933_The_Ecological_Approach_to_Visual_Perception","324036882_Amphioxus_neurocircuits_enhanced_arousal_and_the_origin_of_vertebrate_consciousness"]}