{"id":"333504670_Assessing_Alexander's_Later_Contributions_to_a_Science_of_Cities","abstract":"Christopher Alexander published his longest and arguably most philosophical work, The Nature of Order, beginning in 2003. Early criticism assessed that text to be a speculative failure; at best, unrelated to Alexander’s earlier, mathematically grounded work. On the contrary, this review presents evidence that the newer work was a logically consistent culmination of a lifelong and remarkably useful inquiry into part-whole relations—an ancient but still-relevant and even urgent topic of design, architecture, urbanism, and science. Further evidence demonstrates that Alexander’s practical contributions are remarkably prodigious beyond architecture, in fields as diverse as computer science, biology and organization theory, and that these contributions continue today. This review assesses the potential for more particular contributions to the urban professions from the later work, and specifically, to an emerging “science of cities.” It examines the practical, as well as philosophical contributions of Alexander’s proposed tools and methodologies for the design process, considering both their quantitative and qualitative aspects, and their potential compatibility with other tools and strategies now emerging from the science of cities. Finally, it highlights Alexander’s challenge to an architecture profession that seems increasingly isolated, mired in abstraction, and incapable of effectively responding to larger technological and philosophical challenges.","authors":["Michael Mehaffy"],"meta":["May 2019Urban Science 3(2):59","DOI:10.3390/urbansci3020059"],"references":["311425838_The_Complexity_of_Cities_and_the_Problem_of_Urban_Design","307746242_Urban_Form_and_Greenhouse_Gas_Emissions_Findings_Strategies_and_Design_Decision_Support_Technologies","296396310_A_Complex-Network_Perspective_on_Alexander's_Wholeness","344508975_The_Institutions_of_Meaning_A_Defense_of_Anthropological_Holism","313203353_The_architecture_of_complexity","313073785_The_architecture_of_complexity","305553916_The_Death_and_Life_of_Great_American_Cities","303131868_A_city_is_not_a_tree","292481220_Aesthetics_and_Evolutionary_Psychology","286603910_Understanding_complexity_through_pattern_languages_in_biological_and_man-made_architectures_Comparisons_between_biological_and_architectonic_patterns"]}