{"id":"333561358_A_dimensao_simbolica_como_perspectiva_heuristica_possibilidades_do_uso_do_imaginario_em_investigacoes_sobre_o_fenomeno_infocomunicacional","abstract":"Resumo: A busca pela compreensão do fenômeno infocomunicacional tem sido objeto de disciplinas e ciências diversas e complementares, fato determinado pelas características inter e transdisciplinar envolvidas nesta iniciativa. No campo da Ciência da Informação várias têm sido as abordagens utilizadas nesse intento que tem as razões para sua multiplicidade alicerçadas nos mais diferenciados temas de pesquisa desenvolvidos na área. Uma das possibilidades de investigação que vem se consolidando nesta perspectiva, desenvolvida na Universidade Federal de Minas Gerais, contempla a utilização do imaginário como estratégia para se compreender os aspectos intrínsecos aos comportamentos humanos no trato com a informação. Neste sentido, o presente trabalho pretende destacar como essa abordagem pode se apresentar como uma vertente investigativa a ser inserida nos percursos metodológicos contemporâneos na Ciência da Informação. Destaca, em especial, a utilização das Estruturas Antropológicas do Imaginário e sua aplicação empírica intitulada l'Archétype-Test à 9 éléments (AT.9), respectivamente, como fundamentação teórica e técnica de pesquisa que possibilitam uma abordagem não usual nos processos de investigação que buscam compreender a relação entre o indivíduo e a informação. Considera-se que a característica conectiva do imaginário permite identificar, dentre outros, as sensibilidades míticas que dominam uma sociedade, visto que o mundo humano é um mundo de percepções, e que o indivíduo se relaciona com ele por meio de significados dados pela cultura. Desta forma, o imaginário corresponde ao fundamento sobre o qual se constroem todas as concepções de homem, de mundo e da sociedade e que permite compreender o dinamismo que regula a vida social e suas manifestações informacionais e culturais. Concluiu-se que a perspectiva simbólica permite ampliar as possibilidades de compreensão dos processos informativos ao utilizar o imaginário como perspectiva heurística e ao se valer de uma dimensão analítica ligada aos elementos que atuam em nível mais profundo no inconsciente que, para serem verificados, implicam o uso de técnicas e dimensões específicas de analise que contemplem as dimensões social, experiencial e contingencial. Palavras-Chave: Informação. Comunicação. Estruturas Antropológicas do Imaginário. Dimensões Simbólicas. Fenômeno Infocomunicacional INTRODUÇÃO O desenvolvimento da Ciência da Informação (CI), enquanto ciência, reflete o desenvolvimento da própria sociedade. Essa percepção remete às palavras de Boaventura Santos (2006) para quem todo conhecimento científico é socialmente construído, condição","authors":["Eliane Pawlowski Oliveira Araujo"],"meta":["October 2018","Conference: XI Encuentro de la Asociación de Educación e Investigación en Ciencia de la Información de Iberoamérica y el CaribeAt: Medellin, Colômbia","Project: Gabinete de Estudos da Informação e do Imaginário"],"references":["274350106_Lideranca_a_administracao_do_sentido","250032245_Uma_analise_das_duas_revolucoes_cognitivas","240973632_Ciencia_da_informacao_tematica_historias_e_fundamentos","30864982_Estudo_de_usuarios_visao_global_dos_metodos_de_coleta_de_dados","277091987_Mitanalise_e_interdisciplinaridade_subsidios_para_uma_hermeneutica_em_educacao_e_em_ciencias_sociais","267682753_Um_Discurso_sobre_as_Ciencias","267027064_Psychodynamic_perspectives_in_information_behaviour","220195805_The_Dark_Side_of_Information_Overload_Anxiety_and_Other_Paradoxes_and_Pathologies","37651716_Para_uma_mitanalise_da_fundacao_sagrada_do_reino_de_Portugal_em_Ourique"]}