{"id":"333506531_Ensemble_of_Convolutional_Neural_Networks_Improves_Automated_Segmentation_of_Acute_Ischemic_Lesions_Using_Multiparametric_Diffusion-Weighted_MRI","abstract":"Background and purpose: \nAccurate automated infarct segmentation is needed for acute ischemic stroke studies relying on infarct volumes as an imaging phenotype or biomarker that require large numbers of subjects. This study investigated whether an ensemble of convolutional neural networks trained on multiparametric DWI maps outperforms single networks trained on solo DWI parametric maps.\n\nMaterials and methods: \nConvolutional neural networks were trained on combinations of DWI, ADC, and low b-value-weighted images from 116 subjects. The performances of the networks (measured by the Dice score, sensitivity, and precision) were compared with one another and with ensembles of 5 networks. To assess the generalizability of the approach, we applied the best-performing model to an independent Evaluation Cohort of 151 subjects. Agreement between manual and automated segmentations for identifying patients with large lesion volumes was calculated across multiple thresholds (21, 31, 51, and 70 cm3).\n\nResults: \nAn ensemble of convolutional neural networks trained on DWI, ADC, and low b-value-weighted images produced the most accurate acute infarct segmentation over individual networks (P < .001). Automated volumes correlated with manually measured volumes (Spearman ρ = 0.91, P < .001) for the independent cohort. For the task of identifying patients with large lesion volumes, agreement between manual outlines and automated outlines was high (Cohen κ, 0.86-0.90; P < .001).\n\nConclusions: \nAcute infarcts are more accurately segmented using ensembles of convolutional neural networks trained with multiparametric maps than by using a single model trained with a solo map. Automated lesion segmentation has high agreement with manual techniques for identifying patients with large lesion volumes.","authors":["S. Winzeck","S.J.T. Mocking","R. Bezerra","Mark J R J Bouts"],"meta":["May 2019American Journal of Neuroradiology 40(6)","DOI:10.3174/ajnr.A6077"],"references":["322699794_Thrombectomy_for_Stroke_at_6_to_16_Hours_with_Selection_by_Perfusion_Imaging","317582264_Fully_Automatic_Acute_Ischemic_Lesion_Segmentation_in_DWI_Using_Convolutional_Neural_Networks","312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","305628326_ISLES_2015_-_A_public_evaluation_benchmark_for_ischemic_stroke_lesion_segmentation_from_multispectral_MRI","301878860_Efficient_Multi-Scale_3D_CNN_with_fully_connected_CRF_for_Accurate_Brain_Lesion_Segmentation","353147000_Abstract_3319_Prediction_Of_Lesion_Expansion_In_Stroke_Patients_Using_Acute_MRI","327370205_Ensembles_of_Multiple_Models_and_Architectures_for_Robust_Brain_Tumour_Segmentation","324734000_Intravenous_thrombolysis_in_unwitnessed_stroke_onset_MR_WITNESS_trial_results","324118275_Automatic_Segmentation_of_Acute_Ischemic_Stroke_From_DWI_Using_3-D_Fully_Convolutional_DenseNets","321014377_Thrombectomy_6_to_24_Hours_after_Stroke_with_a_Mismatch_between_Deficit_and_Infarct"]}