{"id":"333519652_Normalized_shaping_regularization_for_robust_separation_of_blended_data","abstract":"Simultaneous source acquisition has attracted more and more attention from geophysicists because of its economic saving, while it also brings some challenges that have never been addressed before. Deblending of simultaneous source data is usually considered as an under-determined inverse problem, which can be effectively solved with a least-squares (LS) iterative procedure between data consistency (ℓ 2 -norm) and regularization (ℓ 0 -norm or ℓ 1 - norm). However, when it comes to abnormal noise that follows non-Gaussian distribution and possesses high-amplitude feature (e.g., erratic noise, swell noise, and power line noise), the ℓ 2 -norm is a non-robust statistic that can easily lead to sub-optimal deblended results. Although abnormal noise can be attenuated in the common source domain at first, it is still challenging to apply a coherency-based filter due to the sparse receiver or crossline sampling, e.g., commonly found in the OBN acquisition. To address this problem, we propose a normalized shaping regularization to make the inversion-based deblending approach robust for the separation of blended data when abnormal noise exists. Its robustness comes from the normalized shaping operator defined by the confidence interval of normal distribution, which minimizes the abnormal risk into normal level to satisfy the assumption of LS shaping regularization. In special case, the proposed approach will revert to the classical LS shaping regularization once the normalized coefficient is large enough. Experimental results on both synthetic and field data show that the proposed method can effectively restore the separated records from blended data at essentially the same convergence rate as the LS shaping regularization for abnormal noise-free scenario, but obtain better deblending performance and less energy leakage when abnormal noise exists.","authors":["Qiang Zhao","Qizhen Du","Xufei Gong","Xiangyang Li"],"meta":["May 2019Geophysics 84(5):1-87","DOI:10.1190/geo2018-0557.1","Project: Simultaneous source acquisition"],"references":["324264867_Signal-Preserving_Erratic_Noise_Attenuation_via_Iterative_Robust_Sparsity-Promoting_Filter","323422416_3D_deblending_of_simultaneous_source_data_based_on_3D_multi-scale_shaping_operator","319433893_Iterative_deblending_of_simultaneous-source_data_using_a_coherency-pass_shaping_operator","316522385_Shot-domain_deblending_using_least-squares_inversion","314108505_Preserving_the_discontinuities_in_least-squares_reverse_time_migration_of_simultaneous-source_data","300118477_Separating_Simultaneous_Sources_by_Inversion","300118395_Designing_Simultaneous_Acquisitions_with_Compressive_Sensing","300039110_A_periodically_varying_code_for_improving_deblending_of_simultaneous_sources_in_marine_acquisition","293143148_A_Survey_of_Sampling_from_Contaminated_Distributions_In_Contributions_to_Probability_and_Statistics","283571070_Seismic_imaging_of_incomplete_data_and_simultaneous-source_data_using_least-squares_reverse_time_migration_with_shaping_regularization"]}