{"id":"333533125_Effective_degrees_of_freedom_of_the_Pearson's_correlation_coefficient_under_autocorrelation","abstract":"The dependence between pairs of time series is commonly quantified by Pearson's correlation. However, if the time series are themselves dependent (i.e. exhibit temporal autocorrelation), the effective degrees of freedom (EDF) are reduced, the standard error of the sample correlation coefficient is biased, and Fisher's transformation fails to stabilise the variance. Since fMRI time series are notoriously autocorrelated, the issue of biased standard errors - before or after Fisher's transformation - becomes vital in individual-level analysis of resting-state functional connectivity (rsFC) and must be addressed anytime a standardised Z-score is computed. We find that the severity of autocorrelation is highly dependent on spatial characteristics of brain regions, such as the size of regions of interest and the spatial location of those regions. We further show that the available EDF estimators make restrictive assumptions that are not supported by the data, resulting in biased rsFC inferences that lead to distorted topological descriptions of the connectome on the individual level. We propose a practical \"xDF\" method that accounts not only for distinct autocorrelation in each time series, but instantaneous and lagged cross-correlation. We find the xDF correction varies substantially over node pairs, indicating the limitations of global EDF corrections used previously. In addition to extensive synthetic and real data validations, we investigate the impact of this correction on rsFC measures in data from the Young Adult Human Connectome Project, showing that accounting for autocorrelation dramatically changes fundamental graph theoretical measures relative to no correction.","authors":["Soroosh Afyouni","Stephen M. Smith","Thomas Nichols"],"meta":["May 2019NeuroImage 199","DOI:10.1016/j.neuroimage.2019.05.011"],"references":["322285303_Thresholding_functional_connectomes_by_means_of_mixture_modeling","321940311_Probabilistic_thresholding_of_functional_connectomes_Application_to_schizophrenia","317284104_Serial_Correlations_in_Single-Subject_fMRI_with_Sub-Second_TR","313358296_Proportional_thresholding_in_resting-state_fMRI_functional_connectivity_networks_and_consequences_for_patient-control_connectome_studies_Issues_and_recommendations","324620306_The_Analysis_of_Time_Series_An_Introduction","322091966_Corrigendum_to_Resting-state_fMRI_correlations_From_link-wise_unreliability_to_whole_brain_stability_NeuroImage_157_2017_Aug_15_250-262","317533460_Resting-state_fMRI_correlations_From_link-wise_unreliability_to_whole_brain_stability","316733727_Linking_graph_features_of_anatomical_architecture_to_regional_brain_activity_A_multi-modal_MRI_study","316021474_Structural_connectome_topology_relates_to_regional_BOLD_signal_dynamics_in_the_mouse_brain","312876804_A_variance_components_model_for_statistical_inference_on_functional_connectivity_networks"]}