{"id":"333595093_Application_of_Deep_Learning_in_Neuroradiology_Brain_Haemorrhage_Classification_Using_Transfer_Learning","abstract":"In this paper, we address the problem of identifying brain haemorrhage which is considered as a tedious task for radiologists, especially in the early stages of the haemorrhage. The problem is solved using a deep learning approach where a convolutional neural network (CNN), the well-known AlexNet neural network, and also a modified novel version of AlexNet with support vector machine (AlexNet-SVM) classifier are trained to classify the brain computer tomography (CT) images into haemorrhage or nonhaemorrhage images. The aim of employing the deep learning model is to address the primary question in medical image analysis and classification: can a sufficient fine-tuning of a pretrained model (transfer learning) eliminate the need of building a CNN from scratch? Moreover, this study also aims to investigate the advantages of using SVM as a classifier instead of a three-layer neural network. We apply the same classification task to three deep networks; one is created from scratch, another is a pretrained model that was fine-tuned to the brain CT haemorrhage classification task, and our modified novel AlexNet model which uses the SVM classifier. The three networks were trained using the same number of brain CT images available. The experiments show that the transfer of knowledge from natural images to medical images classification is possible. In addition, our results proved that the proposed modified pretrained model “AlexNet-SVM” can outperform a convolutional neural network created from scratch and the original AlexNet in identifying the brain haemorrhage.","authors":["Muhammad Awwal Dawud","Kamil Yurtkan","Huseyin Oztoprak"],"meta":["June 2019Computational Intelligence and Neuroscience 2019(6):1-12","DOI:10.1155/2019/4629859","Project: Deep Learning"],"references":["332179653_Head_mouse_control_system_for_people_with_disabilities","326762237_Deep_Convolutional_Neural_Networks_for_Chest_Diseases_Detection","318849636_Segmentation_of_Glioma_Tumors_in_Brain_Using_Deep_Convolutional_Neural_Network","327455026_Transferable_Representation_Learning_with_Deep_Adaptation_Networks","326381500_Deep_networks_in_identifying_CT_brain_hemorrhage","323189740_A_Deeply_Supervised_Residual_Network_for_HEp-2_Cell_Classification_via_Cross-Modal_Transfer_Learning","322669210_A_simple_and_practical_review_of_over-fitting_in_neural_network_learning","320344947_Application_of_Deep_Learning_in_Neuroradiology_Automated_Detection_of_Basal_Ganglia_Hemorrhage_using_2D-Convolutional_Neural_Networks","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}