{"id":"333675944_La_modalidad_mixta_un_estudio_sobre_los_significados_de_los_estudiantes_universitarios","abstract":"Resumen \nEn las instituciones de educación superior de México se han efectua-do algunas acciones específicas para habilitar y diversificar los usos de las tiC con diferentes estrategias, como las de ofertar cursos en modalidades no convencionales. En esta investigación de tipo mix-to se analizan resultados cuantitativos y cualitativos, estos últimos con el método del interaccionismo simbólico. El objetivo fue obte-ner la percepción y los significados del estudiante respecto de la modalidad mixta (blended learning o b-learning). Se utilizaron una entrevista semiestructurada y un grupo focal en el que participa-ron 23 estudiantes; también se aplicó un cuestionario a 162 alumnos universitarios. Los resultados muestran que los estudiantes valoran positivamente los cursos mixtos y sugieren mejoras en la planeación de actividades, la comunicación y la retroalimentación del docente. Como conclusión, la habilidad de la administración del tiempo se beneficia de estos cursos y el trabajo en equipo no es favorable, por falta de compromiso del estudiante. Para el profesor, es prioritario capacitarse en el diseño y la producción de materiales digitales inte-ractivos, así como en el desarrollo de habilidades de comunicación, tutoría y asesoría. \n\nAbstract\nIn higher education institutions in Mexico, specific actions have been taken to enable and diversify the uses of itC with different strategies, such as offering courses through non-conventional methods. In this combined research, quantitative and qualitative results are analyzed; the qualitative results are analyzed using the symbolic interactionism method. The objective was to acquire the perception and the meanings of students with regards to blended learning (or b-learning). A semi structured interview and a focal group in which 23 students participated were used, as well as a survey applied to 162 university students. The results showed that the students positively evaluated the blended learning courses, and suggested improvements in the planning of activities, communication Recibido: 05/05/2015 Aceptado: 23/06/2015","authors":["Xicoténcatl Martínez Ruiz","Sonia Verónica Mortis-Lozoya","Agustin Manig","Imelda García"],"meta":["May 2015","Project: Revista Innovación Educativa No. 68 La educación virtual y el problema ético · Virtual education and the ethical problem"],"references":["262515202_Implementacion_de_un_aula_virtual_bajo_la_modalidad_mixta_The_case_of_Agricultural_Chemistry_at_the_Universidad_Nacional_de_Salta","236341838_Contexto_y_desarrollo_de_la_modalidad_educativa_Blended_learning_en_el_sistema_universitario_iberoamericano","235794287_De_la_educacion_a_distancia_a_la_educacion_virtual","220374869_A_Study_of_Student's_Perceptions_in_a_Blended_Learning_Environment_Based_on_Different_Learning_Styles","220374148_Examining_the_Roles_of_Blended_Learning_Approaches_in_Computer-_Supported_Collaborative_Learning_CSCL_Environments_A_Delphi_Study","47276458_Percepciones_del_alumnado_sobre_el_blended_learning_en_la_universidad","43531219_Aprendizaje_interactivo_en_la_educacion_superior_a_traves_de_sitios_web_Un_estudio_empirico","28242971_Complementariedad_en_las_modalidades_educativas_presencial_y_a_distancia","28220648_Entornos_de_aprendizaje_mixto_en_Educacion_Superior","26473486_Percepciones_del_aprendizaje_en_contextos_presenciales_y_virtuales_La_perspectiva_de_alumnos_universitarios","332927556_Redefinicion_del_rol_de_aprendizaje_del_profesor_en_propuestas_de_aprendizaje_mixto_o_be-learning_Un_caso","292225787_Blended-learning_implementation_in_undergraduate_teacher's_formation_courses_Difficulties_from_the_students'_point_of_view","256413433_Towards_an_enhanced_learning_management_system_for_blended_learning_in_higher_education_incorporating_distinct_learners'_profiles","251876158_Percepcion_de_los_Estudiantes_acerca_de_la_Implementacion_de_la_Modalidad_Educativa_Blended-Learning_en_la_Educacion_Superior","228977994_Blended_Teaching_and_Learning","220374485_Assessing_the_Acceptance_of_a_Blended_Learning_University_Course","49553100_El_interaccionismo_simbolico"]}