{"id":"333648003_RecencyMiner_mining_recency-based_personalized_behavior_from_contextual_smartphone_data","abstract":"Due to the advanced features in recent smartphones and context-awareness in mobile\ntechnologies, users’ diverse behavioral activities with their phones and associated contexts are recorded through the device logs. Behavioral patterns of smartphone users\nmay vary greatly between individuals in different contexts—for example, temporal,\nspatial, or social contexts. However, an individual’s phone usage behavior may not be\nstatic in the real-world changing over time. The volatility of usage behavior will also\nvary from user-to-user. Thus, an individual’s recent behavioral patterns and corresponding\nmachine learning rules are more likely to be interesting and significant than older\nones for modeling and predicting their phone usage behavior. Based on this concept\nof recency, in this paper, we present an approach for mining recency-based personalized\nbehavior, and name it “RecencyMiner” for short, utilizing individual’s contextual smartphone data, in order to build a context-aware personalized behavior prediction model. The effectiveness of RecencyMiner is examined by considering individual smartphone user’s real-life contextual datasets. The experimental results show that our proposed recency-based approach better predicts individual’s phone usage behavior than existing baseline models, by minimizing the error rate in various context-aware test cases.","authors":["Iqbal H. Sarker","Alan W. Colman","Jun Han"],"meta":["June 2019Journal of Big Data 6(1)","DOI:10.1186/s40537-019-0211-6","Projects: Context-Aware Rule Learning for Intelligent SystemsData Science and Machine Learning"],"references":["328795416_Mobile_Data_Science_Towards_Understanding_Data-Driven_Intelligent_Mobile_Applications","328247357_Understanding_the_Role_of_Data-Centric_Social_Context_in_Personalized_Mobile_Applications","325839920_Mining_User_Behavioral_Rules_from_Smartphone_Data_Through_Association_Analysis","324218915_Mining_User_Behavioral_Rules_from_Smartphone_Data_through_Association_Analysis","320518638_Identifying_Recent_Behavioral_Data_Length_in_Mobile_Phone_Log","319182986_Individualized_Time-Series_Segmentation_for_Mining_Mobile_Phone_User_Behavior","319182960_Understanding_Recency-Based_Behavior_Model_for_Individual_Mobile_Phone_Users","330905211_A_Machine_Learning_based_Robust_Prediction_Model_for_Real-life_Mobile_Phone_Data","319393723_Fast_algorithms_for_mining_association_rules","313745985_A_general_incremental_technique_for_maintaining_discovered_association_rules"]}