{"id":"333677700_Machine_learning_for_email_spam_filtering_review_approaches_and_open_research_problems","abstract":"The upsurge in the volume of unwanted emails called spam has created an intense need for the development of more dependable and robust antispam filters. Machine learning methods of recent are being used to successfully detect and filter spam emails. We present a systematic review of some of the popular machine learning based email spam filtering approaches. Our review covers survey of the important concepts, attempts, efficiency, and the research trend in spam filtering. The preliminary discussion in the study background examines the applications of machine learning techniques to the email spam filtering process of the leading internet service providers (ISPs) like Gmail, Yahoo and Outlook emails spam filters. Discussion on general email spam filtering process, and the various efforts by different researchers in combating spam through the use machine learning techniques was done. Our review compares the strengths and drawbacks of existing machine learning approaches and the open research problems in spam filtering. We recommended deep leaning and deep adversarial learning as the future techniques that can effectively handle the menace of spam emails.","authors":["Emmanuel Gbenga Dada","Stephen Bassi Joseph","Haruna Chiroma","Shafi’i Muhammad Abdulhamid"],"meta":["June 2019Heliyon 5(6):1-23","DOI:10.1016/j.heliyon.2019.e01802"],"references":["333105506_A_Data_Mining_Approach_on_Various_Classifiers_in_Email_Spam_Filtering","330373326_Adversarial_Examples_Attacks_and_Defenses_for_Deep_Learning","322800395_PdPSO_The_fusion_of_primal-dual_interior_point_method_and_Particle_Swarm_Optimization_algorithm","321324502_Towards_Accurate_Deceptive_Opinion_Spam_Detection_based_on_Word_Order-preserving_CNN","319114471_Analysis_of_Naive_Bayes_Algorithm_for_Email_Spam_Filtering_across_Multiple_Datasets","317934321_A_Framework_for_Designing_the_Architectures_of_Deep_Convolutional_Neural_Networks","317380110_Multi-population_Firefly_Algorithm","316075352_Efficient_Support_Vector_Machines_for_Spam_Detection_A_Survey","346993408_Spam_Filtering_using_Support_Vector_Machine","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond"]}