{"id":"333644961_Temporal_betweenness_centrality_in_dynamic_graphs","abstract":"Measures of centrality of vertices in a network are usually defined solely on the basis of the network structure. In highly dynamic networks, where vertices appear and disappear and their connectivity constantly changes, we need to redefine our measures of centrality to properly capture the temporal dimension of the network structure evolution, as well as the dynamic processes over the network. Betweenness centrality (BC), one of the most studied measures, defines the importance of a vertex as a mediator between available communication paths. BC value of a node is expressed as the fraction of the shortest paths passing through this node. In other words, given the context that information flow follows the shortest paths, a node with higher BC potentially has greater influence on the information flow in the network. In temporal dynamic graphs, a communication path should be seen as a path both in space (i.e., the network structure) and in time (i.e., the network evolution). Toward this goal, in this paper we propose the bi-objective notion of shortest–fastest path (SFP) in temporal graphs, which considers both space and time as a linear combination governed by a parameter. Based on this notion, we then define a novel temporal betweenness centrality (TBC) metric, which is highly sensitive to the observation interval and the importance of space and time distances of the vertices, that can provide better understanding of the communication mediators in temporal networks. We devise efficient algorithms for exactly computing all-pairs SFPs and the corresponding BC values both in a single graph window and sliding graph windows. We also present a distributed implementation of our approach on Apache Spark which shows great solution effectiveness and efficiency. We provide a thorough experimentation on a large variety of datasets. An application to the analysis of information propagation proves that our notion of TBC outperforms static BC in the task of identifying the best vertices for propagating information.","authors":["Ioanna Tsalouchidou","Ricardo Baeza-Yates","Francesco Bonchi","Kewen Liao"],"meta":["April 2020International Journal of Data Science and Analytics 9(2):1-16","DOI:10.1007/s41060-019-00189-x"],"references":["320463641_Parallel_Algorithm_for_Incremental_Betweenness_Centrality_on_Large_Graphs","318424435_Computation_and_analysis_of_temporal_betweenness_in_a_knowledge_mobilization_network","317353768_A_Benchmark_for_Betweenness_Centrality_Approximation_Algorithms_on_Large_Graphs","316538974_Faster_Betweenness_Centrality_Updates_in_Evolving_Networks","326567790_ABRA_Approximating_Betweenness_Centrality_in_Static_and_Dynamic_Graphs_with_Rademacher_Averages","319595392_Parallel_Algorithm_for_Single-Source_Earliest-Arrival_Problem_in_Temporal_Graphs","313795370_Modeling_and_Analysis_of_Spatiotemporal_Social_Networks","313264273_Motifs_in_Temporal_Networks","311969480_Motifs_in_Temporal_Networks","310825069_ABRA_Approximating_Betweenness_Centrality_in_Static_and_Dynamic_Graphs_with_Rademacher_Averages","307946052_Scalable_computational_techniques_for_centrality_metrics_on_temporally_detailed_social_network","306927489_Evolving_Centralities_in_Temporal_Graphs_A_Twitter_Network_Analysis","305670190_Efficient_Algorithms_for_Temporal_Path_Computation","305268072_Fully_dynamic_betweenness_centrality_maintenance_on_Massive_Networks","300217881_Fully_Dynamic_Betweenness_Centrality"]}