{"id":"333687016_Deep_Learning_for_NLP_and_Speech_Recognition","abstract":"With the widespread adoption of deep learning, natural language processing (NLP),and speech applications in many areas (including Finance, Healthcare, and Government) there is a growing need for one comprehensive resource that maps deep learning techniques to NLP and speech and provides insights into using the tools and libraries for real-world applications. Deep Learning for NLP and Speech Recognition explains recent deep learning methods applicable to NLP and speech, provides state-of-the-art approaches, and offers real-world case studies with code to provide hands-on experience.\n\nThe book is organized into three parts, aligning to different groups of readers and their expertise. The three parts are:\nMachine Learning, NLP, and Speech Introduction\nThe first part has three chapters that introduce readers to the fields of NLP, speech recognition, deep learning and machine learning with basic theory and hands-on case studies using Python-based tools and libraries.\nDeep Learning Basics\nThe five chapters in the second part introduce deep learning and various topics that are crucial for speech and text processing, including word embeddings, convolutional neural networks, recurrent neural networks and speech recognition basics. Theory, practical tips, state-of-the-art methods, experimentations and analysis in using the methods discussed in theory on real-world tasks.\nAdvanced Deep Learning Techniques for Text and Speech\nThe third part has five chapters that discuss the latest and cutting-edge research in the areas of deep learning that intersect with NLP and speech. Topics including attention mechanisms, memory augmented networks, transfer learning, multi-task learning, domain adaptation, reinforcement learning, and end-to-end deep learning for speech recognition are covered using case studies.","authors":["Uday Kamath","John Liu","James Whitaker"],"meta":["January 2019","DOI:10.1007/978-3-030-14596-5","ISBN: 978-3-030-14595-8"],"references":[]}