{"id":"333682397_Efficient_Simulation_of_Levy-driven_Point_Processes","abstract":"In this paper, we introduce a new large family of Lévy-driven point processes with (and without) contagion, by generalising the classical self-exciting Hawkes process and doubly stochastic Poisson processes with non-Gaussian Lévy-driven Ornstein-Uhlenbeck type intensities. The resulting framework may possess many desirable features such as skewness, leptokurtosis, mean-reverting dynamics, and more importantly, the \"contagion\" or feedback effects , which could be very useful for modelling event arrivals in finance, economics, insurance and many other fields. We characterise the distributional properties of this new class of point processes and develop an efficient sampling method for generating sample paths exactly. Our simulation scheme is mainly based on the distributional decomposition of the point process and its intensity process. Extensive numerical implementations and tests are reported to demonstrate the accuracy and effectiveness of our scheme. Moreover, we apply to portfolio risk management as an example to show the applicability and flexibility of our algorithms.","authors":["Yan Qu","Angelos Dassios","Hongbiao Zhao"],"meta":["December 2019Advances in Applied Probability 51(4)","DOI:10.1017/apr.2019.44","Project: Efficient Simulation in Financial Engineering and Actuarial Science"],"references":["335079172_Exact_Simulation_of_Gamma-driven_Ornstein-Uhlenbeck_Processes_with_Finite_and_Infinite_Activity_Jumps","322910260_Exact_Simulation_for_a_Class_of_Tempered_Stable_and_Related_Distributions","313727065_Empirical_properties_of_asset_returns_Stylized_facts_and_statistical_issues","332640422_A_Comparative_Anatomy_of_Credit_Risk_Models","325025074_Exploring_the_Sources_of_Default_Clustering","318073459_Exact_simulation_of_the_SABR_model","317617654_A_Risk-Factor_Model_Foundation_for_Ratings-Based_Bank_Capital_Rules","316987450_Information_Choice_and_Amplification_of_Financial_Crises","316342918_Efficient_Simulation_of_Clustering_Jumps_with_CIR_Intensity","314908867_Detecting_Jumps_from_Levy_Jump_Diffusion_Processes"]}