{"id":"333636133_A_Review_of_Geometry_Construction_and_Modelling_for_Carbon_Nanotori","abstract":"After the discovery of circular formations of single walled carbon nanotubes called fullerene crop circles, their structure has become one of the most researched amongst carbon nanostructures due to their particular interesting physical properties. Several experiments and simulations have been conducted to understand these intriguing objects, including their formation and their hidden characteristics. It is scientifically conceivable that these crop circles, nowadays referred to as carbon nanotori, can be formed by experimentally bending carbon nanotubes into ring shaped structures or by connecting several sections of carbon nanotubes. Toroidal carbon nanotubes are likely to have many applications, especially in electricity and magnetism. In this review, geometry, construction, modelling and possible applications are discussed and the existing known analytical expressions, as obtained from the Lennard-Jones potential and the continuum approximation, for their interaction energies with other nanostructures are summarised.","authors":["Pakhapoom Sarapat","James M Hill","Duangkamon Baowan"],"meta":["June 2019Applied Sciences 9(11):2301","DOI:10.3390/app9112301"],"references":["325356363_Interaction_energy_for_a_fullerene_encapsulated_in_a_carbon_nanotorus","331359953_Mechanics_of_atoms_interacting_with_a_carbon_nanotorus_optimal_configuration_and_oscillation_behaviour","329716720_Optimal_configurations_for_interacting_carbon_nanotori","325162875_Equilibrium_location_for_spherical_DNA_and_toroidal_cyclodextrin","313384601_Modelling_and_mechanics_of_carbon-based_nanostructured_materials","301288056_Structure_Properties_Functionalization_and_Applications_of_Carbon_Nanohorns","290054603_Structural_and_electronic_properties_of_a_carbon_nanotorus_Effects_of_delocalized_and_localized_deformations","287333449_Cohesion","284044984_Helical_Microtubules_of_Graphitic_Carbon","282729948_Applications_of_Graphene_and_Graphene-Oxide_based_Nanomaterials"]}