{"id":"333642405_Simplicial_models_of_social_contagion","abstract":"Complex networks have been successfully used to describe the spread of diseases in populations of interacting individuals. Conversely, pairwise interactions are often not enough to characterize social contagion processes such as opinion formation or the adoption of novelties, where complex mechanisms of influence and reinforcement are at work. Here we introduce a higher-order model of social contagion in which a social system is represented by a simplicial complex and contagion can occur through interactions in groups of different sizes. Numerical simulations of the model on both empirical and synthetic simplicial complexes highlight the emergence of novel phenomena such as a discontinuous transition induced by higher-order interactions. We show analytically that the transition is discontinuous and that a bistable region appears where healthy and endemic states co-exist. Our results help explain why critical masses are required to initiate social changes and contribute to the understanding of higher-order interactions in complex systems.","authors":["Iacopo Iacopini","Giovanni Petri","Alain Barrat","Vito Latora"],"meta":["June 2019Nature Communications 10(1):2485","DOI:10.1038/s41467-019-10431-6"],"references":["331150346_Beyond_the_clustering_coefficient_A_topological_analysis_of_node_neighbourhoods_in_complex_networks","328958171_The_importance_of_the_whole_Topological_data_analysis_for_the_network_neuroscientist","328241551_Simplicial_complexes_and_complex_systems","325639714_Experimental_evidence_for_tipping_points_in_social_convention","323141996_From_Continuous_to_Discontinuous_Transitions_in_Social_Diffusion","321902156_Can_co-location_be_used_as_a_proxy_for_face-to-face_contacts","321160749_Network_Geometry_and_Complexity","331992669_From_networks_to_optimal_higher-order_models_of_complex_systems","329293498_Simplicial_Activity_Driven_Model","329112398_Topological_percolation_on_hyperbolic_simplicial_complexes"]}