{"id":"333602754_A_contribution_to_the_development_of_design_strategies_for_the_optimisation_of_lightweight_structures","abstract":"The design and optimisation of lightweight structures is of paramount importance in many industrial fields: from automotive to biomedical ones, from naval to aerospace fields. During the last three decades, new manufacturing processes emerged, e.g. the additive layer manufacturing (ALM) technology applied to different materials (metals, ceramics, composites), the automated fibre placement (AFP) technology for tailoring unconventional composites (both thermoplastic and thermoset ones), the compression moulding compound (CMC) technology (well suited for thermoplastic composites), etc. Therefore, the development of new, modern and well-suited design/optimisation methodologies becomes fundamental. Generally speaking, the design/optimisation strategy should be able to provide an optimised but also manufacturable solution. On the one hand, this methodology must be able to include, since the early stage of the design process (i.e. the preliminary design phase), the specificity of such new technologies (and, mostly, the related technological limitations). On the other hand, the design/optimisation strategy must be able to find a solution when the problem is formulated in the most general sense and when the full set of design variables, involved at different scales, is considered. In order to attain this ambitious goal, the formalisation of new models (or the generalisation of the existing ones) is of capital importance: the problem formulation must be as general as possible and the useless simplifying hypotheses should be totally (or partially) rejected. Of course, the price to pay is an increased problem complexity.\nThis HDR manuscript represents a synthesis of my research activities since September 2013 which are essentially framed into the previous background. This document briefly present my contribution to the development of suitable design strategies for the optimisation of lightweight structures. The work is articulated into four main research axes:\n• the development of new numerical methods (meta-heuristics) for the resolution of optimisation problems characterised by a variable number of design variables (e.g. the optimisation of modular structures);\n• the formulation of high-order shear deformation theories based on tensor invariants (for plates and shells) and the development of a multi-scale optimisation strategy for designing unconventional constant stiffness and variable stiffness composites (manufactured through the AFP process);\n• the development of a new topology optimisation method based on both NURBS hyper-surfaces and density-based schemes (well suited for parts manufactured by ALM technologies);\n• the development of a general (i.e. problem-independent) optimisation strategy for inverse problems.\nThe effectiveness of these methods has been proven (for each topic) through benchmarks taken from the literature and by means of real-world engineering problems as well. Starting from these encouraging results, some general and meaningful perspectives on both new design/optimisation strategies and new manufacturing process for producing hybrid anisotropic structures (of complex topology) are given at the end of the manuscript.","authors":["Marco Montemurro"],"meta":["December 2018","Thesis for: HDR (Habilitation à Diriger des Recherches)"],"references":[]}