{"id":"333653951_Big_data_stream_analysis_a_systematic_literature_review","abstract":"Recently, big data streams have become ubiquitous due to the fact that a number of applications generate a huge amount of data at a great velocity. This made it difficult for existing data mining tools, technologies, methods, and techniques to be applied directly on big data streams due to the inherent dynamic characteristics of big data. In this paper, a systematic review of big data streams analysis which employed a rigorous and methodical approach to look at the trends of big data stream tools and technologies as well as methods and techniques employed in analysing big data streams. It provides a global view of big data stream tools and technologies and its comparisons. Three major databases, Scopus, ScienceDirect and EBSCO, which indexes journals and conferences that are promoted by entities such as IEEE, ACM, SpringerLink, and Elsevier were explored as data sources. Out of the initial 2295 papers that resulted from the first search string, 47 papers were found to be relevant to our research questions after implementing the inclusion and exclusion criteria. The study found that scalability, privacy and load balancing issues as well as empirical analysis of big data streams and technologies are still open for further research efforts. We also found that although, significant research efforts have been directed to real-time analysis of big data stream not much attention has been given to the preprocessing stage of big data streams. Only a few big data streaming tools and technologies can do all of the batch, streaming, and iterative jobs; there seems to be no big data tool and technology that offers all the key features required for now and standard benchmark dataset for big data streaming analytics has not been widely adopted. In conclusion, it was recommended that research efforts should be geared towards developing scalable frameworks and algorithms that will accommodate data stream computing mode, effective resource allocation strategy and parallelization issues to cope with the ever-growing size and complexity of data.","authors":["Taiwo Kolajo","Olawande Daramola","Ayodele Ariyo Adebiyi"],"meta":["June 2019Journal of Big Data 6(1):47","DOI:10.1186/s40537-019-0210-7","Project: Big data analytics"],"references":["328828422_Assessing_the_Methods_Tools_and_Statistical_Approaches_in_Google_Trends_Research_Systematic_Review","327538806_Real-time_big_data_processing_for_anomaly_detection_A_Survey","326710375_Towards_a_Real-time_Occupancy_Detection_Approach_for_Smart_Buildings","326704892_Novel_BI_data_architectures","326317586_A_Comparative_Study_on_Streaming_Frameworks_for_Big_Data","325642509_Performance_Impact_of_Emerging_Memory_Technologies_on_Big_Data_Applications_A_Latency-Programmable_System_Emulation_Approach","324551901_BDEv_30_Energy_efficiency_and_microarchitectural_characterization_of_Big_Data_processing_frameworks","336587483_A_Systematic_Review_of_Research_on_Open_Source_Software_in_Commercial_Software_Product_Development","328076544_Key_technologies_for_big_data_stream_computing","324008399_Concurrence_of_Big_Data_Analytics_and_Healthcare_A_Systematic_Review"]}