{"id":"333663647_A_Subspace_Method_for_Fast_Locally_Injective_Harmonic_Mapping","abstract":"We present a fast algorithm for low‐distortion locally injective harmonic mappings of genus 0 triangle meshes with and without cone singularities. The algorithm consists of two portions, a linear subspace analysis and construction, and a nonlinear non‐convex optimization for determination of a mapping within the reduced subspace. The subspace is the space of solutions to the Harmonic Global Parametrization (HGP) linear system [BCW17], and only vertex positions near cones are utilized, decoupling the variable count from the mesh density. A key insight shows how to construct the linear subspace at a cost comparable to that of a linear solve, extracting a very small set of elements from the inverse of the matrix without explicitly calculating it. With a variable count on the order of the number of cones, a tangential alternating projection method [HCW17] and a subsequent Newton optimization [CW17] are used to quickly find a low‐distortion locally injective mapping. This mapping determination is typically much faster than the subspace construction. Experiments demonstrating its speed and efficacy are shown, and we find it to be an order of magnitude faster than HGP and other alternatives.","authors":["Eden Fedida Hefetz","Edward Chien","Ofir Weber"],"meta":["May 2019Computer Graphics Forum 38(2):105-119","DOI:10.1111/cgf.13623"],"references":["321234879_GPU-accelerated_locally_injective_shape_deformation","328507104_Piecewise_linear_mapping_optimization_based_on_the_complex_view","326729831_Blended_cured_quasi-Newton_for_distortion_optimization","326726742_Progressive_parameterizations","324630689_Scalable_Locally_Injective_Mappings","321232125_Seamless_seam_erasure_and_seam-aware_decoupling_of_shape_from_mesh_resolution","321230514_Localized_solutions_of_sparse_linear_systems_for_geometry_processing","319770625_Surface_parameterization_a_tutorial_and_survey","319447377_Enhancing_the_Scalability_of_Selected_Inversion_Factorization_Algorithms_in_Genomic_Prediction","319116026_Isometry-Aware_Preconditioning_for_Mesh_Parameterization"]}