{"id":"333697425_Big_Data_Approaches_to_Phenotyping_Acute_Ischemic_Stroke_Using_Automated_Lesion_Segmentation_of_Multi-Center_Magnetic_Resonance_Imaging_Data","abstract":"Background and Purpose—\nWe evaluated deep learning algorithms’ segmentation of acute ischemic lesions on heterogeneous multi-center clinical diffusion-weighted magnetic resonance imaging (MRI) data sets and explored the potential role of this tool for phenotyping acute ischemic stroke.\n\nMethods—\nIschemic stroke data sets from the MRI-GENIE (MRI-Genetics Interface Exploration) repository consisting of 12 international genetic research centers were retrospectively analyzed using an automated deep learning segmentation algorithm consisting of an ensemble of 3-dimensional convolutional neural networks. Three ensembles were trained using data from the following: (1) 267 patients from an independent single-center cohort, (2) 267 patients from MRI-GENIE, and (3) mixture of (1) and (2). The algorithms’ performances were compared against manual outlines from a separate 383 patient subset from MRI-GENIE. Univariable and multivariable logistic regression with respect to demographics, stroke subtypes, and vascular risk factors were performed to identify phenotypes associated with large acute diffusion-weighted MRI volumes and greater stroke severity in 2770 MRI-GENIE patients. Stroke topography was investigated.\n\nResults—\nThe ensemble consisting of a mixture of MRI-GENIE and single-center convolutional neural networks performed best. Subset analysis comparing automated and manual lesion volumes in 383 patients found excellent correlation (ρ=0.92; P <0.0001). Median (interquartile range) diffusion-weighted MRI lesion volumes from 2770 patients were 3.7 cm ³ (0.9–16.6 cm ³ ). Patients with small artery occlusion stroke subtype had smaller lesion volumes ( P <0.0001) and different topography compared with other stroke subtypes.\n\nConclusions—\nAutomated accurate clinical diffusion-weighted MRI lesion segmentation using deep learning algorithms trained with multi-center and diverse data is feasible. Both lesion volume and topography can provide insight into stroke subtypes with sufficient sample size from big heterogeneous multi-center clinical imaging phenotype data sets.","authors":["Ona Wu","Stefan Winzeck","Anne-Katrin Giese","Brandon L. Hancock"],"meta":["June 2019Stroke 50(7)","DOI:10.1161/STROKEAHA.119.025373"],"references":["333506531_Ensemble_of_Convolutional_Neural_Networks_Improves_Automated_Segmentation_of_Acute_Ischemic_Lesions_Using_Multiparametric_Diffusion-Weighted_MRI","323713551_Multiancestry_genome-wide_association_study_of_520000_subjects_identifies_32_loci_associated_with_stroke_and_stroke_subtypes","319286061_Design_and_rationale_for_examining_neuroimaging_genetics_in_ischemic_stroke_The_MRI-GENIE_study","317582264_Fully_Automatic_Acute_Ischemic_Lesion_Segmentation_in_DWI_Using_Convolutional_Neural_Networks","301878860_Efficient_Multi-Scale_3D_CNN_with_fully_connected_CRF_for_Accurate_Brain_Lesion_Segmentation","353147000_Abstract_3319_Prediction_Of_Lesion_Expansion_In_Stroke_Patients_Using_Acute_MRI","328153556_Abstract_WMP56_Genetics_of_Acute_Ischemic_Lesion_Volume_the_MRI-Genetics_Interface_Exploration_MRI-GENIE_Study","316266620_GISCOME_-_Genetics_of_Ischaemic_Stroke_Functional_Outcome_network_A_protocol_for_an_international_multicentre_genetic_association_study","313178612_Measuring_inconsistency_in_meta-analysis","288642211_Loci_associated_with_ischaemic_stroke_and_its_subtypes_SiGN_a_genome-wide_association_study"]}