{"id":"333659804_Micro-work_artificial_intelligence_and_the_automotive_industry","abstract":"This paper delves into the human factors in the “back-office” of artificial intelligence and of its data-intensive algorithmic underpinnings. We show that the production of AI is a labor-intensive process, which particularly needs the little-qualified, inconspicuous and low-paid contribution of “micro-workers” who annotate, tag, label, correct and sort the data that help to train and test smart solutions. We illustrate these ideas in the high-profile case of the automotive industry, one of the largest clients of digital data-related micro-working services, notably for the development of autonomous and connected cars. This case demonstrates how micro-work has a place in long supply chains, where tech companies compete with more traditional industry players. Our analysis indicates that the need for micro-work is not a transitory, but a structural one, bound to accompany the further development of the sector; and that its provision involves workers in different geographical and linguistic areas, requiring the joint study of multiple platforms operating at both global and local levels.","authors":["Paola Tubaro","Antonio A. Casilli"],"meta":["June 2019Economia e Politica Industriale 46(3)","DOI:10.1007/s40812-019-00121-1","Project: Digital Platform Labor (DiPLab)"],"references":["332964049_Crowdproduktion_von_Trainingsdaten_Zur_Rolle_von_Online-Arbeit_beim_Trainieren_autonomer_Fahrzeuge","328043472_Digital_labour_platforms_and_the_future_of_work_Towards_decent_work_in_the_online_world","327722287_Le_moment_big_data_des_sciences_sociales","334281942_En_attendant_les_robots_Enquete_sur_le_travail_du_clic","330719594_Karl_Marx_in_the_Age_of_Big_Data_Capitalism","329650493_Heteromation_and_Other_Stories_of_Computing_and_Capitalism","327193801_The_Global_Platform_Economy_A_New_Offshoring_Institution_Enabling_Emerging-Economy_Microproviders","324629669_The_Principles_of_Political_Economy_and_Taxation","322969840_Demographics_and_Dynamics_of_Mechanical_Turk_Workers","320795853_Digital_Labor_Studies_Go_Global_Toward_a_Digital_Decolonial_Turn"]}