{"id":"333702690_Adaptive_Morphological_Reconstruction_for_Seeded_Image_Segmentation","abstract":"Morphological reconstruction (MR) is often employed by seeded image segmentation algorithms such as watershed transform and power watershed as it is able to filter seeds (regional minima) to reduce over-segmentation. However, MR might mistakenly filter meaningful seeds that are required for generating accurate segmentation and it is also sensitive to the scale because a single-scale structuring element is employed. In this paper, a novel adaptive morphological reconstruction (AMR) operation is proposed that has three advantages. Firstly, AMR can adaptively filter useless seeds while preserving meaningful ones. Secondly, AMR is insensitive to the scale of structuring elements because multiscale structuring elements are employed. Finally, AMR has two attractive properties: monotonic increasingness and convergence that help seeded segmentation algorithms to achieve a hierarchical segmentation. Experiments clearly demonstrate that AMR is useful for improving algorithms of seeded image segmentation and seed-based spectral segmentation. Compared to several state-of-the-art algorithms, the proposed algorithms provide better segmentation results requiring less computing time.","authors":["Tao Lei","Xiaohong Jia","Tongliang Liu","Shigang Liu"],"meta":["June 2019IEEE Transactions on Image Processing 28(11)","DOI:10.1109/TIP.2019.2920514","Projects: Image segmentationmultivariate morphological watershed theory and its applications in multi-channel image processing"],"references":["325003122_Image_Segmentation_Using_Sparse_Subset_Selection","322893697_Revisiting_Graph_Construction_for_Fast_Image_Segmentation","322646099_Significantly_Fast_and_Robust_Fuzzy_C-Means_Clustering_Algorithm_Based_on_Morphological_Reconstruction_and_Membership_Filtering","329740331_Weakly-Supervised_Semantic_Segmentation_Network_with_Deep_Seeded_Region_Growing","326452585_Superpixel-Based_Unsupervised_Band_Selection_for_Classification_of_Hyperspectral_Images","324387179_Image_Segmentation_using_Sparse_Subset_Selection","322886204_Improved_Image_Segmentation_via_Cost_Minimization_of_Multiple_Hypotheses","312418293_k-MS_A_Novel_Clustering_Algorithm_Based_on_Morphological_Reconstruction","312339465_Hierarchical_Image_Segmentation_Based_on_Iterative_Contraction_and_Merging","312317146_Terahertz_Imaging_Based_on_Morphological_Reconstruction"]}