{"id":"333720237_Unravelling_the_gender_productivity_gap_in_science_A_meta-analytical_review","abstract":"Women underrepresentation in science has frequently been associated with women being less productive than men (i.e. the gender productivity gap), which may be explained by women having lower success rates, producing science of lower impact and/or suffering gender bias. By performing global meta-analyses, we show that there is a gender productivity gap mostly supported by a larger scientific production ascribed to men. However, women and men show similar success rates when the researchers' work is directly evaluated (i.e. publishing articles). Men's success rate is higher only in productivity proxies involving peer recognition (e.g. evaluation committees, academic positions). Men's articles showed a tendency to have higher global impact but only if studies include self-citations. We detected gender bias against women in research fields where women are underrepresented (i.e. those different from Psychology). Historical numerical unbalance, socio-psychological aspects and cultural factors may influence differences in success rate, science impact and gender bias. Thus, the maintenance of a women-unfriendly academic and non-academic environment may perpetuate the gender productivity gap. New policies to build a more egalitarian and heterogeneous scientific community and society are needed to close the gender gap in science.","authors":["Julia Astegiano","Esther Sebastián-González","Camila T. Castanho"],"meta":["June 2019Royal Society Open Science 6(6)","DOI:10.1098/rsos.181566"],"references":["324728533_Gender_inequity_in_speaking_opportunities_at_the_American_Geophysical_Union_Fall_Meeting","324609859_The_gender_gap_in_science_How_long_until_women_are_equally_represented","319293077_Vicious_circles_of_gender_bias_lower_positions_and_lower_performance_Gender_differences_in_scholarly_productivity_and_impact","309551382_Quantitative_Evaluation_of_Gender_Bias_in_Astronomical_Publications_from_Citation_Counts","308759745_Tenure_Track_Policy_Increases_Representation_of_Women_in_Senior_Academic_Positions_but_Is_Insufficient_to_Achieve_Gender_Balance","325160357_Go_beyond_bias_training","320596143_Introduction_to_meta-analysis","313374975_Metafor_meta-analysis_package_for_R","304106849_Which_gender_gap_Factors_affecting_researchers'_scientific_impact_in_science_and_medicine","290453566_Solving_the_Productivity_and_Impact_Puzzle_Do_Men_Outperform_Women_or_are_Metrics_Biased"]}