{"id":"333745177_Edge_Weights_and_Vertex_Colours_Minimizing_Sum_Count","abstract":"Neighbour-sum-distinguishing edge-weightings are a way to \"encode\" proper vertex-colourings via the sums of weights incident to the vertices. Over the last decades, this notion has been attracting, in the context of several conjectures, ingrowing attention dedicated, notably, to understanding, which weights are needed to produce neighbour-sum-distinguishing edge-weightings for a given graph. \nThis work is dedicated to investigating another related aspect, namely the minimum number of distinct sums/colours we can produce via a neighbour-sum-distinguishing edge-weighting of a given graph G, and the role of the assigned weights in that context. Clearly, this minimum number is bounded below by the chromatic number χ(G) of G. When using weights of ℤ, we show that, in general, we can produce neighbour-sum-distinguishing edge-weightings generating χ(G) distinct sums, except in the peculiar case where G is a balanced bipartite graph, in which case χ(G)+1 distinct sums can be generated. These results are best possible. When using k consecutive weights 1,...,k, we provide both lower and upper bounds, as a function of the maximum degree ∆, on the maximum least number of sums that can be generated for a graph with maximum degree ∆. For trees, which, in general, admit neighbour-sum-distinguishing 2-edge-weightings, we prove that this maximum, when using weights 1 and 2, is of order 2 log_2 ∆. Finally, we also establish the NP-hardness of several decision problems related to these questions.","authors":["Olivier Baudon","Julien Bensmail","Hervé Hocquard","Mohammed Senhaji"],"meta":["August 2019Discrete Applied Mathematics 270(4)","DOI:10.1016/j.dam.2019.07.019"],"references":["220075635_Vertex-coloring_edge-weightings_Towards_the_1-2-3-conjecture","2827653_A_Dynamic_Survey_of_Graph_Labeling","305821210_The_3-flow_conjecture_factors_modulo_k_and_the_1-2-3-conjecture","279648201_On_a_1_2_conjecture","266960317_On_a_12_conjecture","265956312_Vertex-coloring_Edge-weightings_of_Graphs","262321605_Algorithmic_complexity_of_proper_labeling_problems","257428713_Hard_Tiling_Problems_with_Simple_Tiles","242793334_Edge_weights_and_vertex_colors","220200541_On_the_complexity_of_vertex-coloring_edge-weightings"]}