{"id":"333781692_Concept_of_temporal_data_retrieval_Undefined_value_management","abstract":"Data reliability is the main part of the intelligence of current information systems. Objects can change their status anytime, highlighting the validity frame. Several solutions and architectures have been developed in the recent past to cover the complexity of data management over the whole life cycle. The common and most significant aspect is just the validity and correctness of the stored data tuples. Solutions, where data were updated always synchronously in strictly defined time points, frequency, and granularity, are over. Therefore, it is inevitable to create a solution suitable for the particular system to reach the best performance. We reference an attribute‐oriented temporal model with reflection on data grouping technologies. Many times, there is a case, during which the object is defined only partially or data tuple is not present at all. For these reasons, undefined values must be stored in the database in the form of time itself or attribute expressing the state of the object. This paper deals with time‐oriented database architectures, manages undefined values, and proposes a complex system classification based on transactions, approaches, and indexes. It deals with techniques to model undefined values and covers synchronization processes using data groups. We propose solutions for effective data retrieval with an emphasis on undefined values and states.","authors":["Michal Kvet","Štefan Toth","Emil Krsak"],"meta":["June 2019Concurrency and Computation Practice and Experience 32(1):e5399","DOI:10.1002/cpe.5399"],"references":["312657636_Temporal_transaction_integrity_constraints_management","304709913_Temporal_geospatial_analysis_of_secondary_school_students'_examination_performance","325573413_Concept_of_Temporal_Data_Retrieval_Undefined_Value_Management","321501013_Expert_Indexing_in_Oracle_Database_11g","317219463_Designing_Platform_Independent_Mobile_Apps_and_Services","311978856_Concept_of_system_architecture_database_analysis","308671764_Importance_analysis_of_multi-state_systems_based_on_integrated_direct_partial_logic_derivatives","306379245_Derivation_of_long-term_spatiotemporal_landslide_activity-A_multi-sensor_time_series_approach","304256467_Multilayered_database_intrusion_detection_system_for_detecting_malicious_behaviors_in_big_data_transaction","288553437_Research_on_null-value_estimation_algorithm_based_on_predicted_value"]}