{"id":"333706156_Opening_the_black_box_of_data-based_school_monitoring_Data_infrastructures_flows_and_practices_in_state_education_agencies_In_Big_Data_Society","abstract":"Contributing to a rising number of Critical Data Studies which seek to understand and critically reflect on the increasing datafication and digitalisation of governance, this paper focuses on the field of school monitoring, in particular on digital data infrastructures, flows and practices in state education agencies. Our goal is to examine selected features of the enactment of datafication and, hence, to open up what has widely remained a black box for most education researchers. Our findings are based on interviews conducted in three state education agencies in two different national contexts (the US and Germany), thus addressing the question of how the datafication and digitalisation of school governance has not only manifested within but also across educational contexts and systems. As our findings illustrate, the implementation of data-based school monitoring and leadership in state education agencies appears as a complex entanglement of very different logics, practices and problems, producing both new capabilities and powers. Nonetheless, by identifying different types of ‘doing data discrepancies’ reported by our interviewees, we suggest an analytical heuristic to better understand at least some features of the multifaceted enactment of data-based, increasingly digitalised governance, within and beyond the field of education.","authors":["Sigrid Hartong","Annina Förschler"],"meta":["June 2019Big Data & Society","DOI:10.1177/2053951719853311","Project: Bildungsdatenmanagement – Neue Wissens-, Interdependenz- und Einflussstrukturen im Kontext der Digitalisierung von Educational Governance / Data Infrastructures and Data Management in Education ˗  Observing the Digitalization of Educational Governance"],"references":["328643273_The_Production_Cycle_of_Pisa_Data_in_Brazil_The_History_of_Data_Beyond_the_Numbers","326321359_Data_infrastructure_literacy","325291635_Education_recoded_policy_mobilities_in_the_international_'learning_to_code'_agenda","325203021_Governance_by_data_circulation_The_production_availability_and_use_of_national_large-scale_assessment_data_Chapter_6","338750109_Big_Data_in_Education_The_digital_future_of_learning_policy_and_practice","330380986_The_Transformation_of_State_Monitoring_Systems_in_Germany_and_the_US_Relating_the_Datafication_and_Digitalization_of_Education_to_the_Global_Education_Industry","330343805_Governing_Education_through_Data_Scotland_England_and_the_European_Education_Policy_Space","326682070_Politikmobilitat_und_datenbasierte_Educational_Governance_Weiter-_Entwicklung_einer_topologischen_Perspektivierung_Bildung_Erziehung_72_1_S_6-23","323648805_Datafication_testing_events_and_the_outside_of_thought","323368062_Paying_for_financial_expertise_privatization_policies_and_shifting_state_responsibilities_in_the_school_facilities_industry"]}