{"id":"333730400_What_can_artificial_intelligence_teach_us_about_the_molecular_mechanisms_underlying_disease","abstract":"While molecular imaging with positron emission tomography or single-photon emission computed tomography already reports on tumour molecular mechanisms on a macroscopic scale, there is increasing evidence that there are multiple additional features within medical images that can further improve tumour characterization, treatment prediction and prognostication. Early reports have already revealed the power of radiomics to personalize and improve patient management and outcomes. What remains unclear is how these additional metrics relate to underlying molecular mechanisms of disease. Furthermore, the ability to deal with increasingly large amounts of data from medical images and beyond in a rapid, reproducible and transparent manner is essential for future clinical practice. Here, artificial intelligence (AI) may have an impact. AI encompasses a broad range of ‘intelligent’ functions performed by computers, including language processing, knowledge representation, problem solving and planning. While rule-based algorithms, e.g. computer-aided diagnosis, have been in use for medical imaging since the 1990s, the resurgent interest in AI is related to improvements in computing power and advances in machine learning (ML). In this review we consider why molecular and cellular processes are of interest and which processes have already been exposed to AI and ML methods as reported in the literature. Non-small-cell lung cancer is used as an exemplar and the focus of this review as the most common tumour type in which AI and ML approaches have been tested and to illustrate some of the concepts.","authors":["Gary Cook","Vicky Goh"],"meta":["December 2019European Journal of Nuclear Medicine and Molecular Imaging 46(13)","DOI:10.1007/s00259-019-04370-z"],"references":["328790191_Whole_body_PD-1_and_PD-L1_positron_emission_tomography_in_patients_with_non-small-cell_lung_cancer","327380664_Discovery_of_pre-therapy_2-deoxy-2-18F-fluoro-D-glucose_positron_emission_tomography-based_radiomics_classifiers_of_survival_outcome_in_non-small-cell_lung_cancer_patients","327227869_Correlations_between_metabolic_texture_features_genetic_heterogeneity_and_mutation_burden_in_patients_with_lung_cancer","327046649_Data_analysis_strategies_in_medical_imaging","337903581_Multiscale_Texture_Analysis_From_18F-FDG_PET_Images_to_Histologic_Images","329003978_SELECT_A_Phase_II_Trial_of_Adjuvant_Erlotinib_in_Patients_With_Resected_Epidermal_Growth_Factor_Receptor-Mutant_Non-Small-Cell_Lung_Cancer","328637450_Investigating_the_histopathologic_correlates_of_18F-FDG_PET_heterogeneity_in_non-small-cell_lung_cancer","327565612_Novel_Quantitative_PET_Techniques_for_Clinical_Decision_Support_in_Oncology","326657309_Intra-tumoral_Heterogeneity_Characterization_through_Texture_and_Color_Analysis_for_Differentiation_of_Non-small_Cell_Lung_Carcinoma_Subtypes","325730118_Metabolic_Imaging_Phenotype_Using_Radiomics_of_18FFDG_PETCT_Associated_with_Genetic_Alterations_of_Colorectal_Cancer"]}