{"id":"333752364_What_Is_Data_Science","abstract":"Data science, a new discovery paradigm, is potentially one of the most significant advances of the early twenty-first century. Originating in scientific discovery, it is being applied to every human endeavor for which there is adequate data. While remarkable successes have been achieved, even greater claims have been made. Benefits, challenge, and risks abound. The science underlying data science has yet to emerge. Maturity is more than a decade away. This claim is based firstly on observing the centuries-long developments of its predecessor paradigms—empirical, theoretical, and Jim Gray’s Fourth Paradigm of Scientific Discovery (Hey et al., The fourth paradigm: data-intensive scientific discovery Edited by Microsoft Research, 2009) (aka eScience, data-intensive, computational, procedural)—and secondly on my studies of over 150 data science use cases, several data science-based startups, and, on my scientific advisory role for Insight (https://www.insight-centre.org/), a Data Science Research Institute (DSRI) that requires that I understand the opportunities, state of the art, and research challenges for the emerging discipline of data science. This chapter addresses essential questions for a DSRI: What is data science? What is world-class data science research? A companion chapter (Brodie, On Developing Data Science, in Braschler et al. (Eds.), Applied data science – Lessons learned for the data-driven business, Springer 2019) addresses the development of data science applications and of the data science discipline itself.","authors":["Michael L. Brodie"],"meta":["June 2019","DOI:10.1007/978-3-030-11821-1_8","In book: Applied Data Science (pp.101-130)"],"references":["333752267_On_Developing_Data_Science","321902367_A_Berkeley_View_of_Systems_Challenges_for_AI","321571298_Mastering_Chess_and_Shogi_by_Self-Play_with_a_General_Reinforcement_Learning_Algorithm","311667094_Piketty_Revisited_Improving_Economics_through_Data_Science_-_How_Data_CurationCan_EnableMore_Faithful_Data_Science_In_Much_Less_Time","311667088_The_First_Law_of_Data_Science_Do_Umbrellas_Cause_Rain","344804575_Capital_in_the_Twenty-First_Century","340824223_The_Art_and_Science_of_Cause_and_Effect","333753688_Applied_Data_Science_Lessons_Learned_for_the_Data-Driven_Busines","318430830_Why_You're_Not_Getting_Value_from_Your_Data_Science","298606994_Ensemble_methods_in_machine_learning"]}