{"id":"333733105_Analogy_in_Terms_of_Identity_Equivalence_Similarity_and_Their_Cryptomorphs","abstract":"Analogy belongs to the class of concepts notorious for a variety of definitions generating continuing disputes about their preferred understanding. Analogy is typically defined by or at least associated with similarity, but as long as similarity remains undefined this association does not eliminate ambiguity. In this paper, analogy is considered synonymous with a slightly generalized mathematical concept of similarity which under the name of tolerance relation has been the subject of extensive studies over several decades. In this approach, analogy can be mathematically formalized in terms of the sequence of binary relations of increased generality, from the identity, equivalence, tolerance, to weak tolerance relations. Each of these relations has cryptomorphic presentations relevant to the study of analogy. The formalism requires only two assumptions which are satisfied in all of the earlier attempts to formulate adequate definitions which met expectations of the intuitive use of the word analogy in general contexts. The mathematical formalism presented here permits theoretical analysis of analogy in the contrasting comparison with abstraction, showing its higher level of complexity, providing a precise methodology for its study and informing philosophical reflection. Also, arguments are presented for the legitimate expectation that better understanding of analogy can help mathematics in establishing a unified and universal concept of a structure.","authors":["Marcin J. Schroeder"],"meta":["June 2019Philosophies 4(2):32","DOI:10.3390/philosophies4020032"],"references":["296686719_Invariance_as_a_Tool_for_Ontology_of_Information","332765111_Theoretical_Study_of_the_Concepts_of_Information_Defined_as_Difference_and_as_Identification_of_a_Variety","287826272_Sur_certaines_surfaces_algebriques_troisieme_complement_'a_l'analysis_situs","279715984_Studies_in_ethnoscience","279588123_CULTURAL_ECOLOGY_AND_ETHNOGRAPHY","279555260_Hanunoo_Color_Categories","275871652_A_Semantic_Analysis_of_the_Pawnee_Kinship_Usage","275109325_Ontological_study_of_information_Identity_and_state","271689508_Polythetic_Classification_Convergence_and_Consequences","270383915_Nicholas_of_Cusa_on_God_as_Not-other_A_Translation_and_an_Appraisal_of_De_Li_Non_Aliud"]}