{"id":"333758501_Stability_in_barter_exchange_markets","abstract":"The notion of stability is the foundation of several classic problems in economics and computer science that arise in a wide-variety of real-world situations, including Stable Marriage, Stable Roommate, Hospital Resident and Group Activity Selection. We study this notion in the context of barter exchange markets. The input of our problem of interest consists of a set of people offering goods/services, with each person subjectively assigning values to a subset of goods/services offered by other people. The goal is to find a stable transaction, a set of cycles that is stable in the following sense: there does not exist a cycle such that every person participating in that cycle prefers to his current “status”. For example, consider a market where families are seeking vacation rentals and offering their own homes for the same. Each family wishes to acquire a vacation home in exchange of its own home without any monetary exchange. We study such a market by analyzing a stable transaction of houses involving cycles of fixed length. The underlying rationale is that an entire trade/exchange fails if any of the participating agents cancels the agreement; as a result, shorter (trading) cycles are desirable. We show that given a transaction, it can be verified whether or not it is stable in polynomial time, and that the problem of finding a stable transaction is NP-hard even if each person desires only a small number of other goods/services. Having established these results, we study the problem of finding a stable transaction in the framework of parameterized algorithms.","authors":["Sushmita Gupta","Fahad Panolan","Saket Saurabh","Meirav Zehavi"],"meta":["September 2019Autonomous Agents and Multi-Agent Systems 33(1&2)","DOI:10.1007/s10458-019-09414-0"],"references":["321665810_Group_Activity_Selection_on_Social_Networks","314238511_On_Parameterized_Complexity_of_Group_Activity_Selection_Problems_on_Social_Networks","301857431_Hedonic_Games_with_Graph-restricted_Communication","270651624_Finding_long_chains_in_kidney_exchange_using_the_traveling_salesman_problem","323715811_College_Admissions_and_the_Stability_of_Marriage","316012129_Handbook_of_Computational_Social_Choice","313903170_Parameterized_Algorithms","309077071_Efficient_Computation_of_Representative_Families_with_Applications_in_Parameterized_and_Exact_Algorithms","305524954_Position-Indexed_Formulations_for_Kidney_Exchange","286384089_Finding_Strategyproof_Social_Choice_Functions_via_SAT_Solving","228344242_Stable_exchange_of_indivisible_goods_with_restrictions","266312915_Stable_marriage_and_its_relation_to_other_combinatorial_problems_An_introduction_to_the_mathematical_analysis_of_algorithms_Transl_from_the_French_by_Martin_Goldstein","255994548_The_Hospitals_Residents_Problem_with_Couples_Complexity_and_Integer_Programming_Models","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","223069020_Stable_marriage_and_indifference"]}