{"id":"333728873_On_the_automatic_planning_of_healthy_and_balanced_menus","abstract":"With the raise of diseases related with unhealthy lifestyles such as heart-attacks, overweight, diabetes, etc., encouraging healthy and balanced patterns in the population is one of the most important action points for governments around the world. Furthermore, it is actually even a more critical situation when a high percentage of patients are children and teenagers whose habits consist merely in eating fast or ultra-processed food and a sedentary life.\nThe development of healthy and balanced menu plans becomes a typical task for physicians and nutritionists, and it is at this point that Computer Science has taken an important role. Discovering new approaches for generating healthy and balanced, as well as inexpensive menu plans will play an important role to reduce diseases from current and new generations.\nIn this paper, a recently proposed multi-objective evolutionary algorithm is compared to traditional multi-objective evolutionary algorithms for solving a novel multi-objective formulation of the Menu Planning Problem designed for school cafeterias. In order to evaluate the performance of the approaches selected for comparison, an exhaustive experimental assessment was made. Firstly we focused on performing a suitable election of the parameter values of the algorithm, so afterwards the best configuration found could be compared to the remaining multi-objective optimisers.","authors":["Alejandro Marrero","Eduardo Segredo","Coromoto Leon"],"meta":["June 2019","DOI:10.1145/3319619.3326776","Conference: the Genetic and Evolutionary Computation Conference Companion","Project: Combinaci贸n de computaci贸n evolutiva y aprendizaje automatizado en la resoluci贸n de problemas de optimizaci贸n"],"references":["316562531_A_review_on_automated_menu_planning_approaches","6865449_Food_Variety_and_Dietary_Diversity_Scores_in_Children_Are_they_Good_Indicators_of_Dietary_Adequacy","3418989_MOEAD_A_Multiobjective_Evolutionary_Algorithm_Based_on_Decomposition","238381912_Computer-based_dietary_menu_planning","228944713_Application_Of_A_Multi-Objective_Genetic_Algorithm_To_The_Modified_Diet_Problem","220160417_Metco_a_Parallel_Plugin-Based_Framework_for_Multi-Objective_Optimization","3418687_A_fast_and_elitist_multiobjective_genetic_algorithm_NSGA-II","2386811_SPEA2_Improving_the_Strength_Pareto_Evolutionary_Algorithm"]}