{"id":"333772865_Estimation_of_Primary_Quantization_Steps_in_Double-Compressed_JPEG_Images_Using_a_Statistical_Model_of_Discrete_Cosine_Transform","abstract":"Double compression of images occurs when one compresses twice, possibly with different quality factors, a digital image. Estimation of the first compression parameter of such a double compression is of a crucial interest for image forensics since it may help revealing, for instance, the software or the source camera. This paper proposes an accurate method for estimating the primary quantization steps in double-compressed JPEG images. This original methodology is based on an accurate statistical model of discrete cosine transform (DCT) coefficients that has been proposed in our previous works. We also present a thorough analysis of the double compression properties, taking into account carefully the effect of round-off noise. This analysis is used to derive an accurate range of possible value for quantization of primary DCT coefficients with respect to the secondary quantization step. Using both the statistical model of quantized DCT coefficients and the range of possible values of first quantization step, a model of the twice quantized DCT coefficients is established. Eventually, it is proposed to estimate the primary quantization value by finding, among a set of possible candidates, the one that best match the proposed statistical model in terms of minimal symmetrized Kullback-Leibler (KL) divergence. The numerical experiments on large databases of real images and comparisons with state-of-the-art approaches emphasize the relevance of the proposed method.","authors":["Thanh Hai Thai","Rémi Cogranne"],"meta":["June 2019IEEE Access 7","DOI:10.1109/ACCESS.2019.2921324"],"references":["312316157_Individual_camera_device_identification_from_JPEG_images","307524437_JPEG_Quantization_Step_Estimation_and_Its_Applications_to_Digital_Image_Forensics","273170086_Low-Complexity_Features_for_JPEG_Steganalysis_Using_Undecimated_DCT","272569158_Camera_model_identification_based_on_DCT_coefficient_statistics","263894843_First_Quantization_Matrix_Estimation_From_Double_Compressed_JPEG_Images","302970924_A_Simplex_Method_for_Function_Minimization","295651210_Distribution_shape_of_two-dimensional_DCT_coefficients_of_natural_images","277496116_Information_Forensics_An_Overview_of_the_First_Decade","273398284_An_Effective_Method_for_Detecting_Double_JPEG_Compression_With_the_Same_Quantization_Matrix","271463285_Steganalysis_of_Jsteg_algorithm_based_on_a_novel_statistical_model_of_quantized_DCT_coefficients"]}