{"id":"333735632_Deep_Iris_Deep_Learning_for_Gender_Classification_Through_Iris_Patterns","abstract":"Introduction: \nOne attractive research area in the computer science field is soft biometrics.\n\nAim: \nTo Identify a person's gender from an iris image when such identification is related to security surveillance systems and forensics applications.\n\nMethods: \nIn this paper, a robust iris gender-identification method based on a deep convolutional neural network is introduced. The proposed architecture segments the iris from a background image using the graph-cut segmentation technique. The proposed model contains 16 subsequent layers; three are convolutional layers for feature extraction with different convolution window sizes, followed by three fully connected layers for classification.\n\nResults: \nThe original dataset consists of 3,000 images, 1,500 images for men and 1,500 images for women. The augmentation techniques adopted in this research overcome the overfitting problem and make the proposed architecture more robust and immune from simply memorizing the training data. In addition, the augmentation process not only increased the number of dataset images to 9,000 images for the training phase, 3,000 images for the testing phase and 3,000 images for the verification phase but also led to a significant improvement in testing accuracy, where the proposed architecture achieved 98.88%. A comparison is presented in which the testing accuracy of the proposed approach was compared with the testing accuracy of other related works using the same dataset.\n\nConclusion: \nThe proposed architecture outperformed the other related works in terms of testing accuracy.","authors":["Nour Eldeen Khalifa","Mohamed Hamed N Taha","Aboul Ella Hassanien","Hamed Nasr Eldin T Mohamed"],"meta":["June 2019Acta Informatica Medica 27(2):96","DOI:10.5455/aim.2019.27.96-102"],"references":["305824563_DeepFruits_A_Fruit_Detection_System_Using_Deep_Neural_Networks","324983356_Road_surface_temperature_prediction_based_on_gradient_extreme_learning_machine_boosting","323595573_Eye_Recognition_With_Mixed_Convolutional_and_Residual_Network_MiCoRe-Net","322872425_Gender_and_ethnicity_classification_of_Iris_images_using_deep_class-encoder","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770174_Practical_recommendations_for_gradient-based_training_of_deep_architectures","318823990_Gender_Classification_from_NIR_Iris_Images_Using_Deep_Learning","318692655_Deep_fruit_detection_in_orchards","312432980_A_survey_of_deep_neural_network_architectures_and_their_applications","311919526_Understanding_Data_Augmentation_for_Classification_When_to_Warp"]}