{"id":"333745221_WhatsApp_como_Ferramenta_de_Apoio_Pedagogico_na_Disciplina_de_Autoria_Web_do_Curso_Tecnico_em_Informatica_para_Internet","abstract":"This article presents a teaching experience with the use of the WhatsApp application, by students of the Web Authoring course of the technical course in computer science for the internet. For this practice, a WhatsApp group was created in which the students interacted and sent files related to the discipline for four weeks, and an electronic questionnaire was finally applied, obtaining 32 responses. The objective was to analyze the potentialities of the use of WhatsApp in High School, aiming to help interested in its use in Teaching. The results showed that students felt quite motivated and active within the learning process, increasing autonomy and interactivity outside and within the classroom. Resumo. Este artigo apresenta uma experiência de ensino com o uso do aplicativo WhatsApp, por alunos da disciplina de Autoria Web do curso técnico em informática para internet. Para tal prática foi criado um grupo do WhatsApp no qual os alunos interagiam e enviavam arquivos relacionados a disciplina por quatro semanas, sendo ao final aplicado um questionário eletrônico, obtendo-se 32 respostas. O objetivo foi analisar as potencialidades da utilização do WhatsApp no Ensino Médio, visando auxiliar interessados em sua utilização no Ensino. Os resultados mostraram que os alunos sentiram-se bastante motivados e ativos dentro do processo de aprendizagem, aumentando a autonomia e interatividade fora e dentro da sala de aula.","authors":["Ernane Martins","Luis Borges Gouveia"],"meta":["December 2018","Project: Doutoramento"],"references":["300237146_WhatsApp_como_ferramenta_de_apoio_ao_ensino","294119738_WhatsApp_caracterizacao_do_genero_chat_em_contexto_de_ensino_de_linguas_estrangeiras","324784601_UM_ESTUDO_SOBRE_AS_POSSIBILIDADES_PEDAGOGICAS_DE_UTILIZACAO_DO_WHATSAPP","307808487_Ambientes_virtuais_e_midias_de_comunicacao_abordando_a_explosao_das_midias_na_sociedade_da_informacao_e_seu_impacto_na_aprendizagem_o_uso_do_WhatsApp_como_plataforma_de_m-learning"]}