{"id":"333718843_Cybercrime_Awareness_among_Students_at_a_Teacher_Training_College_IJCTT","abstract":"Instances of cybercrimes have increased rapidly over the past decade and have become part of the everyday lives of citizens. The purpose of this pilot study was to assess the level of cybercrime awareness among teaching students and to find out whether computer science students had heightened cybercrime awareness compared to students taking other majors at the same college. For this purpose, a sample of 73 Arab students from a teacher education college in the center of Israel was selected. A questionnaire survey was conducted to collect the data about students' awareness of cybercrime. The finding of the study revealed that the level of cybercrime awareness among the participants was inadequate and that the independent variables, such as year of study, major subject, and prior computer knowledge did not yield any statistically significant differences. In addition, no correlation was found between the students' prior computer knowledge and theirsusceptibility to being victims of cybercrimes. We conclude that higher education institutions should provide training courses on cyberspace security to all students in order to enable them to avoid becoming victims of cybercrimes.Finally, recommendations for future research are suggested.","authors":["Moanes H. Tibi","Kholod Hadeje","Bashier Watted"],"meta":["June 2019","DOI:10.14445/22312803/IJCTT-V67I6P102"],"references":["321941635_Cybercrime_and_Computer_Science_Undergraduate_Students_in_Private_Universities_in_Nigeria_An_Empirical_Investigation","321482508_A_Survey_on_Cyber_Security_awareness_among_college_students_in_Tamil_Nadu","292672963_A_Study_of_Cyber_Security_Awareness_in_Educational_Environment_in_the_Middle_East","286167200_Cyber_Crime_Risk_Awareness_in_Kyrgyz_Republic","284084954_Analysis_of_personal_information_security_behavior_and_awareness","278015875_Cyber_Crime_and_the_Victimization_of_Women_Laws_Rights_and_Regulations","272007235_Students_Information_Security_Practices_and_Awareness","262164654_Information_Security_Awareness_Status_of_Business_College_Undergraduate_Students"]}