{"id":"333761043_Academic_Team_Formulation_Based_on_Liebig's_Barrel_Discovery_of_Anticask_Effect","abstract":"Academic team formulation is one of the most critical and fundamental issues in team research. Inspired by the Liebig's metaphor, we formulate an academic team by a barrel composed of planks, namely, Liebig's barrel. We study the capacity of Liebig's barrel from several aspects. Then, we abstract the features in academic teams as those in Liebig's barrel due to the correspondences between team size and plank number, individual member ability and plank height, individual contribution and plank width, allocation of work and plank combination, teamwork attitude and plank tilt angle, team output property, and barrel's content granularity. The investigated model can also be extended to formulate various multifactor objective optimization issues for team science research. In order to verify the rationality of the proposed model, we implement case studies of this model in both the American Physics Society and the Microsoft Academic Graph Computer Science data sets. The experimental results show that the investigated model is effective in academic team formulation. Moreover, an interesting phenomenon is discovered in the proposed model, which we name as the anticask effect that a team's output quality mainly lies on the team member having the maximal research ability rather than those having minimal research ability. We then analyze the underlying reasons for the anticask effect and multiple-factor interaction on academic teams.","authors":["Shuo Yu","Feng Xia","Huan Liu"],"meta":["June 2019IEEE Transactions on Computational Social Systems PP(99):1-12","DOI:10.1109/TCSS.2019.2913460"],"references":["331085879_Large_teams_develop_and_small_teams_disrupt_science_and_technology","330896417_Academic_social_networks_Modeling_analysis_mining_and_applications","330804118_Science_of_Scientific_Team_Science_A_survey","327594005_Recoverable_Team_Formation_Building_Teams_Resilient_to_Change","326329515_Hot_streaks_in_artistic_cultural_and_scientific_careers","318915444_Unsupervised_Feature_Selection_in_Signed_Social_Networks","316069488_A_Method_of_Partner_Selection_for_Knowledge_Collaboration_Teams_using_Weighted_Social_Network_Analysis","326516264_Predicting_teamwork_group_assessment_using_log_data-based_learning_analytics","324640629_Identifying_Your_Representative_Work_Based_on_Credit_Allocation","321387240_Rise_of_multi-authored_papers_in_economics_Demise_of_the_'lone_star'_and_why"]}