{"id":"333832128_Efficient_Featurized_Image_Pyramid_Network_for_Single_Shot_Detector","abstract":"Single-stage object detectors have recently gained popularity due to their combined advantage of high detection accuracy and real-time speed. However, while promising results have been achieved by these detectors on standard-sized objects, their performance on small objects is far from satisfactory. To detect very small/large objects, classical pyramid representation can be exploited, where an image pyramid is used to build a feature pyramid (featurized image pyramid), enabling detection across a range of scales. Existing single-stage detectors avoid such a featurized image pyramid representation due to its memory and time complexity. In this paper, we introduce a lightweight architecture to efficiently produce featurized image pyramid in a single-stage detection framework. The resulting multi-scale features are then injected into the prediction layers of the detector using an attention module. The performance of our detector is validated on two benchmarks: PASCAL VOC and MS COCO. For a 300×300 input, our detector operates at 111 frames per second (FPS) on a Titan X GPU, providing state-of-the-art detection accuracy on PASCAL VOC 2007 testset. On the MS COCO testset, our detector achieves state-of-the-art results surpassing all existing single-stage methods in the case of single-scale inference.","authors":["Yanwei Pang","Tiancai Wang","Rao Muhammad Anwer","Fahad Khan"],"meta":["June 2019","DOI:10.1109/CVPR.2019.00751","Conference: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition","Project: General Object Detection"],"references":["329743392_Single-Shot_Object_Detection_with_Enriched_Semantics","321241658_An_Analysis_of_Scale_Invariance_in_Object_Detection_-_SNIP","321180719_Single-Shot_Refinement_Neural_Network_for_Object_Detection","338512699_Triply_Supervised_Decoder_Networks_for_Joint_Detection_and_Segmentation","329745476_Cascade_R-CNN_Delving_Into_High_Quality_Object_Detection","329488196_R-fcn_Object_detection_via_region-based_fully_convolutional_networks","322592076_Extend_the_shallow_part_of_Single_Shot_MultiBox_Detector_via_Convolutional_Neural_Network","322060396_Mask_R-CNN","321719027_Weaving_Multi-scale_Context_for_Single_Shot_Detector","321210791_Receptive_Field_Block_Net_for_Accurate_and_Fast_Object_Detection"]}