{"id":"333840644_The_Methodological_Divide_of_Sociology_Evidence_from_Two_Decades_of_Journal_Publications","abstract":"Past research indicates that Sociology is a low-consensus discipline, where different schools of thought have distinct expectations about suitable scientific practices. This division of Sociology into different subfields is to a large extent related to methodology and choices between qualitative or quantitative research methods. Relying on theoretical constructs of the academic prestige economy, boundary demarcation and taste for research, we examine the methodological divide in generalist Sociology journals. Using automated text analysis for 8737 abstracts of articles published between 1995 and 2017, we discover evidence of this divide, but also of an entanglement between methodological choices and different research topics. Moreover, our results suggest a marginally increasing time trend for the publication of quantitative research in generalist journals. We discuss how this consolidation of methodological practices could enforce the entrenchment of different schools of thought, which ultimately reduces the potential for innovative and effective sociological research.","authors":["Carsten Schwemmer","Oliver Wieczorek"],"meta":["June 2019Sociology 54(2):003803851985314","DOI:10.1177/0038038519853146","Project: Netzwerke, Paradigmen und Karrieren im akademischen Feld: Soziologie in Deutschland und den Vereinigten Staaten"],"references":["328126395_quanteda_An_R_package_for_the_quantitative_analysis_of_textual_data","326070145_ggeffects_Tidy_Data_Frames_of_Marginal_Effects_from_Regression_Models","317500690_Sociology_and_Science_The_Making_of_a_Social_Scientific_Method","343240131_Discovery_of_grounded_theory_Strategies_for_qualitative_research","331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","324359780_The_Logic_of_Scientific_Discovery","324075586_Soziologie_in_der_Identitatskrise_Zwischen_totaler_Fragmentierung_und_Einparadigmenherrschaft","320385934_A_Tale_of_Two_Sociologies_Analyzing_Versus_Critique_in_UK_Sociology","317128320_An_Invitation_of_Reflexive_Sociology","314559106_Boundary_Processes_Recent_Theoretical_Developments_and_New_Contributions"]}