{"id":"333846924_The_Student_Expectations_of_Learning_Analytics_Questionnaire","abstract":"Student engagement within the development of learning analytics services in Higher Education is an important challenge to address. Despite calls for greater inclusion of stakeholders, there still remains only a small number of investigations into students’ beliefs and expectations towards learning analytics services. Therefore, this paper presents a descriptive instrument to measure student expectations (ideal and predicted) of learning analytics services. The scales used in the instrument are grounded in a theoretical framework of expectations, specifically ideal and predicted expectations. Items were then generated on the basis of four identified themes (Ethical and Privacy Expectations, Agency Expectations, Intervention Expectations, and Meaningfulness Expectations), which emerged after a review of the learning analytics literature. The results of an exploratory factor analysis and the results from both an exploratory structural equation model and confirmatory factor analysis supported a two‐factor structure best accounted for the data pertaining to ideal and predicted expectations. Factor one refers to Ethical and Privacy Expectations, whilst factor two covers Service Feature Expectations. The 12‐item Student Expectations of Learning Analytics Questionnaire (SELAQ) provides researchers and practitioners with a means of measuring of students’ expectations of learning analytics services.","authors":["Alexander Whitelock-Wainwright","Dragan Gasevic","Ricardo Tejeiro","Yi-Shan Tsai"],"meta":["October 2019Journal of Computer Assisted Learning 35(1)","DOI:10.1111/jcal.12366"],"references":["317648979_Give_Me_a_Customizable_Dashboard_Personalized_Learning_Analytics_Dashboards_in_Higher_Education","314106438_What_do_students_want_towards_an_instrument_for_students'_evaluation_of_quality_of_learning_analytics_services","314105283_Learning_analytics_in_higher_education_---_challenges_and_policies_a_review_of_eight_learning_analytics_policies","318393858_R_A_Language_and_Environment_for_Statistical_Computing","318393770_R_A_Language_and_Environment_for_Statistical_Computing","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","317647539_Features_Students_Really_Expect_from_Learning_Analytics","314106437_Trends_and_issues_in_student-facing_learning_analytics_reporting_systems_research","314106254_An_elephant_in_the_learning_analytics_room_the_obligation_to_act","314104903_Student_perceptions_of_their_privacy_in_leaning_analytics_applications"]}