{"id":"333834384_RetinaMatch_Efficient_Template_Matching_of_Retina_Images_for_Teleophthalmology","abstract":"Retinal template matching and registration is an important challenge in teleophthalmology with low-cost imaging devices. However, the images from such devices generally have a small field of view (FOV) and image quality degradations, making matching difficult. In this work, we develop an efficient and accurate retinal matching technique that combines dimension reduction and mutual information (MI), called RetinaMatch. The dimension reduction initializes the MI optimization as a coarse localization process, which narrows the optimization domain and avoids local optima. The effectiveness of RetinaMatch is demonstrated on the open fundus image database STARE with simulated reduced FOV and anticipated degradations, and on retinal images acquired by adapter-based optics attached to a smartphone. RetinaMatch achieves a success rate over 94human retinal images with the matched target registration errors below 2 pixels on average, excluding the observer variability, outperforming standard template matching solutions. In the application of measuring vessel diameter repeatedly, single pixel errors are expected. In addition, our method can be used in the process of image mosaicking with area-based registration, providing a robust approach when feature-based methods fail. To the best of our knowledge, this is the first template matching algorithm for retina images with small template images from unconstrained retinal areas. In the context of the emerging mixed reality market, we envision automated retinal image matching and registration methods as transformative for advanced teleophthalmology and long-term retinal monitoring.","authors":["Chen Gong","N. Benjamin Erichson","John P. Kelly","Laura Trutoiu"],"meta":["June 2019IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2019.2923466"],"references":["326147306_On_the_Applications_of_Robust_PCA_in_Image_and_Video_Processing","322867192_Automatic_Detection_of_Longitudinal_Changes_for_Retinal_Fundus_Images_Based_on_Low-Rank_Decomposition","320891179_Randomized_Nonnegative_Matrix_Factorization","317135090_Automated_retinal_imaging_and_trend_analysis_-_a_tool_for_health_monitoring","309035312_Smartphone-Based_Accurate_Analysis_of_Retinal_Vasculature_towards_Point-of-Care_Diagnostics","320921567_Semi-autonomous_image-guided_brain_tumour_resection_using_an_integrated_robotic_system_A_bench-top_study","317269437_Trend_Analysis_of_Fragmented_Time_Series_for_mHealth_Apps_Hypothesis_Testing_Based_Adaptive_Spline_Filtering_Method_With_Importance_Weighting","313963222_Non-contact_ultra-_widefield_retinal_imaging_of_infants_with_suspected_abusive_head_trauma","311164170_Development_and_Validation_of_a_Deep_Learning_Algorithm_for_Detection_of_Diabetic_Retinopathy_in_Retinal_Fundus_Photographs","308737433_Automated_retina_identification_based_on_multiscale_elastic_registration"]}