{"id":"333852587_NEW_INEQUALITIES_ON_TRIANGLE_AREAS","abstract":"In this paper we prove a new inequality with the best constant for the areas of triangles formed by the lines through a point M in a triangle ABC, parallel to the sides of Cevian triangle of ΔABC with respect to the point M. Unexpectedly, this result lead us to a new refinement of Euler's inequality on the ratio of circumradius and inradius of a triangle. Using a generalization of the familiar fact in plane geometry, we prove also a new inequality for reciprocals of triangle areas formed by the sides of polygon A0A1…An-1 and by the sides and diagonals of inscribed polygon B0B1…Bn-1. We note that even in special cases when n=3 and n=4 the obtained results are new and interesting. At the end of the paper we prove a new inequality for quadrilaterals. ÜÇBUCAQ SAHƏLƏRINƏ AID YENI BƏRABƏRSIZLIKLƏR XÜLASƏ Məqalədə ABC üçbucağının daxilində götürülmüş M nöqtəsindən bu nöqtənin ΔABC-yə nəzərən Çevian üçbucağının tərəflərinə çəkilmiş paralel düz xəttlərin əmələ gətirdiyi üçbucaqların sahələri haqqında dəqiq bərabərsizlik isbat olunur. Gözlənilmədən, bu nəticə bizi, üçbucağın xaricinə və daxilinə çəkilmiş çevrələrin radiusları nisbəti haqqında olan Eyler bərabərsizliyinin yeni ümumiləşməsinə gətirir. Müstəvi həndəsəsindən məlum faktın ümumiləşməsini istifadə edərək, A0A1…An-1 çoxbucaqlısının tərəfləri və bu çoxbucaqlının daxilinə çəkilmiş B0B1…Bn-1 çoxbucaqlısının tərəfləri və diaqonallarının əmələ gətirdiyi üçbucaqların sahələrinin tərs qiymətləri haqqında yeni bərabərsizlik isbat olunur. Hətta n=3 və n=4 xüsusi hallarında da bu bərabərsizlik yeni və maraqlı nəticələrə gətirir. Məqalənin sonunda dördbucaqlılar üçün yeni bərabərsizlik isbat olunur. Açar sözlər: dəqiq bərabərsizlik, Çevian üçbucağı, ümumiləşmə, Eyler bərabərsizliyi, xaricə və daxilə çəkilmiş çevrələr, müstəvi həndəsəsi, üçbucağın sahəsi, tərs qiymət, çoxbucaqlı, dördbucaqlı.","authors":["Yagub Aliyev"],"meta":["January 2009","Project: Geometric Inequalities"],"references":["251764701_The_best_constant_for_an_algebraic_inequality","267467395_What_is_the_shape_of_a_triangle"]}