{"id":"333859642_A_perspective_on_inverse_design_of_battery_interphases_using_multi-scale_modelling_experiments_and_generative_deep_learning","abstract":"Understanding and controlling the complex and dynamic processes at battery interfaces holds the key to developing more durable and ultra high performance secondary batteries. Interfacial processes like dendrite and Solid Electrolyte Interphase (SEI) formation span numerous time- and length scales, and despite decades of research, their formation, composition,structure and function still pose a conundrum. Consequently, ”inverse design” of high-performance interfaces and interphases like the SEI, remains an elusive dream. Here, we present a perspective and possible blueprint for a future battery research strategy to reach this ambitious goal. Semi-supervised generative deep learning models trained on all sources of available data, i.e., extensive multi-fidelity datasets from multi-scale computer simulations and databases, operando characterization from large-scale research facilities, high-throughput synthesis and laboratory testing, need to work closely together to unlock this dream. We show how understanding and tracking different types of uncertainties in the experimental and simulation methods, as well as the machine learning framework for the generative model, is crucial for controlling and improving the fidelity in the predictive design of battery interfaces and interphases. We argue that simultaneous utilization of data from multiple domains, including data from failed experiments, will play a critical role in accelerating the development of reliable generative models to enable accelerated discovery and inverse design of durable ultra high performance batteries based on novel materials, structures and designs.","authors":["Arghya Bhowmik","Ivano E. Castelli","Juan María García-Lastra","Peter Bjørn Jørgensen"],"meta":["June 2019Energy Storage Materials 21","DOI:10.1016/j.ensm.2019.06.011"],"references":["332797515_Network_analysis_of_synthesizable_materials_discovery","332450049_Enabling_QM-accurate_simulation_of_dislocation_motion_in_g_-_Ni_and_a_-_Fe_using_a_hybrid_multiscale_approach","332327328_Genetic_algorithms_for_computational_materials_discovery_accelerated_by_machine_learning","331990949_Data-driven_prediction_of_battery_cycle_life_before_capacity_degradation","331686645_Boosting_Rechargeable_Batteries_RD_by_Multiscale_Modeling_Myth_or_Reality","331619571_Analyzing_machine_learning_models_to_accelerate_generation_of_fundamental_materials_insights","346415757_PubChemQC_PM6_Data_Sets_of_221_Million_Molecules_with_Optimized_Molecular_Geometries_and_Electronic_Properties","333368059_Adversarial_uncertainty_quantification_in_physics-informed_neural_networks","332596482_CLEASE_A_versatile_and_user-friendly_implementation_of_Cluster_Expansion_method","331996615_Autonomous_Molecular_Design_Then_and_Now"]}