{"id":"333830801_Inter-Intra_Information_Preserving_Attributed_Network_Embedding","abstract":"To alleviate the problem caused by the sparsity of network structure which is often the case in large-scale network, attributed network embedding has attracted an increasing amount of attention. Some existing attributed network embedding models integrate linkage structure and node attribute by adding a consistency criterion on the structure representation and attribute representation, whereby the similarity between them can be ensured. However, to enforce the structure and attribute representations to be similar may cause the information distortion due to the inherent difference between these two kinds of information. Additionally, the existing models mainly focus on learning the inter-relation between structure and attribute information, while the intra-characteristic of each information is ignored, leading to the information loss. To address the above two problems, we propose a novel model named Inter-Intra Information Preserving Attributed Network Embedding (IINE) to effectively learn the node representations of attributed network, which can not only capture the inter-relation between structure and attribute information with less information distortion but also effectively preserve the intra-characteristic of each information. The proposed model is composed of a primary model named coupled autoencoder and two auxiliary models named structure miner and attribute miner. The coupled autoencoder trains the node representation by smoothly combining both structure and attribute information, while the structure miner and attribute miner are utilized to further mine the intra-characteristic from the corresponding information so as to assist the primary model. The Extensive experiments are conducted on seven real-world datasets, and the results confirm the superior performance of IINE over several state-of-the-art models.","authors":["Kai Wang","Xu Lei","Ling Huang","Chang-Dong Wang"],"meta":["June 2019IEEE Access 7:1-1","DOI:10.1109/ACCESS.2019.2923451"],"references":["331184268_ABNE_An_Attention_Based_Network_Embedding_for_User_Alignment_Across_Social_Networks","330435834_An_Interpretable_and_Scalable_Recommendation_Method_Based_on_Network_Embedding","328176606_Deep_Network_Embedding_for_Graph_Representation_Learning_in_Signed_Networks","326502265_Content_to_Node_Self-Translation_Network_Embedding","326203987_Galaxy_Network_Embedding_A_Hierarchical_Community_Structure_Preserving_Approach","350961842_Attributed_Network_Embedding_with_Micro-Meso_Structure","331426802_Deep_Attributed_Network_Embedding_by_Preserving_Structure_and_Attribute_Information","331292206_Multi-Path_Relationship_Preserved_Social_Network_Embedding","331264799_Network_Embedding_via_Community_Based_Variational_Autoencoder","326202522_Deep_Attributed_Network_Embedding"]}