{"id":"333861305_Interventional_Fairness_Causal_Database_Repair_for_Algorithmic_Fairness","abstract":"Fairness is increasingly recognized as a critical component of machine learning systems. However, it is the underlying data on which these systems are trained that often reflect discrimination, suggesting a database repair problem. Existing treatments of fairness rely on statistical correlations that can be fooled by statistical anomalies, such as Simpson's paradox. Proposals for causality-based definitions of fairness can correctly model some of these situations, but they require specification of the underlying causal models. In this paper, we formalize the situation as a database repair problem, proving sufficient conditions for fair classifiers in terms of admissible variables as opposed to a complete causal model. We show that these conditions correctly capture subtle fairness violations. We then use these conditions as the basis for database repair algorithms that provide provable fairness guarantees about classifiers trained on their training labels. We evaluate our algorithms on real data, demonstrating improvement over the state of the art on multiple fairness metrics proposed in the literature while retaining high utility.","authors":["Babak Salimi","Luke Rodriguez","Bill Howe","Dan Suciu"],"meta":["June 2019","DOI:10.1145/3299869.3319901","Conference: the 2019 International Conference","Project: Algorithmic Fairness"],"references":["325374285_Bias_in_OLAP_Queries_Detection_Explanation_and_Removal","325090722_Provenance_Analysis_for_Missing_Answers_and_Integrity_Repairs","324600593_Counterfactual_Fairness","339315749_Computing_Optimal_Repairs_for_Functional_Dependencies","330297186_Fairness_in_Relational_Domains","326051396_Fairness_definitions_explained","325867269_Bias_detectives_the_researchers_striving_to_make_algorithms_fair","325161360_Computing_Optimal_Repairs_for_Functional_Dependencies","324679806_Fairness_and_Accountability_Design_Needs_for_Algorithmic_Support_in_High-Stakes_Public_Sector_Decision-Making","324600594_When_Worlds_Collide_Integrating_Different_Counterfactual_Assumptions_in_Fairness"]}