{"id":"333863387_Performance_farmer_perception_and_the_routinisation_RO_moderation_on_ERP_post-implementation","abstract":"This study discusses the perceptions of the routinisation effects on the post-implementation and post-adoption of the enterprise resource planning (ERP) in farms. A theoretical model and nine hypotheses were proposed using factors according to the literature of resource-based view (RBV) approach and on the ERP impact on farm performance perceptions. This study contributes to the literature by testing empirically the moderation effect of routinisation on the RBV. A qualitative interview was applied to larger farmers where ERP was already in use and for the quantitative approach a sample of 448 answers was collected composed of 74% grain farmers, 14% cattle raising and milk producers, and 13% sugar cane and fruits farmers. The results reveal that the model explains 63% of the variation in the impact on farm performance. Our results show that routinisation moderates only the relationship between the impact on internal operations with impact on farm performance. The conclusions confirm the necessity to expand the RBV approach to the farmer perceptions, exploring other factors like the benefits and the impact of natural resources in the routinisation process. Finally, we propose a discussion of the development of Agriculture 4.0 in a resource-based view for the development of competitive advantage in the context of farms. Keyword: Agriculture","authors":["Caetano Haberli Junior","Tiago Oliveira","Mitsuru Higuchi Yanaze","Eduardo Eugênio Spers"],"meta":["June 2019Heliyon 5(6):e01784","DOI:10.1016/j.heliyon.2019.e01784"],"references":["333243513_Effect_of_Enterprise_Resource_Planning_Systems_and_Forms_of_Management_Control_on_Firm's_Competitive_Advantage","331432335_Effect_of_Enterprise_Resource_Planning_Systems_and_Forms_of_Management_Control_on_Firm's_Competitive_Advantage","318649781_Business_models_and_dynamic_capabilities","318217217_Absorptive_Capacity_and_ERP_Assimilation_The_Influence_of_Company-Ownership","317319880_Next_generation_agricultural_system_models_and_knowledge_products_Synthesis_and_strategy","324868210_Digital_Supply_Chain_Literature_review_and_a_proposed_framework_for_future_research","320457773_Understanding_the_determinants_of_adoption_of_enterprise_resource_planning_ERP_technology_within_the_agrifood_context_The_case_of_the_Midwest_of_Brazil","320248917_A_Conceptual_Framework_for_Modeling_and_Design_of_Cyber-Physical_Systems","319882451_Surrendering_Control_to_Gain_Advantage_Reconciling_Openness_and_the_Resource-based_View_of_the_Firm","318444701_Knowledge_management_and_ERP_Complementary_or_contradictory"]}