{"id":"333878736_Articulo_Original_Como_perfeccionar_el_proceso_de_ensenanza_y_aprendizaje_de_la_programacion_en_carreras_de_ingenieria_How_to_improve_the_teaching_and_learning_of_programming_in_engineering_careers_Es","abstract":"Resumen El objetivo del presente trabajo está relacionado con el perfeccionamiento del proceso de enseñanza-aprendizaje (PEA) de la asignatura de Programación en las carreras de Ingeniería Industrial e Informática que se desarrollan en la Universidad Tecnológica de La Habana José Antonio Echeverría. Los principales resultados se enmarcan en la sistematización de un grupo de reflexiones que enriquecen la didáctica del PEA. La elaboración de sistemas de acciones para la adquisición de conocimientos, desarrollo de habilidades y formación de valores en los estudiantes de Ingeniería Industrial e Informática, a través del proceso de enseñanza-aprendizaje de la Programación constituye en sí misma una labor compleja y necesaria, encaminada a la formación profesional del futuro ingeniero. Estas acciones requieren de la praxis, que garantice los niveles de asimilación del estudiante por lo que deben transitar desde la familiarización con el contenido, la reproducción, aplicación y creación. Además, envuelven contenidos relacionados con el lenguaje algorítmico, elementos del lenguaje de Programación, dominio de la interfaz del lenguaje de programación, solución de problemas mediante el lenguaje de programación y la realización del proyecto por parte de los estudiantes. Abstract The objective of this work is related to the improvement of the teaching-learning process (PEA) of the subject of Programming in the Industrial Engineering and Computer Science courses that take place in the Technological University of the Havana José Antonio Echeverría. The main results are framed in the systematization of a group of reflections that enrich the teaching of the PEA. The elaboration of systems of actions for the acquisition of knowledge, development of skills and formation of values in the students of Industrial Engineering and Computer Science, through the teaching-learning process of the Programming constitutes in itself a complex and necessary task, directed to the professional training of the future engineer. These actions require praxis to guarantee","authors":["Juan Carlos Fonden Calzadilla","Rolando Serra Toledo"],"meta":["April 2018","Project: Concepción de orientación educativa universitaria integradora de los procesos sustantivos para estudiantes de carreras de ingeniería."],"references":["345345684_TAREAS_DOCENTES_INTEGRADORAS_EN_LA_FISICA_ESCOLAR","312894162_LOGICA_ALGORITMICA_PARA_LA_RESOLUCION_DE_PROBLEMAS_DE_PROGRAMACION_COMPUTACIONAL_UNA_PROPUESTA_DIDACTICA","280762128_Estrategias_de_aprendizaje_Funcion_y_diagnostico_en_el_aprendizaje_adolescente","347335602_Una_experiencia_para_fortalecer_los_procesos_de_ensenanza_de_la_programacion_mediante_el_uso_de_entornos_virtuales_de_aprendizaje","284883913_El_estudio_de_las_buenas_practicas_docentes_en_la_ensenanza_universitaria"]}