{"id":"333838374_Cognitive_Network_Science_A_Review_of_Research_on_Cognition_through_the_Lens_of_Network_Representations_Processes_and_Dynamics","abstract":"Network science provides a set of quantitative methods to investigate complex systems, including human cognition. Although cognitive theories in different domains are strongly based on a network perspective, the application of network science methodologies to quantitatively study cognition has so far been limited in scope. This review demonstrates how network science approaches have been applied to the study of human cognition and how network science can uniquely address and provide novel insight on important questions related to the complexity of cognitive systems and the processes that occur within those systems. Drawing on the literature in cognitive network science, with a focus on semantic and lexical networks, we argue three key points. (i) Network science provides a powerful quantitative approach to represent cognitive systems. (ii) The network science approach enables cognitive scientists to achieve a deeper understanding of human cognition by capturing how the structure, i.e., the underlying network, and processes operating on a network structure interact to produce behavioral phenomena. (iii) Network science provides a quantitative framework to model the dynamics of cognitive systems, operationalized as structural changes in cognitive systems on different timescales and resolutions. Finally, we highlight key milestones that the field of cognitive network science needs to achieve as it matures in order to provide continued insights into the nature of cognitive structures and processes.","authors":["Cynthia Siew","Dirk Wulff","Nicole M. Beckage","Yoed Nissan Kenett"],"meta":["June 2019Complexity 2019(5915):1-24","DOI:10.1155/2019/2108423","Project: The Aging Lexicon"],"references":["334276524_New_Perspectives_on_the_Aging_Lexicon","332912601_New_perspectives_on_the_aging_lexicon","331441307_The_phonographic_language_network_Using_network_science_to_investigate_the_phonological_and_orthographic_similarity_structure_of_language","331240372_spreadr_An_R_package_to_simulate_spreading_activation_in_a_network","327511572_Filling_gaps_in_early_word_learning","332862957_Scale-free_networks_in_phonological_and_orthographic_wordform_lexicons","331303638_A_Semantic_Network_Cartography_of_the_Creative_Mind","331301923_A_Dopaminergic_Basis_for_Fear_Extinction","330485200_NetworkToolbox_Methods_and_Measures_for_Brain_Cognitive_and_Psychometric_Network_Analysis_in_R","328457453_Using_network_science_to_analyze_concept_maps_of_psychology_undergraduates"]}