{"id":"333859301_A_question_of_trust_Can_we_build_an_evidence_base_to_gain_trust_in_systematic_review_automation_technologies","abstract":"Background: \nAlthough many aspects of systematic reviews use computational tools, systematic reviewers have been reluctant to adopt machine learning tools.\n\nDiscussion: \nWe discuss that the potential reason for the slow adoption of machine learning tools into systematic reviews is multifactorial. We focus on the current absence of trust in automation and set-up challenges as major barriers to adoption. It is important that reviews produced using automation tools are considered non-inferior or superior to current practice. However, this standard will likely not be sufficient to lead to widespread adoption. As with many technologies, it is important that reviewers see \"others\" in the review community using automation tools. Adoption will also be slow if the automation tools are not compatible with workflows and tasks currently used to produce reviews. Many automation tools being developed for systematic reviews mimic classification problems. Therefore, the evidence that these automation tools are non-inferior or superior can be presented using methods similar to diagnostic test evaluations, i.e., precision and recall compared to a human reviewer. However, the assessment of automation tools does present unique challenges for investigators and systematic reviewers, including the need to clarify which metrics are of interest to the systematic review community and the unique documentation challenges for reproducible software experiments.\n\nConclusion: \nWe discuss adoption barriers with the goal of providing tool developers with guidance as to how to design and report such evaluations and for end users to assess their validity. Further, we discuss approaches to formatting and announcing publicly available datasets suitable for assessment of automation technologies and tools. Making these resources available will increase trust that tools are non-inferior or superior to current practice. Finally, we identify that, even with evidence that automation tools are non-inferior or superior to current practice, substantial set-up challenges remain for main stream integration of automation into the systematic review process.","authors":["Annette M. O’Connor","Guy Tsafnat","James Thomas","Paul Glasziou"],"meta":["June 2019Systematic Reviews 8(1)","DOI:10.1186/s13643-019-1062-0"],"references":["331650688_Enslaved_to_the_Trapped_Data_A_Cognitive_Work_Analysis_of_Medical_Systematic_Reviews","322465646_Reproducible_research_in_linguistics_A_position_statement_on_data_citation_and_attribution_in_our_field","318863233_Use_and_Impacts_of_Campbell_Systematic_Reviews_on_Policy_Practice_and_Research","316953815_Primer_on_systematic_reviews_in_toxicology","314107862_Analysis_of_the_time_and_workers_needed_to_conduct_systematic_reviews_of_medical_interventions_using_data_from_the_PROSPERO_registry","318372509_Reproducibility_of_Studies_on_Text_Mining_for_Citation_Screening_in_Systematic_Reviews_Evaluation_and_Checklist","318222194_Vision_for_SLR_Tooling_Infrastructure_Prioritizing_Value-Added_Requirements","318014357_Diffusion_of_Innovations","317568848_Computer-Aided_Systematic_Review_Screening_Comes_of_Age","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology"]}