{"id":"333826796_The_concept_of_computational_thinking_toward_information_and_communication_technology_learning","abstract":"Computational thinking is a process of problems solving and designing systems using concepts in computer science. Computational thinking is based on a computational principle that involves a wide range of approaches and skills with applications in several disciplines. Computational thinking has been widely applied in the curriculum of various levels of education while still basing on the principles and characteristics of a strong computational thinking. To train the computational thinking to students it must include the computational thinking material in the compulsory material. This material needs to be held since the level of basic education with a simple problem level, the level of the material will increase along with the increase of education level. This article discusses the implementation of computational thinking on information and communication technology learning using a simple programming language that is Scratch. This programming language will make it easier for students to understand the concept of programming by using blocks so that students will easily learn. As a basis for information and communication technology learning, a measurement scale has been developed to measure students’ computational thinking ability. Computational thinking uses a five-point Likert scale consisting of 29 items from 5 developed indicators.","authors":["R Harimurti","Ekohariadi Ekohariadi","Munoto Munoto","Asto Buditjahjanto"],"meta":["June 2019IOP Conference Series Materials Science and Engineering 535(1):012004","DOI:10.1088/1757-899X/535/1/012004"],"references":["319171932_The_Essence_of_Computational_Thinking","274309848_Computational_Thinking","220808343_A_framework_for_computational_thinking_across_the_curriculum","220420371_Computational_thinking","308840959_Computational_Thinking_Curriculum_for_K-12_Education_--_A_Delphi_Survey","308654282_Which_cognitive_abilities_underlie_computational_thinking_Criterion_validity_of_the_Computational_Thinking_Test","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12","220426836_Great_Principles_of_Computing"]}