{"id":"333835995_Investigating_the_Randomness_of_Passengers'_Seating_Behavior_in_Suburban_Trains","abstract":"In pedestrian dynamics, individual-based models serve to simulate the behavior of crowds so that evacuation times and crowd densities can be estimated or the efficiency of public transportation optimized. Often, train systems are investigated where seat choice may have a great impact on capacity utilization, especially when passengers get in each other’s way. Therefore, it is useful to reproduce passengers’ behavior inside trains. However, there is surprisingly little research on the subject. Do passengers distribute evenly as it is most often assumed in simulation models and as one would expect from a system that obeys the laws of thermodynamics? Conversely, is there a higher degree of order? To answer these questions, we collect data on seating behavior in Munich’s suburban trains and analyze it. Clear preferences are revealed that contradict the former assumption of a uniform distribution. We subsequently introduce a model that matches the probability distributions we observed. We demonstrate the applicability of our model and present a qualitative validation with a simulation example. The model’s implementation is part of the free and open-source Vadere simulation framework for pedestrian dynamics and thus available for further studies. The model can be used as one component in larger systems for the simulation of public transport.","authors":["Jakob Johann Schöttl","Michael J. Seitz","Gerta Köster"],"meta":["June 2019Entropy 21(6):600","DOI:10.3390/e21060600"],"references":["335686825_Vadere_An_Open-Source_Simulation_Framework_to_Promote_Interdisciplinary_Understanding","327712461_A_parallel_generator_for_sparse_unstructured_meshes_to_solve_the_eikonal_equation","335332542_Walking_on_stairs_Experiment_and_model","324230700_Geometric_constraint_based_pedestrian_movement_model_on_stairways","318220606_Crowd_behaviour_and_motion_Empirical_methods","315809377_PdeVis_Pedestrian_Flow_Visualisations","311568793_How_Do_People_Queue_A_Study_of_Different_Queuing_Models","311568107_Is_Slowing_Down_Enough_to_Model_Movement_on_Stairs","307875448_How_cognitive_heuristics_can_explain_social_interactions_in_spatial_movement","306038976_Simulating_pedestrian_dynamics_Towards_natural_locomotion_and_psychological_decision_making"]}