{"id":"333872849_Technology_is_a_tool_for_Learning_Voices_of_Teachers_and_Parents_of_Young_Children","abstract":"Education in early years is becoming challenging to inculcate the best practices with specific\nsupport and demand to meet the global initiatives (Beckley, 2011). In this regard, teaching through technology\nplays a significant role if it is connected with relevant learning experiences (Willis, Weiser, & Kirkwood,\n2014). The students are exposed to a technologically rich environment through positive and consistent patterns\nin their learning experiences, it helps them in their cognitive development. Within the context of Pakistan,\none thing commonly observed is the misuse of technology and lack of guidance provided by their parents\nto the young children. This study helps to understand the perspectives of parents and teachers regarding the\napplication of technology- based teaching and their observation to this approach. Interviews and observations\nthrough qualitative research method helped to understand how people comprehend their experiences in\nrelation to the use of technology with early year children and what meanings they derive from their personal\nexperiences (Merriam, 1998). The outcomes of this research informed that parents and teachers highly recommended\ntechnology use in classrooms as the source to develop 21st century skills; technology allows children\nto get the accessibility of multiple resources; become multi tasked, develop the level of communication skills\nthrough which they can connect themselves to the world; readiness to learn new concepts; motivates in reading\nthrough visual learning; helps in understanding complex concepts and retain information for a longer time.\nRole of schools in promoting technology-based teaching in early year classroom highlighted as minimizing\nthe gap of resource allocation through providing sufficient technology-based resources to the students through\nwhich many learning opportunities will be given to the students to become effective learner and developing\nways of assessment for effective learning. Some of the challenges informed by the participants with the use of\ntechnology are eye sight issue due to access use and students’ lack of interest towards book reading.","authors":["Shahnaz Pirani","Nasreen Hussain"],"meta":["March 2019Journal of Education & Social Sciences 7(1):55-66","DOI:10.20547/jess0711907105"],"references":["314980745_Perceptions_of_Teachers_Regarding_Technology_Integration_in_Classrooms_A_Comparative_Analysis_of_Elite_and_Mediocre_Schools","299999649_Child_Temperamental_Regulation_and_Classroom_Quality_in_Head_Start_Considering_the_Role_of_Cumulative_Economic_Risk","287580318_Critical_Analysis_of_the_Problems_of_Education_in_Pakistan_Possible_Solutions","279552001_Meeting_the_Digital_Natives_Understanding_the_acceptance_of_technology_in_classrooms","332802800_Rethinking_ECE_in_Pakistan","317953471_Qualitative_Research_and_Case_Study_Applications_In_Education","306123323_Grounded_theory_mixed_methods_and_action_research","298109745_Dissolving_the_line_between_assessment_and_teaching","288185578_E-inclusion_in_early_french_immersion_classrooms_Using_digital_technologies_to_support_inclusive_practices_that_meet_the_needs_of_all_learners","280447608_Individual_differences_in_effects_of_child_care_quality_The_role_of_child_affective_self-regulation_and_gender"]}