{"id":"333838579_Effective_Analysis_of_Lung_Infection_using_Fuzzy_Rules","abstract":"!--[if gte mso 9]> Soft Computing is conglomerate of methodologies which works together and provides an ability to make a decision from reliable data or expert’s experience. Nowadays different types of soft computing techniques such as neural network, fuzzy logic, genetic algorithm and hybrid system are largely used in medical areas. In this paper, an algorithm for analysis of lung infection is presented. The main focus is to develop system architecture to find probable disease stage patient may have. Severity level of disease is determined by using rule base method. The algorithm uses an output of Rulebase entered by the user to determine a level of infection. <!--[if gte mso 9]> Soft Computing is conglomerate of methodologies which works together and provides an ability to make decision from reliable data or expert’s experience. Nowadays different types of soft computing techniques such as neural network, fuzzy logic, genetic algorithm and hybrid system are largely used in medical areas. In this paper, algorithm for analysis of lung infection is presented. The main focus is to develop system architecture to find probable disease stage patient may have. Severity level of disease is determined by using rule base method. The algorithm uses output of Rulebase entered by user to determine level of infection. </div","authors":["Navneet Walia","Harsukhpreet Singh","Anurag Sharma"],"meta":["August 2016","DOI:10.11591/ijai.v5.i2.pp55-63"],"references":["335977736_Diagnostics_Decision_Support_System_for_Tuberculosis_using_Fuzzy_Logic'","274173903_Decision_Support_System_for_the_Intelligient_Identification_of_Alzheimer_using_Neuro_Fuzzy_logic","266452524_Enhanced_Fuzzy_Rule_Based_Diagnostic_Model_for_Lung_Cancer_using_Priority_Values","265510000_A_Fuzzy_Inference_System_for_Assessment_of_the_Severity_of_the_Peptic_Ulcers","265315369_Development_of_Neuro-fuzzy_System_for_Early_Prediction_of_Heart_Attack","260845113_A_Proposed_Fuzzy_Framework_for_Cholera_Diagnosis_and_Monitoring","286363152_Design_and_implementation_of_a_fuzzy_expert_system_for_detecting_and_estimating_the_level_of_Asthma_and_chronic_obstructive_pulmonary_disease","284489728_Applications_of_Fuzzy-Neural_and_FPGA_For_Prediction_of_Various_Diseases-_A_Survey","260347495_A_Decision_Support_System_for_Tuberculosis_Diagnosis","240915129_An_adaptive_neuro-fuzzy_model_for_prediction_of_student's_academic_performance"]}