{"id":"333804824_A_Case_Study_on_Computational_Hermeneutics_E_J_Lowe's_Modal_Ontological_Argument","abstract":"Computers may help us to better understand (not just verify) arguments. In this article we defend this claim by showcasing the application of a new, computer-assisted interpretive method to an exemplary natural-language argument with strong ties to metaphysics and religion: E. J. Lowe’s modern variant of St. Anselm’s ontological argument for the existence of God. Our new method, which we call computational hermeneutics, has been particularly conceived for use in interactive-automated proof assistants. It aims at shedding light on the meanings of words and sentences by framing their inferential role in a given argument. By employing automated theorem reasoning technology within interactive proof assistants, we are able to drastically reduce (by several orders of magnitude) the time needed to test the logical validity of an argument’s formalization. As a result, a new approach to logical analysis, inspired by Donald Davidson’s account of radical interpretation, has been enabled. In computational hermeneutics, the utilization of automated reasoning tools effectively boosts our capacity to expose the assumptions we indirectly commit ourselves to every time we engage in rational argumentation and it fosters the explicitation and revision of our concepts and commitments.","authors":["David Fuenmayor","Christoph Benzmüller"],"meta":["October 2018Journal of Applied Logic 5(7)","Project: Universal Logical Reasoning"],"references":["319998853_Adequate_Formalization","318036219_Automating_Emendations_of_the_Ontological_Argument_in_Intensional_Higher-Order_Modal_Logic","317956529_Types_Tableaus_and_Godel's_God_in_IsabelleHOL","344083241_Saving_belief_on_the_new_materialism_in_religious_studies","339827448_Reconstructing_Arguments_-_Formalization_and_Reflective_Equilibrium","332870016_A_new_modal_version_of_the_ontological_argument","324285865_Considered_Judgment","320182185_Essays_on_Actions_and_Events_Philosophical_Essays","318836130_Reflective_Equilibrium_and_the_Principles_of_Logical_Analysis_Understanding_the_Laws_of_Logic","316666306_Inferentialism_Why_rules_matter"]}