{"id":"333800532_A_review_of_entropy_measures_for_uncertainty_quantification_of_stochastic_processes","abstract":"Entropy is originally introduced to explain the inclination of intensity of heat, pressure, and density to gradually disappear over time. Based on the concept of entropy, the Second Law of Thermodynamics, which states that the entropy of an isolated system is likely to increase until it attains its equilibrium state, is developed. More recently, the implication of entropy has been extended beyond the field of thermodynamics, and entropy has been applied in many subjects with probabilistic nature. The concept of entropy is applicable and useful in characterizing the behavior of stochastic processes since it represents the uncertainty, ambiguity, and disorder of the processes without being restricted to the forms of the theoretical probability distributions. In order to measure and quantify the entropy, the existing probability of every event in the stochastic process must be determined. Different entropy measures have been studied and presented including Shannon entropy, Renyi entropy, Tsallis entropy, Sample entropy, Permutation entropy, Approximate entropy, and Transfer entropy. This review surveys the general formulations of the uncertainty quantification based on entropy as well as their various applications. The results of the existing studies show that entropy measures are powerful predictors for stochastic processes with uncertainties. In addition, we examine the stochastic process of lithium-ion battery capacity data and attempt to determine the relation between the changes in battery capacity over different cycles and two entropy measures: Sample entropy and Approximate entropy.","authors":["Alireza Namdari","Zhaojun Li"],"meta":["June 2019Advances in Mechanical Engineering 11(6):168781401985735","DOI:10.1177/1687814019857350"],"references":["319664294_Use_of_Mutual_Information_and_Transfer_Entropy_to_Assess_Interaction_between_Parasympathetic_and_Sympathetic_Activities_of_Nervous_System_from_HRV","346670834_Introduction_to_Econophysics_Correlations_and_Complexity_in_Finance","344713686_An_Introduction_to_the_Bootstrap","330550658_The_effective_entropy_of_nextprevious_largersmaller_value_queries","328294710_Probability_in_quantum_theory","328234068_Computation_and_multiplicity_of_economic_equilibria","327368777_Jitters_through_dual_clocks_An_effective_Entropy_Source_for_True_Random_Number_Generation","317723547_Volatility_estimation_for_Bitcoin_A_comparison_of_GARCH_models","314441873_The_world_according_to_Rnyi_thermodynamics_of_multifractal_systems","305974436_Approximate_entropy_for_testing_randomness"]}