{"id":"333806280_Probabilistic_Models_of_Larval_Zebrafish_Behavior_Structure_on_Many_Scales","abstract":"Nervous systems have evolved to combine environmental information with internal state to select and generate adaptive behavioral sequences. To better understand these computations and their implementation in neural circuits, natural behavior must be carefully measured and quantified. Here, we collect high spatial resolution video of single zebrafish larvae swimming in a naturalistic environment and develop models of their action selection across exploration and hunting. Zebrafish larvae swim in punctuated bouts separated by longer periods of rest called interbout intervals. We take advantage of this structure by categorizing bouts into discrete types and representing their behavior as labeled sequences of bout-types emitted over time. We then construct probabilistic models - specifically, marked renewal processes - to evaluate how bout-types and interbout intervals are selected by the fish as a function of its internal hunger state, behavioral history, and the locations and properties of nearby prey. Finally, we evaluate the models by their predictive likelihood and their ability to generate realistic trajectories of virtual fish swimming through simulated environments. Our simulations capture multiple timescales of structure in larval zebrafish behavior and expose many ways in which hunger state influences their action selection to promote food seeking during hunger and safety during satiety.","authors":["Robert Evan Johnson","Scott Linderman","Thomas Panier","Caroline Lei Wee"],"meta":["June 2019","DOI:10.1101/672246"],"references":["336632330_A_bidirectional_network_for_appetite_control_in_larval_zebrafish","329199194_The_NIH_BRAIN_Initiative_Advancing_neurotechnologies_integrating_disciplines","318849724_Probabilistic_models_of_individual_and_collective_animal_behavior","316876177_Whole-brain_serial-section_electron_microscopy_in_larval_zebrafish","316309947_Activation_of_the_hypothalamic_feeding_centre_upon_visual_prey_detection","314437472_Discrete_modes_of_social_information_processing_predict_individual_behavior_of_fish_in_a_group","333409915_A_Cellular-Resolution_Atlas_of_the_Larval_Zebrafish_Brain","324791288_Single-cell_reconstruction_of_developmental_trajectories_during_zebrafish_embryogenesis","322258507_Structure_of_the_Zebrafish_Locomotor_Repertoire_Revealed_with_Unsupervised_Behavioral_Clustering","319770124_Deep_Predictive_Coding_Networks_for_Video_Prediction_and_Unsupervised_Learning"]}