{"id":"333838071_Personalized_Scientific_Paper_Recommendation_Based_on_Heterogeneous_Graph_Representation","abstract":"The accelerating rate of scientific publications makes it extremely difficult for researchers to find out the relevant papers and related works. Recommender systems that aim at solving the information overload problem have attracted lots of attention. However, existing paper recommendation works generally rely on the simple citation-ships between papers, which ignore the heterogeneity of the academic graphs. In this paper, we solve the personalized paper recommendation problem in the setting of heterogeneous information networks. A heterogeneous graph representation based recommendation method named HGRec is proposed. First, the author and paper profiles are constructed based on the extracted contents information. Second, we initialize the node vectors by employing the word-embedding technique. Third, we jointly update the node embeddings in the heterogeneous graph by proposing two meta-path based proximity measures. Finally, the paper recommendation is completed by calculating the similarity of the generated author and paper feature vectors. We present experiments on a real academic network, the DBLP network. The comparative results demonstrate the effectiveness of the proposed personalized recommendation approach compared to state-of-the-art methods.","authors":["Xiao Ma","Ranran Wang"],"meta":["June 2019IEEE Access 7:1-1","DOI:10.1109/ACCESS.2019.2923293"],"references":["330077673_Scientific_Paper_Recommendation_A_Survey","327866689_Newly_Published_Scientific_Papers_Recommendation_in_Heterogeneous_Information_Networks","327291144_CrossRec_Cross-Domain_Recommendations_Based_on_Social_Big_Data_and_Cognitive_Computing","321374788_Heterogeneous_Information_Network_Embedding_for_Recommendation","328617408_Learning_to_Adaptively_Rank_Document_Retrieval_System_Configurations","325864973_EARS_Emotion-Aware_Recommender_System_Based_on_Hybrid_Information_Fusion","324767698_Deep_sentiment_hashing_for_text_retrieval_in_social_CIoT","322947245_On_Power_Law_Growth_of_Social_Networks","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319163982_Neural_Factorization_Machines_for_Sparse_Predictive_Analytics"]}