{"id":"333973769_Representation_of_NURBS_surfaces_by_Controlled_Iterated_Functions_System_automata","abstract":"Iterated Function Systems (IFS) are a standard tool to generate fractal shapes. In a more general way, they can represent most of standard surfaces like Bézier or B-Spline surfaces known as self-similar surfaces. Controlled Iterated Function Systems (CIFS) are an extension of IFS based on automata. CIFS are basically multi-states IFS, they can handle all IFS shapes but can also manage multi self-similar shapes. For example CIFS can describe subdivision surfaces around extraordinary vertices whereas IFS cannot. Having a common CIFS formalism facilitates the development of generic methods to manage interactions (junctions, differences...) between objects of different natures.\n\nThis work focuses on a CIFS approach of Non-Uniform Rational B-Splines (NURBS) which are the main used representation of surfaces in CAGD systems. By analyzing the recursive generating process of basis functions, we prove the stationarity of NURBS computation. This implies that NURBS can be represented as a finite automaton: a CIFS. Subdivision transformations implied in the generating process are directly deduced from blossoming formulation and are expressed as a function of the initial nodal vector. We provide a method to construct the CIFS automata for NURBS of any-degree. Then NURBS-surfaces automata are deduced using a “tensor-product” of NURBS automata. This new representation of NURBS allows us to build a bridge between them and other surfaces already represented in CIFS formalism: fractals and subdivision surfaces.","authors":["Lucas Morlet","Christian Gentil","Sandrine Lanquetin","Marc Neveu"],"meta":["June 2019Computers & Graphics","DOI:10.1016/j.cagx.2019.100006","Project: PhD Thesis : Elaboration of multi-representation geometric model"],"references":["326917042_Barycentric_Combinations_Based_Subdivision_Shaders","221316579_Subdivision_Schemes_and_Attractors","220183413_NURBS_with_Extraordinary_Points_High-degree_Non-uniform_Rational_Subdivision_Schemes","270254815_Fractals_Everywhere","265782502_The_algorithmic_beauty_of_plants_With_James_S_Hanan_F_David_Fracchia_Deborah_R_Fowler_Martin_J_M_de_Boer_Lynn_Mercer","265718761_Joining_PrimalDual_Subdivision_Surfaces","239601715_Fractals_and_Self-Similarity","220695846_The_Beauty_of_Fractals_Images_of_Complex_Dynamical_Systems","220507695_Fractal_Modeling_using_Free_Form_Techniques","220184484_Extended_subdivision_surfaces_Building_a_bridge_between_NURBS_and_Catmull-Clark_surfaces"]}