{"id":"333906955_Enhanced_Conformal_Perfectly_Matched_Layers_for_Bernstein-Bezier_Finite_Element_Modelling_of_Short_Wave_Scattering","abstract":"The aim of this paper is to accurately solve short wave scattering problems governed by the Helmholtz equation using the Bernstein-Bézier Finite Element method (BBFEM), combined with a conformal perfectly matched layer (PML). Enhanced PMLs, where curved geometries are represented by means of the blending map method of Gordon and Hall, are numerically investigated. In particular, the performance of radial and elliptical shaped PMLs, with a parabolic absorption function, are assessed and compared in terms of accuracy against second order Bayliss-Gunzburge-Turkel (BGT_2) based local absorbing boundary conditions. Numerical results dealing with problems of Hankel source radiation and wave scattering by a rigid cylinder show that the radial shaped PML, with the h and p versions of BBFEM, enables the recovery of the predicted algebraic and exponential convergence rates of a high order finite element method (FEM). Furthermore, radial shaped BGT_2 and PML have a similar performance, as long as the wave is not sufficiently well resolved. But, BGT_2 performs poorly as the wave resolution increases. Additionally, the effect of harmonics of higher modes on accuracy is examined. The study reveals that the PML outperforms BGT_2 for almost all propagating modes. However, a similar performance is achieved with both methods either with higher modes or a low wave resolution. Results from a multiple scattering benchmark problem provide evidence of the good performance of the proposed PMLs and the benefit of elliptical shaped PMLs in reducing significantly the size of the computational domain, without altering accuracy. The choice of the PML parameters ensuring optimal performance is also discussed.","authors":["Abdellah El Kacimi","Omar Laghrouche","D. Ouazar","M Shadi Mohamed"],"meta":["June 2019Computer Methods in Applied Mechanics and Engineering","DOI:10.1016/j.cma.2019.06.032","Project: Adaptive Bernstein-Bézier FEs for surface-water waves modelling"],"references":["325901520_Parallel_Ellipsoidal_Perfectly_Matched_Layers_for_Acoustic_Helmholtz_Problems_on_Exterior_Domains","318066371_High-order_finite_elements_for_the_solution_of_Helmholtz_problems","327438082_Bernstein_-_Bezier_based_finite_elements_for_efficient_solution_of_short_wave_problems","326472769_High-order_2D_mesh_curving_methods_with_a_piecewise_linear_target_and_application_to_Helmholtz_problems","313755817_A_new_finite_element_realization_of_the_perfectly_matched_layer_method_for_Helmholtz_scattering_problems_on_polygonal_domains_in_two_dimensions","313007337_Diffraction_and_refraction_of_surface_waves_using_finite_and_infinite_elements","312558136_Perfectly_matched_layers_for_convex_truncated_domains_with_discontinuous_Galerkin_time_domain_simulations","311744079_Acoustics_An_Introduction_to_Its_Physical_Principles_and_Applications","309715195_The_Double_Absorbing_Boundary_method_for_a_class_of_anisotropic_elastic_media","303655108_A_comparison_of_high-order_polynomial_and_wave-based_methods_for_Helmholtz_problems"]}