{"id":"333935830_Using_DeepLabCut_for_3D_markerless_pose_estimation_across_species_and_behaviors","abstract":"Noninvasive behavioral tracking of animals during experiments is critical to many scientific pursuits. Extracting the poses of animals without using markers is often essential to measuring behavioral effects in biomechanics, genetics, ethology, and neuroscience. However, extracting detailed poses without markers in dynamically changing backgrounds has been challenging. We recently introduced an open-source toolbox called DeepLabCut that builds on a state-of-the-art human pose-estimation algorithm to allow a user to train a deep neural network with limited training data to precisely track user-defined features that match human labeling accuracy. Here, we provide an updated toolbox, developed as a Python package, that includes new features such as graphical user interfaces (GUIs), performance improvements, and active-learning-based network refinement. We provide a step-by-step procedure for using DeepLabCut that guides the user in creating a tailored, reusable analysis pipeline with a graphical processing unit (GPU) in 1–12 h (depending on frame size). Additionally, we provide Docker environments and Jupyter Notebooks that can be run on cloud resources such as Google Colaboratory. This protocol describes how to use an open-source toolbox, DeepLabCut, to train a deep neural network to precisely track user-defined features with limited training data. This allows noninvasive behavioral tracking of movement.","authors":["Tanmay Nath","Alexander Mathis","An Chi Chen","Amir Patel"],"meta":["June 2019Nature Protocols 14(3):1","DOI:10.1038/s41596-019-0176-0"],"references":["329811716_Fast_animal_pose_estimation_using_deep_neural_networks","329185962_Using_DeepLabCut_for_3D_markerless_pose_estimation_across_species_and_behaviors","328623563_On_the_inference_speed_and_video-compression_robustness_of_DeepLabCut","327118969_DeepLabCut_markerless_pose_estimation_of_user-defined_body_parts_with_deep_learning","327118965_Behavioral_tracking_gets_real","340180048_Statsmodels_Econometric_and_Statistical_Modeling_with_Python","340177686_Data_Structures_for_Statistical_Computing_in_Python","329728559_Stabilizing_Speech_Production_through_Gesture-Speech_Coordination","328767794_Magnetoelectric_materials_for_miniature_wireless_neural_stimulation_at_therapeutic_frequencies","327483010_Deep_learning_in_biomedicine"]}