{"id":"333974225_Access_Control_Approaches_in_Internet_of_Things","abstract":"The Internet of Things is a rapidly growing concept in recent years. Safety and security have traditionally been distinct problems in engineering and computer science. With a massive amount of devices connected to the Internet and huge data associated in it, there is major concern of security of services. Many traditional security solutions including existing access control mechanisms may not be directly applicable in the IoT environment. Traditional access control approaches are not suitable to the decentralized and dynamic scenario in IoT as well. Various cryptographic algorithms developed which addresses security in Internet, but their use in IOT is questionable as the hardware devices used deal in IOT is not suitable for computationally expensive encryption algorithms. Particularly, the need arises for a dynamic and fine-grained access control algorithm on constrained resources. The paper summaries access control approaches that try to improve security in devices. Paper not only summarizes access control approaches, but also provides an understanding of the limitations and open issues of the existing work.","authors":["Meghana P Lokhande","Durgesh Dipti","Dipti Durgesh Patil"],"meta":["May 2019INTERNATIONAL JOURNAL OF COMPUTER SCIENCES AND ENGINEERING 7(5)","DOI:10.26438/ijcse/v7i5.11581161"],"references":["316173391_A_Survey_on_Security_and_Privacy_Issues_in_Internet-of-Things","308201701_Internet_of_Things_Security_Device_Authentication_and_Access_Control_A_Review","261479017_Authentication_and_Access_Control_in_the_Internet_of_Things","258509303_An_Efficient_Authentication_and_Access_Control_Scheme_for_Perception_Layer_of_Internet_of_Things","335803723_A_Review_Paper_on_Various_Attacks_on_Wireless_Sensor_Networks","322190542_Safety_and_Security_in_Cyber-Physical_Systems_and_Internet-of-Things_Systems","319888597_An_Overview_of_Access_Control_Mechanisms_for_Internet_of_Things","277466451_A_capability-based_security_approach_to_manage_access_control_in_the_Internet_of_Things","261278170_Access_Control_Method_for_Web_of_Things_Based_on_Role_and_SNS","241175767_An_extended_role_based_access_control_model_for_the_Internet_of_Things"]}