{"id":"333993214_The_PARK_Framework_for_Automated_Analysis_of_Parkinson's_Disease_Characteristics","abstract":"There are about 900,000 people with Parkinson's disease (PD) in the United States. Even though there are benefits of early treatment, unfortunately, over 40% of individuals with PD over 65 years old do not see a neurologist. It is often very difficult for these individuals to get to a physician's office for diagnosis and subsequent monitoring. To address this problem, we present PARK, Parkinson's Analysis with Remote Kinetic-tasks. PARK instructs and guides users through six motor tasks and one audio task selected from the standardized MDS-UPDRS rating scale and records their performance via webcam. An initial experiment was conducted with 127 participants with PD and 127 age-matched controls, in which a total of 1,778 video recordings were collected. 90.6% of the PD participants agreed that PARK was easy to use, and 93.7% mentioned that they would use the system in the future. We explored objective differences between those with and without PD. A novel motion feature based on the Fast Fourier Transform (FFT) of optical flow in a region of interest was designed to quantify these differences in the collected video recordings. Additionally, we found that facial action unit AU4 (brow lowerer) was expressed significantly more often, while AU12 (lip corner puller) was expressed less often in various tasks for participants with PD.","authors":["Raina Langevin","Mohammad Ali","Taylan Sen","Christopher Snyder"],"meta":["June 2019Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies 3(2):1-22","DOI:10.1145/3328925"],"references":["326232975_Prevalence_of_Parkinson's_disease_across_North_America","323669130_Aging_and_Engaging_A_Social_Conversational_Skills_Training_Program_for_Older_Adults","319158574_National_randomized_controlled_trial_of_virtual_house_calls_for_Parkinson_disease","318203132_The_First_Frontier_Digital_Biomarkers_for_Neurodegenerative_Disorders","316699941_Biomechanical_parameter_assessment_for_classification_of_Parkinson's_disease_on_clinical_scale","311740678_Are_Smartphones_Ubiquitous_An_in-depth_survey_of_smartphone_adoption_by_seniors","328679906_Remote_Assessment_in_Real-World_Setting_of_Tremor_Severity_in_Parkinson's_Disease_Patients_Using_Smartphone_Inertial_Sensors","324257326_Teleneurology_and_mobile_technologies_The_future_of_neurological_care","324019109_Using_Smartphones_and_Machine_Learning_to_Quantify_Parkinson_Disease_Severity_The_Mobile_Parkinson_Disease_Score","313901575_Analysis_of_Facial_Expressions_in_Parkinson's_Disease_Through_Video-Based_Automatic_Methods"]}