{"id":"333984330_A_Secure_Communicating_Things_Network_Framework_for_Industrial_IoT_using_Blockchain_Technology","abstract":"Communicating Things Network (CTN) is the latest paradigm in the development of smart technologies. CTN comprises a network of physical devices capable of extracting and sharing digital information. The aim of CTN is to develop smart appliances that boost productivity and provide real-time data rapidly than any structure or a network that is dependent on human interference. Interconnected physical objects in the network communicate with each other and facilitate intelligent decision-making by monitoring and analyzing their surroundings. In today's era, CTNs are playing a significant role in daily activities by providing a substantial reduction in costs with increased visibility and efficiency in all aspects of businesses and individuals. In this manuscript, we have considered an important application of CTNs (i.e., IoT) and have proposed a secure hybrid industrial IoT framework using the Blockchain technique. We have used a hybrid industrial architecture where different branches of a company are located in more than one country. Although IoT devices are used in many organizations and assist in reducing their production costs along with improving quality, several threats can occur in IoT devices initiated by various intruders. Intruders may compromise IoT devices with the purpose of performing malicious activities. For example, a company's employee may steal some product or may rest during working hours. To prevent these issues, the Blockchain technology is considered as the best technique that provides secrecy and protects the control system in real-time conditions. In this manuscript, we have used a Blockchain mechanism to extract information from IoT devices and store extracted records into Blockchain to maintain transparency among various users located at different places. Furthermore, the experimentation of the proposed framework has been performed against the internal communication of Blockchain where IoT devices are compromised by several intruders. Results have been analyzed against the conventional approach and validated with improved simulated results that offer an 89% success rate over user request time, falsification attack, black hole attack, and probabilistic authentication scenarios because of the Blockchain technology.","authors":["Geetanjali Rathee","Ashutosh Sharma","Rajiv Kumar","Razi Iqbal"],"meta":["June 2019Ad Hoc Networks","DOI:10.1016/j.adhoc.2019.101933"],"references":["332137316_A_Review_on_the_Application_of_Blockchain_to_the_Next_Generation_of_Cybersecure_Industry_40_Smart_Factories","330644270_A_Review_on_Blockchain_Technologies_for_an_Advanced_and_Cyber-Resilient_Automotive_Industry","330069382_Proof_of_Authentication_IoT-Friendly_Blockchains","329230172_Security_in_networks_of_unmanned_aerial_vehicles_for_surveillance_with_an_agent-based_approach_inspired_by_the_principles_of_blockchain","328720582_A_Novel_Communication_Paradigm_for_High_Capacity_and_Security_via_Programmable_Indoor_Wireless_Environments_in_Next_Generation_Wireless_Systems","331004740_Code-based_physical_layer_secret_key_generation_in_passive_optical_networks","330818768_Leveraging_the_Capabilities_of_Industry_40_for_Improving_Energy_Efficiency_in_Smart_Factories","329409854_Secure_Identifier_Management_Based_on_Blockchain_Technology_in_NDN_Environment","329120566_Trust_Management_for_Secure_Cognitive_Radio_Vehicular_Ad_Hoc_Networks","328521862_Cost-Aware_Securing_of_IoT_Systems_Using_Attack_Graphs"]}