{"id":"333912990_Convolutional_neural_network_based_early_fire_detection","abstract":"The detection of manmade disasters particularly fire is valuable because it causes many damages in terms of human lives. Research on fire detection using wireless sensor network and video-based methods is a very hot research topic. However, the WSN based detection model need fire happens and a lot of smoke and fire for detection. Similarly, video-based models also have some drawbacks because conventional algorithms need feature vectors and high rule-based models for detection. In this paper, we proposed a fire detection method which is based on powerful machine learning and deep learning algorithms. We used both sensors data as well as images data for fire prevention. Our proposed model has three main deep neural networks i.e. a hybrid model which consists of Adaboost and many MLP neural networks, Adaboost-LBP model and finally convolutional neural network. We used Adaboost-MLP model to predict the fire. After the prediction, we proposed two neural networks i.e. Adaboost-LBP model and convolutional neural network for detection of fire using the videos and images taken from the cameras installed for the surveillance. Adaboost-LBP model is to generate the ROIs from the image where emergencies exist Our proposed model results are quite good, and the accuracy is almost 99%. The false alarming rate is very low and can be reduced more using further training.","authors":["Faisal Saeed","Anand Paul","Karthi Kumar","Anand Nayyar"],"meta":["April 2020Multimedia Tools and Applications 79(3)","DOI:10.1007/s11042-019-07785-w"],"references":["323529182_IoT-Based_Intelligent_Modeling_of_Smart_Home_Environment_for_Fire_Prevention_and_Safety","308860079_BoWFire_Detection_of_Fire_in_Still_Images_by_Integrating_Pixel_Color_and_Texture_Analysis","308107013_ContextLocNet_Context-Aware_Deep_Network_Models_for_Weakly_Supervised_Localization","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313884465_Internet_Cross-media_Retrieval_Based_on_Deep_Learning","312869546_A_Fast_Image_Retrieval_Method_Designed_for_Network_Big_Data","312559820_Smoke_Detection_Based_on_Deep_Convolutional_Neural_Networks","308191727_ContextLocNet_Context-Aware_Deep_Network_Models_for_Weakly_Supervised_Localization","306270367_High-order_local_ternary_patterns_with_locality_preserving_projection_for_smoke_detection_and_image_classification","286334975_DeepReID_Deep_Filter_Pairing_Neural_Network_for_Person_Re-identification"]}