{"id":"333912844_Interfaces_of_Incompleteness","abstract":"Science constructs tools for knowledge and, occasionally, this bold enterprise may let a few believe in the “completeness” of a given theoretical frames: as for these phenomena, we can predict, derive, compute ... everything. Yet, negative results, often based on the very tools proposed by the scientific approaches, set the limits to knowledge construction and opened the way to new science. Scientism instead assume to increasingly and completely occupy reality by pre-given scientific tools. Early positivism, with Laplace, expected to obtain the predictability of classical dynamics, of the Solar system in particular, from their explicit determination by suitable sets of equations. Poincaré’s negative answer set the limits of this hypothesis of complete deducibility of “all astronomical facts” by the equational approach to classical mechanics. Less than one century later, Hilbert, by his novel meta-mathematical foundation of mathematics, hoped to completely and consistently derive all mathematical properties by formal deduction. Gödel disproved this conjecture by tools that are internal to the formalist approach, similarly as Poincaré had disproved Laplace’s dream by a formal analysis of the equations. Also Einstein worked at the possible incompleteness of Quantum Mechanics, from a relativistic perspective. Finally, we will then address the supposed completeness of molecular descriptions in Biology, that is, of DNA seen as the locus of hereditary information and as the complete program, the “blue print”, of ontogenesis.","authors":["Giuseppe Longo"],"meta":["June 2019","DOI:10.1007/978-3-030-15277-2_1","In book: Systemics of Incompleteness and Quasi-Systems (pp.3-55)","Project: special issue of Progress in Biophysics and Molecular Biology, 2016  “Principles for a theory of organisms”"],"references":["325537757_Information_and_Causality_Mathematical_Reflections_on_Cancer_Biology_1","325537672_Complexity_Information_and_Diversity_in_Science_and_in_Democracy","325537603_Letter_to_Alan_Turing","345838410_Genetique_cellulaire_Lecon_inaugurale_prononcee_le_vendredi_7_mai_1965","344776844_Symmetry","344562295_Gene_Avatars_The_Neo-Darwinian_Theory_of_Evolution","323130140_On_the_Einstein_Podolsky_Rosen_paradox","314501108_Reflections_on_Concrete_Incompleteness","313079347_The_chemical_basis_of_morphogenesis","312899033_Le_modele_linguistique_en_biologie","304780440_The_biological_default_state_of_cell_proliferation_with_variation_and_motility_a_fundamental_principle_for_a_theory_of_organisms","297656557_The_Deluge_of_Spurious_Correlations_in_Big_Data","293618159_What_is_so_special_about_the_Godel_sentence_G","296282759_The_Delphic_Boat_What_genomes_tell_us","285289519_Une_extension_de_l'interpretation_de_Godel_a_l'analyse_et_son_application_a_l'elimination_des_coupures_dans_l'analyse_et_la_theorie_des_types"]}