{"id":"333979564_Searching_source_code_fragments_using_incremental_clustering","abstract":"Plagiarism is becoming an increasingly serious problem in academic environment. In this paper, we deal with a specific kind of plagiarism: source code plagiarism. In this case, there is no software available for detecting plagiarism on a larger scale (hundreds of student submissions every year). We propose algorithms for source code parsing and processing as a part of a complex system for plagiarism detection. A source code vectorization using characteristic vectors is a vital piece of the whole process, and k‐means algorithm helps with the classification and clustering of vectors. Student assignments are submitted regularly, and any plagiarism detection system needs to handle them as they come. For this reason, we propose a modified incremental k‐means algorithm and a method for determining the number of clusters. We also consider methods for vector search among clusters and suggest the use of conditional entropy to select the important vector elements used in the search algorithm. Our results show how the proposed algorithms and methods work on real student submissions.","authors":["Michal Ďuračík","Emil Krsak","Patrik Hrkút"],"meta":["June 2019Concurrency and Computation Practice and Experience 32(1):e5416","DOI:10.1002/cpe.5416"],"references":["342979025_Using_concepts_of_text_based_plagiarism_detection_in_source_code_plagiarism_analysis","329645494_Issues_with_the_Detection_of_Plagiarism_in_Programming_Courses_on_a_Larger_Scale","326202980_Source_Code_Representations_for_Plagiarism_Detection","317826391_Current_Trends_in_Source_Code_Analysis_Plagiarism_Detection_and_Issues_of_Analysis_Big_Datasets","299499169_Is_plagiarism_changing_over_time_A_10-year_time-lag_study_with_three_points_of_measurement","334412918_Cluster_Analysis","300414617_An_AST-based_Code_Plagiarism_Detection_Algorithm","285714962_Latent_Semantic_Analysis","285205564_Turning_Big_data_into_tiny_data_Constant-size_coresets_for_k-means_PCA_and_projective_clustering","281162938_Cluster_Analysis"]}