{"id":"333913339_PENGENALAN_WAJAH_MENGGUNAKAN_LOCAL_BINARY_PATTERN_LBP_DAN_SUPPORT_VECTOR_MACHINE_SVM","abstract":"Terdapat banyak metode yang digunakan untuk mengenali identitas seseorang, misalkan nomor unik, kartu identitas dan sandi rahasia. Kekurangan metode-metode tersebut antara lain, kartu dapat hilang, nomor unik dan sandi rahasia dapat terlupakan. Salah satu solusi untuk masalah ini adalah sistem identifikasi seseorang berdasarkan metode biometrik jenis fisiologis. Penelitian ini merancang sebuah sistem untuk mengidentifikasi wajah. Citra wajah diambil menggunakan kamera web kemudian diekstraksi cirinya dengan metode local binary pattern (LBP). Ciri wajah yang diperoleh diklasifikasi menggunakan support vector machine (SVM). Model terbaik SVM dibangun berdasarkan validasi silang grid search. Kernel linier terbaik dibentuk dengan dan parameter . Kernel radial basis function (RBF) terbaik dicapai dengan dan parameter dan . Berdasarkan pengujian terhadap keseluruhan citra wajah, akurasi kedua kernel adalah 96,0%. Pada pengujian lima ekspresi wajah dengan SVM kernel linier, akurasi 100,0% diperoleh untuk ekspresi sedih, netral dan mata tertutup. Sedangkan SVM kernel RBF menghasilkan akurasi 100,0% untuk ekspresi terkejut, netral dan mata tertutup. Hasil pengujian tersebut menunjukkan sistem pengenalan wajah yang dirancang telah berfungsi baik.","authors":["Khusnil Mujib","Achmad Hidayatno","Teguh Prakoso"],"meta":["March 2018TRANSIENT 7(1):123","DOI:10.14710/transient.7.1.123-130"],"references":["2352264_A_Study_of_Cross-Validation_and_Bootstrap_for_Accuracy_Estimation_and_Model_Selection","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond","260572638_Facial_expression_recognition_based_on_fusion_feature_of_PCA_and_LBP_with_SVM","240224936_Rapid_object_detection_using_a_boosted_cascade_of_simple_features","222738212_A_Comparative_Study_of_Texture_Measures_with_Classification_Based_on_Feature_Distributions","200086000_A_Tutorial_on_Support_Vector_Machines_for_Pattern_Recognition"]}