{"id":"333992936_A_Survey_of_Automatic_Parameter_Tuning_Methods_for_Metaheuristics","abstract":"Parameter tuning, that is, to find appropriate parameter settings (or configurations) of algorithms so that their performance is optimized, is an important task in the development and application of metaheuristics. Automating this task, i.e., developing algorithmic procedure to address parameter tuning task, is highly desired and has attracted significant attention from the researchers and practitioners. During last two decades, many automatic parameter tuning approaches have been proposed. This paper presents a comprehensive survey of automatic parameter tuning methods for metaheuristics. A new classification (or taxonomy) of automatic parameter tuning methods is introduced according to the structure of tuning methods. The existing automatic parameter tuning approaches are consequently classified into three categories: simple generate-evaluate methods, iterative generate-evaluate methods, and high-level generate-evaluate methods. Then, these three categories of tuning methods are reviewed in sequence. In addition to the description of each tuning method, its main strengths and weaknesses are discussed, which is helpful for new researchers or practitioners to select appropriate tuning methods to use. Furthermore, some challenges and directions of this field are pointed out for further research.","authors":["Changwu Huang","Yuanxiang Li","Xin Yao"],"meta":["June 2019IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council 24(2):201-216","DOI:10.1109/TEVC.2019.2921598","Project: Automated Algorithm Configuration"],"references":["323859551_Parameter_meta-optimization_of_metaheuristics_of_solving_specific_NP-hard_facility_location_problem","321768075_In_a_Nutshell_Sequential_Parameter_Optimization","317392947_Improving_the_Fine-Tuning_of_Metaheuristics_An_Approach_Combining_Design_of_Experiments_and_Racing_Algorithms","316806198_Instance-Specific_Algorithm_Configuration","316113027_Exploring_variable_neighborhood_search_for_automatic_algorithm_configuration","315858939_Principles_and_Techniques","314521862_A_Heuristic_for_Optimization_of_Metaheuristics_by_Means_of_Statistical_Methods","314039110_Common_Concepts_for_Metaheuristics","313749844_Particle_swarm_optimization","313486875_Model-based_Methods_for_Continuous_and_Discrete_Global_Optimization"]}