{"id":"333924751_Similar_image_search_for_histopathology_SMILY","abstract":"The increasing availability of large institutional and public histopathology image datasets is enabling the searching of these datasets for diagnosis, research, and education. Although these datasets typically have associated metadata such as diagnosis or clinical notes, even carefully curated datasets rarely contain annotations of the location of regions of interest on each image. As pathology images are extremely large (up to 100,000 pixels in each dimension), further laborious visual search of each image may be needed to find the feature of interest. In this paper, we introduce a deep-learning-based reverse image search tool for histopathology images: Similar Medical Images Like Yours (SMILY). We assessed SMILY’s ability to retrieve search results in two ways: using pathologist-provided annotations, and via prospective studies where pathologists evaluated the quality of SMILY search results. As a negative control in the second evaluation, pathologists were blinded to whether search results were retrieved by SMILY or randomly. In both types of assessments, SMILY was able to retrieve search results with similar histologic features, organ site, and prostate cancer Gleason grade compared with the original query. SMILY may be a useful general-purpose tool in the pathologist’s arsenal, to improve the efficiency of searching large archives of histopathology images, without the need to develop and implement specific tools for each application.","authors":["Narayan Hegde","Jason D. Hipp","Yun Liu","Michael Emmert-Buck"],"meta":["June 2019npj Digital Medicine 2(1):56","DOI:10.1038/s41746-019-0131-z"],"references":["345149461_Improving_Phenotypic_Measurements_in_High-Content_Imaging_Screens","327508252_Deep_Learning_Based_Retrieval_System_for_Gigapixel_Histopathology_Cases_and_Open_Access_Literature","325935815_Luigi_Large-scale_histopathological_image_retrieval_system_using_deep_texture_representations","325479909_1399_HE-stained_sentinel_lymph_node_sections_of_breast_cancer_patients_The_CAMELYON_dataset","322650212_Histopathological_Whole_Slide_Image_Analysis_Using_Context-Based_CBIR","320105945_Whole_Slide_Imaging_Versus_Microscopy_for_Primary_Diagnosis_in_Surgical_Pathology_A_Multicenter_Blinded_Randomized_Noninferiority_Study_of_1992_Cases_Pivotal_Study","332745428_Human-Centered_Tools_for_Coping_with_Imperfect_Algorithms_During_Medical_Decision-Making","331377367_Predicting_breast_tumor_proliferation_from_whole-slide_images_The_TUPAC16_challenge","320770412_Histologic_Mimics_of_Basal_Cell_Carcinoma","319770255_Hamming_embedding_and_weak_geometric_consistency_for_large_scale_image_search"]}