{"id":"333968671_Application_of_Graph_Theory_for_Identifying_Connectivity_Patterns_in_Human_Brain_Networks_A_Systematic_Review","abstract":"Background: Analysis of the human connectome using functional magnetic resonance imaging (fMRI) started in the mid-1990s and attracted increasing attention in attempts to discover the neural underpinnings of human cognition and neurological disorders. In general, brain connectivity patterns from fMRI data are classified as statistical dependencies (functional connectivity) or causal interactions (effective connectivity) among various neural units. Computational methods, especially graph theory-based methods, have recently played a significant role in understanding brain connectivity architecture.\n\nObjectives: Thanks to the emergence of graph theoretical analysis, the main purpose of the current paper is to systematically review how brain properties can emerge through the interactions of distinct neuronal units in various cognitive and neurological applications using fMRI. Moreover, this article provides an overview of the existing functional and effective connectivity methods used to construct the brain network, along with their advantages and pitfalls.\n\nMethods: In this systematic review, the databases Science Direct, Scopus, arXiv, Google Scholar, IEEE Xplore, PsycINFO, PubMed, and SpringerLink are employed for exploring the evolution of computational methods in human brain connectivity from 1990 to the present, focusing on graph theory. The Cochrane Collaboration's tool was used to assess the risk of bias in individual studies.\n\nResults: Our results show that graph theory and its implications in cognitive neuroscience have attracted the attention of researchers since 2009 (as the Human Connectome Project launched), because of their prominent capability in characterizing the behavior of complex brain systems. Although graph theoretical approach can be generally applied to either functional or effective connectivity patterns during rest or task performance, to date, most articles have focused on the resting-state functional connectivity.\n\nConclusions: This review provides an insight into how to utilize graph theoretical measures to make neurobiological inferences regarding the mechanisms underlying human cognition and behavior as well as different brain disorders.","authors":["Farzad V. Farahani","Waldemar Karwowski","Nichole Lighthall"],"meta":["June 2019Frontiers in Neuroscience 13:585","DOI:10.3389/fnins.2019.00585","Project: Identifying Connectivity Patterns in Human Brain Networks"],"references":["330286114_Topological_Properties_of_Resting-State_fMRI_Functional_Networks_Improve_Machine_Learning-Based_Autism_Classification","328822211_Exploring_resting-state_functional_connectivity_invariants_across_the_lifespan_in_healthy_people_by_means_of_a_recently_proposed_graph_theoretical_model","327879765_Graph_theory_methods_applications_in_brain_networks","326814462_Aberrant_Dynamic_Functional_Network_Connectivity_and_Graph_Properties_in_Major_Depressive_Disorder","326454107_GraphVar_20_A_user-friendly_toolbox_for_machine_learning_on_functional_connectivity_measures","326308748_Altered_functional_network_connectivity_in_preterm_infants_antecedents_of_cognitive_and_motor_impairments","326042653_Computational_Methods_for_Analyzing_Functional_and_Effective_Brain_Network_Connectivity_Using_fMRI","327891491_Graph_theory_methods_applications_in_brain_networks","327118871_Cognitive_computational_neuroscience","325800275_Functional_Connectivity_in_Dementia"]}