{"id":"333906415_Towards_a_General_Definition_of_Life","abstract":"A new definition of life is proposed and discussed in the present article. It is formulated by modifying and extending NASA’s working definition of life, which postulates that life is a “self-sustaining chemical system capable of Darwinian evolution”. The new definition includes a thermodynamical aspect of life as a far from equilibrium system and considers the flow of information from the environment to the living system. In our derivation of the definition of life we have assumed the hypothesis, that during the emergence of life evolution had to first involve autocatalytic systems that only subsequently acquired the capacity of genetic heredity. The new proposed definition of life is independent of the mode of evolution, regardless of whether Lamarckian or Darwinian evolution operated at the origins of life and throughout evolutionary history. The new definition of life presented herein is formulated in a minimal manner and it is general enough that it does not distinguish between individual (metabolic) network and the collective (ecological) one. The newly proposed definition of life may be of interest for astrobiology, research into the origins of life or for efforts to produce synthetic or artificial life, and it furthermore may also have implications in the cognitive and computer sciences.","authors":["Marko Vitas","Andrej Dobovišek"],"meta":["June 2019Origins of Life and Evolution of Biospheres 49(10)","DOI:10.1007/s11084-019-09578-5","Project: I am an independent researcher. I do not have any formal projects or grants. However, I am following published literature on the Origin of Life topics."],"references":["331348866_Omnipresent_Maxwell's_demons_orchestrate_information_management_in_living_cells","330970649_An_ab_initio_definition_of_life_pertaining_to_Astrobiology","329486372_Communication_as_the_Main_Characteristic_of_Life","326604435_Systems_protobiology_Origin_of_life_in_lipid_catalytic_networks","324857791_In_the_Beginning_was_a_Mutualism_-_On_the_Origin_of_Translation","323301290_The_Importance_of_Water_for_Life","344495803_Origin_of_life_in_an_iron-sulfur_world","330998803_Synthetic_Biology_and_Artificial_Intelligence_Grounding_a_Cross-Disciplinary_Approach_to_the_Synthetic_Exploration_of_Embodied_Cognition","328973724_Why_the_Submarine_Alkaline_Vent_is_the_Most_Reasonable_Explanation_for_the_Emergence_of_Life","326984043_The_origin_and_early_evolution_of_life_in_chemical_composition_space","318080748_Chemical_Evolution_and_the_Evolutionary_Definition_of_Life","317550248_From_chemical_metabolism_to_life_The_origin_of_the_genetic_coding_process","319135954_Beyond_the_Second_Law_Entropy_Production_and_Non-equilibrium_Systems","318223191_How_Simple_Could_Life_Be","317414427_Origins_of_Life_A_Problem_for_Physics_A_Key_Issues_Review"]}