{"id":"333999095_Harnessing_Entropy_via_Predictive_Analytics_to_Optimize_Outcomes_in_the_Pedagogical_System_An_Artificial_Intelligence-Based_Bayesian_Networks_Approach","abstract":"Educational stakeholders would be better informed if they could use their students’ formative assessments results and personal background attributes to predict the conditions for achieving favorable learning outcomes, and conversely, to gain awareness of the “at-risk” signals to prevent unfavorable or worst-case scenarios from happening. It remains, however, quite challenging to simulate predictive counterfactual scenarios and their outcomes, especially if the sample size is small, or if a baseline control group is unavailable. To overcome these constraints, the current paper proffers a Bayesian Networks approach to visualize the dynamics of the spread of “energy” within a pedagogical system, so that educational stakeholders, rather than computer scientists, can also harness entropy to work for them. The paper uses descriptive analytics to investigate “what has already happened?” in the collected data, followed by predictive analytics with controllable parameters to simulate outcomes of “what-if?” scenarios in the experimental Bayesian Network computational model to visualize how effects spread when interventions are applied. The conceptual framework and analytical procedures in this paper could be implemented using Bayesian Networks software, so that educational researchers and stakeholders would be able to use their own schools’ data and produce findings to inform and advance their practice.","authors":["Mengleong How","Wei Loong David HUNG"],"meta":["June 2019Education Sciences 9(2)","DOI:10.3390/educsci9020158","Project: Artificial Intelligence"],"references":["333225707_Educational_Stakeholders'_Independent_Evaluation_of_an_Artificial_Intelligence-Enabled_Adaptive_Learning_System_Using_Bayesian_Network_Predictive_Simulations","330904069_A_Study_of_the_Cross-Scale_Causation_and_Information_Flow_in_a_Stormy_Model_Mid-Latitude_Atmosphere","325299859_Reducing_Student_Absenteeism_in_the_Early_Grades_by_Targeting_Parental_Beliefs","324426686_Transductive_Feature_Selection_Using_Clustering-Based_Sample_Entropy_for_Temperature_Prediction_in_Weather_Forecasting","322740292_Students'_Achievement_in_Math_and_Science_How_Grit_and_Attitudes_Influence","321932463_Combined_Forecasting_of_Rainfall_Based_on_Fuzzy_Clustering_and_Cross_Entropy","320511341_Rainfall_Network_Optimization_Using_Radar_and_Entropy","345604681_Flexible_Bayesian_Models_for_Inferences_From_Coarsened_Group-Level_Achievement_Data","319294903_The_effect_of_attending_tutoring_on_course_grades_in_Calculus_I","318256205_It_Takes_a_Village_An_Indigenous_Atayal_After-School_Tutoring_Program_in_Taiwan"]}