{"id":"334077067_Coupling_High-throughput_Property_Map_to_Machine_Learning_for_Predicting_Lattice_Thermal_Conductivity","abstract":"Low thermal conductivity materials are crucial for applications such as thermoelectric conversion of waste heat to useful energy and thermal barrier coatings. On the other hand, high thermal conductivity materials are necessary for cooling electronic devices. However, search for such materials via explicit evaluation of thermal conductivity either experimentally or computationally is very challenging. Here, we carried out high-throughput ab-initio calculations, on a dataset containing 195 binary, ternary, and quaternary compounds. The lattice thermal conductivity κl of 120 dynamically stable and nonmetallic compounds are calculated, which span over three orders of magnitude. Among these, 11 ultra-high and 15 ultra-low κl materials are identified. An analysis of generated property map of this dataset reveals a strong dependence of κl on simple descriptors, namely maximum phonon frequency, integrated Grüneisen parameter upto 3 THz, average atomic mass and volume of the unit cell. Using these descriptors, a Gaussian process regression based machine learning (ML) model is developed. The model predicts log-scaled κl with a very small root mean square error (rmse) of ~0.21. Comparatively, the Slack model, which uses more involved parameters, severely overestimates κl. The superior performance of our ML model can ensure a reliable and accelerated search for multitude of low and high thermal conductivity materials.","authors":["Rinkle Juneja","George Yumnam","Swanti Satsangi","Abhishek Singh"],"meta":["June 2019Chemistry of Materials 31(14)","DOI:10.1021/acs.chemmater.9b01046"],"references":["331206526_Non-monotonic_pressure_dependence_of_the_thermal_conductivity_of_boron_arsenide","322641944_Accelerating_evaluation_of_converged_lattice_thermal_conductivity","346677578_Thermal_Management_of_Microelectronic_Equipment","330899933_Accelerated_Data-Driven_Accurate_Positioning_of_the_Band_Edges_of_MXenes","328618548_Assessing_High-Throughput_Descriptors_for_Prediction_of_Transparent_Conductors","327757475_High_Throughput_Screening_of_Magnetic_Antiperovskites","326883523_SISSO_A_compressed-sensing_method_for_identifying_the_best_low-dimensional_descriptor_in_an_immensity_of_offered_candidates","326250802_High_thermal_conductivity_in_cubic_boron_arsenide_crystals","325484301_Machine-Learning_Assisted_Accurate_Band_Gap_Predictions_of_Functionalized_MXene","324328902_Antisite_Pairs_Suppress_the_Thermal_Conductivity_of_BAs"]}