{"id":"334028881_Radiomics_in_nuclear_medicine_robustness_reproducibility_standardization_and_how_to_avoid_data_analysis_traps_and_replication_crisis","abstract":"Radiomics in nuclear medicine is rapidly expanding. Reproducibility of radiomics studies in multicentre settings is an important criterion for clinical translation. We therefore performed a meta-analysis to investigate reproducibility of radiomics biomarkers in PET imaging and to obtain quantitative information regarding their sensitivity to variations in various imaging and radiomics-related factors as well as their inherent sensitivity. Additionally, we identify and describe data analysis pitfalls that affect the reproducibility and generalizability of radiomics studies. After a systematic literature search, 42 studies were included in the qualitative synthesis, and data from 21 were used for the quantitative meta-analysis. Data concerning measurement agreement and reliability were collected for 21 of 38 different factors associated with image acquisition, reconstruction, segmentation and radiomics-specific processing steps. Variations in voxel size, segmentation and several reconstruction parameters strongly affected reproducibility, but the level of evidence remained weak. Based on the meta-analysis, we also assessed inherent sensitivity to variations of 110 PET image biomarkers. SUVmean and SUVmax were found to be reliable, whereas image biomarkers based on the neighbourhood grey tone difference matrix and most biomarkers based on the size zone matrix were found to be highly sensitive to variations, and should be used with care in multicentre settings. Lastly, we identify 11 data analysis pitfalls. These pitfalls concern model validation and information leakage during model development, but also relate to reporting and the software used for data analysis. Avoiding such pitfalls is essential for minimizing bias in the results and to enable reproduction and validation of radiomics studies.","authors":["Alex Zwanenburg"],"meta":["December 2019European Journal of Nuclear Medicine and Molecular Imaging 46(Suppl 1)","DOI:10.1007/s00259-019-04391-8"],"references":["330587241_Assessing_robustness_of_radiomic_features_by_image_perturbation","330081531_MITK_Phenotyping_An_open-source_toolchain_for_image-based_personalized_medicine_with_radiomics","329486214_External_validation_of_a_combined_PET_and_MRI_radiomics_model_for_prediction_of_recurrence_in_cervical_cancer_patients_treated_with_chemoradiotherapy","328869642_External_validation_of_a_prognostic_model_incorporating_quantitative_PET_image_features_in_oesophageal_cancer","328817738_Vulnerabilities_of_radiomic_signature_development_The_need_for_safeguards","340177686_Data_Structures_for_Statistical_Computing_in_Python","330906198_Abstract_nnU-Net_Self-adapting_Framework_for_U-Net-Based_Medical_Image_Segmentation","330460255_Creating_Robust_Predictive_Radiomic_Models_for_Data_From_Independent_Institutions_Using_Normalization","329697878_Validation_of_a_method_to_compensate_multicenter_effects_affecting_CT_radiomic_features","329406284_Variation_in_algorithm_implementation_across_radiomics_software","328322284_Use_of_18F-FDG_PETCT_texture_analysis_to_diagnose_cardiac_sarcoidosis","328115312_Effect_of_machine_learning_methods_on_predicting_NSCLC_overall_survival_time_based_on_Radiomics_analysis","327572680_Parameters_Influencing_PET_Imaging_Features_A_Phantom_Study_with_Irregular_and_Heterogeneous_Synthetic_Lesions","328557262_Deep_learning_in_medical_imaging_and_radiation_therapy","327026577_A_radiomics_approach_to_assess_tumour-infiltrating_CD8_cells_and_response_to_anti-PD-1_or_anti-PD-L1_immunotherapy_an_imaging_biomarker_retrospective_multicohort_study"]}