{"id":"334083600_Crowdsourcing_in_developing_repository_of_phrase_definition_in_Bahasa_Indonesia","abstract":"Language repository is valuable as a reference in using the language, its preservation, and in developing and implementation of natural language processing algorithms. Bahasa Indonesia is one of natural languages that hardly has repository despite its large number of speakers and previous attempts to build ones. We devised a way to develop repository of phrase definition in Bahasa using a kind of crowdsourcing and investigated its implementation. An application add-on was inserted to an information system that manages final year projects of undergraduate students. The add-on invites students to participate in writing keyword definition and validating definition. Investigation in a period of six months reveals that about 25% of application users take parts into the voluntary activities either as definition writers and/or validators. During the period, about 1200 phrase definitions were added into the repository and in average each definition is validated by two participants. The activity is supported by users that are well aware of the tasks, and have positive perception about the work, despite different reasons that motivate their contribution.","authors":["Husni Thamrin","Gunawan Ariyanto","Irma Yuliana","Wawan Joko Pranoto"],"meta":["October 2019TELKOMNIKA Indonesian Journal of Electrical Engineering 17(5):2321-2326","DOI:10.12928/TELKOMNIKA.v17i5.12005"],"references":["322695424_HappyDB_A_Corpus_of_100000_Crowdsourced_Happy_Moments","321291675_The_English_Dialects_App_The_creation_of_a_crowdsourced_dialect_corpus","320402308_A_Rule_Based_SWOT_Analysis_Application_A_Case_Study_for_Indonesian_Higher_Education_Institution","311921808_MTurk_101_An_Introduction_to_Amazon_Mechanical_Turk_for_Extension_Professionals","270847840_Crowdsourcing_Application_in_Marketing_Activities","252317277_Building_an_Indonesian_WordNet","324332037_The_Professor_and_the_Madman_A_Tale_of_Murder_Insanity_and_the_Making_of_the_Oxford_English_Dictionary","318039998_Placing_Knowledge_Management_in_Context","292454604_Developing_an_online_Indonesian_corpora_repository","287959764_Crowdsourced_Data_Management_Industry_and_Academic_Perspectives"]}