{"id":"334086959_Applying_educational_gaming_success_to_a_nonsterile_compounding_escape_room","abstract":"Background and purpose: \nSerious educational gaming success has not been replicated in a nonsterile compounding practical skill-based course. The objective of this study was to create a nonsterile compounding escape room to evaluate third-year professional pharmacy students' (1) knowledge of nonsterile compounding and (2) perceptions of educational escape room gaming utilized in nonsterile compounding.\n\nEducational activity and setting: \nThe escape room gaming environment used puzzles focused on advanced topics of nonsterile compounding. To evaluate students' knowledge, all participating students completed a pre-assessment and post-assessment mapped to the course objectives. To assess student perceptions of educational escape room gaming, a previously-validated, 12-item survey on student perceptions of educational escape room gaming was modified and administered at the end of the activity. Additional influencing factors such as success in the activity and previous escape room gaming experience were collected.\n\nFindings: \nAll thirty students completed the assessments and perception survey (100% response rate). Three out of four student teams successfully escaped the room. Students' knowledge improved or stayed the same for all questions of the assessment questions. Students perceived the escape room as helpful to their learning. Students' increased knowledge and positive perception were independent of their teams' escape success.\n\nSummary: \nStudents were actively engaged in learning during a nonsterile compounding escape room. Escape room educational games may be successfully applied to nonsterile compounding to yield increased student knowledge and positive perceptions.","authors":["Lauren Caldas","Heidi Eukel","Abigale T. Matulewicz","Elena V. Fernández"],"meta":["June 2019Currents in Pharmacy Teaching and Learning 11(10)","DOI:10.1016/j.cptl.2019.06.012"],"references":["321947390_Educational_Gaming_for_Pharmacy_Students_-_Design_and_Evaluation_of_a_Diabetes-themed_Escape_Room","311262967_Practical_Insights_for_the_Pharmacist_Educator_on_Student_Engagement","278788682_Are_Serious_Games_a_Good_Strategy_for_Pharmacy_Education","272078303_Report_of_the_2013-2014_Academic_Affairs_Committee","258044376_Center_for_the_Advancement_of_Pharmacy_Education_2013_Educational_Outcomes","232226226_Assessment_and_Recommendations_of_Compounding_Education_in_AACP_Member_Institutions","327090918_Break_out_of_the_Classroom_The_Use_of_Escape_Rooms_as_an_Alternative_Teaching_Strategy_in_Surgical_Education","270372841_Freedom_to_Learn","236958829_Team-Based_Learning_in_Pharmacy_Education","51748495_Core_Competencies_for_Interprofessional_Collaborative_Practice_Reforming_Health_Care_by_Transforming_Health_Professionals'_Education","24005300_A_Laboratory_Exercise_in_Capsule_Making"]}