{"id":"334066632_A_hidden_Markov_model_for_matching_spatial_networks","abstract":"Datasets of the same geographic space at different scales and temporalities are increasingly abundant, paving the way for new scientific research. These datasets require data integration, which implies linking homologous entities in a process called data matching that remains a challenging task, despite a quite substantial literature, because of data imperfections and heterogeneities. In this paper, we present an approach for matching spatial networks based on a hidden Markov model (HMM) that takes full benefit of the underlying topology of networks. The approach is assessed using four heterogeneous datasets (streets, roads, railway, and hydrographic networks), showing that the HMM algorithm is robust in regards to data heterogeneities and imperfections (geometric discrepancies and differences in level of details) and adaptable to match any type of spatial networks. It also has the advantage of requiring no mandatory parameters, as proven by a sensitivity exploration, except a distance threshold that filters potential matching candidates in order to speed-up the process. Finally, a comparison with a commonly cited approach highlights good matching accuracy and completeness.","authors":["Benoit Costes","Julien Perret"],"meta":["June 2019Journal of Spatial Information Science","DOI:10.5311/JOSIS.2019.18.489","Project: GeoHistoricalData"],"references":["335516603_Inferring_the_Scale_of_OpenStreetMap_Features","322660431_The_Open_Science_Commons_for_the_European_Research_Area","283571813_A_polygon-based_approach_for_matching_OpenStreetMap_road_networks_with_regional_transit_authority_data","352538053_Un_systeme_d'information_geographique_pour_le_suivi_d'objets_historiques_urbains_a_travers_l'espace_et_le_temps","318588094_Vers_la_construction_d'un_referentiel_geographique_ancien_un_modele_de_graphe_agrege_pour_integrer_qualifier_et_analyser_des_reseaux_geohistoriques","304564688_A_mathematical_theory_of_evidence","289199432_An_iterative_process_for_matching_network_data_sets_with_different_level_of_detail","288823654_Managing_uncertainty","286686463_Models_of_uncertainty_in_spatial_data","285775770_Geographic_information_systems_and_science_3e"]}