{"id":"334059916_Physics_driven_behavioural_clustering_of_free-falling_paper_shapes","abstract":"Many complex physical systems exhibit a rich variety of discrete behavioural modes. Often, the system complexity limits the applicability of standard modelling tools. Hence, understanding the underlying physics of different behaviours and distinguishing between them is challenging. Although traditional machine learning techniques could predict and classify behaviour well, typically they do not provide any meaningful insight into the underlying physics of the system. In this paper we present a novel method for extracting physically meaningful clusters of discrete behaviour from limited experimental observations. This method obtains a set of physically plausible functions that both facilitate behavioural clustering and aid in system understanding. We demonstrate the approach on the V-shaped falling paper system, a new falling paper type system that exhibits four distinct behavioural modes depending on a few morphological parameters. Using just 49 experimental observations, the method discovered a set of candidate functions that distinguish behaviours with an error of 2.04%, while also aiding insight into the physical phenomena driving each behaviour.","authors":["Toby Howison","Josie Hughes","Fabio Giardina","Fumiya Iida"],"meta":["June 2019PLoS ONE 14(6):e0217997","DOI:10.1371/journal.pone.0217997"],"references":["323762503_Speeding_up_MCMC_by_Efficient_Data_Subsampling","321161034_Evolving_Soft_Locomotion_in_Aquatic_and_Terrestrial_Environments_Effects_of_Material_Properties_and_Environmental_Transitions","320944297_Modal_decomposition_of_fluid-structure_interaction_with_application_to_flag_flapping","320362356_The_trade-off_between_morphology_and_control_in_the_co-optimized_design_of_robots","316989462_Quality_and_Diversity_Optimization_A_Unifying_Modular_Framework","313231782_Deep_learning_in_fluid_dynamics","312972605_On_a_particular_case_of_the_descent_of_a_heavy_body_in_a_resisting_medium","312521426_Clustering_instability_of_focused_swimmers","309727542_Dynamic_Mode_Decomposition_Data-Driven_Modeling_of_Complex_Systems","307534542_Algorithm_AS_136_A_K-means_vlustering_algorithm"]}