{"id":"334093867_An_improved_CF-MAC_protocol_for_VANET","abstract":"Vehicular Ad hoc Network (VANET) is one of the emerging research areas in the mobile computing field which is considered as future technology and promising topic in computer science and computer networks. Which provides road safety, updated traffic information, and infotainment. VANET consists of a large number of vehicles moving in high speeds while broadcasting important information like safety and control information which must be sent with high priority. Crowded networks like VANET having many vehicles competing to reserve the channel to send critical information which may lead to high collision scenarios, and therefore, there must be a protocol to send this kind of information with high reliability, low data loss and with no collision. In this research a collision-free protocol will be proposed to manage the channel access among competing vehicles to eliminate the collisions which occur rapidly in VANET especially in dense situations, the proposed protocol hereinafter will be called (I-MAC) protocol expected to enhance the channel performance, achieve load balancing, fairness, and decrease message loss and enhance reliability, The evaluation criteria will examine the channel throughput, message delay, and message loss; the results show that the overall channel performance with regard to collision and packet loss ratio is improved.","authors":["Ghassan Samara"],"meta":["August 2019International Journal of Electrical and Computer Engineering 9(4):2668-2674","DOI:10.11591/ijece.v9i4.pp2668-2674"],"references":["327297315_An_intelligent_routing_protocol_in_VANET","323222854_An_Efficient_Collision_Free_Protocol_for_VANET","263545192_Intelligent_emergency_message_broadcasting_in_VANET_using_PSO","234581488_An_analytical_model_for_beaconing_in_VANETs","224986100_Car-2-Car_Communication_Consortium_-_Manifesto","221453921_Non-saturation_and_saturation_analysis_of_IEEE_80211e_EDCA_with_starvation_prediction","294156205_Intelligent_transport_systems","261041723_VeMAC_A_novel_multichannel_MAC_protocol_for_vehicular_ad_hoc_networks","247933007_RAMC_a_RSU-assisted_multi-channel_coordination_MAC_protocol_for_VANET","220926714_Reliable_MAC_broadcast_protocol_in_directional_and_omni-directional_transmission_for_vehicular_ad_hoc_networks","3436143_A_survey_and_qualitative_analysis_of_MAC_protocols_for_vehicular_ad_hoc_networks","220211181_Cross_Layer_Rate_Control_Medium_Access_Control_and_Routing_Design_in_Cooperative_VANET_Computer_Communications"]}