{"id":"334099948_Association_of_Titin-Truncating_Genetic_Variants_With_Life-threatening_Cardiac_Arrhythmias_in_Patients_With_Dilated_Cardiomyopathy_and_Implanted_Defibrillators","abstract":"Importance\nThere is a need for better arrhythmic risk stratification in nonischemic dilated cardiomyopathy (DCM). Titin-truncating variants (TTNtvs) in the TTN gene are the most common genetic cause of DCM and may be associated with higher risk of arrhythmias in patients with DCM.\n\nObjective\nTo determine if TTNtv status is associated with the development of life-threatening ventricular arrhythmia and new persistent atrial fibrillation in patients with DCM and implanted cardioverter defibrillator (ICD) or cardiac resynchronization therapy defibrillator (CRT-D) devices.\n\nDesign, Setting, and Participants\nThis retrospective, multicenter cohort study recruited 148 patients with or without TTNtvs who had nonischemic DCM and ICD or CRT-D devices from secondary and tertiary cardiology clinics in the United Kingdom from February 1, 2011, to June 30, 2016, with a median (interquartile range) follow-up of 4.2 (2.1-6.5) years. Exclusion criteria were ischemic cardiomyopathy, primary valve disease, congenital heart disease, or a known or likely pathogenic variant in the lamin A/C gene. Analyses were performed February 1, 2017, to May 31, 2017.\n\nMain Outcome and Measures\nThe primary outcome was time to first device-treated ventricular tachycardia of more than 200 beats/min or first device-treated ventricular fibrillation. Secondary outcome measures included time to first development of persistent atrial fibrillation.\n\nResults\nOf 148 patients recruited, 117 adult patients with nonischemic DCM and an ICD or CRT-D device (mean [SD] age, 56.9 [12.5] years; 76 [65.0%] men; 106 patients [90.6%] with primary prevention indications) were included. Having a TTNtv was associated with a higher risk of receiving appropriate ICD therapy (shock or antitachycardia pacing) for ventricular tachycardia or fibrillation (hazard ratio [HR], 4.9; 95% CI, 2.2-10.7; P < .001). This association was independent of all covariates, including midwall fibrosis measured by late gadolinium enhancement on cardiac magnetic resonance images (adjusted HR, 8.3; 95% CI, 1.8-37.6; P = .006). Having a TTNtv was also associated with the risk of receiving a shock (HR, 3.6; 95% CI, 1.1-11.6; P = .03). Individuals with a TTNtv and fibrosis had a greater rate of receiving appropriate device therapy than those with neither (HR, 16.6; 95% CI, 3.5-79.3; P < .001). Having a TTNtv was also a risk factor for developing new persistent atrial fibrillation (HR, 3.9; 95% CI, 1.3-12.0; P = .01).\n\nConclusions and Relevance\nHaving a TTNtv was an important risk factor for clinically significant arrhythmia in patients with DCM and ICD or CRT-D devices. Having a TTNtv, especially in combination with midwall fibrosis confirmed with cardiovascular magnetic resonance imaging, may provide a risk stratification approach for evaluating the need for ICD therapy in patients with DCM. This hypothesis should be tested in larger studies.","authors":["Ben Corden","Julian Jarman","Nicola Whiffin","Upasana Tayal"],"meta":["June 2019JAMA Network Open 2(6):e196520","DOI:10.1001/jamanetworkopen.2019.6520"],"references":["320579406_Phenotype_and_Clinical_Outcomes_of_Titin_Cardiomyopathy","316802487_Truncating_Variants_in_Titin_Independently_Predict_Early_Arrhythmias_in_Patients_With_Dilated_Cardiomyopathy","315547018_Implantable_cardioverter_defibrillators_for_primary_prevention_of_death_in_left_ventricular_dysfunction_with_and_without_ischaemic_heart_disease_A_meta-analysis_of_8567_patients_in_the_11_trials","312186020_Titin_Truncating_Variants_in_Dilated_Cardiomyopathy_-_Prevalence_and_Genotype-Phenotype_Correlations","322798473_Titin_cardiomyopathy_leads_to_altered_mitochondrial_energetics_increased_fibrosis_and_long-term_life-threatening_arrhythmias","321808880_Role_of_titin_in_cardiomyopathy_From_DNA_variants_to_patient_stratification","318331641_Personalizing_Risk_Stratification_for_Sudden_Death_in_Dilated_Cardiomyopathy_The_Past_Present_and_Future","311899834_Late_Gadolinium_Enhancement_and_the_Risk_for_Ventricular_Arrhythmias_or_Sudden_Death_in_Dilated_Cardiomyopathy_Systematic_Review_and_Meta-Analysis","309690350_Truncating_titin_mutations_are_associated_with_a_mild_and_treatable_form_of_dilated_cardiomyopathy_Titin_dilated_cardiomyopathy_may_be_mild_and_treatable","307180051_Defibrillator_Implantation_in_Patients_with_Nonischemic_Systolic_Heart_Failure"]}