{"id":"334038080_Predicting_risk_of_Cervical_Cancer_A_case_study_of_machine_learning","abstract":"Human Papillomavirus (HPV) is the cause for 90% of cases of Cervical Cancer which can only be cured if diagnosed in early stage. Years of clinical experience in testing the tissue slide and examination of various risk factors thoroughly helps a physician to confirm the presence of Cervical Cancer, which is very time-consuming process. Tissue slides contain a vast amount of complex data, which can sometimes can be missed by human observation during microscopic examination. In this research, we have used machine learning algorithms to make the detection process a lot faster and accurate. The rationale is to develop an efficient prediction system which can predict whether the new sample is cancerous or not. The experiments are carried out on high dimensional biopsy samples of cancer patients. After training different machine learning models with the collected data, Bayes Net algorithm achieved an accuracy and AUC of 96.38% and 0.95 respectively. When the execution of the framework is set and performance of BayeNet is compared with standard classifiers like SVM, random forest, etc., using different evaluation metrics like accuracy, sensitivity, etc., the results are quite promising. In the field of cancer detection, machine learning can play a big role in saving lives.","authors":["Sujay Kumar Suman","Nishtha Hooda"],"meta":["May 2019","DOI:10.1080/09720510.2019.1611227","Project: ICETCE - 2019"],"references":["329909139_MCTOPE_Ensemble_Machine_Learning_Framework_A_Case_Study_of_Routing_Protocol_Prediction","325000522_Monitoring_the_Impact_of_Economic_Crisis_on_Crime_in_India_Using_Machine_Learning","323655455_Fraudulent_Firm_Classification_A_Case_Study_of_an_External_Audit","323582024_Prediction_of_drug_synergy_in_cancer_using_Ensemble_based_machine_learning_techniques","329069763_Survey_of_Cervical_Cancer_Prediction_Using_Machine_Learning_A_Comparative_Approach","325874283_A_hybrid_deep_learning_model_for_detecting_diabetic_retinopathy","325873196_Devanagri_character_recognition_model_using_deep_convolution_neural_network","316753862_B2FSE_Framework_for_High_Dimensional_Imbalanced_Data_A_Case_Study_for_Drug_Toxicity_Prediction","312980416_Robbins_Basic_Pathology_8th_Ed","312538118_Support-vector_networks"]}