{"id":"334070443_Low-Altitude_Navigation_for_Multi-Rotor_Drones_in_Urban_Areas","abstract":"Multi-rotor drones have witnessed a drastic usage increase in several smart city applications due to their three-dimensional (3D) mobility, flexibility, and low cost. Collectively, they can be used to accomplish different short-term and long-term missions that require low altitude motion in urban areas. Therefore, it is important to efficiently manage the operation of the fleet to leverage its use and maximize its application performances. In this paper, we propose to investigate the path routing problem for multiple drones in urban areas where obstacles with different heights exist. The objective is to find the best trajectories in this 3D environment while ensuring collision-free navigation. The collision is prevented by three possible alternatives: forcing the drone to statically hover so its peer can pass first, making it fly at a different altitude, or completely changing its path. Multiple charging stations are made available to allow the drones recharge their batteries when needed. A mixed integer linear program is first developed to model the problem and achieve optimal navigation of the fleet. Afterwards, two heuristic algorithms with different conceptual construction are designed to solve the trajectory planning problem with a faster convergence speed. Selected simulation results illustrate the performance of our framework in realistic 3D maps and show that the designed heuristic approaches provide close performances to the optimal ones.","authors":["Ahmed Bahabry","Xiangpeng Wan","Hakim Ghazzai","Hamid Menouar"],"meta":["June 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2925531"],"references":["330371882_Analysis_and_Optimization_of_Unmanned_Aerial_Vehicle_Swarms_in_Logistics_An_Intelligent_Delivery_Platform","326891400_Collision_Avoidance_in_Fixed-Wing_UAV_Formation_Flight_Based_on_a_Consensus_Control_Algorithm","326342206_Using_Optimization_Learning_and_Drone_Reflexes_to_Maximize_Safety_of_Swarms_of_Drones","324328894_Energy_Minimization_for_Wireless_Communication_With_Rotary-Wing_UAV","334074654_Optimal_Collision-Free_Navigation_for_Multi-Rotor_UAV_Swarms_in_Urban_Areas","332407399_Exploiting_Land_Transport_to_Improve_the_UAV's_Performances_for_Longer_Mission_Coverage_in_Smart_Cities","329579418_A_Generic_Spatiotemporal_UAV_Scheduling_Framework_for_Multi-Event_Applications","328372445_When_UAVs_Ride_A_Bus_Towards_Energy-efficient_City-scale_Video_Surveillance","327210620_Vehicle_Routing_Problem_with_Time_Windows_Using_Meta-Heuristic_Algorithms_A_Survey_Theory_and_Applications_ICHSA_2018","325707684_Drones_path_planning_for_WSN_data_gathering_A_column_generation_heuristic_approach"]}