{"id":"334075956_How_Smart_Cities_Became_the_Urban_Norm_Power_and_Knowledge_in_New_Songdo_City","abstract":"In this article we ask why smart cities have emerged within the international development community as the normative urban logic for confronting systemic global crises. This phenomenon is exemplified by the embrace of smart cities as an implementation tool for UN Habitat’s aspirational New Urban Agenda. Our analysis deploys two theoretical approaches in novel combination. First, we reinterpret Foucault’s governmentality concept through the lens of Lefebvre’s planetary urbanization thesis. This approach reveals global crises and systemic instability as neglected lines of inquiry within the smart city discourse, particularly in scholarship that has viewed technocratic rationality and neoliberalism as primary mechanisms of capitalist reproduction. Our use of Lefebvre positions smart city governmentality within this neglected context. Our second theoretical approach goes beyond critical urban theory’s emphasis on social justice to consider its value in explaining rational-technocratic planning vis-à-vis Lefebvre’s “critical zone” of full planetary urbanization. We argue that smart cities represent an emergent form of critical zone urbanism. The article begins with a review of governmentality and planetary urbanization that establishes the foundation for the study’s case analysis of New Songdo City. We then analyze the Songdo project, its related actors and power brokers, and its evolution from test bed to implementation model that becomes the new urban norm. The conclusion synthesizes elements of the case and novel theoretical approach to highlight distinctions between cities as organically evolving entities and those as products of totalizing technocratic norms. Key Words: governmentality, planetary urbanization, smart cities.","authors":["Glen David Kuecker","Kris Hartley"],"meta":["June 2019Annals of the American Association of Geographers 110(1):1-9","DOI:10.1080/24694452.2019.1617102"],"references":["320952201_What_is_so_wicked_about_wicked_problems_A_conceptual_analysis_and_a_research_program","320948681_Promoting_smart_cities_in_developing_countries_Policy_insights_from_Vietnam","319560028_Foucault_and_the_smart_city","314410892_The_Real-Time_City_Big_Data_and_Smart_Urbanism","312165880_The_New_Urban_Agenda_Key_Opportunities_and_Challenges_for_Policy_and_Practice","332453841_Encountering_Development_The_Making_and_Unmaking_of_the_Third_World","323321705_Governmental_Rationality_An_Introduction","316563915_The_Order_of_Things_An_Archaeology_of_the_Human_Sciences","315000952_The_Concept_of_Cultural_Hegemony_Problems_and_Possibilities","310793935_Development_of_a_smart_city_and_its_adoption_and_acceptance_The_case_of_new_Songdo"]}