{"id":"334022499_Toward_Artificial_Emotional_Intelligence_for_Cooperative_Social_Human-Machine_Interaction","abstract":"The aptitude to identify the emotional states of others and response to exposed emotions is an important aspect of human social intelligence. Robots are expected to be prevalent in society to assist humans in various tasks. Human-robot interaction (HRI) is of critical importance in the assistive robotics sector. Smart digital assistants and assistive robots fail quite often when a request is not well defined verbally. When the assistant fails to provide services as desired, the person may exhibit an emotional response such as anger or frustration through expressions in their face and voice. It is critical that robots understand not only the language, but also human psychology. A novel affection-based perception architecture for cooperative HRIs is studied in this paper, where the agent is expected to recognize human emotional states, thus encourages a natural bonding between the human and the robotic artifact. We propose a method to close the loop using measured emotions to grade HRIs. This metric will be used as a reward mechanism to adjust the assistant's behavior adaptively. Emotion levels from users are detected through vision and speech inputs processed by deep neural networks (NNs). Negative emotions exhibit a change in performance until the user is satisfied.","authors":["Berat Alper Erol","Abhijit Majumdar","Patrick Benavidez","Paul Rad"],"meta":["June 2019IEEE Transactions on Computational Social Systems PP(99):1-13","DOI:10.1109/TCSS.2019.2922593"],"references":["326952269_Speaker_Recognition_for_Robotic_Control_via_an_IoT_Device","324837514_Improved_Deep_Neural_Network_Object_Tracking_System_for_Applications_in_Home_Robotics","320127779_Humor_in_Human-Computer_Interaction_A_Short_Survey","313713649_DAGER_Deep_Age_Gender_and_Emotion_Recognition_Using_Convolutional_Neural_Network","328371844_Geospatial_Event_Detection_by_Grouping_Emotion_Contagion_in_Social_Media","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318810580_A_deep_vision_landmark_framework_for_robot_navigation","317316888_Towards_the_Development_of_Affective_Facial_Expression_Recognition_for_Human-Robot_Interaction","315915453_System_and_method_for_recognizing_human_emotion_state_based_on_analysis_of_speech_and_facial_feature_extraction_applications_to_human-robot_interaction","313905382_Emotion_Recognition_in_the_Wild_via_Convolutional_Neural_Networks_and_Mapped_Binary_Patterns"]}