{"id":"334122369_Student_attitude_towards_Mathematics_and_performance_Does_the_teacher_attitude_matter","abstract":"The indispensable role of attitude in the learning of Mathematics has garnered the attention of educational researchers and Mathematics educators for a very long time. Hence, literature is replete with empirical evidence on the relationship between teacher attitude and student academic performance in Mathematics. The study was fashioned to extend the discussion to the influence of teacher attitude on student attitude. The samples for the study were one hundred students and four Mathematics teachers making a total of one hundred and four respondents. The students were randomly selected while the teachers were purposively sampled. Two sets of questionnaires were used to gather data from the respondents after they had been validated and their reliability established. Students' end of term examination scores were used as a measure of students' academic achievements. The study unveiled a significant relationship between teacher attitude and student attitude toward Mathematics. It was realised that teachers' positive attitude radiated confidence in students hence made them develop positive attitude towards the learning of Mathematics. The results of the study were also consistent with existing findings on the relationship between teacher attitude and students' performance in Mathematics. Implications of the findings are discussed and recommendations have been proffered for practice.","authors":["J K Mensah","Mavis Okyere"],"meta":["June 2019"],"references":["287771184_2002_-_Rethinking_characterizations_of_beliefs","251196021_STUDENTS'_ATTITUDE_TOWARDS_MATHEMATICS","292682366_The_Psychology_of_Attitudes_and_Attitude_Change","292244441_Relationship_between_teachers'_attitude_and_students'_academic_achievement_in_mathematics_in_some_selected_senior_secondary_schools_in_southwstern_Nigeria","275849329_Mathematical_Problem_Solving","271814224_Assessing_the_Relationship_between_Attitude_toward_Mathematics_and_Achievement_in_Mathematics_A_Meta-Analysis","271697566_Spatial-Mechanical_Reasoning_Skills_Versus_Mathematics_Self-Confidence_as_Mediators_of_Gender_Differences_on_Mathematics_Subtests_Using_Cross-National_Gender-Based_Items","251562279_Instances_of_mathematical_thinking_among_low_attaining_students_in_an_ordinary_secondary_classroom","249002093_Mathematics_anxiety_prior_experience_and_confidence_to_teach_mathematics_among_pre-service_education_students","248985978_Crafting_multicultural_science_education_with_preservice_teachers_through_service-learning"]}