{"id":"334100298_Strong_and_Weak_Spatial_Segregation_with_Multilevel_Discrimination_Criteria","abstract":"This paper is influenced by the research of Thomas Schelling on spatial segregation; in his seminal work on the subject he used simple simulations to show that even highly tolerant individuals end up being spatially aggregated far beyond of the local requirement of their tolerance level.\nIn this paper we are not seeking to find the conditions, in terms of density of population and tolerance level, that lead to a global stable state where all the individuals are satisfied in view of their own neighbourhoods.\nHere the context is (i) a space full of agents where each individual is in continual contact with a maximum number of neighbours and (ii) where both a principal and a secondary discrimination criteria, compel people to leave their places.\nAs, in general, the first hypothesis not allows the population to convergence within the meaning of Schelling, only incomplete segregation phenomenons are observable.\nSo the problematic will be to determine, according to the respective strength of the two discrimination criteria, the spatial repartition of the agents resulting from their moves; in such a general context, we will refer to segregation as being strong or weak or even mixed.","authors":["Philippe Collard"],"meta":["June 2019Complex Systems 28(2):197-218","DOI:10.25088/ComplexSystems.28.2.197"],"references":["281885178_How_to_Prevent_Intolerant_Agents_from_High_Segregation","304254963_Segregation_Landscape_A_new_view_on_the_Schelling_segregation_space","268462153_Beyond_the_schelling's_segregation_is_it_equivalent_to_be_repulsed_by_dissimilar_rather_to_be_attracted_by_similar","265771710_Percolation_processes_I_Crystals_and_mazes","258171080_Emergence_of_Frontiers_in_Networked_Schelling_Segregationist_Models","236628761_Netlogo","235737541_From_Factors_to_Actors_Computational_Sociology_and_Agent-Based_Modeling","230818214_Dynamic_Models_of_Segregation","228525909_Computing_the_complexity_for_Schelling_segregation_models","228321114_A_Dynamic_Model_of_Residential_Segregation"]}