{"id":"334139594_Pengembangan_Sistem_Monitoring_Aset_Berbasis_Lokasi_Pada_Platform_Mobile","abstract":"Abstrak Pada sebuah organisasi atau perusahaan tentunya memiliki aset untuk menunjang kegiatan operasionalnya, sehingga sangat penting untuk dilakukan pemeliharaan aset itu sendiri. Pemeliharaan aset bertujuan untuk melacak status dari aset tersebut, juga termasuk lokasi dan kondisi aset. Pemeliharaan aset tingkat tinggi dengan sistem terintegrasi dibutuhkan untuk meningkatkan efektivitas dalam melakukan pemeliharaan aset. Pada Fakultas Ilmu Komputer kegiatan pemeliharaan aset dilakukan secara manual yaitu dengan cara staf yang bertugas memeriksa aset secara langsung, kemudian aset yang rusak ditulis dibuku untuk kemudian dilakukan pembuatan laporan secara manual. Pembukuan manual tersebut menyebabkan rentan terjadi kehilangan data dan pengelompokan data yang kurang baik. Sistem monitoring aset berbasis lokasi dirancang dan dibangun untuk mingkatkan efektifitas dan efisiensi dalam proses pemeliharaan aset yang masih manual. Sistem ini dibangun dengan basis mobile. Sistem ini menggunakan location based service yang akan memudahkan dalam proses memetakan lokasi aset yang tersebar dan mencocokkan lokasi monitoring dilakukan dan lokasi aset. Berdasarkan hasil pengujian usability menunjukkan bahwa 89.8% pengguna setuju bahwa sistem layak digunakan dan diterapkan. Sedangkan pada uji fungsionalitas dan non-fungsional menghasilkan bahwa sistem ini valid dan layak digunakan. Ini menunjukan bahwa sistem ini berhasil di implementasikan pada bagian pemeliharaan aset sehingga menghasilkan aplikasi yang dapat diterima oleh pengguna khususnya pengguna di lingkungan Divisi Perlengkapan Fakultas Ilmu Komputer. Abstract In an organization or company certainly has assets to support its operational activities, so it is very important to do the maintenance of the asset itself. Asset maintenance aims to track the status of the asset, including the location and condition of the asset. Maintenance of high-level assets with integrated systems is needed to increase effectiveness in carrying out asset maintenance. At the Faculty of Computer Science asset maintenance activities are carried out manually, namely by the staff tasked with examining assets directly, then the damaged assets are written in the book for later making reports manually. The manual bookkeeping causes data loss and poor data grouping. Location-based asset monitoring systems are designed and built to improve the effectiveness and efficiency of manual asset maintenance processes. This system is built on a mobile basis. This system uses location based service that will make it easier in the process of mapping the location of scattered assets and matching the location of monitoring and location of assets. Based on the results of usability testing shows that 89.8% of users agree that the system is worthy of being used and applied. Whereas in the functional and non-functional test results that this system is valid and feasible to use. This shows that this system has been successfully implemented in the asset maintenance section to produce applications that can be accepted by users, especially users in the","authors":["Muchammad Rizal","Herman Tolle","Lutfi Fanani"],"meta":["February 2019","Project: Geotagging App for Smart City Project"],"references":["322828759_EVALUASI_PERFORMA_USABILITY_SITUS-SITUS_WEB_PERGURUAN_TINGGI_NEGERI_DI_INDONESIA_YANG_TERAKREDITASI_A_TAHUN_2013_SERTA_PERBANDINGAN_KONDISI_SITUS_WEB_TAHUN_2014_DAN_2017","287235020_Information_Quality_Management_Capability_Maturity_Model","261146570_Mobile_collaboration_technology_in_engineering_asset_maintenance_A_Delphi_study","323953482_Gesture_Based_Sensor_Device_With_GPS_and_GSM_Technology_for_Dumb_People","322710038_Software_requirement_specification_of_intelligent_system_for_monitoring_and_preventing_smartphone_addiction","322588892_Performance_evaluation_of_embedded_color_QR_codes_on_logos","319709523_Teknologi_Location_Based_Service_Global_Positioning_System_Pada_Perangkat_Mobile","285838148_Usability_101_introduction_to_usability"]}