{"id":"334150159_Novel_TTN_mutations_and_muscle_imaging_characteristics_in_congenital_titinopathy_Mutations_and_Muscle_MRI_in_Congenital_Titinopathy","abstract":"Objective: \nWe present clinical features, muscle imaging findings, and genetic characteristics of five unrelated Chinese patients with congenital titinopathy, emphasizing the diagnostic role of muscle MRI.\n\nMethods: \nFive patients who recessive titinopathies were recruited. All patients received muscle biopsies. Mutations were detected by panel massively parallel sequencing and confirmed by Sanger sequencing. Western blotting of muscle proteins was performed. Leg muscle MRIs were performed in four patients.\n\nResults: \nFour patients aged 1-4 years old showed delayed motor development from early infancy, while a 17-year-old boy showed only a 1-year history of exercise intolerance. Physical examination showed proximal weakness in three patients. Muscle biopsies demonstrated multiple myopathological changes, including increased internalized nuclei, multicores, central cores, and dystrophic changes. Genetic sequencing revealed compound heterozygous or homozygous novel TTN mutations, including six frameshift mutations, one nonsense mutation, two missense mutations, one splicing mutation, and one small nonframeshift deletion. Protein analyses revealed significant decrease of full-length titin in all patients. Thigh muscle MRIs in four patients showed prominent fatty infiltration in the upper portion of semitendinosus and the peripheral portion of gluteus medius, while the sartorius and gracilis were relatively preserved.\n\nInterpretation: \nThese cases provided further evidence that TTN mutations are likely responsible for an increasing proportion of congenital myopathies than currently recognized. The novel mutations reported expand the mutation spectrum of the TTN gene. There is a characteristic pattern of muscle involvement in congenital titinopathy regardless of clinical or pathological phenotype, providing valuable clues for guiding a genetic diagnosis workup.","authors":["Meng Yu","Ying Zhu","Zhiying Xie","Yiming Zheng"],"meta":["July 2019Annals of Clinical and Translational Neurology 6(Pt 6)","DOI:10.1002/acn3.50831"],"references":["325447470_Magnetic_Resonance_Imaging_Findings_in_the_Muscle_Tissue_of_Patients_with_Limb_Girdle_Muscular_Dystrophy_Type_2I_Harboring_the_Founder_Mutation_c545AG_in_the_FKRP_Gene","324129193_The_complexity_of_titin_splicing_pattern_in_human_adult_skeletal_muscles","323139303_Interpreting_Genetic_Variants_in_Titin_in_Patients_With_Muscle_Disorders","321732500_TITINdb-a_computational_tool_to_assess_titin's_role_as_a_disease_gene","316078246_Mutational_spectrum_of_Chinese_LGMD_patients_by_targeted_next-generation_sequencing","331757702_Recessive_mutations_in_proximal_I-band_of_TTN_gene_cause_severe_congenital_multi-minicore_disease_without_cardiac_involvement","325505402_Novel_TTN_Mutation_Causing_Congenital_Myopathy","324753633_Congenital_Titinopathy_Comprehensive_characterization_and_pathogenic_insights","322895433_Congenital_myopathies_Disorders_of_excitation-contraction_coupling_and_muscle_contraction","312632790_Myopathology_in_times_of_modern_imaging"]}