{"id":"334179151_Visualizing_the_Knowledge_Structure_and_Research_Evolution_of_Infrared_Detection_Technology_Studies","abstract":"This paper aims to explore the current status, research trends and hotspots related to the field of infrared detection technology through bibliometric analysis and visualization techniques based on the Science Citation Index Expanded (SCIE) and Social Sciences Citation Index (SSCI) articles published between 1990 and 2018 using the VOSviewer and Citespace software tools. Based on our analysis, we first present the spatiotemporal distribution of the literature related to infrared detection technology, including annual publications, origin country/region, main research organization, and source publications. Then, we report the main subject categories involved in infrared detection technology. Furthermore, we adopt literature cocitation, author cocitation, keyword co-occurrence and timeline visualization analyses to visually explore the research fronts and trends, and present the evolution of infrared detection technology research. The results show that China, the USA and Italy are the three most active countries in infrared detection technology research and that the Centre National de la Recherche Scientifique has the largest number of publications among related organizations. The most prominent research hotspots in the past five years are vibration thermal imaging, pulse thermal imaging, photonic crystals, skin temperature, remote sensing technology, and detection of delamination defects in concrete. The trend of future research on infrared detection technology is from qualitative to quantitative research development, engineering application research and infrared detection technology combined with other detection techniques. The proposed approach based on the scientific knowledge graph analysis can be used to establish reference information and a research basis for application and development of methods in the domain of infrared detection technology studies.","authors":["Rui Hong","Chenglang Xiang","Hui Liu","Adam Glowacz"],"meta":["July 2019Information (Switzerland) 10(7):227","DOI:10.3390/info10070227"],"references":["328535419_Experimental_approach_for_breast_cancer_center_estimation_using_infrared_thermography","327958558_Quantification_of_heat_energy_losses_through_the_building_envelope_A_state-of-the-art_analysis_with_critical_and_comprehensive_review_on_infrared_thermography","327070987_Visualization_and_Bibliometric_Analysis_of_Research_Trends_on_Human_Fatigue_Assessment","326403786_Infrared_thermography_to_monitor_body_and_udder_skin_surface_temperature_differences_in_relation_to_subclinical_and_clinical_mastitis_condition_in_karan_fries_bos_taurus_bos_indicus_crossbred_cows","325304334_A_Numerical_Study_on_Interlaminar_Defects_Characterization_in_Fibre_Metal_Laminates_with_Flying_Laser_Spot_Thermography","323398243_Evaluation_of_high_resolution_thermal_imaging_to_determine_the_effect_of_vertebral_fractures_on_associated_skin_surface_temperature_in_children_with_osteogenesis_imperfecta","323281886_Recent_Advances_in_Active_Infrared_Thermography_for_Non-Destructive_Testing_of_Aerospace_Components","330412196_Breast_Cancer_Detection_in_Thermal_Infrared_Images_Using_Representation_Learning_and_Texture_Analysis_Methods","327383874_Effects_of_rebars_on_the_detectability_of_subsurface_defects_in_concrete_bridges_using_square_pulse_thermography","324179150_Non-contact_Electromagnetic_Induction_Excited_Infrared_Thermography_for_Photovoltaic_Cells_and_Modules_Inspection"]}