{"id":"334105265_Will_the_Machine_Like_Your_Image_Automatic_Assessment_of_Beauty_in_Images_with_Machine_Learning_Techniques","abstract":"Although the concept of image quality has been a subject of study for the image processing community for more than forty years (where, with the term “quality”, we are referring to the accuracy with which an image processing system captures, processes, stores, compresses, transmits, and displays the signals that compose an image), notions related to aesthetics of photographs and images have only appeared for about ten years within the community. Studies devoted to aesthetics of images are multiplying today, taking advantage of the latest machine learning techniques and mostly due to the proliferation of huge communities and websites, specialized in digital photography sharing and archiving, such as Flickr, Imgur, DeviantArt, and Instagram. In this review, we examine the latest advances of computer methods that aim at computationally distinguishing high-quality from low-quality photos and images, relying on machine learning techniques. The paper is organized as follows: First, we introduce many approaches to aesthetics, studied in philosophy, neurobiology, experimental psychology, and sociology, to see what lighting they propose to researchers. Such points of view let us explain the weakness of the current consensus on the difficult aesthetics problem and the importance of the ongoing debates on it. Then, we analyze the work done in the community of pattern recognition and artificial intelligence on the task of automatic aesthetic assessment, and we both compare and critically examine the presented results. Finally, we describe many issues that have not been addressed, and starting from these, we outline some possible future directions.","authors":["Matteo Bodini"],"meta":["June 2019Inventions 4(3):34","DOI:10.3390/inventions4030034"],"references":["331094835_A_Review_of_Facial_Landmark_Extraction_in_2D_Images_and_Videos_Using_Deep_Learning","303821694_Photo_Aesthetics_Ranking_Network_with_Attributes_and_Content_Adaptation","345618935_The_Arts_are_More_than_Aesthetics_Neuroaesthetics_as_Narrow_Aesthetics","328182654_A_Survey_of_FMRI_Data_Analysis_Methods","324355447_Aesthetics_and_Psychobiology","314570771_Learning_Relative_Aesthetic_Quality_with_a_Pairwise_Approach","303521182_Describing_Human_Aesthetic_Perception_by_Deeply-learned_Attributes_from_Flickr","302220082_Visual_aesthetic_quality_assessment_with_a_regression_model","299585708_Neuroscience_of_aesthetics","288297044_Introduction_a_une_esthetique_scientifique"]}