{"id":"334113677_Multi-level_cognitive_concept_learning_method_oriented_to_data_sets_with_fuzziness_a_perspective_from_features","abstract":"As a new interdisciplinary field induced by formal concept analysis, rough set, granular computing and cognitive computing, cognitive concept learning has received a great attention in recent years. Cognitive concept learning refers to the acquisition of specific concepts through specific cognitive concept learning approaches. The processes of concept learning mainly focus on simulating human brain recognizing concepts through the modeling of brain intelligence. In this paper, we investigate the mechanism of multi-level cognitive concept learning method oriented to data sets with fuzziness by discussing the process of human cognition. Through a newly defined fuzzy focal feature set, we put forward a corresponding structure of feature-oriented multi-level cognitive concept learning method in data sets with fuzziness from a perspective of philosophical and psychological views of human cognition. To make the presented cognitive concept learning approach much easier to understand and to apply it to practice widely, we establish an algorithm to recognize fuzzy concepts and incomplete fuzzy concepts. In addition, we present a case study about how to recognize and distinguish any two different micro-expressions from an information system with quantitative description to use our proposed method and theory to solve conceptual cognition problems, and also we perform an experimental evaluation on five data sets downloaded from the University of California-Irvine databases. Compared with the existing granular computing approach to two-way learning, we obtain more concepts than the two-way learning approach, which shows the feasibility and effectiveness of our feature-oriented multi-level cognitive learning method in data sets with fuzziness.","authors":["E.C.C. Tsang","Bingjiao Fan","Degang Chen","Weihua Xu"],"meta":["March 2020Soft Computing 24(4)","DOI:10.1007/s00500-019-04144-7"],"references":["354885892_m-polar_fuzzy_graph_representation_of_concept_lattice","326815424_Three-way_n-valued_neutrosophic_concept_lattice_at_different_granulation","323648136_Bipolar_fuzzy_concept_learning_using_next_neighbor_and_Euclidean_distance","320838245_Concept_lattice_visualization_of_data_with_m-polar_fuzzy_attribute","319859324_Medical_diagnoses_using_three-way_fuzzy_concept_lattice_and_their_Euclidean_distance","319639039_Concept_Learning_Using_Vague_Concept_Lattice","308272910_Three-way_conceptual_approach_for_cognitive_memory_functionalities","318828018_Establishment_of_Cognitive_Relations_Based_on_Cognitive_Informatics","317719988_On_attribute_reduction_in_concept_lattices_Methods_based_on_discernibility_matrix_are_outperformed_by_basic_clarification_and_reduction","312913306_Three-way_concept_learning_based_on_cognitive_operators_An_information_fusion_viewpoint","306399426_Three-way_fuzzy_concept_lattice_representation_using_neutrosophic_set","303876801_Cognitive_concept_learning_from_incomplete_information","304068423_Concept_lattices_with_negative_information_A_characterization_theorem","301920721_Three-way_cognitive_concept_learning_via_multi-granularity","297501492_Handbook_of_Granular_Computing"]}