{"id":"334131298_Methods_and_outcomes_of_the_COMRADE_project_-_Design_of_robust_Combined_control_for_robotic_spacecraft_and_manipulator_in_servicing_missions_comparison_between_between_Hinf_and_nonlinear_Lyapunov-base","abstract":"Extending life or repairing damaged on-orbit assets is not only a very attractive economic option for satellite operators as it could potentially increase margins for commercial services or increasing delivered value of scientific missions, but it would also help reducing the number of debris objects in space. These types of servicing missions pose technical challenges never faced until now. Of utmost relevance is the autonomous control of several movable devices, whose dynamics are inter-coupled (e.g., spacecraft platform, robotic manipulator, and end-effector), needed to safely and effectively achieve the mission objective. In the frame of ESA-supported COMRADE study, fully combined control (single control system controlling simultaneously all movable devices) is proposed due to its higher improvement potential (propellant saving, performances increase, safety) w.r.t. tele-operation, decoupled and/or collaborative control (the last one characterized by the use of two different control systems for the spacecraft platform and robotic manipulator respectively but, differently to the decoupled version, with information/feedback about what the other control system intends to do). Two independent combined control designs are developed in COMRADE (H∞ and nonlinear Lyapunov-based), and tested. Each of them is applied for both Active Debris Removal (ADR) and servicing/re-fuelling mission scenarios. This paper presents: the processes of scenario analysis and derivation of COMRADE system requirements; a description of the design and setup for a Simulator, which included at its core the selection, prototyping and integration of algorithms for Guidance, Navigation and Control (GNC), Modes Management (AMM) and Failures Detection, Isolation and Recovery (FDIR) (all three together compose the COMRADE system) and the outcomes of the simulation phase of the Verification & Validation process.","authors":["Pablo Colmenarejo","João Branco","Nuno Santos","Pedro Serra"],"meta":["October 2018","Conference: 69th International Astronautical Congress (IAC)At: Bremen, Germany"],"references":["312039609_Dynamics_and_control_of_a_free-floating_space_robot_in_presence_of_nonzero_linear_and_angular_momenta","299446677_GNC_DESIGN_AND_VALIDATION_FOR_RENDEZVOUS_DETUMBLING_AND_DE-ORBITING_OF_ENVISAT_USING_A_CLAMPING_MECHANISM","279256869_From_fault_diagnosis_to_recovery_actions_for_aeronautic_and_aerospace_missions_A_model-based_point_of_view","277726574_Robust_FDI_for_fault-tolerant_thrust_allocation_with_application_to_spacecraft_rendezvous","273095280_Position_and_Attitude_Model-Based_Thruster_Fault_Diagnosis_A_Comparison_Study","317019305_Bibliographical_review_on_reconfigurable_fault-tolerant_control_systems","282057141_Fault_Diagnosis_of_the_Microscope_Satellite_Thrusters_using_HinfH-_Filters","278962181_On-ground_experimental_verification_of_a_torque_controlled_free-floating_robot","276266152_Two_inputoutput_port_model_approach_for_mechanical_systems","269017677_Control_of_Complex_Systems"]}