{"id":"334129229_Evaluating_a_course_for_teaching_introductory_programming_with_Scratch_to_pre-service_kindergarten_teachers","abstract":"A growing number of countries, in Europe and beyond have established clear policies and frameworks for introducing Computational Thinking and computer programming to young children. Researchers, educators, and key stakeholders believe that these skills should be taught and used in early childhood classrooms to initiate the cognitive development of students at an earlier age. The introduction of CT in the curriculum is creating a strong demand for pre-service development, as many teachers did not learn about CT and computer programming in their initial education. In response to this identified need, new initiatives in Universities are underway seeking to bring CT and programming into pre-service teachers’ education around the world. We adopted Scratch as the introductory programming language for a semester course in the department of Preschool Education in the University of Crete. The aim of using Scratch was to excite students’ interest and familiarise them with the basics of programming. For 13 weeks, students were introduced to the main Scratch concepts and, afterwards, were asked to prepare their projects. For the projects, they were required to develop a game to teach certain concepts about Mathematics or Physical Science and/or present an Aesop myth to preschool age students. The results we obtained were more satisfactory than expected and, in some regards, encouraging.","authors":["Stamatios J Papadakis","Michail Kalogiannakis"],"meta":["January 2019International Journal of Technology Enhanced Learning 11(3):231","DOI:10.1504/IJTEL.2019.100478","Project: Teaching programming in novices"],"references":["329191291_European_Framework_for_the_Digital_Competence_of_Educators_DigCompEdu","323592948_Gender_stereotypes_in_Greek_computer_science_school_textbooks","323181812_The_use_of_computer_games_in_classroom_environment","322185294_Comparing_novice_programing_environments_for_use_in_secondary_education_App_Inventor_for_Android_vs_Alice","322082550_MYTH_TROUBLES_An_Open-Source_Educational_Game_in_Scratch_for_Greek_Mythology","322021498_Using_Gamification_for_Supporting_an_Introductory_Programming_Course_The_Case_of_ClassCraft_in_a_Secondary_Education_Classroom","324915815_Learning_a_programming_language","322923352_How_do_you_feel_about_learning_to_code_Investigating_the_effect_of_children's_attitudes_towards_coding_using_eye-tracking","322839334_Improving_programming_skills_in_engineering_education_through_problem-based_game_projects_with_Scratch","322236473_Exploring_an_approach_based_on_digital_games_for_teaching_programming_concepts_to_young_children"]}