{"id":"334105379_Models_and_modelling_for_authentic_STEM_education_reinforcing_the_argument","abstract":"This commentary expands the notion that models and modelling can be used as a basis to foster an integrated and authentic STEM education and STEM literacy. The aim is to synthesize key publications that document relationships between authenticity, models and modelling, and STEM education. The implications of the synthesis are as follows: authenticity must be viewed as a cornerstone of STEM literacy; models and modelling processes can bridge the gap between STEM disciplines through authentic practices; models and modelling should be used as a means to promote STEM literacy and the transfer of knowledge and skills between contexts, both in and out of the STEM disciplines; modelling activities can serve as a meaningful route toward authentic STEM education; teaching authentic modelling processes must be rooted in explicit and tested frameworks that are based on the practice of the STEM disciplines; and, authentic STEM education should be driven by developing interaction between STEM subjects in parallel with maintaining the integrity of each subject. If this vision is to be reinforced, it is of utmost importance that implementing any model-based authentic educational activities are underpinned by evidence-based frameworks and recommendations for teaching practice. It is therefore imperative that intended model-based pedagogies for STEM education classrooms are further researched, in order to contribute to an integrated STEM literacy.","authors":["Jonas Hallström","Konrad J. Schönborn"],"meta":["June 2019International Journal of STEM Education 6(22)","DOI:10.1186/s40594-019-0178-z","Project: aSTEM: Models and modelling for authentic STEM education"],"references":["333681977_Laying_down_the_T_and_E_in_STEM_education_Design_as_the_basis_of_an_integrated_STEM_philosophy","330713556_In_Pursuit_of_Authenticity_in_Science_Education","330371844_Teachers'_perception_of_STEM_integration_and_education_a_systematic_literature_review","329937274_STEM_literacy_or_literacies_Examining_the_empirical_basis_of_these_constructs","328743605_The_reality_of_STEM_education_design_and_technology_teachers'_perceptions_a_phenomenographic_study","336091307_Model-Eliciting_Activities_for_Engineering_Education","336091254_A_Modeling_Perspective_on_Learning_and_Teaching_in_Engineering_Education","327272575_Models_and_Modelling_in_Mathematics_Education","323934855_Engineering_and_the_Mind's_Eye","321611754_Developing_Models_in_Science_Education"]}