{"id":"334109766_The_Seven_Key_Challenges_for_the_Future_of_Computer-Aided_Diagnosis_in_Medicine","abstract":"Background. Computer-aided diagnosis (CAD) can assist physicians in effective and efficient diagnostic decision-making. CAD systems are currently essential tools in some areas of clinical practice. In addition, it is one of the established fields of study in the interface of medicine and computer science. There are, however, still some critical challenges that CAD systems face. \nMethods. This paper first describes a new literature review protocol, the Dynamic PRISMA approach based on the well-known PRISMA (Preferred Reporting Items for Systematic reviews and Meta-Analyses) approach. This new approach enhances the traditional approach by integrating a feedback mechanism module. As a result of the literature review, next this paper identifies seven major challenges that occur today in CAD and inhibit the next major developments. \nResults. The seven challenges described in this paper involve some technical weaknesses in the interface of medicine and computer science. These challenges are related to various algorithmic limitations, the difficulty of medical professionals to adopt new systems, problems when dealing with patient data, and the lack of guidelines and standardization regarding many aspects of CAD. This paper also describes some of the recent research developments towards these challenges.\nConclusion. If these seven key challenges are addressed properly, then the ways for dealing with them will become the R&D pillars needed to bring CAD to the next level. This would require additional well-coordinated collaboration between researchers and practitioners in the fields of medicine and computer science.\n\nKeywords: Computer-aided diagnosis (CAD); segmentation; feature extraction / selection; classification; PRISMA approach; big data.","authors":["Juri Yanase","Evangelos Triantaphyllou"],"meta":["September 2019International Journal of Medical Informatics 129(September 2019):413-422","DOI:10.1016/j.ijmedinf.2019.06.017","Project: Medical Decision Making.  Emphasis on computer-aided diagnosis (CAD)"],"references":["334533554_A_Systematic_Survey_of_Computer-Aided_Diagnosis_in_Medicine_Past_and_Present_Developments","329850815_Validation_of_Prediction_Models_for_Critical_Care_Outcomes_Using_Natural_Language_Processing_of_Electronic_Health_Record_Data","329051001_Automated_detection_of_imaging_features_of_disproportionately_enlarged_subarachnoid_space_hydrocephalus_using_machine_learning_methods","327098624_A_bibliometric_analysis_of_neutrosophic_set_two_decades_review_from_1998_to_2017","326219697_Medical_and_Biological_Image_Analysis","344619178_Smart_Machines_IBM's_Watson_and_the_Era_of_Cognitive_Computing","329297557_Multimodal_Image_Fusion_for_Cardiac_Resynchronization_Therapy_Planning_Applications_and_Computational_Techniques","328887117_Cardiac_sarcoidosis_classification_with_deep_convolutional_neural_network-based_features_using_polar_maps","327030899_The_Challenge_of_Regulating_Clinical_Decision_Support_Software_After_21_st_Century_Cures","324013916_EEG_signal_classification_using_universum_support_vector_machine"]}