{"id":"334113365_Data_Science_for_Genomic_Data_Management_Challenges_Resources_Experiences","abstract":"We highlight several challenges which are faced by data scientists who use public datasets for solving biological and clinical problems. In spite of the large efforts in building such public datasets, they are dispersed over many sources and heterogeneous for their formats and sequencing/calling techniques, often meeting highly variable quality standards. Moreover, for most research questions, scientists hardly find datasets with enough samples for building and training machine learning models. Data scarcity depends on the complexity of the genomic domain, with its multi-facets, as well as the lack of organic initiatives to provide standardization across communities. In this paper, we discuss our approach to genomic data management, that can strongly improve the problems of data dispersion and format heterogeneity through high-level abstractions for genomics. We briefly present the computational resources that were recently developed by the GeCo project (ERC Advanced Grant); they include GDM, a Genomic Data Model providing interoperability across data formats; GMQL, a genometric query language for answering data science queries over genomic datasets; and an in-house integrated repository providing attribute-based and keyword-based search over normalized metadata from several open data repositories. We describe these resources at work on a specific research question, and we highlight how we managed to produce a model for addressing such specific research question by overcoming the lack of sufficient samples and labelled datasets.","authors":["Stefano Ceri","Pietro Pinoli"],"meta":["June 2019SN Computer Science 1(1)","DOI:10.1007/s42979-019-0005-0"],"references":["331539388_New_functionalities_in_the_TCGAbiolinks_package_for_the_study_and_integration_of_cancer_data_from_GDC_and_GTEx","329776670_TICA_Transcriptional_Interaction_and_Coregulation_Analyzer","327020526_Processing_of_big_heterogeneous_genomic_datasets_for_tertiary_analysis_of_Next_Generation_Sequencing_data","324473820_Massive_mining_of_publicly_available_RNA-seq_data_from_human_and_mouse","312052033_TCGA2BED_Extracting_extending_integrating_and_querying_The_Cancer_Genome_Atlas","309547859_Cistrome_Data_Browser_A_data_portal_for_ChIP-Seq_and_chromatin_accessibility_data_in_human_and_mouse","320523719_Conceptual_Modeling_for_Genomics_Building_an_Integrated_Repository_of_Open_Data","308487751_Toward_a_Shared_Vision_for_Cancer_Genomic_Data","308123776_Modeling_and_interoperability_of_heterogeneous_genomic_big_data_for_integrative_processing_and_querying","305491644_The_Genotype-Tissue_Expression_GTEx_project","279863341_Big_Data_Astronomical_or_Genomical","257135001_The_Cancer_Genome_Atlas_Pan-Cancer_Analysis_Project","236957527_The_Genotype-Tissue_Expression_GTEx_project","305284190_Evaluating_cloud_frameworks_on_genomic_applications","260077576_The_ENCODE_ENCyclopedia_of_DNA_elements_projectEncode_Project_ConsortiumScience200430663664015499007"]}