{"id":"334166698_Peranan_Kecerdasan_Emosional_Pada_Pemilihan_Strategi_Coping_Pada_Mahasiswa_yang_Bekerja","abstract":"Â \nAbstract\n\nÂ Â Â Â Â Â Â Â Â Â Â Â Students who study while working must balance the demands of lectures and jobs at once. Individuals will make various efforts to master unpleasant demands, also known as coping strategies. On the other hand, emotional intelligence can influence the choice of someone's coping strategy, whether it tends to use problem-focused coping or emotion-focused coping. The aims of this study were to prove the relationship between emotional intelligence and coping strategy. The subjects of this study are 105 work-study computer science students of STMIK Mikroskil Medan selected by purposive sampling. Data was collected from scale to measure emotional intelligence and coping strategy. The analysis of data was performed by Pearson Product Moment Correlation with SPSS 19.00 for Windows. Result showed that there was a positive correlation between emotional intelligence and coping strategy. Another result showed that there was a positive correlation between emotional intelligence and problem-focused coping and emotion-focused coping.\n\nKeyword: emotional intelligence, coping strategy, problem-focused coping, emotion-focused coping\n\nÂ \n\nÂ \nAbstrak\n\nMahasiwa yang kuliah sambil bekerja harus mengimbangi tuntutan perkuliahan dan pekerjaan sekaligus. Individu akan melakukan berbagai usaha untuk menguasai tuntutan yang tidak menyenangkan, atau yang dikenal dengan strategi coping. Pada sisi lain, kecerdasan emosional dapat memengaruhi pemilihan strategi coping seseorang, apakah cenderung menggunakan problem-focused coping atau emotion-focused coping. Tujuan penelitian ini adalah untuk mengetahui hubungan antara kecerdasan emosional dan strategi coping. Subjek dalam penelitian ini adalah mahasiswa program studi Teknik Informatika STMIK Mikroskil Medan yang kuliah sambil bekerja sebanyak 105 orang yang dipilih dengan metode purposive sampling. Data diperoleh melalui skala untuk mengukur strategi coping dan kecerdasan emosional. Teknik analisis data yang digunakan dalam penelitian ini adalah Pearson Product Moment Correlation dengan bantuan SPSS 19.00 for Windows. Hasil penelitian menunjukkan adanya hubungan positif antara kecerdasan emosional dan strategi coping. Hasil lainnya menunjukkan adanya hubungan positif antara kecerdasan emosional dengan problem-focused coping dan emotion-focused coping.\n\nKata kunci: kecerdasan emosional, strategi coping, problem-focused coping, emotion-focused coping","authors":["Tommy Felix","Winida Marpaung","Mukhaira El Akmal"],"meta":["June 2019Persona Jurnal Psikologi Indonesia 8(1):39","DOI:10.30996/persona.v8i1.2377"],"references":["332363436_Hubungan_antara_Tingkat_Religiusitas_dengan_Kemampuan_dalam_Mengatasi_Stres_Coping_Stress","330962257_Hubungan_antara_Kecerdasan_Emosi_dengan_Koping_pada_Gamer","318914566_Psychological_Resources_and_Strategies_to_Cope_with_Stress_at_Work","318701997_An_Integrated_Model_of_Work-Study_Conflict_and_Work-Study_Facilitation","277668053_RELATIONSHIP_BETWEEN_EMOTIONAL_INTELLIGENCE_AND_COPING_STRATEGIES_AMONG_UNIVERSITY_TEACHERS_OF_KHYBER_PAKHTUNKHWA","271617481_The_Relationship_Between_Coping_Strategies_and_Emotional_Intelligence","326592995_Emotional_Intelligence_at_Workplace_-_A_Conceptual_Study","320255851_Emotional_intelligence_is_associated_with_connectivity_within_and_between_resting_state_networks","319851929_Hubungan_Antara_Tingkat_Stres_Kerja_dengan_Pemilihan_Coping_Stress_Strategy_Karyawan_di_Kantor_Pusat_Adira_Insurance","304377436_Emotional_Intelligence_Why_It_Can_Matter_More_Than_IQ","229185362_Emotional_intelligence_and_coping_styles_with_stress","228079117_Stress_Appraisal_and_Coping"]}