{"id":"334157324_Are_you_from_North_or_South_India_A_hard_face-classification_task_reveals_systematic_representational_differences_between_humans_and_machines","abstract":"We make a rich variety of judgments on faces, but the underlying features are poorly understood. Here we describe a challenging geographical-origin classification problem that elucidates feature representations in both humans and machine algorithms. In Experiment 1, we collected a diverse set of 1,647 faces from India labeled with their fine-grained geographical origin (North vs. South India), characterized the categorization performance of 129 human subjects on these faces, and compared this with the performance of machine vision algorithms. Our main finding is that while many machine algorithms achieved an overall performance comparable to that of humans (64%), their error patterns across faces were qualitatively different despite training. To elucidate the face parts used by humans for classification, we trained linear classifiers on overcomplete sets of features derived from each face part. This revealed mouth shape to be the most discriminative part compared to eyes, nose, or external contour. In Experiment 2, we confirmed that humans relied the most on mouth shape for classification using an additional experiment in which subjects classified faces with occluded parts. In Experiment 3, we compared human performance for briefly viewed faces and for inverted faces. Interestingly, human performance on inverted faces was predicted better by computational models compared to upright faces, suggesting that humans use relatively more generic features on inverted faces. Taken together, our results show that studying hard classification tasks can lead to useful insights into both machine and human vision.","authors":["Harish Katti","Sp Arun"],"meta":["July 2019Journal of Vision 19(7):1","DOI:10.1167/19.7.1"],"references":["331102840_Machine_vision_benefits_from_human_contextual_expectations","323894303_Multiplicative_mixing_of_object_identity_and_image_attributes_in_single_inferior_temporal_neurons","323266295_Genome-wide_mapping_of_global-to-local_genetic_effects_on_human_facial_shape","322336531_Categorization_for_Faces_and_Tools-Two_Classes_of_Objects_Shaped_by_Different_Experience-Differs_in_Processing_Timing_Brain_Areas_Involved_and_Repetition_Effects","319312236_Understanding_and_Comparing_Deep_Neural_Networks_for_Age_and_Gender_Classification","311609913_Analyzing_Classifiers_Fisher_Vectors_and_Deep_Neural_Networks","308913218_Do_They_All_Look_the_Same_Deciphering_Chinese_Japanese_and_Koreans_by_Fine-Grained_Deep_Learning","319770829_Robust_Real-time_Object_Detection","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318050175_How_do_targets_nontargets_and_scene_context_influence_real-world_object_detection"]}