{"id":"334247624_Human_Replay_Spontaneously_Reorganizes_Experience","abstract":"ed from previous experiences can be transferred to aid new learning. Here, we asked whether such abstract knowledge immediately guides the replay of new experiences. We first trained participants on a rule defining an ordering of objects and then presented a novel set of objects in a scrambled order. Across two studies, we observed that representations of these novel objects were reactivated during a subsequent rest. As in rodents, human \"replay\" events occurred in sequences accelerated in time, compared to actual experience, and reversed their direction after a reward. Notably, replay did not simply recapitulate visual experience, but followed instead a sequence implied by learned abstract knowledge. Furthermore, each replay contained more than sensory representations of the relevant objects. A sensory code of object representations was preceded 50 ms by a code factorized into sequence position and sequence identity. We argue that this factorized representation facilitates the generalization of a previously learned structure to new objects.","authors":["Yunzhe Liu","Raymond J Dolan","Zeb Kurth-Nelson","Timothy E.J. Behrens"],"meta":["July 2019Cell 178(3)","DOI:10.1016/j.cell.2019.06.012"],"references":["331605128_Neural_structure_mapping_in_human_probabilistic_reward_learning","330996174_Neural_Competitive_Queuing_of_Ordinal_Structure_Underlies_Skilled_Sequential_Action","327509095_The_geometry_of_abstraction_in_hippocampus_and_prefrontal_cortex","325129154_Prefrontal_cortex_as_a_meta-reinforcement_learning_system","320515578_Task_Demands_Predict_a_Dynamic_Switch_in_the_Content_of_Awake_Hippocampal_Replay","343018616_Generalisation_of_structural_knowledge_in_the_hippocampal-entorhinal_system","328509715_What_Is_a_Cognitive_Map_Organizing_Knowledge_for_Flexible_Behavior","327207235_Generative_Predictive_Codes_by_Multiplexed_Hippocampal_Neuronal_Tuplets","321666784_Human_learning_in_Atari","320139028_Temporal_structure_in_associative_retrieval"]}