{"id":"334205828_Constructing_an_Associative_Memory_System_Using_Spiking_Neural_Network","abstract":"Development of computer science has led to the blooming of artificial intelligence (AI), and neural networks are the core of AI research. Although mainstream neural networks have done well in the fields of image processing and speech recognition, they do not perform well in models aimed at understanding contextual information. In our opinion, the reason for this is that the essence of building a neural network through parameter training is to fit the data to the statistical law through parameter training. Since the neural network built using this approach does not possess memory ability, it cannot reflect the relationship between data with respect to the causality. Biological memory is fundamentally different from the current mainstream digital memory in terms of the storage method. The information stored in digital memory is converted to binary code and written in separate storage units. This physical isolation destroys the correlation of information. Therefore, the information stored in digital memory does not have the recall or association functions of biological memory which can present causality. In this paper, we present the results of our preliminary effort at constructing an associative memory system based on a spiking neural network. We broke the neural network building process into two phases: the Structure Formation Phase and the Parameter Training Phase. The Structure Formation Phase applies a learning method based on Hebb's rule to provoke neurons in the memory layer growing new synapses to connect to neighbor neurons as a response to the specific input spiking sequences fed to the neural network. The aim of this phase is to train the neural network to memorize the specific input spiking sequences. During the Parameter Training Phase, STDP and reinforcement learning are employed to optimize the weight of synapses and thus to find a way to let the neural network recall the memorized specific input spiking sequences. The results show that our memory neural network could memorize different targets and could recall the images it had memorized.","authors":["Hu He","Yingjie Shang","Xu Yang","Yingze Di"],"meta":["July 2019Frontiers in Neuroscience 13","DOI:10.3389/fnins.2019.00650","Project: Spking neural network learning methodology"],"references":["331292654_Implementing_artificial_neural_networks_through_bionic_construction","277411157_Deep_Learning","262176887_Rank_Order_Coding","260015399_NeuCube_A_spiking_neural_network_architecture_for_mapping_learning_and_understanding_of_spatio-temporal_brain_data","240308775_Representation_Learning_A_Review_and_New_Perspectives","308993398_Mapping_Learning_Visualization_Classification_and_Understanding_of_fMRI_Data_in_the_NeuCube_Evolving_Spatiotemporal_Data_Machine_of_Spiking_Neural_Networks","262030045_Deep_Learning_in_Neural_Networks_An_Overview","247931959_The_mnist_database_of_handwritten_digits","242554268_The_Organization_of_Behavior","235247313_Dynamic_evolving_spiking_neural_networks_for_on-line_spatio-_and_spectro-temporal_pattern_recognition"]}