{"id":"334226088_Bloom's_Taxonomy_and_Rules_Based_Question_Analysis_Approach_for_Measuring_the_Quality_of_Examination_Papers","abstract":"Examinations play a major role in the teaching and\nlearning. Questions are used to obtain information and assess\nknowledge and competence of students. Academics who are\ninvolved in teaching process in higher education mostly use final\nexamination papers to assess the retention capability and\napplication skills of students. Question writing process is a very\nchallenging step for academics. Questions that used to evaluate\ndifferent cognitive levels of students may be categorized as\nhigher order questions, intermediate order questions and lower\norder questions. This research work tries to derive a suitable\nmethodology to categorize final examination question papers\nbased on Bloom’s Taxonomy. The analysis was performed on\ncomputer science related papers. The study was conducted to\ncheck whether examination questions comply with the\nrequirements of Bloom’s Taxonomy at various cognitive levels.\nNatural language processing techniques were used to identify\nthe significant keywords and verbs which are useful in the\ndetermination of the suitable cognitive level. A rule based\napproach was used to determine the level of the question paper\nin the light of Bloom’s Taxonomy. The derived model\nintroduced a quantitative approach to categorize undergraduate\nexamination papers.","authors":["Banage T. G. S. Kumara","A. Brahmana","Incheon Paik"],"meta":["July 2019","DOI:10.18178/ijke.2019.5.1.111"],"references":["339529230_Preprocessing_Techniques_for_Text_Mining_-_An_Overview","307730089_Question_Classification_using_Semantic_Syntactic_and_Lexical_features","285883763_Blooms_Taxonomy-_Application_in_Exam_Papers_Assessment","292669733_Analysis_Of_Question_Papers_In_Engineering_Courses_With_Respect_To_Hots_Higher_Order_Thinking_Skills","264893332_Open-Ended_Question_Classification_Using_Support_Vector_Machines","254636506_The_Effects_of_Implementing_Bloom's_Taxonomy_and_Utilizing_the_Virginia_Standards_of_Learning_Curriculum_Framework_to_Develop_Mathematics_Lessons_for_Elementary_Students","247699381_Taxonomy_o_f_Educational_Objectives_Cognitive_Domain"]}