{"id":"334287825_A_Stacked_Multi-Connection_Simple_Reducing_Net_for_Brain_Tumor_Segmentation","abstract":"It is well known that the Unet has been widely used in the area of medical image segmentation because of the cascade connection in the up-sampling process. But it does not perform well in dealing with complex medical images (Such as brain MRI). In order to achieve better segmentation performance by adopting the Unet, many researchers have paid more attention on stacking the Unet. However, the stacking process lead to a large increase in the amount of parameters. This is not a good choice when considering the tradeoff between precision and efficiency. Another problem is that as the depth of the network increases, the excessive loss of information is also a tricky problem. To address those problems, in this paper, we are trying to improve the network structure of Unet to make it more suitable for brain tumor segmentation. We propose a novel framework called Stack Multi-Connection Simple_ReducingNet(SMCSRNet) which are stacked by our basic blocks called Simple_ReducingNet(SRNet). The basic block SRNet is improved from the original Unet, which consists of four downsampling and upsampling operations during the encoding and decoding. Only one convolution operation is performed before each downsampling process. The operation of copy and crop are preserved between encoding and decoding. The main advantage of the SRNet is that the amount of parameters is reduced by 4/5 by comparing with the original Unet. Except for the problem of parameters number, we also proposed a series of bridge connections among the stacked cascade network to improve the loss of information. More specifically, some bridge connections will be adopted before the pooling operation in each layer during the downsampling process. It means that each layer in one basic block has a bridge connection with the same feature size from the previous basic block before pooling. And, it is worth noting that the training time of the proposed framework is much less than the original stacked Unet. Moreover, the performance of the proposed method is also improved compared to the stacked Unet. When further comparing with other state-of-the-art segmentation networks, it can be found that the performance is as good as the most popular DenseNet or ResNet. Overall, by evaluating the proposed framework on the BRAT2015, it can be proven that the proposed segmentation network has the ability to accurately extract the brain tumor boundary so as to obtain higher recognition quality with high efficiency.","authors":["Yi Ding","Fujuan Chen","Yang Zhao","Zhixing Wu"],"meta":["July 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2926448"],"references":["323408346_Deep_Learning-Based_Feature_Representation_and_Its_Application_for_Soft_Sensor_Modeling_With_Variable-Wise_Weighted_SAE","331539430_Online_Proactive_Caching_in_Mobile_Edge_Computing_Using_Bidirectional_Deep_Recurrent_Neural_Network","331271105_Learning_Aided_User_Identification_Using_Smartphone_Sensors_for_Smart_Homes","329747239_DocUNet_Document_Image_Unwarping_via_a_Stacked_U-Net","327411661_Attribute-Based_Privacy-Preserving_Data_Sharing_for_Dynamic_Groups_in_Cloud_Computing","325209158_Channel_Precoding_Based_Message_Authentication_in_Wireless_Networks_Challenges_and_Solutions","321119728_Multi-modal_brain_tumor_image_segmentation_based_on_SDAE","320964900_Large_Kernel_Matters_-_Improve_Semantic_Segmentation_by_Global_Convolutional_Network","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","313072928_Automatic_Liver_and_Lesion_Segmentation_in_CT_Using_Cascaded_Fully_Convolutional_Neural_Networks_and_3D_Conditional_Random_Fields"]}