{"id":"334293212_Producing_and_projecting_data_Aesthetic_practices_of_government_data_portals","abstract":"We develop the concept of ‘aesthetic practices’ to capture the work needed for population data to be disseminated via government data portals. Specifically, we look at the Census Hub of the European Statistical System and the Danish Ministry of Education’s Data Warehouse. These portals form part of open government data initiatives, which we understand as governing technologies. We argue that to function as such, aesthetic practices are required so that data produced at dispersed sites can be brought into relation and projected as populations in forms such as bar charts, heat maps and tables. Two examples of aesthetic practices are analysed based on ethnographic studies we have conducted on the production of data for the Hub and Warehouse: metadata and data cleaning. Metadata enables data to come into relation by containing and accounting for (some of) the differences between data. Data cleaning deals with the indeterminacies and absences of data and involves algorithms to determine what values data can obtain so they can be brought into relation. We attend to how both aesthetic practices involve normative decisions that make absent what exceeds them: embodied knowledge that cannot or has not been documented as well as data that cannot meet the forms required of data portals. While these aesthetic practices are necessary to sustain data portals as ‘sites of projection,’ we also bring critical attention to their performative effects for knowing, enacting and governing populations.","authors":["Helene Ratner","Evelyn Ruppert"],"meta":["July 2019Big Data & Society 6(2):205395171985331","DOI:10.1177/2053951719853316","Project: Peopling Europe: How data make a people (ARITHMUS) [team member]"],"references":["332183192_On_the_Politics_of_Expertise_and_Ignorance_in_the_Field_of_Migration_Management","345393063_An_Aesthesia_of_Networks_Conjunctive_Experience_in_Art_and_Technology","344800471_After_Method_Mess_in_Social_Science_Research","333026320_Laboratory_Life_The_Construction_of_Scientific_Facts","332853837_Scientific_Nonknowledge_and_Its_Political_Dynamics_The_Cases_of_Agri-Biotechnology_and_Mobile_Phoning","329655901_The_Politics_of_Population_State_Formation_Statistics_and_the_Census_of_Canada_1840-1875","328589505_Data_warehousing_organization_Infrastructural_experimentation_with_educational_governance","325786830_Data_Cleaners_for_Pristine_Datasets_Visibility_and_Invisibility_of_Data_Processors_in_Social_Science","322906897_Data-Centric_Biology_A_Philosophical_Study","317238938_Gaia_or_Knowledge_without_Spheres"]}