{"id":"334239674_METODICNI_PIDHODI_DO_ROZV'AZUVANNA_OLIMPIADNIH_ZADAC_Z_INFORMATIKI","abstract":"У статті наведено особливості олімпіадних задач з інформатики: відволікаюча фабула, розміщення різних важливих складових завдання в різних місцях умови, нестандартні математичні моделі, нестандартне поєднання стандартних підходів тощо. З огляду на досить високу складність таких задач є потреба в напрацюванні методичних підходів до навчання розв’язувати такі задачі. Розглянуто загальні схеми розв’язування олімпіадних задач з інформатики, запропоновані різними науковцями, що беруть участь в олімпіадному русі. На основі власного досвіду відібрано одну з них. Розглянуто один із напрямів динамічного програмування – так звані задачі про ранець. Наведено різні модифікації задачі про ранець, які необхідно вміти розв’язувати для розуміння розв’язку більш складної задачі, що належить до динамічного програмування. Для цих задач наведено відповідні математичні формули або програмний код. Наведено всі етапи застосування вибраної схеми до розв’язування конкретної олімпіадної задачі з інформатики, що належить до класу задач про ранець у двовимірному варіанті й була запропонована одним із авторів на дванадцятій відкритій міжнародній студентській олімпіаді з програмування імені С. О. Лебедєва та В. М. Глушкова “KPI-OPEN 2017”: аналіз умови, побудова математичної моделі, побудова загальної схеми розв’язування, уточнення, реалізація, тестування й налагодження, відправлення програми на перевірку. Продемонстровано ефективний авторський метод розв’язування цієї задачі. Наведено програмний код її розв’язку мовою С++. Зазначено, що важливим моментом у підготовці до олімпіад з інформатики є аналіз задач після завершення кожного змагання. Застосування запропонованих методичних підходів до підготовки учнів чи студентів до олімпіад з інформатики (програмування), на нашу думку, дозволить підвищити ефективність такої підготовки.","authors":["Yurii V. Horoshko","Oleksandr Mitsa","Valentyn I. Melnyk"],"meta":["June 2019Information Technologies and Learning Tools 71(3):40","DOI:10.33407/itlt.v71i3.2482"],"references":["228884809_Teaching_algorithmics_for_informatics_olympiads_The_French_method"]}