{"id":"334217946_Generative_computing_African-American_cosmetology_as_a_link_between_computing_education_and_community_wealth","abstract":"Recent scholarship in computer science (CS) education shifts from a focus on the technical-cognitive skills of computational thinking to the socio-cultural goal of computational participation, often illustrated as remixing popular media (e.g. music, photos, etc.) in online communities. These activities do enhance the participatory dimensions of CS, but whether they also support broadening the participation of underrepresented youth remains unclear. While online communities that are dedicated to computational participation have existed in the U.S. for over a decade, many communities of color remain underrepresented in CS disciplines. How might CS educators, researchers, and technologists promote culturally responsive forms of computational participation? To answer this question, we propose a culturally responsive framework for computational participation called generative computing. Generative computing approaches CS as a means for strengthening relationships between learning environments and local communities, leveraging culturally relevant sources of wealth generation in technology design and implementation. To explore this concept, we conducted a mixed-methods study with a cosmetology high school program that predominantly serves young African-American women. Through a series of computationally and culturally rich cosmetology projects, we tested our hypothesis that generative computing can enhance connections between Black heritage, CS, and cosmetology while supporting students’ academic interests and knowledge.","authors":["Michael L Lachney","William Babbitt","Audrey Bennett","Ron Eglash"],"meta":["July 2019Interactive Learning Environments 29(1):1-21","DOI:10.1080/10494820.2019.1636087","Projects: generative justiceCulturally Situated Design Tools"],"references":["331302826_A_Cultural_Computing_Curriculum","331301973_The_Role_of_Translanguaging_in_Computational_Literacies_Documenting_Middle_School_Bilinguals'_Practices_in_Computer_Science_Integrated_Units","329553585_Studying_Synergistic_Learning_of_Physics_and_Computational_Thinking_in_a_Learning_by_Modeling_Environment","325864007_A_Design-Based_Approach_to_a_Classroom-Centered_OELE","319959476_Demystifying_computational_thinking","318334749_A_mathematical_tool_kit_for_generative_justice","315636456_Computational_thinking_for_teacher_education","331253726_The_Cambridge_Handbook_of_Computing_Education_Research","329887876_Ifthen_Algorithmic_power_and_politics","322981351_Computational_communities_African-American_cultural_capital_in_computer_science_education"]}