{"id":"334287133_Adaptive_Capacity_Partitioning_in_Cooperative_Computing_to_Maximize_Received_Resources","abstract":"Users in a cooperative computing environment always have a tendency to free-ride. One can employ incentive mechanisms to prevent such behavior. Some of the cooperative computing scenarios have the same access link shared between upload and download. In such a situation, increasing upload capacity decreases the download capacity and vice-versa. An optimal partitioning of link capacity between upload and download need to be done by each user to maximize its gain (i.e., download) from the network. We model this link capacity partitioning problem as a feedback control system, where feedback (resources received) decides the amount of resources to be uploaded by a user. The resulting algorithm called adaptive step size (ASZ) dynamically adjust the partitioning of link capacity to an optimal value. To compare this approach with others, a metric ‘level of optimality (U)’ is introduced. The U achieved by ASZ is closer to the optimal level than Reputation-Based Resource Allocation Policy (existing scheme), resulting in its better performance. ASZ is also integrated with BitTorrent and simulation results show that it increases the resources received by the users. ASZ can provide an efficient solution to the problem of optimal partitioning in real-life distributed networks due to its distributed implementation, robustness to changes in network dynamics, and compatibility with the existing partitioning schemes.","authors":["Nitin Singha","Yatindra Singh","Ruchir Gupta"],"meta":["July 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2926805"],"references":["232252796_Reputation_Aggregation_in_Peer-to-Peer_Network_Using_Differential_Gossip_Algorithm","325097602_Optimal_Capacity_Partitioning_in_Homogeneous_P2P_Network","324692956_Distributed_hash_table_Theory_platforms_and_applications","322276995_Modern_Control_Engineering","316029470_T-Chain_A_General_Incentive_Scheme_for_Cooperative_Computing","313054391_Tuning_of_PID_Controllers_based_on_Gain_and_Phase_Margin_Specifications","308847990_Cooperative_Computing_for_Autonomous_Data_Centers","289742656_Finding_your_way_in_the_fog_Towards_a_comprehensive_definition_of_fog_computing","269311731_Recent_advances_and_challenges_in_human-centric_multimedia_mobile_cloud_computing","230887814_Process_control_systems_application_design_and_tuning"]}