{"id":"334235663_A_trust-aware_task_allocation_method_using_deep_q-learning_for_uncertain_mobile_crowdsourcing","abstract":"Abstract Mobile crowdsourcing has emerged as a promising collaboration paradigm in which each spatial task requires a set of mobile workers in near vicinity to the target location. Considering the desired privacy of the participating mobile devices, trust is considered to be an important factor to enable effective collaboration in mobile crowdsourcing. The main impediment to the success of mobile crowdsourcing is the allocation of trustworthy mobile workers to nearby spatial tasks for collaboration. This process becomes substantially more challenging for large-scale online spatial task allocations in uncertain mobile crowdsourcing systems. The uncertainty can mislead the task allocation, resulting in performance degradation. Moreover, the large-scale nature of real-world crowdsourcing poses a considerable challenge to spatial task allocation in uncertain environments. To address the aforementioned challenges, first, an optimization problem of mobile crowdsourcing task allocation is formulated to maximize the trustworthiness of workers and minimize movement distance costs. Second, for the uncertain crowdsourcing scenario, a Markov decision process-based mobile crowdsourcing model (MCMDP) is formulated to illustrate the dynamic trust-aware task allocation problem. Third, to solve large-scale MCMDP problems in a stable manner, this study proposes an improved deep Q-learning-based trust-aware task allocation (ImprovedDQL-TTA) algorithm that combines trust-aware task allocation and deep Q-learning as an improvement over the uncertain mobile crowdsourcing systems. Finally, experimental results illustrate that the ImprovedDQL-TTA algorithm can stably converge in a number of training iterations. Compared with the reference algorithm, our proposed algorithm achieves effective solutions on the experimental data sets.","authors":["Yong Sun","Wenan Tan"],"meta":["December 2019Human-centric Computing and Information Sciences 9(1)","DOI:10.1186/s13673-019-0187-4"],"references":["327708992_Dynamic_Worker-and-Task_Assignment_on_Uncertain_Spatial_Crowdsourcing","323788876_Task_Allocation_in_Spatial_Crowdsourcing_Current_State_and_Future_Directions","322470209_Task-Management_Method_Using_R-Tree_Spatial_Cloaking_for_Large-Scale_Crowdsourcing","321816165_The_Novel_Location_Privacy-Preserving_CKD_for_Mobile_Crowdsourcing_Systems","320473480_Mastering_the_game_of_Go_without_human_knowledge","318832263_Efficient_task_assignment_in_spatial_crowdsourcing_with_worker_and_task_privacy_protection","318476507_A_Hierarchical_Framework_of_Cloud_Resource_Allocation_and_Power_Management_Using_Deep_Reinforcement_Learning","327782893_Deep_Reinforcement_Learning_Based_Mode_Selection_and_Resource_Management_for_Green_Fog_Radio_Access_Networks","323154093_Truthful_incentive_mechanism_with_location_privacy-preserving_for_mobile_crowdsourcing_systems","319770330_Prioritized_Experience_Replay"]}