{"id":"334209824_Unsupervised_word_embeddings_capture_latent_knowledge_from_materials_science_literature","abstract":"The overwhelming majority of scientific knowledge is published as text, which is difficult to analyse by either traditional statistical analysis or modern machine learning methods. By contrast, the main source of machine-interpretable data for the materials research community has come from structured property databases1,2, which encompass only a small fraction of the knowledge present in the research literature. Beyond property values, publications contain valuable knowledge regarding the connections and relationships between data items as interpreted by the authors. To improve the identification and use of this knowledge, several studies have focused on the retrieval of information from scientific literature using supervised natural language processing3–10, which requires large hand-labelled datasets for training. Here we show that materials science knowledge present in the published literature can be efficiently encoded as information-dense word embeddings11–13 (vector representations of words) without human labelling or supervision. Without any explicit insertion of chemical knowledge, these embeddings capture complex materials science concepts such as the underlying structure of the periodic table and structure–property relationships in materials. Furthermore, we demonstrate that an unsupervised method can recommend materials for functional applications several years before their discovery. This suggests that latent knowledge regarding future discoveries is to a large extent embedded in past publications. Our findings highlight the possibility of extracting knowledge and relationships from the massive body of scientific literature in a collective manner, and point towards a generalized approach to the mining of scientific literature.","authors":["Vahe Tshitoyan","John M. Dagdelen","Leigh Weston","Alexander Dunn"],"meta":["July 2019Nature 571(7763):95-98","DOI:10.1038/s41586-019-1335-8"],"references":["326608140_Machine_learning_for_molecular_and_materials_science","326004751_Learning_atoms_for_materials_discovery","323217640_Deep_contextualized_word_representations","320104557_Advances_in_thermoelectric_materials_research_Looking_back_and_moving_forward","319654010_Machine-learned_and_codified_synthesis_parameters_of_oxide_materials","329517398_Ultralow_lattice_thermal_conductivity_and_electronic_properties_of_monolayer_1T_phase_semimetal_SiTe2_and_SnTe2","329332237_High_Thermoelectric_Figure_of_Merit_via_Tunable_Valley_Convergence_Coupled_Low_Thermal_Conductivity_in_A_II_B_IV_C_V_2_Chalcopyrites","327349340_Low_lattice_thermal_conductivity_and_excellent_thermoelectric_behavior_in_Li3Sb_and_Li3Bi","320507500_Materials_Synthesis_Insights_from_Scientific_Literature_via_Text_Extraction_and_Machine_Learning","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","318203584_An_ab_initio_electronic_transport_database_for_inorganic_materials","319151025_ChemDataExtractor_A_Toolkit_for_Automated_Extraction_of_Chemical_Information_from_the_Scientific_Literature","318925700_Atomate_A_high-level_interface_to_generate_execute_and_analyze_computational_materials_science_workflows","317508498_New_trends_strategies_and_opportunities_in_thermoelectric_materials_A_perspective","317148900_Thermoelectric_properties_of_defect_chalcopyrites"]}