{"id":"334276369_DARPA's_Explainable_Artificial_Intelligence_XAI_Program","abstract":"Dramatic success in machine learning has led to a new wave of AI applications (for example, transportation, security, medicine, finance, defense) that offer tremendous benefits but cannot explain their decisions and actions to human users. DARPA’s explainable artificial intelligence (XAI) program endeavors to create AI systems whose learned models and decisions can be understood and appropriately trusted by end users. Realizing this goal requires methods for learning more explainable models, designing effective explanation interfaces, and understanding the psychologic requirements for effective explanations. The XAI developer teams are addressing the first two challenges by creating ML techniques and developing principles, strategies, and human-computer interaction techniques for generating effective explanations. Another XAI team is addressing the third challenge by summarizing, extending, and applying psychologic theories of explanation to help the XAI evaluator define a suitable evaluation framework, which the developer teams will use to test their systems. The XAI teams completed the first of this 4-year program in May 2018. In a series of ongoing evaluations, the developer teams are assessing how well their XAM systems’ explanations improve user understanding, user trust, and user task performance.","authors":["David Gunning","David Aha"],"meta":["June 2019Ai Magazine 40(2):44-58","DOI:10.1609/aimag.v40i2.2850"],"references":["326726086_Explaining_Explanation_Part_4_A_Deep_Dive_on_Deep_Nets","325708964_Explaining_Explanation_Part_3_The_Causal_Landscape","323570999_Recurrent_Predictive_State_Policy_Networks","321936440_MovieGraphs_Towards_Understanding_Human-Centric_Situations_from_Videos","326047565_Interpretability_of_deep_learning_models_A_survey_of_results","320971149_Top-Down_Visual_Saliency_Guided_by_Captions","305342147_Why_Should_I_Trust_You_Explaining_the_Predictions_of_Any_Classifier","304529377_Probabilistic_theorem_proving","283757595_Learning_the_structure_of_causal_models_with_relational_and_temporal_dependence","221475257_Practical_Probabilistic_Programming"]}