{"id":"334208079_LAB-QA2GO_A_Free_Easy-to-Use_Toolbox_for_the_Quality_Assessment_of_Magnetic_Resonance_Imaging_Data","abstract":"Image characteristics of magnetic resonance imaging (MRI) data (e.g., signal-to-noise ratio, SNR) may change over the course of a study. To monitor these changes a quality assurance (QA) protocol is necessary. QA can be realized both by performing regular phantom measurements and by controlling the human MRI datasets (e.g., noise detection in structural or movement parameters in functional datasets). Several QA tools for the assessment of MRI data quality have been developed. Many of them are freely available. This allows in principle the flexible set-up of a QA protocol specifically adapted to the aims of one’s own study. However, setup and maintenance of these tools takes substantial time, in particular since the installation and operation often require a fair amount of technical knowledge. In this article we present a light-weighted virtual machine, named LAB–QA2GO, which provides scripts for fully automated QA analyses of phantom and human datasets. This virtual machine is ready for analysis by starting it the first time. With minimal configuration in the guided web-interface the first analysis can start within 10 min, while adapting to local phantoms and needs is easily possible. The usability and scope of LAB–QA2GO is illustrated using a data set from the QA protocol of our lab. With LAB–QA2GO we hope to provide an easy-to-use toolbox that is able to calculate QA statistics without high effort.","authors":["Christoph Vogelbacher","Miriam H. A. Bopp","Verena Schuster","Peer Herholz"],"meta":["July 2019Frontiers in Neuroscience 13:688","DOI:10.3389/fnins.2019.00688"],"references":["327943277_Neurobiology_of_the_major_psychoses_a_translational_perspective_on_brain_structure_and_function-the_FOR2107_consortium","314245346_MRIQC_Advancing_the_Automatic_Prediction_of_Image_Quality_in_MRI_from_Unseen_Sites","261921696_Data_quality_in_fMRI_and_simultaneous_EEG-fMRI","232232556_Open_is_Not_Enough_Let's_Take_the_Next_Step_An_Integrated_Community-Driven_Computing_Platform_for_Neuroscience","322880811_The_Marburg-Munster_Affective_Disorders_Cohort_Study_MACS_A_quality_assurance_protocol_for_MR_neuroimaging_data","282760530_Mechanisms_of_Hemispheric_Lateralization_Asymmetric_Interhemispheric_Recruitment_in_the_Face_Perception_Network","282398093_The_Preprocessed_Connectomes_Project_Quality_Assessment_Protocol_-_a_resource_for_measuring_the_quality_of_MRI_data","274546929_Towards_Automated_Analysis_of_Connectomes_The_Configurable_Pipeline_for_the_Analysis_of_Connectomes_C-PAC","269709564_cmind-py_A_robust_set_of_processing_pipelines_for_pediatric_fMRI","240617753_Methods_and_Software_for_fMRI_Analysis_of_Clinical_Subjects"]}