{"id":"334261803_The_rise_of_blockchain_bibliometric_analysis_of_blockchain_study","abstract":"The blockchain is a technology which accumulates and compiles data into a chain of multiple blocks. Many blockchain researchers are adopting it in multiple areas. However, there are still lacks bibliometric reports exhibiting the exploration of an in-depth research pattern in blockchain. This paper aims to address that gap by analyzing the widespread of blockchain research activities conducted thus far. This study analyzed the Scopus database by using bibliometric analysis in a pool of more than 1000 articles that were published between 2013 and 2018. In particular, this paper discusses various aspects of blockchain research conducted by researchers globally. This study also focuses on the utilization of blockchain and its consensus algorithms. This bibliometric analysis discovered the following: (1) Blockchain able to solve security issues in internet of things (IoT) and would be an increasing trend in the future; (2) Researchers begin to adopt blockchain in healthcare area; (3) The most active country in blockchain publication is United States, followed by China and Germany; (4) Switzerland and Singapore are two small size countries that published few publications, however receives many citations. (5) Research collaborations between countries increased the research publications except for Canada, India, and Brazil. (6) Keyword analysis revealed that researchers are adopting blockchain to solve problems in multiple categories of the data research area (data privacy, digital storage, the security of data, big data, and distributed database). This study also highlighted the utilization and consensus of the algorithm in blockchain research.","authors":["Ahmad Firdaus","Mohd Faizal","Ali Feizollah","Ibrahim Abaker Targio Hashem"],"meta":["July 2019Scientometrics 120(February)","DOI:10.1007/s11192-019-03170-4"],"references":["331136542_A_blockchain-based_decentralized_efficient_investigation_framework_for_IoT_digital_forensics","331002235_Blockchain_Applications_in_the_Biomedical_Domain_A_Scoping_Review","330972635_Beyond_Bitcoin_What_blockchain_and_distributed_ledger_technologies_mean_for_firms","330761904_Proposing_New_Blockchain_Challenges_in_eHealth","330725529_A_Study_on_Improvement_of_Blockchain_Application_to_Overcome_Vulnerability_of_IoT_Multiplatform_Security","330498481_Blockchain_based_searchable_encryption_for_electronic_health_record_sharing","330397749_A_Decentralized_Privacy-Preserving_Healthcare_Blockchain_for_IoT","331091921_Cloud-Assisted_Secure_eHealth_Systems_for_Tamper-Proofing_EHR_via_Blockchain","330641017_Highly_cited_researchers_a_moving_target","330588351_Survey_of_Security_Threats_in_IoT_and_Emerging_Countermeasures_6th_International_Symposium_SSCC_2018_Bangalore_India_September_19-22_2018_Revised_Selected_Papers"]}