{"id":"334273239_Untangling_Smart_Cities_From_Utopian_Dreams_to_Innovation_Systems_for_a_Technology-Enabled_Urban_Sustainability","abstract":"Untangling Smart Cities: From Utopian Dreams to Innovation Systems for a Technology-Enabled Urban Sustainability helps all key stakeholders understand the complex and often conflicting nature of smart city research, offering valuable insights for designing and implementing strategies to improve the smart city decision-making processes. The book drives the reader to a better theoretical and practical comprehension of smart city development, beginning with a thorough and systematic analysis of the research literature published to date. It addition, it provides an in-depth understanding of the entire smart city knowledge domain, revealing a deeply rooted division in its cognitive-epistemological structure as identified by bibliometric insights. Users will find a book that fills the knowledge gap between theory and practice using case study research and empirical evidence drawn from cities considered leaders in innovative smart city practices. Key features: Provides clarity on smart city concepts and strategies; Presents a systematic literature analysis on the state-of-the-art of smart cities' research using bibliometrics combined with practical applications; Offers a comprehensive and systematic analysis of smart cities research produced during its first three decades; Generates a strong connection between theory and practice by providing the scientific knowledge necessary to approach the complex nature of smart cities; Documents five main development pathways for smart cities development, serving the needs of city managers and policymakers with concrete advice and guidance.","authors":["Luca Mora","Mark Deakin"],"meta":["January 2019","Publisher: ElsevierISBN: 978-0-12-815477-9"],"references":["330929908_Smart_City_Development_ICT_Innovation_for_Urban_Sustainability","330294530_When_more_isn't_merrier_pharmaceutical_alliance_networks_and_breakthrough_innovation","354159421_Hubcab_-_Exploring_the_Benefits_of_Shared_Taxi_Services","347494731_Intelligent_Cities_Innovation_Knowledge_Systems_and_Digital_Spaces","344954392_Does_smart_city_policy_lead_to_sustainability_of_cities","336810185_How_do_we_understand_smart_cities_An_evolutionary_perspective","332937375_The_Logic_of_Open_Innovation_Managing_Intellectual_Property","330908088_Actually_existing_smart_citizens_Expertise_and_nonparticipation_in_the_making_of_the_smart_city","330263866_Me_The_Cyborg_Self_and_the_Networked_City","329954227_The_New_Science_of_Cities"]}