{"id":"334260418_Sortition_and_Democratic_Principles_A_Comparative_Analysis","abstract":"After centuries of absence, sortition is making its return through academic research, practical experiments, and activists’ calls for linking participation and deliberation. These invocations of sortition, however, offer divergent accounts of the concept and different justifications. Gastil and Wright’s proposal for a “sortition chamber” provides one such example, but sortition can be conceptualized more broadly. When properly analyzed in this larger sense, one can better appreciate how sortition satisfies democratic principles—often in novel ways that go beyond those enumerated in the lead chapter of this volume.\nTo better understand the implications of sortition, I begin by contrasting it with the other modes of selection democracies use to place people in positions of power, including not only elections but also nomination and certifi cation. I then distinguish varieties of sortition that differ by their mandate, the population from which a random sample is drawn, and the degree to which service is voluntary or compulsory. Depending on the design considerations such as these, sortition can provide a novel means of realizing the democratic aspirations of equality, impartiality, representativeness, and legitimacy.\n\nCourant Dimitri (2019), \"Sortition and Democratic Principles: A Comparative Analysis\", in Gastil and Wright (eds.), Legislature by Lot: Transformative Designs for Deliberative Governance, Verso, New York/London, p. 229-248.\n\nhttps://www.versobooks.com/books/2969-legislature-by-lot","authors":["Dimitri Courant"],"meta":["May 2019","In book: Legislature by Lot: Transformative Designs for Deliberative Governance, 2019 (pp.229-248)Chapter: 11Publisher: Verso","Project: Le nouvel esprit du tirage au sort. Principes démocratiques et représentation au sein de dispositifs délibératifs contemporains"],"references":["341075999_Democracy_Through_Multi-Body_Sortition_Athenian_Lessons_for_the_Modern_Day","341074797_A_Randomly_Selected_Chamber_Promises_and_Challenges","334633692_Deliberation_et_tirage_au_sort_au_sein_d'une_institution_permanente_Le_Conseil_superieur_de_la_fonction_militaire_1968-2016","329424290_Penser_le_tirage_au_sort_Modes_de_selection_cadres_deliberatifs_et_principes_democratiques","345890051_The_Civic_Organization_and_the_Digital_Citizen_Communicating_Engagement_in_a_Networked_Age","345771561_Who_Cares_How_to_Reshape_a_Democratic_Politics","338777507_Hope_for_Democracy_How_Citizens_Can_Bring_Reason_Back_into_PoliticsHow_Citizens_Can_Bring_Reason_Back_into_Politics","332522403_Referendums","331725962_The_Paradox_of_Democratic_Selection_Historical_and_Contemporary_Perspectives","329649326_Between_Facts_and_Norms_Contributions_to_a_Discourse_Theory_of_Law_and_Democracy"]}