{"id":"334259268_Ollivier-Ricci_Curvature-Based_Method_to_Community_Detection_in_Complex_Networks","abstract":"Identification of community structures in complex network is of crucial importance for understanding the system’s function, organization, robustness and security. Here, we present a novel Ollivier-Ricci curvature (ORC) inspired approach to community identification in complex networks. We demonstrate that the intrinsic geometric underpinning of the ORC offers a natural approach to discover inherent community structures within a network based on interaction among entities. We develop an ORC-based community identification algorithm based on the idea of sequential removal of negatively curved edges symptomatic of high interactions (e.g., traffic, attraction). To illustrate and compare the performance with other community identification methods, we examine the ORC-based algorithm with stochastic block model artificial networks and real-world examples ranging from social to drug-drug interaction networks. The ORC-based algorithm is able to identify communities with either better or comparable performance accuracy and to discover finer hierarchical structures of the network. This opens new geometric avenues for analysis of complex networks dynamics.","authors":["Jayson Sia","Edmond Jonckheere","Paul Bogdan"],"meta":["July 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-46079-x"],"references":["319075485_A_Parallel_Method_for_Earth_Mover's_Distance","308807919_Ricci_curvature_of_the_Internet_topology","307908414_Clustering_drug-drug_interaction_networks_with_energy_model_layouts_community_analysis_and_drug_repurposing","305453853_Differential_geometric_treewidth_estimation_in_adiabatic_quantum_computation","303600815_Ricci_curvature_An_economic_indicator_for_market_fragility_and_systemic_risk","280058824_Graph_Curvature_for_Differentiating_Cancer_Networks","327739707_Probabilistic_analysis_of_the_simplex_method","315695941_Community_detection_and_stochastic_block_models_recent_developments","305870806_Interference_constrained_network_control_based_on_curvature","301390123_Dirichlet's_principle_on_multiclass_multihop_wireless_networks"]}