{"id":"334329987_A_Electric_Network_Reconfiguration_Strategy_with_Case-Based_Reasoning_for_the_Smart_Grid","abstract":"The complexity, heterogeneity and scale of electrical networks have grown far beyond the limits of exclusively human-based management at the Smart Grid (SG). Likewise, researchers cogitate the use of artificial intelligence and heuristics techniques to create cognitive and autonomic management tools that aim better assist and enhance SG management processes like in the grid reconfiguration. The development of self-healing management approaches towards a cognitive and autonomic distribution power network reconfiguration is a scenario in which the scalability and on-the-fly computation are issues. This paper proposes the use of Case-Based Reasoning (CBR) coupled with the HATSGA algorithm for the fast reconfiguration of large distribution power networks. The suitability and the scalability of the CBR-based reconfiguration strategy using HATSGA algorithm are evaluated. The evaluation indicates that the adopted HATSGA algorithm computes new reconfiguration topologies with a feasible computational time for large networks. The CBR strategy looks for managerial acceptable reconfiguration solutions at the CBR database and, as such, contributes to reduce the required number of reconfiguration computation using HATSGA. This suggests CBR can be applied with a fast reconfiguration algorithm resulting in more efficient, dynamic and cognitive grid recovery strategy.","authors":["Flávio G Calhau","Joberto S B Martins"],"meta":["October 2019","DOI:10.5281/zenodo.3277283","Conference: BRACIS - 8th Brazilian Conference on Intelligent SystemsAt: Salvador","Project: RePAF- A Dynamic and Autonomic Resource Allocation Framework for MPLS, Elastic Optical Networks (EON), Network Function Virtualization (NFV) and IoT"],"references":["311707026_Evaluating_CBR_Similarity_Functions_for_BAM_Switching_in_Networks_with_Dynamic_Traffic_Profile","311706788_On_Evaluating_Power_Loss_with_HATSGA_Algorithm_for_Power_Network_Reconfiguration_in_the_Smart_Grid","284733751_Hybrid_algorithm_based_on_Genetic_Algorithm_and_Tabu_Search_for_Reconfiguration_Problem_in_Smart_Grid_Networks_Using_R","288134748_Reactive_power_loss_optimization_for_an_IEEE_14-bus_power_system_using_various_algorithms","284131034_A_survey_on_the_critical_issues_in_smart_grid_technologies","261180055_Cognitive_Networks_Towards_Self-Aware_Networks","261156162_Distribution_automation_leading_to_a_smarter_grid","254004046_Putting_the_'Smarts'_into_the_Smart_Grid_A_Grand_Challenge_for_Artificial_Intelligence","242685504_Computacao_Evolutiva_Uma_Abordagem_Pragmatica","239362193_Distribution_system_reconfiguration_using_a_modified_Tabu_Search_algorithm"]}