{"id":"334325669_Personalized_medicine_for_patients_with_COPD_Where_are_we","abstract":"Chronic airflow limitation is the common denominator of patients with chronic obstructive pulmonary disease (COPD). However, it is not possible to predict morbidity and mortality of individual patients based on the degree of lung function impairment, nor does the degree of airflow limitation allow guidance regarding therapies. Over the last decades, understanding of the factors contributing to the heterogeneity of disease trajectories, clinical presentation, and response to existing therapies has greatly advanced. Indeed, diagnostic assessment and treatment algorithms for COPD have become more personalized. In addition to the pulmonary abnormalities and inhaler therapies, extra-pulmonary features and comorbidities have been studied and are considered essential components of comprehensive disease management, including lifestyle interventions. Despite these advances, predicting and/or modifying the course of the disease remains currently impossible, and selection of patients with a beneficial response to specific interventions is unsatisfactory. Consequently, non-response to pharmacologic and non-pharmacologic treatments is common, and many patients have refractory symptoms. Thus, there is an ongoing urgency for a more targeted and holistic management of the disease, incorporating the basic principles of P4 medicine (predictive, preventive, personalized, and participatory). This review describes the current status and unmet needs regarding personalized medicine for patients with COPD. Also, it proposes a systems medicine approach, integrating genetic, environmental, (micro)biological, and clinical factors in experimental and computational models in order to decipher the multilevel complexity of COPD. Ultimately, the acquired insights will enable the development of clinical decision support systems and advance personalized medicine for patients with COPD.","authors":["Frits Franssen","Peter Alter","Nadav Bar","Birke J Benedikter"],"meta":["July 2019International Journal of COPD Volume 14:1465-1484","DOI:10.2147/COPD.S175706"],"references":["331380299_Organizational_aspects_of_pulmonary_rehabilitation_in_chronic_respiratory_diseases_Organization_of_pulmonary_rehabilitation","330131443_Global_regional_and_national_age-sex-specific_mortality_for_282_causes_of_death_in_195_countries_and_territories_1980-2017_a_systematic_analysis_for_the_Global_Burden_of_Disease_Study_2017","331295756_Total_Airway_Count_on_Computed_Tomography_and_the_Risk_of_Chronic_Obstructive_Pulmonary_Disease_Progression_Findings_from_a_Population-based_Study","331289636_Dose-response_associations_of_cardiorespiratory_fitness_with_all-cause_mortality_and_incidence_and_mortality_of_cancer_and_cardiovascular_and_respiratory_diseases_The_UK_Biobank_cohort_study","331107946_Exercise_intolerance_in_comorbid_COPD-heart_failure_the_role_of_impaired_aerobic_function","331099179_Emphysema_looking_beyond_alpha-1_antitrypsin_deficiency","331006276_Surgical_and_endoscopic_interventions_that_reduce_lung_volume_for_emphysema_a_systemic_review_and_meta-analysis","330602607_Introduction_to_Precision_Medicine_in_COPD","330376374_Effect_of_IndacaterolGlycopyrronium_on_Pulmonary_Perfusion_and_Ventilation_in_Hyperinflated_COPD_Patients_CLAIM_A_Double-Blind_Randomised_Crossover_Trial","329817680_Broadening_the_Perspective_of_Cost-Effectiveness_Modeling_in_Chronic_Obstructive_Pulmonary_Disease_A_New_Patient-Level_Simulation_Model_Suitable_to_Evaluate_Stratified_Medicine"]}