{"id":"334383654_Blockchain-Based_Scalable_and_Tamper-Evident_Solution_for_Registering_Energy_Data","abstract":"Nowadays, it has been recognized that blockchain can provide the technological infrastructure for developing decentralized, secure, and reliable smart energy grid management systems. However, an open issue that slows the adoption of blockchain technology in the energy sector is the low scalability and high processing overhead when dealing with the real-time energy data collected by smart energy meters. Thus, in this paper, we propose a scalable second tier solution which combines the blockchain ledger with distributed queuing systems and NoSQL (Not Only SQL database) databases to allow the registration of energy transactions less frequently on the chain without losing the tamper-evident benefits brought by the blockchain technology. At the same time, we propose a technique for tamper-evident registration of smart meters’ energy data and associated energy transactions using digital fingerprinting which allows the energy transaction to be linked hashed-back on-chain, while the sensors data is stored off-chain. A prototype was implemented using Ethereum and smart contracts for the on-chain components while for the off-chain components we used Cassandra database and RabbitMQ messaging broker. The prototype proved to be effective in managing a settlement of energy imbalances use-case and during the evaluation conducted in simulated environment shows promising results in terms of scalability, throughput, and tampering of energy data sampled by smart energy meters.","authors":["Claudia Daniela Antal","Marcel Antal","Tudor Cioara","Ionut Anghel"],"meta":["July 2019Sensors 19(14):3033","DOI:10.3390/s19143033"],"references":["341441255_Blockchain_in_the_energy_transition_A_survey_among_decision-makers_in_the_German_energy_industry","333426100_Blockchain_for_economically_sustainable_wireless_mesh_networks","332428841_When_Energy_Trading_Meets_Blockchain_in_Electrical_Power_System_The_State_of_the_Art","328760651_Blockchain_technology_in_the_energy_sector_A_systematic_review_of_challenges_and_opportunities","322349262_Blockchain_Based_Decentralized_Management_of_Demand_Response_Programs_in_Smart_Energy_Grids","319471199_Privacy-preserving_blockchain-based_electric_vehicle_charging_with_dynamic_tariff_decisions","330491513_A_survey_on_energy_management_and_blockchain_for_collective_self-consumption","322943102_Blockchain_Based_Autonomous_Selection_of_Electric_Vehicle_Charging_Station","320751350_Smart_contract-based_campus_demonstration_of_decentralized_transactive_energy_auctions","320607146_Blockchains_for_decentralized_optimization_of_energy_resources_in_microgrid_networks"]}