{"id":"334361077_FarSense_Pushing_the_Range_Limit_of_WiFi-based_Respiration_Sensing_with_CSI_Ratio_of_Two_Antennas","abstract":"The past few years have witnessed the great potential of exploiting channel state information retrieved from commodity WiFi devices for respiration monitoring. However, existing approaches only work when the target is close to the WiFi transceivers and the performance degrades significantly when the target is far away. On the other hand, most home environments only have one WiFi access point and it may not be located in the same room as the target. This sensing range constraint greatly limits the application of the proposed approaches in real life. \nThis paper presents FarSense--the first real-time system that can reliably monitor human respiration when the target is far away from the WiFi transceiver pair. FarSense works well even when one of the transceivers is located in another room, moving a big step towards real-life deployment. We propose two novel schemes to achieve this goal: (1) Instead of applying the raw CSI readings of individual antenna for sensing, we employ the ratio of CSI readings from two antennas, whose noise is mostly canceled out by the division operation to significantly increase the sensing range; (2) The division operation further enables us to utilize the phase information which is not usable with one single antenna for sensing. The orthogonal amplitude and phase are elaborately combined to address the \"blind spots\" issue and further increase the sensing range. Extensive experiments show that FarSense is able to accurately monitor human respiration even when the target is 8 meters away from the transceiver pair, increasing the sensing range by more than 100%. We believe this is the first system to enable through-wall respiration sensing with commodity WiFi devices and the proposed method could also benefit other sensing applications.","authors":["Youwei Zeng","Dan Wu","Jie Xiong","Enze Yi"],"meta":["September 2019Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies 3(3)","DOI:10.1145/3351279"],"references":["332164511_Towards_a_Diffraction-based_Sensing_Approach_on_Human_Activity_Recognition","331294324_Known_and_Unknown_Facts_of_LoRa_Experiences_from_a_Large-scale_Measurement_Study","329256952_Boosting_fine-grained_activity_sensing_by_embracing_wireless_multipath_effects","327758396_FullBreathe_Full_Human_Respiration_Detection_Exploiting_Complementarity_of_CSI_Phase_and_Amplitude_of_WiFi_Signals","328682295_A_Training-Free_Contactless_Human_Vitality_Monitoring_Platform_Using_Commodity_Wi-Fi_Devices","328328137_SWAN_Stitched_Wi-Fi_ANtennas","328327602_Experience_Cross-Technology_Radio_Respiratory_Monitoring_Performance_Study","327762663_Training-Free_Human_Vitality_Monitoring_Using_Commodity_Wi-Fi_Devices","327760729_Augmenting_User_Identification_with_WiFi_Based_Gesture_Recognition","327758471_FreeSense_A_Robust_Approach_for_Indoor_Human_Detection_Using_Wi-Fi_Signals"]}