{"id":"334361686_Linear_stability_analysis_of_strongly_coupled_fluid-structure_problems_with_the_Arbitrary-Lagrangian-Eulerian_method","abstract":"The stability analysis of elastic structures strongly coupled to incompressible viscous flows is investigated in this paper, based on a linearization of the governing equations formulated with the Arbitrary-Lagrangian-Eulerian method. The exact linearized formulation, previously derived to solve the unsteady non-linear equations with implicit temporal schemes, is used here to determine the physical linear stability of steady states. Once discretized with a standard finite-element method based on Lagrange elements, the leading eigenvalues/eigenmodes of the linearized operator are computed for three configurations representative for classical fluid-structure interaction instabilities: the vortex-induced vibrations of an elastic plate clamped to the rear of a rigid cylinder, the flutter instability of a flag immersed in a channel flow and the vortex shedding behind a three-dimensional plate bent by the steady flow. The results are in good agreement with instability thresholds reported in the literature and obtained with time-marching simulations, at a much lower computational cost. To further decrease this computational cost, the equations governing the solid perturbations are projected onto a reduced basis of free-vibration modes. This projection allows to eliminate the extension perturbation, a non-physical variable introduced in the ALE formalism to propagate the infinitesimal displacement of the fluid-solid interface into the fluid domain.","authors":["Jean-Lou Pfister","Olivier Marquet","Marco Carini"],"meta":["June 2019Computer Methods in Applied Mechanics and Engineering 355:663-689","DOI:10.1016/j.cma.2019.06.024","Project: AEROFLEX - Aeroelastic instabilities and control of FLEXible structures"],"references":["326100484_Vortex-induced_vibrations_of_cylinders_bent_by_the_flow","314095708_The_stability_of_a_flexible_cantilever_in_viscous_channel_flow","308975637_FaCSI_A_block_parallel_preconditioner_for_fluid-structure_interaction_in_hemodynamics","308011902_Solving_Monolithic_Fluid-Structure_Interaction_Problems_in_Arbitrary_Lagrangian_Eulerian_Coordinates_with_the_dealII_Library","284995679_Introduction_to_Shape_Optimization","280851884_Overview_of_MUMPS_A_multifrontal_Massively_Parallel_Solver","277598007_Aeroelastic_stability_analysis_of_a_flexible_over-expanded_rocket_nozzle_using_numerical_coupling_by_the_method_of_transpiration","277025185_A_Monolithic_Geometric_Multigrid_Solver_for_Fluid-Structure_Interactions_in_ALE_formulation","269064375_On_the_transpiration_method_for_efficient_aeroelastic_analysis_using_an_Euler_solver","267434798_Optimal_Control_and_Parameter_Estimation_for_Stationary_Fluid-Structure_Interaction_Problems"]}