{"id":"334376738_Towards_Efficient_Query_Processing_over_Heterogeneous_RDF_Interfaces","abstract":"Since the proposal of RDF as a standard for representing statements about entities, diverse interfaces to publish and strategies to query RDF data have been proposed. Although some recent proposals are aware of the advantages and disadvantages of state-of-the-art approaches, no work has yet tried to integrate them into a hybrid system that exploits their, in many cases, complementary strengths to process queries more efficiently than each of these approaches could do individually. In this paper, we present hybridSE, an approach that exploits the diverse characteristics of queryable RDF interfaces to efficiently process SPARQL queries. We present a brief study of the characteristics of some of the most popular RDF interfaces (brTPF and SPARQL endpoints), a method to estimate the impact of using a particular interface on query evaluation, and a method to use multiple interfaces to efficiently process a query. Our experiments, using a well-known benchmark dataset and a large number of queries, with result sizes varying from 1 up to 1 million, show that hybridSE processes queries up to three orders of magnitude faster and transfers up to four orders of magnitude less data.","authors":["Gabriela Montoya","Christian Aebeloe","Katja Hose"],"meta":["August 2018","Conference: ISWC2018 workshop on Decentralizing the Semantic WebAt: Monterey, CA, USA"],"references":["326340618_Decomposing_Federated_Queries_in_Presence_of_Replicated_Fragments","326337776_Triple_Pattern_Fragments_A_Low-Cost_Knowledge_Graph_Interface_for_the_Web","319644947_A_Formal_Framework_for_Comparing_Linked_Data_Fragments","304850049_Query_processing_in_multistore_systems_an_overview","291823634_Diversified_Stress_Testing_of_RDF_Data_Management_Systems","320202524_The_Odyssey_Approach_for_Optimizing_Federated_SPARQL_Queries","309227607_Bindings-Restricted_Triple_Pattern_Fragments","300883940_Processing_Aggregate_Queries_in_a_Federation_of_SPARQL_Endpoints","291166514_Query_Execution_Optimization_for_Clients_of_Triple_Pattern_Fragments","286832644_Learning_from_the_history_of_distributed_query_processing_a_heretic_view_on_linked_data_management"]}