{"id":"334337351_A_Model_Replication_with_an_Extension_of_Students'_Perception_of_Prospective_Employer_Attractiveness","abstract":"In the light of a long-term rising focus on human resources as the essential for a competitiveness of organizations, human resource management intersects with marketing to help firms attract and retain potential employees. The existing literature, mainly referred to as employer branding, has been concerned primarily with the identification of relevant elements of the proposition of employer value, while several authors have pointed out the need to focus on relative elements. Therefore, the present research attempts to replicate a model by Sivertzen et al. (2013) which investigates factors regarding employer branding strategies, and to verify whether the predominant view of relevant elements might or might not be considered inadequate. We have replicated the model with the extension of different industries, and the paradigm was tested on two larger samples compared to the original paper. An electronic questionnaire was distributed to computer science students (337 responses) and students of economics (290) at universities in the Czech Republic. The findings indicate that several employer attractiveness attributes could have a positive relation to corporate reputation. However, results differ between industries. The validation of the employer attractiveness scale resulted in dimensions which are different than those in the original study, with new dimensions featuring different indicators proposed. A positive relation was found between the use of social media and corporate reputation, the use of social media with the intention of applying for a job, as well as corporate reputation in terms of the intention of applying for a job.","authors":["Kristína Babíková","Jakub Buček"],"meta":["June 2019Journal of Competitiveness 11(2):5-21","DOI:10.7441/joc.2019.02.01"],"references":["309139471_Employer_Branding_A_Brand_Equity-based_Literature_Review_and_Research_Agenda_Brand_Equity-Based_Employer_Branding","305073087_Why_replication_studies_are_essential_Learning_from_failure_and_success","278118071_Using_social_media_to_recruit_global_supply_chain_managers","272675524_Employer_Branding_Constrains_Applicants'_Job_Seeking_Behaviour","311867489_New_Strategic_Role_for_HR_Leading_the_Employer-Branding_Process","306521277_Replication_in_strategic_management","305732481_What_happened_to_Popperian_falsification_Publishing_neutral_and_negative_findings_Moving_away_from_biased_publication_practices","290784215_Making_talent_a_strategic_priority","285826531_Identifying_the_dimensions_of_attractiveness_of_an_employer_brand_in_the_Indian_context","285707472_Captivating_company_Dimensions_of_attractiveness_in_employer_branding"]}