{"id":"334388164_On_the_construction_of_pareto-compliant_quality_indicators","abstract":"The performance comparison of multi-objective evolutionary algorithms (MOEAs) has been a broadly studied research area. For almost two decades, quality indicators (QIs) have been employed to quantitatively compare the Pareto front approximations produced by MOEAs. QIs are set-functions that assign a real value, depending on specific preferences, to such approximation sets. Mainly, QIs aim to measure the capacity of MOEAs to generate nondomi-nated solutions, the diversity of such solutions, and their convergence to the true Pareto front. Regarding convergence QIs, the Pareto-compliance property is crucial to properly assess the performance of MOEAs. However, in specialized literature, the only Pareto-compliant QI is the hypervolume indicator. In this paper, we propose a methodology to construct new Pareto-compliant indicators based on the combination of QIs. Our preliminary experimental results show that our proposed framework to construct Pareto-compliant QIs introduce new preferences over the Pareto front approximations.","authors":["Jesús Guillermo Falcón-Cardona","Michael Emmerich","Carlos A. Coello Coello"],"meta":["July 2019","DOI:10.1145/3319619.3326902","Conference: the Genetic and Evolutionary Computation Conference Companion","Project: Set-Oriented and Indicator-Based Multicriteria Optimization (SIMCO)"],"references":["331853549_Quality_Evaluation_of_Solution_Sets_in_Multiobjective_Optimisation_A_Survey","254462273_On_the_Properties_of_the_R2_Indicator","220702040_On_the_Performance_Assessment_and_Comparison_of_Stochastic_Multiobjective_Optimizers","313841406_An_Overview_of_Weighted_and_Unconstrained_Scalarizing_Functions","305685499_A_Correlation_Analysis_of_Set_Quality_Indicator_Values_in_Multiobjective_Optimization","278619582_A_Correlation_Analysis_of_Set_Quality_Indicator_Values_in_Multiobjective_Optimization","242919220_Muiltiobjective_Optimization_Using_Nondominated_Sorting_in_Genetic_Algorithms","235709741_Lecture_Notes_in_Computer_Science","216457231_Theory_of_the_Hypervolume_Indicator_Optimal_m-Distributions_and_the_Choice_of_the_Reference_Point","216300449_Evolutionary_Algorithms_for_Solving_Multi-Objective_Problems_Second_Edition"]}