{"id":"334379083_Conceptual_framework_for_enhancing_visual_change_point_analysis_in_generalized_multi-temporal_displays","abstract":"Large amounts of point data are being generated and depicted in web maps, in particular promoted by the availability of Volunteered Geographic Information (VGI). This data volume causes usability problems for the visual presentation and exploration, especially by decreasing rendering performance and increasing geometric or semantic point clutter. Typically, generalization techniques are applied in order to overcome these clutter problems. Appropriate constraint-based approaches have been developed for static and single displays.\nDue to the increasing amount and relevance of multi-temporal point data, the aim of this contribution is to present a so far missing conceptual framework that consists of constraints related to change point analysis. These constraints describe the effects of the generalization on preservation and legibility of change information. Here, different types of change point analysis are differentiated, namely: existential changes, changes of semantic properties, and changes of spatial properties. For this purpose, difference frames between two given frames of the multi-temporal data set are used as a model of the mental representation of change information.\nThe resulting constraints can be used to describe and to compare the suitability of various generalization operations for specific tasks. However, in a later stage they can also trigger the generalization processes as such. This could lead to a new way of thinking, since the optimization of generalization processes should work on difference frames rather than on single views.","authors":["Jochen Schiewe"],"meta":["July 2019Proceedings of the ICA 2:1-7","DOI:10.5194/ica-proc-2-114-2019"],"references":["326599633_Task-Oriented_Visualization_Approaches_for_Landscape_and_Urban_Change_Analysis","320800744_A_Technical_Survey_on_Decluttering_of_Icons_in_Online_Map-Based_Mashups","306199857_The_analysis_of_spatial_association_by_use_of_distance_statistics","302984747_A_Taxonomy_of_Clutter_Reduction_for_Information_Visualisation","293361234_The_generalization_of_point_clusters_and_its_quality_assessment_based_on_a_polarization_approach","278716125_Modelling_the_Overall_Process_of_Generalisation","269278527_Generalisation_of_Geographic_Information_Cartographic_Modelling_and_Applications","267629498_Spatial_Clustering_Overview_and_Comparison_Accuracy_Sensitivity_and_Computational_Expense","259703259_Clutter_Reduction_Methods_for_Point_Symbols_in_Map_Mashups","250196208_Cluster_Perception_in_the_Distribution_of_Point_Objects"]}