{"id":"334431513_A_Cross-analysis_of_Block-based_and_Visual_Programming_Apps_with_Computer_Science_Student-Teachers","abstract":"In the last few years, it has been pointed out that teaching programming is a strong strategy to develop pupils' competences in computational thinking (CT). In the Portuguese context, the curriculum changes in 2018 made programming and CT compulsory for every pupil in primary and secondary education. Nowadays, there is an information and communication technology (ICT) subject, taught by a computer science teacher in each school grade. In Portugal, to become a computer science teacher in primary and secondary education, it is compulsory to have a master's degree in computer science education. This article reports on a pedagogical activity developed with student-teachers of a Master in Teaching Informatics at the University of Lisbon. Within the activities of the master's program, we developed a cross-analysis of the core characteristics of 26 block-based and visual programming applications (apps) used to teach computational thinking and programming in school classes. In order to organize the analysis, a framework with several dimensions was developed and used by student-teachers to register the characteristics of each app. The product of this work is a comparative matrix mapping the core characteristics of each of the 26 apps that student-teachers used to select the most appropriate one for teaching programming and computational thinking according to each grade, age group and other characteristics.","authors":["João Piedade","Nuno Dorotea","Fábio Ferrentini Sampaio","Ana Pedro"],"meta":["July 2019Education Sciences 9(3):181","DOI:10.3390/educsci9030181","Projects: Computer Science Teacher EducationTEL@FTELab"],"references":["320446262_Frame-Based_Editing","314293221_Using_Upper-Elementary_Student_Performance_to_Understand_Conceptual_Sequencing_in_a_Blocks-based_Curriculum","329150357_Exploring_factors_influencing_the_acceptance_of_visual_programming_environment_among_boys_and_girls_in_primary_schools","325001618_How_block-based_text-based_and_hybrid_blocktext_modalities_shape_novice_programming_practices","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","317160209_Learnable_Programming_Blocks_and_Beyond","315446328_From_Blocks_to_Text_and_Back_Programming_Patterns_in_a_Dual-Modality_Environment","311314199_A_review_of_models_for_introducing_computational_thinking_computer_science_and_computing_in_K-12_education","308031788_Girls_Boys_and_Bots_Gender_Differences_in_Young_Children's_Performance_on_Robotics_and_Programming_Tasks","298972479_Learning_Computer_Science_Concepts_with_Scratch"]}