{"id":"334436008_Topology_optimization_and_3D_printing_of_multimaterial_magnetic_actuators_and_displays","abstract":"Upcoming actuation systems will be required to perform multiple tightly coupled functions analogous to their natural counterparts; e.g., the ability to control displacements and high-resolution appearance simultaneously is necessary for mimicking the camouflage seen in cuttlefish. Creating integrated actuation systems is challenging owing to the combined complexity of generating high-dimensional designs and developing multifunctional materials and their associated fabrication processes. Here, we present a complete toolkit consisting of multiobjective topology optimization (for design synthesis) and multimaterial drop-on-demand three-dimensional printing for fabricating complex actuators (>10 ⁶ design dimensions). The actuators consist of soft and rigid polymers and a magnetic nanoparticle/polymer composite that responds to a magnetic field. The topology optimizer assigns materials for individual voxels (volume elements) while simultaneously optimizing for physical deflection and high-resolution appearance. Unifying a topology optimization-based design strategy with a multimaterial fabrication process enables the creation of complex actuators and provides a promising route toward automated, goal-driven fabrication.","authors":["Subramanian Sundaram","Melina Skouras","David Saerom Kim","Louise van den Heuvel"],"meta":["July 2019Science Advances 5(7):eaaw1160","DOI:10.1126/sciadv.aaw1160"],"references":["322700127_Small-scale_soft-bodied_robot_with_multimodal_locomotion","321815371_Design_and_development_of_a_soft_gripper_with_topology_optimization","321388928_Will_robots_be_bodies_with_brains_or_brains_with_bodies","320680766_Inkjet_3D_printing_of_UV_and_thermal_cure_silicone_elastomers_for_dielectric_elastomer_actuators","320368726_Stretchable_surfaces_with_programmable_3D_texture_morphing_for_synthetic_camouflaging_skins","319213984_3D-Printed_Self-Folding_Electronics","315921672_Dynamic_masquerade_with_morphing_three-dimensional_skin_in_cuttlefish","314741447_Tensor_displays_compressive_light_field_synthesis_using_multilayer_displays_with_directional_backlighting","313777089_Spatially_selective_remote_magnetic_actuation_of_identical_helical_micromachines","313561001_Materials_that_couple_sensing_actuation_computation_and_communication"]}