{"id":"334438860_Visual_knitting_machine_programming","abstract":"Industrial knitting machines are commonly used to manufacture complicated shapes from yarns; however, designing patterns for these machines requires extensive training. We present the first general visual programming interface for creating 3D objects with complex surface finishes on industrial knitting machines. At the core of our interface is a new, augmented, version of the stitch mesh data structure. The augmented stitch mesh stores low-level knitting operations per-face and encodes the dependencies between faces using directed edge labels. Our system can generate knittable augmented stitch meshes from 3D models, allows users to edit these meshes in a way that preserves their knittability, and can schedule the execution order and location of each face for production on a knitting machine. Our system is general, in that its knittability-preserving editing operations are sufficient to transform between any two machine-knittable stitch patterns with the same orientation on the same surface. We demonstrate the power and flexibility of our pipeline by using it to create and knit objects featuring a wide range of patterns and textures, including intarsia and Fair Isle colorwork; knit and purl textures; cable patterns; and laces.","authors":["Vidya Narayanan","Kui wu","Cem Yuksel","James McCann"],"meta":["July 2019ACM Transactions on Graphics 38(4):1-13","DOI:10.1145/3306346.3322995"],"references":["330547347_Knittable_Stitch_Meshes","326726151_Stitch_meshing","326726105_FoldSketch_Enriching_garments_with_physically_reproducible_folds","331448193_SensorKnit_Architecting_Textile_Sensors_with_Machine_Knitting","329272500_Learning_a_shared_shape_space_for_multimodal_garment_design","329270831_Interactive_design_of_periodic_yarn-level_cloth_patterns","328870113_Knit_fabrics","326909337_Automatic_Machine_Knitting_of_3D_Meshes","326728088_Rule-free_sewing_pattern_adjustment_with_precision_and_efficiency","325883427_Efficient_transfer_planning_for_flat_knitting"]}