{"id":"334416672_Generating_a_Vision_for_Smart_Sustainable_City_of_the_Future_A_Scholarly_Backcasting_Approach","abstract":"Sustainable cities have been the leading global paradigm of urbanism. Undoubtedly, sustainable development has, since its widespread diffusion in the early 1990s, positively influenced city planning and development. This pertains to the immense opportunities that have been explored and the enormous benefits that have been realized in relation to sustainable urban forms, especially compact cities and eco–cities. However, such forms are still associated with a number of problems, issues, and challenges. This mainly involves the question of how they should be monitored, understood, and analyzed to improve, advance, and maintain their contribution to sustainability and thus to overcome the kind of wicked problems, unsettled issues, and complex challenges they embody. This in turn brings us to the current question related to the weak connection between and the extreme fragmentation of sustainable cities and smart cities as approaches and landscapes, respectively, despite the great potential of advanced ICT for, and its proven role in, supporting sustainable cities in enhancing and optimizing their performance under what is labeled ‘smart sustainable cities.’ In this respect, there has recently been a conscious push for sustainable cities to become smart and thus more sustainable by particularly embracing what big data technology and its novel applications has to offer in the hopes of reaching the optimal level of sustainability. In the meantime, we are in the midst of an expansion of time horizons in city planning and development. In this context, sustainable cities across the globe have adopted ambitious smart goals that extend far into the future. Essentially, there are multiple processes of smart sustainable urbanism, and hence multiple visions of, and pathways to achieving, smart sustainable cities based on how they can be conceptualized and operationalized. As a corollary of this, there is a host of opportunities to explore towards new approaches to such urbanism. The aim of this paper is to generate a vision for smart sustainable city of the future by answering the 6 guiding questions for Step 3 of the futures study being conducted. This study aims to analyze, investigate, and develop a novel model for smart sustainable city of the future using backcasting as a scholarly approach. It involves a series of papers of which this paper is the second one, following the earlier paper with Steps 1 and 2: strategic problem orientation, and leading through the whole backcasting study. Visionary images of a long–term future can stimulate an accelerated movement towards achieving the long–term goals of sustainability. The proposed model is believed to be the first of its kind and thus has not been, to the best of one’s knowledge, produced, nor is it being currently investigated, elsewhere.","authors":["Simon Elias Bibri"],"meta":["August 2019European Journal of Futures Research","DOI:10.1186/s40309-019-0157-0","Project: A Novel Model for Data-driven Smart Sustainable Cities of the Future: A Strategic Roadmap to Transformational Change in the Era of Big Data"],"references":["334494681_A_Scholarly_Backcasting_Approach_to_a_Novel_Model_for_Smart_Sustainable_Cities_of_the_Future_Strategic_Problem_Orientation","333929148_The_Anatomy_of_the_Data-Driven_Smart_Sustainable_City_Instrumentation_Datafication_Computerization_and_Related_Applications","333176215_The_Sciences_Underlying_Smart_Sustainable_Urbanism_Unprecedented_Paradigmatic_and_Scholarly_Shifts_in_Light_of_Big_Data_Science_and_Analytics","331099486_On_the_Sustainability_of_Smart_and_Smarter_Cities_in_the_Era_of_Big_Data_An_Interdisciplinary_and_Transdisciplinary_Literature_Review","330810708_Eco-cities_a_global_survey","326718487_The_Big_Data_Deluge_for_Transforming_the_Knowledge_of_Smart_Sustainable_Cities_A_Data_Mining_Framework_for_Urban_Analytics","325855726_Backcasting_in_Futures_Studies_A_Synthesized_Scholarly_and_Planning_Approach_to_Strategic_Smart_Sustainable_City_Development","342411017_Smart_Sustainable_Cities_of_the_Future_The_Untapped_Potential_of_Big_Data_Analytics_and_Context-Aware_Computing_for_Advancing_Sustainability","333224166_Big_Data_Science_and_Analytics_for_Smart_Sustainable_Urbanism_Unprecedented_Paradigmatic_Shifts_and_Practical_Advancements","322232797_Defining_the_eco-city_A_discursive_approach"]}