{"id":"334428562_Centrality_in_Complex_Networks_with_Overlapping_Community_Structure","abstract":"Abstract Identifying influential spreaders in networks is an essential issue in order to prevent epidemic spreading, or to accelerate information diffusion. Several centrality measures take advantage of various network topological properties to quantify the notion of influence. However, the vast majority of works ignore its community structure while it is one of the main features of many real-world networks. In a recent study, we show that the centrality of a node in a network with non-overlapping communities depends on two features: Its local influence on the nodes belonging to its community, and its global influence on the nodes belonging to the other communities. Using global and local connectivity of the nodes, we introduced a framework allowing to redefine all the classical centrality measures (designed for networks without community structure) to non-overlapping modular networks. In this paper, we extend the so-called “Modular Centrality” to networks with overlapping communities. Indeed, it is a frequent scenario in real-world networks, especially for social networks where nodes usually belong to several communities. The “Overlapping Modular Centrality” is a two-dimensional measure that quantifies the local and global influence of overlapping and non-overlapping nodes. Extensive experiments have been performed on synthetic and real-world data using the Susceptible-Infected-Recovered (SIR) epidemic model. Results show that the Overlapping Modular Centrality outperforms its alternatives designed for non-modular networks. These investigations provide better knowledge on the influence of the various parameters governing the overlapping community structure on the nodes’ centrality. Additionally, two combinations of the components of the Overlapping Modular Centrality are evaluated. Comparative analysis with competing methods shows that they produce more efficient centrality scores.","authors":["Zakariya Ghalmane","Chantal Cherifi","Hocine Cherifi","Mohammed El Hassouni"],"meta":["July 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-46507-y","Project: Centrality in Complex Networks with Overlapping Community Structure"],"references":["332996102_Centrality_in_modular_networks","329219593_A_new_local_and_multidimensional_ranking_measure_to_detect_spreaders_in_social_networks","328992003_Betweenness_Centrality_for_Networks_with_Non-Overlapping_Community_Structure","326286137_Identifying_influential_nodes_based_on_network_representation_learning_in_complex_networks","323355763_Community_Detection_with_Metadata_in_a_Network_of_Biographies_of_Western_Art_Painters","321186679_Community_detection_algorithm_evaluation_with_ground-truth_data","328721059_Ranking_nodes_in_complex_networks_based_on_local_structure_and_improving_closeness_centrality","324634190_An_Efficient_Immunization_Strategy_Using_Overlapping_Nodes_and_Its_Neighborhoods","322549417_Identifying_Influential_Nodes_Based_on_Community_Structure_to_Speed_up_the_Dissemination_of_Information_in_Complex_Network","309095047_A_local_immunization_strategy_for_networks_with_overlapping_community_structure"]}