{"id":"334483279_TLCS_A_Digital_Library_with_Resources_to_Teach_and_Learn_Computer_Science","abstract":"Nowadays, teaching and learning computer science is done at various ages, for several topics and for different reasons. Depending on the country, it can start from the primary school and it finishes at the higher education level, or even later if we take continuing education into consideration. Topics to be learned can be as simple as binary representation or basic programming concepts that can be taught to children to introduce them to computer science. It is also possible to teach and learn advanced data structures or algorithms optimisation, which are interesting skills for Olympiad in Informatics contestants, for example. Recently, there is a prominent number of websites and applications that have been created to help the teaching and learning of many informatics concepts. This paper presents a platform that has been designed to browse a database of resources that can be used to teach or to learn computer science. This digital library contains freely accessible resources and can be searched efficiently thanks to the proposed structure for its content. It has been designed to maximise the user's experience and to fit modern models of digital libraries. For each resource, a detailed information sheet has been produced, containing among other things pedagogical information to help teachers and learners use the resources as best as possible. This platform can also be used to train candidates to Olympiad in Informatics and other related and similar competitions.","authors":["Sébastien Combéfis","Guillaume de Moffarts","Mile Jovanov"],"meta":["July 2019OLYMPIADS IN INFORMATICS 13:3-20","DOI:10.15388/ioi.2019.01"],"references":["305140678_A_K-6_Computational_Thinking_Curriculum_Framework_Implications_for_Teacher_Knowledge","305084679_Learning_Programming_through_Games_and_Contests_Overview_Characterisation_and_Discussion","300228808_Pythia_Reloaded_An_Intelligent_Unit_Testing-Based_Code_Grader_for_Education","283595158_Programming_Trainings_and_Informatics_Teaching_Through_Online_Contests","267094856_SQL_Island_An_Adventure_Game_to_Learn_the_Database_Language_SQL","321542733_Open_Education_from_OERs_to_MOOCs","321449705_Sketching_Graphs_in_a_Calculus_MOOC_Preliminary_Results","314830167_Introducing_computer_science_through_animation_and_virtual_worlds","306062118_New_Models_of_Open_and_Distributed_Learning","262294706_Online_python_tutor_Embeddable_web-based_program_visualization_for_cs_education"]}