{"id":"334434726_A_Vademecum_on_Blockchain_Technologies_When_Which_and_How","abstract":"Blockchain is a technology making the shared registry concept from distributed systems a reality for a number of application domains, from the cryptocurrency one to potentially any industrial system requiring decentralized, robust, trusted and automated decision making in a multi-stakeholder situation. Nevertheless, the actual advantages in using blockchain instead of any other traditional solution (such as centralized databases) are not completely understood to date, or at least there is a strong need for a vademecum guiding designers toward the right decision about when to adopt blockchain or not, which kind of blockchain better meets use-case requirements, and how to use it. In this article we aim at providing the community with such a vademecum, while giving a general presentation of blockchain that goes beyond its usage in Bitcoin and surveying a selection of the vast literature that emerged in the last few years. We draw the key requirements and their evolution when passing from permissionless to permissioned blockchains, presenting the differences between proposed and experimented consensus mechanisms, and describing existing blockchain platforms.","authors":["Marianna Belotti","Nikola Bozic","Guy Pujolle","Stefano Secci"],"meta":["July 2019IEEE Communications Surveys & Tutorials PP(99):1-1","DOI:10.1109/COMST.2019.2928178"],"references":["332320425_Towards_Blockchain-based_Intelligent_Transportation_Systems","330743521_A_Survey_on_Consensus_Mechanisms_and_Mining_Strategy_Management_in_Blockchain_Networks","328271018_Blockchain_challenges_and_opportunities_a_survey","344847654_Understanding_the_landscape_of_Distributed_Ledger_TechnologiesBlockchain_Challenges_opportunities_and_the_prospects_for_standards","336339092_OVERVIEW_OF_BLOCKCHAIN_TECHNOLOGY","332676009_A_Blockchain_Consensus_Protocol_With_Horizontal_Scalability","331075766_Are_Stable_Coins_Stable","329683614_A_survey_of_blockchain_security_issues_and_challenges","329058648_Blockchain_Technologies_for_the_Internet_of_Things_Research_Issues_and_Challenges","328820555_Do_you_Need_a_Blockchain"]}