{"id":"334449310_Propostas_de_formacao_para_Educadores_de_Infancia_e_Professores_do_1_Ciclo_do_Ensino_Basico","abstract":"The article presented below is a proposal for the training of Educators and Teachers of 1st Cycle of Basic Education in Portugal to be extended, in this case in particular, to new technologies. We refer to the importance of computer science in the initial training of 1st cycle Teachers and Teachers to make it easier for Educators and Teachers to deal with the needs of today's children, as well as to guide them in this new learning process, and can help to work the information they acquire outside the school environment, taking into account that information is not knowledge and the student continues to need to be guided by someone who has already worked or is able to work on that information, thus adding another function to the functions of Educator and Professor, that of information managers. One of the challenges in educating teachers and educators is related to the need to adapt to a changing society where technology and spatial analysis have become essential. The role of the teacher is changing but it does not diminish in importance. It now has the function of transforming information into knowledge. In this context, new technologies are an important tool. We have constructed this article based on the opinions of several authors, authors that have also been the basis of a thesis that contains the empirical part alluding to the theme described here.","authors":["Liliana Luís"],"meta":["July 2019International Journal of Developmental and Educational Psychology Revista INFAD de psicología 2(1):109","DOI:10.17060/ijodaep.2019.n1.v2.1346"],"references":["315245137_Servicos_KML_para_concepcao_e_partilha_de_mashups_em_ambiente_web20_Interfaces_ArcGIS-Google_Maps_como_exemplo_de_um_novo_geoweb-paradigma_Consumer-Generated_Media_CGM","26357137_Infancia_exclusao_social_e_educacao_como_utopia_realizavel","234745240_Technology_in_Early_Childhood_Education_Finding_the_Balance_By_Request_Series"]}