{"id":"334451166_Airborne_and_spaceborne_remote_sensing_for_archaeological_and_cultural_heritage_applications_A_review_of_the_century_1907-2017","abstract":"Archaeological and cultural heritage (ACH), one of the core carriers of cultural diversity on our planet, has a direct bearing on the sustainable development of mankind. Documenting and protecting ACH is the common responsibility and duty of all humanity. It is governed by UNESCO along with the scientific communities that foster and encourage the use of advanced non-invasive techniques and methods for promoting scientific research into ACH and conservation of ACH sites. The use of remote sensing, a non-destructive tool, is increasingly popular by specialists around the world as it allows fast prospecting and mapping at multiple scales, rapid analysis of multisource datasets, and dynamic monitoring of ACH sites and their surrounding environments. The cost of using remote sensing is lower or even zero in practical applications. In this review, in order to discuss the advantages of airborne and spaceborne remote sensing (ASRS), the principles that make passive (photography, multispectral and hyperspectral) and active (synthetic aperture radar (SAR) and light detection and ranging radar (LiDAR)) imaging techniques suitable for ACH applications are first summarized and pointed out; a review of ASRS and the methodologies used over the past century is then presented together with relevant highlights from well-known research projects. Selected case studies from Mediterranean regions to East Asia illustrate how ASRS can be used effectively to investigate and understand archaeological features at multiple-scales and to monitor and assess the conservation status of cultural heritage sites in the context of sustainable development. An in-depth discussion on the limitations of ASRS and associated remaining challenges is presented along with conclusions and a look at future trends.","authors":["Lei Luo","Xinyuan Wang","Huadong Guo","Rosa Lasaponara"],"meta":["July 2019Remote Sensing of Environment 232","DOI:10.1016/j.rse.2019.111280","Projects: Archaeological Remote Sensing along the One Belt and One RoadRemote and proximal sensing for archeology"],"references":["337153388_Google_Earth_as_a_Powerful_Tool_for_Archaeological_and_Cultural_Heritage_Applications_A_Review","330444207_Distributed_Scatterer_InSAR_Reveals_Surface_Motion_of_the_Ancient_Chaoshan_Residence_Cluster_in_the_Lianjiang_Plain_China","329986614_Using_RPAS_for_the_detection_of_archaeological_objects_using_multispectral_and_thermal_imaging","329663745_A_Remote_Sensing_Approach_for_Mapping_the_Development_of_Ancient_Water_Management_in_the_Near_East","329313907_Using_deep_neural_networks_on_airborne_laser_scanning_data_Results_from_a_case_study_of_semi-automatic_mapping_of_archaeological_topography_on_Arran_Scotland","333455033_Earth_observation_and_social_media_Evaluating_the_spatiotemporal_contribution_of_non-native_trees_to_cultural_ecosystem_services","331443032_Recentering_the_rural_Lidar_and_articulated_landscapes_among_the_Maya","330054471_New_technology_and_archaeological_practice_Improving_the_primary_archaeological_recording_process_in_excavation_by_means_of_UAS_photogrammetry","329916585_Photogrammetric_studies_of_inaccessible_sites_in_archaeology_Case_study_of_burial_chambers_in_Qubbet_el-Hawa_Aswan_Egypt","329438095_Satellite_Hyperspectral_and_Multispectral_Imaging"]}