{"id":"334468864_Game_as_Critic_as_Art_30","abstract":"Dimitriadi (eds.) Fournos, Atenas (Grecia). 2006. The software appropriation and modification of any kind of videogame-reverse engineering-is it self a subversive act which concerns a double purpose: critic (as review) and creative (as regeneration). In every computer game developed by artists, game, critic and creation combine in a larger or lesser extent to achieve remarkable and parodic products wich give incentive to exploration. These characteristics reach greater relevance on online and offline games, original or modified-also game parodies-which possess a strong social-politic nature and that are placed in an explicit way in art's scope. In the first place, we should emphasize that, besides the formal subversion that happens in most of them, considered as a direct attack on the multinational companies that support the videogame industry, its objective is to implement another kind of purely conceptual subversion. To start with, its general public are not adolescents and kids, but adults. Secondly, its guide lines are not the same as those for commercial games: its not about roping in the biggest number of addicts during for largest period of time; its not about seducing with the most realistic aesthetic or the most original design, it's not about being the market's most competitive, its not even about satisfying the adolescent ego we all carry inside (some more than others) by killing everything that moves in a screen; its not about winning. It's about subverting and parodying preconceived ethics and aesthetics. It's about to socialize inducing to reflection. Traditionally, most of the videogames have focused on fantastic situations that stand far from reality, yet latterly the videogame industry has made popular the tendency to base its products on real-life situations: real character stereotypes fighting in real places. Well, one of the characteristics of artist developed games is the systematic reference to real situations, considered from the perspective of its socializing and educational potential. Consequently, the subjects approached cluster around present-day questions, such as emigration, racial discrimination, identity, the corporate systems, sexual education, historical visions with a widespread media coverage, social","authors":["Laura Baigorri"],"meta":["January 2006","In book: Gaming Realities: the Challenge of Digital CulturePublisher: Santorineos & Dimitriadi (eds.) Fournos, Atenas (Grecia)"],"references":[]}