{"id":"334438695_Automatic_Diacritics_Restoration_for_Tunisian_Dialect","abstract":"Modern Standard Arabic, as well as Arabic dialect languages, are usually written without diacritics. The absence of these marks constitute a real problem in the automatic processing of these data by NLP tools. Indeed, writing Arabic without diacritics introduces several types of ambiguity. First, a word without diacratics could have many possible meanings depending on their diacritization. Second, undiacritized surface forms of an Arabic word might have as many as 200 readings depending on the complexity of its morphology [12]. In fact, the agglutination property of Arabic might produce a problem that can only be resolved using diacritics. Third, without diacritics a word could have many possible parts of speech (POS) instead of one. This is the case with the words that have the same spelling and POS tag but a different lexical sense, or words that have the same spelling but different POS tags and lexical senses [8]. Finally, there is ambiguity at the grammatical level (syntactic ambiguity). In this article, we propose the first work that investigates the automatic diacritization of Tunisian Dialect texts. We first describe our annotation guidelines and procedure. Then, we propose two major models, namely a statistical machine translation (SMT) and a discriminative model as a sequence classification task based on Conditional Random Fields (CRF). In the second approach, we integrate POS features to influence the generation of diacritics. Diacritics restoration was performed at both the word and the character levels. The results showed high scores of automatic diacritization based on the CRF system (Word Error Rate (WER) 21.44% for CRF and WER 34.6% for SMT).","authors":["Abir Masmoudi","Salima Mdhaffar","Sellami Rahma","Lamia Hadrich Belguith"],"meta":["July 2019ACM Transactions on Asian and Low-Resource Language Information Processing 18(3):1-18","DOI:10.1145/3297278","Project:  Automatic processing of the Tunisian dialect: construction of linguistic resources"],"references":["342420693_PHONETIC_TOOL_FOR_THE_TUNISIAN_ARABIC","319988998_Automatic_speech_recognition_system_for_Tunisian_dialect","318738608_SHAKKIL_An_Automatic_Diacritization_System_for_Modern_Standard_Arabic_Texts","313035715_Morphological_Disambiguation_of_Tunisian_Dialect","312671188_Automatic_Diacritics_Restoration_for_Dialectal_Arabic_Text","307583782_Spoken_Tunisian_Arabic_Corpus_STAC_Transcription_and_Annotation","334796517_Annotation_Guidelines_and_Framework_for_Arabic_Machine_Translation_Post-Edited_Corpus","323392203_Guidelines_and_Framework_for_a_Large_Scale_Arabic_Diacritized_Corpus","318741532_A_Layered_Language_Model_based_Hybrid_Approach_to_Automatic_Full_Diacritization_of_Arabic","313038781_Pluringuisme_et_diglossie_en_Tunisie"]}