{"id":"334449006_Sanitizing_and_measuring_privacy_of_large_sparse_datasets_for_recommender_systems","abstract":"Big Data is characterized by large volumes of highly dynamical data and is used for discovering hidden trends and correlations. However, as more data is collected, previous pieces of information can be put together to facilitate linkage of private records. In this context, when protecting the privacy of data subjects, the same attributes that are to be protected may be used for further re-identification, that is, sensitive attributes may be used as quasi-identifiers. For example, in high-dimensional data such as recommendations, transaction records or geo-located data, previously published transactions and locations may be used to uncover further private transactions and locations. In this paper, we propose a k-anonymization algorithm and a metric for privacy in databases in which all the attributes are quasi-identifiers as well as sensitive attributes. We apply our algorithm on high dimensional datasets for model-based and memory-based collaborative filtering, and use the metric to perform privacy comparisons between different methods of protection such as k-anonymity and differential privacy. We show the applicability of our method by performing tests on the large and sparse dataset (MovieLens 20M) of 20 million ratings that 138,493 users gave to 27,278 movies.","authors":["Julián Salas"],"meta":["July 2019Journal of Ambient Intelligence and Humanized Computing","DOI:10.1007/s12652-019-01391-2"],"references":["343462569_Surprise_A_Python_library_for_recommender_systems","325906461_Some_Basics_on_Privacy_Techniques_Anonymization_and_their_Big_Data_Challenges","325269533_Scalable_non-deterministic_clustering-based_k-anonymization_for_rich_networks","303711969_A_survey_of_graph-modification_techniques_for_privacy-preserving_on_networks","298985863_Secure_anonymization_for_incremental_datasets","327470959_A_General_Algorithm_for_k-anonymity_on_Dynamic_Databases_ESORICS_2018_International_Workshops_DPM_2018_and_CBT_2018_Barcelona_Spain_September_6-7_2018_Proceedings","323690660_Improving_k_-anonymity_based_privacy_preservation_for_collaborative_filtering","323371798_Calibrating_Noise_to_Sensitivity_in_Private_Data_Analysis","317801362_Data_Privacy_Foundations_New_Developments_and_the_Big_Data_Challenge","311337422_Graph_Data_Anonymization_De-Anonymization_Attacks_and_De-Anonymizability_Quantification_A_Survey"]}