{"id":"334476066_Snorkel_rapid_training_data_creation_with_weak_supervision","abstract":"Labeling training data is increasingly the largest bottleneck in deploying machine learning systems. We present Snorkel, a first-of-its-kind system that enables users to train state-of-the-art models without hand labeling any training data. Instead, users write labeling functions that express arbitrary heuristics, which can have unknown accuracies and correlations. Snorkel denoises their outputs without access to ground truth by incorporating the first end-to-end implementation of our recently proposed machine learning paradigm, data programming. We present a flexible interface layer for writing labeling functions based on our experience over the past year collaborating with companies, agencies, and research laboratories. In a user study, subject matter experts build models \n\n2.8\n×\n\nfaster and increase predictive performance an average \n\n45.5\n%\n\nversus seven hours of hand labeling. We study the modeling trade-offs in this new setting and propose an optimizer for automating trade-off decisions that gives up to \n\n1.8\n×\n\nspeedup per pipeline execution. In two collaborations, with the US Department of Veterans Affairs and the US Food and Drug Administration, and on four open-source text and image data sets representative of other deployments, Snorkel provides \n\n132\n%\n\naverage improvements to predictive performance over prior heuristic approaches and comes within an average \n\n3.60\n%\n\nof the predictive performance of large hand-curated training sets.","authors":["Alexander Ratner","Stephen H. Bach","Henry Ehrenberg","Jason Fries"],"meta":["May 2020The VLDB Journal 29(D1)","DOI:10.1007/s00778-019-00552-1"],"references":["334702550_A_machine-compiled_database_of_genome-wide_association_studies","334464999_Weakly_supervised_classification_of_aortic_valve_malformations_using_unlabeled_cardiac_MRI_sequences","325589536_Weakly_supervised_classification_of_rare_aortic_valve_malformations_using_unlabeled_cardiac_MRI_sequences","335554551_Training_Complex_Models_with_Multi-Task_Weak_Supervision","334115955_Training_Classifiers_with_Natural_Language_Explanations","333865246_Snorkel_DryBell_A_Case_Study_in_Deploying_Weak_Supervision_at_Industrial_Scale","330859460_Snuba_Automating_Weak_Supervision_to_Label_Training_Data","325371426_Fonduer_Knowledge_Base_Construction_from_Richly_Formatted_Data","325138675_Snorkel_MeTaL_Weak_Supervision_for_Multi-Task_Learning","322058545_Revisiting_Unreasonable_Effectiveness_of_Data_in_Deep_Learning_Era"]}