{"id":"334449850_Unsupervised_intelligent_system_based_on_one_class_support_vector_machine_and_Grey_Wolf_optimization_for_IoT_botnet_detection","abstract":"Recently, the number of Internet of Things (IoT) botnet attacks has increased tremendously due to the expansion of online IoT devices which can be easily compromised. Botnets are a common threat that takes advantage of the lack of basic security tools in IoT devices and can perform a series of Distributed Denial of Service (DDoS) attacks. Developing new methods to detect compromised IoT devices is urgent in order to mitigate the negative consequences of these IoT botnets since the existing IoT botnet detection methods still present some issues, such as, relying on labelled data, not being validated with newer botnets, and using very complex machine learning algorithms. Anomaly detection methods are promising for detecting IoT botnet attacks since the amount of available normal data is very large. One of the powerful algorithms that can be used for anomaly detection is One Class Support vector machine (OCSVM). The efficiency of the OCSVM algorithm depends on several factors that greatly affect the classification results such as the subset of features that are used for training OCSVM model, the kernel type, and its hyperparameters. In this paper, a new unsupervised evolutionary IoT botnet detection method is proposed. The main contribution of the proposed method is to detect IoT botnet attacks launched form compromised IoT devices by exploiting the efficiency of a recent swarm intelligence algorithm called Grey Wolf Optimization algorithm (GWO) to optimize the hyperparameters of the OCSVM and at the same time to find the features that best describe the IoT botnet problem. To prove the efficiency of the proposed method, its performance is evaluated using typical anomaly detection evaluation measures over a new version of a real benchmark dataset. The experimental results show that the proposed method outperforms all other algorithms in terms of true positive rate, false positive rate, and G-mean for all IoT device types. Also, it achieves the lowest detection time, while significantly reducing the number of selected features.","authors":["Amaal Rateb Shorman","Hossam Faris","Ibrahim Aljarah"],"meta":["July 2020Journal of Ambient Intelligence and Humanized Computing 11(3)","DOI:10.1007/s12652-019-01387-y"],"references":["330191747_Automatic_selection_of_hidden_neurons_and_weights_in_neural_networks_using_grey_wolf_optimizer_based_on_a_hybrid_encoding_scheme","325304416_Recent_studies_on_optimisation_method_of_Grey_Wolf_Optimiser_GWO_a_review_2014-2017","323410433_Kitsune_An_Ensemble_of_Autoencoders_for_Online_Network_Intrusion_Detection","321294919_Grey_wolf_optimizer_a_review_of_recent_variants_and_applications","321017113_IoT_Security_Review_Blockchain_Solutions_and_Open_Challenges","320025854_A_comparative_evaluation_of_outlier_detection_algorithms_Experiments_and_analyses","328246279_N-BaIoT-Network-Based_Detection_of_IoT_Botnet_Attacks_Using_Deep_Autoencoders","324098713_A_security_evaluation_of_popular_Internet_of_Things_protocols_for_manufacturers","320275961_A_novel_network_security_algorithm_based_on_improved_support_vector_machine_from_smart_city_perspective","319854727_Software-Defined_Edge_Defense_Against_IoT-Based_DDoS","318452695_Quantifying_the_Spectrum_of_Denial-of-Service_Attacks_through_Internet_Backscatter","318288727_DDoS_in_the_IoT_Mirai_and_other_botnets","316455478_IoDDoS_-_The_Internet_of_Distributed_Denial_of_Service_Attacks_A_Case_Study_of_the_Mirai_Malware_and_IoT-Based_Botnets","319502715_An_effective_intrusion_detection_framework_based_on_SVM_with_feature_augmentation","317702732_Kalis_-_A_System_for_Knowledge-Driven_Adaptable_Intrusion_Detection_for_the_Internet_of_Things"]}