{"id":"334484033_Item_Listing_Optimization_for_E-Commerce_Websites_Based_on_Diversity","abstract":"For e-commerce websites, deciding the manner in which items are listed on webpages is an important issue because it can dramatically affect item sales. One of the simplest strategies for listing items to improve the overall sales is to do so in a descending order of popularity representing sales or sales numbers aggregated over a recent period. However, in lists generated using this strategy, items with high similarity are often placed consecutively. In other words, the generated item list might be biased toward a specific preference. Therefore, this study employs penalties for items with high similarity being placed next to each other in the list and transforms the item listing problem to a quadratic assignment problem (QAP). The QAP is well-known as an NP-hard problem that cannot be solved in polynomial time. To solve the QAP, we employ quantum annealing, which exploits the quantum tunneling effect to efficiently solve an optimization problem. In addition, we propose a problem decomposition method based on the structure of the item listing problem because the quantum annealer we use (i.e., D-Wave 2000Q) has a limited number of quantum bits. Our experimental results indicate that we can create an item list that considers both popularity and diversity. In addition, we observe that using the problem decomposition method based on a problem structure can provide to a better solution with the quantum annealer in comparison with the existing problem decomposition method.","authors":["Naoki Nishimura","Kotaro Tanahashi","Koji Suganuma","Masamichi Miyama"],"meta":["July 2019Frontiers in Computer Science 1:2","DOI:10.3389/fcomp.2019.00002"],"references":["337367884_Control_of_Automated_Guided_Vehicles_Without_Collision_by_Quantum_Annealer_and_Digital_Devices","333803411_Application_of_Ising_Machines_and_a_Software_Development_for_Ising_Machines","331102843_Improving_solutions_by_embedding_larger_subproblems_in_a_D-Wave_quantum_annealer","326129842_Optimization_of_neural_networks_via_finite-value_quantum_fluctuations","325874990_A_comprehensive_review_of_quadratic_assignment_problem_variants_hybrids_and_applications","323598124_Statistical-Mechanical_Analysis_of_Compressed_Sensing_for_Hamiltonian_Estimation_of_Ising_Spin_Glass","323322958_Quantum_annealing_versus_classical_machine_learning_applied_to_a_simplified_computational_biology_problem","349407940_Reinforcement_learning_using_quantum_Boltzmann_machines","327978213_Quantum_annealing_next-generation_computation_and_how_to_implement_it_when_information_is_missing","326453689_Optimizing_Whole-Page_Presentation_for_Web_Search"]}