{"id":"334429141_Generating_kinetic_environments_to_study_dynamic_cellular_processes_in_single_cells","abstract":"Cells of any organism are consistently exposed to changes over time in their environment. The kinetics by which these changes occur are critical for the cellular response and fate decision. It is therefore important to control the temporal changes of extracellular stimuli precisely to understand biological mechanisms in a quantitative manner. Most current cell culture and biochemical studies focus on instant changes in the environment and therefore neglect the importance of kinetic environments. To address these shortcomings, we developed two experimental methodologies to precisely control the environment of single cells. These methodologies are compatible with standard biochemistry, molecular, cell and quantitative biology assays. We demonstrate applicability by obtaining time series and time point measurements in both live and fixed cells. We demonstrate the feasibility of the methodology in yeast and mammalian cell culture in combination with widely used assays such as flow cytometry, time-lapse microscopy and single-molecule RNA Fluorescent in-situ Hybridization (smFISH). Our experimental methodologies are easy to implement in most laboratory settings and allows the study of kinetic environments in a wide range of assays and different cell culture conditions.","authors":["Alexander Thiemicke","Hossein Jashnsaz","Guoliang Li","Gregor Neuert"],"meta":["July 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-46438-8"],"references":["334735330_Nonlinear_feedback_drives_homeostatic_plasticity_in_H2O2_stress_response","318334900_Microfluidic_Platform_for_the_Long-Term_On-Chip_Cultivation_of_Mammalian_Cells_for_Lab-On-A-Chip_Applications","290478036_c-Jun_N-terminal_Kinase_JNK_Signaling_as_a_Therapeutic_Target_for_Alzheimer's_Disease","319333080_Oscillatory_stimuli_differentiate_adapting_circuit_topologies","317643155_Microfluidics_as_a_Strategic_Player_to_Decipher_Single-Cell_Omics","305630367_JNK_pathway_activation_modulates_acquired_resistance_to_EGFRHER2_targeted_therapies","301591899_Collective_Space-Sensing_Coordinates_Pattern_Scaling_in_Engineered_Bacteria","287968020_Signaling_pathway_models_as_biomarkers_Patient-specific_simulations_of_JNK_activity_predict_the_survival_of_neuroblastoma_patients","284279607_Oscillatory_stress_stimulation_uncovers_an_Achilles'_heel_of_the_yeast_MAPK_signaling_network","284132764_A_Cellular_System_for_Spatial_Signal_Decoding_in_Chemical_Gradients"]}