{"id":"334435033_Improving_plankton_image_classification_using_context_metadata","abstract":"Advances in both hardware and software are enabling rapid proliferation of in situ plankton imaging methods, requiring more effective machine learning approaches to image classification. Deep Learning methods, such as convolutional neural networks (CNNs), show marked improvement over traditional feature‐based supervised machine learning algorithms, but require careful optimization of hyperparameters and adequate training sets. Here, we document some best practices in applying CNNs to zooplankton and marine snow images and note where our results differ from contemporary Deep Learning findings in other domains. We boost the performance of CNN classifiers by incorporating metadata of different types and illustrate how to assimilate metadata beyond simple concatenation. We utilize both geotemporal (e.g., sample depth, location, time of day) and hydrographic (e.g., temperature, salinity, chlorophyll a) metadata and show that either type by itself, or both combined, can substantially reduce error rates. Incorporation of context metadata also boosts performance of the feature‐based classifiers we evaluated: Random Forest, Extremely Randomized Trees, Gradient Boosted Classifier, Support Vector Machines, and Multilayer Perceptron. For our assessments, we use an original data set of 350,000 in situ images (roughly 50% marine snow and 50% non‐snow sorted into 26 categories) from a novel in situ Zooglider. We document asymptotically increasing performance with more computationally intensive techniques, such as substantially deeper networks and artificially augmented data sets. Our best model achieves 92.3% accuracy with our 27‐class data set. We provide guidance for further refinements that are likely to provide additional gains in classifier accuracy.","authors":["Jeffrey S. Ellen","Casey Andrew Graff","Mark D. Ohman"],"meta":["July 2019Limnology and Oceanography, Methods 17(8)","DOI:10.1002/lom3.10324"],"references":["330028642_Zooglider_An_autonomous_vehicle_for_optical_and_acoustic_sensing_of_zooplankton","326917865_CCE_IV_El_Nino-related_zooplankton_variability_in_the_southern_California_Current_System","322107811_Automatic_plankton_image_classification_combining_multiple_view_features_via_multiple_kernel_learning","321217141_Deep_Learning_on_Underwater_Marine_Object_Detection_A_Survey","328574033_Automated_plankton_image_analysis_using_convolutional_neural_networks","324055141_A_disciplined_approach_to_neural_network_hyper-parameters_Part_1_--_learning_rate_batch_size_momentum_and_weight_decay","322276713_The_openCV_library","320627198_Dynamic_Routing_Between_Capsules","319770360_Deeply-Supervised_Nets","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition"]}