{"id":"334489669_Deep_Learning_With_Edge_Computing_A_Review","abstract":"Deep learning is currently widely used in a variety of applications, including computer vision and natural language processing. End devices, such as smartphones and Internet-of-Things sensors, are generating data that need to be analyzed in real time using deep learning or used to train deep learning models. However, deep learning inference and training require substantial computation resources to run quickly. Edge computing, where a fine mesh of compute nodes are placed close to end devices, is a viable way to meet the high computation and low-latency requirements of deep learning on edge devices and also provides additional benefits in terms of privacy, bandwidth efficiency, and scalability. This paper aims to provide a comprehensive review of the current state of the art at the intersection of deep learning and edge computing. Specifically, it will provide an overview of applications where deep learning is used at the network edge, discuss various approaches for quickly executing deep learning inference across a combination of end devices, edge servers, and the cloud, and describe the methods for training deep learning models across multiple edge devices. It will also discuss open challenges in terms of systems performance, network technologies and management, benchmarks, and privacy. The reader will take away the following concepts from this paper: understanding scenarios where deep learning at the network edge can be useful, understanding common techniques for speeding up deep learning inference and performing distributed training on edge devices, and understanding recent trends and opportunities.","authors":["Jiasi Chen","Xukan Ran"],"meta":["July 2019Proceedings of the IEEE PP(99):1-20","DOI:10.1109/JPROC.2019.2921977"],"references":["334979468_Edge_Assisted_Real-time_Object_Detection_for_Mobile_Augmented_Reality","332662655_Distributed_Deep_Learning_at_the_Edge_A_Novel_Proactive_and_Cooperative_Caching_Framework_for_Mobile_Edge_Networks","328375281_DeepDecision_A_Mobile_Deep_Learning_Framework_for_Edge_Video_Analytics","338510249_MnasNet_Platform-Aware_Neural_Architecture_Search_for_Mobile","329750425_Gaze_Prediction_in_Dynamic_360_Immersive_Videos","329651674_A_Network-Centric_HardwareAlgorithm_Co-Design_to_Accelerate_Distributed_Training_of_Deep_Neural_Networks","329562018_Learning_from_Differentially_Private_Neural_Activations_with_Edge_Computing","329560144_VideoEdge_Processing_Camera_Streams_using_Hierarchical_Clusters","328775401_Enabling_deep_learning_at_the_IoT_edge","328327800_DeepThings_Distributed_Adaptive_Deep_Learning_Inference_on_Resource-Constrained_IoT_Edge_Clusters"]}