{"id":"334492830_Understanding_openness_through_invisible_platform_boundaries_a_topological_study_on_MOOCs_as_multiplexes_of_spaces_and_times","abstract":"Among new technologies in education, the Massive Open Online Course (MOOC) is one of the phenomena that received much attention. However, controversy developed around the meaning of the word ‘open’ as integrated in the acronym. Despite the disagreements, studies on MOOCs generally do not formulate clear conceptual or\noperational descriptions of what openness implies for their research. Without explicating these descriptions, it becomes impossible for HE practitioners and researchers to gain a sense of how the proclaimed open nature of MOOCs is and can be realized in practice. This study aims to respond to this debate and the prevailing ambiguity and confusion around the concept ‘openness’ by examining the relevance of an alternative view. That is, through the lens of social topology, this study considers how openness is enacted in multiple forms that interact. The study further examines whether and how openness is\nperformed through the specific way in which boundaries operate. Based on an empirical case study on a MOOC platform developed and administered by several European universities, the study presents a combination of descriptions, sketches and legends that describe multiple spaces and times of openness in the MOOC platform. The study therewith provides strong arguments for the pertinence of this alternative view, and invites further research on higher education initiatives to examine the various yet specific ways openness can be established.","authors":["Karmijn van de Oudeweetering","Mathias Decuypere"],"meta":["December 2019","DOI:10.1186/s41239-019-0154-1","Projects: Open Education: A critical-qualitative studySocial topology in educational research."],"references":["329667422_Opening_up_design_studio_education_using_blended_and_networked_formats","329367366_Open_Education_platforms_Theoretical_ideas_digital_operations_and_the_figure_of_the_open_learner","324700100_Mapping_the_open_education_landscape_citation_network_analysis_of_historical_open_and_distance_education_research","323641324_The_hidden_architecture_of_higher_education_building_a_big_data_infrastructure_for_the_'smarter_university'","323467127_When_inclusion_excludes_a_counter_narrative_of_open_online_education","321818466_Democratizing_education_at_the_margins_faculty_and_practitioner_perspectives_on_delivering_online_tertiary_education_for_refugees","320929933_Towards_a_topological_re-assemblage_of_education_policy_Observing_the_implementation_of_performance_data_infrastructures_and_'centers_of_calculation'_in_Germany","316940971_Polymorphic_borders","320365645_The_digital_university_and_the_shifting_time-space_of_the_campus","319484460_The_Condition_of_Postmodernity_An_Enquiry_Into_the_Origins_of_Cultural_Change"]}