{"id":"334480974_ILSA_-_AN_INTEGRATED_LEARNING_STYLES_ANALYTICS_SYSTEM","abstract":"Various types of learners can be observed in today's e-learning environments. Using some of the existing models for the learner type classification, like the Felder-Silverman Learning Styles Model (FSLSM), we can identify learners' preferences and needs and use them to adjust the environment. On the other hand, Learning Analytics can offer insights on a student's engagement and behavior, by tracking their actions and performance. We can correlate this data with the data on learners' type, and use it for deeper user modeling. Supported by visualizations on learning styles and learning behavior, students and instructors can reflect the learning process. Based on our previously published conceptual model for linking learning analytics and learning styles in e-learning environments, we present an Integrated Learning Styles Analytics system (ILSA), which supports the identification of learning styles as well as analysis and visualization of activity data in the Moodle LMS. ILSA consists of a questionnaire for learning style identification derived from FSLSM and offers immediate results to its participants. Next, by utilizing various data sources in Moodle, e.g. log data or the grade book, we are able to correlate a user's activity and performance with their learning styles. This work offers details on the finalized concept as well as its implementation. By providing insights on data sources in Moodle and presenting various visualizations, this work allows teachers to reuse the system in their e-learning courses.","authors":["Nadja Zaric","Sven Judel","René Röpke","Ulrik Schroeder"],"meta":["July 2019","DOI:10.21125/edulearn.2019.0770","Conference: The international conference on education and new learning technologiesAt: Palma de Mallorca (Spain). 1st - 3rd of July, 2019.","Project: Gamification in personalized e-learning"],"references":["330810514_Model_detecting_learning_styles_with_artificial_neural_network","291012693_Towards_adaptive_open_learning_environments_Evaluating_the_precision_of_identifying_learning_styles_by_tracking_learners'_behaviours","233600402_Learning_Styles_Concepts_and_Evidence","220606588_Adaptive_course_generation_through_learning_styles_representation","216852758_Using_Bayesian_Networks_to_Detect_Students'_Learning_Styles_in_a_Web-based_education_system","28579427_Learning_Styles_An_overview_of_theories_models_and_measures","301232345_Teaching_and_Learning_STEM_A_Practical_Guide","237753239_In-Depth_Analysis_of_the_Felder-Silverman_Learning_Style_Dimensions","223191504_Automatic_detection_of_learning_styles_for_an_e-learning_system","4352489_Identifying_Learning_Styles_in_Learning_Management_Systems_by_Using_Indications_from_Students'_Behaviour"]}