{"id":"334472929_Nonrenewal_resetting_of_scaled_Brownian_motion","abstract":"We investigate an intermittent stochastic process in which diffusive motion with a time-dependent diffusion coefficient, D(t)∼tα−1, α>0 (scaled Brownian motion), is stochastically reset to its initial position and starts anew. The resetting follows a renewal process with either an exponential or a power-law distribution of the waiting times between successive renewals. The resetting events, however, do not affect the time dependence of the diffusion coefficient, so that the whole process appears to be a nonrenewal one. We discuss the mean squared displacement of a particle and the probability density function of its positions in this process. We show that scaled Brownian motion with resetting demonstrates rich behavior whose properties essentially depend on the interplay of the parameters of the resetting process and the particle's displacement infree motion. The motion of particles can remain almost unaffected by resetting but can also get slowed down or even be completely suppressed. Especially interesting are the nonstationary situations in which the mean squared displacement stagnates but the distribution of positions does not tend to any steady state. This behavior is compared to the situation [discussed in the companion paper; A. S. Bodrova et al., Phys. Rev. E 100, 012120 (2019)] in which the memory of the value of the diffusion coefficient at a resetting time is erased, so that the whole process is a fully renewal one. We show that the properties of the probability densities in such processes (erasing or retaining the memory on the diffusion coefficient) are vastly different.","authors":["Anna Bodrova","Aleksei Chechkin","Igor M. Sokolov"],"meta":["July 2019PHYSICAL REVIEW E 100(1)","DOI:10.1103/PhysRevE.100.012119"],"references":["331556046_Fractional_Prabhakar_Derivative_in_Diffusion_Equation_with_Non-Static_Stochastic_Resetting","329525576_First_passage_under_stochastic_resetting_in_an_interval","326621597_First_Passage_under_Restart_with_Branching","346624760_First_Steps_in_Random_Walks_From_Tools_to_Applications","344896934_Kinetic_Theory_of_Granular_Gases","334476224_Scaled_Brownian_motion_with_renewal_resetting","332914710_Peclet_number_governs_transition_to_acceleratory_restart_in_drift-diffusion","327448310_Spectral_content_of_fractional_Brownian_motion_with_stochastic_reset","323506294_Branching_Search","318393180_Continuous-time_random_walk_under_time-dependent_resetting"]}