{"id":"334411956_A_spatial-temporal_statistical_analysis_of_health_seasonality_explaining_HFMD_infections_within_a_children_population_along_the_Vietnamese_south_central_coast","abstract":"Background: \nVarious neglected tropical diseases show spatially changing seasonality at small areas. This phenomenon has received little scientific attention so far. Our study contributes to advancing the understanding of its drivers. This study focuses on the effects of the seasonality of increasing social contacts on the incidence proportions at multiple district level of the childhood hand-foot-mouth disease in Da Nang city, Viet Nam from 2012 to 2016.\n\nMethods: \nWe decomposed the nonstationary time series of the incidence proportions for the nine spatial-temporal (S-T) strata in the study area, where S indicates the spatial and T the temporal stratum. The long-term trends and the seasonality are presented by the Fourier series. To study the effects of the monthly average ambient temperature and the period of preschooling, we developed a spatial-temporal autoregressive model.\n\nResults: \nSeasonality of childhood hand-foot-mouth disease incidence proportions shows two peaks in all spatial strata annually: large peaks synchronously in April and small ones asynchronously during the preschooling period. The peaks of the average temperature are asynchronous with the seasonal peaks of the childhood hand-foot-mouth disease incidence proportions in the period between January and May, with the negative values of the regression coefficients for all spatial strata, respectively: [Formula: see text]. The increasingly cumulative preschooling period and the seasonal component of the incidence proportions are negatively correlated in the period between August and December, with the negative values of the regression coefficients for all temporal strata, respectively: [Formula: see text].\n\nConclusions: \nThe study shows that social contact amongst children under five years of age is the important driving factor of the dynamics of the childhood hand-foot-mouth disease outbreaks in the study area. The preschooling season when children's contact with each other increases stimulates the geographical variation of the seasonality of childhood hand-foot-mouth disease infections at small areas in the study area.","authors":["Phuong Truong","Thuong Vu Nguyen","Thao Thi Thanh Nguyen","Alfred Stein"],"meta":["July 2019BMC Public Health 19(1)","DOI:10.1186/s12889-019-7281-4"],"references":["320413776_Evolution_and_Spatiotemporal_Dynamics_of_Enterovirus_A71_Subgenogroups_in_Vietnam","319301504_Spatiotemporal_variation_of_hand-foot-mouth_disease_in_relation_to_socioecological_factors_A_multiple-province_analysis_in_Vietnam","316770120_Assessing_local_risk_factors_of_Beijing_Hand-Foot-_Mouth_Disease_in_China","316595709_Modelling_seasonal_and_spatio-temporal_variation_in_respiratory_prescribing","303904503_Effect_of_Climatic_Factors_on_Hand_Foot_and_Mouth_Disease_in_South_Korea_2010-2013","329431808_Spatiotemporal_decomposition_and_risk_determinants_of_hand_foot_and_mouth_disease_in_Henan_China","324408357_Time_Series_A_Biostatistical_Introduction","321619568_Advances_in_Statistical_Methods_for_the_Health_Sciences_Applications_to_Cancer_and_AIDS_Studies_Genome_Sequence_Analysis_and_Survival_Analysis","313611495_Modelling_seasonal_and_spatio-temporal_variation_in_respiratory_prescribing_the_example_of_respiratory_prescribing","303807338_The_Epidemiology_of_Hand_Foot_and_Mouth_Disease_in_Asia_A_Systematic_Review_and_Analysis"]}