{"id":"334463940_Automated_cell_boundary_and_3D_nuclear_segmentation_of_cells_in_suspension","abstract":"To characterize cell types, cellular functions and intracellular processes, an understanding of the differences between individual cells is required. Although microscopy approaches have made tremendous progress in imaging cells in different contexts, the analysis of these imaging data sets is a long-standing, unsolved problem. The few robust cell segmentation approaches that exist often rely on multiple cellular markers and complex time-consuming image analysis. Recently developed deep learning approaches can address some of these challenges, but they require tremendous amounts of data and well-curated reference data sets for algorithm training. We propose an alternative experimental and computational approach, called CellDissect, in which we first optimize specimen preparation and data acquisition prior to image processing to generate high quality images that are easier to analyze computationally. By focusing on fixed suspension and dissociated adherent cells, CellDissect relies only on widefield images to identify cell boundaries and nuclear staining to automatically segment cells in two dimensions and nuclei in three dimensions. This segmentation can be performed on a desktop computer or a computing cluster for higher throughput. We compare and evaluate the accuracy of different nuclear segmentation approaches against manual expert cell segmentation for different cell lines acquired with different imaging modalities.","authors":["Benjamin Kesler","Guoliang Li","Alexander Thiemicke","Rohit Venkat"],"meta":["July 2019Scientific Reports 9(1):10237","DOI:10.1038/s41598-019-46689-5"],"references":["329716031_U-Net_deep_learning_for_cell_counting_detection_and_morphometry","327702269_Label-free_prediction_of_three-dimensional_fluorescence_images_from_transmitted-light_microscopy","326333477_Highly_multiplexed_immunofluorescence_imaging_of_human_tissues_and_tumors_using_t-CyCIF_and_conventional_optical_microscopes","326164238_CellProfiler_30_Next-generation_image_processing_for_biology","326076180_Distribution_shapes_govern_the_discovery_of_predictive_models_for_gene_regulation","321833294_Akt_regulation_of_glycolysis_mediates_bioenergetic_stability_in_epithelial_cells","319414341_Data-analysis_strategies_for_image-based_cell_profiling","331137295_Cytokine-mediated_communication_a_quantitative_appraisal_of_immune_complexity","329294009_A_Systems-Level_Study_Reveals_Regulators_of_Membrane-less_Organelles_in_Human_Cells","324488106_In_Silico_Labeling_Predicting_Fluorescent_Labels_in_Unlabeled_Images"]}