{"id":"334489755_Comparison_of_Feature_Selection_Methods_and_Machine_Learning_Classifiers_for_Radiomics_Analysis_in_Glioma_Grading","abstract":"Radiomics-based researches have shown predictive abilities with machine-learning approaches. However, it is still unknown whether different radiomics strategies affects the prediction performance. The aim of this study was to compare the prediction performance of frequently utilized radiomics feature selection and classification methods in glioma grading. Quantitative radiomics features were extracted from tumor regions in 210 Glioblastoma (GBM) and 75 low-grade glioma (LGG) MRI subjects. Then the diagnostic performance of sixteen feature selection and fifteen classification methods were evaluated by using two different test modes: ten-fold cross-validation and percentage split. Balanced accuracy and area under the curve (AUC) of receiver operating characteristic were used to evaluate prediction performance. In addition, the roles of the number of selected features, feature type, MRI modality and tumor sub-region were compared to optimize the radiomics-based prediction. The results indicated that the combination of feature selection method L1-based linear support vector machine (L1-SVM) and classifier multi-layer perceptron (MLPC) achieved the best performance in differentiation of GBM and LGG in both ten-fold cross validation (balanced accuracy:0.944, AUC:0.986) and percentage split (balanced accuracy:0.953, AUC:0.981). For radiomics feature extraction, the enhancing tumor region (ET) combined with necrotic and non-enhancing tumor (NCR/NET) regions in T1 post-contrast (T1-Gd) modality provided more considerable tumor-related phenotypes than other combinations of tumor region and MRI modality. Our comparative investigation indicated that both feature selection methods and machine learning classifiers affected the predictive performance in glioma grading. Also, the cross-combination strategy for comparison of radiomics feature selection and classification methods provided a way of searching optimal machine learning model for future radiomics-based prediction.","authors":["Sun Pan","Defeng Wang","Vincent CT Mok","Lin Shi"],"meta":["July 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2928975"],"references":["332567272_Imaging_biomarker_analysis_of_advanced_multiparametric_MRI_for_glioma_grading","330362336_MRI_as_a_diagnostic_biomarker_for_differentiating_primary_central_nervous_system_lymphoma_from_glioblastoma_A_systematic_review_and_meta-analysis","329127594_Classification_of_the_glioma_grading_using_radiomics_analysis","330442950_Development_and_Validation_of_a_MRI-Based_Radiomics_Prognostic_Classifier_in_Patients_with_Primary_Glioblastoma_Multiforme","329002222_Comparison_of_Radiomics_Models_Built_Through_Machine_Learning_in_a_Multicentric_Context_With_Independent_Testing_Identical_Data_Similar_Algorithms_Different_Methodologies","328349083_State_of_the_Art_Machine_Learning_Applications_in_Glioma_Imaging","328256304_Radiomics_based_on_multicontrast_MRI_can_precisely_differentiate_among_glioma_subtypes_and_predict_tumour-proliferative_behaviour","328036153_Comparison_of_radiomics_machine-learning_classifiers_and_feature_selection_for_differentiation_of_sacral_chordoma_and_sacral_giant_cell_tumour_based_on_3D_computed_tomography_features","327538610_Radiomics_Nomogram_Building_From_Multiparametric_MRI_to_Predict_Grade_in_Patients_With_Glioma_A_Cohort_Study_Accurate_Classification_of_Gliomas","327538387_Noninvasive_Prediction_of_IDH1_Mutation_and_ATRX_Expression_Loss_in_Low-Grade_Gliomas_Using_Multiparametric_MR_Radiomic_Features_MRI_Radiomics_of_IDH1_and_ATRX_in_LGG"]}