{"id":"334575261_Student-centred_digital_game-based_learning_a_conceptual_framework_and_survey_of_the_state_of_the_art","abstract":"Student-centred learning forms a major driver behind educational policy and practice in the modern day. With a drive towards embracing the possibilities of technology within the classroom, especially digital video games, it is vital to have an understanding of where such games are delivering and where their potential has yet to be explored. With this in mind, it is important to survey the existing literature to establish the level to which the promise of student-centred learning is being delivered through digital video games. This study presents a conceptual framework based upon a systematic literature review of developments in student-centred digital game–based learning, and seeks to establish the extent to which all tenets of student-centred learning and principles of digital game–based learning are embraced within such applications. A thematic analysis identifies the common themes of game and intervention design while integrating and conceptually linking the key concepts of student-centred learning and digital game–based learning. This leads to the development of a conceptual framework allowing classification of the literature according to common themes. Inclusion criteria include the presence of student-centred learning concepts, with a game-based focus including specifically digital video games. Inclusion was limited to papers published since 2007. The literature analysis identifies a number of themes; these were primarily the types of player engagement: single player, mixed and multiplayer, along with principles of game design and the key tenets of student-centred learning. A preponderance of games and interventions utilising single player experiences and focusing on implementing the active learning tenet of student-centred learning were observed. Areas relating to multiplayer engagements and the social aspects of student-centred learning such as mutual respect receive comparatively less attention in games and research. In order to fully embrace the possibilities offered by student-centred digital game–based learning, it is important not to neglect lessons learned in the development of student-centred learning to its current state. Aspects such as peer-based learning and building relationships between students and teachers have been found important in traditional learning and must be investigated and adapted to new media, including games, as new technologies enter the educational mainstream. Further research into the effects of designing games around these multiplayer aspects, and better defining the role of teachers and educational staff in digital game–based learning, may demonstrate ways to develop and create educational experiences that better engage and prepare students.","authors":["Thomas E. Coleman","Arthur G. Money"],"meta":["March 2020Higher Education 79(4)","DOI:10.1007/s10734-019-00417-0"],"references":["326218886_A_comparison_of_two_methods_of_using_a_serious_game_for_teaching_marine_ecology_in_a_university_setting","321206977_Student_attitudes_to_games-based_skills_development_Learning_from_video_games_in_higher_education","304662570_Student-centered_Education_and_Constructivism_Challenges_Concerns_and_Clarity_for_Teachers","325608666_Effects_of_flipped_classrooms_integrated_with_MOOCs_and_game-based_learning_on_the_learning_motivation_and_outcomes_of_students_from_different_backgrounds","322343266_MEEGA_Systematic_Model_to_Evaluate_Educational_Games","322271505_Effects_of_visual_map_embedded_approach_on_students_learning_performance_using_Briggs-Myers_learning_style_in_word_puzzle_gaming_course","317393310_A_microworld-based_role-playing_game_development_approach_to_engaging_students_in_interactive_enjoyable_and_effective_mathematics_learning","313941284_Building_Bridges_Between_Technology_and_Content_Literacy_in_Special_Education_Lessons_Learned_From_Special_Educators'_Use_of_Integrated_Technology_and_Perceived_Benefits_for_Students","311760964_Gamification_of_Apollo_Lunar_Exploration_Missions_for_Learning_Engagement","310788861_Computer_game-based_mathematics_education_Embedded_faded_worked_examples_facilitate_knowledge_acquisition"]}