{"id":"334590831_Educational_data_mining_for_students'_performance_based_on_fuzzy_C-means_clustering","abstract":"Education greatly aids in the process of students’ growth; therefore, education institutions try to provide high quality education to their students. A possible remedy to provide higher quality education is by discovering knowledge from educational data. However, accurately evaluate students' performance is very challenging due to different sources and structures of educational data. In addition, different teaching strategies are needed because students' learning ability are different. One way to discover the hidden knowledge from educational data is the use of clustering algorithms, which are capable of mining interesting patterns from educational data. Thus, this paper presents a fuzzy C-means clustering algorithm using 2D and 3D clustering to evaluate students' performance based on their examination results (the examination grades from College of Computer Science and Technology, Huaqiao University for students enrolled in year 2014). Based on the experimental results from 2D and 3D clustering for evaluating students' performance, the educators can better understand the students' performance so as to build a pedagogical basis for decisions. Students can also receive some recommendations from the mining results about their performance.","authors":["Yu Li","Jin Gou","Zongwen Fan"],"meta":["July 2019The Journal of Engineering 2019(11)","DOI:10.1049/joe.2019.0938"],"references":["312509093_A_Systematic_Review_on_Educational_Data_Mining","311904361_An_improved_FCM_algorithm_with_adaptive_weights_based_on_SA-PSO","309267845_Improved_clustering_algorithms_for_target_tracking_in_wireless_sensor_networks","304293217_Educational_Data_Mining_techniques_and_their_applications","345657327_Education_Social_Status_and_Health","333009796_A_two-layer_Wang-Mendel_fuzzy_approach_for_predicting_the_residuary_resistance_of_sailing_yachts","327655571_Advantages_of_fuzzy_k-means_over_k-means_clustering_in_the_classification_of_diffuse_reflectance_soil_spectra_A_case_study_with_West_African_soils","325765840_Understanding_the_Education_Philosophy_and_Its_Implications","322838668_New_Incremental_Learning_Algorithm_With_Support_Vector_Machines","322780897_Investigating_the_effects_of_varying_cluster_numbers_on_anomalies_detected_in_mining_machines"]}