{"id":"334532344_An_Effective_Confidence-Based_Early_Classification_of_Time_Series","abstract":"Early classification of time series aims to predict the class value of a sequence accurately as early as possible, not wait for the full-length data, which is significant in many time-sensitive applications and has attracted great interest in recent years. For instance, early diagnosis can help patients get early treatment and even save their lives. The problem of early classification is how to determine whether the collected data are sufficient to output the class value. Moreover, in practical applications, users also need to know the confidence (reliability) of the prediction results for more appropriate processing. For example, giving a healthy patient the possibility of suffering from some disease can assist physicians in an optimal therapy. However, existing work has not provided an effective measure to indicate how accurate the classification is. Therefore, in this paper, we propose an effective confidence-based early classification of time series. Firstly, based on a set of base time series classifiers trained at different timestamps, we propose a dynamic decision fusion method to measure the confidence of a predicted result by fusing the results of multiple base classifiers. Secondly, by analyzing the distribution of confidence values, we develop an adaptive learning method for the confidence threshold to simultaneously optimize the two conflicting objectives: accuracy and earliness. Finally, experimental results conducted on 45 equal-length datasets and 8 variable-length datasets clearly show that our proposed approach can achieve the superior in early classification compared to state-of-the-art approaches.","authors":["Junwei Lv","Hu Xuegang","Lei li","Peipei Li"],"meta":["July 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2929644"],"references":["332953709_Driving_Fatigue_Classification_Based_on_Fusion_Entropy_Analysis_Combining_EOG_and_EEG","332822262_Can_C-Reactive_Protein_CRP_Time_Series_Forecasting_be_Achieved_via_Deep_Learning","331474581_Deep_learning_for_time_series_classification_a_review","323382772_Generalized_Dynamic_Time_Warping_Unleashing_the_Warping_Power_Hidden_in_Point-Wise_Distances","319823791_Fast_and_Accurate_Time_Series_Classification_with_WEASEL","312945157_Fast_and_Accurate_Time_Series_Classification_with_WEASEL","310783335_The_great_time_series_classification_bake_off_a_review_and_experimental_evaluation_of_recent_algorithmic_advances","332882619_DTEC_Distance_Transformation_Based_Early_Time_Series_Classification","332445794_Early_classification_of_time_series_using_multi-objective_optimization_techniques","321176039_Early_Classification_of_Time_Series_by_Simultaneously_Optimizing_the_Accuracy_and_Earliness"]}