{"id":"334534036_Dynamic_traveling_salesman_problem_with_stochastic_release_dates","abstract":"The dynamic traveling salesman problem with stochastic release dates (DTSP-srd) is a problem in which a supplier has to deliver parcels to its customers. These parcels are delivered to its depot while the distribution is taking place. The arrival time of a parcel to the depot is called its release date. In the DTSP-srd, release dates are stochastic and dynamically updated as the distribution takes place. The objective of the problem is the minimization of the total time needed to serve all customers, given by the sum of the traveling time and the waiting time at the depot. The problem is represented as a Markov Decision Process and is solved through a reoptimization approach. Two models are proposed for the problem to be solved at each stage. The first model is stochastic and exploits the entire probabilistic information available for the release dates. The second model is deterministic and uses an estimation of the release dates. An instance generation procedure is proposed to simulate the evolution of the information to perform computational tests. The results show that a more frequent reoptimization provides better results across all tested instances and that the stochastic model performs better than the deterministic model. The main drawback of the stochastic model lies in the computational time required to evaluate a solution, which makes an iteration of the heuristic substantially more time-consuming than in the case where the deterministic model is used.","authors":["C. Archetti","Dominique Feillet","Andrea Mor","M.Grazia Speranza"],"meta":["August 2019European Journal of Operational Research 280(3)","DOI:10.1016/j.ejor.2019.07.062"],"references":["325182308_An_iterated_local_search_for_the_Traveling_Salesman_Problem_with_release_dates_and_completion_time_minimization","308962698_The_Dynamic_Dispatch_Waves_Problem_for_Same-Day_Delivery","278798156_The_Multi-Trip_Vehicle_Routing_Problem_with_Time_Windows_and_Release_Dates","257806098_Approximate_dynamic_programming_in_transportation_and_logistics_A_unified_framework","242933344_Time_Dependent_Vehicle_Routing_Problems_Formulations_Properties_and_Heuristic_Algorithms","311225126_50th_Anniversary_Invited_Article-Future_Research_Directions_in_Stochastic_Vehicle_Routing","303404602_The_One-Dimensional_Dynamic_Dispatch_Waves_Problem","287661759_An_effective_heuristic_algorithm_for_the_traveling_salesman_problem","280680581_Complexity_of_routing_problems_with_release_dates","226504764_Arriving_on_Time"]}