{"id":"334533554_A_Systematic_Survey_of_Computer-Aided_Diagnosis_in_Medicine_Past_and_Present_Developments","abstract":"Computer-aided diagnosis (CAD) in medicine is the result of a large amount of effort expended in the interface of medicine and computer science. As some CAD systems in medicine try to emulate the diagnostic decision-making process of medical experts, they can be considered as expert systems in medicine. Furthermore, CAD systems in medicine may process clinical data that can be complex and/or massive in size. They do so in order to infer new knowledge from data and use that knowledge to improve their diagnostic performance over time. Therefore, such systems can also be viewed as intelligent systems because they use a feedback mechanism to improve their performance over time. The main aim of the literature survey described in this paper is to provide a comprehensive overview of past and current CAD developments. This survey/review can be of significant value to researchers and professionals in medicine and computer science. There are already some reviews about specific aspects of CAD in medicine. However, this paper focuses on the entire spectrum of the capabilities of CAD systems in medicine. It also identifies the key developments that have led to today's state-of-the-art in this area. It presents an extensive and systematic literature review of CAD in medicine, based on 251 carefully selected publications. While medicine and computer science have advanced dramatically in recent years, each area has also become profoundly more complex. This paper advocates that in order to further develop and improve CAD, it is required to have well-coordinated work among researchers and professionals in these two constituent fields. Finally, this survey helps to highlight areas where there are opportunities to make significant new contributions. This may profoundly impact future research in medicine and in select areas of computer science.","authors":["Juri Yanase","Evangelos Triantaphyllou"],"meta":["July 2019Expert Systems with Applications 138:112821","DOI:10.1016/j.eswa.2019.112821","Project: Medical Decision Making.  Emphasis on computer-aided diagnosis (CAD)"],"references":["334109766_The_Seven_Key_Challenges_for_the_Future_of_Computer-Aided_Diagnosis_in_Medicine","329850815_Validation_of_Prediction_Models_for_Critical_Care_Outcomes_Using_Natural_Language_Processing_of_Electronic_Health_Record_Data","329051001_Automated_detection_of_imaging_features_of_disproportionately_enlarged_subarachnoid_space_hydrocephalus_using_machine_learning_methods","327098624_A_bibliometric_analysis_of_neutrosophic_set_two_decades_review_from_1998_to_2017","326219697_Medical_and_Biological_Image_Analysis","329680375_Dermatoscopy_in_clinical_practice_Beyond_pigmented_lesions","329297557_Multimodal_Image_Fusion_for_Cardiac_Resynchronization_Therapy_Planning_Applications_and_Computational_Techniques","328887117_Cardiac_sarcoidosis_classification_with_deep_convolutional_neural_network-based_features_using_polar_maps","327030899_The_Challenge_of_Regulating_Clinical_Decision_Support_Software_After_21_st_Century_Cures","324013916_EEG_signal_classification_using_universum_support_vector_machine","321441549_Medical_subdomain_classification_of_clinical_notes_using_a_machine_learning-based_natural_language_processing_approach","323774051_Breast_Cancer_Screening_Where_have_we_been_and_where_are_we_going_A_personal_perspective_based_on_history_data_and_experience","323659332_A_Hybrid_Metaheuristic_and_Kernel_Intuitionistic_Fuzzy_c-means_Algorithm_for_Cluster_Analysis","322911926_Machine_Learning_in_Medical_Imaging","322060396_Mask_R-CNN"]}