{"id":"334593565_Fighting_Opinion_Control_in_Social_Networks_via_Link_Recommendation","abstract":"The process of opinion formation is inherently a network process, with user opinions in a social network being driven to a certain average opinion. One simple and intuitive incarnation of this opinion attractor is the average of user opinions weighted by the users' eigenvector centralities. This value is a lucrative target for control, as altering it essentially changes the mass opinion in the network. Since any potentially malicious influence upon the opinion distribution in a society is undesirable, it is important to design methods to prevent external attacks upon it. In this work, we assume that the adversary aims to maliciously change the network's average opinion by altering the opinions of some unknown users. We, then, state an NP-hard problem of disabling such opinion control attempts via strategically altering the network's users' eigencentralities by recommending a limited number of links to the users. Relying on Markov chain theory, we provide perturbation analysis that shows how eigencentrality and, hence, our problem's objective change in response to a link's addition to the network. The latter leads to the design of a pseudo-linear-time heuristic, relying on efficient estimation of mean first passage times in Markov chains. We have confirmed our theoretical and algorithmic findings, and studied effectiveness and efficiency of our heuristic in experiments with synthetic and real networks.","authors":["Victor Amelkin","Ambuj K. Singh"],"meta":["August 2019","DOI:10.1145/3292500.3330960","Conference: 25'th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD)At: Anchorage, AK, US","Project: Analysis, Modeling, and Control of Dynamic Processes in Networks"],"references":["312976930_The_Computation_of_the_Mean_First_Passage_Times_for_Markov_Chains","323716019_Finite_Markov_Chains_and_their_Applications","304671002_On_the_eigen-functions_of_dynamic_graphs_Fast_tracking_and_attribution_algorithms_Eigen-Functions_of_Dynamic_Graphs","304288605_Controlling_Propagation_at_Group_Scale_on_Networks","303979989_Eigen-Optimization_on_Large_Graphs_by_Edge_Manipulation","300153094_MET_A_Fast_Algorithm_for_Minimizing_Propagation_in_Large_Graphs_with_Small_Eigen-Gaps","300153062_Cheetah_Fast_Graph_Kernel_Tracking_on_Dynamic_Graphs","291533002_Make_It_or_Break_It_Manipulating_Robustness_in_Large_Networks","283598027_Learning_to_discover_social_circles_in_ego_networks","283043208_A_Distance_Measure_for_the_Analysis_of_Polar_Opinion_Dynamics_in_Social_Networks"]}