{"id":"334593028_Can_Machines_Learn_to_Predict_Weather_Using_Deep_Learning_to_Predict_Gridded_500-hPa_Geopotential_Height_From_Historical_Weather_Data","abstract":"Abstract We develop elementary weather prediction models using deep convolutional neural networks (CNNs) trained on past weather data to forecast one or two fundamental meteorological fields on a Northern Hemisphere grid with no explicit knowledge about physical processes. At forecast lead times up to 3 days, CNNs trained to predict only 500‐hPa geopotential height easily outperform persistence, climatology, and the dynamics‐based barotropic vorticity model, but do not beat an operational full‐physics weather prediction model. These CNNs are capable of forecasting significant changes in the intensity of weather systems, which is notable because this is beyond the capability of the fundamental dynamical equation that relies solely on 500‐hPa data, the barotropic vorticity equation. Modest improvements to the CNN forecasts can be made by adding 700‐ to 300‐hPa thickness to the input data. Our best performing CNN does a good job of capturing the climatology and annual variability of 500‐hPa heights and is capable of forecasting realistic atmospheric states at lead times of 14 days. Although our simple models do not perform better than an operational weather model, machine learning warrants further exploration as a weather forecasting tool; in particular, the potential efficiency of CNNs might make them attractive for ensemble forecasting.","authors":["Jonathan A. Weyn","Dale R. Durran","Rich Caruana"],"meta":["August 2019Journal of Advances in Modeling Earth Systems 11(1)","DOI:10.1029/2019MS001705"],"references":["334375417_Weather_and_climate_forecasting_with_neural_networks_using_general_circulation_models_GCMs_with_different_complexity_as_a_study_ground","333769250_Deep_Learning_for_Spatially_Explicit_Prediction_of_Synoptic-Scale_Fronts","331500191_Weather_and_climate_forecasting_with_neural_networks_using_GCMs_with_different_complexity_as_study-ground","330408667_What_Is_the_Predictability_Limit_of_Midlatitude_Weather","328908453_Toward_Data-Driven_Weather_and_Climate_Forecasting_Approximating_a_Simple_General_Circulation_Model_With_Deep_Learning","328264084_Predicting_Weather_Forecast_Uncertainty_with_Machine_Learning","331755767_Exascale_Deep_Learning_for_Climate_Analytics","329952541_DeepDownscale_A_Deep_Learning_Strategy_for_High-Resolution_Weather_Forecast","329048068_Estimating_the_Intrinsic_Limit_of_Predictability_Using_a_Stochastic_Convection_Scheme","328085382_Neural_Networks_for_Postprocessing_Ensemble_Weather_Forecasts"]}