{"id":"334513217_Acoustical_Impact_of_Architectonics_and_Material_Features_in_the_Lifespan_of_Two_Monumental_Sacred_Structures","abstract":"Hagia Sophia and Süleymaniye Mosque, built in the 6th and 16th centuries, respectively, are the two major monuments of the İstanbul World Heritage Site. Within the context of this study, sound fields of these two sacred multi-domed monumental structures are analyzed with a focus on their architectonic and material attributes and applied alterations in basic restoration works. A comprehensive study is undertaken by a comparative analysis over acoustical field tests held in different years and over an extensive literature review on their material and architectural characteristics. Initially, the major features of Hagia Sophia and Süleymaniye Mosque are presented, and later, basic alterations in regard to function and materials are provided. The methodology includes the field tests carried both within the scope of this research as well as the published test results by other researchers. Acoustical simulations are utilized for comparison of unoccupied versus occupied conditions and also for discussion on original materials. The impact of historical plasters on the acoustics of domed spaces is highlighted. Common room acoustics parameters as of reverberation time and clarity are utilized in comparisons. The formation of multi-slope sound energy decay is discussed in light of different spiritual and acoustical needs expected from such monumental sacred spaces.","authors":["Zühre Sü"],"meta":["July 2019Acoustics 1(3):493-516","DOI:10.3390/acoustics1030028"],"references":["336116218_ASSESSMENT_OF_NON-EXPONENTIAL_SOUND_ENERGY_DECAYS_WITHIN_MULTI-DOMED_MONUMENTS_BY_NUMERICAL_AND_EXPERIMENTAL_METHODS","275367409_A_Discussion_on_the_Acoustics_of_Suleymaniye_Mosque_for_its_Original_State","332773415_Diffusion_equation_modeling_for_sound_energy_flow_analysis_in_multi_domain_structures","326266397_On_the_assessment_of_the_multiplicity_of_spaces_in_the_acoustic_environment_of_cathedrals_The_case_of_the_cathedral_of_Seville","326266277_Virtual_acoustic_environment_reconstruction_of_the_hypostyle_mosque_of_Cordoba","325978163_Assessment_of_Acoustical_Indicators_in_Multi-domed_Historic_Structures_by_Non-exponential_Energy_Decay_Analysis","316004580_Diffusion_Equation_Based_Finite_Element_Modeling_of_a_Monumental_Worship_Space","305364337_Investigations_on_sound_energy_decays_and_flows_in_a_monumental_mosque","296787111_The_suleymaniye_complex_In_Istanbul_An_interpretation","274798689_Hagia_Sophia_From_the_Age_of_Justinian_to_the_Present"]}