{"id":"334547811_CSTeller_forecasting_scientific_collaboration_sustainability_based_on_extreme_gradient_boosting","abstract":"The mechanism why two strange scholars become collaborators has been extensively studied from the perspective of social network analysis. In academia, two scholars may collaborate with each other more than once, which means that scientific collaboration is to some extent sustainable. However, less research has been done to explore the sustainability of scientific collaboration. In this paper, we examine to what extent the collaboration sustainability can be predicted. For this purpose, an extreme gradient boosting-based collaboration sustainability prediction model named CSTeller is devised. We propose to analyze the sustainability of scientific collaboration from the perspectives of collaboration duration and collaboration times. We investigate factors that may affect collaboration sustainability based on scholars’ local properties and network properties. These factors are adopted as input features of CSTeller. Extensive experiments on two real scholarly datasets demonstrate the effectiveness of our proposed model. To the best of our knowledge, this is the first attempt to explore scientific collaboration mechanism from the perspective of sustainability. Our work may shed light on scientific collaboration analysis and benefit many practical issues such as collaborator recommendation since a scientific collaboration is not a one-shot deal.","authors":["Wei Wang","Bo Xu","Jiaying Liu","Zixin Cui"],"meta":["November 2019World Wide Web 22(8)","DOI:10.1007/s11280-019-00703-y"],"references":["324787467_VOPRec_Vector_Representation_Learning_of_Papers_with_Text_Information_and_Structural_Identity_for_Recommendation","319914801_Understanding_scientific_collaboration_Homophily_transitivity_and_preferential_attachment","318657698_From_triadic_closure_to_conference_closure_the_role_of_academic_conferences_in_promoting_scientific_collaborations","312178100_Big_Scholarly_Data_A_Survey","311990270_Encoding_Temporal_Information_for_Time-Aware_Link_Prediction","322410495_Is_Scientific_Collaboration_Sustainability_Predictable","320595264_Understanding_persistent_scientific_collaboration_JOURNAL_OF_THE_ASSOCIATION_FOR_INFORMATION_SCIENCE_AND_TECHNOLOGY","316061824_Self-adapted_mixture_distance_measure_for_clustering_uncertain_data","312970191_Scientific_collaboration_networks","310824798_XGBoost_A_Scalable_Tree_Boosting_System"]}