{"id":"334501221_Fault_Diagnosis_Method_Based_on_Principal_Component_Analysis_and_Broad_Learning_System","abstract":"Traditional feature extraction methods are used to extract the features of signal to construct the fault feature matrix, which exists the complex structure, higher correlation and redundancy. This will increase the complex fault classification and seriously affect the accuracy and efficiency of fault identification. In order to solve these problems, a new fault diagnosis (PABSFD) method based on principal component analysis (PCA) and broad learning system (BLS) is proposed for rotor system in this paper. In the proposed PABSFD method, the PCA with revealing the signal essence is used to reduce the dimension of the constructed feature matrix and decrease linear feature correlation between data, and eliminate redundant attributes in order to obtain the low-dimensional feature matrix with retaining the essential features for classification model. Then the BLS with low time complexity and high classification accuracy is regarded as a classification model to realize the fault identification, it can efficiently accomplish the fault classification of rotor system. Finally, the actual vibration data of rotor system is selected to test and verify the effectiveness of the PABSFD method. The experiment results show that the PCA method can effectively eliminate the feature correlation and realize the dimension reduction of feature matrix, the BLS can takes on better adaptability, faster computation speed and higher classification accuracy, and the PABSFD method can efficiently and accurately obtain the fault diagnosis results.","authors":["Huimin Zhao","Jianjie Zheng","Junjie Xu","Wu Deng"],"meta":["July 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2929094"],"references":["332174771_An_Efficient_Chaotic_Mutative_Moth-flame-inspired_Optimizer_for_Global_Optimization_Tasks","332075179_Image_Encryption_Based_on_Pixel-Level_Diffusion_with_Dynamic_Filtering_and_DNA-Level_Permutation_with_3D_Latin_Cubes","331979635_Activity_Feature_Solving_Based_on_TF-IDF_for_Activity_Recognition_in_Smart_Homes","344965668_Study_on_Threshold_Selection_Methods_in_Calculation_of_Ocean_Environmental_Design_Parameters","344962667_A_Semi-Quantitative_Information_Based_Fault_Diagnosis_Method_for_the_Running_Gears_System_of_High-Speed_Trains","332628921_Timely_Daily_Activity_Recognition_from_Headmost_Sensor_Events","332584703_Intelligent_decision-making_of_online_shopping_behavior_based_on_internet_of_things","332384815_Enhanced_Moth-flame_Optimizer_with_Mutation_Strategy_for_Global_Optimization","332061708_Tacholess_Speed_Estimation_in_Order_Tracking_A_Review_With_Application_to_Rotating_Machine_Fault_Diagnosis","331967691_Universal_Approximation_Capability_of_Broad_Learning_System_and_Its_Structural_Variations"]}