{"id":"334576216_Network-Oriented_Modeling_for_Adaptive_Networks_Designing_Higher-Order_Adaptive_Biological_Mental_and_Social_Network_Models","abstract":"This book addresses the challenging topic of modeling adaptive networks, which often have inherently complex behaviour. Networks by themselves usually can be modeled using a neat, declarative and conceptually transparent Network-Oriented Modeling approach. For adaptive networks changing the network’s structure, it is different; often separate procedural specifications are added for the adaptation process. This leaves you with a less transparent, hybrid specification, part of which often is more at a programming level than at a modeling level. This book presents an overall Network-Oriented Modeling approach by which designing adaptive network models becomes much easier, as also the adaptation process is modeled in a neat, declarative and conceptually transparent network-oriented manner, like the network itself. Due to this dedicated overall Network-Oriented Modeling approach, no procedural, algorithmic or programming skills are needed to design complex adaptive network models. \n\nA dedicated software environment is available to run these adaptive network models from their high-level specifications. Moreover, as adaptive networks are described in a network format as well, the approach can simply be applied iteratively, so that higher-order adaptive networks in which network adaptation itself is adaptive too, can be modeled just as easily; for example, this can be applied to model metaplasticity from Cognitive Neuroscience. The usefulness of this approach is illustrated in the book by many examples of complex (higher-order) adaptive network models for a wide variety of biological, mental and social processes.\n\nThe book has been written with multidisciplinary Master and Ph.D. students in mind without assuming much prior knowledge, although also some elementary mathematical analysis is not completely avoided. The detailed presentation makes that it can be used as an introduction in Network-Oriented Modelling for adaptive networks. Sometimes overlap between chapters can be found in order to make it easier to read each chapter separately. In each of the chapters, in the Discussion section, specific publications and authors are indicated that relate to the material presented in the chapter. The specific mathematical details concerning difference and differential equations have been concentrated in Chapters 10 to 15 in Part IV and Part V, which easily can be skipped if desired. For a modeler who just wants to use this modeling approach, Chapters 1 to 9 provide a good introduction.\n\nThe material in this book is being used in teaching undergraduate and graduate students with a multidisciplinary background or interest. Lecturers can contact me for additional material such as slides, assignments, and software. Videos of lectures for many of the chapters can be found at https://www.youtube.com/watch?v=8Nqp_dEIipU&list=PLF-Ldc28P1zUjk49iRnXYk4R-Jm4lkv2b.","authors":["Jan Treur"],"meta":["January 2020","DOI:10.1007/978-3-030-31445-3","Publisher: Springer Publishers, 2020, downloadable from https://doi.org/10.1007/978-3-030-31445-3ISBN: Print ISBN 978-3-030-31444-6 Online ISBN 978-3-030-31445-3","Projects: Behaviour Dynamics in Social NetworksMathematical Analysis of Emergent Network Behaviour in Relation to the Network's StructureSelf-Modeling Networks and their Applications"],"references":[]}