{"id":"334562325_Forecasting_remaining_useful_life_Interpretable_deep_learning_approach_via_variational_Bayesian_inferences","abstract":"Predicting the remaining useful life of machinery, infrastructure, or other equipment can facilitate preemptive maintenance decisions, whereby a failure is prevented through timely repair or replacement. This allows for a better decision support by considering the anticipated time-to-failure and thus promises to reduce costs. Here a common baseline may be derived by fitting a probability density function to past lifetimes and then utilizing the (conditional) expected remaining useful life as a prognostic. This approach finds widespread use in practice because of its high explanatory power. A more accurate alternative is promised by machine learning, where forecasts incorporate deterioration processes and environmental variables through sensor data. However, machine learning largely functions as a black-box method and its forecasts thus forfeit most of the desired interpretability. As our primary contribution, we propose a structured-effect neural network for predicting the remaining useful life which combines the favorable properties of both approaches: its key innovation is that it offers both a high accountability and the flexibility of deep learning. The parameters are estimated via variational Bayesian inferences. The different approaches are compared based on the actual time-to-failure for aircraft engines. This demonstrates the performance and superior interpretability of our method, while we finally discuss implications for decision support.","authors":["Mathias Kraus","Stefan Feuerriegel"],"meta":["July 2019Decision Support Systems 125:113100","DOI:10.1016/j.dss.2019.113100"],"references":["323167073_A_comparative_study_of_LSTM_neural_networks_in_forecasting_day-ahead_global_horizontal_irradiance_with_satellite_data","317062430_A_Unified_Approach_to_Interpreting_Model_Predictions","332234551_A_decision_support_framework_for_robust_RD_budget_allocation_using_machine_learning_and_optimization","321630147_Deep_learning_with_long_short-term_memory_networks_for_financial_market_predictions","320802848_Forecasting_Fault_Events_for_Predictive_Maintenance_using_Data-driven_Techniques_and_ARMA_Modeling","320344506_Decision_support_from_financial_disclosures_with_deep_neural_networks_and_transfer_learning","318890794_Long_Short-Term_Memory_Network_for_Remaining_Useful_Life_estimation","317281710_Remaining_Useful_Life_Estimation_of_Engineered_Systems_using_vanilla_LSTM_Neural_Networks","314933361_Deep_Convolutional_Neural_Network_Based_Regression_Approach_for_Estimation_of_Remaining_Useful_Life","311648243_Predicting_Process_Behaviour_using_Deep_Learning"]}