{"id":"334501032_Do_Neural_Information_Extraction_Algorithms_Generalize_Across_Institutions","abstract":"Purpose: \nNatural language processing (NLP) techniques have been adopted to reduce the curation costs of electronic health records. However, studies have questioned whether such techniques can be applied to data from previously unseen institutions. We investigated the performance of a common neural NLP algorithm on data from both known and heldout (ie, institutions whose data were withheld from the training set and only used for testing) hospitals. We also explored how diversity in the training data affects the system's generalization ability.\n\nMethods: \nWe collected 24,881 breast pathology reports from seven hospitals and manually annotated them with nine key attributes that describe types of atypia and cancer. We trained a convolutional neural network (CNN) on annotations from either only one (CNN1), only two (CNN2), or only four (CNN4) hospitals. The trained systems were tested on data from five organizations, including both known and heldout ones. For every setting, we provide the accuracy scores as well as the learning curves that show how much data are necessary to achieve good performance and generalizability.\n\nResults: \nThe system achieved a cross-institutional accuracy of 93.87% when trained on reports from only one hospital (CNN1). Performance improved to 95.7% and 96%, respectively, when the system was trained on reports from two (CNN2) and four (CNN4) hospitals. The introduction of diversity during training did not lead to improvements on the known institutions, but it boosted performance on the heldout institutions. When tested on reports from heldout hospitals, CNN4 outperformed CNN1 and CNN2 by 2.13% and 0.3%, respectively.\n\nConclusion: \nReal-world scenarios require that neural NLP approaches scale to data from previously unseen institutions. We show that a common neural NLP algorithm for information extraction can achieve this goal, especially when diverse data are used during training.","authors":["Enrico Santus","Clara Li","Adam Yala","Donald Peck"],"meta":["July 2019JCO Clinical Cancer Informatics 3(3):1-8","DOI:10.1200/CCI.18.00160"],"references":["328773481_Variable_generalization_performance_of_a_deep_learning_model_to_detect_pneumonia_in_chest_radiographs_A_cross-sectional_study","309799617_Using_machine_learning_to_parse_breast_pathology_reports","280060008_Validation_of_natural_language_processing_to_extract_breast_cancer_pathology_procedures_and_results","230764022_The_feasibility_of_using_natural_language_processing_to_extract_clinical_information_from_breast_pathology_reports","283050670_Information_extraction_from_multi-institutional_radiology_reports"]}