{"id":"334583330_Knowledge_Management_for_Self-Organised_Resource_Allocation","abstract":"Many instances of socio-technical systems in the digital society and digital economy require some form of self-governance. Examples include community energy systems, peer production systems, participatory sensing applications, and shared management of communal living areas or workspace. Such systems have several features in common, of which three are that they are rule-oriented, self-organising, and value-sensitive, and in operation, this combination of features entails self-modification of the rules in order to satisfice a changeable set of values. This presents a fundamental dilemma for systems design. On the one hand, the system must be sufficiently unrestricted (resilient, flexible) to enable a diverse group but with a shared set of congruent values to achieve their joint purposes in collective action situations. On the other hand, it must be sufficiently restricted (stable, robust) to prevent a subset of the group from exploiting self-determination ‘against itself’ and usurp control of the system for the benefit of its own narrow interests. To address this problem, we consider a study of classical Athenian democracy which investigates how the governance model of the city-state flourished. The work suggests that exceptional knowledge management, i.e., making information available for socially productive purposes, played a crucial role in sustaining its democracy for nearly 200 years, by creating processes for aggregation, alignment, and codification of knowledge. We therefore examine the proposition that some properties can be generalised to resolve the rule-restriction dilemma by establishing a set of design principles intended to make knowledge management processes open, inclusive, transparent, and effective in self-governed social technical systems. We operationalise three of these principles in the context of a collective action situation, namely self-organised common-pool resource allocation, and present the results of a series of experiments showing how knowledge management processes can be used to obtain robust solutions for the perception of fairness, allocation decision, and punishment mechanisms. By applying this operationalisation of the design principles for knowledge management processes as a complement to institutional approaches to governance, we demonstrate empirically how it can satisfice shared values, distribute power fairly, and apply “common sense” in dealing with rule violations. We conclude by arguing that this approach to the design of socio-technical systems can provide a balance between restricted and unrestricted self-modification of conventional rules, and can thus provide the foundations for sustainable and democratic self-governance in socio-technical systems.","authors":["David Burth Kurka","Jeremy Pitt","Josiah Ober"],"meta":["July 2019ACM Transactions on Autonomous and Adaptive Systems 14(1):1-41","DOI:10.1145/3337796"],"references":["320368027_The_Principled_Violation_of_Policy_Norm_Flexibilization_in_Open_Self-Organising_Systems","344577397_The_Economy_of_Esteem","333297068_A_system_of_systems_approach_to_the_evolutionary_transformation_of_power_management_systems","332457379_The_Difference_How_the_Power_of_Diversity_Creates_Better_Groups_Firms_Schools_and_Societies_-_New_Edition","320368594_Knowledge_Management_Processes_and_Design_Principles_for_Self-Governing_Socio-Technical_Systems","319854210_Value_Sensitive_Design_for_Peer_Production_Systems_Mediating_Social_Interactions","313117149_Shaping_the_Political_Arena_Critical_Junctures_the_Labor_Movement_and_Regime_Dynamics_in_Latin_America","312288656_Voices_of_Justice_Finding_Consensus_in_the_Multitude_of_Claims","311532282_Distributed_Distributive_Justice","304848848_An_Evolutionary_Approach_to_Norms"]}