{"id":"334513276_Effects_of_a_digital_educational_intervention_on_collaborative_learning_in_nursing_education_A_quasi-experimental_study","abstract":"Collaborative digital learning is becoming increasingly popular in higher education. However, the use of collaborative digital learning does risk placing too big a responsibility on the learner and reducing face-to-face interaction with the educator. The aim of this quasi-experimental study was to evaluate the effects of a digital educational intervention on collaborative learning in nursing education. The intervention group ( n = 87) studied using a collaborative digital learning environment and the control group ( n = 38) studied in the traditional classroom setting. There were no significant differences between the groups in terms of student satisfaction. However, the students' satisfaction of studying decreased in the intervention group after completion of the course. In the intervention group students had higher satisfaction in the area of promoting collaborative group work and received statistically significant higher grades in the final course evaluation. This study emphasizes that collaborative digital learning can be an effective approach in nursing education in terms of learning outcomes. It also shows that more study is needed on the role of the teacher in collaborative digital nursing education.","authors":["Merja Männistö","Kristina Mikkonen","Essi Vuopala","Heli-Maria Kuivila"],"meta":["July 2019","DOI:10.1177/2057158519861041","Projects: Hoitotyön opiskelijoiden yhteisöllinen oppiminen ja sosiaali- ja terveysalan opettajien osaaminen digitaalisessa oppimisympäristössä. Oulun yliopisto, Lääketieteellinen tiedekunta, väitöskirjaCollaborative learning in digital environments"],"references":["326616930_Student_Resistance_to_Collaborative_Learning","326535656_Collaborative_Learning_in_Higher_Nursing_Education_A_Systematic_Review","335643989_Digital_collaborative_learning_in_nursing_education_a_systematic_review","335445234_Qualitative_study_of_social_and_healthcare_educators'_perceptions_of_their_competence_in_education","330238579_Scaffolding_and_scripting_computer-supported_collaborative_learning","327105151_Competence_areas_of_health_science_teachers_-_A_systematic_review_of_quantitative_studies","321335730_Small-group_collaboration_and_individual_knowledge_acquisition_The_processes_of_growth_during_adolescence_and_early_adulthood","321187172_An_evaluation_into_the_impact_of_undergraduate_nursing_students_classroom_attendance_and_engagement_with_online_tasks_on_overall_academic_achievement","313886209_Advanced_Analytic_Automated_AAA_Measurement_of_Engagement_During_Learning","313048251_Improving_the_reporting_quality_of_nonrandomized_evaluations_of_behavioral_and_public_health_interventions_The_TREND_Statement"]}