{"id":"334522485_The_Opportunities_and_Limitations_of_Using_Artificial_Neural_Networks_in_Social_Science_Research","abstract":"Artificial Neural Networks (ANNs) are being increasingly used in various disciplines outside computer science, such as bibliometrics, linguistics, and medicine. However, their uptake in the social science community has been relatively slow, because these highly non-linear models are difficult to interpret and cannot be used for hypothesis testing. Despite the existing limitations, this paper argues that the social science community can benefit from using ANNs in a number of ways, especially by outsourcing laborious data coding and pre-processing tasks to machines in the early stages of analysis. Using ANNs would enable small teams of researchers to process larger quantities of data and undertake more ambitious projects. In fact, the complexity of the pre-processing tasks that ANNs are able to perform mean that researchers could obtain rich and complex data typically associated with qualitative research at a large scale, allowing to combine the best from both qualitative and quantitative approaches.","authors":["Lukas Pukelis","Vilius Stančiauskas"],"meta":["July 2019Politologija 94(2):56-80","DOI:10.15388/Polit.2019.94.2","Project: Key Indicators for Research and Innovation"],"references":["327414117_Web_Mining_of_Firm_Websites_A_Framework_for_Web_Scraping_and_a_Pilot_Study_for_Germany","318706165_Input_and_Age-Dependent_Variation_in_Second_Language_Learning_A_Connectionist_Account","318360315_A_simple_but_tough-to-beat_baseline_for_the_Fake_News_Challenge_stance_detection_task","316471370_Some_Like_it_Hoax_Automated_Fake_News_Detection_in_Social_Networks","309322060_The_Ethics_of_Algorithms_Mapping_the_Debate","332102144_Designing_Social_Inquiry_Scientific_Inference_in_Qualitative_Research","321095253_Online_Political_Discourse_in_the_Trump_Era","320885186_CSI_A_Hybrid_Deep_Model_for_Fake_News_Detection","318740546_Liar_Liar_Pants_on_Fire_A_New_Benchmark_Dataset_for_Fake_News_Detection","307907069_Automatic_deception_detection_Methods_for_finding_fake_news"]}