{"id":"334631038_Fully_Automatic_Segmentation_of_Acute_Ischemic_Lesions_on_Diffusion-Weighted_Imaging_Using_Convolutional_Neural_Networks_Comparison_with_Conventional_Algorithms","abstract":"Objective: \nTo develop algorithms using convolutional neural networks (CNNs) for automatic segmentation of acute ischemic lesions on diffusion-weighted imaging (DWI) and compare them with conventional algorithms, including a thresholding-based segmentation.\n\nMaterials and methods: \nBetween September 2005 and August 2015, 429 patients presenting with acute cerebral ischemia (training:validation:test set = 246:89:94) were retrospectively enrolled in this study, which was performed under Institutional Review Board approval. Ground truth segmentations for acute ischemic lesions on DWI were manually drawn under the consensus of two expert radiologists. CNN algorithms were developed using two-dimensional U-Net with squeeze-and-excitation blocks (U-Net) and a DenseNet with squeeze-and-excitation blocks (DenseNet) with squeeze-and-excitation operations for automatic segmentation of acute ischemic lesions on DWI. The CNN algorithms were compared with conventional algorithms based on DWI and the apparent diffusion coefficient (ADC) signal intensity. The performances of the algorithms were assessed using the Dice index with 5-fold cross-validation. The Dice indices were analyzed according to infarct volumes (< 10 mL, ≥ 10 mL), number of infarcts (≤ 5, 6-10, ≥ 11), and b-value of 1000 (b1000) signal intensities (< 50, 50-100, > 100), time intervals to DWI, and DWI protocols.\n\nResults: \nThe CNN algorithms were significantly superior to conventional algorithms (p < 0.001). Dice indices for the CNN algorithms were 0.85 for U-Net and DenseNet and 0.86 for an ensemble of U-Net and DenseNet, while the indices were 0.58 for ADC-b1000 and b1000-ADC and 0.52 for the commercial ADC algorithm. The Dice indices for small and large lesions, respectively, were 0.81 and 0.88 with U-Net, 0.80 and 0.88 with DenseNet, and 0.82 and 0.89 with the ensemble of U-Net and DenseNet. The CNN algorithms showed significant differences in Dice indices according to infarct volumes (p < 0.001).\n\nConclusion: \nThe CNN algorithm for automatic segmentation of acute ischemic lesions on DWI achieved Dice indices greater than or equal to 0.85 and showed superior performance to conventional algorithms.","authors":["Ilsang Woo","Areum Lee","Seung Chai Jung","Hyunna Lee"],"meta":["August 2019Korean journal of radiology: official journal of the Korean Radiological Society 20(8):1275","DOI:10.3348/kjr.2018.0615"],"references":["324748889_Better_Diffusion_Segmentation_in_Acute_Ischemic_Stroke_Through_Automatic_Tree_Learning_Anomaly_Segmentation","319770123_Densely_Connected_Convolutional_Networks","319284613_The_One_Hundred_Layers_Tiramisu_Fully_Convolutional_DenseNets_for_Semantic_Segmentation","317582264_Fully_Automatic_Acute_Ischemic_Lesion_Segmentation_in_DWI_Using_Convolutional_Neural_Networks","317153113_Deep_Learning_in_Medical_Imaging_General_Overview","284275739_Segmentation_of_Hyper-Acute_Ischemic_Infarcts_from_Diffusion_Weighted_Imaging_Based_on_Support_Vector_Machine","267930907_Statistical_normalization_techniques_for_magnetic_resonance_imaging","329740202_Squeeze-and-Excitation_Networks","312223568_Computer-assisted_delineation_of_cerebral_infarct_from_diffusion-weighted_MRI_using_Gaussian_mixture_model","269176261_Extra_Tree_forests_for_sub-acute_ischemic_stroke_lesion_segmentation_in_MR_sequences"]}