{"id":"334644086_On_the_use_of_deep_learning_for_computational_imaging","abstract":"Since their inception in the 1930–1960s, the research disciplines of computational imaging and machine learning have followed parallel tracks and, during the last two decades, experienced explosive growth drawing on similar progress in mathematical optimization and computing hardware. While these developments have always been to the benefit of image interpretation and machine vision, only recently has it become evident that machine learning architectures, and deep neural networks in particular, can be effective for computational image formation, aside from interpretation. The deep learning approach has proven to be especially attractive when the measurement is noisy and the measurement operator ill posed or uncertain. Examples reviewed here are: super-resolution; lensless retrieval of phase and complex amplitude from intensity; photon-limited scenes, including ghost imaging; and imaging through scatter. In this paper, we cast these works in a common framework. We relate the deep-learning-inspired solutions to the original computational imaging formulation and use the relationship to derive design insights, principles, and caveats of more general applicability. We also explore how the machine learning process is aided by the physics of imaging when ill posedness and uncertainties become particularly severe. It is hoped that the present unifying exposition will stimulate further progress in this promising field of research.","authors":["George Barbastathis","Aydogan Ozcan","Guohai Situ"],"meta":["July 2019Optica 6(8):921-943","DOI:10.1364/OPTICA.6.000921"],"references":["333339978_Learning-based_lensless_imaging_through_optically_thick_scattering_media","331617015_Deep_learning-based_super-resolution_in_coherent_imaging_systems","329715953_Deep_learning_enables_cross-modality_super-resolution_in_fluorescence_microscopy","343115991_On_the_interplay_between_physical_and_content_priors_in_deep_learning_for_computational_imaging","329754197_The_Unreasonable_Effectiveness_of_Deep_Features_as_a_Perceptual_Metric","329750741_Learning_Dual_Convolutional_Neural_Networks_for_Low-Level_Vision","329748406_Learning_to_See_in_the_Dark","329593748_Low_Photon_Count_Phase_Retrieval_Using_Deep_Learning","328520862_Spectral_pre-modulation_of_training_examples_enhances_the_spatial_resolution_of_the_phase_extraction_neural_network_PhENN","327916206_Introduction_to_the_Theory_of_Neural_Computation"]}