{"id":"334617622_Phenotyping_Women_Based_on_Dietary_Macronutrients_Physical_Activity_and_Body_Weight_Using_Machine_Learning_Tools","abstract":"Nutritional phenotyping can help achieve personalized nutrition, and machine learning tools may offer novel means to achieve phenotyping. The primary aim of this study was to use energy balance components, namely input (dietary energy intake and macronutrient composition) and output (physical activity) to predict energy stores (body weight) as a way to evaluate their ability to identify potential phenotypes based on these parameters. From the Women’s Health Initiative Observational Study (WHI OS), carbohydrates, proteins, fats, fibers, sugars, and physical activity variables, namely energy expended from mild, moderate, and vigorous intensity activity, were used to predict current body weight (both as body weight in kilograms and as a body mass index (BMI) category). Several machine learning tools were used for this prediction. Finally, cluster analysis was used to identify putative phenotypes. For the numerical predictions, the support vector machine (SVM), neural network, and k-nearest neighbor (kNN) algorithms performed modestly, with mean approximate errors (MAEs) of 6.70 kg, 6.98 kg, and 6.90 kg, respectively. For categorical prediction, SVM performed the best (54.5% accuracy), followed closely by the bagged tree ensemble and kNN algorithms. K-means cluster analysis improved prediction using numerical data, identified 10 clusters suggestive of phenotypes, with a minimum MAE of ~1.1 kg. A classifier was used to phenotype subjects into the identified clusters, with MAEs <5 kg for 15% of the test set (n = ~2000). This study highlights the challenges, limitations, and successes in using machine learning tools on self-reported data to identify determinants of energy balance.","authors":["Ramyaa Ramyaa","Omid Hosseini","Giri P. Krishnan","Sridevi Krishnan"],"meta":["July 2019Nutrients 11(7):1681","DOI:10.3390/nu11071681"],"references":["329272818_Challenges_in_Personalized_Nutrition_and_Health","325752553_Personalised_nutrition_and_health","282871649_Addressing_Current_Criticism_Regarding_the_Value_of_Self-Report_Dietary_Data","277658651_Risk_Profiles_for_Weight_Gain_among_Postmenopausal_Women_A_Classification_and_Regression_Tree_Analysis_Approach","322715582_The_elements_of_statistical_learning","317097312_Invited_Commentary_The_Contribution_to_the_Field_of_Nutritional_Epidemiology_of_the_Landmark_1985_Publication_by_Willett_et_al","312538118_Support-vector_networks","309697799_Neural_Network_Design","281563511_Universal_learning_technology_Support_Vector_Machines","278695382_The_Nature_of_Statistical_Learning_Theory"]}