{"id":"334620177_Emerging_Technology_and_Business_Model_Innovation_The_Case_of_Artificial_Intelligence","abstract":"Artificial intelligence (AI) has been altering industries as evidenced by Airbnb, Uber and other companies that have embraced its use to implement innovative new business models. Yet we may not fully understand how this emerging and rapidly advancing technology influences business model innovation. While many companies are being made vulnerable to new competitors equipped with AI technology, this study attempts to focus on the proactive side of the use of AI technology to drive business model innovation. Describing AI technology as the catalyst of business model innovation, this study sheds light on contingent factors shaping business model innovation initiated by the emerging technology. This study first provides a brief overview of AI, current issues being tackled in developing AI and explains how it transforms business models. Our case study of two companies that innovated their business models using AI shows its potential impact. We also discuss how executives can create an innovative AI-based culture, which rephrases the process of AI-based business model innovation. Companies that successfully capitalize on AI can create disruptive innovation through their new business models and processes, enabling them to potentially transform the global competitive landscape.","authors":["Jaehun Lee","Taewon Suh","Daniel Roy","Melissa Baucus"],"meta":["July 2019Journal of Open Innovation Technology Market and Complexity 5(3):44","DOI:10.3390/joitmc5030044"],"references":["333338706_Artificial_Intelligence_and_Big_Data_in_Entrepreneurship_A_New_Era_Has_Begun","324204853_Advanced_Business_Model_Innovation_Supported_by_Artificial_Intelligence_and_Deep_Learning","310784874_Fifteen_Years_of_Research_on_Business_Model_Innovation_How_Far_Have_We_Come_and_Where_Should_We_Go","327963451_Are_business_leaders_prepared_to_handle_the_upcoming_revolution_in_business_artificial_intelligence","322220859_Deep_Learning_A_Critical_Appraisal","321720067_Artificial_Intelligence_as_a_Growth_Engine_for_Health_Care_Startups_Emerging_Business_Models","321573776_State-of-the-art_Speech_Recognition_With_Sequence-to-Sequence_Models","316945826_Two_Decades_of_Recommender_Systems_at_Amazoncom","314561376_Managing_Radical_Organizational_Change","312970597_A_proposal_for_the_Dartmouth_summer_research_project_on_artificial_intelligence"]}