{"id":"334656714_An_efficient_kriging_modeling_method_for_high-dimensional_design_problems_based_on_maximal_information_coefficient","abstract":"Kriging, one of the most popular surrogate models, is widely used in computationally expensive optimization problems to improve the design efficiency. However, due to the “curse-of-dimensionality,” the time for generating the kriging model increases exponentially as the dimension of the problem grows. When it comes to the cases that the kriging model needs to be frequently constructed, such as sequential sampling for kriging modeling or global optimization based on kriging model, the increased modeling time should be taken into consideration. To overcome this challenge, we propose a novel kriging modeling method which combines kriging with maximal information coefficient (MIC). Taking the features of the optimized hyper-parameters into consideration, MIC is utilized for estimating the relative magnitude of hyper-parameters. Then this knowledge of hyper-parameters is incorporated into the maximum likelihood estimation problem to reduce the dimensionality. In this way, the high dimensional optimization can be transformed into a one-dimensional optimization, which can significantly improve the modeling efficiency. Five representative numerical examples from 20-D to 80-D and an industrial example with 35 variables are used to show the effectiveness of the proposed method. Results show that compared with the conventional kriging, the modeling time of the proposed method can be ignored, while the loss of accuracy is acceptable. For the problems with more than 40 variables, the proposed method can even obtain a more accurate kriging model with given computational resources. Besides, the proposed method is also compared with KPLS (kriging combined with the partial least squares method), another state-of-the-art kriging modeling method for high-dimensional problems. Results show that the proposed method is more competitive than KPLS, which means the proposed method is an efficient kriging modeling method for high-dimensional problems.","authors":["Liang Zhao","Peng Wang","Baowei Song","Xinjing Wang"],"meta":["January 2020Structural and Multidisciplinary Optimization 61(3)","DOI:10.1007/s00158-019-02342-3"],"references":["329249773_Variable_selection_using_Gaussian_process_regression-based_metrics_for_high-dimensional_model_approximation_with_limited_data","327511889_Multi-surrogate-based_global_optimization_using_a_score-based_infill_criterion","325435583_A_simplified_shape_optimization_strategy_for_blended-wing-body_underwater_gliders","329650090_Gaussian_Processes_for_Machine_Learning","329511861_A_screening-based_gradient-enhanced_Kriging_modeling_method_for_high-dimensional_problems","328711980_Knowledge_Assisted_Optimization_for_Large-Scale_Problems_A_Review_and_Proposition","323010730_Screening_for_linearly_and_nonlinearly_related_variables_in_predictive_cheminformatic_models_Screening_for_linearly_and_nonlinearly_related_variables","322942185_SCGOSR_Surrogate-based_Constrained_Global_Optimization_using_Space_Reduction","321133827_A_Comparison_of_Three_Methods_for_Selecting_Values_of_Input_Variables_in_the_Analysis_of_Output_from_a_Computer_Code","320851365_Dimension_Reduction_and_Decomposition_Using_Causal_Graph_and_Qualitative_Analysis_for_Aircraft_Concept_Design_Optimization","319035484_Gradient-enhanced_kriging_for_high-dimensional_problems","318863051_Weighted_Gradient-Enhanced_Kriging_for_High-Dimensional_Surrogate_Modeling_and_Design_Optimization","317800708_Committee-Based_Active_Learning_for_Surrogate-Assisted_Particle_Swarm_Optimization_of_Expensive_Problems","313125217_Metamodeling_for_high_dimensional_design_problems_by_multi-fidelity_simulations","318298720_Compressor_blade_design_for_stationary_gas_turbines_using_dimension_reduced_surrogate_modeling"]}