{"id":"334611760_Spatial_Assessment_of_Drought_Severity_in_Cape_Town_Area_South_Africa","abstract":"In recent decades, drought has been identified as part of the several regular climate-related hazards happening in many African countries including South Africa, often with devastating implications on food security. Studies have shown that the earth temperature has increased over the recent years which can trigger drought occurrences and other climate-related hazards. Drought occurrence is principally a climate-related event that cannot be totally effaced though it can be managed. This study is aimed at appraising drought severity in Cape Town area, South Africa using Geographic Information System (GIS) and remotely sensed data obtained from United States Geological Survey (USGS) database between the years 2014 and 2018. The study revealed that the land use dynamics witnessed drastic changes where vegetation, water body and bare surface decreased from 2095 to 141 km2, 616 to 167 km2 and 2337 to 1381km2 respectively while built up and sparse vegetation increased from 5301 to 8191 km2 and 7382-7854 km2 during the period. Vegetation health and drought severity of the study area was assessed using vegetation indices and Normalized Drought Dryness Index (NDDI). The result reveals that Normalized Difference Water Index (NDWI) and other vegetation indices decreased considerably more in recent years (2017 and 2018) which might have triggered drought events during the period compared to the other years (2014-2016). Furthermore, the spatial trend of land surface temperature (LST) and NDDI increased in recent years with NDDI values ranging between moderate drought and severe drought threshold. Consequently, if the increment persists, it can lead to adverse impacts such as food insecurity, land degradation and environmental health deterioration. Evidently, this study reveals the current state of vegetation health regarding drought severity in the area using remotely sensed data.","authors":["Israel Ropo Orimoloye","Sonwabo Perez Mazinyo","Ahmed Mukalazi Kalumba","Werner Nel"],"meta":["July 2019Heliyon 5(7)","DOI:10.1016/j.heliyon.2019.e02148","Projects: Drought and Desertification MonitoringDisaster risk reduction and management"],"references":["330398849_Ecological_vulnerability_indicators_to_drought_Case_of_communal_farmers_in_Eastern_Cape_South_Africa","329774935_Spatio-temporal_analysis_of_land_use_dynamics_and_its_potential_indications_on_land_surface_temperature_in_Sokoto_Metropolis_Nigeria","329297824_Anthropogenic_influence_on_the_drivers_of_the_Western_Cape_drought_2015-2017","323828120_Geospatial_Analysis_of_Wetland_Dynamics_Wetland_Depletion_and_Biodiversity_Conservation_of_Isimangaliso_Wetland_South_Africa","322685013_Spatiotemporal_monitoring_of_land_surface_temperature_and_estimated_radiation_using_remote_sensing_human_health_implications_for_East_London_South_Africa","320994906_Drought_Characteristics_over_the_Western_Cape_Province_South_Africa","320930842_Remote_sensing_appraisal_of_Lake_Chad_shrinkage_connotes_severe_impacts_on_green_economics_and_socio-economics_of_the_catchment_area","320708351_Assessing_Changes_in_Climate_Variability_Observation_and_Simulation_of_Temperature_and_Relative_Humidity_A_Case_of_East_London_South_Africa","320324535_Response_of_Cassava_and_Maize_Yield_to_Varying_Spatial_Scales_of_Rainfall_and_Temperature_Scenarios_in_Port_Harcourt","321519105_Use_of_the_Normalized_Difference_Vegetation_Index_NDVI_to_Assess_Land_Degradation_at_Multiple_Scales"]}