{"id":"334689876_Using_a_10-Year_Radar_Archive_for_Nowcasting_Precipitation_Growth_and_Decay_A_Probabilistic_Machine_Learning_Approach","abstract":"Machine learning algorithms are trained on a 10-yr archive of composite weather radar images in the Swiss Alps to nowcast precipitation growth and decay in the next few hours in moving coordinates (Lagrangian frame). The hypothesis of this study is that growth and decay is more predictable in mountainous regions, which represent a potential source of practical predictability by machine learning methods. In this paper, artificial neural networks (ANN) are employed to learn the complex nonlinear dependence relating the growth and decay to the input predictors, which are geographical location, mesoscale motion vectors, freezing level height, and time of the day. The average long-term growth and decay patterns are effectively reproduced by the ANN, which allows exploring their climatology for any combination of predictors. Due to the low intrinsic predictability of growth and decay, its prediction in real time is more challenging, but is substantially improved when adding persistence information to the predictors, more precisely the growth and decay and precipitation intensity in the immediate past. The improvement is considerable in mountainous regions, where, depending on flow direction, the root-mean-square error of ANN predictions can be 20%–30% lower compared with persistence. Because large uncertainty is associated with precipitation forecasting, deterministic machine learning predictions should be coupled with a model for the predictive uncertainty. Therefore, we consider a probabilistic perspective by estimating prediction intervals based on a combination of quantile decision trees and ANNs. The probabilistic framework is an attempt to address the problem of conditional bias, which often characterizes deterministic machine learning predictions obtained by error minimization.","authors":["Loris Foresti","Ioannis V Sideris","Daniele Nerini","Lea Beusch"],"meta":["July 2019Weather and Forecasting 34(5)","DOI:10.1175/WAF-D-18-0206.1","Project: Precipitation attractor from radar and satellite data archives and implications for seamless very short-term precipitation forecasting"],"references":["332827105_Ensemble_Spatial_Precipitation_Analysis_From_Rain_Gauge_Data_Methodology_and_Application_in_the_European_Alps","326419656_A_10-year_radar-based_analysis_of_orographic_precipitation_growth_and_decay_patterns_over_the_Swiss_Alpine_region"]}