{"id":"334619962_Modelos_de_anotacao_para_representacao_de_documentos_uma_proposta_ontologica_para_o_dominio_de_anotacao_multimidia","abstract":"O artigo apresenta e discute modelos de anotação para a representação de documentos em ambientes digitais, como tags, atributos e relações, destacando o modelo de anotação baseado em ontologias numa perspectiva de tratamento semântico de documentos. Objetiva apresentar uma proposta de modelagem ontológica para a organização semântica de metadados destinados à anotação de documentos multimídia e relatar suas vantagens no uso em ambientes digitais. A proposta de modelagem foi fundamentada metodologicamente em ontologias multimídia mais bem colocadas em um ranking obtido a partir de uma avaliação criteriosa acerca de reúso de ontologias, o que assegurou a seleção de recursos de conhecimento adequados para a integração na conceituação do modelo. O modelo buscou cobrir requisitos determinados na pesquisa propondo classes e relacionamentos ontológicos fundamentais oriundos da combinação e alinhamentos de ontologias multimídia previamente analisadas e avaliadas, promovendo uma arquitetura abrangente para a organização semântica de metadados multimídia endereçados a aplicações que lidam com recursos de informação na Web.","authors":["Daniela Lucas da Silva Lemos","Renato Rocha Souza"],"meta":["October 2018Informação & Tecnologia 4(2):102-123","DOI:10.22478/ufpb.2358-3908.2017v4n2.40544"],"references":["262599397_Linked_Data_The_Story_so_Far","245584936_WonderWeb_Deliverable_D18_Ontology_Library","240972864_Desafios_e_avancos_na_recuperacao_automatica_da_informacao_audiovisual","228448165_The_landscape_of_multimedia_ontologies_in_the_last_decade","227215903_Ontology_Design_Patterns","272829912_The_NeOn_Methodology_for_Ontology_Engineering","263884227_A_METHOD_FOR_INTEGRATING_MULTIMEDIA_METADATA_STANDARDS_AND_METADATA_FORMATS_WITH_THE_MULTIMEDIA_METADATA_ONTOLOGY","246900036_Multimedia_Servers-Applications_Environments_and_Design","228057911_The_Semantic_Web","226836503_Semantic_Wikipedia"]}