{"id":"334652289_Computational_thinking_in_compulsory_education_a_survey_study_on_initiatives_and_conceptions","abstract":"This article communicates the results of a Danish survey study conducted in 2018 that aimed to examine initiatives relating to computational thinking in primary and lower-secondary schools, as well as the professional development of teachers and the perceptions of school principals in this area. The context is an increasing interest in this field, motivated by a sense that it is important for children to learn computational thinking skills. However, educators struggle with questions regarding what computational thinking in education actually is—and consequently, how they should teach and assess it. In this survey, we wanted to explore existing practices and current situations to find out what school principals regard as important; thus, we designed an electronic questionnaire on this topic. 98 principals started the survey, and 83 completed it. Our analysis suggests that many initiatives connected to computational thinking are currently being implemented, but according to the principals taking part, teachers are not trained to teach this subject. The principals have inclusive views and focus on broad aspects of what computational thinking involves. According to them, computational thinking is not about pushing students into computing careers; rather it is about supporting the well-rounded development of human beings in a free and democratic society. However, the principals do report limited understanding of this subject, which suggests that teachers are not the only ones in need of training—principals also need help to develop a culture and mindset around this subject and implement it efficiently into schools.","authors":["Elisa Nadire Caeli","Jeppe Bundsgaard"],"meta":["July 2019Educational Technology Research and Development 68(6)","DOI:10.1007/s11423-019-09694-z"],"references":["332784433_Datalogisk_taenkning_og_teknologiforstaelse_i_folkeskolen_tur-retur","329810858_Computational_thinking_in_elementary_classrooms_measuring_teacher_understanding_of_computational_ideas_for_teaching_science","315636456_Computational_thinking_for_teacher_education","312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","262350755_Computational_Thinking_in_Elementary_and_Secondary_Teacher_Education","258134754_Computational_Thinking_in_K-12_A_Review_of_the_State_of_the_Field","317158625_Remaining_trouble_spots_with_computational_thinking","310792069_The_long_quest_for_computational_thinking","272177757_The_Next_Generation_Science_Standards_For_States_By_States","265459328_Computing_a_human_activity"]}