{"id":"334611124_Invisible_Semi-Fragile_Watermarking_and_Steganography_of_Digital_Videos_for_Content_Authentication_and_Data_Hiding","abstract":"In the current digital age, the piracy of digital media content has become rampant. Illegal distribution of movies and video clips on a global scale causes a significant loss to the media industry. To prevent such theft and distribution of content, we use a watermarking technique for videos where copyright information is hidden inside the original video in the form of a watermark video. Using a video as the watermark facilitates the user in hiding a large amount of information. The watermarking scheme used in this paper is semi-fragile, such that tampering of videos can be detected with relative ease. To improve the robustness of the watermark, we embed the watermark in frequency domain, where we use DWT+DCT+SVD to embed the watermark. The original video and watermark video are transformed by using the DWT and DCT sequentially, then the singular values of the watermark with some embedding strength are added to the singular values of the original video thus obtaining a watermarked video. Some detection tools which are available today cannot detect the watermark video inside the original video. This method equalizes the frames of the watermark and original video to reduce time consumed as well as complexity. The effects of various attacks on the watermarked video have been analyzed using the calculated PSNR values.","authors":["B. P. Aditya","U. G. K. Avaneesh","K. Adithya","Akshay Murthy"],"meta":["July 2019International Journal of Image and Graphics 19(03):1950015","DOI:10.1142/S0219467819500153"],"references":["321293859_A_Robust_Digital_Image_Watermarking_Algorithm_Using_DWT_and_SVD","311994982_Combined_DWT-DCT-Based_Video_Watermarking_Algorithm_Using_Arnold_Transform_Technique","303389435_Handbook_of_Research_on_Modern_Cryptographic_Solutions_for_Computer_and_Cyber_Security","276700312_A_Semi-Blind_Robust_DCT_Watermarking_Approach_for_Sensitive_Text_Images","224171150_Digital_Image_Watermarking_Using_Discrete_Wavelet_Transform_and_Singular_Value_Decomposition_IEEE_Transactions_on_Instrumentation_and_Measurement_59_3060-3063","3424080_Tan_T_A_SVD-Based_Watermarking_Scheme_for_Protecting_Rightful_Ownership_IEEE_Transactions_on_Multimedia_41_121-128"]}