{"id":"334611687_Dynamic_Personalization_of_Gameful_Interactive_Systems","abstract":"Gameful design, the process of creating a system with affordances for gameful experiences, can be used to increase user engagement and enjoyment of digital interactive systems. It can also be used to create applications for behaviour change in areas such as health, wellness, education, customer loyalty, and employee management. However, existing research suggests that the qualities of users, such as their personality traits, preferences, or identification with a task, can influence gamification outcomes.\n\nIt is important to understand how to personalize gameful systems, given how user qualities shape the gameful experience. Current evidence suggests that personalized gameful systems can lead to increased user engagement and be more effective in helping users achieve their goals than generic ones. However, to create these kinds of systems, designers need a specific method to guide them in personalizing the gameful experience to their target audience. To address this need, this thesis proposes a novel method for personalized gameful design divided into three steps: (1) classification of user preferences, (2) classification and selection of gameful design elements, and (3) heuristic evaluation of the design.\n\nRegarding the classification of user preferences, this thesis evaluates and validates the Hexad Gamification User Types Scale, which scores a person in six user types: philanthropist, socialiser, free spirit, achiever, player, and disruptor. Results show that the scale’s structural validity is acceptable for gamification studies through reliability analysis and factor analysis. For classification and selection of gameful design elements, this thesis presents a conceptual framework based on participants’ self-reported preferences, which classifies elements in eight groups organized into three categories: individual motivations (immersion and progression), external motivations (risk/reward, customization, and incentives), and social motivations (socialization, altruism, and assistance). And to evaluate the design of gameful applications, this thesis introduces a set of 28 gameful design heuristics, which are based on motivational theories and gameful design methods and enable user experience professionals to conduct a heuristic evaluation of a gameful application.\n\nFurthermore, this thesis describes the design, implementation, and pilot evaluation of a software platform for the study of personalized gameful design. It integrates nine gameful design elements built around a main instrumental task, enabling researchers to observe and study the gameful experience of participants. The platform is flexible so the instrumental task can be changed, game elements can be added or removed, and the level and type of personalization or customization can be controlled. This allows researchers to generate different experimental conditions to study a broad range of research questions.\n\nOur personalized gameful design method provides practical tools and clear guidelines to help designers effectively build personalized gameful systems.","authors":["Gustavo Fortes Tondello"],"meta":["July 2019","Thesis for: PhD in Computer ScienceAdvisor: Lennart Nacke and Daniel Vogel","Project: Personalized Gamification"],"references":["332865174_Gameful_Design_Heuristics_A_Gamification_Inspection_Tool","332864998_I_don't_fit_into_a_single_type_A_Trait_Model_and_Scale_of_Game_Playing_Preferences","330658206_Personalized_Persuasion_for_Promoting_Students'_Engagement_and_Learning","329608934_E-Commerce_Personalization_in_Africa_A_Comparative_Analysis_of_Jumia_and_Konga","329426003_A_process_for_designing_algorithm-based_personalized_gamification","328550059_Don't_Sweat_the_Small_Stuff_The_Effect_of_Challenge-Skill_Manipulation_on_Electrodermal_Activity","332786560_The_Importance_of_Social_Relations_for_Well-Being_Change_in_Old_Age_-Do_Game_Preferences_Change_As_Well","332255092_The_four_fun_keys","329181478_A_gamification-based_framework_for_developing_learning_activities_of_computational_thinking","328705923_The_Concept_and_Application_of_Life_Style_Segmentation_The_Combination_of_two_Useful_Concepts_Provides_a_Unique_and_Important_View_of_the_Market","328549965_Towards_Emotion-based_Adaptive_Games_Emotion_Recognition_Via_Input_and_Performance_Features","328549460_Emotion-based_Dynamic_Difficulty_Adjustment_Using_Parameterized_Difficulty_and_Self-Reports_of_Emotion","328548419_Gender-_and_Age-related_Differences_in_Designing_the_Characteristics_of_Stereotypical_Virtual_Faces","328442364_Users_As_Game_Designers_Analyzing_Gamification_Concepts_in_a_Bottom-Up_Setting","328278526_Empirical_Validation_of_the_Gamification_User_Types_Hexad_Scale_in_English_and_Spanish"]}