{"id":"334708479_The_influence_of_general_self-efficacy_on_the_interpretation_of_vicarious_experience_information_within_online_learning","abstract":"Abstract An individual’s general self-efficacy affects their cognitive behaviours in a number of ways. Previous research has found general self-efficacy to influence how people interpret persuasive messages designed to encourage behavioural change. No previous work has looked into how general self-efficacy affects the interpretation of vicarious experience information and how this affects self-efficacy in being able to complete a set task within a career skills online learning environment. The study presented considers this gap in knowledge, analysing the effect of six different types of vicarious experience information on the self-efficacy of online workshop participants to complete a set task. In analysing the results, each participant’s general self-efficacy was considered. Results showed individuals with low general self-efficacy to find vicarious experience information significantly less beneficial for their self-efficacy in completing a set task when compared to others with high general self-efficacy. Those with low general self-efficacy were more likely to make negative self-comparisons to the vicarious experience information, restricting its potential to increase their self-efficacy. In contrast, participants with high general self-efficacy found many of the vicarious experience information presented to be beneficial to their self-efficacy to complete the set task as they were more likely to dismiss any information they interpreted to be negative. Results from this study highlight the importance of more research into how vicarious experience information can be designed and presented in a way that ensures benefit to the task-specific self-efficacy of all individuals, regardless of their general self-efficacy beliefs at the time.","authors":["Natalie Wilde","Anne Hsu"],"meta":["December 2019","DOI:10.1186/s41239-019-0158-x"],"references":["322216983_First-Year_Students'_Research_Challenges_Does_Watching_Videos_on_Common_Struggles_affect_Students'_Research_Self-Efficacy","284672098_Measures_in_Health_Psychology_A_User's_Portfolio_Causal_and_Control_Beliefs","264621040_The_influence_of_self-efficacy_on_the_effects_of_framed_health_messages","329821911_When_to_Accentuate_the_Negative_The_Effects_of_Perceived_Efficacy_and_Message_Framing_on_Intentions_to_Perform_a_Health-Related_Behavior","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","283570044_Validity_and_reliability_of_General_Self-Efficacy_Scale_in_asthma_patients","280260486_Peer_Models_and_Children's_Behavioral_Change","258183079_Peer_Models_and_Children's_Behavioral_Change","247746496_Do_Messages_about_Health_Risks_Threaten_the_Self_Increasing_the_Acceptance_of_Threatening_Health_Messages_Via_Self-Affirmation","242529420_Foundations_of_educational_theory_for_online_learning"]}