{"id":"334711561_Knowledge-aware_Graph_Neural_Networks_with_Label_Smoothness_Regularization_for_Recommender_Systems","abstract":"Knowledge graphs capture structured information and relations between a set of entities or items. As such knowledge graphs represent an attractive source of information that could help improve recommender systems. However, existing approaches in this domain rely on manual feature engineering and do not allow for an end-to-end training. Here we propose Knowledge-aware Graph Neural Networks with Label Smoothness regularization (KGNN-LS) to provide better recommendations. Conceptually, our approach computes user-specific item embeddings by first applying a trainable function that identifies important knowledge graph relationships for a given user. This way we transform the knowledge graph into a user-specific weighted graph and then apply a graph neural network to compute personalized item embeddings. To provide better inductive bias, we rely on label smoothness assumption, which posits that adjacent items in the knowledge graph are likely to have similar user relevance labels/scores. Label smoothness provides regularization over the edge weights and we prove that it is equivalent to a label propagation scheme on a graph. We also develop an efficient implementation that shows strong scalability with respect to the knowledge graph size. Experiments on four datasets show that our method outperforms state of the art baselines. KGNN-LS also achieves strong performance in cold-start scenarios where user-item interactions are sparse.","authors":["Hongwei Wang","Fuzheng Zhang","Mengdi Zhang","Jure Leskovec"],"meta":["July 2019","DOI:10.1145/3292500.3330836","Conference: the 25th ACM SIGKDD International Conference"],"references":["333072348_Multi-Task_Feature_Learning_for_Knowledge_Graph_Enhanced_Recommendation","332750505_Knowledge_Graph_Convolutional_Networks_for_Recommender_Systems","331853283_Exploring_High-Order_User_Preference_on_the_Knowledge_Graph_for_Recommender_Systems","328433901_RippleNet_Propagating_User_Preferences_on_the_Knowledge_Graph_for_Recommender_Systems","327947221_Recurrent_knowledge_graph_embedding_for_effective_recommendation","325964999_Leveraging_Meta-path_based_Context_for_Top-_N_Recommendation_with_A_Neural_Co-Attention_Model","325616540_Graph_Convolutional_Neural_Networks_for_Web-Scale_Recommender_Systems","327909455_Graph_Convolutional_Matrix_Completion_for_Bipartite_Edge_Prediction","326497018_Billion-scale_Commodity_Embedding_for_E-commerce_Recommendation_in_Alibaba","326138347_Improving_Sequential_Recommendation_with_Knowledge-Enhanced_Memory_Networks"]}