{"id":"334743331_RICE_PLANT_DISEASE_CLASSIFICATION_USING_TRANSFER_LEARNING_OF_DEEP_CONVOLUTION_NEURAL_NETWORK","abstract":"Early and accurate diagnosis of plant diseases is a vital step in the crop protection system. In traditional practices, identification is performed either by visual observation or by testing in laboratory. The visual observation requires expertise and it may vary subject to an individual which may lead to an error while the laboratory test is time consuming and may not be able to provide the results in time. To overcome these issues, image based machine learning approach to detect and classify plant diseases has been presented in literature. We have focused specifically on rice plant (Oryza sativa) disease in this paper. The images of the diseased symptoms in leaves and stems have been captured from the rice field. We have collected a total of 619 rice plant diseased images from the real field condition belong to four classes:(a) Rice Blast (RB), (b) Bacterial Leaf Blight (BLB), (c) Sheat Blight (SB) and (d) Healthy Leave (HL). We have used a pre-trained deep convolutional neural network(CNN) as a feature extractor and Support Vector Machine (SVM) as a classifier. We have obtained encouraging results. The early identification of rice diseases by this approach could be used as a preventive measure well as an early warning system. Further, it could be extended to develop a rice plant disease identification system on real agriculture field.","authors":["Vimal Shrivastava","Monoj K. Pradhan","S. Minz","M. P. Thakur"],"meta":["July 2019","DOI:10.5194/isprs-archives-XLII-3-W6-631-2019"],"references":["354411068_Management_of_bacterial_leaf_blight_of_rice_caused_by_Xanthomonas_oryzae_pv_oryzae_under_field_condition","319035676_Recent_Trends_in_Deep_Learning_Based_Natural_Language_Processing","318437440_Detection_and_classification_of_rice_plant_diseases","308187542_A_survey_on_detection_and_classification_of_rice_plant_diseases","298281143_Deep_Learning_for_Emotion_Recognition_on_Small_Datasets_Using_Transfer_Learning","295542870_A_review_on_the_main_challenges_in_automatic_plant_disease_identification_based_on_visible_range_images","328667179_Rice_blast_recognition_based_on_principal_component_analysis_and_neural_network","324468433_Facial_emotion_recognition_using_deep_convolutional_networks","321998892_Recognition_of_diseases_in_paddy_leaves_using_knn_classifier","319770277_Deep_Learning_of_Representations_for_Unsupervised_and_Transfer_Learning"]}