{"id":"334758532_On_the_interpretability_of_machine_learning-based_model_for_predicting_hypertension","abstract":"Background: \nAlthough complex machine learning models are commonly outperforming the traditional simple interpretable models, clinicians find it hard to understand and trust these complex models due to the lack of intuition and explanation of their predictions. The aim of this study to demonstrate the utility of various model-agnostic explanation techniques of machine learning models with a case study for analyzing the outcomes of the machine learning random forest model for predicting the individuals at risk of developing hypertension based on cardiorespiratory fitness data.\n\nMethods: \nThe dataset used in this study contains information of 23,095 patients who underwent clinician-referred exercise treadmill stress testing at Henry Ford Health Systems between 1991 and 2009 and had a complete 10-year follow-up. Five global interpretability techniques (Feature Importance, Partial Dependence Plot, Individual Conditional Expectation, Feature Interaction, Global Surrogate Models) and two local interpretability techniques (Local Surrogate Models, Shapley Value) have been applied to present the role of the interpretability techniques on assisting the clinical staff to get better understanding and more trust of the outcomes of the machine learning-based predictions.\n\nResults: \nSeveral experiments have been conducted and reported. The results show that different interpretability techniques can shed light on different insights on the model behavior where global interpretations can enable clinicians to understand the entire conditional distribution modeled by the trained response function. In contrast, local interpretations promote the understanding of small parts of the conditional distribution for specific instances.\n\nConclusions: \nVarious interpretability techniques can vary in their explanations for the behavior of the machine learning model. The global interpretability techniques have the advantage that it can generalize over the entire population while local interpretability techniques focus on giving explanations at the level of instances. Both methods can be equally valid depending on the application need. Both methods are effective methods for assisting clinicians on the medical decision process, however, the clinicians will always remain to hold the final say on accepting or rejecting the outcome of the machine learning models and their explanations based on their domain expertise.","authors":["Radwa El Shawi","Mouaz H Al-Mallah","Sherif Sakr"],"meta":["July 2019BMC Medical Informatics and Decision Making 19(1)","DOI:10.1186/s12911-019-0874-0"],"references":["324604355_Using_machine_learning_on_cardiorespiratory_fitness_data_for_predicting_hypertension_The_Henry_Ford_ExercIse_Testing_FIT_Project","322976218_A_Survey_of_Methods_for_Explaining_Black_Box_Models","318018393_Machine_Learning_and_Prediction_in_Medicine_-_Beyond_the_Peak_of_Inflated_Expectations","315892529_Learning_Important_Features_Through_Propagating_Activation_Differences","324659154_Trends_and_Trajectories_for_Explainable_Accountable_and_Intelligible_Systems_An_HCI_Research_Agenda","324402403_Applied_Linear_Regression_Models","322306535_Model_Class_Reliance_Variable_Importance_Measures_for_any_Machine_Learning_Model_Class_from_the_Rashomon_Perspective","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770006_Learning_Deep_Features_for_Discriminative_Localization","315111148_Understanding_Black-box_Predictions_via_Influence_Functions"]}