{"id":"334780741_Evaluating_the_Effectiveness_of_Parsons_Problems_for_Block-based_Programming","abstract":"Parsons problems are program puzzles, where students piece together code fragments to construct a program. Similar to block-based programming environments, Parsons problems eliminate the need to learn syntax. Parsons problems have been shown to improve learning efficiency when compared to writing code or fixing incorrect code in lab studies, or as part of a larger curriculum. In this study, we directly compared Parsons problems with block-based programming assignments in classroom settings. We hypothesized that Parsons problems would improve students' programming efficiency on the lab assignments where they were used, without impacting performance on the subsequent, related homework or the later programming project. Our results confirmed our hypothesis, showing that on average Parsons problems took students about half as much time to complete compared to equivalent programming problems. At the same time, we found no evidence to suggest that students performed worse on subsequent assignments, as measured by performance and time on task. The results indicate that the effectiveness of Parsons problems is not simply based on helping students avoid syntax errors. We believe this is because Parsons problems dramatically reduce the programming solution space, letting students focus on solving the problem rather than having to solve the combined problem of devising a solution, searching for needed components, and composing them together.","authors":["Rui Zhi","Min Chi","Tiffany Michelle Barnes","Thomas W. Price"],"meta":["July 2019","DOI:10.1145/3291279.3339419","Conference: the 2019 ACM Conference"],"references":["323780727_Factors_Influencing_Students'_Help-Seeking_Behavior_while_Programming_with_Human_and_Computer_Tutors","316947290_iSnap_Towards_Intelligent_Tutoring_in_Novice_Programming_Environments","314293072_The_Code_Mangler_Evaluating_Coding_Ability_Without_Writing_any_Code","332567216_Reducing_the_State_Space_of_Programming_Problems_through_Data-Driven_Feature_Detection","331594677_Evaluation_of_a_Data-driven_Feedback_Algorithm_for_Open-ended_Programming","329476370_Controlling_the_False_Discovery_Rate_A_Practical_and_Powerful_Approach_to_Multiple_Testing","326918129_Evaluating_the_Efficiency_and_Effectiveness_of_Adaptive_Parsons_Problems","320850846_Solving_parsons_problems_versus_fixing_and_writing_code","320678674_Comparing_Block-Based_and_Text-Based_Programming_in_High_School_Computer_Science_Classrooms","311489054_Subgoals_Help_Students_Solve_Parsons_Problems"]}