{"id":"334715234_PressLight_Learning_Max_Pressure_Control_to_Coordinate_Traffic_Signals_in_Arterial_Network","abstract":"Traffic signal control is essential for transportation efficiency in road networks. It has been a challenging problem because of the complexity in traffic dynamics. Conventional transportation research suffers from the incompetency to adapt to dynamic traffic situations. Recent studies propose to use reinforcement learning (RL) to search for more efficient traffic signal plans. However, most existing RL-based studies design the key elements - reward and state - in a heuristic way. This results in highly sensitive performances and a long learning process. To avoid the heuristic design of RL elements, we propose to connect RL with recent studies in transportation research. Our method is inspired by the state-of-the-art method max pressure (MP) in the transportation field. The reward design of our method is well supported by the theory in MP, which can be proved to be maximizing the throughput of the traffic network, i.e., minimizing the overall network travel time. We also show that our concise state representation can fully support the optimization of the proposed reward function. Through comprehensive experiments, we demonstrate that our method outperforms both conventional transportation approaches and existing learning-based methods.","authors":["Hua Wei","Chacha Chen","Guanjie Zheng","Kan Wu"],"meta":["July 2019","DOI:10.1145/3292500.3330949","Conference: the 25th ACM SIGKDD International Conference"],"references":["337015486_Learning_Phase_Competition_for_Traffic_Signal_Control","326504263_IntelliLight_A_Reinforcement_Learning_Approach_for_Intelligent_Traffic_Light_Control","322809125_Signal_Timing_Manual_-_Second_Edition","316598817_Traffic_Light_Control_Using_Deep_Policy-Gradient_and_Value-Function_Based_Reinforcement_Learning","301770991_Signal_Timing_Manual_2nd_ed","333067562_CityFlow_A_Multi-Agent_Reinforcement_Learning_Environment_for_Large_Scale_City_Traffic_Scenario","324104685_Deep_Reinforcement_Learning_for_Traffic_Light_Control_in_Vehicular_Networks","315668104_Deep_Deterministic_Policy_Gradient_for_Urban_Traffic_Light_Control","309627915_Adaptive_Max_Pressure_Control_of_Network_of_Signalized_Intersections","309404160_Traffic_signal_timing_via_deep_reinforcement_learning"]}