{"id":"334712341_When_I_relive_a_positive_me_Vivid_autobiographical_memories_facilitate_autonoetic_brain_activation_and_enhance_mood","abstract":"Autobiographical memory is vital for our well‐being and therefore used in therapeutic interventions. However, not much is known about the (neural) processes by which reliving memories can have beneficial effects. This study investigates what brain activation patterns and memory characteristics facilitate the effectiveness of reliving positive autobiographical memories for mood and sense of self. Particularly, the role of vividness and autonoetic consciousness is studied. Participants (N = 47) with a wide range of trait self‐esteem relived neutral and positive memories while their bold responses, experienced vividness of the memory, mood, and state self‐esteem were recorded. More vivid memories related to better mood and activation in amygdala, hippocampus and insula, indicative of increased awareness of oneself (i.e., prereflective aspect of autonoetic consciousness). Lower vividness was associated with increased activation in the occipital lobe, PCC, and precuneus, indicative of a more distant mode of reliving. While individuals with lower trait self‐esteem increased in state self‐esteem, they showed less deactivation of the lateral occipital cortex during positive memories. In sum, the vividness of the memory seemingly distinguished a more immersed and more distant manner of memory reliving. In particular, when reliving positive memories higher vividness facilitated increased prereflective autonoetic consciousness, which likely is instrumental in boosting mood.","authors":["Charlotte van Schie","Chui-De Chiu","Serge Rombouts","Willem Heiser"],"meta":["July 2019Human Brain Mapping 40(6)","DOI:10.1002/hbm.24742","Project: Social cognition: the processing of mental representations pertinent to the self and other people"],"references":["323486667_When_compliments_do_not_hit_but_critiques_do_An_fMRI_study_into_self-esteem_and_self-knowledge_in_processing_social_feedback","320199991_The_neural_correlates_of_visual_imagery_vividness_-_An_fMRI_study_and_literature_review","297752540_Brain_mechanisms_associated_with_internally_directed_attention_and_self-generated_thought","325373993_Individual_Differences_in_Autobiographical_Memory","323185873_Parietal_control_network_activation_during_memory_tasks_may_be_associated_with_the_co-occurrence_of_externally_and_internally_directed_cognition_A_cross-function_meta-analysis","318393858_R_A_Language_and_Environment_for_Statistical_Computing","314201376_The_spatiotemporal_substrates_of_autobiographical_recollection_Using_event-related_ICA_to_study_cognitive_networks_in_action","309660878_Mental_imagery_of_positive_and_neutral_memories_A_fMRI_study_comparing_field_perspective_imagery_to_observer_perspective_imagery","301938230_Individual_differences_in_visual_imagery_determine_how_event_information_is_remembered","297405280_PERSONALITY_MODERATORS_OF_MOOD_CONGRUENCY_EFFECTS_ON_COGNITION_-_THE_ROLE_OF_SELF-ESTEEM_AND_NEGATIVE_MOOD_REGULATION"]}