{"id":"334766109_Case_Study_Using_Project_Based_Learning_to_Develop_Parallel_Programing_and_Soft_Skills","abstract":"In today’s environment, where every computer,\nincluding cell phones, are multicore, it is essential that students\ndevelop parallel programming skills. It remains a challenge to\ndevelop effective techniques for teaching parallel programing\nskills. Another challenge is finding time within already packed\nlectures to cover additional material. To that end, we investigate\nthe effectiveness of using Project Based Learning (PBL) to teach\nparallel programming skills early in the curriculum by developing\nand incorporating a PBL module into CSc 3210 (Computer\nOrganization and Programming). This is a core course taken by all\ncomputer science majors and is a prerequisite to many of our\nsenior-level classes. In our case study, 124 students are organized\ninto 26 diverse groups, with four or five students per group, and\nassigned five project assignments, each of two-weeks duration.\nGiven a Raspberry PI, students will explore its multicore\narchitecture and create programs for shared memory parallelism\nusing OpenMP and C language. Our results show that\nincorporating this PBL module has a significant and direct effect\non the student’s growth in parallel programming skills. As a side\nbenefit, we also show that there is a direct improvement on a\nstudent’s personal growth in terms soft skills, which is essential in\nthe professional development and success in the workplace. By\nhaving students experience PBL in an early class, close to the\nmidpoint of the academic program, it can serve as a mini-capstone\nproject. Furthermore, students can collaboratively learn by\nthemselves (through teamwork) and apply the fundamentals of\nparallel programming skills without the need for separate lectures,\nlabs, or workshops.","authors":["Awad A Younis Mussa","Rajshekhar Sunderraman","Mike Metzler","Anu G. Bourgeois"],"meta":["May 2019","DOI:10.1109/IPDPSW.2019.00059","Conference: 2019 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW)"],"references":["320008434_Hardening_Freshman_Engineering_Student_Soft_Skills","303839373_CPU_vs_SOC_-_The_battle_for_the_future_of_computing","303469273_Statistical_tests_P_values_confidence_intervals_and_power_A_guide_to_misinterpretations","259268673_Lakens_D_Calculating_and_reporting_effect_sizes_to_facilitate_cumulative_science_a_practical_primer_for_t-tests_and_ANOVAs_Front_Psychol_4_863","242350622_Turning_student_groups_into_effective_teams","228678679_Measuring_added-value_using_a_team_design_skills_growth_survey","323330946_Portable_Parallel_Computing_with_the_Raspberry_Pi"]}