{"id":"334741975_Strategies_and_limitations_in_app_usage_and_human_mobility","abstract":"Cognition has been found to constrain several aspects of human behaviour, such as the number of friends and the number of favourite places a person keeps stable over time. This limitation has been empirically defined in the physical and social spaces. But do people exhibit similar constraints in the digital space? We address this question through the analysis of pseudonymised mobility and mobile application (app) usage data of 400,000 individuals in a European country for six months. Despite the enormous heterogeneity of apps usage, we find that individuals exhibit a conserved capacity that limits the number of applications they regularly use. Moreover, we find that this capacity steadily decreases with age, as does the capacity in the physical space but with more complex dynamics. Even though people might have the same capacity, applications get added and removed over time. In this respect, we identify two profiles of individuals: app keepers and explorers, which differ in their stable (keepers) vs exploratory (explorers) behaviour regarding their use of mobile applications. Finally, we show that the capacity of applications predicts mobility capacity and vice-versa. By contrast, the behaviour of keepers and explorers may considerably vary across the two domains. Our empirical findings provide an intriguing picture linking human behaviour in the physical and digital worlds which bridges research studies from Computer Science, Social Physics and Computational Social Sciences.","authors":["Marco De Nadai","Angelo Cardoso","Antonio Lima","Bruno Lepri"],"meta":["July 2019Scientific Reports 9(1):10935","DOI:10.1038/s41598-019-47493-x"],"references":["339917434_Selective_exposure_shapes_the_Facebook_news_diet","327735985_Understanding_the_interplay_between_social_and_spatial_behaviour","321325854_Smartphone_App_Usage_Prediction_Using_Points_of_Interest","316462296_Smartphones_and_Cognition_A_Review_of_Research_Exploring_the_Links_between_Mobile_Technology_Habits_and_Cognitive_Functioning","314153319_Sequences_of_purchases_in_credit_card_data_reveal_life_styles_in_urban_populations","312407974_Coherency_Maximizing_Exploration_in_the_Supermarket","308048936_Discovering_different_kinds_of_smartphone_users_through_their_application_usage_behaviors","333060306_To_Return_or_to_Explore_Modelling_Human_Mobility_and_Dynamics_in_Cyberspace","327212977_The_Hidden_Image_of_Mobile_Apps_Geographic_Demographic_and_Cultural_Factors_in_Mobile_Usage","321230333_Not_All_Apps_Are_Created_Equal_Analysis_of_Spatiotemporal_Heterogeneity_in_Nationwide_Mobile_Service_Usage"]}