{"id":"334711623_Exploratory_Study_of_the_Integration_of_Frugal_Innovation_in_the_Design_of_Products_for_the_BoP","abstract":"The bottom of the pyramid (BoP) consists of 1.4 billion people living less than 1.25 USD per day. Fulfilling unmet needs of BoP people involves the design of products as a main activity. Designing products for the BoP faces two main problems. First, there is a general lack of understanding of the needs of users and second, traditional design methods may be limited in addressing the BoP context. Frugal innovation is positioned as a very interesting approach with the potential to adequately respond to the design challenges of the products for the BoP. However, studies in engineering design based on frugal innovation are still limited. In response to these issues, through an analysis and review of the literature, an exploratory mapping of the proposals in frugal innovation and the characteristics of the BoP was conducted. On the basis of the results, this paper defines a set of eight frugal criteria design and an identification of three dimensions that characterize a BoP context and two roles of BoP people. Finally, an association of BoP dimensions and roles with the key criteria of frugal design is proposed.","authors":["Luis Miguel Lopez Santiago","Serge Rohmer","René Díaz‐Pichardo","Tatiana Reyes"],"meta":["July 2019Proceedings of the Design Society International Conference on Engineering Design 1(1):3311-3320","DOI:10.1017/dsi.2019.338"],"references":["327118310_Design_Tool_for_Enhanced_New_Product_Development_in_Low_Income_Economies","325134544_DESIGN_AND_FRUGAL_INNOVATIONS_THREE_ROLES_OF_RESOURCE-POOR_PEOPLE","313903670_Interorganisational_social_capital_and_innovation_a_multiple_case_study_in_wine_producers_networks_in_Serra_Gaucha","311922930_What_is_frugal_innovation_Three_defining_criteria","329002254_Towards_a_Theory_of_Frugal_Innovation_What_is_frugal_what_is_innovation","323294908_Frugal_innovation_A_review_and_research_agenda","321206926_The_Economic_Lives_of_the_Poor","320139121_Frugal_approach_to_innovation_State_of_the_art_and_future_perspectives","319208898_Does_Frugal_Innovation_Enable_Sustainable_Development_A_Systematic_Literature_Review","316626880_Frugal_innovation_Doing_more_with_less_for_more"]}