{"id":"334778644_Hybrid_Rule-Based_Model_for_Phishing_URLs_Detection","abstract":"Phishing attack has been considered as a major security challenge facing online community due to the different sophisticated strategies that is being deployed by attackers. One of the reasons for creating phishing website by attackers is to employ social engineering technique that steal sensitive information from legitimate users, such as the user’s account details. Therefore, detecting phishing website has become an important task worthy of investigation. The most widely used blacklist-based approach has proven inefficient. Although, different models have been proposed in the literature by deploying a number of intelligent-based algorithms, however, considering hybrid intelligent approach based on rule induction for phishing website detection is still an open research issue. In this paper, a hybrid rule induction algorithm capable of separating phishing websites from genuine ones is proposed. The proposed hybrid algorithm leverages the strengths of both JRip and Projective Adaptive Resonance Theory (PART) algorithm to generate rule sets. Based on the experiments conducted on two publicly available datasets for phishing detection, the proposed algorithm demonstrates promising results achieving accuracy of 0.9453 and 0.9908 respectively on the two datasets. These results outperformed the results obtained with JRip and PART. Therefore, the rules generated from the hybrid algorithm are capable of identifying phishing links in real-time with reduction in false alarm.","authors":["Adewole K. S.","Abimbola Akintola","Shakirat Aderonke Salihu","Nasir Faruk"],"meta":["July 2019","DOI:10.1007/978-3-030-23943-5_9","In book: Emerging Technologies in Computing (pp.119-135)"],"references":["329799910_An_Efficient_Algorithm_for_Generating_Classification_Rules","328201256_Twitter_spam_account_detection_based_on_clustering_and_classification_methods","327942719_Characterizing_Current_Features_of_Malicious_Threats_on_Websites","318604080_SMSAD_a_framework_for_spam_message_and_spam_account_detection","316439983_Facebook_Inspector_FbI_Towards_automatic_real-time_detection_of_malicious_content_on_Facebook","329111231_A_Markov_Detection_Tree-Based_Centralized_Scheme_to_Automatically_Identify_Malicious_Webpages_on_Cloud_Platforms","322510914_Detection_of_malicious_URLs_in_big_data_using_RIPPER_algorithm","317763961_Two_phase_classification_model_to_detect_malicious_URLs","317702529_Efficient_malicious_domain_detection_using_word_segmentation_and_BM_pattern_matching","316898604_A_large-scale_URL_filtering_algorithm_in_high-speed_flow"]}