{"id":"334744326_Cryptocurrencies_Monetary_Policy_and_New_Forms_of_Monetary_Sovereignty","abstract":"The article aims to bring to light the limits and contradictions of cryptocurrencies, as well as to investigate possible alternative uses of them. Particularly focusing on Bitcoin, understood as a benchmark for the entire sector, the authors seek to answer the following questions: Should Bitcoin be considered a currency, an investment vehicle, or a speculative asset? On which factors does Bitcoin volatility depend? Do Central Banks effectively have no power to influence/stabilize Bitcoin volatility? Following the empirical strategy proposed by Baek and Elbeck, the article shows that Bitcoin returns merely depend on financial conventions and that the cryptocurrency is acting as a highly speculative asset. Sociotechnical innovations introduced by Bitcoin, the authors argue, have concretely opened the possibility of deeply rethinking money. However, several factors are currently negatively affecting the possibility of the cryptocurrency to function as an effective means of payment. Whether this experience can pave the way for the birth of new and more democratic monetary instruments, as the article discusses, is an issue that calls into question a whole combination of political, technical and social elements.","authors":["Marco Fama","Andrea M. Fumagalli","Stefano Lucarelli"],"meta":["April 2019International Journal of Political Economy 48(2):174-194","DOI:10.1080/08911916.2019.1624318","Project: Local Clearing Unions and Complementary Currencies during the recent crisis"],"references":["329541686_A_Financialized_Monetary_Economy_of_Production","321988034_Bitcoin_Medium_of_Exchange_or_Speculative_Assets","317830259_Evaluating_complementary_currencies_from_the_assessment_of_multiple_social_qualities_to_the_discovery_of_a_unique_monetary_sociality","281983947_Monnaie_du_commun_et_revenu_social_garanti","324013888_Central_banking_in_the_twenty-first_century","323977774_Excess_Volatility_as_an_Impediment_for_a_Digital_Currency","323321960_Capital_and_language_from_the_new_economy_to_the_war_economy","316837508_Price_dynamics_and_speculative_trading_in_bitcoin","273400782_Speculative_bubbles_in_Bitcoin_markets_An_empirical_investigation_into_the_fundamental_value_of_Bitcoin","270143967_Is_Bitcoin_a_Real_Currency"]}