{"id":"334758943_El_efecto_de_la_teoria_de_carga_cognitiva_en_el_aprendizaje_de_la_programacion_basica","abstract":"El aprendizaje de la programación es un tópico difícil para los estudiantes universitarios que inician estudios en carreras afines a las ciencias de la computación. Este aprendizaje exige desarrollar habilidades de resolución de problemas mediante estructuras básicas para diseñar algoritmos y programas. De manera simultánea, el alumno debe aprender la sintaxis de un lenguaje de programación, un entorno de desarrollo integrado (IDE) y desarrollar modelos mentales correctos. La combinación de estos requerimientos frecuentemente conlleva una sobrecarga cognitiva en el estudiante. La teoría de carga cognitiva (TCG) propone mecanismos de aprendizaje para ayudar a disminuir esta sobrecarga. Uno de ellos es el “efecto del problema por completar”. El presente estudio tuvo como objetivo medir uno de los efectos predichos por la TGC. Con base en esta, se diseñó material didáctico que se utilizó en un cuasi experimento controlado (aplicado durante el segundo semestre de 2017) con dos grupos de estudiantes de primer semestre de Ingeniería en Sistemas Computacionales de la Universidad Autónoma de Aguascalientes (UAA). El grupo experimental (n = 42) utilizó el material didáctico diseñado con la TCC, y el grupo de control (n = 47) utilizó material didáctico tradicional. La prueba de diferencia de medias mostró una diferencia estadísticamente significativa (p = 0.002) entre el rendimiento final de ambos grupos. El estudio concluye que los ejercicios por completar tuvieron un efecto positivo en el aprendizaje de los alumnos del grupo experimental, permitiendo una mejor adquisición de esquemas de programación en la forma de planes de programación. Posteriores réplicas aleatorizadas permitirán corroborar o descartar el efecto encontrado.","authors":["Carlos Argelio Arévalo Mercado","Blanca Guadalupe Estrada-Rentería","Estela Lizbeth Muñoz Andrade"],"meta":["June 2019Entorno","DOI:10.5377/entorno.v0i67.7500"],"references":["326635755_El_efecto_de_la_autoeficacia_y_el_trabajo_colaborativo_en_estudiantes_novatos_de_programacion_The_effect_of_self-efficacy_and_peer_collaboration_in_novice_programming_students","309046229_Why_Can't_I_Learn_Programming_The_Learning_and_Teaching_Environment_of_Programming","295902185_A_model_for_teaching_an_introductory_programming_course_using_ADRI","321525690_Cognitive_Load_Theory","320884734_Skipping_the_Baby_Steps_The_Importance_of_Teaching_Practical_Programming_Before_Programming_Theory","292409618_The_completion_strategy_in_programming_instruction_Theoretical_and_empirical_support","249890433_Lowering_the_Barriers_to_Programming_a_survey_of_programming_environments_and_languages_for_novice_programmers","234826597_Why_students_drop_out_CS1_course","232654990_Integration_of_Visualization_Techniques_and_Completion_Strategy_to_Improve_Learning_in_Computer_Programming","232547938_Effects_of_Schema_Acquisition_and_Rule_Automation_on_Mathematical_Problem-Solving_Transfer"]}