{"id":"334780822_Large-Scale_Evolution_Strategy_Based_on_Search_Direction_Adaptation","abstract":"The covariance matrix adaptation evolution strategy (CMA-ES) is a powerful evolutionary algorithm for single-objective real-valued optimization. However, the time and space complexity may preclude its use in high-dimensional decision space. Recent studies suggest that putting sparse or low-rank constraints on the structure of the covariance matrix can improve the efficiency of CMA-ES in handling large-scale problems. Following this idea, this paper proposes a search direction adaptation evolution strategy (SDA-ES) which achieves linear time and space complexity. SDA-ES models the covariance matrix with an identity matrix and multiple search directions, and uses a heuristic to update the search directions in a way similar to the principal component analysis. We also generalize the traditional 1/5th success rule to adapt the mutation strength which exhibits the derandomization property. Numerical comparisons with nine state-of-the-art algorithms are carried out on 31 test problems. The experimental results have shown that SDA-ES is invariant under search-space rotational transformations, and is scalable with respect to the number of variables. It also achieves competitive performance on generic black-box problems, demonstrating its effectiveness in keeping a good tradeoff between solution quality and computational efficiency.","authors":["Xiaoyu He","Yuren Zhou","Zefeng Chen","Jun Zhang"],"meta":["July 2019IEEE Transactions on Cybernetics PP(99):1-15","DOI:10.1109/TCYB.2019.2928563"],"references":["319497669_A_Level-Based_Learning_Swarm_Optimizer_for_Large-Scale_Optimization","317010415_Limited-Memory_Matrix_Adaptation_for_Large_Scale_Black-box_Optimization","315304432_Low-Autocorrelation_Binary_Sequences_On_Improved_Merit_Factors_and_Runtime_Predictions_to_Achieve_Them","314654032_Simplify_Your_Covariance_Matrix_Adaptation_Evolution_Strategy","328895813_SHADE_with_Iterative_Local_Search_for_Large-Scale_Global_Optimization","320574928_A_Simple_Yet_Efficient_Evolution_Strategy_for_Large-Scale_Black-Box_Optimization","313699483_Evaluating_the_CMA_evolution_strategy_on_multimodal_test_functions","313505421_Completely_derandomized_self-adaptation_in_evolution_strategies","313108693_Acooperative_coevolutionary_approach_to_function_optimization","305160245_Toward_Large-Scale_Continuous_EDA_A_Random_Matrix_Theory_Perspective"]}