{"id":"334806091_Increasing_trend_of_scientists_to_switch_between_topics","abstract":"Despite persistent efforts in understanding the creativity of scientists over different career stages, little is known about the underlying dynamics of research topic switching that drives innovation. Here, we analyze the publication records of individual scientists, aiming to quantify their topic switching dynamics and its influence. We find that the co-citing network of papers of a scientist exhibits a clear community structure where each major community represents a research topic. Our analysis suggests that scientists have a narrow distribution of number of topics. However, researchers nowadays switch more frequently between topics than those in the early days. We also find that high switching probability in early career is associated with low overall productivity, yet with high overall productivity in latter career. Interestingly, the average citation per paper, however, is in all career stages negatively correlated with the switching probability. We propose a model that can explain the main observed features.","authors":["An Zeng","Zhesi Shen","Jianlin Zhou","Ying Fan"],"meta":["July 2019Nature Communications 10(1)","DOI:10.1038/s41467-019-11401-8","Project: Science of Science + Complex Systems"],"references":["327886798_Multiscale_impact_of_researcher_mobility","326329515_Hot_streaks_in_artistic_cultural_and_scientific_careers","323502497_Science_of_science","322246889_Document_co-citation_analysis_to_enhance_transdisciplinary_research","320681151_The_science_of_science_From_the_perspective_of_complex_systems","318418703_Network_Dynamics_of_Innovation_Processes","315446968_Quantifying_patterns_of_research-interest_evolution","314429958_Standing_on_the_shoulders_of_giants_the_effect_of_outstanding_scientists_on_young_collaborators'_careers","313594211_Standing_on_the_shoulders_of_giants","313429490_The_specificity_of_the_scientific_field_and_the_social_conditions_of_the_progres_of_reason"]}