{"id":"334813438_Improved_Deep_Hashing_With_Soft_Pairwise_Similarity_for_Multi-Label_Image_Retrieval","abstract":"Hash coding has been widely used in the approximate nearest neighbor search for large-scale image retrieval. Recently, many deep hashing methods have been proposed and shown largely improved performance over traditional feature-learning methods. Most of these methods examine the pairwise similarity on the semantic-level labels, where the pairwise similarity is generally defined in a hard-assignment way. That is, the pairwise similarity is ‘1’ if they share no less than one class label and ‘0’ if they do not share any. However, such similarity definition cannot reflect the similarity ranking for pairwise images that hold multiple labels. In this paper, an improved deep hashing method is proposed to enhance the ability of multi-label image retrieval. We introduce a pairwise quantified similarity calculated on the normalized semantic labels. Based on this, we divide the pairwise similarity into two situations -- ‘hard similarity’ and ‘soft similarity’, where cross-entropy loss and mean square error loss are adapted respectively for more robust feature learning and hash coding. Experiments on three popular datasets demonstrate that, the proposed method outperforms the competing methods and achieves the state-of-the-art performance in multi-label image retrieval.","authors":["Zheng Zhang","Qin Zou","Yuewei Lin","Long Chen"],"meta":["July 2019IEEE Transactions on Multimedia PP(99):1-1","DOI:10.1109/TMM.2019.2929957"],"references":["328649776_DeepCrack_Learning_Hierarchical_Convolutional_Features_for_Crack_Detection","329750487_Hashing_as_Tie-Aware_Learning_to_Rank","329661995_Graph_Convolutional_Network_Hashing","322281601_Unsupervised_Deep_Hashing_with_Similarity-Adaptive_and_Discrete_Optimization","322277018_Tensorflow_Large-scale_machine_learning_on_heterogeneous_distributed_systems","320971187_Deep_Cross-Modal_Hashing","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317729952_How_should_we_evaluate_supervised_hashing","317284080_Deep_Supervised_Discrete_Hashing"]}