{"id":"334843606_Feature-level_Deeper_Self-Attention_Network_for_Sequential_Recommendation","abstract":"Sequential recommendation, which aims to recommend next item that the user will likely interact in a near future, has become essential in various Internet applications. Existing methods usually consider the transition patterns between items, but ignore the transition patterns between features of items. We argue that only the item-level sequences cannot reveal the full sequential patterns, while explicit and implicit feature-level sequences can help extract the full sequential patterns. In this paper, we propose a novel method named Feature-level Deeper Self-Attention Network (FDSA) for sequential recommendation. Specifically, FDSA first integrates various heterogeneous features of items into feature sequences with different weights through a vanilla mechanism. After that, FDSA applies separated self-attention blocks on item-level sequences and feature-level sequences, respectively, to model item transition patterns and feature transition patterns. Then, we integrate the outputs of these two blocks to a fully-connected layer for next item recommendation. Finally, comprehensive experimental results demonstrate that considering the transition relationships between features can significantly improve the performance of sequential recommendation.","authors":["Tingting Zhang","Pengpeng Zhao","Yanchi Liu","Victor Sheng"],"meta":["August 2019","DOI:10.24963/ijcai.2019/600","Conference: Twenty-Eighth International Joint Conference on Artificial Intelligence {IJCAI-19}"],"references":["322968301_Personalized_Top-N_Sequential_Recommendation_via_Convolutional_Sequence_Embedding","316821219_Convolutional_Sequence_to_Sequence_Learning","269416998_Empirical_Evaluation_of_Gated_Recurrent_Neural_Networks_on_Sequence_Modeling","335685749_Character-Level_Language_Modeling_with_Deeper_Self-Attention","328381064_CSAN_Contextual_Self-Attention_Network_for_User_Sequential_Recommendation","320963613_SCA-CNN_Spatial_and_Channel-Wise_Attention_in_Convolutional_Networks_for_Image_Captioning","318336902_Translation-based_Recommendation"]}