{"id":"334853557_Cyberphysical_risks_of_hacked_internet-connected_vehicles","abstract":"The integration of automotive technology with internet connectivity promises to both dramatically improve transportation while simultaneously introducing the potential for new unknown risks. Internet-connected vehicles are like digital data because they can be targeted for malicious hacking. Unlike digital data, however, internet-connected vehicles are cyberphysical systems that physically interact with each other and their environment. As such, the extension of cybersecurity concerns into the cyberphysical domain introduces new possibilities for self-organized phenomena in traffic flow. Here we study a scenario envisioned by cybersecurity experts leading to a large number of internet-connected vehicles being suddenly and simultaneously disabled. We investigate posthack traffic using agent-based simulations and discover the critical relevance of percolation for probabilistically predicting the outcomes on a multilane road in the immediate aftermath of a vehicle-targeted cyberattack. We develop an analytic percolation-based model to rapidly assess road conditions given the density of disabled vehicles and apply it to study the street network of Manhattan (New York City, New York, USA) revealing the city's vulnerability to this particular cyberphysical attack. While a comprehensive investigation of city-scale traffic around hacked vehicles is an extremely complicated problem, we find that the statistical physics of percolation can provide an estimate of the number of vehicles that critically disrupts citywide traffic flow. Our upper-bound estimate represents a quantification of citywide traffic disruptions when multiple vehicles are hacked.","authors":["Skanda Vivek","David Yanni","Peter J. Yunker","Jesse L. Silverberg"],"meta":["July 2019PHYSICAL REVIEW E 100(1)","DOI:10.1103/PhysRevE.100.012316"],"references":["329964351_Switch_between_critical_percolation_modes_in_city_traffic_dynamics","321744931_Crossover_from_Jamming_to_Clogging_Behaviors_in_Heterogeneous_Environments","314272204_Cyber_Threats_Facing_Autonomous_and_Connected_Vehicles_Future_Challenges","313693167_Driving_with_Sharks_Rethinking_Connected_Vehicles_with_Vehicle_Cyber_Security","309738462_OSMNX_New_Methods_for_Acquiring_Constructing_Analyzing_and_Visualizing_Complex_Street_Networks","287482893_Resilience_of_Self-Organised_and_Top-Down_Planned_Cities-A_Case_Study_on_London_and_Beijing_Street_Networks","345645969_Applications_Of_Percolation_Theory","328946159_Percolation_of_hierarchical_networks_and_networks_of_networks","328076640_Introduction_to_Probability","305366048_Cyber_Security_Deception"]}