{"id":"334815475_The_GH-EXIN_neural_network_for_hierarchical_clustering","abstract":"Hierarchical clustering is an important tool for extracting information from data in a multi-resolution way. It is more meaningful if driven by data, as in the case of divisive algorithms, which split data until no more division is allowed. However, they have the drawback of the splitting threshold setting. The neural networks can address this problem, because they basically depend on data. The growing hierarchical GH-EXIN neural network builds a hierarchical tree in an incremental (data-driven architecture) and self-organized way. It is a top-down technique which defines the horizontal growth by means of an anisotropic region of influence, based on the novel idea of neighborhood convex hull. It also reallocates data and detects outliers by using a novel approach on all the leaves, simultaneously. Its complexity is estimated and an analysis of its user-dependent parameters is given. The advantages of the proposed approach, with regard to the best existing networks, are shown and analyzed, qualitatively and quantitatively, both in benchmark synthetic problems and in a real application (image recognition from video), in order to test the performance in building hierarchical trees. Furthermore, an important and very promising application of GH-EXIN in two-way hierarchical clustering, for the analysis of gene expression data in the study of the colorectal cancer is described.","authors":["Giansalvo Cirrincione","Gabriele Ciravegna","Pietro Barbiero","Vincenzo Randazzo"],"meta":["July 2019Neural networks: the official journal of the International Neural Network Society 121","DOI:10.1016/j.neunet.2019.07.018"],"references":["328399384_Nonstationary_topological_learning_with_bridges_and_convex_polytopes_the_G-EXIN_neural_network","326200086_Divisive_Hierarchical_Clustering_with_K-means_and_Agglomerative_Hierarchical_Clustering","324266360_The_Growing_Curvilinear_Component_Analysis_GCCA_neural_network","321913798_Neural_Biclustering_in_Gene_Expression_Analysis","317932988_Unsupervised_Gene_Identification_in_Colorectal_Cancer","317762662_Selective_analysis_of_cancer-cell_intrinsic_transcriptional_traits_defines_novel_clinically_relevant_subtypes_of_colorectal_cancer","320202953_A_Molecularly_Annotated_Model_of_Patient-Derived_Colon_Cancer_Stem-Like_Cells_to_Assess_Genetic_and_Nongenetic_Mechanisms_of_Resistance_to_Anti-EGFR_Therapy","319834704_Interrogating_open_issues_in_cancer_medicine_with_patient-derived_xenografts","283363875_Silhouettes_a_graphical_aid_to_the_interpretation_and_validation_of_cluster_analysis","282344111_The_Genomic_Landscape_of_Response_to_EGFR_Blockade_in_Colorectal_Cancer"]}