{"id":"334801062_Radiosensitizing_effect_of_curcumin-loaded_lipid_nanoparticles_in_breast_cancer_cells","abstract":"In breast cancer (BC) care, radiotherapy is considered an efficient treatment, prescribed both for controlling localized tumors or as a therapeutic option in case of inoperable, incompletely resected or recurrent tumors. However, approximately 90% of BC-related deaths are due to the metastatic tumor progression. Then, it is strongly desirable to improve tumor radiosensitivity using molecules with synergistic action. The main aim of this study is to develop curcumin-loaded solid nanoparticles (Cur-SLN) in order to increase curcumin bioavailability and to evaluate their radiosensitizing ability in comparison to free curcumin (free-Cur), by using an in vitro approach on BC cell lines. In addition, transcriptomic and metabolomic profiles, induced by Cur-SLN treatments, highlighted networks involved in this radiosensitization ability. The non tumorigenic MCF10A and the tumorigenic MCF7 and MDA-MB-231 BC cell lines were used. Curcumin-loaded solid nanoparticles were prepared using ethanolic precipitation and the loading capacity was evaluated by UV spectrophotometer analysis. Cell survival after treatments was evaluated by clonogenic assay. Dose–response curves were generated testing three concentrations of free-Cur and Cur-SLN in combination with increasing doses of IR (2–9 Gy). IC50 value and Dose Modifying Factor (DMF) was measured to quantify the sensitivity to curcumin and to combined treatments. A multi-“omic” approach was used to explain the Cur-SLN radiosensitizer effect by microarray and metobolomic analysis. We have shown the efficacy of the Cur-SLN formulation as radiosensitizer on three BC cell lines. The DMFs values, calculated at the isoeffect of SF = 50%, showed that the Luminal A MCF7 resulted sensitive to the combined treatments using increasing concentration of vehicled curcumin Cur-SLN (DMF: 1,78 with 10 µM Cur-SLN.) Instead, triple negative MDA-MB-231 cells were more sensitive to free-Cur, although these cells also receive a radiosensitization effect by combination with Cur-SLN (DMF: 1.38 with 10 µM Cur-SLN). The Cur-SLN radiosensitizing function, evaluated by transcriptomic and metabolomic approach, revealed anti-oxidant and anti-tumor effects. Curcumin loaded- SLN can be suggested in future preclinical and clinical studies to test its concomitant use during radiotherapy treatments with the double implications of being a radiosensitizing molecule against cancer cells, with a protective role against IR side effects.","authors":["Luigi Minafra","Nunziatina Porcino","Valentina Bravatà","Daniela Gaglio"],"meta":["July 2019Scientific Reports 9(1):11134","DOI:10.1038/s41598-019-47553-2"],"references":["330223930_Cucurmin_Anticancer_and_Antitumor_Perspectives_-_A_Comprehensive_Review","320454756_Curcumin_modulates_covalent_histone_modification_and_TIMP1_gene_activation_to_protect_against_vascular_injury_in_a_hypertension_rat_model","319471372_Mucoadhesive_solid_lipid_microparticles_for_controlled_release_of_a_corticosteroid_in_the_chronic_obstructive_pulmonary_disease_treatment","326299225_Novel_curcumin_analogue_hybrids_Synthesis_and_anticancer_activity","323763023_Radiation_therapy_for_the_whole_breast_Executive_summary_of_an_American_Society_for_Radiation_Oncology_ASTRO_evidence-based_guideline","323438522_Curcumin_restrains_hepatic_glucose_production_by_blocking_cAMPPKA_signaling_and_reducing_acetyl_CoA_accumulation_in_high-fat_diet_HFD-fed_mice","322766800_Curcumin_inhibits_the_growth_of_liver_cancer_stem_cells_through_the_phosphatidylinositol_3-kinaseprotein_kinase_Bmammalian_target_of_rapamycin_signaling_pathway","321619953_The_Molecular_Targets_and_Therapeutic_Uses_of_Curcumin_in_Health_and_Disease","319607718_Synthesis_of_water-soluble_curcumin_derivatives_and_their_inhibition_on_lysozyme_amyloid_fibrillation","319559470_Area-based_cell_colony_surviving_fraction_evaluation_A_novel_fully_automatic_approach_using_general-purpose_acquisition_hardware"]}