{"id":"334810041_A_survey_on_zero_knowledge_range_proofs_and_applications","abstract":"In last years, there has been an increasing effort to leverage distributed ledger technology (DLT), including blockchain. One of the main topics of interest, given its importance, is the research and development of privacy mechanisms, as for example is the case of zero knowledge proofs (ZKP). ZKP is a cryptographic technique that can be used to hide information that is put into the ledger, while still allowing to perform validation of this data. In this work we describe different strategies to construct zero knowledge range proofs (ZKRP), as for example the scheme proposed by Boudot (in: Bart (ed) Advances in cryptology—EUROCRYPT 2000, Springer, Berlin, 2000) in 2001; the one proposed by Camenisch et al. (in: Josef (ed) Advances in cryptology—ASIACRYPT 2008, Springer, Berlin, 2008), and bulletproofs (Bünz et al., in: 2018 IEEE symposium on security and privacy (SP), 2018), proposed in 2017. We also compare these strategies and discuss possible use cases. Since bulletproofs (Bünz et al. 2018) is the most efficient construction, we will give a detailed description of its algorithms and optimizations. Bulletproofs is not only more efficient than previous schemes, but also avoids the trusted setup, which is a requirement that is not desirable in the context of DLT and blockchain. In case of cryptocurrencies, if the setup phase is compromised, it would be possible to generate money out of thin air. Interestingly, bulletproofs can also be used to construct generic ZKP, in the sense that it can be used to prove generic statements, and thus it is not only restricted to ZKRP, but it can be used for any kind of proof of knowledge. Hence Bulletproofs leads to a more powerful tool to provide privacy for DLT. Here we describe in detail the algorithms involved in Bulletproofs protocol for ZKRP. Also, we present our implementation, which was open sourced (Morais et al., in: Zero knowledge range proof implementation, 2018. https://github.com/ing-bank/zkrangeproof).","authors":["Eduardo Morais","Tommy Koens","Cees van Wijk","Aleksei Koren"],"meta":["August 2019SN Applied Sciences 1(8)","DOI:10.1007/s42452-019-0989-z"],"references":["318125384_Accumulators_with_Applications_to_Anonymity-Preserving_Revocation","301855144_Still_Wrong_Use_of_Pairings_in_Cryptography","335349956_SgxPectre_Stealing_Intel_Secrets_from_SGX_Enclaves_Via_Speculative_Execution","335071784_Batching_Techniques_for_Accumulators_with_Applications_to_IOPs_and_Stateless_Blockchains","326643720_Bulletproofs_Short_Proofs_for_Confidential_Transactions_and_More","326565502_Lattice-Based_Zero-Knowledge_Arguments_for_Integer_Relations_38th_Annual_International_Cryptology_Conference_Santa_Barbara_CA_USA_August_19-23_2018_Proceedings_Part_II","323410716_SgxPectre_Attacks_Leaking_Enclave_Secrets_via_Speculative_Execution","318145427_Malware_Guard_Extension_Using_SGX_to_Conceal_Cache_Attacks","315861752_Removing_the_Strong_RSA_Assumption_from_Arguments_over_the_Integers","306304642_Hawk_The_Blockchain_Model_of_Cryptography_and_Privacy-Preserving_Smart_Contracts","262350866_Strictly-Black-Box_Zero-Knowledge_and_Efficient_Validation_of_Financial_Transactions","290982575_Pseudonym_systems","279379752_Practical_and_provably_secure_release_of_a_secret_and_exchange_of_signatures","273674251_The_Knowledge_Complexity_of_Interactive_Proof_Systems","262246835_Cryptography_Miracles_Secure_Auctions_Matching_Problem_Verification"]}