{"id":"334852390_Multi-Level_Comparison_of_Machine_Learning_Classifiers_and_Their_Performance_Metrics","abstract":"Machine learning classification algorithms are widely used for the prediction and classification of the different properties of molecules such as toxicity or biological activity. the prediction of toxic vs. non-toxic molecules is important due to testing on living animals, which has ethical and cost drawbacks as well. The quality of classification models can be determined with several performance parameters. which often give conflicting results. In this study, we performed a multi-level comparison with the use of different performance metrics and machine learning classification methods. Well-established and standardized protocols for the machine learning tasks were used in each case. The comparison was applied to three datasets (acute and aquatic toxicities) and the robust, yet sensitive, sum of ranking differences (SRD) and analysis of variance (ANOVA) were applied for evaluation. The effect of dataset composition (balanced vs. imbalanced) and 2-class vs. multiclass classification scenarios was also studied. Most of the performance metrics are sensitive to dataset composition, especially in 2-class classification problems. The optimal machine learning algorithm also depends significantly on the composition of the dataset.","authors":["Anita Rácz","Dávid Bajusz","Károly Héberger"],"meta":["August 2019Molecules 24(15):2811","DOI:10.3390/molecules24152811"],"references":["329767109_Best_Practices_for_QSAR_Model_Reporting_Physical_and_Chemical_Properties_Ecotoxicity_Environmental_Fate_Human_Health_and_Toxicokinetics_Endpoints","322722712_The_rise_of_deep_learning_in_drug_discovery","318037008_Which_Performance_Parameters_Are_Best_Suited_to_Assess_the_Predictive_Ability_of_Models","333069815_Stop_explaining_black_box_machine_learning_models_for_high_stakes_decisions_and_use_interpretable_models_instead","332346711_Applications_of_machine_learning_in_drug_discovery_and_development","332213137_Intercorrelation_Limits_in_Molecular_Descriptor_Preselection_for_QSARQSPR","327324509_Modelling_methods_and_cross-validation_variants_in_QSAR_a_multi-level_analysis","324926412_Performance_Measures_for_Binary_Classification","307881957_LIBSVM_A_library_for_support_vector_machines","301234386_Multivariate_assessment_of_lipophilicity_scales-computational_and_reversed_phase_thin-layer_chromatographic_indices"]}