{"id":"334854300_Gender_in_Science_Technology_Engineering_and_Mathematics_Issues_Causes_Solutions","abstract":"The landscape of gender in education and the workforce has shifted over the past decades: women have made gains in representation, equitable pay, and recognition through awards, grants, and publications. Despite overall change, differences persist in the fields of science, technology, engineering, and mathematics (STEM). This Viewpoints article on gender disparities in STEM offers an overarching perspective by addressing what the issues are, why the issues may emerge, and how the issues may be solved. In Part 1, recent data on gaps in representation, compensation, and recognition (awards, grants, publications) are reviewed, highlighting differences across subfields (e.g., computer science vs biology) and across career trajectories (e.g., bachelor's degrees vs senior faculty). In Part 2, evidence on leading explanations for these gaps, including explanations centered on abilities, preferences, and explicit and implicit bias, is presented. Particular attention is paid to implicit bias: mental processes that exist largely outside of conscious awareness and control in both male and female perceivers and female targets themselves. Given its prevalence and persistence, implicit bias warrants a central focus for research and application. Finally, in Part 3, the current knowledge is presented on interventions to change individuals' beliefs and behaviors, as well as organizational culture and practices. The moral issues surrounding equal access aside, understanding and addressing the complex issues surrounding gender in STEM are important because of the possible benefits to STEM and society that will be realized only when full participation of all capable and qualified individuals is guaranteed.","authors":["Tessa Charlesworth","Mahzarin Banaji"],"meta":["August 2019The Journal of Neuroscience : The Official Journal of the Society for Neuroscience 39(37):0475-18","DOI:10.1523/JNEUROSCI.0475-18.2019"],"references":["335406018_Committees_with_implicit_biases_promote_fewer_women_when_they_do_not_believe_gender_bias_exists","331388399_Gender_bias_in_neuroscience_Facts_consequences_and_solutions","331220114_The_changing_career_trajectories_of_new_parents_in_STEM","331046363_Sex_differences_in_variability_across_nations_in_reading_mathematics_and_science_a_meta-analytic_extension_of_Baye_and_Monseur_2016","334859550_Is_Blinded_Review_Enough_How_Gendered_Outcomes_Arise_Under_Anonymous_Evaluation","331536569_Comparison_of_National_Institutes_of_Health_Grant_Amounts_to_First-Time_Male_and_Female_Principal_Investigators","330995996_Are_gender_gaps_due_to_evaluations_of_the_applicant_or_the_science_A_natural_experiment_at_a_national_funding_agency","330890577_Subtle_Linguistic_Cues_Increase_Girls'_Engagement_in_Science","330718133_Perspective_Taking_and_Self-Persuasion_Why_Putting_Yourself_in_Their_Shoes_Reduces_Openness_to_Attitude_Change","330687789_Gender_differences_in_science_technology_engineering_and_mathematics_stem_interest_credits_earned_and_naep_performance_in_the_12th_grade"]}