{"id":"334855050_Unifying_Structural_Proximity_and_Equivalence_for_Network_Embedding","abstract":"The fundamental purpose of network embedding is to automatically encode each node in a network as a low-dimensional vector, while at the same time preserving certain characteristics of the network. Based on the nodes’ embeddings, downstream network analytic tasks like community mining, node classification, and link prediction, can then be easily implemented using traditional machine learning methods. In recent years, extensive network embedding methods have been proposed based on factorization, random walks, deep learning, and so on. However, most of them focus mainly on preserving the structural proximity of network nodes, where highly interconnected nodes in a network will be represented closely together in the embedded vector space. While in many real-world networks, existing studies have revealed that high-order organizations (e.g., network motifs and graphlets) may be related to specific network functions. In this case, nodes far apart but with a similar organization in a network (i.e., structural equivalence) may have similar network functions. Accordingly, in this paper, we present a hybrid embedding method that unifies both structural proximity and equivalence (SPaE) of a network. Specifically, we adopt the concept of graphlet degree vector (GDV) to measure structural equivalence between network nodes. Through carrying out experiments on both synthetic and real-world datasets, we evaluate the performance of the hybrid embedding method in tasks of node clustering, node classification, and visualization. The results demonstrate that the proposed SPaE method outperforms several state-of-the-art methods when the network analytic tasks are not merely related to structural proximity. Finally, we also conduct experiments to evaluate the flexibility, robustness, and parameter sensitivity of the hybrid embedding method.","authors":["Benyun Shi","Chunpeng Zhou","Hongjun Qiu","Xiaobin Xu"],"meta":["August 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2932396"],"references":["329248008_A_structural_transition_in_physical_networks","319896834_Representation_Learning_on_Graphs_Methods_and_Applications","318916856_metapath2vec_Scalable_Representation_Learning_for_Heterogeneous_Networks","318802230_Toward_online_node_classification_on_streaming_networks","318487927_Predicting_multicellular_function_through_multi-layer_tissue_networks","326502717_Learning_Structural_Node_Embeddings_via_Diffusion_Wavelets","326502388_Deep_Recursive_Network_Embedding_with_Regular_Equivalence","321306827_A_Survey_on_Network_Embedding","320885604_Enhancing_the_Network_Embedding_Quality_with_Structural_Similarity","318917040_Local_Higher-Order_Graph_Clustering"]}