{"id":"334853097_Optimizing_the_Low-Carbon_Flexible_Job_Shop_Scheduling_Problem_with_Discrete_Whale_Optimization_Algorithm","abstract":"The flexible job shop scheduling problem (FJSP) is a difficult discrete combinatorial optimization problem, which has been widely studied due to its theoretical and practical significance. However, previous researchers mostly emphasized on the production efficiency criteria such as completion time, workload, flow time, etc. Recently, with considerations of sustainable development, low-carbon scheduling problems have received more and more attention. In this paper, a low-carbon FJSP model is proposed to minimize the sum of completion time cost and energy consumption cost in the workshop. A new bio-inspired metaheuristic algorithm called discrete whale optimization algorithm (DWOA) is developed to solve the problem efficiently. In the proposed DWOA, an innovative encoding mechanism is employed to represent two sub-problems: Machine assignment and job sequencing. Then, a hybrid variable neighborhood search method is adapted to generate a high quality and diverse population. According to the discrete characteristics of the problem, the modified updating approaches based on the crossover operator are applied to replace the original updating method in the exploration and exploitation phase. Simultaneously, in order to balance the ability of exploration and exploitation in the process of evolution, six adjustment curves of a are used to adjust the transition between exploration and exploitation of the algorithm. Finally, some well-known benchmark instances are tested to verify the effectiveness of the proposed algorithms for the low-carbon FJSP.","authors":["Fei Luan","Zongyan Cai","Shuqiang Wu","Shi-Qiang (Samuel) Liu"],"meta":["August 2019","DOI:10.3390/math7080688"],"references":["328585765_Energy-Efficient_Scheduling_for_a_Job_Shop_Using_an_Improved_Whale_Optimization_Algorithm","325069183_A_dynamic_scheduling_approach_for_optimizing_the_material_handling_operations_in_a_robotic_cell","323864555_Hybrid_whale_optimization_algorithm_based_on_local_search_strategy_for_the_permutation_flow_shop_scheduling_problem","322291474_A_comparative_study_on_three_graph-based_construction_algorithms_for_multi-stage_scheduling_with_blocking","321148225_Job_shop_scheduling_with_a_combination_of_four_buffering_constraints","344960048_Green_Job_Shop_Scheduling_Problem_With_Discrete_Whale_Optimization_Algorithm","327123633_Optimizing_the_Low-Carbon_Flexible_Job_Shop_Scheduling_Problem_Considering_Energy_Consumption","324997183_Application_of_Grey_Wolf_Optimization_for_Solving_Combinatorial_Problems_Job_Shop_and_Flexible_Job_Shop_Scheduling_Cases","324498347_Beer_froth_artificial_bee_colony_algorithm_for_job-shop_scheduling_problem","323515024_Efficient_multi-objective_optimization_algorithm_for_hybrid_flow_shop_scheduling_problems_with_setup_energy_consumptions"]}