{"id":"334845867_Artificial_Intelligent_in_Healthcare","abstract":"BACKGROUND: Giant transformations are going on currently in health care, and the greatest force behind this phenomenon is data.\n\nCONTENT: Big data has arrived into medicine field, lead to potential enhancement in accountability, quality, efficiency, and innovation. Most updated, artificial intelligence (AI) and machine-learning (ML) techniques rapidly developed, bring forth the big data analysis into more useful applications, from resource allocation to complex disease diagnosis. To realize this, a very large set of health-care data is needed for algorithms training and evaluation, including patients’ treatment data, patients respond to treatment, and personal patient information, such as genetic data, family history, health behavior, and vital signs.\n\nSUMMARY: Precision Health involving preventive, predictive, personalized and precise. The arrival of AI and ML will enhance and facilitates the improvement of this relationship through better accuracy, productivity, and workflow, thus develop a health system that will go beyond just curing disease, but further into wellness that preventing disease before it strikes, thus the patient–doctor bond is expected to be reformed and not be eroded.\n\nKEYWORDS: artificial intelligence, machine learning, deep learning, electronic health records, big data","authors":["Anna Meiliana","Nurrani Mustika Dewi","Andi Wijaya"],"meta":["August 2019The Indonesian Biomedical Journal 11(2)","DOI:10.18585/inabj.v11i2.844"],"references":["330880005_A_Hybrid_Recommender_System_for_Patient-Doctor_Matchmaking_in_Primary_Care","330203264_A_guide_to_deep_learning_in_healthcare","330203254_Screening_for_cardiac_contractile_dysfunction_using_an_artificial_intelligence-enabled_electrocardiogram","329484465_Promise_and_Perils_of_Big_Data_and_Artificial_Intelligence_in_Clinical_Medicine_and_Biomedical_Research","332476419_End-to-End_Differentiable_Learning_of_Protein_Structure","330203339_Artificial_intelligence_for_the_electrocardiogram","330203267_High-performance_medicine_the_convergence_of_human_and_artificial_intelligence","330203112_A_call_for_deep-learning_healthcare","330203110_Privacy_in_the_age_of_medical_big_data","328370090_Realizing_private_and_practical_pharmacological_collaboration"]}