{"id":"334812241_Viability_in_Multiplex_Lexical_Networks_and_Machine_Learning_Characterizes_Human_Creativity","abstract":"Previous studies have shown how individual differences in creativity relate to differences in the structure of semantic memory. However, the latter is only one aspect of the whole mental lexicon, a repository of conceptual knowledge that is considered to simultaneously include multiple types of conceptual similarities. In the current study, we apply a multiplex network approach to compute a representation of the mental lexicon combining semantics and phonology and examine how it relates to individual differences in creativity. This multiplex combination of 150,000 phonological and semantic associations identifies a core of words in the mental lexicon known as viable cluster, a kernel containing simpler to parse, more general, concrete words acquired early during language learning. We focus on low (N = 47) and high (N = 47) creative individuals' performance in generating animal names during a semantic fluency task. We model this performance as the outcome of a mental navigation on the multiplex lexical network, going within, outside, and in-between the viable cluster. We find that low and high creative individuals differ substantially in their access to the viable cluster during the semantic fluency task. Higher creative individuals tend to access the viable cluster less frequently, with a lower uncertainty/entropy, reaching out to more peripheral words and covering longer multiplex network distances between concepts in comparison to lower creative individuals. We use these differences for constructing a machine learning classifier of creativity levels, which leads to an accuracy of 65.0 ± 0.9% and an area under the curve of 68.0 ± 0.8%, which are both higher than the random expectation of 50%. These results highlight the potential relevance of combining psycholinguistic measures with multiplex network models of the mental lexicon for modelling mental navigation and, consequently, classifying people automatically according to their creativity levels.","authors":["Massimo Stella","Yoed Nissan Kenett"],"meta":["July 2019Big Data and Cognitive Computing 3(3)","DOI:10.3390/bdcc3030045","Projects: Cognitive Networks and Data Science approaches to understanding cognitionSemantic networks and creativity"],"references":["333838374_Cognitive_Network_Science_A_Review_of_Research_on_Cognition_through_the_Lens_of_Network_Representations_Processes_and_Dynamics","332823564_Analyzing_Knowledge_Retrieval_Impairments_Associated_with_Alzheimer's_Disease_Using_Network_Analyses","330609901_Modelling_Early_Word_Acquisition_through_Multiplex_Lexical_Networks_and_Machine_Learning","329079116_Bots_increase_exposure_to_negative_and_inflammatory_content_in_online_social_systems","328158725_The_Small_World_of_Words_English_word_association_norms_for_over_12000_cue_words","327726351_Cohort_and_Rhyme_Priming_Emerge_from_the_Multiplex_Network_Structure_of_the_Mental_Lexicon","327405237_Forward_Flow_A_New_Measure_to_Quantify_Free_Thought_and_Predict_Creativity","344739319_Hunters_busybodies_and_the_knowledge_network_building_associated_with_curiosity","337741405_The_multiplex_structure_of_the_mental_lexicon_influences_picture_naming_in_people_with_aphasia","331303638_A_Semantic_Network_Cartography_of_the_Creative_Mind"]}