{"id":"334812794_Mapping_Human_Settlements_with_Higher_Accuracy_and_Less_Volunteer_Efforts_by_Combining_Crowdsourcing_and_Deep_Learning","abstract":"Reliable techniques to generate accurate data sets of human built-up areas at national, regional, and global scales are a key factor to monitor the implementation progress of the Sustainable Development Goals as defined by the United Nations. However, the scarce availability of accurate and up-to-date human settlement data remains a major challenge, e.g., for humanitarian organizations. In this paper, we investigated the complementary value of crowdsourcing and deep learning to fill the data gaps of existing earth observation-based (EO) products. To this end, we propose a novel workflow to combine deep learning (DeepVGI) and crowdsourcing (MapSwipe). Our strategy for allocating classification tasks to deep learning or crowdsourcing is based on confidence of the derived binary classification. We conducted case studies in three different sites located in Guatemala, Laos, and Malawi to evaluate the proposed workflow. Our study reveals that crowdsourcing and deep learning outperform existing EO-based approaches and products such as the Global Urban Footprint. Compared to a crowdsourcing-only approach, the combination increased the quality (measured by Matthew’s correlation coefficient) of the generated human settlement maps by 3 to 5 percentage points. At the same time, it reduced the volunteer efforts needed by at least 80 percentage points for all study sites. The study suggests that for the efficient creation of human settlement maps, we should rely on human skills when needed and rely on automated approaches when possible.","authors":["Benjamin Herfort","Hao Li","Sascha Fendrich","Sven Lautenbach"],"meta":["July 2019Remote Sensing 11(15):1799","DOI:10.3390/rs11151799","Projects: OSMLanduse - LULC data from VGI/OpenStreetMap(V)GI for Humanitarian AidOpenStreetMap Data Quality Analytics (VGI Big Spatial Data Analytics)Deep Learning with Volunteered Geographic Information (esp. OSM)AGORA: A Geospatial Open Collaborative Approach for Building Resilience against  Disasters and Extreme Events"],"references":["332980026_Estimating_OpenStreetMap_Missing_Built-up_Areas_using_Pre-trained_Deep_Neural_Networks","329610478_Correcting_rural_building_annotations_in_OpenStreetMap_using_convolutional_neural_networks","328467995_Exploiting_deep_learning_and_volunteered_geographic_information_for_mapping_buildings_in_Kano_Nigeria","326887893_Volunteered_Geographic_Information_for_Disaster_Risk_Reduction-The_Missing_Maps_Approach_and_Its_Potential_within_the_Red_Cross_and_Red_Crescent_Movement","322411905_DeepVGI_Deep_Learning_with_Volunteered_Geographic_Information","321901984_Mapping_the_world_population_one_building_at_a_time","340180048_Statsmodels_Econometric_and_Statistical_Modeling_with_Python","331402961_The_impact_of_class_imbalance_in_classification_performance_metrics_based_on_the_binary_confusion_matrix","328059967_Deep_Learning_From_Multiple_Crowds_A_Case_Study_of_Humanitarian_Mapping","322278874_Deep_Learning_in_Remote_Sensing_A_Comprehensive_Review_and_List_of_Resources"]}