{"id":"334859076_Comparison_of_path_following_controllers_for_autonomous_vehicles","abstract":"The driver assistance systems becomes more\ncommon in today’s vehicles, and in the future highly\nautomated vehicles and large number of autonomous vehicles\nwill appear in roads. In the beginning these systems only\nsupport the human driver, but later they will able to control\nthe vehicle driving. Hence vehicles have to plan the path, and\nfollow it accurately and safely. Furthermore it has to provide\nconvenience for the passengers. To find a better trajectory\nfollowing controller first it is necessary to test it in simulation\nenvironment, then to test it in real environment in a vehicle.\nThe subject of this article is an implementation of a lateral\ndynamic bicycle model, and an implementation of different\ncontrollers.Besides it will contain the testing of the controllers.\nIf the controllers work with sufficient precision in the\nsimulation, it will be tested in a real vehicle. The essence of the\ntest is the speed limit, where the simulation and the real test\nstarting to deviate. In the end of the article we compare the\nperformance of the different controllers and evaluate which is\nthe most appropriate. Besides the difference will also be\nevaluated between the simulated results and the results on the\nreal vehicle. This comparison reveal which is the speed limit, as\nlong as the values calculated on the lateral dynamic bicycle\nmodel approximate the actual results in a simulation\nenvironment with sufficient precision","authors":["Ádám Domina","Viktor Tihanyi"],"meta":["January 2019","DOI:10.1109/SAMI.2019.8782719","Conference: 2019 IEEE 17th World Symposium on Applied Machine Intelligence and Informatics (SAMI)"],"references":["340476858_Investigation_of_Autonomous_Vehicles_Fit_into_Traditional_Type_Approval_Process","327976435_Legal_Barriers_of_Utilization_of_Autonomous_Vehicles_as_Part_of_Green_Mobility","327976418_The_Significance_and_Effect_of_the_Traffic_System_Signaling_to_the_Environment_Present_and_Future_Traffic","327014170_Traffic_sign_anomalies_and_their_effects_to_the_highly_automated_and_autonomous_vehicles","301817071_A_Survey_of_Motion_Planning_and_Control_Techniques_for_Self-Driving_Urban_Vehicles","260870018_Stanley_The_robot_that_won_the_DARPA_Grand_Challenge","255036858_Automatic_Steering_Methods_for_Autonomous_Automobile_Path_Tracking"]}