{"id":"334860261_A_Hybrid_Bidirectional_Recurrent_Convolutional_Neural_Network_Attention-Based_Model_for_Text_Classification","abstract":"Text classification task is an important application in natural language processing. At present, deep learning models such as convolutional neural network and recurrent neural network have achieved good results for this task, but the multi-class text classification and the fine-grained sentiment analysis are still challenging. In this paper, we propose a hybrid bidirectional recurrent convolutional neural network attention-based model to address this issue, which named BRCAN. The model combines the bidirectional long short-term memory and convolutional neural network with the attention mechanism and word2vec to achieve the fine-grained text classification task. In our model, we apply word2vec to generate word vectors automatically and a bidirectional recurrent structure to capture contextual information and long-term dependence of sentences. We also employ a maximum pool layer of convolutional neural network that judges which words play an essential role in text classification, and use the attention mechanism to give them higher weights to capture the key components in texts. We conduct experiments on four datasets, including Yahoo! Answers, Sogou News of the topic classification, Yelp Reviews and Douban Movies Top250 short reviews of the sentiment analysis. And the experimental results show that BRCAN outperforms the state-of-the-art models.","authors":["Jin Zheng","Limin Zheng"],"meta":["August 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2932619"],"references":["326786097_A_Compact_Encoding_for_Efficient_Character-level_Deep_Text_Classification","321686502_Efficient_Deep_Learning_Model_for_Text_Classification_Based_on_Recurrent_and_Convolutional_Layers","334117998_Hierarchical_Convolutional_Attention_Networks_for_Text_Classification","334116229_Disconnected_Recurrent_Neural_Networks_for_Text_Categorization","330265907_A_Single_Attention-Based_Combination_of_CNN_and_RNN_for_Relation_Classification","328170576_A_Character-Level_Method_for_Text_Classification","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","318742463_Very_Deep_Convolutional_Networks_for_Text_Classification","318739363_Deep_Pyramid_Convolutional_Neural_Networks_for_Text_Categorization","314256110_Generative_and_Discriminative_Text_Classification_with_Recurrent_Neural_Networks"]}