{"id":"334898269_An_analytical_study_of_large_SPARQL_query_logs","abstract":"With the adoption of RDF as the data model for Linked Data and the Semantic Web, query specification from end users has become more and more common in SPARQL endpoints. In this paper, we conduct an in-depth analytical study of the queries formulated by end users and harvested from large and up-to-date structured query logs from a wide variety of RDF data sources. As opposed to previous studies, ours is the first assessment on a voluminous query corpus, spanning over several years and covering many representative SPARQL endpoints. Apart from the syntactical structure of the queries that exhibits already interesting results on this generalized corpus, we drill deeper in the structural characteristics related to the graph and hypergraph representation of queries. We outline the most common shapes of queries when visually displayed as undirected graphs and characterize their treewidth, length of their cycles, maximal degree of nodes, and more. For queries that cannot be adequately represented as graphs, we investigate their hypergraphs and hypertreewidth. Moreover, we analyze the evolution of queries over time, by introducing the novel concept of a streak, i.e., a sequence of queries that appear as subsequent modifications of a seed query. Our study offers several fresh insights on the already rich query features of real SPARQL queries formulated by real users and brings us to draw a number of conclusions and pinpoint future directions for SPARQL query evaluation, query optimization, tuning, and benchmarking.","authors":["Angela Bonifati","Wim Martens","Thomas Timm"],"meta":["May 2020The VLDB Journal 29(4)","DOI:10.1007/s00778-019-00558-9"],"references":["316848788_The_Dynamic_Yannakakis_Algorithm_Compact_and_Efficient_Query_Processing_Under_Updates","315713378_Jdrasil_A_Modular_Library_for_Computing_Tree_Decompositions","335959250_A_trichotomy_for_regular_simple_path_queries_on_graphs","333060356_Navigating_the_Maze_of_Wikidata_Query_Logs","327711188_Getting_the_Most_Out_of_Wikidata_Semantic_Technology_Usage_in_Wikipedia's_Knowledge_Graph_17th_International_Semantic_Web_Conference_Monterey_CA_USA_October_8-12_2018_Proceedings_Part_II","326636470_Minimization_of_Tree_Patterns","320678821_EmptyHeaded_A_Relational_Engine_for_Graph_Processing","320280113_Enumeration_Problems_for_Regular_Path_Queries","318849581_An_analytical_study_of_large_SPARQL_query_logs","314502570_Revisiting_redundancy_and_minimization_in_an_XPath_fragment","312631543_Optimal_implementation_of_conjunctive_queries_in_relational_data_bases","310831031_GMark_Schema-Driven_Generation_of_Graphs_and_Queries","309310168_What_SPARQL_Query_Logs_Tell_and_Do_Not_Tell_About_Semantic_Relatedness_in_LOD","304457435_Old_techniques_for_new_join_algorithms_A_case_study_in_RDF_processing","304055047_On_the_statistical_analysis_of_practical_SPARQL_queries"]}