{"id":"334904462_Jump_to_the_Next_Level_A_Four-Year_Gamification_Experiment_in_Information_Technology_Engineering","abstract":"Higher education in Spain has to deal with constant troubles and uncertainties due to the economic crisis, high rates of unemployment in young people, lack for study habits in secondary school and legal fluctuations. This uncertain environment does not foster student effort and it is behind the important rates of abandon in higher education. The Bologna Process was thought to create a new paradigm in higher education in the European Union. However, the changes came from the top (governments) to the bottom (lectures and students) so they were not properly supported by specialized training oriented to lecturers. It did not include the appropriate changes in lower education stages (secondary education) to prepare student when facing University. Therefore, in the past decade several new teaching methodologies have appeared to deal with student demotivation and to fight against dropouts. Those methodologies try to keep the students engaged during the whole course paying more attention to their learning process, attitudes, motivations and expectations. Consequently, in this paper, we present a four-year experiment whose main objective is to keep students engaged during the whole year and to foster their motivation in order to increase their learning outcomes. The experiment is based on the application of gamification to the assessment process emulating a traditional platform video-game, like Super Mario. The results show that this experiment was positive for most students who achieved good marks and good rates of task completion.","authors":["Juan Carlos Cuevas-Martínez","Antonio Jesus Yuste Delgado","Jose Manuel Perez-Lorenzo","Alicia Triviño"],"meta":["August 2019IEEE Access 7:1-1","DOI:10.1109/ACCESS.2019.2932803"],"references":["332588680_Reflection_Benefits_of_Gamification_in_Online_Higher_Education","331539529_Gamification_in_MOOCs_Engagement_Application_Test_in_Energy_Sustainability_Courses","324301355_Computer_Programming_Learning_How_to_Apply_Gamification_on_Online_Courses","317375010_Elevating_Learner_Achievement_Using_Formative_Electronic_Lab_Assessments_in_the_Engineering_Laboratory_A_Viable_Alternative_to_Weekly_Lab_Reports","316314400_The_Bologna_process_and_the_search_for_excellence_between_rhetoric_and_reality_the_emotional_reactions_of_teachers","331591026_Engineering_Education_in_Spain_Has_it_improved_with_the_Bologna_Process","325358122_Engineering_education_in_Spain_Seven_years_with_the_Bologna_Process_First_results","316425306_Using_role-playing_games_to_broaden_engineering_education","309671943_Two-tier_assessment_based_on_collaboration_and_competition_to_enhance_engineering_students'_motivation","305796881_Bologna_Process_Implementation_Problems"]}