{"id":"334973735_Corrective_factors_for_author-_and_journal-based_metrics_impacted_by_citations_to_accommodate_for_retractions","abstract":"Citation-based metrics are frequently used to evaluate the level, or quality, of a researcher, or their work, often as a function of the ranking of the journal in which they publish, and broadly tend to be divided into journal-based metrics (JBMs) and author-based metrics (ABMs). Despite wide knowledge of the gaming of such metrics, in particular the Clarivate Analytics journal impact factor (JIF), no suitable substitute concept has yet emerged, nor has any corrective measure been developed. In a post-publication peer review world of increasing retractions, and within a framework of open science, we propose correction factors for JBMs and ABMs that take into account retractions. We describe ways to correct the JIF, CiteScore, the 5-year Impact Factor, Immediacy Index, Cited Half-Life, Raw Impact per Paper and other JBMs (Eigenfactor Score and Article Influence Score) as well as the h-index, one of the most widespread ABMs, depending on the number of retractions for that journal or individual, respectively. The existence of such corrective factors could make the use of these metrics more transparent, and might allow them to be used in a world that is adapting to an increase in retractions and corrective measures to deal with erroneous scientific literature. We caution that such correction factors should be used exclusively as such, and should not be viewed, or used, as punitive factors.","authors":["Judit Dobránszki","Jaime A. Teixeira da Silva"],"meta":["September 2019Scientometrics 121(1):387–398","DOI:10.1007/s11192-019-03190-0"],"references":["333775519_Is_the_soundness-only_quality_control_policy_of_open_access_mega_journals_linked_to_a_higher_rate_of_published_errors","332147077_Ending_the_retraction_stigma_Encouraging_the_reporting_of_errors_in_the_biomedical_record","329383119_Current_concepts_on_bibliometrics_a_brief_review_about_impact_factor_Eigenfactor_score_CiteScore_SCImago_Journal_Rank_Source-Normalised_Impact_per_Paper_H-index_and_alternative_metrics","327113818_The_Impact_Factor_Fallacy","326019554_Academics_must_list_all_publications_on_their_CV","325613145_Citing_Retracted_Papers_Affects_Education_and_Librarianship_so_Distorted_Academic_Metrics_Need_a_Correction","333431127_Correcting_the_Scientific_Record_Retraction_Practices_in_Chemistry_and_Materials_Science","326525013_The_Google_Scholar_h-index_useful_but_burdensome_metric","325759862_Temporal_characteristics_of_retracted_articles","325094659_Citation_inflation_the_effect_of_not_correcting_the_scientific_literature_sufficiently_a_case_study_in_the_plant_sciences"]}