{"id":"334904435_An_Improved_Faster_R-CNN_for_Small_Object_Detection","abstract":"With the increase of training data and the improvement of machine performance, the object detection method based on convolutional neural network (CNN) has become the mainstream algorithm in field of the current object detection. However, due to the complex background, occlusion and low resolution, there are still problems of small object detection. In this paper, we propose an improved algorithm based on faster region-based CNN (Faster R-CNN) for small object detection. Using the two-stage detection idea, in the positioning stage, we propose an improved loss function based on intersection over Union (IoU) for bounding box regression, and use bilinear interpolation to improve the regions of interest (RoI) pooling operation to solve the problem of positioning deviation, in the recognition stage, we use the multi-scale convolution feature fusion to make the feature map contain more information, and use the improved non-maximum suppression (NMS) algorithm to avoid loss of overlapping objects. The results show that the proposed algorithm has good performance on traffic signs whose resolution is in the range of (0, 32], the algorithm’s recall rate reaches 90%, and the accuracy rate reaches 87%. Detection performance is significantly better than Faster R- CNN. Therefore, our algorithm is an effective way to detect small objects.","authors":["Changqing Cao","Bo Wang","Wenrui Zhang","Xiaodong Zeng"],"meta":["August 2019IEEE Access 7:1-1","DOI:10.1109/ACCESS.2019.2932731"],"references":["325268539_Small_Object_Detection_in_Optical_Remote_Sensing_Images_via_Modified_Faster_R-CNN","311610541_Traffic-Sign_Detection_and_Classification_in_the_Wild","307970212_Object_Recognition_and_Robot_Grasping_A_Deep_Learning_based_Approach","333431782_Multi-Scale_Faster-RCNN_Algorithm_for_Small_Object_Detection","320964426_Perceptual_Generative_Adversarial_Networks_for_Small_Object_Detection","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","304409163_Aggregating_Local_Deep_Features_for_Image_Retrieval","301921832_Fully_convolutional_networks_for_semantic_segmentation","277920666_Region-Based_Convolutional_Networks_for_Accurate_Object_Detection_and_Segmentation"]}