{"id":"334965113_Investigating_the_effect_of_clinical_history_before_electrocardiogram_interpretation_on_the_visual_behavior_and_interpretation_accuracy_of_clinicians","abstract":"We examine the impact of the presentation of a patient’s clinical history on subsequent visual appraisal and interpretation accuracy of electrocardiograms (ECGs). Healthcare-practitioners (N = 31) skilled in 12-lead ECG interpretation took part in a repeated-measures experiment with counterbalancing viewing 9 ECGs on a computer screen in two separate conditions: with/without an associated patient-history. A Hellinger-distance calculation was applied using a permutation test to eye-movement transitions at two granularity levels: between the ECG leads, and between smaller grid-cells, whose size was determined via data-driven clustering of the fixation points. Findings indicate that presentation of clinical-history does affect accuracy of interpretation in one ECG. Visual-behavior differed as a function of both history presentation and accuracy when considering transitions between the data-driven grid units (using a fine granularity, and able to show attention to parts of the waveform). Differences in visual-behavior at waveform level demonstrate an influence of patient-history and expertise that are not detected at the lead level. Visual-behaviour differs according to whether a patient-history is presented, and whether a clinician provides an accurate interpretation. This difference is evident in how the waveform itself is viewed, and is less present at the coarse granularity of visual transitions between leads. To understand how clinicians interpret ECGs, and potentially other medical images, visual transitions should be considered at a fine level of granularity, determined in a data-driven fashion.","authors":["Alan Davies","Simon Harper","Markel Vigo","Caroline Jay"],"meta":["August 2019Scientific Reports 9(11):1-10","DOI:10.1038/s41598-019-47830-0","Project: GazeMod"],"references":["323129191_Does_descriptive_text_change_how_people_look_at_art_A_novel_analysis_of_eye-movements_using_data-driven_Units_of_Interest","311422588_Exploring_the_Relationship_Between_Eye_Movements_and_Electrocardiogram_Interpretation_Accuracy_OPEN","261555113_Give_Me_Gestalt_Preference_for_Cubist_Artworks_Revealing_High_Detectability_of_Objects","254913339_Eye_Tracking_A_Comprehensive_Guide_To_Methods_And_Measures","319231591_Computer-Interpreted_Electrocardiograms","306017825_Analysis_of_Eye_Movements_with_Eyetrace","305172497_Marriott's_practical_electrocardiography_Twelfth_edition","303767477_Starting_to_Read_ECGs_A_Comprehensive_Guide_to_Theory_and_Practice","284094682_Eyewitness_to_history_-_Landmarks_in_the_development_of_computerized_electrocardiography","264628013_Assessing_computerized_eye_tracking_technology_for_gaining_insight_into_expert_interpretation_of_the_12-lead_electrocardiogram_An_objective_quantitative_approach"]}