{"id":"334974956_Live-UMLRT_A_Tool_for_Live_Modeling_of_UML-RT_Models","abstract":"In the context of Model-driven Development (MDD) models can be executed by interpretation or by the translation of models into existing programming languages, often by code generation. This work presents Live-UMLRT, a tool that supports live modeling of UML-RT models when they are executed by code generation. Live-UMLRT is entirely independent of any live programming support offered by the target language. This independence is achieved with the help of a model transformation which equips the model with support for, e.g., debugging and state transfer both of which are required for live modeling. A subsequent code generation then produces a self-reflective program that allows changes to the model elements at runtime (through synchronization of design and runtime models). We have evaluated Live-UMLRT on several use cases. The evaluation shows that (1) code generation, transformation, and state transfer can be carried out with reasonable performance, and (2) our approach can apply model changes to the running execution faster than the standard approach that depends on the live programming support of the target language. A demonstration video: https://youtu.be/6GrR-Y9je7Y","authors":["Mojtaba Bagherzadeh","Karim Jahed","Benoit Combemale","Juergen Dingel"],"meta":["August 2019","DOI:10.1109/MODELS-C.2019.00115","Conference: MODELS '19 Proceedings of the 22st ACM/IEEE International Conference on Model Driven Engineering Languages and Systems: Companion ProceedingsAt: Munich, Germany","Project: MDebugger"],"references":["328613936_A_Multi-Paradigm_Modelling_approach_to_live_modelling","325730367_The_road_to_live_programming_insights_from_the_practice","324417098_Execution_of_UML_models_a_systematic_review_of_research_and_practice","322977279_Survey_and_Classification_of_Model_Transformation_Tools","322977102_MDebugger_a_model-level_debugger_for_UML-RT","318325191_Model-Level_Platform-Independent_Debugging_in_the_Context_of_the_Model-Driven_Development_of_Real-Time_Systems","328505350_Constraint-based_run-time_state_migration_for_live_modeling","291970256_Live_Programming_for_Event-Based_Languages","272030492_An_executable_formal_semantics_for_UML-RT","262426142_Usable_live_programming"]}