{"id":"334944313_Students'_Needs_for_Academic_Writing_at_the_English_Education_Department","abstract":"There are some demand and facts on English teching and learning that made the research conducted. They are the teaching and learning in the academic writing class, the feedback from lecturers on the students language performance, the students’ weaknesses in writing, the students’ expectation for the materials, and the requirement on publishing scientific articles. The study, then, reveals the students’ needs for academic writing at the English Education Department of Ahmad Dahlan University and their problems in academic writing. The aspects investigated were teaching materials, learning activities, skills and learning resources. The data were obtained by a questionnaire to describe whether the stated items very interesting/very important – not very interesting/not very important. The number of population is 370. Krejcie and Morgan table was referred for the sample. An open question was responded to enable respondents to share more feedback on their academic writing skills and problems. The results show that the materials designed by the Department are worth to teach. Further, interesting learning activities include getting feedback from the lecturer and peers, and in-class writing practice. In relation to writing, the students confirm the importance of essay elements and academic work, outlining, paraphrasing and producing complete academic writing. Another finding is priority to use textbooks, references from the internet and journals. The last is that the students have problems in developing ideas, grammar, vocabulary, and language expressions.","authors":["Nur Fatimah"],"meta":["July 2019English Language Teaching Educational Journal 1(3):161","DOI:10.12928/eltej.v1i3.744"],"references":["344594981_Ten_Steps_in_Planning_a_Writing_Course_and_Training_Teachers_of_Writing","344503702_The_Writing_Process_and_Process_Writing","344493918_Second_Language_Writing","287475698_Ideas_and_Options_in_English_for_Specific_Purposes","287283844_What_English_language_teachers_need_to_know_Volume_II_Facilitating_learning","286284895_Second_language_writing_and_research_The_writing_process_and_error_analysis_in_student_texts","259419191_Materials_development_for_language_learning_and_teaching","249251781_How_to_Teach_English_with_Technology_Blended_Learning","247866198_The_elements_of_language_curriculum","225084102_Academic_writing_a_practical_guide_for_students"]}