{"id":"334944880_Developing_English_for_Specific_Purposes_ESP_Module_for_Computer_Science_Students_Vocabulary_Mastery","abstract":"This research development aimed to develop as a learning media of Module to students of Compter Science, to determine the feasibility of Module which is developed as a learning media using the assessment from the experts, and to determine the students’ response to media esp Module in improving Vocabulary Mastery. Research and Development (R&D) used in this study was conducted using the ADDIE model (Analysis, Design, Development, Implementation, and Evaluation). The results obtained from 5 phases include Analysis, Design, Development, Implementation, and Evaluation. Assessing the feasibility of Module showed the following: 1) The material experts and the lecturer of Computer Science gave percentage of 69,63% in the range 66.67% <p~ ≤ 80% which means developed media gets “B” score and the category is “GOOD”. 2)The media experts and the lecturer of Computer Science gave percentage of 75,3% in the range 66.67% <p~ ≤ 80% which means developed media gets “B” score and the category is “GOOD”. 3) questionnaire response that has been filled by the students of Computer Science obtained a total number is 2034 and percentage 69,63% which lies in the range 60<P≤80%, module got the “B” value the category is “positive”. 4) The students’ response to media esp module in improving Vocabulary Mastery at Computer Science was gotten from the interview, The results of interviews to the students’ as a whole showed a good response to the use of module learning media in the learning process of Computer Science. Therefore, the researcher can conclude that the module for Computer Science is applicable and can be used as instructional media to teach English in the class.","authors":["Fitri Palupi Kusumawati"],"meta":["November 2018English Language Teaching Educational Journal 1(1):13","DOI:10.12928/eltej.v1i1.142"],"references":["271015410_Oxford_advanced_learner's_dictionary_of_current_English"]}