{"id":"334965398_Sindhi_Handwritten-Digits_Recognition_Using_Machine_Learning_Techniques","abstract":"This study presents Sindhi Handwritten Digits Recognition using machine learning approaches. The purpose of this study is to explore the different ML techniques to identify its significance in the field of Sindhi handwritten digits recognition. Handwritten digits recognition is one of the important fields in Computer Science. In the past, a lot of research work has been carried out regarding the recognition of digits as well as the characters in various languages like Urdu, English, Chinese, and Arabic. The literature review suggests that limited work has been done on the Sindhi language. In this study, the model is designed for the recognition of Sindhi handwritten digits using K Nearest Neighbor, Decision Tree, Multilayer Perception and Random Forest Classifier. It is found that the performance of the Random Forest Classifier and Decision Tree on Sindhi Digits are more effective as compared to other approaches. The study helps for improving the automatic learning for Sindhi handwritten digits. It is recommended that RF and DT Classifiers should be used in Sindhi handwritten digits recognition. In the future, this research will pave the way to recognize Sindhi characters through deep learning models.","authors":["Irfan Ali","Insaf Ali","Subhash Guriro","Asif Khan"],"meta":["August 2019International Journal of Computer Network and Information Security , VOL.19(No.5,):pp. 195-201"],"references":["322696215_Classification_Algorithms_for_Determining_Handwritten_Digit","320546990_Multi-Digit_Handwritten_Sindhi_Numerals_Recognition_using_SOM_Neural_Network","301835636_evt_MNIST_A_spike_based_version_of_traditional_MNIST","222834590_Handwritten_digit_recognition_Benchmarking_of_state-of-the-art_techniques","309076254_Gradientbased_learning_applied_to_document_recognition","271157554_Digit_Recognition_System_by_using_Back_Propagation_Algorithm","270663502_Random_Forests","260637319_The_MNIST_Database_of_Handwritten_Digit_Images_for_Machine_Learning_Research_Best_of_the_Web","235961479_Classification_and_Regression_Trees","223507927_Handwritten_Bangla_numeral_recognition_system_and_its_application_to_postal_automation"]}