{"id":"335082600_Sources_of_Male_and_Female_Students'_Belonging_Uncertainty_in_the_Computer_Sciences","abstract":"Belonging uncertainty, defined as the general concern about the quality of one’s social relationships in an academic setting, has been found to be an important determinant of academic achievement and persistence. However, to date, only little research investigated the sources of belonging uncertainty. To address this research gap, we examined three potential sources of belonging uncertainty in a sample of undergraduate computer science students in Germany (N = 449) and focused on (a) perceived affective and academic exclusion by fellow students, (b) domain-specific academic self-efficacy beliefs, and (c) perception of one’s individual performance potential compared to that of fellow students in the field. Perceived affective and academic exclusion by fellow students and domain-specific academic self-efficacy beliefs were significant predictors of female students’ uncertainty about belonging in computer science. The perception of one’s individual performance potential in comparison to that of fellow students, however, was a relevant predictor of both male and female students’ belonging uncertainty in computer science. Our findings imply an expanded view of the theoretical concept of belonging uncertainty that goes beyond mere concerns of social connectedness.","authors":["Elisabeth Höhne"],"meta":["July 2019Frontiers in Psychology 10","DOI:10.3389/fpsyg.2019.01740"],"references":["324067902_Improving_Present_Practices_in_the_Visual_Display_of_Interactions","316991044_The_Impact_of_Gender_Stereotypes_on_the_Self-Concept_of_Female_Students_in_STEM_Subjects_with_an_Under-Representation_of_Females","306104447_Not_Feeling_Good_in_STEM_Effects_of_Stereotype_Activation_and_Anticipated_Affect_on_Women's_Career_Aspirations","337398912_Belonging_uncertainty_as_predictor_of_dropout_intentions_among_first-semester_students_of_the_computer_sciences","330436273_The_Social_Identity_Theory_of_Intergroup_Behavior_Key_Readings","326137674_The_Murky_Distinction_Between_Self-Concept_and_Self-Efficacy_Beware_of_Lurking_Jingle-Jangle_Fallacies","325670689_Effects_of_social_exclusion_on_cognitive_processes_Anticipated_aloneness_reduces_intelligent_thought","323424582_Statistical_power_analysis_for_the_behavioral_sciences","316944239_Effect_of_self-efficacy_in_stereotype_activation","316823281_Self-efficacy_the_exercise_of_control"]}