{"id":"335057825_Acciones_Institucionales_para_Introducir_y_Promover_la_Justicia_en_la_Educacion_Superior_El_Caso_de_la_Universidad_del_Rosario_Colombia","abstract":"Esta comunicación presenta de forma sucinta dos experiencias educativas que actualmente se desarrollan en el departamento de Matemáticas Aplicadas y Ciencias de la Computación (MACC) de la Universidad del Rosario de Colombia: la asignatura Ideas matemáticas y el proyecto Creación de un modelo sensible que responda a cómo involucrar aspectos de justicia social en educación. Estas dos propuestas se gestan en un marco educativo que reclama la humanización de las matemáticas, ciencia que por su naturaleza exacta se ha comprendido erróneamente como independiente de lo social. Las iniciativas aquí expuestas tienen como propósito disminuir la influencia negativa que tienen sobre los estudiantes sus imaginarios en relación con las matemáticas, a su vez, la presenta como una forma de razonamiento útil para reflexionar la realidad social de los sujetos, identificar desigualdades presentes en su cotidianidad y, posteriormente, aportar desde el pensamiento matemático una posible solución que propenda a la construcción de entornos más justos.","authors":["Rafael Alberto Méndez-Romero","María Angélica Suavita"],"meta":["May 2019","Conference: I Congreso Internacional Derechos Humanos, Democracia, Cultura de Paz y No ViolenciaAt: Madrid, España","Project: Creación de un modelo sensible que responda a cómo involucrar aspectos de Justicia Social en Educación"],"references":["270584287_Liderando_escuelas_Justas_para_la_Justicia_Social_Leading_Just_Schools_for_Social_Justice","47671322_Mathematics_education_and_social_justice","2913329_Empowerment_In_Mathematics_Education","286268937_Against_common_sense_Teaching_and_learning_toward_social_justice_Third_edition","283010421_Guia_Practica_de_la_Educacion_Digital","250891288_Values_gender_and_images_of_mathematics_A_philosophical_perspective","49303772_La_educacion_como_practica_de_la_libertad"]}