{"id":"335049722_Abstract_2867_MDM2_and_MDM4_are_therapeutic_vulnerabilities_in_malignant_rhabdoid_tumors","abstract":"p>Malignant rhabdoid tumors (MRT) are aggressive cancers of early childhood that are largely resistant to traditional therapies. MRT exhibit a remarkably low mutation rate, with no recurrent mutations beyond the defining biallelic inactivating mutation in SMARCB1, a core subunit of the SWI/SNF (BAF) chromatin-remodeling complex. Thus, MRT do not display traditional oncogenic mutations that are amenable to targeted therapies, limiting their use for this disease. In order to nominate new drug targets for MRT, we screened MRT cell lines with large-scale RNAi, CRISPR-Cas9, and small-molecule libraries. The most significant vulnerabilities consistent across all three screens were MDM2 and MDM4 , the major negative regulators of p53. We found that MRT cell lines are more sensitive than other p53 wild-type cancer cell lines to both idasanutlin (MDM2-specific) and ATSP-7041 (MDM2/4-dual) in vitro . Both inhibitors induced substantial activation of the p53 pathway in MRT cell lines, which responded with permanent apoptotic or senescent cell fate decisions. CRISPR-Cas9-mediated inactivation of TP53 caused a significant resistance to these compounds, confirming that on-target mechanisms were responsible for MRT sensitivity. We found that loss of SMARCB1 sensitizes MRT cells to idasanutlin by shifting the p53 response towards apoptosis. In MRT xenograft studies, both idasanutlin and ATSP-7041 slowed tumor growth. Most strikingly, an idasanutlin pulse of only five days was sufficient to induce sizable regression of all tumors, which remained complete and durable in 50% of mice. Finally, gene expression analysis of primary MRT predicts that, like cell lines and xenografts, MRT in patients are likely to be sensitive to MDM2 inhibition. Collectively, these studies describe a genetic link between SWI/SNF complex mutations and p53, while providing evidence to support the use of MDM2 and MDM2/4 inhibitors that have already entered clinical trials for the treatment of this devastating pediatric cancer.\n\nCitation Format: Thomas P. Howard, Taylor E. Arnoff, Melinda R. Song, Andrew O. Giacomelli, Xiaofeng Wang, Andrew L. Hong, Neekesh V. Dharia, Su Wang, Francisca Vazquez, Minh-Tam Pham, Ann M. Morgan, Franziska Wachter, Gregory H. Bird, Guillaume Kugener, Elaine M. Oberlick, Matthew G. Rees, Hong Tiv, Justin H. Hwang, Katherine H. Walsh, April Cook, John M. Krill-Burger, Aviad Tsherniak, Prafulla C. Gokhale, Peter J. Park, Kimberly Stegmaier, Loren D. Walensky, William C. Hahn, Charles W. Roberts. MDM2 and MDM4 are therapeutic vulnerabilities in malignant rhabdoid tumors [abstract]. In: Proceedings of the American Association for Cancer Research Annual Meeting 2019; 2019 Mar 29-Apr 3; Atlanta, GA. Philadelphia (PA): AACR; Cancer Res 2019;79(13 Suppl):Abstract nr 2867.</p","authors":["Thomas Patrick Howard","Taylor E. Arnoff","Melinda R. Song","Andrew Giacomelli"],"meta":["July 2019","DOI:10.1158/1538-7445.AM2019-2867","Conference: Proceedings: AACR Annual Meeting 2019; March 29-April 3, 2019; Atlanta, GA"],"references":[]}