{"id":"335064646_Using_Video_Presentations_in_ESP_Classes_A_Study_Conducted_at_the_Language_Centre-Skopje_SEEU","abstract":"In order to motivate students and create a tension free environment English language teachers implement different technological tools in the classroom. This paper aims to emphasize the importance of using video material in the classroom that facilitates ESL teaching. The study was conducted at SEEU Language Centre with 87 students’. Major ethnical groups include Macedonian, Albanian, Turkish, and Roma. The respondents’ age varies from 18-20 studying ESP classes, such as Computer Sciences 1, ESP (Public administration 1) as well as Academic and Advanced Academic English, and the research questions are: to what extent students are motivated to study English using videos, do Video presentations stimulate students’ critical thinking skills. Moreover, 8 teachers responded to the questionnaire and strongly agreed that Videos motivate students’ discussions in class.\nTeaching ESP courses using audio-visual tools is especially beneficial for both students and teachers because the appropriate video material can make students more interested in the subject, more engaged as well as become more confident in communicative language learning competencies.","authors":["Neda Radosavlevikj","Hajrulla Hajrullai"],"meta":["July 2019SEEU Review 14(1):178-195","DOI:10.2478/seeur-2019-0010"],"references":["265028375_Using_Authentic_Video_in_the_Language_Classroom","239921962_Listening_Skills_Development_Through_Multimedia","237718864_Learner_motivation_and_E-learning_design_A_multinationally_validated_process","313101497_Multimedia_learning_Are_we_asking_the_right_questions","285570755_Effect_of_Using_Video_Materials_in_the_Teaching_of_Listening_Skills_for_University_Students","246899935_Multimedia_Learning_Are_We_Asking_the_Right_Questions","243774263_Multimedia_for_Learning_Methods_and_Development","238732527_Learning_with_multimedia_Engaging_students_in_constructivist_learning","234565210_Multiple_Intelligences_Go_to_School_Educational_Implications_of_the_Theory_of_Multiple_Intelligences_Technical_Report_No_4","233249809_Media_Literacy_Education_No_Longer_a_Curriculum_Option"]}