{"id":"335073140_PENSAMENTO_ESTATISTICO_EM_UMA_ATIVIDADE_DE_MODELAGEM_MATEMATICA_RESSIGNIFICANDO_O_LANCAMENTO_DE_AVIOES_DE_PAPEL","abstract":"Neste artigo apresentamos resultados de uma pesquisa que busca evidenciar manifestações do pensamento estatístico reveladas na produção escrita de estudantes ao desenvolverem uma atividade de Modelagem Matemática. Fundamentamo-nos em aportes teóricos relativos ao pensamento estatístico, associado à ideia de variação, mais especificamente, à produção e à análise de dados e à tomada de decisão acerca dos mesmos; à Educação Estatística entendida como área preocupada na relação dos conceitos da Estatística e da Probabilidade com outros campos do conhecimento, bem como com situações em que os conceitos são utilizados; e à Modelagem Matemática considerada uma metodologia de ensino em que emergem conteúdos matemáticos a partir de uma situação não essencialmente Matemática. Analisamos uma atividade desenvolvida por um grupo de estudantes no contexto de uma disciplina de Modelagem Matemática do sétimo período do curso de Licenciatura em Matemática de uma universidade federal do Paraná. Por meio de análise qualitativa de cunho interpretativo dos registros escritos dos estudantes, evidenciamos que o pensamento estatístico é manifestado desde o planejamento de ações para a coleta de dados, a coleta propriamente dita e a organização desses dados, a interpretação de dados via conceitos da Estatística Descritiva, bem como a utilização de diferentes representações para pensar o problema.","authors":["Rodolfo Eduardo Vertuan","Karina Silva"],"meta":["May 2018Revista de Ensino de Ciências e Matemática 9(2):320-334","DOI:10.26843/rencima.v9i2.1672"],"references":["319442416_Reflexoes_sobre_a_acao_pedagogica_no_desenvolvimento_da_modelagem_matematica","319412279_Um_Cenario_sobre_a_Pesquisa_em_Educacao_Estatistica_no_Boletim_de_Educacao_Matematica_-_BOLEMA_de_2006_ate_2015","307744889_RESSIGNIFICANDO_A_EDUCACAO_ESTATISTICA_NO_ENSINO_FUNDAMENTAL_ANALISE_DE_UMA_SEQUENCIA_DIDATICA_APOIADA_NAS_TECNOLOGIAS_DE_INFORMACAO_E_COMUNICACAO","233324585_Desenvolvimento_do_Pensamento_Estatistico_e_sua_Articulacao_com_a_Mobilizacao_de_Registros_de_Representacao_Semiotica","228460220_Pensamento_estatistico_um_componente_primordial_para_o_sucesso_do_programa_de_qualidade_seis_sigma","226718118_Research_on_Statistical_Literacy_Reasoning_and_Thinking_Issues_Challenges_and_Implications","29436336_Pensamento_estatistico_e_raciocinio_sobre_variacao_um_estudo_com_professores_de_matematica","352886978_Perspectives_on_Modeling_in_School_Mathematics","268363725_HISTORIA_ORAL_E_EDUCACAO_MATEMATICA_O_ESTADO_DA_ARTE","227600957_Adults'_Statistical_Literacy_Meanings_Components_Responsibilities","27464081_A_Modeling_Perspective_on_Students'_Mathematical_Reasoning_about_Data"]}