{"id":"335021507_Digital_service_teams_in_government","abstract":"National governments are setting up digital service teams (DST) – IT units outside the centralized CIO's office – to respond to complex governmental and societal challenges in a responsive and agile manner. DSTs emerge as a third space between centralized and decentralized IT departments that are triggered by large-scale IT failures and the need to abandon black swan IT projects - tasks that traditional CIO offices were not able to handle so far. DSTs design principles have been replicated from the initial idea of the UK's Government Digital Service team and implemented in other countries, such as the U.S., Canada, Italy, or Finland. For this article, a qualitative interpretative approach was chosen to understand external and internal context factors that contribute to the emergence of these digital service teams. The article brings initial clarity of the composition and tasks of DSTs and extends the existing theory of context by providing insights about this third space between centralized and decentralized IT departments to organize IT Governance in public sector organizations.","authors":["Ines Mergel"],"meta":["August 2019Government Information Quarterly 36(4):101389","DOI:10.1016/j.giq.2019.07.001","Project: Digital Transformation"],"references":["333449219_Applying_design_science_in_public_policy_and_administration_research","324117231_The_twin_faces_of_public_sector_design","317250383_Digital_Service_Teams_Challenges_and_Recommendations_for_Government","308003888_Agile_innovation_management_in_government_A_research_agenda","319600736_Assessing_Qualitative_Studies_in_Public_Administration_Research","313241452_Innovation_Labs_in_the_Public_Sector_what_they_are_and_what_they_do","310827143_MANAGEMENT_FASHION_LIFECYCLES_TRIGGERS_AND_COLLECTIVE_LEARNING_PROCESSES","309883491_Public_management_research_over_the_decades_what_are_we_writing_about","303916818_Universal_and_contextualized_public_services_Digital_public_service_innovation_framework","303854826_J_Social_capital_intellectual_capital_and_the_organizational_advantage"]}