{"id":"335091431_Continual_learning_of_context-dependent_processing_in_neural_networks","abstract":"Deep neural networks are powerful tools in learning sophisticated but fixed mapping rules between inputs and outputs, thereby limiting their application in more complex and dynamic situations in which the mapping rules are not kept the same but change according to different contexts. To lift such limits, we developed an approach involving a learning algorithm, called orthogonal weights modification, with the addition of a context-dependent processing module. We demonstrated that with orthogonal weights modification to overcome catastrophic forgetting, and the context-dependent processing module to learn how to reuse a feature representation and a classifier for different contexts, a single network could acquire numerous context-dependent mapping rules in an online and continual manner, with as few as approximately ten samples to learn each. Our approach should enable highly compact systems to gradually learn myriad regularities of the real world and eventually behave appropriately within it. When neural networks are retrained to solve more than one problem, they tend to forget what they have learned earlier. Here, the authors propose orthogonal weights modification, a method to avoid this so-called catastrophic forgetting problem. Capitalizing on such an ability, a new module is introduced to enable the network to continually learn context-dependent processing.","authors":["Guanxiong Zeng","Yang Chen","Bo Cui","Shan Yu"],"meta":["August 2019Nature Machine Intelligence 1(8):364-372","DOI:10.1038/s42256-019-0080-x"],"references":["323335071_Continual_Lifelong_Learning_with_Neural_Networks_A_Review","322975942_Alleviating_catastrophic_forgetting_using_context-dependent_gating_and_synaptic_stabilization","315656686_Overcoming_Catastrophic_Forgetting_by_Incremental_Moment_Matching","314943144_Continual_Learning_Through_Synaptic_Intelligence","338488196_Continual_Learning_Through_Synaptic_Intelligence","321067924_Learning_without_Forgetting","319770381_How_transferable_are_features_in_deep_neural_networks","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319769909_Distilling_the_Knowledge_in_a_Neural_Network","318489433_Overcoming_Catastrophic_Interference_by_Conceptors"]}