{"id":"335000196_Vision-based_lane_departure_warning_framework","abstract":"Collisions arising from lane departures have contributed to traffic accidents causing millions of injuries and tens of thousands of casualties per year worldwide. Many related studies had shown that single vehicle lane departure crashes accounted largely in road traffic deaths that results from drifting out of the roadway. Hence, automotive safety has becoming a concern for the road users as most of the road casualties occurred due to driver's fallacious judgement of vehicle path. This paper proposes a vision-based lane departure warning framework for lane departure detection under daytime and night-time driving environments. The traffic flow and conditions of the road surface for both urban roads and highways in the city of Malacca are analysed in terms of lane detection rate and false positive rate. The proposed vision-based lane departure warning framework includes lane detection followed by a computation of a lateral offset ratio. The lane detection is composed of two stages: pre-processing and detection. In the pre-processing, a colour space conversion, region of interest extraction, and lane marking segmentation are carried out. In the subsequent detection stage, Hough transform is used to detect lanes. Lastly, the lateral offset ratio is computed to yield a lane departure warning based on the detected X-coordinates of the bottom end-points of each lane boundary in the image plane. For lane detection and lane departure detection performance evaluation, real-life datasets for both urban roads and highways in daytime and night-time driving environments, traffic flows, and road surface conditions are considered. The experimental results show that the proposed framework yields satisfactory results. On average, detection rates of 94.71% for lane detection rate and 81.18% for lane departure detection rate were achieved using the proposed frameworks. In addition, benchmark lane marking segmentation methods and Caltech lanes dataset were also considered for comparison evaluation in lane detection. Challenges to lane detection and lane departure detection such as worn lane markings, low illumination, arrow signs, and occluded lane markings are highlighted as the contributors to the false positive rates.","authors":["Em Poh Ping","Jakir Hossen","Fitrian Imaduddin","E.K. Wong"],"meta":["August 2019Heliyon 5(8):2169","DOI:10.1016/j.heliyon.2019.e02169","Project: Ph.Doc"],"references":["320724487_Road_Lane_Detection_Robust_to_Shadows_Based_on_a_Fuzzy_System_Using_a_Visible_Light_Camera_Sensor","323786241_Real-time_lane_detection_using_spatio-temporal_incremental_clustering","323009062_A_Novel_Lane_Detection_Method_based_on_Lane_Structural_Analysis_and_Convolutional_Neural_Networks","321915109_Global_road_fatality_trends'_estimations_based_on_country-wise_micro_level_data","319770502_Road-marking_analysis_for_autonomous_vehicle_guidance","319145776_A_Review_of_Recent_Advances_in_Lane_Detection_and_Departure_Warning_System","311753935_A_Diverse_Low_Cost_High_Performance_Platform_for_Advanced_Driver_Assistance_System_ADAS_Applications","311567795_Fast_learning_method_for_convolutional_neural_networks_using_extreme_learning_machine_and_its_application_to_lane_detection","308497705_An_efficient_lane_markings_detection_and_tracking_method_based_on_vanishing_point_constraints","308087710_The_effectiveness_of_lane_departure_warning_systems-A_reduction_in_real-world_passenger_car_injury_crashes"]}