{"id":"335020368_A_Novel_Autonomous_Perceptron_Model_for_Pattern_Classification_Applications","abstract":"Pattern classification represents a challenging problem in machine learning and data science research domains, especially when there is a limited availability of training samples. In recent years, artificial neural network (ANN) algorithms have demonstrated astonishing performance when compared to traditional generative and discriminative classification algorithms. However, due to the complexity of classical ANN architectures, ANNs are sometimes incapable of providing efficient solutions when addressing complex distribution problems. Motivated by the mathematical definition of a quantum bit (qubit), we propose a novel autonomous perceptron model (APM) that can solve the problem of the architecture complexity of traditional ANNs. APM is a nonlinear classification model that has a simple and fixed architecture inspired by the computational superposition power of the qubit. The proposed perceptron is able to construct the activation operators autonomously after a limited number of iterations. Several experiments using various datasets are conducted, where all the empirical results show the superiority of the proposed model as a classifier in terms of accuracy and computational time when it is compared with baseline classification models.","authors":["Alaa Sagheer","Mohammed Zidan","Mohammed Abdelsamea"],"meta":["August 2019Entropy 21(8):763","DOI:10.3390/e21080763"],"references":["332223480_Quantum_Classification_Algorithm_Based_on_Competitive_Learning_Neural_Network_and_Entanglement_Measure","330774911_A_Unitary_Weights_Based_One-Iteration_Quantum_Perceptron_Algorithm_for_Non-Ideal_Training_Sets","324936022_Recent_Developments_and_Applications_in_Quantum_Neural_Network_A_Review","324615440_Simulation_of_a_Multidimensional_Input_Quantum_Perceptron","322971414_A_dynamically_reconfigurable_logic_cell_From_artificial_neural_networks_to_quantum-dot_cellular_automata","319458998_A_quantum-implementable_neural_network_model","328399981_Quantum_Perceptron_with_Dynamic_Internal_Memory","323562671_Machine_learning_artificial_intelligence_in_the_quantum_domain_A_review_of_recent_progress","305714133_An_optimized_RBF_neural_network_algorithm_based_on_partial_least_squares_and_genetic_algorithm_for_classification_of_small_sample","301858131_Quantum_Associative_Memory"]}