{"id":"335045172_Digital_memcomputing_From_logic_to_dynamics_to_topology","abstract":"Digital memcomputing machines (DMMs) are a class of computational machines designed to solve combinatorial optimization problems. A practical realization of DMMs can be accomplished via electrical circuits of highly non-linear, point-dissipative dynamical systems engineered so that periodic orbits and chaos can be avoided. A given logic problem is first mapped into this type of dynamical system whose point attractors represent the solutions of the original problem. A DMM then finds the solution via a succession of elementary instantons whose role is to eliminate solitonic configurations of logical inconsistency (“logical defects”) from the circuit. By employing a supersymmetric theory of dynamics, a DMM can be described by a cohomological field theory that allows for computation of certain topological matrix elements on instantons that have the mathematical meaning of intersection numbers on instantons. We discuss the “dynamical” meaning of these matrix elements, and argue that the number of elementary instantons needed to reach the solution cannot exceed the number of state variables of DMMs, which in turn can only grow at most polynomially with the size of the problem. These results shed further light on the relation between logic, dynamics and topology in digital memcomputing.","authors":["Massimiliano Di Ventra","Igor V. Ovchinnikov"],"meta":["August 2019Annals of Physics 409:167935","DOI:10.1016/j.aop.2019.167935","Project: Supersymmetric theory of stochastic dynamics"],"references":["320619943_Evidence_of_an_exponential_speed-up_in_the_solution_of_hard_optimization_problems","283761905_Introduction_to_Supersymmetric_Theory_of_Stochastics","262071478_Universal_Memcomputing_Machines","314361055_Absence_of_chaos_in_Digital_Memcomputing_Machines_with_solutions","313726720_Polynomial-time_solution_of_prime_factorization_and_NP-complete_problems_with_digital_memcomputing_machines","268761377_Zusatze_zur_Arbeit_Zur_Operatorenmethode_in_der_klassischen_Mechanik","258807428_The_parallel_approach","253905538_Hamiltonian_Systems_and_Transformations_in_Hilbert_Space","243467509_Random_Magnetic_Fields_Supersymmetry_and_Negative_Dimensions","243422794_Onsager_principle_of_microscopic_reversibility_and_supersymmetry"]}