{"id":"335044235_Gamification_of_assembly_planning_in_virtual_environment","abstract":"Purpose\nThe purpose of this paper is to study the effect of the gamification of virtual assembly planning on the user performance, user experience and engagement.\n\nDesign/methodology/approach\nA multi-touch table was used to manipulate virtual parts and gamification features were integrated into the virtual assembly environment. An experiment was conducted in two conditions: a gamified and a non-gamified virtual environment. Subjects had to assemble a virtual pump. The user performance was evaluated in terms of the number of errors, the feasibility of the generated assembly sequence and the user feedback.\n\nFindings\nThe gamification reduced the number of errors and increased the score representing the number of right decisions. The results of the subjective and objective analysis showed that the number of errors decreased with engagement in the gamified assembly. The increase in the overall user experience reduced the number of errors. The subjective evaluation showed a significant difference between the gamified and the non-gamified assembly in terms of the level of engagement, the learning usability and the overall experience.\n\nResearch limitations/implications\nThe effective learning retention after training has not been tested, and longitudinal studies are necessary. The effect of the used gamification elements has been evaluated as a whole; further work could isolate the most beneficial features and add other elements that might be more beneficial for learning.\n\nOriginality/value\nThe research reported in this paper provides valuable insights into the gamification of virtual assembly using a low-cost multi-touch interface. The results are promising for training operators to assemble a product at the design stage.","authors":["Samir Garbaya","Daniela M. Romano","Gunjeet Hattar"],"meta":["July 2019Assembly Automation ahead-of-print(ahead-of-print)","DOI:10.1108/AA-10-2018-0147"],"references":["315504690_Mood_and_learning_in_navigation-based_serious_games","311879391_How_gamification_motivates_An_experimental_study_of_the_effects_of_specific_game_design_elements_on_psychological_need_satisfaction","305035680_An_evaluation_of_asymmetric_interfaces_for_bimanual_virtual_assembly_with_haptics","304915652_The_analysis_and_evaluation_of_the_influence_of_haptic-enabled_virtual_assembly_training_on_real_assembly_performance","304380407_Gamification_State_of_the_art_definition_and_utilization","321806741_A_force_rendering_model_for_virtual_assembly_of_mechanical_parts_with_clearance_fits","319193661_Multimodal_Evaluation_of_the_Differences_between_Real_and_Virtual_Assemblies","314824418_Recognition_of_freehand_sketches_using_mean_shift","308573070_Glove-based_virtual_hand_grasping_for_virtual_mechanical_assembly","304143648_A_method_for_integrating_ergonomics_analysis_into_maintainability_design_in_a_virtual_environment"]}