{"id":"335058820_Towards_quality_assurance_of_software_product_lines_with_adversarial_configurations_research","abstract":"Software product line (SPL) engineers put a lot of effort to ensure that, through the setting of a large number of possible configuration options, products are acceptable and well-tailored to customers' needs. Unfortunately, options and their mutual interactions create a huge configuration space which is intractable to exhaustively explore. Instead of testing all products, machine learning is increasingly employed to approximate the set of acceptable products out of a small training sample of configurations. Machine learning (ML) techniques can refine a software product line through learned constraints and a priori prevent non-acceptable products to be derived. In this paper, we use adversarial ML techniques to generate adversarial configurations fooling ML classifiers and pinpoint incorrect classifications of products (videos) derived from an industrial video generator. Our attacks yield (up to) a 100% misclassification rate and a drop in accuracy of 5%. We discuss the implications these results have on SPL quality assurance.","authors":["Paul Temple","Mathieu Acher","Gilles Perrouin","Battista Biggio"],"meta":["September 2019","DOI:10.1145/3336294.3336309","Conference: the 23rd International Systems and Software Product Line Conference"],"references":["327788104_A_classification_of_product_sampling_for_software_product_lines","327122887_DeepRoad_GAN-based_metamorphic_testing_and_input_validation_framework_for_autonomous_driving_systems","326245481_Test_them_all_is_it_worth_it_Assessing_configuration_sampling_on_the_JHipster_Web_development_stack","345445755_Uniform_Sampling_of_SAT_Solutions_for_Configurable_Systems_Are_We_There_Yet","331219117_Quantitative_Variability_Modeling_and_Analysis","321718936_Wild_Patterns_Ten_Years_After_the_Rise_of_Adversarial_Machine_Learning","321318027_Variability-based_model_transformation_formal_foundation_and_application","321056969_Learning_Contextual-Variability_Models","320358768_DeepXplore_Automated_Whitebox_Testing_of_Deep_Learning_Systems","319770355_Generative_Adversarial_Nets"]}