{"id":"335012762_MuSCA_a_multi-scale_source-sink_carbon_allocation_model_to_explore_carbon_allocation_in_plants_An_application_on_static_apple-tree","abstract":"Background and aims\nCarbon allocation in plants is usually represented at a topological scale, specific to each model. This makes the results obtained with different models, and the impact of their scales of representation, difficult to compare. In this study, we developed a multi-scale carbon allocation model (MuSCA) that allows the use of different, user-defined, topological scales of a plant, and assessment of the impact of each spatial scale on simulated results and computation time.\n\nMethods\nModel multi-scale consistency and behaviour were tested on three realistic apple tree structures. Carbon allocation was computed at five scales, spanning from the metamer (the finest scale, used as a reference) up to first-order branches, and for different values of a sap friction coefficient. Fruit dry mass increments were compared across spatial scales and with field data.\n\nKey Results\nThe model was able to represent effects of competition for carbon assimilates on fruit growth. Intermediate friction parameter values provided results that best fitted field data. Fruit growth simulated at the metamer scale differed of ~1 % in respect to results obtained at growth unit scale and up to 60 % in respect to first order branch and fruiting unit scales. Generally, the coarser the spatial scale the more predicted fruit growth diverged from the reference. Coherence in fruit growth across scales was also differentially impacted, depending on the tree structure considered. Decreasing the topological resolution reduced computation time by up to four orders of magnitude.\n\nConclusions\nMuSCA revealed that the topological scale has a major influence on the simulation of carbon allocation. This suggests that the scale should be a factor that is carefully evaluated when using a carbon allocation model, or when comparing results produced by different models. Finally, with MuSCA, trade-off between computation time and prediction accuracy can be evaluated by changing topological scales.","authors":["Francesco Reyes","Benoît Pallas","Christophe Pradal","Federico Vaggi"],"meta":["October 2019Annals of Botany","DOI:10.1093/aob/mcz122","Projects: OpenAleaModelling Fruit Tree Architecture"],"references":["322739159_Plant_architecture_and_foliar_senescence_impact_the_race_between_wheat_growth_and_Zymoseptoria_tritici_epidemics","322274676_Modelling_interaction_dynamics_between_two_foliar_pathogens_in_wheat_A_multi-scale_approach","320036887_Virtual_Plants_Need_Water_Too_Functional-Structural_Root_System_Models_in_the_Context_of_Drought_Tolerance_Breeding","313226449_Reshaping_Plant_Biology_Qualitative_and_Quantitative_Descriptors_for_Plant_Morphology","294087753_Maximum_Growth_Potential_and_Periods_of_Resource_Limitation_in_Apple_Tree","281471777_Parameterization_of_the_functional-structural_RATP_model_for_apple_trees_Application_to_simulate_photosynthesis_and_transpiration_of_fruiting_branches","329591071_Investigation_of_complex_canopies_with_a_functional-structural_plant_model_as_exemplified_by_leaf_inclination_effect_on_the_functioning_of_pure_and_mixed_stands_of_wheat_during_grain_filling","312487598_Openalea_scientific_workflows_combining_data_analysis_and_simulation","303867068_Simulation_of_carbon_allocation_and_organ_growth_variability_in_apple_tree_by_connecting_architectural_and_source-sink_models","284241095_A_simplified_dry_matter_production_model_for_apple_using_automatic_programming_simulation_software"]}