{"id":"335051252_Image_processing-based_intelligent_robotic_system_for_assistance_of_agricultural_crops","abstract":"Agriculture has been practiced in conventional ways for centuries\nand supported with mechanical systems in the last few decades. With the\nevolution of robotic equipment and sensors, the researchers are focusing on introducing smart farming. In this paper, we propose improved algorithms for infection detection in leaves and field classification targeting a heterogeneous robotic system. Image processing methods have been used on the leaves of the plants to calculate the infection percentage in crops and elementary machine learning algorithm k-means clustering for classifying the field. Classification of the agricultural field has been done for growing different types of crops in a mixed cropping technique which has an advantage over other farming procedures. Early detection of diseases can help in better preventive measures in the early stages. We have used 3,150 images of crop diseases for three different types of crops and by smartly incorporating some previously established techniques. The primary objective of this paper includes the qualitative analysis of infection detection algorithms and further elaboration for\nthe possible application of the suggested work in smart farming.","authors":["Nikhil Paliwal","Pankhuri Vanjani","Jing Wei Liu","Sandeep Saini"],"meta":["January 2019International Journal of Social and Humanistic Computing 3(2):191","DOI:10.1504/IJSHC.2019.10023088"],"references":["287577015_Detection_of_unhealthy_region_of_plant_leaves_and_classification_of_plant_leaf_diseases_using_texture_features","259355393_Digital_image_processing_techniques_for_detecting_quantifying_and_classifying_plant_diseases","229355035_Computer-assisted_estimation_of_leaf_damage_caused_by_spider_mites","314916293_eAGROBOT_-_A_robot_for_early_crop_disease_detection_using_image_processing","305361932_Disease_Detection_in_Soya_Bean_using_K-Means_Clustering_Segmentation_Technique","280769849_Detection_and_classification_of_fungal_disease_with_Radon_transform_and_support_vector_machine_affected_on_cereals","264832433_Fruit_disease_recognition_using_improved_sum_and_diference_histogram_from_images","257404723_A_new_Expert_System_for_Greeness_Identification_in_Agricultural_Images","236398748_Worldwide_organic_soil_carbon_and_nitrogen_data","231743387_Crop_Losses_to_Pests"]}