{"id":"335086639_Particle_Image_Velocimetry_Based_on_a_Deep_Learning_Motion_Estimator","abstract":"Particle image velocimetry (PIV), as a common technology for analysing the global flow motion from images, plays a significant role in experimental fluid mechanics. In this paper, we investigate the deep learning-based techniques for such a fluid motion estimation problem. The aim of this novel technique is to extract two-dimensional velocity fields from fluid images efficiently and accurately. First, we introduce the convolutional neural network (CNN) called LiteFlowNet, which is proposed for end-to-end optical flow estimation. Enhanced configurations of LiteFlowNet are adopted for PIV estimation in order to refine the small-scale vortex structures. Furthermore, as the supervised learning strategy is considered, a dataset including particle images and the ground-truth fluid motions is generated to train the parameters of the networks. A number of fluidic images, from synthetic turbulent flow to laboratory boundary layer flow, are investigated in this paper. Experimental results indicate the proposed estimator can provide accuracy approaching that of state-of-the-art methods and high efficiency toward real-time estimation.","authors":["Shengze Cai","Jiaming Liang","Qi Gao","Chao Xu"],"meta":["August 2019IEEE Transactions on Instrumentation and Measurement PP(99):1-1","DOI:10.1109/TIM.2019.2932649","Project: Date-driven techniques"],"references":["331958875_Dense_motion_estimation_of_particle_images_via_a_convolutional_neural_network","329740367_LiteFlowNet_A_Lightweight_Convolutional_Neural_Network_for_Optical_Flow_Estimation","327685777_Error_reduction_for_time-resolved_PIV_data_based_on_Navier-Stokes_equations","322634482_What_Makes_Good_Synthetic_Training_Data_for_Learning_Disparity_and_Optical_Flow_Estimation","321084338_PIV-DCNN_cascaded_deep_convolutional_neural_networks_for_particle_image_velocimetry","320973123_Motion_Estimation_under_Location_Uncertainty_for_Turbulent_Fluid_Flow","319630822_Performing_particle_image_velocimetry_using_artificial_neural_networks_A_proof-of-concept","333448216_Particle_Image_Velocimetry_A_Practical_Guide","320964395_FlowNet_20_Evolution_of_Optical_Flow_Estimation_with_Deep_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}