{"id":"335027229_Detection_of_medical_text_semantic_similarity_based_on_convolutional_neural_network","abstract":"Background: \nImaging examinations, such as ultrasonography, magnetic resonance imaging and computed tomography scans, play key roles in healthcare settings. To assess and improve the quality of imaging diagnosis, we need to manually find and compare the pre-existing reports of imaging and pathology examinations which contain overlapping exam body sites from electrical medical records (EMRs). The process of retrieving those reports is time-consuming. In this paper, we propose a convolutional neural network (CNN) based method which can better utilize semantic information contained in report texts to accelerate the retrieving process.\n\nMethods: \nWe included 16,354 imaging and pathology report-pairs from 1926 patients who admitted to Shanghai Tongren Hospital and had ultrasonic examinations between 1st May 2017 and 31st July 2017. We adapted the CNN model to calculate the similarities among the report-pairs to identify target report-pairs with overlapping body sites, and compared the performance with other six conventional models, including keyword mapping, latent semantic analysis (LSA), latent Dirichlet allocation (LDA), Doc2Vec, Siamese long short term memory (LSTM) and a model based on named entity recognition (NER). We also utilized graph embedding method to enhance the word representation by capturing the semantic relations information from medical ontologies. Additionally, we used LIME algorithm to identify which features (or words) are decisive for the prediction results and improved the model interpretability.\n\nResults: \nExperiment results showed that our CNN model gained significant improvement compared to all other conventional models on area under the receiver operating characteristic (AUROC), precision, recall and F1-score in our test dataset. The AUROC of our CNN models gained approximately 3-7% improvement. The AUROC of CNN model with graph-embedding and ontology based medical concept vectors was 0.8% higher than the model with randomly initialized vectors and 1.5% higher than the one with pre-trained word vectors.\n\nConclusion: \nOur study demonstrates that CNN model with pre-trained medical concept vectors could accurately identify target report-pairs with overlapping body sites and potentially accelerate the retrieving process for imaging diagnosis quality measurement.","authors":["Tao Zheng","Yimei Gao","Fei Wang","Chenhao Fan"],"meta":["August 2019BMC Medical Informatics and Decision Making 19(1)","DOI:10.1186/s12911-019-0880-2"],"references":["311500275_Error_and_discrepancy_in_radiology_inevitable_or_avoidable","307558687_Siamese_Recurrent_Architectures_for_Learning_Sentence_Similarity","329978116_ABCNN_Attention-Based_Convolutional_Neural_Network_for_Modeling_Sentence_Pairs","329725430_Deep_Learning_in_Medicine-Promise_Progress_and_Challenges","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","305999024_Why_Should_I_Trust_You_Explaining_the_Predictions_of_Any_Classifier","305997704_node2vec_Scalable_Feature_Learning_for_Networks","303802749_Indexing_by_Latent_Semantic_Analysis","301445967_Multi-Perspective_Sentence_Similarity_Modeling_with_Convolutional_Neural_Networks"]}