{"id":"335186754_Scene_Recognition_via_Semi-Supervised_Multi-Feature_Regression","abstract":"With the development of visual sensor equipment (e.g., personal smart phones, vehicle cameras, surveillance videos and camcorders), scene recognition technology has attracted much attention due to its latent applications in visual surveillance, intelligent traffic and aerial remote sensing. Although some progress has been made in the field of scene recognition in recent years, the complexity of scene images and the inadequate numbers of labeled data pose challenges in this area. Hence, to effectively fuse the multiple features of each image and employ the information of both labeled and unlabeled images for scene recognition, we proposed a semi-supervised multi-feature regression (SSMFR) model in this paper. The SSMFR model possesses three advantages. First, the model propagates the labels of labeled data to unlabeled data by utilizing graph-based semi-supervised learning techniques so that both the information regarding unlabeled data and labeled data can be exploited to gain better performance. Second, SSMFR employs multiple graphs to characterize the structures of multiple feature spaces and adaptively assigns the weight to different graphs. Therefore, SSMFR can efficiently preserve the manifold structure of samples in each feature space and adequately exploit the complementary information of multiple features. Moreover, SSMFR adopts a l2,1-norm constraint to learn a sparse and robust classifier for scene recognition. To solve the SSMFR model, we proposed a simple and efficient iterative update optimization scheme. Finally, we also proved the convergence of SSMFR by theoretical analysis and experiments. Experiments were conducted on several benchmark scene datasets, and the experimental results demonstrated that the proposed SSMFR model can obtain better performance for scene recognition than some other state-of-the-art algorithms.","authors":["Caixia Zheng","Jianyu Chen","Jun Kong","Yugen Yi"],"meta":["August 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2935420"],"references":["328208265_Deep_Learning_Scene_Recognition_Method_Based_on_Localization_Enhancement","323581628_Adaptive_multiple_graph_regularized_semi-supervised_extreme_learning_machine","322320384_Superpixel-Based_Feature_for_Aerial_Image_Scene_Recognition","322091518_Multicriteria-Based_Active_Discriminative_Dictionary_Learning_for_Scene_Recognition","321064148_A_semi-supervised_generative_framework_with_deep_learning_features_for_high-resolution_remote_sensing_image_scene_classification","320700953_Scene_Recognition_for_Indoor_Localization_Using_a_Multi-Sensor_Fusion_Approach","328989488_Semi-Supervised_Scene_Classification_for_Remote_Sensing_Images_Based_on_CNN_and_Ensemble_Learning","325848411_Ordinal_preserving_matrix_factorization_for_unsupervised_feature_selection","325307842_p-Laplacian_Regularization_for_Scene_Recognition","322060194_Scene_Categorization_with_Spectral_Features"]}