{"id":"335164914_Life_cycle_assessment_of_3D_printing_geo-polymer_concrete_An_ex-ante_study","abstract":"Three‐dimensional (3D) printing and geo‐polymers are two environmentally oriented innovations in concrete manufacturing. The 3D printing of concrete components aims to reduce raw material consumption and waste generation. Geo‐polymer is being developed to replace ordinary Portland cement and reduce the carbon footprint of the binder in the concrete. The environmental performance of the combined use of the two innovations is evaluated through an ex‐ante life cycle assessment (LCA). First, an attributional LCA was implemented, using data collected from the manufacturer to identify the hotspots for environmental improvements. Then, scaled‐up scenarios were built in collaboration with the company stakeholder. These scenarios were compared with the existing production system to understand the potential advantages/disadvantages of the innovative system and to identify the potential directions for improvement. The results indicate that 3D printing can potentially lead to waste reduction. However, depending on its recipe, geo‐polymer likely has higher environmental impacts than ordinary concrete. The ex‐ante LCA suggests that after step‐by‐step improvements in the production and transportation of raw materials, 3D printing geo‐polymer concrete is able to reduce the carbon footprint of concrete components, while it does still perform worse on impact categories, such as depletion of abiotic resources and stratospheric ozone depletion. We found that the most effective way to lower the environmental impacts of 3D concrete is to reduce silicate in the recipe of the geo‐polymer. This approach is, however, challenging to realize by the company due to the locked‐in effect of the previous innovation investment. The case study shows that to support technological innovation ex‐ante LCA has to be implemented as early as possible in innovation to allow for maintaining technical flexibility and improving on the identified hotspots.","authors":["Yue Yao","Mingming Hu","Francesco Di Maio","Stefano Cucurachi"],"meta":["August 2019Journal of Industrial Ecology 24(7)","DOI:10.1111/jiec.12930","Project: Innovative Circular Economy Based solutions demonstrating the Efficient recovery of valuable material Resources from the Generation of representative End-of-Life building materials (ICEBERG)"],"references":["315464917_Comparative_Life_Cycle_Assessment_of_Conventional_and_Additive_Manufacturing_in_Mold_Core_Making_for_CFRP_Production","313250042_Does_ex_ante_application_enhance_the_usefulness_of_LCA_A_case_study_on_an_emerging_technology_for_metal_recovery_from_e-waste","305822454_3D_Printing_of_Buildings_and_Building_Components_as_the_Future_of_Sustainable_Construction","295841266_Eco-sustainable_Geopolymer_Concrete_Blocks_Production_Process","324629161_Ex-ante_LCA_of_Emerging_Technologies","323627652_Experimental_study_on_mix_proportion_and_fresh_properties_of_fly_ash_based_geopolymer_for_3D_concrete_printing","322962985_Applications_of_additive_manufacturing_in_the_construction_industry_-_A_forward-looking_review","319447540_Measurement_of_tensile_bond_strength_of_3D_printed_geopolymer_mortar","318475917_A_design_tool_for_resource-efficient_fabrication_of_3d-graded_structural_building_components_using_additive_manufacturing","305153603_DIRECTIVE_200898EC_on_waste_and_repealing_certain_Directives"]}