{"id":"335182607_The_bow_tie_structure_of_the_Bitcoin_users_graph","abstract":"The availability of the entire Bitcoin transaction history, stored in its public blockchain, offers interesting opportunities for analysing the transaction graph to obtain insight on users behaviour. This paper presents an analysis of the Bitcoin users graph, obtained by clustering the transaction graph, to highlight its connectivity structure and the economical meaning of the different obtained components. In fact, the bow tie structure, already observed for the graph of the web, is augmented, in the Bitocoin users graph, with the economical information about the entities involved. We study the connectivity components of the users graph individually, to infer their macroscopic contribution to the whole economy. We define and evaluate a set of measures of nodes inside each component to characterize and quantify such a contribution. We also perform a temporal analysis of the evolution of the resulting bow tie structure. Our findings confirm our hypothesis on the components semantic, defined in terms of their economical role in the flow of value inside the graph.","authors":["Damiano Di Francesco Maesa","Andrea Marino","Laura Ricci"],"meta":["August 2019Applied Network Science 4(1)","DOI:10.1007/s41109-019-0163-y"],"references":["321044936_Detecting_artificial_behaviours_in_the_Bitcoin_users_graph","320026355_Data-driven_analysis_of_Bitcoin_properties_exploiting_the_users_graph","317401238_An_analysis_of_Bitcoin_OP_RETURN_metadata","313365747_An_analysis_of_Bitcoin_OP_RETURN_metadata","311920507_Uncovering_the_Bitcoin_Blockchain_An_Analysis_of_the_Full_Users_Graph","311153793_An_analysis_of_the_Bitcoin_users_graph_inferring_unusual_behaviours","304068099_Visualizing_Dynamic_Bitcoin_Transaction_Patterns","329425822_The_Graph_Structure_of_Bitcoin_Volume_2_Proceedings_The_7th_International_Conference_on_Complex_Networks_and_Their_Applications_COMPLEX_NETWORKS_2018","315528156_Empirical_Analysis_of_Crypto_Currencies","312484810_The_Unreasonable_Effectiveness_of_Address_Clustering"]}