{"id":"335156760_WiMorse_A_Contactless_Morse_Code_Text_Input_System_using_Ambient_WiFi_Signals","abstract":"Recent years have witnessed advances of Internet of Things (IoT) technologies and their applications to enable contactless sensing and human-computer interaction in smart homes. For people with Motor Neurone Disease (MND), their motion capabilities are severely impaired and they have difficulties interacting with IoT devices and even communicating with other people. As the disease progresses, most patients lose their speech function eventually which makes the widely adopted voice-based solutions fail. In contrast, most patients can still move their fingers slightly even after they have lost the control of their arms and hands. Thus we propose to develop a Morse code based text input system, called WiMorse, which allows patients with minimal single-finger control to input and communicate with other people without attaching any sensor to their fingers. WiMorse leverages ubiquitous commodity WiFi devices to track subtle finger movements contactlessly and encode them as Morse code input. In order to sense the very subtle finger movements, we propose to employ the ratio of the Channel State Information (CSI) between two antennas to enhance the Signal to Noise Ratio. To address the severe location dependency issue in wireless sensing with accurate theoretical underpinning and experiments, we propose a signal transformation mechanism to automatically convert signals based on the input position, achieving stable sensing performance. Comprehensive experiments demonstrate that WiMorse can achieve higher than 95% recognition accuracy for finger generated Morse code, and is robust against input position, environment changes, and user diversity.","authors":["Niu Kai","Fusang Zhang","Yuhang Jiang","Jie Xiong"],"meta":["August 2019IEEE Internet of Things Journal PP(99):1-1","DOI:10.1109/JIOT.2019.2934904","Project: Contactless Human Sensing with WiFi CSI"],"references":["329256952_Boosting_fine-grained_activity_sensing_by_embracing_wireless_multipath_effects","327758396_FullBreathe_Full_Human_Respiration_Detection_Exploiting_Complementarity_of_CSI_Phase_and_Amplitude_of_WiFi_Signals","327552173_Contactless_Respiration_Monitoring_Using_Ultrasound_Signal_With_Off-the-Shelf_Audio_Devices","325425558_A_Hybrid_Hierarchical_Framework_for_Gym_Physical_Activity_Recognition_and_Measurement_Using_Wearable_Sensors","324049773_From_Fresnel_Diffraction_Model_to_Fine-grained_Human_Respiration_Sensing_with_Commodity_Wi-Fi_Devices","328547500_Material_Identification_with_Commodity_Wi-Fi_Devices","328059360_Wearable_Computing_for_Internet_of_Things_A_Discriminant_Approach_for_Human_Activity_Recognition","327762663_Training-Free_Human_Vitality_Monitoring_Using_Commodity_Wi-Fi_Devices","326849519_Precise_Power_Delay_Profiling_with_Commodity_Wi-Fi","326387833_Orientation_Independent_ActivityGesture_Recognition_Using_Wearable_Motion_Sensors","323243813_Learning_Sleep_Stages_from_Radio_Signals_A_Conditional_Adversarial_Architecture","321487777_WiSpeed_A_Statistical_Electromagnetic_Approach_for_Device-Free_Indoor_Speed_Estimation","322352079_RF-Copybook_A_Millimeter_Level_Calligraphy_Copybook_based_on_commodity_RFID","319945841_MoSense_A_RF-based_Motion_Detection_System_via_Off-the-Shelf_WiFi_Devices","319641925_IndoTrack_Device-Free_Indoor_Human_Tracking_with_Commodity_Wi-Fi"]}