{"id":"335174482_Imaging_magnetic_polarons_in_the_doped_Fermi-Hubbard_model","abstract":"Polarons—electronic charge carriers ‘dressed’ by a local polarization of the background environment—are among the most fundamental quasiparticles in interacting many-body systems, and emerge even at the level of a single dopant¹. In the context of the two-dimensional Fermi–Hubbard model, polarons are predicted to form around charged dopants in an antiferromagnetic background in the low-doping regime, close to the Mott insulating state2–7; this prediction is supported by macroscopic transport and spectroscopy measurements in materials related to high-temperature superconductivity⁸. Nonetheless, a direct experimental observation of the internal structure of magnetic polarons is lacking. Here we report the microscopic real-space characterization of magnetic polarons in a doped Fermi–Hubbard system, enabled by the single-site spin and density resolution of our ultracold-atom quantum simulator. We reveal the dressing of doublons by a local reduction—and even sign reversal—of magnetic correlations, which originates from the competition between kinetic and magnetic energy in the system. The experimentally observed polaron signatures are found to be consistent with an effective string model at finite temperature⁷. We demonstrate that delocalization of the doublon is a necessary condition for polaron formation, by comparing this setting with a scenario in which a doublon is pinned to a lattice site. Our work could facilitate the study of interactions between polarons, which may lead to collective behaviour, such as stripe formation, as well as the microscopic exploration of the fate of polarons in the pseudogap and ‘bad metal’ phases.","authors":["Joannis Koepsell","Jayadev Vijayan","Pimonpan Sompet","Fabian Grusdt"],"meta":["August 2019Nature 572(7769):358-362","DOI:10.1038/s41586-019-1463-1"],"references":["324005953_Direct_observation_of_incommensurate_magnetism_in_Hubbard_chains","323410775_Bad_metallic_transport_in_a_cold_atom_Fermi-Hubbard_system","321604263_Parton_Theory_of_Magnetic_Polarons_Mesonic_Resonances_and_Signatures_in_Dynamics","308066539_Dynamical_Disentangling_and_Cooling_of_Atoms_in_Bilayer_Optical_Lattices","334553554_String_patterns_in_the_doped_Hubbard_model","323444295_Spin_Transport_in_a_Mott_Insulator_of_Ultracold_Fermions","319599887_Quantum_simulations_with_ultracold_atoms_in_optical_lattices","317752399_A_cold-atom_Fermi-Hubbard_antiferromagnet","308181824_Spin-_and_density-resolved_microscopy_of_antiferromagnetic_correlations_in_Fermi-Hubbard_chains","308179568_Site-resolved_measurement_of_the_spin-correlation_function_in_the_Fermi-Hubbard_model","305881381_Observation_of_Spatial_Charge_and_Spin_Correlations_in_the_2D_Fermi-Hubbard_Model","282905906_Microscopic_Observation_of_Pauli_Blocking_in_Degenerate_Fermionic_Lattice_Gases","274623593_Polaron_spin_current_transport_in_organic_semiconductors","270593792_Quantum_dimer_model_for_the_pseudogap_metal","267478621_Handbook_of_high-temperature_superconductivity_Theory_and_experiment"]}