{"id":"335156534_Energy_Peer-to-Peer_Trading_in_Virtual_Microgrids_in_Smart_Grids_A_Game-Theoretic_Approach","abstract":"Traditionally, energy consumers pay non-commodity charges (e.g. transmission, environmental and network costs) as a major component of their energy bills. With the distributed energy generation, enabling energy consumption close to producers can minimize such costs. The physically constrained energy prosumers in power networks can be logically grouped into virtual microgrids (VMGs) using communication systems. Prosumer benefits can be optimised by modelling the energy trading interactions among producers and consumers in a VMG as a Stackelberg game in which producers lead and consumers follow. Considering renewable (RES) and non-renewable energy (nRES) resources, and given that RES are unpredictable thus unschedulable, we also describe cost and utility models that include load uncertainty demands of producers. The results show that under Stackelberg equilibrium (SE), the costs incurred by a consumer for procuring either the RES or nRES are significantly reduced while the derived utility by producer is maximized. We further show that when the number of prosumers in the VMG increases, the CO2 emission cost and consequently the energy cost are minimized at the SE. Lastly, we evaluate the peer-to-peer (P2P) energy trading scenario involving noncooperative energy prosumers with and without Stackelberg game. The results show that the P2P energy prosumers attain 47% higher benefits with Stackelberg game.","authors":["Kelvin Anoh","Sabita Maharjan","Augustine Ikpehai","Yan Zhang"],"meta":["August 2019IEEE Transactions on Smart Grid PP(99):1-1","DOI:10.1109/TSG.2019.2934830","Project: Peer-to-Peer Energy Trading and Sharing—3M (Multi-times, Multi-scales, Multi-qualities) project funded by EPSRC (EP/N03466X/1)"],"references":["333320604_Distributed_Energy_Trading_via_Cellular_Internet_of_Things_and_Mobile_Edge_Computing","329191085_Low-Power_Wide_Area_Network_Technologies_for_Internet-of-Things_A_Comparative_Review_IEEE_Internet_of_Things_Journal","328578593_Effects_of_Traffic_Characteristics_on_Energy_Consumption_of_IoT_End_Devices_in_Smart_City","328517858_Distributed_Energy_Trading_with_Communication_Constraints","328021777_Peer-to-Peer_Energy_Trading_in_a_Prosumer_Based_Community_Microgrid_A_Game-Theoretic_Model","327982698_Peer-to-Peer_Energy_Trading_With_Sustainable_User_Participation_A_Game_Theoretic_Approach","327426031_Distributed_Adaptive_Primal_Algorithm_for_P2P-ETS_over_Unreliable_Communication_Links","324042346_Peer-to-Peer_energy_trading_in_a_Microgrid","328360797_A_Distributed_Electricity_Trading_System_in_Active_Distribution_Networks_Based_on_Multi-Agent_Coalition_and_Blockchain","327131185_Social_Welfare_Maximization_Auction_in_Edge_Computing_Resource_Allocation_for_Mobile_Blockchain"]}