{"id":"335140921_Real-time_Robot-assisted_Ergonomics","abstract":"This paper describes a novel approach in human-robot interaction driven by ergonomics. With a clear focus on optimising ergonomics, the approach proposed here continuously observes a human user's posture and by invoking appropriate cooperative robot movements, the user's posture is, whenever required, brought back to an ergonomic optimum. Effectively, the new protocol optimises the human-robot relative position and orientation as a function of human ergonomics. An RGB-D camera is used to calculate and monitor human joint angles in real-time and to determine the current ergonomics state. A total of 6 main causes of low ergonomic states are identified, leading to 6 universal robot responses to allow the human to return to an optimal ergonomics state. The algorithmic framework identifies these 6 causes and controls the cooperating robot to always adapt the environment (e.g. change the pose of the workpiece) in a way that is ergonomically most comfortable for the interacting user. Hence, human-robot interaction is continuously re-evaluated optimizing ergonomics states. The approach is validated through an experimental study, based on established ergonomic methods and their adaptation for real-time application. The study confirms improved ergonomics using the new approach.","authors":["Ali Shafti","Ahmad Ataka Awwalur Rizqi","B. Urbistondo Lazpita","Ali Shiva"],"meta":["May 2019","DOI:10.1109/ICRA.2019.8793739","Conference: 2019 International Conference on Robotics and Automation (ICRA)"],"references":["330337418_Optimizing_Contextual_Ergonomics_Models_in_Human-Robot_Interaction","320564154_Towards_Ergonomic_Control_of_Human-Robot_Co-Manipulation_and_Handover","318722986_Anticipatory_Robot_Assistance_for_the_Prevention_of_Human_Static_Joint_Overloading_in_Human-Robot_Collaboration","318575594_Anticipatory_Robot_Assistance_for_the_Prevention_of_Human_Static_Joint_Overloading_in_Human-Robot_Collaboration","309759039_FourByThree_Imagine_humans_and_robots_working_hand_in_hand","261486007_A_real-time_ergonomic_monitoring_system_using_the_Microsoft_Kinect","327811654_Planning_Ergonomic_Sequences_of_Actions_in_Human-Robot_Interaction","261075780_Real_Time_Ergonomic_Assessment_for_Assembly_Operations_Using_Kinect","259473256_Using_Kinect_TM_sensor_in_observational_methods_for_assessing_postures_at_work","242653265_Enhanced_Computer_Vision_With_Microsoft_Kinect_Sensor_A_Review"]}