{"id":"335191261_Digital_Twin_for_Monitoring_of_Industrial_Multi-Effect_Evaporation","abstract":"Digital twins are rigorous mathematical models that can be used to represent the operation of real systems. This connection allows for deeper understanding of the actual states of the analyzed system through estimation of variables that are difficult to measure otherwise. In this context, the present manuscript describes the successful implementation of a digital twin to represent a four-stage multi-effect evaporation train from an industrial sugar-cane processing unit. Particularly, the complex phenomenological effects, including the coupling between thermodynamic and fluid dynamic effects, and the low level of instrumentation in the plant constitute major challenges for adequate process operation. For this reason, dynamic mass and energy balances were developed, implemented and validated with actual industrial data, in order to provide process information for decision-making in real time. For example, the digital twin was able to indicate failure of process sensors and to provide estimates for the affected variables in real time, improving the robustness of the operation and constituting an important tool for process monitoring.","authors":["Rafael Marinho Soares","Mauricio Melo Camara","Thiago Feital","José Carlos Pinto"],"meta":["August 2019Processes 7(8):537","DOI:10.3390/pr7080537"],"references":["329366878_The_Promise_of_Artificial_Intelligence_in_Chemical_Engineering_Is_it_here_finally","310621760_Performance_Evaluation_of_Real_Industrial_RTO_Systems","327992994_Real_Time_Optimization_for_steam_management_in_an_evaporation_section","326651989_Modeling_of_a_double_effect_evaporator_Bond_graph_approach","322830425_A_Survey_of_Optimal_Process_Design_Capabilities_and_Practices_in_the_Chemical_and_Petrochemical_Industries","320129371_Review_on_data-driven_modeling_and_monitoring_for_plant-wide_industrial_processes","317104907_Data_Reconciliation_Strategy_with_Time_Registration_for_the_Evaporation_Process_in_Alumina_Production","311674659_Cane_Sugar_Engineering_2nd_Edition","303900830_Digital_Twin-The_Simulation_Aspect","282465830_About_The_Importance_of_Autonomy_and_Digital_Twins_for_the_Future_of_Manufacturing"]}