{"id":"335153717_Extracting_significant_signal_of_news_consumption_from_social_networks_the_case_of_Twitter_in_Italian_political_elections","abstract":"According to the Eurobarometer report about EU media use of May 2018, the number of European citizens who consult on-line social networks for accessing information is considerably increasing. In this work we analyse approximately 106 tweets exchanged during the last Italian elections held on March 4, 2018. Using an entropy-based null model discounting the activity of the users, we first identify potential political alliances within the group of verified accounts: if two verified users are retweeted more than expected by the non-verified ones, they are likely to be related. Then, we derive the users’ affiliation to a coalition measuring the polarisation of unverified accounts. Finally, we study the bipartite directed representation of the tweets and retweets network, in which tweets and users are collected on the two layers. Users with the highest out-degree identify the most popular ones, whereas highest out-degree posts are the most “viral”. We identify significant content spreaders with a procedure that allows to statistically validate the connections that cannot be explained by users’ tweeting activity and posts’ virality, using an entropy-based null model as benchmark. The analysis of the directed network of validated retweets reveals signals of the alliances formed after the elections, highlighting commonalities of interests before the event of the national elections.","authors":["Carolina Becatti","Guido Caldarelli","Renaud Lambiotte","Fabio Saracco"],"meta":["August 2019Palgrave Communications 5(1)","DOI:10.1057/s41599-019-0300-3"],"references":["331929649_ressserepprrs_Echo_Chambers_Emotional_Contagion_and_Group_Polarization_on_Facebook_OPEN","331929628_Opinion_dynamics_on_interacting_networks_Media_competition_and_social_influence","330223326_The_statistical_physics_of_real-world_networks","329795978_Tampering_with_Twitter's_Sample_API","326859227_Assessing_systemic_risk_due_to_fire_sales_spillover_through_maximum_entropy_network_reconstruction","331930605_Mapping_Social_Dynamics_on_Facebook_The_Brexit_Debate","330952622_Entropy-based_randomization_of_rating_networks","324672535_Disinformation_and_Social_Bot_Operations_in_the_Run_Up_to_the_2017_French_Presidential_Election","324338439_Voting_a_Study_of_Opinion_Formation_in_a_Presidential_Campaign","324318558_Voting_A_Study_of_Opinion_Formation_in_a_Presidential_Campaign"]}