{"id":"335182785_Understanding_structure_and_behavior_of_systems_a_network_perspective","abstract":"Networks are interesting representation models for analysis of systems. The entities of the systems under review can be denoted as the nodes of the networks and the relationships between these entities as the edges connecting them. Such a representation has advantages in analysis as network theory has a rich collection of well defined concepts and methods. These concepts of can be applied on such networks to draw inferences about the systems. As digitization has penetrated almost all aspects of mankind, a wide variety of systems from diverse domains such as computer science, transportation, social science have become available in the form of networks. A network perspective provides valuable insights into their structure and behavior. In this inquiry networks representing real world systems from different domains are analyzed using concepts of network theory and statistical generative network models—SBM and LSM. This is done to various application scenarios to express the properties of these systems. The findings highlight the unique features and trends seen in each domain.","authors":["Pranav Nerurkar","Madhav Chandane","Sunil Bhirud"],"meta":["August 2019International Journal of Information Technology","DOI:10.1007/s41870-019-00354-2"],"references":["331307250_Social_and_Economic_Networks","326749097_A_Comparative_Analysis_of_Community_Detection_Algorithms_on_Social_Networks_ICCI-2017","323444136_Preferential_attachment_mechanism_of_complex_network_growth_rich-gets-richer_or_fit-gets-richer","322904031_Microblog_sentiment_analysis_using_social_and_topic_context","322346201_A_Novel_Heuristic_for_Evolutionary_Clustering","316859369_Exactly_Solvable_Random_Graph_Ensemble_with_Extensively_Many_Short_Cycles","328098408_Social_Network_Analysis","324533952_Rural_Health_Networks_How_Network_Analysis_Can_Inform_Patient_Care_and_Organizational_Collaboration_in_a_Rural_Breast_Cancer_Screening_Network","320169364_Self-Selection_and_Comparative_Advantage_in_Social_Interactions","315119237_Social_Network_Analysis_SNA"]}