{"id":"33518502_In-vivo_and_postmortem_biomechanics_of_abdominal_organs_under_compressive_loads_experimental_approach_in_a_laparoscopic_surgery_setup","abstract":"Thesis (Ph. D.)--University of Washington, 2003 In order to provide realistic haptic (touch) feedback, simulators must incorporate accurate computational models of the in-vivo mechanical behavior of soft tissues. It is important to test tissues in surgically relevant ranges of applied force, duration, and deformation. In order to determine these ranges, a system known as the Blue DRAGON has been created that can track the motions of and the forces applied to surgical tools during live procedures. Thirty-one surgeons of varying skill were recorded performing three different surgical tasks. The mean force applied to the tool handles during tissue grasps was 8.52 N +/- 2.77 N. Ninety-five percent of the handle angle frequency content was below 1.98 Hz +/- 0.98 Hz. Average grasp time was 2.29 s +/- 1.65 s, and 95% of all grasps observed were held for less than 8.86 s +/- 7.06 s. The average maximum grasp time performed by surgeons during these tasks was 13.37 s +/- 11.42 s.Using these values as design parameters, a computer-controlled, motorized endoscopic grasper (MEG) has been designed to obtain biomechanical properties of soft tissues in-vivo. The MEG uses a geared DC motor to drive a Babcock grasper using a cable-and-pulley mechanism. The motor is capable of producing the equivalent of 26.5 N of grasping force (470 kPa) by the end effector jaws. Two strain gage force-sensing beams are mounted in the partial pulley to accurately measure applied force. Computer-control is provided using a proportional-derivative position controller to command cyclic (up to 3 Hz) or step loadings. The MEG can be hand-held, weighs about 0.7 kg, and can be inserted into the body through standard endoscopic ports. The MEG has been calibrated and validated on linear springs with known stiffness.The MEG has been used to test 7 different porcine abdominal organs in-vivo and through 24 hours postmortem. Elastic and relaxation properties have been recorded and analyzed. Constitutive force-deformation relations have been fit to the elastic data, and stress relaxation functions have been fit to the stress-time data recorded during relaxation tests. An understanding of how the tissue properties and model parameters are influenced by time postmortem and loading condition has been obtained.","authors":["Jeffrey Dale Brown"],"meta":[],"references":[]}