{"id":"335155695_Pattern_recognation_for_study_period_of_student_in_Mathematics_Department_with_C45_algorithm_data_mining_technique_at_the_Faculty_of_Mathematics_and_Natural_Science_Universitas_Sriwijaya","abstract":"The study period pattern of student can facilitate the stakeholders to improve education services in their institutions. This study investigated the study period pattern of the graduated students from January 2014 until February 2018 with the C4.5 algorithm. The obtained data from three academic years 2011, 20112, and 2013 is 140 students with 18 frequently repeated subjects. The total attributes that used in the study are 19 attributes. These attributes contain 18 frequently repeated subject and one attribute for the label is from the study period of a student (punctual or not punctual). This study used the method of K-fold cross-validation with K = 10 and the percentage split with the percentage is 66% to measure the performance of the algorithm C4.5. The results of both methods showed that the subjects that affect sequentially in the study period of the student are a complex function, numerical methods, introduction to computer science, computer programs and basic physics. The accuracy of the results obtained from both the training process K-fold cross-validation amounted to 84.29% and 72.92% for percentage split. It shows that algorithm C4.5 is quite well in predicting the pattern of the study period of a student majoring in mathematics, Department of Universitas Sriwijaya.","authors":["Sugandi Yahdin","Anita desiani","Ali Amran","Desty Rodiah"],"meta":["July 2019Journal of Physics Conference Series 1282(1):012014","DOI:10.1088/1742-6596/1282/1/012014"],"references":["301546254_Implementasi_Data_Mining_dengan_Algoritma_C45_untuk_Memprediksi_Tingkat_Kelulusan_Mahasiswa","265162251_A_comparative_study_of_decision_tree_ID3_and_C45","221665812_Data_Mining_Applications_A_comparative_Study_for_Predicting_Student'sperformance","221570467_Predicting_Students_Drop_Out_A_Case_Study","316600283_Data_Mining_Concepts_and_Techniques","260439499_Credal-C45_Decision_tree_based_on_imprecise_probabilities_to_classify_noisy_data","260355884_Data_Mining_in_Education","228654443_Predicting_students_drop_out_A_case_study"]}