{"id":"335124263_Computer_Vision_and_the_Digital_Humanities_Adapting_Image_Processing_Algorithms_and_Ground_Truth_through_Active_Learning","abstract":"Automated computer vision methods and tools offer new ways of analysing audio-visual material in the realm of the Digital Humanities (DH). While there are some promising results where these tools can be applied, there are basic challenges, such as algorithmic bias and the lack of sufficient transparency, one needs to carefully use these tools in a productive and responsible way. When it comes to the socio-technical understanding of computer vision tools and methods, a major unit of sociological analysis, attentiveness, and access for configuration (for both computer vision scientists and DH scholars) is what computer science calls “ground truth”. What is specified in the ground truth is the template or rule to follow, e.g. what an object looks like. This article aims at providing scholars in the DH with knowledge about how automated tools for image analysis work and how they are constructed. Based on these insights, the paper introduces an approach called “active learning” that can help to configure these tools in ways that fit the specific requirements and research questions of the DH in a more adaptive and user-centered way. We argue that both objectives need to be addressed, as this is, by all means, necessary for a successful implementation of computer vision tools in the DH and related fields.","authors":["Christoph Musik","Matthias Zeppelzauer"],"meta":["December 2018VIEW Journal of European Television History and Culture 7(14):59-72","DOI:10.18146/2213-0969.2018.jethc153"],"references":["323857616_VIAL_a_unified_process_for_visual_interactive_labeling","315618352_Wenn_Filmwissenschaftler_versuchen_sich_Maschinen_verstandlich_zu_machen","224330777_Machine_Recognition_of_Human_Activities_A_Survey","4350166_Analysis_of_Historical_Artistic_Documentaries","322675073_Mitigating_Unwanted_Biases_with_Adversarial_Learning","225440252_Lumping_and_Splitting_Notes_on_Social_Classification","220460936_Relevance_feedback_in_image_retrieval_A_comprehensive_review"]}