{"id":"335277396_Mining_significant_trend_sequences_in_dynamic_attributed_graphs","abstract":"Discovering patterns in graphs has many applications such as social network, biological and chemistry data analysis. Although many algorithms were proposed to identify interesting patterns in graphs, most of them consider simple types of graphs such as static graphs or graphs having a single attribute per vertex. Recently, studies have considered discovering frequent patterns in dynamic attributed graphs. These graphs can represent not only relationships between entities but also how they evolve over time, and describe entities with multiple attributes. Algorithms for mining frequent patterns in dynamic attributed graphs select patterns based on their occurrence frequency. But a major drawback of this approach is that many frequent patterns may contain entities that are weakly correlated. Thus, numerous frequent but spurious patterns may be shown to the user. To allows discovering strongly correlated patterns in dynamic attributed graphs, this paper proposes a novel significance measure named Sequence Virtual Growth Rate. It allows evaluating if a pattern represents entities that are correlated in terms of their proximity in a graph over time. Based on this measure a novel type of graph patterns is defined called Significant Trend Sequence. To efficiently mine these patterns, two algorithms named TSeqMiner (dfs-bfs) and TSeqMiner (dfs-dfs) are proposed. They rely on a novel upper bound and pruning strategy to reduce the search space. Experimental results show that the proposed algorithms are efficient and can identify interesting patterns in real-world social network and flight data.","authors":["Philippe Fournier Viger","Chao Cheng","Cheng Zhi","Chun-Wei Jerry Lin"],"meta":["July 2019Knowledge-Based Systems 182","DOI:10.1016/j.knosys.2019.06.005","Projects: Mining patterns in graphsMining Dynamic Attributed Graph for Spatio-Temporal Data"],"references":["330098222_Mining_Local_and_Peak_High_Utility_Itemsets","326357685_Dynamic_graph_summarization_a_tensor_decomposition_approach","321892365_A_Pattern_Tree_Based_Method_for_Mining_Conditional_Contrast_Patterns_of_Multi-source_Data","321694732_Extracting_Non-redundant_Correlated_Purchase_Behaviors_by_Utility_Measure","332926718_An_Efficient_Method_for_Mining_High_Utility_Closed_Itemsets","330490641_A_Survey_of_High_Utility_Sequential_Pattern_Mining","326226381_Dynamic_Graph_Embedding_for_Fault_Detection","324634098_Scalable_Interactive_Dynamic_Graph_Clustering_on_Multicore_CPUs","322816736_Network-to-Network_Control_Over_Heterogeneous_Topologies_A_Dynamic_Graph_Approach","322108803_Damped_Window_based_High_Average_Utility_Pattern_Mining_over_data_streams","318185234_Mining_Frequent_Subgraph_Pattern_Over_a_Collection_of_Attributed-Graphs_and_Construction_of_a_Relation_Hierarchy_for_Result_Reporting","315929128_Modeling_and_Density_Estimation_of_an_Urban_Freeway_Network_Based_on_Dynamic_Graph_Hybrid_Automata","316369118_Mining_of_Location-Based_Social_Networks_for_Spatio-Temporal_Social_Influence","316369041_Community_Detection_in_Graph_Streams_by_Pruning_Zombie_Nodes","315955430_An_Up-to-Date_Comparison_of_State-of-the-Art_Classification_Algorithms"]}