{"id":"335236052_Measuring_Tree_Height_with_Remote_Sensing-A_Comparison_of_Photogrammetric_and_LiDAR_Data_with_Different_Field_Measurements","abstract":"We contribute to a better understanding of different remote sensing techniques for tree height estimation by comparing several techniques to both direct and indirect field measurements. From these comparisons, factors influencing the accuracy of reliable tree height measurements were identified. Different remote sensing methods were applied on the same test site, varying the factors sensor type, platform, and flight parameters. We implemented light detection and ranging (LiDAR) and photogrammetric aerial images received from unmanned aerial vehicles (UAV), gyrocopter, and aircraft. Field measurements were carried out indirectly using a Vertex clinometer and directly after felling using a tape measure on tree trunks. Indirect measurements resulted in an RMSE of 1.02 m and tend to underestimate tree height with a systematic error of −0.66 m. For the derivation of tree height, the results varied from an RMSE of 0.36 m for UAV-LiDAR data to 2.89 m for photogrammetric data acquired by an aircraft. Measurements derived from LiDAR data resulted in higher tree heights, while measurements from photogrammetric data tended to be lower than field measurements. When absolute orientation was appropriate, measurements from UAV-Camera were as reliable as those from UAV-LiDAR. With low flight altitudes, small camera lens angles, and an accurate orientation, higher accuracies for the estimation of individual tree heights could be achieved. The study showed that remote sensing measurements of tree height can be more accurate than traditional triangulation techniques if the aforementioned conditions are fulfilled.","authors":["Selina Ganz","Yannek Käber","Petra Adler"],"meta":["August 2019Forests 10(8):694","DOI:10.3390/f10080694","Project: Pro-Qual-Tools: \"Weiterentwicklung statistischer Holzaufkommensprognoseverfahren zur Differenzierung von Rohholzsorten und Produktqualität\""],"references":["332058299_UAV-Based_Photogrammetric_Tree_Height_Measurement_for_Intensive_Forest_Monitoring","331903100_Digital_Aerial_Photogrammetry_for_Updating_Area-Based_Forest_Inventories_A_Review_of_Opportunities_Challenges_and_Future_Directions","331888423_Potential_of_Modern_Photogrammetry_Versus_Airborne_Laser_Scanning_for_Estimating_Forest_Variables_in_a_Mountain_Environment","327917178_Vegetation_Phenology_Driving_Error_Variation_in_Digital_Aerial_Photogrammetrically_Derived_Terrain_Models","324808407_A_simple_method_for_direct_crown_base_height_estimation_of_individual_trees_using_airborne_LiDAR_data","319635657_Towards_Automated_Forest_Mapping","316588344_Accuracy_of_Photogrammetric_UAV-Based_Point_Clouds_under_Conditions_of_Partially-Open_Forest_Canopy","315112214_Estimating_tree_heights_with_images_from_an_unmanned_aerial_vehicle","315027092_Unmanned_aerial_systems_for_precision_forest_inventory_purposes_A_review_and_case_study","322853346_Automatisierte_Einzelbaumextraktion_im_Forst_Analyse_und_Optimierung_von_Aufnahmeparametern_und_Prozessierungsschritten_von_der_Luftbildaufnahme_bis_zum_attributierten_Einzelbaum"]}