{"id":"335202487_Automatic_estimation_of_body_weight_and_body_condition_score_in_dairy_cows_using_3D_imaging_technique","abstract":"The main aim of this MSc thesis was to investigate the possibility of using three dimensional (3D) imaging technique for automatic estimation of body weight in dairy cows of two breeds; Swedish Holstein and the Swedish Red Breed (SRB). Reference data for validation of automatic BCS in SRB has been collected in previous studies and an important part of this study was to collect reference data on one more breed; the Swedish Holstein. Data collection lasted from April to July, 2010 and was performed at Jälla agricultural school, Uppsala. The data collection included 120 dairy cows, 70 of the SRB and 40 Swedish Holstein. Body weight and 3D images were collected automatically twice daily. Manual body condition score (BCS) as reference data was performed once a week and measurements of back fat thickness were carried out at three occasions during the data collection period. The image analysis showed that the camera had difficulties to identify the shape of the body in cows with black pigment, and therefore, only cows of SRB were included in the results. Data was analyzed by linear regression and the highest correlations were found between estimated body weight by camera and measured body weight by scale (R=0.87; P< 0.001) and BSC estimated by camera and manual BCS (R=0.84; P<0.001). A day to day variation of 5.33%, 2.83 % and 7.01 % was found for body weight estimated by camera, body weight measured by scale and automatic BCS respectively. It was concluded that estimations of body weight can be performed by the 3D imaging technique and that correlation between manual BCS and automatic BCS is in agreement with previous studies. The repeatability, precision and sensitivity of the method were good but estimation of body weight would probably be improved by including BCS, milk yield and rumen fill degree in the model. Application of this product should focus on identifying changes in physical state of the animal and could then be a powerful tool monitoring heard health and fertility.","authors":["Dorota Anglart"],"meta":["October 2010","DOI:10.13140/RG.2.2.26909.26084","Thesis for: MSc ThesisAdvisor: Sigrid Agenäs, Bohao Liao"],"references":["313505253_A_body_condition_scoring_chart_of_Holstein_dairy_cows","274529678_Ultrasonic_assessment_of_body_condition_changes_of_the_dairy_cow_during_lactation","259371362_Prediction_of_empty_body_weight_and_composition_from_live_weight_and_other_live_animal_measurements_in_lactating_dairy_cows","256748856_Relationship_Between_Body_Condition_Score_and_Composition_of_Ninth_to_Eleventh_Rib_Tissue_in_Holstein_Dairy_Cows","256534736_Effects_of_physiological_state_and_body_fatness_on_digestive-tract_weight_and_composition_in_the_dairy_cow","250204826_Optimum_Growth_Patterns_for_Dairy_Cattle1","248650589_The_weight_and_concentration_of_body_components_in_high_genetic_merit_Holstein-Friesian_dairy_cows_managed_on_four_different_grassland-based_feeding_regimes","248565828_Effect_of_feeding_regime_growth_intensity_and_age_at_first_insemination_on_performances_and_longevity_of_Holstein_heifers_born_during_autumn","242222245_A_Dairy_Cow_Body_Condition_Scoring_System_and_Its_Relationship_to_Selected_Production_Characteristics","240627245_Effect_of_Rapid_Growth_with_Fattening_of_Dairy_Heifers_on_Their_Lactational_Ability"]}