{"id":"335219880_Considering_Uncertainty_in_Modeling_Historical_KnowledgeI","abstract":"Simplifying and structuring qualitatively complex knowledge, quantifying it in a certain way to make it reusable and easily accessible are all aspects that are not new to historians. Computer science is currently approaching a solution to some of these problems, or at least making it easier to work with historical data. In this paper, we propose a historical knowledge representation model taking into consideration the quality of imperfection of historical data in terms of uncertainty. To do this, our model design is based on a multilayer approach in which we distinguish three informational levels: information, source, and belief whose combination allows modeling and modulating historical knowledge. The basic principle of this model is to allow multiple historical sources to represent several versions of the history of a historical event with associated degrees of belief. In our model, we differentiated three levels of granularity (attribute, object, relation) to express belief and defined 11 degrees of uncertainty in belief. The proposed model can be the object of various exploitations that fall within the historian's decision-making support for the plausibility of the history of historical events.","authors":["Fairouz Zendaoui","Walid Khaled Hidouci"],"meta":["August 2019","DOI:10.22042/isecure.2019.11.0.8","Project: Représentation des connaissances pour les faits historiques"],"references":["290545997_Semantic_Networks_and_Historical_Knowledge_Management_Introducing_New_Methods_of_Computer-based_Research","284575755_Semantic_technologies_for_historical_research_A_survey","278631239_Conception_d'un_systeme_multidimensionnel_d'information_sur_la_qualite_des_donnees_geospatiales","276934861_History_on_the_semantic_web_as_linked_data-an_event_gazetteer_and_timeline_for_the_world_war_i","46651292_Past_Present_and_Future_of_Historical_Information_Science","286686463_Models_of_uncertainty_in_spatial_data","278761469_The_SyMoGIH_project_and_Geo-Larhra_A_method_and_a_collaborative_platform_for_a_digital_historical_atlas","267922952_Systemes_d'Information_et_Management_des_Organisations","220605375_The_CIDOC_Conceptual_Reference_Module_An_Ontological_Approach_to_Semantic_Interoperability_of_Metadata","220309066_DRUMS_Defeasible_Reasoning_and_Uncertainty_Management_Systems"]}