{"id":"335210064_On_the_Philosophical_Foundations_of_Conceptual_Models","abstract":"This paper contributes to the philosophical foundations of conceptual modeling by addressing a number of foundational questions such as: What is a conceptual model? Among models used in computer science, which are conceptual , and which are not? How are conceptual models different from other models used in the Sciences and Engineering? The paper takes a stance in answering these questions and, in order to do that, it draws from a broad literature in philosophy, cognitive science, Logics, as well as several areas of Computer Science (including Databases, Software Engineering, Artificial Intelligence, Information Systems Engineering , among others). After a brief history of conceptual modeling, the paper addresses the aforementioned questions by proposing a characterization of conceptual models with respect to conceptual semantics and ontological commitments. Finally, we position our work w.r.t. to a \"Reference Framework for Conceptual\" modeling recently proposed in the literature.","authors":["Nicola Guarino","Giancarlo Guizzardi","John Mylopoulos"],"meta":["August 2019","Conference: 29th International Conference on Information Modelling and Knowledge Bases (EJC 2019)","Project: Ontological Foundations of Conceptual Modeling and Knowledge Representation"],"references":["290468542_Ontological_Patterns_Anti-Patterns_and_Pattern_Languages_for_Next-Generation_Conceptual_Modeling","279393123_Ontology-Based_Evaluation_and_Design_of_Visual_Conceptual_Modeling_Languages","272169039_Formal_Ontologies_and_Information_Systems","270356906_Saving_the_Phenomena","269931610_Logical_Ontological_and_Cognitive_Aspects_of_Object_Types_and_Cross-World_Identity_with_Applications_to_the_Theory_of_Conceptual_Spaces","262852017_Can_Ontologies_Systematically_Help_in_the_Design_of_Domain-Specific_Visual_Languages","328247403_Universals_An_Opinionated_Introduction","327473868_A_Reference_Framework_for_Conceptual_Modeling","313142231_Logic_and_conversation","269513783_Engineering_and_the_Mind's_Eye"]}