{"id":"335391586_Mobile-learning_aprendizagem_matematica_por_meio_de_realidade_aumentada","abstract":"Resumo: O presente trabalho explora a aprendizagem matemática por meio do m-learning e tem como principal objetivo apresentar a criação de um aplicativo de Realidade Aumentada utilizado como um recurso tecnológico no estudo de mapas de contorno e geometria espacial que tem a capacidade de interpretar marcadores Vumark. Essa tecnologia mostrou-se capaz de possibilitar novas situações de potencialização de aprendizagem por meio de aparelhos portáteis e acessíveis a qualquer momento e ambiente. Neste trabalho, concluiu-se que o aplicativo, direcionado para atividades de geometria espacial, pode ser utilizado como uma possibilidade de apoio aos estudantes de ensino médio, em vista que os resultados da investigação evidenciaram um desenvolvimento satisfatório dos participantes durante as atividades propostas.Palavras-chave: Realidade Aumentada. Matemática. Mapas de contorno. Geometria Espacial. Vumark. MOBILE-LEARNING: MATHEMATICAL LEARNING BY AUGMENTED REALITYAbstract: The present work explores mathematical learning through m-learning and has as main objective to present the creation of an Augmented Reality (AR) application used as a technological resource in the study of contour maps and spatial geometry that has the capacity to interpret Vumark markers. This technology has proved capable of enabling new situations of learning potential through portable devices and accessible at any time and environment. However, further studies and applications of the application in the field of education are necessary in order to obtain better results on the resource as an allied to mathematical knowledge. In this work, it was concluded that the application, directed to activities of spatial geometry, can be used as a possibility of support to high school students, since the results of the investigation has showed a satisfactory development of the participants during the proposed activities.Keywords: Augmented Reality. Math. Contour Maps. Spatial Geometry. Vumark.","authors":["Bruno Resende","Thaisa Muller"],"meta":["December 2018#Tear Revista de Educação Ciência e Tecnologia 7(2)","DOI:10.35819/tear.v7.n2.a3187"],"references":["276118272_A_implementacao_de_midias_em_dispositivos_moveis_um_framework_para_a_aplicacao_em_larga_escala_e_com_sustentabilidade_em_educacao_a_distancia","273143784_Possibilidades_de_uso_de_Realidade_Aumentada_Movel_para_AEC","259399243_Realidade_Aumentada_e_Ubiquidade_na_Educacao","255644767_Aprendizagem_utilizando_Dispositivos_Moveis_com_Sistemas_de_Realidade_Virtual","241463735_Fundamentos_e_Tecnologia_de_Realidade_Virtual_e_Aumentada","276118380_Um_panorama_da_pesquisa_sobre_aprendizagem_movel_m-learning"]}