{"id":"335334559_PENERAPAN_CROSSOVER_PADA_PERILAKU_LEBAH_SCOUT_DALAM_ALGORITMA_ARTIFICIAL_BEE_COLONY_UNTUK_OPTIMASI_VEHICLE_ROUTING_PROBLEM","abstract":"The economy in Indonesia has shown a relatively consistent increase from year to year where the growth rate at the end of 2017 is 5.5%. In terms of the trade balance, according to the Indonesian Central Bureau of Statistics (BPS) on January 15, 2018 it was said that Indonesia's trade balance had a surplus of 11.84 billion US dollars. The development of the trade sector in Indonesia is also inseparable from the distribution of goods. The distribution of goods is closely related to the distribution cost factor, because the longer the distribution distance, the longer the time and the greater the operational costs needed to distribute the goods. Therefore, it is necessary to determine the optimal distribution channel to obtain distribution efficiency. The problem of distributing this item to the world of computer science is known as the Vehicle Routing Problem (VRP). Along with the rapid development of technology and information, with the use of technology, research related to the distribution of goods has also been carried out. One method that has superior ability in determining the distribution route is artificial bee colony (ABC). Although it has superior performance, the ABC algorithm still has weaknesses where ABC requires a relatively long time to get an optimum solution. The main cause of this weakness is the bee scout technique in finding solutions (food sources). Looking at the weaknesses of the characteristics of bee scout in ABC, in this study the ABC algorithm was optimized by applying two crossover methods, namely Partially Mapped Crossover and Cycle Crossover on the solution search pattern by bee scout. Crossover is one of the optimization techniques aimed at finding the optimum solution in AG. This is the basis for the implementation of hybrid crossover in this vehicle routing problem. From the results of the study it was found that Cycle Crossover (CX) has a better performance than Partially Mapped Crossover (PMX) in optimizing the ABC algorithm, this can be seen from the CX solution produced for all datasets better than PMX. Besides having a better performance in terms of distance, CX also has a\nfaster time performance than PMX.\nKeywords: artificial bee colony, vehicle routing problem, crossover\nABSTRAK\nPerekonomian di Indonesia telah menunjukkan adanya peningkatan yang relatif konsisten dari tahun ke tahun dimana angka pertumbuhan pada penghujung tahun 2017 adalah 5,5 %. Dari sisi neraca perdagangan, menurut Badan Pusat Statistik (BPS) Indonesia pada tanggal 15 Januari 2018 dikatakan bahwa Neraca Perdagangan Indonesia mengalami surplus sebesar 11,84 milliar dolar AS. Perkembangan sektor perdagangan di Indonesia juga tidak terlepas dari faktor pendistribusian barang. Pendistribusian barang memiliki kaitan yang erat dengan faktor biaya distribusi, karena semakin jauh jarak pendistribusiannya maka semakin lama waktu dan semakin besar biaya operasional yang diperlukan dalam mendistribusikan barang tersebut. Maka dari itu, diperlukan penentuan jalur distribusi yang optimal untuk mendapatkan efisiensi pendistribusian. Permasalahan pendistribusian barang ini pada dunia ilmu komputer dikenal sebagai Vehicle Routing Problem (VRP). Seiring berkembangnya teknologi dan informasi yang pesat, dengan pemanfaatan teknologi, penelitian yang berkaitan dengan pendistribusian barang ini juga telah dilakukan. Salah satu metode yang memiliki kemampuan unggul dalam menentukan rute distribusi adalah artificial bee colony (ABC). Meski memiliki performa yang unggul, tetapi dalam algoritma ABC masih memiliki kelemahan dimana ABC membutuhkan waktu yang relatif lama untuk mendapatkan sebuah solusi optimum. Penyebab utama yang menyebabkan kelemahan ini adalah teknik lebah scout dalam mencari solusi (sumber makanan). Melihat kelemahan karakteristik lebah scout dalam ABC maka dalam penelitian ini dilakukan optimasi algoritma ABC dengan menerapkan dua metode crossover yaitu Partially Mapped Crossover dan Cycle Crossover pada pola pencarian solusi oleh lebah scout.\nCrossover merupakan salah satu teknik optimasi yang ditujukan untuk pencarian solusi optimum\ndalam AG. Hal ini menjadi dasar untuk penerapan hybrid crossover dalam permasalahan vehicle\nrouting problem ini. Dari hasil penelitian didapatkan bahwa Cycle Crossover (CX) memiliki kinerja\nyang lebih baik daripada Partially Mapped Crossover (PMX) dalam mengoptimasi algoritma ABC,\nhal ini terlihat dari solusi CX yang dihasilkan untuk semua dataset lebih baik dari PMX. Selain\nmemiliki kinerja yang lebih baik dalam hal jarak, CX juga memiliki kinerja waktu yang lebih cepat\ndaripada PMX.\nKata Kunci: artificial bee colony, vehicle routing problem, crossover","authors":["I Made Widiartha","Ngurah Agus Sanjaya ER","I Wayan Santiyasa"],"meta":["February 2019Jurnal Teknologi Informasi dan Komputer 5(1)","DOI:10.36002/jutik.v5i1.637"],"references":["273338158_A_hybrid_artificial_bee_colony_algorithm_for_numerical_function_optimization"]}