{"id":"335375384_Market_demand_for_climate_services_An_assessment_of_users'_needs","abstract":"As organisations start to make combatting climate change a more prominent part of their sustainability plans, climate services are emerging among a broad range of industries and for multiple purposes. The analysis provided in this paper depicts how such changes are unfolding among both traditional and non-traditional climate service sectors. In addition to desktop research, data has been collected via an online survey conducted among climate service users around the world (n = 248), and from interviews with both users and non-users of climate services (n = 36) across three economic sectors in Europe: food and drink; manufacturing; and pharmaceuticals and healthcare. These sectors were chosen for this paper due to their potential links to climate services, and the fact that they provide a glimpse into how climate services can be used in conjunction with the private sector.\nAnalysis shows that users have a greater need for either past climate data or data analysis that falls within the next year, meaning they are less interested in long-term data with higher uncertainties. Moreover, while climate services hold great potential and offer huge societal benefits, their presence is not always easy to find outside of research purposes. Policies and regulations can fill this gap and be a strong purchase driver for climate services, as can the development of climate services that help companies achieve their corporate social responsibility and sustainability goals.","authors":["Suzi Tart","Markus Groth","Peer Seipold"],"meta":["August 2019Climate Services 17(4):100109","DOI:10.1016/j.cliser.2019.100109"],"references":["331308645_The_market_for_climate_services_in_the_tourism_sector_-_An_analysis_of_Austrian_stakeholders'_perceptions","329572783_From_generating_to_using_climate_services-How_the_EU-MACS_and_MARCO_projects_help_to_unlock_the_market_potential","321808469_Developing_climate_services_the_role_of_the_energy_sector","320347432_ANALYSIS_OF_EXISTING_DATA_INFRASTRUCTURE_FOR_CLIMATE_SERVICES","319141440_ASSESSMENT_OF_THE_EXISTING_RESOURCING_AND_QUALITY_ASSURANCE_OF_CURRENT_CLIMATE_SERVICES","317785236_Sectoral_use_of_climate_information_in_Europe_A_synoptic_overview","321240204_A_Climate_Stress-Test_of_the_Financial_System","318866326_Climate_Interactions_with_the_Built_Environment_in_the_Southeast_USA","318331584_Corporate_climate_risk_management_Are_European_companies_prepared","316682841_Key_economic_sectors_and_services"]}