{"id":"335322387_CBIR_system_using_Capsule_Networks_and_3D_CNN_for_Alzheimer's_disease_diagnosis","abstract":"Alzheimer’s disease (AD) is an irreversible disorder of the brain related to loss of memory, commonly seen in the elderly and aging population. Implementation of revolutionary computer aided diagnosis techniques with Content Based Image Retrieval (CBIR) has created new potentials in Magnetic resonance imaging (MRI) in relevant image retrieval and training for detection of progression of AD in early stages. This paper proposed a CBIR system using 3D Capsule Network, 3D-Convolutional Neural Network and pre-trained 3D-autoencoder technology for early detection of Alzheimer's. A 3D-Capsule Networks (CapsNets) is capable of fast learning, even for small datasets and can effectively handle robust image rotations and transitions. It was observed that an ensemble method using 3D-CapsNets and a convolutional neural network (CNN) with 3D-autoencoder, increased the detection performance comparing to Deep-CNN alone. CBIR using the proposed model was found to be up to 98.42% accurate in AD classification. CapsNet is a promising new technique for image classification, and further experiments using more robust computation resources and refined CapsNet architectures may produce better outcomes.","authors":["Kruthika Kr","Rajeswari","H.D. Maheshappa"],"meta":["August 2019Informatics in Medicine Unlocked 16:100227","DOI:10.1016/j.imu.2019.100227"],"references":["327995621_Brain_Tumor_Type_Classification_via_Capsule_Networks","322412422_Review_of_deep_convolution_neural_network_in_image_classification","321574776_Harmonic_Networks_Deep_Translation_and_Rotation_Equivariance","320344963_A_Review_of_Convolutional_Neural_Networks_for_Inverse_Problems_in_Imaging","322584207_A_deep_CNN_based_multi-class_classification_of_Alzheimer's_disease_using_MRI","321936509_Query-Efficient_Black-box_Adversarial_Examples","321745331_Capsule_Network_Performance_on_Complex_Data","320627198_Dynamic_Routing_Between_Capsules","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319684043_Classification_of_Alzheimer_and_MCI_Phenotypes_on_MRI_Data_Using_SVM"]}