{"id":"335396501_A-Case-of-Cultural-Conflict-Centering-around-Communal-Computer-at-a-University-in-Japan-as-a-Transcultural-Contact-Zone","abstract":"In this case study, a conflict in the concept of \"communal computer\" is to be reviewed and analyzed in numerous internet messages that were exchanged for about three months in 2015, and the actual setting up by one of the actors that caused the fatal damage to one of the actors' computer. These actors' cultural backgrounds include Chinese, Japanese and Americans. The scene takes place at a Japanese university; a task was to set up a computer to be used for \"communal use.\" The central argument is about the transculturation of the \"contact zone (Pratt, 1992)\" in which logics of three cultures land on the appropriateness through a case study of conflict. Questions include, \"how three subjugated and dominant cultural players show the modes of the concept of \"communal property,\" and \"how they appropriate their concepts.\" Through knowing different modes of appropriateness, or \"what they make it mean (Ibid. p.7),\" modes to a coherent peace can be suggested. In other words, all three aspects, not one, should be taken into consideration when it comes to \"an agreement.\" It appeared that a Japanese professor in computer science claims \"communal property\" usage is legitimized by financial ownership, so authorized persons share the password. A Chinese believes that a \"communal\" computer should be available to anyone at large, so that there should be no restrictions on anyone, thus, a password was posted on the monitor for a \"communal\" e-mail address. A professor with an American cultural value claims that it is a violation of law unless the contract is made to cover a multiple number of users. Thus, the concept, \"communal property\" plays in ownership, authorizing decisions, access, and usage specified in the contract. The author suggests, all these aspects should be informed thoroughly to actors prior to the installation of a communal computer.","authors":["Inaba Hisako","Bojan Obrenovic","Umidjon Akhunjonov"],"meta":["December 2016","Project: International Journal of Innovation and Economic Development"],"references":["331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","274356980_The_Interpretation_of_Cultures_Selected_Essays","274186763_Basic_Features_of_the_Legal_Political_and_Economic_Thought_of_Japan","269480876_Public_and_Private_Self_in_Japan_and_the_United_States_Communicative_Styles_of_Two_Cultures","37694292_Anthropology_as_Cultural_Critique_An_Experimental_Moment_in_the_Human_Sciences"]}