{"id":"335308334_Predicting_sepsis_with_a_recurrent_neural_network_using_the_MIMIC_III_database","abstract":"Objective: \nPredicting sepsis onset with a recurrent neural network and performance comparison with InSight - a previously proposed algorithm for the prediction of sepsis onset.\n\nMethodology: \nA retrospective analysis of adult patients admitted to the intensive care unit (from the MIMIC III database) who did not fall under the definition of sepsis at the time of admission. The area under the receiver operating characteristic (AUROC) measures the performance of the prediction task. We examine the sequence length given to the machine learning algorithms for different points in time before sepsis onset concerning the prediction performance. Additionally, the impact of sepsis onset's definition is investigated. We evaluate the model with a relatively large and thus more representative patient population compared to related works in the field.\n\nResults: \nFor a prediction 3 h prior to sepsis onset, our network achieves an AUROC of 0.81 (95% CI: 0.78-0.84). The InSight algorithm achieves an AUROC of 0.72 (95% CI: 0.69-0.75). For a fixed sensitivity of 90% our network reaches a specificity of 47.0% (95% CI: 43.1%-50.8%) compared to 31.1% (95% CI: 24.8%-37.5%) for InSight. In addition, we compare the performance for 6 and 12 h prediction time for both approaches.\n\nConclusion: \nOur findings demonstrate that a recurrent neural network is superior to InSight considering the prediction performance. Most probably, the improvement results from the network's ability of revealing time dependencies. We show that the length of the look back has a significant impact on the performance of the classifier. We also demonstrate that for the correct detection of sepsis onset for a retrospective analysis, further research is necessary.","authors":["Matthieu Scherpf","Felix Magnus Gräßer","Hagen Malberg","Sebastian Zaunseder"],"meta":["August 2019Computers in Biology and Medicine 113:103395","DOI:10.1016/j.compbiomed.2019.103395","Project: Predicting sepsis in the ICU"],"references":["331095794_Machine-Learning-Based_Laboratory_Developed_Test_for_the_Diagnosis_of_Sepsis_in_High-Risk_Patients","322740246_Multicentre_validation_of_a_sepsis_prediction_algorithm_using_only_vital_sign_data_in_the_emergency_department_general_ward_and_ICU","322704977_Raising_concerns_about_the_Sepsis-3_definitions","309701430_Prediction_of_Sepsis_in_the_Intensive_Care_Unit_With_Minimal_Electronic_Health_Record_Data_A_Machine_Learning_Approach","322133343_An_Interpretable_Machine_Learning_Model_for_Accurate_Prediction_of_Sepsis_in_the_ICU","321545496_Sepsis_und_MODS","321527443_Sepsis_Definitions_Pathophysiology_and_the_Challenge_of_Bedside_Management","319199374_Learning_representations_for_the_early_detection_of_sepsis_with_deep_neural_networks","319140126_Early_Sepsis_Detection_in_Critical_Care_Patients_Using_Multiscale_Blood_Pressure_and_Heart_rate_Dynamics","308152498_An_overview_of_gradient_descent_optimization_algorithms"]}