{"id":"335315939_Automatic_Extrinsic_Self-Calibration_of_Mobile_Mapping_Systems_Based_on_Geometric_3D_Features","abstract":"Mobile Mapping is an efficient technology to acquire spatial data of the environment. The spatial data is fundamental for applications in crisis management, civil engineering or autonomous driving. The extrinsic calibration of the Mobile Mapping System is a decisive factor that affects the quality of the spatial data. Many existing extrinsic calibration approaches require the use of artificial targets in a time-consuming calibration procedure. Moreover, they are usually designed for a specific combination of sensors and are, thus, not universally applicable. We introduce a novel extrinsic self-calibration algorithm, which is fully automatic and completely data-driven. The fundamental assumption of the self-calibration is that the calibration parameters are estimated the best when the derived point cloud represents the real physical circumstances the best. The cost function we use to evaluate this is based on geometric features which rely on the 3D structure tensor derived from the local neighborhood of each point. We compare different cost functions based on geometric features and a cost function based on the Rényi quadratic entropy to evaluate the suitability for the self-calibration. Furthermore, we perform tests of the self-calibration on synthetic and two different real datasets. The real datasets differ in terms of the environment, the scale and the utilized sensors. We show that the self-calibration is able to extrinsically calibrate Mobile Mapping Systems with different combinations of mapping and pose estimation sensors such as a 2D laser scanner to a Motion Capture System and a 3D laser scanner to a stereo camera and ORB-SLAM2. For the first dataset, the parameters estimated by our self-calibration lead to a more accurate point cloud than two comparative approaches. For the second dataset, which has been acquired via a vehicle-based mobile mapping, our self-calibration achieves comparable results to a manually refined reference calibration, while it is universally applicable and fully automated.","authors":["Markus Hillemann","Martin Weinmann","Markus Müller","Boris Jutzi"],"meta":["August 2019Remote Sensing 11(16):1955","DOI:10.3390/rs11161955"],"references":["323284243_Bias_Impact_Analysis_and_Calibration_of_UAV-Based_Mobile_LiDAR_System_with_Spinning_Multi-Beam_Laser_Scanner","319411454_UCalMiCeL_-_UNIFIED_INTRINSIC_AND_EXTRINSIC_CALIBRATION_OF_A_MULTI-CAMERA-SYSTEM_AND_A_LASERSCANNER","317312152_An_approach_to_extract_moving_objects_from_MLS_data_using_a_volumetric_background_representation","304369318_Indirect_Correspondence-Based_Robust_Extrinsic_Calibration_of_LiDAR_and_Camera","324867818_4-Plane_congruent_sets_for_automatic_registration_of_as-is_3D_point_clouds_with_3D_BIM_models","318697492_A_novel_method_for_the_extrinsic_calibration_of_a_2-D_laser-rangefinder_a_camera","314299264_Analytical_and_numerical_investigations_on_the_accuracy_and_robustness_of_geometric_features_extracted_from_3D_point_cloud_data","311240888_1_year_1000_km_The_Oxford_RobotCar_dataset","309317476_ORB-SLAM2_an_Open-Source_SLAM_System_for_Monocular_Stereo_and_RGB-D_Cameras","307531656_Fast_semantic_segmentation_of_3d_point_clouds_with_strongly_varying_density"]}