{"id":"335392768_Who_is_to_Blame_Runtime_Verification_of_Distributed_Objects_with_Active_Monitors","abstract":"Since distributed software systems are ubiquitous, their correct functioning is crucially important. Static verification is possible in principle, but requires high expertise and effort which is not feasible in many eco-systems. Runtime verification can serve as a lean alternative, where monitoring mechanisms are automatically generated from property specifications, to check compliance at runtime. This paper contributes a practical solution for powerful and flexible runtime verification of distributed, object-oriented applications, via a combination of the runtime verification tool Larva and the active object framework ProActive. Even if Larva supports in itself only the generation of local, sequential monitors, we empower Larva for distributed monitoring by connecting monitors with active objects, turning them into active, communicating monitors. We discuss how this allows for a variety of monitoring architectures. Further, we show how property specifications, and thereby the generated monitors, provide a model that splits the blame between the local object and its environment. While Larva itself focuses on monitoring of control-oriented properties, we use the Larva front-end StaRVOOrS to also capture data-oriented (pre/post) properties in the distributed monitoring. We demonstrate this approach to distributed runtime verification with a case study, a distributed key/value store.","authors":["Wolfgang Ahrendt","Ludovic Henrio","Wytse Oortwijn"],"meta":["August 2019","DOI:10.4204/EPTCS.302.3"],"references":["323082912_Runtime_Verification_for_Decentralised_and_Distributed_Systems","315784408_Verifying_data-_and_control-oriented_properties_combining_static_and_runtime_verification_theory_and_tools","309551158_Multiactive_objects_and_their_applications","302978476_Organising_LTL_Monitors_over_Distributed_Systems_with_a_Global_Clock","297554464_On_Implementing_a_Monitor-Oriented_Programming_Framework_for_Actor_Systems","295375264_StaRVOOrS_A_Tool_for_Combined_Static_and_Runtime_Verification_of_Java","320259898_A_Survey_of_Active_Object_Languages","319308021_Analysis_of_Synchronisations_in_Stateful_Active_Objects","293805625_SACO_Static_Analyzer_for_Concurrent_Objects","287222209_History-Based_Specification_and_Verification_of_Scalable_Concurrent_and_Distributed_Systems"]}