{"id":"335359944_Bayesian_Data_Analysis_in_Empirical_Software_Engineering_Research","abstract":"Statistics comes in two main flavors: frequentist and Bayesian. For historical and technical reasons, frequentist statistics have traditionally dominated empirical data analysis, and certainly remain prevalent in empirical software engineering. This situation is unfortunate because frequentist statistics suffer from a number of shortcomings---such as lack of flexibility and results that are unintuitive and hard to interpret---that curtail their effectiveness when dealing with the heterogeneous data that is increasingly available for empirical analysis of software engineering practice. In this paper, we pinpoint these shortcomings, and present Bayesian data analysis techniques that provide tangible benefits---as they can provide clearer results that are simultaneously robust and nuanced. After a short, high-level introduction to the basic tools of Bayesian statistics, we present the reanalysis of two empirical studies on the effectiveness of automatically generated tests and the performance of programming languages, respectively. By contrasting the original frequentist analyses with our new Bayesian analyses, we demonstrate the concrete advantages of the latter. To conclude we advocate a more prominent role for Bayesian statistical techniques in empirical software engineering research and practice.","authors":["Carlo Alberto Furia","Robert Feldt","Richard Torkar"],"meta":["August 2019IEEE Transactions on Software Engineering PP(99):1-1","DOI:10.1109/TSE.2019.2935974"],"references":["334182370_Evolution_of_statistical_analysis_in_empirical_software_engineering_research_Current_state_and_steps_forward","332251112_Inferential_Statistics_as_Descriptive_Statistics_There_Is_No_Replication_Crisis_if_We_Don't_Expect_Replication","331908769_Retire_statistical_significance","320014529_Abandon_Statistical_Significance","331758111_Why_Most_Published_Research_Findings_Are_False","330311648_Handbook_of_Markov_Chain_Monte_Carlo","329907480_Statistical_Rethinking_A_Bayesian_Course_with_Examples_in_R_and_Stan","329476370_Controlling_the_False_Discovery_Rate_A_Practical_and_Powerful_Approach_to_Multiple_Testing","324346734_Simultaneous_Statistical_Inference","319501436_Visualization_in_Bayesian_workflow"]}