{"id":"335382603_Semi-supervised_clustering_with_deep_metric_learning_and_graph_embedding","abstract":"As a common technology in social network, clustering has attracted lots of research interest due to its high performance, and many clustering methods have been presented. The most of existing clustering methods are based on unsupervised learning. In fact, we usually can obtain some/few labeled samples in real applications. Recently, several semi-supervised clustering methods have been proposed, while there is still much space for improvement. In this paper, we aim to tackle two research questions in the process of semi-supervised clustering: (i) How to learn more discriminative feature representations to boost the process of the clustering; (ii) How to effectively make use of both the labeled and unlabeled data to enhance the performance of clustering. To address these two issues, we propose a novel semi-supervised clustering approach based on deep metric learning (SCDML) which leverages deep metric learning and semi-supervised learning effectively in a novel way. To make the extracted features of the contribution of data more representative and the label propagation network more suitable for real applications, we further improve our approach by adopting triplet loss in deep metric learning network and combining bedding with label propagation strategy to dynamically update the unlabeled to labeled data, which is named as semi-supervised clustering with deep metric learning and graph embedding (SCDMLGE). SCDMLGE enhances the robustness of metric learning network and promotes the accuracy of clustering. Substantial experimental results on Mnist, CIFAR-10, YaleB, and 20-Newsgroups benchmarks demonstrate the high effectiveness of our proposed approaches.","authors":["Xiaocui Li","Hongzhi Yin","Ke Zhou","Xiaofang Zhou"],"meta":["March 2020World Wide Web 23(S6)","DOI:10.1007/s11280-019-00723-8"],"references":["334115697_Supervised_Clustering_of_Questions_into_Intents_for_Dialog_System_Applications","345445748_Social_Influence-Based_Group_Representation_Learning_for_Group_Recommendation","337234071_Kernelized_evolutionary_distance_metric_learning_for_semi-supervised_clustering","334717318_Origin-Destination_Matrix_Prediction_via_Graph_Convolution_a_New_Perspective_of_Passenger_Demand_Modeling","334714532_Streaming_Session-based_Recommendation","334400559_Unsupervised_multi-manifold_clustering_by_learning_deep_representation","333734983_Destination-Aware_Task_Assignment_in_Spatial_Crowdsourcing_A_Worker_Decomposition_Approach","332832415_Reference-Based_Framework_for_Spatio-Temporal_Trajectory_Compression_and_Query_Processing","332646593_Capped_l1-Norm_Sparse_Representation_Method_for_Graph_Clustering","332576039_Multi-hop_Path_Queries_over_Knowledge_Graphs_with_Neural_Memory_Networks","330330497_Multi-View_Spectral_Clustering_via_Integrating_Global_and_Local_Graphs","331806102_An_Automated_Spectral_Clustering_for_Multi-scale_Data","328644621_Modified_Quality_Threshold_Clustering_for_Temporal_Analysis_and_Classification_of_Lung_Lesions","328300346_Unsupervised_Adaptive_Hashing_Based_on_Feature_Clustering","328300194_Semi-supervised_Deep_Embedded_Clustering"]}