{"id":"335329380_A_novel_sub-epidemic_modeling_framework_for_short-term_forecasting_epidemic_waves","abstract":"Background: \nSimple phenomenological growth models can be useful for estimating transmission parameters and forecasting epidemic trajectories. However, most existing phenomenological growth models only support single-peak outbreak dynamics whereas real epidemics often display more complex transmission trajectories.\n\nMethods: \nWe develop and apply a novel sub-epidemic modeling framework that supports a diversity of epidemic trajectories including stable incidence patterns with sustained or damped oscillations to better understand and forecast epidemic outbreaks. We describe how to forecast an epidemic based on the premise that the observed coarse-scale incidence can be decomposed into overlapping sub-epidemics at finer scales. We evaluate our modeling framework using three outbreak datasets: Severe Acute Respiratory Syndrome (SARS) in Singapore, plague in Madagascar, and the ongoing Ebola outbreak in the Democratic Republic of Congo (DRC) and four performance metrics.\n\nResults: \nThe sub-epidemic wave model outperforms simpler growth models in short-term forecasts based on performance metrics that account for the uncertainty of the predictions namely the mean interval score (MIS) and the coverage of the 95% prediction interval. For example, we demonstrate how the sub-epidemic wave model successfully captures the 2-peak pattern of the SARS outbreak in Singapore. Moreover, in short-term sequential forecasts, the sub-epidemic model was able to forecast the second surge in case incidence for this outbreak, which was not possible using the simple growth models. Furthermore, our findings support the view that the national incidence curve of the Ebola epidemic in DRC follows a stable incidence pattern with periodic behavior that can be decomposed into overlapping sub-epidemics.\n\nConclusions: \nOur findings highlight how overlapping sub-epidemics can capture complex epidemic dynamics, including oscillatory behavior in the trajectory of the epidemic wave. This observation has significant implications for interpreting apparent noise in incidence data where the oscillations could be dismissed as a result of overdispersion, rather than an intrinsic part of the epidemic dynamics. Unless the oscillations are appropriately modeled, they could also give a false positive, or negative, impression of the impact from public health interventions. These preliminary results using sub-epidemic models can help guide future efforts to better understand the heterogenous spatial and social factors shaping sub-epidemic patterns for other infectious diseases.","authors":["Gerardo Chowell","Amna Tariq","James Mac Hyman"],"meta":["August 2019BMC Medicine 17(1)","DOI:10.1186/s12916-019-1406-6"],"references":["333089922_Quantitative_Methods_for_Investigating_Infectious_Disease_Outbreaks","332850633_Analyzing_and_forecasting_the_Ebola_incidence_in_North_Kivu_the_Democratic_Republic_of_the_Congo_from_2018-19_in_real_time","331028023_Assessing_the_performance_of_real-time_epidemic_forecasts_A_case_study_of_Ebola_in_the_Western_Area_region_of_Sierra_Leone_2014-15","330839796_Assessing_reporting_delays_and_the_effective_reproduction_number_The_2018-19_Ebola_epidemic_in_DRC_May_2018-January_2019","330402944_A_collaborative_multiyear_multimodel_assessment_of_seasonal_influenza_forecasting_in_the_United_States","330371506_Assessing_parameter_identifiability_in_compartmental_dynamic_models_using_a_computational_approach_application_to_infectious_disease_transmission_models","326851151_Neighbourhood_level_real-time_forecasting_of_dengue_cases_in_tropical_urban_Singapore","323927431_Traveling_wave_solutions_in_a_two-group_SIR_epidemic_model_with_constant_recruitment","321786137_Forecasting_the_2001_Foot-and-Mouth_Disease_Epidemic_in_the_UK","332050259_Ebola_public_trust_intermediaries_and_rumour_in_the_DR_Congo"]}