{"id":"335313082_An_Overview_on_Wireless_Sensor_Networks_and_Finding_Optimal_Location_of_Nodes","abstract":"In this review, our aim is to make a brief description about technology of Wireless Sensor Network (WSN) and its capability to pave the way in order to make connection between physical and virtual world based on Internet worldwide network. Hence, in this technology, sensor nodes play an important role to transmit data from a node to other defined nodes in its broaden range. Due to gain most optimal state from WSNs, subject of localization for radio frequency networks has a great importance in many technical applications such as military devices to detect specified local points to attack or defend, civil engineering and in general sensor networks. The main technology to obtain direct locations is GPS (Global Positioning System). After expressing a brief history on introduction part, we will go through in order to interrogate on main structure of WSNs regarding mathematical formulations and algorithms to find best and optimal access points based on Localization action. Then, we summarize algorithms and approaches to develop in order to introduce the best strategy in order to access nodes in the best possible state in WSNs. As a result, we conclude about the mentioned issues in order of comparison and reaching a final result. Therefore, final aim of this review is to explain efficiency and reliability of localization based on different opinions. Results show this overwhelming technology can be completely modified in order to find new solutions to find nodes in most optimal nodes based on spontaneous structure of WSNs.","authors":["Osamah Ibrahem Khalaf","Bayan Sabbar","Ibrahim Osamah","Khalaf"],"meta":["July 2019Journal of Computational and Theoretical Nanoscience 7(3):1096-1101","DOI:10.1166/jctn.2019.8134"],"references":["334107332_An_adaptive_intelligent_alarm_system_for_wireless_sensor_network","333393317_A_forecast_model_for_a_road_network's_section_traffic_capacity_assessment_on_a_territory_of_the_cryolithozone_in_conditions_of_the_climate_change","333392871_Effective_data_routing_using_mobile_sinks_in_disjoint_mobile_wireless_sensor_networks","332627246_A_Device_Performance_and_Data_Analytics_Concept_for_Smartphones'_IoT_Services_and_Machine-Type_Communication_in_Cellular_Networks","329733243_An_improved_algorithm_to_fire_detection_in_forest_by_using_wireless_sensor_networks","329016792_A_modified_algorithm_for_improving_lifetime_in_WSN","296802403_Wireless_Sensor_Networks_Introduction_Advantages_Applications_and_Research_Challenges","337855045_Innovation_networks_effects_simulation_models","332980962_A_Robust_Pest_Identification_System_using_Morphological_Analysis_in_Neural_Networks","332250932_Efficient_and_Optimal_Routing_Using_Ant_Colony_Optimization_Mechanism_for_Wireless_Sensor_Networks"]}