{"id":"335430643_Deep_Neural_Networks_for_Data-Driven_LES_Closure_Models","abstract":"In this work, we present a novel data-based approach to turbulence modeling for Large Eddy Simulation (LES) by artificial neural networks. We define the perfect LES formulation including the discretization operators and derive the associated perfect closure terms. We then generate training data for these terms from direct numerical simulations of decaying homogeneous isotropic turbulence. We design and train artificial neural networks based on local convolution filters to predict the underlying unknown non-linear mapping from the coarse grid quantities to the closure terms without a priori assumptions. We show that selecting both the coarse grid primitive variables as well as the coarse grid LES operator as input features significantly improves training results. All investigated networks are able to generalize from the data and learn approximations with a cross correlation of up to 47% and even 73% for the inner elements, demonstrating that the perfect closure can indeed be learned from the provided coarse grid data. Since the learned closure terms are approximate, a direct application leads to stability issues. We show how to employ the artificial neural network output to construct stable and accurate models. The best results have been achieved with a data-informed, temporally and spatially adaptive eddy viscosity closure. While further investigations into the generalizability of the approach is warranted, this work thus represents a starting point for further research into data-driven, optimal turbulence models.","authors":["Andrea D. Beck","David Flad","Claus-Dieter Munz"],"meta":["August 2019Journal of Computational Physics","DOI:10.1016/j.jcp.2019.108910"],"references":["317887637_On_the_use_of_kinetic_energy_preserving_DG-schemes_for_large_eddy_simulation","317356568_A_neural_network_approach_for_the_blind_deconvolution_of_turbulent_flows","350442573_Mathematics_of_Large_Eddy_Simulation_of_Turbulent_Flows","330819446_Quantifying_model_form_uncertainty_in_Reynolds-averaged_turbulence_models_with_Bayesian_deep_neural_networks","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316613582_A_comparison_study_between_MLP_and_Convolutional_Neural_Network_models_for_character_recognition","313231782_Deep_learning_in_fluid_dynamics","311609041_Deep_Residual_Learning_for_Image_Recognition","309270861_Reynolds_averaged_turbulence_modelling_using_deep_neural_networks_with_embedded_invariance"]}