{"id":"335478759_Deep_Learning_to_Improve_Breast_Cancer_Detection_on_Screening_Mammography","abstract":"The rapid development of deep learning, a family of machine learning techniques, has spurred much interest in its application to medical imaging problems. Here, we develop a deep learning algorithm that can accurately detect breast cancer on screening mammograms using an “end-to-end” training approach that efficiently leverages training datasets with either complete clinical annotation or only the cancer status (label) of the whole image. In this approach, lesion annotations are required only in the initial training stage, and subsequent stages require only image-level labels, eliminating the reliance on rarely available lesion annotations. Our all convolutional network method for classifying screening mammograms attained excellent performance in comparison with previous methods. On an independent test set of digitized film mammograms from the Digital Database for Screening Mammography (CBIS-DDSM), the best single model achieved a per-image AUC of 0.88, and four-model averaging improved the AUC to 0.91 (sensitivity: 86.1%, specificity: 80.1%). On an independent test set of full-field digital mammography (FFDM) images from the INbreast database, the best single model achieved a per-image AUC of 0.95, and four-model averaging improved the AUC to 0.98 (sensitivity: 86.7%, specificity: 96.1%). We also demonstrate that a whole image classifier trained using our end-to-end approach on the CBIS-DDSM digitized film mammograms can be transferred to INbreast FFDM images using only a subset of the INbreast data for fine-tuning and without further reliance on the availability of lesion annotations. These findings show that automatic deep learning methods can be readily trained to attain high accuracy on heterogeneous mammography platforms, and hold tremendous promise for improving clinical tools to reduce false positive and false negative screening mammography results. Code and model available at: https://github.com/lishen/end2end-all-conv.","authors":["Li Shen","Laurie R. Margolies","Joseph H. Rothstein","Eugene Fluder"],"meta":["August 2019Scientific Reports 9(1):1-12","DOI:10.1038/s41598-019-48995-4"],"references":["345166965_Deep_Multi-instance_Networks_with_Sparse_Label_Assignment_for_Whole_Mammogram_Classification","331233217_Automatic_mass_detection_in_mammograms_using_deep_convolutional_neural_networks","329083180_Detection_of_Breast_Cancer_with_Mammography_Effect_of_an_Artificial_Intelligence_Support_System","328226932_Deep_Learning_to_Distinguish_Recalled_but_Benign_Mammography_Images_in_Breast_Cancer_Screening","324021046_Deep_Learning_in_Mammography_and_Breast_Histology_an_Overview_and_Future_Trends","323072309_Applying_Data-driven_Imaging_Biomarker_in_Mammography_for_Breast_Cancer_Screening_Preliminary_Study","331556290_Stand-Alone_Artificial_Intelligence_for_Breast_Cancer_Detection_in_Mammography_Comparison_With_101_Radiologists","325755870_Mammogram_Classification_and_Abnormality_Detection_from_Non-local_Labels_using_Deep_Multiple_Instance_Neural_Network","323951088_Deep_learning_beyond_cats_and_dogs_Recent_advances_in_diagnosing_breast_cancer_with_deep_neural_networks","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation"]}