{"id":"335422240_The_influence_of_social_interaction_on_the_dynamics_of_employees'_psychological_contracting_in_digitally_transforming_organizations","abstract":"This paper takes a process perspective in exploring the influence of social interaction on the dynamics of psychological contracting throughout organizational change. Although social interaction is a key focus in social exchange theory, this aspect is largely overlooked in the current psychological contract literature. In this qualitative study, we adopt a retrospective design, asking change recipients to recollect events over time in the context of digital transformation in Dutch travel organizations. Our data reveal a sequence of different kinds of social interactions over the course of a change process, from collective-focused interactions (i.e., kindness and sharing) in stable contracts to transactional interactions (i.e., “what is in it for me”) following psychological contract disruption, to relational interactions (i.e., vigilance about equity in social exchange) in psychological contract repair, and to a final return to resonance and alignment with others and a return to psychological contract maintenance. Our results suggest that social interactions play a more potent role in the dynamics of psychological contracting than is currently recognized in the literature. Finally, we discuss a number of implications for dynamic models of psychological contracting.","authors":["Annemiek van der Schaft","Beatrice van der Heijden","Omar N. Solinger","Xander D. Lub"],"meta":["August 2019European Journal of Work and Organizational Psychology 29(2)","DOI:10.1080/1359432X.2019.1656284","Project: PhD project: The employee experience of technology driven change in the workplace"],"references":["332591972_Contextualizing_psychological_contracts_research_a_multi-sample_study_of_shared_individual_psychological_contract_fulfilment","330715568_Me_and_my_Team_The_Role_of_Social_Context_in_Psychological_Contract_Breach_and_Fulfilment","327212537_The_Changing_Nature_of_Work_Relationships","324885673_Trust_conflict_and_cooperation_A_meta-analysis","324850641_Successful_Organizational_Change_Integrating_the_Management_Practice_and_Scholarly_Literatures","324565677_A_dynamic_phase_model_of_psychological_contract_processes","320945007_One_Big_Happy_Family_Unraveling_the_Relationship_between_Shared_Perceptions_of_Team_Psychological_Contracts_Person-Team_Fit_and_Team_Performance","345049211_Organizational_change","325001718_Evolving_Interpretations_as_a_Change_Unfolds_How_Managers_Construe_Key_Organizational_Events","322757283_Beyond_Constraining_and_Enabling_Toward_New_Microfoundations_for_Institutional_Theory"]}