{"id":"335452218_Social_interaction_and_conceptual_change_pave_the_way_away_from_children's_misconceptions_about_the_Earth","abstract":"Throughout development, children undergo moments of abrupt conceptual transitions, often replacing intuitive knowledge with grounded scientific theories. This typically also creates a situation of social conflict, as different children may hold at the same time substantially different theories and explanations about the same phenomenon. The main objective of this work is to understand whether social interaction and exchange of arguments and reasoning may be a catalyzer for conceptual development. Dyads of 7-year-old children with different conceptual understanding of the Earth were asked to reach a consensus about its astronomic and geometric properties. Our results show that mere minutes of deliberation can result in substantial changes in children’s conceptual representations, and moreover, that this transition was consistently in the direction of reasoned and scientific opinions. These results provide empirical evidence and suggest specific ways in which peer interaction can be used effectively to promote conceptual change in school settings, in a knowledge domain at the center of this era’s post truth and science denial crisis.","authors":["Diego Pablo de la Hera","Mariano Sigman","Cecilia Calero"],"meta":["August 2019npj Science of Learning 4(1)","DOI:10.1038/s41539-019-0051-3"],"references":["323650280_The_science_of_fake_news","322507331_Aggregated_knowledge_from_a_small_number_of_debates_outperforms_the_wisdom_of_large_crowds","321974174_Interaccion_sociocognitiva_entre_pares_en_situaciones_simetricas_y_asimetricas_de_competencia_epistemica","321902111_The_Wisdom_of_Polarized_Crowds","318093021_Conceptual_change_within_dyadic_interactions_the_dance_of_conceptual_and_material_agency_Instructional_Science","344484869_The_Origin_of_Concepts","330868889_The_Essential_Tension_Selected_Studies_in_Scientific_Tradition_and_Change","327369827_Language_gesture_and_judgment_Children's_paths_to_abstract_geometry","315798402_Effective_Peer_Learning_From_Principles_to_Practical_Implementation","313009477_Capturing_and_modeling_the_process_of_conceptual_change"]}