{"id":"335487328_Robustness_A_new_form_of_heredity_motivated_by_dynamic_networks","abstract":"We investigate a special case of hereditary property in graphs, referred to as robustness. A property (or structure) is called robust in a graph G if it is inherited by all the connected spanning subgraphs of G. We motivate this definition using two different settings of dynamic networks. The first corresponds to networks of low dynamicity, where some links may be permanently removed so long as the network remains connected. The second corresponds to highly-dynamic networks, where communication links appear and disappear arbitrarily often, subject only to the requirement that the entities are temporally connected in a recurrent fashion (i.e. they can always reach each other through temporal paths). Each context induces a different interpretation of the notion of robustness.\nWe start by motivating the definition and discussing the two interpretations, after what we consider the notion independently from its interpretation, taking as our focus the robustness of maximal independent sets (MIS). A graph may or may not admit a robust MIS. We characterize the set of graphs RMIS∀ in which all MISs are robust. Then, we turn our attention to the graphs that admit a robust MIS (RMIS∃). This class has a more complex structure; we give a partial characterization in terms of elementary graph properties, then a complete characterization by means of a (polynomial time) decision algorithm that accepts if and only if a robust MIS exists. This algorithm can be adapted to construct such a solution if one exists.","authors":["Arnaud Casteigts","Swan Dubois","Franck Petit","John Michael Robson"],"meta":["August 2019Theoretical Computer Science 806(1)","DOI:10.1016/j.tcs.2019.08.008"],"references":["331982905_Time-Varying_Graphs_and_Dynamic_Networks","320344648_Stream_Graphs_and_Link_Streams_for_the_Modeling_of_Interactions_over_Time","312942220_Nodes_Bearing_Grudges_Towards_Routing_Security_Fairness_and_Robustness_in_Mobile_Ad_Hoc_Networks","271771447_Enabling_Minimal_Dominating_Set_in_Highly_Dynamic_Distributed_Systems","269711187_The_Next_700_Impossibility_Results_in_Time-Varying_Graphs","268606008_Survey_of_hereditary_properties_of_graphs","335581924_Local_Distributed_Algorithms_in_Highly_Dynamic_Networks","323302815_Temporal_Vertex_Cover_with_a_Sliding_Time_Window","321370524_Approximation_Algorithms_for_Permanent_Dominating_Set_Problem_on_Dynamic_Networks","265366921_Hereditary_and_Monotone_Properties_of_Graphs"]}