{"id":"335479468_Biologie_und_Mathematik","abstract":"Mit ihrer Vielzahl von erstaunlichen Phänomenen und ihrer komplexen Verwobenheit unterschiedlichster Skalen ist die Biologie die reichhaltigste aller Naturwissenschaften. Sie hat in den letzten Jahrzehnten die eindrucksvollsten Fortschritte erzielt. Aber Biologie und Mathematik sind sich traditionell fremd. Dabei kann die Mathematik die Biologie in vielfältiger Weise bereichern und unterstützen, von der logischen Klärung der Grundbegriffe über die formale Modellierung biologischer Strukturen und Prozesse bis zur systematischen Analyse riesiger Datenmengen. Für die Mathematik gibt es nicht nur eine Menge neuer Anwendungsmöglichkeiten, sondern auch großartige Chancen und Herausforderungen für die Entwicklung neuer Theorien und Methoden.\n\nSouverän, kritisch und humorvoll entfaltet Jürgen Jost in diesem Buch das Panorama der modernen Biologie und lotet die Möglichkeiten für die Mathematik aus. Dabei tritt fast das gesamte Spektrum der Teilgebiete der Mathematik auf.\nDer Autor\n\nJürgen Jost studierte von 1975 bis 1980 Mathematik, Physik, Volkswirtschaftslehre und Philosophie an der Universität Bonn. Er promovierte 1980 in der Mathematik und wurde nach verschiedenen internationalen Forschungsaufenthalten 1984 als Professor für Mathematik an die Ruhruniversität Bochum und 1996 als Direktor an das neu zu gründende Max-Planck-Institut für Mathematik in den Naturwissenschaften in Leipzig berufen. Er ist auch Honorarprofessor an der Universität Leipzig und externes Fakultätsmitglied des Santa Fe Institute for the Sciences of Complexity in den USA. 1993 erhielt er den Gottfried-Wilhelm-Leibniz-Preis der DFG und 2010 einen Advanced Grant des European Research Council. Er ist Autor von mehr als 20 Forschungsmonographien und Lehrbüchern und von über 400 wissenschaftlichen Fachpublikationen. In seinen Forschungen verbindet er eine Vielzahl von mathematischen Disziplinen und Methoden mit einer allgemeinen Theorie komplexer Systeme und vielfältigen Anwendungen in der mathematischen und theoretischen Biologie und Neurobiologie.","authors":["Jürgen Jost"],"meta":["January 2019","DOI:10.1007/978-3-662-59480-3","ISBN: 978-3-662-59479-7"],"references":[]}