{"id":"335421848_Coping_With_Stigma_in_the_Workplace_Understanding_the_Role_of_Threat_Regulation_Supportive_Factors_and_Potential_Hidden_Costs","abstract":"Despite changes in their representation and visibility, there are still serious concerns about the inclusion and day-today workplace challenges various groups face (e.g., women, ethnic and cultural minorities, LGBTQ+, people as they age, and those dealing with physical or mental disabilities). Men are also underrepresented in specific work fields, in particular those in Health care, Elementary Education, and the Domestic sphere (HEED). Previous literature has shown that group stereotypes play an important role in maintaining these inequalities. We outline how insights from research into stigma, social identity, and self-regulation together increase our understanding of how targets are affected by and regulate negative stereotypes in the workplace. This approach starts from the basis that members of negatively stereotyped groups are not just passive recipients of negative attitudes, stereotypes, and behaviors but are active individuals pursuing multiple goals, such as goals for belonging and achievement. We argue that it is only by understanding stigma from the target's perspective (e.g., how targets are affected and respond) that we can successfully address workplace inequality. Key in this understanding is that stereotypes, prejudice, and discrimination have taken on much more subtle forms, with consequences for the way members of stigmatized groups cope. These insights lead us to propose an approach to understanding barriers to workplace equality that highlights four key aspects: (1) the different (often subtle) potential triggers of identity threat in the workplace for members of stigmatized groups; (2) the ways in which members of stigmatized groups cope with these threats; (3) the role of supportive factors that mitigate potential threats and affect self-regulation; and (4) potential hidden costs for the self or others of what appears at first to be effective self-regulation. The focus on threats, coping, support, and potential hidden costs helps us understand why current diversity efforts are not always successful in increasing and maintaining members of stigmatized groups in organizations and provides insight into how we can aid efforts to effectively lower barriers to workplace equality.","authors":["Colette Van Laar","Loes Meeussen","Jenny Veldman","Sanne Van Grootel"],"meta":["August 2019Frontiers in Psychology 10:1879","DOI:10.3389/fpsyg.2019.01879"],"references":["332906769_The_Flywheel_Effect_of_Gender_Role_Expectations_in_Diverse_Work_Groups","332270712_A_social_identity_perspective_on_the_social-class_achievement_gap_Academic_and_social_adjustment_in_the_transition_to_university","327781866_Perpetuating_Inequality_Junior_Women_Do_Not_See_Queen_Bee_Behavior_as_Negative_but_Are_Nonetheless_Negatively_Affected_by_It","326959426_Uncovering_Pluralistic_Ignorance_to_Change_Men's_Communal_Self-descriptions_Attitudes_and_Behavioral_Intentions","326281799_Inverting_Professional_Prototypes_Increases_the_Valuation_of_Women_in_Male-Dominated_Professions","336516257_How_to_Foster_Male_Engagement_in_Traditionally_Female_Communal_Roles_and_Occupations_Insights_from_Research_on_Gender_Norms_and_Precarious_Manhood","327853517_Why_Doesn't_Diversity_Training_Work_The_Challenge_for_Industry_and_Academia","326640083_Climate_Control_The_Relationship_Between_Social_Identity_Threat_and_Cues_to_an_Identity-Safe_Culture","325979923_Intersectional_Oppression_Multiple_Stigmatized_Identities_and_Perceptions_of_Invisibility_Discrimination_and_Stereotyping_Intersectional_Oppression","325795527_Role_congruity_theory_of_prejudice_toward_female_leaders"]}