{"id":"335457289_Automated_Lung_Nodule_Detection_and_Classification_Using_Deep_Learning_Combined_with_Multiple_Strategies","abstract":"Lung cancer is one of the major causes of cancer-related deaths due to its aggressive nature and delayed detections at advanced stages. Early detection of lung cancer is very important for the survival of an individual, and is a significant challenging problem. Generally, chest radiographs (X-ray) and computed tomography (CT) scans are used initially for the diagnosis of the malignant nodules; however, the possible existence of benign nodules leads to erroneous decisions. At early stages, the benign and the malignant nodules show very close resemblance to each other. In this paper, a novel deep learning-based model with multiple strategies is proposed for the precise diagnosis of the malignant nodules. Due to the recent achievements of deep convolutional neural networks (CNN) in image analysis, we have used two deep three-dimensional (3D) customized mixed link network (CMixNet) architectures for lung nodule detection and classification, respectively. Nodule detections were performed through faster R-CNN on efficiently-learned features from CMixNet and U-Net like encoder–decoder architecture. Classification of the nodules was performed through a gradient boosting machine (GBM) on the learned features from the designed 3D CMixNet structure. To reduce false positives and misdiagnosis results due to different types of errors, the final decision was performed in connection with physiological symptoms and clinical biomarkers. With the advent of the internet of things (IoT) and electro-medical technology, wireless body area networks (WBANs) provide continuous monitoring of patients, which helps in diagnosis of chronic diseases—especially metastatic cancers. The deep learning model for nodules’ detection and classification, combined with clinical factors, helps in the reduction of misdiagnosis and false positive (FP) results in early-stage lung cancer diagnosis. The proposed system was evaluated on LIDC-IDRI datasets in the form of sensitivity (94%) and specificity (91%), and better results were obatined compared to the existing methods.","authors":["Dr Nasrullah","Jun Sang","Mohammad S. Alam","Muhammad Mateen"],"meta":["August 2019Sensors 19(17):3722","DOI:10.3390/s19173722"],"references":["329578407_Assessment_of_Seven_Clinical_Tumor_Markers_in_Diagnosis_of_Non-Small-Cell_Lung_Cancer","323504434_Assessment_of_Plasma_Proteomics_Biomarker's_Ability_to_Distinguish_Benign_From_Malignant_Lung_Nodules_Results_of_the_PANOPTIC_PulmonAry_NOdule_Plasma_proTeomIc_Classifier_trial","322714590_DeepLung_Deep_3D_Dual_Path_Nets_for_Automated_Pulmonary_Nodule_Detection_and_Classification","321084071_Evaluation_of_the_solitary_pulmonary_nodule_size_matters_but_do_not_ignore_the_power_of_morphology","333076950_Automated_detection_and_classification_for_early_stage_lung_cancer_on_CT_images_using_deep_learning","328257352_Automatic_lung_nodule_detection_using_a_3D_deep_convolutional_neural_network_combined_with_a_multi-scale_prediction_strategy_in_chest_CTs","326204216_Mixed_Link_Networks","323068422_Cancer_Molecular_Markers_A_guide_to_cancer_detection_and_Management","322975974_Mixed_Link_Networks","322722988_Computer-Assisted_Decision_Support_System_in_Pulmonary_Cancer_detection_and_stage_classification_on_CT_images"]}