{"id":"335492127_LA_TRADUCTION_AUTOMATIQUE_VIS-A-VIS_LA_TRADUCTION_HUMAINE_LE_CAS_DE_LA_TRADUCTION_D'UN_EXPOSE_SUR_L'EPIDEMIE_DU_CHOLERA_DANS_L'ETAT_EBONYI","abstract":"Depuis l'âge informatique le débat que l'ordinateur peux remplacer le travail du traducteur ne cesse jamais. Maigre que l'ordinateur peut traduire les énoncés mais il ne peut pas les faire sans des erreurs. Les étudiants des entreprises qui utilisent la traduction faite par l'ordinateur comme le moyen de traduire seront se méfier sur des avantages d'une telle chose .Dans cette article nous allons montrer la traduction faite directement par l'ordinateur à travers les différents logiciels sur l'internet pour qu'on voie clairement si l'ordinateur peut traduire parfaitement les énoncés sans aide de traducteur professionnel ou non. Introduction La traduction a été définie par maintes théoriciens come Nida 1969, Newmark 1988, Seleskovitch et Lédérer 1986, pour citer qu' en peu. Ce qui est important c'est que la traduction est l'acte de transférer un message d' une langue cible à la langue d' arrivée. La traduction automatique est defini par Kouassi comme : un sous-domaine de la linguistique informatique qui travaille à la théorie et pratique de l'utilisation de l'outil informatique,uniquement pour la traduction des textes écrits et oraux d'une langue naturelle à une autre. On l'appelle également traduction assistée par ordinateur (TAO) ou traduction logicielle. C'est un processus basé sur des faits de substitution à partir de systèmes de corpus, de typologie, de reconnaissance d'énoncés ou de reconnaissance vocale, de rapports entre expressions idiomatiques, proverbes, termes et expressions jargonneux, etc., ainsi que l'isolation des anomalies.La distinction entre la traduction humaine et la traduction automatique se voit dans le moyen d'accomplir la tâche de traduction. L'homme accompli la première tandis que l'ordinateur à l' aide d' internet fait la","authors":["Felicia Asadu","Asadu Felicia Oluchukwu"],"meta":["April 2018"],"references":["220418918_Review_Article_Example-based_Machine_Translation","49554117_A_Textbook_of_Translation"]}