{"id":"335499164_Learning_from_Competition_An_Outcome-Based_Introductory_Activity_for_First-Year_Biotechnology_Undergraduates","abstract":"In recent years, accreditation standards for international engineering education have led to a dramatic rise in the use of outcome-based education at universities. In this system, enticing new undergraduate students to science and engineering, although challenging, is the first important step toward building students' career competencies. An ongoing effort to attract students to biotechnology was initiated 13 years ago in the School of Biotechnology at the East China University of Science and Technology in Shanghai. We describe the design and organization of the Microbe Competition, a program attracting a total of nearly 6,500 students as of 2018. In the competition, students need to pass the microbiology knowledge test, provide a practical experiment proposal related to the topic of competition, and finish the experiment under the supervision of teachers before getting final prizes. The competition develops students' competencies in acquiring and applying knowledge, problem solving, teamwork, communication, and experimental skills. By investigating students' feedback, we have been continuously improving the quality of competition to attract more students from the biotechnology major. We hope that by sharing our experience, we can help educators at other universities organize similar introductory activities on their own campuses.","authors":["Xiaoyan Zhang","Ruifang Ye","Fengxian Hu","Yitao Zheng"],"meta":["September 2019The American Biology Teacher 81(7):467-473","DOI:10.1525/abt.2019.81.7.467"],"references":["268203281_Generic_Engineering_Competencies_A_Review_and_Modelling_Approach","276350531_International_Organic_Chemistry_Competition_A_Thrilling_Unique_Experience","264268495_Which_ABET_Competencies_Do_Engineering_Graduates_Find_Most_Important_in_their_Work","261011297_Fast_and_Attractive_Chemical_Education_A_Chemical_Competition_for_High_School_Students_in_the_Czech_Republic","253565699_Authentic_Learning_Enviroment_in_Analytical_Chemistry_Using_Cooperative_Methods_and_Open-Ended_Laboratories_in_Large_Lecture_Courses","232880766_Biological_competitions_and_Biological_Olympiads_as_a_means_of_developing_students'_interest_in_biology","228660019_Competencies_Beyond_Countries_The_Re-Organization_of_Engineering_Education_in_the_United_States_Europe_and_Latin_America","223932056_Curriculum_development_in_medical_education_From_acronyms_to_dynamism","11761976_Protein_Structure_Prediction_and_Structural_Genomics"]}