{"id":"335454876_A_comparative_survey_of_recent_natural_language_interfaces_for_databases","abstract":"Over the last few years, natural language interfaces (NLI) for databases have gained significant traction both in academia and industry. These systems use very different approaches as described in recent survey papers. However, these systems have not been systematically compared against a set of benchmark questions in order to rigorously evaluate their functionalities and expressive power. In this paper, we give an overview over 24 recently developed NLIs for databases. Each of the systems is evaluated using a curated list of ten sample questions to show their strengths and weaknesses. We categorize the NLIs into four groups based on the methodology they are using: keyword-, pattern-, parsing- and grammar-based NLI. Overall, we learned that keyword-based systems are enough to answer simple questions. To solve more complex questions involving subqueries, the system needs to apply some sort of parsing to identify structural dependencies. Grammar-based systems are overall the most powerful ones, but are highly dependent on their manually designed rules. In addition to providing a systematic analysis of the major systems, we derive lessons learned that are vital for designing NLIs that can answer a wide range of user questions.","authors":["Katrin Affolter","Kurt Stockinger","Abraham Bernstein"],"meta":["October 2019The VLDB Journal 28(5)","DOI:10.1007/s00778-019-00567-8"],"references":["334898269_An_analytical_study_of_large_SPARQL_query_logs","334116193_What_It_Takes_to_Achieve_100_Condition_Accuracy_on_WikiSQL","329836397_Interactive_Natural_Language_Question_Answering_Over_Knowledge_Graphs","327006690_Natural_Language_Data_Management_and_Interfaces","326340572_SINA_Semantic_Interpretation_of_User_Queries_for_Question_Answering_on_Interlinked_Data","325373281_DBPal_A_Learned_NL-Interface_for_Databases","321069687_SQLNet_Generating_Structured_Queries_From_Natural_Language_Without_Reinforcement_Learning","320883962_Natural_Language_QuestionAnswering_Let_Users_Talk_With_The_Knowledge_Graph","320203870_AMUSE_Multilingual_Semantic_Parsing_for_Question_Answering_over_Linked_Data","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks"]}