{"id":"335487277_End_to_end_QA_in_image_guided_and_adaptive_radiation_therapy","abstract":"It has been suggested that modern radiation therapy could benefit from adopting the “End to End” (E2E) type of testing developed originally in computer science to determine whether applications and systems work as required under real-world scenarios. The motivation for adopting E2E techniques for image guided adaptive radiation therapy validation is to extend beyond current common testing using standard physics QA that inherently probes only select points or systems within the IGART schema. E2E methodologies extend the testing to evaluate complete IGART processes, including the complex interchanges that occur during and throughout a patient’s treatment as clinical staff interpret and respond to information acquired during the treatment course.\nWhile limited radiotherapy E2E QA may have been adopted periodically by clinics when implementing a new treatment technique, clinical E2E QA has been confined to date mainly to tests mediated by external auditing bodies such as IROC, the Imaging and Radiation Oncology Core in the United States. This testing often includes having the clinic in question irradiate a purpose-built phantom containing dosimeters to specific criteria under protocols set by the auditing body. The auditors then determine off site whether the clinic’s treatment process was successful by comparing the dose measurements with the intended dose delivery.\nThe advance of three dimensional (3D) radiation dosimeters opens the possibility for in-house E2E testing. Approaches for in-house E2E testing have been proposed for over a decade, but such comprehensive internal E2E testing has not been widely adopted. In this presentation the barriers and challenges to the development of clinical in-house E2E QA will be reviewed primarily based on the experience in Kingston.","authors":["Lawrence John Schreiner"],"meta":["August 2019Journal of Physics Conference Series 1305(1):012062","DOI:10.1088/1742-6596/1305/1/012062","Project: Current Research: Cobalt radiation delivery and 3D dosimetry"],"references":["271725214_QA_procedures_needed_for_advanced_RT_techniques_and_its_impact_on_treatment_outcome","271725013_Audits_for_advanced_treatment_dosimetry","267924536_Implementation_of_an_efficient_workflow_process_for_gel_dosimetry_using_3D_Slicer","326171232_Streamlined_Open-Source_Gel_Dosimetry_Analysis_in_3D_Slicer","304006084_The_report_of_Task_Group_100_of_the_AAPM_Application_of_risk_analysis_methods_to_radiation_therapy_quality_management"]}