{"id":"335542873_Achieving_One-Round_Password-based_Authenticated_Key_Exchange_over_Lattices","abstract":"Password-based authenticated key exchange (PAKE) protocol, a widely used authentication mechanism to realize secure communication, allows protocol participants to establish a high-entropy session key by pre-sharing a low-entropy password. An open challenge in PAKE is how to design a quantum-resistant round-optimal PAKE. To solve this challenge, lattice-based cryptography is a promising candidate for post-quantum cryptography. In addition, Katz and Vaikuntanathan (ASIACRYPT'09) design the first three-round PAKE protocol by leveraging the smooth projective hash function (SPHF) over lattices. Subsequently, Zhang and Yu (AISACRYPT'17) optimized Katz-Vaikuntanathan's approximate SPHF via a splittable public key encryption. They then constructed a two-round PAKE by using the simulation-sound non-interactive zero-knowledge (NIZK) proofs, but how to construct a lattice-based simulation-sound NIZK remains an open research question. In other words, how to design a one-round PAKE via an efficient lattice-based SPHF still remains a challenge. In this work, we attempt to fill this gap by proposing a lattice-based SPHF with adaptive smoothness. We then obtain a one-round PAKE protocol over lattices with rigorous security analysis by integrating the proposed SPHF into the one-round framework proposed by Katz and Vaikuntananthan (TCC'11). Furthermore, we explore the possibilities of achieving two-round PAKE and universal composable (UC) security from our SPHF, and show the potential application of our PAKE in Internet of Things (IoTs) where communication cost is the main consideration.","authors":["Zengpeng Li","Ding Wang"],"meta":["August 2019IEEE Transactions on Services Computing 2019(8):1-14","DOI:10.1109/TSC.2019.2939836","Projects: Privacy-Enhancing TechnologiesHow to design secure, efficient and usable authentication schemes"],"references":["333640153_Birthday_Name_and_Bifacial-security_Understanding_Passwords_of_Chinese_Web_Users","333309870_An_Energy-Efficient_Configurable_Lattice_Cryptography_Processor_for_the_Quantum-Secure_Internet_of_Things","325026033_Measuring_Two-Factor_Authentication_Schemes_for_Real-Time_Data_Access_in_Industrial_Wireless_Sensor_Networks","324845323_Digital_Identity_Guidelines_Authentication_and_Lifecycle_Management","324108639_OPAQUE_An_Asymmetric_PAKE_Protocol_Secure_Against_Pre-computation_Attacks","323184290_Analysing_and_Patching_SPEKE_in_ISOIEC","326496099_Anonymous_Lightweight_Chaotic_Map-Based_Authenticated_Key_Agreement_Protocol_for_Industrial_Internet_of_Things","324110303_Fuzzy_Password-Authenticated_Key_Exchange","323451221_Hash_Proof_Systems_over_Lattices_Revisited","323449250_Two-Factor_Authentication_with_End-to-End_Password_Security"]}