{"id":"335570042_The_Impact_of_using_Stem_Video_in_Teaching_on_Students'_Learning_Engagement_in_Malaysia","abstract":"The use of video multimedia is one of the most effective methods of teaching and learning, especially for science, technology, engineering, and mathematics (STEM) subjects. Data from Malaysian Examination Syndicate showed the subject grade point of STEM subjects exceeded 4.00 which depicts Malaysians' low level of awareness of science. Malaysia also falls behind in the global competition of science and mathematics as demonstrated by the country's recent achievements in TIMSS and PISA. Previous research found that the method of teaching affected to the students' performance especially in STEM subject. Studies reported data on low performances in undergraduate STEM courses under traditional lecturing compared to active learning. The use of STEM video is one of the active learning that can assist students' performance in STEM subjects. This study evaluated the relationship between the use of STEM video in teaching and students' learning engagement in Malaysia. This quantitative study distributed questionnaire surveys among 367 STEM teachers in Malaysia. This study subsequently performed structural equation modelling (SEM) using AMOS, which revealed the significance of all items in representation of the use of STEM video in teaching (factor loadings between 0.61 and 0.76) and students' learning engagement (factor loadings between 0.64 and 0.73). Additionally, the use of STEM video in teaching significantly affected the students' learning engagement (β = 0.75; CR = 9.345; p = .00). This study also successfully developed an interaction model that involved the use of STEM video in teaching and students' learning engagement.","authors":["Mohd Zaid Ismail"],"meta":["June 2019"],"references":["321908535_Effectiveness_of_Cooperative_Learning_on_the_Achievement_and_Motivation_of_the_Student_in_Learning_Malay_Language","320663931_Flipped_Classroom_A_Comparison_Of_Student_Performance_Using_Instructional_Videos_And_Podcasts_Versus_The_Lecture-Based_Model_Of_Instruction","303373391_Malaysian_Principals'_Technology_Leadership_Practices_and_Curriculum_Management","286221003_Using_Supplementary_Video_in_Multimedia_Instruction_as_a_Teaching_Tool_to_Increase_Efficiency_of_Learning_and_Quality_of_Experience","273958796_Enhancement_of_Student_Motivation_in_Learning_Through_BLOSSOMS_Video_Activity","273338230_Managing_Problem-based_Learning_Challenges_and_Solutions_for_Educational_Practice","263764480_Mobile_phone_images_and_video_in_science_teaching_and_learning","262592099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","262267588_Active_Learning_Increases_Student_Performance_in_Science_Engineering_and_Mathematics","262187467_Cognitive_theory_of_multimedia_learning"]}