{"id":"335522418_A_review_Deep_learning_for_medical_image_segmentation_using_multi-modality_fusion","abstract":"Multi-modality is widely used in medical imaging, because it can provide multiinformation about a target (tumor, organ or tissue). Segmentation using multimodality consists of fusing multi-information to improve the segmentation. Recently, deep learning-based approaches have presented the state-of-the-art performance in image classification, segmentation, object detection and tracking tasks. Due to their self-learning and generalization ability over large amounts of data, deep learning recently has also gained great interest in multi-modal medical image segmentation. In this paper, we give an overview of deep learning-based approaches for multi-modal medical image segmentation task. Firstly, we introduce the general principle of deep learning and multi-modal medical image segmentation. Secondly, we present different deep learning network architectures, then analyze their fusion strategies and compare their results. The earlier fusion is commonly used, since it’s simple and it focuses on the subsequent segmentation network architecture. However, the later fusion gives more attention on fusion strategy to learn the complex relationship between different modalities. In general, compared to the earlier fusion, the later fusion can give more accurate result if the fusion method is effective enough. We also discuss some common problems in medical image segmentation. Finally, we summarize and provide some perspectives on the future research.","authors":["Tongxue Zhou","Su Ruan","Stéphane Canu"],"meta":["August 2019Array 3-4:100004","DOI:10.1016/j.array.2019.100004"],"references":["324740353_Hierarchical_combinatorial_deep_learning_architecture_for_pancreas_segmentation_of_medical_computed_tomography_cancer_images","324354680_HyperDense-Net_A_Hyper-Densely_Connected_CNN_for_Multi-Modal_Image_Segmentation","323879411_Automatic_Semantic_Segmentation_of_Brain_Gliomas_from_MRI_Images_Using_a_Deep_Cascaded_Neural_Network","331389234_Benchmark_on_Automatic_Six-Month-Old_Infant_Brain_Segmentation_Algorithms_The_iSeg-2017_Challenge","331280866_3D_Convolutional_Neural_Networks_for_Tumor_Segmentation_using_Long-range_2D_Context","328926979_Automatic_Brain_Tumor_Segmentation_using_Cascaded_Anisotropic_Convolutional_Neural_Networks","328922628_Splenomegaly_Segmentation_on_Multi-Modal_MRI_Using_Deep_Convolutional_Networks","328114563_Joint_Tumor_Segmentation_in_PET-CT_Images_using_Co-Clustering_and_Fusion_based_on_Belief_Functions","327370205_Ensembles_of_Multiple_Models_and_Architectures_for_Robust_Brain_Tumour_Segmentation","327370201_Brain_Tumor_Segmentation_and_Radiomics_Survival_Prediction_Contribution_to_the_BRATS_2017_Challenge"]}