{"id":"335576450_Exploring_brain_activity_and_transforming_knowledge_in_visual_and_textual_programming_using_neuroeducation_approaches","abstract":"Eight (8) computer science students, novice programmers, who were in the first semester of their studies, participated in a field study in order to explore potential differences in their brain activity during programming with a visual programming language versus a textual programming language. The eight students were asked to develop two specific programs in both programming languages (a total of four tasks). The order of these programs was determined, while the order of languages in which they worked differed between the students. Measurement of cerebral activity was performed by the electroencephalography (EEG) imaging method. According to the analysis of the data it appears that the type of programming language did not affect the students' brain activity. Also, six students needed more time to successfully develop the programs they were asked with the first programming language versus the second one, regardless of the type of programming language that was first. In addition, it appears that six students did not show reducing or increasing brain activity as they spent their time on tasks and at the same time did not show a reduction or increase in the time they needed to develop the programs. Finally, the students showed higher average brain activity in the development of the fourth task than the third, and six of them showed higher average brain activity when developing the first versus the second program, regardless of the programming language. The results can contribute to: a) highlighting the need for a diverse educational approach for students when engaging in program development and b) identifying appropriate learning paths to enhance student education in programming.","authors":["Spyridon Doukakis"],"meta":["September 2019AIMS Neuroscience 6(3):175-190","DOI:10.3934/Neuroscience.2019.3.175"],"references":["322820157_Post-task_Effects_on_EEG_Brain_Activity_Differ_for_Various_Differential_Learning_and_Contextual_Interference_Protocols","319866622_Auto-correlation_in_the_motorimaginary_human_EEG_signals_A_vision_about_the_FDFA_fluctuations","312658727_Mining_biometric_data_to_predict_programmer_expertise_and_task_difficulty","309746798_How_Can_Brain_Research_Inform_Academic_Learning_and_Instruction","309394570_What_is_a_Visual_Language","308731065_Real-Time_Monitoring_of_Neural_State_in_Assessing_and_Improving_Software_Developers'_Productivity","304117102_The_basic_principles_of_research_in_neuroeducation_studies","303099418_Using_biometrics_to_predict_code_quality_online","332235147_Analysis_of_the_EEG_bio-signals_during_the_reading_task_by_D_F_A_method","300116168_Comparing_Textual_and_Block_Interfaces_in_a_Novice_Programming_Environment"]}