{"id":"335508871_BCH_Codes_with_computational_approach_and_its_applications_in_image_encryption","abstract":"Accelerated adventures in computer Science and technology has made digital technology, a need of the day. Academicians, researchers, and technologists are anxious to share their secret data through the communication channel along with its security. The security of data, transmission rate, and error correction capability are the fundamental questions against the data transmission through any algebraic code dependent communication channel. Though, data security is always questioned due to the synchronized encoding and decoding algorithms. In this paper, a novel approach is developed to ensure the data security issues occurred due to synchronized encoding-decoding of a BCH code and for data transmission, a computational technique is designed by which data can be encoded and transmitted by using Field-Linear BCH code or a Ring-Linear BCH code of the same dimension, designed distance and code length. Although the Ring-Linear BCH code is preferable for encoding, on the other hand decoding of data is adept by Field-Linear BCH code. Accordingly, a computational technique of Barlekamp Massey Algorithm is utilized for the purpose. This scheme provides a quick code selection of the desired level of transmission rate and error correction capability during the communication. Thus, it also addresses the dimension issue of primitive BCH code. In addition, for the data security perspective we utilize a BCH code in round key addition and mixed column matrix steps in AES algorithm and then put on this modified AES algorithm to image encryption. The image encryption quality permits to incorporate this alteration in AES.","authors":["Muhammad Asif","Tariq Shah"],"meta":["August 2019Journal of Intelligent and Fuzzy Systems 37(4):1-15","DOI:10.3233/JIFS-190137"],"references":["293009973_An_association_between_primitive_and_non-primitive_BCH_codes_using_monoid_rings","265797545_A_Note_on_Linear_Codes_over_Semigroup_Rings","262480615_Encoding_through_generalized_polynomial_codes","257810471_A_method_for_improving_the_code_rate_and_error_correction_capability_of_a_cyclic_code","301873119_The_Dimension_and_Minimum_Distance_of_Two_Classes_of_Primitive_BCH_Codes","287125624_A_Decoding_Procedure_which_Improves_Code_Rate_and_Error_Corrections","284086345_Maximal_cyclic_subgroups_of_the_groups_of_units_of_Galois_rings_a_computational_approach","265817697_Topics_in_applied_abstract_algebra","263982529_CYCLIC_CODES_THROUGH_BXfracabmathbb_Z_0_WITH_fracabin_mathbb_Q_AND_b_a1_AND_ENCODING","260166037_Ring_constructions_and_applications"]}