{"id":"335587217_Information_Technology_and_Computer_Science","abstract":"In investigation of consequences of atmosphere and commutating striking voltages, for simulation of the overvoltage are used the models of generators whose RC circuits have standard passive parameters of the elements upon which the form of striking overvoltage depends. According to IEC 62 305-1 standard, these formulas in the theoretical model serve for dimensioning the RC circuit of the generator of striking voltages although the definitions of time constants and passive parameters have only axiomatic character. Related to classical solution, this paper presents the model formed by mathematical procedure the solutions of which give sufficiently accurate values of time constants and essential parameters of RC circuit as well as the shape of striking voltage wave. The formulas for voltages and currents in model contain parameters of passive elements, and their accuracy has been confirmed by diagrams obtained in simulation by means of adapted psbtrnsrg.mdl part of MATLAB program. Theoretical model is suitable for simulation of standard wave forms of striking atmospheric and commutating overvoltages which replace laboratory testing.","authors":["Slobodan Bjelic","N. Marković","Zorica S Bogićević","Igor Bjelic"],"meta":["September 2019International Journal of Information Technology and Computer Science 11(9):20-30","DOI:10.5815/ijitcs.2019.09.03","Projects: AI - Based Method And Mathematical Model For Analysis Of Current And Voltage In Elements Of Power Systems,  ID 143934.Erasmus + Project - \"Creating the Network of Knowledge Labs for Sustainable and Resilient Environments\" [KLABS] [561675-EPP - 1-2015-1-XK-EPPKA2-CBHE-JP]"],"references":["307440751_Model_of_Transient_Process_Where_Three-Phase_Transducer_Feeds_Induction_Motor_Equivalent_as_a_Variable_Active-Inductive_Load","287849823_Simulation_of_transient_process_in_distributive_networks_middle_voltage_10-35_KV","281525434_Towards_Events_Recognition_in_a_Distributed_Fiber-Optic_Sensor_System_Kolmogorov-Zurbenko_Filtering","277209386_The_experimental_investigation_of_overvoltages_transferred_from_high_to_low_voltage_side_of_420_kv1575_kv1575_kv_transformer_made_by_ASEA_and_located_in_hydroelectric_power_plant_'Derdap_1'","272853347_Computer_Simulation_of_Theoretical_Model_of_Electromagnetic_Transient_Processes_in_Power_Transformers","290532254_The_cauchy_problem_for_non-Lipschitz_semi-linear_parabolic_partial_differential_equations"]}