{"id":"335583873_Simulation_of_quantum_circuits_by_low-rank_stabilizer_decompositions","abstract":"Recent work has explored using the stabilizer formalism to classically simulate quantum circuits containing a few non-Clifford gates. The computational cost of such methods is directly related to the notion of stabilizerrank , which for a pure state ψ is defined to be the smallest integer χ such that ψ is a superposition of χ stabilizer states. Here we develop a comprehensive mathematical theory of the stabilizer rank and the related approximate stabilizer rank. We also present a suite of classical simulation algorithms with broader applicability and significantly improved performance over the previous state-of-the-art. A new feature is the capability to simulate circuits composed of Clifford gates and arbitrary diagonal gates, extending the reach of a previous algorithm specialized to the Clifford+T gate set. We implemented the new simulation methods and used them to simulate quantum algorithms with 40-50 qubits and over 60 non-Clifford gates, without resorting to high-performance computers. We report a simulation of the Quantum Approximate Optimization Algorithm in which we process superpositions of χ∼106 stabilizer states and sample from the full n -bit output distribution, improving on previous simulations which used ∼103 stabilizer states and sampled only from single-qubit marginals. We also simulated instances of the Hidden Shift algorithm with circuits including up to 64 T gates or 16 CCZ gates; these simulations showcase the performance gains available by optimizing the decomposition of a circuit's non-Clifford components.","authors":["Sergey Bravyi","Dan Browne","Padraic Calpin","Earl Campbell"],"meta":["September 2019Quantum 3:181","DOI:10.22331/q-2019-09-02-181"],"references":["322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","320442135_Breaking_the_49-Qubit_Barrier_in_the_Simulation_of_Quantum_Circuits","319662871_qTorch_The_Quantum_Tensor_Contraction_Handler","318584091_Convex_geometry_of_quantum_resource_quantification","342402783_Explicit_Lower_Bounds_on_Strong_Quantum_Simulation","323355730_Contextuality_bounds_the_efficiency_of_classical_simulation_of_quantum_processes","321823829_Simulation_of_low-depth_quantum_circuits_as_complex_undirected_graphical_models","321067202_Local_Hamiltonians_Whose_Ground_States_Are_Hard_to_Approximate","320938282_05_petabyte_simulation_of_a_45-qubit_quantum_circuit","318022710_Unbiased_simulation_of_near-Clifford_quantum_circuits"]}