{"id":"335526484_LEONARDO_DA_VINCI_INEQUALITY_AND_OTHER_GEOMETRIC_EXTREMA_PROBLEMS","abstract":"Y. N. Aliyev, Leonardo da Vinci inequality and other geometric extrema problems, Journal of Qafqaz University, Mathematics and Computer Science series 32 (2011) 84-94.\n\nIn the Introduction we gave a short historical review of geometric inequalities. In Section 1 we discussed maxima and minima problem about concentric circles. We also considered related Euclidean geometry problem. In this section we also proved an inequality, involving triangle's side, its corresponding altitude and inradius. This inequality is related to observation of Leonardo da Vinci and Piero della Francesca in the theory of perspective. At the end of this section we proposed an open problem requiring study of a new curve. In Section 2 we discussed an inequality about powers of areas of triangles, its consequences and an open problem related to conics. In Section 3 we considered several inequalities related to an obtuse angle. Francesca, powers of areas of triangles, obtuse angle. НЕРАВЕНСТВО ЛЕОНАРДО ДА ВИНЧИ И ДРУГИЕ ГЕОМЕТРИЧЕСКИЕ ЗАДАЧИ НА ЭКСТРЕМУМ АННОТАЦИЯ Во введении ма даем короткий историчекий обзор геометрических неравенств. В первой части работы изучается задача о максимумах и минимумах для концентрических окружностей. Мы также обсуждаем связанное с ней задачу из Евклидовой геометрии. Далее обсуждается неравенство связанное со стороной, соответствущей высотой и радиусом вписанной окружности некоторого треугольника. Последнее связано с фактом из теории перспективы которое было наблюдено Леонардом да Винчи и Пьером делла Франческа. В конце этой части мы предлагаем одну нерешенную задачи о дальнейшем исследовании некоторой новой кривой. Во второй части обсуждается неравенство о степенях площадей некоторых треугольников, некоторые следствия из него и одно нерешенная задача о конических сечениях. В третьей части мы рассматриваем несколько неравенств связанные с тупым углом. Ключевые слова: Геометрические неравенства, концентрические окружности, Евклидова геометрия, треугольник, Леонардо да Винчи, Пьеро делла Франческа, степени площадей треугольников, тупой угол. LEONARDO DA VİNÇİ BƏRABƏRSİZLİ VƏ BAŞQA HƏNDƏSİ EKSTREMUM MƏSƏLƏLƏRİ XÜLASƏ Giriş hissədə həndəsi bərabərsizliklərə aid qısa tarixi məlumat verilir. İşin birinci hissəsində konsentrik çevrələr haqqında maksimum minimum məsələsi müzakirə olunur. Həmçinin buna aid Evklid həndəsəsi məsələsi də araşdırılır. Daha sonra üçbucağın tərəfi, ona uyğun hündürlük və daxilə çəkilmiş çevrəsinin radiusu haqqında bərabərsizlik müzakirə olunur. Sonuncu Leonardo da Vinçi və Pyerro della Françeska tərəfindən müşahidə olunan perspektiv nəzəriyyəsinə aid bir faktla əlaqədardır. Bu hissənin sonunda gələcəkdə araşdırmaq üçün müəyyən bir yeni əyriyə aid həlli olmayan suallar verilmişdir. İkinci hissədə üçbucaq sahələrinin qüvvətlərinə həsr olunmuş bərabərsizlik, onun nəticələri və konik əyrilərə aid bir həll olunmamış sual müzakirə edilmişdir. Üçüncü hissədə kor bucağa aid bir neçə bərabərsizlik araşdırılır. Açar sözlər: Həndəsi bərabərsizliklər, konsentrik çevrələr, Evklid həndəsəsi, üçbucaq, Leonardo da Vinçi, Pyerro della Françeska, üçbucaq sahələrinin qüvvətləri, kor bucaq.","authors":["Yagub Aliyev"],"meta":["August 2019","Project: Geometric Inequalities"],"references":["333852587_NEW_INEQUALITIES_ON_TRIANGLE_AREAS","321568065_Geometric_Problems_on_Maxima_and_Minima","273940265_Geometry_and_the_Liberal_Arts","273585947_Problem_solving_through_an_optimization_problem_in_geometry","268175044_Inequalities_A_mathematical_olympiad_approach"]}