{"id":"335509916_STRESS_E_ESTRATEGIAS_DE_COPING_UM_ESTUDO_COM_UNIVERSITARIOS_DOS_CURSOS_DE_FISIOTERAPIA_E_CIENCIA_DA_COMPUTACAO","abstract":"O presente artigo buscou identificar possível relação entre a percepção do stress com o uso de estratégias de coping. A pesquisa estudou uma população de 106 alunos do 6º e 8º semestres dos cursos de Fisioterapia e Ciência da Computação, de um centro universitário, localizado em São Paulo/BR, por meio da Escala Visual Analógica do Stress e COPE-BREVE, avaliando o impacto da percepção do stress e o uso de estratégias de coping na saúde dos estudantes. Os dados revelaram que os alunos de Fisioterapia são em sua maioria do sexo feminino (83,33%) com percepção do nível de stress moderado (46,29%) e com um repertório reduzido no uso de estratégias de enfrentamento do stress. Já o curso de Ciência da Computação, tem prevalência de alunos do sexo masculino (90,38%) e 42,3% percebem-se sem stress, apresentando um repertório diversificado no uso das estratégias de enfrentamento. Conclui-se que as estratégias de coping desempenham um importante papel quanto a percepção do nível de stress. O uso eficaz de estratégias de enfrentamento permite ao discente competências para diminuir os estressores. Os resultados observados indicam oportunidade de aprofundamento do tema, ampliando o repertório de soluções em prol da melhoria de qualidade de vida do discente.","authors":["Daianna Carboni De Souza","Isaac Dos Santos Teixeira Junior","Sideli Biazzi"],"meta":["August 2019","DOI:10.22410/issn.2176-3070.v11i2a2019.1986"],"references":["307677683_Adaptacao_Academica_e_Coping_em_Estudantes_Universitarios","282445999_Relacao_entre_a_qualidade_de_vida_e_o_estresse_em_academicos_da_area_da_saude","274842069_A_polemica_em_torno_do_conceito_de_estresse","262739455_Questoes_acerca_do_coping_A_proposito_do_estudo_de_adaptacao_do_Brief_COPE","49943659_Estresse_no_cotidiano_academico_o_olhar_dos_alunos_de_Enfermagem_da_Universidade_Federal_do_Piaui","26362318_Stress_e_qualidade_de_vida_em_Magistrados_da_Justica_do_Trabalho_diferencas_entre_homens_e_mulheres","268344646_NIVEL_DE_STRESS_E_ESTRATEGIAS_DE_COPING_DOS_ESTUDANTES_DO_1_ANO_DO_ENSINO_UNIVERSITARIO_DE_COIMBRA_2007"]}