{"id":"335594809_Estimating_information_in_time-varying_signals","abstract":"Across diverse biological systems-ranging from neural networks to intracellular signaling and genetic regulatory networks-the information about changes in the environment is frequently encoded in the full temporal dynamics of the network nodes. A pressing data-analysis challenge has thus been to efficiently estimate the amount of information that these dynamics convey from experimental data. Here we develop and evaluate decoding-based estimation methods to lower bound the mutual information about a finite set of inputs, encoded in single-cell high-dimensional time series data. For biological reaction networks governed by the chemical Master equation, we derive model-based information approximations and analytical upper bounds, against which we benchmark our proposed model-free decoding estimators. In contrast to the frequently-used k-nearest-neighbor estimator, decoding-based estimators robustly extract a large fraction of the available information from high-dimensional trajectories with a realistic number of data samples. We apply these estimators to previously published data on Erk and Ca2+ signaling in mammalian cells and to yeast stress-response, and find that substantial amount of information about environmental state can be encoded by non-trivial response statistics even in stationary signals. We argue that these single-cell, decoding-based information estimates, rather than the commonly-used tests for significant differences between selected population response statistics, provide a proper and unbiased measure for the performance of biological signaling networks.","authors":["Sarah Cepeda-Humerez","Jakob Ruess","Gašper Tkačik"],"meta":["September 2019PLoS Computational Biology 15(9):e1007290","DOI:10.1371/journal.pcbi.1007290"],"references":["292987828_Extending_the_dynamic_range_of_transcription_factor_action_by_translational_regulation","339169170_A_Tight_Upper_Bound_on_Mutual_Information","330791905_Optimal_Decoding_of_Cellular_Identities_in_a_Genetic_Network","325274711_Distributed_and_dynamic_intracellular_organization_of_extracellular_information","322277018_Tensorflow_Large-scale_machine_learning_on_heterogeneous_distributed_systems","319770252_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","319214071_P53_pulses_lead_to_distinct_patterns_of_gene_expression_albeit_similar_DNA-binding_dynamics","317661721_Introduction_to_Multivariate_Statistical_Analysis","311210854_Capacity_of_a_Simple_Intercellular_Signal_Transduction_Channel","305007070_Dynamic_Sampling_and_Information_Encoding_in_Biochemical_Networks","280037179_Optimizing_information_flow_in_small_genetic_networks_IV_Spatial_coupling","274317610_Improved_Estimation_and_Interpretation_of_Correlations_in_Neural_Circuits","270287433_Information_Processing_in_Living_Systems","275182135_Stochastic_Processes_in_Physics_and_Chemistry","271335614_Learning_machines_and_sleeping_brains_Automatic_sleep_stage_classification_using_decision-tree_multi-class_support_vector_machines"]}