{"id":"335577803_A_Non-Invasive_Method_Based_on_Computer_Vision_for_Grapevine_Cluster_Compactness_Assessment_Using_a_Mobile_Sensing_Platform_under_Field_Conditions","abstract":"Grapevine cluster compactness affects grape composition, fungal disease incidence, and wine quality. Thus far, cluster compactness assessment has been based on visual inspection performed by trained evaluators with very scarce application in the wine industry. The goal of this work was to develop a new, non-invasive method based on the combination of computer vision and machine learning technology for cluster compactness assessment under field conditions from on-the-go red, green, blue (RGB) image acquisition. A mobile sensing platform was used to automatically capture RGB images of grapevine canopies and fruiting zones at night using artificial illumination. Likewise, a set of 195 clusters of four red grapevine varieties of three commercial vineyards were photographed during several years one week prior to harvest. After image acquisition, cluster compactness was evaluated by a group of 15 experts in the laboratory following the International Organization of Vine and Wine (OIV) 204 standard as a reference method. The developed algorithm comprises several steps, including an initial, semi-supervised image segmentation, followed by automated cluster detection and automated compactness estimation using a Gaussian process regression model. Calibration (95 clusters were used as a training set and 100 clusters as the test set) and leave-one-out cross-validation models (LOOCV; performed on the whole 195 clusters set) were elaborated. For these, determination coefficient (R2) of 0.68 and a root mean squared error (RMSE) of 0.96 were obtained on the test set between the image-based compactness estimated values and the average of the evaluators’ ratings (in the range from 1–9). Additionally, the leave-one-out cross-validation yielded a R2 of 0.70 and an RMSE of 1.11. The results show that the newly developed computer vision based method could be commercially applied by the wine industry for efficient cluster compactness estimation from RGB on-the-go image acquisition platforms in commercial vineyards.","authors":["Fernando Palacios López","Diago","Tardaguila"],"meta":["September 2019Sensors 19(17):3799","DOI:10.3390/s19173799"],"references":["333433136_Vineyard_pruning_weight_assessment_by_machine_vision_towards_an_on-the-go_measurement_system","329707582_On-the-Go_Grapevine_Yield_Estimation_Using_Image_Analysis_and_Boolean_Model","334004246_On-the-go_assessment_of_vineyard_canopy_porosity_bunch_and_leaf_exposure_by_image_analysis","326745990_A_robust_automated_flower_estimation_system_for_grape_vines","325618823_A_vision_methodology_for_harvesting_robot_to_detect_cutting_points","325018859_New_approach_of_simultaneous_multi-perspective_imaging_for_quantitative_assessment_of_the_compactness_of_grape_bunches_Simultaneous_multi-perspective_imaging_of_bunches","322276795_Surf_Speeded_up_robust_features","318392950_An_Introduction_to_Generalized_Linear_Models_Third_Edition","312538118_Support-vector_networks","310509588_Automatic_image-based_determination_of_pruning_mass_as_a_determinant_for_yield_potential_in_grapevine_management_and_breeding"]}