{"id":"335541528_Exploring_the_relationship_between_attitudes_toward_science_and_PISA_scientific_performance","abstract":"The Program for International Student Assessment (PISA) 2015 is focused on students’ competency in science, providing wide data banks for the analysis of the interaction between science performance and attitudes toward science. The few attempts to study this relationship in other assessment studies suggest some positive correlations on the individual level and some unexpected negative correlations and a lack of scalar invariance across countries. The aim of this study is to contribute to the exploration of the generalizability of this relationship across countries and regions within nations. For this, the PISA 2015 data are analyzed using Ordinary Least Square and Quantile regression modelling techniques together with bivariate correlation matrix analysis. The relationship patterns between attitudes —such as self-efficacy, interest in science, participation in science activities, and enjoyment of science—and performance in science are explored at different scales; across 72 PISA participating countries and across 17 regions in Spain. Across countries, the relationship is unexpectedly negative for all attitudes, although high quantiles show a much less pronounced pattern. Across regions, only self-efficacy is significantly and positively correlated with science performance. Overall, positive non–linear relationships are distinguished for high performance values. The results of this study suggest the need of further research using non-parametric quantile regression modeling, and exploring attitudinal indices scaling when investigating potential universal/invariant models. This research should try to justify the comparison across countries/regions using aggregated scores, while incorporating differences in cultural, educational, and social influences on attitudes toward science. See the published version in this Share Link: https://authors.elsevier.com/a/1aQ6W8-LuV-znk","authors":["Gorka Bidegain","J.F. Lukas"],"meta":["August 2019Revista de Psicodidáctica 25(1):1-12","DOI:10.1016/j.psicoe.2019.08.002"],"references":["309461114_quantregnonpar_An_R_Package_for_Performing_Nonparametric_Series_Quantile_Regression","307450649_Como_puede_contribuir_el_proyecto_PISA_a_la_mejora_de_la_ensenanza_de_las_ciencias_y_de_otras_areas_de_conocimiento","305076719_Analisis_de_tendencias_en_las_investigaciones_realizadas_a_partir_de_los_datos_del_Proyecto_PISA","299490263_PISA_y_la_competencia_cientifica_un_analisis_de_las_pruebas_de_PISA_en_el_area_de_ciencias","275898819_Students'_Attitudes_Toward_Science_as_Predictors_of_Gains_on_Student_Content_Knowledge_Benefits_of_an_After-School_Program","273898491_A_Model_of_Factors_Contributing_to_STEM_Learning_and_Career_Orientation","318393712_R_A_Language_and_Environment_for_Statistical_Computing","316823281_Self-efficacy_the_exercise_of_control","285211052_Encouraging_Student_Interest_in_Science_and_Technology_Studies","273516493_International_Large-Scale_Assessments_Challenges_in_Reporting_and_Potentials_for_Secondary_Analysis"]}