{"id":"335699390_Advancing_open_flexible_and_distance_learning_through_learning_analytics","abstract":"Formal education has a critical role to play in the development of skills and capabilities for individuals to be productive and engaged citizens in society. Yet mainstream formal education practices alone are no longer sufficient to cater to complex societal demands as individuals frequently alter career directions, seek alternative education access and attempt to balance competing life, work and education requirements. Formal and informal learning opportunities through open, flexible and distance learning (OFDL) models are necessary elements within the broader education system. As such, contemporary educators are increasingly experimenting with open and flexible learning and teaching models and technologies that can create socially engaged and active learning contexts. Further, the integration of diverse educational scenarios can help to inform new learning models and teaching strategies.\n\nEducators are acutely aware of the need to re-adjust learning and teaching practices to foster 21st-century capabilities. This process is closely associated with an open, flexible and sustainable space that is no longer simply a physical construct but also includes an online environment that is not only supportive of this new type of learning but also acts as a catalyst for learning. The online learning environment is an important, integrated part of our educational system that enables learners to explore connections between what they have learned and other sources of knowledge and experience.\n\nIn recent years, broad learning initiatives (e.g., open educational resources, Khan Academy, massive open online courses, as well as micro-credentialling) have offered openness, transparency and flexibility in accessing learning and demonstrating outcomes. These initiatives have vastly extended the opportunities for students to access alternate modes of learning while interacting with peers on a global scale. However, to date much of the research investigating the role, impact and influence of these learning opportunities has focused more on the practical outcomes (e.g., student grades), in lieu of more theoretical or policy-driven perspectives (e.g., Houlden & Veletsianos, 2019 Houlden, S., & Veletsianos, G. (2019). A posthumanist critique of flexible online learning and its “anytime anyplace” claims. British Journal of Educational Technology, 50, 1005–1018. doi:10.1111/bjet.12779.[Crossref], [Web of Science ®] , [Google Scholar]; Selwyn, 2011 Selwyn, N. (2011). ‘Finding an appropriate fit for me’: Examining the (in)flexibilities of international distance learning. International Journal of Lifelong Education, 30, 367–383. doi:10.1080/02601370.2011.570873.[Taylor & Francis Online] , [Google Scholar]).\n\nThe theoretical perspectives bring critical insights and debate regarding the ways online, open, and flexible learning environments operate to balance an increasingly technology-dominated education context. There is a need to create new conceptual and theoretical frameworks to guide our understanding of the future potential of online and flexible learning contexts to educate young people. We still have much to understand about how student learning processes develop and adapt to changing contexts. Similarly, there is much work to undertake in identifying effective, scalable and sustainable approaches to designing and implementing more personalised and contextualised learning support, as well as providing our teachers with relevant and timely data to empower actionable intelligence.\n\nDevelopments in the field of learning analytics have generated new opportunities to invigorate the online, open and flexible learning environment, marked by the digitisation of immense volumes of clickstream data and the capacity to access and learn from it. Work in learning analytics provides for increased feedback opportunities and brings to light data on previously hidden student learning activity. Analysing these unprecedented volumes of data about learners in online and distance education has great potential to help us understand the learning trajectory of diverse sets of learners. The traditional approaches to the study of data on student learning long practised in conventional educational settings are increasingly incongruous in an era of increasing modes of digital learning. There is an urgent need for new sets of research questions that adopt advanced approaches and utilise new methods, and to identify the underlying mechanisms affecting changes in learning and interactions in online settings, in order to gain further understanding of the complexity of learning in such flexible, changing adaptive or scalable contexts.\n\nThe aim of this special themed issue of the journal is to foster scientific debate among educationists, data and learning scientists, statisticians, computer scientists, teachers, practitioners and others to understand how learning analytics can lead to an understanding of learning and teaching processes while (re)invigorating the quality of online and distance education. In this special themed issue, we present state-of-the-art research studies which show how theoretical models and innovative approaches have been employed to understand learning and teaching through the use of large-scale or granular datasets. We are not interested in new technical possibilities simply for their own sake: what is important is their implications for online learning and teaching.\n\nThis special themed issue has as its central focus the scope and potential of learning analytics in OFDL. Given the potential of learning analytics to provide new insights into contemporary educational challenges, the articles as a whole provide a picture of a complex research field that needs to take account of psychological considerations (Wu & Lai), instructional strategies (Huang, Hwang, Hew, & Warning), learning design (Holmes, Nguyen, Zhang, Mavrikis, & Rienties) and student modelling (Slater & Baker), as well as issues of privacy and ethics (Prinsloo, Slade, & Khalil). In so doing, these articles echo Wise and Schaeffer’s (2015 Wise, A. F., & Shaffer, D. W. (2015). Why theory matters more than ever in the age of big data. Journal of Learning Analytics, 2, 5–13. doi:10.18608/jla.2015.22.2.[Crossref] , [Google Scholar]) call to engage in a theoretical consideration of learning as it relates to issues of data collection and analysis in the area of learning analytics. Taken together, these articles make clear that the nature of learning in OFDL will not be determined by the affordance of technologies alone but is more clearly understood through the use of learning analytics, informed by learning theories. As such, they point to the increasingly urgent need to understand issues of socio-cultural theories of learning (Holmes et al.), the Big Five model (Wu & Lai), gamification (Huang et al.), knowledge mastery (Slater & Baker) and emotive impact (Prinsloo et al.) – research issues that are yet to be fully addressed.\n\nThe penetration of distance education into conventional education systems is documented in this special themed issue. Three articles reflect the potential of learning analytics to provide evidence of effective learning behaviours online in university or school settings – an attempt at appreciating the integration of distance learning into broader education systems. These topics (among others) may serve as the overarching challenge for both distance education researchers and learning analytics researchers to work together to promote the use of learning analytics in the context of OFDL, both in traditional distance education and in conventional school systems.\n\nHolmes et al., in their article “Learning Analytics for Learning Design in Online Distance Learning”, highlight the importance of using learning analytics to investigate the efficacy of learning design, which draws on socio-cultural theories of learning to emphasise the processes of, and the learner’s active role in, learning. Their work delineates emerging evidence-based design, where there is a correspondence between learning designs and learning analytics. Their study, involving data from 47,784 students, investigates the impact of learning design patterns on students’ behaviour, pass rates and their satisfaction in courses offered by the United Kingdom’s Open University. The authors apply social network and cluster analyses to illustrate the importance of aligning intended outcomes with learning design models.\n\nWu and Lai’s article, “Linking Prediction with Personality Traits: A Learning Analytics Approach”, presents us with a new open and flexible online learning scenario which is implemented in a Chinese high school. Their article describes how learning analytics can be used to predict learning achievement in schools and presents prediction models for mapping aspects of learning behaviours to reported personality traits of students. Neural networks and deep belief networks are the main methods adopted for developing the predictive model. They focus on personality traits which vary by students’ groups, arguing that psychological factors prevent the prediction model from realising the potential of using learning behaviours to estimate learning achievement in schools. Although prediction is not a novel pursuit in learning analytics (Dawson, Gašević, Siemens, & Joksimovic, 2014 Dawson, S., Gašević, D., Siemens, G., & Joksimovic, S. (2014). Current state and future trends: A citation network analysis of the learning analytics field. In M. Pistilli, J. Willis, & D. Koch (Eds.), Proceedings of the Fourth International Conference on Learning Analytics and Knowledge (pp. 231–240). New York, NY: ACM. doi:10.1145/2567574.2567585.[Crossref] , [Google Scholar]), the ability to use online behaviours to predict students’ achievement is fundamental to scaling the implementation of open and flexible online learning scenarios in conventional education, such as in Chinese high schools. Evidence identified by using learning analytics is essential to convince policymakers or educational administrators to integrate more forms of distance education in schools.\n\nHuang et al.’s study, “Effects of Gamification on Students’ Online Interactive Patterns and Peer-feedback”, contributes to the field by exemplifying how the theory-driven gamification goal, access, feedback, challenge, collaboration model could guide better design interactions in online forums. They investigate the role of gamification to support interactivity in online forums. In this experimental study, learning analytics, in particular social network analytics, are used, together with content analysis, to test the effects of gamification on students’ online discussion quality and interaction patterns. The social network analysis results show that students in the gamification-based course have denser networks than those in the control group. More students are active in the network in comparison with the control group. Content analysis reveals that students provide higher quality peer-feedback than students in the control group.\n\nSlater and Baker’s work, “Forecasting Future Student Mastery”, highlights the importance of automatic assessment of knowledge mastery in making sense of student learning. They explain how automated assessment of student learning can be used to drive adaptive learning and increase the flexibility of online learning systems to provide differentiated learning experiences and they present a methodological-ground analysis of a large-scale dataset (22,225 students) in an adaptive learning environment. They adopt two popular methods for modelling student learning (e.g., Bayesian knowledge tracing and performance factors analysis) and compare prediction accuracy. The capability to forecast a student’s future performance and knowledge in a learning activity offers the ability for online tutors to provide sufficient support and scaffolding for distance education learners, as well as helping learners to adjust their learning goals in the process of learning. Their work on knowledge mastery in an adaptive learning system draws attention to matters relating to forecasting the future performance of students in OFDL.\n\nPrinsloo et al.’s work, “Student Data Privacy in MOOCs: A Sentiment Analysis”, offers a novel case study for learning analytics work. The authors highlight concerns in student privacy and the protection of student data in relation to the scope and potential of learning analytics in MOOCs. They consider the emotive use of language in consent provided by students at registration and suggest that the complexity and terminology used in consent can impact user understanding and engagement. Given the role of MOOCs within OFDL, it is important to highlight how providers of educational content make clear their intentions with regard to the uses of data, which contributes to data collection, analysis and use in learning analytics. Their work draws attention to the use and value of student privacy and data protection for learning analytics in distance education.\n\nIn this special themed issue, the topics under discussion reflect the wide scope of the potential and concerns of learning analytics in OFDL, both in positive ways of raising the attention to the use (or not) of learning analytics to drive a change in distance education. The articles present research questions and methodologies in a variety of contexts, from the Open University (Holmes et al.), to blended learning programs in a conventional education system (Wu & Lai), interactivity in university online forums (Huang et al.), an adaptive learning system for blended classroom situations and homework (Slater & Baker) and MOOCs (Prinsloo et al.). The settings differ, but the attempt to use learning analytics to understand how learning occurs presents very real research challenges in each case. The shift to OFDL can lead to a loss of observation of the learning process for both tutors and learners, which highlights the importance of using learning analytics in such learning processes and scenarios.\n\nIn this special themed issue, we also feature a reflection and commentary by Siemens, who points out that learning analytics have an integral role in helping to document and define issues in assessing, supporting and extending the innovations in OFDL. The significant progress in learning analytics will enable us to expand our understanding of learning processes and activities from those such as gamification, psychological profiles of learners, and forecast knowledge states, so as to give careful thought to questions central to the human experience. Siemens believes that this special issue is one step towards the development of new approaches to understanding what happens with learners when they engage with one another and with a curriculum.\n\nIn contrast, Jacobson takes a critical view of the contribution that learning analytics can make to OFDL research. His reflection connects OFDL with the learning sciences while looking at the potential of learning analytics. He proposes to use the complex systems conceptual framework of learning to theorise OFDL systems as important and innovative subsystems within the broader educational systems. In ODFL, this complex framework helps us to interpret information generated by computational research methods informed by learning analytics. He further points out the problem of knowledge assessments such as machine scorable multiple-choice questions in online systems, which we should keep at the forefront of our minds as we work with learning scientists.\n\nWe believe the questions raised by Siemens and Jacobson demand a concerted effort to explore the potential of learning analytics to investigate human learning in OFDL. These are questions that we should not only attempt to answer but that we must always keep at the forefront of our minds as we work together with each other in this promising field. The joining of the interdisciplinary synergy mirrors the core value of human learning, linking with scholars from the learning sciences and learning analytics to form alliances for online education research capable of making sense of human learning in this rapidly changing world.\n\nAlthough the field of learning analytics continues to receive attention, there remain numerous unresolved learning and teaching challenges to address. Learning analytics or educational data mining researchers who are overwhelmed by the technical capacity of analytics might assume that learning and interactions remain the same in this new form of OFDL environment, but this is far from the case, as a great quantity of evidence, reported in recent publications regarding distance education, has shown (e.g., Bolliger & Halupa 2018 Bolliger, D. U., & Halupa, C. (2018). Online student perceptions of engagement, transactional distance, and outcomes. Distance Education, 39, 299–316. doi:10.1080/01587919.2018.1476845.[Taylor & Francis Online], [Web of Science ®] , [Google Scholar]; Naidu 2018 Naidu, S. (2018). To interact or not to interact is NOT the question! [Editorial]. Distance Education, 39, 277–280. doi:10.1080/01587919.2018.1483715[Taylor & Francis Online], [Web of Science ®] , [Google Scholar]; Tang, Xing, & Pei, 2018 Tang, H., Xing, W., & Pei, B. (2018). Exploring the temporal dimension of forum participation in MOOCs. Distance Education, 39, 353–372. doi:10.1080/01587919.2018.1476841.[Taylor & Francis Online], [Web of Science ®] , [Google Scholar]; Sheail, 2018 Sheail, P. (2018). Temporal flexibility in the digital university: Full-time, part-time, flexitime. Distance Education, 39, 462–479. doi:10.1080/01587919.2018.1520039.[Taylor & Francis Online], [Web of Science ®] , [Google Scholar]; Zhang, Lou, Zhang, & Zhang, 2019 Zhang, J., Lou, X., Zhang, H., & Zhang, J. (2019). Modeling collective attention in online and flexible learning environments. Distance Education, 40, 278–301. doi:10.1080/01587919.2019.1600368.[Taylor & Francis Online], [Web of Science ®] , [Google Scholar]). Not recognising how learning really occurs in such environments can lead to disappointing analyses of big data in education, which now proliferate throughout educational market. Lodge, Alhadad, Lewis, & Gašević (2017 Lodge, J. M., Alhadad, S. S., Lewis, M. J., & Gašević, D. (2017). Inferring learning from big data: The importance of a transdisciplinary and multidimensional approach. Technology, Knowledge and Learning, 22, 385–400. doi:10.1007/s10758-017-9330-3.[Crossref], [Web of Science ®] , [Google Scholar]) draw attention to the inherent complexities when inferring learning outcomes and processes from big datasets – now a relatively core and common approach in learning analytics research. Where such insights are implied, there remains a lack of attention to the reproducibility of findings and the associated impact such findings can bring to bear on learning and teaching practice. If the goal of learning analytics is to provide insights into learning, then as the field further matures there is a requirement to move beyond prediction and statements of actionable intelligence to more longitudinal studies involving novel methodologies and analytical techniques. Key to this work will be furthering our collective understanding of how students, teachers and administrators make sense of increasingly complex datasets and information through visualisations and feedback mechanisms. This is particularly relevant in an era of digital education that is increasingly promoting accessible, open, flexible, adaptive and distance learning pathways.","authors":["Jingjing Zhang","Daniel Burgos","Shane Dawson"],"meta":["July 2019Distance Education 40(3):303-308","DOI:10.1080/01587919.2019.1656151"],"references":["332040677_A_posthumanist_critique_of_flexible_online_learning_and_its_anytime_anyplace_claims","325400959_Online_student_perceptions_of_engagement_transactional_distance_and_outcomes","318601661_Inferring_Learning_from_Big_Data_The_Importance_of_a_Transdisciplinary_and_Multidimensional_Approach","284197155_Why_Theory_Matters_More_than_Ever_in_the_Age_of_Big_Data","261958598_Current_State_and_future_trends_a_citation_network_analysis_of_the_learning_analytics_field","332316355_Modeling_collective_attention_in_online_and_flexible_learning_environments","327912417_Temporal_flexibility_in_the_digital_university_full-time_part-time_flexitime","326760573_Editorial_to_interact_or_not_to_interact_is_NOT_the_question","325350167_Exploring_the_temporal_dimension_of_forum_participation_in_MOOCs","254252751_'Finding_an_appropriate_fit_for_me'_Examining_the_inflexibilities_of_international_distance_learning"]}