{"id":"335677277_Frequency_Estimation_by_the_Method_of_Minimum_Mean_Squared_Error_and_P-value_Distributed_in_the_Wireless_Sensor_Network","abstract":"The development of electronic equipment technology, followed by the advancement of electronic systems, has increased the sensitivity of signal identification. Control and monitoring is a matter that forces existing engineers to make decisions and protect systems. In this paper, the distributed least mean p-norm method (dLMP) has been evaluated and evaluated to estimate the distributed frequency of the signal in three incremental, consensus, and scattering strategies. In the proposed method, based on the definition of appropriate cost functions, a distributed method is used to estimate the frequency of common sinusoidal signals with a common frequency in a wireless sensor network. The results of simulation with MATLAB software showed that the proposed algorithm has better and more favorable performance compared to other methods such as single-sensor and distributed methods. In the proposed method simultaneously with the distributed frequency estimation, the domain and phase estimation with a suitable and fast convergence is possible locally. Due to this advantage compared to the distributed filter method, the proposed method is less complicated and the convergence rate is appropriate and better.","authors":["Osamah Ibrahem Khalaf"],"meta":["September 2019","DOI:10.6688/JISE.201909_35(5).0010"],"references":["308818220_Optimal_network_topology_for_a_locating_system_using_RSSI-based_direction_finding","301569195_A_Low-Cost_RSSI-Based_Localization_System_for_Wildlife_Tracking","272392938_Power_System_Frequency_Estimation_by_Using_a_Newton-Type_Technique_for_Smart_Meters","319127196_Wireless_Sensor_Network","309263774_Energy_harvesting_for_wireless_sensor_networks_Applications_and_challenges_in_smart_grid","290509079_From_radio_telemetry_to_ultra-low-power_sensor_networks_Tracking_bats_in_the_wild","283552674_A_New_and_Accurate_Estimator_With_Analytical_Expression_for_Frequency_Estimation","282551850_Distributed_Widely_Linear_Kalman_Filtering_for_Frequency_Estimation_in_Power_Networks","276398252_Distributed_Frequency_Estimation_Over_Sensor_Network","274460784_Fine_resolution_frequency_estimation_from_three_DFT_samples_Case_of_windowed_data"]}