{"id":"335633343_Immersive_Virtual_Reality-Based_Interfaces_for_Character_Animation","abstract":"Virtual Reality (VR) has increasingly attracted the attention of the computer animation community in search of more intuitive and effective alternatives to the current sophisticated user interfaces. Previous works in the literature already demonstrated the higher affordances offered by VR interaction, as well as the enhanced spatial understanding that arises thanks to the strong sense of immersion guaranteed by virtual environments. These factors have the potential to improve the animators’ job, which is tremendously skill-intensive and time-consuming. The present paper explores the opportunities provided by VR-based interfaces for the generation of 3D animations via armature deformation. To the best of the authors’ knowledge, for the first time a tool is presented which allows users to manage a complete pipeline supporting the above animation method, by letting them execute key tasks such as rigging, skinning and posing within a well-known animation suite using a customizable interface. Moreover, it is the first work to validate, in both objective and subjective terms, character animation performance in the above tasks and under realistic work conditions involving different user categories. In our experiments, task completion time was reduced by 26%, on average, while maintaining almost the same levels of accuracy and precision for both novice and experienced users.","authors":["Alberto Cannavò","Claudio Demartini","Lia Morra","F. Lamberti"],"meta":["September 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2939427"],"references":["330580923_HTC_Vive_Analysis_and_Accuracy_Improvement","321380865_Inverse_Kinematics_Techniques_in_Computer_Graphics_A_Survey","317074230_The_Accuracy_and_Precision_of_Position_and_Orientation_Tracking_in_the_HTC_Vive_Virtual_Reality_System_for_Scientific_Research","315844554_Virtual_Character_Animation_Based_on_Affordable_Motion_Capture_and_Reconfigurable_Tangible_Interfaces","340572632_Is_Immersive_Virtual_Reality_the_Ultimate_Interface_for_3D_Animators","329953559_AnimationVR_-_Interactive_Controller-based_Animating_in_Virtual_Reality","320994832_Computer_Graphics_Animation_for_Objective_Self-Evaluation","318742866_Building_an_animation_pipeline_for_VR_stories","317043734_Multi-Device_Storyboards_for_Cinematic_Narratives_in_VR","314106908_A_tangible_interface_for_3D_character_animation_using_augmented_reality_technology"]}