{"id":"335609206_Stochastic_LQ_Control_Under_Asymptotic_Tracking_for_Discrete_Systems_over_Multiple_Lossy_Channels","abstract":"This paper addresses the asymptotic tracking problem subjected to linear quadratic constraints for linear discrete-time systems, where packet dropout occurs in actuating channels. In order to solve this objective control problem, the controller-coding co-design approach is adopted, i.e., the controller, encoder and decoder are designed for taking full advantage of the network resource collaboratively, thereby achieving better transmission of control signals. A stabilizability condition in the mean square sense that reveals the fundamental limitation among the H2 norm of the plant, data arrival rates and coding matrices is first derived. Then, a solvability condition is conducted to handle the additional stochastic LQ control objective by a modified discrete-time algebraic Riccati equation, and an iterative algorithm is also given for designing the corresponding state feedback gain and coding matrices. Relied on such design, the asymptotic tracking constraint is further fulfilled through solving a Sylvester equation, and the feedforward gain related to tracking is parameterized. Finally, a simulation with the implementation of the design method on two cooperative robots is included to show the effectiveness of the current results.","authors":["Rongyao Ling","Yu Feng","Fabien Claveau","Philippe Chevrel"],"meta":["September 2019IET Control Theory and Applications 13(18):3107-3116","DOI:10.1049/iet-cta.2018.6234"],"references":["304593857_Output_feedback_stabilization_for_discrete-time_systems_under_limited_communication","295858438_Observer-based_stabilizing_controllers_for_discrete-time_systems_with_quantized_signal_and_multiplicative_random_noise","287996922_Comprehensive_admissibility_for_descriptor_systems","287347083_LQG_Control_of_Networked_Control_Systems_with_Limited_Information","327208426_Stabilization_of_networked_multi-input_systems_with_channel_resource_allocation","326311084_Distributed_Kalman_Filtering_Over_Wireless_Sensor_Networks_in_the_Presence_of_Data_Packet_Drops","323746855_Algebraic_Methods_for_Nonlinear_Control_Systems","321525518_Algebraic_Methods_for_Nonlinear_Control_Systems","312205741_Periodic_Event-Triggered_Cooperative_Control_of_Multiple_Nonholonomic_Wheeled_Mobile_Robots","303955392_Distributed_Impulsive_Control_for_Islanded_Microgrids_with_Variable_Communication_Delays"]}