{"id":"335634737_Mining_patient_opinion_to_evaluate_the_service_quality_in_healthcare_a_deep-learning_approach","abstract":"The emergence of social media has created several opportunities for patients to evaluate the quality of healthcare services by posting online reviews. The rich text and photographic information in the online reviews results insights into how patients’ experience with the doctor and their satisfaction with healthcare service delivery. Various studies have performed patients’ opinion analysis using textual contents. This study presents a novel multimodal approach to analyze the patients’ sentiment regarding the quality of healthcare service delivery (high vs. low). In comparison with existing studies, we consider not only the unique textual contents but photographic contents as well from the Yelp.com platform, which is more challenging due to feature extraction. We evaluate the performance of the baseline, and deep learning algorithms across textual cues, visual cues, and the fusion of both text and visual cues. Experimental results indicated that the addition of novel features increases the models’ accuracy to 15.0% across text and visual cues. Furthermore, fusing text and visual contents improve the classification accuracy by at least 12.64% instead of considering the contents alone. Preliminary comparative experiments result show that the deep learning model outperformed all other algorithms. In comparison with several other state-of-the-art methods in the biomedical domain, the proposed model could significantly enhance the performance of the classifier indicating the effectiveness and suitability of the methodology.","authors":["Adnan Shah","Xiangbin Yan","Asad Shah","Gulnara Mamirkulova"],"meta":["July 2020Journal of Ambient Intelligence and Humanized Computing 11(7):1-18","DOI:10.1007/s12652-019-01434-8"],"references":["332026356_Economic_Success_of_Physicians_in_the_Online_Consultation_Market_A_Signaling_Theory_Perspective","329072756_The_Virtual_Sphere_The_Internet_as_a_Public_Sphere_Offentlichkeit_und_Privatheit_im_Web_20","328720970_Social_media_based_event_summarization_by_user-text-image_co-clustering","328503084_Readmission_Prediction_Using_Trajectory-Based_Deep_Learning_Approach_International_Conference_ICSH_2018_Wuhan_China_July_1-3_2018_Proceedings","328499675_ICSH_2018_LSTM_based_Sentiment_Analysis_for_Patient_Experience_Narratives_in_E-survey_Tools_International_Conference_ICSH_2018_Wuhan_China_July_1-3_2018_Proceedings","327885755_Using_a_Stacked_Residual_LSTM_Model_for_Sentiment_Intensity_Prediction","327351772_Predicting_hospital_readmission_for_lupus_patients_An_RNN-LSTM-based_deep-learning_methodology","327132056_Hyperspectral_Image_Classification_Using_Spectral-Spatial_LSTMs","326705456_Multimodal_Sentiment_Analysis_using_Hierarchical_Fusion_with_Context_Modeling","325897563_Developing_the_embedded_taxonomy_and_mining_the_patients_interests_from_online_physician_reviews_a_mixed_method_approach_Preprint"]}