{"id":"335657946_Behavioral_Habits-Based_User_Identification_Across_Social_Networks","abstract":"Social networking is an interactive Internet of Things. The symmetry of the network can reflect the similar friendships of users on different social networks. A user’s behavior habits are not easy to change, and users usually have the same or similar display names and published contents among multiple social networks. Therefore, the symmetry concept can be used to analyze the information generated by the user for user identification. User identification plays a key role in building better information about social network user profiles. As a consequence, it has very important practical significance in many network applications and has attracted a great deal of attention from researchers. However, existing works are primarily focused on rich network data and ignore the difficulty involved in data acquisition. Display names and user-published content are very easy to obtain compared to other types of user data across different social networks. Therefore, this paper proposes an across social networks user identification method based on user behavior habits (ANIUBH). We analyzed the user’s personalized naming habits in terms of display names, then utilized different similarity calculation methods to measure the similarity of the features contained in the display names. The variant entropy value was adopted to assign weights to the features mentioned above. In addition, we also measured and analyzed the user’s interest graph to further improve user identification performance. Finally, we combined one-to-one constraint with the Gale–Shapley algorithm to eliminate the one-to-many and many-to-many account-matching problems that often occur during the results-matching process. Experimental results demonstrated that our proposed method enables the possibility of user identification using only a small amount of online data.","authors":["Haohan Xing","Hongzhong Deng","Wu","Haiyi Xie"],"meta":["September 2019Symmetry 11(9):1134","DOI:10.3390/sym11091134"],"references":["332823918_A_Multiuser_Identification_Algorithm_Based_on_Internet_of_Things","332586152_A_User_Identification_Algorithm_Based_on_User_Behavior_Analysis_in_Social_Networks","324782789_Matching_user_accounts_across_social_networks_based_on_username_and_display_name","332434873_Research_on_User_Identification_across_Multiple_Social_Networks_Based_on_Preference","324471180_Machiavelli_and_the_Gale-Shapley_Algorithm","323632346_A_Deep_Dive_into_User_Display_Names_across_Social_Networks","322875287_Matching_user_accounts_based_on_user_generated_content_across_social_networks","321987287_Structure_Based_User_Identification_across_Social_Networks","319299107_User_Identification_Based_on_Display_Names_Across_Online_Social_Networks","314630490_Profile_Matching_Across_Online_Social_Networks_Based_on_Geo-Tags"]}