{"id":"335672579_Application_of_Quantum_Annealing_to_Nurse_Scheduling_Problem","abstract":"Quantum annealing is a promising heuristic method to solve combinatorial optimization problems, and efforts to quantify performance on real-world problems provide insights into how this approach may be best used in practice. We investigate the empirical performance of quantum annealing to solve the Nurse Scheduling Problem (NSP) with hard constraints using the D-Wave 2000Q quantum annealing device. NSP seeks the optimal assignment for a set of nurses to shifts under an accompanying set of constraints on schedule and personnel. After reducing NSP to a novel Ising-type Hamiltonian, we evaluate the solution quality obtained from the D-Wave 2000Q against the constraint requirements as well as the diversity of solutions. For the test problems explored here, our results indicate that quantum annealing recovers satisfying solutions for NSP and suggests the heuristic method is potentially achievable for practical use. Moreover, we observe that solution quality can be greatly improved through the use of reverse annealing, in which it is possible to refine returned results by using the annealing process a second time. We compare the performance of NSP using both forward and reverse annealing methods and describe how this approach might be used in practice.","authors":["Kazuki Ikeda","Yuma Nakamura","Travis Humble"],"meta":["September 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-49172-3"],"references":["331102843_Improving_solutions_by_embedding_larger_subproblems_in_a_D-Wave_quantum_annealer","329764011_Benchmarking_treewidth_as_a_practical_component_of_tensor_network_simulations","324898439_An_approach_to_quantum-computational_hydrologic_inverse_analysis","323597968_Observation_of_topological_phenomena_in_a_programmable_lattice_of_1800_qubits","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","339959099_Demonstration_of_a_Nonstoquastic_Hamiltonian_in_Coupled_Superconducting_Flux_Qubits","333803458_Experimental_and_Theoretical_Study_of_Thermodynamic_Effects_in_a_Quantum_Annealer","329673385_Quantum_Annealing_Applied_to_De-Conflicting_Optimal_Trajectories_for_Air_Traffic_Management","324055899_Quantum_speedup_in_stoquastic_adiabatic_quantum_computation","322781740_Adiabatic_quantum_computation"]}