{"id":"335678985_The_Journey_of_Learning_Analytics","abstract":"It has been almost a decade since the emergence of learning analytics, a bricolage field of research and practice that focuses on understanding and optimising learning and learning environments. Since the initial efforts to make sense of large learning-related datasets, learning analytics has come a long way in developing sophisticated methods for capturing various proxies of learning. Researchers in the field also quickly recognised the necessity to tackle complex and often controversial issues of privacy and ethics when dealing with learner-generated data. Finally, despite huge interests in analytics across various stakeholders-governments, educational institutions, teachers, and learners-learning analytics is still facing many challenges when it comes to broader adoption. This article provides an overview of this journey, critically reflecting on the existing research, providing insights into the recent advances, and discussing the future of the field, positioning learning analytics within the broader agenda of systems thinking as means of advancing its institutional adoption.","authors":["Srecko Joksimovic","Vitomir Kovanovic","Shane Dawson"],"meta":["January 2019"],"references":["333098349_A_Systematic_Review_of_Empirical_Studies_on_Learning_Analytics_Dashboards_A_Self-Regulated_Learning_Perspective","331337708_Counting_Clicks_is_Not_Enough_Validating_a_Theorized_Model_of_Engagement_in_Learning_Analytics","331333276_Increasing_the_Impact_of_Learning_Analytics","323862187_Understand_students'_self-reflections_through_learning_analytics","323303368_Assessing_cognitive_presence_using_automated_learning_analytics_methods","320188216_How_do_we_Model_Learning_at_Scale_A_Systematic_Review_of_Research_on_MOOCs","319987180_Exploring_development_of_social_capital_in_a_CMOOC_through_language_and_discourse","327000064_A_Review_of_Multimodal_Learning_Analytics_Architectures","323894816_On_the_Nth_presence_for_the_Community_of_Inquiry_framework","323862261_Rethinking_learning_analytics_adoption_through_complexity_leadership_theory"]}