{"id":"335675377_Active_control_of_vortex-induced_vibration_of_a_circular_cylinder_using_machine_learning","abstract":"We demonstrate the use of high-fidelity computational fluid dynamics simulations in machine-learning based active flow control. More specifically, for the first time, we adopt the genetic programming (GP) to select explicit control laws, in a data-driven and unsupervised manner, for the suppression of vortex-induced vibration (VIV) of a circular cylinder in a low-Reynolds-number flow (Re = 100), using blowing/suction at fixed locations. A cost function that balances both VIV suppression and energy consumption for the control is carefully chosen according to the knowledge obtained from pure blowing/suction open-loop controls. By implementing reasonable constraints to VIV amplitude and actuation strength during the GP evolution, the GP-selected best ten control laws all point to suction-type actuation. The best control law suggests that the suction strength should be nonzero when the cylinder is at its equilibrium position and should increase nonlinearly with the cylinder’s transverse displacement. Applying this control law suppresses 94.2% of the VIV amplitude and achieves 21.4% better overall performance than the best open-loop controls. Furthermore, it is found that the GP-selected control law is robust, being effective in flows ranging from Re = 100 to 400. On the contrary, although the P-control can achieve similar performance as the GP-selected control at Re = 100, it deteriorates in higher Reynolds number flows. Although for demonstration purpose the chosen control problem is relatively simple, the training experience and insights obtained from this study can shed some light on future GP-based control of more complicated problems.","authors":["Feng Ren","Wang Chenglei","Hui Tang"],"meta":["September 2019Physics of Fluids 31(9):093601","DOI:10.1063/1.5115258"],"references":["320478483_Lock-on_of_vortex_shedding_to_a_pair_of_synthetic_jets_with_phase_difference","307930906_Drag_reduction_of_a_car_model_by_linear_genetic_programming_control","306043468_Stochastic_modelling_and_feedback_control_of_bistability_in_a_turbulent_bluff_body_wake","303356391_Frequency_selection_by_feedback_control_in_a_turbulent_shear_flow","324268266_A_GPU-accelerated_solver_for_turbulent_flow_and_scalar_transport_based_on_the_Lattice_Boltzmann_method","318846868_Control_of_vortex-induced_vibration_using_a_pair_of_synthetic_jets_Influence_of_active_lock-on","307523213_Model_Reduction_for_Flow_Analysis_and_Control","301792767_Active_control_of_vortex-induced_vibrations_of_a_circular_cylinder_using_windward-suction-_leeward-blowing_actuation","301344666_An_investigation_on_momentum_exchange_methods_and_refilling_algorithms_for_lattice_Boltzmann_simulation_of_particulate_flows","287158076_Control_of_wakes_and_vortex-induced_vibrations_of_a_single_circular_cylinder_using_synthetic_jets"]}