{"id":"335680931_Theoretical_and_Computational_Analysis_of_the_Falling_Ladder_Problem","abstract":"A comprehensive study of the falling ladder problem is presented. The ladder may fall naturally under the influence of gravity alone and at some point lose its contact with the wall or it may be kept in contact with the wall by a physical constraint. Several scenarios about the way the point of contact with the floor is moved are also considered. While solutions for the case of moving this point at constant velocity exist, generating such a motion requires implementation of an actuator. Here, the more general case of moving this point by an actuator at constant acceleration is presented and the required varying actuator force is calculated. Furthermore, computer simulations using MATLAB and the motion analysis tool of SolidWorks are generated to verify the theoretical results. Computer simulations are also used to display a comprehensive set of the findings. The theoretical results given in this paper can be used as benchmarks (in applications like robotics) for generating more realistic computer simulations and animations where elements behaving like the ladder discussed here are part of a mechanism.","authors":["Ali Ghorashi","Mehrdaad Ghorashi"],"meta":["September 2019SN Computer Science 1(1)","DOI:10.1007/s42979-019-0019-7"],"references":["296330277_Friction_controlled_three_stage_ladder_sliding_motion_in_a_non-conservative_system_From_pre-detachment_to_post-detachment","275467415_Dynamics_of_a_sliding_ladder_leaning_against_a_wall","257717327_Using_Computer_Simulation_and_Animation_to_Improve_Student_Learning_of_Engineering_Dynamics","322814655_The_Falling_Ladder_Paradox","322014102_The_Falling_Ladder_Paradox_Revisited","273459934_Engineering_Mechanics_Vol_2_Dynamics","263519543_Variations_of_the_Sliding_Ladder_Problem","257608377_Geometrically_exact_physics-based_modeling_and_computer_animation_of_highly_flexible_1D_mechanical_systems","256623264_The_mathematics_of_motion_for_computer_animation_A_case_study","226573561_Teaching_Multibody_Dynamics_from_Modeling_to_Animation","220251896_Computer_animation_of_swaying_trees_based_on_physical_simulation"]}