{"id":"335668769_Confinement_of_two-body_systems_and_calculations_in_d_dimensions","abstract":"A continuous transition for a system moving in a three-dimensional (3D) space to moving in a lower-dimensional space, 2D or 1D, can be made by means of an external squeezing potential. A squeeze along one direction gives rise to a 3D to 2D transition, whereas a simultaneous squeeze along two directions produces a 3D to 1D transition, without going through an intermediate 2D configuration. In the same way, for a system moving in a 2D space, a squeezing potential along one direction produces a 2D to 1D transition. In this work we investigate the equivalence between this kind of confinement procedure and calculations without an external field, but where the dimension d is taken as a parameter that changes continuously from d=3 to d=1. The practical case of an external harmonic oscillator squeezing potential acting on a two-body system is investigated in detail. For the three transitions considered, 3D→2D, 2D→1D, and 3D→1D, a universal connection between the harmonic oscillator parameter and the dimension d is found. This relation is well established for infinitely large 3D scattering lengths of the two-body potential for 3D→2D and 3D→1D transitions, and for infinitely large 2D scattering length for the 2D→1D case. For finite scattering lengths size corrections must be applied. The traditional wave functions for external squeezing potentials are shown to be uniquely related to the wave functions for specific noninteger dimension parameters, d.","authors":["E. Garrido","A. S. Jensen"],"meta":["September 2019Physical Review Research 1(2)","DOI:10.1103/PhysRevResearch.1.023009"],"references":["318849354_Squeezing_the_Efimov_effect","318584151_Efimov_effect_in_D_spatial_dimensions_in_AAB_systems","225069811_Universal_properties_of_Fermi_gases_in_arbitrary_dimensions","332280457_Few-body_quantum_method_in_a_d-dimensional_space","329462521_Dimensional_crossover_in_non-relativistic_effective_field_theory","301848424_Dimensional_Crossover_of_Non-Relativistic_Bosons","270292730_Weakly_bound_states_of_two-_and_three-boson_systems_in_the_crossover_from_two_to_three_dimensions","241040524_The_quantum_few-body_problem_and_the_1_D_method","235525282_Binding_of_three_identical_bosons_in_two_dimensions","227002641_The_Fonseca-Redish-Shanley_solvable_model_for_a_molecular_three-body_system_and_the_efimov_effect_in_two_dimensions"]}