{"id":"335674187_Dynamic_Mobility_Load_Balancing_for_5G_Small_Cell_Networks_Based_on_Utility_Functions","abstract":"Deployment of small cells was introduced to support high data rate services and expand macro cell coverage for the envisioned 5G networks. A small cell network, which has a smaller size, along with the user equipment (UE) mobility, frequently undergoes unbalanced load status. Consequently, the network performance is affected in terms of throughput, increasing handover failure rate, and possibly higher link failure rate. Hence, load balancing has become an important part of recent researches on small cell networks. Mobility Load Balancing (MLB) involves load transfer from an overloaded small cell to under-loaded neighbouring small cells for the more load-balanced network. This transfer is performed by adjusting the handover parameters of the UEs according to the load situations of the small cells in the vicinity. However, inaccurate adjustment of parameters may lead to inefficient usage of network resources or degrade the Quality of Service (QoS). In this paper, we introduce a Utility-based Mobility Load Balancing algorithm (UMLB) and a new term named load balancing efficiency factor (LBEF). The UMLB algorithm considers the operator utility and the user utility for the MLB-based handover process. While LBEF is proposed to order the overloaded cells properly for the MLB algorithm operation. The simulation results show that the UMLB minimizes standard deviation with a higher average-UE data rate when compared to existing load balancing algorithms. Therefore, a well-balanced network is achieved.","authors":["Khaled Addali","Suhib Younis Bani Melhem","Yaser Khamayseh","Zhenjiang Zhang"],"meta":["September 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2939936","Project: MOBILITY AND RESOURCE MANAGEMENT FOR MOBILE RELAY SYSTEMS IN LTE-ADVANCED NETWORKS."],"references":["326956389_Optimized_and_load_balanced_clustering_for_wireless_sensor_networks_to_increase_the_lifetime_of_WSN_using_MADM_approaches","322449063_Adaptive_Mobility_Load_Balancing_Algorithm_for_LTE_Small-Cell_Networks","302927696_Analyzing_X2_handover_in_LTELTE-A","287959537_A_Heuristic_Approach_to_Mobility_Robustness_in_4G_LTE_Public_Safety_Networks","324957865_User_mobility_impacts_to_mobility_load_balancing_for_self-organizing_network_over_LTE_system","308337383_Mobility_Load_Balancing_Enhancement_for_Self-Organizing_Network_over_LTE_System","296173435_Small_fuel_cells_big_opportunities","282924205_A_threshold-based_multi-traffic_load_balance_mechanism_in_LTE-A_networks","261210601_Self-organized_neighborhood_mobility_load_balancing_for_LTE_networks","241638104_Enabling_small_cell_deployment_with_HetNet"]}