{"id":"335632486_Advances_in_Cross-Spectral_Iris_Recognition_Using_Integrated_Gradientface-Based_Normalization","abstract":"Cross-spectral iris recognition represents the ability of the system to identify the iris images acquired in different electromagnetic spectrums. An iris captured in the near-infrared spectrum (NIR) is matched with an iris obtained in the visual light spectrum (VIS) to boost the recognition performance. In cross-spectral iris recognition, the illumination factor between NIR and VIS images significantly degrades the recognition performance. Therefore, the existing method only achieved recognition performance with an equal error rate (EER) larger than 5%, and it is a challenging issue for cross-spectral performance to have EER below 5%. In this paper, we improve iris recognition performance by concatenating the Gradientfacesbased normalization technique (GRF) to a standard (conventional) iris recognition method to alleviate the illumination effect. In addition, we integrate the GRF with a Gabor filter, a difference of Gaussian (DoG) filter, and texture descriptors, namely a binary statistical image feature (BSIF) and a local binary pattern (LBP). The experimental results show that the GRF can boost the cross-spectral iris recognition performance with an EER equals to 1.69%. In addition, the best cross-spectral iris recognition performance is achieved when the GRF is integrated with the Gabor filter and the BSIF.","authors":["Maulisa Oktiana","Khairun Saddami","Fitri Arnia","Yuwaldi Away"],"meta":["September 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2939326"],"references":["323078873_Cross_spectral_iris_recognition_for_surveillance_based_applications","320107636_Cross-Eyed_2017_Cross-Spectral_IrisPeriocular_Recognition_Database_and_Competition","318653275_Face_Recognition_under_Varying_Lighting_Conditions_A_Combination_of_Weber-face_and_Local_Directional_Pattern_for_Feature_Extraction_and_Support_Vector_Machines_for_Classification","318412488_An_Accurate_and_Efficient_User_Authentication_Mechanism_on_Smart_Glasses_Based_on_Iris_Recognition","328419632_Improved_Cross_Spectral_Iris_Matching_Using_Gradientface_Based_Normalization","328419567_Features_for_Cross_Spectral_Image_Matching_A_Survey","328007694_Improved_Cross-Spectral_Iris_Matching_Using_Multi-Scale_Weberface_and_Gabor_Local_Binary_Pattern","327264506_Cross-Spectral_Iris_Recognition_using_CNN_and_Supervised_Discrete_Hashing","322877111_Periocular_recognition_in_cross-spectral_scenario","309814720_A_novel_framework_for_cross-spectral_iris_matching"]}