{"id":"335680061_Divergence_dating_using_mixed_effects_clock_modelling_An_application_to_HIV-1","abstract":"The need to estimate divergence times in evolutionary histories in the presence of various sources of substitution rate variation has stimulated a rich development of relaxed molecular clock models. Viral evolutionary studies frequently adopt an uncorrelated clock model as a generic relaxed molecular clock process, but this may impose considerable estimation bias if discrete rate variation exists among clades or lineages. For HIV-1 group M, rate variation among subtypes has been shown to result in inconsistencies in time to the most recent common ancestor estimation. Although this calls into question the adequacy of available molecular dating methods, no solution to this problem has been offered so far. Here, we investigate the use of mixed effects molecular clock models, which combine both fixed and random effects in the evolutionary rate, to estimate divergence times. Using simulation, we demonstrate that this model outperforms existing molecular clock models in a Bayesian framework for estimating time-measured phylogenies in the presence of mixed sources of rate variation, while also maintaining good performance in simpler scenarios. By analysing a comprehensive HIV-1 group M complete ge-nome data set we confirm considerable rate variation among subtypes that is not adequately modelled by uncorrelated relaxed clock models. The mixed effects clock model can accommodate this rate variation and results in a time to the most recent common ancestor of HIV-1 group M of 1920 (1915-25), which is only slightly earlier than the uncorrelated relaxed clock estimate for the same data set. The use of complete genome data appears to have a more profound impact than the molecular clock model because it reduces the credible intervals by 50 per cent relative to similar estimates based on short envelope gene sequences.","authors":["Magda Bletsa","Marc A Suchard","Xiang Ji","Sophie Gryseels"],"meta":["September 2019Virus Evolution 5(2)","DOI:10.1093/ve/vez036"],"references":["334154044_A_near-full-length_HIV-1_genome_from_1966_recovered_from_formalin-fixed_paraffin-embedded_tissue","328951229_Modeling_site-specific_amino-acid_preferences_deepens_phylogenetic_estimates_of_viral_sequence_divergence","326017153_Bayesian_phylogenetic_and_phylodynamic_data_integration_using_BEAST_110","326017132_The_substitution_rate_of_HIV-1_subtypes_a_genomic_approach","324919986_Posterior_Summarization_in_Bayesian_Phylogenetics_Using_Tracer_17","305175558_A_mixed_relaxed_clock_model","301252088_Exploring_the_temporal_structure_of_heterochronous_sequences_using_TempEst_formerly_Path-O-Gen","299415513_Bayesian_codon_substitution_modeling_to_identify_sources_of_pathogen_evolutionary_rate_variation","309452357_1970s_and_'Patient_0'_HIV-1_genomes_illuminate_early_HIVAIDS_history_in_North_America","280869261_Disentangling_the_impact_of_within-host_evolution_and_transmission_dynamics_on_the_tempo_of_HIV-1_evolution"]}