{"id":"335692892_CSE_E_10_An_Integrated_Automated_Theorem_Prover_for_First-Order_Logic","abstract":"First-order logic is an important part of mathematical logic, and automated theorem proving is an interdisciplinary field of mathematics and computer science. The paper presents an automated theorem prover for first-order logic, called C S E _ E 1.0, which is a combination of two provers contradiction separation extension (CSE) and E, where CSE is based on the recently-introduced multi-clause standard contradiction separation (S-CS) calculus for first-order logic and E is the well-known equational theorem prover for first-order logic based on superposition and rewriting. The motivation of the combined prover C S E _ E 1.0 is to (1) evaluate the capability, applicability and generality of C S E _ E , and (2) take advantage of novel multi-clause S-CS dynamic deduction of CSE and mature equality handling of E to solve more and harder problems. In contrast to other improvements of E, C S E _ E 1.0 optimizes E mainly from the inference mechanism aspect. The focus of the present work is given to the description of C S E _ E including its S-CS rule, heuristic strategies, and the S-CS dynamic deduction algorithm for implementation. In terms of combination, in order not to lose the capability of E and use C S E _ E to solve some hard problems which are unsolved by E, C S E _ E 1.0 schedules the running of the two provers in time. It runs plain E first, and if E does not find a proof, it runs plain CSE, then if it does not find a proof, some clauses inferred in the CSE run as lemmas are added to the original clause set and the combined clause set handed back to E for further proof search. C S E _ E 1.0 is evaluated through benchmarks, e.g., CASC-26 (2017) and CASC-J9 (2018) competition problems (FOFdivision). Experimental results show that C S E _ E 1.0 indeed enhances the performance of E to a certain extent.","authors":["Feng Cao","Yang Xu","Jun Liu","Shuwei Chen"],"meta":["September 2019Symmetry 11(9):1142","DOI:10.3390/sym11091142"],"references":["331784051_A_Hybrid_Learnt_Clause_Evaluation_Algorithm_for_SAT_Problem","323740604_Amortized_Complexity_Verified","313833898_The_TPTP_Problem_Library_and_Associated_Infrastructure_From_CNF_to_TH0_TPTP_v640","328842878_The_9th_IJCAR_Automated_Theorem_Proving_System_Competition_-_CASC-J9","327372487_Contradiction_separation_based_dynamic_multi-clause_synergized_automated_deduction","326716011_Distinctive_features_of_the_contradiction_separation_based_dynamic_automated_deduction","316530362_Parallel_Satisfiability_Solver_Based_on_Hybrid_Partitioning_Method","315785294_The_Unit_Proof_and_the_Input_Proof_in_Theorem_Proving","312988607_A_linear_format_for_resolution","309271962_The_8th_IJCAR_automated_theorem_proving_system_competition_-_CASC-J8"]}