{"id":"335624676_A_joint_deep_learning_model_to_recover_information_and_reduce_artifacts_in_missing-wedge_sinograms_for_electron_tomography_and_beyond","abstract":"We present a joint model based on deep learning that is designed to inpaint the missing-wedge sinogram of electron tomography and reduce the residual artifacts in the reconstructed tomograms. Traditional methods, such as weighted back projection (WBP) and simultaneous algebraic reconstruction technique (SART), lack the ability to recover the unacquired project information as a result of the limited tilt range; consequently, the tomograms reconstructed using these methods are distorted and contaminated with the elongation, streaking, and ghost tail artifacts. To tackle this problem, we first design a sinogram filling model based on the use of Residual-in-Residual Dense Blocks in a Generative Adversarial Network (GAN). Then, we use a U-net structured Generative Adversarial Network to reduce the residual artifacts. We build a two-step model to perform information recovery and artifacts removal in their respective suitable domain. Compared with the traditional methods, our method offers superior Peak Signal to Noise Ratio (PSNR) and the Structural Similarity Index (SSIM) to WBP and SART; even with a missing wedge of 45°, our method offers reconstructed images that closely resemble the ground truth with nearly no artifacts. In addition, our model has the advantage of not needing inputs from human operators or setting hyperparameters such as iteration steps and relaxation coefficient used in TV-based methods, which highly relies on human experience and parameter fine turning.","authors":["Guanglei Ding","Yitong Liu","Rui Zhang","Huolin L Xin"],"meta":["September 2019Scientific Reports 9(1):1-13","DOI:10.1038/s41598-019-49267-x"],"references":["329744858_Deep_Back-Projection_Networks_for_Super-Resolution","322060458_Least_Squares_Generative_Adversarial_Networks","320966887_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","330590708_ESRGAN_Enhanced_Super-Resolution_Generative_Adversarial_Networks_Munich_Germany_September_8-14_2018_Proceedings_Part_V","329744327_Residual_Dense_Network_for_Image_Super-Resolution","329740316_The_Perception-Distortion_Tradeoff","328161324_Group_Normalization_15th_European_Conference_Munich_Germany_September_8-14_2018_Proceedings_Part_XIII","327431010_Enhancement_of_underwater_images_by_super-resolution_generative_adversarial_networks","320968363_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","320790488_Improved_Simultaneous_Algebraic_Reconstruction_Technique_Algorithm_for_Positron-Emission_Tomography_Image_Reconstruction_via_Minimizing_the_Fast_Total_Variation"]}