{"id":"335618741_The_role_of_self-regulated_learning_Strategies_on_learners'_satisfaction_in_Massive_Open_Online_Course_MOOC_Evidence_from_Malaysia_MOOC","abstract":"Learning in Massive Open Online Courses (MOOCs) necessitates learners to be capable of self-regulating their learning in order to oversee and adapt their behaviour and actions in certain learning settings. Studies have highlighted that learners who have good control of self-regulation in their learning, either formal or informal learning contexts, utilise more competent learning strategies in online learning context. Nevertheless, MOOCs attract a diverse range of learners, each with different experience and satisfaction. The aim of this study is to examine the role of self-regulated learning (SRL) and its components (time management, planning, self-evaluation, and help-seeking) on learners' satisfaction in MOOC. Data were collected from 281 learners of a Malaysia MOOC namely Asas Keusahawanan (Introduction to Entrepreneurship), in the second semester of the Malaysian universities academic calendar. A cross-sectional web-based survey was applied and a Partial Least Square (PLS) approach was use for analysing data. Findings indicated that all of SRL components except help-seeking are important factors for explaining learners' satisfaction in a MOOC. This study provides useful suggestions for the course designers of MOOCs platforms, and the facilitators in engaging learners with suitable SRL strategies and increase the level of course satisfaction.","authors":["Mohd Muslim Md Zalli","Hasniza Nordin","ROSNA AWANG-HASHIM"],"meta":["August 2019","DOI:10.35940/ijitee.J1138.0881019","Project: Community of inquiry and self-regulated learning in Massive Open Online Courses (MOOCs)"],"references":["332727013_An_empirical_investigation_of_the_antecedents_of_learner-centered_outcome_measures_in_MOOCs","313137896_The_partial_least_squares_approach_to_causal_modeling_Personal_computer_adoption_and_use_as_an_illustration","276140771_Motivation_as_a_Lens_to_Understand_Online_Learners_Toward_Data-Driven_Design_with_the_OLEI_Scale","269775839_Towards_Understanding_How_to_Assess_Help-Seeking_Behavior_Across_Cultures","262641471_Students'_and_Instructors'_Use_of_Massive_Open_Online_Courses_MOOCs_Motivations_and_Challenges","331393274_An_Overview_of_Massive_Open_Online_Courses_MOOCs_Pedagogies_and_Distance_Education","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","308957955_Self-regulated_learning_strategies_predict_learner_behavior_and_goal_attainment_in_Massive_Open_Online_Courses_In_press","280751547_Attaining_self-regulation_A_social_cognitive_perspective","255567095_Supporting_Self-Regulation_in_Student-Centered_Web-Based_Learning_Environments"]}