{"id":"335605745_Learning_to_Rank_Food_Images","abstract":"In the last decade food understanding has become a very attractive topic. This has implied the growing demand of Computer Vision algorithms for automatic diet assessment to treat or prevent food related diseases. However, the intrinsic variability of food, makes the research in this field incredibly challenging. Although many papers about classification or recognition of food images have been published in recent years, the literature lacks of works which address volume and calories estimation problem. Since an ideal food understanding engine should be able to provide information about nutritional values, the knowledge of the volume is essential. Differently from the state-of-art works, in this paper we address the problem of volume estimation through Learning to Rank algorithms. Our idea is to work with a predefined set of possible portion size and exploit a ranking approach based on Support Vector Machine (SVM) to sort food images according to the volume. At the best of our knowledge, this is the first work where food volume analysis is treated as a raking problem. To validate the proposed methodology we introduce a new dataset of 99 food images related to 11 food plates. Each food image belongs to one over three possible portion size (i.e., small, medium, large). Then, we provide a baseline experiment to assess the problem of learning to rank food images by using three different image descriptors based on Bag of Visual Words, GoogleNet and MobileNet. Experimental results, confirm that the exploited paradigm obtain good performances and that a ranking function for food volume analysis can be successfully learnt.","authors":["Dario Allegra","Daniela Erba","Giovanni Maria Farinella","Giovanni Grazioso"],"meta":["September 2019","DOI:10.1007/978-3-030-30645-8_57","Conference: International Conference on Image Analysis and ProcessingAt: Trento"],"references":["322149430_Understanding_Food_Images_to_Recommend_Utensils_During_Meals","316184205_MobileNets_Efficient_Convolutional_Neural_Networks_for_Mobile_Vision_Applications","311864828_Two-View_3D_Reconstruction_for_Food_Volume_Estimation","305196650_Going_deeper_with_convolutions","326334030_A_multi-task_learning_approach_for_meal_assessment","322149441_A_Multimedia_Database_for_Automatic_Meal_Assessment_Systems","306281834_Rethinking_the_Inception_Architecture_for_Computer_Vision","305649675_FoodForCare_An_Android_application_for_self-care_with_healthy_food","305381927_Retrieval_and_Classification_of_Food_Images","302980368_Carbohydrate_Estimation_by_a_Mobile_Phone-Based_System_Versus_Self-Estimations_of_Individuals_With_Type_1_Diabetes_Mellitus_A_Comparative_Study"]}