{"id":"335665860_System_Remaining_Useful_Life_Maximization_through_Mission_Profile_Optimization","abstract":"In the last two decades, prediction of the remaining useful life (RUL) of critical components and more recently of systems (SRUL) received an increasing attention. Indeed, this prediction allows scheduling predictive maintenance actions in order to avoid damages caused by unexpected failures. A major part of the studies related to failure prognostics reported in the literature considers the mission profile as a static parameter when evaluating RUL/SRUL. However in practice, operating parameters can be adjusted according to the system health state for extending the SRUL while satisfying the performance requirements. Therefore, this paper addresses the issue of adjusting the mission profile of a multicompo-nent system in order to maximize its SRUL. To do this, a variant of the inoperability input-output model is used to represent the system degradation and take into account the interactions between its components. Then, the mission profile parameters (load levels and durations) are optimized using a genetic algorithm-based method to maximize the SRUL. The proposed method is finally applied to a mechatronic system to demonstrate its effectiveness.","authors":["Ferhat Tamssaouet","Nguyen Khanh","Kamal Medjaher"],"meta":["July 2019","Conference: PHM Asia Pacific 2019At: Beijing","Project: System Oriented Fault Prognostics"],"references":["330789156_A_Post-Prognostic_Decision_Approach_for_Production_and_Maintenance_Planning","328042864_System-level_Prognostics_Based_on_Inoperability_Input-output_Model","321747601_Prognostics_and_Health_Management_for_Maintenance_Practitioners-Review_Implementation_and_Tools_Evaluation","259930184_A_Distributed_Approach_to_System-Level_Prognostics","257337653_Hybrid_prognostic_method_applied_to_mechatronic_systems","315773020_Prognostics_The_Science_of_Making_Predictions","285856879_An_efficient_constraint_handling_method_for_genetic_algorithms","264811984_A_Comparative_Review_of_Approaches_to_Prevent_Premature_Convergence_in_GA","257343266_Quantitative_Input-Output_Relations_in_the_Economic_System_of_the_United_States","8070070_Modeling_the_Demand_Reduction_Input-Output_I-O_Inoperability_Due_to_Terrorism_of_Interconnected_Infrastructures"]}