{"id":"335667468_Different_linear_and_nonlinear_scaling_in_UK_Biobank_brain_images_vs_machine-learning_datasets","abstract":"In recent years, deep learning has unlocked unprecedented success in various domains, especially in image, text, and speech processing. These breakthroughs may hold promise for neuroscience and especially for brain-imaging investigators who start to analyze thousands of participants. However, deep learning is only beneficial if the data have nonlinear relationships and if they are exploitable at currently available sample sizes. We systematically profiled the performance of deep models, kernel models, and linear models as a function of sample size on UK Biobank brain images against established machine learning references. On MNIST and Zalando Fashion, prediction accuracy consistently improved when escalating from linear models to shallow-nonlinear models, and further improved when switching to deep-nonlinear models. The more observations were available for model training, the greater the performance gain we saw. In contrast, using structural or functional brain scans, simple linear models performed on par with more complex, highly parameterized models in age/sex prediction across increasing sample sizes. In fact, linear models kept improving as the sample size approached ~10,000 participants. Our results indicate that the increase in performance of linear models with additional data does not saturate at the limit of current feasibility. Yet, nonlinearities of common brain scans remain largely inaccessible to both kernel and deep learning methods at any examined scale.","authors":["Marc-Andre Schulz","B.T. Thomas Yeo","Joshua T. Vogelstein","Janaina Mourao-Miranada"],"meta":["August 2020","DOI:10.1101/757054"],"references":["338506275_Bag_of_Tricks_for_Image_Classification_with_Convolutional_Neural_Networks","333587175_Deep_learning_can_predict_microsatellite_instability_directly_from_histology_in_gastrointestinal_cancer","323355664_Learning_to_Explain_An_Information-Theoretic_Perspective_on_Model_Interpretation","323184305_Fully_Convolutional_Network_Ensembles_for_White_Matter_Hyperintensities_Segmentation_in_MR_Images","336396413_ABCD_Neurocognitive_Prediction_Challenge_2019_Predicting_Individual_Fluid_Intelligence_Scores_from_Structural_MRI_Using_Probabilistic_Segmentation_and_Kernel_Ridge_Regression","333917196_Towards_Algorithmic_Analytics_for_Large-scale_Datasets","331114433_Exploration_Inference_and_Prediction_in_Neuroscience_and_Biomedicine","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond","324077979_A_Data-Driven_Statistical_Model_for_Predicting_the_Critical_Temperature_of_a_Superconductor","322429244_General_crystallized_and_fluid_intelligence_are_not_associated_with_functional_global_network_efficiency_A_replication_study_with_the_human_connectome_project_1200_data_set"]}