{"id":"335699105_Policy_Matters_Expert_Recommendations_for_Learning_Analytics_Policy","abstract":"Interest in learning analytics (LA) has grown rapidly among higher education institutions (HEIs). However, the maturity levels of HEIs in terms of being ‘student data-informed’ are only at early stages. There often are barriers that prevent data from being used systematically and effectively. To assist higher education institutions to become more mature users and custodians of digital data collected from students during their online learning activities, the SHEILA framework, a policy development framework that supports systematic, sustainable and responsible adoption of LA at an institutional level, was recently built. This paper presents a mix-method study using a group concept mapping (GCM) approach that was conducted with LA experts to explore essential features of LA policy in HEI in contribution the development of the framework. The study identified six clusters of features that an LA policy should include, provided ratings based on ease of implementation and importance for each of the six themes, and offered suggestions to HEIs how they can proceed with the development of LA policies.","authors":["Maren Scheffel","Yi-Shan Tsai","Dragan Gasevic","Hendrik Drachsler"],"meta":["September 2019","DOI:10.1007/978-3-030-29736-7_38","In book: Transforming Learning with Meaningful Technologies (pp.510-524)"],"references":["337537083_Empowering_learners_with_personalised_learning_approaches_Agency_equity_and_transparency_in_the_context_of_learning_analytics","333740986_How_do_we_start_An_approach_to_learning_analytics_adoption_in_higher_education","331353515_Application_of_Learning_Analytics_in_Higher_Educational_Institutions","331337708_Counting_Clicks_is_Not_Enough_Validating_a_Theorized_Model_of_Engagement_in_Learning_Analytics","331333276_Increasing_the_Impact_of_Learning_Analytics","329569759_The_SHEILA_Framework_Informing_Institutional_Strategies_and_Policy_Processes_of_Learning_Analytics","326604607_The_Current_Landscape_of_Learning_Analytics_in_Higher_Education","323861276_Embracing_imperfection_in_learning_analytics","323592047_License_to_evaluate_preparing_learning_analytics_dashboards_for_educational_practice","323561311_Co-creation_strategies_for_learning_analytics"]}