{"id":"335625454_Effects_of_Edmodo-Assisted_Process_Writing_with_the_Problematized_Scaffolding_on_the_Quality_of_Students'_Writing","abstract":"This research explored the effects of Edmodo-assisted process writing with the problematized scaffolding on the quality of students’ writing. Quasi-Experimental research with one-group pre-posttest was utilized as the research design. The subjects of this research were the second-semester students of the English Department at the Islamic University of Darul ‘Ulum, Lamongan. There were 13 students in the class, and all of them took part in this research. In every seven meetings, they were receiving writing instruction using traditional and Edmodo-assisted process writing with problematized scaffolding respectively. To collect the data, pre-and-posttest were conducted to both class conditions. An interview was also done in the experimental class to capture the students’ perception after the implementation of Edmodo. Dependent and independent t-tests were utilized to analyze the data collected. The interview was analyzed qualitatively to support the findings. Results of the analysis indicate that the use of Edmodo-assisted process writing with problematized scaffolding significantly improves the students’ writing skills and that the students’ score improvement is significantly higher than in the traditional class. Therefore, the usage of this media is highly recommended.","authors":["Wahyu Kyestiati Sumarno"],"meta":["February 2019Lingua Cultura 13(1):31","DOI:10.21512/lc.v13i1.5028"],"references":["346988904_A_Study_on_the_Metacognitive_Awareness_of_Secondary_School_Students","334989133_THE_EFFECTS_OF_A_SOCIAL_LEARNING_NETWORK_ON_STUDENTS'_PERFORMANCES_AND_ATTITUDES","322738376_Promoting_Students_'_Paragraph_Writing_Using_EDMODO_An_Action_Research","322298449_Improving_Process_Writing_with_the_Use_Authentic_Assessment","322231501_Research_trends_in_EFL_writing_in_Indonesia_where_art_thou","321146086_Digital_self-review_and_anonymous_peer_feedback_in_Turkish_high_school_EFL_writing","320536165_Rethinking_Conventional_Teaching_In_Language_Learning_And_Proposing_Edmodo_As_Intervention_A_Qualitative_Analysis","321621317_New_Paradigm_for_Re-engineering_Education_Globalization_Localization_and_Individualization","316490784_Agents_of_integration_Understanding_transfer_as_a_rhetorical_act","314267616_Content_Area_Teacher_Candidates'_Self-Efficacy_Beliefs_of_Teaching_Writing_Online"]}