{"id":"335630926_Design_model_for_the_cost_calculation_of_product-service_systems_in_single_and_small_series_production","abstract":"Due to increasingly specific customer requirements, complex value-added processes and services characterize the single and small series production. A low degree of automation and insufficient knowledge management complicate the efficient accomplishment of projects, especially for the transparent calculation of new offers and change requests. The dissemination of product-service systems causes the additional challenge of calculating intangible services accurately. Innovative information and communication technologies (ICT) offer new potential for effective and efficient design of the calculation process. The availability of data along the entire product lifecycle, especially during the design phase, increases the transparency and allows the identification of interdependencies as well as prognosis possibilities. However, current calculation models only insufficiently consider the use of ICT. The solution presented in this paper considers the development of a design model for the holistic calculation of product-service systems in single and small series production that integrates and processes all cost-relevant data, both internally and externally. In order to filter important information, it includes the usage of suitable data analysis and enables a continuous learning process as well as sustainable knowledge management along the entire calculation process.","authors":["Günther Schuh","Christoph Kelzenberg","Jan Wiese"],"meta":["January 2019Procedia CIRP 84:296-301","DOI:10.1016/j.procir.2019.04.216"],"references":["304158186_The_Impact_of_Industry_40_on_Procurement_and_Supply_Management_A_Conceptual_and_Qualitative_Analysis","270981447_Improving_Data_Integrity_in_Production_Control","235314987_A_pragmatic_approach_to_product_costing_based_on_standard_time_estimation","226514469_Prozessorientierte_Planung_und_Kalkulation_kern-produktbegleitender_Dienstleistungen","297624139_Supplier_relationship_management_capability_A_qualification_and_extension","285493046_Approach_for_Reducing_Data_Inconsistencies_in_Production_Control","247915853_The_integration_of_manufacturing_and_cost_information_into_the_engineering_design_process","226969206_Smart_Factory_-_A_Step_towards_the_Next_Generation_of_Manufacturing","225823978_Cost_estimation_system_of_dies_manufacturing_based_on_the_complex_machining_features","225774166_Cost_Estimation_During_Design_Step_Parametric_Method_versus_Case_Based_Reasoning_Method"]}