{"id":"335750430_BioBERT_a_pre-trained_biomedical_language_representation_model_for_biomedical_text_mining","abstract":"Motivation: \nBiomedical text mining is becoming increasingly important as the number of biomedical documents rapidly grows. With the progress in natural language processing, extracting valuable information from biomedical literature has gained popularity among researchers, and deep learning has boosted the development of effective biomedical text mining models. However, directly applying the advancements in natural language processing to biomedical text mining often yields unsatisfactory results due to a word distribution shift from general domain corpora to biomedical corpora. In this paper, we investigate how the recently introduced pre-trained language model BERT can be adapted for biomedical corpora.\n\nResults: \nWe introduce BioBERT (Bidirectional Encoder Representations from Transformers for Biomedical Text Mining), which is a domain specific language representation model pre-trained on large-scale biomedical corpora. With almost the same architecture across tasks, BioBERT largely outperforms BERT and previous state-of-the-art models in a variety of biomedical text mining tasks when pre-trained on biomedical corpora. While BERT obtains performance comparable to that of previous state-of-the-art models, BioBERT significantly outperforms them on the following three representative biomedical text mining tasks: biomedical named entity recognition (0.62% F1 score improvement), biomedical relation extraction (2.80% F1 score improvement), and biomedical question answering (12.24% MRR improvement). Our analysis results show that pre-training BERT on biomedical corpora helps it to understand complex biomedical texts.\n\nAvailability and implementation: \nWe make the pre-trained weights of BioBERT freely available at https://github.com/naver/biobert-pretrained, and the source code for fine-tuning BioBERT available at https://github.com/dmis-lab/biobert.\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Jinhyuk Lee","Wonjin Yoon","Sungdong Kim","Donghyeon Kim"],"meta":["September 2019Bioinformatics 36(4)","DOI:10.1093/bioinformatics/btz682"],"references":["334601545_A_Silver_Standard_Corpus_of_Human_Phenotype-Gene_Relations","333449602_CollaboNet_collaboration_of_deep_neural_networks_for_biomedical_named_entity_recognition","326638690_Automatic_extraction_of_gene-disease_associations_from_literature_using_joint_ensemble_learning","326157925_Chemical-gene_relation_extraction_using_recursive_neural_network","325604701_Transfer_learning_for_biomedical_named_entity_recognition_with_neural_networks","323664116_Deep_learning_with_word_embeddings_improves_biomedical_named_entity_recognition","334601558_Publicly_Available_Clinical","332261569_Document-level_attention-based_BiLSTM-CRF_incorporating_disease_dictionary_for_disease_named_entity_recognition","325445489_Deep_Contextualized_Word_Representations","322819033_Cross-type_Biomedical_Named_Entity_Recognition_with_Deep_Multi-Task_Learning"]}