{"id":"335776378_A_survey_of_remote_sensing_image_classification_based_on_CNNs","abstract":"With the development of earth observation technologies, the acquired remote sensing images are increasing dramatically, and a new era of big data in remote sensing is coming. How to effectively mine these massive volumes of remote sensing data are new challenges. Deep learning provides a new approach for analyzing these remote sensing data. As one of the deep learning models, convolutional neural networks (CNNs) can directly extract features from massive amounts of imagery data and is good at exploiting semantic features of imagery data. CNNs have achieved remarkable success in computer vision. In recent years, quite a few researchers have studied remote sensing image classification using CNNs, and CNNs can be applied to realize rapid, economical and accurate analysis and feature extraction from remote sensing data. This paper aims to provide a survey of the current state-of-the-art application of CNN-based deep learning in remote sensing image classification. We first briefly introduce the principles and characteristics of CNNs. We then survey developments and structural improvements on CNN models that make CNNs more suitable for remote sensing image classification, available datasets for remote sensing image classification, and data augmentation techniques. Then, three typical CNN application cases in remote sensing image classification: scene classification, object detection and object segmentation are presented. We also discuss the problems and challenges of CNN-based remote sensing image classification, and propose corresponding measures and suggestions. We hope that the survey can facilitate the advancement of remote sensing image classification research and help remote-sensing scientists to tackle classification tasks with the state-of-art deep learning algorithms and techniques.","authors":["Jia Song","Shaohua Gao","Yunqiang Zhu","Chenyan Ma"],"meta":["September 2019Big Earth Data 3(2):1-23","DOI:10.1080/20964471.2019.1657720"],"references":["325062382_Improving_Remote_Sensing_Scene_Classification_by_Integrating_Global-Context_and_Local-Object_Features","324924412_A_Deep-Local-Global_Feature_Fusion_Framework_for_High_Spatial_Resolution_Imagery_Scene_Classification","323714841_Scene_Classification_Based_on_a_Deep_Random-Scale_Stretched_Convolutional_Neural_Network","323595880_Automatic_Building_Segmentation_of_Aerial_Imagery_Using_Multi-Constraint_Fully_Convolutional_Networks","322639684_Building_Extraction_in_Very_High_Resolution_Remote_Sensing_Imagery_Using_Deep_Learning_and_Guided_Filters","326851666_Ship_classification_for_unbalanced_SAR_dataset_based_on_convolutional_neural_network","322278874_Deep_Learning_in_Remote_Sensing_A_Comprehensive_Review_and_List_of_Resources","322053775_Hollow_Village_Building_Detection_Method_Using_High_Resolution_Remote_Sensing_Image_Based_on_CNN","321873130_Simultaneous_extraction_of_roads_and_buildings_in_remote_sensing_imagery_with_convolutional_neural_networks","320949722_Ship_object_detection_in_remote_sensing_images_using_convolutional_neural_networks"]}