{"id":"335787889_Modeling_Languages_in_Industry_40_An_Extended_Systematic_Mapping_Study","abstract":"Industry 4.0 integrates cyber-physical systems with the Internet of Things to optimize the complete value-added chain. Successfully applying Industry 4.0 requires the cooperation of various stakeholders from different domains. Domain-specific modeling languages promise to facilitate their involvement through leveraging (domain-specific) models to primary development artifacts. We aim to assess the use of modeling in Industry 4.0 through the lens of modeling languages in a broad sense. Based on an extensive literature review, we updated our systematic mapping study on modeling languages and modeling techniques used in Industry 4.0 (Wortmann et al., Conference on model-driven engineering languages and systems (MODELS’17), IEEE, pp 281–291, 2017) to include publications until February 2018. Overall, the updated study considers 3344 candidate publications that were systematically investigated until 408 relevant publications were identified. Based on these, we developed an updated map of the research landscape on modeling languages and techniques for Industry 4.0. Research on modeling languages in Industry 4.0 focuses on contributing methods to solve the challenges of digital representation and integration. To this end, languages from systems engineering and knowledge representation are applied most often but rarely combined. There also is a gap between the communities researching and applying modeling languages for Industry 4.0 that originates from different perspectives on modeling and related standards. From the vantage point of modeling, Industry 4.0 is the combination of systems engineering, with cyber-physical systems, and knowledge engineering. Research currently is splintered along topics and communities and accelerating progress demands for multi-disciplinary, integrated research efforts.","authors":["Andreas Wortmann","Olivier Barais","Benoit Combemale","Manuel Wimmer"],"meta":["January 2020Software and Systems Modeling 19(4)","DOI:10.1007/s10270-019-00757-6"],"references":["321849825_A_review_on_Utilizing_Ontological_Approaches_in_Integrating_Assembly_Design_and_Assembly_Process_Planning_APP","321219202_A_Framework_for_Automatic_Knowledge-Based_Fault_Detection_in_Industrial_Conveyor_Systems","321197205_OptiqueVQS_a_Visual_Query_System_over_Ontologies_for_Industry","336585490_The_value_of_mapping_studies_-_A_participant-observer_case_study","336573400_Systematic_Mapping_Studies_in_Software_Engineering","333437404_ICT_for_Advanced_Manufacturing","333296792_Service-oriented_robotics_manufacturing_by_reasoning_about_the_scene_graph_of_a_robotics_cell","326265827_Modeling_of_System_Knowledge_for_Efficient_Agile_Manufacturing_Tool_evaluation_selection_and_implementation_scenario_in_SMEs","322563194_A_proposal_of_unified_reference_model_for_smart_manufacturing","321983318_Interchange_format_for_the_generation_of_functional_elements_for_industrie_40_components"]}