{"id":"335796650_Large-scale_mammalian_genome_rearrangements_coincide_with_chromatin_interactions","abstract":"Motivation: \nGenome rearrangements drastically change gene order along great stretches of a chromosome. There has been initial evidence that these apparently non-local events in the 1D sense may have breakpoints that are close in the 3D sense. We harness the power of the Double Cut and Join model of genome rearrangement, along with Hi-C chromosome conformation capture data to test this hypothesis between human and mouse.\n\nResults: \nWe devise novel statistical tests that show that indeed, rearrangement scenarios that transform the human into the mouse gene order are enriched for pairs of breakpoints that have frequent chromosome interactions. This is observed for both intra-chromosomal breakpoint pairs, as well as for inter-chromosomal pairs. For intra-chromosomal rearrangements, the enrichment exists from close (<20 Mb) to very distant (100 Mb) pairs. Further, the pattern exists across multiple cell lines in Hi-C data produced by different laboratories and at different stages of the cell cycle. We show that similarities in the contact frequencies between these many experiments contribute to the enrichment. We conclude that either (i) rearrangements usually involve breakpoints that are spatially close or (ii) there is selection against rearrangements that act on spatially distant breakpoints.\n\nAvailability and implementation: \nOur pipeline is freely available at https://bitbucket.org/thekswenson/locality.\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Krister M Swenson","Mathieu Blanchette"],"meta":["July 2019Bioinformatics 35(14):i117-i126","DOI:10.1093/bioinformatics/btz343"],"references":["330499002_Chromatin_features_constrain_structural_variation_across_evolutionary_timescales","325839083_Epigenetic_maintenance_of_topological_domains_in_the_highly_rearranged_gibbon_genome","324951902_Finding_local_genome_rearrangements","321094988_Multi-platform_discovery_of_haplotype-resolved_structural_variation_in_human_genomes","319704283_Rearrangement_Scenarios_Guided_by_Chromatin_Structure","303295077_Models_and_algorithms_for_genome_rearrangement_with_positional_constraints","325636813_High-resolution_comparative_analysis_of_great_ape_genomes","325246620_Inversion_variants_in_human_and_primate_genomes","324725755_Structural_variation_in_the_3D_genome","284696558_Initial_sequence_of_the_chimpanzee_genome_and_comparison_with_the_human_genome"]}