{"id":"335763887_Technology_trends_Education_40_and_beyond","abstract":"The real-time communication and collaboration of the internet of things, the internet of services and cyber-physical systems with each other and with people has started a new era in industrial production. This era called Industry 4.0, brought about revolutionary changes in many areas of life, including education. In order to fully exploit the potential of smart products, services and business opportunities that are expected to be widely used in all sectors in the near future, education systems need to be overhauled to meet the qualified manpower required by this dynamic process. The ability of companies and institutions with strong information and technology infrastructure to reflect advanced digital technologies to innovation and production processes requires some certain skills, described as 21st century skills. Education 4.0, a reflection of the era of Industry 4.0, refers to a period in which education paradigms, approaches and technologies have been changed. In this study, major technology trends and their reflections on learning and teaching processes are examined within the framework of changing educational paradigms and teaching approaches. Keywords: Education 4.0, Industry 4.0, ICT in education, technology trends","authors":["Hafize Keser","Ali Semerci"],"meta":["August 2019Contemporary Educational Researches Journal 9(3):39-49","DOI:10.18844/cerj.v9i3.4269","Projects: EC3 projectARTIFICIAL-INTELLIGENCE-AI-GLOBAL-PORTALEXPLORE THE BEST AND OFFER ITALL RESEARCHERS WELCOME GLOBAL PLATFORM"],"references":["333139463_Japan's_Society_50_Going_Beyond_Industry_40","332434278_Feedback_In_The_Educational_Process_Experience_Of_Using_Byod-Technology","328510447_Students'_views_on_the_use_of_tablet_computers_in_education","327922991_Malaysian_higher_education_system_towards_industry_40_-_Current_trends_overview","327355553_Egitimde_Yeni_Yonelimlerin_Degerlendirilmesi_ve_Egitim_40","326789584_BYOD_in_Higher_Education_A_Case_Study_of_Kuwait_University","325533447_Industry_40_Unleashing_Its_Future_Smart_Services","323975180_Dynamic_e-learning_modules_for_student_lecture_preparation","333323830_Robot-Proof_Higher_Education_in_the_age_of_artificial_intelligence","327545117_Learning_platforms_-_how_to_make_the_right_choice"]}