{"id":"335727632_Combining_convolutional_neural_networks_and_slantlet_transform_for_an_effective_image_retrieval_scheme","abstract":"In the latest years there has been a profound evolution in computer science and technology, which incorporated several fields. Under this evolution, Content Base Image Retrieval (CBIR) is among the image processing field. There are several image retrieval methods that can easily extract feature as a result of the image retrieval methods’ progresses. To the researchers, finding resourceful image retrieval devices has therefore become an extensive area of concern. Image retrieval technique refers to a system used to search and retrieve images from digital images’ huge database. In this paper, the author focuses on recommendation of a fresh method for retrieving image. For multi presentation of image in Convolutional Neural Network (CNN), Convolutional Neural Network - Slanlet Transform (CNN-SLT) model uses Slanlet Transform (SLT). The CBIR system was therefore inspected and the outcomes benchmarked. The results clearly illustrate that generally, the recommended technique outdid the rest with accuracy of 89 percent out of the three datasets that were applied in our experiments. This remarkable performance clearly illustrated that the CNN-SLT method worked well for all three datasets, where the previous phase (CNN) and the successive phase (CNN-SLT) harmoniously worked together.","authors":["Mohammed S. H. Al-Tamimi"],"meta":["October 2019International Journal of Electrical and Computer Engineering 9(5):4382-4395","DOI:10.11591/ijece.v9i5"],"references":["314093717_On_the_Origin_of_Deep_Learning","308814741_Learning_structure_in_gene_expression_data_using_deep_architectures_with_an_application_to_gene_clustering","308321518_Select-Additive_Learning_Improving_Cross-individual_Generalization_in_Multimodal_Sentiment_Analysis","305746294_Deep_learning_for_computational_biology","281312423_A_Neural_Algorithm_of_Artistic_Style","277411157_Deep_Learning","317021035_Deep_Learning_for_Biological_Image_Classification","313237891_Localization_of_the_Slab_Information_in_Factory_Scenes_using_Deep_Convolutional_Neural_Networks","312656299_Image_classification_using_random_forests_and_ferns","277460483_Image_retrieval","260637547_Slantlet_transform","249886315_A_Wavelet-based_Image_Retrieval_System","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","246273032_Fundamentals_of_Content-Based_Image_Retrieval","233981807_ADADELTA_An_adaptive_learning_rate_method"]}