{"id":"335769565_Consensus_Multiple_Kernel_K-Means_Clustering_With_Late_Fusion_Alignment_and_Matrix-Induced_Regularization","abstract":"Multiple kernel clustering (MKC) attracts considerable attention due to its competitive performance in unsupervised learning. However, we observe that most of the existing MKC approaches do not sufficiently consider the correlation between different clustering partitions. As a result, the existing methods would cause redundant and low diversity of selected clustering partitions which deteriorate clustering performance. To address these issues, we propose an effective and efficient multiple kernel k-means clustering method termed Consensus Multiple Kernel Clustering with Late Fusion Alignment and Matrix-Induced Regularization (CMKC-LFA-MR). Specifically, the correlations between different clustering partitions are calculated as a matrix-induced regularization to encourage the diversity of clustering results. Moreover, we propose to maximally align the consensus partition with the weighted base partitions. The proposed algorithm jointly optimizes the basic clustering partitions and the optimal consensus clustering result. To solve the resultant optimization problem, a three-step alternate algorithm is proposed with both theoretically and experimentally proved convergence. As demonstrated by the experiments on six benchmark datasets, our algorithm outperforms the existing state-of-the-art multi-kernel methods in clustering performance with less time complexity, which demonstrates the effectiveness and efficiency of our proposed algorithm.","authors":["Jingtao Hu","Miaomiao Li","En Zhu","Siwei Wang"],"meta":["September 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2940896"],"references":["335546437_Efficient_and_Effective_Incomplete_Multi-View_Clustering","335079361_Robust_multiple_kernel_k-means_using_l21-norm","335079285_Recovery_of_corrupted_multiple_kernels_for_clustering","332718203_Projected_Stochastic_Primal-Dual_Method_for_Constrained_Online_Learning_With_Kernels","331720122_Unsupervised_Robust_Multiple_Kernel_Learning_via_Extracting_Local_and_Global_Noises","331699894_Efficient_Multiple_Kernel_K-means_Clustering_With_Late_Fusion","331103913_An_Oil_Painters_Recognition_Method_Based_on_Cluster_Multiple_Kernel_Learning_Algorithm","329392825_Multiple_Kernel_Clustering_With_Global_and_Local_Structure_Alignment","328850116_An_Affinity_Propagation_Clustering_Method_Using_Hybrid_Kernel_Function_with_LLE","330333649_Partial_Multi-View_Clustering_Based_on_Sparse_Embedding_Framework"]}