{"id":"335797598_Practically_Feasible_Robust_Quantum_Money_with_Classical_Verification","abstract":"We introduce a private quantum money scheme with the note verification procedure based on sampling matching, a problem in a one-way communication complexity model. Our scheme involves a bank who produces and distributes quantum notes, noteholders who are untrusted, and trusted local verifiers of the bank to whom the holders send their notes in order to carry out transactions. The key aspects of our money scheme include: note verification procedure requiring a single round classical interaction between the local verifier and bank; fixed verification circuit that uses only passive linear optical components; re-usability of each note in our scheme which grows linearly with the size of note; and an unconditional security against any adversary trying to forge the banknote while tolerating the noise of up to 21.4%. We further describe a practical implementation technique of our money scheme using weak coherent states of light and the verification circuit involving a single 50/50 beam splitter and two single-photon threshold detectors. Previous best-known matching based money scheme proposal involves a verification circuit where the number of optical components increase proportional to the increase in desired noise tolerance (robustness). In contrast, we achieve any desired noise tolerance (up to a maximal threshold value) with only a fixed number of optical components. This considerable reduction of components in our scheme enables us to reach the robustness values that is not feasible for any existing money scheme with the current technology.","authors":["Niraj Kumar"],"meta":["September 2019Cryptography 3(4)","DOI:10.3390/cryptography3040026"],"references":["335766671_Experimental_demonstration_of_quantum_advantage_for_one-way_communication_complexity_surpassing_best-known_classical_protocol","320920177_Quantum_superiority_for_verifying_NP-complete_problems_with_linear_optics","319900927_Experimental_preparation_and_verification_of_quantum_money","316662094_Experimental_investigation_of_practical_unforgeable_quantum_money","308720618_Quantum_Tokens_for_Digital_Signatures","336707466_Semi-Quantum_Money","336402048_On_the_foundations_of_cryptography","314829083_Secure_multi-party_quantum_computation","309317435_Quantum_money_with_nearly_optimal_error_tolerance","307518577_An_adaptive_attack_on_Wiesner's_quantum_money"]}