{"id":"335705999_Risk_Factors_and_Diagnosis_of_Diabetic_Foot_Ulceration_in_Users_of_the_Brazilian_Public_Health_System","abstract":"Background: \nAn individual with diabetes mellitus (DM) has an approximately 25% risk of developing ulcerations and/or destruction of the feet's soft tissues. These wounds represent approximately 20% of all causes of hospitalizations due to DM.\n\nObjective: \nTo identify the factors for the development of diabetic foot ulceration (DFU) among individuals treated by the Brazilian public health system.\n\nMethods: \nThis cross-sectional study was conducted on individuals with diabetes mellitus, aged above 18 years, of both sexes, and during July-October 2018 within a public healthcare unit in Brazil. All participants were assessed based on their socioeconomic, behavioral, and clinical characteristics, along with vascular and neurological evaluations. All participants were also classified according to the classification of risk of developing DFU, in accordance with the International Working Group on the Diabetic Foot (IWGDF). Statistical analyses were conducted using the chi-squared test, chi-squared test for trend, and Fisher's exact test, with a significance level of 5% (p < 0.05).\n\nResults: \nThe study consisted of 85 individuals. The DFU condition was prevalent in 10.6% of the participants. Adopting the classification proposed by IWGDF, observed risks for stratification categories 0, 1, 2, and 3 were 28.2%, 29.4%, 23.5%, and 8.2%, respectively. A statistically significant (p < 0.05) association was observed between the development of DFU and the following variables: time since the diagnosis of diabetes and the appearance of the nails, humidity, and deformations on the feet.\n\nConclusion: \nThe present study found an elevated predominance of DM patients in the Brazilian public health system (SUS) featuring cutaneous alterations that may lead to ulcers; these individuals had elevated risks of developing DFU. Furthermore, it was revealed that the feet of patients were not physically examined during treatment.","authors":["Hígor Chagas Cardoso","Ana Laura de Sene Amâncio Zara","Suélia Siqueira Rodrigues Fleury Rosa","Gabriel Alves Rocha"],"meta":["September 2019Journal of Diabetes Research 2019(5):1-7","DOI:10.1155/2019/5319892"],"references":["323332234_The_prevalence_and_risk_factors_of_peripheral_neuropathy_among_patients_with_type_2_diabetes_mellitus_The_case_of_Jordan","322516508_Diabetic_Foot_Australia_guideline_on_footwear_for_people_with_diabetes","322326028_Annual_Direct_Medical_Costs_of_Diabetic_Foot_Disease_in_Brazil_A_Cost_of_Illness_Study","318997671_Avaliacao_do_conhecimento_de_pacientes_diabeticos_sobre_medidas_preventivas_do_pe_diabetico_em_Maringa_PR","298792826_Baseline_characteristics_and_risk_factors_for_ulcer_amputation_and_severe_neuropathy_in_diabetic_foot_at_risk_The_BRAZUPA_study","328221443_Doenca_arterial_periferica_em_doentes_com_diabetes_nos_cuidados_de_saude_primarios_estudo_observacional","316246782_Lace_Up_for_Healthy_Feet_The_Impact_of_Shoe_Closure_on_Plantar_Stress_Response","314025705_Fatores_de_risco_para_ulceracao_e_amputacao_de_extremidades_inferiores_em_portadores_de_diabetes_mellitus","310595471_Standards_of_medical_care_in_diabetes-2016_Summary_of_revisions","309075934_ADA_standards_of_medical_care_in_diabetes"]}