{"id":"335741525_Context-Based_Analytics_in_a_Big_Data_World_Better_Decisions_An_IBMR_RedbooksR_Point-of-View_publication","abstract":"As the world becomes more instrumented, interconnected, and intelligent, the volume of information that is generated is growing at an exponential rate. The conversation surrounding this information explosion and about big data has centered on the size and management of this data. However, there is also an opportunity to improve critical business insight by taking advantage of the context that is created from big data. Context, the cumulative history that is derived from data observations about entities (people, places, and things), is a critical component of analytic decision process. Without context, business conclusions might be flawed. By using context analytics with big data, organizations can derive trends, patterns, and relationships from unstructured data and related structured data. These insights can help an organization to make fact-based decisions to anticipate and shape business outcomes. Without context, conclusions that are drawn from big data might be flawed Organizations use analytics to learn about entities and then use the derived information to make mission-critical decisions. One important context analytics use case lies in the realm of social networking. The reach of social networking (for example, Facebook) and microblogging services (for example, Twitter) has extended to hundreds of millions of users. US-based Twitter generates more than 200 million text-based messages, or \"tweets,\" per day and, by itself, has attracted more than 170 million active users. This venue and other similar services constitute an observational space by which trends and patterns in attitudes can be ascertained. As these venues become increasingly more valuable, the ability to perform pattern detection to make sense of the new data and to create insight in real time becomes critical. There are several basic building blocks for insight. Entities are defined as people, places, things, locations, organizations, and events. Entities are an important focus of big data analytics. Context is defined as a better understanding of how entities relate. Cumulative context is the memory of how entities relate over time. Unlocking big data's potential for reasoning about entities requires us to think differently about analytics. Using cumulative context and its derived information is critical to the success of analytics. Organizations must learn how to apply context to big data, or the conclusions and mission-critical decisions that are made from the analysis might be in error. Highlights The growing complexity of the big data observational space requires organizations to use innovative approaches in order to find non-obvious relationships. Context-based analytics provides the following key advantages: Creating data within the appropriate context delivers higher quality models. Higher quality models that are applied to contextually-correct data can lead to better mission decisions and better outcomes. Using real-time contextual analytics enables timely entity assessments, while the observations are still occurring. Using context analytics with big data allows organization to achieve greater success regardless of whether the objective is mitigating risk or recognizing opportunity.","authors":["Lisa Sokol","Steve Cto","Steve Chan"],"meta":["July 2013","Report number: REDP-4962-00Affiliation: IBM"],"references":[]}