{"id":"335712317_Epistemic_modalities_of_racialised_knowledge_production_in_the_Swedish_academy","abstract":"The central aim of this article is to examine the impact of racialization processes within the Swedish academic community in order to understand what kinds of knowledge productions and knowing subject positions are rendered (im)possible in everyday academic interactions. Through autoethnography as an alternative methodological entry point, we analyse our embodied racialised experiences of navigating through historically white universities within a geo-political context framed through a supposedly “colour blind” and “post-racial society”. Our analytical reasoning is presented through several steps. First, we discuss how academic habitus and affiliations maintained in various scientific forums is informed through established, racialised norms and if/whose knowledge is marginalized, devalued, or/and is included due to the reductive representation. Second, we discuss how an uncultivated sense of epistemic entitlement, within different academic settings and communities, constructs indisputable knowing subjects and generates (un)earned (un)comfortable zones. Third, we argue how managing the existing accent ceiling becomes a mode for navigating the norms of whiteness.","authors":["Suruchi Thapar-Bjorkert","Fataneh Fatahani"],"meta":["December 2019Ethnic and Racial Studies 42(16):214-232","DOI:10.1080/01419870.2019.1649440"],"references":["324740737_The_stranger_among_Swedish_homo_academicus","350791084_Talking_Back_Thinking_Feminist_Thinking_Black","347053999_Excerpts_from_Racism_without_Racists","345968948_Economies_of_Violence_Transnational_Feminism_Postsocialism_and_the_Politics_of_Sex_Trafficking","344486690_Outline_of_a_Theory_of_Practice","338266236_The_Racial_Contract","333028207_Along_the_Archival_Grain_Epistemic_Anxieties_and_Colonial_Common_Sense","330175147_My_Body_Myself_How_Does_a_Black_Woman_Do_Sociology_A_Reader","324324243_Distinction_A_Social_Critique_of_the_Judgement_of_Taste","323321142_Killing_rage_ending_racism"]}