{"id":"335786761_Combinatorial_Spatial_Data_Model_for_Building_Fire_Simulation_and_Analysis","abstract":"Building fire is a complex geographic process related to the indoor spatial environment, a smart spatial data model can accurately describe the spatial-temporal information of a building fire scene, which is important for modeling a fire process. With the development of fire dynamics and computer science, many building fire models have been proposed and widely used. However, the spatial representation of these models is relatively weak. In this study, a fire process modeled via the Fire Dynamics Simulator (FDS) and the requirements of a spatial data model are initially analyzed. Then, a new spatial data model named the Combinatorial Spatial Data Model (CSDM) is combined with Geographic Information System (GIS). The key features of the CSDM, which include spatial, semantic, topological, event and state representations of a building fire scene modeled via the CSDM are subsequently presented. In addition, the Unified Modeling Language (UML) class diagram of the CSDM is also presented, and then experiments with a simplified building are conducted as a CSDM implementation case. A method of transferring data from the CSDM to FDS and a building fire analysis approach using the CSDM are subsequently proposed.","authors":["Rui Song","Niu","Li"],"meta":["September 2019International Journal of Geo-Information 8(9):408","DOI:10.3390/ijgi8090408"],"references":["326950652_Extracting_Indoor_Space_Information_in_Complex_Building_Environments","293195013_Suppression_Effect_of_Sprinkler_System_on_Fire_Spread_in_Large_Commercial_Buildings","323609367_Fire_Extinguishing_System_for_High-Rise_Buildings_and_Rugged_Mountainous_Terrains_Utilizing_Quadrotor_Unmanned_Aerial_Vehicle","316011352_Zone_Computer_Fire_Models_for_Enclosures","311438117_SFPE_handbook_of_fire_protection_engineering_fifth_edition","307589865_Real-Time_Forecasting_of_Building_Fire_Growth_and_Smoke_Transport_via_Ensemble_Kalman_Filter","303899846_A_grid-based_graph_data_model_for_pedestrian_route_analysis_in_a_micro-spatial_environment","290787379_An_Intelligent_Fire_Detection_and_Mitigation_System_Safe_from_Fire_SFF","285351820_Geographic_information_systems_for_geoscientists_modelling_with_GIS","276166483_Building_Information_Modeling_BIM_Trends_Benefits_Risks_and_Challenges_for_the_AEC_Industry"]}