{"id":"335729310_The_Impact_of_Culture_and_Product_on_the_Subjective_Importance_of_User_Experience_Aspects","abstract":"Many software products are created by considering targeted users from different countries. For such products, it is significant to investigate users' expectations related to cultural aspects to achieve user acceptance as broad as possible in all relevant countries. The researchers of the current study examined whether the cultural background of an individual has an influence on the subjective importance of user experience (UX) aspects for several common product categories. The researchers compared findings from a previous study conducted in Germany and a replication study carried out in Indonesia. Results show significant differences concerning the rated importance of UX aspects for many product categories. However, a detailed analysis of the results also shows that the impact of culture is considerably lower than the impact of interindividual differences between persons of the same culture. In addition, both samples show quite similar rankings of the importance of UX aspects. Thus, the product type has a much bigger impact than cultural differences.","authors":["Harry B. Santoso","Martin Schrepp"],"meta":["September 2019Heliyon 5(9):e02434","DOI:10.1016/j.heliyon.2019.e02434"],"references":["327793052_Beurteilung_der_UX_Qualitat_durch_Experten","319454137_Cultural_Differences_in_the_Perception_of_User_Experience","319410175_Formalising_and_evaluating_Cultural_User_Experience","281784277_Faktoren_der_User_Experience_Systematische_Ubersicht_uber_produktrelevante_UX-Qualitatsaspekte","324362806_User_Experience_mit_Fragebogen_messen","318952876_Understanding_the_textual_content_of_online_customer_reviews_in_B2C_websites_A_cross-cultural_comparison_between_the_US_and_China","317027024_Theory_and_Methods_of_Scaling","304011024_Cultural_impacts_on_e-learning_systems'_success","293117997_Individual_and_Socio-Cultural_Framing_of_E-Learning","266409141_Modeling_a_User's_Culture"]}