{"id":"335733932_When_4_10000_The_Power_of_Social_Science_Knowledge_in_Predictive_Performance","abstract":"Computer science has devised leading methods for predicting variables; can social science compete? The author sets out a social scientific approach to the Fragile Families Challenge. Key insights included new variables constructed according to theory (e.g., a measure of shame relating to hardship), lagged values of the target variables, using predicted values of certain outcomes to inform others, and validated scales rather than individual variables. The models were competitive: a four-variable logistic regression model was placed second for predicting layoffs, narrowly beaten by a model using all the available variables (>10,000) and an ensemble of algorithms. Similarly, a relatively small random forest model (25 variables) was ranked seventh in predicting material hardship. However, a similar approach overfitted the prediction of grit. Machine learning approaches proved superior to linear regression for modeling the continuous outcomes. Overall, social scientists can contribute to predictive performance while benefiting from learning more about data science methods.","authors":["Stephen Mckay"],"meta":["January 2019Socius Sociological Research for a Dynamic World 5(2):237802311881177","DOI:10.1177/2378023118811774"],"references":["335733962_Introduction_to_the_Special_Collection_on_the_Fragile_Families_Challenge","323708363_An_empirical_analysis_of_journal_policy_effectiveness_for_computational_reproducibility","318393858_R_A_Language_and_Environment_for_Statistical_Computing","278948057_Bias_Reduction_of_Maximum_Likelihood_Estimates","248464154_Woodcock-Johnson-III_Tests_of_Achievement","243777639_The_Peabody_Picture_Vocabulary_Test","241223761_Replication_Standards_for_Quantitative_Social_Science_Why_Not_Sociology","227628561_Poverty_or_preference_What_do_'Consensual_deprivation_indicators'_really_measure","227353643_UK_Unemployment_in_the_Great_Recession","224839832_A_Review_of_Methods_for_the_Assessment_of_Prediction_Errors_in_Conservation_PresenceAbsence_Models"]}