{"id":"335786858_Survey_of_Deep-Learning_Approaches_for_Remote_Sensing_Observation_Enhancement","abstract":"Deep Learning, and Deep Neural Networks in particular, have established themselves as the new norm in signal and data processing, achieving state-of-the-art performance in image, audio, and natural language understanding. In remote sensing, a large body of research has been devoted to the application of deep learning for typical supervised learning tasks such as classification. Less yet equally important effort has also been allocated to addressing the challenges associated with the enhancement of low-quality observations from remote sensing platforms. Addressing such channels is of paramount importance, both in itself, since high-altitude imaging, environmental conditions, and imaging systems trade-offs lead to low-quality observation, as well as to facilitate subsequent analysis, such as classification and detection. In this paper, we provide a comprehensive review of deep-learning methods for the enhancement of remote sensing observations, focusing on critical tasks including single and multi-band super-resolution, denoising, restoration, pan-sharpening, and fusion, among others. In addition to the detailed analysis and comparison of recently presented approaches, different research avenues which could be explored in the future are also discussed.","authors":["Grigorios Tsagkatakis","Anastasia Aidini","Konstantina Fotiadou","Michalis Giannopoulos"],"meta":["September 2019Sensors 19(18):3929","DOI:10.3390/s19183929"],"references":["334242822_Satellite_Image_Super-Resolution_via_Multi-Scale_Residual_Deep_Neural_Network","345470450_A_3-D_Atrous_Convolution_Neural_Network_for_Hyperspectral_Image_Denoising","344745441_Super-Resolution_of_Single_Remote_Sensing_Image_Based_on_Residual_Dense_Backprojection_Networks","333705903_Hybrid_Noise_Removal_in_Hyperspectral_Imagery_With_a_Spatial-Spectral_Gradient_Network","333294010_SFTGAN_a_generative_adversarial_network_for_pan-sharpening_equipped_with_spatial_feature_transform_layers","332952379_Pyramid_Fully_Convolutional_Network_for_Hyperspectral_and_Multispectral_Image_Fusion","332089421_Edge-Enhanced_GAN_for_Remote_Sensing_Image_Superresolution","331872475_Convolutional_Autoencoder-Based_Multispectral_Image_Fusion","331751913_Pan-Sharpening_Using_an_Efficient_Bidirectional_Pyramid_Network","331421915_Multi-Losses_Function_Based_Convolution_Neural_Network_for_Single_Hyperspectral_Image_Super-Resolution"]}