{"id":"335701702_Atmospheric_Blocking_and_Other_Large-Scale_Precursor_Patterns_of_Landfalling_Atmospheric_Rivers_in_the_North_Pacific_A_CESM2_Study","abstract":"Atmospheric rivers (ARs) manifest as transient filaments of intense water vapor transport that contribute to synoptic‐scale extremes and interannual variability of precipitation. Despite these influences, the synoptic‐ to planetary‐scale processes that lead to ARs remain inadequately understood. In this study, North Pacific ARs within the November–April season are objectively identified in both reanalysis data and the Community Earth System Model Version 2, and atmospheric patterns preceding AR landfalls beyond 1 week in advance are examined. Latitudinal dependence of the AR processes is investigated by sampling events near the Oregon (45°N, 230°E) and southern California (35°N, 230°E) coasts. Oregon ARs exhibit a pronounced anticyclone emerging over Alaska 1–2 weeks before AR landfall that migrates westward into Siberia, dual midlatitude cyclones developing over southeast coastal Asia and the northeast Pacific, and a zonally elongated band of enhanced water vapor transport spanning the entire North Pacific basin that guides anomalous moisture toward the North American west coast. The precursor high‐latitude anticyclone corresponds to a significant increase in atmospheric blocking probability, suppressed synoptic eddy activity, and an equatorward‐shifted storm track. Southern California ARs also exhibit high‐latitude blocking but have an earlier‐developing and more intense northeast Pacific cyclone. Compared to reanalysis, Community Earth System Model Version 2 underestimates Northeast Pacific AR frequencies by 5–20% but generally captures AR precursor patterns well, particularly for Oregon ARs. Collectively, these results indicate that the identified precursor patterns represent physical processes that are central to ARs and are not simply an artifact of statistical analysis.","authors":["James J. Benedict","Amy C. Clement","Brian Medeiros"],"meta":["November 2019Journal of Geophysical Research Atmospheres 124(21)","DOI:10.1029/2019JD030790"],"references":["334331473_Precipitation_regime_change_in_Western_North_America_The_role_of_Atmospheric_Rivers","332660501_Atmospheric_blocking_and_intercomparison_of_objective_detection_methods_flow_field_characteristics","327206785_Control_of_Storminess_over_the_Pacific_and_North_America_by_Circulation_Regimes_The_role_of_large-scale_dynamics_in_weather_extremes","325876060_The_Role_of_Atmospheric_Rivers_in_Extratropical_and_Polar_Hydroclimate","325183805_Resolution_Dependence_and_Rossby_Wave_Modulation_of_Atmospheric_Rivers_in_an_Aquaplanet_Model","325073382_Defining_Atmospheric_River_How_the_Glossary_of_Meteorology_Helped_Resolve_a_Debate","322567661_The_path_to_CAM6_coupled_simulations_with_CAM54_and_CAM55","336321129_Sensitivity_of_Climate_Simulations_to_the_Parameterization_of_Cumulus_Convection_in_the_Canadian_Climate_Centre_General_Circulation_Model","328047437_Winter_Storm_Conditions_Leading_to_Excessive_Runoff_above_California's_Oroville_Dam_during_January_and_February_2017","322014741_An_Inter-comparison_Between_Reanalysis_and_Dropsonde_Observations_of_the_Total_Water_Vapor_Transport_in_Individual_Atmospheric_Rivers"]}