{"id":"335777539_Bioinformatics_in_Jordan_Status_challenges_and_future_directions","abstract":"Bioinformatics plays a key role in supporting the life sciences. In this work, we examine bio-informatics in Jordan, beginning with the current status of bioinformatics education and research, then exploring the challenges of advancing bioinformatics, and finally looking to the future for how Jordanian bioinformatics research may develop. Author summary Bioinformatics is an important multidisciplinary field for many life sciences. Mathematics , statistics, computer science, and the life sciences join together to breathe life into the discipline of bioinformatics. In Jordan, rapid progress in life science, research, and health-care have created a demand for the bioinformatics field. Because of the importance of bio-informatics and the limited attention to it in Jordan, a need arises to convince stakeholders about supporting this field in the country. We discuss the current status of bioinformatics efforts in education and research in Jordan and investigate the challenges affecting the development of bioinformatics in the country. We present future directions and the opportunities for further development of the discipline. This work is a core step towards a capacity-building plan to attract bioinformatics experts to support bioinformat-ics research and education in the near term in Jordan. We believe that the current challenges of limited educational opportunities, relatively little attention from Jordanian funding agencies for bioinformatics, and few conferences that bring visitors who are leaders in bioinformatics into Jordan demand focused attention to remedy.","authors":["Qanita Bani Baker","Maryam Nuser"],"meta":["September 2019PLoS Computational Biology 15(9)","DOI:10.1371/journal.pcbi.1007202"],"references":["330716417_Designing_and_running_an_advanced_Bioinformatics_and_genome_analyses_course_in_Tunisia","328941312_Developing_computational_biology_at_meridian_23_E_and_a_little_eastwards","322878459_The_development_and_application_of_bioinformatics_core_competencies_to_improve_bioinformatics_training_and_education","304331515_A_Survey_of_Bioinformatics_Database_and_Software_Usage_through_Mining_the_Literature","282571700_Pharmaceutical_Business_and_Pharmaceutical_Industry_New_Tracks_in_Pharmacy_Education_Initiated_in_Jordan","281849012_Bioinformatics_in_Africa_The_Rise_of_Ghana","280325473_The_Jordan_Food_and_Drug_Administration_A_culture_of_quality_and_continuous_improvement","347525340_The_World_Bank's_Classification_of_Countries_by_Income","329160684_Cutting_Edge_Bioinformatics_and_Biostatistics_Approaches_Are_Bringing_Precision_Medicine_and_Nutrition_to_a_New_Era","314107482_Pharmaceutical_Business_and_Pharmaceutical_Industry_New_Tracks_in_Pharmacy_Education_Initiated_in_Jordan_alsydlt_alsnayt_w_amal_alsydlt_msarat_jdydt_fy_altlym_alsydlany_fy_alardn"]}