{"id":"335897491_Computational_Analysis_for_Estimating_Electricity_Wastage_in_Buildings","abstract":"Computational analysis is a collection of procedures that is used to process large amounts of data with a view of obtaining results based on processed data and as a result, getting their behavioral pattern. The main goal of this research is to determine the amount of electricity wastage and to study occupant's attitude towards energy conservation. In this research, computational techniques are applied to analysis of data collected collected from the Faculty of Computer Science and Information Technology (FCSIT) building, Universiti Malaysia Sarawak (UNIMAS), Malaysia which is considered as the case study. Data collection is carried out by questionnaire analysis of electricity consumers. The questionnaires consists of information on building occupants turning off lights in rooms with no presence, and occupants limiting electricity consumption in the building. This was achieved by administering questionnaires on the FCSIT staffs and students. The information collected provides real-time data on electricity consumption for the building over different periods of time. To effectively model electric wastage in the building, a simulation must be carried out to accurately model the actual amount of electricity consumed in the building and at what period of time. The simulation is based on the real system is built to estimate the amount of electricity wastage at the FCSIT building. Electricity consumption in the building is based on real electricity consumption using statistical analysis. A goodness-tests which consist of the Chi-Square) (2  goodness-test is computed to ensure that the resulting model is reliable and adequate.","authors":["Patrick Ozoh Phd","Adepeju Abeke Adigun","Lawrence Omotosho"],"meta":["September 2019International Journal of Computer Applications 178(50):36-42","Project: Energy Informatics"],"references":["332182707_AN_AN_IN-DEPTH_IN-DEPTH_STUDY_STUDY_OF_OF_TYPICAL_TYPICAL_MACHINE_MACHINE_LEARNING_LEARNING_METHODS_METHODS_VIA_VIA_COMPUTATIONAL_COMPUTATIONAL_TECHNIQUES_TECHNIQUES","220473428_Reducing_Transient_and_Steady_State_Electricity_Consumption_in_HVAC_Using_Learning-Based_Model-Predictive_Control","257226788_Use_of_model_predictive_control_and_weather_forecasts_for_energy_efficient_building_climate_control","230605530_Simulation_of_energy_saving_in_Iranian_buildings_using_integrative_modelling_for_insulation","224546201_A_new_method_of_load-shedding_control_on_centrifugal_water_chiller_sequencing","222404651_Parametric_analysis_of_alternative_energy_conservation_measures_in_an_office_building_in_hot_and_humid_climate","221995190_Wavelet_transform_and_neural_networks_for_short-term_electrical_load_forecasting"]}