{"id":"335825825_On_the_Monitoring_of_Decentralized_Specifications_Semantics_Properties_Analysis_and_Simulation","abstract":"We introduce two complementary approaches to monitor decentralized systems. The first approach relies on systems with a centralized specification, i.e., when the specification is written for the behavior of the entire system. To do so, our approach introduces a data structure that (i) keeps track of the execution of an automaton (ii) has predictable parameters and size, and (iii) guarantees strong eventual consistency. The second approach defines decentralized specifications wherein multiple specifications are provided for separate parts of the system. We study two properties of decentralized specifications pertaining to monitorability and compatibility between specification and architecture. We also present a general algorithm for monitoring decentralized specifications. We map three existing algorithms to our approaches and provide a framework for analyzing their behavior. Furthermore, we present THEMIS, a framework for designing such decentralized algorithms and simulating their behavior. We demonstrate the usage of THEMIS to compare multiple algorithms and validate the trends predicted by the analysis in two scenarios: a synthetic benchmark and the Chiron user interface.","authors":["Antoine El-Hokayem","Yliès Falcone"],"meta":["September 2019ACM Transactions on Software Engineering and Methodology 29(1)","DOI:10.1145/3355181","Project: Decentralized RV"],"references":["328798277_A_Taxonomy_for_Classifying_Runtime_Verification_Tools_18th_International_Conference_RV_2018_Limassol_Cyprus_November_10-13_2018_Proceedings","323084577_Runtime_Failure_Prevention_and_Reaction","323082912_Runtime_Verification_for_Decentralised_and_Distributed_Systems","320996817_Rapidly_Adjustable_Non-intrusive_Online_Monitoring_for_Multi-core_Systems","319488633_Event_Stream_Processing_with_Multiple_Threads","318272811_A_tutorial_on_runtime_verification","315950004_First_international_Competition_on_Runtime_Verification_rules_benchmarks_tools_and_final_results_of_CRV_2014","318376633_THEMIS_a_tool_for_decentralized_monitoring_algorithms","318376269_Monitoring_decentralized_specifications","311475883_Efficient_solutions_to_the_replicated_log_and_dictionary_problems"]}