{"id":"335848761_Learning_the_pattern_of_epistasis_linking_genotype_and_phenotype_in_a_protein","abstract":"Understanding the pattern of epistasis-the non-independence of mutations-is critical for relating genotype and phenotype. However, the combinatorial complexity of potential epistatic interactions has severely limited the analysis of this problem. Using new mutational approaches, we report a comprehensive experimental study of all 213 mutants that link two phenotypically distinct variants of the Entacmaea quadricolor fluorescent protein-an opportunity to examine epistasis up to the 13th order. The data show the existence of many high-order epistatic interactions between mutations, but also reveal extraordinary sparsity, enabling novel experimental and computational strategies for learning the relevant epistasis. We demonstrate that such information, in turn, can be used to accurately predict phenotypes in practical situations where the number of measurements is limited. Finally, we show how the observed epistasis shapes the solution space of single-mutation trajectories between the parental fluorescent proteins, informative about the protein's evolutionary potential. This work provides conceptual and experimental strategies to profoundly characterize epistasis in a protein, relevant to both natural and laboratory evolution.","authors":["Frank Poelwijk","Michael Socolich","Rama Ranganathan"],"meta":["September 2019Nature Communications 10(1):1-11","DOI:10.1038/s41467-019-12130-8"],"references":["326819681_Mutation_and_Epistasis_in_Influenza_Virus_Evolution","325452276_Pairwise_and_higher-order_genetic_interactions_during_the_evolution_of_a_tRNA","324497526_Sign_epistasis_caused_by_hierarchy_within_signalling_cascades","315748697_The_relation_between_alignment_covariance_and_background-averaged_epistasis","314867630_Toward_a_quantitative_understanding_of_antibiotic_resistance_evolution","313813022_Epistasis_and_the_Evolution_of_Antimicrobial_Resistance","312547429_Detecting_High-Order_Epistasis_in_Nonlinear_Genotype-Phenotype_Maps","328143438_Context-Dependent_Mutation_Effects_in_Proteins","323214916_Combinatorial_CRISPR-Cas9_Metabolic_Screens_Reveal_Critical_Redox_Control_Points_Dependent_on_the_KEAP1-NRF2_Regulatory_Axis","320888400_Compensatory_mutations_and_epistasis_for_protein_function"]}