{"id":"335852446_A_Inquiry_Teaching_Mode_Based_on_STEM_Education","abstract":"The course of college English plays an important role in overall improving students’ comprehensive quality. Under traditional teaching mode, English teaching is dominated by the teacher, and supplemented by students. Such the efficiency of teaching method is low so that students cannot give full play to their dominant role in learning. Besides, their learning ability cannot improve, and it is difficult to carry out teaching activities efficiently. On this basis, an inquiry teaching mode based on STEM educational concept was explored for the course of college English in this study by combining specific implementation requirements of inquiry learning method. Meanwhile, the teaching effects of experimental class and control class for which traditional teaching mode was applied were compared. The result shows that the inquiry teaching mode based on STEM educational concept has obvious advantages in college English teaching and can significantly improve students’ comprehensive ability and professional quality, so it deserves to be referenced for teaching mode reform.","authors":["Lian Zhai"],"meta":["September 2019International Journal of Emerging Technologies in Learning (iJET) 14(17):44","DOI:10.3991/ijet.v14i17.11204"],"references":["305418293_A_conceptual_framework_for_integrated_STEM_education","267218320_Infusing_Multimodal_Tools_and_Digital_Literacies_into_an_English_Education_Program_Authors","313824863_Changes_in_science_teachers'_conceptions_and_connections_of_STEM_concepts_and_earthquake_engineering","267512000_Challenges_in_STEM_Teaching_Implication_for_Preservice_and_Inservice_Teacher_Education_Program","259539216_Discipline-Based_Education_Research_Understanding_and_Improving_Learning_in_Undergraduate_Science_and_Engineering","258546748_Universities_seek_culture_change_for_improved_STEM_teaching","49284963_Fostering_Nonverbal_Immediacy_and_Teacher_Identity_through_an_Acting_Course_in_English_Teacher_Education"]}