{"id":"335833252_Explainable_Machine_Learning_in_Deployment","abstract":"Explainable machine learning seeks to provide various stakeholders with insights into model behavior via feature importance scores, counterfactual explanations, and influential samples, among other techniques. Recent advances in this line of work, however, have gone without surveys of how organizations are using these techniques in practice. This study explores how organizations view and use explainability for stakeholder consumption. We find that the majority of deployments are not for end users affected by the model but for machine learning engineers, who use explainability to debug the model itself. There is a gap between explainability in practice and the goal of public transparency, since explanations primarily serve internal stakeholders rather than external ones. Our study synthesizes the limitations with current explainability techniques that hamper their use for end users. To facilitate end user interaction, we develop a framework for establishing clear goals for explainability, including a focus on normative desiderata.","authors":["Umang Bhatt","Alice Xiang","Shubham Sharma","Adrian Weller"],"meta":["September 2019","DOI:10.1145/3351095.3375624","Projects: Cyber securityCyber securith"],"references":["350538988_Explaining_individual_predictions_when_features_are_dependent_More_accurate_approximations_to_Shapley_values","335796735_GkmExplain_fast_and_accurate_interpretation_of_nonlinear_gapped_k-mer_SVMs","335354961_The_What-If_Tool_Interactive_Probing_of_Machine_Learning_Models","329748634_Excitation_Backprop_for_RNNs","350252245_17_A_Value_for_n-Person_Games","333069815_Stop_explaining_black_box_machine_learning_models_for_high_stakes_decisions_and_use_interpretable_models_instead","332741841_Improving_Fairness_in_Machine_Learning_Systems_What_Do_Industry_Practitioners_Need","330880261_Explaining_Explanations_An_Overview_of_Interpretability_of_Machine_Learning","330272045_Model_Reconstruction_from_Model_Explanations","330268857_Model_Cards_for_Model_Reporting"]}