{"id":"335855259_Detecting_geo-relation_phrases_from_web_texts_for_triplet_extraction_of_geographic_knowledge_a_context-enhanced_method","abstract":"As an effective organization form of geographic information, a geographic knowledge graph (GeoKG) facilitates numerous geography-related analyses and services. The completeness of triplets regarding geographic knowledge determines the quality of GeoKG, thus drawing considerable attention in the related domains. Mass unstructured geographic knowledge scattered in web texts has been regarded as a potential source for enriching the triplets in GeoKGs. The crux of triplet extraction from web texts lies in the detection of key phrases indicating the correct geo-relations between geo-entities. However, the current methods for key-phrase detection are ineffective because the sparseness of the terms in the web texts describing geo-relations results in an insufficient training corpus. In this study, an unsupervised context-enhanced method is proposed to detect geo-relation key phrases from web texts for extracting triplets. External semantic knowledge is introduced to relieve the influence of the sparseness of the geo-relation description terms in web texts. Specifically, the contexts of geo-entities are fused with category semantic knowledge and word semantic knowledge. Subsequently, an enhanced corpus is generated using frequency-based statistics. Finally, the geo-relation key phrases are detected from the enhanced contexts using the statistical lexical features from the enhanced corpus. Experiments are conducted with real web texts. In comparison with the well-known frequency-based methods, the proposed method improves the precision of detecting the key phrases of the geo-relation description by approximately 20%. Moreover, compared with the well-defined geo-relation properties in DBpedia, the proposed method provides quintuple key-phrases for indicating the geo-relations between geo-entities, which facilitate the generation of new triplets from web texts.","authors":["Peiyuan Qiu","Li Yu","Jialiang Gao","Feng Lu"],"meta":["September 2019Big Earth Data 3(2):1-18","DOI:10.1080/20964471.2019.1657719"],"references":["331286983_Relaxing_Unanswerable_Geographic_Questions_Using_A_Spatially_Explicit_Knowledge_Graph_Embedding_Model","320624856_Road2Vec_Measuring_Traffic_Interactions_in_Urban_Road_System_from_Massive_Travel_Routes","314977972_A_similarity-based_automatic_data_recommendation_approach_for_geographic_models","312131420_Multidimensional_and_quantitative_interlinking_approach_for_Linked_Geospatial_Data","332772124_Geographic_Entity_Relationship_Extraction_Model_Based_on_Piecewise_Convolution_of_Residual_Network","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","315856233_Chinese_Geographical_Knowledge_Entity_Relation_Extraction_via_Deep_Neural_Networks","313094185_Unsupervised_relation_extraction_by_mining_wikipedia_texts_using_information_from_the_web","311857261_A_distantly_supervised_method_for_extracting_spatio-temporal_information_from_text","301952928_A_Practical_Approach_to_Extracting_Names_of_Geographical_Entities_and_Their_Relations_from_the_Web"]}