{"id":"335853221_Dynamic_business_continuity_assessment_using_condition_monitoring_data","abstract":"Concerns on the impacts of disruptive events of various nature on business operations have increased significantly during the past decades. In this respect, business continuity management (BCM) has been proposed as a comprehensive and proactive framework to prevent the disruptive events from impacting the business operations and reduce their potential damages. Most existing business continuity assessment (BCA) models that numerically quantify the business continuity are time-static, in the sense that the analysis done before operation is not updated to consider the aging and degradation of components and systems which influence their vulnerability and resistance to disruptive events. On the other hand, condition monitoring is more and more adopted in industry to maintain under control the state of components and systems. On this basis, in this work, a dynamic and quantitative method is proposed to integrate in BCA the information on the conditions of components and systems. Specifically, a particle filtering-based method is developed to integrate condition monitoring data on the safety barriers installed for system protection, to predict their reliability as their condition changes due to aging. An installment model and a stochastic price model are also employed to quantify the time-dependent revenues and tolerable losses from operating the system. A simulation model is developed to evaluate dynamic business continuity metrics originally introduced. A case study regarding a nuclear power plant (NPP) risk scenario is worked out to demonstrate the applicability of the proposed approach.","authors":["Jinduo Xing","Zhiguo Zeng","Enrico Zio"],"meta":["September 2019International Journal of Disaster Risk Reduction 41(11):101334","DOI:10.1016/j.ijdrr.2019.101334"],"references":["328896297_A_Sequential_Bayesian_Approach_for_Remaining_Useful_Life_Prediction_of_Dependent_Competing_Failure_Processes","326214499_Developing_a_novel_quantitative_framework_for_business_continuity_planning","322324638_Dynamic_Risk_Assessment_Based_on_Statistical_Failure_Data_and_Condition-Monitoring_Degradation_Data","332599550_Activated_sludge_process_faults_diagnosis_based_on_an_improved_particle_filter_algorithm","330269621_Exploring_the_Conceptual_Foundation_of_Continuity_Management_in_the_Context_of_Societal_Safety_Conceptual_Foundation_of_Continuity_Management","328854537_Development_of_Ultrasonic_Guided_Wave_Inspection_Methodology_for_Steam_Generator_Tubes_of_Prototype_Fast_Breeder_Reactor","326859425_Reliability_Assessment_of_Phased-mission_Systems_under_Random_Shocks","326339521_Optimizing_Service_Restoration_in_Distribution_Systems_With_Uncertain_Repair_Time_and_Demand","324767562_The_Future_of_Risk_Assessment","323909488_Failure_Rate_Updates_using_Condition-based_Prognostics_in_Probabilistic_Safety_Assessments"]}