{"id":"335887590_The_Generative_Adversarial_Brain","abstract":"The idea that the brain learns generative models of the world has been widely promulgated. Most approaches have assumed that the brain learns an explicit density model that assigns a probability to each possible state of the world. However, explicit density models are difficult to learn, requiring approximate inference techniques that may find poor solutions. An alternative approach is to learn an implicit density model that can sample from the generative model without evaluating the probabilities of those samples. The implicit model can be trained to fool a discriminator into believing that the samples are real. This is the idea behind generative adversarial algorithms, which have proven adept at learning realistic generative models. This paper develops an adversarial framework for probabilistic computation in the brain. It first considers how generative adversarial algorithms overcome some of the problems that vex prior theories based on explicit density models. It then discusses the psychological and neural evidence for this framework, as well as how the breakdown of the generator and discriminator could lead to delusions observed in some mental disorders.","authors":["Samuel J. Gershman"],"meta":["September 2019Frontiers in Artificial Intelligence 2:18","DOI:10.3389/frai.2019.00018"],"references":["333243134_A_theory_of_learning_to_infer","325372309_The_Predictive_Coding_Account_of_Psychosis","321674580_High_internal_noise_and_poor_external_noise_filtering_characterize_perception_in_autism_spectrum_disorder","321069804_Data_Augmentation_Generative_Adversarial_Networks","326691502_Inflation_versus_filling-in_Why_we_feel_we_see_more_than_we_actually_do_in_peripheral_vision","319770355_Generative_Adversarial_Nets","319524915_Learning_to_Compose_Domain-Specific_Transformations_for_Data_Augmentation","318433270_Imaginative_Reinforcement_Learning_Computational_Principles_and_Neural_Mechanisms","317340747_Where_do_hypotheses_come_from","316454548_Brain_Mechanisms_of_Reality_Monitoring"]}