{"id":"335851554_On_Functions_Computed_on_Trees","abstract":"Any function can be constructed using a hierarchy of simpler functions through compositions. Such a hierarchy can be characterized by a binary rooted tree. Each node of this tree is associated with a function that takes as inputs two numbers from its children and produces one output. Since thinking about functions in terms of computation graphs is becoming popular, we may want to know which functions can be implemented on a given tree. Here, we describe a set of necessary constraints in the form of a system of nonlinear partial differential equations that must be satisfied. Moreover, we prove that these conditions are sufficient in contexts of analytic and bit-valued functions. In the latter case, we explicitly enumerate discrete functions and observe that there are relatively few. Our point of view allows us to compare different neural network architectures in regard to their function spaces. Our work connects the structure of computation graphs with the functions they can implement and has potential applications to neuroscience and computer science.","authors":["Roozbeh Farhoodi","Khashayar Filom","Ilenna Simone Jones","Konrad Paul Kording"],"meta":["September 2019Neural Computation 31(11):1-63","DOI:10.1162/neco_a_01231"],"references":["324600286_A_Mean_Field_View_of_the_Landscape_of_Two-Layers_Neural_Networks","316821143_Stable_Architectures_for_Deep_Neural_Networks","315006561_Why_and_when_can_deep-but_not_shallow-networks_avoid_the_curse_of_dimensionality_A_review","307473101_Why_Does_Deep_and_Cheap_Learning_Work_So_Well","330332337_Perceptrons_An_Introduction_to_Computational_Geometry","319612738_Learning_by_Coincidence_Siamese_Networks_and_Common_Variable_Learning","316800400_Graduate_Texts_in_Mathematics","316794870_Texture_of_the_Nervous_System_of_Man_and_the_Vertebrates","316266277_Probabilistic_lower_bounds_for_approximation_by_shallow_perceptron_networks","315297429_On_the_representation_of_functions_of_several_variables_as_a_superposition_of_functions_of_a_smaller_number_of_variables"]}