{"id":"335868008_Data-driven_Assessment_of_Structural_Evolution_of_RDF_Graphs","abstract":"Since the birth of the Semantic Web, numerous knowledge bases have appeared. The applications that exploit them rely on the quality of their data through time. In this regard, one of the main dimensions of data quality is conformance to the expected usage of the vocabulary. However, the vocabulary usage (i.e., how classes and properties are actually populated) can vary from one base to another. Moreover, through time, such usage can evolve within a base and diverge from the previous practices. Methods have been proposed to follow the evolution of a knowledge base by the observation of the changes of their intentional schema (or ontology); however, they do not capture the evolution of their actual data, which can vary greatly in practice. In this paper, we propose a data-driven approach to assess the global evolution of vocabulary usage in large RDF graphs. Our proposal relies on two structural measures defined at different granularities (dataset vs update), which are based on pattern mining techniques. We have performed a thorough experimentation which shows that our approach is scalable, and can capture structural evolution through time of both synthetic (LUBM) and real knowledge bases (different snapshots and updates of DBpedia).","authors":["Carlos Bobed","Pierre Maillot","Peggy Cellier","Sébastien Ferré"],"meta":["August 2020Semantic Web 11(5):831 - - 853","DOI:10.3233/SW-200368"],"references":["333224075_DELTA-LD_A_Change_Detection_Approach_for_Linked_Datasets","327217552_RDF2Vec_RDF_graph_embeddings_and_their_applications","322889029_Measuring_Structural_Similarity_Between_RDF_Graphs","319327893_RDF_Dataset_Profiling_-_a_Survey_of_Features_Methods_Vocabularies_and_Applications","318717156_MINTE_semantically_integrating_RDF_graphs","317806920_FORMULIS_Dynamic_Form-Based_Interface_for_Guided_Knowledge_Graph_Authoring","326342457_LUBM_A_Benchmark_for_OWL_Knowledge_Base_Systems","324512249_Modelling_Dynamics_in_Semantic_Web_Knowledge_Graphs_with_Formal_Concept_Analysis","317177614_Synthesizing_Knowledge_Graphs_for_Link_and_Type_Prediction_Benchmarking","317071185_Extended_Characteristic_Sets_Graph_Indexing_for_SPARQL_Query_Optimization"]}