{"id":"335832401_Connected_Subgraph_Defense_Games","abstract":"We study a security game over a network played between a defender and k attackers. Every attacker chooses, probabilistically, a node of the network to damage. The defender chooses, probabilistically as well, a connected induced subgraph of the network of \\(\\lambda \\) nodes to scan and clean. Each attacker wishes to maximize the probability of escaping her cleaning by the defender. On the other hand, the goal of the defender is to maximize the expected number of attackers that she catches. This game is a generalization of the model from the seminal paper of Mavronicolas et al. [11]. We are interested in Nash equilibria of this game, as well as in characterizing defense-optimal networks which allow for the best equilibrium defense ratio; this is the ratio of k over the expected number of attackers that the defender catches in equilibrium. We provide characterizations of the Nash equilibria of this game and defense-optimal networks. This allows us to show that the equilibria of the game coincide independently from the coordination or not of the attackers. In addition, we give an algorithm for computing Nash equilibria. Our algorithm requires exponential time in the worst case, but it is polynomial-time for \\(\\lambda \\) constantly close to 1 or n. For the special case of tree-networks, we further refine our characterization which allows us to derive a polynomial-time algorithm for deciding whether a tree is defense-optimal and if this is the case it computes a defense-optimal Nash equilibrium. On the other hand, we prove that it is \\(\\mathtt {NP}\\)-hard to find a best-defense strategy if the tree is not defense-optimal. We complement this negative result with a polynomial-time constant-approximation algorithm that computes solutions that are close to optimal ones for general graphs. Finally, we provide asymptotically (almost) tight bounds for the Price of Defense for any \\(\\lambda \\); this is the worst equilibrium defense ratio over all graphs.","authors":["Eleni C. Akrida","Argyrios Deligkas","Themistoklis Melissourgos","Paul G. Spirakis"],"meta":["September 2019","DOI:10.1007/978-3-030-30473-7_15","In book: Algorithmic Game Theory (pp.216-236)"],"references":["262251154_Game-theoretic_resource_allocation_for_malicious_packet_detection_in_computer_networks","225107141_A_Network_Game_with_Attackers_and_a_Defender","220976041_The_Price_of_Defense","220853282_A_Graph-Theoretic_Network_Security_Game","220725128_The_Price_of_Defense_and_Fractional_Matchings","220616322_A_Graph-Theoretic_Game_and_Its_Application_to_the_k_-Server_Problem","305525040_The_Mysteries_of_Security_Games_Equilibrium_Computation_Becomes_Combinatorial_Algorithm_Design","286952822_Solving_security_games_on_graphs_via_marginal_probabilities","262352639_Security_scheduling_for_real-world_networks","247931318_Cryptography_and_network_security_-_principles_and_practice_3_ed","234785613_Crisis_and_aftermath","230873253_Non-Cooperative_Games","222577860_Inoculation_strategies_for_victims_of_viruses_and_the_sum-of-squares_partition_problem","220553630_GUARDS_and_PROTECT_next_generation_applications_of_security_games","216301157_Equilibrium_points_in_n-person_games_Proc_Natl_Acad_Sci_USA","2874918_Algorithms_for_Interdependent_Security_Games"]}