{"id":"335807943_Designing_The_Code_Snippets_for_Experiments_on_Code_Comprehension_of_Different_Software_Constructs","abstract":"The concept of Basic control structure (BCS) of software and their cognitive weights have been proposed in theory. However not much work has been done to validate weights assigned to various programming constructs. One of the primary reasons for same is that it is difficult to design the experiment to measure the mental effort involved in understanding the effect of various programming constructs and their interplay. The paper discusses some of the challenge involved in setting up such psychological experiment. In such experiments we cannot select and compare any random code snippets of various programming constructs- the variations are endless. We identified different approaches to conduct such experiments. We explained with example various factors and issues involved in selecting the code snippets which resulted in minimum variations in code snippets of various programming constructs, other than that is inherent in syntax. The code snippets design approach proposed here can be used to conduct series of psychological experiments in software studies. We need series of such experiments not only to validate the cognitive weights of different programming constructs, but also it will go long way in having robust metrics for software complexities. These types of experiments can be extremely useful in the field of computer science education in understanding the cognitive load required for learning the concepts of programming languages","authors":["Leena Jain","Satinderjit Singh"],"meta":["March 2019INTERNATIONAL JOURNAL OF COMPUTER SCIENCES AND ENGINEERING 7(3):310-318","DOI:10.26438/ijcse/v7i3.310318"],"references":["324553529_Analysis_of_Existing_Software_Cognitive_Complexity_Measures","322372758_A_Suite_of_Object_Oriented_Cognitive_Complexity_Metrics","306395069_Development_of_an_Improved_Cognitive_Complexity_Metrics_for_Object-Oriented_Codes","284186632_An_Experiment_to_Measure_the_Cognitive_Weights_of_Code_Control_Structures","267387521_A_New_Weighted_Composite_Complexity_Measure_for_Object-Oriented_Systems","319366657_Analysis_and_enhancements_of_a_cognitive_based_complexity_measure","318035766_Syntax_Predicates_Idioms_-_What_Really_Affects_Code_Complexity","288215550_A_new_cognitive_approach_to_measure_the_complexity_of_software's","223116079_Experimental_study_of_a_two-dimensional_language_vs_Fortran_for_first-course_programmers","220423214_Exploratory_experimental_studies_comparing_online_and_offline_programming_performance","4278385_On_Experiments_for_Measuring_Cognitive_Weights_for_Software_Control_Structures","220107841_Conditional_Statements_Looping_Constructs_and_Program_Comprehension_An_Experimental_Study","220107668_The_Effect_of_Semantic_Complexity_on_the_Comprehension_of_Program_Modules","4248300_Cognitive_Complexity_of_Software_and_its_Measurement","3697332_Towards_standard_for_experiments_in_program_comprehension"]}