{"id":"335875607_Prevalence_of_hypochondriac_symptoms_among_health_science_students_in_China_A_systematic_review_and_meta-analysis","abstract":"Background: \nHypochondriac symptoms are commonly reported in health science students. With their incomplete medical knowledge, they may compare their own bodily symptoms with disease symptoms during the process of learning, which can lead to mental distress and the need for repeated medical reassurance.\n\nObjective: \nTo estimate the prevalence of hypochondriac symptoms in Chinese health science students.\n\nMethods: \nA systematic literature search was conducted on PubMed, Web of Science, Embase, China National Knowledge Infrastructure, China Biology Medicine disc, and Wanfang Data on July 1, 2018. Additionally, the references of the retrieved papers were searched. Cross-sectional studies published in either English or Chinese that reported the prevalence of hypochondriac symptoms in health science students were included. The selection process was executed based on the Preferred Reporting Items for Systematic Reviews and Meta-Analysis, and study quality was assessed with the checklist recommended by the Agency for Healthcare Research and Quality for cross-sectional studies. A random-effects model according to the DerSimonian-Laird method was used to calculate the pooled prevalence.\n\nResults: \nSeven cross-sectional studies involving 6,217 Chinese health science students were included. The pooled prevalence of hypochondriac symptoms among health science students was 28.0% (95% CI = 19.0%-38.0%). The symptoms were a little more common in females (30.0%, 95% CI = 19.0%-42.0%) than in males (29.0%, 95% CI = 16.0%-42.0%), but the difference was not significant. No significant differences were found between participants grouped by study year. Only three studies explored the coping styles of students with hypochondriasis, and these revealed a high tendency toward help-seeking behaviors.\n\nConclusion: \nOur systematic review and meta-analysis showed a high prevalence of hypochondriac symptoms among health science students, indicating that it is a noteworthy phenomenon. We suggest that counseling and other support services are necessary for health science students.","authors":["Jingjing Meng","Chang Gao","Chulei Tang","Honghong Wang"],"meta":["September 2019PLoS ONE 14(9):e0222663","DOI:10.1371/journal.pone.0222663"],"references":["324473144_The_perceived_organizational_impact_of_the_gender_gap_across_a_Canadian_department_of_medicine_and_proposed_strategies_to_combat_it_A_qualitative_study","310812588_Psychosomatic_problems_among_medical_students_A_myth_or_reality","309749695_Prevalence_of_mental_distress_and_associated_factors_among_Hawassa_University_medical_students_Southern_Ethiopia_a_cross-sectional_study","328234194_Health_anxiety_and_cyberchondria_among_Ege_University_health_science_students","326182782_Prevalence_of_Anxiety_Symptoms_and_its_Correlates_Among_Medical_Students_in_China_A_National_Survey_in_33_Universities","322236818_Cyberchondria_Overlap_with_Health_Anxiety_and_Unique_Relations_with_Impairment_Quality_of_Life_and_Service_Utilization","319635594_New_medical_education_reform_in_China_Towards_healthy_China_2030","318651183_DSM-5_illness_anxiety_disorder_and_somatic_symptom_disorder_Comorbidity_correlates_and_overlap_with_DSM-IV_hypochondriasis","317271283_Psychological_Strain_and_Suicidal_Ideation_A_Comparison_between_Chinese_and_US_College_Students","301499965_Health-Related_Anxiety_and_Hypochondriacal_Concerns_in_Medical_Students_A_Cross-Sectional_Study_From_Pakistan"]}