{"id":"335888158_HoVer-Net_Simultaneous_Segmentation_and_Classification_of_Nuclei_in_Multi-Tissue_Histology_Images","abstract":"Nuclear segmentation and classification within Haematoxylin & Eosin stained histology images is a fun- damental prerequisite in the digital pathology work-flow. The development of automated methods for nuclear segmentation and classification enables the quantitative analysis of tens of thousands of nuclei within a whole-slide pathology image, opening up possibilities of further analysis of large-scale nuclear morphometry. However, automated nuclear segmentation and classification is faced with a major chal- lenge in that there are several different types of nuclei, some of them exhibiting large intra-class vari- ability such as the nuclei of tumour cells. Additionally, some of the nuclei are often clustered together. To address these challenges, we present a novel convolutional neural network for simultaneous nuclear segmentation and classification that leverages the instance-rich information encoded within the vertical and horizontal distances of nuclear pixels to their centres of mass. These distances are then utilised to separate clustered nuclei, resulting in an accurate segmentation, particularly in areas with overlapping instances. Then, for each segmented instance the network predicts the type of nucleus via a devoted up-sampling branch. We demonstrate state-of-the-art performance compared to other methods on multi- ple independent multi-tissue histology image datasets. As part of this work, we introduce a new dataset of Haematoxylin & Eosin stained colorectal adenocarcinoma image tiles, containing 24,319 exhaustively annotated nuclei with associated class labels.","authors":["Simon Graham","Quoc Dang Vu","Shan e Ahmed Raza","Ayesha Azam"],"meta":["September 2019Medical Image Analysis 58(7):101563","DOI:10.1016/j.media.2019.101563"],"references":["332149706_Methods_for_Segmentation_and_Classification_of_Digital_Microscopy_Tissue_Images","327603915_Novel_digital_signatures_of_tissue_phenotypes_for_predicting_distant_metastasis_in_colorectal_cancer","327065839_Segmentation_of_Nuclei_in_Histopathology_Images_by_Deep_Regression_of_the_Distance_Map","326074675_Nuclear_shape_and_orientation_features_from_HE_images_predict_survival_in_early-stage_estrogen_receptor-positive_breast_cancers","325516328_SAMS-NET_Stain-aware_multi-scale_network_for_instance-based_nuclei_segmentation_in_histology_images","324717642_Micro-Net_A_unified_model_for_segmentation_of_various_objects_in_microscopy_images","323627190_A_Deep_Learning_Algorithm_for_One-step_Contour_Aware_Nuclei_Segmentation_of_Histopathological_Images","333297916_CIA-Net_Robust_Nuclei_Instance_Segmentation_with_Contour-Aware_Information_Aggregation","327567331_Spatial_Architecture_and_Arrangement_of_Tumor-Infiltrating_Lymphocytes_for_Predicting_Likelihood_of_Recurrence_in_Early-Stage_Non-Small_Cell_Lung_Cancer","326546975_Cellular_Community_Detection_for_Tissue_Phenotyping_in_Histology_Images"]}