{"id":"335821185_Efficiently_counting_complex_multilayer_temporal_motifs_in_large-scale_networks","abstract":"Abstract This paper proposes novel algorithms for efficiently counting complex network motifs in dynamic networks that are changing over time. Network motifs are small characteristic configurations of a few nodes and edges, and have repeatedly been shown to provide insightful information for understanding the meso-level structure of a network. Here, we deal with counting more complex temporal motifs in large-scale networks that may consist of millions of nodes and edges. The first contribution is an efficient approach to count temporal motifs in multilayer networks and networks with partial timing, two prevalent aspects of many real-world complex networks. We analyze the complexity of these algorithms and empirically validate their performance on a number of real-world user communication networks extracted from online knowledge exchange platforms. Among other things, we find that the multilayer aspects provide significant insights in how complex user interaction patterns differ substantially between online platforms. The second contribution is an analysis of the viability of motif counting algorithms for motifs that are larger than the triad motifs studied in previous work. We provide a novel categorization of motifs of size four, and determine how and at what computational cost these motifs can still be counted efficiently. In doing so, we delineate the “computational frontier” of temporal motif counting algorithms.","authors":["Hanjo Boekhout","Walter A. Kosters","Frank Takes"],"meta":["September 2019Computational Social Networks 6(1)","DOI:10.1186/s40649-019-0068-z"],"references":["327317297_Multiplex_network_motifs_as_building_blocks_of_corporate_networks","329359756_Counting_Multilayer_Temporal_Motifs_in_Complex_Networks_Volume_1_Proceedings_The_7th_International_Conference_on_Complex_Networks_and_Their_Applications_COMPLEX_NETWORKS_2018","325742135_Multilayer_social_networks","321316885_Detecting_Motifs_in_Multiplex_Corporate_Networks","320609181_Counting_small_subgraphs_in_multi-layer_networks","313264273_Motifs_in_Temporal_Networks","308521050_Explainable_and_Efficient_Link_Prediction_in_Real-World_Network_Data","305037467_Higher-order_organization_of_complex_networks","304589290_Multilayer_motif_analysis_of_brain_networks","304469278_SNAP_A_General_Purpose_Network_Analysis_and_Graph_Mining_Library"]}