{"id":"335924251_Stars_holes_or_paths_across_your_Facebook_friends_A_graphlet-based_characterization_of_many_networks","abstract":"Network science gathers methods coming from various disciplines which sometimes hardly cross the boundaries between these disciplines. Widely used in molecular biology in the study of protein interaction networks, the enumeration, in a network, of all possible subgraphs of a limited size (usually around four or five nodes), often called graphlets, can only be found in a few works dealing with social networks. In the present work, we apply this approach to an original corpus of about 10,000 non-overlapping Facebook ego networks gathered from voluntary participants by a survey application. To deal with so many similar networks, we adapt the relative graphlet frequency to a measure that we call graphlet representativity, which we show to be more effective to classify random networks having slight structural differences. From our data, we produce two clusterings, one of graphlets (paths, star-like, holes, light triangles, and dense), one of networks. The latter is presented with a visualization scheme using our representativity measure. We describe the distinct structural characteristics of the five clusters of Facebook ego networks so obtained and discuss the empirical differences between results obtained with 4-node and 5-node graphlets. We also provide suggestions of follow-ups of this work, both in sociology and in network science.","authors":["Raphaël Charbey","Christophe Prieur"],"meta":["September 2019Network Science 7(4):1-22","DOI:10.1017/nws.2019.20"],"references":["318177168_Efficient_orbit-aware_triad_and_quad_census_in_directed_and_undirected_graphs","309573168_ESCAPE_Efficiently_Counting_All_5-Vertex_Subgraphs","301873801_Combinatorial_algorithm_for_counting_small_induced_graphs_and_orbits","265092910_Alignment-free_protein_interaction_network_comparison","261355853_SAHAD_Subgraph_analysis_in_massive_networks_using_Hadoop","338746674_Social_Network_Analysis","315861108_ESCAPE_Efficiently_Counting_All_5-Vertex_Subgraphs","310663950_Investigating_Link_Inference_in_Partially_Observable_Networks_Friendship_Ties_and_Interaction","283617410_Emergence_of_Scaling_in_Random_Networks","282265117_Biological_network_comparison_using_graphlet_degree_distribution"]}