{"id":"335967875_The_Rhetoric_and_Reality_of_Anthropomorphism_in_Artificial_Intelligence","abstract":"Artificial intelligence (AI) has historically been conceptualized in anthropomorphic terms. Some algorithms deploy biomimetic designs in a deliberate attempt to effect a sort of digital isomorphism of the human brain. Others leverage more general learning strategies that happen to coincide with popular theories of cognitive science and social epistemology. In this paper, I challenge the anthropomorphic credentials of the neural network algorithm, whose similarities to human cognition I argue are vastly overstated and narrowly construed. I submit that three alternative supervised learning methods—namely lasso penalties, bagging, and boosting—offer subtler, more interesting analogies to human reasoning as both an individual and a social phenomenon. Despite the temptation to fall back on anthropomorphic tropes when discussing AI, however, I conclude that such rhetoric is at best misleading and at worst downright dangerous. The impulse to humanize algorithms is an obstacle to properly conceptualizing the ethical challenges posed by emerging technologies.","authors":["David Watson"],"meta":["September 2019Minds and Machines 29(234)","DOI:10.1007/s11023-019-09506-6"],"references":["344956486_Discrimination_in_the_Age_of_Algorithms","331958860_Humans_can_decipher_adversarial_images","331692216_Clinical_Applications_of_Machine_Learning_Algorithms_Beyond_the_Black_Box","330733083_Theories_of_Error_Back-Propagation_in_the_Brain","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","335076177_A_Discussion_of_'Adversarial_Examples_Are_Not_Bugs_They_Are_Features'","331943966_Adversarial_attacks_on_medical_machine_learning","330562619_News_Feature_What_are_the_limits_of_deep_learning","329750836_Robust_Physical-World_Attacks_on_Deep_Learning_Visual_Classification","329473176_A_general_reinforcement_learning_algorithm_that_masters_chess_shogi_and_Go_through_self-play"]}