{"id":"335981257_An_Entropy-Based_Algorithm_with_Nonlocal_Residual_Learning_for_Image_Compressive_Sensing_Recovery","abstract":"Image recovery from compressive sensing (CS) measurement data, especially noisy data has always been challenging due to its implicit ill-posed nature, thus, to seek a domain where a signal can exhibit a high degree of sparsity and to design an effective algorithm have drawn increasingly more attention. Among various sparsity-based models, structured or group sparsity often leads to more powerful signal reconstruction techniques. In this paper, we propose a novel entropy-based algorithm for CS recovery to enhance image sparsity through learning the group sparsity of residual. To reduce the residual of similar packed patches, the group sparsity of residual is described by a Laplacian scale mixture (LSM) model, therefore, each singular value of the residual of similar packed patches is modeled as a Laplacian distribution with a variable scale parameter, to exploit the benefits of high-order dependency among sparse coefficients. Due to the latent variables, the maximum a posteriori (MAP) estimation of the sparse coefficients cannot be obtained, thus, we design a loss function for expectation–maximization (EM) method based on relative entropy. In the frame of EM iteration, the sparse coefficients can be estimated with the denoising-based approximate message passing (D-AMP) algorithm. Experimental results have shown that the proposed algorithm can significantly outperform existing CS techniques for image recovery.","authors":["Zhonghua Xie","Lingjun Liu","Cui Yang"],"meta":["September 2019Entropy 21(9):900","DOI:10.3390/e21090900"],"references":["331531675_Bayesian_Compressive_Sensing_of_Sparse_Signals_with_Unknown_Clustering_Patterns","330719887_QuantumIS_A_Qualia_Consciousness_Awareness_and_Information_Theory_Quale_Approach_to_Reducing_Strategic_Decision-Making_Entropy","326698458_Robust_Frequency_Estimation_of_Multi-sinusoidal_Signals_Using_Orthogonal_Matching_Pursuit_with_Weak_Derivatives_Criterion","323641507_Compressive_sensing_based_simultaneous_fusion_and_compression_of_multi-focus_images_using_learned_dictionary","321987298_DAGAN_Deep_De-Aliasing_Generative_Adversarial_Networks_for_Fast_Compressed_Sensing_MRI_Reconstruction","319151011_Convolutional_Neural_Networks_for_Non-iterative_Reconstruction_of_Compressively_Sensed_Images","333469953_DR2-Net_Deep_Residual_Reconstruction_Network_for_Image_Compressive_Sensing","329262686_ADMM-CSNet_A_Deep_Learning_Approach_for_Image_Compressive_Sensing","317724596_Learning_to_invert_Signal_recovery_via_Deep_Convolutional_Networks","317221030_An_Approximate_Message_Passing_Algorithm_with_Composite_Sparse_Constraint_for_CS_Reconstruction"]}