{"id":"335954077_A_Survey_of_Utility-Oriented_Pattern_Mining","abstract":"The main purpose of data mining and analytics is to find novel, potentially useful patterns that can be utilized in real-world applications to derive beneficial knowledge. For identifying and evaluating the usefulness of different kinds of patterns, many techniques/constraints have been proposed, such as support, confidence, sequence order, and utility parameters (e.g., weight, price, profit, quantity, etc.). In recent years, there has been an increasing demand for utility-oriented pattern mining (UPM). UPM is a vital task, with numerous high-impact applications, including cross-marketing, e-commerce, finance, medical, and biomedical applications. This survey aims to provide a general, comprehensive, and structured overview of the state-of-the-art methods of UPM. First, we introduce an in-depth understanding of UPM, including concepts, examples, and comparisons with related concepts. A taxonomy of the most common and state-of-the-art approaches for mining different kinds of high-utility patterns is presented in detail, including Apriori-based, tree-based, projection-based, vertical-/horizontal-data-format-based, and other hybrid approaches. A comprehensive review of advanced topics of existing high-utility pattern mining techniques is offered, with a discussion of their pros and cons. Finally, we present several well-known open-source software packages for UPM. We conclude our survey with a discussion on open and practical challenges in this field.","authors":["Wensheng Gan","Chun-Wei Jerry Lin","Philippe Fournier Viger","Han-Chieh Chao"],"meta":["September 2019IEEE Transactions on Knowledge and Data Engineering PP(99):1-1","DOI:10.1109/TKDE.2019.2942594","Projects: Big Data AnalyticsUPM: utility-oriented pattern mining"],"references":["333686965_A_Survey_of_Parallel_Sequential_Pattern_Mining","330625562_CoUPM_Correlated_Utility-based_Pattern_Mining","329011065_Privacy_Preserving_Utility_Mining_A_Survey","322503303_A_survey_of_incremental_high-utility_itemset_mining","321802186_Mining_significant_high_utility_gene_regulation_sequential_patterns","339577221_Fast_Utility_Mining_on_Sequence_Data","338597901_An_Efficient_Algorithm_for_Mining_High_Utility_Quantitative_Itemsets","337018755_ProUM_Projection-Based_Utility_Mining_on_Sequence_Data","331238480_HUOPM_High-Utility_Occupancy_Pattern_Mining","322108803_Damped_Window_based_High_Average_Utility_Pattern_Mining_over_data_streams"]}