{"id":"335979703_UTCPredictor_An_uncertainty-aware_novel_teaching_cases_predictor","abstract":"Teaching cases are crucial for computer science (e.g., software testing) teaching. With the fast development of computer science, old and outdated teaching cases cannot meet the requirements of teaching. Therefore, teachers need to update teaching case repository continually and timely. However, teaching case development is an extremely time‐consuming work. Given today's complex and fast‐moving environment of computer science, teachers often feel blind about about what types of cases should be added for teaching. This paper presents UTCPredictor—an automated approach of predicting novel teaching cases from real production by identifying the most uncertain data, which are always with new features that reflect the latest developments and trends in the field. The implementation of UTCPredictor is based on the idea of interactive machine learning as well as several text mining techniques. To evaluate the effectiveness of UTCPredictor, we take bug report case building in software testing teaching as an example, using UTCPredictor to perform 10‐fold cross‐validation on an existing teaching case set. The performance in terms of indicators; Recall, Precision, and F1‐score, achieved three very competitive values—0.91, 0.94, and 0.85, respectively. We further evaluate the effectiveness of UTCPredictor through a user study and a questionnaire. The results are very positive; the user study indicates that educators can build a teaching case set from latest bug report repository by spending only 8.16%–18.11% time costs compared with traditional manual approach; the responses from 2,000 students for the questionnaire show that the teaching cases built with UTCPredictor are very popular among students.","authors":["Xiaoxue Wu","Wei Zheng","Dejun Mu","Ning Li"],"meta":["September 2019Computer Applications in Engineering Education 27(3)","DOI:10.1002/cae.22166"],"references":["329662395_PPChecker_Towards_Accessing_the_Trustworthiness_of_Android_Apps'_Privacy_Policies","320807804_Using_Design_Thinking_to_Write_and_Publish_Novel_Teaching_Cases_Tips_From_Experienced_Case_Authors","329958872_Security_and_Design_Analysis_of_Certificateless_Signature_Schemes_as_Teaching_Cases_of_Cryptography_and_Security_Course_Education","327775571_Education_40_-_Artificial_Intelligence_Assisted_Higher_Education_Early_recognition_System_with_Machine_Learning_to_support_Students'_Success","326887520_Chaff_from_the_Wheat_Characterizing_and_Determining_Valid_Bug_Reports","326854793_Identification_of_Security_Related_Bug_Reports_via_Text_Mining_Using_Supervised_and_Unsupervised_Classification","326046179_A_computer-assisted_instructional_method_based_on_machine_learning_in_software_testing_class","324659041_A_machine_learning_based_deaf_assistance_digital_system","322586175_Education_40_-_Fostering_student's_performance_with_machine_learning_methods","322352194_ConPredictor_Concurrency_Defect_Prediction_in_Real-World_Applications"]}