{"id":"335900695_Approach_for_social_media_content-based_analysis_for_vacation_resorts","abstract":"The impact of social networks on our liveskeeps increasing because they provide content,generated and controlled by users, that is constantly evolving. They aid us in spreading news, statements, ideas and comments very quickly. Social platforms are currently one of the richest sources of customer feedback on a variety of topics. A topic that is frequently discussed is the resort and holiday villages and the tourist services offered there. Customer comments are valuable to both travel planners and tour operators. The accumulation of opinions in the web space is a prerequisite for using and applying appropriate tools for their computer processing and for extracting useful knowledge from them. While working with unstructured data, such as social media messages, there isn’t a universal text processing algorithm because each social network and its resources have their own characteristics. In this article, we propose a new approach for an automated analysis of a static set of historical data of user messages about holiday and vacation resorts, published on Twitter. The approach is based on natural language processing techniques and the application of machine learning methods. The experiments are conducted using softwareproduct RapidMiner.","authors":["Snezhana Sulova","Boris Bankov"],"meta":["September 2019Journal of Communications Software and Systems 15(3)","DOI:10.24138/jcomss.v15i3.712","Project: Social Media in Business and Education - Innovative Models, Opportunities and Challenges (Социалните медии в бизнеса и образованието – иновативни модели, възможности и предизвикателства)"],"references":["326327230_Controls_Mitigating_the_Risk_of_Confidential_Information_Disclosure_by_Facebook_Essential_Concern_in_Auditing_Information_Security","313982488_An_Approach_For_Automatic_Analysis_Of_Online_Store_Product_And_Services_Reviews","291019781_A_Survey_of_Opinion_Mining_and_Sentiment_Analysis","288002744_A_survey_on_opinion_mining_and_sentiment_analysis_Tasks_approaches_and_applications","329581419_Training_algorithms_for_artificial_neural_network_in_predicting_of_the_content_of_chemical_elements_in_the_upper_soil_layer","329338701_Statistical_analysis_and_forecasting_of_extraction_and_use_of_natural_resources","312764109_Data_Analysis_on_Location-Based_Social_Networks","288969606_Data_mining_and_knowledge_discovery_in_databases","277430990_Web_page_classification","277293693_The_World_Wide_Web_Quagmire_or_Goldmine"]}