{"id":"335940746_Drawing_topological_properties_from_a_multi-layered_network_The_case_of_an_air_transport_network_in_the_Belt_and_Road_region","abstract":"In the last few years, theoretical studies have examined a variety of topological properties in single-layered transport systems. One outstanding question concerns how topological properties would be presented in a multi layered network. This paper aims to address this issue with the help of real data from \"the Belt and Road\" (the B&R) region. The air transport network in this region was selected as a case study because of its associated demand for, and cooperation with, air transportation. Algorithms for the analysis of complex networks have enabled us to quantify the complexity and understand the rationale behind topological and multi-layered structures. The multi-layered network in the B&R region is divided into core, bridge and periphery layers, with the application of k-core decomposition. The results show that: (1) the air transport network in the B&R region involves small-world network features; (2) the multi-layered network has strong connectivity within and between the core and bridge layers, with the core layer containing most of the cities in eastern China, Bangkok and Seoul; and (3) the topological features that are present in the air transport network mainly result from the connections within and between the core and bridge layer, rather than the connections within the periphery layer and between the other layers. Displaying the topological properties in multi-layered networks is of great importance in obtaining a greater understanding of the interactions of nodes and connections between the layers. In considering the existing lay-out of routes, this paper also suggests appropriate policies by presenting future airline strategies for the B&R region.","authors":["Lu Zhang","Hongru Du","Yannan Zhao","Philippe De Maeyer"],"meta":["September 2019Habitat International 93:102044","DOI:10.1016/j.habitatint.2019.102044"],"references":["334555708_Robustness_and_Edge_Addition_Strategy_of_Air_Transport_Networks_A_Case_Study_of_the_Belt_and_Road","329371929_Resilience_of_Transportation_Systems_Concepts_and_Comprehensive_Review","325398166_The_implications_of_high-speed_railways_on_air_passenger_flows_in_China","321507695_Urban_networks_among_Chinese_cities_along_the_Belt_and_Road_A_case_of_web_search_activity_in_cyberspace","333160361_Patterns_of_spatial_interaction_and_hierarchical_structure_of_Chinese_cities_based_on_intercity_air_passenger_flows","330111776_Urbanization_patterns_and_poverty_reduction_A_new_perspective_to_explore_the_countries_along_the_Belt_and_Road","326661872_The_trade_network_of_the_Belt_and_Road_Initiative_and_its_topological_relationship_to_the_global_trade_network","323566264_Resilience_of_the_US_National_Airspace_System_Airport_Network","321644883_Marketing_Management_An_International_Perspective","319872058_China_Goes_Global_How_China's_Overseas_Investment_is_Transforming_its_Business_Enterprises"]}