{"id":"335976959_Informatization_of_education_as_a_pledge_of_the_existence_and_development_of_a_modern_higher_education","abstract":"This article focuses on the special significance of education informatization as the main aspect of the existence and development of a modern higher education. The process of computerization of education is considered as the main basis of informatization in the historical aspect. This paper emphasizes the importance of implementing information and communication technologies (ICT) in the learning process of free software and the interest of scientists in the field of education. The interest of modern scholars is analyzed in the consideration of such problems as the application of ICT in education; problems of informatization of education and goals of informatization of education; didactic and psychological aspects of application of ICT in the educational process; problems associated with the widespread introduction of ICT in higher education institutions and informatization of education in general. The article's focus is on the importance of the acquired skills and abilities as a result of informatization of education and implementation of the educational process of ICT. The goals of informatization of education at a modern higher educational establishment are determined. The primary goals of informatization of education are singled out. The types of education that are directly related to ICT are considered. It is acknowledged that the practice of implementing ICT in the educational process of higher educational institutions are expanding every day and yields only positive results. The conclusions highlight the relevance of this study. It is noted that educational activity based on the use of ICT is a basis for changing the structure of the educational process for both teachers and students.","authors":["Elena Fedorenko","Vladislav Velichko","Andrey Stepkin","Alona Chorna"],"meta":["December 2018","Projects: ИКТ в образованииUse FOSS in education"],"references":["331469455_HMARNI_TEHNOLOGII_NAVCANNA_VITOKI"]}