{"id":"335996437_The_Role_of_Universities_in_the_Knowledge_Triangle_Model_on_the_Example_of_EIT_Activities","abstract":"Background. For universities, it is essential to develop in the direction of market expectations. It is necessary to enter into cooperation with entrepreneurs which allows technology transfer to create innovations. The knowledge triangle model is a concept that involves creating relationships between universities, research institutions and enterprises. This idea is very important for European policy and is implemented by the European Institute of Innovation and Technology (EIT). However, it is worth checking whether it is actually being implemented. Research Aims. To check if the approach of the knowledge triangle is used in practice by entities set up under the EIT. Another research aim is an exploration of the current directions in which the university's cooperation with other bodies is heading, and if this has an impact on raising the level of innovation in Europe. Methodology. A look at the model of cooperation between universities and the environment and search for an appropriate framework of benefit from this kind of collaboration on scientific literature review. Moreover, the desk research regarding the EIT Food-one of the European initiatives in the food sector. Key findings. The analyses carried out allow us to state that the concept of the knowledge triangle is not just a theoretical idea. The concept has its application in practice. It was also identified that universities are the main engine of all undertaken activities in the field of education, research and innovation.","authors":["Magdalena Klimczuk-Kochańska"],"meta":["September 2018","Project: Inne publikacje"],"references":["344712567_Innovation_in_Food_and_Agriculture","277128834_The_complex_roles_of_universities_in_the_period_of_globalization","241858820_The_Triple_Helix_-_-University-Industry-Government_Relations_A_Laboratory_for_Knowledge_Based_Economic_Development","319107738_The_Complex_Roles_of_Universities_in_the_Period_of_Globalization","279539612_University-Industry_Research_Relationships","228210805_Academics_or_Entrepreneurs_Entrepreneurial_Identity_and_Invention_Disclosure_Behavior_of_University_Scientists"]}