{"id":"335937887_Fourier_could_be_a_Data_Scientist_from_Graph_Fourier_Transform_to_Signal_Processing_on_Graphs","abstract":"The legacy of Joseph Fourier in science is vast, especially thanks to the essential tool that the Fourier transform is. The flexibility of this analysis, its computational efficiency and the physical interpretation it offers makes it a cornerstone in many scientific domains. With the explosion of digital data, both in quantity and diversity, the generalization of the tools based on Fourier transform is mandatory. In data science, new problems arose for the processing of irregular data such as social networks, biological networks or other data on networks. Graph signal processing is a promising approach to deal with those. The present text is an overview of the state of the art in graph signal processing, focusing on how to define a Fourier transform for data on graphs, how to interpret it and how to use it to process such data. It closes showing some examples of use. Along the way, the review reveals how Fourier's work remains modern and universal, and how his concepts, coming from physics and blended with mathematics, computer science, and signal processing, play a key role in answering the modern challenges in data science.","authors":["Benjamin Ricaud","Pierre Borgnat","Nicolas Tremblay","Paulo Gonçalves"],"meta":["September 2019Comptes Rendus Physique 20(5)","DOI:10.1016/j.crhy.2019.08.003"],"references":["323335451_Spectrally_approximating_large_graphs_with_smaller_graphs","322518276_Graph_Spectral_Image_Processing","336838354_Approximating_Spectral_Clustering_via_Sampling_A_Review","333043457_Eigendecomposition-Free_Sampling_Set_Selection_for_Graph_Signals","332794486_Connecting_the_Dots_Identifying_Network_Structure_via_Graph_Signal_Processing","329729083_Convolutional_Neural_Network_Architectures_for_Signals_Supported_on_Graphs","324307177_Ten_Lectures_on_Wavelets","323718953_Autoregressive_moving_average_graph_filter_design","323708835_A_digraph_fourier_transform_with_spread_frequency_components","321927669_50_Years_of_Data_Science"]}