{"id":"335942244_SwICS_Section-wise_In-Text_Citation_Score","abstract":"Since past several years, finding relevant documents from plethora of web repositories has become prime attention of the scientific community. To find out relevant research articles, state-of-the-art techniques employ content, metadata, citations, and collaborative filtering based approaches. Among all of them, citation based approaches hold strong potential because most of the time, authors cite relevant papers. Bibliographic coupling is one of the well-known citation based approaches for recommending relevant papers. In this paper, we present an approach SwICS that harnesses number of common references between pair of documents as similarity measure whereas the distribution of in-text citations within the text are not analyzed. The proposed approach explores the in-text citation frequencies within contents of the paper and in-text citation patterns between different logical sections for bibliographically coupled papers. For evaluation, the employed data set contains 1150 research documents are obtained from a well-known autonomous citation index known as: CiteSeer. A comprehensive user study is conducted to build a gold standard for comparing the proposed approach. The approach is compared with the state-of-the-art bibliographic coupling and content similarity based techniques. The comparison results revealed that proposed approach significantly performs better than the contemporary approaches. The comparison result with gold standard yielded an average of 0.73. The average gain achieved by the proposed approach is 60% from state-of-the-art: bibliographic coupling. Whereas, the correlation between gold standard and content based approach remains 20%. The proposed approach can play a significant role for search engines and citation indexers in terms of improving the quality of their results.","authors":["Ansar Mehmood Khan","Abdul Shahid","Muhammad Tanvir Afzal","Fakhra Nazar"],"meta":["September 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2942322"],"references":["332051777_AMiner_Search_and_Mining_of_Academic_Social_Networks","329335038_Extending_co-citation_using_sections_of_research_articles","318931083_Paper_recommendation_using_citation_proximity_in_bibliographic_coupling","317759198_Section-wise_indexing_and_retrieval_of_research_articles","331472467_Sections-based_bibliographic_coupling_for_research_paper_recommendation","331416607_A_Hybrid_Approach_Toward_Research_Paper_Recommendation_Using_Centrality_Measures_and_Author_Ranking","308953917_Amazon_com_recommendations_Item-to-item_collaborative_filtering","291118125_CiteSeerx_A_Scholarly_Big_Dataset","290770278_Discovering_semantic_relatedness_between_scientific_articles_through_Citation_Frequency","285806184_Boosting_Text_Classification_through_Stemming_of_Composite_Words"]}