{"id":"335962706_Mediating_Role_of_Dynamic_Capabilities_on_the_Relationship_between_Human_Resource_Development_and_Organizational_Effectiveness","abstract":"Background and purpose: The recent literature established that human resource development (HRD) is significantly related to organizational effectiveness (OE). In rapidly changing environments, the organizations should strive to address the shifts in the environment and cope with markets conditions through developing dynamic capabilities, in return, enhance organizational effectiveness. The main purpose of this study is to examine the mediating role of dynamic capabilities on the relationship between human resources development and organizational effectiveness in the Iraqi public universities context.\nDesign/Methodology/Approach: Data were collected through an online questionnaire survey from 215 employees executive and non-executive employees working in the selected public universities in Iraq. Structural equation modeling (SEM) was employed to test the proposed research model.\nResults: The analyzed data supported all the hypothesized relationships of the study. This study finds that HRD practices have a significant influence on organizational effectiveness and dynamic capabilities. Further, dynamic capabilities significantly influence on organizational effectiveness. Also, the study empirically supports the mediating effect of dynamic capabilities on the relationship between HRD practices and organizational effectiveness.\nConclusion: In the literature, there is still a lack of how HRD practices impact on organizational effectiveness through the mechanisms of dynamic capabilities. Therefore, this research contributes to the literature by pointing out the mediating role of dynamic capabilities on the relationship between HRD and organizational effectiveness. Based on the existing literature and empirical results, the study provides the theoretical and practical implications which are further discussed in detail.","authors":["Mohanad Ali Kareem","Hayder Abdulmohsin Mijbas"],"meta":["August 2019Open Computer Science 52(3):187-203","DOI:10.1515/comp-2019-0012"],"references":["323758956_Developing_a_talent_management_model_using_government-evidence_from_a_large-sized_city_Iran","319475613_Dynamic_capabilities_Marketing_Capability_and_Organizational_Performance","316174114_Dynamic_capabilities_and_organizational_performance_The_mediating_role_of_innovation","314244654_Leadership_and_dynamic_capabilities_the_role_of_HR_systems","337291541_Factors_affecting_organizational_development_Case_Study_Welfare_office_of_East_Azerbaijan_province","330230824_Impact_of_human_resource_development_HRD_practices_on_pharmaceutical_industry's_performance_The_mediating_role_of_employee_performance","329256675_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error_Algebra_and_Statistics","325041820_Influence_of_Human_Resource_Development_HRD_Practices_on_Organizational_Effectiveness_The_Role_of_Employee_Competencies","320667484_Detection_of_Cyber-attacks_to_indoor_real_time_localization_systems_for_autonomous_robots","318303376_Empirical_analysis_of_cyber-attacks_to_an_indoor_real_time_localization_system_for_autonomous_robots"]}