{"id":"336081761_Accelerating_deep_reinforcement_learning_strategies_of_flow_control_through_a_multi-environment_approach","abstract":"Deep Reinforcement Learning (DRL) has recently been proposed as a methodology to discover complex active flow control strategies [Rabault et al., “Artificial neural networks trained through deep reinforcement learning discover control strategies for active flow control,” J. Fluid Mech. 865, 281–302 (2019)]. However, while promising results were obtained on a simple 2-dimensional benchmark flow at a moderate Reynolds number, considerable speedups will be required to investigate more challenging flow configurations. In the case of DRL trained with Computational Fluid Dynamics (CFD) data, it was found that the CFD part, rather than training the artificial neural network, was the limiting factor for speed of execution. Therefore, speedups should be obtained through a combination of two approaches. The first one, which is well documented in the literature, is to parallelize the numerical simulation itself. The second one is to adapt the DRL algorithm for parallelization. Here, a simple strategy is to use several independent simulations running in parallel to collect experiences faster. In the present work, we discuss this solution for parallelization. We illustrate that perfect speedups can be obtained up to the batch size of the DRL agent, and slightly suboptimal scaling still takes place for an even larger number of simulations. This is, therefore, an important step toward enabling the study of more sophisticated fluid mechanics problems through DRL.","authors":["Jean Rabault","Alexander Kuhnle"],"meta":["September 2019Physics of Fluids 31(9):094105","DOI:10.1063/1.5116415"],"references":["335785608_Machine_Learning_for_Fluid_Mechanics","333707101_Control_effect_of_micro_vortex_generators_on_attached_cavitation_instability","332568582_Control_effect_of_micro_vortex_generators_on_leading_edge_of_attached_cavitation","332495603_Predictions_of_turbulent_shear_flows_using_deep_neural_networks","337062528_Control_of_chaotic_systems_by_deep_reinforcement_learning","334407224_Superhuman_AI_for_multiplayer_poker","332589001_Control_of_vortex-induced_vibration_of_a_circular_cylinder_using_a_pair_of_air_jets_at_low_Reynolds_number","331880812_Drag_reduction_mechanisms_of_a_car_model_at_moderate_yaw_by_bi-frequency_forcing","331697417_The_control_of_flow_separation_Study_of_optimal_open_loop_parameters","331578377_Dynamic_mode_tracking_and_control_with_a_relaxation_method"]}