{"id":"336031740_A_Survey_on_Clone_Refactoring_and_Tracking","abstract":"Code clones, identical or nearly similar code fragments in a software system’s code-base, have mixed impacts on software evolution and maintenance. Focusing on the issues of clones researchers suggest managing them through refactoring, and tracking. In this paper we present a survey on the state-of-the-art of clone refactoring and tracking techniques, and identify future research possibilities in these areas. We define the quality assessment features for the clone refactoring and tracking tools, and make a comparison among these tools considering these features. To the best of our knowledge, our survey is the first comprehensive study on clone refactoring and tracking. According to our survey on clone refactoring we realize that automatic refactoring cannot eradicate the necessity of manual effort regarding finding refactoring opportunities, and post refactoring testing of system behaviour. Post refactoring testing can require a significant amount of time and effort from the quality assurance engineers. There is a marked lack of research on the effect of clone refactoring on system performance. Future investigations in this direction will add much value to clone refactoring research. We also feel the necessity of future research towards real-time detection, and tracking of code clones in a big-data environment.","authors":["Manishankar Mondal","Chanchal K. Roy","Kevin A. Schneider"],"meta":["September 2019Journal of Systems and Software 159:110429","DOI:10.1016/j.jss.2019.110429"],"references":["324250822_Benchmarks_for_software_clone_detection_A_ten-year_retrospective","322319634_Exploring_code_clones_in_programmable_logic_controller_software","315468814_Refactoring_patterns_study_in_code_clones_during_software_evolution","322670161_Exploring_the_Impact_of_Clone_Refactoring_on_Test_Code_Size_in_Object-Oriented_Software","319637580_Tool_Support_for_Managing_Clone_Refactorings_to_Facilitate_Code_Review_in_Evolving_Software","318447722_Clone_Refactoring_with_Lambda_Expressions","318037139_Removing_Code_Clones_from_Industrial_Systems_Using_Compiler_Directives","315638639_Efficient_method_extraction_for_automatic_elimination_of_type-3_clones","315638484_Variant-preserving_refactorings_for_migrating_cloned_products_to_a_product_line","312532894_Clone_detection_using_abstract_syntax_trees"]}