{"id":"336021506_pathfindR_An_R_Package_for_Comprehensive_Identification_of_Enriched_Pathways_in_Omics_Data_Through_Active_Subnetworks","abstract":"Pathway analysis is often the first choice for studying the mechanisms underlying a phenotype. However, conventional methods for pathway analysis do not take into account complex protein-protein interaction information, resulting in incomplete conclusions. Previously, numerous approaches that utilize protein-protein interaction information to enhance pathway analysis yielded superior results compared to conventional methods. Hereby, we present pathfindR, another approach exploiting protein-protein interaction information and the first R package for active-subnetwork-oriented pathway enrichment analyses for class comparison omics experiments. Using the list of genes obtained from an omics experiment comparing two groups of samples, pathfindR identifies active subnetworks in a protein-protein interaction network. It then performs pathway enrichment analyses on these identified subnetworks. To further reduce the complexity, it provides functionality for clustering the resulting pathways. Moreover, through a scoring function, the overall activity of each pathway in each sample can be estimated. We illustrate the capabilities of our pathway analysis method on three gene expression datasets and compare our results with those obtained from three popular pathway analysis tools. The results demonstrate that literature-supported disease-related pathways ranked higher in our approach compared to the others. Moreover, pathfindR identified additional pathways relevant to the conditions that were not identified by other tools, including pathways named after the conditions.","authors":["Ege Ülgen","Ozan Ozisik","O. Uğur Sezerman"],"meta":["September 2019Frontiers in Genetics 10:858","DOI:10.3389/fgene.2019.00858","Project: Active Module Identification in Biological Interaction Networks"],"references":["325512858_The_p53-signaling_pathway_and_colorectal_cancer_Interactions_between_downstream_p53_target_genes_and_miRNAs","325318725_The_Role_of_Apelin_in_Cardiovascular_Diseases_Obesity_and_Cancer","323628833_pathfindR_An_R_Package_for_Pathway_Enrichment_Analysis_Utilizing_Active_Subnetworks","323191073_C-Type_Lectin-Like_Receptors_As_Emerging_Orchestrators_of_Sterile_Inflammation_Represent_Potential_Therapeutic_Targets","321149384_The_Reactome_Pathway_Knowledgebase","327226535_Erratum_Microsatallite_instability_and_suppressed_DNA_repair_enzyme_expression_in_rheumatoid_arthritis_Journal_of_Immunology_2003_170_2214-2220","325876637_Novel_Sphingolipid-Based_Cancer_Therapeutics_in_the_Personalized_Medicine_Era","325254234_The_role_of_the_JAKSTAT_signal_pathway_in_rheumatoid_arthritis","322275202_TNF-a_promotes_colon_cancer_cell_migration_and_invasion_by_upregulating_TROP-2","321152509_Toll_like_receptor_signaling_pathway_as_a_potential_therapeutic_target_in_colorectal_cancer_TLR_pathway_in_colorectal_cancer"]}