{"id":"336085127_Exploring_computational_geometry_of_fundamental_interactions_in_static_limits","abstract":"We explore computational geometry, particularly the three-dimensional (3D) contours of the electrostatic potential due to electrical charges with similar and also opposite polarity. We also explore the 3D contours of the gravitational potential by computational geometry. The noticeable outcome of these exercises is that electrostatic interaction affects the geometry of the space as does the gravitational interaction but with the difference that electrostatic interaction affects the geometry of the space differently for charges with different polarity and at different distance scales. V C 2019 Physics Essays Publication. [http://dx.doi.org/10.4006/0836-1398-32.3.411] R esum e: Nous explorons la g eom etrie informatique, en particulier les contours tridimensionnels (3-D) du potentiel electrostatique dus aux charges electriques de polarit e a la fois similaire et oppos ee. Par le biais de la g eom etrie algorithmique, nous pourrons egalement explorer les contours tridimensionnels (3-D) du potentiel gravitationnel. Le r esultat visible de ces exercices montre que l'interaction electrostatique affecte la g eom etrie de l'espace tout comme l'interaction gravitationnelle, mais avec la diff erence que l'interaction electrostatique affecte la g eom etrie de l'espace d'une manière diff erente pour des charges de polarit e oppos ee et a des echelles de distance diverse.","authors":["Aalok Pandya"],"meta":["September 2019","DOI:10.4006/0836-1398-32.3.411]","Project: Background Independent Quantum Mechanics and Search for Gravity in Geometric Quantum Mechanics"],"references":["319908118_Computational_investigation_of_electrostatic_interactions","204752438_Computational_Physics_Problem_Solving_with_Computers_2nd","2058225_Resource_Letter_NSST-1_The_nature_and_status_of_string_theory","291953549_Progress_in_the_theory_of_electrostatic_interactions_between_charged_particles"]}