{"id":"336027019_EFFECTS_OF_COGNITIVE_RESTRUCTURING_AND_ASSERTIVENESS_TRAININGS_ON_DRUG_ABUSE_AMONG_SECONDARY_SCHOOL_ADOLESCENTS_IN_ONITSHA_EDUCATION_ZONE_OF_ANAMBRA_STATE","abstract":"Percentage of students abusing drug seem to be on the increase with no clear cut treatment option available for the drug abusers in Nigeria. The situation is unhealthy ax it affects the academic well being of the student or the abuser. It is against this background that, this study focused on the effect of cognitive restructuring and assertive ness training on drug abuse among secondary school adolescents in Onitsha Education Zone of Anambra State. Three research questions and two hypotheses guided the study. This is an experimental study. The design adopted wax the randomized post-test-only-group design. The population for the study consisted of 256 senior secondary school student drug abusers identified with Drug Users Observation Scale (DUOS). Purposive sampling technique was used to select 60 students from Onitsha zone of Anambra State. The sampling was based on gender status. The instrument, used in data collection were the modified Drug Abuse Screaming Test (DAST) developed by Skinner in 1982 as well as the. Drug Users Observation Scale (D UOS) developed by the researchers. The internal consistency reliability estimates using Cronbach Alpha were 0.81 for DUOS and 0.70 for DAST, respectively. The data collected were analyzed using means standard deviation, t-test and One Way Analysis of Variance (ANOVA). The results of the study showed that, the combination of cognitive restructuring and assertiveness training was the most effective therapy while the use of each therapy, was also effective in reducing drug abuse among students. Based on the findings of the study, recommendations were made among which were that, teachers and students alike should he taught how to use cognitive restructuring and assertive-ness training techniques in treating drug abusers and other behavior problems..","authors":["Vera Nwadinobi"],"meta":["September 2019"],"references":["35753160_The_Effects_of_Internet-Based_Cognitive_Restructuring_on_the_Irrational_Career_Beliefs_of_Adolescent_Girls","225923686_Changing_rational-emotive_therapy_RET_to_rational_emotive_behavior_therapy_REBT","16677046_The_effectiveness_of_assertive_training_with_elderly_psychiatric_outpatients"]}