{"id":"336085152_On_Extraction_of_Event_Information_from_Social_Text_Streams_An_Unpretentious_NLP_Solution","abstract":"Most recently, with the advanced technological facilities, the automated techniques for extraction of event information has got significantly more importance; and stands as one of the most desirable tasks in the social text stream processing. Among the social text streams: email is one of the most broadly used methods for the official announcements. Moreover, emails have a very complex and diverse unbounded layout in all formats of text structures. In this paper, a novel technique is proposed for event extraction from the email text, where the definition that term \"event\" engages something as an occurrence or happening with specific attributes, such as at a particular location, date and time, involving one or more actors and participants. Existing work on event detection shows that people have partially represented their attributes. Mostly they have worked on the use of publication time as the temporal information instead of actual temporal information contained within the text. In this work, NLP techniques along with handwritten rules, word semantic tools like WordNet, and gazetteer lists are entailed for countering various issues in running text; it includes the requisite demands such as the grammatical structure of the sentence should be correct for revealing the boundary of the accurate phrase. The detailed evaluation of the proposed methodology is done with metrics metricizes like precision, recall, F1-measure. We are hopeful that researchers and professionals all around the worlds will employ the proposed method for event extraction.\n\nIJCSNS International Journal of Computer Science and Network Security","authors":["Kanwal Iqbal","Muhammad Yaseen Khan","Shaukat Wasi","Shumaila Mahboob"],"meta":["September 2019International Journal of Computer Network and Information Security 19(9):121-131","Project: Named Entity Recognition"],"references":["322568235_Beyond_Word_Importance_Contextual_Decomposition_to_Extract_Interactions_from_LSTMs","320652688_Structured_data_extraction_from_emails","319057004_Location_Name_Extraction_from_Targeted_Text_Streams_using_Gazetteer-based_Statistical_Language_Models","318737364_Learning_with_Noise_Enhance_Distantly_Supervised_Relation_Extraction_with_Dynamic_Transition_Matrix","308791998_EEQuest_An_Event_Extraction_and_Query_System","319241617_Unsupervised_event_exploration_from_social_text_streams","313456180_Event_detection_from_social_network_streams_using_frequent_pattern_mining_with_dynamic_support_values","312538118_Support-vector_networks","301408812_Major_Life_Event_Extraction_from_Twitter_based_on_CongratulationsCondolences_Speech_Acts","284738000_What_Is_New_in_Our_City_A_Framework_for_Event_Extraction_Using_Social_Media_Posts"]}