{"id":"336037211_Spacetime_Programming_A_Synchronous_Language_for_Composable_Search_Strategies","abstract":"Search strategies are crucial to efficiently solve constraint satisfaction problems. However, programming search strategies in the existing constraint solvers is a daunting task and constraint-based languages usually have compositionality issues. We propose spacetime programming, a paradigm extending the synchronous language Esterel and timed concurrent constraint programming with backtracking, for creating and composing search strategies. In this formalism, the search strategies are composed in the same way as we compose concurrent processes. Our contributions include the design and behavioral semantics of spacetime programming, and the proofs that spacetime programs are deterministic, reactive and extensive functions. Moreover, spacetime programming provides a bridge between the theoretical foundations of constraint-based concurrency and the practical aspects of constraint solving. We developed a prototype of the compiler that produces search strategies with a small overhead compared to the hard-coded ones.","authors":["Pierre Talbot"],"meta":["October 2019","DOI:10.1145/3354166.3354183","Conference: 21st International Symposium on Principles and Practice of Declarative Programming (PPDP 2019)At: Porto, Portugal"],"references":["326331703_Spacetime_Programming_A_Synchronous_Language_for_Constraint_Search","300298337_Search_by_constraint_propagation","283862428_MiniSearch_A_Solver-Independent_Meta-Search_Language_for_MiniZinc","321737673_SCEst_Sequentially_Constructive_Esterel","317944864_LogicConstraint_Programming_and_Concurrency_The_Hard-Won_Lessons_of_the_Fifth_Generation_Computer_Project","316793082_Synchronous_Programming_of_Reactive_Systems","311578961_Other_things_besides_number_Abstraction_constraint_propagation_and_string_variable_types","303296313_LogicConstraint_Programming_and_Concurrency_The_Hard-Won_Lessons_of_the_Fifth_Generation_Computer_Project","287581771_QuickPup_A_heuristic_backtracking_algorithm_for_the_partner_units_configuration_problem","286136704_An_Interval_Constraint_System_for_Lattice_Domains"]}