{"id":"336073317_Girls_Who_Code_Assessing_Programming_Language_Preferences_Among_Female_Undergraduate_CS_Students","abstract":"This paper reports on a study of the programming language preferences among some female Computer Science undergraduate students in four Nigerian higher institutions. The research is aimed at gaining an insight into the factors that influence the choice of programming language among female CS undergraduates as well as determine what effects the choice of programming language has on coding efficiencies and design thinking/problem solving abilities of the students. Questionnaires were administered to a total of 35 female students of computer science from four tertiary institutions in north-central Nigeria. The researcher defined two broad classes of assessment criteria based on personal interests and the technical properties of the language for the study, and the results showed the students were indifferent to technical features like biding time for variables and dynamic debugging, but will show preference for languages that provide support for modularity and components re-use, as well as those that are easy to learn and understand. The respondents revealed that they have personal favourites and that they would prefer a language that is emphasized in the curriculum and taught to them in addition to considering the complexity of the language elements, target platforms and suitability for the problem at hand. After the return of the questionnaires, onsite interviews were conducted for 15 female respondents who were indifferent on the technical consideration and exerts from their responses are illustrated in a dynamic jMap.","authors":["Francisca Onaolapo Oladipo"],"meta":["December 2016Journal of Multidisciplinary Healthcare 2(12):2458-925"],"references":["220590718_A_Formal_Language_Selection_Process_for_Introductory_Programming_Courses","220590581_On_the_Development_of_a_Programming_Teaching_Tool_The_Effect_of_Teaching_by_Templates_on_the_Learning_Process","308384407_Analyzing_the_Effect_of_Learning_Styles_and_Study_Habits_of_Distance_Learners_on_Learning_Performances_A_Case_of_an_Introductory_Programming_Course","221538289_Using_programming_to_help_students_understand_the_value_of_diversity","220612685_Real_women_don't_write_programs"]}