{"id":"336022767_Echo_State_Networks_with_Self-Normalizing_Activations_on_the_Hyper-Sphere","abstract":"Among the various architectures of Recurrent Neural Networks, Echo State Networks (ESNs) emerged due to their simplified and inexpensive training procedure. These networks are known to be sensitive to the setting of hyper-parameters, which critically affect their behavior. Results show that their performance is usually maximized in a narrow region of hyper-parameter space called edge of criticality. Finding such a region requires searching in hyper-parameter space in a sensible way: hyper-parameter configurations marginally outside such a region might yield networks exhibiting fully developed chaos, hence producing unreliable computations. The performance gain due to optimizing hyper-parameters can be studied by considering the memory–nonlinearity trade-off, i.e., the fact that increasing the nonlinear behavior of the network degrades its ability to remember past inputs, and vice-versa. In this paper, we propose a model of ESNs that eliminates critical dependence on hyper-parameters, resulting in networks that provably cannot enter a chaotic regime and, at the same time, denotes nonlinear behavior in phase space characterized by a large memory of past inputs, comparable to the one of linear networks. Our contribution is supported by experiments corroborating our theoretical findings, showing that the proposed model displays dynamics that are rich-enough to approximate many common nonlinear systems used for benchmarking.","authors":["Pietro Verzelli","Cesare Alippi","Lorenzo Livi"],"meta":["September 2019Scientific Reports 9(1):1-14","DOI:10.1038/s41598-019-50158-4"],"references":["327337311_Echo_state_networks_are_universal","326681471_Interpreting_Recurrent_Neural_Networks_Behaviour_via_Excitable_Network_Attractors","326479439_Combining_Memory_and_Non-linearity_in_Echo_State_Networks","323932180_Reservoir_Computing_Approaches_for_Representation_and_Classification_of_Multivariate_Time_Series","323747090_Hybrid_Forecasting_of_Chaotic_Processes_Using_Machine_Learning_in_Conjunction_with_a_Knowledge-Based_Model","323313881_Asymptotic_Fisher_Memory_of_Randomized_Linear_Symmetric_Echo_State_Networks","322457145_Model-Free_Prediction_of_Large_Spatiotemporally_Chaotic_Systems_from_Data_A_Reservoir_Computing_Approach","320564486_Using_Machine_Learning_to_Replicate_Chaotic_Attractors_and_Calculate_Lyapunov_Exponents_from_Data","319403947_Reservoir_Computing_Beyond_Memory-Nonlinearity_Trade-off","328989601_A_CHARACTERIZATION_OF_THE_EDGE_OF_CRITICALITY_IN_BINARY_ECHO_STATE_NETWORKS"]}