{"id":"336185374_Extensions_of_unipotent_groups_Massey_products_and_Galois_theory","abstract":"We study the vanishing of four-fold Massey products in mod p Galois cohomology. First, we describe a sufficient condition, which is simply expressed by the vanishing of some cup-products, and is directly analogous to the work of Guillot, Mináč and Topaz for p=2. For local fields with enough roots of unity, we prove that this sufficient condition is also necessary, and we ask whether this is a general fact.\nWe provide a simple splitting variety, that is, a variety which has a rational point if and only if our sufficient condition is satisfied. It has rational points over local fields, and so, if it satisfies a local-global principle, then the Massey Vanishing Conjecture holds for number fields with enough roots of unity.\nAt the heart of the paper is the construction of a finite group U˜5(Fp), which has U5(Fp) as a quotient. Here Un(Fp) is the group of unipotent n×n-matrices with entries in the field Fp with p elements; it is classical that Un+1(Fp) is intimately related to n-fold Massey products. Although U˜5(Fp) is much larger than U5(Fp), its definition is very natural, and for our purposes, it is easier to study.","authors":["Pierre Guillot","Jan Minac"],"meta":["October 2019Advances in Mathematics 354:106748","DOI:10.1016/j.aim.2019.106748","Project: Massey products in Galois cohomology and structure of maximal pro-p quotients of Absolute Galois groups"],"references":["313268073_Counting_Galois_U4Fp-extensions_using_Massey_products","269997990_Triple_Massey_products_and_absolute_Galois_groups","269997749_Triple_Massey_products_vanish_over_all_fields","251876269_Triple_Massey_products_and_Galois_theory","2126838_Automatic_realizations_of_Galois_groups_with_cyclic_quotient_of_order_pn","321210954_Four-fold_Massey_products_in_Galois_cohomology","270593922_Construction_of_unipotent_Galois_extensions_and_Massey_products","246772663_Massey_products_and_maps_between_groups","232276091_Splitting_Varieties_for_Triple_Massey_Products","38335434_Algebraic_Extensions_of_Arbitrary_Fields"]}