{"id":"336160272_Situational_Cognition_of_College_English_Education_Based_on_Image_Block_Gain_Optimization_in_Pseudo-haze_State","abstract":"Situational cognition can help students to construct their knowledge to a great extent. In order to solve the problem of lack of situational cognition in College English teaching, this paper studies the validity of students' situational cognition in College English teaching based on the method of image block gain optimization. First, this paper analyses the general situation of situational cognition capacity in College English teaching in China at present, and puts forward the function of device image in constructing situational cognitive competence in teaching. Then, it divides device image into blocks under pseudo-haze conditions, and proposes the optimization method of block gain. Finally, on the basis of block gain, it makes an empirical test of situational cognitive competence in College English teaching. The empirical results show that image block gain optimization can effectively improve the construction of situational cognition capacity in College English teaching. With the help of this study, some new and useful ideas can be traced for the development of computer science and college English teaching, and also stimulate the further improvement of College English education in China.","authors":["Hongli Lou"],"meta":["September 2019International Journal of Emerging Technologies in Learning (iJET) 14(18):53","DOI:10.3991/ijet.v14i18.11183"],"references":["331192370_Adaptive_Block_Compressive_Sensing_for_Noisy_Images","341423078_Secured_image_encryption_scheme_based_on_DNA_encoding_and_chaotic_map","336182068_Cognitive_machine_learning_model_for_network_information_safety","335532508_Simulation-Based_Training_Promotes_Higher_Levels_of_Cognitive_Control_in_Acute_and_Unforeseen_Situations","334460554_Improved_Electronic_Image_Stabilisation_Based_on_Image_Mosaic_and_Grey_Projection","333155323_Experiential_Honeymoon_Tourism_Study_from_Perspective_of_Embodied_Cognition","333088305_Copy-Move_Forgery_Detection_Exploiting_Statistical_Image_Features","332623235_MAP_Interpolation_of_an_Ising_Image_Block","332470916_Sharing_More_Information_in_Visual_Cryptography_Scheme_with_Block_Expansion","331185022_Salt_and_Pepper_Noise_Suppression_for_Medical_Image_by_Using_Non-local_Homogenous_Information"]}