{"id":"336121387_Deterministic_Dynamic_Matching_in_O1_Update_Time","abstract":"We consider the problems of maintaining an approximate maximum matching and an approximate minimum vertex cover in a dynamic graph undergoing a sequence of edge insertions/deletions. Starting with the seminal work of Onak and Rubinfeld (in: Proceedings of the ACM symposium on theory of computing (STOC), 2010), this problem has received significant attention in recent years. Very recently, extending the framework of Baswana et al. (in: Proceedings of the IEEE symposium on foundations of computer science (FOCS), 2011) , Solomon (in: Proceedings of the IEEE symposium on foundations of computer science (FOCS), 2016) gave a randomized dynamic algorithm for this problem that has an approximation ratio of 2 and an amortized update time of O(1) with high probability. This algorithm requires the assumption of an oblivious adversary, meaning that the future sequence of edge insertions/deletions in the graph cannot depend in any way on the algorithm’s past output. A natural way to remove the assumption on oblivious adversary is to give a deterministic dynamic algorithm for the same problem in O(1) update time. In this paper, we resolve this question. We present a new deterministic fully dynamic algorithm that maintains a O(1)-approximate minimum vertex cover and maximum fractional matching, with an amortized update time of O(1). Previously, the best deterministic algorithm for this problem was due to Bhattacharya et al. (in: Proceedings of the ACM-SIAM symposium on discrete algorithms (SODA), 2015); it had an approximation ratio of \\((2+\\varepsilon )\\) and an amortized update time of \\(O(\\log n/\\varepsilon ^2)\\). Our result can be generalized to give a fully dynamic \\(O(f^3)\\)-approximate algorithm with \\(O(f^2)\\) amortized update time for the hypergraph vertex cover and fractional hypergraph matching problem, where every hyperedge has at most f vertices.","authors":["Sayan Bhattacharya","Deeparnab Chakrabarty","Monika Henzinger"],"meta":["April 2020Algorithmica 82(3)","DOI:10.1007/s00453-019-00630-4"],"references":["301268186_Faster_Fully_Dynamic_Matchings_with_Small_Approximation_Ratios","330097518_Deterministically_Maintaining_a_2_-Approximate_Minimum_Vertex_Cover_in_O_1_2_Amortized_Update_Time","325888040_Deterministic_Fully_Dynamic_Data_Structures_for_Vertex_Cover_and_Matching","321180654_Fully_Dynamic_Almost-Maximal_Matching_Breaking_the_Polynomial_Barrier_for_Worst-Case_Time_Bounds","321160844_Dynamic_Matching_Reducing_Integral_Algorithms_to_Approximately-Maximal_Fractional_Algorithms","317639388_Online_and_dynamic_algorithms_for_set_cover","312078356_Fully_Dynamic_Approximate_Maximum_Matching_and_Minimum_Vertex_Cover_in_O_log_3_n_Worst_Case_Update_Time","303901466_New_Deterministic_Approximation_Algorithms_for_Fully_Dynamic_Matching","303226307_Lower_Bounds_for_Dynamic_Connectivity","301818009_Fully_Dynamic_Maximal_Matching_in_Constant_Update_Time"]}