{"id":"336111549_Multi-requests_satisfied_based_on_energy_optimization_for_the_service_composition_in_wireless_sensor_network","abstract":"Wireless sensor network based on service-oriented architecture has provided important support for Internet of Things in smart city; therefore, multi-requests can be satisfied through service composition. However, as the number and complexity of requests increase, the dynamic and low energy of sensors in wireless sensor network gradually limit the development of the service-oriented architecture in Internet of Things; therefore, optimizing energy under the condition that multi-requests can be satisfied in the dynamic wireless sensor network becomes an important problem. To address this challenge, first, this paper analyzes the mobility of sensors to predict the path stability and manage the information and capabilities on them so that we can find the satisfactory service provider candidates. Then, this article proposes a service mapping pre-process to achieve the work flow reduction in a service layer to save energy in advance and a service mapping process to find the optimal sensors in a network layer that can satisfy the requests. Simulation results show that our strategies can achieve the goal of energy conservation, load balancing, and network lifetime extension under the premise of guaranteeing requests function and non-function attributes and have better performance than traditional ones.","authors":["Cong Du","Sujie Shao","Feng Qi","Luoming Meng"],"meta":["September 2019International Journal of Distributed Sensor Networks 15(9):155014771987904","DOI:10.1177/1550147719879049"],"references":["319640291_Automated_Holistic_Service_Composition_Modeling_and_Composition_Reasoning_Techniques","304365379_ADDSEN_Adaptive_Data_Processing_and_Dissemination_for_Drone_Swarms_in_Urban_Sensing","295833416_Mobility-Aware_Service_Composition_in_Mobile_Communities","329262667_Towards_Distributed_SDN_Mobility_Management_and_Flow_Scheduling_in_Software_Defined_Urban_IoT","325731320_Modeling_and_Analysis_of_Data_Aggregation_From_Convergecast_in_Mobile_Sensor_Networks_for_Industrial_IoT","319869763_Energy-Efficient_Optimization_for_Concurrent_Compositions_of_WSN_Services","319607606_Integrating_Events_into_SOA_for_IoT_Services","319495680_Energy-Aware_Service_Selection_and_Adaptation_in_Wireless_Sensor_Networks_with_QoS_Guarantee","295833111_Goal-Driven_Service_Composition_in_Mobile_and_Pervasive_Computing","291015498_RESTful_Service_Composition_at_a_Glance_a_Survey"]}