{"id":"336121936_Emerging_Big_Data_Sources_for_Public_Transport_Planning_A_Systematic_Review_on_Current_State_of_Art_and_Future_Research_Directions","abstract":"The rapid advancement of information and communication technology has brought a revolution in the domain of public transport (PT) planning alongside other areas of transport planning and operations. Of particular significance are the passively generated big data sources (e.g., smart cards, detailed vehicle location data, mobile phone traces, social media) which have started replacing the traditional surveys conducted onboard, at the stops/stations and/or at the household level for gathering insights about the behavior of the PT users. This paper presents a systematic review of the contemporary research papers related to the use of novel data sources in PT planning with particular focus on (1) assessing the usability and potential strengths and weaknesses of different emerging big data sources, (2) identifying the challenges and highlighting research gaps. Reviewed articles were categorized based on qualitative pattern matching (similarities/dissimilarities) and multiple sources of evidence analysis under three categories—use of big data in (1) travel pattern analysis, (2) PT modelling, and (3) PT performance assessment. The review revealed research gaps ranging from methodological and applied research on fusing different forms of big data as well as big data and traditional survey data; further work to validate the models and assumptions; lack of progress on developing more dynamic planning models. Findings of this study could inform transport planners and researchers about the opportunities/challenges big data bring for PT planning. Harnessing the full potential of the big data sources for PT planning can be extremely useful for cities in the developing world, where the PT landscape is changing more rapidly, but traditional forms of data are expensive to collect.","authors":["Khatun E Zannat","Charisma F. Choudhury"],"meta":["September 2019Journal of the Indian Institute of Science 99(2)","DOI:10.1007/s41745-019-00125-9"],"references":["343147081_Getting_the_best_of_both_worlds_a_framework_for_combining_disaggregate_travel_survey_data_and_aggregate_mobile_phone_data_for_trip_generation_modelling","331136038_Inferring_Dynamic_Origin-Destination_Flows_by_Transport_Mode_using_Mobile_Phone_Data","324906346_Estimating_city-level_travel_patterns_using_street_imagery_A_case_study_of_using_Google_Street_View_in_Britain","331444805_The_equity_and_spatial_implications_of_transit_fare","331244957_Transport_mode_detection_based_on_mobile_phone_network_data_A_systematic_review","331150832_Evaluating_the_effects_of_public_transport_fare_policy_change_and_built_and_non-built_environment_features_on_ridership_The_case_in_South_East_Queensland_Australia","330061220_Data-driven_stochastic_transit_assignment_modeling_using_an_automatic_fare_collection_system","328610375_Access_and_egress_times_to_high-speed_rail_stations_a_spatiotemporal_accessibility_analysis","327994427_A_robust_method_for_estimating_transit_passenger_trajectories_using_automated_data","326263718_Modelling_passenger_waiting_time_using_large-scale_automatic_fare_collection_data_An_Australian_case_study"]}