{"id":"336113153_Practical_figures_of_merit_and_thresholds_for_entanglement_distribution_in_quantum_networks","abstract":"Before global-scale quantum networks become operational, it is important to consider how to evaluate their performance so that they can be built to achieve the desired performance. We propose two practical figures of merit for the performance of a quantum network: the average connection time and the average largest entanglement cluster size. These quantities are based on the generation of elementary links in a quantum network, which is a crucial initial requirement that must be met before any long-range entanglement distribution can be achieved and is inherently probabilistic with current implementations. We obtain bounds on these figures of merit for a particular class of quantum repeater protocols consisting of repeat-until-success elementary link generation followed by joining measurements at intermediate nodes that extend the entanglement range. Our results lead to requirements on quantum memory coherence times, requirements on repeater chain lengths in order to surpass the repeaterless rate limit, and requirements on other aspects of quantum network implementations. These requirements are based solely on the inherently probabilistic nature of elementary link generation in quantum networks, and they apply to networks with arbitrary topology.","authors":["Sumeet Khatri","Corey T. Matyas","Aliza Siddiqui","Jonathan P. Dowling"],"meta":["September 2019Physical Review Research 1(2)","DOI:10.1103/PhysRevResearch.1.023032"],"references":["340061022_Linear_programs_for_entanglement_and_key_distribution_in_the_quantum_internet","335947009_Bounds_for_multi-end_communication_over_quantum_networks","333308064_Near-term_quantum-repeater_experiments_with_nitrogen-vacancy_centers_Overcoming_the_limitations_of_direct_transmission","333167029_End-to-end_capacities_of_a_quantum_communication_network","331423635_Entanglement_Access_Control_for_the_Quantum_Internet","331181683_Opportunistic_Entanglement_Distribution_for_the_Quantum_Internet","331031598_A_quantum_network_stack_and_protocols_for_reliable_entanglement-based_networks","330546545_Multipartite_state_generation_in_quantum_networks_with_optimal_scaling","337574914_Distributing_graph_states_over_arbitrary_quantum_networks","334043452_Towards_long-distance_quantum_networks_with_superconducting_processors_and_optical_links"]}