{"id":"336175208_Order_Acceptance_and_Scheduling_Problem_with_Carbon_Emission_Reduction_and_Electricity_Tariffs_on_a_Single_Machine","abstract":"Order acceptance and scheduling (OAS) problems are realistic for enterprises. They have to select the appropriate orders according to their capacity limitations and profit consideration, and then complete these orders by their due dates or no later than their deadlines. OAS problems have attracted significant attention in supply chain management. However, there is an issue that has not been studied well. To our best knowledge, no prior research examines the carbon emission cost and the time-of-use electricity cost in the OAS problems. The carbon emission during the on-peak hours is lower than the one in mid-peak and off-peak hours. However, the electricity cost during the on-peak hours is higher than the one during mid-peak and off-peak hours when time-of-use electricity (TOU) tariff is used. There is a trade-off between sustainable scheduling and the electricity cost. To calculate the objective value, a carbon tax and carbon dioxide emission factor are included when we evaluate the carbon emission cost. The objective function is to maximize the total revenue of the accepted orders and then subtract the carbon emission cost and the electricity cost under different time intervals on a single machine with sequence-dependent setup times and release date. This research proposes a mixed-integer linear programming model (MILP) and a relaxation method of MILP model to solve this problem. It is of importance because the OAS problems are practical in industry. This paper could attract the attention of academic researchers as well as the practitioners.","authors":["Shih-Hsin Chen","Yeong-Cheng Liou","Yi-Hui Chen","Kun-Ching Wang"],"meta":["September 2019Sustainability 11(19):5432","DOI:10.3390/su11195432"],"references":["335017372_Vehicle_Routing_and_Scheduling_Optimization_of_Ship_Steel_Distribution_Center_under_Green_Shipbuilding_Mode","334113910_Objective_scaling_ensemble_approach_for_integer_linear_programming","333119361_A_Novel_Collaborative_Optimization_Model_for_Job_Shop_Production-Delivery_Considering_Time_Window_and_Carbon_Emission","316536099_Optimization_of_Vehicle_Routing_Problem_with_Time_Windows_for_Cold_Chain_Logistics_Based_on_Carbon_Tax","323998904_Effects_of_Binary_Variables_in_Mixed_Integer_Linear_Programming_Based_Unit_Commitment_in_Large-Scale_Electricity_Markets","312991816_Multiprocessor_scheduling_with_rejection","312772565_Enhancing_Heuristics_for_Order_Acceptance_and_Scheduling_Using_Genetic_Programming","312691007_Single-machine_sustainable_production_planning_to_minimize_total_energy_consumption_and_total_completion_time_using_a_multiple_objective_genetic_algorithm","285759643_Order_Acceptance_and_Scheduling_Problems_in_Two-machine_Flow_Shops_New_Mixed_Integer_Programming_Formulations","280313305_A_Lagrangian_relaxation_algorithm_for_order_acceptance_and_scheduling_problem_A_globalised_robust_optimisation_approach"]}