{"id":"336123159_Designing_Privacy-aware_Internet_of_Things_Applications","abstract":"Internet of Things (IoT) applications typically collect and analyse personal data that can be used to derive sensitive information about individuals. However, thus far, privacy concerns have not been explicitly considered in software engineering processes when designing IoT applications. With the advent of behaviour driven security mechanisms, failing to address privacy concerns in the design of IoT applications can also have security implications. In this paper, we explore how a Privacy-by-Design (PbD) framework, formulated as a set of guidelines, can help software engineers integrate data privacy considerations into the design of IoT applications. We studied the utility of this PbD framework by studying how software engineers use it to design IoT applications. We also explore the challenges in using the set of guidelines to influence the IoT applications design process. In addition to highlighting the benefits of having a PbD framework to make privacy features explicit during the design of IoT applications, our studies also surfaced a number of challenges associated with the approach. A key finding of our research is that the PbD framework significantly increases both novice and expert software engineers’ ability to design privacy into IoT applications.","authors":["Charith Perera","Mahmoud Barhamgi","Arosha Bandara","Muhammad Ajmal"],"meta":["September 2019Information Sciences 512","DOI:10.1016/j.ins.2019.09.061"],"references":["319163993_Privacy_Guidelines_for_Internet_of_Things_A_Cheat_Sheet","308605637_Privacy_Principles_for_Sharing_Cyber_Security_Data","307967586_Privacy-by-Design_Framework_for_Assessing_Internet_of_Things_Applications_and_Platforms","280500892_Twenty_Security_Considerations_for_Cloud-Supported_Internet_of_Things","321462327_Playing_the_legal_card_using_ideation_cards_to_raise_data_protection_issues_within_the_design_process","319305968_Privacy_Impact_Assessment","318742242_Privacy-Preserving_Double-Projection_Deep_Computation_Model_With_Crowdsourcing_on_Cloud_for_Big_Data_Feature_Learning","287949825_The_Checklist_Manifesto_How_to_Get_Things_Right","278701113_IFIP_Advances_in_Information_and_Communication_Technology","274056180_Operationalizing_privacy_by_design"]}