{"id":"336113323_Building_Machine_Learning_and_Deep_Learning_Models_on_Google_Cloud_Platform_A_Comprehensive_Guide_for_Beginners","abstract":"Take a systematic approach to understanding the fundamentals of machine learning and deep learning from the ground up and how they are applied in practice. You will use this comprehensive guide for building and deploying learning models to address complex use cases while leveraging the computational resources of Google Cloud Platform.\nAuthor Ekaba Bisong shows you how machine learning tools and techniques are used to predict or classify events based on a set of interactions between variables known as features or attributes in a particular dataset. He teaches you how deep learning extends the machine learning algorithm of neural networks to learn complex tasks that are difficult for computers to perform, such as recognizing faces and understanding languages. And you will know how to leverage cloud computing to accelerate data science and machine learning deployments.\nBuilding Machine Learning and Deep Learning Models on Google Cloud Platform is divided into eight parts that cover the fundamentals of machine learning and deep learning, the concept of data science and cloud services, programming for data science using the Python stack, Google Cloud Platform (GCP) infrastructure and products, advanced analytics on GCP, and deploying end-to-end machine learning solution pipelines on GCP.\nYou will:\n\n• Understand the principles and fundamentals of machine learning and deep learning, the algorithms, how to use them, when to use them, and how to interpret your results\n• Know the programming concepts relevant to machine and deep learning design and development using the Python stack\n• Build and interpret machine and deep learning models\n• Use Google Cloud Platform tools and services to develop and deploy large-scale machine learning and deep learning products\n• Be aware of the different facets and design choices to consider when modeling a learning problem\n• Productionalize machine learning models into software products","authors":["Ekaba Bisong"],"meta":["January 2019","DOI:10.1007/978-1-4842-4470-8","ISBN: 978-1-4842-4469-2"],"references":[]}