{"id":"336182068_Cognitive_machine_learning_model_for_network_information_safety","abstract":"The problem of network information security has resulted in a significant increase in economic losses, resulting in an increase in the energy loss of learning resource scheduling in situational cognitive learning networks. In order to improve the scheduling ability of learning resources in networks, a situational cognitive learning model based on network information security is proposed. Considering the limitation of data packet delay in attenuation channel, the link equilibrium configuration condition of learning resource scheduling output is obtained. Based on this, a situational cognitive learning network security situation assessment model is constructed to reflect the security situation in learning scheduling system and the degree of harm to the system. Based on the inertia weight of learning resources output, the data flow model of learning resources in situational cognitive learning network is constructed, and the sharing security settings of situational cognitive learning network resources are realized by combining the network security situation assessment model. Optimize the cognitive learning mode network, select the candidate nodes that meet the conditions as Sink nodes, and take the initial energy of the nodes as the constraint index, carry out the learning path planning of Situational Cognition under network information security, realize the optimization of learning resource scheduling, and complete the construction of situational cognitive learning mode. The simulation results show that this method is applied to secure scheduling of learning resources in situational cognitive learning network, can reduce the energy consumption of network nodes, improve the survival probability of situational cognitive learning nodes, maximize the benefits of balanced control of learning resources, reduce economic losses and optimize the situational cognitive learning model.","authors":["Xinwen Bi","Xiaodan Shi","Zeliang Zhang"],"meta":["October 2019Safety Science 118(4):435-441","DOI:10.1016/j.ssci.2019.05.032"],"references":["322704581_A_Knowledge_Conversion_Model_Based_on_the_Cognitive_Load_Theory_for_Architectural_Design_Education","320366926_A_Deep_Learning_Approach_for_Intrusion_Detection_Using_Recurrent_Neural_Networks","317510211_Chapter_34_The_Construction_of_Perceptual_and_Semantic_Features_During_Category_Learning","314029339_Sensory_neural_pathways_revisited_to_unravel_the_temporal_dynamics_of_the_Simon_effect_A_model-based_cognitive_neuroscience_approach","312465969_Two-Stage_Hybrid_Extreme_Learning_Machine_for_Sequential_Imbalanced_Data","305922447_Analyzing_the_knowledge_construction_and_cognitive_patterns_of_blog-based_instructional_activities_using_four_frequent_interactive_strategies_problem_solving_peer_assessment_role_playing_and_peer_tuto"]}