{"id":"336198477_ACTUALITY_OF_IMPLEMENTATION_OF_EDUCATIONAL_ROBOTICS_IN_UKRAINIAN_SCHOOL","abstract":"The paper considers the questions of substantiation of relevance of educational robotics implementation in the learning process of Ukrainian schools. The current state of development of robotics as an applied field and as an educational trend is analyzed to solve the research problems. The analysis of the global trends in the development of robotics as an applied field has shown that robotics is one of the most intensively developing fields of science and technology. This leads to the conclusion that there is a need to train relevant specialists and to update the curriculum in school and university education according to the daily requirements. Therefore, the issue of robotics implementation into the learning process of secondary and higher education institutions as an obligatory component of training of future specialists in robotics and future robotics teachers is of particular importance. The analysis of the robotics development as an educational trend has shown that educational robotics is one of the most perspective and popular trends in STEM education. In addition, it is determined that learning via robotics provides students with the opportunity to solve real life problems that require knowledge of STEM subjects. Based on previous research, the author also clarifies the concept of educational robotics, substantiates the aim and main tasks of its implementation into the educational process of educational institutions, which, as a consequence, leads to the importance of solving the issue of training future robotics teachers. The paper also presents and analyzes the results of the conducted research among educators and scientists on determining the state of teaching of robotics in Ukrainian schools. Based on the obtained results, we can conclude that there is a need to implement of the educational robotics into the learning process of secondary education institutions as a compulsory component of the school curriculum. In particular, possible ways of implementation of the educational robotics in Ukrainian schools are defined.","authors":["Oksana Strutynska"],"meta":["September 2019OPEN EDUCATIONAL E-ENVIRONMENT OF MODERN UNIVERSITY","DOI:10.28925/2414-0325.2019s30","Project: Educational robotics"],"references":["332436047_Development_Trends_Of_The_Educational_Robotics_In_Out-Of-School_Institutions","330471205_Educational_robotics_as_a_prospective_trend_in_stem-education_development","323941723_Systematic_Review_of_Research_Trends_in_Robotics_Education_for_Young_Children","307864150_Design_Principles_for_Industrie_40_Scenarios_A_Literature_Review","300409325_Design_Principles_for_Industrie_40_Scenarios"]}