{"id":"336126282_Fessakis_G_Komis_V_Dimitracopoulou_A_Prantsoudi_St_2019_Overview_of_the_Computer_Programming_Learning_Environments_for_primary_education_Review_of_Science_Mathematics_and_ICT_Education_Re_S_M_ICT_E_ju","abstract":"Over the past decade, the assessment of the general educational value of computer programming and computational thinking has been constantly increasing and, as a result, they are introduced to increasingly younger ages. In parallel, educational programming environments are significantly progressing, providing a variety of options for different ages. This paper presents an overview of the modern learning programming environments for primary education and proposes a classification system with categories corresponding to the technological and educational dimensions of the area. The paper aims to support teachers in learning design for the interdisciplinary approach of programming and the development of computational thinking. KEY WOrDs Educational programming languages, taxonomy, learning design, computational thinking, coding for learning\n\nrésumé Au cours des dix dernières années, l'évaluation de la valeur éducative de la programmation informatique et de la pensée informatique s'est constamment accrue et, par conséquent, elles ont été introduites à des âges de plus en plus jeunes. Parallèlement, les environnements de programmation éducatifs progressent considérablement, offrant une variété d'options pour les différents âges. Cet article présente un aperçu des environnements d'apprentissage de programmation pour l'enseignement primaire et propose un système de classification avec des catégories correspondant aux dimensions technologiques et éducatives. L'article vise à soutenir les enseignants dans la conception de l'apprentissage pour une approche interdisciplinaire de la programmation et le développement de la pensée informatique. mOts-clés Langages de programmation éducationnelles, taxonomie, ingénierie d'apprentissage, pensée informatique, codage pour apprendre","authors":["Georgios Fesakis","Vassilis Komis","Angelique Dimitracopoulou","Stavroula Prantsoudi"],"meta":["January 2019"],"references":["329773226_A_Scenario-Based_Approach_for_Designing_Educational_Robotics_Activities_for_Co-creative_Problem_Solving","292321547_STEM_Good_jobs_now_and_for_the_future","282538886_Constructing_the_ScratchJr_programming_language_in_the_early_childhood_classroom","276466451_Physical_Computing_and_its_Scope_-_Towards_a_Constructionist_Computer_Science_Curriculum_with_Physical_Computing","329654173_Changing_Minds_Computers_Learning_and_Literacy","327029304_Exploring_the_Scope_and_the_Conceptualization_of_Computational_Thinking_at_the_K-12_Classroom_Level_Curriculum_Foundations_and_Research_Highlights","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","321402901_Tips_for_creating_a_block_language_with_blockly","321356131_Building_tools_to_help_students_learn_to_program","308605679_Ten_things_we've_learned_from_Blockly","270606116_Programming_by_choice","259668770_Framework_for_Computer_Programming_in_Preschool_and_Kindergarten","257171388_Problem_solving_by_5-6_years_old_kindergarten_children_in_a_computer_programming_environment_A_case_study","242608727_Log_on_education_teaching_the_nintendo_generation_to_program","242231252_The_New_Educational_Imperative_Improving_High_School_Computer_Science_Education"]}