{"id":"336241558_Order-encoded_quantum_image_model_and_parallel_histogram_specification","abstract":"In this paper, the new quantum image representation model OQIM is proposed to provide a representation for digital images on quantum computers in the form of a normalized state. The newly proposed quantum image representation OQIM uses the basis state of a qubit sequence to store the ascending order of each pixel according to their gray values’ magnitude for the first time. Then OQIM uses the amplitude probability of a qubit to store the color and uses the amplitude probability of another qubit to store the coordinate position. Based on the OQIM, the mOQIM is proposed as well, which encodes more digital images via one model. Compared with other quantum image models, the OQIM effectively encodes the information of the histogram of the images. Based on the OQIM and the mOQIM, the histogram specification of two images and even the parallel histogram specification at the same time for multiple images are discussed. Experiments and theoretical analysis show that the proposed OQIM quantum image model is more flexible and better suited for histogram specification, histogram equalization and other similar image enhancement method such as luminance correction and so on than the existing models.","authors":["Guanlei Xu","Xiaogang Xu","Xun Wang","Xiaotong Wang"],"meta":["October 2019Quantum Information Processing 18(11)","DOI:10.1007/s11128-019-2463-7"],"references":["330115924_Quantum_Image_Encryption_Based_on_Henon_Mapping","324167463_Multilayer_Complex_Network_Descriptors_for_Color-Texture_Characterization","311962365_A_novel_quantum_representation_of_color_digital_images","304026617_Quantum_Image_Location","303698297_Quantum_Image_Matching","332001389_A_weighted_multiple_classifier_framework_based_on_Random_Projection","330193215_Review_of_methods_of_image_segmentation_based_on_quantum_mechanics","327850482_A_Quantum_Image_Representation_Based_on_Bitplanes","326562895_Quantum_Implementation_Circuits_of_Quantum_Signal_Representation_and_Type_Conversion","291942453_Simulating_Physics_with_Computers"]}