{"id":"336208891_Security_Risks_in_the_Software_Development_Lifecycle","abstract":"Security is a significant concern in software development. Risks and errors should be reduced and as much as possible eliminated. Especially with how the computer and internet provide numerous technological benefits and are being optimally utilized in the present times, users have high expectations when it comes to secure software products. The development cycle in software design is comprised of a systematic process wherein security risk assessment should be integrated into each phase. In order to ensure quality software with a high level of security, the best practices in risk management should be implemented from the beginning and should be performed throughout the process. While developing highly secure software is a complex task, therefore, it must involve more dedicated security activities that are usually ignored in traditional SDLC. In this paper, the nature and phases of secure software development will be discussed as well as the security risk assessment models and practices involved in it. This will provide software developers, programmers, or engineers the awareness on secure software development cycle which will allow them to plan efficient strategies and enhance their performance, thus, resulting in quality and reliable output. In addition, we present a qualitative study looking at real-life practice employed towards software security risk. We reflect on how well current risk practices follow best practice, identify pitfalls, and explore why these occur & mitigate.","authors":["Mamdouh Alenezi","Sadiq Almuairfi"],"meta":["September 2019International Journal of Recent Technology and Engineering 8(3):7048 - 7055","DOI:10.35940/ijrte.C5374.098319","Project: Software Security"],"references":["344221556_Effects_of_Software_Security_on_Software_Development_Life_Cycle_and_Related_Security_Issues","329726569_STORE_Security_Threat_Oriented_Requirements_Engineering_Methodology","328693776_Major_software_security_risks_at_design_phase","327417111_Security_in_the_Software_Development_Lifecycle","324498215_Model-based_Security_Engineering_for_Secure_Systems_Development_-_An_approach_for_Software_Engineering","312159452_Business_Continuity_Management_Disaster_Recovery_Capabilities_in_Saudi_Arabia_ICT_Businesses","311233381_SOFTWARE_ENGINEERING_ARCHITECTURE_DESIGN_AND_FRAMEWORKS","310471907_The_practice_of_secure_software_development_in_SDLC_an_investigation_through_existing_model_and_a_case_study_The_practice_of_secure_software_development_in_SDLC","334482693_Managing_the_Secure_Software_Development","323195760_A_Critical_Analysis_of_Software_Risk_Management_Techniques_in_Large_Scale_Systems"]}