{"id":"336226079_Intelligent_Secure_Communication_for_Internet_of_Things_With_Statistical_Channel_State_Information_of_Attacker","abstract":"In this paper, we investigate the power control strategy of intelligent secure communication with statistic channel state information (CSI) for Internet of Things (IoT) networks, where a transceiver and an attacker with several attack types, including silent, eavesdrop, jamming and spoofing, are considered. In order to solve the security problem that the transmitter only knows the statistical CSI of attacker, we propose a power control strategy based on Q-learning. In particular, Alice and Eve can choose their actions flexibly to maximize their reward under different system state and learn their best strategy according to the proposed strategy. In addition, the interactions between Alice and Eve are formulated as a zero-sum game, the Nash equilibrium and its existence conditions are deduced. Simulation results show that the impact of statistical CSI of attacker on system security performance can be reflected by the cost of attacker to launch attack and the average channel gain parameters. More importantly, the obtained results also show that the proposed power control strategy based on statistical CSI of attacker is worse than the scheme based on instantaneous CSI for statistical CSI leads a performance loss in terms of security.","authors":["Junjuan Xia","Yan Xu","Dan Deng","Qingfeng Zhou"],"meta":["October 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2945060"],"references":["338571251_Cache-enabled_physical-layer_secure_game_against_smart_uAV-assisted_attacks_in_b5G_NOMA_networks","338568063_Cache-aided_mobile_edge_computing_for_B5G_wireless_communication_networks","335359253_Deep_Learning-Based_Channel_Prediction_for_Edge_Computing_Networks_Toward_Intelligent_Connected_Vehicles","335080758_Security_attacks_on_smart_grid_scheduling_and_their_defences_a_game-theoretic_approach","335001084_Secure_Cache-Aided_Multi-Relay_Networks_in_the_Presence_of_Multiple_Eavesdroppers","339152990_A_MIMO_Detector_with_Deep_Learning_in_the_Presence_of_Correlated_Noise","337485798_A_Novel_Framework_of_Three-Hierarchical_Offloading_Optimization_for_MEC_in_Industrial_IoT_Networks","337422206_When_Distributed_Switch-and-Stay_Combining_Meets_Buffer_in_IoT_Relaying_Networks","333765619_Cluster_Grouping_and_Power_Control_for_Angle-Domain_MmWave_MIMO_NOMA_Systems","333738886_An_Embedding_Cost_Learning_Framework_Using_GAN"]}