{"id":"336233549_Threshold_Extraction_Framework_for_Software_Metrics","abstract":"Software metrics are used to measure different attributes of software. To practically measure software attributes using these metrics, metric thresholds are needed. Many researchers attempted to identify these thresholds based on personal experiences. However, the resulted experience-based thresholds cannot be generalized due to the variability in personal experiences and the subjectivity of opinions. The goal of this paper is to propose an automated clustering framework based on the expectation maximization (EM) algorithm where clusters are generated using a simplified 3-metric set (LOC, LCOM, and CBO). Given these clusters, different threshold levels for software metrics are systematically determined such that each threshold reflects a specific level of software quality. The proposed framework comprises two major steps: the clustering step where the software quality historical dataset is decomposed into a fixed set of clusters using the EM algorithm, and the threshold extraction step where thresholds, specific to each software metric in the resulting clusters, are estimated using statistical measures such as the mean (μ) and the standard deviation (σ) of each software metric in each cluster. The paper’s findings highlight the capability of EM-based clustering, using a minimum metric set, to group software quality datasets according to different quality levels.","authors":["Mohammed Alqmase","Mohammad Alshayeb","Lahouari Ghouti"],"meta":["September 2019Journal of Computer Science and Technology 34(5):1063-1078","DOI:10.1007/s11390-019-1960-6","Project: Artificial Intelligence and Machine Learning Applications in Software Engineering"],"references":["337676095_Comparison_the_various_clustering_algorithms_of_weka_tools","316922118_An_Investigation_of_the_Relationships_between_Lines_of_Code_and_Defects","293173843_Comparison_of_the_various_clustering_algorithms_of_weka_tools","282312104_Detecting_Code_Smells_in_Software_Product_Lines-An_Exploratory_Study","260231872_An_Empirical_Study_on_Software_Defect_Prediction_with_Simplified_Metric_Set","313755128_Applying_design-metrics_to_object-oriented_frameworks","312600993_Towards_identifying_software_project_clusters_with_regard_to_defect_prediction","307822399_A_Method_to_Derive_Metric_Thresholds_for_Software_Product_Lines","305296096_Towards_a_Metrics_Suite_for_Object_Oriented_Design","303515565_TDTool_Threshold_Derivation_Tool"]}