{"id":"336223874_Highly-Sensitive_Phase_and_Frequency_Noise_Measurement_Technique_Using_Bayesian_Filtering","abstract":"Spectral purity of laser sources is typically investigated using phase or frequency noise measurements, which require extraction of the optical phase. This is a challenging task if the signal–to–noise–ratio (SNR) of the spectral line or the linewidth–to–noise–ratio (LNR) are not sufficiently high. In this letter, we present a statistically optimal method for optical phase noise measurement that relies on coherent detection and Bayesian filtering. The proposed method offers a record sensitivity, as the optical phase is measured at a signal power of −75 dBm (SNR of −11 dB in 1.1 GHz receiver bandwidth). Practically, this means that the phase noise measurements are, up to a high–degree, not limited by the measurement noise floor. This allows measurements down to −200 dB rad\n<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">2</sup>\n/Hz and up to 10 GHz, which is useful when measuring the Schawlow–Townes (quantum noise limited) laser linewidth. Finally, the estimated optical phase is highly accurate allowing for quantum limited signal demodulation. The method thus holds the potential to become a reference measurement tool.","authors":["Darko Zibar","HounMan Chin","Tong Yeyu","Nitin Jain"],"meta":["October 2019IEEE Photonics Technology Letters PP(99):1-1","DOI:10.1109/LPT.2019.2945051"],"references":["308896335_Photonic_microwave_signals_with_zeptosecond_level_absolute_timing_noise","333460241_High-power_sub-kHz_linewidth_lasers_fully_integrated_on_silicon","315318034_Phase_noise_characterization_of_sub-hertz_linewidth_lasers_via_digital_cross_correlation","310673350_Time-dependent_laser_linewidth_Beat-note_digital_acquisition_and_numerical_analysis","289187094_Machine_Learning_Techniques_in_Optical_Communication","267104507_Accurate_frequency_noise_measurement_of_free-running_lasers","259390620_Bayesian_Filtering_and_Smoothing"]}