{"id":"336201847_Virtual_Display_System_of_Geological_Body_Based_on_Key_Algorithms_of_Three-dimensional_Modelling","abstract":"In order to study the virtual display system of geological body, the key algorithm of three-dimensional modelling is used to analyze it, and the virtual display scheme of geological body is realized. Three-dimensional modelling of geological bodies is a frontier field of current geoscience research, and also a hot issue in computer science. Its research can complement and improve the theoretical basis of virtual reality technology and expand its application fields. Geological body three-dimensional modelling software can meet the needs of geoscientists to study geological problems more effectively from three-dimensional space, and has considerable practical value. In the network environment, users' information needs are diversified and individualized, and special attention is paid to the breadth, novelty and timeliness of information. Faced with massive information resources, the information users need is a drop in the ocean in the huge and disorderly network information space. Users need to spend a lot of time and energy to find valuable information in all kinds of uniform systems. Traditional system information services can no longer help users effectively get rid of information overload and information lost. Therefore, the concept of personalized service system has become a hot spot of people' s attention as soon as it is put forward. In recent years, personalized systems have emerged in endlessly. In the early stage of formulation and implementation of personalized service strategy, the existing personalized service generally lacks the attention to context information such as user' s environment. There are weak links in personalization and intellectualization of service, which damages user experience. Therefore, Shepard algorithm and Kriging algorithm of three-dimensional modelling are used to study the virtual display system of geological bodies. The results show that these two key algorithms play a very important role in the research process of geological virtual display system, and also provide a new idea for further research on the popularization of geological knowledge.","authors":["Wei Feng"],"meta":["July 2019Earth Sciences Research Journal 23(3):185-189","DOI:10.15446/esrj.v23n3.81809"],"references":["324477350_An_interactive_clothing_design_and_personalized_virtual_display_system","319661913_Drone-Aided_Communication_as_a_Key_Enabler_for_5G_and_Resilient_Public_Safety_Networks","308716551_A_Simple_Fast_and_Highly-Accurate_Algorithm_to_Recover_3D_Shape_from_2D_Landmarks_on_a_Single_Image","345700052_Tunnel_stability_assessment_by_3D_DDA-key_block_analysis","322543452_Postural_stability_and_simulator_sickness_after_walking_on_a_treadmill_in_a_virtual_environment_with_a_curved_display","322180720_An_alternative_algorithm_of_tunnel_piston_effect_by_replacing_three-dimensional_model_with_two-dimensional_model","312479956_Effects_of_Different_Types_of_Virtual_Reality_Display_on_Presence_and_Learning_in_a_Safety_Training_Scenario","248135016_The_parallel_3D_magnetotelluric_forward_modeling_algorithm","222990533_A_3D_simplification_algorithm_for_distributed_visualization"]}