{"id":"336278268_MIMETIC_Mobile_Encrypted_Traffic_Classification_using_Multimodal_Deep_Learning","abstract":"Mobile Traffic Classification (TC) has become nowadays the enabler for valuable profiling information, other than being the workhorse for service differentiation or blocking. Nonetheless, a main hindrance in the design of accurate classifiers is the adoption of encrypted protocols, compromising the effectiveness of deep packet inspection. Also, the evolving nature of mobile network traffic makes solutions with Machine Learning (ML), based on manually-and expert-originated features, unable to keep its pace. These limitations clear the way to Deep Learning (DL) as a viable strategy to design traffic classifiers based on automatically-extracted features, reflecting the complex patterns distilled from the multifaceted traffic nature, implicitly carrying information in \"multi-modal\" fashion. Multi-modality in TC allows to inspect the traffic from complementary views, thus providing an effective solution to the mobile scenario. Accordingly, a novel multimodal DL framework for encrypted TC is proposed, named MIMETIC, able to capitalize traffic data heterogeneity (by learning both intra-and inter-modality dependences), overcome performance limitations of existing (myopic) single-modality DL-based TC proposals, and support the challenging mobile scenario. Using three (human-generated) datasets of mobile encrypted traffic, we demonstrate performance improvement of MIMETIC over (a) single-modality DL-based counterparts, (b) state-of-the-art ML-based (mobile) traffic classifiers, and (c) classifier fusion techniques.","authors":["Giuseppe Aceto","Domenico Ciuonzo","Antonio Montieri","Antonio Pescapè"],"meta":["October 2019Computer Networks 165","DOI:10.1016/j.comnet.2019.106944","Project: Mobile and Encrypted Traffic Classification"],"references":["331425885_Byte_Segment_Neural_Network_for_Network_Traffic_Classification","331272016_A_Novel_QUIC_Traffic_Classifier_Based_on_Convolutional_Neural_Networks","330882145_Mobile_Encrypted_Traffic_Classification_Using_Deep_Learning_Experimental_Evaluation_Lessons_Learned_and_Challenges","328176051_Eavesdropping_on_Fine-Grained_User_Activities_Within_Smartphone_Apps_Over_Encrypted_Network_Traffic","327921741_DataNet_Deep_Learning_based_Encrypted_Network_Traffic_Classification_in_SDN_Home_Gateway","325217580_Mobile_Encrypted_Traffic_Classification_Using_Deep_Learning","324114179_Automatic_Multi-task_Learning_System_for_Abnormal_Network_Traffic_Detection","323204848_Deep_learning_for_malicious_flow_detection","322814093_Discovering_Periodic_Patterns_for_Large_Scale_Mobile_Traffic_Data_Method_and_Applications","322515767_Seq2Img_A_sequence-to-image_based_approach_towards_IP_traffic_classification_using_convolutional_neural_networks"]}