{"id":"336278814_Integration_of_Emerging_Technologies_in_Teaching_and_Learning_Process_in_Nigeria_the_challenges","abstract":"The evolution of Emerging Technologies (ETs) is changing all facets of educational process ranging from; the nature of classrooms, quality of content, methodologies, mode of students' engagement, and evaluation. The integration of emerging technologies in teaching and learning process increase the interest of learners, and the quality of outcome in educational process. It brings about innovations, creativity, and flexibility to learning, thereby equipping both the educators and the learners with necessary problem solving and survival skills in a digital world. However, despite the enormous benefits of emerging technologies, its integration in teaching and learning process is often hampered by number of factors which directly or indirectly affects the integration process. The study examines the various challenges that obstruct the integration of emerging technologies in teaching and learning process in Nigeria. Data were collected through structured questionnaires, in addition to secondary data generated for review of literature. A total of two hundred (200) questionnaires were administered to respondents that consist of educators and students selected from both public and private secondary schools and tertiary institutions with similar level of infrastructures in Southwestern Nigeria. The collected data were later analyzed using descriptive statistics. The results show that majority of the respondents agrees that the integration of emerging technologies in teaching and learning process brings inspiration and modernization to education, enhance inclusiveness, and promotes the achievement of teaching and learning objectives. In addition, the findings proved that the integration of ETs in teaching learning process are often constrained by number of challenges which includes: epileptic power supply, insufficient skills, availability and accessibility issues, funding, inadequate professional development, and poor internet connectivity. The study concluded that educators at all levels of education should continue to update their knowledge and skills on how best to integrate emerging technologies in the teaching and learning process.","authors":["Edeh Michael Onyema"],"meta":["August 2019","Projects: ALL RESEARCHERS WELCOME GLOBAL PLATFORMJournal Article"],"references":["330693514_The_impact_of_emerging_technologies_on_work_a_review_of_the_evidence_and_implications_for_the_human_resource_function","324860589_Opportunities_and_Challenges_to_Use_ICT_in_Government_School_Education_of_Nepal","317265809_Emerging_Technologies_ETs_in_Education_A_Systematic_Review_of_the_Literature_Published_between_2006_and_2016","314489712_Information_Technology_and_Its_Impact_on_Job_Behavior","257714381_The_Impact_of_Information_Technology_in_Banking_System_A_Case_Study_in_Bank_Keshavarzi_IRAN","6401258_Emerging_Technologies_in_Education_and_Training_Applications_for_the_Laboratory_Animal_Science_Community","332703384_Emerging_technologies_as_pedagogical_tools_for_teaching_and_learning_science_A_literature_review","289318140_Emerging_Educational_Technologies_and_Research_Directions","276835949_Comparing_Virtual_and_Physical_Robotics_Environments_for_Supporting_Complex_Systems_and_Computational_Thinking","264844719_TECHNOLOGICAL_CHANGE_AND_EMPLOYEE_PERFORMANCE_IN_SELECTED_MANUFACTURING_INDUSTRY_IN_LAGOS_STATE_OF_NIGERIA"]}