{"id":"336238171_An_Efficient_Data_Transmission_with_GSM-MPAPM_Modulation_for_an_Indoor_VLC_System","abstract":"As an emerging wireless communication technique, visible light communication is experiencing a boom in the global communication field, and the dream of accessing to the Internet with light is fast becoming a reality. The objective of this study was to put forward an efficient and theoretical scheme that is based on generalized spatial modulation to reduce the bit error ratio in indoor short-distance visible light communication. The scheme was implemented while using two steps in parallel: (1) The multi-pulse amplitude and the position modulation signal were generated by combining multi-pulse amplitude modulation with multi-pulse position modulation using transmitted information, and (2) certain light-emitting diodes were activated by employing the idea of generalized spatial modulation to convey the generated multi-pulse amplitude and position modulation optical signals. Furthermore, pulse width modulation was introduced to achieve dimming control in order to improve anti-interference ability to the ambient light of the system. The two steps above involved the information theory of communication. An embedded hardware system, which was based on the C8051F330 microcomputer and included a transmitter and a receiver, was designed to verify the performance of this new scheme. Subsequently, the verifiability experiment was carried out. The results of this experiment demonstrated that the proposed theoretical scheme of transmission was feasible and could lower the bit error ratio (BER) in indoor short-distance visible light communication while guaranteeing indoor light quality.","authors":["Bao","Hsu","Tu"],"meta":["October 2019Symmetry 11(10):1232","DOI:10.3390/sym11101232"],"references":["331266843_Theoretical_Analysis_of_Optical_Spatial_Multiple_Pulse_Position_Modulation","319691632_Visible_Light_Communication_Based_On_Offset_Pulse_Position_Modulation_Offset-PPM_Using_High_Power_LED","261316177_Performance_Analysis_for_Generalised_Spatial_Modulation","330540115_Performance_Evaluation_of_VPPM_Visible_Light_Communications_Based_on_Simulation_with_Experiment's_Parameters","315472915_Generalized_Spatial_Pulse_Position_Modulation_for_Optical_Wireless_Communications","313450611_Adaptive_M-PAM_for_Multiuser_MISO_Indoor_VLC_Systems","312933615_Joint_Dimming_and_Communication_Design_for_Visible_Light_Communication","276074634_Exploiting_entire_GSSK_antenna_combinations_in_MIMO_systems","264625381_An_optimum_DC-biasing_for_DCO-OFDM_system","260360641_Multi-LED_Phase-Shifted_OOK_Modulation_Based_Visible_Light_Communication_Systems"]}