{"id":"336250184_Game_theory_of_vaccination_and_depopulation_for_managing_livestock_diseases_and_zoonoses_on_small-scale_farms","abstract":"Livestock producers adapt their farm management to epidemiological risks in different ways, through veterinary interventions but also by modulating their farm size and the removal rate of animals. The objective of this theoretical study was to elucidate how these behavioral adaptations may affect the epidemiology of highly-pathogenic avian influenza in domestic poultry and the outcome of the implemented control policies. We studied a symmetric population game where the players are broiler poultry farmers at risk of infection and where the between-farms disease transmission is both environmental and mediated by poultry trade. Three types of farmer behaviors were modelled: vaccination, depopulation, and cessation of poultry farming. We found that the transmission level of the disease through trade networks has strong qualitative effects on the system's epidemiological-economic equilibria. In the case of low trade-based transmission, when the monetary cost of infection is high, depopulation behavior can maintain a stable disease-free equilibrium. In addition, vaccination behavior can lead to eradication by private incentives alone - an outcome not seen for human diseases. In a scenario of high trade-based transmission, depopulation behavior has perverse epidemiological effects as it accelerates the spread of disease via poultry trade. In this situation, state interventions should focus on making vaccination technologies available at a low price rather than penalizing infected farms.","authors":["Alexis Delabouglise","Maciej F. Boni"],"meta":["October 2019Epidemics 30:100370","DOI:10.1016/j.epidem.2019.100370"],"references":["333833251_Poultry_population_dynamics_and_mortality_risks_in_smallholder_farms_of_the_Mekong_river_delta_region","319210771_A_Stakeholder_Survey_on_Live_Bird_Market_Closures_Policy_for_Controlling_Highly_Pathogenic_Avian_Influenza_in_Vietnam","318602378_No_Evidence_of_On-farm_Circulation_of_Avian_Influenza_H5_Subtype_in_Ca_Mau_Province_Southern_Vietnam_March_2016_-_January_2017","318532124_Economic_factors_influencing_zoonotic_disease_dynamics_Demand_for_poultry_meat_and_seasonal_transmission_of_avian_influenza_in_Vietnam","314715598_Insight_into_live_bird_markets_of_Bangladesh_An_overview_of_the_dynamics_of_transmission_of_H5N1_and_H9N2_avian_influenza_viruses","303981711_The_Impact_of_Farmers'_Strategic_Behavior_on_the_Spread_of_Animal_Infectious_Diseases","298737396_Market_analyses_of_livestock_trade_networks_to_inform_the_prevention_of_joint_economic_and_epidemiological_risks","279808016_The_Perceived_Value_of_Passive_Animal_Health_Surveillance_The_Case_of_Highly_Pathogenic_Avian_Influenza_in_Vietnam","331302639_Modeling_Infectious_Diseases_in_Humans_and_Animals","281363754_A_game_theoretic_approach_to_valuating_toxoplasmosis_vaccination_strategies"]}