{"id":"336304381_An_Optimized_Architecture_of_Image_Classification_Using_Convolutional_Neural_Network","abstract":"The convolutional neural network (CNN) is the type of deep neural networks which has been widely used in visual recognition. Over the years, CNN has gained lots of attention due to its high capability to appropriately classifying the images and feature learning. However, there are many factors such as the number of layers and their depth, number of features map, kernel size, batch size, etc. They must be analyzed to determine how they influence the performance of network. In this paper, the performance evaluation of CNN is conducted by designing a simple architecture for image classification. We evaluated the performance of our proposed network on the most famous image repository name CIFAR-10 used for the detection and classification task. The experiment results show that the proposed network yields the best classification accuracy as compared to existing techniques. Besides, this paper will help the researchers to better understand the CNN models for a variety of image classification task. Moreover, this paper provides a brief introduction to CNN, their applications in image processing, and discuss recent advances in region-based CNN for the past few years.","authors":["Muhammad Aamir","Ziaur Rahman","Waheed Abro","Muhammad Tahir"],"meta":["October 2019International Journal of Image, Graphics and Signal Processing 11(10):30-39","DOI:10.5815/ijigsp.2019.10.05"],"references":["335611350_Deep_Reinforcement_Learning_for_VQA","327752995_A_Hybrid_Approach_for_Object_Proposal_Generation","323203913_A_framework_for_fast_automatic_image_cropping_based_on_deep_saliency_map_detection_and_gaussian_filter","319253577_Understanding_of_a_Convolutional_Neural_Network","328868532_Pose_Estimation_Using_Convolutional_Neural_Network_with_Synthesis_Depth_Data","323530855_Fast_multi-object_tracking_using_convolutional_neural_networks_with_tracklets_updating","322782945_Text_Detection_by_Faster_R-CNN_with_Multiple_Region_Proposal_Networks","322060558_Deformable_Convolutional_Networks","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}