{"id":"336372914_Consumer_health_information_and_question_answering_helping_consumers_find_answers_to_their_health-related_information_needs","abstract":"Objective: \nConsumers increasingly turn to the internet in search of health-related information; and they want their questions answered with short and precise passages, rather than needing to analyze lists of relevant documents returned by search engines and reading each document to find an answer. We aim to answer consumer health questions with information from reliable sources.\n\nMaterials and methods: \nWe combine knowledge-based, traditional machine and deep learning approaches to understand consumers' questions and select the best answers from consumer-oriented sources. We evaluate the end-to-end system and its components on simple questions generated in a pilot development of MedlinePlus Alexa skill, as well as the short and long real-life questions submitted to the National Library of Medicine by consumers.\n\nResults: \nOur system achieves 78.7% mean average precision and 87.9% mean reciprocal rank on simple Alexa questions, and 44.5% mean average precision and 51.6% mean reciprocal rank on real-life questions submitted by National Library of Medicine consumers.\n\nDiscussion: \nThe ensemble of deep learning, domain knowledge, and traditional approaches recognizes question type and focus well in the simple questions, but it leaves room for improvement on the real-life consumers' questions. Information retrieval approaches alone are sufficient for finding answers to simple Alexa questions. Answering real-life questions, however, benefits from a combination of information retrieval and inference approaches.\n\nConclusion: \nA pilot practical implementation of research needed to help consumers find reliable answers to their health-related questions demonstrates that for most questions the reliable answers exist and can be found automatically with acceptable accuracy.","authors":["Dina Demner-Fushman","Yassine Mrabet","Asma Ben Abacha"],"meta":["October 2019Journal of the American Medical Informatics Association 27(4)","DOI:10.1093/jamia/ocz152"],"references":["336740921_A_question-entailment_approach_to_question_answering","335779322_On_the_Summarization_of_Consumer_Health_Questions","335382159_Bridging_the_Gap_Between_Consumers'_Medication_Questions_and_Trusted_Answers","334171572_On_the_Role_of_Question_Summarization_and_Information_Source_Restriction_in_Consumer_Health_Question_Answering","330986774_Spell_checker_for_consumer_language_CSpell","329004345_Exploring_patient_information_needs_in_type_2_diabetes_A_cross_sectional_study_of_questions","322967520_Semantic_annotation_of_consumer_health_questions","317088281_An_Ensemble_Method_for_Spelling_Correction_in_Consumer_Health_Questions","323885950_The_Unified_Medical_Language_System","318146731_A_protocol-driven_approach_to_automatically_finding_authoritative_answers_to_consumer_health_questions_in_online_resources"]}