{"id":"336327128_Recurrence_is_required_to_capture_the_representational_dynamics_of_the_human_visual_system","abstract":"The human visual system is an intricate network of brain regions that enables us to recognize the world around us. Despite its abundant lateral and feedback connections, object processing is commonly viewed and studied as a feedforward process. Here, we measure and model the rapid representational dynamics across multiple stages of the human ventral stream using time-resolved brain imaging and deep learning. We observe substantial representational transformations during the first 300 ms of processing within and across ventral-stream regions. Categorical divisions emerge in sequence, cascading forward and in reverse across regions, and Granger causality analysis suggests bidirectional information flow between regions. Finally, recurrent deep neural network models clearly outperform parameter-matched feedforward models in terms of their ability to capture the multiregion cortical dynamics. Targeted virtual cooling experiments on the recurrent deep network models further substantiate the importance of their lateral and top-down connections. These results establish that recurrent models are required to understand information processing in the human ventral stream.","authors":["Tim C. Kietzmann","Courtney J. Spoerer","Kenneth Sörensen","Radoslaw M. Cichy"],"meta":["October 2019Proceedings of the National Academy of Sciences 116(43):201905544","DOI:10.1073/pnas.1905544116"],"references":["333909249_Recurrent_networks_can_recycle_neural_resources_to_flexibly_trade_speed_for_accuracy_in_visual_recognition","333125181_Beyond_core_object_recognition_Recurrent_processes_account_for_object_recognition_under_occlusion","332741597_Evidence_that_recurrent_circuits_are_critical_to_the_ventral_stream's_execution_of_core_object_recognition_behavior","325197288_The_temporal_evolution_of_conceptual_object_representations_revealed_through_models_of_behavior_semantics_and_deep_neural_networks","335699404_Recurrent_Connections_Aid_Occluded_Object_Recognition_by_Discounting_Occluders","331311082_Deep_Neural_Networks_in_Computational_Neuroscience","324029442_A_toolbox_for_representational_similarity_analysis","323164927_Deep_Predictive_Coding_Network_for_Object_Recognition","322647534_Dynamic_Computational_Time_for_Visual_Attention","320827951_Evolution_of_life_in_urban_environments"]}