{"id":"336339974_Deep_Neural_Networks_Improve_Radiologists'_Performance_in_Breast_Cancer_Screening","abstract":"We present a deep convolutional neural network for breast cancer screening exam classification, trained and evaluated on over 200,000 exams (over 1,000,000 images). Our network achieves an AUC of 0.895 in predicting the presence of cancer in the breast, when tested on the screening population. We attribute the high accuracy to a few technical advances. (i) Our network’s novel two-stage architecture and training procedure, which allows us to use a high-capacity patch-level network to learn from pixel-level labels alongside a network learning from macroscopic breast-level labels. (ii) A custom ResNet-based network used as a building block of our model, whose balance of depth and width is optimized for high-resolution medical images. (iii) Pretraining the network on screening BI-RADS classification, a related task with more noisy labels. (iv) Combining multiple input views in an optimal way among a number of possible choices. To validate our model, we conducted a reader study with 14 readers, each reading 720 screening mammogram exams, and show that our model is as accurate as experienced radiologists when presented with the same data. We also show that a hybrid model, averaging the probability of malignancy predicted by a radiologist with a prediction of our neural network, is more accurate than either of the two separately. To further understand our results, we conduct a thorough analysis of our network’s performance on different subpopulations of the screening population, the model’s design, training procedure, errors, and properties of its internal representations. Our best models are publicly available at https://github.com/nyukat/breastcancerclassifier.","authors":["Nan Wu","Jason Phang","Jungkyu Park","Yiqiu Shen"],"meta":["October 2019IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2019.2945514","Project: Deep Learning for Breast Cancer Diagnosis"],"references":["330501729_The_Role_of_Deep_Learning_in_Breast_Screening","329083180_Detection_of_Breast_Cancer_with_Mammography_Effect_of_an_Artificial_Intelligence_Support_System","327810812_Breast_Density_Classification_with_Deep_Convolutional_Neural_Networks","327391699_UMAP_Uniform_Manifold_Approximation_and_Projection","323072309_Applying_Data-driven_Imaging_Biomarker_in_Mammography_for_Breast_Cancer_Screening_Preliminary_Study","321124712_End-to-end_Training_for_Whole_Image_Breast_Cancer_Diagnosis_using_An_All_Convolutional_Design","331556290_Stand-Alone_Artificial_Intelligence_for_Breast_Cancer_Detection_in_Mammography_Comparison_With_101_Radiologists","330687278_New_Frontiers_An_Update_on_Computer-Aided_Diagnosis_for_Breast_Imaging_in_the_Age_of_Artificial_Intelligence","322058545_Revisiting_Unreasonable_Effectiveness_of_Data_in_Deep_Learning_Era","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}