{"id":"336376061_Do_MOOCs_contribute_to_student_equity_and_social_inclusion_A_systematic_review_2014-18","abstract":"In recent years, hopes that Massive Open Online Courses (MOOCs) would make access to education fairer faded in the light of research showing MOOCs favoured the already educated and relatively advantaged. This paper presents the results of a systematic review of literature from 2014 to 2018. The aim was to investigate the extent that MOOCs and other free open education programs provide equitable forms of online education to address global widening participation agendas. The literature fell into two main groups: empirical reports on outcomes for students, and those providing policy or practitioner guidance. A globally diverse set of 46 studies and reports were examined, including 24 empirical evaluations of programs reaching over 440,000 disadvantaged learners in both distance and blended learning settings. Most literature claimed an interest in advancing student equity (enrolled or tertiary preparation learners) and/or social inclusion (community learners) with low-skills, low confidence, and/or low levels of previous education. In contrast to the existing literature, this study found that there was a flourishing of multi-lingual and Languages other than English (LOTE) programs and those addressing regional socio-economic disadvantage. Most cases involved MOOCs and free online resources combined with additional forms of support, including face-to-face study groups. Contrary to the existing debate in the open education literature, the review also found that the legal status of the learning materials (copyright or openly licenced) was of little consequence so long as it was free to the end user. What seemed to matter most was the intentional and collaborative design for disadvantaged cohorts, including the provision of digital or face-to-face personal support. Successful design collaborations often featured learner-centred, non-technical partnerships with community groups which increased the understanding of the needs of particular marginalised learners, while also providing more sustainable and distributed learner support. The review concludes that MOOCs which aim to widen participation in education are an alternative global practice that exists alongside more commercial MOOC offerings. Recommendations are provided for addressing gaps in offerings, and improving design and research.","authors":["Sarah Roslyn Lambert"],"meta":["October 2019Computers & Education 145:103693","DOI:10.1016/j.compedu.2019.103693"],"references":["324889905_Causes_of_differences_in_student_outcomes","322684820_Going_Open_Policy_Recommendations_on_Open_Education_in_Europe","319877626_An_investigation_into_the_perspectives_of_providers_and_learners_on_MOOC_accessibility","334400273_Digital_neocolonialism_and_massive_open_online_courses_MOOCs_colonial_pasts_and_neoliberal_futures","329649885_Technology_and_Social_Inclusion_Rethinking_the_Digital_Divide","329462783_Access_for_Refugees_Into_Higher_Education_A_Review_of_Interventions_in_North_America_and_Europe","328997120_Open_Scale_Courses_Exploring_Access_and_Opportunity_for_Less-Educated_Learners","328967088_Equity-oriented_design_in_open_education","324881494_New_pathways_affective_labor_and_distributed_expertise_in_peer-supported_Learning_Circles","320130815_Handbook_of_Indigenous_Education"]}