{"id":"336342026_Forecasting_incidence_of_hand_foot_and_mouth_disease_using_BP_neural_networks_in_Jiangsu_province_China","abstract":"Background: \nHand, foot and mouth disease (HFMD) is a rising public health problem and has attracted considerable attention worldwide. The purpose of this study was to develop an optimal model with meteorological factors to predict the epidemic of HFMD.\n\nMethods: \nTwo types of methods, back propagation neural networks (BP) and auto-regressive integrated moving average (ARIMA), were employed to develop forecasting models, based on the monthly HFMD incidences and meteorological factors during 2009-2016 in Jiangsu province, China. Root mean square error (RMSE) and mean absolute percentage error (MAPE) were employed to select model and evaluate the performance of the models.\n\nResults: \nFour models were constructed. The multivariate BP model was constructed using the HFMD incidences lagged from 1 to 4 months, mean temperature, rainfall and their one order lagged terms as inputs. The other BP model was fitted just using the lagged HFMD incidences as inputs. The univariate ARIMA model was specified as ARIMA (1,0,1)(1,1,0)12 (AIC = 1132.12, BIC = 1440.43). And the multivariate ARIMAX with one order lagged temperature as external predictor was fitted based on this ARIMA model (AIC = 1132.37, BIC = 1142.76). The multivariate BP model performed the best in both model fitting stage and prospective forecasting stage, with a MAPE no more than 20%. The performance of the multivariate ARIMAX model was similar to that of the univariate ARIMA model. Both performed much worse than the two BP models, with a high MAPE near to 40%.\n\nConclusion: \nThe multivariate BP model effectively integrated the autocorrelation of the HFMD incidence series. Meanwhile, it also comprehensively combined the climatic variables and their hysteresis effects. The introduction of the climate terms significantly improved the prediction accuracy of the BP model. This model could be an ideal method to predict the epidemic level of HFMD, which is of great importance for the public health authorities.","authors":["Wendong Liu","Chang-jun Bao","Yuping Zhou","Hong Ji"],"meta":["October 2019BMC Infectious Diseases 19(1)","DOI:10.1186/s12879-019-4457-6"],"references":["327789397_Emerging_Enteroviruses_Causing_Hand_Foot_and_Mouth_Disease_China_2010-2016","324215345_Spatio-temporal_analysis_of_the_relationship_between_meteorological_factors_and_hand-foot-mouth_disease_in_Beijing_China","323475225_Epidemiology_of_Recurrent_Hand_Foot_and_Mouth_Disease_China_2008-2015","322893435_Impact_of_meteorological_factors_on_the_incidence_of_childhood_hand_foot_and_mouth_disease_HFMD_analyzed_by_DLNMs-based_time_series_approach","322739538_Severity_and_burden_of_hand_foot_and_mouth_disease_in_Asia_A_modelling_study","321910950_Epidemiology_of_hand_foot_and_mouth_disease_in_China_2008_to_2015_prior_to_the_introduction_of_EV-A71_vaccine","320636435_Effect_of_climatic_variability_on_childhood_diarrhea_and_its_high_risk_periods_in_northwestern_parts_of_Ethiopia","320272716_Predicting_the_hand_foot_and_mouth_disease_incidence_using_search_engine_query_data_and_climate_variables_An_ecological_study_in_Guangdong_China","329172065_Forecasting_hand_foot_and_mouth_disease_in_Shenzhen_based_on_daily_level_clinical_data_and_multiple_environmental_factors","321437250_Climate_change_the_role_of_the_infectious_disease_community"]}