{"id":"336337216_Quantum_entanglement_in_physical_and_cognitive_systems_A_conceptual_analysis_and_a_general_representation","abstract":"We provide a general description of the phenomenon of entanglement in bipartite systems, as it manifests in micro and macro physical systems, as well as in human cognitive processes. We do so by observing that when genuine coincidence measurements are considered, the violation of the ‘marginal laws’, in addition to the Bell-CHSH inequality, is also to be expected. The situation can be described in the quantum formalism by considering the presence of entanglement not only at the level of the states, but also at the level of the measurements. However, at the “local” level of a specific joint measurement, a description where entanglement is only incorporated in the state remains always possible, by adopting a fine-tuned tensor product representation. But contextual tensor product representations should only be considered when there are good reasons to describe the outcome-states as (non-entangled) product states. This will not in general be true, hence, the entanglement resource will have to generally be allocated both in the states and in the measurements. In view of the numerous violations of the marginal laws observed in physics’ laboratories, it remains unclear to date if entanglement in micro-physical systems is to be understood only as an ‘entanglement of the states’, or also as an ‘entanglement of the measurements’. But even if measurements would also be entangled, the corresponding violation of the marginal laws (also called ‘no-signaling conditions’) would not for this imply that a superluminal communication would be possible.","authors":["Diederik Aerts","J. Aerts Arguëlles","Lester Beltran","Suzette Geriente"],"meta":["October 2019European Physical Journal Plus 134(10)","DOI:10.1140/epjp/i2019-12987-0"],"references":["334754196_Violation_of_CHSH_inequality_and_marginal_laws_in_mixed_sequential_measurements_with_order_effects","329373007_Quantum_Entanglement_in_Corpuses_of_Documents","321325167_On_the_Conceptuality_Interpretation_of_Quantum_and_Relativity_Theories","319478276_Is_Einsteinian_No-signalling_violated_in_Bell_Tests","317356403_Spin_and_Wind_Directions_II_A_Bell_State_Quantum_Model","323130140_On_the_Einstein_Podolsky_Rosen_paradox","322433384_Data_fusion_using_Hilbert_space_multi-dimensional_models","320796593_Snow_Queen_Is_Evil_and_Beautiful_Experimental_Evidence_for_Probabilistic_Contextuality_in_Human_Choices","318091190_Satellite-Based_Entanglement_Distribution_Over_1200_kilometers","316935085_Analysis_of_assumptions_of_recent_tests_of_local_realism"]}