{"id":"336380068_AssemblyNet_A_Novel_Deep_Decision-Making_Process_for_Whole_Brain_MRI_Segmentation","abstract":"Whole brain segmentation using deep learning (DL) is a very challenging task since the number of anatomical labels is very high compared to the number of available training images. To address this problem, previous DL methods proposed to use a global convolution neural network (CNN) or few independent CNNs. In this paper, we present a novel ensemble method based on a large number of CNNs processing different overlapping brain areas. Inspired by parliamentary decision-making systems, we propose a framework called AssemblyNet, made of two “assemblies” of U-Nets. Such a parliamentary system is capable of dealing with complex decisions and reaching a consensus quickly. AssemblyNet introduces sharing of knowledge among neighboring U-Nets, an “amendment” procedure made by the second assembly at higher-resolution to refine the decision taken by the first one, and a final decision obtained by majority voting. When using the same 45 training images, AssemblyNet outperforms global U-Net by 28% in terms of the Dice metric, patch-based joint label fusion by 15% and SLANT-27 by 10%. Finally, AssemblyNet demonstrates high capacity to deal with limited training data to achieve whole brain segmentation in practical training and testing times.","authors":["Pierrick Coupé","Boris Mansencal","Michaël Clément","Rémi Giraud"],"meta":["October 2019","DOI:10.1007/978-3-030-32248-9_52","Conference: International Conference on Medical Image Computing and Computer-Assisted Intervention"],"references":["323771171_Averaging_Weights_Leads_to_Wider_Optima_and_Better_Generalization","316642906_Error_Corrective_Boosting_for_Learning_Fully_Convolutional_Networks_with_Limited_Data","272195333_Deep_Neural_Networks_for_Anatomical_Brain_Segmentation","332319285_3D_whole_brain_segmentation_using_spatially_localized_atlas_network_tiles","330858992_VoxelMorph_A_Learning_Framework_for_Deformable_Medical_Image_Registration","319769994_A_Theoretically_Grounded_Application_of_Dropout_in_Recurrent_Neural_Networks","319463016_Error_Corrective_Boosting_for_Learning_Fully_Convolutional_Networks_with_Limited_Data","313886726_DeepNAT_Deep_Convolutional_Neural_Network_for_Segmenting_Neuroanatomy","308845624_Deep_neural_networks_for_anatomical_brain_segmentation","305193694_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation"]}