{"id":"336377105_Generalizable_Feature_Learning_in_the_Presence_of_Data_Bias_and_Domain_Class_Imbalance_with_Application_to_Skin_Lesion_Classification","abstract":"Training generalizable data-driven models for medical imaging applications is especially challenging as acquiring and accessing sufficiently large medical datasets is often unfeasible. When trained on limited datasets, a high capacity model, as most leading neural network architectures are, is likely to overfit and thus generalize poorly to unseen data. Further aggravating the problem, data used to train models in medicine are typically collected in silos and from narrow data distributions that are determined by specific acquisition hardware, imaging protocols, and patient demographics. In addition, class imbalance within and across datasets is a common complication as disease conditions or sub-types have varying degrees of prevalence. In this paper, we motivate the need for generalizable training in the context of skin lesion classification by evaluating the performance of ResNet across 7 public datasets with dataset bias and class imbalance. To mitigate dataset bias, we extend the classification and contrastive semantic alignment (CCSA) loss that aims to learn domain-invariant features. As the CCSA loss requires labelled data from two domains, we propose a strategy to dynamically sample paired data in a setting where the set of available classes varies across domains. To encourage learning from underrepresented classes, the sampled class probabilities are used to weight the classification and alignment losses. Experimental results demonstrate improved generalizability as measured by the mean macro-average recall across the 7 datasets when training using the weighted CCSA loss and dynamic sampler.","authors":["Chris Yoon","Ghassan Hamarneh","Rafeef Garbi"],"meta":["October 2019","DOI:10.1007/978-3-030-32251-9_40","In book: Medical Image Computing and Computer Assisted Intervention – MICCAI 2019 (pp.365-373)"],"references":["324691022_Domain_Generalization_with_Adversarial_Feature_Learning","324381190_7-Point_Checklist_and_Skin_Lesion_Classification_using_Multi-Task_Multi-Modal_Neural_Nets","324078202_The_HAM10000_Dataset_A_Large_Collection_of_Multi-Source_Dermatoscopic_Images_of_Common_Pigmented_Skin_Lesions","320163409_Unified_Deep_Supervised_Domain_Adaptation_and_Generalization","319406416_Unified_Deep_Supervised_Domain_Adaptation_and_Generalization","320971009_Adversarial_Discriminative_Domain_Adaptation","320321714_Learning_to_Generalize_Meta-Learning_for_Domain_Generalization","319461439_Semi-supervised_Deep_Learning_for_Fully_Convolutional_Networks","319135616_Improved_Regularization_of_Convolutional_Neural_Networks_with_Cutout","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks"]}