{"id":"336358480_LocPass_A_Graphical_Password_Method_to_Prevent_Shoulder-Surfing","abstract":"Graphical passwords are a method of authentication in computer security. Computer security is one of the disciplines of computer science. Shoulder-surfing attacks are a well-known threat to graphical passwords, although is getting commonly used especially in granting access for a secure system. Shoulder-surfing occurs when attackers skillfully capture important data/activities, such as login passwords, via direct observation or video recording methods. Many methods have been proposed to overcome the problem of shoulder-surfing attacks. After we reviewed some related works, we found out that most of the existing methods are still vulnerable to multiple observations and video-recorded shoulder-surfing attacks. Thus, we propose a new method to combat this problem. In our proposed method, we make used of two concepts to combat shoulder-surfing attacks. In the first concept, we used registered locations (something that only the users know) and 5 image directions (something that the users can see) to determine a pass-location (new knowledge). Secondly, the images used in our proposed method have higher chances to offset each other. The idea of offset could increase the password spaces of our proposed method if an attacker intended to guess the registered location used. By combining these two concepts, the pass-location produced by our proposed method in each challenge set could be varied. Therefore, it is impossible for the attackers to shoulder-surf any useful information such as the images/locations clicked by the user in each challenge set. A user study was conducted to evaluate the capabilities of the proposed method to prevent shoulder-surfing attacks. The shoulder-surfing testing results indicated that none of the participants were able to login, although they knew the underlying algorithm and they have been given sufficient time to perform a shoulder-surfing attack. Therefore, the proposed method has proven it can prevent shoulder-surfing attacks, provided the enrolment procedure is carried out in a secure manner.","authors":["Yee Lip Por","Lateef Adebimpe","Mohd Yamani Idna Idris","Khaw Chee Siong"],"meta":["October 2019Symmetry 11(10):1252","DOI:10.3390/sym11101252"],"references":["343281755_A_review_of_the_recognition-based_graphical_password","335512236_Preventing_Shoulder-Surfing_Attacks_using_Digraph_Substitution_Rules_and_Pass-Image_Output_Feedback","313770062_Graphical_password_Prevent_shoulder-surfing_attack_using_digraph_substitution_rules","309572714_An_Exploration_of_Graphical_Password_Authentication_for_Children","300079868_The_Shoulder_Surfing_Resistant_Graphical_Password_Authentication_Technique","297725624_A_Shoulder_Surfing_Resistant_Graphical_Authentication_System","325309245_Does_image_grid_visualization_affect_password_strength_and_creation_time_in_graphical_authentication","308188632_A_Secure_One-Time_Password_Authentication_Scheme_Using_Image_Texture_Features","306370590_The_graphical_security_system_by_using_CaRP","289671441_A_Review_of_Graphical_Authentication_Utilising_a_Keypad_Input_Method"]}