{"id":"336393584_Cardiac_MRI_Segmentation_with_Strong_Anatomical_Guarantees","abstract":"Recent publications have shown that the segmentation accuracy of modern-day convolutional neural networks (CNN) applied on cardiac MRI can reach the inter-expert variability, a great achievement in this area of research. However, despite these successes, CNNs still produce anatomically inaccurate segmentations as they provide no guarantee on the anatomical plausibility of their outcome, even when using a shape prior. In this paper, we propose a cardiac MRI segmentation method which always produces anatomically plausible results. At the core of the method is an adversarial variational autoencoder (aVAE) whose latent space encodes a smooth manifold on which lies a large spectrum of valid cardiac shapes. This aVAE is used to automatically warp anatomically inaccurate cardiac shapes towards a close but correct shape. Our method can accommodate any cardiac segmentation method and convert its anatomically implausible results to plausible ones without affecting its overall geometric and clinical metrics. With our method, CNNs can now produce results that are both within the inter-expert variability and always anatomically plausible.","authors":["Nathan Painchaud","Youssef Skandarani","Thierry Judge","Olivier Bernard"],"meta":["October 2019","DOI:10.1007/978-3-030-32245-8_70","In book: Medical Image Computing and Computer Assisted Intervention – MICCAI 2019, 22nd International Conference, Shenzhen, China, October 13–17, 2019, Proceedings, Part II (pp.632-640)"],"references":["330593015_Automatic_3D_Bi-Ventricular_Segmentation_of_Cardiac_Images_by_a_Shape-Refined_Multi-_Task_Deep_Learning_Approach","317087807_Anatomically_Constrained_Neural_Networks_ACNN_Application_to_Cardiac_Image_Enhancement_and_Segmentation","284579051_Fast_and_Accurate_Deep_Network_Learning_by_Exponential_Linear_Units_ELUs","327025653_Convolutional_Neural_Network_With_Shape_Prior_Applied_to_Cardiac_MRI_Segmentation","325212356_Deep_Learning_Techniques_for_Automatic_MRI_Cardiac_Multi-Structures_Segmentation_and_Diagnosis_Is_the_Problem_Solved","319770154_Adversarial_Autoencoders","318178597_Recent_Advances_in_Cardiovascular_Magnetic_Resonance_Techniques_and_Applications","269935079_Adam_A_Method_for_Stochastic_Optimization","259400035_Auto-Encoding_Variational_Bayes","220690050_Probabilistic_Graphical_Models_Principles_and_Techniques"]}