{"id":"336390968_Higra_Hierarchical_Graph_Analysis","abstract":"Higra — Hierarchical Graph Analysis is a C++/Python library for efficient sparse graph analysis with a special focus on hierarchical methods capable of handling large amount of data. The main aspects of hierarchical graph analysis addressed in Higra are the construction of hierarchical representations (agglomerative clustering, mathematical morphology hierarchies, etc.), the analysis and processing of such representations (filtering, clustering, characterization, etc.), and their assessment. Higra targets a large audience, from students and practitioners wanting an accessible library for quickly experimenting, to researchers developing new methods for hierarchical analysis of graph data. Higra is a generic toolbox for graph analysis and can be utilized in a large variety of application fields like machine learning, data science, pattern analysis and computer vision. Moreover, it contains an image analysis module easing the handling of pixel grid graphs by providing efficient algorithms dedicated to this field. Keywords: Graph, Hierarchical clustering, Component tree","authors":["Benjamin Perret","Giovanni Chierchia","Jean Cousty","Silvio Jamil Ferzoli Guimarães"],"meta":["July 2019","DOI:10.1016/j.softx.2019.100335"],"references":["333858596_Self-dual_Pattern_Spectra_for_Characterising_the_Dermal-Epidermal_Junction_in_3D_Reflectance_Confocal_Microscopy_Imaging","325831761_mlpack_3_a_fast_flexible_machine_learning_library","321505767_Evaluation_of_Hierarchical_Watersheds","320535764_Hierarchical_Segmentations_with_Graphs_Quasi-flat_Zones_Minimum_Spanning_Trees_and_Saliency_Maps","316048473_Evaluation_of_Combinations_of_Watershed_Hierarchies","315508309_iamxt_Max-tree_toolbox_for_image_processing_and_analysis","312492918_Convolutional_Oriented_Boundaries_From_Image_Segmentation_to_High-Level_Tasks","347808949_Ultrametric_fitting_by_gradient_descent","337794935_Exploring_Hierarchy_Simplification_for_Non-Significant_Region_Removal","336470855_Removing_non-signicant_regions_in_hierarchical_clustering_and_segmentation"]}