{"id":"336487096_Harmonization_and_Targeted_Feature_Dropout_for_Generalized_Segmentation_Application_to_Multi-site_Traumatic_Brain_Injury_Images","abstract":"While learning based methods have brought extremely promising results in medical imaging, a major bottleneck is the lack of generalizability. Medical images are often collected from multiple sites and/or protocols for increasing statistical power, while CNN trained on one site typically cannot be well-transferred to others. Further, expert-defined manual labels for medical images are typically rare, making training a dedicated CNN for each site unpractical, so it is important to make best use of the limited labeled source data. To address this problem, we harmonize the target data using adversarial learning, and propose targeted feature dropout (TFD) to enhance the robustness of the model to variations in target images. Specifically, TFD is guided by attention to stochastically remove some of the most discriminative features. Essentially, this technique combines the benefits of attention mechanism and dropout, while it does not increase parameters and computational costs, making it well-suited for small neuroimaging datasets. We evaluated our method on a challenging Traumatic Brain Injury (TBI) dataset collected from 13 sites, using labeled source data of only 14 healthy subjects. Experimental results confirmed the feasibility of using the Cycle-consistent adversarial network for harmonizing multi-site MR images, and demonstrated that TFD further improved the generalization of the vanilla segmentation model on TBI data, reaching comparable accuracy with that of the supervised learning. The code is available at https://github.com/YilinLiu97/Targeted-Feature-Dropout.git.","authors":["Yilin Liu","Gregory R. Kirk","Brendon M. Nacewicz","Martin Styner"],"meta":["October 2019","DOI:10.1007/978-3-030-33391-1_10","In book: Domain Adaptation and Representation Transfer and Medical Image Learning with Less Labels and Imperfect Data, First MICCAI Workshop, DART 2019, and First International Workshop, MIL3ID 2019, Shenzhen, Held in Conjunction with MICCAI 2019, Shenzhen, China, October 13 and 17, 2019, Proceedings (pp.81-89)"],"references":["327627453_A_Lifelong_Learning_Approach_to_Brain_MR_Segmentation_Across_Scanners_and_Protocols","326202520_Soft_Filter_Pruning_for_Accelerating_Deep_Convolutional_Neural_Networks","323411512_A_DIRT-T_Approach_to_Unsupervised_Domain_Adaptation","322060135_Unpaired_Image-to-Image_Translation_Using_Cycle-Consistent_Adversarial_Networks","315710637_Unpaired_Image-to-Image_Translation_using_Cycle-Consistent_Adversarial_Networks","329740202_Squeeze-and-Excitation_Networks","327629280_Inter-site_Variability_in_Prostate_Segmentation_Accuracy_Using_Deep_Learning_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_Part_IV","327627275_Concurrent_Spatial_and_Channel_'Squeeze_Excitation'_in_Fully_Convolutional_Networks","319770006_Learning_Deep_Features_for_Discriminative_Localization","318017449_Unsupervised_Domain_Adaptation_in_Brain_Lesion_Segmentation_with_Adversarial_Networks","307719713_Efficient_object_localization_using_Convolutional_Networks","287250939_Learning_Deep_Features_for_Discriminative_Localization"]}