{"id":"336413932_An_application_of_machine_learning_with_feature_selection_to_improve_diagnosis_and_classification_of_neurodegenerative_disorders","abstract":"Background: \nThe analysis of health and medical data is crucial for improving the diagnosis precision, treatments and prevention. In this field, machine learning techniques play a key role. However, the amount of health data acquired from digital machines has high dimensionality and not all data acquired from digital machines are relevant for a particular disease. Primary Progressive Aphasia (PPA) is a neurodegenerative syndrome including several specific diseases, and it is a good model to implement machine learning analyses. In this work, we applied five feature selection algorithms to identify the set of relevant features from 18F-fluorodeoxyglucose positron emission tomography images of the main areas affected by PPA from patient records. On the other hand, we carried out classification and clustering algorithms before and after the feature selection process to contrast both results with those obtained in a previous work. We aimed to find the best classifier and the more relevant features from the WEKA tool to propose further a framework for automatic help on diagnosis. Dataset contains data from 150 FDG-PET imaging studies of 91 patients with a clinic prognosis of PPA, which were examined twice, and 28 controls. Our method comprises six different stages: (i) feature extraction, (ii) expertise knowledge supervision (iii) classification process, (iv) comparing classification results for feature selection, (v) clustering process after feature selection, and (vi) comparing clustering results with those obtained in a previous work.\n\nResults: \nExperimental tests confirmed clustering results from a previous work. Although classification results for some algorithms are not decisive for reducing features precisely, Principal Components Analisys (PCA) results exhibited similar or even better performances when compared to those obtained with all features.\n\nConclusions: \nAlthough reducing the dimensionality does not means a general improvement, the set of features is almost halved and results are better or quite similar. Finally, it is interesting how these results expose a finer grain classification of patients according to the neuroanatomy of their disease.","authors":["Josefa Diaz Alvarez","Jordi A Matias-Guiu","María Nieves Cabrera Martín","José L Risco-Martín"],"meta":["October 2019BMC Bioinformatics 20(1)","DOI:10.1186/s12859-019-3027-7"],"references":["326367985_Clustering_Analysis_of_FDG-PET_Imaging_in_Primary_Progressive_Aphasia","325048121_Diagnostic_utility_of_FDG-PET_in_the_differential_diagnosis_between_different_forms_of_primary_progressive_aphasia","324593247_Role_of_Neuroimaging_as_a_Biomarker_for_Neurodegenerative_Diseases","322868264_Primary_progressive_aphasia_a_clinical_approach","312255443_Machine_Learning_and_Data_Mining_Methods_in_Diabetes_Research","326475162_Molecular_imaging_in_dementia_Past_present_and_future","316964799_Classification_of_primary_progressive_aphasia_and_its_variants","316737315_Clinical_and_Pathological_Characterization_of_Progressive_Aphasia","313605247_Hierarchical_clustering","313124819_Alzheimer's_disease_Time_to_focus_on_the_brain_not_just_molecules"]}