{"id":"336422012_Approximating_the_Temporal_Neighbourhood_Function_of_Large_Temporal_Graphs","abstract":"Temporal networks are graphs in which edges have temporal labels, specifying their starting times and their traversal times. Several notions of distances between two nodes in a temporal network can be analyzed, by referring, for example, to the earliest arrival time or to the latest starting time of a temporal path connecting the two nodes. In this paper, we mostly refer to the notion of temporal reachability by using the earliest arrival time. In particular, we first show how the sketch approach, which has already been used in the case of classical graphs, can be applied to the case of temporal networks in order to approximately compute the sizes of the temporal cones of a temporal network. By making use of this approach, we subsequently show how we can approximate the temporal neighborhood function (that is, the number of pairs of nodes reachable from one another in a given time interval) of large temporal networks in a few seconds. Finally, we apply our algorithm in order to analyze and compare the behavior of 25 public transportation temporal networks. Our results can be easily adapted to the case in which we want to refer to the notion of distance based on the latest starting time.","authors":["Pierluigi Crescenzi","Clémence Magnien","Andrea Marino"],"meta":["October 2019Algorithms 12(10):211","DOI:10.3390/a12100211"],"references":["331982905_Time-Varying_Graphs_and_Dynamic_Networks","331929461_International_Journal_of_Parallel_Emergent_and_Distributed_Systems_Time-varying_graphs_and_dynamic_networks_Time-varying_graphs_and_dynamic_networks","325161554_A_collection_of_public_transport_network_data_sets_for_25_cities","320344648_Stream_Graphs_and_Link_Streams_for_the_Modeling_of_Interactions_over_Time","301873758_Efficient_Processing_of_Reachability_and_Time-Based_Path_Queries_in_a_Temporal_Graph","300581399_Minimum_Spanning_Trees_in_Temporal_Graphs","323451126_Degrees_of_Separation_and_Diameter_in_Large_Graphs","312252546_Beyond_Highway_Dimension_Small_Distance_Labels_Using_Tree_Skeletons","310515781_Route_Planning_in_Transportation_Networks","304135690_All-Distances_Sketches"]}