{"id":"336422496_ReachNN_Reachability_Analysis_of_Neural-Network_Controlled_Systems","abstract":"Applying neural networks as controllers in dynamical systems has shown great promises. However, it is critical yet challenging to verify the safety of such control systems with neural-network controllers in the loop. Previous methods for verifying neural network controlled systems are limited to a few specific activation functions. In this work, we propose a new reachability analysis approach based on Bernstein polynomials that can verify neural-network controlled systems with a more general form of activation functions, i.e., as long as they ensure that the neural networks are Lipschitz continuous. Specifically, we consider abstracting feedforward neural networks with Bernstein polynomials for a small subset of inputs. To quantify the error introduced by abstraction, we provide both theoretical error bound estimation based on the theory of Bernstein polynomials and more practical sampling based error bound estimation, following a tight Lipschitz constant estimation approach based on forward reachability analysis. Compared with previous methods, our approach addresses a much broader set of neural networks, including heterogeneous neural networks that contain multiple types of activation functions. Experiment results on a variety of benchmarks show the effectiveness of our approach.","authors":["Chao Huang","Jiameng Fan","Wenchao Li","Xin Chen"],"meta":["October 2019ACM Transactions on Embedded Computing Systems 18(5s):1-22","DOI:10.1145/3358228"],"references":["326739189_Agile_Autonomous_Driving_using_End-to-End_Deep_Imitation_Learning","319976901_Agile_Off-Road_Autonomous_Driving_Using_End-to-End_Deep_Imitation_Learning","318859437_Probabilistic_Safety_Verification_of_Stochastic_Hybrid_Systems_Using_Barrier_Certificates","340515034_The_algorithmic_analysis_of_hybrid_systems","340514858_Lipschitz_constants_for_the_Bernstein_polynomials_of_a_Lipschitz_continuous_function","332285412_Verisig_verifying_safety_properties_of_hybrid_systems_with_neural_network_controllers","332278892_Reachability_analysis_for_neural_feedback_systems_using_regressive_polynomial_rule_inference","326204123_Reachability_Analysis_of_Deep_Neural_Networks_with_Provable_Guarantees","323687221_Output_Range_Analysis_for_Deep_Feedforward_Neural_Networks","319769909_Distilling_the_Knowledge_in_a_Neural_Network"]}