{"id":"336493298_Causes_of_Failure_of_University_Students_in_Computer_Programming_Courses_The_Case_of_Wachemo_University","abstract":"Computer programming courses are among the important components of the curriculum to be studied, not only in the school of Computing and Informatics, but also in most of the field including Natural Sciences, Mathematics, and Engineering Science departments. In this research, a study was conducted to investigate and explore the views of students for the failure and difficulties they faced in learning fundamental programming courses. There are many factors that influence the high rate of failure of students in computer programming courses. This paper focuses on the teaching and learning methodologies and strategies that are implemented in teaching of programming courses. This is a major factor for consideration; hence an investigation into the causes of failure of students in computer programming courses from the learner perspective with regard to the teaching methodology used by teachers to teach these courses is relevant and very important concept. Computer programming courses form part of the core concentration areas for students especially studying in school of computing and informatics as an undergraduate degree program. Computer programming students are expected to prove capabilities in the principles of programming and logic that are being taught in the course; even though some of these concepts are highly intellectual and multifaceted. Their opinions to the usefulness of the teaching methods being implemented in computer programming courses were required for. The needs and concerns about the teaching and learning methods are highlighted in the survey and discussed thereby leading to the making of suggestions about the ways to improve the teaching and learning methods that are used in computer programming courses in order to advance understanding of computer programming, when studied by students thereby minimizing failure rates of those students.","authors":["Wubetu Barud Demilie"],"meta":["September 2019International Journal of Scientific Research in Computer Science Engineering and Information Technology","DOI:10.32628/CSEIT195516"],"references":["322168736_Improving_Performance_and_Progression_of_Novice_Programmers_Factors_Considerations","263470574_Competing_Dichotomies_in_Teaching_Computer_Programming_to_Beginner-Students","260549178_Performance_of_Students_in_Computer_Programming_Background_Field_of_Study_and_Learning_Approach_Paradigm","257716774_Major_Problems_in_Basic_Programming_that_Influence_Student_Performance","237524669_PROBLEMS_IN_LEARNING_AND_TEACHING_PROGRAMMING_-_a_literature_study_for_developing_visualizations_in_the_Codewitz-Minerva_project","228765283_Instructional_strategy_in_the_teaching_of_computer_programming_A_need_assessment_analyses","320663544_Befriending_Computer_Programming_A_Proposed_Approach_to_Teaching_Introductory_Programming","267705862_An_Overview_of_Computer_Programming_Teaching_Methods","256924416_Commentary","237598134_Improving_teaching_in_Computer_Programming_by_adopting_student-centred_learning_strategies"]}