{"id":"336439893_Gain-of-Function_Mutant_p53_Enhances_Hematopoietic_Stem_Cell_Self-Renewal","abstract":"The tumor suppressor p53 is a critical regulator of hematopoietic stem cell (HSC) behavior and we demonstrated that p53 maintains HSC quiescence and regulates HSC response to irradiation (Liu et al., Cell Stem Cell, 2009).While TP53 mutations are less common in acute myeloid leukemia (5 to 8%) than in solid tumors (50%), they are associated with poor prognosis and abnormal cytogenetics, especially abnormalities in chromosomes 5 and 7. These mutations may abolish some but not necessarily all of the functions of p53 in regulating stem cell behavior. Therefore, this aspect of p53 function needs further investigation.\nTo define the role of mutant p53 in the pathogenesis of AML, we introduced 9 hot-spot p53 mutants identified in AML patients, including p53R248W, p53R273H and p53Y220C, into wild type hematopoietic cells using retrovirus-mediated transduction and investigated the role of these p53 mutants in regulating HSC self-renewal. We found that hematopoietic cells expressing p53R248W, p53Y220C or p53R273H show enhanced repopulating potential 16 weeks following transplantation. As codon 248 of the p53 protein is most frequently mutated in AML, we decided to investigate the role of p53R248W mutant in HSCs by using the humanized knock-in mice of p53R248W. In p53 knockout mice, there is a dramatic increase of HSCs (CD48-CD150+Lin-Sca1+c-Kit+ cells); however,we found thatboth wild type andp53R248W mice have similar number of HSCs. While wild type p53 maintains HSC quiescence, expression of p53R248W in HSCs (CD48-CD150+LSKs) does not affect their quiescent state. Asp53R248W does not appear to affect HSC frequency and quiescence, it is not a loss-of-function mutant. We also used bone marrow cells isolated from both wild type and p53R248W mice to perform the serial replating assays and found that expressing p53R248W from the endogenous Trp53 promoter enhances the replating potential of hematopoietic cells. Moreover, we performed serial bone marrow repopulation (BMT) assays and found that the repopulating ability of p53R248W cells was significantly higher than that of the wild type cells in both primary and secondary BMT assays, demonstrating that the p53R248W mutant enhances HSC self-renewal in vivo. Furthermore, we observed that HSCs expressing p53R248W are resistant to genotoxic stress induced by irradiation and the p53R248W mice show extended survival following sub-lethal dose of total body irradiation. Ample data indicate that mutant p53 proteins not only lose their tumor suppressive functions, but also gain new abilities that promote tumorigenesis. To understand how mutant p53 enhances HSC self-renewal, we performed gene expression profiling assays by using HSCs isolated from wild type and p53R248W mice. We also utilized Ingenuity Pathway analysis software to group putative mutant p53 target genes into different pathways. While we did not observe change in the expression of p53 target genes in p53R248W HSCs, several pathways that are important for leukemogenesis, including epigenetic and DNA damage repair pathways, are altered in HSCs expressing p53R248W, demonstrating that p53R248W is a gain-of-function mutant. Given that TP53 mutations are correlated with poor prognosis, pharmacological inhibition of mutant p53 may be a promising therapeutic strategy for AML patients with TP53 mutations. Small molecule PRIMA-1 has been shown to restore wild-type conformation to some mutant p53 proteins and induce apoptosis in human tumor cells. We found that hematopoietic cells expressing mutant p53 are sensitive to PRIMA-1 treatment and undergo p53-dependent apoptosis. Furthermore, we observed that PRIMA-1 inhibits the growth of primary human AML cells with TP53 mutation in a dosage-dependent manner.\nTaken together, we demonstrated that gain-of-function mutant p53 enhances hematopoietic stem cell self-renewal through regulating epigenetic and DNA damage repair pathways. Our data also suggest that pharmacological inhibition of mutant p53 may sensitize the drug-resistant leukemia stem cells (LSCs) to chemotherapy and improves leukemia treatment.\n\nDisclosures\nNo relevant conflicts of interest to declare.","authors":["Sisi Chen","Hao Yu","Michihiro Kobayashi","Rui Gao"],"meta":["December 2014Blood 124(21):260-260","DOI:10.1182/blood.V124.21.260.260","Conference: American Society of Hematology"],"references":[]}