{"id":"336402471_Multi-prover_interactive_proofs_how_to_remove_intractability_assumptions","abstract":"Quite complex cryptographic machinery has been developed based on the assumption that one-way functions exist, yet we know of only a few possible such candidates. It is important at this time to find alternative foundations to the design of secure cryptography. We introduce a new model of generalized interactive proofs as a step in this direction. We prove that all NP languages have perfect zero-knowledge proof-systems in this model, without making any intractability assumptions.\nThe generalized interactive-proof model consists of two computationally unbounded and untrusted provers, rather than one, who jointly agree on a strategy to convince the verifier of the truth of an assertion and then engage in a polynomial number of message exchanges with the verifier in their attempt to do so. To believe the validity of the assertion, the verifier must make sure that the two provers can not communicate with each other during the course of the proof process. Thus, the complexity assumptions made in previous work, have been traded for a physical separation between the two provers.\nWe call this new model the multi-prover interactive-proof model, and examine its properties and applicability to cryptography.","authors":["Michael Ben-Or","Shafi Goldwasser","Joe Kilian","Avi Wigderson"],"meta":["October 2019","DOI:10.1145/3335741.3335758","In book: Providing Sound Foundations for Cryptography: On the Work of Shafi Goldwasser and Silvio Micali"],"references":["242379939_Multiparty_computations_ensuring_secrecy_of_each_party's_input_and_correctness_of_the_output","223332087_Does_co-NP_have_short_interactive_proofs","221355359_How_to_Solve_any_Protocol_Problem_-_An_Efficiency_Improvement","4355038_Unbiased_Bits_from_Sources_of_Weak_Randomness_and_Probabilistic_Communication_Complexity","2613617_The_Complexity_of_Perfect_Zero-Knowledge","247044621_On_The_Power_of_Oblivious_Transfer","242609663_Bpp_and_the_polynomial_time_hierarchy","235008641_Theory_and_Applications_of_Trapdoor_Functions","222450604_Bounded-width_polynomial-size_branching_programs_recognize_exactly_those_languages_in_NC1","221499819_Protocols_for_Secure_Computations_Extended_Abstract","221355289_The_Noisy_Oracle_Problem","220574988_Universal_Classes_of_Hash_Functions","4355126_How_to_generate_and_exchange_secrets","2613692_On_the_Power_of_Multi-Prover_Interactive_Protocols"]}