{"id":"336447233_Automatic_repair_of_regular_expressions","abstract":"We introduce RFixer, a tool for repairing complex regular expressions using examples and only consider regular expressions without non-regular operators (e.g., negative lookahead). Given an incorrect regular expression and sets of positive and negative examples, RFixer synthesizes the closest regular expression to the original one that is consistent with the examples. Automatically repairing regular expressions requires exploring a large search space because practical regular expressions: i) are large, ii) operate over very large alphabets---e.g., UTF-16 and ASCII---and iii) employ complex constructs---e.g., character classes and numerical quantifiers. RFixer's repair algorithm achieves scalability by taking advantage of structural properties of regular expressions to effectively prune the search space, and it employs satisfiability modulo theory solvers to efficiently and symbolically explore the sets of possible character classes and numerical quantifiers. RFixer could successfully compute minimal repairs for regular expressions collected from a variety of sources, whereas existing tools either failed to produce any repair or produced overly complex repairs.","authors":["Rong Pan","Qinheping Hu","Gaowei Xu","Loris D'Antoni"],"meta":["October 2019Proceedings of the ACM on Programming Languages 3(OOPSLA):1-29","DOI:10.1145/3360565"],"references":["274046373_How_Can_Automatic_Feedback_Help_Students_Construct_Automata","272476913_Program_Boosting_Program_Synthesis_via_Crowd-Sourcing","325866723_Adding_Missing_Words_to_Regular_Expressions","318345387_Program_Synthesis","316898602_Synthesizing_regular_expressions_from_examples_for_introductory_automata_assignments","311471661_TRANSIT_specifying_protocols_with_concolic_snippets","309364995_Synthesizing_regular_expressions_from_examples_for_introductory_automata_assignments","303011914_Transforming_spreadsheet_data_types_using_examples","301274056_Transforming_spreadsheet_data_types_using_examples","289554838_Inference_of_Regular_Expressions_for_Text_Extraction_from_Examples"]}