{"id":"336449422_How_is_Gaze_Influenced_by_Image_Transformations_Dataset_and_Model","abstract":"Data size is the bottleneck for developing deep saliency models, because collecting eye-movement data is very time-consuming and expensive. Most of current studies on human attention and saliency modeling have used high-quality stereotype stimuli. In real world, however, captured images undergo various types of transformations. Can we use these transformations to augment existing saliency datasets? Here, we first create a novel saliency dataset including fixations of 10 observers over 1900 images degraded by 19 types of transformations. Second, by analyzing eye movements, we find that observers look at different locations over transformed versus original images. Third, we utilize the new data over transformed images, called data augmentation transformation (DAT), to train deep saliency models. We find that label-preserving DATs with negligible impact on human gaze boost saliency prediction, whereas some other DATs that severely impact human gaze degrade the performance. These label-preserving valid augmentation transformations provide a solution to enlarge existing saliency datasets. Finally, we introduce a novel saliency model based on generative adversarial networks (dubbed GazeGAN). A modified U-Net is utilized as the generator of the GazeGAN, which combines classic \"skip connection\" with a novel \"center-surround connection\" (CSC) module. Our proposed CSC module mitigates trivial artifacts while emphasizing semantic salient regions, and increases model nonlinearity, thus demonstrating better robustness against transformations. Extensive experiments and comparisons indicate that GazeGAN achieves state-of-the-art performance over multiple datasets. We also provide a comprehensive comparison of 22 saliency models on various transformed scenes, which contributes a new robustness benchmark to saliency community. Our code and dataset are available at.","authors":["Zhaohui Che","Ali Borji","Guangtao Zhai","Xiongkuo Min"],"meta":["October 2019IEEE Transactions on Image Processing 29:1-1","DOI:10.1109/TIP.2019.2945857","Project: saliency detection"],"references":["329747301_DeblurGAN_Blind_Motion_Deblurring_Using_Conditional_Adversarial_Networks","316779608_Deep_Visual_Attention_Prediction","312061353_SalGAN_Visual_Saliency_Prediction_with_Generative_Adversarial_Networks","311106390_Predicting_Human_Eye_Fixations_via_an_LSTM-based_Saliency_Attentive_Model","335274225_Saliency_Prediction_in_the_Deep_Learning_Era_Successes_and_Limitations","320964595_Residual_Attention_Network_for_Image_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","314649272_Toward_a_Reliable_Collection_of_Eye-Tracking_Data_for_Image_Quality_Research_Challenges_Solutions_and_Applications","313390811_Global_contrast_based_salient_region_detection","311610990_Shallow_and_Deep_Convolutional_Networks_for_Saliency_Prediction","307636671_A_Deep_Multi-Level_Network_for_Saliency_Prediction","303486514_Measuring_Neural_Net_Robustness_with_Constraints","305193694_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation","303749956_OpenSalicon_An_Open_Source_Implementation_of_the_Salicon_Saliency_Model","301876608_What_Do_Different_Evaluation_Metrics_Tell_Us_About_Saliency_Models"]}