{"id":"336597354_Urban_Traffic_Routing_Using_Weighted_Multi-Map_Strategies","abstract":"Urban traffic routing has to deal with individual mobility and collective wellness considering citizens, multi-modal transport, and fleet traffic with conflicting interests such as electric vehicles, local distribution, public transport, and private vehicles. Different interests, goals, and regulations, suggest the development of new multi-objective routing mechanisms which may improve traffic flow. In this work, Traffic Weighted Multi-Maps (TWM) is presented as a novel traffic routing mechanism based on the strategical generation and distribution of complementary cost maps for traffic fleets, oriented towards the application of differentiated traffic planning and control policies. TWM is built upon a centralized control architecture, where a Traffic Management Center generates and distributes customized cost maps of the road network. These maps are used individually to calculate routes. In this research, we present the TWM theoretical model and experimental results based on microscopic simulations over a real city traffic network under multiple scenarios, including traffic incidents management. Experimental evaluation takes into account driver’s adherence to the system and considers a multi-objective analysis both for the global network parameters (congestion, travel time, and route length) and for the subjective driving experience. Experimental results deliver performance improvements from 20% to 50%. TWM is fully compatible with existing traffic routing systems and has promising future evolution applying new algorithms, policies and network profiles.","authors":["Alvaro Paricio","Miguel A. López-Carmona"],"meta":["October 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2947699","Project: MuTraff - Multi-Map Urban Traffic Routing Algorithms"],"references":["335151881_A_Variable-Length_Chromosome_Genetic_Algorithm_to_Solve_a_Road_Traffic_Coordination_Multipath_Problem","330646960_Automated_Optimization_of_Intersections_Using_a_Genetic_Algorithm","328737185_Discovering_Urban_Travel_Demands_through_Dynamic_Zone_Correlation_in_Location-Based_Social_Networks","324464640_ReFOCUS_A_hybrid_fog-cloud_based_intelligent_traffic_re-routing_system","321419543_Dynamic_Origin-Destination_Estimation_based_on_Time_Delay_Correlation_Analysis_on_Location-based_Social_Network_LBSN_Data","329933867_Modelling_transport","328550373_Handbook_of_Mobile_Data_Privacy","326249592_Outlier_Detection_in_Urban_Traffic_Data","325939310_Resource_Aware_Routing_for_Service_Function_Chains_in_SDN_and_NFV-Enabled_Network","322175742_Macroscopic_traffic_model_for_large_scale_urban_traffic_network_design"]}