{"id":"336591808_Security_in_smart_objects_a_general_view_at_the_physical_and_logical_level","abstract":"In this research we addressed an issue of big importance with regard to information and computer science security. Within this area, we know that security is framed within the CIA triangle, which refers to confidentiality, integrity and availability of information or objects connected to the Internet, a subject that should be treated with great awareness. There were some questions that we inevitably must ask in order to understand at a deeper level the different aspects of information security, such as: What is an object? How safe is our private information? What privacy settings do we have? We live in an interconnected world where most of devices at home, businesses, industries, organizations, and cities are connected to the Internet. Within that environment, these objects are fulfilling some functionality that facilitates the lives of each individual, although making them somehow dependent on this technology with a high degree of risk to which they are exposed. This study aimed to explain and demonstrate that most of electronic devices or intelligent objects that are developed, locally or overseas, do not have a proper design with regard to making information security a first priority, then, proposing a guiding scheme that allows an adequate development cycle of intelligent objects. The study concluded that we are not 100% safe, as well as cyber-attacks will continue to evolve, so the conception of information security will have to evolve as well.","authors":["Fabián Cuzme-Rodríguez","Walter Zambrano-Romero","Cesar Armando Moreira Zambrano","Edison Zambano-Almeida"],"meta":["June 2019","DOI:10.53358/ideas.v1i1.5","Projects: Seguridad en objetos inteligentes, una visión general a nivel físico y lógicoSeguridad en Objetos Inteligentes"],"references":["321532783_Auditoria_de_seguridad_informatica_siguiendo_la_metodologia_OSSTMMv3_caso_de_estudio","311754322_IoT_Security_Framework_for_Smart_Cyber_Infrastructures","260689975_The_real_story_of_stuxnet"]}