{"id":"336555270_Guest_Editorial_Relationships_Between_Coastal_Sea_Level_and_Large-Scale_Ocean_Circulation","abstract":"Several hundred million people currently live in low-lying coastal regions, and this number will continue to increase in the coming decades. While some coastal areas are already being inundated by rising sea level, many others will also increasingly suffer from sea level rise and more intense extreme water levels during high tides, winter storms and hurricanes in the near future. Many oceanographic factors associated with both local and large-scale variability can influence coastal sea level, from hours to more than decades. Despite this coastal–open ocean link, differences exist between sea levels observed at the coast and over adjacent shallow and deep ocean regions. Distinct coastal sea level variability can arise, for example, due to coastally trapped waves and shelf currents, localized tidal resonances, bathymetric controls and small-scale features in atmospheric forcing. Identifying important influencing factors is essential for understanding, simulating and ultimately predicting sea level variability at the coast—a key societal concern in the context of our changing climate. In practice, this poses a huge and complex scientific challenge because it is region specific and timescale dependent and involves bringing multi-disciplinary expertise together.\n\nFrom 5 March 2018 to 9 March 2018, a Workshop held at the International Space Science Institute (ISSI) in Bern, Switzerland, as part of the ISSI Earth Observation program, brought together leading scientists with worldwide expertise in ocean dynamics, coastal processes, remote sensing and sea level. This Workshop permitted a review of the most up-to-date knowledge about the spatio-temporal structure of sea level variability along coastal zones and how signals observed at tide gauge sites relate to the broader-scale open ocean variability. The Workshop also stimulated discussions on how satellite data, observations from tide gauges and other in situ measurements, together with numerical simulations, can help in improving our understanding of the different processes influencing coastal sea level over varying time scales.\n\nMore specifically, the objectives of the Workshop were:\n\n(1)\nTo review our current understanding of coastal sea level change and variability, from seasonal to multi-decadal time scales, and characterize the relationship between large-scale open ocean processes and coastal sea level;\n\n(2)\nTo review available observing systems providing information on sea level in coastal areas and identify primary gaps and uncertainties;\n\n(3)\nTo assess the ability of ocean model-data syntheses in estimating coastal sea level variations and of atmosphere–ocean global coupled models in projecting future sea level changes.\n\nThe objectives above led to mapping of coastal regions and timescales where short cross-shore spatial scales are known to lead to sea level differences in coastal and adjacent zones, an exploratory survey of the dynamical and other factors relevant for those differences, and a first assessment of modelling needs for improved representation of the coastal sea level in such regions.\n\nAmong the Workshop’s outcomes, one can mention:\n\n(1)\nA better understanding of the forcing factors that affect coastal sea level and of the role of large-scale climate signals;\n\n(2)\nThe identification of a set of priorities for the development of an optimal and integrated (satellite and ground-based) coastal observing system;\n\n(3)\nThe development of strategies to increase model capabilities to forecast short-term processes and project longer-term coastal changes.\n\nThe Workshop resulted in a collection of scientific articles that provide a detailed overview of its main themes, from the understanding of different physical processes to observational and modelling issues. One basic issue in discussing sea level research has been the lack of a consistent and well-defined terminology, which can hamper efficient communication across the different disciplines working on sea level science. The paper by Gregory et al. (2019) defines various concepts and terms associated with sea level and sea level changes and proposes a revised terminology to be adopted when discussing sea level and related issues.\n\nObservational aspects addressed during the Workshop included satellite altimetry measurements of coastal sea level changes, space gravimetry observations of ocean bottom pressure, satellite scatterometer observations of winds, satellite observations of sea surface salinity and temperature, ocean and atmospheric reanalysis products, tide gauges and precise positioning techniques (GNSS, InSAR) for measuring vertical land motions. The article by Marcos et al. (2019) discusses current sea level observing systems and related parameters in the coastal zone, focusing on tide gauges and related vertical land motion measurements. Observations of bottom pressure and steric height, as well as wind waves and near-shore bathymetry, are also reviewed. In addition, Vignudelli et al. (2019) provide an overview of the current limitations of classical satellite altimetry and the promise of wide-swath altimetry to monitor sea level within 10–20 km of the coast. They also show that adapted data reprocessing and the use of new technology (such as synthetic-aperture radar altimetry on CryoSat and the Sentinel 3 satellites) allow valid sea level data to be collected very close to the coast, so that sea level variations can be determined with an increase in accuracy along the world’s coastal zones.\n\nConsiderable attention at the Workshop was devoted to both local and remote causes and physical processes affecting coastal sea level. The article by Woodworth et al. (2019) discusses the broad variety of forcing factors and physical mechanisms responsible for sea level changes at the coast, on sub-daily to multi-decadal time scales. Vertical land motions causing relative sea level changes are also discussed. The paper sets the stage for more detailed treatment of several less well-understood subjects by other authors. In Piecuch et al. (2019), an overview is provided of local atmospheric wind and pressure effects on coastal sea level variations, and the ability of simple (constant-density) ocean models to explain existing tide gauge observations. Specific examples are discussed for a few selected regions, highlighting the dependence of the results on timescale, shelf width and other factors. In the article by Durand et al. (2019), the impact of river run-off on coastal sea level change is reviewed, focusing on large deltas and estuaries. The paper presents the theoretical background to explain the halosteric (pertaining to changes in the salinity of seawater) and largely barystatic (due to the mass of water added to the ocean) effects on coastal sea level associated with river discharge, provides a review of existing observations, in particular, from space, of river run-off at the coast and discusses new modelling and observational challenges.\n\nAmong important physical processes discussed at the Workshop, the article by Hughes et al. (2019) addresses the role played by coastal-trapped waves on coastal sea level and related issues. Hughes et al. (2019) define and explain the wave properties and their impact on shelf sea dynamics as well as how open ocean dynamics leads to coastal signals and the specific influence of coastal-trapped waves. On another topic, Han et al. (2019) deal with the impact of natural internal modes, such as the El Niño-Southern Oscillation, Indian Ocean Dipole and North Atlantic Oscillation, on coastal sea level on all major ocean basins. The paper discusses the importance of both remote and local dynamical processes associated with climate modes in causing substantial interannual and longer variability in sea level at the coast. Han et al. (2019) stress the need for longer observations and dedicated modelling for improved treatment of climate modes and their impacts on coastal sea level forecasts and projections.\n\nSeveral other papers discuss processes with potential importance for coastal sea level variability that have historically received less attention. Penduff et al. (2019) demonstrate that mesoscale turbulence (now resolved in high-resolution global oceanic hindcasts) can induce substantial random fluctuations in coastal sea level on monthly and longer time scales. Implications for coastal sea level variations in different regions of the world’s oceans are discussed. Dodet et al. (2019) focus on the contribution of wind-generated waves at the coast and their long-term effect on coastal sea level changes. The physical mechanisms are presented, as well as the limitations and perspectives for further process understanding and observational improvement. The article by Idier et al. (2019) provides an overview of interactions between the mean sea level at the coast, and tides, surges and flooding. Idier et al. (2019) investigate how the sea level can be altered by the complex interacting processes with various time scales occurring at the coast in different types of environments.\n\nCoastal sea level projections and related uncertainties received considerable attention at the Workshop. Articles by Carson et al. (2019) and van de Wal et al. (2019) both discuss sources of uncertainties from process-based models, and current limitations and prospects for improving projections at the coast. While van de Wal et al. (2019) provide an overview for global, regional and extreme (triggered by storm surges, waves, tides or a combination of these processes) sea level projections, Carson et al. (2019) focus on uncertainty factors that contribute to the current large spread in regional sea level projections, relative to the global mean, and also consider the detection of anthropogenic trend signals, from global to local scales.\n\nAn important issue is how the information gained by the scientific community on possible future sea level changes is transferred to coastal adaptation practitioners and end-users with effectively communicated uncertainty. Poor knowledge of the different contributions to sea level change leads to inaccuracies in the description of the uncertainties in coastal sea level projections. Deep uncertainty on the ice sheet response to climate change remains, generating deep uncertainty in the high-end scenarios of coastal sea level rise. The paper by Jevrejeva et al. (2019) explores these issues. They focus on probabilistic projections, initially demanded by some users, and analyze how those projections can effectively describe the dominant uncertainty in some of the decision frameworks adopted by coastal engineers. They also underline the limitation of such an approach, in particular for deep uncertainty, and propose ways forward.\n\nIn summary, the Workshop highlighted the complex nature and the many factors associated with coastal sea level variability and the need for continued and coordinated multi-disciplinary efforts for improved monitoring and predicting capabilities. Apart from tide gauge and vertical land motion data, and better resolved satellite altimetry measurements characterizing variability adjacent to the coast, equal attention needs to be given to several other variables (e.g., bottom pressure, temperature, salinity, surface waves, coastal run-off and surface atmospheric forcing fields). Improved modelling efforts are important to resolve links between open and coastal ocean processes, effects of coastal run-off, eddies and other intrinsic ocean variability, and the interactions of wind waves and other high-frequency processes (tides, surges) with mean sea level. Additionally, advances in understanding and modelling of climate modes and ice sheet dynamics are needed for more reliable long-term projections of coastal sea level variability.\n\nThe organizers of this Workshop thank all the referees for their hard work, which improved the quality of the papers published here, the Editor in Chief, Professor Michael Rycroft, for his efforts, and many members of Springer Nature who assisted in preparing this Special Issue of Surveys in Geophysics. The sponsorship of the Workshop by ISSI is gratefully acknowledged.\n\nhttps://link.springer.com/article/10.1007/s10712-019-09574-4","authors":["Rui M. Ponte","Benoit Meyssignac","Catia M. Domingues","Detlef Stammer"],"meta":["October 2019Surveys in Geophysics 40(6):1-5","DOI:10.1007/s10712-019-09574-4","Projects: Understanding spread in regional sea level rise projections: the role of changing ocean properties and circulation processesOcean Heat Content and Sea Level"],"references":["345435993_Forcing_Factors_Affecting_Sea_Level_Changes_at_the_Coast","336955811_Uncertainties_in_Long-Term_Twenty-First_Century_Process-Based_Coastal_Sea-Level_Projections","336847599_Satellite_Altimetry_Measurements_of_Sea_Level_in_the_Coastal_Zone","336413579_Trends_of_Coastal_Sea_Level_Between_1993_and_2015_Imprints_of_Atmospheric_Forcing_and_Oceanic_Chaos","335245851_Impacts_of_Basin-Scale_Climate_Modes_on_Coastal_Sea_Level_a_Review","335181581_Probabilistic_Sea_Level_Projections_at_the_Coast_by_2100","335104162_Climate_Model_Uncertainty_and_Trend_Detection_in_Regional_Sea_Level_Projections_A_Review","334747888_The_Contribution_of_Wind-Generated_Waves_to_Coastal_Sea-Level_Changes","334061273_Interactions_Between_Mean_Sea_Level_Tide_Surge_Waves_and_Flooding_Mechanisms_and_Contributions_to_Sea_Level_Variations_at_the_Coast","333027202_Impact_of_Continental_Freshwater_Runoff_on_Coastal_Sea_Level"]}