{"id":"336594092_DBpedia_FlexiFusion_the_Best_of_Wikipedia_Wikidata_Your_Data","abstract":"The data quality improvement of DBpedia has been in the focus of many publications in the past years with topics covering both knowledge enrichment techniques such as type learning, taxonomy generation, interlinking as well as error detection strategies such as property or value outlier detection, type checking, ontology constraints, or unit-tests, to name just a few. The concrete innovation of the DBpedia FlexiFusion workflow, leveraging the novel DBpedia PreFusion dataset, which we present in this paper, is to massively cut down the engineering workload to apply any of the vast methods available in shorter time and also make it easier to produce customized knowledge graphs or DBpedias. While FlexiFusion is flexible to accommodate other use cases, our main use case in this paper is the generation of richer, language-specific DBpedias for the 20+ DBpedia chapters, which we demonstrate on the Catalan DBpedia. In this paper, we define a set of quality metrics and evaluate them for Wikidata and DBpedia datasets of several language chapters. Moreover, we show that an implementation of FlexiFusion, performed on the proposed PreFusion dataset, increases data size, richness as well as quality in comparison to the source datasets.","authors":["Johannes Frey","Marvin Hofer","Daniel Obraczka","Jens Lehmann"],"meta":["October 2019","DOI:10.1007/978-3-030-30796-7_7","In book: The Semantic Web – ISWC 2019 (pp.96-112)"],"references":["317888211_Comparative_Evaluation_of_Distributed_Clustering_Schemes_for_Multi-source_Entity_Resolution","308902492_Holistic_Entity_Clustering_for_Linked_Data","294874596_LDIF_-_Linked_Data_Integration_Framework","289520919_A_Survey_of_Current_Link_Discovery_Frameworks","280104651_Wikidata_through_the_Eyes_of_DBpedia","259828947_Test-driven_Evaluation_of_Linked_Data_Quality","254462230_Sieve_linked_data_quality_assessment_and_fusion","238121998_Conflict_Handling_Strategies_in_an_Integrated_Information_System","234814585_Automatic_data_fusion_with_HumMer","4133434_Schema_matching_using_duplicates","331042209_Incremental_Clustering_on_Linked_Data","328645468_Engineering_Agile_Big-Data_Systems","313073822_DBpedia_A_large-scale_multilingual_knowledge_base_extracted_from_wikipedia"]}