{"id":"336531883_Topologies_of_Organization_Space_in_Continuous_Deformation","abstract":"This paper offers to extend existing discussions about the socio-material production of organizational space through the concept of topology. It does so by: (1) connecting the concept of topology to existing approaches to spatial organization that emphasize its socio-material and open-ended emergence; (2) theorizing organizational space as being in constant deformation across different topological shapes; and (3) exploring this in an empirical example that juxtaposes a management meeting with its interruption. The empirical material is collected through the method of shadowing managers at a Danish school. Theoretically, the paper argues that the shaping of space is contingent upon dis/continuities between (non)human agencies. The topological deformation of space testifies to the continuous but under-acknowledged work provided by (non)human agencies to both achieve and challenge the stability of organizational space. It further situates the boundary between inside and outside as a transient condition. This renders spatial matters such as scale and size situational achievements. Topology thus implies that we cannot in advance scale organization into micro and macro spatialities, and further, foregrounds the inherent dis/organization of space.","authors":["Helene Ratner"],"meta":["October 2019Organization Studies 41(2):017084061987446","DOI:10.1177/0170840619874464"],"references":["329173528_Emerging_data_infrastructures_and_the_new_topologies_of_education_policy","344800471_After_Method_Mess_in_Social_Science_Research","336987614_Reclaiming_resilience_and_safety_Resilience_activation_in_the_critical_period_of_crisis","328473013_The_Governmental_Topologies_of_Database_Devices","319990853_Reconstructing_organization_The_loungification_of_society","317805559_The_Materiality_of_Absence_Organizing_and_the_case_of_the_incomplete_cathedral","316004002_Spatiality_as_Care_A_Heideggerian_Perspective_on_Sociomaterial_Practices","315594358_Dark_organizational_theory","313770576_The_Manager's_Job_Folklore_and_Fact","312578899_The_manager's_job_folklore_and_fact"]}