{"id":"336529254_Developing_a_FHIR-based_EHR_Phenotyping_Framework_A_Case_Study_for_Identification_of_Patients_with_Obesity_and_Multiple_Comorbidities_from_Discharge_Summaries","abstract":"Background: \nStandards-based clinical data normalization has become a key component of effective data integration and accurate phenotyping for secondary use of electronic healthcare records (EHR) data. HL7 Fast Healthcare Interoperability Resources (FHIR) is an emerging clinical data standard for exchanging electronic healthcare data and has been used in modeling and integrating both structured and unstructured EHR data for a variety of clinical research applications. The overall objective of this study is to develop and evaluate a FHIR-based EHR phenotyping framework for identification of patients with obesity and its multiple comorbidities from semi-structured discharge summaries leveraging a FHIR-based clinical data normalization pipeline (known as NLP2FHIR).\n\nMethods: \nWe implemented a multi-class and multi-label classification system based on the i2b2 Obesity Challenge task to evaluate the FHIR-based EHR phenotyping framework. Two core parts of the framework are: a) the conversion of discharge summaries into corresponding FHIR resources - Composition, Condition, MedicationStatement, Procedure and FamilyMemberHistory using the NLP2FHIR pipeline, and b) the implementation of four machine learning algorithms (logistic regression, support vector machine, decision tree, and random forest) to train classifiers to predict disease state of obesity and 15 comorbidities using features extracted from standard FHIR resources and terminology expansions. We used the macro- and micro-averaged precision (P), recall (R), and F1 score (F1) measures to evaluate the classifier performance. We validated the framework using a second obesity dataset extracted from the MIMIC-III database.\n\nResults: \nUsing the NLP2FHIR pipeline, 1237 clinical discharge summaries from the 2008 i2b2 obesity challenge dataset were represented as the instances of the FHIR Composition resource consisting of 5677 records with 16 unique section types. After the NLP processing and FHIR modeling, a set of 244,438 FHIR clinical resource instances were generated. As the results of the four machine learning classifiers, the random forest algorithm performed the best with F1-micro(0.9466)/F1-macro(0.7887) and F1-micro(0. 9536)/F1-macro(0. 6524) for intuitive classification (reflecting medical professionals' judgments) and textual classification (reflecting the judgments based on explicitly reported information of diseases), respectively. The MIMIC-III obesity dataset was successfully integrated for prediction with minimal configuration of the NLP2FHIR pipeline and machine learning models.\n\nConclusions: \nThe study demonstrated that the FHIR-based EHR phenotyping approach could effectively identify the state of obesity and multiple comorbidities using semi-structured discharge summaries. Our FHIR-based phenotyping approach is a first concrete step towards improving the data aspect of phenotyping portability across EHR systems and enhancing interpretability of the machine learning-based phenotyping algorithms.","authors":["Na Hong","Andrew Wen","Daniel J. Stone","Shintaro Tsuji"],"meta":["October 2019Journal of Biomedical Informatics 99:103310","DOI:10.1016/j.jbi.2019.103310"],"references":["340816850_Considerations_for_Improving_the_Portability_of_Electronic_Health_Record-Based_Phenotype_Algorithms","332190210_Developing_a_portable_natural_language_processing_based_phenotyping_system","322695006_Scalable_and_accurate_deep_learning_for_electronic_health_records","313207323_Machine_Learning_and_Electronic_Health_Records_A_Paradigm_Shift","303499206_MIMIC-III_a_freely_accessible_critical_care_database","281815340_Observational_Health_Data_Sciences_and_Informatics_OHDSI_Opportunities_for_Observational_Researchers","260874904_MedXN_an_Open_Source_Medication_Extraction_and_Normalization_Tool_for_Clinical_Text","237069871_The_Electronic_Medical_Records_and_Genomics_eMERGE_Network_Past_present_and_future","236113469_Comprehensive_temporal_information_detection_from_clinical_text_Medical_events_time_and_TLINK_identification","230810877_Next-generation_phenotyping_of_electronic_health_records","46158275_Mayo_Clinical_Text_Analysis_and_Knowledge_Extraction_System_cTAKES_Architecture_component_evaluation_and_applications","331439682_Standardizing_Heterogeneous_Annotation_Corpora_Using_HL7_FHIR_for_Facilitating_their_Reuse_and_Integration_in_Clinical_NLP","327140086_A_case_study_evaluating_the_portability_of_an_executable_computable_phenotype_algorithm_across_multiple_institutions_and_electronic_health_record_environments","325720250_Integrating_Structured_and_Unstructured_EHR_Data_Using_an_FHIR-based_Type_System_A_Case_Study_with_Medication_Data","320763828_DeepPhe_A_Natural_Language_Processing_System_for_Extracting_Cancer_Phenotypes_from_Clinical_Records","51141496_Using_Electronic_Health_Records_to_Drive_Discovery_in_Disease_Genomics","26777569_Evaluation_of_a_Method_to_Identify_and_Categorize_Section_Headers_in_Clinical_Documents","24421055_Context_An_Algorithm_for_Determining_Negation_Experiencer_and_Temporal_Status_from_Clinical_Reports","24355580_Semantic_Classification_of_Diseases_in_Discharge_Summaries_Using_a_Context-aware_Rule-based_Classifier","24355578_A_System_for_Classifying_Disease_Comorbidity_Status_from_Medical_Discharge_Summaries_Using_Automated_Hotspot_and_Negated_Concept_Detection","24355575_Recognizing_Obesity_and_Comorbidities_in_Sparse_Data","7544212_Model_Formulation_HL7_Clinical_Document_Architecture_Release_2"]}