{"id":"336537757_Abnormal_Situations_Interpretation_in_Industry_40_using_Stream_Reasoning","abstract":"With the coming era of Industry 4.0, more assets and machines in plants are equipped with sensors which collect big amount of data for effective on-line equipment condition monitoring. Monitoring equipment conditions can not only reduce unplanned downtime by early detection of relevant situations like anomalies but also avoid unnecessary routine maintenance. For the detection of these situations it is necessary to integrate distributed, heterogeneous data sources and data streams. In this context, semantic web technologies are increasingly considered as key technologies to improve data integration. However, they are mainly used for data that is assumed not to change very often in time. In order to tackle this issue, stream reasoning combines reasoning and stream processing methods. Such a combination enables the processing of dynamic and heterogeneous data continuously produced from a large number of sources and implementing real-time services.\nThis paper presents an approach that uses stream reasoning to identify in real time certain situations that lead to potential failures. Early detection enables to choose the most appropriate decision to avoid the interruption of manufacturing processes. In order to achieve this, data collected from sensors are enriched with contextual information. The use of stream reasoning allows the integration of data from different data sources, with different underlying meanings, different temporal resolutions as well as the processing of these data in real time.","authors":["Franco Giustozzi","Julien Saunier","Cecilia Zanni-Merk"],"meta":["January 2019Procedia Computer Science 159:620-629","DOI:10.1016/j.procs.2019.09.217"],"references":["327302669_Context_Modeling_for_Industry_40_an_Ontology-Based_Proposal","325644558_The_Modular_SSN_Ontology_A_Joint_W3C_and_OGC_Standard_Specifying_the_Semantics_of_Sensors_Observations_Sampling_and_Actuation","305810003_Time_Ontology_in_Owl","281413252_A_Perspective_on_Knowledge_Based_and_Intelligent_Systems_Implementation_in_Industrie_40","278653001_Real-Time_Urban_Monitoring_in_Dublin_Using_Semantic_and_Stream_Technologies","274074382_Towards_a_Better_Understanding_of_Context_and_Context-Awareness","319394751_SPARQL_Query_Language_for_RDF","312512081_Semantic_representation_and_processing_of_hypoglycemic_events_derived_from_wearable_sensor_data","301241928_Automatic_condition_monitoring_system_for_crack_detection_in_rotating_machinery","285351248_Capturing_the_pulse_of_cities_Opportunity_and_research_challenges_for_robust_stream_data_reasoning"]}