{"id":"336564221_Exact_Simulation_of_Truncated_Levy_Subordinator","abstract":"A truncated Lévy subordinator is a Lévy subordinator in R + with Lévy measure restricted from above by a certain level b. In this paper, we study the path and distribution properties of this type of processes in detail and set up an exact simulation framework based on a marked renewal process. In particular, we focus on a typical specification of truncated Lévy subor-dinator, namely the truncated stable process. We establish an exact simulation algorithm for the truncated stable process, which is very accurate and efficient. Compared to the existing algorithm suggested in Chi (2012), our algorithm outperforms over all parameter settings. Using a distribution decomposition technique, we also develop an exact simulation algorithm for the truncated tempered stable process and other related processes. We illustrate an application of our algorithm as a valuation tool for stochastic hyperbolic discounting, and numerical analysis are provided to demonstrate the accuracy and effectiveness of our methods. We also show that variations of the result can also be used to sample two-sided truncated Lévy processes , two-sided Lévy processes via subordinating Brownian motions, and truncated Lévy driven Ornstein-Uhlenbeck processes.","authors":["Angelos Dassios","Jia Wei Lim","Yan Qu"],"meta":["October 2019ACM Transactions on Modeling and Computer Simulation 30(3)","DOI:10.1145/3368088","Project: Efficient Simulation in Financial Engineering and Actuarial Science"],"references":["343933834_Exact_Simulation_of_Ornstein-Uhlenbeck_Tempered_Stable_Processes","335291632_Simulations_on_Levy_subordinators_and_Levy_driven_contagion_models","335079172_Exact_Simulation_of_Gamma-driven_Ornstein-Uhlenbeck_Processes_with_Finite_and_Infinite_Activity_Jumps","305973409_Approximations_of_small_jumps_of_Levy_processes_with_a_view_towards_simulation","331441017_Exact_simulation_of_generalised_Vervaat_perpetuities","312347751_Robust_Asset_Pricing_with_Stochastic_Hyperbolic_Discounting","305981915_On_a_stochastic_difference_equation_and_a_representation_of_non-negative_infinitely_divisible_random_variables","282991985_Non-Gaussian_Ornstein-Uhlenbeck_based_models_and_some_of_their_uses_in_financial_economics","274113739_On_a_Continuous_Analogue_of_the_Stochastic_Difference_Equation_X_n_rX_n-1_B_n","272024019_On_the_Theory_of_Brownian_Motion"]}