{"id":"336586189_Which_Academic_Search_Systems_are_Suitable_for_Systematic_Reviews_or_Meta-Analyses_Evaluating_Retrieval_Qualities_of_Google_Scholar_PubMed_and_26_other_Resources_OPEN_ACCESS","abstract":"Rigorous evidence identification is essential for systematic reviews and meta‐analyses (evidence syntheses), because the sample selection of relevant studies determines a review's outcome, validity, and explanatory power. Yet, the search systems allowing access to this evidence provide varying levels of precision, recall, and reproducibility and also demand different levels of effort. To date, it remains unclear which search systems are most appropriate for evidence synthesis and why. Advice on which search engines and bibliographic databases to choose for systematic searches is limited and lacking systematic, empirical performance assessments. This study investigates and compares the systematic search qualities of 28 widely used academic search systems, including Google Scholar, PubMed and Web of Science. A novel, query‐based method tests how well users are able to interact and retrieve records with each system. The study is the first to show the extent to which search systems can effectively and efficiently perform (Boolean) searches with regards to precision, recall and reproducibility. We found substantial differences in the performance of search systems, meaning that their usability in systematic searches varies. Indeed, only half of the search systems analysed and only a few Open Access databases can be recommended for evidence syntheses without adding substantial caveats. Particularly, our findings demonstrate why Google Scholar is inappropriate as principal search system. We call for database owners to recognise the requirements of evidence synthesis, and for academic journals to re‐assess quality requirements for systematic reviews. Our findings aim to support researchers in conducting better searches for better evidence synthesis.","authors":["Michael Gusenbauer","Neal R Haddaway"],"meta":["March 2020Research Synthesis Methods 11(2):181-217","DOI:10.1002/jrsm.1378","Project: Research Methods, Information Retrieval, Digital Learning Processes, Information Economy"],"references":["345198498_Searching_for_studies_a_guide_to_information_retrieval_for_Campbell_systematic_reviews","336992092_Conceptual_and_practical_classification_of_research_reviews_and_other_evidence_synthesis_products","328873130_Google_Scholar_to_Overshadow_Them_All_Comparing_the_Sizes_of_12_Academic_Search_Engines_and_Bibliographic_Databases","328611458_Guidelines_and_Standards_for_Evidence_Synthesis_in_Environmental_Management_Version_50","328294504_Google_Scholar_Web_of_Science_and_Scopus_A_systematic_comparison_of_citations_in_252_subject_categories","324107231_ROSES_RepOrting_standards_for_Systematic_Evidence_Syntheses_pro_forma_flow-diagram_and_descriptive_summary_of_the_plan_and_conduct_of_environmental_systematic_reviews_and_systematic_maps","329880270_Precision_and_Relative_Recall_of_Search_Engines_A_Comparative_Study_of_Google_and_Yahoo","327046234_Google_Scholar_Web_of_Science_and_Scopus_a_systematic_comparison_of_citations_in_252_subject_categories","324791943_Mortality_and_morbidity_in_acutely_ill_adults_treated_with_liberal_versus_conservative_oxygen_therapy_IOTA_a_systematic_review_and_meta-analysis","323342031_Comparative_efficacy_and_acceptability_of_21_antidepressant_drugs_for_the_acute_treatment_of_adults_with_major_depressive_disorder_a_systematic_review_and_network_meta-analysis"]}