{"id":"336564435_Anomaly_detection_based_on_automated_OMA_and_mode_shape_changes_application_on_a_historic_arch_bridge","abstract":"The development of efficient vibration-based Structural Health Monitoring (SHM) methodologies, capable to timely detecting the onset of anomalies and damages in the structures, is still a challenging task for Civil Engineering community. Most of SHM strategies are based on automated operational modal analysis (OMA, i.e. the extraction of the modal parameters from the signals collected in operational conditions) and often on the monitoring of resonant frequencies. Alternatively, when a well distributed measurement grid is available on the structure, an further strategy for damage assessment should rely on evaluating the mode shape changes. Within this context, the paper is fo-cused on a damage detection strategy based on the variation in time of mode shape (using MAC) and mode complexity (using MPC and/or MPC). The reliability of this approach is exemplified using a short period of monitoring of the San Michele bridge in which the structure was subjected to extreme environmental conditions. The analysis was carried out through a fully automated procedure based on the interpretation of the stabilization diagrams (provided by SSI-Cov technique) and adaptable thresholds in the modal tracking process.","authors":["Gabriele Marrongelli","Carmelo Gentile","Antonella Saisi"],"meta":["October 2019","Conference: Anomaly detection based on automated OMA and mode shape changes: application on a historic arch bridge","Project: Vibration-based Structural Health Monitoring of Civil Engineering Structures: automated Operational Modal Analysis and Damage Detection"],"references":["328197191_A_new_automated_procedure_of_modal_identification_in_operational_conditions","288994091_Vibration-based_SHM_of_a_centenary_bridge_a_comparative_study_between_two_different_automated_OMA_techniques","275226521_Continuous_dynamic_monitoring_of_a_centenary_iron_bridge_for_structural_modification_assessment","261673897_Structural_health_monitoring_with_statistical_methods_during_progressive_damage_test_of_S101_Bridge","256103654_Fully_automated_operational_modal_analysis","333320332_Automated_modal_identification_in_operational_conditions_using_3D_stabilization_diagrams","296335770_Automated_modal_identification_and_tracking_Application_to_an_iron_arch_bridge","251600266_Vibration_based_structural_health_monitoring_of_an_arch_bridge_From_automated_OMA_to_damage_detection","238158508_One-year_monitoring_of_the_Z24-Bridge_environmental_effects_versus_damage_events","222910864_Stabilisation_diagrams_Pole_identification_using_fuzzy_clustering_techniques","222240989_Online_automatic_identification_of_the_modal_parameters_of_a_long_span_arch_bridge"]}