{"id":"336615615_Multi-Objective_Task_Scheduling_Using_Hybrid_Whale_Genetic_Optimization_Algorithm_in_Heterogeneous_Computing_Environment","abstract":"The system of cloud computing comprises of several servers that are inter-connected in a datacenter, provisioned dynamically to cater on-demand services through the front-end interface for the clients. Improvement in virtualization technology has made cloud computing a viable option for various application services development. Cloud datacenters process the tasks on the basis of pay as you use manner. Task scheduling is one of the important research challenges in cloud computing. The formulation of task scheduling probes has been depicted to be NP-hard hence identifying the solution for a bigger problem is intractable. The dissimilar feature of cloud resources makes task scheduling non-trivial. NP-hard problem arises due to the dynamic behavior of the dissimilar resources identified in the cloud computing environment. Task scheduling can be optimized using a meta-heuristic algorithm. In this paper, we have combined two meta-heuristic techniques, namely Whale Optimization Algorithm (WOA) and Genetic Algorithm (GA) to devise a new hybridized algorithm called as Whale Genetic Optimization Algorithm. Our aim is to minimize the makespan and cost while scheduling the tasks. The simulation is done by using Cloudsim toolkit. The results obtained shows significant reduction in the execution time that was measured in terms of enactment amelioration rate. These results were compared with the classical WOA and standard GA. The results of the proposed technique provide higher quality solution for task scheduling.","authors":["Gobalakrishnan Natesan","Arun Chokkalingam"],"meta":["February 2020Wireless Personal Communications 110(6)","DOI:10.1007/s11277-019-06817-w"],"references":["335064160_Job_Scheduling_Technique_for_Infrastructure_as_a_Service_Cloud_Using_an_Improved_League_Championship_Algorithm","322229941_Efficient_resource_management_techniques_in_cloud_computing_environment_a_review_and_discussion","321323527_CGSA_scheduler_A_multi-objective-based_hybrid_approach_for_task_scheduling_in_cloud_environment","318367297_An_extended_Intelligent_Water_Drops_algorithm_for_workflow_scheduling_in_cloud_computing_environment","329651410_Ant_Colony_Optimization","321101888_A_review_of_virtual_machine_VM_resource_scheduling_algorithms_in_cloud_computing_environment","315899171_A_task_scheduling_algorithm_considering_game_theory_designed_for_energy_management_in_cloud_computing","313744980_Opposition_Learning-Based_Grey_Wolf_Optimizer_Algorithm_for_Parallel_Machine_Scheduling_in_Cloud_Environment","312400485_An_Energy_Aware_Cost_Effective_Scheduling_Framework_for_Heterogeneous_Cluster_System","312297979_Scheduling_parallel_tasks_with_energy_and_time_constraints_on_multiple_manycore_processors_in_a_cloud_computing_environment"]}