{"id":"336654388_Self-Attention_and_Ingredient-Attention_Based_Model_for_Recipe_Retrieval_from_Image_Queries","abstract":"Direct computer vision based-nutrient content estimation is a demanding task, due to deformation and occlusions of ingredients, as well as high intra-class and low inter-class variability between meal classes. In order to tackle these issues, we propose a system for recipe retrieval from images. The recipe information can subsequently be used to estimate the nutrient content of the meal. In this study, we utilize the multi-modal Recipe1M dataset, which contains over 1 million recipes accompanied by over 13 million images. The proposed model can operate as a first step in an automatic pipeline for the estimation of nutrition content by supporting hints related to ingredient and instruction. Through self-attention, our model can directly process raw recipe text, making the upstream instruction sentence embedding process redundant and thus reducing training time, while providing desirable retrieval results. Furthermore, we propose the use of an ingredient attention mechanism, in order to gain insight into which instructions, parts of instructions or single instruction words are of importance for processing a single ingredient within a certain recipe. Attention-based recipe text encoding contributes to solving the issue of high intra-class/low inter-class variability by focusing on preparation steps specific to the meal. The experimental results demonstrate the potential of such a system for recipe retrieval from images. A comparison with respect to two baseline methods is also presented.","authors":["Matthias Fontanellaz","Stergios Christodoulidis","Stavroula Mougiakakou"],"meta":["October 2019","DOI:10.1145/3347448.3357163","Conference: the 5th International Workshop"],"references":["332194296_Global_diet_and_health_old_questions_fresh_evidence_and_new_horizons","326140829_Cross-Modal_Retrieval_in_the_Cooking_Context_Learning_Semantic_Text-Image_Embeddings","321095542_Grab_Pay_and_Eat_Semantic_Food_Detection_for_Smart_Restaurants","320964718_Learning_Cross-Modal_Embeddings_for_Cooking_Recipes_and_Food_Images","319944339_DeepFood_Automatic_Multi-Class_Classification_of_Food_Ingredients_Using_Deep_Learning","334353065_Recipe1M_A_Dataset_for_Learning_Cross-Modal_Embeddings_for_Cooking_Recipes_and_Food_Images","326334030_A_multi-task_learning_approach_for_meal_assessment","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","317558625_Attention_Is_All_You_Need","317341498_FOOD_IMAGE_ANALYSIS_SEGMENTATION_IDENTIFICATION_AND_WEIGHT_ESTIMATION"]}