{"id":"336610746_ML-ResNet_A_novel_network_to_detect_and_locate_myocardial_infarction_using_12_leads_ECG","abstract":"Background and objective\nMyocardial infarction (MI) is one of the most threatening cardiovascular diseases for human beings, which can be diagnosed by electrocardiogram (ECG). Automated detection methods based on ECG focus on extracting handcrafted features. However, limited by the performance of traditional methods and individual differences between patients, it's difficult for predesigned features to detect MI with high performance.\n\nMethods\nThe paper presents a novel method to detect and locate MI combining a multi-lead residual neural network (ML–ResNet) structure with three residual blocks and feature fusion via 12 leads ECG records. Specifically, single lead feature branch network is trained to automatically learn the representative features of different levels between different layers, which exploits local characteristics of ECG to characterize the spatial information representation. Then all the lead features are fused together as global features. To evaluate the generalization of proposed method and clinical utility, two schemes including the intra-patient scheme and inter-patient scheme are all employed.\n\nResults\nExperimental results based on PTB (Physikalisch-Technische Bundesanstalt) database shows that our model achieves superior results with the accuracy of 95.49%, the sensitivity of 94.85%, the specificity of 97.37%, and the F1 score of 96.92% for MI detection under the inter-patient scheme compared to the state-of-the-art. By contrast, the accuracy is 99.92% and the F1 score is 99.94% based on 5-fold cross validation under the intra-patient scheme. As for five types of MI location, the proposed method also yields an average accuracy of 99.72% and F1 of 99.67% in the intra-patient scheme.\n\nConclusions\nThe proposed method for MI detection and location has achieved superior results compared to other detection methods. However, further promotion of the performance based on MI location for the inter-patient scheme still depends significantly on the mass data and the novel model which reflects spatial location information of different leads subtly.","authors":["Chuang Han","li Shi"],"meta":["October 2019Computer Methods and Programs in Biomedicine 185:105138","DOI:10.1016/j.cmpb.2019.105138","Project: ECG intelligent diagnosis"],"references":["330619974_A_Novel_Approach_for_Detection_of_Myocardial_Infarction_From_ECG_Signals_of_Multiple_Electrodes","330203337_Cardiologist-level_arrhythmia_detection_and_classification_in_ambulatory_electrocardiograms_using_a_deep_neural_network","327227816_Fourth_universal_definition_of_myocardial_infarction_2018","327204739_Multiclass_classification_of_myocardial_infarction_with_convolutional_and_recurrent_neural_networks_for_portable_ECG_devices","326284749_Intelligent_system_based_on_Genetic_Algorithm_and_support_vector_machine_for_detection_of_myocardial_infarction_from_ECG_signals","326259262_A_novel_automated_diagnostic_system_for_classification_of_myocardial_infarction_ECG_signals_using_an_optimal_biorthogonal_filter_bank","339075222_MFB-CBRNN_A_Hybrid_Network_for_MI_Detection_Using_12-Lead_ECGs","331868415_Automated_interpretable_detection_of_myocardial_infarction_fusing_energy_entropy_and_morphological_features","331035341_Classification_of_Myocardial_Infarction_with_Multi-Lead_ECG_Signals_and_Deep_CNN","326744882_Multiple-feature-branch_convolutional_neural_network_for_myocardial_infarction_diagnosis_using_electrocardiogram"]}