{"id":"336616045_Repetitive_Strain_Injury_RSI_Amongst_Staff_and_Students_of_Computer_Science_Department_of_Kwame_Nkrumah_University_of_Science_and_Technology_KNUST","abstract":"Computers have now become a part of the day to day activities of almost every field of human work including education, health, agriculture, etc. Many people now work for longer hours due to the aid of computers. With the much benefits these computers, also comes the numerous problems which they pose on users, with Repetitive Strain Injury (RSI) being the commonest among them. Different approach such as questionnaires and personal interviews were used in the quest for these symptoms among various users of computers within the Computer Science Department of KNUST. The result obtained showed that majority suffered from pain in one or more parts of the body, that is, eyestrain, low back pain, wrist pain, finger pain or foot pain. These were all due to the duration of computer usage, size and type of monitors used, the type of chair used, the level of brightness of screens among others it was then discovered that the number of hours spent on computers are relative to the causes of pain in one or more parts of the body, hence increases the chances of being exposed to RSI.","authors":["Benjamin Odoi-Lartey","Stephanie Mensah Opoku","Edward Danso Ansong"],"meta":["October 2019International Journal of Computer Applications 177(8):37-39","DOI:10.5120/ijca2019919471","Projects: An Enhancement of Data Security in Cloud Computing with an Implementation of a Two-Level Cryptographic Technique, using AES and ECC AlgorithmRepetitive Strain Injury (RSI) Amongst Staff and Students of Computer Science Department of Kwame Nkrumah University of Science and Technology (KNUST)"],"references":["7829716_Musculoskeletal_pain_associated_with_the_use_of_computer_systems_in_Nigeria","227542486_A_prospective_study_of_computer_users_I_Study_Design_and_Incidence_of_Musculoskeletal_Symptoms_and_Disorders","26310703_Prevalence_of_Work-Related_Upper_Limbs_Symptoms_WRULS_Among_Office_Workers","23160375_Physical_discomfort_and_psychosocial_job_stress_among_male_and_female_operators_at_telecommunication_call_centers_in_Taiwan","10942874_Work-related_musculoskeletal_disorders_of_the_upper_limb"]}