{"id":"336615876_An_analytical_study_of_information_extraction_from_unstructured_and_multidimensional_big_data","abstract":"Abstract Process of information extraction (IE) is used to extract useful information from unstructured or semi-structured data. Big data arise new challenges for IE techniques with the rapid growth of multifaceted also called as multidimensional unstructured data. Traditional IE systems are inefficient to deal with this huge deluge of unstructured big data. The volume and variety of big data demand to improve the computational capabilities of these IE systems. It is necessary to understand the competency and limitations of the existing IE techniques related to data pre-processing, data extraction and transformation, and representations for huge volumes of multidimensional unstructured data. Numerous studies have been conducted on IE, addressing the challenges and issues for different data types such as text, image, audio and video. Very limited consolidated research work have been conducted to investigate the task-dependent and task-independent limitations of IE covering all data types in a single study. This research work address this limitation and present a systematic literature review of state-of-the-art techniques for a variety of big data, consolidating all data types. Recent challenges of IE are also identified and summarized. Potential solutions are proposed giving future research directions in big data IE. The research is significant in terms of recent trends and challenges related to big data analytics. The outcome of the research and recommendations will help to improve the big data analytics by making it more productive.","authors":["Kiran Adnan","Rehan Akbar"],"meta":["October 2019Journal of Big Data 6(1)","DOI:10.1186/s40537-019-0254-8","Project: Usability Enhancement Model for unstructured data"],"references":["334897640_Deep_Learning_Based_Representation_for_Face_Recognition","334810084_Automatic_speaker_recognition_with_enhanced_swallow_swarm_optimization_and_ensemble_classification_model_from_speech_signals","333091458_Visual_relationship_detection_based_on_bidirectional_recurrent_neural_network","332755613_Toward_an_automatic_speech_recognition_system_for_amazigh-tarifit_language","331680018_Scientific_Literature_based_Big_Data_Analysis_for_Technology_Insight","335362575_FANet_An_End-to-End_Full_Attention_Mechanism_Model_for_Multi-Oriented_Scene_Text_Recognition","332987400_Visual_Relationship_Detection_with_Language_prior_and_Softmax","332219401_Face_Recognition_in_Low-Quality_Images_using_Adaptive_Sparse_Representations","331790221_Supervised_Deep_Learning_in_Face_Recognition","331790067_Introduction_to_Deep_Learning"]}