{"id":"336612303_Definitions_methods_and_applications_in_interpretable_machine_learning","abstract":"Machine-learning models have demonstrated great success in learning complex patterns that enable them to make predictions about unobserved data. In addition to using models for prediction, the ability to interpret what a model has learned is receiving an increasing amount of attention. However, this increased focus has led to considerable confusion about the notion of interpretability. In particular, it is unclear how the wide array of proposed interpretation methods are related and what common concepts can be used to evaluate them. We aim to address these concerns by defining interpretability in the context of machine learning and introducing the predictive, descriptive, relevant (PDR) framework for discussing interpretations. The PDR framework provides 3 overarching desiderata for evaluation: predictive accuracy, descriptive accuracy, and relevancy, with relevancy judged relative to a human audience. Moreover, to help manage the deluge of interpretation methods, we introduce a categorization of existing techniques into model-based and post hoc categories, with subgroups including sparsity, modularity, and simulatability. To demonstrate how practitioners can use the PDR framework to evaluate and understand interpretations, we provide numerous real-world examples. These examples highlight the often underappreciated role played by human audiences in discussions of interpretability. Finally, based on our framework, we discuss limitations of existing methods and directions for future work. We hope that this work will provide a common vocabulary that will make it easier for both practitioners and researchers to discuss and choose from the full range of interpretation methods.","authors":["William Murdoch","Chandan Singh","Karl Kumbier","Reza Abbasi Asl"],"meta":["October 2019Proceedings of the National Academy of Sciences 116(44):201900654","DOI:10.1073/pnas.1900654116","Project: Interpretability"],"references":["350701622_seaborn_statistical_data_visualization","336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","331698830_Towards_better_understanding_of_gradient-based_attribution_methods_for_Deep_Neural_Networks","328884189_The_DeepTune_framework_for_modeling_and_characterizing_neurons_in_visual_cortex_area_V4","324727926_Towards_better_understanding_of_Gradient-based_Attribution_Methods_for_Deep_Neural_Networks","330880261_Explaining_Explanations_An_Overview_of_Interpretability_of_Machine_Learning","328353049_Refining_interaction_search_through_signed_iterative_Random_Forests","327606791_Classification_And_Regression_Trees","326047565_Interpretability_of_deep_learning_models_A_survey_of_results","323068799_Biclustering_by_sparse_canonical_correlation_analysis"]}