{"id":"336694692_P1027The_risk_of_dementia_and_catheter_ablation_for_atrial_fibrillation_a_nationwide_cohort_study","abstract":"Background\nAtrial fibrillation (AF) is associated with all forms of dementia, including Alzheimer's disease. Catheter ablation of AF reduces the number of AF episodes, prolongs the time in sinus rhythm, and improves quality of life. However, it is still unclear if catheter ablation for AF improve cognitive function and prevent dementia. Our objective was to compare long-term outcome regarding dementia and type of dementia in AF patients with and without ablation, and about long-term exposure to anticoagulants.\n\nMethods\nWe identified all 801,701 patients with a diagnosis of AF from 2006 to 2015 in the Korean national health insurance service database. During ten years, 10,979 AF ablations were performed among 9,768 individuals. Propensity scores for the likelihood of AF ablation were obtained by logistic regression. Propensity score (PS) matching was used to construct two cohorts of equal size (n=9,768) with similar characteristics in 16 dimensions.\n\nResults\nPatients who had undergone catheter ablation were younger (57.2 vs. 65.6 years, P<0.001) and healthier (mean CHA2DS2-VASc scores 2.5±1.7 vs. 3.6±2.1, p<0.001) than other patients with AF. Mean follow-up was 5.5±3.1 years. After propensity score matching, in the ablated group, 184 patients suffered dementia compared with 650 in the matched non-ablated (annual rates 0.42 vs. 1.08%, P<0.001). While a total of 134 ablated and 379 non-ablated patients had Alzheimer disease (annual rates 0.31 vs. 0.62%, p<0.001), 40 ablated and 191 non-ablated patients had vascular disease (annual rates 0.09 vs. 0.31%, p<0.001). After multivariable adjustments, catheter ablation was associated with lower risk of dementia (hazard ratio [HR] 0.46, 95% confidence interval [CI] 0.37–0.58), lower risk of Alzheimer disease (HR 0.61, 95% CI 0.46–0.79) and lower risk of vascular dementia (HR 0.27, 95% CI 0.19–0.38). Although the reduction of dementia and Alzheimer disease was observed after AF ablation regardless of thromboembolic risk, vascular dementia was reduced only among patients with CHA2DS2-VASc score ≥2 (HR 0.29, 95% CI 0.20–0.42).\nThe risk of dementia, RFCA vs. no-RFCA Type Propensity score matched ablation group vs. no ablation group adjusted HR (95% CI) P-value Overall dementia 0.46 (0.37–0.58) <0.001 Alzheimer dementia 0.61 (0.46–0.79) <0.001 Vascular dementia 0.27 (0.19–0.38) <0.001\n\nConclusion\nAblation may be associated with a lower incidence of dementia and both type of dementia in patients with AF. This finding appears more pronounced in patients with high thromboembolic risk factors.","authors":["Pil-Sung Yang","J H Sung","E Jang","Hee Tae Yu"],"meta":["October 2019European Heart Journal 40(Supplement_1)","DOI:10.1093/eurheartj/ehz747.0618"],"references":[]}