{"id":"336669682_The_Effectiveness_of_Using_Science_Technology_Engineering_and_Mathematics_STEM_Approach_on_the_Achievement_of_Students_of_the_Tenth_Grades_in_Mathematics","abstract":"This study aimed to investigate the effectiveness of using science, technology, engineering and mathematics (STEM) approach on the achievement of students of the tenth grade in mathematics in Palestine. The sample of the study consisted of 45 students of the tenth grade at Ibn al - Bitar Second Primary School for the academic year of 2016/ 2017. The members of the sample of the study were divided into two groups: an experimental group consisting of 23 students who studied logic unit using (STEM) approach and a control group consisting of 22 students who studied the same unit in the usual way. The results of the study indicated that there was a statistically significant difference a= 0. 05 in the post - academic achievement test in favor of the experimental group. The study recommended the use of the STEM approach in the teaching of mathematics where the results showed the effectiveness in the development of students› academic achievement, the need to train mathematics teachers to employ the STEM introduction in their mathematics education, and the training of teachers in computer science, programming and design in coordination with technology specialists, engineers and industrial institutions to promote students› research activities within a clear educational vision with specified objectives.\nKeywords: Science, Technology, Engineering, Mathematics (STEM) Approach, Achievement","authors":["Soheil Salha","Abdelrahman Mohammad Abu Sarah"],"meta":["October 2019","DOI:10.5281/zenodo.3474118","Project: Technology Education"],"references":["301343649_Pre-service_Teachers'_Mind_Maps_and_Opinions_on_STEM_Education_Implemented_in_an_Environmental_Literacy_Course","283097049_Robotics_to_Promote_Elementary_Education_Pre-service_Teachers'_STEM_Engagement_Learning_and_Teaching","282069044_In-service_Teachers'_Implementation_and_Understanding_of_STEM_Project_Based_Learning"]}