{"id":"336685513_Alypuhelin_ja_kasvokkaisen_vuorovaikutuksen_muuttuvat_kaytanteet","abstract":"Älypuhelimen käyttö on lisääntynyt nopeasti. Se on henkilökohtainen esine ja kulkee yleensä aina mukana. Siksi sen käyttö voi sijoittua keskelle melkein mitä tahansa vuorovaikutuskontekstia, varsinkin kun laite usein myös kutsuu äänen, värinän tai visuaalisten efektien avulla omistajaansa. Jatkuvasti käsillä olevat älypuhelimet ovat vaikuttaneet myös kasvokkaisen keskustelun käytänteisiin. Tarkastelemme artikkelissamme, miten älypuhelinten käyttö muokkaa samaan aikaan tapahtuvaa kasvokkaista vuorovaikutusta ja millaisia uusia aspekteja se siihen tuo. Olemme luoneet kaksi uutta käsitettä kuvaamaan näitä aspekteja: 1) tahmea medialaite ja 2) sivustakatsojan pimento. Tahmea medialaite kuvastaa tilanteita, joissa älypuhelinta käyttävää henkilöä on hankala saada mukaan tai pitää mukana kasvokkaisessa keskustelussa. Hänen huomionsa ei helposti irtoa ”tahmeasta” laitteesta, tai se palaa siihen nopeasti takaisin. Sivustakatsojan pimennolla tarkoitamme sitä, että sivustakatsojan on vaikea tietää, mitä älypuhelimen käyttäjä pieniruutuisella laitteellaan tekee tai sitä, missä vaiheessa tekeminen on ja onko hänen toimintaansa soveliasta keskeyttää. Tutkimuksemme perustuu etnometodologiaan ja etnometodologiseen vuorovaikutuksen analyysiin, mutta sovellamme tutkimuksissamme myös eläytymismenetelmää ja kvantitatiivisia tutkimusmenetelmiä.","authors":["Sanna Raudaskoski","Eerik Mantere","Satu Valkonen"],"meta":["September 2019Sosiologia 56(3):282-299","Project: New social norms in the smartphone era"],"references":["321168013_The_influence_of_parental_smartphone_use_eye_contact_and_'bystander_ignorance'_on_child_development","312384726_Tool_and_Machine_The_Affordances_of_the_Mobile_Phone","312044861_Kun_matkapuhelin_vie_vanhemman_huomion","309398589_Respecifying_Mediated_Interaction","283618186_A_Simplest_Systematics_for_the_Organization_of_Turn-Taking_for_Conversation","334062672_The_Cultural_Origins_of_Human_Cognition","324352933_The_Ecological_Approach_to_Visual_Perception","320182162_The_Perception_of_the_Environment_Essays_in_Livelihood_Dwelling_and_Skill","309092304_Parent_Perspectives_on_Their_Mobile_Technology_Use_The_Excitement_and_Exhaustion_of_Parenting_While_Connected","300408075_Media_multitasking_is_associated_with_distractibility_and_increased_prefrontal_activity_in_adolescents_and_young_adults"]}