{"id":"336620006_Multi-modal_Active_Learning_From_Human_Data_A_Deep_Reinforcement_Learning_Approach","abstract":"Human behavior expression and experience are inherently multimodal, and characterized by vast individual and contextual heterogeneity. To achieve meaningful human-computer and human-robot interactions, multi-modal models of the user’s states (e.g., engagement) are therefore needed. Most of the existing works that try to build classifiers for the user’s states assume that the data to train the models are fully labeled. Nevertheless, data labeling is costly and tedious, and also prone to subjective interpretations by the human coders. This is even more pronounced when the data are multi-modal (e.g., some users are more expressive with their facial expressions, some with their voice). Thus, building models that can accurately estimate the user’s states during an interaction is challenging. To tackle this, we propose a novel multi-modal active learning (AL) approach that uses the notion of deep reinforcement learning (RL) to find an optimal policy for active selection of the user’s data, needed to train the target (modality-specific) models. We investigate different strategies for multi-modal data fusion, and show that the proposed model-level fusion coupled with RL outperforms the feature-level and modality-specific models, and the naïve AL strategies such as random sampling, and the standard heuristics such as uncertainty sampling. We show the benefits of this approach on the task of engagement estimation from real-world child-robot interactions during an autism therapy. Importantly, we show that the proposed multi-modal AL approach can be used to efficiently personalize the engagement classifiers to the target user using a small amount of actively selected user’s data.","authors":["Ognjen Rudovic","Meiru Zhang","Björn Schuller","Rosalind Picard"],"meta":["October 2019","DOI:10.1145/3340555.3353742","Conference: 2019 International Conference on Multimodal Interaction"],"references":["335812064_A_Model-Free_Affective_Reinforcement_Learning_Approach_to_Personalization_of_an_Autonomous_Social_Robot_Companion_for_Early_Literacy_Education","330861905_Multimodal_Integration_of_Emotional_Signals_from_Voice_Body_and_Context_Effects_of_InCongruence_on_Emotion_Recognition_and_Attitudes_Towards_Robots","322950256_Personalized_Machine_Learning_for_Robot_Perception_of_Affect_and_Engagement_in_Autism_Therapy","334118013_Learning_to_Actively_Learn_Neural_Machine_Translation","334116990_Multimodal_Hierarchical_Reinforcement_Learning_Policy_for_Task-Oriented_Visual_Dialog","330054866_Multimodal_behavior_analysis_in_the_wild_An_introduction","328037051_An_Ensemble_Model_Using_Face_and_Body_Tracking_for_Engagement_Detection","322590933_Learning_how_to_Active_Learn_A_Deep_Reinforcement_Learning_Approach","320963917_Realtime_Multi-person_2D_Pose_Estimation_Using_Part_Affinity_Fields","319770186_EmoNets_Multimodal_deep_learning_approaches_for_emotion_recognition_in_video"]}