{"id":"336675822_The_First_Industrial_Revolution_Creation_of_a_New_Global_Human_Era","abstract":"The First Industrial Revolution began in England in about 1750-1760 that lasted to sometime between 1820 and 1840. It is one of the most distinguished turning points in human history. During this period human and animal labour technology transformed into machinery, such as the steam engine, the spinning jenny, coke smelting, puddling and rolling processes for making iron, etc. Industrial Revolution is renewed for global economic growth, increase in production and consumption of common people. The system of transportation communication through canals, road and rails had improved. Also banking and other financial systems improved to run the industries and business firms smoothly. Child and infant mortality rate decreased and fertility rate increased. As a result, population growth had dramatically changed. On the other hand, women and child labour has increased in dangerous and unhygienic condition. Factory workers have to work sixteen hours in a day merely to save the family from starvation. Industrial Revolution created a wide gap between the rich and the poor. An attempt has taken here to describe the various effects of Industrial Revolution.","authors":["Haradhan Kumar Mohajan"],"meta":["October 2019"],"references":["345794571_Reinterpretations_of_the_Industrial_Revolution","325551128_The_Cambridge_Economic_History_of_Modern_Britain","321348324_Socialisms_theories_and_practices","315196470_British_Economic_Growth_during_the_Industrial_Revolution","314555221_The_Stages_of_Economic_Growth_A_Non-Communist_Manifesto","313550887_Manifesto_of_the_Communist_Party","311777421_Coal_The_Key_to_the_British_Industrial_Revolution","300863554_Introduction_Agrarian_Fundamentalism_and_English_Agricultural_Development","287352124_Social_change_in_the_industrial_revolution_An_application_of_theory_to_the_British_cotton_industry","282193231_Debt_into_growth_how_sovereign_debt_accelerated_the_first_industrial_revolution"]}