{"id":"336749706_One_thousand_plant_transcriptomes_and_the_phylogenomics_of_green_plants","abstract":"Green plants (Viridiplantae) include around 450,000–500,000 species1,2 of great diversity and have important roles in terrestrial and aquatic ecosystems. Here, as part of the One Thousand Plant Transcriptomes Initiative, we sequenced the vegetative transcriptomes of 1,124 species that span the diversity of plants in a broad sense (Archaeplastida), including green plants (Viridiplantae), glaucophytes (Glaucophyta) and red algae (Rhodophyta). Our analysis provides a robust phylogenomic framework for examining the evolution of green plants. Most inferred species relationships are well supported across multiple species tree and supermatrix analyses, but discordance among plastid and nuclear gene trees at a few important nodes highlights the complexity of plant genome evolution, including polyploidy, periods of rapid speciation, and extinction. Incomplete sorting of ancestral variation, polyploidization and massive expansions of gene families punctuate the evolutionary history of green plants. Notably, we find that large expansions of gene families preceded the origins of green plants, land plants and vascular plants, whereas whole-genome duplications are inferred to have occurred repeatedly throughout the evolution of flowering plants and ferns. The increasing availability of high-quality plant genome sequences and advances in functional genomics are enabling research on genome evolution across the green tree of life.","authors":["One Thousand Plant Transcriptomes Initiative","Marcus A Koch","Hanghui Kong","Gildas Gâteblé"],"meta":["October 2019Nature","DOI:10.1038/s41586-019-1693-2"],"references":["325035030_Phylogenomic_inference_in_extremis_A_case_study_with_mycoheterotroph_plastomes","325017789_The_performance_of_coalescent-based_species_tree_estimation_methods_under_models_of_missing_data","324609234_Multiple_large-scale_gene_and_genome_duplications_during_the_evolution_of_hexapods","324261216_The_prevalence_of_terraced_treescapes_in_analyses_of_phylogenetic_data_sets","324127138_Plastid_phylogenomic_analysis_of_green_plants_A_billion_years_of_evolutionary_history","323465940_Testing_for_Polytomies_in_Phylogenetic_Species_Trees_Using_Quartet_Frequencies","323207224_The_Interrelationships_of_Land_Plants_and_the_Nature_of_the_Ancestral_Embryophyte","322766396_A_genome_for_gnetophytes_and_early_evolution_of_seed_plants","331311687_Statistical_binning_enables_an_accurate_coalescent-based_estimation_of_the_avian_tree","324919889_Impact_of_whole-genome_duplication_events_on_diversification_rates_in_angiosperms"]}