{"id":"336780917_Between_Truth_and_Power_The_Legal_Constructions_of_Informational_CapitalismThe_Legal_Constructions_of_Informational_Capitalism","abstract":"This book explores the relationships between legal institutions and political and economic transformation. It argues that as law is enlisted to help produce the profound economic and sociotechnical shifts that have accompanied the emergence of the informational economy, it is changing in fundamental ways. We are witnessing the emergence of legal institutions adapted to the information age, but their form and their substance remain undetermined and are the subjects of intense struggle. One level for legal-institutional transformation involves baseline understandings of entitlement and disentitlement. Both lawyers and laypeople tend to think of legal entitlements as relatively fixed, but the ongoing transformation in political economy has set things in motion in ways that traditional accounts do not contemplate. In particular, the datafication of important resources and the shift to a platform-based, massively intermediated communications environment have profoundly reshaped both the organization of economic activity and the patterns of information exchange. The authority of platforms is both practical and normative, and it has become both something taken for granted and a powerful force reshaping the law in its own image. Another level for legal-institutional transformation involves the structure and operation of regulatory and governance institutions. Patterns of institutional change in the networked information era express a generally neoliberalized and managerialist stance toward the law’s projects and processes. They reflect deeply embedded beliefs about the best uses of new technological capabilities to manage legal and regulatory processes and account for activities of legal and regulatory concern.","authors":["Julie E. Cohen"],"meta":["October 2019","DOI:10.1093/oso/9780190246693.001.0001","ISBN: 9780190246693"],"references":[]}