{"id":"336759665_Deep_learning_technology_for_improving_cancer_care_in_society_New_directions_in_cancer_imaging_driven_by_artificial_intelligence","abstract":"The goal of this study is to show emerging applications of deep learning technology in cancer imaging. Deep learning technology is a family of computational methods that allow an algorithm to program itself by learning from a large set of examples that demonstrate the desired behavior. Applications of deep learning technology to cancer imaging can assist pathologists in the detection and classification of cancer in the early stages of its development to allow patients to have appropriate treatments that can increase their survival. Statistical analyses and other analytical approaches, based on data of ScienceDirect (a source for scientific research), suggest that the sharp increase of the studies of deep learning technology in cancer imaging seems to be driven by high rates of mortality of some types of cancer (e.g., lung and breast) in order to solve consequential problems of a more accurate detection and characterization of cancer types to apply efficient anti-cancer therapies. Moreover, this study also shows sources of the trajectories of deep learning technology in cancer imaging at level of scientific subject areas, universities and countries with the highest scientific production in these research fields. This new technology, in accordance with Amara's law, can generate a shift of technological paradigm for diagnostic assessment of any cancer type and disease. This new technology can also generate socioeconomic benefits for poor regions because they can send digital images to labs of other developed regions to have diagnosis of cancer types, reducing as far as possible current gap in healthcare sector among different regions.","authors":["Mario Coccia"],"meta":["October 2019Technology in Society 60:101198","DOI:10.1016/j.techsoc.2019.101198"],"references":["335511979_RMDL_Recalibrated_Multi-instance_Deep_Learning_for_Whole_Slide_Gastric_Image_Classification","335478759_Deep_Learning_to_Improve_Breast_Cancer_Detection_on_Screening_Mammography","335457289_Automated_Lung_Nodule_Detection_and_Classification_Using_Deep_Learning_Combined_with_Multiple_Strategies","335125761_iW-Net_an_automatic_and_minimalistic_interactive_lung_nodule_segmentation_deep_network","333306122_Breast_cancer_outcome_prediction_with_tumour_tissue_images_and_machine_learning","335498832_Deep_Feature_Learning_for_Histopathological_Image_Classification_of_Canine_Mammary_Tumors_and_Human_Breast_Cancer","335305234_Learning_to_detect_lymphocytes_in_immunohistochemistry_with_deep_learning","334062233_Image_Classification_toward_Lung_Cancer_Recognition_by_Learning_Deep_Quality_Model","333997768_Deep_Learning_Techniques_for_Real_Time_Computer-Aided_Diagnosis_in_Colorectal_Cancer","333968431_Computer-Aided_Hepatocarcinoma_Diagnosis_Using_Multimodal_Deep_Learning"]}