{"id":"336745319_Using_Targeted_Feedback_to_Address_Common_Student_Misconceptions_in_Introductory_Programming_A_Data-Driven_Approach","abstract":"With the expansion of computer science (CS) education, CS teachers in K-12 schools should be cognizant of student misconceptions and be prepared to help students establish accurate understanding of computer science and programming. Digital tools, such as automated assessment systems, can be useful and supportive in teaching CS courses. This two-stage design-based research (DBR) study investigated the effects of targeted feedback in an automated assessment system for addressing common misconceptions of high school students in a Java-based introductory programming course. Based on students’ common errors and underlying misconceptions, targeted feedback messages were designed and provided for students. The quantitative analysis found that with targeted feedback students were more likely to correct the errors in their code. The qualitative analysis of students’ solutions revealed that when improving the code, students receiving feedback made fewer intermediate incorrect solutions. In other words, the targeted feedback messages may help to promote conceptual change and facilitate learning. Although the findings of this exploratory study showed evidence of the power of digital tools, more research is needed to make technology benefit more CS teachers.","authors":["Yizhou Qian","James D. Lehman"],"meta":["July 2019SAGE Open 9(4):215824401988513","DOI:10.1177/2158244019885136"],"references":["320679287_Students'_Misconceptions_and_Other_Difficulties_in_Introductory_Programming_A_Literature_Review","316947518_Do_Enhanced_Compiler_Error_Messages_Help_Students_Results_Inconclusive","316947290_iSnap_Towards_Intelligent_Tutoring_in_Novice_Programming_Environments","311488296_Combining_Big_Data_and_Thick_Data_Analyses_for_Understanding_Youth_Learning_Trajectories_in_a_Summer_Coding_Camp","309086464_Measuring_computer_science_pedagogical_content_knowledge_An_exploratory_analysis_of_teaching_vignettes_to_measure_teacher_knowledge","321512261_Those_who_Understand_Knowledge_Growth_in_Teaching","317223917_Novice_Java_Programming_Mistakes_Large-Scale_Data_vs_Educator_Beliefs","316799068_Modelling_Learners_and_Learning_in_Science_Education","313009477_Capturing_and_modeling_the_process_of_conceptual_change","309073754_Conceptual_change_in_learning_and_instruction_The_framework_theory_approach"]}