{"id":"336706218_Performance_of_an_automatic_translator_in_translating_medical_abstracts","abstract":"The aim of the present paper was to quantitatively assess the performance of a free online translator in translating medical texts from English into Italian. Effectiveness was evaluated and established by analyzing the number and percent of translation errors with respect to the original medical abstracts. Furthermore, the present study analyzed the total number and the percent of translation errors and their correlation with lexical density, which was assessed using Text analyzer. The mean number of total translation errors was 21. The mean percentage of total translation errors was 15%. The mean lexical density was 66.7%. A direct correlation was found between total translation errors and the lexical density. The findings of the present study indicate a fairly good performance of Google translator in translating words in highly academic writings such as medical abstracts. However, an effective translation is not a matter only of finding a correspondence between words in the source language and the target language, many other aspects are just as important. : Medical abstracts; Google translator; Translation errors; Lexical density; Linguistics; Computer science Keywords: Medical abstracts, Google translator, Translation errors, Lexical density, Linguistics, Computer science","authors":["Franca Daniele"],"meta":["October 2019Heliyon 5(10):e02687","DOI:10.1016/j.heliyon.2019.e02687"],"references":["314084936_Translation_of_Poetry_Towards_a_Practical_Model_for_Translation_Analysis_and_Assessment_of_Poetic_Discourse","312432926_Sentence_Length_and_NP_Complexity_of_General_and_Medical_Written_Academic_and_Media_Texts_An_Analysis_Using_a_Trained_Syntactic_Parser","312418885_Machine_Translation_Evaluation_with_Neural_Networks","283491942_Rosewater_wheel_of_fortune_Compounding_and_lexicalisation_in_seventeenth-century_scientific_texts","313580826_Some_Grammatical_Problems_in_Scientific_English","312616245_On_the_language_of_physical_science","297227848_Machine_Translation_History_Development_and_Limitations","286507272_Competence_in_Language_in_Languages_and_in_Translation","283613261_Becoming_a_translator_An_introduction_to_the_theory_and_practice_of_translation_Third_edition","270150604_Translation_and_Translating_Theory_and_Practice"]}