{"id":"336759151_A_novel_graph-based_approach_for_IoT_botnet_detection","abstract":"The Internet of things (IoT) is the extension of Internet connectivity into physical devices and everyday objects. These IoT devices can communicate with others over the Internet and fully integrate into people’s daily life. In recent years, IoT devices still suffer from basic security vulnerabilities making them vulnerable to a variety of threats and malware, especially IoT botnets. Unlike common malware on desktop personal computer and Android, heterogeneous processor architecture issue on IoT devices brings various challenges for researchers. Many studies take advantages of well-known dynamic or static analysis for detecting and classifying botnet on IoT devices. However, almost studies yet cannot address the multi-architecture issue and consume vast computing resources for analyzing. In this paper, we propose a lightweight method for detecting IoT botnet, which based on extracting high-level features from function–call graphs, called PSI-Graph, for each executable file. This feature shows the effectiveness when dealing with the multi-architecture problem while avoiding the complexity of control flow graph analysis that is used by most of the existing methods. The experimental results show that the proposed method achieves an accuracy of 98.7%, with the dataset of 11,200 ELF files consisting of 7199 IoT botnet samples and 4001 benign samples. Additionally, a comparative study with other existing methods demonstrates that our approach delivers better outcome. Lastly, we make the source code of this work available to Github.","authors":["Huy-Trung Nguyen","Quoc-Dung Ngo","Van-Hoang Le"],"meta":["October 2020International Journal of Information Security 19(9)","DOI:10.1007/s10207-019-00475-6"],"references":["331197841_Botnet_Detection_Techniques_and_Research_Challenges","329317291_IoT_Botnet_Detection_Approach_Based_on_PSI_graph_and_DGCNN_classifier","327272757_IoT_Elements_Layered_Architectures_and_Security_Issues_A_Comprehensive_Survey","327017365_Botnet_Detection_in_the_Internet_of_Things_using_Deep_Learning_Approaches","327000242_Efficient_Signature_Generation_for_Classifying_Cross-Architecture_IoT_Malware","323863656_A_method_to_detect_Internet_of_Things_botnets","328245298_Malware_classification_using_byte_sequence_information","327409102_Evaluating_Disassembly-Code_Based_Similarity_between_IoT_Malware_Samples","326638029_Understanding_Linux_Malware","326103567_Lightweight_Classification_of_IoT_Malware_Based_on_Image_Recognition","323405239_Robust_Malware_Detection_for_Internet_Of_Battlefield_Things_Devices_Using_Deep_Eigenspace_Learning","323142158_Lightweight_Classification_of_IoT_Malware_based_on_Image_Recognition","322161040_BotRevealer_Behavioral_Detection_of_Botnets_based_on_Botnet_Life-cycle","323723430_A_Deep_Recurrent_Neural_Network_Based_Approach_for_Internet_of_Things_Malware_Threat_Hunting","323373661_IoT_sandbox_to_analysis_IoT_malware_Zollard"]}