{"id":"336741064_Importancia_e_Justificativas_para_o_Ensino_de_Astronomia_um_olhar_para_as_pesquisas_da_area","abstract":"Resumo Muitos pesquisadores em Ensino de Astronomia costumam se referir à astronomia como um objeto de grande curiosidade humana. Neste trabalho, apresentamos um levantamento a respeito da importância e das justificativas que estes pesquisadores atribuem para o Ensino de Astronomia. Num universo de 180 trabalhos sobre Ensino de Astronomia, encontrados em periódicos da área de Ensino de Ciências, Física e Astronomia na última década, foram identificadas, em 29 deles, discussões a respeito da importância ou de justificativas para o Ensino de Astronomia. Como principal resultado deste trabalho, foram organizados todos os elementos relacionados à importância e às justificativas para o Ensino de Astronomia e agrupados em quatro categorias de análise, as quais indicam a natureza das justificativas apresentada pelos autores: Despertar de sentimentos e inquietações; Relevância sócio-histórico-cultural; Ampliação de visão de mundo e conscientização; e Interdisciplinaridade. Dentro de cada categoria, elementos próximos entre si foram agrupados. Produziu-se, assim, uma articulação entre elementos de diferentes trabalhos, relacionando-os de maneira que foi possível se obter novas inferências, não presentes individualmente em nenhum deles. Além disso, ao analisar-se o conjunto das pesquisas foi possível também perceber uma quase total ausência de trabalhos que se propunham a investigar a importância e as justificativas de se ensinar Astronomia. Notou-se ainda que, em geral, quando pesquisadores invocam o caráter interdisciplinar da Astronomia, fazem-no de forma superficial. Uma vez que as pesquisas não mostram de que maneira elas chegam à ideia apresentada para as justificativas para ensinar a astronomia, alguns questionamentos puderam vir à tona, como por exemplo: seria possível existir uma espécie de \"senso comum\" de se ensinar e divulgar Astronomia, que levaria pesquisadores a entender a Astronomia como uma ciência diferenciada? Seria o \"interesse nato\" por Astronomia, apontado por alguns, algo real? A Astronomia realmente se diferenciaria das demais ciências?\nAbstract Many researchers in Astronomy Teaching often refer to Astronomy as an object of great curiosity. In this paper, we will present a survey concerning the importance and justifications researchers have given to Astronomy Teaching. In a universe of 180 papers about Astronomy Teaching, found in periodicals from the areas of Science, Physics and Astronomy Teaching in the last decade, in 29 of them, discussions about the importance or justifications to Astronomy Teaching were found. As the main result of this work, all the elements related to the importance and the justification for the Astronomy Teaching were organized and grouped in four categories of analysis, which indicate the nature of the justifications presented by the authors: Awakening of feelings and curiosities; Socio-historic-cultural relevance; World view and awareness expansion and Interdisciplinarity. In each category, related elements were grouped. By doing so, we could produce an articulation among the elements taken from different papers, matching them in a way that enabled us to obtain new inferences not individually present in any of the papers.","authors":["Daniel Rutkowski Soler","Cristina Leite"],"meta":["July 2012","Conference: II Simpósio Nacional de Educação em AstronomiaAt: São Paulo","Project: Astronomia e Currículo"],"references":["314936601_Metodologias_para_o_ensino_de_astronomia_e_Fisica_atraves_da_construcao_de_telescopios","274937725_Analise_das_caracteristicas_da_aprendizagem_de_astronomia_no_ensino_medio_nos_municipios_de_Rio_Grande_da_Serra_Ribeirao_Pires_e_Maua","266566177_PERCEPCAO_ASTRONOMICA_DE_UM_GRUPO_DE_ALUNOS_DO_ENSINO_MEDIO_DA_REDE_ESTADUAL_DE_SAO_PAULO_DA_CIDADE_DE_SUZANO","338816065_O_UNIVERSO_DAS_SOCIEDADES_NUMA_PERSPECTIVA_RELATIVA_EXERCICIOS_DE_ETNOASTRONOMIA","338814818_INSTRUMENTACAO_PARA_O_ENSINO_DE_ASTRONOMIA_PROJETANDO_A_IMAGEM_DO_SOL","338811968_INSERCAO_DA_ASTRONOMIA_COMO_DISCIPLINA_CURRICULAR_DO_ENSINO_MEDIO","338811564_DISCUSSOES_SOBRE_A_NATUREZA_DA_CIENCIA_EM_UM_CURSO_SOBRE_A_HISTORIA_DA_ASTRONOMIA","338808299_INCLUSAO_DE_TEMAS_ASTRONOMICOS_NUMA_ABORDAGEM_INOVADORA_DO_ENSINO_INFORMAL_DE_FISICA_PARA_ESTUDANTES_DO_ENSINO_MEDIO","271159347_Objeto_virtual_de_aprendizagem_no_ensino_de_Astronomia_Algumas_situacoes_problemas_propostas_a_partir_do_software_Stellarium_doi_1050072175-79412010v27n3p433","267302135_COMUNICACOES_CLUBE_DE_ASTRONOMIA_COMO_ESTIMULO_PARA_A_FORMACAO_DE_PROFESSORES_DE_CIENCIAS_E_FISICA_UMA_PROPOSTA"]}