{"id":"336726401_Toward_a_Hardware_Man-in-the-Middle_Attack_on_PCIe_Bus_for_Smart_Data_Replay","abstract":"The growing need for speed of recent embedded systems leads to the adoption of the high-speed communication PCIe protocol (Peripheral Component Interconnect Express) as an internal data bus. This technology is used in some recent smartphones and will be probably adopted by the others in the next few years. The communication between the SoC and its memory through the PCIe bus represents an important source of information for criminal investigations. In this paper, we present a new reliable attack vector on PCIe. We chose to perform a hardware Man-in-the-Middle attack, allowing real-time data analysis, data-replay, and a copy technique inspired by the shadow-copy principle. Through this attack, we will be able to locate, duplicate, and replay sensitive data. The main challenge of this article is to develop an architecture compliant with PCIe protocol constraints such as response time, frequency, and throughput, in order to be invisible to the communication parts. We designed a proof of concept of an emulator based on a computer with PCIe 3.0 bus and a Stratix 5 FPGA with an endpoint PCIe port as a development target.","authors":["Mohamed Amine Khelif","Jordane Lorandel","Olivier Romain","Matthieu Regnery"],"meta":["August 2019","DOI:10.1109/DSD.2019.00042","Conference: 2019 22nd Euromicro Conference on Digital System Design (DSD)"],"references":["279916676_High_Precision_Fault_Injections_on_the_Instruction_Cache_of_ARMv7-M_Architectures","260670895_A_survey_of_ethernet_LAN_security","328395064_Automated_Man-in-the-Middle_Attack_Against_Wi-Fi_Networks","321121827_Can_You_Get_into_the_Middle_of_Near_Field_Communication","320417220_Key_Reinstallation_Attacks_Forcing_Nonce_Reuse_in_WPA2","310823654_ECDSA_Key_Extraction_from_Mobile_Devices_via_Nonintrusive_Physical_Side_Channels","308107470_The_bumpy_road_towards_iPhone_5c_NAND_mirroring","299499771_A_Survey_of_Man_in_the_Middle_Attacks","224097431_Two_Practical_Man-In-The-Middle_Attacks_on_Bluetooth_Secure_Simple_Pairing_and_Countermeasures"]}