{"id":"336746699_State-of-the-art_in_Detecting_Academic_Plagiarism","abstract":"The problem of academic plagiarism has been present for centuries. Yet, the widespread dissemination of information technology, including the internet, made plagiarising much easier. Consequently, methods and systems aiding in the detection of plagiarism have attracted much research within the last two decades. Researchers proposed a variety of solutions, which we will review comprehensively in this article. Available detection systems use sophisticated and highly efficient character-based text comparisons, which can reliably identify verbatim and moderately disguised copies. Automatically detecting more strongly disguised plagiarism, such as paraphrases, translations or idea plagiarism, is the focus of current research. Proposed approaches for this task include intrinsic, cross-lingual and citation-based plagiarism detection. Each method offers unique strengths and weaknesses; however, none is currently mature enough for practical use. In the future, plagiarism detection systems may benefit from combining traditional character-based detection methods with these emerging detection approaches.","authors":["Norman Meuschke","Bela Gipp"],"meta":["June 2013International Journal for Educational Integrity 9(1):50-71","DOI:10.5281/zenodo.3482941","Project: Semantic Similarity and Plagiarism Detection"],"references":["308073726_Authorship_attribution","284264543_Cross-language_plagiarism_detection_language_resources_and_evaluation_LRE","245023135_CitePlag_A_Citation-based_Plagiarism_Detection_System_Prototype","232262495_Identifying_free_text_plagiarism_based_on_semantic_similarity","228729388_Effective_and_Efficient_Plagiarism_Detection","286751589_Information_theory_and_the_retrieval_of_recorded_information","277290534_Scalable_Document_Fingerprinting","244438006_Plagiarism_in_natural_and_programming_languages_An_overview_of_current_tools_and_technologies","233257940_Turnitoff_Identifying_and_fixing_a_hole_in_current_plagiarism_detection_software","229588549_Evidence_of_Complex_Citer_Motivations"]}