{"id":"336703085_New_Method_for_Evaluating_Surface_Roughness_Parameters_Acquired_by_Laser_Scanning","abstract":"Quality evaluation of a material’s surface is performed through roughness analysis of surface samples. Several techniques have been presented to achieve this goal, including geometrical analysis and surface roughness analysis. Geometric analysis allows a visual and subjective evaluation of roughness (a qualitative assessment), whereas computation of the roughness parameters is a quantitative assessment and allows a standardized analysis of the surfaces. In civil engineering, the process is performed with mechanical profilometer equipment (2D) without adequate accuracy and laser profilometer (3D) with no consensus on how to interpret the result quantitatively. This work proposes a new method to evaluate surface roughness, starting from the generation of a visual surface roughness signature, which is calculated through the roughness parameters computed in hierarchically organized regions. The evaluation tools presented in this new method provide a local and more accurate evaluation of the computed coefficients. In the tests performed it was possible to quantitatively analyze roughness differences between ceramic blocks and to find that a quantitative microscale analysis allows to identify the largest variation of roughness parameters Raavg, Rasdv, Ramin and Ramax between samples, which benefit the evaluation and comparison of the sampled surfaces.","authors":["Mauricio Roberto Veronez","Luiz Gonzaga da Silveira Jr"],"meta":["October 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-51545-7","Project: MOSIS: Multi-Outcrop Sharing & Interpretation Tools"],"references":["331738944_Detail_Preserved_Surface_Reconstruction_from_Point_Cloud","321500340_LiDAR_Point_Clouds_to_3D_Urban_Models_A_Review","318726301_PolyFit_Polygonal_Surface_Reconstruction_from_Point_Clouds","311307829_Roughness_parameters","342161722_Remote_Characterisation_of_Surface_Roughness_of_Rock_Discontinuities","335167996_Surface_Reconstruction_from_Unoriented_Point_Clouds_by_a_New_Triangle_Selection_Strategy","312152791_Poisson_surface_reconstruction","304878189_The_effect_of_EBM_process_parameters_upon_surface_roughness","290789726_Use_of_laser_interferometry_for_measuring_concrete_substrate_roughness_in_patch_repairs","288857801_Evaluation_of_the_height_3D_roughness_parameters_of_concrete_substrate_and_the_adhesion_to_epoxy_resin"]}