{"id":"336711359_Factors_to_Consider_for_Tailored_Gamification","abstract":"Gamification is widely used to foster user motivation. Recent studies show that users can be more or less receptive to different game elements, based on their personality or player profile. Consequently, recent work on tailored gamification tries to identify links between user types and motivating game elements. However findings are very heterogeneous due to different contexts, different typologies to characterize users, and different implementations of game elements. Our work seeks to obtain more generalizable findings in order to identify the main factors that will support design choices when tailoring gamification to users' profiles and provide designers with concrete recommendations for designing tailored gamification systems. For this purpose, we ran a crowdsourced study with 300 participants to identify the motivational impact of game elements. Our study differs from previous work in three ways: first, it is independent from a specific user activity and domain; second, it considers three user typologies; and third, it clearly distinguishes motivational strategies and their implementation using multiple different game elements. Our results reveal that (1) different implementations of a same motivational strategy have different impacts on motivation, (2) dominant user type is not sufficient to differentiate users according to their preferences for game elements, (3) Hexad is the most appropriate user typology for tailored gamification and (4) the motivational impact of certain game elements varies with the user activity or the domain of gamified systems.","authors":["Stuart Hallifax","Audrey Serna","Jean-Charles Marty","Guillaume Lavoué"],"meta":["October 2019","DOI:10.1145/3311350.3347167","Conference: the Annual Symposium"],"references":["328547777_Player_Types_and_Player_Behaviors_Analyzing_Correlations_in_an_On-the-field_Gamified_System","324664146_A_Design_Space_For_Meaningful_Structural_Gamification","324610418_Towards_a_Trait_Model_of_Video_Game_Preferences","324430336_Adaptive_Gamification_for_Learning_Environments","322931733_Effect_of_personalized_gameful_design_on_student_engagement","322520118_Personalizing_Persuasive_Strategies_in_Gameful_Systems_to_Gamification_User_Types","322217248_Why_rate_when_you_could_compare_Using_the_EloChoice_package_to_assess_pairwise_comparisons_of_perceived_physical_strength","321745352_A_practical_guide_and_software_for_analysing_pairwise_comparison_experiments","320047117_Improving_The_Efficacy_Of_Games_for_Change_Using_Personalization_Models","324670019_Empirical_Support_for_a_Causal_Relationship_Between_Gamification_and_Learning_Outcomes"]}