{"id":"336752053_A_Multi-Organ_Nucleus_Segmentation_Challenge","abstract":"Generalized nucleus segmentation techniques can contribute greatly to reducing the time to develop and validate visual biomarkers for new digital pathology datasets. We summarize the results of MoNuSeg 2018 Challenge whose objective was to develop generalizable nuclei segmentation techniques in digital pathology. The challenge was an official satellite event of the MICCAI 2018 conference in which 32 teams with more than 80 participants from geographically diverse institutes participated. Contestants were given a training set with 30 images from seven organs with annotations of 21,623 individual nuclei. A test dataset with 14 images taken from seven organs, including two organs that did not appear in the training set was released without annotations. Entries were evaluated based on average aggregated Jaccard index (AJI) on the test set to prioritize accurate instance segmentation as opposed to mere semantic segmentation. More than half the teams that completed the challenge outperformed a previous baseline 1. Among the trends observed that contributed to increased accuracy were the use of color normalization as well as heavy data augmentation. Additionally, fully convolutional networks inspired by variants of U-Net 2, FCN 3, and Mask-RCNN 4 were popularly used, typically based on ResNet 5 or VGG 6 base architectures. Watershed segmentation on predicted semantic segmentation maps was a popular post-processing strategy. Several of the top techniques compared favorably to an individual human annotator and can be used with confidence for nuclear morphometrics.","authors":["Neeraj Kumar","Ruchika Verma","Deepak Anand","Yanning Zhou"],"meta":["October 2019IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2019.2947628","Projects: Medical Image AnalysisGeneralized Segmentation of Nuclei in HistopathologyDeep Learning for Automated Microscopic Image Segmentation, Classification and Detection"],"references":["325479909_1399_HE-stained_sentinel_lymph_node_sections_of_breast_cancer_patients_The_CAMELYON_dataset","319879823_Quantification_of_histochemical_staining_by_color_deconvolution","307516120_Detecting_multiple_sub-types_of_breast_cancer_in_a_single_patient","305676976_Deep_learning_for_digital_pathology_image_analysis_A_comprehensive_tutorial_with_selected_use_cases","301963453_Learning_based_super-resolution_of_histological_images","329754171_Deep_Layer_Aggregation","329748363_Path_Aggregation_Network_for_Instance_Segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","306218037_Learning_multiple_layers_of_features_from_tiny_images","304665112_Local_structure_prediction_for_gland_segmentation"]}