{"id":"336706651_Accurate_and_robust_segmentation_of_neuroanatomy_in_T1-weighted_MRI_by_combining_spatial_priors_with_deep_convolutional_neural_networks","abstract":"Neuroanatomical segmentation in magnetic resonance imaging (MRI) of the brain is a prerequisite for quantitative volume, thickness, and shape measurements, as well as an important intermediate step in many preprocessing pipelines. This work introduces a new highly accurate and versatile method based on 3D convolutional neural networks for the automatic segmentation of neuroanatomy in T1‐weighted MRI. In combination with a deep 3D fully convolutional architecture, efficient linear registration‐derived spatial priors are used to incorporate additional spatial context into the network. An aggressive data augmentation scheme using random elastic deformations is also used to regularize the networks, allowing for excellent performance even in cases where only limited labeled training data are available. Applied to hippocampus segmentation in an elderly population (mean Dice coefficient = 92.1%) and subcortical segmentation in a healthy adult population (mean Dice coefficient = 89.5%), we demonstrate new state‐of‐the‐art accuracies and a high robustness to outliers. Further validation on a multistructure segmentation task in a scan–rescan dataset demonstrates accuracy (mean Dice coefficient = 86.6%) similar to the scan–rescan reliability of expert manual segmentations (mean Dice coefficient = 86.9%), and improved reliability compared to both expert manual segmentations and automated segmentations using FIRST. Furthermore, our method maintains a highly competitive runtime performance (e.g., requiring only 10 s for left/right hippocampal segmentation in 1 × 1 × 1 mm3 MNI stereotaxic space), orders of magnitude faster than conventional multiatlas segmentation methods.","authors":["Phil Novosad","Vladimir S. Fonov","Louis Collins","Alzheimer's Disease Neuroimaging Initiative†"],"meta":["October 2019Human Brain Mapping 41(2)","DOI:10.1002/hbm.24803"],"references":["324354680_HyperDense-Net_A_Hyper-Densely_Connected_CNN_for_Multi-Modal_Image_Segmentation","323843296_A_comparison_of_publicly_available_linear_MRI_stereotaxic_registration_techniques","321805827_Deep_CNN_ensembles_and_suggestive_annotations_for_infant_brain_MRI_segmentation","320432670_HyperDense-Net_A_hyper-densely_connected_CNN_for_multi-modal_image_semantic_segmentation","319462000_Transfer_Learning_for_Domain_Adaptation_in_MRI_Application_in_Brain_Lesion_Segmentation","326192078_An_efficient_and_accurate_method_for_robust_inter-dataset_brain_extraction_and_comparisons_with_9_other_methods","325786030_Automated_sub-cortical_brain_structure_segmentation_combining_spatial_and_deep_convolutional_features","320684046_Domain-Adversarial_Training_of_Neural_Networks","319770174_Practical_recommendations_for_gradient-based_training_of_deep_architectures","319649103_Domain-Adversarial_Training_of_Neural_Networks"]}