{"id":"336884617_Entre_Adas_e_Marias_as_mulheres_e_a_tecnologia_da_informacao_um_olhar_para_os_cursos_de_graduacao_em_Ponta_Grossa_2003-2017","abstract":"Observa-se que atualmente, no Ocidente, na área de Tecnologia da Informação, há pouca presença feminina. Isso ocorre pelo contexto histórico-social, pois ao longo da história Ocidental as mulheres foram percebidas como portadoras de capacidades para realizarem tarefas de cuidado e interpessoais, e o conhecimento científico foi percebido como pertencente aos homens. Voltando o olhar para o passado dessa área de Tecnologia da Informação, observa-se que a matemática Ada Lovelace, que viveu entre os anos 1815 a 1852, é uma precursora do que hoje chamamos de linguagem da computação. Sendo assim, olhando para o passado, na busca de compreender o presente, e este texto objetiva apresentar algumas informações sobre a presença das mulheres no campo tecnológico ao longo do século XX, a partir de uma análise bibliográfica, bem como, analisar um estudo de caso, observando o número de homens e mulheres ingressantes e concluintes dos cursos de graduação das universidades públicas de Ponta Grossa, nos cursos de Engenharia da Computação, Engenharia de Software, Ciência da Computação, no início do século XXI. Para a realização desse estudo utiliza-se como base teórica e de análise a categoria gênero. Para a análise dos dados coletados, foi utilizada uma observação quantitativa – construindo gráficos, quadros e tabelas –, e uma reflexão qualitativa, na qual os dados quantitativos serão problematizados, com a utilização da categoria gênero. Os resultados dessas análises permitem observar a relações entre os dados locais e nacionais, bem como, os internacionais. O conhecimento dessa realidade permitirá que no futuro se desenvolvam estratégias para incentivar as mulheres a seguirem nessa carreira, pois em uma sociedade a cada dia mais tecnológica a área de Tecnologia da Informação é um espaço de poder. E como outros espaços sociais, esse tende a reproduzir as relações de gênero que excluem as mulheres.","authors":["Andrea Mazurok Schactae","Leticia Hass Magnhotto"],"meta":["October 2019Revista Tecnologia e Sociedade 15(38)","DOI:10.3895/rts.v15n38.8519"],"references":["329518222_A_Historia_das_mulheres_Cultura_e_poder_das_mulheres_ensaio_de_historiografia","269583975_As_Mulheres_nas_Escolas_de_Engenharia_Brasileiras_Historia_Educacao_e_Futuro","264878708_Genero_Uma_categoria_util_de_analise_historica","251048279_AS_ESCOLHAS_DE_CURSOS_PELAS_MULHERES_Qual_Formacao_para_Quais_Papeis_Sociais_O_Caso_das_Estudantes_do_Centro_Federal_de_Educacao_Tecnologica_do_Parana_-_Unidade_de_Ponta_Grossa"]}