{"id":"336823583_Orometry-based_Terrain_Analysis_and_Synthesis","abstract":"Mountainous digital terrains are an important element of many virtual environments and find application in games, film, simulation and training. Unfortunately, while existing synthesis methods produce locally plausible results they often fail to respect global structure. This is exacerbated by a dearth of automated metrics for assessing terrain properties at a macro level.\nWe address these issues by building on techniques from orometry, a field that involves the measurement of mountains and other relief features. First, we construct a sparse metric computed on the peaks and saddles of a mountain range and show that, when used for classification, this is capable of robustly distinguishing between different mountain ranges. Second, we present a synthesis method that takes a coarse elevation map as input and builds a graph of peaks and saddles respecting a given orometric distribution. This is then expanded into a fully continuous elevation function by deriving a consistent river network and shaping the valley slopes. In terms of authoring, users provide various control maps and are also able to edit, reposition, insert and remove terrain features all while retaining the characteristics of a selected mountain range.\nThe result is a terrain analysis and synthesis method that considers and incorporates orometric properties, and is, on the basis of our perceptual study, more visually plausible than existing terrain generation methods.","authors":["Oscar Argudo","Eric Galin","Adrien Peytavie","Axel Paris"],"meta":["November 2019ACM Transactions on Graphics 38(6)","DOI:10.1145/3355089.3356535","Project: Procedural generation of geomorphologically consistent river networks"],"references":["320345887_Interactive_Example-Based_Terrain_Authoring_with_Conditional_Generative_Adversarial_Networks","316864227_Coherent_multi-layer_landscape_synthesis","291375064_Sparse_representation_of_terrains_for_procedural_modeling","290458819_Cloud-Capped_Towers_Capturing_Terrain_Characteristics_Using_Topographic_Functionals","332873873_A_Review_of_Digital_Terrain_Modeling","326726595_Non-stationary_texture_synthesis_by_adversarial_expansion","320761239_Calculating_the_prominence_and_isolation_of_every_mountain_in_the_world","318779943_Displacement_Interpolation_Using_Lagrangian_Mass_Transport","316864226_Authoring_Landscapes_by_Combining_Ecosystem_and_Terrain_Erosion_Simulation","292192025_Large_Scale_Terrain_Generation_from_Tectonic_Uplift_and_Fluvial_Erosion"]}