{"id":"336870688_Enabling_technologies_and_tools_for_digital_twin","abstract":"Digital twin is revolutionizing industry. Fired by sensor updates and history data, the sophisticated models can mirror almost every facet of a product, process or service. In the future, everything in the physical world would be replicated in the digital space through digital twin technology. As a cutting-edge technology, digital twin has received a lot of attention. However, digital twin is far from realizing their potential, which is a complex system and long-drawn process. Researchers must model all the different parts of the objects or systems. Varied types of data needed to be collected and merged. Many researchers and participators in engineering are not clear which technologies and tools should be used. 5-dimension digital twin model provides reference guidance for understanding and implementing digital twin. From the perspective of 5-dimension digital twin model, this paper tries to investigate and summarize the frequently-used enabling technologies and tools for digital twin to provide technologies and tools references for the applications of digital twin in the future.","authors":["Qinglin Qi","Fei Tao","Tianliang Hu","Nabil Anwer"],"meta":["March 2021Journal of Manufacturing Systems 58(B):3-21","DOI:10.1016/j.jmsy.2019.10.001"],"references":["336039354_Make_more_digital_twins","333382517_Digital_Twins_and_Cyber-Physical_Systems_toward_Smart_Manufacturing_and_Industry_40_Correlation_and_Comparison","329483027_Design_of_Data_Acquisition_System_Based_on_Zigbee_for_Wireless_Sensor_Networks","326617363_Modular_based_flexible_digital_twin_for_factory_design","326039530_Digital_Twin_of_a_Cutting_Tool","326029013_Digital_Twin_Service_towards_Smart_Manufacturing","345078627_Digital_Twin_in_Industry_State-of-the-Art","337658829_Cloud_manufacturing_paradigm_with_ubiquitous_robotic_system_for_product_customization","332710511_Five-dimension_digital_twin_model_and_its_ten_applications","327491752_Digital_Twin_in_manufacturing_A_categorical_literature_review_and_classification"]}