{"id":"336823857_Modified_CiteScore_metric_for_reducing_the_effect_of_self-citations","abstract":"Elsevier B.V. launched a scholarly metric called CiteScore (CS) on December 8, 2016. Up till then, the journal impact factor (JIF) owned by Clarivate Analytics (Thomson Reuters) was the only trusted metric for journal evaluation. As noted by Teixeira da Silva & Memon (2017), CS offers some observed advantages over JIF. The potentials of CiteScore as a viable metric are still emerging. The paper briefly introduces a variant of the CiteScore that can be used in quantifying the impact of researchers and their institutions. The ultimate aim is to reduce the numerical effect of self-citations (SC) in academic publishing. The reduction is designed to discourage SC but not diminishing it. The reasons for the adopted methodology are discussed extensively. The proposed modified CiteScore metric is simple, transparent and constructed to ensure integrity in academic publication. The result showed that the proposed modified CiteScore is a better option than the traditional CiteScore and hence, can be applied in impact determination, the ranking of authors and their institutions, and evaluation of scientists for a grant award. The approach used in this paper is entirely new in two ways; first, a metric similar to journal ranking is proposed for ranking authors and their institutions and secondly, disproportionate scores are awarded to different sources of citations to reduce perceived dishonesty in academic publications. In conclusion, this research is one of very few to report the effect of SC on CiteScore. Hitherto, the effect of SC has always been on the journal impact factor (IF).","authors":["Hilary Okagbue","Bishop Sheila Amina","Pelumi Oguntunde","Patience Adamu"],"meta":["December 2019TELKOMNIKA Indonesian Journal of Electrical Engineering 17(6):3044-3049","DOI:10.12928/TELKOMNIKA.v17i6.12292"],"references":["327445998_Analysis_of_dataset_on_editorial_board_composition_of_Dove_Medical_Press_by_continent","326317611_Worthless_papers_-_Are_journal_impact_factor_and_number_of_citations_suitable_indicators_to_evaluate_quality_of_scientists","325255057_Exploration_of_editorial_board_composition_Citescore_and_percentiles_of_Hindawi_journals_indexed_in_Scopus","325254661_Dataset_and_analysis_of_editorial_board_composition_of_165_Hindawi_journals_indexed_and_abstracted_in_PubMed_based_on_affiliations","325055755_Citation_analytics_Data_exploration_and_comparative_analyses_of_CiteScores_of_Open_Access_and_Subscription-Based_publications_indexed_in_Scopus_2014_-_2016","324003975_Changing_patterns_of_self-citation_Cumulative_inquiry_or_self-promotion","323266533_Overview_of_journal_metrics","320913018_Increasing_the_Impact_Factor_in_the_Ethical_Way","322777865_Which_domains_do_open-access_journals_do_best_in_A_5-year_longitudinal_study","321196014_Contributing_factors_to_long-term_citation_count_in_marine_and_freshwater_biology_articles_Citation_counts_in_aquatic_science_articles"]}