{"id":"336826264_Jogo_da_Traducao_uma_ferramenta_pedagogica_no_ensino_de_genetica_Translation_Game_an_educational_tool_in_the_genetics_of_education_1","abstract":"RESUMO As dificuldades no processo de ensino e aprendizagem dos conteúdos de genética é bastante discutida nos meios escolar e acadêmico, principalmente o que tange aos aspectos relacionados às dificuldades de apli-cabilidade e abstração dos conceitos que são abordados nesta disciplina. A proposta de uso da informática como ferramenta didática é cada vez mais comum em diversas áreas do saber. Buscando facilitar a com-preensão de alguns conteúdos da disciplina de Genética, foi criado um jogo tecnológico onde os alunos pudessem interagir com os constituintes celulares envolvidos nos processos de transcrição de tradução. Dessa forma, o objetivo deste trabalho é apresentar a construção e a forma de uso de um jogo digital de genética intitulado: \"Jogo da Tradução\". Através da união de noções básicas em informática com conteúdos teóricos, concretizou-se a criação do \"Jogo da Tradução\". Um jogo digital, construído com recursos básicos do PowerPoint, o qual permite o aluno à aplicação do conhecimento teórico para ele mesmo construir sua proteína. Este jogo permite o professor trabalhar de forma lúdica e interativa o conteúdo de genética molecular , um assunto normalmente tratado de forma exclusivamente teórica. Palavras-chave: Ensino e aprendizagem de genética. Jogo lúdico. Tecnologias no ensino. ABSTRACT The difficulties in teaching and learning process of genetic content is much discussed in school and academic resources, especially with respect to matters relating to the applicability of difficulty and abstraction of the concepts that are discussed in this discipline. The computer usage proposal as a teaching tool is becoming increasingly common in many areas of knowledge. Seeking to facilitate the understanding of some of Genetics discipline of content, a technological game where students could interact with cellular components involved in the translation processes of transcription was created. Thus, the aim of this paper is to present the construction and form of use of a digital genetic game entitled \"Translation Game.\" By combining basics in computer science with theoretical content, materialize the creation of \"Translation Game.\" A digital game, built with basic features of PowerPoint, which allows the student to apply the theoretical knowledge to himself build your protein. This game allows the teacher to work in a fun and interactive way the content of molecular genetics, a subject usually treated only theoretically.","authors":["Carlos Alberto Sanches Pereira","Ana Paula Cunha Pereira","Gabriela Girão De Albuquerque","Júlio Cezar Azevedo da Silva Junior"],"meta":["October 2019"],"references":["322070390_Technology_as_a_tool_in_teaching_quantitative_biology_at_the_secondary_and_undergraduate_levels_a_review"]}