{"id":"336806880_A_multidisciplinary_engineering_capstone_design_course_A_case_study_for_design-based_approach","abstract":"The presented work describes the development of an engineering capstone course with multidisciplinary design projects and students’ teams. The course is offered for senior-level engineering students of four majors: those are bio-, environmental, materials, and mechanical engineering. In addition, engineering students can have minors in computer science. Most of the offered projects are sponsored by industrial partners and all are mentored by clients’ representatives and faculty members. The presented paper discusses the implementation of design-based learning approach to integrate the technical engineering design knowledge and the learning skills of interpersonal nature, such as communication skills, adaptability, teamwork, etc. In addition to the discussion of the design-based learning frame application, the paper deliberates over the importance of aligning the learning outcomes and the grading policy with the engineering design phases in engineering capstone design courses. The research objective of this study was to answer the following question: is there a difference in the peer evaluation of capstone design teams between multidisciplinary and single-disciplinary teams in terms of (1) contribution and skills and 2) team satisfaction. The presented work offers preliminary results of team’s satisfaction and performance based on the multi- and single-disciplinary teams. Preliminary findings for those two specific aspects indicate no significant differences in the overall design teams’ satisfaction. However, in terms of the team’s contribution and skills, the multidisciplinary teams scored higher mean values than the single-disciplinary teams.","authors":["Ala Qattawi","Ala'aldin Alafaghani","Muhammad Ali Ablat","Md Shah Jaman"],"meta":["October 2019International Journal of Mechanical Engineering Education 49(3):030641901988262","DOI:10.1177/0306419019882622"],"references":["326514397_Statistical_semi-supervised_system_for_grading_multiple_peer-reviewed_open-ended_works","325993841_Utilisation_of_the_conceive-design-implement-operate_framework_in_a_mechanical_engineering_capstone_project","310495642_Situative_Educational_Model_for_the_Design_of_Powerful_Student-Centered_Learning_Environments","309884420_A_Pedagogical_Module_Framework_to_Improve_Scaffolded_Active_Learning_in_Manufacturing_Engineering_Education","344527108_Vision_2030_Creating_the_Future_of_Mechanical_Engineering_Education","336102328_Diversity_of_PBL_-_PBL_Learning_Principles_and_Models","321997225_Project-based_learning_Building_communities_of_reflective_practitioners","308572005_Performance_implications_of_peer_monitoring","303207856_Learning_Through_Group_Work_in_the_College_Classroom_Evaluating_the_Evidence_from_an_Instructional_Goal_Perspective","296882363_Patterns_of_interdependence_in_work_teams_A_two-level_investigation_of_the_relations_with_job_and_team_satisfaction"]}