{"id":"336885560_A_New_Approach_for_Transformation-Based_Fuzzy_Rule_Interpolation","abstract":"Fuzzy rule interpolation (FRI) is of particular significance for reasoning in the presence of insufficient knowledge or sparse rule bases. As one of the most popular FRI methods, transformation-based fuzzy rule interpolation (TFRI) works by constructing an intermediate fuzzy rule, followed by running scale and move transformations. The process of intermediate rule construction selects a user-defined number of rules closest to an observation that does not match any existing rule, using a distance metric. It relies upon heuristically computed weights to assess the contribution of individual selected rules. This process requires a move operation in an effort to force the intermediate rule to overlap with an unmatched observation, regardless of what rules are selected and how much contribution they may each make. It is therefore, desirable to avoid this problem and also, to improve the automation of rule interpolation without resorting to the user's intervention for fixing the number of the closest rules. This paper proposes such a novel approach to selecting a subset of rules from the sparse rule base with an embeded rule weighting scheme for the automatic assembling of the intermediate rule. Systematic comparative experimental results are provided on a range of benchmark data sets, to demonstrate statistically significant improvement in the performance achieved by the proposed approach over that obtainable using conventional TFRI.","authors":["Tianhua Chen","Changjing Shang","Jing Yang","Fangyi Li"],"meta":["October 2019IEEE Transactions on Fuzzy Systems PP(99):1-1","DOI:10.1109/TFUZZ.2019.2949767"],"references":["317783337_Evolutionary_Fuzzy_Rule-Based_Methods_for_Monotonic_Classification","323822562_Fuzzy_Rule-Based_Interpolative_Reasoning_Supported_by_Attribute_Ranking","322270147_Adaptive_fuzzy_interpolation_based_on_ranking_values_of_interval_type-2_polygonal_fuzzy_sets","321505543_Dynamic_Fuzzy_Rule_Interpolation_and_Its_Application_to_Intrusion_Detection","319284009_Interpolation_in_homogenous_fuzzy_signature_rule_bases","309083019_Exploiting_Data_Reliability_and_Fuzzy_Clustering_for_Journal_Ranking","305037445_Generalised_Adaptive_Fuzzy_Rule_Interpolation","303872596_Multi-Objective_Evolutionary_Optimization_of_Type-2_Fuzzy_Rule-based_Systems_for_Financial_Data_Classification","298729279_Bivariate_fully_fuzzy_interpolation_problem_using_artificial_neural_networks_approach","297618421_Representing_membership_functions_as_points_in_high-dimensional_spaces_for_fuzzy_interpolation_and_extrapolation"]}