{"id":"336852935_Model-based_clustering_for_populations_of_networks","abstract":"Until recently obtaining data on populations of networks was typically rare. However, with the advancement of automatic monitoring devices and the growing social and scientific interest in networks, such data has become more widely available. From sociological experiments involving cognitive social structures to fMRI scans revealing large-scale brain networks of groups of patients, there is a growing awareness that we urgently need tools to analyse populations of networks and particularly to model the variation between networks due to covariates. We propose a model-based clustering method based on mixtures of generalized linear (mixed) models that can be employed to describe the joint distribution of a populations of networks in a parsimonious manner and to identify subpopulations of networks that share certain topological properties of interest (degree distribution, community structure, effect of covariates on the presence of an edge, etc.). Maximum likelihood estimation for the proposed model can be efficiently carried out with an implementation of the EM algorithm. We assess the performance of this method on simulated data and conclude with an example application on advice networks in a small business.","authors":["Mirko Signorelli","E. Wit"],"meta":["February 2020Statistical Modelling 20(1):9-29","DOI:10.1177/1471082X19871128","Project: Inferring Community-driven Structure in Complex Networks"],"references":["315716028_Variable_selection_for_realistic_stochastic_blockmodels","306108620_Comparison_method_for_community_detection_on_brain_networks_from_neuroimaging_data","305709626_A_penalized_inference_approach_to_stochastic_block_modelling_of_community_structure_in_the_Italian_Parliament","279968852_Clustering_Network_Layers_With_the_Strata_Multilayer_Stochastic_Block_Model","273166251_Latent_Space_Models_for_Dynamic_Networks","307091979_Nonparametric_Bayes_Modeling_of_Populations_of_Networks","279310245_Statistical_clustering_of_temporal_networks_through_a_dynamic_stochastic_block_model","278048696_Community_detection_in_multi-relational_data_with_restricted_multi-layer_stochastic_blockmodel","277664929_Generalized_Linear_Models_Monographs_on_Statistics_and_Applied_Probability_No_37","273134678_A_computationally_fast_alternative_to_cross-validation_in_penalized_Gaussian_graphical_models"]}