{"id":"336846972_Systematic_review_of_research_on_artificial_intelligence_applications_in_higher_education_-where_are_the_educators","abstract":"According to various international reports, Artificial Intelligence in Education (AIEd) is one of the currently emerging fields in educational technology. Whilst it has been around for about 30 years, it is still unclear for educators how to make pedagogical advantage of it on a broader scale, and how it can actually impact meaningfully on teaching and learning in higher education. This paper seeks to provide an overview of research on AI applications in higher education through a systematic review. Out of 2656 initially identified publications for the period between 2007 and 2018, 146 articles were included for final synthesis, according to explicit inclusion and exclusion criteria. The descriptive results show that most of the disciplines involved in AIEd papers come from Computer Science and STEM, and that quantitative methods were the most frequently used in empirical studies. The synthesis of results presents four areas of AIEd applications in academic support services, and institutional and administrative services: 1. profiling and prediction, 2. assessment and evaluation, 3. adaptive systems and personalisation, and 4. intelligent tutoring systems. The conclusions reflect on the almost lack of critical reflection of challenges and risks of AIEd, the weak connection to theoretical pedagogical perspectives, and the need for further exploration of ethical and educational approaches in the application of AIEd in higher education.","authors":["Olaf Zawacki-Richter","Victoria I. Marín","Melissa Bond","Franziska Gouverneur"],"meta":["October 2019","DOI:10.1186/s41239-019-0171-0"],"references":["355944584_Developing_a_Hybrid_Model_to_Predict_Student_First_Year_Retention_in_STEM_Disciplines_Using_Machine_Learning_Techniques","338585043_Mining_Students_Comments_about_Teacher_Performance_Assessment_using_Machine_Learning_Algorithms","331772656_Where_is_the_theory_within_the_field_of_educational_technology_research","331617936_Artificial_Intelligence_in_Higher_Education_A_Bibliometric_Study_on_its_Impact_in_the_Scientific_Literature","328761767_Siri_Siri_in_my_hand_Who's_the_fairest_in_the_land_On_the_interpretations_illustrations_and_implications_of_artificial_intelligence","328047557_Student_Engagement_Predictions_in_an_e-Learning_System_and_Their_Impact_on_Student_Course_Assessment_Scores","325382978_Effects_of_Using_Artificial_Intelligence_Teaching_System_for_Environmental_Education_on_Environmental_Knowledge_and_Attitude","344486411_Observing_Interaction_An_Introduction_to_Sequential_Analysis","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","326047251_Automatic_argument_assessment_of_final_project_reports_of_computer_engineering_students"]}