{"id":"336851044_Brillouin_Microscopy_Visualizes_Centralized_Corneal_Edema_in_Fuchs_Endothelial_Dystrophy","abstract":"Purpose: \nTo investigate the feasibility of using Brillouin microscopy for assessment of corneal edema in patients with Fuchs endothelial corneal dystrophy (FECD). Brillouin microscopy analyzes the frequency shift of light inelastically scattered by naturally occurring acoustic waves in a small volume of tissue. The resulting frequency shift is a measure of the local hydromechanical properties of the tissue.\n\nMethods: \nParticipants were scanned using a clinical Brillouin imaging system (780 nm laser, 5 mW), and a color-coded map of the mean Brillouin shift laterally across the corneal stroma was created.\n\nResults: \nBrillouin maps of normal subjects (n = 8) were relatively homogeneous, whereas maps of patients with FECD (n = 7) exhibited significantly reduced Brillouin shifts (unpaired t test, P < 0.001) centrally. The mean difference of 83 MHz corresponds to approximately 3.9% higher water content (percentage difference in volume fraction) in central corneas of the FECD group relative to normal subjects. The Brillouin scan of a patient with FECD 1 month after Descemet membrane endothelial keratoplasty measured a 62 MHz increase in Brillouin shift relative to the preoperative level, indicating normalization of corneal hydration.\n\nConclusions: \nAll patients with FECD scanned exhibited a centralized reduction in Brillouin shift, distinct from the normal subjects measured and consistent with centralized edema characterized by pachymetry. Brillouin scans revealed substantially reduced water content after Descemet membrane endothelial keratoplasty. These results suggest that Brillouin microscopy could aid treatment planning and assessment of FECD. Moreover, corneal hydration mapping may be useful in understanding fluid pump function dynamics of the cornea and developing early interventions for FECD.","authors":["Amira M. Eltony","Fatima Clouser","Peng Shao","Roberto Pineda"],"meta":["October 2019Cornea 39(2):1","DOI:10.1097/ICO.0000000000002191"],"references":["333135886_Spatially-resolved_Brillouin_spectroscopy_reveals_biomechanical_abnormalities_in_mild_to_advanced_keratoconus_in_vivo","325753169_Effects_of_Corneal_Hydration_on_Brillouin_Microscopy_In_Vivo","325210495_Brillouin_microscopy_assessing_ocular_tissue_biomechanics","276043612_Hydration_fluid_regulation_and_the_eye_In_health_and_disease","19876544_Fuchs'_dystrophy","326721018_Water_content_not_stiffness_dominates_Brillouin_spectroscopy_measurements_in_hydrated_materials","281484703_Fuchs_Corneal_Dystrophy","235390348_Fuchs'_Endothelial_Corneal_Dystrophy","15144710_Excimer_Laser_Ablation_Rate_and_Corneal_Hydration","15045998_Effect_of_Corneal_Edema_Upon_the_Smoothness_of_Excimer_Laser_Ablation","12582452_Human_Corneal_Thickness_and_Its_Impact_on_Intraocular_Pressure_Measures_-_A_Review_and_Meta-analysis_Approach"]}