{"id":"336814588_Commensal_Correlation_Network_Between_Segmentation_and_Direct_Area_Estimation_for_Bi-ventricle_Quantification","abstract":"Accurate and automated cardiac bi-ventricle quantification based on cardiac magnetic resonance (CMR) image is a very crucial procedure for clinical cardiac disease diagnosis. Two traditional and commensal tasks, i.e., bi-ventricle segmentation and direct ventricle function index estimation, are always independently devoting to address ventricle quantification problem. However, because of inherent difficulties from the variable CMR imaging conditions, these two tasks are still open challenging. In this paper, we proposed a unified bi-ventricle quantification framework based on commensal correlation between the bi-ventricle segmentation and direct area estimation. Firstly, we proposed the area commensal correlation between the two traditional cardiac quantification tasks for the first time, and designed a novel deep commensal network (DCN) to join these two commensal tasks into a unified framework based on the proposed commensal correlation loss. Secondly, we proposed an differentiable area operator to model the proposed area commensal correlation and made the proposed model continuously differentiable. Thirdly, we proposed a high-efficiency and novel uncertainty estimation method through one-time inference based on cross-task output variability. And finally DCN achieved end-to-end optimization and fast convergence as well as uncertainty estimation with one-time inference. Experiments on the four open accessible short-axis CMR benchmark datasets (i.e., Sunnybrook, STACOM 2011, RVSC, and ACDC) showed that the proposed method achieves best bi-ventricle quantification accuracy and optimization performance. Hence, the proposed method has big potential to be extended to other medical image analysis tasks and has clinical application value.","authors":["Gongning Luo","Suyu Dong","Wei Wang","Kuanquan Wang"],"meta":["October 2019Medical Image Analysis 59(2):101591","DOI:10.1016/j.media.2019.101591"],"references":["327657107_Automated_cardiovascular_magnetic_resonance_image_analysis_with_fully_convolutional_networks","327627264_On_the_Effect_of_Inter-observer_Variability_for_a_Reliable_Estimation_of_Uncertainty_of_Medical_Image_Segmentation","324094036_3D_Consistent_Robust_Segmentation_of_Cardiac_Images_by_Deep_Learning_with_Spatial_Propagation","323754926_Automatic_Cardiac_Disease_Assessment_on_cine-MRI_via_Time-Series_Segmentation_and_Domain_Specific_Features","329747151_Transparency_by_Design_Closing_the_Gap_Between_Performance_and_Interpretability_in_Visual_Reasoning","327629449_Bayesian_VoxDRN_A_Probabilistic_Deep_Voxelwise_Dilated_Residual_Network_for_Whole_Heart_Segmentation_from_3D_MR_Images_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_Part","327627263_Exploring_Uncertainty_Measures_in_Deep_Networks_for_Multiple_Sclerosis_Lesion_Detection_and_Segmentation","327231924_Automatic_segmentation_variability_estimation_with_segmentation_priors","325212356_Deep_Learning_Techniques_for_Automatic_MRI_Cardiac_Multi-Structures_Segmentation_and_Diagnosis_Is_the_Problem_Solved","324055800_Learning-Based_Quality_Control_for_Cardiac_MR_Images"]}