{"id":"336821572_An_improved_branch-cut-and-price_algorithm_for_the_two-echelon_capacitated_vehicle_routing_problem","abstract":"In the paper, we propose a branch-cut-and-price algorithm for the two-echelon capacitated vehicle routing problem in which delivery of products from a depot to customers is performed using intermediate depots called satellites. Our algorithm incorporates significant improvements recently proposed in the literature for the standard capacitated vehicle routing problem such as bucket graph based labeling algorithm for the pricing problem, automatic stabilization, limited memory rank-1 cuts, and strong branching. In addition, we make some specific problem contributions. First, we introduce a new route based formulation for the problem which does not use variables to determine product flows in satellites. Second, we introduce a new branching strategy which significantly decreases the size of the branch-and-bound tree. Third, we introduce a new family of satellite supply inequalities, and we empirically show that it improves the quality of the dual bound at the root node of the branch-and-bound tree. Finally, extensive numerical experiments reveal that our algorithm can solve to optimality all literature instances with up to 200 customers and 10 satellites for the first time and thus double the size of instances which could be solved to optimality.","authors":["Guillaume Marques","Ruslan Sadykov","Jean-Christophe Deschamps","Remy Dupas"],"meta":["October 2019Computers & Operations Research 114(2):104833","DOI:10.1016/j.cor.2019.104833"],"references":["344515888_A_Bucket_Graph_Based_Labeling_Algorithm_with_Application_to_Vehicle_Routing","332812199_A_Generic_Exact_Solver_for_Vehicle_Routing_and_Related_Problems","286907487_Primal_Heuristics_for_Branch_and_Price_The_Assets_of_Diving_Methods","328467396_Branch-and-Price-Based_Algorithms_for_the_Two-Echelon_Vehicle_Routing_Problem_with_Time_Windows","326869793_A_matheuristic_for_the_MinMax_capacitated_open_vehicle_routing_problem","321658019_Large_Composite_Neighborhoods_for_the_Capacitated_Location-Routing_Problem","320364490_Matheuristic_for_a_two-echelon_capacitated_vehicle_routing_problem_with_environmental_considerations_in_city_logistics_service","314030231_Limited_memory_Rank-1_Cuts_for_Vehicle_Routing_Problems","313580571_Exact_solution_of_the_capacitated_vehicle_routing_problem","303739411_Improved_branch-cut-and-price_for_capacitated_vehicle_routing"]}