{"id":"336825703_Fuzzy_Cross_Domain_Concept_Mining","abstract":"E-Learning has emerged as an important research\narea. Concept maps creation for emerging new domains such as\ne-Learning is even more challenging due to its ongoing\ndevelopment nature. For creating Concept map, concepts are\nextracted. Concepts are domain dependent but big data can have\ndata from different domains. Data in different domain has\ndifferent semantics. So before applying any analytics to such big\nunstructured data, we have to categorize the important concepts\ndomain wise semantically before applying any machine learning\nalgorithm. In this paper, we have used a novel approach to\nautomatically cluster the E-Learning concept semantically; we\nhave shown the cluster in table format. Initially, we have\nextracted important concepts from unstructured data followed\nby generation of vector space of each concept. Then we used\ndifferent similarity formula to calculate fuzzy membership values\nof elements of vector to its corresponding concepts. Semantic\nSimilarity is calculated between two concepts by considering\nrepeatedly the semantic similarity or information gain between\ntwo elements of each vector. Then Semantic similarity between\ntwo concepts is calculated. Thus concept map can be generated\nfor a particular domain. We have taken research articles as our\ndataset from different domains like computer science and\nmedical domain containing articles on Cancer. A graph is\ngenerated to show that fuzzy relationship between them for all\ndomain. Then clustering them in based on their distances","authors":["Rafeeq Ahmed"],"meta":["October 2019","DOI:10.35940/ijitee.J1059.08810S19"],"references":["323525000_Knowledge_Representation_by_Concept_Mining_Fuzzy_Relation_from_Unstructured_Data","315472883_Framework_to_extract_context_vectors_from_unstructured_data_using_big_data_analytics","299864598_Concept_Hierarchy_Extraction_from_Textbooks","273851010_Assessment_of_Concept_Maps_Generated_by_Undergraduate_Students_about_the_Function_Concept","268003368_Automatic_creation_of_a_concept_map","243772975_String_Comparator_Metrics_and_Enhanced_Decision_Rules_in_the_Fellegi-Sunter_Model_of_Record_Linkage","319394499_Fuzzy_Sets","303513007_Mining_and_Visualizing_Associations_of_Concepts_on_a_Large-Scale_Unstructured_Data","284400357_Measures_of_the_Amount_of_Ecologic_Association_Between_Species","242637644_An_Algorithm_for_Suffix_Stripping","230876271_Semantic_and_associative_priming_in_high-dimensional_semantic_space","228615350_Second_order_co-occurrence_PMI_for_determining_the_semantic_similarity_of_words","227090938_Producing_high-dimensional_semantic_space_from_lexical_co-occurence","228616759_Term_representation_with_Generalized_Latent_Semantic_Analysis","227691013_Probabilistic_Linkage_of_Large_Public_Health_Data_Files"]}