{"id":"336970785_A_Remote_Controllable_Supporting_Device_for_Deaf-blind_Person_using_Handwritten_Character","abstract":"\"Handwritten characters\" are a means of communication with deaf--blind person. \"Handwritten characters\" are written by caregivers with fingers on the palm of a deaf--blind person. \"Handwritten characters\" have the feature of being easy to learn because a person can recognize hiragana and katakana intuitively. Many deaf--blind person can communicate using this method. However, because the caregiver must stay by the person's side, it imposes a heavy burden. For this study, we developed a support device that is able to recreate handwritten characters remotely without the assistance of a caregiver. The system consists of a mobile terminal on the input side, a server, and an output device. On the input side, characters are input using a mobile terminal on which a dedicated application is mounted. Applications are supported by Windows OS (Microsoft Corp.) and Android OS (Alphabet Inc.). Users have two modes of inputting characters: keyboard input and writing characters directly one by one. For keyboard input, a user can send more than one character at a time. The server uses Raspberry Pi. When the server receives character data via the network, it transmits character coordinates to the output device based on the data. In addition, a character file that records the coordinates of the character is stored in advance. When writing characters directly, the received data are converted to a format that can be read out by the output device. Then the data are transmitted to the output device. For keyboard input, the sent character strings are decomposed one character at a time. For the decomposed characters, the coordinate data are read out from the character file corresponding to each character and are transmitted to the output device. The output device performs a process of reproducing the handwritten character to the deaf--blind person. We used software (Makeblock mDrawBot; Makeblock Co., Ltd.) embedded in the device, which performs character output using coordinate data. This output device, which operates based on the coordinate data transmitted from the server, is connected to the server via a wire. Makeblock mDrawbot is plotter software that draws based on X and Y coordinates. We are studying the mechanism of adding Z coordinates so that it can be drawn according to the hand position. Development of this device demonstrated that the input characters were output correctly. Additionally, it reduces the labor of writing directly. This device can reduce burdens on caregivers.","authors":["Mitsutaka Nakano","Kazuhiro Koshi","Jin Akaishi","Kimiyasu Kiyota"],"meta":["May 2019","DOI:10.1145/3325291.3325376","Conference: the 7th ACIS International Conference"],"references":["241628956_Handwriting_transmission_system_using_noncontact_tactile_display"]}