{"id":"336922719_Blockchain-based_Electronic_Healthcare_Record_System_for_Healthcare_40_Applications","abstract":"Modern healthcare systems are characterized as being highly complex and costly. However, this can be reduced through improved health record management, utilization of insurance agencies and blockchain technology. Blockchain was first introduced to provide distributed records of money-related exchanges that were not dependent on centralized authorities or financial institutions. Breakthroughs in blockchain technology have led to improved transactions involving medical records, insurance billing, and smart contracts, enabling permanent access and security of data, as well as\nproviding a distributed database of transactions. One significant advantage of using blockchain technology in the healthcare industry is that it can reform medical database interoperability, providing increased access to medical records, device tracking, prescription databases, and hospital assets, including the complete life cycle of a device within the blockchain infrastructure. Access to patients’ medical history is essential to correctly prescribe medication,\nwith blockchain being able to dramatically enhance the healthcare services framework. In this paper, several solutions for improving current limitations in healthcare systems using blockchain technology are explored, including frameworks and tools to measure the performance of such systems, e.g., Hyperledger Fabric, Composer, Docker Container, Hyperledger Caliper, and the Wireshark capture engine. Further, this paper proposes a Access Control Policy\nAlgorithm for improving data accessibility for healthcare providers, assisting in the simulation of environments to implement the Hyperledger-based EHR sharing system that uses the concept of a chaincode. Performance metrics in blockchain networks, such as latency, throughput, RTT etc. have also been optimized for achieving enhanced results. Compared to the current EHR system, which uses client-server architecture, our proposed system uses blockchain for\nimproved efficiency and security.","authors":["Sudeep Tanwar","Karan Pareikh"],"meta":["October 2019Journal of Information Security and Applications"],"references":["334659282_A_Ledger_of_Me_Personalizing_Healthcare_Using_Blockchain_Technology","333179363_Blockchain_for_Secure_EHRs_Sharing_of_Mobile_Cloud_Based_E-Health_Systems","332717860_Accelerating_Health_Data_Sharing_A_Solution_Based_on_the_Internet_of_Things_and_Distributed_Ledger_Technologies","332215097_Blockchain_Technology_in_Healthcare_A_Systematic_Review","332186860_The_Emerging_Role_of_Blockchain_Technology_Applications_in_Routine_Disease_Surveillance_Systems_to_Strengthen_Global_Health_Security","332015591_'Fit-for-purpose'_-_Challenges_and_opportunities_for_applications_of_blockchain_technology_in_the_future_of_healthcare","330113931_Applications_of_Blockchain_Technology_in_Medicine_and_Healthcare_Challenges_and_Future_Perspectives","330009592_Blockchain_for_AI_Review_and_Open_Research_Challenges","325748670_Continuous_Patient_Monitoring_With_a_Patient_Centric_Agent_A_Block_Architecture","325605811_Healthcare_Blockchain_System_Using_Smart_Contracts_for_Secure_Automated_Remote_Patient_Monitoring","336142085_Blockchain-based_Security_Attack_Resilience_Schemes_for_Autonomous_Vehicles_in_Industry_40_A_Systematic_Review","334214537_Security_and_Privacy_on_Blockchain","333843898_BloHosT_Blockchain_Enabled_Smart_Tourism_and_Hospitality_Management","333843750_HaBiTs_Blockchain-based_Telesurgery_Framework_for_Healthcare_40","332761355_Converging_Blockchain_and_Machine_Learning_for_Healthcare","332564819_Securing_Electronics_Healthcare_Records_in_Healthcare_40_A_Biometric-based_Approach"]}