{"id":"336900765_The_Structure_of_Binary_Matroids_with_no_Induced_Claw_or_Fano_Plane_Restriction","abstract":"A well-known conjecture of András Gyárfás and David Sumner states that for every positive integer m and every finite tree T there exists k such that all graphs that do not contain the clique Km or an induced copy of T have chromatic number at most k. The conjecture has been proved in many special cases, but the general case has been open for several decades. The main purpose of this paper is to consider a natural analogue of the conjecture for matroids, where it turns out, interestingly, to be false. Matroids are structures that result from abstracting the notion of independent sets in vector spaces: that is, a matroid is a set M together with a nonempty hereditary collection I of subsets deemed to be independent where all maximal independent subsets of every set are equicardinal. They can also be regarded as generalizations of graphs, since if G is any graph and I is the collection of all acyclic subsets of E(G), then the pair (E(G),I) is a matroid. In fact, it is a binary matroid, which means that it can be represented as a subset of a vector space over F2. To do this, we take the space of all formal sums of vertices and represent the edge vw by the sum v+w. A set of edges is easily seen to be acyclic if and only if the corresponding set of sums is linearly independent. There is a natural analogue of an induced subgraph for matroids: an induced restriction of a matroid M is a subset M′ of M with the property that adding any element of M−M′ to M′ produces a matroid with a larger independent set than M′. The natural analogue of a tree with m edges is the matroid Im, where one takes a set of size m and takes all its subsets to be independent. (Note, however, that unlike with graph-theoretic trees there is just one such matroid up to isomorphism for each m.) Every graph can be obtained by deleting edges from a complete graph. Analogously, every binary matroid can be obtained by deleting elements from a finite binary projective geometry, that is, the set of all one-dimensional subspaces in a finite-dimensional vector space over F2. Finally, the analogue of the chromatic number for binary matroids is a quantity known as the critical number introduced by Crapo and Rota, which in the case of a graph G turns out to be ⌈log2(χ(G))⌉ -- that is, roughly the logarithm of its chromatic number. One of the results of the paper is that a binary matroid can fail to contain I3 or the Fano plane F7 (which is the simplest projective geometry) as an induced restriction, but also have arbitrarily large critical number. By contrast, the critical number is at most two if one also excludes the matroid associated with K5 as an induced restriction. The main result of the paper is a structural description of all simple binary matroids that have neither I3 nor F7 as an induced restriction.","authors":["Peter Nelson","Luke Postle","Tom Kelly","František Kardoš"],"meta":["October 2019","DOI:10.19086/aic.10256"],"references":["292186403_Induced_subgraphs_of_graphs_with_large_chromatic_number_II_Three_steps_towards_Gyarfas'_conjectures","265360273_Subtrees_of_a_graph_and_the_chromatic_number","263413896_On_the_non-uniqueness_of_-cones_of_matroids","243088574_q-Lifts_of_Tangential_k-Blocks","223208194_A_characterization_of_flat_spaces_in_a_finite_geometry_and_the_uniqueness_of_the_hamming_and_the_MacDonald_codes"]}