{"id":"336926752_Equity_in_the_Who_How_and_What_of_Computer_Science_Education_K12_School_District_Conceptualizations_of_Equity_in_'CS_for_All'_Initiatives","abstract":"Equity is arguably an agreed upon value within the Computer Science education (CSed) community, and perhaps even more so within efforts to universalize access to CSed within K12 settings through emerging ‘CS for All’ initiatives. However, stakeholders often mean different things when referring to equity, with important implications for what CS teaching and learning looks like in schools. In this paper, we explore the question of how K12 school district actors’ conceptualizations of equity manifest within their planning and implementation of district-wide CSed initiatives. Based on a research-practice partnership aimed at supporting and researching district-wide CSed initiatives, data presented - interviews with district faculty, district planning documents, meeting transcripts and field observations - were drawn from five participating school districts as they made decisions and enacted activities over 11 months in areas including vision-setting, curriculum, professional development, leadership efforts and use of formative data about implementation. Analyzing these data through equity frameworks found in CSed literature, we highlight three distinct but interconnected ways that district actors conceptualized equity within their CSed initiatives: (1) equity in who Computer Science is for, (2) equity in how Computer Science is taught, and (3) equity in what Computer Science is taught. Data show that these varied conceptualizations resulted in different kinds of decisions about CSed in districts. We discuss the implications of these findings in terms of their relevance to equity-oriented CS education researchers, and what lessons they hold for policy-makers and education leaders engaged in their own efforts to support equitable computer science education.","authors":["Rafi Santo","June Ahn","Anthony Pellicone","Julia Aguiar"],"meta":["February 2019","DOI:10.1109/RESPECT46404.2019.8985901","Conference: Research on Equity and Sustained Participation in Engineering, Computing, and Technology (RESPECT)At: Minneapolis, MN"],"references":["331301973_The_Role_of_Translanguaging_in_Computational_Literacies_Documenting_Middle_School_Bilinguals'_Practices_in_Computer_Science_Integrated_Units","323324710_A_Landscape_Study_of_Computer_Science_Education_in_NYC_Early_Findings_and_Implications_for_Policy_and_Practice","325897567_A_community_model_of_CSforALL_analysis_of_community_commitments_for_CS_education","324847045_Upward_mobility_for_underrepresented_students_a_model_for_a_cohort-based_bachelor's_degree_in_computer_science","323743476_Ethics_Identity_and_Political_Vision_Toward_a_Justice-Centered_Approach_to_Equity_in_Computer_Science_Education","321371204_Upward_Mobility_for_Underrepresented_Students_A_Model_for_a_Cohort-Based_Bachelor's_Degree_in_Computer_Science","318065156_Universal_Design_for_Learning","316949058_Concepts_and_Practices_Designing_and_Developing_A_Modern_K-12_CS_Framework","315458366_When_Media_Companies_Insist_They're_Not_Media_Companies_and_Why_It_Matters_for_Communications_Policy","312670001_Universal_Design_for_Learning"]}