{"id":"336989165_Multi_Information_Amount_Movement_Aware-_Routing_in_FANET_Flying_Ad-hoc_Networks","abstract":"Mobile Ad hoc Networks (MANETs) having few requests, for instances, catastrophic event, sensor systems and many more. What so ever may be the case, there are many outrageous circumstances where MANETs could come in hand. In such circumstances, flying specially appointed systems such as Flying ad hoc networks (FANET) could assumes imperative job to be built upon the correspondence. Flying Ad hoc Networks is a sub class of Mobile Ad hoc Networks. Swarms of Unmanned Aerial Vehicle (UAV) orchestrate themselves to convey in enormous operational zone utilizing remote system with no unified gadget. The Unmanned Aerial Vehicle (UAV) is said to be a Drone. They speak with one another in the vicinity, with BS and furthermore communicate with their condition to get data. Various sorts of Drone dependent on the different application zones in FANETs. Drones are utilized by the FANETs, Drone is an airplane that flies without pilot. Attributable to its qualities, for instances, high versatility, quick topology changes, and incessant connection disappointments. In this manner, building up a proficient directing convention over FANETs is an exceptionally testing issue and thus set off the consideration of a great deal of ebb and flow analysts. In the present article, a Multi Information Amount Movement Aware (MIAMA) has been proposed convention having novel steering along with control measured components has recommended. Essentially, Multi Information Amount Movement Aware convention is considered as a noteworthy expansion of Mobility Aware Dual Phase AODV with Adaptive Hello Messages (MA-DP-AODV-AHM) convention. Network Simulator 2 test system has been used in which gigantic reproductions has led under the base of Drone, parcel rate along with consistent piece rate associations. Recreation results abridge that MIAMA contributes productively in alleviating the system flimsiness through creating quick and stable courses and diminishing connection disappointments.","authors":["Sheryl Radley","Sybi Cynthia","K. Premkumar"],"meta":["April 2020Mobile Networks and Applications 25(5)","DOI:10.1007/s11036-019-01395-4"],"references":["343007224_Routing_Protocols_in_FANET_Survey","324912012_Energy_Aware_Cluster-Based_Routing_in_Flying_Ad-Hoc_Networks","312037256_Performance_Analysis_of_Vehicular_Adhoc_Network_Using_Different_Highway_Traffic_Scenarios_in_Cloud_Computing","304715523_A_reliable_delay_bounded_and_less_complex_communication_protocol_for_multicluster_FANETs","300337987_On_the_Routing_in_Flying_Ad_hoc_Networks","318772434_Analysis_of_mobility_models_and_routing_schemes_for_flying_ad-hoc_networks_FANETS","309171514_PAWN_a_payload-based_mutual_authentication_scheme_for_wireless_sensor_networks_PAWN","304816511_Towards_Trusted_and_Efficient_UAV-Based_Communication","304021820_Peer_selection_algorithm_in_flying_ad_hoc_networks","304021747_Experimental_estimate_of_using_the_ant_colony_optimization_algorithm_to_solve_the_routing_problem_in_FANET","283657519_Survey_of_Important_Issues_in_UAV_Communication_Networks","271707030_Applying_OLSR_routing_in_FANETs","271644696_Applying_OLSR_Routing_in_FANETs","271472954_A_mobility_model_for_UAV_ad_hoc_network","272240514_On_the_security_of_a_lightweight_authentication_and_encryption_scheme_for_mobile_ad_hoc_network"]}