{"id":"336944831_Scientific_applications_and_prospects_of_nanomaterials_A_multidisciplinary_review","abstract":"Nanotechnology is the science of objects <100 nm in size. Research into the development and application of nanomaterials takes a material science and engineering-based approach to nanotechnology. Nanomaterials often possess interesting optical, electronic and mechanical properties. The capacity to construct large, intricate structures with nanometer precision is rapidly increasing and consists several top-down reductive approaches and bottom-up additive approaches to satisfy its applicability in several fields of science. The physicochemical property of nano-functional materials and structural flexibility, promotes its vast application in chemistry and chemical engineering; physics and electronics; biochemistry and medical science, exploration and mining; computer science and engineering. A large pool of information was accessed via several reputable published books and articles, with the sole aim to contribute to the establishment of a stronger theoretical basis for the growing application of nanomaterials in several field of science. It has been established that nanomaterials and advancement in nanotechnology holds great potential in solving several global problems, and if properly harnessed with the right synergy between disciplines or fields in science, would increase the quality of life on Earth.","authors":["Adedapo Adeola","Oluwaseun Fapohunda","Adeleke Teslim Jimoh","Toluwaloju Tunde"],"meta":["October 2019AFRICAN JOURNAL OF BIOTECHNOLOGY 18(30):946-961","DOI:10.5897/AJB2019.16812","Projects: Nano researchScientific Prospect and Applications of Nanomaterials: A Multidisciplinary Review"],"references":["326803491_Synthesis_of_Faujasite_Zeolite_Z_for_Adsorption_of_Cationic_Dye_from_Textile_Waste_Water","307787080_The_effects_of_ZrO2_nanoparticles_on_physical_and_mechanical_properties_of_high_strength_self_compacting_concrete","306276028_Controlling_bentonite-based_drilling_mud_properties_using_sepiolite_nanoparticles","306243509_Drinking_water_contamination_and_treatment_techniques","313423825_Advanced_nanomaterials_in_oil_and_gas_industry_Design_application_and_challenges","312129773_Application_of_nanotechnology_in_petroleum_exploration_and_development","311898501_Wellbore_integrity_and_cement_failure_at_HPHT_conditions","311450805_Bio_synthesis_of_silver_nanoparticles_and_its_application_in_microbial_treatment_of_drinking_water","304685930_Kinetics_and_mechanisms_of_the_catalytic_thermal_cracking_of_asphaltenes_adsorbed_on_supported_nanoparticles","304404333_Synthesis_Classification_and_Properties_of_Nanomaterials"]}