{"id":"336987588_Formation_des_enfants_du_primaire_a_la_programmation_informatique_avec_Scratch_Observation_et_analyse_du_developpement_des_competences_sous-_jacentes_a_la_pensee_informatique","abstract":"Pour ne pas faire de l'enfant togolais un simple consommateur de technologie, à cette époque où le numérique est omniprésent dans le quotidien, une formation est proposée aux élèves du primaire d'une école de Lomé sur Scratch. Conçu pour initier les enfants et les adolescents à la programmation, Scratch est un logiciel qui permet de développer chez l'enfant des compétences en programmation et d'acquérir les compétences sous-jacentes à la pensée informatique. Durant l'année scolaire 2017-2018, 177 enfants des classes de Cours Élémentaire Deuxième année (CE2) et du Cours Moyen Première année (CM1) ont suivi, dans la salle informatique de leur établissement, une heure de cours d'informatique sur Scratch par semaine. L'objectif de cette recherche est de comprendre et de vérifier l'apport de la programmation dans leur capacité à raisonner, à coopérer et à créer des jeux. La question principale qui sous-tend notre recherche est liée à la manière dont les enfants s'approprient des concepts informatiques via l'utilisation du logiciel Scratch et comment ils utilisent ces connaissances acquises pour trouver une solution à une situation problème. Pour ce faire, des observations sont faites et des entretiens ont été réalisés avec les formateurs et les élèves. L'analyse des entretiens de même que les productions et les évaluations des élèves ont permis de mettre en évidence une assimilation des contenus de programmation informatique, le développement d'une certaine capacité d'analyse, de cohérence et de logique. Ces compétences sont sous-jacentes à la pensée informatique et sont des avantages liés à l'apprentissage du code par ces élèves.","authors":["Akouété Apedjinou","Kouawo Achille"],"meta":["November 2019"],"references":["347422100_Creativite_dialogisme_et_multimodalite_trois_qualites_d'un_environnement_de_conception_numerique_collaboratif","330179808_Que_disent_les_sciences_de_l'education_a_propos_de_l'apprentissage_du_code","345137286_La_recherche_appliquee_pour_les_professionnels","343914333_Apprendre_a_programmer_a_l'ecole_primaire_Une_approche_exploratoire_en_cycle_2","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","324308514_Plans_and_Situated_Actions_The_Problem_of_Human-Machine_Communication","323595489_Apprendre_a_programmer_un_robot_humanoide_impacts_sur_des_eleves_de_l'adaptation_scolaire","317953505_Situated_learning_Legitimate_peripheral_participation","316994647_Un_robot_humanoide_pour_aider_les_eleves_ayant_un_trouble_du_spectre_de_l'autisme","283971767_Approche_du_noyau_central_Proprietes_quantitatives_et_structurales","283680366_When_Children_Teach_a_Robot_to_Write_An_Autonomous_Teachable_Humanoid_Which_Uses_Simulated_Handwriting","274309848_Computational_Thinking","270157832_Taches_de_programmation_avec_Scratch_a_l'ecole_primaire_Observation_et_analyse_du_developpement_des_competences_en_mathematique","262331246_Code_Club_Bringing_programming_to_UK_primary_schools_through_scratch","258122799_The_New_Educational_Technology"]}