{"id":"336926980_Context-aware_rule_learning_from_smartphone_data_survey_challenges_and_future_directions","abstract":"Smartphones are considered as one of the most essential and highly personal devices of individuals in our current world. Due to the popularity of context-aware technology and recent developments in smartphones, these devices can collect and process raw contextual data about users’ surrounding environment and their corresponding behavioral activities with their phones. Thus, smartphone data analytics and building data-driven context-aware systems have gained wide attention from both academia and industry in recent days. In order to build intelligent context-aware applications on smartphones, effectively learning a set of context-aware rules from smartphone data is the key. This requires advanced data analytical techniques with high precision and intelligent decision making strategies based on contexts. In comparison to traditional approaches, machine learning based techniques provide more effective and efficient results for smartphone data analytics and corresponding context-aware rule learning. Thus, this article first makes a survey on previous work in the area of contextual smartphone data analytics and then presents a discussion of challenges and future directions for effectively learning context-aware rules from smartphone data, in order to build rule-based automated and intelligent systems.","authors":["Iqbal H. Sarker"],"meta":["October 2019Journal of Big Data 6(1)","DOI:10.1186/s40537-019-0258-4","Project: Data Science and Machine Learning"],"references":["337011848_CalBehav_A_Machine_Learning-Based_Personalized_Calendar_Behavioral_Model_Using_Time-Series_Smartphone_Data","333648003_RecencyMiner_mining_recency-based_personalized_behavior_from_contextual_smartphone_data","328795416_Mobile_Data_Science_Towards_Understanding_Data-Driven_Intelligent_Mobile_Applications","328725229_Research_issues_in_mining_user_behavioral_rules_for_context-aware_intelligent_mobile_applications","328247357_Understanding_the_Role_of_Data-Centric_Social_Context_in_Personalized_Mobile_Applications","325839920_Mining_User_Behavioral_Rules_from_Smartphone_Data_Through_Association_Analysis","348000059_A_Generative_Model_For_Time_Series_Discretization_Based_On_Multiple_Normal_Distributions","335511502_AppsPred_Predicting_Context-Aware_Smartphone_Apps_using_Random_Forest_Learning","332697571_What_did_you_do_today_Discovering_daily_routines_from_large-scale_mobile_data","330905211_A_Machine_Learning_based_Robust_Prediction_Model_for_Real-life_Mobile_Phone_Data"]}