{"id":"336909527_Homozygous_missense_variant_in_the_TTN_gene_causing_autosomal_recessive_limb-girdle_muscular_dystrophy_type_10","abstract":"Background: \nLimb-girdle muscular dystrophies (LGMDs) are large group of heterogeneous genetic diseases, having a hallmark feature of muscle weakness. Pathogenic mutations in the gene encoding the giant skeletal muscle protein titin (TTN) are associated with several muscle disorders, including cardiomyopathy, recessive congenital myopathies and limb-girdle muscular dystrophy (LGMD) type10. The phenotypic spectrum of titinopathies is expanding, as next generation sequencing (NGS) technology makes screening of this large gene possible.\n\nAim: \nThis study aimed to identify the pathogenic variant in a consanguineous Pakistani family with autosomal recessive LGMD type 10.\n\nMethods: \nDNA from peripheral blood samples were obtained, whole exome sequencing (WES) was performed and several molecular and bioinformatics analysis were conducted to identify the pathogenic variant. TTN coding and near coding regions were further amplified using PCR and sequenced via Sanger sequencing.\n\nResults: \nWhole exome sequencing analysis revealed a novel homozygous missense variant (c.98807G > A; p.Arg32936His) in the TTN gene in the index patients. No heterozygous individuals in the family presented LGMD features. The variant p.Arg32936His leads to a substitution of the arginine amino acid at position 32,936 into histidine possibly causing LGMD type 10.\n\nConclusion: \nWe identified a homozygous missense variant in TTN, which likely explains LGMD type 10 in this family in line with similar previously reported data. Our study concludes that WES is a successful molecular diagnostic tool to identify pathogenic variants in large genes such as TTN in highly inbred population.","authors":["Amjad Khan","Rongrong Wang","Shirui Han","Muhammad Umair"],"meta":["October 2019BMC Medical Genetics 20(1)","DOI:10.1186/s12881-019-0895-7","Projects: Muscular DystrophiesNext generation sequencing technologies usage in the molecular diagnosis of rare monogenic disease."],"references":["331560092_Childhood_onset_limb-girdle_muscular_dystrophies_in_the_Aegean_part_of_Turkey","330589397_SGCD_Homozygous_Nonsense_Mutation_pArg97_Causing_Limb-Girdle_Muscular_Dystrophy_Type_2F_LGMD2F_in_a_Consanguineous_Family_a_Case_Report","329888323_Limb-girdle_Muscular_Dystrophy_with_New_Mutation_in_Sarcoglycan_Beta_Gene_A_Case_Report","309590404_Targeted_Next-Generation_Sequencing_Reveals_Novel_TTN_Mutations_Causing_Recessive_Distal_Titinopathy","277406603_Titin_mutations_the_fall_of_Goliath","273148351_Standards_and_Guidelines_for_the_Interpretation_of_Sequence_Variants_A_Joint_Consensus_Recommendation_of_the_American_College_of_Medical_Genetics_and_Genomics_and_the_Association_for_Molecular_Patholo","262536660_Nigro_V_Savarese_M_Genetic_basis_of_limb-girdle_muscular_dystrophies_the_2014_update_Acta_Myol_33_1-12","305891308_Limb_girdle_muscular_dystrophies_classification_clinical_spectrum_and_emerging_therapies","273639775_Adult_onset_limb-girdle_muscular_dystrophy_-_A_recessive_titinopathy_masquerading_as_myositis","259607927_Atypical_phenotypes_in_titinopathies_explained_by_second_titin_mutations"]}