{"id":"336928966_Master_as_a_Service_A_multidisciplinary_approach_to_Big_Data_teaching","abstract":"The recent and rapid growth of data-driven applications, fostered by the advent of enhanced Information and Communication Technologies (ICTs) together with the broad availability of modern high-performance storage and computing infrastructures, has created a considerable gap of experts in this new field. The quick evolution of these technologies, their dissimilarities with traditional approaches, and the broad skills set required to master them, might prevent existing professionals working in industry to gain high quality knowledge and experience in Big Data related areas. Therefore, universities and teaching professionals must propose feasible and effective alternatives to train professionals and students in these topics. The purpose of this paper is to present the Master as a Service (MaaS) approach, that is currently being used to train students in Big Data- related areas (e.g., eHealth, Digital Transformation, etc.), following a multidisciplinary, Project Based Learning strategy. More specifically, students coming from different master's degrees and undergraduate backgrounds (ranging from management studies to computer engineering, including architects, social and physical sciences) are trained to address latent and future challenges in Big Data and High-Performance Computing technologies by combining their profiles, and exposing them to real-world challenges that require the very best of each different profile. The results obtained from the implementation of the MaaS approach during the last two years in terms of both student satisfaction and employability rate, confirm the benefits of this method and encourage practitioners to keep working in this direction.","authors":["Joan Navarro","Agustin Zaballos","David Fonseca","Ricardo Torres Kompen"],"meta":["October 2019","DOI:10.1145/3362789.3362841","Conference: the Seventh International Conference"],"references":["324895946_Competency_Maps_an_Effective_Model_to_Integrate_Professional_Competencies_Across_a_STEM_Curriculum","318459963_Improving_the_information_society_skills_Is_knowledge_accessible_for_all","262347545_Challenges_and_opportunities_with_big_data","261226107_Big_Data_Issues_and_Challenges_Moving_Forward","315922426_A_Process_for_Curricular_Improvement_Based_on_Evaluation_of_Student_Performance_on_Milestone_Examinations","312960571_Competencias_academicas_de_los_egresados_universitarios_y_su_prediccion_de_ocupacion_laboral_College_graduates'_academic_skills_and_their_occupational_employment_projection","304194184_Bologna_Process","274479822_Big_Data_and_Its_Technical_Challenges","248994765_The_gap_between_educational_research_and_practice_Views_of_teachers_school_leaders_intermediaries_and_researchers","238316836_The_pace_of_technological_innovation_in_architecture_engineering_and_construction_education_Integrating_recent_trends_into_the_curricula"]}