{"id":"336900919_A_tight_Erdos-Posa_function_for_planar_minors","abstract":"Let F be a family of graphs. Then for every graph G the maximum number of disjoint subgraphs of G, each isomorphic to a member of F, is at most the minimum size of a set of vertices that intersects every subgraph of G isomorphic to a member of F. We say that F packs if equality holds for every graph G. Only very few families pack. As the next best weakening we say that F has the Erdős-Pósa property if there exists a function f such that for every graph G and integer k>0 the graph G has either k disjoint subgraphs each isomorphic to a member of F or a set of at most f(k) vertices that intersects every subgraph of G isomorphic to a member of F. The name is motivated by a classical 1965 result of Erdős and Pósa stating that for every graph G and integer k>0 the graph G has either k disjoint cycles or a set of O(klogk) vertices that intersects every cycle. Thus the family of all cycles has the Erdős-Pósa property with f(k)=O(klogk). In contrast, the family of odd cycles fails to have the Erdős-Pósa property. For every integer ℓ, a sufficiently large Escher Wall has an embedding in the projective plane such that every face is even and every homotopically non-trivial closed curve intersects the graph at least ℓ times. In particular, it contains no set of ℓ vertices such that each odd cycle contains at least one them, yet it has no two disjoint odd cycles. By now there is a large body of literature proving that various families F have the Erdős-Pósa property. A very general theorem of Robertson and Seymour says that for every planar graph H the family F(H) of all graphs with a minor isomorphic to H has the Erdős-Pósa property. (When H is non-planar, F(H) does not have the Erdős-Pósa property.) The present paper proves that for every planar graph H the family F(H) has the Erdős-Pósa property with f(k)=O(klogk), which is asymptotically best possible for every graph H with at least one cycle.","authors":["Wouter Cames van Batenburg","Tony Huynh","Gwenaël Joret","Jean-Florent Raymond"],"meta":["October 2019","DOI:10.19086/aic.10807","Project: Erdös-Pósa property"],"references":["283210011_An_Olog_OPT-Approximation_for_Covering_and_Packing_Minor_Models_of_thr","327635139_A_Tight_Erdos--Posa_Function_for_Wheel_Minors","327014508_A_Unified_Erdos-Posa_Theorem_for_Constrained_Cycles","318237678_Long_cycles_through_prescribed_vertices_have_the_Erdos-Posa_property_BRUHN_et_al","317872215_Packing_and_covering_immersion-expansions_of_planar_sub-cubic_graphs","313856935_Parity_Linkage_and_the_Erdos-Posa_Property_of_Odd_Cycles_through_Prescribed_Vertices_in_Highly_Connected_Graphs_THE_ERDOS-POSA_PROPERTY_OF_ODD_CYCLES","313534318_A_tight_Erdos-Posa_function_for_long_cycles","312626410_On_the_presence_of_disjoint_subgraphs_of_a_specified_type","312127902_Polynomial_Bounds_for_the_Grid-Minor_Theorem","281012532_On_disjoint_directed_cycles_with_prescribed_minimum_lengths"]}