{"id":"336952006_Hybrid_and_Multifaceted_Context-Aware_Misbehavior_Detection_Model_for_Vehicular_Ad_Hoc_Network","abstract":"Vehicular Ad Hoc Networks (VANETs) have emerged mainly to improve road safety and traffic efficiency and provide user comfort. The performance of such networks’ applications relies on the availability of accurate and recent mobility-information shared among vehicles. This means that misbehaving vehicles that share false mobility information can lead to catastrophic losses of life and property. However, the current solutions proposed to detect misbehaving vehicles are not able to cope with the dynamic vehicular context and the diverse cyber-threats, leading to a decrease in detection accuracy and an increase in false alarms. This paper addresses these issues by proposing a Hybrid and Multifaceted Context-aware Misbehavior Detection model (HCA-MDS), which consists of four phases: data-collection, context-representation, context-reference construction, and misbehavior detection. Data-centric and behavioral-detection-based features are derived to represent the vehicular context. An online and timely updated context-reference model is built using unsupervised nonparametric statistical methods, namely Kalman and Hampel filters, through analyzing the temporal and spatial correlation of the consistency between mobility information to adapt to the highly dynamic vehicular context. Vehicles’ behaviors are evaluated locally and autonomously according to the consistency, plausibility, and reliability of their mobility information. The results from extensive simulations show that HCA-MDS outperforms existing solutions in increasing the detection rate by 38% and decreasing the false positive rate by 7%. These results demonstrate the effectiveness and robustness of the proposed HCA-MDS model to strengthen the security of VANET applications and protocols.","authors":["Fuad A. Ghaleb","Mohd Aizaini Maarof","Anazida Zainal","Bander Ali Saleh Al-rimy"],"meta":["October 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2950805"],"references":["330413858_A_Survey_of_Vehicle_to_Everything_V2X_Testing","322779772_An_effective_misbehavior_detection_model_using_artificial_neural_network_for_vehicular_ad_hoc_network_applications","321262772_Cooperative_awareness_in_VANETs_On_ETSI_EN_302_637-2_performance","315439003_A_Survey_of_Attacks_and_Detection_Mechanisms_on_Intelligent_Transportation_Systems_VANETs_and_IoV","309388104_Survey_on_Misbehavior_Detection_in_Cooperative_Intelligent_Transportation_Systems","335954870_Context-Aware_Data-Centric_Misbehaviour_Detection_Scheme_for_Vehicular_Ad_Hoc_Networks_using_Sequential_Analysis_of_the_Temporal_and_Spatial_Correlation_of_the_Consistency_between_the_Cooperative_Awar","327847960_Detecting_Location_Spoofing_using_ADAS_sensors_in_VANETs","326306648_Driving-situation-aware_adaptive_broadcasting_rate_scheme_for_vehicular_ad_hoc_network","317790194_Improved_vehicle_positioning_algorithm_using_enhanced_innovation-based_adaptive_Kalman_filter","310403387_A_K-means_clustering_algorithm","308573202_Mobility_information_estimation_algorithm_using_Kalman-filter_for_vehicular_ad_hoc_networks","305884385_Generalized_Hampel_Filters","305923906_Computational_Security_for_Context-Awareness_in_Vehicular_Ad-Hoc_Networks","304179821_Summarizing_Data_with_Boxplots","303146050_Cognitive_cars_A_new_frontier_for_ADAS_research"]}