{"id":"336910551_Machine_Friendly_Machine_Learning_Interpretation_of_Computed_Tomography_Without_Image_Reconstruction","abstract":"Recent advancements in deep learning for automated image processing and classification have accelerated many new applications for medical image analysis. However, most deep learning algorithms have been developed using reconstructed, human-interpretable medical images. While image reconstruction from raw sensor data is required for the creation of medical images, the reconstruction process only uses a partial representation of all the data acquired. Here, we report the development of a system to directly process raw computed tomography (CT) data in sinogram-space, bypassing the intermediary step of image reconstruction. Two classification tasks were evaluated for their feasibility of sinogram-space machine learning: body region identification and intracranial hemorrhage (ICH) detection. Our proposed SinoNet, a convolutional neural network optimized for interpreting sinograms, performed favorably compared to conventional reconstructed image-space-based systems for both tasks, regardless of scanning geometries in terms of projections or detectors. Further, SinoNet performed significantly better when using sparsely sampled sinograms than conventional networks operating in image-space. As a result, sinogram-space algorithms could be used in field settings for triage (presence of ICH), especially where low radiation dose is desired. These findings also demonstrate another strength of deep learning where it can analyze and interpret sinograms that are virtually impossible for human experts.","authors":["Hyunkwang Lee","Chao Huang","Sehyo Yune","Shahein Tajmir"],"meta":["October 2019Scientific Reports 9(1):15540","DOI:10.1038/s41598-019-51779-5"],"references":["324842467_Artifact_Removal_using_Improved_GoogLeNet_for_Sparse-view_CT_Reconstruction","322928715_Artificial_Intelligence_and_Machine_Learning_in_Radiology_Opportunities_Challenges_Pitfalls_and_Criteria_for_Success","319770123_Densely_Connected_Convolutional_Networks","316598940_Image_reconstruction_by_domain_transform_manifold_learning","344713686_An_Introduction_to_the_Bootstrap","328241386_Deep_learning_algorithms_for_detection_of_critical_findings_in_head_CT_scans_a_retrospective_study","325519218_SIPID_A_deep_learning_framework_for_sinogram_interpolation_and_image_denoising_in_low-dose_CT_reconstruction","325159150_Image_Reconstruction_Is_a_New_Frontier_of_Machine_Learning","323550433_Deep-Neural-Network-Based_Sinogram_Synthesis_for_Sparse-View_CT_Image_Reconstruction","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification"]}