{"id":"336901239_Guidelines_for_the_Early_Management_of_Patients_With_Acute_Ischemic_Stroke_2019_Update_to_the_2018_Guidelines_for_the_Early_Management_of_Acute_Ischemic_Stroke_A_Guideline_for_Healthcare_Professionals","abstract":"Background and Purpose—\nThe purpose of these guidelines is to provide an up-to-date comprehensive set of recommendations in a single document for clinicians caring for adult patients with acute arterial ischemic stroke. The intended audiences are prehospital care providers, physicians, allied health professionals, and hospital administrators. These guidelines supersede the 2013 Acute Ischemic Stroke (AIS) Guidelines and are an update of the 2018 AIS Guidelines.\n\nMethods—\nMembers of the writing group were appointed by the American Heart Association (AHA) Stroke Council’s Scientific Statements Oversight Committee, representing various areas of medical expertise. Members were not allowed to participate in discussions or to vote on topics relevant to their relations with industry. An update of the 2013 AIS Guidelines was originally published in January 2018. This guideline was approved by the AHA Science Advisory and Coordinating Committee and the AHA Executive Committee. In April 2018, a revision to these guidelines, deleting some recommendations, was published online by the AHA. The writing group was asked review the original document and revise if appropriate. In June 2018, the writing group submitted a document with minor changes and with inclusion of important newly published randomized controlled trials with >100 participants and clinical outcomes at least 90 days after AIS. The document was sent to 14 peer reviewers. The writing group evaluated the peer reviewers’ comments and revised when appropriate. The current final document was approved by all members of the writing group except when relationships with industry precluded members from voting and by the governing bodies of the AHA. These guidelines use the American College of Cardiology/AHA 2015 Class of Recommendations and Level of Evidence and the new AHA guidelines format.\n\nResults—\nThese guidelines detail prehospital care, urgent and emergency evaluation and treatment with intravenous and intra-arterial therapies, and in-hospital management, including secondary prevention measures that are appropriately instituted within the first 2 weeks. The guidelines support the overarching concept of stroke systems of care in both the prehospital and hospital settings.\n\nConclusions—\nThese guidelines provide general recommendations based on the currently available evidence to guide clinicians caring for adult patients with acute arterial ischemic stroke. In many instances, however, only limited data exist demonstrating the urgent need for continued research on treatment of acute ischemic stroke.","authors":["William J. Powers","Alejandro A. Rabinstein","Teri Ackerson","Opeolu M. Adeoye"],"meta":["October 2019Stroke 50(12)","DOI:10.1161/STR.0000000000000211"],"references":["327387283_Closure_versus_Medical_Therapy_for_Patent_Foramen_Ovale_in_Patients_with_Cryptogenic_Stroke_An_Updated_Meta-Analysis_of_Randomized_Controlled_Trials","327230710_Clopidogrel_and_Aspirin_in_Acute_Ischemic_Stroke_and_High-Risk_TIA","331876965_Safety_and_efficacy_of_sonothrombolysis_for_acute_ischemic_stroke_a_multicentre_double-blind_phase_3_randomised_controlled_trial","331607005_Aspiration_thrombectomy_versus_stent_retriever_thrombectomy_as_first-line_approach_for_large_vessel_occlusion_COMPASS_a_multicentre_randomised_open_label_blinded_outcome_non-inferiority_trial","331158036_Articles_Intensive_blood_pressure_reduction_with_intravenous_thrombolysis_therapy_for_acute_ischaemic_stroke_ENCHANTED_an_international_randomised_open-label_blinded-endpoint_phase_3_trial","330459702_2018_AHAACCAACVPRAAPAABCACPMADAAGSAPhAASPCNLAPCNA_Guideline_on_the_Management_of_Blood_Cholesterol_A_Report_of_the_American_College_of_CardiologyAmerican_Heart_Association_Task_Force_on_Clinical_Pract","329722520_A_Decade_of_Improvement_in_Door-to-Needle_Time_Among_Acute_Ischemic_Stroke_Patients_2008_to_2017","327744024_The_International_Stroke_Trial_IST_a_randomised_trial_of_aspirin_subcutaneous_heparin_both_or_neither_among_19_435_patients_with_acute_ischaemic_stroke","327533489_Efficacy_and_Safety_of_Citalopram_for_the_Treatment_of_Poststroke_Depression_A_Meta-Analysis","327274983_Half_bolus_dose_of_intravenous_abciximab_is_safe_and_effective_in_the_setting_of_acute_stroke_endovascular_treatment"]}