{"id":"336987360_Auto-detection_of_Epileptic_Seizure_events_using_deep_neural_network_with_different_feature_scaling_techniques","abstract":"Misdiagnosis of epilepsy is more seen in manual analysis of electroencephalogram (EEG) signals for epileptic seizure event detection. Therefore, automated systems for epilepsy detection are required to help neurologists in diagnosing epilepsy. These automated systems act as supporting systems for the neurologists to diagnose epilepsy with good accuracy in less time. In this paper an attempt is made to develop an automated seizure detection method using deep neural network using the dataset collected from Bonn University, Germany. The results of the experiment are compared with the existing machine learning method. Our model gives better results compared to ML methods without the need of feature extraction. It is important to perform normalization of the dataset using feature scaling techniques to obtain good accuracy in the results. In this experiment we also worked on feature scaling of the dataset. At first we tried using StandardScaler and calculated loss using mean squared error. For this we achieved an accuracy of 97.21%, Sensitivity 98.17%, Specificity 94.93%, F1_score 98.48%, MCC 91.96% and ROC 97.55%. Experiment was continued to compare the performance of four different feature scaling techniques and four different loss functions. From the experimental results it was observed that StandardScaler and RobustScaler are equally good and are the best feature scaling techniques. Loss computed using Mean squared error works better in combination with all feature scaling techniques.","authors":["Thara T.D.K.","Prema Sudha B G","Fan Xiong"],"meta":["October 2019Pattern Recognition Letters 128(3)","DOI:10.1016/j.patrec.2019.10.029"],"references":["323657992_Applying_dimension_reduction_to_EEG_data_by_Principal_Component_Analysis_reduces_the_quality_of_its_subsequent_Independent_Component_decomposition","276412348_Evaluation_From_precision_recall_and_F-measure_to_ROC_informedness_markedness_correlation","256326897_API_design_for_machine_learning_software_Experiences_from_the_scikit-learn_project","319056639_Deep_Learning_and_Transfer_Learning_in_the_Classification_of_EEG_Signals"]}