{"id":"336918251_The_Role_of_Social_and_Ability_Belonging_in_Men's_and_Women's_pSTEM_Persistence","abstract":"The benefits of belonging for academic performance and persistence have been examined primarily in terms of subjective perceptions of social belonging, but feeling ability belonging, or fit with one’s peers intellectually, is likely also important for academic success. This may particularly be the case in male-dominated fields, where inherent genius and natural talent are viewed as prerequisites for success. We tested the hypothesis that social and ability belonging each explain intentions to persist in physical science, technology, engineering, and math (pSTEM). We further explore whether women experience lower social and ability belonging than men on average in pSTEM and whether belonging more strongly relates to intentions to persist for women. At three time points throughout a semester, we assessed undergraduate pSTEM majors enrolled in a foundational calculus or physics course. Women reported lower pSTEM ability belonging and self-efficacy than men but higher identification with pSTEM. End-of-semester social belonging, ability belonging, and identification predicted intentions to persist in pSTEM, with a stronger relationship between social belonging and intentions to persist in pSTEM for women than men. These findings held after controlling for prior and current academic performance, as well as two conventional psychological predictors of academic success.","authors":["Sarah Banchefsky","Karyn Lewis","Tiffany A. Ito"],"meta":["October 2019Frontiers in Psychology 10:2386","DOI:10.3389/fpsyg.2019.02386"],"references":["335082600_Sources_of_Male_and_Female_Students'_Belonging_Uncertainty_in_the_Computer_Sciences","333430906_Beliefs_in_Brilliance_and_Belonging_Uncertainty_in_Male_and_Female_STEM_StudentsTable_1docx","327143536_Factors_Influencing_High_School_Students'_Interest_in_pSTEM","317096537_Female_peer_mentors_early_in_college_increase_women's_positive_academic_experiences_and_retention_in_engineering","314093568_Opinion_Gender_diversity_leads_to_better_science","326584245_Using_social_psychological_theory_to_understand_choice_of_a_pSTEM_academic_major","322968523_The_Role_of_Prototype_Matching_in_Science_Pursuits_Perceptions_of_Scientists_That_Are_Inaccurate_and_Diverge_From_Self-Perceptions_Predict_Reduced_Interest_in_a_Science_Career","319543179_State_Authenticity_as_Fit_to_Environment_SAFE_the_implications_of_social_identity_for_fit_authenticity_and_self-segregation","319147924_Fitting_in_to_Move_Forward_Belonging_Gender_and_Persistence_in_the_Physical_Sciences_Technology_Engineering_and_Mathematics_pSTEM","314202364_The_Effects_of_Gender_Composition_on_Women's_Experience_in_Math_Work_Groups"]}