{"id":"336962150_Data_Mining_and_Information_Retrieval_in_the_21st_century_A_bibliographic_review","abstract":"Data Mining and Information Retrieval is an emerging interdisciplinary discipline dealing with Information Retrieval and Data Mining techniques. It has undergone rapid development with the advances in mathematics, statistics, information science, and computer science. In this paper, we present an empirical analysis of publication metadata obtained from 6 top-tier journals and 9 conferences for the first 16 years of the 21st Century, and evaluate the dynamic characteristics of Data Mining and Information Retrieval. We find a steady growth both in terms of productivity and impact, evidenced by the unabated number of publications/citations over the period of study. We note that the modality for co-operation in this field is changing from independent to collaborative. Furthermore, according to the citation pattern, the field is becoming open-minded as illustrated by a gradual decline of self-citation rates, which was dropped to 10% in 2015, nearly three times lower than what it was in 2000. Finally, we explore the inner structure relying on the topics evolution from the aspects of popular keywords/topics identification and evolution. Overall, this study provides insights of Data Mining and Information Retrieval behind its demonstrated growth in the recent past, with the ultimate goal of revealing its potential of driving scientific innovation in the future.","authors":["Jiaying Liu","Xiangjie Kong","Xinyu Zhou","Lei Wang"],"meta":["November 2019Computer Science Review 34:100193","DOI:10.1016/j.cosrev.2019.100193"],"references":["334261803_The_rise_of_blockchain_bibliometric_analysis_of_blockchain_study","331026686_The_evolution_of_citation_graphs_in_artificial_intelligence_research","324787467_VOPRec_Vector_Representation_Learning_of_Papers_with_Text_Information_and_Structural_Identity_for_Recommendation","324023933_Artificial_Intelligence_in_the_21st_Century","320861763_Scientometric_analysis_of_scientific_publications_in_CSCW","320681151_The_science_of_science_From_the_perspective_of_complex_systems","318657698_From_triadic_closure_to_conference_closure_the_role_of_academic_conferences_in_promoting_scientific_collaborations","316502780_Coauthorship_network_in_transportation_research","345153150_Shifu_Deep_Learning_Based_Advisor-advisee_Relationship_Mining_in_Scholarly_Big_Data","318918034_A_Century_of_Science_Globalization_of_Scientific_Collaborations_Citations_and_Innovations"]}