{"id":"336999574_Cost-Sensitive_BERT_for_Generalisable_Sentence_Classification_on_Imbalanced_Data","abstract":"The automatic identification of propaganda has gained significance in recent years due to technological and social changes in the way news is generated and consumed. That thistask can be addressed effectively using BERT,a powerful new architecture which can be fine-tuned for text classification tasks, is not surprising. However, propaganda detection, like other tasks that deal with news documents and other forms of decontextualized social communication (e.g. sentiment analysis), inherently deals with data whose categories are simultaneously imbalanced and dissimilar. We show that BERT, while capable of handling imbalanced classes with no additional data augmentation, does not generalise well when the training and test data are sufficiently dis-similar (as is often the case with news sources,whose topics evolve over time). We show how to address this problem by providing a statistical measure of similarity between datasets and a method of incorporating cost-weighting intoBERT when the training and test sets are dis-similar. We test these methods on the Propaganda Techniques Corpus (PTC) and achieve the second highest score on sentence-level propaganda classification.","authors":["Harish Tayyar Madabushi","Elena Kochkina","Michael Castelle"],"meta":["January 2019","DOI:10.18653/v1/D19-5018","Conference: Proceedings of the Second Workshop on Natural Language Processing for Internet Freedom: Censorship, Disinformation, and Propaganda"],"references":["333023732_Reported_speech_forms_a_dedicated_syntactic_domain","322590929_Truth_of_Varying_Shades_Analyzing_Language_in_Fake_News_and_Political_Fact-Checking","320442366_A_systematic_study_of_the_class_imbalance_problem_in_convolutional_neural_networks","316617635_Data_Augmentation_for_Low-Resource_Neural_Machine_Translation","336996294_EDA_Easy_Data_Augmentation_Techniques_for_Boosting_Performance_on_Text_Classification_Tasks","335783948_Multilingual_Named_Entity_Recognition_Using_Pretrained_Embeddings_Attention_Mechanism_and_NCRF","311977198_Learning_from_class-imbalanced_data_Review_of_methods_and_applications","306092988_Improving_Neural_Machine_Translation_Models_with_Monolingual_Data","305331572_Handbook_of_Propaganda_Studies","301446003_That's_So_Annoying_A_Lexical_and_Frame-Semantic_Embedding_Based_Data_Augmentation_Approach_to_Automatic_Categorization_of_Annoying_Behaviors_using_petpeeve_Tweets"]}