{"id":"336950234_Identifying_Application-Layer_DDoS_Attacks_Based_on_Request_Rhythm_Matrices","abstract":"Application-layer distributed denial of service (AL-DDoS) attacks are becoming critical threats to websites because the stealth of AL-DDoS attacks makes many intrusion prevention systems ineffective. To detect AL-DDoS attacks aimed at websites, we propose a novel statistical model called the RM (rhythm matrix). Although the original features from the network layer are adopted, the access trajectory, including requested objects and corresponding dwell-time values, can be abstracted and accumulated into an RM. With an RM, we can almost losslessly compress complex features into a simple structure and characterize the user access behavior. We detect AL-DDoS attacks according to the increase of the abnormality degree in the RM and further identify malicious hosts based on change-rate outliers. In the experiments, we simulate three modes of AL-DDoS attacks with the latest popular DDoS attack tools: LOIC and HOIC. The results show that our method can detect these simulated attacks and identify the malicious hosts accurately and efficiently. For an AL-DDoS detection method, the ability to distinguish flash crowds is indispensable. We also demonstrate the excellent performance of our approach in distinguishing flash crowds from AL-DDoS attacks with two reconstructed public datasets.","authors":["Huan Lin","Shoufeng Cao","Jiayan Wu","Zhenzhong Cao"],"meta":["October 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2950820"],"references":["330660547_Hybrid_feature_selection_technique_for_intrusion_detection_system","327335992_Anomaly_Detection_for_Application_Layer_User_Browsing_Behavior_Based_on_Attributes_and_Features","324864563_Detection_and_Differentiation_of_Application_Layer_DDoS_Attack_from_Flash_Events_using_Fuzzy-GA_Computation","320341005_Low-Rate_DDoS_Attack_Detection_Using_Expectation_of_Packet_Size","333742452_A_Survey_on_Distributed_Denial_of_Service_DDoS_Attacks_in_SDN_and_Cloud_Computing_Environments","332637428_The_Hybrid_Technique_for_DDoS_Detection_with_Supervised_Learning_Algorithms","330334547_Efficient_DDoS_Flood_Attack_Detection_using_Dynamic_Thresholding_on_Flow-Based_Network_Traffic","328755803_Statistical_Application_Fingerprinting_for_DDoS_Attack_Mitigation","327709301_DDoS_Attacks_at_the_Application_Layer_Challenges_and_Research_Perspectives_for_Safeguarding_Web_Applications","320176196_SkyShield_A_Sketch-based_Defense_System_Against_Application_Layer_DDoS_Attacks"]}