{"id":"337013717_The_Effect_of_Unplugged_Coding_Activities_on_Computational_Thinking_Skills_of_Middle_School_Students","abstract":"The purpose of the study is to examine the effect of unplugged coding activities carried out with middle school students on their computational thinking skills. This study employed nested-mixed design, which is a mixed research method; the data were supported by including the qualitative phase into an experimental study. In this frame, a group of 114 middle school students consisting of 5th graders were given coding training titled \"Kesfet Project - I Discover Coding\" by using unplugged coding content. The Computational Thinking Scale was applied to the students at the beginning and end of the training; the results obtained from the scale were analyzed by means of a paired t test. Finally, it was found out that unplugged coding activities had a positive effect on the improvement of computational thinking skills of the students. An examination of the sub-factors revealed that there is statistically no significant change in the problem solving skill despite the positive impact observed on creativity, algorithmic thinking, collaboration and critical thinking skills. Following the analysis of observation and daily data, the findings obtained revealed that the students usually displayed high levels of motivation and class participation in unplugged coding activities, they had difficulty in concretizing certain concepts as well as subjects requiring mathematical knowledge; various teaching methods and techniques were used in classes; the students liked the activities especially due to their appealing nature and their relation to daily life; however, there were occasional problems with scheduling of activities and teamwork due to over-crowded class size; the students experienced problems in achieving outcomes such as perceiving the relationship between computer science and mathematics and analyzing the given problem, and could have difficulty in associating between computer science and mathematics or between the subjects learned and the computer lesson, and in analyzing a given problem.","authors":["Betül Tonbuloğlu","Ismail TONBULOGLU"],"meta":["November 2019Informatics in Education 18(2):403-426","DOI:10.15388/infedu.2019.19"],"references":["340779338_Bilgi_Islemsel_Dusunmeden_Programlamaya_4_Baski","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","322106991_Bilgisayar_bilimi_egitimine_giris","317953655_Designing_and_conducting_mixed_methods_research","312253565_A_validity_and_reliability_study_of_the_Computational_Thinking_Scales_CTS","311508750_Sosyal_bilimlerde_nitel_arastirma_yontemleri","305081697_Using_Student_Performance_to_Assess_CS_Unplugged_Activities_in_a_Classroom_Environment","301429175_Introducing_teachers_to_computational_thinking_using_unplugged_storytelling","285837006_Computer_science_outreach_in_an_elementary_school","276441911_Reaching_a_Broader_Population_of_Students_through_Unplugged_Activities"]}