{"id":"337061989_Diagnosing_the_performance_of_human_mobility_models_at_small_spatial_scales_using_volunteered_geographical_information","abstract":"Accurate modelling of local population movement patterns is a core, contemporary concern for urban policymakers, affecting both the short-term deployment of public transport resources and the longer-term planning of transport infrastructure. Yet, while macro-level population movement models (such as the gravity and radiation models) are well developed, micro-level alternatives are in much shorter supply, with most macro-models known to perform poorly at smaller geographical scales. In this paper, we take a first step to remedy this deficit, by leveraging two novel datasets to analyse where and why macro-level models of human mobility break down. We show how freely available data from OpenStreetMap concerning land use composition of different areas around the county of Oxfordshire in the UK can be used to diagnose mobility models and understand the types of trips they over- and underestimate when compared with empirical volumes derived from aggregated, anonymous smartphone location data. We argue for new modelling strategies that move beyond rough heuristics such as distance and population towards a detailed, granular understanding of the opportunities presented in different regions.","authors":["Chico Q. Camargo","Jonathan Bright","Scott A. Hale"],"meta":["November 2019Royal Society Open Science 6(11):191034","DOI:10.1098/rsos.191034"],"references":["338838135_Estimating_Traffic_Disruption_Patterns_with_Volunteered_Geographic_Information","328511857_Identifying_and_predicting_social_lifestyles_in_people's_trajectories_by_neural_networks","327291737_Toward_cities_without_slums_Topology_and_the_spatial_evolution_of_neighborhoods","327119420_Communicability_geometry_captures_traffic_flows_in_cities","326338806_Debye-Huckel_theory_for_refugees'_migration","349188810_A_Comparison_Of_Four_Work_Trip_Distribution_Models","348865913_Entropy_in_Urban_and_Regional_Modelling_Routledge_Revivals","332747486_The_Gendered_Geography_of_Contributions_to_OpenStreetMap_Complexities_in_Self-Focus_Bias","329615604_Empirical_MFDs_using_Google_Traffic_Data","326498184_Estimating_traffic_disruption_patterns_with_volunteer_geographic_information"]}