{"id":"337023535_Plant_Disease_Identification_and_Classification_using_Image_Processing","abstract":"Abstract: An agricultural sector plays a vital role in the economy of country. Agricultural output is very vital in many developing countries. Increase in population and increase in the life expectancy is pressurizing the agricultural sector to come out with new types of high yielding crops. The diseases in the plants are common, early detection and controlling increases the yield of a crop. Development of technology in the field of computer science can be applied to detect these diseases early. Image processing and classification methods can be applied to identify the plant disease in the early stage. This paper developed a segmentation technique for automatic detection and classification of plant leaf diseases. Features are extracted and selected features are used for training and support vector machine (SVM) and artificial neural network (ANN) classifiers. The results obtained are satisfactory. Key words: Image processing, CBIR, SVM, Plant Disease, ANN.","authors":["K. Rajesh Babu"],"meta":["February 2019","Project: DEPTH RESOLUTION IN NON STATIONARY THERMAL WAVE IMAGING USING WAVELET TRANSFORM"],"references":["287958307_Comparative_Analysis_of_Textural_Features_Derived_from_GLCM_for_Ultrasound_Liver_Image_Classification","287577015_Detection_of_unhealthy_region_of_plant_leaves_and_classification_of_plant_leaf_diseases_using_texture_features","269409702_Climate_change_and_its_impact_on_plant_diseases","242156806_Classification_of_Broadleaf_and_Grass_Weeds_Using_Gabor_Wavelets_and_an_Artificial_Neural_Network","313575668_Statistical_and_structural_approaches_to_texture","308953779_Applying_image_processing_technique_to_detect_plant_diseases","271253992_Remote_Area_Plant_Disease_Detection_Using_Image_Processing","261458686_Image_processing_for_smart_farming_Detection_of_disease_and_fruit_grading","257001145_Introduction_to_Pattern_Recognition","248745382_Genetic_Programming_III_Darwinian_Invention_and_Problem_Solving"]}