{"id":"337054160_Technical_Competencies_in_Digital_Technology_towards_Industrial_Revolution_40","abstract":"In the contemporary digitalisation and robotics world, industries are facing what is known as the Industrial Revolution 4.0 (IR4.0). The belief by most experts is that some professions will be replaced by emerging technologies. As such, the education sector is affected as only qualified, highly skilled and educated employees are required. IR4.0 technologies have created new jobs in meeting the needs of the existing market, as such more services and unique products will be introduced. Therefore, this study identifies the technical competency needed by industries towards future industrial revolution for TVET graduates. This study uses qualitative method and has implemented survey method of distributing a set of questionnaires to selected respondents. The study also employs the use of structured interview session with two TVET experts in order to support the findings. Purposive sampling was used to select the respondent, where the respondents comprised students and lecturers from Malaysian premier polytechnics, such as Ibrahim Sultan Polytechnic, Sultan Salahuddin Abdul Aziz Shah Polytechnic and Ungku Omar Polytechnic. However, only 197 final year students and 89 lecturers from bachelor’s degree level from four programs (civil engineering department, electric and electronic engineering department and mechanical engineering department as well as the design and visual communication department) were chosen. Analysis of interview session from the experts indicated that three critical technical skill themes are needed for IR4.0: analysing, interpreting and documenting data; understanding and optimising process; and, executing, troubleshooting and maintaining of devices. Findings from the survey concluded that the respondents’ level of knowledge and skills to most of the technical competency is still at the average level and requires a lot of improvement. This implies that new technical knowledge should be embedded in the new curriculum on technology for their future knowledge, in order to fit with the need of changes in technology.","authors":["Asnidatul Adilah Ismail","Razali Hassan"],"meta":["September 2019Journal of Technical Education and Training 11(3)","DOI:10.30880/jtet.2019.11.03.008","Project: Competencies"],"references":["311879968_Industry_40_-_An_Introduction_in_the_phenomenon","311526417_Industrial_engineering_curriculum_in_Industry_40_in_a_South_African_context","322585764_Education_40_for_tall_thin_engineer_in_a_data_driven_society","322171276_Proceedings_of_the_International_Conference_on_Advanced_Intelligent_Systems_and_Informatics_2017","321801741_The_Collaborative_Instructional_Design_System_CIDS_Visualizing_the_21st_Century_Learning","320750644_Labor_market_risks_of_industry_40_digitization_robots_and_AI","320352655_Cloud_computing_in_manufacturing_The_next_industrial_revolution_in_Malaysia","319382395_Jobs_and_Skills_in_Industry_40_An_Exploratory_Research","304293566_Industry_40_Towards_future_industrial_opportunities_and_challenges","272774926_The_Development_of_Human_Resource_Practitioner_Competency_Model_Perceived_by_Malaysian_Human_Resource_Practitioners_and_Consultants_A_Structural_Equation_Modeling_SEM_Approach"]}