{"id":"337059272_Building_Collaboration_and_Securing_Interest_in_Computer_Science_Education_through_Outreach_Opportunities","abstract":"Automation and mechanization require students to master the utilization and creation of new technology. Vital for potential careers, tomorrow's professionals require technological understanding to remain competitive in a job market driven by engineering advances. Regardless, most K-12 schools in the US and other countries do not currently other Computer Science courses. To address these issues, multiple week-long summer outreach camps were designed for K-12 students and teachers.These camps delivered programming foundations in JavaScript and Python programming using online editors with both traditional and block-style programming options. Additionally, the camps utilized BBC Micro:Bits, pocket-sized computers fit with numerous functionalities. During interactive labs, participants collaborated with experts to develop various programs focused on topics such as password cracking, secure wireless communication, hardware hacking, securing Internet of Things devices, robotics, data collection, algorithm design, automation, decomposition, and pattern recognition. In addition to the explorative labs, students and teachers also worked with camp instructors in daily work sessions, using modified peer-instruction methods, to identify and analyze key Cybersecurity concepts such as modularization, simplicity, minimization, domain separation, least privilege, information hiding, layering, process isolation, resource encapsulation, and abstraction. The camp culminated with student demonstrations for their friends, family, and instructors.","authors":["Shaya Wolf","Fiona Moss","Rasana Manandhar","Madison Cooley"],"meta":["June 2019","DOI:10.18260/1-2--32484","Conference: 2019 ASEE Annual Conference & ExpositionAt: Tampa, Florida","Projects: Education and OutreachCybersecurity & CS Education And Research"],"references":["327209007_Making_sense_of_STEM_education_in_K-12_contexts","326876463_Peer_Instruction_Teaching_Methodology_for_Cybersecurity_Education","325406712_Do_outreach_activities_in_secondary_STEM_education_motivate_students_and_improve_their_attitudes_towards_STEM","309282176_Understanding_student_retention_in_computer_science_education_The_role_of_environment_gains_barriers_and_usefulness","323193689_Computer_Science_Education_in_2018","322346236_STEM_outreach_activities_an_approach_to_teachers'_professional_development","261854838_How_we_teach_impacts_student_learning_Peer_instruction_vs_lecture_in_CS0","260979884_Peer_instruction_in_computer_science_at_small_liberal_arts_colleges","221537371_Experience_report_Peer_instruction_in_introductory_computing"]}