{"id":"337002460_Domain_independent_redundancy_elimination_based_on_flow_vectors_for_static_video_summarization","abstract":"Video summarization aims to find a compact representation of input videos. The method finds out interesting parts of the video by discarding the remaining parts of the video. The abstracts thus generated enhances browsing and retrieval of video data. The quality of summaries generated by video summarization algorithms can be improved if the redundant frames in the input video are taken care of before summarization. This paper presents a novel domain-independent method for redundancy elimination from input videos before summarization maintaining keyframes in the original video. The frames of input video are first presampled by selecting two frames in one second. The flow vectors between consecutive frames are computed using SIFT Flow algorithm. The magnitude of flow vectors at each pixel position of the frame are summed up to find the displacement magnitude between the consecutive frames. The redundant frames are filtered out based on local averaging of the displacement values. The evaluation of the method is done using two standard datasets namely VSUMM and OVP. The results demonstrate that an average reduction rate of 97.64% is achieved consistently on videos of all categories. The method also gives superior results compared to other state-of-the-art redundancy elimination methods for video summarization.","authors":["Jesna Mohan","Madhu S. Nair"],"meta":["October 2019Heliyon 5(10):e02699","DOI:10.1016/j.heliyon.2019.e02699"],"references":["330295707_Video_Summarization_via_Nonlinear_Sparse_Dictionary_Selection","323191455_Edited_Nearest_Neighbour_for_Selecting_Keyframe_Summaries_of_Egocentric_Videos","319390300_Video_abstraction_using_density-based_clustering_algorithm","319003279_Unsupervised_Video_Summarization_with_Adversarial_LSTM_Networks","312097001_VISCOM_A_robust_video_summarization_approach_using_color_co-occurrence_matrices","309581961_Retrospective_analysis_of_time_series_for_frame_selection_in_surveillance_video_summarization","308870707_Perceptual_synoptic_view-based_video_retrieval_using_metadata","324732211_Salient_Object_Detection_via_a_Local_and_Global_Method_based_on_Deep_Residual_Network","316116872_SIFT_flow_for_abrupt_motion_tracking_via_adaptive_samples_selection_with_sparse_representation","311444569_Memorable_and_Rich_Video_Summarization"]}