{"id":"337023745_An_empirical_study_of_the_effect_that_a_computer_graphics_course_has_on_visual-spatial_abilities","abstract":"Visual-spatial abilities are relevant for performing diverse everyday tasks as well as being successful in multiple fields. This work provides empirical evidence supporting the claim that studying a computer graphics course, as commonly offered in computer science or engineering programs, can help develop stronger visual-spatial abilities. This benefit was estimated with the assessment of students’ performances in a standardized test of visual-spatial abilities. This empirical pre-test/post-test study ran for three consecutive semesters and involved six computer graphics groups where students were evaluated with the Purdue Spatial Visualization Test to measure whether the full-semester working on contents heavily related to 2D/3D geometric transformations had a positive effect on students’ visual-spatial intelligence. Results show a statistically significant increase in the average score in the test, which in turn suggests that these cognitive abilities could be reinforced or trained through the normal course workload. Additional findings in this study suggest that a retest gaining factor is present just by taking the test twice, and that there is a weak correlation between students’ level of visual-spatial abilities at the beginning of the course and the final grades obtained at the end of the semester.","authors":["José Saúl González Campos","Jordi Sánchez-Navarro","Joan Arnedo-Moreno"],"meta":["November 2019","DOI:10.1186/s41239-019-0169-7"],"references":["344528124_Testing_Instruments_For_The_Assessment_Of_3_D_Spatial_Skills","319467497_The_effects_of_computer-aided_design_software_on_engineering_students'_spatial_visualisation_skills","326595427_LA_CAPACIDAD_ESPACIAL_Y_SU_RELACION_CON_LA_INGENIERIA","324382656_Frames_of_Mind_The_Theory_of_Multiple_Intelligences","316858624_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","305790210_Improvements_in_student_Spatial_Visualization_in_an_introductory_engineering_graphics_course_using_open-ended_design_projects_supported_by_3D_printed_manipulatives","289963543_Multiple-factor_analysis_A_development_and_expansion_of_The_Vectors_of_Mind","289963247_Multiple-factor_analysis_A_development_and_expansion_of_The_Vectors_of_Mind","289963201_Human_cognitive_abilities_A_survey_of_factor-analytic_studies","288438032_Assessment_of_a_new_and_improved_course_for_the_development_of_3-D_spatial_skills"]}