{"id":"337051363_Potentials_of_Mobile_Technologies_in_Enhancing_the_Effectiveness_of_Inquiry-based_Learning_Approach","abstract":"The quality of teaching technique employed by the teacher basically influence student's interest and learning outcome. In recent times, it has become obvious that the conventional learning pattern can no longer meet the need of digital millennials nor prepare them for the future. This has necessitated the transition from traditional (teacher-centred) approach to inquiry-based (student-centred) approach in order to improve students' skills and enhance productivity in learning. The present study critically examines the potentials of mobile technologies in enhancing the effectiveness of inquiry-based learning approach. The findings show that mobile technologies have the potential to enhance the success of inquiry-based learning method. Indeed, the inquiry process can be more effective if the \"Inquirers\" can maximize the potential benefits offered by mobile technologies. The study indicates that many students are closely attached to their mobile gadgets such as smartphones, tablets, notebooks and other PDAs, and can easily manipulate it for inquiries, discoveries and innovations. Also, mobile devices often come with fascinating features, apps and functions that motivate learners to connect to the internet, think critically, and to actively engage in authentic and creative learning inquiries, collaborations and discussions. With the aid of mobile devices, students can conduct inquiries (ask questions) via phone calls; text messaging, chat, and e-mails both within and outside the classroom. From the study, it can be inferred that, the use of mobile devices enhance inquiry-based learning; promotes student's inquiry and entrepreneurial spirit, and positive attitude towards learning. Also, mobile devices can inspire students to learn more comprehensively and effectively, thereby increasing their proficiencies, and preparation for changes; challenges, and a knowledge-based society. Thus, the study concludes that the effectiveness of inquiry-based learning approach in the 21 st century can largely be enhanced by mobile technologies.","authors":["Edeh Michael Onyema","Udeze Ogechukwu Anthonia","Edeh Chinecherem Deborah"],"meta":["October 2019","DOI:10.5121/IJE.2019.1421","Projects: ALL RESEARCHERS WELCOME GLOBAL PLATFORMJournal Article"],"references":["335698140_Opportunities_and_challenges_of_the_use_of_mobile_phone_technology_in_teaching_and_learning_in_Nigeria-_A_Review","321075257_A_review_of_the_types_of_mobile_activities_in_mobile_inquiry-based_learning_Open_Access","320394362_Inquiry-based_learning_environment_using_mobile_devices_in_math_classroom","300088841_Future_Scenarios_for_Mobile_Science_Learning","284563842_The_Effects_of_Integrating_Mobile_Devices_with_Teaching_and_Learning_on_Students'_Learning_Performance_A_Meta-Analysis_and_Research_Synthesis","279293930_The_definition_of_the_term_Inquiry-based_instruction","272946536_Phases_of_inquiry-based_learning_Definitions_and_the_inquiry_cycle","272786501_IMPLEMENTATION_OF_INQUIRY-BASED_SCIENCE_EDUCATION_IN_SCIENCE_TEACHER_TRAINING","293193229_Meta-Analysis_of_Inquiry-Based_Learning_Effects_of_Guidance","270585193_Visible_Learning_A_Synthesis_of_Over_800_Meta-Analyses_Relating_to_Achievement"]}