{"id":"337087339_Spationomy_Simulation_Game","abstract":"The last part of the book is dedicated to the simulation game framework. What is meant by the simulation game within the Spationomy project will be described in the following Sect. 16.1. Conceptual thoughts, as well as the motivation and goals of the Spationomy simulation game, will be briefly introduced as well. Also, the overall theoretical framing about educational aspects of simulation games (or gamification in general) with a focus on geography or economy will be provided with the first section. After this introductory chapter, each of the Spationomy simulation game rounds will be described in detail and also original instructions assigned to the students will be presented (Sect. 16.2). The reason for this chapter is to give a chance to the reader to use, extend and employ these materials in his/her teaching activity. The last two chapters are devoted to feedback and evaluation of the simulation game. Section 16.3 is about teacher/project staff experiences during the creation of simulation game, playing the game itself, modifying it during its evolution and also about “what worked and what did not”. In the same section (Sect. 16.3), we will provide the reader with students’ feedback and evaluation. Students’ authentic commentaries and suggestion are essential for further improvements of the game, and their insights also prove that the whole idea of making spatial economy playful is highly appreciated and fruitful. The main goal of Part IV of the book is to allow anyone to adopt and replicate the simulation game framework in the learning and teaching process.","authors":["Vít Pászto","Jiri Panek"],"meta":["January 2020","DOI:10.1007/978-3-030-26626-4_16","In book: Spationomy (pp.305-325)","Project: SPATIONOMY"],"references":["301232882_Mining_Learning_and_Crafting_Scientific_Experiments_A_Literature_Review_on_the_Use_of_Minecraft_in_Education_and_Research","260275454_Digital_Serious_Game_for_Urban_Planning_B3-Design_Your_Marketplace","331959012_Mapping_Game_Mechanics_for_Learning_in_a_Serious_Game_for_the_Energy_Transition_International_Journal_of_E-Planning_Research","312442180_Using_Minecraft_to_Encourage_Critical_Engagement_of_Geography_Concepts","282208632_The_Pedagogical_Benefits_of_SimCity_in_Urban_Geography_Education","273947408_Understanding_Video_Games_The_Essential_Introduction","273947296_The_Art_of_Computer_Game_Design","248969929_The_Use_of_Four_Selected_Games_in_a_Tertiary_Geography_Programme","248969926_To_Play_or_Not_to_Play_An_introduction_to_games_and_simulations_in_geography_teaching","248913054_Simulation_and_Gaming_as_a_Teaching_Method"]}