{"id":"337097978_POSTER_Detecting_Audio_Adversarial_Example_through_Audio_Modification","abstract":"Deep neural networks (DNNs) perform well in the fields of image recognition, speech recognition, pattern analysis, and intrusion detection. However, DNNs are vulnerable to adversarial examples that add a small amount of noise to the original samples. These adversarial examples have mainly been studied in the field of images, but their effect on the audio field is currently of great interest. For example, adding small distortion that is difficult to identify by humans to the original sample can create audio adversarial examples that allow humans to hear without errors, but only to misunderstand the machine. Therefore, a defense method against audio adversarial examples is needed because it is a threat in this audio field. In this paper, we propose a method to detect audio adversarial examples. The key point of this method is to add a new low level distortion using audio modification, so that the classification result of the adversarial example changes sensitively. On the other hand, the original sample has little change in the classification result for low level distortion. Using this feature, we propose a method to detect audio adversarial examples. To verify the proposed method, we used the Mozilla Common Voice dataset and the DeepSpeech model as the target model. Based on the experimental results, it was found that the accuracy of the adversarial example decreased to 6.21% at approximately 12 dB. It can detect the audio adversarial example compared to the initial audio sample.","authors":["Hyun Kwon","Hyunsoo Yoon","Ki-Woong Park"],"meta":["November 2019","DOI:10.1145/3319535.3363246","Conference: Proceedings of the 26th ACM Conference on Computer and Communications Security (CCS'19)"],"references":["319415640_DolphinAtack_Inaudible_Voice_Commands","303657108_TensorFlow_A_system_for_large-scale_machine_learning","259440613_Intriguing_properties_of_neural_networks","2552483_Mel_Frequency_Cepstral_Coefficients_for_Music_Modeling","334070470_Selective_Audio_Adversarial_Example_in_Evasion_Attack_on_Speech_Recognition_System","328795986_Audio_Signal_Enhancement","326854294_Audio_Adversarial_Examples_Targeted_Attacks_on_Speech-to-Text","322328868_Audio_Adversarial_Examples_Targeted_Attacks_on_Speech-to-Text","308499836_High_accuracy_inertial_stabilization_via_Kalman_filter_based_disturbance_observer","269935079_Adam_A_Method_for_Stochastic_Optimization","269722411_DeepSpeech_Scaling_up_end-to-end_speech_recognition","262030045_Deep_Learning_in_Neural_Networks_An_Overview"]}