{"id":"337068526_Public_value_creation_in_digital_government","abstract":"Public value theory offers innovative ways to plan, design, and implement digital government initiatives. The theory has gained the attention of researchers due to its powerful proposition that shifts the focus of public sector management from internal efficiency to value creation processes that occur outside the organization. While public value creation has become the expectation that digital government initiatives have to fulfil, there is lack of theoretical clarity on what public value means and on how digital technologies can contribute to its creation. The special issue presents a collection of six papers that provide new insights on how digital technologies support public value creation. Building on their contributions, the editorial note conceptualizes the realm of public value creation by highlighting: (1) the integrated nature of public value creation supported by digital government implementations rather than enhancing the values provided by individual technologies or innovations, (2) how the outcome of public value creation is reflected in the combined consumption of the various services enabled by technologies and (3) how public value creation is enabled by organizational capabilities and configurations.","authors":["Panos Panagiotopoulos","Bram Klievink","Antonio Cordella"],"meta":["November 2019Government Information Quarterly 36(4):101421","DOI:10.1016/j.giq.2019.101421"],"references":["335021507_Digital_service_teams_in_government","331092224_The_public_value_of_E-Government_-_A_literature_review","330889167_Value_Creation_and_Value_Appropriation_in_Public_and_Non-Profit_Organizations","329760387_Mission-oriented_innovation_policy_and_dynamic_capabilities_in_the_public_sector","328414178_Rationality_and_politics_of_algorithms_Will_the_promise_of_big_data_survive_the_dynamics_of_public_decision_making","326063291_Stakeholder_theory_for_the_E_-government_context_Framing_a_value-oriented_normative_core","325304512_ICTs_and_value_creation_in_public_sector_Manufacturing_logic_vs_service_logic","325003653_The_Architecture_of_Dynamic_Capability_Research_Identifying_the_Building_Blocks_of_a_Configurational_Approach","332125555_IoT_and_AI_for_Smart_Government_A_Research_Agenda","325074235_Agile_government_Systematic_literature_review_and_future_research"]}