{"id":"337007068_The_journey_of_learning","abstract":"The Odyssey is one of the highest products of human creation of all times. In the book Mythos and Voice, Charles Underwood presents an innovative perspective on this work of art, discussing the development of the main characters by the light of psychological and anthropological theories. Then, he discusses the dialogical theories of ontogenetic development using the characters of Odyssey as specimen. I finally suggest that the Underwood's insights about the characters of Odyssey can provide fruitful hints for the understanding of the identity enactment in contemporary societies, by revisiting the positioning process and the dialogical construction of identity. As one of the peaks of human creation of all time, Homer's Odyssey is a particularly valuable object of study for psychology. In his book Mythos and Voice, Charles Underwood presents an innovative perspective about and through this work of art. Underwood discusses the development of the main characters along the course of the epic poem in the context of psychological and anthropological theories. He discusses dialogical theories of ontogenetic development using the Odyssey as an example. I find this endeavor extremely stimulating for the theoretical and epistemological debate in psychology. Therefore, I do not limit myself to a traditional review to praise and discuss Underwood's book. I would rather use it as an opportunity to stress what I consider relevant issues for contemporary cultural psychology, for instance: the use of literature (as well as any other product of human activity) as an object of investigation in psychology; the developmental nature of all human psychic phenomena; and the development of the Self in the contemporary era of popularity-based social media.","authors":["Luca Tateo"],"meta":["November 2019Mind Culture and Activity 26(4)","DOI:10.1080/10749039.2019.1686028"],"references":["334097999_A_New_Methodology_for_the_Study_of_Mind-Wandering_Process","324875182_A_Different_Take_on_the_Liminal_Process_of_Veterans_Reintegration_in_Cultural_Psychology","271593086_Gulliver's_Eggs_Why_Methods_are_not_an_Issue_of_Qualitative_Research_in_Cultural_Psychology","228488245_Who_am_I_Narration_and_its_contribution_to_self_and_identity","331758263_Phrasikleia_An_Anthropology_of_Reading_in_Ancient_Greece","331272430_Educational_Dilemmas_A_Cultural_Psychological_Perspective","330694385_Introduction_A_Cultural_Psychological_Perspective","329901875_Two_diverging_paths_toward_a_common_destination_The_dialogism_of_Vygotsky_and_Bakhtin","328791528_Mythos_and_Voice_Displacement_Learning_and_Agency_in_Odysseus'_World","328659279_Imaginative_Processes_and_Culture_Some_Philosophical_Reflections_from_Cultural_Psychology_Aesthetics_and_the_Art_of_Psychology","324178653_Problems_of_Dostoevsky's_Poetics","317375056_The_role_of_responsiveness_within_the_self_in_transitions_to_university","260712948_Fields_of_Combat_Understanding_PTSD_among_Veterans_of_Iraq_and_Afghanistan","247887119_The_Concept_of_Age-Specific_New_Psychological_Formations_in_Contemporary_Developmental_Psychology","243775397_The_collected_works_of_L","200026920_Mind_Self_Society","36190369_Learning_by_Expanding_An_Activity-Theoretical_Approach_to_Developmental_Research"]}