{"id":"337015486_Learning_Phase_Competition_for_Traffic_Signal_Control","abstract":"Increasingly available city data and advanced learning techniques have empowered people to improve the efficiency of our city functions. Among them, improving urban transportation efficiency is one of the most prominent topics. Recent studies have proposed to use reinforcement learning (RL) for traffic signal control. Different from traditional transportation approaches which rely heavily on prior knowledge, RL can learn directly from the feedback. However, without a careful model design, existing RL methods typically take a long time to converge and the learned models may fail to adapt to new scenarios. For example, a model trained well for morning traffic may not work for the afternoon traffic because the traffic flow could be reversed, resulting in very different state representation. In this paper, we propose a novel design called FRAP, which is based on the intuitive principle of phase competition in traffic signal control: when two traffic signals conflict, priority should be given to one with larger traffic movement (i.e., higher demand). Through the phase competition modeling, our model achieves invariance to symmetrical cases such as flipping and rotation in traffic flow. By conducting comprehensive experiments, we demonstrate that our model finds better solutions than existing RL methods in the complicated all-phase selection problem, converges much faster during training, and achieves superior generalizability for different road structures and traffic conditions.","authors":["Guanjie Zheng","Yuanhao Xiong","Xinshi Zang","Jie Feng"],"meta":["November 2019","DOI:10.1145/3357384.3357900","Conference: the 28th ACM International Conference"],"references":["337017491_CoLight_Learning_Network-level_Cooperation_for_Traffic_Signal_Control","331198452_Multi-Agent_Deep_Reinforcement_Learning_for_Large-Scale_Traffic_Signal_Control","326504263_IntelliLight_A_Reinforcement_Learning_Approach_for_Intelligent_Traffic_Light_Control","316598817_Traffic_Light_Control_Using_Deep_Policy-Gradient_and_Value-Function_Based_Reinforcement_Learning","333067562_CityFlow_A_Multi-Agent_Reinforcement_Learning_Environment_for_Large_Scale_City_Traffic_Scenario","332198149_Targeted_Knowledge_Transfer_for_Learning_Traffic_Signal_Plans","324104685_Deep_Reinforcement_Learning_for_Traffic_Light_Control_in_Vehicular_Networks","323550003_Distributed_Prioritized_Experience_Replay","322609193_Developing_adaptive_traffic_signal_control_by_actor-critic_and_direct_exploration_methods","321098959_Adaptive_traffic_signal_control_with_actor-critic_methods_in_a_real-world_traffic_network_with_different_traffic_disruption_events"]}