{"id":"337007305_eSTIMe_Towards_an_All-in-One_Geovisualization_Environment_for_Daily_Mobility_Analysis","abstract":"Daily mobility data describes individual displacements over 24-hours periods and are an important source of information to understand the real rhythm of a city, to provide appropriate transportation policies, and to support investment decisions. Geovisualization researchers have designed multiple coordinated views environments, combining spatial and temporal dimensions, and providing indicators comparison. Daily mobility analysis is complex and requires simultaneous exploration and combination of different indicators at different spatial and temporal granularity levels. The design of effective geovisualization environments supporting this analysis evokes several challenges due to the diversity and multiplicity of indicators, the granularity of space and time, and time integration. In this paper, we propose a geovisualization approach enabling the dynamic visualization of diverse indicators, as well as the exploration of space, time, and other attributes. We use multiple screens embedding customizable dashboards and allowing the users to arrange views and compare indicators as it better fits their analysis. It also integrates a mobile device serving as a display and interaction tool to physically control the evolution of the visualization on time.","authors":["Aline Menin","Sonia Chardonnel","Luciana Nedel","Paule-Annick Davoine"],"meta":["October 2019","DOI:10.1109/SIBGRAPI.2019.00014","Conference: Conference on Graphics, Patterns and Images (SIBGRAPI)At: Rio de Janeiro, Brazil","Project: Visualization of Daily Mobility Data"],"references":["324435738_Mobiles_as_Portals_for_Interacting_with_Virtual_Data_Visualizations","317420405_Urban_Mobility_Indexes_A_Brief_Review_of_the_Literature","327128382_Multiple_Coordinated_Views_at_Large_Displays_for_Multiple_Users_Empirical_Findings_on_User_Behavior_Movements_and_Distances","323105171_Visual_analytics_of_bike-sharing_data_based_on_tensor_factorization","320658167_PeopleVis_A_visual_analysis_system_for_mining_travel_behavior","318418686_UrbanFACET_Visually_Profiling_Cities_from_Mobile_Device_Recorded_Movement_Data_of_Millions_of_City_Residents","318202257_GraSp_Combining_Spatially-aware_Mobile_Devices_and_a_Display_Wall_for_Graph_Visualization_and_Interaction","315985499_The_visual_analysis_of_flow_pattern_for_public_bicycle_system","314984241_MobiSeg_Interactive_Region_Segmentation_Using_Heterogeneous_Mobility_Data","313800384_Social_segregation_around_the_clock_in_the_Paris_region_France"]}