{"id":"337021931_Learning_Disentangled_Representations_for_Recommendation","abstract":"User behavior data in recommender systems are driven by the complex interactions of many latent factors behind the users' decision making processes. The factors are highly entangled, and may range from high-level ones that govern user intentions, to low-level ones that characterize a user's preference when executing an intention. Learning representations that uncover and disentangle these latent factors can bring enhanced robustness, interpretability, and controllability. However, learning such disentangled representations from user behavior is challenging, and remains largely neglected by the existing literature. In this paper, we present the MACRo-mIcro Disentangled Variational Auto-Encoder (MacridVAE) for learning disentangled representations from user behavior. Our approach achieves macro disentanglement by inferring the high-level concepts associated with user intentions (e.g., to buy a shirt or a cellphone), while capturing the preference of a user regarding the different concepts separately. A micro-disentanglement regularizer, stemming from an information-theoretic interpretation of VAEs, then forces each dimension of the representations to independently reflect an isolated low-level factor (e.g., the size or the color of a shirt). Empirical results show that our approach can achieve substantial improvement over the state-of-the-art baselines. We further demonstrate that the learned representations are interpretable and controllable, which can potentially lead to a new paradigm for recommendation where users are given fine-grained control over targeted aspects of the recommendation lists.","authors":["Jianxin Ma","Chang Zhou","Peng Cui","Hongxia Yang"],"meta":["November 2019","Conference: NeurIPS"],"references":["329743464_Disentangled_Person_Image_Generation","324167090_Learning_Disentangled_Joint_Continuous_and_Discrete_Representations","321160607_ATRank_An_Attention-Based_User_Behavior_Modeling_Framework_for_Recommendation","356084875_Visual_object_networks_Image_generation_with_disentangled_3D_representation","339440322_Hyperopt_A_Python_Library_for_Optimizing_the_Hyperparameters_of_Machine_Learning_Algorithms","326496688_Hierarchical_Taxonomy_Aware_Network_Embedding","325774459_Neural_scene_representation_and_rendering","324514515_Variational_Autoencoders_for_Collaborative_Filtering","323184550_Isolating_Sources_of_Disentanglement_in_Variational_Autoencoders","319770134_Stochastic_Backpropagation_and_Approximate_Inference_in_Deep_Generative_Models"]}