{"id":"337069071_Exploring_Large-scale_Public_Medical_Image_Datasets","abstract":"Rationale and objectives: \nMedical artificial intelligence systems are dependent on well characterized large-scale datasets. Recently released public datasets have been of great interest to the field, but pose specific challenges due to the disconnect they cause between data generation and data usage, potentially limiting the utility of these datasets.\n\nMaterials and methods: \nWe visually explore two large public datasets, to determine how accurate the provided labels are and whether other subtle problems exist. The ChestXray14 dataset contains 112,120 frontal chest films, and the Musculoskeletal Radiology (MURA) dataset contains 40,561 upper limb radiographs. A subset of around 700 images from both datasets was reviewed by a board-certified radiologist, and the quality of the original labels was determined.\n\nResults: \nThe ChestXray14 labels did not accurately reflect the visual content of the images, with positive predictive values mostly between 10% and 30% lower than the values presented in the original documentation. There were other significant problems, with examples of hidden stratification and label disambiguation failure. The MURA labels were more accurate, but the original normal/abnormal labels were inaccurate for the subset of cases with degenerative joint disease, with a sensitivity of 60% and a specificity of 82%.\n\nConclusion: \nVisual inspection of images is a necessary component of understanding large image datasets. We recommend that teams producing public datasets should perform this important quality control procedure and include a thorough description of their findings, along with an explanation of the data generating procedures and labeling rules, in the documentation for their datasets.","authors":["Luke Oakden-Rayner"],"meta":["November 2019Academic Radiology 27(1)","DOI:10.1016/j.acra.2019.10.006"],"references":["318337409_Revisiting_Unreasonable_Effectiveness_of_Data_in_Deep_Learning_Era","316736470_ChestX-ray8_Hospital-scale_Chest_X-ray_Database_and_Benchmarks_on_Weakly-Supervised_Classification_and_Localization_of_Common_Thorax_Diseases","279731140_Preparing_a_collection_of_radiology_examinations_for_distribution_and_retrieval","329227722_The_RSNA_Pediatric_Bone_Age_Machine_Learning_Challenge","328241386_Deep_learning_algorithms_for_detection_of_critical_findings_in_head_CT_scans_a_retrospective_study"]}