{"id":"337070481_How_to_Explain_Behavior","abstract":"Unlike behaviorism, cognitive psychology relies on mental concepts to explain behavior. Yet mental processes are not directly observable and multiple explanations are possible, which poses a challenge for finding a useful framework. In this article, I distinguish three new frameworks for explanations that emerged after the cognitive revolution. The first is called tools‐to‐theories: Psychologists' new tools for data analysis, such as computers and statistics, are turned into theories of mind. The second proposes as‐if theories: Expected utility theory and Bayesian statistics are turned into theories of mind, describing an optimal solution of a problem but not its psychological process. The third studies the adaptive toolbox (formal models of heuristics) that describes mental processes in situations of uncertainty where an optimal solution is unknown. Depending on which framework researchers choose, they will model behavior in either situations of risk or of uncertainty, and construct models of cognitive processes or not. The frameworks also determine what questions are asked and what kind of data are generated. What all three frameworks have in common, however, is a clear preference for formal models rather than explanations by general dichotomies or mere verbal concepts. The frameworks have considerable potential to inform each other and to generate points of integration.","authors":["Gerd Gigerenzer"],"meta":["November 2019Topics in Cognitive Science 12(1)","DOI:10.1111/tops.12480"],"references":["323141369_Being_Realist_about_Bayes_and_the_Predictive_Processing_Theory_of_Mind","344485006_The_Adaptive_Decision_Maker","329958319_The_heuristics_revolution_rethinking_the_role_of_uncertainty_in_finance","324392204_The_Foundations_of_Statistics","324303558_Essays_in_Positive_Economics","324054557_Motivation_and_Action","321525379_Motivation_and_Action","320794799_The_Cheap_Twin_From_the_Ecological_Rationality_of_Heuristic_Pricing_to_the_Aggregate_Market","319393294_Logic_of_Scientific_Discovery","318082657_A_theory_integration_program"]}