{"id":"337139193_Le_formateur_et_son_public_dans_le_cadre_de_l'elaboration_d'une_simulation_de_type_wargame_sur_plateau","abstract":"Le wargame est un outil de réflexion qui emploie des techniques créatives pour stimuler l’imagination des historiens, des décideurs et des analystes dans un but d’identification d’opportunités et de menaces. Son objet est de permettre à ses joueurs de recréer des situations spécifiques et, plus important encore, d’être capable d’explorer ce qui aurait pu (approche historique) ou pourrait (approche prospective) se passer si le joueur décidait de faire les choses différemment.\nIssu d’une tradition assez longue de tentatives d’adaptation du jeu d’échecs à la simulation de bataille, le wargame s’applique depuis plus de deux siècles à la modélisation d’affrontements militaires à des fins de formation et d’élaboration de nouvelles stratégies ou tactiques. Par la suite, son champ d’application s’est étendu, il y a un peu plus d’un siècle, à la réflexion historico-militaire et depuis une soixantaine d’années à l’aide à la décision stratégique concernant des affrontements concurrentiels et économiques. Selon les moyens disponibles et les contextes de leurs mises en œuvre, les wargames prennent désormais quatre formes différentes : jeux de rôles de type grandeur nature, simulations informatiques, modélisation à base de figurines (ou sandbox ) et modélisation sur des cartes ou plateaux.\nNous nous intéresserons, dans le cadre de ce travail, spécifiquement aux cas des wargames sur cartes et plateaux ( board wargames ). Nous les aborderons d’abord en tant que moyen de compréhension d’une situation historique et militaire, puis en tant que transposition à des fins d’analyse stratégique concurrentielle. Nous commencerons par en décrire les contours historiques et fondamentaux pratiques. Puis, nous montrerons comment le formateur peut adapter ou concevoir le “jeu” selon la situation qu’il doit modéliser ainsi qu’au public auquel il est destiné. Nous discuterons ainsi de la conception d’un wargame en fonction des objectifs visés, du développement du prototype et de la phase de tests en tant que première confrontation au public ciblé par le formateur. Nous présenterons aussi comment, la modélisation d’un wargame est transposable à la modélisation d’un marché. Au-delà de l’aspect ludique et des objectifs du jeu, nous montrerons comment les participants peuvent prendre part à sa conception. De cette manière, nous aborderons la réflexion autour de la conception du jeu qui, bien menée, permet d’appréhender dans son entier un environnement concurrentiel et ses acteurs et d’en comprendre tous ses mécanismes et ses enjeux.","authors":["Stéphane Goria","Philippe Hardy"],"meta":["October 2019Board Game Studies Journal 13(1):21-65","DOI:10.2478/bgs-2019-0003"],"references":["282484237_Fablab_et_DIY_de_nouvelles_voies_pour_l'enseignement_de_l'electronique","276083375_La_question_du_public_et_de_la_nature_de_l'emploi_du_jeu_a_des_fins_serieuses_Une_reflexion_developpee_dans_un_cadre_d'enseignement","273996083_Wargames_et_strategies_de_communication","273693305_Origins_of_Serious_Games","329122629_The_Game_as_a_Talking_Tool_Using_a_Board_Game_for_Creative_Consultation_Engagement_and_Inclusion_Creativity_Engagement_and_the_Student_Experience","315811564_Business_Wargaming","305325484_L'emploi_des_cartes_cognitives_pour_la_formation_a_la_maitrise_de_l'information","283301461_Business_Wargaming_Securing_Corporate_Value","273947290_Simulating_War_Studying_Conflict_Through_Simulation_Games","273946604_War_Games_A_History_of_War_on_Paper","252500806_Collaborative_games_Lessons_learned_from_board_games","201381807_Business_Simulation_Games_Current_Usage_Levels--An_Update","26883425_First-Person_Shooter_Games_as_a_Way_of_Connecting_to_People_Brothers_in_Blood","259532895_The_Art_of_Game_Design_A_book_of_lenses","227447760_The_Role_of_Management_Games_in_Education_and_Research"]}