{"id":"337193659_Giochiamo_con_i_numeri_binari_Pensiero_Computazionale_e_Astrazione_alla_scuola_primaria","abstract":"Riassunto. Dopo un'introduzione e definizione pensiero computazionale e dell'importanza che sta assumendo nel mondo della scuola, andiamo a presentare l'esplicitazione di un suo modello di valutazione, che tiene in considerazione le varie dimensioni, focalizzando qui la nostra attenzione sulla capacità di astrazione. Un'attività didattica di introduzione al codice e ai numeri binari ci permette di valutare delle prime evidenze di astrazione nei bambini della scuola primaria, oltre a sviluppare alcune interessanti dinamiche di calcolo mentale. 1. Introduzione e contesto Secondo la definizione operativa proposta dalla International Society for Technology in Education e dalla Computer Science Teacher Association degli Stati Uniti, il pensiero computazionale è un pro-cesso di problem solving che include (ma non è limitato a) le seguenti caratteristiche: formulazione di problemi per permettere l'utilizzo di un computer e altri strumenti per aiutare la loro soluzione; organizzazione logica e analisi dei dati; rappresentazione dei dati attraverso astrazioni come modelli o simulazioni; automatizzazione delle soluzioni utilizzando il pensiero algoritmico (una serie di passi ordinati); identificazione, analisi e implementazione di soluzioni possibili, con l'obiettivo di ottenere la migliore e più efficiente combinazione di passi risolutivi e risorse; generalizzazione e trasferimento del processo di risoluzione del problema ad una varietà di altri problemi. La capacità di astrazione completa e di pensiero astratto come opposto agli schemi mentali, è considerata in let-teratura propria dei bambini oltre gli 11 o 12 anni di età (Jean Piaget, come in Lister, 2011). Può qualche task stimolare la capacità di astrazione, almeno parziale, già nell'età della scuola primaria? In che modo possiamo valutarlo? 2. Modello di valutazione del pensiero computazionale Obiettivo di questo intervento è dunque quello di analizzare la dimensione del pensiero computa-zionale definita come astrazione, come nel modello di categorizzazione di Dagienė et al. (2017), ri-preso poi dagli autori con evidenze per ogni dimensione (Di Crisci, Gaio, 2019). L'astrazione è considerata una componente chiave per il pensiero computazionale: \"The abstraction process-deciding what details we need to highlight and what details we can ignore-underlies computational thinking\" (Wing, 2008, p. 3718). Nel modello, la dimensione dell'astrazione è ulteriormente divisa in 5 evidenze che ci possono permettere di analizzarla e valutarla: Analizzare i dati; Individuare la chiave del problema; Shifting; Updating; Inhibition. Come anticipato, alla scuola primaria, non tutte queste evidenze si presentano negli alunni. Andremo a vedere nell'esempio un semplice passaggio di astrazione tra carte numerate (simbolo) e quantità reale e come i bambini ci si possono avvicinare con l'uso di un semplice artefatto.","authors":["Aaron Gaio","Sofia di Crisci"],"meta":["October 2019Quaderni di Ricerca in Didattica 29(1)"],"references":["337193038_VERSO_UNA_VALUTAZIONE_INCLUSIVA_DEL_PENSIERO_COMPUTAZIONALE","324588165_Computational_Thinking_in_Primary_School_An_Examination_of_Abstraction_and_Decomposition_in_Different_Age_Groups","315831218_Developing_a_Two-Dimensional_Categorization_System_for_Educational_Tasks_in_Informatics","230846941_Concrete_and_Other_Neo-Piagetian_Forms_of_Reasoning_in_the_Novice_Programmer","350652020_Mental_Mathematics_for_the_Numeracy_Hour","261811639_Mental_Calculation_Strategies_for_Addition_and_Subtraction_Part_2"]}