{"id":"337193038_VERSO_UNA_VALUTAZIONE_INCLUSIVA_DEL_PENSIERO_COMPUTAZIONALE","abstract":"Riassunto Vista l'importanza sempre maggiore data al pensiero computazionale e al coding nell'insegnamento della matematica a tutti i livelli scolastici, emerge anche la necessità di trovare dei modelli di valutazione in questo ambito. L'articolo parte da una presentazione della situazione attuale, analizzando alcuni riferimenti bibliografici sul tema del pensiero computazionale e delle sue caratteristiche. Si passa poi ad illustrare un modello che consideri le diverse dimensioni di questa competenza, con le evidenze per ogni dimensione e relativi indicatori; vengono inoltre presentati gli item di alcune prove per valutare le competenze nel pensiero computazionale, modificati utilizzando il modello. Infine, si illustra come queste prove di valutazione possano essere adattate per essere proposte a studenti con BES, in modo da essere adeguate al loro stile cognitivo e richiedere l'attivazione di strategie proprie del pensiero computazionale calibrate alle loro capacità. Introduzione La didattica della matematica sta andando, negli ultimi anni, in una direzione che coinvolge sempre più competenze trasversali quali la capacità di argomentare, discutere e stimolare processi logici e creativi per la risoluzione di problemi. Anche le Indicazioni Nazionali, come poi ripreso e approfondito in Indicazioni Nazionali e Nuovi Scenari, tengono in grande considerazione questi aspetti, sottolineando l'importanza del pensiero matematico e del pensiero computazionale nel percorso formativo degli studenti. Tale pensiero è definito come \"un processo logico creativo che, più o meno consapevolmente, viene messo in atto nella vita quotidiana per affrontare e risolvere problemi. L'educazione ad agire consapevolmente tale strategia consente di apprendere ad affrontare le situazioni in modo analitico, scomponendole nei vari aspetti che le caratterizzano e pianificando per ognuno le soluzioni più idonee\". Inoltre, tra gli obiettivi indicati nelle Competenze Europee, troviamo: \"Skills, such as problem solving, critical thinking, ability to cooperate, creativity, computational thinking, self-regulation are more essential than ever before in our quickly changing society.\" Da questa indicazione la necessità di proporre curricularmente queste attività a scuola, di trovare loro un ruolo preminente nella didattica e di dare ai docenti un modo di osservare e valutare queste competenze. Grazie al lavoro di tanti enti, scuole, ricercatori e soprattutto docenti di ogni grado scolastico, le proposte didattiche per implementare il pensiero computazionale che si trovano a disposizione sono numerose. In letteratura, d'altra parte, il numero delle ricerche che si occupano della valutazione nell'ambito del pensiero computazionale, delle sue dimensioni e dei suoi costrutti, è ancora limitato. Da qui la necessità di raccogliere e organizzare informazioni sulla valutazione del pensiero computazionale e su come collegare le abilità dello stesso con le altre discipline di studio e ai percorsi trasversali presenti nella didattica, tenendo presente anche l'importanza di avere delle prassi di insegnamento e valutazione inclusive, che promuova l'apprendimento di tutti gli alunni coinvolti.","authors":["Sofia di Crisci","Aaron Gaio"],"meta":["March 2019","Conference: XXII Seminario Nazionale GrimedAt: Siena"],"references":["315831218_Developing_a_Two-Dimensional_Categorization_System_for_Educational_Tasks_in_Informatics","312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","309482825_Processi_di_generalizzazione_nell'insegnamento-apprendimento_dell'algebra","299450690_Computational_thinking_the_developing_definition","221437671_Bebras_International_Contest_on_Informatics_and_Computer_Literacy_Criteria_for_Good_Tasks","321148186_Promoting_Computational_Thinking_Skills_Would_You_Use_this_Bebras_Task","12374714_The_Unity_and_Diversity_of_Executive_Functions_and_Their_Contributions_to_Complex_Frontal_Lobe_Tasks_A_Latent_Variable_Analysis"]}