{"id":"337143575_On_Kernel_Method-Based_Connectionist_Models_and_Supervised_Deep_Learning_Without_Backpropagation","abstract":"We propose a novel family of connectionist models based on kernel machines and consider the problem of learning layer by layer a compositional hypothesis class (i.e., a feedforward, multilayer architecture) in a supervised setting. In terms of the models, we present a principled method to \"kernelize\" (partly or completely) any neural network (NN). With this method, we obtain a counterpart of any given NN that is powered by kernel machines instead of neurons. In terms of learning, when learning a feedforward deep architecture in a supervised setting, one needs to train all the components simultaneously using backpropagation (BP) since there are no explicit targets for the hidden layers (Rumelhart, Hinton, & Williams, 1986). We consider without loss of generality the two-layer case and present a general framework that explicitly characterizes a target for the hidden layer that is optimal for minimizing the objective function of the network. This characterization then makes possible a purely greedy training scheme that learns one layer at a time, starting from the input layer. We provide instantiations of the abstract framework under certain architectures and objective functions. Based on these instantiations, we present a layer-wise training algorithm for an \nl\n-layer feedforward network for classification, where \n\nl\n≥\n2\n\ncan be arbitrary. This algorithm can be given an intuitive geometric interpretation that makes the learning dynamics transparent. Empirical results are provided to complement our theory. We show that the kernelized networks, trained layer-wise, compare favorably with classical kernel machines as well as other connectionist models trained by BP. We also visualize the inner workings of the greedy kernelized models to validate our claim on the transparency of the layer-wise algorithm.","authors":["Shiyu Duan","Shujian Yu","Yunmei Chen","Jose C Principe"],"meta":["November 2019Neural Computation 32(1):1-39","DOI:10.1162/neco_a_01250"],"references":["317268722_Deep_Restricted_Kernel_Machines_Using_Conjugate_Feature_Duality","314611180_Difference_Target_Propagation","303137904_Greedy_layer-wise_training_of_deep_networks","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond","313100237_Kernel_methods_for_deep_learning","312538118_Support-vector_networks","309532479_Random_features_for_large_scale_kernel_machines","306218037_Learning_multiple_layers_of_features_from_tiny_images","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting","278695382_The_Nature_of_Statistical_Learning_Theory"]}