{"id":"337122193_HOW_TO_INCREASE_PUBLIC_CONFIDENCE_IN_UNDERSTANDING_AND_USE_OF_THE_BANKING_SYSTEM_MARKETING_MODEL_'NETS_FOR_TRUST'","abstract":"Digital information for financial markets and consumer insight are going to be extremely important in the near future. This paper is concluded that there is a problem with lack of trust to the banking system not only in Ukraine, but also in other more developed countries. The aim of this research is developing theoretical and organizational background of increasing public confidence in understanding and use of the banking system in Ukraine through building correlation between the trust levels and marketing trends in the banking industry. Basing on psychological analysis, it is aimed at improving current situation with trustless feelings to the banking system. As a background for developing the four-stage model the top 10 trends that have changed the way banks and credit unions were used. One of the main movers of this model is so-called ‘the boiling frog effect’. Research results lie in creating a four-stage marketing model ‘Nets for Trust’ to increase the trust level to the banking industry in Ukraine. The model has four steps of public sentiment changing in order to eradicate deterrent which manifest itself in lack of trust to the whole banking industry. For moving it into the one it is necessary to start discussions about the banking sphere initiated by scientists because they have no subjects they cannot discuss. Nowadays the banking sphere is considered to be in the middle of the first stage. As a result of these actions, people are going to find banks more reliable than they used to think. At the second stage it is very important to push on the nature. In the long run, this problem will finally be sorted out and the number of people who will be against the banking sphere will decrease. More and more people will think of keeping their savings and «mattress money» in banks which will give us an opportunity to initiate the third stage. At the fourth stage everything will become much easier because most people have put up with an idea that in banks their money will be safe and sound.","authors":["S. A. Kuznetsova","K. Kuznetsov","A. Kuznetsov"],"meta":["June 2019Financial and Credit Activity Problems of Theory and Practice 2(29):13-20","DOI:10.18371/fcaptp.v2i29.172305"],"references":["329261568_The_influence_of_financial_technologies_on_the_global_financial_system_stability","313361778_Banking_system_trust_bank_trust_and_bank_loyalty","322085301_Evolution_of_Deposit_Guarantee_System_in_Ukraine_Towards_Global_Standards_Macroprudential_Aspect","3454130_The_boiled_frog_problem_knowledge_management"]}