{"id":"337161370_An_Efficient_and_Unique_TFIDF_Algorithmic_Model-Based_Data_Analysis_for_Handling_Applications_with_Big_Data_Streaming","abstract":"As the field of data science grows, document analytics has become a more challenging task for rough classification, response analysis, and text summarization. These tasks are used for the analysis of text data from various intelligent sensing systems. The conventional approach for data analytics and text processing is not useful for big data coming from intelligent systems. This work proposes a novel TF/IDF algorithm with the temporal Louvain approach to solve the above problem. Such an approach is supposed to help the categorization of documents into hierarchical structures showing the relationship between variables, which is a boon to analysts making essential decisions. This paper used public corpora, such as Reuters-21578 and 20 Newsgroups for massive-data analytic experimentation. The result shows the efficacy of the proposed algorithm in terms of accuracy and execution time across six datasets. The proposed approach is validated to bring value to big text data analysis. Big data handling with map-reduce has led to tremendous growth and support for tasks like categorization, sentiment analysis, and higher-quality accuracy from the input data. Outperforming the state-of-the-art approach in terms of accuracy and execution time for six datasets ensures proper validation.","authors":["Celestine Iwendi","Suresh Ponnan","Revathi Munirathinam","Kathiravan Srinivasan"],"meta":["November 2019Electronics 8(11)","DOI:10.3390/electronics8111331","Project: Internet of Things and 5G Security Connectivity"],"references":["334008451_Socio-Technological_Factors_Affecting_User's_Adoption_of_eHealth_Functionalities_A_Case_Study_of_China_and_Ukraine_eHealth_Systems","314192123_Distributed_document_clustering_analysis_based_on_a_hybrid_method","313461573_Big_Data_Processing_Stacks","312874634_A_hybrid_NSCT_domain_image_watermarking_scheme","327540200_An_efficient_implementation_of_mobile_Raspberry_Pi_Hadoop_clusters_for_Robust_and_Augmented_computing_performance","324860566_ACO_based_key_management_routing_mechanism_for_WSN_security_and_data_collection","312363877_A_Survey_on_Emerging_Computing_Paradigms_for_Big_Data","312303849_Small_Data_Mid_Data_and_Big_Data_Versus_Algebra_Analysis_and_Topology_Perspectives","309755972_Empirical_Analysis_and_Modeling_of_the_Activity_Dilemmas_in_Big_Social_Networks","309689791_Social_Influence_Analysis_in_Social_Networking_Big_Data_Opportunities_and_Challenges"]}