{"id":"337190564_Discrete_antiderivatives_for_functions_over_mathop_mathbb_F_pnFpn","abstract":"In the design of cryptographic functions, the properties of their discrete derivatives have to be carefully considered, as many cryptographic attacks exploit these properties. One can therefore attempt to first construct derivatives with the desired properties and then recover the function itself. Recently Suder developed an algorithm for reconstructing a function (also called antiderivative) over the finite field F2n given its discrete derivatives in up to n linearly independent directions. Pasalic et al. also presented an algorithm for determining a function over Fpn given one of its derivatives. Both algorithms involve solving a pn×pn system of linear equations; the functions are represented as univariate polynomials over Fpn. We show that this apparently high computational complexity is not intrinsic to the problem, but rather a consequence of the representation used. We describe a simpler algorithm, with quasilinear complexity, provided we work with a different representation of the functions. Namely they are polynomials in n variables over Fp in algebraic normal form (for p>2, additionally, we need to use the falling factorial polynomial basis) and the directions of the derivatives are the canonical basis of Fpn. Algorithms for other representations (the directions of the derivatives not being the canonical basis vectors or the univariate polynomials over Fpn mentioned above) can be obtained by combining our algorithm with converting between representations. However, the complexity of these conversions is, in the worst case, exponential. As an application, we develop a method for constructing new quadratic PN (Perfect Nonlinear) functions. We use an approach similar to the one of Suder, who used antiderivatives to give an alternative formulation of the methods of Weng et al. and Yu et al. for searching for new quadratic APN (Almost Perfect Nonlinear) functions.","authors":["Ana Sălăgean"],"meta":["November 2019Designs Codes and Cryptography 88(2)","DOI:10.1007/s10623-019-00687-w"],"references":["246375728_Higher_Order_Derivatives_and_Differential_Cryptanalysis","309383510_On_derivatives_of_polynomials_over_finite_fields_through_integration","294288409_Antiderivative_functions_over_mathbb_F_2n_F_2_n","268659148_Calculus_One_and_several_variables_6th_ed","268164319_Some_results_on_the_differential_functions_over_finite_fields","264243156_A_matrix_approach_for_constructing_quadratic_APN_functions","44546268_Calculus_one_and_several_variables_S_L_Salas_Einar_Hille"]}