{"id":"337158636_Recognizing_Ancient_Characters_from_Tamil_Palm_Leaf_Manuscripts_using_Convolution_Based_Deep_Learning","abstract":"Palm leaf manuscripts has been one of the ancient writing methods but the palm leaf manuscripts content requires to be inscribed in a new set of leaves. This study has provided a solution to save the contents in palm leaf manuscripts by recognizing the handwritten Tamil characters in manuscripts and storing them digitally. Character recognition is one of the most essential fields of pattern recognition and image processing. Generally Optical character recognition is the method of e-translation of typewritten text or handwritten images into machine editable text. The handwritten Tamil character recognition has been one of the challenging and active areas of research in the field of pattern recognition and image processing. In this study a trial was made to identify Tamil handwritten characters without extraction of feature using convolutional neural networks. This study uses convolutional neural networks for recognizing and classifying the Tamil palm leaf manuscripts of characters from separated character images. The convolutional neural network is a deep learning approach for which it does not need to retrieve features and also a rapid approach for character recognition. In the proposed system every character is expanded to needed pixels. The expanded characters have predetermined pixels and these pixels are considered as characteristics for neural network training. The trained network is employed for recognition and classification. Convolutional Network Model development contains convolution layer, Relu layer, pooling layer, fully connected layer. The ancient Tamil character dataset of 60 varying class has been created. The outputs reveal that the proposed approach generates better rates of recognition than that of schemes based on feature extraction for handwritten character recognition. The accuracy of the proposed approach has been identified as 97% which shows that the proposed approach is effective in terms of recognition of ancient characters.","authors":["Kavitha Subramani","Murugavalli S"],"meta":["September 2019International Journal of Recent Technology and Engineering 8(3)","DOI:10.35940/ijrte.C5842.098319"],"references":["350286160_A_Review_of_Various_Handwriting_Recognition_Methods","333801032_Benchmarking_on_offline_Handwritten_Tamil_Character_Recognition_using_convolutional_neural_networks","332806265_Palm-Leaf_Manuscript_Character_Recognition_and_Classification_Using_Convolutional_Neural_Networks","325932686_Convolutional_neural_networks_an_overview_and_application_in_radiology","316938847_Handwritten_Digit_Recognition_Using_Convolutional_Neural_Networks","316350087_Handwriting_Recognition_on_Form_Document_Using_Convolutional_Neural_Network_and_Support_Vector_Machines_CNN-SVM","276177958_Review_on_Recent_Advances_in_Automatic_Handwritten_MODI_Script_Recognition","325979466_Tamil_character_recognition_from_ancient_epigraphical_inscription_using_OCR_and_NLP","325249785_Character_Recognition_using_Convolutional_Neural_Network","321816151_Feature_selection_for_an_automated_ancient_Tamil_script_classification_system_using_machine_learning_techniques","319496364_Identification_of_Ancient_Tamil_Letters_and_Its_Characters_Automatic_Date_Fixation_Based_on_Contour-let_Technique","318595496_IDENTIFICATION_OF_TAMIL_CHARACTER_RECOGNITION_BY_USING_MATLAB","316733035_Object_classification_in_radar_using_ensemble_methods","315098446_Malayalam_Handwritten_Character_Recognition_Using_Convolutional_Neural_Networks","310752533_Visualizing_and_understanding_convolutional_networks","304294655_Car_plate_character_recognition_using_a_convolutional_neural_network_with_shared_hidden_layers"]}