{"id":"337190293_The_psychology_of_privacy_in_the_digital_age","abstract":"Privacy is a psychological topic suffering from historical neglect—a neglect that is increasingly consequential in an era of social media connectedness, mass surveillance, and the permanence of our electronic footprint. Despite fundamental changes in the privacy landscape, social and personality psychology journals remain largely unrepresented in debates on the future of privacy. By contrast, in disciplines like computer science and media and communication studies, engaging directly with sociotechnical developments, interest in privacy has grown considerably. In our review of this interdisciplinary literature, we suggest four domains of interest to psychologists. These are as follows: sensitivity to individual differences in privacy disposition, a claim that privacy is fundamentally based in social interactions, a claim that privacy is inherently contextual, and a suggestion that privacy is as much about psychological groups as it is about individuals. Moreover, we propose a framework to enable progression to more integrative models of the psychology of privacy in the digital age and in particular suggest that a group and social relations–based approach to privacy is needed.","authors":["Avelie Stuart","Arosha Bandara","Mark Levine"],"meta":["November 2019Social and Personality Psychology Compass 13(6221)","DOI:10.1111/spc3.12507","Project: Socio-Technical Resilience for Enhancing Targeted Community Healthcare"],"references":["320127524_Privacy_indexes_a_survey_of_Westin's_studies","345483747_In_Pursuit_of_Privacy_Law_Ethics_and_the_Rise_of_Technology","332170173_Privacy_and_Freedom","329689536_The_Social_Psychology_of_Privacy","329651898_Group_Privacy_The_Right_To_Huddle","326067410_The_Theory_of_Situational_Privacy_and_Self-Disclosure","324294020_Privacy_and_Freedom","317278767_Logging_you_Logging_me_A_Replicable_Study_of_Privacy_and_Sharing_Behaviour_in_Groups_of_Visual_Lifeloggers","316611602_Toward_a_Sociology_of_Privacy","313600359_The_Evolution_of_Privacy_Norms_Mapping_35_Years_of_Technology-Related_Privacy_Discourse_1980-2014"]}