{"id":"337174623_Determining_eigenstates_and_thermal_states_on_a_quantum_computer_using_quantum_imaginary_time_evolution","abstract":"The accurate computation of Hamiltonian ground, excited and thermal states on quantum computers stands to impact many problems in the physical and computer sciences, from quantum simulation to machine learning. Given the challenges posed in constructing large-scale quantum computers, these tasks should be carried out in a resource-efficient way. In this regard, existing techniques based on phase estimation or variational algorithms display potential disadvantages; phase estimation requires deep circuits with ancillae, that are hard to execute reliably without error correction, while variational algorithms, while flexible with respect to circuit depth, entail additional high-dimensional classical optimization. Here, we introduce the quantum imaginary time evolution and quantum Lanczos algorithms, which are analogues of classical algorithms for finding ground and excited states. Compared with their classical counterparts, they require exponentially less space and time per iteration, and can be implemented without deep circuits and ancillae, or high-dimensional optimization. We furthermore discuss quantum imaginary time evolution as a subroutine to generate Gibbs averages through an analogue of minimally entangled typical thermal states. Finally, we demonstrate the potential of these algorithms via an implementation using exact classical emulation as well as through prototype circuits on the Rigetti quantum virtual machine and Aspen-1 quantum processing unit. The quantum imaginary time evolution and Lanczos algorithms offer a resource-efficient way to compute ground or excited states of target Hamiltonians on quantum computers. This offers promise for quantum simulation on near-term noisy devices.","authors":["Mario Motta","Chong Sun","Adrian T. K. Tan","Matthew J. O’Rourke"],"meta":["February 2020Nature Physics 16(2):1-6","DOI:10.1038/s41567-019-0704-4"],"references":["338381032_Contracting_projected_entangled_pair_states_is_average-case_hard","335668184_Variational_ansatz-based_quantum_simulation_of_imaginary_time_evolution","334295795_An_adaptive_variational_algorithm_for_exact_molecular_simulations_on_a_quantum_computer","332051551_Error_mitigation_extends_the_computational_reach_of_a_noisy_quantum_processor","328472575_Simulation_of_Nonequilibrium_Dynamics_on_a_Quantum_Computer","324104887_Barren_plateaus_in_quantum_neural_network_training_landscapes","323130113_Computation_of_Molecular_Spectra_on_a_Quantum_Processor_with_an_Error-Resilient_Algorithm","321873524_Unsupervised_Machine_Learning_on_a_Hybrid_Quantum_Computer","320196037_Quantum_optimization_using_variational_algorithms_on_near-term_quantum_devices","336456607_The_Complexity_of_the_Local_Hamiltonian_Problem","308647245_Finite_Correlation_Length_Implies_Efficient_Preparation_of_Quantum_Thermal_States","301836273_Quantum_algorithms_for_Gibbs_sampling_and_hitting-time_estimation","319683740_Hardware-efficient_variational_quantum_eigensolver_for_small_molecules_and_quantum_magnets","299508191_Hybrid_Quantum-Classical_Hierarchy_for_Mitigation_of_Decoherence_and_Determination_of_Excited_States","291942453_Simulating_Physics_with_Computers"]}