{"id":"337128510_ASSESSMENT_OF_CAPITAL_CONCENTRATION_IMPACT_ON_THE_BANKING_SYSTEM_EFFICIENCY_UNDER_MODERN_TRANSFORMATION","abstract":"The article proposes methodological aspects of the banking system efficiency evaluating in the direction of the influence on capital concentration factor under modern transformation conditions. Capital efficiency was investigated as the dependence of Ukrainian banks' total income on the volume of its equity and liabilities on the basis of Cobb-Douglas nonlinear regression models for for data according Ukrainian banks’ records for 8 years, which were classified into four groups by the size of regulatory capital and assets.The bank`s inefficiency measure is calculated on the basis of real data and standart values for each factors as Euclidean space distance to the efficiency level.The forecasted characteristics of banks' activity efficiency in groups using exponential smoothing methods and piecewise models are determined.According to the results of the prognosis of the estimates of capital efficiency according to the model of piecewise linear regression, a general drop in the capital efficiency of the banking system as a whole in groups is envisioned.To evaluate the overall efficiency of banks, the matrix \"productivity — efficiency\" was created. The obtained estimates confirm the uneven distribution of banks by quadrants, the absolute majority of which are concentrated in a quadrant with a critical level of efficiency. The implementation of the proposed toolkit on the basis of models of evaluation of the productivity and efficiency of the banks' allows us to identify banks that require a radical change in strategy, revision of the process of using resources with the aim of reduction of the dependence of banks' profitability on negative external influences.","authors":["N. L. Morozova","I. V. Pasechnik","Timur Malafeyev","Y. P. Galushko"],"meta":["June 2019Financial and Credit Activity Problems of Theory and Practice 2(29):55-65","DOI:10.18371/fcaptp.v2i29.172367"],"references":["226262481_Measuring_Cost_Efficiency_in_European_Banking_A_Comparison_of_Frontier_Techniques","241766787_Economies_of_Scale_and_Efficiency_in_European_Banking_New_Evidence","222076679_Productivity_change_in_European_banking_A_comparison_of_parametric_and_non-parametric_approaches","5168167_A_Nonparametric_Approach_for_Assessing_Productivity_Dynamics_of_Large_US_Banks"]}