{"id":"337250561_Analyzing_the_Bills-Voting_Dynamics_and_Predicting_Corruption-Convictions_Among_Brazilian_Congressmen_Through_Temporal_Networks","abstract":"In this paper, we propose a network-based technique to analyze bills-voting data comprising the votes of Brazilian congressmen for a period of 28 years. The voting sessions are initially mapped into static networks, where each node represents a congressman and each edge stands for the similarity of votes between a pair of congressmen. Afterwards, the constructed static networks are converted to temporal networks. Our analyses on the temporal networks capture some of the main political changes happened in Brazil during the period of time under consideration. Moreover, we find out that the bills-voting networks can be used to identify convicted politicians, who commit corruption or other financial crimes. Therefore, we propose two conviction prediction methods, one is based on the highest weighted convicted neighbor and the other is based on link prediction techniques. It is a surprise to us that the high accuracy (up to 90% by the link prediction method) on predicting convictions is achieved only through bills-voting data, without taking into account any financial information beforehand. Such a feature makes possible to monitor congressmen just by considering their legal public activities. In this way, our work contributes to the large scale public data study using complex networks.","authors":["Tiago Colliri","Liang Zhao"],"meta":["November 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-53252-9"],"references":["333642405_Simplicial_models_of_social_contagion","332173010_Social_capital_predicts_corruption_risk_in_towns","322306060_The_dynamical_structure_of_political_corruption_networks","315958339_From_static_to_temporal_network_theory_Applications_to_functional_brain_connectivity","312813875_Link_Prediction","304000701_Exploring_the_structure_and_function_of_temporal_networks_with_dynamic_graphlets","301592003_Link_Prediction_in_Criminal_Networks_A_Tool_for_Criminal_Intelligence_Analysis","327866743_A_sign_of_the_times_Weak_and_strong_polarization_in_the_US_Congress_1973-2016","321247876_On_power-law_relationships_of_the_internet_topology","285874604_Functional_Cartography_of_Complex_Metabolic_Networks"]}