{"id":"337264250_The_Relationship_between_Affectivity_and_Self-efficacy_for_the_Learning_of_Mathematical_Contents","abstract":"The causal attributions and dimensions and the academic self-efficacy permeated by the affectivity are fundamental for the school achievement of the undergraduate student. In this study, we evaluated the relationship between affectivity and academic self-efficacy of 115 students (39 from the Computer Science course, 41 from the Civil Engineering course and 35 from the Electrical Engineering course of the Federal University of Mato Grosso). A questionnaire with 10 questions was made using the Likert scale, where the first two questions assessed the interference of the previous contents on the learning of mathematical contents, three evaluated the level of student's academic self-efficacy, the other two assessed some origins of the beliefs of the student's academic self-efficacy, the last question evaluated the relationship between effort and academic self-efficacy, and questions 4 and 5, the focus of this research, directly assessed the relationship between affectivity and academic self-efficacy. The results pointed to a protagonist role of affectivity in relation to academic self-efficacy and a confirmation that the effort continues to be the highlight for students' belief in academic self-efficacy.","authors":["José Roberto Damasceno da Silva"],"meta":["October 2019Acta Scientiae 21(5):163-177","DOI:10.17648/acta.scientiae.4122","Project: The Relationship between Affectivity and Self-efficacy for the Learning of Mathematical Contents"],"references":["232580194_Consistency_of_pupils'_attributions_regarding_success_and_failure","221931642_Atribuicoes_de_causalidade_para_o_sucesso_eo_fracasso_escolar_dos_seus_alunos_por_professoras_do_ensino_fundamental","37650511_Auto-eficacia_academica_e_atribuicoes_causais_em_Portugues_e_Matematica","19257755_An_Attributional_Theory_of_Achievement_Motivation_and_Emotion","316823281_Self-efficacy_the_exercise_of_control","284417101_Refletindo_sobre_a_Dificuldade_de_Leitura_em_Alunos_do_Ensino_Superior_Deficiencia_ou_Simples_Falta_de_Habito","247498670_The_role_of_self-efficacy_beliefs_in_student_engagement_and_learning_in_the_classroom","233820393_Social_Foundations_of_Thought_Action_A_Social_Cognitive_Theory","216277855_Crencas_de_auto-eficacia_autoconceito_e_desempenho_em_matematica","37657947_Desenvolvimento_diferencial_das_concepcoes_pessoais_de_inteligencia_durante_a_adolescencia"]}