{"id":"337240600_Coordination_over_a_unique_medium_of_exchange_under_information_scarcity","abstract":"Several micro-founded macroeconomic models with rational expectations address the issue of money emergence, by characterizing it as a coordination game. These models have in common the use of agents who dispose of perfect or near-perfect information on the global state of the economy and who display full-fledged computational abilities. Several experimental studies have shown that a simple trial-and-error learning process could constitute an explanation for how agents coordinate on a single mean of exchange. However, these studies provide subjects with full information regarding the state of the economy while restricting the number of goods in circulation to three. In this study, by the mean of multi-agent simulations and human experiments, we test the hypothesis according to which coordination over a unique medium of exchange is possible in the context of information scarcity. In our experimental design, subjects and artificial agents are only aware of the outcome of their own decisions. We provide results for economies with 3 and 4 goods to evaluate to which extent it is possible to generalize results obtained with 3 goods to n goods. Our findings show that in an economy à la Iwai, commodity money can emerge under drastic information restrictions with three goods in circulation, but generalization to four or more goods is not guaranteed.","authors":["Aurélien Nioche","Basile Garcia","Germain Lefebvre","Thomas Boraud"],"meta":["December 2019Palgrave Communications","DOI:10.1057/s41599-019-0362-2"],"references":["328973293_Contrasting_temporal_difference_and_opportunity_cost_reinforcement_learning_in_an_empirical_money-emergence_paradigm","319086581_Confirmation_bias_in_human_reinforcement_learning_Evidence_from_counterfactual_feedback_processing","317594784_Secondary_Currency_Acceptance_Experimental_Evidence_with_a_Dual_Currency_Search_Model","316846875_A_Meta-Analytic_Review_of_Two_Modes_of_Learning_and_the_Description-Experience_Gap","334991262_Secondary_currency_acceptance_Experimental_evidence_with_a_dual_currency_search_model","331946637_Playing_with_Money","329648344_Money_Payments_and_Liquidity","327995827_Competing_currencies_in_the_laboratory","324900650_Cash_versus_extra-credit_incentives_in_experimental_asset_markets","320460248_Monotone_Stochastic_Choice_Models_The_Case_of_Risk_and_Time_Preferences"]}