{"id":"337234306_Security_of_the_Internet_of_Things_Vulnerabilities_Attacks_and_Countermeasures","abstract":"Wireless Sensor Networks (WSNs) constitute one of the most promising third-millennium technologies and have wide range of applications in our surrounding environment. The reason behind the vast adoption of WSNs in various applications is that they have tremendously appealing features, e.g., low production cost, low installation cost, unattended network operation, autonomous and longtime operation. WSNs have started to merge with the Internet of Things (IoT) through the introduction of Internet access capability in sensor nodes and sensing ability in Internet-connected devices. Thereby, the IoT is providing access to huge amount of data, collected by the WSNs, over the Internet. Hence, the security of IoT should start with foremost securing WSNs ahead of the other components. However, owing to the absence of a physical line-of-defense, i.e. there is no dedicated infrastructure such as gateways to watch and observe the flowing information in the network, security of WSNs along with IoT is of a big concern to the scientific community. More specifically, for the application areas in which CIA (confidentiality, integrity, availability) has prime importance, WSNs and emerging IoT technology might constitute an open avenue for the attackers. Besides, recent integration and collaboration of WSNs with IoT will open new challenges and problems in terms of security. Hence, this would be a nightmare for the individuals using these systems as well as the security administrators who are managing those networks. Therefore, a detailed review of security attacks towards WSNs and IoT, along with the techniques for prevention, detection, and mitigation of those attacks are provided in this paper. In this text, attacks are categorized and treated into mainly two parts, most or all types of attacks towards WSNs and IoT are investigated under that umbrella: “Passive Attacks” and “Active Attacks”. Understanding these attacks and their associated defense mechanisms will help paving a secure path towards the proliferation and public acceptance of IoT technology.","authors":["Ismail Butun","Patrik Österberg","Houbing Song"],"meta":["November 2019IEEE Communications Surveys & Tutorials 22(1):616-644","DOI:10.1109/COMST.2019.2953364"],"references":["331594005_Security_Implications_of_Fog_Computing_on_the_Internet_of_Things","329006988_A_Survey_of_LoRaWAN_for_IoT_From_Technology_to_Application","326954520_Challenges_of_Securing_the_Industrial_Internet_of_Things_Value_Chain","325493576_Analysis_of_LoRaWAN_v11_security_research_paper","335865723_SoK_Security_Evaluation_of_Home-Based_IoT_Deployments","335364912_Preserving_Location_Privacy_in_Cyber-Physical_Systems","331719807_Energy_efficient_secure_computation_offloading_in_NOMA-Based_mMTC_networks_for_IoT","330330584_Joint_Power_and_Sub-Channel_Allocation_for_Secure_Transmission_in_NOMA-Based_mMTC_Networks","329122337_Formal_security_analysis_of_LoRaWAN","327541022_Smart_Cities_Foundations_Principles_and_Applications"]}