{"id":"337282035_Dynamic_pricing_and_matching_in_ride-hailing_platforms","abstract":"Ride‐hailing platforms such as Uber, Lyft, and DiDi have achieved explosive growth and reshaped urban transportation. The theory and technologies behind these platforms have become one of the most active research topics in the fields of economics, operations research, computer science, and transportation engineering. In particular, advanced matching and dynamic pricing (DP) algorithms—the two key levers in ride‐hailing—have received tremendous attention from the research community and are continuously being designed and implemented at industrial scales by ride‐hailing platforms. We provide a review of matching and DP techniques in ride‐hailing, and show that they are critical for providing an experience with low waiting time for both riders and drivers. Then we link the two levers together by studying a pool‐matching mechanism called dynamic waiting (DW) that varies rider waiting and walking before dispatch, which is inspired by a recent carpooling product Express Pool from Uber. We show using data from Uber that by jointly optimizing DP and DW, price variability can be mitigated, while increasing capacity utilization, trip throughput, and welfare. We also highlight several key practical challenges and directions of future research from a practitioner's perspective.","authors":["Chiwei Yan","Helin Zhu","Nikita Korolko","Dawn Woodard"],"meta":["November 2019Naval Research Logistics 67(3)","DOI:10.1002/nav.21872"],"references":["350166921_Dynamic_Type_Matching","335040541_Pricing_and_Matching_with_Forward-Looking_Buyers_and_Sellers","334715065_A_Deep_Value-network_Based_Approach_for_Multi-Driver_Order_Dispatching","333991897_Dynamic_Pricing_of_Relocating_Resources_in_Large_Networks_Extended_Abstract","333939895_Spatio-Temporal_Pricing_for_Ridesharing_Platforms","333686862_Driver_Surge_Pricing","332851411_Spatial_Pricing_in_Ride-Sharing_Networks","330335739_Dynamic_Matching_for_Real-Time_Ridesharing","326566329_On-Demand_Service_Platforms","326046362_Coordinating_Supply_and_Demand_on_an_On-Demand_Service_Platform_with_Impatient_Customers"]}