{"id":"337210925_A_SDN-Based_PubSub_Middleware_for_Geographic_Content_Dissemination_in_Internet_of_Vehicles","abstract":"The vehicular networks are evolving towards a new paradigm, the Internet of Vehicles. Different types of services, with different QoS requirements, should be enabled: road safety and traffic efficiency, infotainment and advertising, etc. For many of these services, a Publish/Subscribe (Pub/Sub) approach is an efficient way to enable a scalable and real-time data dissemination. That is why different Pub/Sub middlewares, in particular Software Defined Networking (SDN)-based Pub/Sub middlewares, have already been proposed. Indeed, thanks to the high level of flexibility and programmability of SDN, different improvements of the existing Pub/Sub middlewares could be enabled: QoS awareness, mobility management, etc. However, for many vehicular applications, data dissemination is closely linked to the geographic position of the emitter. To the best of our knowledge, the idea of a location-aware SDN-based Pub/Sub middleware has not been proposed yet. Thus, in this paper, we aim to demonstrate that, using the Openflow protocol and the SDN benefits, an efficient and flexible location-aware and QoS-aware middleware can be designed and implemented. To do so, this middleware, its main components and an algorithm enabling an efficient SDN-based QoS-aware geographic data dissemination are described. Moreover, the performances of the proposed architecture and mechanism are evaluated through experiments (latency, bandwidth efficiency, control overhead, etc.).","authors":["Léo Mendiboure","Mohamed Aymen Chalouf","Francine Krief"],"meta":["September 2019","DOI:10.1109/VTCFall.2019.8891151","Conference: 2019 IEEE 90th Vehicular Technology Conference (VTC2019-Fall)At: Honolulu, Hawai, USA"],"references":["328956857_Information-Centric_Network-Based_Vehicular_Communications_Overview_and_Research_Opportunities","317957704_A_Horizontally_Scalable_and_Reliable_Architecture_for_Location-Based_Publish-Subscribe","303513451_Impact_of_SDN_on_Mobility_Management","334586344_Edge_Computing_Based_Applications_in_Vehicular_Environments_Comparative_Study_and_Main_Issues","286682373_SDN_enabled_content_distribution_in_vehicular_networks","283551558_SDN-based_routing_for_efficient_message_propagation_in_VANET","262354086_Towards_an_Elastic_Distributed_SDN_Controller","261024742_A_Content-Based_PublishSubscribe_System_for_Efficient_Event_Notification_over_Vehicular_Ad_Hoc_Networks","256991974_PS-QUASAR_a_publishsubscribe_QoS_aware_middleware_for_Wireless_Sensor_and_Actor_Networks","224236065_A_PublishSubscribe_Communication_Infrastructure_for_VANET_Applications"]}