{"id":"337282876_Use_of_the_Hardware_and_Software_Complex_Moscow_Electronic_School_in_Training_Teachers_Working_Under_the_International_Baccalaureate_Programmes","abstract":"The results of a study of the influence quantity of the educational resources of the Moscow Electronic School project on the professional qualities of teachers working under the International Baccalaureate programmes are presented in the article. A comparison of the effectiveness of teachers’ work at Moscow schools of the International Baccalaureate system, who are enrolled in master’s degree programmes at Moscow City University and use these resources as an object and a tool for education, was used as the main research method. The proposed changes to the teacher training system, applied in connection with the possibility of their participation in the development and assessment of the Moscow Electronic School project’s educational resources effectiveness are described in the article, an example of students’ creative projects is provided. In conclusion, based on the data available from the experiments, the trends of the described electronic resources’ influence on the effectiveness of collective, creative and result-oriented educational activities, typical for the International Baccalaureate’s approaches are identified. Conclusions about improving teachers’ professional qualities in the field of educational, extracurricular and scientific-methodological activities are made","authors":["Vadim V. Grinshkun","Natalia A. Usova"],"meta":["September 2019","DOI:10.17516/1997-1370-0487"],"references":["332548589_An_Essential_Change_to_the_Training_of_Computer_Science_Teachers_The_Need_to_Learn_Graphics","331394910_Implementing_Teachers'_Training_Technologies_at_a_Federal_University_E-portfolio_Digital_Laboratory_PROLog_Module_System","324114565_International_Mindedness_in_Practice_The_Evidence_from_International_Baccalaureate_Schools","303741898_Use_of_Information_Technology_in_Teaching_Semiconductors_Physics","282154726_International_elite_or_global_citizens_Equity_distinction_and_power_the_International_Baccalaureate_and_the_rise_of_the_South","261390316_Applied_Bachelor_Degree_Programs_as_Technology_Enhanced_Education_in_the_Innovative_Russia_Implementation_Experience_in_Krasnoyarsk_Region","31253355_Mathematical_modelling_in_the_international_baccalaureate_teacher_beliefs_and_technology_usage"]}