{"id":"337250576_Kvasir-SEG_A_Segmented_Polyp_Dataset","abstract":"Pixel-wise image segmentation is a highly demanding task in medical-image analysis. In practice, it is difficult to find annotated medical images with corresponding segmentation masks. In this paper, we present Kvasir-SEG: an open-access dataset of gastrointestinal polyp images and corresponding segmentation masks, manually annotated by a medical doctor and then verified by an experienced gastroenterologist. Moreover, we also generated the bounding boxes of the polyp regions with the help of segmentation masks. We demonstrate the use of our dataset with a traditional segmentation approach and a modern deep-learning based Convolutional Neural Network (CNN) approach. The dataset will be of value for researchers to reproduce results and compare methods. By adding segmentation masks to the Kvasir dataset, which only provide frame-wise annotations, we enable multimedia and computer vision researchers to contribute in the field of polyp segmentation and automatic analysis of colonoscopy images.","authors":["Debesh Jha","Pia Helén Smedsrud","Michael Alexander Riegler","Pål Halvorsen"],"meta":["January 2020","Conference: 26TH INTERNATIONAL CONFERENCE ON MULTIMEDIA MODELINGAt: Daejeon, Korea","Project: Medico - Automatic detection of disease in the GI tract benchmark"],"references":["331265432_Ensemble_of_Instance_Segmentation_Models_for_Polyp_Segmentation_in_Colonoscopy_Images","330460151_Employing_Deep_Networks_for_Image_Processing_on_Small_Research_Datasets","328803082_Medico_Multimedia_Task_at_MediaEval_2018","321374973_Road_Extraction_by_Deep_Residual_U-Net","316215961_KVASIR_A_Multi-Class_Image_Dataset_for_Computer_Aided_Gastrointestinal_Disease_Detection","306101441_Multimedia_and_Medicine_Teammates_for_Better_Disease_Detection_and_Survival","331846968_Automatic_Analysis_of_Endoscopic_Images_for_Polyps_Detection_and_Segmentation","316184073_Increased_Rate_of_Adenoma_Detection_Associates_With_Reduced_Risk_of_Colorectal_Cancer_and_Death","310793180_Global_cancer_statistics","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram"]}