{"id":"337228624_Aplicacao_da_Triplice_Contingencia_da_Analise_Comportamental_na_Gamificacao_do_Modulo_de_Ensino_e_Aprendizagem_da_Logica_Proposicional","abstract":"In the educational context, it has been developed gamified systems in order to get better levels of engagement of the contents approached in the disciplines. Therefore, it is important to understand the behavior of the users in these environments, especially in the definition of elements that stimulate learning. In this sense, this article aims to present the procedures performed for the presents the gamification process of the truth table module according to the concepts of the Three-Term Contingency of Behavior Analysis. This module is included in a gamified platform called Logic Live, which assists academics and teachers in the process of teaching and learning the Logic discipline. The results obtained are similar to the process steps: \"Antecedent Variables\", \"User Behavior\" and \"Consequent Variables\". Resumo. No contexto educacional, tem sido desenvolvido sistemas gamificados com o intuito de obter melhores níveis de engajamento dos conteúdos abordados nas disciplinas. Para tanto, é importante o entendimento do comportamento do usuário nesses ambientes, especialmente, para definição de elementos que estimulem a aprendizagem. Nesse sentido, este trabalho apresenta o processo de gamificação do módulo de tabelaverdade de acordo com os conceitos da Tríplice Contingência da Análise Comportamental. Este módulo está inserido em uma plataforma gamificada, intitulada Logic Live, que auxilia acadêmicos e professores no processo de ensino e aprendizagem da disciplina de Lógica. Os resultados obtidos correspondem à implementação do módulo gamificado considerando as três etapas do processo: \"Variáveis Antecedentes\", \"Comportamento do Usuário\" e \"Variáveis Consequentes\". 1. Introdução Nos cursos da área da computação, a disciplina de Lógica geralmente compreende conteúdos como raciocínio lógico, formalização de sentenças, entendimentos dos operadores lógicos por meio de tabelas verdade, verificação da validade de fórmulas, entre outros conhecimentos que são necessários para fundamentar \"a sólida formação em Ciência da Computação e Matemática\" apontada nas Diretrizes Curriculares Nacionais para os cursos de graduação na","authors":["Fernanda Pereira Gomes","Parcilene Fernandes De Brito","Heloise Acco Tives","Fabiano Fagundes"],"meta":["November 2019","DOI:10.5753/cbie.sbie.2019.942","Projects: Desenvolvimento de Plataformas Online para Auxílio ao Processo de Ensino e AprendizagemMídias Sociais e Engenharia Inteligente de Dados"],"references":["328735820_StudyPlay_Um_Modelo_Gamificado_Para_Incentivo_a_Realizacao_de_Atividades_Extraclasse","301296890_TICs_e_a_funcao_da_gamificacao_na_Educacao_em_Ciencias_a_partir_de_uma_visao_analitico-comportamental","328734876_Gamificacao_de_um_Sistema_de_Juiz_Online_para_Motivar_Alunos_em_Disciplina_de_Programacao_Introdutoria","325355748_Treino_didatico_de_analise_de_contingencias_e_previsao_de_intervencoes_sobre_as_consequencias_do_responder","317269181_5W2H_Framework_a_guide_to_design_develop_and_evaluate_the_user-centered_gamification","286007208_Interpreting_consumer_choice_The_behavioural_perspective_model","278667525_Comprehension_by_design_Teaching_young_learners_how_to_comprehend_what_they_read","273946893_For_the_Win_How_Game_Thinking_can_Revolutionize_your_Business","272780193_The_Gamification_of_Learning_and_Instruction","9974758_Teaching_Machines_From_the_experimental_study_of_learning_come_devices_which_arrange_optimal_conditions_for_self-instruction"]}