{"id":"337243185_A_Hybrid_Adaptive_Control_Strategy_for_Industrial_Robotic_Joints","abstract":"This paper presents a hybrid adaptive approximation-based control (HAAC) strategy for a\nclass of uncertain robotic joints' system. The proposed control structure consists of a robust sliding mode controller and an adaptive approximation-based controller. The robust sliding mode controller is designed by using the super-twisting algorithm, which is a particularly effective method to decrease the chattering caused by the traditional sliding mode control (SMC) and compensate the disturbances. Another improvement of\nthe robust sliding mode controller is that the robust control parameters only subject to the upper bound of the derivative of the external disturbances, rather than choosing a relatively large value. Moreover, the designed adaptive approximation-based controller has the following two distinctive features: 1) the control parameters are designed to be adjusted in real time and 2) the prior knowledge of actual robotic model is not required to be known. These features contribute to compensating the uncertainties. The stability of the closed-loop system is proved by using the Lyapunov theory, and the simulation results demonstrate the effectiveness of the proposed control method. Finally, the proposed HAAC could apply in the experiments of industrial robotic joints' system.","authors":["Bin Ren","Yao Wang","Xurong Luo","Rogelio Lozano"],"meta":["March 2019IEEE Access 7","DOI:10.1109/ACCESS.2019.2907179","Project: Adaptive Robust Control"],"references":["324503428_Learning_of_operator_hand_movements_via_least_angle_regression_to_be_teached_in_a_manipulator","281489303_Neural_Network_Control_of_a_Rehabilitation_Robot_by_State_and_Output_Feedback","332642667_Recursive_least_squares_for_a_manipulator_which_learns_by_demonstration","325506697_Continuous_sliding_mode_control_of_compliant_robot_arms_A_singularly_perturbed_approach","323160586_Robust_Sliding_Mode_Control_for_Robots_Driven_by_Compliant_Actuators","322912737_Robust_feedback_linearization_for_nonlinear_processes_control","321505540_Robust_Adaptive_Tracking_Control_for_Manipulators_Based_on_a_TSK_Fuzzy_Cerebellar_Model_Articulation_Controller","305080390_A_novel_adaptive_finite-time_tracking_control_for_robotic_manipulators_using_nonsingular_terminal_sliding_mode_and_RBF_neural_networks","299524183_Biomimetic_Hybrid_Feedback_Feedforward_Neural-Network_Learning_Control","288020956_Hybrid_feedback_feedforward_An_efficient_design_of_adaptive_neural_network_control"]}