{"id":"337294640_Designing_an_advanced_software_tool_for_Digital_Scholarly_Editions","abstract":"The increasing dissemination of Digital Scholarly Editions has highlighted not only the great potential of this method of publication, but also a good number of theoretical problems that affect both the DSEs as editorial products, and the impact of tools and methods of computer science on the methodology of textual criticism. On the one hand, the editions published so far are an evolution of the practice of ecdotics and represent not only a col- lection of interesting experiments, but also innovative and effective research tools. On the other hand, however, the limits within which an author of digital editions is forced to operate and the most appropriate strategies to minimize their impact have not yet been thoroughly investigated. The adoption of IT tools and methods, in fact, provides many answers to the requests of digital philologists, but the very nature of these tools imposes very strict modes of action, sometimes perceived as too rigid by the scholar. This article presents and describes a software tool that comes at the end of the process of creating a digital edition, to be used in that crucial phase when the edition is prepared for publication on the Web. The aim is not to show the more technical aspects of this tool, even if its fundamental characteristics will be introduced to better understand the terms of the issue, but to describe its genesis and development, and to highlight how visualization software represents a crucial element of the whole editorial process.","authors":["Roberto Rosselli Del Turco"],"meta":["August 2019Textual Cultures Text Contexts Interpretation 12(2):91-111","DOI:10.14434/textual.v12i2.27690","Project: Edition Visualization Technology"],"references":["329699399_Between_Innovation_and_Conservation_The_Narrow_Path_of_User_Interface_Design_for_Digital_Scholarly_Editions","273184295_Edition_Visualization_Technology_A_Simple_Tool_to_Visualize_TEI-based_Digital_Editions","264205341_A_Catalogue_of_Digital_Editions","284630857_The_Rationale_of_Hypertext","244417314_Ajax_A_New_Approach_to_Web_Applications"]}