{"id":"337279804_3D_frequency-domain_elastic_wave_modeling_with_spectral-element_method_using_a_massively_parallel_direct_solver","abstract":"Complex topography, the free-surface boundary condition and anelastic properties of media should be accounted for in the frame of onshore geophysical prospecting imaging, such as full waveform inversion. In this context, an accurate and efficient forward modeling engine is mandatory. We perform 3D frequency-domain anisotropic elastic wave modeling by using the highly accurate spectral element method and a sparse multifrontal direct solver. An efficient approach similar to computing the matrix-vector product in the time domain is used to build the matrix. We validate the numerical results by comparing with analytical solutions. A parallel direct solver, MUMPS, is used to solve the linear system. We show that a hybrid implementation of MPI and OpenMP is more efficient in flops and memory cost. The influence of deformed mesh, free-surface boundary condition and heterogeneity of media on MUMPS performance is negligible. Complexity analysis suggests that the memory complexity of MUMPS agrees with the theoretical order 𝒪(N ⁴ ) (or 𝒪(N 3.5 ) with an efficient matrix reordering method) for a N ³ grid when nontrivial topography is considered. With available resources, we conduct a moderate scale modeling with a subset of SEAM Phase II Foothills model, where 60 wavelengths in x-axis are propagated. Computing one gradient of FWI based on this model using the frequency-domain modeling is shown to require similar or less computational resources as what would be required for a time-domain solver, depending on the number of sources, while larger memory is necessary. An estimation of the increasing trend indicates that about 20Tb memory would be required for a 50×50×50 wavelength modeling. The limit of MUMPS scalability hinders the application to larger scale applications.","authors":["Yang Li","Romain Brossier","Ludovic Métivier"],"meta":["November 2019Geophysics 85(2):1-75","DOI:10.1190/geo2019-0172.1"],"references":["335103159_3D_tensorial_elastodynamics_for_anisotropic_media","335102311_Failures_of_the_perfectly-matched_layer_method_in_frequency-domain_seismic_wave_modelling_in_elastic_anisotropic_media","327320846_3D_numerical_simulation_of_elastic_waves_with_a_frequency-domain_iterative_solver","323357991_Block_Low-Rank_multifrontal_solvers_complexity_performance_and_scalability","346680185_High-Order_Methods_for_Incompressible_Fluid_Flow","327870574_Efficient_time-domain_3D_elastic_and_visco-elastic_FWI_using_a_spectral-element_method_on_flexible_Cartesian-based_mesh","326497147_A_Time-Domain_Preconditioned_Truncated_Newton_Approach_to_Visco-acoustic_Multiparameter_Full_Waveform_Inversion","326131797_On_the_role_of_density_and_attenuation_in_three-dimensional_multiparameter_visco-acoustic_VTI_frequency-domain_FWI_an_OBC_case_study_from_the_North_Sea","322843909_An_adaptive_free-surface_expression_for_three-dimensional_finite-difference_frequency-domain_modeling_of_elastic_wave","321696124_Hybridizable_discontinuous_Galerkin_method_for_the_two-dimensional_frequency-domain_elastic_wave_equations"]}