{"id":"337252918_Natural_Language_Processing_NLP_in_Qualitative_Public_Health_Research_A_Proof_of_Concept_Study","abstract":"Qualitative data-analysis methods provide thick, rich descriptions of subjects’ thoughts, feelings, and lived experiences but may be time-consuming, labor-intensive, or prone to bias. Natural language processing (NLP) is a machine learning technique from computer science that uses algorithms to analyze textual data. NLP allows processing of large amounts of data almost instantaneously. As researchers become conversant with NLP, it is becoming more frequently employed outside of computer science and shows promise as a tool to analyze qualitative data in public health. This is a proof of concept paper to evaluate the potential of NLP to analyze qualitative data. Specifically, we ask if NLP can support conventional qualitative analysis, and if so, what its role is. We compared a qualitative method of open coding with two forms of NLP, Topic Modeling, and Word2Vec to analyze transcripts from interviews conducted in rural Belize querying men about their health needs. All three methods returned a series of terms that captured ideas and concepts in subjects’ responses to interview questions. Open coding returned 5–10 words or short phrases for each question. Topic Modeling returned a series of word-probability pairs that quantified how well a word captured the topic of a response. Word2Vec returned a list of words for each interview question ordered by which words were predicted to best capture the meaning of the passage. For most interview questions, all three methods returned conceptually similar results. NLP may be a useful adjunct to qualitative analysis. NLP may be performed after data have undergone open coding as a check on the accuracy of the codes. Alternatively, researchers can perform NLP prior to open coding and use the results to guide their creation of their codebook.","authors":["William Leeson","Adam Resnick","Daniel Alexander","John Rovers"],"meta":["November 2019The International Journal of Qualitative Methods 18:160940691988702","DOI:10.1177/1609406919887021"],"references":["332263491_A_Defense_of_Pure_Connectionism","322647255_A_Natural_Language_Processing_System_That_Links_Medical_Terms_in_Electronic_Health_Record_Notes_to_Lay_Definitions_System_Development_Using_Physician_Reviews","320812037_Artificial_Intelligence_and_the_Future_of_Work_Human-AI_Symbiosis_in_Organizational_Decision_Making","309889936_The_Advantages_and_Disadvantages_of_Using_Qualitative_and_Quantitative_Approaches_and_Methods_in_Language_Testing_and_Assessment_Research_A_Literature_Review","301697046_A_Natural_Language_Processing_Tool_for_Large-Scale_Data_Extraction_from_Echocardiography_Reports","299648937_Yelp_Reviews_Of_Hospital_Care_Can_Supplement_And_Inform_Traditional_Surveys_Of_The_Patient_Experience_Of_Care","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","281549729_Topic_modeling_and_digital_humanities","280912040_Measuring_Word_Significance_using_Distributed_Representations_of_Words","272410331_Interpretative_phenomenological_analysis_as_a_useful_methodology_for_research_on_the_lived_experience_of_pain"]}