{"id":"337266763_Mercator_uncovering_faithful_hyperbolic_embeddings_of_complex_networks","abstract":"We introduce Mercator, a reliable embedding method to map real complex networks into their hyperbolic latent geometry. The method assumes that the structure of networks is well described by the popularity × similarity S 1 / H 2 static geometric network model, which can accommodate arbitrary degree distributions and reproduces many pivotal properties of real networks, including self-similarity patterns. The algorithm mixes machine learning and maximum likelihood (ML) approaches to infer the coordinates of the nodes in the underlying hyperbolic disk with the best matching between the observed network topology and the geometric model. In its fast mode, Mercator uses a model-adjusted machine learning technique performing dimensional reduction to produce a fast and accurate map, whose quality already outperforms other embedding algorithms in the literature. In the refined Mercator mode, the fast mode embedding result is taken as an initial condition in a ML estimation, which significantly improves the quality of the final embedding. Apart from its accuracy as an embedding tool, Mercator has the clear advantage of systematically inferring not only node orderings, or angular positions, but also the hidden degrees and global model parameters, and has the ability to embed networks with arbitrary degree distributions. Overall, our results suggest that mixing machine learning and ML techniques in a model-dependent framework can boost the meaningful mapping of complex networks.","authors":["Guillermo Garcia-Perez","Antoine Allard","Maria Angeles Serrano","Marian Boguna"],"meta":["November 2019New Journal of Physics 21(12)","DOI:10.1088/1367-2630/ab57d2"],"references":["321169172_Machine_learning_meets_complex_networks_via_coalescent_embedding_in_the_hyperbolic_space","318813796_Soft_Communities_in_Similarity_Space","318670936_A_nonuniform_popularity-similarity_optimization_nPSO_model_to_efficiently_generate_realistic_complex_networks_with_communities","317300096_Multiscale_unfolding_of_real_networks_by_geometric_renormalization","310233743_Manifold_learning_and_maximum_likelihood_estimation_for_hyperbolic_network_embedding","308273403_The_hidden_hyperbolic_geometry_of_international_trade_World_Trade_Atlas_1870-2013","323715289_Efficient_Embedding_of_Scale-Free_Graphs_in_the_Hyperbolic_Plane","321804736_Communication_dynamics_in_complex_brain_networks","313481009_Geometric_Correlations_Mitigate_the_Extreme_Vulnerability_of_Multiplex_Networks_against_Targeted_Attacks","312544727_The_geometric_nature_of_weights_in_real_complex_networks"]}