{"id":"337260021_ELECTOR_evaluator_for_long_reads_correction_methods","abstract":"The error rates of third-generation sequencing data have been capped >5%, mainly containing insertions and deletions. Thereby, an increasing number of diverse long reads correction methods have been proposed. The quality of the correction has huge impacts on downstream processes. Therefore, developing methods allowing to evaluate error correction tools with precise and reliable statistics is a crucial need. These evaluation methods rely on costly alignments to evaluate the quality of the corrected reads. Thus, key features must allow the fast comparison of different tools, and scale to the increasing length of the long reads. Our tool, ELECTOR, evaluates long reads correction and is directly compatible with a wide range of error correction tools. As it is based on multiple sequence alignment, we introduce a new algorithmic strategy for alignment segmentation, which enables us to scale to large instances using reasonable resources. To our knowledge, we provide the unique method that allows producing reproducible correction benchmarks on the latest ultra-long reads (>100 k bases). It is also faster than the current state-of-the-art on other datasets and provides a wider set of metrics to assess the read quality improvement after correction. ELECTOR is available on GitHub (https://github.com/kamimrcht/ELECTOR) and Bioconda.","authors":["Camille Marchet","Pierre Morisse","Lolita Lecompte","Arnaud Lefebvre"],"meta":["March 2020NAR Genomics and Bioinformatics 2(1)","DOI:10.1093/nargab/lqz015"],"references":["330859848_A_comparative_evaluation_of_hybrid_error_correction_methods_for_error-prone_long_reads","326100782_Versatile_genome_assembly_evaluation_with_QUAST-LG","326089087_Hybrid_correction_of_highly_noisy_long_reads_using_a_variable-order_de_Bruijn_graph","322779298_Nanopore_sequencing_and_assembly_of_a_human_genome_with_ultra-long_reads","319883330_MECAT_Fast_mapping_error_correction_and_de_novo_assembly_for_single-molecule_sequencing_reads","315950794_HALC_High_throughput_algorithm_for_long_read_error_correction","333999559_Comparative_assessment_of_long-read_error_correction_software_applied_to_Nanopore_RNA-sequencing_data","325106640_Minimap2_Pairwise_alignment_for_nucleotide_sequences","324098235_Piercing_the_dark_matter_bioinformatics_of_long-range_sequencing_and_mapping","320452786_LRCstats_a_tool_for_evaluating_long_reads_correction_methods"]}