{"id":"337200394_A_comprehensive_study_of_the_rate-distortion_performance_in_MPEG_point_cloud_compression","abstract":"Recent trends in multimedia technologies indicate the need for richer imaging modalities to increase user engagement with the content. Among other alternatives, point clouds denote a viable solution that offers an immersive content representation, as witnessed by current activities in JPEG and MPEG standardization committees. As a result of such efforts, MPEG is at the final stages of drafting an emerging standard for point cloud compression, which we consider as the state-of-the-art. In this study, the entire set of encoders that have been developed in the MPEG committee are assessed through an extensive and rigorous analysis of quality. We initially focus on the assessment of encoding configurations that have been defined by experts in MPEG for their core experiments. Then, two additional experiments are designed and carried to address some of the identified limitations of current approach. As part of the study, state-of-the-art objective quality metrics are benchmarked to assess their capability to predict visual quality of point clouds under a wide range of radically different compression artifacts. To carry the subjective evaluation experiments, a web-based renderer is developed and described. The subjective and objective quality scores along with the rendering software are made publicly available, to facilitate and promote research on the field.","authors":["Evangelos Alexiou","Irene Viola","Tomas Borges","Tiago A. Fonseca"],"meta":["November 2019APSIPA Transactions on Signal and Information Processing 8","DOI:10.1017/ATSIP.2019.20","Project: Point cloud subjective quality assessment"],"references":["333998268_PC-MSDM_A_quality_metric_for_3D_point_clouds","329081439_Dynamic_polygon_clouds_Representation_and_compression_for_VRAR","328913566_Subjective_and_Objective_Quality_Assessment_for_Volumetric_Video_Compression","335538256_Perceptual_Quality_Assessment_of_3d_Point_Clouds","334022835_Point_cloud_quality_evaluation_Towards_a_definition_for_test_conditions","334007181_Exploiting_user_interactivity_in_quality_assessment_of_point_cloud_imaging","329550005_Emerging_MPEG_Standards_for_Point_Cloud_Compression","327513150_Point_Cloud_Quality_Assessment_Metric_Based_on_Angular_Similarity","327513048_Point_cloud_subjective_evaluation_methodology_based_on_reconstructed_surfaces","327513044_A_novel_methodology_for_quality_assessment_of_voxelized_point_clouds"]}