{"id":"337218430_Epidemiology_of_placenta_previa_accreta_a_systematic_review_and_meta-analysis","abstract":"Objective\nTo estimate the prevalence and incidence of placenta previa complicated by placenta accreta spectrum (PAS) and to examine the different criteria being used for the diagnosis.\n\nDesign\nSystematic review and meta-analysis.\n\nData sources\nPubMed, Google Scholar, ClinicalTrials.gov and MEDLINE were searched between August 1982 and September 2018.\n\nEligibility criteria\nStudies reporting on placenta previa complicated by PAS diagnosed in a defined obstetric population.\n\nData extraction and synthesis\nTwo independent reviewers performed the data extraction using a predefined protocol and assessed the risk of bias using the Newcastle-Ottawa scale for observational studies, with difference agreed by consensus. The primary outcomes were overall prevalence of placenta previa, incidence of PAS according to the type of placenta previa and the reported clinical outcomes, including the number of peripartum hysterectomies and direct maternal mortality. The secondary outcomes included the criteria used for the prenatal ultrasound diagnosis of placenta previa and the criteria used to diagnose and grade PAS at birth.\n\nResults\nA total of 258 articles were reviewed and 13 retrospective and 7 prospective studies were included in the analysis, which reported on 587 women with placenta previa and PAS. The meta-analysis indicated a significant (p<0.001) heterogeneity between study estimates for the prevalence of placenta previa, the prevalence of placenta previa with PAS and the incidence of PAS in the placenta previa cohort. The median prevalence of placenta previa was 0.56% (IQR 0.39–1.24) whereas the median prevalence of placenta previa with PAS was 0.07% (IQR 0.05–0.16). The incidence of PAS in women with a placenta previa was 11.10% (IQR 7.65–17.35).\n\nConclusions\nThe high heterogeneity in qualitative and diagnostic data between studies emphasises the need to implement standardised protocols for the diagnoses of both placenta previa and PAS, including the type of placenta previa and grade of villous invasiveness.\n\nPROSPERO registration number\nCRD42017068589","authors":["Eric Jauniaux","Lene Grønbeck","Catey Bunce","Jens Langhoff-Roos"],"meta":["November 2019BMJ Open 9(11):e031193","DOI:10.1136/bmjopen-2019-031193"],"references":["324668132_Complete_Placenta_Previa_Ultrasound_Biometry_and_Surgical_Outcomes","322967223_FIGO_consensus_guidelines_on_placenta_accreta_spectrum_disorders_Nonconservative_surgical_management","322963988_FIGO_consensus_guidelines_on_placenta_accreta_spectrum_disorders_Epidemiology","336326000_Pathophysiology_of_Accreta","331287704_FIGO_consensus_guidelines_on_placenta_accreta_spectrum_disorders_Prenatal_diagnosis_and_screening","329345879_Placenta_Accreta_Spectrum","328572788_Are_women_antenatally_diagnosed_with_abnormally_invasive_placenta_receiving_optimal_management_in_England_An_observational_study_of_planned_place_of_delivery","327798869_Association_of_Implementing_a_Multidisciplinary_Team_Approach_in_the_Management_of_Morbidly_Adherent_Placenta_With_Maternal_Morbidity_and_Mortality","324605287_Placenta_Accreta_Spectrum","321759575_Abnormally_adherent_and_invasive_placenta_A_spectrum_disorder_in_need_of_a_name"]}