{"id":"337354870_Ferroelectric_ternary_content-addressable_memory_for_one-shot_learning","abstract":"Deep neural networks are efficient at learning from large sets of labelled data, but struggle to adapt to previously unseen data. In pursuit of generalized artificial intelligence, one approach is to augment neural networks with an attentional memory so that they can draw on already learnt knowledge patterns and adapt to new but similar tasks. In current implementations of such memory augmented neural networks (MANNs), the content of a network’s memory is typically transferred from the memory to the compute unit (a central processing unit or graphics processing unit) to calculate similarity or distance norms. The processing unit hardware incurs substantial energy and latency penalties associated with transferring the data from the memory and updating the data at random memory addresses. Here, we show that ternary content-addressable memories (TCAMs) can be used as attentional memories, in which the distance between a query vector and each stored entry is computed within the memory itself, thus avoiding data transfer. Our compact and energy-efficient TCAM cell is based on two ferroelectric field-effect transistors. We evaluate the performance of our ferroelectric TCAM array prototype for one- and few-shot learning applications. When compared with a MANN where cosine distance calculations are performed on a graphics processing unit, the ferroelectric TCAM approach provides a 60-fold reduction in energy and 2,700-fold reduction in latency for a single memory search operation. A compact ternary content-addressable memory cell, which is based on two ferroelectric field-effect transistors, can provide memory augmented neural networks with improved energy and latency performance compared with traditional approaches based on graphics processing units.","authors":["Kai Ni","Xunzhao Yin","Ann Franchesca Balon Laguna","Siddharth Joshi"],"meta":["November 2019Nature Electronics 2(11):521-529","DOI:10.1038/s41928-019-0321-3","Project: HfO2 based FeFET"],"references":["324815462_Critical_Role_of_Interlayer_in_Hf05Zr05O2_Ferroelectric_FET_Nonvolatile_Memory_Performance","333158275_Design_of_Hardware-Friendly_Memory_Enhanced_Neural_Networks","331975997_A_FeFET_based_super-low-power_ultra-fast_embedded_NVM_technology_for_22nm_FDSOI_and_beyond","330584784_SoC_Logic_Compatible_Multi-Bit_FeMFET_Weight_Cell_for_Neuromorphic_Applications","329849196_An_Ultra-dense_2FeFET_TCAM_Design_based_on_a_Multi-Domain_FeFET_Model","328992672_A_Circuit_Compatible_Accurate_Compact_Model_for_Ferroelectric-FETs","327922374_Write_Disturb_in_Ferroelectric_FETs_and_Its_Implication_for_1T-FeFET_AND_Memory_Arrays","326909677_Revisiting_Multi-pass_Scatter_and_Gather_on_GPUs","326019494_Accumulative_Polarization_Reversal_in_Nanoscale_Ferroelectric_Transistors","321868060_A_FeFET_based_super-low-power_ultra-fast_embedded_NVM_technology_for_22nm_FDSOI_and_beyond","316950768_Design_and_benchmarking_of_ferroelectric_FET_based_TCAM","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316902630_Exploring_Hyperdimensional_Associative_Memory"]}