{"id":"337335208_Data-efficient_Co-Adaptation_of_Morphology_and_Behaviour_with_Deep_Reinforcement_Learning","abstract":"Humans and animals are capable of quickly learning new behaviours to solve new tasks. Yet, we often forget that they also rely on a highly specialized morphology that co-adapted with motor control throughout thousands of years. Although compelling, the idea of co-adapting morphology and behaviours in robots is often unfeasible because of the long manufacturing times, and the need to redesign an appropriate controller for each morphology. In this paper, we propose a novel approach to automatically and efficiently co-adapt a robot morphology and its controller. Our approach is based on recent advances in deep reinforcement learning, and specifically the soft actor critic algorithm. Key to our approach is the possibility of leveraging previously tested morphologies and behaviors to estimate the performance of new candidate morphologies. As such, we can make full use of the information available for making more informed decisions, with the ultimate goal of achieving a more data-efficient co-adaptation (i.e., reducing the number of morphologies and behaviors tested). Simulated experiments show that our approach requires drastically less design prototypes to find good morphology-behaviour combinations, making this method particularly suitable for future co-adaptation of robot designs in the real world.","authors":["Kevin Sebastian Luck","Heni Ben Amor","Roberto Calandra"],"meta":["November 2019","Conference: Conference on Robot Learning 2019"],"references":["326165961_Real-world_evolution_adapts_robot_morphology_and_control_to_hardware_limitations","318449843_Bio-inspired_Robot_Design_Considering_Load-Bearing_and_Kinematic_Ontogeny_of_Chelonioidea_Sea_Turtles","317276874_From_the_Lab_to_the_Desert_Fast_Prototyping_and_Learning_of_Robot_Locomotion","299594676_Novelty-Based_Evolutionary_Design_of_Morphing_Underwater_Robots","337092274_Reinforcement_Learning_for_Improving_Agent_Design","335142524_Data-efficient_Learning_of_Morphology_and_Controller_for_a_Microrobot","335140207_Jointly_Learning_to_Construct_and_Control_Agents_using_Deep_Reinforcement_Learning","297537589_Particle_Swarm_Optimization_for_Single_Objective_Continuous_Space_Problems_A_Review","279964320_Simple_statistical_gradient-following_algorithms_for_connectionist_reinforcement_learning","270741140_Design_Principles_for_Energy-Efficient_Legged_Locomotion_and_Implementation_on_the_MIT_Cheetah_Robot"]}