{"id":"337363063_A_state-of-the-art_survey_of_Digital_Twin_techniques_engineering_product_lifecycle_management_and_business_innovation_perspectives","abstract":"With the rapid advancement of cyber-physical systems, Digital Twin (DT) is gaining ever-increasing attention owing to its great capabilities to realize Industry 4.0. Enterprises from different fields are taking advantage of its ability to simulate real-time working conditions and perform intelligent decision-making, where a cost-effective solution can be readily delivered to meet individual stakeholder demands. As a hot topic, many approaches have been designed and implemented to date. However , most approaches today lack a comprehensive review to examine DT benefits by considering both engineering product lifecycle management and business innovation as a whole. To fill this gap, this work conducts a state-of-the art survey of DT by selecting 123 representative items together with 22 supplementary works to address those two perspectives, while considering technical aspects as a fundamental. The systematic review further identifies eight future perspectives for DT, including modular DT, modeling consistency and accuracy, incorporation of Big Data analytics in DT models, DT simulation improvements, VR integration into DT, expansion of DT domains, efficient mapping of cyber-physical data and cloud/ edge computing integration. This work sets out to be a guide to the status of DT development and application in today's academic and industrial environment.","authors":["Kendrik Yan Hong Lim","Pai Zheng","Chun-Hsien Chen"],"meta":["August 2020Journal of Intelligent Manufacturing","DOI:10.1007/s10845-019-01512-w","Project: Digital twin-enabled engineering solution development (funded by A*STAR & NTU, Singapore and PolyU, Hong Kong)"],"references":["341251035_Customer_experience_challenges_bringing_together_digital_physical_and_social_realms","335057699_Digital_Twin-driven_smart_manufacturing_Connotation_reference_model_applications_and_research_issues","334408169_Digital_Twin-Based_Optimization_for_Ultraprecision_Motion_Systems_With_Backlash_and_Friction","334113041_From_the_Cyber-Physical_System_to_the_Digital_Twin_the_process_development_for_behaviour_modelling_of_a_Cyber_Guided_Vehicle_in_M2M_logic","345078627_Digital_Twin_in_Industry_State-of-the-Art","338970306_A_digital_twin-driven_approach_for_the_assembly-commissioning_of_high_precision_products","336185375_Digital_twins_probe_into_food_cooling_and_biochemical_quality_changes_for_reducing_losses_in_refrigerated_supply_chains","335218964_A_proactive_material_handling_method_for_CPS_enabled_shop-floor","335106654_The_'How'_of_Benefits_Management_for_Digital_Technology_From_Engineering_to_Asset_Management","334841006_Data-driven_ship_digital_twin_for_estimating_the_speed_loss_caused_by_the_marine_fouling"]}