{"id":"337382930_Changes_in_students'_mental_models_from_computational_modeling_of_gene_regulatory_networks","abstract":"Background\nComputational modeling is an increasingly common practice for disciplinary experts and therefore necessitates integration into science curricula. Computational models afford an opportunity for students to investigate the dynamics of biological systems, but there is significant gap in our knowledge of how these activities impact student knowledge of the structures, relationships, and dynamics of the system. We investigated how a computational modeling activity affected introductory biology students’ mental models of a prokaryotic gene regulatory system (lac operon) by analyzing conceptual models created before and after the activity.\n\nResults\nStudents’ pre-lesson conceptual models consisted of provided, system-general structures (e.g., activator, repressor) connected with predominantly incorrect relationships, representing an incomplete mental model of gene regulation. Students’ post-lesson conceptual models included more context-specific structures (e.g., cAMP, lac repressor) and increased in total number of structures and relationships. Student conceptual models also included higher quality relationships among structures, indicating they learned about these context-specific structures through integration with their expanding mental model rather than in isolation.\n\nConclusions\nStudent mental models meshed structures in a manner indicative of knowledge accretion while they were productively re-constructing their understanding of gene regulation. Conceptual models can inform instructors about how students are relating system structures and whether students are developing more sophisticated models of system-general and system-specific dynamics.","authors":["Joseph T Dauer","Heather Bergan-Roller","Gretchen Perkins King","McKenzie Kjose"],"meta":["November 2019International Journal of STEM Education 6(1)","DOI:10.1186/s40594-019-0193-0"],"references":["334105379_Models_and_modelling_for_authentic_STEM_education_reinforcing_the_argument","328820416_Using_concept_maps_to_characterise_cellular_respiration_knowledge_in_undergraduate_students","312317058_Model-based_learning_a_synthesis_of_theory_and_research","306020245_A_framework_for_understanding_the_characteristics_of_complexity_in_biology","305119086_A_Rule_of_Five_Framework_for_Models_and_Modeling_to_Unify_Mathematicians_and_Biologists_and_Improve_Student_Learning","331640686_Discovering_Prokaryotic_Gene_Regulation_by_Building_and_Investigating_a_Computational_Model_of_the_lac_Operon","329514169_Brain_activations_associated_with_scientific_reasoning_a_literature_review","326040223_Framework_for_Teaching_Models_and_Modeling_1_A_Rule-of-Five_Framework_for_Models_and_Modeling_to_Unify_Mathematicians_and_Biologists_and_Improve_Student_Learning","324554449_Should_students_design_or_interact_with_models_Using_the_Bifocal_Modelling_Framework_to_investigate_model_construction_in_high_school_science","323424582_Statistical_power_analysis_for_the_behavioral_sciences"]}