{"id":"337301125_Dynamic_imaging_of_a_capillary-gravity_wave_in_shallow_water_using_amplitude_variations_of_eigenbeams","abstract":"Dynamic acoustic imaging of a surface wave propagating at an air–water interface is a complex task that is investigated here at the laboratory scale through an ultrasonic experiment in a shallow water waveguide. Using a double beamforming algorithm between two source–receiver arrays, the authors isolate and identify each multi-reverberated eigenbeam that interacts with the air–water and bottom interfaces. The waveguide transfer matrix is recorded 100 times per second while a low-amplitude gravity wave is generated by laser-induced breakdown at the middle of the waveguide, just above the water surface. The controlled, and therefore repeatable, breakdown results in a blast wave that interacts with the air–water interface, which creates ripples at the surface that propagate in both directions. The amplitude perturbations of each ultrasonic eigenbeam are measured during the propagation of the gravity-capillary wave. Inversion of the surface deformation is performed from the amplitude variations of the eigenbeams using a diffraction-based sensitivity kernel approach. The accurate ultrasonic imaging of the displacement of the air–water interface is compared to simultaneous measurements with an optical camera, which provides independent validation.","authors":["Tobias van Baarsel","Philippe Roux","Jerome Mars","Julien Bonnel"],"meta":["November 2019The Journal of the Acoustical Society of America 146(5):3353-3361","DOI:10.1121/1.5132939"],"references":["285385466_Droplet_impact_on_deep_liquid_pools_Rayleigh_jet_to_formation_of_secondary_droplets","264933254_Inverting_for_a_deterministic_surface_gravity_wave_using_he_sensitivity_kernel_approach","233899638_Deterministic_forward_scatter_from_surface_gravity_waves","221780501_Sensitivity_kernel_for_surface_scattering_in_a_waveguide","253778935_Image_sequence_analysis_of_water_surface_waves_in_a_hydraulic_wind_wave_tank","241617171_Reflection_and_Refraction_of_Mechanical_Waves_at_Solid-Liquid_Boundaries_II","239644775_First_Born_and_Rytov_approximations_Modeling_and_inversion_conditions_in_a_canonical_example","230860683_Reconstructing_surface_wave_profiles_from_reflected_acoustic_pulses","224539884_Reflection_and_Refraction_of_Mechanical_Waves_at_Solid-Liquid_Boundaries","223164859_Boundary_scattering_limitations_to_fish_detection_in_shallow_waters"]}