{"id":"337361087_Roles_Collaboration_and_the_Development_of_Computational_Thinking_in_a_Robotics_Learning_Environment","abstract":"Robotics is a robust vehicle for supporting the development of computational thinking in students. Educational robotics activities unfold in a multidimensional problem space that requires the integration of programming, building, and environmental aspects of the activity. Students working collaboratively with robotics have the opportunity to adopt roles within the group that are aligned to these multiple dimensions (e.g., programmer, builder, and analyst). Group roles are an important element of all collaborative learning, but especially in a Computer-Supported Collaborative Learning (CSCL) environment, as the roles help to regulate group activity and learning. In this observational, microgenetic case study, we investigated the relationship of the roles middle school-aged girls adopted to the collaborative interactions they engaged in, and, ultimately to the development of computational thinking evidenced as a result of role participation. The video and audiotaped data used in this study were collected at a 1-day introduction to robotics workshop for girls. Our mixed methods approach included sequential and qualitative analysis of the behavioral and verbal interactions of two groups of girls (n = 6) who participated in the workshop. Our results indicate that the emergence of distinct roles correlates with periods of collaboration and periods of parallel solo work, which, in turn, had an impact on student’s engagement in computational thinking including solution planning, algorithmic and debugging operations, and the design of the robotic device. Moreover, students who engaged in greater levels of collaboration selected more difficult challenges to solve within the robotics environment. Suggestions for future research are provided.","authors":["P Kevin Keith","Florence R. Sullivan","Duy Pham"],"meta":["May 2019","DOI:10.1007/978-981-13-6528-7_13","In book: Computational Thinking Education (pp.223-245)"],"references":["318352769_The_Creative_Nature_of_Robotics_Activity_Design_and_Problem_Solving","296468022_Robotic_Construction_Kits_as_Computational_Manipulatives_for_Learning_in_the_STEM_Disciplines","274309848_Computational_Thinking","270569931_Playful_Talk_Negotiating_Opportunities_to_Learn_in_Collaborative_Groups","317953561_Mind_in_society_The_development_of_higher_psychological_processes","313390912_Multimedia_Learning_in_Games_Simulations_and_Micro-Worlds_Cambridge_Handbook_of_Multimedia_Learning","312940415_Computational_Thinking_Teacher_Resources","311431117_Project_HOPE_Evaluation_of_Health_Science_Career_Education_Programming_for_Rural_Latino_and_European_Youth","289446280_Metacognition_and_computer-supported_collaborative_learning","267664366_Sequential_Analysis_and_Observational_Methods_for_the_Behavioral_Sciences"]}