{"id":"337301409_O-ADPI_Online_Adaptive_Deep-Packet_Inspector_Using_Mahalanobis_Distance_Map_for_Web_Service_Attacks_Classification","abstract":"Most active research in Host and Network Intrusion Detection Systems are only able to detect attacks on the computer systems and at the network layer, which are not sufficient to counteract SOAP/REST or XML/JSON-related attacks. In dealing with the problem of anomaly detection in web service message datasets, this paper proposes an anomaly detection system called the Online Adaptive Deep-Packet Inspector (O-ADPI) for web service message attacks classification. The proposed approach relies on multiple statistical methods which use Unigram-based Weighting Scheme (UWS) that combines text mining techniques with a set of different statistical criteria for Feature Selection Engine (FSE) to effectively and efficiently explore optimal subspaces in detecting anomalies embedded deep in the high dimensional feature subspaces. We utilize a supervised intrusion detection algorithm based on Mahalanobis Distance Map classifier. As web service attacks can be classified into anomaly and normal, the task of anomaly detection can be modeled as a classification problem. The O-ADPI model was assessed for F-value, true positive rate (TPR), and false positive rate (FPR) in order to evaluate the detection performance of O-ADPI against different type of feature selections engines with corresponding PCs for each message-specific service. The experiments were performed using the REST-IDS Dataset 2015 and the results demonstrated that the proposed O-ADPI model achieved the best results in each message-specific service.","authors":["Mohsen Kakavand","Aida Mustapha","Zhiyuan Tan","Sepideh Foroozan"],"meta":["November 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2953791","Project: O-ADPI: Online Adaptive Deep-Packet Inspector Using Mahalanobis Distance Map for Web Service Attacks Classification"],"references":["298657982_Issues_and_challenges_in_anomaly_intrusion_detection_for_HTTP_web_services","326952268_An_Approach_to_Malicious_Payload_Detection","315617191_An_Adaptive_Intrusion_Detection_and_Prevention_IDIP_Framework_for_Web_Services","313763687_Security_attack_ontology_for_web_services","312210566_Principal_Component_Analysis","300311838_Denial_of_Service_Defence_Appliance_for_Web_Services","285615502_Principle_Component_Analysis","282918331_Online_Anomaly_Detection_Using_Dimensionality_Reduction_Techniques_for_HTTP_Log_Analysis","282507804_Automatic_generation_of_HTTP_intrusion_signatures_by_selective_identification_of_anomalies","269417843_PCkAD_an_unsupervised_intrusion_detection_technique_exploiting_within_payload_n-gram_location_distribution"]}