{"id":"337367093_The_educational_effectiveness_of_serious_games","abstract":"A serious game is a computer application that combines a serious intention of a pedagogical, informative and a communicational type with playful springs of the video game (want to win, collaboration, competition, strategy). This two-dimensional approach has transformed the game from a simple means of entertainment to a robust-integrated tool growing in the world of training and learning. Serious games include the engagement of video games with the worlds of educational and computer simulation to integrate the user in a safe and entertaining learning environment. Many techniques have been used to ameliorate computer graphics and technology in the last few years to make this type of game more adaptive to the learning context. In this study, we are interested in presenting the pedagogical contributions of serious games as well as the different possible approaches of their integration in a learning situation and this is based on a variety of case studies and examples of experimentation. We will start with definitions of other video games that have some valuable characteristics of learning in order to contrast and relate them with serious games. Subsequently, we discuss the definition of serious game and the benefits of its use in education. We will, then, examine approaches to integrate serious games into classrooms with an emphasis on the assets and liabilities of each approach. To finish, we conclude on the trends that will follow the serious games technology in the educational field as well as some recommendations to be taken into consideration in order to better exploit these tools in a pedagogical context.","authors":["Hassen Ben Rebah"],"meta":["November 2019","DOI:10.52358/mm.vi2.97"],"references":["318731494_Introducing_Educational_Games_in_the_Teaching_of_Physics_in_Moroccan_Secondary_Schools","304290583_Serious_mods_A_case_for_modding_in_serious_games_pedagogy","299374272_Math_Games_for_Adolescents","286573155_An_Overview_of_Serious_Games","318494438_Flow_the_psychology_of_optimal_experience","317953505_Situated_learning_Legitimate_peripheral_participation","316856819_Literature_Review_in_Games_and_Learning","315119146_Experiential_Learning","313264739_A_survey_on_adaptive_engine_technology_for_serious_games","312454820_Designing_Gamification_in_the_Right_Way"]}