{"id":"337301227_Experience_report_thinkathon_-_countering_an_'i_got_it_working'_mentality_with_pencil-and-paper_exercises","abstract":"Goal-directed problem-solving labs can lead a student to believe that the most important achievement in a first programming course is to get programs working. This is counter to research indicating that code comprehension is an important developmental step for novice programmers. We observed this in our own CS-0 introductory programming course, and furthermore, that students weren’t making the connection between code comprehension in labs and a final examination that required solutions to pencil-and-paper comprehension and writing exercises, where sound understanding of programming concepts is essential. Realising these deficiencies late in our course, we put on three 3-hour optional revision evenings just days before the exam. Based on a mastery learning philosophy, students were expected to work through a bank of around 200 pencil-and-paper exercises. By comparison with a machine-based hackathon, we called this a Thinkathon. Students completed a pre and post questionnaire about their experience of the Thinkathon. While we find that Thinkathon attendance positively influences final grades, we believe our reflection on the overall experience is of greater value. We report that: respected methods for developing code comprehension may not be enough on their own; novices must exercise their developing skills away from machines; and there are social learning outcomes in programming courses, currently implicit, that we should make explicit.","authors":["Quintin Cutts","Matthew Barr","Mireilla Bikanga Ada","Peter Donaldson"],"meta":["November 2019ACM Inroads 10(4):66-73","DOI:10.1145/3368563"],"references":["329544316_Introductory_Programming_A_Systematic_Literature_Review","311313548_Switching_to_blend-Ed_Effects_of_replacing_the_textbook_with_the_browser_in_an_introductory_computer_programming_course","269696725_Teaching_Tip_The_Flipped_Classroom","262208722_Helping_first_year_novice_programming_students_PASS","262160581_Parson's_programming_puzzles_A_fun_and_effective_learning_tool_for_first_programming_courses","344812613_Weekly_Programs_in_a_CS1_Class_Experiences_with_Auto-graded_Many-small_Programs_MSP","330431476_A_Robust_Machine_Learning_Technique_to_Predict_Low-performing_Students","319908427_Peer_Instruction","292409618_The_completion_strategy_in_programming_instruction_Theoretical_and_empirical_support","284205635_The_beauty_and_joy_of_computing"]}