{"id":"337324623_Integrating_Professional_Tools_in_Programming_Education_with_MOOCs","abstract":"An increasing number of high school teachers use existing Massive Open Online Courses (MOOCs) concerning programming education. Most MOOCs focus on teaching the basics of a programming language and common concepts or patterns. MOOC platforms usually provide their own code execution environments and thus have full control over the features and appearance available to learners. However, only a subset of tools available to professional software engineers is used in introductory programming MOOCs. While the reduction of features is helpful to ease navigation for novices, we assume that learners benefit from more advanced features at a later stage in the learning process. To help students minimize bugs and conceptual mistakes, we intend to evaluate how pair programming could be enabled for remote peers in MOOCs with a synchronized editor and an additional communication channel. Further, we plan to use static program analysis to get more insights about the code written by learners and to provide early feedback about the coding style. One of our contributions will be to identify possibilities to integrate professional tools and methods in MOOCs supported by an evaluation from learners.","authors":["Sebastian Serth"],"meta":["October 2019","DOI:10.1109/FIE43999.2019.9028643","Conference: 2019 IEEE Frontiers in Education Conference (FIE)At: Cincinnati, OH","Projects: Knowledge and Learning Engineering (openHPI, tele-TASK, HPI Schul-Cloud)The HPI MOOC Platform"],"references":["301498966_CodeOcean_-_A_Versatile_Platform_for_Practical_Programming_Excercises_in_Online_Environments","259695492_Automated_formative_feedback_and_summative_assessment_using_individualized_spreadsheet_assignments","221538009_Improving_the_CS1_experience_with_pair_programming","221536782_The_effects_of_pair-programming_on_performance_in_an_introductory_programming_course","337324599_Evaluating_Digital_Worksheets_with_Interactive_Programming_Exercises_for_K-12_Education","334240743_Why_Am_I_Even_Doing_This_The_Experiences_of_Female_Students_in_CS_from_an_Insider_Perspective","325862259_Effects_of_Automated_Interventions_in_Programming_Assignments_Evidence_from_a_Field_Experiment","322409003_Video_conferencing_as_a_peephole_to_MOOC_participants_Understanding_struggling_students_and_uncovering_content_defects","282053627_PeerStudio_Rapid_Peer_Feedback_Emphasizes_Revision_and_Improves_Performance","262262758_Effectiveness_of_virtual_reality-based_instruction_on_students'_learning_outcomes_in_K-12_and_higher_education_A_meta-analysis"]}