{"id":"337386049_Levels_of_Abstraction_in_Students'_Mathematics_Strategies_What_Can_Applying_Computer_Science_Ideas_about_Abstraction_Bring_to_Elementary_Mathematics","abstract":"Moving among levels of abstraction is an important skill in mathematics and computer science, and students show simi- lar difficulties when applying abstraction in each discipline. While computer science educators have examined ways to explicitly teach students how to consciously navigate levels of abstraction, these ideas have not been explored in math- ematics education. In this study, we examined elementary students’ solutions to a commonplace mathematics task to determine whether and how students moved among levels of abstraction as they solved the task. Furthermore, we ana- lyzed student errors, categorizing them according to whether they related to moves among levels of abstraction or to purely mathematical steps. Our analysis showed: (1) students im- plicitly shift among levels of abstraction when solving “real- world” mathematics problems; (2) students make errors when making those implicit shifts in abstraction level; (3) the errors students make in abstraction outnumber the errors they make in purely mathematical skills. We discuss the implications for these findings, arguing they establish that there are oppor- tunities for explicit instruction in abstraction in elementary mathematics, and that students’ overall mathematics achieve- ment and problem-solving skills have the potential to benefit from applying these computer-science ideas to mathematics instruction.","authors":["Kathryn M. Rich","Aman Yadav","Marissa Zhu"],"meta":["January 2019","Project: CT4EDU"],"references":["337386137_Computational_Thinking_Mathematics_and_Science_Elementary_Teachers'_Perspectives_on_Integration","227186430_Reducing_Abstraction_The_Case_of_School_Mathematics","332818564_Synergies_and_differences_in_mathematical_and_computational_thinking_implications_for_integrated_instruction","309379438_Teaching_Abstract_Thinking_in_Introduction_to_Computer_Science_for_7th_Graders","298972577_On_teaching_abstraction_in_computer_science_to_novices","271814082_Teaching_Realistic_Mathematical_Modeling_in_the_Elementary_School_A_Teaching_Experiment_with_Fifth_Graders","248498059_Modelling_reality_in_mathematics_classrooms_The_case_of_word_problems","238676527_The_Pattern_On_the_Stone","229027628_How_Students_Attempt_to_Reduce_Abstraction_in_the_Learning_of_Mathematics_and_in_the_Learning_of_Computer_Science","227024973_Impact_of_authenticity_on_sense_making_in_word_problem_solving"]}