{"id":"337394593_New_Fair_Multiparty_Quantum_Key_Agreement_Secure_against_Collusive_Attacks","abstract":"Fairness is an important standard needed to be considered in a secure quantum key agreement (QKA) protocol. However, it found that most of the quantum key agreement protocols in the travelling model are not fair, i.e., some of the dishonest participants can collaborate to predetermine the final key without being detected. Thus, how to construct a fair and secure key agreement protocol has obtained much attention. In this paper, a new fair multiparty QKA protocol that can resist the collusive attack is proposed. More specifically, we show that in a client-server scenario, it is possible for the clients to share a key and reveal nothing about what key has been agreed upon to the server. The server prepares quantum states for clients to encode messages to avoid the participants’ collusive attack. This construction improves on previous work, which requires either preparing multiple quantum resources by clients or two-way quantum communication. It is proven that the protocol does not reveal to any eavesdropper, including the server, what key has been agreed upon, and the dishonest participants can be prevented from collaborating to predetermine the final key.","authors":["Zhiwei Sun","Rong Cheng","Chunhui Wu","Cai Zhang"],"meta":["November 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-53524-4"],"references":["334752478_Efficient_Multiparty_Quantum_Key_Agreement_With_a_Single_d_-Level_Quantum_System_Secure_Against_Collusive_Attack","321177151_Efficient_multiparty_quantum_key_agreement_with_collective_detection","320583027_Experimental_long-distance_quantum_secure_direct_communication","318795143_Multi-party_Semi-quantum_Key_Agreement_with_Delegating_Quantum_Computation","315596605_Multiparty_Quantum_Key_Agreement_Based_on_Quantum_Search_Algorithm","308744265_Quantum_Secure_Direct_Communication_with_Quantum_Memory","301880421_Multiparty_quantum_key_agreement_protocol_secure_against_collusion_attacks","326503184_Three-step_three-party_quantum_secure_direct_communication","320724489_High-capacity_quantum_secure_direct_communication_with_two-photon_six-qubit_hyperentangled_states","309436067_Improved_multiparty_quantum_key_agreement_in_travelling_mode"]}