{"id":"337323545_Learning_Sonata_Form_Structure_on_Mozart's_String_Quartets","abstract":"The musical analysis of large-scale structures, such as the classical sonata form, requires to integrate multiple analyses of local musical events into a global coherent analysis. Modelling large-scale structures is still a challenging task for the research community. It includes building large and accurate annotated corpora, as well as developing practical and efficient tools in order to visualize the analyses of these corpora. It finally requires the conception of effective and properly evaluated MIR algorithms. We propose a machine learning approach for the sonata form structure on 32 movements from Mozart’s string quartets. We release an open dataset, encoding two reference analyses of these 32 movements, totaling more than 1800 curated annotations, as well as flexible visualizations of these analyses. We discuss the occurrence in this corpus of melodic, harmonic, and rhythmic features induced by pitches, durations, and rests. We investigate whether the presence or the absence of these features can be characteristic of the different sections forming a sonata form. We then compute the emission and transition probabilities of several Hidden Markov Models intended to match the structure of sonata forms at several resolutions. Our results confirm that the sonata form is better identified when the parameters are learned rather than manually set up. These results open perspectives on the computational analysis of musical forms by mixing human knowledge and machine learning from annotated scores.","authors":["Pierre Allegraud","Louis Bigo","Laurent Feisthauer","Mathieu Giraud"],"meta":["December 2019Transactions of the International Society for Music Information Retrieval 2(1)","DOI:10.5334/tismir.27","Project: Algomus - Algorithmic Musicology"],"references":["332014161_SKETCHING_SONATA_FORM_STRUCTURE_IN_SELECTED_CLASSICAL_STRING_QUARTETS","322709577_Of_Beginnings_and_Ends","319054140_MorpheuS_Generating_Structured_Music_with_Constrained_Patterns_and_Tension","309575073_ImproteK_Introducing_Scenarios_into_Human-Computer_Music_Improvisation","303667587_Automated_methods_for_analyzing_music_recordings_in_sonata_form","303667504_Quantifying_and_Visualizing_Tonal_Complexity","331245126_Musical_Form_Forms_Formenlehre_-_paperback_Three_Methodological_Reflections","324393376_A_Generative_Theory_of_Tonal_Music","324392493_Sonata_Forms","315529585_A_Two-Layer_Approach_for_Multi-Track_Segmentation_of_Symbolic_Music"]}