{"id":"337357784_Dynamics_of_reverse_annealing_for_the_fully_connected_p_-spin_model","abstract":"Reverse annealing is a relatively new variant of quantum annealing in which one starts from a classical state and increases and then decreases the amplitude of the transverse field, in the hope of finding a better classical state than the initial state for a given optimization problem. We numerically study the unitary quantum dynamics of reverse annealing for the mean-field-type p-spin model and show that the results are consistent with the predictions of equilibrium statistical mechanics. In particular, we corroborate the equilibrium analysis prediction that reverse annealing provides an exponential speedup over conventional quantum annealing in terms of solving the p-spin model. This lends support to the expectation that equilibrium analyses are effective at revealing essential aspects of the dynamics of quantum annealing. We also compare the results of quantum dynamics with the corresponding classical dynamics to reveal their similarities and differences. We distinguish between two reverse annealing protocols we call adiabatic and iterated reverse annealing. We further show that iterated reverse annealing, as has been realized in the D-Wave device, is ineffective in the case of the p-spin model but note that a recently introduced protocol (“h-gain”), which implements adiabatic reverse annealing, may lead to improved performance.","authors":["Yu Yamashiro","Masaki Ohkuwa","Hidetoshi Nishimori","Daniel Lidar"],"meta":["November 2019","DOI:10.1103/PhysRevA.100.052321"],"references":["334204595_Improving_quantum_annealing_of_the_ferromagnetic_p-spin_model_through_pausing","333497058_A_double-slit_proposal_for_quantum_annealing","332685471_Reverse_quantum_annealing_approach_to_portfolio_optimization_problems","326495873_Demonstration_of_a_Scaling_Advantage_for_a_Quantum_Annealer_over_Simulated_Annealing","323597968_Observation_of_topological_phenomena_in_a_programmable_lattice_of_1800_qubits","322674686_Dissipative_environment_may_improve_the_quantum_annealing_performances_of_the_ferromagnetic_p_-spin_model","332660327_Power_of_Pausing_Advancing_Understanding_of_Thermalization_in_Experimental_Quantum_Annealers","327007847_Reverse_annealing_for_the_fully_connected_p_-spin_model","322781740_Adiabatic_quantum_computation","309766414_Necessary_Adiabatic_Run_Times_in_Quantum_Optimization"]}