{"id":"337304833_Falla_Immaterial_Qubit_computacio_quantica_en_Falles_2019","abstract":"Tradició i avanguarda, cultura festiva i científica, art i tecnologia: en ocasions aquests conceptes se superposen o s’entrellacen en iniciatives que apropen la ciutadania a les fronteres del coneixement.\n\nEl projecte Falla Immaterial | Qubit, impulsat des de l'Escola Tècnica Superior d'Enginyeria (ETSE-UV) de la Universitat de València (UV) des del Campus de Burjassot-Paterna, és un projecte de ciencia ciutadana que mostra el paper de les noves tecnologies i de l'anàlisi de dades en esdeveniments festius de caràcter massiu, al mateix temps que ens permet prendre consciència de la imatge col·lectiva que projectem a través de la nostra presència en les xarxes socials.\n\nEn la seua tercera edició, el projecte fa servir l’enginyeria i la ciència de dades per a parlar dels nous avanços en computació quàntica. Amb el nom de Qubit (bit quàntic), aquesta proposta de disseminació és apta per a tots els públics i invita a viure una experiència quàntica aquestes Falles.\n\nPer a aconseguir-ho, el Centre Cultural La Nau de la Universitat de València ha obert al públic una instal·lació multimèdia interactiva (un cub de grans dimensions) inspirada en dos propietats bàsiques de la mecànica quàntica: la superposició i l’entrellaçament. A més a més, el lloc web fallaimmaterial.com permet explorar un qubit en 3D que mostra l’imaginari gràfic de la festa a través de les fotos compartides per les xarxes socials, les quals han estat capturades i tractades amb tècniques informàtiques i de la intel·ligència artificial.\n\nA més a més, la Falla Immaterial ha complementat els seus ‘qubits’ físic i virtual amb diferents activitats culturals i amb continguts proporcionats a través del seu perfil en les xarxes socials: @fallaimmaterial. En particular, el projecte va organitzar dos activitats obertes per a qui volguera saber més de computació quàntica: un Bar de Ciències sobre computació i mecànica quàntica que tindrà lloc el dia 12 de març (19h) a l’Octubre Centre de Cultura Contemporània i un especial sobre quàntica del programa de ràdio A Ciencia Cierta en CV Ràdio. D’altra banda, l’EMT de València fa difusió del projecte a través dels seus autobusos i un equip d’animació de carrer està present en les mascletades per a realitzar accions de dinamització, repartir regals i convidar a la gent a participar en el projecte.\n\nAlgunes dades ressenyables d’quest projecte és que al llarg dels tres anys de vida s’han produït més de dos milions d’interaccions a través de la web, s’han arreplegat més de 400 mil missatges, s’ha format una comunitat amb més de 4 mil seguidors i han hagut més d’11 mil participants que escriuen en més de 30 llengües diferents els seus missatges.\n\nAquest projecte va nàixer al 2017, any que passarà a la història com aquel en què les Falles de València van ser declarades Patrimoni Immaterial de la Humanitat per la Unesco, però també com l'any en què es va erigir i va cremar la primera falla de la història construïda mitjançant algorismes d'Intel·ligència Artificial: la Falla Immaterial.\n\nL’any 2018 la Falla Immaterial va evolucionar en la seua segona edició emprant altres tècniques d'intel·ligència artificial, com el processament del llenguatge natural i la visualització de dades, que serviren com a termòmetre social de tot allò que se parlava per les xarxes socials d'una festa massiva com les Falles. La novetat de la segona edició radicava principalment en la captura de tendències i patrons de comportament emprant mètodes de rànquing prenent com a base l'anàlisi de textos de les xarxes socials per a construir monuments fets amb paraules i imatges que reflecteixen el sentir dels ciutadans sobre les Falles, els seus pensaments i sentiments.\n\nL’equip que lidera el desenvolupament de La Falla Immaterial està format per: Francisco Grimaldo (direcció); Emilia López-Iñesta i Emilio Soria (gestió i anàlisi de dades); Daniel García (programació); Alejandro Casasús (disseny).","authors":["Francisco Grimaldo","Emilia López-Iñesta"],"meta":["March 2019","Project: Citizen Science"],"references":[]}