{"id":"337394921_Pathways_to_cellular_supremacy_in_biocomputing","abstract":"Synthetic biology uses living cells as the substrate for performing human-defined computations. Many current implementations of cellular computing are based on the “genetic circuit” metaphor, an approximation of the operation of silicon-based computers. Although this conceptual mapping has been relatively successful, we argue that it fundamentally limits the types of computation that may be engineered inside the cell, and fails to exploit the rich and diverse functionality available in natural living systems. We propose the notion of “cellular supremacy” to focus attention on domains in which biocomputing might offer superior performance over traditional computers. We consider potential pathways toward cellular supremacy, and suggest application areas in which it may be found. Synthetic biology uses cells as its computing substrate, often based on the genetic circuit concept. In this Perspective, the authors argue that existing synthetic biology approaches based on classical models of computation limit the potential of biocomputing, and propose that living organisms have under-exploited capabilities.","authors":["Lewis Grozinger","Martyn Amos","Thomas E. Gorochowski","Pablo Carbonell"],"meta":["December 2019Nature Communications 10(1)","DOI:10.1038/s41467-019-13232-z"],"references":["335444702_Metabolic_perceptrons_for_neural_computing_in_biological_systems","334458997_Stochastic_modelling_reveals_mechanisms_of_metabolic_heterogeneity","333886796_A_universal_biomolecular_integral_feedback_controller_for_robust_perfect_adaptation","333133929_Arabidopsis_plants_perform_arithmetic_division_to_prevent_starvation_at_night","332581700_Bacterial_chemotaxis_in_a_microfluidic_T-maze_reveals_strong_phenotypic_heterogeneity_in_chemotactic_sensitivity","344484944_Randomized_Algorithms","335073170_Cell-Free_Prototyping_of_AND-Logic_Gates_Based_on_Heterogeneous_RNA_Activators","333629624_Is_the_Cell_Really_a_Machine","333504113_Growth_Defects_and_Loss-of-Function_in_Synthetic_Gene_Circuits","332926463_What_are_the_signatures_of_tunnelling_in_enzyme-catalysed_reactions"]}