{"id":"337386137_Computational_Thinking_Mathematics_and_Science_Elementary_Teachers'_Perspectives_on_Integration","abstract":"In order to create professional development experiences, curriculum materials, and policies that support elementary school teachers to embed computational thinking (CT) in their teaching, researchers and teacher educators must understand ways teachers see CT as connecting to their classroom practices. Taking the viewpoint that teachers' initial ideas about CT can serve as useful resources on which to build educational experiences, we interviewed 12 elementary school teachers to probe their understanding of six components of CT (abstraction, algorithmic thinking, automation, debug-ging, decomposition, and generalization) and how those components relate to their math and science teaching. Results suggested that teachers saw stronger connections between CT and their mathematics instruction than between CT and their science instruction. We also found that teachers draw upon their existing knowledge of CT-related terminology to make connections to their math and science instruction that could be leveraged in professional development. Teachers were, however, concerned about bringing CT into teaching due to limited class time and the difficulties of addressing high level CT in developmentally appropriate ways. We discuss these results and their implications future research and the design of professional development, sharing examples of how we used teachers' initial ideas as the foundation of a workshop introducing them to computational thinking.","authors":["Kathryn M. Rich","Aman Yadav","Christine Virginia Schwarz"],"meta":["January 2019Journal of Technology and Teacher Education 27(2):165-205"],"references":["329810858_Computational_thinking_in_elementary_classrooms_measuring_teacher_understanding_of_computational_ideas_for_teaching_science","327026270_Computational_Thinking_in_K-12_In-service_Teacher_Perceptions_of_Computational_Thinking_Foundations_and_Research_Highlights","319134073_Understanding_the_Teacher_Experience_in_Primary_and_Secondary_CS_Professional_Development","316446592_Computational_Thinking_in_Teacher_Education","315636456_Computational_thinking_for_teacher_education","312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","332818564_Synergies_and_differences_in_mathematical_and_computational_thinking_implications_for_integrated_instruction","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","317158625_Remaining_trouble_spots_with_computational_thinking","316945953_From_Professional_Development_to_the_Classroom_Findings_from_CS_K-12_Teachers"]}