{"id":"337301358_Predicting_Social_Image_Popularity_Dynamics_at_Time_Zero","abstract":"This work addresses the task of forecasting the popularity achieved by images shared through social media over time. This task is known as “Popularity Dynamic Prediction”. The work is motivated by the fact that the popularity of social images, which is usually estimated at a precise instant of the post lifecycle, could be affected by the period of the post (i.e., how old is the post). To this aim, we exploited a recently released dataset for popularity dynamic prediction that includes about 20.000 images uploaded on Flickr and their sequences of engagement scores (i.e., number of views, number of comments and number of favorites) with a daily granularity. To build such a dataset, each image and its accompanying meta-data and statistics are downloaded within a few hours from the image posting on the social platform. Then, an automatic procedure collected the daily engagement scores of each observed picture for 30 days. The paper presents an approach in which the engagement score is formulated as a composition of two information associated to the evolution over time (shape) and the order of magnitude (scale) of the sequence. The two properties are inferred individually, then the two results are combined to predict the popularity dynamics over n days. This paper presents exhaustive experiments on the addressed task, evaluating a large number of experimental settings for the predictions of popularity sequences with different length n (n = 10, 20 or 30). In all settings, the prediction performed by the proposed method can be computed before the image is posted (i.e., at time zero).","authors":["Alessandro Ortis","Giovanni Maria Farinella","Sebastiano Battiato"],"meta":["November 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2953856"],"references":["325833366_Popularity_prediction_of_images_and_videos_on_Instagram","318829699_Sequential_Prediction_of_Social_Media_Popularity_with_Deep_Temporal_Context_Networks","315473268_On_the_Prediction_of_Flickr_Image_Popularity_by_Analyzing_Heterogeneous_Social_Sensory_Data","314194570_Prediction_of_image_popularity_over_time_on_social_media_networks","311488678_Image_Popularity_Prediction_in_Social_Media_Using_Sentiment_and_Context_Features","335187302_An_Overview_on_Image_Sentiment_Analysis_Methods_Datasets_and_Current_Challenges","323502203_A_Vocabulary_for_Growth_Topic_Modeling_of_Content_Popularity_Evolution","320543639_A_Hybrid_Model_Combining_Convolutional_Neural_Network_with_XGBoost_for_Predicting_Social_Media_Popularity","320360527_A_Classification_Engine_for_Image_Ballistics_of_Social_Data","310819809_Time_Matters_Multi-scale_Temporalization_of_Social_Media_Popularity"]}