{"id":"337433435_After_you_please_browser_extensions_order_attacks_and_countermeasures","abstract":"Browser extensions are small applications executed in the browser context that provide additional capabilities and enrich the user experience while surfing the web. The acceptance of extensions in current browsers is unquestionable. For instance, Chrome’s official extension repository has more than 63,000 extensions, with some of them having more than 10M users. When installed, extensions are pushed into an internal queue within the browser. The order in which each extension executes depends on a number of factors, including their relative installation times. In this paper, we demonstrate how this order can be exploited by an unprivileged malicious extension (i.e., one with no more permissions than those already assigned when accessing web content) to get access to any private information that other extensions have previously introduced. We propose a solution that does not require modifying the core browser engine, since it is implemented as another browser extension. We prove that our approach effectively protects the user against usual attackers (i.e., any other installed extension) as well as against strong attackers having access to the effects of all installed extensions (i.e., knowing who did what). We also prove soundness and robustness of our approach under reasonable assumptions.","authors":["Pablo Picazo-Sanchez","Juan Tapiador","Gerardo Schneider"],"meta":["December 2020International Journal of Information Security 19(9)","DOI:10.1007/s10207-019-00481-8","Project: the Swedish funding agency SSF under the grant Data Driven Secure Business Intelligence, the Swedish Research Council (Vetenskapsr ̊adet) under grant Nr. 2015-04154 (PolUser: Rich User-Controlled Privacy Policies)"],"references":["329753522_Latex_Gloves_Protecting_Browser_Extensions_from_Probing_and_Revelation_Attacks","329628618_You_click_I_steal_analyzing_and_detecting_click_hijacking_attacks_in_web_pages","317234716_Include_Me_Out_In-Browser_Detection_of_Malicious_Third-Party_Content_Inclusions","350568191_Sentinel_Securing_Legacy_Firefox_Extensions","340544177_Browser_Fingerprinting_A_Survey","328324253_To_Extend_or_not_to_Extend_On_the_Uniqueness_of_Browser_Extensions_and_Web_Logins","319621761_Watching_Them_Watching_Me_Browser_Extensions_Impact_on_User_Privacy_Awareness_and_Concern","318127514_Revisiting_Browser_Security_in_the_Modern_Era_New_Data-Only_Attacks_and_Defenses","309438929_Understanding_Malvertising_Through_Ad-Injecting_Browser_Extensions","308296371_Colluding_browser_extension_attack_on_user_privacy_and_its_implication_for_web_browsers"]}