{"id":"337492298_Degree_pictures_Visualizing_the_university_student_journey","abstract":"The field of learning analytics is progressing at a rapid rate. New tools, with ever-increasing number of features and a plethora of datasets that are increasingly utilized demonstrate the evolution and multifaceted nature of the field. In particular, the depth and scope of insight that can be gleaned from analysing related datasets can have a significant, and positive, effect in educational practices. We introduce the concept of degree pictures, a symbolic overview of students’ achievement. Degree pictures are small visualizations that depict graphically 16 categories of overall student achievement, over the duration of a higher education course. They offer a quick summary of students’ achievement and are intended to initiate appropriate responses, such as teaching and pastoral interventions. This can address the subjective nature of assessment, by providing a method for educators to calibrate their own marking practices by showing an overview of any cohort. We present a prototype implementation of degree pictures, which was evaluated within our School of Computer Science, with favourable results.","authors":["Cameron Gray","Dave Perkins","Panagiotis D. Ritsos"],"meta":["November 2019Assessment & Evaluation in Higher Education 45(194):1-11","DOI:10.1080/02602938.2019.1676397"],"references":["324385634_A_Sequence_Data_Model_for_Analyzing_Temporal_Patterns_of_Student_Data","324374527_Critical_issues_in_designing_and_implementing_temporal_analytics","318230183_Study_Paths_Riemann_Surfaces_And_Strebel_Differentials","307144398_Implementing_a_Learning_Analytics_Intervention_and_Evaluation_Framework_What_Works","269226394_Mastery_grids_An_open-source_social_educational_progress_visualization","248965698_Marking_and_Moderation_in_the_UK_False_Assumptions_and_Wasted_Resources","302415197_The_Visual_Display_of_Quantitative_Information","271903288_Bias_in_Grading","254462752_The_learning_analytics_cycle_Closing_the_loop_effectively","239059994_The_Visual_Design_and_Control_of_Trellis_Display"]}