{"id":"337401993_Computer_Science_and_Philosophy_In_Search_of_a_Nexus","abstract":"This research aims to map and analyse the nexus between philosophy and computer science: ontological and epistemological, as well as axiological aspects. It is arguably known traditionally that philosophy is regarded as the mother of all rational sciences; However, there has been little hitherto discussion about the connections between the two. On the other side, philosophy is systematic inquiry into human mind and behaviour as well in order to give the meaning in every object of study. For computer scientists, understanding the nexus between philosophy and computer science will advance the ability to think through the consequences of novel ideas and widen the perspective. This study used preliminary bibliographic study using literature research methods, which carried out by investigating various interdisciplinary studies, especially computer science and information technology in terms of philosophy and its branches. The results reveal that there are strong connection between these two disciplines, mainly in ontological, epistemological and axiological aspects. On axiological and ethical aspect, the link is very important, and philosophy has potential role in ethical problem solving that arise from within the academic discipline of computer science.","authors":["U M Ishaaq"],"meta":["November 2019IOP Conference Series Materials Science and Engineering 662(6):062016","DOI:10.1088/1757-899X/662/6/062016"],"references":["317972531_The_Logic_of_Design_as_a_Conceptual_Logic_of_Information","264418839_On_the_Ontology_of_the_Computing_Process_and_the_Epistemology_of_the_Computed","263150657_Epistemological_Issues_Concerning_Computer_Simulations_in_Science_and_Their_Implications_for_Science_Education","350678097_Philosophy_and_Computer_Science","350306111_Logic_for_Gray-code_Computation","303148057_Computer_Science_and_Philosophy","286545163_Ultimacy_and_the_Philosophic_field_of_Metaphysics","275811980_The_Dictionary_of_Philosophy","266044951_George_Boole_Selected_manuscripts_on_logic_and_its_philosophy_Ed_by_Ivor_Grattan-Guinness_and_Gerard_Bornet","254666596_The_Internet_Epistemology_and_Ontology","228647993_What_does_it_mean_to_Know_Computer_Science_Perspectives_from_Gender_Research","247838396_The_Digital_Phoenix_How_Computers_Are_Changing_Philosophy","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","235720353_A_Translational_Approach_to_Portable_Ontologies","235223156_The_Cambridge_Handbook_of_Information_and_Computer_Ethics"]}