{"id":"337496159_Accurate_Calibration_Scheme_for_a_Multi-Camera_Mobile_Mapping_System","abstract":"Mobile mapping systems (MMS) are increasingly used for many photogrammetric and computer vision applications, especially encouraged by the fast and accurate geospatial data generation. The accuracy of point position in an MMS is mainly dependent on the quality of calibration, accuracy of sensor synchronization, accuracy of georeferencing and stability of geometric configuration of space intersections. In this study, we focus on multi-camera calibration (interior and relative orientation parameter estimation) and MMS calibration (mounting parameter estimation). The objective of this study was to develop a practical scheme for rigorous and accurate system calibration of a photogrammetric mapping station equipped with a multi-projective camera (MPC) and a global navigation satellite system (GNSS) and inertial measurement unit (IMU) for direct georeferencing. The proposed technique is comprised of two steps. Firstly, interior orientation parameters of each individual camera in an MPC and the relative orientation parameters of each cameras of the MPC with respect to the first camera are estimated. In the second step the offset and misalignment between MPC and GNSS/IMU are estimated. The global accuracy of the proposed method was assessed using independent check points. A correspondence map for a panorama is introduced that provides metric information. Our results highlight that the proposed calibration scheme reaches centimeter-level global accuracy for 3D point positioning. This level of global accuracy demonstrates the feasibility of the proposed technique and has the potential to fit accurate mapping purposes.","authors":["Ehsan Khoramshahi","Mariana Batista Campos","Antonio Maria Garcia Tommaselli","Niko Viljanen"],"meta":["November 2019Remote Sensing 11(23)","DOI:10.3390/rs11232778"],"references":["329600906_Charuco_Board-Based_Omnidirectional_Camera_Calibration_Method","327899663_DEVELOPMENT_OF_A_PORTABLE_HIGH_PERFORMANCE_MOBILE_MAPPING_SYSTEM_USING_THE_ROBOT_OPERATING_SYSTEM","325470809_IMPROVING_SPHERICAL_PHOTOGRAMMETRY_USING_360_OMNI-CAMERAS_USE_CASES_AND_NEW_APPLICATIONS","325468799_PRELIMINARY_EVALUATION_OF_A_COMMERCIAL_360_MULTI-CAMERA_RIG_FOR_PHOTOGRAMMETRIC_PURPOSES","324781477_Design_and_assessment_of_a_360_panoramic_and_high-performance_capture_system_with_two_tiled_catadioptric_imaging_channels","323669512_A_Backpack-Mounted_Omnidirectional_Camera_with_Off-the-Shelf_Navigation_Sensors_for_Mobile_Terrestrial_Mapping_Development_and_Forest_Application","334340804_The_fisheye_lens_and_immersed_optics","325761296_Image_Systems_Simulation_for_360_Camera_Rigs","325158780_Geometric_model_and_assessment_of_a_dual-fisheye_imaging_system","324053389_Boresight_Calibration_of_GNSSINS-Assisted_Push-Broom_Hyperspectral_Scanners_on_UAV_Platforms"]}