{"id":"337487813_Phase_Balancing_and_Reactive_Power_Support_Services_for_Microgrids","abstract":"Alternating current (AC) microgrids are expected to operate as active components within smart distribution grids in the near future. The high penetration of intermittent renewable energy sources and the rapid electrification of the thermal and transportation sectors pose serious challenges that must be addressed by modern distribution system operators. Hence, new solutions should be developed to overcome these issues. Microgrids can be considered as a great candidate for the provision of ancillary services since they are more flexible to coordinate their distributed generation sources and their loads. This paper proposes a method for compensating microgrid power factor and loads asymmetries by utilizing advanced functionalities enabled by grid tied inverters of photovoltaics and energy storage systems. Further, a central controller has been developed for adaptively regulating the provision of both reactive power and phase balancing services according to the measured loading conditions at the microgrid’s point of common coupling. An experimental validation with a laboratory scale inverter and a real time hardware in the loop investigation demonstrates that the provision of such ancillary services by the microgrid can significantly improve the operation of distribution grids in terms of power quality, energy losses and utilization of available capacity.","authors":["Anastasis Charalambous","Lenos Hadjidemetriou","Lazaros Zacharia","Angelina Bintoudi"],"meta":["November 2019Applied Sciences 9(23):5067","DOI:10.3390/app9235067","Project: Design, Development and Demonstration of a future-proof active smart Micro-grid system"],"references":["336087286_Optimal_Energy_Management_and_Scheduling_of_a_Microgrid_in_Grid-Connected_and_Islanded_Modes","331438999_Diversifying_the_Role_of_Distributed_Generation_Grid-Side_Converters_for_Improving_the_Power_Quality_of_Distribution_Networks_Using_Advanced_Control_Techniques","328449217_A_Multi-Functional_Distributed_Generation_Control_Scheme_for_Improving_the_Grid_Power_Quality","328370710_Islanding_and_Resynchronization_Procedure_of_a_University_Campus_Microgrid","328326101_Unbalanced_Current_Sharing_Control_in_Islanded_Low_Voltage_Microgrids","327848811_An_Enhancing_Fault_Current_Limitation_Hybrid_DroopV-f_Control_for_Grid-Tied_Four-Wire_Inverters_in_AC_Microgrids","326054324_Design_factors_for_developing_a_university_campus_microgrid","322202262_Analysis_and_Modeling_of_Interharmonics_From_Grid-Connected_Photovoltaic_Systems","337644423_A_Sensor-less_Control_Scheme_for_Grid_Tied_Inverters_to_Provide_Phase_Balancing_Services_to_the_Distribution_Grid","336086811_Control_Scheme_for_Phase_Balancing_of_Low-Voltage_Distribution_Grids"]}