{"id":"337447900_A_Roadmap_to_the_Development_of_Key_Competencies_of_Engineering_and_Technology_Graduates","abstract":"The world of employment is impacted by major trends that are imposed by the ongoing industrial advances. The changing labor market and the future of work calls for a paradigm shift in teaching and learning to equip graduates with competencies they need for current and future jobs, and in particular, those of the engineering and technology programs. The purpose of this study is to discuss previous work in the subject matter, to outline a set of teaching and learning strategies, and to create a roadmap for main players to work through to arm graduates with the intended competencies skills. To achieve this objective an extensive literature review was carried out to identify what teaching and learning strategies are currently in-place, and what skills are anticipated. However, still, the education institutions not been able to provide the workplace with competent graduates. A proposed set of intended competencies skills along with teaching and learning strategies for properly preparing future engineering and technology graduates was developed; and a roadmap was built to show the roles of college administration, professors and students to ensure an effective way to support students gaining these skills. It is recommended that these sets of strategies including the facilitation of the roles of the main players to be incorporated in the educational programs learning outcomes.","authors":["Arwa Aleryani","Abdullatif A Almunifi"],"meta":["November 2019","DOI:10.3991/ijep.v9i5.11094"],"references":["343785979_Communication_Skills_A-Must-Have_Skills_for_Today's_Leaders","331284537_Knowledge_and_Skills_Level_of_Graduate_Civil_Engineers_Employers_and_Graduates'_Perceptions","326689304_Perceptions_of_factors_that_affect_employability_amongst_a_sample_of_final-year_students_at_a_rural_South_African_university","325891660_Student's_Characteristics_as_a_Basis_for_Competency_Development_in_Engineering_Informatics_Education","325398434_From_Engineer_to_Entrepreneur_-_Entrepreneurship_Education_for_Engineering_Students_The_Case_of_the_Entrepreneurial_Campus_Villach","324906784_Shaping_the_Digital_Future_in_Education_-_Together","324905370_The_Use_of_New_Learning_Technologies_in_Higher_Education_Classroom_A_Case_Study","313654102_Empowering_Engineering_Students_through_Employability_Skills","312470401_Learningteaching_styles_in_engineering_education","321751650_Employability_Skills_among_Information_Technology_Professionals_A_Literature_Review"]}