{"id":"337451082_Integrating_Computational_Thinking_into_Elementary_Science_Curriculum_an_Examination_of_Activities_that_Support_Students'_Computational_Thinking_in_the_Service_of_Disciplinary_Learning","abstract":"Using an example of a grade 3 science unit about population changes during competition for resources, we describe how we integrated computational thinking (CT) into existing curriculum identifying three levels of depth of integration: identifying connections that already exist, enhancing and strengthening connections, and extending units to include activities that more explicitly develop students’ CT. We discuss students’ understanding of the relationship between a simple model of an ecosystem and the actual phenomenon it represents, their engagement with the unit’s data-gathering and data analysis activities, their ability to engage in sense-making regarding data they generated and analyzed, and how collectively the study supports their understanding of the complex system. This example module is part of “Broadening Participation of Elementary School Teachers and Students in Computer Science through STEM Integration and Statewide Collaboration,” a National Science Foundation-funded collaboration among Massachusetts teacher educators, researchers, teachers, and state-level education administrators that developed and implemented a number of elementary grade, CT-integrated science and mathematics curriculum modules. Collectively, these modules are designed to develop practices related to several key CT topics: abstraction, data, modeling and simulation, and algorithms. These CT topics support the development of core skills related to, but not exclusively the domain of, computer science. The strategy of integrating CT into core elementary STEM subject areas was intended to cultivate CT practices in support of science learning.","authors":["Kevin Waterman","Lynn Goldsmith","Marian Pasquale"],"meta":["February 2020Journal of Science Education and Technology 29(1)","DOI:10.1007/s10956-019-09801-y"],"references":["283155060_Defining_Computational_Thinking_for_Mathematics_and_Science_Classrooms","329230729_COMPUTATIONAL_THINKING_FROM_A_DISCIPLINARY_PERSPECTIVE","272177757_The_Next_Generation_Science_Standards_For_States_By_States"]}