{"id":"337443021_Learning_how_computer's_work_with_combining_CS-Unplugged_and_Raspberry_Pi","abstract":"Almost from the beginning, computer science was hampered by the perception that computer science exclusively focused on programming. This results in computational-related learning being very limited and minimally taught to students. The widespread use of ICT tools in indirect learning has changed the way students interact with content. This paper presents a different approach, while keeping the teacher at the centre of control of classroom activities but students are given the opportunity to explore the content to be learned by CS-Unplugged and Raspberry Pi. This activity aims to provide basic knowledge about how computers work. One of the activities is a simulation and experimentation on how computers work through the CS Unplugged approach. The basic knowledge formed from the simulation was then used as the basis for assembling a simple computer using Raspberry Pi. Based on the results of observations and interviews conducted, the utilization of CS Unplugged provides a learning experience that builds on the initial concept of how computers work. This is shown by an increase in students’ motivation and enthusiasm in learning how the computer works. This experience is what then makes it easy for students to do various computer assembly experiments using Raspberry Pi.","authors":["S Soviani","Jajang Kusnendar","Harsa Wara"],"meta":["November 2019Journal of Physics Conference Series 1280(3):032025","DOI:10.1088/1742-6596/1280/3/032025"],"references":["325187441_Using_NCLab-karel_to_improve_computational_thinking_skill_of_junior_high_school_students","266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","221538606_A_CS_unplugged_design_pattern","26621858_Effect_of_Information_and_Communication_Technologies_ICT_on_Non-Industrial_Countries-Digital_Divide_Model","26619234_How_Prepared_are_Trainee_Teachers_of_University_Putra_Malaysia_UPM_to_Integrate_Computer_Technology_in_Classroom_Teaching","349548062_Learning_Computer_Architecture_with_Raspberry_PiR","312017796_Development_of_Interactive_Courseware_for_Learning_Basic_Computer_System_Components","262221657_On_plugging_unplugged_into_CS_classes","259257568_Media_multitasking_among_American_youth_Prevalence_predictors_and_pairings","239582464_A_model_curriculum_for_k-12_computer_science_report_of_the_acm_k-12_education_task_force_computer_science_curriculum_committee"]}