{"id":"337417828_Examining_similarities_and_differences_of_citation_patterns_between_monographs_and_papers_a_case_in_biology_and_computer_science","abstract":"Purpose\nCitation content in academic papers and academic monographs promotes the knowledge flow among different publications. However, existing citation content analysis (CCA) focuses on academic papers and monographs have not received much research attention. We want to know if monographs are appropriate objects of CCA and whether existing methods of analyzing citation in papers are suitable for citation in monographs. Therefore, this paper aims to learn more about features of cited references and citation content in monographs and compare the characteristic of citation pattern between monographs and papers.\n\nDesign/methodology/approach\nThe authors manually annotate the references and syntactic citation content in academic monographs published by Morgan & Claypool and automatically extracted the references and citation content from academic papers published by Public Library of Science. Five features in two types citation pattern, namely, pattern of cited reference (including year, source and mention frequency of reference) and pattern of citation content (including location, length of citation content) are used to examine similarities and differences between monographs and papers.\n\nFindings\nThe results indicate that between monographs and papers, differences are shown in location, length of citation content and year, source of reference, whereas frequency of mention of reference is similar.\n\nOriginality/value\nPrevious studies have explored the patter of citation content in academic papers. However, none of the existing literature, as far as the authors know, has considered the citation content in academic monographs and the similarities or differences among academic documents when studying the citation pattern.","authors":["Yuzhuo Wang","Chengzhi Zhang"],"meta":["November 2019Information Discovery and Delivery 47(4):229-241","DOI:10.1108/IDD-09-2019-0064"],"references":["320296841_Characterizing_in-text_citations_in_scientific_articles_A_large-scale_analysis","315882114_Citation_function_polarity_and_influence_classification","299059144_Weak_Links_and_Strong_Meaning_The_Complex_Phenomenon_of_Negational_Citations","280933037_The_Role_Of_Citation_Context_In_Predicting_Long-Term_Citation_Profiles_An_Experimental_Study_Based_On_A_Massive_Bibliographic_Text_Dataset","265344015_Systematic_Production_of_Inactivating_and_Non-Inactivating_Suppressor_Mutations_at_the_relA_Locus_That_Compensate_the_Detrimental_Effects_of_Complete_spoT_Loss_and_Affect_Glycogen_Content_in_Escherich","304029868_Differing_disciplinary_citation_concentration_patterns_of_book_and_journal_literature","294577114_Factors_affecting_number_of_citations_a_comprehensive_review_of_the_literature","285160502_Citation_indexes","285069397_Citation_context_analysis","269221651_Mapping_the_Linguistic_Context_of_Citations"]}