{"id":"337471709_The_Teager-Kaiser_Energy_Cepstral_Coefficients_as_an_Effective_Structural_Health_Monitoring_Tool","abstract":"Featured Application: This paper presents a damage sensitive feature, the Teager-Kaiser Energy Cepstral Coefficients (TECCs), which can be used to train a Machine Learning algorithm to perform damage detection and Structural Health Monitoring (SHM) on complex buildings and/or mechanical systems. Abstract: Recently, features and techniques from speech processing have started to gain increasing attention in the Structural Health Monitoring (SHM) community, in the context of vibration analysis. In particular, the Cepstral Coefficients (CCs) proved to be apt in discerning the response of a damaged structure with respect to a given undamaged baseline. Previous works relied on the Mel-Frequency Cepstral Coefficients (MFCCs). This approach, while efficient and still very common in applications, such as speech and speaker recognition, has been followed by other more advanced and competitive techniques for the same aims. The Teager-Kaiser Energy Cepstral Coefficients (TECCs) is one of these alternatives. These features are very closely related to MFCCs, but provide interesting and useful additional values, such as e.g., improved robustness with respect to noise. The goal of this paper is to introduce the use of TECCs for damage detection purposes, by highlighting their competitiveness with closely related features. Promising results from both numerical and experimental data were obtained.","authors":["Marco Civera","Matteo Ferraris","Rosario Ceravolo","Cecilia Surace"],"meta":["November 2019Applied Sciences 9(23):5064","DOI:10.3390/app9235064"],"references":["333638795_Video_Processing_Techniques_for_the_Contactless_Investigation_of_Large_Oscillations","333255511_Using_Video_Processing_for_the_Full-Field_Identification_of_Backbone_Curves_in_Case_of_Large_Vibrations","317325432_Assessment_of_vocal_cord_nodules_a_case_study_in_speech_processing_by_using_Hilbert-Huang_Transform","309670023_Wavelet_analysis_based_damage_localization_in_steel_frames_with_bolted_connections","336620799_Nonlinear_Dynamics_of_Cracked_Cantilevered_Beam-like_Structures_Undergoing_Large_Deflections","334261184_Using_Enhanced_Cepstral_Analysis_for_Structural_Health_Monitoring","331474853_Diagnostic_analysis_and_dynamic_identification_of_a_glass_suspension_footbridge_via_on-site_vibration_experiments_and_FE_numerical_modelling","322311430_Flexible_High_Aspect_Ratio_Wing_Low_Cost_Experimental_Model_and_Computational_Framework","313017155_A_comparison_of_cepstral_editing_methods_as_signal_pre-processing_techniques_for_vibration-based_bearing_fault_detection","311989311_A_History_of_Cepstrum_Analysis_and_its_Application_to_Mechanical_Problems"]}