{"id":"337429782_Comprehensive_bibliometric_study_of_Journal_of_Environmental_Engineering_and_Landscape_Management_from_2007_to_2019","abstract":"Since the world became industrialized, our environment has been changed, bringing different environmental issues. The world benefits from industrialization but suffers from diverse pollutions simultaneously. Therefore, we are motivated to investigate the environment and landscape management explorations by analyzing 403 papers published in the Journal of Environmental Engineering and Landscape Management (JEELM) from 2007 to 2019. As one of the scientific journals that investigate environment management, JEELM mainly focuses on the area of environmental changes caused by human activities. By analyzing the issues such as atmosphere, water, and soil pollution and their mitigation technologies, JEELM accepts the scientific outputs written in English. Based on the data retrieved from Web of Science, we provide an overview of the status quo and emerging trends of the researches published on JEELM. Diverse researches such as publication distribution, citation structure, co-citation analysis and key contributors on the aspects of countries, institutions, and authors are given to comprehensively analyze the current situation of JEELM’s. Besides, the emerging trends and hot spots can be revealed by burst detection and timeline view. Therefore, this paper contributes to providing a general picture of the knowledge domain of JEELM’ research which enables researchers, especially the beginners to learn about this journal’s development.","authors":["Zeshui Xu","Wei Zhou","Edita Baltrėnaitė-Gedienė"],"meta":["November 2019Journal of Environmental Engineering and Landscape Management 27(4):215-227","DOI:10.3846/jeelm.2019.11366"],"references":["332685205_The_evolution_of_Technological_and_Economic_Development_of_Economy_a_bibliometric_analysis","331634715_Factors_associated_with_publication_speed_in_general_medical_journals_a_retrospective_study_of_bibliometric_data","330760174_Investigation_on_the_impact_of_transport_exhaust_emissions_on_the_air","330378007_Modeling_of_motor_transport_exhaust_pollutant_dispersion","330377572_Phytoremediation_for_heavy_metal-contaminated_soils_combined_with_bioenergy_production","330371436_Effect_of_sewage_sludge_fertilization_in_short-rotation_willow_plantations","332787575_A_scientometric_analysis_and_critical_review_of_construction_related_ontology_research","331786484_Review_Important_Contributions_in_Development_and_Improvement_of_the_Heat_Integration_Techniques","331411166_Mapping_the_knowledge_domains_of_value_management_a_bibliometric_approach","330371440_APPLICATION_OF_AGRONOMIC_PRACTICE_IMPROVES_PHYTOEXTRACTION_ON_A_MULTIPOLLUTED_SITE"]}