{"id":"337452945_Quantum_Generative_Adversarial_Networks_for_learning_and_loading_random_distributions","abstract":"Quantum algorithms have the potential to outperform their classical counterparts in a variety of tasks. The realization of the advantage often requires the ability to load classical data efficiently into quantum states. However, the best known methods require \\({\\mathcal{O}}\\left({2}^{n}\\right)\\) gates to load an exact representation of a generic data structure into an \\(n\\)-qubit state. This scaling can easily predominate the complexity of a quantum algorithm and, thereby, impair potential quantum advantage. Our work presents a hybrid quantum-classical algorithm for efficient, approximate quantum state loading. More precisely, we use quantum Generative Adversarial Networks (qGANs) to facilitate efficient learning and loading of generic probability distributions - implicitly given by data samples - into quantum states. Through the interplay of a quantum channel, such as a variational quantum circuit, and a classical neural network, the qGAN can learn a representation of the probability distribution underlying the data samples and load it into a quantum state. The loading requires \\({\\mathcal{O}}\\left(poly\\left(n\\right)\\right)\\) gates and can thus enable the use of potentially advantageous quantum algorithms, such as Quantum Amplitude Estimation. We implement the qGAN distribution learning and loading method with Qiskit and test it using a quantum simulation as well as actual quantum processors provided by the IBM Q Experience. Furthermore, we employ quantum simulation to demonstrate the use of the trained quantum channel in a quantum finance application.","authors":["Christa Zoufal","Aurelien Lucchi","Stefan Woerner"],"meta":["December 2019npj Quantum Information 5(1)","DOI:10.1038/s41534-019-0223-2"],"references":["334295795_An_adaptive_variational_algorithm_for_exact_molecular_simulations_on_a_quantum_computer","332088465_Adversarial_quantum_circuit_learning_for_pure_state_approximation","330975389_Quantum_risk_analysis","330653968_Quantum_generative_adversarial_learning_in_a_superconducting_quantum_circuit","347338302_Variational_Quantum_Generators_Generative_Adversarial_Quantum_Machine_Learning_for_Continuous_Distributions","342054397_Quantum_generative_adversarial_network_for_generating_discrete_distribution","332888637_Learning_and_inference_on_generative_adversarial_quantum_circuits","330428201_Black-Box_Quantum_State_Preparation_without_Arithmetic","328723323_On_the_convergence_of_Adam_Beyond","327124324_Quantum_computational_finance_Monte_Carlo_pricing_of_financial_derivatives"]}