{"id":"337406932_Improving_Packaging_Design_Using_Virtual_Reality_in_the_Market_Research_Process","abstract":"Market research is important because every company wants to stand out from their competitors. However, there are well-known weaknesses of traditional market research methods. This research presents a virtual reality system that aims to improve the quality of the data collected in marketing research. The system was designed and developed using Human–Computer Interaction techniques like iterative design, storyboards and prototypes. One hundred and twenty eight participants were involved in this research. Thirty five computer science graduate students, and twelve marketing professors validated the idea through a storyboard. Adjectives like innovative, useful and interesting were used by the participants to refer to the idea presented. Furthermore, eighty one marketing graduate students validated the prototype’s user experience and usability using the AttrakDiff survey. Unquestionably, 100% of the participants agreed that the prototype could help improve market studies of product packaging design. In addition, 99% of the participants said that they would use the prototype when executing market research of product packaging design.","authors":["Brenes","Gabriela Marín-Raventós","Gustavo López"],"meta":["November 2019","DOI:10.3390/proceedings2019031012"],"references":["312574890_When_brands_come_to_life_experimental_research_on_the_vividness_effect_of_Virtual_Reality_in_transformational_marketing_communications","263652021_IMPACT_OF_PRODUCT_PACKAGING_ON_CONSUMER'S_BUYING_BEHAVIOR","221441543_Storyboarding_an_empirical_determination_of_best_practices_and_effective_guidelines","263686992_A_Practical_Guide_to_Focus-Group_Research","253238621_Using_virtual_reality_to_examine_hazard_perception_in_package_design","221099276_Modeling_of_Purchasing_Behavior_for_Application_on_Merchandise_Display_and_Package_Design","8480360_The_learning_curve_The_advantages_and_disadvantages_in_the_use_of_focus_groups_as_a_method_of_data_collection"]}