{"id":"337450312_Enhanced_Knowledge_and_Engagement_of_Students_Through_the_Gamification_Concept_of_Game_Elements","abstract":"The idea of Gamification is very popular for applying the gaming concept theory in various fields. Nowhere else is this more important than in education. Consid-ering the careful build-up and implementation of game-elements could improve academic performance outcome and student motivation. However, Gamification could require much more time to be designed and applied to education related ac-tivities and it also comes with significant operating and design cost to provide highly engaging activities for students. One of the main problems in designing Gamification is the question: “which game elements should be applied to student activities?”. Moreover one must make sure that it has great impact on students’ performance in terms of their education related performance. Hence, in this re-search, we focused on studying the impact of each element in order to investigate the behavioral outcome of game elements in educational environments through the concept of knowledge and game-based learning from the Gamification con-cept. In our experiment, we examined the impact of each game element on senior high school students based on the basic elements of Gamification such as Lead-erboard, Cooperative and Awarding badges. In addition, we studied the effect of the game-based learning application called Aqua republica from UNEP and DHI centers with partner of Thailand. The experiment design compared two groups: the“Non-Gamified” and the “Gamified” groups participating in the game-based learning activity Aqua Republica. Academic indicators and numerical indicators were used to directly measure the effect and behavioral outcome of the use of game elements. Finally, the study suggested that leaderboards could improve the overall performance of students so it can be worth implementing it in classroom activities.","authors":["Kitti Puritat"],"meta":["November 2019","DOI:10.3991/ijep.v9i5.11028"],"references":["267704013_COUPLING_BETWEEN_THE_RIVER_BASIN_MANAGEMENT_MODEL_MIKE_BASIN_AND_THE_3D_HYDROLOGICAL_MODEL_MIKE_SHE_WITH_USE_OF_THE_OPENMI_SYSTEM","256743509_Does_Gamification_Work_-_A_Literature_Review_of_Empirical_Studies_on_Gamification","220014139_High_Score_-_Motivation_Strategies_for_User_Participation_in_Virtual_Human_Development","283564787_Badge_Architectures_as_Tools_for_Sense-Making_and_Motivation_in_Engineering_Education","262841944_Leaderboards_in_a_virtual_classroom_A_test_of_stereotype_threat_and_social_comparison_explanations_for_women's_math_performance","254297610_Evidence_of_Choking_Under_Pressure_on_the_PGA_Tour","244486521_Reality_is_Broken_Why_Games_Make_Us_Better_and_How_They_Can_Change_the_World","234818415_Applying_game_achievement_systems_to_enhance_user_experience_in_a_photo_sharing_service","216743170_The_What_and_Why_of_Goal_Pursuits_Human_Needs_and_the_Self-Determination_of_Behavior"]}