{"id":"337450688_Overlapping_communications_in_gyrokinetic_codes_on_accelerator-based_platforms","abstract":"Communication and computation overlapping techniques have been introduced in the five‐dimensional gyrokinetic codes GYSELA and GKV. In order to anticipate some of the exa‐scale requirements, these codes were ported to the modern accelerators, Xeon Phi KNL and Tesla P 100 GPU. On accelerators, a serial version of GYSELA on KNL and GKV on GPU are respectively 1.3× and 7.4× faster than those on a single Skylake processor (a single socket). For the scalability, we have measured GYSELA performance on Xeon Phi KNL from 16 to 512 KNLs (1024 to 32k cores) and GKV performance on Tesla P 100 GPU from 32 to 256 GPUs. In their parallel versions, transpose communication in semi‐Lagrangian solver in GYSELA or Convolution kernel in GKV turned out to be a main bottleneck. This indicates that in the exa‐scale, the network constraints would be critical. In order to mitigate the communication costs, the pipeline and task‐based overlapping techniques have been implemented in these codes. The GYSELA 2D advection solver has achieved a 33% to 92% speed up, and the GKV 2D convolution kernel has achieved a factor of 2 speed up with pipelining. The task‐based approach gives 11% to 82% performance gain in the derivative computation of the electrostatic potential in GYSELA. We have shown that the pipeline‐based approach is applicable with the presence of symmetry, while the task‐based approach can be applicable to more general situations.","authors":["Yuuichi Asahi","Guillaume Latu","Julien Bigot","Shinya Maeyama"],"meta":["November 2019Concurrency and Computation Practice and Experience 32(1)","DOI:10.1002/cpe.5551"],"references":["301854902_A_portable_platform_for_accelerated_PIC_codes_and_its_application_to_GPUs_using_OpenACC","287111078_A_multi-species_collisional_operator_for_full-F_gyrokinetics","331269353_Scaling_and_Optimizing_the_Gysela_Code_on_a_Cluster_of_Many-Core_Processors","327525497_A_multi-species_collisional_operator_for_full-F_global_gyrokinetics_codes_Numerical_aspects_and_verification_with_the_GYSELA_code","320849172_Application_of_a_communication-avoiding_generalized_minimal_residual_method_to_a_gyrokinetic_five_dimensional_eulerian_code_on_many_core_platforms","320542686_Benchmarking_of_flux-driven_full-F_gyrokinetic_simulations","312944611_Gyrokinetic_simulations_of_turbulent_transport","311169676_Optimization_of_Fusion_Kernels_on_Accelerators_with_Indirect_or_Strided_Memory_Access_Patterns","283535764_Improved_collision_operator_for_plasma_kinetic_simulations_with_multi-species_ions_and_electrons","278619511_A_5D_gyrokinetic_full-_global_semi-Lagrangian_code_for_flux-driven_ion_turbulence_simulations"]}