{"id":"337460421_A_Novel_Infrared_and_Visible_Image_Information_Fusion_Method_Based_on_Phase_Congruency_and_Image_Entropy","abstract":"In multi-modality image fusion, source image decomposition, such as multi-scale transform (MST), is a necessary step and also widely used. However, when MST is directly used to decompose source images into high- and low-frequency components, the corresponding decomposed components are not precise enough for the following infrared-visible fusion operations. This paper proposes a non-subsampled contourlet transform (NSCT) based decomposition method for image fusion, by which source images are decomposed to obtain corresponding high- and low-frequency sub-bands. Unlike MST, the obtained high-frequency sub-bands have different decomposition layers, and each layer contains different information. In order to obtain a more informative fused high-frequency component, maximum absolute value and pulse coupled neural network (PCNN) fusion rules are applied to different sub-bands of high-frequency components. Activity measures, such as phase congruency (PC), local measure of sharpness change (LSCM), and local signal strength (LSS), are designed to enhance the detailed features of fused low-frequency components. The fused high- and low-frequency components are integrated to form a fused image. The experiment results show that the fused images obtained by the proposed method achieve good performance in clarity, contrast, and image information entropy.","authors":["Xinghua Huang","Guanqiu Qi","Hongyan Wei","Yi Chai"],"meta":["November 2019Entropy 21(12):1135","DOI:10.3390/e21121135"],"references":["334498116_A_Novel_Image_Fusion_Framework_Based_on_Sparse_Representation_and_Pulse_Coupled_Neural_Network","329479747_A_Novel_Multi-Exposure_Image_Fusion_Method_Based_on_Adaptive_Patch_Structure","327322470_Infrared_and_Visual_Image_Fusion_Based_on_NSST_and_Improved_PCNN","326338619_An_Image_Fusion_Method_Based_on_Sparse_Representation_and_Sum_Modified-Laplacian_in_NSCT_Domain","332741576_Discriminative_Dictionary_Learning-Based_Multiple_Component_Decomposition_for_Detail-Preserving_Noisy_Image_Fusion","330941420_A_Phase_Congruency_and_Local_Laplacian_Energy_based_Multi-modality_Medical_Image_Fusion_Method_in_NSCT_Domain","328548309_Morphology-based_visible-infrared_image_fusion_framework_for_smart_city","328376596_Morphology-based_visible-infrared_image_fusion_framework_for_smart_city","326099418_Joint_medical_image_fusion_denoising_and_enhancement_via_discriminative_low-rank_sparse_dictionaries_learning","325994542_Infrared_and_visible_image_fusion_method_based_on_sparse_features"]}