{"id":"337454173_On_finding_optimum_commuting_path_in_a_road_network_A_computational_approach_for_smart_city_traveling","abstract":"Commuting in big cities with heavy traffic is a real‐world task faced by many on a daily basis. Finding a suitable path for commuting in real‐life complex traffic networks is an important research problem with many applications. The existing work in this domain is based on the travel time and distance from source to destination. However, other than these two factors, there are many additional features that impact the overall travel time and its quality. Some of these additional features include environmental factors, road condition, and the traffic flow. The driving time can be minimized by selecting the most suitable path where there is less congestion and other travel related conditions are favorable. Commuting duration can increase even on the shortest path if there is congestion or the route is blocked. This work presents a mobile crowdsourcing‐based model to find suitable commuting path(s) by considering the factors that directly or indirectly influence the overall travel time. Experiment in this work refers the naturalistic driving study to select the travel related features. An algorithm is proposed to find the suitable path from the user provided source to the destination using crowdsourced data generated using mobile application. Unlike other algorithms, the proposed approach can address the network peculiarities where travel cost is not only based on the distance between the nodes but other indirect factors are also involved. This work extracts all possible paths from a source to the destination and then computes the travel cost in terms of distance and satellite factors across the paths. This proposal is evaluated on eight large real‐world road network data sets. A comparison is performed with four state‐of‐the‐art pathfinding methods. These include, Floyd‐Warshall algorithm, Bellman‐Ford algorithm, open shortest path first algorithm, and Dijkstra algorithm. Empirical analysis shows that the additional factors incorporated in the proposed mobile crowdsourcing model while finding a suitable path have a significant impact on the travel time. The results show better performance of the proposed model than its counterparts. The proposed approach can address the network peculiarities where travel cost is not only based on the distance between the nodes but other indirect factors are also involved. This work extracts all possible paths from a source to the destination and then computes the travel cost in terms of distance and satellite factors across the paths. Empirical analysis shows that the additional factors incorporated in the proposed mobile crowdsourcing model while finding a suitable path have a significant impact on the travel time.","authors":["Zahid Halim","Aqsa Khan","Muhammad Sulaiman","Sajid Anwar"],"meta":["November 2019Transactions on Emerging Telecommunications Technologies","DOI:10.1002/ett.3786"],"references":["326167158_The_Curse_of_Sensing_Survey_of_techniques_and_challenges_to_cope_with_sparse_and_dense_data_in_mobile_crowd_sensing_for_Internet_of_Things","323978887_ex-FTCD_A_novel_mapreduce_model_for_distributed_multi_source_shortest_path_problem","326616093_Survey_on_traffic_prediction_in_smart_cities","325560380_Route_planning_for_electric_vehicle_efficiency_using_the_Bellman-Ford_algorithm_on_an_embedded_GPU","324990505_Traffic_density_congestion_externalities_and_urbanization_in_China","324048842_Analysis_of_near_crashes_among_teen_young_adult_and_experienced_adult_drivers_using_the_SHRP2_naturalistic_driving_study","322638627_Crowdsourcing_and_Stigmergic_Approaches_for_Swarm_Intelligent_Transportation_Systems","322427733_Floyd_warshall_algorithm_with_FIS_Sugeno_for_search_evacuation_route_optimization","322398257_When_Dijkstra_Meets_Vanishing_Point_A_Stereo_Vision_Approach_for_Road_Detection","322190558_Residential_energy_scheduling_for_variable_weather_solar_energy_based_on_adaptive_dynamic_programming"]}