{"id":"337538493_Towards_a_comparative_science_of_emotion_Affect_and_consciousness_in_humans_and_animals","abstract":"The componential view of human emotion recognises that affective states comprise conscious, behavioural, physiological, neural and cognitive elements. Although many animals display bodily and behavioural changes consistent with the occurrence of affective states similar to those seen in humans, the question of whether and in which species these are accompanied by conscious experiences remains controversial. Finding scientifically valid methods for investigating markers for the subjective component of affect in both humans and animals is central to developing a comparative understanding of the processes and mechanisms of affect and its evolution and distribution across taxonomic groups, to our understanding of animal welfare, and to the development of animal models of affective disorders. Here, contemporary evidence indicating potential markers of conscious processing in animals is reviewed, with a view to extending this search to include markers of conscious affective processing. We do this by combining animal-focused approaches with investigations of the components of conscious and non-conscious emotional processing in humans, and neuropsychological research into the structure and functions of conscious emotions.","authors":["Elizabeth S. Paul","Shlomi Sher","Marco Tamietto","Piotr Winkielman"],"meta":["November 2019Neuroscience & Biobehavioral Reviews 108(205)","DOI:10.1016/j.neubiorev.2019.11.014"],"references":["335180059_Welfare-improving_enrichments_greatly_reduce_hens'_startle_responses_despite_little_change_in_judgment_bias","334620968_Viewpoints_Approaches_to_defining_and_investigating_fear","333295315_Physiological_Feelings","355523309_Blindsight_in_man_and_monkey","335951262_Veterinary_Students'_Beliefs_About_Animal_Sentience_What_Role_Does_Gender_Play","334357373_Social_Cognition_Inference_and_Attribution","334143783_Miniature_spiders_with_miniature_brains_forget_sooner","334085083_Cephalopod_Cognition","333591996_Insects_as_models_for_studying_the_evolution_of_animal_cognition","333224327_Negative_emotional_contagion_and_cognitive_bias_in_common_ravens_Corvus_corax"]}