{"id":"337519502_Blockchain_for_Supply_Chain_Traceability_Business_Requirements_and_Critical_Success_Factors","abstract":"We seek to guide operations management (OM) research on the implementation of supply chain traceability systems by identifying business requirements and the factors critical to successful implementation. We first motivate the need for implementing traceability systems in two very different industries-cobalt mining and pharmaceuticals-and present business requirements and critical success factors for implementation. Next, we describe how we carried out thematic analysis of practitioner and scholarly articles on implementing blockchain for supply chain traceability. Finally, we present our results pertaining to the needs of different stakeholders such as suppliers, consumers, and regulators. The business requirements for traceability systems are curbing illegal practices; improving sustainability performance; increasing operational efficiency; enhancing supply-chain coordination; and sensing market trends. Critical success factors for implementation are companies' capabilities; collaboration; technology maturity; supply chain practices; leadership; and governance of the traceability efforts. These findings provide a nascent measurement model for empirical work and a foundation for descriptive and normative research on blockchain applications for supply chain traceability.","authors":["Gabriella M. Hastig","Manmohan S. Sodhi"],"meta":["November 2019Production and Operations Management 29(4)","DOI:10.1111/poms.13147"],"references":["353764416_Blockchain_Technology_for_Supply_Chain_Management","341913793_The_Truth_About_Blockchain","332571505_Merging_Supply_Chain_and_Blockchain_Technologies","327324058_Blockchain_for_Peer-to-Peer_Energy_Exchanges_Design_and_Recommendations","326702318_Pharmaceutical_cold_chain_management_Platform_based_on_a_distributed_ledger","326700432_Blockchain_Law_and_Business_Supply_Chains_The_Need_for_Governance_and_Legal_Frameworks_to_Achieve_Sustainability","325544586_Research_Opportunities_in_Supply_Chain_Transparency","325339923_Governance_on_the_Drug_Supply_Chain_via_Gcoin_Blockchain","334079008_Distributed_Ledgers_and_Operations_What_Operations_Management_Researchers_Should_Know_About_Blockchain_Technology","325422967_Leveraging_Blockchain_Technology_for_Halal_Supply_Chains"]}