{"id":"337560687_Chimpanzees_use_tree_species_with_a_resonant_timbre_for_accumulative_stone_throwing","abstract":"Animals use tools for communication relatively rarely compared to tool use for extractive foraging. We investigated the tool-use behaviour accumulative stone throwing (AST) in wild chimpanzees, who regularly throw rocks at trees, producing impact sounds and resulting in the aggregations of rocks. The function of AST remains unknown but appears to be communication-related. We conducted field experiments to test whether impact sounds produced by throwing rocks at trees varied according to the tree's properties. Specifically, we compared impact sounds of AST and non-AST tree species. We measured three acoustic descriptors related to intrinsic timbre quality, and found that AST tree species produced impact sounds that were less damped, with spectral energy concentrated at lower frequencies compared to non-AST tree species. Buttress roots in particular produced timbres with low-frequency energy (low spectral centroid) and slower signal onset (longer attack time). In summary, chimpanzees use tree species capable of producing more resonant sounds for AST compared to other tree species available.","authors":["Ammie K. Kalan","Eleonora Carmignani","Richard Kronland-Martinet","Sølvi Ystad"],"meta":["December 2019Biology Letters 15(12)","DOI:10.1098/rsbl.2019.0747"],"references":["331586422_Human_impact_erodes_chimpanzee_behavioral_diversity","331361745_Animal_cultures_matter_for_conservation","326043909_Re-emergence_of_the_leaf_clip_gesture_during_an_alpha_takeover_affects_variation_in_male_chimpanzee_loud_calls","321732456_Tree_crickets_optimize_the_acoustics_of_baffles_to_exaggerate_their_mate-attraction_signal","318067022_Tool-assisted_rhythmic_drumming_in_palm_cockatoos_shares_key_elements_of_human_instrumental_music","296475890_Chimpanzee_accumulative_stone_throwing","324415315_Linear_Statistical_Models_An_Applied_Approach","318392950_An_Introduction_to_Generalized_Linear_Models_Third_Edition","316360101_lme4_Linear_mixed-effects_models_using_Eigen_and_S4","291161927_Random_effects_structure_for_confirmatory_hypothesis_testing_Keep_it_maximal"]}