{"id":"337529631_Towards_Better_Data_ManagementGathering_in_Connected_Environments","abstract":"The rapidly increasing number of interconnected devices and systems gave birth to a connected environment, which introduced new approaches to flexible control and management of systems to improve the overall system performance. Knowing their benefits, it is crucial that we understand how the current data gathering approaches are adapted in the connected environment. A wealthy number of literature approaches have targeted data gathering and aggregation based on specific contexts like mobile ad hoc networks, vehicular ad hoc networks and flying ad hoc networks. Nowadays, a connected environment uses simultaneously all these protocols. This highlights the need for developing a generic information system for data gathering and management that considers all device preferences. In this regard, the clustering technique comes as a promising solution to maintain the stability of devices during the phase of data gathering and management. In this paper, and to palliate this shortage, we introduce a new adaptive and generic technique for cluster head selection in connected environments. The main idea is to represent all the connected devices as a hypergraph, based on the similarity between devices preferences. Then a hypergraph transversal algorithm is used to select the cluster heads. The performed experiments show that our solution outperforms the pioneering approaches of the literature in terms of effectiveness and efficiency.","authors":["Sabri Allani","Richard Chbeir","Khouloud Salameh"],"meta":["November 2019","DOI:10.1145/3345837.3355953","Conference: the 15th ACM International Symposium","Project: OpenCEMS: Connected Environment & Distributed Energy Data Management Solutions"],"references":["329817344_The_Internet_of_Things_A_Review_of_Enabled_Technologies_and_Future_Challenges","327000690_Smart_Directional_Data_Aggregation_in_VANETs","325725324_Smarter_and_more_connected_Future_intelligent_transportation_system","325391481_A_Review_and_Classification_of_Flying_Ad-Hoc_Network_FANET_Routing_Strategies","321828834_A_Scalable_Data_Dissemination_Protocol_Based_on_Vehicles_Trajectories_Analysis","320133390_Cross-Layer_Approach_Based_Energy_Minimization_for_Wireless_Sensor_Networks","329391503_Energy_Preservation_in_Mobile_Ad-Hoc_Networks_Using_a_Modified_Butterfly_Optimization_with_Associative_Cluster_Head_Load_Distribution","325689923_MPC_A_RSUs_deployment_strategy_for_VANET","325495101_An_energy_efficient_fuzzy_cluster_head_selection_algorithm_for_WSNs","319283535_Data_aggregation_mechanisms_in_the_Internet_of_things_A_systematic_review_of_the_literature_and_recommendations_for_future_research"]}