{"id":"337552973_DEVELOPMENT_OF_A_WEB_SERVICE_FOR_FORMING_A_SEMANTIC_KERNEL_OF_A_WEBSITE_BASED_ON_DATA_MINING_METHODS","abstract":"A technique has been developed for the formation of the semantic core of a site for Internet resources with already generated or dynamically generated content. A mathematical model based on data mining methods is given. For analysis and further research, an information technology is developed – a web service. The main users of this web service will be SEO specialists, for whom it will become a convenient tool. This web service relies on data mining methods and statistics on the use of search queries obtained from the Google Search interface. Integration of the data allows to qualitatively select the necessary keywords and give a list of the most optimal, relating to the subject of the site.\n\nFor research, the site of the Department of Computer Science of the Azov State Technical University was selected. During the experiment, a list of keywords and phrases was obtained. The words in the list are sorted in decreasing order of performance. The automated formation of the semantic core eliminated the subjectivity of the SEO specialist when selecting words and phrases, the time spent on its formation is ten times less than the manual semantic analysis. The result set included only those words and phrases that are often used in the content and are most significant. Using Google Search to adjust the list of words allows to match words with search queries and select those for which users are looking for information. The web service has a flexible mechanism for regulating (limiting) the number of keywords in the result set.\n\nThe main advantage of using this service is that only those words and phrases fall into the semantic core, in response to which there is something to offer visitors on the site.","authors":["Dmitry Mironenko","Elena Balalayeva"],"meta":["November 2019Technology Transfer fundamental principles and innovative technical solutions 3:16-19","DOI:10.21303/2585-6847.2019.001047"],"references":["275541550_The_Role_of_Search_Engine_Optimization_on_Keeping_the_User_on_the_Site"]}