{"id":"337552431_Latent_geometry_and_dynamics_of_proximity_networks","abstract":"Proximity networks are time-varying graphs representing the closeness among humans moving in a physical space. Their properties have been extensively studied in the past decade as they critically affect the behavior of spreading phenomena and the performance of routing algorithms. Yet the mechanisms responsible for their observed characteristics remain elusive. Here we show that many of the observed properties of proximity networks emerge naturally and simultaneously in a simple latent space network model, called dynamic-S1. The dynamic-S1 does not model node mobility directly but captures the connectivity in each snapshot—each snapshot in the model is a realization of the S1 model of traditional complex networks, which is isomorphic to hyperbolic geometric graphs. By forgoing the motion component the model facilitates mathematical analysis, allowing us to prove the contact, intercontact, and weight distributions. We show that these distributions are power laws in the thermodynamic limit with exponents lying within the ranges observed in real systems. Interestingly, we find that network temperature plays a central role in network dynamics, dictating the exponents of these distributions, the time-aggregated agent degrees, and the formation of unique and recurrent components. Further, we show that paradigmatic epidemic and rumor-spreading processes perform similarly in real and modeled networks. The dynamic-S1 or extensions of it may apply to other types of time-varying networks and constitute the basis of maximum likelihood estimation methods that infer the node coordinates and their evolution in the latent spaces of real systems.","authors":["Fragkiskos Papadopoulos","Marco Antonio Rodriguez Flores"],"meta":["November 2019PHYSICAL REVIEW E 100(5)","DOI:10.1103/PhysRevE.100.052313"],"references":["330639925_Link_persistence_and_conditional_distances_in_multiplex_networks","329769034_Similarity_Forces_and_Recurrent_Components_in_Human_Face-to-Face_Interaction_Networks","321954542_NDlib_a_Python_Library_to_Model_and_Analyze_Diffusion_Processes_Over_Complex_Networks","311842246_Cost-efficient_vaccination_protocols_for_network_epidemiology","282297849_Face-to-Face_Interactions","334563761_Modeling_Infectious_Diseases_in_Humans_and_Animals","322221242_A_dynamic_network_model_with_persistent_links_and_node-specific_latent_variables_with_an_application_to_the_interbank_market","321347841_A_Review_of_Dynamic_Network_Models_with_Latent_Variables","319453244_Robust_Modeling_of_Human_Contact_Networks_Across_Different_Scales_and_Proximity-Sensing_Techniques","301819745_Temporal_network_structures_controlling_disease_spreading"]}