{"id":"337542902_Comparing_methods_for_comparing_networks","abstract":"With the impressive growth of available data and the flexibility of network modelling, the problem of devising effective quantitative methods for the comparison of networks arises. Plenty of such methods have been designed to accomplish this task: most of them deal with undirected and unweighted networks only, but a few are capable of handling directed and/or weighted networks too, thus properly exploiting richer information. In this work, we contribute to the effort of comparing the different methods for comparing networks and providing a guide for the selection of an appropriate one. First, we review and classify a collection of network comparison methods, highlighting the criteria they are based on and their advantages and drawbacks. The set includes methods requiring known node-correspondence, such as DeltaCon and Cut Distance, as well as methods not requiring a priori known node-correspondence, such as alignment-based, graphlet-based, and spectral methods, and the recently proposed Portrait Divergence and NetLSD. We test the above methods on synthetic networks and we assess their usability and the meaningfulness of the results they provide. Finally, we apply the methods to two real-world datasets, the European Air Transportation Network and the FAO Trade Network, in order to discuss the results that can be drawn from this type of analysis.","authors":["Mattia Tantardini","Francesca Ieva","Lucia Tajoli","Carlo Piccardi"],"meta":["November 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-53708-y"],"references":["325413592_NetLSD_Hearing_the_Shape_of_a_Graph","324472149_An_information-theoretic_all-scales_approach_to_comparing_networks","323998601_Cut_Based_Method_for_Comparing_Complex_Networks","323392586_Complexity_Centralization_and_Fragility_in_Economic_Networks","322841509_Identifying_network_structure_similarity_using_spectral_graph_theory","320806803_GRAFENE_Graphlet-based_alignment-free_network_approach_integrates_3D_structural_and_sequence_residue_order_data_to_improve_protein_structural_comparison","320414157_Graphkernels_R_and_Python_packages_for_graph_comparison","311585806_Random_walks_and_diffusion_on_networks","322865081_The_journey_of_graph_kernels_through_two_decades","318999207_Core-Periphery_Structure_in_Networks_Revisited"]}