{"id":"337585798_A_tool-assisted_method_for_the_systematic_construction_of_critical_embedded_systems_using_Event-B","abstract":"Embedded control systems combine digital and physical components, leading to complex interactions and even complexity of their development. In [4] we proposed a method to build such complex systems in a systematic way. The overall method starts from an abstract model of the physical environment of the considered system and its controller. The method consists in a sequence of refinement steps, in the spirit of Event-B, that gradually introduces design details from an abstract level, until more concrete levels. Two main refinement processes are distinguished: one to capture the global model, the other to detail it; we provide through the method the guidelines to accompany these two refinement processes. But there were a lack of assistance tools. The designers need to be assisted by tools to guide them, to automate partially the refinements and to help in proving more easily model properties. We illustrate the method with the landing gear system case study and choosing the Event-B tool Rodin for illustration; we make it explicit the tools requirements for such a general method and, we introduce a tool support to assist the user in applying the method in combination with standard Event-B tool such as Rodin.","authors":["Pascal André","Christian Attiogbé","Arnaud Lanoix"],"meta":["January 2019Computer Science and Information Systems 17(00):42-42","DOI:10.2298/CSIS190501042A"],"references":["281207273_Stepwise_Formal_Modelling_and_Reasoning_of_Insulin_Infusion_Pump_Requirements","278744171_Building_traceable_Event-B_models_from_requirements","220443711_Refinement_Decomposition_and_Instantiation_of_Discrete_Models_Application_to_Event-B","321122646_Validating_and_verifying_the_requirements_and_design_of_a_haemodialysis_machine_using_the_Rodin_toolset","300706591_The_Landing_Gear_System_Case_Study","260735133_A_Mixed_Approach_to_Rigorous_Development_of_Control_Designs","224920402_Formal_Specification_of_Medical_Systems_by_Proof-Based_Refinement","221047644_Shared_Event_CompositionDecomposition_in_Event-B","220695465_Modeling_in_Event-B_-_System_and_Software_Engineering","220473318_Model-integrated_development_of_embedded_software"]}