{"id":"337595479_Development_of_internet_resources_to_assess_the_effectiveness_of_some_GTP","abstract":"The analysis of Internet resources is fulfilled. These resources contain such information as: (i) data on the thermal properties of substances, R = ( ρ , h , s , …), (ii) numerical data on the efficiency and other energy criteria, Z , of power plants. Our analysis has shown some features of the resources. Currently the most of them have the form of text files. The second type of the resources represents a software in the form of “exe-file” and allows the client to calculate values of R using a mathematical formula (MF) at boundary conditions, Y = ( P , T ); the latter are the pressure and the temperature. In this case, the resource includes the program, which is closed to clients: there is no such option as “to copy MF formula” in the software. A group of researchers offers the software, which is designed to calculate R properties and has the form of the open interactive Internet resource (OS). A computational part of OS-resource includes: (i) MF formula, which associates the property R with the parameters Y = ( P , T , …), (ii) Mathcad-program Code ( R , Y ) containing MF formula. The interactive part of the OS-resource is based on the computer science and Internet technology (IT). The report analyzes the methodological techniques and IT-tools, which have to be used to create OS-resource. We have considered OS-resources, which have a complex structure and are focused on the joint use of (i) the code designed to calculate the efficiency of power plants and (ii) OS-resources those allow to calculate R ( Y ) at specified points of the power plant cycle. We have discussed some results obtained on the basis of these resources.","authors":["Valery Ochkov","Evgenii Evguenyevich Ustyuzhanin","S V Rykov","V V Shishakov"],"meta":["November 2019Journal of Physics Conference Series 1385(1):012034","DOI:10.1088/1742-6596/1385/1/012034"],"references":["260761540_Pure_and_Pseudo-pure_Fluid_Thermophysical_Property_Evaluation_and_the_Open-Source_Thermophysical_Property_Library_CoolProp","283946814_Thermophysical_databases_From_tables_to_interactive_internet_resources_and_cloud_templates"]}