{"id":"337511172_Parameter_Optimization_for_Computer_Numerical_Controlled_Machining_Using_Fuzzy_and_Game_Theory","abstract":"Under the strict restrictions of international environmental regulations, how to reduce environmental hazards at the production stage has become an important issue in the practice of automated production. The precision computerized numerical-controlled (CNC) cutting process was chosen as an example of this, while tool wear and cutting noise were chosen as the research objectives of CNC cutting quality. The effects of quality optimizing were verified using the depth of cut, cutting speed, feed rate, and tool nose runoff as control parameters and actual cutting on a CNC lathe was performed. Further, the relationships between Fuzzy theory and control parameters as well as quality objectives were used to define semantic rules to perform fuzzy quantification. The quantified output value was introduced into game theory to carry out the multi-quality bargaining game. Through the statistics of strategic probability, the strategy with the highest total probability was selected to obtain the optimum plan of multi-quality and multi-strategy. Under the multi-quality optimum parameter combination, the tool wear and cutting noise, compared to the parameter combination recommended by the cutting manual, was reduced by 23% and 1%, respectively. This research can indeed ameliorate the multi-quality cutting problem. The results of the research provided the technicians with a set of all-purpose economic prospective parameter analysis methods in the manufacturing process to enhance the international competitiveness of the automated CNC industry.","authors":["Chuang","Peng Lan","Yiyi Zhang","Wei Chen"],"meta":["November 2019Symmetry 11(12):1450","DOI:10.3390/sym11121450"],"references":["325925536_Optimization_of_Machining_Parameters_Using_Fuzzy_Taguchi_Method_for_Reducing_Tool_Wear","323682313_Investigation_on_the_use_of_cutting_temperature_and_tool_wear_in_the_turning_of_mild_steel_bars","320635401_Evidential_Supplier_Selection_Based_on_DEMATEL_and_Game_Theory","332362629_Optimization_of_cutting_parameters_considering_tool_wear_conditions_in_low-carbon_manufacturing_environment","328369676_Cutting_parameter_optimization_for_machining_operations_considering_carbon_emissions","326709589_Optimal_production_parameters_under_considerations_of_noise_using_fuzzy_Taguchi_method","324448062_Optimization_of_Cutting_Parameters_for_Minimizing_Environmental_Impact_Considering_Energy_Efficiency_Noise_Emission_and_Economic_Dimension","322277316_An_advanced_retail_electricity_market_for_active_distribution_systems_and_home_microgrid_interoperability_based_on_game_theory","321733341_A_game_theory_approach_for_corporate_environmental_risk_mitigation","284289939_A_Value_for_n-Person_Games"]}