{"id":"337501163_Random_Walks_A_Review_of_Algorithms_and_Applications","abstract":"A random walk is known as a random process which describes a path including a succession of random steps in the mathematical space. It has increasingly been popular in various disciplines such as mathematics and computer science. Furthermore, in quantum mechanics, quantum walks can be regarded as quantum analogues of classical random walks. Classical random walks and quantum walks can be used to calculate the proximity between nodes and extract the topology in the network. Various random walk related models can be applied in different fields, which is of great significance to downstream tasks such as link prediction, recommendation, computer vision, semi-supervised learning, and network embedding. In this article, we aim to provide a comprehensive review of classical random walks and quantum walks. We first review the knowledge of classical random walks and quantum walks, including basic concepts and some typical algorithms. We also compare the algorithms based on quantum walks and classical random walks from the perspective of time complexity. Then we introduce their applications in the field of computer science. Finally we discuss the open issues from the perspectives of efficiency, main-memory volume, and computing time of existing algorithms. This study aims to contribute to this growing area of research by exploring random walks and quantum walks together.","authors":["Feng Xia","Jiaying Liu","Hansong Nie","Yonghao Fu"],"meta":["November 2019IEEE Transactions on Emerging Topics in Computational Intelligence PP(99):1-13","DOI:10.1109/TETCI.2019.2952908"],"references":["320707451_Deterministic_realization_of_superefficient_collective_measurements_via_photonic_quantum_walks","314433386_Knowledge_Acquisition_A_Complex_Networks_Approach","330428300_Simulating_Dynamic_Quantum_Phase_Transitions_in_Photonic_Quantum_Walks","324381151_Principles_of_Random_Walk","321306827_A_Survey_on_Network_Embedding","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","318806382_Observation_of_topological_edge_states_in_parity-time-symmetric_quantum_walks","314795635_Extrapolation_methods_for_accelerating_PageRank_computations","313565837_Random_Walks_and_Electric_Networks","305997704_node2vec_Scalable_Feature_Learning_for_Networks"]}