{"id":"337571454_Using_the_Sonification_for_Hardly_Detectable_Details_in_Medical_Images","abstract":"The inverse sonification problem is investigated in this article in order to detect hardly capturing details in a medical image. The direct problem consists in converting the image data into sound signals by a transformation which involves three steps - data, acoustics parameters and sound representations. The inverse problem is reversing back the sound signals into image data. By using the known sonification operator, the inverse approach does not bring any gain in the sonified medical imaging. The replication of the image already known does not help the diagnosis and surgical operation. In order to bring gains in the medical imaging, a new sonification operator is advanced in this paper, by using the Burgers equation of sound propagation. The sonified medical imaging is useful in interpreting the medical imaging that, however powerful they may be, are never good enough to aid tumour surgery. The inverse approach is exercised on several medical images used to surgical operations.","authors":["Veturia Chiroiu","Ligia Munteanu","Rodica Ioan","Ciprian Dragne"],"meta":["November 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-54080-7","Project: I am preparing with my colleagues to launch of a scientific journal entitled: \"Romanian Journal of Mechanics\" in the frame of \"Romanian Society of Theoretical and Applied Mechanics\"."],"references":["334856217_Direct_Segmented_Sonification_of_Characteristic_Features_of_the_Data_Domain","329738779_On_the_control_of_a_cooperatively_robotic_system_by_using_hibrid_logic_algorithms","321652173_A_Novel_Sonification_Approach_to_Support_the_Diagnosis_of_Alzheimer's_Dementia","279851430_AUGMENTED_AUDIFICATION","272318986_Numerical_simulation_of_pulse_propagation_in_Nonlinear_1-D_media","334997591_Using_the_Sonification_for_Hardly_Detectable_Details_in_Medical_Images","321417588_Direct_Segmented_Sonification_of_Characteristic_Features_of_the_Data_Domain","312271864_The_Information_of_Elementary_Multidimensional_Auditory_Displays","308817206_Sonification_of_3D_body_movement_using_parameter_mapping_technique","267983349_Sound_power_radiation_from_a_vibrating_structure_in_terms_of_structure-dependent_radiation_modes"]}