{"id":"337558673_HyMAD_a_hybrid_memory-aware_DVFS_strategy","abstract":"Non-volatile memories, such as Phase Change Memories (PCM), have interesting energy properties. In effect, their static energy consumption is negligible while the consumed dynamic energy depends on the performed operation (read/write). Several Dynamic Voltage and Frequency Scaling (DVFS) mechanisms have been proposed to optimize the energy consumption of memory-bound tasks in embedded systems. In a hybrid memory, using both DRAM and PCM, these DVFS strategies need to be adapted to take into account the different energy behaviors of both memories. In this paper, we propose a Hybrid Memory-Aware DVFS strategy (HyMAD) to reduce the energy consumption for memory bound tasks. This mechanism relies on both the rate of PCM write operations and the overall memory access rate to tune the CPU frequency. HyMAD takes also into account the priority of a task to tune the \"performance loss\" / \"energy efficiency\" trade-off. We compared HyMAD with a state-of-the-art technique by evaluating the Energy-Squared-Delay product (ED2P). HyMAD ED2P enhancement was evaluated between 2--45% as compared to a system without DVFS and up to 20% as compared to a state-of-the-art DVFS strategy.","authors":["Camelia Slimani","Stéphane Rubini","Jalil Boukhobza"],"meta":["November 2019ACM SIGBED Review 16(3):45-50","DOI:10.1145/3373400.3373407"],"references":["319529366_Emerging_NVM_A_Survey_on_Architectural_Integration_and_Research_Challenges","270282794_Opportunities_for_Nonvolatile_Memory_Systems_in_Extreme-Scale_High_Performance_Computing","260733555_Memory_scaling_A_systems_architecture_perspective","226760979_Compiler-Directed_Dynamic_Frequency_and_Voltage_Scheduling","224585547_PDRAM_a_hybrid_PRAM_and_DRAM_main_memory_system","221628053_Identifying_the_optimal_energy-efficient_operating_points_of_parallel_workloads","4204625_A_Power-Aware_Run-Time_System_for_High-Performance_Computing","4193571_A_dynamic_compilation_framework_for_controlling_microprocessor_energy_and_performance","321505571_Joint_DVFS_and_Parallelism_for_Energy_Efficient_and_Low_Latency_Software_Video_Decoding","220477234_From_Microprocessors_to_Nanostores_Rethinking_Data-Centric_Systems"]}