{"id":"337599629_Ears_on_the_Hand_Reaching_Three-Dimensional_Targets_With_an_Audio-Motor_Device","abstract":"Understanding the processes underlying sensorimotor coupling with the environment is crucial for sensorimotor rehabilitation and sensory substitution. In doing so, devices which provide novel sensory feedback consequent to body movement may be optimized in order to enhance motor performance for particular tasks. The aim of the study reported here was to investigate audio-motor coupling when the auditory experience is linked to movements of the head or the hands. The participants had to localize and reach a virtual source with the dominant hand in response to sounds. An electromagnetic system recorded the position and orientation of the participants’ head and hands. This system was connected to a 3D audio system that provided binaural auditory feedback on the position of the virtual listener located on the participants’ body. The listener’s position was computed either from the hands or from the head. For the hand condition, the virtual listener was placed on the dominant hand (the one used to reach the target) in Experiment 1 and on the non-dominant hand, which was constrained in order to have similar amplitude and degrees of freedom as that of the head, in Experiment 2. The results revealed that, in the two experiments, the participants were able to localize a source within the 3D auditory environment. Performance varied as a function of the effector’s degrees of freedom and the spatial coincidence between sensor and effector. The results also allowed characterizing the kinematics of the hand and head and how they change with audio-motor coupling condition and practice.","authors":["Sylvain Hanneton","Thomas Hoellinger","Vincent Forma","Agnes Roby-Brami"],"meta":["November 2019Multisensory Research 33(4-5):1-23","DOI:10.1163/22134808-20191436","Project: Spatial perception and technical mediation"],"references":["325485669_Movement_Sonification_in_Stroke_Rehabilitation","316467581_Individual_Differences_in_Sensory_Substitution","306921423_Sensori-motor_Learning_With_Movement_Sonification_A_Perspective_From_Recent_Interdisciplinary_Studies","299891243_A_Crossmodal_Perspective_on_Sensory_Substitution","299783471_Navigation_assistance_for_blind_pedestrians_guidelines_for_the_design_of_devices_and_implications_for_spatial_cognition","335919055_Limits_of_the_Classical_Functionalist_Perspective_on_Sensory_Substitution","330569566_Changing_the_way_we_train_surgeons_in_the_21th_century_A_narrative_comparative_review_focused_on_box_trainers_and_virtual_reality_simulators","321974789_Tactile_recognition_of_visual_stimuli_Specificity_versus_generalization_of_perceptual_learning","309958179_Perceptual_attributes_for_the_comparison_of_head-related_transfer_functions","287236453_The_Multisensory_driver_Implications_for_ergonomic_car_interface_design"]}