{"id":"337511742_Nested_multiresolution_hierarchical_simulated_annealing_algorithm_for_porous_media_reconstruction","abstract":"Microstructure strongly influences flow and transport properties of porous media. Flow and transport simulations within porous media, therefore, requires accurate three-dimensional (3D) models of the pore and solid phase structure. To date, no imaging method can resolve all relevant heterogeneities from the nano- to the centimeter scale within complex heterogeneous materials such as clay, reservoir rocks (e.g., travertine, chalk, ...), hardened cement paste, and concrete. To reconstruct these porous materials it is thus necessary to merge information from different 2D and potentially 3D imaging methods. One porous media reconstruction methodology that has been around for at least two decades is simulated annealing (SA). However, realizations with SA typically suffer an artificially reduced long-range connectivity, while multiphase reconstructions are not feasible in most cases because of a prohibitive computational burden. To solve these problems we propose a hierarchical multiresolution and multiphase simulated annealing algorithm. To decrease the computational cost of multiphase simulation, our algorithm sequentially simulates one phase after another, in a hierarchical way, which enables handling multimodal distributions and topological relations. Building upon recent work, our algorithm improves long-range connectivity and CPU efficiency by simulating larger particles using a coarser resolution that is subsequently refined compared to standard SA; our proposed extension not only offers the possibility to perform multiphase reconstruction but also allows us (i) to improve binary reconstruction quality, as quantified, e.g., by multiple-point histograms by up to one order of magnitude and (ii) to achieve an overall speed-up. The proposed algorithm is also shown to outperform the direct sampling multiple-point statistics method for the generation of cement paste microstructure with respect to both generation time and quality.","authors":["Laurent Lemmens","Bart Rogiers","Diederik Jacques","Marijke Huysmans"],"meta":["November 2019PHYSICAL REVIEW E 100(5)","DOI:10.1103/PhysRevE.100.053316"],"references":["329977208_Hierarchical_Optimization_Fast_and_Robust_Multiscale_Stochastic_Reconstructions_with_Rescaled_Correlation_Functions","327099873_Accelerating_Multi-point_Statistics_Reconstruction_Method_for_Porous_Media_via_Deep_Learning","321719286_Stochastic_Reconstruction_of_an_Oolitic_Limestone_by_Generative_Adversarial_Networks","320227808_Inversion_using_a_new_low-dimensional_representation_of_complex_binary_geological_media_based_on_a_deep_neural_network","311842519_Microstructure_Representation_and_Reconstruction_of_Heterogeneous_Materials_Via_Deep_Belief_Network_for_Computational_Material_Design","292609298_Effects_of_carbonation_and_calcium_leaching_on_microstructure_and_transport_properties_of_cement_pastes","322357133_Training-Image-Based_Geostatistical_Inversion_Using_a_Spatial_Generative_Adversarial_Neural_Network","315366711_Numerical_representative_elementary_volume_generation_of_a_simplified_cement_paste_and_estimation_of_its_diffusivity_and_comparison_with_dedicated_experiments","309722794_Application_of_full_set_of_two_point_correlation_functions_from_a_pair_of_2D_cut_sections_for_3D_porous_media_reconstruction","305859615_Physical_Principles_of_Electron_Microscopy"]}