{"id":"337555481_A_gradient_boosting_decision_tree_based_GPS_signal_reception_classification_algorithm","abstract":"In urban areas, GPS signals are often reflected or blocked by buildings, which causes multipath effects and non-line-of-sight (NLOS) reception respectively consequently degrading GPS positioning performance. While improved receiver design can reduce the effect of multipath to some extent, it cannot deal with NLOS. Modelling methods based on measurements have shown promise to reduce the effect of NLOS signal reception. However, this depends on their ability to accurately and reliably classify line-of-sight (LOS), multipath and NLOS signals. The traditional method is based on one feature using signal strength as measured by the carrier to noise ratio, C/N0. However, this feature is ineffective in capturing the characteristics of multipath and NLOS in all environments. In this paper, to improve the accuracy of signal reception classification, we are using the three features of C/N0, pseudorange residuals and satellite elevation angle with a gradient boosting decision tree (GBDT) based classification algorithm. Experiments are carried out to compare the proposed algorithm with classifiers based on decision tree, distance weighted k-nearest neighbour (KNN) and the adaptive network-based fuzzy inference system (ANFIS). Test results from static receivers in urban environments, show that the GBDT based algorithm achieves a classification accuracy of 100%, 82% and 86% for LOS, multipath and NLOS signals, respectively. This is superior to the other three algorithms with the corresponding results of 100%, 82% and 84% for the Distance-Weighted KNN, 99%, 70% and 65% for the ANFIS and 98%, 35% and 95% for the traditional decision tree. With the NLOS detection and exclusion, the proposed GBDT with multi-feature based method can provide a positioning accuracy improvement of 34.1% compared to the traditional C/N0 based method.","authors":["Rui Sun","Guanyu Wang","Wenyu Zhang","Li-Ta Hsu"],"meta":["November 2019Applied Soft Computing 86:105942","DOI:10.1016/j.asoc.2019.105942","Project: urban positioning and navigation"],"references":["329452143_GPS_Signal_Reception_Classification_Using_Adaptive_Neuro-Fuzzy_Inference_System","277606791_3D_building_model-based_pedestrian_positioning_method_using_GPSGLONASSQZSS_and_its_reliability_calculation","268386367_Intelligent_Urban_Positioning_using_Multi-Constellation_GNSS_with_3D_Mapping_and_NLOS_Signal_Detection","259435735_Height_Aiding_C_N_0_Weighting_and_Consistency_Checking_for_GNSS_NLOS_and_Multipath_Mitigation_in_Urban_Areas","258390895_A_Unified_Framework_for_GPS_Code_and_Carrier-Phase_Multipath_Mitigation_Using_Support_Vector_Regression","323786236_GNSS_multipath_detection_using_a_machine_learning_approach","280687718_Greedy_Function_Approximation_A_Gradient_Boosting_Machine","274263499_GNSS_Multipath_and_Jamming_Mitigation_Using_High-Mask-Angle_Antennas_and_Multiple_Constellations","261337019_Breaking_the_1_meter_accuracy_bound_in_commercial_GNSS_devices","252958185_Theory_and_Performance_of_Narrow_Correlator_Spacing_in_a_GPS_Receiver"]}