{"id":"337578579_Social_Community_Detection_Scheme_Based_on_Social-Aware_in_Mobile_Social_Networks","abstract":"Currently many factors can influence community detection in mobile social networks, where node mobility is a key factor to influence the stability of community structure. In this paper, we propose a social community detection scheme for mobile social networks based on social-ware, including social attribute similarity, node interest similarity and node mobility. Compared with other community detection schemes, our proposed scheme can accurately detect the communities based on community attribute and node mobility. The experiments show the numbers of detected communities and members in the maximal size community generated by our scheme are both smaller than those of the GN and NM schemes. Additionally, since the nodes (users) both have higher mobility in mobile social networks, the efficiency of our proposed scheme relatively becomes higher. The experiments show when the values of mobility in the test data sets increase, the running time of our proposed scheme decreases when the number of edges is fixed. For example, the running time of our proposed scheme is about 17s when the maximum value of mobility is set as 0.5 and the number of edges is about 16000, and further the running time is only about 13s when the maximum value of mobility is set as 1. Therefore, our proposed scheme can more accurately and efficiently make community detection to increase the stability of mobile community structure.","authors":["Ke Gu","Dianxing Liu","Keming Wang"],"meta":["November 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2956149"],"references":["332944838_Interest_Characteristic_Probability_Predicted_Method_in_Social_Opportunistic_Networks","330490065_Effective_Data_Communication_Based_on_Social_Community_in_Social_Opportunistic_Networks","327007244_FCNS_A_Fuzzy_Routing-Forwarding_Algorithm_Exploiting_Comprehensive_Node_Similarity_in_Opportunistic_Social_Networks","325656424_PRMS_A_Personalized_Mobile_Search_over_Encrypted_Outsourced_Data","325587067_Social_community_detection_and_message_propagation_scheme_based_on_personal_willingness_in_social_network","325159897_Inter-Community_Detection_Scheme_for_Social_Internet_of_Things_A_Compressive_Sensing_Over_Graphs_Approach","336030656_Secure_Data_Sequence_Query_Framework_Based_on_Multiple_Fogs","335873129_Secure_Data_Query_Framework_for_Cloud_and_Fog_Computing","332518262_A_robust_and_fixed-time_zeroing_neural_dynamics_for_computing_time-variant_nonlinear_equation_using_a_novel_nonlinear_activation_function","323563896_Local_Community_Detection_With_the_Dynamic_Membership_Function"]}