{"id":"337591222_Big_data","abstract":"Big data is a new driver of the world economic and societal changes. The world’s data\nthe collection is reaching a tipping point for major technological changes that can bring new\nways in decision making, managing our health, cities, finance and education. While the\ndata complexities are increasing including data’s volume, variety, velocity and veracity,\nthe real impact hinges on our ability to uncover the `value’ in the data through Big Data\nAnalytics technologies. Big Data Analytics poses a grand challenge on the design of\nhighly scalable algorithms and systems to integrate the data and uncover largely hidden\nvalues from datasets that are diverse, complex, and of a massive scale. Potential\nbreakthroughs include new algorithms, methodologies, systems and applications in Big\nData Analytics that discover useful and hidden knowledge from the Big Data efficiently\nand effectively.\nBig Data Analytics is relevant to Hong Kong as it moves towards a digital economy and\nsociety. Hong Kong is already among the best in the world in Big Data Analytics, taking\nup such leadership positions as chairs and editor in chiefs of important conferences and\njournals in Big Data related areas. But to maintain such leadership positions, Hong\nKong universities, government and industry must act quickly in addressing several\nmajor challenges. These challenges include “foundations,” which concerns new\nalgorithms, theory and methodologies in knowledge discovery from large amounts of\ndata and “systems and applications,” which concerns innovative applications and systems\nuseful for supporting Big Data practices. Big data analytics must also be team effort\ncutting across academic institutions, government and society and industry, and by\nresearchers from multiple disciplines including computer science and engineering, health,\ndata science and social and policy areas.","authors":["Tamojit Das"],"meta":["November 2019","Project: Makemytrip data visualization with Machine Learning and Data Science"],"references":[]}