{"id":"337579559_Studies_in_Informatics_and_Control_A_Bibliometric_Analysis_from_2008_to_2019","abstract":"As an international scientific journal, Studies in Informatics and Control (SIC ) covers the field of Information Technology (IT) and topics related to research areas, as well as important applications in IT, with particular emphasis on Advanced Automatic Control, Modeling and Optimization. SIC has greatly contributed to the areas where it involves since its first online publication way back in 1992. This paper sets out to analyze the structure and the underlying trend of the journal by making use of bibliometric methods. Firstly, the classical indicators are provided to illustrate the performance of the journal. This current study performs an in-depth analysis of the most productive and the most influential authors, institutions, and countries/regions, as well as the most cited research works published in SIC. Secondly, the visualization tools VoS viewer and CiteSpace are used to create scientific maps that may explain the structure of the journal in an intuitionistic way. In the science mapping, the co-citation maps, and the co-authorship networks of various items (such as authors, institutions, and countries/regions) are conducted. Also, the bursts detection of these items are derived. The co-occurrence of keywords and their bursts detection and timeline review are shown, respectively. Finally, some conclusions are given. This paper provides a comprehensive and visual understanding of this well-regarded scientific journal.","authors":["Yang Li","Zeshui Xu","Xinxin Wang","f g Filip"],"meta":["November 2019International Journal of Computers, Communications & Control (IJCCC) 14(6):633-652","DOI:10.15837/ijccc.2019.6.3753"],"references":["336221531_A_Novel_Extended_EDAS_in_Minkowski_Space_EDAS-M_Method_for_Evaluating_Autonomous_Vehicles","335242342_A_bibliometric_overview_of_the_International_Journal_of_Strategic_Property_Management_between_2008_and_2019","332685205_The_evolution_of_Technological_and_Economic_Development_of_Economy_a_bibliometric_analysis","317826226_A_bibliometric_analysis_of_leading_universities_in_innovation_research","350549429_Bibliometric_Analysis_on_Research_Trends_of_International_Journal_of_Computers_Communications_Control","336404746_Generative_Adversarial_Optimization_GOA_for_Acute_Lymphocytic_Leukemia_Detection","319669738_bibliometrix_An_R-tool_for_comprehensive_science_mapping_analysis","319056299_Information_Sciences_1968-2016_A_retrospective_analysis_with_text_mining_and_bibliometric","316178528_Forty_years_of_the_European_Journal_of_Operational_Research_A_bibliometric_overview","309465799_Thirty_Years_of_the_International_Journal_of_Intelligent_Systems_A_Bibliometric_Review"]}