{"id":"337529390_Bibliographic_measures_of_top-tier_finance_and_information_systems_journals","abstract":"Purpose\nPay, tenure and promotion decisions are frequently based upon inferences regarding the value of faculty research. Meanwhile, departmental, college and university reputations are frequently based on perceptions regarding the quality of research being produced by its faculty. Making correct inferences requires accurate measurement of research quality, which is often based upon the journal through which results are shared. This research expands upon the research found elsewhere through its detailed investigation of leading journals in two business disciplines, including examination of four different citation-based measures and four journal characteristics which are exogenous to the quality of any individual piece of research. The paper aims to discuss this issue.\n\nDesign/methodology/approach\nThis study assists in the development of an accurate perspective regarding research quality, by studying the popular Journal Citation Reports (JCR) impact factor. A further expansion on the past literature is consideration of three newer journal quality metrics: SCImago Journal Rank (SJR), Source Normalized Impact per Paper (SNIP) and percentage of articles cited. Top-tier journals in finance and information systems are compared to evaluate the consistency of these measures across disciplines. Differences in journal characteristics and their impact on citation-rate based measures of quality are also examined. The potential impact of discipline-based variation in acceptance rate, issue frequency, the time since journal inception and total reviewers are put forth as additional potential exogenous factors that may impact the perception of journal quality. t -Tests are employed for discipline comparisons, while correlation and multiple regression are used for journal characteristic analysis.\n\nFindings\nThere is a significant difference in the JCR impact measures of high-quality finance journals vs high-quality information systems journals, which are correlated with a variety of journal-specific factors including the journal’s acceptance rate and frequency of issue. Information systems journals domination of finance journals persists whether one considers mean, median, minimum or maximum impact factors. SJR measures for finance journals are consistently higher than information systems journals, though the SJR value of any individual journal can be quite volatile. By comparison, the SNIP metric rates premier information systems journals higher. Over 12 percent more of the articles in leading information systems journals are cited during the initial three years.\n\nResearch limitations/implications\nLogical extensions of this research include examining journals in other business disciplines. One could also evaluate quality measures reaction to variation in journal characteristics (i.e. changes in acceptance rates). Furthermore, one could include other measures of journal quality, including the recently released CiteScore metric. Such research will build on the present research and improve the accuracy of research quality assessment.\n\nPractical implications\nTo the extent that citation-based research measures and journal-specific factors vary across disciplines as demonstrated by our investigation, discipline-specific traits should be considered adjusted for, when making inferences about the long-term value of recently published research. For instance, finance faculty publishing in journals with JCR readings of 2.0 are in journals that are 53 percent above the discipline’s average, while information systems faculty publishing in journals with JCR readings of 2.0 are in journals that are 18 percent below the discipline’s average. Furthermore, discipline-specific differences in journal characteristics, leading to differences in citation-based quality measures, should be considered when making inferences about the long-term value of recently published research in the process of making recommendations regarding salary adjustments, retention and promotion.\n\nSocial implications\nQuantity and quality of research are two hallmarks of leading research institutions. Assessing research quality is very problematic because its definition has changed from being based on review process (i.e. blind refereed), to acceptance rates, to impact factors. Furthermore, the impact factor construct has been a lightning rod of controversy as researchers, administrators and journals themselves argue over which metric to employ. This research is attempting to assess how impact factors and journal characteristics may influence the impact factors, and how these interactions vary business discipline. The research is especially important and relevant to the authors which separately chair departments including finance and information systems faculty, and therefore are in roles requiring assessment of faculty research productivity including quality.\n\nOriginality/value\nThis study is a detailed analysis of bibliographic aspects of the top-tier journals in two quantitative business areas. In addition to the popular JCR, SJR and SNIP measures of performance, the analysis studies the seldom-examined percentage of the article cited metric. A deeper understanding of citation-based measures is obtained though the evaluation of changes in how journals have been rated on these metrics over time. The research shows that there are discipline-related systematic differences in both citation-based research measures and journal-specific factors and that these discipline-specific traits should be considered when making inferences about the long-term value of recently published research. Furthermore, discipline-specific difference in journal characteristics, leading to differences in citation-based quality measures, should be considered when making personnel and remuneration decisions.","authors":["T. M. Krueger","Jack Shorter"],"meta":["November 2019","DOI:10.1108/JARHE-12-2018-0257"],"references":["326488480_Ranking_Accounting_Scholars_Publishing_AIS_and_Technology_Research_in_Accounting_Education","323996103_Determinants_and_Comparison_of_JCR_SJR_and_SNIP_Ratings_of_Finance_Journals","323266533_Overview_of_journal_metrics","316739926_End_of_2016_Can_We_Save_Research_from_Predators_in_2017","305822098_Evaluating_Journal_Quality_A_Review_of_Journal_Citation_Indicators_and_Ranking_in_Business_and_Management","283800383_Defining_and_assessing_research_quality_in_a_transdisciplinary_context","251232745_Evaluating_journal_quality_and_the_Association_for_Information_Systems_Senior_Scholars'_journal_basket_via_bibliometric_measures_Do_expert_journal_assessments_add_value","228317797_Is_Finance_Research_a_'Normal_Science'_A_Bibliometric_Study_of_the_Structure_and_Development_of_Finance_Research_from_1988_to_2007","220260308_Research_Standards_for_Promotion_and_Tenure_in_Information_Systems","220225344_Editorial_Single-_versus_double-blind_reviewing","322867355_Do_Economists_Swing_for_the_Fences_after_Tenure","301664319_Citations_journal_ranking_and_multiple_authorships_evidence_based_on_the_top_300_papers_in_economics","289703189_Big_Data_An_Interdisciplinary_Opportunity_for_Information_Systems_Research","276541220_A_bibliometric_overview_of_the_Journal_of_Business_Research_between_1973_and_2014","222529909_Measuring_contextual_citation_impact_of_scientific_journals","220365058_History_of_the_journal_impact_factor_Contingencies_and_consequences","45920026_The_Source-Normalized_Impact_per_Paper_SNIP_is_a_valid_and_sophisticated_indicator_of_journal_citation_impact","7380639_The_History_and_Meaning_of_the_Journal_Impact_Factor"]}