{"id":"337594557_Relevance_Analysis_and_Visualization_of_Students'_Employment_and_Their_Courses_Achievement","abstract":"Exploring the relationship between college students’ employment and their academic performance is of great significance for optimizing talents training programs and curriculum system, assisting students’ academic planning and employment guidance. In this paper, we present an analysis method for exploring correlation between students’ employment and their academic achievements. Firstly, we divide the students into several groups according to the types of their employment. Then we use box plot matrix to express the distribution of compulsory course achievements for assisting the comparative analysis among different groups of students. In addition, we use the TF-IDF method based on distance weighting to calculate the preference of each group of students quantitatively on various elective courses, and use radar chart to display the results for assisting the analysis of the students’ behaviour in course selection. The method is applied to analyse the course achievement and employment data of students majoring in Computer Science at Beijing Technology and Business University, and some characteristics of the course achievement and course selection behaviour of the students in different groups are obtained. The analysis results show that the method is effective.","authors":["Yi Chen","Xiaoling Li","Xianfa Wang","Yang Hu"],"meta":["November 2019Journal of Physics Conference Series 1345(2):022033","DOI:10.1088/1742-6596/1345/2/022033"],"references":["317138668_Ordered_small_multiple_treemaps_for_visualizing_time-varying_hierarchical_pesticide_residue_data","286109890_Visual_analytics_towards_big_data","258098048_Visualization_of_longitudinal_student_data","254344820_Academic_Performance_of_College_Students_Influence_of_Time_Spent_Studying_and_Working","325352641_Comments_Mining_With_TF-IDF_The_Inherent_Bias_and_Its_Removal","273495035_Sunburst_with_ordered_nodes_based_on_hierarchical_clustering_a_visual_analyzing_method_for_associated_hierarchical_pesticide_residue_data"]}