{"id":"337539513_Machine_Learning_for_Clinical_Decision-Making_Challenges_and_Opportunities","abstract":"The use of machine learning (ML) approaches to target clinical problems is called to revolutionize clinical decision-making. The success of these tools is subjected to the understanding of the intrinsic processes being used during the classical pathway by which clinicians make decisions. In a parallelism with this pathway, ML can have an impact at four levels: for data acquisition, predominantly by extracting standardized, high-quality information with the smallest possible learning curve; for feature extraction, by discharging healthcare practitioners from performing tedious measurements on raw data; for interpretation, by digesting complex, heterogeneous data in order to augment the understanding of the patient status; and for decision support, by leveraging the previous step to predict clinical outcomes, response to treatment or to recommend a specific intervention. This paper discusses the state-of-the-art, as well as the current clinical status and challenges associated with each of these tasks, together with the challenges related to the learning process, the auditability/traceability, the system infrastructure and the integration within clinical processes.","authors":["Sergio Sánchez Martínez","Oscar Camara","Gemma Piella","Maja Cikes"],"meta":["November 2019","DOI:10.20944/preprints201911.0278.v1"],"references":["336068436_A_comparison_of_deep_learning_performance_against_health-care_professionals_in_detecting_diseases_from_medical_imaging_a_systematic_review_and_meta-analysis","334758532_On_the_interpretability_of_machine_learning-based_model_for_predicting_hypertension","334634583_Estimating_the_success_of_re-identifications_in_incomplete_datasets_using_generative_models","334529537_Fully_Automated_Quality-Controlled_Cardiac_Analysis_From_CMR","343546193_GANs_for_Medical_Image_Analysis","335557390_EuroHeart_European_Unified_Registries_On_Heart_Care_Evaluation_and_Randomized_Trials","335246176_Do_no_harm_a_roadmap_for_responsible_machine_learning_for_health_care","335073786_Integrating_deep_and_radiomics_features_in_cancer_bioimaging","335070627_Machine_learning_in_the_electrocardiogram","334981647_State-of-the-Art_Deep_Learning_in_Cardiovascular_Image_Analysis"]}