{"id":"337622622_On_the_Existence_of_Characterization_Logics_and_Fundamental_Properties_of_Argumentation_Semantics","abstract":"Given the large variety of existing logical formalisms it is of utmost importance\nto select the most adequate one for a specific purpose, e.g. for representing\nthe knowledge relevant for a particular application or for using the formalism\nas a modeling tool for problem solving. Awareness of the nature of a logical\nformalism, in other words, of its fundamental intrinsic properties, is indispensable\nand provides the basis of an informed choice.\nOne such intrinsic property of logic-based knowledge representation languages\nis the context-dependency of pieces of knowledge. In classical propositional\nlogic, for example, there is no such context-dependence: whenever two\nsets of formulas are equivalent in the sense of having the same models (ordinary\nequivalence), then they are mutually replaceable in arbitrary contexts (strong\nequivalence). However, a large number of commonly used formalisms are not\nlike classical logic which leads to a series of interesting developments. It turned\nout that sometimes, to characterize strong equivalence in formalism L, we can\nuse ordinary equivalence in formalism L': for example, strong equivalence in\nnormal logic programs under stable models can be characterized by the standard\nsemantics of the logic of here-and-there. Such results about the existence of\ncharacterizing logics has rightly been recognized as important for the study of\nconcrete knowledge representation formalisms and raise a fundamental question:\nDoes every formalism have one? In this thesis, we answer this question\nwith a qualified “yes”. More precisely, we show that the important case of\nconsidering only finite knowledge bases guarantees the existence of a canonical\ncharacterizing formalism. Furthermore, we argue that those characterizing\nformalisms can be seen as classical, monotonic logics which are uniquely determined\n(up to isomorphism) regarding their model theory.\nThe other main part of this thesis is devoted to argumentation semantics\nwhich play the flagship role in Dung’s abstract argumentation theory. Almost\nall of them are motivated by an easily understandable intuition of what should\nbe acceptable in the light of conflicts. However, although these intuitions equip\nus with short and comprehensible formal definitions it turned out that their\nintrinsic properties such as existence and uniqueness, expressibility, replaceability\nand verifiability are not that easily accessible. We review the mentioned\nproperties for almost all semantics available in the literature. In doing so we\ninclude two main axes: namely first, the distinction between extension-based\nand labelling-based versions and secondly, the distinction of different kind of\nargumentation frameworks such as finite or unrestricted ones.","authors":["Ringo Baumann"],"meta":["November 2019","DOI:10.13140/RG.2.2.21831.24483","Thesis for: Dr. rer. nat. habil."],"references":["337673065_If_Nothing_Is_Accepted_-_Repairing_Argumentation_Frameworks","323704721_Expanding_Argumentation_Frameworks_Enforcing_and_Monotonicity_Results","323704637_What_Does_it_Take_to_Enforce_an_Argument_Minimal_Change_in_abstract_Argumentation","323704549_Verifiability_of_Argumentation_Semantics","323704546_An_Abstract_Logical_Approach_to_Characterizing_Strong_Equivalence_in_Logic-based_Knowledge_Representation_Formalisms","323704530_AGM_meets_Abstract_Argumentation_Expansion_and_Revision_for_Dung_Frameworks","323704473_Characterizing_equivalence_notions_for_labelling-based_semantics","323704460_On_the_number_of_bipolar_Boolean_functions","322735601_Metalogical_Contributions_to_the_nonmonotonic_theory_of_abstract_argumentation","329473176_A_general_reinforcement_learning_algorithm_that_masters_chess_shogi_and_Go_through_self-play","318830156_A_Study_of_Unrestricted_Abstract_Argumentation_Frameworks","318829767_A_General_Notion_of_Equivalence_for_Abstract_Argumentation","320137856_Comparing_the_expressiveness_of_argumentation_semantics","314580117_The_Hidden_Power_of_Abstract_Argumentation_Semantics","312970597_A_proposal_for_the_Dartmouth_summer_research_project_on_artificial_intelligence"]}