{"id":"337654925_Online_Discussion_Forum_as_a_Tool_for_Interactive_Learning_and_Communication","abstract":"The digital millennials are very interactive in nature. They love to learn and interact with their peers, teachers, relatives, and environment through digital platforms. These interactions are being facilitated by the increasing rate of internet penetration and emerging digital media across the globe. The nature of today’s learners has increased the demand for use of student-centred learning approach such as Online Discussion Forum (ODF) across different levels of education. Online Discussion Forum (ODF) is being employed as a supportive tool to enhance interactive learning and student-teacher communication. The present study developed an Online Discussion Forum nicknamed “CSC forum” with a view to promote interactive learning, and communication among students, and teachers at the Department of Computer Science, Tai Solarin University of Education, Nigeria. The “CSC forum” facilitates exchange of ideas among students regarding course content and assignments, and also improved the quality of communications and relationship between students and teachers. The platform has a “Live Chat” module where members can engage in active conversations, and participate on group discussions on the go. It also provides a framework for improving the department’s information literacy programme, and specifically students’ participation in active learning as a way of improving their digital literacy skills. Given the relative importance of ODF, teachers are required to devote more time on the forum to provide feedbacks to pending student’s queries/postings, and also to offer clarifications on trending topics being deliberated upon on the forum. The discussion forum presented in this study proved effective for student-teacher interactions, communication and information dissimilation to students on school/departmental activities. More so, the study affirms that teacher guidance is crucial to stimulate student’s interest and participation in online forum. While factors such as poor power supply; low student/teacher commitment, poor quality of postings, Abusive posts, delayed feedbacks, poor internet connections and time constraints were found to limit the success of online forum.","authors":["Edeh Michael Onyema","Edeh Chinecherem Deborah","Alhuseen Omar Alsayed","Noorulhasan Naveed Quadri"],"meta":["November 2019International Journal of Recent Technology and Engineering 8(4):4852-4859","DOI:10.35940/ijrte.D8062.118419","Projects: Make Poverty  HistoryJournal ArticleALL RESEARCHERS WELCOME GLOBAL PLATFORMEducation"],"references":["316276708_Types_of_Interaction_in_Online_Discussion_Forums_A_Case_Study","314473459_Online_Discussion_Forum_A_Tool_for_Effective_Student-Teacher_Interaction","313768677_The_impacts_of_ICT_on_the_students'_Performance_A_Review_of_Access_to_Information","275183602_Web_20_in_Education_the_Impact_of_Discussion_Board_on_Student_Performance_and_Satisfaction","275033058_Perception_of_Students_on_Computer_Utilization_and_Academic_Performance_in_the_North-Central_Geopolitical_Zone_of_Nigeria","236856263_Achieving_better_peer_interaction_in_online_discussion_forums_A_reflective_practitioner_case_study","349130053_Online_Forum_A_Platform_that_Affects_Students'_Learning","303174295_Pattern_of_undergraduate's_participation_in_the_online_discussion_forum_at_the_Univeristy_of_Ilorin_Nigeria","299087342_Using_focused_web-based_discussions_to_enhance_student_engagement_and_deep_understanding","237134188_Toward_a_theory_of_online_learning"]}