{"id":"337634048_Quantum_Representation_of_Indexed_Images_and_its_Applications","abstract":"Indexed images have been widely used in classical digital image processing, however there have been no reports on the representation and applications of indexed images in quantum image processing so far. To solve the representation problem of indexed images on a quantum computer, a quantum indexed image representation (QIIR) method is proposed in the paper. A quantum indexed image consists of a quantum data matrix and a quantum palette matrix. Each data structure is based on the basic states of qubit sequence to represent information, including pixel positions and pixel values in the data matrix, and indexes and color values in the palette matrix. Several simple geometric and color transformations of quantum indexed images are presented later, including orthogonal rotation, cyclic shift, color inversion, color replacement and color look-up. Finally, a quantum indexed image steganography based on EzStego is proposed. In this scheme, the distance between two arbitrary color values in the quantum palette is first calculated, and then several effective color pairs are obtained. At last, according to embedded message bits, pixel values in the data matrix are updated in light of effective color pairs, and a new quantum data matrix with embedded message is obtained. The proposed scheme can be executed on a future quantum computer. The feasibility and validness of this scheme are verified on a classical computer from four aspects: visual quality, embedding capacity, robustness and security.","authors":["Bing Wang","Meng-qi Hao","Pan-chi Li","Zong-bao Liu"],"meta":["February 2020International Journal of Theoretical Physics 59(3)","DOI:10.1007/s10773-019-04331-0"],"references":["328251726_A_novel_quantum_steganography_algorithm_based_on_LSBq_for_multi-wavelength_quantum_images","326163829_An_Optimized_Quantum_Representation_for_Color_Digital_Images","324137786_QRMW_Quantum_representation_of_multi_wavelength_images","323665525_A_Novel_Quantum_Image_Steganography_Scheme_Based_on_LSB","323084928_LSB-based_Steganography_Using_Reflected_Gray_Code_for_Color_Quantum_Images","319233095_A_novel_quantum_LSB-based_steganography_method_using_the_Gray_code_for_colored_quantum_images","301335198_Quantum_Image_Steganography_and_Steganalysis_Based_On_LSQu-Blocks_Image_Information_Concealing_Algorithm","276113170_LSB_Based_Quantum_Image_Steganography_Algorithm","321884889_Color_image_representation_model_and_its_application_based_on_an_improved_FRQI","276481531_Local_feature_point_extraction_for_quantum_images","261013868_SQR_A_simple_quantum_representation_of_infrared_images","257641946_A_novel_quantum_representation_for_log-polar_images_Quantum_Inf","266993000_Quantum_Hilbert_Image_Scrambling","261272641_Image_processing_using_quantum_computing","260529941_Multi-dimensional_color_image_storage_and_retrieval_for_a_normal_arbitrary_quantum_superposition_state"]}