{"id":"337656977_Influence_of_Rider_on_the_Stability_and_Control_of_Two_Wheeled_Vehicles","abstract":"The rider plays an important role in the stability and control of two-wheeled vehicles. The rider model must be designed carefully according to the physical and geometric features of the target two-wheeled vehicle. This paper aims to disclose how the rider affects the control and stability of two-wheeled vehicles. First, the two-wheeled vehicle-rider system was modelled and subjected to dynamic analysis. Next, the motion equations of a two-wheeled vehicle were linearized with forwarding velocity and small disturbances in displacement. Further, the genetic algorithm (GA) was introduced to optimize the parameters of the proportional-integral-derivative (PID) controller, taking the steering torque and lean torque from the rider as the inputs. Finally, the PID controller was compared with the PI and PD controllers through simulation of a two-wheeled vehicle-rider system. The results show that the rider plays the role of derivation action; the motion of the upper body of the rider has a secondary impact on vehicle stability; the rider can stabilize the vehicle through both lean and steering torques generated by his/her upper body movements.","authors":["Garziad Mouad","Abdelmjid Saka"],"meta":["December 2019Journal Européen des Systèmes Automatisés Vol. 52, No. 5:515-520","DOI:10.18280/jesa.520511"],"references":["333778835_A_Comparative_Assessment_between_LQR_and_PID_Strategies_in_Control_of_Two_Wheeled_Vehicle","330314353_Modeling_and_Control_of_an_Active_Stabilizing_Assistant_System_for_a_Bicycle","330208711_Design_and_hardware_selection_for_a_bicycle_simulator","290096310_The_effect_of_tyre_and_rider_properties_on_the_stability_of_a_bicycle","283508730_Sliding_Mode_Control_for_Heart_Rate_Regulation_of_Electric_Bicycle_Riders","328709874_A_Testing_Method_for_the_Prediction_of_Comfort_of_City_Bicycles","318046387_Modelling_and_model_predictive_control_for_a_bicycle-rider_system","285126551_The_stability_of_the_motion_of_a_bicycle","284000673_Modelling_and_Stability_Analysis_of_a_Recumbent_Bicycle_with_Oscillating_Leg_Masses_P131","274369008_The_influence_of_the_dynamic_response_of_the_rider's_body_on_the_open_loop_stability_of_a_bicycle"]}