{"id":"337657181_Ensemble-Based_Hybrid_Context-Aware_Misbehavior_Detection_Model_for_Vehicular_Ad_Hoc_Network","abstract":"Life-saving decisions in vehicular ad hoc networks (VANETs) depend on the availability of highly accurate, up-to-date, and reliable data exchanged by neighboring vehicles. However, spreading inaccurate, unreliable, and false data by intruders create traffic illusions that may cause loss of lives and assets. Although several solutions for misbehavior detection have been proposed to address these issues, those solutions lack adequate representation and the adaptability to vehicular context. The use of predefined static thresholds and lack of comprehensive context representation have rendered the existing solutions limited to specific scenarios and attack types, which impedes their generalizability. This paper addresses these limitations by proposing an ensemble-based hybrid context-aware misbehavior detection system (EHCA-MDS) model. EHCA-MDS has been developed in four phases, as follows. The static thresholds have been replaced by dynamic ones created on the fly by analyzing the spatial and temporal properties of the mobility information collected from neighboring vehicles. Kalman filter-based algorithms were used to collect the mobility information of neighboring vehicles. Three sets of features were then derived, each of which has a different perspective, namely data consistency, data plausibility, and vehicle behavior. These features were used to construct a dynamic context reference using the Hampel filter. The Hampel-based z-score was used to evaluate the vehicles based on their behavioral activities, data consistency, and plausibility. For comprehensive features representation, multifaceted, non-parametric-based statistical classifiers were constructed and updated online using a Hampel filter-based algorithm. For accurate representation, the output of the statistical classifiers, vehicles’ scores, context reference parameters, and the derived features were used as input to an ensemble learning-based algorithm. Such representation helps to identify the misbehaving vehicles more effectively. The proposed EHCA-MDS model was evaluated in the presence of different types of misbehaving vehicles under different context scenarios through extensive simulations, utilizing a real-world traffic dataset. The results show that the accuracy and robustness of the proposed EHCA-MDS under different vehicular dynamic context scenarios were higher than existing solutions, which confirms its feasibility and effectiveness to improve the performance of VANET critical applications.","authors":["Fuad A. Ghaleb","Mohd Aizaini Maarof","Anazida Zainal","Bander Ali Saleh Al-rimy"],"meta":["December 2019Remote Sensing 11(23)","DOI:10.3390/rs11232852"],"references":["339182228_Real-Time_Detection_of_DoS_Attacks_in_IEEE_80211p_Using_Fog_Computing_for_Secure_Intelligent_Vehicular_Network","336952006_Hybrid_and_Multifaceted_Context-Aware_Misbehavior_Detection_Model_for_Vehicular_Ad_Hoc_Network","334397970_Electronics_2019_8_x_doi_FOR_PEER_REVIEW","322779772_An_effective_misbehavior_detection_model_using_artificial_neural_network_for_vehicular_ad_hoc_network_applications","315439003_A_Survey_of_Attacks_and_Detection_Mechanisms_on_Intelligent_Transportation_Systems_VANETs_and_IoV","309388104_Survey_on_Misbehavior_Detection_in_Cooperative_Intelligent_Transportation_Systems","335954870_Context-Aware_Data-Centric_Misbehaviour_Detection_Scheme_for_Vehicular_Ad_Hoc_Networks_using_Sequential_Analysis_of_the_Temporal_and_Spatial_Correlation_of_the_Consistency_between_the_Cooperative_Awar","326306648_Driving-situation-aware_adaptive_broadcasting_rate_scheme_for_vehicular_ad_hoc_network","317790194_Improved_vehicle_positioning_algorithm_using_enhanced_innovation-based_adaptive_Kalman_filter","310403387_A_K-means_clustering_algorithm"]}