{"id":"337638244_Mathematical_Model_of_Emotional_Habituation_to_Novelty_Modeling_with_Bayesian_Update_and_Information_Theory","abstract":"Novelty is an important factor of creativity in product design. Acceptance of novelty, however, depends on one’s emotions. Yanagisawa, the last author, and his colleagues previously developed a mathematical model of emotional dimensions associated with novelty such as arousal (surprise) and valence (positivity and negativity). The model formalized arousal as Bayesian information gain and valence as a function of arousal based on Berlyne’s arousal potential theory. One becomes accustomed to novelty by repeated exposure. This so-called habituation to novelty is important in the design of long-term product experience. We herein propose a mathematical model of habituation to novelty based on the emotional dimension model. We formalized the habituation as a decrement in information gain from a novel event through Bayesian update. We derived the information gained from the repeated exposure of a novel stimulus as a function of three parameters: initial prediction error, initial uncertainty, and noise of sensory stimulus. With the proposed model, we discovered an interaction effect of the initial prediction error and initial uncertainty on habituation. Furthermore, we demonstrate that a range of positive emotions on prediction errors shift toward becoming more novel by repeated exposure. We hypothesize that the ease to become accustomed to novelty depends on the initial uncertainty. To verify this hypothesis, we conducted an experiment with several short videos in which different percussion instruments were played. We manipulated the uncertainty level by the popularity of instruments and prediction error by the congruity between sounds and videos. We used event-related potential P300 amplitudes and the subjective reports of surprise in response to the sounds as measures of arousal levels. The experimental results supported our hypothesis; therefore, the decrement in information gain can be decomposed into initial prediction error and initial uncertainty, and is considered as a valid measure of emotional habituation.","authors":["Takahiro Sekoguchi","Yuki Sakai","Hideyoshi Yanagisawa"],"meta":["October 2019","DOI:10.1109/SMC.2019.8914626","Conference: IEEE International Conference on Systems, Man and Cybernetics (SMC2019)","Projects: Modelling Habituation to NoveltyMathematical Modeling of Emotions"],"references":["330577376_Modeling_Emotions_Associated_With_Novelty_at_Variable_Uncertainty_Levels_A_Bayesian_Approach","232468613_Emotional_Responses_to_Art_From_Collation_and_Arousal_to_Cognition_and_Emotion","23484126_Trial-by-Trial_Fluctuations_in_the_Event-Related_Electroencephalogram_Reflect_Dynamic_Changes_in_the_Degree_of_Surprise","320139483_Model-based_Rehabilitation_from_Sense_of_Agency","235894529_Habituation_effects_of_pleasant_and_unpleasant_odors","225680366_Novelty_complexity_and_hedonic_value","23299422_Bayesian_Surprise_Attracts_Human_Attention","11547841_A_repressive_coping_style_and_affective_facial_and_physiological_responses_to_looking_at_emotional_pictures","6844212_Perceived_stimulus_complexity_and_food_preference_development"]}