{"id":"337618419_Development_of_a_technological_platform_for_teaching_and_training_in_competitive_programming_contests","abstract":"The competitive programming contests are competitions where the programming capacity and algorithm of the participants are measured. The objective of this work was to develop and implement a framework to formalize the working methodology of the competitive programming study group of the Universidad Francisco de Paula Santander and to develop a web-based training platform to monitor the work carried out within the study group. The intention with this platform is to give the students the tools they need to carry out their training, from the platform the student can study, can practice, can compete, and can improve their skills both in competitive programming, as well as in areas of programming and computer science. This work was carried out following an iterative methodology composed of the following phases: initially, the project has been formalized, analysis of the problem, preliminary details, and formation of the state of the art and theoretical reference. Then, the initial state of the group is diagnosed, a solution is proposed. After refining this solution proposal. Once implemented, information and metrics are gathered and the results are analyzed, already with a functional framework and a web platform, to detect problems and improvements, restarting the phases, for improving in each step those aspects that can be enhanced. The results obtained in the national and international contest have improved considerably and the participation and satisfaction of the students who are part of the study group were increased. The technological platform developed constitutes a confluence point for the study group, and a clear guideline to follow to advance in the process of continuous improvement that allows the university to achieve the best results in national and international programming competitions.","authors":["G Y L치zaro Carrillo","A M Delgado Le칩n","M J Vera Contreras","Fredy Humberto Vera-Rivera"],"meta":["November 2019Journal of Physics Conference Series 1386(1):012145","DOI:10.1088/1742-6596/1386/1/012145","Project: Desarrollo e implementaci칩n de un marco de trabajo para el entrenamiento en programaci칩n competitiva"],"references":[]}