{"id":"337686975_Cyber_security_education_is_as_essential_as_the_three_R's","abstract":"Smartphones have diffused rapidly across South African society and constitute the most dominant information and communication technologies in everyday use. That being so, it is important to ensure that all South Africans know how to secure their smart devices. Doing so requires a high level of security awareness and knowledge. As yet, there is no formal curriculum addressing cyber security in South African schools. Indeed, it seems to be left to universities to teach cyber security principles, and they currently only do this when students take computing-related courses. The outcome of this approach is that only a very small percentage of South Africans, i.e. those who take computing courses at university, are made aware of cyber security risks and know how to take precautions. In this paper we found that, because this group is overwhelmingly male, this educational strategy disproportionately leaves young South African women vulnerable to cyber-attacks. We thus contend that cyber security ought to be taught as children learn the essential \"3 Rs\"-delivering requisite skills at University level does not adequately prepare young South Africans for a world where cyber security is an essential skill. Starting to provide awareness and knowledge at primary school, and embedding it across the curriculum would, in addition to ensuring that people have the skills when they need them, also remove the current gender imbalance in cyber security awareness.","authors":["Isabella M Venter","Renette Blignaut","Karen Renaud","M. Anja Venter"],"meta":["December 2019Heliyon 5(12):e02855","DOI:10.1016/j.heliyon.2019.e02855","Project: Security awareness of student mobile phone users "],"references":["324228918_Evaluation_of_Game-Based_Learning_in_Cybersecurity_Education_for_High_School_Students","321383755_Correlating_Human_Traits_and_Cybersecurity_Behavior_Intentions","315954393_M-Commerce_and_Mobile_Apps_Opportunities_for_SMEs_in_Developing_Countries","311776913_The_Digital_Gender_Divide_Confronting_Obstacles_to_Women's_Development_in_Africa","309311875_Cultural_and_Psychological_Factors_in_Cyber-Security","347494813_Whole_School_Curriculum_Development_In_The_Primary_School","327373670_Is_the_responsibilization_of_the_cyber_security_risk_reasonable_and_judicious","327100288_An_exploratory_study_of_cyber_hygiene_behaviors_and_knowledge","311715470_Gender_difference_and_employees'_cybersecurity_behaviors","309019969_Domestication_of_Free_Wi-Fi_Amongst_People_Living_in_Disadvantaged_Communities_in_the_Western_Cape_Province_of_South_Africa"]}