{"id":"337630981_Global_optimization_of_metasurface_designs_using_statistical_learning_methods","abstract":"Optimization of the performance of flat optical components, also dubbed metasurfaces, is a crucial step towards their implementation in realistic optical systems. Yet, most of the design techniques, which rely on large parameter search to calculate the optical scattering response of elementary building blocks, do not account for near-field interactions that strongly influence the device performance. In this work, we exploit two advanced optimization techniques based on statistical learning and evolutionary strategies together with a fullwave high order Discontinuous Galerkin Time-Domain (DGTD) solver to optimize phase gradient metasurfaces. We first review the main features of these optimization techniques and then show that they can outperform most of the available designs proposed in the literature. Statistical learning is particularly interesting for optimizing complex problems containing several global minima/maxima. We then demonstrate optimal designs for GaN semiconductor phase gradient metasurfaces operating at visible wavelengths. Our numerical results reveal that rectangular and cylindrical nanopillar arrays can achieve more than respectively 88% and 85% of diffraction efficiency for TM polarization and both TM and TE polarization respectively, using only 150 fullwave simulations. To the best of our knowledge, this is the highest blazed diffraction efficiency reported so far at visible wavelength using such metasurface architectures.","authors":["Mahmoud M. R. Elsawy","Stéphane Lanteri","Régis Duvigneau","Briere Gauthier"],"meta":["November 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-53878-9"],"references":["333449559_High-efficiency_large-area_topology-optimized_metasurfaces","332274349_An_Etching-Free_Approach_Toward_Large-Scale_Light-Emitting_Metasurfaces","330743794_Optimization_and_uncertainty_quantification_of_gradient_index_metasurfaces","330636263_Intelligent_nanophotonics_Merging_photonics_and_artificial_intelligence_at_the_nanoscale","330522327_Achromatic_metalens_array_for_full-colour_light-field_imaging","326558725_Adaptive_Genetic_Algorithm_for_Optical_Metasurfaces_Design","326497916_Reconfigurable_near-IR_metasurface_based_on_Ge_2_Sb_2_Te_5_phase-change_material","325519480_Nanophotonic_Particle_Simulation_and_Inverse_Design_Using_Artificial_Neural_Networks","327615121_A_Generative_Model_for_the_Inverse_Design_of_Metasurfaces","325775721_Neural_network_based_design_of_metagratings"]}