{"id":"337610514_PREPARATION_OF_THE_FUTURE_COMPUTER_SCIENCE_TEACHERS_FOR_TEACHING_OF_THE_EDUCATIONAL_ROBOTICS_IN_SCHOOLS","abstract":"Abstract. Introduction. The paper is examined of the questions of substantiation of relevance of preparation of future computer science teachers for implementation of the educational robotics in the learning process of Ukrainian schools. The current state of development of robotics as applied field and as educational trend is analyzed to solve the research problems.\nThe research purposes are to substantiate of relevance and importance of preparation of future computer science teachers for implementation and training of educational robotics into Ukrainian schools; to define of the ways of implementation of the educational robotics into school education and the ways of training of the future teachers who will teach educational robotics at schools (future robotics teachers).\nThe research methods. The study are used research methods such as analysis of the educational robotics development in Ukraine; analysis of data collected on thematic events related to robotics; systems analysis of scientific and methodological sources, analysis of Internet sources related to robotics; analysis of the survey results of the Ukrainian educators and scholars to determine the relevance and importance of teaching educational robotics in Ukrainian schools.\nResults. Taking into account the conducted research the necessity of introducing of the educational robotics are substantiated as a compulsory component of school education and the need of training of qualified teachers in this field; the ways of educational robotics implementation into the learning process of educational institutions are offered. We believe that the most ready to teach of the educational robotics in schools are the future computer science teachers till the educational field \"Robotics\" is absent according to the Ukrainian state education standard.\nOriginality. Training of future specialists in the field of robotics requires of updating of the content in school and university education according with the requirements of nowadays. Therefore, the issue of implementation of the robotics into the learning process of higher education institutions as a mandatory component of the training of future teachers is to particular importance today. The first in Ukraine curriculums for training of the future computer science teachers in educational robotics were designed the National Pedagogical Dragomanov University (Kyiv, Ukraine) in 2018. These students will be able to teach computer science and educational robotics at schools after finishing their study at university.\nConclusions. The conducted study confirms the hypothesis that there is currently a social demand in studying of educational robotics in Ukrainian schools and the training (retraining) of teachers who will teach of the educational robotics. Curriculums in the specialty 014.09 \"Secondary education (Computer Science)\" were developed at the Faculty of Informatics of the National Pedagogical Dragomanov University (Kyiv, Ukraine) for preparing of the future computer science teachers, who will teach of the educational robotics – future robotics teachers (BSc and MSc levels). In the prospect of our further research are to track of the trends in the robotics field to update the teaching content of the educational robotics in pedagogical university.\nKey words: robotics; educational robotics; future computer science teachers; future robotics teachers.","authors":["Oksana Strutynska"],"meta":["November 2019","DOI:10.31651/2524-2660-2019-3-178-189","Project: Educational robotics"],"references":["336198477_ACTUALITY_OF_IMPLEMENTATION_OF_EDUCATIONAL_ROBOTICS_IN_UKRAINIAN_SCHOOL","330471205_Educational_robotics_as_a_prospective_trend_in_stem-education_development"]}