{"id":"337646095_Need_for_a_common_typology_of_climate_services","abstract":"A comprehensive typology or characterization of the various types of climate services is needed to give an overview that makes (potential) users aware of which climate services are available and where to look for them. It helps identify existing gaps in terms of unserved needs of the users. Different ways of characterizing climate services are used in practice. The factors used for this characterization differ depending on the intended application of the service, the delivery mechanism and project- or user-specific needs. In this paper we discuss the advantages and challenges of using different characterization factors, such as sectors, themes, regions, purposes, time horizons, data sources, level of processing of climate data, background knowledge and type of climate services providers. Some recommendations are given on the factors to use for a common typology of climate services which are understood by a wide range of users. It may be difficult to create a single common typology that will also be understood by users with little background knowledge on climate data. Intermediaries, providing training resources and guidance at web portals on how to use and interpret climate information, can be essential to overcome this problem. Gap analysis is used to compare available and required climate services. Therefore, we advise to use the same typology for the analysis of gaps in available climate services. Keywords: Climate services, Typology, Sector specific, Region specific","authors":["Janette Bessembinder","Marta Terrado","Chris Hewitt","Natalie Laura Garrett"],"meta":["November 2019Climate Services 16:100135","DOI:10.1016/j.cliser.2019.100135"],"references":["328956661_Evaluation_transdisziplinarer_Forschung_und_deren_Rahmenbedingungen_Voruberlegungen_zur_Nutzung_im_Bereich_von_Klimaservice","316085037_The_IMPACT2C_web-atlas_-_Conception_organization_and_aim_of_a_web-based_climate_service_product","268693572_Climate_service_development_delivery_and_use_in_Europe_at_monthly_to_inter-annual_timescales","262679788_Climate_services_for_society_Origins_institutional_arrangements_and_design_elements_for_an_evaluation_framework","249921167_Perspectives_on_Policy_Analysis_A_Framework_for_Understanding_and_Design","319431235_Improving_the_use_of_climate_information_in_decision-making","303497509_Climate_change_impact_modelling_needs_to_include_cross-sectoral_interactions","283715372_The_rise_of_demand-driven_climate_services","258686527_The_Global_Framework_for_Climate_Services","248516167_Climate_research_and_policy_advice_scientific_and_cultural_constructions_of_knowledge"]}