{"id":"337672593_Didactic_Methods_of_Integrating_Programming_in_Mathematics_in_Primary_School_-_Findings_From_a_Swedish_National_Project","abstract":"The association between mathematics and programming in an educational context is not new. Today, programming has been introduced into curricula worldwide for younger children. In the Swedish case, primary school teachers are expected to integrate programming in mathematics education from autumn 2018. However, Swedish teachers' knowledge of programming and programming didactics is limited. Meanwhile, there is little research on K-9 programming education. This has led to the dilemma that the mathematics teachers have limited support in didactic knowledge and good examples. This study reports on a teacher professional development project in programming. More specifically, teachers used Lesson Study to plan, execute, and evaluate lessons that integrated programming into various school subjects in elementary school. This study analyzed the didactic strategies developed in 10 lesson studies, as well as mapped the opportunities and challenges of pupils' learning in the mathematics subject. The result was the identification of three didactic strategies, which were analog programming, robot programming and block programming, as well as 11 didactic methods applied within these strategies. The paper contributes with examples of the didactic methods that teachers have developed and evaluated using lesson study. The paper further provides insights on how teachers can take progression into account by applying the three didactic strategies. At last but not least, the study shows a great need for teachers to develop computational thinking abilities.","authors":["Gashawa Ahmed","Jalal Nouri","Lechen Zhang","Eva Norén"],"meta":["February 2020","DOI:10.1145/3328778.3366839","Conference: SIGCSE’ 20: 51th ACM Technical Symposium on Computer Science EducationAt: Portland, OR, USA","Project: Didactical design of programming education"],"references":["333642505_Development_of_computational_thinking_digital_competence_and_21st_century_skills_when_learning_programming_in_K-9","325485002_Teaching_and_learning_mathematics_in_primary_school_through_Scratch","312119278_Bridging_Primary_Programming_and_Mathematics_Some_Findings_of_Design_Research_in_England","331477197_A_lesson_study_on_programming_as_an_instrument_to_learn_mathematics_and_social_science_in_primary_school","326840767_Coding_as_a_Playground_Programming_and_Computational_Thinking_in_the_Early_Childhood_Classroom","325355727_Coding_playgrounds_and_literacy_in_early_childhood_education_The_development_of_KIBO_robotics_and_ScratchJr","325332819_Programmering_Introduktion_till_digital_kompetens_i_grundskolan","322656147_Digital_kompetens_i_informationssamhallet","322592823_Didactical_strategies_employed_by_teachers_when_teaching_programming_in_K-9_education","321148013_Introducing_Programming_and_Digital_Competence_in_Swedish_K-9_Education"]}