{"id":"337621557_Big_Spatiotemporal_Data_Anlyatics_A_Research_and_Innovation_Frontier","abstract":"The integration of space and time into a spatiotemporal framework enables us to obtain unprecedented information and knowledge to tackle many challenging scientific questions and engineering problems. The key to such enablement is our capability to analyze, fuse, mine, learn, simulate, and visualize patterns and relationships embeded in Big Spatiotemporal Data. The past few years have seen significant advancements in this critical research field, with increasing numbers of publications and engagement with many research domains. We have organized this special section to capture a sample of such advancements and included a review with the following observations: a) the fundamentals of the Big Spatiotemporal Data Analytics lie in utilizing domain knowledge and applied mathematics to foster spatiotemporal thinking; b) many existing tools are useful for delivering functionalities for processing Big Spatiotemporal Data; however, new analytics (algorithms, tools, and software) are needed to obtain integrated and actionable information and knowledge; c) the domains enabled by Big Spatiotemporal Data Analytics are quite diverse, ranging from social, medical, physical, economic, and cognitive fields to the spatial sciences, and this interdisciplinarity creates an opportunity for GIS research to make cross-cutting contributions to discovering new knowledge and to addressing grand engineering challenges; d) computing techniques are a key to enable and improve the efficiency of Big Spatiotemporal Data Analytics given the intensity of data volume and processing as well as the complexities of spatiotemporal principles, and patterns embeded in the Big Spatiotemporal Data; and e) the challenges call for a series of innovations in spatiotemporal thinking, algorithms, tools, models, software, and applications to drive a new generation of GIS that can improve our daily lives.","authors":["Chaowei Yang","Keith Clarke","Shashi Shekhar","C. Vincent Tao"],"meta":["April 2020International Journal of Geographical Information Science 34(3)","DOI:10.1080/13658816.2019.1698743","Project: NSF I/UCRC for Spatiotemporal Thinking, Computing and Application"],"references":["334581390_A_Big_Data_Analysis_of_PM25_and_PM10_from_Low_Cost_Air_Quality_Sensors_near_Traffic_Areas","333183573_Big_Earth_data_analytics_a_survey","333099357_Rapid_Transit_Systems_Smarter_Urban_Planning_Using_Big_Data_In-Memory_Computing_Deep_Learning_and_GPUs","333043066_Rescuing_troves_of_hidden_ecological_data_to_tackle_emerging_mosquito-borne_diseases","332738916_SOVAS_A_Scalable_Online_Visual_Analytic_System_for_Big_Climate_Data_Analysis","345496806_Artificial_Intelligence_in_IoT","337497957_Data-driven_approach_to_characterize_urban_vitality_how_spatiotemporal_context_dynamically_defines_Seoul's_nighttime","334508966_Extracting_activity_patterns_from_taxi_trajectory_data_A_two-layer_framework_using_spatio-temporal_clustering_Bayesian_probability_and_Monte_Carlo_simulation","333072652_Detection_on_Abnormal_Usage_of_Spectrum_by_Electromagnetic_Data_Mining","332923805_Big_data_and_natural_disasters_New_approaches_for_spatial_and_temporal_massive_data_analysis"]}