{"id":"337685994_Teleportation-based_quantum_homomorphic_encryption_scheme_with_quasi-compactness_and_perfect_security","abstract":"Quantum homomorphic encryption (QHE) is an important cryptographic technology for delegated quantum computation. It enables remote server to perform quantum computation on encrypted data, and the specific algorithm performed by Server is unnecessarily known by Client. Quantum fully homomorphic encryption (QFHE) is a QHE that satisfies both compactness and F-homomorphism (homomorphic for any quantum circuits). However, Yu et al. (Phys Rev A 90:050303, 2014) proved a negative result: Assume interaction is not allowed, it is impossible to construct perfectly secure QFHE scheme. So this article focuses on non-interactive and perfectly secure QHE scheme with loose requirement, e.g., quasi-compactness. This article defines encrypted gate, which is denoted by EG[U]:|α⟩→(a,b),Enca,b(U|α⟩). We present a gate-teleportation-based two-party computation scheme for EG[U], where one party gives arbitrary quantum state |α⟩ as input and obtains the encrypted U-computing result Enca,b(U|α⟩), and the other party obtains the random bits a, b. Based on EG[Px](x∈{0,1}), we propose a method to remove the P-error generated in the homomorphic evaluation of T/T†-gate. Using this method, we design two non-interactive and perfectly secure QHE schemes named GT and VGT. Both of them are F-homomorphic and quasi-compact (the decryption complexity depends on the T/T†-gate complexity). Assume F-homomorphism, non-interaction and perfect security are necessary properties, the quasi-compactness is proved to be bounded by Ω(M), where M is the total number of T/T†-gates in the evaluated circuit. We prove VGT is M-quasi-compact and reaches the optimal bound. According to our QHE schemes, the decryption would be inefficient when the evaluated circuit contains exponential number of T/T†-gates. Thus, our schemes are suitable for homomorphic evaluation of any quantum circuit with low T/T†-gate complexity, such as any polynomial-size quantum circuit or any quantum circuit with polynomial number of T/T†-gates.","authors":["Min Liang"],"meta":["December 2019Quantum Information Processing 19(1)","DOI:10.1007/s11128-019-2529-6"],"references":["316617724_On_statistically-secure_quantum_homomorphic_encryption","316163257_Interactive_Proofs_for_Quantum_Computations","301879111_Quantum_homomorphic_encryption_for_polynomial-size_circuits","273640259_Quantum_fully_homomorphic_encryption_scheme_based_on_quantum_fault-tolerant_construction","268525365_A_quantum_approach_to_homomorphic_encryption","319391833_Quantum_Fully_Homomorphic_Encryption_With_Verification","316471060_Limitations_on_Transversal_Computation_through_Quantum_Homomorphic_Encryption","305472505_Quantum_Homomorphic_Encryption_for_Polynomial-Sized_Circuits","280773270_Quantum_homomorphic_encryption_from_quantum_codes","270287377_Quantum_Homomorphic_Encryption_for_Circuits_of_Low_T-gate_Complexity","266747933_Quantum_fully_homomorphic_encryption_scheme_based_on_universal_quantum_circuit","263012365_Limitations_on_information_theoretically_secure_quantum_homomorphic_encryption","259826560_Quantum_computing_on_encrypted_data","259983793_Efficient_Universal_Blind_Quantum_Computation","236215226_Symmetric_quantum_fully_homomorphic_encryption_with_perfect_security"]}