{"id":"337782925_Real-time_gastric_polyp_detection_using_convolutional_neural_networks","abstract":"Computer-aided polyp detection in gastric gastroscopy has been the subject of research over the past few decades. However, despite significant advances, automatic polyp detection in real time is still an unsolved problem. In this paper, we report on a convolutional neural network (CNN) for polyp detection that is constructed based on Single Shot MultiBox Detector (SSD) architecture and which we call SSD for Gastric Polyps (SSD-GPNet). To take full advantages of feature maps' information from the feature pyramid and to acquire higher accuracy, we re-use information that is abandoned by Max-Pooling layers. In other words, we reuse the lost data from the pooling layers and concatenate that data as extra feature maps to contribute to classification and detection. Meanwhile, in the feature pyramid, we concatenate feature maps of the lower layers and feature maps that are deconvolved from upper layers to make explicit relationships between layers and to effectively increase the number of channels. The results show that our enhanced SSD for gastric polyp detection can realize real-time polyp detection with 50 frames per second (FPS) and can improve the mean average precision (mAP) from 88.5% to 90.4%, with only a little loss in time-performance. And the further experiment shows that SSD-GPNet has excellent performance in improving polyp detection recalls over 10% (p = 0.00053), especially in small polyp detection. This can help endoscopic physicians more easily find missed polyps and decrease the gastric polyp miss rate. It may be applicable in daily clinical practice to reduce the burden on physicians.","authors":["Xu Zhang","Fei Chen","Tao Yu","Jiye An"],"meta":["March 2019PLoS ONE 14(3):e0214133","DOI:10.1371/journal.pone.0214133"],"references":["332814133_Enhancement_of_SSD_by_concatenating_feature_maps_for_object_detection","320052521_Gastric_precancerous_diseases_classification_using_CNN_with_a_concise_model","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","313448887_Comparative_Validation_of_Polyp_Detection_Methods_in_Video_Colonoscopy_Results_From_the_MICCAI_2015_Endoscopic_Vision_Challenge","323350052_Convolutional_neural_networkasa_feature_extractor_for_automatic_polyp_detection","322509828_Application_of_artificial_intelligence_using_a_convolutional_neural_network_for_detecting_gastric_cancer_in_endoscopic_images","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","315187326_Deep_Learning_in_Medical_Image_Analysis"]}