{"id":"337798139_Detecting_New_Word_Meanings_A_Comparison_of_Word_Embedding_Models_in_Spanish","abstract":"Semantic neologisms (SN) are defined as words that acquire a new word meaning while maintaining their form. Given the nature of this kind of neologisms, the task of identifying these new word meanings is currently performed manually by specialists at observatories of neology. To detect SN in a semi-automatic way, we developed a system that implements a combination of the following strategies: topic modeling, keyword extraction, and word sense disambiguation. The role of topic modeling is to detect the themes that are treated in the input text. Themes within a text give clues about the particular meaning of the words that are used, for example: viral has one meaning in the context of computer science (CS) and another when talking about health. To extract keywords, we used TextRank with POS tag filtering. With this method, we can obtain relevant words that are already part of the Spanish lexicon. We use a deep learning model to determine if a given keyword could have a new meaning. Embeddings that are different from all the known meanings (or topics) indicate that a word might be a valid SN candidate. In this study, we examine the following word embedding models: Word2Vec, Sense2Vec, and FastText. The models were trained with equivalent parameters using Wikipedia in Spanish as corpora. Then we used a list of words and their concordances (obtained from our database of neologisms) to show the different embeddings that each model yields. Finally, we present a comparison of these outcomes with the concordances of each word to show how we can determine if a word could be a valid candidate for SN.","authors":["Andrés Torres Rivera","Juan-Manuel Torres-Moreno"],"meta":["December 2019","DOI:10.3166/RIA.XX.1-17"],"references":["338286636_An_Ensemble_of_Automatic_Keyword_Extractors_TextRank_RAKE_and_TAKE","284476537_sense2vec_-_A_Fast_and_Accurate_Method_for_Word_Sense_Disambiguation_In_Neural_Word_Embeddings","281329235_De_la_quenelle_culinaire_a_la_quenelle_politique_identification_de_changements_semantiques_a_l'aide_des_Topic_Models","330656280_NeoTag_a_POS_Tagger_for_Grammatical_Neologism_Detection","319770220_Bag_of_Tricks_for_Efficient_Text_Classification","301875157_Variations_of_the_Similarity_Function_of_TextRank_for_Automated_Summarization","289596928_Improved_Automatic_Keyword_Extraction_Based_on_TextRank_Using_Domain_Knowledge","282308775_Le_Logoscope_une_approche_textuelle_de_la_veille_neologique_Des_raisons_linguistiques_a_l'interface_web","282213018_Neologismes_de_sens_contribution_a_leur_caracterisation_dans_un_corpus_autour_du_theme_de_la_crise_financiere","280989685_Extraction_automatique_et_types_de_nEologismes_Une_nEcessaire_clarification"]}