{"id":"337716557_A_polynomial_time_algorithm_for_big_data_in_a_special_case_of_minimum_constraint_removal_problem","abstract":"The minimum constraint removal (MCR) is one of the most important problems in motion planning and computational geometry. In this problem, there is no feasible path for a robot to move from the starting point towards the goal. Therefore, in order to find a collision-free path, the minimum constraints should be removed. The MCR problem is NP-hard when constraints have arbitrary shapes or are in shape of convex polygons. Since it is not possible to solve the problem by deterministic algorithms in an acceptable time for the problem with big data, scientists have tried to solve it by approximation methods. In this paper, we present a deterministic (not approximation) algorithm that solve the problem in a polynomial time. The simplification we used here is about the type of data (neither about the accuracy of the solution, nor about the size of data set). In this paper, a special case of this problem is presented, in which all the constraints are axis-aligned-unit squares and the obstacles have only local effects. Local effect means there are no two cells which have the same label sets. We propose an algorithm for this variant of the problem which can be used for big data. The proposed algorithm has O(n3) time complexity in the worst case.","authors":["Bahram Sadeghi Bigham","Fariba Noorizadeh","Salman Khodayifar"],"meta":["June 2020Evolutionary Intelligence 13(04):1-8","DOI:10.1007/s12065-019-00331-5"],"references":["48267322_Navigation_Among_Movable_Obstacles_Real-Time_Reasoning_in_Complex_Environments","3902392_Disconnection_proofs_for_motion_planning","340391958_Improved_approximation_bounds_for_the_minimum_constraint_removal_problem","333227715_Arc_Consistency_Revisited","314582200_Minimum_Constraint_Displacement_Motion_Planning","297617157_Solving_Minimum_Constraint_Removal_MCR_Problem_Using_a_Social-Force-Model-Based_Ant_Colony_Algorithm","288157826_A_simple_but_NP-hard_motion_planning_problem","262324590_The_Minimum_Constraint_Removal_Problem_with_Three_Robotics_Applications","221290737_Approximating_Barrier_Resilience_in_Wireless_Sensor_Networks","220081471_Paths_and_Cycles_in_Colored_Graphs"]}