{"id":"337731169_International_journal_of_advanced_scientific_and_technical_research_A_Review_on_Spatiao-temoparally_Continuous_Video_Inpainting","abstract":"Old films are constructed and saved on different base platforms such as tapes or old magnetic disks. To convert these vintage films in digitized form is a hectic task. Video inpainting is an emerging branch of multimedia science which deals with the conversion and repairing of vintage films. It is an important video enhancement technique used to facilitate the repair or editing of digital videos. To preserve the cultural artifacts such as vintage videos/films into digital formats, this inpainting is used widely in computer science. As the quality of vintage videos is usually very poor and these videos often contain unstable luminance, intensities and damaged contents. In this method a video inpainting algorithm for repairing damaged content in digitized vintage films. This algorithm also maintains good spatiotemporal continuity between the successive frames of video. This algorithm uses mainly two techniques i.e. Motion Completion and Frame completion. Motion completion recovers missing motion information in damaged areas. This maintains good temporal continuity. Frame completion repairs damaged frames to produce a visually pleasing video by using inter-frame correlation with good spatial continuity and smooth luminance. Stabilized luminance gives pleasant visual effect to video.","authors":["A Shinde","S Kushal","Patel","Santosh Shinde"],"meta":["December 2019"],"references":["224217847_Video_Inpainting_on_Digitized_Vintage_Films_via_Maintaining_Spatiotemporal_Continuity","8264912_Region_Filling_and_Object_Removal_by_Exemplar-Based_Image_Inpainting","6534338_Video_Inpainting_Under_Constrained_Camera_Motion","4082213_Video_repairing_Inference_of_foreground_and_background_under_severe_occlusion","3424261_Novel_cross-diamond-hexagonal_search_algorithms_for_fast_block_motion_estimation","246598201_Kalman_Filter_for_vision_tracking","220647338_Efficient_object-based_video_inpainting","2920679_Fragment-Based_Image_Completion"]}