{"id":"337771372_Performance_heuristics_for_GR1_synthesis_and_related_algorithms","abstract":"Reactive synthesis for the GR(1) fragment of LTL has been implemented and studied in many works. In this work we present and evaluate a list of heuristics to potentially reduce running times for GR(1) synthesis and related algorithms. The list includes several heuristics for controlled predecessor computation and BDDs, early detection of fixed-points and unrealizability, fixed-point recycling, and several heuristics for unrealizable core computations. We have implemented the heuristics and integrated them in our synthesis environment Spectra Tools, a set of tools for writing specifications and running synthesis and related analyses. We evaluate the presented heuristics on SYNTECH15, a total of 78 specifications of 6 autonomous Lego robots, on SYNTECH17, a total of 149 specifications of 5 autonomous Lego robots, all written by 3rd year undergraduate computer science students in two project classes we have taught, as well as on benchmarks from the literature. The evaluation investigates not only the potential of the suggested heuristics to improve computation times, but also the difference between existing benchmarks and the robot’s specifications in terms of the effectiveness of the heuristics. Our evaluation shows positive results for the application of all the heuristics together, which get more significant for specifications with slower original running times. It also shows differences in effectiveness when applied to different sets of specifications. Furthermore, a comparison between Spectra, with all the presented heuristics, and two existing tools, RATSY and Slugs, over two well-known benchmarks, shows that Spectra outperforms both on most of the specifications; the larger the specification, the faster Spectra becomes relative to the two other tools.","authors":["Elizabeth Firman","Shahar Maoz","Jan Oliver Ringert"],"meta":["April 2020Acta Informatica 57(4)","DOI:10.1007/s00236-019-00351-9"],"references":["335425475_Symbolic_Repairs_for_GR1_Specifications","321344126_Performance_Heuristics_for_GR1_Synthesis_and_Related_Algorithms","321344051_The_4th_Reactive_Synthesis_Competition_SYNTCOMP_2017_Benchmarks_Participants_Results","318868848_A_symbolic_justice_violations_transition_system_for_unrealizable_GR1_specifications","310769467_Interpolation-Based_GR1_Assumptions_Refinement","309614547_On_well-separation_of_GR1_specifications","335984383_GR1_GR1_Specifications_Extended_with_Existential_Guarantees","321610844_Automata_Logics_and_Infinite_Games_A_Guide_to_Current_Research","310733149_Developing_a_Practical_Reactive_Synthesis_Tool_Experience_and_Lessons_Learned","310671824_Proceedings_Fifth_Workshop_on_Synthesis"]}