{"id":"337708121_A_Review_of_Microsoft_Academic_Services_for_Science_of_Science_Studies","abstract":"Since the relaunch of Microsoft Academic Services (MAS) 4 years ago, scholarly communications have undergone dramatic changes: more ideas are being exchanged online, more authors are sharing their data, and more software tools used to make discoveries and reproduce the results are being distributed openly. The sheer amount of information available is overwhelming for individual humans to keep up and digest. In the meantime, artificial intelligence (AI) technologies have made great strides and the cost of computing has plummeted to the extent that it has become practical to employ intelligent agents to comprehensively collect and analyze scholarly communications. MAS is one such effort and this paper describes its recent progresses since the last disclosure. As there are plenty of independent studies affirming the effectiveness of MAS, this paper focuses on the use of three key AI technologies that underlies its prowess in capturing scholarly communications with adequate quality and broad coverage: (1) natural language understanding in extracting factoids from individual articles at the web scale, (2) knowledge assisted inference and reasoning in assembling the factoids into a knowledge graph, and (3) a reinforcement learning approach to assessing scholarly importance for entities participating in scholarly communications, called the saliency, that serves both as an analytic and a predictive metric in MAS. These elements enhance the capabilities of MAS in supporting the studies of science of science based on the GOTO principle, i.e., good and open data with transparent and objective methodologies. The current direction of development and how to access the regularly updated data and tools from MAS, including the knowledge graph, a REST API and a website, are also described.","authors":["Kuansan Wang","Zhihong Shen","Chiyuan Huang","Chieh-Han Wu"],"meta":["December 2019Frontiers in Big Data 2:45","DOI:10.3389/fdata.2019.00045"],"references":["331690666_Systematic_analysis_of_agreement_between_metrics_and_peer_review_in_the_UK_REF","329686339_Productivity_does_not_equal_usefulness","334115899_A_Web-scale_system_for_scientific_knowledge_exploration","334019130_GOTO_rankings_considered_helpful","333067643_A_Scalable_Hybrid_Research_Paper_Recommender_System_for_Microsoft_Academic","327596856_Thousands_of_scientists_publish_a_paper_every_five_days","323612152_Can_Microsoft_Academic_be_used_for_citation_analysis_of_preprint_archives_The_case_of_the_Social_Science_Research_Network","322570924_Can_Microsoft_Academic_assess_the_early_citation_impact_of_in-_press_articles_A_multi-discipline_exploratory_analysis","321306589_Microsoft_Academic_Automatic_Document_Searches_Accuracy_for_Journal_Articles_and_Suitability_for_Citation_Analysis","320859739_Microsoft_Academic_A_multidisciplinary_comparison_of_citation_counts_with_Scopus_and_Mendeley_for_29_journals"]}