{"id":"337753561_Immersive_virtual_reality_to_enforce_teaching_in_engineering_education","abstract":"Prior studies on the use of digital prototyping and virtual reality (VR) in designing as well as evaluating new products have shown that VR reduces both development time and costs whilst augmenting student motivation and creativity. The current study demonstrates that VR and 3D prototyping in the context of project-based learning (PBL) promote effective communication, increase problem solving skills, and enhance learning outcomes. VR and digital prototyping have been extensively used in industries for the purpose of product design and usability evaluation. In the context of engineering education, many research studies have attempted to explore the effect of VR on teamwork, engagement, retention, and motivation. In this paper, VR is used in conjunction with PBL in self-directed approach to design and implement a product using 3D software whilst also using virtual reality immersive CAVE display to evaluate their design. The hypothesis is that the use of VR with a project-based-learning approach to facilitate the attainment of desirable goals in the engineering design project, improved achievement of course learning outcomes and promoted effective communication. According to the research findings, VR approach significantly affected the distribution of cumulative project grades. Students’ project grades improved, particularly the implementation component. In addition, the course outcomes related to project design were better achieved in VR approach. The communication and problem-solving skills were improved in the VR approach as compared to traditional approach.","authors":["Osama Halabi"],"meta":["January 2020Multimedia Tools and Applications 79(4)","DOI:10.1007/s11042-019-08214-8"],"references":["332904755_Effects_of_Virtual_Reality_training_on_medical_students'_learning_motivation_and_competency","330095956_Scene_art_design_based_on_human-computer_interaction_and_multimedia_information_system_an_interactive_perspective","325520227_Bi-directional_education_contents_using_VR_equipments_and_augmented_reality","323047715_Teaching_Design_Project_in_Introductory_Engineering_Course_Using_3D_Modeling_and_Immersive_Virtual_Reality","330327279_Using_Virtual_Reality_to_Enforce_Principles_of_Cybersecurity","322914271_Desires_for_beverages_and_liking_of_skin_care_product_odors_in_imaginative_and_immersive_virtual_reality_beach_contexts","320963943_Hybrid_Problem-Based_Learning_in_Digital_Image_Processing_A_Case_Study","312202158_Makerspace_teaching-learning_environment_to_enhance_creative_competence_in_engineering_students","311317726_PBLMaestro_A_virtual_learning_environment_for_the_implementation_of_problem-based_learning_approach_in_Computer_education","311314302_A_cross-curricular_approach_to_fostering_innovation_such_as_virtual_reality_development_through_student-led_projects"]}