{"id":"337706952_Understanding_Data_Science","abstract":"The aim of this study; to give information about data science, data scientist and the importance of data science for businesses. Advances in computer and cloud technologies have led to a significant increase in the structure and amount of data produced and stored. This increase in the amount of information has created a new area of interest called \"data science\". Data science is a multidisciplinary field that uses a variety of fields such as mathematics, statistics, computer science, and business strategy to generate added value from data. Data science not only uses data, but also converts data into a format that can be analyzed quickly and efficiently. Data science is especially important for large companies that produce large amounts of data. Today, companies solve many complex business problems using data. Companies also increase their profit rates by making their marketing strategies customer-oriented. Özet Bu çalışmanın amacı; veri bilimi, veri bilimci ve veri biliminin işletmeler için önemi hakkında bilgi vermektir. Bilgisayar ve bulut teknolojilerinde yaşanan gelişmeler üretilen ve saklanan verinin yapısında ve miktarında büyük artışa sebep oldu. Bilgi miktarında yaşanan bu artış \"veri bilimi\" olarak adlandırılan yeni bir ilgi alanının ortaya çıkmasını sağladı. Veri bilimi, veriden bir katma değer elde etmek için matematik, istatistik, bilgisayar bilimleri ve işletme stratejisi gibi çeşitli alanları kullanan çok disiplinli bir alandır. Veri bilimi sadece verileri kullanmakla kalmaz, aynı zamanda verileri hızlı ve etkili bir şekilde analiz edilebilir bir formata dönüştürmektedir. Veri bilimi, özellikle büyük miktarda veri üreten büyük firmalar için hayati öneme sahiptir. Bugün firmalar veriyi kullanarak karmaşık birçok iş problemini çözmektedir. Firmalar ayrıca, pazarlama stratejilerini müşteri odaklı yaparak kar oranlarını büyük ölçüde arttırmaktadır.","authors":["Sadullah çelik","Veri Bilimi","Anlamak Anahtar Kelimeler","Veri Bilimci"],"meta":["January 2019","DOI:10.26579/jocress-9.3.15"],"references":["333752364_What_Is_Data_Science","283636375_Processes_Meet_Big_Data_Connecting_Data","221654695_Discrimination-aware_data_mining","320724956_How_R_Helps_Airbnb_Make_the_Most_of_its_Data","241642345_Data_Science_and_Prediction","2367122_Data_Science_An_Action_Plan_for_Expanding_the_Technical_Areas_of_the_Field_of_Statistics"]}