{"id":"337761591_Computing_the_statistical_significance_of_optimized_communities_in_networks","abstract":"In scientific problems involving systems that can be modeled as a network (or “graph”), it is often of interest to find network communities - strongly connected node subsets - for unsupervised learning, feature discovery, anomaly detection, or scientific study. The vast majority of community detection methods proceed via optimization of a quality function, which is possible even on random networks without communities. Therefore there is usually not an easy way to tell if a community is “significant”, in this context meaning more internally connected than would be expected under a random graph model without communities. This paper generalizes existing null models and statistical tests for this purpose to bipartite graphs, and introduces a new significance scoring algorithm called Fast Optimized Community Significance (FOCS) that is highly scalable and agnostic to the type of graph. Compared with existing methods on unipartite graphs, FOCS is more numerically stable and better balances the trade-off between detection power and false positives. On a large-scale bipartite graph derived from the Internet Movie Database (IMDB), the significance scores provided by FOCS correlate strongly with meaningful actor/director collaborations on serial cinematic projects.","authors":["John Palowitch"],"meta":["December 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-54708-8"],"references":["321487498_A_generalised_significance_test_for_individual_communities_in_networks","309317416_Community_Extraction_in_Multilayer_Networks_with_Heterogeneous_Community_Structure","272422849_Random_Walks_Markov_Processes_and_the_Multiscale_Modular_Organization_of_Complex_Networks","265554523_Model_Selection_and_Hypothesis_Testing_for_Large-Scale_Network_Models_with_Overlapping_Groups","262406956_KONECT_the_Koblenz_network_collection","261065917_Scalable_detection_of_statistically_significant_communities_and_hierarchies_message-passing_for_modularity","248519014_An_Information_Flow_Model_for_Conflict_and_Fission_in_Small_Groups1","305780197_Community_detection_in_networks_A_user_guide","285274768_Discovering_Important_Nodes_through_Graph_Entropy_the_case_of_Enron_email_Database","250428492_Laws_of_Graph_Evolution_Densiflcation_and_Shrinking_Diameters"]}