{"id":"337711490_Classification_and_Visualization_of_Alzheimer's_Disease_using_Volumetric_Convolutional_Neural_Network_and_Transfer_Learning","abstract":"Recently, deep-learning-based approaches have been proposed for the classification of neuroimaging data related to Alzheimer’s disease (AD), and significant progress has been made. However, end-to-end learning that is capable of maximizing the impact of deep learning has yet to receive much attention due to the endemic challenge of neuroimaging caused by the scarcity of data. Thus, this study presents an approach meant to encourage the end-to-end learning of a volumetric convolutional neural network (CNN) model for four binary classification tasks (AD vs. normal control (NC), progressive mild cognitive impairment (pMCI) vs. NC, stable mild cognitive impairment (sMCI) vs. NC and pMCI vs. sMCI) based on magnetic resonance imaging (MRI) and visualizes its outcomes in terms of the decision of the CNNs without any human intervention. In the proposed approach, we use convolutional autoencoder (CAE)-based unsupervised learning for the AD vs. NC classification task, and supervised transfer learning is applied to solve the pMCI vs. sMCI classification task. To detect the most important biomarkers related to AD and pMCI, a gradient-based visualization method that approximates the spatial influence of the CNN model’s decision was applied. To validate the contributions of this study, we conducted experiments on the ADNI database, and the results demonstrated that the proposed approach achieved the accuracies of 86.60% and 73.95% for the AD and pMCI classification tasks respectively, outperforming other network models. In the visualization results, the temporal and parietal lobes were identified as key regions for classification.","authors":["Kanghan Oh","Young-Chul Chung","Ko Woon Kim","Woo-Sung Kim"],"meta":["December 2019Scientific Reports 9(1)","DOI:10.1038/s41598-019-54548-6"],"references":["345143260_Multimodal_Hippocampal_Subfield_Grading_For_Alzheimer's_Disease_Classification","340509526_Deep_Residual_Learning_for_Neuroimaging_An_application_to_Predict_Progression_to_Alzheimer's_Disease","336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","336022953_Multimodal_Hippocampal_Subfield_Grading_For_Alzheimer's_Disease_Classification","331081746_Predicting_Alzheimer's_disease_progression_using_multi-modal_deep_learning_approach","328984469_Deep_Residual_Learning_for_Neuroimaging_An_application_to_Predict_Progression_to_Alzheimer's_Disease","335794994_Prediction_of_Progression_to_Alzheimer's_disease_with_Deep_InfoMax","332775861_Deep_Learning_Framework_for_Alzheimer's_Disease_Diagnosis_via_3D-CNN_and_FSBi-LSTM","332001232_Weakly_Supervised_Deep_Learning_for_Brain_Disease_Prognosis_Using_MRI_and_Incomplete_Clinical_Scores","325474167_Alzheimer's_disease_diagnostics_by_a_3D_deeply_supervised_adaptable_convolutional_network"]}