{"id":"337702208_Deep_learning_for_side-channel_analysis_and_introduction_to_ASCAD_database","abstract":"Recent works have demonstrated that deep learning algorithms were efficient to conduct security evaluations of embedded systems and had many advantages compared to the other methods. Unfortunately, their hyper-parametrization has often been kept secret by the authors who only discussed on the main design principles and on the attack efficiencies in some specific contexts. This is clearly an important limitation of previous works since (1) the latter parametrization is known to be a challenging question in machine learning and (2) it does not allow for the reproducibility of the presented results and (3) it does not allow to draw general conclusions. This paper aims to address these limitations in several ways. First, completing recent works, we propose a study of deep learning algorithms when applied in the context of side-channel analysis and we discuss the links with the classical template attacks. Secondly, for the first time, we address the question of the choice of the hyper-parameters for the class convolutional neural networks. Several benchmarks and rationales are given in the context of the analysis of a challenging masked implementation of the AES algorithm. Interestingly, our work shows that the approach followed to design the algorithm VGG-16 used for image recognition seems also to be sound when it comes to fix an architecture for side-channel analysis. To enable perfect reproducibility of our tests, this work also introduces an open platform including all the sources of the target implementation together with the campaign of electromagnetic measurements exploited in our benchmarks. This open database, named ASCAD, is the first one in its category and it has been specified to serve as a common basis for further works on this subject.","authors":["Ryad Benadjila","Emmanuel Prouff","Rémi Strullu","Eleonora Cagli"],"meta":["June 2020Journal of Cryptographic Engineering 10((Feb))","DOI:10.1007/s13389-019-00220-8"],"references":["319284386_Convolutional_Neural_Networks_with_Data_Augmentation_Against_Jitter-Based_Countermeasures","317425537_Self-Normalizing_Neural_Networks","339440322_Hyperopt_A_Python_Library_for_Optimizing_the_Hyperparameters_of_Machine_Learning_Algorithms","319770387_Deep_Sparse_Rectifier_Neural_Networks","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317343820_Kernel_Discriminant_Analysis_for_Information_Extraction_in_the_Presence_of_Masking","314240709_Kernel_Discriminant_Analysis_for_Information_Extraction_in_the_Presence_of_Masking","311609041_Deep_Residual_Learning_for_Image_Recognition","311313514_Profiling_power_analysis_attack_based_on_MLP_in_DPA_contest_V42"]}