{"id":"337753743_Bounds_and_dynamics_for_empirical_game_theoretic_analysis","abstract":"This paper provides several theoretical results for empirical game theory. Specifically, we introduce bounds for empirical game theoretical analysis of complex multi-agent interactions. In doing so we provide insights in the empirical meta game showing that a Nash equilibrium of the estimated meta-game is an approximate Nash equilibrium of the true underlying meta-game. We investigate and show how many data samples are required to obtain a close enough approximation of the underlying game. Additionally, we extend the evolutionary dynamics analysis of meta-games using heuristic payoff tables (HPTs) to asymmetric games. The state-of-the-art has only considered evolutionary dynamics of symmetric HPTs in which agents have access to the same strategy sets and the payoff structure is symmetric, implying that agents are interchangeable. Finally, we carry out an empirical illustration of the generalised method in several domains, illustrating the theory and evolutionary dynamics of several versions of the AlphaGo algorithm (symmetric), the dynamics of the Colonel Blotto game played by human players on Facebook (symmetric), the dynamics of several teams of players in the capture the flag game (symmetric), and an example of a meta-game in Leduc Poker (asymmetric), generated by the policy-space response oracle multi-agent learning algorithm.","authors":["Karl Tuyls","Pérolat Julien","Marc Lanctot","Edward Hughes"],"meta":["December 2019Autonomous Agents and Multi-Agent Systems 34(1)","DOI:10.1007/s10458-019-09432-y"],"references":["321095192_Symmetric_Decomposition_of_Asymmetric_Games","310821207_Moving_Target_Defense_against_DDoS_Attacks_An_Empirical_Game-Theoretic_Analysis","301926326_Using_Reinforcement_Learning_to_Validate_Empirical_Game-Theoretic_Analysis_A_Continuous_Double_Auction_Study","333493043_Human-level_performance_in_3D_multiplayer_games_with_population-based_reinforcement_learning","331477508_A_Unified_Game-Theoretic_Approach_to_Multiagent_Reinforcement_Learning","331307423_Game_Theory_Evolving_A_Problem-Centered_Introduction_to_Modeling_Strategic_Interaction_-_Second_Edition","326206264_A_Cloaking_Mechanism_to_Mitigate_Market_Manipulation","323867301_A_Generalised_Method_for_Empirical_Game_Theoretic_Analysis","320744964_Multi-Stage_Attack_Graph_Security_Games_Heuristic_Strategies_with_Empirical_Game-Theoretic_Analysis","314795583_A_selection-mutation_model_for_q-learning_in_multi-agent_systems"]}