{"id":"337709739_Software_Metrics_and_tree-based_machine_learning_algorithms_for_distinguishing_and_detecting_similar_structure_design_patterns","abstract":"Design patterns are general reusable solutions for recurrent occurring problems. When software systems become more complicated due to the lack of documentation of design patterns in software and the maintenance and evolution costs become a challenge. Design pattern detection is used to reduce the complexity and to increase the understandability of the design in the software. In this paper, we propose a design pattern detection approach based on tree-based machine learning algorithms and software metrics to study the effectiveness of software metrics in distinguishing between similar structural design patterns. We build our datasets using P-MARt repository by extracting the roles of design patterns and calculating the metrics for each role. We used parameter optimization techniques based on the Grid search algorithm to define the optimal parameter of each algorithm. We used two feature selection methods based on a genetic algorithm to find features that influence the most in the distinguishing process. Through our experimental study, we showed the effectiveness of machine learning and software metrics when distinguishing similar structure design patterns. Moreover, we extracted the essential metrics in each dataset that supported the machine learning model to take its decision. We presented the detection conditions for each role in the design pattern by extracting them from the decision tree model.","authors":["Mohammad Y. Mhawish","Manjari Gupta"],"meta":["January 2020SN Applied Sciences 2(1):11","DOI:10.1007/s42452-019-1815-3","Project: Design Pattern Detection Using Machine Learning"],"references":["277075243_P-MARt_Pattern-like_Micro-Architecture_Repository","268881950_Source_code_and_design_conformance_design_pattern_detection_from_source_code_by_classification_approach","228913993_P-MARt_Pattern-like_Micro_Architecture_Repository","326692779_What_can_Violations_of_Good_Practices_tell_about_the_Relationship_between_GoF_Patterns_and_Run-time_Quality_Attributes","326047565_Interpretability_of_deep_learning_models_A_survey_of_results","325252510_Software_design_pattern_mining_using_classification-based_techniques","319770247_Why_Should_I_Trust_You_Explaining_the_Predictions_of_Any_Classifier","305342147_Why_Should_I_Trust_You_Explaining_the_Predictions_of_Any_Classifier","268423543_Performance_Evaluation_Metrics_for_Software_Fault_Prediction_Studies","235323874_Correlation-Based_Feature_Subset_Selection_for_Machine_Learning"]}