{"id":"337796375_Automatisierte_Zellzahlung_in_Spenderhornhauten_aus_Organkultur_mittels_Deep_Learning_erreicht_hohe_Prazision_und_Genauigkeit","abstract":"Background: \nHuman corneal grafts from organ culture need to have more than 2000 endothelial cells/mm2 to be suitable for transplantation. Measurement of the endothelial cell density is complicated by invisible cell borders in phase contrast microscopy, as well as by limited areas for counting due to folds in the Descemet membrane of the swollen corneal grafts. To date, no automated counting method for measuring the endothelial cell density exists. The neuronal network U-Net has already proven itself in automated segmentation of specular microscopy images of human corneal endothelium. The aim of this study was the application of the U-Net in the quality control of human corneal grafts.\n\nMaterial and methods: \nTraining of the U-Net was performed using 100 manually tagged endothelial cell images of corneal grafts from the Lions eye bank in Baden-Württemberg. Another 100 images were obtained for testing the precision of measurements of the U-Net. These were adjudged manually by a) an experienced investigator and b) a less experienced ophthalmologist. The endothelial cells in identical images were then counted automatically by the trained U-Net. Comparison with the manually counted results was drawn by Pearson correlation.\n\nResults: \nThe correlation coefficient between the U-Net and the experienced investigator as gold standard was 0.9. The correlation coefficient between the less experienced ophthalmologist and the gold standard was only 0.81. Both correlations were statistically highly significant (p < 0.0001).\n\nDiscussion: \nThe strong correlation between the U-Net and the gold standard points out that, given medical approval, effective assistance for eye banks is possible in quality control by automated counting. This could improve objectivity and efficiency of work flow.","authors":["Sonja Heinzelmann","Moritz C. Daniel","Philip Christian Maier","Thomas Reinhard"],"meta":["December 2019Klinische Monatsblätter für Augenheilkunde 236(12):1407-1412","DOI:10.1055/a-1023-4339"],"references":[]}