{"id":"337857393_Limitations_of_information_extraction_methods_and_techniques_for_heterogeneous_unstructured_big_data","abstract":"During the recent era of big data, a huge volume of unstructured data are being produced in various forms of audio, video, images, text, and animation. Effective use of these unstructured big data is a laborious and tedious task. Information extraction (IE) systems help to extract useful information from this large variety of unstructured data. Several techniques and methods have been presented for IE from unstructured data. However, numerous studies conducted on IE from a variety of unstructured data are limited to single data types such as text, image, audio, or video. This article reviews the existing IE techniques along with its subtasks, limitations, and challenges for the variety of unstructured data highlighting the impact of unstructured big data on IE techniques. To the best of our knowledge, there is no comprehensive study conducted to investigate the limitations of existing IE techniques for the variety of unstructured big data. The objective of the structured review presented in this article is twofold. First, it presents the overview of IE techniques from a variety of unstructured data such as text, image, audio, and video at one platform. Second, it investigates the limitations of these existing IE techniques due to the heterogeneity, dimensionality, and volume of unstructured big data. The review finds that advanced techniques for IE, particularly for multifaceted unstructured big data sets, are the utmost requirement of the organizations to manage big data and derive strategic information. Further, potential solutions are also presented to improve the unstructured big data IE systems for future research. These solutions will help to increase the efficiency and effectiveness of the data analytics process in terms of context-aware analytics systems, data-driven decision-making, and knowledge management.","authors":["Kiran Adnan","Rehan Akbar"],"meta":["December 2019International Journal of Engineering Business Management 11","DOI:10.1177/1847979019890771","Project: Usability Enhancement Model for unstructured data"],"references":["331680018_Scientific_Literature_based_Big_Data_Analysis_for_Technology_Insight","326028667_Employing_Semantic_Context_for_Sparse_Information_Extraction_Assessment","332987400_Visual_Relationship_Detection_with_Language_prior_and_Softmax","332604955_FEATURE_EXTRACTION_TECHNIQUES_IN_SPEECH_RECOGNITION_A_REVIEW","330816607_Recognition_and_Extraction_of_Named_Entities_in_Online_Medical_Diagnosis_Data_Based_on_a_Deep_Neural_Network","330762496_A_Survey_on_Video_Summarization_Techniques","330693305_Convolutional_Attention_Networks_for_Scene_Text_Recognition","326898765_Knowledge-oriented_Convolutional_Neural_Network_for_Causal_Relation_Extraction_from_Natural_Language_Texts","326051627_Data_Analytics_Process_There's_Great_Work_Behind_the_Scenes","326038508_A_Systematic_Mapping_Study_on_Open_Information_Extraction"]}