{"id":"337884596_The_Software_Language_Extension_Problem","abstract":"The problem of software language extension and composition drives much of the research in Software Language Engineering (SLE). Although various solutions have already been proposed, there is still little understanding of the specific ins and outs of this problem, which hinders the comparison and evaluation of existing solutionsIn this SoSyM Expert Voice, we introduce the Language Extension Problem as a way to better qualify the scope of the challenges related to language extension and compositionThe formulation of the problem is similar to the seminal Expression Problem introduced by Wadler in the late 1990s and lifts it from the extensibility of single constructs to the extensibility of groups of constructs, i.e., software languages. We provide a comprehensive definition of the actual constraints when considering language extension and believe the Language Extension Problem will drive future research in SLE, the same way the original Expression Problem helped to understand the strengths and weaknesses of programming languages and drove much research in programming languages.","authors":["Manuel Leduc","Thomas Degueule","Eric Van Wyk","Benoit Combemale"],"meta":["March 2020Software and Systems Modeling 19(3)","DOI:10.1007/s10270-019-00772-7"],"references":["331094810_Systematic_Composition_of_Independent_Language_Features","328508334_Modular_language_composition_for_the_masses","320971188_Revisiting_Visitors_for_Modular_Extension_of_Executable_DSMLs","272524233_Neverlang_A_framework_for_feature-oriented_language_development","320389381_Reliable_and_automatic_composition_of_language_extensions_to_C_the_ableC_extensible_language_framework","316898433_Recaf_Java_dialects_as_libraries","313191735_Language_composition_untangled","308359771_Safe_Model_Polymorphism_for_Flexible_Modeling","284339759_Modular_Well-Definedness_Analysis_for_Attribute_Grammars","281967047_Melange_A_Meta-language_for_Modular_and_Reusable_Development_of_DSLs"]}