{"id":"337808882_Certified_Randomness_From_Steering_Using_Sequential_Measurements","abstract":"The generation of certifiable randomness is one of the most promising applications of quantum technologies. Furthermore, the intrinsic non-locality of quantum correlations allow us to certify randomness in a device-independent way, i.e., we do not need to make assumptions about the devices used. Due to the work of Curchod et al. a single entangled two-qubit pure state can be used to produce arbitrary amounts of certified randomness. However, the obtaining of this randomness is experimentally challenging as it requires a large number of measurements, both projective and general. Motivated by these difficulties in the device-independent setting, we instead consider the scenario of one-sided device independence where certain devices are trusted, and others are not; a scenario motivated by asymmetric experimental set-ups such as ion-photon networks. We show how certain aspects of previous works can be adapted to this scenario and provide theoretical bounds on the amount of randomness that can be certified. Furthermore, we give a protocol for unbounded randomness certification in this scenario, and provide numerical results demonstrating the protocol in the ideal case. Finally, we numerically test the possibility of implementing this scheme on near-term quantum technologies, by considering the performance of the protocol on several physical platforms.","authors":["Brian Coyle","Elham Kashefi","Matty J. Hoban"],"meta":["December 2019Cryptography 3(4):27","DOI:10.3390/cryptography3040027","Project: One-Sided Device Independent Certification of Unbounded Random Numbers"],"references":["326158666_One-Sided_Device-Independent_Certification_of_Unbounded_Random_Numbers","311769868_Semi-device-independent_framework_based_on_natural_physical_assumptions","301818702_Minimally_complex_ion_traps_as_modules_for_quantum_communication_and_computing","289587267_Self-testing_through_EPR-steering","332089524_Quantum_random_number_generation_with_partially_characterized_devices_based_on_bounded_energy","323770862_Maximal_randomness_expansion_from_steering_inequality_violations_using_qudits","323130140_On_the_Einstein_Podolsky_Rosen_paradox","306186585_A_Practical_Quantum_Instruction_Set_Architecture","301835340_Quantum_steering_a_short_review_with_focus_on_semidefinite_programming","283274861_Loophole-free_Bell_inequality_violation_using_electron_spins_separated_by_13_kilometres"]}