{"id":"337846400_Internet_of_Things_is_a_revolutionary_approach_for_future_technology_enhancement_a_review","abstract":"Abstract Internet of Things (IoT) is a new paradigm that has changed the traditional way of living into a high tech life style. Smart city, smart homes, pollution control, energy saving, smart transportation, smart industries are such transformations due to IoT. A lot of crucial research studies and investigations have been done in order to enhance the technology through IoT. However, there are still a lot of challenges and issues that need to be addressed to achieve the full potential of IoT. These challenges and issues must be considered from various aspects of IoT such as applications, challenges, enabling technologies, social and environmental impacts etc. The main goal of this review article is to provide a detailed discussion from both technological and social perspective. The article discusses different challenges and key issues of IoT, architecture and important application domains. Also, the article bring into light the existing literature and illustrated their contribution in different aspects of IoT. Moreover, the importance of big data and its analysis with respect to IoT has been discussed. This article would help the readers and researcher to understand the IoT and its applicability to the real world.","authors":["Sachin Kumar","Prayag Tiwari","Mikhail Zymbler"],"meta":["December 2019Journal of Big Data 6(1)","DOI:10.1186/s40537-019-0268-2"],"references":["330799050_Cycling_the_Smart_and_Sustainable_City_Analyzing_EC_Policy_Documents_on_Internet_of_Things_Mobility_and_Transport_and_Smart_Cities","328257456_Ethics_and_Law_in_the_Internet_of_Things_World","326560798_Interoperability_in_Internet_of_Things_Taxonomies_and_Open_Challenges","326552666_Internet_of_Things-Enabled_Smart_Cities_State-of-the-Art_and_Future_Trends","324915158_The_Role_of_Internet_of_Things_IoT_in_Smart_Cities_Technology_Roadmap-oriented_Approaches","324021426_Mapping_the_Values_of_IoT","321768441_Deep_Learning_for_IoT_Big_Data_and_Streaming_Analytics_A_Survey","332958780_IoT-CANE_A_unified_knowledge_management_system_for_data-centric_Internet_of_Things_application_systems","326539025_Internet_of_Things_IoT_A_Review_of_Enabling_Technologies_Challenges_and_Open_Research_Issues","321772829_An_application_of_the_one-factor_HullWhite_model_in_an_IoT_financial_scenario"]}