{"id":"337824686_Les_attitudes_des_enseignants_vis-a-vis_de_l'integration_des_TIC_Cas_de_l'enseignement_des_sciences_infirmieres","abstract":"De nos jours, les technologies de l’information et de communication ont pris une grande ampleur dans les différents domaines sociaux et surtout dans l’enseignement. L’intégration de ces technologies dans l’enseignement a connu une révolution mondiale où l’apprentissage des étudiants a été favorisé par l’amélioration de la qualité de l’enseignement.\nCependant, les sentiments d’auto-efficacité et les attitudes des enseignants peuvent constituer une barrière interne qui pourrait influencer l’intégration pédagogique des TIC en classe.\nCette communication a pour objectif d’établir un diagnostic portant sur les des attitudes des enseignants dans le domaine des sciences infirmières face à l’intégration des TIC, et surtout sur les obstacles qui entravent cette intégration. Ainsi, l’étude suivante est basée principalement sur la technique du questionnaire à items fermés, destiné aux enseignants de l’Institut Supérieur des Professions Infirmières et Techniques de la Santé de Tétouan et son annexe à Tanger, durant la période de juillet – Octobre 2015.\nLes résultats obtenus ont montré que la majorité des enseignants interrogés affichent des attitudes positives envers l’intégration des TIC dans l’enseignement et se voient capables de les intégrer dans leurs pratiques professionnelles. Ce qui démontre une volonté des enseignants pour l’intégration des TIC, accordant ainsi une valeur pédagogique importante à ces technologies.\nPar ailleurs, la réussite ou l’échec de cette intégration dans l’apprentissage est tributaire des capacités des enseignants à conduire de tels enseignements et de résoudre les problèmes induits par les TIC. D’où, un besoin de formation en informatique et en conduites des séquences d’apprentissage intégrant les TIC.\nMots clés : Attitudes - Théorie de comportement planifié - Enseignants - Intégration - TIC - Obstacle - Formation pédagogique - enseignement - technologies.","authors":["Samira Reguragui","Imane EL OUALI ELALAMI","Kawtar Raghay","Mohamed Laafou"],"meta":["August 2017"],"references":[]}