{"id":"337890327_Towards_Cytoskeleton_Computers_A_Proposal","abstract":"Actin and tubulin are key structural elements of Eukaryotes’ cytoskeleton. The networks of actin filaments and tubulin microtubules are substrates for cells’ motility and mechanics, intra-cellular transport and cell-level learning. Ideas of information processing taking place on a cytoskeleton network, especially in neurons, have been proposed by Stuart. Hameroff and Steen. Rasmussen in the late 1980s in their designs of tubulin microtubules automata and a general framework of cytoskeleton automata as sub-cellular information processing networks. The cytoskeleton protein networks propagate signals in the form of ionic solitons, travelling conformation transformations and breathers generated through electrical and mechanical vibrations. A collision-based, or dynamical, computation employs mobile compact finite patterns, mobile self-localised excitations or simply localisations, in an active non-linear medium. These localisations travel in space and perform computation when they collide with each other. Memristor is a device whose resistance changes depending on the polarity and magnitude of a voltage applied to the device’s terminals and the duration of the voltage’s application.","authors":["Andrew Adamatzky","Jack Adam Tuszynski","Joerg Pieper","Dan Nicolau"],"meta":["February 2019","DOI:10.1201/9781315167084-26","In book: From Parallel to Emergent Computing (pp.575-596)Publisher: CRC Press","Project: Controlled self-assembly of bioactive compounds in confined space at nanolevel: at air-water interface, in thin solid films and nanocarriers"],"references":["320602052_Single_Actin_Bundle_Rheology","320177754_Nanoscale_patterning_of_self-assembled_monolayer_SAM-functionalised_substrates_with_single_molecule_contact_printing","319880174_Logical_gates_in_actin_monomer","319617561_Induced_mitochondrial_membrane_potential_for_modeling_solitonic_conduction_of_electrotonic_signals","319608050_Actin_and_microtubule_networks_contribute_differently_to_cell_response_for_small_and_large_strains","318381401_Measurement_of_nanoscale_three-dimensional_diffusion_in_the_interior_of_living_cells_by_STED-FCS","324078893_Organic_electrochemical_transistors","323191785_Synthetic_Transient_Crosslinks_Program_the_Mechanics_of_Soft_Biopolymer-Based_Materials","320647894_DNA_Nanotubes_as_a_Versatile_Tool_to_Study_Semiflexible_Polymers","318713197_Voltage_Imaging_Pitfalls_and_Potential"]}