{"id":"337823863_A_propos_de_l'apprentissage_des_limites_de_fonctions_dans_un_environnement_calculatrice_etude_des_rapports_entre_processus_d'instrumentation_et_processus_de_conceptualisation","abstract":"L'étude épistémologique fait apparaître trois points de vue sur les limites de fonctions : cinématique, opératoire et \"approximation\". C'est ce dernier point de vue qui a permis la stabilisation du concept. Après beaucoup d'oscillations, les programmes d'enseignement en France ont renoncé à donner une définition construite de la notion de limite dans les classes de lycée, prônant une simple utilisation du \"langage des limites\". Dans la pratique, cet enseignement se réduit à un travail algébrique sur les limites. Les calculatrices graphiques, non prises en compte par l'institution scolaire, sont de plus en plus utilisées par les élèves. Une enquête réalisée en Terminale et en première année universitaire montre l'influence de ces outils qui renforcent chez les élèves une conception monotone des limites, liée au point de vue cinématique. Le point de vue \"approximation\" ne ressort ainsi ni de l'enseignement reçu, ni de l'utilisation des calculatrices.Une observation plus suivie d'une classe dans laquelle les calculatrices graphiques puis symboliques sont intégrées par le professeur indique que l'influence des outils de calcul est plus ou moins grande suivant les élèves : les processus d'instrumentation dépendent des caractéristiques cognitives des élèves. Cette thèse met en évidence :- cinq profils d'élèves (liés aux métaconnaissances essentielles : l'investigation, le stockage, la comparaison, l'interprétation, l'inférence et le contrôle général sur l'activité) ;- les rapports différents pour chacun de ces types entre les processus d'instrumentation et les processus de conceptualisation.Cette thèse débouche sur la nécessité, pour contrôler les outils, de trois prises en compte :- une prise en compte épistémologique : on ne peut pas parler d'un concept -les limites- sans s'intéresser à son sens ;- une prise en compte technologique : l'intégration des outils de calcul est de la responsabilité du professeur ;- une prise en compte psychologique : l'attention portée aux profils d'élèves est une condition de la gestion de la classe, encore plus nécessaire dans une activité avec instruments.","authors":["Luc Trouche"],"meta":["December 1996"],"references":[]}