{"id":"337805824_Teachers'_narrative_of_learning_to_program_in_a_professional_development_effort_and_the_relation_to_the_rhetoric_of_computational_thinking","abstract":"In recent years, there has been a renewed interest in the introduction of programming in teacher education and professional development, highlighting its importance for the development of so-called computational thinking. This study explored primary education teachers’ participation in programming practices. By focusing on their views of creating a computational artefact with Scratch, the difficulties encountered, and resources to overcome them in the context of a professional development effort in computer science at the primary education level, was analysed. Employing Thematic Analysis, 17 group documentations (drafts, Scratch projects and final reports) were examined. Findings revealed that projects that had educational content involved more elaborate descriptions, while recreational projects presented a shorter and less elaborate account of the programming process. In terms of difficulties, teachers described initial concerns regarding how to achieve what they had planned, imagined or expected, and they expressed difficulties related to the edition of imported images for objects and scenarios and related to the block-based programming practices. Participants resorted to a great variety of resources to overcome them, which highlights the importance of making testing and debugging practices more explicit. These findings could be relevant for the design of future learning scenarios, highlighting the importance of providing opportunities to develop a critical approach towards expressed commercial promises as well as opportunities to challenge the rhetoric of computational thinking.","authors":["Natalia Monjelat","Annika Lantz-Andersson"],"meta":["May 2020Education and Information Technologies 25(3)","DOI:10.1007/s10639-019-10048-8"],"references":["348355524_Computational_Thinking_Education","337361149_Introduction_to_Computational_Thinking_Education","334850184_Teaching_and_Learning_Computer_Science_for_Primary_School_Teachers_an_Argentine_Experience","333670771_Combining_Assessment_Tools_for_a_Comprehensive_Evaluation_of_Computational_Thinking_Interventions","328226901_A_blended_learning_course_for_playfully_teaching_programming_concepts_to_school_teachers","327076938_Pensamiento_Computacional_y_Programacion_en_la_Formacion_de_Docentes_del_Nivel_Primario","333108642_Making_sense_of_making_critical_issues_in_the_integration_of_maker_education_into_schools","331302136_Non-Programming_Activities_for_Engagement_with_Foundational_Concepts_in_Introductory_Programming","331301813_Assessing_In-service_Teachers'_Development_of_Computational_Thinking_Practices_in_Teacher_Development_Courses","327028433_Case_Studies_of_Elementary_Children's_Engagement_in_Computational_Thinking_Through_Scratch_Programming_Foundations_and_Research_Highlights"]}