{"id":"337841740_A_Case_for_a_New_IT_Ecosystem_On-The-Fly_Computing","abstract":"The complexity of development and deployment in today’s IT world is enormous. Despite the existence of so many pre-fabricated components, frameworks, cloud providers, etc., building IT systems still remains a major challenge and most likely overtaxes even a single ambitious developer. This results in spreading such development and deployment tasks over different team members with their own specialization. Nevertheless, not even highly competent IT personnel can easily succeed in developing and deploying a nontrivial application that comprises a multitude of different components running on different platforms (from frontend to backend). Current industry trends such as DevOps strive to keep development and deployment tasks tightly integrated. This, however, only partially addresses the underlying complexity of either of these two tasks. But would it not be desirable to simplify these tasks in the first place, enabling one person – maybe even a non-expert – to deal with all of them? Today’s approaches to the development and deployment of complex IT applications are not up to this challenge. “On-The-Fly Computing” offers an approach to tackle this challenge by providing complex IT services through largely automated configuration and execution. The configuration of such services is based on simple, flexibly combinable services that are provided by different software providers and traded in a market. This constitutes a highly relevant challenge for research in many branches of computer science, information systems, business administration, and economics. In this research note, it is analyzed which pieces of this new “On-The-Fly Computing” ecosystem already exist and where additional, often significant research efforts are necessary.","authors":["Holger Karl","Dennis Kundisch","Friedhelm Meyer auf der Heide","Heike Wehrheim"],"meta":["December 2020Business & Information Systems Engineering 62(3)","DOI:10.1007/s12599-019-00627-x"],"references":["331026732_Design_of_review_systems_-_A_strategic_instrument_to_shape_online_reviewing_behavior_and_economic_outcomes","322643147_Platform_Launch_Strategies","320075000_Microservices_Granularity_vs_Performance","318166894_A_Review_of_Technologies_for_Conversational_Systems","329580122_Decomposing_the_Variance_of_Consumer_Ratings_and_the_Impact_on_Price_and_Demand","324797212_On-The-Fly_Service_Construction_with_Prototypes","324442759_Automated_software_and_service_composition_A_survey_and_evaluating_review","321637408_Microservices_Granularity_vs_Performance","318020506_Understanding_the_determinants_of_online_review_helpfulness_A_meta-analytic_investigation","318009022_Stimulating_Online_Reviews_by_Combining_Financial_Incentives_and_Social_Norms","316055710_The_Digital_Platform_A_Research_Agenda","315381994_Continuous_Integration_Delivery_and_Deployment_A_Systematic_Review_on_Approaches_Tools_Challenges_and_Practices","316949120_Multidimensional_Platform_Design","314218907_Stimulating_Online_Reviews_by_Combining_Financial_Incentives_and_Social_Norms","313429140_A_framework_for_information_systems_architecture"]}