{"id":"337836234_A_systematic_review_of_immersive_virtual_reality_applications_for_higher_education_Design_elements_lessons_learned_and_research_agenda","abstract":"Researchers have explored the benefits and applications of virtual reality (VR) in different scenarios. VR possesses much potential and its application in education has seen much research interest lately. However, little systematic work currently exists on how researchers have applied immersive VR for higher education purposes that considers the usage of both high-end and budget head-mounted displays (HMDs). Hence, we propose using systematic mapping to identify design elements of existing research dedicated to the application of VR in higher education. The reviewed articles were acquired by extracting key information from documents indexed in four scientific digital libraries, which were filtered systematically using exclusion, inclusion, semi-automatic, and manual methods. Our review emphasizes three key points: the current domain structure in terms of the learning contents, the VR design elements, and the learning theories, as a foundation for successful VR-based learning. The mapping was conducted between application domains and learning contents and between design elements and learning contents. Our analysis has uncovered several gaps in the application of VR in the higher education sphere—for instance, learning theories were not often considered in VR application development to assist and guide toward learning outcomes. Furthermore, the evaluation of educational VR applications has primarily focused on usability of the VR apps instead of learning outcomes and immersive VR has mostly been a part of experimental and development work rather than being applied regularly in actual teaching. Nevertheless, VR seems to be a promising sphere as this study identifies 18 application domains, indicating a better reception of this technology in many disciplines. The identified gaps point toward unexplored regions of VR design for education, which could motivate future work in the field.","authors":["Jaziar Radianti","Tim A. Majchrzak","Jennifer Fromm","Isabell Wohlgenannt"],"meta":["April 2020Computers & Education 147","DOI:10.1016/j.compedu.2019.103778","Project: Virtual Reality in Higher Education: Application Scenarios and Recommendations"],"references":["335490099_Virtual_Reality_in_Higher_Education_Preliminary_Results_from_a_Design-Science-Research_Project","334352097_Virtual_Dome_System_Using_HMDs_An_Alternative_to_the_Expensive_and_Less_Accessible_Physical_Domes","327893978_Immersive_Virtual_Reality_for_Earth_Sciences","327538134_Immersive_virtual_reality_serious_games_for_evacuation_training_and_research_A_systematic_literature_review","335195223_Gaze_and_Motion-aware_Real-Time_Dome_Projection_System","330030043_VREdu_A_Framework_for_Interactive_Immersive_Lectures_using_Virtual_Reality","329065108_Scenic_Spheres_-_An_ARVR_Educational_Game","328908007_Research_on_Application_of_VR_Technology_in_Art_Design_Teaching","328376806_Effectiveness_of_Two_Varying_Levels_of_Virtual_Reality_Simulation","327324449_RIDERS_Road_Inspection_Driver_Simulation"]}