{"id":"337882585_Ideen_zu_einer_Kritik_algorithmischer'_Rationalitat","abstract":"A critique of algorithmic rationalisation offers at best some initial reasons and preliminary ideas. Critique is understood as a reflection on validity. It is limited to an “epistemological investigation” of the limits of the calculable or of what appears “knowable” in the mode of the algorithmic. The argumentation aims at the mathematical foundations of computer science and goes back to the so-called “foundational crisis of mathematics” at the beginning of the 20th century with the attempt to formalise concepts such as calculability, decidability and provability. The Gödel theorems and Turing’s halting problem prove to be essential for any critical approach to “algorithmic rationalisation”. Both, however, do not provide unambiguous results, at best they run towards what later became known as “Gödel’s disjunction”. The chosen path here, however, suggests the opposite way, insofar as, on the one hand, the topos of creativity appear constitutive for what can be regarded as cognitive “algorithmic rationalisation” and which encounters systematic difficulties in the evaluation of non-trivial results. On the other hand, the investigations lead to a comparison between the “mediality” of formally generated structures, which have to distinguish between object-and metalanguages, and the “volatile” differentiality of human thought, which calls for syntactically non-simulatable sense structures.","authors":["Dieter Mersch"],"meta":["December 2019Deutsche Zeitschrift für Philosophie 67(5):851-873","DOI:10.1515/dzph-2019-0062"],"references":["344827515_Die_Einbildungskraft_und_der_innere_Sinn_Kants_Kritik_der_Urteilskraft_aus_der_Sicht_der_Aisthetik","336090533_KREATIVITAT_UND_KUNSTLICHE_INTELLIGENZ","298427172_Kritik_der_Operativitat","349687837_Die_Einbildungskraft_bei_Kant","345864232_Die_Rechenmaschine_und_das_Gehirn","333281108_Turing-Test_oder_das_Fleisch'_der_Maschine","315736451_Aufzahlbarkeit_Entscheidbarkeit_Berechenbarkeit","310485761_Introduction_The_scope_and_limits_of_mathematical_knowledge","292012959_Between_Saying_and_Doing_Towards_an_Analytic_Pragmatism","286486907_Computers_and_Creativity_The_Road_Ahead","284253956_Some_basic_theorems_on_the_foundations_of_mathematics_and_their_implications","279476925_Satan_Stultified_A_Rejoinder_to_Paul_Benacerraf","277475395_The_Lucas-Penrose_Argument","276310400_Satan_Stultified","270773142_God_the_Devil_and_Godel"]}