{"id":"337823895_Quantum_Security_Analysis_of_AES","abstract":"In this paper we analyze for the first time the post-quantum security of AES. AES is the most popular and widely used block cipher, established as the encryption standard by the NIST in 2001. We consider the secret key setting and, in particular, AES-256, the recommended primitive and one of the few existing ones that aims at providing a post-quantum security of 128 bits. In order to determine the new security margin, i.e., the lowest number of non-attacked rounds in time less than 2128 encryptions, we first provide generalized and quantized versions of the best known cryptanalysis on reduced-round AES, as well as a discussion on attacks that don’t seem to benefit from a significant quantum speed-up. We propose a new framework for structured search that encompasses both the classical and quantum attacks we present, and allows to efficiently compute their complexity. We believe this framework will be useful for future analysis.Our best attack is a quantum Demirci-Selçuk meet-in-the-middle attack. Unexpectedly, using the ideas underlying its design principle also enables us to obtain new, counter-intuitive classical TMD trade-offs. In particular, we can reduce the memory in some attacks against AES-256 and AES-128.One of the building blocks of our attacks is solving efficiently the AES S-Box differential equation, with respect to the quantum cost of a reversible S-Box. We believe that this generic quantum tool will be useful for future quantum differential attacks. Judging by the results obtained so far, AES seems a resistant primitive in the post-quantum world as well as in the classical one, with a bigger security margin with respect to quantum generic attacks.","authors":["Xavier Bonnetain","María Naya-Plasencia","André Schrottenloher"],"meta":["June 2019","DOI:10.46586/tosc.v2019.i2.55-93"],"references":["316284124_The_AES-256_Cryptosystem_Resists_Quantum_Attacks","287249961_Applying_Grover's_algorithm_to_AES_quantum_resource_estimates","283118148_Quantum_Differential_and_Linear_Cryptanalysis","313253864_Making_the_Impossible_Possible","309450684_On_the_Practical_In-Security_of_64-bit_Block_Ciphers_Collision_Attacks_on_HTTP_over_TLS_and_OpenVPN","305472626_Semantic_Security_and_Indistinguishability_in_the_Quantum_World","301844107_Breaking_Symmetric_Cryptosystems_using_Quantum_Period_Finding","286583551_On_the_related-key_attacks_against_AES","267434436_Secure_Signatures_and_Chosen_Ciphertext_Security_in_a_Quantum_Computing_World","266560500_Quantum_attacks_against_iterated_block_ciphers"]}