{"id":"337853838_Partition_decision_trees_representation_for_efficient_computation_of_the_Shapley_value_extended_to_games_with_externalities","abstract":"While coalitional games with externalities model a variety of real-life scenarios of interest to computer science, they pose significant game-theoretic and computational challenges. Specifically, key game-theoretic solution concepts—and the Shapley value in particular—can be extended to games with externalities in multiple, often orthogonal, ways. As for the computational challenges, while there exist two concise representations for coalitional games with externalities—called embedded MC-Nets and weighted MC-Nets—they allow the polynomial-time computation of only two of the six existing direct extensions of the Shapley values to games with externalities. In this article, inspired by the literature on endogenous coalition formation protocols, we propose to represent games with externalities in a way that mimic an intuitive process in which coalitions might form. To this end, we utilize Partition Decision Trees—rooted directed trees, where non-leaf nodes are labelled with agents’ names, leaf nodes are labelled with payoff vectors, and edges indicate membership of agents in coalitions. Interestingly, despite their apparent differences, the representation based on partition decision trees can be considered a subclass of embedded MC-Nets and weighted MC-Nets. The key advantage of this new representation is that it allows the polynomial-time computation of five out of six direct extensions of the Shapley value to games with externalities. In other words, by focusing on narrower Partition Decision Trees instead of wider embedded or weighted MC-Nets, a user is guaranteed to compute most extensions of the Shapley value in polynomial time.","authors":["Oskar Skibski","Tomasz Michalak","Yuko Sakurai","Michael Wooldridge"],"meta":["December 2019Autonomous Agents and Multi-Agent Systems 34(1)","DOI:10.1007/s10458-019-09429-7"],"references":["333240516_Fair_division_in_the_presence_of_externalities","313363375_Computational_Aspects_of_Extending_the_Shapley_Value_to_Coalitional_Games_with_Externalities","313363209_A_Logic-Based_Representation_for_Coalitional_Games_with_Externalities","313213213_On_Representing_Coalitional_Games_with_Externalities","342537420_Complexity_of_Computing_the_Shapley_Value_in_Games_with_Externalities","316782270_The_Stochastic_Shapley_Value_for_Coalitional_Games_with_Externalities","313577113_Coalitional_games_in_open_anonymous_environments","313349180_Tractable_and_Expressive_Class_of_Marginal_Contribution_Nets_and_Its_Applications","313348843_Computational_Complexity_of_Weighted_Threshold_Games","302270717_Two-person_cooperative_games","299465697_Addressing_the_computational_issues_of_the_Shapley_value_with_applications_in_the_smart_grid","284289939_A_Value_for_n-Person_Games","272304204_Marginality_Approach_to_Shapley_Value_in_Games_with_Externalities","268623804_Game_theory_Translated_from_Hebrew_by_Ziv_Hellman_and_edited_by_Mike_Borns","267107279_The_Shapley_Value_Essays_in_Honor_of_Lloyd_S_Shapley"]}