{"id":"337873482_A_Scheduling_Strategy_for_Cloud_Computing_with_Improved_Processing_Time","abstract":"Abstract—Cloud computing has spread its wings in all direction of computing from mobile to desktop from offering platform to infrastructure. It is providing the necessary support to ever growing demand of computing resources. In the modern era of consumerism, its most liked feature is ‘pay as you use’ service. Cloud computing necessarily dwells of virtualization technology. Due to this technology the available computing resources can be shared amongst various tasks simultaneously. When the cost is measured for every fraction of the time and for all the resources used, it becomes mandatory to render such scheduling strategies which ensure optimal utilization of resources, which is a great challenge. The present scheduling strategies prove to be lacking in one way or the other in providing the optimal utilization of resources. So, to trounce the limitations of the present system, a new scheduling strategy based on priorities, is presented which improves the processing time and hence overall performance of the cloud platform is also optimized. It was observed that the work related to this kind of research is scant. Presented scheduling strategy improves upon processing time by categorizing the virtual environment and the jobs into groups based on their behavioral parameters using K-means clustering technique. This categorization process reduces the prediction error at first place and maps the jobs to appropriate virtual environment hence minimizing the processing time and enhancing overall efficiency and performance. This arrangement has been simulated in CloudSim 3.0.3 Simulator.\nKeywords— Priority Based Scheduling strategies, Credit Based Scheduling, K-means clustering, Scheduling Algorithm using K-means, Improvement in Processing Time in Cloud, Clustering of jobs, Cloud Computing, Quality of Service.","authors":["Vrajesh Sharma"],"meta":["October 2019","Project: An Optimal Approach to Improve the Efficiency of Cloud Computing"],"references":["335227582_USES_OF_CLUSTER_COMPUTING_TECHNIQUES_TO_PERFORM_BIG_DATA_ANALYTICS_FOR_SMART_GRID_AUTOMATION_SYSTEM","277947847_Multi-Objective_Tasks_Scheduling_Algorithm_for_Cloud_Computing_Throughput_Optimization","275721007_Credit_Based_Scheduling_Algorithm_in_Cloud_Computing_Environment","257726215_A_Priority_Based_Job_Scheduling_Algorithm_in_Cloud_Computing","290437793_Cluster_Based_Load_Balancing_in_Cloud_Computing","286723953_A_simulation_of_priority_based_earliest_deadline_first_scheduling_for_cloud_computing_system","276304135_Secure_Auditing_and_Deduplicating_Data_in_Cloud","261094166_A_Priority_Based_Scheduling_Strategy_for_Virtual_Machine_Allocations_in_Cloud_Computing_Environment","260722822_Cloud_Computing_Opportunities_and_Challenges","257666003_Adaptive_scheduling_for_parallel_tasks_with_QoS_satisfaction_for_hybrid_cloud_environments"]}