{"id":"337801586_A_multifunnel_energy_landscape_encodes_the_competing_a-helix_and_b_-hairpin_conformations_for_a_designed_peptide","abstract":"Depending on the amino acid sequence, as well as the local environment, some peptides have the capability to fold into multiple secondary structures. Conformational switching between such structures is a key element of protein folding and aggregation. Specifically, understanding the molecular mechanism underlying the transition from an α-helix to a β-hairpin is critical because it is thought to be a harbinger of amyloid assembly. In this study, we explore the energy landscape for a 18-residue peptide (DP5), designed by Araki and Tamura to exhibit equal propensities for the α-helical and β-hairpin forms. We find that the degeneracy is encoded in the multifunnel nature of the underlying free energy landscape. In agreement with experiment, we also observe that mutation of Tyrosine at position 12 to Serine shifts the equilibrium in favor of the α-helix conformation, by altering the landscape topography. The transition from the α-helix to the β-hairpin is a complex stepwise process, and occurs via collapsed coil-like intermediates. Our findings suggest that even a single mutation can tune the emergent features of the landscape, providing an efficient route to protein design. Interestingly, the transition pathways for the conformational switch seem to be minimally perturbed upon mutation, suggesting that there could be universal microscopic features that are conserved among different switch-competent protein sequences.","authors":["Debayan Chakraborty","Yassmine Chebaro","David J. Wales"],"meta":["December 2019Physical Chemistry Chemical Physics 22(3)","DOI:10.1039/C9CP04778F"],"references":["332031660_Dynamics_of_an_Adenine-Adenine_RNA_Conformational_Switch_From_Discrete_Path_Sampling","329597008_Energy_Landscape_for_Fold-Switching_in_Regulatory_Protein_RfaH","325371179_Evolved_Minimal_Frustration_in_Multifunctional_Biomolecules","321813202_Energy_Landscape_and_Pathways_for_Transitions_Between_Watson-Crick_and_Hoogsteen_Base_Pairing_in_DNA","313482964_Transforming_the_Energy_Landscape_of_a_Coiled-Coil_Peptide_via_Point_Mutations","322407730_Multifunnel_Landscape_of_the_Fold-Switching_Protein_RfaH-CTD","315535845_Defining_and_quantifying_frustration_in_the_energy_landscape_Applications_to_atomic_and_molecular_clusters_biomolecules_jammed_and_glassy_systems","309364366_Simulating_Protein_Fold_Switching_by_Replica-Exchange-with-Tunneling","308181507_Self-assembly_of_colloidal_magnetic_particles_Energy_landscapes_and_structural_transitions","301791813_A_Simple_and_Accurate_Method_To_Calculate_Free_Energy_Profiles_and_Reaction_Rates_from_Restrained_Molecular_Simulations_of_Diffusive_Processes"]}