{"id":"337872570_Factors_affecting_the_liquidity_of_commercial_banks_in_India_a_longitudinal_analysis","abstract":"This paper examines the long-term effect of various regulatory, bank-specific and macroeconomic factors on the determination of liquidity in Indian banks. For this purpose, the study uses a random effect panel data regression model and tests it with data on Indian banks for 21 years, covering the period from 1996 to 2016. The model considers the effect of regulatory factors, cash reserve ratio, and statutory liquidity, and incorporates four different liquidity ratios specific to the Indian banking scenario. The results of the analysis show contrasting relationships between the independent variables and the dependent variables measured by four liquidity ratios.It is interesting to note that Indian banks rely more on asset-based liquidity and less on liability-based liquidity. More specifically, the most important liquidity ratio of L1 (liquid assets to total assets ratio) showed a significant relationship with macroeconomic variables of discount rates, call rates, foreign exchange reserve, exchange rate with US dollar, consumer price index and gross domestic product. L1 also showed a significant relationship with bank-specific variables of capital to total assets and bank size. However, the regulatory factors of cash reserve ratio and profitability determined by return on equity (ROE) and non-performing assets were not found to have any effect on liquidity of Indian banks.","authors":["Shyam Bhati","Anura De Zoysa","Wisuttorn Jitaree"],"meta":["December 2019Banks and Bank Systems 14(4):78-88","DOI:10.21511/bbs.14(4).2019.08"],"references":["332948979_The_determinants_of_liquidity_of_Indian_listed_commercial_banks_A_panel_data_approach","326153586_Determinants_of_Liquidity_Risk_in_Indian_Banks_A_Panel_Data_Analysis","317797580_Liquidity_and_Off-Balance_Sheet_Items_A_Comparative_Study_of_Public_and_Private_Sector_Banks_in_India","303537229_An_empirical_analysis_of_macroeconomic_and_bank-specific_factors_affecting_liquidity_of_Indian_banks","290157734_Liquidity_And_Bank_Performance","271491342_Bank_Liquidity_and_its_Determinants_in_Romania","316770714_Bank_Liquidity_Creation_Monetary_Policy_and_Financial_Crises","303862451_Determinants_of_different_types_of_bank_liquidity_Evidence_from_BRICS_countries","268077272_Liquidity_of_Czech_Commercial_Banks_and_its_Determinants","254957222_Bank_Liquidity_Hoarding_and_the_Financial_Crisis_An_Empirical_Evaluation"]}