{"id":"337843486_A_New_Algorithm_on_Application_of_Blockchain_Technology_in_Live_Stream_Video_Transmissions_and_Telecommunications","abstract":"This article develops and defines Blockchain technology in its classic format. New suggested proposed algorithms are then analyzed in order to introduce new and modified versions of Blockchain technology. After that, fundamental infrastructure is presented in order to represent its application in new generation of telecommunications. In addition, this article interrogates these algorithms and their efficiency to make secure connections that transfer data packets in any format (boxes or packets of information) in a secure and encrypted method at which sender and receiver of information remain anonymous. Then, this research describes applications of the novel approach in new format of making\nlive stream technology in real world communications. Moreover, according to this new approach, new concepts can be predicted in the new generation of social media based on live communications.Meanwhile, the compatibility is justified for consistency, reliability and flexibility of this new proposed technology with other existing and defined format of technology in today’s world. At last, conclusions of this new emerging technology and its superiority compared to other designed technologies in the field of live streaming and telecommunications are discussed.","authors":["Osamah Ibrahem Khalaf","Ghaida Muttashar Abdulsahib","Hamed Daei Kasmaei","Kingsley Ogudo. A"],"meta":["December 2019International Journal of e-Collaboration 16(1):16-32","DOI:10.4018/IJeC.2020010102","Projects: Traning , Encoding and Decoding Data Packets by Machine Learning and Artificial Intelligence and Its application in Blockchain Technology in Video Transmisions and TelecommunicationsCall for Papers, Special Issue of title \"Recurrent neural networks, Bifurcation Analysis and Control Theory of Complex Systems\"Institute of Applied Mathematics, Physics and EngineeringMARCONI 2MARCONI 1"],"references":["330780329_Blockchain_Beyond_Bitcoin_Block_Maturity_Level_Consensus_Protocol","330725596_The_Evolution_of_Blockchain_A_Bibliometric_Study","328338366_Blockchain_challenges_and_opportunities_A_survey","327483862_Blockchain_as_a_Notarization_Service_for_Data_Sharing_with_Personal_Data_Store","327407561_Blockchain_for_and_in_Logistics_What_to_Adopt_and_Where_to_Start","330294712_Education-Industry_Cooperative_System_Based_on_Blockchain","330028283_Design_of_Evaluation_System_for_Digital_Education_Operational_Skill_Competition_Based_on_Blockchain","329954387_Research_on_Online_Quiz_Scheme_Based_on_Double-Layer_Consortium_Blockchain","328546909_A_Novel_Blockchain-based_Education_Records_Verification_Solution","327478801_Bazaar-Blockchain_A_Blockchain_for_Bazaar-Based_Cloud_Markets"]}