{"id":"337847178_Automatic_Multi-organ_Segmentation_in_Dual_Energy_CT_DECT_with_Dedicated_3D_Fully_Convolutional_DECT_Networks","abstract":"Purpose: \nDual-energy computed tomography (DECT) has shown great potential in many clinical applications. By incorporating the information from two different energy spectra, DECT provides higher contrast and reveals more material differences of tissues compared to conventional single energy CT (SECT). Recent researches show that automatic multi-organ segmentation of DECT data can improve DECT clinical applications. However, most segmentation methods are designed for SECT, while DECT has been significantly less in research. Therefore, a novel approach is required that is able to take full advantage of the extra information provided by DECT.\n\nMethods: \nIn the scope of this work, we proposed four 3D fully convolutional neural network algorithms for the automatic segmentation of DECT data. We incorporated the extra energy information differently and embedded the merge of information in each of the network architectures.\n\nResults: \nQuantitative evaluation using 45 thorax/abdomen DECT datasets acquired with aclinical dual-source CT system was investigated. The segmentation of six thoracic and abdominal organs (left and right lungs, liver, spleen, and left and right kidneys) were evaluated using a 5-fold cross-validation strategy. In all of the tests, we achieved the best average Dice coefficients of 98 %for the right lung, 98 % for the left lung, 96 % for the liver, 92 % for the spleen, 95 % for the right kidney, 93 % for the left kidney, respectively. The network architectures exploiting dual energy spectra outperform deep learning for SECT.\n\nConclusion: \nThe results of the cross-validation show that our methods are feasible and promising. Successful tests on special clinical cases reveal that our methods have high adaptability in the practical application.","authors":["Shuqing Chen","Xia Zhong","Shiyang Hu","Sabrina Dorn"],"meta":["December 2019Medical Physics 47(2)","DOI:10.1002/mp.13950"],"references":["339217462_Degenerating_U-Net_on_Retinal_Vessel_Segmentation_What_Do_We_Really_Need","331656371_Dual-energy_CT_for_automatic_organs-at-risk_segmentation_in_brain-tumor_patients_using_a_multi-atlas_and_deep-learning_approach","326327430_Automatic_multi-organ_segmentation_in_dual_energy_CT_using_3D_fully_convolutional_network","323300836_Manifold_Learning-based_Data_Sampling_for_Model_Training","335003502_A_2D_dilated_residual_U-net_for_multi-organ_segmentation_in_thoracic_CT","326974662_Towards_Context-_Sensitive_CT_Imaging_-_Organ-Specific_Image_Formation_for_Single_SECT_and_Dual_Energy_Computed_Tomography_DECT","323678847_Organ-specific_context-sensitive_CT_image_reconstruction_and_display","321959692_Dosimetric_impact_of_dual-energy_CT_tissue_segmentation_for_low-energy_prostate_brachytherapy_A_Monte_Carlo_study","319977080_H-DenseUNet_Hybrid_Densely_Connected_UNet_for_Liver_and_Liver_Tumor_Segmentation_from_CT_Volumes","319770414_Identity_Mappings_in_Deep_Residual_Networks"]}