{"id":"337832409_Multiple_Fault_Detection_Classification_and_Location_in_Electric_Power_Transmission_Lines_in_Matlab_Environment","abstract":"Multiple faults is one of the most difficult and an undesired problems of faults indicates that involving two or more faults at the same time in different places on a balanced electric network. The main objective of multiple faults detection, classification and location is satisfy accelerates line restoration, maintains system, stability, repairs the fault, decreases the restoration time and increases the system reliability. In this paper, the problem of multiple faults detection and diagnosis was studded and analyzed, including fault analysis, detection, classification , and fault sites locating using conventional method. In the first stage the system was analyzed using the conventional method to obtain the voltage and current values to extract the required characteristics of the units. In the second stage, the faults were detected by a comparison between the voltage and current values before and after the fault. In the third stage, faults were classified according to fault conditions. In the fourth stage, fault locations were identified by impedance base method for different types of fault and places were to estimation accurately fault location by analyzing the data available after the beginning of disturbance. All programs were written in MATLAB environment. The programs were test on IEEE-11 bus bar network. The results clarified that the conventional method is very effective for multiple faults detection, classification and location. Analyzing this network highlights some of the dangers regions in the system.","authors":["Rana Abttan"],"meta":["January 2018"],"references":["276490402_Fault_Classification_and_Localization_in_Power_Systems_Using_Fault_Signatures_and_Principal_Components_Analysis","310674166_A_Complete_Protection_Scheme_for_Fault_Detection_Classification_and_Location_Estimation_in_HVDC_transmission_lines_using_Support_Vector_Machines","304409948_Power_system_fault_detection_classification_and_location_using_the_K-Nearest_Neighbors","269777817_Detection_classification_and_location_of_faults_in_power_transmission_lines","222488260_A_statistical_method_for_the_detection_of_power_system_faults","44339025_Industrial_power_systems_handbook_Donald_Beeman_editor","3462429_Development_of_a_New_Type_Fault_Locator_Using_the_One-Terminal_Voltage_and_Current_Data","3212957_A_New_Transmission_Line_Fault-Locating_System"]}