{"id":"337926911_Modelling_and_control_of_multi-energy_systems_through_Multi-Prosumer_Node_and_Economic_Model_Predictive_Control","abstract":"The present study deals with Multi-Energy Systems (MES) modelling and advanced control with Economic Model Predictive Control (EMPC). MES provide energy flexibility, efficiency, and adaptability thanks to several energy carriers. MES are identified as a lever for integrating renewable energy. A MES novel formulation technique\ncalled Multi-Prosumer Node (MPN) is developed in this paper. MPN makes possible the modeling of MES, considering MES dynamics, several energy carriers, converters, on-grid, and off-grid. In addition, this MES modeling approach is compatible with predictive control strategies like the EMPC. In fact, EMPC is able to take into account loads, weather, renewable power and energy grid cost predictions to minimise economic costs. A real case study is implemented to examine MPN capabilities, which it is composed of renewable generators, loads, storages from two-energy carriers. Two real scenarios have been developed in order to represent realistic\nwinter and summer cases. Simulation results, thanks to modelling with MPN and EMPC advanced control, demonstrate that the node is optimally controlled, devices dynamics are considered on a minute scale, and energy conversion from one carrier to another one is taken into account while economic cost minimisation is performed.\nThe gained results indicate that the presented MPN modelling and optimisation approach reduces economic cost by 8.21% in winter case and 84.24% in summer case compared to the benchmarks which are composed of rulebased control.","authors":["Pierre Clément Blaud","Pierrick Alexandre Haurant","Fabien Claveau","Bruno Lacarrière"],"meta":["January 2019International Journal of Electrical Power & Energy Systems 118","DOI:10.1016/j.ijepes.2019.105778"],"references":["322072904_Economic_Model_Predictive_and_Feedback_Control_of_a_Smart_Grid_Prosumer_Node","319744812_Optimal_Scheduling_of_Energy_Hubs_in_the_Presence_of_Uncertainty-A_Review","326837508_Coordinated_scheduling_of_a_gaselectricityheat_supply_network_considering_temporal-spatial_electric_vehicle_demands","326485403_Optimal_energy_dispatch_in_a_smart_micro-grid_system_using_economic_model_predictive_control","324626543_Utilizing_thermal_building_mass_for_storage_in_district_heating_systems_Combined_building_level_simulations_and_system_level_optimization","322400225_An_extended_energy_hub_approach_for_load_flow_analysis_of_highly_coupled_district_energy_networks_Illustration_with_electricity_and_heating","321164315_Economic_MPC_and_Real-time_Decision_Making_with_Application_to_Large-Scale_HVAC_Energy_Systems","321015941_A_flexible_design_methodology_to_solve_energy_management_problems","320496550_Robust_Optimization_based_Energy_Dispatch_in_Smart_Grids_Considering_Simultaneously_Multiple_Uncertainties_Load_Demands_and_Energy_Prices","318577970_A_conversion_model_for_nodes_in_multi-energy_systems"]}