{"id":"337947230_Quantifying_Coral_Reef_Composition_of_Recreational_Diving_Sites_A_Structure_from_Motion_Approach_at_Seascape_Scale","abstract":"Recreational diving is known to have both direct and indirect impacts on coral habitats. Direct impacts include increasing sedimentation, breaks and diseases that lead to a decrease in the richness and abundances of hard corals. Indirect impacts include urban development, land management and sewage disposal. The ecological effects of scuba diving on the spatial composition metrics of reef benthic communities are less well studied, and they have not been investigated at seascape scale. In this study, we combine orthomosaics derived from Structure from Motion (SfM) photogrammetry and data-mining techniques to study the spatial composition of reef benthic communities of recreational diving sites at seascape scale (>25 m 2). The study focuses on the case study area of Ponta do Ouro Partial Marine Reserve (Mozambique). Results showed that scuba-diving resistant taxa (i.e., sponges and algae) were abundant at small (>850 m 2) and highly dived sites (>3000 dives yr −1), characterized by low diversity and density, and big organisms with complex shapes. Fragile taxa (i.e., Acropora spp.) were abundant at low (365 dives yr −1) and moderately dived sites (1000-3000 dives yr −1) where the greater depth and wider coral reef surfaces attenuate the abrasive effect of waves and re-suspended sediments. Highest taxa diversity and density, and lowest abundance of resistant taxa were recorded at large >2000 m 2) and rarely dived sites. This study highlights the potential applications for a photogrammetric approach to support monitoring programs at Ponta do Ouro Partial Marine Reserve (Mozambique), and provides some insight to understand the influence of scuba diving on benthic communities.","authors":["Marco Palma","Chiara Magliozzi","M. Rivas-Casado","Ubaldo Pantaleo"],"meta":["December 2019Remote Sensing","DOI:10.3390/rs11243027"],"references":["333432556_Status_of_coral_reefs_of_Mozambique_2004","333432548_A_diver_and_diving_survey_in_southern_Mozambique","328073102_Reconstructing_3D_Virtual_Environments_within_a_Collaborative_e-Infrastructure","327762671_A_multiscale_statistical_method_to_identify_potential_areas_of_hyporheic_exchange_for_river_restoration_planning","327063517_Stirring_the_strategic_direction_of_scuba_diving_marine_Citizen_Science_A_survey_of_active_and_potential_participants","326574225_SfM-Based_Method_to_Assess_Gorgonian_Forests_Paramuricea_clavata_Cnidaria_Octocorallia","321438213_3D_photogrammetry_quantifies_growth_and_external_erosion_of_individual_coral_colonies_and_skeletons","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","329915816_Spatial_and_temporal_effects_of_management_on_the_reef_seascape_of_a_marine_protected_area_in_the_Mexican_Caribbean","319544489_Sustainable_scuba_diving_tourism_and_resource_use_Perspectives_and_experiences_of_operators_in_Mozambique_and_Italy"]}