{"id":"337941962_The_formation_of_course_content_of_computer_science_in_the_context_of_ensuring_personal_information_security","abstract":"Problem and goal. The article considers the possible ways of development of the general course of informatics: with technological or socio-cultural dominant. The aim of the study is to identify the main factors (significant circumstances) that make it possible to develop the content of the training of this course in a socio-cultural way. This, in turn, allows us to adequately formulate information threats to the human person, characteristic of the digital society and develop a strategy to protect against these threats. Methodology. The study is based on the analysis of the main challenges of the digital society and the internal logic of the development of general education course of informatics: from computer literacy to the subject of the general education cycle, and from it - to metasubject. Results. The study highlights the main factors that allow to develop the content of the general education course of informatics in the socio-cultural key, which allows to formulate the main strategic directions of protection of the human person from the information threats of the digital society. These factors can be described as consistency, socialization, technologization. These factors will lead to the actual development of the general course of informatics, if within the informatics will be prerequisites for their implementation. The development of the subject area of informatics creates such prerequisites, since the most important concept of the modern course of informatics is the concept of information, symbolic model with a significant social context. At the same time, symbolic modeling is one of the main types of universal educational activities. Conclusion. It is shown that in order to ensure the information security of the individual, it is necessary, first of all, to develop a system of representations and information-cognitive tools that allow the student to adequately interact with the surrounding world. The development of this tool can take over computer science.","authors":["Sergey A. Beshenkov","Margarita I. Shutikova","Natalia I. Ryzhova"],"meta":["December 2019RUDN Journal of Informatization in Education 16(2):128-137","DOI:10.22363/2312-8631-2019-16-2-128-137"],"references":[]}