{"id":"337953226_Learning_higher-order_logic_programs","abstract":"A key feature of inductive logic programming is its ability to learn first-order programs, which are intrinsically more expressive than propositional programs. In this paper, we introduce techniques to learn higher-order programs. Specifically, we extend meta-interpretive learning (MIL) to support learning higher-order programs by allowing for higher-order definitions to be used as background knowledge. Our theoretical results show that learning higher-order programs, rather than first-order programs, can reduce the textual complexity required to express programs, which in turn reduces the size of the hypothesis space and sample complexity. We implement our idea in two new MIL systems: the Prolog system Metagolho and the ASP system HEXMILho. Both systems support learning higher-order programs and higher-order predicate invention, such as inventing functions for map/3 and conditions for filter/3. We conduct experiments on four domains (robot strategies, chess playing, list transformations, and string decryption) that compare learning first-order and higher-order programs. Our experimental results support our theoretical claims and show that, compared to learning first-order programs, learning higher-order programs can significantly improve predictive accuracies and reduce learning times.","authors":["Andrew Cropper","Rolf Morel","Stephen Muggleton"],"meta":["July 2020Machine Learning 109(1–2):1-34","DOI:10.1007/s10994-019-05862-7"],"references":["332880489_Typed_Meta-interpretive_Learning_of_Logic_Programs","331100541_Typed_meta-interpretive_learning_of_logic_programs","327179551_Derivation_Reduction_of_Metarules_in_Meta-interpretive_Learning","324710678_Learning_efficient_logic_programs","301698205_Learning_Higher-Order_Logic_Programs_Through_Abstraction_and_Invention","326946342_Exploiting_Answer_Set_Programming_with_External_Sources_for_Meta-Interpretive_Learning","316790503_Logic_for_Learning","313665793_Inverse_entailment_and_Progol","303884149_Meta-Interpretive_Learning_of_Data_Transformation_Programs","303011825_Example-directed_synthesis_A_type-theoretic_interpretation"]}