{"id":"337997355_Optimizing_Skyline_Query_Processing_in_Incomplete_Data","abstract":"Given the significance of skyline queries, they are incorporated in various modern applications including personalized recommendation systems as well as decision-making and decision-support systems. Skyline queries are used to identify superior data items in the database. Most of the previously proposed skyline algorithms work on a complete database where the data are always present (non-missing). However, in many contemporary real-world databases, particularly those databases with large cardinality and high dimensionality, such assumption is not necessarily valid. Hence, missing data pose new challenges if the processing skyline queries cannot easily apply those methods that are designed for complete data. This is due to the fact that imperfect data cause the loss of the \ntransitivity property \nof the skyline method and \ncyclic dominance \n. This paper presents a framework called \nOptimized Incomplete Skyline (OIS) \nwhich utilizes a technique that simplifies the skyline process on a database with missing data and helps prune the data items before performing the skyline process. The proposed strategy assures that the number of the domination tests is significantly reduced. A set of experiments has been accomplished using both real and synthetic datasets aimed at validating the performance of the framework. The experiment results confirm that the \nOIS \nframework is indeed superior and steadily outperforms the current approaches in terms of the number of domination tests required to retrieve the skylines.","authors":["Yonis Gulzar","Ali Amer Alwan","Sherzod Turaev"],"meta":["January 2019IEEE Access 7(1):178121-178138","DOI:10.1109/ACCESS.2019.2958202","Project: Optimization of skylines queries"],"references":["330238993_D-SKY_A_Framework_for_Processing_Skyline_Queries_in_a_Dynamic_and_Incomplete_Database","329483231_SCSA_Evaluating_skyline_queries_in_incomplete_data","323779790_Identifying_skylines_in_cloud_databases_with_incomplete_data","321488533_A_Model_for_Processing_Skyline_Queries_in_Crowd-sourced_Databases","321026185_Processing_Skyline_Queries_in_Incomplete_Data_Issues_Challenges_and_Future_Trends","317818038_DERIVING_SKYLINE_POINTS_OVER_DYNAMIC_AND_INCOMPLETE_DATABASES","317011909_Skyline_Query_Processing_for_Incomplete_Data_in_Cloud_Environment","331724508_Modeling_and_Computing_Probabilistic_Skyline_on_Incomplete_Data","320883685_Probabilistic_Skyline_on_Incomplete_Data","313830633_Skyline_Preference_Query_Based_on_Massive_and_Incomplete_Dataset"]}