{"id":"337941278_A_Case-Based_Reasoning_System_for_Interior_Design_Using_a_New_Cosine_Similarity_Retrieval_Algorithm","abstract":"During concept design stage, a case-based reasoning system is good for searching the most suitable interior design drawing case as a preliminary concept drawing design aid to bridge the design requirements gap between the consigner and the designer. In the case base of the system, features of the pre-stored design drawing cases could be characterized by interval, nominal, ordinal and/or ratio scale data. However, the cosine similarity measure used for case reasoning scarcely deals with mixed measurement scales of interval, nominal, ordinal and ratio scale types. Therefore, the objective of this study has been twofold. The first goal was to propose a new cosine similarity retrieval algorithm for case reasoning, in which mixed measurement scales are considered and applied. The second goal was to propose a CBR system and apply the new cosine similarity retrieval algorithm to the search engine of the CBR system for interior design drawing retrieval in the interior design industry. Finally, a numerical case study was carried out to demonstrate the effectiveness and capabilities of the proposed case-based reasoning system cosine by using the similarity matching algorithm.\nKeywords: Case-based reasoning; Case-based design; Cosine similarity measure; Interior design.","authors":["林國水Kuo-Sui Lin"],"meta":["December 2019Journal of Information and Telecommunication 3:1-14.","DOI:10.1080/24751839.2019.1700338"],"references":["312650079_Fuzzy_Information_Retrieval","272447678_Multicriteria_decision-making_method_based_on_a_cosine_similarity_measure_between_trapezoidal_fuzzy_numbers","269667061_Case-based_Reasoning_for_Design_Patterns_Searching_System","254256465_Classification_of_Physiological_Signals_for_Wheel_Loader_Operators_Using_Multi-Scale_Entropy_Analysis_and_Case-Based_Reasoning","225070522_Case-Based_Reasoning_Foundational_Issues_Methodological_Variations_and_System_Approaches","274389684_A_Virtual_Reality_Based_Recommender_System_for_Interior_Design_Prototype_Drawing_Retrieval","261076902_Case_studies_on_the_clinical_applications_using_case-based_reasoning","228636287_Importance-assessing_method_with_fuzzy_number-valued_fuzzy_measures_and_discussions_on_TFNs_and_TrFNs","226591277_Fuzzy_information_retrieval","222728393_Fuzzy_information_retrieval_model_revisited"]}