{"id":"337941581_Integration_of_didactic_concepts_in_using_of_multi-level_mobile_computer_books_of_problems_in_teaching_the_Logic_section_of_school_curricula","abstract":"Problem and goal. The article actualizes the issues of searching for didactic-methodological bases and their integration in teaching of the “Logic” section within the framework of school curricula of computer science. The goal of the described research is an attempt to consider the content of the discipline and teaching using the multi-level mobile computer books of problems developed in the course of study as a didactic-methodological factor. Methodology. Implementation in the school educational process on computer science of mechanisms that contribute to the maximum immersion of students in the practice-oriented and professionalcontextual field through the use of multi-level mobile computer books of problems. Result. The research found that the use of multi-level mobile computer-based books of problems concerning the provisions of modern didactic concepts in the methodology of teaching computer science provides the opportunity to access education anytime and anywhere. In this, the approach based on the use of multi-level mobile computer books of problems serves as the most efficient means of developing students’ logical, analytical and critical thinking, since their content is based on multilevel basic knowledge of logic and computer science. Conclusion. The research shows that the use of multi-level mobile computer books of problems in teaching logic in the course of computer science at the stage of school education makes it possible to effectively implement didactic-methodological synthesis, making the educational process practiceoriented and professional-contextual.","authors":["Sergey Yurievich Kamyanetsky"],"meta":["December 2019RUDN Journal of Informatization in Education 16(1):64-72","DOI:10.22363/2312-8631-2019-16-1-64-72"],"references":["277862347_A_Preliminary_Examination_of_the_Cost_Savings_and_Learning_Impacts_of_Using_Open_Textbooks_in_Middle_and_High_School_Science_Classes"]}