{"id":"337982171_Classificatin_of_Brain_Tumors_by_Machine_Learning_Algorithms","abstract":"Abstract: Brain tumors are one of the most important causes of death among cancer types. Early and accurate diagnosis of brain tumor plays a key role in the successful implementation of the treatment. Nowadays, new technologies that increase the success rate of neurosurgery and prevent complications continue to develop. Magnetic resonance (MRI) technique is one of the most popular methods used to examine brain tumor images. There are many possible techniques and algorithms for the classification of images. The main purpose of machine learning and classification algorithms is to learn automatically from training and finally make a wise decision with high accuracy. In this study, the performances of tumor classification methods for the classification of MR brain image features as n/a, multifocal, multicentric and gliomatosis were analyzed. In the classification process, the statistical properties of the input images were analyzed and the data were systematically divided into various categories. These data were tested with KNN (k nearest neighbor), RF(random forest), SVM(support vector machines) and LDA(linear discriminant analysis) machine learning algorithms. SVM (support vector machines) algorithm with 90% accuracy rate was found to be better compared to other algorithms","authors":["Gökalp Çınarer","Bulent Gursel Emiroglu"],"meta":["October 2019","DOI:10.1109/ISMSIT.2019.8932878","Conference: 2019 3rd International Symposium on Multidisciplinary Studies and Innovative Technologies (ISMSIT)"],"references":["305403850_Automatic_Medical_Image_Classification_and_Abnormality_Detection_Using_K-_Nearest_Neighbour","305109860_Advanced_Morphological_Technique_for_Automatic_Brain_Tumor_Detection_and_Evaluation_of_Statistical_Parameters","251878461_The_Cancer_Imaging_Archive_TCIA_Maintaining_and_Operating_a_Public_Information_Repository","234072915_A_Hybrid_Approach_for_Automatic_Tumor_Detection_of_Brain_MRI_Using_Support_Vector_Machine_and_Genetic_Algorithm","344881941_Design_and_Implementation_of_Data_Mining_Tools","320743746_A_Distinctive_Approach_to_Brain_Tumor_Detection_and_Classification_using_MRI","319207907_Pattern_Classification","261277108_Brain_Tumour_Detection_Using_Unsupervised_Learning_Based_Neural_Network","261262978_MRI_brain_image_classification_using_neural_networks","221094197_Application_of_Breiman's_Random_Forest_to_Modeling_Structure-Activity_Relationships_of_Pharmaceutical_Molecules"]}