{"id":"337921334_Social_Robotics_and_Engineering_Students_Do_They_Match_Does_Culture_Matter","abstract":"This study investigates the level of familiarity and interest of students towards social robotics through a survey conducted with the Electrical Engineering and Computer Science Students at Heriot-Watt University in the UK and Electrical Engineering Students at Xidian University in China. The results indicate that whereas there is no significant difference in the level of familiarity within the three groups of students and no significant difference in the level of interest between the Electrical Engineering and Computer Science Students at Heriot Watt University, there is a statistically significant difference in the level of interest towards social robotics between the Heriot-Watt University and Xidian University Students. Xidian University Students demonstrate a higher level of interest towards social robotics. The qualitative analysis shows that many of the Xidian University Students are willing to perceive and have robots as companions whereas none of the Heriot-Watt University Students show such or similar tendency. This observation indicates that cultural background plays a significant role in interests and preferences of the students towards social robotics.","authors":["Mustafa Suphi Erden"],"meta":["December 2019International Journal of Social Robotics 12(5):1-9","DOI:10.1007/s12369-019-00615-x"],"references":["272157732_Walking_in_the_Uncanny_Valley_Importance_of_the_Attractiveness_on_the_Acceptance_of_a_Robot_as_a_Working_Partner","317052876_Positivistic_Tendencies_Due_to_Engineering_Education","309224736_An_experimental_psychological_perspective_on_social_robotics","308926024_The_Influence_of_Robot_Appearance_and_Interactive_Ability_in_HRI_A_Cross-Cultural_Study","305719516_Social_Robotics","305648865_Cultural_Robotics_Robots_as_Participants_and_Creators_of_Culture","304455076_Robots_in_the_classroom_Differences_in_students'_perceptions_of_credibility_and_learning_between_teacher_as_robot_and_robot_as_teacher","262175940_Culturally_variable_preferences_for_robot_design_and_use_in_South_Korea_Turkey_and_the_United_States","261350987_Cultural_design_of_domestic_robots_A_study_of_user_expectations_in_Korea_and_the_United_States","257780510_Emotional_Postures_for_the_Humanoid-Robot_Nao"]}