{"id":"337992841_Manipulate_to_Empower_Hyper-relevance_and_the_contradictions_of_marketing_in_the_age_of_surveillance_capitalism","abstract":"In this article, we explore how digital marketers think about marketing in the age of Big Data surveillance, automatic computational analyses, and algorithmic shaping of choice contexts. Our starting point is a contradiction at the heart of digital marketing namely that digital marketing brings about unprecedented levels of consumer empowerment and autonomy and total control over and manipulation of consumer decision-making. We argue that this contradiction of digital marketing is resolved via the notion of relevance, which represents what Fredric Jameson calls a symbolic act. The notion of the symbolic act lets us see the centering of relevance as a creative act of digital marketers who undertake to symbolically resolve a contradiction that cannot otherwise be resolved. Specifically, we suggest that relevance allows marketers to believe that in the age of surveillance capitalism, the manipulation of choice contexts and decision-making is the same as consumer empowerment. Put differently, relevance is the moment when marketing manipulation disappears and all that is left is the empowered consumer. To create relevant manipulations that are experienced as empowering by the consumer requires always-on surveillance, massive analyses of consumer data and hyper-targeted responses, in short, a persistent marketing presence. The vision of digital marketing is therefore a fascinating one: marketing disappears at precisely the moment when it extends throughout the life without limit.","authors":["Aron Darmody","Detlev Zwick"],"meta":["December 2019Big Data & Society 7(1)","DOI:10.1177/2053951720904112"],"references":["327973903_Creating_Worlds_that_Create_Audiences_Theorising_Personal_Data_Markets_in_the_Age_of_Communicative_Capitalism","326619704_Consumer_Databases_Neoliberalism_and_the_Commercial_Mediation_of_Identity_A_Medium_Theory_Analysis","338270873_The_Political_Unconscious_Narrative_as_a_Socially_Symbolic_Act","331735079_The_role_of_personal_relevance_in_the_value_creation_process_of_edutainment_consumption","330706404_Algorithmic_Personalization_as_a_Mode_of_Individuation","329933689_Updating_to_Remain_the_Same_Habitual_New_Media","329654013_Profiling_Machines_Mapping_the_Personal_Information_Economy","328706524_Digital_Relevance_Developing_Marketing_Content_and_Strategies_that_Drive_Results","328473013_The_Governmental_Topologies_of_Database_Devices","328031247_Enhancing_loyalty_When_improving_consumer_satisfaction_and_delight_matters"]}