{"id":"337996500_Classifying_Inconsistency_Measures_Using_Graphs","abstract":"The aim of measuring inconsistency is to obtain an evaluation of the imperfections in a set of formulas, and this evaluation may then be used to help decide on some course of action (such as rejecting some of the formulas, resolving the inconsistency, seeking better sources of information, etc). A number of proposals have been made to define measures of inconsistency. Each has its rationale. But to date, it is not clear how to delineate the space of options for measures, nor is it clear how we can classify measures systematically. To address these problems, we introduce a general framework for comparing syntactic measures of inconsistency. It is based on the notion of an inconsistency graph for each knowledgebase (a bipartite graph with a set of vertices representing formulas in the knowledgebase, a set of vertices representing minimal inconsistent subsets of the knowledgebase, and edges representing that a formula belongs to a minimal inconsistent subset). We then show that various measures can be computed using the inconsistency graph. Then we introduce abstractions of the inconsistency graph and use them to construct a hierarchy of syntactic inconsistency measures. Furthermore, we extend the inconsistency graph concept with a labeling that extends the hierarchy to include some other types of inconsistency measures.","authors":["Glauber De Bona","John Grant","Anthony Hunter","Sébastien Konieczny"],"meta":["December 2019Journal of Artificial Intelligence Research 66:937-987","DOI:10.1613/jair.1.11852"],"references":["292345080_On_the_expressivity_of_inconsistency_measures","337388249_Basic_Postulates_for_Inconsistency_Measures","324744824_Measuring_and_Computing_Database_Inconsistency_via_Repairs","323522578_On_the_Evaluation_of_Inconsistency_Measures","314132283_Localising_iceberg_inconsistencies","305804863_On_the_Compliance_of_Rationality_Postulates_for_Inconsistency_Measures_A_More_or_Less_Complete_Picture","303916911_On_an_MCS-based_inconsistency_measure","300646449_On_Measuring_Inconsistency_Using_Maximal_Consistent_Sets","275588390_Preferential_Multi-Context_Systems","271617693_Measuring_the_significance_of_inconsistency_in_the_Viewpoints_framework"]}