{"id":"337930543_Unsupervised_Pre-training_of_a_Deep_LSTM-based_Stacked_Autoencoder_for_Multivariate_Time_Series_Forecasting_Problems","abstract":"Currently, most real-world time series datasets are multivariate and are rich in dynamical information of the underlying system. Such datasets are attracting much attention; therefore, the need for accurate modelling of such high-dimensional datasets is increasing. Recently, the deep architecture of the recurrent neural network (RNN) and its variant long short-term memory (LSTM) have been proven to be more accurate than traditional statistical methods in modelling time series data. Despite the reported advantages of the deep LSTM model, its performance in modelling multivariate time series (MTS) data has not been satisfactory, particularly when attempting to process highly non-linear and long-interval MTS datasets. The reason is that the supervised learning approach initializes the neurons randomly in such recurrent networks, disabling the neurons that ultimately must properly learn the latent features of the correlated variables included in the MTS dataset. In this paper, we propose a pre-trained LSTM-based stacked autoencoder (LSTM-SAE) approach in an unsupervised learning fashion to replace the random weight initialization strategy adopted in deep LSTM recurrent networks. For evaluation purposes, two different case studies that include real-world datasets are investigated, where the performance of the proposed approach compares favourably with the deep LSTM approach. In addition, the proposed approach outperforms several reference models investigating the same case studies. Overall, the experimental results clearly show that the unsupervised pre-training approach improves the performance of deep LSTM and leads to better and faster convergence than other models.","authors":["Alaa Sagheer","Mostafa Kotb"],"meta":["December 2019Scientific Reports 9(1):19038","DOI:10.1038/s41598-019-55320-6"],"references":["332640782_A_Combined_Model_Based_on_Feature_Selection_and_WOA_for_PM25_Concentration_Forecasting","331416878_An_Empirical_Study_on_Unsupervised_Pre-training_Approaches_in_Regression_Problems","330818076_A_hybrid_model_for_spatiotemporal_forecasting_of_PM25_based_on_graph_convolutional_neural_network_and_long_short-term_memory","328973982_Time_Series_Forecasting_using_Artificial_Neural_Networks_Methodologies_A_Systematic_Review","326617652_A_Stacked_Autoencoder-Based_Deep_Neural_Network_for_Achieving_Gearbox_Fault_Diagnosis","326312442_A_Deep_CNN-LSTM_Model_for_Particulate_Matter_PM25_Forecasting_in_Smart_Cities","320219118_A_Cycle_Deep_Belief_Network_Model_for_Multivariate_Time_Series_Classification","329835316_Hybrid_Algorithm_for_Short-Term_Forecasting_of_PM25_in_China","328117281_Time_Series_Forecasting_of_Petroleum_Production_using_Deep_LSTM_Recurrent_Networks","326132592_Modeling_Long-_and_Short-Term_Temporal_Patterns_with_Deep_Neural_Networks"]}