{"id":"337902566_Unraveling_Complexity_about_Childhood_Obesity_and_Nutritional_Interventions_Modeling_Interactions_Among_Psychological_Factors","abstract":"As the global prevalence of childhood obesity continues to rise, researchers and clinicians have sought to develop more effective and personalized intervention techniques. In doing so, obesity interventions have expanded beyond the traditional context of nutrition to address several facets of a child’s life, including their psychological state. While the consideration of psychological features has significantly advanced the view of obesity as a holistic condition, attempts to associate such features with outcomes of treatment have been inconclusive. We posit that such uncertainty may arise from the univariate manner in which features are evaluated, focusing on a particular aspect such as loneliness or insecurity, but failing to account for the impact of co-occurring psychological characteristics. Moreover, co-occurrence of psychological characteristics (both child and parent/guardian) have not been studied from the perspective of their relationship with nutritional intervention outcomes. To that end, this work looks to broaden the prevailing view: laying the foundation for the existence of complex interactions among psychological features. In collaboration with a non-profit nutritional clinic in Brazil, this paper demonstrates and models these interactions and their associations with the outcomes of a nutritional intervention.","authors":["Keith Feldman","Gisela M. B. Solymos","Maria Paula de Albuquerque","Nitesh V Chawla"],"meta":["December 2019Scientific Reports 9(1):18807","DOI:10.1038/s41598-019-55260-1"],"references":["312144762_Severe_obesity_emotions_and_eating_habits_A_case-control_study","323810969_Increasing_Maternal_Employment_Influences_Child_OverweightObesity_Among_Ethnically_Diverse_Families","320236104_Direct_and_indirect_effects_of_parent_stress_on_child_obesity_risk_and_added_sugar_intake_in_a_sample_of_Southern_California_adolescents","316020622_Obesity_and_the_Social_Withdrawal_Syndrome","313004878_Childhood_anxiety_disorders","308397010_Childhood_anxiety_disorders","305939308_The_Relationship_between_Changes_in_Weight_Status_and_Insulin_Resistance_in_Youth","297776844_WHO_Child_Growth_Standards_based_on_lengthheight_weight_and_age","291192213_Bayesian_analyses_Where_to_start_and_what_to_report","285993130_An_Overview_of_Psychosocial_Symptoms_in_Obese_Children"]}