{"id":"337907740_Iterative_Method_for_Recreating_a_Binary_Tree_from_its_Traversals","abstract":"Many reconstruction algorithms for binary tree have been discussed in this paper. A particular focus of this paper is on \"A new Non-Recursive Algorithm for Reconstructing a Binary Tree from its Traversals\". The computation time required for executing the reconstruction algorithm are O(N) and space complexity is O(NlogN) where N is the number of nodes in the binary tree. This algorithm works well for most of the input cases, but it has some drawbacks. There are some sequences of pre-order and in-order for which no legitimate tree can be constructed but the algorithm didn't take these cases into consideration and constructed a wrong tree for these cases. In this paper, we have proposed a solution to the problem in the previous algorithm and designed an algorithm which is the modified version of the previous algorithm for generating a correct binary tree. The new modified algorithm is implemented in C language and tested in GCC Compiler in Linux, for all types of input cases. The New modified algorithm works well for all types of input cases. We have calculated the best case time complexity of modified algorithm and show that a correct tree can be reported in O(N) time in best case and O(NlogN) space where N is the number of nodes in the tree. We have discussed some applications of the new modified algorithm in Huffman Coding, compiler design, text processing and searching algorithms.","authors":["Nitin Arora","Pradeep Kaushik","Satendra Kumar"],"meta":["November 2012International Journal of Computer Applications 57(11):6-13"],"references":["258651397_Modified_Non-Recursive_Algorithm_for_Reconstructing_a_Binary_Tree","266445525_Data_structures_algorithms_and_applications_in_C","266368109_Introduction_to_data_structures_and_algorithms_with_C","242324779_Data_Structures_Using_Pascal","242104076_A_Note_on_the_Reconstruction_of_a_Binary_Tree_from_its_Traversals","236942320_Principles_of_Data_Structures_Using_C_and_C","230595761_The_Art_of_Computer_Programming","226150540_Alternative_methods_for_the_reconstruction_of_trees_from_their_traversals","224202540_A_New_Non-recursive_Algorithm_for_Reconstructing_a_Binary_Tree_from_its_Traversals","220690353_Data_Structures_and_Algorithm_Analysis_in_C"]}