{"id":"337966410_What_did_you_see_A_study_to_measure_personalization_in_Google's_search_engine","abstract":"In this paper we present the results of the project “#Datenspende” where during the German election in 2017 more than 4000 people contributed their search results regarding keywords connected to the German election campaign.\nAnalyzing the donated result lists we prove, that the room for personalization of the search results is very small. Thus the opportunity for the effect mentioned in Eli Pariser’s filter bubble theory to occur in this data is also very small, to a degree that it is negligible. We achieved these results by applying various similarity measures to the result lists that were donated. The first approach using the number of common results as a similarity measure showed that the space for personalization is less than two results out of ten on average when searching for persons and at most four regarding the search for parties. Application of other, more specific measures show that the space is indeed smaller, so that the presence of filter bubbles is not evident.\nMoreover this project is also a proof of concept, as it enables society to permanently monitor a search engine’s degree of personalization for any desired search terms. The general design can also be transferred to intermediaries, if appropriate APIs restrict selective access to contents relevant to the study in order to establish a similar degree of trustworthiness.","authors":["Tobias D. Krafft","Michael Gamer","Katharina Anna Zweig"],"meta":["December 2019EPJ Data Science 8(1)","DOI:10.1140/epjds/s13688-019-0217-5","Project: Datenspende BTW2017"],"references":["318256136_Burst_of_the_Filter_Bubble_Effects_of_personalization_on_the_diversity_of_Google_News","307963319_Should_we_worry_about_filter_bubbles","259189092_Media_institutions_as_a_research_field_Three_Phases_of_Norwegian_Broadcasting_Research","318467103_Algorithmen_und_Meinungsbildung_Eine_grundlegende_Einfuhrung","299690107_Similarity_Search_on_Uncertain_Spatio-temporal_Data","279864564_On_the_Kendall_Correlation_Coefficient","265231179_The_Filter_Bubble_What_the_Internet_Is_Hiding_from_You","263566813_The_Filter_Bubble_What_the_Internet_Is_Hiding_from_You","262424460_Measuring_personalization_of_Web_search","262172571_Impact_of_Regionalization_on_Performance_of_Web_Search_Engine_Result_Caches"]}