{"id":"337963535_The_Missing_Link_to_Computational_Thinking","abstract":"After a lengthy debate within the scientific community about what constitutes the problem solving approach of computational thinking (CT), the focus shifted to enable the integration of CT within compulsory education. This publication strives to focus the discussion and enable future research in an educational setting with a strong focus on the Austrian circumstances and the goal to allow wide international adoption later on. Methodically, a literature review was conducted to gain knowledge about the current strands of research and a meta study to show the diversity of proposed and materialized studies. Three main questions were answered, establishing that CT as an idea is rooted in scientific literature dating back to the 1980s and grew in popularity after Wing introduced the concept to a broader audience. A number of authors contributed to the current state of the field, with the most cited review coming from Grover and Pea. The challenge to integrate CT in curricula around the world was met by many experiments and case studies but without a conclusive framework as of yet. Ultimately, this paper determines that expert integration is a blank spot in the literature and aims to create a strong, inclusive path to CT education by inviting practitioners.","authors":["Michael Pollak","Martin Ebner"],"meta":["December 2019Future Internet 11(12):263","DOI:10.3390/fi11120263","Projects: Practitioner Integration in K-12 Computational Thinking EducationMaking with Kids"],"references":["335690290_Going_beyond_digital_literacy_to_develop_computational_thinking_in_K-12_education","332724947_An_Overview_of_Computational_Thinking","332141491_Computational_Thinking_A_Strategy_for_Developing_Problem_Solving_Skills_and_Higher_Order_Thinking_Skills_HOTS","327302966_Computational_thinking_-_a_guide_for_teachers","325976145_Kissed_by_the_Muse_Promoting_Computer_Science_Education_for_All_with_the_Calliope_Board","325138262_From_Refugee_to_Programmer_An_Action-Based_Learning_Approach_for_Teaching_Coding_to_Refugees","333985243_Ways_of_Thinking_in_Informatics","328061320_A_congress_for_children_and_computational_thinking_for_everyone","326423572_If_Art_Education_Then_Critical_Digital_Making_Computational_Thinking_and_Creative_Code","326164947_How_to_learn_and_how_to_teach_computational_thinking_Suggestions_based_on_a_review_of_the_literature"]}