{"id":"337905991_An_Effective_Multi-Stage_Liposomal_DNA_Origami_Nanosystem_for_In_Vivo_Cancer_Therapy","abstract":"DNA origami systems could be important candidates for clinical applications. Unfortunately, their intrinsic properties such as the activation of non-specific immune system responses leading to inflammation, instability in physiological solutions, and a short in vivo lifetime are the major challenges for real world applications. A compact short tube DNA origami (STDO) of 30 nm in length and 10 nm in width was designed to fit inside the core of a stealth liposome (LSTDO) of about 150 nm to remote load doxorubicin. Biocompatibility was tested in three-dimensional (3D) organoid cultures and in vivo. Efficacy was evaluated in different cell lines and in a xenograft breast cancer mouse model. As described in a previous work, LSTDO is highly stable and biocompatible, escaping the recognition of the immune system. Here we show that LSTDO have an increased toleration in mouse liver organoids used as an ex vivo model that recapitulate the tissue of origin. This innovative drug delivery system (DDS) improves the antitumoral efficacy and biodistribution of doxorubicin in tumor-bearing mice and decreases bone marrow toxicity. Our application is an attractive system for the remote loading of other drugs able to interact with DNA for the preparation of liposomal formulations.","authors":["Stefano Palazzolo","Mohamad Hadla","Concetta Russo Spena","Isabella Caligiuri"],"meta":["December 2019Cancers 11(12)","DOI:10.3390/cancers11121997","Project: The application of Nanotechnology in Oncology"],"references":["325426779_Expansion_of_human_primary_hepatocytes_in_vitro_through_their_amplification_as_liver_progenitors_in_a_3D_organoid_system","318402325_Protein_Coating_of_DNA_Nanostructures_for_Enhanced_Stability_and_Immunocompatibility","317572257_Oligolysine-based_coating_protects_DNA_nanostructures_from_low-salt_denaturation_and_nuclease_degradation","306916800_Exosomes_increase_the_therapeutic_index_of_doxorubicin_in_breast_and_ovarian_cancer_mouse_models","330768913_A_proof-of-concept_multi-stage_biomimetic_liposomal_DNA_origami_nanosystem_for_the_remote_loading_of_doxorubicin","325562934_Packaging_DNA_Origami_into_Viral_Protein_Cages","323590593_Smart_cancer_therapy_with_DNA_origami","319530551_The_Clinical_Translation_of_Organic_Nanomaterials_for_Cancer_Therapy_A_Focus_on_Polymeric_Nanoparticles_Micelles_Liposomes_and_Exosomes","310743687_Bottom-Up_Synthesis_of_Carbon_Nanoparticles_with_Higher_Doxorubicin_Efficacy","310507105_Lipid_Membrane_Encapsulation_of_a_3D_DNA_Nano_Octahedron"]}