{"id":"337921760_Combining_technique_for_order_preference_by_similarity_to_ideal_solution_with_relative_preference_relation_for_interval-valued_fuzzy_multi-criteria_decision-making","abstract":"In the past, technique for order preference by similarity to ideal solution (TOPSIS) was one of multi-criteria decision-making (MCDM) methods and often extended into a fuzzy multi-criteria decision-making (FMCDM) one for encompassing uncertainty and vagueness messages. Obviously, TOPSIS extended under fuzzy environment is useful to solve FMCDM problems, but the extension only constructed on general fuzzy numbers (i.e., triangular or trapezoidal fuzzy ones), not interval-valued fuzzy ones. In real world, the recent decision-making process is getting complicated and thus more information now must be grasped than ever. For presenting varied and added data, general fuzzy numbers may not be adequate, whereas interval-valued fuzzy numbers are suitable. Based on above, TOPSIS should be extended under interval-valued fuzzy environment. In this paper, we associate TOPSIS with a relative preference relation under interval-valued fuzzy environment into interval-valued FMCDM for dealing with complicated decision-making problems to obtain more information. The proposed relative preference relation as similar as Wang’s relative preference relation is also improved from Lee’s fuzzy preference relation on general fuzzy numbers. An important difference is the proposed relative preference relation used on interval-valued fuzzy numbers, but Wang’s relative preference relation is utilized on triangular fuzzy numbers. Through the combination of TOPSIS and relative preference relation under interval-valued fuzzy environment, interval-valued FMCDM can be feasibly and rationally finished.","authors":["Yu-Jie Wang"],"meta":["August 2020Soft Computing 24(15):1-18","DOI:10.1007/s00500-019-04599-8"],"references":["316249304_Decisions_with_Multiple_Objectives_--_Preferences_and_Value_Tradeoffs","313443517_Multiple_attribute_decision_making_Methods_and_applications","305852190_An_interval-valued_fuzzy_number_approach_for_supplier_selection","304109012_Decision-making_in_a_fuzzy_environment","271881437_Prioritizing_the_Best_Sites_for_Treated_Wastewater_Instream_Use_in_an_Urban_Watershed_Using_Fuzzy_TOPSIS","268552320_Fuzzy_Preference_Relations_in_Group_Decision_Making","267441894_Fuzzy_TOPSIS_for_multi-criteria_decision-making","265667597_Probability_and_Statistical_Inference","262205948_A_fuzzy_multi-criteria_decision-making_model_by_associating_technique_for_order_preference_by_similarity_to_ideal_solution_with_relative_preference_relation","257404958_A_direct_interval_extension_of_TOPSIS_method","257404310_A_state-of_the-art_survey_of_TOPSIS_applications","257391475_A_fuzzy_TOPSIS_model_via_chi-square_test_for_information_source_selection","257161637_TOPSIS_for_bi-level_MODM_problems","256721103_A_dynamic_consensus_scheme_based_on_a_nonreciprocal_fuzzy_preference_relation_modeling","251575077_Group_decision_making_based_on_novel_fuzzy_modified_TOPSIS_method"]}