{"id":"337967486_Bayesian_optimisation_to_select_Rossler_system_parameters_used_in_Chaotic_Ant_Colony_Optimisation_for_Coverage","abstract":"The CACOC (Chaotic Ant Colony Optimisation for Coverage) algorithm has been developed to manage the mobility of a swarm of Unmanned Aerial Vehicles (UAVs). Using a specific chaotic dynamic obtained from the Rössler system, CACOC provides waypoints for UAVs that aim to optimise the coverage of an unknown area while having unpredictable trajectories. Since the chaotic dynamics are obtained from a three differential equations system with parameters, it is possible to tune one parameter to obtain another chaotic dynamic, which will result in different UAV mobility behaviours. This work aims at optimising this parameter of the Rössler chaotic system to improve the coverage performance of CACOC. Since each evaluation of a solution requires a full simulation, global optimisation techniques (e.g., population-based heuristics) would be very time-consuming. We therefore considered a surrogate-based method to efficiently explore the parameter space of the Rössler system for CACOC, i.e., Bayesian optimisation. Experimental results demonstrate that this approach permits to improve the speed of coverage of the UAV swarm. In addition an analysis of the dynamical properties of the obtained chaotic system is provided.","authors":["Martin Rosalie","Emmanuel Kieffer","Matthias R. Brust","Grégoire Danoy"],"meta":["December 2019Journal of Computational Science 41(2):101047","DOI:10.1016/j.jocs.2019.101047","Project: HUNTED - Heterogeneous multi-swarms of UNmanned auTonomous systEms for mission Deployment"],"references":["329840824_Bayesian_Optimization_Approach_of_General_Bi-level_Problems","318377195_Bayesian_optimization_approach_of_general_bi-level_problems","322823809_Chaos-enhanced_mobility_models_for_multilevel_swarms_of_UAVs","322762275_Chaotic_Traversal_CHAT_Very_Large_Graphs_Traversal_Using_Chaotic_Dynamics","319055038_Coverage_Optimization_with_Connectivity_Preservation_for_UAV_Swarms_Applying_Chaotic_Dynamics","317218204_A_Perturbation_Based_Chaotic_System_Exploiting_the_Quasi-Newton_Method_for_Global_Optimization","317100952_An_effective_algorithm_for_hyperparameter_optimization_of_neural_networks","316446423_Hyperparameter_tuning_for_big_data_using_Bayesian_optimisation","312872269_Asymmetric_Bistability_in_the_Rossler_System","309360452_Empirical_evaluation_of_Bayesian_optimization_in_parametric_tuning_of_chaotic_systems"]}