{"id":"337994002_Superconducting_Qubits_Current_State_of_Play","abstract":"Superconducting qubits are leading candidates in the race to build a quantum computer capable of realizing computations beyond the reach of modern supercomputers. The superconducting qubit modality has been used to demonstrate prototype algorithms in the noisy intermediate-scale quantum (NISQ) technology era, in which nonerror-corrected qubits are used to implement quantum simulations and quantum algorithms. With the recent demonstrations of multiple high-fidelity, two-qubit gates as well as operations on logical qubits in extensible superconducting qubit systems, this modality also holds promise for the longer-term goal of building larger-scale error-corrected quantum computers. In this brief review, we discuss several of the recent experimental advances in qubit hardware, gate implementations, readout capabilities, early NISQ algorithm implementations, and quantum error correction using superconducting qubits. Although continued work on many aspects of this technology is certainly necessary, the pace of both conceptual and technical progress in recent years has been impressive, and here we hope to convey the excitement stemming from this progress.\nExpected final online publication date for the Annual Review of Condensed Matter Physics, Volume 11 is March 10, 2020. Please see http://www.annualreviews.org/page/journal/pubdates for revised estimates.","authors":["Morten Kjaergaard","Mollie E Schwartz","Jochen Braumüller","Philip Krantz"],"meta":["March 2020Annual Review of Condensed Matter Physics 11(1)","DOI:10.1146/annurev-conmatphys-031119-050605"],"references":["253521777_Noise_spectroscopy_through_dynamical_decoupling_with_a_superconducting_flux_qubit","235639054_Reaching_10_ms_single_photon_lifetimes_for_superconducting_aluminum_cavities","330611979_Factoring_larger_integers_with_fewer_qubits_via_quantum_annealing_with_optimized_parameters","319683740_Hardware-efficient_variational_quantum_eigensolver_for_small_molecules_and_quantum_magnets","319683691_Roads_towards_fault-tolerant_universal_quantum_computation","299894318_Circuit_QED_superconducting_qubits_coupled_to_microwave_photons","283761809_Digitized_adiabatic_quantum_computing_with_a_superconducting_circuit","258686740_On-chip_quantum_simulation_with_superconducting_circuits","243473440_Method_for_Direct_Measurement_of_the_Wigner_Function_in_Cavity_QED_and_Ion_Traps","233934977_Equations-of-Motion_Method_and_the_Extended_Shell_Model"]}