{"id":"338000416_Review_of_single-point_diamond_turning_process_in_terms_of_ultra-precision_optical_surface_roughness","abstract":"Ultra-precision machining is the recent realm subsequent to conventional precision machining processes. Recently, achieving nanoscale features on products has become important in manufacturing of critical components. One of the main objectives in advanced manufacturing of optics is to reach ultimately high precision in accuracy of optical surface generation. Through further development of computer numerical controlled machinery technology, single-point diamond turning (SPDT) has evolved rapidly and became a key step in the process chain of nano-machining. In SPDT, advanced and competitive technology for optical surface generation combined with ultra-precision fixtures and accurate metrological systems, high-precision surface machining with scales down to 1 nanometer, even less than 1 nanometer, are successfully achieved. Different engineering applications including medical, dental, defense, aerospace, computer science, and electronic components demand extreme smoothness and optical quality of the machined surfaces. However, there are limitations and drawbacks in SPDT process and surface generation using this technology. Different factors may significantly influence turning conditions, affect surface generation, and limit the outcome of the process. This paper attempts to provide a review of ultra-precision SPDT: technology and characteristics, manufacturing process, applications, machinable materials, and surface generation. Subsequently, influencing factors on surface generation are introduced and comprehensively discussed. Studying influencing factors on surface generation could enable setting optimized sets of machining factors and providing best possible machining conditions for generating high quality optical surfaces. Furthermore, limitations and drawbacks of standard structure SPDT process is discussed. Although a number of published studies have attempted to provide a good perspective of the SPDT process by looking into the effect of influencing factors on surface generation and existing limitations, more investigation needs to be undertaken to discover all destructive effects, origins, and influences in order to further extend the machinability of materials, reduce side effects, and improve the outcome of SPDT.","authors":["Shahrokh Hatefi","K. Abou-El-Hossein"],"meta":["January 2020The International Journal of Advanced Manufacturing Technology 106(3)","DOI:10.1007/s00170-019-04700-3"],"references":["326819759_Molecular_Dynamics_Investigation_of_Residual_Stress_and_Surface_Roughness_of_Cerium_under_Diamond_Cutting","323136387_Ultrasonically_Assisted_Single_Point_Diamond_Turning_of_Optical_Mold_of_Tungsten_Carbide","321070313_Effects_of_recovery_and_side_flow_on_surface_generation_in_nano-cutting_of_single_crystal_silicon","344951031_Micromachining_of_Engineering_Materials","333817762_Modeling_and_simulation_on_the_effect_of_tool_rake_angle_in_diamond_turning_of_KDP_crystal","329908820_Diamond_Turn_Machining_Theory_and_Practice","328514024_Micro-Nano-machining_through_Mechanical_Cutting","326991140_Micromanufacturing_processes","323233473_Influencing_factors_and_theoretical_modeling_methods_of_surface_roughness_in_turning_process_State-of-the-art","321518383_Ultraprecision_Machining_of_Hybrid_Freeform_Surfaces_Using_Multiple-Axis_Diamond_Turning","320638992_Mechanical_and_technological_aspects_of_micro_ball_end_milling_with_various_tool_inclinations","320199834_Rotating-tool_diamond_turning_of_Fresnel_lenses_on_a_roller_mold_for_manufacturing_of_functional_optical_film","318826706_Tool_wear_monitoring_in_diamond_turning_by_fuzzy_pattern_recognition","318454869_Hard_particle_effect_on_surface_generation_in_nano-cutting","317905302_B013_Surface_Texturing_and_Wettability_Evaluation_of_Zirconia_Ceramics"]}