{"id":"338039684_Dermatological_Classification_Using_Deep_Learning_of_Skin_Image_and_Patient_Background_Knowledge","abstract":"Skin cancer is one of the most common human malignancies. It is a kind of skin diseases caused by abnormal growth of skin cells. Clinically, dermatological disease including skin cancer can be divided into many types. Treatment options for each type are varying depending on the prognosis of a disease. Type of skin disease or dermatological classification is an initial process of clinical screening. Traditional method of initial clinical screening requires a visual diagnosing by specialized expertise. In case the disease is classified as a type of skin cancers, it is a serious case of dermatological disease that should be treated promptly. Therefore, an automatic approach applied for this classification task is very useful. In this work, we propose an automatic method for skin disease classification using deep learning model of convolution neural network, or CNN. In order to increase the classification performance of CNN, we employ both image data and background knowledge of the patient in the modeling process. The experimental results performed on a public dataset show that the CNN model can classify skin diseases with 79.29% accuracy, while our proposed method to incorporate background knowledge of patient in the modeling phase can improve the accuracy up to 80.39%. © 2019 International Association of Computer Science and Information Technology.","authors":["Kittipat Sriwong","Supaporn Bunrit","Kittisak Kerdprasop","Nittaya Kerdprasop"],"meta":["December 2019","DOI:10.18178/ijmlc.2019.9.6.884"],"references":["324078202_The_HAM10000_Dataset_A_Large_Collection_of_Multi-Source_Dermatoscopic_Images_of_Common_Pigmented_Skin_Lesions","305196650_Going_deeper_with_convolutions","304163398_Deep_Learning_for_Identifying_Metastatic_Breast_Cancer","329104126_Joint_Deep_Learning_for_land_cover_and_land_use_classification","324873063_Age_estimation_using_deep_learning","319770268_Joint_Training_of_a_Convolutional_Network_and_a_Graphical_Model_for_Human_Pose_Estimation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319287392_Prediction_of_human_protein_subcellular_localization_using_deep_learning","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","311609041_Deep_Residual_Learning_for_Image_Recognition"]}