{"id":"338096947_A_Smart_Data_Dissemination_Protocol_for_Vehicular_Ad-hoc_Networks_International_Journal_of_Computer_Science_and_Network_Security","abstract":"Vehicular Ad-hoc Networks (VANETs) have emerged as an interesting way to ensure Intelligent Transportation System (ITS) services. Indeed, various ITS applications related to road safety and transport efficiency are nowadays deployed through VANET. Given the high mobility of moving vehicles as well as the lack of fixed infrastructure, data dissemination has become a central topic in VANET. The thriving challenge would be to notify, in the right time, drivers about dangerous situations that may encounter them and avoiding as far as possible the network broadcast storm problem. In this respect, we introduce in this paper a new geocast data dissemination protocol based on the forward-if-relevant mechanism. In our proposal, a vehicle decides to rebroadcast or ignore the received event according to an estimated event relevance value. To this end, we rely on a data-mining technique to extract some interesting mobility patterns from the past trajectories of the vehicle, which are used latter for computing the relevance of the event for the vehicle. Performed simulations show the efficiency of the proposed protocol in terms of reachability ratio, precision, overhead and latency.","authors":["Sofian Hamad","Taoufik Yeferny"],"meta":["May 2019","Project: Data dissemination and aggregation in VANET"],"references":["321828834_A_Scalable_Data_Dissemination_Protocol_Based_on_Vehicles_Trajectories_Analysis","306926715_DPMS_A_Swift_Data_Dissemination_Protocol_Based_on_Map_Splitting","269591260_A_scalable_data_dissemination_protocol_for_both_highway_and_urban_vehicular_environments","260863824_GeoSPIN_An_approach_for_Geocast_routing_based_on_SPatial_INformation_in_VANETs","236657042_Efficiency_Analysis_of_Geocast_Target_Region_Specifications_for_VANET_Applications","325689923_MPC_A_RSUs_deployment_strategy_for_VANET","278711118_Lecture_Notes_in_Computer_Science","276279852_Information_Dissemination_in_Vehicular_Networks","262770798_Learning_model_for_efficient_query_routing_in_P2P_information_retrieval_systems","260739562_A_Geocasting_Forwarding_Scheme_for_Mobile_Nodes_in_VANETs"]}