{"id":"338050378_Vibration-based_semantic_damage_segmentation_for_large-scale_structural_health_monitoring","abstract":"Toward reduced recovery time after extreme events, near real-time damage diagnosis of structures is critical to provide reliable information. For this task, a fully convolutional encoder–decoder neural network is developed, which considers the spatial correlation of sensors in the automatic feature extraction process through a grid environment. A cost-sensitive score function is designed to include the consequences of misclassification in the framework while considering the ground motion uncertainty in training. A 10-story-10-bay reinforced concrete (RC) moment frame is modeled to present the design process of the deep learning architecture. The proposed models achieve global testing accuracies of 96.3% to locate damage and 93.2% to classify 16 damage mechanisms. Moreover, to handle class imbalance, three strategies are investigated enabling an increase of 16.2% regarding the mean damage class accuracy. To evaluate the generalization capacities of the framework, the classifiers are tested on 1,080 different RC frames by varying model properties. With less than a 2% reduction in global accuracy, the data-driven model is shown to be reliable for the damage diagnosis of different frames. Given the robustness and capabilities of the grid environment, the proposed framework is applicable to different domains of structural health monitoring research and practice to obtain reliable information.","authors":["Seyed Omid Sajedi","Xiao Liang"],"meta":["June 2020Computer-Aided Civil and Infrastructure Engineering 35(6):579-596","DOI:10.1111/mice.12523"],"references":["338231732_A_data-driven_framework_for_near_real-time_and_robust_damage_diagnosis_of_building_structures","335663135_Intensity-Based_Feature_Selection_for_Near_Real-Time_Damage_Diagnosis_of_Building_Structures","329422277_Image-based_post-disaster_inspection_of_reinforced_concrete_bridge_systems_using_deep_learning_with_Bayesian_optimization","327024827_A_scalable_approach_based_on_deep_learning_for_big_data_time_series_forecasting","326161382_Vehicle_type_detection_by_ensembles_of_convolutional_neural_networks_operating_on_super_resolved_images","326111855_Simulation-Based_Data-Driven_Damage_Detection_for_Highway_Bridge_Systems","324565121_Deep_Transfer_Learning_for_Image-Based_Structural_Damage_Recognition","335128103_A_Convolutional_Cost-Sensitive_Crack_Localization_Algorithm_for_Automated_and_Reliable_RC_Bridge_Inspection","329648552_Vibration-based_structural_condition_assessment_using_convolution_neural_networks","324697511_A_Fast_Detection_Method_via_Region-Based_Fully_Convolutional_Neural_Networks_for_Shield_Tunnel_Lining_Defects"]}