{"id":"338086572_Containing_misinformation_spreading_in_temporal_social_networks","abstract":"Many researchers from a variety of fields, including computer science, network science, and mathematics, have focused on how to contain the outbreaks of Internet misinformation that threaten social systems and undermine societal health. Most research on this topic treats the connections among individuals as static, but these connections change in time, and thus social networks are also temporal networks. Currently, there is no theoretical approach to the problem of containing misinformation outbreaks in temporal networks. We thus propose a misinformation spreading model for temporal networks and describe it using a new theoretical approach. We propose a heuristic-containing (HC) strategy based on optimizing the final outbreak size that outperforms simplified strategies such as those that are random-containing and targeted-containing. We verify the effectiveness of our HC strategy on both artificial and real-world networks by performing extensive numerical simulations and theoretical analyses. We find that the HC strategy dramatically increases the outbreak threshold and decreases the final outbreak threshold.","authors":["Wei Wang","Yuanhui Ma","Tao Wu","Yang Dai"],"meta":["December 2019Chaos (Woodbury, N.Y.) 29(12):123131","DOI:10.1063/1.5114853"],"references":["330097669_Dynamic_vaccination_in_partially_overlapped_multiplex_network","329669181_The_role_of_bridge_nodes_between_layers_on_epidemic_spreading","326729915_Multiple_outbreaks_in_epidemic_spreading_with_local_vaccination_and_limited_vaccines","324745118_Fundamentals_of_spreading_processes_in_single_and_multilayer_complex_networks","323956688_Influence_of_fake_news_in_Twitter_during_the_2016_US_presidential_election","322419245_Optimal_resource_diffusion_for_suppressing_disease_spreading_in_multiplex_networks","321730814_On_the_competition_of_two_conflicting_messages","323649207_The_spread_of_true_and_false_news_online","322002786_Social_contagions_on_correlated_multiplex_networks","320667860_Consensus_document_on_the_epidemiology_of_SARS"]}