{"id":"338014571_Design_of_Automatic_Plant_Areas_Using_Humidity_Sensor_Based_On_Internet_of_Thing","abstract":"Reservoir has many benefits for the community, one of them is as a means to irrigate land and paddy fields. Normally Open and close the valve on the reservoir is done manually and there are many reservoirs that have less solid wall of resistance. Thus causing the dam wall was destroyed. This tool aims to replace manual work becomes automatic and control the water level in the reservoir. The benefits of this tool is to be able to monitor the water level in the reservoir and make the process automatic irrigation. The sensors used in these tools is the HC-SR04 Ultrasonic sensors are used to measure the water level in the reservoir, Sensor soil humidity(YL-69) was used to detect the soil humidity in the paddy fields, RTC (Real Time Clock) is used to display the time, the servo motor is used for opening the water valve to the paddy fields and rivers, Module SIM 800L is used to transmit data the output of this tool to the mobile station devices. Arduino Uno is used to control the input and output. Water level control device based on SMS (Short Messaging Service) and Arduino Uno gateways have been tested and the result is a process of can be done automatically and information from these tools can also be viewed through the LCD mounted on the tool. 800L SIM module is used to transmit the data of the output of this tool to the mobile station devices. Arduino Uno is used to control the input and output 800L SIM module is used to transmit the data of the output of this tool to the mobile station devices. Arduino Uno is used to control the input and output. Water level control device based on SMS (Short Messaging Service) and Arduino Uno gateways have been tested and the result is a process of irrigation can be done automatically and information from these tools can also be viewed through the LCD mounted on the tool.","authors":["Guntur Gunawan","Marliana Sari","Benar - Surbakti","Agustina Ginting"],"meta":["November 2019Journal of Physics Conference Series 1361(1):012063","DOI:10.1088/1742-6596/1361/1/012063"],"references":["262015128_Humidity_Sensors_Principle_Mechanism_and_Fabrication_Technologies_A_Comprehensive_Review","49965119_Short_Message_Service_using_SMS_Gateway","286240293_The_working_principle_of_an_Arduino","272813804_Smart_Agriculture_Based_on_Cloud_Computing_and_IOT"]}