{"id":"338028483_Wound_area_measurement_with_3D_transformation_and_smartphone_images","abstract":"Background: \nQuantitative areas is of great measurement of wound significance in clinical trials, wound pathological analysis, and daily patient care. 2D methods cannot solve the problems caused by human body curvatures and different camera shooting angles. Our objective is to simply collect wound areas, accurately measure wound areas and overcome the shortcomings of 2D methods.\n\nResults: \nWe propose a method with 3D transformation to measure wound area on a human body surface, which combines structure from motion (SFM), least squares conformal mapping (LSCM), and image segmentation. The method captures 2D images of wound, which is surrounded by adhesive tape scale next to it, by smartphone and implements 3D reconstruction from the images based on SFM. Then it uses LSCM to unwrap the UV map of the 3D model. In the end, it utilizes image segmentation by interactive method for wound extraction and measurement. Our system yields state-of-the-art results on a dataset of 118 wounds on 54 patients, and performs with an accuracy of 0.97. The Pearson correlation, standardized regression coefficient and adjusted R square of our method are 0.999, 0.895 and 0.998 respectively.\n\nConclusions: \nA smartphone is used to capture wound images, which lowers costs, lessens dependence on hardware, and avoids the risk of infection. The quantitative calculation of the 3D wound area is realized, solving the challenges that 2D methods cannot and achieving a good accuracy.","authors":["Chunhui Liu","Xingyu Fan","Zhizhi Guo","Zhongjun Mo"],"meta":["December 2019BMC Bioinformatics 20(1)","DOI:10.1186/s12859-019-3308-1"],"references":["323563548_Ways_to_increase_precision_and_accuracy_of_wound_area_measurement_using_smart_devices_Advanced_app_Planimator","312648710_Robust_facial_landmark_detection_and_tracking_across_poses_and_expressions_for_in-the-wild_monocular_video","323086707_Measuring_Wound_Length_Width_and_Area_Which_Technique","323009304_SLAM-based_Dense_Surface_Reconstruction_in_Monocular_Minimally_Invasive_Surgery_and_its_Application_to_Augmented_Reality","322276795_Surf_Speeded_up_robust_features","318515130_Error_rate_of_automated_calculation_for_wound_surface_area_using_a_digital_photography","315003518_System_design_for_3D_wound_imaging_using_low-cost_mobile_devices","313557209_Random_sample_consensus_A_paradigm_for_model_fitting_applications_to_image_analysis_and_automated_cartography","312471414_Detection_and_Tracking_of_Point_Features","311610841_Image_Style_Transfer_Using_Convolutional_Neural_Networks"]}