{"id":"338135556_Selecting_an_SPA_special_program_in_the_arts_major_for_high_school_students_using_AHP_combined_with_interest_inventory","abstract":"The Special Program in the Arts (SPA) is a program by the Department of Education (DepEd) for high school students with potential or talents in the arts, namely, music, visual arts, theater arts, media arts, creative writing and dance. Students enrolled in SPA-identified schools are required to take specialised 2-hour classes daily on their specific majors beginning on their first year as part of their curriculum. The Magallanes National High School (MNHS) in Agusan del Norte is one of the DepEd schools offering in the Philippines. Unfortunately, it is observed that every year, some students are changing SPA majors on their second or third year which causes a problem to the school in arranging their back subjects. Some of the common reasons for shifting include late realisation of interest, career opportunity and expenses. In this study, an interest inventory is conducted among SPA students of MNHS to determine their major inclination. The analytical hierarchy process is then used to compare their different criteria for choosing SPA majors such as late realisation of interest, career opportunity and financial consideration. The results of the study show that most of the students shift to another specialisation due to the late realisation of their field of interest. Evaluation of the students using the proposed method shows that 77% of the students evaluated coincide with the major they are currently taking. Hence, the proposed method may be used to provide assistance to incoming first-year high school students in deciding what SPA major to take to avoid shifting of majors after their first year in high school. Keywords: Arts, special program, SPA, Magallanes National High School.","authors":["Charlotte Lusdoc","Rhoda Namoco"],"meta":["June 2019International Journal of Innovative Research in Education 6(1):1-11","DOI:10.18844/ijire.v9i1.4118"],"references":["269397099_Selection_of_academic_staff_using_the_fuzzy_Analytic_Hierarchy_Process_FAHP_A_pilot_study","253143592_Selecting_a_Doctoral_Dissertation_Supervisor_Analytical_Hierarchy_Approach_to_the_Multiple_Criteria_Problem","241416054_Using_the_analytic_hierarchy_process_for_decision_making_in_engineering_applications_Some_challenges","235204539_The_Use_of_the_Analytical_Hierarchy_Process_as_a_Source_Selection_Methodology_and_Its_Potential_Application_within_the_Hellenic_Air_Force","277838691_Application_of_the_Analytic_Hierarchy_Process_Optimization_Algorithm_in_Best_Management_Practice_Selection","265030179_USING_THE_ANALYTIC_HIERARCHY_PROCESS_TO_IMPROVE_THE_RUTGERS_SIMPLE_BRIDGE_SECURITY_CHECKLIST","43402228_Career_choice_factors_of_high_school_students","35739006_Factors_that_influence_career_uncertainty_in_high_school_students_electronic_resource"]}