{"id":"338162455_A_Low_Effort_Approach_to_Structured_CNN_Design_Using_PCA","abstract":"Deep learning models hold state of the art performance in many fields, yet their design is still based on heuristics or grid search methods that often result in overparametrized networks. This work proposes a method to analyze a trained network and deduce an optimized, compressed architecture that preserves accuracy while keeping computational costs tractable. Model compression is an active field of research that targets the problem of realizing deep learning models in hardware. However, most pruning methodologies tend to be experimental, requiring large compute and time intensive iterations of retraining the entire network. We introduce structure into model design by proposing a single shot analysis of a trained network that serves as a first order, low effort approach to dimensionality reduction, by using PCA (Principal Component Analysis). The proposed method simultaneously analyzes the activations of each layer and considers the dimensionality of the space described by the filters generating these activations. It optimizes the architecture in terms of number of layers, and number of filters per layer without any iterative retraining procedures, making it a viable, low effort technique to design efficient networks. We demonstrate the proposed methodology on AlexNet and VGG style networks on the CIFAR-10, CIFAR-100 and ImageNet datasets, and successfully achieve an optimized architecture with a reduction of up to 3.8X and 9X in the number of operations and parameters respectively, while trading off less than 1% accuracy. We also apply the method to MobileNet, and achieve 1.7X and 3.9X reduction in the number of operations and parameters respectively, while improving accuracy by almost one percentage point.","authors":["Isha Garg","Priyadarshini Panda","Kaushik Roy"],"meta":["December 2019IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2019.2961960"],"references":["321124772_NISP_Pruning_Networks_using_Neuron_Importance_Score_Propagation","320920360_Compression-aware_Training_of_Deep_Networks","338512704_Structured_Binary_Neural_Networks_for_Accurate_Image_Classification_and_Semantic_Segmentation","329746001_Learning-Compression_Algorithms_for_Neural_Net_Pruning","323694313_The_Lottery_Ticket_Hypothesis_Training_Pruned_Neural_Networks","321571140_Learning_Sparse_Neural_Networks_through_L_0_Regularization","319770334_Deep_Compression_Compressing_Deep_Neural_Networks_with_Pruning_Trained_Quantization_and_Huffman_Coding","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770174_Practical_recommendations_for_gradient-based_training_of_deep_architectures","318584216_ThiNet_A_Filter_Level_Pruning_Method_for_Deep_Neural_Network_Compression"]}