{"id":"338111709_CNN-Based_Person_Detection_Using_Infrared_Images_for_Night-Time_Intrusion_Warning_Systems","abstract":"Night-time surveillance is important for safety and security purposes. For this reason, several studies have attempted to automatically detect people intruding into restricted areas by using infrared cameras. However, detecting people from infrared CCTV (closed-circuit television) is challenging because they are usually installed in overhead locations and people only occupy small regions in the resulting image. Therefore, this study proposes an accurate and efficient method for detecting people in infrared CCTV images during the night-time. For this purpose, three different infrared image datasets were constructed; two obtained from an infrared CCTV installed on a public beach and another obtained from a forward looking infrared (FLIR) camera installed on a pedestrian bridge. Moreover, a convolution neural network (CNN)-based pixel-wise classifier for fine-grained person detection was implemented. The detection performance of the proposed method was compared against five conventional detection methods. The results demonstrate that the proposed CNN-based human detection approach outperforms conventional detection approaches in all datasets. Especially, the proposed method maintained F1 scores of above 80% in object-level detection for all datasets. By improving the performance of human detection from infrared images, we expect that this research will contribute to the safety and security of public areas during night-time.","authors":["Jisoo Park","Jingdao Chen","Yong K. Cho","Dae Y Kang"],"meta":["December 2019Sensors 20(1)","DOI:10.3390/s20010034"],"references":["352507527_COMPARATIVE_ANALYSIS_OF_SVM_ANN_AND_CNN_FOR_CLASSIFYING_VEGETATION_SPECIES_USING_HYPERSPECTRAL_THERMAL_INFRARED_DATA","342727392_Building_damage_annotation_on_post-hurricane_satellite_imagery_based_on_convolutional_neural_networks","332807567_CNN-Based_Target_Recognition_and_Identification_for_Infrared_Imaging_in_Defense_Systems","331017151_Multiscale_Object_Detection_in_Infrared_Streetscape_Images_Based_on_Deep_Learning_and_Instance_Level_Data_Augmentation","322601448_Algorithms_for_Face_Detection_on_Infrared_Thermal_Images","335459204_Application_of_Vision-based_Safety_Warning_System_to_Haeundae_Beach_Korea","332228275_Person_Detection_by_Fusion_of_Visible_and_Thermal_Images_Using_Convolutional_Neural_Network","325135318_Human_detection_in_infrared_imagery_using_intensity_distribution_gradient_and_texture_features","324935012_CNN-based_thermal_infrared_person_detection_by_domain_adaptation","324854404_Comparison_of_SVM_and_CNN_classification_methods_for_infrared_target_recognition"]}