{"id":"338108600_An_Efficient_Hardware_Implementation_of_Reinforcement_Learning_The_Q-Learning_Algorithm","abstract":"In this paper we propose an efficient hardware architecture that implements the Q-Learning algorithm, suitable for real-time applications. Its main features are low-power, high throughput and limited hardware resources. We also propose a technique based on approximated multipliers to reduce the hardware complexity of the algorithm. We implemented the design on a Xilinx Zynq Ultrascale+ MPSoC ZCU106 Evaluation Kit. The implementation results are evaluated in terms of hardware resources, throughput and power consumption. The architecture is compared to the state of the art of Q-Learning hardware accelerators presented in the literature obtaining better results in speed, power and hardware resources. Experiments using different sizes for the Q-Matrix and different wordlengths for the fixed point arithmetic are presented. With a Q-Matrix of size 8×4 (8 bit data) we achieved a throughput of 222 MSPS (Mega Samples Per Second) and a dynamic power consumption of 37 mW, while with a Q-Matrix of size 256×16 (32 bit data) we achieved a throughput of 93 MSPS and a power consumption 611 mW. Due to the small amount of hardware resources required by the accelerator, our system is suitable for multi-agent IoT applications. Moreover, the architecture can be used to implement the SARSA (State-Action-Reward-State-Action) Reinforcement Learning algorithm with minor modifications.","authors":["Sergio Spanò","Rocco Fazzolari","Daniele Giardino","Marco Matta"],"meta":["December 2019IEEE Access PP(99)","DOI:10.1109/ACCESS.2019.2961174","Project: Cartesio Project"],"references":["336424907_A_New_Multi-Agent_Reinforcement_Learning_Method_Based_on_Evolving_Dynamic_Correlation_Matrix","335805245_Q-Learning_Algorithms_A_Comprehensive_Classification_and_Applications","335500270_A_Reinforcement_Learning_Based_QAMPSK_Symbol_Synchronizer","333643001_Improved_Multi-Agent_Reinforcement_Learning_for_Path_Planning-Based_Crowd_Simulation","333632212_Implementation_of_Deep_Reinforcement_Learning","332216787_FA3C_FPGA-Accelerated_Deep_Reinforcement_Learning","332111352_AW-SOM_an_Algorithm_for_High-speed_Learning_in_Hardware_Self-Organizing_Maps","331496949_Q-RTS_a_Real-Time_Swarm_Intelligence_based_on_Multi-Agent_Q-Learning","331367470_Multi-Agent_Deep_Reinforcement_Learning_for_Multi-Object_Tracker","329821978_An_Introduction_to_Deep_Reinforcement_Learning"]}