{"id":"338152242_Practical_Methodology_for_the_Design_of_Educational_Serious_Games","abstract":"Educational serious games are primarily intended to teach about or train on a subject. However, a serious game must also be catchy for the player to want to play it multiple times and thus learn while playing. The design of educational serious games includes game experts and pedagogical experts that must be able to efficiently communicate to produce a product that is both educationally efficient and fun to play. Although there are some design frameworks to help with this communication, they are usually more conceptual and do not distinguish the fun factor from the learning contents well, making communication difficult. In this paper, a new practical methodology is presented to support the design process of this kind of digital games. This methodology is more all-encompassing because it identifies all the main steps that are needed to define the learning mechanisms in an educational serious game, from topic choice to user experience. It also separates the game’s learning contents from other mechanics used to keep the game fun to play. Finally, some practical examples are shown, illustrating the use of this methodology.","authors":["Frutuoso G. M. Silva"],"meta":["December 2019Information (Switzerland) 11(1):14","DOI:10.3390/info11010014"],"references":["334407501_Arithmetic_Bird_a_game_for_training_mathematical_operations","333208622_An_adaptation_and_personalisation_methodology_for_Serious_Games_design","321425524_Approaches_for_Serious_Game_Design_A_Systematic_Literature_Review","320251364_Designing_educational_games_Key_elements_and_methodological_approach","308841960_A_Model-driven_Framework_for_Educational_Game_Design","307175665_How_to_Evaluate_Educational_Games_a_Systematic_Literature_Review","313362969_A_conceptual_framework_for_serious_games","312118161_How_games_for_computing_education_are_evaluated_A_systematic_literature_review","307874705_Design_methodology_for_educational_games_based_on_graphical_notations_Designing_Urano","303325566_SKETCH'NDO_A_framework_for_the_creation_of_task-based_serious_games"]}