{"id":"338120971_Computational_geometry_as_a_tool_for_studying_root-finding_methods","abstract":"We present an efficient method from Computational geometry, a branch of computer science devoted to the study of algorithms, for mathematical visualization of a third order root solver. For many decades the quality of iterative methods for solving nonlinear equations were analyzed only by using numerical experiments. The disadvantage of this approach is the inconvenient fact that convergence behavior strictly depends on the choice of initial approximations and the structure of functions whose zeros are sought, which often makes the convergence analysis very hard and incomplete. For this reason in this paper we apply dynamic study of iterative processes relied on basins of attraction, a new and powerful methodology developed at the beginning of the 21th century. This approach provides graphic visualization of the behavior of convergent sequences and, consequently, offers considerably better insight into the quality of applied root solvers, especially into the domain of convergence. For demonstration, we present dynamic study of one parameter family of Halley?s type introduced in the first part of the paper. Characteristics of this family are discussed by basins of attractions for various values of the involved parameter. Special attention is devoted to clusters of polynomial roots, one of the most difficult problems in the topic. The analysis of the methods and presentation of basins of attractions are performed by the computer algebra system Mathematica.","authors":["Ivan Petkovic","Lidija Rancic"],"meta":["January 2019Filomat 33(4):1019-1027","DOI:10.2298/FIL1904019P"],"references":["262280581_Extraneous_fixed_points_basin_boundaries_and_chaotic_dynamics_for_Schrder_and_Knig_rational_iteration_functions","225646737_Graphic_and_numerical_comparison_between_iterative_methods","309281637_Symbolic_computation_and_computer_graphics_as_tools_for_developing_and_studying_new_root-finding_methods","307871699_Iteration_Functions_re-visited","303416517_Polynomial_Root-Finding_and_Polynomiography","267674946_Multipoint_Methods_Methods_for_Solving_Nonlinear_Equations","261564725_Basins_of_attraction_for_several_optimal_fourth_order_methods_for_multiple_roots","238833658_Iterative_Methods_for_Solution_of_Equations"]}