{"id":"338186801_Bregman_Voronoi_diagrams","abstract":"The Voronoi diagram of a finite set of objects is a fundamental geometric structure that subdivides the embedding space into regions, each region consisting of the points that are closer to a given object than to the others. We may define various variants of Voronoi diagrams depending on the class of objects, the distance function and the embedding space. In this paper, we investigate a framework for defining and building Voronoi diagrams for a broad class of distance functions called Bregman divergences. Bregman divergences include not only the traditional (squared) Euclidean distance but also various divergence measures based on entropic functions. Accordingly, Bregman Voronoi diagrams allow one to define information-theoretic Voronoi diagrams in statistical parametric spaces based on the relative entropy of distributions. We define several types of Bregman diagrams, establish correspondences between those diagrams (using the Legendre transformation), and show how to compute them efficiently. We also introduce extensions of these diagrams, e.g. k-order and k-bag Bregman Voronoi diagrams, and introduce Bregman triangulations of a set of points and their connection with Bregman Voronoi diagrams. We show that these triangulations capture many of the properties of the celebrated Delaunay triangulation. * A preliminary version appeared in the 18th ACM-SIAM Symposium on Discrete Algorithms, pp. 746-755, 2007. Related materials including demos and videos are available online at","authors":["Jean-Daniel Boissonnat","Frank Nielsen","Richard Nock"],"meta":["February 2010Discrete & Computational Geometry 44(2):281-307","DOI:10.1007/s00454-010-9256-1","Project: Information Geometry"],"references":["280595853_The_space_of_spheres_a_geometric_tool_to_unify_duality_results_on_Voronoi_diagrams","346368826_Convex_Analysis","330619560_Visual_Computing_Geometry_Graphics_Vision","318494291_Concrete_and_Abstract_Voronoi_Diagrams","279959776_Voronoi_DiagramsPartially_supported_by_the_Deutsche_Forschungsgemeinschaft_grant_K1_655_2-2","279236409_Rao's_Distance_Measure","265673571_Rao's_distance_measure","265527879_Voronoi_diagrams","248758879_On_the_upper-bound_conjecture_for_convex_polytopes","242382167_SIMPLIFIED_ABSTRACT_VORONOI_DIAGRAMS"]}