{"id":"338103231_Spatial_distribution_of_interictal_spikes_fluctuates_over_time_and_localizes_seizure_onset","abstract":"The location of interictal spikes is used to aid surgical planning in patients with medically refractory epilepsy; however, their spatial and temporal dynamics are poorly understood. In this study, we analysed the spatial distribution of interictal spikes over time in 20 adult and paediatric patients (12 females, mean age = 34.5 years, range = 5-58) who underwent intracranial EEG evaluation for epilepsy surgery. Interictal spikes were detected in the 24 h surrounding each seizure and spikes were clustered based on spatial location. The temporal dynamics of spike spatial distribution were calculated for each patient and the effects of sleep and seizures on these dynamics were evaluated. Finally, spike location was assessed in relation to seizure onset location. We found that spike spatial distribution fluctuated significantly over time in 14/20 patients (with a significant aggregate effect across patients, Fisher's method: P < 0.001). A median of 12 sequential hours were required to capture 80% of the variability in spike spatial distribution. Sleep and postictal state affected the spike spatial distribution in 8/20 and 4/20 patients, respectively, with a significant aggregate effect (Fisher's method: P < 0.001 for each). There was no evidence of pre-ictal change in the spike spatial distribution for any patient or in aggregate (Fisher's method: P = 0.99). The electrode with the highest spike frequency and the electrode with the largest area of downstream spike propagation both localized the seizure onset zone better than predicted by chance (Wilcoxon signed-rank test: P = 0.005 and P = 0.002, respectively). In conclusion, spikes localize seizure onset. However, temporal fluctuations in spike spatial distribution, particularly in relation to sleep and post-ictal state, can confound localization. An adequate duration of intracranial recording-ideally at least 12 sequential hours-capturing both sleep and wakefulness should be obtained to sufficiently sample the interictal network. 10.1093/brain/awz386_video1 awz386media1 6117333156001.","authors":["Erin C Conrad","Samuel Tomlinson","Jeremy N Wong","Kelly Oechsel"],"meta":["December 2019Brain 143(2)","DOI:10.1093/brain/awz386"],"references":["325506135_Variability_in_the_location_of_high_frequency_oscillations_during_prolonged_intracranial_EEG_recordings","323958731_The_Sub-Regional_Functional_Organization_of_Neocortical_Irritative_Epileptic_Networks_in_Pediatric_Epilepsy","322316160_Multi-day_rhythms_modulate_seizure_risk_in_epilepsy","321076630_Changes_in_the_Electrocorticogram_after_Implantation_of_Intracranial_Electrodes_in_Humans_The_Implant_Effect","332559213_Reproducibility_of_interictal_spike_propagation_in_children_with_refractory_epilepsy","322690867_Spatial_variation_in_high-frequency_oscillation_rates_and_amplitudes_in_intracranial_EEG","321531992_Brain_regions_and_epileptogenicity_influence_epileptic_interictal_spike_production_and_propagation_during_NREM_sleep_in_comparison_with_wakefulness","321167081_The_effect_of_increased_intracranial_EEG_sampling_rates_in_clinical_practice","320751178_Consistency_of_Long-Term_of_Subdural_Electrocorticography_in_Humans","319441254_Intracranial_EEG_fluctuates_over_months_after_implanting_electrodes_in_human_brain"]}