{"id":"338144721_Deepfakes_Trick_or_treat","abstract":"Although manipulations of visual and auditory media are as old as media themselves, the recent entrance of deepfakes has marked a turning point in the creation of fake content. Powered by the latest technological advances in artificial intelligence and machine learning, deepfakes offer automated procedures to create fake content that is harder and harder for human observers to detect.The possibilities to deceive are endless, including manipulated pictures, videos, and audio, and organizations must be prepared as this will undoubtedly have a large societal impact. In this article, we provide a working definition of deepfakes together with an overview of its underlying technology. We classify different deep-fake types and identify risks and opportunities to help organizations think about the future of deepfakes. Finally, we propose the R.E.A.L. framework to manage deep-fake risks: Record original content to assure deniability, Expose deepfakes early, Advocate for legal protection, and Leverage trust to counter credulity. Following these principles, we hope that our society can be more prepared to counter deep-fake tricks as we appreciate deepfake treats.","authors":["Jan Kietzmann","Linda W. Lee","Ian Paul McCarthy","Tim C. Kietzmann"],"meta":["December 2019Business Horizons 63(2)","DOI:10.1016/j.bushor.2019.11.006"],"references":["326580845_Social_media_It's_serious_Understanding_the_dark_side_of_social_media","273602961_Understanding_value_co-creation_in_a_co-consuming_brand_community","334438864_Text-based_editing_of_talking-head_video","331311082_Deep_Neural_Networks_in_Computational_Neuroscience","329255077_The_Commitment-Trust_Theory_of_Relationship_Marketing","319974130_In_the_Eyes_of_the_Law_Perception_Versus_Reality_in_Appraisals_of_Video_Evidence","318614879_Synthesizing_Obama_learning_lip_sync_from_audio","283292111_Policing_Made_Visible_Mobile_Technologies_and_the_Importance_of_Point_of_View","254218434_Photographic_truth_and_evidence","247478522_The_role_of_internal_branding_in_the_delivery_of_employee_brand_promise"]}