{"id":"338195043_Quantum_Computing_Technology_QCT_-_A_Data_Security_Threat","abstract":"Advancements in computer science and technology make quantum computation increasingly possible, which would result in unprecedented computational efficiency and allow quantum physicists and chemists to completely model complex quantum mechanical systems. Quantum algorithms have already shown significant advantages over classical algorithms in terms of both runtime and power. Quantum computation opens up new research opportunities in areas such as machine learning, mathematics, and cryptography. However, quantum computation could also pose a danger to online data security. 1. Introduction Alan Turing catalyzed the beginnings of computer science when he conceived the idea of a programmable machine; this was, of course, the Turing machine, revealed to the world in 1936. Since then, generations of scientists worked to bring today's society the modern computer. With these innovations came immense progress in efficient calculations and communication. While computers today perform algorithmic tasks more quickly than Turing could have ever imagined, researchers in computer science are proposing an even faster method of computation on the basis of quantum mechanical theory. These quantum computers have the potential to significantly outperform their classical counterparts and provide unprecedented computational power. This paper investigates the inner workings and potential applications of quantum computers, proposes viable materials for constructing a quantum computer, discusses monetary restrictions on quantum computer construction, and assesses the impact of quantum computation on data security.","authors":["Anil Lamba","Pushparaj Pal","Satinderjeet Singh","Balvinder Singh"],"meta":["April 2018"],"references":["337873482_A_Scheduling_Strategy_for_Cloud_Computing_with_Improved_Processing_Time","337386416_CONCEPT_OF_DYNAMIC_BANDWIDTH_ALLOCATION_AND_SCHEDULING_ALGORITHMS_IN_PASSIVE_OPTICAL_NETWORKS","324987549_Stability_Aware_Routing_in_Mobile_Ad-Hoc_Networks_using_multiple_Route"]}