{"id":"338136507_Recognizing_patterns_of_student's_modeling_behaviour_patterns_via_process_mining","abstract":"Abstract Evaluating student learning effect plays an essential role in education, which is typically done by assessing student’s final deliverables. However, the student’s learning process has not been properly explored in the past.In this paper, we propose an interactive student learning effect evaluation framework which focuses on in-process learning effect evaluation. In particular, our proposal analyzes students modeling assignment based on their operation records by using techniques of frequent sequential pattern mining, user behavior analysis, feature engineering, and process mining. A comprehensive online modeling platform has been developed to enable data collection. We have carried out a case study, in which we applied our approach to a real teaching scenario, consisting of student online modeling behavior data collected from 24 students majoring in computer science. We also associate our process mining results with the numeric evaluation values. The preliminary result of case analysis has shown good potential to mine student modeling patterns and interpret their behaviors, contributing to student learning effect evaluation.","authors":["Yu Wang","Tong Li","Congkai Geng","Yihan Wang"],"meta":["December 2019Smart Learning Environments 6(1)","DOI:10.1186/s40561-019-0097-y"],"references":["281105022_Process_Mining_in_the_Education_Domain","271618655_The_impact_of_assessment_on_students_learning","336848377_Evaluating_Student_Learning_Effect_Based_on_Process_Mining","330459175_Improving_Web_Search_Ranking_by_Incorporating_User_Behavior_Information","320088009_A_survey_on_educational_process_mining","319393506_Mining_Sequential_Patterns_Generalizations_and_Performance_Improvements","313430456_Assessment_and_classroom_learning","313196550_Assessment_and_classroom_learning_Assessment_in_education_Principles","312459427_Information_filtering_based_on_user_behavior_analysis_and_best_match_text_retrieval","303180092_Feature_engineering_of_machine-learning_chemisorption_models_for_catalyst_design"]}