{"id":"338138617_Acciones_para_fomentar_una_cultura_cientifica_sustentada_en_la_concepcion_de_Ciencia_Tecnologia_y_Sociedad_CTS_-_Action's_for_create_scientific_culture_based_on_the_conception_of_Science_Technology_an","abstract":"En el presente trabajo se aborda desde un aspecto teórico-práctico, algunas consideraciones para potenciar la educación científica del ingeniero en ciencias informáticas con una concepción de Ciencia, Tecnología y Sociedad (CTS). Se realizó un estudio de caso aplicado a estudiantes que cursaban esta carrera en la Facultad de Ciencias y Tecnologías Computacionales de la Universidad de las Ciencias Informáticas. La aplicación de la orientación educativa CTS en las clases de pregrado permitieron fomentar y desarrollar valores como la responsabilidad, solidaridad y la cooperación, así como actitudes adecuadas hacia la sustentabilidad económica y social. \n\nPALABRAS CLAVE: educación científica, concepción de Ciencia, Tecnología y Sociedad (CTS), formación. \n\nABSTRACT: In the present work is approached from a theoretical-practical aspect, some considerations to enhance the scientific education of the engineer in computer science with a conception of Science, Technology and Society (CTS). A case study was applied to students who were studying at the Faculty of Computer Science and Technology of the University of Computer Science. The application of the CTS educational orientation in the undergraduate classes allowed to promote and develop values such as responsibility, solidarity and cooperation, as well as appropriate attitudes towards economic and social sustainability.","authors":["Odiel Estrada Molina","Jimmy zambrano Acosta","Dieter Reynaldo Fuentes Cancell"],"meta":["September 2019","Projects: Virtualización de la extensión universitariaTraining tutors of the software development centers of the University of Informatics Science in consolidating the ability to model in software engineering"],"references":["328413098_Educacion_superior_ciencia_tecnologia_y_agenda_2030","292944756_Exigencias_didacticas_en_diseno_didactico_de_tareas_para_el_desarrollo_de_las_habilidades_investigativas","262414966_Procedimiento_para_determinar_las_Tendencias_Estadisticas_del_Desarrollo_de_la_Competencia_Investigativa_del_Ingeniero_en_Ciencias_Informaticas","356574097_CONTENIDOS_DE_NATURALEZA_DE_LA_CIENCIA_Y_LA_TECNOLOGIA_EN_LOS_NUEVOS_CURRICULOS_BASICOS_DE_EDUCACION_SECUNDARIA","343171845_TECNOLOGIAS_PARA_VIAS_TERCIARIAS_PERSPECTIVAS_Y_EXPERIENCIAS_DESDE_LA_ACADEMIA","291575600_Science_Culture_and_Its_Indicators"]}