{"id":"338172692_Applying_machine_learning_to_AHP_multicriteria_decision_making_method_to_assets_prioritization_in_the_context_of_industrial_maintenance_40","abstract":"The increasing competition among industries has led to the emergence of numerous tools and methods to support decision making focused on assets maintenance in a company, since ensuring good maintenance is directly linked with greater reliability and uptime for equipment, reducing losses in production processes and consequently increasing profitability. This work aims to use Machine Learning (ML) algorithms - Bayesian Networks (BN) and attribute relevance analysis (ARA), implemented in the Weka® platform, to process a dataset of event logs failure of industrial machine components. The approach aims to use the conditional probability relations generated by the BN and the ranking of criteria relevance for the design of an AHP decision-making model within the scope of industrial maintenance to prioritize which components of a specific machine are more susceptible to failures. The proposed integration mechanism aims to bring greater reliability to the weights assigned to the criteria of the AHP model, and consequently, a more accurate decision support. The results showed that the AHP model generated from a Bayesian Network is consistent with the conditional probabilities estimated by the BN, giving robustness to the decision sphere in the context of industrial maintenance. This AHP model can serve as a basis to be complemented by qualitative analysis criteria according to the need of the individual specialist, allowing the construction of strategic maintenance action plans.","authors":["Erick Lima","Ewerton Gorski","Eduardo Rocha Loures","Eduardo Alves Portela Santos"],"meta":["January 2019IFAC-PapersOnLine 52(13):2152-2157","DOI:10.1016/j.ifacol.2019.11.524","Project: Applying machine learning to AHP multicriteria decision making method to assets prioritization in the context of industrial maintenance 4.0"],"references":["313805453_Information_fusion_management_Collection_to_diffusion","235320296_Decision_theory_in_maintenance_decision_making","225029548_Overview_on_Bayesian_networks_applications_for_dependability_risk_analysis_and_maintenance_areas","3603890_WEKA_A_machine_learning_workbench","320159799_Industrial_maintenance_decision-making_A_systematic_literature_review","306231677_Understanding_the_Analytic_Hierarchy_Process","298118403_The_role_of_information_technology_in_knowledge_management","284907853_Decision_Making_for_Leaders_The_Analytical_Hierarchy_Process_for_Decisions_in_a_Complex_World","261039712_Bayesian_network_based_fault_diagnosis_and_maintenance_for_high-speed_train_control_systems","257392239_Efficient_Bayesian_network_modeling_of_systems","245507351_To_maintain_or_not_to_maintain_What_should_a_risk-averse_decision_maker_do","225811854_Open-source_machine_learning_R_Meets_Weka","222524133_Improving_the_analysis_of_dependable_systems_by_mapping_Fault_Trees_into_Bayesian_Networks"]}