{"id":"338141403_Tackling_Faults_in_the_Industry_40_Era-A_Survey_of_Machine-Learning_Solutions_and_Key_Aspects","abstract":"The recent advancements in the fields of artificial intelligence (AI) and machine learning (ML) have affected several research fields, leading to improvements that could not have been possible with conventional optimization techniques. Among the sectors where AI/ML enables a plethora of opportunities, industrial manufacturing can expect significant gains from the increased process automation. At the same time, the introduction of the Industrial Internet of Things (IIoT), providing improved wireless connectivity for real-time manufacturing data collection and processing, has resulted in the culmination of the fourth industrial revolution, also known as Industry 4.0. In this survey, we focus on the vital processes of fault detection, prediction and prevention in Industry 4.0 and present recent developments in ML-based solutions. We start by examining various proposed cloud/fog/edge architectures, highlighting their importance for acquiring manufacturing data in order to train the ML algorithms. In addition, as faults might also occur from sources beyond machine degradation, the potential of ML in safeguarding cyber-security is thoroughly discussed. Moreover, a major concern in the Industry 4.0 ecosystem is the role of human operators and workers. Towards this end, a detailed overview of ML-based human–machine interaction techniques is provided, allowing humans to be in-the-loop of the manufacturing processes in a symbiotic manner with minimal errors. Finally, open issues in these relevant fields are given, stimulating further research.","authors":["Angelos Angelopoulos","Emmanouel T. Michailidis","Nikolaos Nomikos","Trakadas Panagiotis"],"meta":["December 2019Sensors 20(1):109","DOI:10.3390/s20010109"],"references":["335430345_Toward_New-Generation_Intelligent_Manufacturing","335239325_Hybrid_Clouds_for_Data-Intensive_5G-Enabled_IoT_Applications_An_Overview_Key_Issues_and_Relevant_Architecture","335148344_Industry_50-A_Human-Centric_Solution","334438193_Artificial_intelligencemachine_learning_in_manufacturing_and_inspection_A_GE_perspective","333905743_A_review_of_machine_learning_for_the_optimization_of_production_processes","333411421_The_Intelligent_Factory_Space_-_A_Concept_for_Observing_Learning_and_Communicating_in_the_Digitalized_Factory","332775733_Spur_Gear_Fault_Diagnosis_Using_a_Multilayer_Gated_Recurrent_Unit_Approach_With_Vibration_Signal","332289804_The_Role_of_Big_Data_Analytics_in_Industrial_Internet_of_Things","332998304_A_Global_Manufacturing_Big_Data_Ecosystem_for_Fault_Detection_in_Predictive_Maintenance","332665841_Concept_Drift_Detection_and_Adaption_in_Big_Imbalance_Industrial_IoT_Data_Using_an_Ensemble_Learning_Method_of_Offline_Classifiers"]}