{"id":"338282215_Body_Condition_Score_BCS_Segmentation_and_Classification_in_Dairy_Cows_using_R-CNN_Deep_Learning_Architecture_R-CNN","abstract":"Body condition score (BCS) is based on scoring of dairy cattle from 1 to 5 according to the appearance of animals. BCS is a subjective method based on assessing of subcutaneous fat thickness on the regions in back, waist and coccyx regions in cattle and the bone spurs in the pelvic region by visual inspection and palpation method. BSC of animals in among the most important indicator of whether the needs of animals are met in livestock enterprises. In general, BCS values are determined by a method based on expert knowledge and determined by observation. If the animal is above or below the desired BCS, at this stage, diseases resulting from metabolic problems, low yield or animal losses may occur. With the regular control of this situation, the profitability of the enterprise may increase with healthier animals. For this purpose, in this study, it is aimed to segment the required regions and to classify the segmented regions in order to perform BCS. Images taken from dairy cattle were trained with the R-CNN architecture used in object detection applications, which are among the Convolutional Neural Networks (CNN) architectures. Of the 184 images, 75% (138) were used for training and 25% (46) were used for testing. During the training phase, the regions where BSC could be conducted from the raw images were labeled and these regions were learned. Then, the segmentation of the correct regions from the new images to the system was tested. Pre-trained networks were utilized to increase system success. For the classification of the segmented regions, the CNN network trained with AlexNet architecture was used. When the overall success of the system was evaluated, the AlexNet network correctly segmented 40 of the 46 raw test images, and the AlexNet CNN network correctly classified 28 of them and provided 60.86% overall success. The VGG16 network correctly segmented 42 of the 46 raw test images, and the AlexNet CNN network correctly classified 30 of them, achieving 65.21% overall success On the other hand, The VGG19 network correctly segmented 43 of the 46 raw test images, and the AlexNet CNN network correctly classified 31 of them, achieving 67.39% overall success.","authors":["Kerim Kürşat Çevik","Mustafa boğa"],"meta":["December 2019European Journal of Science and Technology","DOI:10.31590/ejosat.658365"],"references":["326866554_Derin_Ogrenme_ile_Kalabalik_Analizi_Uzerine_Detayli_Bir_Arastirma","305196650_Going_deeper_with_convolutions","38099318_Invited_review_Body_condition_score_and_its_association_with_dairy_cow_productivity_health_and_welfare","7837004_Influence_of_Body_Condition_Score_on_Relationships_Between_Metabolic_Status_and_Oxidative_Stress_in_Periparturient_Dairy_Cows","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311609041_Deep_Residual_Learning_for_Image_Recognition","265385906_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","258374356_Rich_Feature_Hierarchies_for_Accurate_Object_Detection_and_Semantic_Segmentation","6567941_Associations_Among_Body_Condition_Score_Body_Weight_Somatic_Cell_Count_and_Clinical_Mastitis_in_Seasonally_Calving_Dairy_Cattle"]}