{"id":"338297503_Offline_Persian_Handwriting_Recognition_with_CNN_and_RNN-CTC","abstract":"Offline Persian handwriting recognition is a challenging task due to the cursive nature of the Persian scripts and similarity among the Persian alphabet letters. This paper presents a Persian handwritten word recognizer based on a sequence labeling method with deep convolutional neural networks (CNN) and recurrent neural networks (RNN). In addition, a connectionist temporal classification (CTC) loss function is utilized in order to eliminate the segmentation step required in conventional methods. The CNN layers are employed to extract the sequence of features from the word image. Altogether, the RNN layer with CTC function is used for labeling the input sequence. We showed that this combination is a robust recognizer for the Persian language as it was for other fields of application such as scene text recognition. The method is tested on the popular Persian and Arabic datasets including IFN/ENIT. It also is compared with novel methods and promising results have been obtained particularly in comparison with the conventional approaches including HMM and other machine learning-based methods.","authors":["Vahid Mohammadi Safarzadeh","Pourya Jafarzadeh"],"meta":["January 2020","DOI:10.1109/CSICC49403.2020.9050073","Conference: 25th International Computer Conference Computer Society of IranAt: Iran University of Science And Technology, Tehran, IranVolume: 1","Project: Research on Deep Learning"],"references":["339129042_Fast_multi-language_LSTM-based_online_handwriting_recognition","335012221_Handwritten_Arabic_text_recognition_using_multi-stage_sub-core-shape_HMMs","305196650_Going_deeper_with_convolutions","303657108_TensorFlow_A_system_for_large-scale_machine_learning","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311611361_CNN-N-Gram_for_HandwritingWord_Recognition","311609522_You_Only_Look_Once_Unified_Real-Time_Object_Detection","310752533_Visualizing_and_understanding_convolutional_networks","299484563_A_Novel_Comprehensive_Database_for_Offline_Persian_Handwriting_Recognition"]}