{"id":"338237169_How_working_memory_capacity_limits_success_in_self-directed_learning_a_cognitive_model_of_search_and_concept_formation","abstract":"With this work we intend to develop cognitive modules for learning analytics solutions used in inquiry learning environments that can monitor and assess mental abilities involved in self-directed learning activities. We realize this idea by drawing on models from mathematical psychology, which specify assumptions about the human mind algorithmically and thereby automate a theory-driven data analysis. We report a study to exemplify this approach in which N =105 15-year-old high school students perform a self-determined navigation in a taxonomy of dinosaur concepts. We analyze their search and learning traces through the lens of a connectionist network model of working memory (WM). The results are encouraging in three ways. First, the model predicts students' average progress (as well as difficulties) in forming new concepts at high accuracy. Second, a simple (1-parameter) extension, which we derive from a meta-cognitive learning framework, is sufficient to also predict ag-gregated search patterns. Third, our initial attempt to fit the model to individual data offers some promising results: estimates of a free parameter correlate significantly with a measure of WM capacity. Together, we believe that these results help demonstrate a novel and promising way towards extending learner models by cognitive variables. We also discuss current limitations in the light of our future work on cognitive-computational scaffolding techniques in inquiry learning scenarios.","authors":["Paul Seitlinger","Abida Bibi","Õnne Uus","Tobias Ley"],"meta":["December 2019","DOI:10.1145/3375462.3375480","Conference: The 10th international Learning Analytics & Knowledge ConferenceAt: March 23–27, 2020, Frankfurt, Germany","Project: CEITER"],"references":["331333457_Towards_Hybrid_Human-System_Regulation_Understanding_Children'_SRL_Support_Needs_in_Blended_Classrooms","323760005_Supporting_collaborative_learning_with_tag_recommendations_a_real-world_study_in_an_inquiry-based_classroom_project","323502350_Searching_as_Learning_Exploring_Search_Behavior_and_Learning_Outcomes_in_Learning-related_Tasks","301216433_Reconceptualizing_imitation_in_social_tagging_a_reflective_search_model_of_human_web_interaction","290508767_Searching_as_learning_A_systematization_based_on_literature","335023947_Bringing_an_Educational_Robot_into_a_Basic_Education_Math_Lesson","328243042_The_Future_of_Learning_by_Searching_the_Web_Mobile_Social_and_Multimodal","322957071_Computational_Modeling_of_Cognition_and_Behavior","302970924_A_Simplex_Method_for_Function_Minimization","299131965_Towards_general_models_of_effective_science_inquiry_in_virtual_performance_assessments"]}