{"id":"338258676_Process-Based_Composition_of_Permissioned_and_Permissionless_Blockchain_Smart_Contracts","abstract":"Blockchains are distributed systems that facilitate the interaction of autonomous entities with limited mutual trust. Many of them support transactional applications known as smart contracts, which access and modify the shared world state. Permissionless blockchains are completely decentralized and do not require mutual trust between interacting peers, but at the expense of having low performance and limited data confidentiality capabilities. On the other hand, permissioned blockchains solve these issues, but sacrifice complete decentralization and involve more trust assumptions. Therefore, there is no single blockchain system suitable for all use-cases. However, this becomes a serious integration challenge for enterprises that need to interact with multiple permissioned and permissionless blockchains in the same context. To facilitate this, we propose an approach that enables composing smart contract functions of various permissioned and permissionless blockchain systems by providing the ability to invoke them directly from business process models using a new task type. To keep this task blockchain-agnostic, we designed a generic technique to identify smart contract functions, as well as a generic metric to describe the degree-of-confidence in the finality of blockchain transactions. Thereby, the proposed approach extends our previous work, BlockME, which provides business modeling extensions only suitable for interacting with permissionless blockchains. To validate the practical feasibility of our approach, we provide a detailed system architecture and a prototypical implementation supporting multiple blockchains. Keywords: blockchains, business process management, permissioned blockchains, smart contract composition, blockchain access layer, BlockME2","authors":["Ghareeb Falazi","Michael Hahn","Uwe Breitenbücher","Frank Leymann"],"meta":["October 2019","DOI:10.1109/EDOC.2019.00019","Conference: 2019 IEEE 23rd International Enterprise Distributed Object Computing Conference (EDOC)"],"references":["335411363_Transactional_properties_of_permissioned_blockchains","330912032_Modeling_and_execution_of_blockchain-aware_business_processes","324640508_Hyperledger_fabric_a_distributed_operating_system_for_permissioned_blockchains","316076240_Blockchains_for_Business_Process_Management_-_Challenges_and_Opportunities","311573669_Optimized_Execution_of_Business_Processes_on_Blockchain","334894367_Supporting_Reuse_of_Smart_Contracts_through_Service_Orientation_and_Assisted_Development","322851452_Hyperledger_Fabric_A_Distributed_Operating_System_for_Permissioned_Blockchains","318259899_Blockchains_Consensus_Protocols_in_the_Wild","315862855_Rethinking_Permissioned_Blockchains","312636698_Interledger_Creating_a_Standard_for_Payments","307507650_On_Scaling_Decentralized_Blockchains","228640975_Bitcoin_A_Peer-to-Peer_Electronic_Cash_System","220690914_Production_workflow_-_concepts_and_techniques","200034546_Augmented_BNF_for_Syntax_Specifications_ABNF","37685864_Production_Workflow_-_Concepts_and_Techniques","2924082_On_Memory-Bound_Functions_for_Fighting_Spam"]}