{"id":"338222836_Zagreb_Connection_Indices_of_Subdivision_and_Semi-Total_Point_Operations_on_Graphs","abstract":"Representation or coding of the molecular graphs with the help of numerical numbers plays a vital role in the studies of physicochemical and structural properties of the chemical compounds that are involved in the molecular graphs. For the first time, the modified first Zagreb connection index appeared in the paper by Gutman and Trinajstic (1972) to compute total electron energy of the alternant hydrocarbons, but after that, for a long time, it has not been studied. Recently, Ali and Trinajstic (2018) restudied the first Zagreb connection index ZC1 , the second Zagreb connection index ZC2 , and the modified first Zagreb connection index ZC1∗ to find entropy and acentric factor of the octane isomers. They also reported that the values provided by the International Academy of Mathematical Chemistry show better chemical capability of the Zagreb connection indices than the ordinary Zagreb indices. Assume that S1 and S2 denote the operations of subdivision and semitotal point, respectively. Then, the S -sum graphs Q1+QS2 are obtained by the cartesian product of SQ1 and Q2 , where S∈S1,S2 , Q1andQ2 are any connected graphs, and SQ1 is a graph obtained after applying the operation S on Q1 . In this paper, we compute the Zagreb connection indices ( ZC1 , ZC2 , and ZC1∗ ) of the S -sum graphs in terms of various topological indices of their factor graphs. At the end, as an application of the computed results, the Zagreb connection indices of the S -sum graphs obtained by the particular classes of alkanes are also included.","authors":["Jiang-Hua Tang","Usman Ali Madaan","Muhammad Javaid","Khurram Shabbir"],"meta":["December 2019Journal of Chemistry 2019(9):1-14","DOI:10.1155/2019/9846913","Project: graphy theory"],"references":["337934690_K_Banhatti_and_K_hyper-Banhatti_indices_of_nanotubes","336086298_QSPR_Analysis_of_certain_Distance_Based_Topological_Indices","334780735_Computing_Zagreb_Indices_of_the_Subdivision-Related_Generalized_Operations_of_Graphs","332054743_M-polynomials_and_degree-based_topological_indices_of_VC5C7pq_and_HC5C7pq_Nanotubes","332012041_APPLICATIONS_OF_GRAPH_THEORY_IN_COMPUTER_SCIENCE_AN_OVERVIEW","331640299_Predecessors_and_Gardens_of_Eden_in_sequential_dynamical_systems_over_directed_graphs","331631954_The_Study_of_Honey_Comb_Derived_Network_via_Topological_Indices","331597883_Zagreb_Polynomials_and_Redefined_Zagreb_indices_for_the_Line_Graph_of_Carbon_Nanocones","333187349_On_the_number_of_spanning_trees_and_normalized_Laplacian_of_linear_octagonal-quadrilateral_networks","332587810_Computing_First_General_Zagreb_Index_of_Operations_on_Graphs"]}