{"id":"338255160_Intraoperative_assessment_of_skull_base_tumors_using_stimulated_Raman_scattering_microscopy","abstract":"Intraoperative consultations, used to guide tumor resection, can present histopathological findings that are challenging to interpret due to artefacts from tissue cryosectioning and conventional staining. Stimulated Raman histology (SRH), a label-free imaging technique for unprocessed biospecimens, has demonstrated promise in a limited subset of tumors. Here, we target unexplored skull base tumors using a fast simultaneous two-channel stimulated Raman scattering (SRS) imaging technique and a new pseudo-hematoxylin and eosin (H&E) recoloring methodology. To quantitatively evaluate the efficacy of our approach, we use modularized assessment of diagnostic accuracy beyond cancer/non-cancer determination and neuropathologist confidence for SRH images contrasted to H&E-stained frozen and formalin-fixed paraffin-embedded (FFPE) tissue sections. Our results reveal that SRH is effective for establishing a diagnosis using fresh tissue in most cases with 87% accuracy relative to H&E-stained FFPE sections. Further analysis of discrepant case interpretation suggests that pseudo-H&E recoloring underutilizes the rich chemical information offered by SRS imaging, and an improved diagnosis can be achieved if full SRS information is used. In summary, our findings show that pseudo-H&E recolored SRS images in combination with lipid and protein chemical information can maximize the use of SRS during intraoperative pathologic consultation with implications for tissue preservation and augmented diagnostic utility.","authors":["Kseniya Shin","Andrew T. Francis","Andrew H. Hill","Mint Laohajaratsang"],"meta":["December 2019Scientific Reports 9(1):20392","DOI:10.1038/s41598-019-56932-8"],"references":["334512690_Evaluation_of_Deep_Learning_Strategies_for_Nucleus_Segmentation_in_Fluorescence_Images","332504633_Rapid_histology_of_laryngeal_squamous_cell_carcinoma_with_deep-learning_based_stimulated_Raman_scattering_microscopy","325886839_Multi-tissue_and_multi-scale_approach_for_nuclei_segmentation_in_HE_stained_images","325480958_Evaluation_of_Deep_Learning_Strategies_for_Nucleus_Segmentation_in_Fluorescence_Images","349225710_Intraoperative_Consultation_Cytologic_Preparations_and_Frozen_Section_in_the_Central_Nervous_System","336178294_Stimulated_Raman_histology_one_to_one_comparison_with_standard_hematoxylin_and_eosin_staining","334819560_Comparison_of_nonlinear_microscopy_and_frozen_section_histology_for_imaging_of_Mohs_surgical_margins","328836771_Broadband_hyperspectral_stimulated_Raman_scattering_microscopy_with_a_parabolic_fiber_amplifier_source","326644407_Invited_Article_Comparison_of_hyperspectral_coherent_Raman_scattering_microscopies_for_biomedical_applications","321042407_Rapid_virtual_hematoxylin_and_eosin_histology_of_breast_tissue_specimens_using_a_compact_fluorescence_nonlinear_microscope"]}