{"id":"338222104_On_the_relation_between_reactive_synthesis_and_supervisory_control_of_non-terminating_processes","abstract":"Reactive synthesis and supervisory control theory both provide a design methodology for the automatic and algorithmic design of digital systems from declarative specifications. The reactive synthesis approach originates in computer science, and seeks to synthesise a system that interacts with its environment over time and that, doing so, satisfies a prescribed specification. Here, the distinguishing feature when compared to other synthesis problems in computer science is that the interaction is temporal in that it explicitly refers to a sequence of computation cycles. Supervisory control originates in control theory and seeks to synthesise a controller that – in closed-loop configuration with a plant – enforces a prescribed specification over time. The distinguishing feature compared to other branches of control is that all dynamics are driven by discrete events as opposed to continuous signals. While both methods apparently are closely related, the technical details differ significantly. We provide a formal comparison which allows us to identify conditions under which one can solve one synthesis problem using methods from the other one; we also discuss how the resulting solutions compare. To facilitate this comparison, we give a unified introduction to reactive synthesis and supervisory control and derive formal problem statements and a characterisation of their solutions in terms of ω-languages. Recent contributions to the two fields address different aspects of the respective problem, and we expect the formal relationship identified in this paper to be useful in that it allows the application of algorithmic techniques from one field in the other.","authors":["Anne-Kathrin Schmuck","Thomas Moor","Rupak Majumdar"],"meta":["March 2020Discrete Event Dynamic Systems 30(11):1-44","DOI:10.1007/s10626-019-00299-5"],"references":["311716483_Synthesis_of_Maximally-Permissive_Supervisors_for_the_Range_Control_Problem","301832002_A_discussion_of_fault-tolerant_supervisory_control_in_terms_of_formal_languages","332199482_Environmentally-Friendly_GR1_Synthesis","326515864_Supervisor_Localization_of_Discrete-Event_Systems_with_Infinite_Behavior_This_work_was_supported_in_part_by_the_National_Nature_Science_Foundation_of_China_Grant_no_11772264_the_Natural_Science_Founda","326514905_On_the_Relation_between_Reactive_Synthesis_and_Supervisory_Control_of_InputOutput_Behaviours","320609271_Supervisor_Localization_of_Discrete-Event_Systems_with_Infinite_Behavior","309589113_Cooperative_Reactive_Synthesis","306167325_Synthesis_of_reactive_systems","304293439_Behavior_Composition_Meets_Supervisory_Control","301818410_Supervisory_Control_for_Behavior_Composition"]}