{"id":"338250433_A_Decision_Support_System_Tool_to_Manage_the_Flexibility_in_Renewable_Energy-Based_Power_Systems","abstract":"Renewable Energy Sources (RES) have taken on an increasingly important role in the energy mix in the last few years, and it has been forecasted that this trend will continue in the future. The energy production from these sources is not dispatchable, and the increasing penetration of RES in energy mixes may therefore lead to a progressive loss of generation control and predictability. It has become clear that, to reach higher RES penetration levels, it is essential to increase power system flexibility in order to ensure stable operations are maintained. An ICT (Information and Communication Technology) tool that may be used to manage and optimize the flexibility offered by energy storage and conversion systems is described in this paper with specific reference to the Decision Support System (DSS) developed within the H2020 PLANET (PLAnning and operational tools for optimizing energy flows and synergies between energy NETworks) project. The paper focuses on how the PLANET DSS tool evaluates, manages, and dispatches the flexibility of Power to Gas/Heat (P2X) technologies. Moreover, the tool has been used to analyze a realistic case in order to show how the PLANET DSS tool could be used to evaluate the energy and economic benefits of taking advantage of the flexibility of P2X technologies.","authors":["Marco Badami","Gabriele Fambri","Salvatore Mancò","Mariapia Martino"],"meta":["December 2019Energies 13(1):153","DOI:10.3390/en13010153"],"references":["336456382_Optimal_Strategy_to_Exploit_the_Flexibility_of_an_Electric_Vehicle_Charging_Station","334625387_Redefining_energy_system_flexibility_for_distributed_energy_system_design","331740156_Photovoltaic_Power_Converter_Management_in_Unbalanced_Low_Voltage_Networks_with_Ancillary_Services_Support","330866579_Optimising_energy_flows_and_synergies_between_energy_networks","327371869_Applications_of_power_to_gas_technologies_in_emerging_electrical_systems","324552447_Optimal_Scheduling_of_Residential_Microgrids_Considering_Virtual_Energy_Storage_System","335425553_Optimal_Planning_and_Operation_Scheduling_of_Battery_Storage_Units_in_Distribution_Systems","330477720_ICT_optimization_tool_for_RES_integration_in_combined_energy_networks","329162046_Distribution_System_Modeling_and_Analysis","327463336_Planning_and_Real-time_Management_of_Smart_Grids_with_High_PV_Penetration_in_Low_Voltage"]}