{"id":"338373249_Significant_spatial_patterns_from_the_GCM_seasonal_forecasts_of_global_precipitation","abstract":"Fully coupled global climate models (GCMs) generate a vast amount of high-dimensional forecast data of the global climate; therefore, interpreting and understanding the predictive performance is a critical issue in applying GCM forecasts. Spatial plotting is a powerful tool to identify where forecasts perform well and where forecasts are not satisfactory. Here we build upon the spatial plotting of anomaly correlation between forecast ensemble mean and observations to derive significant spatial patterns to illustrate the predictive performance. For the anomaly correlation derived from the 10 sets of forecasts archived in the North America Multi-Model Ensemble (NMME) experiment, the global and local Moran's I are calculated to associate anomaly correlations at neighbouring grid cells with one another. The global Moran's I associates anomaly correlation at the global scale and indicates that anomaly correlation at one grid cell relates significantly and positively to anomaly correlation at surrounding grid cells. The local Moran's I links anomaly correlation at one grid cell with its spatial lag and reveals clusters of grid cells with high, neutral, and low anomaly correlation. Overall, the forecasts produced by GCMs of similar settings and at the same climate centre exhibit similar clustering of anomaly correlation. In the meantime, the forecasts in NMME show complementary performances. About 80 % of grid cells across the globe fall into the cluster of high anomaly correlation under at least 1 of the 10 sets of forecasts. While anomaly correlation exhibits substantial spatial variability, the clustering approach serves as a filter of noise to identify spatial patterns and yields insights into the predictive performance of GCM seasonal forecasts of global precipitation.","authors":["Tongtiegang Zhao","Wei Zhang","Yongyong Zhang","Zhiyong Liu"],"meta":["January 2020Hydrology and Earth System Sciences 24(1):1-16","DOI:10.5194/hess-24-1-2020","Project: Precipitation, monsoon, floods/droughts and temperature extremes."],"references":["335637124_Significant_spatial_patterns_from_the_GCM_seasonal_forecasts_of_global_precipitation","332418843_Towards_reliable_extreme_weather_and_climate_event_attribution","331239082_Cartograms_for_Use_in_Forecasting_Weather-Driven_Natural_Hazards","336647552_An_evaluation_of_ECMWF_SEAS5_seasonal_climate_forecasts_for_Australia_using_a_new_forecast_calibration_algorithm","334713650_A_Seasonally_Coherent_Calibration_SCC_Model_for_Postprocessing_Numerical_Weather_Predictions","330522101_Towards_operational_predictions_of_the_near-term_climate","330265197_Predictive_performance_of_NMME_seasonal_forecasts_of_global_precipitation_A_spatial-temporal_perspective","330049706_Ensemble_forecasting_of_monthly_and_seasonal_reference_crop_evapotranspiration_based_on_global_climate_model_outputs","325587119_ACCESS-S1_The_new_Bureau_of_Meteorology_multi-week_to_seasonal_prediction_system","325363347_Relating_Anomaly_Correlation_to_Lead_Time_Principal_Component_Analysis_of_NMME_Forecasts_of_Summer_Precipitation_in_China"]}