{"id":"338359248_Mathematical_and_Coding_Lessons_Based_on_Creative_Origami_Activities","abstract":"This paper considers how creativity and creative activities can be encouraged in regular mathematical classes by combining different teaching approaches and academic disciplines. We combined origami and paper folding with fractals and their mathematical properties as well as with coding in Scratch in order to facilitate learning mathematics and computer science. We conducted a case study experiment in a Serbian school with 15 high school students and applied different strategies for learning profound mathematical and coding concepts such as fractals dimension and recursion. The goal of the study was to employ creative activities and examine students’ activities during this process in regular classrooms and during extracurricular activities. We used Scratch as a programming language, since it is simple enough for students and it focuses on the concept rather than on the content. Real-life situation of folding Dragon curve was used to highlight points that could cause difficulties in the coding process. Classroom observations and interviews revealed that different approaches guided students through their learning processes and gradually made the introduced concepts meaningful and applicable. With the introduction of this approach, students acquired understanding of the concept of coding recursion trough paper folding and applied it in the higher-level programming. In addition, our teaching approach made students enthusiastic, motivated and engaged with the learning of usually difficult subjects.","authors":["Natalija Budinski","Zsolt Lavicza","Kristof Fenyvesi","Miroslav Novta"],"meta":["December 2019Open Education Studies 1(1):220-227","DOI:10.1515/edu-2019-0016"],"references":["313038173_Geometry_Teaching_via_Origami_The_Views_of_Secondary_Mathematics_Teacher_Trainees","295834135_Teaching_with_Scratch_in_Compulsory_Secondary_Education","280983328_Qualitative_Research_-_Airy_Fairy_or_Fundamental","351803049_Teaching_Mathematical_Thinking_through_Origami","348333920_Fractals_in_the_Classroom","347686960_Concept-Based_Curriculum_and_Instruction_for_the_Thinking_Classroom","347394253_Using_Origami_to_Promote_Geometric_Communication","346337882_National_Council_of_Teachers_of_Mathematics","324422632_Totally_Real_Origami_and_Impossible_Paper_Folding","288667549_Ella_Minnow_Pea_An_allegory_for_our_times","280164469_MIT_Scratch_A_Powerful_Tool_for_Improving_Teaching_of_Programming","271746747_The_Effects_of_Teaching_Programming_via_Scratch_on_Problem_Solving_Skills_A_Discussion_from_Learners'_Perspective","277934316_The_Ice_Cube_Proof","270707731_Qualitative_Approaches_in_Mathematics_Education_Research_Challenges_and_Possible_Solutions","263379406_Folding_flat_silhouettes_and_wrapping_polyhedral_packages_New_results_in_computational_origami"]}