{"id":"338377270_INTELIGENCIA_ARTIFICIAL_E_PROGRAMAS_DE_COMPUTADOR_MAPEAMENTO_TECNOLOGICO_DOS_REGISTROS_NO_BRASIL","abstract":"A inteligência artificial é um ramo da ciência da computação que visa criar máquinas inteligentes, cujo funcionamento e reações buscam imitar os seres humanos, apresentando, inclusive, capacidade de aprendizado autônomo. A inteligência artificial se tornou uma parte essencial da indústria de tecnologia. Entretanto, não se tem uma visão clara da abrangência do uso desse recurso tecnológico, visto que geralmente ele atua nos \"bastidores\", permitindo o funcionamento dos protagonistas, ou seja, os equipamentos, máquinas e hardwares de maneira geral, que inclusive já foram alvo de extensivo mapeamento em nível global. O objetivo deste trabalho é, portanto, realizar um mapeamento dos programas de computador, registrados no Instituto Nacional da Propriedade Industrial, cuja funcionalidade é baseada em inteligência artificial, para verificar a atuação do Brasil em relação a apropriação dessa tecnologia e se o país está acompanhando o cenário mundial em termos de proteção intelectual. A metodologia utilizada foi um estudo bibliométrico dos registros na base de dados do Instituto Nacional da Propriedade Industrial, com tabulação e análise dos dados em planilhas eletrônicas, comparando com a taxonomia proposta pela Organização Mundial da Propriedade Intelectual, que mapeou as patentes mundialmente. Os resultados demonstraram que o Brasil ainda possui um acervo de programas de computador de pequena monta, apenas 110 registros, porém esse número está em plena ascensão. Do ponto de vista de utilização da tecnologia e dos titulares, o cenário nacional é bem diferente do percebido em nível global, mas ambos indicam que essa área está em plena expansão. Palavras-chave: ciência da computação; INPI; prospecção tecnológica; software.","authors":["Breno Ricardo de Araújo Leite","Danielle Regina da Natividade Ferreira","Luana Silva do Rosário","Luiz Henrique Castelan Carlson"],"meta":["January 2020","Project: Empreendorismo, Propriedade Intelectual, Transferência de Tecnologia e Inovação na UFSC"],"references":["281453690_Elaboracao_de_indicadores_de_producao_cientifica_com_base_na_analise_cientometrica_das_dissertacoes_e_teses_do_IPEN","30874496_Artificial_Intelligence_A_Modern_Approach"]}