{"id":"338381032_Contracting_projected_entangled_pair_states_is_average-case_hard","abstract":"An accurate calculation of the properties of quantum many-body systems is one of the most important yet intricate challenges of modern physics and computer science. In recent years, the tensor network ansatz has established itself as one of the most promising approaches enabling striking efficiency of simulating static properties of one-dimensional systems and abounding numerical applications in condensed matter theory. In higher dimensions, however, a connection to the field of computational complexity theory has shown that the accurate normalization of the two-dimensional tensor networks called projected entangled pair states (PEPS) is #P-complete. Therefore an efficient algorithm for PEPS contraction would allow solving exceedingly difficult combinatorial counting problems, which is considered highly unlikely. Due to the importance of understanding two- and three-dimensional systems the question currently remains: Are the known constructions typical of states relevant for quantum many-body systems? In this work, we show that an accurate evaluation of normalization or expectation values of PEPS is as hard to compute for typical instances as for special configurations of highest computational hardness. We discuss the structural property of average-case hardness in relation to the current research on efficient algorithms attempting tensor network contraction, hinting at a wealth of possible further insights into the average-case hardness of important problems in quantum many-body theory.","authors":["Jonas Haferkamp","Dominik Hangleiter","Jens Eisert","Marek Gluza"],"meta":["January 2020Physical Review Research 2(1)","DOI:10.1103/PhysRevResearch.2.013010"],"references":["328581827_On_the_complexity_and_verification_of_quantum_random_circuit_sampling","327045512_The_quantum_technologies_roadmap_A_European_community_view","320975935_Many-body_localization_An_introduction_and_selected_topics","318316143_A_tensor_network_study_of_the_complete_ground_state_phase_diagram_of_the_spin-1_bilinear-biquadratic_Heisenberg_model_on_the_square_lattice","318277028_Efficient_Representation_of_Fully_Many-Body_Localized_Systems_Using_Tensor_Networks","331293300_Tensor_Network_Annealing_Algorithm_for_Two-Dimensional_Thermal_States","329926429_Faster_methods_for_contracting_infinite_two-dimensional_tensor_networks","328819131_Non-Abelian_chiral_spin_liquid_in_a_quantum_antiferromagnet_revealed_by_an_iPEPS_study","323722809_Quantum_Supremacy_and_the_Complexity_of_Random_Circuit_Sampling","321124692_Faster_Methods_for_Contracting_Infinite_2D_Tensor_Networks"]}