{"id":"338383421_Statistical_language_models_for_query-by-example_spoken_document_retrieval","abstract":"Query-by-example spoken document retrieval (QbESDR) consists in, given a collection of documents, computing how likely a spoken query is present in each document. This is usually done by means of pattern matching techniques based on dynamic time warping (DTW), which leads to acceptable results but is inefficient in terms of query processing time. In this paper, the use of probabilistic retrieval models for information retrieval is applied to the QbESDR scenario. First, each document is represented by means of a language model, as commonly done in information retrieval, obtained by estimating the probability of the different n-grams extracted from automatic phone transcriptions of the documents. Then, the score of a query given a document can be computed following the query likelihood retrieval model. Besides the adaptation of this model to QbESDR, this paper presents two techniques that aim at enhancing the performance of this method. One of them consists in improving the language models of the documents by using several phone transcription hypotheses for each document. The other approach aims at re-ranking the retrieved documents by incorporating positional information to the system, which is achieved by string alignment of the query and document phone transcriptions. Experiments were performed on two large and heterogeneous datasets specifically designed for search on speech tasks, namely MediaEval 2013 Spoken Web Search (SWS 2013) and MediaEval 2014 Query-by-Example Search on Speech (QUESST 2014). The experimental results prove the validity of the proposed strategies for QbESDR. In addition, the performance when dealing with queries with word reorderings is superior to that exhibited by a DTW-based strategy, and the query processing time is smaller by several orders of magnitude.","authors":["Paula Lopez-Otero","Javier Parapar","Alvaro Barreiro"],"meta":["March 2020Multimedia Tools and Applications 79(8)","DOI:10.1007/s11042-019-08522-z"],"references":["322643591_Distance_Metric_Learning_for_Posteriorgram_Based_Keyword_Search","314560518_Distance_Metric_Learning_for_Posteriorgram_Based_Keyword_Search","311059046_GTM-UVigo_Systems_for_Albayzin_2016_Search_on_Speech_Evaluation","327837054_Efficient_query-by-example_spoken_document_retrieval_combining_phone_multigram_representation_and_dynamic_time_warping","324957361_Design_of_Mixture_of_GMMs_for_Query-by-Example_Spoken_Term_Detection","320330922_VTLN-warped_Gaussian_posteriorgram_for_QbE-STD","318870586_A_Language_Modeling_Approach_to_Information_Retrieval","316024510_Partial_matching_and_search_space_reduction_for_QbE-STD","308806274_Language_independent_query-by-example_spoken_term_detection_using_N-best_phone_sequences_and_partial_matching","308161218_Introduction_to_information_retrieval_chapt","304230936_Analysis_of_constraints_on_segmental_DTW_for_the_task_of_query-by-example_spoken_term_detection","306359065_Finding_Relevant_Features_for_Zero-Resource_Query-by-Example_Search_on_Speech","304378537_Approximate_search_of_audio_queries_by_using_DTW_with_phone_time_boundary_and_data_augmentation","303667717_Information_Retrieval_for_Music_and_Motion","303132310_A_study_of_smoothing_methods_for_language_models_applied_to_ad_hoc_information_retrieval"]}