{"id":"338331698_APPROCHE_DE_L'ECRIT_ACADEMIQUE_DANS_UN_MILIEU_D'APPRENTISSAGE_DE_L'INGENIERIE_CIVILE_EN_INFORMATIQUE","abstract":"Resume: Ce travail est inséré dans le domaine des processus d'alphabétisation académique dans le domaine de l'ingénierie. Plus précisément, son objectif est de comprendre le rôle de la rédaction académique dans l'enseignement universitaire de premier cycle en génie informatique civil en tant que sous-discipline attractive dans le monde actuel. Cette recherche est basée sur la notion d'écriture académique et disciplinaire (SWALES, 1990, 2004 ; BAZERMAN, 1988, 2005; MOTTA-ROTH, 2006; PARODI, 2010; NAVARRO, 2014) et utilise une méthodologie qualitative informatisée. Les principaux résultats finalement obtenus sont reflétés dans un modèle explicatif. Mots-cles: alphabétisation universitaire ; écriture académique ; genres de formation académique ; enseignement de l'écriture académique; classification de l'écriture des étudiants. \n\nResumo: Este trabalho está inserido no campo dos processos de alfabetização acadêmica na área de engenharia. Especificamente, seu objetivo é compreender o papel da escrita acadêmica na graduação universitária em engenharia da computação civil como uma subdisciplina gravitacional no mundo atual. Esta pesquisa baseia-se na noção de escrita acadêmica e disciplinar (utiliza uma metodologia qualitativa etnograficamente informada. Os principais resultados finalmente obtidos são refletidos em um modelo explicativo. Palavras-chave: alfabetização acadêmica; redação acadêmica; gêneros de formação acadêmica; ensino de redação acadêmica; classificação de escrita de alunos.","authors":["Enrique Sologuren Insúa"],"meta":["December 2019"],"references":["315083977_Shaping_Written_Knowledge_The_Genre_and_Activity_of_the_Experimental_Article_in_Science","309407058_Academic_Literacy_and_Genres_in_University_Learning_Communities","305637478_Que_son_los_generos_profesionales_Apuntes_teorico-metodologicos_para_el_estudio_del_discurso_profesional","331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","296171687_Open-access_writing_An_investigation_into_the_online_drafting_and_revision_of_a_research_article_in_pure_mathematics","276000144_Writing_and_Identity_The_Discoursal_Construction_of_Identity_in_Academic_Writing","272177823_Grounded_Theory_Research_Procedures_Canons_and_Evaluative_Criteria","267777504_A_Classification_of_Genre_Families_in_University_Student_Writing","258199970_Wearing_Suits_to_Class_Simulating_Genres_and_Simulations_as_Genre","257603805_How_do_writers_establish_research_niches_A_genre-based_investigation_into_management_researchers'_rhetorical_steps_and_linguistic_mechanisms"]}