{"id":"338453477_Outcome-based_Education_An_Outline","abstract":"Things we can do because of learning are called outcomes of learning. Outcome based education (OBE) was propounded by William Spady in the 90s to bring the focus of formal education to what the students learn rather than what they were taught. OBE is a system of education giving priority to ends, purpose, accomplishments, and results. All decisions about the curriculum, assessment, and instruction are driven by the exit learning outcomes the students should display at the end of a program or a course. This paper presents a method of writing outcomes for General higher education programs. Outcomes for a higher education program are defined at three levels as program outcomes (POs), program specific outcomes (PSOs), and course outcomes (COs). The most important aspect of an outcome is that it should be observable and measurable. These are best written in a well-defined framework of taxonomy of learning. Bloom’s taxonomy of learning identifies three domains of learning: Cognitive, affective and psychomotor. Revised Bloom taxonomy of cognitive domain has two dimensions cognitive levels and knowledge categories. It is proposed that CO statements be written within a well-defined structure: Action, knowledge elements, conditions, and criteria. Tagging COs with POs, PSOs, cognitive levels and the number of classroom hours associated facilitates the computation of attainment of COs, POs, and PSOs.","authors":["N J Rao"],"meta":["January 2020Higher Education for the Future 7(1):234763111988641","DOI:10.1177/2347631119886418"],"references":["235701029_Experiential_Learning_Experience_As_The_Source_Of_Learning_And_Development","355008309_Critical_Issues_and_Answers_of_Outcome-Based_Education_for_Technical_Institutions_in_India","281345394_The_New_Taxonomy_of_Educational_Objectives","257925990_How_People_Learn_Mind_Brain_Experience_and_School","248916317_Taxonomy_of_Educational_Objectives_Handbook_2_Affective_Domain","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives","245104165_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_revision_of_Bloom''s_Taxonomy_of_Educational_Objec","242375639_Principles_of_Instructional_Design","235465787_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives","233896779_The_teaching_of_learning_strategies"]}