{"id":"338429513_Inovacao_no_ensino_por_meio_de_tecnologias_associadas_a_estilos_de_aprendizagem","abstract":"This work aims to provide a practical tool, generating quantified results on the learning style of a particular group, enabling the teacher, means to evaluate and thus choose the best method and resources, when developing a lesson plan for a particular class. To this end, the ILS (Index of Learning Styles) developed by Felder-Soloman was used, which consists of a questionnaire, which allows to know the predominant learning styles in the individual, which, in turn, is the foundation of the Learning Styles model. Learning developed by Felder-Silverman (1988). Initially the dialogue about the learning styles survey in the Felder model was established with two course coordinators. The first coordinates the Systems Analysis and Development, Computer Science courses, the second coordinates the Production Engineering and Mechanical Engineering courses. They brokered dialogues with the teachers they would like to attend, as well as the students. Then, an application was used to guide the student or teacher in conducting the filling, considering the analysis of dimensions. At this point, the application presents the points of each style allowing you to know the learning styles of your students. As a result, the application collaborates positively for various initiatives in learning the learning styles of both students and teachers, and it can be concluded, therefore, that this tool enhances student learning once the teacher knows the class you will work with, enabling new strategies aligned with the needs of the class in question.","authors":["Márcio Eugen Klingenschmid Lopes dos Santos","Alex Paubel Junger","Gilmar Cardozo de Jesus","Sidnei Andrade"],"meta":["January 2020Research Society and Development 9(2):163921971","DOI:10.33448/rsd-v9i2.1971"],"references":["327936955_Ensino_de_cursos_tecnologicos_por_meio_de_estilos_de_aprendizagem_aplicados_a_estatistica","327293854_Ensino_em_Engenharia_de_Producao_com_base_no_desenvolvimento_de_habilidades_e_competencias","312470401_Learningteaching_styles_in_engineering_education","279894244_Applications_reliability_and_validity_of_the_Index_of_Learning_Styles","239573605_Reaching_the_Second_Tier_Learning_and_Teaching_Styles_in_College_Science_Education","49607114_O_Impacto_dos_Estilos_de_Aprendizagem_no_Ensino_de_Contabilidade"]}