{"id":"338426864_Segmentation_of_organs-at-risk_in_cervical_cancer_CT_images_with_a_convolutional_neural_network","abstract":"Purpose: \nWe introduced and evaluated an end-to-end organs-at-risk (OARs) segmentation model that can provide accurate and consistent OARs segmentation results in much less time.\n\nMethods: \nWe collected 105 patients' Computed Tomography (CT) scans that diagnosed locally advanced cervical cancer and treated with radiotherapy in one hospital. Seven organs, including the bladder, bone marrow, left femoral head, right femoral head, rectum, small intestine and spinal cord were defined as OARs. The annotated contours of the OARs previously delineated manually by the patient's radiotherapy oncologist and confirmed by the professional committee consisted of eight experienced oncologists before the radiotherapy were used as the ground truth masks. A multi-class segmentation model based on U-Net was designed to fulfil the OARs segmentation task. The Dice Similarity Coefficient (DSC) and 95th Hausdorff Distance (HD) are used as quantitative evaluation metrics to evaluate the proposed method.\n\nResults: \nThe mean DSC values of the proposed method are 0.924, 0.854, 0.906, 0.900, 0.791, 0.833 and 0.827 for the bladder, bone marrow, femoral head left, femoral head right, rectum, small intestine, and spinal cord, respectively. The mean HD values are 5.098, 1.993, 1.390, 1.435, 5.949, 5.281 and 3.269 for the above OARs respectively.\n\nConclusions: \nOur proposed method can help reduce the inter-observer and intra-observer variability of manual OARs delineation and lessen oncologists' efforts. The experimental results demonstrate that our model outperforms the benchmark U-Net model and the oncologists' evaluations show that the segmentation results are highly acceptable to be used in radiation therapy planning.","authors":["Zhikai Liu","Xia Liu","Bin Xiao","Shaobin Wang"],"meta":["January 2020Physica Medica 69:184-191","DOI:10.1016/j.ejmp.2019.12.008"],"references":["331656371_Dual-energy_CT_for_automatic_organs-at-risk_segmentation_in_brain-tumor_patients_using_a_multi-atlas_and_deep-learning_approach","331381617_Automatic_Multi-Organ_Segmentation_in_Thorax_CT_Images_Using_U-Net-GAN","328362440_Multi-region_segmentation_of_bladder_cancer_structures_in_MRI_with_progressive_dilated_convolutional_networks","327645591_Deep_learning_to_achieve_clinically_applicable_segmentation_of_head_and_neck_anatomy_for_radiotherapy","344959806_Advances_in_Auto-Segmentation","331977248_Rapid_advances_in_auto-segmentation_of_organs_at_risk_and_target_volumes_in_head_and_neck_cancer","331896123_A_Convolutional_Neural_Network_Algorithm_for_Automatic_Segmentation_of_Head_and_Neck_Organs-at-Risk_Using_Deep_Lifelong_Learning","331503829_Deep_convolutional_neural_network_for_segmentation_of_thoracic_organs-at-risk_using_cropped_3D_images","328976918_Fully_automated_organ_segmentation_in_male_pelvic_CT_images","327977510_A_novel_MRI_Segmentation_method_using_CNN_based_Correction_Network_for_MRI_Guided_Adaptive_Radiotherapy"]}