{"id":"338422063_Deep_Learning_frameworks_for_wave_propagation-based_damage_detection_in_1D-waveguides","abstract":"Deep Learning methodologies are said to mimic the brain cognition capabilities and are revolutionizing across various engineering domains. Wave propagation-based damage detection methodology is one of the preferred candidates for online health monitoring systems. In this paper, we have used deep learning models to detect cracks in 1D-waveguides using axial waves. A discontinuity in the waveguide in the form of a crack introduces prior reflections and these signatures are utilized to classify them. In this work, different cracks are introduced with varying crack lengths across different locations. High-frequency tone-burst signals are used to excite the waveguide and their time-domain representations are converted into the frequency domain. Spectral finite element formulations are used to model the cracks in the frequency domain. The solution is converted back into the time-domain and is used to form the feature space (inputs) for deep learning frameworks. We have used classification based supervised deep learning models: Dense Neural Networks (DNNs), 1D-Convolutional Neural Networks (1D-CNNs), Recurrent Neural Networks (RNNs) and Long Short-Term Memory (LSTMs) to detect damage in the waveguide. Alternatively, time-frequency analysis in the form of wavelet transform is also employed to train 2D-CNNs for damage detection. The proposed models are implemented in Python using TensorFlow APIs and the models are trained to learn decision boundary mappings from the feature space to the target space. New signatures are fed into the trained models to detect damages autonomously in real-time without resorting to time-taking pre-processing step and expert's analysis. Metrics like accuracy, binary cross-entropy loss, overall training time and prediction time are used to compare the performance of these frameworks. Their ability to learn and generalize over the phenomenon of damage detection is also discussed.","authors":["Mahindra Rautela","S Gopalakrishnan"],"meta":["January 2020","Conference: 11th International Symposium on NDT in Aerospace - 2019At: Paris-Saclay, France","Project: Machine Learning / Deep Learning for SHM/NDT"],"references":["336186043_Intelligent_fault_diagnosis_for_rotating_machinery_using_deep_Q-network_based_health_state_classification_A_deep_reinforcement_learning_approach","333344223_Electromechanical_admittance_based_integrated_health_monitoring_of_adhesive_bonded_beams_using_surface_bonded_piezoelectric_transducers","323285060_Computer_vision_and_deep_learning-based_data_anomaly_detection_method_for_structural_health_monitoring","318405253_Time-Frequency_Based_Data-Driven_Structural_Diagnosis_and_Damage_Detection_for_Cable-Stayed_Bridges","315613676_Deep_Learning-Based_Crack_Damage_Detection_Using_Convolutional_Neural_Networks","309834298_Real-Time_Vibration-Based_Structural_Damage_Detection_Using_One-Dimensional_Convolutional_Neural_Networks","300079686_Vibration-based_damage_detection_techniques_used_for_health_monitoring_of_structures_a_review","330000984_Structural_vibration-based_classification_and_prediction_of_delamination_in_smart_composite_laminates_using_deep_learning_neural_network","329872597_A_robust_Bayesian_methodology_for_damage_localization_in_plate-like_structures_using_ultrasonic_guided-waves","327298898_Lamb_Wave_Interaction_with_Composite_Delamination"]}