{"id":"338421746_Release_of_Unverified_Plaintext_Tight_Unified_Model_and_Application_to_ANYDAE","abstract":"Authenticated encryption schemes are usually expected to offer confidentiality and authenticity. In case of release of unverified plaintext (RUP), an adversary gets separated access to the decryption and verification functionality, and has more power in breaking the scheme. Andreeva et al. (ASIACRYPT 2014) formalized RUP security using plaintext awareness, informally meaning that the decryption functionality gives no extra power in breaking confidentiality, and INT-RUP security, covering authenticity in case of RUP. We describe a single, unified model, called AERUP security, that ties together these notions: we prove that an authenticated encryption scheme is AERUP secure if and only if it is conventionally secure, plaintext aware, and INT-RUP secure. We next present ANYDAE, a generalization of SUNDAE of Banik et al. (ToSC 2018/3). ANYDAE is a lightweight deterministic scheme that is based on a block cipher with block size n and arbitrary mixing functions that all operate on an n-bit state. It is particularly efficient for short messages, it does not rely on a nonce, and it provides maximal robustness to a lack of secure state. Whereas SUNDAE is not secure under release of unverified plaintext (a fairly simple attack can be mounted in constant time), ANYDAE is. We make handy use of the AERUP security model to prove that ANYDAE achieves both conventional security as RUP security, provided that certain modest conditions on the mixing functions are met. We describe two simple instances, called MONDAE and TUESDAE, that conform to these conditions and that are competitive with SUNDAE, in terms of efficiency and optimality.","authors":["Donghoon Chang","Nilanjan Datta","Avijit Dutta","Bart Mennink"],"meta":["January 2019","DOI:10.13154/tosc.v2019.i4.119-146"],"references":["317769735_Integrity_analysis_of_authenticated_encryption_based_on_stream_ciphers","346707195_SAEB_A_Lightweight_Blockcipher-Based_AEAD_Mode_of_Operation","346705024_Beetle_Family_of_Lightweight_and_Secure_Authenticated_Encryption_Ciphers","333182437_Blockcipher-Based_Authenticated_Encryption_How_Small_Can_We_Go","331483516_SUNDAE_Small_universal_deterministic_authenticated_encryption_for_the_internet_of_things","325859484_On_the_optimality_of_non-linear_computations_for_symmetric_key_primitives"]}