{"id":"338482511_Transonic_aeroelasticity_A_new_perspective_from_the_fluid_mode","abstract":"Within the transonic regime, the aeroelastic problems exhibit many unique characteristics compared with subsonic and supersonic cases. Although a lot of research has been carried out in this field, the underlying mechanisms of these complex phenomena are not clearly understood yet, resulting in a challenge in the design and use of modern aircraft. This review summarizes the recent investigations on nonclassical transonic aeroelastic problems, including transonic buzz, reduction of transonic buffet onset, transonic buffeting response and frequency lock-in phenomenon in transonic buffet flow. After introducing the research methods in unsteady aerodynamics and aeroelastic problems, the dynamical characteristics as well as the physical mechanisms of these phenomena are discussed from the perspective of the fluid mode. In the framework of the ROM (reduced order model) -based model, the dominant fluid mode (or the eigenvalue) and its coupling process with the structural model can be clearly captured. The flow nonlinearity was believed to be the cause of the complexity of transonic aeroelasticity. In fact, this review indicates that the complexity lies in the decrease of the flow stability in the transonic regime. In this condition, the fluid mode becomes a principal part of the coupling process, which results in the instability of the fluid mode itself or the structural mode, and thus, it is the root cause of different transonic aeroelastic phenomena.","authors":["Chuanqiang Gao","Weiwei Zhang"],"meta":["February 2020Progress in Aerospace Sciences 113:100596","DOI:10.1016/j.paerosci.2019.100596"],"references":["332197235_Deep_neural_network_for_unsteady_aerodynamic_and_aeroelastic_modeling_across_multiple_Mach_numbers","327010237_Fast_identification_of_transonic_buffet_envelope_using_computational_fluid_dynamics","319267158_Transonic_buffet_control_research_with_two_types_of_shock_control_bump_based_on_RAE2822_airfoil","330092411_Simulation_of_Transonic_Buffet_Using_a_Time-Spectral_Method","328796586_Numerical_analysis_of_transonic_buffet_flow_around_a_hammerhead_payload_fairing","324868013_Frequency_lock-in_in_pitch-heave_stall_flutter","324243027_Reduction_of_transonic_buffet_onset_for_a_wing_with_activated_elasticity","324051633_Nonlinear_Identification_via_Connected_Neural_Networks_for_Unsteady_Aerodynamic_Analysis","322980333_Efficient_aeroelastic_reduced_order_model_with_global_structural_modifications","320737930_Coupling_of_Recurrent_and_Static_Neural_Network_Approaches_for_Improved_Multi-step_Ahead_Time_Series_Prediction"]}