{"id":"338426529_Deep-Channel_uses_deep_neural_networks_to_detect_single-molecule_events_from_patch-clamp_data","abstract":"Single-molecule research techniques such as patch-clamp electrophysiology deliver unique biological insight by capturing the movement of individual proteins in real time, unobscured by whole-cell ensemble averaging. The critical first step in analysis is event detection, so called “idealisation”, where noisy raw data are turned into discrete records of protein movement. To date there have been practical limitations in patch-clamp data idealisation; high quality idealisation is typically laborious and becomes infeasible and subjective with complex biological data containing many distinct native single-ion channel proteins gating simultaneously. Here, we show a deep learning model based on convolutional neural networks and long short-term memory architecture can automatically idealise complex single molecule activity more accurately and faster than traditional methods. There are no parameters to set; baseline, channel amplitude or numbers of channels for example. We believe this approach could revolutionise the unsupervised automatic detection of single-molecule transition events in the future. Numan Celik et al. present a deep learning model that automatically detects single-molecule events against a noisy background in patch-clamp electrophysiological data, based on convolutional neural networks and long short-term memory architecture. This algorithm represents a step torward a fully automated electrophysiological platform.","authors":["Numan Celik","Fiona O'Brien","Sean Brenan","Richard D Rainbow"],"meta":["January 2020Communications Biology 3(1)","DOI:10.1038/s42003-019-0729-3"],"references":["331991900_Enhanced_activity_of_multiple_TRIC-B_channels_an_ERSR_mechanism_to_boost_counterion_currents","329098866_Emerging_Roles_of_the_Membrane_Potential_Action_Beyond_the_Action_Potential","322010376_Automatic_Detection_and_Distinction_of_Retinal_Vessel_Bifurcations_and_Crossings_in_Colour_Fundus_Photography","352631988_CVS_role_of_TRPV_from_single_channels_to_HRV_assessment_with_Artificial_Intelligence","325984075_Deep_Recurrent_Neural_Networks_for_Prostate_Cancer_Detection_Analysis_of_Temporal_Enhanced_Ultrasound","324078261_QuipuNet_Convolutional_Neural_Network_for_Single-Molecule_Nanopore_Sensing","322863150_Multiscale_sequential_convolutional_neural_networks_for_simultaneous_detection_of_fovea_and_optic_disc","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770249_Deep_Visual-Semantic_Alignments_for_Generating_Image_Descriptions","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}