{"id":"338407076_Project_Based_Learning_to_Enhance_Environmental_Education_through_Automobile_Mechanics","abstract":"Purpose The purpose of the chosen project was to apply the principles of Problem-based Learning (PBL) to plans for curriculum renewal reliant on project-based learning events within the Cuban Vocational Training sector. Methods Examinations of the baseline and diagnostic assessments, lesson observations and the teaching experience of the authors revealed different perceived limitations in the initial education of Cuban skilled workers and technicians. There was a need to develop a novel approach to projects undertaken by students. Results Six implementation phases involved students identifying problems; analyzing human and other resources needed; proposing actions involving theoretical and practical action plans; execution of plans; presentation of results. Project evaluation was proposed: A variety of assessment methods were used such as self-assessment, peer assessment and group assessment where not only the results are assessed but also the whole process and development of skills, values and attitudes. Conclusion This curriculum renewal process reliant on PBL philosophy showcased an example of Work-integrated learning and provided insight on what can be done in terms of contributing to sustainable development at a school and community level. It involved engagement of teachers with some key elements of PBL pedagogy as an example of Automobile Mechanics Project based on the Cuban educational context. This approach ensured students acquired not only subject content knowledge but also skills and attitudes to meet complex demands in their chosen field.","authors":["Noelio Vazquez Vargas","José Luis Abeleira Ortiz","Nancy Pérez Pueyo","Angel Roberto Leyva Rodríguez"],"meta":["October 2019Journal of Problem-Based Learning 6(2):76-84","DOI:10.24313/jpbl.2019.00192","Project: La formación de los profesionales de la educación en las ciencias exactas y naturales"],"references":["263658302_The_effect_of_environmental_science_projects_on_students'_environmental_knowledge_and_science_attitudes","243768523_The_project_method_Its_vocational_education_origin_and_international_development","266092091_AIR_QUALITY_COMPARATION_IN_OUTDOOR_AND_INDOOR_ENVIRONMENT_IN_HUMID_TROPIC_CUBA","240539137_Project-Based_Learning_for_the_21st_Century_Skills_for_the_Future"]}