{"id":"338424699_Grid_based_clustering_for_satisfiability_solving","abstract":"The originality of this work resides into the exploitation of data mining techniques for problem solving. Two major phases define this work. The first one is to determine the clustering technique that best suits each SAT instance based on the distribution of the later. The clustering technique is then applied to reduce the complexity of each instance by creating sub-instances that can be solved independently in the second phase. The latter consists into a resolution step where the DPLL or BSO algorithms are executed depending on the number of variables to be assigned in each cluster. This two-phase resolution strategy provides more efficient problem solving. The Boolean Satisfiability problem (SAT) is considered in this study because of its importance for the Artificial Intelligence (AI) community and the impact of its solving on other complex problems. Three different distributions of the problem were observed. The first distribution defines a space where the variables are dispersed forming regions of considerable density interspersed with regions of lower density or empty regions. On the other hand, the other two distributions do not show any significant shape, as the variables are randomly scattered, with one of these two dispersions having the particularity that almost all its variables are of high occurrence. To each of the three distributions, a clustering technique is associated. Density-based clustering techniques are the most appropriate type of clustering for the first distribution. Meanwhile, grid-based clustering and frequent patterns mining seem to be the most suitable clustering techniques for the second and third distributions. Investigations are undertaken on these latter issues and contributions are presented in this paper. Experiments were conducted on public benchmarks and the results showed the importance of the pre-processing step of data mining to solve the SAT problem.","authors":["Hireche Celia","Habiba Drias","Hadjer Moulai"],"meta":["January 2020Applied Soft Computing","DOI:10.1016/j.asoc.2020.106069"],"references":["288654157_Swarm_Intelligence_with_Clustering_for_Solving_SAT","267370075_A_New_Method_for_Solving_Hard_Satisfiability_Problems","261166683_Datamining_techniques_and_swarm_intelligence_for_problem_solving_Application_to_SAT","220814431_SATenstein_Automatically_Building_Local_Search_SAT_Solvers_from_Components","220163323_ManySAT_a_parallel_SAT_solver","2617582_Symbolic_Model_Checking_without_BDDs","2334693_Efficient_and_Effective_Clustering_Methods_for_Spatial_Data_Mining","331338298_Multidimensional_appropriate_clustering_and_DBSCAN_for_SAT_solving","331226080_A_GRASP_algorithm_for_solving_large-scale_single_row_facility_layout_problems","327348742_Effective_Data_Clustering_Algorithms_Proceedings_of_SoCTA_2017","326676359_Frequent_Patterns_Mining_for_the_Satisfiability_Problem","323993908_Density_Based_Clustering_for_Satisfiability_Solving","316517565_Local_search_strategies_for_satisfiability_testing","301551088_Meta-Apriori_A_New_Algorithm_for_Frequent_Pattern_Detection","223059919_ST-DBSCAN_An_algorithm_for_clustering_spatial-temporal_data","221653977_A_Density-Based_Algorithm_for_Discovering_Clusters_in_Large_Spatial_Databases_with_Noise","221591101_The_Complexity_of_Theorem-Proving_Procedures","221582547_Cooperative_Bees_Swarm_for_Solving_the_Maximum_Weighted_Satisfiability_Problem","220682848_Least_Squares_Quantization_in_PCM's","220642599_Solving_Propositional_Satisfiability_Problems","213887971_A_Machine_Program_for_Theorem_Proving","3904486_Chaff_Engineering_an_efficient_SAT_solver","2460430_Fast_Algorithms_for_Mining_Association_Rules"]}