{"id":"338465695_Critical_Nodes_Identification_in_Complex_Networks","abstract":"Critical nodes identification in complex networks is significance for studying the survivability and robustness of networks. The previous studies on structural hole theory uncovered that structural holes are gaps between a group of indirectly connected nodes and intermediaries that fill the holes and serve as brokers for information exchange. In this paper, we leverage the property of structural hole to design a heuristic algorithm based on local information of the network topology to identify node importance in undirected and unweighted network, whose adjacency matrix is symmetric. In the algorithm, a node with a larger degree and greater number of structural holes associated with it, achieves a higher importance ranking. Six real networks are used as test data. The experimental results show that the proposed method not only has low computational complexity, but also outperforms degree centrality, k-shell method, mapping entropy centrality, the collective influence algorithm, DDN algorithm that based on node degree and their neighbors, and random ranking method in identifying node importance for network connectivity in complex networks.","authors":["Haihua Yang","Shi An"],"meta":["January 2020Symmetry 12(1):123","DOI:10.3390/sym12010123"],"references":["324431785_Structural_Holes_The_Social_Structure_of_Competition","313812702_Robustness_analysis_metrics_for_worldwide_airport_network_A_comprehensive_study","301345304_Pajek-program_for_large_Network_analysis","329590172_Sustainable_Smart_Cities_Through_the_Lens_of_Complex_Interdependent_Infrastructures_Panorama_and_State-of-the-art","316664452_Node_importance_measurement_based_on_neighborhood_similarity_in_complex_network","304744011_Vital_nodes_identification_in_complex_networks","304530788_Vulnerability_of_complex_networks_under_three-level-tree_attacks","297466636_A_new_measure_method_of_network_node_importance_based_on_local_characteristics","294110621_Using_mapping_entropy_to_identify_node_centrality_in_complex_networks","293194449_Identifying_Influence_of_Nodes_in_Complex_Networks_with_Coreness_Centrality_Decreasing_the_Impact_of_Densely_Local_Connection"]}