{"id":"338528149_Data_Analysis_Types_Process_Methods_Techniques_and_Tools","abstract":"The process of evaluating data using analytical and logical reasoning to examine each component of the data provided. This form of analysis is just one of the many steps that must be completed when conducting a research experiment. Data from various sources is gathered, reviewed, and then analyzed to form some sort of finding or conclusion. There are a variety of specific data analysis method, some of which include data mining, text analytics, business intelligence, and data visualizations. Data analysis is defined as a process of cleaning, transforming, and modeling data to discover useful information for business decision-making. The purpose of Data Analysis is to extract useful information from data and taking the decision based upon the data analysis. whenever we take any decision in our day-today life is by thinking about what happened last time or what will happen by choosing that particular decision. This is nothing but analyzing our past or future and making decisions based on it. For that, we gather memories of our past or dreams of our future. So that is nothing but data analysis. Now same thing analyst does for business purposes, is called Data Analysis. This research article based on data analysis, it's types, process, methods, techniques & tools.","authors":["Mohaiminul Islam"],"meta":["January 2020","DOI:10.11648/j.ijdst.20200601.12"],"references":["220941464_A_Map-Reduce_System_with_an_Alternate_API_for_Multi-core_Environments","273506949_Integration_of_Big_Data_and_Cloud_Computing","266322624_Big_Data_with_Cloud_Computing_An_insight_on_the_computing_environment_MapReduce_and_programming_frameworks","261355146_A_review_on_hadoop_-_HDFS_infrastructure_extensions","261165852_Business_model_canvas_perspective_on_big_data_applications","251879903_The_Craft_of_Information_Visualization_Readings_and_Reflections","225601829_Process_and_Pitfalls_in_Writing_Information_Visualization_Research_Papers","220988185_Relational_Cloud_A_Database-as-a-Service_for_the_Cloud","220439168_Bigtable_A_Distributed_Storage_System_for_Structured_Data","7789712_Lucic_V_Forster_F_Baumeister_W_Structural_studies_by_electron_tomography_from_cells_to_molecules_Annu_Rev_Biochem_74_833-865"]}