{"id":"338526410_A_Comprehensive_Study_of_Deep_Learning_for_Side-Channel_Analysis","abstract":"Recently, several studies have been published on the application of deep learning to enhance Side-Channel Attacks (SCA). These seminal works have practically validated the soundness of the approach, especially against implementations protected by masking or by jittering. Concurrently, important open issues have emerged. Among them, the relevance of machine (and thereby deep) learning based SCA has been questioned in several papers based on the lack of relation between the accuracy, a typical performance metric used in machine learning, and common SCA metrics like the Guessing entropy or the key-discrimination success rate. Also, the impact of the classical side-channel counter-measures on the efficiency of deep learning has been questioned, in particular by the semi-conductor industry. Both questions enlighten the importance of studying the theoretical soundness of deep learning in the context of side-channel and of developing means to quantify its efficiency, especially with respect to the optimality bounds published so far in the literature for side-channel leakage exploitation. The first main contribution of this paper directly concerns the latter point. It is indeed proved that minimizing the Negative Log Likelihood (NLL for short) loss function during the training of deep neural networks is actually asymptotically equivalent to maximizing the Perceived Information introduced by Renauld et al. at EUROCRYPT 2011 as a lower bound of the Mutual Information between the leakage and the target secret. Hence, such a training can be considered as an efficient and effective estimation of the PI, and thereby of the MI (known to be complex to accurately estimate in the context of secure implementations). As a second direct consequence of our main contribution, it is argued that, in a side-channel exploitation context, choosing the NLL loss function to drive the training is sound from an information theory point of view. As a third contribution, classical counter-measures like Boolean masking or execution flow shuffling, initially dedicated to classical SCA, are proved to stay sound against deep Learning based attacks.","authors":["Loïc Masure","Cécile Dumas","Emmanuel Prouff"],"meta":["November 2019","DOI:10.13154/tches.v2020.i1.348-375"],"references":["346704161_Methodology_for_Efficient_CNN_Architectures_in_Profiling_Attacks","337702208_Deep_learning_for_side-channel_analysis_and_introduction_to_ASCAD_database","329265439_The_Curse_of_Class_Imbalance_and_Conflicting_Metrics_with_Machine_Learning_for_Side-channel_Evaluations","353132763_DL-LA_Deep_Learning_Leakage_Assessment_A_modern_roadmap_for_SCA_evaluations","346703656_Non-Profiled_Deep_Learning-based_Side-Channel_attacks_with_Sensitivity_Analysis","337654478_Spiking_Neural_Networks_and_Sparse_Deep_Learning","328522578_Stochastic_Gradient_Descent_Performs_Variational_Inference_Converges_to_Limit_Cycles_for_Deep_Networks","323276538_An_Alternative_View_When_Does_SGD_Escape_Local_Minima","322465158_Making_Masking_Security_Proofs_Concrete_Or_How_to_Evaluate_the_Security_of_Any_Leaking_Device_Extended_Version","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}