{"id":"338585043_Mining_Students_Comments_about_Teacher_Performance_Assessment_using_Machine_Learning_Algorithms","abstract":"The exponential expansion of sentiment analysis is mainly due to the interest of companies to obtainment users' views about products and services. Likewise, sentiment analysis has been widely and successfully used in publicity and selling strategies as well as behaviour patterns and user preferences identification. In the same way, has been applied to educational areas to increase the learning, and e-learning quality through the mining analysis data on teaching performance assessment or student's comments. This work describes the development and evaluating the process of a Model called \"SocialMining\", which is focused on higher education with the purpose of improve teaching techniques of teachers and recommend courses for teacher improvement, through teacher performance evaluation made by students comments. The SocialMining model analyze students' comments by means representative machine learning algorithms such as: Support Vector Machines and Random Forest. We applied metrics as evaluation measure to measuring the performance of algorithms. Finally, we have implemented this model in Universidad Politécnica de Aguascalientes (Mexico) and the results obtained show that it is feasible to perform sentiment analysis to classify comments of Teacher Performance Assessment using Machine Learning with high accuracy (85%).","authors":["Guadalupe Gutiérrez Esparza","Juana Canul-Reich","Alberto Ochoa Zezzatti","Lourdes Margain"],"meta":["September 2018"],"references":["304552392_Proposal_of_a_Sentiment_Analysis_Model_in_Tweets_for_Improvement_of_the_Teaching_-Learning_Process_in_the_Classroom_Using_a_Corpus_of_Subjectivity","284219299_A_Random_Forest_Guided_Tour","272647298_El_microblogging_en_el_proceso_de_ensenanza-aprendizaje_Una_experiencia_academica_con_Twitter","305622270_Sentiment_Analysis_and_Opinion_Mining","303481433_The_multilayer_sentiment_analysis_model_based_on_Random_forest","291293129_Natural_Language_Processing_Tools","288906520_Random_forests","285581082_THE_POSSIBILITY_OF_STUDENTS'_COMMENTS_AUTOMATIC_INTERPRET_USING_LEXICON_BASED_SENTIMENT_ANALYSIS_TO_TEACHER_EVALUATION","279613318_SAFE_A_Sentiment_Analysis_Framework_for_E-Learning","273278164_IDENTIFYING_E-LEARNER'S_OPINION_USING_AUTOMATED_SENTIMENT_ANALYSIS_IN_E-LEARNING"]}