{"id":"338546784_FingerDraw_Sub-wavelength_Level_Finger_Motion_Tracking_with_WiFi_Signals","abstract":"This paper explores the possibility of tracking finger drawings in the air leveraging WiFi signals from commodity devices. Prior solutions typically require user to hold a wireless transmitter, or need proprietary wireless hardware. They can only recognize a small set of pre-defined hand gestures. This paper introduces FingerDraw, the first sub-wavelength level finger motion tracking system using commodity WiFi devices, without attaching any sensor to finger. FingerDraw can reconstruct finger drawing trajectory such as digits, alphabets, and symbols with the setting of one WiFi transmitter and two WiFi receivers. It uses a two-antenna receiver to sense the sub-wavelength scale displacement of finger motion in each direction. The theoretical underpinning of FingerDraw is our proposed CSI-quotient model, which uses the channel quotient between two antennas of the receiver to cancel out the noise in CSI amplitude and the random offsets in CSI phase, and quantifies the correlation between CSI value dynamics and object displacement. This channel quotient is sensitive to and enables us to detect small changes in In-phase and Quadrature parts of channel state information due to finger movement. Our experimental results show that the overall median tracking accuracy is 1.27 cm, and the recognition of drawing ten digits in the air achieves an average accuracy of over 93.0%.","authors":["Dan Wu","Ruiyang Gao","Youwei Zeng","Jinyi Liu"],"meta":["March 2020Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies 4(1)","DOI:10.1145/3380981","Project: Contactless Human Sensing with WiFi CSI"],"references":["327758396_FullBreathe_Full_Human_Respiration_Detection_Exploiting_Complementarity_of_CSI_Phase_and_Amplitude_of_WiFi_Signals","326238521_Multi-User_Gesture_Recognition_Using_WiFi","324049773_From_Fresnel_Diffraction_Model_to_Fine-grained_Human_Respiration_Sensing_with_Commodity_Wi-Fi_Devices","333834065_Zero-Effort_Cross-Domain_Gesture_Recognition_with_Wi-Fi","328682295_A_Training-Free_Contactless_Human_Vitality_Monitoring_Platform_Using_Commodity_Wi-Fi_Devices","328375756_Multi_-_Touch_in_the_Air_Device-Free_Finger_Tracking_and_Gesture_Recognition_via_COTS_RFID","328331042_VSkin_Sensing_Touch_Gestures_on_Surfaces_of_Mobile_Devices_Using_Acoustic_Signals","327762663_Training-Free_Human_Vitality_Monitoring_Using_Commodity_Wi-Fi_Devices","327760729_Augmenting_User_Identification_with_WiFi_Based_Gesture_Recognition","327758471_FreeSense_A_Robust_Approach_for_Indoor_Human_Detection_Using_Wi-Fi_Signals"]}