{"id":"338507141_Optimizing_High-Efficiency_Quantum_Memory_with_Quantum_Machine_Learning_for_Near-Term_Quantum_Devices","abstract":"Quantum memories are a fundamental of any global-scale quantum Internet, high-performance quantum networking and near-term quantum computers. A main problem of quantum memories is the low retrieval efficiency of the quantum systems from the quantum registers of the quantum memory. Here, we define a novel quantum memory called high-retrieval-efficiency (HRE) quantum memory for near-term quantum devices. An HRE quantum memory unit integrates local unitary operations on its hardware level for the optimization of the readout procedure and utilizes the advanced techniques of quantum machine learning. We define the integrated unitary operations of an HRE quantum memory, prove the learning procedure, and evaluate the achievable output signal-to-noise ratio values. We prove that the local unitaries of an HRE quantum memory achieve the optimization of the readout procedure in an unsupervised manner without the use of any labeled data or training sequences. We show that the readout procedure of an HRE quantum memory is realized in a completely blind manner without any information about the input quantum system or about the unknown quantum operation of the quantum register. We evaluate the retrieval efficiency of an HRE quantum memory and the output SNR (signal-to-noise ratio). The results are particularly convenient for gate-model quantum computers and the near-term quantum devices of the quantum Internet.","authors":["Laszlo Gyongyosi","Sandor Imre"],"meta":["January 2020Scientific Reports 10(1):135","DOI:10.1038/s41598-019-56689-0"],"references":["347427245_A_Survey_on_Quantum_Key_Distribution","337454545_Quantum_Internet_Networking_Challenges_in_Distributed_Quantum_Computing","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336341938_Towards_Large-Scale_Quantum_Networks","336113153_Practical_figures_of_merit_and_thresholds_for_entanglement_distribution_in_quantum_networks","335580302_Training_Optimization_for_Gate-Model_Quantum_Neural_Networks","334772416_State_stabilization_for_gate-model_quantum_computers","333493594_Quantum_circuit_design_for_objective_function_maximization_in_gate-model_quantum_computers","333167029_End-to-end_capacities_of_a_quantum_communication_network","337784291_Ground-to-satellite_quantum_teleportation"]}