{"id":"338556956_Sentiment_and_position-taking_analysis_of_parliamentary_debates_a_systematic_literature_review","abstract":"Parliamentary and legislative debate transcripts provide access to information concerning the opinions, positions, and policy preferences of elected politicians. They attract attention from researchers from a wide variety of backgrounds, from political and social sciences to computer science. As a result, the problem of computational sentiment and position-taking analysis has been tackled from different perspectives, using varying approaches and methods, and with relatively little collaboration or cross-pollination of ideas. The existing research is scattered across publications from various fields and venues. In this article, we present the results of a systematic literature review of 61 studies, all of which address the automatic analysis of the sentiment and opinions expressed, and the positions taken by speakers in parliamentary (and other legislative) debates. In this review, we discuss the existing research with regard to the aims and objectives of the researchers who work in this area, the automatic analysis tasks which they undertake, and the approaches and methods which they use. We conclude by summarizing their findings, discussing the challenges of applying computational analysis to parliamentary debates, and suggesting possible avenues for further research.","authors":["Gavin Abercrombie","Riza Batista-Navarro"],"meta":["April 2020Journal of Computational Social Science 3(2)","DOI:10.1007/s42001-019-00060-w","Project: Topic-centric sentiment analysis of UK parliamentary debates"],"references":["328761455_Identifying_Opinion-Topics_and_Polarity_of_Parliamentary_Debate_Motions","327262325_'Aye'_or_'No'_Speech-level_Sentiment_Analysis_of_Hansard_UK_Parliamentary_Debate_Transcripts","326236641_Validating_a_sentiment_dictionary_for_German_political_language-a_workbench_note","326202525_A_Deep_Modular_RNN_Approach_for_Ethos_Mining","325605289_Application_of_Text_Analytics_to_Analyze_Emotions_in_the_Speeches","335779094_Computational_Analysis_of_Political_Texts_Bridging_Research_Efforts_Across_Communities","334117140_Topic-Specific_Sentiment_Analysis_Can_Help_Identify_Political_Ideology","329037648_Political_rhetoric_through_the_lens_of_non-parametric_statistics_are_our_legislators_that_different","328022898_Multilingual_Sentiment_Analysis_A_New_Approach_to_Measuring_Conflict_in_Legislative_Speeches","325738992_Detecting_Agreement_and_Disagreement_in_Political_Debates"]}