{"id":"338564411_A_Deep_Learning_Framework_for_Assessing_Physical_Rehabilitation_Exercises","abstract":"Computer-aided assessment of physical rehabilitation entails evaluation of patient performance in completing prescribed rehabilitation exercises, based on processing movement data captured with a sensory system. Despite the essential role of rehabilitation assessment toward improved patient outcomes and reduced healthcare costs, existing approaches lack versatility, robustness, and practical relevance. In this paper, we propose a deep learning-based framework for automated assessment of the quality of physical rehabilitation exercises. The main components of the framework are metrics for quantifying movement performance, scoring functions for mapping the performance metrics into numerical scores of movement quality, and deep neural network models for generating quality scores of input movements via supervised learning. The proposed performance metric is defined based on the log-likelihood of a Gaussian mixture model, and encodes low-dimensional data representation obtained with a deep autoencoder network. The proposed deep spatio-temporal neural network arranges data into temporal pyramids, and exploits the spatial characteristics of human movements by using sub-networks to process joint displacements of individual body parts. The presented framework is validated using a dataset of ten rehabilitation exercises. The significance of this work is that it is the first that implements deep neural networks for assessment of rehabilitation performance.","authors":["Yalin Liao","Aleksandar Vakanski","Min Xian"],"meta":["January 2020IEEE transactions on neural systems and rehabilitation engineering: a publication of the IEEE Engineering in Medicine and Biology Society PP(99):1-1","DOI:10.1109/TNSRE.2020.2966249","Project: Modeling and Evaluation of Physical Therapy Movements using Machine Learning"],"references":["322414335_A_Data_Set_of_Human_Body_Movements_for_Physical_Rehabilitation_Exercises","322004918_A_Hidden_Semi-Markov_Model_based_Approach_for_Rehabilitation_Exercise_Assessment","320968444_Deep_Representation_Learning_for_Human_Motion_Prediction_and_Classification","333791841_The_KIMORE_Dataset_KInematic_Assessment_of_MOvement_and_Clinical_Scores_for_Remote_Monitoring_of_Physical_REhabilitation","333363104_Dynamic_Temporal_Pyramid_Network_A_Closer_Look_at_Multi-scale_Modeling_for_Activity_Detection","332613300_Computational_model_for_the_recognition_of_lower_limb_movement_using_wearable_gyroscope_sensor","326202338_Co-occurrence_Feature_Learning_from_Skeleton_Data_for_Action_Recognition_and_Detection_with_Hierarchical_Aggregation","324958937_CORDIC_Framework_for_Quaternion-based_Joint_Angle_Computation_to_Classify_Arm_Movements","324629469_Mixture_Models_Inference_and_Applications_to_Clustering","322059593_Temporal_Action_Detection_with_Structured_Segment_Networks"]}