{"id":"338587812_Inhibitory_Network_Bistability_Explains_Increased_Interneuronal_Activity_Prior_to_Seizure_Onset","abstract":"Recent experimental literature has revealed that GABAergic interneurons exhibit increased activity prior to seizure onset, alongside additional evidence that such activity is synchronous and may arise abruptly. These findings have led some to hypothesize that this interneuronal activity may serve a causal role in driving the sudden change in brain activity that heralds seizure onset. However, the mechanisms predisposing an inhibitory network toward increased activity, specifically prior to ictogenesis, without a permanent change to inputs to the system remain unknown. We address this question by comparing simulated inhibitory networks containing control interneurons and networks containing hyperexcitable interneurons modeled to mimic treatment with 4-Aminopyridine (4-AP), an agent commonly used to model seizures in vivo and in vitro. Our in silico study demonstrates that model inhibitory networks with 4-AP interneurons are more prone than their control counterparts to exist in a bistable state in which asynchronously firing networks can abruptly transition into synchrony driven by a brief perturbation. This transition into synchrony brings about a corresponding increase in overall firing rate. We further show that perturbations driving this transition could arise in vivo from background excitatory synaptic activity in the cortex. Thus, we propose that bistability explains the increase in interneuron activity observed experimentally prior to seizure via a transition from incoherent to coherent dynamics. Moreover, bistability explains why inhibitory networks containing hyperexcitable interneurons are more vulnerable to this change in dynamics, and how such networks can undergo a transition without a permanent change in the drive. We note that while our comparisons are between networks of control and ictogenic neurons, the conclusions drawn specifically relate to the unusual dynamics that arise prior to seizure, and not seizure onset itself. However, providing a mechanistic explanation for this phenomenon specifically in a pro-ictogenic setting generates experimentally testable hypotheses regarding the role of inhibitory neurons in pre-ictal neural dynamics, and motivates further computational research into mechanisms underlying a newly hypothesized multi-step pathway to seizure initiated by inhibition.","authors":["Scott Rich","Homeira Moradi Chameh","Marjan Rafiee","Katie Ferguson"],"meta":["January 2020Frontiers in Neural Circuits 13","DOI:10.3389/fncir.2019.00081"],"references":["341030574_Epilepsies_as_Dynamical_Diseases_of_Brain_Systems_Basic_Models_of_the_Transition_Between_Normal_and_Epileptic_Activity","331798434_Mathematical_model_of_Na-K-Cl_homeostasis_in_ictal_and_interictal_discharges","329192440_Loss_of_neuronal_network_resilience_precedes_seizures_and_determines_the_ictogenic_nature_of_interictal_synaptic_perturbations","328707718_Altered_hippocampal_interneuron_activity_precedes_ictal_onset","322254122_Effects_of_Neuromodulation_on_Excitatory-Inhibitory_Neural_Network_Dynamics_Depend_on_Network_Connectivity_Structure","331140483_Self-propagating_non-synaptic_epileptiform_activity_propagates_by_endogenous_electric_fields","330915403_Phase_Response_Theory_Explains_Cluster_Formation_in_Sparsely_but_Strongly_Connected_Inhibitory_Neural_Networks_and_Effects_of_Jitter_due_to_Sparse_Connectivity","330526601_Generation_and_On-Demand_Initiation_of_Acute_Ictal_Activity_in_Rodent_and_Human_Tissue","327429115_Low-Voltage_Fast_Seizures_in_Humans_Begin_With_Increased_Interneuron_Firing","325154409_Role_of_inhibitory_control_in_modulating_focal_seizure_spread"]}