{"id":"338597419_TriPCE_A_Novel_Tri-Clustering_Algorithm_for_Identifying_Pan-Cancer_Epigenetic_Patterns","abstract":"Epigenetic alteration is a fundamental characteristic of nearly all human cancers. Tumor cells not only harbor genetic alterations, but also are regulated by diverse epigenetic modifications. Identification of epigenetic similarities across different cancer types is beneficial for the discovery of treatments that can be extended to different cancers. Nowadays, abundant epigenetic modification profiles have provided a great opportunity to achieve this goal. Here, we proposed a new approach TriPCE, introducing tri-clustering strategy to integrative pan-cancer epigenomic analysis. The method is able to identify coherent patterns of various epigenetic modifications across different cancer types. To validate its capability, we applied the proposed TriPCE to analyze six important epigenetic marks among seven cancer types, and identified significant cross-cancer epigenetic similarities. These results suggest that specific epigenetic patterns indeed exist among these investigated cancers. Furthermore, the gene functional analysis performed on the associated gene sets demonstrates strong relevance with cancer development and reveals consistent risk tendency among these investigated cancer types.","authors":["Yanglan Gan","Ning Li","Yongchang Xin","Guobing Zou"],"meta":["January 2020Frontiers in Genetics 10:1298","DOI:10.3389/fgene.2019.01298"],"references":["313599779_iHMS_A_database_integrating_human_histone_modification_data_across_developmental_stages_and_tissues","326203589_Tri-Clustering_Analysis_for_Dissecting_Epigenetic_Patterns_Across_Multiple_Cancer_Types","324243198_Comprehensive_Characterization_of_Cancer_Driver_Genes_and_Mutations","318578491_Epigenetic_plasticity_and_the_hallmarks_of_cancer","316118664_The_promise_of_epigenetic_therapy_reprogramming_the_cancer_epigenome","315324150_The_cancer_epigenome_Concepts_challenges_and_therapeutic_opportunities","313189498_Integrative_analysis_of_111_reference_human_epigenomes","312449512_Mining_Frequent_Patterns_without_Candidate_Generation","308173063_Targeting_the_cancer_epigenome_for_therapy","306158025_DNA_methylome_analysisin_Burkitt_and_follicular_lymphomas_identifies_differentially_methylated_regions_linked_to_somatic_mutation_and_tran-scriptional_control"]}