{"id":"338524659_A_Coarse-to-Fine_Network_for_Ship_Detection_in_Optical_Remote_Sensing_Images","abstract":"With the increasing resolution of optical remote sensing images, ship detection in optical remote sensing images has attracted a lot of research interests. The current ship detection methods usually adopt the coarse-to-fine detection strategy, which firstly extracts low-level and manual features, and then performs multi-step training. Inadequacies of this strategy are that it would produce complex calculation, false detection on land and difficulty in detecting the small size ship. Aiming at these problems, a sea-land separation algorithm that combines gradient information and gray information is applied to avoid false alarms on land, the feature pyramid network (FPN) is used to achieve small ship detection, and a multi-scale detection strategy is proposed to achieve ship detection with different degrees of refinement. Then the feature extraction structure is adopted to fuse different hierarchical features to improve the representation ability of features. Finally, we propose a new coarse-to-fine ship detection network (CF-SDN) that directly achieves an end-to-end mapping from image pixels to bounding boxes with confidences. A coarse-to-fine detection strategy is applied to improve the classification ability of the network. Experimental results on optical remote sensing image set indicate that the proposed method outperforms the other excellent detection algorithms and achieves good detection performance on images including some small-sized ships and dense ships near the port.","authors":["Yue Wu","Wenping Ma","Maoguo Gong","Zhuangfei Bai"],"meta":["January 2020Remote Sensing 12(2):246","DOI:10.3390/rs12020246"],"references":["334106407_Ship_Detection_from_Optical_Remote_Sensing_Images_Using_Multi-Scale_Analysis_and_Fourier_HOG_Descriptor","331836580_R-CNN-Based_Ship_Detection_from_High_Resolution_Remote_Sensing_Imagery","328112553_Superpixel_Segmentation_of_Polarimetric_Synthetic_Aperture_Radar_SAR_Images_Based_on_Generalized_Mean_Shift","325268539_Small_Object_Detection_in_Optical_Remote_Sensing_Images_via_Modified_Faster_R-CNN","335719491_Nearshore_Ship_Detection_on_High-Resolution_Remote_Sensing_Image_via_Scene-Mask_R-CNN","331578924_Remote_Sensing_Image_Registration_Based_on_Modified_SIFT_and_Feature_Slope_Grouping","331416795_Ship_Detection_from_Optical_Remote_Sensing_Image_based_on_Size-Adapted_CNN","328983368_Object_Detection_in_Satellite_Imagery_Using_2-Step_Convolutional_Neural_Networks","328257181_Inshore_Ship_Detection_Based_on_Convolutional_Neural_Network_in_Optical_Satellite_Images","327213269_Learning_Rotation-Invariant_and_Fisher_Discriminative_Convolutional_Neural_Networks_for_Object_Detection"]}