{"id":"338541294_Identification_of_the_Propeller_Coefficients_and_Dynamic_Parameters_of_a_Hovering_Quadrotor_From_Flight_Data","abstract":"Several methods can be applied to estimate the propeller thrust and torque coefficients and dynamics parameters of quadrotor UAVs. These parameters are necessary for many controllers that have been proposed for these vehicles. However, these methods require the use of specific test benches, which do not well simulate real flight conditions.\n\nIn this paper, a new method is introduced which allows the identification of the propeller coefficients and dynamic param- eters of a quadrotor in a single procedure. It is based on a Total-Least-Square identification technique, does not require any specific test bench and needs only a measurement of the mass of the quadrotor and a recording of data from a flight that can be performed manually by an operator.\n\nBecause the symmetries of classic quadrotors limit the per- formance of the algorithm, an extension of the procedure is proposed. Two types of flights are then used: one with the initial quadrotor and a second flight with an additional payload on the vehicle that modifies the mass distribution. This new procedure, which is validated experimentally, increases the performance of the identification and allows an estimation of all the relevant dynamic parameters of the quadrotor near hovering conditions.","authors":["Six Damien","Sébastien Briot","Julian Czapalay Erskine","Abdelhamid Chriette"],"meta":["January 2020IEEE Robotics and Automation Letters PP(99)","DOI:10.1109/LRA.2020.2966393"],"references":["334490052_Aerodynamic_Model_Identification_of_a_Quadrotor_Subjected_to_Rotor_Failures_in_the_High-Speed_Flight_Regime","329204231_Quadrotor_Gray-Box_Model_Identification_from_High-Speed_Flight_Data","325912384_The_role_of_propeller_aerodynamics_in_the_model_of_a_quadrotor_UAV","269299860_Wind_tunnel_testing_of_a_VTOL_MAV_propeller_in_tilted_operating_mode","268557575_Nonlinear_Position_Control_Approaches_for_Quadcopters_Using_a_Novel_State_Representation","324588482_A_dynamic_model_parameter_identification_method_for_quadrotors_using_flight_data","305720540_Model_Identification","280601129_Modeling_and_Simulation_of_a_Quadrotor_using_Curve_Fitting_Method","278655043_Influence_of_Aerodynamics_and_Proximity_Effects_in_Quadrotor_Flight","271526734_Modelling_and_Identification_in_Robotics"]}