{"id":"338520281_Towards_a_motivational_design_Connecting_gamification_user_types_and_online_learning_activities","abstract":"Abstract Motivation is a crucial factor for students’ learning behavior and plays a key role in the concept of gamification to foster students’ motivation through specific gamification mechanics and elements. User types for gamification and associated gamification mechanics can classify students’ interests and learning preferences and provide explanations for their motivational learning behavior. This study investigated how five gamification user types may relate to six mainly used online learning activities in a distance online bachelor’s and master’s class in educational science through the use of a systematic approach. A total of 86 students participated in the questionnaire in a cross-sectional study. The findings showed average agreement shares for all five gamification user types. The correlations revealed that the six online learning activities were at least significantly connected to one of the five gamification user types, and both person-centered and environment-centered perspectives were displayed. Finally, the results were discussed, and implications were derived for a motivational design.","authors":["Klaudia Bovermann","Theo J. Bastiaens"],"meta":["December 2020Research and Practice in Technology Enhanced Learning 15(1)","DOI:10.1186/s41039-019-0121-4"],"references":["344067593_Gamification_User_Types_zur_Unterstutzung_der_Konzeption_in_der_Softwareentwicklung","340862912_Impact_of_integrating_OER_in_teacher_education_at_the_Open_University_of_Sri_Lanka","335189630_The_Gamification_of_Learning_a_Meta-analysis","331887842_Motivation_in_distance_education","328248882_Dropout_in_Distance_Education_and_how_to_Prevent_it","326827455_The_rise_of_the_motivational_information_systems_A_review_of_gamification_research","333416369_Gamification_Design_Framework_Based_on_Self_Determination_Theory_for_Adult_Motivation","329248282_Gamification_for_Education_Review_of_Current_Publications_Smart_Pedagogy_for_Technology_Enhanced_Learning","327785590_Does_educational_gamification_improve_students'_motivation_If_so_which_game_elements_work_best","327181917_Need-supporting_gamification_in_education_An_assessment_of_motivational_effects_over_time"]}