{"id":"338587282_Error_rates_of_human_reviewers_during_abstract_screening_in_systematic_reviews","abstract":"Background\nAutomated approaches to improve the efficiency of systematic reviews are greatly needed. When testing any of these approaches, the criterion standard of comparison (gold standard) is usually human reviewers. Yet, human reviewers make errors in inclusion and exclusion of references.\n\nObjectives\nTo determine citation false inclusion and false exclusion rates during abstract screening by pairs of independent reviewers. These rates can help in designing, testing and implementing automated approaches.\n\nMethods\nWe identified all systematic reviews conducted between 2010 and 2017 by an evidence-based practice center in the United States. Eligible reviews had to follow standard systematic review procedures with dual independent screening of abstracts and full texts, in which citation inclusion by one reviewer prompted automatic inclusion through the next level of screening. Disagreements between reviewers during full text screening were reconciled via consensus or arbitration by a third reviewer. A false inclusion or exclusion was defined as a decision made by a single reviewer that was inconsistent with the final included list of studies.\n\nResults\nWe analyzed a total of 139,467 citations that underwent 329,332 inclusion and exclusion decisions from 86 unique reviewers. The final systematic reviews included 5.48% of the potential references identified through bibliographic database search (95% confidence interval (CI): 2.38% to 8.58%). After abstract screening, the total error rate (false inclusion and false exclusion) was 10.76% (95% CI: 7.43% to 14.09%).\n\nConclusions\nThis study suggests important false inclusion and exclusion rates by human reviewers. When deciding the validity of a future automated study selection algorithm, it is important to keep in mind that the gold standard is not perfect and that achieving error rates similar to humans may be adequate and can save resources and time.","authors":["Zhen Wang","Tarek Nayfeh","Jennifer Tetzlaff","Peter O’Blenis"],"meta":["January 2020PLoS ONE 15(1):e0227742","DOI:10.1371/journal.pone.0227742"],"references":["333859301_A_question_of_trust_Can_we_build_an_evidence_base_to_gain_trust_in_systematic_review_automation_technologies","331233145_Still_moving_toward_automation_of_the_systematic_review_process_A_summary_of_discussions_at_the_third_meeting_of_the_International_Collaboration_for_Automation_of_Systematic_Reviews_ICASR","330403943_Machine_learning_algorithms_for_systematic_review_Reducing_workload_in_a_preclinical_review_of_animal_studies_and_reducing_human_screening_error","325255442_Making_progress_with_the_automation_of_systematic_reviews_Principles_of_the_International_Collaboration_for_the_Automation_of_Systematic_Reviews_ICASR","322168625_The_Use_of_Rapid_Review_Methods_for_the_US_Preventive_Services_Task_Force","321469633_Flaws_in_the_application_and_interpretation_of_statistical_analyses_in_systematic_reviews_of_therapeutic_interventions_were_common_a_cross-sectional_analysis","320685225_A_Text-Mining_Framework_for_Supporting_Systematic_Reviews","313826011_Impact_of_searching_clinical_trial_registries_in_systematic_reviews_of_pharmaceutical_treatments_methodological_systematic_review_and_reanalysis_of_meta-analyses","336791156_Dissecting_racial_bias_in_an_algorithm_used_to_manage_the_health_of_populations","309106896_1931-1971_A_critical_review_with_particular_reference_to_the_medical_profession"]}