{"id":"338659739_Design_and_Development_of_a_Low-Cost_Open-Source_Robotics_Education_Platform","abstract":"The impact of robotics has grown beyond research laboratories and industrial facilities into home environments and primary and secondary school classrooms. Of particular interest to us are robots for education. In general, educational robotics kits are expensive and proprietary, or cheap and unreliable. This research seeks to bridge that gap by providing a hands on open-source robotics learning environment that is both inexpensive and reliable. In this paper, we review the applicability of such environments to support the synergistic learning of computational thinking (CT) and STEM, with an emphasis on Computer Science (CS) concepts and practices. The CT and Advanced Placement CS Principles frameworks (from the US) govern the design and implementation of our system. We discuss the hardware system of the robot and the accompanying software architecture that runs on Linux-based single board computers. We conclude with results from a small pilot study analyzing the usability and curricular effectiveness of the system.","authors":["Tim Darrah","Nicole Hutchins","Gautam Biswas"],"meta":["June 2018","Conference: 50th International Symposium on RoboticsAt: Munich, Germany"],"references":["355793329_Improving_STEM_Education_with_an_Open-Source_Robotics_Learning_Environment","282210850_The_Effectiveness_of_Robotics_Competitions_on_Students'_Learning_of_Computer_Science","274309848_Computational_Thinking","258134754_Computational_Thinking_in_K-12_A_Review_of_the_State_of_the_Field","258123665_Integrating_computational_thinking_with_K-12_science_education_using_agent-based_computation_A_theoretical_framework","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","281382227_Robotics_camps_clubs_and_competitions_Results_from_a_US_robotics_project","276232172_Free_Open_Source_Software_in_Electronics_Engineering_Education_A_Survey","234591969_A_Brief_Introduction_to_Evidence-Centered_Design_CSE_Report_632","227033633_Interactive_Multimodal_Learning_Environments"]}