{"id":"338611468_Computacao_Desplugada_na_UDESC_Portas_Abertas","abstract":"Resumo: Este artigo apresenta o planejamento, execução e análise de uma experiência na aplicação de atividades desplugadas realizadas no dia em que a universidade abre suas Portas para estudantes do Ensino Médio vivenciarem o mundo acadêmico. O objetivo deste estudo foi estimular o Pensamento Computacional de forma colaborativa por meio de atividades desplugadas ensinando conceitos relacionados à ciência da computação de forma divertida e interativa. Como resultado verificou-se a percepção dos estudantes com relação ao interesse, associação com o pensamento computacional e a área de ciência da computação. Palavras-chave: Computação Desplugada. Pensamento Computacional. Ensino Médio. Abstract: This paper presents the planning, execution and analysis of an experience in the application of computer science unplugged activities carried out on the day that the university is opened for high school students to experience the academic world. The purpose of this study was to stimulate Computational Thinking in a collaborative way through unplugged activities concepts related to computer science in a fun and interactive way. As a result, the students' perception regarding interest, association with computational thinking and the area of computer science was verified.","authors":["Cristiani Crema","Katiane Kazuza Gneipel Krause","Isabela Gasparini","Avanilde Kemczinski"],"meta":["December 2019RENOTE 7(3)","DOI:10.22456/1679-1916.99529"],"references":["320785576_Computacao_na_Educacao_Basica_no_Brasil_o_Estado_da_Arte","281374796_Oficinas_Itinerantes_de_Scratch_e_Computacao_Desplugada_para_Professores_como_apoio_ao_Ensino_de_Computacao_-_um_Relato_de_Experiencia","264509156_Computacao_Desplugada_no_Ensino_de_Bancos_de_Dados_na_Educacao_Superior","267949399_DIARIO_-UM_CONTRIBUTO_PARA_O_DESENVOLVIMENTO_PROFISSIONAL_DOS_PROFESSORES_E_ESTUDO_DOS_SEUS_DILEMAS","242306763_Teoria_dos_Numeros_e_Criptografia","216545763_Computer_Science_Unplugged_Ensinando_Ciencia_da_Computac_cao_sem_o_uso_do_computador"]}