{"id":"338601337_Classification_of_Interstitial_Lung_Abnormality_Patterns_with_an_Ensemble_of_Deep_Convolutional_Neural_Networks","abstract":"Subtle interstitial changes in the lung parenchyma of smokers, known as Interstitial Lung Abnormalities (ILA), have been associated with clinical outcomes, including mortality, even in the absence of Interstitial Lung Disease (ILD). Although several methods have been proposed for the automatic identification of more advanced Interstitial Lung Disease (ILD) patterns, few have tackled ILA, which likely precedes the development ILD in some cases. In this context, we propose a novel methodology for automated identification and classification of ILA patterns in computed tomography (CT) images. The proposed method is an ensemble of deep convolutional neural networks (CNNs) that detect more discriminative features by incorporating two, two-and-a-half and three- dimensional architectures, thereby enabling more accurate classification. This technique is implemented by first training each individual CNN, and then combining its output responses to form the overall ensemble output. To train and test the system we used 37424 radiographic tissue samples corresponding to eight different parenchymal feature classes from 208 CT scans. The resulting ensemble performance including an average sensitivity of 91,41% and average specificity of 98,18% suggests it is potentially a viable method to identify radiographic patterns that precede the development of ILD.","authors":["David Bermejo-Peláez","Samuel Ash","George R. Washko","Raúl San José Estépar"],"meta":["January 2020Scientific Reports 10(1):338","DOI:10.1038/s41598-019-56989-5"],"references":["324963632_Pulmonary_Artery-Vein_Classification_in_CT_Images_Using_Deep_Learning","323528034_Deep_learning_for_biomarker_regression_application_to_osteoporosis_and_emphysema_on_chest_CT_scans","331720927_Weakly-supervised_deep_learning_of_interstitial_lung_disease_types_on_CT_images","327695316_Deep_learning_for_classifying_fibrotic_lung_disease_on_high-resolution_computed_tomography_a_case-cohort_study","326962477_FissureNet_A_Deep_Learning_Approach_For_Pulmonary_Fissure_Detection_in_CT_Images","325524586_Emphysema_classification_using_a_multi-view_convolutional_network","322058942_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","320461575_Comparison_of_Shallow_and_Deep_Learning_Methods_on_Classifying_the_Regional_Pattern_of_Diffuse_Lung_Disease","319636187_Disease_Staging_and_Prognosis_in_Smokers_Using_Deep_Learning_in_Chest_Computed_Tomography","316910204_Clinical_and_Genetic_Associations_of_Objectively_Identified_Interstitial_Changes_in_Smokers"]}