{"id":"338646030_The_role_of_geographic_bias_in_knowledge_diffusion_a_systematic_review_and_narrative_synthesis","abstract":"Background: \nDescriptive studies examining publication rates and citation counts demonstrate a geographic skew toward high-income countries (HIC), and research from low- or middle-income countries (LMICs) is generally underrepresented. This has been suggested to be due in part to reviewers' and editors' preference toward HIC sources; however, in the absence of controlled studies, it is impossible to assert whether there is bias or whether variations in the quality or relevance of the articles being reviewed explains the geographic divide. This study synthesizes the evidence from randomized and controlled studies that explore geographic bias in the peer review process.\n\nMethods: \nA systematic review was conducted to identify research studies that explicitly explore the role of geographic bias in the assessment of the quality of research articles. Only randomized and controlled studies were included in the review. Five databases were searched to locate relevant articles. A narrative synthesis of included articles was performed to identify common findings.\n\nResults: \nThe systematic literature search yielded 3501 titles from which 12 full texts were reviewed, and a further eight were identified through searching reference lists of the full texts. Of these articles, only three were randomized and controlled studies that examined variants of geographic bias. One study found that abstracts attributed to HIC sources elicited a higher review score regarding relevance of the research and likelihood to recommend the research to a colleague, than did abstracts attributed to LIC sources. Another study found that the predicted odds of acceptance for a submission to a computer science conference were statistically significantly higher for submissions from a \"Top University.\" Two of the studies showed the presence of geographic bias between articles from \"high\" or \"low\" prestige institutions.\n\nConclusions: \nTwo of the three included studies identified that geographic bias in some form was impacting on peer review; however, further robust, experimental evidence is needed to adequately inform practice surrounding this topic. Reviewers and researchers should nonetheless be aware of whether author and institutional characteristics are interfering in their judgement of research.","authors":["Mark Skopec","Hamdi Issa","Julie Reed","Matthew J Harris"],"meta":["January 2020Research Integrity and Peer Review 5(1)","DOI:10.1186/s41073-019-0088-0","Project: Reverse and Frugal Innovation"],"references":["323004019_Uptake_and_outcome_of_manuscripts_in_Nature_journals_by_review_model_and_author_characteristics","322842241_Inequalities_in_global_health_inequalities_research_A_50-year_bibliometric_analysis_1966-2015","321072817_Reviewer_bias_in_single-_versus_double-blind_peer_review","320931527_Explicit_Bias_Toward_High-Income-Country_Research_A_Randomized_Blinded_Crossover_Experiment_Of_English_Clinicians","320904506_Measuring_the_bias_against_low-income_country_research_An_Implicit_Association_Test","319020911_Dominance_and_leadership_in_research_activities_Collaboration_between_countries_of_differing_human_development_is_reflected_through_authorship_order_and_designation_as_corresponding_authors_in_scienti","283420404_The_New_Evidence_Pyramid","270055026_Measuring_the_effectiveness_of_scientific_gatekeeping","331229982_Peer_Review_Bias_A_Critical_Review","309043952_Cochrane_handbook_for_systematic_reviews_of_interventions_Cochrane_Collaboration"]}