{"id":"338642293_Computational_domestication_of_ignorant_entities","abstract":"Eco-cognitive computationalism considers computation in context, following some of the main tenets advanced by the recent cognitive science views on embodied, situated, and distributed cognition. It is in the framework of this eco-cognitive perspective that we can usefully analyze the recent attention in computer science devoted to the importance of the simplification of cognitive and motor tasks caused in organic entities by the morphological features: ignorant bodies can be domesticated to become useful “mimetic bodies”, that is able to render an intertwined computation simpler, resorting to that “simplexity” of animal embodied cognition, which represents one of the main quality of organic agents. Through eco-cognitive computationalism we can clearly acknowledge that the concept of computation changes, depending on historical and contextual causes, and we can build an epistemological view that illustrates the “emergence” of new kinds of computations, such as the one regarding morphological computation. This new perspective shows how the computational domestication of ignorant entities can originate new unconventional cognitive embodiments. In the last part of the article I will introduce the concept of overcomputationalism, showing that my proposed framework helps us see the related concepts of pancognitivism, paniformationalism, and pancomputationalism in a more naturalized and prudent perspective, avoiding the excess of old-fashioned ontological or metaphysical overstatements.","authors":["Lorenzo Magnani"],"meta":["August 2021Synthese 198(11)","DOI:10.1007/s11229-020-02530-5"],"references":["337394921_Pathways_to_cellular_supremacy_in_biocomputing","326448909_Where_the_smart_things_are_Social_machines_and_the_Internet_of_Things","325563832_Eco-Cognitive_Computationalism_From_Mimetic_Minds_to_Morphology-Based_Enhancement_of_Mimetic_Bodies","320359134_Computational_Dynamics_of_Natural_Information_Morphology_Discretely_Continuous","346831691_Intelligent_Machinery_1948","335218866_Against_Computational_Perspectivalism","332765197_Computationalism_in_a_Dynamic_and_Distributed_Eco-cognitive_Perspective","332089344_Great_Principles_of_Computing","319770558_The_Chemical_Basis_of_Morphogenesis","319401231_Abstraction_and_Representation_in_Living_Organisms_When_Does_a_Biological_System_Compute","315847387_Mathematization_in_Synthetic_Biology_Analogies_Templates_and_Fictions","319337924_The_Abductive_Structure_of_Scientific_Creativity","318666474_The_Natural_Science_of_Computing","316818470_Abduction_Reason_and_Science","316806054_Understanding_Violence"]}