{"id":"338685564_Models_To_Model_and_Modelling_-_Towards_a_Theory_of_Models_especially_Conceptual_Models_and_Modelling_-_Third_Collection_of_Recent_Papers_2018-2019","abstract":"A model is a well-formed, adequate, and dependable instrument that represents origins. Its criteria of well-formedness, adequacy, and dependability must be commonly accepted by its community of practice within some context and correspond to the functions that a model fulfills in utilisation scenarios. As an instrument or more specifically an artifact a model comes with its background, e.g. paradigms, assumptions, postulates, language, thought community, etc. The background its often given only in an implicit form. The background is often implicit and hidden. A well-formed instrument is adequate for a collection of origins if it is analogous to the origins to be represented according to some analogy criterion, it is more focused (e.g. simpler, truncated, more abstract or reduced) than the origins being modelled, and it sufficiently satisfies its purpose. Well-formedness enables an instrument to be justified by an empirical corroboration according to its objectives, by rational coherence and conformity explicitly stated through conformity formulas or statements, by falsifiability or validation, and by stability and plasticity within a collection of origins. The instrument is sufficient by its quality characterisation for internal quality, external quality and quality in use or through quality characteristics such as correctness, generality, usefulness, comprehensibility, parsimony, robustness, novelty etc. Sufficiency is typically combined with some assurance evaluation (tolerance, modality, confidence, and restrictions). A well-formed instrument is called dependable if it is sufficient and is justified for some of the justification properties and some of the sufficiency characteristics.","authors":["Bernhard Thalheim"],"meta":["December 2019","Conference: EJC, DAMDID, MEDI, EEKM, EMISA, ADBIS, Modellierung, MiPRO, TributesAt: European conferences and journals","Project: Models, to model, modelling in CS and beyond"],"references":["304368066_Theories_in_Business_and_Information_Systems_Engineering","300785217_WH_The_Conceptual_Model_for_Services","289305165_Interactive_data_extraction_from_semi-structured_text","224128447_Framework_for_high-quality_software_design_and_development_A_systematic_approach","221383899_A_BPMN_Case_study_Paper_review_and_submission_system","221014046_Architecture-Driven_Modelling_Methodologies","333986493_Between_natural_and_human_sciences_On_the_role_and_character_of_theory_in_socio-environmental_archeology","326702618_Role_of_the_user_in_information_systems_development","255702367_A_FRAMEWORK_FOR_MODELING_MEDICAL_DIAGNOSIS_AND_DECISION_SUPPORT_SERVICES","221238047_A_service-oriented_approach_to_web_warehousing","220621599_A_theory_of_data-intensive_software_services","220349109_A_Geometrically_Enhanced_Conceptual_Model_and_Query_Language","220348784_On_Defining_the_Behavior_of_OR-joins_in_Business_Process_Models","45874145_Personal_Information_Databases","22884527_Information_systems_The_process_of_development"]}