{"id":"338631237_A_GA-Based_Multi-View_Multi-Learner_Active_Learning_Framework_for_Hyperspectral_Image_Classification","abstract":"This paper introduces a novel multi-view multi-learner (MVML) active learning method, in which the different views are generated by a genetic algorithm (GA). The GA-based view generation method attempts to construct diverse, sufficient, and independent views by considering both inter-and intra-view confidences. Hyperspectral data inherently owns high dimensionality, which makes it suitable for multi-view learning algorithms. Furthermore, by employing multiple learners at each view, a more accurate estimation of the underlying data distribution can be obtained. We also implemented a spectral-spatial graph-based semi-supervised learning (SSL) method as the classifier, which improved the performance of the classification task in comparison with supervised learning. The evaluation of the proposed method was based on three different benchmark hyperspectral data sets. The results were also compared with other state-of-the-art AL-SSL methods. The experimental results demonstrated the efficiency and statistically significant superiority of the proposed method. The GA-MVML AL method improved the classification performances by 16.68%, 18.37%, and 15.1% for different data sets after 40 iterations.","authors":["Nasehe Jamshidpour","Abdolreza Safari","Saeid Homayouni"],"meta":["January 2020Remote Sensing 12(2):297","DOI:10.3390/rs12020297","Project: Hyperspectral Image Analysis for Environmental Mapping and Detection Applications"],"references":["337665702_Deep_learning_classifiers_for_hyperspectral_imaging_A_review","309082063_Superpixel-Based_Active_Learning_and_Online_Feature_Importance_Learning_for_Hyperspectral_Image_Analysis","309055869_Active_Deep_Learning_for_Classification_of_Hyperspectral_Images","328894110_Active-Learning-Incorporated_Deep_Transfer_Learning_for_Hyperspectral_Image_Classification","320650288_Graph-based_semi-supervised_hyperspectral_image_classification_using_spatial_information","317293704_Spectral-Spatial_Semisupervised_Hyperspectral_Classification_Using_Adaptive_Neighborhood","308866890_Semisupervised_hyperspectral_image_classification_based_on_affinity_scoring","308276515_Random-Walker-Based_Collaborative_Learning_for_Hyperspectral_Image_Classification","293801402_Graph-based_semi-supervised_learning_for_spectral-spatial_hyperspectral_image_classification","291017723_Hybrid_Feature_Selection_based_on_Enhanced_Genetic_Algorithm_for_Text_Categorization"]}