{"id":"338695614_Improving_students'_programming_quality_with_the_continuous_inspection_process_a_social_coding_perspective","abstract":"College students majoring in computer science and software engineering need to master skills for high-quality programming. However, rich research has shown that both the teaching and learning of high-quality programming are challenging and deficient in most college education systems. Recently, the continuous inspection paradigm has been widely used by developers on social coding sites (e.g., GitHub) as an important method to ensure the internal quality of massive code contributions. This paper presents a case where continuous inspection is introduced into the classroom setting to improve students’ programming quality. In the study, we first designed a specific continuous inspection process for students’ collaborative projects and built an execution environment for the process. We then conducted a controlled experiment with 48 students from the same course during two school years to evaluate how the process affects their programming quality. Our results show that continuous inspection can help students in identifying their bad coding habits, mastering a set of good coding rules and significantly reducing the density of code quality issues introduced in the code. Furthermore, we describe the lessons learned during the study and propose ideas to replicate and improve the process and its execution platform.","authors":["Yao Lu","Xinjun Mao","Tao Wang","Gang Yin"],"meta":["October 2019Frontiers of Computer Science (electronic) 14(5)","DOI:10.1007/s11704-019-9023-2"],"references":["321136324_Internal_quality_assurance_for_external_contributions_in_GitHub_An_empirical_investigation","315849356_Does_the_Role_Matter_An_Investigation_of_the_Code_Quality_of_Casual_Contributors_in_GitHub","303755164_Initial_and_Eventual_Software_Quality_Relating_to_Continuous_Integration_in_GitHub","303296639_Teaching_code_review_management_using_branch_based_workflows","323402782_Code_quality_from_the_programmer's_perspective","323325990_Developing_Software_Engineering_Skills_using_Real_Tools_for_Automated_Grading","315495774_DevOps_for_Developers","308495563_Boosting_Bug-Report-Oriented_Fault_Localization_with_Segmentation_and_Stack-Trace_Analysis","306151908_Experimental_and_quasi-experimental_designs_for_research_on_teaching","303684021_Investigating_students'_behavior_and_code_quality_when_applying_pair-programming_as_a_teaching_technique"]}