{"id":"338673915_Evolutionary_Large-Scale_Multiobjective_Optimization_for_Ratio_Error_Estimation_of_Voltage_Transformers","abstract":"Ratio error estimation of the voltage transformers plays an important role in modern power delivery systems. Existing ratio error estimation methods mainly focus on periodical calibration but ignore the time-varying property. Consequently, it is difficult to efficiently estimate the state of the voltage transformers in real time. To address this issue, we formulate a time-varying ratio error estimation (TREE) problem into a large-scale multiobjective optimization problem, where the multiple objectives and inequality constraints are formulated by statistical and physical rules extracted from the power delivery systems. Furthermore, a set of TREE problems from different substations are systematically formulated into a benchmark test suite for characterizing their different properties. The formulation of these TREE problems not only transfers an expensive ratio error estimation task to a relatively cheaper optimization problem, but also promotes the research in large-scale multiobjective optimization by providing a real-world benchmark test suite with complex variable interactions and correlations to different objectives. To the best of our knowledge, this is the first time to formulate a real-world problem into a benchmark test suite for large-scale multiobjective optimization, and it is also the first work proposing to solve TREE problems via evolutionary multiobjective optimization.","authors":["Cheng He","Ran Cheng","Chuanji Zhang","Ye Tian"],"meta":["January 2020IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99):1-1","DOI:10.1109/TEVC.2020.2967501","Project: Large-scale optimization"],"references":["336200016_Transmission_Lines_Positive_Sequence_Parameters_Estimation_and_Instrument_Transformers_Calibration_Based_on_PMU_Measurement_Error_Model","330692272_Accelerating_Large-Scale_Multiobjective_Optimization_via_Problem_Reformulation","331284277_Detection_of_the_ratio_error_drift_in_CVT_considering_AVC","327946714_A_Generator_for_Multiobjective_Test_Problems_With_Difficult-to-Approximate_Pareto_Front_Boundaries","325587672_On_Scalable_Multiobjective_Test_Problems_With_Hardly_Dominated_Boundaries","323340372_Error_Reduction_of_Phasor_Measurement_Unit_PMU_Data_Considering_Practical_Constraints","323273780_Development_and_Analysis_of_a_Sensitivity_Matrix_of_a_3-phase_Voltage_Unbalance_Factor","322378196_An_accurate_on-site_calibration_system_for_electronic_voltage_transformers_using_a_standard_capacitor","320458244_A_Competitive_Mechanism_Based_Multi-objective_Particle_Swarm_Optimizer_with_Fast_Convergence","319415535_A_Radial_Space_Division_Based_Evolutionary_Algorithm_for_Many-Objective_Optimization"]}