{"id":"338648266_Virus_Metagenomics_in_Farm_Animals_A_Systematic_Review","abstract":"A majority of emerging infectious diseases are of zoonotic origin. Metagenomic Next-Generation Sequencing (mNGS) has been employed to identify uncommon and novel infectious etiologies and characterize virus diversity in human, animal, and environmental samples. Here, we systematically reviewed studies that performed viral mNGS in common livestock (cattle, small ruminants, poultry, and pigs). We identified 2481 records and 120 records were ultimately included after a first and second screening. Pigs were the most frequently studied livestock and the virus diversity found in samples from poultry was the highest. Known animal viruses, zoonotic viruses, and novel viruses were reported in available literature, demonstrating the capacity of mNGS to identify both known and novel viruses. However, the coverage of metagenomic studies was patchy, with few data on the virome of small ruminants and respiratory virome of studied livestock. Essential metadata such as age of livestock and farm types were rarely mentioned in available literature, and only 10.8% of the datasets were publicly available. Developing a deeper understanding of livestock virome is crucial for detection of potential zoonotic and animal pathogens and One Health preparedness. Metagenomic studies can provide this background but only when combined with essential metadata and following the “FAIR” (Findable, Accessible, Interoperable, and Reusable) data principles.","authors":["Kirsty T. T. Kwok","David F. Nieuwenhuijse","My Phan","Marion Koopmans"],"meta":["January 2020Viruses 12(1):107","DOI:10.3390/v12010107"],"references":["333397526_Animals_as_Reservoir_for_Human_Norovirus","331215541_Viral_metagenomics_reveals_significant_viruses_in_the_genital_tract_of_apparently_healthy_dairy_cows","330565191_Gut_Virome_Analysis_of_Cameroonians_Reveals_High_Diversity_of_Enteric_Viruses_Including_Potential_Interspecies_Transmitted_Viruses","329669511_Intra-epidemic_genome_variation_in_highly_pathogenic_African_swine_fever_virus_ASFV_from_the_country_of_Georgia","335078244_Benchmarking_Metagenomics_Tools_for_Taxonomic_Classification","330745106_Genomes_and_seroprevalence_of_severe_fever_with_thrombocytopenia_syndrome_virus_and_Nairobi_sheep_disease_virus_in_Haemaphysalis_longicornis_ticks_and_goats_in_Hubei_China","330056854_Molecular_and_in_vitro_characterisation_of_hepatitis_E_virus_from_UK_pigs","329546471_The_intestinal_virome_of_malabsorption_syndrome-affected_and_unaffected_broilers_through_shotgun_metagenomics","328504347_Clinical_Metagenomic_Next-Generation_Sequencing_for_Pathogen_Detection","328246912_Full-genome_characterization_by_deep_sequencing_of_rotavirus_A_isolates_from_outbreaks_of_neonatal_diarrhoea_in_pigs_in_Spain"]}