{"id":"338683681_Defining_student_learning_experience_through_blended_learning","abstract":"This paper aims to explore the benefits of Blended Learning towards students’ learning experiences at an offshore campus of an Australian university located in Ho Chi Minh City, Vietnam. At the university campus, the Blended Learning practice in use is the displacement of content. Content displacement refers to a portion of the learning content and activities for a course being delivered online via the Learning Management System. Learning not only happens in face-to-face sessions at a given time but is extended to online spaces as well, happening anywhere at any time at students’ preference. The focus of this research is its usefulness and effectiveness in promoting interactions between students and their peers, their teachers, and course materials. An online survey, which was designed based on a set of validated questions, was used to collect data from sixty-six students enrolled in eight Blended Learning courses. The analysis of the survey results provides empirical evidence to the claim that students’ perception of their learning experiences at the university was beneficially impacted as a result of the Blended Learning environment in each of their classes. Specifically, factor analysis using oblique rotation method identifies a clear factor structure across survey questions, representing four dimensions of benefits: Engagement, Flexibility of learning, Online learning experience, and Self-confidence. In addition, significant differences between the clusters on these factors indicate that students vary in their responses towards the benefits of Blended Learning and their experience with a Blended Learning approach.","authors":["Frederique Bouilheres","Le Thi Viet Ha Le","Scott McDonald","Clara A. Nkhoma"],"meta":["July 2020Education and Information Technologies 25(1):1-21","DOI:10.1007/s10639-020-10100-y"],"references":["351134958_The_Net_Generation's_Informal_and_Educational_Use_of_New_Technologies","331288370_Blended_learning_in_higher_education_Trends_and_capabilities","317525957_Four_key_challenges_to_the_design_of_blended_learning_A_systematic_literature_review","296456436_Online_technologies_for_engaged_learning_A_meaningful_synthesis_for_educators","322499827_Blended_Learning_as_a_Conduit_for_Inquiry-based_Instruction_Active_Learning_Formative_Assessment_and_its_Impact_on_Students'_Learning_Outcomes_in_Higher_Education_8th_Knowledge_Management_Internationa","316188458_Active_Learning_Strategies_for_Online_and_Blended_Learning_Environments","313706668_Blended_learning_systems_Definition_current_trends_and_future_directions","306188385_Using_Flipped_Classroom_Approach_to_Explore_Deep_Learning_in_Large_Classrooms","292520013_Active_Learning_Strategies_for_Online_and_Blended_Learning_Environments","285290762_New_benchmarks_in_higher_education_Student_engagement_in_online_learning"]}