{"id":"338722368_A_disciplina_Telessaude_e_a_Educacao_Interprofissional_um_relato_de_experiencia_vivenciada_na_Universidade_Federal_do_Tocantins","abstract":"O presente relato demonstrou a proposta pedagógica da disciplina optativa Telessaúde, do curso de Medicina da Universidade Federal do Tocantins (UFT), como uma estratégia de educação interprofissional e inovadora de formação de recursos humanos em saúde. Estudo descritivo, tipo relato de experiência. Com o objetivo de descrever a experiência da implantação e desenvolvimento de uma disciplina interprofissional – disciplina optativa Telessaúde, do curso de Medicina da UFT, campus Palmas. A disciplina ocorre desde o ano de 2013, ano de implantação na instituição, com a disponibilidade de vagas para os cursos de Medicina, Enfermagem, Nutrição,Ciências da Computação e Jornalismo. Entendemos a defesa desta disciplina na graduação como uma práticainovadora, a qual se sustenta nos resultados encontrados especialmente no que diz respeito à seleção dos conteúdos,como também no uso de metodologias ativas e das Tecnologias de Informação e Comunicação (TICs) em Saúde. Como resultado, observamos a permanente procura dos estudantes pela disciplina e mesmo com todas as adversidades, o número de matrículas se mantém homogêneo durante todos esses anos de oferta. Todo o processo de ensino e aprendizagem que se proponha ser crítico deve considerar como elemento estruturante a pactuação com o corpo discente de como este processo será desenvolvido. Nesse sentido, a disciplina optativa Telessaúde cumpre este papel, estimulando a prática compromissada de todos os envolvidos.Palavras-chave: Educação interprofissional. Aprendizagem. Inovação. Telessaúde.","authors":["Michelle de Jesus Pantoja Filgueira de Araújo","Guilherme Parreira Vaz","Evandro Leite Bittencourt"],"meta":["January 2020Cadernos do Cuidado 3(2)","DOI:10.29397/cc.v3n2.160"],"references":["326562823_A_Educacao_Interprofissional_e_a_pratica_compartilhada_em_programas_de_residencia_multiprofissional_em_Saude","321635805_O_desenvolvimento_da_colaboracao_interprofissional_em_diferentes_contextos_de_residencia_multiprofissional_em_Saude_da_Familia","250991548_Tecnologias_de_Informacao_e_Comunicacao_contribuicoes_para_o_processo_interdisciplinar_no_ensino_superior","250028266_Metodologias_ativas_de_ensino-aprendizagem_na_formacao_profissional_em_saude_debates_atuais","26414473_Educacao_Permanente_em_Saude_descentralizacao_e_disseminacao_de_capacidade_pedagogica_na_saude","328447241_A_TELESSAUDE_E_SEUS_IMPACTOS_NA_FORMACAO_CONTINUADA_DOS_PROFISSIONAIS_DE_SAUDE_EM_REDE"]}