{"id":"338728460_Modeling_of_a_Combined_Cycle_Gas_Turbine_Integrated_with_an_Adsorption_Chiller","abstract":"Forecasts to 2030 indicate that demand for electricity will increase from 2% to 3% per year, and due to the observed high rate of development of the world economy, energy demand will continue to increase. More efficient use of primary energy has influence on reduction emissions and consumption of fuel. Besides, reducing the amount of fuel burned, it reveals a beneficial effect on the environment. Since extraction-back pressure turbines have some limitations, including the restriction of electricity production due to limited heat consumption in summer. The paper discusses the possibilities of integrating the adsorption aggregate with a combined cycle gas turbine and its impact on the operation of all devices. Simulations are performed on Sim tech IPSEPro software. The obtained results confirm that the adsorption aggregate, using a low grade of thermal energy, does not affect the operation of the gas and steam cycle and allows the production of electricity at a constant level. The calculated chemical fuel energy utilisation factor was 85.7% in cogeneration and 75.6% in trigeneration. These factors indicated a reduced utilisation of chemical fuel energy; however, this reduction is caused by a lower COP for adsorption chillers. Besides, the adsorption aggregate additionally generates chilled water for air conditioning or other technological processes, which stands for an added value of the innovative concept proposed in the paper.","authors":["Karol Sztekler","Wojciech Kalawa","L. Mika","Jaroslaw Krzywanski"],"meta":["January 2020Energies 13(3):515","DOI:10.3390/en13030515"],"references":["337464106_A_General_Approach_in_Optimization_of_Heat_Exchangers_by_Bio-Inspired_Artificial_Intelligence_Methods","337377466_Design_and_Comparative_Techno-Economic_Analysis_of_Two_Solar_Polygeneration_Systems_Applied_for_Electricity_Cooling_and_Fresh_Water_Production","336871135_Performance_Analyses_of_a_Renewable_Energy_Powered_System_for_Trigeneration","336635380_Experimental_Study_of_Performance_Improvement_of_3-Bed_and_2-Evaporator_Adsorption_Chiller_by_Control_Optimization","331781037_Installation_and_Operation_of_a_Solar_Cooling_and_Heating_System_Incorporated_with_Air-Source_Heat_Pumps","330588292_Potential_uses_of_small_cogeneration_systems_in_prosumer_systems","329211379_Analysis_of_heat_transfer_in_a_coated_bed_of_an_adsorption_chiller","332221871_Sensitivity_of_airmist_non-equilibrium_phase_transition_cooling_to_transient_characteristics_in_a_compressor_of_gas_turbine","325949640_Energy_optimization_analysis_of_a_thermochemical_exhaust_gas_recuperation_system_of_a_gas_turbine_unit","320887323_First_law_energy_analysis_of_thermochemical_waste-heat_recuperation_by_steam_methane_reforming"]}