{"id":"338786052_Enhanced_Social_Spider_Optimization_Algorithm_for_Increasing_Performance_of_Multiple_Pursuer_Drones_in_Neutralizing_Attacks_From_Multiple_Evader_Drones","abstract":"We propose an optimization algorithm for reducing execution time needed by multiple pursuers in solving a variant of the Multiple-Pursuer Multiple-Evader (MPME) problem where each evader tries to attack an area defended by pursuers. This problem is a variant of the Multi-Agent Pursuit Evasion problem. In our discussed problem, a group of pursuers tries to defend an area from a group of evaders’ attacks. The main task given in this problem is how pursuers can capture or immobilize as soon as possible any evader trying to get closer to the defended area (evaders’ target). We use Social Spider Optimization (SSO) algorithm as the basis of our proposed method. In SSO, there are female spiders, dominant-male spiders, and non-dominant-male spiders collaborating to catch their prey. In SSO, there are three main procedures usually exist: calculation of fitness value, the vibrational summons of surrounding spiders, and mating procedure. In this paper, we develop an enhanced SSO algorithm where excludes the mating procedure and propose a practical calculation process for solving our discussed problem. SSO is one of the recent optimization algorithms developed in the computer science field. Developing this algorithm for solving dynamic problem like the MPME variant surely brings a novelty in the computer science research area. We test our proposed method in a 3D simulation environment where we manifest all pursuers and evaders as drones. Based on our experiment result, our algorithm performs better than commonly used methods for solving the MPME problem.","authors":["Ario Yudo Husodo","Grafika Jati","Amarulla Octavian","Wisnu Jatmiko"],"meta":["January 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2969021"],"references":["334070443_Low-Altitude_Navigation_for_Multi-Rotor_Drones_in_Urban_Areas","333407340_Convolutional_Neural_Network-Based_Real-Time_Object_Detection_and_Tracking_for_Parrot_AR_Drone_2","329369599_Social_Spider_Optimization_Algorithm_Modifications_Applications_and_Perspectives","328341314_Ls-II_An_Improved_Locust_Search_Algorithm_for_Solving_Optimization_Problems","327519293_Pursuit-evasion_of_an_Evader_by_Multiple_Pursuers","338070496_The_Use_of_Direction_Matrix_to_Determine_Autonomous_Quad-Copter_Drone_Path_when_Facing_Obstacle","337504636_Evader_Cooperative_Capture_by_Multiple_Pursuers_with_Area-Minimization_Policy","335936554_Intruder_Drone_Localization_Based_on_2D_Image_and_Area_Expansion_Principle_for_Supporting_Military_Defence_System","333736132_Machine_Learning_Based_Field_Data_Analysis_and_Modeling_for_Drone_Communications","329055558_Constrained_Optimization_by_Artificial_Bee_Colony_Framework"]}