{"id":"338754244_Liver_lesion_localisation_and_classification_with_convolutional_neural_Networks_A_Comparison_between_conventional_and_spectral_computed_tomography","abstract":"Purpose: \nTo evaluate the benefit of the additional available information present in spectral CT datasets, as compared to conventional CT datasets, when utilizing convolutional neural networks for fully automatic localisation and classification of liver lesions in CT images.\n\nMaterials and methods: \nConventional and spectral CT images (iodine maps, virtual monochromatic images (VMI)) were obtained from a spectral dual-layer CT system. Patient diagnosis were known from the clinical reports and classified into healthy, cyst and hypodense metastasis. In order to compare the value of spectral versus conventional datasets when being passed as input to machine learning algorithms, we implemented a weakly-supervised convolutional neural network (CNN) that learns liver lesion localisation without pixel-level ground truth annotations. Regions-of-interest are selected automatically based on the localisation results and are used to train a second CNN for liver lesion classification (healthy, cyst, hypodense metastasis). The accuracy of lesion localisation was evaluated using the Euclidian distances between the ground truth centres of mass and the predicted centres of mass. Lesion classification was evaluated by precision, recall, accuracy and F1-Score.\n\nResults: \nLesion localisation showed the best results for spectral information with distances of 8.22 ± 10.72 mm, 8.78 ± 15.21 mm and 8.29 ± 12.97 mm for iodine maps, 40 keV and 70 keV VMIs, respectively. With conventional data distances of 10.58 ± 17.65 mm were measured. For lesion classification, the 40 keV VMIs achieved the highest overall accuracy of 0.899 compared to 0.854 for conventional data.\n\nConclusion: \nAn enhanced localisation and classification is reported for spectral CT data, which demonstrates that combining machine-learning technology with spectral CT information may in the future improve the clinical workflow as well as the diagnostic accuracy.","authors":["Nadav Shapira","Julia Fokuhl","Manuel Schultheiß","Stefanie Beck"],"meta":["January 2020Biomedical Physics & Engineering Express 6(1)","DOI:10.1088/2057-1976/ab6e18"],"references":["322943582_Dual-energy_CT_a_phantom_comparison_of_different_platforms_for_abdominal_imaging","322014775_Simultaneous_dual-contrast_multi-phase_liver_imaging_using_spectral_photon-counting_computed_tomography_a_proof-of-concept_study","321945619_Assessment_of_quantification_accuracy_and_image_quality_of_a_full-body_dual-layer_spectral_CT_system","320257137_Detector-based_spectral_CT_with_a_novel_dual-layer_technology_principles_and_applications","316740882_ChestX-Ray8_Hospital-Scale_Chest_X-Ray_Database_and_Benchmarks_on_Weakly-Supervised_Classification_and_Localization_of_Common_Thorax_Diseases","320673701_Deep_Learning_with_Convolutional_Neural_Network_for_Differentiation_of_Liver_Masses_at_Dynamic_Contrast-enhanced_CT_A_Preliminary_Study","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770006_Learning_Deep_Features_for_Discriminative_Localization","316910450_Metal_artifact_reduction_by_dual-layer_computed_tomography_using_virtual_monoenergetic_images","316489970_Photon-counting_CT_for_simultaneous_imaging_of_multiple_contrast_agents_in_the_abdomen_An_in_vivo_study"]}