{"id":"338724822_Structural_Analysis_and_Optimization_of_Convolutional_Neural_Networks_with_a_Small_Sample_Size","abstract":"Deep neural networks have gained immense popularity in the Big Data problem; however, the availability of training samples can be relatively limited in specific application domains, particularly medical imaging, and consequently leading to overfitting problems. This “Small Data” challenge may need a mindset that is entirely different from the existing Big Data paradigm. Here, under the small data scenarios, we examined whether the network structure has a substantial influence on the performance and whether the optimal structure is predominantly determined by sample size or data nature. To this end, we listed all possible combinations of layers given an upper bound of the VC-dimension to study how structural hyperparameters affected the performance. Our results showed that structural optimization improved accuracy by 27.99%, 16.44%, and 13.11% over random selection for a sample size of 100, 500, and 1,000 in the MNIST dataset, respectively, suggesting that the importance of the network structure increases as the sample size becomes smaller. Furthermore, the optimal network structure was mostly determined by the data nature (photographic, calligraphic, or medical images), and less affected by the sample size, suggesting that the optimal network structure is data-driven, not sample size driven. After network structure optimization, the convolutional neural network could achieve 91.13% accuracy with only 500 samples, 93.66% accuracy with only 1000 samples for the MNIST dataset and 94.10% accuracy with only 3300 samples for the Mitosis (microscopic) dataset. These results indicate the primary importance of the network structure and the nature of the data in facing the Small Data challenge.","authors":["Rhett N. D’souza","Po-Yao Huang","Fang-Cheng Yeh"],"meta":["January 2020Scientific Reports 10(1):834","DOI:10.1038/s41598-020-57866-2"],"references":["307968826_Digital_mammographic_tumor_classification_using_transfer_learning_from_deep_convolutional_neural_networks","297659797_Convolutional_Neural_Networks_for_Medical_Image_Analysis_Fine_Tuning_or_Full_Training","261141151_Mapping_stain_distribution_in_pathology_slides_using_whole_slide_imaging","220500215_Measuring_the_VC-Dimension_of_a_Learning_Machine","2262533_VC_Dimension_of_Neural_Networks","314361329_Nearly-tight_VC-dimension_bounds_for_piecewise_linear_neural_networks","265385906_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","225760106_Estimation_of_prediction_error_by_using_K-fold_cross-validation","222476217_Automatic_early_stopping_using_cross_validation_Quantifying_the_criteria"]}