{"id":"338713992_A_deep_learning_analysis_on_question_classification_task_using_Word2vec_representations","abstract":"Question classification is a primary essential study for automatic question answering implementations. Linguistic features take a significant role to develop an accurate question classifier. Recently, deep learning systems have achieved remarkable success in various text-mining problems such as sentiment analysis, document classification, spam filtering, document summarization, and web mining. In this study, we explain our study on investigating some deep learning architectures for a question classification task in a highly inflectional language Turkish that is an agglutinative language where word structure is produced by adding suffixes (morphemes) to root word. As a non-Indo-European language, languages like Turkish have some unique features, which make it challenging for natural language processing. For instance, Turkish has no grammatical gender and noun classes. In this study, user questions in Turkish are used to train and test the deep learning architectures. In addition to this, the details of the deep learning architectures are compared in terms of test and 10-cross fold validation accuracy. We use two major deep learning models in our paper: long short-term memory (LSTM), Convolutional Neural Networks (CNN), and we also implemented the combination of CNN-LSTM, CNN-SVM structures and a number of various those architectures by changing vector sizes and the embedding types. As well as this, we have built word embeddings using the Word2vec method with a CBOW and skip gram models with different vector sizes on a large corpus composed of user questions. Our another investigation is the effect of using different Word2vec pre-trained word embeddings on these deep learning architectures. Experiment results show that the use of different Word2vec models has a significant impact on the accuracy rate on different deep learning models. Additionally, there is no Turkish question dataset labeled and so another contribution in this study is that we introduce new Turkish question dataset which is translated from UIUC English question dataset. By using these techniques, we have reached an accuracy of 94% on the question dataset.","authors":["Seyhmus Yilmaz","Sinan Toklu"],"meta":["April 2020Neural Computing and Applications 32(2):1-20","DOI:10.1007/s00521-020-04725-w"],"references":["339581734_Towards_End-to-End_Multilingual_Question_Answering","331007224_Deep_Learning-Based_Sentiment_Analysis_for_Roman_Urdu_Text","330484435_Handling_negative_mentions_on_social_media_channels_using_deep_learning","328961714_Sentiment_Analysis_of_Arabic_Tweets_using_Deep_Learning","335784234_XQA_A_Cross-lingual_Open-domain_Question_Answering_Dataset","334071372_A_Neural_Network_based_Vietnamese_Chatbot","332681553_Fuzziness_Detection_in_Thai_Law_Texts_Using_Deep_Learning","331984213_Deep_learning-based_sentiment_classification_of_evaluative_text_based_on_Multi-feature_fusion","330295148_An_Ensemble_of_Shallow_and_Deep_Learning_Algorithms_for_Vietnamese_Sentiment_Analysis","329159182_Comparative_effectiveness_of_convolutional_neural_network_CNN_and_recurrent_neural_network_RNN_architectures_for_radiology_text_report_classification","327312101_Towards_Multilingual_Neural_Question_Answering_ADBIS_2018_Short_Papers_and_Workshops_AIQA_BIGPMED_CSACDB_M2U_BigDataMAPS_ISTREND_DC_Budapest_Hungary_September_2-5_2018_Proceedings","326555328_Evaluating_semantic_relations_in_neural_word_embeddings_with_biomedical_and_general_domain_knowledge_bases","324299203_Morphological_Evaluation_and_Sentiment_Analysis_of_Punjabi_Text_using_Deep_Learning_Classification","327180570_A_Combined_CNN_and_LSTM_Model_for_Arabic_Sentiment_Analysis_Second_IFIP_TC_5_TC_8WG_84_89_TC_12WG_129_International_Cross-Domain_Conference_CD-MAKE_2018_Hamburg_Germany_August_27-30_2018_Proceedings","325065066_Feature_Extraction_Based_on_Information_Gain_and_Sequential_Pattern_for_English_Question_Classification"]}