{"id":"338780075_Title_abstract_and_keyword_searching_resulted_in_poor_recovery_of_articles_in_systematic_reviews_of_epidemiologic_practice","abstract":"Objective: \nArticle full texts are often inaccessible via the standard search engines of biomedical literature, such as PubMed and Embase, which are commonly used for systematic reviews. Excluding the full text bodies from a literature search may result in a small or selective subset of articles being included in the review because of the limited information that is available in only title, abstract and keywords. This article describes a comparison of search strategies based on a systematic literature review of all manuscripts published in 5 top-ranked epidemiology journals between 2000 and 2017.\n\nStudy design and setting: \nBased on a text-mining approach, we studied whether 9 different methodological topics were mentioned across text fields (title, abstract, keywords, and text body). The following methodological topics were studied: propensity score methods, inverse probability weighting, marginal structural modelling, multiple imputation, Kaplan-Meier estimation, number needed to treat, measurement error, randomized controlled trial, and latent class analysis.\n\nResults: \nIn total, 31,641 Hypertext Markup Language (HTML) files were downloaded from the journals' websites. For all methodological topics and journals, at most 50% of articles with a mention of a topic in the text body also mentioned the topic in the title, abstract or keywords. For each topic, a gradual decrease over calendar time was observed of reporting in the title, abstract or keywords.\n\nConclusion: \nLiterature searches based on title, abstract and keywords alone may not be sufficiently sensitive for studies of epidemiological research practice. This study also illustrates the potential value of full text literature searches, provided there is accessibility of full text bodies for literature searches.","authors":["Bas B.L. Penning de Vries","Maarten van Smeden","Frits R. Rosendaal","Rolf H.H. Groenwold"],"meta":["January 2020Journal of Clinical Epidemiology 121","DOI:10.1016/j.jclinepi.2020.01.009"],"references":["336209946_Cochrane_Handbook_for_Systematic_Reviews_of_Interventions","327195515_Sample_size_calculations_are_poorly_conducted_and_reported_in_many_randomised_trials_of_hip_and_knee_osteoarthritis_results_of_a_systematic_review","317289943_Number_needed_to_treat_NNT_in_clinical_literature_An_appraisal","303505185_Epidemiology_and_Reporting_Characteristics_of_Systematic_Reviews_of_Biomedical_Research_A_Cross-Sectional_Study","281842987_Using_text_mining_for_study_identification_in_systematic_reviews_A_systematic_review_of_current_approaches","13780000_Meta-analysis_Bias_in_location_and_selection_of_studies","323590196_Measurement_error_is_often_neglected_in_medical_literature_a_systematic_review","318393858_R_A_Language_and_Environment_for_Statistical_Computing","268882086_Reporting_of_Covariate_Selection_and_Balance_Assessment_in_Propensity_Score_Analysis_Is_Suboptimal_A_Systematic_Review","10668125_Beyond_MEDLINE_for_literature_searches"]}