{"id":"338760212_Theory_versus_practice_in_annealing-based_quantum_computing","abstract":"This paper introduces basic concepts of annealing-based quantum computing, also known as adiabatic quantum computing (AQC) and quantum annealing (QA), and surveys what is known about this novel computing paradigm. Extensive empirical research on physical quantum annealing processers built by D-Wave Systems has exposed many interesting features and properties. However, because of longstanding differences between abstract and empirical approaches to the study of computational performance, much of this work may not be considered relevant to questions of interest to complexity theory; by the same token, several theoretical results in quantum computing may be considered irrelevant to practical experience.\nTo address this communication gap, this paper proposes models of computation and of algorithms that lie on a scale of instantiation between pencil-and-paper abstraction and physical device. Models at intermediate points on these scales can provide a common language, allowing researchers from both ends to communicate and share their results. The paper also gives several examples of common terms that have different technical meanings in different regions of this highly multidisciplinary field, which can create barriers to effective communication across disciplines.","authors":["Catherine Mcgeoch"],"meta":["May 2020Theoretical Computer Science 816(1)","DOI:10.1016/j.tcs.2020.01.024"],"references":["337013955_Support_vector_machines_on_the_D-Wave_quantum_annealer","326495873_Demonstration_of_a_Scaling_Advantage_for_a_Quantum_Annealer_over_Simulated_Annealing","323694512_A_cross-disciplinary_introduction_to_quantum_annealing-based_algorithms","323597968_Observation_of_topological_phenomena_in_a_programmable_lattice_of_1800_qubits","337951345_Performance_of_a_Quantum_Annealer_for_Ising_Ground_State_Computations_on_Chimera_Graphs","335334203_Arbitrary-time_error_suppression_for_Markovian_adiabatic_quantum_computing_using_stabilizer_subspace_codes","331617747_Image_Classification_Using_Quantum_Inference_on_the_D-Wave_2X","326399373_Phase_transitions_in_a_programmable_quantum_spin_glass_simulator","323570979_Nested_Quantum_Annealing_Correction_at_Finite_Temperature_p-spin_models","322781740_Adiabatic_quantum_computation"]}