{"id":"338723814_Fundamentals_of_Recurrent_Neural_Network_RNN_and_Long_Short-Term_Memory_LSTM_network","abstract":"Because of their effectiveness in broad practical applications, LSTM networks have received a wealth of coverage in scientific journals, technical blogs, and implementation guides. However, in most articles, the inference formulas for the LSTM network and its parent, RNN, are stated axiomatically, while the training formulas are omitted altogether. In addition, the technique of “unrolling” an RNN is routinely presented without justification throughout the literature. The goal of this tutorial is to explain the essential RNN and LSTM fundamentals in a single document. Drawing from concepts in Signal Processing, we formally derive the canonical RNN formulation from differential equations. We then propose and prove a precise statement, which yields the RNN unrolling technique. We also review the difficulties with training the standard RNN and address them by transforming the RNN into the “Vanilla LSTM”¹ network through a series of logical arguments. We provide all equations pertaining to the LSTM system together with detailed descriptions of its constituent entities. Albeit unconventional, our choice of notation and the method for presenting the LSTM system emphasizes ease of understanding. As part of the analysis, we identify new opportunities to enrich the LSTM system and incorporate these extensions into the Vanilla LSTM network, producing the most general LSTM variant to date. The target reader has already been exposed to RNNs and LSTM networks through numerous available resources and is open to an alternative pedagogical approach. A Machine Learning practitioner seeking guidance for implementing our new augmented LSTM model in software for experimentation and research will find the insights and derivations in this treatise valuable as well.","authors":["Alex Sherstinsky"],"meta":["March 2020Physica D Nonlinear Phenomena 404(8):132306","DOI:10.1016/j.physd.2019.132306"],"references":["331718291_Deriving_the_Recurrent_Neural_Network_Definition_and_RNN_Unrolling_Using_Signal_Processing","324644068_NAIS-Net_Stable_Deep_Networks_from_Non-Autonomous_Differential_Equations","324492734_Deep_Neural_Networks_Motivated_by_Partial_Differential_Equations","322243714_Recent_Advances_in_Recurrent_Neural_Networks","320707779_Beyond_Finite_Layer_Neural_Networks_Bridging_Deep_Architectures_and_Numerical_Differential_Equations","319663020_Reversible_Architectures_for_Arbitrarily_Deep_Residual_Neural_Networks","318333660_A_new_concept_using_LSTM_Neural_Networks_for_dynamic_system_identification","316821143_Stable_Architectures_for_Deep_Neural_Networks","334118245_Long_Short-Term_Memory_as_a_Dynamically_Computed_Element-wise_Weighted_Sum","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","301876854_Bridging_the_Gaps_Between_Residual_Learning_Recurrent_Neural_Networks_and_Visual_Cortex","313725451_Generalization_of_backpropagation_to_recurrent_and_higher_order_neural_networks","305998186_Smart_Reply_Automated_Response_Suggestion_for_Email","303969947_Deep_Recurrent_Models_with_Fast-Forward_Connections_for_Neural_Machine_Translatin","279714069_Long_short-term_memory_recurrent_neural_network_architectures_for_large_scale_acoustic_modeling"]}