{"id":"338747036_Machine_Learning_Algorithm_for_Predicting_Warfarin_Dose_in_Caribbean_Hispanics_Using_Pharmacogenetic_Data","abstract":"Despite some previous examples of successful application to the field of pharmacogenomics, the utility of machine learning (ML) techniques for warfarin dose predictions in Caribbean Hispanic patients has yet to be fully evaluated. This study compares seven ML methods to predict warfarin dosing in Caribbean Hispanics. This is a secondary analysis of genetic and non-genetic clinical data from 190 cardiovascular Hispanic patients. Seven ML algorithms were applied to the data. Data was divided into 80 and 20% to be used as training and test sets. ML algorithms were trained with the training set to obtain the models. Model performance was determined by computing the corresponding mean absolute error (MAE) and % patients whose predicted optimal dose were within ±20% of the actual stabilization dose, and then compared between groups of patients with “normal” (i.e., > 21 but <49 mg/week), low (i.e., ≤21 mg/week, “sensitive”), and high (i.e., ≥49 mg/week, “resistant”) dose requirements. Random forest regression (RFR) significantly outperform all other methods, with a MAE of 4.73 mg/week and 80.56% of cases within ±20% of the actual stabilization dose. Among those with “normal” dose requirements, RFR performance is also better than the rest of models (MAE = 2.91 mg/week). In the “sensitive” group, support vector regression (SVR) shows superiority over the others with lower MAE of 4.79 mg/week. Finally, multivariate adaptive splines (MARS) shows the best performance in the resistant group (MAE = 7.22 mg/week) and 66.7% of predictions within ±20%. Models generated by using RFR, MARS, and SVR algorithms showed significantly better predictions of weekly warfarin dosing in the studied cohorts than other algorithms. Better performance of the ML models for patients with “normal,” “sensitive,” and “resistant” to warfarin were obtained when compared to other populations and previous statistical models.","authors":["Abiel Roche","Adalis Roman-Santiago","Roberto Feliu-Maldonado","Jovaniel Rodriguez-Maldonado"],"meta":["January 2020Frontiers in Pharmacology 10","DOI:10.3389/fphar.2019.01550"],"references":["328397544_Ensemble_of_machine_learning_algorithms_using_the_stacked_generalization_approach_to_estimate_the_warfarin_dose","325765690_Preventing_the_exacerbation_of_health_disparities_by_iatrogenic_pharmacogenomic_applications_Lessons_from_warfarin","317577683_A_global_reference_for_human_genetic_variation","317380733_Warfarin_Anticoagulation_Therapy_in_Caribbean_Hispanics_of_Puerto_Rico_A_Candidate_Gene_Association_Study","307843705_A_Novel_Admixture-Based_Pharmacogenetic_Approach_to_Refine_Warfarin_Dosing_in_Caribbean_Hispanics","330341330_Pharmacogenetics_in_Cardiovascular_Diseases","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","310606656_Classification_and_regression_trees","304007219_International_warfarin_pharmacogenetics_consortium_Estimation_of_the_warfarin_dose_with_clinical_and_pharmacogenetic_data","286179742_Pharmacogenetics_in_Cardiovascular_Diseases"]}