{"id":"338771647_Bitcoin_in_the_Scientific_Literature_-_A_Bibliometric_Study","abstract":"Since 2012, there has been growing interest in bitcoin scientific research from different fields, including computer science and engineering, economics, business and finance, law and regulatory. The purpose of this paper is to evaluate bitcoin literature based on the structures and networks of science, as a first step in the research of this new phenomenon. Analysing the growing scientific literature on bitcoin published between 2012 and 2019, we provided useful insights on academic research in this field regarding publication year, type and category, authors, journals and citations. The source of the 887 documents which support the study was Web of Science Core Collection. Using VOSviewer software we have designed bibliometric maps based on text and bibliographic data. Our study provides a knowledge area map that identifies and evaluates the links between authors and countries distribution, the conceptual structure of the field, the structure and connections of most cited papers and journals. Resuming our findings, we note a concentration of the interest on some keywords (bitcoin, cryptocurrency, blockchain) and on some influential authors (with more than 100 citations per article). As a pure expression of digital economy, the research on bitcoin as an economic concept counts only 33.5% from the total contributions in the field.","authors":["Ramona Orastean","Silvia Cristina Marginean","Raluca Sava"],"meta":["December 2019Studies in Business and Economics 14(3):160-174","DOI:10.2478/sbe-2019-0051"],"references":["333720980_A_bibliometric_analysis_of_Bitcoin_scientific_production","333388187_Sex_Drugs_and_Bitcoin_How_Much_Illegal_Activity_Is_Financed_through_Cryptocurrencies","331827888_Modelling_the_dynamics_of_Bitcoin_and_Litecoin_GARCH_versus_stochastic_volatility_models","328862703_Does_twitter_predict_Bitcoin","324475648_The_inefficiency_of_Bitcoin_revisited_A_high-frequency_analysis_with_alternative_currencies","323999700_Portfolio_Diversification_with_Virtual_Currency_Evidence_from_Bitcoin","323974620_Bitcoin_returns_and_transaction_activity","323647234_Bitcoin_research_across_disciplines","323283221_What_causes_the_attention_of_Bitcoin","322923160_Price_discovery_of_cryptocurrencies_Bitcoin_and_beyond"]}