{"id":"338742572_Picture_Me_Drinking_Alcohol-Related_Posts_by_Instagram_Influencers_Popular_Among_Adolescents_and_Young_Adults","abstract":"Research has shown that young people post a lot of alcohol-related posts (i.e., alcoholposts) on social media and these posts have been shown to increase drinking behaviors. Because social influencers (i.e., individuals with the potential to influence large audiences on social media) may have a strong influence on young people, it is important to know whether and how often they post about alcohol. Furthermore, because by using influencers alcohol brands may have found a way to circumvent regulations that prohibit advertising for minors, it is important to understand whether alcohol brands are visible in influencers’ posts and whether influencers use disclosures (e.g., “#ad”) to notify viewers. In a content analysis of Instagram posts of 178 popular influencers, we investigated: (1) how many and how often influencers post about alcohol, (2) what type of influencers post about alcohol, (3) what the characteristics of influencers’ alcoholposts are, and (4) to what extent these alcoholposts are commercialized (e.g., by showing brands and sponsorship disclosures). Results showed four main findings. (1) The majority of influencers (i.e., 63.5%) posted about alcohol recently. (2) Alcoholposts were positive, showed a social context, and were mostly posted by lifestyle influencers. (3) Although a fair amount of alcoholposts (19.5%) showed a clear alcohol brand, only a few of these posts disclosed this as an advertisement, and even fewer gave an educational slogan (i.e., “#no18noalcohol”). (4) Posts with sponsorship disclosures yielded fewer likes and comments than posts without such disclosures. A post hoc additional study that focused solely on minors confirmed these conclusions. These findings suggest that there is a lot to be concerned about in this context, especially since many minors can be exposed to influencers’ alcoholposts, potentially leading to increased drinking among this vulnerable age group. We therefore advice future researchers to further investigate this topic, and propose that legislation for alcohol advertising needs to be adjusted to account for the context of social networking sites.","authors":["Hanneke Hendriks","Danii Wilmsen","Wim van Dalen","Winifred A Gebhardt"],"meta":["January 2020Frontiers in Psychology 10:2991","DOI:10.3389/fpsyg.2019.02991","Project: social media and health behavior"],"references":["334206564_A_cross-cultural_comparison_of_the_processes_underlying_the_associations_between_sharing_of_and_exposure_to_alcohol_references_and_drinking_intentions","331508787_Social_Media_Influencer_Marketing_and_Children's_Food_Intake_A_Randomized_Trial","328620597_Influencer_Marketing_How_Message_Value_and_Credibility_Affect_Consumer_Trust_of_Branded_Content_on_Social_Media","326333327_Alcoholposts_on_Social_Networking_Sites_The_Alcoholpost-Typology","325040103_Social_drinking_on_social_media_A_content_analysis_of_the_social_aspects_of_alcohol-related_posts_on_Facebook_and_Instagram_Preprint","317923124_Alcohol-Related_Posts_from_Young_People_on_Social_Networking_Sites_Content_and_Motivations","335916168_The_effects_of_the_standardized_instagram_disclosure_for_micro-_and_meso-influencers","325304592_Meta-Analysis_of_the_Association_of_Alcohol-Related_Social_Media_Use_with_Alcohol_Consumption_and_Alcohol-Related_Problems_in_Adolescents_and_Young_Adults","316026901_'I_Guess_A_Lot_of_People_See_Me_as_a_Big_Sister_or_a_Friend'_the_role_of_intimacy_in_the_celebrification_of_beauty_vloggers","313889424_Self-Reported_Youth_and_Adult_Exposure_to_Alcohol_Marketing_in_Traditional_and_Digital_Media_Results_of_a_Pilot_Survey"]}