{"id":"338770849_Classification_and_Morphological_Analysis_of_Vector_Mosquitoes_using_Deep_Convolutional_Neural_Networks","abstract":"Image-based automatic classification of vector mosquitoes has been investigated for decades for its practical applications such as early detection of potential mosquitoes-borne diseases. However, the classification accuracy of previous approaches has never been close to human experts’ and often images of mosquitoes with certain postures and body parts, such as flatbed wings, are required to achieve good classification performance. Deep convolutional neural networks (DCNNs) are state-of-the-art approach to extracting visual features and classifying objects, and, hence, there exists great interest in applying DCNNs for the classification of vector mosquitoes from easy-to-acquire images. In this study, we investigated the capability of state-of-the-art deep learning models in classifying mosquito species having high inter-species similarity and intra-species variations. Since no off-the-shelf dataset was available capturing the variability of typical field-captured mosquitoes, we constructed a dataset with about 3,600 images of 8 mosquito species with various postures and deformation conditions. To further address data scarcity problems, we investigated the feasibility of transferring general features learned from generic dataset to the mosquito classification. Our result demonstrated that more than 97% classification accuracy can be achieved by fine-tuning general features if proper data augmentation techniques are applied together. Further, we analyzed how this high classification accuracy can be achieved by visualizing discriminative regions used by deep learning models. Our results showed that deep learning models exploit morphological features similar to those used by human experts.","authors":["Junyoung Park","Dong-In Kim","Byoungjo Choi","Woochul Kang"],"meta":["January 2020Scientific Reports 10(1):1012","DOI:10.1038/s41598-020-57875-1"],"references":["339129398_Rotation_invariant_descriptors_for_galaxy_morphological_classification","329750378_Comparison_of_Deep_Transfer_Learning_Strategies_for_Digital_Pathology","316896342_Potential_of_a_Northern_Population_of_Aedes_vexans_Diptera_Culicidae_to_Transmit_Zika_Virus","329391971_Mosquito_wingbeat_analysis_and_classification_using_deep_learning","322058942_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770334_Deep_Compression_Compressing_Deep_Neural_Networks_with_Pruning_Trained_Quantization_and_Huffman_Coding","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770006_Learning_Deep_Features_for_Discriminative_Localization","312460515_Automated_identification_of_live_moths_Macrolepidoptera_using_digital_automated_identification_system_DAISY"]}