{"id":"338733173_Problems_of_Creation_and_Usage_of_3D_Model_of_Structures_and_Theirs_Possible_Solution","abstract":"This article describes problems that occur when creating three-dimensional (3D) building models. The first problem is geometric accuracy; the next is the quality of visualization of the resulting model. The main cause of this situation is that current Computer-Aided Design (CAD) software does not have sufficient means to precision mapping the measured data of a given object in field. Therefore the process of 3D model creation is mainly a relatively high proportion of manual work when connecting individual points, approximating curves and surfaces, or laying textures on surfaces. In some cases, it is necessary to generalize the model in the CAD system, which degrades the accuracy and quality of field data. The article analyzes these problems and then recommends several variants for their solution. There are described two basic methods: using topological codes in the list of coordinates points and creating new special CAD features while using Python scripts. These problems are demonstrated on examples of 3D models in practice. These are mainly historical buildings in different locations and different designs (brick or wooden structures). These are four sacral buildings in the Czech Republic (CR): the church of saints Johns of Brno-Bystrc, the Church of St. Paraskiva in Blansko, further the Strejc’s Church in Židlochovice, and Church of St. Peter in Alcantara in Karviná city. All of the buildings were geodetically surveyed by terrestrial method while using total station. The 3D model was created in both cases in the program AUTOCAD v. 18 and MicroStation.","authors":["Dalibor Bartoněk","Michal Buday"],"meta":["January 2020Symmetry 12(1):181","DOI:10.3390/sym12010181"],"references":["326476306_A_Salience_Measure_for_3D_Shape_Decomposition_and_Sub-parts_Classification","264006092_Design_and_implementation_of_an_integrated_surface_texture_information_system_for_design_manufacture_and_measurement","334734746_AUTOMATIC_CREATION_OF_FIELD_SURVEY_SKETCH_BY_USING_OF_TOPOLOGICAL_CODES","333535397_A_digital_construction_framework_integrating_building_information_modeling_and_reverse_engineering_technologies_for_renovation_projects","325501636_Reverse_engineering_techniques_to_optimize_facility_location_of_satellite_ground_stations_on_building_roofs","324947533_Obtaining_as-built_models_of_manufacturing_plants_from_point_clouds","321121859_Visualizing_Dynamic_Gene_Interactions_to_Reverse_Engineer_Gene_Regulatory_Networks_Using_Topological_Data_Analysis","311698089_A_study_on_scan_data_matching_for_reverse_engineering_of_pipes_in_plant_construction","300077394_3D_reconstruction_with_fisheye_images_strategies_to_survey_complex_heritage_buildings","289790961_Study_on_reverse_engineering_of_historical_architecture_in_timisoara_based_on_3d_laser_point_technologies"]}