{"id":"338717237_Predicting_Academic_Success_in_Higher_Education_Literature_Review_and_Best_Practices","abstract":"Student success plays a vital role in educational institutions, as it is often used as a metric for the institution’s performance. Early detection of students at risk, along with preventive measures, can drastically improve their success. Lately, machine learning techniques have been extensively used for prediction purpose. While there is a plethora of success stories in the literature, these techniques are mainly accessible to “computer science”, or more precisely, “artificial intelligence” literate educators. Indeed, the effective and efficient application of data mining methods entail many decisions, ranging from how to define student’s success, through which student attributes to focus on, up to which machine learning method is more appropriate to the given problem. This study aims to provide a step-by-step set of guidelines for educators willing to apply data mining techniques to predict student success. For this, the literature has been reviewed, and the state-of-the-art has been compiled into a systematic process, where possible decisions and parameters are comprehensively covered and explained along with arguments. This study will provide to educators an easier access to data mining techniques, enabling all the potential of their application to the field of education.","authors":["Eyman Alyahyan","Dilek Dustegor"],"meta":["January 2020","DOI:10.1186/s41239-020-0177-7","Project: Predicting undergraduate students' Success in a Saudi University Using Data Mining Techniques"],"references":["336846972_Systematic_review_of_research_on_artificial_intelligence_applications_in_higher_education_-where_are_the_educators","331369872_The_impact_of_engineering_students'_performance_in_the_first_three_years_on_their_graduation_result_using_educational_data_mining","329632061_Predicting_Student_Drop-Out_Rates_Using_Data_Mining_Techniques_A_Case_Study_First_IEEE_Colombian_Conference_ColCACI_2018_Medellin_Colombia_May_16-18_2018_Revised_Selected_Papers","329365939_Data_mining_approach_to_predicting_the_performance_of_first_year_student_in_a_university_using_the_admission_requirements","336819293_Data_Mining_Concepts_Models_Methods_and_Algorithms","331680053_Applying_Predictive_Analytics_Finding_Value_in_Data","330473333_A_Survey_on_Privacy_Preserving_Association_Rule_Mining","329394370_Predicting_student_satisfaction_and_perceived_learning_within_online_learning_environments","329394210_Exploring_the_influences_of_MOOC_design_features_on_student_performance_and_persistence","327820955_Comparative_Study_of_Prediction_Models_for_Final_GPA_Score_A_Case_Study_of_Rajabhat_Rajanagarindra_University"]}