{"id":"338734307_A_Systematic_Literature_Review_Paper_on_Online_Medical_Mobile_Applications_in_Malaysia","abstract":"p class=\"0abstract\"> Abstract— The introduction of mobile devices to the worldwide market has marvelous possible to disturb the way Health care is providing. In this paper, we will overview the work done in the five years from 2014 to 2018 in the field of mHealth in Research perspective. For that purpose, we choose the Scopus database to review the past research published on mHealth in Malaysia. For that purpose, the quantitative review has been observed in bibliometric analysis and a Qualitative review is done through systematic review in the order through PRISMA (Preferred Reporting Items for Systematic Review and Meta-Analysis). After the selection of 58 papers, the process based on the different steps. In the first step, the corresponding to Microsoft excels in a descriptive analysis of the published literature on mobile Healthcare in the field of online Healthcare like the distribution of the year, distribution of subjects and distribution of the author. Quantitative studies are 15 in number collected from the past literature, the researcher used the quantitative method for measuring the results Quantitative research collects data that will be processed to understand the indicators, overall trends, and requirements of the market. The qualitative studies collected from past research were 27 in numbers, collected studies were processed on the excel sheet to find out the areas discussed in the past. Traditional Health Care of Malaysia is top of the list in the world, but the mHealth still needs to improve in the region. Past studies in the mHealth are discussing physical health and wearable devices in detail with connectivity to smartphones but serious diseases are cover in very some studies. Like diabetes and HIV apps and patient are not highlighted in the collected data. Patient record management and coordination with families are also part of some research studies and that is very important for recovery in some cases.</p","authors":["Nohman Khan","Muhammad Imran Qureshi","Ishamuddin Bin Mustapha","Sobia Irum"],"meta":["January 2020International Journal of Online and Biomedical Engineering (iJOE) 16(01):63","DOI:10.3991/ijoe.v16i01.12263","Project: Systematic Literature review and Meta Analysis"],"references":["344962678_Personality_and_academic_performance_among_graduate_students","335166790_Applying_managerial_competencies_to_overcome_business_constraints_and_create_values_Evidence_from_small_technology-based_firms_in_Malaysia","335076765_Modeling_Work_Practices_under_Socio-Technical_Systems_for_Sustainable_Manufacturing_Performance","334382398_Mobile_health_applications_for_atrial_fibrillation_A_readability_and_quality_assessment","332338579_A_Readability_Analysis_of_Online_Cardiovascular_Disease-Related_Health_Education_Materials","331493279_What_Happens_after_the_Rare_Earth_Crisis_A_Systematic_Literature_Review","330331183_WhatsApp_in_hospital_An_empirical_investigation_of_individual_and_organizational_determinants_to_use","329686909_Mobile_Health_Applications_in_Weight_Management_A_Systematic_Literature_Review","338970178_Factors_influencing_the_adoption_of_mHealth_services_in_a_developing_country_A_patient-centric_study","328035675_Use_of_eHealth_and_mHealth_technology_by_persons_with_multiple_sclerosis"]}