{"id":"338724588_Mapping_the_scattered_field_of_research_on_higher_education_A_correlated_topic_model_of_17000_articles_1991-2018","abstract":"Parallel to the increasing level of maturity of the field of research on higher education, an increasing number of scholarly works aims at synthesising and presenting overviews of the field. We identify three important pitfalls these previous studies struggle with, i.e. a limited scope, a lack of a content-related analysis, and/or a lack of an inductive approach. We take these limitations into account by analysing the abstracts of 16,928 articles on higher education between 1991 and 2018. To investigate this huge collection of texts, we apply topic models, which are a collection of automatic content analysis methods that allow to map the structure of large text data. After an in-depth discussion of the topics differentiated by our model, we study how these topics have evolved over time. In addition, we analyse which topics tend to co-occur in articles. This reveals remarkable gaps in the literature which provides interesting opportunities for future research. Furthermore, our analysis corroborates the claim that the field of research on higher education consists of isolated ‘islands’. Importantly, we find that these islands drift further apart because of a trend of specialisation. This is a bleak finding, suggesting the (further) disintegration of our field.","authors":["Stijn Daenekindt","Jeroen Huisman"],"meta":["September 2020Higher Education 80(516)","DOI:10.1007/s10734-020-00500-x"],"references":["336919943_stm_An_R_Package_for_Structural_Topic_Models","324417501_Trends_in_Contemporary_Art_Discourse_Using_Topic_Models_to_Analyze_25_years_of_Professional_Art_Criticism","324359976_Understanding_the_Limiting_Factors_of_Topic_Modeling_via_Posterior_Contraction_Analysis","322705095_The_research_agenda_setting_of_higher_education_researchers","326070613_Navigating_the_local_modes_of_big_data_The_case_of_topic_models","324395616_Perspectives_on_Higher_Education_Eight_Disciplinary_and_Comparative_Views","320449873_Higher_education_journals_their_characteristics_and_contribution","318519102_Perspectives_on_Higher_Education_Eight_Disciplinary_and_Comparative_Views","317152105_Two_Decades_of_Research_Into_the_Internationalization_of_Higher_Education_Major_Themes_in_the_Journal_of_Studies_in_International_Education_1997-2016","314463550_To_Apply_or_Not_to_Apply_FAFSA_Completion_and_Financial_Aid_Gaps"]}