{"id":"338815969_Adaptive_Fuzzy_Map_Approach_for_Accruing_Velocity_of_Big_Data_Relies_on_Fireflies_Algorithm_for_Decentralized_Decision_Making","abstract":"Velocity and volume are two important factors that affect the accuracy of streaming data during the transfer process in Big data applications. This paper presents an Adaptive Fuzzy Map Approach that Relies on Fireflies Algorithm for Accruing Velocity of Big Data and Decentralized Decision Making. A key advantage of the Firefly algorithm is the providing of a small number of iterations comparing to the other methods, which minimize the execution time. Furthermore, the Firefly algorithm is significant to the fuzzy logic system to get its inputs. In addition to the Firefly algorithm, Kalman filter is used to scale the distances of Big data datasets, where it generates output by assigning the match and mismatch. This work used a real dataset to extract variables and values through fuzzification function and be able to coexist as categorical data. After 10 dependent runs that are dealing with certain parameters to be available on aspects of velocity and volume of Big data existing in two parameters Goal and Dimension, the meaningful aspect scale by minimizes the randomness parameter by approximately 1.6%. The other aspect is decision making that is gained through exploration and exploitation that is covered by attraction base and attraction_min parameters. The evaluation has been made by making a comparison between the proposed Adaptive Fuzzy Map Approach and ANOVA model based on the variables like travelled time, road, speed, and distance, which showed clear enhancement produced by the proposed Adaptive Fuzzy Map Approach in terms of the accruing velocity of Big Data.","authors":["Aysh Alhroob","Wael AL-zyadat","Ikhlas Almukahel","Ghaith M. Jaradat"],"meta":["January 2020IEEE Access 8:1-1","DOI:10.1109/ACCESS.2020.2969204","Project: Big Data coherence with KDD"],"references":["333567740_A_dynamic_data_classification_techniques_and_tools_for_big_data","332763887_FUZZY_MAP_APPROACH_FOR_ACCRUING_VELOCITY_OF_BIG_DATA","331406472_Finding_Plausible_Optimal_Solutions_in_Engineering_Problems_Using_an_Adaptive_Genetic_Algorithm","319055911_Big_data_analytics_architecture_for_real-time_traffic_control","317719619_Extremely_High-dimensional_Optimization_with_MapReduce_Scaling_Functions_and_Algorithm","295134268_Big_Data_Management_Challenges_Approaches_Tools_and_their_limitations","332035004_A_novel_firefly_algorithm_based_load_balancing_approach_for_cloud_computing","327171611_Social_Media_Big_Data_Analytics_A_Survey","320370595_Big_Data_Tutorial_and_Guidelines_on_Information_and_Process_Fusion_for_Analytics_Algorithms_with_MapReduce","305675504_FARW_Firefly_algorithm_for_Routing_in_wireless_sensor_networks"]}