{"id":"338854661_Image_Processing_and_Analysis_in_Health_Advantages_Challenges_Threats_and_Examples","abstract":"With the rapid development of technology, new methods and techniques have begun to provide many services. As these developments afford convenience in many ways, they have become an indispensable part of daily life. In addition, these developments have brought a different perspective to research and development activities. The healthcare sector has also been affected due to the use of new devices and methods. In particular, the development of information systems in digitalization and advancement in imaging technologies has paved the way for more frequent use of computer-based methods in healthcare. The most important advantages of these techniques are saving time and cost, creating new opportunities for diagnosis, and providing different opportunities in the treatment process. One of the methods used in healthcare services is the image processing technique, which is a method used in computer sciences. Image processing is defined as computer studies being carried out to obtain information from digital image data in a digital environment according to the targeted situation, which can be applied in many fields in healthcare services. In this research, relevant studies in the literature have been summarized to give an overview about image processing techniques, which have a wide application area from ophthalmology to radiology. For this purpose, contributions, challenges, and threats of image processing to healthcare services have been discussed and examples from the literature have been cited. Finally, some suggestions have been given after considering the studies in the literature and the technological changes that may occur in future. ÖZ Teknolojinin hızla gelişmesiyle birlikte yeni birçok yöntem ve teknik insanlığın hizmetine sunulmaya başlamıştır. Bu gelişmeler yaşamın pek çok alanında kolaylıklar sağladığından, günlük hayatın vazgeçilmez bir parçası haline gelmiştir. Ayrıca bu gelişmeler, araştırma ve geliştirme faaliyetlerine de farklı bir bakış açısı kazandırmıştır. Sağlık sektörü de bu gelişmelerden oldukça etkilenmiş ve bu durum sağlık hizmetlerinde yeni cihaz ve yöntemlerin kullanılmasını sağlamıştır. Özellikle dijitalleşme ile gelen bilgi sistemlerindeki gelişme ve görüntüleme teknolojile-rindeki ilerleme, bilgisayar temelli yöntemlerin sağlık hizmetlerinde daha sık kullanımının önünü açmıştır. Bu tekniklerin en önemli özellikleri ise zaman ve maliyet tasarrufu sağlama, teşhis koymak için yeni fırsatlar yaratma ve tedavilerde farklı fırsatlar sunma olarak özetlenebilir. Sağlık hizmetlerinde kullanılmaya başlanan bu yöntemlerden biri bilgisayar bilimlerinde kullanılan yöntemlerden olan görüntü işleme tekniğidir. Dijital ortamda bulunan sayısal görüntü verilerinden hedeflenen duruma uygun şekilde bilgi almak için yapılan bilgisayar çalışmaları olarak tanımlanan görüntü işleme, sağlık hizmetlerinde birçok konuda uygulanabilen bir tekniktir. Bu çalışmada, göz hastalıklarından radyolojiye kadar birçok alan-da kullanılan görüntü işleme tekniği ile yapılan çalışmalara genel bir bakış açışı ortaya koymak amaçlanmıştır. Bu amaçla literatürdeki çalışmalar özetlenmiş, görüntü işlemenin sağlık hizmetlerine olan katkıları, zorlukları ve tehditleri tartışılmış ve literatürden uygulamaya ilişkin örnekler verilmiştir. Çalışma sonucunda literatürde yapılan çalışmalar ve gelecekte ortaya çıkabilecek teknolojik değişimler göz önünde bulundurularak öneriler getirilmiştir.","authors":["Özgür İnce","Ilhan Kerem Senel","Faruk Yılmaz"],"meta":["February 2020","DOI:10.5152/ArcHealthSciRes.2020.535808"],"references":["331697603_Goruntu_Isleme_ve_Analizinin_Tipta_Kullanimi_ve_Bir_Uygulama","329380035_Scanning_the_Future_of_Medical_Imaging","322863015_Goruntu_Isleme_Teknikleri_ve_Kumeleme_Yontemleri_Kullanilarak_Findik_Meyvesinin_Tespit_ve_Siniflandirilmasi","322553198_Goruntu_Analizi_Yontemlerinin_Geoteknik_Muhendisliginde_Kullanimi","322525105_Advancements_of_Image_Processing_and_Vision_in_Healthcare","322234922_History_of_Artificial_Intelligence","320921011_Medical_Image_Processing-An_Introduction","322214442_Lesion_detection_from_the_mammography_image_using_the_Vision_Development_Module","321059766_Deep_Learning_for_Medical_Image_Processing_Overview_Challenges_and_the_Future","318115139_Investigation_of_transfer_learning_on_pulmonary_nodule_characteristics"]}