{"id":"338800924_Analysis_of_the_Thematic_Overlap_Between_Library_and_Information_Science_and_Other_Subdisciplines_of_the_Social_Communication_and_Media_Sciences_in_Poland","abstract":"Purpose/Thesis: The recent decision to join three previously separate disciplines – library and information science, media studies, and cognition and social communication science, into a single discipline of social communication and media sciences prompted the author to investigate if joining of these disciplines according to the compulsory categorization published by the OECD, is supported by an overlap in their fields of research, or by a similarity in their methods of conducting it.Approach/Methods: An analysis of the review articles devoted to the research fields of all three disciplines, and of the information regarding the research interests of the journals affiliated with them, as published on the journals’ websites, allowed the author to establish their thematic scope. The results of this analysis were compared with bibliographic data and sets of keywords found in the affiliated journals. The comparison relied on an analysis of citations, and of coexistence of specialized terms.Results and conclusions: The analysis of the review articles suggested that the basic research fields of library and information science and of the media studies and cognition and social communication science are aligned and complement each other. This conclusion was further supported by the analysis of the guidelines for the potential contributors provided on the websites of the investigated journals. However, the analysis of the bibliographic data and of the keyword sets gave an entirely different idea of the relation between the studied disciplines, indicating that there is no significant thematic overlap between them. Nevertheless, this might be due to the quality of this particular data sample, and to the methods’ susceptibility to data disruption.Originality/Value: The article proves that there is an overlap between library and information science, and the social communication and media sciences. Furthermore, it shows the limits of the citation method and of the specialized terms coexistence method, resulting from the practices of the authors and the editorial teams of some of the journals discussed. The article shows that all quantitative studies of the state of scholarship in a given discipline in Poland must be conducted with great care, and their results should not be the only basis for conclusions.","authors":["Zbigniew Osiński"],"meta":["December 2019Zagadnienia Informacji Naukowej - Studia Informacyjne 57(2a)","DOI:10.36702/zin.468"],"references":["326007010_Coverage_of_highly-cited_documents_in_Google_Scholar_Web_of_Science_and_Scopus_a_multidisciplinary_comparison","317066696_Indicators_as_judgment_devices_An_empirical_study_of_citizen_bibliometrics_in_research_evaluation","347882222_Status_teoretyczny_nauk_o_mediach_-_kilka_uwag_do_dyskusji","329857979_Komunikowanie_spoleczne_i_media_-_federacja_a_nie_inkorporacja","326856138_Information_infrastructure_of_contemporary_humanities_and_the_digital_humanities_development_as_a_cause_of_creating_new_information_barriers_A_Polish_case","326005677_Examining_interdisciplinarity_of_library_and_information_science_LIS_based_on_LIS_articles_contributed_by_non-LIS_authors","324664316_To_What_Extent_is_Inclusion_in_the_Web_of_Science_an_Indicator_of_Journal_'Quality'","321012318_Use_of_locality_sensitive_hashing_LSH_algorithm_to_match_Web_of_Science_and_Scopus","318159893_Mapping_the_evolution_of_library_and_information_science_1978-2014_using_topic_modeling_on_LISA","309208757_Kulturowo-obiektywne_istnienie_procesu_komunikacji_jako_warunek_projektowania_autonomicznej_dyscypliny_komunikacji"]}