{"id":"338871124_Exploring_Technology_Evolution_Pathways_to_Facilitate_Technology_Management_From_a_Technology_Life_Cycle_Perspective","abstract":"Technological innovation is a dynamic process that spans the life cycle of an idea, from scientific research to production. Within this process, there are often a few key innovations that significantly impact a technology's development, and the ability to identify and trace the development of these key innovations comes with a great payoff for researchers and technology managers. In this article, we present a framework for identifying the technology's main evolutionary pathway. What is unique about this framework is that we introduce new indicators that reflect the connectivity and the modularity in the interior citation network to distinguish between the stages of a technology's development. We also show how information about a family of patents can be used to build a comprehensive patent citation network. Finally, we apply integrated approaches of main path analysis (MPA)—namely global MPA and global key-route main analysis—for extracting technological trajectories at different technological stages. We illustrate this approach with dye-sensitized solar cells (DSSCs), a low-cost solar cell belonging to the group of thin-film solar cells, contributing to the remarkable growth in the renewable energy industry. The results show how this approach can trace the main development trajectory of a research field and distinguish key technologies to help decision makers manage the technological stages of their innovation processes more effectively.","authors":["Ying Huang","Fujin Zhu","Alan L. Porter","Yi Zhang"],"meta":["January 2020IEEE Transactions on Engineering Management PP(99):1-13","DOI:10.1109/TEM.2020.2966171","Project: forecasting innovation pathways"],"references":["331338109_A_few_notes_on_main_path_analysis","313460552_A_hybrid_method_to_trace_technology_evolution_pathways_a_case_study_of_3D_printing","307169683_Tracing_Technological_Development_Trajectories_A_Genetic_Knowledge_Persistence-Based_Main_Path_Approach","336231304_Patent_Main_Path_Analysis_with_Arc_Weights_Adjusted_by_Classification_Similarity","329134891_An_assessment_of_technology_forecasting_Revisiting_earlier_analyses_on_dye-sensitized_solar_cells_DSSCs","319098135_International_Investment_and_International_Trade_in_the_Product_Cycle","312610193_A_low-cost_high-efficiency_solar_cell_based_on_dye-sensitized_colloidal_TiO2_films","312325953_Exploring_Technology_evolution_pathways_to_facilitate_Technology_management_A_study_of_Dye-sensitized_solar_cells_DSSCs","309023610_To_include_or_not_the_role_of_review_papers_in_citation-based_analysis","304029978_Patterns_of_technology_life_cycles_stochastic_analysis_based_on_patent_citations"]}