{"id":"338813302_A_Wearable_and_Wirelessly_Powered_System_for_Multiple_Finger_Tracking","abstract":"A wearable system that is capable of tracking finger motion and recognizing a set of hand gestures is presented. Two tracking units are worn on two fingers and are wirelessly powered without using cables or batteries, thus enhancing freedom of movement. The system is comprised by two sections: a measurement section and a wireless power transfer apparatus. The measurement section consists of two measuring devices, placed on the thumb and index fingers. Each of these units can acquire and transmit sensor signals obtained from a stretch sensor and an inertial measurement unit. Furthermore, the wireless power transfer apparatus is implemented by means of inductively coupled resonant circuits. A relay-resonator configuration is employed, to provide a homogeneous magnetic field in the operating volume of the system. A prototype of the developed system is characterized by experimental tests. Results show that the proposed approach is feasible. The measuring system can track finger movement with a sample rate of 30 Hz and recognize six predefined gestures, used to control a robotic arm. The wireless power transfer apparatus demonstrates the capability of transferring 110 mW, necessary to power the measurement section, within an operating volume of 25x20x15 cm.","authors":["Paolo Bellitti","Alessio De Angelis","Marco Dionigi","Emilio Sardini"],"meta":["January 2020IEEE Transactions on Instrumentation and Measurement PP(99):1-1","DOI:10.1109/TIM.2020.2969089"],"references":["323057025_Multi-sensor_based_glove_control_of_an_industrial_mobile_robot_arm","317129463_ARMatron_-_A_wearable_gesture_recognition_glove_For_control_of_robotic_devices_in_disaster_management_and_human_Rehabilitation","344876631_Real-Time_Hand_Gesture_Detection_and_Recognition_Using_Bag-of-Features_and_Support_Vector_Machine_Techniques","335719174_Development_of_a_Wirelessly-Powered_Wearable_System_for_Finger_Tracking","329853886_Calibration_and_Characterization_of_a_Magnetic_Positioning_System_Using_a_Robotic_Arm","325079518_Wireless_Power_Transfer_-_An_Overview","323157422_Noncontact_Human-Machine_Interface_With_Planar_Probing_Coils_in_a_Differential_Sensing_Architecture","322276986_Tilt_sensing_using_a_three-axis_accelerometer","321821246_An_integrated_approach_for_industrial_robot_control_and_programming_combining_haptic_and_non-haptic_gestures","319283545_3D_human_gesture_capturing_and_recognition_by_the_IMMU-based_data_glove"]}