{"id":"338803967_Multi-Trip_Time-Dependent_Vehicle_Routing_Problem_with_Soft_Time_Windows_and_Overtime_Constraints","abstract":"The multi-trip time-dependent vehicle routing problem with soft time windows and overtime constraints (MT-TDVRPSTW-OT) is considered in this paper. The modified hierarchical multi-objective formulation and the equivalent single-objective formulation are proposed. The iterative multi-trip tour construction and improvement (IMTTCI) procedure and the single-trip tour counterpart procedure with post-processing greedy heuristic (ISTTCI-GH) are proposed to solve the problem. These procedures are based on the ruin and recreate principle, and consider trade-offs among cost components (vehicle usage, number of early/late soft time window occurrences, transport distance, transport time, overtime and early/late soft time window penalty costs) in the search process. From the computational experiment, the IMTTCI procedure outperforms the existing efficient insertion heuristic with 42.09% improvement in number of vehicles and 24.30% improvement in travel time for the constant-speed multi-trip vehicle routing problem with hard time windows and shift time limits, a special case of MT-TDVRPSTW-OT problem, on all problem instances. For the MT-TDVRPSTW-OT problem, the ISTTCI-GH and the IMTTCI outperform the ISTTCI on all problem groups by 43.21% and 69.44% in the number of vehicles (the primary objective), respectively. The IMTTCI outperforms the ISTTCI-GH in number of vehicles by 51.07%, but takes 42.83% longer CPU time than the ISTTCI-GH. The performance of IMTTCI in terms of the primary objective improves with the increase of mean speed as well as the increase of time window width and planning horizon across all customer configuration types, tighter/looser time windows, shorter/longer planning horizon and various time-dependent travel speed profiles. The sensitivity analysis of different problem parameters is performed. The complexity analysis of the proposed procedures shows that the proposed procedures are solvable in polynomial time, and from the computational results the relationships between the CPU time and problem size confirm this. For the MT-VRPSTW-OT, a mixed integer program and the special case of MT-TDVRPSTW-OT, on 12-customer instances, the proposed IMTTCI algorithm yields the average optimality gap of 1.35% with the average CPU time of 0.66 seconds, whereas the GAMS/CPLEX solver yields the average optimality gap of 0.83% with the average CPU time of 256.39 seconds. The proposed IMTTCI algorithm yields only 0.52% greater optimality gap but 388 times faster CPU time than the commercial solver.","authors":["Ampol Karoonsoontawong","Puntipa Punyim","Wanvara Nueangnitnaraporn","Vatanavongs Ratanavaraha"],"meta":["June 2020Networks and Spatial Economics 20(5)","DOI:10.1007/s11067-019-09492-3"],"references":["326181211_Ant_Colony_System_for_Dynamic_Vehicle_Routing_Problem_with_Overtime","320718491_Efficient_Insertion_Heuristic_Algorithms_for_Multi-Trip_Inventory_Routing_Problem_with_Time_Windows_Shift_Time_Limits_and_Variable_Delivery_Time","290182461_Vehicle_routing_problems_with_multiple_trips","287996437_Efficient_Insertion_Heuristics_for_Multi-Trip_Vehicle_Routing_Problem_with_Time_Windows_and_Shift_Time_Limits","287796502_The_Vehicle_Routing_Problem_State_of_the_Art_Classification_and_Review","268685945_Modified_Efficient_Insertion_Heuristics_for_Multi-Trip_Vehicle_Routing_Problem_with_Time_Windows_and_Shift_Time_Limits","302930540_Large_neighborhood_search_for_multi-trip_vehicle_routing","267308629_Rich_vehicle_routing_problems_From_a_taxonomy_to_a_definition","257551319_The_time_dependent_vehicle_routing_problem_with_time_windows_Benchmark_problems_an_efficient_solution_algorithm_and_solution_characteristics","257404170_Vehicle_routing_problem_with_time_windows_considering_overtime_and_outsourcing_vehicles","242933344_Time_Dependent_Vehicle_Routing_Problems_Formulations_Properties_and_Heuristic_Algorithms","241887110_Vehicle_routing_with_time_windows_Optimization_and_approximation","245280553_Vehicle_Routing_With_Multiple_Use_Of_Vehicles","245280290_Modelling_IntraCity_Time-Dependent_Travel_Speeds_for_Vehicle_Scheduling_Problems","245279571_Vehicle-Routeing_with_Time_Windows_and_Time-Varying_Congestion"]}