{"id":"338855427_PERFORMANCE_DES_ORGANISATIONS_PUBLIQUES_ALGERIENNES_QUELS_MODELES_DE_MANAGEMENT","abstract":"Au cours des vingt dernières années la stratégie de fonctionnement du secteur public a été modifiée en profondeur. Cette mue s'est inspirée des spécificités politiques, économiques et sociales, ce qui explique que ces changements se sont produits de manières tout à fait différentes selon plusieurs pays. Nonobstant le volet économique et social de la politique publique il demeure bien entendu qu'il existe certains points communs qui sont suffisamment importants pour les inventorier, les étudier à travers une nouvelle stratégie bien réfléchie et qui se retrouve déjà dans de nombreux secteurs de l'économie ou de l'administration locale. L'objectif général est de contribuer à l'amélioration de la qualité des prestations de services. En Algérie, l'inexistence d'un modèle de management adapté influe négativement sur tous les services et c'est ce qui crée cette méfiance et hostilité du public à l'administration. La relation services publics / usagers se détériore et s'engouffre dans une impasse dûe à l'organisation, la qualification du personnel, à l'absence de la généralisation de l'outil informatique et autres qui peuvent être impondérables. Pour la mise en place d'un management adapté au secteur public algérien, chaque entité et chaque responsable public doit remettre en question les pratiques et méthodes de travail afin d'intégrer l'esprit et les orientations des réformes voulues par les autorités compétentes qui permettent d'en faire le levier du changement ou de la modernisation dans le secteur public. Ces nouvelles approches avec leurs méthodes de travail renforcent l'apparition des concepts de nouveau management public qui tente de s'implanter dans la plupart des administrations publiques. Se mettre à l'écoute de l'usager pour mieux satisfaire ses besoins et ses attentes constitue un enjeu majeur pour le prestataire, il s'agit là d'un défi de changement de mentalité. Dans cette étude nous essayerons de chercher un modèle de management adéquat au secteur public qui répond aux inspirations de l'usager. Il est bien utile de savoir que la perception des populations sur ces dits services reste globalement négative. Le défi de taille est aussi de s'inspirer de certaines expériences positives de certains pays afin d'améliorer la qualité des services et des prestations rendues aux usagers. La mise en oeuvre d'un modèle de gestion axée sur les résultats vise à améliorer la performance du secteur public et les relations avec les usagers afin qu'ils soient plus efficaces et plus efficients.","authors":["Assia Belhouchat","Mohamed Mouloud Belaid"],"meta":["November 2018"],"references":["338833445_L'INNOVATION_AU_SEIN_DES_ADMINISTRATIONS_PUBLIQUES_EN_ALGERIE","321385168_Management_public_Gestion_et_legitimite","269818213_Le_Nouveau_Management_Public_est-il_pathogene","346636672_Gestion_integree_par_resultats_concevoir_et_gerer_autrement_la_performance_dans_l'Administration_publique","338259911_Le_Nouveau_Management_Public_Et_La_Modernisation_De_L'administration_Publique","337343691_Le_developpement_du_management_dans_les_services_publics_evolution_ou_revolution","287542277_Vers_un_management_public_ethique_et_performant","276843193_Les_partenariats_public-prive_l'avenir_du_financement_des_infrastructures","272987644_Y-a-t-il_une_specificite_du_controle_de_gestion_dans_le_secteur_public","254349580_The_New_Public_Governance","46479113_Le_A_nouveau_management_public_A_ou_New_Public_Management"]}