{"id":"338864438_ANALISE_DA_PRODUCAO_DE_TESES_E_DISSERTACOES_SOBRE_TAXONOMIAS_CORPORATIVAS_E_FACETADAS_EM_CIENCIA_DA_INFORMACAO_E_CIENCIA_DA_COMPUTACAO","abstract":"Resumo: As taxonomias permitem uma recuperação da informação mais precisa em ambiente web, uma vez que podem orientar o usuário na sua busca, direcionando a navegação por meio das classes e subclasses na estrutura do instrumento. As taxonomias são estudadas em diferentes campos do conhecimento e com distintos propósitos, e, nesta pesquisa, interessam as taxonomias corporativas (suporte para a gestão da informação e do conhecimento) e as taxonomias facetadas (estruturada em facetas, dimensões, aspectos ou atributos, que permitem ao usuário combinar e filtrar os resultados recuperados) utilizadas como ferramentas de organização da informação e do conhecimento. Após pesquisa prévia, verificou-se que, com essa função, elas são empregadas sobretudo nas áreas da Ciência da Informação - CI e na Ciência da Computação - CC. O presente estudo tem como objetivo, pesquisar analisar e identificar, a partir de quatro categorias: 1) objetivos gerais (escopo); 2) metodologia (metodologias para a construção de taxonomias); 3) trabalhos futuros (tendências das pesquisas); e 4) produto final, a incidência de teses e dissertações relacionadas ao estudo das taxonomias corporativas e facetadas na CI e na CC ao longo dos 15 últimos anos. A metodologia consistiu no levantamento bibliográfico, das teses e dissertações disponibilizadas no catálogo de teses e dissertações da CAPES, Plataforma Sucupira e a Biblioteca Digital Brasileira de Teses e Dissertações do IBICT. Os resultados apontam 17 teses e dissertações nas duas áreas, CI e CC, com uma maior incidência das taxonomias facetadas. A UFMG possui o maior número de pesquisa sobre o tema com a área da CI, sendo a que mais possui também um maior número de trabalhos publicados. Considera-se que o número de pesquisas relacionadas ao tema ainda é baixo, o que torna necessário a intensificação de estudos para a produção de conhecimento sobre o uso de taxonomias corporativas e facetadas na organização da informação e do conhecimento. \n\nPalavras-chave: Taxonomia corporativa; Taxonomia facetada; Ciência da Informação; Ciência da Computação.","authors":["Pâmela Tamires Dias Lopes","Elisangela Aganette","Benildes Coura Moreira dos Santos Maculan"],"meta":["January 2020"],"references":["324978018_Taxonomia_facetada_como_interface_para_facilitar_o_acesso_a_informacao_em_bibliotecas_digitais","262756149_Taxonomias_corporativas_um_estudo_sobre_definicoes_e_etapas_de_construcao_fundamentado_na_literatura_publicada","238770904_Tracados_e_limites_da_ciencia_da_informacao"]}