{"id":"338855639_Topology_comparison_of_Twitter_diffusion_networks_effectively_reveals_misleading_information","abstract":"In recent years, malicious information had an explosive growth in social media, with serious social and political backlashes. Recent important studies, featuring large-scale analyses, have produced deeper knowledge about this phenomenon, showing that misleading information spreads faster, deeper and more broadly than factual information on social media, where echo chambers, algorithmic and human biases play an important role in diffusion networks. Following these directions, we explore the possibility of classifying news articles circulating on social media based exclusively on a topological analysis of their diffusion networks. To this aim we collected a large dataset of diffusion networks on Twitter pertaining to news articles published on two distinct classes of sources, namely outlets that convey mainstream, reliable and objective information and those that fabricate and disseminate various kinds of misleading articles, including false news intended to harm, satire intended to make people laugh, click-bait news that may be entirely factual or rumors that are unproven. We carried out an extensive comparison of these networks using several alignment-free approaches including basic network properties, centrality measures distributions, and network distances. We accordingly evaluated to what extent these techniques allow to discriminate between the networks associated to the aforementioned news domains. Our results highlight that the communities of users spreading mainstream news, compared to those sharing misleading news, tend to shape diffusion networks with subtle yet systematic differences which might be effectively employed to identify misleading and harmful information.","authors":["Francesco Pierri","Carlo Piccardi","Stefano Ceri"],"meta":["January 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-58166-5","Project: Characterization, Detection and Resolution of Disinformation on Social Media"],"references":["339031969_INFORMATION_DISORDER_Toward_an_interdisciplinary_framework_for_research_and_policy_making_Information_Disorder_Toward_an_interdisciplinary_framework_for_research_and_policymaking","337542902_Comparing_methods_for_comparing_networks","329218472_The_spread_of_low-credibility_content_by_social_bots","324472149_An_information-theoretic_all-scales_approach_to_comparing_networks","323956688_Influence_of_fake_news_in_Twitter_during_the_2016_US_presidential_election","323694818_Fake_news_propagate_differently_from_real_news_even_at_early_stages_of_spreading","334122955_False_News_On_Social_Media_A_Data-Driven_Survey","330626092_Fake_news_on_Twitter_during_the_2016_US_presidential_election","328523303_Analyzing_the_Digital_Traces_of_Political_Manipulation_The_2016_Russian_Interference_Twitter_Campaign","324640336_Online_Misinformation_Challenges_and_Future_Directions"]}