{"id":"338849211_A_Review_of_a_Collaborative_Online_International_Learning","abstract":"Globalization has exacerbated the need for engineers who are capable of working in a cross-cultural environment. Multinational companies continuously seek for engineers who are intercultural competent and capable of conducting business successfully in a cross-cultural environment. However, the skills required to be successful in a multicultural environment are difficult to be taught in the traditional classroom. One of the most effective approaches to acquiring intercultural competence skills is through experiential learning. It is, therefore, not surprising that most colleges all over the world are devoting resources towards the internationalization of their classrooms and the campus community. This ensures that students are provided with a diverse environment so they can learn from, and about diverse cultures and develop their intercultural competence skills. Another effective approach is the study abroad programs, which require students to travel to different countries. However, these approaches require a lot of resources that may not be available to the poor and needy students. Therefore, a more cost-effective approach, such as Collaborative Online International Learning (COIL) is receiving a lot of attention in recent years. In this study, some engineering technology students participated in an 8-week long COIL program with materials engineering students from different languacultural and geographical region. This study reviews the results and compares the performance of the COIL students with those who were not involved. It was observed that the COIL teams performed significantly better on the project work.","authors":["Philip Appiah-Kubi","Ebenezer Annan"],"meta":["January 2020","DOI:10.3991/ijep.v10i1.11678"],"references":["332433096_Collaboratively_Developing_Open_Educational_Resources_for_Engineering_Educators_in_SlideWiki","327456040_When_Group_Work_Doesn't_Work_Insights_from_Students","326535656_Collaborative_Learning_in_Higher_Nursing_Education_A_Systematic_Review","323223779_Intercultural_Competence_by_International_Experiences_An_Investigation_of_the_Impact_of_Educational_Stays_Abroad_on_Intercultural_Competence_and_Its_Facets","312357159_Effectiveness_of_various_innovative_learning_methods_in_health_science_classrooms_a_meta-analysis","311492269_Collaborative_Learning_in_Higher_Education_Evoking_Positive_Interdependence","304197091_Promoting_Active_Learning_in_Electrical_Engineering_Basic_Studies","327472647_Internationalization_among_selected_HEIs_in_the_ASEAN_region_Basis_for_a_proposed_framework_for_an_internationalized_campus","321599456_Internationalizing_Higher_Education_Critical_Explorations_of_Pedagogy_and_Policy","313414675_Internationalization_A_Decade_of_Changes_and_Challenges"]}