{"id":"338846941_Motivating_Female_Students_for_Computer_Science_by_Means_of_Robot_Workshops","abstract":"As women belong to a minority in computer science, this work aims to provide possible STEM education initiatives for middle to high school students. These initiatives are designed for institutions to contribute to increasing the proportion of women in computer science by using robots. Through applying these initiatives, institutions such as computer science faculties can help to reduce the gender imbalance, increase diversity and the amount of computer science specialists, who are requested immensely. Based on the results of conducted requirements elicitation a concept for programming an application with the NAO robot which trains vocabularies, as well as a concept with the Cozmo robot which piles up cubes, were developed. First tests were performed with female and male high school students. Either concept consists of an introduction of possible robotics application fields, a presentation explaining the Python program code of the concept as well as corresponding exercises with the robot and Python. Evaluation of the workshop concepts through questionnaires showed that both concepts have the potential to increase the proportion of women and to motivate female as well as male students for computer science. Moreover, recommendations for further robotics projects with respect to motivating young women for STEM can be made based on the insights of the requirements elicitation and the evaluation of the concepts. Nevertheless, further refinement and validation has to be undertaken. Long-term as well as short-term initiatives are feasible with the developed concepts. All participating schools showed high interest in both types of initiatives and further cooperation.","authors":["Lisa Keller","Isabel John"],"meta":["January 2020","DOI:10.3991/ijep.v10i1.11661","Project: How Can Computer Science Faculties Increase the Proportion of Women in Computer Science by Using Robots?"],"references":["325403701_Online_Learning_Facilities_to_Support_Coding_and_Robotics_Courses_for_Youth","51072674_The_thing_that_should_not_be_predictive_coding_and_the_uncanny_valley_in_perceiving_human_and_humanoid_robot_actions","332963377_How_Can_Computer_Science_Faculties_Increase_the_Proportion_of_Women_in_Computer_Science_by_Using_Robots","321408750_Study_of_Motivation_of_Engineering_Students_on_Multinational_Design_Projects","309777746_Robotics_and_programming_Attracting_girls_to_technology","305719523_Robotics_for_Education","272087835_The_Uncanny_Valley","221266634_Women_And_Computing","3625964_The_role_of_experimentation_in_software_engineering_Past_current_and_future"]}