{"id":"338830662_Simulation_Strategies_for_Mixed_Traffic_Conditions_A_Review_of_Car-Following_Models_and_Simulation_Frameworks","abstract":"The area of traffic flow modelling and analysis that bridges civil engineering, computer science, and mathematics has gained significant momentum in the urban areas due to increasing vehicular population causing traffic congestion and accidents. Notably, the existence of mixed traffic conditions has been proven to be a significant contributor to road accidents and congestion. The interaction of vehicles takes place in both lateral and longitudinal directions, giving rise to a two-dimensional (2D) traffic behaviour. This behaviour contradicts with the traditional car-following (CF) or one-dimensional (1D) lane-based traffic flow. Existing one-dimensional CF models did the inclusion of lane changing and overtaking behaviour of the mixed traffic stream with specific alterations. However, these parameters cannot describe the continuous lateral manoeuvre of mixed traffic flow. This review focuses on all the significant contributions made by 2D models in evaluating the lateral and longitudinal vehicle behaviour simultaneously. The accommodation of vehicle heterogeneity into the car-following models (homogeneous traffic models) is discussed in detail, along with their shortcomings and research gaps. Also, the review of commercially existing microscopic traffic simulation frameworks built to evaluate real-world traffic scenario are presented. This review identified various vehicle parameters adopted by existing CF models and whether the current 2D traffic models developed from CF models effectively captured the vehicle behaviour in mixed traffic conditions. Findings of this study are outlined at the end.","authors":["Bhargav Naidu","Satesh Narayana Namasivayam","Mohammad Hosseini Fouladi","Khai Ching Ng"],"meta":["January 2020Journal of Engineering 2020(10):1-22","DOI:10.1155/2020/8231930","Project: Modelling of mixed traffic flow  on urban roads and development of safety standards"],"references":["353372750_Algebraic_Car-Following_Model_Parameter_Identification","334647831_Continuum_Car-following_Model_of_Capacity_Drop_at_Sag_and_Tunnel_Bottlenecks","333513496_Continuum_car-following_model_of_capacity_drop_at_sag_and_tunnel_bottlenecks","333472511_Calibration_of_microsimulation_model_for_tight_urban_diamond_interchange_under_heterogeneous_traffic","333193805_Dynamic_data_collection_of_staggered-following_behavior_in_non-lane-based_traffic_streams","330669481_Towards_an_integrated_longitudinal_and_lateral_movement_data-driven_model_for_mixed_traffic","328164095_Forecasting_of_Traffic_Simulation_Model_Under_Heterogeneous_Traffic_Condition","327815947_Modeling_Platoon_Dispersion_at_Signalized_Intersections_in_Mixed_Traffic_Scenario","333202027_Cell_Transmission_Modeling_of_Heterogeneous_Disordered_Traffic","332123354_Impact_of_heterogeneity_of_car-following_behavior_on_rear-end_crash_risk"]}