{"id":"338849234_Resource-Constrained_Innovation_Method_for_Sustainability_Application_of_Morphological_Analysis_and_TRIZ_Inventive_Principles","abstract":"Extensive research on resource-constrained innovation has been conducted by scholars and practitioners in recent years. An interesting research avenue is how firms explore the process of the new product development (NPD) and the ideas generation to foster resource-constrained innovation. However, despite the importance of product development and creative ideas under the resource-constraints contexts, innovation methods for applying to the resource-constrained innovation and designers have received comparatively less attention. As a remedy, this paper proposes a resource-constrained innovation method (RCIM) to generate ideas for the NPD. The RCIM is mainly divided into four sections: Developing the resource-constrained innovation approaches, developing the resource-constrained innovation dimensions, generating the creative ideas and evaluating the creative ideas. First, the resource-constrained innovation algorithms are developed based on success factors, characteristics, and attributes of resource-constrained innovation and the TRIZ (Teоpия Peшeния Изобpeтaтeльcкиx Зaдaч in Russian; Theory of Inventive Problem Solving in English) inventive principles via the systematic literature review (SLR). Second, the innovation dimensions are categorized to structure a target technology by means of the morphological analysis (MA) and the Derwent manual codes (DMCs) mapping based on collected patents. Third, the creative ideas are generated for the NPD by combining the innovation dimensions with the resource-constrained innovation approaches. Finally, the creative ideas are evaluated by the frugal criteria. The RCIM will stimulate designers’ creativity for achieving sustainability and innovation within constraint-based scenarios, MA and TRIZ.","authors":["Liu","Feng","Wang"],"meta":["January 2020Sustainability 12(3):917","DOI:10.3390/su12030917"],"references":["338143071_Discovering_Technology_Opportunity_by_Keyword-Based_Patent_Analysis_A_Hybrid_Approach_of_Morphology_Analysis_and_USIT","337796960_Pricing_and_Service_Level_Decisions_under_a_Sharing_Product_and_Consumers'_Variety-Seeking_Behavior","330406741_Effects_of_the_Sharing_Economy_on_Sequential_Innovation_Products","326282756_Modularity_as_a_support_for_frugal_product_and_supplier_network_co-definition_under_regional_market_constraints_a_mirroring_hypothesis_application","325462069_Frugal_innovation_beyond_emerging_countries_the_key_role_of_developed_countries","337621061_Co-Definition_of_Product_Structure_and_Production_Network_for_Frugal_Innovation_Perspectives_Towards_a_Modular-based_Approach","329333637_An_integrated_module-based_reasoning_and_axiomatic_design_approach_for_new_product_design_under_incomplete_information_environment","327484144_Modular_design_of_production_systems_tailored_to_regional_market_requirements_A_Frugal_Innovation_perspective","326882808_A_systematic_approach_for_new_technology_development_by_using_a_biomimicry-based_TRIZ_contradiction_matrix","326053099_Bibliometric_and_visualized_analysis_of_China's_coal_research_2000-2015"]}