{"id":"338808245_Physiology_education_for_intensive_care_medicine_residents_A_15-minute_interactive_peer-led_flipped_classroom_session","abstract":"Introduction: \nIn acute care medicine, knowledge of the underlying (patho)-physiology is of paramount importance. This may be especially relevant in intensive care medicine, where individual competence and proficiency greatly depend on knowledge and understanding of critical care physiology. In settings with time constraints such as intensive care units (ICUs), time allotted to education is often limited. We evaluated whether introduction of a short, interactive, peer-led flipped classroom session is feasible and can provide ICU residents with a better understanding of critical care physiology.\n\nMaterials and methods: \nUsing the flipped classroom concept, we developed a 15-minute peer-led interactive \"physiology education\" session to introduce a total of 44 residents to critical care physiology. Using a nine-item electronic survey with open questions and a five-point Likert scale, we analysed the overall concept with regard to feasibility, motivation, and subjective learning of critical care physiology.\n\nResults: \nThe overall rate of response to the survey was 70.5% (31/44). The residents reported that these sessions sparked their interest (p = 0.005, Chi square 10.52), and that discussion and interaction during these sessions had promoted their knowledge and understanding. Both novice and experienced residents reported that new knowledge was imparted (both p<0.0001, Chi-square 32.97 and 25.04, respectively).\n\nConclusions: \nIn an environment with time constraints such as the ICU, a 15-minute, interactive, peer-led flipped classroom teaching session was considered feasible and generally appeared useful for teaching critical care physiology to ICU residents. Responses to questions on questionnaires indicated that teaching sessions sparked interest and increased motivation. This approach may theoretically induce a modification in professional behaviour and promote self-directed learning. We therefore support the use of peer-led flipped classroom training sessions in the ICU. Whether these sessions result in improved ICU care should be addressed in subsequent studies.","authors":["Bjoern Zante","Wolf E Hautz","Joerg C Schefold"],"meta":["January 2020PLoS ONE 15(1):e0228257","DOI:10.1371/journal.pone.0228257"],"references":["329124821_Does_motivation_matter_-_The_relationship_between_teachers'_self-efficacy_and_enthusiasm_and_students'_performance","324510721_Serum_chloride_levels_in_critical_illness-the_hidden_story","312598533_Practical_strategies_for_increasing_efficiency_and_effectiveness_in_critical_care_education","308179944_Motivation_to_learn_an_overview_of_contemporary_theories","329418169_From_Early_Goal-Directed_Therapy_to_Later_Scvo2_Checks","327546919_How_do_students_deal_with_difficult_physiological_knowledge","323487103_Involving_a_real_patient_in_the_design_and_implementation_of_case-based_learning_to_engage_learners","317953561_Mind_in_society_The_development_of_higher_psychological_processes","317140216_A_systematic_review_of_the_effectiveness_of_flipped_classrooms_in_medical_education","315703465_Guyton's_venous_return_curves_should_be_taught_at_medical_schools_complete_English_translation_of_Japanese_version"]}