{"id":"338892910_Chromoanagenesis_A_piece_of_the_macroevolution_scenario","abstract":"Over the last decade, new types of massive and complex chromosomal rearrangements based on the chaotic shattering and restructuring of chromosomes have been identified in cancer cells as well as in patients with congenital diseases and healthy individuals. These unanticipated phenomena are named chromothripsis, chromoanasynthesis and chromoplexy, and are grouped under the term of chromoanagenesis. As mechanisms for rapid and profound genome modifications in germlines and early development, these processes can be regarded as credible pathways for genomic evolution and speciation process. Their discovery confirms the importance of genome-centric investigations to fully understand organismal evolution.\nBecause they oppose the model of progressive acquisition of driver mutations or rearrangements, these phenomena conceptually give support to the concept of macroevolution, known through the models of “Hopeful Monsters” and the “Punctuated Equilibrium”. In this review, we summarize mechanisms underlying chromoanagenesis processes and we show that numerous cases of chromosomal speciation and short-term adaptation could be correlated to chromoanagenesis-related mechanisms.\nIn the frame of a modern and integrative analysis of eukaryote evolutionary processes, it seems important to consider the unexpected chromoanagenesis phenomena.","authors":["Franck Pellestor","Vincent Gatinois"],"meta":["January 2020Molecular Cytogenetics 13(1)","DOI:10.1186/s13039-020-0470-0"],"references":["336966547_What_Is_Karyotype_Coding_and_Why_Is_Genomic_Topology_Important_for_Cancer_and_Evolution","334473225_Highly_rearranged_chromosomes_reveal_uncoupling_between_genome_topology_and_gene_expression","333581595_Augmented_manipulation_ability_in_humans_with_six-fingered_hands","333441243_Transient_multifocal_genomic_crisis_creating_chromothriptic_and_non-chromothriptic_rearrangements_in_prezygotic_testicular_germ_cells","332824737_Chromatin_three-dimensional_interactions_mediate_genetic_effects_on_gene_expression","332751583_On_the_Complexity_of_Mechanisms_and_Consequences_of_Chromothripsis_An_Update","331504356_Chromosome_segregation_errors_generate_a_diverse_spectrum_of_simple_and_complex_genomic_rearrangements","331029053_Chromoanagenesis_Cataclysms_behind_complex_chromosomal_rearrangements","329160081_The_Molecular_Origins_and_Pathophysiological_Consequences_of_Micronuclei_New_Insights_into_an_Age-old_Problem","336776608_The_Iceberg_under_Water_Unexplored_Complexity_of_Chromoanagenesis_in_Congenital_Disorders"]}