{"id":"338830335_A_Voice_to_Talk_About_it_Cosmetologists_as_STEM_Experts_in_Educational_Technology_Design_and_Implementation","abstract":"In the U.S. there are steady efforts by governmental and philanthropic organizations to increase the representation of students of colour in science, technology, engineering, and mathematics (STEM). After years of mixed results, researchers and educators have started to question one size fits all notions of broadening participation. An increasing number of projects are challenging universalist assumptions by enrolling the expertise of culturally situated communities of practice in STEM lessons and the educational technologies that support them. While this research shows promising results for improving young people’s interest and performance in STEM, there has been little research on how these lessons and technologies might also benefit the communities whose expertise were originally enrolled. This paper details the design of educational technologies that bridge STEM and African American cosmetology. We report on a mixed-methods research project, conducted with a group of predominantly African American cosmetologists. Qualitative and quantitative data were collected to study their attitudes toward STEM before and after working with the technologies. Our results suggest positive changes in the cosmetologists’ attitudes. We end with a critical discussion about respecting the knowledge systems of underrepresented communities of practice in educational technology research and development.","authors":["Michael L Lachney","William Babbitt","Audrey Bennett","Ron Eglash"],"meta":["January 2020European Journal of Open, Distance and E-Learning 22(2):41-55","DOI:10.2478/eurodl-2019-0009","Project: Culturally Situated Design Tools"],"references":["312553162_Design_Agency","311851352_Ethnocomputational_creativity_in_STEAM_education_A_cultural_framework_for_generative_justice","311768714_Culturally_Situated_Design_Tools_Generative_Justice_as_a_Foundation_for_STEM_Diversity","349664087_Mohawk_Interruptus_Political_Life_Across_the_Borders_of_Settler_States","346672736_Mohawk_Interruptus_Political_Life_Across_the_Borders_of_Settler_States","344708425_Computer_Environments_for_Children_A_Reflection_on_Theories_of_Learning_and_Education","329648168_Lifelong_Kindergarten_Cultivating_Creativity_through_Projects_Passion_Peers_and_Play","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","320181448_The_Social_Construction_of_What","317953505_Situated_learning_Legitimate_peripheral_participation"]}