{"id":"338876629_Deep_learning_segmentation_for_optical_coherence_tomography_measurements_of_the_lower_tear_meniscus","abstract":"The tear meniscus contains most of the tear fluid and therefore is a good indicator for the state of the tear film. Previously, we used a custom-built optical coherence tomography (OCT) system to study the lower tear meniscus by automatically segmenting the image data with a thresholding-based segmentation algorithm (TBSA). In this report, we investigate whether the results of this image segmentation algorithm are suitable to train a neural network in order to obtain similar or better segmentation results with shorter processing times. Considering the class imbalance problem, we compare two approaches, one directly segmenting the tear meniscus (DSA), the other first localizing the region of interest and then segmenting within the higher resolution image section (LSA). A total of 6658 images labeled by the TBSA were used to train deep convolutional neural networks with supervised learning. Five-fold cross-validation reveals a sensitivity of 96.36% and 96.43%, a specificity of 99.98% and 99.86% and a Jaccard index of 93.24% and 93.16% for the DSA and LSA, respectively. Average segmentation times are up to 228 times faster than the TBSA. Additionally, we report the behavior of the DSA and LSA in cases challenging for the TBSA and further test the applicability to measurements acquired with a commercially available OCT system. The application of deep learning for the segmentation of the tear meniscus provides a powerful tool for the assessment of the tear film, supporting studies for the investigation of the pathophysiology of dry eye-related diseases.","authors":["Hannes Stegmann","René Marcel Werkmeister","Martin Pfister","Gerhard Garhofer"],"meta":["January 2020Biomedical Optics Express 11(3)","DOI:10.1364/BOE.386228"],"references":["333472639_Deep_Learning_Techniques_for_Medical_Image_Segmentation_Achievements_and_Challenges","332994000_Automatic_assessment_of_tear_film_and_tear_meniscus_parameters_in_healthy_subjects_using_ultrahigh-resolution_optical_coherence_tomography","331229920_Automated_segmentation_of_dermal_fillers_in_OCT_images_of_mice_using_convolutional_neural_networks","330459963_CorneaNet_Fast_segmentation_of_cornea_OCT_scans_of_healthy_and_keratoconic_eyes_using_deep_learning","327294790_Multiple_surface_segmentation_using_convolution_neural_nets_Application_to_retinal_layer_segmentation_in_OCT_images","324301859_Anterior_segment_optical_coherence_tomography","321692164_Fully_Automated_Detection_and_Quantification_of_Macular_Fluid_in_OCT_Using_Deep_Learning","336957269_Biomedical_image_augmentation_using_Augmentor","324387691_YOLOv3_An_Incremental_Improvement","322059369_Focal_Loss_for_Dense_Object_Detection"]}