{"id":"338998831_A_pneumonia_outbreak_associated_with_a_new_coronavirus_of_probable_bat_origin","abstract":"Since the SARS outbreak 18 years ago, a large number of severe acute respiratory syndrome-related coronaviruses (SARSr-CoV) have been discovered in their natural reservoir host, bats1–4. Previous studies indicated that some of those bat SARSr-CoVs have the potential to infect humans5–7. Here we report the identification and characterization of a novel coronavirus (2019-nCoV) which caused an epidemic of acute respiratory syndrome in humans in Wuhan, China. The epidemic, which started from 12 December 2019, has caused 2,050 laboratory-confirmed infections with 56 fatal cases by 26 January 2020. Full-length genome sequences were obtained from five patients at the early stage of the outbreak. They are almost identical to each other and share 79.5% sequence identify to SARS-CoV. Furthermore, it was found that 2019-nCoV is 96% identical at the whole-genome level to a bat coronavirus. The pairwise protein sequence analysis of seven conserved non-structural proteins show that this virus belongs to the species of SARSr-CoV. The 2019-nCoV virus was then isolated from the bronchoalveolar lavage fluid of a critically ill patient, which can be neutralized by sera from several patients. Importantly, we have confirmed that this novel CoV uses the same cell entry receptor, ACE2, as SARS-CoV.","authors":["Peng Zhou","Xinglou Yang","Xian-Guang Wang","Ben Hu"],"meta":["March 2020Nature 579(7798)","DOI:10.1038/s41586-020-2012-7"],"references":["331492838_Bat_Coronaviruses_in_China","329537224_Origin_and_evolution_of_pathogenic_coronaviruses","323547186_Serological_Evidence_of_Bat_SARS-Related_Coronavirus_Infection_in_Humans_China","321414068_Discovery_of_a_rich_gene_pool_of_bat_SARS-related_coronaviruses_provides_new_insights_into_the_origin_of_SARS_coronavirus","298330455_SARS-like_WIV1-CoV_poised_for_human_emergence","283639823_A_SARS-like_cluster_of_circulating_bat_coronaviruses_shows_potential_for_human_emergence","258202912_Isolation_and_characterization_of_a_bat_SARS-like_coronavirus_that_uses_the_ACE2_receptor","237059513_Novel_SARS-like_Betacoronaviruses_in_Bats_China_2011","327226528_Erratum_A_SARS-like_cluster_of_circulating_bat_coronaviruses_shows_potential_for_human_emergence_Nature_Medicine2015_DOI_101038nm3985","233657775_Angiotensin-converting_enzyme_2_A_functional_receptor_for_SARS_coronavirus"]}