{"id":"338916787_Survey_on_Visual_Sentiment_Analysis","abstract":"Visual Sentiment Analysis aims to understand how images affect people, in terms of evoked emotions. Although this field is rather new, a broad range of techniques have been developed for various data sources and problems, resulting in a large body of research. This paper reviews pertinent publications and tries to present an exhaustive overview of the field. After a description of the task and the related applications, the subject is tackled under different main headings. The paper also describes principles of design of general Visual Sentiment Analysis systems from three main points of view: emotional models, dataset definition, feature design. A formalization of the problem is discussed, considering different levels of granularity, as well as the components that can affect the sentiment toward an image in different ways. To this aim, this paper considers a structured formalization of the problem which is usually used for the analysis of text, and discusses it's suitability in the context of Visual Sentiment Analysis. The paper also includes a description of new challenges, the evaluation from the viewpoint of progress toward more sophisticated systems and related practical applications, as well as a summary of the insights resulting from this study.","authors":["Alessandro Ortis","Giovanni Maria Farinella","Sebastiano Battiato"],"meta":["January 2020Image Processing, IET","DOI:10.1049/iet-ipr.2019.1270"],"references":["339756645_Smile_Be_Happy_Emoji_Embedding_for_Visual_Sentiment_Analysis","337301358_Predicting_Social_Image_Popularity_Dynamics_at_Time_Zero","332239832_Visual_Sentiment_Analysis_by_Combining_Global_and_Local_Information","329061386_Visual_Sentiment_Analysis_Based_on_on_Objective_Text_Description_of_Images","326814837_A_survey_on_sentiment_analysis_and_opinion_mining_for_social_multimedia","331780739_Multimodal_Sentiment_Analysis_A_Multitask_Learning_Approach","330428583_Image-text_sentiment_analysis_via_deep_multimodal_attentive_fusion","330054686_Sentiment_concept_embedding_for_visual_affect_recognition","328131713_Deep_Learning_for_Aspect-Based_Sentiment_Analysis_A_Comparative_Review","326202348_Affective_Image_Content_Analysis_A_Comprehensive_Survey"]}