{"id":"338990776_Factors_Influencing_Women's_Decision_to_Study_Computer_Science_Is_It_Context_Dependent","abstract":"Aim/Purpose Our research goal was to examine the factors that motivate women to enroll in Computer Science (CS) courses in order to better understand the small number of women in the field of CS. Background This work is in line with the growing interest in better understanding the problem of the underrepresentation of women in the field of CS. Methodology We focused on a college that differs in its high numbers of female CS students. The student population there consists mostly of religious Jews; some of them are Haredi, who, because of their unique lifestyle, are expected to be the breadwinners in their family. Following group interviews with 18 students, a questionnaire was administered to all the female students and 449 of them responded. We analyzed it statistically. We compared the responses of the Haredi and non-Haredi students. Contribution The main contribution of this work lies in the idea that studying the factors underlying women's presence in a CS program in unique communities and cultures , where women are equally represented in the field, might shed light on the nature of this phenomenon, especially whether it is universal or confined to the surrounding culture. Findings There were significant differences between the Haredi and non-Haredi women regarding the importance they attributed to different factors. Haredi women resemble, regarding some social and economic variables, women in developing countries, but differ in others. The non-Haredi women are more akin to Western women, yet they did not completely overlap. Both groups value their family and career as the most important factors in their lives. These factors unify Women's Decision to Study Computer Science 128 women in the West and in developing countries, though with different outcomes. In the West, it deters women from studying CS, whereas in Israel and in Malaysia, other factors can overcome this barrier. Both groups attributed low importance to the masculine image of CS, found important in the West. Hence, our findings support the hypothesis that women's participation in the field of CS is culturally dependent. Recommendations for Practitioners It is important to learn about the culture within which women operate in order to attract more women to CS. Recommendations for Researchers Future work is required to examine other loci where women are underrepre-sented in CS, as well as how the insights obtained in this study can be utilized to decrease women's underrepresentation in other loci. Impact on Society Women's underrepresentation in CS is an important topic for both economic and social justice reasons. It raises questions regarding fairness and equality. In the CS field the gender pay gaps are smaller than in other professional areas. Thus, resolving the underrepresentation of women in CS will serve as a means to decrease the social gender gap in other areas.","authors":["Sara Genut","Bnaya Ori","Ben-David Yifat","Yifat Ben-David Kolikant"],"meta":["February 2020Informing Science 16(Computer Sciencr Education):127-141","DOI:10.28945/4296","Project: Computer science education of unrepresented societies in academics"],"references":["321890873_The_effect_of_prior_education_on_students'_competency_in_digital_logic_the_case_of_ultraorthodox_Jewish_students","317044526_Broadening_participation_not_border_protection_how_universities_can_support_women_in_computer_science","266742451_Why_are_women_underrepresented_in_Computer_Science_Gender_differences_in_stereotypes_self-efficacy_values_and_interests_and_predictors_of_future_CS_course-taking_and_grades","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","313390246_Basics_of_qualitative_research_Grounded_theory_procedures_and_techniques","312959977_Women_planning_to_major_in_computer_science_Who_are_they_and_what_makes_them_unique","300481283_Gender_Gap_in_Academia","285538622_Bridging_the_Qualitative-Quantitative_Divide_Guidelines_for_Conducting_Mixed_Methods_Research_in_Information_Systems","275618691_Diversity_As_a_Determinant_of_Attitudes_A_Possible_Explanation_of_the_Apparent_Advantage_of_Single-Sex_Settings","269033902_Why_are_we_still_here"]}