{"id":"338920377_Observable_quantum_entanglement_due_to_gravity","abstract":"No experiment to date has provided evidence for quantum features of the gravitational interaction. Recently proposed tests suggest looking for the generation of quantum entanglement between massive objects as a possible route towards the observation of such features. Motivated by advances in optical cooling of mirrors, here we provide a systematic study of entanglement between two masses that are coupled gravitationally. We first consider the masses trapped at all times in harmonic potentials (optomechanics) and then the masses released from the traps. This leads to the estimate of the experimental parameters required for the observation of gravitationally induced entanglement. The optomechanical setup demands LIGO-like mirrors and squeezing or long coherence times, but the released masses can be light and accumulate detectable entanglement in a timescale shorter than their coherence times. No macroscopic quantum superposition develops during the evolution. We discuss the implications from such thought experiments regarding the nature of the gravitational coupling.","authors":["Tanjung Krisnanda","Guo Yao Tham","M. Paternostro","Tomasz Paterek"],"meta":["December 2020npj Quantum Information 6(1)","DOI:10.1038/s41534-020-0243-y"],"references":["335665203_Testing_the_gravitational_field_generated_by_a_quantum_superposition","320754971_Remote_quantum_entanglement_between_two_micromechanical_oscillators","319973604_Revealing_Nonclassicality_of_Inaccessible_Objects","329766262_Quantum_superposition_of_massive_objects_and_the_quantization_of_gravity","329293821_Optomechanical_Bell_Test","328302992_Optomechanical_quantum_Cavendish_experiment","322674314_Measurement_of_the_Casimir_Force_between_Two_Spheres","321786690_Gravitationally_Induced_Entanglement_between_Two_Massive_Particles_is_Sufficient_Evidence_of_Quantum_Effects_in_Gravity","318560350_A_Spin_Entanglement_Witness_for_Quantum_Gravity","318457640_Witness_gravity's_quantum_side_in_the_lab"]}