{"id":"338951665_Blockchain_Current_Challenges_and_Future_ProspectsApplications","abstract":"Blockchain is a new technology, often referred to as the Internet of Value. As with all new technologies, there is no consensus on its potential value, with some people claiming that it will bring more disruptive changes than the Internet and others contesting the extent of its importance. Despite predictions that the future is perilous, there is evidence that blockchain is a remarkable, new technology that will change the way transactions are made, based on its ability to guarantee trust among unknown actors, assure the immutability of records, while also making intermediaries obsolete. The importance of blockchain can be confirmed by the interest in digital currencies, the great number of published blockchain papers, as well as MDPI's journal Future Internet which exclusively publishes blockchain articles, including this special issue covering present and future blockchain challenges. This paper is a survey of the fast growing field of blockchain, discussing its advantages and possible drawbacks and their implications for the future of the Internet and our personal lives and societies in general. The paper consists of the following parts; the first provides a general introduction and discusses the disruptive changes initiated by blockchain, the second discusses the unique value of blockchain and its general characteristics, the third presents an overview of industries with the greatest potential for disruptive changes, the forth describes the four major blockchain applications with the highest prospective advantages, and the fifth part of the paper ends with a discussion on the most notable subset of innovative blockchain applications-Smart Contracts, DAOs (Decentralized Autonomous Organizations) and super safe networks-and their future implications. There is also a concluding section, which summarizes the paper, describes the future of blockchain, and mentions the challenges to be overcome.","authors":["Spyros Makridakis","Klitos Christodoulou"],"meta":["December 2019Future Internet 11(12):258","DOI:10.3390/fi11120258","Project: Blockchain"],"references":["332631394_Speech_synthesis_from_neural_decoding_of_spoken_sentences","332215097_Blockchain_Technology_in_Healthcare_A_Systematic_Review","331534738_A_Decentralized_Application_for_Logistics_Using_Blockchain_in_Real-World_Applications","328085550_AI_and_Blockchain_A_Disruptive_Integration","324640508_Hyperledger_fabric_a_distributed_operating_system_for_permissioned_blockchains","320626951_Casper_the_Friendly_Finality_Gadget","332697930_The_challenges_of_AI_and_blockchain_on_HR_recruiting_practices","328519761_Blockchain_technology_for_enhancing_supply_chain_resilience","315938536_The_Forthcoming_Artificial_Intelligence_AI_Revolution_Its_Impact_on_Society_and_Firms","305525038_Blockchain_Mining_Games"]}