{"id":"338926586_Handwritten_Arabic_Optical_Character_Recognition_Approach_Based_on_Hybrid_Whale_Optimization_Algorithm_With_Neighborhood_Rough_Set","abstract":"Accomplishing high recognition performance is considered one of the most important tasks for handwritten Arabic character recognition systems. In general, Optical Character Recognition (OCR) systems are constructed from four phases: pre-processing, feature extraction, feature selection, and classification. Recent literature focused on the selection of appropriate features as a key point towards building a successful and sufficient character recognition system. In this paper, we propose a hybrid machine learning approach that utilizes neighborhood rough sets with a binary whale optimization algorithm to select the most appropriate features for the recognition of handwritten Arabic characters. To validate the proposed approach, we used the CENPARMI dataset, which is a well-known dataset for machine learning experiments involving handwritten Arabic characters. The results show clear advantages of the proposed approach in terms of recognition accuracy, memory footprint, and processor time than those without the features of the proposed method. When comparing the results of the proposed method with other recent state-of-the-art optimization algorithms, the proposed approach outperformed all others in all experiments. Moreover, the proposed approach shows the highest recognition rate with the smallest consumption time compared to deep neural networks such as VGGnet, Resnet, Nasnet, Mobilenet, Inception, and Xception. The proposed approach was also compared with recently published works using the same dataset, which further confirmed the outstanding classification accuracy and time consumption of this approach. The misclassified failure cases were studied and analyzed, which showed that they would likely be confusing for even Arabic natives because the correct interpretation of the characters required the context of their appearance.","authors":["Ahmed Talaat","Mohamed Elsayed Abd Elaziz","Mohammed A. A. Al-qaness","Sunghwan Kim"],"meta":["January 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2970438"],"references":["325797441_Automatic_acute_lymphoblastic_leukemia_classification_model_using_social_spider_optimization_algorithm","323502000_Arabic_handwritten_characters_recognition_system_towards_improving_its_accuracy","322880321_Elephant_herd_optimization_with_neural_networks_A_case_study_on_acute_Lymphoblastic_Leukemia_diagnosis","316895153_Hybrid_Whale_Optimization_Algorithm_with_Simulated_Annealing_for_Feature_Selection","316451000_Deep_Learning_based_Isolated_Arabic_Scene_Character_Recognition","322876799_Evaluation_of_cisplatin_efficiency_as_a_chemotherapeutic_drug_based_on_neural_networks_optimized_by_genetic_algorithm","322639745_An_Ameliorative_Whale_Optimization_Algorithm_for_Multi-Objective_Optimal_Allocation_of_Water_Resources_in_Handan_China","320968382_Xception_Deep_Learning_with_Depthwise_Separable_Convolutions","320954739_Whale_Optimization_Approaches_for_Wrapper_Feature_Selection","318674598_Salp_Swarm_Algorithm_A_bio-inspired_optimizer_for_engineering_design_problems"]}