{"id":"338905371_Latency-Bounded_Target_Set_Selection_in_Signed_Networks","abstract":"It is well-documented that social networks play a considerable role in information spreading. The dynamic processes governing the diffusion of information have been studied in many fields, including epidemiology, sociology, economics, and computer science. A widely studied problem in the area of viral marketing is the target set selection: in order to market a new product, hoping it will be adopted by a large fraction of individuals in the network, which set of individuals should we “target” (for instance, by offering them free samples of the product)? In this paper, we introduce a diffusion model in which some of the neighbors of a node have a negative influence on that node, namely, they induce the node to reject the feature that is supposed to be spread. We study the target set selection problem within this model, first proving a strong inapproximability result holding also when the diffusion process is required to reach all the nodes in a couple of rounds. Then, we consider a set of restrictions under which the problem is approximable to some extent.","authors":["Miriam Di Ianni","Giovanna Varricchio"],"meta":["January 2020Algorithms 13(2):32","DOI:10.3390/a13020032"],"references":["308062589_The_Dynamics_of_Viral_Marketing","260900528_Positive-Negative_Asymmetry_in_Evaluations_The_Distinction_Between_Affective_and_Informational_Negativity_Effects","246803611_Memory_and_Decision_Making","291388066_Maximizing_the_spread_of_positive_influence_in_signed_social_networks","281115285_Approximating_Fault-Tolerant_Domination_in_General_Graphs","263726794_Modelling_the_spread_of_negative_word-of-mouth_in_online_social_networks","262175701_Discovering_influential_nodes_from_trust_network","261475165_Latency-Bounded_Target_Set_Selection_in_Social_Networks","261318684_Influence_maximization_in_Independent_Cascade_model_with_positive_and_negative_word_of_mouth","258818395_Parameterized_Approximability_of_Maximizing_the_Spread_of_Influence_in_Networks"]}