{"id":"338905647_Fully_hardware-implemented_memristor_convolutional_neural_network","abstract":"Memristor-enabled neuromorphic computing systems provide a fast and energy-efficient approach to training neural networks1–4. However, convolutional neural networks (CNNs)—one of the most important models for image recognition5—have not yet been fully hardware-implemented using memristor crossbars, which are cross-point arrays with a memristor device at each intersection. Moreover, achieving software-comparable results is highly challenging owing to the poor yield, large variation and other non-ideal characteristics of devices6–9. Here we report the fabrication of high-yield, high-performance and uniform memristor crossbar arrays for the implementation of CNNs, which integrate eight 2,048-cell memristor arrays to improve parallel-computing efficiency. In addition, we propose an effective hybrid-training method to adapt to device imperfections and improve the overall system performance. We built a five-layer memristor-based CNN to perform MNIST10 image recognition, and achieved a high accuracy of more than 96 per cent. In addition to parallel convolutions using different kernels with shared inputs, replication of multiple identical kernels in memristor arrays was demonstrated for processing different inputs in parallel. The memristor-based CNN neuromorphic system has an energy efficiency more than two orders of magnitude greater than that of state-of-the-art graphics-processing units, and is shown to be scalable to larger networks, such as residual neural networks. Our results are expected to enable a viable memristor-based non-von Neumann hardware solution for deep neural networks and edge computing. A fully hardware-based memristor convolutional neural network using a hybrid training method achieves an energy efficiency more than two orders of magnitude greater than that of graphics-processing units.","authors":["Peng Yao","Huaqiang Wu","Bin Gao","Jianshi Tang"],"meta":["January 2020Nature 577(7792):641-646","DOI:10.1038/s41586-020-1942-4"],"references":["335338589_Phase-change_heterostructure_enables_ultralow_noise_and_drift_for_memory_operation","328888027_Memristor_crossbar_arrays_with_6-nm_half-pitch_and_2-nm_critical_dimension","327381032_Sign_backpropagation_An_on-chip_learning_algorithm_for_analog_RRAM_neuromorphic_computing_systems","325855817_Efficient_and_self-adaptive_in-situ_learning_in_multilayer_memristor_neural_networks","334705459_Confined_PCM-based_Analog_Synaptic_Devices_offering_Low_Resistance-drift_and_1000_Programmable_States_for_Deep_Learning","333336465_Design_Guidelines_of_RRAM_based_Neural-Processing-Unit_A_Joint_Device-Circuit-Algorithm_Analysis","331912455_Memristive_crossbar_arrays_for_brain-inspired_computing","330594427_Future_Computing_Hardware_for_AI","328994904_A_Methodology_to_Improve_Linearity_of_Analog_RRAM_for_Neuromorphic_Computing","325744081_In-memory_computing_with_resistive_switching_devices"]}