{"id":"338925380_El_proyecto_SUCRE4Kids_una_iniciativa_de_hardware_y_software_libre_para_la_introduccion_a_la_programacion","abstract":"Resumen SUCRE4Kids es un proyecto que intenta fomentar la curiosidad y la vocación científica, el pensamiento computacional y la programación en el alumnado de educación secundaria, ciclos formativos y bachillerato. Enmarcado dentro de las competencias STEM, SUCRE4Kids combina el uso de dispositivos inteligentes y componentes electrónicos con la programación visual basada en bloques para la realización de proyectos reales. El maletín de componentes SUCREKit incluye los diferentes dispositivos hardware (microcontrolador, sensores y actuadores) que se ensamblan para dar forma a los proyectos propuestos. La programación del montaje hardware se realiza mediante una herramienta de programación visual basada en bloques, donde cada bloque identifica conceptos de computación y los dispositivos electrónicos del maletín, para así dar funcionalidad al montaje y resolver el proyecto. Palabras clave Pensamiento computacional, promoción programación, hardware libre, interacción social y tangible. 1. Introducción En un reciente informe sobre la situación de los estudios en informática en Europa [1], donde se compara la mayoría de países europeos en cuanto a número de estudiantes en carreras relacionadas con las ciencias de la computación e informática, España no aparece destacada en las primeras posiciones. Se observa una tendencia decreciente sostenida entre los años 2011-2016, lo cual resulta especialmente preocupante si tenemos en cuenta que la ratio de estudiantes en informática por millón de habitantes es de por sí bajo en nuestro país [1]. Este informe deja entrever que la demanda y la oferta de profesionales en estudios relacionados con la informática no se ajusta, sobrepasando de largo la demanda a la oferta existente. Lejos de reducirse, ese desajuste se estima que irá en aumento, con el potencial riesgo de convertir la informática en Europa en una profesión de \"cuello de botella\" en los próximos años. Para 2025, se estima un incremento del 13% en la demanda de profesionales relacionados con competencias STEM (ciencia, tecnología, ingeniería y matemáticas) [2]. Contrariamente, según la OCDE (Organización para la Cooperación y el Desarrollo Económicos), los estudiantes de","authors":["Carlos Granell","Sergi Trilles Oliver"],"meta":["January 2018","Project: Sucre4Kids"],"references":["326405819_SUCRE4Kids_El_fomento_del_pensamiento_computacional_a_traves_de_la_interaccion_social_y_tangible","315636456_Computational_thinking_for_teacher_education","220426817_Scratch_Programming_for_All","325707159_A_survey_of_computational_kits_for_young_children","317160209_Learnable_Programming_Blocks_and_Beyond","308605679_Ten_things_we've_learned_from_Blockly","305726961_Talkoo_A_new_paradigm_for_physical_computing_at_school","301704890_Beyond_blocks_syntax_and_semantics","238495459_Piaget's_Constructivism_Papert's_Constructionism_What's_the_difference","220691985_Understanding_open_source_and_free_software_licensing_-_guide_to_navigation_licensing_issues_in_existing_and_new_software"]}