{"id":"338983495_Spiking_Neural_Networks_and_online_learning_An_overview_and_perspectives","abstract":"Applications that generate huge amounts of data in the form of fast streams are becoming increasingly prevalent, being therefore necessary to learn in an online manner. These conditions usually impose memory and processing time restrictions, and they often turn into evolving environments where a change may affect the input data distribution. Such a change causes that predictive models trained over these stream data become obsolete and do not adapt suitably to new distributions. Specially in these non-stationary scenarios, there is a pressing need for new algorithms that adapt to these changes as fast as possible, while maintaining good performance scores. Unfortunately, most off-the-shelf classification models need to be retrained if they are used in changing environments, and fail to scale properly. Spiking Neural Networks have revealed themselves as one of the most successful approaches to model the behavior and learning potential of the brain, and exploit them to undertake practical online learning tasks. Besides, some specific flavors of Spiking Neural Networks can overcome the necessity of retraining after a drift occurs. This work intends to merge both fields by serving as a comprehensive overview, motivating further developments that embrace Spiking Neural Networks for online learning scenarios, and being a friendly entry point for non-experts.","authors":["Jesús López Lobo","Javier Del Ser","Albert Bifet","Nikola Kirilov Kasabov"],"meta":["January 2020","Project: iDev4.0"],"references":["330462588_Deep_Learning_in_Spiking_Neural_Networks_for_Brain-Inspired_Artificial_Intelligence","329731638_Scikit-Multiflow_A_Multi-output_Streaming_Framework","326797099_Evolving_Spiking_Neural_Networks_for_online_learning_over_drifting_data_streams","326224348_A_Survey_of_Robotics_Control_Based_on_Learning-Inspired_Spiking_Neural_Networks","323993210_Machine_Learning_for_Data_Streams_with_Practical_Examples_in_MOA","320102864_Incremental_On-line_Learning_A_Review_and_Comparison_of_State_of_the_Art_Algorithms","315698712_A_Survey_on_Ensemble_Learning_for_Data_Stream_Classification","327291738_Deep_Learning_of_Multisensory_Streaming_Data_for_Predictive_Modelling_with_Applications_in_Finance_Ecology_Transport_and_Environment","323257370_Online_Machine_Learning_in_Big_Data_Streams","315454833_A_Systematic_Study_of_Online_Class_Imbalance_Learning_With_Concept_Drift"]}