{"id":"338910540_Theme_Mapping_and_Bibliometrics_Analysis_of_One_Decade_of_Big_Data_Research_in_the_Scopus_Database","abstract":"Recently, the popularity of big data as a research field has shown continuous and wide-scale growth. This study aims to capture the scientific structure and topic evolution of big data research using bibliometrics and text mining-based analysis methods. Bibliographic data of journal articles regarding big data published between 2009 to 2018 were collected from the Scopus database and analyzed. The results show a significant growth of publications since 2014. Furthermore, the findings of this study highlight the core journals, most cited articles, top productive authors, countries, and institutions. Secondly, a unique approach to identifying and analyzing major research themes in big data publications was proposed. Keywords were clustered, and each cluster was labeled as a theme. Moreover, the papers were divided into four sub-periods to observe the thematic evolution. The theme mapping reveals that research on big data is dominated by big data analytics, which covers methods, tools, supporting infrastructure, and applications. Other critical aspects of big data research are security and privacy. Social networks and the Internet of things are significant sources of big data, and the resources and services offered by cloud computing strongly support the management and processing of big data.","authors":["Anne Parlina","Kalamullah Ramli","Hendri Murfi"],"meta":["January 2020Information (Switzerland) 11(2):69","DOI:10.3390/info11020069"],"references":["350133604_Big_Data_Applications","345647706_Big_Data_Processing_Using_Spark_in_Cloud","332949762_A_Bibliometrics_analysis_on_big_data_research_2009-2018","325849092_Discovering_and_forecasting_interactions_in_big_data_research_A_learning-enhanced_bibliometric_study","325494989_Keyphrase_Extraction_Based_on_Prior_Knowledge","345481249_Big_Data_Conceptual_Analysis_and_Applications","338383318_Forecasting_technology_trends_using_text_mining_of_the_gaps_between_science_and_technology_The_case_of_perovskite_solar_cell_technology","332654383_Trending_topics_and_themes_in_offsite_constructionOSC_research_The_application_of_topic_modelling","324973204_Business_analytics_for_strategic_management_Identifying_and_assessing_corporate_challenges_via_topic_modeling","324869037_Recent_applications_of_big_data_analytics_in_railway_transportation_systems_A_survey"]}