{"id":"338992862_Experiential_characterization_of_materials_in_product_design_A_literature_review","abstract":"Driven by the competitive market that product designers face today, a growing interest emerges in exploring experiential material qualities to enhance product experience. Thematuring of the research area calls for standardization to evolve to more streamlined and systematic approaches to conduct characterization experiments. To this aim, we conducted a literature review on 64 cases of experiential characterization studies in the materials and design domain. In this paper, we summarize the current state of the art, formulate an overview to facilitate systematic studies to explore experiential qualities ofmaterials, and identify gaps or opportunities for further research. The presented learnings shed light on the following aspects used in materials experience studies: (i) variables, (ii) stimuli, (iii) interactionmodalities, (iv) experimental set-up, (v) methods employed in the conducted studies, and (vi) respondents. Two important gaps were identified with regard to the physical material representations in an abstract form as a critical element for multimodal material characterization experiments, and to an integration of extensive user aspects beyond demographic variables to facilitate consumer segmentation. Additional future research suggestionswere formulated, concerningwithin-material-class comparisons, complementary methods and experimental set-up, and the temporality of materials experience.","authors":["Lore Veelaert","Els Du Bois","I. Moons","Elvin Karana"],"meta":["February 2020Materials and Design 190:108543","DOI:10.1016/j.matdes.2020.108543","Project: PhD project: User-centred Material Characterization"],"references":["326735601_Experiential_characterization_of_materials_Toward_a_toolkit","319364659_MATERIAL_PERCEPTION_AND_MATERIAL_IDENTIFICATION_IN_PRODUCT_DESIGN","315787465_Revived_Beauty_Research_into_Aesthetic_Appreciation_of_Materials_to_Valorise_Materials_from_Waste","327372466_An_investigation_into_the_relationship_between_product_form_and_perceived_meanings","325058520_Development_and_evaluation_of_a_methodology_to_integrate_technical_and_sensorial_properties_in_materials_selection","324367465_The_Measurement_of_Meaning","322782825_Ranking_and_Rank-Rating","319610186_Effect_of_wear_from_cleaning_operations_on_sintered_ceramic_surfaces_Correlation_of_surface_properties_data_with_touch_perception_and_digital_image_processing","313754069_Seeking_the_Ideal_Form_Product_Design_and_Consumer_Response","305110018_Understanding_responses_to_materials_and_colors_in_interiors"]}