{"id":"338919832_Probing_the_physical_limits_of_reliable_DNA_data_retrieval","abstract":"Synthetic DNA is gaining momentum as a potential storage medium for archival data storage. In this process, digital information is translated into sequences of nucleotides and the resulting synthetic DNA strands are then stored for later retrieval. Here, we demonstrate reliable file recovery with PCR-based random access when as few as ten copies per sequence are stored, on average. This results in density of about 17 exabytes/gram, nearly two orders of magnitude greater than prior work has shown. We successfully retrieve the same data in a complex pool of over 1010 unique sequences per microliter with no evidence that we have begun to approach complexity limits. Finally, we also investigate the effects of file size and sequencing coverage on successful file retrieval and look for systematic DNA strand drop out. These findings substantiate the robustness and high data density of the process examined here. The physical limits and reliability of PCR-based random access of DNA encoded data is unknown. Here the authors demonstrate reliable file recovery from as few as ten copies per sequence, providing a data density limit of 17 exabytes per gram.","authors":["Lee Organick","Yuan-Jyue Chen","Siena Dumas Ang","Randolph Lopez"],"meta":["January 2020Nature Communications 11(1):616","DOI:10.1038/s41467-020-14319-8"],"references":["331529245_Quantifying_Molecular_Bias_in_DNA_Data_Storage","325664435_DrImpute_Imputing_dropout_events_in_single_cell_RNA_sequencing_data","323271462_Random_access_in_large-scale_DNA_data_storage","318406357_Portable_and_Error-Free_DNA-Based_Data_Storage","333353800_Driving_the_Scalability_of_DNA-Based_Information_Storage_Systems","317631981_A_DNA-Based_Archival_Storage_System","314195927_DNA_Fountain_enables_a_robust_and_efficient_storage_architecture","305745141_A_DNA-Based_Archival_Storage_System","303919223_A_DNA-Based_Archival_Storage_System","303746023_Forward_Error_Correction_for_DNA_Data_Storage"]}