{"id":"338956579_Compressed_Data_Structures_for_Binary_Relations_in_Practice","abstract":"Binary relations are commonly used in Computer Science for modeling data. In addition to classical representations using matrices or lists, some compressed data structures have recently been proposed to represent binary relations in compact space, such as the k2-tree and the Binary RelationWavelet Tree (BRWT). Knowing their storage needs, supported operations and time performance is key for enabling an appropriate choice of data representation given a domain or application, its data distribution and typical operations that are computed over the data. In this work, we present an empirical comparison among several compressed representations for binary relations. We analyze their space usage and the speed of their operations using different (synthetic and real) data distributions. We include both neighborhood and set operations, also proposing algorithms for set operations for the BRWT, which were not presented before in the literature. We conclude that there is not a clear choice that outperforms the rest, but we give some recommendations of usage of each compact representation depending on the data distribution and types of operations performed over the data. We also include a scalability study of the data representations.","authors":["Carlos Quijada-Fuentes","Miguel R. Penabad","Susana Ladra","Gilberto Gutiérrez"],"meta":["January 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2970983"],"references":["259893466_SIMD_Compression_and_the_Intersection_of_Sorted_Integers","328254484_Set_operations_over_compressed_binary_relations","321248014_Random_graphs_with_arbitrary_degree_distributions_and_their_applications","316866720_Compressed_Representation_of_Dynamic_Binary_Relations_with_Applications","301427720_Compression_SIMD_and_Postings_Lists","288986480_Compact_Querieable_Representations_of_Raster_Data","282795545_Efficient_Set_Operations_over_k2-Trees","269005400_A_General_Framework_for_Comparing_Heterogeneous_Binary_Relations","259126393_Compact_representation_of_Web_graphs_with_extended_functionality","254030145_Compressed_Dynamic_Binary_Relations"]}