{"id":"338994612_Applying_Educational_Data_Mining_to_Explore_Students'_Learning_Patterns_in_the_Flipped_Learning_Approach_for_Coding_Education","abstract":"From traditional face-to-face courses, asynchronous distance learning, synchronous live learning, to even blended learning approaches, the learning approach can be more learner-centralized, enabling students to learn anytime and anywhere. In this study, we applied educational data mining to explore the learning behaviors in data generated by students in a blended learning course. The experimental data were collected from two classes of Python programming related courses for first-year students in a university in northern Taiwan. During the semester, high-risk learners could be predicted accurately by data generated from the blended educational environment. The f1-score of the random forest model was 0.83, which was higher than the f1-score of logistic regression and decision tree. The model built in this study could be extrapolated to other courses to predict students’ learning performance, where the F1-score was 0.77. Furthermore, we used machine learning and symmetry-based learning algorithms to explore learning behaviors. By using the hierarchical clustering heat map, this study could define the students’ learning patterns including the positive interactive group, stable learning group, positive teaching material group, and negative learning group. These groups also corresponded with the student conscious questionnaire. With the results of this research, teachers can use the mid-term forecasting system to find high-risk groups during the semester and remedy their learning behaviors in the future.","authors":["Hui-Chun Hung","I-Fan Liu","Che-Tien Liang","Yu-Sheng Su"],"meta":["February 2020Symmetry 12(2):213","DOI:10.3390/sym12020213"],"references":["337923569_Blessings_of_open_data_and_technology_e-learning_examples_on_land_use_monitoring_and_e-mobility_OPEN_ACCESS","337448346_Exploring_critical_factors_of_the_perceived_usefulness_of_blended_learning_for_higher_education_students","313680006_A_framework_for_institutional_adoption_and_implementation_of_blended_learning_in_higher_education","316631031_Popular_Culture_and_New_Media_The_Politics_of_Circulation","299631178_Classifiers_for_Educational_Data_Mining","288970579_Blended_learning_landscapes","285852296_Data_mining_for_education","285651933_Comparing_the_Effectiveness_of_Classroom_and_Online_Learning_Teaching_Research_Methods","284084931_Clustering_blended_learning_courses_by_online_behavior_data_case_study_in_a_Korean_higher_education_institute","272753676_Integrating_cluster_and_sequential_analysis_to_explore_learners'_flow_and_behavioral_patterns_in_a_simulation_game_with_situated-learning_context_for_science_courses_A_video-based_process_exploration"]}