{"id":"338985575_A_Formal_System_of_Axiomatic_Set_Theory_in_Coq","abstract":"Formal verification technology has been widely applied in the fields of mathematics and computer science. The formalization of fundamental mathematical theories is particularly essential. Axiomatic set theory is a foundational system of mathematics and has important applications in computer science. Most of the basic concepts and theories in computer science are described and demonstrated in terms of set theory. In this paper, we present a formal system of axiomatic set theory based on the Coq proof assistant. The axiomatic system used in the formal system refers to Morse-Kelley set theory which is a relatively complete and concise axiomatic set theory. In this formal system, we complete the formalization of the basic definitions of sets, functions, ordinal numbers, and cardinal numbers and prove the most commonly used theorems in Coq. Moreover, the non-negative integers are defined, and Peano’s postulates are proved as theorems. According to the axiom of choice, we also present formal proofs of the Hausdorff maximal principle and Schröeder-Bernstein theorem. The whole formalization of the system includes eight axioms, one axiom schema, 62 definitions, and 148 corollaries or theorems. The “axiomatic set theory” formal system is free from the more apparent paradoxes, and a complete axiomatic system is constructed through it. It is designed to give a foundation for mathematics quickly and naturally. On the basis of the system, we can prove many famous mathematical theorems and quickly formalize the theories of topology, modern algebra, data structure, database, artificial intelligence, and so on. It will become an essential theoretical basis for mathematics, computer science, philosophy, and other disciplines.","authors":["Tianyu Sun","Wensheng yu"],"meta":["January 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2969486"],"references":["328248974_Categoricity_Results_and_Large_Model_Constructions_for_Second-Order_ZF_in_Dependent_Type_Theory","320118521_Machine_proving_system_for_mathematical_theorems_in_Coq_-_Machine_proving_of_Hausdorff_maximal_principle_and_Zermelo_postulate","344743385_A_Survey_on_Security_Verification_of_Blockchain_Smart_Contracts","325667188_Opinion_The_Mechanization_of_Mathematics","319489442_Position_paper_the_science_of_deep_specification","319395392_From_Frege_to_Godel_A_Source_Book_in_Mathematical_Logic_1879-1931","319202769_Categoricity_Results_for_Second-Order_ZF_in_Dependent_Type_Theory","315856245_A_Survey_of_Attacks_on_Ethereum_Smart_Contracts_SoK","284688895_Formal_proof_-_The_four-color_theorem","268737217_Axiomatic_set_theory_2nd_ed","257285461_A_Machine-Checked_Proof_of_the_Odd_Order_Theorem","266248528_Set_Theory_The_Third_Millennium_Edition_Revised_and_Expanded","257282396_Interactive_theorem_proving_and_program_development_Coq'Art_The_Calculus_of_inductive_constructions","254876508_Formal_proof_getting_started","247935873_Formal_Proof"]}