{"id":"339025021_Dynamics_of_random_recurrent_networks_with_correlated_low-rank_structure","abstract":"A given neural network in the brain is involved in many different tasks. This implies that, when considering a specific task, the network's connectivity contains a component which is related to the task and another component which can be considered random. Understanding the interplay between the structured and random components and their effect on network dynamics and functionality is an important open question. Recent studies addressed the coexistence of random and structured connectivity but considered the two parts to be uncorrelated. This constraint limits the dynamics and leaves the random connectivity nonfunctional. Algorithms that train networks to perform specific tasks typically generate correlations between structure and random connectivity. Here we study nonlinear networks with correlated structured and random components, assuming the structure to have a low rank. We develop an analytic framework to establish the precise effect of the correlations on the eigenvalue spectrum of the joint connectivity. We find that the spectrum consists of a bulk and multiple outliers, whose location is predicted by our theory. Using mean-field theory, we show that these outliers directly determine both the fixed points of the system and their stability. Taken together, our analysis elucidates how correlations allow structured and random connectivity to synergistically extend the range of computations available to networks.","authors":["Friedrich Schuessler","Alexis Dubreuil","Francesca Mastrogiuseppe","Srdjan Ostojic"],"meta":["February 2020Physical Review Research 2(1)","DOI:10.1103/PhysRevResearch.2.013111"],"references":["338040406_A_model_of_flexible_motor_sequencing_through_thalamic_control_of_cortical_dynamics","334396650_Scale_free_topology_as_an_effective_feedback_system","330367689_Task_representations_in_neural_networks_trained_to_perform_many_cognitive_tasks","335076173_One_Step_Back_Two_Steps_Forward_Interference_and_Learning_in_Recurrent_Neural_Networks","332699244_Spectral_Theory_of_Sparse_Non-Hermitian_Random_Matrices","332400358_A_Geometrical_Analysis_of_Global_Stability_in_Trained_Feedback_Networks","329818599_Circuit_Models_of_Low-Dimensional_Shared_Variability_in_Cortical_Networks","328554450_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","321324791_Linking_connectivity_dynamics_and_computations_in_recurrent_neural_networks","315808611_Formation_of_Dominant_Mode_by_Evolution_in_Biological_Systems"]}