{"id":"339063684_The_training_of_masters_of_pedagogical_education_to_the_integrated_teaching_of_the_schoolchildren_in_mathematics_and_computer_science","abstract":"Problem and goal. The single subject area “Mathematics and Computer Science”, provided by existing standards, implies the need to introduce the integration of teaching these subjects in primary and secondary schools; the training for such teaching is one of the goals of the implementation of the master’s program “Mathematics in Primary Education”. Methodology. The implementation of the following factors improves the quality of training of the masters to the integrated teaching of the schoolchildren in mathematics and computer science: the training of the masters is based on the competencies that they assimilated in the stages of their previous training, in particular in undergraduate studies; the developed integrated content of the modular training, implemented in the system of specialized disciplines, allows to implement the systematic, fundamental and invariance training of the masters; the readiness of the masters to the integrated teaching the schoolchildren in mathematics and computer science includes the formed competencies in the selection of teaching content and the use of educational electronic resources; taking into account various factors of using information and communication technologies in the educational process, forming an idea of the role of informatization of education in society, its language, methods and means, and their quality control. Results. The practical activities of masters in creating the electronic courses for organizing online-learning were implemented, a system of computer tasks was created for the integrated teaching of the schoolchildren in mathematics and computer science. Conclusion. The training of masters to the integrated teaching of the schoolchildren in mathematics and computer science ensures their orientation in information and communication technologies and subsequent competent use of these technologies in their professional activities.","authors":["Vita I. Glizburg"],"meta":["December 2019RUDN Journal of Informatization in Education 16(4):318-327","DOI:10.22363/2312-8631-2019-16-4-318-327"],"references":[]}