{"id":"339050853_Graphlets_in_Multiplex_Networks","abstract":"We develop graphlet analysis for multiplex networks and discuss how this analysis can be extended to multilayer and multilevel networks as well as to graphs with node and/or link categorical attributes. The analysis has been adapted for two typical examples of multiplexes: economic trade data represented as a 957-plex network and 75 social networks each represented as a 12-plex network. We show that wedges (open triads) occur more often in economic trade networks than in social networks, indicating the tendency of a country to produce/trade of a product in local structure of triads which are not closed. Moreover, our analysis provides evidence that the countries with small diversity tend to form correlated triangles. Wedges also appear in the social networks, however the dominant graphlets in social networks are triangles (closed triads). If a multiplex structure indicates a strong tie, the graphlet analysis provides another evidence for the concepts of strong/weak ties and structural holes. In contrast to Granovetter’s seminal work on the strength of weak ties, in which it has been documented that the wedges with only strong ties are absent, here we show that for the analyzed 75 social networks, the wedges with only strong ties are not only present but also significantly correlated.","authors":["Tamarа Dimitrova","Kristijan Petrovski","Ljupco Kocarev"],"meta":["February 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-57609-3"],"references":["309041923_Graphlet-based_Characterization_of_Directed_Networks","306929880_The_Impact_of_Services_on_Economic_Complexity_Service_Sophistication_as_Route_for_Economic_Growth","301838453_Graphlet_characteristics_in_directed_networks","297743021_Congestion_Induced_by_the_Structure_of_Multiplex_Networks","282815017_Structure_of_triadic_relations_in_multiplex_networks","281520956_Dynamic_reconfiguration_of_frontal_brain_networks_during_executive_cognition_in_humans","280537968_Coupled_disease-behavior_dynamics_on_complex_networks_A_review","279954374_The_Social_and_Economic_Bases_of_Network_Multiplexity_Exploring_the_Emergence_of_Multiplex_Ties","312860096_Market_Structure_and_Competition","302377335_Bridging_Online_and_Offline_Social_Networks_Multiplex_Analysis"]}