{"id":"339076123_Identifying_multi-hit_carcinogenic_gene_combinations_Scaling_up_a_weighted_set_cover_algorithm_using_compressed_binary_matrix_representation_on_a_GPU","abstract":"Despite decades of research, effective treatments for most cancers remain elusive. One reason is that different instances of cancer result from different combinations of multiple genetic mutations (hits). Therefore, treatments that may be effective in some cases are not effective in others. We previously developed an algorithm for identifying combinations of carcinogenic genes with mutations (multi-hit combinations), which could suggest a likely cause for individual instances of cancer. Most cancers are estimated to require three or more hits. However, the computational complexity of the algorithm scales exponentially with the number of hits, making it impractical for identifying combinations of more than two hits. To identify combinations of greater than two hits, we used a compressed binary matrix representation, and optimized the algorithm for parallel execution on an NVIDIA V100 graphics processing unit (GPU). With these enhancements, the optimized GPU implementation was on average an estimated 12,144 times faster than the original integer matrix based CPU implementation, for the 3-hit algorithm, allowing us to identify 3-hit combinations. The 3-hit combinations identified using a training set were able to differentiate between tumor and normal samples in a separate test set with 90% overall sensitivity and 93% overall specificity. We illustrate how the distribution of mutations in tumor and normal samples in the multi-hit gene combinations can suggest potential driver mutations for further investigation. With experimental validation, these combinations may provide insight into the etiology of cancer and a rational basis for targeted combination therapy.","authors":["Qais Al Hajri","Sajal Dash","Wu Feng","Harold R. Garner"],"meta":["February 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-58785-y","Project: Identifying multi-hit carcinogenic gene combinations"],"references":["337819377_Slow_skeletal_muscle_troponin_T_titin_and_myosin_light_chain_3_are_candidate_prognostic_biomarkers_for_Ewing's_sarcoma","336909527_Homozygous_missense_variant_in_the_TTN_gene_causing_autosomal_recessive_limb-girdle_muscular_dystrophy_type_10","334632319_Two_novel_mutations_in_TTN_of_a_patient_with_congenital_myopathy_A_case_report","334150159_Novel_TTN_mutations_and_muscle_imaging_characteristics_in_congenital_titinopathy_Mutations_and_Muscle_MRI_in_Congenital_Titinopathy","334099948_Association_of_Titin-Truncating_Genetic_Variants_With_Life-threatening_Cardiac_Arrhythmias_in_Patients_With_Dilated_Cardiomyopathy_and_Implanted_Defibrillators","332051638_Titin_mutations_and_muscle_disease","331608382_Estimating_the_number_of_genetic_mutations_hits_required_for_carcinogenesis_based_on_the_distribution_of_somatic_mutations","344627711_GPU_Maps_for_the_Space_of_Computation_in_Triangular_Domain_Problems","336439893_Gain-of-Function_Mutant_p53_Enhances_Hematopoietic_Stem_Cell_Self-Renewal","335079412_G3viz_an_R_package_to_interactively_visualize_genetic_mutation_data_using_a_lollipop-diagram"]}