{"id":"339074012_Early_Detection_of_Diabetic_Retinopathy_Using_PCA-Firefly_Based_Deep_Learning_Model","abstract":"Diabetic Retinopathy is a major cause of vision loss and blindness affecting millions of people across the globe. Although there are established screening methods - fluorescein angiography and optical coherence tomography for detection of the disease but in majority of the cases, the patients remain ignorant and fail to undertake such tests at an appropriate time. The early detection of the disease plays an extremely important role in preventing vision loss which is the consequence of diabetes mellitus remaining untreated among patients for a prolonged time period. Various machine learning and deep learning approaches have been implemented on diabetic retinopathy dataset for classification and prediction of the disease but majority of them have neglected the aspect of data pre-processing and dimensionality reduction, leading to biased results. The dataset used in the present study is a diabetes retinopathy dataset collected from the UCI machine learning repository. At its inceptions, the raw dataset is normalized using the Standardscalar technique and then Principal Component Analysis (PCA) is used to extract the most significant features in the dataset. Further, Firefly algorithm is implemented for dimensionality reduction. This reduced dataset is fed into a Deep Neural Network Model for classification. The results generated from the model is evaluated against the prevalent machine learning models and the results justify the superiority of the proposed model in terms of Accuracy, Precision, Recall, Sensitivity and Specificity.","authors":["Thippa Reddy Gadekallu","Neelu Khare","Sweta Bhattacharya","Saurabh Singh"],"meta":["February 2020Electronics 9(2):274","DOI:10.3390/electronics9020274","Project: Data Mining, Soft Computing"],"references":["338846393_A_Novel_PCA-Firefly_based_XGBoost_classification_model_for_Intrusion_Detection_in_Networks_using_GPU","337552031_Hybrid_genetic_algorithm_and_a_fuzzy_logic_classifier_for_heart_disease_diagnosis","334662197_Deep_Learning_Fundus_Image_Analysis_for_Diabetic_Retinopathy_and_Macular_Edema_Grading","332203589_Deep_Learning_Approach_for_Intelligent_Intrusion_Detection_System","332200619_Robust_Intelligent_Malware_Detection_Using_Deep_Learning","330071711_An_enhanced_diabetic_retinopathy_detection_and_classification_approach_using_deep_convolutional_neural_network","329370125_Use_of_Data_Visualisation_for_Zero-Day_Malware_Detection","335439297_Dynamically_enhanced_static_handwriting_representation_for_Parkinson's_disease_detection","333537128_Modified_Alexnet_architecture_for_classification_of_diabetic_retinopathy_images","331796099_Trends_and_RacialEthnic_Disparities_in_Diabetic_Retinopathy_Among_Adults_with_Diagnosed_Diabetes_in_North_Carolina_2000-2015"]}