{"id":"339008240_Machine_learning_can_predict_survival_of_patients_with_heart_failure_from_serum_creatinine_and_ejection_fraction_alone","abstract":"Background: \nCardiovascular diseases kill approximately 17 million people globally every year, and they mainly exhibit as myocardial infarctions and heart failures. Heart failure (HF) occurs when the heart cannot pump enough blood to meet the needs of the body.Available electronic medical records of patients quantify symptoms, body features, and clinical laboratory test values, which can be used to perform biostatistics analysis aimed at highlighting patterns and correlations otherwise undetectable by medical doctors. Machine learning, in particular, can predict patients' survival from their data and can individuate the most important features among those included in their medical records.\n\nMethods: \nIn this paper, we analyze a dataset of 299 patients with heart failure collected in 2015. We apply several machine learning classifiers to both predict the patients survival, and rank the features corresponding to the most important risk factors. We also perform an alternative feature ranking analysis by employing traditional biostatistics tests, and compare these results with those provided by the machine learning algorithms. Since both feature ranking approaches clearly identify serum creatinine and ejection fraction as the two most relevant features, we then build the machine learning survival prediction models on these two factors alone.\n\nResults: \nOur results of these two-feature models show not only that serum creatinine and ejection fraction are sufficient to predict survival of heart failure patients from medical records, but also that using these two features alone can lead to more accurate predictions than using the original dataset features in its entirety. We also carry out an analysis including the follow-up month of each patient: even in this case, serum creatinine and ejection fraction are the most predictive clinical features of the dataset, and are sufficient to predict patients' survival.\n\nConclusions: \nThis discovery has the potential to impact on clinical practice, becoming a new supporting tool for physicians when predicting if a heart failure patient will survive or not. Indeed, medical doctors aiming at understanding if a patient will survive after heart failure may focus mainly on serum creatinine and ejection fraction.","authors":["Davide Chicco","Giuseppe Jurman"],"meta":["February 2020BMC Medical Informatics and Decision Making 20(1)","DOI:10.1186/s12911-020-1023-5"],"references":["338351315_The_advantages_of_the_Matthews_correlation_coefficient_MCC_over_F1_score_and_accuracy_in_binary_classification_evaluation","335058976_Predicting_stroke_and_death_in_patients_with_heart_failure_using_CHA2DS2-VASc_score_in_Asia","334732324_Comparison_of_MAGGIC_and_MECKI_risk_scores_to_predict_mortality_after_cardiac_rehabilitation_among_Dutch_heart_failure_patients","333301441_A_primer_in_artificial_intelligence_in_cardiovascular_medicine","333288184_Improving_risk_stratification_in_heart_failure_with_preserved_ejection_fraction_by_combining_two_validated_risk_scores","333202905_Machine_learning_for_prediction_of_sudden_cardiac_death_in_heart_failure_patients_with_low_left_ventricular_ejection_fraction_Study_protocol_for_a_retroprospective_multicentre_registry_in_China","335814333_Machine_Learning_to_Predict_the_Risk_of_Incident_Heart_Failure_Hospitalization_Among_Patients_With_Diabetes_The_WATCH-DM_Risk_Score","334329079_Effects_of_Nutritional_Supplements_and_Dietary_Interventions_on_Cardiovascular_Outcomes_An_Umbrella_Review_and_Evidence_Map","334328345_Dispense_With_Supplements_for_Improving_Heart_Outcomes","333043190_The_Singapore_Heart_Failure_Risk_Score_Prediction_of_Survival_in_Southeast_Asian_Patients"]}