{"id":"339075537_Quantum-inspired_cascaded_discrete-time_quantum_walks_with_induced_chaotic_dynamics_and_cryptographic_applications","abstract":"Designing efficient and secure cryptosystems has been a preoccupation for many scientists and engineers for a long time wherein they use chaotic systems to design new cryptosystems. While one dimensional (1-D) chaotic maps possess powerful properties compared to higher dimension ones, they are vulnerable to various attacks due to their small key space, chaotic discontinuous ranges, and degradation in chaotic dynamical behaviours. Moreover, when simulated on a computer, every such chaotic system produces a periodic cycle. Meanwhile, quantum random walks exhibit the potential for deployment in efficient cryptosystem design, which makes it an excellent solution for this problem. In this context, we present a new method for constructing substitution boxes (S-boxes) based on cascaded quantum-inspired quantum walks and chaos inducement. The performance of the proposed S-box scheme is investigated via established S-box evaluation criterion and outcomes suggest that the constructed S-box has significant qualities for viable applications information security. Further, we present an efficient scheme for pseudo-random numbers generation (PRNG) whose sustainability over long periods remedies the periodicity problem associated with traditional cryptographic applications. Furthermore, by combining the two mechanisms, an atypical image encryption scheme is introduced. Simulation results and analysis validate that the proposed image encryption algorithm will offer gains in many cryptographic applications.","authors":["Ahmed Abd El-Latif","Bassem Abd-El-Atty","Mohamed Amin","Abdullah M. Iliyasu"],"meta":["February 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-58636-w"],"references":["343637842_Quantum-inspired_algorithms_in_practice","338121224_A_Multidimensional_Hyperjerk_Oscillator_Dynamics_Analysis_Analogue_and_Embedded_Systems_Implementation_and_Its_Application_as_a_Cryptosystem","337578072_Predicting_quantum_advantage_by_quantum_walk_with_convolutional_neural_networks","335310107_Quantum-Inspired_Acromyrmex_Evolutionary_Algorithm","334709365_An_encryption_protocol_for_NEQR_images_based_on_one-particle_quantum_walks_on_a_circle","338459301_Design_and_implementation_of_a_simple_dynamical_4-D_chaotic_circuit_with_applications_in_image_encryption","338060908_Controlled_alternate_quantum_walk-based_pseudo-random_number_generator_and_its_application_to_quantum_color_image_encryption","337736543_Secret_images_transfer_in_cloud_system_based_on_investigating_quantum_walks_in_steganography_approaches","337586254_Controlled_alternate_quantum_walks_based_privacy_preserving_healthcare_images_in_Internet_of_Things","333501633_Efficient_quantum-based_security_protocols_for_information_sharing_and_data_protection_in_5G_networks"]}