{"id":"339044553_Biomechanical_diagnostics_of_the_cornea","abstract":"Corneal biomechanics has been a hot topic for research in contemporary ophthalmology due to its prospective applications in diagnosis, management, and treatment of several clinical conditions, including glaucoma, elective keratorefractive surgery, and different corneal diseases. The clinical biomechanical investigation has become of great importance in the setting of refractive surgery to identify patients at higher risk of developing iatrogenic ectasia after laser vision correction. This review discusses the latest developments in the detection of corneal ectatic diseases. These developments should be considered in conjunction with multimodal corneal and refractive imaging, including Placido-disk based corneal topography, Scheimpflug corneal tomography, anterior segment tomography, spectral-domain optical coherence tomography (SD-OCT), very-high-frequency ultrasound (VHF-US), ocular biometry, and ocular wavefront measurements. The ocular response analyzer (ORA) and the Corvis ST are non-contact tonometry systems that provide a clinical corneal biomechanical assessment. More recently, Brillouin optical microscopy has been demonstrated to provide in vivo biomechanical measurements. The integration of tomographic and biomechanical data into artificial intelligence techniques has demonstrated the ability to increase the accuracy to detect ectatic disease and characterize the inherent susceptibility for biomechanical failure and ectasia progression, which is a severe complication after laser vision correction.","authors":["Louise Pellegrino Gomes Esporcatte","Marcella Q. Salomão","Bernardo Lopes","Paolo Vinciguerra"],"meta":["February 2020Eye and Vision 7(1):9","DOI:10.1186/s40662-020-0174-x","Project: Enhanced Screening for Ectasia Detection based on Scheimpflug Tomography and Biomachanical evaluations"],"references":["333508186_Bowman's_topography_for_improved_detection_of_early_ectasia","333136687_Determination_of_Corneal_Biomechanical_Behavior_in-vivo_for_Healthy_Eyes_Using_CorVis_ST_Tonometry_Stress-Strain_Index","332921792_Correlation_Between_Corneal_Topographic_Densitometry_and_Biomechanical_Parameters_in_Keratoconus_Eyes","332063277_Corneal_biomechanics_and_biomechanically_corrected_intraocular_pressure_in_primary_open-angle_glaucoma_ocular_hypertension_and_controls","334075256_Two-year_changes_in_corneal_stiffness_parameters_after_accelerated_corneal_cross-linking_18mWcm2_versus_9mWcm2","333716615_Tomographic_and_Biomechanical_Index_TBI_for_Screening_in_Laser_Refractive_Surgery","333710715_Detection_of_Subclinical_Corneal_Ectasia_Using_Corneal_Tomographic_and_Biomechanical_Assessments_in_a_Japanese_Population","332418086_Biomechanical_Analysis_of_Subclinical_Keratoconus_With_Normal_Topographic_Topometric_and_Tomographic_Findings","331130610_Brillouin_Spectroscopy_of_Normal_and_Keratoconus_Corneas","330835463_Distinguishing_Highly_Asymmetric_Keratoconus_Eyes_Using_Dual_ScheimpflugPlacido_Analysis"]}