{"id":"339062996_Virtual_reality_educational_and_methodological_aspects","abstract":"Problem and goal. Virtual reality in education is used as the information space, in which the student can not only obtain the necessary information, but also enter into the contact with the fictitious objects. Sinking (immersion) into the educational medium helps students to acquire the habits of interaction with the virtual objects, to develop methods of collective collaboration and to find confidence in the course presentation of its own projects. The process of creating the resources with the elements of interactivity, and also the selection of the necessary instrument means is a technological and a systematic problem for the teachers, who are mastering new information technologies. The purpose of the article is construction and substantiation of the effectiveness of the model of the use of technologies of virtual reality in the course of the instruction of schoolchildren in the system of additional formation. Methodology. The development of the model of the use of technologies of virtual reality in the instruction of students in the extra-curriculum activity was accomplished on the basis of the complex data analysis, obtained in the course of conducting the approval developed educational methods materials in the system of additional formation, structuring of information, generalization of the results of a study. Results. The didactic possibilities of the technologies of virtual reality were identified in the course of the instruction of students in the system of additional formation. The theoretical substantiation is given the need of applying the virtual reality as a means of the development of creative thinking in students and an effective tool of the creation of the immersive training medium. On the basis of a study working program has been prepared, as well as teaching aid and systematic recommendations for the teachers, who use technologies of virtual reality for conducting the training exercises. Conclusion. The results of the conducted investigation made it possible to make a conclusion about the effectiveness of the use of technologies of virtual reality in the system of additional formation. It is ensured by the goal-directed application of the corresponding model of instruction and system of instrumental and teaching aids. The application of virtual reality, different technologies of imitation simulation not only contributes to the development of the algorithmic and creative thinking of students, but also to the maximum disclosure of their intellectual potential.","authors":["Alexey I. Azevich"],"meta":["December 2019RUDN Journal of Informatization in Education 16(4):338-350","DOI:10.22363/2312-8631-2019-16-4-338-350"],"references":[]}