{"id":"339071502_Improvement_of_Misleading_and_Fake_News_Classification_for_Flective_Languages_by_Morphological_Group_Analysis","abstract":"Due to the constantly evolving social media and different types of sources of information, we are facing different fake news and different types of misinformation. Currently, we are working on a project to identify applicable methods for identifying fake news for floating language types. We explored different approaches to detect fake news in the presented research, which are based on morphological analysis. This is one of the basic components of natural language processing. The aim of the article is to find out whether it is possible to improve the methods of dataset preparation based on morphological analysis. We collected our own and unique dataset, which consisted of articles from verified publishers and articles from news portals that are known as the publishers of fake and misleading news. Articles were in the Slovak language, which belongs to the floating types of languages. We explored different approaches in this article to the dataset preparation based on morphological analysis. The prepared datasets were the input data for creating the classifier of fake and real news. We selected decision trees for classification. The evaluation of the success of two different methods of preparation was carried out because of the success of the created classifier. We found a suitable dataset pre-processing technique by morphological group analysis. This technique could be used for improving fake news classification.","authors":["Jozef Kapusta","Juraj Obonya"],"meta":["February 2020Informatics 7(1):4","DOI:10.3390/informatics7010004"],"references":["336436870_Fake_News_Detection_Using_Machine_Learning_approaches_A_systematic_Review","336313030_Computing_the_Gini_index_A_note","328650077_Unsupervised_Fake_News_Detection_on_Social_Media_A_Generative_Approach","341691422_FakeDetector_Effective_Fake_News_Detection_with_Deep_Diffusive_Neural_Network","336592555_Fake_news_detection_within_online_social_media_using_supervised_artificial_intelligence_algorithms","333776916_Detecting_Fake_News_for_Reducing_Misinformation_Risks_Using_Analytics_Approaches","333061850_A_Survey_on_Fake_News_and_Rumour_Detection_Techniques","331930491_Behind_the_Cues_A_benchmarking_study_for_Fake_News_Detection","331913505_An_overview_of_online_fake_news_Characterization_detection_and_discussion","328525342_Weakly_Supervised_Learning_for_Fake_News_Detection_on_Twitter"]}