{"id":"339058548_A_deep_learning_system_accurately_classifies_primary_and_metastatic_cancers_using_passenger_mutation_patterns","abstract":"In cancer, the primary tumour’s organ of origin and histopathology are the strongest determinants of its clinical behaviour, but in 3% of cases a patient presents with a metastatic tumour and no obvious primary. Here,as part of the ICGC/TCGA Pan-Cancer Analysis of Whole Genomes (PCAWG) Consortium, we train a deep learning classifier to predict cancer type based on patterns of somatic passenger mutations detected in whole genome sequencing (WGS) of 2606 tumours representing 24 common cancer types produced by the PCAWG Consortium. Our classifier achieves an accuracy of 91% on held-out tumor samples and 88% and 83% respectively on independent primary and metastatic samples, roughly double the accuracy of trained pathologists when presented with a metastatic tumour without knowledge of the primary. Surprisingly, adding information on driver mutations reduced accuracy. Our results have clinical applicability, underscore how patterns of somatic passenger mutations encode the state of the cell of origin, and can inform future strategies to detect the source of circulating tumour DNA. Some cancer patients first present with metastases where the location of the primary is unidentified; these are difficult to treat. In this study, using machine learning, the authors develop a method to determine the tissue of origin of a cancer based on whole sequencing data.","authors":["Wei Jiao","Gurnit Atwal","Paz Polak","Rosa Karlic"],"meta":["February 2020Nature Communications 11(1):728","DOI:10.1038/s41467-019-13825-8"],"references":["349274041_Diagnosis_of_Metastatic_Neoplasms_Molecular_Approaches_for_Identification_of_Tissue_of_Origin","339060349_Patterns_of_somatic_structural_variation_in_human_cancer_genomes","339060061_The_repertoire_of_mutational_signatures_in_human_cancer","339058089_Pan-cancer_analysis_of_whole_genomes","339058003_Analyses_of_non-coding_somatic_drivers_in_2658_cancer_whole_genomes","339056784_Pathway_and_network_analysis_of_more_than_2500_whole_cancer_genomes","336756759_Pan-cancer_whole-genome_analyses_of_metastatic_solid_tumours","328941031_Sensitive_tumour_detection_and_classification_using_plasma_cell-free_DNA_methylomes","349246168_Undifferentiated_Tumor_True_Identity_by_Immunohistochemistry","324029514_Emerging_landscape_of_oncogenic_signatures_across_human_cancers"]}