{"id":"339079652_Medical_Nanorobotics_-_A_Technology_Overview","abstract":"The field of nanorobotics has primarily developed from the merging of the nanotechnology and robotics communities in the early 2000s. The challenge that scientists face when developing nanoscale machines – that are defined as systems below the scale of 100nm – is the technologically impossibility to simply scale down macro-sized machines into the nanoscale size. That is why new, highly interdisciplinary approaches are needed. Nanorobotics demands close cooperation between the fields of engineering, physics, chemistry, biology, computer science and material sciences. This emerging field has the potential to revolutionize processes in a large variety of different areas, ranging from medicine and environment to space and military applications, whereas the medical field seems to hold the most promising potential for future applications. Scientists have succeeded to develop and manufacture nanorobotic systems with a variety of different methods, that have already demonstrated promising results. However, nanorobotics is still a relatively young field and there needs to be more advancements and testing before it has matured enough to be publicly available. This paper aims to lay out the different methods and approaches to the development of nanorobotic systems, as well as compare andevaluate them in context of their applications.","authors":["Josef Andre"],"meta":["January 2019"],"references":["291801654_Folding_DNA_to_create_nanoscale_shapes_and_patterns","261408595_Universal_compting_by_DNA_origami_robots_in_a_living_animal","258924062_In_Situ_Structure_and_Dynamics_of_DNA_Origami_Determined_Through_Molecular_Dynamics_Simulations","257689186_3D_DNA_origami_designed_with_caDNAno","236899258_NanoRobotics_Current_Approaches_and_Techniques","221841931_A_Logic-Gated_Nanorobot_for_Targeted_Transport_of_Molecular_Payloads","38068054_Flagellated_Magnetotactic_Bacteria_as_Controlled_MRI-trackable_Propulsion_and_Steering_Systems_for_Medical_Nanorobots_Operating_in_the_Human_Microvasculature","243473929_Molecular_Stick-Slip_Motion_Revealed_by_Opening_DNA_with_Piconewton_Forces","224180834_OctoMag_An_Electromagnetic_System_for_5-DOF_Wireless_Micromanipulation","220122089_Algorithms_and_Software_for_Nanomanipulation_with_Atomic_Force_Microscopes","12238189_Powering_an_inorganic_nanodevice_with_a_biomolecular_motor","4034223_Viral_protein_linear_VPL_nano-actuators","12372168_A_DNA-fuelled_molecular_machine_made_of_DNA","6066163_Atomic_and_Molecular_Manipulation_with_the_Scanning_Tunneling_Microscope"]}