{"id":"339005787_Extending_classical_surrogate_modelling_to_high_dimensions_through_supervised_dimensionality_reduction_a_data-driven_approach","abstract":"Thanks to their versatility, ease of deployment and high-performance, surrogate models have become staple tools in the arsenal of uncertainty quantification (UQ). From local interpolants to global spectral decompositions, surrogates are characterised by their ability to efficiently emulate complex computational models based on a small set of model runs used for training. An inherent limitation of many surrogate models is their susceptibility to the curse of dimensionality, which traditionally limits their applicability to a maximum of O(102) input dimensions. We present a novel approach at high-dimensional surrogate modelling that is model-, dimensionality reduction- and surrogate model- agnostic (black box), and can enable the solution of high dimensional (i.e. up to 104) problems. After introducing the general algorithm, we demonstrate its performance by combining Kriging and polynomial chaos expansions surrogates and kernel principal component analysis. In particular, we compare the generalisation performance that the resulting surrogates achieve to the classical sequential application of dimensionality reduction followed by surrogate modelling on several benchmark applications, comprising an analytical function and two engineering applications of increasing dimensionality and complexity.","authors":["Christos Lataniotis","Stefano Marelli","Bruno Sudret"],"meta":["January 2020","DOI:10.1615/Int.J.UncertaintyQuantification.2020031935"],"references":["336676583_Manifold_Gaussian_Processes_for_Regression","332047477_Data-driven_polynomial_chaos_expansion_for_machine_learning_regression","324675030_Comparative_Study_of_Kriging_and_Support_Vector_Regression_for_Structural_Engineering_Applications","322328968_Compressive_sensing_adaptation_for_polynomial_chaos_expansions","320075231_The_Gaussian_Process_Modeling_Module_in_UQLab","331584131_PLS-based_adaptation_for_efficient_PCE_representation_in_high_dimensions","328727397_Numerical_Methods_for_Stochastic_Computations_A_Spectral_Method_Approach","321133827_A_Comparison_of_Three_Methods_for_Selecting_Values_of_Input_Variables_in_the_Analysis_of_Output_from_a_Computer_Code","309553422_Deep_Gaussian_Processes","309408525_Parallel_partial_Gaussian_process_emulation_for_computer_models_with_massive_output"]}