{"id":"339051843_Novel_Approach_to_Automatic_Traffic_Sign_Inventory_Based_on_Mobile_Mapping_System_Data_and_Deep_Learning","abstract":"Traffic signs are a key element in driver safety. Governments invest a great amount of resources in maintaining the traffic signs in good condition, for which a correct inventory is necessary. This work presents a novel method for mapping traffic signs based on data acquired with MMS (Mobile Mapping System): images and point clouds. On the one hand, images are faster to process and artificial intelligence techniques, specifically Convolutional Neural Networks, are more optimized than in point clouds. On the other hand, point clouds allow a more exact positioning than the exclusive use of images. The false positive rate per image is only 0.004. First, traffic signs are detected in the images obtained by the 360° camera of the MMS through RetinaNet and they are classified by their corresponding InceptionV3 network. The signs are then positioned in the georeferenced point cloud by means of a projection according to the pinhole model from the images. Finally, duplicate geolocalized signs detected in multiple images are filtered. The method has been tested in two real case studies with 214 images, where 89.7% of the signals have been correctly detected, of which 92.5% have been correctly classified and 97.5% have been located with an error of less than 0.5 m. This sequence, which combines images to detection–classification, and point clouds to geo-referencing, in this order, optimizes processing time and allows this method to be included in a company’s production process. The method is conducted automatically and takes advantage of the strengths of each data type.","authors":["Jesus Balado Frias","Elena González","Pedro Arias","David Castro"],"meta":["February 2020Remote Sensing 12(3):442","DOI:10.3390/rs12030442"],"references":["335959078_Review_of_Laser_Scanning_Technologies_and_Their_Applications_for_Road_and_Railway_Infrastructure_Monitoring","335077268_Road_Environment_Semantic_Segmentation_with_Deep_Learning_from_MLS_Point_Cloud_Data","332996426_Vision-Based_Traffic_Sign_Detection_and_Recognition_Systems_Current_Trends_and_Challenges","331536051_Automatic_Ship_Detection_Based_on_RetinaNet_Using_Multi-Resolution_Gaofen-3_Imagery","331171123_Localization_and_Extraction_of_Road_Poles_in_Urban_Areas_from_Mobile_Laser_Scanning_Data","331158671_Object_Recognition_Segmentation_and_Classification_of_Mobile_Laser_Scanning_Point_Clouds_A_State_of_the_Art_Review","330894558_Combined_Lane_Mapping_Using_a_Mobile_Mapping_System","339605796_Transfer_Learning_in_urban_object_classification_Online_images_to_recognize_point_clouds","333661040_Detecting_and_mapping_traffic_signs_from_Google_Street_View_images_using_deep_learning_and_GIS","330802318_Point_clouds_for_direct_pedestrian_pathfinding_in_urban_environments"]}