{"id":"339093154_Industry_40_concepts_within_the_Czech_SME_manufacturing_sector_an_empirical_assessment_of_critical_success_factors","abstract":"The paper analysed factors that has the most impact in influencing the achievement of a sustainable process management model in the implementation of Industry 4.0 concepts within the Czech SME manufacturing sector. Several factors were identified and their interactions with digital technologies within the production environments was analysed. These factors, from an organisational perspective were identified as critical to success in the quest to achieve Industry 4.0 compliance and digital transformation of the manufacturing operations of companies. They include: strategy, organisational fit, competitiveness, operations and human resources. A mixed methods approach was adopted for the research. It involved both the qualitative and quantitative methodological approaches. The qualitative aspect involved an extensive systematic review of relevant literature which was useful in developing the conceptual framework and identifying the relevant factors that enable the implementation of an efficient Industry 4.0 process management model in SMEs; the quantitative aspect involved the use of a survey questionnaire to collect data which was analysed using confirmatory factor analysis statistical approach to test the measures of the constructs in the proposed conceptual framework. The result from the statistical analysis shows the factors that in the conceptual model that were supported as being relevant in achieving an efficient process management model for successful implementation of Industry 4.0 concepts in Czech manufacturing SMEs. The research limitation is based on the fact that the SMEs covered in the quantitative aspect of the research are restricted to a particular geographical location – Czech Republic. It would be interesting to have similar studies conducted in other geographies for a comparative perspective. It contributes to the scientific and practical discourse on Industry 4.0 process management model implementation in SMEs by investigating the phenomenon through the production of credible scientific evidence.","authors":["Fortune Nwaiwu","Meri Duduci","Felicita Chromjakova","Cathy-Austin Funke Otekhile"],"meta":["February 2020Verslas Teorija ir Praktika 21(1):58-70","DOI:10.3846/btp.2020.10712"],"references":["332685825_Factors_introducing_Industry_40_to_SMEs","331713937_Drivers_and_Barriers_in_Using_Industry_40_A_Perspective_of_SMEs_in_Romania","329603618_Analysis_of_the_Difficulties_of_SMEs_in_Industry_40_Applications_by_Analytical_Hierarchy_Process_and_Analytical_Network_Process","328726147_A_Critical_Review_of_Smart_Manufacturing_Industry_40_Maturity_Models_Implications_for_Small_and_Medium-sized_Enterprises_SMEs","324687142_Contemporary_Issues_in_Strategic_Management","347355320_China's_manufacturing_locus_in_2025_With_a_comparison_of_Made-in-China_2025_and_Industry_40","334997482_Corporate_survival_in_Industry_40_era_the_enabling_role_of_lean-digitized_manufacturing","328892855_An_approach_to_support_Industry_40_adoption_in_SMEs_using_a_core-metamodel","327065391_Impact_of_Industry_40_on_Organizational_Structures","325156394_Smart_HR_40_-_how_industry_40_is_disrupting_HR"]}