{"id":"339180131_From_FAIR_research_data_toward_FAIR_and_open_research_software","abstract":"The Open Science agenda holds that science advances faster when we can build on existing results. Therefore, research data must be FAIR (Findable, Accessible, Interoperable, and Reusable) in order to advance the findability, reproducibility and reuse of research results. Besides the research data, all the processing steps on these data – as basis of scientific publications – have to be available, too.\nFor good scientific practice, the resulting research software should be both open and adhere to the FAIR principles to allow full repeatability, reproducibility, and reuse. As compared to research data, research software should be both archived for reproducibility and actively maintained for reusability.\nThe FAIR data principles do not require openness, but research software should be open source software. Established open source software licenses provide sufficient licensing options, such that it should be the rare exception to keep research software closed.\nWe review and analyze the current state in this area in order to give recommendations for making research software FAIR and open.","authors":["Wilhelm Hasselbring","Leslie Carr","Simon Hettrick","Heather Packer"],"meta":["February 2020it - Information Technology 62(1)","DOI:10.1515/itit-2019-0040"],"references":["344925531_The_Role_of_Standards_for_Interoperating_Information_Systems","337239404_Towards_FAIR_principles_for_research_software","335498171_Standing_on_Shoulders_or_Feet_The_Usage_of_the_MSR_Data_Papers","330717481_Qresp_a_tool_for_curating_discovering_and_exploring_reproducible_scientific_papers","330640421_Streamlining_the_Inclusion_of_Computer_Experiments_In_a_Research_Paper","326211419_SIGIR_Initiative_to_Implement_ACM_Artifact_Review_and_Badging","325750140_Software_Architecture_Past_Present_Future","333595376_Free_and_Open_Source_Software_Licenses_Explained","332818995_The_open_science_initiative_of_the_Empirical_Software_Engineering_journal","326371214_Software_Citation_in_Theory_and_Practice_6th_International_Conference_South_Bend_IN_USA_July_24-27_2018_Proceedings"]}