{"id":"339104733_Application_of_Hidden_Markov_Models_to_quantify_the_impact_of_enrollment_patterns_on_student_performance","abstract":"Simplified categorizations have often led to college students being labeled as full-time or part-time students. However, at many universities student enrollment patterns can be much more complicated, as it is not uncommon for students to alternate between full-time and part-time enrollment each semester based on finances, scheduling, or family needs. While prior research has established that full-time students maintain better outcomes than their part-time counterparts, little study has examined the impact of mixed enrollment patterns on academic outcomes. In this paper, we apply a Hidden Markov Model to identify students' enrollment strategies according to three different categories: part-time, full-time, and mixed enrollment. According to the enrollment classification we investigate and compare the academic performance outcomes of each group. Analysis of data collected from the University of Central Florida from 2008 to 2017 indicates that mixed enrollment students are closer in performance to full-time students, than part-time students. More importantly, during their part-time semesters, mixed-enrollment students significantly outper-form part-time students. Such a finding suggests that increased engagement through the occasional full-time enrollment leads to better overall outcomes.","authors":["Shahab Boumi","Adan Vela"],"meta":["July 2019","Conference: 2019 Educational Data Mining ConferenceAt: Montreal, Canada","Project: Predictive Analytics"],"references":["260351290_Race_income_and_enrollment_patterns_in_highly_selective_colleges_1982-2004","221297413_Modeling_learning_patterns_of_students_with_a_tutoring_system_using_Hidden_Markov_Models","301322517_A_Data-Driven_Approach_for_Inferring_Student_Proficiency_from_Game_Activity_Logs","263196413_A_Longitudinal_Analysis_of_the_Frequency_of_Part-Time_Enrollment_and_the_Persistence_of_Students_Who_Enroll_Part_Time","259123595_Working_and_studying_day_and_night_Heterogeneous_effects_of_working_on_the_academic_performance_of_full-time_and_part-time_students","226915273_Factors_associated_with_one-year_retention_in_a_community_college","226564156_Emerging_Variations_in_Postsecondary_Attendance_Patterns_An_Investigation_of_Part-Time_Delayed_and_Nondegree_Enrollment","220049807_Investigating_the_Relationship_Between_Dialogue_Structure_and_Tutoring_Effectiveness_A_Hidden_Markov_Modeling_Approach","4837875_Attendance_at_Higher-Cost_Colleges_Ascribed_Socioeconomic_and_Academic_Influences_on_Student_Enrollment_Patterns"]}