{"id":"339143992_Pengembangan_e-modul_berorientasi_KKNI_pada_perkuliahan_Pendidikan_Kewarganegaraan_Universitas_Sriwijaya","abstract":"Penelitian ini ini bertujuan untuk mengembangkan e-modul berorientasi KKNI pada perkuliahan pendidikan kewarganegaraan dan dampak potensial e-modul berorientasi KKNI terhadap hasil belajar mahasiswa pada perkuliahan pendidikan kewarganegaraan. Penelitian pengembangan ini menggunakan model ADDIE. Subjek penelitian yang ditetapkan adalah mahasiswa ilmu komputer dan jaringan yang mengambil Mata Kuliah Pendidikan Kewarganegaraan pada semester Ganjil 2017-2018. Data dikumpulkan melalui teknik dokumentasi, angket, observasi dan tes. Selanjutnya teknik analisis data yang digunakan ialah analisis data kuantitatif. Selain data hasil studi pendahuluan, data angket yang berkaitan dengan validitas produk juga dianalisis dengan menggunakan analisis deskriptif. Berdasarkan hasil analisis dan pembahasan maka disimpulkan e-modul berorientasi KKNI yang dikembangkan ini valid, praktis dan berefek potensial dalam meningkatkan pemahaman mahasiswa terhadap materi. Terkategorikan valid setelah mendapatkan hasil 92% dari validasi ahli bahasa dan 92% ahli materi. Kemudian dalam tiga kali tahapan uji coba mendapatkan tanggapan yang positif dari para mahasiswa penggunannya. Dan pada uji coba lapangan terdapat N-gain 0,6 dengan kategori sedang dari perbandingan pre tes dan pos tes yang dilakukan.-------------------------------------------------------Development of the KKNI-oriented e-module in the lecturing on Citizenship Education at Sriwijaya UniversityThis study aims to develop KKNI-oriented e-modules in lectures on citizenship education and the potential impact of KKNI-oriented e-modules on student learning outcomes in lectures on citizenship education. This developmental research uses the ADDIE model. The research subjects were computer science and network students who took Citizenship Education Courses in the Odd Semester 2017-2018. Data were collected through documentation techniques, questionnaires, observations, and tests. Furthermore, the data analysis technique used is quantitative data analysis. In addition to the data from the preliminary study, questionnaire data related to product validity were also analyzed using descriptive analysis. Based on the results of the analysis and discussion, it was concluded that the KKNI-oriented e-module developed was valid, practical and had a potential effect in increasing students' understanding of the material. It is categorized as valid after getting 92% results from linguist validation and 92% material experts. Then in the three stages of the trial, there was a positive response from the students. And in the field trials, there are N-gain 0.6 with a moderate category from the comparison of the pre-test and post-tests conducted.","authors":["Husnul Fatihah","Sri Artati Waluyati","Camellia Camellia"],"meta":["October 2018Jurnal Civics Media Kajian Kewarganegaraan 15(2):141-147","DOI:10.21831/jc.v15i2.18712"],"references":["316563223_MODUL_VIRTUAL_MULTIMEDIA_FLIPBOOK_DASAR_TEKNIK_DIGITAL","301978310_Competences_for_Teaching_Learning_and_Living_Democratic_Citizenship"]}