{"id":"339157550_STELAR_a_statistically_consistent_coalescent-based_species_tree_estimation_method_by_maximizing_triplet_consistency","abstract":"Background: \nSpecies tree estimation is frequently based on phylogenomic approaches that use multiple genes from throughout the genome. However, estimating a species tree from a collection of gene trees can be complicated due to the presence of gene tree incongruence resulting from incomplete lineage sorting (ILS), which is modelled by the multi-species coalescent process. Maximum likelihood and Bayesian MCMC methods can potentially result in accurate trees, but they do not scale well to large datasets.\n\nResults: \nWe present STELAR (Species Tree Estimation by maximizing tripLet AgReement), a new fast and highly accurate statistically consistent coalescent-based method for estimating species trees from a collection of gene trees. We formalized the constrained triplet consensus (CTC) problem and showed that the solution to the CTC problem is a statistically consistent estimate of the species tree under the multi-species coalescent (MSC) model. STELAR is an efficient dynamic programming based solution to the CTC problem which is highly accurate and scalable. We evaluated the accuracy of STELAR in comparison with SuperTriplets, which is an alternate fast and highly accurate triplet-based supertree method, and with MP-EST and ASTRAL - two of the most popular and accurate coalescent-based methods. Experimental results suggest that STELAR matches the accuracy of ASTRAL and improves on MP-EST and SuperTriplets.\n\nConclusions: \nTheoretical and empirical results (on both simulated and real biological datasets) suggest that STELAR is a valuable technique for species tree estimation from gene tree distributions.","authors":["Mazharul Islam","Kowshika Sarker","Trisha Das","Rezwana Reaz"],"meta":["February 2020BMC Genomics 21(1)","DOI:10.1186/s12864-020-6519-y"],"references":["325017725_ASTRAL-III_Polynomial_time_species_tree_reconstruction_from_partially_resolved_gene_trees","322602418_Gene_tree_parsimony_for_incomplete_gene_trees_Addressing_true_biological_loss","302584366_Phylotranscriptomic_analysis_of_the_origin_and_early_diversification_of_land_plants","284161508_Phylogenomics_Controlling_for_Base_Compositional_Bias_Reveals_a_Single_Origin_of_Eusociality_in_Corbiculate_Bees","283005517_ASTRID_Accurate_species_TRees_from_internode_distances","278331707_ASTRAL-II_Coalescent-based_species_tree_estimation_with_many_hundreds_of_taxa_and_thousands_of_genes","331311687_Statistical_binning_enables_an_accurate_coalescent-based_estimation_of_the_avian_tree","312913346_Identifying_the_rooted_species_tree_from_the_distribution_of_unrooted_gene_trees_under_the_coalescent","309743622_INFERRING_OPTIMAL_SPECIES_TREES_UNDER_GENE_DUPLICATION_AND_LOSS","307939479_Incomplete_Lineage_Sorting_in_Mammalian_Phylogenomics"]}