{"id":"339182228_Real-Time_Detection_of_DoS_Attacks_in_IEEE_80211p_Using_Fog_Computing_for_Secure_Intelligent_Vehicular_Network","abstract":"The vehicular ad hoc network (VANET) is a method through which Intelligent Transportation Systems (ITS) have become important for the benefit of daily life. Real-time detection of all forms of attacks, including hybrid DoS attacks in IEEE 802.11p, has become an urgent issue for VANET. This is due to sporadic real-time exchange of safety and road emergency message delivery in VANET. Sporadic communication in VANET has the tendency to generate an enormous amount of messages. This leads to overutilization of the road side unit (RSU) or the central processing unit (CPU) for computation. Therefore, efficient storage and intelligent VANET infrastructure architecture (VIA), which includes trustworthiness, are required. Vehicular Cloud and Fog Computing (VFC) play an important role in efficient storage, computation, and communication needs for VANET. This research utilizes VFC integration with hybrid optimization algorithms (OAs), which also possess swarm intelligence, including Cuckoo/CSA Artificial Bee Colony (ABC) and Firefly/Genetic Algorithm (GA), to provide real-time detection of DoS attacks in IEEE 802.11p, using VFC for a secure intelligent vehicular network. Vehicles move ar a certain speed and the data is transmitted at 30 Mbps. Firefly Feed forward back propagation neural network (FFBPNN) is used as a classifier to distinguish between the attacked vehicles and the genuine vehicles. The proposed scheme is compared with Cuckoo/CSA ABC and Firefly GA by considering jitter, throughput, and prediction accuracy.","authors":["Samuel Kofi Erskine","Khaled Elleithy"],"meta":["February 2020Electronics 8(7):49","DOI:10.3390/electronics80707763","Project: Real-Time Detection of DoS in IEEE 802.11p Using Fog Computing for Secure Intelligent Vehicular Network"],"references":["332538246_Secure_Intelligent_Vehicular_Network_Using_Fog_Computing","325294660_Sybil_attack_prevention_through_identity_symmetric_scheme_in_vehicular_ad-hoc_networks","323860496_5G_next_generation_VANETs_using_SDN_and_fog_computing_framework","322779772_An_effective_misbehavior_detection_model_using_artificial_neural_network_for_vehicular_ad_hoc_network_applications","322710206_Prevention_of_denial_of_service_attack_over_vehicle_ad_hoc_networks_using_quick_response_table","326056511_A_state-of-art_approach_to_misbehaviour_detection_and_revocation_in_VANET_Survey","325563272_Integrated_Authentication_and_Key_Agreement_Framework_for_Vehicular_Cloud_Computing","325240215_Decomposition_based_multiobjective_spectrum_allocation_algorithm_for_cognitive_vehicular_networks","324650090_A_survey_on_Intrusion_Detection_Systems_and_Honeypot_based_proactive_security_mechanisms_in_VANETs_and_VANET_Cloud","322994322_Hybrid_fuzzy_multi-criteria_decision_making_based_multi_cluster_head_dolphin_swarm_optimized_IDS_for_VANET"]}