{"id":"339194213_Velocity_distribution_of_larger_meteoroids_and_small_asteroids_impacting_Earth","abstract":"Various meteor and fireball networks exist worldwide. Most data sets which include ground-based observational data of meteors are affected by biases. The larger and faster the entering meteoroid, the brighter is the produced meteor. Hence, small and slow objects often stay undetected. This bias of meteor observations towards faster meteoroids is a challenge if quantitative population and flux models are derived. In this work the velocity distribution of objects in space is analysed by using different data sets that are not affected by this velocity bias since they include only large objects, like the near-Earth object (NEO) risk list of ESA’s (European Space Agency) SSA (Space Situational Awareness) near-Earth object Coordination Centre (NEOCC), and the fireballs in NASA’s (National Aeronautics and Space Administration) CNEOS (Center for near-Earth object Studies) JPL (Jet Propulsion Laboratory) fireball database. Additionally, when only the largest objects recorded with the CILBO (Canary Island Long-Baseline Observatory) camera setup were analysed, a very similar distribution was shown. These velocity distributions are in good agreement with a widely used velocity distribution for smaller sporadic meteoroids in free space which was adopted as reference by the ECSS (European Cooperation for Space Standardisation) Space Environment Standard.","authors":["Esther Drolshagen","Theresa Ott","Detlef Koschny","G. Drolshagen"],"meta":["February 2020Planetary and Space Science 184:104869","DOI:10.1016/j.pss.2020.104869"],"references":["315514467_Asteroid_Impact_Effects_And_Their_Immediate_Hazards_For_Human_Populations","313456811_Fully_correcting_the_meteor_speed_distribution_for_radar_observing_biases","303380477_Dynamics_and_distribution_of_Jovian_dust_ejected_from_the_Galilean_satellites_DUST_PARTICLES_FROM_THE_GALILEAN_MOONS","344877733_Observation_of_metre-scale_impactors_by_the_Desert_Fireball_Network","316976468_Intercomparison_of_radar_meteor_velocity_corrections_using_different_ionization_coefficients","313739313_Mass_Accumulation_of_Earth_from_Interplanetary_Dust_Meteoroids_Asteroids_and_Comets","312418631_Flux_densities_of_meteoroids_derived_from_optical_double-station_observations","300140027_Orbits_Long-Term_Predictions_Impact_Monitoring","286871001_Meteor_velocity_distribution_from_CILBO_double_station_video_camera_data","285459196_Memoire_sur_la_probabilite_des_causes_par_les_evenements"]}