{"id":"339153688_Detecting_Extreme_Values_with_Order_Statistics_in_Samples_from_Continuous_Distributions","abstract":"In the subject of statistics for engineering, physics, computer science, chemistry, and earth sciences, one of the sampling challenges is the accuracy, or, in other words, how representative the sample is of the population from which it was drawn. A series of statistics were developed to measure the departure between the population (theoretical) and the sample (observed) distributions. Another connected issue is the presence of extreme values—possible observations that may have been wrongly collected—which do not belong to the population selected for study. By subjecting those two issues to study, we hereby propose a new statistic for assessing the quality of sampling intended to be used for any continuous distribution. Depending on the sample size, the proposed statistic is operational for known distributions (with a known probability density function) and provides the risk of being in error while assuming that a certain sample has been drawn from a population. A strategy for sample analysis, by analyzing the information about quality of the sampling provided by the order statistics in use, is proposed. A case study was conducted assessing the quality of sampling for ten cases, the latter being used to provide a pattern analysis of the statistics.","authors":["Lorentz Jäntschi"],"meta":["February 2020","DOI:10.3390/math8020216"],"references":["341565127_Data-Driven_Ohmic_Resistance_Estimation_of_Battery_Packs_for_Electric_Vehicles","337877381_A_New_Record_of_Graph_Enumeration_Enabled_by_Parallel_Processing","336399090_Uncertainty_Quantification_for_Space_Situational_Awareness_and_Traffic_Management","335704576_Dynamic_Properties_of_Foreign_Exchange_Complex_Network","334016087_A_Test_Detecting_the_Outliers_for_Continuous_Distributions_Based_on_the_Cumulative_Distribution_Function_of_the_Data_Being_Tested","333835995_Investigating_the_Randomness_of_Passengers'_Seating_Behavior_in_Suburban_Trains","332672261_Application_of_the_Mathematical_Simulation_Methods_for_the_Assessment_of_the_Wastewater_Treatment_Plant_Operation_Work_Reliability","325399519_Computation_of_Probability_Associated_with_Anderson-Darling_Statistic","320001652_Performances_of_Shannon's_Entropy_Statistic_in_Assessment_of_Distribution_of_Data","328037054_Universal_rank-size_statistics_in_network_traffic_Modeling_collective_access_patterns_by_Zipf's_law_with_long-term_correlations"]}