{"id":"339126637_Person-centered_methods_in_vocational_research","abstract":"The vast majority of vocational research adopts a variable-centered approach. Implicit in this approach is the assumption that the population under study is homogeneous, and that therefore we can use a set of “averaged” parameters to describe it. Person-centered methods are a family of methods that relax this assumption of population homogeneity, viewing the individual as holistic and paying more attention to how specific configurations of variables, present in different subgroups of the population, act in concert to shape behavior. Despite the potential advantages of person-centered research, the adoption of this approach by vocational researchers has been relatively slow for both conceptual (e.g., What exactly is person-centered research?) and methodological (e.g., Which methods?) reasons. In response to these issues, the goal of the present article is to showcase the role and relevance of person-centered methods for vocational research. Having discussed different conceptualizations of the term “person-centered” we present a structured overview of the most relevant person-centered techniques. This overview includes a description of the formal characteristics of each technique, as well as an overview of existing applications of these techniques in the literature. Finally, we provide a balanced discussion of both the advantages and challenges associated with the person-centered approach.","authors":["Joeri Hofmans","Bart Wille","Bert HJ Schreurs"],"meta":["February 2020Journal of Vocational Behavior 118:103398","DOI:10.1016/j.jvb.2020.103398"],"references":["332767256_Social_aspects_of_career_choice_from_the_perspective_of_habitus_theory","326881567_Academic_career_development_A_review_and_research_agenda","325401646_Person-Centered_Methodologies_in_the_Organizational_Sciences_Introduction_to_the_Feature_Topic","328743677_The_time_has_come_to_study_dynamics_at_work","328406477_Work-family_conflict_and_enrichment_An_exploration_of_dyadic_typologies_of_work-family_balance","327864504_Investigating_the_combined_effects_of_workaholism_and_work_engagement_A_substantive-methodological_synergy_of_variable-centered_and_person-centered_methodologies","326749932_Conceptualizing_calling_Cluster_and_taxometric_analyses","325983267_Sustainable_careers_Towards_a_conceptual_model","325942381_Insight_into_job_search_self-regulation_Effects_of_employment_self-efficacy_and_perceived_progress_on_job_search_intensity","325856834_Exploring_Science_Career_Interest_Latent_Profile_Analysis_of_High_School_Occupational_Preferences_for_Science"]}