{"id":"339140687_An_exploratory_research_on_grammar_checking_of_Bangla_sentences_using_statistical_language_models","abstract":"N-gram based language models are very popular and extensively used statistical methods for solving various natural language processing problems including grammar checking. Smoothing is one of the most effective techniques used in building a language model to deal with data sparsity problem. Kneser-Ney is one of the most prominently used and successful smoothing technique for language modelling. In our previous work, we presented a Witten-Bell smoothing based language modelling technique for checking grammatical correctness of Bangla sentences which showed promising results outperforming previous methods. In this work, we proposed an improved method using Kneser-Ney smoothing based n-gram language model for grammar checking and performed a comparative performance analysis between Kneser-Ney and Witten-Bell smoothing techniques for the same purpose. We also provided an improved technique for calculating the optimum threshold which further enhanced the the results. Our experimental results show that, Kneser-Ney outperforms Witten-Bell as a smoothing technique when used with n-gram LMs for checking grammatical correctness of Bangla sentences.","authors":["Riazur Rahman","Md. Tarek Habib","Md. Sadekur Rahman","Gazi Zahirul Islam"],"meta":["June 2020International Journal of Electrical and Computer Engineering 10(3):3244-3252","DOI:10.11591/ijece.v10i3.pp3244-3252"],"references":["340357838_Robotic_navigation_algorithm_with_machine_vision","339802306_Optimization_of_house_purchase_recommendation_system_HPRS_using_genetic_algorithm","339600930_Rice_Grain_Classification_using_Multi-class_Support_Vector_Machine_SVM","339600862_Review_of_anomalous_sound_event_detection_approaches","330803928_An_investigative_design_of_optimum_stochastic_language_model_for_bangla_autocomplete","329337573_A_Context-Sensitive_Approach_to_Find_Optimum_Language_Model_for_Automatic_Bangla_Spelling_Correction","323075114_An_Exploratory_Approach_to_Find_a_Novel_Metric_Based_Optimum_Language_Model_for_Automatic_Bangla_Word_Prediction","311693706_An_Investigative_Design_Based_Statistical_Approach_for_Determining_Bangla_Sentence_Validity","321600641_Natural_Language_Processing_The_PLNLP_Approach","317646318_Statistical_Language_Learning"]}