{"id":"339172506_Disease_Classification_in_Eggplant_Using_Pre-trained_VGG16_and_MSVM","abstract":"Currently, the application of deep learning in crop disease classification is one of the active areas of research for which an image dataset is required. Eggplant (Solanum melongena) is one of the important crops, but it is susceptible to serious diseases which hinder its production. Surprisingly, so far no dataset is available for the diseases in this crop. The unavailability of the dataset for these diseases motivated the authors to create a standard dataset in laboratory and field conditions for five major diseases. Pre-trained Visual Geometry Group 16 (VGG16) architecture has been used and the images have been converted to other color spaces namely Hue Saturation Value (HSV), YCbCr and grayscale for evaluation. Results show that the dataset created with RGB and YCbCr images in field condition was promising with a classification accuracy of 99.4%. The dataset also has been evaluated with other popular architectures and compared. In addition, VGG16 has been used as feature extractor from 8th convolution layer and these features have been used for classifying diseases employing Multi-Class Support Vector Machine (MSVM). The analysis depicted an equivalent or in some cases produced better accuracy. Possible reasons for variation in interclass accuracy and future direction have been discussed.","authors":["Aravind Krishnaswamy Rangarajan","P. Raja"],"meta":["February 2020Scientific Reports 10(1):2322","DOI:10.1038/s41598-020-59108-x"],"references":["331625384_Visual_Tea_Leaf_Disease_Recognition_Using_a_Convolutional_Neural_Network_Model","331407208_Rice_Blast_Disease_Recognition_Using_a_Deep_Convolutional_Neural_Network","326957145_Impact_of_dataset_size_and_variety_on_the_effectiveness_of_deep_learning_and_transfer_learning_for_plant_disease_classification","325824675_Factors_influencing_the_use_of_deep_learning_for_plant_disease_recognition","323357827_Deep_Learning_in_Agriculture_A_Survey","330077871_Grape_Crop_Disease_Classification_Using_Transfer_Learning_Approach","328664988_A_recognition_method_for_cucumber_diseases_using_leaf_symptom_images_based_on_deep_convolutional_neural_network","324682936_Deep_convolutional_neural_networks_for_mobile_capture_device-based_crop_disease_classification_in_the_wild","324126587_A_comparative_study_of_fine-tuning_deep_learning_models_for_plant_disease_identification","322941653_Deep_learning_models_for_plant_disease_detection_and_diagnosis"]}