{"id":"339120901_Blind_Mesh_Assessment_Based_on_Graph_Spectral_Entropy_and_Spatial_Features","abstract":"With the wide applications of three-dimensional (3D) meshes in intelligent manufacturing, digital animation, virtual reality, digital cities and other fields, more and more processing techniques are being developed for 3D meshes, including watermarking, compression, and simplification, which will inevitably lead to various distortions. Therefore, how to evaluate the visual quality of 3D mesh is becoming an important problem and it is necessary to design effective tools for blind 3D mesh quality assessment. In this paper, we propose a new Blind Mesh Quality Assessment method based on Graph Spectral Entropy and Spatial features, called as BMQA-GSES. 3D mesh can be represented as graph signal, in the graph spectral domain, the Gaussian curvature signal of the 3D mesh is firstly converted with Graph Fourier transform (GFT), and then the smoothness and information entropy of amplitude features are extracted to evaluate the distortion. In the spatial domain, four well-performing spatial features are combined to describe the concave and convex information and structural information of 3D meshes. All the extracted features are fused by the random forest regression to predict the objective quality score of the 3D mesh. Experiments are performed successfully on the public databases and the obtained results show that the proposed BMQA-GSES method provides good correlation with human visual perception and competitive scores compared to state-of-art quality assessment methods.","authors":["Chung-Ping Lin","Xinjun Yu","Wei Chen","Man Jiang"],"meta":["February 2020Entropy 22(2):190","DOI:10.3390/e22020190"],"references":["336930506_Nonreference_Image_Quality_Evaluation_Algorithm_Based_on_Wavelet_Convolutional_Neural_Network_and_Information_Entropy","330592008_Signal_Processing_on_Static_and_Dynamic_3D_Meshes_Sparse_Representations_and_Applications","330492212_Information_Entropy_of_Tight-Binding_Random_Networks_with_Losses_and_Gain_Scaling_and_Universality","324487458_Mesh_Visual_Quality_Assessment_Metrics_A_Comparison_Study","323152187_Blind_3D_mesh_visual_quality_assessment_using_support_vector_regression","323354195_A_convolutional_neural_network_framework_for_blind_mesh_visual_quality_assessment","318738699_A_missing_temperature_data_estimation_method_using_graph_Fourier_transform","318667744_Uncertainty_Principles_and_Sparse_Eigenvectors_of_Graphs","317143007_Mesh_segmentation_by_combining_mesh_saliency_with_spectral_clustering","313636599_Mesh_Measuring_errors_between_surfaces_using_the_hausdorff_distance"]}