{"id":"339114610_A_Cascaded_R-CNN_With_Multiscale_Attention_and_Imbalanced_Samples_for_Traffic_Sign_Detection","abstract":"In recent years, the deep learning is applied to the field of traffic sign detection methods which achieves excellent performance. However, there are two main challenges in traffic sign detection to be solve urgently. For one thing, some traffic signs of small size are more difficult to detect than those of large size so that the small traffic signs are undetected. For another, some false signs are always detected because of interferences caused by the illumination variation, bad weather and some signs similar to the true traffic signs. Therefore, to solve the undetection and false detection, we first propose a cascaded R-CNN to obtain the multiscale features in pyramids. Each layer of the cascaded network except the first layer fuses the output bounding box of the previous one layer for joint training. This method contributes to the traffic sign detection. Then, we propose a multiscale attention method to obtain the weighted multiscale features by dot-product and softmax, which is summed to fine the features to highlight the traffic sign features and improve the accuracy of the traffic sign detection. Finally, we increase the number of difficult negative samples for dataset balance and data augmentation in the training to relieve the interference by complex environment and similar false traffic signs. The data augment method expands the German traffic sign training dataset by simulation of complex environment changes. We conduct numerous experiments to verify the effectiveness of our proposed algorithm. The accuracy and recall rate of our method are 98.7% and 90.5% in GTSDB, 99.7% and 83.62% in CCTSDB and 98.9% and 85.6% in Lisa dataset respectively.","authors":["Jianming Zhang","Zhipeng Xie","Juan Sun","Xin Zou"],"meta":["February 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2972338"],"references":["338503788_Libra_R-CNN_Towards_Balanced_Learning_for_Object_Detection","334819523_Lightweight_deep_network_for_traffic_sign_classification","334061806_Spatially_Attentive_Visual_Tracking_Using_Multi-Model_Adaptive_Response_Fusion","332616180_A_full_convolutional_network_based_on_DenseNet_for_remote_sensing_scene_classification","332134523_Dual_Model_Learning_Combined_With_Multiple_Feature_Selection_for_Accurate_Visual_Tracking","332952197_Deep_Learning_for_Large-Scale_Traffic-Sign_Detection_and_Recognition","332700865_Automatic_Traffic_Sign_Detection_and_Recognition_Using_SegU-Net_and_a_Modified_Tversky_Loss_Function_With_L1-Constraint","331615657_An_Asynchronous_Clustering_and_Mobile_Data_Gathering_Schema_Based_on_Timer_Mechanism_in_Wireless_Sensor_Networks","330814611_VSSA-NET_Vertical_Spatial_Sequence_Attention_Network_for_Traffic_Sign_Detection","330663688_An_Efficient_Convolutional_Neural_Network_for_Small_Traffic_Sign_Detection"]}