{"id":"339109553_Born-digital_biodiversity_data_Millions_and_billions","abstract":"Given the dramatic pace of change of our planet, we need rapid collection of environmental data to document how species are coping and to evaluate the impact of our conservation interventions. To address this need, new classes of “born digital” biodiversity records are now being collected and curated many orders of magnitude faster than traditional data. In addition to the millions of citizen science observations of species that have been accumulating over the last decade, the last few years have seen a surge of sensor data, with eMammal's camera trap archive passing 1 million photo‐vouchered specimens and Movebank's animal tracking database recently passing 1.5 billion animal locations. Data from digital sensors have other advantages over visual citizen science observation in that the level of survey effort is intrinsically documented and they can preserve digital vouchers that can be used to verify species identity. These novel digital specimens are leading spatial ecology into the era of Big Data and will require a big tent of collaborating organizations to make these databases sustainable and durable. We urge institutions to recognize the future of born‐digital records and invest in proper curation and standards so we can make the most of these records to inform management, inspire conservation action and tell natural history stories about life on the planet.","authors":["Roland Kays","William McShea","Martin Wikelski"],"meta":["May 2020Diversity and Distributions 26(5)","DOI:10.1111/ddi.12993"],"references":["331653496_Essential_biodiversity_variables_for_mapping_and_monitoring_species_populations","330583636_Do_Big_Unstructured_Biodiversity_Data_Mean_More_Knowledge","329659274_Citizen_Science_in_Schools_Students_Collect_Valuable_Mammal_Data_for_Science_Conservation_and_Community_Engagement","329584688_Mammal_collections_of_the_Western_Hemisphere_A_survey_and_directory_of_collections","328870859_A_perfect_storm_for_mammalogy_Declining_sample_availability_in_a_period_of_rapid_environmental_degradation","322706497_Moving_in_the_Anthropocene_Global_reductions_in_terrestrial_mammalian_movements","316628448_Integrating_multiple_data_sources_in_species_distribution_modeling_A_framework_for_data_fusion","329165743_Accuracy_of_identifications_of_mammal_species_from_camera_trap_images_A_northern_Australian_case_study","329012901_Situating_Ecology_as_a_Big-Data_Science_Current_Advances_Challenges_and_Solutions","316021839_Safari_Science_Assessing_the_reliability_of_citizen_science_data_for_wildlife_surveys"]}