{"id":"339129398_Rotation_invariant_descriptors_for_galaxy_morphological_classification","abstract":"The detection of multi-oriented objects is a difficult pattern recognition problem. In this paper, we propose to evaluate the performance of different families of descriptors for the classification of galaxy morphologies. We investigate the performance of the Hu moments, Flusser moments, Zernike moments, Fourier–Mellin moments, and ring projection techniques based on 1D moment and the Fourier transform. We consider two main datasets for the performance evaluation. The first dataset is an artificial dataset based on representative templates from 11 types of galaxies, which are evaluated with different transformations (noise, smoothing), alone or combined. The evaluation is based on image retrieval performance to estimate the robustness of the rotation invariant descriptors with this type of images. The second dataset is composed of real images extracted from the Galaxy Zoo 2 project. The binary classification of elliptical and spiral galaxies is achieved with pre-processing steps including morphological filtering and a Laplacian pyramid. For the binary classification, we compare the different set of features with Support Vector Machines, Extreme Learning Machine, and different types of linear discriminant analysis techniques. The results support the conclusion that the proposed framework for the binary classification of elliptical and spiral galaxies provides an area under the receiver operating characteristic curve reaching 99.54%, proving the robustness of the approach for helping astronomers to study galaxies.","authors":["Hubert Cecotti"],"meta":["August 2020International Journal of Machine Learning and Cybernetics 11(2)","DOI:10.1007/s13042-020-01075-w"],"references":["344959518_Galaxy_morphology_prediction_using_Capsule_Networks","324281612_Applied_Regression_Analysis","319770387_Deep_Sparse_Rectifier_Neural_Networks","316821209_Classifying_Radio_Galaxies_with_Convolutional_Neural_Network","312982289_Bayesian_interpolation","312944963_Position_Rotation_And_Scale_Invariant_Optical_Correlation","306157314_Extreme_learning_machine_for_regression_and_multiclass_classification","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","293016747_Active_graph_based_semi-supervised_learning_using_image_matching_Application_to_handwritten_digit_recognition","284702535_Transformation-ring-projection_TRP_algorithm_and_its_VLSI_implementation","277411157_Deep_Learning","283921280_Visual_Pattern_Recognition_by_Moment_Invariants","282854204_Leveraging_Pattern_Recognition_Consistency_Estimation_for_Crowdsourcing_Data_Analysis","280940018_Pattern_Recognition_and_Machine_Learning","278169358_An_Insight_into_Extreme_Learning_Machines_Random_Neurons_Random_Features_and_Kernels"]}