{"id":"339144342_Training_deep_quantum_neural_networks","abstract":"Neural networks enjoy widespread success in both research and industry and, with the advent of quantum technology, it is a crucial challenge to design quantum neural networks for fully quantum learning tasks. Here we propose a truly quantum analogue of classical neurons, which form quantum feedforward neural networks capable of universal quantum computation. We describe the efficient training of these networks using the fidelity as a cost function, providing both classical and efficient quantum implementations. Our method allows for fast optimisation with reduced memory requirements: the number of qudits required scales with only the width, allowing deep-network optimisation. We benchmark our proposal for the quantum task of learning an unknown unitary and find remarkable generalisation behaviour and a striking robustness to noisy training data. It is hard to design quantum neural networks able to work with quantum data. Here, the authors propose a noise-robust architecture for a feedforward quantum neural network, with qudits as neurons and arbitrary unitary operations as perceptrons, whose training procedure is efficient in the number of layers.","authors":["Kerstin Beer","Dmytro Bondarenko","Terry Farrelly","Tobias J. Osborne"],"meta":["February 2020Nature Communications 11(1):808","DOI:10.1038/s41467-020-14454-2"],"references":["337133378_Unsupervised_Classification_of_Quantum_Data","336933776_Continuous-variable_quantum_neural_networks","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","334519357_Quantum_optical_neural_networks","324472457_Hierarchical_quantum_classifiers","324167347_Circuit-centric_quantum_classifiers","324104887_Barren_plateaus_in_quantum_neural_network_training_landscapes","332857415_Optimal_Probabilistic_Storage_and_Retrieval_of_Unitary_Channels","329381870_Machine_learning_method_for_state_preparation_and_gate_synthesis_on_photonic_quantum_computers","323562671_Machine_learning_artificial_intelligence_in_the_quantum_domain_A_review_of_recent_progress"]}