{"id":"339231908_What_Support_do_Systematic_Reviews_Provide_for_Evidence-informed_Teaching_about_Software_Engineering_Practice","abstract":"Background: The adoption of the evidence-based research paradigm by software engineering researchers has created a growing knowledge base provided by the outcomes from systematic reviews. \nAim: We set out to identify and catalogue a sample of the knowledge provided by systematic reviews, to determine what support they can provide for an evidence-informed approach to teaching about software engineering practice. \nMethod: We undertook a tertiary study (a mapping study of systematic reviews) covering the period to the end of 2015. We identified and catalogued those reviews that had findings or made recommendations that were considered relevant to teaching about industry practice. \nResults: We examined a sample of 276 systematic reviews, selecting 49 for which we could clearly identify practice-oriented findings and recommendations that were supported by the data analysis provided in the review. We have classified these against established software engineering education knowledge categories and discuss the extent and forms of knowledge provided for each category. \nConclusion: While systematic reviews can provide knowledge that can inform teaching about practice, relatively few systematic reviews present the outcomes in a form suitable for this purpose. Using a suitable format for presenting a summary of outcomes could improve this. Additionally, the increasing number of published systematic reviews suggests that there is a need for greater coordination regarding the cataloguing of their findings and recommendations.","authors":["David Budgen","Pearl Brereton","Nikki Williams","Sarah Drummond"],"meta":["January 2020E-Informatica Software Engineering Journal 14(1)","DOI:10.37190/e-Inf200101"],"references":["316939663_Evidence_Briefings_Towards_a_Medium_to_Transfer_Knowledge_from_Systematic_Reviews_to_Practitioners","303988882_Policy-relevant_systematic_reviews_to_strengthen_health_systems_Models_and_mechanisms_to_support_their_production","327920974_Bridging_the_Gap_From_Research_to_Practical_Advice","320683324_Reporting_Systematic_Reviews_Some_Lessons_from_a_Tertiary_Study","320578843_The_contribution_that_empirical_studies_performed_in_industry_make_to_the_findings_of_systematic_reviews_A_tertiary_study","303098988_Belief_evidence_in_empirical_software_engineering","287760812_GRADE_An_emerging_consensus_on_rating_quality_of_evidence_and_strength_of_recommendations","283132580_Claims_About_the_Use_of_Software_Engineering_Practices_in_Science_A_Systematic_Literature_Review","279635295_A_Systematic_Literature_Review_of_Use_Case_Specifications_Research","273328689_The_kanban_approach_between_agility_and_leanness_a_systematic_review"]}