{"id":"339239840_Dual_Parameterization_of_Weighted_Coloring","abstract":"Given a graph G, a properk-coloring of G is a partition c=(Si)i∈[1,k] of V(G) into k stable sets S1,…,Sk. Given a weight function w:V(G)→R+, the weight of a colorSi is defined as w(i)=maxv∈Siw(v) and the weight of a coloringc as w(c)=∑i=1kw(i). Guan and Zhu (Inf Process Lett 61(2):77–81, 1997) defined the weighted chromatic number of a pair (G, w), denoted by σ(G,w), as the minimum weight of a proper coloring of G. The problem of determining σ(G,w) has received considerable attention during the last years, and has been proved to be notoriously hard: for instance, it is NP-hard on split graphs, unsolvable on n-vertex trees in time no(logn) unless the ETH fails, and W[1]-hard on forests parameterized by the size of a largest tree. We focus on the so-called dual parameterization of the problem: given a vertex-weighted graph (G, w) and an integer k, is σ(G,w)≤∑v∈V(G)w(v)-k? This parameterization has been recently considered by Escoffier (in: Proceedings of the 42nd international workshop on graph-theoretic concepts in computer science (WG). LNCS, vol 9941, pp 50–61, 2016), who provided an FPT algorithm running in time 2O(klogk)·nO(1), and asked which kernel size can be achieved for the problem. We provide an FPT algorithm in time 9k·nO(1), and prove that no algorithm in time 2o(k)·nO(1) exists under the ETH. On the other hand, we present a kernel with at most (2k-1+1)(k-1) vertices, and rule out the existence of polynomial kernels unless NP⊆coNP/poly, even on split graphs with only two different weights. Finally, we identify classes of graphs allowing for polynomial kernels, namely interval graphs, comparability graphs, and subclasses of circular-arc and split graphs, and in the latter case we present lower bounds on the degrees of the polynomials.","authors":["Julio Araujo","Victor Campos","Carlos Vinicius G. C. Lima","Vinicius Fernandes dos Santos"],"meta":["August 2020Algorithmica 82(4)","DOI:10.1007/s00453-020-00686-7"],"references":["323863803_Ruling_out_FPT_algorithms_for_Weighted_Coloring_on_forests","327131813_Saving_colors_and_Max_Coloring_Some_fixed-parameter_tractability_results","313903170_Parameterized_Algorithms","308713488_Saving_Colors_and_Max_Coloring_Some_Fixed-Parameter_Tractability_Results","305453426_Partially_Polynomial_Kernels_for_Set_Cover_and_Test_Cover","300154957_Lower_Bounds_Based_on_the_Exponential-Time_Hypothesis","295248405_Dual_parameterization_and_parameterized_approximability_of_subset_graph_problems","289202822_Partially_polynomial_kernels_for_Set_Cover_and_Test_Cover","286276456_Kernelization_Lower_Bounds_Through_Colors_and_IDs","284039089_Reducibility_among_combinatorial_problems","278769048_Weighted_Coloring_in_Trees","258726264_Kernelization_Lower_Bounds_By_Cross-Composition","268072213_Lower_bounds_based_on_the_exponential_time_hypothesis","267114728_Graph_theory_4th_ed","265502171_Fundamentals_of_Parameterized_Complexity"]}