{"id":"339219329_Beyond_Ternary_OPV_High-Throughput_Experimentation_and_Self-Driving_Laboratories_Optimize_Multicomponent_Systems","abstract":"Fundamental advances to increase the efficiency as well as stability of organic photovoltaics (OPVs) are achieved by designing ternary blends, which represents a clear trend toward multicomponent active layer blends. The development of high‐throughput and autonomous experimentation methods is reported for the effective optimization of multicomponent polymer blends for OPVs. A method for automated film formation enabling the fabrication of up to 6048 films per day is introduced. Equipping this automated experimentation platform with a Bayesian optimization, a self‐driving laboratory is constructed that autonomously evaluates measurements to design and execute the next experiments. To demonstrate the potential of these methods, a 4D parameter space of quaternary OPV blends is mapped and optimized for photostability. While with conventional approaches, roughly 100 mg of material would be necessary, the robot‐based platform can screen 2000 combinations with less than 10 mg, and machine‐learning‐enabled autonomous experimentation identifies stable compositions with less than 1 mg. While ternary blends for organic solar cells show significant performance improvements, quaternary mixtures typically cannot be fully optimized due to experimental constraints. A robot‐based high‐throughput technology is demonstrated that allows the stability of multicomponent blends to be investigated. Moreover, the use of machine learning algorithms enables an autonomous operation of the self‐driving laboratory with highly efficient optimization routines.","authors":["Stefan Langner","Florian Häse","Jose Dario Perea","Tobias Stubhan"],"meta":["April 2020Advanced Materials 32(14):1907801","DOI:10.1002/adma.201907801"],"references":["337282725_Locally_collective_hydrogen_bonding_isolates_lead_octahedra_for_white_emission_improvement","336712210_Interface-enhanced_organic_solar_cells_with_extrapolated_T80_lifetimes_of_over_20_years","335705269_Intrinsically_stable_organic_solar_cells_under_high-intensity_illumination","331205673_A_Top-down_Strategy_Identifying_Molecular_Phase_Stabilizers_to_Overcome_Microstructure_Instabilities_in_Organic_Solar_Cells","327265056_Chimera_Enabling_hierarchy_based_multi-objective_optimization_for_self-driving_laboratories","327218352_Phoenics_A_Bayesian_Optimizer_for_Chemistry","326608140_Machine_learning_for_molecular_and_materials_science","334610708_Ternary_Blended_Fullerene-Free_Polymer_Solar_Cells_with_165_Efficiency_Enabled_with_a_Higher-LUMO-Level_Acceptor_to_Improve_Film_Morphology","330464415_Single-Junction_Organic_Solar_Cell_with_over_15_Efficiency_Using_Fused-Ring_Acceptor_with_Electron-Deficient_Core","327802466_Efficient_Polymer_Solar_Cells_Based_on_Non-fullerene_Acceptors_with_Potential_Device_Lifetime_Approaching_10_Years"]}