{"id":"339238760_Competitive_Analysis_of_Single_and_Multi-Path_Routing_Protocols_in_Mobile_Ad-Hoc_Network","abstract":"p>A Mobile Ad-hoc Network (MANET) refers to a dynamic and wireless network, which can be designed without an existing infrastructure as every node serves as a router. A MANET is a self-configuring system of mobile nodes that are connected wirelessly. Every node serves as a sink, as well as a router to send packets. The movement of the nodes is not restricted as they can move in any direction, and they have the ability to get organized into a network. Due to their free and independent movement, they do not have a fixed position; they often change positions. In this study, the Dynamic Source Routing (DSR) and Ad-hoc On Multipath Demand Distance Vector (AOMDV) protocols are compared using Network Simulator NS2.35. DSR is a reactive gateway discovery algorithm whereby the connection of a MANET mobile device is established only on demand. Basically, AOMDV was specially tailored for ad-hoc networks that are highly dynamic to respond to link failures and breakages in the network. It ensures that the paths for destinations are sustained, and it defines the new routing information using destination serial numbers to ensure loop freedom always while avoiding problems. More so, it is a protocol that is based on a timer that can discover ways through which the mobile nodes respond to link breakages and change in topology. A comparison of protocols has been carried out individually and jointly with the aim of evaluating their performance. The performance is measured in terms of End-to-End Delay, Packet Delivery Ratio, Packet Loss Ratio, and Routing Overhead Ratio. The performance of the routing protocols was done using two scenarios; when there is a change in the simulation time and when there is a change in the number of nodes.</p","authors":["Mohammed Ahmed Jubair","Mustafa Hamid Hassan","Salama Mostafa","Hairulnizam Mahdin"],"meta":["May 2019Indonesian Journal of Electrical Engineering and Computer Science 19(1)","DOI:10.11591/ijeecs.v19.i1.pp293-300","Projects: Interference Mitigation Techniques for 5G HetNetMobile Ad-hoc Network"],"references":["337303091_Bat_Optimized_Link_State_Routing_Protocol_for_Energy-Aware_Mobile_Ad-Hoc_Networks","335681584_A_STATISTICAL_RISK_ASSESSMENT_METHOD_OF_DYNAMIC_ENVIRONMENTS_A_CASE_STUDY_OF_AIR_POLLUTION","334290561_Integrating_African_Buffalo_Optimization_Algorithm_in_AODV_Routing_Protocol_for_improving_the_QoS_of_MANET","334289733_An_Anti-Spam_Detection_Model_for_Emails_of_Multi-Natural_Language","332542900_An_Optimized_Method_for_Automated_Stadium_Attendance_Management_System","329149271_A_Survey_of_Multi-Agent_System_Approach_in_Risk_Assessment","329145438_A_Survey_of_Multi-agent_Systems_and_Case-Based_Reasoning_Integration","336273215_Improvement_in_Routing_in_MANET_using_Spider_Monkey_Optimization","335147826_Impact_of_Mobility_and_Density_on_Performance_of_MANET","332527555_An_Efficient_Load_Balance_Algorithm_for_Vehicular_Ad-Hoc_Network"]}