{"id":"339208451_A_Novel_Hybrid_Deep_Neural_Network_to_Predict_Pre-impact_Fall_for_Older_People_Based_on_Wearable_Inertial_Sensors","abstract":"Falls in the elderly is a major public health concern due to its high prevalence, serious consequences and heavy burden on the society. Many falls in older people happen within a very short time, which makes it difficult to predict a fall before it occurs and then to provide protection for the person who is falling. The primary objective of this study was to develop deep neural networks for predicting a fall during its initiation and descending but before the body impacts to the ground so that a safety mechanism can be enabled to prevent fall-related injuries. We divided the falling process into three stages (non-fall, pre-impact fall and fall) and developed deep neutral networks to perform three-class classification. Three deep learning models, convolutional neural network (CNN), long short term memory (LSTM), and a novel hybrid model integrating both convolution and long short term memory (ConvLSTM) were proposed and evaluated on a large public dataset of various falls and activities of daily living (ADL) acquired with wearable inertial sensors (accelerometer and gyroscope). Fivefold cross validation results showed that the hybrid ConvLSTM model had mean sensitivities of 93.15, 93.78, and 96.00% for non-fall, pre-impact fall and fall, respectively, which were higher than both LSTM (except the fall class) and CNN models. ConvLSTM model also showed higher specificities for all three classes (96.59, 94.49, and 98.69%) than LSTM and CNN models. In addition, latency test on a microcontroller unit showed that ConvLSTM model had a short latency of 1.06 ms, which was much lower than LSTM model (3.15 ms) and comparable with CNN model (0.77 ms). High prediction accuracy (especially for pre-impact fall) and low latency on the microboard indicated that the proposed hybrid ConvLSTM model outperformed both LSTM and CNN models. These findings suggest that our proposed novel hybrid ConvLSTM model has great potential to be embedded into wearable inertial sensor-based systems to predict pre-impact fall in real-time so that protective devices could be triggered in time to prevent fall-related injuries for older people.","authors":["Xiaoqun Yu","Hai Qiu","Shuping Xiong"],"meta":["February 2020Frontiers in Bioengineering and Biotechnology 8","DOI:10.3389/fbioe.2020.00063"],"references":["331091423_Evaluation_of_Inertial_Sensor-Based_Pre-Impact_Fall_Detection_Algorithms_Using_Public_Dataset","328745000_Application_of_Wearable_Inertial_Sensors_and_A_New_Test_Battery_for_Distinguishing_Retrospective_Fallers_from_Non-fallers_among_Community-dwelling_Older_People","328310209_Embedded_Real-Time_Fall_Detection_with_Deep_Learning_on_Wearable_Devices","328238936_Multiple-Wearable-Sensor-Based_Gait_Classification_and_Analysis_in_Patients_with_Neurological_Disorders","325002757_Pre-impact_fall_detection_based_on_a_modified_zero_moment_point_criterion_using_data_from_Kinect_sensors","334768467_Pre-Impact_Fall_Detection_Using_3D_Convolutional_Neural_Network","332284810_Wearable-Sensor-Based_Pre-Impact_Fall_Detection_System_with_a_Hierarchical_Classifier","328983150_Pre-impact_Alarm_System_for_Fall_Detection_Using_MEMS_Sensors_and_HMM-based_SVM_Classifier","327522629_A_Real-time_Pre-impact_Fall_Detection_and_Protection_System","326566753_Focal_Loss_for_Dense_Object_Detection"]}