{"id":"339240102_2019_4-22-Bilousova-Gryzun-Zhytienova_FMO","abstract":"Formulation of the problem. For the contemporary national economy, the urgent task is to ensure a sustainable process of forming a national human\nresource for highly qualified IT professionals. The essential role here belongs to the Informatics teacher, who must be able to introduce\ntheir students the dynamic world of computer science and digital technologies, to awaken their interest in advanced mastery of the\nsubject, and to form sustainable motivation to opt for a job in the IT area. At the same time, the system of professional training of a preservice Informatics teacher, while maintaining a certain inertia, does not provide the outlined qualities of their readiness and thus loses\nits adequacy to the requirements of society. Therefore, the modernization of the professional training of the said teacher becomes\nrelevant.\nMaterials and methods. The search for conceptual frameworks for the modernization implementation draws attention to a holistic approach, which\nis emphasized by a number of regulatory documents. The analysis of the principles of the holistic educational paradigm confirms the\npracticality of their introduction into professional education. However, nowadays the holistic approach in national education is perceived\nto be rather limited, focusing mainly on the problem of holistic development of the learner's personality. At the same time, the potential\nof this approach is much more powerful, and its complex realization in the process of professional training of the future teacher of\ninformatics becomes a promising direction of its modernization and improvement. A number of theoretical research methods have been\napplied to solve these problems.\nResults. The paper presents a developed by the authors innovative model of the said training where a holistic approach is used as a conceptual basis\nin determining the integrative educational content, the choice of ways and methods of its presentation and mastering, and the\norganization of educational practice of pre-service Informatics teachers.\nConclusions. The analysis of the covered ways of holistic approach implementation on the levels of the integrative educational content, the choice of\nways of its presentation and mastering, and the organization of educational practice allows to suppose that this would allow a fuller\nrealization of the benefits of holistic educational paradigm in the process of professional teachers’ training.\nKey words: professional training, Informatics teacher, modernization of Informatics teacher’s training, holistic approach, innovative model of the\nInformatics teacher’s training based on holistic approach.","authors":["L.I. Bilousova","Natalya Zhytienova","Liudmyla Gryzun"],"meta":["February 2020","DOI:10.31110/2413-1571-2019-022-4-002"],"references":["295574492_Holistic_learning_and_spirituality_in_education_Breaking_new_ground","267841989_Holistic_Education_An_Approach_for_21_Century"]}