{"id":"339282342_Named_Entity_Extraction_for_Knowledge_Graphs_A_Literature_Overview","abstract":"An enormous amount of digital information is expressed as natural-language (NL) text that is not easily processable by computers. Knowledge Graphs (KG) offer a widely used format for representing information in computer-processable form. Natural Language Processing (NLP) is therefore needed for mining (or lifting) knowledge graphs from NL texts. A central part of the problem is to extract the named entities in the text. The paper presents an overview of recent advances in this area, covering: Named Entity Recognition (NER), Named Entity Disambiguation (NED), and Named Entity Linking (NEL).We comment that many approaches to NED and NEL are based on older approaches to NER and need to leverage the outputs of state-of-the-art NER systems. There is also a need for standard methods to evaluate and compare named-entity extraction approaches. We observe that NEL has recently moved from being stepwise and isolated into an integrated process along two dimensions: the first is that previously sequential steps are now being integrated into end-to-end processes, and the second is that entities that were previously analysed in isolation are now being lifted in each other’s context. The current culmination of these trends are the deep-learning approaches that have recently reported promising results.","authors":["Tareq Al-Moslmi","Marc Gallofré Ocaña","Andreas Lothe Opdahl","Csaba Veres"],"meta":["February 2020IEEE Access 8(1):32862 - 32881","DOI:10.1109/ACCESS.2020.2973928","Project: News Angler"],"references":["335943529_Using_Knowledge_Base_Semantics_in_Context-Aware_Entity_Linking","335601651_Improving_Neural_Entity_Disambiguation_with_Graph_Embeddings","335038136_Entity_Disambiguation_Leveraging_Multi-Perspective_Attention","336997604_Cloze-driven_Pretraining_of_Self-attention_Networks","335784138_Cross-Domain_NER_using_Cross-Domain_Language_Modeling","335779608_Joint_Learning_of_Named_Entity_Recognition_and_Entity_Linking","335778805_Dual_Adversarial_Neural_Transfer_for_Low-Resource_Named_Entity_Recognition","335390963_Zero-Shot_Neural_Transfer_for_Cross-Lingual_Entity_Linking","334117887_Improving_Entity_Linking_by_Modeling_Latent_Relations_between_Mentions","334116992_Neural_Adaptation_Layers_for_Cross-domain_Named_Entity_Recognition"]}