{"id":"339255158_Imaging_of_macrophage_mitochondria_dynamics_in_vivo_reveals_cellular_activation_phenotype_for_diagnosis","abstract":"Highly plastic macrophages are pivotal players in the body's homeostasis and pathogenesis. Grasping the molecular or cellular factors that drive and support the macrophage activation will help to develop diagnostics and manipulate their functions in these contexts. However, the lack of in vivo characterization methods to reveal the dynamic activation of macrophages impedes these studies in various disease contexts. Methods: Here, in vitro bone marrow-derived macrophages (BMDMs) and in vivo Matrigel plug were used to evaluate how mitochondria dynamics supports cellular activation and functions. We conducted macrophage repolarization in vitro to track mitochondria dynamics during the shift of activation status. For in vivo diagnosis, a novel MitoTracker-loaded liposome was first developed to label macrophage mitochondria in mice before/after inflammatory stimulation. Results: Based on the typical activation of in vitro BMDMs, we found glycolysis based macrophages have punctate and discrete mitochondria, while OXPHOS active macrophages have elongated and interconnected mitochondria. M1, M2a, M2b, and M2c activated BMDMs showed clustered and differentiable features in mitochondrial morphology. These features also hold for Matrigel plug-recruited macrophages in mice. Furthermore, with the interventions on M2a macrophages in vitro, we demonstrated that mitochondria morphology could be a metabolic index to evaluate macrophage activation status under drug manipulation. Using the MitoTracker-loaded liposomes, we further achieved subcellular imaging of macrophage mitochondria in vivo. Their organization dynamics revealed the dynamic change from anti-inflammatory macrophages to inflammatory ones in vivo under the lipopolysaccharide (LPS) challenge. Conclusion: These results reveal that subcellular imaging of mitochondria organization can characterize the activation status of macrophage in vitro and in vivo at a single-cell level, which is critical for the studies of noninvasive diagnosis and therapeutic drug monitoring.","authors":["Yue Li","Yuan He","Kai Miao","Ying Zheng"],"meta":["February 2020Theranostics 10(7):2897-2917","DOI:10.7150/thno.40495"],"references":["336769225_Metabolic_regulation_of_gene_expression_by_histone_lactylation","336246167_Lipopolysaccharide-anchored_macrophages_hijack_tumor_microtube_networks_for_selective_drug_transport_and_augmentation_of_antitumor_effects_in_orthotopic_lung_cancer","330882956_Mitochondrial_fusion_supports_increased_oxidative_phosphorylation_during_cell_proliferation","330810138_Deficiency_in_IL-33ST2_Axis_Reshapes_Mitochondrial_Metabolism_in_Lipopolysaccharide-Stimulated_Macrophages","329933913_Targeting_lipid_metabolism_to_overcome_EMT-associated_drug_resistance_via_integrin_b3FAK_pathway_and_tumor-associated_macrophage_repolarization_using_legumain-activatable_delivery","329847252_M2b_macrophage_polarization_and_its_roles_in_diseases","329241918_Mitochondrial_Fission_Is_Required_for_Blue_Light-Induced_Apoptosis_and_Mitophagy_in_Retinal_Neuronal_R28_Cells","328415230_Prostaglandin_E_2_hydrogel_improves_cutaneous_wound_healing_via_M2_macrophages_polarization","325520888_Molecular_detection_of_inflammation_in_cell_models_using_hyperpolarized_13_C-pyruvate","329369569_Anti-tumor_macrophages_activated_by_ferumoxytol_combined_or_surface-functionalized_with_the_TLR3_agonist_poly_I_C_promote_melanoma_regression"]}