{"id":"339277275_Maximum_independent_and_disjoint_coverage","abstract":"Set cover is one of the most studied optimization problems in Computer Science. In this paper, we target two interesting variations of this problem in a geometric setting: (i) maximum disjoint coverage (MDC), and (ii) maximum independent coverage (MIC) problems. In both problems, the input consists of a set P of points and a set O of geometric objects in the plane. The objective is to maximize the number of points covered by a set \\(O'\\) of selected objects from O. In the MDC problem we restrict the objects in \\(O'\\) are pairwise disjoint (non-intersecting). Whereas, in the MIC problem any pair of objects in \\(O'\\) should not share a point from P (however, they may intersect each other). We consider various geometric objects as covering objects such as axis-parallel infinite lines, axis-parallel line segments, unit disks, axis-parallel unit squares, and intervals on a real line. For the covering objects axis-parallel infinite lines, we show that both MDC and MIC problems admit polynomial time algorithms. In addition to that, we give polynomial time algorithms for both MDC and MIC problems with intervals on the real line. On the other hand, we prove that the MIC problem is \\({\\mathsf {NP}}\\)-complete when the objects are horizontal infinite lines and vertical segments. We also prove that both MDC and MIC problems are \\({\\mathsf {NP}}\\)-complete for axis-parallel unit segments in the plane. For unit disks and axis-parallel unit squares, we prove that both these problems are \\({\\mathsf {NP}}\\)-complete. Further, we present \\({\\mathsf {PTAS}}\\) es for the MDC problem for unit disks as well as unit squares using Hochbaum and Maass’s “shifting strategy”. For unit squares, we design a \\({\\mathsf {PTAS}}\\) for the MIC problem using Chan and Hu’s “mod-one transformation” technique.","authors":["Amit Kumar Dhar","Raghunath reddy Madireddy","Supantha Pandit","Jagpreet Singh"],"meta":["May 2020Journal of Combinatorial Optimization 39(2)","DOI:10.1007/s10878-020-00536-w"],"references":["332312827_Maximum_Independent_and_Disjoint_Coverage","327829522_Hardness_Results_and_Approximation_Schemes_for_Discrete_Packing_and_Domination_Problems","305638716_Unique_Set_Cover_on_Unit_Disks_and_Unit_Squares","278393843_A_431-Approximation_for_the_Geometric_Unique_Coverage_Problem_on_Unit_Disks","269724665_Geometric_red-blue_set_cover_for_unit_squares_and_related_problems","259135781_Exact_algorithms_and_APX-hardness_results_for_geometric_packing_and_covering_problems","247153040_Approximation_Schemes_for_Maximum_Weight_Independent_Set_of_Rectangles","222469840_Unit_Disk_Graphs","221590732_The_Complexity_of_Satisfiability_Problems","220779848_Approximating_geometric_coverage_problems"]}