{"id":"339209093_Advanced_tsunami_detection_and_forecasting_by_radar_on_unconventional_airborne_observing_platforms","abstract":"Sustaining an accurate, timely, and global tsunami forecast system remains a challenge for scientific communities. To this end, various viable geophysical monitoring devices have been deployed. However, it is difficult to implement new observation networks in other regions and maintaining the existing systems is costly. This study proposes a new and complementary approach to monitoring the tsunami using existing moving platforms. The proposed system consists of a radar altimeter, Global Navigation Satellite Systems receiver, and an adequate communication link on airborne platforms such as commercial airplanes, drones, or dedicated high-speed aircraft, and a data assimilation module with a deterministic model. We demonstrated, through twin-data experiment, the feasibility of the proposed system in forecasting tsunami at the Nankai Trough of Japan. Our results demonstrated the potential of an airborne tsunami observation as a viable future technology through proxy observations and rigorous numerical experiments. The wide coverage of the tsunamigenic regions without a new observation network is an advantage while various regulatory constraints need to be overcome. This study offered a novel perspective on the developments in tsunami detection and forecasting technology. Such multi-purpose observation using existing platforms provides a promising and practical solution in establishing sustainable observational networks.","authors":["Iyan E. Mulia","Tomoyuki Hirobe","Daisuke Inazu","Takahiro Endoh"],"meta":["February 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-59239-1"],"references":["336198812_Tsunami_Data_Assimilation_of_Cabled_Ocean_Bottom_Pressure_Records_for_the_2015_Torishima_Volcanic_Tsunami_Earthquake","334882522_SMART_Cables_for_Observing_the_Global_Ocean_Science_and_Implementation","331080488_Tsunami_Data_Assimilation_Without_a_Dense_Observation_Network","329815405_Improving_Forecast_Accuracy_With_Tsunami_Data_Assimilation_The_2009_Dusky_Sound_New_Zealand_Tsunami","325859721_Alternative_to_nonlinear_model_for_simulating_tsunami_inundation_in_real-time","321568952_Optimal_Design_for_Placements_of_Tsunami_Observing_Systems_to_Accurately_Characterize_the_Inducing_Earthquake","306270922_Assessment_of_GNSS-based_height_data_of_multiple_ships_for_measuring_and_forecasting_great_tsunamis","335213030_Observation_of_sea_surface_height_using_airborne_radar_altimetry_a_new_approach_for_large_offshore_tsunami_detection","319866220_Preparing_for_the_Future_Nankai_Trough_Tsunami_A_Data_Assimilation_and_Inversion_Analysis_From_Various_Observational_Systems","312396318_Temporal_and_spatial_variations_of_upper_tropospheric_and_lower_stratospheric_carbon_dioxide"]}