{"id":"339248122_Preparing_for_Life_in_a_Digital_World_IEA_International_Computer_and_Information_Literacy_Study_2018_International_Report","abstract":"This Open Access book summarizes the key findings from the second cycle of IEA’s International Computer and Information Literacy Study (ICILS), conducted in 2018. ICILS seeks to establish how well schools around the globe are responding to the need to provide young people with the necessary digital participatory competencies. Effective use of information and communication technologies (ICT) is an imperative for successful participation in an increasingly digital world. \n\nICILS 2018 explores international differences in students’ computer and information literacy (CIL), namely their ability to use computers to investigate, create, and communicate at home, at school, in the workplace, and in the community. Participating countries also had an option to administer an assessment of students’ computational thinking (CT), focused on their ability to recognize aspects of real-world problems appropriate for computational formulation, and to evaluate and develop algorithmic solutions to those problems, so that the solutions could be operationalized with a computer.\n\nThe data collected by ICILS 2018 show how digital competencies can be assessed using instruments representing authentic contexts for ICT use, and how students’ CIL and CT skills relate to school learning experiences, out-of-school contexts, and student characteristics. Those data also show how learning technologies are used in classrooms around the world. Background questionnaires asked students about their use of ICT, and collected information from teachers, schools, and national education systems about the resourcing and teaching of CIL (and CT) within their countries. The results of ICILS 2018 will enable policymakers and education systems to develop a better understanding of the contexts and outcomes of CIL (and CT) education programs.","authors":["Julian Fraillon","John Ainley","Wolfram Schulz","Tim Friedman"],"meta":["January 2020","DOI:10.1007/978-3-030-38781-5","ISBN: 978-3-030-38780-8"],"references":[]}