{"id":"339248029_Scattering_Compensation_for_Deep_Brain_Microscopy_The_Long_Road_to_Get_Proper_Images","abstract":"Multiphoton microscopy is the most widespread method for preclinical brain imaging when sub-micrometer resolution is required. Nonetheless, even in the case of optimal experimental conditions, only a few hundred micrometers under the brain surface can be imaged by multiphoton microscopy. The main limitation preventing the acquisition of images from deep brain structures is the random light scattering which, until recently, was considered an unsurmountable obstacle. When in 2007 a breakthrough work by Vellekoop and Mosk [1] proved it is indeed possible to compensate for random scattering by using high resolution phase modulators, the neuro-photonics community started chasing the dream of a multiphoton microscopy capable of reaching arbitrary depths within the brain. Unfortunately, more than 10 years later, despite a massive improvement of technologies for scattering compensation in terms of speed, performances and reliability, clear images from deep layers of biological tissues are still lacking. In this work, we review recent technological and methodological advances in the field of multiphoton microscopy analyzing the big issue of scattering compensation. We will highlight the limits hampering image acquisition, and we will try to analyze the road scientists must tackle to target one of the most challenging issue in the field of biomedical imaging.","authors":["Paolo Pozzi","Daniela Gandolfi","Carlo Adolfo Porro","Albertino Bigiani"],"meta":["February 2020Frontiers in Physics 8","DOI:10.3389/fphy.2020.00026"],"references":["340288459_Readout_of_fluorescence_functional_signals_through_highly_scattering_tissue","333830006_Direct_wavefront_sensing_enables_functional_imaging_of_infragranular_axons_and_spines","331506135_In_Vivo_Submillisecond_Two-Photon_Optogenetics_with_Temporally_Focused_Patterned_Light","325214762_Dual-color_deep-tissue_three-photon_microscopy_with_a_multiband_infrared_laser_source","323896623_Optimal_model-based_sensorless_adaptive_optics_for_epifluorescence_microscopy","319977279_Focusing_light_through_dynamical_samples_using_fast_closed-loop_wavefront_optimization","325277741_Wavefront_correction_in_two-photon_microscopy_with_a_multi-actuator_adaptive_lens","321785687_High-resolution_imaging_in_two-photon_excitation_microscopy_using_in_situ_estimations_of_the_point_spread_function","303285999_In_vivo_three-photon_microscopy_of_subcortical_structures_within_an_intact_mouse_brain","281666966_Guidestar-assisted_wavefront-shaping_methods_for_focusing_light_into_biological_tissue"]}