{"id":"339379629_The_process_of_Lewy_body_formation_rather_than_simply_a-synuclein_fibrillization_is_one_of_the_major_drivers_of_neurodegeneration","abstract":"Parkinson’s disease (PD) is characterized by the accumulation of misfolded and aggregated α-synuclein (α-syn) into intraneuronal inclusions named Lewy bodies (LBs). Although it is widely believed that α-syn plays a central role in the pathogenesis of PD, the processes that govern α-syn fibrillization and LB formation remain poorly understood. In this work, we sought to dissect the spatiotemporal events involved in the biogenesis of the LBs at the genetic, molecular, biochemical, structural, and cellular levels. Toward this goal, we further developed a seeding-based model of α-syn fibrillization to generate a neuronal model that reproduces the key events leading to LB formation, including seeding, fibrillization, and the formation of inclusions that recapitulate many of the biochemical, structural, and organizational features of bona fide LBs. Using an integrative omics, biochemical and imaging approach, we dissected the molecular events associated with the different stages of LB formation and their contribution to neuronal dysfunction and degeneration. In addition, we demonstrate that LB formation involves a complex interplay between α-syn fibrillization, posttranslational modifications, and interactions between α-syn aggregates and membranous organelles, including mitochondria, the autophagosome, and endolysosome. Finally, we show that the process of LB formation, rather than simply fibril formation, is one of the major drivers of neurodegeneration through disruption of cellular functions and inducing mitochondria damage and deficits, and synaptic dysfunctions. We believe that this model represents a powerful platform to further investigate the mechanisms of LB formation and clearance and to screen and evaluate therapeutics targeting α-syn aggregation and LB formation.","authors":["Anne-Laure Mahul-Mellier","Johannes Burtscher","Niran Maharjan","Laura Weerens"],"meta":["February 2020Proceedings of the National Academy of Sciences 117(9):201913904","DOI:10.1073/pnas.1913904117"],"references":["333982915_Lewy_pathology_in_Parkinson's_disease_consists_of_crowded_organelles_and_lipid_membranes","332741066_Alpha-synuclein_aSyn_preformed_fibrils_induce_endogenous_aSyn_aggregation_compromise_synaptic_activity_and_enhance_synapse_loss_in_cultured_excitatory_hippocampal_neurons","331752623_Pathogenic_alpha-synuclein_aggregates_preferentially_bind_to_mitochondria_and_affect_cellular_respiration","328961349_Detailed_structural_orchestration_of_Lewy_pathology_in_Parkinson's_disease_as_revealed_by_3D_multicolor_STED_microscopy","328921601_Heterogeneity_in_a-synuclein_sub-types_and_their_expression_in_cortical_brain_tissue_lysates_from_Lewy_body_diseases_and_Alzheimer's_disease","328032937_Role_of_Mitogen_Activated_Protein_Kinase_Signaling_in_Parkinson's_Disease","327423834_Quality_Over_Quantity_Advantages_of_Using_Alpha-Synuclein_Preformed_Fibril_Triggered_Synucleinopathy_to_Model_Idiopathic_Parkinson's_Disease","333076249_a-Synuclein_aggregation_at_low_concentrations","331081581_Transmission_of_a-synuclein_seeds_in_neurodegenerative_disease_recent_developments","329806719_The_making_of_a_Lewy_body_the_role_of_alpha-synuclein_post-fibrillization_modifications_in_regulating_the_formation_and_the_maturation_of_pathological_inclusions"]}