{"id":"339372078_One-Pass_Multi-Task_Networks_With_Cross-Task_Guided_Attention_for_Brain_Tumor_Segmentation","abstract":"Class imbalance has emerged as one of the major challenges for medical image segmentation. The model cascade (MC) strategy, a popular scheme, significantly alleviates the class imbalance issue via running a set of individual deep models for coarse-to-fine segmentation. Despite its outstanding performance, however, this method leads to undesired system complexity and also ignores the correlation among the models. To handle these flaws in the MC approach, we propose in this paper a light-weight deep model, i.e., the One-pass Multi-task Network (OM-Net) to solve class imbalance better than MC does, while requiring only one-pass computation for brain tumor segmentation. First, OM-Net integrates the separate segmentation tasks into one deep model, which consists of shared parameters to learn joint features, as well as task-specific parameters to learn discriminative features. Second, to more effectively optimize OM-Net, we take advantage of the correlation among tasks to design both an online training data transfer strategy and a curriculum learning-based training strategy. Third, we further propose sharing prediction results between tasks, which enables us to design a cross-task guided attention (CGA) module. By following the guidance of the prediction results provided by the previous task, CGA can adaptively recalibrate channel-wise feature responses based on the category-specific statistics. Finally, a simple yet effective post-processing method is introduced to refine the segmentation results of the proposed attention network. Extensive experiments are conducted to demonstrate the effectiveness of the proposed techniques. Most impressively, we achieve state-of-the-art performance on the BraTS 2015 testing set and BraTS 2017 online validation set. Using these proposed approaches, we also won joint third place in the BraTS 2018 challenge among 64 participating teams. The code is publicly available at \nhttps://github.com/chenhong-zhou/OM-Net \n.","authors":["Chenhong Zhou","Changxing Ding","Xinchao Wang","Zhentai Lu"],"meta":["February 2020IEEE Transactions on Image Processing PP(99):1-1","DOI:10.1109/TIP.2020.2973510"],"references":["331576745_Identifying_the_Best_Machine_Learning_Algorithms_for_Brain_Tumor_Segmentation_Progression_Assessment_and_Overall_Survival_Prediction_in_the_BRATS_Challenge","328308268_A_3D_Coarse-to-Fine_Framework_for_Volumetric_Medical_Image_Segmentation","330644032_Bayesian_Polytrees_With_Learned_Deep_Features_for_Multi-Class_Cell_Segmentation","329748631_Harmonious_Attention_Network_for_Person_Re-identification","329740202_Squeeze-and-Excitation_Networks","328926979_Automatic_Brain_Tumor_Segmentation_using_Cascaded_Anisotropic_Convolutional_Neural_Networks","327629923_Adaptive_Feature_Recombination_and_Recalibration_for_Semantic_Segmentation_Application_to_Brain_Tumor_Segmentation_in_MRI_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_P","327629914_CompNet_Complementary_Segmentation_Network_for_Brain_MRI_Extraction_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_Part_III","327629769_One-Pass_Multi-task_Convolutional_Neural_Networks_for_Efficient_Brain_Tumor_Segmentation_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_Part_III","327627275_Concurrent_Spatial_and_Channel_'Squeeze_Excitation'_in_Fully_Convolutional_Networks"]}