{"id":"339376463_Multi-objective_Evolutionary_Algorithms_for_Influence_Maximization_in_Social_Networks","abstract":"As the pervasiveness of social networks increases, new NP-hard related problems become interesting for the optimization community. The objective of influence maximization is to contact the largest possible number of nodes in a network, starting from a small set of seed nodes, and assuming a model for information propagation. This problem is of utmost practical importance for applications ranging from social studies to marketing. The influence maximization problem is typically formulated assuming that the number of the seed nodes is a parameter. Differently, in this paper, we choose to formulate it in a multi-objective fashion, considering the minimization of the number of seed nodes among the goals, and we tackle it with an evolutionary approach. As a result, we are able to identify sets of seed nodes of different size that spread influence the best, providing factual data to trade-off costs with quality of the result. The methodology is tested on two real-world case studies, using two different influence propagation models, and compared against state-of-the-art heuristic algorithms. The results show that the proposed approach is almost always able to outperform the heuristics.","authors":["Doina Bucur","Giovanni Iacca","Andrea Marcelli","Giovanni Squillero"],"meta":["March 2017","DOI:10.1007/978-3-319-55849-3_15","Conference: European Conference on the Applications of Evolutionary Computation","Project: Evolutionary Algorithms for Influence Maximization in Social Networks"],"references":["314944120_Influence_Maximization_in_Social_Networks_with_Genetic_Algorithms","280151654_Operator_Selection_using_Improved_Dynamic_Multi-Armed_Bandit","269191017_The_Tradeoffs_Between_Data_Delivery_Ratio_and_Energy_Costs_in_Wireless_Sensor_Networks_A_Multi-Objective_Evolutionary_Framework_for_Protocol_Analysis","262221285_Bayesian_Network_Structure_Learning_from_Limited_Datasets_through_Graph_Evolution","321613865_Handbook_of_Memetic_Algorithms","290478671_Community_Detection_from_Signed_Social_Networks_Using_a_Multi-objective_Evolutionary_Algorithm","266681255_A_Multiobjective_Evolutionary_Algorithm_Based_on_Similarity_for_Community_Detection_From_Signed_Social_Networks","266476598_Multi-Objective_Optimization_Using_Evolutionary_Algorithms","260622133_A_Multiobjective_Genetic_Algorithm_to_Find_Communities_in_Complex_Networks","259688349_The_impact_of_topology_on_energy_consumption_for_collection_tree_protocols_An_experimental_assessment_through_evolutionary_computation"]}