{"id":"339341513_Random_walks_on_hypergraphs","abstract":"In the past 20 years network science has proven its strength in modeling many real-world interacting systems as generic agents, the nodes, connected by pairwise edges. Nevertheless, in many relevant cases, interactions are not pairwise but involve larger sets of nodes at a time. These systems are thus better described in the framework of hypergraphs, whose hyperedges effectively account for multibody interactions. Here we propose and study a class of random walks defined on such higher-order structures and grounded on a microscopic physical model where multibody proximity is associated with highly probable exchanges among agents belonging to the same hyperedge. We provide an analytical characterization of the process, deriving a general solution for the stationary distribution of the walkers. The dynamics is ultimately driven by a generalized random-walk Laplace operator that reduces to the standard random-walk Laplacian when all the hyperedges have size 2 and are thus meant to describe pairwise couplings. We illustrate our results on synthetic models for which we have full control of the high-order structures and on real-world networks where higher-order interactions are at play. As the first application of the method, we compare the behavior of random walkers on hypergraphs to that of traditional random walkers on the corresponding projected networks, drawing interesting conclusions on node rankings in collaboration networks. As the second application, we show how information derived from the random walk on hypergraphs can be successfully used for classification tasks involving objects with several features, each one represented by a hyperedge. Taken together, our work contributes to unraveling the effect of higher-order interactions on diffusive processes in higher-order networks, shedding light on mechanisms at the heart of biased information spreading in complex networked systems.","authors":["Timoteo Carletti","Federico Battiston","Giulia Cencetti","Duccio Fanelli"],"meta":["February 2020PHYSICAL REVIEW E 101(2)","DOI:10.1103/PhysRevE.101.022308"],"references":["340564641_Social_contagion_models_on_hypergraphs","339634639_Abrupt_phase_transition_of_epidemic_spreading_in_simplicial_complexes","335997511_Classes_of_random_walks_on_temporal_networks_with_competing_timescales","333642405_Simplicial_models_of_social_contagion","345504643_The_simplex_geometry_of_graphs","341200466_Random_Walks_on_Simplicial_Complexes_and_the_Normalized_Hodge_1-Laplacian","340290406_Multibody_interactions_and_nonlinear_consensus_dynamics_on_networked_systems","338201004_Simplicial_SIS_model_in_scale-free_uniform_hypergraph","334008721_Hitting_times_commute_times_and_cover_times_for_random_walks_on_random_hypergraphs","331992669_From_networks_to_optimal_higher-order_models_of_complex_systems"]}