{"id":"339384255_Complex_Problem_Solving_using_Self-organization_Mechanisms_Badr-eddine_MILES","abstract":"A self-organizing system functions without central control, and through contextual local interactions. Components achieve a simple task individually, but a complex collective behavior emerges from their mutual interactions. Nature provides examples of self-organization, such as ant's food foraging, molecules formation, or antibodies detection. Similarly, current software applications are driven by social interactions (negotiations, transactions), based on the principles of self-organization to achieve robustness and adaptability, and run in highly dynamic environments. In these applications, there are two very important concepts to consider: emergence and self-organization. A lot of confusion exists about the meaning of the terms emergence and self-organization. One of the sources of the confusion comes from the fact that a combination of both phenomena often occurs in dynamical systems. The aim of this paper is to give a definition and to explain a comparison between emergence and self-organization by supporting it with some examples and to outline the mechanisms enabling such behaviors and finally to survey software applications exhibiting emergent behavior.","authors":["Soumia Zertal","M. Batouche","Miles Badreddine"],"meta":["February 2014","Conference: The First International Symposium on Informatics and its ApplicationsAt: University of M'sila (Algeria)"],"references":["221456302_ETTO_Emergent_Timetabling_by_Cooperative_Self-organization","220254381_Self-Organization_in_Multi-Agent_Systems","4034554_The_AMAS_theory_for_complex_problem_solving_based_on_self-organizing_cooperative_agents","318088372_Self-Organisation_Paradigms_and_Applications","234791058_Collective_intelligence_for_demand-responsive_transportation_systems_A_self_organization_model","200047806_Swarm_Intelligence_-_From_Natural_to_Artificial_Systems","200026470_La_reconstruction_du_nid_et_les_coordinations_interindividuelles_chez_Bellicositermes_natalensis_et_Cubitermes_sp_la_theorie_de_la_stigmergie_Essai_d'interpretation_du_comportement_des_termites_constr"]}