{"id":"339394557_Context-Specific_Heterogeneous_Graph_Convolutional_Network_for_Implicit_Sentiment_Analysis","abstract":"Sentiment analysis has attracted considerable attention in recent years. In particular, implicit sentiment analysis is a more challenging problem due to the lack of sentiment words. It requires us to combine contextual information and precisely understand the emotion changing process. Graph convolutional network (GCN) techniques have been widely applied for sentiment analysis since they are capable of learning from complex structures and preserving global information. However, these models either only focus on extracting features from a single sentence and ignore the context semantic background or only consider the textual information and overlook the phrase dependency when constructing the graph. To address these problems, we propose a new context-specific heterogeneous graph convolutional network (CsHGCN) framework that can combine all context representations. It has a complete context that reflects the information on documents more comprehensively. It has a dependency structure that obtains token-token semantic acquisition more accurately. The experimental results on a Chinese implicit sentiment dataset show that our proposed model can effectively identify the target sentiment of sentences, and visualization of the attention layers further demonstrates that the model selects qualitatively informative tokens and sentences.","authors":["Enguang Zuo","Hui Zhao","Bo Chen","Qiuchang Chen"],"meta":["February 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2975244"],"references":["326496839_Deep_Interest_Network_for_Click-Through_Rate_Prediction","323750220_Sentic_LSTM_a_Hybrid_Network_for_Targeted_Aspect-Based_Sentiment_Analysis","336997597_Text_Level_Graph_Neural_Network_for_Text_Classification","336996398_Aspect-based_Sentiment_Classification_with_Aspect-specific_Graph_Convolutional_Networks","334115600_Graph_Convolution_over_Pruned_Dependency_Trees_Improves_Relation_Extraction","334115080_Graph-to-Sequence_Learning_using_Gated_Graph_Neural_Networks","329122415_Identification_of_fact-implied_implicit_sentiment_based_on_multi-level_semantic_fused_representation","328821288_Exploiting_social_and_local_contexts_propagation_for_inducing_Chinese_microblog-specific_sentiment_lexicons","326507162_Head-Lexicalized_Bidirectional_Tree_LSTMs","322582375_Encoding_Sentences_with_Graph_Convolutional_Networks_for_Semantic_Role_Labeling"]}