{"id":"339310449_Analysis_of_Percentiles_of_Computer_Science_Theory_and_Methods_Journals_CiteScore_Versus_Impact_Factor","abstract":"Impact factor (Web of Science, Clarivate Analytics) and CiteScore (Scopus, Elsevier) are the two leading metrics for journal evaluation, assessment and ranking. The relationship between the two is now established, using their respective percentile in this paper for 105 journal in the Computer science, theory and methods (CSTM) subject category. The available studies did not consider the quartile comparison of the journal percentiles of the two database (Scopus and Science Citation Index expanded). The mean impact factor and CiteScore are 2.08 and 2.67 respectively. Pearson correlation coefficient between the impact factor and CiteScore is (0.919, p = 0.000) and between their respective journal percentiles is (r = 0.804, p = 0.000). Analysis of variance revealed that the means of the impact factor and CiteScore of the 105 CSTM journals are the same (F = 3.64, P = 0.058) but different (F = 38.94, P = 0.00) for their respective percentiles. The median test contradicts the ANOVA as the medians of impact factor and CiteScore are different at 0.05 level of significance. The median journal percentiles are the same for only 2 journal titles. The median journal percentile (SCIE) is greater than the median journal percentile (Scopus) for 5 journal titles and less than the median journal percentile (Scopus) for 98 journal titles. The same result was obtained when the percentiles were converted to quartiles, but in this case, the median journal quartiles are the same for 37 journal titles. The median journal quartile (SCIE) is greater than the median journal quartile (Scopus) for 67 journal titles and less than the median journal quartile (Scopus) in only one journal title. Only 37 (35 %) journals are in the same quartile of the two metrics. Caution is recommended in journal evaluation as conflicting different results can be obtained using the same metric.","authors":["Hilary Okagbue","Bishop Sheila Amina","Patience Adamu","Abiodun Opanuga"],"meta":["February 2020DESIDOC Journal of Library & Information Technology 40(1):359-365","DOI:10.14429/djlit.40.1.14866"],"references":["336823857_Modified_CiteScore_metric_for_reducing_the_effect_of_self-citations","334973735_Corrective_factors_for_author-_and_journal-based_metrics_impacted_by_citations_to_accommodate_for_retractions","333950426_Publication_modalities_'article_in_press'_and_'open_access'_in_relation_to_journal_average_citation","332594195_A_bibliometric_analysis_for_Ciencias_Marinas_45_years_after_its_inception_Analisis_bibliometrico_de_la_revista_Ciencias_Marinas_a_45_anos_de_su_fundacion","332338713_Towards_Designing_Tools_for_Universities'_RD_Performance_Measurement_on_Mobile_Platform","331641090_UN_NUEVO_INDICE_BIBLIOMETRICO_PARA_MEDIR_EL_IMPACTO_DE_LA_PRODUCCION_CIENTIFICA_A_New_Bibliometric_Index_to_Measure_the_Impact_of_Scientific_Production","331548512_A_cross-sectional_description_of_open_access_publication_costs_policies_and_impact_in_emergency_medicine_and_critical_care_journals","357093831_Making_of_the_Ukrainian_scientometrics_History_journal_ranking","337529390_Bibliographic_measures_of_top-tier_finance_and_information_systems_journals","331331787_Beyond_the_Impact_Factor"]}