{"id":"339302251_ALGORITHM_AS_A_PROBLEM_SOLVING_TECHNIQUE_FOR_TEACHING_AND_LEARNING_OF_THE_MALAY_LANGUAGE","abstract":"Computational thinking or CT refers to the thought processes involved in expressing solutions as computational steps or algorithms that can be carried out by a computer. CT is not merely using software or computer programs alone but is also interlinked with information and communication technology (ICT) and computer science based on problems; tools; action (praxis); solutions; concepts; and social needs. Hence, the aim of the study was to determine the effectiveness of using scratch program to teach Malay language subject. As part of the methodology, 32, 4th year students in a primary school of Seremban district participated in the study. A case study was used. The teachers teach Malay language subject using scratch programs with the theme of agriculture and title of food product from agriculture. The students were to arrange the basic words into grammatical sentences based on the scratch program and write a cake recipe using an algorithmic technique, a series of instructions contained in the scratch program. This conceptual teaching and learning algorithm was conducted in five steps namely the induction set; step 1; step 2; step 3; and enrichment and recovery. The result of this study shows that students could understand the concepts of algorithms taught and did not require recovery activities. This implies that the algorithm concept of how to prepare a cake through a scratch program has been fully understood by the students. Students are also excited about the algorithmic techniques and the scratch program generated. As a conclusion, the student's reaction as they remain focused throughout the session shows that the use of algorithms and scratch programs is better than conventional methods in teaching the Malay Language.","authors":["Faridah Binti Nazir","Zanariah Jano","Norliza Omar"],"meta":["February 2020Pertanika Journal of Social Science and Humanities"],"references":["327302966_Computational_thinking_-_a_guide_for_teachers","308812666_DISSECT_Exploring_the_relationship_between_computational_thinking_and_English_literature_in_K-12_curricula","260290708_Computer_Science_at_School_CS_Teacher_Education_-_Koli_Working-group_report_on_CS_at_School","226315863_An_axiomatic_definition_of_the_programming_language_PASCAL"]}