{"id":"339393856_Accountability_by_design_in_technology_research","abstract":"What does research look like in practice? Aside from popular assumptions of how researchers are lonely isolated individuals sitting disconnected from the rest of the world enmeshed in thought, a considerable part of research involves working with data. Whether this data is quantitative, qualitative, gathered through experiments or involves writing code, all of this data is not just magically ‘invented’ out of thin air, but instead develops in a process of interaction with both human beings and technical systems. However only a small fragment of this process is presented to outside reviewers, the outputs and the framing often specifically designed to make a specific point. How the author got there, and which assumptions were made on the way and how these assumptions developed over time is seldom included in the final write-up. The following article argues that rather than just providing output data to be considered in research – or providing explanations for technical outcomes as is frequently proposed in computer science, accountability can only be developed by better understanding the research process. In order to do this, we suggest a series of mechanisms that can be built into existing research practices to make them more intelligible to outside reviewers and scholars. These mechanisms are designed to develop the accountability principle of the GDPR and ensure more accountable scientific research. As the GDPR recitals also explicitly references scientific research, an accountability by design approach to technology research is grounded both in the articles and recitals of the GDPR. By documenting the key elements of a narrative research story which explains not just what you believe to have discovered but also how researchers got there, it may also be possible to create better accountability mechanisms.","authors":["Ben Wagner"],"meta":["February 2020Computer Law & Security Review 37:105398","DOI:10.1016/j.clsr.2020.105398"],"references":["333297671_A_context-consent_meta-framework_for_designing_open_qualitative_data_studies","324869376_Doing_being_an_ordinary_technology_and_social_media_user","322721659_Building_accountability_into_the_Internet_of_Things_the_IoT_Databox_model","322260626_Psychology_Science_and_Knowledge_Construction_Broadening_Perspectives_from_the_Replication_Crisis","331229982_Peer_Review_Bias_A_Critical_Review","330092144_The_GDPR_and_employee's_privacy_Much_ado_but_nothing_new","328073989_A_System_for_an_Accountable_Data_Analysis_Process_in_R","327757508_Scientific_Autonomy_Public_Accountability_and_the_Rise_of_Peer_Review_in_the_Cold_War_United_States","325796873_Microsoft's_purchase_of_GitHub_leaves_some_scientists_uneasy","322346663_Understanding_the_notion_of_risk_in_the_General_Data_Protection_Regulation"]}