{"id":"339353200_The_Relationship_between_the_Facial_Expression_of_People_in_University_Campus_and_Host-City_Variables","abstract":"Public attitudes towards local university matters for the resource investment to sustainable science and technology. The application of machine learning techniques enables the evaluation of resource investments more precisely even at the national scale. In this study, a total number of 4,327 selfies were collected from the social network services (SNS) platform of Sina Micro-Blog for check-in records of 92 Project-211 university campuses from 82 cities of 31 Provinces across mainland China. Photos were analyzed by the FireFACETM-V1.0 software to obtain scores of happy and sad facial expressions and a positive response index (PRI) was calculated (happy-sad). One-way analysis of variance indicated that both happy and PRI scores were highest in Shandong University and lowest in Harbin Engineering University. The national distribution of positive expression scores was highest in Changchun, Jinan, and Guangzhou cities. The maximum likelihood estimates from general linear regression indicated that the city-variable of the number of regular institutions of higher learning had the positive contribution to the happy score. The number of internet accesses and area of residential housing contributed to the negative expression scores. Therefore, people tend to show positive expression at campuses in cities with more education infrastructures but fewer residences and internet users. The geospatial analysis of facial expression data can be one approach to supply theoretical evidence for the resource arrangement of sustainable science and technology from universities.","authors":["Hongxu Wei","Richard Hauer","Xuquan Zhai"],"meta":["February 2020Applied Sciences 10(4):1474","DOI:10.3390/app10041474","Projects: The Relationship between Facial Expression of People in University Campus and Host-city VariablesNational Natural Science Foundation of China"],"references":["337388836_Facial_Expressions_of_Visitors_in_Forests_along_the_Urbanization_Gradient_What_Can_We_Learn_from_Selfies_on_Social_Networking_Services","333231463_Application_of_a_Smart_City_Model_to_a_Traditional_University_Campus_with_a_Big_Data_Architecture_A_Sustainable_Smart_Campus","331851916_The_Campus_as_a_Smart_City_University_of_Malaga_Environmental_Learning_and_Research_Approaches","328697447_Measuring_the_Performance_in_Creative_Cities_Proposal_of_a_Multidimensional_Model","325672346_Access_to_Medication_Abortion_Among_California's_Public_University_Students","338550333_Public_University_Use_of_Social_Infrastructure_Public-Private_Partnerhips_P3s_An_Exploratory_Examination","329777830_Building_actor-centric_transformative_capacity_through_city-university_partnerships","322663923_The_knowledge_economy_city_Gentrification_studentification_and_youthification_and_their_connections_to_universities","318581778_A_great_leap_of_faith_Limits_to_China's_university_cities","318243155_Privacy_as_a_proxy_for_Green_Web_browsing_Methodology_and_experimentation"]}