{"id":"339348189_Machine_Learning_for_Stochastic_Parameterization_Generative_Adversarial_Networks_in_the_Lorenz'96_Model","abstract":"Abstract Stochastic parameterizations account for uncertainty in the representation of unresolved subgrid processes by sampling from the distribution of possible subgrid forcings. Some existing stochastic parameterizations utilize data‐driven approaches to characterize uncertainty, but these approaches require significant structural assumptions that can limit their scalability. Machine learning models, including neural networks, are able to represent a wide range of distributions and build optimized mappings between a large number of inputs and subgrid forcings. Recent research on machine learning parameterizations has focused only on deterministic parameterizations. In this study, we develop a stochastic parameterization using the generative adversarial network (GAN) machine learning framework. The GAN stochastic parameterization is trained and evaluated on output from the Lorenz '96 model, which is a common baseline model for evaluating both parameterization and data assimilation techniques. We evaluate different ways of characterizing the input noise for the model and perform model runs with the GAN parameterization at weather and climate time scales. Some of the GAN configurations perform better than a baseline bespoke parameterization at both time scales, and the networks closely reproduce the spatiotemporal correlations and regimes of the Lorenz '96 system. We also find that, in general, those models which produce skillful forecasts are also associated with the best climate simulations.","authors":["David John Gagne","Hannah Christensen","Aneesh C. Subramanian","Adam H. Monahan"],"meta":["March 2020Journal of Advances in Modeling Earth Systems 12(3):e2019MS001896","DOI:10.1029/2019MS001896"],"references":["346848086_Evidence_and_gap_maps_a_comparison_of_different_approaches","335468155_The_GFDL_Global_Ocean_and_Sea_Ice_Model_OM40_Model_Description_and_Simulation_Features","334750250_Spatially_Extended_Tests_of_a_Neural_Network_Parametrization_Trained_by_Coarse-Graining","333174652_Global_Cloud-Resolving_Models","332681530_Applying_Machine_Learning_to_Improve_Simulations_of_a_Chaotic_Dynamical_System_Using_Empirical_Error_Correction","331136846_Stochastic_Parameterization_of_Subgrid-Scale_Velocity_Enhancement_of_Sea_Surface_Fluxes","330486882_A_Model_Framework_for_Stochastic_Representation_of_Uncertainties_Associated_with_Physical_Processes_in_NOAA's_Next_Generation_Global_Prediction_System_NGGPS","330148598_Applications_of_Deep_Learning_to_Ocean_Data_Inference_and_Sub-Grid_Parameterisation","337875277_Constraining_stochastic_parametrisation_schemes_using_high-resolution_simulations","330585079_From_reliable_weather_forecasts_to_skilful_climate_response_A_dynamical_systems_approach"]}