{"id":"339353502_Applying_probability-weighted_incubation_period_distributions_to_traditional_wind_rose_methodology_to_improve_public_health_investigations_of_Legionnaires'_disease_outbreaks","abstract":"In the event of a Legionnaires' disease outbreak, rapid location and control of the source of bacteria are crucial for outbreak management and regulation. In this paper, we describe an enhancement of the traditional wind rose for epidemiological use; shifting the focus of measurement from relative frequency of the winds speeds and directions to the relative volume of air carried, whilst also incorporating probability distributions of disease incubation periods to refine identification of the important wind directions during a cases window of exposure, i.e. from which direction contaminated aerosols most likely originated. The probability-weighted wind rose offers a potential improvement over the traditional wind rose by weighting the importance of wind measurements through incorporation of probability of exposure given an individual's time of symptom onset (obtained through knowledge of the incubation period), and by instead focusing on the volume of carrying air which offers better insight into the most probable direction of the source. This then provides a probabilistic distribution of which direction the wind was blowing around the time of infection. We discuss how the probability weighted wind rose can be implemented during a Legionnaires' disease outbreak, and how outbreak control teams might use it as supportive evidence to identify the most likely direction of the contaminated source from the presumed site of exposure. In addition, this paper discusses how minor adjustments can be made to the method allowing the probability weighted wind rose to be applied to other non-communicable airborne diseases, providing the disease's probability distribution for the incubation period distribution is well known.","authors":["Declan Bays","Emma Bennett","Thomas James Ronald Finnie"],"meta":["February 2020Epidemiology and Infection 148(e33)","DOI:10.1017/S0950268820000230","Project: Legionnaires' disease wind rose"],"references":["335876386_Spatial_and_Temporal_Variation_of_PM10_from_Industrial_Point_Sources_in_a_Rural_Area_in_Limpopo_South_Africa","333535586_Modelling_the_dispersion_of_radionuclides_in_dust_from_a_landform_covered_by_low_uranium_grade_waste_rock","324728840_Evaluating_meteorological_data_from_weather_stations_and_from_satellites_and_global_models_for_a_multi-site_epidemiological_study","7446207_A_Community-Wide_Outbreak_of_Legionnaires_Disease_Linked_to_Industrial_Cooling_Towers--How_Far_Can_Contaminated_Aerosols_Spread","233900414_The_application_of_geographic_information_systems_and_spatial_data_during_Legionnaires_disease_outbreak_responses","223941545_Source_estimation_methods_for_atmospheric_dispersion","200555681_Ambient_air_quality_during_wheat_and_rice_crop_stubble_burning_episodes_in_Patiala","49762934_Modeling_Legionnaires'_Disease_Outbreaks_Estimating_the_Timing_of_an_Aerosolized_Release_Using_Symptom-onset_Dates","23218654_A_community_outbreak_of_Legionnaires'_disease_associated_with_a_cooling_tower_in_Vic_and_Gurb_Catalonia_Spain_in_2005"]}