{"id":"339369285_Closed-loop_optimization_of_fast-charging_protocols_for_batteries_with_machine_learning","abstract":"Simultaneously optimizing many design parameters in time-consuming experiments causes bottlenecks in a broad range of scientific and engineering disciplines1,2. One such example is process and control optimization for lithium-ion batteries during materials selection, cell manufacturing and operation. A typical objective is to maximize battery lifetime; however, conducting even a single experiment to evaluate lifetime can take months to years3,4,5. Furthermore, both large parameter spaces and high sampling variability3,6,7 necessitate a large number of experiments. Hence, the key challenge is to reduce both the number and the duration of the experiments required. Here we develop and demonstrate a machine learning methodology to efficiently optimize a parameter space specifying the current and voltage profiles of six-step, ten-minute fast-charging protocols for maximizing battery cycle life, which can alleviate range anxiety for electric-vehicle users8,9. We combine two key elements to reduce the optimization cost: an early-prediction model⁵, which reduces the time per experiment by predicting the final cycle life using data from the first few cycles, and a Bayesian optimization algorithm10,11, which reduces the number of experiments by balancing exploration and exploitation to efficiently probe the parameter space of charging protocols. Using this methodology, we rapidly identify high-cycle-life charging protocols among 224 candidates in 16 days (compared with over 500 days using exhaustive search without early prediction), and subsequently validate the accuracy and efficiency of our optimization approach. Our closed-loop methodology automatically incorporates feedback from past experiments to inform future decisions and can be generalized to other applications in battery design and, more broadly, other scientific domains that involve time-intensive experiments and multi-dimensional design spaces.","authors":["Peter M. Attia","Aditya Grover","Norman Jin","Kristen A. Severson"],"meta":["February 2020Nature 578(7795):397-402","DOI:10.1038/s41586-020-1994-5"],"references":["331990949_Data-driven_prediction_of_battery_cycle_life_before_capacity_degradation","326608140_Machine_learning_for_molecular_and_materials_science","326466321_Controlling_an_organic_synthesis_robot_with_machine_learning_to_search_for_new_reactivity","324781561_Experimental_search_for_high-temperature_ferroelectric_perovskites_guided_by_two-step_machine_learning","333592325_Challenges_and_opportunities_towards_fast-charging_battery_materials","327994026_Fast_charging_of_lithium-ion_cells_Identification_of_aging-minimal_current_profiles_using_a_design_of_experiment_approach_and_a_mechanistic_degradation_analysis","327786694_Reconfigurable_system_for_automated_optimization_of_diverse_chemical_reactions","326109067_Hyperband_A_novel_bandit-based_approach_to_hyperparameter_optimization","324932578_Optimal_Experimental_Design_for_Parameterization_of_an_Electrochemical_Lithium-Ion_Battery_Model","324789891_Accelerating_the_discovery_of_materials_for_clean_energy_in_the_era_of_smart_automation","324104874_Best_arm_identification_in_multi-armed_bandits_with_delayed_feedback","322788115_Less_is_more_Sampling_chemical_space_with_active_learning","321832537_Automating_drug_discovery","320684745_Enabling_fast_charging-A_battery_technology_gap_assessment","316471433_High-Dimensional_Materials_and_Process_Optimization_Using_Data-Driven_Experimental_Design_with_Well-Calibrated_Uncertainty_Estimates"]}