{"id":"339309988_Theory_of_Noise-Scaled_Stability_Bounds_and_Entanglement_Rate_Maximization_in_the_Quantum_Internet","abstract":"Crucial problems of the quantum Internet are the derivation of stability properties of quantum repeaters and theory of entanglement rate maximization in an entangled network structure. The stability property of a quantum repeater entails that all incoming density matrices can be swapped with a target density matrix. The strong stability of a quantum repeater implies stable entanglement swapping with the boundness of stored density matrices in the quantum memory and the boundness of delays. Here, a theoretical framework of noise-scaled stability analysis and entanglement rate maximization is conceived for the quantum Internet. We define the term of entanglement swapping set that models the status of quantum memory of a quantum repeater with the stored density matrices. We determine the optimal entanglement swapping method that maximizes the entanglement rate of the quantum repeaters at the different entanglement swapping sets as function of the noise of the local memory and local operations. We prove the stability properties for non-complete entanglement swapping sets, complete entanglement swapping sets and perfect entanglement swapping sets. We prove the entanglement rates for the different entanglement swapping sets and noise levels. The results can be applied to the experimental quantum Internet.","authors":["Laszlo Gyongyosi","Sandor Imre"],"meta":["February 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-58200-6"],"references":["339392205_Delocalized_information_in_quantum_networks","338507141_Optimizing_High-Efficiency_Quantum_Memory_with_Quantum_Machine_Learning_for_Near-Term_Quantum_Devices","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336341938_Towards_Large-Scale_Quantum_Networks","336113153_Practical_figures_of_merit_and_thresholds_for_entanglement_distribution_in_quantum_networks","335947009_Bounds_for_multi-end_communication_over_quantum_networks","333167029_End-to-end_capacities_of_a_quantum_communication_network","331423635_Entanglement_Access_Control_for_the_Quantum_Internet","337784291_Ground-to-satellite_quantum_teleportation","336987449_Quantum_Computing_based_Hybrid_Solution_Strategies_for_Large-scale_Discrete-Continuous_Optimization_Problems"]}