{"id":"339343335_Computer_science_students'_perceived_needs_for_support_and_their_academic_performance_by_gender_and_residency_An_exploratory_study","abstract":"Purpose\nThis study investigates computer science (CS) students' perceived needs for support in an array of academic and nonacademic areas prior to entering college and relates these findings to their subsequent performance in the core CS curriculum. This study specifically explored how students' perceived needs vary by gender and residency and how these perceived needs relate to students' academic performance in CS courses.\n\nDesign/methodology/approach\nData included survey responses and academic performance measures from 718 CS students. Approximately 14 percent of the participants were female students, and 86 percent were male students. Also, 24 percent of students were international, 46 percent out-of-state, and 30 percent were in-state students. To address research questions, multiple regressions and analysis of covariance were conducted. For all analyses, students' ACT scores were used as covariates.\n\nFindings\nResults show significant main effects for both gender and residency, but interaction is not significant. Female students, on average, selected more perceived needs compared to male students. Also, international students selected more needs compared to domestic students. Also, the number of perceived needs for different categories is unique across students of different residency and gender. Results also indicate that the perceived need for assistance with STEM content is associated with lower CS academic performance. In contrast, perceived needs for professional skills and support services are not related to CS performance. Finally, students' ACT score is a good predictor of their academic performance.\n\nOriginality/value\nThis study provides important contributions to higher education and CS education literature. This is the first study with CS students focusing on their perceived needs. Also, this study includes an almost complete data set (94.6 percent survey completion rate) from CS students.","authors":["Muhsin Menekse","Xintong Zheng","Saira Anwar"],"meta":["February 2020","DOI:10.1108/JARHE-07-2019-0194"],"references":["302586499_Best_Alternatives_to_Cronbach's_Alpha_Reliability_in_Realistic_Conditions_Congeneric_and_Asymmetrical_Measurements","298806912_Correlates_of_Success_in_Introductory_Programming_A_Study_with_Middle_School_Students","289826564_But_I'm_Not_Good_at_Math_The_Changing_Salience_of_Mathematical_Self-Concept_in_Shaping_Women's_and_Men's_STEM_Aspirations","289378553_The_Influence_of_Academic_Self-Efficacy_on_Academic_Performance_A_Systematic_Review","352833854_A_Comparative_Analysis_of_the_Needs_of_Undergraduate_Adults","326395523_Assessing_and_responding_to_the_growth_of_computer_science_undergraduate_enrollments","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","312959977_Women_planning_to_major_in_computer_science_Who_are_they_and_what_makes_them_unique","308043753_Emotional_social_and_academic_adjustment_of_college_students_A_longitudinal_study_of_retention","303197340_The_role_of_needs_analysis_in_adult_ESL_programme_design"]}