{"id":"339344596_Historical_comparison_of_gender_inequality_in_scientific_careers_across_countries_and_disciplines","abstract":"There is extensive, yet fragmented, evidence of gender differences in academia suggesting that women are underrepresented in most scientific disciplines and publish fewer articles throughout a career, and their work acquires fewer citations. Here, we offer a comprehensive picture of longitudinal gender differences in performance through a bibliometric analysis of academic publishing careers by reconstructing the complete publication history of over 1.5 million gender-identified authors whose publishing career ended between 1955 and 2010, covering 83 countries and 13 disciplines. We find that, paradoxically, the increase of participation of women in science over the past 60 years was accompanied by an increase of gender differences in both productivity and impact. Most surprisingly, though, we uncover two gender invariants, finding that men and women publish at a comparable annual rate and have equivalent career-wise impact for the same size body of work. Finally, we demonstrate that differences in publishing career lengths and dropout rates explain a large portion of the reported career-wise differences in productivity and impact, although productivity differences still remain. This comprehensive picture of gender inequality in academia can help rephrase the conversation around the sustainability of women’s careers in academia, with important consequences for institutions and policy makers.","authors":["Junming Huang","Alexander J. Gates","Roberta Sinatra","Albert-Laszlo Barabasi"],"meta":["February 2020Proceedings of the National Academy of Sciences 117(9):201914221","DOI:10.1073/pnas.1914221117"],"references":["334552575_Gender_stereotypes_have_changed_A_cross-temporal_meta-analysis_of_US_public_opinion_polls_from_1946_to_2018","331220114_The_changing_career_trajectories_of_new_parents_in_STEM","326429386_NIH_funding_longevity_by_gender","324609859_The_gender_gap_in_science_How_long_until_women_are_equally_represented","323502497_Science_of_science","319293077_Vicious_circles_of_gender_bias_lower_positions_and_lower_performance_Gender_differences_in_scholarly_productivity_and_impact","343122292_Women_in_Global_Science_Advancing_Academic_Careers_through_International_Collaboration","329561585_Changing_demographics_of_scientific_careers_The_rise_of_the_temporary_workforce","316269980_Gender_Disparities_in_Science_Dropout_Productivity_Collaborations_and_Success_of_Male_and_Female_Computer_Scientists","314108447_Fleeing_the_Ivory_Tower_Gender_Differences_in_the_Turnover_Experiences_of_Women_Faculty"]}