{"id":"339335167_In_silico_Strategies_to_Support_Fragment-to-Lead_Optimization_in_Drug_Discovery","abstract":"Fragment-based drug (or lead) discovery (FBDD or FBLD) has developed in the last two decades to become a successful key technology in the pharmaceutical industry for early stage drug discovery and development. The FBDD strategy consists of screening low molecular weight compounds against macromolecular targets (usually proteins) of clinical relevance. These small molecular fragments can bind at one or more sites on the target and act as starting points for the development of lead compounds. In developing the fragments attractive features that can translate into compounds with favorable physical, pharmacokinetics and toxicity (ADMET—absorption, distribution, metabolism, excretion, and toxicity) properties can be integrated. Structure-enabled fragment screening campaigns use a combination of screening by a range of biophysical techniques, such as differential scanning fluorimetry, surface plasmon resonance, and thermophoresis, followed by structural characterization of fragment binding using NMR or X-ray crystallography. Structural characterization is also used in subsequent analysis for growing fragments of selected screening hits. The latest iteration of the FBDD workflow employs a high-throughput methodology of massively parallel screening by X-ray crystallography of individually soaked fragments. In this review we will outline the FBDD strategies and explore a variety of in silico approaches to support the follow-up fragment-to-lead optimization of either: growing, linking, and merging. These fragment expansion strategies include hot spot analysis, druggability prediction, SAR (structure-activity relationships) by catalog methods, application of machine learning/deep learning models for virtual screening and several de novo design methods for proposing synthesizable new compounds. Finally, we will highlight recent case studies in fragment-based drug discovery where in silico methods have successfully contributed to the development of lead compounds.","authors":["Lauro Ribeiro de Souza Neto","José Teófilo Moreira Filho","Bruno Junior Neves","Rocío Lucía Beatriz Riveros Maidana"],"meta":["February 2020Frontiers in Chemistry 8","DOI:10.3389/fchem.2020.00093"],"references":["335843041_Key_Topics_in_Molecular_Docking_for_Drug_Design","334404567_Concepts_of_Artificial_Intelligence_for_Computer-Assisted_Drug_Discovery","334315304_Development_of_Inhibitors_against_Mycobacterium_abscessus_tRNA_m1G37_Methyltransferase_TrmD_Using_Fragment-Based_Approaches","332234002_Binding_mode_information_improves_fragment_docking","331808409_Fragment_Hits_What_do_They_Look_Like_and_How_do_They_Bind","345713469_Fragment-Based_Lead_Discovery","333835236_Fragment_Growing_to_Design_Optimized_Inhibitors_for_Human_Blood_Group_B_Galactosyltransferase_GTB","332844156_Drug_Analogs_from_Fragment-Based_Long_Short-Term_Memory_Generative_Neural_Networks","332346711_Applications_of_machine_learning_in_drug_discovery_and_development","331822885_ADMET_modeling_approaches_in_drug_discovery"]}