{"id":"339356108_Early_detection_of_sepsis_utilizing_deep_learning_on_electronic_health_record_event_sequences","abstract":"Background: \nThe timeliness of detection of a sepsis incidence in progress is a crucial factor in the outcome for the patient. Machine learning models built from data in electronic health records can be used as an effective tool for improving this timeliness, but so far, the potential for clinical implementations has been largely limited to studies in intensive care units. This study will employ a richer data set that will expand the applicability of these models beyond intensive care units. Furthermore, we will circumvent several important limitations that have been found in the literature: (1) Model evaluations neglect the clinical consequences of a decision to start, or not start, an intervention for sepsis. (2) Models are evaluated shortly before sepsis onset without considering interventions already initiated. (3) Machine learning models are built on a restricted set of clinical parameters, which are not necessarily measured in all departments. (4) Model performance is limited by current knowledge of sepsis, as feature interactions and time dependencies are hard-coded into the model.\n\nMethods: \nIn this study, we present a model to overcome these shortcomings using a deep learning approach on a diverse multicenter data set. We used retrospective data from multiple Danish hospitals over a seven-year period. Our sepsis detection system is constructed as a combination of a convolutional neural network and a long short-term memory network. We assess model quality by standard concepts of accuracy as well as clinical usefulness, and we suggest a retrospective assessment of interventions by looking at intravenous antibiotics and blood cultures preceding the prediction time.\n\nResults: \nResults show performance ranging from AUROC 0.856 (3 h before sepsis onset) to AUROC 0.756 (24 h before sepsis onset). Evaluating the clinical utility of the model, we find that a large proportion of septic patients did not receive antibiotic treatment or blood culture at the time of the sepsis prediction, and the model could, therefore, facilitate such interventions at an earlier point in time.\n\nConclusion: \nWe present a deep learning system for early detection of sepsis that can learn characteristics of the key factors and interactions from the raw event sequence data itself, without relying on a labor-intensive feature extraction work. Our system outperforms baseline models, such as gradient boosting, which rely on specific data elements and therefore suffer from many missing values in our dataset.","authors":["Simon Meyer Lauritsen","Mads Ellersgaard Kalør","Emil Lund Kongsgaard","Katrine Meyer Lauritsen"],"meta":["February 2020Artificial Intelligence in Medicine 104:101820","DOI:10.1016/j.artmed.2020.101820"],"references":["329936040_Prediction_of_Sepsis_Patients_Using_Machine_Learning_Approach_A_Meta-Analysis","324843944_Biases_in_electronic_health_record_data_due_to_processes_within_the_healthcare_system_Retrospective_observational_study","322740246_Multicentre_validation_of_a_sepsis_prediction_algorithm_using_only_vital_sign_data_in_the_emergency_department_general_ward_and_ICU","321009091_Effect_of_a_machine_learning-based_severe_sepsis_prediction_algorithm_on_patient_survival_and_hospital_length_of_stay_A_randomised_clinical_trial","319770438_Long-Term_Recurrent_Convolutional_Networks_for_Visual_Recognition_and_Description","322133343_An_Interpretable_Machine_Learning_Model_for_Accurate_Prediction_of_Sepsis_in_the_ICU","319210027_An_Improved_Multi-Output_Gaussian_Process_RNN_with_Real-Time_Validation_for_Early_Sepsis_Detection","318742463_Very_Deep_Convolutional_Networks_for_Text_Classification","317578244_Learning_to_Detect_Sepsis_with_a_Multitask_Gaussian_Process_RNN_Classifier","317558136_Deep_EHR_A_Survey_of_Recent_Advances_on_Deep_Learning_Techniques_for_Electronic_Health_Record_EHR_Analysis"]}