{"id":"339479653_Academic_Success_Assessment_through_Version_Control_Systems","abstract":"Version control systems’ usage is a highly demanded skill in information and communication technology professionals. Thus, their usage should be encouraged by educational institutions. This work demonstrates that it is possible to assess if a student can pass a computer science-related subject by monitoring its interaction with a version control system. This paper proposes a methodology that compares the performance of several machine learning models so as to select the appropriate predicting model for the assessment of the students’ achievements. To fit predicting models, three subjects of the Degree in Computer Science at the University of León are considered to obtain the dataset: computer organization, computer programming, and operating systems extension. The common aspect of these subjects is their assignments, which are based on developing one or several programs with programming languages such as C or Java. To monitor the practical assignments and individual performance, a Git repository is employed allowing students to store source code, documentation, and supporting control versions. According to the presented experience, there is a huge correlation between the level of interaction for each student and the achieved grades.","authors":["Ángel Manuel Guerrero-Higueras","Camino Fernández Llamas","Lidia Sánchez","Alexis Gutiérrez-Fernández"],"meta":["February 2020Applied Sciences 10(4):1492","DOI:10.3390/app10041492"],"references":["335962706_Mediating_Role_of_Dynamic_Capabilities_on_the_Relationship_between_Human_Resource_Development_and_Organizational_Effectiveness","283730873_Learning_analytics_should_not_promote_one_size_fits_all_The_effects_of_instructional_conditions_in_predicting_academic_success","279555980_Guest_Editorial_-_Learning_and_Knowledge_Analytics","336932751_Prediction_of_academic_success_through_interaction_with_version_control_systems","328971910_Predictive_models_of_academic_success_a_case_study_with_version_control_systems","320667484_Detection_of_Cyber-attacks_to_indoor_real_time_localization_systems_for_autonomous_robots","313060232_Learning_Internal_Representations_by_Error_Propagation","267691352_Predicting_student_success_by_mining_enrolment_data","262171260_GitHub_in_the_classroom_not_just_for_group_projects","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink"]}