{"id":"339420405_Exploring_Students'_Experiences_of_Self-Regulated_Learning_during_a_Large_Flipped_Classroom_Course_in_Teacher_Education","abstract":"The aim of the study was to explore teacher students' experiences of self-regulated learning and the teaching-learning environment during a course following the Flipped Classroom approach. Theoretical perspectives include self-regulated learning and motivation, especially in terms of the fore-thought phase in which the students set goals for their studying and learning processes, and monitoring. Goals are approached, in addition to the immediate study context, from more general perspectives of teacher education preferences. This study consists of two parts. In Study 1, 156 Finnish teacher students responded in the initial survey and 144 students responded to the final survey. Altogether, 89 students responded to all the questionnaires. Study 2 includes interviews with six teacher students. The data were analyzed by using mixed methods including qualitative content analyses and various quantitative analyses. The results suggested that students come with various goals and interests in this kind of course and these are related to their experiences of the teaching-learning environment in various ways. Results also revealed that teacher students seem not to set clear goals for their studying on the course level, but broader teacher education preferences were related to their experiences of the teaching-learning environment. Also, student interest in the course seemed to be quite persistent as the original interest is related to the level of interest at the end of the FC course.","authors":["Laura Hirsto","Sanna Väisänen","Anni Arffman"],"meta":["December 2019","DOI:10.26803/ijlter.18.13.6"],"references":["320664075_The_Flipped_Classroom_Two_Learning_Modes_that_Foster_Two_Learning_Outcomes","313443807_Approaches_to_Studying_and_Perceptions_of_University_Teaching-Learning_EnvironmentsConcepts_Measures_and_Preliminary_Findings","308046937_Am_I_in_the_right_place_Academic_engagement_and_study_success_during_the_first_years_at_university","305494885_The_flipped_classroom_for_active_effective_and_increased_learning_-_especially_for_low_achievers","295303146_How_to_plan_and_perform_a_qualitative_study_using_content_analysis","283799736_Examining_the_Effectiveness_of_a_Semi-Self-Paced_Flipped_Learning_Format_in_a_College_General_Chemistry_Sequence","326165282_Integrating_self-regulation_principles_with_flipped_classroom_pedagogy_for_first_year_university_students","299133056_The_effect_of_the_flipped_classroom_approach_to_OpenCourseWare_instruction_on_students'_self-regulation","284503687_The_weave_of_motivation_and_self-regulated_learning","283535260_Flipping_the_Business_Information_Literacy_Classroom_Redesign_Implementation_and_Assessment_of_a_Case_Study"]}