{"id":"339483274_Examining_learning_engagement_in_MOOCs_a_self-determination_theoretical_perspective_using_mixed_method","abstract":"MOOCs as a learning approach are gaining popularity, and helping learners and instructors understand how learning engagement is constructed in a MOOC context is of increasing importance. Although previous research has undoubtedly enriched our knowledge of MOOCs, our understanding of student engagement in the MOOC context is still limited. This study adopts a sequential explanatory mixed-methods approach to examine student engagement in MOOCs from the self-determination theory (SDT) perspective. A total of 693 valid responses to a MOOC Engagement-Motivation scale were collected and 82 MOOC participants were interviewed. The results showed significant differences between the MOOC completers and non-completers with respect to the rank of motivators for enrolment and the rank of learning activities for participation. The association between perceived competence and emotional engagement was significantly higher in the MOOC completion group. The results of a multiple regression analysis indicated that the SDT model can significantly predict student engagement. Perceived competence registered the largest positive impact, and perceived relatedness had a slight negative impact on engagement. The three components of engagement can also predict learners’ perceived learning. Emotional engagement showed the largest positive impact. However, logistic regression analysis indicated that these components of engagement poorly predicted MOOC learners’ completion. Qualitative analyses of student interview data revealed three main factors that can promote learners’ SDT needs: active learning, course resources, and instructor accessibility. Implications of the findings can help MOOC designers and educators to better engage their participants.","authors":["Min Lan","Khe Foon Hew"],"meta":["December 2020","DOI:10.1186/s41239-020-0179-5"],"references":["337564042_Supporting_learners'_self-regulated_learning_in_Massive_Open_Online_Courses","331772656_Where_is_the_theory_within_the_field_of_educational_technology_research","328774579_Massive_open_online_courses_MOOCS_Systematic_literature_review_in_Malaysian_higher_education","327838796_Factors_influencing_peer_learning_and_performance_in_MOOC_asynchronous_online_discussion_forum","323642545_Understanding_the_faculty_perspectives_influencing_their_innovative_practices_in_MOOCsSPOCs_a_case_study","320188216_How_do_we_Model_Learning_at_Scale_A_Systematic_Review_of_Research_on_MOOCs","332495137_The_Validation_of_the_MOOC_Learner_Engagement_and_Motivation_Scale","332033706_Understanding_Participant's_Behaviour_in_Massively_Open_Online_Courses","326599998_Systematic_Review_of_Discussion_Forums_in_Massive_Open_Online_Courses_MOOCs","324805871_A_framework_for_self-determination_in_massive_open_online_courses_Design_for_autonomy_competence_and_relatedness"]}