{"id":"339469779_Judith_Butler_Notes_Toward_a_Performative_Theory_of_Assembly_Rezension","abstract":"Judith Butler, Notes Toward a Performative Theory of Assembly, Cambridge/London: Harvard University Press 2015, 248 S., EUR 24,95, ISBN 978-0-674-96775-5. \n\nDie Kritik an der Voraussetzung eines souveränen Subjekts und einer vom Individuum ausgehenden Handlungsmacht ist in poststrukturalistischen und queer-feministischen Theorien eine breit vertretene Position. Dabei steht kaum ein Name so prominent für die subjektkritische Perspektive wie der von Judith Butler. Im Zuge der Subjektkritik stellte sich die Frage nach neuen Konzeptualisierungen von Kollektivität und der Möglichkeit politischer Handlungsfähigkeit, ohne auf identitären, essentialisierenden oder individualistischen Prinzipien aufzubauen. Judith Butlers „Notes Toward a Performative Theory of Assembly“1 stellt einen Versuch dar, diese Problematik theoretisch zu fassen und Antworten zu formulieren. Drei der sechs darin versammelten Beiträge bauen auf Vorträgen (Mary Flexner Lectures) am Bryn Mawr College auf; diese Lectures und die Rede anlässlich der Verleihung des Adorno- Preises sind zwischen 2012 und 2014 schon in Zeitschriften beziehungsweise Sammelbanden erschienen. Zwei Kapitel (1 und 5) stellen hingegen bis dato unveröffentlichte Texte dar. Es fa¨llt auf, dass die Texte im Vergleich zu früheren Schriften Butlers in einer einfacheren Sprache geschrieben sind, was bei der Komplexität der Materie keine Selbstverständlichkeit ist. Butler nimmt die Lesenden an die Hand und versucht, sich in mo¨gliche Denkweisen hineinzuversetzen und entstehende Fragen vorwegzunehmen. Sie beleuchtet Probleme aus vielen Perspektiven und kreist im Text ihre eigenen Begriffe ein. Offensichtlich ist, dass die Arbeit unter dem Eindruck von Massenprotesten entstand, von denen einige Umwälzungen sozialer und politischer Ordnungen zur Folge hatten (was von vielen kritischen Theoretiker_innen gar nicht mehr für möglich gehalten wurde). Butler beschreibt vor allem Proteste im öffentlichen Raum (Occupy- Bewegung, Pegida, Gezi-Park, Tahirplatz usw.) und setzt dabei ihren Fokus auf kollektive Körperpolitiken. Sie beschreibt, wie Körper im Modus des Protests neue Formen der Sichtbarkeit herstellen und greift für diesen Zweck Hannah Arendts Konzepte des Erscheinungsraums und der Politik auf.","authors":["Jennifer Ramme"],"meta":["April 2017L' homme : europäische Zeitschrift für feministische Geschichtswissenschaft 28(1):162-166","DOI:10.14220/lhom.2017.28.1.162"],"references":[]}