{"id":"339490256_SME_Innovation_and_Development_in_the_Context_of_Industry_40","abstract":"In the years 2013-2014, when the financial crisis that began in 2007 became ruinous for a large number of small companies, the governments of several European countries launched plans to help supersite enterprises. The types of aid have all been oriented towards promoting the innovation of production and logistics processes and have assumed quite similar characteristics in different countries. For this, it’s usual to talk about Industry 4.0 plans in each one of the 15 European countries in which these measures to help companies have been financed. The common goal of these programs is to innovate SMEs in terms of automation (of machines), integration (of lines) and interconnection (of the production system with its management). For SMEs it would be a great opportunity. However, their managers - who usually are at the same time, owners, operations managers and technicians) face great difficulties in accessing funding from an Industry 4.0\" plan, due to lack of information and limits on their knowledge of new digitization technologies. To help managers / technicians to analyze the critical issues of their own company and prepare a request for technical and financial support from Industry 4.0, Politecnico di Torino and Gruppo Banca di Asti created the PMInnova Program, offering advice for check-ups, project development and participation in regional and European calls. This contribution will introduce the problem of supporting SMEs in the context of Industry 4.0, in the context of Industry 4.0, by evaluating costs and benefits which could be obtained, by answering the following questions: 1. Which are the measures of Industry 4.0 that favor the integration and the digitization in a SME? 2. How could an Industry 4.0 measure be applied to an SME with expected strong impact?","authors":["Agostino Villa","Teresa Taurino"],"meta":["January 2019Procedia Manufacturing 39:1415-1420","DOI:10.1016/j.promfg.2020.01.311"],"references":["323495836_Scheduling_in_production_supply_chain_and_Industry_40_systems_by_optimal_control_fundamentals_state-of-the-art_and_applications","319612802_The_industrial_management_of_SMEs_in_the_era_of_Industry_40","315670892_Past_present_and_future_of_Industry_40_-_a_systematic_literature_review_and_research_agenda_proposal","307619591_A_Categorical_Framework_of_Manufacturing_for_Industry_40_and_Beyond","277975059_Graph-based_models_to_classify_effective_collaboration_in_SME_networks","271101269_A_dynamic_model_and_an_algorithm_for_short-term_supply_chain_scheduling_in_the_smart_factory_industry_40","266447351_Conditions_for_Effective_Collaboration_in_SME_Networks_Based_on_Graph_Model","323527369_The_link_between_Industry_40_and_lean_manufacturing_mapping_current_research_and_establishing_a_research_agenda","322406651_A_critical_investigation_of_Industry_40_in_manufacturing_theoretical_operationalisation_framework","285495324_How_virtualization_decentralization_and_network_building_change_the_manufacturing_landscape_An_Industry_40_Perspective"]}