{"id":"339400266_When_and_why_does_emotional_design_foster_learning_Evidence_for_situational_interest_as_a_mediator_of_increased_persistence","abstract":"Multiple studies have revealed the beneficial effects of emotional design on affective or motivational factors but not often on learning outcomes. We, therefore, tested one important boundary condition: the duration of the learning episode. For the implementation of emotional design, we used the video format of sketched explanation videos, which is particularly popular on online video platforms. We tested the hypothesis that emotional design is beneficial for learning but only in the later phases of studying (sustained learning). This learning benefit is mediated via triggered and maintained situational interest. Seventy‐nine students took part in a two‐group between‐subjects design. Students learned from one of two videos (16 min): either a neutral video that followed cognitive design principles or an emotional‐designed video that was based on the neutral video but enriched with emotional design elements (e.g., personalized frame story, warm colours, and tender voice). In line with our hypothesis, the emotional design led to triggered situational interest, leading to a higher maintained situational interest, which in turn fostered performance in the third (final) study phase but not in the two previous ones. Our results suggest that emotional design's positive effects are detectable especially (or only) during prolonged study situations in which motivational factors may play a more critical role. This study thus provides a potential explanation for mixed effects from previous research in this study field.\n\nLay Description\n\nWhat is already known about this topic\nMany explanatory videos on video platforms use live sketching as emotional design.\nEmotional design influences affective or motivational factors in previous studies.\nThese affective effects rarely translated into better learning outcomes.\nThis mixed pattern of results of emotional design suggests boundary conditions.\n\nWhat this paper adds\nEmotional design improves learning in longer learning sessions.\nThese beneficial effects were driven by situational interest.\nThis process analysis suggests situational interest as an explanatory mechanism.\nLearning session length seems to explain previously ambiguous result patterns.\n\nImplications for practice and/or policy\nLive sketching videos can be used to implement emotional design.\nEmotional design would be of particular benefit in longer‐learning sessions.\nEmotional design is particularly promising in self‐guided learning arrangements.","authors":["Tino Endres","Steffen Weyreter","Alexander Renkl","Alexander Eitel"],"meta":["August 2020Journal of Computer Assisted Learning 36(3)","DOI:10.1111/jcal.12418"],"references":["318952989_The_Better_You_Feel_the_Better_You_Learn_Do_Warm_Colours_and_Rounded_Shapes_Enhance_Learning_Outcome_in_Multimedia_Learning","332877206_Feeling_good_learning_better_Effectivity_of_an_emotional_design_procedure_in_multimedia_Learning","327887386_How_effective_is_emotional_design_A_meta-analysis_on_facial_anthropomorphisms_and_pleasant_colors_during_multimedia_learning","322932868_Emotional_text_design_in_multimedia_learning_A_mixed-methods_study_using_eye_tracking","316534620_Anthropomorphism_in_Decorative_Pictures_Benefit_or_Harm_for_Learning","313343638_Interest_learning_and_development","305731673_Exploring_the_effects_of_seductive_details_with_the_4-phase_model_of_interest","304861449_e-Learning_and_the_Science_of_Instruction_Fourth_Edition","304861043_Cambridge_Handbook_of_Multimedia_Learning_Second_Edition","304833950_Interest_and_Its_Contribution_as_a_Mental_Resource_for_Learning"]}