{"id":"339417976_Automated_Machine_Learning_Review_of_the_State-of-the-Art_and_Opportunities_for_Healthcare","abstract":"Objective\nThis work aims to provide a review of the existing literature in the field of automated machine learning (AutoML) to help healthcare professionals better utilize machine learning models “off-the-shelf” with limited data science expertise. We also identify the potential opportunities and barriers to using AutoML in healthcare, as well as existing applications of AutoML in healthcare.\n\nMethods\nPublished papers, accompanied with code, describing work in the field of AutoML from both a computer science perspective or a biomedical informatics perspective were reviewed. We also provide a short summary of a series of AutoML challenges hosted by ChaLearn.\n\nResults\nA review of 101 papers in the field of AutoML revealed that these automated techniques can match or improve upon expert human performance in certain machine learning tasks, often in a shorter amount of time. The main limitation of AutoML at this point is the ability to get these systems to work efficiently on a large scale, i.e. beyond small- and medium-size retrospective datasets.\n\nDiscussion\nThe utilization of machine learning techniques has the demonstrated potential to improve health outcomes, cut healthcare costs, and advance clinical research. However, most hospitals are not currently deploying machine learning solutions. One reason for this is that health care professionals often lack the machine learning expertise that is necessary to build a successful model, deploy it in production, and integrate it with the clinical workflow. In order to make machine learning techniques easier to apply and to reduce the demand for human experts, automated machine learning (AutoML) has emerged as a growing field that seeks to automatically select, compose, and parametrize machine learning models, so as to achieve optimal performance on a given task and/or dataset.\n\nConclusion\nWhile there have already been some use cases of AutoML in the healthcare field, more work needs to be done in order for there to be widespread adoption of AutoML in healthcare.","authors":["Jonathan Waring","Charlotta Lindvall","Renato Umeton"],"meta":["February 2020Artificial Intelligence in Medicine 104(6):101822","DOI:10.1016/j.artmed.2020.101822"],"references":["333228756_End-to-end_lung_cancer_screening_with_three-dimensional_deep_learning_on_low-dose_chest_computed_tomography","333122600_Cardiovascular_disease_risk_prediction_using_automated_machine_learning_A_prospective_study_of_423604_UK_Biobank_participants","332680955_Automation_of_the_kidney_function_prediction_and_classification_through_ultrasound-based_kidney_imaging_using_deep_learning","339440322_Hyperopt_A_Python_Library_for_Optimizing_the_Hyperparameters_of_Machine_Learning_Algorithms","338681785_Hyperparameter_Optimization","338681784_Efficient_Multi-objective_Neural_Architecture_Search_via_Lamarckian_Evolution","338681644_Neural_Architecture_Search_A_Survey","333183665_Towards_Automatically-Tuned_Deep_Neural_Networks","333181730_Analysis_of_the_AutoML_Challenge_Series_2015-2018","332210635_Machine_Learning_in_Medicine"]}