{"id":"339418509_Enhancing_a_machine_learning_binarization_framework_by_perturbation_operators_analysis_on_the_multidimensional_knapsack_problem","abstract":"Solving combinatorial optimization problems is of great interest in the areas of computer science and operations research. Optimization algorithms and particularly metaheuristics are constantly improved in order to reduce execution times, increase the quality of solutions and address larger instances. In this work, an improvement of the binarization framework which uses the K-means technique is developed. To achieve this, a perturbation operator based on the K-nearest neighbor technique is incorporated into the framework with the aim of generating more robust binarized algorithms. The technique of K-nearest neighbors is used for improving the properties of diversification and intensification of metaheuristics in its binary version. The contribution of the K-nearest neighbors perturbation operator to the final results is systematically analyzed. Particle Swarm Optimization and Cuckoo Search are used as metaheuristic techniques. To verify the results, the well-known multidimensional knapsack problem is tackled. A computational comparison is made with the state-of-the-art of metaheuristic techniques that use general mechanisms of binarization. The results show that our improved framework produces consistently better results. In this sense, the contribution of the operator which uses the K-nearest neighbors technique is investigated finding that this operator contributes significantly to the quality of the results.","authors":["Jose Garcia Conejeros","Eduardo Lalla-Ruiz","Stefan Voss","Enrique López Droguett"],"meta":["September 2020International Journal of Machine Learning and Cybernetics 11(19)","DOI:10.1007/s13042-020-01085-8"],"references":["344418678_Combining_metaheuristics_with_mathematical_programming_constraint_programming_and_machine_learning","335848239_A_Db-Scan_Binarization_Algorithm_Applied_to_Matrix_Covering_Problems","335444640_Self-Adaptive_Particle_Swarm_Optimization_for_Large-Scale_Feature_Selection_in_Classification","330863744_Binary_multi-verse_optimization_algorithm_for_global_optimization_and_discrete_problems","327383980_A_clustering_algorithm_applied_to_the_binarization_of_Swarm_intelligence_continuous_metaheuristics","325056007_A_Binary_Cuckoo_Search_Big_Data_Algorithm_Applied_to_Large-Scale_Crew_Scheduling_Problems","322391673_A_Percentile_Transition_Ranking_Algorithm_Applied_to_Binarization_of_Continuous_Swarm_Intelligence_Metaheuristics","322099639_An_artificial_algae_algorithm_for_solving_binary_optimization_problems","332763386_Domain-independent_Severely_Noisy_Image_Segmentation_via_Adaptive_Wavelet_Shrinkage_Using_Particle_Swarm_Optimization_and_Fuzzy_C-Means","322273815_Forward_Forecast_of_Stock_Price_Using_Sliding-Window_Metaheuristic-Optimized_Machine_Learning_Regression"]}