{"id":"339482375_Data-Driven_Web_APIs_Recommendation_for_Building_Web_Applications","abstract":"The ever-increasing popularity of web APIs allows app developers to leverage a set of existing APIs to achieve their sophisticated objectives. The heavily fragmented distribution of web APIs makes it challenging for an app developer to find appropriate and compatible web APIs. Currently, app developers usually have to manually discover candidate web APIs, verify their compatibility and select appropriate and compatible ones. This process is cumbersome and requires detailed knowledge of web APIs which is often too demanding. It has become a major obstacle to further and broader applications of web APIs. To address this issue, we first propose a web API correlation graph built on extensive data about the compatibility between web APIs. Then, we propose WAR (Web APIs Recommendation), the first data-driven approach for web APIs recommendation that integrates API discovery, verification and selection operations based on keywords search over the web API correlation graph. WAR assists app developers without detailed knowledge of web APIs in searching for appropriate and compatible APIs by typing a few keywords that represent the tasks required to achieve app developers’ objectives. We conducted large-scale experiments on 18,478 real-world APIs and 6,146 real-world apps to demonstrate the usefulness and efficiency of WAR.","authors":["Lianyong Qi","Qiang He","Feifei Chen","Xuyun Zhang"],"meta":["February 2020","DOI:10.1109/TBDATA.2020.2975587"],"references":["335594454_A_Game-Theoretical_Approach_for_User_Allocation_in_Edge_Computing_Environment","324752674_Privacy-Aware_Multidimensional_Mobile_Service_Quality_Prediction_and_Recommendation_in_Distributed_Fog_Environment","319868692_Web_API_Recommendation_for_Mashup_Development_Using_Matrix_Factorization_on_Integrated_Content_and_Network-Based_Service_Clustering","332659357_Finding_All_You_Need_Web_APIs_Recommendation_in_Web_of_Things_Through_Keywords_Search","320261594_A_Distributed_Locality-Sensitive_Hashing-Based_Approach_for_Cloud_Service_Recommendation_From_Multi-Source_Data","319640524_Service_Recommendation_Based_on_Targeted_Reconstruction_of_Service_Descriptions","319640442_A_Novel_Framework_for_Service_Set_Recommendation_in_Mashup_Creation","315525922_Integrated_Content_and_Network-Based_Service_Clustering_and_Web_API_Recommenation_for_Mashup_Development","311359043_A_Survey_of_App_Store_Analysis_for_Software_Engineering","311334613_Web_Service_Recommendation_With_Reconstructed_Profile_From_Mashup_Descriptions"]}