{"id":"339488316_Development_of_the_Accounting_Information_System_as_Teaching_Content_to_Improve_Information_Technology_Competencyin_Graduates","abstract":"The purpose of this study:This paper provided a summary of various previous studies on conceptual frameworks that highlighted only SIA content that needed to be developed so that graduates could provide many contributions in the company from the aspect of applying information technology according to the competencies required by the AICPA. Methodology: The approach in developing student learning content was to use concept mapping to integrate various scientific disciplines related to information technology whose development was always dynamic. Main Findings:The results of the study showed an approach to an information system learning content framework that involved computer science and accounting disciplines that were integrated and aligned with current needs based on the principle of mapping concept. Through this development framework, students were expected to be able to understand an accounting activity within the company and apply aspects of information system knowledge in financial reporting activities.","authors":["Idris Asmuni","Andala Rama","Einde Evana","Ade Widiyanti"],"meta":["February 2020Test Engineering and Management 82(1):9897-990","Projects: Accounting Information SystemsStrategic Sustainability Accounting Journal"],"references":["336981632_Supply_Chain_Strategy_and_Service_Recovery_as_an_Antecedent_of_Customer_Loyalty_for_Insurance_Company","334671178_CSR_DISCLOSURE_IMPACT_ON_CORPORATE_MARKET_PERFORMANCE_OF_INDONESIA_LISTED_COMPANIES_IDX_IN_TRADE_SECTORS","227441281_Sustainable_consumption_and_the_UK's_leading_retailers","48909337_Assessment_Of_An_Accounting_Information_Systems_Curriculum_An_Analysis_Of_The_International_Federation_Of_Accountants_International_Education_Guideline_No_11","313716756_Hall_Accounting_information_systems","297676158_A_Study_Of_Curriculum_Issues_Related_To_Teaching_Accounting_Information_Systems","246916842_Names_for_Things_A_Study_of_Human_Learning","234566503_Ten_Ways_to_Integrate_Curriculum"]}