{"id":"339431214_The_Role_of_Pre-writing_Strategies_to_Enhance_the_Students'_Idea_Generating_Abilities_The_Case_of_First-Year_Computer_Science_Students_of_Haramaya_University","abstract":"This research was aimed at fostering students’ idea generating abilities via the implementation of pre-writing strategies. The study adopted an action research design. The first phase involved problem identification and causes of the problems through focus group discussion and classroom observation. After identifying the challenges, systematically planned actions were implemented for eight successive weeks. During the intervention phase, awareness was created among the students on the importance of using idea-generating strategies before starting to write a text. As a result, four idea-generating strategies were employed; brainstorming, clustering, free-writing and questioning. Finally, the results of the actions taken were evaluated via observation, questionnaire, and focus group discussion. The findings reveal that the students showed interest in using idea-generating strategies, and the strategies used helped them to come up with adequate ideas in order to develop a text. The strategy also helped them to think exhaustively about what to write and how to support their argument before starting writing the actual text. Out of the four strategies employed, brainstorming was found to be the most convenient strategy to generate ideas. The strategies used were found to prevent students from unnecessary pen pause and frequent deletion of what they produced. Therefore, it is possible to comprehend from this action research that using idea-generating strategies will ease the practice of developing a text.This research was aimed at fostering students’ idea generating abilities via the implementationof pre-writing strategies. The study adopted an action research design. The first phase involvedproblem identification and causes of the problems through focus group discussion and classroomobservation. After identifying the challenges, systematically planned actions were implementedfor eight successive weeks. During the intervention phase, awareness was created among thestudents on the importance of using idea-generating strategies before starting to write a text.As a result, four idea-generating strategies were employed; brainstorming, clustering, freewritingand questioning. Finally, the results of the actions taken were evaluated via observation,questionnaire, and focus group discussion. The findings reveal that the students showed interestin using idea-generating strategies, and the strategies used helped them to come up with adequateideas in order to develop a text. The strategy also helped them to think exhaustively about whatto write and how to support their argument before starting writing the actual text. Out of the fourstrategies employed, brainstorming was found to be the most convenient strategy to generateideas. The strategies used were found to prevent students from unnecessary pen pause andfrequent deletion of what they produced. Therefore, it is possible to comprehend from this actionresearch that using idea-generating strategies will ease the practice of developing a text.","authors":["Melkamu Alemu"],"meta":["January 2020International Journal of Education and Literacy Studies 8(1):40","DOI:10.7575/aiac.ijels.v.8n.1p.40"],"references":["234730628_Implementing_a_Strategy_Awareness_Raising_Programme_Strategy_Changes_and_Feedback","344493918_Second_Language_Writing","292472469_Pausing_and_planning_The_tempo_of_written_discourse_production","285151195_Language_by_hand_A_synthesis_of_a_decade_of_research_on_handwriting","285142045_Interpersonal_aspects_of_response_Constructing_and_interpreting_teacher_written_feedback","249252609_Training_in_brainstorming_and_developing_writing_skills","247022262_Handwriting_Issues_for_a_psychomotor_theory","241842900_Reflection_and_Cognitive_Strategy_Instruction_Modeling_Active_Learning_for_Pre-service_Teachers","241104437_A_Procedural_Approach_to_Process_Theory_of_Writing_Prewriting_Techniques","240273373_Teaching_by_Principles_An_Interactive_Approach_to_Language_Pedagogy"]}