{"id":"339439470_MULTIMOORA_Decision_Making_Algorithm_for_Expansion_of_HVDC_and_EHVAC_in_Developing_Countries_A_Case_Study","abstract":"These days, as the residents of urban areas grow, the requirement for consumption rises too. This quantity of consumption needs power generation cores with large volume utilizing that it needs to be big enough which guides technology in the direction of wholesale power transmission systems. Consequently, two kinds of power transmission systems including HVDC and EHVAC can be considered. However, since none of the aforementioned technologies has been used in developing countries, a decision should be made to present and progress any of these technologies. Applying both of these technologies concurrently would not be economic. Therefore, this paper studies deciding on the introduction and development of HVDC and EHVAC in a developing country, Iran. A decision-making development needs the principles of conflicting purposes for alternatives and the selection of the best alternative based on the needs of decision-makers. Multi-objective optimization methods may well provide a solution for this selection. To this end, measures of this selection are described in more specifics and then, MULTIMOORA, one of the recognized MCDM approaches, is used to make the ultimate result.","authors":["Ali Aranizadeh","Mehrzad Kazemi","Homayoun Berahmandpour","Mirpouya Mirmozaffari"],"meta":["February 2020","Project: Expansion of HVDC and EHVAC"],"references":["335827055_Ranking_of_Heart_Hospitals_Using_Cross-Efficiency_and_Two-stage_DEA","335597194_Wind_turbine_and_ultra-capacitor_harvested_energy_increasing_in_microgrid_using_wind_speed_forecasting","332869015_Presenting_a_Medical_Expert_System_for_Diagnosis_and_Treatment_of_Nephrolithiasis","331276522_Developing_an_expert_system_for_diagnosing_liver_diseases","329044846_Eco-Efficiency_Evaluation_in_Two-Stage_Network_Structure_Case_Study_Cement_Companies","321059443_Ranking_of_Heart_Hospitals_Using_Cross-Efficiency_and_Two-stage_DEA","320216382_A_Comparison_of_MVDR_and_LCMV_Beamformers'_Floating_Point_Implementations_on_FPGAs","283724912_Extended_MULTIMOORA_method_based_on_Shannon_entropy_weight_for_materials_selection","267828034_Robustness_of_MULTIMOORA_a_method_for_multi-objective_optimization","263240134_Robot_selection_based_on_grey-MULTIMOORA_approach"]}