{"id":"339419387_Influential_Nodes_Identification_in_Complex_Networks_via_Information_Entropy","abstract":"Identifying a set of influential nodes is an important topic in complex networks which plays a crucial role in many applications, such as market advertising, rumor controlling, and predicting valuable scientific publications. In regard to this, researchers have developed algorithms from simple degree methods to all kinds of sophisticated approaches. However, a more robust and practical algorithm is required for the task. In this paper, we propose the EnRenew algorithm aimed to identify a set of influential nodes via information entropy. Firstly, the information entropy of each node is calculated as initial spreading ability. Then, select the node with the largest information entropy and renovate its l-length reachable nodes’ spreading ability by an attenuation factor, repeat this process until specific number of influential nodes are selected. Compared with the best state-of-the-art benchmark methods, the performance of proposed algorithm improved by 21.1%, 7.0%, 30.0%, 5.0%, 2.5%, and 9.0% in final affected scale on CEnew, Email, Hamster, Router, Condmat, and Amazon network, respectively, under the Susceptible-Infected-Recovered (SIR) simulation model. The proposed algorithm measures the importance of nodes based on information entropy and selects a group of important nodes through dynamic update strategy. The impressive results on the SIR simulation model shed light on new method of node mining in complex networks for information spreading and epidemic prevention.","authors":["Chungu Guo","Liangwei Yang","Xiao Chen","Duanbing Chen"],"meta":["February 2020Entropy 22(2):242","DOI:10.3390/e22020242"],"references":["338360386_Key_Node_Ranking_in_Complex_Networks_A_Novel_Entropy_and_Mutual_Information-Based_Approach","336740742_Systematic_comparison_between_methods_for_the_detection_of_influential_spreaders_in_complex_networks","335039346_An_Algorithmic_Information_Calculus_for_Causal_Discovery_and_Reprogramming_Systems","331723930_Identifying_influential_spreaders_in_complex_networks_by_propagation_probability_dynamics","328734848_A_Study_of_Epidemic_Spreading_and_Rumor_Spreading_over_Complex_Networks","326688274_The_Scientific_Collaboration_Networks_in_University_Management_in_Brazil","344125515_Defining_and_evaluating_network_communities_based_on_ground-truth","330062529_An_efficient_algorithm_for_mining_a_set_of_influential_spreaders_in_complex_networks","328721059_Ranking_nodes_in_complex_networks_based_on_local_structure_and_improving_closeness_centrality","328397556_Thermodynamic_efficiency_of_contagions_A_statistical_mechanical_analysis_of_the_SIS_epidemic_model"]}