{"id":"339425119_A_Novel_Counterfeit_Feature_Extraction_Technique_for_Exposing_Face-Swap_Images_Based_on_Deep_Learning_and_Error_Level_Analysis","abstract":"The quality and efficiency of generating face-swap images have been markedly strengthened by deep learning. For instance, the face-swap manipulations by DeepFake are so real that it is tricky to distinguish authenticity through automatic or manual detection. To augment the efficiency of distinguishing face-swap images generated by DeepFake from real facial ones, a novel counterfeit feature extraction technique was developed based on deep learning and error level analysis (ELA). It is related to entropy and information theory such as cross-entropy loss function in the final softmax layer. The DeepFake algorithm is only able to generate limited resolutions. Therefore, this algorithm results in two different image compression ratios between the fake face area as the foreground and the original area as the background, which would leave distinctive counterfeit traces. Through the ELA method, we can detect whether there are different image compression ratios. Convolution neural network (CNN), one of the representative technologies of deep learning, can extract the counterfeit feature and detect whether images are fake. Experiments show that the training efficiency of the CNN model can be significantly improved by the ELA method. In addition, the proposed technique can accurately extract the counterfeit feature, and therefore achieves outperformance in simplicity and efficiency compared with direct detection methods. Specifically, without loss of accuracy, the amount of computation can be significantly reduced (where the required floating-point computing power is reduced by more than 90%).","authors":["Weiguo Zhang","Chenggang Zhao","Yuxing Li"],"meta":["February 2020Entropy 22(2):249","DOI:10.3390/e22020249"],"references":["332584626_Optimizing_Deep_CNN_Architectures_for_Face_Liveness_Detection","332561655_Image_forgery_detection_using_error_level_analysis_and_deep_learning","330791801_MesoNet_a_Compact_Facial_Video_Forgery_Detection_Network","319284586_Two-Stream_Neural_Networks_for_Tampered_Face_Detection","332791104_Exposing_Deep_Fakes_Using_Inconsistent_Head_Poses","330797421_In_Ictu_Oculi_Exposing_AI_Created_Fake_Videos_by_Detecting_Eye_Blinking","319770355_Generative_Adversarial_Nets","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319293038_Image_Forgery_Detection_confronts_Image_Composition","317141530_Image_Forgery_Detection_by_Semi-Automatic_Wavelet_Soft-Thresholding_with_Error_Level_Analysis"]}