{"id":"339499241_Energy_Efficient_Homogenous_Clustering_Algorithm_for_Wireless_Sensor_Networks","abstract":"Radio transmission and reception consumes a lot of energy in a wireless sensor network (WSN), which are made of low-cost, low-power, small in size, and multifunctional sensor nodes. Thus, one of the important issues in wireless sensor network is the inherent limited battery power within the sensor nodes. Therefore, battery power is crucial parameter in the algorithm design in maximizing the lifespan of sensor nodes. It is also preferable to distribute the energy dissipated throughout the wireless sensor network in order to maximize overall network performance. Much research has been done in recent years in the area of low power routing protocol, but, there are still many design options open for improvement, and for further research targeted to the specific applications, need to be done. In this paper, we propose a new approach of an energy-efficient homogeneous clustering algorithm for wireless sensor networks in which the lifespan of the network is increased by ensuring a homogeneous distribution of nodes in the clusters. In this clustering algorithm, energy efficiency is distributed and network performance is improved by selecting cluster heads on the basis of (i) the residual energy of existing cluster heads, (ii) holdback value, and (iii) nearest hop distance of the node. In the proposed clustering algorithm, the cluster members are uniformly distributed and the life of the network is further extended.","authors":["Shio Kumar Singh","M P Singh","Dharmendra Kumar Singh","Alfia Leo"],"meta":["August 2010International Journal of Wireless & Mobile Networks 2(3)","DOI:10.5121/ijwmn.2010.2304"],"references":["221241746_Exploiting_heterogeneity_in_sensor_networks","313671238_Adaptive_clustering_for_mobile_wireless_networks","292105756_Research_on_secure_routing_protocols_in_wireless_sensor_networks","242370470_Embedding_the_Internet_Wireless_integrated_network_sensors","238978595_Balakrishnan_energy-efficient_communication_protocol_for_wireless_microsensor_networks","232645795_Connectivity-Based_k-Hop_Clustering_in_Wireless_Networks_PDF","224732684_The_Architectural_Organization_of_a_Mobile_Radio_Network_via_a_Distributed_Algorithm","224071752_Energy-efficient_communication_protocol_for_wireless_sensor_networks","221459184_T_A_Distributed_Algorithm_for_Organizing_Mobile_Radio_Telecommunication_Networks","221242860_Distributed_Clustering_in_Ad-hoc_Sensor_Networks_A_Hybrid_Energy-Efficient_Approach"]}