{"id":"339555784_Learning_Fixed_Points_in_Generative_Adversarial_Networks_From_Image-to-Image_Translation_to_Disease_Detection_and_Localization","abstract":"Generative adversarial networks (GANs) have ushered in a revolution in image-to-image translation. The development and proliferation of GANs raises an interesting question: can we train a GAN to remove an object, if present, from an image while otherwise preserving the image? Specifically, can a GAN \"virtually heal\" anyone by turning his medical image, with an unknown health status (diseased or healthy), into a healthy one, so that diseased regions could be revealed by subtracting those two images? Such a task requires a GAN to identify a minimal subset of target pixels for domain translation, an ability that we call fixed-point translation, which no GAN is equipped with yet. Therefore, we propose a new GAN, called Fixed-Point GAN, trained by (1) supervising same-domain translation through a conditional identity loss, and (2) regularizing cross-domain translation through revised adversarial, domain classification, and cycle consistency loss. Based on fixed-point translation, we further derive a novel framework for disease detection and localization using only image-level annotation. Qualitative and quantitative evaluations demonstrate that the proposed method outperforms the state of the art in multi-domain image-to-image translation and that it surpasses predominant weakly-supervised localization methods in both disease detection and localization. Implementation is available at https://github.com/jlianglab/Fixed-Point-GAN.","authors":["Md Mahfuzur Rahman Siddiquee","Zongwei Zhou","Nima Tajbakhsh","Ruibin Feng"],"meta":["October 2019Proceedings / IEEE International Conference on Computer Vision. IEEE International Conference on Computer Vision 2019:191-200","DOI:10.1109/ICCV.2019.00028","Conference: 2019 IEEE/CVF International Conference on Computer Vision (ICCV)"],"references":["336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","335011353_Computer-aided_Detection_and_Visualization_of_Pulmonary_Embolism_Using_a_Novel_Compact_and_Informative_Image_Representation","330796048_f-AnoGAN_Fast_Unsupervised_Anomaly_Detection_with_Generative_Adversarial_Networks","329740200_PairedCycleGAN_Asymmetric_Style_Transfer_for_Applying_and_Removing_Makeup","327679274_Attention-Guided_Curriculum_Learning_for_Weakly_Supervised_Classification_and_Localization_of_Thoracic_Diseases_on_Chest_Radiographs","327629552_Iterative_Attention_Mining_for_Weakly_Supervised_Thoracic_Disease_Pattern_Localization_in_Chest_X-Rays_21st_International_Conference_Granada_Spain_September_16-20_2018_Proceedings_Part_II","335914406_Thoracic_Disease_Identification_and_Localization_with_Limited_Supervision","329743528_StarGAN_Unified_Generative_Adversarial_Networks_for_Multi-domain_Image-to-Image_Translation","329741521_Thoracic_Disease_Identification_and_Localization_with_Limited_Supervision","329741284_Adversarial_Complementary_Learning_for_Weakly_Supervised_Object_Localization"]}