{"id":"339598954_Gender_rank_and_social_networks_on_an_enterprise_social_media_platform","abstract":"In this paper, we harness server-side data—540,000 messages generated by 2085 users on TamTamy, an Enterprise Social Media (ESM) platform—to examine how gender and rank shaped “homophily” (the tendency to connect with similar others) and centrality in an ESM network. Drawing on the logic of “distinctiveness theory,” which argues that the numeric rarity of a category in a given setting promotes the use of that category as a basis for connecting with others, we hypothesized and found: (a) the tendency to connect with same-gender others was stronger among women than among men; (b) the tendency to connect with same-rank others was stronger among high-ranking employees than among low-ranking employees; (c) for high-ranking men, rank was more important than gender as a basis for connecting with others; and (d) for low-ranking women, gender was more important than rank as a basis for connecting with others. We also found that whereas higher ranking individuals were more likely to be in central (bridging) positions in the overall network, gender was unrelated to network centrality. Our study suggests that the affordances of ESM for open and distributed communications notwithstanding, the social networks that emerge on ESM platforms may reinforce social stratification on some dimensions while diminishing it on others.","authors":["Giorgia Di Tommaso","Gatti Mauro","Michela Iannotta","Ajay Mehra"],"meta":["July 2020Social Networks 62:58-67","DOI:10.1016/j.socnet.2020.02.007"],"references":["307958345_What'_different_about_social_media_networks_A_framework_and_research_agenda","325657676_Social_Media_and_the_Development_of_Shared_Cognition_The_Roles_of_Network_Expansion_Content_Integration_and_Triggered_Recalling","325001576_Beyond_Simple_Demographic_Effects_The_Importance_of_Relational_Demography_in_Superior-Subordinate_Dyads","325000387_At_the_Margins_A_Distinctiveness_Approach_to_the_Social_Identity_and_Social_Networks_of_Underrepresented_Groups","324996179_Men's_and_Women's_Networks_A_Study_of_Interaction_Patterns_and_Influence_In_an_Organization","323995508_Homophily_and_Individual_Performance","322349131_IT-mediated_social_interactions_and_knowledge_sharing_Role_of_competence-based_trust_and_background_heterogeneity","315344276_Social_Media_and_Their_Affordances_for_Organizing_A_Review_and_Agenda_for_Research","303008989_The_cost_of_friendship","301379789_Inferring_user_interests_in_the_Twitter_social_network"]}