{"id":"339569193_Scholarly_event_characteristics_in_four_fields_of_science_a_metrics-based_analysis","abstract":"One of the key channels of scholarly knowledge exchange are scholarly events such as conferences, workshops, symposiums, etc.; such events are especially important and popular in Computer Science, Engineering, and Natural Sciences.\nHowever, scholars encounter problems in finding relevant information about upcoming events and statistics on their historic evolution.\nIn order to obtain a better understanding of scholarly event characteristics in four fields of science, we analyzed the metadata of scholarly events of four major fields of science, namely Computer Science, Physics, Engineering, and Mathematics using Scholarly Events Quality Assessment suite, a suite of ten metrics.\nIn particular, we analyzed renowned scholarly events belonging to five sub-fields within Computer Science, namely World Wide Web, Computer Vision, Software Engineering, Data Management, as well as Security and Privacy.\nThis analysis is based on a systematic approach using descriptive statistics as well as exploratory data analysis. The findings are on the one hand interesting to observe the general evolution and success factors of scholarly events; on the other hand, they allow (prospective) event organizers, publishers, and committee members to assess the progress of their event over time and compare it to other events in the same field; and finally, they help researchers to make more informed decisions when selecting suitable venues for presenting their work.\nBased on these findings, a set of recommendations has been concluded to different stakeholders, involving event organizers, potential authors, proceedings publishers, and sponsors. Our comprehensive dataset of scholarly events of the aforementioned fields is openly available in a semantic format and maintained collaboratively at OpenResearch.org.","authors":["Said Fathalla","Sahar Vahdati","Christoph Lange","Sören Auer"],"meta":["February 2020Scientometrics 123(3)","DOI:10.1007/s11192-020-03391-y"],"references":["336594094_SEO_A_Scientific_Events_Data_Model","335711233_A_Human-Friendly_Query_Generation_Frontend_for_a_Scientific_Events_Knowledge_Graph","333366804_EVENTSKG_A_5-Star_Dataset_of_Top-Ranked_Events_in_Eight_Computer_Science_Communities","328623246_EVENTS_A_Dataset_on_the_History_of_Top-Prestigious_Events_in_Five_Computer_Science_Communities_3rd_International_Workshop_SAVE-SD_2017_Perth_Australia_April_3_2017_and_4th_International_Workshop_SAVE-","327428154_Metadata_Analysis_of_Scholarly_Events_of_Computer_Science_Physics_Engineering_and_Mathematics","326890754_EVENTSKG_A_Knowledge_Graph_Representation_for_Top-Prestigious_Computer_Science_Events_Metadata_10th_International_Conference_ICCCI_2018_Bristol_UK_September_5-7_2018_Proceedings_Part_I","319420278_Analysing_Scholarly_Communication_Metadata_of_Computer_Science_Events","319204010_Country_over-citation_ratios","317138986_OpenAIRE_LOD_Services_Scholarly_Communication_Data_as_Linked_Data","309708888_A_scientometric_analysis_of_9_ACM_SIGWEB_cooperating_conferences"]}