{"id":"339568587_Perspective_new_insights_from_loss_function_landscapes_of_neural_networks","abstract":"We investigate the structure of the loss function landscape for neural networks subject to dataset mislabelling, increased training set diversity, and reduced node connectivity, using various techniques developed for energy landscape exploration. The benchmarking models are classification problems for atomic geometry optimisation and hand-written digit prediction. We consider the effect of varying the size of the atomic configuration space used to generate initial geometries and find that the number of stationary points increases rapidly with the size of the training configuration space. We introduce a measure of node locality to limit network connectivity and perturb permutational weight symmetry, and examine how this parameter affects the resulting landscapes. We find that highly-reduced systems have low capacity and exhibit landscapes with very few minima. On the other hand, small amounts of reduced connectivity can enhance network expressibility and can yield more complex landscapes. Investigating the effect of deliberate classification errors in the training data, we find that the variance in testing AUC, computed over a sample of minima, grows significantly with the training error, providing new insight into the role of the variance-bias trade-off when training under noise. Finally, we illustrate how the number of local minima for networks with two and three hidden layers, but a comparable number of variable edge weights, increases significantly with the number of layers, and as the number of training data decreases. This work helps shed further light on neural network loss landscapes and provides guidance for future work on neural network training and optimisation.","authors":["Sathya R. Chitturi","Philipp C Verpoort","Alpha A Lee","David J. Wales"],"meta":["February 2020Machine Learning Science and Technology 1(2)","DOI:10.1088/2632-2153/ab7aef"],"references":["324663293_Exploring_Energy_Landscapes","324387070_The_Loss_Surface_of_XOR_Artificial_Neural_Networks","320288727_Geometry_Optimization_with_Machine_Trained_Topological_Atoms","318712265_Machine_learning_landscapes_and_predictions_for_patient_outcomes","318107236_Towards_Understanding_Generalization_of_Deep_Learning_Perspective_of_Loss_Landscapes","322113581_Visualizing_the_Loss_Landscape_of_Neural_Nets","320966894_Making_Deep_Neural_Networks_Robust_to_Label_Noise_A_Loss_Correction_Approach","319770355_Generative_Adversarial_Nets","319770264_Regularization_of_Neural_Networks_using_DropConnect","319770239_Identifying_and_attacking_the_saddle_point_problem_in_high-dimensional_non-convex_optimization"]}