{"id":"339504790_An_Improved_Network_Traffic_Classification_Model_Based_on_a_Support_Vector_Machine","abstract":"Network traffic classification based on machine learning is an important branch of pattern recognition in computer science. It is a key technology for dynamic intelligent network management and enhanced network controllability. However, the traffic classification methods still facing severe challenges: The optimal set of features is difficult to determine. The classification method is highly dependent on the effective characteristic combination. Meanwhile, it is also important to balance the experience risk and generalization ability of the classifier. In this paper, an improved network traffic classification model based on a support vector machine is proposed. First, a filter-wrapper hybrid feature selection method is proposed to solve the false deletion of combined features caused by a traditional feature selection method. Second, to balance the empirical risk and generalization ability of support vector machine (SVM) traffic classification model, an improved parameter optimization algorithm is proposed. The algorithm can dynamically adjust the quadratic search area, reduce the density of quadratic mesh generation, improve the search efficiency of the algorithm, and prevent the over-fitting while optimizing the parameters. The experiments show that the improved traffic classification model achieves higher classification accuracy, lower dimension and shorter elapsed time and performs significantly better than traditional SVM and the other three typical supervised ML algorithms.","authors":["Jie Cao","Da Wang","Zhaoyang Qu","Hongyu Sun"],"meta":["February 2020Symmetry 12(2):301","DOI:10.3390/sym12020301"],"references":["332665941_A_Survey_of_Techniques_for_Mobile_Service_Encrypted_Traffic_Classification_Using_Deep_Learning","328439257_Identifying_Infected_Users_via_Network_Traffic","325217580_Mobile_Encrypted_Traffic_Classification_Using_Deep_Learning","321051971_Multi-Classification_Approaches_for_Classifying_Mobile_App_Traffic","317934779_Tor_anonymous_traffic_identification_based_on_gravitational_clustering","310734438_Facial_Emotion_Recognition_Based_on_Biorthogonal_Wavelet_Entropy_Fuzzy_Support_Vector_Machine_and_Stratified_Cross_Validation","327658236_BitCoding_Network_Traffic_Classification_Through_Encoded_Bit_Level_Signatures","324637865_Intrusion_detection_system_for_wireless_mesh_network_using_multiple_support_vector_machine_classifiers_with_genetic-algorithm-based_feature_selection","314866984_Efficient_and_robust_feature_extraction_and_selection_for_traffic_classification","312479944_A_Novel_Wrapper_Approach_for_Feature_Selection_in_Object-Based_Image_Classification_Using_Polygon-Based_Cross-Validation"]}