{"id":"339570933_MRI_Cross-Modality_Image-to-Image_Translation","abstract":"We present a cross-modality generation framework that learns to generate translated modalities from given modalities in MR images. Our proposed method performs Image Modality Translation (abbreviated as IMT) by means of a deep learning model that leverages conditional generative adversarial networks (cGANs). Our framework jointly exploits the low-level features (pixel-wise information) and high-level representations (e.g. brain tumors, brain structure like gray matter, etc.) between cross modalities which are important for resolving the challenging complexity in brain structures. Our framework can serve as an auxiliary method in medical use and has great application potential. Based on our proposed framework, we first propose a method for cross-modality registration by fusing the deformation fields to adopt the cross-modality information from translated modalities. Second, we propose an approach for MRI segmentation, translated multichannel segmentation (TMS), where given modalities, along with translated modalities, are segmented by fully convolutional networks (FCN) in a multichannel manner. Both of these two methods successfully adopt the cross-modality information to improve the performance without adding any extra data. Experiments demonstrate that our proposed framework advances the state-of-the-art on five brain MRI datasets. We also observe encouraging results in cross-modality registration and segmentation on some widely adopted brain datasets. Overall, our work can serve as an auxiliary method in medical use and be applied to various tasks in medical fields.","authors":["Qianye Yang","Nannan Li","Zixu Zhao","Xingyu Fan"],"meta":["February 2020Scientific Reports 10(1):3753","DOI:10.1038/s41598-020-60520-6"],"references":["326528531_Structurally-Sensitive_Multi-Scale_Deep_Neural_Network_for_Low-Dose_CT_Denoising","320966887_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","320966709_Simultaneous_Super-Resolution_and_Cross-Modality_Synthesis_of_3D_Medical_Images_Using_Weakly-Supervised_Joint_Convolutional_Sparse_Coding","331476185_Medical_Image_Synthesis_with_Context-Aware_Generative_Adversarial_Networks","327143059_Integration_of_spatial_information_in_convolutional_neural_networks_for_automatic_segmentation_of_intraoperative_transrectal_ultrasound_images","322060051_Introspective_Neural_Networks_for_Generative_Modeling","322058318_StackGAN_Text_to_Photo-Realistic_Image_Synthesis_with_Stacked_Generative_Adversarial_Networks","320968234_Joint_Sequence_Learning_and_Cross-Modality_Convolution_for_3D_Biomedical_Segmentation","319770411_Torch7_A_Matlab-like_Environment_for_Machine_Learning","319770355_Generative_Adversarial_Nets"]}