{"id":"339588579_COMPUTER_SCIENCE_TEACHERS'_READINESS_TO_DEVELOP_AND_USE_COMPUTER_DIDACTIC_GAMES_IN_EDUCATIONAL_PROCESS","abstract":"The paper reports research on computer science teachers’ readiness to develop computer didactic games and implement them into the educational process. Today’s teacher of computer science has to acquire and improve professional competencies in line with modern trends of high technological society. It is a process that we consider in the context of life-long education. The use of computer didactic games is one of the forms of innovative education, which increases the attractiveness of education, generates the development of learners’ endeavour and creativity. The authors emphasize that computer science teachers’ readiness to use computer didactic games becomes impossible without mastering the methodology of pedagogical endeavours and gaming technologies in education. By this, we mean a search for more efficient ways of achieving pedagogical goals, the ability to select computer didactic games and a search for ways of their successful realization in professional activities. Development of computer didactic games requires a computer science teacher to learn methodology and standards within this domain, and to obtain the basic knowledge of environment and skills to use in games development. Our survey revealed that the use of computer didactic games is sporadic and inadequately prioritized by the computer science teachers, who appeared to have very little knowledge in techniques aimed at their development and implementation into the educational process. The main reason is that prospective computer science teachers do not learn it sufficiently in higher educational establishments. This sphere remains underestimated by those who educate prospective computer science teachers, as well as by computer science teachers themselves. As a result, we observe a lack of knowledge in development, selection and implementation of computer didactic games. Theoretical analysis of the use of computer didactic games and their implementation into the educational process remains out of scholars’ attention, despite the issue becoming more and more attractive. The examination of computer science teachers’ readiness to develop computer didactic games and implement them into the educational process allows us to suggest ways for enhancing the level of teachers’ readiness for this training activity.","authors":["Роман Семенович Гуревич","Оксана Віталіївна Клочко","Віталій Іванович Клочко","Мар’яна Михайлівна Ковтонюк"],"meta":["February 2020Information Technologies and Learning Tools 75(1):122-137","DOI:10.33407/itlt.v75i1.3394"],"references":["308273853_MODEL_OF_AN_ELECTRONIC_EDUCATIONAL_RESOURCE_OF_NEW_GENERATION","284491180_The_educational_benefits_of_videogames","222077308_Effect_of_video_game_practice_on_spatial_skills_in_girls_and_boys","330879300_Mobile_Applications_and_Games_for_a_Digital_Educational_Program_on_Art_and_Culture_in_Secondary_School"]}