{"id":"339553952_A_comparative_study_of_the_effectiveness_of_using_popular_DNN_object_detection_algorithms_for_pith_detection_in_cross-sectional_images_of_parawood","abstract":"The location of pith in a cross-sectional surface of wood can be used to either evaluate its quality or guide the removal of soft wood from the wood stem. There have been many attempts to automate pith detection in images taken by a normal camera. The objective of this study is to comparatively study the effectiveness of two popular deep neural network (DNN) object detection algorithms for parawood pith detection in cross-sectional wood images. In the experiment, a database of 345 cross-sectional images of parawood, taken by a normal camera within a sawmill environment, was quadrupled in size via image augmentation. The images were then manually annotated to label the pith regions. The dataset was used to train two DNN object detection algorithms, an SSD (single shot detector) MobileNet and you-only-look-once (YOLO), via transfer learning. The inference results, utilizing pretrained models obtained by minimizing a loss function in both algorithms, were obtained on a separate dataset of 215 images and compared. The detection rate and average location error with respect to the ground truth were used to evaluate the effectiveness of detection. Additionally, the average distance error results were compared with the results of a state-of-the-art non-DNN algorithm. SSD MobileNet obtained the best detection rate of 87.7% with a ratio of training to test data of 80:20 and 152,000 training iterations. The average distance error of SSD MobileNet is comparable to that of YOLO and six times better than that of the non-DNN algorithm. Hence, SSD MobileNet is an effective approach to automating parawood pith detection in cross-sectional images.","authors":["Wattanapong Kurdthongmee"],"meta":["February 2020Heliyon 6(2):e03480","DOI:10.1016/j.heliyon.2020.e03480"],"references":["334357055_An_efficient_algorithm_to_estimate_the_pith_location_on_an_untreated_end_face_image_of_a_rubberwood_log_taken_with_a_normal_camera","331378400_Deep_learning_for_use_in_lumber_classification_tasks","327806032_A_Fast_Algorithm_to_Approximate_the_Pith_Location_of_Rubberwood_Timber_from_a_Normal_Camera_Image","327213269_Learning_Rotation-Invariant_and_Fisher_Discriminative_Convolutional_Neural_Networks_for_Object_Detection","311609981_RIFD-CNN_Rotation-Invariant_and_Fisher_Discriminative_Convolutional_Neural_Networks_for_Object_Detection","311609522_You_Only_Look_Once_Unified_Real-Time_Object_Detection","307870837_Learning_Rotation-Invariant_Convolutional_Neural_Networks_for_Object_Detection_in_VHR_Optical_Remote_Sensing_Images","303521174_An_Analysis_of_Deep_Neural_Network_Models_for_Practical_Applications","289757722_Investigating_the_out-of-roundness_and_pith-off-centre_in_stems_of_three_broadleaved_species_in_Hyrcanian_forests","252257700_Determining_the_average_annual_ring_width_on_the_front_side_of_lumber"]}