{"id":"339588399_VIDKRITI_CIFROVI_OSVITNI_RESURSI_U_GALUZI_IT_KILKISNIJ_ANALIZ","abstract":"Стаття описує результати кількісного аналізу відкритих освітніх ресурсів у галузі інформаційних технологій. Дослідження ґрунтується на вивченні вмісту десяти платформ, що надають доступ до відкритих ОР. Проведено аналіз та узагальнення інтернет-джерел для визначення популярності освітніх платформ та ресурсів на них. Здійснено кількісний аналіз даних для визначення відносної частки курсів галузі ІТ за різними параметрами: відносна частка курсів галузі ІТ загалом і на кожній платформі зокрема, мова викладання, кількісний вміст за тематичними напрямами. Кількісний аналіз проведено для окремих платформ, де передбачено доступ до відкритих освітніх ресурсів: Coursera, Edx, Udemy, MIT OpenCourseWare, OpenLearn, Intuit, Prometheus, UoPeople, OpenLearningInitiative, Відкритий Університет Майдану (ВУМ). Коротко описані вказані платформи та загальна характеристика їх вмісту. За аналізом назв курсів та анотацій до них визначено 10 узагальнених тематичних напрямів, які пропонуються платформами для галузі ІТ: програмування та розробка програмного забезпечення; алгоритми та структури даних; комп’ютерна безпека та мережі; комп’ютерна графіка, дизайн та візуалізація даних; Веб-дизайн та інтернет-технології; СКБД та SQL; штучний інтелект та робототехніка; блокчейн і криптографія; операційні системи. Доведено популярність курсів з програмування та розробки програмного забезпечення та курсів з комп’ютерної графіки, дизайну й візуалізації даних. Надано загальну характеристику українським платформам Prometheus і ВУМ. Сформульовано висновок про перспективність їх розвитку. Серед відомих освітніх платформ найбільш заповненими різними курсами є закордонні Coursera, EdX, MIT OpenCourseWare, OpenLean та Intuit. Очевидними є лідерські позиції ресурсу Udemy щодо кількості курсів загалом – 82943 та кількості курсів з галузі ІТ – 35727. Надано пропозиції щодо вдосконалення професійної підготовки фахівців ІТ-галузі: організацію самостійної роботи, проходження відкритих ОР як курсів підвищення кваліфікації, поширення авторських методик при розробці власних курсів та просуванні їх на відкриті платформи.","authors":["Олена Володимирівна Семеніхіна","Артем Олександрович Юрченко","Аліна Анатоліївна Сбруєва","Анатолій Іванович Кузьмінський"],"meta":["February 2020Information Technologies and Learning Tools 75(1):331-348","DOI:10.33407/itlt.v75i1.3114"],"references":["333252378_Innovating_Practices_to_Prepare_Students_for_Graduate_School_Lessons_From_a_Social_Work_MOOC","332316355_Modeling_collective_attention_in_online_and_flexible_learning_environments","332311447_More_than_access_MOOCs_and_changes_in_Chinese_higher_education"]}