{"id":"339515957_Inverse_Square_Levy_Walks_are_not_Optimal_Search_Strategies_for_d_2","abstract":"The Lévy hypothesis states that inverse square Lévy walks are optimal search strategies because they maximize the encounter rate with sparse, randomly distributed, replenishable targets. It has served as a theoretical basis to interpret a wealth of experimental data at various scales, from molecular motors to animals looking for resources, putting forward the conclusion that many living organisms perform Lévy walks to explore space because of their optimal efficiency. Here we provide analytically the dependence on target density of the encounter rate of Lévy walks for any space dimension d; in particular, this scaling is shown to be independent of the Lévy exponent α for the biologically relevant case d≥2, which proves that the founding result of the Lévy hypothesis is incorrect. As a consequence, we show that optimizing the encounter rate with respect to α is irrelevant: it does not change the scaling with density and can lead virtually to any optimal value of α depending on system dependent modeling choices. The conclusion that observed inverse square Lévy patterns are the result of a common selection process based purely on the kinetics of the search behavior is therefore unfounded.","authors":["Nicolas Levernier","Johannes Textor","Olivier Bénichou","Raphaël Voituriez"],"meta":["February 2020Physical Review Letters 124(8)","DOI:10.1103/PhysRevLett.124.080601"],"references":["320206299_The_evolutionary_origins_of_Levy_walk_foraging","281145003_First-passage_times_in_multiscale_random_walks_The_impact_of_movement_scales_on_search_efficiency","266477669_Levy_Flights_and_Self-Similar_Exploratory_Behaviour_of_Termite_Workers_Beyond_Model_Fitting","265607562_Stochastic_Optimal_Foraging_Tuning_Intensive_and_Extensive_Dynamics_in_Random_Searches","315807065_Universal_first-passage_statistics_of_aging_processes","308184436_Foraging_success_under_uncertainty_Search_tradeoffs_and_optimal_space_use","303981131_Mean_first-passage_times_of_non-Markovian_random_walkers_in_confinement","274263049_Memoryless_self-reinforcing_directionality_in_endosomal_active_transport_within_living_cells","268068294_A_Guide_to_First_Passage_Time_Processes","267157286_L'evy_walks"]}