{"id":"339581314_Clinical_Characteristics_of_Coronavirus_Disease_2019_in_China","abstract":"Background: \nSince December 2019, when coronavirus disease 2019 (Covid-19) emerged in Wuhan city and rapidly spread throughout China, data have been needed on the clinical characteristics of the affected patients.\n\nMethods: \nWe extracted data regarding 1099 patients with laboratory-confirmed Covid-19 from 552 hospitals in 30 provinces, autonomous regions, and municipalities in China through January 29, 2020. The primary composite end point was admission to an intensive care unit (ICU), the use of mechanical ventilation, or death.\n\nResults: \nThe median age of the patients was 47 years; 41.9% of the patients were female. The primary composite end point occurred in 67 patients (6.1%), including 5.0% who were admitted to the ICU, 2.3% who underwent invasive mechanical ventilation, and 1.4% who died. Only 1.9% of the patients had a history of direct contact with wildlife. Among nonresidents of Wuhan, 72.3% had contact with residents of Wuhan, including 31.3% who had visited the city. The most common symptoms were fever (43.8% on admission and 88.7% during hospitalization) and cough (67.8%). Diarrhea was uncommon (3.8%). The median incubation period was 4 days (interquartile range, 2 to 7). On admission, ground-glass opacity was the most common radiologic finding on chest computed tomography (CT) (56.4%). No radiographic or CT abnormality was found in 157 of 877 patients (17.9%) with nonsevere disease and in 5 of 173 patients (2.9%) with severe disease. Lymphocytopenia was present in 83.2% of the patients on admission.\n\nConclusions: \nDuring the first 2 months of the current outbreak, Covid-19 spread rapidly throughout China and caused varying degrees of illness. Patients often presented without fever, and many did not have abnormal radiologic findings. (Funded by the National Health Commission of China and others.).","authors":["Wei-Jie Guan","Zheng-yi Ni","Yu Hu","Wenhua Liang"],"meta":["February 2020New England Journal of Medicine 382(18)","DOI:10.1056/NEJMoa2002032"],"references":["339112553_Clinical_Characteristics_of_138_Hospitalized_Patients_With_2019_Novel_Coronavirus-Infected_Pneumonia_in_Wuhan_China","338949183_Transmission_of_2019-nCoV_Infection_from_an_Asymptomatic_Contact_in_Germany","338904336_Early_Transmission_Dynamics_in_Wuhan_China_of_Novel_Coronavirus-Infected_Pneumonia","338816497_A_Novel_Coronavirus_from_Patients_with_Pneumonia_in_China_2019","338810430_A_familial_cluster_of_pneumonia_associated_with_the_2019_novel_coronavirus_indicating_person-to-person_transmission_a_study_of_a_family_cluster","338959825_First_Case_of_2019_Novel_Coronavirus_in_the_United_States","338958716_Nowcasting_and_forecasting_the_potential_domestic_and_international_spread_of_the_2019-nCoV_outbreak_originating_in_Wuhan_China_a_modelling_study","338933612_Genomic_characterisation_and_epidemiology_of_2019_novel_coronavirus_implications_for_virus_origins_and_receptor_binding","338931536_Epidemiological_and_clinical_characteristics_of_99_cases_of_2019_novel_coronavirus_pneumonia_in_Wuhan_China_a_descriptive_study","338879140_Importation_and_Human-to-Human_Transmission_of_a_Novel_Coronavirus_in_Vietnam"]}