{"id":"339586383_A_DDoS_Attack_Mitigation_Scheme_in_ISP_Networks_Using_Machine_Learning_Based_on_SDN","abstract":"Keeping Internet users protected from cyberattacks and other threats is one of the most prominent security challenges for network operators nowadays. Among other critical threats, distributed denial-of-service (DDoS) becomes one of the most widespread attacks in the Internet, which is very challenging to mitigate appropriately as DDoS attacks cause the system to stop working by resource exhaustion. Software-defined networking (SDN) has recently emerged as a new networking technology offering unprecedented programmability that allows network operators to configure and manage their infrastructures dynamically. The flexible processing and centralized management of the SDN controller allow flexibly deploying complex security algorithms and mitigation methods. In this paper, we propose a novel DDoS attack mitigation in SDN-based Internet Service Provider (ISP) networks for TCP-SYN and ICMP flood attacks utilizing machine learning approach, i.e., K-Nearest-Neighbor (KNN) and XGBoost. By deploying a testbed, we implement the proposed algorithms, evaluate their accuracy, and address the trade-off between the accuracy and mitigation efficiency. Through extensive experiments, the results show that the algorithms can efficiently mitigate the attack by over 98.0% while benign traffic is not affected.","authors":["Nguyen Ngoc Tuan","Pham Huy Hung","Nghia Nguyen Danh","Nguyen Van Tho"],"meta":["February 2020Electronics 9","DOI:10.3390/electronics9030413","Project: Research and Development of Traffic Monitoring and DDoS Detection System based on Sofware Defined Networking"],"references":["332666939_Lightweight_solutions_to_counter_DDoS_attacks_in_software_defined_networking","331590528_SDN-Based_Intrusion_Detection_System_for_Early_Detection_and_Mitigation_of_DDoS_Attacks","326957454_An_Approach_to_Detecting_Distributed_Denial_of_Service_Attacks_in_Software_Defined_Networks","338362258_A_Robust_TCP-SYN_Flood_Mitigation_Scheme_Using_Machine_Learning_Based_on_SDN","337337860_Software-defined_Networking-based_DDoS_Defense_Mechanisms","330953935_DDoS_Attack_Identification_and_Defense_Using_SDN_Based_on_Machine_Learning_Method","328002333_Detection_and_Defense_Algorithms_of_Different_Types_of_DDoS_Attacks","326977031_SAFETY_Early_Detection_and_Mitigation_of_TCP_SYN_Flood_Utilizing_Entropy_in_SDN","326046490_Detection_of_smurf_flooding_attacks_using_Kullback-Leibler-based_scheme","324724900_Self-organizing_map-based_approaches_in_DDoS_flooding_detection_using_SDN"]}