{"id":"339590049_Feasibility_of_controlling_COVID-19_outbreaks_by_isolation_of_cases_and_contacts","abstract":"Background\nIsolation of cases and contact tracing is used to control outbreaks of infectious diseases, and has been used for coronavirus disease 2019 (COVID-19). Whether this strategy will achieve control depends on characteristics of both the pathogen and the response. Here we use a mathematical model to assess if isolation and contact tracing are able to control onwards transmission from imported cases of COVID-19.\n\nMethods\nWe developed a stochastic transmission model, parameterised to the COVID-19 outbreak. We used the model to quantify the potential effectiveness of contact tracing and isolation of cases at controlling a severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2)-like pathogen. We considered scenarios that varied in the number of initial cases, the basic reproduction number (R0), the delay from symptom onset to isolation, the probability that contacts were traced, the proportion of transmission that occurred before symptom onset, and the proportion of subclinical infections. We assumed isolation prevented all further transmission in the model. Outbreaks were deemed controlled if transmission ended within 12 weeks or before 5000 cases in total. We measured the success of controlling outbreaks using isolation and contact tracing, and quantified the weekly maximum number of cases traced to measure feasibility of public health effort.\n\nFindings\nSimulated outbreaks starting with five initial cases, an R0 of 1·5, and 0% transmission before symptom onset could be controlled even with low contact tracing probability; however, the probability of controlling an outbreak decreased with the number of initial cases, when R0 was 2·5 or 3·5 and with more transmission before symptom onset. Across different initial numbers of cases, the majority of scenarios with an R0 of 1·5 were controllable with less than 50% of contacts successfully traced. To control the majority of outbreaks, for R0 of 2·5 more than 70% of contacts had to be traced, and for an R0 of 3·5 more than 90% of contacts had to be traced. The delay between symptom onset and isolation had the largest role in determining whether an outbreak was controllable when R0 was 1·5. For R0 values of 2·5 or 3·5, if there were 40 initial cases, contact tracing and isolation were only potentially feasible when less than 1% of transmission occurred before symptom onset.\n\nInterpretation\nIn most scenarios, highly effective contact tracing and case isolation is enough to control a new outbreak of COVID-19 within 3 months. The probability of control decreases with long delays from symptom onset to isolation, fewer cases ascertained by contact tracing, and increasing transmission before symptoms. This model can be modified to reflect updated transmission characteristics and more specific definitions of outbreak control to assess the potential success of local response efforts.\n\nFunding\nWellcome Trust, Global Challenges Research Fund, and Health Data Research UK.","authors":["Joel Hellewell","Sam Abbott","Amy Gimma","Nikos I Bosse"],"meta":["February 2020The Lancet Global Health 8(4)","DOI:10.1016/S2214-109X(20)30074-7"],"references":["339087690_Incubation_period_of_2019_novel_coronavirus_2019-nCoV_infections_among_travellers_from_Wuhan_China_20-28_January_2020","339082563_Effectiveness_of_airport_screening_at_detecting_travellers_infected_with_novel_coronavirus_2019-nCoV","339008010_The_transmissibility_of_novel_Coronavirus_in_the_early_stages_of_the_2019-20_outbreak_in_Wuhan_Exploring_initial_point-source_exposure_sizes_and_durations_using_scenario_analysis","338932518_Pattern_of_early_human-to-human_transmission_of_Wuhan_2019_novel_coronavirus_2019-nCoV_December_2019_to_January_2020","338926289_Preliminary_estimation_of_the_basic_reproduction_number_of_novel_coronavirus_2019-nCoV_in_China_from_2019_to_2020_A_data-driven_analysis_in_the_early_phase_of_the_outbreak","338904336_Early_Transmission_Dynamics_in_Wuhan_China_of_Novel_Coronavirus-Infected_Pneumonia","338879614_The_incubation_period_of_2019-nCoV_infections_among_travellers_from_Wuhan_China","339363661_A_Familial_Cluster_of_Infection_Associated_With_the_2019_Novel_Coronavirus_Indicating_Possible_Person-to-Person_Transmission_During_the_Incubation_Period","339242944_COVID-19_what_is_next_for_public_health","338882457_Early_Transmissibility_Assessment_of_a_Novel_Coronavirus_in_Wuhan_China"]}