{"id":"339539070_Quanvolutional_neural_networks_powering_image_recognition_with_quantum_circuits","abstract":"Convolutional neural networks (CNNs) have rapidly risen in popularity for many machine learning applications, particularly in the field of image recognition. Much of the benefit generated from these networks comes from their ability to extract features from the data in a hierarchical manner. These features are extracted using various transformational layers, notably the convolutional layer which gives the model its name. In this work, we introduce a new type of transformational layer called a quantum convolution, or quanvolutional layer. Quanvolutional layers operate on input data by locally transforming the data using a number of random quantum circuits, in a way that is similar to the transformations performed by random convolutional filter layers. Provided these quantum transformations produce meaningful features for classification purposes, then this algorithm could be of practical use for near-term quantum computers as it requires small quantum circuits with little to no error correction. In this work, we empirically evaluated the potential benefit of these quantum transformations by comparing three types of models built on the MNIST dataset: CNNs, quantum convolutional neural networks (QNNs), and CNNs with additional non-linearities introduced. Our results showed that the QNN models had both higher test set accuracy as well as faster training compared with the purely classical CNNs.","authors":["Maxwell Philip Henderson","Samriddhi Shakya","Shashindra Pradhan","Tristan Cook"],"meta":["February 2020Quantum Machine Intelligence 2(1):1-9","DOI:10.1007/s42484-020-00012-y"],"references":["331719791_Supervised_learning_with_quantum-enhanced_feature_spaces","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","321416021_Quantum-Assisted_Learning_of_Hardware-Embedded_Probabilistic_Graphical_Models","319415972_Opportunities_and_challenges_for_quantum-assisted_machine_learning_in_near-term_quantum_computers","318721159_Quantum_machine_learning_A_classical_perspective","311067084_Quantum_Machine_Learning","331947994_Evaluating_analytic_gradients_on_quantum_hardware","323562671_Machine_learning_artificial_intelligence_in_the_quantum_domain_A_review_of_recent_progress","323549997_Quantum_Circuit_Learning","320627198_Dynamic_Routing_Between_Capsules","308391942_Quantum-Enhanced_Machine_Learning","305780465_Characterizing_Quantum_Supremacy_in_Near-Term_Devices","283117837_Application_of_Quantum_Annealing_to_Training_of_Deep_Neural_Networks","301845426_Harnessing_disordered_quantum_dynamics_for_machine_learning","277614392_Read_the_fine_print"]}