{"id":"339546487_Size_and_Shape_Constraints_of_486958_Arrokoth_from_Stellar_Occultations","abstract":"We present the results from four stellar occultations by (486958) Arrokoth, the flyby target of the New Horizons extended mission. Three of the four efforts led to positive detections of the body, and all constrained the presence of rings and other debris, finding none. Twenty-five mobile stations were deployed for 2017 June 3 and augmented by fixed telescopes. There were no positive detections from this effort. The event on 2017 July 10 was observed by SOFIA with one very short chord. Twenty-four deployed stations on 2017 July 17 resulted in five chords that clearly showed a complicated shape consistent with a contact binary with rough dimensions of 20 by 30 km for the overall outline. A visible albedo of 10% was derived from these data. Twenty-two systems were deployed for the fourth event on 2018 Aug 4 and resulted in two chords. The combination of the occultation data and the flyby results provides a significant refinement of the rotation period, now estimated to be 15.9380±0.0005 hours. The occultation data also provided high-precision astrometric constraints on the position of the object that were crucial for supporting the navigation for the New Horizons flyby. This work demonstrates an effective method for obtaining detailed size and shape information and probing for rings and dust on distant Kuiper Belt objects as well as being an important source of positional data that can aid in spacecraft navigation that is particularly useful for small and distant bodies.","authors":["Marc W. Buie","Simon B. Porter","Peter Tamblyn","Dirk Terrell"],"meta":["February 2020The Astronomical Journal 159(4):130","DOI:10.3847/1538-3881/ab6ced","Projects: New HorizonsGeophysics"],"references":["330758742_The_HST_lightcurve_of_486958_2014_MU69","326018112_Non-gravitational_acceleration_in_the_trajectory_of_1I2017_U1_'Oumuamua","325051044_The_New_Horizons_Kuiper_Belt_Extended_Mission","324757615_Gaia_Data_Release_2_The_astrometric_solution","324756243_Gaia_Data_Release_2_Summary_of_the_contents_and_survey_properties","315822865_All_planetesimals_born_near_the_Kuiper_Belt_formed_as_binaries","338018908_Initial_results_from_the_New_Horizons_exploration_of_2014_MU69_a_small_Kuiper_Belt_object","329439190_Limits_on_a_Ring_System_at_2014_MU69_from_Recent_Stellar_Occultations","326234040_The_SOFIA_Focal_Plane_Imager_A_Highly_Sensitive_and_Fast_Photometer_for_the_Wavelength_Range_04_to_1_Micron","325887481_High-precision_Orbit_Fitting_and_Uncertainty_Analysis_of_486958_2014_MU69"]}