{"id":"339698305_Developing_computational_thinking_with_a_module_of_solved_problems","abstract":"Computational thinking (CT) has been recognized as a collection of understandings and skills required for new generations of students not only proficient at using tools, but also at creating them and understanding the implication of their capabilities and limitations.The objective of this research was to develop a module of solved problems for the development of CT in first‐year computer engineering students at the University of Cienfuegos, Cuba. Students depend on current research to understand the definition, function, and culture of CT and to consider how it can improve their analytical and critical skills. A contextualized definition of the CT method is proposed as a cognitive process executed by humans to solve problems using computational concepts. This method improves CT in terms of decomposition, pattern recognition, algorithm design, abstraction, data representation, problem decomposition, algorithmic thinking, and generalization of patterns, simulation and evaluation. The research carried out is an experimental design with a pretest and a posttest, with a control group and an experimental group to which the intervention was applied, both with 18 students. This article describes a study developing and incorporating CT modules and assessing their effect on the comprehension of CT principles by preservation teachers as well as their computing attitude. The results show that the implementation of analytical thought in education courses will successfully affect the comprehension of CT principles by preservice students.","authors":["Yailem Arencibia Rodríguez del Rey","Isabel Nissandra Cawanga Cambinda","Claudia Deco","Cristina Bender"],"meta":["March 2020Computer Applications in Engineering Education 29(6)","DOI:10.1002/cae.22214"],"references":["291366551_Pensamiento_Computacional_a_traves_de_la_Programacion_Paradigma_de_Aprendizaje","282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","274309848_Computational_Thinking","258134754_Computational_Thinking_in_K-12_A_Review_of_the_State_of_the_Field","258123665_Integrating_computational_thinking_with_K-12_science_education_using_agent-based_computation_A_theoretical_framework","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","234810765_Computational_thinking_for_youth_in_practice","328972519_Approaches_of_Learning_and_Computational_Thinking_in_Students_that_get_into_the_Computer_Sciences_Career","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","317439471_METODOLOGIA_PARA_DESARROLLAR_UN_SISTEMA_TUTOR_INTELIGENTE_BASADO_EN_LA_WEB_PARA_ESTUDIANTES_DE_INGENIERIA"]}