{"id":"339682628_Evolutionary_Game_Simulation_of_Knowledge_Transfer_in_Industry-University-Research_Cooperative_Innovation_Network_under_Different_Network_Scales","abstract":"This paper takes the industry-university-research cooperation innovation network constructed by the weighted evolutionary BBV model as the research object, which is based on bipartite graph and evolutionary game theory, and constructing the game model of knowledge transfer in the industry-university-research cooperation innovation network, by using the simulation analysis method and analyzing the evolution law of knowledge transfer in the industry-university-research cooperation innovation network under different network scales, three scenarios, the knowledge transfer coefficient and the knowledge reorganization coefficient. The results show that the increase of network scale reduces the speed of knowledge transfer in the network, and the greater the average cooperation intensity of the nodes, the higher the evolution depth of knowledge transfer. Compared with university-research institutes, the evolution depth of knowledge transfer in enterprises is higher, and with the increase of network scale, the gap between the evolution depth of knowledge transfer between them is gradually increasing. Only when reward, punishment and synergistic innovation benefits are higher than the cost of knowledge transfer that can promote the benign evolution of industry-university-research cooperation innovation networks. Only when the knowledge transfer coefficient and the knowledge reorganization coefficient exceed a certain threshold will knowledge transfer behavior emerge in the network. With the increase of the knowledge transfer coefficient and the knowledge reorganization coefficient, the knowledge transfer evolutionary depth of the average cooperation intensity of all kinds of nodes is gradually deepening.","authors":["Xia Cao","Chuanyun Li"],"meta":["March 2020Scientific Reports 10(1):4027","DOI:10.1038/s41598-020-60974-8"],"references":["337296996_Evolutionary_stable_strategies_for_business_innovation_and_knowledge_transfer","330672289_Coevolution_spreading_in_complex_networks","326656335_Exploiting_a_cognitive_bias_promotes_cooperation_in_social_dilemma_experiments","325256573_Evolutionary_games_on_multilayer_networks_A_colloquium","321305322_The_coevolution_of_endogenous_knowledge_networks_and_knowledge_creation","319555447_Knowledge_diffusion_of_dynamical_network_in_terms_of_interaction_frequency","317062237_Statistical_physics_of_human_cooperation","336969769_Knowledge_growth_in_university-industry_innovation_networks_-_Results_from_a_simulation_study","334837851_How_to_facilitate_knowledge_diffusion_in_complex_networks_The_roles_of_network_structure_knowledge_role_distribution_and_selection_rule","332176886_A_friendship-based_altruistic_incentive_knowledge_diffusion_model_in_social_networks"]}