{"id":"339634438_Low-cost_limit_of_classical_communication_with_restricted_quantum_measurements","abstract":"We consider a communication scenario where classical information is encoded in an ensemble of quantum states that admit a power series expansion in a cost parameter and converge to a single zero cost state with vanishing cost. For a given measurement scheme, we derive an approximate expression for mutual information in the leading order of the cost parameter. The general results are applied to selected problems in optical communication, where coherent states of light are used as input symbols and the cost is quantified as the average number of photons per symbol. We show that for an arbitrary individual measurement on phase shift keyed (PSK) symbols, the photon information efficiency is upper bounded by 2 nats of information per photon in the low-cost limit, which coincides with the conventional homodyne detection bound. The presented low-cost approximation facilitates a systematic analysis of few-symbol measurements that exhibit superadditivity of accessible information. For the binary PSK alphabet of coherent states, we present designs for two- and three-symbol measurement schemes based on linear optics, homodyning, and single photon detection that offer respectively 2.49% and 3.40% enhancement relative to individual measurements. We also show how designs for scalable superadditive measurement schemes emerge from the introduced low-cost formalism.","authors":["Ludwig Kunz","Marcin Jarzyna","Wojciech Zwolinski","Konrad Banaszek"],"meta":["March 2020New Journal of Physics 22(4)","DOI:10.1088/1367-2630/ab7bd3"],"references":["339249001_Quantum_Limits_in_Optical_Communications","334801230_Optimized_communication_strategies_with_binary_coherent_states_over_phase_noise_channels","331509829_Approaching_the_ultimate_capacity_limit_in_deep-space_optical_communication","320427792_Multi-state_discrimination_below_the_quantum_noise_limit_at_the_single-photon_level","320371146_Near_optimal_discrimination_of_binary_coherent_signals_via_atom-light_interaction","341245729_Experimental_Demonstration_of_a_Quantum_Receiver_Beating_the_Standard_Quantum_Limit_at_Telecom_Wavelength","331897683_Lightwave_Communications","326364665_Robust_Measurement_for_the_Discrimination_of_Binary_Coherent_States","325071877_Structured_optical_receivers_for_efficient_deep-space_communication","323127851_Implementation_of_a_single-shot_receiver_for_quaternary_phase-shift_keyed_coherent_states"]}