{"id":"339659959_Sparse_Epistatic_Patterns_in_the_Evolution_of_Terpene_Synthases","abstract":"We explore sequence determinants of enzyme activity and specificity in a major enzyme family of terpene synthases. Most enzymes in this family catalyze reactions that produce cyclic terpenes - complex hydrocarbons widely used by plants and insects in diverse biological processes such as defense, communication, and symbiosis. To analyze the molecular mechanisms of emergence of terpene cyclization, we have carried out in-depth examination of mutational space around (E)-β-farnesene synthase, an Artemisia annua enzyme which catalyzes production of a linear hydrocarbon chain. Each mutant enzyme in our synthetic libraries was characterized biochemically and the resulting reaction rate data was used as input to the Michaelis-Menten model of enzyme kinetics, in which free energies were represented as sums of one-amino-acid contributions and two-amino-acid couplings. Our model predicts measured reaction rates with high accuracy and yields free energy landscapes characterized by relatively few coupling terms. As a result, the Michaelis-Menten free energy landscapes have simple, interpretable structure and exhibit little epistasis. We have also developed biophysical fitness models based on the assumption that highly fit enzymes have evolved to maximize the output of correct products, such as cyclic products or a specific product of interest, while minimizing the output of byproducts. This approach results in non-linear fitness landscapes that are considerably more epistatic. Overall, our experimental and computational framework provides focused characterization of evolutionary emergence of novel enzymatic functions in the context of micro-evolutionary exploration of sequence space around naturally occurring enzymes.","authors":["Aditya Ballal","Caroline Laurendon","Melissa Salmon","Maria Vardakou"],"meta":["March 2020Molecular Biology and Evolution 37(1)","DOI:10.1093/molbev/msaa052"],"references":["337099582_Secondary_environmental_variation_creates_a_shifting_evolutionary_watershed_for_the_methyl-_parathion_hydrolase_enzyme","336703780_Higher-order_epistasis_shapes_the_fitness_landscape_of_a_xenobiotic-degrading_enzyme","335848761_Learning_the_pattern_of_epistasis_linking_genotype_and_phenotype_in_a_protein","334172793_Interactive_Tree_Of_Life_iTOL_v4_recent_updates_and_new_developments","334140830_High-Order_Epistasis_in_Catalytic_Power_of_Dihydrofolate_Reductase_Gives_Rise_to_a_Rugged_Fitness_Landscape_in_the_Presence_of_Trimethoprim_Selection","316975012_High-order_epistasis_shapes_evolutionary_trajectories","312547429_Detecting_High-Order_Epistasis_in_Nonlinear_Genotype-Phenotype_Maps","330099557_Epistasis_in_a_Fitness_Landscape_Defined_by_Antibody-Antigen_Binding_Free_Energy","316470722_Biological_Physics_Energy_Information_Life","309626695_Bridging_the_physical_scales_in_evolutionary_biology_from_protein_sequence_space_to_fitness_of_organisms_and_populations"]}