{"id":"339600670_Adaptive_ANN_based_differential_protective_relay_for_reliable_power_transformer_protection_operation_during_energisation","abstract":"Power transformer is the most expensive equipment in electrical power system that needs continuous monitoring and fast protection response. Differential relay is usually used in power transformer protection scheme. This protection compares the difference of currents between transformer primary and secondary sides, with which a tripping signal to the circuit breaker is asserted. However, when power transformers are energized, the magnetizing inrush current is present and due to its high magnitude, the relay mal-operates. To prevent mal-operation, methods revolving around the fact that the relay should be able to discriminate between the magnetizing inrush current and the fault current must be studied. This paper presents an Artificial Neural Network(ANN) based differential relay that is designed to enable the differential relay to correct its mal-operation during energization by training the ANN and testing it with harmonic current as the restraining element. The MATLAB software is used to implement and evaluate the proposed differential relay. It is shown that the ANN based differential relay is indeed an adaptive relay when it is appropriately trained using the Network Fitting Tool. The improved differential relay models also include a reset part which enables automatic reset of the relays. Using the techniques of 2nd harmonic restraint and ANN to design a differential relay thus illustrates that the latter can successfully differentiate between magnetizing inrush and internal fault currents. With the new adaptive ANN-based differential relay, there is no mal-operation of the relay during energization. The ANN based differential relay shows better performance in terms of its ability to differentiate fault against energization current. Amazingly, the response time, when there is an internal fault, is 1 ms compared to 4.5 ms of the conventional 2nd harmonic restraint based relay.","authors":["Azniza Ahmad","Mohammad Lutfi Othman","Kurreemun Khudsiya Bibi Zainab","Hashim Hizam"],"meta":["December 2019","DOI:10.11591/ijai.v8.i4.pp307-316"],"references":["338190978_Fault_detection_and_classification_in_wind_turbine_by_using_artificial_neural_network","331148444_Prediction_of_overcurrent_rRelay_miscoordination_time_using_artificial_neural_network","301684392_Adaptive_CWT-based_transmission_line_differential_protection_scheme_considering_cross-country_faults_and_CT_saturation","262603651_Modeling_and_simulation_of_the_industrial_numerical_distance_relay_aimed_at_knowledge_discovery_in_resident_event_reporting","325152383_Wavelet-Packet-Transform_Based_Differential_Protection_of_Power_Transformer","316210148_Power_Differential_Method_for_Discrimination_between_Fault_and_Magnetizing_Inrush_Current_in_Transformers","316019216_A_GDSC-Based_Technique_to_Distinguish_Transformer_Magnetizing_From_Fault_Currents","293640272_Fault_discrimination_scheme_for_power_transformer_using_random_forest_technique","290245834_Differential_protection_of_a_power_transformer_using_ANNs","287440297_Digital_differential_relay_reliability_enhancement_of_power_transformer"]}