{"id":"339672627_Optimization_Method_for_Forecasting_Confirmed_Cases_of_COVID-19_in_China","abstract":"In December 2019, a novel coronavirus, called COVID-19, was discovered in Wuhan, China, and has spread to different cities in China as well as to 24 other countries. The number of confirmed cases is increasing daily and reached 34,598 on 8 February 2020. In the current study, we present a new forecasting model to estimate and forecast the number of confirmed cases of COVID-19 in the upcoming ten days based on the previously confirmed cases recorded in China. The proposed model is an improved adaptive neuro-fuzzy inference system (ANFIS) using an enhanced flower pollination algorithm (FPA) by using the salp swarm algorithm (SSA). In general, SSA is employed to improve FPA to avoid its drawbacks (i.e., getting trapped at the local optima). The main idea of the proposed model, called FPASSA-ANFIS, is to improve the performance of ANFIS by determining the parameters of ANFIS using FPASSA. The FPASSA-ANFIS model is evaluated using the World Health Organization (WHO) official data of the outbreak of the COVID-19 to forecast the confirmed cases of the upcoming ten days. More so, the FPASSA-ANFIS model is compared to several existing models, and it showed better performance in terms of Mean Absolute Percentage Error (MAPE), Root Mean Squared Relative Error (RMSRE), Root Mean Squared Relative Error (RMSRE), coefficient of determination ( R 2 ), and computing time. Furthermore, we tested the proposed model using two different datasets of weekly influenza confirmed cases in two countries, namely the USA and China. The outcomes also showed good performances.","authors":["Mohammed A. A. Al-qaness","Ahmed Abd ElGhany Ewees","Hong Fan","Mohamed Elsayed Abd Elaziz"],"meta":["March 2020Journal of Clinical Medicine 9(3):674","DOI:10.3390/jcm9030674"],"references":["339343754_2019_Novel_coronavirus_where_we_are_and_what_we_know","339285390_Real-Time_Estimation_of_the_Risk_of_Death_from_Novel_Coronavirus_COVID-19_Infection_Inference_Using_Exported_Cases","339187546_Novel_Coronavirus_Outbreak_in_Wuhan_China_2020_Intense_Surveillance_Is_Vital_for_Preventing_Sustained_Transmission_in_New_Locations","339137601_Clinical_characteristics_of_2019_novel_coronavirus_infection_in_China","339116866_Estimation_of_the_Transmission_Risk_of_the_2019-nCoV_and_Its_Implication_for_Public_Health_Interventions","339031160_The_Rate_of_Underascertainment_of_Novel_Coronavirus_2019-nCoV_Infection_Estimation_Using_Japanese_Passengers_Data_on_Evacuation_Flights","338994737_Estimating_the_Unreported_Number_of_Novel_Coronavirus_2019-nCoV_Cases_in_China_in_the_First_Half_of_January_2020_A_Data-Driven_Modelling_Analysis_of_the_Early_Outbreak","347544345_An_Improved_Flower_Pollination_Algorithm_for_Global_Numerical_Optimization","345428550_Application_of_flower_pollination_algorithm_for_enhanced_proton_exchange_membrane_fuel_cell_modelling","344742606_An_Improved_Flower_Pollination_Algorithm_for_Optimizing_Layouts_of_Nodes_in_Wireless_Sensor_Network"]}