{"id":"339683749_Effect_of_Molybdenum_and_Cooling_Regime_on_Microstructural_Heterogeneity_in_Bainitic_Steel_Wires","abstract":"Hot‐rolled wire is often further processed into complex components and therefore has to meet high demands on mechanical properties. Above all, during wire production, close control of the cooling parameters after hot rolling is required if strength and toughness must be set within narrow limits. Parameter studies were carried out in laboratory investigations to adjust bainitic microstructures, that consist of bainitic ferrite as primary phase, while retained austenite films and martensite‐austenite (M‐A) constituents represent the secondary phase. Hot deformation trials with subsequent continuous cooling are carried out in a thermomechanical treatment simulator using two microalloyed steels with 0.25% C, 2% Mn, 0.03% Nb, 0.03% Ti with or without Mo. The cooling parameters are set according to the process window of the cooling conveyor at the wire rod rolling mill. The microstructural analysis shows inhomogeneities in the appearance of the secondary phase depending on the cooling schedule. A quantitative analysis of the microstructural constituents indicates that the distribution function of morphological characteristics of the M‐A constituents corresponds to the mechanical properties. Therefore, cooling cycle and chemical composition has to be adjusted precisely in order to adjust the bainitic microstructure and to achieve the desired mechanical properties. This article is protected by copyright. All rights reserved.","authors":["Marc Ackermann","Bernard Resiak","Pascal Buessler","Bertrand Michaut"],"meta":["March 2020Steel Research International 91(11)","DOI:10.1002/srin.201900663"],"references":["301241560_Morphology_change_of_retained_austenite_during_austempering_of_carbide-free_bainitic_steel","250345142_Cr_Influence_on_Steel_Microstructure_and_Kinetics_of_Austenite_Decomposition_at_Near-Bay_Temperatures","250160435_Determination_of_Ms_Temperature_in_Steels_A_Bayesian_Neural_Network_Model","248296874_Role_of_molybdenum_in_acicular_ferrite_formation_under_continuous_cooling_in_a_medium_carbon_microalloyed_forging_steel","285747177_Current_Opinion_in_Solid_State_and_Material","276916045_Influence_of_Martensite-Austenite_constituents_formed_at_different_intercritical_temperatures_on_toughness","257677610_New_bainitic_steels_for_forgings","257086442_Design_of_cold_rolled_and_continuous_annealed_carbide-free_bainitic_steels_for_automotive_application","251608500_Effect_of_B_and_B_Nb_on_the_bainitic_transformation_in_low_carbon_steels","250157779_Effects_of_Silicon_and_Manganese_Addition_on_Mechanical_Properties_of_High-strength_Hot-rolled_Sheet_Steel_Containing_Retained_Austenite"]}