{"id":"339665439_Operational_control_over_the_financial_stability_of_banking","abstract":"Maintaining proper financial stability of each banking institution is one of the main tasks facing the banking system of Ukraine. This enables operational control over the financial strength of banking activities.The purpose of the article is to develop recommendations on the operational control of financial stability of banking and to test them using banking institutions in Ukraine as an example.To execute operational control over the financial stability of banking, economic standards of banking regulation are grouped under the “at least” or “not exceeding” principle. To determine their change over time, Shewhart control charts are proposed.The recommendations were tested through the example of the Ukrainian banking institutions (with state, foreign and private capital). It was found out that in 2017–2019, the following three economic standards of banking regulations were not met: regulatory capital adequacy, high credit risk, and average investments; besides, there were two standards at the limit of control value: the ratio of regulatory capital to total assets and the maximum amount of credit risk per counterparty.To improve the financial status of banking institutions, it is recommended to take organizational and financial measures to change the average value of the relevant economic standards for banking regulation to a level that ensures financial stability.","authors":["Angela Kuznetsova","Borys Samorodov","Galyna Azarenkova","Kateryna Oryekhova"],"meta":["March 2020Banks and Bank Systems 15(1):51-58","DOI:10.21511/bbs.15(1).2020.06"],"references":["337134450_THEORETICAL_ASPECTS_OF_THE_STABILITY_OF_THE_BANKING_SYSTEM_FROM_THE_POSITION_OF_SYSTEM_AND_SYNERGETIC_APPROACHES","337128510_ASSESSMENT_OF_CAPITAL_CONCENTRATION_IMPACT_ON_THE_BANKING_SYSTEM_EFFICIENCY_UNDER_MODERN_TRANSFORMATION","337122193_HOW_TO_INCREASE_PUBLIC_CONFIDENCE_IN_UNDERSTANDING_AND_USE_OF_THE_BANKING_SYSTEM_MARKETING_MODEL_'NETS_FOR_TRUST'","318832214_European_Union_Bank_Resolution_Framework_can_the_objective_of_financial_stability_ensure_consistency_in_resolution_authorities'_decisions","275675007_Development_of_a_Methodology_of_Evaluation_of_Financial_Stability_of_Commercial_Banks","332145826_The_Conceptual_Steps_for_Determination_the_Essence_of_Concept_of_Bank_Financial_Stability","243684572_Economic_Control_of_Quality_of_Manufactured_Product"]}