{"id":"339654753_Framework_for_the_Implementation_of_E-Government_System_Based_on_Cloud_Computing_for_Malaysian_Public_Sector","abstract":"The implementation of e-government system requires the use of new technologies, methods and effective approaches. However, the development and maintenance of e-government system also requires a large allocation, not only related to the cost of hardware and software but also increase system cost, training, infrastructure needs and expansion of e-government system. In addition, the governance aspects of the implementation of e-Government in adapting the use of new technologies is given less attention. At the same time, cloud computing technology offers comprehensive utilization of resources through the Internet. Preliminary analysis shows that the concept of cloud computing is important for each government to facilitate the work, increase productivity and lead to cost savings. Therefore, this research aims to analyze and identify the key factors that contribute to the successful implementation of e-government system based on cloud computing. Literature reviews of previous studies have been conducted to obtain theoretical data, and interview techniques were used to obtain empirical data and there were seven related officers involved. In order to validate the proposed framework, expert review analysis was used. The framework combines three main factors; environment, process and product. Attributes in environment factors consist of people, law, organization and infrastructure which comprised of three deployment model of cloud computing; Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS). Meanwhile, each process factor plays an important role and it consists of four stages; Plan, Do, Check and Act (PDCA) cycle to ensure the implementation of the system is continuously and thus producing a quality system. This framework can indirectly serve as a guide to government agencies as an action plan for implementing the e-government system based on cloud computing.","authors":["Nurul Elliza Jasmin","Mohammad Khatim Hasan"],"meta":["June 2018","DOI:10.17576/apjitm-2018-0701-01"],"references":["281336943_Factors_Influencing_Cloud_Computing_Adoption_in_the_Public_Sector_An_Empirical_Analysis","277716633_Why_Cloud_-A_Review_of_Cloud_Adoption_Determinants_in_Organizations","262673596_THE_CRITICAL_SUCCESS_FACTORS_FOR_E-GOVERNMENT_IMPLEMENTATION_IN_JORDAN","221561356_KPI-Supported_PDCA_Model_for_Innovation_Policy_Management_in_Local_Government","45825704_The_Cloudy_Future_Of_Government_IT_Cloud_Computing_and_The_Public_Sector_Around_The_World","7561647_Three_Approaches_to_Qualitative_Content_Analysis","333555466_Qualitative_research_Analysis_types_and_software_tools","272531402_Cloud_Computing_in_Indian_Perspective","257013854_A_framework_for_ranking_of_cloud_computing_services","251964500_E_-_Government_implementation_strategy_Approach_for_developing_countries","235356508_Becoming_Qualitative_Researchers_An_Introduction","226881765_Cloud_computing_services_Taxonomy_and_comparison","31737393_Interaction_design_beyond_human-computer_interaction"]}