{"id":"339647126_The_impossibility_of_low-rank_representations_for_triangle-rich_complex_networks","abstract":"The study of complex networks is a significant development in modern science, and has enriched the social sciences, biology, physics, and computer science. Models and algorithms for such networks are pervasive in our society, and impact human behavior via social networks, search engines, and recommender systems, to name a few. A widely used algorithmic technique for modeling such complex networks is to construct a low-dimensional Euclidean embedding of the vertices of the network, where proximity of vertices is interpreted as the likelihood of an edge. Contrary to the common view, we argue that such graph embeddings do not capture salient properties of complex networks. The two properties we focus on are low degree and large clustering coefficients, which have been widely established to be empirically true for real-world networks. We mathematically prove that any embedding (that uses dot products to measure similarity) that can successfully create these two properties must have a rank that is nearly linear in the number of vertices. Among other implications, this establishes that popular embedding techniques such as singular value decomposition and node2vec fail to capture significant structural aspects of real-world complex networks. Furthermore, we empirically study a number of different embedding techniques based on dot product, and show that they all fail to capture the triangle structure.","authors":["C. Seshadhri","Aneesh Sharma","Andrew Stolman","Ashish Goel"],"meta":["March 2020Proceedings of the National Academy of Sciences 117(11):201911030","DOI:10.1073/pnas.1911030117"],"references":["317399572_Inductive_Representation_Learning_on_Large_Graphs","303495864_deep_neural_network_for_learning_graph_representations","273471480_LINE_Large-scale_Information_Network_Embedding","319896814_Statistical_inference_on_random_dot_product_graphs_A_survey","315695941_Community_detection_and_stochastic_block_models_recent_developments","305997704_node2vec_Scalable_Feature_Learning_for_Networks","305258694_Block_Models_and_Personalized_PageRank","283617653_Emergence_of_Scaling_in_Random_Networks","282947033_WTF_the_who_to_follow_service_at_Twitter","262318036_WTF_the_who_to_follow_service_at_Twitter"]}