{"id":"339608688_Decision_support_systems_for_agriculture_40_Survey_and_challenges","abstract":"Undoubtedly, high demands for food from the world-wide growing population are impacting the environment and putting many pressures on agricultural productivity. Agriculture 4.0, as the fourth evolution in the farming technology, puts forward four essential requirements: increasing productivity, allocating resources reasonably, adapting to climate change, and avoiding food waste. As advanced information systems and Internet technologies are adopted in Agriculture 4.0, enormous farming data, such as meteorological information, soil conditions, marketing demands, and land uses, can be collected, analyzed, and processed for assisting farmers in making appropriate decisions and obtaining higher profits. Therefore, agricultural decision support systems for Agriculture 4.0 has become a very attractive topic for the research community. The objective of this paper aims at exploring the upcoming challenges of employing agricultural decision support systems in Agriculture 4.0. Future researchers may improve the decision support systems by overcoming these detected challenges. In this paper, the systematic literature review technique is used to survey thirteen representative decision support systems, including their applications for agricultural mission planning, water resources management, climate change adaptation, and food waste control. Each decision support system is analyzed under a systematic manner. A comprehensive evaluation is conducted from the aspects of interoperability, scalability, accessibility, usability, etc. Based on the evaluation result, upcoming challenges are detected and summarized, suggesting the development trends and demonstrating potential improvements for future research.","authors":["Zhaoyu Zhai","José Fernán Martínez","Victoria Beltran","Néstor Lucas Martínez"],"meta":["March 2020Computers and Electronics in Agriculture 170:105256","DOI:10.1016/j.compag.2020.105256"],"references":["329103736_Design_and_implementation_of_a_hybrid_MLP-GSA_model_with_multi-layer_perceptron-gravitational_search_algorithm_for_monthly_lake_water_level_forecasting","327029380_Machine_Learning_in_Agriculture_A_Review","326357458_Water_Resources_and_Farmland_Management_in_the_Songhua_River_Watershed_under_Interval_and_Fuzzy_Uncertainties","345150004_Climate-Agriculture-Modeling_and_Decision_Tool_CAMDT_A_software_framework_for_climate_risk_management_in_agriculture","333995349_LCIS_DSS-An_irrigation_supporting_system_for_water_use_efficiency_improvement_in_precision_agriculture_A_maize_case_study","329885334_DOMISA_Decision_Support_System_for_Design_and_Cost_Estimation_of_Micro-Irrigation_Systems","328320591_Urbanization_rural_development_and_environmental_health_in_China","328006890_A_decision_support_tool_to_enhance_agricultural_growth_in_the_Mekrou_river_basin_West_Africa","326745515_Machine_learning_approaches_for_crop_yield_prediction_and_nitrogen_status_estimation_in_precision_agriculture_A_review","326552514_Multi-stage_committee_based_extreme_learning_machine_model_incorporating_the_influence_of_climate_parameters_and_seasonality_on_drought_forecasting"]}