{"id":"339618038_Homogeneous_and_heterogeneous_multiple_representations_in_equation-solving_problems_An_eye-tracking_study","abstract":"Multiple external representations (MERs) play an important role in the learning field of mathematics. Whereas the cognitive theory of multimedia learning and the integrative text and picture comprehension model assume that the heterogeneous combination of symbolic and analogous representations fosters learning; the design, functions, and tasks framework holds that learning benefits depend on the specific functions of MERs. The current paper describes a conceptual replication study of one of the few studies comparing single representations, heterogeneous, and homogeneous MERs in the context of mathematics learning. In a balanced incomplete block design, the participants were provided single representations (a graphic, text, or formula) or a heterogeneous (e.g., text + graphic) or homogeneous (text + formula) combination of these to solve linear system of equations problems. In accordance with previous research, performance was superior in conditions providing MERs compared to single‐representation conditions. Moreover, heterogeneous MERs led to time savings over homogeneous MERs which triggered an increase in cognitive load. Contrary to previous research, text was the least fixated representation whereas the graphical representation proved to be most beneficial. With regard to practical implications, experts should be fostered through more challenging homogeneous MERs whereas novices should be supported through the accessible graphic contained in heterogeneous MERs.","authors":["Sarah Malone","Kristin Altmeyer","Markus Vogel","Roland Brünken"],"meta":["December 2020Journal of Computer Assisted Learning","DOI:10.1111/jcal.12426"],"references":["320673674_Threats_to_the_Validity_of_Eye-Movement_Research_in_Psychology","313884057_Test-takers'_eye_movements_Effects_of_integration_aids_and_types_of_graphical_representations","313441704_GPower_317_A_flexible_statistical_power_analysis_program_for_the_social_Behavioral_and_Biomedical_sciences_Beh","310348850_Identifying_Processes_Underlying_the_Multimedia_Effect_in_Testing_An_Eye-Movement_Analysis","305433736_Memory_and_Meta-memory_Considerations_in_the_Training_of_Human_Beings","334406385_Multimedia_Effect_in_Problem_Solving_a_Meta-analysis","325846908_Multiple_symbolic_representations_The_combination_of_formula_and_text_supports_problem_solving_in_the_mathematical_field_of_propositional_logic","321321915_Text_Information_and_Spatial_Abilities_in_Learning_With_Different_Visualizations_Formats","312178136_Relation_of_Spatial_Skills_to_Calculus_Proficiency_A_Brief_Report","307957044_Learner_characteristics_and_information_processing_in_multimedia_learning_A_moderated_mediation_of_the_seductive_details_effect"]}