{"id":"339639726_Homomorphic_Encryption-Based_Robust_Reversible_Watermarking_for_3D_Model","abstract":"Robust reversible watermarking in an encrypted domain is a technique that preserves privacy and protects copyright for multimedia transmission in the cloud. In general, most models of buildings and medical organs are constructed by three-dimensional (3D) models. A 3D model shared through the internet can be easily modified by an unauthorized user, and in order to protect the security of 3D models, a robust reversible 3D models watermarking method based on homomorphic encryption is necessary. In the proposed method, a 3D model is divided into non-overlapping patches, and the vertex in each patch is encrypted by using the Paillier cryptosystem. On the cloud side, in order to utilize addition and multiplication homomorphism of the Paillier cryptosystem, three direction values of each patch are computed for constructing the corresponding histogram, which is shifted to embed watermark. For obtaining watermarking robustness, the robust interval is designed in the process of histogram shifting. The watermark can be extracted from the symmetrical direction histogram, and the original encrypted model can be restored by histogram shifting. Moreover, the process of watermark embedding and extraction are symmetric. Experimental results show that compared with the existing watermarking methods in encrypted 3D models, the quality of the decrypted model is improved. Moreover, the proposed method is robust to common attacks, such as translation, scaling, and Gaussian noise.","authors":["Li Li","Shengxian Wang","Shanqing Zhang","Ting Luo"],"meta":["March 2020Symmetry 12(3):347","DOI:10.3390/sym12030347"],"references":["326421203_Adaptive_and_Blind_Audio_Watermarking_Algorithm_Based_on_Chaotic_Encryption_in_Hybrid_Domain","325667225_Homomorphic_Encryption-Based_Reversible_Data_Hiding_for_3D_Mesh_Models","321905250_Reversible_Data_Hiding_in_Encrypted_Three-Dimensional_Mesh_Models","318200581_Reversible_Data_Hiding_in_Encrypted_Three-Dimensional_Mesh_Models","333007953_A_High-capacity_Reversible_Data_Hiding_Method_for_Homomorphic_Encrypted_Images","326393977_Robust_and_Reversible_Image_Watermarking_Algorithm_in_Homomorphic_Encrypted_Domain","319225217_Reversible_Data_Hiding_in_Homomorphic_Encrypted_Domain_By_Mirroring_Ciphertext_Group","314640063_A_New_Watermarking_Algorithm_for_Point_Model_Using_Angle_Quantization_Index_Modulation","312412898_A_robust_and_blind_3D_watermarking_algorithm_using_multiresolution_adaptive_parameterization_of_surface","307947666_A_Robust_Multibit_Multiplicative_Watermark_Decoder_Using_Vector-Based_Hidden_Markov_Model_in_Wavelet_Domain"]}