{"id":"339676278_Ahead_of_the_curve_-_Channel_pattern_formation_of_low-energy_rivers","abstract":"Many rivers have been channelized and straightened in large parts of the world in the\npast centuries. These measures were taken to drain the land, to produce hydropower, to\nenhance navigation and to reduce bank erosion. However, in the last decades, realization\nhas grown that channelization has large negative consequences: it results in loss of\necological niches, lowering of groundwater tables and high discharge peaks that may\nlead to flooding. Therefore, rivers are currently being restored, especially in Europe and\nNorth-America. One of the most used restoration measures in small, low-energy rivers\nis to re-meander the river channel pattern (Figure 1.1), often by mimicking the sinuous\npattern from before channelization based on historical maps, to restore the “natural”\nstate of the river. However, the historic river conditions that the design of re-meandering\nprojects is often based on may nowadays not be valid anymore and may be impossible\nto return to.\n\nIn this research, the focus is on small, low-energy rivers to which the restoration measures\nof re-meandering mostly applies; rivers with a specific stream power < 10 W m-2 and a\nbankfull discharge < 200 m3 s-1. More specific, the focus is on small, low-energy rivers\nthat are single-channel, single-thread, alluvial and located in a valley setting. Such\nrivers are abundantly present on the northwestern European lowland plain. Rivers with\norganic floodplains are also considered as alluvial rivers in this research.\nAlthough sinuous river patterns are created in restoration projects, it remains largely\nunknown how sinuous patterns of low-energy rivers naturally form and develop with\ntime. Many low-energy rivers do not have sufficient energy to erode their banks, and do\nnot show lateral migration. Nevertheless, much space is often reserved in river restoration\nprojects for the low-energy rivers to freely meander. Additionally, it was found that the\necological state of rivers does not improve when the geomorphological conditions are\nignored in re-meandering projects. The realization has grown that geomorphological\nstudies are needed to predict and give insight into the future channel pattern and\ndynamics, and align the ecological state with the geomorphological conditions.\nIn this doctoral thesis, I aim to understand and predict the channel pattern formation of\nlow-energy rivers to inform river managers in river restoration projects. The objectives of\nthis study are: 1) to define a typology of low-energy rivers, accounting for their channel\npattern, floodplain morphology and floodplain sediment composition, 2) to reconstruct\nthe channel pattern formation of different types of low-energy rivers and identify the\nkey forming factors of channel pattern, 3) to develop a channel pattern predictor for different types of low-energy rivers, based on parameters independent of actual channel\npattern.\n\nAn overview of the thesis structure is given in Figure 1.4. The main focus of this thesis\nis on long-term river morphological development (10^2 to 10^3 years), because I expect\nthat channel pattern changes occur relatively slowly. I studied the channel pattern\nformation of three case study rivers in The Netherlands during the Holocene. These case\nstudy rivers were selected predominantly based on their different valley fills, because\nthe floodplain sediment composition may have a large effect on the channel pattern\nformation. These rivers also vary in size and as to the composition of their valley sides\n(Table 1.1). I selected low-energy rivers in predominantly peaty (Ch. 2), heterogeneous\n(Ch. 3) and sandy (Ch. 4) valley fills. Their channel pattern was sufficiently wellpreserved\nto reconstruct its formation of each of these rivers from before regulation and/\nor channelization. I used the insights from the case studies to develop a channel pattern\nprediction tool for low-energy rivers (Ch. 5).\n\nThe first studied river (Ch. 2) is the Drentsche Aa in the northern part of The Netherlands\n(Figure 2.1), which is located in a peat-filled valley with sandy valley sides. The peat\nreaches thicknesses up to 8 m, and started growing in the end of the Late Glacial.\nPrevious studies showed that this river is laterally immobile, hence it is unknown how its\nhighly sinuous pattern formed. I performed a detailed palaeogeographic reconstruction\nusing coring, ground-penetrating radar and geochronological data from different valley\ncross-sectional research sites. Based on this reconstruction, I developed a conceptual\nmodel on how the channel pattern formed since the start of the peat growth. The present\npattern is a result of oblique aggradation, which is a combination of vertical aggradation\nand lateral displacement (Figure 2.9). During peat growth, the river tends to adhere to\nthe sandy valley side, due to its low erosion-resistance compared to the peaty valleyfill.\nThe floodplain of the river widens as a result of erosion of the valley side, and\npeat growth in the V-shaped valley. Adherence of river reaches to the valley sides, in\ncombination with floodplain widening, results in a river that is stretched out resulting\nin increased sinuosity. This stretching of the river results in a very distinctive pattern,\nwith rectangular bends and relatively straight reaches that either follow the valley sides,\nor cross the valley (Figure 2.9). This river pattern is more or less laterally stable, because\noblique aggradation is a relatively slow process, and fundamentally differs from the\nclassic meandering pattern. The typical pattern was also observed for other peatland\nrivers around the world from satellite imagery (Figure 2.10).\n\nThe second studied river (Ch. 3) is the Dommel River in the southern part of The\nNetherlands (Figure 3.2), which is located in a valley with a heterogeneous fill and relatively loamy sides. Before artificial straightening, this river had a very complex\npattern consisting of unusually sharp bends with variable size and abrupt, irregular\nchanges in channel direction (i.e. a tortuous pattern), lacking the typical smoothness\nof ideal meander curves (Figure 3.1a). Based on palaeogeographic reconstructions,\nI developed a conceptual model on how this channel pattern formed during the\nHolocene (Figure 3.12). The river is autogenically constrained within its self-formed\nheterogeneous floodplain, and develops a tortuous pattern with very limited channel\nmobility due to insufficient flow strength to erode its cohesive banks, while the river can\nerode the non-cohesive, sandy banks. This self-constraining tendency was corroborated\nby an analysis of 47 rivers from around the world, which showed that erosion-resistant\nfloodplain deposits are preserved in the river banks when the river energy is below a\ncritical threshold (Figure 3.13). Self-constraining is initiated once river energy decreases,\ne.g. due to a reduction of peak discharges with changes in land use or climate. Because of better preservation of cohesive deposits compared to non-cohesive deposits, the required energy needed to break out of the self-constraining tendency increases with time. Selfconstraining thereby enhances resistance against bank erosion, but the river is able to break out of the self-constraining trend if river energy increases to such an extent that the threshold for erosion of cohesive bank material is crossed. \n\nThe third studied river (Ch. 4) is the Overijsselse Vecht in the eastern part of The\nNetherlands (Figure 4.1), which is located in a valley with a relatively sandy fill and\nsandy sides. This river was completely channelized after 1914 AD, but well-preserved\npalaeochannels and scroll-bars are still located in the valley. Based on geochronological\ndata and a palaeogeographic reconstruction, I concluded that the river changed from\na laterally stable into a meandering river ca. 1400 to 1500 AD. I reconstructed the\nbankfull discharge as a function of time from these fluvial deposits, and showed that a\nsignificant increase of the bankfull discharge was the main cause of the channel pattern\nchange (Figures 4.9 and 4.11). This increase of bankfull discharge was likely due to the\ncombined influence of a climatic fluctuation (the Little Ice Age, 14th to 19th century),\nand peat reclamation and exploitation in the catchment.\n\nBased on the case studies, low-energy rivers can be characterised in four different types\nby their distinct channel pattern, floodplain morphology and floodplain sediment\ncomposition (Figure 6.1, Table 6.1), of which the latter two are newly defined in this\nthesis: 1) meandering rivers have relatively smooth bends, laterally migrate and develop\na scrolled floodplain. These rivers have sufficient stream power to erode the floodplain.\n2) Laterally stable rivers have an irregular sinuous pattern with straight reaches and\noccasionally sharp bends. These rivers do not laterally migrate because stream power\nis insufficient to erode the floodplain. The channel pattern results from inheritance of former channel pattern and perturbations (e.g. tree fall). 3) Self-constraining rivers have\na tortuous channel pattern and show local lateral migration with scroll-bar development.\nThese rivers have sufficient stream power to erode the non-cohesive floodplain deposits,\nbut insufficient to erode the cohesive floodplain deposits. 4) Obliquely aggrading rivers\nhave relatively rectangular bends with straight reaches in between. These rivers have\nsufficient stream power to erode the sandy valley sides, but insufficient to erode the\npeaty valley fill.\n\nBased on the river typology, it can be derived that the bank strength is a key forming\nfactor of the channel pattern of low-energy rivers. Because these rivers are on the margin\nof the river continuum in terms of stream power sufficient for bank erosion (Ch. 6),\nrelative small differences in the balance between stream power and bank strength\ndetermine the channel pattern formation and dynamics of low-energy rivers. The\nlateral stability of most low-energy rivers is enhanced by their low width-depth ratio,\nwhich is commonly below 10 and results from the high bank strength. Rivers with a\nlow width-depth ratio have an overdamped regime, meaning that when a bar forms\nin response to a local perturbation, the bar disappears within a short distance of the\nperturbation. A perturbation in one bend does not necessarily lead to a perturbation in\nthe consecutive downstream bend, therefore rivers with an overdamped regime strongly\ndiffer from meandering rivers, which have an underdamped regime. An overdamped\nregime enhances the lateral stability of the river, in addition to the bank strength that\nleads to the low width-depth ratio. Despite the overdamped regime, these rivers may still\nshow traces of lateral displacement. Local conditions of bank strength and stream power\ndetermine the rate of bank erosion and direction of channel shifts for each river bend\nin low-energy rivers, independent of the conditions at upstream or downstream bends.\n\nBased on these insights and earlier efforts by others, I developed a channel pattern\nprediction tool (Ch. 5). Hitherto, channel patterns have often been predicted using\nmorphometric parameters and parameters that depend on the actual channel pattern and\nmorphology, which invalidates the prediction. Additionally, many of these predictors\nhave low success rates in discriminating channel patterns of sand-bed rivers, because\nfloodplain properties are not included. The prediction tool that was developed in this\nresearch uses parameters independent of channel pattern and includes the floodplain\nproperties. The parameters used are median bed grain size, effective channel-forming\ndischarge, valley slope and the average silt-plus-clay fraction of the river banks (Figure\n5.6). In addition, I added an additional channel pattern class of self-constraining\nrivers with scroll bars and tortuous channel patterns, based on the Dommel River case\nstudy (Ch. 3). The overall prediction success improved compared to existing methods, especially for sand-bed rivers. This tool can be used to predict channel patterns of alluvial\nrivers and changes of channel pattern.\n\nChannel patterns of low-energy rivers may change, e.g. due to land use or climate\nchange, as illustrated in the channel pattern predictor diagram (Figures 6.3 and 6.4).\nMeandering rivers may change into laterally stable rivers when their stream power drops,\nor when they are subjected to relatively rapid overloading with cohesive sediments. They\nmay also change into self-constraining rivers when stream power slightly drops, and\ncohesive deposits are preserved in the floodplain. Then the lateral migration does not\nstop at once, but gradually decreases with time (Figure 3.12). Spatial differences in\nbank strength or stream power also explain the longitudinal variation of channel pattern\nwithin rivers.\n\nRiver restoration can benefit from the insights of this research and focus on restoring\nnatural processes of low-energy rivers in a scientifically sound way. It is expected\nthat limited river management is needed and the ecological state improves when\ngeomorphological rules are obeyed in river restoration projects. Hence, river restoration\nshould aim to restore the appropriate morphological processes, rather than to redesign\nthe channel pattern according to a historical reference. Such process-based restoration\ncan be reached by focussing on the key forming factors of channel pattern. The\ntypology of low-energy rivers and the newly developed channel pattern predictor help\nto determine whether river reaches may have the potential to meander or are likely\nto be laterally stable. In this research, I showed that the sediment composition of the\nfloodplain is key to predict the channel pattern and lateral river dynamics. Hence, the\nfloodplain composition should be considered to prevent undesirable erosion, or provoke\nbank erosion when desired. River restoration also requires an understanding of the entire\ncatchment, and should take into account future changes in climate and land use that\naffect the discharge regime to predict potential channel pattern changes. The typology\nof low-energy rivers can be used to elaborate on the potential for ecological recovery,\nbecause the river types differ in substrate, discharge regime, channel geometry, bank\ncomposition, bend sharpness, site turnover and flow patterns.","authors":["Jasper H.J. Candel"],"meta":["February 2020","DOI:10.18174/506616","Thesis for: PhD","Project: RiverCare: towards selfsustaining multifunctional rivers"],"references":["344441094_Predicting_river_channel_pattern_based_on_stream_power_bed_material_and_bank_strength","336606543_Local_Factors_Determining_Spatially_Heterogeneous_Channel_Migration_in_a_Low-Energy_Stream","331759078_Temperature_buffering_by_groundwater_in_ecologically_valuable_lowland_streams_under_current_and_future_climate_conditions","330916824_High_curvatures_drive_river_meandering","330493127_Residual_Biomass_from_Dutch_Riverine_Areas-From_Waste_to_Ecosystem_Service","349259262_Bank_Erosion_in_Soils_of_the_Lower_Mississippi_Valley","349015352_Formation_of_Flood_Plain_Lands","334639230_Interplay_between_climatic_tectonic_and_anthropogenic_forcing_in_the_Lower_Rhine_Graben_the_Roer_River","334116984_Scroll_bars_are_inner_bank_levees_along_meandering_river_bends","333318853_Low-gradient_single-threaded_rivers_prior_to_greening_of_the_continents","328084146_River_Systems_and_the_Anthropocene_A_Late_Pleistocene_and_Holocene_Timeline_for_Human_Influence","330188800_Perspectives_for_Ecological_Management_of_Regulated_Rivers","329855015_Ecology_and_fluvial_dynamics_of_an_Early_Holocene_medium-sized_European_lowland_river_valley_Upper_Scheldt_northern_Belgium","329715888_Anthropogenic_stresses_on_the_world's_big_rivers","325890081_Transient_Groundwater_Travel_Time_Distributions_and_Age-Ranked_Storage-Discharge_Relationships_of_Three_Lowland_Catchments"]}