{"id":"339669544_Learning_to_Describe_A_New_Approach_to_Computer_Vision_Based_Ancient_Coin_Analysis","abstract":"In recent years, a range of problems under the broad umbrella of computer vision based analysis of ancient coins have been attracting an increasing amount of attention. Notwithstanding this research effort, the results achieved by the state of the art in published literature remain poor and far from sufficiently well performing for any practical purpose. In the present paper we present a series of contributions which we believe will benefit the interested community. We explain that the approach of visual matching of coins, universally adopted in existing published papers on the topic, is not of practical interest because the number of ancient coin types exceeds by far the number of those types which have been imaged, be it in digital form (e.g., online) or otherwise (traditional film, in print, etc.). Rather, we argue that the focus should be on understanding the semantic content of coins. Hence, we describe a novel approach—to first extract semantic concepts from real-world multimodal input and associate them with their corresponding coin images, and then to train a convolutional neural network to learn the appearance of these concepts. On a real-world data set, we demonstrate highly promising results, correctly identifying a range of visual elements on unseen coins with up to 84% accuracy.","authors":["Jessica Cooper","Ognjen Arandjelovic"],"meta":["March 2020Sci 2(1):8","DOI:10.3390/sci2010008"],"references":["328028395_A_principled_machine_learning_framework_improves_accuracy_of_stage_II_colorectal_cancer_prognosis","323956667_Deep_Learning_using_Rectified_Linear_Units_ReLU","322647398_Ancient_Roman_Coin_Recognition_in_the_Wild_Using_Deep_Learning_Based_Recognition_of_Artistically_Depicted_Face_Profiles","315864988_Ancient_Roman_Coin_Retrieval_A_Systematic_Examination_of_the_Effects_of_Coin_Grade","280601358_BoVW_Models_for_Object_Recognition_from_Video","318332320_Towards_computer_vision_based_ancient_coin_recognition_in_the_wild_-_Automatic_reliable_image_preprocessing_and_normalization","313859179_On_Loss_Functions_for_Deep_Neural_Networks_in_Classification","312432980_A_survey_of_deep_neural_network_architectures_and_their_applications","309776688_Descriptor_transition_tables_for_object_retrieval_using_unconstrained_cluttered_video_acquired_using_a_consumer_level_handheld_mobile_device","273529115_Coarse-grained_ancient_coin_classification_using_image-based_reverse_side_motif_recognition"]}