{"id":"339622673_Factors_Influencing_Programming_Expertise_in_a_Web-based_E-learning_Paradigm","abstract":"Modern internet technologies have revolutionized the traditional education by providing flexible and resourceful e-learning opportunities in all the fields of knowledge. Programming constitutes integral part of undergraduate curriculum in computer sciences, and adequate level of programming expertise is expected from the graduates. In this paper, we explore and examine key factors that contribute to developing programming skills among undergraduate students in e-learning. These factors include teaching practices, intrinsic factors, efficacy problems, and learning intentions. We present a research model by integrating teaching practices, intrinsic factors, and efficacy problems with learning intentions of programming. This study involved responses from 460 undergraduate students. Structural Equation Modelling was applied to develop and evaluate the relationship between factors of the model. Experimental results show that teaching practices and student intrinsic motivations play a pivotal role in promoting learning intentions for programming. Further investigation reveals that learning intentions positively affect the programming expertise while the impact of efficacy problems is negative. The results proclaim that well-organized teaching practices and intrinsic factors develop learning intentions in students which overcome the efficacy problems and lead to better programming expertise. This research provides critical implications for policymakers to effectively implement computer science programs in e-learning paradigm.","authors":["Wajid Rafiq","Khalid Hussain","Khurshid Ahmad","Wanchun Dou"],"meta":["March 2020Online Learning 24(1)","DOI:10.24059/olj.v24i1.1956"],"references":["325020223_Towards_learner-constructed_e-learning_environments_for_effective_personal_learning_experiences","323344093_Secure_cloud_data_storage_approach_in_e-learning_systems","323331159_The_Importance_of_Producing_Shared_Code_Through_Pair_Programming","321346253_Students'_Attitudes_Towards_Edmodo_a_Social_Learning_Network_A_Scale_Development_Study","331469343_Teaching_to_Connect_Community-Building_Strategies_for_the_Virtual_Classroom","331467528_Self-Determination_Motivational_Profiles_of_Bachelor's_Degree_Seeking_Students_at_an_Online_For-Profit_University","331467170_Award-Winning_Faculty_Online_Teaching_Practices_Roles_and_Competencies","327324586_The_final_year_project_supervision_in_online_distance_learning_assessing_students_and_faculty_perceptions_about_communication_tools","321985430_Student_teachers'_satisfaction_for_blended_learning_via_Edmodo_learning_management_system","321810541_A_study_of_students'_progress_through_introductory_computer_science_programming_courses"]}