{"id":"339621489_Peningkatan_Keterampilan_ICT_untuk_Guru_melalui_Pelatihan_Konten_Digital_Pembelajaran_Berbasis_Sumber_Terbuka_Open_Sources","abstract":"ABSTRAK Pemanfaatan dan pengembangan konten digital adalah persyaratan yang harus terpenuhi untuk menjadi guru profesional Abad 21. Hal ini yang kemudian membuat adanya kebutuhan mendesak dikalangan guru yang sudah lama berkecimpung dalam profesi pendidikan. Berdasarkan survey yang dilakukan melalui kuesioner online (Google Form), responden (n=83) dari beberapa sekolah dan beberapa mata pelajaran mengayatakan bahwa kebutuhan keterampilan pembuatan konten digital pembelajaran merupakan prioritas utama (n=42) dan diikuti kebutuhan pembuatan online classroom and mobile learning (n=38). Artikel ini bertujuan untuk menyampaikan identifikasi masalah, analisa kurikulum, implementasi solusi, dan evaluasi hasi dari kegiatan pengabdian pada masyarakat dalam bentuk pelatihan pengembangan konten digital pembelajaran untuk guru di Kota Tangerang. Kata Kunci: konten digital; pembelajaran informatika; sumber terbuka.ABSTRACT Digital content development and utilization are considered as high requirements that must be mastered by qualified teachers in this 21st century learning. The needs eventually create gaps between prior teachers’ competencies and the requirements for further qualifications. An online survey delivered through Google form was conducted to validate this hypothesis. The survey found that respondents (n=83) who were school teachers from different learning subjects expressed that they demanded new skills on digital content development and utilization. It was considered as the highest priority (n=42) among any others skills related technology enhanced learning, such as online classroom or mobile learning (n=38). This article is aimed to describe the process of problem identification, curriculum analysis, the implementation of solution, and program evaluation of a community service activities entitled ‘Training of Digital Content Development for School Teachers’. Keywords: computer science education; digital content; open sources.","authors":["Taufik Ikhsan Slamet","Agung Alfiansyah","Wiky Fawwaz","Fathoni A Musyafa"],"meta":["January 2020AKSIOLOGIYA Jurnal Pengabdian Kepada Masyarakat 4(1):118","DOI:10.30651/aks.v4i1.2316"],"references":["251405713_In_search_of_the_elusive_ADDIE_model","220079574_Developing_and_Validating_an_Observational_Learning_Model_of_Computer_Software_Training_and_Skill_Acquisition","326844814_Double_for_Nothing_Experimental_Evidence_on_an_Unconditional_Teacher_Salary_Increase_in_Indonesia","319707857_The_Implementation_of_Ict_Based_Education_in_Elementary_Teacher_Education_PGSD_in_Indonesia","298130931_Using_instructional_design_principles_to_develop_effective_information_literacy_instruction_The_ADDIE_model","292056767_What_is_instructional_design","238208928_Coordinating_top-down_and_bottom_up_strategies_for_education_reform"]}