{"id":"339678732_Advanced_neural_network_solution_for_detection_of_lung_pathology_and_foreign_body_on_chest_plain_radiographs","abstract":"Objective: An approach was suggested to detect whether patient has any lung pathology or not. Materials and Methods: The approach was based on neural networks-aided analysis of chest X-ray frontal images. The neural network ensemble included 15 neural networks. Some of them were trained to analyze different parts of chest area, i.e, heart, diaphragm, lungs and related parts. And the other set of networks were trained to describe another meta-data of X-rays, such as patient position (laying or standing), quality of image, etc. The set of outputs of every model was aggregated with boosting model then. Result of model prediction was presented as probability of lung pathology on radiograph. Another 2 models were described in this article as parts of suggested approach. One of these model was trained to detect if there any foreign body within chest area on X-ray image or not. Another one was trained to classify which kind of foreign body was visualized (after first model gave positive prediction). To train models 9093 frontal X-ray images were used. Those images were labeled by group of radiologist. Results: The study showed that both foreign bodies detection and classification models demonstrated satisfactory results. The weak part of both models was precision for negative classes (those classes are \"non-medical artefact\" for one model and \"foreign body is not visualized\" for the other one). But it was not so critical for such kind of tasks. Conclusions: the model may be used to help a practitioner make decision whether a patient needs additional diagnostics or not.","authors":["Sergey Dydykin","Ekaterina Blinova","Dmitry Blinov"],"meta":["December 2019Imaging in Medicine 11(5):57-66"],"references":["316736470_ChestX-ray8_Hospital-scale_Chest_X-ray_Database_and_Benchmarks_on_Weakly-Supervised_Classification_and_Localization_of_Common_Thorax_Diseases","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","313818076_Missed_lung_cancer_When_where_and_why","301837242_Learning_to_Read_Chest_X-Rays_Recurrent_Neural_Cascade_Model_for_Automated_Image_Annotation","294108292_AggNet_Deep_Learning_From_Crowds_for_Mitosis_Detection_in_Breast_Cancer_Histology_Images","321455058_Bias_in_Radiology_The_How_and_Why_of_Misses_and_Misinterpretations","320727106_Learning_to_diagnose_from_scratch_by_exploiting_dependencies_among_labels","311938144_Interpretive_Error_in_Radiology","301830805_Medical_Error-the_Third_Leading_Cause_of_Death_in_the_US","288713695_A_Combined_Deep-Learning_and_Deformable-Model_Approach_to_Fully_Automatic_Segmentation_of_the_Left_Ventricle_in_Cardiac_MRI"]}