{"id":"339738610_How_Creativity_in_STEAM_Modules_Intervenes_with_Self-Efficacy_and_Motivation","abstract":"Many current curricula in going beyond traditional goals increasingly foster creativity in science classrooms, declaring creativity a core skill of the 21st century. For enhancing creativity in science classrooms, the subject Arts is considered to offer a potential way (from STEM to STEAM). The Horizont-2020 project CREATIONS prepared more than 100 creativity-enhancing STEAM modules based on the 5E instructional model. STEM subjects were mathematics, biology, physics, chemistry or technology, and often interdisciplinary for different school and class levels between the ages of 9 to 19. All modules provided a social environment fostering creativity where students imagine, explore, experiment, test, manipulate, and speculate. Exemplarily, five modules including physics, math, and biology, were selected, for monitoring motivation and creativity. The first was measured on the level of career-motivation and self-efficacy, the latter focused on two sub-constructs: active cognition such as idea processing (ACT), and a mental state of creative immersion (FLOW). Subjects were a sample of 995 students (9 - 18 years). In summary, no gender impact or age effect appeared in any of the monitored variables. Participation intervened with Self-Efficacy and ACT, while Career Motivation or FLOW did not. ACT as a cognitive variable associated with creativity might be more sensitive to changes, whereas FLOW parameter measuring a state of mind related to emotion appears more stable. Path analysis supported the role of creativity for Career-Motivation by promoting Self-Efficacy. Conclusions for appropriate educational settings to foster STEAM environments are being discussed.","authors":["Catherine Conradty","Franz X. Bogner"],"meta":["March 2020Education Sciences 10(70):15","DOI:10.3390/educsci10030070","Project: Creations"],"references":["333237232_Conceptual_Change_when_Growing_Up_Frameset_for_Role_Models","332049815_A_modeling_study_to_explain_mathematical_problem-solving_performance_through_metacognition_self-efficacy_motivation_and_anxiety","331107676_Dialogue_and_materialityembodiment_in_sciencearts_creative_pedagogy_Their_role_and_manifestation","331057219_International_educators'_perspectives_on_the_purpose_of_science_education_and_the_relationship_between_school_science_and_creativity","328362989_Altering_Perceptions_of_Scientists_among_Fifth_Graders_by_the_Introduction_of_Female_Role_Models_A_New_Opportunity_for_Dermatologists","334497382_Bridging_the_Gap_Towards_Flying_Archaeopteryx_as_a_Unique_Evolutionary_Tool_to_Inquiry-Based_Learning","333284193_From_STEM_to_STEAM_Cracking_the_Code_How_creativity_motivation_interact_with_inquiry-based_learning","328778541_Is_creativity_hands-on_modeling_and_cognitive_learning_gender-dependent","328647296_STEAM_in_Practice_and_Research_An_Integrative_Literature_Review","326510551_How_creativity_autonomy_and_visual_reasoning_contributes_to_cognitive_learning_in_a_STEAM_hands-on_inquiry-based_Math_module"]}