{"id":"339724165_Reference_publication_year_spectroscopy_RPYS_of_computer_science_papers_from_Eastern_Europe","abstract":"Purpose\nThe current article presents the results of a case study dealing with the historical roots of Eastern European researchers in computer science.\n\nDesign/methodology/approach\nThe study is based on an analysis of cited references stemming from a collection of around 80,000 computer science papers by Eastern European researchers published from 1989 to 2014. By using a method called “reference publication year spectroscopy” (RPYS) for historical analyses based on bibliometric data, we analyze around 800,000 references cited in those papers. The study identifies the peak years, including most frequently cited publications (from 1952, 1965 and 1975), and focuses on these outstanding works for the field. The research shows how these influential papers were cited in Eastern Europe and in general, and on which scientific fields they have the most impact.\n\nFindings\nA noteworthy publication that seems to have a tremendous effect on Eastern European computer science is Zadeh's “Fuzzy sets” article which appeared in Information and Control in 1965. The study demonstrates that computer scientists from Eastern Europe are more conservative in their citation behaviour and tend to refer to older and more established research than their counterparts from the West.\n\nOriginality/value\nWhich are the historical roots of researchers working in a particular field or on a specific topic? Are there certain publications – landmark papers – which are important for their research? We guess that these are questions bothering researchers in many fields.","authors":["Dalibor Fiala","Lutz Bornmann"],"meta":["March 2020Aslib Journal of Information Management 72(3)","DOI:10.1108/AJIM-06-2019-0142"],"references":["322756276_Identifying_single_influential_publications_in_a_research_field_New_analysis_opportunities_of_the_CRExplorer","320911651_Bibliometric_Analysis_of_Publications_from_Post-Soviet_Countries_in_Psychological_Journals_in_1992-2016","320101983_Computer_Science_Papers_in_Web_of_Science_A_Bibliometric_Analysis","282003672_Computer_science_in_Eastern_Europe_1989-2014_A_bibliometric_study","271659662_Publications_from_Serbia_in_the_Science_Citation_Index_Expanded_a_bibliometric_analysis","328491017_Performance_of_research_universities_in_post-communist_countries","316291748_Scientific_publication_performance_in_post-communist_countries_still_lagging_far_behind","314488214_Publish_or_perish_how_Central_and_Eastern_European_economists_have_dealt_with_the_ever-increasing_academic_publishing_requirements_2000-2015","304858145_New_features_of_CitedReferencesExplorer_CRExplorer","289587487_Introducing_CitedReferencesExplorer_CRExplorer_A_program_for_Reference_Publication_Year_Spectroscopy_with_Cited_References_Disambiguation"]}