{"id":"339762553_Genre-specific_Error_Detection_with_Multimodal_Feedback","abstract":"A purpose-built online error detection tool was developed to provide genre-specific corpus-based feedback on errors occurring in draft research articles and graduation theses. The primary envisaged users were computer science majors studying at a public university in Japan. This article discusses the development and evaluation of this interactive, multimodal tool. An in-house learner corpus of graduation theses was annotated for errors that affect the accuracy, brevity, clarity, objectivity and formality of scientific research writing. Software was developed to identify the errors discovered and provide learners with actionable advice and multimodal explanations in both English and Japanese. Qualitative evaluation received in usability studies and focus groups from both teachers and students was extremely positive. Preliminary quantitative evaluation of the effectiveness of the error detector was conducted. Through this pedagogic tool, learners can receive immediate actionable feedback on potential errors, and their teachers no longer feel obliged to check for common genre-specific errors.","authors":["Blake John"],"meta":["March 2020RELC Journal 51(3):003368821989828","DOI:10.1177/0033688219898282"],"references":["328455151_English_Curriculum_Innovation_for_Computer_Science_Majors_in_the_Japanese_EFL_Context_From_Needs_to_Tasks","292718121_Methodological_Issues_in_Genre_Analysis","285926202_Digital_literacies_and_language_learning","323631667_Student_engagement_with_teacher_and_automated_feedback_on_L2_writing","318494277_Mastering_Regular_Expressions","314733398_Failure_Mode_and_Effect_Analysis_FMEA_from_Theory_to_Execution","304860437_Multimedia_Learning_Second_Edition","273674948_LATEX_A_Document_Preparation_System_User's_Guide_and_Reference_Manual","261958821_A_model_of_factors_affecting_independent_learners'_engagement_with_feedback_on_language_learning_tasks","259142527_Written_corrective_feedback_for_individual_L2_writers"]}