{"id":"339736712_Machine_learning_for_learner_English_A_plea_for_creating_learner_data_challenges","abstract":"This paper discusses machine learning techniques for the prediction of Common European Framework of Reference (CEFR) levels in a learner corpus. We summarise the CAp 2018 Machine Learning (ML) competition, a classification task of the six CEFR levels, which map linguistic competence in a foreign language onto six reference levels. The goal of this competition was to produce a machine learning system to predict learners’ competence levels from written productions comprising between 20 and 300 words and a set of characteristics computed for each text extracted from the French component of the EFCAMDAT data ( Geertzen et al., 2013 ). Together with the description of the competition, we provide an analysis of the results and methods proposed by the participants and discuss the benefits of this kind of competition for the learner corpus research (LCR) community. The main findings address the methods used and lexical bias introduced by the task.","authors":["Nicolas Ballier","Stephane Canu","Caroline Petitjean","Gilles Gasso"],"meta":["April 2020International Journal of Learner Corpus Research 6(1)","DOI:10.1075/ijlcr.18012.bal","Project: Investigating criterial features of learner English and AI-driven automatic language level assessment"],"references":["327388959_Overview_of_the_2018_Spoken_CALL_Shared_Task","321442237_The_English_Grammar_Profile_of_learner_competence_Methodology_and_key_findings","321100657_Overview_of_the_2017_Spoken_CALL_Shared_Task","345672296_Data_Stewardship_for_Open_Science_Implementing_FAIR_Principles","328841364_Semisupervised_learning_for_computational_linguistics","326190440_Automated_Grammatical_Error_Detection_for_Language_Learners_Second_Edition","325448894_Second_Language_Acquisition_Modeling","325445579_Modeling_Second-Language_Learning_from_a_Psychological_Perspective","322590463_A_Report_on_the_2017_Native_Language_Identification_Shared_Task","322059369_Focal_Loss_for_Dense_Object_Detection"]}