{"id":"339746102_Induced_Beta_Power_Modulations_during_Isochronous_Auditory_Beats_Reflect_Intentional_Anticipation_before_Gradual_Tempo_Changes","abstract":"Induced beta-band power modulations in auditory and motor-related brain areas have been associated with automatic temporal processing of isochronous beats and explicit, temporally-oriented attention. Here, we investigated how explicit top-down anticipation before upcoming tempo changes, a sustained process commonly required during music performance, changed beta power modulations during listening to isochronous beats. Musicians’ electroencephalograms were recorded during the task of anticipating accelerating, decelerating, or steady beats after direction-specific visual cues. In separate behavioural testing for tempo-change onset detection, such cues were found to facilitate faster responses, thus effectively inducing high-level anticipation. In the electroencephalograms, periodic beta power reductions in a frontocentral topographic component with seed-based source contributions from auditory and sensorimotor cortices were apparent after isochronous beats with anticipation in all conditions, generally replicating patterns found previously during passive listening to isochronous beats. With anticipation before accelerations, the magnitude of the power reduction was significantly weaker than in the steady condition. Between the accelerating and decelerating conditions, no differences were found, suggesting that the observed beta patterns may represent an aspect of high-level anticipation common before both tempo changes, like increased attention. Overall, these results indicate that top-down anticipation influences ongoing auditory beat processing in beta-band networks.","authors":["Emily Graber","Takako Fujioka"],"meta":["March 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-61044-9"],"references":["333513041_Four-Class_Motor_Imagery_EEG_Signal_Classification_using_PCA_Wavelet_and_Two-Stage_Neural_Network","320376328_Neural_Entrainment_to_Auditory_Imagery_of_Rhythms","320186260_Motor_origin_of_temporal_predictions_in_auditory_attention","304992603_When_Synchronizing_to_Rhythms_Is_Not_a_Good_Thing_Modulations_of_Preparatory_and_Post-Target_Neural_Activity_When_Shifting_Attention_Away_from_On-Beat_Times_of_a_Distracting_Rhythm","297680690_Unpredicted_Pitch_Modulates_Beta_Oscillatory_Power_during_Rhythmic_Entrainment_to_a_Tone_Sequence","288045218_Timing_structures'_neuronal_activity_during_preparation_for_action","333847429_Endogenous_Expectations_for_Sequence_Continuation_after_Auditory_Beat_Accelerations_And_Decelerations_Revealed_by_P3a_and_Induced_Beta-Band_Responses","303693288_Timing_of_beta_oscillatory_synchronization_and_temporal_prediction_of_upcoming_stimuli","293635950_Synchronization_and_Temporal_Processing","285833494_Event-related_EEG-MEG_synchronization_and_desynchronization_Basic_principles"]}