{"id":"339731787_Comparative_study_of_whole_exome_sequencing-based_copy_number_variation_detection_tools","abstract":"Background: \nWith the rapid development of whole exome sequencing (WES), an increasing number of tools are being proposed for copy number variation (CNV) detection based on this technique. However, no comprehensive guide is available for the use of these tools in clinical settings, which renders them inapplicable in practice. To resolve this problem, in this study, we evaluated the performances of four WES-based CNV tools, and established a guideline for the recommendation of a suitable tool according to the application requirements.\n\nResults: \nIn this study, first, we selected four WES-based CNV detection tools: CoNIFER, cn.MOPS, CNVkit and exomeCopy. Then, we evaluated their performances in terms of three aspects: sensitivity and specificity, overlapping consistency and computational costs. From this evaluation, we obtained four main results: (1) The sensitivity increases and subsequently stabilizes as the coverage or CNV size increases, while the specificity decreases. (2) CoNIFER performs better for CNV insertions than for CNV deletions, while the remaining tools exhibit the opposite trend. (3) CoNIFER, cn.MOPS and CNVkit realize satisfactory overlapping consistency, which indicates their results are trustworthy. (4) CoNIFER has the best space complexity and cn.MOPS has the best time complexity among these four tools. Finally, we established a guideline for tools' usage according to these results.\n\nConclusion: \nNo available tool performs excellently under all conditions; however, some tools perform excellently in some scenarios. Users can obtain a CNV tool recommendation from our paper according to the targeted CNV size, the CNV type or computational costs of their projects, as presented in Table 1, which is helpful even for users with limited knowledge of computer science.","authors":["Lanling Zhao","Han Liu","Xiguo Yuan","Kun Gao"],"meta":["March 2020BMC Bioinformatics 21(1)","DOI:10.1186/s12859-020-3421-1"],"references":["326516795_Genomic_mosaicism_in_the_developing_and_adult_brain","319252178_Evaluation_of_three_read-depth_based_CNV_detection_tools_using_whole-exome_sequencing_data","301562728_CNVkit_Genome-Wide_Copy_Number_Detection_and_Visualization_from_Targeted_DNA_Sequencing","265175098_Exome_sequence_read_depth_methods_for_identifying_copy_number_changes","264631800_Identification_of_copy_number_variants_from_exome_sequence_data","261732692_Copy_number_variation_detection_using_next_generation_sequencing_read_counts","260948523_The_MedSeq_Project_A_randomized_trial_of_integrating_whole_genome_sequencing_into_clinical_medicine","260608535_An_Evaluation_of_Copy_Number_Variation_Detection_Tools_from_Whole-Exome_Sequencing_Data","329200968_CONDEL_Detecting_Copy_Number_Variation_and_Genotyping_Deletion_Zygosity_from_Single_Tumor_Samples_using_Sequence_Data","284457255_Performance_Evaluation_of_Improved_Skew_Detection_and_Correction_using_FFT_and_Median_Filtering"]}