{"id":"339754375_Projections_on_insecurity_unemployment_and_poverty_and_their_consequences_in_Lima's_district_San_Juan_de_Lurigancho_in_the_next_10_years","abstract":"Lima, the Peruvian capital, with 10 million inhabitants is the 30th most populated city in the world. San Juan de\nLurigancho is one of the 18 districts in Lima and it has about\n10% of the population from the Peruvian capital. This work\nputs forward an analysis on the effects of the 10-year-population\ngrowth on poverty, insecurity and unemployment in this district.\nFirst, a projection of the population was done following the\nmethodology of systems dynamics based on systems thinking\nand the software Stella. Then we analyzed whether population\ngrowth had a bad effect on poverty in the district based on past\ndata. We obtained that in 2029 there will be approximately 1.23\nmillion inhabitants which surpasses the population in 15 out of\n24 departments in Peru. Narrowing down the search, in 2027\nthe district would have a ratio of 1 policeman for 1330 people\nwhich is far from the international standard ratio that suggests\n1 policeman for every 300 people. Furthermore, the population\nbetween 14 and 24 years old would increase in the district. This\nincrease plus the unemployment rate in Lima for people between\n14-24 led us to believe that the job market would be even more\ncompetitive and the youth unemployed may increase in the next\n10 years. It is expected that this work helps to demonstrate the\nproblem of the population growth in the district of San Juan de\nLurigancho and also serve as a guide to authorities from Peru\nto take action on this issue.","authors":["Frank Andrade-Chaico","Laberiano Andrade-Arenas"],"meta":["November 2019","DOI:10.1109/SHIRCON48091.2019.9024877","Conference: 2019 IEEE Sciences and Humanities International Research Conference (SHIRCON)"],"references":["254391388_'Youth_unemployment_in_Spain_Causes_and_solutions","227057984_Soft_System_Dynamics_Methodology_in_Action_A_study_of_the_Problem_of_Citizen_Insecurity_in_an_Argentinean_Province","222509242_Police_technology_in_cities_Changes_and_challenges","275684624_Methods_the_and_Materials_of_Demography","269961136_MegaCrisis_Overpopulation_is_the_Problem","238337579_The_Beginning_of_System_Dynamics","11133406_Population_and_Poverty_in_Africa"]}