{"id":"339778231_Scientometric_analysis_of_social_science_and_science_disciplines_in_a_developing_nation_a_case_study_of_Pakistan_in_the_last_decade","abstract":"Our study is a scientometric analysis of research publications of science and social science disciplines in Pakistan during 2009–2018. The study examines 2000 published articles belonging to 50 research scholars of different disciplines. This analysis is conducted on three different levels: researcher level, field level and domain level. In this paper we discuss readability scores, title formats, single and multiple authorships of articles, citation rates, publication rates over time, the research contribution of both genders and the impact of PhD institution of authors in research publications. The IR features like number of words, sentence length and readability scores are extracted. The results indicate that more research is being conducted in science disciplines as compared to social sciences. It also appears that the readability scores of authors changed over time, and Science articles have higher readability scores compared to Social Science articles. Moreover, title formats are observed to effect citation rates. Titles tend to use more colons over time; and the use of simple sentences as titles is more than 50%, while use of question marks is below 3%, the rest are titles with colons. The citation rates also appear to increase due to co-authorship. Male researchers contribute more to research activities in science disciplines while in social science the ratio is almost equal while PhD institutes appear to influence the performance of researcher slightly. Finally, it is observed that the publication rates of Science disciplines are much higher than Social Science articles, depicting that the growth of Science disciplines is more rapid in Pakistan.","authors":["Malik Muhammad Saad Missen","Sajeeha Qureshi","Nadeem Salamat","Nadeem Akhtar"],"meta":["March 2020Scientometrics 123(11)","DOI:10.1007/s11192-020-03379-8"],"references":["317955015_Using_text_analysis_to_quantify_the_similarity_and_evolution_of_scientific_disciplines","309340735_Scientometric_study_of_academic_publications_on_antioxidative_herbal_medicines_in_type_2_diabetes_mellitus","301270564_What_makes_a_'good'_title_and_how_does_it_matter_for_citations_A_review_and_general_model_of_article_title_attributes_in_management_science","286649534_Evaluation_of_Scientific_Disciplines_in_Turkey_A_Citation_Analysis_Study","280048712_A_comparative_Analysis_of_Social_Sciences_Research_Publications_in_four_South_Asian_countries","266740500_Examining_Multiple_Features_for_Author_Profiling","320445774_Scientometric_Mapping_of_Social_Science_Studies_in_East_Asia_and_the_Philippines","316699330_An_academic_odyssey_Writing_over_time","283247776_Readability_for_author_profiling_Notebook_for_PAN_at_CLEF_2013","271740709_Follow-up_study_On_the_working_time_budget_of_a_university_teacher_45_years_self-observation"]}