{"id":"339766258_Symmetric_Modeling_of_Communication_Effectiveness_and_Satisfaction_for_Communication_Software_on_Job_Performance","abstract":"Job performance is an issue highly related to the repetition of one enterprise. Because of the popularity of the Internet, consumer electronics have boomed rapidly and remove the space limitation stems. Users in the Taiwanese community send messages or share information through communication software that leads to more dependence from business. Various business problems have been solved and job performance has increased through the diversified functions on communication software. Thus, this research supposed that staff are willing to continuously use communication software LINE(a new communication app which allows one to make FREE voice calls and send FREE messages), and they agree that the varied functions of communication software would mean that information delivery more symmetrically affects their job performance. According to the research outcomes, communication effectiveness significantly influenced communication satisfaction and job performance, and communication satisfaction significantly influenced job performance. As organizational communication must be conducted through media that disseminate information, and different media have different communication effects, the relationship between communication effectiveness and job performance was completely mediated by communication satisfaction. The research suggested companies or organizations use LINE as a symmetric communication method to not only help employees improve their job performance, but also help enterprises achieve their goals or raise the profit, or even steady development for enterprises.","authors":["Tian-Syung Lan","Kai-Chi Chuang","Hai-Xia Li","Jih-Fu Tu"],"meta":["March 2020Symmetry 12(3):418","DOI:10.3390/sym12030418"],"references":["312982500_Communication_theory_and_organizational_communication_Multiple_perspectives_In","312368727_Measures_of_communication_satisfaction","308166727_SKILLED_INTERPERSONAL_COMMUNICATION_RESEARCH_THEORY_AND_PRACTICE_6th_edition","292066305_Manipulating_social_presence_through_the_Web_interface_and_its_impact_on_consumer_attitude_towards_online_shopping","284607132_Satisfaction_in_Communication_An_Examination_of_the_Downs-Hazen_Measure","270727133_Desegregating_HRM_A_Review_and_Synthesis_of_Micro_and_Macro_Human_Resource_Management_Research","270249306_Systems_Analysis_in_Organizational_Behavior","257929914_Human_Resource_Management","250961827_The_Effects_of_Positive_Affect_and_Gender_on_the_Influence_Tactics_-_Job_Performance_Relationship","250803207_Computers_Networks_and_Work"]}