{"id":"339765903_Role_of_artificial_intelligence_in_operations_environment_a_review_and_bibliometric_analysis","abstract":"Purpose\n“Technological intelligence” is the capacity to appreciate and adapt technological advancements, and “artificial intelligence” is the key to achieve persuasive operational transformations in majority of contemporary organizational set-ups. Implicitly, artificial intelligence (the philosophies of machines to think, behave and perform either same or similar to humans) has knocked the doors of business organizations as an imperative activity. Artificial intelligence, as a discipline, initiated by scientist John McCarthy and formally publicized at Dartmouth Conference in 1956, now occupies a central stage for many organizations. Implementation of artificial intelligence provides competitive edge to an organization with a definite augmentation in its social and corporate status. Mere application of a concept will not furnish real output until and unless its performance is reviewed systematically. Technological changes are dynamic and advancing at a rapid rate. Subsequently, it becomes highly crucial to understand that where have the people reached with respect to artificial intelligence research. The present article aims to review significant work by eminent researchers towards artificial intelligence in the form of top contributing universities, authors, keywords, funding sources, journals and citation statistics.\n\nDesign/methodology/approach\nAs rightly remarked by past researchers that reviewing is learning from experience, research team has reviewed (by applying systematic literature review through bibliometric analysis) the concept of artificial intelligence in this article. A sum of 1,854 articles extracted from Scopus database for the year 2018–2019 (31st of May) with selected keywords (artificial intelligence, genetic algorithms, agent-based systems, expert systems, big data analytics and operations management) along with certain filters (subject–business, management and accounting; language-English; document–article, article in press, review articles and source-journals).\n\nFindings\nResults obtained from cluster analysis focus on predominant themes for present as well as future researchers in the area of artificial intelligence. Emerged clusters include Cluster 1: Artificial Intelligence and Optimization; Cluster 2: Industrial Engineering/Research and Automation; Cluster 3: Operational Performance and Machine Learning; Cluster 4: Sustainable Supply Chains and Sustainable Development; Cluster 5: Technology Adoption and Green Supply Chain Management and Cluster 6: Internet of Things and Reverse Logistics.\n\nOriginality/value\nThe result of review of selected studies is in itself a unique contribution and a food for thought for operations managers and policy makers.","authors":["Pavitra Dhamija","Surajit Bag"],"meta":["March 2020TQM Journal ahead-of-print(ahead-of-print)","DOI:10.1108/TQM-10-2019-0243"],"references":["334643659_Development_of_a_framework_for_agile_manufacturing","332333021_Improved_augmented_Lagrangian_coordination_for_optimizing_supply_chain_configuration_with_multiple_sharing_elements_in_industrial_cluster","336839008_Big_data_analytics_as_an_operational_excellence_approach_to_enhance_sustainable_supply_chain_performance","336242863_Procurement_40_and_its_implications_on_business_process_performance_in_a_circular_economy","335977369_A_step_to_clean_energy_-_Sustainability_in_energy_system_management_in_an_emerging_economy_context","335435943_Artificial_Intelligence_AI_Multidisciplinary_perspectives_on_emerging_challenges_opportunities_and_agenda_for_research_practice_and_policy","333714555_Artificial_intelligence_divulges_effective_tactics_of_top_management_institutes_of_India","332235077_An_analysis_of_causal_relationships_among_challenges_impeding_redistributed_manufacturing_in_emerging_economies","331931280_Linking_big_data_analytics_and_operational_sustainability_practices_for_sustainable_business_management","331722072_Formulating_and_Solving_the_Integrated_Batching_Routing_and_Picker_Scheduling_Problem_in_a_Real-life_Spare_Parts_Warehouse"]}