{"id":"339783478_FrankLab_Plataforma_Web_de_Robotica_Educativa_con_Licencia_Libre_GPL","abstract":"Introducir conceptos propios de la Ciencia de la Computación de forma sostenible y rigurosa en las propuestas curriculares de las escuelas secundarias, es una necesidad reco-nocida y con gran consenso entre gobiernos, organizaciones no gubernamentales, grupos de investigación y docentes en el campo de la enseñanza de la computación, tanto en países desarrollados como en desarrollo. En este contexto se evidencia la necesidad de desarrollar recursos didácticos específicos al campo de la Educación en Ciencias de la Computación que posibiliten una mejor aproximación de la disciplina alámbito de la educación obligatoria. En este trabajo se presenta una plataforma Web de robótica educativa con licencia libre GPL, denominada FrankLab, di-señada para favorecer el desarrollo de los procesos de enseñanza y de aprendizaje de conceptos y prácticas en elárea Algorit-mos y Lenguajes de Programación, durante toda la educación obligatoria. FrankLab provee un entorno de programación en línea que permite a estudiantes de escuelas primarias y secundarias progra-mar robots educativos de la familia Frankestito. Dicho ambiente está compuesto por un conjunto de herramientas de programa-ción que soporta Programación Tangible, Programación Basada en Bloques y Programación basada en texto. Los estudiantes ejecutan sus programas desde un navegador web visualizando el comportamiento sobre robots compatibles con Frankestito en un laboratorio físico, que puede ser remoto, o en uno virtual, el cual traduce en una simulación digital del comportamiento del robot.","authors":["Marcos Picucci","Juan de la Fuente","Daiana Bonet Peinado","Jorge Rodriguez"],"meta":["March 2020","Project: AGENTES INTELIGENTES. MODELOS FORMALES Y APLICACIONES PARA LA EDUCACIÓN."],"references":["331344326_Mejorando_las_posibilidades_de_aprender_a_programar_ampliacion_del_robot_educativo_Multiplo_N6_MAX_a_Frankestito","315066585_Educational_Robots_Driven_by_Tangible_Programming_Languages_A_Review_on_the_Field","311556036_Tangible_User_Interfaces_for_Programming_and_Education_A_New_Field_for_Innovation_and_Entrepreneurship","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","321402901_Tips_for_creating_a_block_language_with_blockly","305719523_Robotics_for_Education"]}