{"id":"339773700_Three_critical_factors_affecting_automated_image_species_recognition_performance_for_camera_traps","abstract":"Abstract Ecological camera traps are increasingly used by wildlife biologists to unobtrusively monitor an ecosystems animal population. However, manual inspection of the images produced is expensive, laborious, and time‐consuming. The success of deep learning systems using camera trap images has been previously explored in preliminary stages. These studies, however, are lacking in their practicality. They are primarily focused on extremely large datasets, often millions of images, and there is little to no focus on performance when tasked with species identification in new locations not seen during training. Our goal was to test the capabilities of deep learning systems trained on camera trap images using modestly sized training data, compare performance when considering unseen background locations, and quantify the gradient of lower bound performance to provide a guideline of data requirements in correspondence to performance expectations. We use a dataset provided by Parks Canada containing 47,279 images collected from 36 unique geographic locations across multiple environments. Images represent 55 animal species and human activity with high‐class imbalance. We trained, tested, and compared the capabilities of six deep learning computer vision networks using transfer learning and image augmentation: DenseNet201, Inception‐ResNet‐V3, InceptionV3, NASNetMobile, MobileNetV2, and Xception. We compare overall performance on “trained” locations where DenseNet201 performed best with 95.6% top‐1 accuracy showing promise for deep learning methods for smaller scale research efforts. Using trained locations, classifications with","authors":["Stefan Schneider","Saul Greenberg","Graham W. Taylor","Stefan C. Kremer"],"meta":["March 2020Ecology and Evolution 10(4)","DOI:10.1002/ece3.6147"],"references":["344703608_A_deep_active_learning_system_for_species_identification_and_counting_in_camera_trap_images","341528006_Similarity_Learning_Networks_for_Animal_Individual_Re-Identification_-_Beyond_the_Capabilities_of_a_Human_Observer","337710011_Design_patterns_for_wildlife-related_camera_trap_image_analysis","329750896_Deep_Learning_Object_Detection_Methods_for_Ecological_Camera_Trap_Data","329647674_Past_Present_and_Future_Approaches_Using_Computer_Vision_for_Animal_Re-Identification_from_Camera_Trap_Data","329210510_Machine_learning_to_classify_animal_species_in_camera_trap_images_Applications_in_ecology","324744965_Face_Recognition_Primates_in_the_Wild","332324613_Deep_learning_new_computational_modelling_techniques_for_genomics","328128212_Identifying_Animal_Species_in_Camera_Trap_Images_using_Deep_Learning_and_Citizen_Science","322060396_Mask_R-CNN"]}