{"id":"339766155_Development_Experience_of_a_Context-Aware_System_for_Smart_Irrigation_Using_CASO_and_IRRIG_Ontologies","abstract":"The rapid development of information and communication technologies and wireless sensor networks has transformed agriculture practices. New tools and methods are used to support farmers in their activities. This paper presents a context-aware system that automates irrigation decisions based on sensor measurements. Automatic irrigation overcomes the water shortage problem, and automatic sensor measurements reduce the observational work of farmers. This paper focuses on a method for developing context-aware systems using ontologies. Ontologies are used to solve heterogeneity issues in sensor measurements. Their main goal is to propose a shared data schema that precisely describes measurements to ease their interpretations. These descriptions are reusable by any machine and understandable by humans. The context-aware system also contains a decision support system based on a rules inference engine. We propose two new ontologies: The Context-Aware System Ontology addresses the development of the context-aware system in general. The Irrigation ontology automates a manual irrigation method named IRRINOV®. These ontologies reuse well-known ontologies such as the Semantic Sensor Network (SSN) and Smart Appliance REFerence (SAREF). The decision support system uses a set of rules with ontologies to infer daily irrigation decisions for farmers. This project uses real experimental data to evaluate the implementation of the decision support system.","authors":["Quang-Duy Nguyen","Catherine Roussey","María Poveda-Villalón","Christophe De Vaulx"],"meta":["March 2020Applied Sciences 10(5):1803","DOI:10.3390/app10051803","Projects: Context-aware approach for e-agricultureConnecSens"],"references":["346247528_Using_Tensiometers_for_Vegetable_Irrigation_Scheduling_in_Miami-Dade_County","339816092_Ontological_requirement_specification_for_smart_irrigation_systems_a_SOSASSN_and_SAREF_comparison","330320840_Smart_Water_Management_Platform_IoT-Based_Precision_Irrigation_for_Agriculture","326335033_SOSA_A_lightweight_ontology_for_sensors_observations_samples_and_actuators","320202727_WIDOCO_A_Wizard_for_Documenting_Ontologies","307199913_A_New_Formalisation_for_Wireless_Sensor_Network_Adaptive_Context-aware_System_Application_to_an_Environmental_Use_Case","329344888_Citrus_ontology_development_based_on_the_eight-point_charter_of_agriculture","328186315_Automating_ontology_engineering_support_activities_with_OnToology","311451042_Water_management_and_irrigation_scheduling","285623865_OOPS_OntOlogy_Pitfall_Scanner_An_on-line_tool_for_ontology_evaluation"]}