{"id":"339773498_Solar-driven_polygeneration_systems_Recent_progress_and_outlook","abstract":"Solar energy exploitation is an important weapon for facing critical problems such as fossil fuel depletion, global warming and the increasing energy demand due to the new lifestyle trends. Moreover, the increase in the performance of energy systems is another way of achieving sustainability. Polygeneration systems are highly efficient systems that can produce multiple useful energy outputs like electricity, cooling, heating, fresh water and hydrogen. So, combing solar energy systems and polygeneration units is an optimal way of producing many useful outputs with high efficiency and by utilizing a clean energy source. In this direction, the objective of the present work is to review and to discuss the present literature studies about the exploitation of solar irradiation in polygeneration systems. The present review paper investigates the use of different solar energy technologies in any kind of polygeneration system. More specifically, flat plate collector, evacuated tubes, parabolic trough collector, linear Fresnel reflector, solar dish concentrator, solar tower and thermal photovoltaics are the investigated systems in this work. The examined polygeneration systems include various engineering devices like organic Rankine cycle, gas turbine, absorption heat pump, distillation unit, electrolyzer and heat exchanger. The final results indicate that solar-driven polygeneration systems with parabolic trough collectors, concentrating thermal photovoltaics and solar tower can be sustainable and viable systems for application in the future energy commodities.","authors":["Alibakhsh Kasaeian","Evangelos Bellos","Armin Shamaeizadeh","Christos Tzivanidis"],"meta":["April 2020Applied Energy 264:114764","DOI:10.1016/j.apenergy.2020.114764"],"references":["326929009_Investigation_of_a_solar-biomass_polygeneration_system","326235763_Assessment_of_linear_solar_concentrating_technologies_for_Greek_climate","326001813_Exergy_Analysis_of_the_Annual_Operation_of_a_Sugarcane_Cogeneration_Power_Plant_Assisted_by_Linear_Fresnel_Solar_Collectors","327801306_Energy_and_exergy_analysis_of_solar_thermal_energy-based_polygeneration_processes_for_applications_in_rural_India","327371487_Polygeneration_with_biomass-integrated_gasification_combined_cycle_process_Review_and_prospective","327066694_Simulation_of_polygeneration_systems","326988648_Comprehensive_assessment_of_a_multi-generation_system_integrated_with_a_desalination_system_Modeling_and_analysing","326818969_Development_and_Assessment_of_Integrating_Parabolic_Trough_Collectors_with_Gas_Turbine_Trigeneration_System_for_Producing_Electricity_Chilled_Water_and_Freshwater","326743869_A_review_on_parabolic_troughFresnel_based_photovoltaic_thermal_systems","325901950_Optimization_of_4th_generation_distributed_district_heating_system_Design_and_planning_of_combined_heat_and_power"]}