{"id":"339747904_Planar_graphs_have_bounded_nonrepetitive_chromatic_number","abstract":"The following seemingly simple question with surprisingly many connections to various problems in computer science and mathematics can be traced back to the beginning of the 20th century to the work of [Axel Thue](https://en.wikipedia.org/wiki/Axel_Thue): How many colors are needed to color the positive integers in a way such that no two consecutive segments of the same length have the same color pattern? Clearly, at least three colors are needed: if there was such a coloring with two colors, then any two consecutive integers would have different colors (otherwise, we would get two consecutive segments of length one with the same color pattern) and so the colors would have to alternate, i.e., any two consecutive segments of length two would have the same color pattern. Suprisingly, three colors suffice. The coloring can be constructed as follows. We first define a sequence of 0s and 1s recursively as follows: we start with 0 only and in each step we take the already constructed sequence, flip the 0s and 1s in it and append the resulting sequence at the end. In this way, we sequentially obtain the sequences 0, 01, 0110, 01101001, etc., which are all extensions of each other. The limiting infinite sequence is known as the [Thue-Morse sequence](https://en.wikipedia.org/wiki/Thue%E2%80%93Morse_sequence). Another view of the sequence is that the $i$-th element is the parity of the number of 1s in the binary representation of $i-1$, i.e., it is one if the number is odd and zero if it is even. The coloring of integers is obtained by coloring an integer $i$ by the difference of the $(i+1)$-th and $i$-th entries in the Thue-Morse sequence, i.e., the sequence of colors will be 1, 0, -1, 1, -1, 0, 1, 0, etc. One of the properties of the Thue-Morse sequence is that it does not containing two overlapping squares, i.e., there is no sequence X such that 0X0X0 or 1X1X1 would be a subsequence of the Thue-Morse sequence. This implies that the coloring of integers that we have constructed has no two consecutive segments with the same color pattern. The article deals with a generalization of this notion to graphs. The _nonrepetitive chromatic number_ of a graph $G$ is the minimum number of colors required to color the vertices of $G$ in such way that no path with an even number of vertices is comprised of two paths with the same color pattern. The construction presented above yields that the nonrepetitive chromatic number of every path with at least four vertices is three. The article answers in the positive the following question of Alon, Grytczuk, Hałuszczak and Riordan from 2002: Is the nonrepetitive chromatic number of planar graphs bounded? They show that the nonrepetitive chromatic number of every planar graph is at most 768 and provide generalizations to graphs embeddable to surfaces of higher genera and more generally to classes of graphs excluding a (topological) minor. Before their work, the best upper bound on the nonrepetitive chromatic number of planar graphs was logarithmic in their number of vertices, in addition to a universal upper bound quadratic in the maximum degree of a graph obtained using probabilistic method. The key ingredient for the argument presented in the article is the recent powerful result by Dujmović, Joret, Micek, Morin, Ueckerdt and Wood asserting that every planar graph is a subgraph of the strong product of a path and a graph of bounded tree-width (tree-shaped graph).","authors":["Vida Dujmović","Louis Esperet","Gwenaël Joret","Bartosz Walczak"],"meta":["March 2020","DOI:10.19086/aic.12100"],"references":["312912515_Nonrepetitive_colorings_of_graphs_excluding_a_fixed_immersion_or_topological_minor","301880372_New_Bounds_for_Facial_Nonrepetitive_Colouring","290028654_Pathwidth_and_Nonrepetitive_List_Coloring","338443700_Planar_Graphs_have_Bounded_Queue-Number","317306034_Layered_separators_in_minor-closed_graph_classes_with_applications","312462527_Nonrepetitive_edge-colorings_of_trees","291657703_Nonrepetitive_colorings_of_graphs","287967265_Nonrepetitive_and_pattern-free_colorings_of_the_plane","285384275_2epsilon_2_e_-Nonrepetitive_List_Colouring_of_Paths","279069689_Nonrepetitive_colorings_of_line_arrangements"]}