{"id":"339832620_Desarrollo_historico_de_la_Licenciatura_en_Ciencias_de_la_Computacion_en_la_UMT-UADY_Un_estudio_de_caso","abstract":"Los autores presentan el caso de la Licenciatura en Ciencias de la Computación de la Universidad Autónoma de Yucatán, en su oferta a la zona oriente del Estado de Yucatán, en particular, en la Unidad Multidisciplinaria ubicada en la ciudad de Tizimín (UMT). Se ofrece información sobre los planes de estudio, así como de las evaluaciones externas a las que fue sometido el programa curricular en el período de 2000 a 2015; se incluyen datos estadísticos sobre el ingreso, titulación y modalidades de titulación preferidas por los egresados. En cuanto al desempeño de los egresados, se presentan los datos históricos en el Examen General de Egreso administrado por el CENEVAL. Finalmente, los autores comentan algunas reflexiones sobre la pertinencia e impacto del programa durante su operación en la UMT. The authors present the case of the Bachelor of Computer Science of the Autonomous University of Yucatan, in its offer to the eastern region of the State of Yucatan, particularly, in the Multidisciplinary Unit located in Tizimín City (UMT). Information is provided on the curricula, as well as on the external evaluations to which the curricular program was submitted during the period from 2000 to 2015; statistical data are included on the income, qualification and modalities of qualifications preferred by graduate. Regarding the performance of graduates, historical data are presented in the General Exit Exam administered by CENEVAL. Finally, the authors comment on some reflections on the relevance and impact of the program during its operation in the UMT.","authors":["Raúl Antonio Aguilar Vera","L. Narváez Díaz","V. Chí Pech","Julio César Díaz-Mendoza"],"meta":["January 2020Tecnología Educativa Revista CONAIC 6(3):42-52","DOI:10.32671/terc.v6i3.103","Project: Roles de Belbin"],"references":["28099878_La_Eficiencia_Terminal_en_Programas_de_Licenciatura_y_su_Relacion_con_la_Calidad_Educativa","291335863_La_Ingenieria_de_Software_en_Mexico_Hacia_la_consolidacion_del_primer_programa_de_Licenciatura"]}