{"id":"339847881_Artificial_intelligence_with_multi-functional_machine_learning_platform_development_for_better_healthcare_and_precision_medicine","abstract":"Precision medicine is one of the recent and powerful developments in medical care, which has the potential to improve the traditional symptom-driven practice of medicine, allowing earlier interventions using advanced diagnostics and tailoring better and economically personalized treatments. Identifying the best pathway to personalized and population medicine involves the ability to analyze comprehensive patient information together with broader aspects to monitor and distinguish between sick and relatively healthy people, which will lead to a better understanding of biological indicators that can signal shifts in health. While the complexities of disease at the individual level have made it difficult to utilize healthcare information in clinical decision-making, some of the existing constraints have been greatly minimized by technological advancements. To implement effective precision medicine with enhanced ability to positively impact patient outcomes and provide real-time decision support, it is important to harness the power of electronic health records by integrating disparate data sources and discovering patient-specific patterns of disease progression. Useful analytic tools, technologies, databases, and approaches are required to augment networking and interoperability of clinical, laboratory and public health systems, as well as addressing ethical and social issues related to the privacy and protection of healthcare data with effective balance. Developing multifunctional machine learning platforms for clinical data extraction, aggregation, management and analysis can support clinicians by efficiently stratifying subjects to understand specific scenarios and optimize decision-making. Implementation of artificial intelligence in healthcare is a compelling vision that has the potential in leading to the significant improvements for achieving the goals of providing real-time, better personalized and population medicine at lower costs. In this study, we focused on analyzing and discussing various published artificial intelligence and machine learning solutions, approaches and perspectives, aiming to advance academic solutions in paving the way for a new data-centric era of discovery in healthcare.","authors":["Zeeshan Ahmed","Khalid Mohamed","Saman Zeeshan","XinQi Dong"],"meta":["March 2020Database The Journal of Biological Databases and Curation 2020","DOI:10.1093/database/baaa010"],"references":["338332372_International_evaluation_of_an_AI_system_for_breast_cancer_screening","334899702_Machine_Learning_Identification_of_Surgical_and_Operative_Factors_Associated_With_Surgical_Expertise_in_Virtual_Reality_Simulation","334580977_Patient_decision_aids_a_content_analysis_based_on_a_decision_tree_structure","334229459_What_Should_Medical_Students_Know_about_Artificial_Intelligence_in_Medicine","333880444_Ethical_challenges_regarding_artificial_intelligence_in_medicine_from_the_perspective_of_scientific_editing_and_peer_review","333851512_Combined_network_analysis_and_machine_learning_allows_the_prediction_of_metabolic_pathways_from_tomato_metabolomics_data","333523594_Developing_a_random_forest_classifier_for_predicting_the_depression_and_managing_the_health_of_caregivers_supporting_patients_with_Alzheimer's_Disease","333499536_Decision_tree-based_classifier_in_providing_telehealth_service","334171643_Improving_length_of_stay_prediction_using_a_hidden_Markov_model","333821320_Artificial_Intelligence_and_Personalized_Medicine"]}