{"id":"339838019_The_Impact_of_an_Online_Training_Program_About_Cancer_Clinical_Trials_on_Primary_Care_Physicians'_Knowledge_Attitudes_and_Beliefs_and_Behavior","abstract":"Participation in cancer clinical trials (CCTs) is critical to improving cancer treatments and quality of care. However, rates of patient participation remain low. Research has shown that a trusted physician recommendation is an important influence on patients’ decisions to enroll in a CCT. Improving primary care providers’ (PCPs’) knowledge, attitudes, and beliefs about CCTs is a promising potential path for improving CCT participation. The aim of this pilot study was to test the effect of an online educational course for PCPs about clinical trials on primary care providers’ knowledge, attitudes and beliefs, and behavior. Forty-one PCPs in the New York City area participated in a 1-h online training session on cancer clinical trials. These PCPs had self-selected to complete the training in a previous survey. The objectives of the training module were to (1) educate the PCPs about clinical trials, with a focus on overcoming misconceptions; and (2) discuss roles of PCPs in partnering with oncologists to help patients gain access to clinical trials. The training module included didactics, audio excerpts, and case descriptions. Participants completed a pre-test immediately before taking the course, a post-test immediately after taking the course, and a 3-month post-course survey. All three assessments included a general T/F knowledge test, a 7-item attitude/belief scale, and a knowledge test focused specifically on local resources and access for clinical trials. Forty-one PCPs completed the module and the pre-post course surveys. Eighty percent (33/41) also completed the 3-month post-course survey. General knowledge and local knowledge increased significantly (p < .05) from pre- to post-course. At 3 months post-training, both general and local knowledge scores remained significantly increased from baseline. For those who completed the 3-month post-course survey, attitudes and beliefs increased significantly from pre- to post-course, but this change was not sustained at 3 months post-training. At 3 months post-training, 52% of the PCPs who had an interaction with a recently diagnosed cancer patient reported speaking with patients about CCTs as a result of the training. A brief online course showed significant and sustained improvement in PCPs’ general and local knowledge about cancer clinical trials, which translated into self-reported behavior change. Future dissemination of the course and further research into its impact are important next steps.","authors":["Carma Bylund","Margo Michaels","Elisa S. Weiss","Shilpa Patel"],"meta":["March 2020Journal of Cancer Education 36(2)","DOI:10.1007/s13187-020-01731-3"],"references":["319426704_The_Role_of_Oncology_Nurses_in_Discussing_Clinical_Trials","318427968_Perceptions_of_Cancer_Care_and_Clinical_Trials_in_the_Black_Community_Implications_for_Care_Coordination_Between_Oncology_and_Primary_Care_Teams","261035628_Increasing_Primary_Care_Physician_Support_for_and_Promotion_of_Cancer_Clinical_Trials","257839663_The_National_Cancer_Institute-American_Society_of_Clinical_Oncology_Cancer_Trial_Accrual_Symposium_Summary_and_Recommendations","255952539_Screening_Intervention_to_Identify_Eligible_Patients_and_Improve_Accrual_to_Phase_II-IV_Oncology_Clinical_Trials","248705880_Physician_Roles_in_the_Cancer-Related_Follow-Up_Care_of_Cancer_Survivors","26666540_The_Role_of_Primary_Care_Physicians_in_Cancer_Care","7158574_Factors_associated_with_participation_in_breast_cancer_clinical_trials","318378740_Primary_care_physicians'_attitudes_and_beliefs_about_cancer_clinical_trials","303509962_Primary_Care_Physicians'_Perspectives_of_Their_Role_in_Cancer_Care_A_Systematic_Review","288001547_Randomized_Trial_of_a_Web-Based_Intervention_to_Address_Barriers_to_Clinical_Trials","51662301_The_Promise_of_Community-Based_Advocacy_and_Education_Efforts_for_Increasing_Cancer_Clinical_Trials_Accrual","41848289_RTOG_physician_and_research_associate_attitudes_beliefs_and_practices_regarding_clinical_trials_Implications_for_improving_patient_recruitment","23762505_Diversity_of_Participants_in_Clinical_Trials_in_an_Academic_Medical_Center_The_Role_of_the_'Good_Study_Patient'","13067842_Evaluating_and_researching_the_effectiveness_of_educational_interventions","12081484_Prospective_Evaluation_of_Cancer_Clinical_Trial_Accrual_Patterns_Identifying_Potential_Barriers_to_Enrollment","6530614_Physicians'_and_patients'_views_of_cancer_care_by_family_physicians_A_report_from_the_American_Academy_of_Family_Physicians_National_Research_Network"]}