{"id":"339862373_Drosophila_insulin-like_peptide_2_mediates_dietary_regulation_of_sleep_intensity","abstract":"Sleep is a nearly universal behavior that is regulated by diverse environmental stimuli and physiological states. A defining feature of sleep is a homeostatic rebound following deprivation, where animals compensate for lost sleep by increasing sleep duration and/or sleep depth. The fruit fly, Drosophila melanogaster, exhibits robust recovery sleep following deprivation and represents a powerful model to study neural circuits regulating sleep homeostasis. Numerous neuronal populations have been identified in modulating sleep homeostasis as well as depth, raising the possibility that the duration and quality of recovery sleep is dependent on the environmental or physiological processes that induce sleep deprivation. Here, we find that unlike most pharmacological and environmental manipulations commonly used to restrict sleep, starvation potently induces sleep loss without a subsequent rebound in sleep duration or depth. Both starvation and a sucrose-only diet result in increased sleep depth, suggesting that dietary protein is essential for normal sleep depth and homeostasis. Finally, we find that Drosophila insulin like peptide 2 (Dilp2) is acutely required for starvation-induced changes in sleep depth without regulating the duration of sleep. Flies lacking Dilp2 exhibit a compensatory sleep rebound following starvation-induced sleep deprivation, suggesting Dilp2 promotes resiliency to sleep loss. Together, these findings reveal innate resilience to starvation-induced sleep loss and identify distinct mechanisms that underlie starvation-induced changes in sleep duration and depth.","authors":["Elizabeth B. Brown","Kreesha Shah","Richard Faville","Benjamin Kottler"],"meta":["March 2020PLoS Genetics 16(3):e1008270","DOI:10.1371/journal.pgen.1008270"],"references":["331908346_A_potassium_channel_b-subunit_couples_mitochondrial_electron_transport_to_sleep","331078019_A_single_pair_of_leucokinin_neurons_are_modulated_by_feeding_state_and_regulate_sleep-metabolism_interactions","330786242_A_sleep-inducing_gene_nemuri_links_sleep_and_immune_function_in_Drosophila","328644579_Astrocyte_expression_of_the_Drosophila_TNF-alpha_homologue_Eiger_regulates_sleep_in_flies","326283814_Insulin_signalling_activates_multiple_feedback_loops_to_elicit_hunger-induced_feeding_in_Drosophila","326005717_MicroRNAs_Regulate_Sleep_and_Sleep_Homeostasis_in_Drosophila","325837792_Serine_metabolism_in_the_brain_regulates_starvation-induced_sleep_suppression_in_Drosophila_melanogaster","325408345_Drosophila_Insulin-Like_Peptides_DILP2_and_DILP5_Differentially_Stimulate_Cell_Signaling_and_Glycogen_Phosphorylase_to_Regulate_Longevity","324036898_Variation_in_sleep_and_metabolic_function_is_associated_with_latitude_and_average_temperature_in_Drosophila_melanogaster","325713954_The_origins_and_evolution_of_sleep"]}