{"id":"339875159_Research_article_titles_in_written_feedback_on_English_as_a_second_language_writing","abstract":"The titles of articles investigating written feedback on English as a second language writing are crucial to inform and attract the intended audience to read, download, and possibly cite the article in an increasingly crowded marketplace of research. The present study constituted a descriptive and regression analysis of 372 research article titles in order to generate insights into the title writing practices of authors in a narrow sub-disciplinary research concern and whether particular norms cohere with scholarly impact. It was found written feedback scholars opted for titles that emphasised informativeness, evinced through lengthy titles, uni-head nominal structures involving comprehensive pre-modification, and compound structures that juxtaposed a range of elaborated concerns (e.g., scope, description, methodology) with the research topic. Stepwise regression analysis revealed the use of non-alphanumeric characters negatively predicted the article’s age-weighted citation rate, while the syntactic/functional pattern effect + prepositional group was a significant positive indicator of citation rates. The results vary from previous findings at the disciplinary level of linguistics, indicating there is value in future studies of research article titles at the sub-disciplinary level. Written feedback researchers can utilise the findings to generate field-acceptable titles and possibly enhance their prospects of citations.","authors":["William S. Pearson"],"meta":["March 2020Scientometrics 123(2):997-1019","DOI:10.1007/s11192-020-03388-7"],"references":["334279730_The_effects_of_written_corrective_feedback_A_critical_synthesis_of_past_and_present_research","333205180_Investigating_Written_Corrective_Feedback_Misalignment_of_Teachers'_Beliefs_and_Practice","330945189_Citations_Citation_Indicators_and_Research_Quality_An_Overview_of_Basic_Concepts_and_Theories","325551612_Synchronous_and_asynchronous_teacher_electronic_feedback_and_learner_uptake_in_ESL_composition_Journal_of_Second_Language_Writing_41_1-13","341540937_L2_writers'_processing_of_written_corrective_feedback_Depth_of_processing_via_written_languaging","336241624_The_evolution_of_research_article_titles_the_case_of_Journal_of_Pragmatics_1978-2018","333608426_Twenty-five_years_of_research_on_oral_and_written_corrective_feedback_in_System","329930692_Written_corrective_feedback_from_an_ecological_perspective_The_interaction_between_the_context_and_individual_learners","326099725_Student_engagement_with_teacher_written_corrective_feedback_in_EFL_writing_A_case_study_of_Chinese_lower-proficiency_students","322828441_Written_Corrective_Feedback_The_Practitioners'_Perspective"]}