{"id":"339858998_An_Improved_Kinematic_Model_Predictive_Control_for_High-Speed_Path_Tracking_of_Autonomous_Vehicles","abstract":"Kinematic model predictive control (MPC) is well known for its simplicity and computational efficiency for path tracking of autonomous vehicles, however, it merely works well at low speed. In addition, earlier studies have demonstrated that tracking accuracy is improved by the feedback of yaw rate, as it improves the system transients. With this in mind, it is expected that the performance of path tracking can be improved by a cascaded controller that utilizes kinematic MPC to determine desired yaw rate rather than steering angle, and uses proportional-integral-derivative (PID) control to follow the reference yaw rate. However, directly combining MPC with PID feedback control of yaw rate results in a controller with poor tracking accuracy. The simulation results show that the cascaded MPC-PID controller has relatively stable but larger error compared to classic kinematic and dynamic MPC. Based on the analysis of vehicle sideslip angle, a novel path tracking control method is proposed, which is designed using a kinematic MPC to handle the disturbances on road curvature, a PID feedback control of yaw rate to reject uncertainties and modeling errors, and a vehicle sideslip angle compensator to correct the kinematic model prediction. The proposed controller performances involving steady-state and transient response, robustness, and computing efficiency were evaluated on Carsim/Matlab joint simulation environment. Furthermore, field experiments were conducted to validate the robustness against sensor disturbances and time lag. The results demonstrate that the developed vehicle sideslip compensator is sufficient to capture steer dynamics, and the developed controller significantly improves the performance of path tracking and follows the desired path very well, ranging from low speed to high speed even at the limits of handling.","authors":["Luqi Tang","Fuwu Yan","Bin Zou","Kewei Wang"],"meta":["March 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2980188"],"references":["337503494_Model_Predictive_Control_for_Autonomous_Driving_considering_Actuator_Dynamics","336205642_Path_Tracking_Control_for_Autonomous_Vehicles_Based_on_an_Improved_MPC","332665454_A_Model_Predictive_Controller_With_Switched_Tracking_Error_for_Autonomous_Vehicle_Path_Tracking","325048026_Implementation_and_Development_of_a_Trajectory_Tracking_Control_System_for_Intelligent_Vehicle","336621583_Path-Tracking_for_Autonomous_Vehicles_with_On-line_Estimation_of_Axle_Cornering_Stiffnesses","332344636_Sensor_Fusion_Based_on_a_Dual_Kalman_Filter_for_Estimation_of_Road_Irregularities_and_Vehicle_Mass_Under_Static_and_Dynamic_Conditions","331077599_A_Novel_Dual_Successive_Projection-Based_Model-Free_Adaptive_Control_Method_and_Application_to_an_Autonomous_Car","330984399_Design_Analysis_and_Experiments_of_Preview_Path_Tracking_Control_for_Autonomous_Vehicles","326385662_A_Novel_Fuzzy_Observer-Based_Steering_Control_Approach_for_Path_Tracking_in_Autonomous_Vehicles","323690492_Trajectory_planning_and_tracking_for_autonomous_overtaking_State-of-the-art_and_future_prospects"]}