{"id":"339815838_International_Journal_of_Advance_Research_in_Computer_Science_and_Management_Studies_Online_Purchasing_with_SMS_Payment_A_tool_in_monitoring_student_purchases","abstract":"School canteens are an integral part of the school environment and an ideal site for a healthy eating experience. Nonetheless, healthy meals can be difficult to implement when the canteen is not provided within the school system. The aim of this study was to develop and support the institutions especially in the process of canteen management and sales. The paper describes a system that helps workers control the productivity of the canteen and, at the same time, recognizes the importance of school and home relationships in child monitoring. This provides internet access to parents that enables them to monitor the purchasing profile of their children in the school canteen. The study was used the developmental method of research using the SDLC with the following steps: analysis, design, implementation and maintenance of the system. The proposed system to be put into effect, an analysis of the standard process and procedures needed to be carried out. After that, data were collected, analyzed and reviewed extensively to meet the goals. Identified components for the device, necessary outputs, inputs, interfaces and processes. Based on data interpretation, the parent respondents claimed there should be a way for them to monitor the eating habits and spending of their children. The respondents believed and accepted that the new system can help make canteen transactions more convenient for parents, students and staff at the canteen.","authors":["Joey De la Cruz"],"meta":["March 2020International Journal of Advance Research in Computer Science and Management 8(2):6-12"],"references":["220474832_Mobile_Communications_and_Mobile_Services","220265538_A_Critique_of_k-Anonymity_and_Some_of_Its_Enhancements","294425300_Simple_interventions_to_improve_healthy_eating_behaviors_in_the_school_cafeteria","222554728_Strategic_implications_of_mobile_technology_A_case_study_using_Value-Focused_Thinking"]}