{"id":"339804722_Human_ownership_of_artificial_creativity","abstract":"Advances in generative algorithms have enhanced the quality and accessibility of artificial intelligence (AI) as a tool in building synthetic datasets. By generating photorealistic images and videos, these networks can pose a major technological disruption to a broad range of industries from medical imaging to virtual reality. However, as artwork developed by generative algorithms and cognitive robotics enters the arena, the notion of human-driven creativity has been thoroughly tested. When creativity is automated by the programmer, in a style determined by the trainer, using features from information available in public and private datasets, who is the proprietary owner of the rights in AI-generated artworks and designs? This Perspective seeks to provide an answer by systematically exploring the key issues in copyright law that arise at each phase of artificial creativity, from programming to deployment. Ultimately, four guiding actions are established for artists, programmers and end users that utilize AI as a tool such that they may be appropriately awarded the necessary proprietary rights. As artists are beginning to employ deep learning techniques to create new and interesting art, questions arise about how copyright and ownership apply to those works. This Perspective discusses how artists, programmers and users can ensure clarity about the ownership of their creations.","authors":["Jason K. Eshraghian"],"meta":["March 2020Nature Machine Intelligence 2(3):1-4","DOI:10.1038/s42256-020-0161-x"],"references":["325343460_A_Legal_Perspective_on_Training_Models_for_Natural_Language_Processing","320966887_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","310610633_Image-to-Image_Translation_with_Conditional_Adversarial_Networks","277411157_Deep_Learning","222297362_From_music_tracks_to_Google_maps_Who_owns_computer-generated_works","351031171_Do_Androids_Dream_of_Electric_Copyright_Comparative_Analysis_of_Originality_in_Artificial_Intelligence_Generated_WorksComparative_Analysis_of_Originality_in_Artificial_Intelligence_Generated_Works","331795533_Machine_Learning_in_Physical_Verification_Mask_Synthesis_and_Physical_Design","327122287_Authors_and_Machines","319770355_Generative_Adversarial_Nets","311610841_Image_Style_Transfer_Using_Convolutional_Neural_Networks","284476553_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","254561635_Allocating_Ownership_Rights_in_Computer-Generated_Works"]}