{"id":"339876869_Towards_a_smarter_directional_data_aggregation_in_VANETs","abstract":"In the last decade, Vehicular Ad hoc NETworks (VANETs) have attracted researchers, automotive companies and public governments, as a new communication technology to improve the safety of transportation systems aiming at offering smooth driving and safer roads. In this respect, a new Traffic Information System (TIS) has benefited from VANET services. The ultimate goal of a TIS consists in properly informing vehicles about road traffic conditions in order to reduce traffic jams and consequently CO2 emission while increasing the user comfort. To fulfil these goals, traffic information data or Floating Car data (FCD) must be efficiently exchanged between mobile vehicles by avoiding as far as possible the broadcast storm problem. In this respect, data aggregation appears as an interesting approach allowing to integrate FCD messages to generate a summary (or aggregate), which undoubtedly leads to reduce network traffic. We introduce, in this paper, a new data aggregation protocol, called Smart Directional Data Aggregation (SDDA). The main idea behind our SDDA protocol is to select the most pertinent FCD messages that must be aggregated. To this end, we rely on three filters: The first one is based on the vehicle’s directions. Indeed, every vehicle aggregates only FCD messages corresponding to its direction. Furthermore, it stores, carries and forwards uninteresting data. The second one is carried out by using road speed limitation. The third one relies on a suppression technique to remove duplicated FCD messages. Interestingly enough, our protocol works properly in both highway and urban conditions. The performed experiments show that SDDA outperforms the pioneering approaches of the literature in terms of effectiveness and efficiency.","authors":["Sabri Allani","Taoufik Yeferny","Richard Chbeir","Sadok Ben Ben Yahia"],"meta":["July 2020World Wide Web 23(7):1-20","DOI:10.1007/s11280-019-00749-y","Projects: Data dissemination and aggregation in VANETData dissemination and aggregation in vehicular adhoc networks"],"references":["306926715_DPMS_A_Swift_Data_Dissemination_Protocol_Based_on_Map_Splitting","281329081_Simulations_of_VANET_Scenarios_with_OPNET_and_SUMO","328087554_A_decentralized_ITS_architecture_for_efficient_distribution_of_traffic_task_management","324490447_Overcoming_Broadcast_Storm_Problem_in_a_Vehicular_Network","323566811_Advanced_VANET_information_dissemination_scheme_using_Fuzzy_logic","321578197_Context-dependent_reconfiguration_of_autonomous_vehicles_in_mixed_traffic","318433822_SDN_Enabled_5G-VANET_Adaptive_Vehicle_Clustering_and_Beamformed_Transmission_for_Aggregated_Traffic","302224141_Spatio-temporal_Network_Application","286455281_Knowledge_Based_Framework_for_Data_Aggregation_in_Vehicular_Ad_Hoc_Networks","284004820_Time-Aggregated_Graphs_for_Modeling_Spatio-temporal_Networks"]}