{"id":"339827111_Alector_A_Parallel_Corpus_of_Simplified_French_Texts_with_Alignments_of_Misreadings_by_Poor_and_Dyslexic_Readers","abstract":"In this paper, we present a new parallel corpus addressed to researchers, teachers, and speech therapists interested in text simplification as a means of alleviating difficulties in children learning to read. The corpus is composed of excerpts drawn from 79 authentic literary (tales, stories) and scientific (documentary) texts commonly used in French schools for children aged between 7 to 9 years old. The excerpts were manually simplified at the lexical, morpho-syntactic, and discourse levels in order to propose a parallel corpus for reading tests and for the development of automatic text simplification tools. A sample of 21 poor-reading and dyslexic children with an average reading delay of 2.5 years read a portion of the corpus. The transcripts of readings errors were integrated into the corpus with the goal of identifying lexical difficulty in the target population. By means of statistical testing, we provide evidence that the manual simplifications significantly reduced reading errors, highlighting that the words targeted for simplification were not only well-chosen but also substituted with substantially easier alternatives. The entire corpus is available for consultation through a web interface and available on demand for research purposes.","authors":["Nuria Gala","Anaïs Tack","Ludivine Javourey-Drevet","Thomas François"],"meta":["March 2020","Conference: Language Resources and Evaluation for Language Technologies (LREC)At: Marseille, France","Project: Reading Aids to leverage Document Accessibility for Children with Dyslexia (ANR project, 2016-2020)"],"references":["327416626_ReSyf_a_French_lexicon_with_ranked_synonyms","325448984_A_Report_on_the_Complex_Word_Identification_Shared_Task_2018","320035906_Effects_of_Lexical_Properties_on_Viewing_Time_per_Word_in_Autistic_and_Neurotypical_Readers","309675083_Reducing_lexical_complexity_as_a_tool_to_increase_text_accessibility_for_children_with_dyslexia","333571078_Technologies_for_Dyslexia","332973197_The_cognitive_foundations_of_learning_to_read_a_framework_for_preventing_and_remediating_reading_difficulties","329977722_Problems_in_Current_Text_Simplification_Research_New_Data_Can_Help","325445700_Predicting_misreadings_from_gaze_in_children_with_reading_difficulties","321510895_Matthew_Effects_in_Reading_Some_Consequences_of_Individual_Differences_in_the_Acquisition_of_Literacy","316467902_Automatic_Text_Simplification"]}