{"id":"339821179_Spam_Review_Detection_Using_the_Linguistic_and_Spammer_Behavioral_Methods","abstract":"Online reviews regarding different products or services have become the main source to determine public opinions. Consequently, manufacturers and sellers are extremely concerned with customer reviews as these have a direct impact on their businesses. Unfortunately, to gain profits or fame, spam reviews are written to promote or demote targeted products or services. This practice is known as review spamming. In recent years, the spam review detection problem has gained much attention from communities and researchers, but still there is a need to perform experiments on real-world large-scale review datasets. This can help to analyze the impact of widespread opinion spam in online reviews. In this work, two different spam review detection methods have been proposed: (1) Spam Review Detection using Behavioral Method (SRD-BM) utilizes thirteen different spammer’s behavioral features to calculate the review spam score which is then used to identify spammers and spam reviews, and (2) Spam Review Detection using Linguistic Method (SRD-LM) works on the content of the reviews and utilizes transformation, feature selection and classification to identify the spam reviews. Experimental evaluations are conducted on a real-world Amazon review dataset which analyze 26.7 million reviews and 15.4 million reviewers. The evaluations show that both proposed models have significantly improved the detection process of spam reviews. Specifically, SRD-BM achieved 93.1% accuracy whereas SRD-LM achieved 88.5% accuracy in spam review detection. Comparatively, SRD-BM achieved better accuracy because it works on utilizing rich set of spammers behavioral features of review dataset which provides in-depth analysis of spammer behaviour. Moreover, both proposed models outperformed existing approaches when compared in terms of accurate identification of spam reviews. To the best of our knowledge, this is the first study of its kind which uses large-scale review dataset to analyze different spammers' behavioral features and linguistic method utilizing different available classifiers.","authors":["Naveed Hussain","Hamid Turab Mirza","Ibrar Hussain","Faiza Iqbal"],"meta":["March 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2979226"],"references":["330883986_Spam_review_detection_using_spiral_cuckoo_search_clustering_method","329467463_Finding_Rotten_Eggs_A_Review_Spam_Detection_Model_using_Diverse_Feature_Sets","325704794_Detecting_opinion_spams_through_supervised_boosting_approach","325175591_Measuring_Customer_Agility_from_Online_Reviews_Using_Big_Data_Text_Analytics","321752233_A_Novel_User-based_Spam_Review_Detection","332134292_Learning_to_Detect_Deceptive_Opinion_Spam_A_Survey","326354710_Spam_Detection_Using_Rating_and_Review_Processing_Method_Proceedings_of_ICSICCS_2017_Volume_2","324118177_Detecting_Review_Manipulation_on_Online_Platforms_with_Hierarchical_Supervised_Learning","318928493_Review_Spam_Detection_Using_Opinion_Mining","318741461_Handling_Cold-Start_Problem_in_Review_Spam_Detection_by_Jointly_Embedding_Texts_and_Behaviors"]}