{"id":"339995962_Epidemiology_causes_clinical_manifestation_and_diagnosis_prevention_and_control_of_coronavirus_disease_COVID-19_during_the_early_outbreak_period_A_scoping_review","abstract":"Background\nThe coronavirus disease (COVID-19) has been identified as the cause of an outbreak of respiratory illness in Wuhan, Hubei Province, China beginning in December 2019. As of 31 January 2020, this epidemic had spread to 19 countries with 11 791 confirmed cases, including 213 deaths. The World Health Organization has declared it a Public Health Emergency of International Concern.\nMethods\nA scoping review was conducted following the methodological framework suggested by Arksey and O’Malley. In this scoping review, 65 research articles published before 31 January 2020 were analyzed and discussed to better understand the epidemiology, causes, clinical diagnosis, prevention and control of this virus. The research domains, dates of publication, journal language, authors’ affiliations, and methodological characteristics were included in the analysis. All the findings and statements in this review regarding the outbreak are based on published information as listed in the references.\nResults\nMost of the publications were written using the English language (89.2%). The largest proportion of published articles were related to causes (38.5%) and a majority (67.7%) were published by Chinese scholars. Research articles initially focused on causes, but over time there was an increase of the articles related to prevention and control. Studies thus far have shown that the virus’ origination is in connection to a seafood market in Wuhan, but specific animal associations have not been confirmed. Reported symptoms include fever, cough, fatigue, pneumonia, headache, diarrhea, hemoptysis, and dyspnea. Preventive measures such as masks, hand hygiene practices, avoidance of public contact, case detection, contact tracing, and quarantines have been discussed as ways to reduce transmission. To date, no specific antiviral treatment has proven effective; hence, infected people primarily rely on symptomatic treatment and supportive care.\nConclusions\nThere has been a rapid surge in research in response to the outbreak of COVID-19. During this early period, published research primarily explored the epidemiology, causes, clinical manifestation and diagnosis, as well as prevention and control of the novel coronavirus. Although these studies are relevant to control the current public emergency, more high-quality research is needed to provide valid and reliable ways to manage this kind of public health emergency in both the short- and long-term.","authors":["Sasmita Poudel","Sha Meng","Yu-Ju Wu","Yu-Ping Mao"],"meta":["March 2020Infectious Diseases of Poverty 9(1)","DOI:10.1186/s40249-020-00646-x","Project: COVID-19"],"references":["339087690_Incubation_period_of_2019_novel_coronavirus_2019-nCoV_infections_among_travellers_from_Wuhan_China_20-28_January_2020","338957194_The_digestive_system_is_a_potential_route_of_2019-nCov_infection_A_bioinformatics_analysis_based_on_single-cell_transcriptomes","338932518_Pattern_of_early_human-to-human_transmission_of_Wuhan_2019_novel_coronavirus_2019-nCoV_December_2019_to_January_2020","338904336_Early_Transmission_Dynamics_in_Wuhan_China_of_Novel_Coronavirus-Infected_Pneumonia","338876058_Breaking_down_of_the_healthcare_system_Mathematical_modelling_for_controlling_the_novel_coronavirus_2019-nCoV_outbreak_in_Wuhan_China","340004217_Evolution_of_the_novel_coronavirus_from_the_ongoing_Wuhan_outbreak_and_modeling_of_its_spike_protein_for_risk_of_human_transmission","338958716_Nowcasting_and_forecasting_the_potential_domestic_and_international_spread_of_the_2019-nCoV_outbreak_originating_in_Wuhan_China_a_modelling_study","338933612_Genomic_characterisation_and_epidemiology_of_2019_novel_coronavirus_implications_for_virus_origins_and_receptor_binding","338931536_Epidemiological_and_clinical_characteristics_of_99_cases_of_2019_novel_coronavirus_pneumonia_in_Wuhan_China_a_descriptive_study","338900267_Updated_understanding_of_the_outbreak_of_2019_novel_coronavirus_2019-nCoV_in_Wuhan_China"]}