{"id":"339949151_Wolverine_Occupancy_Spatial_Distribution_and_Monitoring_Design","abstract":"In the western United States, wolverines (Gulo gulo) typically occupy high‐elevation habitats. Because wolverine populations occur in vast, remote areas across multiple states, biologists have an imperfect understanding of this species' current distribution and population status. The historical extirpation of the wolverine, a subsequent period of recovery, and the lack of a coordinated monitoring program in the western United States to determine their current distribution further complicate understanding of their population status. We sought to define the limits to the current distribution, identify potential gaps in distribution, and provide a baseline dataset for future monitoring and analysis of factors contributing to changes in distribution of wolverines across 4 western states. We used remotely triggered camera stations and hair snares to detect wolverines across randomly selected 15‐km × 15‐km cells in Idaho, Montana, Washington, and Wyoming, USA, during winters 2016 and 2017. We used spatial occupancy models to examine patterns in wolverine distribution. We also examined the influence of proportion of the cell containing predicted wolverine habitat, human‐modified land, and green vegetation, and area of the cluster of contiguous sampling cells. We sampled 183 (28.9%) of 633 cells that comprised a suspected wolverine range in these 4 states and we detected wolverines in 59 (32.2%) of these 183 sampled cells. We estimated that 268 cells (42.3%; 95% CI = 182–347) of the 633 cells were used by wolverines. Proportion of the cell containing modeled wolverine habitat was weakly positively correlated with wolverine occupancy, but no other covariates examined were correlated with wolverine occupancy. Occupancy rates (ψ) were highest in the Northern Continental Divide Ecosystem (ψ range = 0.8–1), intermediate in the Cascades and Central Mountains of Idaho (ψ range = 0.4–0.6), and lower in the Greater Yellowstone Ecosystem (ψ range = 0.1–0.3). We provide baseline data for future surveys of wolverine along with a design and protocol to conduct those surveys. © 2020 The Authors. The Journal of Wildlife Management published by Wiley Periodicals, Inc. on behalf of The Wildlife Society. Wolverines occupy most of the predicted habitat in Idaho, Montana, Washington, and Wyoming; occupancy probability is highest in the Northern Continental Divide Ecosystem and declines to the south and west. We provide a monitoring design for wolverines across the region.","authors":["Paul Lukacs","Diane Evans Mack","Robert Inman","Justin A. Gude"],"meta":["March 2020Journal of Wildlife Management 84(75)","DOI:10.1002/jwmg.21856"],"references":["334139661_CPW_Photo_Warehouse_a_custom_database_to_facilitate_archiving_identifying_summarizing_and_managing_photo_data_collected_from_camera_traps","324968084_Modelling_broad-scale_wolverine_occupancy_in_a_remote_boreal_region_using_multi-year_aerial_survey_data","322361205_Long-Distance_Wolverine_Dispersal_from_Wyoming_to_Historic_Range_in_Colorado","316698067_Bayesian_Population_Analysis_Using_WinBUGS","313665854_Monitoring_for_conservation","308704258_Trade-offs_and_efficiencies_in_optimal_budget-constrained_multispecies_corridor_networks","286949799_The_Normalized_Difference_Vegetation_Index","275630660_Range_Extension_of_the_Wolverine_in_Montana","269808050_Developing_priorities_for_metapopulation_conservation_at_the_landscape_scale_Wolverines_in_the_Western_United_States","264491371_Inferring_Geographic_Isolation_of_Wolverines_in_California_Using_Historical_DNA"]}