{"id":"339975443_Finger_Movement_Classification_Based_on_Statistical_and_Frequency_Features_Extracted_from_Surface_EMG_Signals","abstract":"Anatomization of EMG signals is one of the building blocks of modern prostheses. As the goal is to build robotic arms whose functions are identical to the natural ones, EMG signals produced from various hand gestures and finger movements have received much attention in recent times. Surface EMG signals collected from the upper hand muscles show specific patterns for a particular finger movement, which is also true for combined (more than one) finger movements. Utilizing Digital Signal Processing (DSP), and Machine Learning (ML) techniques this paper proposes a novel method to distinguish among various EMG signals generated from ten different hand gestures. To reduce complexity and make the signals more understandable to the algorithm statistical and frequency features were extracted from the raw EMG signals and used for classification. In order to prove the effectiveness of the method, it was tested on a practical EMG dataset and the results of the experiments are presented.","authors":["Chyon Krishno Bhattachargee","Niloy Sikder","Md. Tariq Hasan","Abdullah Nahid"],"meta":["July 2019","DOI:10.1109/IC4ME247184.2019.9036671","Conference: 2019 International Conference on Computer, Communication, Chemical, Materials and Electronic Engineering (IC4ME2)At: Rajshahi, Bangladesh"],"references":["332258326_Fault_Diagnosis_of_Induction_Motor_Bearing_Using_Cepstrum-based_Preprocessing_and_Ensemble_Learning_Algorithm","331246033_Fault_Diagnosis_of_Motor_Bearing_Using_Ensemble_Learning_Algorithm_with_FFT-based_Preprocessing","224811437_Restoration_of_grasp_following_paralysis_through_brain-controlled_stimulation_of_muscles","49809090_Online_Myoelectric_Control_of_a_Dexterous_Hand_Prosthesis_by_Transradial_Amputees","10879377_Classification_of_finger_activation_for_use_in_a_robotic_prosthesis_arm","257403904_Toward_improved_control_of_prosthetic_fingers_using_surface_electromyogram_EMG_signals","224694299_Neural_Networks_for_Online_Classification_of_Hand_and_Finger_Movements_Using_Surface_EMG_signals"]}