{"id":"339999367_Cognizant_Multitasking_in_Multi-Objective_Multifactorial_Evolution_MO-MFEA-II","abstract":"Humans have the ability to identify recurring patterns in diverse situations encountered over a lifetime, constantly understanding relationships between tasks and efficiently solving them through knowledge reuse. The capacity of artificial intelligence systems to mimic such cognitive behaviors for effective problem solving is deemed invaluable, particularly when tackling real world problems where speed and accuracy are critical. Recently , the notion of evolutionary multitasking has been explored as a means of solving multiple optimization tasks simultaneously using a single population of evolving individuals. In the presence of similarities (or even partial overlaps) between high quality solutions of related optimization problems, the resultant scope for inter-task genetic transfer often leads to significant performance speedup-as the cost of re-exploring overlapping regions of the search space is reduced. While multitasking solvers have led to recent success stories, a known shortcoming of existing methods is their inability to adapt the extent of transfer in a principled manner. Thus, in the absence of any prior knowledge about the relationships between optimization functions, a threat of predominantly negative (harmful) transfer prevails. With this in mind, the current paper presents a realization of a cognizant evolutionary multitasking engine within the domain of multi-objective optimization. Our proposed algorithm learns inter-task relationships based on overlaps in the probabilistic search distributions derived from data generated during the course of multitasking-and accordingly adapts the extent of genetic transfers online. The efficacy of the method is substantiated on multi-objective benchmark problems as well as a practical case study of knowledge transfers from low fidelity optimization tasks to substantially reduce the cost of high fidelity optimization.","authors":["Kavitesh Kumar Bali","Abhishek Gupta","Yew Soon Ong","Ps Tan"],"meta":["March 2020IEEE transactions on systems, man, and cybernetics. Part B, Cybernetics: a publication of the IEEE Systems, Man, and Cybernetics Society"],"references":["331729696_Multifactorial_Evolutionary_Algorithm_With_Online_Transfer_Parameter_Estimation_MFEA-II","338205374_Multi-objective_Multi-tasking_Optimization_Based_on_Incremental_Learning","336992737_Multifactorial_Optimization_via_Explicit_Multipopulation_Evolutionary_Framework","336423802_Surrogate-Assisted_Evolutionary_Framework_with_Adaptive_Knowledge_Transfer_for_Multi-Task_Optimization","336004240_A_Multiobjective_Multifactorial_Optimization_Algorithm_based_on_Decomposition_and_Dynamic_Resource_Allocation_Strategy","335079238_Automating_Knowledge_Transfer_with_Multi-Task_Optimization","335063179_A_multi-objective_multi-factorial_evolutionary_algorithm_with_reference-point-based_approach","333590944_An_Adaptive_Archive-Based_Evolutionary_Framework_for_Many-Task_Optimization","331690515_Self-Regulated_Evolutionary_Multitask_Optimization","331264091_Optimized_Path_Planning_for_Inspection_by_Unmanned_Aerial_Vehicles_Swarm_with_Energy_Constraints"]}