{"id":"339975674_Privacy_and_Cryptocurrencies_-_A_Systematic_Literature_Review","abstract":"Our transaction history in the current centralized banking system has the ability to reveal a lot of private information for each spender, both to the banking system itself, but also to those entities that surround it (e.g., governments, industry etc). Examples of leaking information constitute the amounts spent, the goods on which the amounts were spent, the spending locations and the users we exchange money with. This knowledge is powerful in the hands of those who have it, and can be used in multiple ways, not always to our benefit. Cryptocurrencies, such as the famous Bitcoin, were proposed as a means to address the limitations of centralized banking systems and to offer its users privacy with regards to their transactional data. In this work, we perform a systematic literature review on the realm of privacy for electronic currencies.We present the development of digital money from electronic cash to cryptocurrencies and focus on the techniques that are employed to enhance user-privacy. Furthermore, we present flaws of the current cryptocurrency systems, which reduce the privacy of the cryptocurrency users. Finally, we describe three research directions to enhance privacy for cryptocurrencies: transaction propagation mechanisms, succinct ZK proof systems without a trusted setup, and specialised trustless zero-knowledge proofs.","authors":["Lasse Herskind","Panagiota Katsikouli","Nicola Dragoni"],"meta":["March 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2980950"],"references":["346217007_Towards_a_Formally_Verified_Implementation_of_the_MimbleWimble_Cryptocurrency_Protocol","327484523_Network_Layer_Aspects_of_Permissionless_Blockchains","341076281_Transparent_SNARKs_from_DARK_Compilers","341075451_Marlin_Preprocessing_zkSNARKs_with_Universal_and_Updatable_SRS","339262499_Map-Z_Exposing_the_Zcash_Network_in_Times_of_Transition","338899379_Tracing_transactions_across_cryptocurrency_ledgers","333352401_BitFlow_Enabling_real-time_cash-flow_evaluations_through_blockchain","328919824_A_survey_on_privacy_protection_in_blockchain_system","327529465_An_Empirical_Analysis_of_Anonymity_in_Zcash","327478929_Monero_Ring_Attack_Recreating_Zero_Mixin_Transaction_Effect"]}