{"id":"339917434_Selective_exposure_shapes_the_Facebook_news_diet","abstract":"The social brain hypothesis approximates the total number of social relationships we are able to maintain at 150. Similar cognitive constraints emerge in several aspects of our daily life, from our mobility to the way we communicate, and might even affect the way we consume information online. Indeed, despite the unprecedented amount of information we can access online, our attention span still remains limited. Furthermore, recent studies have shown that online users are more likely to ignore dissenting information, choosing instead to interact with information adhering to their own point of view. In this paper, we quantitatively analyse users’ attention economy in news consumption on social media by analysing 14 million users interacting with 583 news outlets (pages) on Facebook over a time span of six years. In particular, we explore how users distribute their activity across news pages and topics. On the one hand, we find that, independently of their activity, users show a tendency to follow a very limited number of pages. On the other hand, users tend to interact with almost all the topics presented by their favoured pages. Finally, we introduce a taxonomy accounting for users’ behaviour to distinguish between patterns of selective exposure and interest. Our findings suggest that segregation of users in echo chambers might be an emerging effect of users’ activity on social media and that selective exposure—i.e. the tendency of users to consume information adhering to their preferred narratives—could be a major driver in their consumption patterns.","authors":["Matteo Cinelli","Emanuele Brugnoli","Ana Lucía Schmidt","Fabiana Zollo"],"meta":["March 2020PLoS ONE 15(3):e0229129","DOI:10.1371/journal.pone.0229129"],"references":["334741975_Strategies_and_limitations_in_app_usage_and_human_mobility","331929628_Opinion_dynamics_on_interacting_networks_Media_competition_and_social_influence","331929555_Homophily_and_polarization_in_the_age_of_misinformation","330692358_PopRank_Ranking_pages'_impact_and_users'_engagement_on_Facebook","328705415_The_geographic_embedding_of_online_echo_chambers_Evidence_from_the_Brexit_campaign","318982142_A_network_approach_to_topic_models","318661348_Debunking_in_a_world_of_tribes","331930605_Mapping_Social_Dynamics_on_Facebook_The_Brexit_Debate","328303346_A_simple_and_general_exponential_family_framework_for_partial_membership_and_factor_analysis","316712634_Social_Media_and_Fake_News_in_the_2016_Election"]}