{"id":"339982049_Integration_of_the_ImageJ_Ecosystem_in_KNIME_Analytics_Platform","abstract":"Open-source software tools are often used for the analysis of scientific image data due to their flexibility and transparency in dealing with rapidly evolving imaging technologies. The complex nature of image analysis problems frequently requires many tools to be used in conjunction, including image processing and analysis, data processing, machine learning and deep learning, statistical analysis of the results, visualization, correlation to heterogeneous but related data, and more. However, the development, and therefore application, of these computational tools is impeded by a lack of integration across platforms. Integration of tools goes beyond convenience, as it is impractical for one tool to anticipate and accommodate the current and future needs of every user. This problem is emphasized in the field of bioimage analysis, where various rapidly emerging methods are quickly being adopted by researchers. ImageJ is a popular open-source image analysis platform, with contributions from a worldwide community resulting in hundreds of specialized routines for a wide array of scientific tasks. ImageJ's strength lies in its accessibility and extensibility, allowing researchers to easily improve the software to solve their image analysis tasks. However, ImageJ is not designed for the development of complex end-to-end image analysis workflows. Scientists are often forced to create highly specialized and hard-to-reproduce scripts to orchestrate individual software fragments and cover the entire life cycle of an analysis of an image dataset. KNIME Analytics Platform, a user-friendly data integration, analysis, and exploration workflow system, was designed to handle huge amounts of heterogeneous data in a platform-agnostic, computing environment and has been successful in meeting complex end-to-end demands in several communities, such as cheminformatics and mass spectrometry. Similar needs within the bioimage analysis community led to the creation of the KNIME Image Processing extension, which integrates ImageJ into KNIME Analytics Platform, enabling researchers to develop reproducible and scalable workflows, integrating a diverse range of analysis tools. Here, we present how users and developers alike can leverage the ImageJ ecosystem via the KNIME Image Processing extension to provide robust and extensible image analysis within KNIME workflows. We illustrate the benefits of this integration with examples, as well as representative scientific use cases.","authors":["Christian Dietz","Curtis Rueden","Stefan Helfrich","Ellen T. A. Dobson"],"meta":["March 2020Frontiers in Computer Science 2","DOI:10.3389/fcomp.2020.00008"],"references":["333882914_Scientific_Community_Image_Forum_A_discussion_forum_for_scientific_image_software","329192630_Content-aware_image_restoration_pushing_the_limits_of_fluorescence_microscopy","325344547_The_Galaxy_platform_for_accessible_reproducible_and_collaborative_biomedical_analyses_2018_update","318738093_KNIME_for_reproducible_cross-domain_analysis_of_life_science_data","312620721_ImageJ2_ImageJ_for_the_next_generation_of_scientific_image_data","321364739_SpotLearn_Convolutional_Neural_Network_for_Detection_of_Fluorescence_In_Situ_Hybridization_FISH_Signals_in_High-Throughput_Imaging_Approaches","318742596_Workflows_for_Microscopy_Image_Analysis_and_Cellular_Phenotyping","315776891_Trainable_Weka_Segmentation_A_machine_learning_tool_for_microscopy_pixel_classification","315500016_Fluorescence-Based_High-Throughput_and_Targeted_Image_Acquisition_and_Analysis_for_Phenotypic_Screening","313135166_Purification_and_characterization_of_a_human_prostate_tissue-specific_antigen"]}