{"id":"339913249_Minecraft_As_A_Tool_for_Engaging_Children_in_Urban_Planning_A_Case_study_in_Tirol_Town_Brazil","abstract":"The purpose of this paper is to explore the potential of Minecraft's game environment for urban planning with older and younger children in a public school in Tirol town, Brazil. Minecraft is employed as an innovative tool to tackle the present lack of engagement and involvement of key societal actors such as children and young people in urban planning. Thus, how can games support children to co-design their future city? Which heritage values do they represent graphically in the game environment? Geogames are games that provide a visualization of a real spatial context and in this study, Minecraft is the tool which we use to explore youth engagement. We designed two experiments, which tested Minecraft as a geogame environment for engaging young people in urban planning. These experiments were conducted with children, who emerged as active emancipated actors to bring their values to the planning practice. The playtesting results revealed the potential of Minecraft to keep children engaged in the design workshop, as well as their relevant ludic ability to co-create walkable, green, and interactive places. New research questions arose about the potential of creating a culture of planning among children in order to motivate other social actors to share responsibilities for sustainable development and management.","authors":["Bruno de Andrade","Alenka Poplin","Ítalo Sousa de Sena"],"meta":["March 2020International Journal of Geo-Information 9(170):1-19","DOI:10.3390/ijgi9030170","Projects: Minecraft as a tool for developing geotourism and geoconservation initiativesMinecraft as a geogame to co-create heritage values and co-design alternative futures with childrenGeodesign com Crianças (Geodesign with Children)"],"references":["321036560_Defining_a_Geogame_Genre_Using_Core_Concepts_of_Games_Play_and_Geographic_Information_and_Thinking","316721649_Geocraft_as_a_Means_to_Support_the_Development_of_Smart_Cities_Getting_the_People_of_the_Place_Involved_-_Youth_Included_-","311396629_I_valori_del_patrimonio_territoriale_un'analisi_sui_discendenti_di_immigrati_germanici_in_un'area_montana_di_Espirito_Santo_Brasile","309846575_Representando_o_Patrimonio_Territorial_com_Tecnologia_da_Geoinformacao_Experimento_em_Santa_Leopoldina_Espirito_Santo_Brasil","301232882_Mining_Learning_and_Crafting_Scientific_Experiments_A_Literature_Review_on_the_Use_of_Minecraft_in_Education_and_Research","337363579_O_planejamento_a_crianca_e_o_jogo_o_geodesign_na_identificacao_de_valores_cotidianos_e_simbolicos_no_territorio","336858600_The_urban_revolution","329648357_Critical_Play_Radical_Game_Design","322551783_Minecraft_in_Support_of_Teaching_Sustainable_Spatial_Planning_in_Secondary_Education_Lessons_learned_from_the_Marker_Wadden-project","304632817_Civic_Crafting_in_Urban_Planning_Public_Consultation_Exploring_Minecraft's_Potential"]}