{"id":"339982105_Brain-Region_Specific_Metabolic_Abnormalities_in_Parkinson's_Disease_and_Levodopa-Induced_Dyskinesia","abstract":"Several lines of evidence point to alteration in brain metabolic homeostasis in Parkinson’s disease (PD) and levodopa-induced dyskinesia (LID), yet the metabolic mechanism in different brain regions underlying PD and LID remains largely unknown. The present study aimed to uncover the metabolic pathways across anatomical regions in the brain of PD and LID. Using an NMR-based metabolomic approach, we generated the metabolomics profiling data from six different brain regions of PD rats and following the onset of LIDs. The diversity of metabolite patterns across the brain and its relation to PD and LID were further investigated through principal component analysis (PCA) and multivariate general linear model. Compared with control rats, dopamine loss in PD rats produced a marked and persistent metabolic disturbance in neurotransmitter metabolism and energy pathway, resulting in a metabolic imbalance among different brain regions. In LID rats, levodopa replacement did not restore the midbrain-striatum metabolic crosstalk and metabolic disturbance throughout the brain was involved in levodopa related involuntary movements. Most notably, the midbrain and right cortex were identified as the primary regions of metabolic abnormalities in PD and LID rats. Neurochemical differences in metabolic phenotypes were mainly defined by various neurotransmitters including glutamate, glutamine and aspartate. Accordingly, we found that the PD and LID rats exhibited lower levels of synaptophysin (SYP), a marker for synaptic plasticity, compared with control rats. These findings provide key insights into the metabolic mechanism underlying PD and LID by defining brain-region specific metabolic phenotype, with implications for developing targeted therapies.","authors":["Changwei Yang","Tingting Zhang","Wuqiong Wang","Yilan Xiang"],"meta":["March 2020Frontiers in Aging Neuroscience 12","DOI:10.3389/fnagi.2020.00075"],"references":["335073608_A_vicious_cycle_of_b_amyloid-dependent_neuronal_hyperactivation","333587899_Molecular_Mechanisms_Underlying_How_Sialyllactose_Intervention_Promotes_Intestinal_Maturity_by_Upregulating_GDNF_Through_a_CREB-Dependent_Pathway_in_Neonatal_Piglets","333515770_Gutting_the_brain_of_inflammation_A_key_role_of_gut_microbiome_in_human_umbilical_cord_blood_plasma_therapy_in_Parkinson's_disease_model","333370917_NMR-Based_Metabolomic_Approach_Tracks_Potential_Serum_Biomarkers_of_Disease_Progression_in_Patients_with_Type_2_Diabetes_Mellitus","331019075_Novel_Approaches_for_the_Treatment_of_Alzheimer's_and_Parkinson's_Disease","330965799_Changes_and_Significance_of_SYP_and_GAP-43_Expression_in_the_Hippocampus_of_CIH_Rats","330400131_Regulation_of_dopamine_neurotransmission_from_serotonergic_neurons_by_ectopic_expression_of_the_dopamine_D2_autoreceptor_blocks_levodopa-induced_dyskinesia","330331742_Recent_advances_and_perspectives_of_metabolomics-based_investigations_in_Parkinson's_disease","333504936_Brain-specific_NRSF_deficiency_aggravates_dopaminergic_neurodegeneration_and_impairs_neurogenesis_in_the_MPTP_mouse_model_of_Parkinson's_disease","332890119_Pathophysiological_clues_to_therapeutic_applications_of_glutamate_mGlu5_receptor_antagonists_in_levodopa-induced_dyskinesia"]}