{"id":"339979237_Patterns_in_Mainstream_Programming_Games","abstract":"Studies have found serious games to be good tools for programming education. As an outcome from such research, several game solutions for learning computer programming have appeared. Most of these games are only used in the research field where only a few are published and made available for the public. There are however numerous examples of programming games in commercial stores that have reached a large audience.\nThis article presents a systematic review of publicly available and popular programming games. It analyses which fundamental software development concepts, as defined by the ACM/IEEE Computer Science Curricula, are represented in these games and identifies game design patterns used to represent these concepts.\nThis study shows that fundamental programming concepts and programming methods have a good representation in mainstream games. There is however a lack of games addressing data structures, algorithms and design. There is a strong domination of puzzle games. Only two of the 20 studied games belong to a different genre. The eleven game design patterns identified in this study have potential to contribute to future efforts in creating engaging serious games for programming education.","authors":["Ander Areizaga Blanco","Henrik Engström"],"meta":["March 2020International Journal of Serious Games 7(1):97-126","DOI:10.17083/ijsg.v7i1.335"],"references":["326002159_Training_Computational_Thinking_through_board_games_The_case_of_Crabs_Turtles","324923032_An_Empirical_Study_of_Game_Reviews_on_the_Steam_Platform","323944796_Studying_the_consistency_of_star_ratings_and_the_complaints_in_1_2-star_user_reviews_for_top_free_cross-platform_Android_and_iOS_apps","319133976_RoboBUG_A_Serious_Game_for_Learning_Debugging_Techniques","274309848_Computational_Thinking","326559394_jAVANT-GARDE_A_Cross-Platform_Serious_Game_for_an_Introduction_to_Programming_With_Java","326005808_Formative_evaluation_of_an_adaptive_game_for_engaging_learners_of_programming_concepts_in_K-12","317158625_Remaining_trouble_spots_with_computational_thinking","315999801_Flow_experience_in_game_based_learning_-_a_systematic_literature_review","310622334_Code_Lab_-_A_Game_That_Teaches_High_Level_Programming_Languages"]}