{"id":"339925323_Knowledge_Structure_Analysis_on_Educational_Technology_Based_on_Citation_Analysis","abstract":"Educational technology is a new subject that integrates the merits of multiple disciplines. Under the trend of interdisciplinary integration, it is very meaningful to explore the knowledge exchange between disciplines, clarify the structure of each discipline, and thus promote the development of educational technology. Extracting data from eight core journals on educational technology, this paper investigates the integration between educational technology and other disciplines from the perspectives of references and citations. The disciplines were divided by the standard of China National Knowledge Infrastructure (CNKI). The results show that: educational technology has a stable disciplinary structure, featuring a high self-citation rate (i.e. the tendency to cite the literature within the discipline); educational technology has frequent knowledge exchanges with pedagogy-related disciplines, and exerts a major impact on the other secondary disciplines of pedagogy; educational technology actively absorbs the knowledge of other disciplines, and communicates frequently with external disciplines like psychology, computer science, library and information science.","authors":["Junxiao Liu","Xiangzeng Meng","Changsheng Chen"],"meta":["March 2020International Journal of Emerging Technologies in Learning (iJET) 15(05):171","DOI:10.3991/ijet.v15i05.13331"],"references":["323620053_Interdisciplinary_education_a_case_study","256042199_Has_Management_Studies_Lost_Its_Way_Ideas_for_More_Imaginative_and_Innovative_Research","220365153_Measuring_researcher_interdisciplinarity","309723581_Identifying_Interdisciplinary_Research_Collaboration_in_Instructional_Technology","308532939_Editorial-On_the_Intellectual_Structure_and_Evolution_of_ISR","286014466_New_perspective_to_educational_technology_Interdisciplinary_cooperation_an_example_of_faculties_of_education_and_engineering","262582253_Foundations_of_educational_technology_integrative_approaches_and_interdisciplinary_perspectives","244954311_A_Conceptual_Vocabulary_of_Interdisciplinary_Science","220435647_A_Study_of_the_Evolution_of_Interdisciplinarity_in_Library_and_Information_Science_Using_Three_Bibliometric_Methods","45885016_Can_Scientific_Journals_be_Classified_in_Terms_of_Aggregated_Journal-Journal_Citation_Relations_using_the_Journal_Citation_Reports"]}