{"id":"339923848_A_Collaborative_Approach_Toward_Scientific_Paper_Recommendation_Using_Citation_Context","abstract":"Researchers face difficulties in finding relevant papers to their research interest as the number of scientific publication is rapidly increasing on the web. Scientific paper recommenders have emerged as a leading solution to help researchers by automatically suggesting relevant and useful publications. Several approaches have been proposed on improving recommender systems. However, most existing approaches depend on priori user profiles, and thus they cannot recommend papers to new user. Furthermore, the existing approaches utilize non-public contextual information, and thus it cannot adequately find similarities between papers due to copyright restrictions. Also, the existing approaches consider only single level paper-citation relation to identify similarities between papers. Considering the above challenges, this paper presents a collaborative filtering based recommendation approach for scientific papers that does not depend on priori user profiles and which utilizes only public contextual information. Using citation context, we utilized 2-level paper-citation relations to find hidden associations between papers. The rational underlying this approach is that, two papers are co-occurred with same cited paper(s) and two papers are co-occurring with same citing paper(s) are significantly similar to some extent. To evaluate the performance of the proposed approach, publicly available datasets are used to conduct extensive experiments. The experimental results demonstrate that the proposed approach has significantly outperforms the baseline approaches in terms of precision, recall, F1, mean average precision, and mean reciprocal rank, which are commonly used information retrieval metrics. The novelty of this study is that, with the proposed approach, researchers are able to find relevant and useful publications over the internet regardless of their previous research experiences and research area.","authors":["Nazmus Sakib","Rodina Ahmad","Khalid Haruna"],"meta":["March 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2980589"],"references":["335942244_SwICS_Section-wise_In-Text_Citation_Score","333838071_Personalized_Scientific_Paper_Recommendation_Based_on_Heterogeneous_Graph_Representation","330077673_Scientific_Paper_Recommendation_A_Survey","338214405_User's_Research_Interests_Based_Paper_Recommendation_System_A_Deep_Learning_Approach","331416607_A_Hybrid_Approach_Toward_Research_Paper_Recommendation_Using_Centrality_Measures_and_Author_Ranking","329409943_Joint_Model_Feature_Regression_and_Topic_Learning_for_Global_Citation_Recommendation","328010049_A_LSTM_Based_Model_for_Personalized_Context-Aware_Citation_Recommendation","327006373_Low-Rank_and_Sparse_Matrix_Factorization_for_Scientific_Paper_Recommendation_in_Heterogeneous_Network","326705010_User_Profile_Based_Paper_Recommendation_System","325449250_Content-Based_Citation_Recommendation","320252671_A_collaborative_approach_for_research_paper_recommender_system","316856783_Meta-Path-Based_Ranking_with_Pseudo_Relevance_Feedback_on_Heterogeneous_Graph_for_Citation_Recommendation","322058583_Query-Focused_Personalized_Citation_Recommendation_With_Mutually_Reinforced_Ranking","320574165_Academic_paper_recommender_system_using_multilevel_simultaneous_citation_networks","318072359_Exploiting_Fine-Grained_Co-Authorship_for_Personalized_Citation_Recommendation"]}