{"id":"339923047_Coronavirus_Goes_Viral_Quantifying_the_COVID-19_Misinformation_Epidemic_on_Twitter","abstract":"Background Since the beginning of the coronavirus disease 2019 (COVID-19) epidemic, misinformation has been spreading uninhibited over traditional and social media at a rapid pace. We sought to analyze the magnitude of misinformation that is being spread on Twitter (Twitter, Inc., San Francisco, CA) regarding the coronavirus epidemic. Materials and methods We conducted a search on Twitter using 14 different trending hashtags and keywords related to the COVID-19 epidemic. We then summarized and assessed individual tweets for misinformation in comparison to verified and peer-reviewed resources. Descriptive statistics were used to compare terms and hashtags, and to identify individual tweets and account characteristics. Results The study included 673 tweets. Most tweets were posted by informal individuals/groups (66%), and 129 (19.2%) belonged to verified Twitter accounts. The majority of included tweets contained serious content (91.2%); 548 tweets (81.4%) included genuine information pertaining to the COVID-19 epidemic. Around 70% of the tweets tackled medical/public health information, while the others were pertaining to sociopolitical and financial factors. In total, 153 tweets (24.8%) included misinformation, and 107 (17.4%) included unverifiable information regarding the COVID-19 epidemic. The rate of misinformation was higher among informal individual/group accounts (33.8%, p: <0.001). Tweets from unverified Twitter accounts contained more misinformation (31.0% vs 12.6% for verified accounts, p: <0.001). Tweets from healthcare/public health accounts had the lowest rate of unverifiable information (12.3%, p: 0.04). The number of likes and retweets per tweet was not associated with a difference in either false or unverifiable content. The keyword \"COVID-19\" had the lowest rate of misinformation and unverifiable information, while the keywords \"#2019_ncov\" and \"Corona\" were associated with the highest amount of misinformation and unverifiable content respectively. Conclusions Medical misinformation and unverifiable content pertaining to the global COVID-19 epidemic are being propagated at an alarming rate on social media. We provide an early quantification of the magnitude of misinformation spread and highlight the importance of early interventions in order to curb this phenomenon that endangers public safety at a time when awareness and appropriate preventive actions are paramount.","authors":["Ramez Kouzy","Joseph Abi Jaoude","Afif Kraitem","Molly B. El Alam"],"meta":["March 2020Cureus 12(3)","DOI:10.7759/cureus.7255"],"references":["339484038_Characteristics_of_and_Important_Lessons_From_the_Coronavirus_Disease_2019_COVID-19_Outbreak_in_China_Summary_of_a_Report_of_72_314_Cases_From_the_Chinese_Center_for_Disease_Control_and_Prevention","338816497_A_Novel_Coronavirus_from_Patients_with_Pneumonia_in_China_2019","328326703_The_biggest_pandemic_risk_Viral_misinformation","315496585_Yellow_fever_outbreaks_and_Twitter_Rumors_and_misinformation","312945318_What_Are_People_Tweeting_about_Zika_An_Exploratory_Study_Concerning_Symptoms_Treatment_Transmission_and_Prevention","266949228_Ebola_Twitter_and_misinformation_A_dangerous_combination","339097416_What_next_for_the_coronavirus_response","332583111_Counteracting_Health_Misinformation_A_Role_for_Medical_Journals","329053535_Protecting_the_Value_of_Medical_Science_in_the_Age_of_Social_Media_and_Fake_News","328948094_Addressing_Health-Related_Misinformation_on_Social_Media"]}