{"id":"339945831_Control_Design_Stability_Analysis_and_Traffic_Flow_Implications_of_CACC_Systems_with_Compensation_of_Communication_Delay","abstract":"Communication delay is detrimental to the performance of cooperative adaptive cruise control (CACC) systems. In this paper, we incorporate communication delay explicitly into control design and propose a delay-compensating CACC. In this new CACC system, the semi-constant time gap (Semi-CTG) policy, which is modified on the basis of the widely-used CTG policy, is employed by a linear feedback control law to regulate the spacing error. The semi-CTG policy uses historical information of the predecessor instead of its current information. By doing so, communication delay is fully compensated, which leads to better stability performance. Three stability properties – local stability, string stability, as well as traffic flow stability – are analyzed. The local stability and string stability of the proposed CACC system are guaranteed with desired time gap as small as the communication delay. Both theoretical analysis and simulation results show that the delay-compensating CACC has better string stability and traffic flow stability than the widely-used CACC system. Furthermore, the proposed CACC system also shows the potential in improving traffic throughput and fuel efficiency. Robustness of the proposed system against uncertainties of sensor delay and vehicle dynamics is also verified with simulation.","authors":["Yu Zhang","Yu Bai","Jia Hu","Meng Wang"],"meta":["March 2020Transportation Research Record Journal of the Transportation Research Board","DOI:10.1177/0361198120918873","Project: Cooperative Automation"],"references":["339945776_Semi-constant_Spacing_Policy_for_Leader-Predecessor-Follower_Platoon_Control_via_Delayed_Measurements_Synchronization","324680703_Infrastructure_assisted_adaptive_driving_to_stabilise_heterogeneous_vehicle_strings","320886660_Application_of_Predictor_Feedback_to_Compensate_Time_Delays_in_Connected_Cruise_Control","310972854_Delay-compensating_strategy_to_enhance_string_stability_of_Adaptive_Cruise_Controlled_vehicles","331245655_Reinforcement-Learning-Based_Cooperative_Adaptive_Cruise_Control_of_Buses_in_the_Lincoln_Tunnel_Corridor_With_Time-Varying_Topology","321664158_Predictor-Based_Adaptive_Cruise_Control_Design","320122435_An_Adaptive_Spacing_Policy_Guaranteeing_String_Stability_in_Multi-Brand_Ad_Hoc_Platoons","318895702_Rolling_horizon_stochastic_optimal_control_strategy_for_ACC_and_CACC_under_uncertainty","315858875_To_Delay_or_Not_to_Delay-Stability_of_Connected_Cruise_Control","309325027_Predictor-based_adaptive_cruise_control_design"]}