{"id":"340070989_Smartphone_Apps_in_the_Context_of_Tinnitus_Systematic_Review","abstract":"Smartphones containing sophisticated high-end hardware and offering high computational capabilities at extremely manageable costs have become mainstream and an integral part of users’ lives. Widespread adoption of smartphone devices has encouraged the development of many smartphone applications, resulting in a well-established ecosystem, which is easily discoverable and accessible via respective marketplaces of differing mobile platforms. These smartphone applications are no longer exclusively limited to entertainment purposes but are increasingly established in the scientific and medical field. In the context of tinnitus, the ringing in the ear, these smartphone apps range from relief, management, self-help, all the way to interfacing external sensors to better understand the phenomenon. In this paper, we aim to bring forth the smartphone applications in and around tinnitus. Based on the PRISMA guidelines, we systematically analyze and investigate the current state of smartphone apps, that are directly applied in the context of tinnitus. In particular, we explore Google Scholar, CiteSeerX, Microsoft Academics, Semantic Scholar for the identification of scientific contributions. Additionally, we search and explore Google’s Play and Apple’s App Stores to identify relevant smartphone apps and their respective properties. This review work gives (1) an up-to-date overview of existing apps, and (2) lists and discusses scientific literature pertaining to the smartphone apps used within the context of tinnitus.","authors":["Muntazir Mehdi","Constanze Riha","Patrick Neff","Albi Dode"],"meta":["March 2020Sensors 20(6):1725","DOI:10.3390/s20061725"],"references":["333793367_The_Age-Related_Central_Auditory_Processing_Disorder_Silent_Impairment_of_the_Cognitive_Ear","332136536_A_Mobile_Phone-Based_Approach_for_Hearing_Screening_of_School-Age_Children_Cross-Sectional_Validation_Study","332028151_Investigating_the_Efficacy_of_an_Individualized_AlphaDelta_Neurofeedback_Protocol_in_the_Treatment_of_Chronic_Tinnitus","331859955_Editorial_Towards_an_Understanding_of_Tinnitus_Heterogeneity","353658458_Improved_Methods_for_Evaluating_Noise_Exposure_and_Hearing_Loss","334994761_Towards_Automated_Smart_Mobile_Crowdsensing_for_Tinnitus_Research","333933561_Assessing_mindfulness-based_cognitive_therapy_intervention_for_tinnitus_using_behavioural_measures_and_structural_MRI_a_pilot_study","333138952_The_Relationship_of_Tinnitus_Hyperacusis_and_Hearing_Loss","332814625_Smart_mobile_crowdsensing_for_tinnitus_research_student_research_abstract","332237355_'Internet_of_Ears'_and_Hearables_for_Hearing_Loss_Prevention"]}