{"id":"340097343_Dimension_Reduction_and_Clustering_Models_for_Single-Cell_RNA_Sequencing_Data_A_Comparative_Study","abstract":"With recent advances in single-cell RNA sequencing, enormous transcriptome datasets have been generated. These datasets have furthered our understanding of cellular heterogeneity and its underlying mechanisms in homogeneous populations. Single-cell RNA sequencing (scRNA-seq) data clustering can group cells belonging to the same cell type based on patterns embedded in gene expression. However, scRNA-seq data are high-dimensional, noisy, and sparse, owing to the limitation of existing scRNA-seq technologies. Traditional clustering methods are not effective and efficient for high-dimensional and sparse matrix computations. Therefore, several dimension reduction methods have been introduced. To validate a reliable and standard research routine, we conducted a comprehensive review and evaluation of four classical dimension reduction methods and five clustering models. Four experiments were progressively performed on two large scRNA-seq datasets using 20 models. Results showed that the feature selection method contributed positively to high-dimensional and sparse scRNA-seq data. Moreover, feature-extraction methods were able to promote clustering performance, although this was not eternally immutable. Independent component analysis (ICA) performed well in those small compressed feature spaces, whereas principal component analysis was steadier than all the other feature-extraction methods. In addition, ICA was not ideal for fuzzy C-means clustering in scRNA-seq data analysis. K-means clustering was combined with feature-extraction methods to achieve good results.","authors":["Chao Feng","Shufen Liu","Hao Zhang","Renchu Guan"],"meta":["March 2020International Journal of Molecular Sciences 21(6):2181","DOI:10.3390/ijms21062181"],"references":["335161602_Multi-Objective_Optimized_Fuzzy_Clustering_for_Detecting_Cell_Clusters_from_Single-Cell_Expression_Profiles","334003603_Unified_single-cell_analysis_of_testis_gene_regulation_and_pathology_in_5_mouse_strains","332225839_Ultrafast_clustering_of_single-cell_flow_cytometry_data_using_FlowGrid","331407210_An_atlas_of_the_aging_lung_mapped_by_single_cell_transcriptomics_and_deep_tissue_proteomics","334774018_Single-Cell_RNA-Seq_with_Waterfall_Reveals_Molecular_Cascades_underlying_Adult_Neurogenesis","334231864_Data_imbalance_in_CRISPR_off-target_prediction","331788748_Single-cell_transcriptome_analysis_of_Physcomitrella_leaf_cells_during_reprogramming_using_microcapillary_manipulation","330218138_Challenges_in_unsupervised_clustering_of_single-cell_RNA-seq_data","329323892_Comprehensive_review_of_the_identification_of_essential_genes_using_computational_methods_focusing_on_feature_implementation_and_assessment","329220255_Non-negative_matrix_factorization_based_modeling_and_training_algorithm_for_multi-label_learning"]}