{"id":"340015274_Based_on_mathematical_epidemiology_and_evolutionary_game_theory_which_is_more_effective_Quarantine_or_isolation_policy","abstract":"Outbreaks of repeated pandemics and heavy epidemics are daunting\nthreats to human life. This study aims at investigating the dynamics of disease conferring temporary or waning immunity with several forced-control policies aided by vaccination game theory. Considering an infinite and well-mixed homogeneous population, our proposed model further illustrates the significance of introducing two well-known forced control techniques, namely, quarantine and isolation, in order to model the dynamics of an infectious disease that spreads within a human population where pre-emptive vaccination has partially been taken before the epidemic season begins. Moreover, we carefully examine the combined effects of these two types (pre-emptive and forced) of protecting measures using the SEIR-type epidemic model. An in-depth investigation based on evolutionary game theory numerically quantifies the weighing impact of individuals’ vaccinating decisions to improve the efficacy of forced control policies leading up to the relaxation of the epidemic spreading severity. A deterministic SVEIR model, including vaccinated (V) and exposed (E) states,\nis proposed having no spatial structure while implementing these intervention techniques. This study uses a mixed control strategy relying on quarantine and isolation policies to quantify the optimum requirement of vaccines for eradicating disease prevalence completely from human societies. Furthermore, our theoretical study justifies the fact that adopting forced control policies significantly reduces the required level of vaccination to suppress emerging\ndisease prevalence, and it also confirms that the joint policy works even better when the epidemic outbreak takes place at a higher transmission rate. Research reveals that the isolation policy is a better disease attenuation tool than the quarantine policy, especially in endemic regions where the disease progression rate is relatively higher. However, a meager progression rate gradually weakens\nthe speed of an epidemic outbreak and, therefore, applying a moderate level of control policies is sufficient to restore the disease-free state. Essentially, positive measures (pre-emptive vaccination) regulate the position of the critical line between two phases, whereas exposed provisions (quarantine or isolation) are rather dedicated to mitigating the disease spreading in endemic regions. Thus, an optimal interplay between these two types of intervention techniques works\nremarkably well in attenuating the epidemic size. Despite having advanced on the development of new vaccines and control strategies to mitigate epidemics, many diseases like measles, tuberculosis, Ebola, and flu are still persistent. Here, we present a dynamic analysis of the SVEIR model using mean-field theory to develop a simple but efficient strategy for epidemic control based on the simultaneous application of the quarantine and isolation policies.","authors":["Muntasir Alam","K. M. Ariful Kabir","Jun Tanimoto"],"meta":["March 2020Journal of Statistical Mechanics Theory and Experiment 2020(3):033502","DOI:10.1088/1742-5468/ab75ea","Project: Human vaccinating behavior"],"references":["333564828_A_game_theoretic_approach_to_discuss_the_positive_secondary_effect_of_vaccination_scheme_in_an_infinite_and_well-mixed_population_Author_names_and_affiliations","332428417_Dynamical_Behaviors_for_Vaccination_can_Suppress_Infectious_Disease_-A_Game_Theoretical_Approach","331323174_To_vaccinate_or_not_to_vaccinate_A_comprehensive_study_of_vaccination-subsidizing_policies_with_multi-agent_simulations_and_mean-field_modeling","330890779_Modeling_the_impact_of_quarantine_during_an_outbreak_of_Ebola_virus_disease","330212608_Effect_of_information_spreading_to_suppress_the_disease_contagion_on_the_epidemic_vaccination_game","330070246_Three-strategy_and_four-strategy_model_of_vaccination_game_introducing_an_intermediate_protecting_measure","329950688_Analysis_of_SIR_epidemic_model_with_information_spreading_of_awareness","328373165_Relationship_Between_Media_Coverage_and_MMR_Vaccination_Uptake_in_Denmark_Retrospective_Study_Preprint","328218200_Grand_Challenges_in_Social_Physics_In_Pursuit_of_Moral_Behavior","327373785_Various_error_settings_bring_different_noise-driven_effects_on_network_reciprocity_in_spatial_prisoner's_dilemma"]}