{"id":"340031009_Automatic_optic_nerve_head_localization_and_cup-to-disc_ratio_detection_using_state-of-the-art_deep-learning_architectures","abstract":"Computer vision has greatly advanced recently. Since AlexNet was first introduced, many modified deep learning architectures have been developed and they are still evolving. However, there are few studies comparing these architectures in the field of ophthalmology. This study compared the performance of various state-of-the-art deep-learning architectures for detecting the optic nerve head and vertical cup-to-disc ratio in fundus images. Three different architectures were compared: YOLO V3, ResNet, and DenseNet. We compared various aspects of performance, which were not confined to the accuracy of detection but included, as well, the processing time, diagnostic performance, effect of the graphic processing unit (GPU), and image resolution. In general, as the input image resolution increased, the classification accuracy, localization error, and diagnostic performance all improved, but the optimal architecture differed depending on the resolution. The processing time was significantly accelerated with GPU assistance; even at the high resolution of 832 × 832, it was approximately 170 ms, which was at least 26 times slower without GPU. The choice of architecture may depend on the researcher’s purpose when balancing between speed and accuracy. This study provides a guideline to determine deep learning architecture, optimal image resolution, and the appropriate hardware.","authors":["Keunheung Park","Jinmi Kim","Ji-Woong Lee"],"meta":["March 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-62022-x","Project: Glaucoma and Artificial Intelligence"],"references":["328887872_Performance_of_Deep_Learning_Architectures_and_Transfer_Learning_for_Detecting_Glaucomatous_Optic_Neuropathy_in_Fundus_Photographs","319284613_The_One_Hundred_Layers_Tiramisu_Fully_Convolutional_DenseNets_for_Semantic_Segmentation","317052324_Automatic_Optic_Disc_Abnormality_Detection_in_Fundus_Images_A_Deep_Learning_Approach","314091779_Segmentation_of_optic_disc_fovea_and_retinal_vasculature_using_a_single_convolutional_neural_network","327825882_HybridNet_A_fast_vehicle_detection_system_for_autonomous_driving","324387691_YOLOv3_An_Incremental_Improvement","320964885_SpeedAccuracy_Trade-Offs_for_Modern_Convolutional_Object_Detectors","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313072169_Automatic_Feature_Learning_for_Glaucoma_Detection_Based_on_Deep_Learning","311609041_Deep_Residual_Learning_for_Image_Recognition"]}