{"id":"340039476_Question_classification_based_on_Bloom's_taxonomy_cognitive_domain_using_modified_TF-IDF_and_word2vec","abstract":"The assessment of examination questions is crucial in educational institutes since examination is one of the most common methods to evaluate students’ achievement in specific course. Therefore, there is a crucial need to construct a balanced and high-quality exam, which satisfies different cognitive levels. Thus, many lecturers rely on Bloom’s taxonomy cognitive domain, which is a popular framework developed for the purpose of assessing students’ intellectual abilities and skills. Several works have been proposed to automatically handle the classification of questions in accordance with Bloom’s taxonomy. Most of these works classify questions according to specific domain. As a result, there is a lack of technique of classifying questions that belong to the multi-domain areas. The aim of this paper is to present a classification model to classify exam questions based on Bloom’s taxonomy that belong to several areas. This study proposes a method for classifying questions automatically, by extracting two features, TFPOS-IDF and word2vec. The purpose of the first feature was to calculate the term frequency-inverse document frequency based on part of speech, in order to assign a suitable weight for essential words in the question. The second feature, pre-trained word2vec, was used to boost the classification process. Then, the combination of these features was fed into three different classifiers; K-Nearest Neighbour, Logistic Regression, and Support Vector Machine, in order to classify the questions. The experiments used two datasets. The first dataset contained 141 questions, while the other dataset contained 600 questions. The classification result for the first dataset achieved an average of 71.1%, 82.3% and 83.7% weighted F1-measure respectively. The classification result for the second dataset achieved an average of 85.4%, 89.4% and 89.7% weighted F1-measure respectively. The finding from this study showed that the proposed method is significant in classifying questions from multiple domains based on Bloom’s taxonomy.","authors":["Manal Mohammed","Nazlia Omar"],"meta":["March 2020PLoS ONE 15(3):e0230442","DOI:10.1371/journal.pone.0230442"],"references":["335355568_Word2vec_convolutional_neural_networks_for_classification_of_news_articles_and_tweets","324715156_Malay_sentiment_analysis_based_on_combined_classification_approaches_and_Senti-lexicon_algorithm","322293125_Term_weighting_scheme_for_short-text_classification_Twitter_corpuses","321849235_Automatic_text_summarization_of_Wikipedia_articles_View_Document","319287093_Swarm_intelligence-based_Approach_for_Educational_Data_Classification","318644366_Question_Classification_in_Persian_using_Word_Vectors_and_Frequencies","328926201_Question_Classification_Based_on_Bloom's_Taxonomy_Using_Enhanced_TF-IDF","323063451_Question_classification_using_support_vector_machine_with_hybrid_feature_extraction_method","320123534_Information_Retrieval_with_Reinforced_Word_Classes","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space"]}