{"id":"340047672_How_many_images_do_I_need_Understanding_how_sample_size_per_class_affects_deep_learning_model_performance_metrics_for_balanced_designs_in_autonomous_wildlife_monitoring","abstract":"Deep learning (DL) algorithms are the state of the art in automated classification of wildlife camera trap images. The challenge is that the ecologist cannot know in advance how many images per species they need to collect for model training in order to achieve their desired classification accuracy. In fact there is limited empirical evidence in the context of camera trapping to demonstrate that increasing sample size will lead to improved accuracy.\nIn this study we explore in depth the issues of deep learning model performance for progressively increasing per class (species) sample sizes. We also provide ecologists with an approximation formula to estimate how many images per animal species they need for certain accuracy level a priori. This will help ecologists for optimal allocation of resources, work and efficient study design.\nIn order to investigate the effect of number of training images; seven training sets with 10, 20, 50, 150, 500, 1000 images per class were designed. Six deep learning architectures namely ResNet-18, ResNet-50, ResNet-152, DnsNet-121, DnsNet-161, and DnsNet-201 were trained and tested on a common exclusive testing set of 250 images per class. The whole experiment was repeated on three similar datasets from Australia, Africa and North America and the results were compared. Simple regression equations for use by practitioners to approximate model performance metrics are provided. Generalizes additive models (GAM) are shown to be effective in modelling DL performance metrics based on the number of training images per class, tuning scheme and dataset.\nOverall, our trained models classified images with 0.94 accuracy (ACC), 0.73 precision (PRC), 0.72 true positive rate (TPR), and 0.03 false positive rate (FPR). Variation in model performance metrics among datasets, species and deep learning architectures exist and are shown distinctively in the discussion section. The ordinary least squares regression models explained 57%, 54%, 52%, and 34% of expected variation of ACC, PRC, TPR, and FPR according to number of images available for training. Generalised additive models explained 77%, 69%, 70%, and 53% of deviance for ACC, PRC, TPR, and FPR respectively.\nPredictive models were developed linking number of training images per class, model, dataset and performance metrics. The ordinary least squares regression and Generalised additive models developed provides a practical toolbox to estimate model performance with respect to different numbers of training images.","authors":["Saleh Shahinfar","Paul Douglas Meek","Gregory Falzon"],"meta":["March 2020Ecological Informatics 57(1):101085","DOI:10.1016/j.ecoinf.2020.101085"],"references":["341406236_Deep_Learning_on_Small_Datasets_without_Pre-Training_using_Cosine_Loss","341402225_Synthetic_Examples_Improve_Generalization_for_Rare_Classes","338199404_ClassifyMe_A_Field-Scouting_Software_for_the_Identification_of_Wildlife_in_Camera_Trap_Images","329210510_Machine_learning_to_classify_animal_species_in_camera_trap_images_Applications_in_ecology","328615447_Underwater_Fish_Detection_Using_Deep_Learning_for_Water_Power_Applications","347039520_Learning_Data_Augmentation_Strategies_for_Object_Detection","337572568_Camera_Trapping_Technology_and_Related_Advances_into_the_New_Millennium","330472111_Making_inference_with_messy_citizen_science_data_when_are_data_accurate_enough_and_how_can_they_be_improved","328128212_Identifying_Animal_Species_in_Camera_Trap_Images_using_Deep_Learning_and_Citizen_Science","327606950_Generalized_Additive_Models","326110768_Detecting_Mammals_in_UAV_Images_Best_Practices_to_address_a_substantially_Imbalanced_Dataset_with_Deep_Learning","319770123_Densely_Connected_Convolutional_Networks","318541546_Best_practices_and_software_for_the_management_and_sharing_of_camera_trap_data_for_small_and_large_scales_studies","318337409_Revisiting_Unreasonable_Effectiveness_of_Data_in_Deep_Learning_Era","319770183_Imagenet_classification_with_deep_convolutional_neural_networks"]}