{"id":"340098176_Usability_Requirements_Extraction_Method_from_Software_Document","abstract":"Extracting the usability requirements are crucial during requirements review and requirements validation for different purposes. Usability requirements are hard to be determined until the real user has experienced the software. It is even more challenging when these usability requirements are documented in natural language, which has an inconsistent and unrestricted structure. Automated requirements extraction has been widely studied to facilitate the process of requirements checking. Nevertheless, the accuracy of requirements extraction method still can be improved. Thus, this paper has presented the usability keywords repository that followed the ISO 9126 and ISO 25010 usability category and has gone through the expert validation process. The usability requirement extraction method is moreover enhanced with extra procedures in conforming the usability requirement statement. First, each statement in the requirement document is checked if there is a keyword usability, whereby the keywords used must match with the usability keyword repository. In order to ensure that the selected statement is a usability requirement, the corresponding usability keyword position should be after the fixed auxiliary verbs. The performance of the improved usability requirements extraction method is then evaluated using precision, recall and accuracy.","authors":["Rohayanti Hassan","Noor Atikah Amira Fauzi","Shahreen Kasim","Herman Khalid Omer"],"meta":["February 2020International Journal of Software Engineering and Knowledge Engineering 30(02):171-189","DOI:10.1142/S0218194020500084"],"references":["303505533_Challenge_of_validation_in_requirements_engineering","261096381_Pattern-based_security_requirements_specification_using_ontologies_and_boilerplates","228095933_Web_Data_Extraction_Applications_and_Techniques_A_Survey","286028621_The_Parameterized_Safety_Requirements_Templates","283114592_Documenting_requirements_specifications_using_natural_language_requirements_boilerplates","281739255_Automated_extraction_and_visualization_of_quality_concerns_from_requirements_specifications","277345431_Automated_Checking_of_Conformance_to_Requirements_Templates_Using_Natural_Language_Processing","269302285_Requirements_elicitation_Issues_and_challenges","261451408_Automated_extraction_of_non-functional_requirements_in_available_documentation","234124963_Text_Extraction_from_Scene_Images_by_Character_Appearance_and_Structure_Modeling","220298996_Common_Requirements_Problems_Their_Negative_Consequences_and_the_Industry_Best_Practices_to_Help_Solve_Them"]}