{"id":"340072277_COVID-19_Challenges_to_GIS_with_Big_Data","abstract":"The outbreak of the 2019 novel coronavirus disease (COVID-19) has caused more than 100,000 people to be infected and has caused thousands of deaths. Currently, the number of infections and deaths is still increasing rapidly. COVID-19 seriously threatens human health, production, life, social functioning and international relations, and has caused widespread concern around the globe. In the fight against COVID-19, geographic information systems (GIS) and big data technologies have played an important role in many aspects, including the rapid aggregation of multisource big data, rapid visualization of epidemic information, spatial tracking of COVID-19, prediction of regional transmission, identification of the spatial allocation of risk and selection of the control level, balance and management of the supply and demand of medical resources, social-emotional guidance and panic elimination, the provision of solid spatial information support for decision-making about COVID-19 prevention and control, measures formulation, and assessment of the effectiveness of COVID-19 prevention and control. GIS has developed and matured relatively quickly and has a complete technological route for data preparation, platform construction, model construction, and map production. However, for the struggle against COVID-19, the main challenge is finding strategies to adjust traditional technical methods and improve speed and accuracy to provide accurate information for rapid social management. Additionally, in the era of big data, data no longer come mainly from the government but are gathered from more diverse enterprises. As a result, the use of GIS faces difficulties in data acquisition and the integration of heterogeneous data, which requires governments, businesses, and academic institutions to jointly promote the formulation of relevant policies. At the technical level, spatial analysis methods for big data are in the ascendancy. Currently and for a long time in the future, the development of GIS should be strengthened to form a data-driven system for rapid knowledge acquisition, which signifies that GIS should be used to reinforce the social operation parameterization of models and methods, especially when providing support for social management.","authors":["Chenghu Zhou","Fenzhen Su","Tao Pei","An Zhang"],"meta":["March 2020Geography and Sustainability 1(1)","DOI:10.1016/j.geosus.2020.03.005"],"references":["332543949_Visualizing_the_largest_annual_human_migration_during_the_Spring_Festival_travel_season_in_China","326102060_The_rich-club_phenomenon_of_China's_population_flow_network_during_the_country's_spring_festival","282538532_Data-driven_geography","338918197_The_association_between_domestic_train_transportation_and_novel_coronavirus_outbreak_in_China_from_2019_to_2020_A_data-driven_correlational_report","321528646_Spatial_Data_Handling_in_Big_Data_Era_Select_Papers_from_the_17th_IGU_Spatial_Data_Handling_Symposium_2016","318996280_Difference_of_urban_development_in_China_from_the_perspective_of_passenger_transport_around_Spring_Festival","216876590_Crowdsourcing_geographic_information_for_disaster_response_A_research_frontier","6295242_Large-Scale_Spatial-Transmission_Models_of_Infectious_Disease","5322929_Mathematical_models_of_infectious_disease_transmission"]}