{"id":"340093005_Exploring_Factors_of_Speech_Anxiety_in_Second_Language_Classroom","abstract":"This study aims to investigate the factors affecting on English speech of undergraduate students at the SMIU, Karachi. The study prospects two aspects as outcomes of the study, one to discover what are the major issues and hindrances and another one to find their solutions for developing techniques and skills to gain confidence while speaking English as a second language in ESL classroom and in public. It will further investigate as how to help develop a wonderful speech free from speech anxiety. The study administered Likert Scale as a tool for data collection. Forty participating students were recruited from the department of Computer Science, Sindh Madressatul Islam University, Karachi. Speech anxiety is a common phenomenon amongst the students in the second language classrooms. Second language i.e., English, however, has become the lingua franca of the world. It is no longer the language of only native Britishers and Americans, rather, it is a widely spoken language by most people living in every nook & corner of the world. This study investigates as to how ESL learners turn out as nervous speakers while speaking English. Findings of the study suggest that speech anxiety seems to be an unavoidable phenomenon for ESL learners as the data reveal. In addition, this study is associated with the previous studies that there is a moderate level of Foreign Language Speech Anxiety (FLSA) amongst the Pakistani English speakers. Since English is taught from the primary level and every literate person almost understands and speaks English. Pakistani English language speakers should speak without speech anxiety, though it seems to be a part of human nature being nervous while speaking English as a second language. The students should learn how to manage speech anxiety by welcoming it and try to overcome it not by mindless imitation but by being natural in English speech.","authors":["Dr Abdul Malik Abbasi","Samreen Riaz Ahmed","Alia Farooqi","Stephon John"],"meta":["October 2019Advances in Language and Literary Studies 10(5):97","DOI:10.7575/aiac.alls.v.10n.5p.97","Project: Speech Anxiety in Second Language Learning"],"references":["338421700_ESL_Learners'_Performance_Correlates_of_Social_and_Academic_Anxiety","323241700_Investigating_Tertiary_Level_EFL_Learners'_Willingness_to_Communicate_in_English","317203111_The_Anxiety_Factors_among_Saudi_EFL_Learners_A_Study_from_English_Language_Teachers'_Perspective","312663954_Exploring_the_Causes_of_English_Language_Speaking_Anxiety_among_Postgraduate_Students_of_University_of_Balochistan_Pakistan","309722038_Investigating_Foreign_Language_Speaking_Anxiety_within_the_EFL_Learner's_Interlanguage_System_The_Case_of_Iranian_Learners","307773289_Students'_Perceptions_of_Language_Anxiety_in_Speaking_Classes","287157070_Sources_and_Levels_of_Foreign_Language_Speaking_Anxiety_of_English_as_a_Foreign_Language_University_Students_with_regard_to_Language_Proficiency_and_Gender","232604230_Social_and_Individual_Factors_in_Second_Language_Acquisition","270960243_Practical_Research_Planning_and_Design","263501160_Foreign_Language_Classroom_Anxiety"]}