{"id":"340046804_Effective_cache_replacement_strategy_ECRS_for_real-time_fog_computing_environment","abstract":"Fog Computing (FC) utilizes the resources close to the edge of the network. It supports real time applications such as healthcare, industrial systems, and intelligent traffic signs. FC needs data to be cached in various intermediate nodes to be easily found by the network. Therefore, an efficient caching scheme is essential. Data caching can improve the data availability in FC by reducing access latency and bandwidth. As nodes in FC may have similar tasks and share common interests, cooperative caching can be used to reduce the bandwidth, latency, and power consumption. The originality of this paper is concentrated on introducing an Effective Cache Replacement Strategy (ECRS) and routing algorithm for real-time FC environment with a novel cache replacement and prefetching policies. ECRS is composed of two main modules which are: (i) Path Finding Procedure: to ensure that there is a route between each pair of FNs. And (ii) Data Searching Procedure: to find the required data for the given task. ECRS divides the network into fog regions and each region has a master node that manages the communication in the fog region. Unlike other caching techniques that employ reactive routing protocols, ECRS employs a novel built-in table driven routing strategy with no additional penalties. Such behavior significantly minimizes the query delay. The secret lies in collecting the routing information during the message request forwarding, then fill the routing tables accordingly. ECRS has been compared against recent cooperative caching strategies. Experimental results have shown that ECRS achieved the maximum Cache Hit Ratio, while minimizing Average Query Delay (AQD), Average Hop Count, and the Power Consumption of the network. These results have been achieved due to the high accuracy of using fuzzy and the efficiency of using graph based routing algorithm as the graph can be easily used for finding the shortest paths in fast time. Unlike previous algorithms, ECRS achieves the least AQD. Accordingly, ECRS is a suitable algorithm in the case of real-time systems in FC which leads to load balancing.","authors":["Fatma M. Talaat","Shereen H. Ali","Ahmed Ibrahim Saleh","Hesham Arafat Ali"],"meta":["December 2020Cluster Computing 23(16)","DOI:10.1007/s10586-020-03089-z"],"references":["330916938_Effective_Load_Balancing_Strategy_ELBS_for_Real-Time_Fog_Computing_Environment_Using_Fuzzy_and_Probabilistic_Neural_Networks","325014338_A_Comparison_of_Cache_Replacement_Algorithms_for_Video_Services","323934626_A_Recommended_Replacement_Algorithm_for_the_Scalable_Asynchronous_Cache_Consistency_Scheme","320757121_Smart_Collaborative_Caching_for_Information-Centric_IoT_in_Fog_Computing","330462542_On_Resource_Pooling_and_Separation_for_LRU_Caching","329684560_ECMST_Minimal_energy_usage_competent_multicast_steiner_tree_based_route_discovery_for_mobile_ad_hoc_networks","326496258_Predictability_and_Performance_Aware_Replacement_Policy_PVISAM_for_Unified_Shared_Caches_in_Real-time_Multicores","325748762_On_Resource_Pooling_and_Separation_for_LRU_Caching","324712288_An_Improved_Web_Cache_Replacement_Algorithm_Based_on_Weighting_and_Cost","321684172_Modified_AODV_MAODV_Against_Black_Hole_in_WMN","318671352_Next_Generation_Cloud_Computing_New_Trends_and_Research_Directions","308546367_The_IoT_hub_a_fog_node_for_seamless_management_of_heterogeneous_connected_smart_objects","307658159_Cache_Replacement_Strategies_for_Mobile_Data_Caching","312255093_An_Adaptive_Cooperative_Caching_Strategy_ACCS_for_Mobile_Ad_Hoc_Networks","305673807_Fit_A_Fog_Computing_Device_for_Speech_Tele-Treatments"]}