{"id":"340061340_ANALISIS_DEL_ESTADO_DEL_PENSAMIENTO_COMPUTACIONAL_Y_EL_APRENDIZAJE_DE_LA_MATEMATICA_DISCRETA_EN_LA_UNIVERSIDAD_DE_LAS_CIENCIAS_INFORMATICAS","abstract":"La Universidad de las Ciencias Informáticas (UCI) es una institución docente que forma profesionales de la Informática que contribuyen a la informatización de la sociedad cubana. Dentro de las asignaturas que se imparten está la Matemática Discreta (MD). El Proceso de Enseñanza – Aprendizaje de la MD tiene la misión de contribuir al modo de actuación de estos profesionales, que deben caracterizarse por la capacidad de la implementación de los conceptos básicos de las ciencias de la computación para resolver problemas cotidianos, diseñar sistemas domésticos y realizar tareas rutinarias. \nA partir de observación pedagógica al Proceso de Enseñanza Aprendizaje, aplicar el Test de Pensamiento Computacional: diseño y psicometría general de la Universidad de Educación a Distancia de España, se identificaron varias dificultades, las cuales indican que existen estudiantes del primer año de la UCI que no poseen un pensamiento algorítmico básico. Hay una forma específica de pensar, de organizar ideas y representaciones, que favorece las competencias computacionales y en otras esferas. Se trata de una forma de pensar propicia para el análisis, para la organización y representación lógica. Se trata del desarrollo de un pensamiento específico: El Pensamiento Computacional (PC) definido por la Revista de Educación a Distancia (RED) en 2015 como una metodología basada en la implementación de los conceptos básicos de las ciencias de la computación para resolver problemas.\nEn el presente artículo que desean presentar la correlación existente entre el desarrollo del Pensamiento computacional y el aprendizaje de la asignatura Matemática Discreta en la UCI.\n\nPALABRAS CLAVES: Pensamiento Computacional, Algoritmización, Pensamiento Lógico.","authors":["Leandro Daniel Pérez Tamayo"],"meta":["March 2020","Project: Sistema de actividades para favorecer el pensamiento computacional desde la Matemática Discreta en la  Universidad de las Ciencias Informáticas."],"references":[]}