{"id":"340007555_Conceptual_Key_Competency_Model_for_Smart_Factories_in_Production_Processes","abstract":"Background and Purpose: The aim of the study is to develop a conceptual key competency model for smart factories in production processes, focused on the automotive industry, as innovation and continuous development in this industry are at the forefront and represent the key to its long-term success.\nMethodology : For the purpose of the research, we used a semi-structured interview as a method of data collection. Participants were segmented into three homogeneous groups, which are industry experts, university professors and secondary education teachers, and government experts. In order to analyse the qualitative data, we used the method of content analysis.\nResults : Based on the analysis of the data collected by structured interviews, we identified the key competencies that workers in smart factories in the automotive industry will need. The key competencies are technical skills, ICT skills, innovation and creativity, openness to learning, ability to accept and adapt to change, and various soft skills.\nConclusion: Our research provides insights for managers working in organisations that are transformed by Industry 4.0. For instance, human resource managers can use our results to study what competencies potential candidates need to perform well on the job, particularly in regards to planning future job profiles in regards related to production processes. Moreover, they can design competency models in a way that is coherent with the trends of Industry 4.0. Educational policy makers should design curricula that develop mentioned competencies. In the future, the results presented here can be compared and contrasted with findings obtained by applying other empirical methods.","authors":["Andrej Jerman","Andrej Bertoncelj","Gandolfo Dominici","Mirjana Pejic Bach"],"meta":["February 2020Organizacija 53(1):68-79","DOI:10.2478/orga-2020-0005"],"references":["335935603_How_Robothuman_Orchestration_Can_Help_in_an_HR_Department_A_Case_Study_From_a_Pilot_Implementation","327262309_Human_Resources_Management_Meta-Study_-_Analysis_of_Future_Competences_in_Industry_40","327248446_Managerial_early_warning_system_as_best_practice_for_project_selection_at_a_smart_factory","326017981_Review_of_Industry_40_in_the_Light_of_Sociotechnical_System_Theory_and_Competence-Based_View_A_Future_Research_Agenda_for_the_Evolute_Approach","325857465_Industry_40_Challenges_for_Business_Process_Management_and_Electronic-Commerce","324711804_Industrie_40_-_Competencies_for_a_modern_production_system","334143369_The_4th_Industrial_Revolution_Business_Models_and_Evidence_From_the_Field","332087075_The_Internet_of_Things","329242805_How_automation_is_changing_work","325065220_Big_data_analytics_and_application_for_logistics_and_supply_chain_management"]}