{"id":"340089618_COVID-19_coronavirus_vaccine_design_using_reverse_vaccinology_and_machine_learning","abstract":"To ultimately combat the emerging COVID-19 pandemic, it is desired to develop an effective and safe vaccine against this highly contagious disease caused by the SARS-CoV-2 coronavirus. Our literature and clinical trial survey showed that the whole virus, as well as the spike (S) protein, nucleocapsid (N) protein, and membrane protein, have been tested for vaccine development against SARS and MERS. We further used the Vaxign reverse vaccinology tool and the newly developed Vaxign-ML machine learning tool to predict COVID-19 vaccine candidates. The N protein was found to be conserved in the more pathogenic strains (SARS/MERS/COVID-19), but not in the other human coronaviruses that mostly cause mild symptoms. By investigating the entire proteome of SARS-CoV-2, six proteins, including the S protein and five non-structural proteins (nsp3, 3CL-pro, and nsp8-10) were predicted to be adhesins, which are crucial to the viral adhering and host invasion. The S, nsp3, and nsp8 proteins were also predicted by Vaxign-ML to induce high protective antigenicity. Besides the commonly used S protein, the nsp3 protein has not been tested in any coronavirus vaccine studies and was selected for further investigation. The nsp3 was found to be more conserved among SARS-CoV-2, SARS-CoV, and MERS-CoV than among 15 coronaviruses infecting human and other animals. The protein was also predicted to contain promiscuous MHC-I and MHC-II T-cell epitopes, and linear B-cell epitopes localized in specific locations and functional domains of the protein. Our predicted vaccine targets provide new strategies for effective and safe COVID-19 vaccine development.","authors":["Edison Ong","Mei U Wong","Anthony Huffman","Yongqun He"],"meta":["March 2020","DOI:10.1101/2020.03.20.000141"],"references":["339457119_Functional_assessment_of_cell_entry_and_receptor_usage_for_SARS-CoV-2_and_other_lineage_B_betacoronaviruses","339370344_Cryo-EM_structure_of_the_2019-nCoV_spike_in_the_prefusion_conformation","339209297_Tick-Borne_Encephalitis_Virus_Vaccines_Contain_Non-Structural_Protein_1_Antigen_and_May_Elicit_NS1-Specific_Antibody_Responses_in_Vaccinated_Individuals","338118350_VIO_ontology_classification_and_study_of_vaccine_responses_given_various_experimental_and_analytical_conditions","335414194_Anti-Tat_Immunity_in_HIV-1_Infection_Effects_of_Naturally_Occurring_and_Vaccine-Induced_Antibodies_Against_Tat_on_the_Course_of_the_Disease","331093776_Comparison_of_Open-Source_Reverse_Vaccinology_Programs_for_Bacterial_Vaccine_Antigen_Discovery","339509781_Vaxign-ML_Supervised_Machine_Learning_Reverse_Vaccinology_Model_for_Improved_Prediction_of_Bacterial_Protective_Antigens","339316654_Severe_acute_respiratory_syndrome_coronavirus_2_SARS-CoV-2_and_coronavirus_disease-2019_COVID-19_The_epidemic_and_the_challenges","338933612_Genomic_characterisation_and_epidemiology_of_2019_novel_coronavirus_implications_for_virus_origins_and_receptor_binding","334817195_Deep-learning_contact-map_guided_protein_structure_prediction_in_CASP13"]}