{"id":"340101982_Core_Outcome_Set_for_Clinical_Trials_on_Coronavirus_Disease_2019_COS-COVID","abstract":"Since its outbreak in December 2019, a series of clinical trials on Coronavirus Disease 2019 (COVID-19) have been registered or carried out. However, the significant heterogeneity and less critical outcomes of such trials may be leading to a waste of research resources. This study aimed to develop a core outcome set (COS) for clinical trials on COVID-19 in order to tackle the outcome issues. The study was conducted according to the Core Outcome Measures in Effectiveness Trials (COMET) handbook (version 1.0), a guideline for COS development. A research group was set up that included experts in respiratory and critical medicine, traditional Chinese medicine, evidence-based medicine, clinical pharmacology, and statistics, in addition to medical journal editors. Clinical trial registry websites (chictr.org.cn and clinicaltrials.gov) were searched to retrieve clinical trial protocols and outcomes in order to form an outcome pool. A total of 78 clinical trial protocols on COVID-19 were included and 259 outcomes were collected. After standardization, 132 outcomes were identified within seven different categories, of which 58 were selected to develop a preliminary outcome list for further consensus. After two rounds of Delphi survey and one consensus meeting, the most important outcomes for the different clinical classifications of COVID-19 were identified and determined to constitute the COS for clinical trials on COVID-19 (COS-COVID). The COS-COVID includes one outcome for the mild type (time to 2019-nCoV reverse transcription-polymerase chain reaction (RT-PCR) negativity), four outcomes for the ordinary type (length of hospital stay, composite events, score of clinical symptoms, and time to 2019-nCoV RT-PCR negativity), five outcomes for the severe type (composite events, length of hospital stay, arterial oxygen partial pressure (PaO2)/fraction of inspired oxygen (FiO2), duration of mechanical ventilation, and time to 2019-nCoV RT-PCR negativity), one outcome for critical type (all-cause mortality), and one outcome for rehabilitation period (pulmonary function). The COS-COVID is currently the most valuable and practical clinical outcome set for the evaluation of intervention effect, and is useful for evidence assessment and decision-making. With a deepening understanding of COVID-19 and application feedback, the COS-COVID should be continuously updated.","authors":["Xinyao Jin","Bo Pang","Junhua Zhang","Qingquan Liu"],"meta":["March 2020Engineering 6(10)","DOI:10.1016/j.eng.2020.03.002"],"references":["331032334_Core_Outcome_Set-STAndardised_Protocol_Items_the_COS-STAP_Statement","321114515_Core_Outcome_Set-STAndards_for_Development_The_COS-STAD_recommendations","318169788_The_COMET_Handbook_version_10","309280497_Core_Outcome_Set-STAndards_for_Reporting_The_COS-STAR_Statement","230621919_Developing_core_outcome_sets_for_clinical_trials_Issues_to_consider","228099500_Development_of_a_core_outcome_set_for_clinical_trials_in_childhood_asthma_a_survey_of_clinicians_parents_and_young_people","221795912_Driving_up_the_Quality_and_Relevance_of_Research_Through_the_Use_of_Agreed_Core_Outcomes"]}