{"id":"340141303_Directions_of_training_bachelors_of_pedagogical_education_to_the_basics_of_robotics","abstract":"In the context of modern vocational training of future teachers within the digitalization of education, the authors of the article consider such current direction as educational robotics. Having studied the content of the professional training of bachelors in the direction „Pedagogical Education”, offered today within the framework of Federal Standards, as well as in some experimental curricula and author ‘s approaches, the article systematizes the existing views on the problem. The authors propose options of directions, both for implementation of the recommended content of training and for possibly updated on account of inclusion of new elements in the content of training of future teachers of different profiles. The authors define targeted aspects and formulate general tasks of bachelors’ training in the context of forming their readiness for professional technical and technological activity. The result of the analysis of the subject training of bachelors of the profiles „mathematics and informatics”, „informatics and physics” directed to formation of technical and technological competence is presented. The role of educational robotics in solving problems of the formation of readiness for technical and technological activity in preparation of bachelors of pedagogical education is shown. The main directions of education to the basics of educational robotics are highlighted and the experience of implementation is presented for two training profiles „mathematics and informatics” in the university on the basis of educational practice, special discipline on the choice of the student, course and final qualification works, competitions on educational and sports robotics. This context also describes the approach and experience of the course „Basics of educational robotics” for bachelors of pedagogical education, the main result of which is the formation of professional readiness for technical and technological activities in the field of educational robotics. The authors specify this experience on the example of a bachelor with a second profile of informatics in the context of the development of digital technologies. As conclusions to the article, the authors update the study of scientific and methodological approaches to the development of the content of professional training in the field of educational robotics for bachelors of pedagogical education in other specializations.","authors":["N. I. Ryzhova","E. V. Filimonova","N. Yu. Koroleva"],"meta":["January 2019Science and School","DOI:10.31862/1819-463X-2019-6-33-45"],"references":["337282258_Information_and_Education_Systems_in_the_Context_of_Digitalization_of_Education"]}