{"id":"340103843_Comparison_between_a_wireless_dry_electrode_EEG_system_with_a_conventional_wired_wet_electrode_EEG_system_for_clinical_applications","abstract":"Dry electrode electroencephalogram (EEG) recording combined with wireless data transmission offers an alternative tool to conventional wet electrode EEG systems. However, the question remains whether the signal quality of dry electrode recordings is comparable to wet electrode recordings in the clinical context. We recorded the resting state EEG (rsEEG), the visual evoked potentials (VEP) and the visual P300 (P3) from 16 healthy subjects (age range: 26–79 years) and 16 neurological patients who reported subjective memory impairment (age range: 50–83 years). Each subject took part in two recordings on different days, one with 19 dry electrodes and another with 19 wet electrodes. They reported their preferred EEG system. Comparisons of the rsEEG recordings were conducted qualitatively by independent visual evaluation by two neurologists blinded to the EEG system used and quantitatively by spectral analysis of the rsEEG. The P100 visual evoked potential (VEP) and P3 event-related potential (ERP) were compared in terms of latency, amplitude and pre-stimulus noise. The majority of subjects preferred the dry electrode headset. Both neurologists reported that all rsEEG traces were comparable between the wet and dry electrode headsets. Absolute Alpha and Beta power during rest did not statistically differ between the two EEG systems (p > 0.05 in all cases). However, Theta and Delta power was slightly higher with the dry electrodes (p = 0.0004 for Theta and p < 0.0001 for Delta). For ERPs, the mean latencies and amplitudes of the P100 VEP and P3 ERP showed comparable values (p > 0.10 in all cases) with a similar spatial distribution for both wet and dry electrode systems. These results suggest that the signal quality, ease of set-up and portability of the dry electrode EEG headset used in our study comply with the needs of clinical applications.","authors":["Hermann Hinrichs","Michael Scholz","Anne Katrin Baum","Julia W. Y. Kam"],"meta":["March 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-62154-0"],"references":["333208400_Differences_in_spatio-temporal_distribution_of_the_visual_P3b_event-related_potential_between_young_men_and_women","332063742_Individual_EEG_measures_of_attention_memory_and_motivation_predict_population_level_TV_viewership_and_Twitter_engagement","323590138_Contact_Pressure_and_Flexibility_of_Multipin_Dry_EEG_Electrodes","323174042_Signal_Quality_Evaluation_of_Emerging_EEG_Devices","321512216_A_Preliminary_Study_on_Precision_Image_Guidance_for_Electrode_Placement_in_an_EEG_Study","320980727_Deployment_of_Mobile_EEG_Technology_in_an_Art_Museum_Setting_Evaluation_of_Signal_Quality_and_Usability","317389651_A_Multifunctional_Brain-Computer_Interface_Intended_for_Home_Use_An_Evaluation_with_Healthy_Participants_and_Potential_End_Users_with_Dry_and_Gel-Based_Electrodes","315809991_Systems_Subjects_Sessions_To_What_Extent_Do_These_Factors_Influence_EEG_Data","327596642_Systematic_comparison_between_a_wireless_EEG_system_with_dry_electrodes_and_a_wired_EEG_system_with_wet_electrodes","320315174_myBrain_a_novel_EEG_embedded_system_for_epilepsy_monitoring"]}