{"id":"340112618_Utility-Driven_Data_Analytics_on_Uncertain_Data","abstract":"Modern Internet of Things (IoT) applications generate massive amounts of data, much of them in the form of objects/items of readings, events, and log entries. Specifically, most of the objects in these IoT data contain rich embedded information (e.g., frequency and uncertainty) and different levels of importance (e.g., unit risk/utility of items, interestingness, cost, or weight). Many existing approaches in data mining and analytics have limitations, such as only the binary attribute is considered within a transaction, as well as all the objects/items having equal weights or importance. To solve these drawbacks, a novel utility-driven data analytics algorithm named HUPNU is presented in this article. As a general utility-driven uncertain data mining model, HUPNU can extract High-Utility patterns by considering both Positive and Negative unit utilities from Uncertain data. The qualified high-utility patterns can be effectively discovered for intrusion detection, risk prediction, manufacturing management, and decision-making, among others. By using the developed vertical Probability-Utility list with the positive and negative utilities structure, as well as several effective pruning strategies, experiments showed that the developed HUPNU approach with the pruning strategies performed great in mining the qualified patterns efficiently and effectively.","authors":["Wensheng Gan","Chun-Wei Jerry Lin","Han-Chieh Chao","Athanasios Vasilakos"],"meta":["March 2020IEEE Systems Journal PP(99):1-12","DOI:10.1109/JSYST.2020.2979279"],"references":["333686965_A_Survey_of_Parallel_Sequential_Pattern_Mining","329011065_Privacy_Preserving_Utility_Mining_A_Survey","322503303_A_survey_of_incremental_high-utility_itemset_mining","316371301_Mining_High-Utility_Itemsets_with_Both_Positive_and_Negative_Unit_Profits_from_Uncertain_Databases","315726003_A_Survey_of_Itemset_Mining","331238480_HUOPM_High-Utility_Occupancy_Pattern_Mining","324995134_Revenue_Maximization_on_the_Multi-grade_Product","319393506_Mining_Sequential_Patterns_Generalizations_and_Performance_Improvements","316899851_Exploring_Data_Validity_in_Transportation_Systems_for_Smart_Cities","315301578_Efficient_High_Utility_Pattern_Mining_for_Establishing_Manufacturing_Plans_With_Sliding_Window_Control"]}