{"id":"340120989_A_Novel_Hybrid_Deep_Learning_Model_for_Sentiment_Classification","abstract":"A massive use of social media platforms such as Twitter and Facebook by omnifarious organizations has increased the critical individual feedback on the situation, events, products, and services. However, sentiment classification plays an important role in the user's feedback evaluation. At present, deep learning such as long short-term memory (LSTM), gated recurrent unit (GRU), bidirectionally long short-term memory (BiLSTM) or convolutional neural network (CNN) are prevalently preferred in sentiment classification. Moreover, word embedding such as Word2Vec and FastText is closely examined in text for mapping closely related to the vectors of real numbers. However, both deep learning and word embedding methods have strengths and weaknesses. Combining the strengths of the deep learning models with that of word embedding is the key to high-performance sentiment classification in the field of natural language processing (NLP). In the present study, we propose a novel hybrid deep learning model that strategically combines different word embedding (Word2Vec, FastText, character-level embedding) with different deep learning methods (LSTM, GRU, BiLSTM, CNN). The proposed model extracts features of different deep learning methods of word embedding, combines these features and classifies texts in terms of sentiment. To verify the performance of the proposed model, several deep learning models called basic models were created to perform series of experiments. By comparing, the performance of the proposed model with that of past studies, the proposed model offers better sentiment classification performance.","authors":["Mehmet Umut Salur","Ilhan Aydin"],"meta":["April 2020IEEE Access 8:58080 - 58093","DOI:10.1109/ACCESS.2020.2982538"],"references":["338332321_Comparative_Study_of_Deep_Learning-Based_Sentiment_Classification","337732023_Sentiment_analysis_using_deep_learning_architectures_a_review","334860261_A_Hybrid_Bidirectional_Recurrent_Convolutional_Neural_Network_Attention-Based_Model_for_Text_Classification","333831339_Halal_Products_on_Twitter_Data_Extraction_and_Sentiment_Analysis_Using_Stack_of_Deep_Learning_Algorithms","333706654_A_Hybrid_CNN-LSTM_Model_for_Improving_Accuracy_of_Movie_Reviews_Sentiment_Analysis","345507615_Words_Meanings_Characters_in_Sentiment_Analysis","337851396_Integrated_CNN-_and_LSTM-DNN-based_sentiment_analysis_over_big_social_data_for_opinion_mining","334628057_A_Vibrating_Mechanism_to_Prevent_Neural_Networks_from_Overfitting","334244376_Sentiment_Analysis_of_Text_Based_on_CNN_and_Bi-directional_LSTM_Model","332702416_Sentiment_analysis_of_comment_texts_based_on_BiLSTM","330039388_Sentiment_Analysis_of_Lithuanian_Texts_Using_Traditional_and_Deep_Learning_Approaches","330727984_The_Impact_of_Preprocessing_on_Classification_Performance_in_Convolutional_Neural_Networks_for_Turkish_Text","330475261_Classifying_Sightseeing_Tweets_Using_Convolutional_Neural_Networks_with_Multi-channel_Distributed_Representation","327489605_Tibetan_Micro-Blog_Sentiment_Analysis_Based_on_Mixed_Deep_Learning","326707457_An_integrated_neural_model_for_sentence_classification"]}