{"id":"340180096_Trust_and_Distrust_as_Artifacts_of_Language_A_Latent_Semantic_Approach_to_Studying_Their_Linguistic_Correlates","abstract":"Trust and distrust are crucial aspects of human interaction that determine the nature of many organizational and business contexts. Because of socialization-borne familiarity that people feel about others, trust and distrust can influence people even when they do not know each other. Allowing that some aspects of the social knowledge that is acquired through socialization is also recorded in language through word associations, i.e., linguistic correlates, this study shows that known associations of trust and distrust can be extracted from an authoritative text. Moreover, the study shows that such an analysis can even allow a statistical differentiation between trust and distrust—something that survey research has found hard to do. Specifically, measurement items of trust and related constructs that were previously used in survey research along with items reflecting distrust were projected onto a semantic space created out of psychology textbooks. The resulting distance matrix of those items was analyzed by applying covariance-based structural equation modeling. The results confirmed known trust and distrust relationship patterns and allowed measurement of distrust as a distinct construct from trust. The potential of studying trust theory through text analysis is discussed.","authors":["David Gefen","Jorge Fresneda","Kai R. Larsen"],"meta":["March 2020Frontiers in Psychology 11","DOI:10.3389/fpsyg.2020.00561","Project: The semantic theory of survey response (STSR)"],"references":["321804167_A_Guide_to_Text_Analysis_with_Latent_Semantic_Analysis_in_R_with_Annotated_Code_Studying_Online_Reviews_and_the_Stack_Exchange_Community","318545578_Consumer_initial_trust_toward_internet-only_banks_in_France","328894713_On_the_Foundations_of_NeuroIS_Reflections_on_the_Gmunden_Retreat_2009","328299747_On_the_Use_of_Neurophysiological_Tools_in_IS_Research_Developing_a_Research_Agenda_for_NeuroIS","326278342_Exploration_of_A_Design_Battle_Using_Latent_Semantic_Analysis","325326146_Identifying_patterns_in_medical_records_through_latent_semantic_analysis","325003590_Does_Familiarity_Breed_Trust_The_Implications_of_Repeated_Ties_for_Contractual_Choice_in_Alliances","324463708_Social_identity_and_trust_in_internet-based_voting_adoption","322454471_The_failing_measurement_of_attitudes_How_semantic_determinants_of_individual_survey_responses_come_to_replace_measures_of_attitude_strength","318570227_Which_phish_get_caught_An_exploratory_study_of_individuals'_susceptibility_to_phishing"]}