{"id":"340176969_The_effect_of_control_strategies_to_reduce_social_mixing_on_outcomes_of_the_COVID-19_epidemic_in_Wuhan_China_a_modelling_study","abstract":"Background\nIn December, 2019, severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), a novel coronavirus, emerged in Wuhan, China. Since then, the city of Wuhan has taken unprecedented measures in response to the outbreak, including extended school and workplace closures. We aimed to estimate the effects of physical distancing measures on the progression of the COVID-19 epidemic, hoping to provide some insights for the rest of the world.\n\nMethods\nTo examine how changes in population mixing have affected outbreak progression in Wuhan, we used synthetic location-specific contact patterns in Wuhan and adapted these in the presence of school closures, extended workplace closures, and a reduction in mixing in the general community. Using these matrices and the latest estimates of the epidemiological parameters of the Wuhan outbreak, we simulated the ongoing trajectory of an outbreak in Wuhan using an age-structured susceptible-exposed-infected-removed (SEIR) model for several physical distancing measures. We fitted the latest estimates of epidemic parameters from a transmission model to data on local and internationally exported cases from Wuhan in an age-structured epidemic framework and investigated the age distribution of cases. We also simulated lifting of the control measures by allowing people to return to work in a phased-in way and looked at the effects of returning to work at different stages of the underlying outbreak (at the beginning of March or April).\n\nFindings\nOur projections show that physical distancing measures were most effective if the staggered return to work was at the beginning of April; this reduced the median number of infections by more than 92% (IQR 66–97) and 24% (13–90) in mid-2020 and end-2020, respectively. There are benefits to sustaining these measures until April in terms of delaying and reducing the height of the peak, median epidemic size at end-2020, and affording health-care systems more time to expand and respond. However, the modelled effects of physical distancing measures vary by the duration of infectiousness and the role school children have in the epidemic.\n\nInterpretation\nRestrictions on activities in Wuhan, if maintained until April, would probably help to delay the epidemic peak. Our projections suggest that premature and sudden lifting of interventions could lead to an earlier secondary peak, which could be flattened by relaxing the interventions gradually. However, there are limitations to our analysis, including large uncertainties around estimates of R0 and the duration of infectiousness.\n\nFunding\nBill & Melinda Gates Foundation, National Institute for Health Research, Wellcome Trust, and Health Data Research UK.","authors":["Kiesha Prem","Yang Liu","Timothy Russell","Adam J Kucharski"],"meta":["March 2020The Lancet Public Health 5(5)","DOI:10.1016/S2468-2667(20)30073-6"],"references":["341080440_Nonpharmaceutical_Measures_for_Pandemic_Influenza_in_Nonhealthcare_Settings-Social_Distancing_Measures","340957333_Epidemiology_and_transmission_of_COVID-19_in_391_cases_and_1286_of_their_close_contacts_in_Shenzhen_China_a_retrospective_cohort_study","339879905_Early_dynamics_of_transmission_and_control_of_COVID-19_a_mathematical_modelling_study","339828275_In_Vitro_Antiviral_Activity_and_Projection_of_Optimized_Dosing_Design_of_Hydroxychloroquine_for_the_Treatment_of_Severe_Acute_Respiratory_Syndrome_Coronavirus_2_SARS-CoV-2","339789266_Clinical_presentation_and_virological_assessment_of_hospitalized_cases_of_coronavirus_disease_2019_in_a_travel-associated_transmission_cluster","339716563_Epidemiology_and_Transmission_of_COVID-19_in_Shenzhen_China_Analysis_of_391_cases_and_1286_of_their_close_contacts","339466543_COVID-19_control_in_China_during_mass_population_movements_at_New_Year","339087690_Incubation_period_of_2019_novel_coronavirus_2019-nCoV_infections_among_travellers_from_Wuhan_China_20-28_January_2020","339731087_Can_we_contain_the_COVID-19_outbreak_with_the_same_measures_as_for_SARS","339522816_The_psychological_impact_of_quarantine_and_how_to_reduce_it_rapid_review_of_the_evidence","339082563_Effectiveness_of_airport_screening_at_detecting_travellers_infected_with_novel_coronavirus_2019-nCoV","339008010_The_transmissibility_of_novel_Coronavirus_in_the_early_stages_of_the_2019-20_outbreak_in_Wuhan_Exploring_initial_point-source_exposure_sizes_and_durations_using_scenario_analysis","338988918_Early_evaluation_of_the_Wuhan_City_travel_restrictions_in_response_to_the_2019_novel_coronavirus_outbreak","338932518_Pattern_of_early_human-to-human_transmission_of_Wuhan_2019_novel_coronavirus_2019-nCoV_December_2019_to_January_2020","338958716_Nowcasting_and_forecasting_the_potential_domestic_and_international_spread_of_the_2019-nCoV_outbreak_originating_in_Wuhan_China_a_modelling_study"]}