{"id":"340103483_Legal_document_similarity_a_multi-criteria_decision-making_perspective","abstract":"The vast volume of documents available in legal databases demands effective information retrieval approaches which take into consideration the intricacies of the legal domain. Relevant document retrieval is the backbone of the legal domain. The concept of relevance in the legal domain is very complex and multi-faceted. In this work, we propose a novel approach of concept based similarity estimation among court judgments. We use a graph-based method, to identify prominent concepts present in a judgment and extract sentences representative of these concepts. The sentences and concepts so mined are used to express/visualize likeness among concepts between a pair of documents from different perspectives. We also propose to aggregate the different levels of matching so obtained into one measure quantifying the level of similarity between a judgment pair. We employ the ordered weighted average (OWA) family of aggregation operators for obtaining the similarity value. The experimental results suggest that the proposed approach of concept based similarity is effective in the extraction of relevant legal documents and performs better than other competing techniques. Additionally, the proposed two-level abstraction of similarity enables informative visualization for deeper insights into case relevance.","authors":["Rupali Wagh","D. Anand"],"meta":["March 2020PeerJ Computer Science 6(3):e262","DOI:10.7717/peerj-cs.262"],"references":["325431586_Measuring_Similarity_among_Legal_Court_Case_Documents","323335099_Matching_Long_Text_Documents_via_Graph_Convolutional_Networks","321003690_Neural_information_retrieval_at_the_end_of_the_early_years","317660781_Experimenting_Word_Embeddings_in_Assisting_Legal_Review","316780438_Graph_Embedding_Techniques_Applications_and_Performance_A_Survey","328660661_Legal_Document_Retrieval_Using_Document_Vector_Embeddings_and_Deep_Learning_Proceedings_of_the_2018_Computing_Conference_Volume_2","327540102_Similarity_analysis_of_court_judgements_using_association_rule_mining_on_case_citation_data-a_case_study","322436206_Application_of_citation_network_analysis_for_improved_similarity_index_estimation_of_legal_case_documents_A_study","321306827_A_Survey_on_Network_Embedding","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space"]}