{"id":"340126931_Holobiont_Evolution_Mathematical_Model_with_Vertical_vs_Horizontal_Microbiome_Transmission","abstract":"A holobiont is a composite organism consisting of a host together with its microbiome, such as a coral with its zooxanthellae. To explain the often intimate integration between hosts and their microbiomes, some investigators contend that selection operates on holobionts as a unit and view the microbiome’s genes as extending the host’s nuclear genome to jointly comprise a hologenome. Because vertical transmission of microbiomes is uncommon, other investigators contend that holobiont selection cannot be effective because a holobiont’s microbiome is an acquired condition rather than an inherited trait. This disagreement invites a simple mathematical model to see how holobiont selection might operate and to assess its plausibility as an evolutionary force. This paper presents two variants of such a model. In one variant, juvenile hosts obtain microbiomes from their parents (vertical transmission). In the other variant, microbiomes of juvenile hosts are assembled from source pools containing the combined microbiomes of all parents (horizontal transmission). According to both variants, holobiont selection indeed causes evolutionary change in holobiont traits. Therefore, holobiont selection is plausibly an effective evolutionary force with either mode of microbiome transmission. The modeling employs two distinct concepts of inheritance, depending on the mode of microbiome transmission: collective inheritance whereby juveniles inherit a sample of the collected genomes from all parents, as contrasted with lineal inheritance whereby juveniles inherit the genomes from only their own parents. A distinction between collective and lineal inheritance also features in theories of multilevel selection.","authors":["Joan Roughgarden"],"meta":["March 2020Philosophy Theory and Practice in Biology 12(20200323)","DOI:10.3998/ptpbio.16039257.0012.002"],"references":["335325667_Matrotrophic_viviparity_constrains_microbiome_acquisition_during_gestation_in_a_live-bearing_cockroach_Diploptera_punctata","334305414_Vertical_transmission_of_sponge_microbiota_is_inconsistent_and_unfaithful","328846585_Holobiont_Evolution_Model_for_Vertical_vs_Horizontal_Microbial_Colonization","328549818_Darwinian_selection_of_host_and_bacteria_supports_emergence_of_Lamarckian-like_adaptation_of_the_system_as_a_whole","324765726_The_hologenome_concept_of_evolution_after_10_years","321141147_Holobionts_as_Units_of_Selection_and_a_Model_of_Their_Population_Dynamics_and_Evolution","320026901_Models_of_microbiome_evolution_incorporating_host_and_microbial_selection","319192020_Extended_genomes_Symbiosis_and_evolution","336005299_The_role_of_multilevel_selection_in_host_microbiome_evolution","324024258_Processes_and_patterns_of_interaction_as_units_of_selection_An_introduction_to_ITSNTS_thinking"]}