{"id":"340180793_Fusing_Logical_Relationship_Information_of_Text_in_Neural_Network_for_Text_Classification","abstract":"With the development of computer science and information science, text classification technology has been greatly developed and its application scenarios have been widened. In traditional process of text classification, the existing method will lose much logical relationship information of text. The logical relationship information of a text refers to the relationship information among different logical parts of the text, such as title, abstract, and body. When human beings are reading, they will take title as an important part to remind the central idea of the article, abstract as a brief summary of the content of the article, and body as a detailed description of the article. In most of the text classification studies, researchers concern more about the relationship among words (word frequency, semantics, etc.) and neglect the logical relationship information of text. It will lose information about the relationship among different parts (title, body, etc.) and have an influence on the performance of text classification. Therefore, we propose a text classification algorithm—fusing the logical relationship information of text in neural network (FLRIOTINN), which complements the logical relationship information into text classification algorithms. Experiments show that the effect of FLRIOTINN is better than the conventional backpropagation neural networks which does not consider the logical relationship information of text.","authors":["Heyong Wang","Zeng Dehang"],"meta":["March 2020Mathematical Problems in Engineering 2020(3):1-16","DOI:10.1155/2020/5426795"],"references":["335562395_Automatic_Stop_Word_Generation_for_Mining_Software_Artifact_Using_Topic_Model_with_Pointwise_Mutual_Information","334860261_A_Hybrid_Bidirectional_Recurrent_Convolutional_Neural_Network_Attention-Based_Model_for_Text_Classification","329513939_Utility-based_feature_selection_for_text_classification","329373371_Background_Knowledge_Based_Multi-Stream_Neural_Network_for_Text_Classification","323370594_Few-shot_learning_for_short_text_classification","322905432_Patent_Keyword_Extraction_Algorithm_Based_on_Distributed_Representation_for_Patent_Classification","321341657_CLAMP_-_a_toolkit_for_efficiently_building_customized_clinical_natural_language_processing_pipelines","319988976_Automatic_text_classification_using_BPLion-neural_network_and_semantic_word_processing","327000157_Discriminating_Between_Empirical_Studies_and_Nonempirical_Works_Using_Automated_Text_Classification","325492539_Using_Deep_Learning_for_Title-Based_Semantic_Subject_Indexing_to_Reach_Competitive_Performance_to_Full-Text"]}