{"id":"340151635_Epidemiological_parameters_of_coronavirus_disease_2019_a_pooled_analysis_of_publicly_reported_individual_data_of_1155_cases_from_seven_countries","abstract":"Background\nThe outbreak of coronavirus disease 2019 (COVID-19) has been declared a pandemic by the World Health Organization, while several key epidemiological parameters of the disease remain to be clarified. This study aimed to obtain robust estimates of the incubation period, upper limit of latent period (interval between exposure of infector and infectee), serial interval, time point of exposure and basic reproduction number (R0) of COVID-19.\nMethods\nBetween late February and early March of 2020, the individual data of laboratory confirmed cases of COVID-19 were retrieved from 10728 publicly available reports released by the health authorities of and outside China and from 1790 publications identified in PubMed and CNKI. To be eligible, a report had to contain the data that allowed for estimation of at least one parameter. As relevant data mainly came from clustering cases, the clusters for which no evidence was available to establish transmission order were all excluded to ensure accuracy of estimates. Additionally, only the cases with an exposure period spanning 3 days or less were included in the estimation of parameters involving exposure date, and a simple method for determining exposure date was adopted to ensure the error of estimates be small (< 0.3 day). Depending on specific parameters, three or four of normal, lognormal, Weibull, and gamma distributions were fitted to the datasets and the results from appropriate models were presented.\nFindings\nIn total, 1155 cases from China, Japan, Singapore, South Korea, Vietnam, Germany and Malaysia were included for the final analysis. The mean and standard deviation were 7.44 days and 4.39 days for incubation period, 2.52 days and 3.95 days for the upper limit of latent period, 6.70 days and 5.20 days for serial interval, and -0.19 day (i.e., 0.19 day before symptom onset of infector) and 3.32 days for time point of exposure. R0 was estimated to be 1.70 and 1.78 based on two different formulas. For 39 (6.64%) cases, the incubation periods were longer than 14 days. In 102 (43.78%) infector-infectee pairs, transmission occurred before the symptom onsets of infectors. In 27 (3.92%) infector-infectee pairs, symptom onsets of infectees occurred before those of infectors. Stratified analysis showed that incubation period and serial interval were consistently longer for those with less severe disease and for those whose primary cases had less severe disease. Asymptomatic transmission was also observed.\nInterpretation\nThis study obtained robust estimates of several key epidemiological parameters of COVID-19. The findings support current practice of 14-day quarantine of persons with potential exposure, but also suggest that longer monitoring periods might be needed for selected groups. The estimates of serial interval, time point of exposure and latent period provide consistent evidence on pre-symptomatic transmission. This together with asymptomatic transmission and the generally longer incubation and serial interval of less severe cases suggests a high risk of long-term epidemic in the absence of appropriate control measures.","authors":["Shujuan Ma","Jiayue Zhang","Minyan Zeng","Qingping Yun"],"meta":["March 2020","DOI:10.1101/2020.03.21.20040329","Project: Modelling COVID-19 epidemics"],"references":["339757737_Transmission_interval_estimates_suggest_pre-symptomatic_spread_of_COVID-19","339705453_Serial_interval_of_novel_coronavirus_COVID-19_infections","339581314_Clinical_Characteristics_of_Coronavirus_Disease_2019_in_China","339501738_Estimating_the_serial_interval_of_the_novel_coronavirus_disease_COVID-19_A_statistical_analysis_using_the_public_data_in_Hong_Kong_from_January_16_to_February_15_2020","339438496_Incubation_Period_and_Other_Epidemiological_Characteristics_of_2019_Novel_Coronavirus_Infections_with_Right_Truncation_A_Statistical_Analysis_of_Publicly_Available_Case_Data","339371648_Clinical_findings_in_a_group_of_patients_infected_with_the_2019_novel_coronavirus_SARS-Cov-2_outside_of_Wuhan_China_Retrospective_case_series","339828677_The_Incubation_Period_of_Coronavirus_Disease_2019_COVID-19_From_Publicly_Reported_Confirmed_Cases_Estimation_and_Application","339593539_A_family_cluster_of_SARS-CoV-2_infection_involving_11_patients_in_Nanjing_China","339419090_Presumed_Asymptomatic_Carrier_Transmission_of_COVID-19","339363661_A_Familial_Cluster_of_Infection_Associated_With_the_2019_Novel_Coronavirus_Indicating_Possible_Person-to-Person_Transmission_During_the_Incubation_Period"]}