{"id":"340115503_Artificial_Intelligence-Based_Diagnosis_of_Cardiac_and_Related_Diseases","abstract":"Automatic chest anatomy segmentation plays a key role in computer-aided disease diagnosis, such as for cardiomegaly, pleural effusion, emphysema, and pneumothorax. Among these diseases, cardiomegaly is considered a perilous disease, involving a high risk of sudden cardiac death. It can be diagnosed early by an expert medical practitioner using a chest X-Ray (CXR) analysis. The cardiothoracic ratio (CTR) and transverse cardiac diameter (TCD) are the clinical criteria used to estimate the heart size for diagnosing cardiomegaly. Manual estimation of CTR and other diseases is a time-consuming process and requires significant work by the medical expert. Cardiomegaly and related diseases can be automatically estimated by accurate anatomical semantic segmentation of CXRs using artificial intelligence. Automatic segmentation of the lungs and heart from the CXRs is considered an intensive task owing to inferior quality images and intensity variations using nonideal imaging conditions. Although there are a few deep learning-based techniques for chest anatomy segmentation, most of them only consider single class lung segmentation with deep complex architectures that require a lot of trainable parameters. To address these issues, this study presents two multiclass residual mesh-based CXR segmentation networks, X-RayNet-1 and X-RayNet-2, which are specifically designed to provide fine segmentation performance with a few trainable parameters compared to conventional deep learning schemes. The proposed methods utilize semantic segmentation to support the diagnostic procedure of related diseases. To evaluate X-RayNet-1 and X-RayNet-2, experiments were performed with a publicly available Japanese Society of Radiological Technology (JSRT) dataset for multiclass segmentation of the lungs, heart, and clavicle bones; two other publicly available datasets, Montgomery County (MC) and Shenzhen X-Ray sets (SC), were evaluated for lung segmentation. The experimental results showed that X-RayNet-1 achieved fine performance for all datasets and X-RayNet-2 achieved competitive performance with a 75% parameter reduction.","authors":["Muhammad Arsalan","Muhammad Owais","Tahir Mahmood","Jiho Choi"],"meta":["March 2020Journal of Clinical Medicine 9(3(871)):1-25","DOI:10.3390/jcm9030871","Projects: Convolutional Neural NetworkDeep learning based segmentation"],"references":["337265638_Artificial_Intelligence-Based_Thyroid_Nodule_Classification_Using_Information_from_Spatial_and_Frequency_Domains","336732207_Deep_Learning_for_Chest_Radiograph_Diagnosis_in_the_Emergency_Department","335877823_Smart_Pleural_Effusion_Drainage_Monitoring_System_Establishment_for_Rapid_Effusion_Volume_Estimation_and_Safety_Confirmation","335863478_Segmentation_of_Lung_in_Chest_Radiographs_Using_Hull_and_Closed_Polygonal_Line_Method","335755465_Aiding_the_Diagnosis_of_Diabetic_and_Hypertensive_Retinopathy_Using_Artificial_Intelligence-Based_Semantic_Segmentation","335144410_An_Accurate_Nuclei_Segmentation_Algorithm_in_Pathological_Image_Based_on_Deep_Semantic_Network","338775687_An_automatic_method_for_lung_segmentation_and_reconstruction_in_chest_X-ray_using_deep_neural_networks","335630501_OR-Skip-Net_Outer_Residual_Skip_Network_for_Skin_Segmentation_in_Non-Ideal_Situations","334995234_Instance_Segmentation_of_Anatomical_Structures_in_Chest_Radiographs","334427700_Towards_Continuous_Domain_Adaptation_For_Medical_Imaging"]}