{"id":"340238713_Speed_Control_Optimization_for_Autonomous_Vehicles_with_Metaheuristics","abstract":"The development of speed controllers under execution in autonomous vehicles within their dynamic driving task (DDT) is a traditional research area from the point of view of control techniques. In this regard, Proportional – Integral – Derivative (PID) controllers are the most widely used in order to meet the requirements of cruise control. However, fine tuning of the parameters associated with this type of controller can be complex, especially if it is intended to optimize them and reduce their characteristic errors. The objective of the work described in this paper is to evaluate the capacity of several metaheuristics for the adjustment of the parameters Kp, 1/Ti, and 1/Td of a PID controller to regulate the speed of a vehicle. To do this, an adjustment error function has been established from a linear combination of classic estimators of the goodness of the controller, such as overshoot, settling time (ts), steady-state error (ess), and the number of changes of sign of the signal (d). The error obtained when applying the controller has also been compared to a computational model of the vehicle after estimating the parameters Kp, Ki, and Kd, both for a setpoint sequence used in the adjustment of the system parameters and for a sequence not used during the adjustment, and therefore unknown by the system. The main novelty of the paper is to propose a new global error function, a function that enables the use of heuristic optimization methods for PID tuning. This optimization has been carried out by using three methods: genetic algorithms (GA), memetics algorithms (MA), and mesh adaptive direct search (MADS). The results of the application of the optimization methods using the proposed metric show that the accuracy of the PID controller is improved, compared with the classical optimization based on classical methods like the integral absolute error (IAE) or similar metrics, reducing oscillatory behaviours as well as minimizing the analysed performance indexes.","authors":["José Eugenio Naranjo","Francisco Serradilla","Fawzi Nashashibi"],"meta":["March 2020Electronics 9(4):551","DOI:10.3390/electronics9040551"],"references":["325283921_Energy_and_Labor_Aware_Production_Scheduling_for_Industrial_Demand_Response_Using_Adaptive_Multi-objective_Memetic_Algorithm","321817379_Comparative_Performance_Analysis_of_Optimal_PID_Parameters_Tuning_Based_on_the_Optics_Inspired_Optimization_Methods_for_Automatic_Generation_Control","315323835_Genetic_Algorithm_Based_Model_For_Optimizing_Bank_Lending_Decisions","303508498_PID_Controller_Design_for_Electro-hydraulic_Servo_Valve_System_with_Genetic_Algorithm","303406319_Robust_PID_Design_Based_on_QFT_and_Convex-Concave_Optimization","318296385_Comparison_of_PID_controller_tuning_methods_analyticalclassical_techniques_versus_optimization_algorithms","316921426_Practical_Bayesian_Optimization_for_Model_Fitting_with_Bayesian_Adaptive_Direct_Search","310960738_PID_Controller_Design_for_Cruise_Control_System_using_Genetic_Algorithm","309173770_Optimum_settings_for_automatic_controllers","308976417_A_Machine-learning_Based_Memetic_Algorithm_for_the_Multi-objective_Permutation_Flowshop_Scheduling_Problem"]}