{"id":"340293819_Legal_and_Technical_Feasibility_of_the_GDPR's_Quest_for_Explanation_of_Algorithmic_Decisions_of_Black_Boxes_White_Boxes_and_Fata_Morganas","abstract":"Understanding of the causes and correlations for algorithmic decisions is currently one of the major challenges of computer science, addressed under an umbrella term “explainable AI (XAI)”. Being able to explain an AI-based system may help to make algorithmic decisions more satisfying and acceptable, to better control and update AI-based systems in case of failure, to build more accurate models, and to discover new knowledge directly or indirectly. On the legal side, the question whether the General Data Protection Regulation (GDPR) provides data subjects with the right to explanation in case of automated decision-making has equally been the subject of a heated doctrinal debate. While arguing that the right to explanation in the GDPR should be a result of interpretative analysis of several GDPR provisions jointly, the authors move this debate forward by discussing the technical and legal feasibility of the explanation of algorithmic decisions. Legal limits, in particular the secrecy of algorithms, as well as technical obstacles could potentially obstruct the practical implementation of this right. By adopting an interdisciplinary approach, the authors explore not only whether it is possible to translate the EU legal requirements for an explanation into the actual machine learning decision-making, but also whether those limitations can shape the way the legal right is used in practice.","authors":["Maja BRKAN","Grégory BONNET"],"meta":["March 2020European Journal of Risk Regulation 11(1):18-50","DOI:10.1017/err.2020.10"],"references":["331284730_Artificial_Intelligence_and_Black-Box_Medical_Decisions_Accuracy_versus_Explainability","327295866_Human_Knowledge_in_Constructing_AI_Systems_-_Neural_Logic_Networks_Approach_towards_an_Explainable_AI","325499757_Against_the_Dehumanisation_of_Decision-Making_Algorithmic_Decisions_at_the_Crossroads_of_Intellectual_Property_Data_Protection_and_Freedom_of_Information","344879115_Do_algorithms_rule_the_world_Algorithmic_decision-making_and_data_protection_in_the_framework_of_the_GDPR_and_beyond","332283207_Binary_Governance_Lessons_from_the_GDPR's_Approach_to_Algorithmic_Accountability","331569180_Explanations_by_Arbitrated_Argumentative_Dispute","329237594_Software_qualities_and_principles","326193434_The_Right_to_Explanation_Explained","325207657_Comparison-Based_Inverse_Classification_for_Interpretability_in_Machine_Learning","323766095_The_Intuitive_Appeal_of_Explainable_Machines"]}