{"id":"340224778_Blockchain_Governance-A_New_Way_of_Organizing_Collaborations","abstract":"The recent emergence of blockchains may be considered a critical turning point in organizing collaborations. We outline the historical background and the fundamental features of blockchains and present an analysis with a focus on their role as governance mechanisms. Specifically, we argue that blockchains offer a way to enforce agreements and achieve cooperation and coordination that is distinct from both traditional contractual and relational governance as well as from other IT solutions. We also examine the scope of blockchains as efficient governance mechanisms and highlight the tacitness of the transaction as a key boundary condition. We then discuss how blockchain governance interacts with traditional governance mechanisms in both substitutive and complementary ways. We pay particular attention to blockchains' social implications as well as their inherent challenges and limitations. Our analysis culminates in a research agenda that explores how blockchains may change the way to organize collaborations, including issues of what different types of blockchains may emerge, who is involved and impacted by blockchain governance, why actors may want blockchains, when and where blockchains can be more (vs. less) effective, and how blockchains influence a number of important organizational outcomes.","authors":["Fabrice Lumineau","Wenqian Wang","Oliver Schilke"],"meta":["March 2020Organization Science","DOI:10.1287/orsc.2020.1379"],"references":["341913793_The_Truth_About_Blockchain","341293992_Bitcoin_and_the_rise_of_decentralized_autonomous_organizations","337059707_Reinvigorating_the_Study_of_Opportunism_in_Supply_Chain_Management","335401675_Distributed_ledger_technology_in_supply_chains_a_transaction_cost_perspective","332472143_Contracting_in_the_Smart_Era_The_Implications_of_Blockchain_and_Decentralized_Autonomous_Organizations_for_Contracting_and_Corporate_Governance","346945229_Textbook_on_Contract_Law_DRAFT","346832627_Trust_and_Contracts","342293361_Some_simple_economics_of_the_blockchain","337291793_Reinvigorating_the_Study_of_Opportunism_in_Supply_Chain_Management","333123181_Blockchain_technology_implications_for_operations_and_supply_chain_management"]}