{"id":"340279648_Predicting_Students'_Performance_of_the_Private_Universities_of_Bangladesh_using_Machine_Learning_Approaches","abstract":"Every year thousands of students get admitted into different universities in Bangladesh. Among them, a large number of students complete their graduation with low scoring results which affect their careers. By predicting their grades before the final examination, they can take essential measures to ameliorate their grades. This article has proposed different machine learning approaches for predicting the grade of a student in a course, in the context of the private universities of Bangladesh. Using different features that affect the result of a student, seven different classifiers have been trained, namely: Support Vector Machine (SVM), K-Nearest Neighbor (KNN), Logistic Regression, Decision Tree, AdaBoost, Multilayer Perceptron (MLP), and Extra Tree Classifier for classifying the students' final grades into four quality classes: Excellent, Good, Poor, and Fail. Afterwards, the outputs of the base classifiers have been aggregated using the weighted voting approach to attain better results. And here this study has achieved an accuracy of 81.73%, where the weighted voting classifier outperforms the base classifiers.","authors":["Md. Sabab Zulfiker","Nasrin Kabir Ety","Al Amin Biswas","Partha Chakraborty"],"meta":["March 2020International Journal of Advanced Computer Science and Applications 11(3):672-679","DOI:10.14569/IJACSA.2020.0110383"],"references":["339953514_Predicting_the_Enrollment_and_Dropout_of_Students_in_the_Post-Graduation_Degree_using_Machine_Learning_Classifier","339472341_Registration_Status_Prediction_of_Students_Using_Machine_Learning_in_the_Context_of_Private_University_of_Bangladesh","325053078_Motivating_Students_in_Electrical_Circuit_Course","327820341_Hybrid_Intrusion_Detection_System_using_K-means_and_K-Nearest_Neighbors_Algorithms","325666799_Credit_Scoring_Model_based_on_Weighted_Voting_and_Cluster_based_Feature_Selection","321888560_Student_performance_prediction_using_SVM","320663833_Early_Prediction_of_Student_Success_Mining_Students_Enrolment_Data","311556859_Prediction_of_stock_performance_in_the_Indian_stock_market_using_logistic_regression","308857640_Next-term_student_grade_prediction","295097386_Wheat_grain_classification_by_using_dense_SIFT_features_with_SVM_classifier"]}