{"id":"340291890_Estimates_of_the_severity_of_coronavirus_disease_2019_a_model-based_analysis","abstract":"Background\nIn the face of rapidly changing data, a range of case fatality ratio estimates for coronavirus disease 2019 (COVID-19) have been produced that differ substantially in magnitude. We aimed to provide robust estimates, accounting for censoring and ascertainment biases.\n\nMethods\nWe collected individual-case data for patients who died from COVID-19 in Hubei, mainland China (reported by national and provincial health commissions to Feb 8, 2020), and for cases outside of mainland China (from government or ministry of health websites and media reports for 37 countries, as well as Hong Kong and Macau, until Feb 25, 2020). These individual-case data were used to estimate the time between onset of symptoms and outcome (death or discharge from hospital). We next obtained age-stratified estimates of the case fatality ratio by relating the aggregate distribution of cases to the observed cumulative deaths in China, assuming a constant attack rate by age and adjusting for demography and age-based and location-based under-ascertainment. We also estimated the case fatality ratio from individual line-list data on 1334 cases identified outside of mainland China. Using data on the prevalence of PCR-confirmed cases in international residents repatriated from China, we obtained age-stratified estimates of the infection fatality ratio. Furthermore, data on age-stratified severity in a subset of 3665 cases from China were used to estimate the proportion of infected individuals who are likely to require hospitalisation.\n\nFindings\nUsing data on 24 deaths that occurred in mainland China and 165 recoveries outside of China, we estimated the mean duration from onset of symptoms to death to be 17·8 days (95% credible interval [CrI] 16·9–19·2) and to hospital discharge to be 24·7 days (22·9–28·1). In all laboratory confirmed and clinically diagnosed cases from mainland China (n=70 117), we estimated a crude case fatality ratio (adjusted for censoring) of 3·67% (95% CrI 3·56–3·80). However, after further adjusting for demography and under-ascertainment, we obtained a best estimate of the case fatality ratio in China of 1·38% (1·23–1·53), with substantially higher ratios in older age groups (0·32% [0·27–0·38] in those aged <60 years vs 6·4% [5·7–7·2] in those aged ≥60 years), up to 13·4% (11·2–15·9) in those aged 80 years or older. Estimates of case fatality ratio from international cases stratified by age were consistent with those from China (parametric estimate 1·4% [0·4–3·5] in those aged <60 years [n=360] and 4·5% [1·8–11·1] in those aged ≥60 years [n=151]). Our estimated overall infection fatality ratio for China was 0·66% (0·39–1·33), with an increasing profile with age. Similarly, estimates of the proportion of infected individuals likely to be hospitalised increased with age up to a maximum of 18·4% (11·0–7·6) in those aged 80 years or older.\n\nInterpretation\nThese early estimates give an indication of the fatality ratio across the spectrum of COVID-19 disease and show a strong age gradient in risk of death.\n\nFunding\nUK Medical Research Council.","authors":["Robert Verity","Lucy Okell","Ilaria Dorigatti","Peter Winskill"],"meta":["March 2020The Lancet Infectious Diseases 20(6)","DOI:10.1016/S1473-3099(20)30243-7","Project: Imperial College COVID-19 Response Team"],"references":["340957333_Epidemiology_and_transmission_of_COVID-19_in_391_cases_and_1286_of_their_close_contacts_in_Shenzhen_China_a_retrospective_cohort_study","339716563_Epidemiology_and_Transmission_of_COVID-19_in_Shenzhen_China_Analysis_of_391_cases_and_1286_of_their_close_contacts","339581314_Clinical_Characteristics_of_Coronavirus_Disease_2019_in_China","339371648_Clinical_findings_in_a_group_of_patients_infected_with_the_2019_novel_coronavirus_SARS-Cov-2_outside_of_Wuhan_China_Retrospective_case_series","339285390_Real-Time_Estimation_of_the_Risk_of_Death_from_Novel_Coronavirus_COVID-19_Infection_Inference_Using_Exported_Cases","339246448_Early_epidemiological_assessment_of_the_transmission_potential_and_virulence_of_2019_Novel_Coronavirus_in_Wuhan_City_China_2019-2020","339183724_Epidemiological_and_clinical_features_of_the_2019_novel_coronavirus_outbreak_in_China","343848273_The_epidemiological_characteristics_of_an_outbreak_of_2019_novel_coronavirus_diseases_COVID-19_in_China","339864347_Clinical_course_and_risk_factors_for_mortality_of_adult_inpatients_with_COVID-19_in_Wuhan_China_a_retrospective_cohort_study","338931536_Epidemiological_and_clinical_characteristics_of_99_cases_of_2019_novel_coronavirus_pneumonia_in_Wuhan_China_a_descriptive_study"]}