{"id":"340286773_A_Machine_Learning_Based_Framework_for_Identifying_Influential_Nodes_in_Complex_Networks","abstract":"In complex networks, identifying influential nodes is of great importance for its wide applications. Traditional centrality methods are usually directly based on topological structures of networks, and different centrality methods consider different structural characteristics related to the functional importance. However, in many scenarios, it always exists a complex and nonlinear relationship between the functional importance of a node and its various features including local location, global location, etc., which is hard to be described by one centrality. In order to solve this problem, this paper proposes a framework based on machine learning to measure the importance of nodes in the propagation scenario. This framework first constructs the feature vector of each node based on the existing centrality methods which can reflect nodes’ different topological structures and the infection rate which is an important factor in the propagation scenarios, then labels each node based on the real propagation ability obtained from simulated propagation experiments based on SIR model, last uses seven machine learning algorithms to learn the complex relationship between the real propagation ability of each node and its various structural features. The experimental results in real-world networks show that the classification accuracy of the model based on machine learning is generally higher than that of the traditional centrality methods based on one certain topology.","authors":["Gouheng Zhao","Peng Jia","Cheng Huang","Anmin Zhou"],"meta":["March 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2984286"],"references":["329219593_A_new_local_and_multidimensional_ranking_measure_to_detect_spreaders_in_social_networks","323524741_Effect_of_rich-club_on_diffusion_in_complex_networks","318368797_NLR_network_mediates_immunity_to_diverse_plant_pathogens","313450415_Edge_Weight_Prediction_in_Weighted_Signed_Networks","311510565_The_STRING_database_in_2017_quality-controlled_protein-protein_association_networks_made_broadly_accessible","333976200_An_improvement_method_for_degree_and_its_extending_centralities_in_directed_networks","324232657_CDA_A_Clustering_Degree_Based_Influential_Spreader_Identification_Algorithm_in_Weighted_Complex_Network","323884200_A_new_centrality_measure_based_on_the_negative_and_positive_effects_of_clustering_coefficient_for_identifying_influential_spreaders_in_complex_networks","314378775_Architecture_for_complex_network_measures_of_brain_connectivity","311609041_Deep_Residual_Learning_for_Image_Recognition"]}