{"id":"340259085_Optimizing_player_engagement_in_an_immersive_serious_game_for_soil_tillage_base_on_Pareto_optimal_strategies","abstract":"In most cases, problems that increase player involvement in immersive serious games do so by combining fun elements with a specific purpose. Previous studies have produced models of soil porosity and plow force that use the speed of plowing, the angle of the plow's eye, and the depth of the plow as the basis for a design strategy in immersion serious games. However, these studies have not been able to show the optimal strategy of engagement of the player in the game. In the domain of serious game concept learning, strategies can be formed based on real conditions or data from experimental results. In a serious game, the aim is to increase the player's knowledge so that the player gains knowledge by coming up with strategies to play the game.\nThis research aims to increase the engagement of players by means of multi-objective optimization based on Pareto optima, with the objectivity of soil porosity and plow force that is affected by the speed of plowing, the angle of the plow's eye, and the depth of the plow. The results of this optimization are used as a basis for the design of strategies in a serious game in the form of Hierarchy Finite State Machine (HFSM). From the results of the study, it was found that there is an optimal area for the game strategy that is also an indicator of how to successfully process the soil tillage using a moldboard plow.","authors":["Anang Kukuh Adisusilo","Mochamad Hariadi","Eko mulyanto Yuniarno","Bambang Purwantana"],"meta":["March 2020Heliyon 6(3):e03613","DOI:10.1016/j.heliyon.2020.e03613"],"references":["327401869_SEGAE_a_serious_game_project_for_agroecology_learning","327039299_Soil_porosity_modelling_for_immersive_serious_game_based_on_vertical_angle_depth_and_speed_of_tillage","286601964_Comparison_and_Optimization_of_Graphical_Methods_of_Moldboard_Plough_Bottom_Design_Using_Computational_Simulation","283654970_A_Mechanistic_Approach_to_Topsoil_Damage_due_to_Slip_of_Tractor_Tyres","283452909_'RehabMasterTM'_A_Pervasive_RehabilitationPlatform_for_Stroke_Patients_and_TheirCaregivers","273901161_Virtual_Farmers_Training_Realistic_Simulation_with_Amusements_using_Historic_Simulation_and_Game_Storyline","329521853_Designing_Immersive_Serious_Game_Based_on_Soil_Tillage_Polynomial_Model_for_Horizontal_Plowing_Force_Mode","326734297_Designing_Immersive_Serious_Game_Based_on_Soil_Tillage_Horizontal_Plowing_Force_Model","284094454_Effects_of_a_virtual_reality_and_treadmill_training_on_gait_of_subjects_with_multiple_sclerosis_A_pilot_study","272852670_The_Study_on_Agricultural_Machinery_Design_and_Modeling_Method"]}