{"id":"340279344_Covid-19_Automatic_detection_from_X-Ray_images_utilizing_Transfer_Learning_with_Convolutional_Neural_Networks","abstract":"In this study, a dataset of X-Ray images from patients with common bacterial pneumonia, confirmed Covid-19 disease, and normal incidents was utilized for the automatic detection of the Coronavirus. The aim of the study is to evaluate the performance of state-of-the-art Convolutional Neural Network architectures proposed over recent years for medical image classification. Specifically, the procedure called transfer learning was adopted. With transfer learning, the detection of various abnormalities in small medical image datasets is an achievable target, often yielding remarkable results. The datasets utilized in this experiment are two. Firstly, a collection of 1427 X-Ray images including 224 images with confirmed Covid-19 disease, 700 images with confirmed common bacterial pneumonia, and 504 images of normal conditions. Secondly, a dataset including 224 images with confirmed Covid-19 disease, 714 images with confirmed bacterial and viral pneumonia, and 504 images of normal conditions. The data was collected from the available X-Ray images on public medical repositories. The results suggest that Deep Learning in X-Rays may extract significant biomarkers related to the Cpvid-19 disease, while the best accuracy, sensitivity, and specificity obtained is 96.78%, 98.66%, and 96.46% respectively. Since by now, all diagnostic tests show failure rates such as to raise concerns, the probability of incorporating X-rays into the diagnosis of the disease could be assessed by the medical community, based on the findings, while more research to evaluate the X-Ray approach from different aspects may be conducted.","authors":["Ioannis D. Apostolopoulos","Mpesiana Tzani"],"meta":["March 2020Australasian physical & engineering sciences in medicine / supported by the Australasian College of Physical Scientists in Medicine and the Australasian Association of Physical Sciences in Medicine 43(3–4)","DOI:10.1007/s13246-020-00865-4"],"references":["316184205_MobileNets_Efficient_Convolutional_Neural_Networks_for_Mobile_Vision_Applications","307473328_What_makes_ImageNet_good_for_transfer_learning","303600638_A_survey_of_transfer_learning","265295439_ImageNet_Large_Scale_Visual_Recognition_Challenge","228102719_Improving_neural_networks_by_preventing_co-adaptation_of_feature_detectors","339505896_Gefapixant_a_P2X3_receptor_antagonist_for_the_treatment_of_refractory_or_unexplained_chronic_cough_a_randomised_double-blind_controlled_parallel-group_phase_2b_trial","339340520_Pathological_findings_of_COVID-19_associated_with_acute_respiratory_distress_syndrome","323373904_Identifying_Medical_Diagnoses_and_Treatable_Diseases_by_Image-Based_Deep_Learning","320968382_Xception_Deep_Learning_with_Depthwise_Separable_Convolutions","301874967_Inception-v4_Inception-ResNet_and_the_Impact_of_Residual_Connections_on_Learning","301732947_Guest_Editorial_Deep_Learning_in_Medical_Imaging_Overview_and_Future_Promise_of_an_Exciting_New_Technique","269935079_Adam_A_Method_for_Stochastic_Optimization","267119199_Deep_Learning_Methods_and_Applications","221345737_Rectified_Linear_Units_Improve_Restricted_Boltzmann_Machines_Vinod_Nair","8904943_The_Problem_of_Overfitting"]}