{"id":"340355250_An_energy_approach_to_the_solution_of_partial_differential_equations_in_computational_mechanics_via_machine_learning_Concepts_implementation_and_applications","abstract":"Partial Differential Equations (PDEs) are fundamental to model different phenomena in science and engineering mathematically. Solving them is a crucial step towards a precise knowledge of the behavior of natural and engineered systems. In general, in order to solve PDEs that represent real systems to an acceptable degree, analytical methods are usually not enough. One has to resort to discretization methods. For engineering problems, probably the best-known option is the finite element method (FEM). However, powerful alternatives such as mesh-free methods and Isogeometric Analysis (IGA) are also available. The fundamental idea is to approximate the solution of the PDE by means of functions specifically built to have some desirable properties. In this contribution, we explore Deep Neural Networks (DNNs) as an option for approximation. They have shown impressive results in areas such as visual recognition. DNNs are regarded here as function approximation machines. There is great flexibility to define their structure and important advances in the architecture and the efficiency of the algorithms to implement them make DNNs a very interesting alternative to approximate the solution of a PDE. We concentrate on applications that have an interest for Computational Mechanics. Most contributions explore this possibility have adopted a collocation strategy. In this work, we concentrate on mechanical problems and analyze the energetic format of the PDE. The energy of a mechanical system seems to be the natural loss function for a machine learning method to approach a mechanical problem. In order to prove the concepts, we deal with several problems and explore the capabilities of the method for applications in engineering.","authors":["Esteban Samaniego","Cosmin Anitescu","Somdatta Goswami","Vien Minh Nguyen-Thanh"],"meta":["April 2020Computer Methods in Applied Mechanics and Engineering 362:112790","DOI:10.1016/j.cma.2019.112790"],"references":["335802770_A_Finite_Element_Reduced_Order_Model_based_on_Adaptive_Mesh_Refinement_and_Artificial_Neural_Networks","325966541_Topological_properties_of_the_set_of_functions_generated_by_neural_networks_of_fixed_size","324492734_Deep_Neural_Networks_Motivated_by_Partial_Differential_Equations","341796950_Relu_Deep_Neural_Networks_and_Linear_Finite_Elements","338124698_Deep_ReLU_Networks_and_High-Order_Finite_Element_Methods","335809563_DYNAMICAL_SYMPLECTIC_AND_STOCHASTIC_PERSPECTIVES_ON_GRADIENT-BASED_OPTIMIZATION","328720075_Physics-Informed_Neural_Networks_A_Deep_Learning_Framework_for_Solving_Forward_and_Inverse_Problems_Involving_Nonlinear_Partial_Differential_Equations","327783863_Isogeometric_Analysis_Mathematical_and_Implementational_Aspects_with_Applications_Cetraro_Italy_2017","322652704_Deep_Hidden_Physics_Models_Deep_Learning_of_Nonlinear_Partial_Differential_Equations","320201215_Introduction_to_PyTorch"]}