{"id":"340308528_Classification_of_Lung_Nodules_Based_on_Deep_Residual_Networks_and_Migration_Learning","abstract":"The classification process of lung nodule detection in a traditional computer-aided detection (CAD) system is complex, and the classification result is heavily dependent on the performance of each step in lung nodule detection, causing low classification accuracy and high false positive rate. In order to alleviate these issues, a lung nodule classification method based on a deep residual network is proposed. Abandoning traditional image processing methods and taking the 50-layer ResNet network structure as the initial model, the deep residual network is constructed by combining residual learning and migration learning. The proposed approach is verified by conducting experiments on the lung computed tomography (CT) images from the publicly available LIDC-IDRI database. An average accuracy of 98.23% and a false positive rate of 1.65% are obtained based on the ten-fold cross-validation method. Compared with the conventional support vector machine (SVM)-based CAD system, the accuracy of our method improved by 9.96% and the false positive rate decreased by 6.95%, while the accuracy improved by 1.75% and 2.42%, respectively, and the false positive rate decreased by 2.07% and 2.22%, respectively, in contrast to the VGG19 model and InceptionV3 convolutional neural networks. The experimental results demonstrate the effectiveness of our proposed method in lung nodule classification for CT images.","authors":["Panpan Wu","Xuanchao Sun","Ziping Zhao","Haishuai Wang"],"meta":["March 2020Computational Intelligence and Neuroscience 2020:1-10","DOI:10.1155/2020/8975078"],"references":["333194799_Fuzzy_relevance_vector_machine_based_classification_of_lung_nodules_in_computed_tomography_images","331073043_Automatic_Detection_and_Classification_of_Lung_Nodules_in_CT_Image_Using_Optimized_Neuro_Fuzzy_Classifier_with_Cuckoo_Search_Algorithm","326432931_CNN_models_discriminating_between_pulmonary_micro-nodules_and_non-nodules_from_CT_images","323364216_Agile_convolutional_neural_network_for_pulmonary_nodule_classification_using_CT_images","319024851_Using_Deep_Learning_for_Classification_of_Lung_Nodules_on_Computed_Tomography_Images","334474089_Predicting_lung_nodule_malignancies_by_combining_deep_convolutional_neural_network_and_handcrafted_features","326569771_Lung_Nodule_Classification_via_Deep_Transfer_Learning_in_CT_Lung_Images","322862932_Lung_nodule_classification_using_local_kernel_regression_models_with_out-of-sample_extension","317725526_TumorNet_Lung_nodule_characterization_using_multi-view_Convolutional_Neural_Network_with_Gaussian_Process","316957808_Pulmonary_nodule_classification_with_deep_residual_networks"]}