{"id":"340378897_Visual_complexity_analysis_using_deep_intermediate-layer_features","abstract":"In this paper, we focus on visual complexity, an image attribute that humans can subjectively evaluate based on the level of details in the image. We explore unsupervised information extraction from intermediate convolutional layers of deep neural networks to measure visual complexity. We derive an activation energy metric that combines convolutional layer activations to quantify visual complexity. To show the effectiveness of our proposed metric for various applications, we introduce Savoias, a visual complexity dataset that compromises of more than 1,400 images from seven diverse image categories (e.g., advertisement and interior design). We demonstrate high correlations of our deep neural network-based measure of visual complexity with human-curated ground-truth (GT) scores on various widely used network architectures, e.g., VGG16, ResNet-v2-152, and EfficientNet, and in networks trained on two classification tasks (object and scene classification). This result reveals that intermediate convolutional layers of deep neural networks carry information about the complexity of images that is meaningful to people. Furthermore, we show that our method of measuring visual complexity outperforms traditional methods on Savoias and two other state-of-the-art benchmark datasets. Moreover, we perform extensive analysis on the performance difference between our unsupervised method and a supervised method trained on the feature map, and show that by supervision, we can improve the prediction. Finally, we demonstrate that, within the context of a category, visually more complex images are also more memorable to human observers.","authors":["Elham Saraee","Mona Jalal","Margrit Betke"],"meta":["April 2020Computer Vision and Image Understanding 195(104):102949","DOI:10.1016/j.cviu.2020.102949","Project: Image and Text Analysis of Public Communications"],"references":["320846318_Predicting_perceived_visual_complexity_of_abstract_patterns_using_computational_measures_The_influence_of_mirror_symmetry_on_complexity_perception","345045464_The_Stopping_Power_of_Advertising_Measures_and_Effects_of_Visual_Complexity","340555377_Is_Image_Memorability_Prediction_Solved","329754197_The_Unreasonable_Effectiveness_of_Deep_Features_as_a_Perceptual_Metric","325800394_Assessment_model_for_perceived_visual_complexity_of_painting_images","324355447_Aesthetics_and_Psychobiology","320968363_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","320968308_Deep_Learning_of_Human_Visual_Sensitivity_in_Image_Quality_Assessment_Framework","320968261_Automatic_Understanding_of_Image_and_Video_Advertisements","320964598_Full_Resolution_Image_Compression_with_Recurrent_Neural_Networks"]}