{"id":"340383721_Word2vec-based_latent_semantic_analysis_W2V-LSA_for_topic_modeling_A_study_on_blockchain_technology_trend_analysis","abstract":"Blockchain has become one of the core technologies in Industry 4.0. To help decision-makers establish action plans based on blockchain, it is an urgent task to analyze trends in blockchain technology. However, most of existing studies on blockchain trend analysis are based on effort demanding full-text investigation or traditional bibliometric methods whose study scope is limited to a frequency-based statistical analysis. Therefore, in this paper, we propose a new topic modeling method called Word2vec-based Latent Semantic Analysis (W2V-LSA), which is based on Word2vec and Spherical k-means clustering to better capture and represent the context of a corpus. We then used W2V-LSA to perform an annual trend analysis of blockchain research by country and time for 231 abstracts of blockchain-related papers published over the past five years. The performance of the proposed algorithm was compared to Probabilistic LSA, one of the common topic modeling techniques. The experimental results confirmed the usefulness of W2V-LSA in terms of the accuracy and diversity of topics by quantitative and qualitative evaluation. The proposed method can be a competitive alternative for better topic modeling to provide direction for future research in technology trend analysis and it is applicable to various expert systems related to text mining.","authors":["Suhyeon Kim","Haecheong Park","Junghye Lee"],"meta":["April 2020Expert Systems with Applications 152:113401","DOI:10.1016/j.eswa.2020.113401"],"references":["331205903_Trends_on_Health_in_Social_Media_Analysis_using_Twitter_Topic_Modeling","330761904_Proposing_New_Blockchain_Challenges_in_eHealth","330725596_The_Evolution_of_Blockchain_A_Bibliometric_Study","327681911_Measuring_service_quality_from_unstructured_data_A_topic_modeling_application_on_airline_passengers'_online_reviews","325906558_MedBlock_Efficient_and_Secure_Medical_Data_Sharing_Via_Blockchain","333720711_Mining_the_voice_of_employees_A_text_mining_approach_to_identifying_and_analyzing_job_satisfaction_factors_from_online_employee_reviews","332338936_The_Blockchain_State-of-the-Art_and_Research_Challenges","332188221_A_Bibliometric_Analysis_of_Blockchain_Research","331403094_Blockchain_in_healthcare_applications_Research_challenges_and_opportunities","325787044_Latent_Association_Rule_Cluster_based_Model_to_Extract_Topics_for_Classification_and_Recommendation_Applications"]}