{"id":"340310434_Microscopic_Pore_Structure_of_Surrounding_Rock_for_Underground_Strategic_Petroleum_Reserve_SPR_Caverns_in_Bedded_Rock_Salt","abstract":"Using salt caverns for an underground strategic petroleum reserve (SPR) is considered as an ideal approach due to the excellent characteristics of low porosity, low permeability, self-healing of damage, and strong plastic deformation ability of rock salt. Salt deposits in China are mostly layered rock salt structures, with the characteristics of many interlayers, bringing great challenges for the construction of SPR facilities. Studying the microscopic pore characteristics of the rock surrounding SPR salt caverns in different environments (with brine and crude oil erosion) is necessary because the essence of mechanical and permeability characteristics is the macroscopic embodiment of the microscopic pore structure. In this paper, XRD tests and SEM tests are carried out to determine the physical properties of storage media and surrounding rock. Gas adsorption tests and mercury intrusion tests are carried out to analyze the microscopic pore structure, specific surface area variation and total aperture distribution characteristics of SPR salt cavern host rock. Results show that: (1) Large numbers of cores in interlayer and caprock may provide favorable channels for the leakage of high-pressure crude oil and brine. (2) The blockage of pores by macromolecular organic matter (colloid and asphaltene) in crude oil will not significantly change the structural characteristics of the rock skeleton, which is beneficial to the long-term operation of the SPR salt cavern. (3) The water–rock interaction will bring obvious changes in the micro-pore structure of rock and increase the leakage risk of the storage medium. The results can provide theoretical bases and methods for the tightness analysis of China’s first underground SPR salt cavern.","authors":["Nan Zhang","Wei Liu","Yun Zhang","Pengfei Shan"],"meta":["March 2020Energies 13(7)","DOI:10.3390/en13071565","Project: Underground energy storage"],"references":["344619818_Evaluation_of_Potential_for_Salt_Cavern_Gas_Storage_and_Integration_of_Brine_Extraction_Cavern_Utilization_Yangtze_River_Delta_Region","341300142_Construction_modeling_and_parameter_optimization_of_multi-step_horizontal_energy_storage_salt_caverns","339804513_Feasibility_evaluation_of_large-scale_underground_hydrogen_storage_in_bedded_salt_rocks_of_China_A_case_study_in_Jiangsu_province","339352238_Analyzing_Similarities_between_the_European_Union_Countries_in_Terms_of_the_Structure_and_Volume_of_Energy_Production_from_Renewable_Energy_Sources","338673685_Research_on_the_Stability_and_Treatments_of_Natural_Gas_Storage_Caverns_With_Different_Shapes_in_Bedded_Salt_Rocks","338591324_Tightness_Analysis_of_Underground_Natural_Gas_and_Oil_Storage_Caverns_With_Limit_Pillar_Widths_in_Bedded_Rock_Salt","344631674_An_associated_evaluation_methodology_of_initial_stress_level_of_coal-rock_masses_in_steeply_inclined_coal_seams_Urumchi_coal_field_China","340109493_The_application_of_short-wall_block_backfill_mining_to_preserve_surface_water_resources_in_northwest_China","338792078_Stability_study_and_optimization_design_of_small-spacing_two-well_SSTW_salt_caverns_for_natural_gas_storages","338627613_Microscopic_investigations_on_the_healing_and_softening_of_damaged_salt_by_uniaxial_deformation_from_CT_SEM_and_NMR_effect_of_fluids_brine_and_oil"]}