{"id":"340391378_Incremental_Algorithms_of_the_Core_Maintenance_Problem_on_Edge-Weighted_Graphs","abstract":"The k-core, a kind of structure of graphs, is a maximal connected subgraph with the minimum degree greater than or equal to k, and has been used in many fields. The maximum k such that a k-core contains u is the K value of u. Especially, for an edge-weighted graph, the degree of a vertex is the sum of weights of all its incident edges. The core decomposition problem on static graphs and the core maintenance problem on dynamic graphs have been studied in unweighted graphs. We improve the core decomposition algorithm to suit edge-weighted graphs, but it costs too much to update K values of all vertices after the change of large graphs by using it directly. Then we find a small subgraph H which contains all vertices whose K values will change after the change of graphs. By operating on H, the cost will be greatly reduced. Next, we design core maintenance algorithms for edge-weighted graphs in both insertion and deletion cases, which is the major work in this paper. In those core maintenance algorithms, a hierarchical process is added, which help us determine the new K values of vertices in H from the small ones to high. Finally, we conduct extensive experiments on real-world graphs to show the effectiveness and the efficiency that our algorithms have. The results show that our algorithms have the best performance.","authors":["Bin Liu","Feiteng Zhang"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2985327"],"references":["328874544_Scalable_K-Core_Decomposition_for_Static_Graphs_Using_a_Dynamic_Graph_Data_Structure","324515994_Measuring_and_Improving_the_Core_Resilience_of_Networks","317752955_Finding_influential_communities_in_massive_networks","328525464_Efficient_Computing_of_Radius-Bounded_k-Cores","328524987_Efficient_Probabilistic_K-Core_Computation_on_Uncertain_Graphs","325103992_K-Connected_Cores_Computation_in_Large_Dual_Networks","324957053_IO_Efficient_Core_Graph_Decomposition_Application_to_Degeneracy_Ordering","322514256_A_distributed_k-core_decomposition_algorithm_on_spark","318476013_Parallel_Algorithm_for_Core_Maintenance_in_Dynamic_Graphs","315849540_The_k-peak_Decomposition_Mapping_the_Global_Structure_of_Graphs"]}