{"id":"340396118_Industry_40_Readiness_Assessment_for_South_African_Industries","abstract":"Technological advancements related to the fourth industrial revolution are causing disruptive changes that are widely felt at national, industry, and company level. Industry 4.0, an initiative driving the fourth industrial revolution, is happening at an exponential speed, and embracing and adopting it is unavoidable for survival and competiveness. Although noticeable progress has been made in the use of Industry 4.0 technologies, systems, and processes in developed countries, there is uncertainty about the preparedness of businesses and industries in developing countries, including South Africa, to adopt Industry 4.0. The purpose of this research paper is to explore the readiness of South African industry in this regard. A questionnaire instrument with quantitative criteria compiled by the Impulse Foundation of Verband Deutscher Maschinen- und Anlagenbau was used in this study. The exploratory study revealed that South African industry is faced with significant challenges in Industry 4.0 strategy formulation and equipment infrastructure to support Industry 4.0 requirements. The assessment pointed out that Industry 4.0 skills exist in pockets in South Africa, and so a further study to reveal more detail on Industry 4.0 skills requirements is essential.","authors":["Whisper Maisiri","Liezl van Dyk"],"meta":["November 2019South African Journal of Industrial Engineering 30(3):134-148","DOI:10.7166/30-3-2231"],"references":["328883977_Rapidly_arriving_futures_Future_readiness_for_industry_40","338887482_Challenges_Facing_Black_Owned_Small_and_Medium_Construction_Companies_A_Case_Study_of_Nelspruit_a_Mbombela_Municipality_South_Africa","328206393_A_comparative_study_on_industrial_spillover_effects_among_Korea_China_the_USA_Germany_and_Japan","327062929_State_of_Industry_40_Across_German_Companies","324250781_Thematic_analysis_of_qualitative_research_data_Is_it_as_easy_as_it_sounds","324027041_Assessing_industry_40_readiness_of_enterprises","323135613_Implementing_industry_40_-_A_technological_readiness_perspective","322751127_Strategies_of_global_recession_for_small_business_enterprises_in_emerging_markets_Case_of_South_Africa","321217718_South_African_Government's_Support_to_Small_Medium_Micro-Enterprise_SMMEs_The_Case_of_King_William's_Town_Area","320766726_The_Concept_Industry_40"]}