{"id":"340375234_Mapping_Digital_Competence_Towards_a_Conceptual_Understanding","abstract":"Technologies are increasingly being used in society and the economy, and this is transforming ways of working, studying, communicating, accessing information and spending leisure time, among others. Attention must be paid to ensuring that everyone has digital competence as it provides important benefits while its lack can lead to various risks to children, young people, workers, elderly, groups at risk of exclusion and all citizens in general. It is not always clear however what is meant with digital competence. Therefore, the IS Unit at JRC-IPTS has launched a project to develop guidelines for supporting digital competence development in Europe on the request of DG Education and Culture.\nThis report reviews needs for digital competence, different concepts used to describe and understand it, and related policy approaches and measurements. Based on these, it suggests a conceptual model with the following main areas: 1) Instrumental knowledge and skills for tool and media usage; 2) Advanced skills and knowledge for communication and collaboration, information management, learning and problem-solving, and meaningful participation; 3) Attitudes to strategic skills usage in intercultural, critical, creative, responsible and autonomous ways. Instrumental knowledge and skills are a precondition for developing or using more advanced skills. The objective of the conceptual model is to highlight the various knowledge, skill and attitude areas that should be considered when developing digital competence. The proposed structure allows flexibility and the concept to be tailored to different target groups of digital competence learners and users.\nThe work developed in this report will contribute to the IPTS DIGCOMP project, where it will also be developed further. The reader is encouraged to follow the project’s progress and results at the project website: http://is.jrc.ec.europa.eu/pages/EAP/DIGCOMP.html","authors":["Kirsti Ala-Mutka"],"meta":["January 2011","DOI:10.13140/RG.2.2.18046.00322","Report number: JRC67075Affiliation: European Commission"],"references":["340375236_Learning_in_Informal_Online_Networks_and_Communities","291334632_Digital_Literacies_Concepts_Policies_and_Practices_Cover_plus_Introduction","256461823_Learning_20_The_Impact_of_Web_20_Innovations_on_Education_and_Training_in_Europe_Final_Report","254308313_Reviewing_Approaches_and_Perspectives_on_Digital_Literacy","292717791_Trajectories_of_remixing_Digital_literacies_media_production_and_schooling","284513255_Web_20_in_government_Why_and_how_Institute_for_Prospective_Technological_Studies_IPTS","281994649_Literacies_for_the_digital_age","280982710_Digital_literacy_and_the_'digital_society'","265092107_Confronting_the_Challenges_of_Participatory_Culture_-_Media_Education_for_the_21st_Century_Part_2","262184680_PISA_2009_results_What_students_know_and_can_do_Student_Performance_in_Reading_Mathematics_and_Science_Vol_1_Paris_OECD"]}