{"id":"340330706_So_Big_Data_and_the_transformation_of_the_city","abstract":"The exponential increase in the availability of large-scale mobility data has fueled the vision of smart cities that will transform our lives. The truth is that we have just scratched the surface of the research challenges that should be tackled in order to make this vision a reality. Consequently, there is an increasing interest among different research communities (ranging from civil engineering to computer science) and industrial stakeholders in building knowledge discovery pipelines over such data sources. At the same time, this widespread data availability also raises privacy issues that must be considered by both industrial and academic stakeholders. In this paper, we provide a wide perspective on the role that big data have in reshaping cities. The paper covers the main aspects of urban data analytics, focusing on privacy issues, algorithms, applications and services, and georeferenced data from social media. In discussing these aspects, we leverage, as concrete examples and case studies of urban data science tools, the results obtained in the “City of Citizens” thematic area of the Horizon 2020 SoBigData initiative, which includes a virtual research environment with mobility datasets and urban analytics methods developed by several institutions around Europe. We conclude the paper outlining the main research challenges that urban data science has yet to address in order to help make the smart city vision a reality.","authors":["Gennady Andrienko","Natalia Andrienko","Chiara Boldrini","Guido Caldarelli"],"meta":["May 2021International Journal of Data Science and Analytics 11(4)","DOI:10.1007/s41060-020-00207-3","Projects: SoBigData++SoBigData"],"references":["336272457_Traffic_signal_detection_from_in-vehicle_GPS_speed_profiles_using_functional_data_analysis_and_machine_learning","333831306_Socio-technical_smart_grid_optimization_via_decentralized_charge_control_of_electric_vehicles","331461142_Weak_signals_in_the_mobility_landscape_car_sharing_in_ten_European_cities","327417772_PRUDEnce_A_system_for_assessing_privacy_risk_vs_utility_in_data_sharing_ecosystems","325949309_Harnessing_the_Social_Sensing_revolution_-_Challenges_and_Opportunities","342760806_Proof_of_witness_presence_Blockchain_consensus_for_augmented_democracy_in_smart_cities","335074051_Democratizing_Data_Analytics_Crowd-Sourcing_Decentralized_Collective_Measurements","329954227_The_New_Science_of_Cities","329232178_Decentralized_Collective_Learning_for_Self-managed_Sharing_Economies","327675459_Privacy-Utility_Tradeoff_for_Applications_Using_Energy_Disaggregation_of_Smart-Meter_Data"]}