{"id":"340364994_Long-term_patterns_of_gender_imbalance_in_an_industry_without_ability_or_level_of_interest_differences","abstract":"Female representation has been slowly but steadily increasing in many sectors of society. One sector where one would expect to see gender parity is the movie industry, yet the representation of females in most functions within the U.S. movie industry remain surprisingly low. Here, we study the historical patterns of female representation among actors, directors, and producers in an attempt to gain insights into the possible causes of the lack of gender parity in the industry. Our analyses reveals a remarkable temporal coincidence between the collapse in female representation across all functions and the advent of the Studio System, a period when the major Hollywood studios controlled all aspects of the industry. Female representation among actors, directors, producers and writers dropped to extraordinarily low values during the emergence and consolidation of the Studio System that in some cases have not yet recovered to pre-Studio System levels. In order to explore some possible mechanisms behind these patterns, we investigate the association between the gender balance of actors, writers, directors, and producers and a number of economic indicators, movie industry indicators, and movie characteristics. We find robust, strong, and significant associations which are consistent with an important role for the gender of decision makers on the gender balance of other industry functions. While in no way demonstrating causality, our findings add new perspectives to the discussions of the reasons for female under-representation in fields such as computer science and medicine, that have also experienced dramatic changes in female representation.","authors":["Luís A Nunes Amaral","João A. G. Moreira","Murielle L. Dunand","Heliodoro Tejedor Navarro"],"meta":["April 2020PLoS ONE 15(4):e0229662","DOI:10.1371/journal.pone.0229662"],"references":["331866106_Computer_science_skills_across_China_India_Russia_and_the_United_States","315600586_Tears_or_Fears_Comparing_Gender_Stereotypes_about_Movie_Preferences_to_Actual_Preferences","309705392_Differences_in_Collaboration_Patterns_across_Discipline_Career_Stage_and_Gender","325795527_Role_congruity_theory_of_prejudice_toward_female_leaders","324428769_Men_and_Women_of_the_Corporation","323107934_The_Transformation_of_Gender_in_English-Language_Fiction","313522729_Women_in_management_Current_research_issues","311473376_Unlocking_the_clubhouse_women_in_computing","307555785_Persistence_and_change_in_age-specific_gender_gaps_Hollywood_actors_from_the_silent_era_onward","299640417_FROM_The_Subjection_of_Women"]}