{"id":"340492388_Les_methodes_agiles_et_leurs_contradictions_-_Analyse_de_leurs_effets_sur_les_metiers_de_l'informatique_SociologieS_Theories_et_recherches_URL_httpjournalsopeneditionorgsociologies12471","abstract":"Plusieurs courants de pensée se présentent comme des alternatives partielles à l’entreprise industrielle standard. Certains, partiellement codifiés, donnent naissance à des méthodes, introduites et expérimentées dans de grandes entreprises pour en fluidifier le fonctionnement. Comme ces méthodes nécessitent un changement radical de culture professionnelle, notamment l’auto-organisation des producteurs et la fin des hiérarchies, on peut se demander pourquoi une partie des dirigeants et des cadres s’enthousiasment pour l’introduction de ces « innovations organisationnelles ». Et quelles sont les répercussions socio-professionnelles de leur mise en œuvre ? Pour répondre, nous examinons les premières phases de la mise en œuvre de « l’agilité » dans la division informatique d’une multinationale. Nous soulignons, tout d’abord, les points communs entre les principes de l’open source, du modèle de l’entreprise libérée et des méthodes agiles. Ces proximités constituent un arrière-fond de représentations et d’aspirations partagées qui vont faciliter, non seulement l’introduction de la méthode agile par les promoteurs (dirigeants), mais également expliquer, au moins partiellement, l’engagement de certains informaticiens (pionniers) et les efforts qu’ils vont déployer pour dépasser, par leurs initiatives, les tensions, voire les contradictions ou les incohérences (organisationnelles et technologiques) inhérentes à « l’agilité ». Un tel investissement personnel ne s’avère soutenable, au vu des contraintes structurelles auxquelles il se heurte, que parce que les pionniers sont convaincus du bienfondé de leur mission (convertir leurs pairs à la nouvelle méthode) et parce que les encouragements reçus de la direction, en les autorisant à bricoler des solutions ad hoc, leur assurent simultanément autonomie – certes limitée, mais bien réelle – et reconnaissance auprès de leurs pairs.","authors":["Anca Boboc","Jean-Luc Metzger"],"meta":["February 2020"],"references":["331648378_ENTREPRISES_LIBEREES_PAROLE_LIBEREE_LECTURES_CRITIQUES_DE_LA_PARTICIPATION_COMME_PROJET_MANAGERIAL_EMANCIPATEUR_LIBERATED_COMPANIES_LIBERATED_SPEECH_CRITICAL_READINGS_OF_PARTICIPATION_AS_AN_EMANCIPATO","284367206_La_liberte_d'action_des_salaries_Une_simple_theorie_ou_un_ineluctable_destin","250296111_L'esprit_du_capitalisme_a_l'epreuve_de_ses_pratiques_Une_approche_sociologique_de_la_crise_du_capitalisme_informationnel","250295856_Penser_l'exode_de_la_societe_du_travail_et_de_la_marchandise","46483219_Innovation_et_organisation_Deux_legitimites_en_concurrence","46483209_Informatiques_et_management_la_crise"]}