{"id":"340403926_Design_and_Implementation_of_Virtual_Private_Storage_Framework_Using_Internet_of_Things_Local_Networks","abstract":"This paper presents a virtual private storage framework (VPSF) using Internet of Things (IoT) local networks. The VPSF uses the extra storage space of sensor devices in an IoT local network to store users’ private data, while guaranteeing expected network lifetime, by partitioning the storage space of a sensor device into data and system volumes and, if necessary, logically integrating the extra data volumes of the multiple sensor devices to virtually build a single storage space. When user data need to be stored, the VPSF gateway divides the original data into several blocks and selects the sensor devices in which the blocks will be stored based on their residual energy. The blocks are transmitted to the selected devices using the modified speedy block-wise transfer (BlockS) option of the constrained application protocol (CoAP), which reduces communication overhead by retransmitting lost blocks without a retransmission request message. To verify the feasibility of the VPSF, an experimental implementation was conducted using the open-source software libcoap. The results demonstrate that the VPSF is an energy-efficient solution for virtual private storage because it averages the residual energy amounts for sensor devices within an IoT local network and reduces their communication overhead.","authors":["Hwi-Ho Lee","Jung-Hyok Kwon","Eui-Jik Kim"],"meta":["March 2020Symmetry 12(3):489","DOI:10.3390/sym12030489"],"references":["336447121_A_Heterogeneous_Cloud_Storage_Platform_With_Uniform_Data_Distribution_by_Software-Defined_Storage_Technologies","333814964_Big_Data_Analytics_for_Manufacturing_Internet_of_Things_Opportunities_Challenges_and_Enabling_Technologies","331041907_All_One_Needs_to_Know_about_Fog_Computing_and_Related_Edge_Computing_Paradigms","327391000_Towards_Distributed_Data_Management_in_Fog_Computing","323328596_A_Survey_on_Resource_Management_in_IoT_Operating_Systems","330403121_Dependability_Analysis_of_Data_Storage_Systems_in_Presence_of_Soft_Errors","327991712_Emerging_trends_issues_and_challenges_in_Internet_of_Things_Big_Data_and_cloud_computing","326619866_Toward_an_Energy_and_Resource_Efficient_Internet_of_Things_A_Design_Principle_Combining_Computation_Communications_and_Protocols","322882155_IEEE_802154e_in_a_Nutshell_Survey_and_Performance_Evaluation","322866558_A_Three-Layer_Privacy_Preserving_Cloud_Storage_Scheme_Based_on_Computational_Intelligence_in_Fog_Computing"]}