{"id":"340450384_DFT-based_low-complexity_optimal_cell_ID_estimation_in_NB-IoT","abstract":"This paper deals with cell identifier (ID) estimation for narrowband-Internet of things (NB-IoT) system. It is suggested to transform the usual maximum likelihood (ML) estimator expression in order to highlight a discrete Fourier transform (DFT), which can be computed with fast algorithms. Therefore, the proposed method is a DFT-based low-complexity cell ID estimator that can be qualified as optimal in the ML sense. The principle is extended to the practical case where the channel is unknown and must be estimated. In this scenario, the concentrated likelihood function needs to be maximized, in which the ML channel estimate is a function of the unknown cell ID parameter. This operation only involves a few additional multiplications. Simulation results reveal that the performance of the proposed method actually matches the optimal one of the ML cell ID estimator. Furthermore, the technique is robust to residual frequency offset up to several hundreds of Hertz. We also show that the mean square error of channel estimation reaches its Cramér-Rao bound (CRB).","authors":["Vincent Savaux"],"meta":["April 2020EURASIP Journal on Advances in Signal Processing 2020(1)","DOI:10.1186/s13634-020-00677-4"],"references":["329191085_Low-Power_Wide_Area_Network_Technologies_for_Internet-of-Things_A_Comparative_Review_IEEE_Internet_of_Things_Journal","328038515_A_Joint_Low-Power_Cell_Search_and_Frequency_Tracking_Scheme_in_NB-IoT_Systems_for_Green_Internet_of_Things","322018958_A_comparative_study_of_LPWAN_technologies_for_large-scale_IoT_deployment","316732090_Maximum-Likelihood_Detection_for_Energy-Efficient_Timing_Acquisition_in_NB-IoT","316705964_On_the_Cell_Search_and_Initial_Synchronization_for_NB-IoT_LTE_Systems","312450467_Low_Power_Wide_Area_Networks_An_Overview","312431148_Overview_of_narrowband_IoT_in_LTE_Rel-13","303969949_A_Primer_on_3GPP_Narrowband_Internet_of_Things_NB-IoT","296479892_New_3GPP_Standard_for_IoT_Mobile_Radio","276419152_Primary_Synchronization_Signal_Detection_Method_for_Device-to-Device_in_LTE-Rel_12_and_Beyond"]}