{"id":"340412145_Ground-state_energy_estimation_of_the_water_molecule_on_a_trapped-ion_quantum_computer","abstract":"Quantum computing leverages the quantum resources of superposition and entanglement to efficiently solve computational problems considered intractable for classical computers. Examples include calculating molecular and nuclear structure, simulating strongly interacting electron systems, and modeling aspects of material function. While substantial theoretical advances have been made in mapping these problems to quantum algorithms, there remains a large gap between the resource requirements for solving such problems and the capabilities of currently available quantum hardware. Bridging this gap will require a co-design approach, where the expression of algorithms is developed in conjunction with the hardware itself to optimize execution. Here we describe an extensible co-design framework for solving chemistry problems on a trapped-ion quantum computer and apply it to estimating the ground-state energy of the water molecule using the variational quantum eigensolver (VQE) method. The controllability of the trapped-ion quantum computer enables robust energy estimates using the prepared VQE ansatz states. The systematic and statistical errors are comparable to the chemical accuracy, which is the target threshold necessary for predicting the rates of chemical reaction dynamics, without resorting to any error mitigation techniques based on Richardson extrapolation.","authors":["Yunseong Nam","Jwo-Sy Chen","Neal C. Pisenti","Kenneth Wright"],"meta":["December 2020npj Quantum Information 6(1)","DOI:10.1038/s41534-020-0259-3"],"references":["336656301_Training_of_quantum_circuits_on_a_hybrid_quantum_computer","329511339_A_quantum_machine_learning_algorithm_based_on_generative_models","324078174_Quantum_Chemistry_Calculations_on_a_Trapped-Ion_Quantum_Simulator","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","321347763_Improved_Techniques_for_Preparing_Eigenstates_of_Fermionic_Hamiltonians","320564691_Automated_optimization_of_large_quantum_circuits_with_continuous_parameters","320475602_Exponentially_More_Precise_Quantum_Simulation_of_Fermions_in_the_Configuration_Interaction_Representation","344713686_An_Introduction_to_the_Bootstrap","323956831_Joint_Quantum_State_and_Measurement_Tomography_with_Incomplete_Measurements","319683740_Hardware-efficient_variational_quantum_eigensolver_for_small_molecules_and_quantum_magnets"]}