{"id":"340406446_T-Equivalences_The_Metric_Behavior_Revisited","abstract":"Since the notion of T-equivalence, where T is a t-norm, was introduced as a fuzzy generalization of the notion of crisp equivalence relation, many researchers have worked in the study of the metric behavior of such fuzzy relations. Concretely, a few techniques to induce metrics from T-equivalences, and vice versa, have been developed. In several fields of computer science and artificial intelligence, a generalization of pseudo-metric, known as partial pseudo-metrics, have shown to be useful. Recently, Bukatin, Kopperman and Matthews have stated that the notion of partial pseudo-metric and a type of generalized T-equivalence are linked. Inspired by the preceding fact, in this paper, we state a concrete relationship between partial pseudo-metrics and the aforesaid generalized T-equivalences. Specifically, a method for constructing partial pseudo-metrics from the new type of T-equivalences and, reciprocally, for constructing the generalized T-equivalences from partial pseudo-metrics are provided. However, important differences between the new approach and the classical one are established. Special interest is paid to the case in which the minimum, drastic, and ukasiewicz t-norms are under consideration.","authors":["Pilar Fuster","Javier Martin","Jorge Recasens Ferrés","O. Valero"],"meta":["April 2020","DOI:10.3390/math8040495","Project: Generalized Metrics, Fuzzy Sets, Aggregation Theory and Appliactions"],"references":["327396254_Mathematical_aspects_of_logic_programming_semantics","316818360_Encyclopedia_of_Distances","281124886_A_fixed_point_theorem_in_partial_quasi-metric_spaces_and_an_application_to_Software_Engineering","272575594_A_new_contribution_to_fixed_point_theory_in_partial_quasi-metric_spaces_and_its_applications_to_asymptotic_complexity_analysis_of_algorithms","268552081_An_Inquiry_into_Indistinguishability_Operators","266320733_Some_corollaries_of_the_correspondence_between_partial_metrics_and_multivalued_equalities","265996915_Representations_of_Transitive_Fuzzy_Relations","265521947_Many-valued_equalities_and_their_representation","265482928_Generated_fuzzy_implications_and_known_classes_of_implications","265367789_Pseudo-metrics_and_T-equivalences"]}