{"id":"340459713_Optimisation_de_composants_hyperfrequences_par_la_technique_des_plans_a_surfaces_de_reponses","abstract":"This work focuses on the application of the response surface methodology to optimize microwave components. Components are seen as black boxes receiving input parameters and providing outputs. The relationship between the inputs (factors) and outputs (responses) is described by a polynomial obtained by means of a statistical study. This last one is conducted in accordance with the responses surfaces methodology. We make the required mathematical and statistical analyses to validate the polynomial models used and then a multicriteria optimization which consists in transforming all the responses in individual desirability functions. An overall desirability function defined from these individual desirability functions associated with various objectives, must be then maximized. The use of a minimization algorithm (BFGS) from the models provided by the designs of experiments yielded a large number of local minima with restricted domain of input factors to identify a solution of high quality. When there are correlations between factors, it is impossible to implement a classic design to solve an optimization problem, the geometry of the experimental filed loses its regularity, optimal designs must be used. We study in the latter part of this thesis the criteria on which we based to build an optimal design illustrated by examples of optimization of two kinds of resonators.","authors":["Khaled Khoder"],"meta":["December 2011","DOI:10.6084/m9.figshare.12086298","Thesis for: PhDAdvisor: Annie Bessaudou, Françoise Cosset and Christophe Durousseau"],"references":["324621853_Optimum_Experimental_Designs","324308042_Regression_Diagnostics_--_Identifying_Influential_Data_and_Sources_of_Collinearity","324281612_Applied_Regression_Analysis","313446488_Ridge_regression_Biased_estimation_for_nonorthogonal_problems","312977241_Simultaneous_optimization_of_several_response_variables","312629019_Optimization_by_Design_of_Experiment_techniques","307534448_Response_Surface_Methodology_Process_and_Product_Optimization_Using_Designed_Experiments","306276761_The_desirability_function","302970924_A_Simplex_Method_for_Function_Minimization","292447315_Statistical_treatment_of_animal_experiments","280939936_'On_the_Experimental_Attainment_Optimum_Conditions'","278782569_Techniques_d'optimisation_de_forme_pour_la_conception_de_composants_hyperfrequences","272709768_Theory_of_Optimal_Experiments","271808806_Asymptotic_Regression","271512997_Analyse_de_regression_appliquee"]}