{"id":"340436005_Development_of_a_Mobile-Learning_Platform_for_Entrepreneurship_Education_in_Nigeria","abstract":"The evolution of mobile technologies has changed the way learning is conveyed, received and evaluated. The emerging bond between technology and education has increased the need for use of digital tools for teaching and learning. There is a growing demand for entrepreneurship education across the globe. This may not be unconnected with the alarming rate of unemployment which has necessitated the inclusion of entrepreneurship studies in school curriculum to enhance skill development and job creation. The introduction of entrepreneurial studies in learning institutions provides students with the opportunities to learn various vocational and technical skills in addition to their major course of study in the college or university. Entrepreneurship education produces young entrepreneurs who can create marketable ideas, products, and jobs for themselves and others. The teaching of entrepreneurial courses at school involves lots of practical sessions of which students are often required to submit feedback to the teachers to assess their level of assimilation. Considering the potentials of mobile technologies in education, the study developed a mobile-learning platform for entrepreneurship education in Nigeria. The m-learning platform has the capacity to facilitate students' assignment submission; idea generation and presentation. Students can share pictures and videos to showcase their creative works on the platform for feedback and patronage, and to tutor other students on how to create a particular product or perform a given skill. The platform provides opportunity for students to take ownership of their own learning, and it promotes active, experimental, and inquiry-based learning thereby enhancing student's entrepreneurial spirit. The mobile platform provides motivational learning environment for effective teaching and learning of entrepreneurial courses.","authors":["Edeh Michael Onyema","Noorulhasan Naveed Quadri","Alhuseen Omar Alsayed","Nwafor Chika Eucheria"],"meta":["February 2020","Projects: Make Poverty  HistoryALL RESEARCHERS WELCOME GLOBAL PLATFORMEducation"],"references":["345004336_A_Compendium_of_Pedagogies_for_Teaching_Entrepreneurship_A_Compendium_of_Pedagogies_for_Teaching_Entrepreneurship","344386269_ICT_as_a_Viable_Tool_for_Enterpreneurship_Education","335840966_Developing_a_Mobile_Learning_Application_for_Entrepreneurship_Education_in_Uganda_and_Zambia","335698140_Opportunities_and_challenges_of_the_use_of_mobile_phone_technology_in_teaching_and_learning_in_Nigeria-_A_Review","324860589_Opportunities_and_Challenges_to_Use_ICT_in_Government_School_Education_of_Nepal","323546570_Entrepreneurship_Education_An_Experimental_Study_with_Information_and_Communication_Technology","306038910_ENTREPRENEURSHIP_EDUCATION_AND_ACTION-ORIENTED_PEDAGOGICAL_APPROACHES","257714381_The_Impact_of_Information_Technology_in_Banking_System_A_Case_Study_in_Bank_Keshavarzi_IRAN","318369456_Networks_Technology_and_Entrepreneurship_A_Field_Quasi-experiment_among_Women_in_Rural_India","285173384_Entrepreneurship_Instruction_with_Information_and_Communication_Technology_ICT_and_Improvement_of_Entrepreneurial_Practices_in_Nigeria_for_Global_Competitiveness"]}