{"id":"340425907_Fixed_point_sets_in_digital_topology_1","abstract":"In this paper, we examine some properties of the fixed point set of a digitally continuous function. The digital setting requires new methods that are not analogous to those of classical topological fixed point theory, and we obtain results that often differ greatly from standard results in classical topology.\nWe introduce several measures related to fixed points for continuous self-maps on digital images, and study their properties. Perhaps the most important of these is the fixed point spectrum F(X) of a digital image: that is, the set of all numbers that can appear as the number of fixed points for some continuous self-map. We give a complete computation of F(C_n) where C_n is the digital cycle of n points. For other digital images, we show that, if X has at least 4 points, then F(X) always contains the numbers 0, 1, 2, 3, and the cardinality of X. We give several examples, including C_n, in which F(X) does not equal {0, 1, ... , #X}.\nWe examine how fixed point sets are affected by rigidity, retraction, deformation retraction, and the formation of wedges and Cartesian products. We also study how fixed point sets in digital images can be arranged; e.g., for some digital images the fixed point set is always connected.","authors":["Laurence Boxer","P. Christopher Staecker"],"meta":["April 2020Applied General Topology 21(1):87","DOI:10.4995/agt.2020.12091"],"references":["325841879_Remarks_on_Fixed_Point_Assertions_in_Digital_Topology","312091386_Alternate_Product_Adjacencies_in_Digital_Topology","306186519_Generalized_Normal_Product_Adjacency_in_Digital_Topology","279968212_Digital_Fixed_Points_Approximate_Fixed_Points_and_Universal_Functions","277648964_Homotopy_Equivalence_in_Finite_Digital_Images","228785775_Continuous_Maps_on_Digital_Simple_Closed_Curves","237873444_Lectures_on_Nielsen_Fixed_Point_Theory","236176949_Fundamental_Groups_for_Digital_Products","223704833_'Continuous'_functions_on_digital_pictures","222479916_Digitally_continuous_functions"]}