{"id":"340544930_Requirements_engineering_issues_causing_software_development_outsourcing_failure","abstract":"Software development outsourcing is becoming more and more famous because of the advantages like cost abatement, process enhancement, and coping with the scarcity of needed resources. Studies confirm that unfortunately a large proportion of the software development outsourcing projects fails to realize anticipated benefits. Investigations into the failures of such projects divulge that in several cases software development outsourcing projects are failed because of the issues that are associated with requirements engineering process. The objective of this study is the identification and the ranking of the commonly occurring issues of the requirements engineering process in the case of software development outsourcing. For this purpose, contemporary literature has been assessed rigorously, issues faced by practitioners have been identified and three questionnaire surveys have been organized by involving experienced software development outsourcing practitioners. The Delphi technique, cut-off value method and 50% rule have also been employed. The study explores 150 issues (129 issues from literature and 21 from industry) of requirements engineering process for software development outsourcing, groups the 150 issues into 7 identified categories and then extricates 43 customarily or commonly arising issues from the 150 issues. Founded on ‘frequency of occurrence’ the 43 customarily arising issues have been ranked with respect to respective categories (category-wise ranking) and with respect to all the categories (overall ranking). Categories of the customarily arising issues have also been ranked. The issues’ identification and ranking contribute to design proactive software project management plan for dealing with software development outsourcing failures and attaining conjectured benefits of the software development outsourcing.","authors":["Javed Iqbal","Rodina Ahmad","Muzafar Khan","Fazal-e- Amin"],"meta":["April 2020PLoS ONE 15(4):e0229785","DOI:10.1371/journal.pone.0229785"],"references":["325094979_Effect_of_Project_Management_in_Requirements_Engineering_and_Requirements_Change_Management_Processes_for_Global_Software_Development","322108595_Taxonomy_of_Factors_Causing_Integration_Failure_during_Global_Software_Development","319277366_Challenges_of_management_in_the_operation_of_virtual_software_development_teams_A_systematic_literature_review","307917815_Toward_successful_project_management_in_global_software_development","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","321119564_Innovating_or_doing_as_Told_Status_Differences_and_Overlapping_Boundaries_in_Offshore_Collaboration","318227704_Key_Factors_that_Influence_Task_Allocation_in_Global_Software_Development","313769615_Social_issues_in_requirements_engineering","311984351_A_Requirements_Engineering_Process_Adapted_to_Global_Software_Development","305870091_Challenges_of_Project_Management_in_Global_Software_Development_A_Client-Vendor_Analysis"]}