{"id":"340510494_DNA_punch_cards_for_storing_data_on_native_DNA_sequences_via_enzymatic_nicking","abstract":"Synthetic DNA-based data storage systems have received significant attention due to the promise of ultrahigh storage density and long-term stability. However, all known platforms suffer from high cost, read-write latency and error-rates that render them noncompetitive with modern storage devices. One means to avoid the above problems is using readily available native DNA. As the sequence content of native DNA is fixed, one can modify the topology instead to encode information. Here, we introduce DNA punch cards, a macromolecular storage mechanism in which data is written in the form of nicks at predetermined positions on the backbone of native double-stranded DNA. The platform accommodates parallel nicking on orthogonal DNA fragments and enzymatic toehold creation that enables single-bit random-access and in-memory computations. We use Pyrococcus furiosus Argonaute to punch files into the PCR products of Escherichia coli genomic DNA and accurately reconstruct the encoded data through high-throughput sequencing and read alignment. Current synthetic DNA-based data storage systems have high recording costs, read-write latency and error-rates that make them uncompetitive compared to traditional digital storage. The authors use nicks in native DNA to encode data in parallel and create access sites for in-memory computations.","authors":["S. Kasra Tabatabaei","Boya Wang","Nagendra Bala Murali Athreya","Behnam Enghiad"],"meta":["April 2020Nature Communications 11(1)","DOI:10.1038/s41467-020-15588-z"],"references":["336734186_Image_processing_in_DNA","334218000_Encoding_information_in_synthetic_metabolomes","332377782_High_density_DNA_data_storage_library_via_dehydration_with_digital_microfluidic_retrieval","330091341_Detecting_topological_variations_of_DNA_at_single-molecule_level","325830578_De_novo_DNA_synthesis_using_polymerase-nucleotide_conjugates","353583262_All-atom_empirical_force_field_for_nucleic_acids_I_Parameter_optimization_based_on_small_molecule_and_condensed_phase_macromolecular_target_data","329923175_Digital_Data_Storage_Using_DNA_Nanostructures_and_Solid-State_Nanopores","329645768_Effective_design_principles_for_leakless_strand_displacement_systems","324906939_Exabytes_in_a_Test_Tube","318963854_Erratum_to_DNA_Computing_and_Molecular_Programming"]}