{"id":"340532669_Predicting_motor_outcome_in_preterm_infants_from_very_early_brain_diffusion_MRI_using_a_deep_learning_convolutional_neural_network_CNN_model","abstract":"BACKGROUND AND AIMS\nPreterm birth imposes a high risk for developing neuromotor delay. Earlier prediction of adverse outcome in preterm infants is crucial for referral to earlier intervention. This study aimed to predict abnormal motor outcome at 2 years from early brain diffusion magnetic resonance imaging (MRI) acquired between 29 and 35 weeks postmenstrual age (PMA) using a deep learning convolutional neural network (CNN) model.\n\nMETHODS\nSeventy-seven very preterm infants (born <31 weeks gestational age (GA)) in a prospective longitudinal cohort underwent diffusion MR imaging (3T Siemens Trio; 64 directions, b=2000 s/mm²). Motor outcome at 2 years corrected age (CA) was measured by Neuro-Sensory Motor Developmental Assessment (NSMDA). Scores were dichotomised into normal (functional score: 0, normal; n=48) and abnormal scores (functional score: 1-5, mild-profound; n=29). MRIs were pre-processed to reduce artefacts, upsampled to 1.25 mm isotropic resolution and maps of fractional anisotropy (FA) were estimated. Patches extracted from each image were used as inputs to train a CNN, wherein each image patch predicted either normal or abnormal outcome. In a postprocessing step, an image was classified as predicting abnormal outcome if at least 27% (determined by a grid search to maximise the model performance) of its patches predicted abnormal outcome. Otherwise, it was considered as normal. Ten-fold cross-validation was used to estimate performance. Finally, heatmaps of model predictions for patches in abnormal scans were generated to explore the locations associated with abnormal outcome.\n\nRESULTS\nFor the identification of infants with abnormal motor outcome based on the FA data from early MRI, we achieved mean sensitivity 70% (standard deviation SD 19%), mean specificity 74% (SD 39%), mean AUC (area under the receiver operating characteristic curve) 72% (SD 14%), mean F1 score of 68% (SD 13%) and mean accuracy 73% (SD 19%) on an unseen test data set. Patch-based prediction heatmaps showed that the patches around the motor cortex and somatosensory regions were most frequently identified by the model with high precision (74%) as a location associated with abnormal outcome. Part of the cerebellum, and occipital and frontal lobes were also highly associated with abnormal NSMDA/motor outcome.\n\nDISCUSSION/CONCLUSION\nThis study established the potential of an early brain MRI-based deep learning CNN model to identify preterm infants at risk of a later motor impairment and to identify brain regions predictive of adverse outcome. Results suggest that predictions can be made from FA maps of diffusion MRIs well before term equivalent age (TEA) without any prior knowledge of which MRI features to extract and associated feature extraction steps. This method, therefore, is suitable for any case of brain condition/abnormality. Future studies should be conducted on a larger cohort to re-validate the robustness and effectiveness of these models.","authors":["Susmita Saha","Alex M Pagnozzi","Pierrick Bourgeat","Joanne M George"],"meta":["April 2020NeuroImage 215(2):116807","DOI:10.1016/j.neuroimage.2020.116807"],"references":["329617174_An_overview_of_deep_learning_in_medical_imaging_focusing_on_MRI","329433102_Stroke_Lesion_Outcome_Prediction_Based_on_MRI_Imaging_Combined_With_Clinical_Information","328752197_Convolutional_Neural_Networks-Based_MRI_Image_Analysis_for_the_Alzheimer's_Disease_Prediction_From_Mild_Cognitive_Impairment","327145749_Seizure_prediction_-_ready_for_a_new_era","323493541_Neurodevelopmental_Outcome_at_2_Years_for_Preterm_Children_Born_at_22_to_34_Weeks'_Gestation_in_France_in_2011_EPIPAGE-2_Cohort_Study","322847950_Early_prediction_of_cognitive_deficits_in_very_preterm_infants_using_functional_connectome_data_in_an_artificial_neural_network_framework","319144793_Neurodevelopmental_outcome_at_2_years_for_preterm_children_born_at_22_to_34_weeks'_gestation_in_France_in_2011_EPIPAGE-2_cohort_study","329354079_Patch-based_system_for_Classification_of_Breast_Histology_images_using_deep_learning","324898648_Prediction_of_Tissue_Outcome_and_Assessment_of_Treatment_Effect_in_Acute_Ischemic_Stroke_Using_Deep_Learning","317720245_The_link_between_motor_and_cognitive_development_in_children_born_preterm_andor_with_low_birth_weight_A_review_of_current_evidence"]}