{"id":"340530873_Proposal_of_Technological_GIS_Support_as_Part_of_Resident_Parking_in_Large_Cities-Case_Study_City_of_Brno","abstract":"Over the last few years, there has been a significant increase in people’s dependence on passenger and freight transport. As a result, traffic infrastructure is congested, especially in big city centers and, at critical times, this is to the point of traffic collapse. This has led to the need to address this situation by the progressive deployment of Intelligent Transport Systems (ITS), which are used to optimize traffic, to increase traffic flow, and to improve transport safety, including reduction of adverse environmental impacts. In 2018, the first results of the C-Roads Platform which is a joint initiative of European Member States and road operators for testing and implementing C-ITS services in light of cross-border harmonization and interoperability (C-ROADS) Czech Republic project were put into operation in Brno, closely related to the international initiative to support the data structure for future communication between vehicles and intelligent transport infrastructure. A system of transport organization and safety was introduced in the city of Brno, which manages key information and ensures central management of partial systems of transport organization and safety. The most important part of this system is the parking organization system discussed in this article. The main objective was to streamline the parking system in the city center of Brno and in the immediate vicinity by preventing unauthorized long-term parking, ensuring an increased number of parking places for residents and visitors by increasing the turnover of parking. The aim of the research was to investigate (i) the possibility and optimal use of Geographic Information System (GIS) technology for resident parking system solutions, (ii) the integration of Global Satellite Navigation Systems (GNSS) satellite data and image data collected by cameras on the move and (iii) the possibility of using network algorithms to optimize mobile data collection planning. The aim of our study is to design and optimize the integrated collection of image data localized by satellite GNSS technologies in the GIS environment to support the resident parking system, including an evaluation of its effectiveness. To achieve this goal, a residential parking monitoring system was designed and implemented, based on dynamic monitoring of the parking state using a vehicle equipped with a digital camera system and Global Satellite Navigation Systems (GNSS) technology for measuring the vehicle position, controlled by spatial and attribute data flow from static and dynamic spatial databases in the Geographic Information System (GIS), which integrate the whole monitoring system. The control algorithm of a vehicle passing through the street network works on the basis of graph theory with a defined recurrence interval for the same route, taking into account other parameters such as the throughput of the street network at a given time, its traffic signs and the usual level of traffic density. Statistics after one year of operation show that the proposed system significantly increased the economic yield from parking areas from the original 30% to 90%, and reduced the overall violation of parking rules to only 10%. It further increased turnover and thus the possibility of short-term parking for visitors and also ensured availability of parking for residents in the historical center of Brno and surrounding monitored areas.","authors":["Pavel Kubíček","Dalibor Bartoněk","Jiri Bures","Otakar Švábenský"],"meta":["April 2020Symmetry 12(4):542","DOI:10.3390/sym12040542"],"references":["332815834_Cost_and_Time-Integrated_Road-to-Park_Cruising_Prevention_Scheme_in_Smart_Transportation","332540156_Smart_Parking_Architecture_based_on_Multi_Agent_System","332491347_Electric_Charging_Demand_Location_Model-A_User-_and_Destination-Based_Locating_Approach_for_Electric_Vehicle_Charging_Stations","332333099_future_internet_A_Review_of_Machine_Learning_and_IoT_in_Smart_Transportation","332199256_Optimal_allocation_of_public_parking_spots_in_a_smart_city_problem_characterisation_and_first_algorithms","332090201_Where_to_park_Architecture_and_implementation_of_an_empty_parking_lot_automatic_recognition_system","331461142_Weak_signals_in_the_mobility_landscape_car_sharing_in_ten_European_cities","331431341_A_Proposed_Model_of_Integrated_Smart_Parking_Solution_for_a_city","337718494_Exploring_the_effect_of_group_decision_on_information_search_behaviour_in_web-based_collaborative_GIS-MCDA","332213955_SimulCity_Planning_Communications_in_Smart_Cities"]}