{"id":"340565749_Leveraging_Machine-learning_Techniques_to_Analyze_Computing_Persistence_in_Undergraduate_Programs","abstract":"Although student retention remains a significant concern for all Science, Technology, Engineering, and Mathematics (STEM) fields, it is particularly problematic in computing, where enrollment in such programs has not kept pace with the industry demands. Thus, finding meaningful patterns in historical data can help education researchers to reveal the possible reasons for students' withdrawal from a university, and can provide guidelines and mechanisms that lead to improving retention rates. To achieve this goal, we considered the importance of different factors in the graduation of computing students, and generated a predictive model for student graduation using the Multiple-Institution Database for Investigating Engineering Longitudinal Development (MIDFIELD) dataset. We observed that considering input and environment educational variables, cumulative GPA, number of terms registered, start year, institution, and being a transfer student, are the most important features, respectively. Our results also demonstrate that Random Forest algorithm produced a more accurate result on this dataset compared to other machine learning algorithms. We anticipate findings from this ongoing work will give insight to the computing education community and researchers to better understand the relative success of computing students, and that this will, in turn, enable strategic solutions to attain higher retention rates. Introduction In general, jobs in STEM fields continue to flourish relative to positions in other fields, however, computing graduates (consisting of students in computer science, computer engineering, and information sciences) are particularly in demand. It is estimated that within a ten year span, growth will increase 32% for information security analysts and 26% for software developers [1]. Despite the professional need for more graduates, undergraduate students in computer or information science have a 59% rate of attrition, which is the highest rate relative to students from other STEM majors [2]. In part, this is due to retention challenges in computer science, although many factors may play a role in a students' decision to drop out. Since pathway patterns for computing students are different from engineering students, it is crucial to specifically explore the variables that contribute to positive academic outcomes in computing fields, to find ways to improve the graduation rate [3].","authors":["Leila Zahedi","Stephanie J Lunn","Samira Pouyanfar","Monique Ross"],"meta":["June 2020","DOI:10.18260/1-2--34921","Conference: 2020 ASEE Virtual Annual Conference Content AccessAt: Virtual On line . https://peer.asee.org/34921","Project: MIDFIELD"],"references":["332847786_Why_High_School_Grades_Are_Better_Predictors_of_On-Time_College_Graduation_Than_Are_Admissions_Test_Scores_The_Roles_of_Self-Regulation_and_Cognitive_Ability","332353501_Evaluation_of_algorithms_to_predict_graduation_rate_in_higher_education_institutions_by_applying_educational_data_mining","323860387_Prospectively_predicting_4-year_college_graduation_from_student_applications","320988337_Machine_Learning_in_Action","311595627_Excerpts_from_Science_and_Engineering_Indicators_1998","311488933_Applying_the_Communal_Goal_Congruity_Perspective_to_Enhance_Diversity_and_Inclusion_in_Undergraduate_Computing_Degrees","310824798_XGBoost_A_Scalable_Tree_Boosting_System","309179052_Kinks_in_the_STEM_pipeline_Tracking_graduation_rates_using_high_school_and_college_science_and_mathematics_performance","305465792_The_multiple-institution_database_for_investigating_engineering_longitudinal_development_An_experiential_case_study_of_data_sharing_and_Reuse","296342438_Ensemble_machine_learning_Methods_and_applications"]}