{"id":"340515140_FRLLE_A_Failure_Rate_and_Load_based_Leader_Election_Algorithm_for_a_Bidirectional_Ring_in_Distributed_Systems","abstract":"In a distributed system, multiple nodes work together to build a highly available, reliable, resource shareable, and fault-tolerant system to achieve a common goal. Here, multiple nodes work together to complete a task, so coordination is essential among these nodes. Electing a node as a system leader from among all the nodes can\nbe a possible solution to do the coordination. Besides coordination, the leader also controls various activities like task allocation, result aggregation, efficient resource sharing, clock synchronization, and communication among the nodes of the system. In this work, we address the leader election problem through a new leader election\nalgorithm called Failure Rate and Load-based Leader Election (FRLLE) algorithm for bidirectional ring networks. The proposed algorithm elects a node with a minimum failure rate and load as well so that the system gets a more reliable leader that can concentrate on leadership roles and activity comfortably. Like a proper leader election algorithm, this algorithm satisfies safety, liveness, and termination conditions\nthat help to build an efficient and consistent distributed system. This algorithm reduces the message and time complexity, which means the algorithm takes fewer time steps to elect a leader by exchanging fewer messages. We compare the simulation results of the FRLLE algorithm with the well-known existing leader election algorithms and demonstrate that the FRLLE algorithm exchanges fewer messages\nand takes fewer time steps to elect the leader. We further carried out a priori complexity analysis and compared the outcome with the results of the simulation to corroborate our proposal.","authors":["Amit Biswas","Ashish Kumar Maurya","Anil Kumar Tripathi","Samir Aknine"],"meta":["January 2021The Journal of Supercomputing 77(1)","DOI:10.1007/s11227-020-03286-y"],"references":["324278215_On_benchmarking_task_scheduling_algorithms_for_heterogeneous_computing_systems","322877874_An_election_protocol_based_on_group_membership_detection_algorithm_in_mobile_ad_hoc_distributed_systems","321042980_Multi-leader_election_in_dynamic_sensor_networks","344736856_Coordinating_Plans_of_Autonomous_Agents","332480405_Novel_algorithm_for_leader_election_process_in_virtual_traffic_light_protocol","331214350_Distributed_Protocols_for_Leader_Election_A_Game-Theoretic_Perspective","328922647_Loosely-Stabilizing_Leader_Election_for_Arbitrary_Graphs_in_Population_Protocol_Model","325143240_Fair_Leader_Election_for_Rational_Agents_in_Asynchronous_Rings_and_Networks","322515845_Cluster_Leader_Election_Problem_for_Distributed_Controller_Placement_in_SDN","320893191_A_New_Leader_Election_Algorithm_in_Hypercube_Networks"]}