{"id":"340584631_Mapping_the_interdisciplinarity_in_information_behavior_research_a_quantitative_study_using_diversity_measure_and_co-occurrence_analysis","abstract":"Information behavior research is an interdisciplinary field in essence due to the investigation of interdisciplinary in previous work. To track the changes in interdisciplinarity of this field, more efforts should be put on basis of previous work. Based on publications searched from Web of Science from 2000 to 2018, we explored the interdisciplinarity of this field drawing on network analysis and diversity measure. Findings showed that although variety of disciplines in this field augmented significantly, the distribution of disciplines is unbalanced and concentrated on some dominant disciplines such as computer science, engineering, psychology, social science and medicine, etc. Relationships among disciplines have evolved over time and mainly focused on neighboring disciplines instead of distinct disciplines. Computer science, engineering, psychology, health science and social science function as intermediate disciplines connecting distinct disciplinary groups. Besides, the measurement using diversity measure shows that interdisciplinary degree of this field appears to decrease. This study contributes to the evolution and measurement of interdisciplinarity of information behavior research, which has implications for researchers and practitioners in this field.","authors":["Shengli Deng","Sudi Xia"],"meta":["April 2020Scientometrics 124(4)","DOI:10.1007/s11192-020-03465-x"],"references":["335323662_Libraries_and_Fake_News_What's_the_Problem_What's_the_Plan","333326318_Big_Data_and_quality_data_for_fake_news_and_misinformation_detection","328260386_A_comparison_of_two_approaches_for_measuring_interdisciplinary_research_output_The_disciplinary_diversity_of_authors_vs_the_disciplinary_diversity_of_the_reference_list","323833324_Habits_of_Mind_in_an_Uncertain_Information_World","331045618_From_health_to_performance_Amateur_runners'_personal_health_information_management_with_activity_tracking_technology","327047376_Measuring_the_interdisciplinarity_of_Big_Data_research_a_longitudinal_study","326634200_Getting_acquainted_with_social_networks_and_apps_combating_fake_news_on_social_media","325134596_Geographical_visualization_of_research_collaborations_of_library_science_in_China","325125695_Applications_and_applicability_of_Social_Cognitive_Theory_in_information_science_research","323832986_A_Reference_for_That_Reference_in_the_Age_of_Disinformation"]}