{"id":"340589701_Use_of_the_semilinear_method_to_predict_the_impact_corridor_on_ground","abstract":"We propose an adaptation of the semilinear algorithm for the prediction of the impact corridor on ground of an Earth-impacting asteroid. The proposed algorithm provides an efficient tool, able to reliably predict the impact regions at fixed altitudes above ground with 5 orders of magnitudes less computations than Monte Carlo approaches. Efficiency is crucial when dealing with imminent impactors, which are characterised by high impact probabilities and impact times very close to the times of discovery. The case of 2008 TC3 is a remarkable example, but there are also recent cases of imminent impactors, 2018 LA and 2019 MO, for which the method has been successfully used. Moreover, its good performances make the tool suitable also for the analysis of the impact regions on ground of objects with a more distant impact time, even of the order of many years, as confirmed by the test performed with the first batch of observations of Apophis, giving the possibility of an impact 25 years after its discovery.","authors":["Linda Dimare","Alessio Del Vigna","Davide Bracali Cioci","Fabrizio Bernardi"],"meta":["April 2020Celestial Mechanics and Dynamical Astronomy 132(3)","DOI:10.1007/s10569-020-09959-3"],"references":["342676951_Improving_impact_monitoring_through_Line_Of_Variations_densification","327792042_Completeness_of_Impact_Monitoring","325193745_Detecting_the_Yarkovsky_effect_among_near-Earth_asteroids_from_astrometric_data","322498210_Short_arc_orbit_determination_and_imminent_impactors_in_the_Gaia_era","271610260_The_Asteroid_Identification_Problem_II_Target_Plane_Confidence_Boundaries","315062283_The_impact_trajectory_of_asteroid_2008_TC_3","305959098_An_efficient_integrator_that_uses_Gauss-Radau_spacings","290526912_The_atmospheric_impact_trajectory_of_asteroid_2014_AA","274403396_Systematic_ranging_and_late_warning_asteroid_impacts","268726706_Cours_d'analyse_de_l'Ecole_polytechnique"]}