{"id":"340541009_YOLO-Tomato_A_Robust_Algorithm_for_Tomato_Detection_based_on_YOLOv3","abstract":"Automatic fruit detection is a very important benefit of harvesting robots. However, complicated environment conditions, such as illumination variation, branch, and leaf occlusion as well as tomato overlap, have made fruit detection very challenging. In this study, an improved tomato detection model called YOLO-Tomato is proposed for dealing with these problems, based on YOLOv3. A dense architecture is incorporated into YOLOv3 to facilitate the reuse of features and help to learn a more compact and accurate model. Moreover, the model replaces the traditional rectangular bounding box (R-Bbox) with a circular bounding box (C-Bbox) for tomato localization. The new bounding boxes can then match the tomatoes more precisely, and thus improve the Intersection-over-Union (IoU) calculation for the Non-Maximum Suppression (NMS). They also reduce prediction coordinates. An ablation study demonstrated the efficacy of these modifications. The YOLO-Tomato was compared to several state-of-the-art detection methods and it had the best detection performance.","authors":["Guoxu Liu","Joseph Christian Nouaze","Philippe Lyonel Touko","Jae Ho Kim"],"meta":["April 2020Sensors 20(7)","DOI:10.3390/s20072145"],"references":["332777280_A_Mature-Tomato_Detection_Algorithm_Using_Machine_Learning_and_Color_Analysis","323357827_Deep_Learning_in_Agriculture_A_Survey","316945117_Deep_Count_Fruit_Counting_Based_on_Deep_Simulated_Learning","320967941_YOLO9000_Better_Faster_Stronger","320964510_Feature_Pyramid_Networks_for_Object_Detection","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","318692655_Deep_fruit_detection_in_orchards"]}