{"id":"340572613_Impact_of_Programming_Exposure_on_the_Development_of_Computational_Thinking_Capabilities_An_Empirical_Study","abstract":"Today’s digital society has turned the development of students’ computational thinking capabilities into a critical factor for their future success. As higher education institutions, we need to take responsibility for this development in every degree course we offer, and provide students with the kind of subjects and activities that best contribute to this aim. In this paper, we study the impact of following an introductory programming course on the development of the computational thinking capabilities of university students. In order to achieve this aim, a concurrent cohort observational study was carried out in which we measured both the subjective and objective computational thinking capabilities of 104 participants (50 first year students enrolled on a Bachelor’s degree course in Psychology at the Catholic University of Murcia (UCAM), and 54 first year students enrolled on a Bachelor’s degree course in Health Information Systems at the University of Alicante (UA)). The statistical procedures applied to test our hypotheses were a two-way mixed ANOVA, a paired-sample T-test and an independent-sample T-test. The data shows that the group at UA had an initial higher subjective perception of their computational capabilities than the group at UCAM. This perception was supported by their objective scores, which were also significantly higher. However, the subjective assessment of computational capability of the UA group diminished after exposure to the programming course, contrasting with the fact that their objective computational capabilities improved significantly. In the UCAM group, both subjective and objective capabilities remained constant over time. Based on these results, we can conclude that computational thinking capabilities are not developed naturally, but need to be trained. Providing such training to all our students, and not only to those enrolled on undergraduate degrees in engineering, is of paramount importance to allow them to face the challenges of their future professions. This paper empirically demonstrates the extent to which exposing subjects to a programming course may contribute to this aim.","authors":["Cristina Cachero","Pilar Barra","Santiago Meliá","Otoniel Mario López Granado"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2987254"],"references":["337167120_Combining_Assessment_Tools_for_a_Comprehensive_Evaluation_of_Computational_Thinking_Interventions","334112424_Measuring_Secondary_School_Students'_Competence_in_Computational_Thinking_in_ICILS_2018-Challenges_Concepts_and_Potential_Implications_for_School_Systems_Around_the_World","322987854_Computational_Thinking_in_Secondary_Education_Where_does_it_fit_A_systematic_literary_review","316447552_Measuring_Computational_Thinking_Development_with_the_FUN_Tool","308880760_What_Computational_Thinking_Is","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","290391277_COMPUTATIONAL_THINKING_TEST_DESIGN_GUIDELINES_AND_CONTENT_VALIDATION","274309848_Computational_Thinking","320029904_Extending_the_nomological_network_of_computational_thinking_with_non-cognitive_factors","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12"]}