{"id":"340655576_Clinical_Characteristics_of_COVID-19_Patients_With_Digestive_Symptoms_in_Hubei_China_A_Descriptive_Cross-Sectional_Multicenter_Study","abstract":"Objective: \nSince the outbreak of Coronavirus Disease 2019 (COVID-19) in December 2019, various digestive symptoms have been frequently reported in patients infected with the virus. In this study, we aimed to further investigate the prevalence and outcomes of COVID-19 patients with digestive symptoms.\n\nMethods: \nIn this descriptive, cross-sectional, multicenter study, we enrolled confirmed patients with COVID-19 who presented to 3 hospitals from January 18, 2020, to February 28, 2020. All patients were confirmed by real-time polymerase chain reaction and were analyzed for clinical characteristics, laboratory data, and treatment. Data were followed up until March 18, 2020.\n\nResults: \nIn the present study, 204 patients with COVID-19 and full laboratory, imaging, and historical data were analyzed. The average age was 52.9 years (SD ± 16), including 107 men and 97 women. Although most patients presented to the hospital with fever or respiratory symptoms, we found that 103 patients (50.5%) reported a digestive symptom, including lack of appetite (81 [78.6%] cases), diarrhea (35 [34%] cases), vomiting (4 [3.9%] cases), and abdominal pain (2 [1.9%] cases). If lack of appetite is excluded from the analysis (because it is less specific for the gastrointestinal tract), there were 38 total cases (18.6%) where patients presented with a gastrointestinal-specific symptom, including diarrhea, vomiting, or abdominal pain. Patients with digestive symptoms had a significantly longer time from onset to admission than patients without digestive symptoms (9.0 days vs 7.3 days). In 6 cases, there were digestive symptoms, but no respiratory symptoms. As the severity of the disease increased, digestive symptoms became more pronounced. Patients with digestive symptoms had higher mean liver enzyme levels, lower monocyte count, longer prothrombin time, and received more antimicrobial treatment than those without digestive symptoms.\n\nDiscussion: \nWe found that digestive symptoms are common in patients with COVID-19. Moreover, these patients have a longer time from onset to admission, evidence of longer coagulation, and higher liver enzyme levels. Clinicians should recognize that digestive symptoms, such as diarrhea, are commonly among the presenting features of COVID-19 and that the index of suspicion may need to be raised earlier in at-risk patients presenting with digestive symptoms. However, further large sample studies are needed to confirm these findings.","authors":["Lei Pan","Mi Mu","Pengcheng Yang","Yu Sun"],"meta":["April 2020The American Journal of Gastroenterology 115(5)","DOI:10.14309/ajg.0000000000000620"],"references":["339775145_The_2019_Novel_Coronavirus_Outbreak_-_A_Global_Threat","339672829_Epidemiologic_Features_and_Clinical_Course_of_Patients_Infected_With_SARS-CoV-2_in_Singapore","339669883_Evidence_for_Gastrointestinal_Infection_of_SARS-CoV-2","339543108_Comparison_of_different_samples_for_2019_novel_coronavirus_detection_by_nucleic_acid_amplification_tests","341796410_Detection_of_Novel_Coronavirus_by_RT-PCR_in_Stool_Specimen_from_Asymptomatic_Child_China","339849276_The_SARS-CoV-2_Outbreak_Diagnosis_Infection_Prevention_and_Public_Perception","339849142_Clinical_characteristics_and_influencing_factors_of_patients_with_novel_coronavirus_pneumonia_combined_with_liver_injury_in_Shaanxi_region","339763891_Are_high-performing_health_systems_resilient_against_the_COVID-19_epidemic","339760093_SARS-CoV-2_is_an_appropriate_name_for_the_new_coronavirus","339594361_Clinical_Characteristics_of_Imported_Cases_of_COVID-19_in_Jiangsu_Province_A_Multicenter_Descriptive_Study"]}