{"id":"340637861_A_Model_for_Computing_Skyline_Data_Items_in_Cloud_Incomplete_Databases","abstract":"Skyline queries intend to retrieve the most superior data items in the database that best fit with the user’s given preference. However, processing skyline queries are expensive and uneasy when applying on large distributed databases such as cloud databases. Moreover, it would be further sophisticated to process skyline queries if these distributed databases have missing values in certain dimensions. The effect of data incompleteness on skyline process is extremely severe because missing values result in un-hold the transitivity property of skyline technique and leads to the problem of cyclic dominance. This paper proposes an efficient model for computing skyline data items in cloud incomplete databases. The model focuses on processing skyline queries in cloud incomplete databases aiming at reducing the domination tests between data items, the processing time, and the amount of data transfer among the involved datacenters. Various set of experiments are conducted over two different types of datasets and the result demonstrates that the proposed solution outperforms the previous approaches in terms of domination tests, processing time, and amount of data transferred.","authors":["Yonis Gulzar","Ali Amer Alwan","Abedallah Zaid Abualkishik","Abid Mehmood"],"meta":["January 2020Procedia Computer Science 170:249-256","DOI:10.1016/j.procs.2020.03.037","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["337997355_Optimizing_Skyline_Query_Processing_in_Incomplete_Data","330238993_D-SKY_A_Framework_for_Processing_Skyline_Queries_in_a_Dynamic_and_Incomplete_Database","329483231_SCSA_Evaluating_skyline_queries_in_incomplete_data","323779790_Identifying_skylines_in_cloud_databases_with_incomplete_data","321488533_A_Model_for_Processing_Skyline_Queries_in_Crowd-sourced_Databases","306048459_A_Framework_for_Evaluating_Skyline_Queries_over_Incomplete_Data","305080534_Processing_skyline_queries_in_incomplete_distributed_databases","294288292_An_Efficient_Approach_for_Processing_Skyline_Queries_in_Incomplete_Multidimensional_Database","313830633_Skyline_Preference_Query_Based_on_Massive_and_Incomplete_Dataset","302476677_Optimizing_Skyline_Queries_over_Incomplete_Data"]}