{"id":"340625421_Channel-Aware_Congestion_Control_in_Vehicular_Cyber-Physical_Systems","abstract":"In vehicular cyber-physical systems, cars are connected to create a mobile network called a vehicular ad hoc network (VANET) to perform various functions, including improved awareness of the surrounding environment. Moving vehicles continually broadcast beacon signals containing information such as position, heading, acceleration, steering angle, vehicle size, and accident notification. However, channel congestion in dense traffic conditions adversely affects network performance. To resolve congestion in VANETs, several works in the literature have studied congestion control. However, they have considered packet loss only as an indication of channel congestion regardless of channel condition. In this paper, we present a channel-aware congestion control algorithm (CACC) that controls the transmission power and data rate. We take into account the received signal strength (RSS) when diagnosing packet loss to determine channel conditions, such as severe fading or channel congestion. In the case of severe fading, we decrease the data rate for a more robust modulation and coding scheme. Additionally, we adjust the transmission power to maintain a desirable packet error rate. Our simulation results show that CACC significantly outperforms other distributed congestion control algorithms by reducing the packet loss rate and increasing the packet delivery ratio.","authors":["Byeong-Moon Cho","Min-Seong Jang","Kyung-Joon Park"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2987416"],"references":["336536537_A_Comparative_Experimental_Analysis_of_Channel_Access_Protocols_in_Vehicular_Networks","264587993_Statistical_Beaconing_Congestion_Control_for_Vehicular_Networks","264586284_LIMERIC_A_linear_adaptive_message_rate_algorithm_for_DSRC_congestion_control","263051140_Resolving_the_Unfairness_of_Distributed_Rate_Control_in_the_IEEE_WAVE_Safety_Messaging","224394976_Vehicle-to-Vehicle_Communication_Fair_Transmit_Power_Control_for_Safety-Critical_Information","333768882_Vehicular_Network_Simulation_Environment_via_Discrete_Event_System_Modeling","315483132_Diagnosing_Wireless_Packet_Losses_in_80211_Separating_Collision_from_Weak_Signal","269034043_IEEE_80211_rate_adaptation","260533698_Properties_of_the_MAC_Layer_in_Safety_Vehicular_Ad_Hoc_Networks","229441998_WaveLANR-II_A_high-performance_wireless_LAN_for_the_unlicensed_band"]}