{"id":"340639690_Actor-Critic_Deep_Reinforcement_Learning_for_Solving_Job_Shop_Scheduling_Problems","abstract":"In the past decades, many optimization methods have been devised and applied to job shop scheduling problem (JSSP) to find the optimal solution. Many methods assumed that the scheduling results were applied to static environments, but the whole environments in the real world are always dynamic. Moreover, many unexpected events such as machine breakdowns and material problems may be present to adversely affect the initial job scheduling. This work views JSSP as a sequential decision making problem and proposes to use deep reinforcement learning to cope with this problem. The combination of deep learning and reinforcement learning avoids handcraft features as used in traditional reinforcement learning, and it is expected that the combination will make the whole learning phase more efficient. Our proposed model comprises actor network and critic network, both including convolution layers and fully connected layer. Actor network agent learns how to behave in different situations, while critic network helps agent evaluate the value of statement then return to actor network. This work proposes a parallel training method, combining asynchronous update as well as deep deterministic policy gradient (DDPG), to train the model. The whole network is trained with parallel training on a multi-agent environment and different simple dispatching rules are considered as actions. We evaluate our proposed model on more than ten instances that are present in a famous benchmark problem library – OR library. The evaluation results indicate that our method is comparative in static JSSP benchmark problems, and achieves a good balance between makespan and execution time in dynamic environments. Scheduling score of our method is 91.12% in static JSSP benchmark problems, and 80.78% in dynamic environments.","authors":["Chien-Liang Liu","Chuan-Chin Chang","Chun-Jan Tseng"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2987820"],"references":["339286764_Multi-Agent_Reinforcement_Learning_Tool_for_Job_Shop_Scheduling_Problems","336911787_Grandmaster_level_in_StarCraft_II_using_multi-agent_reinforcement_learning","335674188_Channel_Access_and_Power_Control_for_Energy-Efficient_Delay-Aware_Heterogeneous_Cellular_Networks_for_Smart_Grid_Communications_Using_Deep_Reinforcement_Learning","335544700_Multi-Period_and_Multi-Spatial_Equilibrium_Analysis_in_Imperfect_Electricity_Markets_A_Novel_Multi-Agent_Deep_Reinforcement_Learning_Approach","334998694_UAV_Autonomous_Target_Search_Based_on_Deep_Reinforcement_Learning_in_Complex_Disaster_Scene","325713164_Deep_reinforcement_learning_for_semiconductor_production_scheduling","323141783_Deep_Reinforcement_Learning_for_Solving_the_Vehicle_Routing_Problem","320473480_Mastering_the_game_of_Go_without_human_knowledge","324681528_Reinforcement_learning_for_adaptive_order_dispatching_in_the_semiconductor_industry","321702194_Two-objective_stochastic_flow-shop_scheduling_with_deteriorating_and_learning_effect_in_Industry_40-based_manufacturing_system"]}