{"id":"340699379_Global_Research_Trends_in_Financial_Transactions","abstract":"Traditionally, financial mathematics has been used to solve financial problems. With globalization, financial transactions require new analysis based on tools of probability, statistics, and economic theory. Global research trends in this topic during the period 1935–2019 have been analyzed. With this objective, a bibliometric methodology of 1486 articles from the Scopus database was applied. The obtained results offer data on the scientific activity of countries, institutions, authors, and institutions that promote this research topic. The results reveal an increasing trend, mainly in the last decade. The main subjects of knowledge are social sciences and economics, econometrics, and finance. The author with the most articles is Khare from the Indian Institute of Management Rohtak. The most prolific affiliation is the British University of Oxford. The country with the most academic publications and international collaborations is the United States. In addition, the most used keywords in articles are “financial management”, “financial transaction tax”, “banking”, “financial service”, “blockchain”, “decision making”, and “financial market”. The increase in publications in recent years at the international level confirms the growing trend in research on financial transactions.","authors":["Emilio Abad-Segura","Mariana-Daniela González-Zamar"],"meta":["April 2020","DOI:10.3390/math8040614"],"references":["339839345_Sustainable_Management_of_Digital_Transformation_in_Higher_Education_Global_Research_Trends","339724518_Optimal_indirect_tax_design_in_an_open_economy","339014550_The_Impact_of_the_University_Classroom_on_Managing_the_Socio-Educational_Well-being_A_Global_Study","338454724_Agricultural_waste_Review_of_the_evolution_approaches_and_perspectives_on_alternative_uses","338192072_Actual_tendencies_in_the_evolution_of_financial_sciences","337956464_Analysis_of_World_Research_on_Grafting_in_Horticultural_Plants","337497678_Mapping_theme_trends_and_recognizing_hot_spots_in_postmenopausal_osteoporosis_research_A_bibliometric_analysis","336958778_Extended_co-citation_search_Graph-based_document_retrieval_on_a_co-citation_network_containing_citation_context_information","344542612_Developing_Countries_and_the_Globalization_of_Financial_Markets","338934658_Does_financial_globalization_still_spur_growth_in_emerging_and_developing_countries_Considering_exchange_rates"]}