{"id":"340643740_An_Agile-Based_Integrated_Framework_for_Mobile_Application_Development_Considering_Ilities","abstract":"The development of mobile apps during the last decade has had a significant increase in its share of the software market. While there are specific characteristics that separate it from traditional software development, there is a lack of guidance on issues encountered during the mobile software development process. With the aim of defining a mobile application development framework that considers the specific characteristics of developing mobile apps, we started by carrying out a systematic mapping study of the software development process for mobile applications, then we administered a survey and completed a qualitative study with industry experts. These studies allowed us to identify the main trends in the software process for mobile apps, and to uncover the main challenges for app development. We have organized the findings in a framework that integrates the specific challenges of mobile development, which we call Mobile Ilities, with software development activities that are linked through an agile process. The results of early tests carried out with computer science students are encouraging. Our proposal has served as a guide for novice developers throughout the process of creating a final product, combining the existing knowledge of developers about Scrum with the specific characteristics of mobile development, and providing mechanisms to link these characteristics with the elements of the development process.","authors":["Danilo Martínez","Xavier Ferre","Graciela Guerrero Idrovo","Natalia Juristo"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2987882"],"references":["342364539_Software_Engineering_Body_of_Knowledge_SWEBOK_Guide","318019805_Mobile_application_development_process_A_practical_experience","279750493_Combining_Challenge-Based_Learning_and_Scrum_Framework_for_Mobile_Application_Development","267042696_Factors_Influncing_Quality_of_Mobile_Apps_Role_of_Mobile_App_Development_Life_Cycle","221560176_Software_engineering_issues_for_mobile_application_development","221322054_Mobile-D_An_Agile_Approach_for_Mobile_Application_Development","326896132_Software_Engineering_Process_Models_For_Mobile_App_Development_A_Systematic_Literature_Review","319519842_Software_Quality_Attributes","318332201_Mobile_App_Development_and_Management_Results_from_a_Qualitative_Investigation","271923649_Software_assurance_practices_for_mobile_applications_A_survey_of_the_state_of_the_art"]}