{"id":"340679039_Textured_Mesh_vs_Coloured_Point_Cloud_A_Subjective_Study_for_Volumetric_Video_Compression","abstract":"Volumetric video (VV) pipelines reached a high level of maturity, creating interest to use such content in interactive visualisation scenarios. VV allows real world content to be captured and represented as 3D models, which can be viewed from any chosen viewpoint and direction. Thus, VV is ideal to be used in augmented reality (AR) or virtual reality (VR) applications. Both textured polygonal meshes and point clouds are popular methods to represent VV. Even though the signal and image processing community slightly favours the point cloud due to its simpler data structure and faster acquisition, textured polygonal meshes might have other benefits such as better visual quality and easier integration with computer graphics pipelines. To better understand the difference between them, in this study, we compare these two different representation formats for a VV compression scenario utilising state-of-the-art compression techniques. For this purpose, we build a database and collect user opinion scores for subjective quality assessment of the compressed VV. The results show that meshes provide the best quality at high bitrates, while point clouds perform better for low bitrate cases. The created VV quality database will be made available online to support further scientific studies on VV quality assessment.","authors":["Emin Zerman","Cagri Ozcinar","Pan Gao","Aljosa Smolic"],"meta":["May 2020","DOI:10.1109/QoMEX48832.2020.9123137","Conference: Twelfth International Conference on Quality of Multimedia Experience (QoMEX)At: Athlone, Ireland","Project: V-SENSE - Extending Visual Sensation through Image-based Visual Computing"],"references":["337200394_A_comprehensive_study_of_the_rate-distortion_performance_in_MPEG_point_cloud_compression","335538754_Perceptual_Quality_Assessment_of_UHD-HDR-WCG_Videos","335538560_Encoding_Efficiency_and_Computational_Cost_Assessment_of_State-Of-The-Art_Point_Cloud_Codecs","328913566_Subjective_and_Objective_Quality_Assessment_for_Volumetric_Video_Compression","336117241_Study_of_Subjective_and_Objective_Quality_Evaluation_of_3D_Point_Cloud_Data_by_the_JPEG_Committee","335538531_Capture_and_3D_Video_Processing_of_Volumetric_Video","335538256_Perceptual_Quality_Assessment_of_3d_Point_Clouds","331033147_Benchmarking_Open-Source_Static_3D_Mesh_Codecs_for_Immersive_Media_Interactive_Live_Streaming","329550005_Emerging_MPEG_Standards_for_Point_Cloud_Compression","327511281_Point_Cloud_Subjective_Evaluation_Methodology_based_on_2D_Rendering"]}