{"id":"340610016_Diffusion_and_impact_of_Marshall_McLuhan's_published_work_in_the_Web_of_Science","abstract":"This study gauges the scientific impact of Marshall McLuhan's works on academic research. To this end, an analysis was undertaken to study published research that cited his works in the Web of Science (WoS) from 1957 to 2017. A total of 6,591 documents were found that record 8,989 citations from a range of McLuhan's, mainly scientific documents (journal articles and monographs). The temporary distribution of the documents, the citations received by the different types of documents, the subject matter of the papers and the other co-authors cited along with McLuhan were analyzed. Among the main results, it was found that compared to the Canadian researcher's journal articles, his monographs received the most citations received, notably his work entitled \"Understanding Media: The Extensions of Man\". In addition, it was discovered that the interdisciplinary nature of McLuhan's thought has had repercussions in different fields, such as communication, education, sociology and computer science. Since the second half of the 20th century, McLuhan is a benchmark, together with outstanding sociologists, philosophers and communication theorists such as Theodor Adorno, Pierre Bourdieu and Zygmunt Bauman, among others.","authors":["María Ángeles Chaparro","Rafael Repiso"],"meta":["April 2020Malaysian Journal of Library and Information Science 25(1):67-81","DOI:10.22452/mjlis.vol25no1.4"],"references":["297369590_Scholarly_publication_patterns_in_the_social_sciences_and_humanities_and_their_coverage_in_Scopus_and_Web_of_Science","279956798_Marshall_McLuhan_El_medio_aun_es_el_mensaje_50_anos_despues_de_Comprender_los_medios","273504916_Bibliometric_analysis_of_two_subdomains_in_philosophy_free_will_and_sorites","263526227_Coverage_field_specialisation_and_the_impact_of_scientific_publishers_indexed_in_the_Book_Citation_Index","322219027_The_presence_of_the_encyclicals_in_Web_of_Science_a_bibliometric_approach","319395432_Understanding_media_The_extensions_of_man","283817661_Los_ecos_de_McLuhan_ecologia_de_los_medios_semiotica_e_interfaces","283806394_La_teoria_de_la_comunicacion_de_Marshall_McLuhan_el_butronero","275449836_Marshall_McLuhan_Then_and_Now","252837170_Marshall_McLuhan's_Theory_of_Communication"]}