{"id":"340685697_Virtual_reality_in_foreign_language_training_at_higher_educational_institutions","abstract":"The paper deals with the urgent problem of application of virtual reality in foreign language training. Statistical data confirms that the number of smartphone users, Internet users, including wireless Internet users, has been increasing for recent years in Ukraine and tends to grow. The coherence of quick mobile Internet access and presence of supplementary equipment enables to get trained or to self-dependently advance due to usage of virtual reality possibilities for education in the stationary classrooms, at home and in motion. Several important features of virtual reality, its advantages for education are discussed. It is noted that virtual reality is remaining a relatively new technology in language learning. Benefits from virtual reality implementation into foreign language learning and teaching are given. The aspects of immersion and gamification in foreign language learning are considered. It is emphasized that virtual reality creates necessary preconditions for motivation increasing. The results of the survey at two higher education institution as to personal experience in using VR applications for learning foreign languages are presented. Most students at both universities have indicated quite a low virtual reality application usage. Six popular virtual reality applications for foreign language learning (Mondly, VRSpeech, VR Learn English, Gold Lotus, AltSpaceVR and VirtualSpeech) are analyzed. It is stated that the most preferred VR application for foreign language learning includes detailed virtual environment for maximal immersion, high-level visual effects similar to video games, simple avatar control, thorough material selection and complete complicity level accordance of every element and aspect, affordability, helpful and unobtrusive following up.","authors":["Svitlana Symonenko","Ekaterina O Shmeltser","Nataliia V. Zaitseva","Viacheslav Osadchyi"],"meta":["April 2020","Conference: 2nd International Workshop on Augmented Reality in EducationAt: Kryvyi Rih, Ukraine"],"references":[]}