{"id":"340640828_Multi-Scale_Self-Guided_Attention_for_Medical_Image_Segmentation","abstract":"Even though convolutional neural networks (CNNs) are driving progress in medical image segmentation, standard models still have some drawbacks. First, the use of multi-scale approaches, i.e., encoder-decoder architectures, leads to a redundant use of information, where similar low-level features are extracted multiple times at multiple scales. Second, long-range feature dependencies are not efficiently modeled, resulting in non-optimal discriminative feature representations associated with each semantic class. In this paper we attempt to overcome these limitations with the proposed architecture, by capturing richer contextual dependencies based on the use of guided self-attention mechanisms. This approach is able to integrate local features with their corresponding global dependencies, as well as highlight interdependent channel maps in an adaptive manner. Further, the additional loss between different modules guides the attention mechanisms to neglect irrelevant information and focus on more discriminant regions of the image by emphasizing relevant feature associations. We evaluate the proposed model in the context of semantic segmentation on three different datasets: abdominal organs, cardiovascular structures and brain tumors. A series of ablation experiments support the importance of these attention modules in the proposed architecture. In addition, compared to other state-of-the-art segmentation networks our model yields better segmentation performance, increasing the accuracy of the predictions while reducing the standard deviation. This demonstrates the efficiency of our approach to generate precise and reliable automatic segmentations of medical images. Our code is made publicly available at: https://github.com/sinAshish/Multi-Scale-Attention","authors":["Ashish Sinha","Jose Dolz"],"meta":["April 2020IEEE Journal of Biomedical and Health Informatics PP(99):1-1","DOI:10.1109/JBHI.2020.2986926"],"references":["332458932_Deep_Q_Learning_Driven_CT_Pancreas_Segmentation_with_Geometry-Aware_U-Net","331607102_Mask_R-CNN_With_Pyramid_Attention_Network_for_Scene_Text_Detection","331576745_Identifying_the_Best_Machine_Learning_Algorithms_for_Brain_Tumor_Segmentation_Progression_Assessment_and_Overall_Survival_Prediction_in_the_BRATS_Challenge","330877339_Attention_Gated_Networks_Learning_to_Leverage_Salient_Regions_in_Medical_Images","328362440_Multi-region_segmentation_of_bladder_cancer_structures_in_MRI_with_progressive_dilated_convolutional_networks","343900799_Dual_Stream_Segmentation_Network_for_Real-Time_Semantic_Segmentation","338512016_Dual_Attention_Network_for_Scene_Segmentation","331067718_OBELISK-Net_Fewer_Layers_to_Solve_3D_Multi-Organ_Segmentation_with_Sparse_Deformable_Convolutions","329740332_Non-local_Neural_Networks","329713543_Deep_Gated_Attention_Networks_for_Large-scale_Street-level_Scene_Segmentation"]}