{"id":"340623892_Multi-Layer_Mini-Sudoku_Based_High-Capacity_Data_Hiding_Method","abstract":"The main purpose of data hiding is to hide secret data imperceptibly into multimedia, ensuring secure data transmission. Existing magic matrix-based data hiding schemes cannot achieve satisfactory visual quality for a given low payload because they adopt a single-layer embedding (i.e., the fixed-sized reference matrix (RM) embedding), rather than adaptive multi-layer embedding (i.e., variable-sized RM embedding). To this end, we propose an adaptive data hiding scheme by constructing multi-layer RM using mini-Sudoku. Our scheme can adjust the number of layers (e.g., one, two, or more) of the RM to obtain the desired payload (i.e., low, moderate, or large payloads). In addition, our method also has the capability of obtaining the optimal number of layers of RM achieving the highest visual quality for a given payload. For each pixel pair, our scheme selects the optimal pair having the smallest Euclidean distance with this pair as its stego pair, resulting in a large decrease in distortion. Experimental results show that our proposed scheme can obtain various payloads, and more importantly, it can achieve better or comparable rate-distortion performance than several existing magic matrix-based data hiding schemes.","authors":["Wei Chen","Chih-Hsiang Chang","Shaowei Weng","Bo Ou"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2986340"],"references":["330935353_Extended_squared_magic_matrix_for_embedding_secret_information_with_large_payload","323154595_Data_Hiding_Based_on_a_Two-Layer_Turtle_Shell_Matrix","303528670_Data_hiding_based_on_extended_turtle_shell_matrix_construction_method","281561962_Image_Steganography_via_Fully_Exploiting_Modification_Direction","316684179_Minimizing_turtle-shell_matrix_based_stego_image_distortion_using_particle_swarm_optimization","312888624_Efficient_steganographic_embedding_by_exploiting_modification_direction","286725669_A_Novel_Turtle_Shell_Based_Scheme_for_Data_Hiding","257627192_Data_hiding_by_an_improved_exploiting_modification_direction","251271302_Mathematics_of_Sudoku_I","228988535_Mathematics_of_Sudoku_II"]}