{"id":"340708049_UAV-YOLO_Small_Object_Detection_on_Unmanned_Aerial_Vehicle_Perspective","abstract":"Object detection, as a fundamental task in computer vision, has been developed enormously, but is still challenging work, especially for Unmanned Aerial Vehicle (UAV) perspective due to small scale of the target. In this study, the authors develop a special detection method for small objects in UAV perspective. Based on YOLOv3, the Resblock in darknet is first optimized by concatenating two ResNet units that have the same width and height. Then, the entire darknet structure is improved by increasing convolution operation at an early layer to enrich spatial information. Both these two optimizations can enlarge the receptive filed. Furthermore, UAV-viewed dataset is collected to UAV perspective or small object detection. An optimized training method is also proposed based on collected UAV-viewed dataset. The experimental results on public dataset and our collected UAV-viewed dataset show distinct performance improvement on small object detection with keeping the same level performance on normal dataset, which means our proposed method adapts to different kinds of conditions.","authors":["Mingjie Liu","Xianhao Wang","Anjian Zhou","Xiuyuan Fu"],"meta":["April 2020Sensors 20(8):2238","DOI:10.3390/s20082238"],"references":["340344366_Mixed_YOLOv3-LITE_A_lightweight_real-time_object_detection_method","336610659_Automatic_Change_Detection_System_over_Unmanned_Aerial_Vehicle_Video_Sequences_Based_on_Convolutional_Neural_Networks","324903264_Multi-scale_object_detection_in_remote_sensing_imagery_with_convolutional_neural_networks","324226497_Contour-aware_network_for_semantic_segmentation_via_adaptive_depth","334627947_UAV_detection_and_identification_in_the_Internet_of_Things","330125942_Vehicle_Detection_Under_UAV_Based_on_Optimal_Dense_YOLO_Method","329397998_Modeling_With_Prejudice_Small-Sample_Learning_via_Adversary_for_Semantic_Segmentation","324387691_YOLOv3_An_Incremental_Improvement","323091798_Convolutional_SVM_Networks_for_Object_Detection_in_UAV_Imagery","323064229_Visual_UAV_detection_method_with_online_feature_classification"]}