{"id":"340714894_Identifying_Influencers_in_Social_Networks","abstract":"Social network analysis is a multidisciplinary research covering informatics, mathematics, sociology, management, psychology, etc. In the last decade, the development of online social media has provided individuals with a fascinating platform of sharing knowledge and interests. The emergence of various social networks has greatly enriched our daily life, and simultaneously, it brings a challenging task to identify influencers among multiple social networks. The key problem lies in the various interactions among individuals and huge data scale. Aiming at solving the problem, this paper employs a general multilayer network model to represent the multiple social networks, and then proposes the node influence indicator merely based on the local neighboring information. Extensive experiments on 21 real-world datasets are conducted to verify the performance of the proposed method, which shows superiority to the competitors. It is of remarkable significance in revealing the evolutions in social networks and we hope this work will shed light for more and more forthcoming researchers to further explore the uncharted part of this promising field.","authors":["Xinyu Huang","Dongming Chen","Dongqi Wang","Tao Ren"],"meta":["April 2020Entropy 22(4):450","DOI:10.3390/e22040450"],"references":["344234711_Social_network_coalescence_based_on_multilayer_network_model","333686362_Identifying_influential_spreaders_by_gravity_model","323848431_Network_Centrality_An_Introduction","345354106_Superspreaders_and_superblockers_based_community_evolution_tracking_in_dynamic_social_networks","327521565_Identification_of_top-k_influential_nodes_based_on_enhanced_discrete_particle_swarm_optimization_for_influence_maximization","326405073_Collegial_Phenomenon_The_Social_Mechanisms_of_Cooperation_Among_Peers_in_a_Corporate_Law_Partnership_Introduction","322826651_Influence_analysis_in_social_networks_A_survey","322091287_BridgeRank_A_novel_fast_centrality_measure_based_on_local_structure_of_the_network","321137237_The_Network_Data_Repository_with_Interactive_Graph_Analytics_and_Visualization","318095456_Identifying_Top-k_Most_Influential_Nodes_by_using_the_Topological_Diffusion_Models_in_the_Complex_Networks"]}