{"id":"340726128_Analyses_of_Indexing_Techniques_on_Uncertain_Data_With_High_Dimensionality","abstract":"Deploying a solution for handling critical decision-based problem efficiently requires the processing of high-dimensional data. Over the years, due to modern technological advancement, unprecedented volume of uncertain data is been captured and this has necessitated the need to organize such data for better data access performance. To this effect, the use of indexing technique for supporting, organizing, and storing of uncertain data with high dimensionality has become pertinent. However, the choice of an indexing technique to improve search performance is highly influenced by the properties of the underlying data set, data construction methods employed by the indexing structure, and the query types it supports. This paper is motivated to conduct an extensive performance analysis among existing indexing techniques, namely: R-tree, R*-tree and X-tree, in order to realize the most efficient indexing structure for organizing, storing and ultimately improving search performance over uncertain data with high dimensionality. The results of the analyses with regard to CPU processing time and number of nodes visited clearly show the superiority of X-tree over R-tree and R*-tree, as its superiority holds for different data set sizes, data distributions, number of dimensions and even with varying selectivity ratio.","authors":["Maaruf Mohammed Lawal","Hamidah Ibrahim","Nor Fazlida Mohd Sani","Razali Yaakob"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2988487","Project: Computing Skyline Queries over Uncertain Data with High Dimensionality"],"references":["336905749_LSH-based_distributed_similarity_indexing_with_load_balancing_in_high-dimensional_space","324600197_HD-Index_Pushing_the_Scalability-Accuracy_Boundary_for_Approximate_kNN_Search_in_High-Dimensional_Spaces","318490111_A_fast_clustering_algorithm_for_high-dimensional_data","316277672_Livestock_monitoring_using_RFID_with_R_tree_indexing","345829122_Discussion_on_geological_science_big_data_and_its_applications","333193614_A_novel_information_retrieval_method_based_on_R-tree_index_for_smart_hospital_information_system","327735361_Multi-dimensional_data_indexing_and_range_query_processing_via_Voronoi_diagram_for_internet_of_things","318295086_EncSIM_An_encrypted_similarity_search_service_for_distributed_high-dimensional_datasets","313708771_The_R-tree_An_efficient_and_robust_access_method_for_points_and_rectangles","293009282_Efficient_R-Tree_Based_Indexing_Scheme_for_Server-Centric_Cloud_Storage_System"]}