{"id":"340777870_Gender-Specific_Differences_in_Patients_With_Chronic_Tinnitus-Baseline_Characteristics_and_Treatment_Effects","abstract":"Whilst some studies have identified gender-specific differences, there is no consensus about gender-specific determinants for prevalence rates or concomitant symptoms of chronic tinnitus such as depression or anxiety. However, gender-associated differences in psychological response profiles and coping strategies may differentially affect tinnitus chronification and treatment success rates. Thus, understanding gender-associated differences may facilitate a more detailed identification of symptom profiles, heighten treatment response rates, and help to create access for vulnerable populations that are potentially less visible in clinical settings. Our research questions are: RQ1: how do male and female tinnitus patients differ regarding tinnitus-related distress, depression severity and treatment response, RQ2: to what extent are answers to questionnaires administered at baseline associated with gender, and RQ3: which baseline questionnaire items are associated with tinnitus distress, depression and treatment response, while relating to one gender only? In this work, we present a data analysis workflow to investigate gender-specific differences in N=1,628 patients with chronic tinnitus (828 female, 800 male) who completed a 7-day multimodal treatment encompassing cognitive behavioral therapy (CBT), physiotherapy, auditory attention training and information counseling components. For this purpose, we extracted 181 variables from 7 self-report questionnaires on socio-demographics, tinnitus-related distress, tinnitus frequency, loudness, localization and quality as well as physical and mental health status. Our workflow comprises (i) training machine learning models, (ii) a comprehensive evaluation including hyperparameter optimization, and (iii) post-learning steps to identify predictive variables. We found that female patients reported higher levels of tinnitus-related distress, depression and response to treatment (RQ1). Female patients indicated higher levels of tension, stress, and psychological coping strategies rates. By contrast, male patients reported higher levels of bodily pain associated with chronic tinnitus whilst judging their overall health as better (RQ2). Variables measuring depression, sleep problems, tinnitus frequency and loudness were associated with tinnitus-related distress in both genders and indicators of mental health and subjective stress were found to be associated with depression in both genders (RQ3). Our results suggest that genderassociated differences in symptomatology and treatment response profiles suggest clinical and conceptual needs for differential diagnostics, case conceptualization and treatment pathways.","authors":["Uli Niemann","Benjamin Boecking","Petra Brüggemann","Birgit Mazurek"],"meta":["April 2020Frontiers in Neuroscience 14","DOI:10.3389/fnins.2020.00487"],"references":["338932247_Tinnitus-related_distress_after_multimodal_treatment_can_be_characterized_using_a_key_subset_of_baseline_variables","332820149_Sex-Specific_Association_of_Tinnitus_With_Suicide_Attempts","330986889_Gender_Differences_Affecting_Psychiatric_Distress_and_Tinnitus_Severity","318171369_Visualization_of_Global_Disease_Burden_for_the_Optimization_of_Patient_Management_and_Treatment","313969544_The_role_of_questioning_environment_personality_traits_depressive_and_anxiety_symptoms_in_tinnitus_severity_perception","304622549_Impact_of_Multiple_Factors_on_the_Degree_of_Tinnitus_Distress","353667263_All_Models_are_Wrong_but_Many_are_Useful_Learning_a_Variable's_Importance_by_Studying_an_Entire_Class_of_Prediction_Models_Simultaneously","317269661_Gender_differences_in_social_anxiety_disorder_A_review","303667809_A_systematic_review_of_the_reporting_of_tinnitus_prevalence_and_severity","270663502_Random_Forests"]}