{"id":"340788885_A_game-based_education_approach_for_sustainable_ocean_development","abstract":"The goods and services of the ocean are increasingly threatened by anthropogenic pressures and climate change. Novel approaches for an integrated education for sustainable ocean development are needed, to teach an understanding of ocean systems and their sustainable gover-nance to future generations of users and consumers. We developed a table-top, role-playing game for marine sustainability education at the high school level and above. Ocean Limited lets players negotiate their uses and interactions as ocean stakeholders, providing a comprehensive social-ecological integration of global ocean systems, marine sustainability challenges, and climate change impacts. Observations of in-game player behaviour, game results, and player feedback indicate that players understood the game world, identified with their roles, and actively engaged as ocean stakeholders. Ocean Limited stimulated empathy for other actors, systemic and foresighted thinking, and the development of sustainability-oriented cooperation and agreements. The game can demonstrate and teach real-world marine sustainability issues, and could support collective learning of problem-solving capacities for social-ecological conflicts and trade-offs in ocean uses. We suggest using role-playing game-based approaches for an integrated marine sustainability education, to train students the skills needed to participate in and support sustainable ocean development.","authors":["Stefan Koenigstein","Lisa-Henrike Hentschel","Lena Christin Heel","Catherine Drinkorn"],"meta":["April 2020ICES Journal of Marine Science 2020:fsaa035","DOI:10.1093/icesjms/fsaa035","Project: Ocean Limited – A game about the oceans"],"references":["331571703_Communicating_Maritime_Spatial_Planning_The_MSP_Challenge_approach","330284188_Conciliate_Agriculture_with_Landscape_and_Biodiversity_Conservation_A_Role-Playing_Game_to_Explore_Trade-Offs_among_Ecosystem_Services_through_Social_Learning","325553744_Stakeholder_Engagement_in_Maritime_Spatial_Planning_The_Efficacy_of_a_Serious_Game_Approach","321763126_Disciplinary_diversity_in_marine_sciences_The_urgent_case_for_an_integration_of_research","320568823_The_mechanics_of_blue_growth_Management_of_oceanic_natural_resource_use_with_multiple_interacting_sectors","303981049_Marine_Ecosystem_Science_on_an_Intertwined_Planet","322011644_Local_response_to_global_uncertainty_Insights_from_experimental_economics_in_small-scale_fisheries","320595551_Effective_education_and_communication_strategies_to_promote_environmental_engagement","309253753_Contrasting_Futures_for_Ocean_and_Society_from_Different_Anthropogenic_CO2_Emissions_Scenarios","305660187_Role-play_simulations_for_climate_change_adaptation_education_and_engagement"]}