{"id":"340818559_Tubes_and_Bubbles_Topological_confinement_of_YouTube_recommendations","abstract":"The role of recommendation algorithms in online user confinement is at the heart of a fast-growing literature. Recent empirical studies generally suggest that filter bubbles may principally be observed in the case of explicit recommendation (based on user-declared preferences) rather than implicit recommendation (based on user activity). We focus on YouTube which has become a major online content provider but where confinement has until now been little-studied in a systematic manner. We aim to contribute to the above literature by showing whether recommendation on YouTube exhibits phenomena typical of filter bubbles, tending to lower the diversity of consumed content. Starting from a diverse number of seed videos, we first describe the properties of the sets of suggested videos in order to design a sound exploration protocol able to capture latent recommendation graphs recursively induced by these suggestions. These graphs form the background of potential user naviga-tions along non-personalized recommendations. From there, be it in topological, topical or temporal terms, we show that the landscape of what we call mean-field YouTube recommendations is often prone to confinement dynamics. Moreover, the most confined recommendation graphs i.e., potential bubbles, seem to be organized around sets of videos that garner the highest audience and thus plausibly viewing time.","authors":["Camille Roth","Antoine Mazieres","Telmo Menezes"],"meta":["April 2020PLoS ONE 15(4):e0231703","DOI:10.1371/journal.pone.0231703"],"references":["338841952_Auditing_radicalization_pathways_on_YouTube","323501485_Do_not_blame_it_on_the_algorithm_an_empirical_assessment_of_multiple_recommender_systems_and_their_impact_on_content_diversity","319638895_Changing_Their_Tune_How_Consumers'_Adoption_of_Online_Streaming_Affects_Music_Consumption_and_Discovery","318256136_Burst_of_the_Filter_Bubble_Effects_of_personalization_on_the_diversity_of_Google_News","309906984_Political_polarization_on_Twitter","339603530_Investigating_the_lack_of_diversity_in_user_behavior_The_case_of_musical_content_on_online_platforms","334596489_Algorithmic_Distortion_of_Informational_Landscapes","331930605_Mapping_Social_Dynamics_on_Facebook_The_Brexit_Debate","315641094_The_dark_side_of_technology_An_experimental_investigation_of_the_influence_of_customizability_technology_on_online_political_selective_exposure","313263031_Evolution_of_Ego-networks_in_Social_Media_with_Link_Recommendations"]}