{"id":"340841317_A_survey_on_context_awareness_in_big_data_analytics_for_business_applications","abstract":"The concept of context awareness has been in existence since the 1990s. Though initially applied exclusively in computer science, over time it has increasingly been adopted by many different application domains such as business, health and military. Contexts change continuously because of objective reasons, such as economic situation, political matter and social issues. The adoption of big data analytics by businesses is facilitating such change at an even faster rate in much complicated ways. The potential benefits of embedding contextual information into an application are already evidenced by the improved outcomes of the existing context-aware methods in those applications. Since big data is growing very rapidly, context awareness in big data analytics has become more important and timely because of its proven efficiency in big data understanding and preparation, contributing to extracting the more and accurate value of big data. Many surveys have been published on context-based methods such as context modelling and reasoning, workflow adaptations, computational intelligence techniques and mobile ubiquitous systems. However, to our knowledge, no survey of context-aware methods on big data analytics for business applications supported by enterprise level software has been published to date. To bridge this research gap, in this paper first, we present a definition of context, its modelling and evaluation techniques, and highlight the importance of contextual information for big data analytics. Second, the works in three key business application areas that are context-aware and/or exploit big data analytics have been thoroughly reviewed. Finally, the paper concludes by highlighting a number of contemporary research challenges, including issues concerning modelling, managing and applying business contexts to big data analytics.","authors":["Ngọc Đinh","Gour C. Karmakar","Joarder Kamruzzaman"],"meta":["September 2020Knowledge and Information Systems 62(2)","DOI:10.1007/s10115-020-01462-3"],"references":["319980503_Bibri_Simon_Elias_Krogstie_John_2017_The_Core_Enabling_Technologies_of_Big_Data_Analytics_and_Context-Aware_Computing_for_Smart_Sustainable_Cities_A_Review_and_Synthesis","318300929_Big_data_analytics_in_supply_chain_management_A_state-of-the-art_literature_review","347922143_A_survey_on_context-aware_workflow_systems","341366439_Keywords_in_Context_Using_n-grams_with_Python","335741525_Context-Based_Analytics_in_a_Big_Data_World_Better_Decisions_An_IBMR_RedbooksR_Point-of-View_publication","328123145_Integration_of_big-data_ERP_and_business_analytics_BA","328077609_Big_data_Algorithms_analytics_and_applications","317060991_Cloud_manufacturing_system_for_sheet_metal_processing","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","308500363_Big_data_and_its_applications_A_review","306270938_Big_data-driven_fuzzy_cognitive_map_for_prioritising_IT_service_procurement_in_the_public_sector","303830113_Big_Data_and_supply_chain_management_a_review_and_bibliometric_analysis","306520494_Predicting_online_e-marketplace_sales_performances_A_big_data_approach","305628234_A_big_data_analytics_architecture_for_cleaner_manufacturing_and_maintenance_processes_of_complex_products","303230644_Exploring_the_Influence_of_Big_Data_on_City_Transport_Operations_a_Markovian_Approach"]}