{"id":"340813598_DeepVision_Deepfakes_Detection_Using_Human_Eye_Blinking_Pattern","abstract":"In this paper, we propose a new approach to detect Deepfakes generated through the generative adversarial network (GANs) model via an algorithm called DeepVision to analyze a significant change in the pattern of blinking, which is a voluntary and spontaneous action that does not require conscious effort. Human eye blinking pattern has been known to significantly change according to the person’s overall physical conditions, cognitive activities, biological factors, and information processing level. For example, an individual’s gender or age, the time of day, or the person’s emotional state or degree of alertness can all influence the pattern. As a result, Deepfakes can be determined through integrity verification by tracking significant changes in the eye blinking patterns in deepfakes by means of a heuristic method based on the results of medicine, biology, and brain engineering research, as well as machine learning and various algorithms based on engineering and statistical knowledge. This means we can perform integrity verification through tracking significant changes in the eye blinking pattern of a subject in a video. The proposed method called DeepVision is implemented as a measure to verify an anomaly based on the period, repeated number, and elapsed eye blink time when eye blinks were continuously repeated within a very short period of time. DeepVision accurately detected Deepfakes in seven out of eight types of videos (87.5% accuracy rate), suggesting we can overcome the limitations of integrity verification algorithms performed only on the basis of pixels.","authors":["TackHyun Jung","Sangwon Kim","Keecheon Kim"],"meta":["April 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2988660"],"references":["342617835_DeepFakes_and_Beyond_A_Survey_of_Face_Manipulation_and_Fake_Detection","331769696_Combating_Deepfake_Videos_Using_Blockchain_and_Smart_Contracts","331756737_Recent_Progress_on_Generative_Adversarial_Networks_GANs_A_Survey","331104071_Face_Recognition_Systems_Under_Morphing_Attacks_A_Survey","330791801_MesoNet_a_Compact_Facial_Video_Forgery_Detection_Network","339562302_FaceForensics_Learning_to_Detect_Manipulated_Facial_Images","331264491_Learning_to_Detect_Fake_Face_Images_in_the_Wild","331108602_Deepfake_Video_Detection_Using_Recurrent_Neural_Networks","330797421_In_Ictu_Oculi_Exposing_AI_Created_Fake_Videos_by_Detecting_Eye_Blinking","328425461_A_method_for_improving_CNN-based_image_recognition_using_DCGAN"]}