{"id":"340841788_El_pensamiento_computacional_en_Educacion_Analisis_bibliometrico_y_tematico_Computational_thinking_in_education_Bibliometric_and_thematic_analysis","abstract":"El pensamiento computacional se está considerando actualmente como una de las competencias más demandadas y, de ahí, su planteamiento en el contexto educativo. Este trabajo trata de analizar la literatura científica sobre la aplicación del pensamiento computacional en el ámbito educativo publicada en las colecciones principales de la base de datos Web of Science. Se han tenido en cuenta las variables de año de publicación, los países con más producciones, los autores más productivos en este campo y fuentes documentales con mayor número de publicaciones. Asimismo, se ha realizado una clasificación según los tipos de documentos y los métodos de investigación utilizados, así como las etapas educativas objeto de estudio y los lenguajes de programación utilizados. Se ha hallado una tendencia creciente de publicaciones en esta temática, donde España es uno de los países donde más se publica. Además, se ha observado cómo este campo de estudio se ha abordado desde los dos principales métodos de investigación –cuantitativo y cualitativo— y la etapa educativa más investigada es la educación primaria. Por último, se lleva a cabo una discusión de los resultados y conclusiones, sirviendo este documento como punto de partida para futuras investigaciones sobre el pensamiento computacional en educación.\nThe status of computational thinking as one of the most demanded skills explains why suggestions are currently being made to apply it within the educational context. This paper constitutes an attempt to analyze the scientific literature on the implementation of computational thinking in the field of education published in the most important Web of Science database collections. Attention was paid to four variables, namely: publication year; countries with more productions; the most productive authors in this field; and documentary sources with a higher number of publications. Added to this, we carried out a classification according to the types of documents and the research methods used, along with the educational stages under study and the programming language adopted. Publications are undoubtedly on an upward trend, Spain standing out as one of the most productive countries in this area. Likewise, evidence demonstrates not only that this field of study has been addressed using the two main research methods —quantitative and qualitative— but also that the emphasis has traditionally been placed on the primary education stage. A discussion of the results obtained as well as the conclusions drawn will put an end to this paper, which can hopefully serve as a starting point for future research works on the utilization of computational thinking in education.","authors":["Rosabel Roig-Vila","Víctor Moreno-Isac"],"meta":["April 2020","DOI:10.6018/red.402621"],"references":[]}