{"id":"340883347_Detection_of_coronavirus_Disease_COVID-19_based_on_Deep_Features_and_Support_Vector_Machine","abstract":"The detection of coronavirus (COVID-19) is now a critical task for the medical practitioner. The coronavirus spread so quickly between people and approaches 100,000 people worldwide. In this consequence, it is very much essential to identify the infected people so that prevention of spread can be taken. In this paper, the deep feature plus support vector machine (SVM) based methodology is suggested for detection of coronavirus infected patient using X-ray images. For classification, SVM is used instead of deep learning based classifier, as the later one need a large dataset for training and validation. The deep features from the fully connected layer of CNN model are extracted and fed to SVM for classification purpose. The SVM classifies the corona affected X-ray images from others. The methodology consists of three categories of Xray images, i.e., COVID-19, pneumonia and normal. The method is beneficial for the medical practitioner to classify among the COVID-19 patient, pneumonia patient and healthy people. SVM is evaluated for detection of COVID-19 using the deep features of different 13 number of CNN models. The SVM produced the best results using the deep feature of ResNet50. The classification model, i.e. ResNet50 plus SVM achieved accuracy, sensitivity, FPR and F1 score of 95.33%,95.33%,2.33% and 95.34% respectively for detection of COVID-19 (ignoring SARS, MERS and ARDS). Again, the highest accuracy achieved by ResNet50 plus SVM is 98.66%. The result is based on the Xray images available in the repository of GitHub and Kaggle. As the data set is in hundreds, the classification based on SVM is more robust compared to the transfer learning approach. Also, a comparison analysis of other traditional classification method is carried out. The traditional methods are local binary patterns (LBP) plus SVM, histogram of oriented gradients (HOG) plus SVM and Gray Level Co-occurrence Matrix (GLCM) plus SVM. In traditional image classification method, LBP plus SVM achieved 93.4% of accuracy.","authors":["Prabira kumar Sethy","Kumari Santi","Behera","Pradyumna Kumar"],"meta":["April 2020International Journal of Mathematical, Engineering and Management Sciences","DOI:10.33889/IJMEMS.2020.5.4.052"],"references":["339705453_Serial_interval_of_novel_coronavirus_COVID-19_infections","339243235_Serial_interval_of_novel_coronavirus_2019-nCoV_infections","339183724_Epidemiological_and_clinical_features_of_the_2019_novel_coronavirus_outbreak_in_China","339112553_Clinical_Characteristics_of_138_Hospitalized_Patients_With_2019_Novel_Coronavirus-Infected_Pneumonia_in_Wuhan_China","338754550_Coronaviruses_genome_structure_replication_and_pathogenesis","316187429_Two-phase_deep_convolutional_neural_network_for_reducing_class_skewness_in_histopathological_images_based_breast_cancer_detection","338931536_Epidemiological_and_clinical_characteristics_of_99_cases_of_2019_novel_coronavirus_pneumonia_in_Wuhan_China_a_descriptive_study","323373904_Identifying_Medical_Diagnoses_and_Treatable_Diseases_by_Image-Based_Deep_Learning","321828454_Detecting_atrial_fibrillation_by_deep_convolutional_neural_networks","318919632_Pre-trained_convolutional_neural_networks_as_feature_extractors_for_tuberculosis_detection"]}