{"id":"340843893_Coding_together_-_coding_alone_the_role_of_trust_in_collaborative_programming","abstract":"In the digital economy, innovation processes increasingly rely on highly specialised know-how and open-source software shared on digital platforms on collaborative programming. The information that feeds into the content on these platforms is provided voluntarily by a vast crowd of knowledgeable users from all over the world. In contributing to the platforms, users invest their time and share knowledge with strangers to add to the rising body of digital knowledge. This requires an open mindset and trust. In this study, we argue that such a mindset is not just an individual asset but determined by the local communities the users are embedded in. We, therefore, hypothesise that places with higher levels of trust should contribute more to Stack Overflow, the world's largest question-and-answer platform for programming questions. In relating the city-level contributions of 266 OECD metropolitan areas to infrastructure, economic, and trust measures, we find support for this hypothesis. In contrast, click rates to the platform are solely driven by infrastructure and economic variables, but not by trust. These findings highlight the importance of societal values in the twenty-first-century knowledge economy: if policymakers want to develop a lively local digital economy, it is not enough to provide fast Internet access and business opportunities. Instead, it is equally important to establish a trust-building environment that fosters sharing of innovative ideas, collaborations, and knowledge spillovers.","authors":["Fabian Stephany","Fabian Braesemann","Mark Graham"],"meta":["April 2020Information Communication and Society 24(1):1-18","DOI:10.1080/1369118X.2020.1749699"],"references":["333686701_Global_networks_in_collaborative_programming","325646875_It_Deepens_Like_a_Coastal_Shelf_Educational_Mobility_and_Social_Capital_in_Germany","319436162_An_Exploration_of_Wikipedia_Data_as_a_Measure_of_Regional_Knowledge_Distribution","317705132_Excess_reciprocity_distorts_reputation_in_online_social_networks","314904310_Urban_Density_and_the_Rate_of_Invention","326404085_Talent_skills_and_urban_economies","326403904_How_geography_shapes-and_is_shaped_by-the_internet","324671523_A_First_Look_at_Online_Reputation_on_Airbnb_Where_Every_Stay_is_Above_Average","323641924_Location_location_location_how_digital_platforms_reinforce_the_importance_of_spatial_proximity","314909441_On_the_Geographic_Allocation_of_Open_Source_Software_Activities"]}