{"id":"340874803_Cultural_Stereotypes_and_Sense_of_Belonging_Contribute_to_Gender_Gaps_in_STEM","abstract":"There is a need to help more students succeed in science, technology, engineering, and mathematics (STEM) education, with particular interest in reducing current gender gaps in motivation and participation. We propose a new theoretical model, the STEreotypes, Motivation, and Outcomes (STEMO) developmental model, to account for and integrate recent data emerging in social and developmental psychology. Based on this model, we synthesize research suggesting that social factors, such as stereotypes and self-representations about \"belonging,\" are powerful contributors to observed gender differences in STEM interest and academic outcomes. The review has four parts. First, we examine how cultural stereotypes specific to STEM contribute to gender gaps by negatively impacting interest and academic outcomes. Second, we review the central role of the self-representations affected by those stereotypes, including the particular importance of a sense of belonging. Third, we discuss various interventions that buffer against stereotypes and enhance a sense of belonging to reduce gender gaps in STEM interest and academic outcomes. Finally, we suggest theory-driven directions for future research. By organizing the research in this way, our review and theoretical analysis clarify key factors contributing to current gender gaps in STEM and mechanisms by which psychological interventions can help address STEM gender gaps.","authors":["Allison Master","Andrew N Meltzoff"],"meta":["April 2020"],"references":["338411956_Interpreting_Effect_Sizes_of_Education_Interventions","336918251_The_Role_of_Social_and_Ability_Belonging_in_Men's_and_Women's_pSTEM_Persistence","335029154_A_national_experiment_reveals_where_a_growth_mindset_improves_achievement","333430906_Beliefs_in_Brilliance_and_Belonging_Uncertainty_in_Male_and_Female_STEM_StudentsTable_1docx","332066165_Targeted_Identity-Safety_Interventions_Cause_Lasting_Reductions_in_Discipline_Citations_Among_Negatively_Stereotyped_Boys","331152215_STEM_faculty_who_believe_ability_is_fixed_have_larger_racial_achievement_gaps_and_inspire_less_student_motivation_in_their_classes","332551594_Children_lose_confidence_in_their_potential_to_be_scientists_but_not_in_their_capacity_to_do_science","332433926_A_Growth_Mind-Set_Intervention_Improves_Interest_but_Not_Academic_Performance_in_the_Field_of_Computer_Science","331186821_Gendered_genetics_How_reading_about_the_genetic_basis_of_sex_differences_in_biology_textbooks_could_affect_beliefs_associated_with_science_gender_disparities","330890577_Subtle_Linguistic_Cues_Increase_Girls'_Engagement_in_Science"]}