{"id":"340835280_A_Comparative_Study_of_Solar-Driven_Trigeneration_Systems_for_the_Building_Sector","abstract":"The utilization of solar irradiation in the building sector is vital to create sustainable systems. Trigeneration systems are highly efficient systems that usually produce electricity, heating and cooling which are the main energy needs in the buildings. The objective of this work is the energetic and financial investigation of three different solar-driven trigeneration systems that can be applied in buildings with high energy needs (e.g., hospitals or commercial buildings). The parabolic trough solar collector (PTC) is selected to be used because it is the most mature solar concentrating technology. The examined configurations practically are different combinations of organic Rankine cycle (ORC) with heat pumps. System 1 includes a PTC coupled to an ORC which feeds an absorption heat pump machine. System 2 includes a PTC which simultaneously feeds an ORC and absorption machine. System 3 includes a PTC which feeds an ORC and a heat exchanger for heating, while the ORC is fed with and electricity a vapor compression cycle for cooling production. The simple payback period of System 1 is 5.62 years and it is the lowest, with System 2 to have 7.82 years and System 3 to have 8.49 years. The energy efficiency of the three systems is 78.17%, 43.30% and 37.45%, respectively, while the exergy efficiency 15.94%, 13.08% and 12.25%, respectively. System 1 is the best configuration according to energy, exergy and financial analysis. This study is performed with developed thermodynamic models in Engineering Equation Solver and a dynamic model in FORTRAN.","authors":["Christos Tzivanidis","Evangelos Bellos"],"meta":["April 2020Energies 13(8):2074","DOI:10.3390/en13082074"],"references":["337190873_Creating_Statistics_for_China's_Building_Energy_Consumption_Using_an_Adapted_Energy_Balance_Sheet","336184287_Energy_and_financial_investigation_of_a_cogeneration_system_based_on_linear_Fresnel_reflectors","330879183_Parametric_analysis_and_yearly_performance_of_a_trigeneration_system_driven_by_solar-dish_collectors","329402433_Alternative_designs_of_parabolic_trough_solar_collectors","326929009_Investigation_of_a_solar-biomass_polygeneration_system","326235763_Assessment_of_linear_solar_concentrating_technologies_for_Greek_climate","325562874_Energetic_exergetic_and_financial_evaluation_of_a_solar_driven_trigeneration_system","322846056_Clarifying_the_bifurcation_point_on_Design_A_Comparative_Analysis_between_Solar-ORC_and_ORC-based_Solar-CCHP","326818969_Development_and_Assessment_of_Integrating_Parabolic_Trough_Collectors_with_Gas_Turbine_Trigeneration_System_for_Producing_Electricity_Chilled_Water_and_Freshwater","322040525_Solar_collectors_and_photovoltaics_as_combined_heat_and_power_systems_A_critical_review"]}