{"id":"340836754_Developing_English_presentation_skills_as_a_component_of_collaboration_competence_for_sustainable_development","abstract":"The paper deals with the problem of teaching non-linguistics students English presenting as a component skill of collaboration competence. Students’ considerable reluctance to take up this type of creative activity and to present their ideas in front of their colleagues is a serious obstacle to develop their communicative abilities necessary for prospective leaders of the 21st century in science and industry. The results of the survey of Machine Building and Computer Science students as to reasons for their disinclination to create presentations are presented. The strategy for overcoming students’ unwillingness and building their presenting confidence are given. The example of implementation of a task for strategic thinking for sustainable development within the discipline ‘English as a foreign language’ is given. The aspects and stages of effective online presentation editor application for teaching English presenting are analysed. The results of students’ choice of five presentation tools are included. Three prospective online presentation makers are analysed and their utility for creating and giving English presentations are studied. It is stated that the most promising online tool is Prezi since it offers prepared professional quality features and incites developing and incorporating personal creative ideas through bright and uncommon visual means.","authors":["Nataliia Zaitseva"],"meta":["January 2020E3S Web of Conferences 166(2):10007","DOI:10.1051/e3sconf/202016610007"],"references":["331468752_INOZEMNA_MOVA_AK_ZASIB_FORMUVANNA_KOMUNIKATIVNOI_KOMPETENTNOSTI_MAJBUTNIH_INZENERIV-PROGRAMISTIV","337542495_Peculiarities_of_English_Language_Training_for_Electrical_Engineering_Students_at_Ukrainian_Universities","280266296_Developing_a_university-wide_course_on_sustainability_A_critical_evaluation_of_planning_and_implementation","227461372_Characteristics_of_effective_and_sustainable_teaching_development_programmes_for_quality_teaching_in_higher_education"]}