{"id":"340831626_Education_individualization_by_means_of_artificial_neural_networks","abstract":"This paper examines the issues related to the implementation of an educational process based on modern information technologies use. The main purpose of it is to achieve a significant level of individualization of the educational process, taking into account the individual characteristics and capabilities of each participant of the process. The implementation of the approach became possible at using elements of the theory of artificial neural networks in the educational process. Based on the network, it is possible to build a model of the educational process; it will significantly increase the control of the teacher on the educational process. Moreover, this network can adapt to a specific education task, the individual characteristics of the student and teacher. The mathematical model of the educational process using modern information technologies and neural networks is constructed. Their use is based on the developed criteria of successful execution of various stages of the educational process. Such criteria are designed for both the student and the teacher. The characteristic of participant’s activity of the educational process is considered in the work. A numerical interpretation of this concept is proposed.","authors":["Nataliia Valko","Viacheslav Osadchyi"],"meta":["January 2020E3S Web of Conferences 166(4):10021","DOI:10.1051/e3sconf/202016610021"],"references":["343339709_SOCALC_AS_A_LEARNING_TOOL_FOR_NEURAL_NETWORK_SIMULATION_IN_THE_SPECIAL_COURSE_FOUNDATIONS_OF_MATHEMATIC_INFORMATICS","340180318_Using_spreadsheets_as_learning_tools_for_computer_simulation_of_neural_networks","340176705_Neuro-network_technologies_as_a_mean_for_creating_individualization_conditions_for_students_learning","340176458_Studies_of_impact_of_specialized_STEM_training_on_choice_further_education","329992349_Development_of_a_software_product_for_forecasting_the_entrance_of_applicants_to_higher_educational_institutions"]}