{"id":"340885051_A_Review_of_Requirement_Engineering_Process_Models_Tools_Methodologies","abstract":"As we are living in the Era of Computer Science and almost all individuals and the organizations are completely relying on software systems. The requirement engineering is the most vital and important aspect in the success of any software engineering project. Requirement Engineering is a set of different process that works at different levels, which are incorporated at individual and organizational level Projects We need to consult different sources to find requirements. We need to involve personals from the different fields to find a set of quality requirements. The security issues undergoes as soon as early in the 1st phase of requirements. It is shown from the studies that if we consider Quality Process of Requirement Engineering at the phase it results in saving of million dollars. This paper contains the details study and comparison of different RE Process Models and Requirement Elicitation techniques. This paper elaborates the vital aspects of different Requirement Engineering Process models that help in the selection of appropriate model for the Requirement Engineers and practitioners working in the industry. This Paper also Focus on the giving a detailed view of Elicitation techniques and comparative study including the characteristics and their strengths and weakness. Some strengths and weakness found during detailed study are also structured and listed that is also the helpful for the Appropriate selection of RE Process model.","authors":["Saeed Faroom"],"meta":["July 2019","DOI:10.47238/ijeca.v4i1.86"],"references":["276185309_RESEARCH_ON_SECURITY_REQUIREMENTS_ENGINEERING_PROBLEMS_AND_PROSPECTS","247936118_Software_Security_Requirements_Gathering_Instrument","221248156_Getting_access_to_what_goes_on_in_people's_heads_Reflections_on_the_think-aloud_technique","220631656_Security_quality_requirements_engineering_SQUARE_methodology","220071223_The_Domain_Theory_for_Requirements_Engineering","344932403_A_Comparison_Between_Five_Models_Of_software_Engineering","314273300_An_Improved_Model_for_Requirement_Management_System","230786775_Card_Sorting_Current_Practices_and_Beyond","223668897_Tool-supported_requirements_prioritization_Comparing_the_AHP_and_CBRank_methods","222627261_Software_Engineering_Using_RATionale","200085853_The_role_of_task_analysis_in_capturing_requirements_for_interface_design","49301663_The_Psychology_of_Personal_Constructs","42793030_Problem_Frames_Analysing_and_Structuring_Software_Development_Problems","33771200_The_Change_of_Personal_Constructs_from_the_Viewpoint_of_a_Theory_of_Construct_Implications","3556118_Techniques_for_Requirements_Elicitation"]}