{"id":"340995475_A_Multivariate_Regression_Model_for_Identifying_Analyzing_and_Predicting_Crimes","abstract":"Crime is canonically “capricious”. It is not necessarily hap-hazardous, but neither does it occur consistently. A better theoretical perception is needed to facilitate practical crime prevention solutions that correspond to specific places and times. Crime analysis and prevention is a systematic approach for identifying and analyzing patterns and trends in crime. Crime data analysts helps in law enforcement officers to speed up the process of solving crimes, owing to increase in the advent of computerized systems. This research is an attempt to forecast the occurrences of crimes, and predicts the frequency (count) of crimes at beat-day level in the city of Chicago. Forecasting crimes helps in taking care of crime prevention methods and the frequency of crimes helps to focus on the type of crime. This novel work is a collaboration between computer science and criminal justice aimed to develop a data mining procedure that can help solve crimes faster. Instead of focusing on causes of crime occurrence like political enmity, the criminal background of the offender etc. the author focused on crime factors for each day.","authors":["Siddharth Shukla","Praphula kumar Jain","Ramesh Ch","R. Pamula"],"meta":["August 2020Wireless Personal Communications 113(4)","DOI:10.1007/s11277-020-07335-w","Projects: data mininigData Mining"],"references":["288835251_Data_Mining-_Introductory_and_Advanced_Topics","279841124_Learning_to_Detect_Patterns_of_Crime","262411243_Spatiotemporal_Correlations_in_Criminal_Offense_Records","262007007_Automatic_Crime_Prediction_Using_Events_Extracted_from_Twitter_Posts","249683610_A_Temporal_Constraint_Theory_to_Explain_Opportunity-Based_Spatial_Offending_Patterns","247478130_The_Utility_of_Hotspot_Mapping_for_Predicting_Spatial_Patterns_of_Crime","242451455_A_Statistical_Model_of_Criminal_Behavior","345636385_Tactical_Crime_Analysis_Research_and_Investigation","303206384_Data_Mining_Concepts_and_Techniques","228744603_Fuzzy_association_rule_mining_for_community_crime_pattern_discovery"]}