{"id":"340945742_A_Comparative_Analysis_of_Breast_Cancer_Detection_and_Diagnosis_Using_Data_Visualization_and_Machine_Learning_Applications","abstract":"In the developing world, cancer death is one of the major problems for humankind. Even though there are many ways to prevent it before happening, some cancer types still do not have any treatment. One of the most common cancer types is breast cancer, and early diagnosis is the most important thing in its treatment. Accurate diagnosis is one of the most important processes in breast cancer treatment. In the literature, there are many studies about predicting the type of breast tumors. In this research paper, data about breast cancer tumors from Dr. William H. Walberg of the University of Wisconsin Hospital were used for making predictions on breast tumor types. Data visualization and machine learning techniques including logistic regression, k-nearest neighbors, support vector machine, naïve Bayes, decision tree, random forest, and rotation forest were applied to this dataset. R, Minitab, and Python were chosen to be applied to these machine learning techniques and visualization. The paper aimed to make a comparative analysis using data visualization and machine learning applications for breast cancer detection and diagnosis. Diagnostic performances of applications were comparable for detecting breast cancers. Data visualization and machine learning techniques can provide significant benefits and impact cancer detection in the decision-making process. In this paper, different machine learning and data mining techniques for the detection of breast cancer were proposed. Results obtained with the logistic regression model with all features included showed the highest classification accuracy (98.1%), and the proposed approach revealed the enhancement in accuracy performances. These results indicated the potential to open new opportunities in the detection of breast cancer.","authors":["Muhammet Fatih Ak"],"meta":["April 2020Healthcare 8(2):111","DOI:10.3390/healthcare8020111"],"references":["339201802_Machine_Learning_Based_Approaches_for_Modeling_the_Output_Power_of_Photovoltaic_Array_in_Real_Outdoor_Conditions","338862550_Comparative_analysis_between_synthetic_mammography_reconstructed_from_digital_breast_tomosynthesis_and_full-field_digital_mammography_for_breast_cancer_detection_and_visibility","328766758_Predicting_Diabetes_Mellitus_With_Machine_Learning_Techniques","327549238_An_optimized_framework_for_cancer_prediction_using_immunosignature","320916535_Using_Five_Machine_Learning_for_Breast_Cancer_Biopsy_Predictions_Based_on_Mammographic_Diagnosis","338037439_Automatic_Patent_Classification_using_supervised_machine_learning","327610502_Global_Cancer_Statistics_2018_GLOBOCAN_Estimates_of_Incidence_and_Mortality_Worldwide_for_36_Cancers_in_185_Countries_Global_Cancer_Statistics_2018","327208578_An_Optimized_Framework_for_Cancer_Prediction_Using_Immunosignature","321751462_Breast_cancer_data_analysis_for_survivability_studies_and_prediction","321210883_On_Breast_Cancer_Detection_An_Application_of_Machine_Learning_Algorithms_on_the_Wisconsin_Diagnostic_Dataset"]}