{"id":"340977531_P-ODN_Prototype-based_Open_Deep_Network_for_Open_Set_Recognition","abstract":"Most of the existing recognition algorithms are proposed for closed set scenarios, where all categories are known beforehand. However, in practice, recognition is essentially an open set problem. There are categories we know called “knowns”, and there are more we do not know called “unknowns”. Enumerating all categories beforehand is never possible, consequently, it is infeasible to prepare sufficient training samples for those unknowns. Applying closed set recognition methods will naturally lead to unseen-category errors. To address this problem, we propose the prototype-based Open Deep Network (P-ODN) for open set recognition tasks. Specifically, we introduce prototype learning into open set recognition. Prototypes and prototype radiuses are trained jointly to guide a CNN network to derive more discriminative features. Then P-ODN detects the unknowns by applying a multi-class triplet thresholding method based on the distance metric between features and prototypes. Manual labeling the unknowns which are detected in the previous process as new categories. Predictors for new categories are added to the classification layer to “open” the deep neural networks to incorporate new categories dynamically. The weights of new predictors are initialized exquisitely by applying a distances based algorithm to transfer the learned knowledge. Consequently, this initialization method speeds up the fine-tuning process and reduce the samples needed to train new predictors. Extensive experiments show that P-ODN can effectively detect unknowns and needs only few samples with human intervention to recognize a new category. In the real world scenarios, our method achieves state-of-the-art performance on the UCF11, UCF50, UCF101 and HMDB51 datasets.","authors":["Yu Shu","Yemin Shi","Yaowei Wang","Tiejun Huang"],"meta":["April 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-63649-6"],"references":["305779667_Temporal_Segment_Networks_Towards_Good_Practices_for_Deep_Action_Recognition","305196650_Going_deeper_with_convolutions","332810072_Generative_OpenMax_for_Multi-Class_Open_Set_Classification","329740099_Robust_Classification_with_Convolutional_Prototype_Learning","328245246_ODN_Opening_the_Deep_Network_for_Open-Set_Action_Recognition","322059052_Learning_Long-Term_Dependencies_for_Action_Recognition_with_a_Biologically-Inspired_Deep_Network","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318671326_Generative_OpenMax_for_Multi-Class_Open_Set_Classification","312532410_Incremental_and_decremental_support_vector_machine_learning","311609772_Towards_Open_Set_Deep_Networks"]}