{"id":"340949993_Optimized_Mahalanobis-Taguchi_System_for_High-Dimensional_Small_Sample_Data_Classification","abstract":"The Mahalanobis–Taguchi system (MTS) is a multivariate data diagnosis and prediction technology, which is widely used to optimize large sample data or unbalanced data, but it is rarely used for high-dimensional small sample data. In this paper, the optimized MTS for the classification of high-dimensional small sample data is discussed from two aspects, namely, the inverse matrix instability of the covariance matrix and the instability of feature selection. Firstly, based on regularization and smoothing techniques, this paper proposes a modified Mahalanobis metric to calculate the Mahalanobis distance, which is aimed at reducing the influence of the inverse matrix instability under small sample conditions. Secondly, the minimum redundancy-maximum relevance (mRMR) algorithm is introduced into the MTS for the instability problem of feature selection. By using the mRMR algorithm and signal-to-noise ratio (SNR), a two-stage feature selection method is proposed: the mRMR algorithm is first used to remove noise and redundant variables; the orthogonal table and SNR are then used to screen the combination of variables that make great contribution to classification. Then, the feasibility and simplicity of the optimized MTS are shown in five datasets from the UCI database. The Mahalanobis distance based on regularization and smoothing techniques (RS-MD) is more robust than the traditional Mahalanobis distance. The two-stage feature selection method improves the effectiveness of feature selection for MTS. Finally, the optimized MTS is applied to email classification of the Spambase dataset. The results show that the optimized MTS outperforms the classical MTS and the other 3 machine learning algorithms.","authors":["Xinping Xiao","Dian Fu","Yu Shi","Jianghui Wen"],"meta":["April 2020Computational Intelligence and Neuroscience 2020","DOI:10.1155/2020/4609423"],"references":["337169259_Integrating_MTS_with_bagging_strategy_for_class_imbalance_problems","335438595_Priority_Setting_for_the_Management_of_Chemicals_Using_the_Globally_Harmonized_System_and_Multivariate_Analysis_Use_of_the_Mahalanobis-Taguchi_System","335325089_Hierarchical_Coastline_Detection_in_SAR_Images_Based_on_Spectral-Textural_Features_and_Global-Local_Information","335140305_Gait_Classification_Using_Mahalanobis-Taguchi_System_for_Health_Monitoring_Systems_Following_Anterior_Cruciate_Ligament_Reconstruction","335029624_Classification_and_prediction_of_wafer_probe_yield_in_DRAM_manufacturing_using_Mahalanobis-Taguchi_system_and_neural_network","331635233_Optimal_feature_selection_in_industrial_foam_injection_processes_using_hybrid_binary_Particle_Swarm_Optimization_and_Gravitational_Search_Algorithm_in_the_Mahalanobis-Taguchi","338972817_A_new_grey_model_for_traffic_flow_mechanics","335035890_Regional_energy_security_performance_evaluation_in_China_using_MTGS_and_SPA-TOPSIS","333807452_Comparing_Principal_Component_Analysis_and_Mahalanobis-Taguchi_System_to_Detect_Unbalance_in_a_Centrifugal_Compressor_in_a_Floating_Production_Storage_Offloading","332991641_Change_Detection_in_SAR_Images_using_Deep_Belief_Network_a_New_Training_Approach_based_on_Morphological_Images"]}