{"id":"340928687_Surface_EMG_signal_classification_using_TQWT_Bagging_and_Boosting_for_hand_movement_recognition","abstract":"Hands play a significant role in grasping and manipulating different objects. The loss of even a single hand have impact on the human activity. In this regard, a prosthetic hand is an appealing solution for the subjects who lost their hands. The surface electromyogram (sEMG) plays a vital role in the design of prosthesis hands. The ensemble classifiers achieve better performance by using a weighted combination of several classifier models. Hence, in this paper, the feasibility of the Bagging and the Boosting ensemble classifiers is assessed for the basic hand movement recognition by using sEMG signals, which were recorded during the grasping movements with various objects for the six hand motions. So, the novelty of the current study is the development of an ensemble model for hand movement recognition based on the tunable Q-factor wavelet transform (TQWT). The proposed method consists of three steps. In the first step, MSPCA is used for denoising. In the second step, a novel feature extraction method, TQWT is used for feature extraction from the sEMG signals, then, statistical values of TQWT sub-bands are calculated. In the last step, the obtained feature set is used as input to an ensemble classifier for the identification of intended hand movements. Performances of the Bagging and the Boosting ensemble classifiers are compared in terms of different performance measures. Using TQWT extracted features along with the presented the Adaboost with SVM and the Multiboost with SVM classifier results in a classification accuracy up to 100%. Hence, the results have shown that the proposed framework has achieved overall better performance and it is a potential candidate for the prosthetic hands control.","authors":["Abdulhamit Subasi","Saeed Mian Qaisar"],"meta":["April 2020Journal of Ambient Intelligence and Humanized Computing","DOI:10.1007/s12652-020-01980-6","Project: An Event Driven Biomedical Signal Testbed for the Brain Machine Interface and Man–Machine Interaction using EEG and EMG Signals"],"references":["329965246_Credit_scoring_for_a_microcredit_data_set_using_the_synthetic_minority_oversampling_technique_and_ensemble_classifiers","328677090_sEMG_Signal_Classification_Using_DWT_and_Bagging_for_Basic_Hand_Movements","328487029_Automated_EMG_Signal_Classification_for_Diagnosis_of_Neuromuscular_Disorders_Using_DWT_and_Bagging","327062766_Knit_Band_Sensor_for_Myoelectric_Control_of_Surface_EMG-Based_Prosthetic_Hand","324248693_Surface_EMG_based_Classification_of_basic_hand_movements_using_Rotation_Forest","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","319770816_Combining_Pattern_Classifiers_Methods_and_Algorithms","318936026_A_data_partitioning_method_for_increasing_ensemble_diversity_of_an_eSVM-based_P300_speller","314992716_Surface_EMG_Signal_Classification_by_Using_WPD_and_Ensemble_Tree_Classifiers","313710454_Standards_for_reporting_EMG_data"]}