{"id":"340952581_The_Infectious_Disease_Ontology_in_the_Age_of_COVID-19","abstract":"Background\nEfforts to respond effectively to public health emergencies, such as we are now experiencing with COVID-19, require data sharing across multiple disciplines, and this is hindered by the fact that relevant information is often collected using discipline-specific terminologies and coding systems and stored in heterogenous databases. Ontologies provide a powerful data sharing and integration tool. In practice, however, this method is often undermined by uncoordinated ontology development. Following the principles of the Open Biomedical Ontologies Foundry, the Infectious Disease Ontology (IDO) represents one step towards overcoming such silo problems.ResultsIDO is a suite of interoperable ontology modules that aims to provide coverage of all aspects of the infectious disease domain, including biomedical research, clinical care, and public health. IDO Core is designed to be a disease and pathogen neutral ontology, covering just those types of entities and relations that are relevant to infectious diseases generally. IDO Core is then extended by a collection of ontology modules focusing on specific diseases and pathogens. In this paper we present applications of IDO Core together with an overview of all IDO extension ontologies and the methodology on the basis of which they are built. We also survey recent developments involving IDO, including: IDO Virus (VIDO); the Coronavirus Infectious Disease Ontology (CIDO); and an extension of CIDO focusing on COVID-19 (IDO-COVID-19). We discuss how these ontologies might assist in information-driven efforts to deal with the ongoing COVID-19 pandemic, to accelerate data discovery in the early stages of future pandemics, and to promote reproducibility of infectious disease research.Conclusions\nAs we face the continued threat of novel pathogens in the future, IDO provides a simple recipe for building new pathogen-specific ontologies in a way that allows data about novel diseases to be easily compared, along multiple dimensions, with already curated data from earlier diseases. IDO’s tightly coordinated suite of ontologies modules provides a powerful method of data integration and sharing that will allow physicians, researchers, and public health organizations to respond rapidly and efficiently both to the current and future public health crises.","authors":["Shane Michael Babcock","John Beverley","Lindsay G Cowell","Barry Smith"],"meta":["May 2020","DOI:10.31219/osf.io/az6u5","Projects: IDO VIDO CIDO IDO-COVID-19The Infectious Disease Ontology in the Age of COVID-19"],"references":["342862702_Implications_of_Knowledge_Organization_Systems_for_Health_Information_Exchange_and_Communication_during_the_COVID-19_Pandemic","342312370_COVID-19_pandemic_reveals_the_peril_of_ignoring_metadata_standards","342150258_CIDO_a_community-based_ontology_for_coronavirus_disease_knowledge_and_data_integration_sharing_and_analysis","341508647_Ontology_preludes_Data_Science_a_COVID-19_use_case","341270132_Machine_learning_with_biomedical_ontologies","340927031_Prediction_of_novel_virus-host_interactions_by_integrating_clinical_symptoms_and_protein_sequences","340089618_COVID-19_coronavirus_vaccine_design_using_reverse_vaccinology_and_machine_learning","333613324_The_Plant_Ontology_Facilitates_Comparisons_of_Plant_Development_Stages_Across_SpeciesData_Sheet_1PDFTable_1csvTable_2pdfTable_3pdfTable_4pdfTable_5csvTable_6csv","340287014_Ontological_and_Bioinformatic_Analysis_of_Anti-Coronavirus_Drugs_and_Their_Implication_for_Drug_Repurposing_against_COVID-19","335381845_IDOMEN_An_Extension_of_Infectious_Disease_Ontology_for_MENingitis","328930075_The_Gene_Ontology_Resource_20_years_and_still_GOing_strong","328561032_Victors_a_web-based_knowledge_base_of_virulence_factors_in_human_and_animal_pathogens","327560204_Ontology_boosted_deep_learning_for_disease_name_extraction_from_Twitter_messages","329156679_Ontology-based_knowledge_representation_of_experiment_metadata_in_biological_data_mining","328328646_An_ontological_analysis_of_drug_prescriptions"]}