{"id":"340956758_An_environment_for_sustainable_research_software_in_Germany_and_beyond_current_state_open_challenges_and_call_for_action","abstract":"Research software has become a central asset in academic research. It optimizes existing and enables new research methods, implements and embeds research knowledge, and constitutes an essential research product in itself. Research software must be sustainable in order to understand, replicate, reproduce, and build upon existing research or conduct new research effectively. In other words, software must be available, discoverable, usable, and adaptable to new needs, both now and in the future. Research software therefore requires an environment that supports sustainability.\n\nHence, a change is needed in the way research software development and maintenance are currently motivated, incentivized, funded, structurally and infrastructurally supported, and legally treated. Failing to do so will threaten the quality and validity of research. In this paper, we identify challenges for research software sustainability in Germany and beyond, in terms of motivation, selection, research software engineering personnel, funding, infrastructure, and legal aspects. Besides researchers, we specifically address political and academic decision-makers to increase awareness of the importance and needs of sustainable research software practices. In particular, we recommend strategies and measures to create an environment for sustainable research software, with the ultimate goal to ensure that software-driven research is valid, reproducible and sustainable, and that software is recognized as a first class citizen in research. This paper is the outcome of two workshops run in Germany in 2019, at deRSE19 - the first International Conference of Research Software Engineers in Germany - and a dedicated DFG-supported follow-up workshop in Berlin.","authors":["Hartwig Anzt","Felix Bach","Stephan Druskat","Frank Löffler"],"meta":["April 2020F1000 Research 9:295","DOI:10.12688/f1000research.23224.1"],"references":["354802700_Open_Source_Software_Sustainability_Models_Initial_White_Paper_from_the_Informatics_Technology_for_Cancer_Research_Sustainability_and_Industry_Partnership_Working_Group_Preprint","337550103_On_the_evaluation_of_research_software_the_CDUR_procedure","337239404_Towards_FAIR_principles_for_research_software","336759685_Measuring_sustainability_of_seed-funded_earth_science_informatics_projects","334973720_On_the_evaluation_of_research_software_the_CDUR_procedure","332717995_First_M87_Event_Horizon_Telescope_Results_IV_Imaging_the_Central_Supermassive_Black_Hole","338427725_Software_Citation_Implementation_Challenges","337784475_Infrastrukturstrategien_fur_nachhaltige_Forschungssoftware_in_befristeten_Projekten","337177404_Software_and_Dependencies_in_Research_Citation_Graphs","334149388_How_to_support_open-source_software_and_stay_sane","332432748_The_Innovations_of_Open_Source","332155974_The_State_of_Sustainable_Research_Software_Learning_from_the_Workshop_on_Sustainable_Software_for_Science_Practice_and_Experiences_WSSSPE51","331575802_Effect_of_Impact_Factor_and_Discipline_on_Journal_Data_Sharing_Policies","332249421_Research_software_citation_in_the_Data_Citation_Index_Current_practices_and_implications_for_research_software_sharing_and_reuse","331274321_Challenges_of_measuring_software_impact_through_citations_An_examination_of_the_lme4_R_package"]}