{"id":"340934497_Eye-tracking_and_artificial_intelligence_to_enhance_motivation_and_learning","abstract":"The interaction with the various learners in a Massive Open Online Course (MOOC) is often complex. Contemporary MOOC learning analytics relate with click-streams, keystrokes and other user-input variables. Such variables however, do not always capture users’ learning and behavior (e.g., passive video watching). In this paper, we present a study with 40 students who watched a MOOC lecture while their eye-movements were being recorded. We then proposed a method to define stimuli-based gaze variables that can be used for any kind of stimulus. The proposed stimuli-based gaze variables indicate students’ content-coverage (in space and time) and reading processes (area of interest based variables) and attention (i.e., with-me-ness), at the perceptual (following teacher’s deictic acts) and conceptual levels (following teacher discourse). In our experiment, we identified a significant mediation effect of the content coverage, reading patterns and the two levels of with-me-ness on the relation between students’ motivation and their learning performance. Such variables enable common measurements for the different kind of stimuli present in distinct MOOCs. Our long-term goal is to create student profiles based on their performance and learning strategy using stimuli-based gaze variables and to provide students gaze-aware feedback to improve overall learning process. One key ingredient in the process of achieving a high level of adaptation in providing gaze-aware feedback to the students is to use Artificial Intelligence (AI) algorithms for prediction of student performance from their behaviour. In this contribution, we also present a method combining state-of-the-art AI technique with the eye-tracking data to predict student performance. The results show that the student performance can be predicted with an error of less than 5%.","authors":["Kshitij Sharma","Michail Giannakos","Pierre Dillenbourg"],"meta":["April 2020Smart Learning Environments 7(1)","DOI:10.1186/s40561-020-00122-x"],"references":["340521180_Shaping_learners'_attention_in_Massive_Open_Online_Courses","350684362_Imagery_and_Verbal_Processes","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond","327606950_Generalized_Additive_Models","326454113_Prediction_in_MOOCs_A_Review_and_Future_Research_Directions","326054270_A_systematic_review_of_eye_tracking_research_on_multimedia_learning","321312548_Eye-tracking_technology_in_medical_education_A_systematic_review","314390613_Nader's_raid_on_the_testing_industry_Is_it_in_the_best_interest_of_the_consumer","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","303282603_Withdrawing_From_School"]}