{"id":"340994004_Cross-Modal_Data_Programming_Enables_Rapid_Medical_Machine_Learning","abstract":"A major bottleneck in developing clinically impactful machine learning models is a lack of labeled training data for model supervision. Thus, medical researchers increasingly turn to weaker, noisier sources of supervision, such as leveraging extractions from unstructured text reports to supervise image classification. A key challenge in weak supervision is combining sources of information that may differ in quality and have correlated errors. Recently, a statistical theory of weak supervision called data programming has shown promise in addressing this challenge. Data programming now underpins many deployed machine-learning systems in the technology industry, even for critical applications. We propose a new technique for applying data programming to the problem of cross-modal weak supervision in medicine, wherein weak labels derived from an auxiliary modality (e.g., text) are used to train models over a different target modality (e.g., images). We evaluate our approach on diverse clinical tasks via direct comparison to institution-scale, hand-labeled datasets. We find that our supervision technique increases model performance by up to 6 points area under the receiver operating characteristic curve (ROC-AUC) over baseline methods by improving both coverage and quality of the weak labels. Our approach yields models that on average perform within 1.75 points ROC-AUC of those supervised with physician-years of hand labeling and outperform those supervised with physician-months of hand labeling by 10.25 points ROC-AUC, while using only person-days of developer time and clinician work—a time saving of 96%. Our results suggest that modern weak supervision techniques such as data programming may enable more rapid development and deployment of clinically useful machine-learning models.","authors":["Jared A. Dunnmon","Alexander J. Ratner","Khaled Saab","Nishith Khandwala"],"meta":["April 2020Patterns 1(2):100019","DOI:10.1016/j.patter.2020.100019"],"references":["334476066_Snorkel_rapid_training_data_creation_with_weak_supervision","330203264_A_guide_to_deep_learning_in_healthcare","329715894_An_explainable_deep-learning_algorithm_for_the_detection_of_acute_intracranial_haemorrhage_from_small_datasets","329078287_Deep_learning_for_chest_radiograph_diagnosis_A_retrospective_comparison_of_the_CheXNeXt_algorithm_to_practicing_radiologists","335800693_CheXpert_A_Large_Chest_Radiograph_Dataset_with_Uncertainty_Labels_and_Expert_Comparison","335554551_Training_Complex_Models_with_Multi-Task_Weak_Supervision","333865246_Snorkel_DryBell_A_Case_Study_in_Deploying_Weak_Supervision_at_Industrial_Scale","333861089_ChronoNet_A_Deep_Recurrent_Neural_Network_for_Abnormal_EEG_Identification","330203263_The_practical_implementation_of_artificial_intelligence_technologies_in_medicine","328921649_Assessment_of_Convolutional_Neural_Networks_for_Automated_Classification_of_Chest_Radiographs"]}