{"id":"340995924_A_method_for_solving_scriptio_continua_in_Javanese_manuscript_transliteration","abstract":"Many Javanese manuscripts in Indonesia are stored in museums and libraries. Most of these manuscripts were written using local scripts that are rarely used in everyday life, and hence a software application that can help and improve the reading of these manuscripts is valuable. An essential step in automatic manuscript image transliteration is post-processing, which involves editing and concatenating syllables into words. The main problem of post-processing is that there exists no symbol for space between words in a sentence, which is called the scriptio-continua problem. This paper proposes methods based on the backtracking algorithm to solve the scriptio continua in the post-processing step of Javanese manuscript image transliteration. The proposed methods use a depth-first search in seeking relevant candidate words to determine whether to merge a new syllable or not. The results of the proposed methods to concatenate 17,687 syllables from the Hamong Tani book using a dictionary containing 49,801 words are found to be satisfactory in terms of computation and accuracy. The accuracy of the implemented greedy and brute-force methods is both 81.64%. However, the greedy-based method is more efficient and has a better performance than the brute-force method.","authors":["Anastasia Widiarti","Reza Pulungan"],"meta":["April 2020Heliyon 6(4):e03827","DOI:10.1016/j.heliyon.2020.e03827","Project: thinning of various local character"],"references":["335074056_Deep_Statistical_Analysis_of_OCR_Errors_for_Effective_Post-OCR_Processing","328236499_A_proposed_model_for_Javanese_manuscript_images_transliteration","266976921_Preprocessing_Model_of_Manuscripts_in_Javanese_Characters","265167340_Widiarti-Winarko_Algorithm_for_Grouping_Syllables_Result_from_the_Javanese_Literature_Document_Image_Recognition","259558659_Aplikasi_DTMC_untuk_Post-Processing_Pengenalan_Citra_Dokumen_Teks","327369281_Urdu_Optical_Character_Recognition_Systems_Present_Contributions_and_Future_Directions","325994058_OCR_Error_Correction_State-of-the-Art_vs_an_NMT-based_Approach","325877073_Statistical_learning_for_OCR_error_correction","322583197_The_Model_and_Implementation_of_Javanese_Script_Image_Transliteration","240231497_Segmentation-Based_Cursive_Handwriting_Recognition"]}