{"id":"341030574_Epilepsies_as_Dynamical_Diseases_of_Brain_Systems_Basic_Models_of_the_Transition_Between_Normal_and_Epileptic_Activity","abstract":"Purpose: \nThe occurrence of abnormal dynamics in a physiological system can become manifest as a sudden qualitative change in the behavior of characteristic physiologic variables. We assume that this is what happens in the brain with regard to epilepsy. We consider that neuronal networks involved in epilepsy possess multistable dynamics (i.e., they may display several dynamic states). To illustrate this concept, we may assume, for simplicity, that at least two states are possible: an interictal one characterized by a normal, apparently random, steady-state of ongoing activity, and another one that is characterized by the paroxysmal occurrence of a synchronous oscillations (seizure).\n\nMethods: \nBy using the terminology of the mathematics of nonlinear systems, we can say that such a bistable system has two attractors, to which the trajectories describing the system's output converge, depending on initial conditions and on the system's parameters. In phase-space, the basins of attraction corresponding to the two states are separated by what is called a \"separatrix.\" We propose, schematically, that the transition between the normal ongoing and the seizure activity can take place according to three basic models: Model I: In certain epileptic brains (e.g., in absence seizures of idiopathic primary generalized epilepsies), the distance between \"normal steady-state\" and \"paroxysmal\" attractors is very small in contrast to that of a normal brain (possibly due to genetic and/or developmental factors). In the former, discrete random fluctuations of some variables can be sufficient for the occurrence of a transition to the paroxysmal state. In this case, such seizures are not predictable. Model II and model III: In other kinds of epileptic brains (e.g., limbic cortex epilepsies), the distance between \"normal steady-state\" and \"paroxysmal\" attractors is, in general, rather large, such that random fluctuations, of themselves, are commonly not capable of triggering a seizure. However, in these brains, neuronal networks have abnormal features characterized by unstable parameters that are very vulnerable to the influence of endogenous (model II) and/or exogenous (model III) factors. In these cases, these critical parameters may gradually change with time, in such a way that the attractor can deform either gradually or suddenly, with the consequence that the distance between the basin of attraction of the normal state and the separatrix tends to zero. This can lead, eventually, to a transition to a seizure.\n\nResults: \nThe changes of the system's dynamics preceding a seizure in these models either may be detectable in the EEG and thus the route to the seizure may be predictable, or may be unobservable by using only measurements of the dynamical state. It is thinkable, however, that in some cases, changes in the excitability state of the underlying networks may be uncovered by using appropriate stimuli configurations before changes in the dynamics of the ongoing EEG activity are evident. A typical example of model III that we discuss here is photosensitive epilepsy.\n\nConclusions: \nWe present an overview of these basic models, based on neurophysiologic recordings combined with signal analysis and on simulations performed by using computational models of neuronal networks. We pay especial attention to recent model studies and to novel experimental results obtained while analyzing EEG features preceding limbic seizures and during intermittent photic stimulation that precedes the transition to paroxysmal epileptic activity.","authors":["Fernando Lopes da Silva","Wouter Blanes","Stiliyan Kalitzin","Jaime Parra"],"meta":["December 2003Epilepsia 44(Suppl. 12):72-83","DOI:10.1111/j.0013-9580.2003.12005.x","Project: Reconstructive Computational Neuroscience (RECON)"],"references":["299313326_Differential_Expression_of_Synaptic_and_Nonsynaptic_Mechanisms_Underlying_Stimulus-Induced_Gamma_Oscillations_In_Vitro","322047836_The_functional_states_of_the_thalamus_and_the_associated_neuronal_interplay","304541564_Thalamocortical_oscillations_in_the_sleeping_and_aroused_brain","285380119_Stimulus-specific_neuronal_oscillations_in_the_orientation_columns_of_cat_visula_cortex","283617654_Inhibition-based_rhythms_experimental_and_mathematical_observations_on_network_dynamics","277001871_Anticipation_of_epileptic_seizures_from_standard_EEG_recordings_-_Reply","269853625_Nonlinear_Dynamics_and_Chaos","268320122_Nonlinear_Dynamics_and_Chaos","264297043_Sequential_analysis_of_the_visual_evoked_potential_system_in_man_nonlinear_analysis_of_a_sandwich_system","260920233_Chaos_in_Dynamical_Systems"]}