{"id":"341063536_Applying_an_attitude_network_approach_to_consumer_behaviour_towards_plastic","abstract":"In a time of rapid climate change, understanding what may encourage sustainable consumer behaviour is a vital, but difficult challenge. Using an attitude network approach, we investigated which associations people have toward conventional and bio-based plastic in order to develop an empirically-based approach to initiate attitude- and behaviour change. With a qualitative study (N = 97), we distilled 25 evaluative reactions (i.e. beliefs, emotions, and behaviours) that encompass people's attitude toward using (bio-based) plastic. These reactions were used to create a new scale, which was subsequently tested among 508 online participants. The resulting data was then used to build a network displaying relationships between participants' evaluative reactions regarding plastic use. Analyses on this network indicated that guilt was most strongly connected to people's willingness to pay more for bio-based plastic products. Based on this, we conducted another study (N = 285) in which we experimentally manipulated guilt (general guilt, personal guilt, and control condition) to determine its effects on people's willingness to pay for a sustainable cause. Results indicate that manipulating guilt can lead participants to donate more to a sustainable cause. This effect was fully mediated by self-reported guilt. Determining which factors influence consumers to change their buying behaviour towards sustainability is the first step in creating a demand for more sustainable products amongst the public and investors.","authors":["Maria Zwicker","Hannah Nohlen","Jonas Dalege","Gert-Jan M. Gruter"],"meta":["April 2020Journal of Environmental Psychology 69:101433","DOI:10.1016/j.jenvp.2020.101433","Project: Consumer attitudes and behaviour towards climate change"],"references":["332997441_Using_a_Gaussian_Graphical_Model_to_Explore_Relationships_Between_Items_and_Variables_in_Environmental_Psychology_Research","330367612_Meta-analyses_of_factors_motivating_climate_change_adaptation_behaviour","324439025_The_role_of_stabilizing_and_communicating_symptoms_given_overlapping_communities_in_psychopathology_networks","321398798_The_influence_of_anticipated_pride_and_guilt_on_pro-environmental_decision_making","318789026_Network_Analysis_on_Attitudes_A_Brief_Tutorial","315782087_Network_Structure_Explains_the_Impact_of_Attitudes_on_Voting_Decisions","304163750_Brief_Report_on_Estimating_Regularized_Gaussian_Networks_from_Continuous_and_Ordinal_Data","335504015_The_Carbon_Footprint_of_Material_Production_Rises_to_23_of_Global_Greenhouse_Gas_Emissions","327125848_Studying_the_effects_of_intervention_programmes_on_household_energy_saving_behaviours_using_graphical_causal_models","308058706_The_theory_of_planned_behavior_organizational_behavior_and_human_decision_processes"]}