{"id":"341079457_Computational_Music_Thinking_Patterns_Connecting_Music_Education_with_Computer_Science_Education_through_the_Design_of_Interactive_Notations","abstract":"Computational Music Thinking combines computing education and music education with the goal to overcome common aptitudinal and attitudinal challenges. Many students, and teachers, believe that writing programs or performing music is beyond their natural abilities. Instead of trying to teach computing and music separately, Computational Music Thinking employs the design of interactive notations as a synergistic activity to learn simultaneously about computation and music. On the one hand, music can turn abstract computational concepts into enjoyable concrete experiences. Computation, on the other hand, can expand students' notion of music education well beyond music performance. A course with elementary school pre-service teachers explored the teaching of Computational Music Thinking through a small set of constructs called Computational Music Thinking Patterns. These patterns are centered around educational activities to design interactive notations in accessible as well as engaging ways. Computational Music Thinking Patterns expand our previous work on Computational Thinking Patterns used in game design and simulation authoring activities. Data collected from the course suggest highly positive effects on teachers' attitudes towards believing that Computational Music Thinking is important to their teaching, that Computational Music Thinking helps the comprehension of computer science and that Computational Music Thinking helps the comprehension of music.","authors":["Alexander Repenning","Jürg Zurmühle","Anna Lamprou","Daniel Hug"],"meta":["May 2020","DOI:10.5220/0009817506410652","Conference: CSEDU 2020 - 12th International Conference on Computer Supported EducationAt: Prague","Project: Computational Music Thinking"],"references":["334579817_Making_Computer_Science_Education_Mandatory_Exploring_a_Demographic_Shift_in_Switzerland","331300857_The_Zones_of_Proximal_Flow_Tutorial_Designing_Computational_Thinking_Cliffhangers","322017348_Think_the_Image_Don't_Make_It_On_Algorithmic_Thinking_Art_Education_and_Re-Coding","320445800_Moving_Beyond_Syntax_Lessons_from_20_Years_of_Blocks_Programing_in_AgentSheets","319445103_Fostering_Computational_Thinking_in_Primary_School_through_a_LEGO_R_-based_Music_Notation","317121165_Fostering_Computational_Thinking_in_Secondary_School_through_Music_-_An_Educational_Experience_based_on_Google_Blockly","331300819_Sports_Analytics_as_a_Context_for_Computational_Thinking_in_K-12_Education","326423572_If_Art_Education_Then_Critical_Digital_Making_Computational_Thinking_and_Creative_Code","323929844_Music_Technology_and_Education","319321205_Exploring_Computational_Music_Thinking_in_a_Workshop_Setting_with_Primary_and_Secondary_School_Children"]}