{"id":"341018517_Alfabetizacao_-_uma_evolucao_do_conceito_alfabetizacao_e_letramento_em_codigo_Literacy_-_an_evolution_of_the_concept_literacy_and_code_literacy","abstract":"RESUMO: Este artigo retoma os conceitos e Alfabetização Científica e Alfabetização Científica e Tecnológica e suas diferentes denominações. Apresenta conceitos sobre a Alfabetização Digital, sua importância e diferentes tipos. Discute as diferenças conceituais sobre alfabetização e letramento, tanto científica quanto tecnológica. A partir da compreensão desses conceitos e os tomando como base, o objetivo deste trabalho é apresentar a evolução histórica sobre alfabetização, mais especificamente na área da Ciência da Computação, trazendo uma abordagem sobre a Alfabetização de Código. A proposta de um diferente entendimento para a Alfabetização de Código e um inovador conceito sobre Letramento em Código são as principais contribuições deste trabalho.\nPALAVRAS-CHAVE: alfabetização científica; alfabetização tecnológica; alfabetização digital; alfabetização em código.\n\nABSTRACT: This article recaptures the concepts of Scientific Literacy and Scientific and Technological Literacy and their different denominations. It presents concepts about Digital Literacy, its importance and different types. It also discusses conceptual differences between literacy and literacies, both scientific and technological. From the understanding of these concepts and taking them as a basis, the objective of this work is to present the historical evolution of literacy, more specifically, in the area of Computer Science, bringing an approach on Code Literacy. The proposal of a different understanding for Code Literacy and an innovative concept about Code Literacy are the main contributions of this work.\nKEYWORDS: scientific literacy; technologic literacy; digital literacy; code literacy.","authors":["Walkiria Cordenonzi","José Claudio Del Pino","Eniz Conceição Oliveira","Andreia Strohschoen"],"meta":["April 2020Texto Livre Linguagem e Tecnologia 13(1):137","DOI:10.17851/1983-3652.13.1.137-155"],"references":["324466406_O_que_significa_alfabetizacao_ou_letramento_para_os_pesquisadores_da_educacao_cientifica_e_qual_o_impacto_desses_conceitos_no_ensino_de_ciencias","282574384_Aprender_a_programar_'apps'_como_enriquecimiento_curricular_en_alumnado_de_alta_capacidad","262105558_Evolucion_de_la_alfabetizacion_digital_nuevos_conceptos_y_nuevas_alfabetizaciones","259599991_Estrategias_educativas_para_el_desarrollo_de_la_competencia_digital","39141192_Alfabetizacion_cientifica_y_tecnologica_la_transposicion_didactica_del_conocimiento_tecnologico","290059313_Local_Literacies_Reading_and_Writing_in_One_Community","288244938_Scientific_literacy_A_conceptual_and_empirical_review","267828647_LETRAMENTO_DIGITAL_E_FORMACAO_DE_PROFESSORES","262296302_Computer_Science_Revisited","23926566_What_is_computer_science"]}