{"id":"341070406_From_Decline_of_the_West_to_Dawn_of_Day_Dan_Brown's_Origin_as_a_Diagnostic_of_the_Present","abstract":"This paper subjects Dan Brown’s most recent novel Origin to a philosophical reading. Origin is regarded as a literary window into contemporary technoscience, inviting us to explore its transformative momentum and disruptive impact, focussing on the cultural significance of artificial intelligence and computer science: on the way in which established world-views are challenged by the incessant wave of scientific discoveries made possible by super-computation. While initially focussing on the tension between science and religion, the novel’s attention gradually shifts to the increased dependence of human beings on smart technologies and artificial (or even “synthetic”) intelligence. Origin’s message, I will argue, reverberates with Oswald Spengler’s The Decline of the West, which aims to outline a morphology of world civilisations. Although the novel starts with a series of oppositions, most notably between religion and science, the eventual tendency is towards convergence, synthesis and sublation, exemplified by Sagrada Família as a monumental symptom of this transition. Three instances of convergence will be highlighted, namely the convergence between science and religion, between humanity and technology and between the natural sciences and the humanities.","authors":["Hub Zwart"],"meta":["May 2020","DOI:10.5840/jh20201815","Project: Science and dialectics"],"references":["331451948_Fabricated_Truths_and_the_Pathos_of_Proximity_What_Would_be_a_Nietzschean_Philosophy_of_Contemporary_Technoscience","257347846_Statistical_Physics_of_Self-Replication","279236373_Die_Technik_des_Dramas","257259361_What_is_Life_The_Physical_Aspect_of_a_Living_Cell","246821221_Micro_Cosmos_-_Four_Billion_Years_of_Evolution_from_Our_Microbial_Ancestors","244457716_Die_Krisis_der_Europaischen_Wissenschaften_und_die_Transzendentale_Phanomenologie","50323967_On_the_Origin_of_Species_by_Means_of_Natural_Selection_or_the_Preservation_of_Favoured_Races_in_the_Struggle_for_Life","49111388_What_Technology_Wants_K_Kelly","46984656_Der_Untergang_des_Abendlandes_Umrisse_einer_Morphologie_der_Weltgeschichte","46961753_Vorlesungen_uber_die_Philosophie_der_Geschichte"]}