{"id":"341091863_Modeling_of_measurement-based_quantum_network_coding_on_a_superconducting_quantum_processor","abstract":"Quantum network coding has been proposed to improve resource utilization to support distributed computation but has not yet been put into practice. We investigate a particular implementation of quantum network coding using measurement-based quantum computation on IBM Q processors. We compare the performance of quantum network coding with entanglement swapping and entanglement distribution via linear cluster states. These protocols outperform quantum network coding in terms of the final Bell pair fidelities but are unsuitable for optimal resource utilization in complex networks with contention present. We demonstrate the suitability of noisy intermediate-scale quantum devices such as the IBM Q for the study of quantum networks. We also identify the factors that limit the performance of quantum network coding on these processors and provide estimates of error rates required to boost the final Bell pair fidelities to a point where they can be used for generation of genuinely random cryptographic keys, among other useful tasks. Surprisingly, the required error rates are only around a factor of 2 smaller than the current status, and we expect they will be achieved in the near future.","authors":["Poramet Pathumsoot","Takaaki Matsuo","Takahiko Satoh","Michal Hajdusek"],"meta":["May 2020","DOI:10.1103/PhysRevA.101.052301"],"references":["336748017_Experimental_quantum_network_coding","335424964_Light-matter_entanglement_over_50_km_of_optical_fibre","333985897_Experimental_quantum_repeater_without_quantum_memory","333308064_Near-term_quantum-repeater_experiments_with_nitrogen-vacancy_centers_Overcoming_the_limitations_of_direct_transmission","330683167_Experimental_time-reversed_adaptive_Bell_measurement_towards_all-photonic_quantum_repeaters","328376157_Quantum_internet_A_vision_for_the_road_ahead","323867317_Designing_Quantum_Router_in_IBM_Quantum_Computer","341731947_Extracting_Success_from_IBM's_20-Qubit_Machines_Using_Error-Aware_Compilation","337303076_Quantum_link_bootstrapping_using_a_RuleSet-based_communication_protocol","334043452_Towards_long-distance_quantum_networks_with_superconducting_processors_and_optical_links"]}