{"id":"341047127_Trends_in_Predictive_and_Proactive_Maintenance_of_Motor_Vehicles","abstract":"Changes in maintenance approaches of more complex vehicles and related systems are closely associated with the development of motor vehicles and the ever increasing demand for mobility. Ever since the production of the first motorized vehicles started, engineers have been addressing maintenance issues, which aim to maximize the reliability of vehicles and eliminate unwanted failures. The purpose of this article is to show how proactive maintenance can be performed. Proactive maintenance is based on on-line diagnostic systems in motor vehicles. In this paper, the authors describe the possibilities of obtaining operational data on automatic transmission from on-board diagnostics and its subsequent processing. Furthermore, the article presents a model proposed for determining the amount of wear of individual machine parts in an automatic transmission. Finally, a comparison of the data from the proposed model and the data from the CAN bus is made. The authors show the possibility of access in the field of sustainability towards proactive maintenance and the effort to predict future wear of machine parts in an automatic transmission using modelling. In this case, Matlab & Simulink software was used, which is suitable for these processes. This approach to the sustainability of motor vehicles is in principle identical or very similar to the systems used under various designations in industry, aviation, computer science, etc.","authors":["Jan Furch","Zdeněk Krobot"],"meta":["April 2020Acta Universitatis Agriculturae et Silviculturae Mendelianae Brunensis 68(2):311-322","DOI:10.11118/actaun202068020311"],"references":["323754758_Fatigue_life_prediction_of_mechanical_structures_under_stochastic_loading","297872108_Damage_Prognosis_For_Aerospace_Civil_and_Mechanical_Systems","267619144_A_Particle_Filtering_Framework_for_Failure_Prognosis","252251745_A_prognostic_algorithm_for_machine_performance_assessment_and_its_application","332699850_Effective_Thrust_Bearing_Model_for_Simulations_of_Transient_Rotor_Dynamics","303171133_Intelligent_fault_diagnosis_and_prognosis_for_engineering_systems_Methods_and_case_studies","286816067_Application_of_the_Paris_formula_with_m2_and_the_variable_load_spectrum_to_a_simplified_method_for_evaluation_of_reliability_and_fatigue_life_demonstrated_by_aircraft_components","280742393_Time_Series_Analysis_Forecasting_and_Control","274050378_Hydrodynamic_Lubrication_of_Thrust_Bearings_with_Rectangular_Fixed-Incline-Pads","267260764_RELIABILITY_as_a_STRATEGIC_INITIATIVE_To_Improve_Manufacturing_Capacity_Throughput_and_Profitability"]}