{"id":"341096958_CSNet_A_New_DeepNet_Framework_for_Ischemic_Stroke_Lesion_Segmentation","abstract":"Background and objectives: Acute stroke lesion segmentation is of paramount importance as it can aid medical personnel to render a quicker diagnosis and administer consequent treatment. Automation of this task is technically exacting due to the variegated appearance of lesions and their dynamic development, medical discrepancies, unavailability of datasets, and the requirement of several MRI modalities for imaging. In this paper, we propose a composite deep learning model primarily based on the self-similar fractal networks and the U-Net model for performing acute stroke diagnosis tasks automatically to assist as well as expedite the decision-making process of medical practitioners.\nMethods: We put forth a new deep learning architecture, the Classifier-Segmenter network (CSNet), involving a hybrid training strategy with a self-similar (fractal) U-Net model, explicitly designed to perform the task of segmentation. In fractal networks, the underlying design strategy is based on the repetitive generation of self-similar fractals in place of residual connections. The U-Net model exploits both spatial as well as semantic information along with parameter sharing for a faster and efficient training process. In this new architecture, we exploit the benefits of both by combining them into one hybrid training scheme and developing the concept of a cascaded architecture, which further enhances the model’s accuracy by removing redundant parts from the Segmenter’s input. Lastly, a voting mechanism has been employed to further enhance the overall segmentation accuracy.\nResults: The performance of the proposed architecture has been scrutinized against the existing state-of-the-art deep learning architectures applied to various biomedical image processing tasks by submission on the publicly accessible web platform provided by the MICCAI Ischemic Stroke Lesion Segmentation (ISLES) challenge. The experimental results demonstrate the superiority of the proposed method when compared to similar submitted strategies, both qualitatively and quantitatively in terms of some of the well known evaluation metrics, such as Accuracy, Dice-Coefficient, Recall, and Precision.\nConclusions: We believe that our method may find use as a handy tool for doctors to identify the location and extent of irreversibly damaged brain tissue, which is said to be a critical part of the decision-making process in case of an acute stroke.","authors":["Amish Kumar","Neha Upadhyay","Palash Ghosal","Tamal Chowdhury"],"meta":["May 2020Computer Methods and Programs in Biomedicine 193:105524","DOI:10.1016/j.cmpb.2020.105524"],"references":["329433102_Stroke_Lesion_Outcome_Prediction_Based_on_MRI_Imaging_Combined_With_Clinical_Information","319643168_NiftyNet_a_deep-learning_platform_for_medical_imaging","312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","305628326_ISLES_2015_-_A_public_evaluation_benchmark_for_ischemic_stroke_lesion_segmentation_from_multispectral_MRI","287213627_Classifiers_for_Ischemic_Stroke_Lesion_Segmentation_A_Comparison_Study","258501065_The_Virtual_Skeleton_Database_An_Open_Access_Repository_for_Biomedical_Research_and_Collaboration","257745876_Medical_image_analysis_methods_in_MRCT-imaged_acute-subacute_ischemic_stroke_lesion_Segmentation_prediction_and_insights_into_dynamic_evolution_simulation_models_A_critical_appraisal","324118275_Automatic_Segmentation_of_Acute_Ischemic_Stroke_From_DWI_Using_3-D_Fully_Convolutional_DenseNets","317871020_New_approach_to_detect_and_classify_stroke_in_skull_CT_images_via_Analysis_of_Brain_Tissue_Densities","311609041_Deep_Residual_Learning_for_Image_Recognition","309394682_Multiscale_3d_convolutional_neural_networks_for_lesion_segmentation_in_brain_MRI","309029890_ISLES_Challenge_2015_Automated_Model-Based_Segmentation_of_Ischemic_Stroke_in_MR_Images","309025880_A_Convolutional_Neural_Network_Approach_to_Brain_Tumor_Segmentation","309025804_Automatic_Ischemic_Stroke_Lesion_Segmentation_in_Multi-spectral_MRI_Images_Using_Random_Forests_Classifier","307575271_Segmenting_the_Ischemic_Penumbra_A_Decision_Forest_Approach_with_Automatic_Threshold_Finding","305193694_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation","303277498_A_Voxel-Wise_Cascaded_Classification_Approach_to_Ischemic_Stroke_Lesion_Segmentation","299509834_Segmentation_of_Ischemic_Stroke_Lesions_in_Multi-spectral_MR_Images_Using_Weighting_Suppressed_FCM_and_Three_Phase_Level_Set","299397287_ISLES_SISS_Challenge_2015_Segmentation_of_Stroke_Lesions_Using_Spatial_Normalization_Random_Forest_Classification_and_Contextual_Clustering","216792879_Backpropagation_Applied_to_Handwritten_Zip_Code_Recognition"]}