{"id":"341011181_Perceptual_image_quality_assessment_a_survey","abstract":"Perceptual quality assessment plays a vital role in the visual communication systems owing to the existence of quality degradations introduced in various stages of visual signal acquisition, compression, transmission and display. Quality assessment for visual signals can be performed subjectively and objectively, and objective quality assessment is usually preferred owing to its high efficiency and easy deployment. A large number of subjective and objective visual quality assessment studies have been conducted during recent years. In this survey, we give an up-to-date and comprehensive review of these studies. Specifically, the frequently used subjective image quality assessment databases are first reviewed, as they serve as the validation set for the objective measures. Second, the objective image quality assessment measures are classified and reviewed according to the applications and the methodologies utilized in the quality measures. Third, the performances of the state-of-the-art quality measures for visual signals are compared with an introduction of the evaluation protocols. This survey provides a general overview of classical algorithms and recent progresses in the field of perceptual image quality assessment.","authors":["Guangtao Zhai","Xiongkuo Min"],"meta":["November 2020Sciece China. Information Sciences 63(11)","DOI:10.1007/s11432-019-2757-1"],"references":["337613895_Study_of_3D_Virtual_Reality_Picture_Quality","347450451_Quality_Assessment_of_Free-Viewpoint_Videos_by_Quantifying_the_Elastic_Changes_of_Multi-Scale_Motion_Trajectories","345382743_The_Prediction_of_Saliency_Map_for_Head_and_Eye_Movements_in_360_Degree_Images","338673659_A_Metric_for_Light_Field_Reconstruction_Compression_and_Display_Quality_Evaluation","338661106_A_Multimodal_Saliency_Model_for_Videos_With_High_Audio-Visual_Correspondence","338620222_State-of-the-Art_in_360_VideoImage_Processing_Perception_Assessment_and_Compression","338351280_Sentiment_analysis_using_deep_learning_approaches_an_overview","338194960_Snapshot_boosting_a_fast_ensemble_framework_for_deep_neural_networks","337449777_MC360IQA_A_Multi-channel_CNN_for_Blind_360-degree_Image_Quality_Assessment","337326322_Uncertainty-optimized_deep_learning_model_for_small-scale_person_re-identification"]}