{"id":"341052796_Integracion_de_Pensamiento_Computacional_en_Educacion_Basica_Dos_Experiencias_Pedagogicas_de_Aprendizaje_Colaborativo_online_Integration_of_Computational_Thinking_in_Compulsory_Education_Two_Pedagogic","abstract":"Los países del mundo han incluido en sus agendas educativas la incorporación del Pensamiento Computacional (PC) en la Educación Básica. A pesar de los esfuerzos de las autoridades escolares, los sistemas escolares tienen dificultades en desarrollar esta propuesta en las aulas tradicionales. En este artículo presentamos dos experiencias basadas en el uso de tecnologías y metodologías educativas que han ayudado a superar estas dificultades, logrando llevar el PC al aula de forma eficaz para los estudiantes, profesorado y centros escolares. Las experiencias se han desarrollado en colaboración con instituciones educativas y ministerios de educación de dos países de Latinoamérica. Las tecnologías educativas utilizadas son los entornos virtuales de aprendizaje (EVA), los sistemas de colaboración síncronos, y los entornos de programación online Scratch/Snap. Las metodologías educativas desarrolladas se basan en el trabajo colaborativo profesorado-tutores, profesorado-estudiantes, y estudiantes-estudiantes. Ambas, tecnologías y metodologías educativas, se han utilizado de forma conjunta para desarrollar a través del PC la capacidad de nuestros estudiantes para resolver problemas relacionados con la vida diaria y con el mundo laboral.\nCountries in the world have included in their educational agendas the incorporation of Computational Thinking (CT) in Compulsory Education. Despite the efforts of the school authorities, the school systems have difficulties in developing this proposal in the traditional classrooms. In this article we present two experiences based on the use of educational technologies and methodologies that have helped overcome these difficulties by bringing the PC to the Classroom effectively for students, teachers and schools. Experiences have been developed in collaboration with educational institutions and ministries of education in two Latin American countries. The educational technologies used are virtual learning environments (VLE), synchronous collaboration systems, and Scratch / Snap online programming environments. The educational methodologies developed are based on collaborative work teachers-tutors, teachers-students, and students-students. Both educational technologies and methodologies have been used together to develop, through the PC, the ability of our students to solve problems related to daily life and the working world.","authors":["Xabier Basogain","María Elena Olmedo Parco"],"meta":["April 2020","DOI:10.6018/red.409481"],"references":[]}