{"id":"341084651_Misspecified_Cramer-Rao_Bound_For_Delay_Estimation_with_a_Mismatched_Waveform_A_Case_Study","abstract":"In this paper we investigate the problem of time of arrival estimation which occurs in many real-world applications, such as indoor localization or non-destructive testing via ultrasound or radar. A problem that is often overlooked when analyzing these systems is that in practice, we will typically not have exact information about the waveform / pulse shape. Therefore, there may be a mismatch between the parametric model that is assumed to derive and study the estimators versus the real model we find in practice. Using the framework of mismatched Cramer-Rao Bounds, the deterioration in the achiev-´ able accuracy due to this mismatch can be analyzed in detail. This paper contributes to this research direction with a concrete case study, namely, a mismatch in the width of Gaussian pulses that are used for delay estimation. We derive a compact, explicit, closed-form expression for the deterioration in the MSE due to the pulse mismatch. The results show that the deterioration is symmetric with respect to over- or underestimating the pulse width (by the same factor). These results can provide meaningful insights for system designers. They can be extended to study other parameter mismatches as well, such as the center frequency or a violation of the pulse’s symmetry.","authors":["Florian Roemer"],"meta":["May 2020","DOI:10.1109/ICASSP40776.2020.9054370","Conference: ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)"],"references":["280562537_Robust_Matched_Filtering_in_lp-Space","259921144_Ultrasonic_Nondestructive_Testing_of_Materials_Theoretical_Foundations","333594964_Range_Accuracy_Analysis_for_FMCW_Systems_with_Source_Nonlinearity","323133925_Position_Estimation_under_Model_Misspecification","308087352_Bayesian_framework_and_radar_On_misspecified_bounds_and_radar-communication_cooperation","301402921_The_maximum_of_CRLB_of_time_delay_estimation","292981484_The_Misspecified_Cramer-Rao_Bound_and_Its_Application_to_Scatter_Matrix_Estimation_in_Complex_Elliptically_Symmetric_Distributions","275062996_The_Exponentially_Convergent_Trapezoidal_Rule","274404073_Parameter_Bounds_on_Estimation_Accuracy_Under_Model_Misspecification","236471314_Ultrasonic_Transducers_for_Non_Destructive_Testing"]}