{"id":"341061775_OpenFermion_The_electronic_structure_package_for_quantum_computers","abstract":"Quantum simulation of chemistry and materials is predicted to be an important application for both near-term and fault-tolerant quantum devices. However, at present, developing and studying algorithms for these problems can be difficult due to the prohibitive amount of domain knowledge required in both the area of chemistry and quantum algorithms. To help bridge this gap and open the field to more researchers, we have developed the OpenFermion software package (www.openfermion.org). OpenFermion is an open-source software library written largely in Python under an Apache 2.0 license, aimed at enabling the simulation of fermionic and bosonic models and quantum chemistry problems on quantum hardware. Beginning with an interface to common electronic structure packages, it simplifies the translation between a molecular specification and a quantum circuit for solving or studying the electronic structure problem on a quantum computer, minimizing the amount of domain expertise required to enter the field. The package is designed to be extensible and robust, maintaining high software standards in documentation and testing. This release paper outlines the key motivations behind design choices in OpenFermion and discusses some basic OpenFermion functionality which we believe will aid the community in the development of better quantum algorithms and tools for this exciting area of research.","authors":["Jarrod R. Mcclean","Nicholas C. Rubin","Kevin J. Sung","Ian David Kivlichan"],"meta":["April 2020Quantum Science and Technology 5(3)","DOI:10.1088/2058-9565/ab8ebc","Project: Quantum Computing to solve many-body problems"],"references":["328469422_Encoding_Electronic_Spectra_in_Quantum_Circuits_with_Linear_T_Complexity","325185025_Fermion-to-qubit_mappings_with_varying_resource_requirements_for_quantum_simulation","324078174_Quantum_Chemistry_Calculations_on_a_Trapped-Ion_Quantum_Simulator","323927159_Low-Depth_Quantum_Simulation_of_Materials","322419139_Application_of_fermionic_marginal_constraints_to_hybrid_quantum_algorithms","321347763_Improved_Techniques_for_Preparing_Eigenstates_of_Fermionic_Hamiltonians","321095259_Quantum_Simulation_of_Electronic_Structure_with_Linear_Depth_and_Connectivity","320475602_Exponentially_More_Precise_Quantum_Simulation_of_Fermions_in_the_Configuration_Interaction_Representation","324765354_Bravyi-Kitaev_Superfast_simulation_of_electronic_structure_on_a_quantum_computer","321096025_Quantum_Algorithms_to_Simulate_Many-Body_Physics_of_Correlated_Fermions"]}