{"id":"341044897_Attention_and_Consciousness_in_Intentional_Action_Steps_Toward_Rich_Artificial_Agency","abstract":"If artificial agents are to be created such that they occupy space in our social and cultural milieu, then we should expect them to be targets of folk psychological explanation. That is to say, their behavior ought to be explicable in terms of beliefs, desires, obligations, and especially intentions. Herein, we focus on the concept of intentional action, and especially its relationship to consciousness. After outlining some lessons learned from philosophy and psychology that give insight into the structure of intentional action, we find that attention plays a critical role in agency, and indeed, in the production of intentional action. We argue that the insights offered by the literature on agency and intentional action motivate a particular kind of computational cognitive architecture, and one that hasn’t been well-explicated or computationally fleshed out among the community of AI researchers and computational cognitive scientists who work on cognitive systems. To give a sense of what such a system might look like, we present the ARCADIA attention-driven cognitive system as first steps toward an architecture to support the type of agency that rich human–machine interaction will undoubtedly demand.","authors":["Paul Bello","Will Bridewell"],"meta":["March 2020Journal of Artificial Intelligence and Consciousness 07(01):15-24","DOI:10.1142/S2705078520500022"],"references":["338135798_Selection_enables_enhancement_An_integrated_model_of_object_tracking","322123588_There_Is_No_Agency_Without_Attention","319546662_A_Computational_Model_of_the_Role_of_Attention_in_Subitizing_and_Enumeration","309478636_Incremental_Object_Perception_in_an_Attention-Driven_Cognitive_Architecture","309478468_A_Theory_of_Attention_for_Cognitive_Systems","346470704_Consciousness_and_Moral_Responsibility","345743563_Structuring_Mind_The_Nature_of_Attention_and_how_it_Shapes_Consciousness","316341309_Attending_The_Nature_of_Attention_and_how_it_Shapes_Consciousness","273261765_Experts_and_Deviants_The_Story_of_Agentive_Control","263157038_In_the_Theatre_of_Consciousness_Global_Workspace_Theory_a_Rigorous_Scientific_Theory_of_Consciousness"]}