{"id":"341187800_Information_gain_modulates_brain_activity_evoked_by_reading","abstract":"The human brain processes language to optimise efficient communication. Studies have shown extensive evidence that the brain’s response to language is affected both by lower-level features, such as word-length and frequency, and syntactic and semantic violations within sentences. However, our understanding on cognitive processes at discourse level remains limited: How does the relationship between words and the wider topic one is reading about affect language processing? We propose an information theoretic model to explain cognitive resourcing. In a study in which participants read sentences from Wikipedia entries, we show information gain, an information theoretic measure that quantifies the specificity of a word given its topic context, modulates word-synchronised brain activity in the EEG. Words with high information gain amplified a slow positive shift in the event related potential. To show that the effect persists for individual and unseen brain responses, we furthermore show that a classifier trained on EEG data can successfully predict information gain from previously unseen EEG. The findings suggest that biological information processing seeks to maximise performance subject to constraints on information capacity.","authors":["Lauri Kangassalo","Michiel M Spapé","Niklas Ravaja","Tuukka Ruotsalo"],"meta":["May 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-63828-5"],"references":["334579358_Why_do_Users_Issue_Good_Queries_Neural_Correlates_of_Term_Specificity","319530091_Lawful_relation_between_perceptual_bias_and_discriminability","305287813_Natural_brain-information_interfaces_Recommending_information_by_relevance_inferred_from_human_brain_signals","325079917_Efficient_coding_explains_the_universal_law_of_generalization_in_human_perception","319497272_Probabilistic_Language_Models_in_Cognitive_Neuroscience_Promises_and_Pitfalls","318870586_A_Language_Modeling_Approach_to_Information_Retrieval","313755814_Some_informational_aspects_of_visual_perception","313168450_On_line_comprehension_processes_and_eye_movements_in_reading","305276788_Naturalistic_Sentence_Comprehension_in_the_Brain_Naturalistic_Comprehension","303510631_The_length_of_words_reflects_their_conceptual_complexity"]}