{"id":"341169978_Exploring_and_comparing_computational_thinking_skills_in_students_who_take_GCSE_Computer_Science_and_those_who_do_not","abstract":"This study compares computational thinking skills evidenced by two groups of students in two different secondary schools: one group per school was studying a qualification in Computer Science. The aim was to establish which elements of computational thinking were more prevalent in students studying Computer Science to a higher level. This in turn would evidence those elements likely to be present from their earlier computing education or through their complementary studies in Science or Mathematics, which all students also studied. Understanding this difference was important to identify any increased competence in computational thinking that was present in the Computer Science groups. Artefact-based interviews were carried out using questions and practical computing problems designed to elicit and demonstrate the students’ computational thinking skills based on the Brennan and Resnick (2016) model of computational concepts, practices and perspectives. Analysis of students’ responses showed surprisingly little difference between the computational thinking practices of the two groups in relation to abstraction, decomposition, evaluation, generalisation/reusing, logical reasoning and debugging/testing. The study concludes that general computational thinking skills can be developed either at a lower level of study or in cognate curriculum areas, leaving computer science as the rightful locus of computational thinking for automation.","authors":["Lauren Gillott","Andrew Joyce-Gibbons","Elizabeth Hidson"],"meta":["May 2020International Journal of Computer Science Education in Schools 3(4)","DOI:10.21585/ijcses.v3i4.77"],"references":["332724947_An_Overview_of_Computational_Thinking","325828087_The_Roehampton_Annual_Computing_Education_report_Data_from_2017","325541269_Challenges_to_Pedagogical_Content_Knowledge_in_lesson_planning_during_curriculum_transition_a_multiple_case_study_of_teachers_of_ICT_and_Computing_in_England","322987854_Computational_Thinking_in_Secondary_Education_Where_does_it_fit_A_systematic_literary_review","322134512_Assessment_of_Computational_Thinking_Notions_in_Secondary_School","320223604_Visual_and_textual_programming_languages_a_systematic_review_of_the_literature","328498491_Assessing_computational_thinking_process_using_a_multiple_evaluation_approach","317158625_Remaining_trouble_spots_with_computational_thinking","312253565_A_validity_and_reliability_study_of_the_Computational_Thinking_Scales_CTS","310792069_The_long_quest_for_computational_thinking"]}