{"id":"341106601_La_formacion_en_investigacion_y_su_incidencia_en_la_produccion_cientifica_del_profesorado_de_educacion_de_una_universidad_publica_de_Ecuador","abstract":"La teoría de la gestión del capital humano sustenta la necesidad de invertir en la formación de las personas, para incrementar la productividad. Los recientes incrementos en las publicaciones de productos científicos han suscitado interés en las universidades ecuatorianas, induciendo a la búsqueda de los factores contribuyentes. Considerando tales presupuestos, el presente estudio demuestra que los incrementos en la formación doctoral (en investigación) del profesorado universitario incide directa y significativamente en la productividad científica. En tal demostración, se ha seguido un enfoque cuantitativo, de naturaleza relacional entre la formación en investigación y la producción científica. Para el estudio se seleccionó una muestra de 85 docentes de la Facultad de Filosofía, Letras y Ciencias de la Educación de la Universidad de Guayaquil (Ecuador), que cuentan con estudios doctorales concluidos o en curso y la publicación de productos científicos. El recojo de la información se hizo a partir de los Curriculum Vitae declarados por el profesorado, organizándolos como indicadores de estudio. Los resultados describen la evolución incipiente de la formación doctoral (en investigación) y la creciente producción científica (más de impacto regional que internacional); resaltando las correlaciones positivas entre los indicadores. Ha quedado comprobada la incidencia de la formación doctoral (en investigación) en la producción científica, en términos de que la progresión de estudios doctorales (titulados) afecta positivamente a incrementos en la producción científica.","authors":["Osbaldo Turpo Gebera"],"meta":["May 2020PUBLICACIONES 50(2):167-185","DOI:10.30827/publicaciones.v50i2.13952"],"references":["325698134_Analisis_de_la_produccion_y_de_la_visibilidad_cientifica_de_Ecuador_en_el_contexto_andino_2000-2013","320143669_La_formacion_en_el_desarrollo_del_docente_investigador_una_revision_sistematica","318240694_La_formacion_de_Posgrado_en_Educacion_en_el_Ecuador","317417504_El_futuro_del_trabajo_Reflexiones_sobre_cambios_emergentes_en_el_entorno_laboral_y_su_impacto_sobre_la_formacion_y_el_conocimiento_en_las_sociedades_avanzadas_Enric_Bas_Mario_Guillo","312144990_La_formacion_y_el_ejercicio_de_la_docencia_universitaria_en_Ecuador_Desafios","303313448_Epistemologia_de_la_Investigacion_Cuantitativa_y_Cualitativa_Paradigmas_y_Objetivos","301778399_Influencia_de_la_formacion_para_la_investigacion_en_la_actividad_investigadora_y_produccion_cientifica_en_Universidades_de_El_Salvador","284455809_Uma_analise_sobre_a_producao_academica_dos_docentes_das_universidades_estaduais_paranaenses_de_2008_a_2012","299428131_Doing_quantitative_research_in_education_with_SPSS_2nd_edition","279706250_Investment_in_man_An_economist_view"]}