{"id":"341146739_Modern_view_of_biliary_atresia_in_children","abstract":"Atresia of the biliary tract, or biliary atresia (BA), is a destructive, inflammatory disease in which progressive biliary tree fibrosis in an infant leads to obstruction of the bile ducts and, as a result, to cirrhosis of the liver. If untreated, progressive cirrhosis leads to death by 2 years. Biliary atresia can be divided into 3 types, each of which depends on the level closest to biliary obstruction. Type I (obstruction of the common bile duct), type II (patency of the bile ducts to the level of the common hepatic duct), type III (obstruction at the level of the gates of the liver). It is very important to distinguish between types of BA and conduct differential diagnosis with other cholestatic diseases. There are nonsyndromic, syndromic, and BA, combined with other malformations. In diagnostics, in addition to clinical manifestations and specific changes in blood biochemical parameters characterizing cholestasis, an ultrasound examination of the abdominal cavity organs, gepatobiliscintigraphy, magnetic resonance cholecystopancreatocholangiography, according to indications, a puncture biopsy of the liver and histological examination are performed. The main method of treatment is hepatoportoenterostomy according to Kasai, which must be performed no later than 3 months, and with liver cirrhosis and hepatic insufficiency, liver transplantation. Additional methods of treatment include the use of ursodeoxycholic acid, fat-soluble vitamins.","authors":["G. V. Volynets","Anatoly Khavkin","Artem Nikitin"],"meta":["May 2020Ėksperimental'nai͡a i klinicheskai͡a gastroėnterologii͡a = Experimental & clinical gastroenterology","DOI:10.31146/1682-8658-ecg-173-1-40-55"],"references":["331265949_Revisiting_long-term_prognostic_factors_of_biliary_atresia_A_20-year_experience_with_81_patients_from_a_single_center","321195415_Chronic_liver_disease_is_universal_in_children_with_biliary_atresia_living_with_native_liver","320356307_Generation_of_safe_and_therapeutically_effective_human_induced_pluripotent_stem_cell-derived_hepatocyte-like_cells_for_regenerative_medicine_Takayama_Akita_et_al","320236179_Late_complications_of_biliary_atresia_hepatopulmonary_syndrome_and_portopulmonary_hypertension","319989885_Adjuvant_therapy_in_biliary_atresia_hopelessly_optimistic_or_potential_for_change","318529320_FEATURES_OF_DIAGNOSIS_OF_BILIARY_ATRESIA_IN_CHILDREN","318258092_A_single-cell_transcriptomic_analysis_reveals_precise_pathways_and_regulatory_mechanisms_underlying_hepatoblast_differentiation","317378562_The_Hippo_signaling_functions_through_the_Notch_signaling_to_regulate_intrahepatic_bile_duct_development_in_mammals","317325942_Incidence_of_Biliary_Atresia_and_Timing_of_Hepatoportoenterostomy_in_the_United_States","317111924_Recent_advances_in_the_management_of_pruritus_in_chronic_liver_diseases"]}