{"id":"341133378_Rubbing_against_data_infrastructures_methodological_explorations_on_working_within_the_impossibility_of_exteriority","abstract":"The article focuses on infrastructures as heterogeneous assemblages. Our claim is that to examine something as elusive as data infrastructure calls for an epistemological and methodological approach consistent with the fluid ontology of the object of study. Moreover, we assert that there is no position of exteriority from which to critique data infrastructures. Our question is thus primarily methodological: How might we analyse the relational and heterogeneous nature of data infrastructures in a way that both problematizes and builds on the impossibility of exteriority? We examine two dispositions of data infrastructures: first comes their provisional, dispersed and entangled character, and second, the affective attachments imbued therein. Overall, this paper, first, returns to the ontological and theoretical perspectives on what data infrastructures are; second, makes a contribution to the methodological question of how to study them; and, third, develops a means of critique that do not locate the analyst outside the object of the critique, reminding us of the immanent relationality of data infrastructures and of the necessity to take these seriously in the methodological approach. The paper works with the existing literature on data infrastructures and research methods in education policy analysis, and with our own research data and first-hand experiences.","authors":["Nelli Piattoeva","Antti Saari"],"meta":["May 2020Journal of Education Policy","DOI:10.1080/02680939.2020.1753814"],"references":["339400350_Escaping_numbers_The_ambiguities_of_the_governance_of_education_through_data","330479968_Escaping_numbers_Intimate_accounting_informed_publics_and_the_uncertain_assemblages_of_authority_and_non-authority","329601278_Objectivity_as_standardization_in_data-scientific_education_policy_technology_and_governance","329173528_Emerging_data_infrastructures_and_the_new_topologies_of_education_policy","346345559_Complexities_Social_Studies_of_Knowledge_Practices","345574713_Infrastructures_in_and_out_of_Time_The_Promise_of_Roads_in_Contemporary_Peru","345541919_Thinking_educational_policy_and_management_through_frictional_concepts_of_affects","336358772_What_is_an_inaugural_professorial_lecture_Exploring_academic_practices_through_diffractive_listing","328541576_Governing_through_anxiety","328473013_The_Governmental_Topologies_of_Database_Devices"]}