{"id":"341198409_Number_of_congenital_syphilis_cases_in_Brazil_between_2009_and_2013","abstract":"Syphilis is a disease caused by the bacterium Treponema pallidum. Congenital syphilis is a contagious disease transmitted from the mother to the fetus. The objective of this work is to show the number of cases of congenital syphilis in Brazil between the years 2009 to 2013. The research was carried out in the DATASUS database[6]. The number of cases of congenital syphilis increased between 2009 and 2013 and the southeastern region had the highest national average in this period. females had a higher number of cases than males and most cases were diagnosed in the age group of up to six days of life. An average of three times as many women received prenatal care as those who did not. Women with a maternal school grade from the 5th to the 8th incomplete grade of elementary school had a higher number of syphilis cases. A greater number of treatments of the mother is perceived in the year 2012. In Brazil, despite the high performance of prenatal care, most cases of congenital syphilis were diagnosed only after delivery, showing errors in the diagnosis of the disease during the performance examination and resulting in late treatments. Education and income are factors that seem to influence the diagnosis and treatment of the disease. It seems necessary to increase the number of treatment partners, thus reducing the transmission of syphilis and consequently that of congenital syphilis. The treatment performed in most cases seems to guarantee the cure of the disease.","authors":["Karina Dias Rocha","Amanda Alves Fecury","Euzébio de Oliveira","Carla Viana Dendasck"],"meta":["May 2020","DOI:10.32749/nucleodoconhecimento.com.br/health/congenital-syphilis-cases"],"references":["342165923_Diferencas_regionais_na_transicao_da_mortalidade_por_doencas_cardiovasculares_no_Brasil_1980_a_2012","335331121_Analise_semiotica_campanha_publicitaria_do_Ministerio_da_Saude_no_combate_a_dengue","314290308_Assistencia_ao_pre-natal_parto_e_pos-parto_no_municipio_de_Campina_Grande_Paraiba","291392911_Sifilis_Congenita_uma_revisao_da_literatura","265786598_Sifilis_uma_realidade_prevenivel_Sua_erradicacao_um_desafio_atual","316653232_PERFIL_DOS_CASOS_NOTIFICADOS_DE_SIFILIS_CONGENITA"]}