{"id":"341154150_Toward_neuroprosthetic_real-time_communication_from_in_silico_to_biological_neuronal_network_via_patterned_optogenetic_stimulation","abstract":"Restoration of the communication between brain circuitry is a crucial step in the recovery of brain damage induced by traumatic injuries or neurological insults. In this work we present a study of real-time unidirectional communication between a spiking neuronal network (SNN) implemented on digital platform and an in-vitro biological neuronal network (BNN), generating similar spontaneous patterns of activity both spatial and temporal. The communication between the networks was established using patterned optogenetic stimulation via a modified digital light projector (DLP) receiving real-time input dictated by the spiking neurons’ state. Each stimulation consisted of a binary image composed of 8 × 8 squares, representing the state of 64 excitatory neurons. The spontaneous and evoked activity of the biological neuronal network was recorded using a multi-electrode array in conjunction with calcium imaging. The image was projected in a sub-portion of the cultured network covered by a subset of the all electrodes. The unidirectional information transmission (SNN to BNN) is estimated using the similarity matrix of the input stimuli and output firing. Information transmission was studied in relation to the distribution of stimulus frequency and stimulus intensity, both regulated by the spontaneous dynamics of the SNN, and to the entrainment of the biological networks. We demonstrate that high information transfer from SNN to BNN is possible and identify a set of conditions under which such transfer can occur, namely when the spiking network synchronizations drive the biological synchronizations (entrainment) and in a linear regime response to the stimuli. This research provides further evidence of possible application of miniaturized SNN in future neuro-prosthetic devices for local replacement of injured micro-circuitries capable to communicate within larger brain networks.","authors":["Yossi Mosbacher","Farad Khoyratee","Miri Goldin","Sivan Kanner"],"meta":["May 2020Scientific Reports 10(1):7512","DOI:10.1038/s41598-020-63934-4"],"references":["334856499_A_Neuromorphic_Prosthesis_to_Restore_Communication_in_Neuronal_Networks","332938486_A_Biohybrid_Setup_for_Coupling_Biological_and_Neuromorphic_Neural_Networks","332731935_Near_physiological_spectral_selectivity_of_cochlear_optogenetics","332621095_Optimized_Real-Time_Biomimetic_Neural_Network_on_FPGA_for_Bio-hybridization","329410706_Challenges_hindering_memristive_neuromorphic_hardware_from_going_mainstream","326383538_Hodgkin-Huxley_Neuron_and_FPAA_Dynamics","325318611_Performance_Comparison_of_the_Digital_Neuromorphic_Hardware_SpiNNaker_and_the_Neural_Network_Simulation_Software_NEST_for_a_Full-Scale_Cortical_Microcircuit_Model","332747809_Spontaneous_Behaviors_Drive_Multidimensional_Brain-wide_Activity","326429522_Astrocytes_restore_connectivity_and_synchronization_in_dysfunctional_cerebellar_networks","323789063_Nav11-Overexpressing_Interneuron_Transplants_Restore_Brain_Rhythms_and_Cognition_in_a_Mouse_Model_of_Alzheimer's_Disease"]}