{"id":"341144545_A_Maturity_Model_for_Secure_Requirements_Engineering","abstract":"Security is considered to be a critical software quality attribute. Tackling security at the requirements phase helps to avoid the need to rework secure software development issues. The aim of this paper is to develop a Requirements Engineering (RE) Security Maturity Model (RESMM) to assist software development organizations to better specify the requirements for secure software development. To achieve this objective, first, we conducted a systematic literature review (SLR) to identify the requirement practices for secure software development. Then we modified Sommerville's requirements engineering practices. We also conducted a questionnaire survey based on the identified security requirements practices. Next, the RESMM was built based on the results of the SLR, the modified Sommerville practices and feedback from the security practitioners. Finally, two case studies were conducted to assess RESMM. RESMM has 79 practices classified into 7 RE categories. The case study results show that RESMM has a clear structure and is easy to comprehend and use. In addition, the case study participants recommended that software organizations adopt RESMM. RESMM has the ability to identify the RE security maturity levels in software organizations. RESMM can also help software development organizations deliver secure software.","authors":["Mahmood Niazi","Ashraf Mohammed Saeed","Mohammad Alshayeb","Sajjad Mahmood"],"meta":["May 2020Computers & Security 95:101852","DOI:10.1016/j.cose.2020.101852"],"references":["325353028_A_Readiness_Model_for_Security_Requirements_Engineering","313838260_Maturity_Models_for_Information_Systems_-_A_State_of_the_Art","330257472_A_measurement_framework_for_software_product_maturity_assessment","315913829_Cyber_Security_Requirements_Engineering","313513281_Managing_software_security_risks","308960782_Exploring_Software_Security_Approaches_in_Software_Development_Lifecycle_A_Systematic_Mapping_Study","308499177_DIGS_A_Framework_for_Discovering_Goals_for_Security_Requirements_Engineering","306114359_Analyzing_and_evaluating_security_features_in_software_requirements","303515580_A_Risk_Assessment_Framework_for_Automotive_Embedded_Systems","303465254_A_survey_of_security_issues_for_cloud_computing"]}