{"id":"341109918_Small-Object_Detection_in_Remote_Sensing_Images_with_End-to-End_Edge-Enhanced_GAN_and_Object_Detector_Network","abstract":"The detection performance of small objects in remote sensing images has not been satisfactory compared to large objects, especially in low-resolution and noisy images. A generative adversarial network (GAN)-based model called enhanced super-resolution GAN (ESRGAN) showed remarkable image enhancement performance, but reconstructed images usually miss high-frequency edge information. Therefore, object detection performance showed degradation for small objects on recovered noisy and low-resolution remote sensing images. Inspired by the success of edge enhanced GAN (EEGAN) and ESRGAN, we applied a new edge-enhanced super-resolution GAN (EESRGAN) to improve the quality of remote sensing images and used different detector networks in an end-to-end manner where detector loss was backpropagated into the EESRGAN to improve the detection performance. We proposed an architecture with three components: ESRGAN, EEN, and Detection network. We used residual-in-residual dense blocks (RRDB) for both the ESRGAN and EEN, and for the detector network, we used a faster region-based convolutional network (FRCNN) (two-stage detector) and a single-shot multibox detector (SSD) (one stage detector). Extensive experiments on a public (car overhead with context) dataset and another self-assembled (oil and gas storage tank) satellite dataset showed superior performance of our method compared to the standalone state-of-the-art object detectors.","authors":["Jakaria Rabbi","Nilanjan Ray","Matthias Schubert","Subir Chowdhury"],"meta":["May 2020Remote Sensing 12(9):1432","DOI:10.3390/rs12091432","Project: Deep Learning in Remote Sensing"],"references":["337017443_Automated_Detection_of_Conifer_Seedlings_in_Drone_Imagery_Using_Convolutional_Neural_Networks","335072566_Vehicle_Detection_in_Remote_Sensing_Images_Leveraging_on_Simultaneous_Super-Resolution","334773154_ScratchDet_Training_Single-Shot_Object_Detectors_From_Scratch","345478601_mathcalR2_-CNN_Fast_Tiny_Object_Detection_in_Large-Scale_Remote_Sensing_Images","340552563_The_Effects_of_Super-Resolution_on_Object_Detection_Performance_in_Satellite_Imagery","338320726_Object_detection_in_optical_remote_sensing_images_A_survey_and_a_new_benchmark","332089421_Edge-Enhanced_GAN_for_Remote_Sensing_Image_Superresolution","331334917_R-Net_A_Deep_Network_for_Multioriented_Vehicle_Detection_in_Aerial_Images_and_Videos","330708842_Object_Detection_With_Deep_Learning_A_Review","330590708_ESRGAN_Enhanced_Super-Resolution_Generative_Adversarial_Networks_Munich_Germany_September_8-14_2018_Proceedings_Part_V"]}