{"id":"341174556_Artificial_Intelligence_In_Software_Engineering","abstract":"In the last few years, there has been a growing surge for the interest in the application of artificial intelligence in issues in Software Engineering (SE). Artificial Intelligence has become a much powerful and easy to use as they are increasingly deployed for different key components in the software system. It enables the new functionalities and even allows much better adaptation to different user needs. This also creates additional issues for different software engineers and even exposes different firms to risks. There is a huge number of daunting challenges related to design, building and testing for an engineering system. Software engineers have one advantage over the engineers is that their own material and software can be used for attacking the challenges resulted due to the production of this system. AI algorithm is very much suited for this kind of complex issues in software engineering as they are designed to deal with some of the growing challenges. Software engineers have implemented, exploited most of the practical algorithms, techniques and methods. It has emerged from the community of artificial intelligence. All these activities have a vital and effective application which create an impact on different areas of software engineering.","authors":["Narendra Rao Tadapaneni"],"meta":["January 2017SSRN Electronic Journal","DOI:10.2139/ssrn.3591807"],"references":["299404720_Ontologies_for_Software_Engineering_Past_Present_and_Future","295548117_An_artificial_intelligence_tool_for_heterogeneous_team_formation_in_the_classroom","291417563_The_Role_of_Ethnographic_Studies_in_Empirical_Software_Engineering","274247843_Use_of_Artificial_Intelligence_in_Software_Development_Life_Cycle_A_state_of_the_Art_Review","3114682_Applications_in_Artificial_Intelligence","318123600_Leveraging_Automated_Sentiment_Analysis_in_Software_Engineering","308148969_Heat_exchanger_control_based_on_artificial_intelligence_approach","301372587_Cognitive_robotics_and_mathematical_engineering","292525996_Research_Priorities_for_Robust_and_Beneficial_Artificial_Intelligence","281172873_Artificial_Intelligence_in_Medicine","271602772_Forty_years_of_research_on_personality_in_software_engineering_A_mapping_study"]}