{"id":"341236107_A_failure_mode_and_effects_analysis_of_pragmatic_errors_in_learner_e-mails","abstract":"E-mailing in the English is an important mode of communication for Japanese learners of computer science both during and after their studies. A key element of effective e-mail communication relates to pragmatic competence—understanding the relationship between social context and language choices and accordingly adapting one’s language in an appropriate manner. Despite this importance, there have been few learner e-mail corpora annotated for pragmatic errors. As part of a larger ongoing study developing online tools for assessing and developing learners’ e-mail writing ability, a failure mode and effects analysis was conducted on a learner corpus of e-mails, manually tagged for pragmatic errors. Tagged errors were ascribed a value between 1-5 in terms of severity, detectability and frequency, with most sever errors assigned a score of 5. Weighted priority scores were calculated, allowing for errors to be prioritized in terms of importance. Preliminary results indicate severe errors are associated with failing to address the face needs of the e-mail recipient, violating pragmatic norms, with potential negative consequences in terms of relationship maintenance. Results allow for the creation of a job queue for the software developer, and usefully inform teaching priorities in the language classroom.","authors":["Allan Nicholas","Blake John"],"meta":["January 2020SHS Web of Conferences 77(13):02001","DOI:10.1051/shsconf/20207702001"],"references":["328455151_English_Curriculum_Innovation_for_Computer_Science_Majors_in_the_Japanese_EFL_Context_From_Needs_to_Tasks","254400023_Learner_corpora_design_development_and_applications","253229205_Generic_speech_act_annotation_for_task-oriented_dialogues","334794320_Email_openings_and_closings_pragmalinguistic_and_gender_variation_in_learner-instructor_cyber_consultations","325489992_Politeness_Some_Universals_in_Language_Usage","322288515_Lecturer_perceptions_of_impoliteness_and_inappropriateness_in_student_e-mail_requests_A_Norwegian_perspective","314733398_Failure_Mode_and_Effect_Analysis_FMEA_from_Theory_to_Execution","286152750_Pragmatics_for_Language_Educators_A_Sociolinguistic_Perspective","259703467_Pragmatics_An_Introduction","241094997_Please_answer_me_as_soon_as_possible_Pragmatic_failure_in_non-native_speakers'_e-mail_requests_to_faculty"]}