{"id":"341259139_Multistep-ahead_daily_inflow_forecasting_using_the_ERA-Interim_reanalysis_data_set_based_on_gradient-boosting_regression_trees","abstract":"Inflow forecasting plays an essential role in reservoir management and operation. The impacts of climate change and human activities have made accurate inflow prediction increasingly difficult, especially for longer lead times. In this study, a new hybrid inflow forecast framework – using the ERA-Interim reanalysis data set as input and adopting gradient-boosting regression trees (GBRT) and the maximal information coefficient (MIC) – is developed for multistep-ahead daily inflow forecasting. Firstly, the ERA-Interim reanalysis data set provides more information for the framework, allowing it to discover inflow for longer lead times. Secondly, MIC can identify an effective feature subset from massive features that significantly affects inflow; therefore, the framework can reduce computational burden, distinguish key attributes from unimportant ones and provide a concise understanding of inflow. Lastly, GBRT is a prediction model in the form of an ensemble of decision trees, and it has a strong ability to more fully capture nonlinear relationships between input and output at longer lead times. The Xiaowan hydropower station, located in Yunnan Province, China, was selected as the study area. Six evaluation criteria, namely the mean absolute error (MAE), the root-mean-squared error (RMSE), the Pearson correlation coefficient (CORR), Kling–Gupta efficiency (KGE) scores, the percent bias in the flow duration curve high-segment volume (BHV) and the index of agreement (IA) are used to evaluate the established models utilizing historical daily inflow data (1 January 2017–31 December 2018). The performance of the presented framework is compared to that of artificial neural network (ANN), support vector regression (SVR) and multiple linear regression (MLR) models. The results indicate that reanalysis data enhance the accuracy of inflow forecasting for all of the lead times studied (1–10 d), and the method developed generally performs better than other models, especially for extreme values and longer lead times (4–10 d).","authors":["Shengli Liao","Zhanwei Liu","Benxi Liu","Chuntian Cheng"],"meta":["May 2020Hydrology and Earth System Sciences 24(5):2343-2363","DOI:10.5194/hess-24-2343-2020"],"references":["336812357_Technical_note_Inherent_benchmark_or_not_Comparing_Nash-Sutcliffe_and_Kling-Gupta_efficiency_scores","336980581_A_Comprehensive_Comparison_of_Four_Input_Variable_Selection_Methods_for_Artificial_Neural_Network_Flow_Forecasting_Models","331855647_Multi-step-ahead_traffic_speed_forecasting_using_multi-output_gradient_boosting_regression_tree","331648498_Downscaling_SMAP_soil_moisture_estimation_with_gradient_boosting_decision_tree_regression_over_the_Tibetan_Plateau","331547443_Downscaling_SMAP_soil_moisture_estimation_with_gradient_boosting_decision_tree_regression_over_the_Tibetan_Plateau","331007900_Pareto-optimal_MPSA-MGGP_A_new_gene-annealing_model_for_monthly_rainfall_forecasting","330517398_Global_solar_radiation_prediction_by_ANN_integrated_with_European_Centre_for_medium_range_weather_forecast_fields_in_solar_rich_cities_of_Queensland_Australia","330189253_A_review_of_the_artificial_intelligence_methods_in_groundwater_level_modeling","329778394_An_enhanced_extreme_learning_machine_model_for_river_flow_forecasting_State-of-the-art_practical_applications_in_water_resource_engineering_area_and_future_research_direction","329036236_Dynamic_Runoff_Simulation_in_a_Changing_Environment_A_Data_Stream_Approach"]}