{"id":"341219135_ArtigoManoelSantosSouza","abstract":"O Uso da Blockchain e de Identificadores Estrategicamente Elaborados para Processos Bancários no Brasil. Há dois grandes aspectos importantes a se considerar a respeito da adoção de uma blockchain em processos bancários. Na verdade, não de uma blockchain em si, mas das ideias disruptivas subjacentes ao uso dessa tecnologia. Um dos aspectos diz respeito ao subaproveitamento de recursos quando da criação de códigos para identificar entes diversos. No presente artigo, cita-se o código usado para designar agências bancárias como ponto de partida. Tal subaproveitamento advém na constatação de que a intenção de codificar sucessivamente uma cadeia de caracteres quando da criação de um identificador (ou outra cadeia de caracteres) agregando a ele mais informações do que o óbvio sobre si e robustez, não é nova na história da Ciência da Computação. E o leitor atento e observador perceberá a vantagem para tal ao longo deste artigo. Em décadas passadas, memória e processamento eram recursos muito mais escassos. Não se podia criar e gravar em disco identificadores mais complexos e muito menos implementar plataformas de blockchain tais como as contemporâneas, por exemplo, porque os recursos computacionais, memória e processamento, não suportariam a carga de trabalho. Mas hoje temos recursos que suportam. O outro aspecto corresponde a ocorrências comportamentais no Brasil: à falha em nossa sociedade em se observar as decisões de uso de determinados formatos de identificação de clientes (e vários outros dados), porque essa constatação não está restrita ao serviço bancário: é geral. Identificadores simplórios demais vêm sendo escolhidos há décadas para uma entidade devido à miopia de se enxergar nessa decisão utilidades do identificador além do óbvio. Os parágrafos a seguir esmiúçam cada um dos pontos citados na introdução.","authors":["Manoel Souza"],"meta":["May 2020","Project: Blockchain e identificadores em processos bancários"],"references":[]}