{"id":"341290909_Capacites_d'inhibition_et_reactivite_face_a_des_stimuli_alimentaires_chez_des_adultes_de_statuts_ponderaux_differents_impact_d'un_amorcage_olfactif_implicite","abstract":"Introduction et but de l’étude\nL’obésité a une origine multifactorielle impliquant des facteurs cognitifs, pouvant créer une vulnérabilité aux stimuli alimentaires chez les individus de statut pondéral plus élevé. Nos travaux antérieurs ont démontré que des odeurs alimentaires non-attentivement perçues pouvaient impacter l’orientation automatique de l’attention envers les aliments de manière différenciée chez des adultes normo-pondéraux (N), en surpoids (S) et en obésité (O). Par ailleurs, au niveau cognitif, un déficit de contrôle inhibiteur (i.e. une difficulté à résister aux interférences) face aux aliments pourrait favoriser un comportement alimentaire délétère pour la santé propre aux individus de statut pondéral plus élevé. L’objectif de notre étude est de mettre en évidence des différences de réactivité et de contrôle inhibiteur face à des images d’aliments en fonction du statut pondéral, et d’observer comment ces processus peuvent être modulés par des odeurs alimentaires non-attentivement perçues.\n\nMatériel et méthodes\nQuatre-vingt-douze adultes, hommes et femmes (31 N, 33 S et 28 O) ont été inclus dans notre étude. Les participants ont réalisé une tâche informatique adaptée à l’alimentation et basée sur des mesures indirectes utilisées en psychologie cognitive (Food Inhibition Task–FIT) permettant de mesurer leurs temps de réaction et leurs capacités à inhiber une réponse automatique face à des images d’aliments et des images d’objets. Nous avons utilisé un paradigme d’amorçage olfactif implicite afin d’exposer les participants de manière non-attentive et répétée à trois conditions olfactives : odeur de quatre quarts (aliment à haute densité énergétique), odeur de poire (aliment à faible densité énergétique) et sans odeur (condition contrôle).\n\nRésultats et analyse statistique\nSans amorçage, les résultats montrent une plus grande réactivité face aux images d’aliments que face aux images d’objets, pour tous les participants (p < 0,001). Par ailleurs, tous les participants montrent un déficit d’inhibition plus important face aux images d’aliments à haute densité énergétique que face aux images d’aliments à faible densité énergétique et aux objets (p < 0,001). Un effet amorce-spécifique au statut pondéral a été mis en évidence (p = 0,01) : les individus en surpoids sont moins réactifs lorsqu’amorcés avec une odeur de poire, et les individus en obésité sont plus réactifs lorsqu’amorcés avec une odeur de quatre-quarts.\n\nConclusion\nContrairement aux processus automatiques, comme l’orientation de l’attention vers les aliments, il semblerait que l’inhibition cognitive face aux aliments, processus plus contrôlé, ne soit pas impactée par l’amorçage olfactif de manière différenciée pour les individus de statut pondéral plus élevé. Notre étude met ainsi en évidence des processus communs de traitement de l’information alimentaire, indifféremment du statut pondéral. Des études complémentaires sont nécessaires afin de mieux comprendre quels stimuli sont à même d’influencer les processus automatiques et contrôlés inhérents au traitement de l’information et liés aux choix alimentaires. Ces éléments amélioreront la compréhension des capacités de l’environnement obésogène à moduler les choix alimentaires de manière différenciée selon le statut pondéral.","authors":["Marine Mas","Stephanie Chambaron","Claire Chabanet","M.-C. Brindisi"],"meta":["April 2020Nutrition Clinique et Metabolisme 34(1):35-36","DOI:10.1016/j.nupar.2020.02.234","Project: IMPLICEAT : Importance of IMPLICit factors in EATing behaviour"],"references":[]}