{"id":"341200659_Translating_between_models_of_concurrency","abstract":"Hoare’s Communicating Sequential Processes (CSP) (Hoare in Communicating Sequential Processes, Prentice-Hall Inc, Upper Saddle River, 1985) admits a rich universe of semantic models closely related to the van Glabbeek spectrum. In this paper we study finite observational models, of which at least six have been studied for CSP, namely traces, stable failures, revivals, acceptances, refusal testing and finite linear observations (Roscoe in Understanding concurrent systems. Texts in computer science, Springer, Berlin, 2010). (Others are known.) We show how to use the relatively recently-introduced priority operator (Roscoe in Understanding concurrent systems. Texts in Computer Science, Springer, Berlin, 2010) to transform refinement questions in these models into trace refinement (language inclusion) tests. Furthermore, we are able to generalise this to any (rational) finite observational model. As well as being of theoretical interest, this is of practical significance since the state-of-the-art refinement checking tool FDR4 (Gibson-Robinson et al. in Int J Softw Tools Technol Transf 18(2):149–167, 2016) currently only supports two such models. In particular we study how it is possible to check refinement in a discrete version of the Timed Failures model that supports Timed CSP.","authors":["David Mestel","A. W. Roscoe"],"meta":["October 2020Acta Informatica 57(2)","DOI:10.1007/s00236-020-00372-9"],"references":["308943749_Reducing_Complex_CSP_Models_to_Traces_via_Priority","289999694_The_Expressiveness_of_CSP_With_Priority","267767495_Model_checking_Timed_CSP","312828959_Practical_Partial_Order_Reduction_for_CSP","286299203_FDR3_-_A_Modern_Refinement_Checker_for_CSP","277630596_FDR3_a_parallel_refinement_checker_for_CSP","266044503_Discrete_Analysis_of_Continuous_Behaviour_in_Real-Time_Concurrent_Systems_Discrete_Analysis_of_Continuous_Behaviour_in_Real-Time_Concurrent_Systems","258561035_Understanding_Concurrent_Systems","257335297_Checking_noninterference_in_Timed_CSP","240097982_Logical_Verification_of_Reactive_Software_Systems"]}