{"id":"341262005_Actionable_knowledge_discovery_from_social_networks_using_causal_structures_of_structural_features","abstract":"Knowledge discovery and data mining provide an array of solutions for real-world problems. When facing business\nrequirements, the ultimate goal of knowledge discovery is not the knowledge itself but rather making the gained knowledge\npractical. Consequently, the models and patterns found by the mining methods often require post-processing. To this end,\nactionable knowledge discovery has been introduced which is developed to extract actionable knowledge from data. The output\nof actionable knowledge discovery is a set of actions that help the domain expert to gain the desired outcome. Such a process\nwhere a set of actions are extracted is called action extraction. One of the challenges of action extraction is to incorporate\ncausal dependencies among the variables to find actions with higher effectiveness compared to when no such dependencies\nare used. The goal of this paper is to dive into the lesser studied subject of “action discovery in social networks” and intends\nto extract actions by utilizing the casual structures discovered from such data. Furthermore, in order to capture the underlying\ninformation within a social network, we extract the corresponding structural features. We propose a method called SF-ICECREAM\n(Social Features included Inductive Causation Enabled Causal Relationship-based Economical Action Mining)\nto overcome the challenges introduced above. This method uses structural features to find the underlying causal structures\nwithin a social network and incorporates them into the action extraction process.","authors":["Nasrin Kalanat","Alireza Khanshan","Eynollah Khanjari"],"meta":["May 2020Journal of Intelligent and Fuzzy Systems 39(6):1-13","DOI:10.3233/JIFS-191519"],"references":["332131883_Action_extraction_from_social_networks","325434599_Extracting_Actionable_Knowledge_from_Domestic_Violence_Discourses_on_Social_Media","325236580_Actionable_pattern_discovery_for_Sentiment_Analysis_on_Twitter_Data_in_clustered_environment","325133392_Mining_Alternative_Actions_from_Community_QA_Corpus","317734266_Interpretable_Predictions_of_Tree-based_Ensembles_via_Actionable_Feature_Tweaking","340046682_Extracting_actionable_knowledge_from_social_networks_with_node_attributes","329654602_Causation_Prediction_and_Search","322649869_Mining_Actionable_Behavioral_Rules_Based_on_Decision_Tree_Classifier","322409424_Beyond_Understanding_and_Prediction_Data_Mining_for_Action","312324429_MR-Apriori_count_distribution_algorithm_for_parallel_Action_Rules_discovery"]}