{"id":"341217299_Ethnic_diversity_in_central_government_cabinets","abstract":"Why is there so much variation in the ethnic composition of cabinets? Previous work has focused on cabinet policy alignment, largely overlooking the role of identity-based characteristics like ethnicity. I theorize that country leaders make ethnic cabinet appointments to gain political support, both when country-level ethnic diversity is high and when ethnic groups rely on leader decisions in order to receive resources. Cabinet appointments offer leaders a way to distribute resources while creating a credible commitment to remove these resources if ethnic group support wanes. I introduce a new cross-national time-series dataset of cabinet minister names from 149 countries from 1967 to 2017. Using novel methods from computer science, I code the ethnicity of cabinet ministers' names and construct a cabinet diversity index for each country-year. After validating this measure, I find support for my hypothesis. Country leaders in reliant societies increase ethnic cabinet appointments seven to twenty-five percent over leaders in non-reliant societies. The results provide the first large-scale cross-national analysis of the strategic ways in which leaders use cabinet seats to manage the distribution of resources.","authors":["William O'Brochta"],"meta":["May 2020Politics Groups and Identities","DOI:10.1080/21565503.2020.1756360"],"references":["323810749_Ethnic_fragmentation_public_good_provision_and_inequality_in_India_1988-2012","320569960_RacialEthnic_Perceptions_from_Hispanic_Names_Selecting_Names_to_Test_for_Discrimination","333684611_Descriptive_representation_and_political_knowledge","331499181_How_Do_Immigrants_Respond_to_Discrimination_The_Case_of_Germans_in_the_US_During_World_War_I","325768300_Ethnic_politics_and_state_power_in_Africa_The_logic_of_the_coup-_civil_war_trap","323662185_Dominant_Party_Rule_Elections_and_Cabinet_Instability_in_African_Autocracies","322660621_It's_Not_Just_Welfare_Racial_Inequality_and_the_Local_Provision_of_Public_Goods_in_the_United_States","322073678_Ethnic_Favoritism_An_Axiom_of_Politics","321217034_Ethnic_Diversity_and_Ethnic_Discrimination_Explaining_Local_Public_Goods_Provision","320883514_Nationality_Classification_Using_Name_Embeddings"]}