{"id":"341275756_Use_of_prismatic_waves_in_full-waveform_inversion_with_the_exact_Hessian","abstract":"The truncated Newton method uses information contained in the exact Hessian in full-waveform inversion (FWI). The exact Hessian physically contains information regarding doubly scattered waves, especially prismatic events. These waves are mainly caused by the scattering at steeply dipping structures, such as salt flanks and vertical or nearly vertical faults. We have systematically investigated the properties and applications of the exact Hessian. We begin by giving the formulas for computing each term in the exact Hessian and numerically analyzing their characteristics. We show that the second term in the exact Hessian may be comparable in magnitude to the first term. In particular, when there are apparent doubly scattered waves in the observed data, the influence of the second term may be dominant in the exact Hessian and the second term cannot be neglected. Next, we adopt a migration/demigration approach to compute the Gauss-Newton-descent direction and the Newton-descent direction using the approximate Hessian and the exact Hessian, respectively. In addition, we determine from the forward and the inverse perspectives that the second term in the exact Hessian not only contributes to the use of doubly scattered waves, but it also compensates for the use of single-scattering waves in FWI. Finally, we use three numerical examples to prove that by considering the second term in the exact Hessian, the role of prismatic waves in the observed data can be effectively revealed and steeply dipping structures can be reconstructed with higher accuracy.","authors":["Yuzhu Liu","Zheng Wu","Hao Kang","Jizhong Yang"],"meta":["July 2020Geophysics 85(4):R325-R337","DOI:10.1190/geo2018-0625.1"],"references":["328659593_Joint_least-squares_reverse_time_migration_of_primary_and_prismatic_waves","324159007_Frequency-domain_full-waveform_inversion_with_non-linear_descent_directions","319897517_Preconditioned_acoustic_least-squares_two-way_wave_equation_migration_with_exact_adjoint_operator","282496783_Approximate_solution_of_nonlinear_double-scattering_inversion_for_true_amplitude_imaging","280315672_An_improved_scattering-integral_approach_for_frequency-domain_full_waveform_inversion","317634822_Elastic_least-squares_reverse_time_migration_via_linearized_elastic_full_waveform_inversion_with_pseudo-Hessian_preconditioning","305458388_Estimation_of_elastic_constants_for_HTI_media_using_Gauss-Newton_and_full-Newton_multiparameter_full-waveform_inversion","288900667_The_seismic_inverse_problem_as_a_sequence_of_before_stack_migrations_Conference_on_Inverse_Scattering_Theory_and_application","269043586_Reverse_time_migration_of_prism_waves_for_salt_flank_delineation","268453423_Prismatic_wave_imaging_with_dual_flood_RTM"]}