{"id":"341229263_Systematic_Literature_Review_to_Investigate_the_Application_of_Open_Source_Intelligence_OSINT_with_Artificial_Intelligence","abstract":"Open Source Intelligence (OSINT) is a concept to describe the search, collection, analysis, and use of information from open sources, as well as the techniques and tools used. OSINT emerges out of a military need to collect relevant and publicly available information. Through the use of OSINT, it is possible to find specific information that has some knowledge or provides an advantage. Since its emergence, some studies have been done proposing and developing new ways of using OSINT in different areas. In addition to OSINT, another field of study that has also been a worldwide trend and is being used together with other areas is Artificial Intelligence (AI). AI is the area of computer science responsible for the development of intelligent systems. However, a systematic literature review that investigates the use of OSINT over the years and your application with AI was not found. So, this work has an objective to develop a systematic literature review on OSINT to investigate the application of OSINT with AI. This work was motivated to fill this research gap, for this, consolidate the publications on OSINT divided into the publication bases. As for its contribution, this work presents a systematic literature review composed of 9-step and also brings consolidated information to support the next OSINT studies. This research searched for publications between January 1990 and October 2019, finding a total of 244 publications. The 9-steps of the systematic literature review are Definition of Keywords, Query string definition, the definition of publication bases, the search on the publications bases, the base search results analysis, download of publications, importing the publications into Mendeley, Importing. Ris file into VOSviewer and Keyword Map Analysis. Analyzing the results, we find some relevant information about the publications that address OSINT and OSINT with AI or other areas. With this information, it was possible to understand where the largest concentration of publications, which countries and continents develop the most research and the characteristics of these publications. What are the trends for the next studies on OSINT with AI. Which AI subareas are used with OSINT. What are the most used keywords, and how do these keywords relate to others over the years. Which publication bases have the highest concentration of publications and what are the types of these publications? Also, a timeline describing the application of OSINT. It also became evident how OSINT has been used with AI to solve problems in different areas with different objectives. Based on these results, it is concluded that the application of a systematic literature review can show the application of OSINT with AI.","authors":["João Rafael Gonçalves Evangelista","Renato Jose Sassi","Marcio Romero","Domingos Márcio Napolitano"],"meta":["May 2020Journal of Applied Security Research 16(3)","DOI:10.1080/19361610.2020.1761737"],"references":["337086667_Artificial_Intelligence_Recruitment_Analysis","335799509_Novel_Smart_Water_Metering_and_Management_System_for_Smart_Cities","335661337_Applications_of_Artificial_Intelligence_in_Academic_Libraries","334365187_Classification_of_Web_History_Tools_Through_Web_Analysis","330477778_A_Supervised_Machine_Learning_Based_Approach_for_Automatically_Extracting_High-Level_Threat_Intelligence_from_Unstructured_Sources","335435943_Artificial_Intelligence_AI_Multidisciplinary_perspectives_on_emerging_challenges_opportunities_and_agenda_for_research_practice_and_policy","335341584_Application_of_Artificial_Intelligence_Technology_in_Medical_Cell_Biology","332158672_A_systematic_literature_review_and_meta-analysis_on_artificial_intelligence_in_penetration_testing_and_vulnerability_assessment_R","329341741_Understanding_key_skills_for_information_security_managers","325541354_TExtractor_An_OSINT_Tool_to_Extract_and_Analyse_AudioVideo_Content"]}