{"id":"341269836_Cumulative_effects_of_triadic_closure_and_homophily_in_social_networks","abstract":"Social network structure has often been attributed to two network evolution mechanisms—triadic closure and choice homophily—which are commonly considered independently or with static models. However, empirical studies suggest that their dynamic interplay generates the observed homophily of real-world social networks. By combining these mechanisms in a dynamic model, we confirm the longheld hypothesis that choice homophily and triadic closure cause induced homophily. We estimate how much observed homophily in friendship and communication networks is amplified due to triadic closure. We find that cumulative effects of homophily amplification can also lead to the widely documented core-periphery structure of networks, and to memory of homophilic constraints (equivalent to hysteresis in physics). The model shows that even small individual bias may prompt network-level changes such as segregation or core group dominance. Our results highlight that individual-level mechanisms should not be analyzed separately without considering the dynamics of society as a whole.","authors":["Aili Asikainen","Gerardo Iñiguez","Javier Ureña-Carrión","Kimmo Kaski"],"meta":["May 2020Science Advances 6(19):eaax7310","DOI:10.1126/sciadv.aax7310"],"references":["326558651_Homophily_influences_ranking_of_minorities_in_social_networks","319946195_A_Structural_Model_of_Homophily_and_Clustering_in_Social_Networks","318899540_Multiscale_mixing_patterns_in_networks","314245956_Anatomy_of_news_consumption_on_Facebook","332449769_Mixing_patterns_and_individual_differences_in_networks","329137472_Coevolving_nonlinear_voter_model_with_triadic_closure","324166870_Flexible_Model_Selection_for_Mechanistic_Network_Models_via_Super_Learner","318999207_Core-Periphery_Structure_in_Networks_Revisited","318004498_Gender_Homophily_in_Referral_Networks_Consequences_for_the_Medicare_Physician_Earnings_Gap","317137156_A_Structural_Model_of_Dense_Network_Formation"]}