{"id":"341330614_Robotics_vs_Game-Console-Based_Platforms_to_Learn_Computer_Architecture","abstract":"The fields of robotics and game consoles offer an interesting and broad range of lab platforms with appropriate characteristics for teaching Computer Architecture concepts. This work analyzes the impact of one approach based on game consoles and another one based on robotics from a triple dimension: student motivation, acquired knowledge, and perception of the employed platform. The study has been carried out on a sample of 96 students using the Arduino-based robot and 75 students using the Nintendo-DS console. A mixed methodology is employed encompassing quantitative and qualitative approaches. Five instruments are used to measure the three aforementioned dimensions. Results show that despite both platforms performing similarly in the three considered dimensions (student motivation, acquired knowledge, and perception of the employed platform), the robotics platform does it slightly better than game console, based on the obtained average scores for the considered instruments. Despite this outperforming, motivation and perception decrease for the students using the robotics platform as result of some identified constraint. This suggests that changes are required in the organization of the lab sessions to promote teamwork skills and to overcome the lack of simulators to remove the obstacles hinting motivation and performance. However, a clear correlation between motivation and perception and acquired knowledge has not been identified on computer architecture. Implications of affordances and constraints of both platforms, types of activities, and their impact on results have been discussed.","authors":["Beatriz Garcia Fernandez","Xavier del Toro Garcia","Maria J. Santofimia","Javier Dorado"],"meta":["May 2020IEEE Access 8:1-1","DOI:10.1109/ACCESS.2020.2994196"],"references":["347320301_16_Cards_to_Get_Into_Computer_Organization","334904462_Jump_to_the_Next_Level_A_Four-Year_Gamification_Experiment_in_Information_Technology_Engineering","331512413_Examining_the_Use_of_an_Educational_Escape_Room_for_Teaching_Programming_in_a_Higher_Education_Setting","327676303_Using_Twitter_as_a_pedagogical_tool_in_two_classrooms_a_comparative_case_study_between_an_education_and_a_communication_class","320072960_Phogo_A_low_cost_free_and_maker_revisit_to_Logo","319959476_Demystifying_computational_thinking","326709136_The_essential_applications_of_educational_robot_Requirement_analysis_from_the_perspectives_of_experts_researchers_and_instructors","326162156_A_scoping_review_of_research_on_digital_game-based_language_learning","322839334_Improving_programming_skills_in_engineering_education_through_problem-based_game_projects_with_Scratch","322058204_High_quality_low_cost_education_with_the_Raspberry_Pi"]}