{"id":"341317328_Adaptive_social_networks_promote_the_wisdom_of_crowds","abstract":"Social networks continuously change as new ties are created and existing ones fade. It is widely acknowledged that our social embedding has a substantial impact on what information we receive and how we form beliefs and make decisions. However, most empirical studies on the role of social networks in collective intelligence have overlooked the dynamic nature of social networks and its role in fostering adaptive collective intelligence. Therefore, little is known about how groups of individuals dynamically modify their local connections and, accordingly, the topology of the network of interactions to respond to changing environmental conditions. In this paper, we address this question through a series of behavioral experiments and supporting simulations. Our results reveal that, in the presence of plasticity and feedback, social networks can adapt to biased and changing information environments and produce collective estimates that are more accurate than their best-performing member. To explain these results, we explore two mechanisms: 1) a global-adaptation mechanism where the structural connectivity of the network itself changes such that it amplifies the estimates of high-performing members within the group (i.e., the network “edges” encode the computation); and 2) a local-adaptation mechanism where accurate individuals are more resistant to social influence (i.e., adjustments to the attributes of the “node” in the network); therefore, their initial belief is disproportionately weighted in the collective estimate. Our findings substantiate the role of social-network plasticity and feedback as key adaptive mechanisms for refining individual and collective judgments.","authors":["Abdullah Almaatouq","Alejandro Noriega-Campero","Abdulrahman Alotaibi","P. M. Krafft"],"meta":["May 2020Proceedings of the National Academy of Sciences 117(21):201917687","DOI:10.1073/pnas.1917687117"],"references":["336011089_Individual_and_collective_encoding_of_risk_in_animal_groups","335618510_Information_gerrymandering_and_undemocratic_decisions","330522184_Social_learning_strategies_regulate_the_wisdom_and_madness_of_interactive_crowds","329449334_The_strength_of_dynamic_ties_The_ability_to_alter_some_ties_promotes_cooperation_in_those_that_cannot_be_altered","322550760_Dynamical_Networks_of_Influence_in_Small_Group_Discussions","339762036_Towards_Stable_Principles_of_Collective_Intelligence_under_an_Environment-Dependent_Framework","337928028_Towards_stable_principles_of_collective_intelligence_under_an_environment-dependent_framework","331138236_The_Secret_of_Our_Success_How_Culture_Is_Driving_Human_Evolution_Domesticating_Our_Species_and_Making_Us_Smarter","329149731_Social_network_plasticity_decreases_disease_transmission_in_a_eusocial_insect","323155706_Demographically_diverse_crowds_are_typically_not_much_wiser_than_homogeneous_crowds"]}