{"id":"341366372_Computational_Thinking_in_Secondary_and_Higher_Education","abstract":"One of the most important challenges of education is the formation of proper computational thinking (CT). In line with K-12 Computer Science Framework (k12cs.org) the term of CT refers to the “thought processes involved in expressing solutions as computational steps or algorithms that can be carried out by a computer”. CT is a problem solving process essential to the development of computer applications, but it is also used in supporting problem solving across many other disciplines. It has gained some grounds in secondary education in the last few years and there are ongoing efforts to introduce it to elementary education as well. Taking into consideration that algorithms play a central role in computational thinking, the aim of our research was to assess the skills of secondary school students and university students in this area, CT, that they faced an apparently computer science – free task but with obvious algorithmic background. According to the aims of our research there were two target populations: secondary school students and university students. In order to measure the level of computational thinking we elaborated a worksheet (test with problems to be solved). The tasks contained algorithms that can be applied on computer, and they did not need any IT knowledge, only structured and logical thinking. The results provide a reliable guide regarding those cognitive skills, among secondary school-children and university students, which need improvement, so transfer of knowledge could work in practical, life-like situations.","authors":["Katalin Harangus","Zoltan Katai"],"meta":["January 2020Procedia Manufacturing 46:615-622","DOI:10.1016/j.promfg.2020.03.088"],"references":["324204047_Algorithmic_thinking_vs_text_comprehension","320959295_Competencies_for_Complexity_Problem_Solving_in_the_Twenty-First_Century","317177785_Using_collaborative_learning_scenarios_to_teach_programming_to_non-CS_majors","316123152_The_development_and_assessment_of_problem_solving_in_21st-century_schools","274309848_Computational_Thinking","326256270_Can_computational_talent_be_detected_Predictive_validity_of_the_Computational_Thinking_Test","317158625_Remaining_trouble_spots_with_computational_thinking","304993127_Assessment_of_Complex_Problem_Solving_What_We_Know_and_What_We_Don't_Know","291299243_Thinking_and_Problem_Solving","287771187_Accounting_for_the_gender_gaps_in_student_performance_in_reading_and_mathematics_Evidence_from_31_countries"]}