{"id":"341361980_Global_sentiments_surrounding_the_COVID-19_pandemic_on_Twitter","abstract":"Background: \nWith the World Health Organization's (WHO) pandemic declaration and government-initiated actions against the disease, COVID-19 sentiments evolved rapidly.\n\nObjective: \nThis study examined worldwide trends of four emotions (i.e., fear, anger, sadness, and joy) and the narratives underlying those emotions during the COVID-19 pandemic.\n\nMethods: \nOver 20 million social media twitter posts made during the early phases of the COVID-19 outbreak from 28 January to 9 April 2020 were collected using \"wuhan\", \"corona\", \"nCov\", and \"covid\" as search keywords.\n\nResults: \nPublic emotions shifted strongly from fear to anger over the course of the pandemic, while sadness and joy also surfaced. Findings from word clouds suggest that fears around shortages of COVID-19 tests and medical supplies became increasingly widespread discussion points. Anger shifted from xenophobia at the beginning of the pandemic to discourse around the stay-at-home notices. Sadness was highlighted by the topics of losing friends and family members while topics relating to joy included words of gratitude and good health.\n\nConclusions: \nOverall, global COVID-19 sentiments have shown rapid evolutions just within the span of a few weeks. Findings suggest that emotion-driven collective issues are developing, that are entered around shared public distress experiences of the COVID-19 pandemic which include large scale social isolation and the loss of human lives. The steady rise of societal concerns indicated by negative emotions need to be monitored and controlled by complementing regular crisis communication with strategic public health communication that aims to balance public psychological wellbeing.","authors":["May Oo Lwin","Jiahui Lu","Anita Sheldenkar","Peter J Schulz"],"meta":["May 2020JMIR Public Health and Surveillance","DOI:10.2196/19447","Projects: Emotion recognition methods and applicationsEmotional responses surrounding COVID-19"],"references":["341050215_Using_social_and_behavioural_science_to_support_COVID-19_pandemic_response","340038981_The_Impact_of_COVID-19_Epidemic_Declaration_on_Psychological_Consequences_A_Study_on_Active_Weibo_Users","339766601_Immediate_Psychological_Responses_and_Associated_Factors_during_the_Initial_Stage_of_the_2019_Coronavirus_Disease_COVID-19_Epidemic_among_the_General_Population_in_China","327567460_Strategic_Uses_of_Facebook_in_Zika_Outbreak_Communication_Implications_for_the_Crisis_and_Emergency_Risk_Communication_Model","325450884_CrystalFeel_at_SemEval-2018_Task_1_Understanding_and_Detecting_Emotion_Intensity_using_Affective_Lexicons","312375296_The_Integrated_Theory_of_Emotional_Behavior_Follows_a_Radically_Goal-Directed_Approach","281311515_Leveraging_social_networking_sites_for_disease_surveillance_and_public_sensing_the_case_of_the_2013_avian_influenza_AH7N9_outbreak_in_China","340669505_Multidisciplinary_research_priorities_for_the_COVID-19_pandemic_a_call_for_action_for_mental_health_science","339356876_Psychological_interventions_for_people_affected_by_the_COVID-19_epidemic","244956329_A_General_Psychoevolutionary_Theory_of_Emotion"]}