{"id":"341307817_Time-Discrete_Parameter_Identification_Algorithms_for_Two_Deterministic_Epidemiological_Models_applied_to_the_Spread_of_COVID-19","abstract":"The pandemic outbreak of COVID-19 threatens people worldwide. Politicians around the globe have to balance different interests. Accordingly, they make decisions which heavily impact our daily life or even curtail fundamental rights. They consequently base their judgements on advices from scientists. For these reasons, many epidemiological models have appeared and have been famous since the beginning of the twentieth century. However, scientists depend on rich data to evaluate them and their assumptions. As this pandemic outbreak has lead to large data collections by the John Hopkins University since its beginning, we take advantage of this situation and compare two deterministic epidemiological models heavily used - the Susceptible-Infectious-Recovered model (SIR model) and the Susceptible-Infectious-Recovered-Dead model (SIRD model). In contrast to other works which concentrate on future predictions, we aim to investigate the validity of assumptions with respect to available data. For that purpose, instead of using these models forward in time, we propose modified time-discrete versions of the continuous models with relaxing all transfer rates to be time-varying and develop algorithms to predict these coefficients based on the principle of “divide-and-conquer” for the inverse problems. Since Asia, Europe and North America are especially affected by this pandemic, we choose countries from these continents to illustrate our results. In the main part of this article, we escepially discuss our results for Hubei (China). As supplementary material, we illustrate our findings for the aforementioned choice of countries. We finally draw some conclusions for future applications of these models and data acquisition.","authors":["Benjamin Wacker","Jan Schlueter"],"meta":["May 2020","DOI:10.21203/rs.3.rs-28145/v1"],"references":["346517645_Modeling_and_forecasting_the_early_evolution_of_the_Covid-19_pandemic_in_Brazil","340948924_Aerodynamic_analysis_of_SARS-CoV-2_in_two_Wuhan_hospitals","340943462_A_novel_approach_to_modelling_the_spatial_spread_of_airborne_diseases_an_epidemic_model_with_indirect_transmission","340518629_Effective_containment_explains_subexponential_growth_in_recent_confirmed_COVID-19_cases_in_China","340324129_COVID-19-associated_Acute_Hemorrhagic_Necrotizing_Encephalopathy_CT_and_MRI_Features","340003104_Modeling_the_control_of_COVID-19_impact_of_policy_interventions_and_meteorological_factors","340944622_Estimating_the_infection_horizon_of_COVID-19_in_eight_countries_with_a_data-driven_approach","340876572_Acute_Pulmonary_Embolism_Associated_with_COVID-19_Pneumonia_Detected_with_Pulmonary_CT_Angiography","340359416_A_time_delay_dynamical_model_for_outbreak_of_2019-nCoV_and_the_parameter_identification","340083511_Analysis_and_forecast_of_COVID-19_spreading_in_China_Italy_and_France","339982489_Dynamics_for_a_fractional-order_predator-prey_model_with_group_defense","339950496_A_discrete_stochastic_model_of_the_COVID-19_outbreak_Forecast_and_control","339672627_Optimization_Method_for_Forecasting_Confirmed_Cases_of_COVID-19_in_China","339828677_The_Incubation_Period_of_Coronavirus_Disease_2019_COVID-19_From_Publicly_Reported_Confirmed_Cases_Estimation_and_Application","339671277_Risk_of_COVID-19_for_patients_with_cancer"]}