{"id":"341303903_An_UAV_and_Satellite_Multispectral_Data_Approach_to_Monitor_Water_Quality_in_Small_Reservoirs","abstract":"A multi-sensor and multi-scale monitoring tool for the spatially explicit and periodic monitoring of eutrophication in a small drinking water reservoir is presented. The tool was built with freely available satellite and in situ data combined with Unmanned Aerial Vehicle (UAV)-based technology. The goal is to evaluate the performance of a multi-platform approach for the trophic state monitoring with images obtained with MultiSpectral Sensors on board satellites Sentinel 2 (S2A and S2B), Landsat 8 (L8) and UAV. We assessed the performance of three different sensors (MultiSpectral Instrument (MSI), Operational Land Imager (OLI) and Rededge Micasense) for retrieving the pigment chlorophyll-a (chl-a), as a quantitative descriptor of phytoplankton biomass and trophic level. The study was conducted in a waterbody affected by cyanobacterial blooms, one of the most important eutrophication-derived risks for human health. Different empirical models and band indices were evaluated. Spectral band combinations using red and near-infrared (NIR) bands were the most suitable for retrieving chl-a concentration (especially 2 band algorithm (2BDA), the Surface Algal Bloom Index (SABI) and 3 band algorithm (3BDA)) even though blue and green bands were useful to classify UAV images into two chl-a ranges. The results show a moderately good agreement among the three sensors at different spatial resolutions (10 m., 30 m. and 8 cm.), indicating a high potential for the development of a multi-platform and multi-sensor approach for the eutrophication monitoring of small reservoirs.","authors":["Carmen Cillero Castro","Jose Antonio Domínguez Gómez","Jordi Delgado","Boris Hinojo"],"meta":["May 2020Remote Sensing 12(9):1514","DOI:10.3390/rs12091514","Project: MULTISPECTRAL SENSORS ON UNMANNED AERIAL VEHICLES (UAV) AS A HIGH RESOLUTION MANAGEMENT TOOL IN RESERVOIRS: A FEASIBILITY STUDY” Co-funded by the Spanish Ministry of Economy and Competitiveness"],"references":["345480362_Assessment_of_atmospheric_correction_algorithms_for_the_Sentinel-2A_MultiSpectral_Imager_over_coastal_and_inland_waters","338156463_Prediction_of_Optical_and_Non-Optical_Water_Quality_Parameters_in_Oligotrophic_and_Eutrophic_Aquatic_Systems_Using_a_Small_Unmanned_Aerial_System","331339566_Analyzing_Performances_of_Different_Atmospheric_Correction_Techniques_for_Landsat_8_Application_for_Coastal_Remote_Sensing","330456389_The_Assessment_of_Landsat-8_OLI_Atmospheric_Correction_Algorithms_for_Inland_Waters","330031765_Retrieval_of_Chlorophyll_a_from_Sentinel-2_MSI_Data_for_the_European_Union_Water_Framework_Directive_Reporting_Purposes","328512490_Sentinel-2Landsat-8_product_consistency_and_implications_for_monitoring_aquatic_systems","325459632_Assessing_the_effectiveness_of_Landsat_8_chlorophyll_a_retrieval_algorithms_for_regional_freshwater_monitoring","332033271_Calibration_and_validation_of_algorithms_for_the_estimation_of_chlorophyll-a_concentration_and_secchi_depth_in_inland_waters_with_Sentinel-2","330701449_Radiometric_calibration_assessments_for_UAS-borne_multispectral_cameras_Laboratory_and_field_protocols","327651564_A_spectral_space_partition_guided_ensemble_method_for_retrieving_chlorophyll-a_concentration_in_inland_waters_from_Sentinel-2A_satellite_imagery"]}