{"id":"341313089_THE_EXPERIMENTAL_STUDIES_OF_THE_AUTOMATIC_CONTROL_METHODS_OF_MAGNETIC_SEPARATORS_PERFORMANCE_BY_MAGNETIC_PRODUCT","abstract":"The objective of this article is to experimentally test for the automatic control of the magnetic separator efficiency of the magnetic product. The developed process depends on the fact that the electromotive force in electric coil located on the pole of the magnetic system of the separation depends on its efficiency with the magnetic product. A functional scheme of the measurement process is given to achieve a magnetic separator by the magnetic product. The theoretical formulas that describe the formation of a pulsed magnetic field in a magnetic separation zone are presented and the magnetic induction of this field is based on the physical variables that characterize the operating system of the damp magnetic drum class. The theoretical reliance of the magnetic induction of the magnetic field in the working zone on the amount of magnetite in the concentrate layer on the surface of the separator drum is determined. The methodology and functional scheme for conducting experimental studies in an industrial environment of an iron ore-dressing factory of the proposed automatic control method is given. The method includes conducting a passive experiment, including the selection of technological samples and their analysis with simultaneous recording of voltmeter readings, which measure the voltage at the output of the electric coil located on the pole piece of the magnetic system of the separator. Mathematical treatment of the results of experimental studies was performed through regression analysis method. The regression equation that connects the size of the electric driving force is obtained in the coil and the magnetic separator performance of the magnetic product is performed. It is concluded that the magnetic separator performance of the magnetic product is sufficiently accurate. The results obtained allow us to develop a system for automatically controlling the performance of a magnetic separator.","authors":["Jamil Abedalrahim","Jamil Alsayaydeh","Win Adiyansyah Indra","Adam Wong"],"meta":["April 2020Journal of Engineering and Applied Sciences 15(7):922-927","Project: RF and Microwave Components Design and Development"],"references":["335728301_Magnetic_techniques_for_the_isolation_and_purification_of_proteins_and_peptides","331883500_Review_of_Coal-Fired_Electrification_and_Magnetic_Separation_Desulfurization_Technology","318915611_Characterization_and_Pre-Concentration_of_Low-Grade_Vanadium-Titanium_Magnetite_Ore","294604306_Automatic_optimization_of_productivity_of_magnetic_concentration_technological_complex","292084087_Methodof_automatic_control_of_content_of_iron_in_ore_by_means_of_industrial_magnetic_separator","331079102_Automatic_control_system_for_wet_magnetic_separation_of_iron_ore","327119957_Model_of_Stabilization_of_the_Quality_of_Iron-Ore_Concentrate_in_the_Process_of_Magnetic_Separation_with_the_Use_of_Extreme_Regulation","320494809_New_Features_and_Uncovered_Benefits_of_Polycrystalline_Magnetite_as_Reusable_Catalyst_in_Reductive_Chemical_Conversion","318286929_REVIEW_OF_THE_METHODS_OF_PROCESS_OPTIMIZATION_AND_CONTROL_OF_MAGNETIC_SEPARATION_OF_IRON_ORE","255687523_Gas-Assisted_Superparamagnetic_Extraction_for_Potential_Large-Scale_Separation_of_Proteins"]}