{"id":"341339340_A_Novel_Approach_of_Face_Recognition_Using_Optimized_Adaptive_Illumination-Normalization_and_KELM","abstract":"Light variations from different directions on the face images cause severe performance degradation in face recognition system. These variations should be nullified or suppressed so that the recognition performance can be improved. Here, the objective is to develop a robust and pragmatic method which can compensate the effect of uncontrolled light incident from different directions on the person’s face. To normalize the effect of unpredictable illumination variations from face images, a novel illumination–normalization method is proposed by utilizing the fractional discrete cosine transform (Fr-DCT) and a nonlinear modifier. Fr-DCT provides a generalized α-domain in which illumination variation’s effect can be better processed. The proposed method adaptively selects and processes the low-frequency α-domain coefficients depending upon the light variations incident on the face image. The illumination-normalized images are classified with the help of a non-iterative classifier. The parameters of the proposed method are optimized with the help of genetic algorithm. The proposed method is tested over Extended YALE B, AR, CMU PIE and YALE face databases. Very promising results have been achieved with percentage error rate zero for CMU PIE and subset 3 of Extended YALE B, 0.38% for subset 4 and 0.55% for subset 5. On AR database, error rate is 0.5% when only illumination-varying images are considered for testing. The comparison of the results of the proposed method with those of the existing state-of-the-art methods clearly establishes the superiority of the proposed method.","authors":["Sahil Dalal","Virendra P. Vishwakarma"],"meta":["May 2020ARABIAN JOURNAL FOR SCIENCE AND ENGINEERING 45(12)","DOI:10.1007/s13369-020-04566-8","Project: Illumination Normalization in Face Recognition"],"references":["340683931_Generalized_DCT_and_DWT_hybridization_based_robust_feature_extraction_for_face_recognition","338413762_A_novel_non-linear_modifier_for_adaptive_illumination_normalization_for_robust_face_recognition","337863023_An_Efficient_Cryptosystem_for_Video_Surveillance_in_the_Internet_of_Things_Environment","337742080_A_Novel_Approach_for_Compensation_of_Light_Variation_Effects_with_KELM_Classification_for_Efficient_Face_Recognition","337522080_ECG_Classification_using_Kernel_Extreme_Learning_Machine","329263099_An_efficient_hybrid_DWT-fuzzy_filter_in_DCT_domain_based_illumination_normalization_for_face_recognition","345438273_Single_image_defogging_by_gain_gradient_image_filter","342232632_Extreme_Learning_Machine_Theory_and_Applications","335743744_A_Lightweight_Secure_IoT_Surveillance_Framework_Based_on_DCT-DFRT_Algorithms","328053198_Image_dehazing_using_Moore_neighborhood-based_gradient_profile_prior"]}