{"id":"341367162_The_association_between_national_income_and_adult_obesity_prevalence_Empirical_insights_into_temporal_patterns_and_moderators_of_the_association_using_40_years_of_data_across_147_countries","abstract":"Background\nAt a country level, population obesity prevalence is often associated with economic affluence, reflecting a potential adverse outcome concomitant with economic growth. We estimated the pattern and strength of the empirically observed relationship between national income and adult obesity prevalence, and the moderating role of countries’ macro-environments on this relationship.\n\nMethods\nWe assembled data on national obesity prevalence, income and a range of variables that characterize macro-environments related to 147 countries from multiple international organizations and databases. We used a Bayesian hierarchical model to estimate the relationship (elasticities) between national income (using Gross Domestic Product Per Capita, GDPPC) and adult obesity prevalence, and the moderating effects of five different dimensions (globalization orientation, demographic characteristics, economic environment, labor market characteristics, and strength of health policies) of countries’ macro-environments on the income elasticities. Using the latest (2019–2024) available national income growth projections from the International Monetary Fund, we forecast future global trends in obesity prevalence.\n\nFindings\nOver the 40-years 1975–2014, adult obesity prevalence increased at a declining rate with GDPPC across the 147 countries. The mean income elasticity estimates were 1.23 (95% credible interval 1.04–1.42) for males and 1.01 (0.82–1.18) for females. The elasticities were positively associated with the extent of political globalization and negatively associated with urbanization and share of agriculture in the national GDP. Income based projections indicate that obesity prevalence would continue to grow at an average annual rate of 2.47% across the studied countries during 2019–2024.\n\nConclusions\nPopulation obesity prevalence exhibits a positive relationship with national income and there is no evidence that the relationship, while weakening, actually turns negative at higher income levels (“obesity Kuznets curve”). Based on current trends, global obesity prevalence will continue to increase during 2019–2024, with the rate of growth higher in low- and middle-income countries. As most people currently live in low- and middle-income countries with rising incomes, our findings underscore the urgent societal imperatives for effective policy initiatives, especially those that target the concomitant “nutrition transition” process with economic affluence, to break or at least further weaken the positive relationship of population obesity prevalence with national income.","authors":["Debabrata Talukdar","Satheesh Seenivasan","Adrian James Cameron","Gary Sacks"],"meta":["May 2020PLoS ONE 15(5):e0232236","DOI:10.1371/journal.pone.0232236"],"references":["337584297_The_overweight_and_obesity_transition_from_the_wealthy_to_the_poor_in_low-_And_middleincome_countries_A_survey_of_household_data_from_103_countries","335042246_Impact_of_multiple_food_environments_on_body_mass_index","332973793_Rising_rural_body-mass_index_is_the_main_driver_of_the_global_obesity_epidemic_in_adults","330125740_Whole_systems_approaches_to_obesity_and_other_complex_public_health_challenges_A_systematic_review","335800020_The_obesity_transition_stages_of_the_global_epidemic","333254372_Rising_rural_body-mass_index_is_the_main_driver_of_the_global_obesity_epidemic_in_adults","332123219_Obesity_Kuznets_curve_international_evidence","331390402_Obesity_global_epidemiology_and_pathogenesis","330676764_The_Global_Syndemic_of_Obesity_Undernutrition_and_Climate_Change_The_Lancet_Commission_report","330676117_The_obesity_transition_stages_of_the_global_epidemic"]}