{"id":"341349587_Towards_a_Distributed_Quantum_Computing_Ecosystem","abstract":"The Quantum Internet, by enabling quantum communications among remote quantum nodes, is a network capable of\nsupporting functionalities with no direct counterpart in the classical world. Indeed, with the network and communications\nfunctionalities provided by the Quantum Internet, remote quantum devices can communicate and cooperate for solving\nchallenging computational tasks by adopting a distributed computing approach. The aim of this study is to provide the reader\nwith an overview about the main challenges and open problems arising in the design of a distributed quantum computing\necosystem. We follow a bottom-up approach, from a communications engineering perspective. We start by introducing the Quantum Internet as the fundamental underlying infrastructure of the distributed\nquantum computing ecosystem. Then we go further, by elaborating on a high-level system abstraction of the distributed\nquantum computing ecosystem. We describe such an abstraction through a set of logical layers. Thereby, we clarify\ndependencies among the aforementioned layers and, at the same time, a road-map emerges.","authors":["Daniele Cuomo","Marcello Caleffi","Angela Sara Cacciapuoti"],"meta":["May 2020","DOI:10.1049/iet-qtc.2020.0002"],"references":["349577854_Development_of_Quantum_Interconnects_QuICs_for_Next-Generation_Information_Technologies","339699758_When_Entanglement_Meets_Classical_Communications_Quantum_Teleportation_for_the_Quantum_Internet","338475344_Efficient_quantum_secret_sharing_without_a_trusted_player","337454545_Quantum_Internet_Networking_Challenges_in_Distributed_Quantum_Computing","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","341889043_The_Rise_of_the_Quantum_Internet","338788047_Quantum_Switch_for_the_Quantum_Internet_Noiseless_Communications_Through_Noisy_Channels","337784291_Ground-to-satellite_quantum_teleportation","336214343_Quantum_gold_rush_the_private_funding_pouring_into_quantum_start-ups","335509709_Quantum_Chemistry_in_the_Age_of_Quantum_Computing"]}