{"id":"341320511_Synaptic_Plasticity_Dynamics_for_Deep_Continuous_Local_Learning_DECOLLE","abstract":"A growing body of work underlines striking similarities between biological neural networks and recurrent, binary neural networks. A relatively smaller body of work, however, addresses the similarities between learning dynamics employed in deep artificial neural networks and synaptic plasticity in spiking neural networks. The challenge preventing this is largely caused by the discrepancy between the dynamical properties of synaptic plasticity and the requirements for gradient backpropagation. Learning algorithms that approximate gradient backpropagation using local error functions can overcome this challenge. Here, we introduce Deep Continuous Local Learning (DECOLLE), a spiking neural network equipped with local error functions for online learning with no memory overhead for computing gradients. DECOLLE is capable of learning deep spatio temporal representations from spikes relying solely on local information, making it compatible with neurobiology and neuromorphic hardware. Synaptic plasticity rules are derived systematically from user-defined cost functions and neural dynamics by leveraging existing autodifferentiation methods of machine learning frameworks. We benchmark our approach on the event-based neuromorphic dataset N-MNIST and DvsGesture, on which DECOLLE performs comparably to the state-of-the-art. DECOLLE networks provide continuously learning machines that are relevant to biology and supportive of event-based, low-power computer vision architectures matching the accuracies of conventional computers on tasks where temporal precision and speed are essential.","authors":["Jacques Kaiser","Hesham Mostafa","Emre Neftci"],"meta":["May 2020Frontiers in Neuroscience 14","DOI:10.3389/fnins.2020.00424"],"references":["350381274_Is_Neuromorphic_MNIST_Neuromorphic_Analyzing_the_Discriminative_Power_of_Neuromorphic_Datasets_in_the_Time_Domain","322548911_Loihi_A_Neuromorphic_Manycore_Processor_with_On-Chip_Learning","321180174_Deep_Supervised_Learning_Using_Local_Errors","343366881_Error-triggered_Three-Factor_Learning_Dynamics_for_Crossbar_Arrays","337037565_Surrogate_Gradient_Learning_in_Spiking_Neural_Networks_Bringing_the_Power_of_Gradient-Based_Optimization_to_Spiking_Neural_Networks","324055230_Long_short-term_memory_and_Learning-to-learn_in_networks_of_spiking_neurons","320965218_A_Low_Power_Fully_Event-Based_Gesture_Recognition_System","319770230_XNOR-Net_ImageNet_Classification_Using_Binary_Convolutional_Neural_Networks","319498129_Learning_in_the_Machine_the_Symmetries_of_the_Deep_Learning_Channel","317614308_Gradient_Descent_for_Spiking_Neural_Networks"]}