{"id":"341306008_A_virtual_Werkstatt_for_digitization_in_the_sciences","abstract":"Data is central in almost all scientific disciplines nowadays. Furthermore, intelligent systems have developed rapidly in recent years, so that in many disciplines the expectation is emerging that with the help of intelligent systems, significant challenges can be overcome and science can be done in completely new ways. In order for this to succeed, however, first, fundamental research in computer science is still required, and, second, generic tools must be developed on which specialized solutions can be built. In this paper, we introduce a recently started collaborative project funded by the Carl Zeiss Foundation, a virtual manufactory for digitization in the sciences, the “Werkstatt”, which is being established at the Michael Stifel Center Jena (MSCJ) for data-driven and simulation science to address fundamental questions in computer science and applications. The Werkstatt focuses on three key areas, which include generic tools for machine learning, knowledge generation using machine learning processes, and semantic methods for the data life cycle, as well as the application of these topics in different disciplines. Core and pilot projects address the key aspects of the topics and form the basis for sustainable work in the Werkstatt.","authors":["Sheeba Samuel","Maha Shadaydeh","Sebastian Böcker","Bernd Brügmann"],"meta":["May 2020Research Ideas and Outcomes 6(4)","DOI:10.3897/rio.6.e54106"],"references":["336819520_Time-Frequency_Causal_Inference_Uncovers_Anomalous_Events_in_Environmental_Systems","336819042_Nonlinear_Causal_Link_Estimation_Under_Hidden_Confounding_with_an_Application_to_Time_Series_Anomaly_Detection","334208079_LAB-QA2GO_A_Free_Easy-to-Use_Toolbox_for_the_Quality_Assessment_of_Magnetic_Resonance_Imaging_Data","333782078_Inferring_causation_from_time_series_in_Earth_system_sciences","323655197_Knowledge_Graphs_in_the_Libraries_and_Digital_Humanities_Domain","332791612_Denoising_Gravitational_Waves_with_Enhanced_Deep_Recurrent_Denoising_Auto-encoders","323405573_Deep_neural_networks_to_enable_real-time_multimessenger_astrophysics","320887429_Post-radiochemotherapy_PET_radiomics_in_head_and_neck_cancer_-_The_influence_of_radiomics_implementation_on_the_reproducibility_of_local_control_tumor_models","320333535_PROV-O_The_PROV_Ontology","319174731_Comparison_of_PET_and_CT_radiomics_for_prediction_of_local_tumor_control_in_head_and_neck_squamous_cell_carcinoma"]}