{"id":"341305394_How_many_qubits_are_needed_for_quantum_computational_supremacy","abstract":"Quantum computational supremacy arguments, which describe a way for a quantum computer to perform a task that cannot also be done by a classical computer, typically require some sort of computational assumption related to the limitations of classical computation. One common assumption is that the polynomial hierarchy ($\\mathsf{PH}$) does not collapse, a stronger version of the statement that $\\mathsf{P} \\neq \\mathsf{NP}$, which leads to the conclusion that any classical simulation of certain families of quantum circuits requires time scaling worse than any polynomial in the size of the circuits. However, the asymptotic nature of this conclusion prevents us from calculating exactly how many qubits these quantum circuits must have for their classical simulation to be intractable on modern classical supercomputers. We refine these quantum computational supremacy arguments and perform such a calculation by imposing fine-grained versions of the non-collapse conjecture. Our first two conjectures poly3-NSETH($a$) and per-int-NSETH($b$) take specific classical counting problems related to the number of zeros of a degree-3 polynomial in $n$ variables over $\\mathbb{F}_2$ or the permanent of an $n \\times n$ integer-valued matrix, and assert that any non-deterministic algorithm that solves them requires $2^{cn}$ time steps, where $c \\in \\{a,b\\}$. A third conjecture poly3-ave-SBSETH($a'$) asserts a similar statement about average-case algorithms living in the exponential-time version of the complexity class $\\mathsf{SBP}$. We analyze evidence for these conjectures and argue that they are plausible when $a=1/2$, $b = 0.999$ and $a' = 1/2$.\n\nImposing poly3-NSETH(1/2) and per-int-NSETH(0.999), and assuming that the runtime of a hypothetical quantum circuit simulation algorithm would scale linearly with the number of gates/constraints/optical elements, we conclude that Instantaneous Quantum Polynomial-Time (IQP) circuits with 208 qubits and 500 gates, Quantum Approximate Optimization Algorithm (QAOA) circuits with 420 qubits and 500 constraints and boson sampling circuits (i.e. linear optical networks) with 98 photons and 500 optical elements are large enough for the task of producing samples from their output distributions up to constant multiplicative error to be intractable on current technology. Imposing poly3-ave-SBSETH(1/2), we additionally rule out simulations with constant additive error for IQP and QAOA circuits of the same size. Without the assumption of linearly increasing simulation time, we can make analogous statements for circuits with slightly fewer qubits but requiring $10^4$ to $10^7$ gates.","authors":["Alexander M. Dalzell","Aram W. Harrow","Dax Enshan Koh","Rolando L. La Placa"],"meta":["May 2020Quantum 4:264","DOI:10.22331/q-2020-05-11-264"],"references":["336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","328581827_On_the_complexity_and_verification_of_quantum_random_circuit_sampling","327738023_Generalized_Kakeya_sets_for_polynomial_evaluation_and_faster_computation_of_fermionants","321374688_Merlin-Arthur_with_efficient_quantum_Merlin_and_quantum_supremacy_for_the_second_level_of_the_Fourier_hierarchy","321140103_Quantum_Resource_Estimates_for_Computing_Elliptic_Curve_Discrete_Logarithms","345483290_Additive-error_fine-grained_quantum_supremacy","345224477_Combinatorial_Mathematics","340421635_Worst-Case_to_Average-Case_Reductions_for_Subclasses_of_P","325212657_Impossibility_of_Classically_Simulating_One-Clean-Qubit_Model_with_Multiplicative_Error","322215967_The_Classical_Complexity_of_Boson_Sampling"]}