{"id":"341321270_Data-driven_analysis_using_multiple_self-report_questionnaires_to_identify_college_students_at_high_risk_of_depressive_disorder","abstract":"Depression diagnosis is one of the most important issues in psychiatry. Depression is a complicated mental illness that varies in symptoms and requires patient cooperation. In the present study, we demonstrated a novel data-driven attempt to diagnose depressive disorder based on clinical questionnaires. It includes deep learning, multi-modal representation, and interpretability to overcome the limitations of the data-driven approach in clinical application. We implemented a shared representation model between three different questionnaire forms to represent questionnaire responses in the same latent space. Based on this, we proposed two data-driven diagnostic methods; unsupervised and semi-supervised. We compared them with a cut-off screening method, which is a traditional diagnostic method for depression. The unsupervised method considered more items, relative to the screening method, but showed lower performance because it maximized the difference between groups. In contrast, the semi-supervised method adjusted for bias using information from the screening method and showed higher performance. In addition, we provided the interpretation of diagnosis and statistical analysis of information using local interpretable model-agnostic explanations and ordinal logistic regression. The proposed data-driven framework demonstrated the feasibility of analyzing depressed patients with items directly or indirectly related to depression.","authors":["Bongjae Choi","Geumsook Shim","Bumseok Jeong","Sungho Jo"],"meta":["December 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-64709-7"],"references":["328753523_Predicting_the_naturalistic_course_of_depression_from_a_wide_range_of_clinical_psychological_and_biological_data_a_machine_learning_approach","328699699_Predicting_Suicidal_Ideation_in_College_Students_with_Mental_Health_Screening_Questionnaires","327777842_Identification_of_depression_subtypes_and_relevant_brain_regions_using_a_data-driven_approach","323991296_Data-based_Decision_Rules_to_Personalize_Depression_Follow-up","313966621_Self-Report_Questionnaires","325680085_Sticks_stones_and_hurtful_words_Relative_effects_of_various_forms_of_childhood_maltreatment","322276906_Adaptive_Control_Processes_A_Guided_Tour","319770216_Deconstructing_the_Ladder_Network_Architecture","317086380_MISSING_DATA_IMPUTATION_IN_THE_ELECTRONIC_HEALTH_RECORD_USING_DEEPLY_LEARNED_AUTOENCODERS","310743154_MISSING_DATA_IMPUTATION_IN_THE_ELECTRONIC_HEALTH_RECORD_USING_DEEPLY_LEARNED_AUTOENCODERS"]}