{"id":"341404395_Big_Educational_Data_Analytics_Survey_Architecture_and_Challenges","abstract":"The proliferation of mobile devices and the rapid development of information and communication technologies (ICT) have seen increasingly large volume and variety of data being generated at an unprecedented pace. Big data have started to demonstrate significant values in higher education. This paper gives several contributions to the state-of-the-art for Big data in higher education and learning technologies research. Currently, there is no comprehensive survey or literature review for Big educational data. Most literature reviews from a few authors have focused on one of these fields: educational mining, learning analytics with discussions on one or two aspects such as Big data technologies without educational focus, social media data in education, etc. Most of these literature reviews are short and insufficient to provide more inclusive reviews for Big educational data. In this paper, we present a comprehensive literature review of the current and emerging paradigms for Big educational data. The survey is presented in five parts: (1) The first part presents an overview and classification of Big education research to show the full landscape in this field, which also gives a concise summary of the overall scope of this paper; (2) The second part presents a discussion for the various data sources from education platforms or systems including learning management systems (LMS), massive open online courses (MOOC), learning object repository (LOR), OpenCourseWare (OCW), open educational resources (OER), social media, linked data and mobile learning contributing to Big education data; (3) The third part presents the data collection, data mining and databases in Big education data; (4) The fourth part presents the technological aspects including Big data platforms and architectures such as Hadoop, Spark, Samza and Big data tools for Big education data; and (5) The fifth part presents different approaches of data analytics for Big education data. This part provides a more inclusive discussion on data analytics which is beyond traditional forms of learning analysis in higher education. This includes predictive analytics, learning analytics including collaborative, behavior, personal learnings and assessment, followed by recommendation systems, graph analytics, visual analytics, immersive learning and analytics, etc. The final part of the paper discusses social (e.g. privacy and ethical issues) and technological challenges for Big data in education. This part also illustrates the technological challenges faced by giving an example for utilizing graph-based analytics for a crossinstitution learning analytics scenario.","authors":["Li-Minn Ang","Feng Lu Ge","Kah Phooi Seng"],"meta":["May 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2994561"],"references":["329138623_Learning_Analytics_Platform_in_Higher_Education_in_Japan","337805127_Design_and_implementation_of_data_collection_mechanism_for_3D_design_course_based_on_xAPI_standard","330387714_Educational_Data_Mining_and_Learning_Analytics_for_21st_century_higher_education_A_Review_and_Synthesis","330119609_Design_and_Implementation_of_Early_Warning_System_Based_on_Educational_Big_Data","328624166_Design_and_Evaluate_Immersive_Learning_Experience_for_Massive_Open_Online_Courses_MOOCs","328610056_Design_and_Implementation_of_Personalized_Recommendation_System_under_Big_Data_Platform","328609734_Text_Mining_for_Educational_Literature_on_Big_Data_with_Hadoop","327737135_Early_segmentation_of_students_according_to_their_academic_performance_A_predictive_modelling_approach","327289618_An_Enhanced_xAPI_Data_Model_Supporting_Assessment_Analytics","326967110_Analysis_of_student_behavior_in_learning_management_systems_through_a_Big_Data_framework"]}