{"id":"341466727_Deep_Learning_Based_Automatic_Multiclass_Wild_Pest_Monitoring_Approach_Using_Hybrid_Global_and_Local_Activated_Features","abstract":"Specialized control of pests and diseases have been a high-priority issue for agriculture industry in many countries. On account of automation and cost-effectiveness, image analytic based pest recognition systems are widely utilized in practical crops prevention applications. But due to powerless handcrafted features, current image analytic approaches achieve low accuracy and poor robustness in practical large-scale multi-class pest detection and recognition. To tackle this problem, this paper proposes a novel deep learning based automatic approach using hybrid and local activated features for pest monitoring solution. In the presented method, we exploit the global information from feature maps to build our Global activated Feature Pyramid Network (GaFPN) to extract pests' highly discriminative features across various scales over both depth and position levels. It makes changes of depth or spatial sensitive features in pest images more visible during downsampling. Next, an improved pest localization module named Local activated Region Proposal Network (LaRPN) is proposed to find the precise pest objects' positions by augmenting contextualized and attentional information for feature completion and enhancement in local level. The approach is evaluated on our 7-year large-scale pest dataset containing 88.6K images (16 types of pests) with 582.1K manually labelled pest objects. The experimental results show that our solution performs over 75.03% mAP in industrial circumstances, which outweighs two other state-of-the-art methods: Faster R-CNN with mAP up to 70% and FPN mAP up to 72%. Our code and dataset will be made publicly available.","authors":["Liu Liu","Chengjun Xie","Rujing Wang","Po Yang"],"meta":["May 2020IEEE Transactions on Industrial Informatics PP(99):1-1","DOI:10.1109/TII.2020.2995208","Project: Innovate UK (UK-China: Precision for Enhancing Agriculture Productivity): \"Farmer-centred Interoperable Mobile-Cloud System: Integrating Data from Farming Activities and Environmental Information for Sustainable Fertiliser Management\""],"references":["320070245_A_Multispectral_3-D_Vision_System_for_Invertebrate_Detection_on_Crops","339710242_Aerial_Visual_Perception_in_Smart_Farming_Field_Study_of_Wheat_Yellow_Rust_Monitoring","332773033_A_Granular_GA-SVM_Predictor_for_Big_Data_in_Agricultural_Cyber-Physical_Systems","329897940_A_Novel_Semi-supervised_Deep_Learning_Method_for_Human_Activity_Recognition","328205168_Automatic_Fruit_Classification_Using_Deep_Learning_for_Industrial_Applications","327992194_Transfer_learning_for_the_classification_of_sugar_beet_and_volunteer_potato_under_field_conditions","324996175_Understanding_Convolution_for_Semantic_Segmentation","323375434_An_Efficient_Deep_Learning_Model_to_Predict_Cloud_Workload_for_Industry_Informatics","320964510_Feature_Pyramid_Networks_for_Object_Detection","320425492_The_impact_of_FDI_in_land_in_agriculture_in_developing_countries_on_host_country_food_security"]}