{"id":"341491955_CoronaVirus_COVID-19_and_Online_Learning_in_Higher_Institutions_of_Education_A_Survey_of_the_Perceptions_of_Ghanaian_International_Students_in_China","abstract":"The first quarter of 2020 is a hard time for the global community. The Coronavirus (COVID-19) pandemics swept through the world affected many aspects of human endeavour: from the decline in industrial production to the re-adjustments in the academic calendar of all educational institutions globally. Stakeholders and management of higher educational institutions have no other option but to make use of internet technology, thus online learning for the continuation of academic activities across all schools worldwide.\nThis paper aims at assessing whether Ghanaian international students in China are satisfied with the ‘‘ mass’’ online learning in higher educational institutions in Beijing, China.\nTherefore, this study employed an online survey to investigate the level of satisfaction of online learning in higher educational institutions and how Ghanaian international students are coping with these ‘‘new initiatives’’.\nThe findings from the study suggest that the implementation of online learning programs was a very great idea as the majority of the sampled students supported the initiative. The study also revealed that students have adequate knowledge of the COVID-19 pandemic. Another finding that came up during the research is the high cost of participating in online learning. However, our results showed that students outside China due to the COVID-19 spend so much money to buy internet data for online learning. Last but not least, the study discovered that internet connectivity was very slow for students leaving within the dormitories of various universities in China.\nThe findings from this study will be of much benefit to university administrators and management in taking future emergency decisions concerning the implementation of online learning programs for student’s different backgrounds.","authors":["John Demuyakor"],"meta":["May 2020","DOI:10.29333/ojcmt/8286"],"references":["332558816_Audio_peer_feedback_to_promote_deep_learning_in_online_education","327724957_The_instructor's_gaze_guidance_in_video_lectures_improves_learning","319452611_Theories_and_Frameworks_for_Online_Education_Seeking_an_Integrated_Model","345801656_Book_Review_Qualitative_Research_A_Guide_to_Design_and_Implementation_4th_ed_by_S_B_Merriam_and_E_J_Tisdell","345676374_Learning_Theory_and_Online_Technologies","341060073_COVID-19_and_emergency_eLearning_Consequences_of_the_securitization_of_higher_education_for_post-pandemic_pedagogy","340493657_COVID-19_and_online_teaching_in_higher_education_A_case_study_of_Peking_University","327412417_Massive_open_online_courses_as_a_knowledge_base_for_teachers","324750945_Study_on_student_performance_estimation_student_progress_analysis_and_student_potential_prediction_based_on_data_mining","315741719_Information_problem-solving_skills_in_small_virtual_groups_and_learning_outcomes"]}