{"id":"341482031_A_comparative_analysis_of_two_computer_science_degree_offerings","abstract":"This article presents an in-depth analysis and comparison of two computer science degree offerings, viz.. The analysis is based on the student transcripts collected from the academic systems of both institutions over circa one decade. The article starts with a description of the degrees and global statistics of the student population considered. Then, it presents a comparative analysis of the curricula, which focuses on how close students follow the recommended curricula, based on data visualization techniques and academic performance indexes. The indexes indicated a mismatch between the semesters that the curricula recommend for the courses and the semesters that students enroll in those courses. Furthermore, a visualization of course advances and delays indicated that a significant fraction of the students failed in the semester that the curricula recommend for the courses. The article moves on to present a comparative analysis of student performance in individual courses, and then applies a technique borrowed from Market Basket Analysis to investigate student performance in multiple courses that are taken in the same semester. The analysis pointed out sets of courses, at both degrees, that students are struggling with, when they take the courses in the same semester. Finally, the article summarizes the lessons learned, which invite academic administrators to reflect on the weaknesses and strengths of each degree analyzed. Specifically, the analysis suggests that the curricula should be reorganized to avoid that students take certain courses together, not because of conceptual reasons, but because students frequently fail if they do so. Some of these patterns are common to both degrees.","authors":["Anna Carolina Finamore","Haydee Guillot Jimenez","Marco A. Casanova","Bernardo Pereira Nunes"],"meta":["May 2020Journal of the Brazilian Computer Society 26(3)","DOI:10.1186/s13173-020-00097-0","Project: Formative Assessment"],"references":["321707620_KNOWLEDGE_DISCOVERY_FROM_EDUCATIONAL_DATABASE_USING_APRIORI_ALGORITHM","320993269_Using_Learning_Analytics_and_Visualization_Techniques_to_Evaluate_the_Structure_of_Higher_Education_Curricula","318976057_An_Analysis_of_Degree_Curricula_through_Mining_Student_Records","312509093_A_Systematic_Review_on_Educational_Data_Mining","303042386_Mining_Association_Rules_in_Students_Assessment_Data","313606501_Mining_Association_rules_between_sets_of_items_in_large_databases","300852781_Investigating_performance_of_students","290554498_Knowledge_mining_from_student_data","290363099_Mining_of_massive_datasets_Second_edition","290035534_Investigating_performances's_progress_of_students"]}