{"id":"341401297_Evaluating_COs_of_computer_programming_course_for_OBE-based_BSc_in_EEE_program","abstract":"It is an important and challenging task to develop concepts and skills of undergraduate engineering students in computer programming course and hence their evaluation on higher order skills. Already several methods are developed to evaluate the students of this course for various engineering programs, but a method for undergraduate electrical and electronic engineering (EEE) program was not found in the literature. In this paper, a simple evaluation method for the students of computer programming course of undergraduate EEE (BSc in EEE) program has been reported using result-oriented learning. Detail methodology, course syllabus design, course outcomes (COs) and mapping it with program outcomes (POs) of BSc in EEE, question setting following Bloom’s taxonomy, laboratory experiment, assessment plan, course and PO evaluation data and graphs have been presented along with relevant statistics. All data are presented for a cohort of students who took this course in summer 2019 Semester at EEE Department of Southeast University. It has been observed that the target set by the course teacher has been achieved by the students. Recommendations of the course teacher for further improvement of the COs’ achievement have also been presented. Keywords: CO evaluation, programming course, OBE","authors":["Muhibul Haque Bhuyan","Azwad Tamir"],"meta":["April 2020International Journal of Learning and Teaching 12(2):86-99","DOI:10.18844/ijlt.v12i2.4576","Project: EEE Department Development Project"],"references":["336107618_Course_Outcome_Attainments_in_OBE_for_Weak_Students","325053078_Motivating_Students_in_Electrical_Circuit_Course","322117637_Implementation_and_assessment_of_outcome_based_education_in_engineering_education","317735880_LECTURE_BASED_MAPPING_TOWARDS_ACHIEVING_EXCELLENCE_IN_OUTCOME_BASED_EDUCATION_OBE_FRAMEWORK","317266548_Program_Outcomes_Assessment_Method_for_Multi-Academic_Accreditation_Bodies_Computer_Science_Program_as_a_Case_Study","313674467_Program_Outcomes_Assessment_Using_Key_Performance_Indicators","313426153_Continuous_quality_improvement_CQI_framework_A_case_of_industrial_engineering_department","292615900_Teaching_Electrical_Circuits_Course_for_Electrical_Engineering_Students_in_Cognitive_Domain","281965127_Teaching_Analog_Electronics_Course_for_Electrical_Engineering_Students_in_Cognitive_Domain","344527136_THE_PROCESS_OF_OUTCOME-BASED_EDUCATION_-_Implementation_Assessment_and_Evaluations"]}