{"id":"341497067_Cardiomegaly_Detection_on_Chest_Radiographs_Segmentation_Versus_Classification","abstract":"In this study, we investigate the detection of cardiomegaly on frontal chest radiographs through two alternative deep-learning approaches - via anatomical segmentation and via image-level classification. We used the publicly available ChestX-ray14 dataset, and obtained heart and lung segmentation annotations for 778 chest radiographs for the development of the segmentation-based approach. The classification-based method was trained with 65k standard chest radiographs with image-level labels. For both approaches, the best models were found through hyperparameter searches where architectural, learning, and regularization related parameters were optimized systematically. The resulting models were tested on a set of 367 held-out images for which cardiomegaly annotations were hand-labeled by two independent expert radiologists. Sensitivity, specificity, positive predictive value, negative predictive value, and area under the receiver operating characteristic curve (AUC) were calculated. The performance of the segmentation-based system with an AUC of 0.977 is significantly better for classifying cardiomegaly than the classification-based model which achieved an AUC of 0.941. Only the segmentation-based model achieved comparable performance to an independent expert reader (AUC of 0.978). We conclude that the segmentation-based model requires 100 times fewer annotated chest radiographs to achieve a substantially better performance, while also producing more interpretable results.","authors":["Ecem Sogancioglu","Keelin Murphy","Erdi Calli","Ernst Th Scholten"],"meta":["May 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2995567"],"references":["337921285_MIMIC-CXR_a_de-identified_publicly_available_database_of_chest_radiographs_with_free-text_reports","329078287_Deep_learning_for_chest_radiograph_diagnosis_A_retrospective_comparison_of_the_CheXNeXt_algorithm_to_practicing_radiologists","328800804_Deep_Learning_for_Grading_Cardiomegaly_Severity_in_Chest_X-Rays_An_Investigation","328382634_Automatic_liver_tumor_segmentation_in_CT_with_fully_convolutional_neural_networks_and_object-based_postprocessing","323597745_Comparison_of_Deep_Learning_Approaches_for_Multi-Label_Chest_X-Ray_Classification","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","337069071_Exploring_Large-scale_Public_Medical_Image_Datasets","332062855_Automatic_Cardiothoracic_Ratio_Calculation_With_Deep_Learning","331720817_Handling_label_noise_through_model_confidence_and_uncertainty_application_to_chest_radiograph_classification","328986712_CardioXNet_Automated_Detection_for_Cardiomegaly_Based_on_Deep_Learning"]}