{"id":"341406221_Big_Data_Driven_Tree_Detection_in_Suburban_Scenes","abstract":"The aim of the work described in this paper is to detect trees in eye level view images. Unlike previous work which all but universally considers highly constrained environments such as natural parks and wooded areas, or simple scenes with little clutter and clear tree separation, our focus is on much more challenging suburban scenes which are rich in clutter highly variable in type and appearance (houses, falls, shrubs, cars, bicycles, pedestrians, hydrants, lamp posts, etc.). Thus we motivate and introduce three different approaches: (i) a conventional computer vision based, employing manually engineered steps and making use of explicit human knowledge of the application domain, (ii) a more machine learning oriented approach which learns from densely extracted local features in the form of SIFT, and (iii) a machine learning based approach which employs both colour and appearance models as a means of making the most of available discriminative information. We also make a significant contribution in regards to the collection of training and evaluation data. In contrast to the existing work which relies on manual data collection (thus risking unintended bias) or corpora constrained in variability and limited in size (thus not allowing for reliable generalization inferences to be made), we show how large amounts of representative data can be collected automatically using freely available tools such as Google's Street View and equally automatically processed to produce a large corpus of minimally biased imagery. Using a large data set collected in the manner and comprising tends of thousands of images we confirm our theoretical arguments which motivated our machine learning based and colour aware histograms of oriented gradients based method which achieved recall of 95% and precision of 97%.","authors":["Andrew Thirwell","Ognjen Arandjelovic"],"meta":["May 2020Sensors 20(11)","DOI:10.3390/s20113051","Project: Object Recognition"],"references":["339989682_Visual_Reconstruction_of_Ancient_Coins_Using_Cycle-Consistent_Generative_Adversarial_Networks","321065008_Arbitrary-Oriented_Vehicle_Detection_in_Aerial_Imagery_with_Single_Convolutional_Neural_Networks","275277272_Representations_of_colour_images_in_different_colour_spaces","259397310_Comparative_testing_of_single-tree_detection_algorithms_under_different_types_of_forest","237842999_Matching_objects_across_the_textured-smooth_continuum","228876216_Adaptive_methods_for_individual_tree_detection_on_airborne_laser_based_canopy_height_model","309446441_Precision_Forestry_Trees_Counting_in_Urban_Areas_Using_Visible_Imagery_based_on_an_Unmanned_Aerial_Vehicle","275040323_Efficient_and_accurate_set-based_registration_of_time-separated_aerial_images","263012330_Why_do_linear_SVMs_trained_on_HOG_features_perform_so_well","256822505_Colour_invariants_under_a_non-linear_photometric_camera_model_and_their_application_to_face_recognition_from_video"]}