{"id":"341461282_Diversity_and_equality_in_honours_and_awards_programs_-_steps_towards_a_fair_representation_of_membership","abstract":"Honours and awards bestowed by professional societies recognize and reward members who have advanced the goals and values of that society. All too often, however, awards reflect a small network of people who know about the awards and participate in the process. This network works wonderfully for the people lucky enough to be in it, but typically neglects the full range and breadth of scholarship and service within the society. We represent a combined 15+ years' experience on the honours' committee for a large professional society (the American Geophysical Union) and here offer strategies to increase the representation of honourees. Women represented less than 20 % of awardees when we first became committee members in 2008; women represented 50 % of awardees in 2019. There is still much to do to ensure that members from other typically under-represented groups (non-US members, members from under-represented races/ethnicities) are truly represented and honoured for outstanding science and service. We recommend forming canvassing committees that will scour the literature, conferences, and membership lists for appropriate and otherwise overlooked nominees; providing implicit bias training to selection committees; and ensuring selection committees focus on the criteria for the award rather than non-pertinent, often personal, information, as well as additional strategies that allow us to recognize our worthy colleagues.","authors":["Mary Anne Holmes","LaToya Myles","Blair Schneider"],"meta":["May 2020Advances in Geosciences 53:41-51","DOI:10.5194/adgeo-53-41-2020"],"references":["335614360_Gender_and_societies_A_grassroots_approach_to_women_in_science","319030351_Constrained_Choices_A_View_of_Campus_Service_Inequality_From_Annual_Faculty_Reports","307089948_Bias_in_grading_A_meta-analysis_of_experimental_research_findings","304803045_Men_Set_Their_Own_Cites_High_Gender_and_Self-citation_across_Fields_and_over_Time","335901174_Advancing_inclusion_in_the_geosciences_An_overview_of_the_NSF-GOLD_program","331552911_Equal_Representation_in_Scientific_Honors_Starts_with_Nominations","319906108_AGU_Revises_Its_Integrity_and_Ethics_Policy","304611500_Gender_Equity_Deserves_the_Attention_of_Our_Societies","303119179_Double_Jeopardy_An_Empirical_Study_with_Implications_for_the_Debates_over_Implicit_Bias_and_Intersectionality","285827880_Thinking_Fast_and_Slow"]}