{"id":"341437425_Blame_It_on_the_Self-Driving_Car_How_Autonomous_Vehicles_Can_Alter_Consumer_Morality","abstract":"Autonomous vehicles (AVs) are expected to soon replace human drivers and promise substantial benefits to society. Yet, consumers remain skeptical about handing over control to an AV. Partly due to the uncertainty about the appropriate moral norms for such vehicles (e.g., should AVs protect the passenger or the pedestrian if harm is unavoidable?). Building on recent work on AV morality, the current research examined how people resolve the dilemma between protecting self versus a pedestrian, and what they expect an AV to do in a similar situation. Five studies revealed that participants considered harm to a pedestrian more permissible with an AV as compared to self as the decision agent in a regular car. This shift in moral judgments was driven by the attribution of responsibility to the AV and was observed for both severe and moderate harm, and when harm was real or imagined. However, the effect was attenuated when five pedestrians or a child could be harmed. These findings suggest that AVs can change prevailing moral norms and promote an increased self-interest among consumers. This has relevance for the design and policy issues related to AVs. It also highlights the moral implications of autonomous agents replacing human decision-makers.","authors":["Tripat Gill"],"meta":["May 2020Journal of Consumer Research","DOI:10.1093/jcr/ucaa018","Project: Consumer Behavior with AI & Autonomous Vehicles"],"references":["332550851_Resistance_to_Medical_Artificial_Intelligence","332233097_Holding_Robots_Responsible_The_Elements_of_Machine_Morality","328491510_The_Moral_Machine_Experiment","319633471_The_Ethical_Knob_ethically-customisable_automated_vehicles_and_the_law","319630815_Psychological_roadblocks_to_the_adoption_of_self-driving_vehicles","318830422_Algorithmic_Bias_in_Autonomous_Systems","334487491_Task-Dependent_Algorithm_Aversion","325671748_The_emotional_dog_and_its_rational_tail_A_social_intuitionist_approach_to_moral_judgment","325056192_Of_Mice_Men_and_Trolleys_Hypothetical_Judgment_Versus_Real-Life_Behavior_in_Trolley-Style_Moral_Dilemmas","324902667_Ownership_The_Extended_Self_and_the_Extended_Object"]}