{"id":"341448640_Digital_health_and_the_COVID-19_epidemic_An_assessment_framework_for_apps_from_an_epidemiological_and_legal_perspective","abstract":"As COVID-19 spreads across the globe, crowdsourced digital technology harbours the potential to improve surveillance and epidemic control, primarily through increased information coverage, higher information speed, fast case tracking and improved proximity tracing. Targeting those aims, COVID-19-related smartphone and web-based health applications are continuously emerging, leading to a multitude of options, raising ethical and legal challenges and potentially overwhelming end users. Building on an existing trustworthiness checklist for digital health applications, we searched the literature and developed a framework to guide the assessment of smartphone and web-based applications that aim to contribute to controlling the current epidemic or mitigating its effects. It further integrates epidemiological subject knowledge and a legal analysis, outlining the mechanisms through which new applications can support the fight against COVID-19. The resulting framework includes 40 questions across 8 domains on “purpose”, “usability”, “information accuracy”, “organisational attributes / reputation”, “transparency”, “privacy” and “user control / self-determination”. All questions should be primarily answerable from publicly available data, as provided by application manufacturers. The framework aims to guide end users in choosing a transparent, safe and valuable application and suggests a set of information items that developers ideally make available to allow a balanced judgement and facilitate the trustworthiness of their products.","authors":["Kerstin Noëlle Vokinger","Vasileios Nittas","Claudia M Witt","Sara Irina Fabrikant"],"meta":["May 2020Swiss medical weekly: official journal of the Swiss Society of Infectious Diseases, the Swiss Society of Internal Medicine, the Swiss Society of Pneumology 150(19)","DOI:10.4414/smw.2020.20282"],"references":["340970220_Lost_in_Anonymization_-_A_Data_Anonymization_Reference_Classification_Merging_Legal_and_Technical_Considerations","340654328_Temporal_dynamics_in_viral_shedding_and_transmissibility_of_COVID-19","340572122_Sinonasal_pathophysiology_of_SARS-CoV-2_and_COVID-19_A_systematic_review_of_the_current_evidence","340316786_Quantifying_SARS-CoV-2_transmission_suggests_epidemic_control_with_digital_contact_tracing","340244795_Asymptomatic_and_Presymptomatic_SARS-CoV-2_Infections_in_Residents_of_a_Long-Term_Care_Skilled_Nursing_Facility_-_King_County_Washington_March_2020","340076795_Crowdsourcing_data_to_mitigate_epidemics","356347626_Gesundheitsdaten_im_digitalen_Zeitalter","351133458_Die_digitale_Bekampfung_von_Covid-19_und_die_Rolle_des_Bundesrates","340369849_Presymptomatic_transmission_of_SARS-CoV-2_-_Singapore_January_23-March_16_2020","340108912_Aggregated_mobility_data_could_help_fight_COVID-19"]}