{"id":"341489675_Identity_Impairment_as_a_Central_Dimension_in_Personality_Pathology","abstract":"Section III of the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-5) includes an alternative model for diagnosing personality disorders (PDs). This model highlights identity impairment as a potential criterion of all PDs, which has stimulated researchers to characterize identity functioning across PD presentations. Accordingly, the present study examined associations between dimensions of identity functioning and PD symptomatology among 242 Flemish community adults (49.2% female; Mage = 42.76, SD = 14.42). Participants completed the Self-Concept and Identity Measure (Kaufman, Cundiff, & Crowell, 2015) to assess identity functioning and the Assessment of DSM-IV Personality Disorders (Schotte, De Doncker, Vankerckhoven, Vertommen, & Cosyns, 1998) to assess dimensionally measured PDs. A correlational analysis yielded negative associations between the consolidated identity subscale and all PDs, whereas scores on both disturbed identity and lack of identity scales were positively associated with PDs. A multivariate regression analysis indicated that the consolidated identity scale did not account for unique variance in PD dimensions. Disturbed identity and lack of identity scale scores positively predicted variance in all PDs, with the lack of identity scale being the stronger predictor of symptoms of paranoid, schizotypal, and borderline PDs. Study findings generally support identity impairment as a central dimension in PD symptomatology in a Flemish community sample.","authors":["Annabel Bogaerts","Koen Luyckx","Tim Bastiaens","Erin Anne Kaufman"],"meta":["March 2021Journal of Psychopathology and Behavioral Assessment 43(1)","DOI:10.1007/s10862-020-09804-9"],"references":["325081263_Biological_and_Behavioral_Mechanisms_of_Identity_Pathology_Development_An_Integrative_Review","315772279_Identity_Statuses_throughout_Adolescence_and_Emerging_Adulthood_A_Large-Scale_Study_into_Gender_Age_and_Contextual_Differences","330681319_Replication_of_the_Self-Concept_and_Identity_Measure_SCIM_Among_a_Treatment-Seeking_Sample","324938813_Criterion_A_of_the_AMPD_in_HiTOP","322194858_The_Dutch_Self-Concept_and_Identity_Measure_SCIM_Factor_structure_and_associations_with_identity_dimensions_and_psychopathology","319971764_Advances_in_Transference-Focused_Psychotherapy_Derived_from_the_Study_of_Borderline_Personality_Disorder_Clinical_Insights_With_a_Focus_on_Mechanism","295787544_ADP-IV_questionnaire_Aspects_of_reliability_and_validity","284055206_A_Psychoanalytic_Theory_of_Personality_Disorders","279796507_Common_Method_Biases_in_Behavioral_Research_A_Critical_Review_of_the_Literature_and_Recommended_Remedies","277429791_Prevalence_and_correlates_of_personality_disorders_in_a_community_sample"]}