{"id":"341403275_Where's_the_Science_Exploring_a_New_Science_Teacher_Educator's_Theoretical_and_Practical_Understandings_of_Scientific_Inquiry","abstract":"The purpose for this self-study was to explore the theoretical and practical understandings of scientific inquiry inherent in our elementary teacher preparation program, specifically those of new instructors. Although scientific inquiry and inquiry-based learning are emphasized in our program, several new instructors, doctoral students hired to teach undergraduate courses, expressed some discomfort with the lesser amount of traditional science content that could be found in the course syllabi. To support their development and our own understandings of how to guide them as they begin teaching in higher education, it was important that we understood the transition in regard to teaching scientific inquiry and using inquiry-based pedagogy. Thus, we conducted this collaborative self-study on how a new instructor, experiencing such discomfort, was experiencing a transition in which her epistemology of science was being challenged. The implications of the findings, which derived from critical friend meetings, journal entries, and student artifacts from the scientific inquiry course she taught, serve to inform the field of science education in terms of new science teacher educators moving from a traditional teacher-centered science classroom into a student-centered classroom.","authors":["Kerri Donohue","Gayle A. Buck","Valarie L. Akerson"],"meta":["November 2019International Journal of Research in Education and Science 6(1):1","DOI:10.46328/ijres.v6i1.571"],"references":["304371954_Promoting_Student_Agency_in_Science_Inquiry_A_Self-Study_of_Relational_Pedagogical_Practices_in_Science_Teacher_Education","302028450_Photovoice_as_a_Teaching_Tool_Learning_by_Doing_with_Visual_Methods","295938595_Students_Learning_to_Use_the_Skills_Used_by_Practicing_Scientists","321610589_International_Handbook_of_Self-Study_of_Teaching_and_Teacher_Education_Practices","319021966_Currere_Unexpected_Journeys_and_Unplanned_Destinations_in_Academia","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","313092183_Transformative_learning_theory_to_practice_New_Directions_for_Adult_and_Continuing_Education","303638311_The_Transformation_from_Expert_Science_Teacher_to_Science_Teacher_Educator","296825482_Influence_of_a_reflective_explicit_activity-based_approach_on_elementary_teachers'_conceptions_of_nature_of_science","290989627_Becoming_Qualitative_Researchers_An_Introduction"]}