{"id":"341460934_Influence_of_tweets_and_diversification_on_serendipitous_research_paper_recommender_systems","abstract":"In recent years, a large body of literature has accumulated around the topic of research paper recommender systems. However, since most studies have focused on the variable of accuracy, they have overlooked the serendipity of recommendations, which is an important determinant of user satisfaction. Serendipity is concerned with the relevance and unexpectedness of recommendations, and so serendipitous items are considered those which positively surprise users. The purpose of this article was to examine two key research questions: firstly, whether a user’s Tweets can assist in generating more serendipitous recommendations; and secondly, whether the diversification of a list of recommended items further improves serendipity. To investigate these issues, an online experiment was conducted in the domain of computer science with 22 subjects. As an evaluation metric, we use the serendipity score (SRDP), in which the unexpectedness of recommendations is inferred by using a primitive recommendation strategy. The results indicate that a user’s Tweets do not improve serendipity, but they can reflect recent research interests and are typically heterogeneous. Contrastingly, diversification was found to lead to a greater number of serendipitous research paper recommendations.","authors":["Chifumi Nishioka","Jörn Hauke","Ansgar Scherp"],"meta":["May 2020PeerJ Computer Science 6(7):e273","DOI:10.7717/peerj-cs.273"],"references":["330077673_Scientific_Paper_Recommendation_A_Survey","329431892_How_does_serendipity_affect_diversity_in_recommender_systems_A_serendipity-oriented_greedy_algorithm","326164444_Investigating_serendipity_in_recommender_systems_based_on_real_user_feedback","306075233_A_Survey_of_Serendipity_in_Recommender_Systems","301898216_Science_Concierge_A_Fast_Content-Based_Recommendation_System_for_Scientific_Publications","327640628_Beyond_Greedy_Search_Pruned_Exhaustive_Search_for_Diversified_Result_Ranking","326705010_User_Profile_Based_Paper_Recommendation_System","316898285_Understanding_How_Twitter_is_Used_to_Spread_Scientific_Messages","312968749_Explaining_collaborative_filtering_recommendations","303901942_Profiling_vs_Time_vs_Content_What_does_Matter_for_Top-k_Publication_Recommendation_based_on_Twitter_Profiles"]}