{"id":"341447057_Artificial_intelligence-based_clinical_decision_support_in_modern_medical_physics_Selection_acceptance_commissioning_and_quality_assurance","abstract":"Background: \nRecent advances in machine and deep learning based on an increased availability of clinical data have fueled renewed interest in computerized clinical decision support systems (CDSSs). CDSSs have shown great potential to improve healthcare, increase patient safety and reduce costs. However, the use of CDSSs is not without pitfalls, as an inadequate or faulty CDSS can potentially deteriorate the quality of healthcare and put patients at risk. In addition, the adoption of a CDSS might fail because its intended users ignore the output of the CDSS due to lack of trust, relevancy or actionability.\n\nAim: \nIn this article, we provide guidance based on literature for the different aspects involved in the adoption of a CDSS with a special focus on machine and deep learning based systems: selection, acceptance testing, commissioning, implementation and quality assurance.\n\nResults: \nA rigorous selection process will help identify the CDSS that best fits the preferences and requirements of the local site. Acceptance testing will make sure that the selected CDSS fulfills the defined specifications and satisfies the safety requirements. The commissioning process will prepare the CDSS for safe clinical use at the local site. An effective implementation phase should result in an orderly roll out of the CDSS to the well-trained end-users whose expectations have been managed. And finally, quality assurance will make sure that the performance of the CDSS is maintained and that any issues are promptly identified and solved.\n\nConclusion: \nWe conclude that a systematic approach to the adoption of a CDSS will help avoid pitfalls, improve patient safety and increase the chances of success.","authors":["Geetha Mahadevaiah","Prasad RV","Iñigo Bermejo","David Jaffray"],"meta":["June 2020Medical Physics 47(5)","DOI:10.1002/mp.13562"],"references":["330203264_A_guide_to_deep_learning_in_healthcare","328988781_The_European_Federation_of_Organisations_for_Medical_Physics_EFOMP_White_Paper_Big_data_and_deep_learning_in_medical_imaging_and_in_relation_to_medical_physics_profession","321986597_Change-Point_Detection_for_Monitoring_Clinical_Decision_Support_Systems_with_a_Multi-Process_Dynamic_Linear_Model","333163394_What_hinders_the_uptake_of_computerized_decision_support_systems_in_hospitals_A_qualitative_study_and_framework_for_implementation","330203267_High-performance_medicine_the_convergence_of_human_and_artificial_intelligence","328200067_Artificial_intelligence_in_healthcare","328129402_The_Needs_and_Benefits_of_Continuous_Model_Updates_on_the_Accuracy_of_RT-Induced_Toxicity_Prediction_Models_Within_a_Learning_Health_System","327748409_Comparative_evaluation_of_auto-contouring_in_clinical_practice_a_practical_method_using_the_Turing_Test","325178430_Using_statistical_anomaly_detection_models_to_find_clinical_decision_support_malfunctions","321610930_Clinical_Decision_Support_Systems_Theory_and_Practice"]}