{"id":"341459405_Building_research_capacity_in_BRICS_and_beyond_Lessons_from_the_international_community","abstract":"Research capacity building and research productivity are essential to the economic flourishing of any nation. Over the past decade, innovation and investment in research and development in BRICS countries – especially India and China – have strongly contributed to their economic growth. The scholarly literature shows that the five-member states have high numbers of (a) university graduates – especially in the fields of engineering and computer science – and (b) research outputs – mainly quantitative. The issue, however, is that the quality of BRICS graduates is sometimes questionable, and the nations are not considered as relevant global players when it comes to the research impact factor. To that end, it is essential to align quantity with quality in BRICS’ higher education institutions. As growing economies, BRICS need to increase their investment in higher education and research capacity building to maximise their economic prosperity. Researchers who are knowledge producers and innovators can be considered the foremost role players in transferring university research to society. Therefore, investing in quality development and support is of the essence. This article is based on the voices of 32 international scholars affiliated with the Comparative Education Society in Europe. The respondents shared their views via an open-ended survey about: (a) the development of globally competent researchers; (b) the expectations placed on present-day researchers; and (c) the demands researchers face in terms of research productivity. The findings indicate that, regardless of the context, researchers are confronted with similar demands, namely: to secure funding; engage in international and interdisciplinary research projects; and produce tangible outputs. It is also evident that research capacity building at respondents’ respective institutions needs enhancement in order to align with the current research demands.","authors":["Ewelina K. Niemczyk"],"meta":["May 2020","DOI:10.20896/saci.v7i5.683"],"references":["330925021_Financing_of_Higher_Education_Institutions_Evidence_from_select_case_studies_of_universities_in_India","327114326_Developing_globally_competent_researchers_An_international_perspective","324484226_Engineering_and_development_in_Brazil_challenges_and_prospects_a_new_perspective_on_the_topic","322680683_Does_the_national_innovation_system_spur_economic_growth_in_Brazil_Russia_India_China_and_South_Africa_economies_Evidence_from_panel_data","313411394_The_Idea_of_a_Research_University_in_Russia","298706338_The_Management_of_Russian_Universities_on_the_Basis_of_International_Education_Quality_Standards","330421684_Bigger_Than_You_Thought_China's_Contribution_to_Scientific_Publications_and_Its_Impact_on_the_Global_Economy","324653243_The_Salience_of_African_Scholars_in_Education_Research","323457853_Research_Output_of_Indian_Institutions_during_2011-2016Quality_and_Quantity_Perspective","323331234_Performance-based_resource_allocation_for_higher_education_institutions_in_China","298333220_BRICS_Countries_And_Their_Strategic_HRD_Agenda_In_2020","280082515_Higher_Education_Research_Expenditure_in_South_Africa_A_Review_of_the_New_Funding_Framework","273500920_Review_of_the_Review_Constructing_the_Identity_of_Comparative_Education","265075015_BEING_ACADEMIC_RESEARCHERS_NAVIGATING_PLEASURES_AND_PAINS_IN_THE_CURRENT_CANADIAN_CONTEXT","249731229_Embodiment_Academics_and_the_Audit_Culture_A_Story_Seeking_Consideration"]}