{"id":"341413445_A_Comprehensive_Review_of_Dimensionality_Reduction_Techniques_for_Feature_Selection_and_Feature_Extraction","abstract":"Due to sharp increases in data dimensions, working on every data mining or machine learning (ML) task requires more efficient techniques to get the desired results. Therefore, in recent years, researchers have proposed and developed many methods and techniques to reduce the high dimensions of data and to attain the required accuracy. To ameliorate the accuracy of learning features as well as to decrease the training time dimensionality reduction is used as a pre-processing step, which can eliminate irrelevant data, noise, and redundant features. Dimensionality reduction (DR) has been performed based on two main methods, which are feature selection (FS) and feature extraction (FE). FS is considered an important method because data is generated continuously at an ever-increasing rate; some serious dimensionality problems can be reduced with this method, such as decreasing redundancy effectively, eliminating irrelevant data, and ameliorating result comprehensibility. Moreover, FE transacts with the problem of finding the most distinctive, informative, and decreased set of features to ameliorate the efficiency of both the processing and storage of data. This paper offers a comprehensive approach to FS and FE in the scope of DR. Moreover, the details of each paper, such as used algorithms/approaches, datasets, classifiers, and achieved results are comprehensively analyzed and summarized. Besides, a systematic discussion of all of the reviewed methods to highlight authors' trends, determining the method(s) has been done, which significantly reduced computational time, and selecting the most accurate classifiers. As a result, the different types of both methods have been discussed and analyzed the findings.","authors":["Rizgar Zebari","Adnan Mohsin Abdulazeez","Diyar Zeebaree","Dilovan Zebari"],"meta":["May 2020Journal of Applied Science and Technology Trends 1(2):56-70","DOI:10.38094/jastt1224","Project: Technical SCIENCE  ⚙️"],"references":["339662826_Enhanced_Cuttle_Fish_Algorithm_Using_Membrane_Computing_for_feature_selection_of_intrusion_detection","339646247_Gene_Expression_Classification_Based_on_Deep_Learning","339640920_A_feature_extraction_method_based_on_spectral_segmentation_and_integration_of_hyperspectral_images","339541833_A_Review_of_Dimensionality_Reduction_Techniques_for_Efficient_Computation","339216769_Intrusion_Detection_System_Based_on_Neural_Networks_Using_Bipolar_Input_with_Bipolar_Sigmoid_Activation_Function","339047123_Fast_hybrid_dimensionality_reduction_method_for_classification_based_on_feature_selection_and_grouped_feature_extraction","339132418_A_Deep_Learning_Method_With_Wrapper_Based_Feature_Extraction_For_Wireless_Intrusion_Detection_System","339101082_A_Simultaneous_Approach_for_Compression_and_Encryption_Techniques_Using_Deoxyribonucleic_Acid","339044903_Classification_of_human_hand_movements_based_on_EMG_signals_using_nonlinear_dimensionality_reduction_and_data_fusion_techniques","338813536_Developing_a_Deep_Learning_Framework_with_Two-Stage_Feature_Selection_for_Multivariate_Financial_Time_Series_Forecasting"]}