{"id":"341403483_Quantum_classifier_with_tailored_quantum_kernel","abstract":"Kernel methods have a wide spectrum of applications in machine learning. Recently, a link between quantum computing and kernel theory has been formally established, opening up opportunities for quantum techniques to enhance various existing machine-learning methods. We present a distance-based quantum classifier whose kernel is based on the quantum state fidelity between training and test data. The quantum kernel can be tailored systematically with a quantum circuit to raise the kernel to an arbitrary power and to assign arbitrary weights to each training data. Given a specific input state, our protocol calculates the weighted power sum of fidelities of quantum data in quantum parallel via a swap-test circuit followed by two single-qubit measurements, requiring only a constant number of repetitions regardless of the number of data. We also show that our classifier is equivalent to measuring the expectation value of a Helstrom operator, from which the well-known optimal quantum state discrimination can be derived. We demonstrate the performance of our classifier via classical simulations with a realistic noise model and proof-of-principle experiments using the IBM quantum cloud platform.","authors":["Carsten Blank","Daniel Kyungdeock Park","J.-K. Rhee","Francesco Petruccione"],"meta":["May 2020npj Quantum Information 6(1):41","DOI:10.1038/s41534-020-0272-6"],"references":["337627172_Benchmarking_an_11-qubit_quantum_computer","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","334717986_Parallel_quantum_trajectories_via_forking_for_sampling_without_redundancy","332994467_A_new_quantum_approach_to_binary_classification","331719791_Supervised_learning_with_quantum-enhanced_feature_spaces","331620019_Circuit-Based_Quantum_Random_Access_Memory_for_Classical_Data","345598040_Supervised_Learning_with_Quantum_Computers","344991185_4_Quantum_Computing","344837601_Detecting_crosstalk_errors_in_quantum_information_processors","323904931_Quantum_Machine_Learning_in_Feature_Hilbert_Spaces"]}