{"id":"341481146_An_efficient_characterization_of_submodular_spanning_tree_games","abstract":"Cooperative games form an important class of problems in game theory, where a key goal is to distribute a value among a set of players who are allowed to cooperate by forming coalitions. An outcome of the game is given by an allocation vector that assigns a value share to each player. A crucial aspect of such games is submodularity (or convexity). Indeed, convex instances of cooperative games exhibit several nice properties, e.g. regarding the existence and computation of allocations realizing some of the most important solution concepts proposed in the literature. For this reason, a relevant question is whether one can give a polynomial-time characterization of submodular instances, for prominent cooperative games that are in general non-convex. In this paper, we focus on a fundamental and widely studied cooperative game, namely the spanning tree game. An efficient recognition of submodular instances of this game was not known so far, and explicitly mentioned as an open question in the literature. We here settle this open problem by giving a polynomial-time characterization of submodular spanning tree games.","authors":["Cedric Koh","Laura Sanitàa"],"meta":["April 2020"],"references":["227198056_The_Kernel_and_Bargaining_Set_for_Convex_Games","260411230_Submodularity_of_minimum-cost_spanning_tree_games","229796842_Cost_Allocation_for_a_Spanning_Tree","229724442_On_cost_allocation_for_a_spanning_tree_A_game_theoretic_approach","228108082_The_Relationship_Between_Convex_Games_and_Minimum_Cost_Spanning_Tree_Games_A_Case_for_Permutationally_Convex_Games","226646116_Minimum_cost_spanning_tree_games","226282465_Cores_of_convex_games","225260822_On_the_Convexity_of_Communication_Games","224404187_A_new_stable_and_more_responsive_cost_sharing_solution_for_minimum_cost_spanning_tree_problems","216877580_Geometric_Algorithms_and_Combinatorial_Optimization","24058645_Note_Computing_the_nucleolus_of_min-cost_spanning_tree_games_is_NP-hard","24058601_On_the_Complexity_of_Testing_Membership_in_the_Core_of_Min-Cost_Spanning_Tree_Games","2416206_Submodularity_of_Some_Classes_of_the_Combinatorial_Optimization_Games"]}