{"id":"341530171_Towards_novel_insights_in_lattice_field_theory_with_explainable_machine_learning","abstract":"Machine learning has the potential to aid our understanding of phase structures in lattice quantum field theories through the statistical analysis of Monte Carlo samples. Available algorithms, in particular those based on deep learning, often demonstrate remarkable performance in the search for previously unidentified features, but tend to lack transparency if applied naively. To address these shortcomings, we propose representation learning in combination with interpretability methods as a framework for the identification of observables. More specifically, we investigate action parameter regression as a pretext task while using layer-wise relevance propagation (LRP) to identify the most important observables depending on the location in the phase diagram. The approach is put to work in the context of a scalar Yukawa model in (2+1)d. First, we investigate a multilayer perceptron to determine an importance hierarchy of several predefined, standard observables. The method is then applied directly to the raw field configurations using a convolutional network, demonstrating the ability to reconstruct all order parameters from the learned filter weights. Based on our results, we argue that due to its broad applicability, attribution methods such as LRP could prove a useful and versatile tool in our search for new physical insights. In the case of the Yukawa model, it facilitates the construction of an observable that characterizes the symmetric phase.","authors":["Stefan Blücher","Lukas Kades","Jan M. Pawlowski","Nils Strodthoff"],"meta":["May 2020","DOI:10.1103/PhysRevD.101.094507"],"references":["339344635_Unsupervised_identification_of_topological_phase_transitions_using_predictive_models","335645955_Boltzmann_generators_Sampling_equilibrium_states_of_many-body_systems_with_deep_learning","335372792_Flow-based_generative_models_for_Markov_chain_Monte_Carlo_in_lattice_field_theory","335347834_Phase_transition_encoded_in_neural_network","334343108_Regressive_and_generative_neural_networks_for_scalar_field_theory","339151008_Asymptotically_unbiased_estimation_of_physical_observables_with_neural_samplers","337803345_Machine_learning_and_the_physical_sciences","331609913_Learning_multiple_order_parameters_with_interpretable_machines","331419951_Solving_Statistical_Mechanics_Using_Variational_Autoregressive_Networks","330921318_Interpretable_machine_learning_for_inferring_the_phase_boundaries_in_a_nonequilibrium_system"]}