{"id":"341547708_Behavioral_and_EEG_Measures_Show_no_Amplifying_Effects_of_Shared_Attention_on_Attention_or_Memory","abstract":"Shared attention experiments examine the potential differences in function or behavior when stimuli are experienced alone or in the presence of others, and when simultaneous attention of the participants to the same stimulus or set is involved. Previous work has found enhanced reactions to emotional stimuli in social situations, yet these changes might represent enhanced communicative or motivational purposes. This study examines whether viewing emotional stimuli in the presence of another person influences attention to or memory for the stimulus. Participants passively viewed emotionally-valenced stimuli while completing another task (counting flowers). Each participant performed this task both alone and in a shared attention condition (simultaneously with another person in the same room) while EEG signals were measured. Recognition of the emotional pictures was later measured. A significant shared attention behavioral effect was found in the attention task but not in the recognition task. Compared to event-related potential responses for neutral pictures, we found higher P3b response for task relevant stimuli (flowers), and higher Late Positive Potential (LPP) responses for emotional stimuli. However, no main effect was found for shared attention between presence conditions. To conclude, shared attention may therefore have a more limited effect on cognitive processes than previously suggested.","authors":["Noam Mairon","Mor Nahum","Arjen Stolk","Robert T. Knight"],"meta":["May 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-65311-7"],"references":["332519466_Wanting_without_enjoying_The_social_value_of_sharing_experiences","330965263_Mental_Simulation_of_Facial_Expressions_Mu_Suppression_to_the_Viewing_of_Dynamic_Neutral_Face_Videos","320016631_The_Joint_Action_Effect_on_Memory_as_a_Social_Phenomenon_The_Role_of_Cued_Attention_and_Psychological_Distance","319932454_Empathy_Pain_and_Attention_Cues_that_Predict_Pain_Stimulation_to_the_Partner_and_the_Self_Capture_Visual_Attention","318337939_Social_Coordination_Information_in_Dynamic_Chase_Modulates_EEG_Mu_Rhythm","304492970_Late_Positive_Potential_ERP_Responses_to_Social_and_Nonsocial_Stimuli_in_Youth_with_Autism_Spectrum_Disorder","320936819_It's_not_me_it's_you_-_Differential_neural_processing_of_social_and_non-social_nogo_cues_in_joint_action","316790565_Gender_differences_in_emotional_responses_A_psychophysiological_study","308959254_Are_you_looking_at_me_Mu_suppression_modulation_by_facial_expression_direction","303889916_Bayesian_Benefits_for_the_Pragmatic_Researcher"]}