{"id":"341512595_Role_of_Big_Data_in_the_Development_of_Smart_City_by_Analyzing_the_Density_of_Residents_in_Shanghai","abstract":"In recent decades, a large amount of research has been carried out to analyze location-based social network data to highlight their application. These location-based social network datasets can be used to propose models and techniques that can analyze and reproduce the spatiotemporal structures and symmetries in user activities as well as density estimations. In the current study, different density estimation techniques are utilized to analyze the check-in frequency of users in more detail from location-based social network dataset acquired from Sina-Weibo, also referred as Weibo, over a specific period in 10 different districts of Shanghai, China. The aim of this study is to analyze the density of users in Shanghai city from geolocation data of Weibo as well as to compare their density through univariate and bivariate density estimation techniques; i.e., point density and kernel density estimation (KDE) respectively. The main findings of the study include the following: (i) characteristics of users’ spatial behavior, the center of activity based on their check-ins, (ii) the feasibility of check-in data to explain the relationship between users and social media, and (iii) the presentation of evident results for regulatory or managing authorities for urban planning. The current study shows that the point density and kernel density estimation. KDE methods provide useful insights for modeling spatial patterns using geo-spatial dataset. Finally, we can conclude that, by utilizing the KDE technique, we can examine the check-in behavior in more detail for an individual as well as broader patterns in the population as a whole for the development of smart city. The purpose of this article is to figure out the denser places so that the authorities can divide the mobility of people from the same routes or at least they can control the situation from any further inconvenience.","authors":["Saqib Ali Haidery","Hidayat Ullah","Naimat Ullah Khan","Kanwal Fatima"],"meta":["May 2020Electronics 9(5):837","DOI:10.3390/electronics9050837","Project: Ministry of Education under Grant NRF‐2017R1D1A3B04031440."],"references":["339478473_Visualization_Spatiotemporal_Patterns_and_Directional_Analysis_of_Urban_Activities_Using_Geolocation_Data_Extracted_from_LBSN","339422289_Analyzing_Social-Geographic_Human_Mobility_Patterns_Using_Large-Scale_Social_Media_Data","339194282_Spatiotemporal_Patterns_of_Visitors_in_Urban_Green_Parks_by_Mining_Social_Media_Big_Data_Based_Upon_WHO_Reports","338723510_Spatiotemporal_Analysis_of_Tourists_and_Residents_in_Shanghai_Based_on_Location-Based_Social_Network's_Data_from_Weibo","337187387_Analyzing_the_Spatiotemporal_Patterns_in_Green_Spaces_for_Urban_Studies_Using_Location-Based_Social_Media_Data","331050791_Geospatial_Point_Density","329910613_Prediction_of_Confusion_Attempting_Algebra_Homework_in_an_Intelligent_Tutoring_System_through_Machine_Learning_Techniques_for_Educational_Sustainable_Development","328470200_Big_Data_Analysis_to_Observe_Check-in_Behavior_Using_Location-Based_Social_Media_Data","325266460_Using_Location-Based_Social_Media_Data_to_Observe_Check-In_Behavior_and_Gender_Difference_Bringing_Weibo_Data_into_Play","325022029_Evaluation_of_threshold_selection_methods_for_adaptive_kernel_density_estimation_in_disease_mapping"]}