{"id":"341509765_Sustained_English_lingua-cultural_education_a_solution_for_Ukraine","abstract":"Ukraine, as a state striving to join on the parity basis the international community of developed and democratic countries, lacks some important prerequisites for achieving this goal. Besides several economic and political factors making obstacles for the desired achievement, of no lesser importance are the humanitarian factors, such as the monolingualism and monoculturalism of a substantial part of Ukrainian population. They preclude unimpeded mutual understanding and mutual acceptance, as well as free unimpeded contacts, between many Ukrainian citizens and their European counterparts. In this aspect, the solution for Ukraine can be found in sustained foreign language lingua-cultural education of the broadest strata of Ukrainian population that could open for the people a way out in what concerns their ability to communicate freely and fluently all through the Western European space sharing with the people living there not only the language of international communication but also the cultural approaches and beliefs. The article discusses the ways of developing such sustained (life-long) English lingua-cultural education for the young generation of new Ukraine. It analyzes the section of that education to be implemented at Ukrainian nonlinguistic tertiary schools with the aim of designing its efficient model.","authors":["Oleg Tarnopolsky","Nataliia Pavlovna Volkova","Svitlana Kozhushko"],"meta":["May 2020E3S Web of Conferences 166","DOI:10.1051/e3sconf/202016610004"],"references":["303914648_Language_Education_for_Sustainable_Development","260354183_Toward_a_Postmethod_Pedagogy","249400122_Constructivist_Pedagogy","242431410_Principles_and_Practice_in_Second_Language_Acquisition","344471428_Experiential_Learning_in_Foreign_Language_Education","272792102_Why_global_English_may_mean_the_end_of_'English_as_a_Foreign_Language'","271104689_Linguistic_and_Communicative_Competence_Topics_in_ESL","264611938_Integrating_Grammar_Instruction_and_Communicative_Language_Use_Through_Grammar_Consciousness-Raising_Tasks","244443789_Teaching_and_Assessing_Intercultural_Communicative_Competence","243491795_Freedom_to_learn_3rd_ed"]}