{"id":"341505537_University_students'_mental_health_amidst_the_COVID-19_quarantine_in_Greece","abstract":"The COVID-19 hit also Greece but due to early measures and their exceptional success, the death toll is one of the lowest in the world. Here we report the results from the analysis of the responses to an online survey, from the first 1000 university students, concerning the impact of the lockdown on their mental health. Overall, there was a ‘horizontal’ increase in scores; 42.5% for anxiety, 74.3% for depression, and 63.3% increase in total suicidal thoughts. Quantity of sleep increased in 66.3% but quality worsened in 43.0%. Quality of life worsened in 57.0% (same in 27.9%). There was a 25-3 fold increase in possible clinical cases of depression and an almost 8-fold increase in suicidal thoughts. Almost a third accept and one fifth are open to conspiracy theories concerning COVID-19. To our knowledge this is the first study reporting data concerning the impact of lockdown and quarantine on the mental health of university students. While the acute impact seems clear, the long-term consequences are unknown and although suicidal thoughts have risen substantially, it seems unlikely this will result in deaths. However, the results constitute a clear message that vulnerable populations are at a need for specific interventions concerning their mental health issues.","authors":["Chrysi Kaparounaki","Mikaella E. Patsali","Danai-Priskila V. Mousa","Eleni V.K. Papadopoulou"],"meta":["May 2020Psychiatry Research 290:113111","DOI:10.1016/j.psychres.2020.113111"],"references":["221931022_Development_of_the_Risk_Assessment_Suicidality_Scale_RASS_a_population-based_study","26382984_Reliability_and_psychometric_properties_of_the_Greek_translation_of_the_State-Trait_Anxiety_Inventory_form_Y_Preliminary_data","11888041_Reliability_Validity_and_Psychometric_Properties_of_the_Greek_Translation_of_the_Center_for_Epidemiological_Studies-Depression_CES-D_Scale","7324548_Reliability_and_psychometric_properties_of_the_Greek_translation_of_the_State-Trait_Anxiety_Inventory_form_Y_Preliminary_data","340075360_The_psychological_impact_of_the_COVID-19_epidemic_on_college_students_in_China","221801964_Development_of_the_Risk_Assessment_Suicidality_Scale_RASS_A_population-based_study"]}