{"id":"341517588_Review_of_Automatic_Text_Summarization_Techniques_Methods","abstract":"Text summarization automatically produces a summary containing important sentences and includes all relevant important information from the original document. One of the main approaches, when viewed from the summary results, are extractive and abstractive. An extractive summary is heading towards maturity and now research has shifted towards abstractive summation and real-time summarization. Although there have been so many achievements in the acquisition of datasets, methods, and techniques published, there are not many papers that can provide a broad picture of the current state of research in this field. This paper provides a broad and systematic review of research in the field of text summarization published from 2008 to 2019. There are 85 journal and conference publications which are the results of the extraction of selected studies for identification and analysis to describe research topics/trends, datasets, preprocessing, features, techniques, methods, evaluations, and problems in this field of research. The results of the analysis provide an in-depth explanation of the topics/trends that are the focus of their research in the field of text summarization; provide references to public datasets, preprocessing and features that have been used; describes the techniques and methods that are often used by researchers as a comparison and means for developing methods. At the end of this paper, several recommendations for opportunities and challenges related to text summarization research are mentioned.","authors":["Adhika Widyassari","Supriadi Rustad","Guruh Fajar Shidik","Edi Noersasongko"],"meta":["May 2020Journal of King Saud University - Computer and Information Sciences","DOI:10.1016/j.jksuci.2020.05.006"],"references":["340786587_Multi-task_learning_for_abstractive_text_summarization_with_key_information_guide_network","339954413_A_hierarchical_self-attentive_neural_extractive_summarizer_via_reinforcement_learning_HSASRL","339878911_Performance_Evaluation_of_Text-Mining_Models_with_Hindi_Stopwords_Lists","337814696_Effective_Deep_Learning_Approaches_for_Summarization_of_Legal_Texts","337653638_Text_Summarization_A_Brief_Review","335877676_MS-Pointer_Network_Abstractive_Text_Summary_Based_on_Multi-Head_Self-Attention","345812224_The_Mixture_of_Textrank_and_Lexrank_Techniques_of_Single_Document_Automatic_Summarization_Research_in_Tibetan","340267792_Attention_history-based_attention_for_abstractive_text_summarization","338649878_Japanese_abstractive_text_summarization_using_BERT","336995582_Neural_Extractive_Text_Summarization_with_Syntactic_Compression"]}