{"id":"341568689_Assessing_the_Big_Five_personality_traits_using_real-life_static_facial_images","abstract":"There is ample evidence that morphological and social cues in a human face provide signals of human personality and behaviour. Previous studies have discovered associations between the features of artificial composite facial images and attributions of personality traits by human experts. We present new findings demonstrating the statistically significant prediction of a wider set of personality features (all the Big Five personality traits) for both men and women using real-life static facial images. Volunteer participants (N = 12,447) provided their face photographs (31,367 images) and completed a self-report measure of the Big Five traits. We trained a cascade of artificial neural networks (ANNs) on a large labelled dataset to predict self-reported Big Five scores. The highest correlations between observed and predicted personality scores were found for conscientiousness (0.360 for men and 0.335 for women) and the mean effect size was 0.243, exceeding the results obtained in prior studies using ‘selfies’. The findings strongly support the possibility of predicting multidimensional personality profiles from static facial images using ANNs trained on large labelled datasets. Future research could investigate the relative contribution of morphological features of the face and other characteristics of facial images to predicting personality.","authors":["Александр Качур","Evgeny N. Osin","Denis Davydov","Konstantin Shutilov"],"meta":["May 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-65358-6","Projects: Face and PersonalityFace Shape, Personality & Consumer behavior"],"references":["324389161_Supraorbital_morphology_and_social_dynamics_in_human_evolution","324068497_The_Basel_Face_Database_A_validated_set_of_photographs_reflecting_systematic_differences_in_Big_Two_and_Big_Five_personality_dimensions","316459630_Concurrent_and_longitudinal_dyadic_polynomial_regression_analyses_of_Big_Five_traits_and_relationship_satisfaction_Does_similarity_matter","314244593_Signatures_of_personality_on_dense_3D_facial_images","351624256_Configurational_Information_in_Face_Perception","322871591_Deep_neural_networks_are_more_accurate_than_humans_at_detecting_sexual_orientation_from_facial_images","321371003_Computer-Aided_Recognition_of_Facial_Attributes_for_Fetal_Alcohol_Spectrum_Disorders","320221913_Facial_Width-to-Height_Ratio_Does_Not_Predict_Self-Reported_Behavioral_Tendencies","316792676_Social_Psychology_of_Self-Referent_Behavior","315974290_Testosterone_and_Human_Behavior_The_role_of_individual_and_contextual_variables"]}