{"id":"341536169_Deep_Learning_Techniques_for_Community_Detection_in_Social_Networks","abstract":"Graph embedding is an effective yet efficient way to convert graph data into a low dimensional space. In recent years, deep learning has applied on graph embedding and shown outstanding performance. Adjacency matrix is often taken as the storage data structure of graph. However, there are the problems of insufficient spatial proximity information in adjacency matrix.. Therefore, this study proposes a deep community detection method which includes (1) matrix reconstruction method, (2) spatial feature extraction method and (3) community detection method. The original adjacency matrix in social network is reconstructed based on the opinion leader and nearer neighbors for obtaining spatial proximity matrix. The spatial proximity matrix can obtain subspace of the graph which can help convolution neural network easily and quickly extract the spatial localization. The spatial eigenvector of reconstructed adjacency matrix can be extracted by an auto-encoder based on convolution neural network for the improvement of modularity. In experiments, four open datasets of practical social networks were selected to evaluate the proposed method, and the experimental results show that the proposed deep community detection method obtained higher modularity than other deep learning methods. Therefore, the proposed deep community detection method can effectively detect high quality communities in social networks.","authors":["Ling Wu","Qishan Zhang","Chi-Hua Chen","Kun Guo"],"meta":["May 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2996001"],"references":["334286273_Early_Prediction_of_Scientific_Impact_Based_on_Multi-Bibliographic_Features_and_Convolutional_Neural_Network","326502476_Learning_Deep_Network_Representations_with_Adversarially_Regularized_Autoencoders","322958464_Deep_Convolutional_Neural_Networks_for_Feature_Extraction_of_Images_Generated_from_Complex_Networks_Topologies","334844073_Adversarial_Graph_Embedding_for_Ensemble_Clustering","334437745_MeshCNN_a_network_with_an_edge","333180878_Customized_High_Performance_and_Energy_Efficient_Communication_Networks_for_AI_Chips","332815693_A_deep_learning_based_community_detection_approach","329080668_A_distributed_overlapping_community_detection_model_for_large_graphs_using_autoencoder","328505466_DeepDirect_Learning_Directions_of_Social_Ties_with_Edge-Based_Network_Embedding","322891528_Incorporating_network_structure_with_node_contents_for_community_detection_on_large_networks_using_deep_learning"]}