{"id":"341523798_The_Effectiveness_of_Using_Mobile_Learning_Techniques_to_Improve_Learning_Outcomes_in_Higher_Education","abstract":"Recently Mobile technology is considered an effective way to improve students' skills such as positive thinking, collaborative, communication, as well as it is considered the main part of major innovation in many e-learning research areas. As a result of the 21<sup>st.</sup> century requirements, skills were developed to address the rising needs in higher education which causes a shifting paradigm from the traditional methods of teaching to M-learning. In this research, we discuss the effect of using Mobile learning techniques to improve learning outcomes in Higher Education. We have implemented a web-based survey through two questionnaires. The questionnaires were distributed among 200 students in the second and third levels in the computer science department at both Community College and College of Arts and Science. This research explores a study on e-learning using mobile technology to identify students’ perceptions in the acceptance of mobile techniques and recognize the quality of mobile services for academic and social purposes to improve teaching strategy and learning performance in higher educational organizations. The outcomes of this research would support the evolution of M-learning at the university-level and cause shifting the traditional learning methods by merging M-learning methodologies as a learning management system that provides mobile learning services to students and teachers any time and from any location. The research study shows some important results towards the integration of mobile technology into teaching include: student positive perception, facilitates student concentrate, flexible access to m-services for learning materials, and increases students' skills in using mobile technology for e-learning.","authors":["Hosam El-Sofany","Nahla El-Haggar"],"meta":["May 2020International Journal of Interactive Mobile Technologies (iJIM) 14(08):4","DOI:10.3991/ijim.v14i08.13125"],"references":["327024139_Students'_Usage_of_Mobile_Learning_on_Information_Technology_and_Communication_Subject_for_Grade_9_Students","312465778_A_systematic_review_on_mobile_learning_in_higher_education_The_African_perspective","346343554_MOBILE_LEARNING_IN_HIGHER_EDUCATION","332282906_Smartphones_enhance_the_management_of_learning_processes_in_higher_education_a_case_study_in_Ajman_University_United_Arab_Emirates","330119155_Difficulties_in_defining_mobile_learning_analysis_design_characteristics_and_implications","328608049_Mobile_Learning_and_Software_as_a_Service_The_Effect_on_Knowledge_Sharing","322133401_From_the_E-Learning_and_Blended-Learning_to_M-Learning_Trends_Benefits_and_Risks_of_Education_Digital_Transformation","322015237_Neither_Completely_M-_Nor_E-_Learning_Integrating_both_is_the_Solution","312542336_MDM_tool_A_data_mining_framework_integrated_into_Moodle","312187269_Impact_of_mobile_technology_on_student_attitudes_engagement_and_learning"]}