{"id":"341581660_Deep_Learning_Accelerators_A_Case_Study","abstract":"In the recent years, deep learning has become one of the most important topics in computer science. Deep learning is a growing trend in the edge of technology and its applications are now seen in many aspects of our life such as object detection, speech recognition, natural language processing, etc. Currently, almost all major sciences and technologies are benefiting from the advantages of deep learning such as high accuracy, speed and flexibility. Therefore, any efforts for improving performance of related techniques is valuable. Deep learning accelerators are considered as hardware architecture, which are designed and optimized for increasing the speed, efficiency and accuracy of computers that are running deep learning algorithms. In this paper, after reviewing some backgrounds about deep learning, a well-known accelerator architecture named MAERI is investigated. By using an open source tool called MAESTRO, the performance of a deep learning task is measured and compared on two different data flow strategies: NLR and NVDLA. Measured performance indicators of novel optimized architecture, NVDLA shows higher L1 and L2 computation reuse and lower total runtime (cycles) in comparison to the other one.","authors":["Hamidreza Bolhasani","Somayyeh Jafarali Jassbi"],"meta":["November 2020Journal of Big Data 7(1)","DOI:10.1186/s40537-020-00377-8"],"references":["332714703_Multi-sink_distributed_power_control_algorithm_for_Cyber-physical-systems_in_coal_mine_tunnels","350998362_A_Selective_Overview_of_Deep_Learning","346345558_DianNao_a_small-footprint_high-throughput_accelerator_for_ubiquitous_machine-learning","332219038_Buffets_An_Efficient_and_Composable_Storage_Idiom_for_Explicit_Decoupled_Data_Orchestration","331911802_A_regional_adaptive_variational_PDE_model_for_computed_tomography_image_reconstruction","331539357_The_Anatomy_and_Physiology_of_the_Human_Stress_Response","331537083_A_Clinical_Guide_to_the_Treatment_of_the_Human_Stress_Response","323948054_MAERI_Enabling_Flexible_Dataflow_Mapping_over_DNN_Accelerators_via_Reconfigurable_Interconnects","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","317631934_Eyeriss_A_Spatial_Architecture_for_Energy-Efficient_Dataflow_for_Convolutional_Neural_Networks"]}