{"id":"341556236_Integrating_3D_Model_Representation_for_an_Accurate_Non-Invasive_Assessment_of_Pressure_Injuries_with_Deep_Learning","abstract":"Pressure injuries represent a major concern in many nations. These wounds result from prolonged pressure on the skin, which mainly occur among elderly and disabled patients. If retrieving quantitative information using invasive methods is the most used method, it causes significant pain and discomfort to the patients and may also increase the risk of infections. Hence, developing non-intrusive methods for the assessment of pressure injuries would represent a highly useful tool for caregivers and a relief for patients. Traditional methods rely on findings retrieved solely from 2D images. Thus, bypassing the 3D information deriving from the deep and irregular shape of this type of wounds leads to biased measurements. In this paper, we propose an end-to-end system which uses a single 2D image and a 3D mesh of the pressure injury, acquired using the Structure Sensor, and outputs all the necessary findings such as: external segmentation of the wound as well as its real-world measurements (depth, area, volume, major axis and minor axis). More specifically, a first block composed of a Mask RCNN model uses the 2D image to output the segmentation of the external boundaries of the wound. Then, a second block matches the 2D and 3D views to segment the wound in the 3D mesh using the segmentation output and generates the aforementioned real-world measurements. Experimental results showed that the proposed framework can not only output refined segmentation with 87% precision, but also retrieves reliable measurements, which can be used for medical assessment and healing evaluation of pressure injuries.","authors":["Sofia Zahia","Begoña García Zapirain","Adel Said Elmaghraby"],"meta":["May 2020Sensors 20(10):2933","DOI:10.3390/s20102933"],"references":["320353163_Robust_Image_Feature_Matching_via_Progressive_Sparse_Spatial_Consensus","319258718_Segmentation_and_Measurement_of_Chronic_Wounds_for_Bioprinting","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","339094608_Segmenting_Skin_Ulcers_and_Measuring_the_Wound_Area_Using_Deep_Convolutional_Networks","337221564_Pressure_injury_image_analysis_with_machine_learning_techniques_A_systematic_review_on_previous_and_possible_future_methods","326907298_Incidence_and_Prevalence_of_Pressure_Injuries_in_Adult_Intensive_Care_Patients_A_Systematic_Review_and_Meta-Analysis","326566544_ICARUS_Retrieving_Skin_Ulcer_Images_through_Bag-of-Signatures","323537420_Tissue_Classification_and_Segmentation_of_Pressure_Injuries_Using_Convolutional_Neural_Networks","319948340_An_Economic_Evaluation_of_the_Impact_Cost_and_Medicare_Policy_Implications_of_Chronic_Nonhealing_Wounds","319770252_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems"]}