{"id":"341672498_Multi-Strategy_Ensemble_Whale_Optimization_Algorithm_and_Its_Application_to_Analog_Circuits_Intelligent_Fault_Diagnosis","abstract":"The whale optimization algorithm (WOA) is a new swarm intelligence (SI) optimization algorithm, which has the superiorities of fewer parameters and stronger searching ability. However, previous studies have indicated that there are shortages in maintaining diversity and avoiding local optimal solutions. This paper proposes a multi-strategy ensemble whale optimization algorithm (MSWOA) to alleviate these deficiencies. First, the chaotic initialization strategy is performed to enhance the quality of the initial population. Then, an improved random searching mechanism is designed to reduce blindness in the exploration phase and speed up the convergence. In addition, the original spiral updating position is modified by the Levy flight strategy, which leads to a better tradeoff between local and global search. Finally, an enhanced position revising mechanism is utilized to improve the exploration further. To testify the superiorities of the proposed MSWOA algorithm, a series of comparative experiments are carried out. On the one hand, the numerical optimization experimental results, which are conducted under nineteen widely used benchmark functions, indicate that the performance of MSWOA stands out compared with the standard WOA and six other well-designed SI algorithms. On the other hand, MSWOA is utilized to tune the parameters of the support vector machine (SVM), which is applied to the fault diagnosis of analog circuits. Experimental results confirm that the proposed method has higher diagnosis accuracy than other competitors. Therefore, the MSWOA is successfully applied as a novel and efficient optimization algorithm.","authors":["Xianfeng Yuan","Zhaoming Miao","Ziao Liu","Zichen Yan"],"meta":["May 2020Applied Sciences 10(11):3667","DOI:10.3390/app10113667"],"references":["336951706_Event-Triggered_Stability_Analysis_of_Semi-Markovian_Jump_Networked_Control_System_with_Actuator_Faults_and_Time-Varying_Delay_via_Bessel-Legendre_Inequalities","335036601_An_Adaptive_Whale_Optimization_Algorithm_Using_Gaussian_Distribution_Strategies_and_Its_Application_in_Heterogeneous_UCAVs_Task_Allocation","333763411_An_Effective_ABC-SVM_Approach_for_Surface_Roughness_Prediction_in_Manufacturing_Processes","332001636_A_Memetic_Chaotic_Gravitational_Search_Algorithm_for_unconstrained_global_optimization_problems","335712431_Chaotic_particle_swarm_optimization_with_sigmoid-based_acceleration_coefficients_for_numerical_function_optimization","333327234_A_novel_methodology_for_optimal_single_mobile_robot_scheduling_using_whale_optimization_algorithm","332761196_Joint_optimization_method_for_task_scheduling_time_and_energy_consumption_in_mobile_cloud_computing_environment","332100558_Hybrid_particle_swarm_optimization_with_spiral-shaped_mechanism_for_feature_selection","331797611_A_nonlinear_flux_linkage_model_for_bearingless_induction_motor_based_on_GWO-LSSVM","331752332_Whale_Optimization_Algorithm_Based_on_Lamarckian_Learning_for_Global_Optimization_Problems"]}