{"id":"341627061_Finding_key_players_in_complex_networks_through_deep_reinforcement_learning","abstract":"Finding an optimal set of nodes, called key players, whose activation (or removal) would maximally enhance (or degrade) a certain network functionality, is a fundamental class of problems in network science. Potential applications include network immunization, epidemic control, drug design and viral marketing. Due to their general NP-hard nature, these problems typically cannot be solved by exact algorithms with polynomial time complexity. Many approximate and heuristic strategies have been proposed to deal with specific application scenarios. Yet, we still lack a unified framework to efficiently solve this class of problems. Here, we introduce a deep reinforcement learning framework FINDER, which can be trained purely on small synthetic networks generated by toy models and then applied to a wide spectrum of application scenarios. Extensive experiments under various problem settings demonstrate that FINDER significantly outperforms existing methods in terms of solution quality. Moreover, it is several orders of magnitude faster than existing methods for large networks. The presented framework opens up a new direction of using deep learning techniques to understand the organizing principle of complex networks, which enables us to design more robust networks against both attacks and failures. A fundamental problem in network science is how to find an optimal set of key players whose activation or removal significantly impacts network functionality. The authors propose a deep reinforcement learning framework that can be trained on small networks to understand the organizing principles of complex networked systems.","authors":["Changjun Fan","Zeng li","Yizhou Sun","Yang-Yu Liu"],"meta":["June 2020Nature Machine Intelligence 2(6):1-8","DOI:10.1038/s42256-020-0177-2"],"references":["323141783_Deep_Reinforcement_Learning_for_Solving_the_Vehicle_Routing_Problem","322287397_Generalized_Network_Dismantling","320473480_Mastering_the_game_of_Go_without_human_knowledge","317399572_Inductive_Representation_Learning_on_Large_Graphs","343539348_Machine_Learning_for_Combinatorial_Optimization_a_Methodological_Tour_d'Horizon","332482338_Online_Vehicle_Routing_With_Neural_Combinatorial_Optimization_and_Deep_Reinforcement_Learning","324868408_The_Critical_Node_Detection_Problem_in_networks_A_survey","321878591_Superhuman_AI_for_heads-up_no-limit_poker_Libratus_beats_top_professionals","321137237_The_Network_Data_Repository_with_Interactive_Graph_Analytics_and_Visualization","315807166_Learning_Combinatorial_Optimization_Algorithms_over_Graphs"]}