{"id":"341658901_Mixed_preferential_attachment_model_Homophily_and_minorities_in_social_networks","abstract":"Individuals in social networks tend to exhibit homophily in their social ties, namely, they prefer bonding with others of the same social group (e.g., the same nationality, gender, socio-economic background, etc.). To formalize this phenomenon in the context of an evolving social network, we consider a mixed preferential attachment (MPA), bi-populated, network model. In this model each of the two social groups has a certain level of bias applied by its members toward other group members, ranging form homophily (affinity towards the same) to heterophily (affinity towards the different). Thus, the MPA model supports the following three simple and well-accepted observations on human behavior related to forming networks: (i) the “rich get richer” mechanism, (ii) heterogeneity and a resulting minority-majority partition, and (iii) selection bias between groups.\nThe main contribution of this paper is to propose a model for the evolution of a social network under these three assumptions and analyze its behavior. We show that the suggested mixed preferential attachment model exhibits, for each population, a (possibly different) power law degree distribution, i.e., a distribution where the fraction of nodes with degree k is proportional to k−β (note that β may be different for each group, as a function of the bias level and the minority-majority partition). We believe that this model may contribute to a better understanding of the forces that shape the groups and communities of our society.","authors":["Chen Avin","Hadassa Daltrophe","Barbara Keller","Zvi Lotker"],"meta":["May 2020Physica A: Statistical Mechanics and its Applications 555(5439):124723","DOI:10.1016/j.physa.2020.124723"],"references":["326558651_Homophily_influences_ranking_of_minorities_in_social_networks","301466183_Homophily_and_the_Glass_Ceiling_Effect_in_Social_Networks","283262571_Quantifying_the_Role_of_Homophily_in_Human_Cooperation_Using_Multiplex_Evolutionary_Game_Theory","276134176_Using_Social_Network_Methods_to_Test_for_Assortment_of_Prosociality_among_Korean_High_School_Students","233412357_The_Evolution_of_Homophily","228471717_Complex_graphs_and_networks","6449384_Collective_synchronization_induced_by_epidemic_dynamics_on_complex_networks_with_communities","2217842_Large-scale_evolution_and_extinction_in_a_hierarchically_structured_environment","319864389_Assortative_Mixing_Equilibria_in_Social_Network_Games","283617410_Emergence_of_Scaling_in_Random_Networks","233822040_Birds_of_a_Feather_Homophily_in_Social_Networks","233821783_Friendship_as_a_Social_Process_A_Substantive_and_Methodological_Analysis","227673009_A_General_Theory_of_Bibliometric_and_Other_Cumulative_Advantage_Processes","222678621_The_Evolution_of_Social_and_Economic_Networks","10856109_Mixing_patterns_in_networks"]}