{"id":"341661283_Multiple-strategy_learning_particle_swarm_optimization_for_large-scale_optimization_problems","abstract":"The balance between the exploration and the exploitation plays a significant role in the meta-heuristic algorithms, especially when they are used to solve large-scale optimization problems. In this paper, we propose a multiple-strategy learning particle swarm optimization algorithm, called MSL-PSO, to solve problems with large-scale variables, in which different learning strategies are utilized in different stages. At the first stage, each individual tries to probe some positions by learning from the demonstrators who have better performance on the fitness value and the mean position of the population. All the best probed positions, each of which has the best fitness among all positions probed by its corresponding individual, will compose a new temporary population. The temporary population will be sorted on the fitness values in a descending order, and will be used for each individual to find its demonstrators, which is based on the rank of the best probed solution in the temporary population and the rank of the individual in the current population, to learn using a new strategy in the second stage. The first stage is used to improve the exploration capability, and the second one is expected to balance the convergence and diversity of the population. To verify the effectiveness of MSL-PSO for solving large-scale optimization problems, some empirical experiments are conducted, which include CEC2008 problems with 100, 500, and 1000 dimensions, and CEC2010 problems with 1000 dimensions. Experimental results show that our proposed MSL-PSO is competitive or has a better performance compared with ten state-of-the-art algorithms.","authors":["Hao Wang","Mengnan Liang","Chaoli Sun","Guochen Zhang"],"meta":["May 2020Complex & Intelligent Systems 7(5)","DOI:10.1007/s40747-020-00148-1"],"references":["338470811_QUasi-Affine_TRansformation_Evolutionary_Algorithm_with_Communication_Schemes_for_Application_of_RSSI_in_Wireless_Sensor_Networks","337192684_Novel_Parallel_Heterogeneous_Meta-Heuristic_and_Its_Communication_Strategies_for_the_Prediction_of_Wind_Power","332662596_A_Distributed_Swarm_Optimizer_With_Adaptive_Communication_for_Large-Scale_Optimization","330462239_A_Cooperative_Co-Evolutionary_Approach_to_Large-Scale_Multisource_Water_Distribution_Network_Optimization","327711308_Multiobjective_Infill_Criterion_Driven_Gaussian_Process-Assisted_Particle_Swarm_Optimization_of_High-Dimensional_Expensive_Problems","334199383_Granularity-based_surrogate-assisted_particle_swarm_optimization_for_high-dimensional_expensive_optimization","332582385_Ranking-based_Biased_Learning_Swarm_Optimizer_for_Large-Scale_Optimization","330150951_Investigating_Surrogate-assisted_Cooperative_Coevolution_for_Large-Scale_Global_Optimization","328895813_SHADE_with_Iterative_Local_Search_for_Large-Scale_Global_Optimization","327768228_Evolution_Consistency_Based_Decomposition_for_Cooperative_Coevolution"]}