{"id":"341627798_COVID-19_Future_Forecasting_Using_Supervised_Machine_Learning_Models","abstract":"Machine learning (ML) based forecasting mechanisms have proved their significance to anticipate in perioperative outcomes to improve the decision making on the future course of actions. The ML models have long been used in many application domains which needed the identification and prioritization of adverse factors for a threat. Several prediction methods are being popularly used to handle forecasting problems. This study demonstrates the capability of ML models to forecast the number of upcoming patients affected by COVID-19 which is presently considered as a potential threat to mankind. In particular, four standard forecasting models, such as linear regression (LR), least absolute shrinkage and selection operator (LASSO), support vector machine (SVM), and exponential smoothing (ES) have been used in this study to forecast the threatening factors of COVID-19. Three types of predictions are made by each of the models, such as the number of newly infected cases, the number of deaths, and the number of recoveries in the next 10 days. The results produced by the study proves it a promising mechanism to use these methods for the current scenario of the COVID-19 pandemic. The results prove that the ES performs best among all the used models followed by LR and LASSO which performs well in forecasting the new confirmed cases, death rate as well as recovery rate, while SVM performs poorly in all the prediction scenarios given the available dataset.","authors":["Furqan Rustam","Aijaz Ahmad Reshi","Arif Mehmood","Dr. Saleem Ullah"],"meta":["May 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2997311","Project: Joint Venture"],"references":["340331477_Forecasting_the_novel_coronavirus_COVID-19","337050333_Tweets_Classification_on_the_Base_of_Sentiments_for_US_Airline_Companies","323847484_Statistical_and_Machine_Learning_forecasting_methods_Concerns_and_ways_forward","344987202_Chapter_1_Analytics_Defined","343848273_The_epidemiological_characteristics_of_an_outbreak_of_2019_novel_coronavirus_diseases_COVID-19_in_China","339924572_Critical_Care_Utilization_for_the_COVID-19_Outbreak_in_Lombardy_Italy_Early_Experience_and_Forecast_During_an_Emergency_Response","334359355_Combining_prediction_intervals_in_the_M4_competition","329475599_Regression_Shrinkage_and_Selection_Via_the_Lasso","313446488_Ridge_regression_Biased_estimation_for_nonorthogonal_problems","306062684_Consideration_of_manufacturing_data_to_apply_machine_learning_methods_for_predictive_manufacturing"]}