{"id":"341681498_Universal_Lemmatizer_A_sequence-to-sequence_model_for_lemmatizing_Universal_Dependencies_treebanks","abstract":"In this paper, we present a novel lemmatization method based on a sequence-to-sequence neural network architecture and morphosyntactic context representation. In the proposed method, our context-sensitive lemmatizer generates the lemma one character at a time based on the surface form characters and its morphosyntactic features obtained from a morphological tagger. We argue that a sliding window context representation suffers from sparseness, while in majority of cases the morphosyntactic features of a word bring enough information to resolve lemma ambiguities while keeping the context representation dense and more practical for machine learning systems. Additionally, we study two different data augmentation methods utilizing autoencoder training and morphological transducers especially beneficial for low-resource languages. We evaluate our lemmatizer on 52 different languages and 76 different treebanks, showing that our system outperforms all latest baseline systems. Compared to the best overall baseline, UDPipe Future, our system outperforms it on 62 out of 76 treebanks reducing errors on average by 19% relative. The lemmatizer together with all trained models is made available as a part of the Turku-neural-parsing-pipeline under the Apache 2.0 license.","authors":["Jenna Kanerva","Filip Ginter","Tapio Salakoski"],"meta":["May 2020Natural Language Engineering 27(5):1-30","DOI:10.1017/S1351324920000224"],"references":["338057358_Neural_and_rule-based_Finnish_NLP_models-expectations_experiments_and_experiences","328578083_LemmaTag_Jointly_Tagging_and_Lemmatizing_for_Morphologically_Rich_Languages_with_BRNNs","327251340_RBFOpt_an_open-source_library_for_black-box_optimization_with_costly_function_evaluations","321493950_An_Extensible_Multilingual_Open_Source_Lemmatizer","334117873_Marrying_Universal_Dependencies_and_Universal_Morphology","334116097_Universal_Dependency_Parsing_from_Scratch","325445508_Context_Sensitive_Neural_Lemmatization_with_Lematus","322590392_Evaluation_of_Finite_State_Morphological_Analyzers_Based_on_Paradigm_Extraction_from_Wiktionary","322583751_Unlabeled_Data_for_Morphological_Generation_With_Character-Based_Sequence-to-Sequence_Models","319662760_OpenNMT_Open-source_Toolkit_for_Neural_Machine_Translation"]}