{"id":"341737301_On_the_Complexity_of_Broadcast_Domination_and_Multipacking_in_Digraphs","abstract":"We study the complexity of the two dual covering and packing distance-based problems Broadcast Domination and Multipacking in digraphs. A dominating broadcast of a digraph D is a function \\(f:V(D)\\rightarrow \\mathbb {N}\\) such that for each vertex v of D, there exists a vertex t with \\(f(t)>0\\) having a directed path to v of length at most f(t). The cost of f is the sum of f(v) over all vertices v. A multipacking is a set S of vertices of D such that for each vertex v of D and for every integer d, there are at most d vertices from S within directed distance at most d from v. The maximum size of a multipacking of D is a lower bound to the minimum cost of a dominating broadcast of D. Let Broadcast Domination denote the problem of deciding whether a given digraph D has a dominating broadcast of cost at most k, and Multipacking the problem of deciding whether D has a multipacking of size at least k. It is known that Broadcast Domination is polynomial-time solvable for the class of all undirected graphs (that is, symmetric digraphs), while polynomial-time algorithms for Multipacking are known only for a few classes of undirected graphs. We prove that Broadcast Domination and Multipacking are both NP-complete for digraphs, even for planar layered acyclic digraphs of small maximum degree. Moreover, when parameterized by the solution cost/solution size, we show that the problems are respectively W[2]-hard and W[1]-hard. We also show that Broadcast Domination is FPT on acyclic digraphs, and that it does not admit a polynomial kernel for such inputs, unless the polynomial hierarchy collapses to its third level. In addition, we show that both problems are FPT when parameterized by the solution cost/solution size together with the maximum out-degree. Finally, we give for both problems polynomial-time algorithms for some subclasses of acyclic digraphs.","authors":["Florent Foucaud","Benjamin Gras","Anthony Perez","Florian Sikora"],"meta":["May 2020","DOI:10.1007/978-3-030-48966-3_20","Conference: International Workshop on Combinatorial Algorithms"],"references":["257907679_New_bounds_for_the_broadcast_domination_number_of_a_graph","228543760_Broadcast_domination_algorithms_for_interval_graphs_series-parallel_graphs_and_trees","220779503_Weak_compositions_and_their_applications_to_polynomial_lower_bounds_for_kernelization","345888442_Width-Measures_for_Directed_Graphs_and_Algorithmic_Applications","328347787_Broadcast_domination_and_multipacking_in_strongly_chordal_graphs","325430512_k_-broadcast_domination_and_k_-multipacking","323627176_Broadcast_domination_and_multipacking_bounds_and_the_integrality_gap","313903170_Parameterized_Algorithms","286276456_Kernelization_Lower_Bounds_Through_Colors_and_IDs","274354170_Introduction_to_Combinatorial_Mathematics","268669136_On_the_Difference_between_Broadcast_and_Multipacking_Numbers_of_Graphs","265548566_Dominating_broadcasts_in_graphs","262115464_Broadcast_Domination_on_Block_Graphs_in_Linear_Time","220569104_Broadcasts_in_graphs","220209682_A_Linear-Time_Algorithm_for_Broadcast_Domination_in_a_Tree","220185377_Optimal_broadcast_domination_in_polynomial_time","220149068_Kernel_bounds_for_disjoint_cycles_and_disjoint_paths","34524365_Cost_domination_in_graphs"]}