{"id":"341747439_Human_Factors_in_Model_Interpretability_Industry_Practices_Challenges_and_Needs","abstract":"As the use of machine learning (ML) models in product development and data-driven decision-making processes became pervasive in many domains, people’s focus on building a well-performing model has increasingly shifted to understanding how their model works. While scholarly interest in model interpretability has grown rapidly in research communities like HCI, ML, and beyond, little is known about how practitioners perceive and aim to provide interpretability in the context of their existing workflows. This lack of understanding of interpretability as practiced may prevent interpretability research from addressing important needs, or lead to unrealistic solutions. To bridge this gap, we conducted 22 semi-structured interviews with industry practitioners to understand how they conceive of and design for interpretability while they plan, build, and use their models. Based on a qualitative analysis of our results, we differentiate interpretability roles, processes, goals and strategies as they exist within organizations making heavy use of ML models. The characterization of interpretability work that emerges from our analysis suggests that model interpretability frequently involves cooperation and mental model comparison between people in different roles, often aimed at building trust not only between people and models but also between people within the organization. We present implications for design that discuss gaps between the interpretability challenges that practitioners face in their practice and approaches proposed in the literature, highlighting possible research directions that can better address real-world needs.","authors":["Ray Hong","Jessica Hullman","Enrico Bertini"],"meta":["May 2020Proceedings of the ACM on Human-Computer Interaction 4(CSCW1):1-26","DOI:10.1145/3392878","Project: Interpreting and Visualizing Machine Learning Models"],"references":["341747441_How_do_Data_Science_Workers_Collaborate_Roles_Workflows_and_Tools","337134874_Dissonance_Between_Human_and_Machine_Understanding","337129796_The_Principles_and_Limits_of_Algorithm-in-the-Loop_Decision_Making","335721639_Updates_in_Human-AI_Teams_Understanding_and_Addressing_the_PerformanceCompatibility_Tradeoff","335703274_Human-AI_Collaboration_in_Data_Science_Exploring_Data_Scientists'_Perceptions_of_Automated_AI","332747288_Gamut_A_Design_Probe_to_Understand_How_Data_Scientists_Understand_Machine_Learning_Models","349604900_Human-in-the-Loop_Interpretability_Prior","341690531_Interpreting_Interpretability_Understanding_Data_Scientists'_Use_of_Interpretability_Tools_for_Machine_Learning","337123164_Efficient_Elicitation_Approaches_to_Estimate_Collective_Crowd_Answers","332747870_AILA_Attentive_Interactive_Labeling_Assistant_for_Document_Classification_through_Attention-Based_Deep_Neural_Networks"]}