{"id":"341751152_Reconstructing_irreducible_links_in_temporal_networks_Which_tool_to_choose_depends_on_the_network_size","abstract":"Filtering information in complex networks entails the process of removing interactions explained by a proper null hypothesis and retaining the remaining interactions, which form the backbone network. The reconstructed backbone network depends upon the accuracy and reliability of the available tools, which, in turn, are affected by the specific features of the available dataset. Here, we examine the performance of three approaches for the discovery of backbone networks, in the presence of heterogeneous, time-varying node properties. In addition to the recently proposed evolving activity driven model, we extend two existing approaches (the disparity filter and the temporal fitness model) to tackle time-varying phenomena. Our analysis focuses on the influence of the network size, which was previously shown to be a determining factor for the performance of the evolving activity driven model. Through mathematical and numerical analysis, we propose general guidelines for the use of these three approaches based on the available dataset. For small networks, the evolving temporal fitness model offers a more reasonable trade-off between the number of links assigned to the backbone network and the accuracy of their inference. The main limitation of this methodology lies in its computational cost, which becomes excessively high for large networks. In this case, the evolving activity driven model could be a valid substitute to the evolving temporal fitness model. If one seeks to minimize the number of links inaccurately included in the backbone network at the risk of dismissing many links that could belong to it, then the temporal disparity filter would be the approach-of-choice. Overall, our contribution expands the toolbox of network discovery in the technical literature and should help users in choosing the right network discovery instrument, depending on the problem considered.","authors":["Matthieu Nadini","Alessandro Rizzo","Maurizio Porfiri"],"meta":["May 2020Journal of Physics Complexity 1(1):015001","DOI:10.1088/2632-072X/ab6727"],"references":["334656672_Detecting_network_backbones_against_time_variations_in_node_properties","331096337_A_Polya_urn_approach_to_information_filtering_in_complex_networks","330896103_Percolation_and_the_Effective_Structure_of_Complex_Networks","328294283_Weight_thresholding_on_complex_networks","327773455_STATISTICALLY_VALIDATED_LEAD-LAG_NETWORKS_and_INVENTORY_PREDICTION_in_the_FOREIGN_EXCHANGE_MARKET","326448342_Long-term_ecology_of_investors_in_a_financial_market","324744968_The_structured_backbone_of_temporal_social_ties","329480961_Epidemic_Spreading_in_Temporal_and_Adaptive_Networks_with_Static_Backbone","329476370_Controlling_the_False_Discovery_Rate_A_Practical_and_Powerful_Approach_to_Multiple_Testing","325161121_Transport_network_backbone_extraction_A_comparison_of_techniques"]}