{"id":"341740149_Preserved_layout_features_embedded_in_road_network_development","abstract":"Road networks are some of the oldest and most permanent man-made structures in space, serving as valuable records of the conditions of the society through long periods of time. Quantitatively analyzing these networks will therefore reveal rich insights into the socio-political conditions of the society through history, and can provide awareness for effectively managing the growth and evolution in the future. Here, we extracted the state of the road network of Manila, Philippines at various points in history through georeferencing and digitization of hand-drawn historical maps. Visual and metrical analyses revealed key well-planned periods punctuating the otherwise self-organized growth, particularly the more recent densification at reclamation areas coincident with the rapid economic growth. The road network of Manila shows statistical regularities that are also observed for other global road network data sets, although the recent reclamation significantly increase the statistics of the very short and peripheral nodes. Finally, the clusters of nodes with the highest closeness centralities mimic the historical shape of the network, allowing for an automatic identification of the core historical sections of the city. Studies such as this one extract useful information from these permanent spatial records, which may then be useful for developing sound policy measures for handling further urbanization.","authors":["Michelle Cirunay","Maricor Soriano","Rene Batac"],"meta":["May 2020Journal of Physics Complexity 1(1):015004","DOI:10.1088/2632-072X/ab7f4e"],"references":["326018017_From_the_betweenness_centrality_in_street_networks_to_structural_invariants_in_random_planar_graphs","318298738_Computer_vision_uncovers_predictors_of_physical_urban_change","317356677_The_scaling_structure_of_the_global_road_network","303854059_Spatializing_6000_years_of_global_urbanization_from_3700_BC_to_AD_2000","334326707_Computational_socioeconomics","334126684_Characterization_of_the_Street_Networks_in_the_Traditional_Turkish_Urban_Form","327505013_Statistical_Signatures_of_the_Spatial_Imprints_of_Road_Network_Growth","325458885_Urban_expansion_sprawl_and_inequality","322083572_Building_beyond_land_An_overview_of_coastal_land_reclamation_in_16_global_megacities","304744011_Vital_nodes_identification_in_complex_networks"]}