{"id":"341763864_Computer_science_development_and_technologies_associated_with_industry_40_applied_to_industrial_maintenance_in_Colombia","abstract":"The technologies associated with industry 4.0, have taken a leading role worldwide, because being globally competitive in the industrial sector depends not only on the real world but also on the digital world. This is why the predictive techniques used in maintenance and that currently employ technologies such as: internet of things, machine learning, big data, cyber physical Systems, Data analysis among others; to make their predictions they have defined a path in the continuous improvement of industrial processes and in the execution of the maintenance strategy. This work shows the most developed technologies 4.0 in Colombia used in industrial maintenance and exposes the country’s gaps in the development of these technologies and their use in different industrial sectors. This research was developed through the analysis of consolidated data in studies conducted by the private sector and the public in Colombia on technological developments in the country where it is evident that these technologies associated with maintenance are in growth stage and in a few sectors of industry have exploited the benefits of use.","authors":["Leidy Marcela Dueñas Ramirez","G A Villegas López"],"meta":["March 2020Journal of Physics Conference Series 1513(1):012002","DOI:10.1088/1742-6596/1513/1/012002"],"references":["327991572_The_industrial_internet_of_things_IIoT_An_analysis_framework","315318856_Cyber_physical_systems_for_predictive_production_systems","279177017_Internet_of_Things_A_Survey_on_Enabling_Technologies_Protocols_and_Applications","332177565_Machine_Learning_and_Artificial_Intelligence_as_a_Complement_to_Condition_Monitoring_in_a_Predictive_Maintenance_Setting","324734519_Artificial_Intelligence_Steps_to_Transforming_Offshore_EP_for_Vastly_Improved_Business_Outcomes","297501106_E-maintenance","289499488_Predictive_maintenance_its_implementation_and_latest_trends","263774659_Predicting_e-readiness_at_firm-level_An_analysis_of_technological_organizational_and_environmental_TOE_effects_on_e-maintenance_readiness_in_manufacturing_firms"]}