{"id":"341766189_The_Gene_of_Scientific_Success","abstract":"This article elaborates how to identify and evaluate causal factors to improve scientific impact. Currently, analyzing scientific impact can be beneficial to various academic activities including funding application, mentor recommendation, discovering potential cooperators, and the like. It is universally acknowledged that high-impact scholars often have more opportunities to receive awards as an encouragement for their hard work. Therefore, scholars spend great efforts in making scientific achievements and improving scientific impact during their academic life. However, what are the determinate factors that control scholars’ academic success? The answer to this question can help scholars conduct their research more efficiently. Under this consideration, our article presents and analyzes the causal factors that are crucial for scholars’ academic success. We first propose five major factors including article-centered factors, author-centered factors, venue-centered factors, institution-centered factors, and temporal factors. Then, we apply recent advanced machine learning algorithms and jackknife method to assess the importance of each causal factor. Our empirical results show that author-centered and article-centered factors have the highest relevancy to scholars’ future success in the computer science area. Additionally, we discover an interesting phenomenon that the h -index of scholars within the same institution or university are actually very close to each other.","authors":["Xiangjie Kong","Jun Zhang","Da Zhang","Yi Bu"],"meta":["May 2020ACM Transactions on Knowledge Discovery from Data 14(4):1-19","DOI:10.1145/3385530"],"references":["337449492_The_Evolution_of_Turing_Award_Collaboration_Network_Bibliometric-Level_and_Network-Level_Metrics","336456173_Shifu2_A_Network_Representation_Learning_Based_Model_for_Advisor-advisee_Relationship_Mining","326329515_Hot_streaks_in_artistic_cultural_and_scientific_careers","323502497_Science_of_science","319134622_The_Role_of_Positive_and_Negative_Citations_in_Scientific_Evaluation","318185893_Exploring_time_factors_in_measuring_the_scientific_impact_of_scholars","316262886_Scientific_collaboration_patterns_vary_with_scholars'_academic_ages","313289970_A_multiple-link_mutually_reinforced_journal-ranking_model_to_measure_the_prestige_of_journals","323155490_Learning_to_Infer_Competitive_Relationships_in_Heterogeneous_Networks","313594211_Standing_on_the_shoulders_of_giants"]}