{"id":"341746033_IoT_Botnet_Forensics_A_Comprehensive_Digital_Forensic_Case_Study_on_Mirai_Botnet_Servers","abstract":"Internet of Things (IoT) bot malware is relatively new and not yet well understood forensically, despite its potential role in a broad range of malicious cyber activities. For example, it was abused to facilitate the distributed denial of service (DDoS) attack that took down a significant portion of the Internet on October 21, 2016, keeping millions of people from accessing over 1200 websites, including Twitter and NetFlix for nearly an entire day. The widespread adoption of an estimated 50 billion IoT devices, as well as the increasing interconnectivity of those devices to traditional networks, not to mention to one another with the advent of fifth generation (5G) networks, underscore the need for IoT botnet forensics. This study is the first published, comprehensive digital forensic case study on one of the most well known families of IoT bot malware - Mirai. Past research has largely studied the botnet architecture and analyzed the Mirai source code (and that of its variants) through traditional static and dynamic malware analysis means, but has not fully and forensically analyzed infected devices or Mirai network devices. In this paper, we set up a fully functioning Mirai botnet network architecture and conduct a comprehensive forensic analysis on the Mirai botnet server. We discuss forensic artifacts left on the attacker's terminal, command and control (CNC) server, database server, scan receiver and loader, as well as the network packets therefrom. We discuss how a forensic investigator might acquire some of these artifacts remotely, without direct physical access to the botnet server itself. This research provides findings tactically useful to forensic investigators, not only from the perspective of what data can be obtained (e.g., IP addresses of bot members), but also important information about which device they should target for acquisition and investigation to obtain the most investigatively useful information.","authors":["Xiaolu Zhang","Oren Upton","Nicole Lang Beebe","Kim-Kwang Raymond Choo"],"meta":["April 2020Forensic Science International Digital Investigation 32:300926","DOI:10.1016/j.fsidi.2020.300926"],"references":["335907378_Digital_Forensics_for_IoT_and_WSNs","332591327_How_Do_I_Share_My_IoT_Forensic_Experience_With_the_Broader_Community_An_Automated_Knowledge_Sharing_IoT_Forensic_Platform","328843826_Delving_Into_Internet_DDoS_Attacks_by_Botnets_Characterization_and_Analysis","348915534_Measurement_and_Analysis_of_Hajime_a_Peer-to-peer_IoT_Botnet","331973604_IoT_Forensics_Amazon_Echo_as_a_Use_Case","325994765_An_In-Depth_Analysis_of_the_Mirai_Botnet","322875866_Taxonomy_of_malware_analysis_in_the_IoT","321741847_The_Mirai_botnet_and_the_IoT_Zombie_Armies","321259545_Analysis_of_Mirai_malicious_software","320123687_Analysis_and_Impact_of_IoT_Malware"]}