{"id":"341739192_Simplicial_complexes_higher-order_spectral_dimension_and_dynamics","abstract":"Simplicial complexes constitute the underlying topology of interacting complex systems including among the others brain and social interaction networks. They are generalized network structures that allow to go beyond the framework of pairwise interactions and to capture the many-body interactions between two or more nodes strongly affecting dynamical processes. In fact, the simplicial complexes topology allows to assign a dynamical variable not only to the nodes of the interacting complex systems but also to links, triangles, and so on. Here we show evidence that the dynamics defined on simplices of different dimensions can be significantly different even if we compare dynamics of simplices belonging to the same simplicial complex. By investigating the spectral properties of the simplicial complex model called ‘network geometry with flavor’ (NGF) we provide evidence that the up and down higher-order Laplacians can have a finite spectral dimension whose value depends on the order of the Laplacian. Finally we discuss the implications of this result for higher-order diffusion defined on simplicial complexes showing that the n -order diffusion dynamics have a return type distribution that can depends on n as it is observed in NGFs.","authors":["Joaquín J Torres","Ginestra Bianconi"],"meta":["May 2020Journal of Physics Complexity 1(1):015002","DOI:10.1088/2632-072X/ab82f5"],"references":["335239712_Functional_Geometry_of_Human_Connectomes","333642405_Simplicial_models_of_social_contagion","328241551_Simplicial_complexes_and_complex_systems","323622973_A_Graph_Signal_Processing_Perspective_on_Functional_Brain_Imaging","338811703_The_spectral_dimension_of_simplicial_complexes_a_renormalization_group_theory","334616220_Spectral_properties_of_hyperbolic_nanonetworks_with_tunable_aggregation_of_simplexes","333883865_Abrupt_Desynchronization_and_Extensive_Multistability_in_Globally_Coupled_Oscillator_Simplexes","331050666_Synchronization_in_network_geometries_with_finite_spectral_dimension","329293498_Simplicial_Activity_Driven_Model","329112398_Topological_percolation_on_hyperbolic_simplicial_complexes"]}