{"id":"341709453_Intervention_mathematique_a_l'aide_du_logiciel_informatique_DeCaLigne_ciblant_la_ligne_numerique_et_le_calcul_chez_les_enfants_ayant_un_trouble_des_apprentissages_en_mathematiques","abstract":"Intervention mathématique à l'aide du logiciel informatique DéCaLigne ciblant la ligne numérique et le calcul chez les enfants ayant un trouble des apprentissages en mathématiques. Résumé : Les individus ayant un trouble des apprentissages en mathématiques (TAM) ont souvent des difficultés pour estimer de manière précise la position des nombres sur la ligne numérique ; ces déficits peuvent ainsi expliquer pourquoi l'arithmétique semble si complexe. L'objectif de cette recherche était d'évaluer l'efficacité d'un protocole d'intervention intensive, individualisée et ciblant la ligne numérique, sur la précision numérique (performances en placement de nombres) et en calcul chez les enfants ayant un TAM. Deux jeunes ayant un TAM (9 ans et 15 ans) ont suivi une intervention entraînant l'estimation et le calcul avec des feedbacks correctifs à l'aide du logiciel DéCaLigne à raison de trois séances de trente minutes par semaine pendant quatre semaines. Leurs performances ont été évaluées quatre fois : un mois et immédiatement avant l'intervention pour avoir une ligne de base et apprécier l'évolution spontanée, immédiatement après l'intervention pour évaluer l'apprentissage et un mois après l'intervention pour mesurer le maintien des apprentissages. Les jeunes ont été évalués sur leur précision numérique (par exemple : placement de nombres sur ligne numérique), leurs performances en résolution d'addition et de soustraction avec la ligne numérique (apprentissage) et sans (transfert au calcul mental). Les résultats ont montré que les deux jeunes améliorent significativement leur précision numérique ainsi que leur capacité de calcul, avec et sans ligne numérique, de manière spécifique. De plus, un maintien des effets de l'intervention est observé un mois après. En conclusion, les résultats suggèrent une relation de causalité entre l'amélioration de la précision sur ligne numérique et l'amélioration en calcul mental. L'efficacité démontrée de l'intervention sur la précision numérique et le calcul est encourageante pour la pratique clinique orthophonique. Toutefois, des réplications sont nécessaires pour que l'étude soit reconnue comme probante.","authors":["Marcon Laetitia","Anne Lafay"],"meta":["May 2020","Project: Effect of Intervention in Children with Math Learning Disabilities"],"references":["332231937_Cognitive_Heterogeneity_of_Math_Difficulties_A_Bottom-up_Classification_Approach","331303611_Trouble_des_apprentissages_en_mathematiques_et_ligne_numerique_revue_systematique_de_la_litterature","326273510_The_Roles_of_Transfer_of_Learning_and_Forgetting_in_the_Persistence_and_Fadeout_of_Early_Childhood_Mathematics_Interventions","319645983_Number_Line_Estimation_Predicts_Mathematical_Skills_Difference_in_Grades_2_and_4","318729914_Counting_on_the_mental_number_line_to_make_a_move_sensorimotor_'pen'_control_and_numerical_processing","326135155_Investigating_the_respective_contribution_of_sensory_modalities_and_spatial_disposition_for_arithmetic_teaching","323178327_Associations_of_Number_Line_Estimation_With_Mathematical_Competence_A_Meta-analysis","322499660_Les_apports_de_l'Evidence-Based_Practice_et_de_la_Practice-Based_Evidence_du_bilan_initial_a_l'auto-evaluation_du_clinicien","322487305_Specific_learning_disability_in_mathematics_A_comprehensive_review","316780989_Strategies_Students_With_and_Without_Mathematics_Disabilities_Use_When_Estimating_Fractions_on_Number_Lines","315505855_Functional_hyperconnectivity_vanishes_in_children_with_developmental_dyscalculia_after_numerical_intervention","310735007_Improving_Preschoolers'_Arithmetic_through_Number_Magnitude_Training_The_Impact_of_Non-Symbolic_and_Symbolic_Training","308180877_Early_math_learning_with_tablet_PCs_The_role_of_action","301534693_Magnitude_knowledge_The_common_core_of_numerical_development","301826273_Place-value_understanding_in_number_line_estimation_predicts_future_arithmetic_performance"]}