{"id":"341737765_Modelling_the_spread_of_COVID-19_with_new_fractal-fractional_operators_Can_the_lockdown_save_mankind_before_vaccination","abstract":"Countries around the world are implementing lock-down measures in a bid to flatten the curve of the new deadly COVID-19 disease. Our paper does not claim to have found the cure for COVID-19, neither does it claim that the suggested model have taken into account all the complexities around the spread of the disease. Nonetheless, the fundamental question asked in this paper is to know if within the conditions taken into account in this suggested model, the integral lock-down is effective in saving human lives. To answer this question, a mathematical model was suggested taking into account the possibility of transmission of COVID-19 from dead bodies to humans and the effect of lock-down. Three cases were considered. The first case suggested that there is transmission from dead to the living (medical staffs as they perform postmortem procedures on corpses, and direct contacts with during burial ceremonies). This case has no equilibrium points except for disease free equilibrium, a clear indication that care must be taken when dealing with corpses due to corona-19. In the second case we removed the transmission rate from dead bodies. This case showed an equilibrium point, although the number of deaths, carriers and infected grew exponentially up to a certain stability level. In the last case, we incorporated a lock-down and social distancing effect, using the next generation matrix. We could achieve a zero reproduction number, with number of deaths, infected and carriers decaying very rapidly. This is a clear indication that if lock-down recommendations are observed the threat of COVID-19 can be reduced to zero in few months.While our mathematical model agrees with the effectiveness of the lock-down, it is important to mention damaging effects of inadequate testing. The long waiting period of few days before confirmation of status, can only lead to more infections. The asymptomatic tested person could be positive and spread the infection, or could contact the virus in days after testing and will spread the disease further, after being given a false result. Testing kit that with immediate results are needed for more efficient measures. We used Italy’s Data to guide the construction of the mathematical model. To include non-locality into mathematical formulas, differential and integral operators were suggested. Properties and numerical approximations were presented in details. Finally, the suggested differential and integral operators were applied to the model.","authors":["Abdon Atangana"],"meta":["July 2020Chaos Solitons & Fractals 136(1):109860","DOI:10.1016/j.chaos.2020.109860"],"references":["347992531_Modeling_the_dynamics_of_novel_coronavirus_2019-nCov_with_fractional_derivative","347537065_Some_misinterpretations_and_lack_of_understanding_in_differential_operators_with_no_singular_kernels","342663788_A_Mathematical_Model_of_Treatment_and_Vaccination_Interventions_of_Pneumococcal_Pneumonia_Infection_Dynamics","339568707_A_mathematical_model_for_simulating_the_phase-based_transmissibility_of_a_novel_coronavirus","339343754_2019_Novel_coronavirus_where_we_are_and_what_we_know","323771573_A_Mathematical_Model_of_Treatment_and_Vaccination_Interventions_of_Pneumococcal_Pneumonia_Infection_Dynamics","21039073_On_the_Definition_and_the_Computation_of_the_Basic_Reproduction_Ratio_R0_in_Models_For_Infectious-Diseases_in_Heterogeneous_Populations","339511214_A_time_delay_dynamic_system_with_external_source_for_the_local_outbreak_of_2019-nCoV","338493669_Welcome_to_our_new_Section_Editors_in_INFECTION","337403627_New_numerical_method_for_ordinary_differential_equations_Newton_polynomial","335470980_Numerical_analysis_of_a_new_Volterra_integro-differential_equation_involving_fractal-fractional_operators","334362710_Analysis_of_a_new_partial_integro-differential_equation_with_mixed_fractional_operators","316453488_Fractal-fractional_differentiation_and_integration_Connecting_fractal_calculus_and_fractional_calculus_to_predict_complex_system","271832776_Reproduction_Numbers_and_Sub-threshold_Endemic_Equilibria_for_Compartmental_Models_of_Disease_Transmission"]}