{"id":"341761601_Quantum_machine_learning_and_quantum_biomimetics_A_perspective","abstract":"Quantum machine learning has emerged as an exciting and promising paradigm inside quantum technologies. It may permit, on the one hand, to carry out more efficient machine learning calculations by means of quantum devices, while, on the other hand, to employ machine learning techniques to better control quantum systems. Inside quantum machine learning, quantum reinforcement learning aims at developing 'intelligent' quantum agents that may interact with the outer world and adapt to it, with the strategy of achieving some final goal. Another paradigm inside quantum machine learning is that of quantum autoencoders, which may allow one for employing fewer resources in a quantum device via a training process. Moreover, the field of quantum biomimetics aims at establishing analogies between biological and quantum systems, to look for previously inadvertent connections that may enable useful applications. Two recent examples are the concepts of quantum artificial life, as well as of quantum memristors. In this Perspective, we give an overview of these topics, describing the related research carried out by the scientific community.","authors":["Lucas Lamata"],"meta":["July 2020Machine Learning Science and Technology 1(3):033002","DOI:10.1088/2632-2153/ab9803","Project: Biomimetic Quantum Technologies and Quantum Machine Learning"],"references":["341764131_A_differentiable_programming_method_for_quantum_control","341296297_A_reinforcement_learning_approach_for_quantum_state_engineering","340729486_Supervised_learning_of_time-independent_Hamiltonians_for_gate_design","340539811_Machine_Learning_Non-Markovian_Quantum_Dynamics","339236903_Machine_Learning_Transfer_Efficiencies_for_Noisy_Quantum_Walks","339044683_Repetitive_readout_enhanced_by_machine_learning","345598040_Supervised_Learning_with_Quantum_Computers","345383755_Modeling_and_control_of_a_reconfigurable_photonic_circuit_using_deep_learning","345005813_Computer-inspired_quantum_experiments","339985876_A_non-review_of_Quantum_Machine_Learning_trends_and_explorations"]}