{"id":"341840878_Top-Down_Construction_of_Independent_Spanning_Trees_in_Alternating_Group_Networks","abstract":"A set of spanning trees in a graph G is called independent spanning trees (ISTs) if they are rooted at the same vertex r, and for each vertex v(≠ r) in G, the two paths from v to r in any two trees share no common vertex expect for v and r. ISTs can be applied in many research fields, such as fault-tolerant broadcasting and secure message distribution in reliable communication networks. Since Cayley graphs have been widely used to design interconnection networks, constructing ISTs on cayley graphs is worth studying. The alternating group network is a subclass of Cayley graphs, and the approach of constructing ISTs in alternating group networks is still unknown. In this paper, we propose a novel and simple top-down approach for constructing ISTs in alternating group networks. The main ideas of the algorithm are to use induction to develop small trees to big trees, to use a triangle breadth-first search (TBFS) process to create a backbone of an IST, and to use breadth-first search (BFS) process to connect the rest of nodes. Compared to other methods of different interconnection networks in the literature, the uniqueness of our method is that it does not need to determine the parent of one node by any rule, on the contrary others determine that by rules. The time complexity in n-dimensional alternating group network ANn is O(n2 × n!), where n! is twice the number of nodes of ANn; hence it is polynomial time. We implement the algorithm in PHP and run cases from AN3 to AN10. The results reveal that all spanning trees of AN3 to AN10 are independent and that our algorithm is accurate and efficient.","authors":["Jie-Fu Huang","Shih-Shun Kao","Sun-Yuan Hsieh","Ralf Klasing"],"meta":["June 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.2999421"],"references":["333699968_Amortized_efficiency_of_constructing_multiple_independent_spanning_trees_on_bubble-sort_networks","301755220_Construction_independent_spanning_trees_on_locally_twisted_cubes_in_parallel","228057767_The_Multi-Tree_Approach_To_Reliability_In_Distributed_Networks","312216112_Node-Independent_Spanning_Trees_in_Gaussian_Networks","274171451_Constructive_Algorithm_of_Independent_Spanning_Trees_on_Mobius_Cubes","257252088_An_efficient_parallel_construction_of_optimal_independent_spanning_trees_on_hypercubes","257145081_An_algorithm_to_construct_independent_spanning_trees_on_parity_cubes","256721175_Independent_spanning_trees_in_crossed_cubes","256416951_The_connectivity_of_hierarchical_Cayley_digraphs","239329249_A_New_Class_of_Cayley_Networks_Based_on_the_Alternating_Groups"]}