{"id":"341873177_MetaLight_Value-Based_Meta-Reinforcement_Learning_for_Traffic_Signal_Control","abstract":"Using reinforcement learning for traffic signal control has attracted increasing interests recently. Various value-based reinforcement learning methods have been proposed to deal with this classical transportation problem and achieved better performances compared with traditional transportation methods. However, current reinforcement learning models rely on tremendous training data and computational resources, which may have bad consequences (e.g., traffic jams or accidents) in the real world. In traffic signal control, some algorithms have been proposed to empower quick learning from scratch, but little attention is paid to learning by transferring and reusing learned experience. In this paper, we propose a novel framework, named as MetaLight, to speed up the learning process in new scenarios by leveraging the knowledge learned from existing scenarios. MetaLight is a value-based meta-reinforcement learning workflow based on the representative gradient-based meta-learning algorithm (MAML), which includes periodically alternate individual-level adaptation and global-level adaptation. Moreover, MetaLight improves the-state-of-the-art reinforcement learning model FRAP in traffic signal control by optimizing its model structure and updating paradigm. The experiments on four real-world datasets show that our proposed MetaLight not only adapts more quickly and stably in new traffic scenarios, but also achieves better performance.","authors":["Xinshi Zang","Huaxiu Yao","Guanjie Zheng","Nan Xu"],"meta":["April 2020Proceedings of the AAAI Conference on Artificial Intelligence 34(01):1153-1160","DOI:10.1609/aaai.v34i01.5467"],"references":["337015486_Learning_Phase_Competition_for_Traffic_Signal_Control","334715234_PressLight_Learning_Max_Pressure_Control_to_Coordinate_Traffic_Signals_in_Arterial_Network","326504263_IntelliLight_A_Reinforcement_Learning_Approach_for_Intelligent_Traffic_Light_Control","303970238_Learning_to_learn_by_gradient_descent_by_gradient_descent","235793281_Traffic_Light_Control_in_Non-stationary_Environments_based_on_Multi_Agent_Q-learning","228593853_Reinforcement_Learning_for_True_Adaptive_Traffic_Signal_Control","337015177_Learning_Traffic_Signal_Control_from_Demonstrations","333067562_CityFlow_A_Multi-Agent_Reinforcement_Learning_Environment_for_Large_Scale_City_Traffic_Scenario","321098959_Adaptive_traffic_signal_control_with_actor-critic_methods_in_a_real-world_traffic_network_with_different_traffic_disruption_events","272837232_Human-level_control_through_deep_reinforcement_learning"]}