{"id":"341886409_FakeNewsNet_A_Data_Repository_with_News_Content_Social_Context_and_Spatiotemporal_Information_for_Studying_Fake_News_on_Social_Media","abstract":"Social media has become a popular means for people to consume and share the news. At the same time, however, it has also enabled the wide dissemination of fake news, that is, news with intentionally false information, causing significant negative effects on society. To mitigate this problem, the research of fake news detection has recently received a lot of attention. Despite several existing computational solutions on the detection of fake news, the lack of comprehensive and community-driven fake news data sets has become one of major roadblocks. Not only existing data sets are scarce, they do not contain a myriad of features often required in the study such as news content, social context, and spatiotemporal information. Therefore, in this article, to facilitate fake news-related research, we present a fake news data repository FakeNewsNet, which contains two comprehensive data sets with diverse features in news content, social context, and spatiotemporal information. We present a comprehensive description of the FakeNewsNet, demonstrate an exploratory analysis of two data sets from different perspectives, and discuss the benefits of the FakeNewsNet for potential applications on fake news study on social media.","authors":["Kai Shu","Deepak Mahudeswaran","Suhang Wang","Dongwon Lee"],"meta":["June 2020Big Data 8(3):171-188","DOI:10.1089/big.2020.0062","Project: Cyberbullying"],"references":["343794894_BuzzFace_A_News_Veracity_Dataset_withFacebook_User_Commentary_and_Egos","332864316_dEFEND_Explainable_Fake_News_Detection","329590584_Early_Detection_of_Fake_News_on_Social_Media_Through_Propagation_Path_Classification_with_Recurrent_and_Convolutional_Networks","328432132_Beyond_News_Content_The_Role_of_Social_Context_for_Fake_News_Detection","328271325_FakeNewsTracker_a_tool_for_fake_news_collection_detection_and_visualization","327730339_Studying_Fake_News_via_Network_Analysis_Detection_and_Mitigation","326203973_Neural_User_Response_Generator_Fake_News_Detection_with_Collective_User_Intelligence","323387293_Unsupervised_Content-Based_Identification_of_Fake_News_Articles_with_Tensor_Decomposition_Ensembles","334214010_Detecting_Fake_News_on_Social_Media","323649207_The_spread_of_true_and_false_news_online"]}