{"id":"3418856_Coevolutionary_Free_Lunches","abstract":"Recent work on the foundational underpinnings of black-box optimization has begun to uncover a rich mathematical structure. In particular, it is now known that an inner product between the optimization algorithm and the distribution of optimization problems likely to be encountered fixes the distribution over likely performances in running that algorithm. One ramification of this is the \"No Free Lunch\" (NFL) theorems, which state that any two algorithms are equivalent when their performance is averaged across all possible problems. This highlights the need for exploiting problem-specific knowledge to achieve better than random performance. In this paper, we present a general framework covering most optimization scenarios. In addition to the optimization scenarios addressed in the NFL results, this framework covers multiarmed bandit problems and evolution of multiple coevolving players. As a particular instance of the latter, it covers \"self-play\" problems. In these problems, the set of players work together to produce a champion, who then engages one or more antagonists in a subsequent multiplayer game. In contrast to the traditional optimization case where the NFL results hold, we show that in self-play there are free lunches: in coevolution some algorithms have better performance than other algorithms, averaged across all possible problems. However, in the typical coevolutionary scenarios encountered in biology, where there is no champion, the NFL theorems still hold.","authors":["David H. Wolpert","William G. Macready"],"meta":["January 2006IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council 9(6):721 - 735","DOI:10.1109/TEVC.2005.856205","SourceIEEE Xplore"],"references":["266218349_A_G-function_approach_to_fitness_minima_fitness_maxima_evolutionary_stable_strategies_and_adaptive_landscapes","324396684_Game_Theory","313706874_Adaptation_in_natural_and_artificial_systems","281266055_No_Free_Lunch_Theorems_for_Optimization","265325910_Handbook_of_Game_Theory_with_Economic_Applications","263612867_A_No-Free-Lunch_Theorem_for_Non-Uniform_Distributions_of_Target_Functions","251509768_What_can_we_learn_from_No_Free_Lunch_AFirst_Attempt_to_Characterize_the_Concept_of_a_Searchable_Function","244501397_Simulation_of_biological_evolution_and_machine_learning_Journal_of_Theoretical_Biology_17_319","244455996_Co-evolving_improves_simulated_evolution_as_an_optimization_procedure","242356870_Adaptation_In_Natural_And_Artificial_Systems"]}