{"id":"341802125_Sex_and_gender_differences_and_biases_in_artificial_intelligence_for_biomedicine_and_healthcare","abstract":"Precision Medicine implies a deep understanding of inter-individual differences in health and disease that are due to genetic and environmental factors. To acquire such understanding there is a need for the implementation of different types of technologies based on artificial intelligence (AI) that enable the identification of biomedically relevant patterns, facilitating progress towards individually tailored preventative and therapeutic interventions. Despite the significant scientific advances achieved so far, most of the currently used biomedical AI technologies do not account for bias detection. Furthermore, the design of the majority of algorithms ignore the sex and gender dimension and its contribution to health and disease differences among individuals. Failure in accounting for these differences will generate sub-optimal results and produce mistakes as well as discriminatory outcomes. In this review we examine the current sex and gender gaps in a subset of biomedical technologies used in relation to Precision Medicine. In addition, we provide recommendations to optimize their utilization to improve the global health and disease landscape and decrease inequalities.","authors":["Davide Cirillo","Silvina Catuara Solarz","Czuee Morey","Emre Guney"],"meta":["December 2020npj Digital Medicine 3(1)","DOI:10.1038/s41746-020-0288-5"],"references":["346017792_A_Survey_on_Explainable_Artificial_Intelligence_XAI_Toward_Medical_XAI","334381622_Uncovering_and_Mitigating_Algorithmic_Bias_through_Learned_Latent_Structure","333999132_Health_of_Non-binary_and_Genderqueer_People_A_Systematic_Review","336791156_Dissecting_racial_bias_in_an_algorithm_used_to_manage_the_health_of_populations","335783455_Mitigating_Gender_Bias_in_Natural_Language_Processing_Literature_Review","335781085_Women's_Syntactic_Resilience_and_Men's_Grammatical_Luck_Gender-Bias_in_Part-of-Speech_Tagging_and_Dependency_Parsing","334151990_Evolving_Sex_and_Gender_in_Electronic_Health_Records","334046858_Social_Robots_for_Hospitalized_Children","333934320_The_Pregnancy_Pickle_Evolved_Immune_Compensation_Due_to_Pregnancy_Underlies_Sex_Differences_in_Human_Diseases","333496802_Disrupting_gender_norms_in_health_systems_making_the_case_for_change"]}