{"id":"341826924_Resource_allocation_in_one-dimensional_distributed_service_networks","abstract":"We consider assignment policies that allocate resources to users, where both resources and users are located on a one-dimensional line [0,∞). First, we consider unidirectional assignment policies that allocate resources only to users located to their left. We propose the Move to Right (MTR) policy, which scans from left to right assigning nearest rightmost available resource to a user, and contrast it to the Unidirectional Gale-Shapley (UGS) matching policy. While both policies among all unidirectional policies, minimize the expected distance traveled by a request (request distance), MTR is fairer. Moreover, we show that when user and resource locations are modeled by statistical point processes, and resources are allowed to satisfy more than one user, the spatial system under unidirectional policies can be mapped into bulk service queueing systems, thus allowing the application of many queueing theory results that yield closed form expressions. As we consider a case where different resources can satisfy different numbers of users, we also generate new results for bulk service queues. We also consider bidirectional policies where there are no directional restrictions on resource allocation and develop an algorithm for computing the optimal assignment which is more efficient than known algorithms in the literature when there are more resources than users. Numerical evaluation of performance of unidirectional and bidirectional allocation schemes yields design guidelines beneficial for resource placement. Finally, we present a heuristic algorithm, which leverages the optimal dynamic programming scheme for one-dimensional inputs to obtain approximate solutions to the optimal assignment problem for the two-dimensional scenario and empirically yields request distances within a constant factor of the optimal solution.","authors":["Nitish Kumar Panigrahy","Prithwish Basu","Philippe Nain","Don Towsley"],"meta":["June 2020Performance Evaluation 142:102110","DOI:10.1016/j.peva.2020.102110"],"references":["336189757_Resource_Allocation_in_One-Dimensional_Distributed_Service_Networks","225761347_A_polynomial_time_primal_network_simplex_algorithm_for_minimum_cost_flows","222571757_The_Internet_of_Things_A_Survey","222568559_On_the_application_of_Rouche's_theorem_in_queueing_theory","220428756_Stochastic_Model_and_Connectivity_Dynamics_for_VANETs_in_Signalized_Road_Systems","329476921_On_Queueing_Processes_with_Bulk_Service","323715811_College_Admissions_and_the_Stability_of_Marriage","242930704_On_a_Generalized_MG1_Queuing_Process_in_Which_the_First_Customer_of_Each_Busy_Period_Receives_Exceptional_Service","231845711_The_effect_of_queue_discipline_on_waiting_time_variance","220618218_On_a_Greedy_Heuristic_for_Complete_Matching"]}