{"id":"341842948_Artificial_intelligence_in_cornea_refractive_and_cataract_surgery","abstract":"Purpose of review: \nThe subject of artificial intelligence has recently been responsible for the advancement of many industries including aspects of medicine and many of its subspecialties. Within ophthalmology, artificial intelligence technology has found ways of improving the diagnostic and therapeutic processes in cornea, glaucoma, retina, and cataract surgery. As demands on the modern ophthalmologist grow, artificial intelligence can be utilized to help address increased demands of modern medicine and ophthalmology by adding to the physician's clinical and surgical acumen. The purpose of this review is to highlight the integration of artificial intelligence into ophthalmology in recent years in the areas of cornea, refractive, and cataract surgery.\n\nRecent findings: \nWithin the realms of cornea, refractive, and cataract surgery, artificial intelligence has played a major role in identifying ways of improving diagnostic detection. In keratoconus, artificial intelligence algorithms may help with the early detection of keratoconus and other ectatic disorders. In cataract surgery, artificial intelligence may help improve the performance of intraocular lens (IOL) calculation formulas. Further, with its potential integration into automated refraction devices, artificial intelligence can help provide an improved framework for IOL formula optimization that is more accurate and customized to a specific cataract surgeon.\n\nSummary: \nThe future of artificial intelligence in ophthalmology is a promising prospect. With continued advancement of mathematical and computational algorithms, corneal disease processes can be diagnosed sooner and IOL calculations can be made more accurate.","authors":["Aazim Siddiqui","John G. Ladas","Jimmy K. Lee"],"meta":["June 2020Current Opinion in Ophthalmology Publish Ahead of Print(4)","DOI:10.1097/ICU.0000000000000673"],"references":["327310640_Current_state_and_future_prospects_of_artificial_intelligence_in_ophthalmology_a_review_Artificial_intelligence_in_ophthalmology","321511806_Intraocular_lens_calculations_in_atypical_eyes","312199357_Artificial_Intelligence_in_Medicine","49706828_Formula_choice_Hoffer_Q_Holladay_1_or_SRKT_and_refractive_outcomes_in_8108_eyes_after_cataract_surgery_with_biometry_by_partial_coherence_interferometry","338793625_Artificial_intelligence_in_ophthalmology_Current_applications_and_emerging_issues","331386942_Introduction_to_artificial_intelligence_in_medicine","328589849_Development_of_an_artificial_intelligence_system_to_classify_pathology_and_clinical_features_on_retinal_fundus_images","321755280_Development_and_Validation_of_a_Deep_Learning_System_for_Diabetic_Retinopathy_and_Related_Eye_Diseases_Using_Retinal_Images_From_Multiethnic_Populations_With_Diabetes","282871319_A_3-D_Super_Surface_Combining_Modern_Intraocular_Lens_Formulas_to_Generate_a_Super_Formula_and_Maximize_Accuracy"]}