{"id":"341805005_Frequency-Domain_Prony_Method_for_Autoregressive_Model_Identification_and_Sinusoidal_Parameter_Estimation","abstract":"In this study, the weighted integral method for identifying differential equation models is extended to a discrete-time system with a difference equation (DE) model and a finite-length sampled data sequence, and obtain a frequency-domain algorithm for short-time signal analysis and frequency estimation. The derivation consists of three steps. 1) Provide the DE (autoregressive model) with unknown coefficients, which is satisfied in a finite observation interval. 2) Discrete Fourier transform (DFT) the DE to obtain algebraic equations (AEs) among the Fourier coefficients. Two mathematical techniques are introduced to maintain the circulant nature of time shifts. 3) Simultaneously solve a sufficient number of AEs with least squares criterion to obtain unknowns exactly when the driving term is absent, or to obtain unknowns that minimize the driving power when it is present. The methods developed enable a decomposed processing of identification and estimation in the frequency domain. Thus, they will be suitable for maximizing statistical efficiency (smallness of estimation error variance), reducing the computational cost, and use in a resolution-enhanced time-frequency analysis of real-world signals. The performance of the proposed methods are compared with those of several DFT-based methods and Cramer-Rao lower bound. Also, the interference effect and its reduction in frequency-decomposed processing are examined.","authors":["Shigeru Ando"],"meta":["June 2020IEEE Transactions on Signal Processing 68(99)","DOI:10.1109/TSP.2020.2998929"],"references":["314226636_Advances_in_Automotive_Radar_A_framework_on_computationally_efficient_high-resolution_frequency_estimation","263316028_Spatial_filtering_velocimetry_revisited_Exact_short-time_detecting_schemes_from_arbitrarily_small-size_reticles","257749529_Partial_differential_equation-based_localization_of_a_monopole_source_from_a_circular_array","338562796_Frequency_estimation_techniques_in_capacitance-to-frequency_conversion_measurement","329606789_Fast_and_Efficient_Sinusoidal_Frequency_Estimation_by_Using_the_DFT_Coefficients","277895806_An_Efficient_Frequency_and_Phase_Estimation_Algorithm_With_CRB_Performance_for_FMCW_Radar_Applications","275257049_A_Complex_Least_Squares_Enhanced_Smart_DFT_Technique_for_Power_System_Frequency_Estimation","267441599_The_estimation_and_tracking_of_frequency_Reprint_of_the_2001_hardback_ed","266685099_Cadzow's_basic_algorithm_alternating_projections_and_singular_spectrum_analysis","242795218_Approximate_maximum_likelihood_frequency_estimation1_2"]}