{"id":"341874244_Genetic_Algorithm_with_Comprehensive_Sequential_Constructive_Crossover_for_the_Travelling_Salesman_Problem","abstract":"The travelling salesman problem (TSP) is a very famous NP-hard problem in operations research as well as in computer science. To solve the problem several genetic algorithms (GAs) are developed which depend primarily on crossover operator. The crossover operators are classified as distance-based crossover operators and blind crossover operators. The distance-based crossover operators use distances between nodes to generate the offspring(s), whereas blind crossover operators are independent of any kind of information of the problem, except follow the problem’s constraints. Selecting better crossover operator can lead to successful GA. Several crossover operators are available in the literature for the TSP, but most of them are not leading good GA. In this study, we propose reverse greedy sequential constructive crossover (RGSCX) and then comprehensive sequential constructive crossover (CSCX) for developing better GAs for solving the TSP. The usefulness of our proposed crossover operators is shown by comparing with some distance-based crossover operators on some TSPLIB instances. It can be concluded from the comparative study that our proposed operator CSCX is the best crossover in this study for the TSP.","authors":["Zakir Hussain Ahmed"],"meta":["May 2020International Journal of Advanced Computer Science and Applications 11(5)","DOI:10.14569/IJACSA.2020.0110533","Project: Technical SCIENCE  ⚙️"],"references":["336825514_Performance_Analysis_of_Hybrid_Genetic_Algorithms_for_the_Generalized_Assignment_Problem","329829390_The_Minimum_Latency_Problem_A_Hybrid_Genetic_Algorithm","318243943_Good_Practice_Proposal_for_the_Implementation_Presentation_and_Comparison_of_Metaheuristics_for_Solving_Routing_Problems","281438021_Bidirectional_Constructive_Crossover_for_Evolutionary_Approach_to_Travelling_Salesman_Problem","264819943_Improved_genetic_algorithms_for_the_travelling_salesman_problem","262237452_A_Hybrid_Genetic_Algorithm_for_the_Bottleneck_Traveling_Salesman_Problem","261375073_The_Ordered_Clustered_Travelling_Salesman_Problem_A_Hybrid_Genetic_Algorithm","290252743_Pheromone-based_crossover_operator_of_genetic_algorithm_for_the_traveling_salesman_problem","288854638_Assessing_Different_Crossover_Operators_for_Travelling_Salesman_Problem","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning"]}