{"id":"341823148_Revisiting_Maximum_Log-Likelihood_Parameter_Estimation_for_Two-Parameter_Weibull_Distributions_Theory_and_Applications","abstract":"In this article, we reexamine properties of maximum log-likelihood parameter estimation for two-parameter Weibull distributions which have been applied in many different sciences. Besides closed form expressions for the mean and the variance of Weibull distributions, finding reasons for this popularity regarding its use in maximum log-likelihood parameter estimation is a key question. Our attempt to theoretically answer it-and also our main contribution-is a thorough existence and uniqueness proof for a global maximizer with respect to the parameter space, even though the log-likelihood function is in general non-convex. To establish this goal, we first provide existence and uniqueness of local maximizers by Schauder's first fixed point theorem, monotony arguments and local concavity of its Hessian matrix. Thus, we can prove our main result of existence and uniqueness of a global maximizer by considering all limiting cases with respect to the parameter space. We then strengthen our theoretical findings on four data sets. On the one hand, two synthetic data sets underline our need for our data assumptions while, on the other hand, we choose two data sets from wind engineering and reliability engineering to demonstrate usefulness in real-world applications.","authors":["Benjamin Wacker","Thomas Kneib","Jan Schlueter"],"meta":["June 2020","DOI:10.13140/RG.2.2.15909.73444/2"],"references":["323557027_Weibull_parameter_estimation_and_goodness-of-fit_for_glass_strength_data","309272726_Perturbative_method_for_maximum_likelihood_estimation_of_the_Weibull_distribution_parameters","342852226_A_modular_framework_for_estimating_annual_averaged_power_output_generation_of_wind_turbines","334773858_Wind_speed_distribution_selection_-A_review_of_recent_development_and_progress","318393770_R_A_Language_and_Environment_for_Statistical_Computing","314780904_Survival_Distributions_Reliability_Applications_in_the_Biomedical_Sciences","311738460_Global_comparison_of_the_goodness-of-fit_of_wind_speed_distributions","309446864_Two_and_three-parameter_Weibull_distribution_in_available_wind_power_analysis","303040916_Statistical_analysis_of_wind_speed_using_two-parameter_Weibull_distribution_in_AlacatI_region","285906939_Numerical_optimization"]}