{"id":"3418695_Learning_and_Optimization_Using_the_Clonal_Selection_Principle","abstract":"The clonal selection principle is used to explain the basic\nfeatures of an adaptive immune response to an antigenic stimulus. It\nestablishes the idea that only those cells that recognize the antigens\n(Ag's) are selected to proliferate. The selected cells are subject to an\naffinity maturation process, which improves their affinity to the\nselective Ag's. This paper proposes a computational implementation of\nthe clonal selection principle that explicitly takes into account the\naffinity maturation of the immune response. The general algorithm, named\nCLONALG, is derived primarily to perform machine learning and pattern\nrecognition tasks, and then it is adapted to solve optimization\nproblems, emphasizing multimodal and combinatorial optimization. Two\nversions of the algorithm are derived, their computational cost per\niteration is presented, and a sensitivity analysis in relation to the\nuser-defined parameters is given. CLONALG is also contrasted with\nevolutionary algorithms. Several benchmark problems are considered to\nevaluate the performance of CLONALG and it is also compared to a niching\nmethod for multimodal function optimization","authors":["Leandro De Castro","Fernando J. Von Zuben"],"meta":["July 2002IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council 6(3):239 - 251","DOI:10.1109/TEVC.2002.1011539","SourceIEEE Xplore"],"references":["313695392_Shlomchik_Innate_Immnity_In_Immunobiology_the_Immune_System_in_Health_and_Disease","312998983_Genetic_algorithms_with_sharing_for_multimodal_function_optimization","306150595_Neural_Networks_A_Comprehensive_Foundation","293202078_Immunological_memory","285703390_Clonal_selection_and_after_in_Theoretical_Immunology","285481525_The_immune_system_in_health_and_disease","285297583_Somatic_Generation_of_Antibody_Diversity","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","279698934_Somatic_generation_of_antibody_diversity","274316004_Genetic_Algorithms_with_Sharing_for_Multi-modal_Function_Optimization"]}