{"id":"341937447_Predicting_Student_Performance_in_Higher_Educational_Institutions_Using_Video_Learning_Analytics_and_Data_Mining_Techniques","abstract":"Technology and innovation empower higher educational institutions (HEI) to use different types of learning systems—video learning is one such system. Analyzing the footprints left behind from these online interactions is useful for understanding the effectiveness of this kind of learning. Video-based learning with flipped teaching can help improve student’s academic performance. This study was carried out with 772 examples of students registered in e-commerce and e-commerce technologies modules at an HEI. The study aimed to predict student’s overall performance at the end of the semester using video learning analytics and data mining techniques. Data from the student information system, learning management system and mobile applications were analyzed using eight different classification algorithms. Furthermore, data transformation and preprocessing techniques were carried out to reduce the features. Moreover, genetic search and principle component analysis were carried out to further reduce the features. Additionally, the CN2 Rule Inducer and multivariate projection can be used to assist faculty in interpreting the rules to gain insights into student interactions. The results showed that Random Forest accurately predicted successful students at the end of the class with an accuracy of 88.3% with an equal width and information gain ratio.","authors":["Raza Hasan","Sellappan Palaniappan","Salman Mahmood","Ali Abbas"],"meta":["June 2020Applied Sciences 10(11):3894","DOI:10.3390/app10113894","Project: Student success using video analytics"],"references":["338052900_Educational_Data_Mining_and_Learning_Analytics_An_Updated_Survey","336915553_Using_learning_analytics_to_develop_early-warning_system_for_at-risk_students","335541406_Supervised_data_mining_approach_for_predicting_student_performance","334897437_Prediction_of_Student's_performance_by_modelling_small_dataset_size","332329153_Interpretable_Multiview_Early_Warning_System_Adapted_to_Underrepresented_Student_Populations","332319157_Enhancing_the_Teaching_and_Learning_Process_Using_Video_Streaming_Servers_and_Forecasting_Techniques","340402789_A_Review_Emerging_Trends_of_Big_Data_in_Higher_Educational_Institutions","335497083_An_overview_and_comparison_of_supervised_data_mining_techniques_for_student_exam_performance_prediction","332650335_Student_Performance_Prediction","331821565_Mining_Student_Information_System_Records_to_Predict_Students'_Academic_Performance"]}