{"id":"341917692_Robust_Controller_Design_Recent_Emerging_Concepts_for_Control_of_Mechatronic_Systems","abstract":"The recent industrial revolution puts competitive requirements on most manufacturing and mechatronic processes. Some of these are economic driven, but most of them have an intrinsic projection on the loop performance achieved in most of closed loops across the various process layers. It turns out that successful operation in a globalization context can only be ensured by robust tuning of controller parameter as an effective way to deal with continuously changing end-user specs and raw product properties. Still, ease of communication in non-specialised process engineering vocabulary must be ensured at all times and ease of implementation on already existing platforms is preferred. Specifications as settling time, overshoot and robustness have a direct meaning in terms of process output and remain most popular amongst process engineers. An intuitive tuning procedure for robustness is based on linear system tools such as frequency response and bandlimited specifications thereof. Loop shaping remains a mature and easy to use methodology, although its tools such as Hinf remain in the shadow of classical PID control for industrial applications. Recently, next to these popular loop shaping methods, new tools have emerged, i.e. fractional order controller tuning rules. The key feature of the latter group is an intrinsic robustness to variations in the gain, time delay and time constant values, hence ideally suited for loop shaping purpose. In this paper, both methods are sketched and discussed in terms of their advantages and dis-advantages. A real life control application used in mechatronic applications illustrates the proposed claims. The results support the claim that fractional order controllers outperform in terms of versatility the Hinf control, without losing the generality of conclusions. The paper pleads towards the use of the emerging tools as they are now ready for broader use, while providing the reader with a good perspective of their potential.","authors":["Clara Mihaela Ionescu","Eva Henrietta Dulf","Maria Ghita","Cristina Muresan"],"meta":["June 2020Journal of the Franklin Institute 357(12)","DOI:10.1016/j.jfranklin.2020.05.046"],"references":["333335282_A_Survey_on_Fractional_Order_Control_Techniques_for_Unmanned_Aerial_and_Ground_Vehicles","331611451_Simple_Alternatives_to_PID-Type_Control_for_Processes_with_Variable_Time-Delay","331528390_A_Survey_of_Recent_Advances_in_Fractional_Order_Control_for_Time_Delay_Systems","331040293_The_5W's_for_Control_as_Part_of_Industry_40_Why_What_Where_Who_and_When-A_PID_and_MPC_Control_Perspective","328068485_Fractional-order_PID_design_Towards_transition_from_state-of-art_to_state-of-use","326217170_Calibration_of_UR10_Robot_Controller_through_Simple_Auto-Tuning_Approach","326136532_Experimental_Validation_of_a_Novel_Auto-Tuning_Method_for_a_Fractional_Order_PI_Controller_on_an_UR10_Robot","337392840_Hands-on_MPC_tuning_for_industrial_applications","335887715_Universal_Direct_Tuner_for_Loop_Control_in_Industry","331563871_Real-time_study_of_a_photovoltaic_system_with_boost_converter_using_the_PSO-RBF_neural_network_algorithms_in_a_MyRio_controller"]}