{"id":"341997651_PENGGUNAAN_PENGOLAHAN_CITRA_DIGITAL_DENGAN_ALGORITMA_EDGE_DETECTION_DALAM_MENGIDENTIFIKASI_KERUSAKAN_KONTUR_JALAN","abstract":"Road infrastructure that is at any time passed by a motor vehicle which is an important means of speeding road users to get to their destination. The increase of motor vehicles in each year is increasing by around 10.3% of the total number of vehicles 94 million units in 2013 [4]. Roads as access through motor vehicles need to be given attention for the comfort and safety of road users. Damage to road infrastructure can cause an accident hazard, data is denied in 2015, about 24 thousand incidents of road accidents one of which is caused by road damage, Where one of them is the potholes. The identification of road damage, especially potholes, is one of the efforts to minimize road users' accidents. Using digital image processing using the method used to identify perforated path using edge detection algorithm. With this system can identify damage to road contour especially road hole well with accuracy above 80% with still image. ABSTRAK Infrastuktur jalan yang setiap saat dilalui oleh kendaraan bermotor yang merupakan sarana penting mempercepat penggguna jalan untuk sampai ke tempat tujuannya. pertambahan kendaran bermotor pada setiap tahunnya makin bertambah berkisar 10,3% dari total jumlah kendaraan 94 juta unit tahun 2013 [4]. Jalan sebagai akses yang dilewati kendaraan bermotor perlu mendapat perhatian untuk kenyamanan dan keamanan pengguna jalan. kerusakan infrastruktur jalan dapat menyebabkan bahaya kecelakaan, data ditlantas tahun 2015, sekitar 24 ribu kejadian kecelakaan di jalan salah satunya disebabkan oleh kerusakan jalan, dimana salah satunya yaitu jalan berlubang. Identifikasi kerusakan jalan khususnya jalan berlubang merupakan salah satu upaya untuk menggurangi kecelakaan pengguna jalan. Mengunakan proses pengolahan citra digital dengan metode yang digunakan untuk mengidentifikasi jalan berlubang menggunakan algoritma edge detection. Dengan system ini dapat mengidentifikasi kerusakan kontur jalan khususnya jalan berlubang secara baik dengan akurasi diatas 80% dengan pengambilan gambar diam. Kata kunci: Pengolahan citra digital, algoritma Edge detection, jalan berlubang. PENDAHULUAN Pada jenis kerusakan infrastruktur jalan tersebut bervariasi yang umumnya berupa retak-retak (cracking), berupa gelombang (corrugation), berupa genangan aspal dipermukaan jalan (bleeding), dan berupa lubang (pothole). Jenis kerusakan yang cenderung menimbulkan terjadinya kecelakaan bagi pengendara kendaraan bermotor adalah yang berupa lubang (pothole). Deteksi lubang yang digunakan oleh pihak terkait saat ini masih tergolong sederhana, dimana masih mengandalkan informasi dari masyarakat dan informasi tersebut didapat setelah terjadi kecelakaan pada lokasi lubang tersebut. Dengan permasalahan tersebut maka perlu dibuat suatu sistem informasi pembantu navigasi pengendara, seperti peringatan dini, agar pengendara dapat waspada dala melakukan tindakan terutama di malam hari ataupun saat hujan di malam hari. Untuk melakukan proses segmentasi data berupa gambar diperlukan metode khusus berupa image processing. Dan data tersebut ditampilkan dengan perangkat berbasis android. Pada tahun 2011, dilakukan penelitian penerapan image processing pada pencatatan angka di meter listrik oleh Eka Ardianto[1]. Dari penelitian tersebut disimpulkan bahwa aplikasi yang dibuat memiliki keberhasilan sebesar 47 %. dikarenakan image processing yang diterapkan masih bersifat","authors":["Andy Suryowinoto"],"meta":["June 2020"],"references":["3579410_An_application_programming_interface_for_collaborative_working"]}