{"id":"341966177_Du_kleroterion_a_la_cryptologie_L'acte_de_tirage_au_sort_au_XXIe_siecle_pratiques_et_instruments","abstract":"Le tirage au sort est de plus en plus présent dans les discours et les pratiques politiques au xxie siècle. Utilisé pour désigner des jurys ou départager des candidats ex-æquo lors d’élections, il devient aussi l’objet de revendications démocratiques, de la part de chercheurs, d’expérimentateurs et de militants. Mais peu d’intérêt est porté aux techniques et outils concrets utilisés pour les tirages contemporains. Contribuant à l’histoire matérielle de la démocratie, cet article analyse l’acte de tirage au sort aux xxe et xxie siècles à travers les pratiques et instruments mobilisés par une mosaïque d’acteurs dans des contextes divers. Du pile ou face à la courte paille ou à l’urne jusqu’aux logiciels informatiques et à la physique quantique, du klérotèrion à la cryptologie, comment tire-t-on au sort aujourd’hui ? Quelles sont les logiques matérialisées par ces pratiques ? Notre recherche démontre qu’il y a au xxie siècle une persistance des outils manuels pour l’acte de tirage au sort, l’avènement de l’informatique ne les ayant pas effacés. Il existe des phénomènes d’hybridations et de transitions des outils et des pratiques selon les champs. En revanche, l’apparition de l’informatique coïncide avec la montée en puissance de la notion d’échantillon représentatif et des instituts de sondages. Cela soulève un défi : en démocratie, le tirage au sort peut-il être conduit par des experts via des logiciels en « boîte noire » de façon non-transparente, sans risquer de perdre la confiance du public ?\n\nCourant Dimitri, « Du klérotèrion à la cryptologie : l’acte de tirage au sort au xxie siècle, pratiques et instruments », Participations, 2019/HS (Hors Série), p. 343-372.\nhttps://www.cairn.info/revue-participations-2019-HS-page-343.htm","authors":["Dimitri Courant"],"meta":["June 2019","DOI:10.3917/parti.hs01.0343"],"references":["334260418_Sortition_and_Democratic_Principles_A_Comparative_Analysis","349785671_Les_budgets_participatifs_en_Europe_Des_services_publics_au_service_du_public","349780743_Le_vote_et_la_vertu_Comment_les_Francais_sont_devenus_electeurs","345447734_La_selection_des_mini-publics_entre_tirage_au_sort_motivation_et_disponibilite","324628786_La_fabrique_de_l'opinion_une_histoire_sociale_des_sondages","324621896_The_Snow_Lion_and_the_Dragon_China_Tibet_and_the_Dalai_Lama","301617421_Petite_histoire_de_l'experimentation_democratique_Tirage_au_sort_et_politique_d'Athenes_a_nos_jours","292714341_L'opinion_publique_n'existe_pas","281302866_En_quoi_consiste_l'amerique","273075031_Is_Democracy_Possible_The_Alternative_to_Electoral_Politics"]}