{"id":"341988596_Social_media_attitudes_among_vocational_school_students","abstract":"span>The rapid developments in communication technologies in recent years, especially the introduction of the internet into our daily lives, have brought many changes in social, economic and cultural life.One of these changes; social media communication tools that enter our lives rapidly.Social media has become an indispensable part of our lives with the increasing number of users.Researches show that young people especially university students frequently use social media communication tools. In this study, social media attitudes of Vocational High School students were investigated and in this context, 502 students studying at Sakarya University and Kafkas University Vocational High Schools were studied.Social Media Attitude Scale developed by Otrar and Argınwas used to determine the social media attitudes of Vocational School students.The scale consists of 23 items. Relational screening method was used in the research. Necessary analyzes were performed with SPSS 24 program and mean and standard deviation values of the scale items were calculated.Two groups t test, one-way Anova test and Post-Hoc Scheffe test were used to correlate social media attitudes with demographic data.In conclusion, there was no significant difference between students' social media attitudes and gender, department, class, internet usage time demographic data; however, there was a positive and significant relationship between social media attitudes and internet connection year and social media usage hours.</span","authors":["Ezgi PELİN Yildiz","Metin Çengel","Ayşe Alkan"],"meta":["September 2019International Journal of Evaluation and Research in Education (IJERE) 8(3):384","DOI:10.11591/ijere.v8i3.20248"],"references":["335928324_Bilimsel_Arastirma_Yontemleri","331000005_The_Impact_of_Social_Media_on_Student_Academic_Life_in_Higher_Education_The_Impact_of_Social_Media_on_Student_Academic_Life_in_Higher_Education","267556427_A_new_addiction_for_teacher_candidates_Social_networks","230788066_Universite_Ogrencilerinin_Sosyal_Ag_Siteleri_Kullanim_Amaclarini_Belirlemeye_Yonelik_Bir_Olcek_Gelistirme_Calismasi","26682773_Being_Immersed_in_Social_Networking_Environment_Facebook_Groups_Uses_and_Gratifications_and_Social_Outcomes","322148425_Universite_Ogrencilerinin_Sosyal_Medyaya_Iliskin_Tutumlarinin_Incelenmesi","308847068_Motivators_of_online_vulnerability_The_impact_of_social_network_site_use_and_FOMO","305397624_Sosyal_medya_araclarinin_web_20_kamu_hizmetleri_ve_uygulamalarinda_kullanilabilirligi","269588067_UNIVERSITE_OGRENCILERININ_SOSYAL_AGLARI_KULLANIMLARINA_YONELIK_BIR_ARASTIRMA","224890480_You_Are_What_Your_Tweet_Analyzing_Twitter_for_Public_Health"]}