{"id":"341982543_AssemblyNet_A_large_ensemble_of_CNNs_for_3D_whole_brain_MRI_segmentation","abstract":"Whole brain segmentation of fine-grained structures using deep learning (DL) is a very challenging task since the number of anatomical labels is very high compared to the number of available training images. To address this problem, previous DL methods proposed to use a single convolution neural network (CNN) or few independent CNNs. In this paper, we present a novel ensemble method based on a large number of CNNs processing different overlapping brain areas. Inspired by parliamentary decision-making systems, we propose a framework called AssemblyNet, made of two “assemblies\" of U-Nets. Such a parliamentary system is capable of dealing with complex decisions, unseen problem and reaching a relevant consensus. AssemblyNet introduces sharing of knowledge among neighboring U-Nets, an “amendment” procedure made by the second assembly at higher-resolution to refine the decision taken by the first one, and a final decision obtained by majority voting. During our validation, AssemblyNet showed competitive performance compared to state-of-the-art methods such as U-Net, Joint label fusion and SLANT. Moreover, we investigated the scan-rescan consistency and the robustness to disease effects of our method. These experiences demonstrated the reliability of AssemblyNet. Finally, we showed the interest of using semi-supervised learning to improve the performance of our method.","authors":["Pierrick Coupé","Boris Mansencal","Michaël Clément","Rémi Giraud"],"meta":["June 2020NeuroImage 219(5):117026","DOI:10.1016/j.neuroimage.2020.117026"],"references":["336380068_AssemblyNet_A_Novel_Deep_Decision-Making_Process_for_Whole_Brain_MRI_Segmentation","336379788_Multi-task_Attention-Based_Semi-supervised_Learning_for_Medical_Image_Segmentation","356297155_Deep_decentralized_multi-task_multi-agent_reinforcement_learning_under_partial_observability","339224950_Abstract_FastSurfer_A_Fast_and_Accurate_Deep_Learning_Based_Neuroimaging_Pipeline","339086610_Recalibrating_3D_ConvNets_With_Project_Excite","338512827_Collaborative_Learning_of_Semi-Supervised_Segmentation_and_Classification_for_Medical_Images","336377758_3DQ_Compact_Quantized_Neural_Networks_for_Volumetric_Whole_Brain_Segmentation","335449814_A_New_Ensemble_Learning_Framework_for_3D_Biomedical_Image_Segmentation","334418547_A_Multi-Atlas_Guided_3D_Fully_Convolutional_Network_for_MRI-Based_Subcortical_Segmentation","332319285_3D_whole_brain_segmentation_using_spatially_localized_atlas_network_tiles"]}