{"id":"341966891_The_omni-channel_approach_A_utopia_for_companies","abstract":"There has been a shift towards providing a seamless consumer journey experience in the retail industry, resulting from a customer-centric approach. In the new paradigm, channels are becoming more intertwined and intricate, and ultimately more companies are embracing the omni-channel alternative. However, this alternative seems to be difficult for companies to operationalize. Such difficulty is due to several factors that need to be identified and disentangled. Therefore, in this study we consider the barriers faced by firms and categorize them to understand whether it is possible to successfully implement the omni-channel approach. We use four case studies to investigate the obstacles, looking for brands that operate in different industries, represent different levels of channel integration and have had different experiences in the retail industry. We identify two types of obstacles: internal, including operational and strategic barriers (employee-related, organizational and vision-related factors); and external, including product-related, customer-related, legal and competitive drivers. We propose a theoretical framework that shows the scope of industry drivers affecting the implementation of an omni-channel strategy, as well as a model showing how internal and external factors affect the evolution of channel integration. As a result, we claim that for some industries and products, even if internal obstacles are significantly reduced, because of industry drivers, successful implementation of the omni-channel approach may ultimately be a utopia.","authors":["Monika Hajdas","Joanna Radomska","Susana Costa e Silva"],"meta":["June 2020Journal of Retailing and Consumer Services","DOI:10.1016/j.jretconser.2020.102131","Project: Omnichannel"],"references":["343601160_OMNICHANNEL_RETAILING_THE_MERGING_OF_THE_ONLINE_AND_OFF-LINE_ENVIRONMENT","326060521_Drivers_and_barriers_of_omni-channel_retailing_in_China_A_case_study_of_the_fashion_and_apparel_industry","324072993_Applying_Organizational_Ambidexterity_in_strategic_management_under_a_VUCA_environment_Evidence_from_high_tech_companies_in_China","333669609_Luxury_fashion_goods_ownership_and_collecting_behavior_in_an_omni-channel_retail_environment_Empirical_findings_from_affluent_consumers_in_the_US","332190518_Multichannel_integration_quality_A_systematic_review_and_agenda_for_future_research","331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","329256671_Legal_Constraints_and_Marketing_Research_Review_and_Call_to_Action","326745594_Understanding_the_Omnichannel_Customer_Journey_Determinants_of_Interaction_Choice","325999121_How_convenient_is_it_Delivering_online_shopping_convenience_to_enhance_customer_satisfaction_and_encourage_e-WOM","323231704_Characterizing_Business_Models_for_Digital_Business_Through_Patterns"]}