{"id":"341989611_What_is_critical_thinking_A_longitudinal_study_with_teacher_candidates","abstract":"span>Critical thinking skills that enhance the ability of individuals to understand and make sense of the world and events and situations around them are one of the foremost research areas in the educational system of various countries. As a critical thinking individual, decisions made by the teacher in his/her class, the activities he/she has performed and the explicit and implicit messages given by him/her to the class are clearly observed by the students. It is believed that the situation of teachers’ having critical thinking skills and critical thinking personality effects on students' perceptions and achievements about critical thinking. In this context, the aim of the research is to determine the perceptions of the teacher candidates about critical thinking and to observe the changes in these perceptions over time. Interviews were held with 11 prospective teachers for two times for 4 years and their thoughts on critical thinking were examined. According to the findings obtained, the thoughts of the teacher candidates regarding the critical thinking do not change over time but they are not seen enough. Teacher candidates make decisions with emotional references and they are reluctant to inquire and research.</span","authors":["Serap Yılmaz Özelçi","Gürbüz Çalışkan"],"meta":["September 2019International Journal of Evaluation and Research in Education (IJERE) 8(3):495","DOI:10.11591/ijere.v8i3.20254"],"references":["337841515_WHAT_CRITICAL_THINKING_AND_FOR_WHAT","307841047_Turkce_Ogretmeni_Adaylarinin_Elestirel_Dusunme_Becerileri_Uzerine_Bir_Degerlendirme","287150271_British_Universities_International_Students'_Alleged_Lack_of_Critical_Thinking","285744892_OgRetim_dili_olarak_turkcenin_sorunlari_ve_Ogretme-Ogrenme_surecindeki_etkili_yaklasimlar","284282077_Critical_thinking_questioning_and_student_engagement_in_Korean_university_English_courses","282535981_Critical_Thinking_of_Students_-_Indicator_of_Quality_in_Higher_Education","320353624_Handbook_of_Creativity","292725898_Critical_thinking_A_vital_work_skill","284913092_Criticality's_affective_entanglements_rethinking_emotion_and_critical_thinking_in_higher_education","284459571_CUMHURIYET_DONEMINDE_DAL_OGRETMENI_YETISTIRME"]}