{"id":"342060634_Personal_protective_ensemble_reference_size_development_for_Indian_male_defence_personnel_based_on_3D_whole_body_anthropometric_scan","abstract":"Introduction: Proper protective gear sizing is an important factor both for civilian and defence population. This is much more so in the defence sector as a well fitted personal protective ensemble (PPE), for example, a bullet proof jacket could be the difference between survival and fatality. So in order to develop a size reference for personal protective ensemble, a pan India anthropometric study was planned and carried out on Indian defence male personnel from various locations.\nMaterials and methods: Between 2016 and 17, the research team carried out an anthropometric survey of male Indian soldiers (n = 2281), posted in different parts of the country whose age ranged from 21 to 50 years. Descriptive analysis of the volunteers was carried out using Statistical Product and Service Solution (SPSS) v. 21. Principle component and cluster analysis was carried out for clustering them into various categories. Chest circumference is taken as the main component for the upper protective gear sizing and hip circumference is considered for lower protective gear sizing.\nResults: Three sizes were developed for Upper Personal Protective Ensemble (UPPE) using chest girth as the main measurement and corresponding three size ranges for the Lower Personal Protective Ensemble (LPPE) using belt girth as the main measurement, with size range intervals of 4 cm and 6 cm. Other parameters included were arm length, neck to wrist length, inter acromion length, circumference at deltoid for upper ensemble; stomach girth, natural waist height and hip girth for lower ensemble.\nConclusion: Using the system of cluster analysis, three major sizes were developed namely Small, Medium and Large for both Upper and Lower Personal Protective Ensembles. Small size was further divided into XXS, XS, S and Large was further divided into L, XL, XXL and XXXL so as to have maximum coverage.","authors":["Lalhmunlien Robert Varte","Shweta Rawat","Inderjeet Singh","Shilpa Choudhary"],"meta":["June 2020Journal of the Textile Institute 112(3):1-8","DOI:10.1080/00405000.2020.1770517","Project: 3D scanner anthropometry sizing and prediction body composition"],"references":["303554422_Reliability_of_3D_laser-based_anthropometry_and_comparison_with_classical_anthropometry","235272804_Body_measurement_techniques_Comparing_3D_body-scanning_and_anthropometric_methods_for_apparel_applications","333490859_An_analysis_of_influence_factors_of_sports_bra_comfort_evaluation_based_on_different_sizes","333297873_Comparison_of_body_measurements_between_Chinese_and_US_females","303469741_Finite_element_modelling_of_Chinese_male_office_workers'_necks_using_3D_body_measurements","270686838_Evaluation_of_an_anthropometric_shape_model_of_the_human_scalp","269051001_Data_Compatibility_Analysis_of_3D_Body_Scanning","257035810_Error_detection_in_three-dimensional_surface_anthropometric_data","235312725_Body_scanning_The_effects_of_subject_respiration_and_foot_positioning_on_the_data_integrity_of_scanned_measurements","224144442_The_Evaluation_of_Scan-Derived_Anthropometric_Measurements"]}