{"id":"342014566_Ten_Years_of_Initiatives_to_Promote_Computational_Thinking_A_Systematic_Mapping_Study","abstract":"INTRODUCTION: Computational Thinking is a problem solving skill that became well known after Wing's article in 2006. Since then, several researchers have argued this way of thinking can be useful to all people, and much research has been done to promote the development of this skill with different audiences. OBJECTIVE: To discover the state of art of the initiatives carried out in the last decade to promote the development of Computational Thinking, inside and outside Brazil, regardless of the public addressed and the method applied. METHOD: A systematic mapping of the literature was carried out comprising three steps of selection of articles to proceed with data extraction and analysis of results. Three international databases and one national were included to search articles published between 2007 and 2017, in Portuguese and English. From a total of 468 articles, 46 were selected for data extraction and analysis. RESULTS: Mapping allowed us to answer seven research questions, showing, for example, that the USA and Brazil stand out in quantity of research. Additionally, they presented important differences between the duration of the research, target audience(s) and the tools used. We were able to identify that research has grown in number and diversity. Conversely, initiatives in multi and transdisciplinary contexts are still lacking, and little attention is paid to the public in less favored contexts. CONCLUSION: Computational Thinking is a growing topic of research and knowing the initiatives published in these 10 years of research helps in the elaboration of new research, mainly indicating opportunities to be explored. Especially for Brazil, it is necessary to approach students beyond basic education, to explore the transdisciplinary potential of Computational Thinking, and to carry out research of longer duration.","authors":["Júlia Ortiz","Roberto Pereira"],"meta":["December 2019Journal on Computational Thinking (JCThink) 3(1):96","DOI:10.14210/jcthink.v3.n1.p95","Project: Computando Meu Contexto: Projeto de Extensão"],"references":["320994973_Metodologias_de_Avaliacao_do_Pensamento_Computacional_uma_revisao_sistematica","315636456_Computational_thinking_for_teacher_education","309887805_Um_Mapeamento_Sistematico_sobre_a_Avaliacao_do_Pensamento_Computacional_no_Brasil","274309848_Computational_Thinking","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","320993180_Revisao_Sistematica_de_Literatura_sobre_Pensamento_Computacional_por_Meio_de_Objetos_de_Aprendizagem","275156960_Guidelines_for_conducting_systematic_mapping_studies_in_software_engineering_An_update","228328529_Mindstorms_Children_Computers_and_Powerful_Ideas"]}