{"id":"342070165_Knowledge-Based_Smart_City_Service_System","abstract":"A smart city can be defined as a city exploiting information and communication technologies to enhance the quality of life of its citizens by providing them with improved services while ensuring a conscious use of the available limited resources. This paper introduces a conceptual framework for the smart city, namely, the Smart City Service System. The framework proposes a vision of the smart city as a service system according to the principles of the Service-Dominant Logic and the service science theories. The rationale is that the services offered within the city can be improved and optimized via the exploitation of information shared by the citizens. The Smart City Service System is implemented as an ontology-based system that supports the decision-making processes at the government level through reasoning and inference processes, providing the decision-makers with a common operational picture of what is happening in the city. A case study related to the local public transportation service is proposed to demonstrate the feasibility and validity of the framework. An experimental evaluation using the Situation Awareness Global Assessment Technique (SAGAT) has been performed to measure the impact of the framework on the decision-makers’ level of situation awareness.","authors":["Giuseppe D'Aniello","Matteo Gaeta","Francesco Orciuoli","Giuseppe Sansonetti"],"meta":["June 2020Electronics 9(6):965","DOI:10.3390/electronics9060965"],"references":["339838042_Building_Ontology-Driven_Tutoring_Models_for_Intelligent_Tutoring_Systems_Using_Data_Mining","337693014_ComfOnt_A_Semantic_Framework_for_Indoor_Comfort_and_Energy_Saving_In_Smart_Homes","332774509_An_Ontology-Based_Framework_for_Building_Energy_Management_with_IoT","330069479_Smart_City_as_a_Service_System_A_Framework_to_Improve_Smart_Service_Management","329902056_Ontological_Representation_of_Smart_City_Data_From_Devices_to_Cities","326306841_Building_IoT-Based_Applications_for_Smart_Cities_How_Can_Ontology_Catalogs_Help","338441524_CHAT-Bot_a_Cultural_Heritage_Aware_Teller-Bot_for_supporting_touristic_experiences","335894776_An_Adaptive_System_Based_on_Situation_Awareness_for_Goal-Driven_Management_in_Container_Terminals","332885762_A_multilevel_graph_approach_for_rainfall_forecasting_A_preliminary_study_case_on_London_area","329322025_Ontology_and_Semantic_Interoperability"]}