{"id":"342092013_Flipped_Classroom_How_Institutions_of_Higher_Education_HEIs_of_Bangladesh_Could_Move_Forward_During_Covid-19_Pandemic","abstract":"Due to COVID-19 pandemic, Bangladesh along with most of the developing countries is facing unexpected impediments towards functioning their regular activities. Most importantly, schools at\nall levels and Higher Educational Institutions (HEIs) have been completely shut down since March 26, 2020 that directly obliged stakeholders (Ministry of Education, institutes authorities, parents and\nother relevant bodies) to adopt online education. Due to having very less experience, in many cases no experience at all, of conducting teaching and learning wholly online by HEIs of Bangladesh, myriad challenges have been encountered by teachers and students. In order to find out a viable technique for addressing these challenges, this paper proposes a pathway (framework) by which the HEIs of developing countries will be able to continue teaching and learning without investing money and organizing training during this COVID-19 pandemic and similar other emergency situations. This strategy provides a simple but reliable emergency means which is based on flipped classroom theory. The HEIs of Bangladesh particularly, and other developing countries generally will be benefited from this proposed framework while they do not have established means to carry their teaching and learning. This paper lastly addresses a few limitations of this framework and provides guidelines to the policymakers on how to incorporate it into the HEIs during this emergency context.\n\nKeywords: COVID-19, Flipped classroom, Open source technology, Online learning space, Higher Education.","authors":["Md. Shahadat Hossain Khan","Benadjih Oiriddine Abdou"],"meta":["January 2020SSRN Electronic Journal","DOI:10.2139/ssrn.3615400"],"references":["341259394_China's_Internationalized_Higher_Education_During_Covid-19_Collective_Student_Autoethnography","340086452_Postdigital_Research_in_the_Time_of_Covid-19","338649099_Outbreak_of_Pneumonia_of_Unknown_Etiology_in_Wuhan_China_the_Mystery_and_the_Miracle","340790854_Education_and_the_COVID-19_pandemic","340083511_Analysis_and_forecast_of_COVID-19_spreading_in_China_Italy_and_France","339344459_Breakthrough_Chloroquine_phosphate_has_shown_apparent_efficacy_in_treatment_of_COVID-19_associated_pneumonia_in_clinical_studies","338351858_Enhancing_SPOC-Flipped_Classroom_Learning_by_Using_Student-Centred_Mobile_Learning_Tools","331900788_ONLINE_ENGINEERING_EDUCATION_LEARNING_ANYWHERE_ANYTIME","328586295_Effects_of_the_flipped_classroom_instructional_strategy_on_students'_learning_outcomes_a_meta-analysis","328170786_Flipped_classroom-comparative_case_study_in_engineering_higher_education"]}