{"id":"342017550_Skyline_Queries_Computation_on_Crowdsourced-Enabled_Incomplete_Database","abstract":"Data incompleteness becomes a frequent phenomenon in a large number of contemporary database applications such as web autonomous databases, big data, and crowd-sourced databases. Processing skyline queries over incomplete databases impose a number of challenges that negatively influence processing the skyline queries. Most importantly, the skylines derived from incomplete databases are also incomplete in which some values are missing. Retrieving skylines with missing values is undesirable, particularly, for recommendation and decision-making systems. Furthermore, running skyline queries on a database with incomplete data raises a number of issues influence processing skyline queries such as losing the transitivity property of the skyline technique and cyclic dominance between the tuples. The issue of estimating the missing values of skylines has been discussed and examined in the database literature. Most recently, several studies have suggested exploiting the crowd-sourced databases in order to estimate the missing values by generating plausible values using the crowd. Crowd-sourced databases have proved to be a powerful solution to perform user-given tasks by integrating human intelligence and experience to process the tasks. However, task processing using crowd-sourced incurs additional monetary cost and increases the time latency. Also, it is not always possible to produce a satisfactory result that meets the user’s preferences. This paper proposes an approach for estimating the missing values of the skylines by first exploiting the available data and utilizes the implicit relationships between the attributes in order to impute the missing values of the skylines. This process aims at reducing the number of values to be estimated using the crowd when local estimation is inappropriate. Intensive experiments on both synthetic and real datasets have been accomplished. The experimental results have proven that the proposed approach for estimating the missing values of the skylines over crowd-sourced enabled incomplete databases is scalable and outperforms the other existing approaches.","authors":["Marwa B. Swidan","Ali Amer Alwan","Sherzod Turaev","Hamidah Ibrahim"],"meta":["June 2020IEEE Access 8:106660-106689","DOI:10.1109/ACCESS.2020.3000664","Projects: New Computational Models for Biological Data Analysis Based on Static Watson-Crick GrammarsAn Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["337997355_Optimizing_Skyline_Query_Processing_in_Incomplete_Data","336673441_Data-driven_missing_data_imputation_in_cluster_monitoring_system_based_on_deep_neural_network","335479567_Spatial_crowdsourcing_a_survey","329483231_SCSA_Evaluating_skyline_queries_in_incomplete_data","323779790_Identifying_skylines_in_cloud_databases_with_incomplete_data","338673507_Discovering_Relaxed_Functional_Dependencies_Based_on_Multi-Attribute_Dominance","336452456_Answering_Skyline_Queries_Over_Incomplete_Data_With_Crowdsourcing","331724508_Modeling_and_Computing_Probabilistic_Skyline_on_Incomplete_Data","330239543_Efficient_Skyline_Processing_Algorithm_over_Dynamic_and_Incomplete_Database","327564617_CDB_a_crowd-powered_database_system"]}