{"id":"342022364_Measuring_and_improving_the_quality_of_development_processes_based_on_usability_and_accessibility","abstract":"Measurement of both usability and accessibility is an important concern in software development today. However, while a great amount of attention has been paid to product-based measurement, little attention has been paid to the process-based one. Our research is based on the following concerns: on the one hand, we detect a lack of previous work focusing on usability and accessibility together in order to evaluate process quality. On the other hand, it is possible to propose a model for evaluating the capability maturity considering usability and accessibility practices. Starting with the motivation and problem description, we have proposed conceptual hypotheses to conduct our research. This way, this paper describes the conception of a capability maturity model named MODECUA, which provides a framework to evaluate development processes centered on usability and accessibility. Together with a detailed description of MODECUA, we provide a study case to validate our approach. MODECUA includes seven improved processes that we have contributed with eight new activities, 11 adapted activities and processes, and 9 renamed activities. In addition, we have integrated 127 new work products. In addition, an evaluation accomplished in a real company has provided relevant results concerning the application of our approach. Our approach helps to determine the capability maturity of a development process focused on usability and accessibility. It ensures that software products are usable and accessible, increasing user satisfaction and psychological wellness. Besides, it promotes a user-centered approach in the organization, facilitating audits and minimizing costs, time and effort.","authors":["Clara Quintal","José A. Macías"],"meta":["June 2021Universal Access in the Information Society 20(2)","DOI:10.1007/s10209-020-00726-7"],"references":["304338456_User-centered_design_and_adaptive_systems_toward_improving_usability_and_accessibility","287402840_Factors_explaining_adoption_and_implementation_processes_for_web_accessibility_standards_within_eGovernment_systems_and_organizations","336573400_Systematic_Mapping_Studies_in_Software_Engineering","327888382_Supporting_User-Perceived_Usability_Benchmarking_Through_a_Developed_Quantitative_Metric","322837727_Systematic_guidance_on_usability_methods_in_user-centered_software_development","317638928_A_Systematic_Literature_Review_of_Usability_CapabilityMaturity_Models","314722903_A_generic_presentation_modeling_system_for_adaptive_web-based_instructional_applications","284666581_There's_a_SMART_way_to_write_management's_goals_and_objectives","278013705_Enhancing_Interaction_Design_on_the_Semantic_Web_A_Case_Study","258369398_New_Trends_on_Human-Computer_Interaction_Research_Development_New_Tools_and_Methods","228733711_A_generic_presentation_modeling_system_for_adaptive_web-based_instructional_applications","221100567_Corporate_User-Experience_Maturity_Model","220728655_Feasible_database_querying_using_a_visual_end-user_approach","220606562_Guidelines_standards_methods_and_processes_for_software_accessibility","220301911_Intelligent_Assistance_in_Authoring_Dynamically_Generated_Web_Interfaces"]}