{"id":"342062835_A_comparative_study_of_high-productivity_high-performance_programming_languages_for_parallel_metaheuristics","abstract":"Parallel metaheuristics require programming languages that provide both, high performance and a high level of programmability. This paper aims at providing a useful data point to help practitioners gauge the difficult question of whether to invest time and effort into learning and using a new programming language. To accomplish this objective, three productivity-aware languages (Chapel, Julia, and Python) are compared in terms of performance, scalability and productivity. To the best of our knowledge, this is the first time such a comparison is performed in the context of parallel metaheuristics. As a test-case, we implement two parallel metaheuristics in three languages for solving the 3D Quadratic Assignment Problem (Q3AP), using thread-based parallelism on a multi-core shared-memory computer. We also evaluate and compare the performance of the three languages for a parallel fitness evaluation loop, using four different test-functions with different computational characteristics. Besides providing a comparative study, we give feedback on the implementation and parallelization process in each language.","authors":["Jan Gmys","Tiago Carneiro Pessoa","Nouredine Melab","El-Ghazali Talbi"],"meta":["June 2020Swarm and Evolutionary Computation 57:100720","DOI:10.1016/j.swevo.2020.100720"],"references":["334165349_An_Incremental_Parallel_PGAS-based_Tree_Search_Algorithm","267983125_Julia_A_Fresh_Approach_to_Numerical_Computing","265423333_The_Chapel_Tasking_Layer_Over_Qthreads","261349457_An_Empirical_Performance_Study_of_Chapel_Programming_Language","236189741_Parallel_Metaheuristics_Recent_Advances_and_New_Trends","320050885_A_comparative_study_of_programming_languages_for_next-generation_astrodynamics_systems","303673415_PGAS_Partitioned_Global_Address_Space_Languages","267933178_Interactive_notebooks_Sharing_the_code","259151410_Computing_in_Operations_Research_Using_Julia","258162137_Solving_the_three_dimensional_quadratic_assignment_problem_on_a_computational_grid"]}