{"id":"342009866_Semi-Implicit_Multistep_Extrapolation_ODE_Solvers","abstract":"Multistep methods for the numerical solution of ordinary differential equations are an important class of applied mathematical techniques. This paper is motivated by recently reported advances in semi-implicit numerical integration methods, multistep and extrapolation solvers. Here we propose a novel type of multistep extrapolation method for solving ODEs based on the semi-implicit basic method of order 2. Considering several chaotic systems and van der Pol nonlinear oscillator as examples, we implemented a performance analysis of the proposed technique in comparison with well-known multistep methods: Adams-Bashforth, Adams-Moulton and the backward differentiation formula. We explicitly show that the multistep semi-implicit methods can outperform the classical linear multistep methods, providing more precision in the solutions for nonlinear differential equations. The analysis of stability regions reveals that the proposed methods are more stable than explicit linear multistep methods. The possible applications of the developed ODE solver are the long-term simulations of chaotic systems and processes, solving moderately stiff differential equations and advanced modeling systems.","authors":["Denis Butusov","Aleksandra V. Tutueva","Petr Fedoseev","Artem Terentev"],"meta":["June 2020","DOI:10.3390/math8060943","Project: Alternative discrete operators for dynamical systems representation using low-precision data types"],"references":["340459327_Composition_Methods_for_Dynamical_Systems_Separable_into_Three_Parts","338438576_A_new_high-order_compact_finite_difference_scheme_based_on_precise_integration_method_for_the_numerical_simulation_of_parabolic_equations","338019893_Variable_order_nested_hybrid_multistep_methods_for_stiff_ODEs","318206990_Construction_of_Implicit-Explicit_Second-Derivative_BDF_Methods","305649453_Extrapolation_Semi-implicit_ODE_solvers_with_adaptive_timestep","304021859_Hardware-targeted_semi-implicit_extrapolation_ODE_solvers","332126538_Semi-Explicit_Composition_Methods_in_Memcapacitor_Circuit_Simulation","289530130_Assessment_of_numerical_integration_methods_in_the_context_of_low_Earth_orbits_and_inter-satellite_observation_analysis","266926412_Balthazar_Van_Der_Pol","266535366_A_class_of_hybrid_linear_multistep_methods_with_Aa-stability_properties_for_stiff_IVPs_in_ODEs"]}