{"id":"342074349_A_Learning_Analytics_Approach_to_Identify_Students_at_Risk_of_Dropout_A_Case_Study_with_a_Technical_Distance_Education_Course","abstract":"Contemporary education is a vast field that is concerned with the performance of education systems. In a formal e-learning context, student dropout is considered one of the main problems and has received much attention from the learning analytics research community, which has reported several approaches to the development of models for the early prediction of at-risk students. However, maximizing the results obtained by predictions is a considerable challenge. In this work, we developed a solution using only students’ interactions with the virtual learning environment and its derivative features for early predict at-risk students in a Brazilian distance technical high school course that is 103 weeks in duration. To maximize results, we developed an elitist genetic algorithm based on Darwin’s theory of natural selection for hyperparameter tuning. With the application of the proposed technique, we predicted the student at risk with an Area Under the Receiver Operating Characteristic Curve (AUROC) above 0.75 in the initial weeks of a course. The results demonstrate the viability of applying interaction count and derivative features to generate prediction models in contexts where access to demographic data is restricted. The application of a genetic algorithm to the tuning of hyperparameters classifiers can increase their performance in comparison with other techniques.","authors":["Emanuel Queiroga","João Ladislau Lopes","Kristofer Kappel","Marilton Sanchotene Aguiar"],"meta":["June 2020Applied Sciences 10(11):3998","DOI:10.3390/app10113998"],"references":["348871447_Benchmark_and_Survey_of_Automated_Machine_Learning_Frameworks","345729199_Predicting_Dropout_Student_An_Application_of_Data_Mining_Methods_in_an_Online_Education_Program","339768328_An_Optimized_Brain-Based_Algorithm_for_Classifying_Parkinson's_Disease","339046496_Analyzing_and_Predicting_Students'_Performance_by_Means_of_Machine_Learning_A_Review","338194431_Benchmarking_Higher_Education_System_Performance","338074178_Systematic_Literature_Review_of_Predictive_Analysis_Tools_in_Higher_Education","337937724_Predicting_Students_Success_in_Blended_Learning-Evaluating_Different_Interactions_Inside_Learning_Management_Systems","340855546_Mapping_Learning_Analytics_initiatives_in_Latin_America","338728652_Identifying_needs_for_learning_analytics_adoption_in_Latin_American_universities_A_mixed-methods_approach","338615244_Using_clickstream_data_to_measure_understand_and_support_self-regulated_learning_in_online_courses"]}