{"id":"342059629_Mental_Health_and_Behavior_During_the_Early_Phases_of_the_COVID-19_Pandemic_A_Longitudinal_Mobile_Smartphone_and_Ecological_Momentary_Assessment_Study_in_College_Students","abstract":"Background\nThe vast majority of people worldwide have been impacted by coronavirus disease (COVID-19). In addition to the millions of individuals who have been infected with the disease, billions of individuals have been asked or required by local and national governments to change their behavioral patterns. Previous research on epidemics or traumatic events suggests that this can lead to profound behavioral and mental health changes; however, researchers are rarely able to track these changes with frequent, near-real-time sampling or compare their findings to previous years of data for the same individuals.\nObjective\nBy combining mobile phone sensing and self-reported mental health data among college students who have been participating in a longitudinal study for the past 2 years, we sought to answer two overarching questions. First, have the behaviors and mental health of the participants changed in response to the COVID-19 pandemic compared to previous time periods? Second, are these behavior and mental health changes associated with the relative news coverage of COVID-19 in the US media?\nMethods\nBehaviors such as the number of locations visited, distance traveled, duration of phone usage, number of phone unlocks, sleep duration, and sedentary time were measured using the StudentLife smartphone sensing app. Depression and anxiety were assessed using weekly self-reported ecological momentary assessments of the Patient Health Questionnaire-4. The participants were 217 undergraduate students, with 178 (82.0%) students providing data during the Winter 2020 term. Differences in behaviors and self-reported mental health collected during the Winter 2020 term compared to previous terms in the same cohort were modeled using mixed linear models.\nResultsDuring the first academic term impacted by COVID-19 (Winter 2020), individuals were more sedentary and reported increased anxiety and depression symptoms (P","authors":["Jeremy Huckins","Alex W DaSilva","Weichen Wang","Elin Hedlund"],"meta":["May 2020Journal of Medical Internet Research 22(6)","DOI:10.2196/20185"],"references":["341042334_First_Case_of_Covid-19_in_the_United_States","340652498_Flattening_the_Mental_Health_Curve_COVID-19_Stay-at-Home_Orders_Result_in_Alterations_in_Mental_Health_Search_Behavior_in_the_United_States_Preprint","339766601_Immediate_Psychological_Responses_and_Associated_Factors_during_the_Initial_Stage_of_the_2019_Coronavirus_Disease_COVID-19_Epidemic_among_the_General_Population_in_China","331937389_Fusing_Mobile_Phone_Sensing_and_Brain_Imaging_to_Assess_Depression_in_College_StudentsData_Sheet_1PDF","329132980_Correlates_of_stress_in_the_college_environment_uncovered_by_the_application_of_penalized_generalized_estimating_equations_to_mobile_sensing_data_Preprint","340901610_Mental_Health_and_Social_Contact_During_the_COVID-19_Pandemic_An_Ecological_Momentary_Assessment_Study","340171299_Psychological_State_of_College_Students_During_COVID-19_Epidemic","340075360_The_psychological_impact_of_the_COVID-19_epidemic_on_college_students_in_China","339369121_An_interactive_web-based_dashboard_to_track_COVID-19_in_real_time","324052199_Tracking_Depression_Dynamics_in_College_Students_Using_Mobile_Phone_and_Wearable_Sensing"]}