{"id":"342052159_Una_Exploracion_a_las_Necesidades_del_Uso_del_Ingles_en_la_Licenciatura_en_Ciencias_de_la_Computacion_Maria_rebeca_Gutierrez_estrada","abstract":"Resumen El inglés es una lengua necesaria para y difundir conocimiento local e in-ternacional. En este trabajo se discuten algunos hallazgos encontrados so-bre un estudio de caso en una tesis de maestría derivada de un proyecto de investigación en una universidad pública del norte de México. Asimismo se rescatan las perspectivas del coordinador, maestro, estudiante y egre-sado; para los fines de este artículo, se discuten los datos emergentes en el área STEM (Science, Technology, Engineering and Mathematics) de la licenciatura en Ciencias de la Computación. El objetivo es identificar las necesidades de los estudiantes en esta Licenciatura con respecto a aspec-tos académicos y/o laborales en el uso del inglés. Los datos fueron recolec-tados por medio de un cuestionario dirigido al coordinador y tres entre-vistas semiestructuradas con un maestro, un estudiante y un egresado. De los datos se destaca que el uso que los estudiantes hacen del inglés es para la comprensión lectora de documentos académicos como artículos de revistas científicas y el conocimiento de vocabulario específico de las áreas disciplinares. Estos resultados pueden servir de base para justifi-car la necesidad de diseñar cursos de inglés con fines académicos para las áreas de Ciencias Exactas y Naturales en esta universidad.","authors":["María José Ferra Peralta","María Rebeca Gutiérrez Estrada","Vilma Yasmín Cha Moreno"],"meta":["September 2019"],"references":["308887990_THE_JOURNAL_OF_TEACHING_ENGLISH_FOR_SPECIFIC_AND_ACADEMIC_PURPOSES_THE_URGENT_EDUCATIONAL_SHIFT_FROM_GENERAL_ELT_TO_ESP_A_FOLLOW-UP_REACTION_TO_GLOBALIZATION_DYNAMICS_IN_ALBANIA","268202787_Language_Needs_of_Computer_Learners","224006317_English_as_the_universal_language_of_science_Opportunities_and_challenges","298849037_English_for_specific_purposes","295296494_The_evolution_of_an_ESP_programme_in_Cuba","272747702_English_as_a_Global_Language","264677338_English_for_Specific_Purposes_Teaching_to_Perceived_Needs_and_Imagined_Futures_in_Worlds_of_Work_Study_and_Everyday_Life","242284788_Developments_in_English_for_Specific_Purposes_A_Multi-Disciplinary_Approach"]}