{"id":"342095927_Simulacion_de_escenarios_y_politica_publica_Sistema_de_produccion_de_papa_venezolano","abstract":"El sistema de producción de papa venezolano sufre de diversas deficiencias, las cuales pueden ser reducidas si se cuenta con buenas herramientas de modelado para estudiar el sistema y explorar configuraciones o escenarios alternativos que informen la toma de decisiones y la política pública. Esto puede ser realizado utilizando herramientas y teorías de Simulación Social como la plataforma SocLab. En el trabajo se realiza un análisis de escenarios de un modelo del sistema de producción de papa venezolano. Se estudia y modela la interacción entre los actores, la cual es mediada por sus recursos, siguiendo la Teoría de Sistemas de Acción Organizada, combinando la investigación cualitativa con la cuantitativa. Entre los actores se tiene al Estado Venezolano y entes comunitarios. Los resultados muestran disminución de las deficiencias del sistema en estos escenarios, pero sin un cambio sobresaliente hacia un sistema de papa justo, lo que indica la profundidad estructural de las deficiencias. El estudio, sin embargo, ha permitido identificar el compromiso de los actores con un sistema justo, lo que resulta importante para reorientar la política pública. Como parte de esta política, se sugiere sustituir en muchos de sus roles al Estado venezolano por actores comprometidos con un sistema justo.","authors":["Oswaldo Terán","Christophe Sibertin-Blanc"],"meta":["March 2020Revista de Ciencias Sociales (Venezuela) 26(1)"],"references":["262176379_Boundedly_Rational_Agents_Playing_the_Social_Actors_Game_How_to_Reach_Cooperation","337326527_The_Venezuelan_System_of_Potato_Production_A_Simulation_Model_to_Understand_Roots_of_Deficiencies","286054698_Procesos_de_transformacion_territorial_y_agendas_de_desarrollo_rural_El_municipio_rangel_y_la_asociacion_de_productores_integrales_del_paramo_proinpa_en_los_andes_venezolanos","284529377_The_Bureaucratic_Phenomenon","271184605_Actors_and_Systems_The_Politics_of_Collective_Action","44733664_La_estrategia_de_la_semilla_en_el_sistema_papero_de_Los_Andes_de_Merida_una_vision_desde_la_perspectiva_agroecologica_Liccia_Romero"]}