{"id":"342048583_Reviewing_assessment_of_student_learning_in_interdisciplinary_STEM_education","abstract":"STEM education has received increasing attention in recent years. However, developing valid and reliable assessment of interdisciplinary learning in STEM has been a challenge. This study is a comprehensive review of assessment of interdisciplinary STEM education during the last two decades. A total of 49 empirical research articles were collected from an initial library of 635 articles focusing on interdisciplinary STEM education. A two-dimensional framework was developed to examine the literature. The first dimension concerns the nature of disciplines being assessed and includes three categories: monodisciplinary, interdiscipline, and transdiscipline. The second dimension concerns the learning objectives and includes four aspects: knowledge, skill, practice, and affective domain. The results show that most assessments focused on assessments of monodisciplinary knowledge, monodisciplinary affective domains, and transdisciplinary affective domains. Although many programs aimed to improve students' interdisciplinary understanding or skills, their assessments did not align with their aims. Based on the review, future directions are proposed for developing assessments for interdisciplinary STEM educational programs.","authors":["Xiaoyi Gao","Peishan Li","Ji Shen","Huifang Sun"],"meta":["June 2020International Journal of STEM Education 7(24):1-14","DOI:10.1186/s40594-020-00225-4"],"references":["322692839_Changing_the_face_of_STEM_with_stormwater_research","321086756_Co-Measure_developing_an_assessment_for_student_collaboration_in_STEAM_activities","314489807_Advancing_Elementary_and_Middle_School_STEM_Education","311893701_Advancing_integrated_STEM_learning_through_engineering_design_Sixth-grade_students'_design_and_construction_of_earthquake_resistant_buildings","350651501_Researching_into_Assessment_Evaluation","345543001_Integrated_STEM_Education","331634593_A_Practical_Action_Research_Study_of_the_Impact_of_Maker-Centered_STEM-PjBL_on_a_Rural_Middle_School_in_Taiwan","323191782_Instructional_leadership_in_the_era_of_the_NGSS_Principals'_understandings_of_science_practices","322711328_A_Study_of_Creativity_in_CaC2_Steamship-derived_STEM_Project-based_Learning","315359355_Speedometry_A_vehicle_for_promoting_interest_and_engagement_through_integrated_STEM_instruction"]}