{"id":"342081016_Financial_Technology_Review_of_Trends_Approaches_and_Management","abstract":"Technological innovation and digitization have posed a challenge to the financial sector globally. Fintech is the term used to designate the application of new technologies to financial services. The aim of the study is to analyse this research subject worldwide during the period 1975–2019. To this end, bibliometric techniques were applied to 2012 articles, obtaining findings of the productivity of scientific research, of the main thematic axes and their evolution. Scientific activity increased, mainly in the past decade, with 45% of publications. The main thematic areas were Business, Management and Accounting, Engineering, Social Sciences and Computer Science. Seven research lines were identified, aimed at analysing the aspects financial, economic, technology transfer, investment, innovation, partnerships and institutions and commercial. Future research lines should develop analyses on banking, financial services trade, territorial development, legal, management, research methodologies and the sustainability of financial technologies. It was verified that there is a growing and dynamic interest in scientific activity on financial technologies at an international level. The findings obtained are a complement to the knowledge of financial technologies and allow the relationship between science and technology to be established, and to inform the decision-making process.","authors":["Emilio Abad-Segura","Mariana-Daniela González-Zamar","Eloy López Meneses","Esteban Vázquez-Cano"],"meta":["June 2020","DOI:10.3390/math8060951"],"references":["344630978_Lean_Startup_Operationalizing_Lean_Startup_Capability_and_testing_its_performance_implications","341455504_Sustainability_of_Educational_Technologies_An_Approach_to_Augmented_Reality_Research","341172565_Prospects_and_Risks_of_the_Fintech_Initiatives_in_a_Global_Banking_Industry","340699379_Global_Research_Trends_in_Financial_Transactions","340548936_User_requirement_and_usability_testing_framework_for_information_system_development_case_study_of_financial_institution","341457639_Minning_of_Bitcoin_Technology","341192345_Toward_a_Public-Key_Management_Framework_for_Virtual_Assets_and_Virtual_Asset_Service_Providers","341171537_FinTech_Business_Models_an_Investigation_of_Thai_Banks","340834774_Designing_a_Digital_Payment_Framework_for_HEI's_Using_Smart_ID","340584250_Accuracy_of_funding_information_in_Scopus_a_comparative_case_study"]}