{"id":"342016768_Learning-Based_Affine_Registration_of_Histological_Images","abstract":"The use of different stains for histological sample preparation reveals distinct tissue properties and may result in a more accurate diagnosis. However, as a result of the staining process, the tissue slides are being deformed and registration is required before further processing. The importance of this problem led to organizing an open challenge named Automatic Non-rigid Histological Image Registration Challenge (ANHIR), organized jointly with the IEEE ISBI 2019 conference. The challenge organizers provided several hundred image pairs and a server-side evaluation platform. One of the most difficult sub-problems for the challenge participants was to find an initial, global transform, before attempting to calculate the final, non-rigid deformation field. This article solves the problem by proposing a deep network trained in an unsupervised way with a good generalization. We propose a method that works well for images with different resolutions, aspect ratios, without the necessity to perform image padding, while maintaining a low number of network parameters and fast forward pass time. The proposed method is orders of magnitude faster than the classical approach based on the iterative similarity metric optimization or computer vision descriptors. The success rate is above 98% for both the training set and the evaluation set. We make both the training and inference code freely available.","authors":["Marek Wodzinski","Henning Müller"],"meta":["June 2020","DOI:10.1007/978-3-030-50120-4_2","In book: Biomedical Image Registration (pp.12-22)"],"references":["338898059_Deep_learning_in_medical_image_registration_a_survey","335156767_Evaluation_of_MRI_to_Ultrasound_Registration_Methods_for_Brain_Shift_Correction_The_CuRIOUS2018_Challenge","332428245_Automatic_Non-rigid_Histological_Image_Registration_challenge","340497388_ANHIR_Automatic_Non-rigid_Histological_Image_Registration_Challenge","335388932_Adversarial_Learning_for_Mono-_or_Multi-Modal_Registration","334440475_Unsupervised_Learning_of_Probabilistic_Diffeomorphic_Registration_for_Images_and_Surfaces","330858992_VoxelMorph_A_Learning_Framework_for_Deformable_Medical_Image_Registration","329507576_A_Deep_Learning_Framework_for_Unsupervised_Affine_and_Deformable_Image_Registration","325522197_Deformable_medical_image_registration_using_generative_adversarial_networks","325519311_Stain_independent_segmentation_of_whole_slide_images_A_case_study_in_renal_histology"]}