{"id":"342096983_CoRiMaS-An_Ontological_Approach_to_Cooperative_Risk_Management_in_Seaports","abstract":"For today's global value chains, seaports and their operations are indispensable components. In many cases, the cargo handling takes place in close proximity to residential and/or environmentally sensitive areas. Furthermore, seaports are often not operated by a single organization, but need to be considered as communities of sometimes hundreds of internal and external stakeholders. Due to their close cooperation in the cargo handling process, risk management should be a common approach among the internal stakeholders as well in order to effectively mitigate and respond to emerging risks. However, empirical research has revealed that risk management is often limited to the organization itself, which indicates a clear lack of cooperation. Primary reasons in this regard are missing knowledge about the relations and responsibilities within the port and differing terminologies. Therefore, we propose an ontology (CoRiMaS) that implements a developed reference model for risk management that explicitly aims at seaports with a cooperative approach to risk management. CoRiMaS has been designed looking at the Semantic Web and at the Linked Data model to provide a common interoperable vocabulary in the target domain. The key concepts of our ontology comprise the hazard, stakeholder, seaport, cooperation aspect, and risk management process. We validated our ontology by applying it in a case study format to the Port of Hamburg (Germany). The CoRiMaS ontology can be widely applied to foster cooperation within and among seaports. We believe that such an ontological approach has the potential to improve current risk management practices and, thereby, to increase the resilience of operations, as well as the protection of sensitive surrounding areas.","authors":["Salvatore Flavio Pileggi","Marius Indorf","Ayman Nagi","Wolfgang Kersten"],"meta":["June 2020Sustainability 12(11)","DOI:10.3390/su12114767","Project: Mitigating The Effects of Emergencies in the Baltic Sea Region Ports (HAZARD)"],"references":["338503895_Risk_Management_Framework_for_Handling_and_Storage_of_Cargo_at_Major_Ports_in_Malaysia_towards_Port_Sustainability","337726240_Analysis_of_risk_factors_influencing_the_safety_of_maritime_container_supply_chains","328203680_Maritime_Risk_in_Seaport_Operation_A_Cross-Country_Empirical_Analysis_with_Theoretical_Foundations","327609596_Simulation-based_severe_weather-induced_container_terminal_economic_loss_estimation","320170616_Bibliometric_Analysis_of_Risk_Management_in_Seaports","339074873_Seaport_climate_change_impact_assessment_using_a_multi-level_methodology","338073748_Contamination_and_ecological_risk_assessment_of_the_seaport_of_Naples_Italy_Insights_from_marine_sediments","336573644_Mitigative_and_adaptive_investments_for_natural_disasters_and_labor_strikes_in_a_seaport-dry_port_inland_logistics_network","330999324_Risk_assessment_of_maritime_supply_chain_security_in_ports_and_waterways","330620952_Green_Ports_Inland_and_Seaside_Sustainable_Transportation_Strategies"]}