{"id":"342106155_Exploring_industry_40_A_readiness_assessment_for_SMEs","abstract":"Industry 4.0 is considered to be the fourth industrial revolution and involves virtual and physical systems that are interconnected and collaborate together in an autonomous way. This thesis presents a readiness assessment of small and medium enterprises (SMEs) regarding industry 4.0 implementation. Industry 4.0 is a relatively new concept within the computer science field and it raises the interest on how to make use of technologies included in the concept and profit from them. In order for SMEs to prepare for industry 4.0 implementation, a readiness assessment is needed. The research problem is that there is a limited amount of readiness assessments available that covers challenges and specific requirements for SMEs in industry 4.0. The research question has been formulated to be What is the level of readiness of SMEs to embrace the benefits and tackle the challenges of industry 4.0? and will be answered by using a survey approach as a research strategy. The data collection and analysis method selected is to utilize a literature review with a grounded theory approach. The literature review was used as the foundation for conducting a readiness assessment method-the IMPULS model. The IMPULS model has been used with a modified approach to fit the research question. The results show that SMEs receive no higher level than level two out of six levels (0-5) according to the IMPULS model in the modified IMPULS approach, indicating they are at a learning state of industry 4.0 implementation. The conclusion is that SMEs are at the intermediate level which indicates that some SMEs have to some extent started to implement industry 4.0 in their strategies. The intermediate level is equivalent to level two which is a rather low readiness level. Intermediate is categorised by IMPULS into Learners, which describes well what state SMEs according to the readiness assessment are.","authors":["Natalie Grufman","Sinéad Lyons"],"meta":["June 2020","DOI:10.13140/RG.2.2.12170.08647","Thesis for: Master degree in computer scienceAdvisor: Eriks Sneiders"],"references":["339490256_SME_Innovation_and_Development_in_the_Context_of_Industry_40","339093154_Industry_40_concepts_within_the_Czech_SME_manufacturing_sector_an_empirical_assessment_of_critical_success_factors","338369437_SME_40_The_Role_of_Small-_and_Medium-Sized_Enterprises_in_the_Digital_Transformation","338369347_Development_of_an_Organizational_Maturity_Model_in_Terms_of_Mass_Customization","338369227_SME_Requirements_and_Guidelines_for_the_Design_of_Smart_and_Highly_Adaptable_Manufacturing_Systems","338360163_Requirement_Analysis_for_the_Design_of_Smart_Logistics_in_SMEs","338190256_Problems_with_the_Implementation_of_Industry_40_in_Enterprises_from_the_SME_Sector","339491364_Cost-driven_motives_to_relocate_manufacturing_abroad_among_small-_and_medium-sized_manufacturers_The_influence_of_Industry_40","338367936_Implementation_of_Industrial_Internet_of_Things_and_Cyber-Physical_Systems_in_SMEs_for_Distributed_and_Service-Oriented_Control","338364697_Implementing_Industry_40_in_SMEs_A_Focus_Group_Study_on_Organizational_Requirements"]}