{"id":"342121390_DRLViz_Understanding_Decisions_and_Memory_in_Deep_Reinforcement_Learning","abstract":"We present DRLViz, a visual analytics interface to interpret the internal memory of an agent (e.g. a robot) trained using deep reinforcement learning. This memory is composed of large temporal vectors updated when the agent moves in an environment and is not trivial to understand due to the number of dimensions, dependencies to past vectors, spatial/temporal correlations, and co‐correlation between dimensions. It is often referred to as a black box as only inputs (images) and outputs (actions) are intelligible for humans. Using DRLViz, experts are assisted to interpret decisions using memory reduction interactions, and to investigate the role of parts of the memory when errors have been made (e.g. wrong direction). We report on DRLViz applied in the context of video games simulators (ViZDoom) for a navigation scenario with item gathering tasks. We also report on experts evaluation using DRLViz, and applicability of DRLViz to other scenarios and navigation problems beyond simulation games, as well as its contribution to black box models interpretability and explain‐ability in the field of visual analytics.","authors":["Theo Jaunet","Romain Vuillemot","Christian Wolf"],"meta":["May 2020Computer Graphics Forum 39(3)","DOI:10.1111/cgf.13962"],"references":["328533993_Human_Activity_Recognition_through_Weighted_Finite_Automata","327455530_DQNViz_A_Visual_Analytics_Approach_to_Understand_Deep_Q-Networks","327216988_HiGlass_Web-based_visual_exploration_and_analysis_of_genome_interaction_maps","341048297_Learning_3D_Navigation_Protocols_on_Touch_Interfaces_with_Cooperative_Multi-agent_Reinforcement_Learning","338507175_MUREL_Multimodal_Relational_Reasoning_for_Visual_Question_Answering","333062965_The_Animal-AI_Olympics","329747391_IQA_Visual_Question_Answering_in_Interactive_Environments","329740378_Embodied_Question_Answering","327132166_RetainVis_Visual_Analytics_with_Interpretable_and_Interactive_Recurrent_Neural_Networks_on_Electronic_Medical_Records","325633517_Matterport3D_Learning_from_RGB-D_Data_in_Indoor_Environments"]}