{"id":"342160071_Relating_Emerging_Adaptive_Network_Behavior_to_Network_Structure_A_Declarative_Network_Analysis_Perspective","abstract":"In: Vietnam Journal of Computer Science. In this paper, the challenge for dynamic network modeling is addressed how emerging behaviour of an adaptive network can be related to characteristics of the adaptive network's structure. By applying network reification, the adaptation structure is modeled in a declarative manner as a subnet-work of a reified network extending the base network. This construction can be used to model and analyse any adaptive network in a neat and declarative manner, where the adaptation principles are described by declarative mathematical relations and functions in reified temporal-causal network format. In different examples it is shown how certain adaptation principles known from the literature can be formulated easily in such a declarative reified temporal-causal network format. The main focus of this paper on how emerging adaptive network behaviour relates to network structure is addressed, among others, by means of a number of theorems of the format 'properties of reified network structure characteristics imply emerging adaptive behaviour properties'. In such theorems classes of networks are considered that satisfy certain network structure properties concerning connectivity and aggregation characteristics. Results include, for example, that under some conditions on the network structure characteristics , all states eventually get the same value. Similar analysis methods are applied to reification states, in particular for adaptation principles for Hebbian learning and for bonding by homophily, respectively. Here results include how certain properties of the aggregation characteristics of the network structure of the reified network for hebbian learning entail behavioural properties relating to the maximal final values of the adaptive connection weights. Similarly, results are discussed on how properties of the aggregation characteristics of the reified network structure for bonding by homophily entail be-havioural properties relating to clustering and community formation in a social network.","authors":["Jan Treur"],"meta":["June 2020Vietnam Journal of Computer Science 08(1)","DOI:10.1142/S2196888821500020","Project: Mathematical Analysis of Emergent Network Behaviour in Relation to the Network's Structure"],"references":["335524184_Analysis_of_a_Network's_Asymptotic_Behaviour_via_its_Structure_Involving_its_Strongly_Connected_Components","334576216_Network-Oriented_Modeling_for_Adaptive_Networks_Designing_Higher-Order_Adaptive_Biological_Mental_and_Social_Network_Models","330440560_A_Modeling_Environment_for_Dynamic_and_Adaptive_Network_Models_Implemented_in_MATLAB","327644562_Network_Reification_as_a_Unified_Approach_to_Represent_Network_Adaptation_Principles_Within_a_Network","316356444_The_temporal_paradox_of_Hebbian_learning_and_homeostatic_plasticity","313791285_On_the_Applicability_of_Network-Oriented_Modeling_Based_on_Temporal-Causal_Networks_Why_Network_Models_Do_Not_Just_Model_Networks","310827016_Meta-adaptation_in_the_auditory_midbrain_under_cortical_influence","305930006_Network-Oriented_Modeling_Addressing_Complexity_of_Cognitive_Affective_and_Social_Interactions","299049767_Verification_of_Temporal-Causal_Network_Models_by_Mathematical_Analysis","329107867_Relating_an_Adaptive_Network's_Structure_to_Its_Emerging_Behaviour_for_Hebbian_Learning","270913254_Biological_context_of_Hebb_learning_in_artificial_neural_networks_a_review","261956809_Hebbian_learning_and_predictive_mirror_neurons_for_actions_sensations_and_emotions","261180028_Modelling_and_Analysis_of_Social_Contagion_in_Dynamic_Networks","258229910_The_dynamical_systems_approach_to_differential_equations","279870651_The_Incompleteness_Theorems"]}