{"id":"342150906_Incremental_Modeling_and_Monitoring_of_Embedded_CPU-GPU_Chips","abstract":"This paper presents a monitoring framework to detect drifts and faults in the behavior of the central processing unit (CPU)-graphics processing unit (GPU) chips powering them. To construct the framework, an incremental model and a fault detection and isolation (FDI) algorithm are hereby proposed. The reference model is composed of a set of interconnected exchangeable subsystems that allows it to be adapted to changes in the structure of the system or operating modes, by replacing or extending its components. It estimates a set of variables characterizing the operating state of the chip from only two global inputs. Then, through analytical redundancy, the estimated variables are compared to the output of the system in the FDI module, which generates alarms in the presence of faults or drifts in the system. Furthermore, the interconnected nature of the model allows for the direct localization and isolation of any detected abnormalities. The implementation of the proposed framework requires no additional instrumentation as the used variables are measured by the system. Finally, we use multiple experimental setups for the validation of our approach and also proving that it can be applied to most of the existing embedded systems.","authors":["Oussama Djedidi","Mohand Arab Djeziri"],"meta":["June 2020Processes 8(6)","DOI:10.3390/pr8060678","Project: Prototyping of mechatronic systems for optimizing life cycle and maintainability."],"references":["328548739_Constructing_an_Accurate_and_a_High-Performance_Power_Profiler_for_Embedded_Systems_and_Smartphones","328245070_Data-Driven_Approach_for_Feature_Drift_Detection_in_Embedded_Electronic_Devices","328038446_A_survey_on_modeling_and_model-driven_engineering_practices_in_the_embedded_software_industry","324431279_Fault_and_Timing_Analysis_in_Critical_Multi-Core_Systems_-_A_Survey_with_an_Avionics_Perspective","341429929_Power_Profiling_and_Monitoring_in_Embedded_Systems_A_Comparative_Study_and_a_Novel_Methodology_Based_on_NARX_Neural_Networks","328557459_Early_Prediction_of_Reliability_and_Availability_of_Combined_Hardware-Software_Systems_based_on_Functional_Failures","327439969_Scheduling_non-preemptive_tasks_with_strict_periods_in_multi-core_real-time_systems","326897142_Minimizing_Energy_by_Thermal-Aware_Task_Assignment_and_Speed_Scaling_in_Heterogeneous_MPSoC_Systems","320886746_Deep_Green_Modelling_Time-Series_of_Software_Energy_Consumption","320228068_Accurate_Power_Modeling_of_Modern_Mobile_Application_Processors"]}