{"id":"342159879_Computing_Eccentricity-Based_Topological_Indices_of_2-Power_Interconnection_Networks","abstract":"In a connected graph G with a vertex v , the eccentricity ε v of v is the distance between v and a vertex farthest from v in the graph G . Among eccentricity-based topological indices, the eccentric connectivity index, the total eccentricity index, and the Zagreb index are of vital importance. The eccentric connectivity index of G is defined by ξ G = ∑ v ∈ V G d v ε v , where d v is the degree of the vertex v and ε v is the eccentricity of v in G . The topological structure of an interconnected network can be modeled by using graph explanation as a tool. This fact has been universally accepted and used by computer scientists and engineers. More than that, practically, it has been shown that graph theory is a very powerful tool for designing and analyzing the topological structure of interconnection networks. The topological properties of the interconnection network have been computed by Hayat and Imran (2014), Haynes et al. (2002), and Imran et al. (2015). In this paper, we compute the close results for eccentricity-based topological indices such as the eccentric connectivity index, the total eccentricity index, and the first, second, and third Zagreb eccentricity index of a hypertree, sibling tree, and X -tree for k -level by using the edge partition method.","authors":["Muhammad Imran","Muhammad Azhar Iqbal","Yun Liu","Abdul Qudair Baig"],"meta":["June 2020Journal of Chemistry 2020(8)","DOI:10.1155/2020/3794592"],"references":["299397646_Computing_Topological_Indices_of_Honeycomb_Derived_Networks","284217734_On_Topological_Properties_of_Dominating_David_Derived_Networks","283184725_2-Power_Domination_in_Certain_Interconnection_Networks","281511584_Computation_of_Certain_Topological_Indices_of_Nanotubes_Covered_by_C_5_and_C_7SUB","279311847_On_Degree_Based_Topological_Indices_of_Certain_Nanotubes","278674148_On_some_eccentricity_based_topological_indices_of_nanostar_dendrimers","273899189_On_Topological_Indices_of_Poly_Oxide_Poly_Silicate_DOX_and_DSL_Networks","267390975_Computation_of_Certain_Topological_Indices_of_Nanotubes","286178842_Embedding_of_circulant_networks_into_k-rooted_sibling_trees","269729795_On_topological_indices_of_fullerenes"]}