{"id":"342125794_Quantum_Dilation_and_Erosion","abstract":"The dilation and erosion operations are the first fundamental step in classical image processing. They are important in many image processing algorithms to extract basic image features, such as geometric shapes; such shapes are then fed to higher level algorithms for object identification and recognition. In this paper, we present an improved quantum method to realize dilation and erosion in imaging processing. Unlike in the classical way, in the quantum version of imaging processing, all of the information is stored in quantum bits (qubits). We use qubits to code the location and other information of each pixel of the images and apply quantum operators (or quantum gates) to accomplish specific functions. Because of quantum entanglement and other nonintuitive features in quantum mechanics, qubits have many advantages over classical bits, but their nature presents challenges in designing quantum algorithms. We first built the quantum circuit theoretically, and then ran it on the IBM Quantum Experience platform to test and process real images. With this algorithm, we are looking forward to more potential applications in quantum computation.","authors":["Shi-Yuan Ma","Ashraf Khalil","Hassan Hajjdiab","Hichem Eleuch"],"meta":["June 2020Applied Sciences 10(11):4040","DOI:10.3390/app10114040"],"references":["319637870_Quantum_Image_Processing_and_Its_Application_to_Edge_Detection_Theory_and_Experiment","276481467_Quantum_morphology_operations_based_on_quantum_representation_model","266855738_Quantum_Computation-Based_Image_Representation_Processing_Operations_and_Their_Applications","221772692_Recent_Advances_in_Morphological_Cell_Image_Analysis","327850482_A_Quantum_Image_Representation_Based_on_Bitplanes","324213065_Quantum_gray-scale_image_dilationerosion_algorithm_based_on_quantum_loading_scheme","310467540_Improved_quantum_dilation_and_erosion_operations","281689185_Novel_quantum_gray-scale_image_matching","222450718_Morphological_hit-or-miss_transformation_for_shape_recognition","220691944_Digital_Image_Processing-Principles_and_Applications"]}