{"id":"342151331_Adults_and_Children_Implicitly_Associate_Brilliance_with_Men_More_Than_Women","abstract":"Women are underrepresented in careers where success is perceived to depend on high levels of intellectual ability (e.g., brilliance, genius), including those in science and technology. This phenomenon may be due in part to a gender-brilliance stereotype that portrays men as more brilliant than women. Here, we offer the first investigation of whether people implicitly associate brilliance with men more than women. Implicit measures are absent from prior research on the gender-brilliance stereotype, despite having the potential to contribute unique information about the prevalence of this stereotype. Across 5 studies (N = 3,618) with 17 Implicit Association Tests using 6 distinct comparison traits (e.g., creative, funny), we found consistent evidence for an implicit gender-brilliance stereotype favoring men. Indeed, for 5 out of 6 comparison traits (even the male-typed trait funny), male was associated with brilliant and female with the comparison trait. Only a physical trait (strong) showed a stronger association with male than brilliant did; none of the psychological traits used as comparisons rivaled brilliant in their association to male. Evidence for the implicit gender-brilliance stereotype was consistently observed whether the male and female targets were represented with verbal labels or pictures, and whether the pictures depicted White or Black targets. Moreover, the results were robust in both men and women, children and adults, across different regions of the U.S. as well as internationally. This pervasive implicit association of brilliance with men is likely to hold women back in careers perceived to require brilliance.","authors":["Daniel Storage","Tessa Charlesworth","Mahzarin Banaji","Andrei Cimpian"],"meta":["June 2020Journal of Experimental Social Psychology","DOI:10.1016/j.jesp.2020.104020"],"references":["339215150_Can_the_Implicit_Association_Test_Measure_Automatic_Judgment_The_Validation_Continues","335639611_The_Acquisition_of_Gender_Stereotypes_about_Intellectual_Ability_Intersections_with_Race","334854300_Gender_in_Science_Technology_Engineering_and_Mathematics_Issues_Causes_Solutions","334552575_Gender_stereotypes_have_changed_A_cross-temporal_meta-analysis_of_US_public_opinion_polls_from_1946_to_2018","333855707_Teachers'_Belief_that_Math_Requires_Innate_Ability_Predicts_Lower_Intrinsic_Motivation_Among_Low-Achieving_Students","333696067_What_did_you_do_yesterday_A_meta-analysis_of_sex_differences_in_episodic_memory","339192252_Is_There_a_Gender-Equality_Paradox_in_Science_Technology_Engineering_and_Math_STEM_Commentary_on_the_Study_by_Stoet_and_Geary_2018","336780823_The_Implicit_Association_Test_A_Method_in_Search_of_a_Construct","332659501_Brilliant_or_Bad_The_Gendered_Social_Construction_of_Exceptionalism_in_Early_Adolescence","331696944_Scaling_Down_Inequality_Rating_Scales_Gender_Bias_and_the_Architecture_of_Evaluation"]}