{"id":"342155505_Networks_beyond_pairwise_interactions_Structure_and_dynamics","abstract":"The complexity of many biological, social and technological systems stems from the richness of the interactions among their units. Over the past decades, a great variety of complex systems has been successfully described as networks whose interacting pairs of nodes are connected by links. Yet, in face-to-face human communication, chemical reactions and ecological systems, interactions can occur in groups of three or more nodes and cannot be simply described just in terms of simple dyads. Until recently, little attention has been devoted to the higher-order architecture of real complex systems. However, a mounting body of evidence is showing that taking the higher-order structure of these systems into account can greatly enhance our modeling capacities and help us to understand and predict their emerging dynamical behaviors. Here, we present a complete overview of the emerging field of networks beyond pairwise interactions. We first discuss the methods to represent higher-order interactions and give a unified presentation of the different frameworks used to describe higher-order systems, highlighting the links between the existing concepts and representations. We review both the measures designed to characterize the structure of these systems, and the models proposed in the literature to generate synthetic structures, such as random and growing simplicial complexes, bipartite graphs and hypergraphs. We then introduce and discuss the rapidly growing research on higher-order dynamical systems and on dynamical topology. We focus on novel emergent phenomena characterizing landmark dynamical processes, such as diffusion, spreading, synchronization and games, when extended beyond pairwise interactions. We elucidate the relations between higher-order topology and dynamical properties, and conclude with a summary of empirical applications, providing an outlook on current modeling and conceptual frontiers.","authors":["Federico Battiston","Giulia Cencetti","Iacopo Iacopini","Vito Latora"],"meta":["June 2020Physics Reports 874(4047)","DOI:10.1016/j.physrep.2020.05.004"],"references":["350936258_A_universal_route_to_explosive_phenomena","349548861_Stability_of_synchronization_in_simplicial_complexes","346542653_Higher_order_interactions_in_complex_networks_of_phase_oscillators_promote_abrupt_synchronization_switching","344969209_Multiorder_Laplacian_for_synchronization_in_higher-order_networks","355864647_Multi-group_SIS_Epidemics_with_Simplicial_and_Higher-Order_Interactions","351368284_Hypergraphs_for_predicting_essential_genes_using_multiprotein_complex_data","350190365_Persistent_Homology_of_Geospatial_Data_A_Case_Study_with_Voting","349698788_Master_equation_analysis_of_mesoscopic_localization_in_contagion_dynamics_on_higher-order_networks","345638047_Probabilistic_Foundations_of_Statistical_Network_Analysis","344661298_Modelling_and_analysis_of_tagging_networks_in_Stack_Exchange_communities"]}