{"id":"342103936_Mentorship_and_protege_success_in_STEM_fields","abstract":"Einstein believed that mentors are especially influential in a protégé’s intellectual development, yet the link between mentorship and protégé success remains a mystery. We marshaled genealogical data on nearly 40,000 scientists who published 1,167,518 papers in biomedicine, chemistry, math, or physics between 1960 and 2017 to investigate the relationship between mentorship and protégé achievement. In our data, we find groupings of mentors with similar records and reputations who attracted protégés of similar talents and expected levels of professional success. However, each grouping has an exception: One mentor has an additional hidden capability that can be mentored to their protégés. They display skill in creating and communicating prizewinning research. Because the mentor’s ability for creating and communicating celebrated research existed before the prize’s conferment, protégés of future prizewinning mentors can be uniquely exposed to mentorship for conducting celebrated research. Our models explain 34–44% of the variance in protégé success and reveals three main findings. First, mentorship strongly predicts protégé success across diverse disciplines. Mentorship is associated with a 2×-to-4× rise in a protégé’s likelihood of prizewinning, National Academy of Science (NAS) induction, or superstardom relative to matched protégés. Second, mentorship is significantly associated with an increase in the probability of protégés pioneering their own research topics and being midcareer late bloomers. Third, contrary to conventional thought, protégés do not succeed most by following their mentors’ research topics but by studying original topics and coauthoring no more than a small fraction of papers with their mentors.","authors":["Yifang Ma","Satyam Mukherjee","Brian Uzzi"],"meta":["June 2020Proceedings of the National Academy of Sciences 117(25):201915516","DOI:10.1073/pnas.1915516117","Project: scientometrics"],"references":["336195662_Early-career_setback_and_future_career_impact","329218860_Intellectual_synthesis_in_mentorship_determines_success_in_academic_careers","328722281_The_Reverse_Matthew_Effect_Consequences_of_Retraction_in_Scientific_Teams","324708463_The_Matthew_effect_in_science_funding","344071540_The_Economy_of_Prestige_Prizes_Awards_and_the_Circulation_of_Cultural_Value","332760412_Productivity_prominence_and_the_effects_of_academic_environment","332337719_Early-Career_Setback_and_Future_Career_Impact","330406417_Women_who_win_prizes_get_less_money_and_prestige","329564013_The_Chaperone_Effect_in_Scientific_Publishing","329563917_Scientific_prize_network_predicts_who_pushes_the_boundaries_of_science"]}