{"id":"342148313_Micro-Attention_for_Micro-Expression_Recognition","abstract":"Micro-expression, for its high objectivity in emotion detection, has emerged to be a promising modality in affective computing. Recently, deep learning methods have been successfully introduced into the micro-expression recognition area. Whilst the higher recognition accuracy achieved, substantial challenges in micro-expression recognition remain. The existence of micro expression in small-local areas on face and limited size of available databases still constrain the recognition accuracy on such emotional facial behavior. In this work, to tackle such challenges, we propose a novel attention mechanism called micro-attention cooperating with residual network. Micro-attention enables the network to learn to focus on facial areas of interest covering different action units. Moreover, coping with small datasets, the micro-attention is designed without adding noticeable parameters while a simple yet efficient transfer learning approach is together utilized to alleviate the overfitting risk. With extensive experimental evaluations on three benchmarks (CASMEII, SAMM and SMIC) and post-hoc feature visualizations, we demonstrate the effectiveness of the proposed micro-attention and push the boundary of automatic recognition of micro-expression.","authors":["Chongyang Wang","Min Peng","Tao Bi","T. Chen"],"meta":["June 2020Neurocomputing 410","DOI:10.1016/j.neucom.2020.06.005","Project: Spontaneous Micro-Expression Recognition"],"references":["325641464_Attention_Based_Residual_Network_for_Micro-Gesture_Recognition","325638548_From_Macro_to_Micro_Expression_Recognition_Deep_Learning_on_Small_Datasets_Using_Transfer_Learning","318641700_Coupled_source_domain_targetized_with_updating_tag_vectors_for_micro-expression_recognition","325635522_Enriched_Long-Term_Recurrent_Convolutional_Network_for_Facial_Micro-Expression_Recognition","320964595_Residual_Attention_Network_for_Image_Classification","320373402_Dual_Temporal_Scale_Convolutional_Neural_Network_for_Micro-Expression_Recognition","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","318647659_Learning_effective_binary_descriptors_for_micro-expression_recognition_transferred_by_macro-information","316843307_Deep_learning_for_healthcare_review_opportunities_and_challenges","316443040_Selective_deep_features_for_micro-expression_recognition"]}