{"id":"342119669_RainNet_v10_a_convolutional_neural_network_for_radar-based_precipitation_nowcasting","abstract":"In this study, we present RainNet, a deep convolutional neural network\nfor radar-based precipitation nowcasting. Its design was inspired by\nthe U-Net and SegNet families of deep learning models, which were\noriginally designed for binary segmentation tasks. RainNet was trained\nto predict continuous precipitation intensities at a lead time of 5 min, using several years of quality-controlled weather radar\ncomposites provided by the German Weather Service (DWD). That data set\ncovers Germany with a spatial domain of 900 km×900 km\nand has a resolution of 1 km in space and 5 min in\ntime. Independent verification experiments were carried out on 11\nsummer precipitation events from 2016 to 2017. In order to achieve\na lead time of 1 h, a recursive approach was implemented by using\nRainNet predictions at 5 min lead times as model inputs for\nlonger lead times. In the verification experiments, trivial Eulerian\npersistence and a conventional model based on optical flow served as\nbenchmarks. The latter is available in the rainymotion\nlibrary and had previously been shown to outperform DWD's operational\nnowcasting model for the same set of verification events.\nRainNet significantly outperforms the benchmark models at all lead\ntimes up to 60 min for the routine verification metrics mean\nabsolute error (MAE) and the critical success index (CSI) at intensity\nthresholds of 0.125, 1, and 5 mm h−1. However, rainymotion turned out to be superior in predicting the exceedance of higher\nintensity thresholds (here 10 and 15 mm h−1). The limited\nability of RainNet to predict heavy rainfall intensities is an\nundesirable property which we attribute to a high level of spatial\nsmoothing introduced by the model. At a lead time of 5 min, an\nanalysis of power spectral density confirmed a significant loss of\nspectral power at length scales of 16 km and below. Obviously,\nRainNet had learned an optimal level of smoothing to produce a nowcast\nat 5 min lead time. In that sense, the loss of spectral power\nat small scales is informative, too, as it reflects the limits of\npredictability as a function of spatial scale. Beyond the lead time of\n5 min, however, the increasing level of smoothing is a mere\nartifact – an analogue to numerical diffusion – that is not\na property of RainNet itself but of its recursive application. In the\ncontext of early warning, the smoothing is particularly unfavorable\nsince pronounced features of intense precipitation tend to get lost\nover longer lead times. Hence, we propose several options to address\nthis issue in prospective research, including an adjustment of the\nloss function for model training, model training for longer lead\ntimes, and the prediction of threshold exceedance in terms of a binary\nsegmentation task. Furthermore, we suggest additional input data that\ncould help to better identify situations with imminent precipitation\ndynamics. The model code, pretrained weights, and training data are\nprovided in open repositories as an input for such future studies.","authors":["Georgy Ayzel","Tobias Scheffer","Maik Heistermann"],"meta":["June 2020Geoscientific Model Development 13(6):2631-2644","DOI:10.5194/gmd-13-2631-2020"],"references":["339693898_RainNet_v10_a_convolutional_neural_network_for_radar-based_precipitation_nowcasting","337707457_Rice_yield_prediction_in_lower_Gangetic_Plain_of_India_through_multivariate_approach_and_multiple_regression_analysis","332301974_Optical_flow_models_as_an_open_benchmark_for_radar-based_precipitation_nowcasting_rainymotion_v01","328014115_Challenges_and_design_choices_for_global_weather_and_climate_models_based_on_machine_learning","322431713_A_Method_of_Weather_Radar_Echo_Extrapolation_Based_on_Convolutional_Neural_Networks","331089977_Deep_learning_and_process_understanding_for_data-driven_Earth_system_science","325331640_Could_Machine_Learning_Break_the_Convection_Parameterization_Deadlock","323570759_An_Empirical_Evaluation_of_Generic_Convolutional_and_Recurrent_Networks_for_Sequence_Modeling","318136760_Leveraging_Convolutions_in_Recurrent_Neural_Networks_for_Doppler_Weather_Radar_Echo_Prediction","305193694_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation"]}