{"id":"342149916_Review_of_Machine_Learning_in_Predicting_Dermatological_Outcomes","abstract":"Artificial intelligence is a broad branch of computer science that has garnered significant interest in the field of medicine because of its problem solving, decision making and pattern recognition abilities. Machine learning, a subset of artificial intelligence, hones in on the ability of computers to receive data and learn for themselves, manipulating algorithms as they organize the information they are processing. Dermatology is at a particular advantage in the implementation of machine learning due to the availability of large clinical image databases that can be used for machine training and interpretation. While numerous studies have implemented machine learning in the diagnostic aspect of dermatology, less research has been conducted on the use of machine learning in predicting long-term outcomes in skin disease, with only a few studies published to date. Such an approach would assist physicians in selecting the best treatment methods, save patients' time, reduce treatment costs and improve the quality of treatment overall by reducing the amount of trial-and-error in the treatment process. In this review, we aim to provide a brief and relevant introduction to basic artificial intelligence processes, and to consolidate and examine the published literature on the use of machine learning in predicting clinical outcomes in dermatology.","authors":["Amy X. Du","Sepideh Emam","Robert Gniadecki"],"meta":["June 2020Frontiers in Medicine 7","DOI:10.3389/fmed.2020.00266"],"references":["334172648_Artificial_Intelligence_Does_Consciousness_Matter","332080991_Machine_learning_concepts_concerns_and_opportunities_for_a_pediatric_radiologist","331624525_Assessment_of_Machine_Learning_vs_Standard_Prediction_Rules_for_Predicting_Hospital_Readmissions","331594199_A_convolutional_neural_network_trained_with_dermoscopic_images_performed_on_par_with_145_dermatologists_in_a_clinical_melanoma_image_classification_task","337989061_Should_Health_Care_Demand_Interpretable_Artificial_Intelligence_or_Accept_Black_Box_Medicine","337612906_Predicting_the_Long-term_Outcomes_of_Biologics_in_Psoriasis_Patients_using_Machine_Learning","335631559_Assessment_of_Deep_Learning_Using_Nonimaging_Information_and_Sequential_Medical_Records_to_Develop_a_Prediction_Model_for_Nonmelanoma_Skin_Cancer","334691249_Assessment_of_Deep_Natural_Language_Processing_in_Ascertaining_Oncologic_Outcomes_From_Radiology_Reports","334261902_Artificial_Intelligence_in_Dermatology-Where_We_Are_and_the_Way_to_the_Future_A_Review","332210635_Machine_Learning_in_Medicine"]}