{"id":"342136070_A_practical_guide_on_conducting_eye_tracking_studies_in_software_engineering","abstract":"For several years, the software engineering research community used eye trackers to study program comprehension, bug localization, pair programming, and other software engineering tasks. Eye trackers provide researchers with insights on software engineers’ cognitive processes, data that can augment those acquired through other means, such as on-line surveys and questionnaires. While there are many ways to take advantage of eye trackers, advancing their use requires defining standards for experimental design, execution, and reporting. We begin by presenting the foundations of eye tracking to provide context and perspective. Based on previous surveys of eye tracking for programming and software engineering tasks and our collective, extensive experience with eye trackers, we discuss when and why researchers should use eye trackers as well as how they should use them. We compile a list of typical use cases—real and anticipated—of eye trackers, as well as metrics, visualizations, and statistical analyses to analyze and report eye-tracking data. We also discuss the pragmatics of eye tracking studies. Finally, we offer lessons learned about using eye trackers to study software engineering tasks. This paper is intended to be a one-stop resource for researchers interested in designing, executing, and reporting eye tracking studies of software engineering tasks.","authors":["Zohreh Sharafi","Bonita Sharif","Yann-Gaël Guéhéneuc","Andrew Begel"],"meta":["June 2020Empirical Software Engineering 25(2)","DOI:10.1007/s10664-020-09829-4"],"references":["327563187_Eye_tracking_analysis_of_computer_program_comprehension_in_programmers_with_dyslexia","336970334_Eye_Tracking_in_Second_Language_Acquisition_and_Bilingualism_A_Research_Synthesis_and_Methodological_Guide","335780448_Visually_Analyzing_Students'_Gaze_on_C_Code_Snippets","335425072_Developer_Reading_Behavior_While_Summarizing_Java_Methods_Size_and_Context_Matters","333503703_Visually_analyzing_eye_movements_on_natural_language_texts_and_source_code_snippets","333499486_Using_developer_eye_movements_to_externalize_the_mental_model_used_in_code_summarization_tasks","328909957_AudioHighlight_Code_Skimming_for_Blind_Programmers","328084371_Simultaneous_measurement_of_program_comprehension_with_fMRI_and_eye_tracking_a_case_study","326856953_A_Look_into_Programmers'_Heads","325639898_iTrace_eye_tracking_infrastructure_for_development_environments"]}