{"id":"342141592_A_Review_of_Super-Resolution_Single-Molecule_Localization_Microscopy_Cluster_Analysis_and_Quantification_Methods","abstract":"Single-molecule localization microscopy (SMLM) is a relatively new imaging modality, winning the 2014 Nobel Prize in Chemistry, and considered as one of the key super-resolution techniques. SMLM resolution goes beyond the diffraction limit of light microscopy and achieves resolution on the order of 10–20 nm. SMLM thus enables imaging single molecules and study of the low-level molecular interactions at the subcellular level. In contrast to standard microscopy imaging that produces 2D pixel or 3D voxel grid data, SMLM generates big data of 2D or 3D point clouds with millions of localizations and associated uncertainties. This unprecedented breakthrough in imaging helps researchers employ SMLM in many fields within biology and medicine, such as studying cancerous cells and cell-mediated immunity and accelerating drug discovery. However, SMLM data quantification and interpretation methods have yet to keep pace with the rapid advancement of SMLM imaging. Researchers have been actively exploring new computational methods for SMLM data analysis to extract biosignatures of various biological structures and functions. In this survey, we describe the state-of-the-art clustering methods adopted to analyze and quantify SMLM data and examine the capabilities and shortcomings of the surveyed methods. We classify the methods according to (1) the biological application (i.e., the imaged molecules/structures), (2) the data acquisition (such as imaging modality, dimension, resolution, and number of localizations), and (3) the analysis details (2D versus 3D, field of view versus region of interest, use of machine-learning and multi-scale analysis, biosignature extraction, etc.). We observe that the majority of methods that are based on second-order statistics are sensitive to noise and imaging artifacts, have not been applied to 3D data, do not leverage machine-learning formulations, and are not scalable for big-data analysis. Finally, we summarize state-of-the-art methodology, discuss some key open challenges, and identify future opportunities for better modeling and design of an integrated computational pipeline to address the key challenges.","authors":["Ismail Khater","Ivan R Nabi","Ghassan Hamarneh"],"meta":["June 2020Patterns 1(3):100038","DOI:10.1016/j.patter.2020.100038"],"references":["344952899_DeepLoco_Fast_3D_Localization_Microscopy_Using_Neural_Networks","340060663_Machine_learning_for_cluster_analysis_of_localization_microscopy_data","338168295_ERGO_Efficient_Recurrent_Graph_Optimized_Emitter_Density_Estimation_in_Single_Molecule_Localization_Microscopy","336670077_Topological_data_analysis_quantifies_biological_nano-structure_from_single_molecule_localization_microscopy","336137887_CENP-A_nucleosome_clusters_form_rosette-like_structures_around_HJURP_during_G1","335999491_FOCAL3D_A_3-dimensional_clustering_package_for_single-molecule_localization_microscopy","335412111_Caveolae_and_scaffold_detection_from_single_molecule_localization_microscopy_data_using_deep_learning","334303502_Super-resolution_modularity_analysis_shows_polyhedral_caveolin-1_oligomers_combine_to_form_scaffolds_and_caveolae","333490402_A_tessellation-based_colocalization_analysis_approach_for_single-molecule_localization_microscopy","332281655_Super-resolution_fight_club_Assessment_of_2D_3D_single-molecule_localization_microscopy_software"]}