{"id":"342187878_Using_Technologies_as_Virtual_Environments_for_Computer_Teaching_A_Systematic_Review","abstract":"This research discusses the use of Augmented Reality, Virtual Reality and Mixed Reality technology applications in the learning process of relevant content to the Computer Science area. This systematic review aims to identify applications that use technologies to represent virtual environments and support the teaching and learning of Computer Science subjects. A protocol was elaborated and executed, resulting in the final selection of 14 papers from four databases, published from 2010 to 2018. The examined papers presented information that categorized technology applications in terms of tools used. Contents addressed to the identification of applied instructional strategies and techniques, and the recognition of effects on the learning process. As a result, we found virtual environments that show potential to teaching basic content in courses related to Computer Science. In addition, the application of virtual environments in this educational scenario has provided positive effects on the learning process, such as increased interactivity, easier content absorption, increased motivation and interest in the subjects, providing greater understanding and improving efficiency in content transmission.","authors":["Alex FERNANDO BATISTA","Marcello Thiry","Rafael Queiroz Gonçalves","Anita Maria Rocha Fernandes"],"meta":["June 2020Informatics in Education 19(2):201-221","DOI:10.15388/infedu.2020.10"],"references":["327167922_Virtual_and_augmented_reality_effects_on_K-12_higher_and_tertiary_education_students'_twenty-first_century_skills","324937411_Virtual_reality_in_education_a_tool_for_learning_in_the_experience_age","323022301_What_is_a_virtual_world_Definition_and_classification","330472761_The_Potential_of_Augmented_Reality_for_Computer_Science_Education","329817043_VR_for_Education_in_Information_and_Tehnology_application_for_Bubble_Sort","327782896_The_Research_of_Developing_Virtual_Jewelry_Worn_System_Based_on_AR_Toolkit","327385536_The_potential_of_augmented_reality_to_transform_education_into_Smart_education","327331916_The_Didactic_Potential_of_AR_in_Teaching_Physics","325640179_Augmenting_Coding_Augmented_Reality_for_Learning_Programming","324790794_Emerging_trends_in_augmented_reality_games"]}