{"id":"342175374_Security_and_Performance_of_Single_Sign-On_Based_on_One-Time_Pad_Algorithm","abstract":"Single sign-on (SSO) techniques allow access control for multiple systems with a single login. The aim of our study is to construct an authentication algorithm that provides the authentication information of a user to a requester without requiring any specific token, thereby achieving domain-free access control. In this study, we propose an authentication algorithm for SSO based on a verifiable encryption (VE)-based authentication algorithm and implementation. VE is a kind of cryptosystem that allows calculation on cyphertexts, generating an encrypted result, which matches the distance between two plaintexts when decrypting. In our approach, we first construct the mathematical SSO algorithm based on the VE-based algorithm, and then implement the algorithm by applying the one-time pad to the algorithm and using sample data. We also consider robustness against theoretical attacks such as man-in-the-middle attack. In addition to that, our algorithm is robust against the well-known classical and theoretical attacks, the man-in-the-middle attack against the proposed algorithm is also impracticable. Furthermore, with security analysis using Proverif, the algorithm has been shown to be secure. The execution speed is less than 1 ms even with a text length of 8192 bits. Based on our results, it is evident that the computational burden of trusted third parties, such as a certificate authority, can be alleviated because the public key agreement is not required in our algorithm. Moreover, since only the authentication information is disclosed to the service provider, big tech such as GAFA cannot obtain personal information of the user without consent. As for the originality of our algorithm, any personal information, such as biometric information and non-contact magnetic IC cards in addition to the pair of ID and password, which is used for common SSO algorithms, is available.","authors":["Maki Kihara","Satoshi Iriyama"],"meta":["June 2020Cryptography 4(2):16","DOI:10.3390/cryptography4020016"],"references":["334753263_New_Authentication_Algorithm_Based_on_Verifiable_Encryption_with_Digital_Identity","309225903_A_Review_on_Single_Sign_on_Enabling_Technologies_and_Protocols","258560260_The_Qp-Dyn_Algorithms","257743941_A_Survey_on_Single_Sign-On_Techniques","3195303_Kerberos_An_Authentication_Service_for_Computer_Networks","261113607_A_security_analysis_of_the_OAuth_protocol","228877743_Single_sign-on_for_the_Internet_a_security_story","221055325_Single_Sign-On_Architectures","4049392_Security_analysis_of_the_SAML_Single_Sign-on_Browser_Artifact_profile","2327938_A_Real-World_Analysis_of_Kerberos_Password_Security"]}