{"id":"342162109_Light_source_calibration_for_multispectral_imaging_in_surgery","abstract":"PurposeLive intra-operative functional imaging has multiple potential clinical applications, such as localization of ischemia, assessment of organ transplantation success and perfusion monitoring. Recent research has shown that live monitoring of functional tissue properties, such as tissue oxygenation and blood volume fraction, is possible using multispectral imaging in laparoscopic surgery. While the illuminant spectrum is typically kept constant in laparoscopic surgery and can thus be estimated from preoperative calibration images, a key challenge in open surgery originates from the dynamic changes of lighting conditions.Methods\nThe present paper addresses this challenge with a novel approach to light source calibration based on specular highlight analysis. It involves the acquisition of low-exposure time images serving as a basis for recovering the illuminant spectrum from pixels that contain a dominant specular reflectance component.\nResultsComprehensive in silico and in vivo experiments with a range of different light sources demonstrate that our approach enables an accurate and robust recovery of the illuminant spectrum in the field of view of the camera, which results in reduced errors with respect to the estimation of functional tissue properties. Our approach further outperforms state-of-the-art methods proposed in the field of computer vision.Conclusion\nOur results suggest that low-exposure multispectral images are well suited for light source calibration via specular highlight analysis. This work thus provides an important first step toward live functional imaging in open surgery.","authors":["Leonardo Ayala","Silvia Seidlitz","Anant Suraj Vemuri","Sebastian J. Wirkert"],"meta":["June 2020International Journal of Computer Assisted Radiology and Surgery 15(1)","DOI:10.1007/s11548-020-02195-y"],"references":["348811639_Methods_and_open-source_toolkit_for_analyzing_and_visualizing_challenge_results","326523396_Hyperspectral_imaging_in_perfusion_and_wound_diagnostics_-_Methods_and_algorithms_for_the_determination_of_tissue_parameters","319462353_Physiological_Parameter_Estimation_from_Multispectral_Images_Unleashed","317443548_Illuminant_estimation_in_multispectral_imaging","301826084_Robust_near_real-time_estimation_of_physiological_parameters_from_megapixel_multispectral_images_with_inverse_Monte_Carlo_and_random_forest_regression","323684674_A_compact_hyperspectral_camera_for_measurement_of_perfusion_parameters_in_medicine","320967152_FC4_Fully_Convolutional_Color_Constancy_with_Confidence-Weighted_Pooling","308849155_Color_constancy_using_CNNs","308277745_Deep_Specialized_Network_for_Illuminant_Estimation","304407332_Daylight_Spectrum_Estimation_from_Hyper-and_Multispectral_Image_without_Area_Extraction_of_Uniform_Materials"]}