{"id":"342274614_Privacy_awareness_on_cloud_storage_among_students_at_tertiary_level_A_case_study","abstract":"In recent years, the usage on cloud storage has grown, including students at tertiary level. Cloud storage helps students to store and share academic materials without additional costs. However, not many studies investigate on the students’ awareness level particularly in privacy related issues. This study examined the privacy awareness on cloud storage among students at Universiti Teknologi MARA (UiTM), Kuala Terengganu. The study examined the students’ privacy awareness, through its level of agreement on the five elements which were cloud service awareness, privacy protection, risk analysis, security awareness and data availability participants. 90 respondents from three different programs were selected from the Faculty of Computer and Mathematical Sciences (FSKM). An independent t-test and ANOVA test were conducted using SPSS. The results revealed that there was no significance difference between both genders on the privacy awareness on cloud storage. While, there was a significance difference amongst the three different programs in FSKM about privacy protection. This study concluded that these Computer Science degree students were concerned and aware about the privacy on the cloud storage, but they were not aware about the privacy related issues in the cloud storage.","authors":["Zeti Eri","Sarah Yusoff","K L Ngo","S N H Ishak"],"meta":["April 2020Journal of Physics Conference Series 1529(2):022043","DOI:10.1088/1742-6596/1529/2/022043"],"references":["315591077_Cloud_Computing_Adoption_at_Higher_Education_Institutions_in_Developing_Countries_A_Qualitative_Investigation_of_Main_Enablers_and_Barriers","307638970_Awareness_of_Cloud_Storage_Forensics_among_the_Users_in_Malaysia_A_Survey","263244782_Cloud_Storage_Services_in_Higher_Education_-_Results_of_a_Preliminary_Study_in_the_Context_of_the_SyncShare-Project_in_Germany","257723864_Research_on_Cloud_Data_Storage_Technology_and_Its_Architecture_Implementation","224204127_Security_and_Privacy_in_Cloud_Computing_A_Survey","200045935_Above_the_Clouds_A_Berkeley_View_of_Cloud_Computing","326414214_Cloud_Storage_Privacy_and_Security_User_Awareness_A_Comparative_Analysis_Between_Dutch_and_Macedonian_Users","277295384_Above_the_Clouds_A_Berkeley_View_of_Cloud_Computing","271546159_Data_privacy_protection_using_multiple_cloud_storages"]}