{"id":"342280479_The_quaternion-based_spatial-coordinate_and_orientation-frame_alignment_problems","abstract":"The general problem of finding a global rotation that transforms a given set of spatial coordinates and/or orientation frames (the `test' data) into the best possible alignment with a corresponding set (the `reference' data) is reviewed. For 3D point data, this `orthogonal Procrustes problem' is often phrased in terms of minimizing a root-mean-square deviation (RMSD) corresponding to a Euclidean distance measure relating the two sets of matched coordinates. This article focuses on quaternion eigensystem methods that have been exploited to solve this problem for at least five decades in several different bodies of scientific literature, where they were discovered independently. While numerical methods for the eigenvalue solutions dominate much of this literature, it has long been realized that the quaternion-based RMSD optimization problem can also be solved using exact algebraic expressions based on the form of the quartic equation solution published by Cardano in 1545; focusing on these exact solutions exposes the structure of the entire eigensystem for the traditional 3D spatial-alignment problem. The structure of the less-studied orientation-data context is then explored, investigating how quaternion methods can be extended to solve the corresponding 3D quaternion orientation-frame alignment (QFA) problem, noting the interesting equivalence of this problem to the rotation-averaging problem, which also has been the subject of independent literature threads. The article concludes with a brief discussion of the combined 3D translation–orientation data alignment problem. Appendices are devoted to a tutorial on quaternion frames, a related quaternion technique for extracting quaternions from rotation matrices and a review of quaternion rotation-averaging methods relevant to the orientation-frame alignment problem. The supporting information covers novel extensions of quaternion methods to the 4D Euclidean spatial-coordinate alignment and 4D orientation-frame alignment problems, some miscellaneous topics, and additional details of the quartic algebraic eigenvalue problem.","authors":["Andrew Hanson"],"meta":["July 2020Acta Crystallographica Section A: Foundations and Advances 76(4)","DOI:10.1107/S2053273320002648"],"references":["331494522_RMSD_and_Symmetry","284705705_Accurate_Estimation_of_the_Entropy_of_Rotation-Translation_Probability_Distributions","259207616_Comparing_Distance_Metrics_for_Rotation_Using_the_k-Nearest_Neighbors_Algorithm_for_Entropy_Estimation","287713097_Handbook_of_Mathematical_Functions_with_Formulas_Graphs_and_Mathematical_Tables_US_Department_of_Commerce_Washington_DC","272267323_Estimating_Translational_and_Orientational_Entropies_Using_the_k_-Nearest_Neighbors_Algorithm","266831895_Handbook_of_mathematical_functions_with_formulas_graphs_and_mathematical_tables_Translated_from_the_English_by_V_A_Ditkin_and_L_N_Karmazinaya","265441715_Fitting_Smooth_Paths_to_Speherical_Data","265150402_The_quartic_equation_Invariants_and_Euler's_solution_revealed","257672338_Rotation_Averaging","253223833_Quaternion_Attitude_Estimation_Using_Vector_Observations"]}