{"id":"342252886_Optimality_and_universality_in_quantum_Zeno_dynamics","abstract":"The effective lifetime of a quantum state can increase (the quantum Zeno effect) or decrease (the quantum anti-Zeno effect) in the response to increasing frequency of the repeated measurements and the multiple transitions between these two regimes are potentially possible within the same system. An interesting question arising in this regards is how to choose the optimal schedule of repeated measurements to achieve the maximal possible decay rate of a given quantum state. Addressing the issue of optimality in the quantum Zeno dynamics, we derive a range of rigorous results, which are, due to generality of the theoretical framework adopted here, applicable to the majority of models appeared in the quantum Zeno literature. In particular, we prove the universal dominance of the regular stroboscopic sampling in the sense that it always provides the shortest expected decay time among all possible measurement procedures. However, the implementation of the stroboscopic protocol requires the knowledge of the optimal sampling period which may depend on the fine details of the quantum problem. We demonstrate that this difficulty can be overcome with the tricky non-regular measurement schedule inspired by the scale-free restart strategy used to speed up the completion of the probabilistic algorithms and Internet tasks in computer science as it allows to achieve a near-optimal decay rate in the absence of detailed knowledge of the underlying quantum statistics. Besides, our general approach reveals unexpected universality displayed by the quantum systems subject to the optimally tuned rate of Poissonian measurements and the simple statistical criteria to discriminate between Zeno and anti-Zeno regimes following from this universality. We illustrate our findings with an example of Zeno dynamics in the system of optically-trapped ultra-cold atoms and discuss the implications arising from them.","authors":["Sergey Belan","Vladimir M. Parfenyev"],"meta":["June 2020New Journal of Physics 22(7)","DOI:10.1088/1367-2630/ab9d9e"],"references":["339736177_Median_and_mode_in_first_passage_under_restart","338785570_Noise_sensing_via_stochastic_quantum_Zeno","337086110_Large_fluctuations_of_the_first_detected_quantum_return_time","336813951_A_new_approach_to_study_the_Zeno_effect_for_a_macroscopic_quantum_system_under_frequent_interactions_with_a_harmonic_environment","335666522_Robust_random_search_with_scale-free_stochastic_resetting","331772621_Running_Measurement_Protocol_for_the_Quantum_First-detection_Problem","334147808_The_quantum_Zeno_and_anti-Zeno_effects_from_weak_to_strong_system-environment_coupling","332769985_Facets_of_quantum_information_under_non-Markovian_evolution","331883596_Stochastic_resetting_in_underdamped_Brownian_motion","330483566_Quantum_Zeno_and_anti-Zeno_effect_on_a_two-qubit_gate_by_dynamical_decoupling"]}