{"id":"342271716_Analysis_on_the_Algorithm_and_Practical_Application_of_Computer_Intelligent_Image_Processing_Technology","abstract":"With the continuous improvement of computer science and technology, the role of computer in the development of the whole society is more and more prominent. Based on this development background, people begin to pay attention to the research of computer intelligent processing technology, which can accurately identify and process objects in different environments. At present, the technology in this field has been greatly improved in China, and the application scope of computer intelligent image processing technology has been gradually expanded. The purpose of this paper is to realize the further breakthrough of the computer intelligent processing technology through the exploration of the algorithm and the analysis of the practical application. This article first to the intelligent image processing technology has carried on the summary of relevant, then combined with the existing research materials and the characteristics of the intelligent image processing technology, mathematical morphology of image processing algorithm is proposed, and the effectiveness of the proposed algorithm has carried on the inspection, finally the technology application in the field of industry, agriculture and transportation related instructions. The experimental results show that the image processing algorithm of mathematical form proposed in this paper can realize the accurate processing and recognition of the image and promote the improvement of the technology.","authors":["Li Ding"],"meta":["April 2020Journal of Physics Conference Series 1533(3):032054","DOI:10.1088/1742-6596/1533/3/032054"],"references":["314204566_Research_on_the_Application_of_Digital_Image_Processing_Technology_in_Intelligent_Transportation","275939256_Application_of_Digital_Image_Processing_Technology_in_Interferometer","224108227_Medical_image_enhancement_algorithm_based_on_wavelet_transform"]}