{"id":"342234137_Comparative_Assessment_of_Machine_Learning_Methods_for_Urban_Vegetation_Mapping_Using_Multitemporal_Sentinel-1_Imagery","abstract":"Mapping of green vegetation in urban areas using remote sensing techniques can be used as a tool for integrated spatial planning to deal with urban challenges. In this context, multitemporal (MT) synthetic aperture radar (SAR) data have not been equally investigated, as compared to optical satellite data. This research compared various machine learning methods using single-date and MT Sentinel-1 (S1) imagery. The research was focused on vegetation mapping in urban areas across Europe. Urban vegetation was classified using six classifiers-random forests (RF), support vector machine (SVM), extreme gradient boosting (XGB), multi-layer perceptron (MLP), AdaBoost.M1 (AB), and extreme learning machine (ELM). Whereas, SVM showed the best performance in the single-date image analysis, the MLP classifier yielded the highest overall accuracy in the MT classification scenario. Mean overall accuracy (OA) values for all machine learning methods increased from 57% to 77% with speckle filtering. Using MT SAR data, i.e., three and five S1 imagery, an additional increase in the OA of 8.59% and 13.66% occurred, respectively. Additionally, using three and five S1 imagery for classification, the F1 measure for forest and low vegetation land-cover class exceeded 90%. This research allowed us to confirm the possibility of MT C-band SAR imagery for urban vegetation mapping.","authors":["Mateo Gasparovic","Dino Dobrinic"],"meta":["June 2020Remote Sensing 12(12):1952","DOI:10.3390/rs12121952","Project: Geospatial Monitoring of Green Infrastructure by Means of Terrestrial, Airborne and Satellite Imagery (GEMINI)"],"references":["338755955_Comparison_of_Machine_Learning_Methods_Applied_to_SAR_Images_for_Forest_Classification_in_Mediterranean_Areas","335577731_From_ecology_to_remote_sensing_using_animals_to_map_land_cover","335330237_Land_cover_and_land_use_classification_performance_of_machine_learning_algorithms_in_a_boreal_landscape_using_Sentinel-2_data","334260429_A_Comparative_Assessment_of_Machine-Learning_Techniques_for_Land_Use_and_Land_Cover_Classification_of_the_Brazilian_Tropical_Savanna_Using_ALOS-2PALSAR-2_Polarimetric_Images","333397853_Using_of_Multi-Source_and_Multi-Temporal_Remote_Sensing_Data_Improves_Crop-Type_Mapping_in_the_Subtropical_Agriculture_Region","333093512_Parcel-Based_Crop_Classification_Using_Multi-Temporal_TerraSAR-X_Dual_Polarimetric_Data","332607866_Evaluation_of_Sentinel-1_and_2_Time_Series_for_Land_Cover_Classification_of_Forest-Agriculture_Mosaics_in_Temperate_and_Tropical_Landscapes","331547966_Integration_of_Sentinel-1_and_Sentinel-2_for_Classification_and_LULC_Mapping_in_the_Urban_Area_of_Belem_Eastern_Brazilian_Amazon","342232632_Extreme_Learning_Machine_Theory_and_Applications","335531650_Key_issues_in_rigorous_accuracy_assessment_of_land_cover_products"]}