{"id":"342285767_The_limited_reach_of_fake_news_on_Twitter_during_2019_European_elections","abstract":"The advent of social media changed the way we consume content, favoring a disintermediated access to, and production of information. This scenario has been matter of critical discussion about its impact on society, magnified in the case of the Arab Springs or heavily criticized during Brexit and the 2016 U.S. elections. In this work we explore information consumption on Twitter during the 2019 European Parliament electoral campaign by analyzing the interaction patterns of official news outlets, disinformation outlets, politicians, people from the showbiz and many others. We extensively explore interactions among different classes of accounts in the months preceding the elections, held between 23rd and 26th of May, 2019. We collected almost 400,000 tweets posted by 863 accounts having different roles in the public society. Through a thorough quantitative analysis we investigate the information flow among them, also exploiting geolocalized information. Accounts show the tendency to confine their interaction within the same class and the debate rarely crosses national borders. Moreover, we do not find evidence of an organized network of accounts aimed at spreading disinformation. Instead, disinformation outlets are largely ignored by the other actors and hence play a peripheral role in online political discussions.","authors":["Matteo Cinelli","Stefano Cresci","Alessandro Galeazzi","Walter Quattrociocchi"],"meta":["June 2020PLoS ONE 15(6):e0234689","DOI:10.1371/journal.pone.0234689"],"references":["338659559_Investigating_Italian_disinformation_spreading_on_Twitter_in_the_context_of_2019_European_elections","331936531_Misinformation_spreading_on_Facebook","331929628_Opinion_dynamics_on_interacting_networks_Media_competition_and_social_influence","330395254_Science_audiences_misinformation_and_fake_news","329079116_Bots_increase_exposure_to_negative_and_inflammatory_content_in_online_social_systems","324492295_Cashtag_Piggybacking_Uncovering_Spam_and_Bot_Activity_in_Stock_Microblogs_on_Twitter","323956688_Influence_of_fake_news_in_Twitter_during_the_2016_US_presidential_election","332120456_Polarization_and_Fake_News_Early_Warning_of_Potential_Misinformation_Targets","330630161_The_misinformation_machine","330626092_Fake_news_on_Twitter_during_the_2016_US_presidential_election"]}