{"id":"342204212_An_Intelligent_Traffic_Light_System_Using_Object_Detection_and_Evolutionary_Algorithm_for_Alleviating_Traffic_Congestion_in_Hong_Kong","abstract":"High traffic flow is a typical characteristic of a mobilized city with a high population. Efficient traffic management is a proper solution to reduce the stress and anxiety associated with driving or traveling. The road users can have better timing for traveling as they will not experience journey delays due to traffic congestion. In Hong Kong, until September 2017, over 2,100 kilometers long roads around Hong Kong island, Kowloon Peninsula, and New Territories are serving over 762,000 vehicles, Hyd.gov.hk, Highways Department - Hong Kong Road Network, n.d., https://www.hyd.gov.hk/en/road_and_railway/existing/road_network/road.html. However, the current traffic signal control systems used in Hong Kong are mainly pre-defined fixed-cycle traffic light systems. These systems do not consider too much about the real traffic situations such as vehicle and pedestrian counts, delay and waiting time of the road users. They respond slowly to regulate traffic flow especially when there is a high volume of traffic. A study of effective optimization technologies in controlling traffic signals is conducted which aims to relief the congestion problem and increase road efficiency according to the specific needs of Hong Kong. In this paper, a new traffic light system using machine learning with object detection and analyzing by the evolutionary algorithm that aims to perform a real-time strategic signal switching arrangement to traffic lights at the intersection was designed to reduce the waiting time of pedestrians and vehicles, and provide better traveling experience to road users.","authors":["Sin-Chun Ng","Chok-Pang Kwok"],"meta":["June 2020International Journal of Computational Intelligence Systems 13(1)","DOI:10.2991/ijcis.d.200522.001"],"references":["325666049_Application_of_Deep_Learning_for_Object_Detection","315964605_An_efficient_encoding_scheme_for_a_new_multiple-type_museum_visitor_routing_problem_with_must-see_and_select-see_exhibition_rooms","303657108_TensorFlow_A_system_for_large-scale_machine_learning","281946121_Techniques_for_Smart_Traffic_Control_An_In-depth_Review","274137098_SCOOT_and_SCATS_A_Closer_Look_into_Their_Operations","225022282_SUMO_-_Simulation_of_Urban_MObility_An_Overview","220586947_Intelligent_Traffic_Light_Flow_Control_System_Using_Wireless_Sensors_Networks","324625610_Intelligent_traffic_lights_based_on_MATLAB","224106688_Design_of_Intelligent_Traffic_Light_Controller_Using_Embedded_System","220066209_An_Adaptive_Traffic_Signaling_For_Roundabout_With_Four_Approach_Intersections_Based_On_Fuzzy_Logic"]}