{"id":"342213333_Two_Polynomial_Time_Graph_Labeling_Algorithms_Optimizing_Max-Norm-Based_Objective_Functions","abstract":"Many problems in applied computer science can be expressed in a graph setting and solved by finding an appropriate vertex labeling of the associated graph. It is also common to identify the term “appropriate labeling” with a labeling that optimizes some application-motivated objective function. The goal of this work is to present two algorithms that, for the objective functions in a general format motivated by image processing tasks, find such optimal labelings. Specifically, we consider a problem of finding an optimal binary labeling for the objective function defined as the max-norm over a set of local costs of a form that naturally appears in image processing. It is well known that for a limited subclass of such problems, globally optimal solutions can be found via watershed cuts, that is, by the cuts associated with the optimal spanning forests of a graph. Here, we propose two new algorithms for optimizing a broader class of such problems. The first algorithm, that works for all considered objective functions, returns a globally optimal labeling in quadratic time with respect to the size of the graph (i.e., the number of its vertices and edges) or, for an image associated graph, the size of the image. The second algorithm is more efficient, with quasi-linear time complexity, and returns a globally optimal labeling provided that the objective function satisfies certain given conditions. These conditions are analogous to the submodularity conditions encountered in max-flow/min-cut optimization, where the objective function is defined as sum of all local costs. We will also consider a refinement of the max-norm measure, defined in terms of the lexicographical order, and examine the algorithms that could find minimal labelings with respect to this refined measure.","authors":["Filip Malmberg","Krzysztof Ciesielski"],"meta":["June 2020Journal of Mathematical Imaging and Vision 62(3)","DOI:10.1007/s10851-020-00963-8"],"references":["339975424_The_Mutex_Watershed_and_its_Objective_Efficient_Parameter-Free_Graph_Partitioning","339558226_Bottleneck_Potentials_in_Markov_Random_Fields","329098614_When_Can_l_p-norm_Objective_Functions_Be_Minimized_via_Graph_Cuts_19th_International_Workshop_IWCIA_2018_Porto_Portugal_November_22-24_2018_Proceedings","322058929_Learned_Watershed_End-to-End_Learning_of_Seeded_Segmentation","321414436_Extending_the_Power_Watershed_Framework_Thanks_to_Gamma-Convergence","306157654_Shortest_Connection_Networks_and_Some_Generalizations","303605804_On_the_shortest_spanning_subtree_of_a_graph_and_the_traveling_salesman_problem","286245681_Strict_Minimizers_For_Geometric_Optimization","257582018_Fuzzy_Connectedness_Image_Segmentation_in_Graph_Cut_Formulation_A_Linear-Time_Algorithm_and_a_Comparative_Analysis","247442902_Introduction_To_Algorithms"]}