{"id":"342288788_USING_THE_PROJECT_METHOD_IN_PROFESSIONAL_TRAINING_OF_FUTURE_LECTURERS_IN_PROFESSIONAL_EDUCATION_OCCUPATIONAL_SAFETY_AND_HEALTH_THROUGH_THE_COURSE_ON_PEDAGOGY_OF_HIGHER_EDUCATION","abstract":"The article analyzes the use of the project method in professional training of future lecturers in professional education (occupational safety and health) through the course on pedagogy of higher education. It presents different approaches to clarifying the essence of the project method, which most scholars define as follows: a method, a type of learning, an educational technology. Based on different views of scholars on the concept of the project method, we consider it as a set of learning and cognitive techniques, which allow students to acquire new knowledge, skills and abilities during independent learning focused on creative self-realization of the individual in the education process and aimed at increasing their professional training in higher education institutions. The article specifies the essence, content and structure of the project method. It is proved the use of the project method in professional training of Master students in comparison with traditional methods has a number of advantages: the learning process is adjusted to practice; students have the opportunity to engage in independent professional activity; students are faced with the need to find and make optimal decisions; students have the opportunity to creatively acquire the necessary information. The article it is the systemic use of the project method in professional training of students, namely in the context of the course on pedagogy of higher education, contributes to developing professional skills and thinking, creative and research skills, problem-solving skills, to develop their core competences (cognitive, communicative, research ones, project), innovation skills and widening social mindset of future lecturers in professional education (015 occupational safety and health).","authors":["Ольга Новак"],"meta":["July 2019","DOI:10.31470/2518-7600-2019-6/2-151-170"],"references":[]}