{"id":"342258231_Gender_Science_and_Academic_Rank_Key_Issues_and_Approaches","abstract":"In the social study of science, gender is a critical research site because relations of gender are hierarchical and inequality is a central feature of science. The focus here is on a key dimension of gender and scientific careers: academic rank, particularly that of full professor. This paper concentrates on quantitative and qualitative approaches that have occurred in two focal problem-areas related to gender, science, and rank: collaboration patterns and evaluative practices. The approaches encompass analyses of large and small groups and comparative cases, with surveys, bibliometrics, experiments, and interviews. This breadth of approaches reflects a search for explanations of the pervasive and persistent relationships between gender and academic rank. The analyses presented here point the complexities of gender disparities in collaboration. These appear in team compositions, divisions of labor and power dynamics, integration into departmental units, and international coauthorship. The analyses also reveal ways that limited clarity in evaluation bears on gender disparities. Continuing understandings of gender, science, and rank will result with multi-level analyses, those at organizational-levels along with those of individual scientists.","authors":["Mary Frank Fox"],"meta":["June 2020Quantitative Science Studies 1(3)","DOI:10.1162/qss_a_00057"],"references":["304613498_Using_the_prisms_of_gender_and_rank_to_interpret_research_collaboration_power_dynamics","303877813_Is_Science_Built_on_the_Shoulders_of_Women_A_Study_of_Gender_Differences_in_Contributorship","292147982_Gender_InEquity_and_the_Scientific_Workforce","283463510_Women_Faculty_in_Computing_A_Key_Case_of_Women_in_Science","282571163_Gendered_patterns_in_international_research_collaborations_in_academia","344486804_How_Economics_Shapes_Science","343122292_Women_in_Global_Science_Advancing_Academic_Careers_through_International_Collaboration","331145027_The_Strength_in_Numbers_The_New_Science_of_Team_Science","298227569_Pathways_Potholes_and_the_Persistence_of_Women_in_Science_Reconsidering_the_Pipeline","277442038_Bridging_the_Quantitative-Qualitative_Divide_in_Political_Science"]}