{"id":"342303491_Structure_and_Empathy_in_Visual_Data_Storytelling_Evaluating_their_Influence_on_Attitude","abstract":"In the visualization community, it is often assumed that visual data storytelling increases memorability and engagement, making it more effective at communicating information. However, many assumptions about the efficacy of storytelling in visualization lack empirical evaluation. Contributing to an emerging body of work, we study whether selected techniques commonly used in visual data storytelling influence people's attitudes towards immigration. We compare (a) personal visual narratives designed to generate empathy; (b) structured visual narratives of aggregates of people; and (c) an exploratory visualization without narrative acting as a control condition. We conducted two crowdsourced between‐subject studies comparing the three conditions, each with 300 participants. To assess the differences in attitudes between conditions, we adopted established scales from the social sciences used in the European Social Survey (ESS). Although we found some differences between conditions, the effects on people's attitudes are smaller than we expected. Our findings suggest that we need to be more careful when it comes to our expectations about the effects visual data storytelling can have on attitudes. Additional material: https://flowstory.github.io/attitudes/.","authors":["Johannes Liem","Charles Perin","Jo Wood"],"meta":["June 2020Computer Graphics Forum 39(3)","DOI:10.1111/cgf.13980"],"references":["325304523_Hooked_on_data_videos_assessing_the_effect_of_animation_and_pictographs_on_viewer_engagement","345857412_Storytelling_with_Data_A_Data_Visualization_Guide_for_Business_Professionals","341695747_Pushing_the_Visual_Narrative_The_Effects_of_Prior_Knowledge_Elicitation_in_Provocative_Topics","334380448_Characterizing_Exploratory_Visual_Analysis_A_Literature_Review_and_Evaluation_of_Analytic_Provenance_in_Tableau","330945381_A_Micro-Phenomenological_Lens_for_Evaluating_Narrative_Visualization","327131658_Design_Exposition_with_Literate_Visualization","324669046_Frames_and_Slants_in_Titles_of_Visualizations_on_Controversial_Topics","318247224_Subjectivity_in_Personal_Storytelling_with_Visualization","318201984_Visual_Narrative_Flow_Exploring_Factors_Shaping_Data_Visualization_Story_Reading_Experiences","318200497_Finding_a_Clear_Path_Structuring_Strategies_for_Visualization_Sequences"]}