{"id":"342316079_Stochastic_Distance_Transform_Theory_Algorithms_and_Applications","abstract":"Distance transforms (DTs) are standard tools in image analysis, with applications in image registration and segmentation. The DT is based on extremal (minimal) distance values and is therefore highly sensitive to noise. We present a stochastic distance transform (SDT) based on discrete random sets, in which a model of element-wise probability is utilized and the SDT is computed as the first moment of the distance distribution to the random set. We present two methods for computing the SDT and analyze them w.r.t. accuracy and complexity. Further, we propose a method, utilizing kernel density estimation, for estimating probability functions and associated random sets to use with the SDT. We evaluate the accuracy of the SDT and the proposed framework on images of thin line structures and disks corrupted by salt and pepper noise and observe excellent performance. We also insert the SDT into a segmentation framework and apply it to overlapping objects, where it provides substantially improved performance over previous methods. Finally, we evaluate the SDT and observe very good performance, on simulated images from localization microscopy, a state-of-the-art super-resolution microscopy technique which yields highly spatially localized but noisy point-clouds.","authors":["Johan Öfverstedt","Joakim Lindblad","Natasa Sladoje"],"meta":["June 2020Journal of Mathematical Imaging and Vision 62(1)","DOI:10.1007/s10851-020-00964-7"],"references":["339008987_SciPy_10_fundamental_algorithms_for_scientific_computing_in_Python","331205510_Fast_and_Robust_Symmetric_Image_Registration_Based_on_Distances_Combining_Intensity_and_Spatial_Information","321511069_Fast_and_stable_multivariate_kernel_density_estimation_by_fast_sum_updating","316252427_TestSTORM_Versatile_simulator_software_for_multimodal_super-resolution_localization_fluorescence_microscopy","339975424_The_Mutex_Watershed_and_its_Objective_Efficient_Parameter-Free_Graph_Partitioning","336246739_Persistent_homology_detects_curvature","331295844_Stochastic_Distance_Transform_21st_IAPR_International_Conference_DGCI_2019_Marne-la-Vallee_France_March_26-28_2019_Proceedings","314185476_Morphological_Analysis_of_Discrete_Random_Shapes","313425098_Distance_transformations_in_digital_images","313009043_Sequential_operations_in_digital_picture_processing"]}