{"id":"342340510_Information_and_Dimensionality_of_Anisotropic_Random_Geometric_Graphs","abstract":"This paper deals with the problem of detecting non-isotropic high-dimensional geometric structure in random graphs. Namely, we study a model of a random geometric graph in which vertices correspond to points generated randomly and independently from a non-isotropic d-dimensional Gaussian distribution, and two vertices are connected if the distance between them is smaller than some pre-specified threshold. We derive new notions of dimensionality which depend upon the eigenvalues of the covariance of the Gaussian distribution. If α denotes the vector of eigenvalues, and n is the number of vertices, then the quantities \\(\\left (\\frac {\\left \\lVert \\alpha \\right \\rVert _2}{\\left \\lVert \\alpha \\right \\rVert _3}\\right )^6/n^3\\) and \\(\\left (\\frac {\\left \\lVert \\alpha \\right \\rVert _2}{\\left \\lVert \\alpha \\right \\rVert _4}\\right )^4/n^3\\) determine upper and lower bounds for the possibility of detection. This generalizes a recent result by Bubeck, Ding, Rácz and the first named author from Bubeck et al. (Random Struct Algoritm 49(3):503–532, 2016) which shows that the quantity d∕n³ determines the boundary of detection for isotropic geometry. Our methods involve Fourier analysis and the theory of characteristic functions to investigate the underlying probabilities of the model. The proof of the lower bound uses information theoretic tools, based on the method presented in Bubeck and Ganguly (Int Math Res Not 2018(2):588–606, 2016).","authors":["Ronen Eldan","Dan Mikulincer"],"meta":["June 2020","DOI:10.1007/978-3-030-36020-7_13","In book: Geometric Aspects of Functional Analysis (pp.273-324)"],"references":["313609388_On_the_evolution_of_random_graphs","281670263_Entropic_CLT_and_phase_transition_in_high-dimensional_Wishart_matrices","268689600_Testing_for_high-dimensional_geometry_in_random_graphs","265894791_Probability_Theory_and_Examples","243101453_A_Lyapunov-type_Bound_in_Rd","230873267_Normal_Approximations_with_Malliavin_Calculus_From_Stein's_Method_to_Universality","227352643_From_Characteristic_Function_to_Distribution_Function_A_Simple_Framework_for_the_Theory","225117911_Banach-Mazur_Distances_and_Projections_on_Random_Subgaussian_Polytopes","47758386_Introduction_to_the_non-asymptotic_analysis_of_random_matrices"]}