{"id":"342332682_Deep_learning_with_noisy_labels_Exploring_techniques_and_remedies_in_medical_image_analysis","abstract":"Supervised training of deep learning models requires large labeled datasets. There is a growing interest in obtaining such datasets for medical image analysis applications. However, the impact of label noise has not received sufficient attention. Recent studies have shown that label noise can significantly impact the performance of deep learning models in many machine learning and computer vision applications. This is especially concerning for medical applications, where datasets are typically small, labeling requires domain expertise and suffers from high inter- and intra-observer variability, and erroneous predictions may influence decisions that directly impact human health. In this paper, we first review the state-of-the-art in handling label noise in deep learning. Then, we review studies that have dealt with label noise in deep learning for medical image analysis. Our review shows that recent progress on handling label noise in deep learning has gone largely unnoticed by the medical image analysis community. To help achieve a better understanding of the extent of the problem and its potential remedies, we conducted experiments with three medical imaging datasets with different types of label noise, where we investigated several existing strategies and developed new methods to combat the negative effect of label noise. Based on the results of these experiments and our review of the literature, we have made recommendations on methods that can be used to alleviate the effects of different types of label noise on deep models trained for medical image analysis. We hope that this article helps the medical image analysis researchers and developers in choosing and devising new techniques that effectively handle label noise in deep learning.","authors":["Davood Karimi","Haoran Dou","Simon K Warfield","Ali Gholipour"],"meta":["June 2020Medical Image Analysis 65(5):101759","DOI:10.1016/j.media.2020.101759"],"references":["340424108_Embracing_Imperfect_Datasets_A_Review_of_Deep_Learning_Solutions_for_Medical_Image_Segmentation","338898059_Deep_learning_in_medical_image_registration_a_survey","338512394_Learning_From_Noisy_Labels_by_Regularized_Estimation_of_Annotator_Confusion","348707515_Interpreting_chest_X-rays_via_CNNs_that_exploit_hierarchical_disease_dependencies_and_uncertainty_labels","341588742_Learning_to_Detect_Brain_Lesions_from_Noisy_Annotations","339926477_The_Open_Images_Dataset_V4_Unified_Image_Classification_Object_Detection_and_Visual_Relationship_Detection_at_Scale","339555187_Deep_Self-Learning_From_Noisy_Labels","338512582_Devil_Is_in_the_Edges_Learning_Semantic_Boundaries_From_Noisy_Annotations","338511902_MetaCleaner_Learning_to_Hallucinate_Clean_Representations_for_Noisy-Labeled_Visual_Recognition","338511848_Unequal-Training_for_Deep_Face_Recognition_With_Long-Tailed_Noisy_Data"]}