{"id":"342385014_Environment-Sensitive_Intelligent_Self-Reproducing_Artificial_Cell_with_a_Modification-Active_Lipo-Deoxyribozyme","abstract":"As a supramolecular micromachine with information flow, a giant vesicle (GV)-based artificial cell that exhibits a linked proliferation between GV reproduction and internal DNA amplification has been explored in this study. The linked proliferation is controlled by a complex consisting of GV membrane-intruded DNA with acidic amphiphilic catalysts, working overall as a lipo-deoxyribozyme. Here, we investigated how a GV-based artificial cell containing this lipo-deoxyribozyme responds to diverse external and internal environments, changing its proliferative dynamics. We observed morphological changes (phenotypic expression) in GVs induced by the addition of membrane precursors with different intervals of addition (starvation periods). First, we focused on a new phenotype, the “multiple tubulated” form, which emerged after a long starvation period. Compared to other forms, the multiple tubulated form is characterized by a larger membrane surface with a heavily cationic charge. A second consideration is the effect of the chain length of encapsulated DNA on competitive proliferation. The competitive proliferation among three different species of artificial cells containing different lengths of DNA was investigated. The results clearly showed a distinct intervention in the proliferation dynamics of the artificial cells with each other. In this sense, our GV-based artificial cell can be regarded as an intelligent supramolecular machine responding to external and internal environments, providing a new concept for developing molecular machines and robotics.","authors":["Muneyuki Matsuo","Yuiko Hirata","Kensuke Kurihara","Taro Toyota"],"meta":["June 2020Micromachines 11(6):606","DOI:10.3390/mi11060606"],"references":["332904148_DNA_Length-dependent_Division_of_a_Giant_Vesicle-based_Model_Protocell","319080332_cGAS_is_activated_by_DNA_in_a_length-dependent_manner","288684111_Sustainable_proliferation_of_liposomes_compatible_with_inner_RNA_replication","282534844_A_recursive_vesicle-based_model_protocell_with_a_primitive_model_cell_cycle","340462700_Biomimicry_of_Cellular_Motility_and_Communication_Based_on_Synthetic_Soft-Architectures","320986440_Photo-triggered_Recognition_between_Host_and_Guest_Compounds_in_a_Giant_Vesicle_Encapsulating_Photo-Pierceable_Vesicles","312923585_Phototactic_Behavior_of_Self-Propelled_Micrometer-Sized_Oil_droplets_in_a_Surfactant_Solution","309189321_Programmable_artificial_phototactic_microswimmer","301897439_Phototaxis_of_Oil_Droplets_Comprising_a_Caged_Fatty_Acid_Tightly_Linked_to_Internal_Convection","274502243_pH-Induced_Switchable_Vesicular_Aggregation_of_Zwitterionic_and_Anionic_Phospholipids"]}