{"id":"342386916_Multirobot_path_planning_based_on_a_deep_reinforcement_learning_DQN_algorithm","abstract":"The unmanned warehouse dispatching system of the ‘goods to people’ model uses a structure mainly based on a handling robot, which saves considerable manpower and improves the efficiency of the warehouse picking operation. However, the optimal performance of the scheduling system algorithm has high requirements. This study uses a deep Q-network (DQN) algorithm in a deep reinforcement learning algorithm, which combines the Q-learning algorithm, an empirical playback mechanism, and the volume-based technology of productive neural networks to generate target Q-values to solve the problem of multi-robot path planning. The aim of the Q-learning algorithm in deep reinforcement learning is to address two shortcomings of the robot path-planning problem: slow convergence and excessive randomness. Preceding the start of the algorithmic process, prior knowledge and prior rules are used to improve the DQN algorithm. Simulation results show that the improved DQN algorithm converges faster than the classic deep reinforcement learning algorithm and can more quickly learn the solutions to path-planning problems. This improves the efficiency of multi-robot path planning.","authors":["yang yang","Juntao Li","Lingling Peng"],"meta":["June 2020CAAI Transactions on Intelligence Technology 5(3)","DOI:10.1049/trit.2020.0024"],"references":["327526787_Cooperative_path_planning_in_multi-robots_for_intelligent_warehouse","320135803_Review_of_Convolutional_Neural_Network","318835663_Mobile_Robot_Path_Planning_Based_on_an_Improved_A_Algorithm","317749895_Ant_colony_algorithm_based_on_dynamic_search_strategy_and_its_application_on_path_planning_of_robot","306116731_Improved_dynamic_double_mutation_particle_swarm_optimization_for_mobile_robot_path_planning","290547268_Path_planning_of_robot_for_unknown_environment_based_on_prior_knowledge_rolling_Q-learning","287675604_Global_path_planning_for_mobile_robot_based_on_improved_particle_swarm_optimization","287295166_A_review_of_developments_in_reinforcement_learning_for_multi-robot_systems","286751954_Heuristically_accelerated_state_backtracking_Q-learning_based_on_cost_analysis","261468373_Global_path_planning_for_mobile_robot_based_on_A_algorithm_and_genetic_algorithm"]}