{"id":"342390228_Supporting_Disaster_Resilience_Spatial_Thinking_with_Serious_GeoGames_Project_Lily_Pad","abstract":"The need for improvement of societal disaster resilience and response efforts was evident after the destruction caused by the 2017 Atlantic hurricane season. We present a novel conceptual framework for improving disaster resilience through the combination of serious games, geographic information systems (GIS), spatial thinking, and disaster resilience. Our framework is implemented via Project Lily Pad, a serious geogame based on our conceptual framework, serious game case studies, interviews and real-life experiences from 2017 Hurricane Harvey survivors in Dickinson, TX, and an immersive hurricane-induced flooding scenario. The game teaches a four-fold set of skills relevant to spatial thinking and disaster resilience, including reading a map, navigating an environment, coding verbal instructions, and determining best practices in a disaster situation. Results of evaluation of the four skills via Project Lily Pad through a “think aloud” study conducted by both emergency management novices and professionals revealed that the game encouraged players to think spatially, can help build awareness for disaster response scenarios, and has potential for real-life use by emergency management professionals. It can be concluded from our results that the combination of serious games, geographic information systems (GIS), spatial thinking, and disaster resilience, as implemented via Project Lily Pad and our evaluation results, demonstrated the wide range of possibilities for using serious geogames to improve disaster resilience spatial thinking and potentially save lives when disasters occur.","authors":["Brian Tomaszewski","Amy Walker","Emily Gawlik","Casey Lane"],"meta":["June 2020International Journal of Geo-Information 9(6):405","DOI:10.3390/ijgi9060405"],"references":["332910472_The_Use_of_Simulation_Games_and_Tabletop_Exercises_in_Disaster_Preparedness_Training_of_Emergency_Medicine_Residents","327720869_'Hazagora_Will_you_survive_the_next_geohazards'_-_Lessons_learned_from_the_development_adaptation_and_outcomes_of_a_serious_game_on_volcanic_risk_reduction","327521199_An_overview_of_serious_games_for_disaster_risk_management_-_Prospects_and_limitations_for_informing_actions_to_arrest_increasing_risk","323331198_Integrated_Participatory_and_Collaborative_Risk_Mapping_for_Enhancing_Disaster_Resilience","321036560_Defining_a_Geogame_Genre_Using_Core_Concepts_of_Games_Play_and_Geographic_Information_and_Thinking","312378111_OriGami_-_A_Mobile_Geogame_for_Spatial_Literacy","331274313_Geographic_Information_Systems_GIS_for_Disaster_Management","321036649_Spatial_Game_for_Negotiations_and_Consensus_Building_in_Urban_Planning_YouPlaceIt","321036559_Introducing_Geogames_and_Geoplay_Characterizing_an_Emerging_Research_Field","316578893_GIS_and_Serious_Games"]}