{"id":"342301455_3DBunch_A_Novel_iOS-Smartphone_Application_to_Evaluate_the_Number_of_Grape_Berries_per_Bunch_Using_Image_Analysis_Techniques","abstract":"Evaluating the number of berries per bunch is a vital step of grape yield estimation in viticulture but is a labour intensive task for traditional manual measurement. Therefore, this paper develops a novel smartphone application for counting berries automatically from a single image. The application, called 3DBunch, acquires images from the camera or the album on a smartphone, and then estimates the number of berries by a reconstructed 3D bunch model based on the proposed image analysis techniques that are embedded in the developed iOS app. It also presents features of visualising the statistics of the reconstructed bunch, which including of the distribution of detected berry size in pixels and the total number of berries. It also has the capability of presenting sampling related information, which includes the person who conducted the sampling, the location of samples, the dates of sampling, the variety, farm, vineyards etc. The application was evaluated both on a simulator in a commercial computer and an iPad mini 4. By analysing 291 bunch images from two varieties the app achieved an accuracy of 91% regarding berry counting per bunch. Additionally, the computational time consumed to process 100 images on iPad mini 4 was studied and returned an average of 7.51 seconds per image. Getting these results with only a smartphone and a small backing board for capturing a photo with a single bunch, 3DBunch provides an efficient way for farmers to count berries in-vivo and it is available on iOS App Store now.","authors":["Scarlett Liu","Xiangdong Zeng","Mark Whitty"],"meta":["June 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3003415"],"references":["332844662_Detection_of_Single_Grapevine_Berries_in_Images_Using_Fully_Convolutional_Neural_Networks","328440846_Computer_Vision_and_Machine_Learning_for_Viticulture_Technology","324164204_A_smartphone-based_apple_yield_estimation_application_using_imaging_features_and_the_ANN_method_in_mature_period","340715741_A_vision-based_robust_grape_berry_counting_algorithm_for_fast_calibration-free_bunch_weight_estimation_in_the_field","339557189_An_Improved_Agriculture_Monitoring_System_Using_Agri-App_for_Better_Crop_Production","337971825_'Mentha_Mitra'-An_android_app_based_advisory_digital_tool_for_menthol_mint_farmers","330708691_An_Android_App_for_detecting_damage_on_tobacco_Nicotiana_tabacum_L_leaves_caused_by_blue_mold_Penospora_tabacina_Adam","327690161_An_operational_workflow_to_assess_rice_nutritional_status_based_on_satellite_imagery_and_smartphone_apps","327613273_Development_and_design_of_mobile_terminal_APP_for_greenhouse_environment_control","326745990_A_robust_automated_flower_estimation_system_for_grape_vines"]}