{"id":"342329755_The_International_Journal_of_Technology_Information_and_Computer_Persuasive_Metamorphosis_of_Manufacturing_Overhead_at_The_Golden_Doors_of_Disparaging_Uttermost_Cost_of_Goods","abstract":"Factory overhead; Absorption; Production unit; Fixed cost; Calculated period; Manufacturing overhead is applied to the units produced within a reporting period. This is not a direct cost of a product. As like as labour cost, product cost, manufacturing overhead has to enlisted with the system so that we can get good output from inventory management. In every sector of business, there is a big illusion of absorption with the sight of over absorbed and under absorbed product costs. The absorption is under the Generally accepted accounting principals (GAAP), where the absorption cost can be applied and count too. Manufacturing overhead is not a danger, but it's a problem for us in many purposes of business. This paper is going to give a suitable solution to this problem with the tools of business and technology. This paper will also create a connection between business and technology again by which we will see the impact of technology in business. We are going to see that the actual cost using FIFO, LIFO, etc. This paper aims to show something new by which the business sector can get the best solution for this manufacturing overhead matter. In case, we all know that many things are related to this matter. Such as factory burden, production overhead, factory overhead, etc. We will role these things with the sight of business and computer science.","authors":["Tarun Danti Dey","Sritha Zith Dey Babu","Digvijay Pandey","Ismail Sheik"],"meta":["June 2020","DOI:10.5281/zenodo.3873374","Project: Business drawbacks with solutions"],"references":["326715681_Skylar_Inc_Traditional_Cost_System_vs_Activity-Based_Cost_System_-_A_Managerial_Accounting_Case_Study","319417036_A_review_of_energy_simulation_tools_for_the_manufacturing_sector","314385360_Cost_Management_Practices_and_Firm's_Performance_of_Manufacturing_Organizations","305279255_Cost_Modeling_and_Optimization_of_a_Manufacturing_System_for_Mycelium-based_Biocomposite_Parts","323638651_Transportation_infrastructure_investment_and_the_location_of_new_manufacturing_around_South_Korea's_West_Coast_Expressway","322087822_Characterisation_of_activity_based_costing_on_remanufacturing_crankshaft","271952438_Shop-floor_resource_virtualization_layer_with_private_cloud_support","251596477_The_causes_of_misapplied_capacity_related_manufacturing_costs_and_corresponding_reporting_implications_A_conceptual_perspective"]}