{"id":"342389185_An_Efficient_Algorithm_for_2-Dimensional_Pattern_Matching_Problem","abstract":"Pattern matching is the area of computer science which deals with security and analysis of data. This work proposes two 2D pattern matching algorithms based on two different input domains. The first algorithm is for the case when the given pattern contains only two symbols, that is, binary symbols 0 and 1. The second algorithm is in the case when the given pattern contains decimal numbers, that is, the collection of symbols between 0 and 9. The algorithms proposed in this manuscript convert the given pattern into an equivalent binary or decimal number, correspondingly find the cofactors of the same dimension and convert these cofactors into numbers if a particular cofactor number matches indicate the matching of the pattern. Furthermore, the algorithm is enhanced for decimal numbers. In the case of decimal numbers, each row of the pattern is changed to its decimal equivalent, and then, modulo with a suitable prime number changes the decimal equivalent into a number less than the prime number. If the number mismatched pattern does not exist, the complexity of the proposed algorithm is very low as compared to other traditional algorithms.","authors":["Sushil Chandra Dimri","Umesh Tiwari","Mangey Ram"],"meta":["June 2020Journal of Konbin 50(2):295-313","DOI:10.2478/jok-2020-0041"],"references":["308385814_Dynamic_and_Approximate_Pattern_Matching_in_2D","221591625_Rapid_Identification_of_Repeated_Patterns_in_Strings_Trees_and_Arrays","338636379_Fast_Indexes_for_Gapped_Pattern_Matching","335551146_Matching_Patterns_with_Variables","334826004_Circular_Pattern_Matching_with_k_Mismatches","334268653_Two-dimensional_maximal_repetitions","256181580_Two_dimensional_pattern_matching","243763098_Rapid_identification_of_repeated_patterns_in_strings","224103840_Efficient_randomized_pattern-matching_algorithms","222637032_Two-dimensional_Pattern_Matching_with_Rotations","220618247_Fast_Pattern_Matching_in_Strings","220617617_A_Technique_for_Extending_Rapid_Exact-Match_String_Matching_to_Arrays_of_More_Than_One_Dimension","220616603_The_Boyer-Moore-Galil_String_Searching_Strategies_Revisited"]}