{"id":"342321911_An_Extension_of_Fuzzy_Competition_Graph_and_Its_Uses_in_Manufacturing_Industries","abstract":"Competition graph is a graph which constitutes from a directed graph (digraph) with an edge between two vertices if they have some common preys in the digraph. Moreover, Fuzzy competition graph (briefly, FCG) is the higher extension of the crisp competition graph by assigning fuzzy value to each vertex and edge. Also, Interval-valued FCG (briefly, IVFCG) is another higher extension of fuzzy competition graph by taking each fuzzy value as a sub-interval of the interval [ 0 , 1 ] . This graph arises in many real world systems; one of them is discussed as follows: Each and every species in nature basically needs ecological balance to survive. The existing species depends on one another for food. If there happens any extinction of any species, there must be a crisis of food among those species which depend on that extinct species. The height of food crisis among those species varies according to their ecological status, environment and encompassing atmosphere. So, the prey to prey relationship among the species cannot be assessed exactly. Therefore, the assessment of competition of species is vague or shadowy. Motivated from this idea, in this paper IVFCG is introduced and several properties of IVFCG and its two variants interval-valued fuzzy k-competition graphs (briefly, IVFKCG) and interval-valued fuzzy m-step competition graphs (briefly, IVFMCG) are presented. The work is helpful to assess the strength of competition among competitors in the field of competitive network system. Furthermore, homomorphic and isomorphic properties of IVFCG are also discussed. Finally, an appropriate application of IVFCG in the competition among the production companies in market is presented to highlight the relevance of IVFCG.","authors":["Tarasankar Pramanik","G. Muhiuddin","Abdulaziz M. Alanazi","Madhumangal Pal"],"meta":["June 2020","DOI:10.3390/math8061008","Project: A Study on Fuzzy Graphs"],"references":["339759653_Interval_type-2_fuzzy_sets_based_multi-criteria_decision-making_model_for_offshore_wind_farm_development_in_Ireland","324530842_An_Integration_Model_for_Car_Sharing_and_Public_Transport_Case_of_Istanbul","312468225_Concept_of_fuzzy_planar_graphs","310435478_Interval-valued_fuzzy_phi_ph_-tolerance_competition_graphs","301851029_Irregular_Bipolar_Fuzzy_Graphs","341804129_Evaluation_of_service_quality_in_public_bus_transportation_using_interval-_valued_intuitionistic_fuzzy_QFD_methodology","325719350_A_survey_of_the_literature_on_airline_crew_scheduling","323277316_Surrogate_model_based_optimization_of_traffic_lights_cycles_and_green_period_ratios_using_microscopic_simulation_and_fuzzy_rule_interpolation","319024896_Tensor_product-based_model_transformation_for_position_control_of_magnetic_levitation_systems","291350324_Fuzzy_phi-tolerance_competition_graphs"]}