{"id":"342345202_DDoSNet_A_Deep-Learning_Model_for_Detecting_Network_Attacks","abstract":"Software-Defined Networking (SDN) is an emerging paradigm, which evolved in recent years to address the weaknesses in traditional networks. The significant feature of the SDN, which is achieved by disassociating the control plane from the data plane, facilitates network management and allows the network to be efficiently programmable. However, the new architecture can be susceptible to several attacks that lead to resource exhaustion and prevent the SDN controller from supporting legitimate users. One of these attacks, which nowadays is growing significantly, is the Distributed Denial of Service (DDoS) attack. DDoS attack has a high impact on crashing the network resources, making the target servers unable to support the valid users. The current methods deploy Machine Learning (ML) for intrusion detection against DDoS attacks in the SDN network using the standard datasets. However, these methods suffer several drawbacks, and the used datasets do not contain the most recent attack patterns-hence, lacking in attack diversity. In this paper, we propose DDoSNet, an intrusion detection system against DDoS attacks in SDN environments. Our method is based on Deep Learning (DL) technique, combining the Recurrent Neural Network (RNN) with autoencoder. We evaluate our model using the newly released dataset CICDDoS2019, which contains a comprehensive variety of DDoS attacks and addresses the gaps of the existing current datasets. We obtain a significant improvement in attack detection, as compared to other benchmarking methods. Hence, our model provides great confidence in securing these networks.","authors":["Mahmoud Said Elsayed","Nhien-An Le-Khac","Soumyabrata Dev","Anca D Jurcut"],"meta":["June 2020","DOI:10.1109/WoWMoM49955.2020.00072","Conference: 21ST IEEE INTERNATIONAL SYMPOSIUM ON A WORLD OF WIRELESS, MOBILE AND MULTIMEDIA NETWORKS (IEEE WOWMOM 2020), CCNCPS2020 Workshop","Project: machine learning SDN"],"references":["336953914_Developing_Realistic_Distributed_Denial_of_Service_DDoS_Attack_Dataset_and_Taxonomy","331797923_CyberPulse_A_Machine_Learning_based_Link_Flooding_Attack_Mitigation_System_for_Software_Defined_Networks","330786771_Lstm_And_Simple_Rnn_Comparison_In_The_Problem_Of_Sequence_To_Sequence_On_Conversation_Data_Using_Bahasa_Indonesia","335499887_DDoS_Attacks_Detection_and_Mitigation_in_SDN_Using_Machine_Learning","334703295_Detection_of_DDoS_Attacks_in_Software_Defined_Networks","333781991_Machine_learning_algorithms_to_detect_DDoS_attacks_in_SDN","333705961_A_Survey_of_Network-based_Intrusion_Detection_Data_Sets","330953935_DDoS_Attack_Identification_and_Defense_Using_SDN_Based_on_Machine_Learning_Method","330580931_A_Machine_Learning_Approach_for_Detecting_DoS_Attacks_in_SDN_Switches","329956656_A_New_Machine_Learning-based_Collaborative_DDoS_Mitigation_Mechanism_in_Software-Defined_Network"]}