{"id":"342321372_A_Product_Quality_Monitor_Model_With_the_Digital_Twin_Model_and_the_Stacked_Auto_Encoder","abstract":"With the development of intelligent manufacturing and computer science, the system of equipment in the workshop has become more and more complex. In the intricate environment, the state of device changes constantly, which could affect the accuracy of methods since they cannot adapt the changing context. Recently, Digital Twin (DT) has received great focus among academic world and industrial world, which provides a new normal form for solving problems. In this paper, the structure of DT is discussed and a DT and Stacked Auto Encoder (SAE) Based Model is proposed to monitor the product quality. Based on the classical structure of DT, the digital model of DT is further divided into two parts, a task-achieved part and a self-update part. The former that comprises an encoder network that is a part of SAE and an Artificial Neural Network (ANN)-based classifier could check whether products are qualified. And a decoder network, another part of SAE, and a parameters-update rule make up the self-update part that could detect the accuracy of the task-achieved part and retrain the neural networks as the accuracy is poor. Furthermore, a new loss function is put forward as a training criterion in order to magnify the tiny difference between input data and result. In order to emulate the changing environment, the experimental data are collected at two different points in time. The data are then input to the proposed model and two other traditional methods to test the ability of accuracy and the adaptability for changing context. The comparisons show that the proposed method has got improvements, especially in where the effect of working environment is significant.","authors":["Shizheng Zhang","Cunfeng Kang","Zhifeng Liu","Juan Wu"],"meta":["June 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3003723"],"references":["335191261_Digital_Twin_for_Monitoring_of_Industrial_Multi-Effect_Evaporation","333382517_Digital_Twins_and_Cyber-Physical_Systems_toward_Smart_Manufacturing_and_Industry_40_Correlation_and_Comparison","332966053_A_digital_twin-based_approach_for_dynamic_clamping_and_positioning_of_the_flexible_tooling_system","332847928_Hidden_Markov_model-based_digital_twin_construction_for_futuristic_manufacturing_systems","334993142_Research_on_the_Virtual_Reality_Synchronization_of_Workshop_Digital_Twin","333406676_Analytical_modeling_of_tool_health_monitoring_system_using_multiple_sensor_data_fusion_approach_in_hard_machining","333352236_Design_teacher_and_supervised_dual_stacked_auto-encoders_for_quality-relevant_fault_detection_in_industrial_process","333076941_Monitoring_of_Friction_Stir_Welding_based_on_Vision_System_coupled_with_Machine_Learning_Algorithm","332388781_Machine_vision_intelligence_for_product_defect_inspection_based_on_deep_learning_and_Hough_transform","332246510_Image_Analysis-based_Closed_Loop_Quality_Control_for_Additive_Manufacturing_with_Fused_Filament_Fabrication"]}