{"id":"342420588_Patterns_of_fiber_intake_among_Brazilian_adults_perceptions_from_an_online_nationwide_survey","abstract":"ABSTRACT\n\nBACKGROUND:\n\nAdequate fiber intake is associated with digestive health and reduced risk of several noncommunicable diseases and is recognized as essential for human health (World Health Organization, 2003). The World Health Organization (WHO) recommends a daily fiber consumption of ≥25 g, but previous studies observed a fiber intake in Brazil lower than recommended.\n\nOBJECTIVE:\n\nWe aimed to describe fiber intake among adults in Brazil and also respondents’ knowledge and perceptions about their fiber intake.\n\nMETHODS:\n\nNational online survey with community-dwelling Brazilian individuals. The survey was conducted during September 2018, using an online platform with closed-ended questions. A representative sample of Brazilian internet users stratified by sex, age, socioeconomic status and geographic region was adopted. Sample size was calculated using a 2% error margin and 95% confidence interval (n=2,000). Data was descriptively analyzed using measures of frequency, central tendency and dispersion.\n\nRESULTS:\n\nSample included 2,000 individuals who were well-balanced in terms of sex (51.2% female), with mean age of 35.9 years (most represented age group was 35-54 years, 39.6%) and from all country geographic regions (49.4% from Southeast). A total of 69.7% of them consider their usual diet as healthy and 78.4% reported consuming fibers regularly. Fibers from natural sources are consumed at least once a day by 69.5% of the sample, while daily fiber supplements were reported by 29.9%. Absence of regular fiber intake was reported by 21.7% of respondents and the most common reason was “lack of knowledge about fiber sources” (39.3%). When informed about the food sources of each type of fiber (soluble and insoluble) and asked about the regular intake, only 2.5% answered that they do not consume any of them regularly (as opposed to 21.7% before receiving information about specific fiber sources).\n\nCONCLUSION:\n\nOur findings indicate that fiber intake in Brazil is probably insufficient with a high proportion of individuals reporting irregular or absent ingestion of fiber sources in their daily lives. Lack of knowledge about fiber sources and fiber types seems to play a role in this inadequate intake, highlighting the need for nutritional education to achieve healthy dietary patterns in the country.\n\nHEADINGS: Dietary fiber; Diet surveys; Socioeconomic factors; Health knowledge, attitudes, practice","authors":["Maria do Carmo Friche Passos","Maira Libertad Soligo Takemoto","Luciana Schuck Guedes"],"meta":["June 2020Arquivos de Gastroenterologia xx(AHEAD):Ahead of print","DOI:10.1590/S0004-2803.202000000-26"],"references":["327471336_Dietary_fiber_intake_and_risks_of_proximal_and_distal_colon_cancers_A_meta-analysis","326574364_Dietary_Fiber_Intake_and_Endometrial_Cancer_Risk_A_Systematic_Review_and_Meta-Analysis","325758495_The_Benefits_of_Dietary_Fiber_Intake_on_Reducing_the_Risk_of_Cancer_An_Umbrella_Review_of_Meta-analyses","323501137_Dietary_Fiber_Intake_and_Type_2_Diabetes_Mellitus_An_Umbrella_Review_of_Meta-analyses","322072756_Dietary_Fiber_and_Metabolic_Syndrome_A_Meta-Analysis_and_Review_of_Related_Mechanisms","321115963_Does_Perception_of_Dietary_Fiber_Mediate_the_Impact_of_Nutrition_Knowledge_on_Eating_Fiber-Rich_Bread","333085270_Lower_dietary_fibre_intake_but_not_total_water_consumption_is_associated_with_constipation_a_population-based_analysis","306151126_A_reviewof_gastrointestinal_physiology_and_the_mechanisms_underlying_the_health_benefits_of_dietary_fiber_Matching_an_effective_fiber_with_specific_patient_needs","303569622_Dietary_fiber_intake_and_risk_of_first_stroke_A_systematic_review_and_meta-analysis","288021558_Family_income_per_capita_age_and_smoking_status_are_predictors_of_low_fiber_intake_in_residents_of_Sao_Paulo_-_Brazil"]}