{"id":"342441483_Quantum_Approximate_Optimization_Algorithm_Performance_Mechanism_and_Implementation_on_Near-Term_Devices","abstract":"The quantum approximate optimization algorithm (QAOA) is a hybrid quantum-classical variational algorithm designed to tackle combinatorial optimization problems. Despite its promise for near-term quantum applications, not much is currently understood about the QAOA’s performance beyond its lowest-depth variant. An essential but missing ingredient for understanding and deploying the QAOA is a constructive approach to carry out the outer-loop classical optimization. We provide an in-depth study of the performance of the QAOA on MaxCut problems by developing an efficient parameter-optimization procedure and revealing its ability to exploit nonadiabatic operations. Building on observed patterns in optimal parameters, we propose heuristic strategies for initializing optimizations to find quasioptimal p-level QAOA parameters in O[poly(p)] time, whereas the standard strategy of random initialization requires 2O(p) optimization runs to achieve similar performance. We then benchmark the QAOA and compare it with quantum annealing, especially on difficult instances where adiabatic quantum annealing fails due to small spectral gaps. The comparison reveals that the QAOA can learn via optimization to utilize nonadiabatic mechanisms to circumvent the challenges associated with vanishing spectral gaps. Finally, we provide a realistic resource analysis on the experimental implementation of the QAOA. When quantum fluctuations in measurements are accounted for, we illustrate that optimization is important only for problem sizes beyond numerical simulations but accessible on near-term devices. We propose a feasible implementation of large MaxCut problems with a few hundred vertices in a system of 2D neutral atoms, reaching the regime to challenge the best classical algorithms.","authors":["Leo Zhou","Sheng-Tao Wang","Soonwon Choi","Hannes Pichler"],"meta":["June 2020Physical Review X 10(2)","DOI:10.1103/PhysRevX.10.021067"],"references":["333364801_Experimental_investigation_of_performance_differences_between_coherent_Ising_machines_and_a_quantum_annealer","333120262_Self-verifying_variational_quantum_simulation_of_lattice_models","332132625_Quantum_Kibble-Zurek_mechanism_and_critical_dynamics_on_a_programmable_Rydberg_simulator","331576340_Efficient_variational_simulation_of_non-trivial_quantum_states","327921062_Reinforcement_Learning_in_Different_Phases_of_Quantum_Control","327447371_Sorting_ultracold_atoms_in_a_three-dimensional_optical_lattice_in_a_realization_of_Maxwell's_demon","327119007_Large-scale_silicon_quantum_photonics_implementing_arbitrary_two-qubit_processing","324104887_Barren_plateaus_in_quantum_neural_network_training_landscapes","323510527_Efficient_unitary_preparation_of_non-trivial_quantum_states","327783547_High-Fidelity_Control_and_Entanglement_of_Rydberg-Atom_Qubits"]}