{"id":"342408040_Opportunities_in_Intelligent_Modeling_Assistance","abstract":"Modeling is requiring increasingly larger efforts while becoming indispensable given the complexity of the problems we are solving. Modelers face high cognitive load to understand a multitude of complex abstractions and their relationships. There is an urgent need to better support tool builders to ultimately provide modelers with intelligent modeling assistance that learns from previous modeling experiences, automatically derives modeling knowledge, and provides context-aware assistance. However, current Intelligent Modeling Assistants (IMAs) lack adaptability and exibility for tool builders, and do not facilitate under-\nstanding the differences and commonalities of IMAs for modelers. Such a patchwork of limited IMAs is a lost opportunity to provide modelers with better support for the creative and rigorous aspects of software engineering. In this expert voice, we present a conceptual reference framework (RF-IMA) and its properties to identify the foundations for intelligent modeling assistance. For tool builders, RF-IMA aims to help build IMAs more systematically. For modelers, RF-IMA aims to fa-\ncilitate comprehension, comparison, and integration of IMAs, and ultimately to provide more intelligent support. We envision a momentum in the modeling community that leads to the implementation of RF-IMA\nand consequently future IMAs. We identify open challenges that need to be addressed to realize the opportunities provided by intelligent modeling assistance.","authors":["Gunter Mussbacher","Benoit Combemale","Jörg Kienzle","Silvia Abrahão"],"meta":["September 2020Software and Systems Modeling","DOI:10.1007/s10270-020-00814-5"],"references":["341737316_Towards_Automating_the_Synthesis_of_Chatbots_for_Conversational_Model_Query","341419482_A_Hitchhiker's_Guide_to_Model-Driven_Engineering_for_Data-Centric_Systems","339464993_Toward_Model-Driven_Sustainability_Evaluation","338431189_Grand_challenges_in_model-driven_engineering_an_analysis_of_the_state_of_the_research","335499822_Recommending_Comprehensive_Solutions_for_Programming_Tasks_by_Mining_Crowd_Knowledge","337519024_An_LSTM-Based_Neural_Network_Architecture_for_Model_Transformations","337141421_On_the_Need_for_Data-Based_Model-Driven_Engineering","334757423_Why_you_shouldn't_build_your_own_game_engine","334712556_Pythia_AI-assisted_Code_Completion_System","334366880_A_Digital_Twin-Based_Multi-modal_UI_Adaptation_Framework_for_Assistance_Systems_in_Industry_40"]}