{"id":"342411649_La_investigacion_sobre_curacion_de_contenidos_analisis_de_la_produccion_academica","abstract":"En este artículo se pretende analizar la producción científica sobre curación de contenidos, estudiando su evolución temporal, aspectos de autoría como las co-laboraciones entre autores y sus filiaciones, las revis-tas y congresos más relevantes así como las temáticas más tratadas. Entre los resultados, se puede destacar la multidisciplinariedad de los estudios sobre curación de contenidos, ya que encontramos ejemplos realiza-dos desde el periodismo a la ingeniería e informática, o desde la educación a la documentación, una distri-bución de autorías y filiaciones en muchos investiga-dores y centros, así como una fuerte vinculación temá-tica con los medios sociales, que son los canales más utilizados para su difusión. Palabras clave: Curación de contenidos. Producción académica. Bibliometría. Autoría. Revistas científicas. Temas de investigación. Análisis de palabras clave. \nAbstract This article aims to analyze the scientific production on content curation, studying its temporal evolution, aspects of authorship such as collaborations between authors and their affiliations, the most relevant journals and congresses as well as the most discussed topics. Among the results, we can highlight the multidiscipli-narity of studies on content curation, since we find examples from journalism to engineering and computer science or from education to library and information science, a distribution of authorships and affiliations in many researchers and centers, as well as a strong thematic link with the social media, which are the most used channels for its dissemination.","authors":["Javier Guallar","Lluís Codina","Ernest Abadal"],"meta":["June 2020Ibersid 14(1):13-22","DOI:10.54886/ibersid.v14i1.4653","Projects: Curación de contenidosNarración interactiva y visibilidad digital en el documental interactivo y el periodismo estructurado"],"references":["346474609_Curacion_de_contenidos_desde_bibliotecas_competencias_herramientas_y_aplicaciones","324730789_Research_Patterns_and_Trends_on_Open_Educational_Practices_An_Exploratory_Literature_Review","320944147_Las_posibilidades_educativas_de_la_curacion_de_contenidos_Una_revision_de_literatura","320882912_Advances_in_Social_Media_Research_Past_Present_and_Future","265928094_Bibliometrics_and_Research_Data_Management_Services_Emerging_Trends_in_Library_Support_for_Research"]}