{"id":"342419152_An_Empirical_Study_on_Sales_Performance_Effect_and_Pricing_Strategy_for_E-Commerce_From_the_Perspective_of_Mobile_Information","abstract":"The emergence of Internet product sales platform has not only greatly enriched consumers’ choices and facilitated their purchasing behavior but also provided space for counterfeit products and relevant fraudulent signal strategies in China, which damage the consumer’s rights and interests and further disrupt the normal order of the e-commerce market. However, effective empirical study on the long-term and dynamic influence mechanism of fraudulent signals of counterfeit products and the seller incentive mechanism is still unavailable in academic circles, especially in the Chinese market, where government regulation is deemed to be lacking. For the purpose of this paper, an empirical study has been conducted by virtue of Internet e-commerce platform data based on data capture technology to analyze the dynamic performance effect mechanism of e-commerce fraudulent signals of counterfeit products under multiple game conditions. The study results show that selling of counterfeit products by using fraudulent signals can improve the current sales performance, but it will cause a long-term performance decline consequently. Additionally, from the perspective of the pricing mechanism, this paper analyzes the said seller incentive mechanism of counterfeit products. Finally, this paper puts forward relevant management suggestions based on the empirical study findings.","authors":["Chia-Huei Wu","Zichun Yan","Sang-Bing Tsai","Weinan Wang"],"meta":["June 2020Mobile Information Systems 2020(1):1-8","DOI:10.1155/2020/7561807"],"references":["326772184_Web_Service_Usability_Analysis_Based_on_User_Preferences","326190755_Crossed_Wires_Endorsement_Signals_and_the_Effects_of_IPO_Firm_Delistings_on_Venture_Capitalists'_Reputations","326171876_CROSSED_WIRES_ENDORSEMENT_SIGNALS_AND_THE_EFFECTS_OF_IPO_FIRM_DELISTINGS_ON_VENTURE_CAPITALISTS'_REPUTATIONS","332120789_Measuring_E-Learners'_Perceptions_of_Service_Quality","330050960_Exploring_Signaling_Roles_of_Service_Providers'_Reputation_and_Competence_in_Influencing_Perceptions_of_Service_Quality_and_Outsourcing_Intentions","326101870_Impact_of_Information_Technology_on_Information_Search_Channel_Selection_for_Consumers","316743181_Return_Time_Leniency_in_Online_Retail_A_Signaling_Theory_Perspective_on_Buying_Outcomes_Return_Time_Leniency_in_Online_Retail","313302179_Job_Market_Signaling","303800598_Early-mover_advantages_at_cross-border_business-to-business_e-commerce_portals","302976906_The_Role_of_External_and_Internal_Signals_in_E-Commerce"]}