{"id":"342451825_The_Knowledge_Domain_of_The_Baltic_Journal_of_Road_and_Bridge_Engineering_Between_2006_and_2019","abstract":"The Baltic Journal of Road and Bridge Engineering is a multidisciplinary journal, which provides a forum for a broad range of road and bridge engineering research. The topics such as the road and bridge research and design, the construction materials and technologies of roads and bridges, the construction financing and environmental issues, and the assessment management are included in the scope of the Baltic Journal of Road and Bridge Engineering investigation. Due to the reason that various road and bridge engineering related research directions are involved in this journal, it has become the first one that deals with the issues as mentioned above in Baltic countries. Therefore, it is believed that investigating the publications in the Baltic Journal of Road and Bridge Engineering assists researchers in great learning the development of road and bridge engineering research in Baltic countries. By analysing the annual publication distribution, the citation structure, the co-citation and cooperation networks, and the significant contributors in terms of countries and regions, institutions, cited journals and authors, the status of Baltic Journal of Road and Bridge Engineering is comprehensively presented. In addition, the emerging trends are revealed through the analyses of timeline view and burst detection. This study makes the contribution to the aspect of visualizing the complex and significant results based on objective and quantitative data. It provides readers with access to understand the development of Baltic Journal of Road and Bridge Engineering and helps researchers learn the hot issues in this journal clearly and directly.","authors":["Wei Zhou","Zeshui Xu","Edmundas Kazimieras Zavadskas"],"meta":["June 2020The Baltic Journal of Road and Bridge Engineering 15(2):1-30","DOI:10.7250/bjrbe.2020-15.470"],"references":["332685205_The_evolution_of_Technological_and_Economic_Development_of_Economy_a_bibliometric_analysis","329293911_A_bibliometric_analysis_of_Fuzzy_Optimization_and_Decision_Making_2002-2017","328623112_Bibliometrical_analysis_of_Asia_Pacific_Journal_of_Tourism_Research","327349448_Bibliometric_analysis_on_the_evolution_of_applied_intelligence","323966983_Bibliometric_analysis_of_peer-reviewed_literature_in_transgender_health_1900_-_2017","322233404_Bibliometric_and_Scientometric_Analysis_of_the_Articles_Published_in_the_Journal_of_Religion_and_Health_Between_1975_and_2016","315503570_The_Changing_Landscape_of_Neuroscience_Research_2006-2015_A_Bibliometric_Study","313484180_Global_research_trends_of_World_Health_Organization's_top_eight_emerging_pathogens","325830225_Chondrichthyan_research_in_South_America_Endocrinology_overview_and_research_trends_over_50_years_1967-2016_compared_to_the_rest_of_the_world","316178528_Forty_years_of_the_European_Journal_of_Operational_Research_A_bibliometric_overview"]}