{"id":"342590662_NOVEL_ECONOMICAL_SOCIAL_DISTANCING_SMART_DEVICE_FOR_COVID19","abstract":"Spiritual intelligence is the science of human energy management that clarifies and in the era of COVID-19 in which everywhere there is a panic like situation and according to the World Health Organization Social Distancing will be proven to be the only solution. In this research paper, an innovative localization method was proposing to track humans' position in an outdoor environment based on sensors is proposed. With the help of artificial intelligence, this novel smart device is handy for maintaining a social distancing as well as detecting COVID 19 symptom patients and thereby safety. In these COVID-19 environments, where everyone is conscious about their safety, we came up with the idea of this novel device. Most of the time, people on the roadside watched their front but were not able to look after what is going on behind them. The device will give alert to the person if someone in the critical range of six feet around him. The method is reasonably accurate and can be very useful in maintaining social distancing. The sensor model used is described, and the expected errors in distance estimates are analyzed and modeled. Finally, the experimental results are presented.","authors":["Rahul Reddy Nadikattu","Sikender Mohsienuddin Mohammad","Pawan Whig"],"meta":["June 2020INTERNATIONAL JOURNAL OF ELECTRICAL ENGINEERING & TECHNOLOGY 11(4):204-217","DOI:10.34218/IJEET.11.4.2020.023","Project: NOVEL ECONOMICAL SOCIAL DISTANCING SMART DEVICE FOR COVID19"],"references":["341804517_A_Comparative_Study_between_Simulation_of_Machine_Learning_and_Extreme_Learning_Techniques_on_Breast_Cancer_Diagnosis","341443366_Research_on_Data_Science_Data_Analytics_and_Big_Data","304771465_Simulation_and_Performance_Analysis_of_Low_Power_Quasi_Floating_Gate_PCS_Model","270339021_Development_of_Low_Power_Dynamic_Threshold_PCS_System","263884695_Development_of_economical_asic_for_pcs_for_water_quality_monitoring","261960291_Would_you_like_to_play_with_me_How_robots'_group_membership_and_task_features_influence_human-robot_interaction","320745833_Low_Delay_Based_4_Bit_QSD_AdderSubtraction_Number_System_by_Reversible_Logic_Gate","320744244_Low_Delay_Based_Full_AdderSubtractor_by_MIG_and_COG_Reversible_Logic_Gate","285086248_Measurement_of_personal-group_relations","284851808_Construal_level_theory"]}