{"id":"342519250_Data-driven_agriculture_for_rural_smallholdings","abstract":"Spatial information science has a critical role to play in meeting the major challenges facing society in the coming decades, including feeding a population of 10 billion by 2050, addressing environmental degradation, and acting on climate change. Agriculture and agri-food value-chains, dependent on spatial information, are also central. Due to agriculture's dual role as not only a producer of food, fibre and fuel, but also as a major land, water and energy consumer, agriculture is at the centre of both the food-water-energy-environment nexus and resource security debates.\n\nThe recent confluence of a number of advances in data analytics, cloud computing, remote sensing, computer vision, robotic and drone platforms, and IoT sensors and networks have lead to a significant reduction in the cost of acquiring and processing data for decision support in the agricultural sector. When combined with cost-effective automation through development of swarm farming technologies, the technology has the potential to decouple productivity and cost efficiency from economies of size, reducing the need to increase farm size to remain economically viable.\n\nWe argue that these pressures and opportunities are driving agricultural value-chains towards high-resolution data-driven decision-making, where even decisions made by small rural landowners can be data-driven. We survey recent innovations in data, especially focusing on sensor, spatial and data mining technologies with a view to their agricultural application; discuss economic feasibility for small farmers; and identify some technical challenges that need to be solved to reap the benefits. Flexibly composable information resources, coupled with sophisticated data sharing technologies, and machine learning with transparently embedded spatial and aspatial methods are all required.","authors":["Kerry Taylor","Martin Amidy"],"meta":["June 2020Journal of Spatial Information Science","DOI:10.5311/JOSIS.2020.20.669"],"references":["348176534_Active_Knowledge_Graph_Completion","339187485_IoT-Stream_A_Lightweight_Ontology_for_Internet_of_Things_Data_Streams_and_Its_Use_with_Data_Analytics_and_Event_Detection_Services","332653186_The_Impact_of_Swarm_Robotics_on_Arable_Farm_Size_and_Structure_in_the_UK","331112318_Semantic_Sensor_Network_Ontology","327029380_Machine_Learning_in_Agriculture_A_Review","325644558_The_Modular_SSN_Ontology_A_Joint_W3C_and_OGC_Standard_Specifying_the_Semantics_of_Sensors_Observations_Sampling_and_Actuation","324137459_Best_Practices_for_Publishing_Retrieving_and_Using_Spatial_Data_on_the_Web","323919042_Senaps_A_platform_for_integrating_time-series_with_modelling_systems","336907254_Using_Knowledge_Graphs_to_Search_an_Enterprise_Data_Lake","324907368_Enhancing_Visibility_in_EPCIS_Governing_Agri-Food_Supply_Chains_via_Linked_Pedigrees"]}