{"id":"342524091_Machine_Learning_in_Tropical_Cyclone_Forecast_Modeling_A_Review","abstract":"Tropical cyclones have always been a concern of meteorologists, and there are many studies regarding the axisymmetric structures, dynamic mechanisms, and forecasting techniques from the past 100 years. This research demonstrates the ongoing progress as well as the many remaining problems. Machine learning, as a means of artificial intelligence, has been certified by many researchers as being able to provide a new way to solve the bottlenecks of tropical cyclone forecasts, whether using a pure data-driven model or improving numerical models by incorporating machine learning. Through summarizing and analyzing the challenges of tropical cyclone forecasts in recent years and successful cases of machine learning methods in these aspects, this review introduces progress based on machine learning in genesis forecasts, track forecasts, intensity forecasts, extreme weather forecasts associated with tropical cyclones (such as strong winds and rainstorms, and their disastrous impacts), and storm surge forecasts, as well as in improving numerical forecast models. All of these can be regarded as both an opportunity and a challenge. The opportunity is that at present, the potential of machine learning has not been completely exploited, and a large amount of multi-source data have also not been fully utilized to improve the accuracy of tropical cyclone forecasting. The challenge is that the predictable period and stability of tropical cyclone prediction can be difficult to guarantee, because tropical cyclones are different from normal weather phenomena and oceanographic processes and they have complex dynamic mechanisms and are easily influenced by many factors.","authors":["Chen Rui","Weimin Zhang","Xiang Wang"],"meta":["June 2020Atmosphere 11(7):676","DOI:10.3390/atmos11070676"],"references":["338857812_Tropical_Cyclone_Track_Forecasting_Using_Fused_Deep_Learning_From_Aligned_Reanalysis_Data","338249977_Tropical_Cyclone_Intensity_Estimation_Using_Multi-Dimensional_Convolutional_Neural_Networks_from_Geostationary_Satellite_Data","337091520_Study_on_Wind_Simulations_Using_Deep_Learning_Techniques_during_Typhoons_A_Case_Study_of_Northern_Taiwan","336408130_Fast_domain-aware_neural_network_emulation_of_a_planetary_boundary_layer_parameterization_in_a_numerical_weather_forecast_model","334982379_A_Climatological_Analysis_of_Tropical_Cyclone_Rapid_Intensification_in_Environments_of_Upper-Tropospheric_Troughs","333230428_Machine_Learning_Approaches_for_Detecting_Tropical_Cyclone_Formation_Using_Satellite_Data","336360270_A_hybrid_approach_of_artificial_neural_network_and_multiple_regression_to_forecast_typhoon_rainfall_and_groundwater-level_change","336184516_Artificial_neural_network-based_storm_surge_forecast_model_Practical_application_to_Sakai_Minato_Japan","335911555_Knowledge-enhanced_deep_learning_for_simulation_of_tropical_cyclone_boundary-layer_winds","333861578_Prediction_of_Tropical_Cyclone_Genesis_from_Mesoscale_Convective_Systems_Using_Machine_Learning"]}