{"id":"342536035_Deep_Learning-Powered_Iterative_Combinatorial_Auctions","abstract":"In this paper, we study the design of deep learning-powered iterative combinatorial auctions (ICAs). We build on prior work where preference elicitation was done via kernelized support vector regressions (SVRs). However, the SVR-based approach has limitations because it requires solving a machine learning (ML)-based winner determination problem (WDP). With expressive kernels (like gaussians), the ML-based WDP cannot be solved for large domains. While linear or quadratic kernels have better computational scalability, these kernels have limited expressiveness. In this work, we address these shortcomings by using deep neural networks (DNNs) instead of SVRs. We first show how the DNN-based WDP can be reformulated into a mixed integer program (MIP). Second, we experimentally compare the prediction performance of DNNs against SVRs. Third, we present experimental evaluations in two medium-sized domains which show that even ICAs based on relatively small-sized DNNs lead to higher economic efficiency than ICAs based on kernelized SVRs. Finally, we show that our DNN-powered ICA also scales well to very large CA domains.","authors":["Jakob Weissteiner","Sven Seuken"],"meta":["April 2020Proceedings of the AAAI Conference on Artificial Intelligence 34(02):2284-2293","DOI:10.1609/aaai.v34i02.5606"],"references":["324782937_Deep_neural_networks_and_mixed_integer_linear_optimization","234800200_Preference_Elicitation_and_Query_Learning","24048001_A_Combinatorial_Auction_Mechanism_for_Aiport_Time_Slot_Allocation","335879799_Fast_Iterative_Combinatorial_Auctions_via_Bayesian_Learning","326326960_The_clock-proxy_auction_A_practical_combinatorial_auction_design","326202265_Deep_Learning_for_Multi-Facility_Location_Mechanism_Design","320590417_A_Practical_Guide_to_the_Combinatorial_Clock_Auction","230609573_Payment_Rules_through_Discriminant-Based_Classifiers","222674245_Hierarchical_Package_Bidding_A_Paper_Pencil_Combinatorial_Auction","222416128_The_communication_requirement_of_efficient_allocations_and_supporting_prices_Journal_of_Economic_Theory_1291_192-224","221445005_Applying_learning_algorithms_to_preference_elicitation","209436387_A_Tutorial_on_Support_Vector_Regression","39729098_Spectrum_Auction_Design"]}