{"id":"342582995_Radiografia_del_periodisme_de_dades_a_les_facultats_de_Comunicacio_espanyoles_innovar_els_estudis_de_grau_en_Periodisme","abstract":"L’evolució del periodisme i els mitjans fa que cada vegada més el coneixement en profunditat d’eines informàtiques sigui una necessitat urgent per als periodistes del segle XXI. Per això cal analitzar, debatre i consensuar quin tipus de formació tecnològica bàsica és necessària per poder realitzar un periodisme de qualitat. El periodisme de dades, fagocitat per Internet, s’ha convertit en una especialització que demana el coneixement d’aquestes eines i, en conseqüència, una formació ad hoc. Però, estan les facultats de Comunicació preparades per afrontar aquests nous desafiaments formatius i la creació de nous perfils en l’era de les macrodades? Per respondre a aquesta pregunta s’ha dut a terme una recerca els primers avenços de la qual donem a conèixer en aquest article. S’han analitzat els diversos plans d’estudis i les guies docents de les assignatures dels graus de Periodisme i Comunicació de les universitats espanyoles, i s’ha constatat que no existeix una correlació entre el que demana el mercat professional periodístic i la formació universitària. Aquestes troballes demostren que la tecnologia informàtica, com a base de coneixement dels periodistes de dades, ocupa un lloc mínim en la formació del professional, per la qual cosa sorgeix una necessitat urgent de modificar els plans d’estudis.","authors":["Jesus Miguel Flores-Vivar","Pilar José López López"],"meta":["June 2020Anàlisi","DOI:10.5565/rev/analisi.3273"],"references":["327738954_Algoritmos_aplicaciones_y_Big_data_nuevos_paradigmas_en_el_proceso_de_comunicacion_y_de_ensenanza-aprendizaje_del_periodismo_de_datos","277845153_La_ensenanza_del_ciberperiodismo_en_las_licenciaturas_de_Periodismo_de_Espana","346851191_The_Online_Journalism_Handbook_Skills_to_Survive_and_Thrive_in_the_Digital_Age","31724093_La_investigacion_cientifica_de_los_medios_de_comunicacion_una_introduccion_a_sus_metodos_RD_Wimmer_JR_Dominick_tr_por_J_Luis_Dader"]}