{"id":"342528584_An_Early_Warning_System_to_Detect_At-Risk_Students_in_Online_Higher_Education","abstract":"Artificial intelligence has impacted education in recent years. Datafication of education has allowed developing automated methods to detect patterns in extensive collections of educational data to estimate unknown information and behavior about the students. This research has focused on finding accurate predictive models to identify at-risk students. This challenge may reduce the students’ risk of failure or disengage by decreasing the time lag between identification and the real at-risk state. The contribution of this paper is threefold. First, an in-depth analysis of a predictive model to detect at-risk students is performed. This model has been tested using data available in an institutional data mart where curated data from six semesters are available, and a method to obtain the best classifier and training set is proposed. Second, a method to determine a threshold for evaluating the quality of the predictive model is established. Third, an early warning system has been developed and tested in a real educational setting being accurate and useful for its purpose to detect at-risk students in online higher education. The stakeholders (i.e., students and teachers) can analyze the information through different dashboards, and teachers can also send early feedback as an intervention mechanism to mitigate at-risk situations. The system has been evaluated on two undergraduate courses where results shown a high accuracy to correctly detect at-risk students.","authors":["David Baneres","M. Elena Rodríguez","Ana-Elena Guerrero","Abdulkadir Karadeniz"],"meta":["June 2020Applied Sciences 10(13):4427","DOI:10.3390/app10134427"],"references":["339046496_Analyzing_and_Predicting_Students'_Performance_by_Means_of_Machine_Learning_A_Review","337937724_Predicting_Students_Success_in_Blended_Learning-Evaluating_Different_Interactions_Inside_Learning_Management_Systems","336915553_Using_learning_analytics_to_develop_early-warning_system_for_at-risk_students","336880753_How_to_Extract_Meaningful_Insights_from_UGC_A_Knowledge-Based_Method_Applied_to_Education","336846972_Systematic_review_of_research_on_artificial_intelligence_applications_in_higher_education_-where_are_the_educators","334818622_The_Machine_Learning-Based_Dropout_Early_Warning_System_for_Improving_the_Performance_of_Dropout_Prediction","339966975_School's_Out_But_Class's_On_The_Largest_Online_Education_in_the_World_Today_Taking_China's_Practical_Exploration_During_The_COVID-19_Epidemic_Prevention_and_Control_as_an_Example","338449394_Enhancing_ICT_Personalized_Education_through_a_Learning_Intelligent_System","338105489_TOWARDS_AN_INTERVENTION_MECHANISM_FOR_SUPPORTING_LEARNERS_PERFORMANCE_IN_ONLINE_LEARNING","336827149_Teaching_Engineering_Students_Freehand_Sketching_with_an_Intelligent_Tutoring_System"]}