{"id":"342582889_Automated_Assessment_and_Microlearning_Units_as_Predictors_of_At-Risk_Students_and_Students'_Outcomes_in_the_Introductory_Programming_Courses","abstract":"The number of students who decided to study information technology related study programs is continually increasing. Introductory programming courses represent the most crucial milestone in information technology education and often reflect students' ability to think abstractly and systematically, solve problems, and design their solutions. Even though many students who attend universities have already completed some introductory courses of programming, there is still a large group of students with limited programming skills. This drawback often increases during the first term, and it is often the main reason why students leave study too early. There is a myriad of technologies and tools which can be involved in the programming course to increase students' chances of mastering programming. The introductory programming courses used in this study has been gradually extended over the four academic years with the automated source code assessment of students’ programming assignments followed by the implementation of a set of suitably designed microlearning units. The final four datasets were analysed to confirm the suitability of automated assessment and microlearning units as predictors of at-risk students and students’ outcomes in the introductory programming courses. The research results proved the significant contribution of automated code assessment in students’ learning outcomes in the elementary topics of learning programming. Simultaneously, it proved a moderate to strong dependence between the students’ activity and achievement in the activities and final students’ outcomes.","authors":["Ján Skalka","Martin Drlík"],"meta":["June 2020Applied Sciences 10(13):4566","DOI:10.3390/app10134566"],"references":["335500187_Automated_Assessment_of_Computer_Programming_Practices_The_8-Years_UNED_Experience","334578167_Towards_a_Common_Instrument_for_Measuring_Prior_Programming_Knowledge","333501137_Automated_Assessment_in_Learning_and_Teaching_Programming_Languages_using_Virtual_Learning_Environment","331786864_Educational_Model_for_Improving_Programming_Skills_Based_on_Conceptual_Microlearning_Framework","330356563_Mining_Moodle_Data_to_Detect_the_Inactive_and_Lowperformance_Students_during_the_Moodle_Course","330181911_Data_processing_methods_in_the_development_of_the_microlearning-based_framework_for_teaching_programming_languages","337728208_Predicting_academic_performance_of_university_students_from_multi-sources_data_in_blended_learning","333492604_A_Knowledge_Based_System_for_Automated_Assessment_of_Short_Structured_Questions","331299968_50_Years_of_CS1_at_SIGCSE_A_Review_of_the_Evolution_of_Introductory_Programming_Education_Research","330269877_Predicting_academic_performance_a_systematic_literature_review"]}