{"id":"342543860_Building_Calibrated_Deep_Models_via_Uncertainty_Matching_with_Auxiliary_Interval_Predictors","abstract":"With rapid adoption of deep learning in critical applications, the question of when and how much to trust these models often arises, which drives the need to quantify the inherent uncertainties. While identifying all sources that account for the stochasticity of models is challenging, it is common to augment predictions with confidence intervals to convey the expected variations in a model's behavior. We require prediction intervals to be well-calibrated, reflect the true uncertainties, and to be sharp. However, existing techniques for obtaining prediction intervals are known to produce unsatisfactory results in at least one of these criteria. To address this challenge, we develop a novel approach for building calibrated estimators. More specifically, we use separate models for prediction and interval estimation, and pose a bi-level optimization problem that allows the former to leverage estimates from the latter through an uncertainty matching strategy. Using experiments in regression, time-series forecasting, and object localization, we show that our approach achieves significant improvements over existing uncertainty quantification methods, both in terms of model fidelity and calibration error.","authors":["Jayaraman J. Thiagarajan","Bindya Venkatesh","Prasanna Sattigeri","Peer-Timo Bremer"],"meta":["April 2020Proceedings of the AAAI Conference on Artificial Intelligence 34(04):6005-6012","DOI:10.1609/aaai.v34i04.6062"],"references":["324240469_Opportunities_and_obstacles_for_deep_learning_in_biology_and_medicine","321788243_Leveraging_uncertainty_information_from_deep_neural_networks_for_disease_detection","315096611_What_Uncertainties_Do_We_Need_in_Bayesian_Deep_Learning_for_Computer_Vision","46572499_Caltech-UCSD_Birds_200","2594015_Probabilistic_Outputs_for_Support_Vector_Machines_and_Comparisons_to_Regularized_Likelihood_Methods","338503989_Learning_for_Single-Shot_Confidence_Calibration_in_Deep_Neural_Networks_Through_Stochastic_Inferences","334844134_Bayesian_Uncertainty_Matching_for_Unsupervised_Domain_Adaptation","311430201_Simple_and_Scalable_Predictive_Uncertainty_Estimation_using_Deep_Ensembles","305218171_Cost-Effective_Active_Learning_for_Deep_Image_Classification","277410990_Probabilistic_machine_learning_and_artificial_intelligence","4742807_Strictly_Proper_Scoring_Rules_Prediction_and_Estimation","2600905_Practical_Confidence_and_Prediction_Intervals"]}