{"id":"342581318_Spatial_Exploration_of_Economic_Data-Insight_Into_Attitudes_of_Students_Towards_Interdisciplinary_Knowledge","abstract":"This paper uses the technology acceptance model (TAM) framework for the research of economic and geography students’ attitudes towards interdisciplinary knowledge. Based on the SmartPLS Structural equation modelling SEM variance-based method, research results were gained through analysis of survey data of economic and geography students. They participated in the Spationomy project in the period of 2017–2019. Online questionnaires were fulfilled before and after students’ participation in the project and their future behavioural intention to use interdisciplinary knowledge was analysed. Based on the research, we can confirm that the Spationomy project has achieved its purpose, as both groups of students (economic and geography students) have acquired interdisciplinary knowledge and students intend to use it also in the future. Therefore, we can argue that the students included in the project in practice gained recognition of systems thinking about the importance of mutual interdisciplinary cooperation towards achieving synergies. The results also show that TAM can be successfully implemented to analyse how students of economics and geography accept the use of interdisciplinary knowledge in the learning process, which is an important implication for management and education as well as from the theoretical implications viewpoint. While effective analysis using TAM has been used successfully and relatively frequently in economics and business field, we have not found relevant examples of its implementation in the broader field of geography. However, the acceptance of geographic information system (GIS) or other information technologies/information software (IT/IS) tool-based approaches of analysis in the geography field may be of most importance. Therefore, also, this represents an important implication for the research area.","authors":["Simona Sternad","Polona Tominc","Samo Bobek","Tjaša Štrukelj"],"meta":["June 2020International Journal of Geo-Information 9(7):421","DOI:10.3390/ijgi9070421"],"references":["341340127_Subjective_or_Objective_How_Objective_Measures_Relate_to_Subjective_Life_Satisfaction_in_Europe","338525818_A_Strategic_Model_for_Sustainable_Business_Policy_Development","337857593_Spationomy_-_Spatial_Exploration_of_Economic_Data_and_Methods_of_Interdisciplinary_Analytics","337087404_Spatial_Informatics_in_Water_Supply_Management_The_Case_of_Mariborski_Vodovod","335594862_Enterprise_values_and_enterprise_policy_interdependence","332819034_A_cyber-systemic_learning_action_approach_towards_selected_students'_competencies_development","347588933_INTEGRATION_AND_USE_OF_THE_INTERDISCIPLINARY_KNOWLEDGE_IN_THE_FIELD_OF_SPATIAL_AND_ECONOMICSBUSINESS_SCIENCES","339659101_A_social-media-based_approach_to_assessing_the_effectiveness_of_equitable_housing_policy_in_mitigating_education_accessibility_induced_social_inequalities_in_Shanghai_China","334366069_Technology_acceptance_model_based_study_of_students'_attitudes_toward_use_of_enterprise_resource_planning_solutions","334188958_Technology_acceptance_model-based_research_on_differences_of_enterprise_resources_planning_systems_use_in_India_and_the_European_Union"]}