{"id":"342546419_Enumerating_Maximal_k-Plexes_with_Worst-Case_Time_Guarantee","abstract":"The problem of enumerating all maximal cliques in a graph is a key primitive in a variety of real-world applications such as community detection and so on. However, in practice, communities are rarely formed as cliques due to data noise. Hence, k-plex, a subgraph in which any vertex is adjacent to all but at most k vertices, is introduced as a relaxation of clique. In this paper, we investigate the problem of enumerating all maximal k-plexes and present FaPlexen, an enumeration algorithm which integrates the “pivot” heuristic and new branching schemes. To our best knowledge, for the first time, FaPlexen lists all maximal k-plexes with provably worst-case running time O(n2γn) in a graph with n vertices, where γ < 2. Then, we propose another algorithm CommuPlex which non-trivially extends FaPlexen to find all maximal k-plexes of prescribed size for community detection in massive real-life networks. We finally carry out experiments on both real and synthetic graphs and demonstrate that our algorithms run much faster than the state-of-the-art algorithms.","authors":["Yi Zhou","Jingwei Xu","Zhenyu Guo","Mingyu Xiao"],"meta":["April 2020Proceedings of the AAAI Conference on Artificial Intelligence 34(03):2442-2449","DOI:10.1609/aaai.v34i03.5625"],"references":["326496506_D2K_Scalable_Community_Detection_in_Massive_Networks_via_Small-Diameter_k-Plexes","304069223_On_the_2-Club_Polytope_of_Graphs","284275447_Exact_MIP-based_approaches_for_finding_maximum_quasi-cliques_and_dense_subgraphs","257428613_Fast_Maximal_Cliques_Enumeration_in_Sparse_Graphs","326205548_An_Exact_Algorithm_for_Maximum_k-Plexes_in_Massive_Graphs","318915539_Fast_Enumeration_of_Large_k-Plexes","315536050_Parallelizing_maximal_clique_and_k-plex_enumeration_over_graph_data","312600697_Algorithm_457_Finding_all_cliques_of_an_undirected_graph","300590376_Efficient_Enumeration_of_Maximal_k-Plexes","294107081_Enumeration_of_Maximal_Cliques_from_an_Uncertain_Graph"]}