{"id":"342537149_Structure_Learning_for_Approximate_Solution_of_Many-Player_Games","abstract":"Games with many players are difficult to solve or even specify without adopting structural assumptions that enable representation in compact form. Such structure is generally not given and will not hold exactly for particular games of interest. We introduce an iterative structure-learning approach to search for approximate solutions of many-player games, assuming only black-box simulation access to noisy payoff samples. Our first algorithm, K-Roles, exploits symmetry by learning a role assignment for players of the game through unsupervised learning (clustering) methods. Our second algorithm, G3L, seeks sparsity by greedy search over local interactions to learn a graphical game model. Both algorithms use supervised learning (regression) to fit payoff values to the learned structures, in compact representations that facilitate equilibrium calculation. We experimentally demonstrate the efficacy of both methods in reaching quality solutions and uncovering hidden structure, on both perfectly and approximately structured game instances.","authors":["Zun Li","Michael Wellman"],"meta":["April 2020Proceedings of the AAAI Conference on Artificial Intelligence 34(02):2119-2127","DOI:10.1609/aaai.v34i02.5586"],"references":["336952483_Social_and_Economic_Networks","326682132_The_Mechanics_of_n-Player_Differentiable_Games","301313111_Putting_the_agent_in_agent-based_modeling","335720460_Learning_Deviation_Payoffs_in_Simulation-Based_Games","335446768_Large_Scale_Learning_of_Agent_Rationality_in_Two-Player_Zero-Sum_Games","331477508_A_Unified_Game-Theoretic_Approach_to_Multiagent_Reinforcement_Learning","328638278_Actor-Critic_Policy_Optimization_in_Partially_Observable_Multiagent_Environments","326207157_What_Game_Are_We_Playing_End-to-end_Learning_in_Normal_and_Extensive_Form_Games","320975815_Deep_Mean_Field_Games_for_Learning_Optimal_Behavior_Policy_of_Large_Populations","318767435_Query_complexity_of_approximate_equilibria_in_anonymous_games"]}