{"id":"342530307_A_New_Optimization_Algorithm_Based_on_Search_and_Rescue_Operations","abstract":"In this paper, a new optimization algorithm called the search and rescue optimization algorithm (SAR) is proposed for solving single-objective continuous optimization problems. SAR is inspired by the explorations carried out by humans during search and rescue operations. The performance of SAR was evaluated on fifty-five optimization functions including a set of classic benchmark functions and a set of modern CEC 2013 benchmark functions from the literature. The obtained results were compared with twelve optimization algorithms including well-known optimization algorithms, recent variants of GA, DE, CMA-ES, and PSO, and recent metaheuristic algorithms. The Wilcoxon signed-rank test was used for some of the comparisons, and the convergence behavior of SAR was investigated. The statistical results indicated SAR is highly competitive with the compared algorithms. Also, in order to evaluate the application of SAR on real-world optimization problems, it was applied to three engineering design problems, and the results revealed that SAR is able to find more accurate solutions with fewer function evaluations in comparison with the other existing algorithms. Thus, the proposed algorithm can be considered an efficient optimization method for real-world optimization problems.","authors":["Amir Shabani","Behrouz Asgarian","Saeed Asil Gharebaghi","Miguel A. Salido"],"meta":["November 2019Mathematical Problems in Engineering 2019","DOI:10.1155/2019/2482543"],"references":["316564226_Human_mental_search_a_new_population-based_metaheuristic_optimization_algorithm","349418947_Trade-Offs_in_Robust_Engineering_Design","332268364_Genetic_Algorithm_Review_and_Application","323448760_A_novel_nature-inspired_algorithm_for_optimization_Squirrel_search_algorithm","320308327_A_Review_of_No_Free_Lunch_Theorems_and_Their_Implications_for_Metaheuristic_Optimisation","318672484_A_new_meta-heuristic_optimization_algorithm_using_star_graph","316817969_Maximizing_Lifetime_of_a_Wireless_Sensor_Network_via_Joint_Optimizing_Sink_Placement_and_Sensor-to-Sink_Routing","314250982_Decomposition-Based_Multi-Objective_Firefly_Algorithm_for_RFID_Network_Planning_with_Uncertainty","313151683_Test_functions_for_optimization_needs","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents"]}