{"id":"342536612_Capsule_Routing_via_Variational_Bayes","abstract":"Capsule networks are a recently proposed type of neural network shown to outperform alternatives in challenging shape recognition tasks. In capsule networks, scalar neurons are replaced with capsule vectors or matrices, whose entries represent different properties of objects. The relationships between objects and their parts are learned via trainable viewpoint-invariant transformation matrices, and the presence of a given object is decided by the level of agreement among votes from its parts. This interaction occurs between capsule layers and is a process called routing-by-agreement. In this paper, we propose a new capsule routing algorithm derived from Variational Bayes for fitting a mixture of transforming gaussians, and show it is possible transform our capsule network into a Capsule-VAE. Our Bayesian approach addresses some of the inherent weaknesses of MLE based models such as the variance-collapse by modelling uncertainty over capsule pose parameters. We outperform the state-of-the-art on smallNORB using ≃50% fewer capsules than previously reported, achieve competitive performances on CIFAR-10, Fashion-MNIST, SVHN, and demonstrate significant improvement in MNIST to affNIST generalisation over previous works.1","authors":["Fabio De Sousa Ribeiro","Georgios Leontidis","Stefanos Kollias"],"meta":["April 2020Proceedings of the AAAI Conference on Artificial Intelligence 34(04):3749-3756","DOI:10.1609/aaai.v34i04.5785"],"references":["329309764_An_Effective_Hit-or-Miss_Layer_Favoring_Feature_Interpretation_as_Learned_Prototypes_Deformations","221080071_Transforming_Auto-Encoders","339751174_Attention_Routing_Between_Capsules","328088258_MS-CapsNet_A_Novel_Multi-Scale_Capsule_Network","320627198_Dynamic_Routing_Between_Capsules","311609041_Deep_Residual_Learning_for_Image_Recognition","280940018_Pattern_Recognition_and_Machine_Learning","266031774_Reading_Digits_in_Natural_Images_with_Unsupervised_Feature_Learning"]}