{"id":"342667723_Stable_machine-learning_parameterization_of_subgrid_processes_for_climate_modeling_at_a_range_of_resolutions","abstract":"Global climate models represent small-scale processes such as convection using subgrid models known as parameterizations, and these parameterizations contribute substantially to uncertainty in climate projections. Machine learning of new parameterizations from high-resolution model output is a promising approach, but such parameterizations have been prone to issues of instability and climate drift, and their performance for different grid spacings has not yet been investigated. Here we use a random forest to learn a parameterization from coarse-grained output of a three-dimensional high-resolution idealized atmospheric model. The parameterization leads to stable simulations at coarse resolution that replicate the climate of the high-resolution simulation. Retraining for different coarse-graining factors shows the parameterization performs best at smaller horizontal grid spacings. Our results yield insights into parameterization performance across length scales, and they also demonstrate the potential for learning parameterizations from global high-resolution simulations that are now emerging. Machine learning has been used to represent small-scale processes, such as clouds, in atmospheric models but this can lead to instability in simulations of climate. Here, the authors demonstrate a use of machine learning in an atmospheric model that leads to stable simulations of climate at a range of grid spacings.","authors":["Janni Yuval","Paul A. O’Gorman"],"meta":["July 2020Nature Communications 11(1)","DOI:10.1038/s41467-020-17142-3"],"references":["341253457_Coupled_online_learning_as_a_way_to_tackle_instabilities_and_biases_in_neural_network_parameterizations_general_algorithms_and_Lorenz_96_case_study_v10","336154139_DYAMOND_the_DYnamics_of_the_Atmospheric_general_circulation_Modeled_On_Non-hydrostatic_Domains","334750250_Spatially_Extended_Tests_of_a_Neural_Network_Parametrization_Trained_by_Coarse-Graining","330148598_Applications_of_Deep_Learning_to_Ocean_Data_Inference_and_Sub-Grid_Parameterisation","327487681_Deep_learning_to_represent_subgrid_processes_in_climate_models","325696356_A_practical_approach_to_scale-adaptive_deep_convection_in_a_GCM_by_controlling_the_cumulus_base_mass_flux","337911589_Climate_Models_Permit_Convection_at_Much_Coarser_Resolutions_Than_Previously_Considered","332052400_Lossless_Compression_of_Random_Forests","328110075_Using_Machine_Learning_to_Parameterize_Moist_Convection_Potential_for_Modeling_of_Climate_Climate_Change_and_Extreme_Events","325758709_Prognostic_Validation_of_a_Neural_Network_Unified_Physics_Parameterization"]}