{"id":"342616632_Toward_Practical_Quantum_Secure_Direct_Communication_A_Quantum-Memory-Free_Protocol_and_Code_Design","abstract":"Quantum secure direct communication (QSDC) is capable of direct confidential communications over a quantum channel, which is achieved by dispensing with the key agreement channel of the well-known quantum key distribution (QKD). However, to make QSDC a practical reality, we have to mitigate its reliance on quantum memory, its immediate communication interruption caused by eavesdropping and its low transmission reliability due to the heavy qubit losses. Hence a new QSDC protocol is proposed based on a sophisticated coded singlephoton DL04 QSDC protocol to tackle the open challenges. In particular, quantum memory is dispensed with and a highaccuracy secrecy capacity estimate is derived for this protocol by conceiving dynamic joint encryption and error-control (JEEC) coding. We demonstrate that this quantum-memory-free DL04 QSDC (QMF-DL04 QSDC) protocol inches closer to the quantum channel’s capacity and significantly improves the original DL04 QSDC’s robustness. Moreover, a rate-compatible low-rate JEEC coding scheme is designed for the proposed framework, and the JEEC code advocated is shown to approach the secrecy capacity, despite tolerating an extremely high loss of qubits in the time-varying wiretap channel. Our simulations and experimental results demonstrate that the QMF-DL04 QSDC scheme significantly increases both the secure information rate and the communication distance of the original DL04 protocol.","authors":["Zhen Sun","Liyuan Song","Qin Huang","Liuguo Yin"],"meta":["July 2020IEEE Transactions on Communications PP(99):1-1","DOI:10.1109/TCOMM.2020.3006201","Projects: Quantum CommunicationsQuantum Communications"],"references":["355913925_Code-Hopping_Based_Transmission_Scheme_for_Wireless_Physical-Layer_Security","336885919_Security_of_quantum_secure_direct_communication_based_on_Wyner's_wiretap_channel_theory","331845370_Design_and_Implementation_of_a_Practical_Quantum_Secure_Direct_Communication_System","330902412_Implementation_and_security_analysis_of_practical_quantum_secure_direct_communication","320583027_Experimental_long-distance_quantum_secure_direct_communication","345455342_A_Communication_Framework_with_Unified_Efficiency_and_Secrecy","344658150_Measurement-device-independent_quantum_secure_direct_communication","341639579_Long-distance_measurement-device-independent_quantum_secure_direct_communication","332568600_Quantum_Random-Number_Generator_Based_on_Tunneling_Effects_in_a_Si_Diode","327679805_Measurement-device-independent_quantum_communication_without_encryption"]}