{"id":"342656225_A_review_of_vibration-based_damage_detection_in_civil_structures_From_traditional_methods_to_Machine_Learning_and_Deep_Learning_applications","abstract":"Monitoring structural damage is extremely important for sustaining and preserving the service life of civil structures. While successful monitoring provides resolute and staunch information on the health, serviceability, integrity and safety of structures; maintaining continuous performance of a structure depends highly on monitoring the occurrence, formation and propagation of damage. Damage may accumulate on structures due to different environmental and human-induced factors. Numerous monitoring and detection approaches have been developed to provide practical means for early warning against structural damage or any type of anomaly. Considerable effort has been put into vibration-based methods, which utilize the vibration response of the monitored structure to assess its condition and identify structural damage. Meanwhile, with emerging computing power and sensing technology in the last decade, Machine Learning (ML) and especially Deep Learning (DL) algorithms have become more feasible and extensively used in vibration-based structural damage detection with elegant performance and often with rigorous accuracy. While there have been multiple review studies published on vibration-based structural damage detection, there has not been a study where the transition from traditional methods to ML and DL methods are described and discussed. This paper aims to fulfill this gap by presenting the highlights of the traditional methods and provide a comprehensive review of the most recent applications of ML and DL algorithms utilized for vibration-based structural damage detection in civil structures.","authors":["Onur Avci","Osama Abdeljaber","Serkan Kiranyaz","Mohammed F.M. Hussein"],"meta":["January 2021Mechanical Systems and Signal Processing 147","DOI:10.1016/j.ymssp.2020.107077","Projects: Structural Health Monitoring, Structural Damage Detection, Localization and QuantificationWe are now working on machine learning and pattern recognition for big media data analytics.Artificial Intelligence, Machine Learning and Deep Learning use in Structural Health Monitoring, Structural Damage Detection and Structural Control"],"references":["341233561_A_Numerical_and_Experimental_Investigation_of_a_Special_Type_of_Floating_Slab_Tracks","335698793_Deep_Convolutional_Neural_Network-Based_Structural_Damage_Localization_and_Quantification_Using_Transmissibility_Data","327833905_Efficiency_Validation_of_One_Dimensional_Convolutional_Neural_Networks_for_Structural_Damage_Detection_Using_a_SHM_Benchmark_Data","337052169_Non-probabilistic_method_to_consider_uncertainties_in_frequency_response_function_for_vibration-based_damage_detection_using_Artificial_Neural_Network","333321755_Convolutional_Neural_Networks_for_Real-Time_and_Wireless_Damage_Detection","333116634_Structural_Health_Monitoring_with_Self-Organizing_Maps_and_Artificial_Neural_Networks","329823058_Fault_Detection_and_Severity_Identification_of_Ball_Bearings_by_Online_Condition_Monitoring","329648552_Vibration-based_structural_condition_assessment_using_convolution_neural_networks","328149034_A_novel_deep_learning-based_method_for_damage_identification_of_smart_building_structures","327847263_Data_fusion_approaches_for_structural_health_monitoring_and_system_identification_Past_present_and_future"]}