{"id":"342645887_Robust_Bilayer_Charge_Pumping_for_Spin-_and_Density-Resolved_Quantum_Gas_Microscopy","abstract":"Quantum gas microscopy has emerged as a powerful new way to probe quantum many-body systems at the microscopic level. However, layered or efficient spin-resolved readout methods have remained scarce as they impose strong demands on the specific atomic species and constrain the simulated lattice geometry and size. Here we present a novel high-fidelity bilayer readout, which can be used for full spin- and density-resolved quantum gas microscopy of two-dimensional systems with arbitrary geometry. Our technique makes use of an initial Stern-Gerlach splitting into adjacent layers of a highly stable vertical superlattice and subsequent charge pumping to separate the layers by 21 μm. This separation enables independent high-resolution images of each layer. We benchmark our method by spin- and density-resolving two-dimensional Fermi-Hubbard systems. Our technique furthermore enables the access to advanced entropy engineering schemes, spectroscopic methods, or the realization of tunable bilayer systems.","authors":["Joannis Koepsell","Sarah Hirthe","Dominik Bourgund","Pimonpan Sompet"],"meta":["July 2020Physical Review Letters 125(1)","DOI:10.1103/PhysRevLett.125.010403","Project: Robust Bilayer Charge-Pumping for Spin- and Density-Resolved Quantum Gas Microscopy"],"references":["336866756_Angle-resolved_photoemission_spectroscopy_of_a_Fermi-Hubbard_system","335174482_Imaging_magnetic_polarons_in_the_doped_Fermi-Hubbard_model","331991648_Stern-Gerlach_detection_of_neutral-atom_qubits_in_a_state-dependent_optical_lattice","324005953_Direct_observation_of_incommensurate_magnetism_in_Hubbard_chains","323410775_Bad_metallic_transport_in_a_cold_atom_Fermi-Hubbard_system","321665700_Synthetic_three-dimensional_atomic_structures_assembled_atom_by_atom","320619568_Angle-resolved_photoemission_spectroscopy_with_quantum_gas_microscopes","338540247_Time-resolved_observation_of_spin-charge_deconfinement_in_fermionic_Hubbard_chains","334553554_String_patterns_in_the_doped_Hubbard_model","323444295_Spin_Transport_in_a_Mott_Insulator_of_Ultracold_Fermions"]}