{"id":"342683323_Teacher_PAI_Learning_Strategy_in_Improving_Self_Control_Students_in_Binjai_State_4_High_School","abstract":"This study aims to determine the learning strategies of Islamic Religious Education teachers in improving student self control in SMA Negeri 4 Binjai. To answer the research problem, researchers describe how the learning strategies of Islamic Religious Education teachers in improving student self control, and what are the inhibiting and supporting factors for implementing Islamic religious education learning strategies in improving student self control in SMA Negeri 4 Binjai. This study uses a qualitative method with the type of case study research so that this research problem can be explored in detail. Data collection techniques used were interviews, observation, and study of documents. The technique of guaranteeing the validity of the data is carried out by testing the data credibility, the dependability test, and the confirmation. Data analysis techniques used are data collection, data reduction, data presentation, and drawing conclusions. The result is PAI teacher learning strategies using several strategies including expository learning strategies, inquiry learning strategies, problem based learning strategies and cooperative learning strategies. In addition, the school has several strategies in improving student self control, namely the Individual approach to students, habit of doing positive things, organizing good programs and establishing joint responsibility to improve students' Self Control. Supporting and inhibiting factors in improving students' Self Control in SMA 4 Binjai In applying Self Control, there are several supporting factors. As the principal, teachers, staff and students provide good support and support all types of programs that are held. The inhibiting factor is that the infrastructure facilities are inadequate for learning given the large number of students who need conducive learning places. On the other hand learning time constraints become a barrier considering the lack of PAI learning hours which can only be used for the delivery of material demanded by the curriculum (syllabus) so that improvements in implementing self control cannot take place properly.","authors":["Mohd. Najmi Adlani Siregar","Mesiono","Salamuddin"],"meta":["July 2020Britain International of Linguistics Arts and Education (BIoLAE) Journal 2(2):576-583","DOI:10.33258/biolae.v2i2.269"],"references":[]}