{"id":"342676342_Towards_improvement_in_data_quality_of_Low-cost_IoT_Sensors_in_environmental_monitoring_networks_using_data_fusion_and_machine_learning_approach","abstract":"Environmental monitoring has become an active research area due to the current rise in the global climate change crises. Current environmental monitoring solutions, however, are characterised by high cost of acquisition, complexity of installation, often requiring extensive resources, infrastructure and expertise. It is infeasible to achieve with these solutions, high density in-situ networks such as are required to build refined scale models to facilitate robust monitoring. Thus, leaving large gaps within the collected dataset. Low-Cost Sensors (LCS) can offer high-resolution spatiotemporal measurements which could be used to supplement existing dataset from current environmental monitoring solutions. LCS however, require frequent calibration in order to provide accurate and reliable data as they are often affected by environmental conditions when deployed on the field. Calibrating LCS can help to improve their data quality and ensure they are collecting accurate data. Achieving effective calibration, however, requires identifying factors that affect sensor’s data quality for a given measurement. This study evaluates the performance of three Feature Selection (FS) algorithms including Forward Feature Selection (FFS), Backward Elimination (BE) and Exhaustive Feature Selection (EFS) in identifying factors that affect data quality of low-cost IoT sensors in environmental monitoring networks. Applying the concept of data fusion, sensors data were merged with environmental factors and integrated into a single calibration equation to calibrate cairclipO3/NO2 and cairclipNO2 sensors using Linear Regression (LR) and Artificial Neural Networks (ANN). The study showed the effectiveness of calibration in improving low-cost IoT sensor data quality and also demonstrated the convenience of feature selection and the ability of data fusion to provide more consistent, accurate and reliable information for calibration models. The analysis showed that the cairclipO3/NO2 sensor provided measurements that have good correlation with reference measurements whereas the cairclipNO2 sensor showed no reasonable correlation with the reference data. Calibrating the cairclipO3/NO2 yielded good improvement in its measurement outputs when compared to reference measurements (R²=0.83). However, calibrating the cairclipNO2 sensor data yielded no significant improvement in its data quality.","authors":["Nwamaka U. Okafor","Yahia Alghorani","Declan T Delaney"],"meta":["July 2020ICT Express 6(3)","DOI:10.1016/j.icte.2020.06.004"],"references":["335805138_Considerations_for_system_design_in_IoT-based_autonomous_ecological_sensing","335768790_Low-Cost_Environmental_Sensor_Networks_Recent_Advances_and_Future_Directions","333314592_Regression_methods_in_the_calibration_of_low-cost_sensors_for_ambient_particulate_matter_measurements","330566646_Analysing_the_performance_of_low-cost_air_quality_sensors_their_drivers_relative_benefits_and_calibration_in_cities-a_case_study_in_Sheffield","327443835_Performance_Analysis_of_IoT-Based_Sensor_Big_Data_Processing_and_Machine_Learning_Model_for_Real-Time_Monitoring_System_in_Automotive_Manufacturing","322511026_Calibration_and_assessment_of_electrochemical_air_quality_sensors_by_co-location_with_regulatory-grade_instruments","322507638_A_machine_learning_calibration_model_using_random_forests_to_improve_sensor_performance_for_lower-cost_air_quality_monitoring","319219310_Development_and_Evaluation_of_A_Novel_and_Cost-Effective_Approach_for_Low-Cost_NO2_Sensor_Drift_Correction","333340770_In_Situ_Calibration_Algorithms_for_Environmental_Sensor_Networks_A_Review","319880974_Review_of_IoT_applications_in_agro-industrial_and_environmental_fields"]}