{"id":"342603757_The_key_factors_in_transforming_Birjand_city_to_a_smart_city_smart_mobility_smart_government","abstract":"The physical development of urban communities and cities, as well as the advancement of communication and information world, increased the need for advanced technologies. Nowadays, many urban planners and managers, especially the mangers of the intelligent transport system and smart government, are concerned with the transformation of physical cities to electronic cities and finally too smart cities in the real world. Making electronic cities smart requires the full participation of urban management organizations in different sectors. In addition, the required frameworks should be designed and implemented based on the close relations of these organizations with each other. This study aimed to investigate the key factors in transforming Birjand city into a smarter city by focusing on two components of the intelligent transport system and smart government. In smart government, a structure is recommended that is appropriate for launching and preparing the policies and regulations that need to be covered by different dimensions. In smart transportation component, one of the most important and valuable solutions to the problems of transportation is the intelligent transport system (ITS). In this context, measuring potentials and implementing strategic planning can play a key role in increasing service delivery and reducing problems. This research design is an applied study. It intends to introduce the principles and dimensions of the intelligent transportation system and explore the potentials and strategic planning opportunities in Birjand city using a descriptive-analytical method. The data were collected by the library - documentary method. Furthermore, the study was conducted as field-survey research (interviews and questionnaires). In continuation, the strengths and weaknesses, opportunities and threats (SWOT) of the intelligent transportation system were determined and analyzed using the SWOT strategic planning model. Finally, appropriate strategies were presented.","authors":["Amirhossein Yadollahi Ghasemi","Mohsen Saberi"],"meta":["July 2020Indonesian Journal of Electrical Engineering and Computer Science 19(1):317","DOI:10.11591/ijeecs.v19.i1.pp317-324"],"references":["342214498_A_Systematic_Literature_Review_on_The_Dimensions_of_Smart_Cities","333915429_Electronic_Transport_Properties_in_Bulk_ZnO_and_Zn_1-x_Mg_x_O_Using_Monte_Carlo_Simulation","330660369_Provisioning_of_Street_Lighting_based_on_Ambience_Intensity_for_Smart_City","330437764_Comprehending_the_IoT_Cyber_Threat_Landscape_A_Data_Dimensionality_Reduction_Technique_to_Infer_and_Characterize_Internet-scale_IoT_Probing_Campaigns","330262991_Nonlinear_Observer_Design_for_RC_Battery_Model_For_Estimating_State_Of_Charge_State_Of_Health_Based_on_State-Dependent_Riccati_Equation","329874440_A_smart_monitoring_and_controlling_for_agricultural_pumps_using_LoRa_IOT_technology","348860790_E-Government_Information_Technology_and_Transformation_Information_Technology_and_Transformation","334389652_Output_feedback_synchronization_of_a_novel_chaotic_system_and_its_application_in_secure_communication","333852787_Design_and_implementation_of_an_optimal_switching_controller_for_uninterruptible_power_supply_inverters_using_adaptive_dynamic_programming","328890829_Optimal_Switching_of_Voltage_Source_Inverters_Using_Approximate_Dynamic_Programming"]}