{"id":"342688477_Connections_between_Weighted_Generalized_Cumulative_Residual_Entropy_and_Variance","abstract":"A shift-dependent information measure is favorable to handle in some specific applied contexts such as mathematical neurobiology and survival analysis. For this reason, the weighted differential entropy has been introduced in the literature. In accordance with this measure, we propose the weighted generalized cumulative residual entropy as well. Despite existing apparent similarities between these measures, however, there are quite substantial and subtle differences between them because of their different metrics. In this paper, particularly, we show that the proposed measure is equivalent to the generalized cumulative residual entropy of the cumulative weighted random variable. Thus, we first provide expressions for the variance and the new measure in terms of the weighted mean residual life function and then elaborate on some characteristics of such measures, including equivalent expressions, stochastic comparisons, bounds, and connection with the excess wealth transform. Finally, we also illustrate some applications of interest in system reliability with reference to shock models and random minima.","authors":["Abdolsaeed Toomaj","Antonio Di Crescenzo"],"meta":["July 2020","DOI:10.3390/math8071072","Project: Stochastic Models for Complex Systems"],"references":["342528139_Generalized_Entropies_Variance_and_Applications","326118646_Shape_measures_based_on_the_convex_transform_order","325968474_Some_Results_and_Applications_of_Geometric_Counting_Processes","317757016_On_Weighted_Generalized_Cumulative_Residual_Entropy_of_Order_n","334946176_On_the_dynamic_cumulative_residual_entropy","333085948_Weighted_extensions_of_generalized_cumulative_residual_entropy_and_their_applications","325193873_On_the_time-dependent_Fisher_information_of_a_density_function","321596289_Maintenance_Theory_of_Reliability","317791361_Some_properties_of_the_cumulative_residual_entropy_of_coherent_and_mixed_systems","310387978_Dynamic_Version_of_Weighted_Cumulative_Residual_Entropy"]}