{"id":"342690873_Understanding_the_Experiences_that_Contribute_to_the_Inclusion_of_Underrepresented_Groups_in_Computing","abstract":"The lack of diversity in computing fields in the United States is a known issue. Students enter the computing fields with the intention of graduating; however, a large number leave and do not persist after enrolling, due to discrimination and biases. This particularly concerns groups already underrepresented in computing fields, such as women, Black/African American students, and Hispanic/Latinx students. However, there are various experiences that can make students feel more included or excluded in the field. Some of these experiences include internships, undergraduate research, capstone courses, and projects, etc. Drawing on Astin's I-E-O model and applying a random forest algorithm, we measure the feature importance of 14 distinct experiences on 1650 students' feelings of inclusivity in the computing field. We observe that there are gender and racial differences in terms of the opinions of computing fields' inclusivity. For example, tutoring experience, job offers, and job experience are considered some of the most important factors for female's perceived inclusiveness of women. However, men perceived women's inclusivity differently, based on the experiences they engaged in. We also looked at the perceived inclusiveness of computing fields for ethnically and racially underrepresented groups, such as Hispanic/Latinx students. Understanding the effect of different experiences on students of both genders with different races and ethnicities on the perceived inclusion could assist the computing community to provide more cohesive experiences that benefits all students and helps them to feel more welcome.","authors":["Maral Kargarmoakhar","Stephanie J Lunn","Leila Zahedi","Monique Ross"],"meta":["October 2020","DOI:10.1109/FIE44824.2020.9274113","Conference: IEEE Frontiers in Education (FIE)At: Uppsala, Sweden"],"references":["352205938_An_Examination_of_Inclusivity_and_Support_for_Diversity_in_STEM_Fields","344329917_INFLUENCES_OF_FRIENDS_AND_FAMILY_ON_WOMEN'S_PURSUIT_OF_COMPUTING_A_SEQUENTIAL_EXPLANATORY_DESIGN_Influences_of_Friends_and_Family_on_Women's_Pursuit_of_Computing_A_Sequential_Explanatory_Design","344329740_How_Cultural_Messages_Through_Experiences_Influence_Occupational_Pur-_suit_of_Muslim_Female_Computer_Science_Students_Work_in_Progress_How_cultural_messages_through_experiences_influence_occupational_","340565749_Leveraging_Machine-learning_Techniques_to_Analyze_Computing_Persistence_in_Undergraduate_Programs","339337135_Multi-institution_study_of_student_demographics_and_stickiness_of_computing_majors_in_the_USA","331606888_A_Structural_Equation_Model_Analysis_of_Computing_Identity_Sub-Constructs_and_Student_Academic_Persistence","344817731_Student_Perceptions_of_a_Summer_Research_Internship_Program_for_Underrepresented_Community_College_Engineering_Students","319132118_Social_Perceptions_in_Computer_Science_and_Implications_for_Diverse_Students","315856318_Barriers_and_Opportunities_for_2-year_and_4-year_STEM_Degrees","312560414_Techniques_to_deal_with_missing_data"]}