{"id":"342676951_Improving_impact_monitoring_through_Line_Of_Variations_densification","abstract":"We propose a densification algorithm to improve the Line Of Variations (LOV) method for impact monitoring, which can fail when the information is too little, as it may happen in difficult cases. The LOV method uses a 1-dimensional sampling to explore the uncertainty region of an asteroid. The close approaches of the sample orbits are grouped by time and LOV index, to form the so-called returns, and each return is analysed to search for local minima of the distance from the Earth along the LOV. The strong non-linearity of the problem causes the occurrence of returns with so few points that a successful analysis can be prevented. Our densification algorithm tries to convert returns with length at most 3 in returns with 5 points, properly adding new points to the original return. Due to the complex evolution of the LOV, this operation is not necessarily achieved all at once: in this case the information about the LOV geometry derived from the first attempt is exploited for a further attempt. Finally, we present some examples showing that the application of our method can have remarkable consequences on impact monitoring results, in particular about the completeness of the virtual impactors search.","authors":["Alessio Del Vigna","F. Guerra","G.B. Valsecchi"],"meta":["July 2020Icarus 351:113966","DOI:10.1016/j.icarus.2020.113966"],"references":["340589701_Use_of_the_semilinear_method_to_predict_the_impact_corridor_on_ground","334467457_Yarkovsky_effect_detection_and_updated_impact_hazard_assessment_for_near-Earth_asteroid_410777_2009_FD","327792042_Completeness_of_Impact_Monitoring","325193745_Detecting_the_Yarkovsky_effect_among_near-Earth_asteroids_from_astrometric_data","273331376_The_Yarkovsky_effect_for_99942_Apophis","264497941_Non-gravitational_Perturbations_and_Virtual_Impactors_the_case_of_asteroid_2009_FD","260450888_Theory_of_Orbit_Determination","234393301_Close_approaches_of_asteroid_1999_AN10_Resonant_and_non-resonant_returns","326382274_Elementary_Numerical_Analysis_An_Algorithmic_Approach","257308399_Assessment_of_the_2880_impact_threat_from_Asteroid_29075_1950_DA"]}