{"id":"342650572_Current_trends_in_education_technologies_research_worldwide_Meta-analysis_of_studies_between_2015_and_2020","abstract":"The interaction between education and technology affects the developments occurring in two areas and the developments in education increase the speed of technological developments. Educational technology is the functionalisation of the scientific knowledge produced in educational sciences and its application in practice. In this research, the content analysis of the studies conducted in Turkey and abroad in the last 5 years, in order to determine the current trends in educational technology researches, is presented. Within the scope of the purposive sample, the studies published in 2015–2020 in the field of educational technology researches, included in the databases and journals, were examined and interpretations were made. A total of 15 research criteria were determined within the context of content analysis. These criteria are index, country, university, department, year of publication, number of authors, research area, method, educational level, sample group, sample number, data collection method, number of bibliography, analysis techniques and research trends. SPSS 24 program was used in the analysis of the data and the obtained data are presented in the related tables. The data were interpreted based on percentage and frequency. After making general explanations below the tables, the similarities and differences seen in the studies were analysed in detail by using the meta-analysis method. As a result, it was revealed that the most emphasised issue within the scope of the research area was the adequacy of using educational technologies. Keywords: Educational technology research, current trends, meta-analysis.","authors":["Ezgi PELİN Yildiz","Ayse Alkan","Metin Çengel"],"meta":["July 2020New Trends and Issues Proceedings on Humanities and Social Sciences 7(1):47-62","DOI:10.18844/prosoc.v7i1.4867"],"references":["320197576_Trends_and_Issues_in_Educational_Technology_Research_in_Saudi_Higher_Education_A_Meta-Analysis_Review","251713983_Current_trends_in_educational_technologies_studies_presented_in_World_Conferences_on_Educational_Sciences","26517222_TURKIYE'DEKI_EGITIM_TEKNOLOJISI_ARASTIRMALARINDA_GUNCEL_EGILIMLER","26473797_Educational_Technologies_Analysis_of_Master_dissertations_carried_out_in_Portugal","332920190_Research_Trends_in_Educational_Technology_in_Turkey_2010-2018_Year_Thesis_and_Meta-Analysis_of_Articles","255566790_A_Factor_Analysis_of_the_NETS_Performance_Profiles_Searching_for_Constructs_of_Self-Concept_and_Technology_Professionalism"]}