{"id":"342673917_Deep_learning-based_methods_for_individual_recognition_in_small_birds","abstract":"Individual identification is a crucial step to answer many questions in evolutionary biology and is mostly performed by marking animals with tags. Such methods are well‐established, but often make data collection and analyses time‐consuming, or limit the contexts in which data can be collected. Recent computational advances, specifically deep learning, can help overcome the limitations of collecting large‐scale data across contexts. However, one of the bottlenecks preventing the application of deep learning for individual identification is the need to collect and identify hundreds to thousands of individually labelled pictures to train convolutional neural networks (CNNs). Here we describe procedures for automating the collection of training data, generating training datasets, and training CNNs to allow identification of individual birds. We apply our procedures to three small bird species, the sociable weaver Philetairus socius, the great tit Parus major and the zebra finch Taeniopygia guttata, representing both wild and captive contexts. We first show how the collection of individually labelled images can be automated, allowing the construction of training datasets consisting of hundreds of images per individual. Second, we describe how to train a CNN to uniquely re‐identify each individual in new images. Third, we illustrate the general applicability of CNNs for studies in animal biology by showing that trained CNNs can re‐identify individual birds in images collected in contexts that differ from the ones originally used to train the CNNs. Finally, we present a potential solution to solve the issues of new incoming individuals. Overall, our work demonstrates the feasibility of applying state‐of‐the‐art deep learning tools for individual identification of birds, both in the laboratory and in the wild. These techniques are made possible by our approaches that allow efficient collection of training data. The ability to conduct individual recognition of birds without requiring external markers that can be visually identified by human observers represents a major advance over current methods.","authors":["André C. Ferreira","Liliana Silva","Francesco Renna","Hanja B Brandl"],"meta":["July 2020Methods in Ecology and Evolution 11(1)","DOI:10.1111/2041-210x.13436","Project: The sociable weaver project"],"references":["335612032_Chimpanzee_face_recognition_from_videos_in_the_wild_using_deep_learning","332673109_Face_Recognition_Primates_in_the_Wild","332165523_Survey_on_deep_learning_with_class_imbalance","329647674_Past_Present_and_Future_Approaches_Using_Computer_Vision_for_Animal_Re-Identification_from_Camera_Trap_Data","329210510_Machine_learning_to_classify_animal_species_in_camera_trap_images_Applications_in_ecology","325502063_Towards_on-farm_pig_face_recognition_using_convolutional_neural_networks","324000643_Irreproducible_text-book_knowledge_The_effects_of_color_bands_on_zebra_finch_fitness_COLOR_BANDS_HAVE_NO_EFFECT_ON_FITNESS_IN_ZEBRA_FINCHES","334265191_Applications_for_Deep_Learning_in_Ecology","326102350_Estimating_the_robustness_and_uncertainty_of_animal_social_networks_using_different_observational_methods","323965961_An_automated_barcode_tracking_system_for_behavioural_studies_in_birds"]}