{"id":"342626923_Curriculum_conceptions_of_technology_Theoretical_insights_from_National_Education_Policies_in_Brazil_Korea_and_the_United_States","abstract":"Despite its ubiquity in modern life, there presently exists no consensual agreement on what technology is exactly. Striving for theoretical advancement and clarity, this grounded theoretical paper comparatively considers how technology is explicitly defined or implicitly conceptualized in the national education policies of three different countries: Brazil, Korea, and the United States. Serving as a source of theoretical insight, curriculum conceptions of technology are considered in light of scholastic philosophy and academic theorizing about the nature of technology. It is described how curriculum conceptions of technology varies in terms of alignment with humanities‐ or engineering‐oriented philosophical perspectives on technology, in terms of society‐centeredness (technology‐society relations) or learner‐centeredness (technology‐self relations), and in terms of prioritizing preparation of informed users or producers/creators of technology. Despite such variations, several common themes are noticeable, including a strong emphasis on the latest technologies, the creative side of technological design, and a tendency to conceive of technology computationally. It is argued that comparing the national curricula of different countries offers a unique opportunity to examine diverse perspectives on technology and potentially advance deliberations about its nature. International comparison also provides a broader and richer context for theorizing about the ontological status of such an important and yet elusive human endeavor.","authors":["Alandeom Oliveira","Erin Schneider","Yanghyun Kim"],"meta":["July 2020Human Behavior and Emerging Technologies 2(3)","DOI:10.1002/hbe2.204"],"references":["324247158_The_Development_and_the_Validation_of_Six_Core_Competencies_Measurement_Scale_for_High_School_Students_in_Korea","312626867_The_Philosophy_of_Computer_Science","346708779_Current_Praxis_and_Conceptualization_of_STEM_Education_A_Call_for_Greater_Clarity_in_Integrated_Curriculum_Development","332703384_Emerging_technologies_as_pedagogical_tools_for_teaching_and_learning_science_A_literature_review","331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","328996922_What_is_technology_Development_and_evaluation_of_a_simple_instrument_for_measuring_children's_conceptions_of_technology","326231493_Ideological_roots_and_uncontrolled_flowering_of_alternative_curriculum_conceptions","321564229_The_Moral_Status_of_Technical_Artefacts","321523977_Curriculum_Landscapes_and_Trends","310743832_Ten_Lessons_for_Computer_Science_for_All"]}