{"id":"342616247_Association_between_mobility_patterns_and_COVID-19_transmission_in_the_USA_a_mathematical_modelling_study","abstract":"Background\nWithin 4 months of COVID-19 first being reported in the USA, it spread to every state and to more than 90% of all counties. During this period, the US COVID-19 response was highly decentralised, with stay-at-home directives issued by state and local officials, subject to varying levels of enforcement. The absence of a centralised policy and timeline combined with the complex dynamics of human mobility and the variable intensity of local outbreaks makes assessing the effect of large-scale social distancing on COVID-19 transmission in the USA a challenge.\n\nMethods\nWe used daily mobility data derived from aggregated and anonymised cell (mobile) phone data, provided by Teralytics (Zürich, Switzerland) from Jan 1 to April 20, 2020, to capture real-time trends in movement patterns for each US county, and used these data to generate a social distancing metric. We used epidemiological data to compute the COVID-19 growth rate ratio for a given county on a given day. Using these metrics, we evaluated how social distancing, measured by the relative change in mobility, affected the rate of new infections in the 25 counties in the USA with the highest number of confirmed cases on April 16, 2020, by fitting a statistical model for each county.\n\nFindings\nOur analysis revealed that mobility patterns are strongly correlated with decreased COVID-19 case growth rates for the most affected counties in the USA, with Pearson correlation coefficients above 0·7 for 20 of the 25 counties evaluated. Additionally, the effect of changes in mobility patterns, which dropped by 35–63% relative to the normal conditions, on COVID-19 transmission are not likely to be perceptible for 9–12 days, and potentially up to 3 weeks, which is consistent with the incubation time of severe acute respiratory syndrome coronavirus 2 plus additional time for reporting. We also show evidence that behavioural changes were already underway in many US counties days to weeks before state-level or local-level stay-at-home policies were implemented, implying that individuals anticipated public health directives where social distancing was adopted, despite a mixed political message.\n\nInterpretation\nThis study strongly supports a role of social distancing as an effective way to mitigate COVID-19 transmission in the USA. Until a COVID-19 vaccine is widely available, social distancing will remain one of the primary measures to combat disease spread, and these findings should serve to support more timely policy making around social distancing in the USA in the future.\n\nFunding\nNone.","authors":["Hamada S Badr","Hongru Du","Maximilian Marshall","Ensheng Dong"],"meta":["July 2020The Lancet Infectious Diseases 20(11)","DOI:10.1016/S1473-3099(20)30553-3"],"references":["340957333_Epidemiology_and_transmission_of_COVID-19_in_391_cases_and_1286_of_their_close_contacts_in_Shenzhen_China_a_retrospective_cohort_study","340640824_Projecting_the_transmission_dynamics_of_SARS-CoV-2_through_the_postpandemic_period","340406340_Only_strict_quarantine_measures_can_curb_the_coronavirus_disease_COVID-19_outbreak_in_Italy_2020","340328356_An_investigation_of_transmission_control_measures_during_the_first_50_days_of_the_COVID-19_epidemic_in_China","340180593_The_effect_of_human_mobility_and_control_measures_on_the_COVID-19_epidemic_in_China","339879905_Early_dynamics_of_transmission_and_control_of_COVID-19_a_mathematical_modelling_study","339757623_The_effect_of_travel_restrictions_on_the_spread_of_the_2019_novel_coronavirus_COVID-19_outbreak","339581314_Clinical_Characteristics_of_Coronavirus_Disease_2019_in_China","339438718_Quantifying_the_association_between_domestic_travel_and_the_exportation_of_novel_coronavirus_2019-nCoV_cases_from_Wuhan_China_in_2020_A_correlational_analysis","338904336_Early_Transmission_Dynamics_in_Wuhan_China_of_Novel_Coronavirus-Infected_Pneumonia","340108912_Aggregated_mobility_data_could_help_fight_COVID-19","339828677_The_Incubation_Period_of_Coronavirus_Disease_2019_COVID-19_From_Publicly_Reported_Confirmed_Cases_Estimation_and_Application","339369121_An_interactive_web-based_dashboard_to_track_COVID-19_in_real_time","338959825_First_Case_of_2019_Novel_Coronavirus_in_the_United_States"]}