{"id":"342726819_Impact_of_Field_of_Study_Trend_on_Scientific_Articles","abstract":"The volume and diversity of scientific literature have been increasing day by day and millions of new scientific articles are published each year. Researchers work and publish in their respective fields of interest. A major portion of the scientific community publishing in the same field of interest forms a trend in the field which could be deemed as relatively more popular than other trends. A novice researcher chooses his field of interest based upon its popularity. This may have a positive impact on the acceptance of a study or high count of citations in future. This study identifies how significant it is to follow a research trend and the impact of the field of study (FoS) trend on research paper citations. For this purpose, we have chosen the field of Computer Science and Microsoft Academic Graph (MAG) dataset from the 2007 to 2015 time period. In the dataset, every paper has a list of fields of study. The FoS provided in MAG is systematized hierarchically into 4 levels; level-0 – level-3. In this study, we have applied the clustering technique to the FoS and citations pattern separately. Likewise, we also analyzed how papers following a FoS trend, gain citations over the time. We have also introduced a novel method Field of Study Multigraph (FoM) using graph centrality measures degree, betweenness and closeness to analyze the FoS trend, citation trend, and the relation between research areas in scientific articles from the domain of Computer Science. The experimental results show that the FoS has some impact on citation count. Furthermore, the results depict that if papers belong to the same FoS, then there are 66% of the chances of having a similar citation pattern and that they have the same citation trend as they also have achieved a high correlation value. This proves that FoS has a certain impact on the citation count of a paper and researchers should contemplate on the FoS trend before selecting a particular research area.","authors":["Lubna Zafar","Nayyer Masood"],"meta":["July 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3007558"],"references":["320014285_Trends_in_scientific_research_in_Online_Information_Review_Part_2_Mapping_the_scientific_knowledge_through_bibliometric_and_social_network_analyses","318185893_Exploring_time_factors_in_measuring_the_scientific_impact_of_scholars","328519461_To_Cluster_or_Not_to_Cluster_An_Analysis_of_Clusterability_Methods","316986983_Using_Text_Mining_Techniques_to_Identify_Research_Trends_A_Case_Study_of_Design_Research","312831218_Trend-Based_Citation_Count_Prediction_for_Research_Articles","308134244_An_Analysis_of_the_Microsoft_Academic_Graph","307822863_An_Overview_of_Microsoft_Academic_Service_MAS_and_Applications","305998245_The_Problem_of_Categorizing_Conferences_in_Computer_Science","303914328_Mapping_the_evolution_of_scientific_fields_based_on_cross-field_authors","284723640_Predicting_Citation_Counts_for_Academic_Literature_Using_Graph_Pattern_Mining","275335177_The_Leiden_Manifesto_for_research_metrics","275240872_The_Correlation_Study_of_Interest_at_Physics_and_Knowledge_of_Mathematics_Basic_Concepts_towards_the_Ability_to_Solve_Physics_Problems_of_7th_Grade_Students_at_Junior_High_School_in_Ambon_Maluku_Provi","270980251_Analyzing_Structural_Temporal_Characteristics_of_Keyword_System_in_Academic_Research_Articles","281615784_Should_conferences_meet_journals_and_where","281352071_A_bibliometric_analysis_of_waste_management_research_during_the_period_1997-2014"]}