{"id":"342711123_Unspoken_Assumptions_in_Multi-layer_Modularity_maximization","abstract":"A principled approach to recover communities in social networks is to find a clustering of the network nodes into modules (i.e groups of nodes) for which the modularity over the network is maximal. This guarantees partitioning the network nodes into sparsely connected groups of densely connected nodes. A popular extension of modularity has been proposed in the literature so it applies to multi-layer networks, that is, networks that model different types/aspects of interactions among a set of actors. In this extension, a new parameter, the coupling strength ω, has been introduced to couple different copies (i.e nodes) of the same actor with specific weights across different layers. This allows two nodes that refer to the same actor to reward the modularity score with an amount proportional to ω when they appear in the same community. While this extension seems to provide an effective tool to detect communities in multi-layer networks, it is not always clear what kind of communities maximising the generalised modularity can identify in multi-layer networks and whether these communities are inclusive to all possible community structures possible to exist in multi-layer networks. In addition, it has not been thoroughly investigated yet how to interpret ω in real-world scenarios, and whether a proper tuning of ω, if exists, is enough to guarantee an accurate recoverability for different types of multi-layer community structures. In this article, we report the different ways used in the literature to tune ω. We analyse different community structures that can be recovered by maximising the generalised modularity in relation to ω. We propose different models for multi-layer communities in multiplex and time-dependent networks and test if they are recoverable by modularity-maximization community detection methods under any assignment of ω. Our main finding is that only few simple models of multi-layer communities in multiplex and time-dependent networks are recoverable by modularity maximisation methods while more complex models are not accurately recoverable under any assignment of ω.","authors":["Obaida Hanteer","Matteo Magnani"],"meta":["July 2020Scientific Reports 10(1):11053","DOI:10.1038/s41598-020-66956-0"],"references":["316617870_Stochastic_Block_Model_Reveals_the_Map_of_Citation_Patterns_and_Their_Evolution_in_Time","307545285_Multi-scale_brain_networks","305821046_How_Structured_Is_the_Entangled_Bank_The_Surprisingly_Simple_Organization_of_Multiplex_Ecological_Networks_Leads_to_Increased_Persistence_and_Resilience","350018474_An_Innovative_Way_to_Model_Twitter_Topic-Driven_Interactions_Using_Multiplex_Networks","338619641_The_meaning_of_dissimilar_an_evaluation_of_various_similarity_quantification_approaches_used_to_evaluate_community_detection_solutions","325742135_Multilayer_social_networks","321210407_Constrained_information_flows_in_temporal_networks_reveal_intermittent_communities","318069927_Mining_Community_Structures_in_Multidimensional_Networks","312091556_Community_detection_link_prediction_and_layer_interdependence_in_multilayer_networks","306377122_Generative_Benchmark_Models_for_Mesoscale_Structures_in_Multilayer_Networks"]}