{"id":"342757176_Automating_the_Formulation_and_Resolution_of_Convex_Variational_Problems_Applications_from_Image_Processing_to_Computational_Mechanics","abstract":"Convex variational problems arise in many fields ranging from image processing to fluid and solid mechanics communities. Interesting applications usually involve non-smooth terms, which require well-designed optimization algorithms for their resolution. The present manuscript presents the Python package called fenics_optim built on top of the FEniCS finite element software, which enables one to automate the formulation and resolution of various convex variational problems. Formulating such a problem relies on FEniCS domain-specific language and the representation of convex functions, in particular, non-smooth ones, in the conic programming framework. The discrete formulation of the corresponding optimization problems hinges on the finite element discretization capabilities offered by FEniCS, while their numerical resolution is carried out by the interior-point solver Mosek. Through various illustrative examples, we show that convex optimization problems can be formulated using only a few lines of code, discretized in a very simple manner, and solved extremely efficiently.","authors":["Jeremy Bleyer"],"meta":["May 2020ACM Transactions on Mathematical Software 46(3)","DOI:10.1145/3393881","Projects: Solid mechanics computations using FEniCSNumerical limit analysis"],"references":["339007426_Crouzeix-Raviart_Approximation_of_the_Total_Variation_on_Simplicial_Meshes","321066801_Advances_in_the_simulation_of_viscoplastic_fluid_flows_using_interior-point_methods","311577623_Bingham's_heritage","307995327_The_FEniCS_project_version_15","303384422_DOLFIN_Automated_finite_element_computing","331038077_Computational_Optimal_Transport_With_Applications_to_Data_Science","330689037_Nonsmooth_mechanics_and_convex_optimization","321512672_Numerical_Methods_for_Nonlinear_Variational_Problems","302239366_UFL_A_finite_element_form_language","281510608_DOLFIN_a_CPython_finite_element_library"]}