{"id":"342742487_The_Nature_of_STEM_Disciplines_in_the_Science_Education_Standards_Documents_from_the_USA_Korea_and_Taiwan_Focusing_on_Disciplinary_Aims_Values_and_Practices","abstract":"Understanding the nature of science (NOS) has emerged as a core curricular goal since at least the 1960s. While science education reforms around the world have shed light on various epistemic and social underpinnings of science, how science curriculum documents portray the nature of other related disciplines such as mathematics and engineering has drawn little attention. Such lack of attention is surprising, given the growing interest among educators in the integrated approach to science, technology, engineering and mathematics (STEM) education and the frequent emphasis on STEM in recent curriculum policy. The study reported in this paper aimed to understand how recent science education reform documents from the USA, Korea and Taiwan compare with regard to their representation of the nature of STEM disciplines. Using the framework of the family resemblance approach (FRA), we present a comparative analysis of three recent science education standards documents to examine their coverage of the epistemic underpinnings of STEM disciplines, particularly with regard to the disciplinary aims, values and practices. The results indicate that the features specific to science and shared by science and engineering were most frequently addressed in the standards documents, whereas mathematics-related features were rarely mentioned. Furthermore, there was variation in the coverage in terms of the nature of STEM disciplines. Based on the findings, we discuss the contributions of the FRA framework in analysing STEM curricula in an interdisciplinary manner and make suggestions for integrating the nature of STEM disciplines in science curriculum documents.","authors":["Wonyong Park","Jen-Yi Wu","Sibel Erduran"],"meta":["August 2020Science & Education 29(7)","DOI:10.1007/s11191-020-00139-1"],"references":["338826660_Eliciting_students'_understanding_of_nature_of_science_with_text-based_tasks_insights_from_new_Korean_high_school_textbooks","337228508_When_Modern_Physics_Meets_Nature_of_Science_The_Representation_of_Nature_of_Science_in_General_Relativity_in_New_Korean_Physics_Textbooks","333653667_Investigating_Coherence_About_Nature_of_Science_in_Science_Curriculum_Documents","333216987_Between_realism_and_constructivism","347918107_Investigating_the_Epistemic_Nature_of_STEM_Analysis_of_Science_Curriculum_Documents_from_the_USA_Using_the_Family_Resemblance_Approach","344337454_Nature_of_Science_for_Social_Justice","343975749_Influence_of_a_Reflective_Explicit_Activity-Based_Approach_on_Elementary_Teachers'_Conceptions_of_Nature_of_Science","332865294_Contributions_of_the_Family_Resemblance_Approach_to_Nature_of_Science_in_Science_Education_A_Review_of_Emergent_Research_and_Development","332279831_What_are_we_talking_about_when_we_talk_about_STEM_education_A_review_of_literature","332174627_Representations_of_nature_of_science_in_US_science_standards_A_historical_account_with_contemporary_implications"]}