{"id":"342733649_Quantifying_the_Sensitivity_to_Errors_in_Analog_Quantum_Simulation","abstract":"Quantum simulators are widely seen as one of the most promising near-term applications of quantum technologies. However, it remains unclear to what extent a noisy device can output reliable results in the presence of unavoidable imperfections. Here we propose a framework to characterize the performance of quantum simulators by linking robustness of quantum expectation values to the spectral properties of the output observable, which in turn can be associated with its macroscopic or microscopic character. We show that, under general assumptions and on average over all states, imperfect devices are able to reproduce the dynamics of macroscopic observables accurately, while the relative error in the expectation value of microscopic observables is much larger on average. We experimentally demonstrate the universality of these features in a state-of-the-art quantum simulator and show that the predicted behavior is generic for a highly accurate device, without assuming any knowledge about the nature of the imperfections.","authors":["Pablo Poggi","Nathan K. Lysne","Kevin W. Kuper","Ivan Deutsch"],"meta":["July 2020","DOI:10.1103/PRXQuantum.1.020308","Project: Impact of errors in analog quantum information processing"],"references":["348214979_Classical_algorithms_for_quantum_mean_values","346074253_Dynamical_structure_factors_of_dynamical_quantum_simulators","340955425_Predicting_Many_Properties_of_a_Quantum_System_from_Very_Few_Measurements","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336373495_Analogue_quantum_chemistry_simulation","335942769_Digital_quantum_simulation_Trotter_errors_and_quantum_chaos_of_the_kicked_top","342074693_Small_Highly_Accurate_Quantum_Processor_for_Intermediate-Depth_Quantum_Simulations","340112659_Relaxation_Theory_for_Perturbed_Many-Body_Quantum_Systems_versus_Numerics_and_Experiment","338069615_Quantum_Computers_as_Universal_Quantum_Simulators_State-of-the-Art_and_Perspectives","337074015_Optimized_sampling_of_mixed-state_observables"]}