{"id":"342754411_Innovations_for_Sustainability_Pathways_to_an_efficient_and_sufficient_post-pandemic_future","abstract":"Innovation has been the foundation of human and societal development since the dawn of civilization. It has resulted in enormous benefits for human wellbeing while at the same time is has brought the world to a critical crossroads where further unconstrained development risks societal and environmental collapse. The current rate and direction of innovation is insufficient to achieve the United Nation’s (UN) ambitious goals for an inclusive sustainable future for all, in part because of a relatively narrow focus on technology innovation without also addressing societal, institutional, and cultural innovation. We need to rebalance so that all dimensions of innovation and invention are promoted simultaneously, including addressing inequities. We also need to develop more proactive efforts to promote diffusion and learning, and to address barriers, constraints, and unintended consequences of innovations.\nWe live in interesting times. They are times of great dangers and uncertainty for humanity and the planet, but times of unprecedented opportunities for directing development toward a just, resilient, and sustainable future. The current coronavirus disease 2019 (COVID-19) pandemic is disrupting the status quo, providing an opportunity to create sustainable societies with higher levels of wellbeing for all and mitigating environmental impacts at all scales. Properly directed, the stimulus packages underway to restart economies can ignite and leverage effects toward sustainability. The risk is that they may promote resurrection of the ‘old normal,’ going back to business-as-usual, rather than a transformation toward sustainability.\nThis report, which focuses on innovation, is the third by The World in 2050 (TWI2050) initiative that was established by the International Institute for Applied Systems Analysis (IIASA) and other partners to provide scientific foundations for the UN’s 2030 Agenda for Sustainable Development. This report is based on the voluntary and collaborative effort of more than 60 authors and contributors from about 20 institutions globally, who met virtually to develop science-based strategies and pathways toward achieving the Sustainable Development Goals (SDGs). Presentations of the TWI2050 approach and work have been made at many international conferences such as the United Nations Science, Technology and Innovation Forums and the United Nations High-level Political Forums.","authors":["Nebojsa Nakicenovic et. al","Ilan Chabay","David Collste","Avit K Bhowmik"],"meta":["July 2020","DOI:10.22022/TNT/07-2020.16533","Affiliation: International Institute for Applied Systems Analysis","Projects: The World in 2050The World in 2050"],"references":["344708514_How_the_coronavirus_crisis_affects_citizen_trust_in_institutions_and_in_unknown_others_Evidence_from_'the_Swedish_experiment'","340726937_Satellite_Observations_Reveal_Inequalities_in_the_Progress_and_Effectiveness_of_Recent_Electrification_in_Sub-Saharan_Africa","340668990_Opinion_We_need_a_global_movement_to_transform_ocean_science_for_a_better_world","340611919_The_effect_of_education_on_determinants_of_climate_change_risks","347305111_Trust_and_compliance_to_public_health_policies_in_times_of_COVID-19","345690870_Risk_culture_risk_framing_and_nuclear_energy_dispute_in_Japan_before_and_after_the_Fukushima_nuclear_accident","342021733_The_Ages_of_Globalization_Geography_Technology_and_Institutions","341677723_CoronaCheck_and_Fake_News","341269701_An_Opportunity_to_Build_Legitimacy_and_Trust_in_Public_Institutions_in_the_Time_of_COVID-19","340738413_Structural_breaks_in_CO2_emissions_Are_they_caused_by_climate_change_protests_or_other_factors","340520433_Deciphering_the_scientific_literature_on_SDG_interactions_A_review_and_reading_guide","338884848_Large_inequality_in_international_and_intranational_energy_footprints_between_income_groups_and_across_consumption_categories","338727072_Social_tipping_dynamics_for_stabilizing_Earth's_climate_by_2050","337746542_Greening_through_schooling_Understanding_the_link_between_education_and_pro-environmental_behavior_in_the_Philippines","339604158_French_attitudes_on_climate_change_carbon_taxation_and_other_climate_policies"]}