{"id":"342717154_UTILIZACION_Y_PRODUCCION_DE_VIDEOS_TUTORIALES_EN_MATEMATICA_USING_AND_PRODUCING_TUTORIAL_VIDEOS_IN_MATHEMATICS","abstract":"Resumen El proceso de enseñanza aprendizaje de las asignaturas de Matemática en el primer año de carreras de Ingeniería requiere de estrategias que motiven el aprendizaje de los estudiantes. El presente trabajo describe una estrategia de enseñanza aprendizaje mediante la utilización y producción de videos tutoriales para motivar el aprendizaje de la Matemática. Se incluyen ejemplos de actividades realizadas y los resultados de la aplicación de esta estrategia, mediante el método experimental, en una muestra de estudiantes de primer año N=48, en la carrera Ingeniería en Ciencias Informáticas de la Universidad de las Ciencias Informáticas en La Habana. Se utilizaron tecnologías que la Universidad pone a disposición de estudiantes y profesores, así como dispositivos móviles de los propios estudiantes. Estos desarrollaron los contenidos en archivos de texto, imagen y video utilizando asistentes matemáticos. Se logró la motivación de los estudiantes por el estudio y se elevaron los resultados de promoción en cantidad y calidad. Palabras clave: estrategia de enseñanza aprendizaje, matemática, videos tutoriales Abstract The teaching-learning process of mathematics subjects in the first year of engineering degree courses requires strategies that motivate students' learning. This work describes a teaching-learning strategy through the use and production of tutorial videos to motivate mathematics learning. It includes examples of activities carried out and the outcomes of this strategy implementation, through the experimental method, in a sample of first-year students (N=48) in the Computer Science Engineering degree, at the University of Computer Science, in Havana. Technologies, that the university provides students and teachers with, as well as students' own mobiles were used. The students develop the contents in text, image, and video records, by using mathematical helpers. It made possible to achieve students' learning motivation and to raise the quality and quantity of their academic performance.","authors":["Niurys Lázaro Alvarez"],"meta":["July 2020","Project: La acción tutorial con TIC atendiendo a factores predictivos de deserción estudiantil en carreras de Ingeniería Informática"],"references":["279681083_Nuevas_tecnologias_comunicacion_y_educacion","278455870_Reflexiones_educativas_sobre_las_tecnologias_de_la_informacion_y_la_comunicacion_TIC","273425327_A_New_Teaching_Approach_in_Basic_Sciences_Peer_Assisted_Learning","259006326_Analitica_de_aprendizaje_y_personalizacion_Learning_Analytics_and_Personalization","234719520_Los_seminarios_TAC_Un_reto_de_formacion_para_asegurar_la_dinamizacion_de_las_TAC_en_las_escuelas","28103148_Los_videos_didacticos_claves_para_su_produccion_y_evaluacion"]}