{"id":"342737304_The_implications_of_silent_transmission_for_the_control_of_COVID-19_outbreaks","abstract":"Since the emergence of coronavirus disease 2019 (COVID-19), unprecedented movement restrictions and social distancing measures have been implemented worldwide. The socioeconomic repercussions have fueled calls to lift these measures. In the absence of population-wide restrictions, isolation of infected individuals is key to curtailing transmission. However, the effectiveness of symptom-based isolation in preventing a resurgence depends on the extent of presymptomatic and asymptomatic transmission. We evaluate the contribution of presymptomatic and asymptomatic transmission based on recent individual-level data regarding infectiousness prior to symptom onset and the asymptomatic proportion among all infections. We found that the majority of incidences may be attributable to silent transmission from a combination of the presymptomatic stage and asymptomatic infections. Consequently, even if all symptomatic cases are isolated, a vast outbreak may nonetheless unfold. We further quantified the effect of isolating silent infections in addition to symptomatic cases, finding that over one-third of silent infections must be isolated to suppress a future outbreak below 1% of the population. Our results indicate that symptom-based isolation must be supplemented by rapid contact tracing and testing that identifies asymptomatic and presymptomatic cases, in order to safely lift current restrictions and minimize the risk of resurgence.","authors":["Seyed M. Moghadas","Meagan C Fitzpatrick","Pratha Sah","Abhishek Pandey"],"meta":["July 2020Proceedings of the National Academy of Sciences 117(30):202008373","DOI:10.1073/pnas.2008373117"],"references":["340879546_Spread_and_dynamics_of_the_COVID-19_epidemic_in_Italy_Effects_of_emergency_containment_measures","340654328_Temporal_dynamics_in_viral_shedding_and_transmissibility_of_COVID-19","340423157_Projecting_hospital_utilization_during_the_COVID-19_outbreaks_in_the_United_States","340316786_Quantifying_SARS-CoV-2_transmission_suggests_epidemic_control_with_digital_contact_tracing","340049937_Serial_Interval_of_COVID-19_among_Publicly_Reported_Confirmed_Cases","339964860_Substantial_undocumented_infection_facilitates_the_rapid_dissemination_of_novel_coronavirus_SARS-CoV2","339931981_Estimation_of_the_asymptomatic_ratio_of_novel_coronavirus_infections_COVID-19","339893491_Estimating_the_asymptomatic_proportion_of_coronavirus_disease_2019_COVID-19_cases_on_board_the_Diamond_Princess_cruise_ship_Yokohama_Japan_2020","340521847_Projecting_demand_for_critical_care_beds_during_COVID-19_outbreaks_in_Canada","340369849_Presymptomatic_transmission_of_SARS-CoV-2_-_Singapore_January_23-March_16_2020"]}