{"id":"342769578_The_Born_supremacy_quantum_advantage_and_training_of_an_Ising_Born_machine","abstract":"The search for an application of near-term quantum devices is widespread. Quantum machine learning is touted as a potential utilisation of such devices, particularly those out of reach of the simulation capabilities of classical computers. In this work, we study such an application in generative modelling, focussing on a class of quantum circuits known as Born machines. Specifically, we define a subset of this class based on Ising Hamiltonians and show that the circuits encountered during gradient-based training cannot be efficiently sampled from classically up to multiplicative error in the worst case. Our gradient-based training methods use cost functions known as the Sinkhorn divergence and the Stein discrepancy, which have not previously been used in the gradient-based training of quantum circuits, and we also introduce quantum kernels to generative modelling. We show that these methods outperform the previous standard method, which used maximum mean discrepancy (MMD) as a cost function, and achieve this with minimal overhead. Finally, we discuss the ability of the model to learn hard distributions and provide formal definitions for ‘quantum learning supremacy’. We also exemplify the work of this paper by using generative modelling to perform quantum circuit compilation.","authors":["Brian Coyle","Daniel Mills","Vincent Danos","Elham Kashefi"],"meta":["July 2020npj Quantum Information 6(1):60","DOI:10.1038/s41534-020-00288-9"],"references":["351300489_Robust_implementation_of_generative_modeling_with_parametrized_quantum_circuits","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336628546_Parameterized_quantum_circuits_as_machine_learning_models","333057634_Quantum-assisted_quantum_compiling","347338302_Variational_Quantum_Generators_Generative_Adversarial_Quantum_Machine_Learning_for_Continuous_Distributions","345598040_Supervised_Learning_with_Quantum_Computers","337797833_Quantum_Supremacy_for_Simulating_A_Translation-Invariant_Ising_Spin_Model","333914977_A_quantum-inspired_classical_algorithm_for_recommendation_systems","333865331_Generative_model_benchmarks_for_superconducting_qubits","333461157_Sample_Complexity_of_Device-Independently_Certified_Quantum_Supremacy"]}