{"id":"342774266_Artificial_Intelligence_and_Legal_Disruption_A_New_Model_for_Analysis","abstract":"[Forthcoming in Law, Innovation and Technology]\n\nArtificial intelligence (AI) is increasingly expected to disrupt the ordinary functioning of society. From how we fight wars or govern society, to how we work and play, and from how we create to how we teach and learn, there is almost no field of human activity which is believed to be entirely immune from the impact of this emerging technology. This poses a multifaceted problem when it comes to designing and understanding regulatory responses to AI. This article aims to: (i) defend the need for a novel conceptual model for understanding the systemic legal disruption caused by new technologies such as AI; (ii) to situate this model in relation to preceding debates about the interaction of regulation with new technologies (particularly the 'cyberlaw' and 'robolaw' debates); and (iii) to set out a detailed model for understanding the legal disruption precipitated by AI, examining both pathways stemming from new affordances that can give rise to a regulatory 'disruptive moment', as well as the Legal Development, Displacement or Destruction that can ensue. The article proposes that this model of legal disruption can be broadly generalisable to understanding the legal effects and challenges of other emerging technologies. Thus, while our model of legal disruption is crafted in response to the specific regulatory challenges raised by AI, we believe that, with minor modifications, this model can be usefully deployed to understand the challenges raised by future emerging technologies, and to structure regulatory responses to those challenges.","authors":["Hin-Yan Liu","Matthijs Maas","John Danaher","Luisa Scarcella"],"meta":["July 2020Law Innovation and Technology","DOI:10.1080/17579961.2020.1815402","Project: The Threat of Algocracy"],"references":["324860500_How_Might_Artificial_Intelligence_Affect_the_Risk_of_Nuclear_War","342551406_Artificial_intelligence_and_crime_A_primer_for_criminologists","340553688_Fooling_Automated_Surveillance_Cameras_Adversarial_Patches_to_Attack_Person_Detection","335343424_When_speed_kills_Lethal_autonomous_weapon_systems_deterrence_and_stability","325749336_China's_Social_Credit_System_An_Evolving_Practice_of_Control","314514320_The_Death_of_Rules_and_Standards","306527461_The_path_of_the_law_Towards_legal_singularity"]}