{"id":"342845919_Multi-Image_Super_Resolution_of_Remotely_Sensed_Images_Using_Residual_Attention_Deep_Neural_Networks","abstract":"Convolutional Neural Networks (CNNs) consistently proved state-of-the-art results in image Super-resolution (SR), representing an exceptional opportunity for the remote sensing field to extract further information and knowledge from captured data. However, most of the works published in the literature focused on the Single-image Super-resolution problem so far. At present, satellite-based remote sensing platforms offer huge data availability with high temporal resolution and low spatial resolution. In this context, the presented research proposes a novel residual attention model (RAMS) that efficiently tackles the Multi-image Super-resolution task, simultaneously exploiting spatial and temporal correlations to combine multiple images. We introduce the mechanism of visual feature attention with 3D convolutions in order to obtain an aware data fusion and information extraction of the multiple low-resolution images, transcending limitations of the local region of convolutional operations. Moreover, having multiple inputs with the same scene, our representation learning network makes extensive use of nestled residual connections to let flow redundant low-frequency signals and focus the computation on more important high-frequency components. Extensive experimentation and evaluations against other available solutions, either for Single or Multi-image Super-resolution, demonstrated that the proposed deep learning-based solution can be considered state-of-the-art for Multi-image Super-resolution for remote sensing applications.","authors":["Francesco Salvetti","Vittorio Mazzia","Aleem Khaliq","Marcello Chiaberge"],"meta":["July 2020Remote Sensing 12(14)","DOI:10.3390/rs12142207","Project: AI & Remote Sensing"],"references":["338614748_Sentinel-2_Sharpening_via_Parallel_Residual_Network","337692662_Transferred_Multi-Perception_Attention_Networks_for_Remote_Sensing_Image_Super-Resolution","337191086_Fast_Super-Resolution_of_20_m_Sentinel-2_Bands_Using_Convolutional_Neural_Networks","336388064_Bidirectional_Convolutional_LSTM_Neural_Network_for_Remote_Sensing_Image_Super-Resolution","335453862_Super-resolution_of_PROBA-V_images_using_convolutional_neural_networks","334967565_Deep_Residual_Squeeze_and_Excitation_Network_for_Remote_Sensing_Image_Super-Resolution","357221397_Super-resolution_of_remote_sensing_images_via_a_dense_residual_generative_adversarial_network","338509753_Second-Order_Attention_Network_for_Single_Image_Super-Resolution","338293127_DeepSUM_Deep_Neural_Network_for_Super-Resolution_of_Unregistered_Multitemporal_Images","336861871_Deep_Learning_for_Multiple-Image_Super-Resolution"]}