{"id":"342842327_Adaptive_time_scales_in_recurrent_neural_networks","abstract":"Recent experiments have revealed a hierarchy of time scales in the visual cortex, where different stages of the visual system process information at different time scales. Recurrent neural networks are ideal models to gain insight in how information is processed by such a hierarchy of time scales and have become widely used to model temporal dynamics both in machine learning and computational neuroscience. However, in the derivation of such models as discrete time approximations of the firing rate of a population of neurons, the time constants of the neuronal process are generally ignored. Learning these time constants could inform us about the time scales underlying temporal processes in the brain and enhance the expressive capacity of the network. To investigate the potential of adaptive time constants, we compare the standard approximations to a more lenient one that accounts for the time scales at which processes unfold. We show that such a model performs better on predicting simulated neural data and allows recovery of the time scales at which the underlying processes unfold. A hierarchy of time scales emerges when adapting to data with multiple underlying time scales, underscoring the importance of such a hierarchy in processing complex temporal information.","authors":["Silvan C. Quax","Michele D’Asaro","Marcel A. J. van Gerven"],"meta":["July 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-68169-x"],"references":["328325708_Emergent_mechanisms_of_evidence_integration_in_recurrent_neural_networks","319534205_A_computational_hierarchy_in_human_cortex","345780149_Exploring_Robotic_Minds_Actions_Symbols_and_Consciousness_as_Self-Organizing_Dynamic_Phenomena","336049315_Engineering_a_Less_Artificial_Intelligence","324055230_Long_short-term_memory_and_Learning-to-learn_in_networks_of_spiking_neurons","321605012_Neural_Assemblies_An_Alternative_Approach_to_Artificial_Intelligence","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","318875461_Discovering_Event_Structure_in_Continuous_Narrative_Perception_and_Memory","313188646_The_discharge_of_impulses_in_motor_nerve_fibres_II_The_frequency_of_discharges_in_reflex_and_voluntary_contractions","311830981_Conclusions_Actions_Symbols_and_Consciousness_as_Self-Organizing_Dynamic_Phenomena"]}