{"id":"342868218_Sistem_Pakar_Diagnosa_Penyakit_Pohon_Karet_dengan_Metode_Certainty_Factor","abstract":"The low production of smallholder rubber is caused by various factors, one of the causes is interference from various diseases. Building a system (computer) that is intelligent to analyze problems, observe the work system of an expert or expert. Expertise comes from the development of knowledge of someone who is competent and directly provides instructions to solve a problem. Certainty Factor is a method to prove whether a fact is certain or not certain in the form of metrics that are usually used in expert systems. This method is very suitable for expert systems that diagnose something that is uncertain. To apply the Certainty Factor method to the expert system, data is needed that will be input into the system, processed and display the results of the diagnosis of rubber plant diseases. Input: rubber plant disease type data and disease symptom data. Process: carry out analysis and calculation to get the diagnosis results using the Certainty Factor method. Output: information on the diagnosis of rubber plant diseases and percentage of confidence level in the diagnosis results in accordance with the rules of the Certainty Factor method.\n\nKeywords : Rubber Disease, Symptoms Diagnosis, Value Combination, Certainty Factor","authors":["Richard Jiswi Sinaga"],"meta":["December 2019JISKA (Jurnal Informatika Sunan Kalijaga) 4(2):19","DOI:10.14421/jiska.2019.42-03"],"references":["337983299_Sistem_Pakar_Diagnosa_Penyakit_Gigi_Menggunakan_Metode_Naive_Bayes","323656759_Sistem_Pakar_untuk_Mengidentifikasi_Kerusakan_Mesin_Industri_Menggunakan_Metode_Certainty_Factor","301548549_Penerapan_Metode_Certainty_Factor_dalam_Sistem_Pakar_Pendeteksi_Resiko_Osteoporosis_dan_Osteoarthritis","337601901_Analisis_Metode_Certainty_Factor_pada_Sistem_Pakar_Diagnosa_Penyakit_THT","328931759_Penerapan_Metode_Naive_Bayes_Dalam_Pemilihan_Kualitas_Jenis_Rumput_Taman_CV_Rumput_Kita_Landscape","325375262_Sistem_Pakar_Diagnosis_Penyakit_dan_Hama_Pada_Tanaman_Tebu_Menggunakan_Metode_Certainty_Factor"]}