{"id":"342802332_BOT_the_Building_Topology_Ontology_of_the_W3C_Linked_Building_Data_Group","abstract":"Actors in the Architecture, Engineering, Construction, Owner and Operation (AECOO) industry traditionally exchange building models as files. The Building Information Modelling (BIM) methodology advocates the seamless exchange of all information between related stakeholders using digital technologies. The ultimate evolution of the methodology, BIM Maturity Level 3, envisions interoperable, distributed, web-based, interdisciplinary information exchange among stakeholders across the life-cycle of buildings. The World Wide Web Consortium Linked Building Data Community Group (W3C LBD-CG) hypothesises that the Linked Data models and best practices can be leveraged to achieve this vision in modern web-based applications. In this paper, we introduce the Building Topology Ontology (BOT) as a core vocabulary to this approach. It provides a high-level description of the topology of buildings including storeys and spaces, the building elements they contain, and their web-friendly 3D models. We describe how existing applications produce and consume datasets combining BOT with other ontologies that describe product catalogues, sensor observations, or Internet of Things (IoT) devices effectively implementing BIM Maturity Level 3. We evaluate our approach by exporting and querying three real-life large building models.\n\nFree download: http://www.semantic-web-journal.net/system/files/swj2279.pdf","authors":["Mads Holten Rasmussen","Maxime Lefrançois","Georg Ferdinand Schneider","Pieter Pauwels"],"meta":["November 2020Semantic Web","DOI:10.3233/SW-200385"],"references":["346007434_Building_Information_Modeling_BIM_for_LEED_IEQ_category_prerequisites_and_credits_calculations","334130942_Automated_Ontology_Matching_in_the_Architecture_Engineering_and_Construction_Domain_-_A_Case_Study","327703919_Demo_Integrating_Building_Information_Modeling_and_Sensor_Observations_using_Semantic_Web","327262321_The_IFC_to_Linked_Building_Data_Converter-Current_Status","327216264_Semantic_technologies_and_interoperability_in_the_built_environment","326965970_BimSPARQL_Domain-specific_functional_SPARQL_extensions_for_querying_RDF_building_data","326930517_OPM_An_ontology_for_describing_properties_that_evolve_over_time","330236423_Managing_space_requirements_of_new_buildings_using_linked_building_data_technologies","330229378_Linked_building_data_for_modular_building_information_modelling_of_a_smart_home","330229264_A_novel_workflow_to_combine_BIM_and_linked_data_for_existing_buildings"]}