{"id":"342800521_Exploration_Based_Language_Learning_for_Text-Based_Games","abstract":"This work presents an exploration and imitation-learning-based agent capable of state-of-the-art performance in playing text-based computer games. These games are of interest as they can be seen as a testbed for language understanding, problem-solving, and language generation by artificial agents. Moreover, they provide a learning setting in which these skills can be acquired through interactions with an environment rather than using fixed corpora. One aspect that makes these games particularly challenging for learning agents is the combinatorially large action space. Existing methods for solving text-based games are limited to games that are either very simple or have an action space restricted to a predetermined set of admissible actions. In this work, we propose to use the exploration approach of Go-Explore for solving text-based games. More specifically, in an initial exploration phase, we first extract trajectories with high rewards, after which we train a policy to solve the game by imitating these trajectories. Our experiments show that this approach outperforms existing solutions in solving text-based games, and it is more sample efficient in terms of the number of interactions with the environment. Moreover, we show that the learned policy can generalize better than existing solutions to unseen games without using any restriction on the action space.","authors":["Andrea Madotto","Mahdi Namazifar","Joost Huizinga","Piero Molino"],"meta":["July 2020","DOI:10.24963/ijcai.2020/207","Conference: Twenty-Ninth International Joint Conference on Artificial Intelligence and Seventeenth Pacific Rim International Conference on Artificial Intelligence {IJCAI-PRICAI-20}"],"references":["321902735_Improving_Exploration_in_Evolution_Strategies_for_Deep_Reinforcement_Learning_via_a_Population_of_Novelty-Seeking_Agents","306093902_Deep_Reinforcement_Learning_with_a_Natural_Language_Action_Space","284576917_Glove_Global_Vectors_for_Word_Representation","334844115_A_Survey_of_Reinforcement_Learning_Informed_by_Natural_Language","334602152_Playing_Text-Adventure_Games_with_Graph-Based_Deep_Reinforcement_Learning","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319284083_Curiosity-Driven_Exploration_by_Self-Supervised_Prediction","318829407_What_Can_You_Do_with_a_Rock_Affordance_Extraction_via_Word_Embeddings","309730604_Learning_to_Win_by_Reading_Manuals_in_a_Monte-Carlo_Framework","308039399_Reinforcement_Learning_and_Episodic_Memory_in_Humans_and_Animals_An_Integrative_Framework"]}