{"id":"342801669_Entorno_de_Aprendizaje_3D_no_Inmersivo_como_apoyo_al_componente_informatico","abstract":"This article presents the results of the research process obtained by implementing a non-immersive 3D learning environment to support the autonomy of university students in the Computer Science course. The research was developed through a quantitative approach, regarding the analytical empirical method, through a type of correlational research with an experimental design with pre-test and posttest comparing a control group and an experimental group based on G1 O1 X O2 and G2 O3 - O4. The high levels of interactivity presented in the experimental group of students when interacting with the 3D learning environment lead to an improvement in their academic performance compared to the control group by strengthening their self-learning processes. Also, the data obtained were analyzed with parametric analysis techniques through which it was found that the difference in terms of the quantitative results regarding both, the experimental group and the control group was statistically significant, highlighting the success of the experimental treatment","authors":["Javier Alejandro Jiménez Toledo"],"meta":["July 2020Avances Investigación en Ingeniería 17(1)","DOI:10.18041/1794-4953/avances.2.5491","Project: System engineer profile"],"references":["325726997_EnsenAPP_Aplicacion_Educativa_de_Realidad_Aumentada_para_el_Primer_ciclo_de_Educacion_Primaria","262700691_Entornos_Virtuales_3D_Alternativa_Pedagogica_para_el_Fomento_del_Aprendizaje_Colaborativo_y_Gestion_del_Conocimiento_en_Uniminuto","234638127_Multi-User_Virtual_Environments_for_Education_and_Training_A_Critical_Review_of_Second_Life","267381724_EL_ESTUDIO_INDEPENDIENTE_EN_UNA_VISION_SISTEMICA_DE_LA_EDUCACION_A_DISTANCIA","265397811_Communal_Constructivism_An_appropriate_pedagogy_for_use_in_Multi-User_Virtual_Environments","47649797_Estrategias_docentes_para_un_aprendizaje_significativo_una_interpretacion_constructivista_F_Diaz_Barriga_Arceo_F_Hernandez_Rojas"]}