{"id":"342826466_Quantum_Computing_A_New_Software_Engineering_Golden_Age","abstract":"Quantum computing, and to an even greater extent quantum technology, is changing the world. Quantum computing is not an evolution of classical computer science; it is actually a revolution that completely changes the computing paradigm. Quantum computers are based on the principles of quantum mechanics, such as superposition and entanglement, and they seek to boost computational power exponentially. Many problems that have until now been impossible to solve, in practical terms, might very well be able to be addressed by means of quantum computing. The fact is that at the present time quantum computing is influencing most business sectors and research fields, due to its various promising applications. To make such applications become reality, quantum algorithms must be specially coded for these extremely different computers. Although some well-known quantum algorithms already exist, the need for quantum software will increase dramatically in the next years. In that context, quantum software has to be produced in a more industrial and controlled way, i.e., aspects such as quality, delivery, project management, or evolution of quantum software must be addressed. We are sure that quantum computing will be the main driver for a new software engineering golden age during the present decade of the 2020s.","authors":["Mario Piattini","Guido Peterssen Nodarse","Ricardo Pérez-Castillo"],"meta":["July 2020ACM SIGSOFT Software Engineering Notes 45(3):12-14","DOI:10.1145/3402127.3402131","Projects: Hybrid classical-quantum computingQuantum software workforce: competences and training"],"references":["339780973_The_Talavera_Manifesto_for_Quantum_Software_Engineering_and_Programming","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","283986576_Quantum_algorithms_An_overview","279754472_Continuous_Software_Engineering_A_Roadmap_and_Agenda","220594831_Journeys_in_non-classical_computation_I_A_grand_challenge_for_computing_research","327922826_The_History_of_Software_Engineering","319683702_Programming_languages_and_compiler_design_for_realistic_quantum_hardware","314229608_Commercialize_early_quantum_technologies","291942453_Simulating_Physics_with_Computers","221554200_A_view_of_20th_and_21st_century_software_engineering"]}