{"id":"342814042_Object_detection_based_on_an_adaptive_attention_mechanism","abstract":"Object detection is an important component of computer vision. Most of the recent successful object detection methods are based on convolutional neural networks (CNNs). To improve the performance of these networks, researchers have designed many different architectures. They found that the CNN performance benefits from carefully increasing the depth and width of their structures with respect to the spatial dimension. Some researchers have exploited the cardinality dimension. Others have found that skip and dense connections were also of benefit to performance. Recently, attention mechanisms on the channel dimension have gained popularity with researchers. Global average pooling is used in SENet to generate the input feature vector of the channel-wise attention unit. In this work, we argue that channel-wise attention can benefit from both global average pooling and global max pooling. We designed three novel attention units, namely, an adaptive channel-wise attention unit, an adaptive spatial-wise attention unit and an adaptive domain attention unit, to improve the performance of a CNN. Instead of concatenating the output of the two attention vectors generated by the two channel-wise attention sub-units, we weight the two attention vectors based on the output data of the two channel-wise attention sub-units. We integrated the proposed mechanism with the YOLOv3 and MobileNetv2 framework and tested the proposed network on the KITTI and Pascal VOC datasets. The experimental results show that YOLOv3 with the proposed attention mechanism outperforms the original YOLOv3 by mAP values of 2.9 and 1.2% on the KITTI and Pascal VOC datasets, respectively. MobileNetv2 with the proposed attention mechanism outperforms the original MobileNetv2 by a mAP value of 1.7% on the Pascal VOC dataset.","authors":["Wei Li","Kai Liu","Lizhe Zhang","Fei Cheng"],"meta":["July 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-67529-x"],"references":["339561485_Searching_for_MobileNetV3","339554747_Gaussian_YOLOv3_An_Accurate_and_Fast_Object_Detector_Using_Localization_Uncertainty_for_Autonomous_Driving","338513445_Towards_Universal_Object_Detection_by_Domain_Attention","337627035_Scale_Specified_Single_Shot_MultiBox_Detector","329745476_Cascade_R-CNN_Delving_Into_High_Quality_Object_Detection","329740282_MobileNetV2_Inverted_Residuals_and_Linear_Bottlenecks","328115637_Receptive_Field_Block_Net_for_Accurate_and_Fast_Object_Detection_15th_European_Conference_Munich_Germany_September_8-14_2018_Proceedings_Part_XI","324387691_YOLOv3_An_Incremental_Improvement","321512547_Cascade_R-CNN_Delving_into_High_Quality_Object_Detection","321210791_Receptive_Field_Block_Net_for_Accurate_and_Fast_Object_Detection"]}