{"id":"342826995_The_Relation_between_Sustainable_Development_Trends_and_Customer_Value_Management","abstract":"The sustainable development movement is an essential trend that can resist the excessive consumption and over-exploitation of resources. There have been considerable changes in the perception of the term “sustainable development” over the last 30 years. Difficulties in implementing the principles of rational use of natural resources have resulted from a general conflict between the objectives of economic development and the increasing dynamics of industrial production, the quality of the environment and the objectives of environmental protection. This research goal was to describe ways of linking sustainable development trends and the customer value management process. Research also aimed to indicate what this relationship drives. In order to process the collected individual in-depth interview (IDI) material, the author applied a qualitative analysis. As a result of the exploratory research, it was found that there is no complete agreement on who is responsible for implementing the sustainable development assumptions: producers or customers. However, the process of linking sustainable development trends and customer value management can be pointed out. According to this study, as those who make purchasing decisions, customers are the axis of this relationship. On the basis of the results of this research, as long as customers buy particular products, they will be offered by producers.","authors":["Monika Spychalska-Wojtkiewicz"],"meta":["July 2020Sustainability 12(14):5496","DOI:10.3390/su12145496"],"references":["341457778_Cooperatives_and_Sustainable_Development_A_Multilevel_Approach_Based_on_Intangible_Assets","341457434_The_Moderating_Effect_of_Social_Media_Use_on_Sustainable_Rural_Tourism_A_Theory_of_Planned_Behavior_Model","341420880_Transformative_Policies_for_the_Social_and_Solidarity_Economy_The_New_Generation_of_Public_Policies_Fostering_the_Social_Economy_in_Order_to_Achieve_Sustainable_Development_Goals_The_European_and_Span","341332552_Sustainable_and_Community-Centred_Development_of_Smart_Cities_and_Villages","341032574_UnSustainable_Creativity_Different_Manager-Employee_Perspectives_in_the_Finnish_Technology_Sector","338914711_Ekonomia_doswiadczen_w_kontekscie_wyzwan_wspolczesnej_gospodarki","338393150_Managing_Sustainable_Innovation","335935836_Social_Responsibility_and_Loyalty_in_Public_Relations_Codes","338314861_Leadership_for_Sustainability_Connecting_Corporate_Responsibility_Reporting_and_Strategy","336871991_Design_thinking_in_customer_experience_management"]}