{"id":"342890639_Automatic_image-based_identification_and_biomass_estimation_of_invertebrates","abstract":"Understanding how biological communities respond to environmental changes is a key challenge in ecology and ecosystem management. The apparent decline of insect populations necessitates more biomonitoring but the time‐consuming sorting and expert‐based identification of taxa pose strong limitations on how many insect samples can be processed. In turn, this affects the scale of efforts to map and monitor invertebrate diversity altogether. Given recent advances in computer vision, we propose to enhance the standard human expert‐based identification approach involving manual sorting and identification with an automatic image‐based technology. We describe a robot‐enabled image‐based identification machine, which can automate the process of invertebrate sample sorting, specimen identification and biomass estimation. We use the imaging device to generate a comprehensive image database of terrestrial arthropod species which is then used to test classification accuracy, that is, how well the species identity of a specimen can be predicted from images taken by the machine. We also test sensitivity of the classification accuracy to the camera settings (aperture and exposure time) to move forward with the best possible image quality. We use state‐of‐the‐art Resnet‐50 and InceptionV3 convolutional neural networks for the classification task. The results for the initial dataset are very promising as we achieved an average classification accuracy of 0.980. While classification accuracy is high for most species, it is lower for species represented by less than 50 specimens. We found significant positive relationships between mean area of specimens derived from images and their dry weight for three species of Diptera. The system is general and can easily be used for other groups of invertebrates as well. As such, our results pave the way for generating more data on spatial and temporal variation in invertebrate abundance, diversity and biomass. En central udfordring for naturforvaltning og forskning i biodiversitet er, at forstå hvordan arter reagerer på miljøvariation. I lyset af globale nedgange i insektbestande er der brug for en større moniteringsindsats, men manuel sortering og ekspert‐baseret insektbestemmelse sætter store begrænsninger for hvor mange prøver, der kan behandles. Dermed sænkes det samlede ambitionsniveau, når det gælder kortlægning og monitering af invertebrater, da mange prøver slet ikke bliver indsamlet. De store landvindinger indenfor billedgenkendelse og kunstig intelligens, der er gjort i de senere år, motiverer os til at foreslå at insektbestemmelse kan gøres langt mere effektiv ved hjælp af automatiseret billedbaseret teknologi. Vi beskriver en robot‐baseret maskine til billedgenkendelse, der kan automatisere processen med at sortere og identificere invertebrater og tilmed estimere individernes biomasse. Vi anvender apparatet til at generere en omfattende billeddatabase af terrestriske leddyrsarter og tester klassifikationsnøjagtigheden, altså med hvilken sikkerhed et individ kan artsbestemmes ud fra billeder taget med maskinen. Vi tester også systemets følsomhed for kameraindstillinger (blændeåbning og lukkertid) for at opnå den optimale billedkvalitet. Vi bruger state‐of‐the‐art Resnet‐50 og InceptionV3 convolutional neural networks (CNNs) til klassifikationsopgaven. Resultaterne er meget lovende, da vi opnåede en gennemsnitlig klassifikationsnøjagtighed på 0,980. Selvom klassifikationsnøjagtigheden var høj for de fleste arter, var den lavere for arter repræsenteret med mindre end 50 individer. Vi fandt også signifikante positive relationer mellem det gennemsnitlige areal af et individ beregnet ud fra billederne og individets tørvægt for tre arter af Diptera. Systemet er generelt og kan nemt tilpasses andre grupper af invertebrater. Dermed baner vores resultater vejen for at generere mere data på tidslig og rumlig variation i invertebraters abundans, diversitet og biomasse.","authors":["Johanna Ärje","Claus Melvad","Mads Rosenhøj Jeppesen","Sigurd Agerskov Madsen"],"meta":["July 2020Methods in Ecology and Evolution 11(5)","DOI:10.1111/2041-210X.13428","Project: Machine learning in ecology"],"references":["337646658_Rapid_large-scale_species_discovery_in_hyperdiverse_taxa_using_1D_MinION_sequencing","336902909_Arthropod_decline_in_grasslands_and_forests_is_associated_with_landscape-level_drivers","331480787_Automated_Taxonomic_Identification_of_Insects_with_Expert-Level_Accuracy_Using_Effective_Feature_Transfer_from_Convolutional_Networks","329263432_Insect_Detection_and_Classification_Based_on_an_Improved_Convolutional_Neural_Network","348276156_Boosting_Rare_Benthic_Macroinvertebrates_Taxa_Identification_With_One-Class_Classification","342191123_Human_experts_vs_machines_in_taxa_recognition","339409647_On_Confidences_and_Their_Use_in_Semi-Automatic_Multi-Image_Taxa_Identification","336564743_Insect_Declines_in_the_Anthropocene","329745866_The_iNaturalist_Species_Classification_and_Detection_Dataset","326678139_Adapting_metabarcoding-based_benthic_biomonitoring_into_routine_marine_ecological_status_assessment_networks"]}