{"id":"342882337_The_effect_of_computational_thinking_skill_program_design_developed_according_to_interest_driven_creator_theory_on_prospective_teachers","abstract":"It is likely to observe that the increase in data and the interrelated challenges in digital age complicates the problems to be encountered. Therefore, unprecedented problem-solving skills have become inevitable. Though dating back to old times, computational thinking skill is defined as a recent skill area that is required by everybody, that can be used to solve the aforementioned complex problems, and that is included in international standards and training programs. In this study, it was aimed to improve computational thinking skills of prospective teachers. In order to do this, a program design which includes contents that prospective theachers can use in daily life and professional life has been developed. This program, which consists mostly of unplugged activities, also includes computer aided and robotic activities. A total of 11 voluntary prospective teachers (7 women and 4 men), who were in their 3rd year of the 4 year education in the 2017–2018 fall semester and did not attend to any programming or computational thinking education training before, participated in the study. In the first application, a 40-h program was carried out with five prospective teachers, while in the second application, an updated 52-h program was carried out with six prospective teachers. A skill test was developed, and applied to measure prospective teachers’ computational thinking skills before and after the prepared program. Moreover, at the end of the training, they were asked to preapare graduation projects and their perspectives on education were examined. It has been observed that the program applied to prospective primary education teachers, who did not take any lessons like programming etc. before, was effective according to the computational thinking related skill tests and their graduation projects. It has been also observed in prospective primary education teachers that their thinking skills such as problem solving and questioning were improved and they could reflect their acquired knowledge and skills to their daily and professional life.","authors":["Özlem Üzümcü","Erdal Bay"],"meta":["January 2021Education and Information Technologies 26(1)","DOI:10.1007/s10639-020-10268-3"],"references":["338242046_IDC_theory_creation_and_the_creation_loop","323780639_Understanding_Problem_Solving_Behavior_of_6-8_Graders_in_a_Debugging_Game","321197140_21_yuzyil_becerilerinin_gelisiminde_dijital_oykulemeler_Ortaogretim_ogrencilerinin_goruslerinin_incelenmesi","315889793_Understanding_problem_solving_behavior_of_6-8_graders_in_a_debugging_game","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","347493089_Design_and_Development_Research_Methods_Strategies_and_Issues","312940415_Computational_Thinking_Teacher_Resources","311004023_A_framework_of_curriculum_design_for_computational_thinking_development_in_K-12_education","308654282_Which_cognitive_abilities_underlie_computational_thinking_Criterion_validity_of_the_Computational_Thinking_Test","308310937_What_is_backward_design","299450690_Computational_thinking_the_developing_definition","301429175_Introducing_teachers_to_computational_thinking_using_unplugged_storytelling","297440321_Preservice_Primary_School_Mathematics_Teachers'_Questioning_Skills_and_Knowledge_of_Students_in_terms_of_Pedagogical_Content_Knowledge","287260234_Learning_to_solve_problems_A_handbook_for_designing_problem-solving_learning_environments","285840181_Problem_cozme_becerisi_ile_matematik_basarisi_arasindaki_iliski"]}