{"id":"342826335_Improving_Machine_Vision_Using_Human_Perceptual_Representations_The_Case_of_Planar_Reflection_Symmetry_for_Object_Classification","abstract":"Achieving human-like visual abilities is a holy grail for machine vision, yet precisely how insights from human vision can improve machines has remained unclear. Here, we demonstrate two key conceptual advances: First, we show that most machine vision models are systematically different from human object perception. To do so, we collected a large dataset of perceptual distances between isolated objects in humans and asked whether these perceptual data can be predicted by many common machine vision algorithms. We found that while the best algorithms explain ~70% of the variance in the perceptual data, all the algorithms we tested make systematic errors on several types of objects. In particular, machine algorithms underestimated distances between symmetric objects compared to human perception. Second, we show that fixing these systematic biases can lead to substantial gains in classification performance. In particular, augmenting a state-of-the-art convolutional neural network with planar/reflection symmetry scores along multiple axes produced significant improvements in classification accuracy (1-10%) across categories. These results show that machine vision can be improved by discovering and fixing systematic differences from human vision.","authors":["Pramod Rt","Arun Sp"],"meta":["July 2020IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99):1-1","DOI:10.1109/TPAMI.2020.3008107"],"references":["342543050_PRS-Net_Planar_Reflective_Symmetry_Detection_Net_for_3D_Models","335299004_A_fast_and_efficient_3D_reflection_symmetry_detector_based_on_neural_networks","322315834_In_situ_immune_response_and_mechanisms_of_cell_damage_in_central_nervous_system_of_fatal_cases_microcephaly_by_Zika_virus_OPEN","322059133_Beyond_Planar_Symmetry_Modeling_Human_Perception_of_Reflection_and_Rotation_Symmetries_in_the_Wild","321690033_Symmetric_Objects_Become_Special_in_Perception_Because_of_Generic_Computations_in_Neurons","315116414_Using_Human_Brain_Activity_to_Guide_Machine_Learning","330053239_Local_contour_symmetry_facilitates_scene_categorization","329754389_Data_Distillation_Towards_Omni-Supervised_Learning","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318050175_How_do_targets_nontargets_and_scene_context_influence_real-world_object_detection"]}