{"id":"342896080_Affected_Data_Understanding_Knowledge_Production_in_Algorithmic_Events","abstract":"Dans le cadre de cet article, il s'agira de discuter des modes de production du savoir à partir de la numérisation du monde. Plus précisément, nous visons à identifier quel mode de production de la connaissance n'est pas pris en compte dans les méthodologies actuelles en science des données. Pour ce faire, certains postulats de la philosophie des affects, telle que définie par Spinoza, seront identifiés à partir desquels seront présentées trois conséquences à l'adoption de la théorie des affects sur la production du savoir en lien avec la numérisation des phénomènes humains. Seront par la suite explicités les trois modes spinozistes de connaissance, en s'attardant sur le troisième mode puisqu'il est celui qui est exclu des méthodologies actuelles en science des données. Relevant des affects, ce troisième mode fait état de ce qui est laissé de côté dans le traitement informatique. Nous conclurons avec un exemple où seront distingués affects et émotions pour démontrer la confusion parfois existante entre les deux et les limites de la science des données pour nous informer sur nos rapports affectifs au monde.","authors":["Maude Bonenfant","Laura Iseut Lafrance St-Martin","Loïs Crémier"],"meta":["June 2020"],"references":["281748849_Critical_questions_for_big_data_Provocations_for_a_cultural_technological_and_scholarly_phenomenon","271525133_Big_Data_New_Epistemologies_and_Paradigm_Shift","235223193_Big_Data_and_Their_Epistemological_Challenge","337507299_The_Future_Birth_of_the_Affective_Fact_The_Political_Ontology_of_Threat","320181841_L'institution_imaginaire_de_la_societe","314883186_Le_salut_par_les_affects_La_joie_comme_ressort_du_progres_ethique_chez_Spinoza","314502238_Thinking_Critically_About_and_Researching_Algorithms","280813267_Du_gouvernement_des_vivants_cours_au_College_de_France_1979-1980_Michel_Foucault","272746202_Spinoza_Philosophie_Pratique","259823101_Raw_data_is_an_oxymoron","234826589_Logical_vs_Analogical_or_Symbolic_vs_Connectionist_or_Neat_vs_Scruffy","37720019_Parables_for_the_Virtual_Movement_Affect_Sensation"]}