{"id":"342921565_Application_of_Computer_Technology_in_English_Translation","abstract":"With the continuous development of economy, communication is increasing between China and overseas, and business activities are becoming more and more frequent. In this process, foreign trade English plays an important role. Foreign trade English is unique, professional and practical. Under different scenes of foreign trade, English words can express different meanings. In the course of trade, foreign trade English can help both of parties to communicate, and can achieve the translation of language, the interpretation of contract, the understanding of letter and so on. In the process of language communication and reading important documents, we need a solid foundation of English language and profound foreign cultural background, and have a strong ability to deal with the professional knowledge of international trade and the use of English vocabulary. The characteristics of foreign trade English language are analyzed in terms of vocabulary, style and grammar. At the same time, in the process of language understanding and translation, we need to meet the requirements of real-time. With the frequent exchange of foreign trade between our country and other countries, a large number of English documents will be produced, the relevant departments have put forward higher requirements for the accuracy of these documents and real time of these documents, the traditional manual translation can not meet the growing demand for foreign trade translation. With the help of computer aided-translation software memoQ, we help people do auxiliary translation, therefore, it can reduce translator’s burden and improve the accuracy of translation and efficiency of translation. We select a large number of texts and adopt memoQ software to translate, so as to analyze the role of computer-aided translation software in the translation process of English documents.","authors":["Ting Yang","Hongbin Fan"],"meta":["June 2020Journal of Physics Conference Series 1575(1):012029","DOI:10.1088/1742-6596/1575/1/012029"],"references":["307745540_Importance_of_transboundary_transport_of_biomass_burning_emissions_to_regional_air_quality_in_Southeast_Asia","4993854_An_Empirical_Multi-Country_Analysis_of_the_Impact_of_Environmental_Policy_on_Foreign_Trade_Flows","308627378_Translation_Process_Management_and_Quality_Control_Based_on_SDL_Trados--A_Case_Study_of_Energetic_Materials_at_Extreme_Conditions_Translation_Project","289684535_A_Real-Time_Flash_Translation_Layer_for_NAND_Flash_Memory_Storage_Systems","280957991_On_the_Comparison_and_Design_of_Computer-Aided_Translation_Software","272065286_Functional_Analysis_of_Snowman_CAT_Standard_Edition_Translation_Software_Based_on_the_Normal_Distribution_and_Similarity_Model","261052796_Flexible_learning_model_for_computer-aided_technical_translation","254034809_Real-Time_Flash_Translation_Layer_for_NAND_Flash_Memory_Storage_Systems","247231141_The_impacts_of_international_tourism_demand_on_economic_growth_of_small_economies_dependent_on_tourism"]}