{"id":"342900357_A_context-aware_citation_recommendation_model_with_BERT_and_graph_convolutional_networks","abstract":"With the tremendous growth in the number of scientific papers being published, searching for references while writing a scientific paper is a time-consuming process. A technique that could add a reference citation at the appropriate place in a sentence will be beneficial. In this perspective, the context-aware citation recommendation has been researched for around two decades. Many researchers have utilized the text data called the context sentence, which surrounds the citation tag, and the metadata of the target paper to find the appropriate cited research. However, the lack of well-organized benchmarking datasets, and no model that can attain high performance has made the research difficult. In this paper, we propose a deep learning-based model and well-organized dataset for context-aware paper citation recommendation. Our model comprises a document encoder and a context encoder. For this, we use graph convolutional networks layer, and bidirectional encoder representations from transformers, a pre-trained model of textual data. By modifying the related PeerRead dataset, we propose a new dataset called FullTextPeerRead containing context sentences to cited references and paper metadata. To the best of our knowledge, this dataset is the first well-organized dataset for a context-aware paper recommendation. The results indicate that the proposed model with the proposed datasets can attain state-of-the-art performance and achieve a more than 28% improvement in mean average precision and recall@k.","authors":["Chanwoo Jeong","Sion Jang","Eunjeong Lucy Park","Sungchul Choi"],"meta":["July 2020Scientometrics 124(1)","DOI:10.1007/s11192-020-03561-y","Projects: A development of automated technology classification framework for patent document using deep learning approachA Context-Aware Citation Recommendation Model with BERT and Graph Convolutional Networks"],"references":["331183988_Predicting_the_citations_of_scholarly_paper","318764123_Neural_Citation_Network_for_Context-Aware_Citation_Recommendation","282313677_Context-Based_Collaborative_Filtering_for_Citation_Recommendation","229100388_The_ACL_Anthology_Network_corpus","328010049_A_LSTM_Based_Model_for_Personalized_Context-Aware_Citation_Recommendation","323973297_QuoteRec_Toward_Quote_Recommendation_for_Writing","310671827_Variational_Graph_Auto-Encoders","307991731_Semi-Supervised_Classification_with_Graph_Convolutional_Networks","303302244_Learning_Convolutional_Neural_Networks_for_Graphs","274382952_A_scientometric_review_of_emerging_trends_and_new_developments_in_recommendation_systems","269935079_Adam_A_Method_for_Stochastic_Optimization","266658667_Cross-language_context-aware_citation_recommendation_in_scientific_articles","262416109_Distributed_Representations_of_Sentences_and_Documents","228658916_A_Bibliometric_and_Network_Analysis_of_the_field_of_Computational_Linguistics","222529909_Measuring_contextual_citation_impact_of_scientific_journals"]}