{"id":"342998200_Impact_of_delays_on_effectiveness_of_contact_tracing_strategies_for_COVID-19_a_modelling_study","abstract":"Background\nIn countries with declining numbers of confirmed cases of COVID-19, lockdown measures are gradually being lifted. However, even if most physical distancing measures are continued, other public health measures will be needed to control the epidemic. Contact tracing via conventional methods or mobile app technology is central to control strategies during de-escalation of physical distancing. We aimed to identify key factors for a contact tracing strategy to be successful.\n\nMethods\nWe evaluated the impact of timeliness and completeness in various steps of a contact tracing strategy using a stochastic mathematical model with explicit time delays between time of infection and symptom onset, and between symptom onset, diagnosis by testing, and isolation (testing delay). The model also includes tracing of close contacts (eg, household members) and casual contacts, followed by testing regardless of symptoms and isolation if testing positive, with different tracing delays and coverages. We computed effective reproduction numbers of a contact tracing strategy (RCTS) for a population with physical distancing measures and various scenarios for isolation of index cases and tracing and quarantine of their contacts.\n\nFindings\nFor the most optimistic scenario (testing and tracing delays of 0 days and tracing coverage of 100%), and assuming that around 40% of transmissions occur before symptom onset, the model predicts that the estimated effective reproduction number of 1·2 (with physical distancing only) will be reduced to 0·8 (95% CI 0·7–0·9) by adding contact tracing. The model also shows that a similar reduction can be achieved when testing and tracing coverage is reduced to 80% (RCTS 0·8, 95% CI 0·7–1·0). A testing delay of more than 1 day requires the tracing delay to be at most 1 day or tracing coverage to be at least 80% to keep RCTS below 1. With a testing delay of 3 days or longer, even the most efficient strategy cannot reach RCTS values below 1. The effect of minimising tracing delay (eg, with app-based technology) declines with decreasing coverage of app use, but app-based tracing alone remains more effective than conventional tracing alone even with 20% coverage, reducing the reproduction number by 17·6% compared with 2·5%. The proportion of onward transmissions per index case that can be prevented depends on testing and tracing delays, and given a 0-day tracing delay, ranges from up to 79·9% with a 0-day testing delay to 41·8% with a 3-day testing delay and 4·9% with a 7-day testing delay.\n\nInterpretation\nIn our model, minimising testing delay had the largest impact on reducing onward transmissions. Optimising testing and tracing coverage and minimising tracing delays, for instance with app-based technology, further enhanced contact tracing effectiveness, with the potential to prevent up to 80% of all transmissions. Access to testing should therefore be optimised, and mobile app technology might reduce delays in the contact tracing process and optimise contact tracing coverage.\n\nFunding\nZonMw, Fundação para a Ciência e a Tecnologia, and EU Horizon 2020 RECOVER.","authors":["Mirjam Kretzschmar","Ganna Rozhnova","M.C.J. Bootsma","Michiel van boven"],"meta":["July 2020The Lancet Public Health 5(8)","DOI:10.1016/S2468-2667(20)30157-2","Project: Modelling interventions for COVID-19"],"references":["342413953_Efficacy_of_contact_tracing_for_the_containment_of_the_2019_novel_coronavirus_COVID-19","341146059_Ethics_of_instantaneous_contact_tracing_using_mobile_phone_apps_in_the_control_of_the_COVID-19_pandemic","340957333_Epidemiology_and_transmission_of_COVID-19_in_391_cases_and_1286_of_their_close_contacts_in_Shenzhen_China_a_retrospective_cohort_study","340700951_Demographic_science_aids_in_understanding_the_spread_and_fatality_rates_of_COVID-19","340654328_Temporal_dynamics_in_viral_shedding_and_transmissibility_of_COVID-19","340447090_New_measures_for_COVID-19_response_a_lesson_from_the_Wenzhou_experience","340381302_Summary_of_the_COVID-19_outbreak_in_Vietnam_-_Lessons_and_suggestions","340316786_Quantifying_SARS-CoV-2_transmission_suggests_epidemic_control_with_digital_contact_tracing","341547923_Individual_quarantine_versus_active_monitoring_of_contacts_for_the_mitigation_of_COVID-19_a_modelling_study","341444386_Variation_in_False-Negative_Rate_of_Reverse_Transcriptase_Polymerase_Chain_Reaction-Based_SARS-CoV-2_Tests_by_Time_Since_Exposure"]}