{"id":"342987214_Human_Search_in_a_Fitness_Landscape_How_to_Assess_the_Difficulty_of_a_Search_Problem","abstract":"Computational modeling is widely used to study how humans and organizations search and solve problems in fields such as economics, management, cultural evolution, and computer science. We argue that current computational modeling research on human problem-solving needs to address several fundamental issues in order to generate more meaningful and falsifiable contributions. Based on comparative simulations and a new type of visualization of how to assess the nature of the fitness landscape, we address two key assumptions that approaches such as the NK framework rely on: that the NK captures the continuum of the complexity of empirical fitness landscapes and that search behavior is a distinct component, independent from the topology of the fitness landscape. We show the limitations of the most common approach to conceptualize how complex, or rugged, a landscape is, as well as how the nature of the fitness landscape is fundamentally intertwined with search behavior. Finally, we outline broader implications for how to simulate problem-solving.","authors":["Oana Vuculescu","Mads Kock Pedersen","Jacob F. Sherson","Carsten Bergenholtz"],"meta":["July 2020Complexity 2020(3):1-11","DOI:10.1155/2020/7802169"],"references":["348616565_Crowdsourcing_human_common_sense_for_quantum_control","329794352_A_note_on_how_NK_landscapes_work","328847060_Remote_optimization_of_an_ultracold_atoms_experiment_by_experts_and_citizen_scientists","328753161_Effective_Search_in_Rugged_Performance_Landscapes_A_Review_and_Outlook","325000480_Modelling_Bounded_Rationality_in_Organizations_Progress_and_Prospects","320587527_The_topology_of_evolutionary_novelty_and_innovation_in_macroevolution","335595525_Interdependence_Complementarity_and_Ruggedness_of_Performance_Landscapes","322091084_Simulating_Macro-Level_Effects_from_Micro-Level_Observations","320366987_NK_model_as_a_representation_of_innovative_search","320181465_The_origins_of_order_self-organization_and_selection_in_evolution"]}