{"id":"342945750_Training_and_support_strategy_for_users_in_the_process_of_implementing_the_Hospital_Information_System_XAVIA_HIS","abstract":"User training is a term that business executives listen to quite frequently during the process of implementing a new computer system, however, most of the time, many choose not to hire this training for their staff. The Medical Information Center (CESIM) of the University of Computer Science among the systems developed and marketed for the health sector is the XAVIA HIS Hospital Information System. In the last 10 years the system has been deployed in two hospitals, eight clinics and two medical centers, 3 of them national and 9 international. During these processes, the complexity of the transfer service and implementation support could be confirmed, with a degree of difficulty directly proportional to the number of end users by roles to be trained and the number of modules of the system to be implemented. The objective of this work is to develop a training and accompaniment strategy for users in the process of implementing the XAVIA HIS Hospital Information System, which reduces the execution time of the executed services, allowing to execute the knowledge transfer and accompaniment service in the implementation of the XAVIA HIS system with greater efficiency of the services executed.","authors":["Nadiezka Milan Cristo","José Felipe Ramírez Pérez"],"meta":["January 2020","Project: eVitae, cuban platform of electronic health record"],"references":["324922764_Estrategia_para_la_evaluacion_de_escenarios_de_despliegue_del_Sistema_de_Informacion_Hospitalaria_XAVIA_HIS_en_instituciones_de_salud","288019754_Utilizacion_del_conocimiento_tacito_por_proveedores_de_atencion_a_la_salud_materna_mapeo_sistematico_de_la_literatura","281319887_Sistemas_de_Informacion_en_Salud_Integrando_Datos_Clinicos_en_Diferentes_Escenarios_y_Usuarios","260337968_Administracion_hospitalaria","220591893_An_Empirical_Study_of_the_Relationships_among_End-User_Information_Systems_Acceptance_Training_and_Effectiveness"]}