{"id":"342993579_Modulo_educativo_em_ambiente_virtual_de_aprendizagem_em_Diabetes_Mellitus","abstract":"Introduction:\nNursing professionals need to be trained and qualified to care for people with diabetes, where one of the aspects considered as fundamental for this training is the knowledge of the technological resources indicated for the development of the teaching-learning process, such as computer science, internet, hypermedia, multimedia, besides the various tools of interaction and communication.\n\nObjective:\nThe objectives of this study were to develop an educational module about diabetic foot in a Virtual Learning Environment - VLE in the Moodle platform for nursing students and to submit the program to the evaluation of the students.\n\nMethod:\nIt is a cross-sectional descriptive study, carried out with 31 students. The educational module was developed as a course distributed in four chapters dealing with diabetic foot. After the course, the students evaluated the module using a validated instrument containing pedagogical aspects (content, interaction and activities) and technical aspect (interface quality) of VLE.\n\nResults:\nThe characteristics that were considered favorable to learning were \"content\" (91.6%), \"activities\" (85.8%) and \"interface quality\" (89.7%). The \"interaction\" characteristic was the one that obtained the lowest rate (52.7%).\n\nConclusion:\nBy considering most of the evaluated characteristics, we conclude that Moodle has proved to be an effective teaching tool. Regarding the \"interaction\" characteristic, it is necessary to improve the questions that involve the scheduled activities, such as forum and chat, in order to provide a greater relationship among the participants.","authors":["William Lima de Castilho","Suzel Chavaglia","Rosali Ohl","Mônica Antar Gamba"],"meta":["June 2020Enfermeria Global 19(3):345-388","DOI:10.6018/eglobal.320631","Project: A Enfermagem em Urgência e Emergência nos cenários extra-hospitalar e hospitalar"],"references":["335705999_Risk_Factors_and_Diagnosis_of_Diabetic_Foot_Ulceration_in_Users_of_the_Brazilian_Public_Health_System","334513276_Effects_of_a_digital_educational_intervention_on_collaborative_learning_in_nursing_education_A_quasi-experimental_study","331843985_Original_Paper_Clinical_Virtual_Simulation_in_Nursing_Education_Randomized_Controlled_Trial","330138117_Clinical_virtual_simulation_in_nursing_education_Randomized_Controlled_Preprint","326781482_Clinical_simulation_to_teach_nursing_care_for_wounded_patients","325905723_The_use_of_gamification_to_teach_in_the_nursing_field","322475292_Analysis_of_Brazilian_publications_on_distance_education_in_nursing_integrative_review","332701865_Nursing_Students'_Perceptions_Using_an_Interactive_Digital_Simulation_Table_A_Usability_Study","329105784_The_Use_of_Simulated_Patients_in_Undergraduate_Nursing_Programmes_A_Review_of_the_Literature_Certificate_in_proficiency_in_simulation_and_clinical_skills_teaching","326249101_Evaluating_a_Blended_Online_Learning_Model_Among_Undergraduate_Nursing_Students_A_Quantitative_Study"]}