{"id":"342995566_RRGCCAN_Re-ranking_via_Graph_Convolution_Channel_Attention_Network_for_Person_Re-Identification","abstract":"The classical person re-identification methods are mostly focused on employing discriminative features amongst which the distance is measured on Euclidean space, while the effort of re-ranking is constrained as the lack of the utilization of quality context representation in embedding set. In this paper, we incorporate graph models on feature subsets resorting to the initial ranking by adopting the integration of the attention mechanism into graph convolution network. On the one hand, the context information regarding embedding pairs is considered to compute feature group similarity through the aggregation operation by using graph convolution networks. On the other hand, we adopt a channel attention mechanism to enhance the contribution of relevant feature channels, further strengthening the ability of similarity pulling and dissimilarity pushing of the overall network. Experimental study shows that the proposed network structure is superior to the state-of-the-art deep neural networks on three very challenging datasets that are popular in examining person re-identification techniques.","authors":["Xiaoqiang Chen","Ling Zheng","Chong Zhao","Qicong Wang"],"meta":["July 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3009653"],"references":["339561806_DeepGCNs_Can_GCNs_Go_As_Deep_As_CNNs","338509853_Joint_Discriminative_and_Generative_Learning_for_Person_Re-Identification","339995150_Deep_Learning_on_Graphs_A_Survey","339562461_Omni-Scale_Feature_Learning_for_Person_Re-Identification","339558760_Foreground-Aware_Pyramid_Reconstruction_for_Alignment-Free_Occluded_Person_Re-Identification","339554593_Discriminative_Feature_Learning_With_Consistent_Attention_Regularization_for_Person_Re-Identification","338512713_AANet_Attribute_Attention_Network_for_Person_Re-Identifications","338510131_Interaction-And-Aggregation_Network_for_Person_Re-Identification","338506188_Linkage_Based_Face_Clustering_via_Graph_Convolution_Network","329559443_Person_Re-identification_Based_on_Re-ranking_with_Expanded_k-reciprocal_Nearest_Neighbors"]}