{"id":"342942576_COVID-19_Contact_Tracing_Challenges_and_Future_Directions","abstract":"Contact tracing has become a vital tool for public health officials to effectively combat the spread of new diseases, such asthe novel coronavirus disease COVID-19. Contact tracing is not new to epidemiologist rather, it used manual or semi-manualapproaches that are incredibly time-consuming, costly and inefficient. It mostly relies on human memory while scalabilityis a significant challenge in tackling pandemics. The unprecedented health and socio-economic impacts led researchersand practitioners around the world to search for technology-based approaches for providing scalable and timely answers.Smartphones and associated digital technologies have the potential to provide a better approach due to their high level ofpenetration, coupled with mobility. While data-driven solutions are extremely powerful, the fear among citizens is thatinformation like location or proximity associated with other personal data and can be weaponised by the states to enforcesurveillance. Low adoption rate of such apps due to the lack of trust questioned the efficacy and demanded researchers tofind innovative solution for building digital-trust, and appropriately balancing privacy and accuracy of data. In this paper,we have critically reviewed such protocols and apps to identify the strength and weakness of each approach. Finally, wehave penned down our recommendations to make the future contact tracing mechanisms more universally inter-operable andprivacy-preserving.","authors":["Mohammad Jabed Morshed Chowdhury","Md. Sadek Ferdous","Kamanashis Biswas","Niaz Chowdhury"],"meta":["July 2020","DOI:10.20944/preprints202006.0240.v2"],"references":["344994176_Decentralized_Privacy-Preserving_Proximity_Tracing","343093194_A_Survey_of_COVID-19_Contact_Tracing_Apps","341807550_COVID-19_Antibody_Test_Vaccination_Certification_There's_an_app_for_that","341649477_Use_of_apps_in_the_COVID-19_response_and_the_loss_of_privacy_protection","340827150_Diagnosis_and_management_of_COVID-19_disease","340654328_Temporal_dynamics_in_viral_shedding_and_transmissibility_of_COVID-19","337302955_A_Comparative_Analysis_of_Distributed_Ledger_Technology_Platforms","348532037_CAUDHT_Decentralized_Contact_Tracing_Using_a_DHT_and_Blind_Signatures","335285635_Inside_Blockchain_Bitcoin_and_Cryptocurrencies","327123249_EPIC_Efficient_Privacy-Preserving_Contact_Tracing_for_Infection_Detection"]}