{"id":"342927360_Comparing_Feature_Engineering_Approaches_to_Predict_Complex_Programming_Behaviors","abstract":"Using machine learning to classify student code has many applications in computer science education, such as auto-grading, identifying struggling students from their code, and propagating feedback to address particular misconceptions. However, a fundamental challenge of using machine learning for code classification is how to represent program code as a vector to be processed by modern learning algorithms. A piece of programming code is structurally represented by an abstract syntax tree (AST), and a variety of approaches have been proposed to extract features from these ASTs to use in learning algorithms, but no work has directly compared their effectiveness. In this paper, we do so by comparing three different feature engineering approaches for classifying the behavior of novices' open-ended programming projects according to expert labels. In order to evaluate the effectiveness of these feature engineering approaches, we hand-labeled a dataset of novice programs from the Scratch repository to indicate the presence of five complex, game-related programming behaviors. We compared these feature engineering approaches by evaluating their classification effectiveness. Our results show that the three approaches perform similarly across different target labels. However, we also find evidence that all approaches led to overfitting, suggesting the need for future research to select and reduce code features, which may reveal advantages in more complex feature engineering approaches.","authors":["Wengran Wang","Yudong Rao","Yang Shi","Alexandra Milliken"],"meta":["July 2020"],"references":["344774273_Immediate_Data-Driven_Positive_Feedback_Increases_Engagement_on_Programming_Homework_for_Novices","339510447_Crescendo_Engaging_Students_to_Self-Paced_Programming_Practices","335453629_One_minute_is_enough_Early_Prediction_of_Student_Success_and_Event-level_Difficulty_during_a_Novice_Programming_Task","326918316_Misconception-Driven_Feedback_Results_from_an_Experimental_Study","319131538_Comprehension_First_Evaluating_a_Novel_Pedagogy_and_Tutoring_System_for_Program_Tracing_in_CS1","305426255_Make_Wear_Play_Remix_Designs_of_Wearable_Controllers_for_Scratch_Games_by_Middle_School_Youth","332567216_Reducing_the_State_Space_of_Programming_Problems_through_Data-Driven_Feature_Detection","331338200_user2code2vec_Embeddings_for_Profiling_Students_Based_on_Distributional_Representations_of_Source_Code","323592171_Data-driven_generation_of_rubric_criteria_from_an_educational_programming_environment","306093752_Summarizing_Source_Code_using_a_Neural_Attention_Model"]}