{"id":"343090610_Modeling_and_Deadlock_Control_of_Reconfigurable_Multi-Unit_Resource_Systems","abstract":"Most existing methods for deadlock control in multi-unit resource systems are developed based on parallel multi-unit resource deadlock algorithms and their hardware implementation. However, the rapid dynamic changes in such resource allocation systems raise the following challenging problems: (a) how to model and control deadlocks in these systems in an alternative way as modeled by Petri nets, and (b) how to quickly and effectively make Petri nets able to adapt to these dynamic changes in such configurable systems. In order to cope with these problems, this study makes five contributions: (1) propose an efficient integrated policy for designing supervisors for multi-unit resource systems based on a class of Petri nets, namely the system of simple sequential processes with resources (S3PR) which can model multi-unit resource systems; (2) improve an S2PR model to obtain a simple sequential process with resources and part-re-entry (S2PRP) that can describe how a failed part re-enters to the system and is reprocessed for a system with processing failures and rework; (3) use the siphon-based deadlock prevention policy to control S2PRP; (4) present behavioral analysis and prove that the controlled S2PRP is deadlock-free, bounded, and reversible; and (5) apply the proposed policy to a system of simple sequential processes with resources (S3PR), and constructs an improved model called system of simple sequential processes with resources and part-re-entry (S3PRP). The obtained S2PRP (S3PRP) is tested and validated using Integrated Net Analyzer (INA). Single-unit and multi-unit resource system examples are adopted to demonstrate the performance of the proposed policy.","authors":["Mahmoud Salaheldin El Sayed","Passent Elkafrawy","Naiqi Wu"],"meta":["July 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3010237"],"references":["340065959_Intelligent_Colored_Token_Petri_Nets_for_Modeling_Control_and_Validation_of_Dynamic_Changes_in_Reconfigurable_Manufacturing_Systems","339465240_Adaptive_Consensus_of_Two_Coupled_Heterogeneous_Networked_Systems_With_Bidirectional_Actions","338736865_Strict_Minimal_Siphon-Based_Colored_Petri_Net_Supervisor_Synthesis_for_Automated_Manufacturing_Systems_With_Unreliable_Resources","338408247_A_Pareto-based_genetic_algorithm_for_multi-objective_scheduling_of_automated_manufacturing_systems","336425331_Diagnosability_of_Vector_Discrete-Event_Systems_Using_Predicates","335671435_An_MIP-based_Deadlock_Prevention_Policy_for_Siphon_Control","335357780_On_Algebraic_Identification_of_Critical_States_for_Deadlock_Control_in_Automated_Manufacturing_Systems_Modeled_With_Petri_Nets","338882873_Design_of_Supervisors_for_Active_Diagnosis_in_Discrete_Event_Systems","335642134_Nonblocking_Supervisory_Control_of_State-Tree_Structures_With_Conditional-Preemption_Matrices","335641362_A_user_requirement_oriented_web_service_discovery_approach_based_on_logic_and_threshold_petri_net"]}