{"id":"343043804_Metric_Dimension_of_heptagonal_circular_ladder","abstract":"Let [Formula: see text] be an undirected (i.e., all the edges are bidirectional), simple (i.e., no loops and multiple edges are allowed), and connected (i.e., between every pair of nodes, there exists a path) graph. Let [Formula: see text] denotes the number of edges in the shortest path or geodesic distance between two vertices [Formula: see text]. The metric dimension (or the location number) of some families of plane graphs have been obtained in [M. Imran, S. A. Bokhary and A. Q. Baig, Families of rotationally-symmetric plane graphs with constant metric dimension, Southeast Asian Bull. Math. 36 (2012) 663–675] and an open problem regarding these graphs was raised that: Characterize those families of plane graphs [Formula: see text] which are obtained from the graph [Formula: see text] by adding new edges in [Formula: see text] such that [Formula: see text] and [Formula: see text]. In this paper, by answering this problem, we characterize some families of plane graphs [Formula: see text], which possesses the radial symmetry and has a constant metric dimension. We also prove that some families of plane graphs which are obtained from the plane graphs, [Formula: see text] by the addition of new edges in [Formula: see text] have the same metric dimension and vertices set as [Formula: see text], and only 3 nodes appropriately selected are sufficient to resolve all the nodes of these families of plane graphs.","authors":["Sunny KUMAR Sharma","Vijay Kumar Bhat"],"meta":["July 2020Discrete Mathematics Algorithms and Applications 13(98)","DOI:10.1142/S1793830920500950"],"references":["225337513_Metric_Dimension_and_R-Sets_of_Connected_Graphs","220082445_On_the_metric_dimension_of_some_families_of_graphs","3236449_Network_Discovery_and_Verification","226705873_On_k-dimensional_graphs_and_their_bases","223217500_Landmarks_in_graphs","222514864_Resolvability_in_graphs_and_the_metric_dimension_of_a_graph","220632415_Metric_bases_in_digital_geometry"]}