{"id":"343086532_The_impact_of_the_COVID-19_pandemic_on_cancer_deaths_due_to_delays_in_diagnosis_in_England_UK_a_national_population-based_modelling_study","abstract":"Background\nSince a national lockdown was introduced across the UK in March, 2020, in response to the COVID-19 pandemic, cancer screening has been suspended, routine diagnostic work deferred, and only urgent symptomatic cases prioritised for diagnostic intervention. In this study, we estimated the impact of delays in diagnosis on cancer survival outcomes in four major tumour types.\n\nMethods\nIn this national population-based modelling study, we used linked English National Health Service (NHS) cancer registration and hospital administrative datasets for patients aged 15–84 years, diagnosed with breast, colorectal, and oesophageal cancer between Jan 1, 2010, and Dec 31, 2010, with follow-up data until Dec 31, 2014, and diagnosed with lung cancer between Jan 1, 2012, and Dec 31, 2012, with follow-up data until Dec 31, 2015. We use a routes-to-diagnosis framework to estimate the impact of diagnostic delays over a 12-month period from the commencement of physical distancing measures, on March 16, 2020, up to 1, 3, and 5 years after diagnosis. To model the subsequent impact of diagnostic delays on survival, we reallocated patients who were on screening and routine referral pathways to urgent and emergency pathways that are associated with more advanced stage of disease at diagnosis. We considered three reallocation scenarios representing the best to worst case scenarios and reflect actual changes in the diagnostic pathway being seen in the NHS, as of March 16, 2020, and estimated the impact on net survival at 1, 3, and 5 years after diagnosis to calculate the additional deaths that can be attributed to cancer, and the total years of life lost (YLLs) compared with pre-pandemic data.\n\nFindings\nWe collected data for 32 583 patients with breast cancer, 24 975 with colorectal cancer, 6744 with oesophageal cancer, and 29 305 with lung cancer. Across the three different scenarios, compared with pre-pandemic figures, we estimate a 7·9–9·6% increase in the number of deaths due to breast cancer up to year 5 after diagnosis, corresponding to between 281 (95% CI 266–295) and 344 (329–358) additional deaths. For colorectal cancer, we estimate 1445 (1392–1591) to 1563 (1534–1592) additional deaths, a 15·3–16·6% increase; for lung cancer, 1235 (1220–1254) to 1372 (1343–1401) additional deaths, a 4·8–5·3% increase; and for oesophageal cancer, 330 (324–335) to 342 (336–348) additional deaths, 5·8–6·0% increase up to 5 years after diagnosis. For these four tumour types, these data correspond with 3291–3621 additional deaths across the scenarios within 5 years. The total additional YLLs across these cancers is estimated to be 59 204–63 229 years.\n\nInterpretation\nSubstantial increases in the number of avoidable cancer deaths in England are to be expected as a result of diagnostic delays due to the COVID-19 pandemic in the UK. Urgent policy interventions are necessary, particularly the need to manage the backlog within routine diagnostic services to mitigate the expected impact of the COVID-19 pandemic on patients with cancer.\n\nFunding\nUK Research and Innovation Economic and Social Research Council.","authors":["Camille Maringe","James Spicer","Melanie Morris","Arnie Purushotham"],"meta":["July 2020The Lancet Oncology 21(8)","DOI:10.1016/S1470-2045(20)30388-0"],"references":["342055298_Restarting_gastrointestinal_endoscopy_in_the_deceleration_and_early_recovery_phases_of_COVID-19_pandemic_Guidance_from_the_British_Society_of_Gastroenterology","341529952_The_impact_of_the_COVID-19_pandemic_on_cancer_care","341518852_Collateral_damage_the_impact_on_outcomes_from_cancer_surgery_of_the_COVID-19_pandemic","341057967_Impact_of_the_COVID-19_pandemic_on_the_symptomatic_diagnosis_of_cancer_the_view_from_primary_care","340311900_International_Guidelines_on_Radiation_Therapy_for_Breast_Cancer_During_the_COVID-19_Pandemic","332894531_Impact_of_introducing_a_faecal_immunochemical_test_FIT_for_haemoglobin_into_primary_care_on_the_outcome_of_patients_with_new_bowel_symptoms_A_prospective_cohort_study","342457729_Resuming_bowel_cancer_screening_post-COVID-19","340955138_What_policy_makers_need_to_know_about_COVID-19_protective_immunity","340559028_Disease_Control_Civil_Liberties_and_Mass_Testing_-_Calibrating_Restrictions_during_the_Covid-19_Pandemic","326754100_Overdiagnosis_in_Colorectal_Cancer_Screening_-_Time_to_Acknowledge_A_Blind_Spot"]}