{"id":"343092076_Microfluidic_Formation_of_Honeycomb-Patterned_Droplets_Bounded_by_Interface_Bilayers_via_Bimodal_Molecular_Adsorption","abstract":"Assembled water-in-oil droplets bounded by lipid bilayers are used in synthetic biology as minimal models of cell tissue. Microfluidic devices successfully generate monodispersed droplets and assemble them via droplet interface bilayesr (DIB) formation. However, a honeycomb pattern of DIB-bounded droplets, similar to epithelial tissues, remains unrealized because the rapid DIB formation between the droplets hinders their ability to form the honeycomb pattern. In this paper, we demonstrate the microfluidic formation of a honeycomb pattern of DIB-bounded droplets using two surfactants with different adsorption rates on the droplet surface. A non-DIB forming surfactant (sorbitan monooleate, Span 80) was mixed with a lipid (1,2-dioleoyl-sn-glycero-3-phosphocholine, PC), whose adsorption rate on the droplet surface and saturated interfacial tension were lower than those of Span 80. By changing the surfactant composition, we established the conditions under which the droplets initially form a honeycomb pattern and subsequently adhere to each other via DIB formation to minimize the interfacial energy. In addition, the reconstituted membrane protein nanopores at the DIBs were able to transport molecules. This new method, using the difference in the adsorption rates of two surfactants, allows the formation of a honeycomb pattern of DIB-bounded droplets in a single step, and thus facilitates research using DIB-bounded droplet assemblies.","authors":["Shougo Fujiwara","Kan Shoji","Chiho Watanabe","Ryuji Kawano"],"meta":["July 2020Micromachines 11(7):701","DOI:10.3390/mi11070701"],"references":["327795012_Controlled_Construction_of_Stable_Network_Structure_Composed_of_Honeycomb-Shaped_Microhydrogels","326739050_Droplet_microfluidics_for_the_construction_of_compartmentalised_model_membranes","325316114_Microfluidic_Formation_of_Double-Stacked_Planar_Bilayer_Lipid_Membranes_by_Controlling_the_Water-Oil_Interface","325128929_Sculpting_and_fusing_biomimetic_vesicle_networks_using_optical_tweezers","318829086_High-Resolution_Patterned_Cellular_Constructs_by_Droplet-Based_3D_Printing","312063850_Enhanced_stability_of_freestanding_lipid_bilayer_and_its_stability_criteria","310820932_Spatiotemporal_periodicity_of_dislocation_dynamics_in_a_two-dimensional_microfluidic_crystal_flowing_in_a_tapered_channel","340867857_Liposomal_adhesion_via_electrostatic_interactions_and_osmotic_deflation_increase_membrane_tension_and_lipid_diffusion_coefficient","332854476_Controlling_Secretion_in_Artificial_Cells_with_a_Membrane_AND_Gate","324434194_Adsorption_of_phospholipids_at_oilwater_interfaces_during_emulsification_is_controlled_by_stress_relaxation_and_diffusion"]}