{"id":"343082721_Law_without_law_from_observer_states_to_physics_via_algorithmic_information_theory","abstract":"According to our current conception of physics, any valid physical theory is supposed to describe the objective evolution of a unique external world. However, this condition is challenged by quantum theory, which suggests that physical systems should not always be understood as having objective properties which are simply revealed by measurement. Furthermore, as argued below, several other conceptual puzzles in the foundations of physics and related fields point to limitations of our current perspective and motivate the exploration of an alternative: to start with the first-person (the observer) rather than the third-person perspective (the world).In this work, I propose a rigorous approach of this kind on the basis of algorithmic information theory. It is based on a single postulate: that universal induction determines the chances of what any observer sees next. That is, instead of a world or physical laws, it is the local state of the observer alone that determines those probabilities. Surprisingly, despite its solipsistic foundation, I show that the resulting theory recovers many features of our established physical worldview: it predicts that it appears to observers as if there was an external world that evolves according to simple, computable, probabilistic laws. In contrast to the standard view, objective reality is not assumed on this approach but rather provably emerges as an asymptotic statistical phenomenon. The resulting theory dissolves puzzles like cosmology's Boltzmann brain problem, makes concrete predictions for thought experiments like the computer simulation of agents, and suggests novel phenomena such as ``probabilistic zombies'' governed by observer-dependent probabilistic chances. It also suggests that some basic phenomena of quantum theory (Bell inequality violation and no-signalling) might be understood as consequences of this framework.","authors":["Markus Müller"],"meta":["July 2020Quantum 4:301","DOI:10.22331/q-2020-07-20-301"],"references":["331476423_On_the_Origins_of_Old_Evidence","324181594_A_No-Go_Theorem_for_Observer-Independent_Facts","320098329_Parallel_Lives_A_Local-Realistic_Interpretation_of_Nonlocal_Boxes","311792347_Quantum_Theory_from_Rules_on_Information_Acquisition","304642539_A_Royal_Road_to_Quantum_Theory_or_Thereabouts","336025757_Quantum_correlations_from_simple_assumptions","323130140_On_the_Einstein_Podolsky_Rosen_paradox","322591865_Universal_Prediction","321540566_Quantum_UnSpeakables_II_Half_a_Century_of_Bell's_Theorem","306495676_Bayesian_Theory"]}