{"id":"343017437_A_Multi-Analytical_Approach_to_Predict_the_Determinants_of_Cloud_Computing_Adoption_in_Higher_Education_Institutions","abstract":"Cloud computing (CC) delivers services for organizations, particularly for higher education institutions (HEIs) anywhere and anytime, based on scalability and pay-per-use approach. Examining the factors influencing the decision-makers’ intention towards adopting CC plays an essential role in HEIs. Therefore, this study aimed to understand and predict the key determinants that drive managerial decision-makers’ perspectives for adopting this technology. The data were gathered from 134 institutional managers, involved in the decision making of the institutions. This study applied two analytical approaches, namely variance-based structural equation modeling (i.e., PLS-SEM) and artificial neural network (ANN). First, the PLS-SEM approach has been used for analyzing the proposed model and extracting the significant relationships among the identified factors. The obtained result from PLS-SEM analysis revealed that seven factors were identified as significant in influencing decision-makers’ intention towards adopting CC. Second, the normalized importance among those seven significant predictors was ranked utilizing the ANN. The results of the ANN approach showed that technology readiness is the most important predictor for CC adoption, followed by security and competitive pressure. Finally, this study presented a new and innovative approach for comprehending CC adoption, and the results can be used by decision-makers to develop strategies for adopting CC services in their institutions.","authors":["Yousef A. M. Qasem","Shahla Asadi","Rusli Abdullah","Yusmadi Jusoh"],"meta":["July 2020Applied Sciences 10(14)","DOI:10.3390/app10144905"],"references":["340892395_Industry_40_technologies_and_their_applications_in_fighting_COVID-19_pandemic","340680378_Challenges_and_Opportunities_for_Higher_Education_amid_the_COVID-19_Pandemic_The_Philippine_Context","336250953_Food_safety_knowledge_attitude_and_practices_among_management_and_science_university_students_Shah_Alam","335927775_Cloud-Based_Education_As_a_Service_CEaaS_System_Requirements_Specification_Model_of_Higher_Education_Institutions_in_Industrial_Revolution_40","333008997_Cloud_Computing_Adoption_in_Higher_Education_Institutions_A_Systematic_Review","331104057_An_Integrated_SEM-Neural_Network_Approach_for_Predicting_Determinants_of_Adoption_of_Wearable_Healthcare_Devices","338102591_A_Tour_Through_the_Deep_Learning_Pipeline","333419536_Investigating_factors_influencing_decision-makers'_intention_to_adopt_Green_IT_in_Malaysian_manufacturing_industry","330792023_A_Model_of_Factors_Influencing_Cloud_Computing_Adoption_Among_Faculty_Members_and_Students_of_Higher_Educational_Institutions_of_Bangladesh","329256675_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error_Algebra_and_Statistics"]}