{"id":"343039080_Interpolated_corrected_curvature_measures_for_polygonal_surfaces","abstract":"A consistent and yet practically accurate definition of curvature onto polyhedral meshes remains an open problem. We propose a new framework to define curvature measures, based on the Corrected Normal Current , which generalizes the normal cycle: it uncouples the positional information of the polyhedral mesh from its geometric normal vector field, and the user can freely choose the corrected normal vector field at vertices for curvature computations. A smooth surface is then built in the Grassmannian ℝ³ × 𝕊² by simply interpolating the given normal vector field. Curvature measures are then computed using the usual Lipschitz–Killing forms, and we provide closed‐form formulas per triangle. We prove a stability result with respect to perturbations of positions and normals. Our approach provides a natural scale‐space for all curvature estimations, where the scale is given by the radius of the measuring ball. We show on experiments how this method outperforms state‐of‐the‐art methods on clean and noisy data, and even achieves pointwise convergence on difficult polyhedral meshes like digital surfaces. The framework is also well suited to curvature computations using normal map information.","authors":["Jacques-Olivier Lachaud","Pascal Romon","Boris Thibert","David Coeurjolly"],"meta":["July 2020Computer Graphics Forum 39(5)","DOI:10.1111/cgf.14067"],"references":["342908344_Polygon_Laplacian_Made_Simple","324232120_Discretization_and_Approximation_of_Surfaces_Using_Varifolds","308066122_A_Varifold_Approach_to_Surface_Approximation","283181216_Properties_of_Gauss_Digitized_Shapes_and_Digital_Surface_Integration","281658200_Properties_of_Gauss_digitized_sets_and_digital_surface_integration","333444012_Discretization_and_Approximation_of_Surfaces_Using_Varifolds","324370015_Plateau's_Problem_an_Invitation_to_Varifold_Geometry","306125095_Mesh_Statistics_for_Robust_Curvature_Estimation","267075448_Generalized_Curvatures","267053198_Normal_Cycle_and_Integral_Curvature_for_Polyhedra_in_Riemannian_Manifolds"]}