{"id":"343085005_Machine_learning_based_imputation_techniques_for_estimating_phylogenetic_trees_from_incomplete_distance_matrices","abstract":"Background: \nWith the rapid growth rate of newly sequenced genomes, species tree inference from genes sampled throughout the whole genome has become a basic task in comparative and evolutionary biology. However, substantial challenges remain in leveraging these large scale molecular data. One of the foremost challenges is to develop efficient methods that can handle missing data. Popular distance-based methods, such as NJ (neighbor joining) and UPGMA (unweighted pair group method with arithmetic mean) require complete distance matrices without any missing data.\n\nResults: \nWe introduce two highly accurate machine learning based distance imputation techniques. These methods are based on matrix factorization and autoencoder based deep learning architectures. We evaluated these two methods on a collection of simulated and biological datasets. Experimental results suggest that our proposed methods match or improve upon the best alternate distance imputation techniques. Moreover, these methods are scalable to large datasets with hundreds of taxa, and can handle a substantial amount of missing data.\n\nConclusions: \nThis study shows, for the first time, the power and feasibility of applying deep learning techniques for imputing distance matrices. Thus, this study advances the state-of-the-art in phylogenetic tree construction in the presence of missing data. The proposed methods are available in open source form at https://github.com/Ananya-Bhattacharjee/ImputeDistances .","authors":["Ananya Bhattacharjee","Md. Shamsuzzoha Bayzid"],"meta":["July 2020BMC Genomics 21(1)","DOI:10.1186/s12864-020-06892-5"],"references":["339157550_STELAR_a_statistically_consistent_coalescent-based_species_tree_estimation_method_by_maximizing_triplet_consistency","328745080_AutoImpute_Autoencoder_based_imputation_of_single-cell_RNA-seq_data","326797076_TreeN93_a_non-parametric_distance-based_method_for_inferring_viral_transmission_clusters","326582050_Imputing_missing_distances_in_molecular_phylogenetics","324950912_MEGA_X_Molecular_Evolutionary_Genetics_Analysis_across_Computing_Platforms","336011975_APPLES_Scalable_Distance-Based_Phylogenetic_Placement_with_or_without_Alignments","331765969_Species_Tree_Inference_from_Genomic_Sequences_Using_the_Log-Det_Distance","331311687_Statistical_binning_enables_an_accurate_coalescent-based_estimation_of_the_avian_tree","327166450_Zero-preserving_imputation_of_scRNA-seq_data_using_low-rank_approximation","325809116_MIDA_Multiple_Imputation_Using_Denoising_Autoencoders"]}