{"id":"343142092_Expressive_power_of_parametrized_quantum_circuits","abstract":"Parametrized quantum circuits (PQCs) have been broadly used as a hybrid quantum-classical machine learning scheme to accomplish generative tasks. However, whether PQCs have better expressive power than classical generative neural networks, such as restricted or deep Boltzmann machines, remains an open issue. In this paper, we prove that PQCs with a simple structure already outperform any classical neural network for generative tasks, unless the polynomial hierarchy collapses. Our proof builds on known results from tensor networks and quantum circuits (in particular, instantaneous quantum polynomial circuits). In addition, PQCs equipped with ancillary qubits for postselection may possess expressive power stronger than that of those without postselection. We employ them as an application for Bayesian learning, since it is possible to learn prior probabilities rather than assuming they are known. We expect that it will find many more applications in semisupervised learning where prior distributions are normally assumed to be unknown. Lastly, we conduct several numerical experiments using the Rigetti Forest platform to demonstrate the performance of the proposed Bayesian quantum circuit.","authors":["Yuxuan Du","Min-Hsiu Hsieh","Tongliang Liu","Dacheng Tao"],"meta":["July 2020Physical Review Research 2(3)","DOI:10.1103/PhysRevResearch.2.033125"],"references":["334037097_Variational_quantum_state_diagonalization","324472457_Hierarchical_quantum_classifiers","322675079_A_generative_modeling_approach_for_benchmarking_and_training_shallow_quantum_circuits","322243414_Quantum_Computing_in_the_NISQ_era_and_beyond","321873524_Unsupervised_Machine_Learning_on_a_Hybrid_Quantum_Computer","324492525_Differentiable_Learning_of_Quantum_Circuit_Born_Machine","324151137_Towards_Quantum_Machine_Learning_with_Tensor_Networks","323904931_Quantum_Machine_Learning_in_Feature_Hilbert_Spaces","323549997_Quantum_Circuit_Learning","323257435_Classification_with_Quantum_Neural_Networks_on_Near_Term_Processors"]}