{"id":"343105466_The_evolution_of_knowledge_within_and_across_fields_in_modern_physics","abstract":"The exchange of knowledge across different areas and disciplines plays a key role in the process of knowledge creation, and can stimulate innovation and the emergence of new fields. We develop here a quantitative framework to extract significant dependencies among scientific disciplines and turn them into a time-varying network whose nodes are the different fields, while the weighted links represent the flow of knowledge from one field to another at a given period of time. Drawing on a comprehensive data set on scientific production in modern physics and on the patterns of citations between articles published in the various fields in the last 30 years, we are then able to map, over time, how the ideas developed in a given field in a certain time period have influenced later discoveries in the same field or in other fields. The analysis of knowledge flows internal to each field displays a remarkable variety of temporal behaviours, with some fields of physics showing to be more self-referential than others. The temporal networks of knowledge exchanges across fields reveal cases of one field continuously absorbing knowledge from another field in the entire observed period, pairs of fields mutually influencing each other, but also cases of evolution from absorbing to mutual or even to back-nurture behaviors.","authors":["Sun Ye","Vito Latora"],"meta":["July 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-68774-w"],"references":["337279959_Early_coauthorship_with_top_scientists_predicts_success_in_academic_careers","337071140_Mapping_the_physics_research_space_a_machine_learning_approach","336557569_Efficient_team_structures_in_an_open-ended_cooperative_creativity_experiment","334061900_Exploring_the_role_of_interdisciplinarity_in_physics_Success_talent_and_luck","330223204_Taking_census_of_physics","320681151_The_science_of_science_From_the_perspective_of_complex_systems","318418703_Network_Dynamics_of_Innovation_Processes","313642438_The_Beneficial_Role_of_Mobility_for_the_Emergence_of_Innovation","329564013_The_Chaperone_Effect_in_Scientific_Publishing","329561585_Changing_demographics_of_scientific_careers_The_rise_of_the_temporary_workforce"]}