{"id":"343161913_Further_Theory_of_Neutrosophic_Triplet_Topology_and_Applications","abstract":"In this paper we study and develop the Neutrosophic Triplet Topology (NTT) that was recently introduced by Sahin et al. Like classical topology, the NTT tells how the elements of a set relate spatially to each other in a more comprehensive way using the idea of Neutrosophic Triplet Sets. This article is important because it opens new ways of research resulting in many applications in different disciplines, such as Biology, Computer Science, Physics, Robotics, Games and Puzzles and Fiber Art etc. Herein we study the application of NTT in Biology. The Neutrosophic Triplet Set (NTS) has a natural symmetric form, since this is a set of symmetric triplets of the form , <anti(A)>, where and <anti(A)> are opposites of each other, while <neuti(A)>, being in the middle, is their axis of symmetry. Further on, we obtain in this paper several properties of NTT, like bases, closure and subspace. As an application, we give a multicriteria decision making for the combining effects of certain enzymes on chosen DNA using the developed theory of NTT.","authors":["Mohammed Al Shumrani","Muhammad Gulistan","Florentin Smarandache"],"meta":["July 2020Symmetry 12(8)","DOI:10.3390/sym12081207","Project: Some Applications of Neutrosophic cubic sets in multi-criteria decision making"],"references":["344071748_Introduction_to_Neutrosophic_Hypernear-rings","343862637_Covering-Based_Rough_Fuzzy_Intuitionistic_Fuzzy_and_Neutrosophic_Nano_Topology_and_Applications","333547617_An_application_of_complex_neutrosophic_sets_to_the_theory_of_groups","330252186_Some_Topological_and_Algebraic_Properties_of_a-level_Subsets'_Topology_of_a_Fuzzy_Subset","328803753_Neutrosophic_Triplet_Non-Associative_Semihypergroups_with_Application","328019101_Neutrosophic_triplet_group","328018476_Neutrosophic_Duplet_Semi-Group_and_Cancellable_Neutrosophic_Triplet_Groups","325588571_Some_Results_on_Neutrosophic_Triplet_Group_and_Their_Applications","324698750_Neutrosophic_Triplet_Cosets_and_Quotient_Groups","338935593_Regular_and_Intra-Regular_Neutrosophic_Left_Almost_Semihypergroups"]}