{"id":"343106326_A_Modified_Convolutional_Neural_Networks_Model_for_Medical_Image_Segmentation","abstract":"Medical image segmentation is a crucial step in developing computer-Aided Diagnosis (CAD), which supports the physician to adopt a suitable procedure about the clinical case. Lung cancer, Tuberculosis, and Pneumonia are the most dangerous threats that attack the human lungs and result in high global mortality. Precise lung segmentation from X-ray and Computed Tomography (CT) is a challenge due to the irregular shape and high ambiguity in lung edges with the background. This paper aims to develop a sufficient approach with robust lung segmentation, less time, and minimum processing cost. U-net is a deep convolustional neural network architecture; it is mostly designed for medical image segmentation. A standard kernels' number at each convolutional layer in U-net is utilized to abstract the wealthy data from the medical images. In this paper, we proposed a modified U-net model based on the reduction of kernels' number in each layer. The modification involves employing only 25% of the standard kernel's number to extract ROI from the chest images. We compare between the standard and modified U-net segmentation results using 263 X-ray images from Shenzhen dataset and 269 CT images from LUNA16 dataset. The experimental results indicate the contribution of our modified U-net to improve the global accuracy, Jaccard, and Dice metrics of the standard U-net by. Besides, the modified U-net takes about 30% of the standard U-net time to learn the network and build the proposed segmentation model. The proposed U-net architecture with a minimized kernels' number indicates the possibility to increase the lung segmentation precision in terms of some performance metrics and decrease the network learning time in terms of mean iteration time.","authors":["Dathar Abas Hasan","Adnan Mohsin Abdulazeez"],"meta":["July 2020Test Engineering and Management 83(May - June 2020):16798 - 16808","Project: Deep Learning"],"references":["341119552_Systematic_Review_of_Unsupervised_Genomic_Clustering_Algorithms_Techniques_for_High_Dimensional_Datasets","341119469_Machine_Learning_Supervised_Algorithms_of_Gene_Selection_A_Review","339646247_Gene_Expression_Classification_Based_on_Deep_Learning","345686660_Convolutional_Neural_Networks_in_Visual_Computing_A_Concise_Guide","341119467_FACE_RECOGNITION_USING_STATISTICAL_FEATURE_EXTRACTION_AND_NEURAL_NETWORK","338775687_An_automatic_method_for_lung_segmentation_and_reconstruction_in_chest_X-ray_using_deep_neural_networks","338454615_An_effective_approach_for_CT_lung_segmentation_using_mask_region-based_convolutional_neural_networks","337081096_Classification_Of_Dna_Damages_On_Segmented_Comet_Assay_Images_Using_Convolutional_Neural_Network","336875460_A_new_convolutional_neural_network_model_for_peripapillary_atrophy_area_segmentation_from_retinal_fundus_images","336420824_Automated_Melanoma_Staging_in_Lymph_Node_Biopsy_Image_using_Deep_Learning"]}