{"id":"343197785_Metabolic_Modelling_as_a_Framework_for_Metabolomics_Data_Integration_and_Analysis","abstract":"Metabolic networks are regulated to ensure the dynamic adaptation of biochemical reaction fluxes to maintain cell homeostasis and optimal metabolic fitness in response to endogenous and exogenous perturbations. To this end, metabolism is tightly controlled by dynamic and intricate regulatory mechanisms involving allostery, enzyme abundance and post-translational modifications. The study of the molecular entities involved in these complex mechanisms has been boosted by the advent of high-throughput technologies. The so-called omics enable the quantification of the different molecular entities at different system layers, connecting the genotype with the phenotype. Therefore, the study of the overall behavior of a metabolic network and the omics data integration and analysis must be approached from a holistic perspective. Due to the close relationship between metabolism and cellular phenotype, metabolic modelling has emerged as a valuable tool to decipher the underlying mechanisms governing cell phenotype. Constraint-based modelling and kinetic modelling are among the most widely used methods to study cell metabolism at different scales, ranging from cells to tissues and organisms. These approaches enable integrating metabolomic data, among others, to enhance model predictive capabilities. In this review, we describe the current state of the art in metabolic modelling and discuss future perspectives and current challenges in the field.","authors":["Svetlana Volkova","Marta R. A. Matos","Matthias Mattanovich","Igor Marín de Mas"],"meta":["July 2020Metabolites 10(8):303","DOI:10.3390/metabo10080303"],"references":["339905525_K-FIT_An_accelerated_kinetic_parameterization_algorithm_using_steady-state_fluxomic_data","339635928_MEMOTE_for_standardized_genome-scale_metabolic_model_testing","339167266_Protein_allocation_and_enzymatic_constraints_explain_Escherichia_coli_wildtype_and_mutant_phenotypes","338605962_The_ETFL_formulation_allows_multi-omics_integration_in_thermodynamics-compliant_metabolism_and_expression_models","337029604_Bayesian_inference_of_metabolic_kinetics_from_genome-scale_multiomics_data","334895400_Stoichiometric_gene-to-reaction_associations_enhance_model-driven_analysis_performance_Metabolic_response_to_chronic_exposure_to_Aldrin_in_prostate_cancer","334634063_An_unconventional_uptake_rate_objective_function_approach_enhances_applicability_of_genome-scale_models_for_mammalian_cells","336180396_Metabolic_kinetic_modeling_provides_insight_into_complex_biological_questions_but_hurdles_remain","335520919_High-resolution_13C_metabolic_flux_analysis","332997615_A_White-Box_Machine_Learning_Approach_for_Revealing_Antibiotic_Mechanisms_of_Action"]}