{"id":"343165418_A_methodology_for_multilayer_networks_analysis_in_the_context_of_open_and_private_data_biological_application","abstract":"Abstract Recently, an increasing body of work investigates networks with multiple types of links. Variants of such systems have been examined decades ago in disciplines such as sociology and engineering, but only recently have they been unified within the framework of multilayer networks. In parallel, many aspects of real systems are increasingly and routinely sensed, measured and described, resulting in many private, but also open data sets. In many domains publicly available repositories of open data sets constitute a great opportunity for domain experts to contextualise their privately generated data compared to publicly available data in their domain. We propose in this paper a methodology for multilayer network analysis in order to provide domain experts with measures and methods to understand, evaluate and complete their private data by comparing and/or combining them with open data when both are modelled as multilayer networks. We illustrate our methodology through a biological application where interactions between molecules are extracted from open databases and modelled by a multilayer network and where private data are collected experimentally. This methodology helps biologists to compare their private networks with the open data, to assess the connectivity between the molecules across layers and to compute the distribution of the identified molecules in the open network. In addition, the shortest paths which are biologically meaningful are also analysed and classified.","authors":["Maria Malek","Simone Zorzan","Mohammad Ghoniem"],"meta":["July 2020Applied Network Science 5(1)","DOI:10.1007/s41109-020-00277-z"],"references":["339593592_Towards_Visual_Analytics_of_Multilayer_Graphs_for_Digital_Cultural_Heritage","332068073_The_State_of_the_Art_in_Multi-Layer_Network_Visualization","329218721_STRING_v11_protein-protein_association_networks_with_increased_coverage_supporting_functional_discovery_in_genome-wide_experimental_datasets","324761102_Finding_overlapping_communities_in_multilayer_networks","284275693_STITCH_5_Augmenting_protein-chemical_interaction_networks_with_tissue_and_affinity_data","329440733_Personal_Networks_of_Scientific_Collaborators_A_Large_Scale_Experimental_Analysis_of_Their_Evolution","324435512_Multilayer_Networks_in_a_Nutshell","320848558_Network_Science_of_Biological_Systems_at_Different_Scales_A_Review","320184203_Personal_Networks_of_Scientific_Collaborators_A_Large_Scale_Experimental_Analysis_of_Their_Evolution","313102947_KEGG_Kyoto_encyclopedia_of_genes_and_genomes","261732150_Structural_measures_for_multiplex_networks","257142871_Multilayer_Networks","253644715_Pareto_Distance_for_Multi-layer_Network_Analysis","268817412_The_Structure_and_Dynamics_of_Multilayer_Networks","257676620_Multidimensional_networks_Foundations_of_structural_analysis"]}