{"id":"343172160_e-HUNSR_An_Efficient_Algorithm_for_Mining_High_Utility_Negative_Sequential_Rules","abstract":"As an important technology in computer science, data mining aims to mine hidden, previously unknown, and potentially valuable patterns from databases.High utility negative sequential rule (HUNSR) mining can provide more comprehensive decision-making information than high utility sequential rule (HUSR) mining by taking non-occurring events into account. HUNSR mining is much more difficult than HUSR mining because of two key intrinsic complexities. One is how to define the HUNSR mining problem and the other is how to calculate the antecedent’s local utility value in a HUNSR, a key issue in calculating the utility-confidence of the HUNSR. To address the intrinsic complexities, we propose a comprehensive algorithm called e-HUNSR and the contributions are as follows. (1) We formalize the problem of HUNSR mining by proposing a series of concepts. (2) We propose a novel data structure to store the related information of HUNSR candidate (HUNSRC) and a method to efficiently calculate the local utility value and utility of HUNSRC’s antecedent. (3) We propose an efficient method to generate HUNSRC based on high utility negative sequential pattern (HUNSP) and a pruning strategy to prune meaningless HUNSRC. To the best of our knowledge, e-HUNSR is the first algorithm to efficiently mine HUNSR. The experimental results on two real-life and 12 synthetic datasets show that e-HUNSR is very efficient.","authors":["Mengjiao Zhang","Tiantian Xu","Zhao Li","Xiqing Han"],"meta":["July 2020Symmetry 12(8):1211","DOI:10.3390/sym12081211"],"references":["343268441_Efficient_Association_Rules_Hiding_Using_Genetic_Algorithms","339548076_Efficient_Chain_Structure_for_High-Utility_Sequential_Pattern_Mining","331490832_Finding_College_Student_Social_Networks_by_Mining_the_Records_of_Student_ID_Transactions","328686002_Efficient_Association_Rules_Hiding_Using_Genetic_Algorithms","328110471_e-RNSP_An_Efficient_Method_for_Mining_Repetition_Negative_Sequential_Patterns","334888973_An_Efficient_Method_for_Pruning_Redundant_Negative_and_Positive_Association_Rules","332926718_An_Efficient_Method_for_Mining_High_Utility_Closed_Itemsets","331238480_HUOPM_High-Utility_Occupancy_Pattern_Mining","330296199_Mining_Top-k_Useful_Negative_Sequential_Patterns_via_Learning","328008110_Finding_tendencies_in_streaming_data_using_Big_Data_frequent_itemset_mining"]}