{"id":"343114344_Quantum_walks_The_mean_first_detected_transition_time","abstract":"We consider the quantum first detection problem for a particle evolving on a graph under repeated projective measurements with fixed rate 1/τ. A general formula for the mean first detected transition time is obtained for a quantum walk in a finite-dimensional Hilbert space where the initial state |ψin〉 of the walker is orthogonal to the detected state |ψd〉. We focus on diverging mean transition times, where the total detection probability exhibits a discontinuous drop of its value by mapping the problem onto a theory of fields of classical charges located on the unit disk. Close to the critical parameters of the model, we find simple expressions describing the blow-up of the mean transition time. Using previous results on the fluctuations of the return time, corresponding to |ψin〉=|ψd〉, we find close to these critical parameters that the mean transition time is proportional to the fluctuations of the return time, an expression reminiscent of the Einstein relation.","authors":["Quancheng Liu","Ruoyu Yin","K. Ziegler","Eli Barkai"],"meta":["July 2020Physical Review Research 2(3)","DOI:10.1103/PhysRevResearch.2.033113","Projects: quantum random walks, and the quantum first detection problem.infinite ergodic theory, ageing 1/f noise, rare events, anomalous diffusion\"Monitored\" quantum walks: unitary-eraser process"],"references":["342486579_Uncertainty_and_symmetry_bounds_for_the_quantum_total_detection_probability","340959074_Complex_Spacing_Ratios_A_Signature_of_Dissipative_Quantum_Chaos","337086110_Large_fluctuations_of_the_first_detected_quantum_return_time","336203685_Universal_Spectra_of_Random_Lindblad_Operators","334617696_Measurement-Induced_Phase_Transitions_in_the_Dynamics_of_Entanglement","333691682_Exact_nonequilibrium_quantum_observable_statistics_A_large-deviation_approach","340031106_Disentangling_quantum_matter_with_measurements","339805959_Conditional_probability_distributions_of_finite_absorbing_quantum_walks","339417679_Critical_properties_of_the_measurement-induced_transition_in_random_quantum_circuits","327902284_Quantum_dynamics_with_stochastic_reset"]}