{"id":"343144613_Adaptive_Wavelet_Based_MRI_Brain_Image_De-noising","abstract":"This paper presents a unique approach for wavelet-based MRI brain image de-noising. Adaptive soft and hard threshold functions are first proposed to improve the results of standard soft and hard threshold functions for image de-noising in the wavelet domain. Then, we applied the newly emerged improved adaptive generalized Gaussian distributed oriented threshold function (improved AGGD) on the MRI images to improve the results of the adaptive soft and hard threshold functions and also to display, this non-linear and data-driven function can work promisingly even in de-noising the medical images. The most important characteristic of this function is that it is dependent on the image since it is combined with an adaptive generalized Gaussian distribution function.Traditional thresholding neural network (TNN) and optimized based noise reduction have good results but fail to keep the visual quality and may blur some parts of an image. In TNN and optimized based image de-noising, it was required to use Least-mean-square (LMS) learning and optimization algorithms, respectively to find the optimum threshold value and parameters of the threshold functions which was time consuming. To address these issues, the improved AGGD based image de-noising approach is introduced to enhance the qualitative and quantitative performance of the above mentioned image de-noising techniques. De-noising using improved AGGD threshold function provides better results in terms of Peak Signal to Noise Ratio (PSNR) and also faster processing time since there is no need to use any Least-mean-square (LMS) learning and optimization algorithms for obtaining the optimum value and parameters of the thresholding functions. The experimental results indicate that image de-noising using improved AGGD threshold performs pretty well comparing with the adaptive threshold, standard threshold, improved wavelet threshold, and the optimized based noise reduction methods.","authors":["Noorbakhsh Amiri Golilarz","Hui Gao","Rajesh Kumar","Liaqat Ali"],"meta":["July 2020Frontiers in Neuroscience 14:728","DOI:10.3389/fnins.2020.00728"],"references":["331416553_Harris_hawks_optimization_Algorithm_and_applications","330975479_Improved_Wavelet_Threshold_for_Image_De-noising","330878414_Hyper-Spectral_Remote_Sensing_Image_De-Noising_with_Three_Dimensional_Wavelet_Transform_Utilizing_Smooth_Nonlinear_Soft_Thresholding_Function","321183351_Translation_Invariant_Wavelet_Based_Noise_Reduction_Using_a_New_Smooth_Nonlinear_Improved_Thresholding_Function","332772781_Satellite_Image_De-Noising_With_Harris_Hawks_Meta_Heuristic_Optimization_Algorithm_and_Improved_Adaptive_Generalized_Gaussian_Distribution_Threshold_Function","331465639_Adaptive_Generalized_Gaussian_Distribution_Oriented_Thresholding_Function_for_Image_De-Noising","330586832_Image_Denoising_Algorithm_Based_on_Improved_Wavelet_Threshold_Function_and_Median_Filter","324096068_Highly_Accurate_Image_Reconstruction_for_Multimodal_Noise_Suppression_Using_Semisupervised_Learning_on_Big_Data","321197927_Thresholding_Neural_Network_TNN_with_Smooth_Sigmoid_Based_Shrinkage_SSBS_Function_for_Image_De-noising","321197919_Image_De-noising_using_Un-decimated_Wavelet_Transform_UWT_with_Soft_Thresholding_Technique"]}