{"id":"343144198_Beyond_ranking_nodes_Predicting_epidemic_outbreak_sizes_by_network_centralities","abstract":"Identifying important nodes for disease spreading is a central topic in network epidemiology. We investigate how well the position of a node, characterized by standard network measures, can predict its epidemiological importance in any graph of a given number of nodes. This is in contrast to other studies that deal with the easier prediction problem of ranking nodes by their epidemic importance in given graphs. As a benchmark for epidemic importance, we calculate the exact expected outbreak size given a node as the source. We study exhaustively all graphs of a given size, so do not restrict ourselves to certain generative models for graphs, nor to graph data sets. Due to the large number of possible nonisomorphic graphs of a fixed size, we are limited to ten-node graphs. We find that combinations of two or more centralities are predictive (R² scores of 0.91 or higher) even for the most difficult parameter values of the epidemic simulation. Typically, these successful combinations include one normalized spectral centrality (such as PageRank or Katz centrality) and one measure that is sensitive to the number of edges in the graph.","authors":["Doina Bucur","Petter Holme"],"meta":["July 2020PLoS Computational Biology 16(7):e1008052","DOI:10.1371/journal.pcbi.1008052"],"references":["321902156_Can_co-location_be_used_as_a_proxy_for_face-to-face_contacts","315489452_On_the_predictability_of_infectious_disease_outbreaks","307536753_Statistical_physics_of_vaccination","337955400_Sampling_on_Networks_Estimating_Eigenvector_Centrality_on_Incomplete_Networks","327765854_Modern_infectious_disease_epidemiology_Third_edition","319235932_Three_faces_of_node_importance_in_network_epidemiology_Exact_results_for_small_graphs","318454027_Mathematics_of_Epidemics_on_Networks","308980897_Fundamental_difference_between_superblockers_and_superspreaders_in_networks","305275489_Mathematical_models_to_characterize_early_epidemic_growth_A_Review","304744011_Vital_nodes_identification_in_complex_networks"]}