{"id":"343166640_eSTIMe_une_approche_visuelle_interactive_et_modulable_pour_l'analyse_multi-points_de_vue_des_mobilites_quotidiennes","abstract":"Les données de mobilité quotidienne décrivant les déplacements des individus constituent une source d’information importante pour analyser la dynamique des territoires et les modes de vie de ses habitants. Beaucoup d’experts impliqués dans des domaines variés des politiques urbaines ont besoin de manipuler ces données pour extraire et exploiter facilement des connaissances synthétiques. Cet article décrit un environnement de géovisualisation, eSTIMe, qui permet aux utilisateurs d’explorer la mobilité quotidienne à travers trois questionnements : les flux de déplacements, l’évolution des présences de la population sur les territoires, les programmes d’activités des individus. L’approche générale eSTIMe est organisée en quatre étapes : (i) structuration des données, (ii) construction des indicateurs, (iii) interrogation par requêtes spatio-temporelles, (iv) visualisation des analyses. L’environnement géovisuel repose sur le principe de tableaux de bord modulables intégrés dans un système multi-écrans donnant à l’utilisateur la flexibilité d’organiser ses espaces visuels de travail à façon en fonction des besoins d’analyse. Des techniques originales d’interactions tactiles et tangibles sont aussi proposées pour favoriser la visualisation des dynamiques. Deux études de cas illustrent comment l’outil permet de construire des analyses exploratoires. Sur la base de trois expérimentations, l’outil eSTIMe est jugé utile pour décrire les phénomènes de mobilité selon différents points de vue en faisant varier la granularité spatiale et temporelle et les attributs. L’outil nécessite plusieurs écrans et une tablette pouvant limiter son intégration dans un usage professionnel quotidien. Cependant, les utilisateurs ont fortement apprécié la mise à disposition d’une variété d’indicateurs prêts à être interrogés et visualisés.","authors":["Aline Menin","Sonia Chardonnel","Paule-Annick Davoine","Michael Ortega"],"meta":["July 2020Geomatica 74(1)","DOI:10.1139/geomat-2020-0006","Project: Visualization of Daily Mobility Data"],"references":["337007305_eSTIMe_Towards_an_All-in-One_Geovisualization_Environment_for_Daily_Mobility_Analysis","329466569_Interaction_Tangible_sur_Table_definitions_et_modeles","326551461_Exploring_Shifting_Densities_through_a_Movement-based_Cartographic_Interface","324435738_Mobiles_as_Portals_for_Interacting_with_Virtual_Data_Visualizations","339067783_Contribution_a_la_cartographie_d'une_matrice_de_flux_Presentation_de_la_these_en_images_commentees","329635839_RelationLines_Visual_Reasoning_of_Egocentric_Relations_from_Heterogeneous_Urban_Data","324383563_Dynamic_Graphics_for_Statistics","321845742_Centralites_des_espaces_peripheriques_et_complementarites_territoriales_un_enjeu_de_durabilite_pour_la_Region_Urbaine_de_Grenoble","319326208_VISTILES_Coordinating_and_Combining_Co-located_Mobile_Devices_for_Visual_Data_Exploration","318202257_GraSp_Combining_Spatially-aware_Mobile_Devices_and_a_Display_Wall_for_Graph_Visualization_and_Interaction"]}