{"id":"343206624_Modeling_Soft_Analytical_Side-Channel_Attacks_from_a_Coding_Theory_Viewpoint","abstract":"One important open question in side-channel analysis is to find out whether all the leakage samples in an implementation can be exploited by an adversary, as suggested by masking security proofs. For attacks exploiting a divide-and-conquer strategy, the answer is negative: only the leakages corresponding to the first/last rounds of a block cipher can be exploited. Soft Analytical Side-Channel Attacks (SASCA) have been introduced as a powerful solution to mitigate this limitation. They represent the target implementation and its leakages as a code (similar to a Low Density Parity Check code) that is decoded thanks to belief propagation. Previous works have shown the low data complexities that SASCA can reach in practice. In this paper, we revisit these attacks by modeling them with a variation of the Random Probing Model used in masking security proofs, that we denote as the Local Random Probing Model (LRPM). Our study establishes interesting connections between this model and the erasure channel used in coding theory, leading to the following benefits. First, the LRPM allows bounding the security of concrete implementations against SASCA in a fast and intuitive manner. We use it in order to confirm that the leakage of any operation in a block cipher can be exploited, although the leakages of external operations dominate in known-plaintext/ciphertext attack scenarios. Second, we show that the LRPM is a tool of choice for the (nearly worst-case) analysis of masked implementations in the noisy leakage model, taking advantage of all the operations performed, and leading to new tradeoffs between their amount of randomness and physical noise level. Third, we show that it can considerably speed up the evaluation of other countermeasures such as shuffling.","authors":["Qian Guo","Vincent Grosso","François-Xavier Standaert","Olivier Bronchain"],"meta":["January 2020","DOI:10.13154/tches.v2020.i4.209-238"],"references":["325588643_Unifying_Leakage_Models_From_Probing_Attacks_to_Noisy_Leakage","281329466_Soft_Analytical_Side-Channel_Attacks","264915525_How_to_Certify_the_Leakage_of_a_Chip","224242490_One_for_all_-_All_for_one_Unifying_standard_differential_power_analysis_attacks","346705898_Towards_Globally_Optimized_Masking_From_Low_Randomness_to_Low_Noise_Rate_or_Probe_Isolating_Multiplications_with_Reduced_Randomness_and_Security_against_Horizontal_Attacks","322465158_Making_Masking_Security_Proofs_Concrete_Or_How_to_Evaluate_the_Security_of_Any_Leaking_Device_Extended_Version","295861254_Multi-target_DPA_Attacks_Pushing_DPA_Beyond_the_Limits_of_a_Desktop_Computer","221603022_Reverend_Bayes_on_Inference_Engines_A_Distributed_Hierarchical_Approach","221291925_Multiplicative_Masking_and_Power_Analysis_of_AES","220695762_InformationTheory_Inference_and_Learning_Algorithms"]}