{"id":"343243687_Self-Referencing_Embedded_Strings_SELFIES_A_100_robust_molecular_string_representation","abstract":"The discovery of novel materials and functional molecules can help to solve some of society's most urgent challenges, ranging from efficient energy harvesting and storage to uncovering novel pharmaceutical drug candidates. Traditionally matter engineering -- generally denoted as inverse design -- was based massively on human intuition and high-throughput virtual screening. The last few years have seen the emergence of significant interest in computer-inspired designs based on evolutionary or deep learning methods. The major challenge here is that the standard strings molecular representation SMILES shows substantial weaknesses in that task because large fractions of strings do not correspond to valid molecules. Here, we solve this problem at a fundamental level and introduce \\selfies (SELF-referencIng Embedded Strings), a string-based representation of molecules which is 100\\% robust. Every \\selfies string corresponds to a valid molecule, and \\selfies can represent every molecule. \\selfies can be directly applied in arbitrary machine learning models without the adaptation of the models; each of the generated molecule candidates is valid. In our experiments, the model's internal memory stores two orders of magnitude more diverse molecules than a similar test with SMILES. Furthermore, as all molecules are valid, it allows for explanation and interpretation of the internal working of the generative models.","authors":["Mario Krenn","Florian Häse","Akshatkumar Nigam","Pascal Friederich"],"meta":["July 2020Machine Learning Science and Technology 1(4)","DOI:10.1088/2632-2153/aba947"],"references":["338463447_Discovering_Physical_Concepts_with_Neural_Networks","333301160_Deep_learning_for_molecular_design_-_a_review_of_the_state_of_the_art","331017657_Graph-based_genetic_algorithm_and_generative_modelMonte_Carlo_tree_search_for_the_exploration_of_chemical_space","329843608_How_machine_learning_can_assist_the_interpretation_of_ab_initio_molecular_dynamics_simulations_and_conceptual_understanding_of_chemistry","328581919_Experimental_Greenberger-Horne-Zeilinger_entanglement_beyond_qubits","311306736_Quantum-Chemical_Insights_from_Deep_Tensor_Neural_Networks","330396661_How_to_explore_chemical_space_using_algorithms_and_automation","326644066_Inverse_molecular_design_using_machine_learning_Generative_models_for_matter_engineering","323184550_Isolating_Sources_of_Disentanglement_in_Variational_Autoencoders","322964437_Deep_Generative_Models_for_Molecular_Science"]}