{"id":"343265561_Analysis_and_comparison_of_machine_learning_classifiers_and_deep_neural_networks_techniques_for_recognition_of_Farsi_handwritten_digits","abstract":"Handwriting recognition remains a challenge in the machine vision field, especially in optical character recognition (OCR). The OCR has various applications such as the detection of handwritten Farsi digits and the diagnosis of biomedical science. In expanding and improving quality of the subject, this research focus on the recognition of Farsi Handwriting Digits and illustration applications in biomedical science. The detection of handwritten Farsi digits is being widely used in most contexts involving the collection of generic digital numerical information, such as reading checks or digits of postcodes. Selecting an appropriate classifier has become an issue highlighted in the recognition of handwritten digits. The paper aims at identifying handwritten Farsi digits written with different handwritten styles. Digits are classified using several traditional methods, including K-nearest neighbor, artificial neural network (ANN), and support vector machine (SVM) classifiers. New features of digits, namely, geometric and correlation-based features, have demonstrated to achieve better recognition performance. A noble class of methods, known as deep neural networks (DNNs), is also used to identify handwritten digits through machine vision. Here, two types of introduce its expansion form, a convolutional neural network (CNN) and an auto-encoder, are implemented. Moreover, by using a new combination of CNN layers one can obtain improved results in classifying Farsi digits. The performances of the DNN-based and traditional classifiers are compared to investigate the improvements in accuracy and calculation time. The SVM shows the best results among the traditional classifiers, whereas the CNN achieves the best results among the investigated techniques. The ANN offers better execution time than the SVM, but its accuracy is lower. The best accuracy among the traditional classifiers based on all investigated features is 99.3% accuracy obtained by the SVM, and the CNN achieves the best overall accuracy of 99.45%.","authors":["Y. A. Nanehkaran","Defu Zhang","S. Salimi","Junde Chen"],"meta":["April 2021The Journal of Supercomputing 77(2)","DOI:10.1007/s11227-020-03388-7"],"references":["339878797_BDNet_Bengali_Handwritten_Numeral_Digit_Recognition_based_on_Densely_connected_Convolutional_Neural_Networks","339479228_Sankhya_An_Unbiased_Benchmark_for_Bangla_Handwritten_Digits_Recognition","333961262_A_unified_algorithm_based_on_HTS_and_self-adapting_PSO_for_the_construction_of_octagonal_and_rectilinear_SMT","331069280_Handwritten_Farsi_Word_Recognition_Using_NN-Based_Fusion_of_HMM_Classifiers_with_Different_Types_of_Features","339554550_Handwritten_Character_Recognition_Using_Unique_Feature_Extraction_Technique","334096334_An_Efficient_Digit_Recognition_System_with_an_Improved_Preprocessing_Technique","332880627_High_Quality_Wavelets_Features_Extraction_for_Handwritten_Arabic_Numerals_Recognition","332004752_Assistive_pointer_device_for_limb_impaired_people_A_novel_Frontier_Point_Method_for_hand_movement_recognition","331037542_Farsi_Handwriting_Digit_Recognition_Based_on_Convolutional_Neural_Networks","329674680_Multi-Language_Handwritten_Digits_Recognition_based_on_Novel_Structural_Features","323367760_Performance_comparison_of_different_momentum_techniques_on_deep_reinforcement_learning","328694654_A_novel_method_for_Persian_Handwritten_digit_recognition_using_support_vector_machines","328400673_Hybrid_neural_models_for_automatic_handwritten_digits_recognition","324945901_New_Algorithms_for_the_Unbalanced_Generalized_Birthday_Problem","323632874_Event-triggered_dissipative_control_for_networked_stochastic_systems_under_non-uniform_sampling"]}