{"id":"343262693_IOT_connected_with_e-learning","abstract":"In the networking field, Internet of Things (IoT) can be referred to technological e-learning advancements. It is seen that through the internet, nowadays it becomes easier to be connected with the real world affairs by being acknowledges about the all-around happenings. Even everyone is aware about communicating with each other all over world. 'Things' can be specified as the objects which are connected through internet.Over the internet, the specific kind of interconnection of different things can serve its capability through the information which can be utilized in receiving and sending of evaluated data. It is said to be specialized in almost every field that can be determined in numerous manner for implementing wide range of applications format. Wide ranges can be mentioned aseducation, business, transportation, agriculture, healthcare and management. In a generalized manner, in this article specifically and mainly the discussion is being held over the Internet of Things (IoT). Specific emphasis on E-learning is said to be implemented as a source of information applied for its readers. By the utilization of smart learning as the IOT the smart techniques can also be represented shown by e-learning methods.","authors":["Vishal Dineshkumar Soni"],"meta":["October 2019International Journal on Integrated Education 2(5):273-277"],"references":["328477764_ROLE_OF_INTERNET_OF_THINGS_IOT_IN_HIGHER_EDUCATION","324828905_Deep_Learning_with_Dense_Random_Neural_Networks_for_Detecting_Attacks_against_IoT-connected_Home_Environment","322249356_INTERNET_OF_THINGS_IOT_ADVANTAGES_ON_E-LEARNING_IN_THE_SMART_CITIES","317546840_Solution_Integration_Approach_using_IoT_in_Education_System","315599751_Predictable_Influence_of_IoT_Internet_of_Things_in_the_Higher_Education","326566738_Implementation_of_an_IoT-Based_E-Learning_Testbed_Performance_Evaluation_Using_Mean-Shift_Clustering_Approach_Considering_Four_Types_of_BrainWaves","318700318_Internet_of_Things_and_its_applications_in_E-learning","315659192_Design_and_implementation_of_an_IoT-based_e-learning_testbed"]}