{"id":"343297399_Classification_of_Paper_Values_Based_on_Citation_Rank_and_PageRank","abstract":"Purpose\nThe number of citations has been widely used to measure the significance of a paper. However, there is a need in introducing another index to determine superiority or inferiority of papers with the same number of citations. We determine superiority or inferiority of papers by using the ranking based on the number of citations and PageRank.\n\nDesign/methodology/approach\nWe show the positive linear correlation between Citation Rank (the ranking of the number of citation) and PageRank. On this basis, we identify high-quality, prestige, emerging, and popular papers.\n\nFindings\nWe found that the high-quality papers belong to the subjects of biochemistry and molecular biology, chemistry, and multidisciplinary sciences. The prestige papers correspond to the subjects of computer science, engineering, and information science. The emerging papers are related to biochemistry and molecular biology, as well as those published in the journal “Cell.” The popular papers belong to the subject of multidisciplinary sciences.\n\nResearch limitations\nWe analyze the Science Citation Index Expanded (SCIE) from 1981 to 2015 to calculate Citation Rank and PageRank within a citation network consisting of 34,666,719 papers and 591,321,826 citations.\n\nPractical implications\nOur method is applicable to forecast emerging fields of research subjects in science and helps policymakers to consider science policy.\n\nOriginality/value\nWe calculated PageRank for a giant citation network which is extremely larger than the citation networks investigated by previous researchers.","authors":["Wataru Souma","Irena Vodenska","Lubomir T. Chitkushev"],"meta":["July 2020Journal of Data and Information Science 5(3)","DOI:10.2478/jdis-2020-0031"],"references":["326495318_Progress_of_Studies_of_Citations_and_PageRank","307473228_Identification_of_milestone_papers_through_time-balanced_network_centrality","281576301_Ranking_nodes_in_growing_networks_When_PageRank_fails","228108125_Journal_Status","225805102_The_M06_suite_of_density_functionals_for_main_group_thermochemistry_thermochemical_kinetics_noncovalent_interactions_excited_states_and_transition_elements_two_new_functionals_and_systematic_testing_o","339461714_New_Measures_of_Journal_Impact_Based_on_the_Number_of_Citations_and_PageRank","313491236_Random_early_detection_gateways_for_congestion_avoidance","284776723_Cognitive_radio_Brain-empowered_wireless_communications_selected_areas_in_communications","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","235236676_Opposing_effects_of_ERK_and_JNK-p38_MAP_kinases_on_apoptosis"]}