{"id":"343231761_Conceptual_Assessments_of_the_Formation_of_Socially_Oriented_Organizations","abstract":"Socially oriented non-profit organizations (SО NPOs) possessing a powerful functional resource and an active response to social problems are able to solve them without using state assistance. Currently, SO NCOs have become the subject of research in various fields of scientific knowledge, which is explained by their versatile functional activity, practical reflection of modern problems of all spheres of society. The author in modern scientific knowledge identifies the following aspects of the study of NPOs: conceptualization of the very concept of “non-profit organizations”; analysis of SО NPOs as innovative social practice; identification and description of modern trends in the development of SО NPOs, their functional features; analysis of the regulatory framework of these organizations; kinds and types of socially-oriented non-profit organizations, etc. The article analyzes the conditions and factors of the formation of NPOs in the context of the analysis of a number of concepts of representatives of post-industrialism: D. Bella (post-industrial society), E. Toffler (“third wave” society), E. Giddens, E. Masouda (“computer science”), A. Turen (“program society”), M. Castells (network information society). It is noted that these scientists giving different assessments and characteristics of the post-industrial society were united in the characterization of knowledge, information as innovative resources for the development of society, which have both positive and negative results, which was the basis for the emergence of various social organizations, unions and movements. Scientists connect all the processes taking place in society with a change in the driving forces of the development of civilization, which become knowledge, intelligence, not only as a value, but also as a commodity.","authors":["Liga Ekaterina M."],"meta":["July 2020Humanitarian Vector 15(4):17-23","DOI:10.21209/1996-7853-2020-15-4-17-23"],"references":["312975805_The_age_of_social_transformation","296825826_Transformations_in_modern_civilizations_postindustrial_and_post-economic_society_-_A_round-table_discussion","288254602_Future_post-industrial_society_Experience_of_social_forecasting","248011333_The_Silent_Revolution_Changing_Values_And_Political_Styles_Among_Western_Publics","238678654_The_Work_of_Nations_Preparing_Ourselves_For_21st_Century_Capitalism"]}