{"id":"343201004_An_Information-Centric_Networking_Based_Registry_for_Decentralized_Identifiers_and_Verifiable_Credentials","abstract":"Decentralized Identifiers (DIDs) are new self-manageable means of authentication, which is currently under standardization by the World Wide Web Consortium (W3C). Closely related to DIDs, verifiable credentials (VCs) are another ongoing standardization effort (by the same W3C working group) that enables privacy-preserving and cryptographically secure proofs of attribute ownership. Both these approaches assume in their core an immutable decentralized registry (e.g., a blockchain, or a p2p network) in which critical meta-data is recorded. However, W3C’s standards do not specify how this registry is implemented, instead this is left as an open implementation choice. In this paper we design, implement, and evaluate a secure DID/VC registry service using the emerging paradigm of Information Centric Networking (ICN). In order to achieve our goal, we combine the decentralized nature, and the “lookup by name” property of ICN, with a secure mechanism for maintaining synchronized replicas of an item in multiple locations. Due to ICN’s inherent support for multicast and caching, our construction imposes small network overhead, and achieves low lookup times.","authors":["Bander A. Alzahrani"],"meta":["July 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3011656"],"references":["336345330_Towards_peer-to-peer_content_retrieval_markets_Enhancing_IPFs_with_ICN","340160840_Improving_mobile_ad_hoc_networks_using_hybrid_IP-Information_Centric_Networking","336340517_Secure_Scuttlebutt_An_Identity-Centric_Protocol_for_Subjective_and_Decentralized_Applications","336340213_The_Missing_Piece_On_Namespace_Management_in_NDN_and_How_DNSSEC_Might_Help","333008961_Self-Sovereign_Digital_Identity_A_Paradigm_Shift_for_Identity","330120008_A_Brief_Introduction_to_NDN_Dataset_Synchronization_NDN_Sync","322646100_Edge-ICN_and_its_application_to_the_Internet_of_Things","319885696_NDNS_A_DNS-Like_Name_Service_for_NDN","305675164_Stateless_multicast_switching_in_software_defined_networks","278165689_MobilityFirst_A_Mobility-Centric_and_Trustworthy_Internet_Architecture"]}