{"id":"343250001_Automatic_Detection_of_White_Blood_Cancer_From_Bone_Marrow_Microscopic_Images_Using_Convolutional_Neural_Networks","abstract":"Leukocytes, produced in the bone marrow, make up around one percent of all blood cells. Uncontrolled growth of these white blood cells leads to the birth of blood cancer. Out of the three different types of cancers, the proposed study provides a robust mechanism for the classification of Acute Lymphoblastic Leukemia (ALL) and Multiple Myeloma (MM) using the SN-AM dataset. Acute lymphoblastic leukemia (ALL) is a type of cancer where the bone marrow forms too many lymphocytes. On the other hand, Multiple myeloma (MM), a different kind of cancer, causes cancer cells to accumulate in the bone marrow rather than releasing them into the bloodstream. Therefore, they crowd out and prevent the production of healthy blood cells. Conventionally, the process was carried out manually by a skilled professional in a considerable amount of time. The proposed model eradicates the probability of errors in the manual process by employing deep learning techniques, namely convolutional neural networks. The model, trained on cells’ images, first pre-processes the images and extracts the best features. This is followed by training the model with the optimized Dense Convolutional neural network framework (termed DCNN here) and finally predicting the type of cancer present in the cells. The model was able to reproduce all the measurements correctly while it recollected the samples exactly 94 times out of 100. The overall accuracy was recorded to be 97.2%, which is better than the conventional machine learning methods like Support Vector Machine (SVMs), Decision Trees, Random Forests, Naive Bayes, etc. This study indicates that the DCNN model’s performance is close to that of the established CNN architectures with far fewer parameters and computation time tested on the retrieved dataset. Thus, the model can be used effectively as a tool for determining the type of cancer in the bone marrow.","authors":["Deepika Kumar","Nikita Jain","Aayush Khurana","Sweta Mittal"],"meta":["July 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3012292"],"references":["335333347_Cancer_diagnosis_in_histopathological_image_CNN_based_approach","334595328_Region_Extraction_and_Classification_of_Skin_Cancer_A_Heterogeneous_framework_of_Deep_CNN_Features_Fusion_and_Reduction","331970045_Deep_learning_convolutional_neural_network_CNN_With_Gaussian_mixture_model_for_predicting_pancreatic_cancer","327938282_Acute_Lymphoblastic_Leukemia_Detection_and_Classification_of_Its_Subtypes_Using_Pretrained_Deep_Convolutional_Neural_Networks","327675091_Detecting_Bone_Lesions_in_Multiple_Myeloma_Patients_Using_Transfer_Learning_First_International_Workshop_DATRA_2018_and_Third_International_Workshop_PIPPI_2018_Held_in_Conjunction_with_MICCAI_2018_Gra","346095075_A_CNN-based_methodology_for_breast_cancer_diagnosis_using_thermal_images","337600356_Acute_Lymphoblastic_Leukemia_Cells_Image_Analysis_with_Deep_Bagging_Ensemble_Learning","336515407_Multiple_Myeloma_Increasing_Evidence_for_a_Multistep_Transformation_Process","336492537_Comparison_of_two_direct_assays_for_platelet-associated_IgG_PAIgG_in_assessement_of_immune_and_nonimmune_thrombocytopenia","328289351_Classification_of_Acute_Lymphoblastic_Leukemia_ALL_Using_Deep_Learning"]}