{"id":"343276247_The_Influence_of_Changing_Marginals_on_Measures_of_Inequality_in_Scholarly_Citations_Evidence_of_Bias_and_a_Resampling_Correction","abstract":"Scholars have debated whether changes in digital environments have led to greater concentration or dispersal of scientific citations, but this debate has paid little attention to how other changes in the publication environment may impact the commonly used measures of inequality. Using Monte Carlo experiments, we demonstrate that a variety of inequality measures—including the Gini coefficient, the Herfindahl-Hirschman index, and the percentage of articles ever cited—are substantially biased downward by increases in the total number of articles and citations. We propose and validate a resampling-based correction for this “marginals bias” and apply this correction to empirical data on scholarly citation distributions using Web of Science data covering four broad scientific fields (health, humanities, mathematics and the computer sciences, and the social sciences) from 1996 to 2014. We find that in each field the bulk of the apparent decline in citation inequality in recent years is an artifact of marginals bias, as are most apparent interfield differences in citation inequality. Researchers using inequality measures to compare citation distributions and other distributions with many cases at or near the zero-bound should interpret these metrics carefully and account for the influence of changing marginals.","authors":["Lanu Kim","Christopher Adoph","Jevin D. West","Katherine Stovel"],"meta":["August 2020Sociological Science 7(13):314-341","DOI:10.15195/v7.a13"],"references":["333487946_Over-optimization_of_academic_publishing_metrics_Observing_Goodhart's_Law_in_action","332756768_Methods_to_account_for_citation_inflation_in_research_evaluation","331039753_How_Much_Do_You_Have_to_Publish_to_Get_a_Job_in_a_Top_Sociology_Department_Or_to_Get_Tenure_Trends_over_a_Generation","328343816_Understanding_the_Elephant_The_Discourse_Approach_to_Boundary_Identification_and_Corpus_Construction_for_Theory_Review_Articles","324056139_Conformity_in_Scientific_Networks","305440413_The_Memory_of_Science_Inflation_Myopia_and_the_Knowledge_Network","345050199_Capital_in_the_21st_Century","340634704_The_Diversity-Innovation_Paradox_in_Science","336557912_Shorter_distances_between_papers_over_time_are_due_to_more_cross-field_references_and_increased_citation_rate_to_higher-impact_papers","318828791_Distribution_of_Citations_Received_by_Scientific_Papers_Published_in_the_Imaging_Literature_From_2001_to_2010_Decreasing_Inequality_and_Polarization"]}