{"id":"343201211_Efficient_Computation_of_Skyline_Queries_Over_a_Dynamic_and_Incomplete_Database","abstract":"Skyline queries rely on the notion of Pareto dominance, filter the data items by keeping only those data items that are the best, most preferred, also known as skylines, from a database to meet the user’s preferences. Skyline query has been studied extensively and a significant number of skyline algorithms have been proposed, mostly attempt to resolve the optimisation problem that is mainly associated with a reduction in the processing time of skyline computations. In today’s era, the presence of incomplete data in a database is inevitable. Furthermore, databases are dynamic in nature in which their states change throughout the time to reflect the current and latest information of the applications. The skylines derived before changes are made towards the initial database are no longer valid in the new state of the database. Blindly examining the entire database to identify the new set of skylines is unwise as not all data items are affected by the changes made towards the database. Hence, in this paper we propose a solution, named DyIn-Skyline, which is capable of deriving skylines over a dynamic and incomplete database, by exploiting only those data items that are affected by the changes. Several experiments have been conducted and the results show that our proposed solution outperforms the previous works with regard to the number of pairwise comparisons and processing time.","authors":["Ghazaleh Babanejad","Hamidah Ibrahim","Fatimah Sidi","Nur Izura Udzir"],"meta":["July 2020IEEE Access 8(99):141523-141546","DOI:10.1109/ACCESS.2020.3011652","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["306048459_A_Framework_for_Evaluating_Skyline_Queries_over_Incomplete_Data","305080534_Processing_skyline_queries_in_incomplete_distributed_databases","294288292_An_Efficient_Approach_for_Processing_Skyline_Queries_in_Incomplete_Multidimensional_Database","282546843_Top-k_Dominating_Queries_on_Incomplete_Data","274175108_Skyline_Sets_Queries_for_Incomplete_Data","320883685_Probabilistic_Skyline_on_Incomplete_Data","305363833_k-Dominant_Skyline_Queries_on_Incomplete_Data","302476677_Optimizing_Skyline_Queries_over_Incomplete_Data","301257769_ISSA_Efficient_Skyline_Computation_for_Incomplete_Data","267182701_Skyline_cardinality_for_relational_processing_How_many_vectors_are_maximal"]}