{"id":"343235993_Measuring_quality_as_students'_problem_solving_skill_development_in_mathematics_The_case_of_grades_9_and_10_students_in_Addis_Kidame_Secondary_School_Amhara_Region_Ethiopia","abstract":"Quality in education is an amorphous term where no two people can exactly communicate. However, there\nis a growing trend that quality should be viewed in terms of learning improvement. Thus, this study intends to examine the\nstatus of students’ problem solving skill in mathematics. Particularly, this study aims at measuring grades 9 and 10\nstudents’ problem solving skill improvement in mathematics. This study also compared male and female students’ problem\nsolving skill in mathematics. A total of 284 students (142 female and 142 male) were selected using stratified random\nsampling technique from grades 9 and 10 students. Fifteen problem solving skill test items with five levels of difficulty were\nconstructed based on the conceptual framework, which was suggested by the Department of Mathematics and Computer\nScience of Saint Louis University and Mara University of Technology. The results of the analysis unraveled that grades 9\nand 10 students have low level of problem solving skill in mathematics. As the difficulty level of items increases, there\nappeared to be significant difference on students’ problem solving skill in favor of male students. Based on the results, the\nresearchers noted that problem solving skill is the result of the combination of a multitude of human skills. It is also\nmanifested in several ways, such as, thinking, reasoning, doing things, etc. Thus, to measure the problem solving skill of\npeople, a combination of tests that address several components of problem solving should be used. Moreover, the problem\nsolving skill development requires models that could possibly help the students to emulate the skill. To this end, teachers\nshould develop their problem solving skill and thereby become good models for their respective students","authors":["Solomon Mengistie","Alemayehu Bishaw Tamiru","Assaye  Ayalew"],"meta":["July 2020","DOI:10.31248/IJET2020.071","Project: Assessing the educational quality of Secondary and Preparatory Schools in Amhara Region"],"references":["335835961_Higher_Learning_Institute_Module_Organization_vis-a-vis_the_Criteria_of_Curriculum_Development_for_Problem_Solving_Skill_Development","309363328_The_Effect_of_Some_Constraints_on_Mathematics_Instructors'_Problem_Solving_Practices_Universities_in_Amhara_Region_in_Focus","51427273_Gender_Similarities_Characterize_Math_Performance","272553315_Effects_of_Standards-Based_Mathematics_Education_A_Study_of_the_Core-Plus_Mathematics_Project_Algebra_and_Functions_Strand","272328276_Teachers'_Beliefs_and_Actual_Practice_of_Problem_Solving_Approach_in_Teaching_Mathematics_With_Particular_Reference_to_Grades_9_and_10_in_West_Gojjam","265626553_Characterization_of_the_Gaussian_distribution_on_groups_by_the_independence_of_linear_statistics","255666955_Evaluating_the_levels_of_problem_solving_abilities_in_mathematics","249807560_Differences_in_Mathematics_Achievement_Between_Males_and_Females","247565524_SocioCultural_Aspects_of_Assessment","234562004_How_To_Evaluate_Progress_in_Problem_Solving","7859170_His_Brain_Her_Brain"]}