{"id":"343242941_A_unified_framework_for_integrative_study_of_heterogeneous_gene_regulatory_mechanisms","abstract":"Gene expression is regulated by a large variety of mechanisms. Previous studies attempting to model the quantitative relationships between gene expression levels and regulatory mechanisms have considered only one or a few mechanisms at a time, which cannot provide a full picture of the complex interactions among different mechanisms. This was partially due to the heterogeneity of the mechanisms, which involve different types of biological objects and data representations, making it hard to study them in a unified way. Here, we describe a flexible framework that can integrate very different types of data for studying their joint effects on gene expression. In this framework, domain knowledge is represented by metapaths, while the manifestations of their effects in actual data are summarized by an embedding of the biological objects in a latent space. We demonstrate the use of our framework in integrating several diverse types of data that are related to gene expression in different ways, including DNA contacts in three-dimensional genome architecture, protein–protein interactions, genomic neighbourhoods and broad chromatin accessibility domains. The modelling results reveal that these several types of data are able to model gene expression fairly well individually, but even better when integrated. Gene expression is regulated by a variety of mechanisms, which have been difficult to study in a unified way. The authors propose a flexible framework that can integrate different types of data for studying their joint effects on gene expression. The framework uses a general network representation for data integration, metapaths for inputting prior knowledge of gene regulatory mechanisms, and embedding techniques for capturing complex structures in the data.","authors":["Qin Cao","Zhenghao Zhang","Xi Fu","Qiong Wu"],"meta":["August 2020Nature Machine Intelligence 2(8):1-10","DOI:10.1038/s42256-020-0205-2"],"references":["328930075_The_Gene_Ontology_Resource_20_years_and_still_GOing_strong","328079038_The_3D_Genome_Browser_A_web-based_browser_for_visualizing_3D_genome_organization_and_long-range_chromatin_interactions","326466336_GOATOOLS_A_Python_library_for_Gene_Ontology_analyses","325041074_Prediction_of_enhancer-promoter_interactions_via_natural_language_processing","320464881_Specialising_Word_Vectors_for_Lexical_Entailment","334115082_Uncovering_Divergent_Linguistic_Information_in_Word_Embeddings_with_Lessons_for_Intrinsic_and_Extrinsic_Evaluation","330985394_Replication_Timing_Becomes_Intertwined_with_3D_Genome_Organization","329954583_Identifying_cis_Elements_for_Spatiotemporal_Control_of_Mammalian_DNA_Replication","325449076_Specialising_Word_Vectors_for_Lexical_Entailment","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","318916856_metapath2vec_Scalable_Representation_Learning_for_Heterogeneous_Networks","318487927_Predicting_multicellular_function_through_multi-layer_tissue_networks","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","317631643_An_Expanded_View_of_Complex_Traits_From_Polygenic_to_Omnigenic","317005993_Architecture_of_the_human_interactome_defines_protein_communities_and_disease_networks"]}