{"id":"343317128_Engineering_education_for_smart_40_technology_a_review","abstract":"Industry 4.0 (I4), defined as the integration of information and communication technology with industrial advances to develop digital factories, will transform production processes by making them more efficient, green, and flexible. Manufacturers must overcome barriers to implement this approach; one of them is the lack of qualified talent to manage I4 systems. This paper is a review of the state-of-art of I4. The goal of this research is to describe the technologies that are enablers of I4, analyze the human talent needed and the qualifications (competencies/skills) required to manage I4 systems, describe the courses and practices that leading universities in engineering and technology are teaching for developing the I4 workforce, and provide a look to the future by presenting trends related to education in I4. Autonomous robots, simulation, horizontal and vertical integration, the Industrial Internet of Things, additive manufacturing, augmented reality, cybersecurity, the cloud, and Big Data and analytics are technologies considered pillars of the I4 approach. Nowadays, there are universities already offering programs related to I4. These range from those aimed at presenting the concepts of I4 to those in which students learn how to handle related technologies in real work in global enterprises. I4 is still evolving, and we present only a glimpse of what is required based on its current state. Continuous review of the I4 environment is necessary to determine opportunely the path that it will follow and, in consequence, the needs that will emerge in areas such as curricula content, competency requirements, and technologies.","authors":["Marcela Hernández de Menéndez","Carlos A. Escobar","Ruben Morales-Menendez"],"meta":["September 2020International Journal on Interactive Design and Manufacturing (IJIDeM) 14(3)","DOI:10.1007/s12008-020-00672-x","Project: Education 4.0"],"references":["336063722_Additive_Manufacturing_for_the_Aircraft_Industry_A_Review","334498201_Data_Management_in_Industry_40_State_of_the_Art_and_Open_Challenges","333907686_Beyond_Coding_Back_to_the_Future_with_Education_Robots","332440369_An_Overview_of_Industry_40_Definition_Components_and_Government_Initiatives","331145949_Virtual_reality_laboratories_a_review_of_experiences","330668156_Challenges_and_Benefits_of_Industry_40_an_overview","330638538_TECHNOLOGY_ENHANCED_LEARNING_FOR_INDUSTRY_40_ENGINEERING_EDUCATION","334089426_Beyond_Coding_Back_to_the_Future_with_Education_Robots","332392248_Trends_in_preparing_cyber-physical_systems_engineers","330797901_On_a_Frame_Work_of_Curriculum_for_Engineering_Education_40","330281868_Adapting_Engineering_Education_to_Industry_40_Vision","328925270_Multi-Finger_Haptics_Enhanced_Virtual_Instrument_Interfaces","328638000_Integration_of_3D_Printing_and_Industry_40_into_Engineering_Teaching","328037412_The_Role_and_Impact_of_Industry_40_and_the_Internet_of_Things_on_the_Business_Strategy_of_the_Value_Chain-The_Case_of_Hungary","328152427_Integration_of_Tool_Making_into_Agile_Product_Development_using_Industry_40_Technologies_and_Additive_Manufacturing_Technologies"]}