{"id":"343343481_Performance_Analyzing_the_Effect_of_Network_Size_on_Routing_Protocols_in_MANETs","abstract":"The Mobile Ad-hoc network (MANET) means an independently operating self-configured wireless network without existing infrastructure and centralized control. MANET may be found in wireless systems in different fields of daily uses, for example of automotive, military, and other specific field networks. Many networks need a fixed or wired data transmission and computer connectivity system relative to MANET. WiFi, satellite networking and the smartphone network are examples of fixed infrastructure wireless technology. This paper analyzes the effect of MANET on network size routing protocols. Ad hoc on-demand remote vector routing (AODV) and Greedy Stateless routing perimeter (GPSR) was measured on a efficiency basis in terms of network capacity. The result is a gradual decrease in GPSR output from 17.68 kbps to 12.61 kbps, with an average of 43.96 kbps. The packet transmission fraction for AODV and GPSR protocols is being developed for increasing network capacity. GPSR averages E2E delay less than AODV because the GPSR moves each node closer to the destination with a packet of local knowledge. As a matter of fact, the superiority of the GPSR protocol in all document tested on a network scale in simulation.","authors":["Ahmed Shamil Mustafa Al-Shayea","Mohamed Al-Heeti","Mustafa Maad Hamdi","Ahmed Muhi Shantaf"],"meta":["June 2020","DOI:10.1109/HORA49412.2020.9152838","Conference: 2nd International Congress on Human-Computer Interaction, Optimization and Robotic Applications (HORA)At: Turkish","Project: Routing Protocol and Data Dissemination in VANETs"],"references":["341448045_A_Survey_on_Data_Dissemination_and_Routing_Protocol_in_VANET_Types_Challenges_opportunistic_and_Future_Role","339843085_Prediction_Based_Efficient_Multi-hop_Clustering_Approach_with_Adaptive_Relay_Node_Selection_for_VANET","339310550_Green_Communication_Networks_Challenges_Opportunities_and_Future_Role","336375660_A_Study_Review_on_Mobile_Ad-Hoc_Network_Characteristics_Applications_Challenges_and_Routing_Protocols_Classification","332522945_Recent_Progress_on_QoS_Scheduling_for_Mobile_Ad_Hoc_Networks","326946745_Routing_Protocols_and_Architecture_for_Disaster_Area_Network_A_Survey","341382526_A_Review_Paper_on_Different_Application_of_Genetic_Algorithm_for_Mobile_Ad-hoc_Network_MANET","291314105_Performance_evaluation_of_on-demand_multipath_routing_protocols_for_mobile_ad-hoc_networks","284602927_Ad_hoc_on-demand_distance_vector_AODV_routing","267861042_EXTENSION_OF_OPTIMIZED_LINKED_STATE_ROUTING_PROTOCOL_FOR_ENERGY_EFFICIENT_APPLICATIONS"]}