{"id":"343391783_Deep_Learning-Based_Quantification_of_Pulmonary_Hemosiderophages_in_Cytology_Slides","abstract":"Exercise-induced pulmonary hemorrhage (EIPH) is a common condition in sport horses with negative impact on performance. Cytology of bronchoalveolar lavage fluid by use of a scoring system is considered the most sensitive diagnostic method. Macrophages are classified depending on the degree of cytoplasmic hemosiderin content. The current gold standard is manual grading, which is however monotonous and time-consuming. We evaluated state-of-the-art deep learning-based methods for single cell macrophage classification and compared them against the performance of nine cytology experts and evaluated inter- and intra-observer variability. Additionally, we evaluated object detection methods on a novel data set of 17 completely annotated cytology whole slide images (WSI) containing 78,047 hemosiderophages. Our deep learning-based approach reached a concordance of 0.85, partially exceeding human expert concordance (0.68 to 0.86, mean of 0.73, SD of 0.04). Intra-observer variability was high (0.68 to 0.88) and inter-observer concordance was moderate (Fleiss’ kappa = 0.67). Our object detection approach has a mean average precision of 0.66 over the five classes from the whole slide gigapixel image and a computation time of below two minutes. To mitigate the high inter- and intra-rater variability, we propose our automated object detection pipeline, enabling accurate, reproducible and quick EIPH scoring in WSI.","authors":["Christian Marzahl","Marc Aubreville","Christof A. Bertram","Jason Stayt"],"meta":["August 2020Scientific Reports 10(9795)","DOI:10.1038/s41598-020-65958-2","Project: Digital Pathology - New Approaches to the Automated Image Analysis of Histologic Slides"],"references":["337819832_Computerized_Calculation_of_Mitotic_Count_Distribution_in_Canine_Cutaneous_Mast_Cell_Tumor_Sections_Mitotic_Count_Is_Area_Dependent","331654645_Modern_convolutional_object_detectors_for_nuclei_detection_on_pleural_effusion_cytology_images","330991576_Object_Detection_Networks_and_Augmented_Reality_for_Cellular_Detection_in_Fluorescence_Microscopy_Acquisition_and_Analysis","330665962_A_gentle_introduction_to_deep_learning_in_medical_image_processing","337627035_Scale_Specified_Single_Shot_MultiBox_Detector","331780950_Field_of_Interest_Proposal_for_Augmented_Mitotic_Cell_Count_Comparison_of_Two_Convolutional_Networks","326566753_Focal_Loss_for_Dense_Object_Detection","323301436_SlideRunner","322748856_Morbidity_and_mortality_with_early_pulmonary_haemorrhage_in_preterm_neonates","322059369_Focal_Loss_for_Dense_Object_Detection"]}