{"id":"343309796_New_Concepts_in_Intuitionistic_Fuzzy_Graph_with_Application_in_Water_Supplier_Systems","abstract":"In recent years, the concept of domination has been the backbone of research activities in graph theory. The application of graphic domination has become widespread in different areas to solve human-life issues, including social media theories, radio channels, commuter train transportation, earth measurement, internet transportation systems, and pharmacy. The purpose of this paper was to generalize the idea of bondage set (BS) and non-bondage set (NBS), bondage number α(G), and non-bondage number αk(G), respectively, in the intuitionistic fuzzy graph (IFG). The BS is based on a strong arc (SA) in the fuzzy graph (FG). In this research, a new definition of SA in connection with the strength of connectivity in IFGs was applied. Additionally, the BS, α(G), NBS, and αk(G) concepts were presented in IFGs. Three different examples were described to show the informative development procedure by applying the idea to IFGs. Considering the examples, some results were developed. Also, the applications were utilized in water supply systems. The present study was conducted to make daily life more useful and productive.","authors":["Zehui Shao","Saeed Kosari","Hossein Rashmanlou","Muhammad Shoaib"],"meta":["July 2020","DOI:10.3390/math8081241"],"references":["333567168_Granulation_of_Hypernetwork_Models_under_the_q-Rung_Picture_Fuzzy_Environment","331735805_q-Rung_Orthopair_Fuzzy_Hypergraphs_with_Applications","330447352_q-Rung_Orthopair_Fuzzy_Competition_Graphs_with_Application_in_the_Soil_Ecosystem","330287762_Fuzzy_Graph_Structures_with_Application","326111927_Level_graphs_of_intuitionistic_fuzzy_graphs","322593929_Different_types_of_Domination_in_Intuitionistic_Fuzzy_Graph","321888290_Certain_Concepts_in_Intuitionistic_Neutrosophic_Graph_Structures","307590118_Novel_intuitionistic_fuzzy_soft_multiple-attribute_decision-making_methods","313623326_Arcs_in_intuitionistic_fuzzy_graphs","309277008_Total_Semi_-_Strong_Weak_Domination_in_Intuitionistic_Fuzzy_Graph"]}