{"id":"343424917_Artificial_Intelligence_for_Computer-Aided_Synthesis_In_Flow_Analysis_and_Selection_of_Reaction_Components","abstract":"Computer-aided synthesis has received much attention in recent years. It is a challenging topic in itself, due to the high dimensionality of chemical and reaction space. It becomes even more challenging when the aim is to suggest syntheses that can be performed in continuous flow. Though continuous flow offers many potential benefits, not all reactions are suited to be operated continuously. In this work, three machine learning models have been developed to provide an assessment of whether a given reaction may benefit from continuous operation, what the likelihood of success in continuous flow is for a certain set of reaction components (i.e., reactants, reagents, solvents, catalysts, and products) and, if the likelihood of success is low, which alternative reaction components can be considered. The first model uses an abstract version of a reaction template, obtained via gaussian mixture modeling, to quantify its relative increase in publishing frequency in continuous flow, without relying on potentially ambiguously defined reaction templates. The second model is an artificial neural network that categorizes feasible and infeasible reaction components with a 75% success rate. A set of reaction components is considered to be feasible if there is an explicit reference to it being used in continuous synthesis in the database; all other reaction components are considered infeasible. While several cases that are “infeasible” by this definition, are classified as feasible by the neural network, further analysis shows that for many of these cases, it is at least plausible that they are in fact feasible – they simply have not been tested to (dis)prove this. The final model suggests alternative continuous flow components with a top-1 accuracy of 95%. Combined, they offer a black-box evaluation of whether a reaction and a set of reaction components can be considered promising for continuous syntheses.","authors":["Pieter Plehiers","Connor W. Coley","Hanyu Gao","Florence Vermeire"],"meta":["August 2020","DOI:10.3389/fceng.2020.00005"],"references":["339651598_Automatic_Retrosynthetic_Route_Planning_Using_Template-Free_Models","337960089_Reinforcement_Learning_for_Bio-Retrosynthesis","337912524_Predicting_Retrosynthetic_Reactions_Using_Self-Corrected_Transformer_Neural_Networks","335731741_A_Transformer_Model_for_Retrosynthesis","340425835_Evaluating_Scalable_Uncertainty_Estimation_Methods_for_Deep_Learning_Based_Molecular_Property_Prediction","339547605_The_Exploration_of_Chemical_Reaction_Networks","335132975_Reaction-Based_Enumeration_Active_Learning_and_Free_Energy_Calculations_To_Rapidly_Explore_Synthetically_Tractable_Chemical_Space_and_Optimize_Potency_of_Cyclin-Dependent_Kinase_2_Inhibitors","335077576_A_robotic_platform_for_flow_synthesis_of_organic_compounds_informed_by_AI_planning","334058482_SO2F2-Activated_Efficient_Beckmann_Rearrangement_of_Ketoximes_for_Accessing_Amides_and_Lactams","333758512_RDChiral_An_RDKit_Wrapper_for_Handling_Stereochemistry_in_Retrosynthetic_Template_Extraction_and_Application"]}