{"id":"343452117_Content_Analysis_of_American_Indian_Comics_on_Instagram_Using_Machine_Learning","abstract":"Instagram is currently the third most popular social network used by Indian college students. This study draws a parallel between Indian and American-origin comics on Instagram to study the new age pop culture art in the two countries. The research was conducted by reviewing the content based on the parameters like several followers, likes, comments, and analyzing the content being generated in the two cultures by studying the type of characters, issues raised, and the primary color palette used. Content analysis using machine learning was used as the method for the research. The content is generated in India and the US. Virtual Comic culture in America seems to be more popular than the one in India. Indian comic artists take time to make comics on the social issues prevalent in society, contrary to the latter. American comic artists dedicate a significant amount of time drawing about their love life. Indian comic artists like more use of colors than the American ones. Certain similarities include Comics from both the countries, They focus majorly on their issues, that is, the artists draw about their personal lives and their everyday incidents like their difficulty of waking up in the morning, shopping, gaming, their lousy mood days, etc. Female characters tend to take the lead in the case of Instagram comics, which is proof of the changing society. Representation of political issues is almost none in the virtual comics.","authors":["Rahul Reddy Nadikattu"],"meta":["September 2014","Project: CONTENT ANALYSIS OF AMERICAN & INDIAN COMICS ON INSTAGRAM USING MACHINE LEARNING"],"references":["273363287_Performance_analysis_and_Frequency_Compensation_Technique_for_Low_Power_Water_Quality_Monitoring_Device_Using_ISFET_Sensor","272853589_Performance_Analysis_of_Various_Readout_Circuits_for_Monitoring_Quality_of_Water_Using_Analog_Integrated_Circuits","220099490_On_the_Performance_of_ISFET-based_Device_for_Water_Quality_Monitoring","310829291_Coverage_criteria_for_GUI_testing","268020225_Bayesian_ideas_and_data_analysis_An_introduction_for_scientists_and_statisticians","230547481_On_thinning_of_chains_in_MCMC","221389599_On_the_many_ways_software_engineering_can_benefit_from_knowledge_engineering","220719883_Repairing_GUI_Test_Suites_Using_a_Genetic_Algorithm","220516273_Search-based_software_test_data_generation_a_survey_Research_Articles","220516198_From_genetic_to_bacteriological_algorithms_for_mutation-based_testing_Research_articles","51980894_Trending_Now_Using_Social_Media_to_Predict_and_Track_Disease_Outbreaks","51872743_Temporal_Patterns_of_Happiness_and_Information_in_a_Global_Social_Network_Hedonometrics_and_Twitter","3587219_The_relationships_of_AI_to_software_engineering","3188216_Generating_software_test_data_by_evolution"]}