{"id":"343400656_Fostering_computational_thinking_through_educational_robotics_a_model_for_creative_computational_problem_solving","abstract":"Background\nEducational robotics (ER) is increasingly used in classrooms to implement activities aimed at fostering the development of students’ computational thinking (CT) skills. Though previous works have proposed different models and frameworks to describe the underlying concepts of CT, very few have discussed how ER activities should be implemented in classrooms to effectively foster CT skill development. Particularly, there is a lack of operational frameworks, supporting teachers in the design, implementation, and assessment of ER activities aimed at CT skill development. The current study therefore presents a model that allows teachers to identify relevant CT concepts for different phases of ER activities and aims at helping them to appropriately plan instructional interventions. As an experimental validation, the proposed model was used to design and analyze an ER activity aimed at overcoming a problem that is often observed in classrooms: the trial-and-error loop, i.e., an over-investment in programming with respect to other tasks related to problem-solving.\n\nResults\nTwo groups of primary school students participated in an ER activity using the educational robot Thymio. While one group completed the task without any imposed constraints, the other was subjected to an instructional intervention developed based on the proposed model. The results suggest that (i) a non-instructional approach for educational robotics activities (i.e., unlimited access to the programming interface) promotes a trial-and-error behavior; (ii) a scheduled blocking of the programming interface fosters cognitive processes related to problem understanding, idea generation, and solution formulation; (iii) progressively adjusting the blocking of the programming interface can help students in building a well-settled strategy to approach educational robotics problems and may represent an effective way to provide scaffolding.\n\nConclusions\nThe findings of this study provide initial evidence on the need for specific instructional interventions on ER activities, illustrating how teachers could use the proposed model to design ER activities aimed at CT skill development. However, future work should investigate whether teachers can effectively take advantage of the model for their teaching activities. Moreover, other intervention hypotheses have to be explored and tested in order to demonstrate a broader validity of the model.","authors":["Morgane Chevalier","Christian Giang","Alberto Piatti","Francesco Mondada"],"meta":["August 2020International Journal of STEM Education 7(1)","DOI:10.1186/s40594-020-00238-z"],"references":["341469204_Computational_Thinking_Is_More_about_Thinking_than_Computing","325476089_Exploring_the_potentials_of_educational_robotics_in_the_development_of_computational_thinking_A_summary_of_current_research_and_practical_proposal_for_future_work","324090573_Defining_a_New_21st_Century_Skill-Computational_Thinking_Concepts_and_Trends","323941723_Systematic_Review_of_Research_Trends_in_Robotics_Education_for_Young_Children","344486411_Observing_Interaction_An_Introduction_to_Sequential_Analysis","333817386_How_do_pupils_perceive_educational_robotics_as_a_tool_to_improve_their_21st_century_skills","332769408_Heuristics_for_the_Development_and_Evaluation_of_Educational_Robotics_Systems","330182402_Exploring_Escape_Games_as_a_Teaching_Tool_in_Educational_Robotics","326193362_Robotics_and_computational_thinking_in_primary_school","326164947_How_to_learn_and_how_to_teach_computational_thinking_Suggestions_based_on_a_review_of_the_literature"]}