{"id":"343455597_Guide_to_Teaching_Computer_Science_An_Activity-Based_Approach","abstract":"This concise yet thorough textbook presents an active-learning model for the teaching of computer science. Offering both a conceptual framework and detailed implementation guidelines, the work is designed to support a Methods of Teaching Computer Science (MTCS) course, but may be applied to the teaching of any area of computer science at any level, from elementary school to university. This text is not limited to any specific curriculum or programming language, but instead suggests various options for lesson and syllabus organization.\nFully updated and revised, the third edition features more than 40 new activities, bringing the total to more than 150, together with new chapters on computational thinking, data science, and soft concepts and soft skills. This edition also introduces new conceptual frameworks for teaching such as the MERge model, and new formats for the professional development of computer science educators.\nTopics and features:\n\n• Includes an extensive set of activities, to further support the pedagogical principles outlined in each chapter\n• Discusses educational approaches to computational thinking, how to address soft concepts and skills in a MTCS course, and the pedagogy of data science (NEW)\n• Focuses on teaching methods, lab-based teaching, and research in computer science education, as well as on problem-solving strategies\n• Examines how to recognize and address learners’ misconceptions, and the different types of questions teachers can use to vary their teaching methods\n• Provides coverage of assessment, teaching planning, and designing a MTCS course\n• Reviews high school teacher preparation programs, and how prospective teachers can gain experience in teaching computer science\n\nThis easy-to-follow textbook and teaching guide will prove invaluable to computer science educators within all frameworks, including university instructors and high school teachers, as well as to instructors of computer science teacher preparation programs.\nDr. Orit Hazzan is Professor at the Department of Education in Science and Technology at Technion – Israel Institute of Technology. Dr. Noa Ragonis is Head of the M.Teach. program for Secondary Education and the M.Ed. program in Integrative STEM Education at Beit Berl College, Israel. She is a computer science senior lecturer, and an adjunct senior lecturer at the Department of Education in Science and Technology, Technion. Dr. Tami Lapidot is Executive Manager of Machshava – the Israeli National Center for Computer Science Teachers.","authors":["Orit Hazzan","Noa Ragonis","Tami Lapidot"],"meta":["January 2020","DOI:10.1007/978-3-030-39360-1","ISBN: 978-3-030-39359-5"],"references":[]}