{"id":"3434482_Derivation_of_PAPR_Distribution_for_OFDM_Wireless_Systems_Based_on_Extreme_Value_Theory","abstract":"It has been widely known that one of the key design parameters in orthogonal frequency division multiplexing (OFDM) systems is the distribution of peak-to-average power ratio (PAPR). Recently some theoretical approaches to determine the PAPR distribution have been proposed based on the assumption that all subcarriers are allocated with equal power. However, this assumption may not be valid due to the following facts. First, in all realistic OFDM systems, usually only a subset: of subcarriers are used to carry information (active subcarriers) and the rest (inactive subcarriers) are set to zero. Second, due to the efficiency concerns transmission power should be allocated to active subcarriers. Third, power allocation may vary depending on different constellations used by different active subcarriers and their signal-to-noise-ratios. In this paper, we propose a general approach to identify PAPR distribution in OFDM systems. Specifically, a more accurate analytical expression of the PAPR distribution is derived with the help of Extreme Value Theory for Chi-squared-2 process in OFDM systems with unequal power distribution strategy. To validate the analytical results, extensive simulations have been conducted, showing a very good match between the identified PAPR distribution and that of real OFDM systems.","authors":["Tao Jiang","Mohsen Guizani","Hsiao-Hwa Chen","Weidong Xiang"],"meta":["May 2008IEEE Transactions on Wireless Communications 7(4):1298 - 1305","DOI:10.1109/TWC.2008.060862","SourceIEEE Xplore"],"references":["329542190_Peak-to-average_power_ratio_reduction","274891554_Elements_of_Information_Theory_Wiley_New-York","243779672_Peak_to_Average_Power_Reduction_for_Multicarrier_Modulation","243672913_OFDM_for_Wireless_Multimedia_Communications","227992567_Elements_of_Information_Theory","224773133_Elements_of_information_theory_2nd_ed","220683551_On_the_achievable_information_rate_with_peak-power-limited_orthogonal_frequency-division_multiplexing","38361151_Extremal_Theory_for_Stochastic_Processes","3944867_A_modern_extreme_value_theory_approach_to_calculating_the_distribution_of_the_peak-to-average_power_ratio_in_OFDM_systems","3755353_Reducing_the_Peak_to_Average_Power_Ratio_of_OFDM"]}