{"id":"343459192_YOLO-Fine_One-Stage_Detector_of_Small_Objects_Under_Various_Backgrounds_in_Remote_Sensing_Images","abstract":"Object detection from aerial and satellite remote sensing images has been an active research topic over the past decade. Thanks to the increase in computational resources and data availability, deep learning-based object detection methods have achieved numerous successes in computer vision, and more recently in remote sensing. However, the ability of current detectors to deal with (very) small objects still remains limited. In particular, the fast detection of small objects from a large observed scene is still an open question. In this work, we address this challenge and introduce an enhanced one-stage deep learning-based detection model, called You Only Look Once (YOLO)-fine, which is based on the structure of YOLOv3. Our detector is designed to be capable of detecting small objects with high accuracy and high speed, allowing further real-time applications within operational contexts. We also investigate its robustness to the appearance of new backgrounds in the validation set, thus tackling the issue of domain adaptation that is critical in remote sensing. Experimental studies that were conducted on both aerial and satellite benchmark datasets show some significant improvement of YOLO-fine as compared to other state-of-the art object detectors.","authors":["Minh-Tan Pham","Luc Courtrai","Chloé Friguet","Sébastien Lefèvre"],"meta":["August 2020Remote Sensing 12(15):2501","DOI:10.3390/rs12152501"],"references":["340708049_UAV-YOLO_Small_Object_Detection_on_Unmanned_Aerial_Vehicle_Perspective","338649295_Deep_neural_networks_for_automated_detection_of_marine_mammal_species","338524659_A_Coarse-to-Fine_Network_for_Ship_Detection_in_Optical_Remote_Sensing_Images","336934637_Deep_Learning_for_Generic_Object_Detection_A_Survey","343456623_EfficientDet_Scalable_and_Efficient_Object_Detection","340111033_Recent_advances_in_small_object_detection_based_on_deep_learning_A_review","339650468_DC-SPP-YOLO_Dense_connection_and_spatial_pyramid_pooling_based_YOLO_for_object_detection","339557988_SCRDet_Towards_More_Robust_Detection_for_Small_Cluttered_and_Rotated_Objects","338650266_MDSSD_multi-scale_deconvolutional_single_shot_detector_for_small_objects","338320726_Object_detection_in_optical_remote_sensing_images_A_survey_and_a_new_benchmark"]}