{"id":"343400712_SPATIAL_PROCESSING_OF_SENTINEL_IMAGERY_FOR_MONITORING_OF_ACACIA_FOREST_DEGRADATION_IN_LAKE_NAKURU_RIPARIAN_RESERVE","abstract":"Tree degradation in National Parks poses a serious risk to the birds and animals and to a larger extent the general ecosystem. The essence of Forest degradation mapping is to detect the extent of damage on the trees over time, hence providing stakeholders with a basis for forest rehabilitation and intervention. The study proposes a workflow for detection and classification of degrading acacia vegetation along Lake Nakuru riparian reserve. Inspired by previous research on the use of Dual Polarized Sentinel 1 Ground Range Detected (GRD) data for vegetation detection, a set of six Sentinel 1 GRD and Sentinel 2 MSI of corresponding dates (2018–2019) were used. Our study confirms the existing correlation between vegetation indices derived from optical sensors and the backscatter indices from S1 SAR image of the same land cover classes. Factors that were used in validating the results include some comparisons between pixelwise and object-based classification, with a focus on the underlying segmentation and classification algorithms, the polarimetric attributes (VV+VH intensity bands) and the reflectance bands (NIR, SWIR & GREEN), the Haralick features (GLCM) vs. some geometric attributes (area & moment of inertia). Classification carried out on the temporal datasets considering geometric attributes and the Random Forest classifier yielded the highest Overall Accuracy (OA) with 94.25 %, and a Kappa coefficient of 0.90.","authors":["Anne Achieng Osio","Minh-Tan Pham","Sébastien Lefèvre"],"meta":["August 2020","DOI:10.5194/isprs-annals-V-3-2020-525-2020","Project: Monitoring of Tree species with Object Based Sattelite Image Time Series"],"references":["329450072_OBIA-based_Monitoring_of_Riparian_Vegetation_Applied_to_the_Identification_of_Degraded_Acacia_Xanthophloea_along_Lake_Nakuru","324487212_Attribute_Profiles_on_Derived_Textural_Features_for_Highly_Textured_Optical_Image_Classification","320600284_Local_Feature-Based_Attribute_Profiles_for_Optical_Remote_Sensing_Image_Classification","305342883_Operational_algorithm_for_icewater_classification_on_dual-polarized_RADARSAT-2_images","302341151_Textural_Features_for_Image_Classification","278627503_A_Collection_of_SAR_Methodologies_for_Monitoring_Wetlands","258811386_Water_Body_Distributions_Across_Scales_A_Remote_Sensing_Based_Comparison_of_Three_Arctic_TundraWetlands","277253804_SVM-Based_Sea_Ice_Classification_Using_Textural_Features_and_Concentration_From_RADARSAT-2_Dual-Pol_ScanSAR_Data","275754168_Introduction_to_Remote_Sensing","259662059_The_application_of_C-band_polarimetric_SAR_for_agriculture_A_review"]}