{"id":"343401090_The_Effect_of_Depth_Information_on_Visual_Complexity_Perception_in_Three-Dimensional_Textures","abstract":"Visual complexity, as an attribute of images related to human perception, has been widely studied in computer science and psychology. In conventional studies, the research objects have been limited to the traditional two-dimensional (2D) patterns or images. Therefore, if depth information is introduced into this scenario, how will it affect our perception of visual complexity of an image? To answer this question, we developed an experimental virtual reality system that enables control and display of three-dimensional (3D) visual stimuli. In this study, we aimed to investigate the effect of depth information on visual complexity perception by comparing 2D and 3D displays of the same stimuli. We scanned three textures with different characteristics to create the experimental stimuli and recruited 25 participants for the experiment. The results showed that depth information significantly increased the visual complexity perception of the texture images. Moreover, depth information had different degrees of impact on visual complexity for different textures. The higher the maximum depth introduced in the 3D image, the more significant the increase in visual complexity perception. The experimental virtual reality system used in this study also provides a feasible experimental tool for future experiments.","authors":["Liang Li","Tatsuro Yamada","Woong Choi"],"meta":["August 2020Applied Sciences 10(15):5347","DOI:10.3390/app10155347"],"references":["340378897_Visual_complexity_analysis_using_deep_intermediate-layer_features","338647949_Analysis_of_Three-Dimensional_Circular_Tracking_Movements_Based_on_Temporo-Spatial_Parameters_in_Polar_Coordinates","334543528_Visual_complexity_modelling_based_on_image_features_fusion_of_multiple_kernels","329200330_Quantifying_the_complexity_of_black-and-white_images","320846318_Predicting_perceived_visual_complexity_of_abstract_patterns_using_computational_measures_The_influence_of_mirror_symmetry_on_complexity_perception","304362303_Predicting_Complexity_Perception_of_Real_World_Images","281513085_The_Use_of_Virtual_Reality_in_Psychology_A_Case_Study_in_Visual_Perception","330477517_A_Survey_on_Depth_Perception_in_Head_Mounted_Displays_Distance_Estimation_in_Virtual_Reality_Augmented_Reality_and_Mixed_Reality","325800394_Assessment_model_for_perceived_visual_complexity_of_painting_images","283592524_Complexity_Perception_of_Texture_Images"]}