{"id":"343476975_Application_of_virtual_technologies_for_the_representation_of_physical_phenomena_in_maintenance_tasks","abstract":"Maintenance during industrial development has evolved, always seeking the in-depth study of the physical phenomena that occur in the elements and systems that have suffered functional failures. Maintenance has been adapted to each challenge presented. The progress and development of computer science have opted for the massive use of information and communication technologies that support industrial processes, generating new possibilities in maintenance management and operation. These tools could contribute to improving the efficiency of maintenance processes, taking into account that these costs represent a third of the total production cost in an organization. This work seeks to identify the evolution of these technological tools in the applications that they have had in representing the physical phenomena of maintenance management. This research also seeks to establish the minimum requirements that these tools must consider in their applications and uses. Considering the appropriation of these technologies in Colombia, in order to determine where the country is in terms of development and technological use, being important information for the recognition of the scenario and decision-making that prevail in a competitive Colombian industry world level.","authors":["Leidy Marcela Dueñas Ramirez","G A Villegas López","Celger Chamat-Torres"],"meta":["July 2020Journal of Physics Conference Series 1587(1):012023","DOI:10.1088/1742-6596/1587/1/012023"],"references":["322236395_6DoF_Object_Tracking_based_on_3D_Scans_for_Augmented_Reality_Remote_Live_Support","317515318_Metodologia_e_implementacion_de_un_programa_de_gestion_de_mantenimiento","316078665_Augmented_Reality_as_a_Support_to_the_Formation_of_Industrial_Engineers","284019131_Using_Projected_Light_for_Mobile_Remote_Guidance","279867852_A_Survey_of_Augmented_Reality_Technologies_Applications_and_Limitations","272476275_Augmented_Reality-Based_Manual_Assembly_Support_With_Visual_Features_for_Different_Degrees_of_Difficulty","256673780_Augmented_reality_applications_in_design_and_manufacturing","336961815_Remote_interactive_collaboration_in_facilities_management_using_BIM-based_mixed_reality","312640589_Cloud-based_Augmented_Reality_Remote_Maintenance_through_shop-floor_Monitoring_A_PSS_approach","286894661_An_iterative_methodology_for_mapping_mixed_reality_technologies_to_AEC_operations"]}