{"id":"343425535_DeepScratch_Scratch_Programming_Language_Extension_for_Deep_Learning_Education","abstract":"Visual programming languages make programming\nmore accessible for novices, which open more opportunities\nto innovate and develop problem-solving skills. Besides, deep\nlearning is one of the trending computer science fields that has\na profound impact on our daily life, and it is important that\nyoung people are aware of how our world works. In this study,\nwe partially attribute the difficulties novices face in building\ndeep learning models to the used programming language. This\npaper presents DeepScratch, a new programming language\nextension to Scratch that provides powerful language elements\nto facilitate building and learning about deep learning models.\nWe present the implementation process of DeepScratch, and\nexplain the syntactical definition and the lexical definition of\nthe extended vocabulary. DeepScratch provides two options to\nimplement deep learning models: training a neural network\nbased on built-in datasets and using pre-trained deep learning\nmodels. The two options are provided to serve different age\ngroups and educational levels. The preliminary evaluation shows\nthe usability and the effectiveness of this extension as a tool for\nkids to learn about deep learning.","authors":["Nora Alturayeif","Nouf Alturaief","Zainab Alhathloul"],"meta":["January 2020International Journal of Advanced Computer Science and Applications 11(7)","DOI:10.14569/IJACSA.2020.0110777"],"references":["320445800_Moving_Beyond_Syntax_Lessons_from_20_Years_of_Blocks_Programing_in_AgentSheets","234820368_The_Scratch_Programming_Language_and_Environment","220426817_Scratch_Programming_for_All","4082665_Scratch_A_sneak_preview","2954389_Agentsheets_A_medium_for_creating_domain-oriented_visual_languages","321402901_Tips_for_creating_a_block_language_with_blockly","304285713_Extending_Scratch_New_pathways_into_programming","267119199_Deep_Learning_Methods_and_Applications","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12","215900261_Lowering_the_barriers_to_programming_A_taxonomy_of_programming_environments_and_languages_for_novice_programmers"]}