{"id":"343445966_Printed_circuit_boards_isomorphism_An_experimental_study","abstract":"We evaluate the discrimination power of different graph invariants in order to identify an appropriate measurement of similarity among printed circuit boards. We show that computationally expensive algorithmic evaluation of circuit boards equivalence based on the topology of the circuit boards is unnecessary in practice. Instead, the information about the circuit boards can be stored in terms of graph invariants, namely, number sequences characterizing the boards, which requires much less memory and enables quicker recognition of board equivalence. This straightforwardly leads to fast practical implementations of the search engines for the printed circuit boards. Our approach is multidisciplinary, as the tools were drawn from two fields; the industrial electronic engineering field, and the theoretic fields of graph theory and algorithms. A real case study on a search engine for printed circuit boards is conducted to illustrate the proposed approach. Finding an easily computable and complete set of graph invariants remains a challenging mathematical question.","authors":["Aida Abiad","Alexander Grigoriev","Stefanie Niemzok"],"meta":["August 2020Computers & Industrial Engineering 148:106715","DOI:10.1016/j.cie.2020.106715"],"references":["257508054_An_efficient_heuristic_approach_to_detecting_graph_isomorphism_based_on_combinations_of_highly_discriminating_invariants","236668475_A_subgraph_isomorphism_algorithm_and_its_application_to_biochemical_data","326828330_Graph_Measures_With_High_Discrimination_Power_Revisited_A_Random_Polynomial_Approach","322489675_CANONICAL_LABELLING_OF_GRAPHS_IN_LINEAR_AVERAGE_TIME","315301890_A_Comparative_Study_of_Graph_Isomorphism_Applications","313061345_The_graph_isomorphism_disease","284368398_Application_of_Graph_Theory_in_Computer_Science_and_Engineering","265775543_Introduction_to_electric_circuits_Incl_1_CD-ROM_4th_ed","254023626_Fast_isomorphism_testing_for_a_graph-based_analog_circuit_synthesis_framework","242608703_Sur_le_Probleme_des_Courbes_Gauches_en_Topologie"]}