{"id":"343478626_Data-Driven_Computational_Social_Science_A_Survey","abstract":"Social science concerns issues on individuals, relationships, and the whole society. The complexity of research topics in social science makes it the amalgamation of multiple disciplines, such as economics, political science, and sociology, etc. For centuries, scientists have conducted many studies to understand the mechanisms of the society. However, due to the limitations of traditional research methods, there exist many critical social issues to be explored. To solve those issues, computational social science emerges due to the rapid advancements of computation technologies and the profound studies on social science. With the aids of the advanced research techniques, various kinds of data from diverse areas can be acquired nowadays, and they can help us look into social problems with a new eye. As a result, utilizing various data to reveal issues derived from computational social science area has attracted more and more attentions. In this paper, to the best of our knowledge, we present a survey on data-driven computational social science for the first time which primarily focuses on reviewing application domains involving human dynamics. The state-of-the-art research on human dynamics is reviewed from three aspects: individuals, relationships, and collectives. Specifically, the research methodologies used to address research challenges in aforementioned application domains are summarized. In addition, some important open challenges with respect to both emerging research topics and research methods are discussed.","authors":["Jun Zhang","Wei Wang","Feng Xia","Yu-Ru Lin"],"meta":["August 2020Big Data Research 21:100145","DOI:10.1016/j.bdr.2020.100145"],"references":["343375395_Multivariate_Relations_Aggregation_Learning_in_Social_Networks","343213250_Web_of_Scholars_A_Scholar_Knowledge_Graph","341766189_The_Gene_of_Scientific_Success","341524010_Big_networks_A_survey","337879560_API_An_Index_for_Quantifying_a_Scholar's_Academic_Potential","336962544_Prediction_methods_and_applications_in_the_science_of_science_A_survey","336962150_Data_Mining_and_Information_Retrieval_in_the_21st_century_A_bibliographic_review","336456173_Shifu2_A_Network_Representation_Learning_Based_Model_for_Advisor-advisee_Relationship_Mining","345153150_Shifu_Deep_Learning_Based_Advisor-advisee_Relationship_Mining_in_Scholarly_Big_Data","341261120_Multi-Source_Urban_Data_Fusion_for_Property_Value_Assessment_A_Case_Study_in_Philadelphia"]}