{"id":"343492312_Forcing_and_Calculi_for_Hybrid_Logics","abstract":"The definition of institution formalizes the intuitive notion of logic in a category-based setting. Similarly, the concept of stratified institution provides an abstract approach to Kripke semantics. This includes hybrid logics, a type of modal logics expressive enough to allow references to the nodes/states/worlds of the models regarded as relational structures, or multi-graphs. Applications of hybrid logics involve many areas of research such as computational linguistics, transition systems, knowledge representation, artificial intelligence, biomedical informatics, semantic networks and ontologies. The present contribution sets a unified foundation for developing formal verification methodologies to reason about Kripke structures by defining proof calculi for a multitude of hybrid logics in the framework of stratified institutions. In order to prove completeness, the paper introduces a forcing technique for stratified institutions with nominal and frame extraction and studies a forcing property based on syntactic consistency. The proof calculus is shown to be complete and the significance of the general results is exhibited on a couple of benchmark examples of hybrid logical systems.","authors":["Daniel Găină"],"meta":["August 2020Journal of the ACM 67(4):1-55","DOI:10.1145/3400294","Project: Mathematical structures for developing reconfigurable software systems"],"references":["335335110_Birkhoff_Completeness_for_Hybrid-Dynamic_First-Order_Logic","316529434_Foundations_of_logic_programming_in_hybrid_logics_with_user-defined_sharing","312093559_Birkhoff_style_calculi_for_hybrid_logics","292461721_Foundations_of_Logic_Programming_in_Hybridised_Logics","333961163_Rigid_First-Order_Hybrid_Logic","321525659_First-Order_Modal_Logic","301846899_Implicit_Kripke_Semantics_and_Ultraproducts_in_Stratified_Institutions","298329599_Proof_theory_for_hybridised_logics","280939945_Model_Theory","280721389_Encoding_hybridized_institutions_into_first-order_logic"]}