{"id":"343485273_A_Systematic_Literature_Review_on_Young_People's_Computational_Thought_Self-_Assessment","abstract":"Abstract: This study presents a Systematic Literature Review on self-assessment of Computational Thinking of students aged between 10 and 15 years. The review focused on self-assessment using scales, questionnaires, and proficiency tests. We first review the computational thinking's definition; from that, we detail the systematic review, including methods and research instruments used, key studies identified and a discussion of their findings. We conclude that there already are validated instruments for measuring computational thinking in its multidimensionality: some of them focus on assessing knowledge or knowledge transfer, others target the perception and attitude of students towards this construct. As future work, the findings will be used for the proposal for a computational thinking self-assessment system.\n\nResumo: O objetivo deste estudo foi realizar uma Revisão Sistemática de Literatura sobre autoavaliação de Pensamento Computacional de estudantes com idades entre 10 e 15 anos. O foco da revisão foi o da autoavaliação feita por meio de escalas, questionários ou testes de conhecimento. Começamos por fazer uma revisão do conceito de Pensamento Computacional, seguida dos resultados da revisão, contendo trabalhos, métodos, instrumentos utilizados e resultados alcançados. Concluímos que já existem instrumentos validados para medir o Pensamento Computacional na sua multidimensionalidade: uns para avaliar o conhecimento ou a transferência de conhecimento, outros a percepção e atitude dos estudantes face a este construto. Como trabalhos futuros, serão usados os achados para a proposta de um sistema de autoavaliação de Pensamento Computacional. Palavras-chave: Pensamento Computacional, Avaliação, Educação em Ciência da Computação.","authors":["Amilton Rodrigo Quadros Martins","Guilhermina Miranda","Adelmo Eloy"],"meta":["August 2020RENOTE 18(1)","DOI:10.22456/1679-1916.106041","Projects: DRLEGroupComputational Thinking Assessment"],"references":["318469859_Complementary_Tools_for_Computational_Thinking_Assessment","274309848_Computational_Thinking","262350755_Computational_Thinking_in_Elementary_and_Secondary_Teacher_Education","234812396_Education_Paving_the_way_for_computational_thinking","314191072_Assessing_elementary_students'_computational_thinking_in_everyday_reasoning_and_robotics_programming","308654282_Which_cognitive_abilities_underlie_computational_thinking_Criterion_validity_of_the_Computational_Thinking_Test","295134892_Understanding_Computer_Programming_as_a_Literacy"]}