{"id":"343424986_Evolving_cooperation_in_multichannel_games","abstract":"Humans routinely engage in many distinct interactions in parallel. Team members collaborate on several concurrent projects, and even whole nations interact with each other across a variety of issues, including trade, climate change and security. Yet the existing theory of direct reciprocity studies isolated repeated games. Such models cannot account for strategic attempts to use the vested interests in one game as a leverage to enforce cooperation in another. Here we introduce a general framework of multichannel games. Individuals interact with each other over multiple channels; each channel is a repeated game. Strategic choices in one channel can affect decisions in another. With analytical equilibrium calculations for the donation game and evolutionary simulations for several other games we show that such linkage facilitates cooperation. Our results suggest that previous studies tend to underestimate the human potential for reciprocity. When several interactions occur in parallel, people often learn to coordinate their behavior across games to maximize cooperation in each of them.","authors":["Kate Donahue","Oliver Hauser","Martin A Nowak","Christian Hilbe"],"meta":["August 2020Nature Communications 11(1)","DOI:10.1038/s41467-020-17730-3"],"references":["335174476_Social_dilemmas_among_unequals","329720338_Generalized_Social_Dilemmas_The_Evolution_of_Cooperation_in_Populations_with_Variable_Group_Size","326188789_Evolution_of_cooperation_in_stochastic_games","322990646_Crosstalk_in_concurrent_repeated_games_impedes_direct_reciprocity_and_requires_stronger_levels_of_forgiveness","347563337_The_Calculus_of_Selfishness","334062374_Five_Rules_for_the_Evolution_of_Cooperation","334043552_Evolutionary_dynamics_of_complex_multiple_games","329264552_The_Theory_of_Multimarket_Competition_A_Synthesis_and_Implications_for_Marketing_Strategy","326845924_The_iterated_Prisoner's_Dilemma_Good_strategies_and_their_dynamics","324153448_Partners_and_rivals_in_direct_reciprocity"]}