{"id":"343568936_Students'_Level_of_Self-confidence_and_Performance_Tasks","abstract":"Self confidence refers to as someone's' power and abilities to perform the required tasks. In order to accomplish the given tasks students must have self-confidence. This study investigated the correlation between students level of self-confidence and performance tasks and investigated if self-confidence influence to students' performance tasks. The study used descriptive correlation designed for the two variables. The respondents of this study are the Senior High School Students of Jagobiao National High School. The data were obtained from self-confidence and performance tasks questionnaire in which it is a form of checklist. Through presentation, Analysis and interpretation of data it was determined the overall weighted mean of the both variable. By the used of indicators the overall weighted mean was determined and it was interpreted as sometimes, while the overall weighted mean in the second variable was interpreted as sometimes. The association between the dependent and the independent variable were analyzed using pearson chi-square, result showed that there is a significant relationship between the two variabl e. In conclusion, there is an association between students level of self-confidence and performance tasks. It means that students who have high level of self-confidence can easily accomplish their tasks in school and most of them are not afraid to participate in every activity. While those students who have low self-confidence showed low performance tasks and they were hesitant to participate in every activity","authors":["Jerald Cano-og Moneva","Shiela Mae Tribunalo"],"meta":["May 2020"],"references":["295980341_Self-Esteem_Academic_Performance_among_University_Students","270041026_The_Correlation_between_General_Self-Confidence_and_Academic_Achievement_in_the_Oral_Presentation_Course","49591442_Relationship_Between_Self-esteem_and_Academic_Achievement_Amongst_Pre-University_Students"]}