{"id":"343553543_Medical_Negligence_An_Overview","abstract":"Medical professionals are treated as next to God. They provide humanitarian services and gives solace to individuals suffering from various diseases and disorders. Due to their great service to humanity, the doctors and medical professionals are treated with reverence and since the ancient times the medical profession has been considered as a noble profession. However with the passage of time, there has been a change in the doctor - patient relationship. During the last few decades a number of incidents have come to light in which the patients have suffered due to the error and inadvertent conduct of doctors. Due to the increasing conflicts and legal disputes between the doctors and patients, most of the legal systems have developed various rules and principles to deal with such inadvertent behavior of doctors. This has led to the development of a new branch of jurisprudence, i.e. medical negligence. Hence, any negligence on part of the medical professional would be treated as either a tort of negligence or a deficiency in service under Consumer Protection Act, 1986. As the profession involves the idea of an occupation requiring purely intellectual skills or of manual skills controlled by the intellectual skill of the operator, it is distinctively different from an occupation, which is substantially production or sale or arrangement for the production or sale of commodities. Medicine is a highly complex domain. It is difficult for consumer laws to review medical negligence cases with flawless technical clarity and accuracy. Thus medical negligence is not purely a matter of consideration for judiciary but also the technical inputs of specialized experts in the field have substantial weightage while deciding the case of medical negligence against doctors. The present paper is devoted to introvert inspection of negligence in medical profession in the light of existing laws with more emphasis on the interpretation of consumer protection law by judiciary.","authors":["Bratin Kumar Dey"],"meta":["April 2017","DOI:10.47210/bjohns.2017.v25i1.111"],"references":[]}