{"id":"343506487_Indicator_Patterns_of_Forced_Change_Learned_by_an_Artificial_Neural_Network","abstract":"Abstract Many problems in climate science require the identification of signals obscured by both the “noise” of internal climate variability and differences across models. Following previous work, we train an artificial neural network (ANN) to predict the year of a given map of annual‐mean temperature (or precipitation) from forced climate model simulations. This prediction task requires the ANN to learn forced patterns of change amidst a background of climate noise and model differences. We then apply a neural network visualization technique (layerwise relevance propagation) to visualize the spatial patterns that lead the ANN to successfully predict the year. These spatial patterns thus serve as “reliable indicators” of the forced change. The architecture of the ANN is chosen such that these indicators vary in time, thus capturing the evolving nature of regional signals of change. Results are compared to those of more standard approaches like signal‐to‐noise ratios and multilinear regression in order to gain intuition about the reliable indicators identified by the ANN. We then apply an additional visualization tool (backward optimization) to highlight where disagreements in simulated and observed patterns of change are most important for the prediction of the year. This work demonstrates that ANNs and their visualization tools make a powerful pair for extracting climate patterns of forced change.","authors":["Elizabeth A. Barnes","Benjamin Toms","James W. Hurrell","Imme Ebert-Uphoff"],"meta":["September 2020Journal of Advances in Modeling Earth Systems 12(9)","DOI:10.1029/2020MS002195"],"references":["342593824_Physically_Interpretable_Neural_Networks_for_the_Geosciences_Applications_to_Earth_System_Variability","341752325_Partitioning_climate_projection_uncertainty_with_multiple_large_ensembles_and_CMIP56","339053286_Partitioning_climate_projection_uncertainty_with_multiple_Large_Ensembles_and_CMIP56","338345425_Climate_change_now_detectable_from_any_single_day_of_global_weather","337386184_Viewing_Forced_Climate_Patterns_Through_an_AI_Lens","335358787_Making_the_Black_Box_More_Transparent_Understanding_the_Physical_Implications_of_Machine_Learning","334750250_Spatially_Extended_Tests_of_a_Neural_Network_Parametrization_Trained_by_Coarse-Graining","333434902_Uncovering_the_Forced_Climate_Response_from_a_Single_Ensemble_Member_Using_Statistical_Learning","324427078_The_Global_Precipitation_Climatology_Project_GPCP_Monthly_Analysis_New_Version_23_and_a_Review_of_2017_Global_Precipitation","345347894_Insights_from_Earth_system_model_initial-condition_large_ensembles_and_future_prospects"]}