{"id":"343516645_Multi-Stage_Optimized_Machine_Learning_Framework_for_Network_Intrusion_Detection","abstract":"Cyber-security garnered significant attention due to the increased dependency of individuals and organizations on the Internet and their concern about the security and privacy of their online activities. Several previous machine learning (ML)-based network intrusion detection systems (NIDSs) have been developed to protect against malicious online behavior. This paper proposes a novel multi-stage optimized ML-based NIDS framework that reduces computational complexity while maintaining its detection performance. This work studies the impact of oversampling techniques on the models’ training sample size and determines the minimal suitable training sample size. Furthermore, it compares between two feature selection techniques, information gain and correlation-based, and explores their effect on detection performance and time complexity. Moreover, different ML hyper-parameter optimization techniques are investigated to enhance the NIDS’s performance. The performance of the proposed framework is evaluated using two recent intrusion detection datasets, the CICIDS 2017 and the UNSW-NB 2015 datasets. Experimental results show that the proposed model significantly reduces the required training sample size (up to 74%) and feature set size (up to 50%). Moreover, the model performance is enhanced with hyper-parameter optimization with detection accuracies over 99% for both datasets, outperforming recent literature works by 1-2% higher accuracy and 1-2% lower false alarm rate.","authors":["Mohammadnoor Ahmad Mohammad Injadat","Abdallah Moubayed","Ali Bou Nassif","Abdallah Shami"],"meta":["August 2020IEEE Transactions on Network and Service Management PP(99):1-1","DOI:10.1109/TNSM.2020.3014929","Project: Network Security"],"references":["338779142_BotChase_Graph-Based_Bot_Detection_Using_Machine_Learning","336398533_Software-Defined_Perimeter_SDP_State_of_the_Art_Secure_Solution_for_Modern_Networks","344103240_Ensemble-based_Feature_Selection_and_Classification_Model_for_DNS_Typo-squatting_Detection","343209731_On_Hyperparameter_Optimization_of_Machine_Learning_Algorithms_Theory_and_Practice","341219683_Systematic_ensemble_model_selection_approach_for_educational_data_mining","339963269_Student_Engagement_Level_in_e-Learning_Environment_Clustering_Using_K-means","339555971_Tree-Based_Intelligent_Intrusion_Detection_System_in_Internet_of_Vehicles","338681785_Hyperparameter_Optimization","336946608_Performance_Analysis_of_SDP_For_Secure_Internal_Enterprises","334529397_DDoS_Detection_System_Using_a_Set_of_Classification_Algorithms_Controlled_by_Fuzzy_Logic_System_in_Apache_Spark"]}