{"id":"343517514_The_Human_Genome_Project_changed_everything","abstract":"Thirty years on from the launch of the Human Genome Project, Richard Gibbs reflects on the promises that this voyage of discovery bore. Its success should be measured by how this project transformed the rules of research, the way of practising biological discovery and the ubiquitous digitization of biological science. Thirty years on from the launch of the Human Genome Project, Richard Gibbs reflects on the promisesthat this voyage of discovery bore. Its success should be measured by how this project transformed the rules of research, the way of practising biological discovery and the ubiquitous digitization of biological science. Richard Gibbs, AC, PhD is a human geneticist and the Founding Director of the Baylor College of Medicine Human Genome Sequencing Center (HGSC). He graduated from the University of Melbourne in Genetics and Radiation Biology and moved to Houston, TX, to study the molecular basis of genetic disease. He developed basic methods for DNA and mutation analysis and was an early contributor to the Human Genome Project (HGP), leading one of five sites that generated the majority of the sequence. Since the completion of the HGP, he has led multiple genome projects including the generation of the first personalized whole-genome diploid human sequences. His group pioneered the oligonucleotide exon-capture methods that are widely used today for whole-exome sequencing, and he is currently leading programmes for translation of genomic data into the clinic.","authors":["Richard A. Gibbs"],"meta":["August 2020Nature Reviews Genetics 21(10):1-2","DOI:10.1038/s41576-020-0275-3"],"references":["281099716_Initial_sequencing_and_analysis_of_the_human_genome","224890567_A_map_of_human_genome_variation_from_population-scale_sequencing","224890537_The_sequence_of_the_human_genome","224890400_Consortium_TGP_A_map_of_human_genome_variation_from_population-scale_sequencing_Nature_467_1061-1073","30863479_The_International_HapMap_ProjectCity","20382902_Identification_of_the_Cystic_Fibrosis_Gene_Chromosome_Walking_and_Jumping","12149020_The_Sequence_of_the_Human_Genome","12094922_Initial_sequencing_and_analysis_of_the_human_genome","343171084_Therapeutic_Update_on_Huntington's_Disease_Symptomatic_Treatments_and_Emerging_Disease-Modifying_Therapies","306157516_Initial_sequencing_and_analysis_of_the_human_genome","284026428_The_International_HapMap_Project","261187014_The_race_to_clone_BRCA1","222009779_International_Human_Genome_Sequencing_Consotium_Initial_sequencing_and_analysis_of_the_human_genome_Nature_409_860-921","12099291_Bermuda_Rules_Community_Spirit_With_Teeth","11690968_The_criminal_law_implications_of_the_Human_Genome_Project_Reimagining_a_genetically_oriented_criminal_justice_system"]}