{"id":"343535496_2D-VSR-Sim_A_simulation_tool_for_the_optimization_of_2-D_voxel-based_soft_robots","abstract":"Voxel-based soft robots (VSRs) are robots composed of many small, cubic blocks of a soft material with mechanical properties similar to those of living tissues and that can change their volume based on signals emitted by the robot controller, i.e., by its brain. Designing the body and the brain of a VSR suitable for a specific task is a complex activity that requires suitable optimization heuristics. We here present a software, 2D-VSR-Sim, for facilitating research on the optimization of VSRs body and brain. 2D-VSR-Sim, written in Java, provides consistent interfaces for all the VSRs aspects suitable for optimization and considers by design the presence of sensing, i.e., the possibility of exploiting the feedback from the environment for controlling the VSR. We present the mechanical model employed by 2D-VSR-Sim and we experimentally characterize the computational burden of the simulation. Finally, we show how 2D-VSR-Sim can be used to repeat the experiments of significant previous studies and, in perspective, to provide experimental answers to a variety of research questions.","authors":["Eric Medvet","Alberto Bartoli","Andrea De Lorenzo","Stefano Seriani"],"meta":["July 2020","DOI:10.1016/j.softx.2020.100573"],"references":["338575390_A_scalable_pipeline_for_designing_reconfigurable_organisms","338365427_Automatic_Generation_of_Locomotion_Patterns_for_Soft_Modular_Reconfigurable_Robots","334544159_Transparent_Soft_Robots_for_Effective_Camouflage","326723959_Soft_Robots_Manufacturing_A_Review","322707356_Soft_robotics_Definition_and_research_issues","344982002_Titan_A_Parallel_Asynchronous_Library_for_Multi-Agent_and_Soft-Body_Robotics_using_NVIDIA_CUDA","342542979_Evolution_of_distributed_neural_controllers_for_voxel-based_soft_robots","342188442_Scalable_sim-to-real_transfer_of_soft_robot_designs","334617107_Evolutionary_Synthesis_of_Sensing_Controllers_for_Voxel-based_Soft_Robots","324611157_Miniature_soft_robots_-_road_to_the_clinic"]}