{"id":"343506982_Discussing_Relations_Between_Dynamic_Business_Environments_and_Big_Data_Analytics","abstract":"Big data attracts researchers and practitioners around the globe in their de-sire to effectively manage the data deluge resulting from the ongoing evo-lution of the information systems domain. Consequently, many decision makers attempt to harness the potentials arising with the use of those mod-ern technologies in a multitude of application scenarios. As a result, big da-ta has gained an important role for many businesses. However, as of today, the developed solutions are oftentimes perceived as completed products, without considering that the application in highly dynamic environments might benefit from a deviation of this approach. Relevant data sources as well as the questions that are supposed to be answered by their analysis may change rapidly and so do subsequently the requirements regarding the functionalities of the system. To our knowledge, while big data itself is a prominent topic, fields of application that are likely to evolve in a short pe-riod of time and the resulting consequences were not specifically investi-gated until now. Therefore, this research aims to overcome this paucity by clarifying the relation between dynamic business environments and big da-ta analytics (BDA), sensitizing researchers and practitioners for future big data engineering activities. Apart from a thorough literature review, expert interviews are conducted that evaluate the made inferences regarding dy-namic and stable influencing factors, the influence of dynamic environ-ments on BDA applications as well as possible countermeasures. The as-certained insights are condensed into a proposal for decision making, fa-cilitating the alignment of BDA and business needs in dynamic business environments.","authors":["Daniel Staegemann","Matthias Volk","Christian Daase","Klaus Turowski"],"meta":["July 2020Complex Systems Informatics and Modeling Quarterly","DOI:10.7250/csimq.2020-23.05","Project: Decision Support for Big Data Projects"],"references":["341414225_Sensor-Driven_Learning_of_Time-Dependent_Parameters_for_Prescriptive_Analytics","338910540_Theme_Mapping_and_Bibliometrics_Analysis_of_One_Decade_of_Big_Data_Research_in_the_Scopus_Database","337245580_Using_microservices_and_event_driven_architecture_for_big_data_stream_processing","336713689_Adversarial_Preference_Learning_with_Pairwise_Comparisons","336318882_Understanding_Issues_in_Big_Data_Applications_-_A_Multidimensional_Endeavor","334051335_Big_Data_Analytics_and_Firm_Performance_A_Systematic_Review","341474089_Tackling_the_Six_Fundamental_Challenges_of_Big_Data_in_Research_Projects_by_Utilizing_a_Scalable_and_Modular_Architecture","336807109_Role_and_Challenges_of_Unstructured_Big_Data_in_Healthcare","334698207_Challenges_of_Big_Data_Implementation_in_a_Public_Hospital","333831419_Enhancing_Supply_Chain_Risk_Management_by_Applying_Machine_Learning_to_Identify_Risks"]}