{"id":"343693650_SAR_Image_Despeckling_by_Deep_Neural_Networks_from_a_Pre-Trained_Model_to_an_End-to-End_Training_Strategy","abstract":"Speckle reduction is a longstanding topic in synthetic aperture radar (SAR) images. Many different schemes have been proposed for the restoration of intensity SAR images. Among the different possible approaches, methods based on convolutional neural networks (CNNs) have recently shown to reach state-of-the-art performance for SAR image restoration. CNN training requires good training data: many pairs of speckle-free/speckle-corrupted images. This is an issue in SAR applications, given the inherent scarcity of speckle-free images. To handle this problem, this paper analyzes different strategies one can adopt, depending on the speckle removal task one wishes to perform and the availability of multitemporal stacks of SAR data. The first strategy applies a CNN model, trained to remove additive white Gaussian noise from natural images, to a recently proposed SAR speckle removal framework: MuLoG (MUlti-channel LOgarithm with Gaussian denoising). No training on SAR images is performed, the network is readily applied to speckle reduction tasks. The second strategy considers a novel approach to construct a reliable dataset of speckle-free SAR images necessary to train a CNN model. Finally, a hybrid approach is also analyzed: the CNN used to remove additive white Gaussian noise is trained on speckle-free SAR images. The proposed methods are compared to other state-of-the-art speckle removal filters, to evaluate the quality of denoising and to discuss the pros and cons of the different strategies. Along with the paper, we make available the weights of the trained network to allow its usage by other researchers.","authors":["Emanuele Dalsasso","Xiangli Yang","Loic Denis","Florence Tupin"],"meta":["August 2020Remote Sensing 12(16):2636","DOI:10.3390/rs12162636"],"references":["326043183_Deep_CNN_Denoiser_prior_for_multiplicative_noise_removal","325633536_Dilated_Deep_Residual_Network_for_Image_Denoising","320669646_An_ELU_Network_with_Total_Variation_for_Image_Denoising","337984483_A_New_Parameterization_for_the_Rician_Distribution","328984811_Learning_Speckle_Suppression_in_Sar_Images_Without_Ground_Truth_Application_to_Sentinel-1_Time-Series","325377072_Ratio-based_multi-temporal_SAR_images_denoising","323708893_Generative_adversarial_network-based_restoration_of_speckled_SAR_images","323064043_Subpixellic_Methods_for_Sidelobes_Suppression_and_Strong_Targets_Extraction_in_Single_Look_Complex_SAR_Images","321788382_SAR_image_despeckling_through_convolutional_neural_networks","321738697_Deep_Shrinkage_Convolutional_Neural_Network_for_Adaptive_Noise_Reduction"]}