{"id":"343634567_Promoting_Technology-_Implementation_Learning_paradigm_for_online_learning_in_secondary_Education","abstract":"Online learning via educational Technology tools has been used as a paradigm shift in education to transmit knowledge and promote learners’ engagement in secondary learning environments. The emotional, behavioral and the cognitive facets of engagement play an important role in the learning process and social development. Learner engagement refers to the degree of attention, focus, belief, interest, and emotions that motivate learners successfully to practice higher-level critical thinking skills, and to promote meaningful learning experiences to achieve the course’s learning objectives and progress in their education. In this paper, the technology-implementation learning paradigm is proposed for the purpose of promoting learners’ engagement in online learning. This proposed paradigm is composed of four interacted fundamental dimensions, Attitude dimension, pedagogical dimension, social dimension, and technical dimension (APTS) that lead to engage learners emotionally, behaviorally and cognitively in technology-supported learning environment. Attitude dimension is the intentions and the perspectives to understand, interact and manage emotional skills and abilities needed by technology users for the effective usage of educational technology tools. Pedagogical dimension is the active learning process for cognitive development using pre-defined learning objectives and pedagogical theories to identify learning strategies and assessments to achieve planned educational outcomes. Technical dimension intends to create a computer and media literacy that allow learners and instructors to employ online learning without technical difficulties. Social dimension is to create a technology cooperation where learners are Networking with other learners and willing to share positively their experiences with peers and/or with the teacher to attain their emotional, social and cognitive engagement and keeps them motivated, and even inspired.","authors":["Fouad Yehya"],"meta":["April 2020Global Journal of Information Technology Emerging Technologies 10(1):12-21","DOI:10.18844/gjit.v10i1.4620"],"references":["333489448_Learning_with_simulations_Influence_of_a_computer_simulation_with_hand-_on_activities_on_students'_learning_of_the_physics_capacitors'_concepts","331336413_Lebanese_Secondary_Physics_Teachers'_Attitudes_Towards_the_Use_of_ICT","324971681_Evolving_learning_paradigms_Re-setting_baselines_and_collection_methods_of_information_and_communication_technology_in_education_statistics","322569898_Finding_traces_of_self-regulated_learning_in_activity_streams","339890789_Strategies_and_Interventions_for_Promoting_Cognitive_Engagement","326926643_Factors_influencing_preservice_teachers'_intention_to_use_technology_TPACK_teacher_self-efficacy_and_technology_acceptance_model","326734267_1-_Diagnosing_the_barriers_for_integrating_Educational_Technology_in_Physics_courses_in_Lebanese_secondary_schools-","324912378_Exploring_the_impacts_of_interactions_social_presence_and_emotional_engagement_on_active_collaborative_learning_in_a_social_web-based_environment","323614786_Students_Engaged_in_Learning","322079673_The_Influence_of_Motivational_Regulation_Strategies_on_Online_Students'_Behavioral_Emotional_and_Cognitive_Engagement"]}