{"id":"3436240_Broadcast_storm_mitigation_techniques_in_vehicular_ad_hoc_networks","abstract":"Several multihop applications developed for vehicular ad hoc networks use broadcast as a means to either discover nearby neighbors or propagate useful traffic information to other vehicles located within a certain geographical area. However, the conventional broadcast mechanism may lead to the so-called broadcast storm problem, a scenario in which there is a high level of contention and collisions at the link layer due to an excessive number of broadcast packets. While this is a well-known problem in mobile ad hoc wireless networks, only a few studies have addressed this issue in the VANET context, where mobile hosts move along the roads in a certain limited set of directions as opposed to randomly moving in arbitrary directions within a bounded area. Unlike other existing works, we quantify the impact of broadcast storms in VANETs in terms of message delay and packet loss rate in addition to conventional metrics such as message reachability and overhead. Given that VANET applications are currently confined to using the DSRC protocol at the data link layer, we propose three probabilistic and timer-based broadcast suppression techniques: weighted p-persistence, slotted 1-persistence, and slotted p-persistence schemes , to be used at the network layer. Our simulation results show that the proposed schemes can significantly reduce contention at the MAC layer by achieving up to 70 percent reduction in packet loss rate while keeping end-to-end delay at acceptable levels for most VANET applications.","authors":["N. Wisitpongphan","O.K. Tonguz","J.S. Parikh","Priyantha Mudalige"],"meta":["January 2008IEEE Wireless Communications 14(6):84 - 94","DOI:10.1109/MWC.2007.4407231","SourceIEEE Xplore"],"references":["220926567_The_Broadcast_Storm_Problem_in_a_Mobile_ad_hoc_Network","220926401_GrooveSim_A_Topography-Accurate_Simulator_for_Geographic_Routing_in_Vehicular_Networks","310670788_Ad-hoc_on-demand_distance_vector_AODV_routing","284602927_Ad_hoc_on-demand_distance_vector_AODV_routing","260856125_Gossip_Based_Ad-Hoc_Routing","248591447_Ad_hoc_on_demand_distance_vector_AODV_routing_for_IP_version_6","239052893_The_Dynamic_Source_Routing_Protocol_for_Mobile_Ad_Hoc_Networks","237128285_Flow_State_in_the_Dynamic_Source_Routing_Protocol_for_Mobile_Ad_Hoc_Networks","224675650_An_Efficient_Fully_Ad-Hoc_Multi-Hop_Broadcast_Protocol_for_Inter-Vehicular_Communication_Systems","220926300_Urban_Multi-Hop_Broadcast_Protocol_for_Inter-Vehicle_Communication_Systems"]}