{"id":"343688291_An_Evolutionary_Multi-Objective_Framework_for_Complex_Network_Reconstruction_Using_Community_Structure","abstract":"The problem of inferring nonlinear and complex dynamical systems from available data is prominent in many fields including engineering, biological, social, physical, and computer sciences. Many evolutionary algorithm (EA) based network reconstruction methods have been proposed to address this problem, but they ignore several useful information of network structure, such as community structure, which widely exists in various complex networks. Inspired by the community structure, this paper develops a community-based evolutionary multi-objective network reconstruction framework to promote the reconstruction performance of EA-based network reconstruction methods due to their good performance; we refer this framework as CEMO-NR. CEMO-NR is a generic framework and any population-based multi-objective metaheuristic algorithm can be employed as the base optimizer. CEMO-NR employs the community structure of networks to divide the original decision space into multiple small decision spaces, and then any multi-objective evolutionary algorithm (MOEA) can be used to search for improved solutions in the reduced decision space. To verify the performance of CEMO-NR, this paper also designs a test suite for complex network reconstruction problems. Three representative MOEAs are embedded into CEMO-NR and compared with their original versions, respectively. The experimental results have demonstrated the significant improvement benefiting from the proposed CEMO-NR in 30 multi-objective network reconstruction problems.","authors":["Kai Wu","Jing Liu","Xingxing Hao","Penghui Liu"],"meta":["August 2020IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council PP(99)","DOI:10.1109/TEVC.2020.3020423","Project: Data-driven Network Reconstruction"],"references":["340460252_Online_Fuzzy_Cognitive_Map_Learning","337423793_Time_Series_Prediction_Using_Sparse_Autoencoder_and_High-Order_Fuzzy_Cognitive_Maps","333186147_An_Evolutionary_Algorithm_for_Large-Scale_Sparse_Multi-Objective_Optimization_Problems","330692272_Accelerating_Large-Scale_Multiobjective_Optimization_via_Problem_Reformulation","336205616_Cost-Aware_Robust_Control_of_Signed_Networks_by_Using_a_Memetic_Algorithm","328934733_Network_reconstruction_based_on_time_series_via_memetic_algorithm","328919977_A_Scalable_Indicator-Based_Evolutionary_Algorithm_for_Large-Scale_Multi-Objective_Optimization","327428418_A_Survey_on_Cooperative_Co-Evolutionary_Algorithms","320638294_Coevolutionary_Multi-objective_Evolutionary_Algorithms_A_Survey_of_the_State-of-the-Art","320481101_A_Mutual_Information-Based_Two-Phase_Memetic_Algorithm_for_Large-Scale_Fuzzy_Cognitive_Map_Learning"]}