{"id":"343689901_Education_in_times_of_crisis_Rapid_transition_to_distance_learning","abstract":"The COVID-19 crisis is having a significant impact on the quality of life and future of young people; it can also lead to disruption in education. A disruption would pose a severe threat to the entire society in the postcrisis period. Therefore, educational institutions must respond quickly and ensure the continuity of the educational processes. Our research goal has been to develop and implement a model enabling a rapid transition from the traditional to the distance learning model in a state of emergency. Our focus has been on conceiving technical, organizational, and pedagogical changes that educational organizations need to implement to enable different interaction methods, ensure continuity, and provide high-quality education. We have defined and implemented a model, which is described in detail in this paper, thus giving guidelines for a rapid transition to distance learning, which is not restricted to the crisis times only. We have evaluated our approach by monitoring the IT solutions and surveying students and teachers at the School of Computing, Union University of Belgrade. The results indicate the high satisfaction of these participants in the educational processes. They imply the acceptability of prolonged distance learning, if needed, and embrace the hybrid education model for the next generation of students.","authors":["Zivko Bojovic","Petar D. Bojović","Dušan Vujošević","Jelena Šuh"],"meta":["August 2020Computer Applications in Engineering Education 28(3)","DOI:10.1002/cae.22318","Project: Distance learning research"],"references":["340535196_The_Difference_Between_Emergency_Remote_Teaching_and_Online_Learning","340211964_Strategies_for_the_prevention_and_management_of_coronavirus_disease_2019","337884548_Developing_Faculty_to_Teach_with_Technology_Themes_from_the_Literature","336411760_The_Effect_of_A_Flipped_Classroom_on_Students'_Achievements_Academic_Engagement_and_Satisfaction_Levels","334816391_Synchronous_at_Scale_Investigation_and_Implementation_of_a_Semi-Synchronous_Online_Lecture_Platform","335450532_Do_course_evaluation_systems_have_an_influence_on_e-learning_student_satisfaction","333501222_Achievement_Engagement_and_Student_Satisfaction_in_a_Synchronous_Online_Course","332813483_Critical_Success_Factors_for_Online_Education_Longitudinal_Results_on_Program_Satisfaction","332341383_Development_and_Validation_of_an_Instrument_to_Measure_Student_Perceived_E-Learning_Service_Quality","329394370_Predicting_student_satisfaction_and_perceived_learning_within_online_learning_environments"]}