{"id":"343600047_Hypercompositional_Algebra_Computer_Science_and_Geometry","abstract":"The various branches of Mathematics are not separated between themselves. On the contrary, they interact and extend into each other’s sometimes seemingly different and unrelated areas and help them advance. In this sense, the Hypercompositional Algebra’s path has crossed, among others, with the paths of the theory of Formal Languages, Automata and Geometry. This paper presents the course of development from the hypergroup, as it was initially defined in 1934 by F. Marty to the hypergroups which are endowed with more axioms and allow the proof of Theorems and Propositions that generalize Kleen’s Theorem, determine the order and the grade of the states of an automaton, minimize it and describe its operation. The same hypergroups lie underneath Geometry and they produce results which give as Corollaries well known named Theorems in Geometry, like Helly’s Theorem, Kakutani’s Lemma, Stone’s Theorem, Radon’s Theorem, Caratheodory’s Theorem and Steinitz’s Theorem. This paper also highlights the close relationship between the hyperfields and the hypermodules to geometries, like projective geometries and spherical geometries.","authors":["Gerasimos Massouros","Massouros Christos"],"meta":["August 2020","DOI:10.3390/math8081338","Project: Hypercompositional Algebra and Applications"],"references":["339988541_Derived_Hyperstructures_from_Hyperconics","337474348_Hyperhomographies_on_Krasner_Hyperfields","336096093_Superring_of_Polynomials_over_a_Hyperring","334693396_Hyperstructure_generalizations_of_quasi-automata_induced_by_modelling_functions_and_signal_processing","332700470_n-ary_Cartesian_composition_of_automata","332262351_Extension_of_elliptic_curves_on_Krasner_hyperfields","326697773_Languages_Automata_and_Hypercompositional_Structures","326364058_On_open_and_closed_hypercompositions","326363978_Matroids_over_hyperfields","326339226_State_hyperstructures_of_tree_automata_based_on_lattice-valued_logic"]}