{"id":"343655430_Dynamic_assessment_effect_on_speaking_performance_of_Indonesian_EFL_learners","abstract":"The research concerned the application of Dynamic Assessment (DA) in English Language Teaching (ELT) which based on Vygotsky's theory, namely Zone of Proximal Development (ZPD). The research was meant to investigate the effect of DA in improving teaching and learning speaking in Indonesia especially English as a Foreign Language (EFL) learners in university. The research was conducted using a qualitative method by involving four Indonesian university learners in the first semester. The participants received the same treatments through pre-test and self-reflection, feedback and knowledge expansion, post-test and self-reflection, post-feedback, and semi-structured interviews. The instruments were used to analyze the learners' non-fluency and mastery problem. The analysis showed that the learners' speaking performance was improved after experiencing DA sessions. The results of the test and self-reflection showed significant improvement in their speaking. The finding showed some positive effects of DA on EFL learners' speaking performance. In interviews, learners showed positive experiences and attitude toward DA since it served them a comfortable, structured, practical, and meaningful platform to recognize their speaking behavior, weaknesses, strength, and needs. Furthermore, it also helped them to get the objective feedbacks with less anxiety. The researchers conclude that DA can be applied as a primary alternative assessment in English speaking practices.","authors":["Fahmi Fahmi","Bambang Widi Pratolo","Nurul Amalia Zahruni"],"meta":["September 2020International Journal of Evaluation and Research in Education (IJERE) 9(3):778-790","DOI:10.11591/ijere.v9i3.20466"],"references":["334943061_Multiple_Studies_The_Influence_of_Collaborative_Learning_Approach_on_Indonesian_Secondary_High_School_Students'_English-Speaking_Skills","331431493_A_qualitative_study_of_teacher_talk_in_an_EFL_classroom_interaction_in_Aceh_Tengah_Indonesia","329313773_Teach-to-Test_Instruction_of_Dynamic_AssessmentA_Critical_Overview","328387861_Teacher-student_collaborative_assessment_TSCA_in_integrated_language_classrooms","328387045_Promoting_speaking_spontaneity_in_large_classes_An_action_research_study_in_an_Indonesian_EFLuniversity_setting","325715440_Eliciting_teachers'_understanding_and_their_reported_practices_on_school-based_formative_assessment_Methodological_challenges","344247877_Language_Testing_and_Validation_An_Evidence-Based_Approach","343858697_Dynamic_assessment_in_higher_education_English_language_classes_A_lecturer_perspective","333532966_THE_EFFECTIVENESS_OF_USING_WEBTOONS_TO_DEVELOP_STUDENTS'_SPEAKING_PERFORMANCE_ON_RECOUNT","332642132_How_would_our_students_like_to_be_corrected_A_study_on_learners'_beliefs_about_language_learning_strategy"]}