{"id":"343631468_Brain-inspired_replay_for_continual_learning_with_artificial_neural_networks","abstract":"Artificial neural networks suffer from catastrophic forgetting. Unlike humans, when these networks are trained on something new, they rapidly forget what was learned before. In the brain, a mechanism thought to be important for protecting memories is the reactivation of neuronal activity patterns representing those memories. In artificial neural networks, such memory replay can be implemented as ‘generative replay’, which can successfully – and surprisingly efficiently – prevent catastrophic forgetting on toy examples even in a class-incremental learning scenario. However, scaling up generative replay to complicated problems with many tasks or complex inputs is challenging. We propose a new, brain-inspired variant of replay in which internal or hidden representations are replayed that are generated by the network’s own, context-modulated feedback connections. Our method achieves state-of-the-art performance on challenging continual learning benchmarks (e.g., class-incremental learning on CIFAR-100) without storing data, and it provides a novel model for replay in the brain. One challenge that faces artificial intelligence is the inability of deep neural networks to continuously learn new information without catastrophically forgetting what has been learnt before. To solve this problem, here the authors propose a replay-based algorithm for deep learning without the need to store data.","authors":["Gido van de Ven","Hava T. Siegelmann","Andreas S Tolias"],"meta":["August 2020Nature Communications 11(1):4069","DOI:10.1038/s41467-020-17866-2"],"references":["336166757_Generative_Models_from_the_perspective_of_Continual_Learning","334247624_Human_Replay_Spontaneously_Reorganizes_Experience","329245020_Lifelong_Learning_of_Spatiotemporal_Representations_With_Dual-Memory_Recurrent_Self-Organization","323335071_Continual_Lifelong_Learning_with_Neural_Networks_A_Review","322975942_Alleviating_catastrophic_forgetting_using_context-dependent_gating_and_synaptic_stabilization","338488196_Continual_Learning_Through_Synaptic_Intelligence","327207235_Generative_Predictive_Codes_by_Multiplexed_Hippocampal_Neuronal_Tuplets","322328971_A_Note_on_the_Inception_Score","321067924_Learning_without_Forgetting","320971202_iCaRL_Incremental_Classifier_and_Representation_Learning"]}