{"id":"343657926_Applying_Learning_Analytics_to_Map_Students'_Self-Regulated_Learning_Tactics_in_an_Academic_Writing_Course","abstract":"Academic writing is a complex and challenging language learning activity, in which self-regulation is a key critical factor for learner success. Today, a large number of academic writing activities occur in digital learning spaces, including computer-supported collaborative learning settings. Recent advances in the fields of learning analytics (LA) and computer-assisted language learning have provided new opportunities, in part because of the accessibility to new digital learner data, to better understand and ultimately support students’ self-regulated learning (SRL) processes. Even though some related efforts have been made, there is yet a paucity of research targeting foreign language students’ interactive SRL behavior in online environments. This study aims to shed more light on this issue, and on the possible ways to fill this gap. We used LA methods (frequency analysis, network analysis, statistical analysis and process mining) to analyse and visualise students’ SRL tactics when collaborating with their peers on academic writing tasks on social networking sites. The dataset was obtained from a case study performed at the University of Antwerp (Belgium). In this study, a private Facebook group was integrated in an academic writing course for first-year foreign language majors of English (n=124) and served as an online collaborative space for peer review. The results show, firstly, that foreign language learners use a range of SRL tactics to manage their academic writing process and, secondly, that the strategic SRL task phases (plan, perform and evaluate) are strongly interconnected. Learners exhibit a readiness and willingness to activate knowledge, monitor progress, interact to adjust to the socio-cultural context and form an identity as a learner. There is a significant positive correlation between students’ use of SRL tactics and their learning performance, which provides novel ground for designing and providing relevant SRL support mechanisms in computer-supported collaborative learning.","authors":["Ward Peeters","Mohammed Saqr","Olga Viberg"],"meta":["August 2020","Conference: In Proceedings of the 28th International Conference on Computers in EducationAt: https://icce2020.apsce.net/proceedings/ ( ISBN978-986-97214-5-5)Volume: 1"],"references":["339933052_Combining_analytic_methods_to_unlock_sequential_and_temporal_patterns_of_self-regulated_learning","338980265_Self-Regulated_Learning_and_Learning_Analytics_in_Online_Learning_Environments_A_Review_of_Empirical_Research","335528051_The_Role_of_Self-Regulation_and_Structuration_in_Mobile_Learning","332916093_The_peer_interaction_process_on_Facebook_a_social_network_analysis_of_learners'_online_conversations","329421155_Measuring_Behaviors_and_Identifying_Indicators_of_Self-Regulation_in_Computer-Assisted_Language_Learning_Courses","326259060_Time_to_focus_on_the_temporal_dimension_of_learning_A_learning_analytics_study_of_the_temporal_patterns_of_students'_interactions_and_self-regulation","325050296_Facebook_and_Conversation_Analysis","324905273_Applying_the_networking_power_of_Web_20_to_the_foreign_language_classroom_a_taxonomy_of_the_online_peer_interaction_process","341951364_AcaWriter_A_Learning_Analytics_Tool_for_Formative_Feedback_on_Academic_Writing","328622091_bupaR_Enabling_reproducible_business_process_analysis"]}