{"id":"343695558_Machine_Learning_Models_to_Predict_Childhood_and_Adolescent_Obesity_A_Review","abstract":"The prevalence of childhood and adolescence overweight an obesity is raising at an alarming rate in many countries. This poses a serious threat to the current and near-future health systems, given the association of these conditions with different comorbidities (cardiovascular diseases, type II diabetes, and metabolic syndrome) and even death. In order to design appropriate strategies for its prevention, as well as understand its origins, the development of predictive models for childhood/adolescent overweight/obesity and related outcomes is of extreme value. Obesity has a complex etiology, and in the case of childhood and adolescence obesity, this etiology includes also specific factors like (pre)-gestational ones; weaning; and the huge anthropometric, metabolic, and hormonal changes that during this period the body suffers. In this way, Machine Learning models are becoming extremely useful tools in this area, given their excellent predictive power; ability to model complex, nonlinear relationships between variables; and capacity to deal with high-dimensional data typical in this area. This is especially important given the recent appearance of large repositories of Electronic Health Records (EHR) that allow the development of models using datasets with many instances and predictor variables, from which Deep Learning variants can generate extremely accurate predictions. In the current work, the area of Machine Learning models to predict childhood and adolescent obesity and related outcomes is comprehensively and critically reviewed, including the latest ones using Deep Learning with EHR. These models are compared with the traditional statistical ones that used mainly logistic regression. The main features and applications appearing from these models are described, and the future opportunities are discussed.","authors":["Gonzalo Colmenarejo"],"meta":["August 2020Nutrients 12(8):2466","DOI:10.3390/nu12082466"],"references":["348658320_Ranking_of_a_wide_multidomain_set_of_predictor_variables_of_children_obesity_by_machine_learning_variable_importance_techniques","341313685_Genetic_Polymorphisms_Mediterranean_Diet_and_Microbiota-Associated_Urolithin_Metabotypes_can_Predict_Obesity_in_Childhood-Adolescence","338281024_Sensitivity_of_comorbidity_network_analysis","337497930_Predicting_Factors_Affecting_Adolescent_Obesity_Using_General_Bayesian_Network_and_What-If_Analysis","334213256_From_conception_to_infancy_-_early_risk_factors_for_childhood_obesity","332917801_Accurate_neuroimaging_biomarkers_to_predict_body_mass_index_in_adolescents_a_longitudinal_study","332583209_Predicting_childhood_obesity_using_electronic_health_records_and_publicly_available_data","340032059_Computerized_decision_support_and_machine_learning_applications_for_the_prevention_and_treatment_of_childhood_obesity_A_systematic_review_of_the_literature","339332696_Understanding_Early_Childhood_Obesity_via_Interpretation_of_Machine_Learning_Model_Predictions","334701130_A_Machine_Learning_Approach_for_Predicting_Weight_Gain_Risks_in_Young_Adults"]}