{"id":"343698193_A_More_Unified_Approach_to_Free_Logics","abstract":"Free logics is a family of first-order logics which came about as a result of examining the existence assumptions of classical logic. What those assumptions are varies, but the central ones are that (i) the domain of interpretation is not empty, (ii) every name denotes exactly one object in the domain and (iii) the quantifiers have existential import. Free logics usually reject the claim that names need to denote in (ii), and of the systems considered in this paper, the positive free logic concedes that some atomic formulas containing non-denoting names (namely self-identity) are true, while negative free logic rejects even the latter claim. Inclusive logics, which reject (i), are likewise considered. These logics have complex and varied axiomatizations and semantics, and the goal of this paper is to present an orderly examination of the various systems and their mutual relations. This is done by first offering a formalization, using sequent calculi which possess all the desired structural properties of a good proof system, including admissibility of contraction and cut, while streamlining free logics in a way no other approach has. We then present a simple and unified system of abstract semantics, which allows for a straightforward demonstration of the meta-theoretical properties, and offers insights into the relationship between different logics (free and classical). The final part of this paper is dedicated to extending the system with modalities by using a labeled sequent calculus, and here we are again able to map out the different approaches and their mutual relations using the same framework.","authors":["Edi Pavlović","Norbert Gratzl"],"meta":["February 2021Journal of Philosophical Logic 50(2)","DOI:10.1007/s10992-020-09564-7"],"references":["335959560_Full_Cut_Elimination_and_Interpolation_for_Intuitionistic_Logic_with_Existence_Predicate","325260903_HYPE_A_System_of_Hyperintensional_Logic_With_an_Application_to_Semantic_Paradoxes","345458464_Proof_theory_for_quantified_monotone_modal_logics","344552720_Basic_Proof_Theory","333696512_Proof-Theoretic_Analysis_of_The_Quantified_Argument_Calculus","321591069_New_Essays_in_Free_Logic_In_Honour_of_Karel_Lambert","302525885_More_Free_Logic","269681609_Existential_Presuppositions_and_Existential_Commitments","266257392_Handbook_of_Philosophical_Logic","265817915_Proof_analysis_A_contribution_to_Hilbert's_last_problem"]}