{"id":"343600853_A_Study_on_Cybersecurity_Awareness_Among_Students_in_Yobe_A_Quantitative_Approach","abstract":"The emergence of the internet and also the use of various online applications and the exposure to the social platforms that are evolving day by day have positioned students to online risk. Online fraud, cyber-bully, phishing are among those risks students are exposed to in their daily activities. To find a solution to that, cybersecurity awareness can prepare them to protect themself against such risk. This research aims to investigate the students' awareness of basic knowledge of cybersecurity. A quantitative approach was used for data collection using a set of designed questionnaires, this method was used to investigate the students' cybersecurity knowledge and observe their behavior toward using the internet, from the survey a total of 201 Computer Science students in the Department of Computer Science at Yobe State University, Nigeria participated in the study. The research has encountered moderate responses from the students as all universities are close at this period due to the COVID 19 pandemic, only students living in urban were able to reach out in the study. The result obtained from the experiment were analyzed and it shows the University students' cybersecurity awareness is at a satisfactory level and more than average of the students are not well aware of how to protect their data. The research contribution is, there is no active cybersecurity awareness program in place, and also females' students are more likely to be the victim of cyber-attack. Besides that, the survey alsoindicated a high enthusiasm for students to learn more about cybersecurity.","authors":["Adamu Garba","Maheyzah Md Siraj","Mahdi Alhaji Musa","Siti Hajar Othman"],"meta":["July 2020"],"references":["332799234_Cybersecurity_Awareness_Among_Students_and_Faculty","323206961_Cybersecurity_awareness_survey_An_analysis_from_Bangladesh_perspective","320637891_Securing_the_Information_and_Communications_Technology_Global_Supply_Chain_from_Exploitation_Developing_a_Strategy_for_Education_Training_and_Awareness","316449708_A_survey_on_internet_usage_and_cybersecurity_awareness_in_students","308943058_Understanding_University_Students'_Use_of_Facebook_for_Collaborative_Learning","292672963_A_Study_of_Cyber_Security_Awareness_in_Educational_Environment_in_the_Middle_East","320515341_Risk_Factors_for_Social_Networking_Site_Scam_Victimization_Among_Malaysian_Students","318747889_Significance_of_Information_Security_Awareness_in_the_Higher_Education_Sector","317427527_College_Students'_Cybersecurity_Risk_Perceptions_Awareness_and_Practices","304337186_An_investigation_into_risks_awareness_and_e-safety_needs_of_children_on_the_internet_A_study_of_Devon_UK"]}