{"id":"343696630_Recursos_Educativos_Desenchufados_para_la_Ensenanza_de_las_Ciencias_de_la_Computacion_en_la_Escuela_Secundaria_El_caso_Human_Area_Network","abstract":"Las actuales tendencias curriculares para la incorporación de contenidos de Ciencias de la Computación en la educación obligatoria, proponen un recorrido amplio por las distintas áreas de conocimiento.\n\nLos recursos educativos desenchufados (RED) demuestran ser una opción adecuada para establecer un primer contacto entre los estudiantes y las Ciencias de la Computación.\n\nSi bien existe una amplia variedad de Recursos Desenchufados elaborados en el marco de CSUnplugged, estos no cubren completamente la selección de contenidos propuestos para la educación obligatoria.\n\nLa insuficiente evidencia sobre su efectividad en la escuela secundaria argentina y la ausencia de un modelo consolidado que permite diseñar este tipo de RED, plantea la necesidad de abordar estos temas.\n\nEn este trabajo se presenta un enfoque didáctico disciplinar que permite orientar los procesos de diseño y evaluación de REDs, como también definir los mecanismos fundamentales evaluar la efectividad de este tipo de recursos en el ámbito de la enseñanza de las Ciencias de la Computación en la Escuela Secundaria.\n\nAdemás se presenta Human Area Network, un RED definido bajo este enfoque destinado a la enseñanza de conceptos fundamentales sobre Redes de Computadoras. Se expone el recurso y el resultado de dos trabajos de campo con docentes y estudiantes secundarios.","authors":["Daniel Dolz","Rodolfo Martínez","Gerardo Parra","Jorge Rodriguez"],"meta":["July 2020","Project: AGENTES INTELIGENTES. MODELOS FORMALES Y APLICACIONES PARA LA EDUCACIÓN."],"references":["341126988_A_vision_of_K---_12_computer_science_education_for_2030","283922529_Learning_Styles_and_Disciplinary_Differences","241623893_CS_Unplugged_and_Middle-School_Students'_Views_Attitudes_and_Intentions_Regarding_CS","201381976_Learning_Styles_and_Learning_Spaces_Enhancing_Experiential_Learning_in_Higher_Education","345543433_Participatory_Design_for_Learning","337851516_Task-Specific_Programming_Languages_for_Promoting_Computing_Integration_A_Precalculus_Example","333306578_Investigacion-accion_participativa_una_metodologia_integradora_del_conocimiento_y_la_accion"]}