{"id":"343764832_Automatic_design_of_mechanical_metamaterial_actuators","abstract":"Mechanical metamaterial actuators achieve pre-determined input–output operations exploiting architectural features encoded within a single 3D printed element, thus removing the need for assembling different structural components. Despite the rapid progress in the field, there is still a need for efficient strategies to optimize metamaterial design for a variety of functions. We present a computational method for the automatic design of mechanical metamaterial actuators that combines a reinforced Monte Carlo method with discrete element simulations. 3D printing of selected mechanical metamaterial actuators shows that the machine-generated structures can reach high efficiency, exceeding human-designed structures. We also show that it is possible to design efficient actuators by training a deep neural network which is then able to predict the efficiency from the image of a structure and to identify its functional regions. The elementary actuators devised here can be combined to produce metamaterial machines of arbitrary complexity for countless engineering applications. Efficient strategies to optimize metamaterial design for specific applications are urgently needed despite the rapid progress in this area. Here the authors propose a computational method combining an optimization algorithm with discrete element simulations for the automatic design of mechanical metamaterial actuators.","authors":["Silvia Bonfanti","Roberto Guerra","Francesc Font-Clos","Daniel Rayneau-Kirkhope"],"meta":["August 2020Nature Communications 11(1)","DOI:10.1038/s41467-020-17947-2"],"references":["344061464_Revealing_structure-function_relationships_in_functional_flow_networks_via_persistent_homology","337790006_Exploring_multistability_in_prismatic_metamaterials_through_local_actuation","335319874_Programming_shape_using_kirigami_tessellations","335307935_The_least_symmetric_crystallographic_derivative_of_the_developable_double_corrugation_surface_Computational_design_using_underlying_conic_and_cubic_curves","323617620_Programmable_Self-Locking_Origami_Mechanical_Metamaterials","331849146_Density_scaling_in_the_mechanics_of_a_disordered_mechanical_meta-material","331381488_Elasticity_and_Stability_of_Shape_Changing_Structures","329810963_Accelerated_Search_and_Design_of_Stretchable_Graphene_Kirigami_Using_Machine_Learning","328706801_Design_of_Mechanical_Metamaterials_via_Constrained_Bayesian_Optimization","326432003_Theoretical_search_for_heterogeneously_architected_2D_structures"]}