{"id":"343727274_Rice_Crop_Detection_Using_LSTM_Bi-LSTM_and_Machine_Learning_Models_from_Sentinel-1_Time_Series","abstract":"The Synthetic Aperture Radar (SAR) time series allows describing the rice phenological cycle by the backscattering time signature. Therefore, the advent of the Copernicus Sentinel-1 program expands studies of radar data (C-band) for rice monitoring at regional scales, due to the high temporal resolution and free data distribution. Recurrent Neural Network (RNN) model has reached state-of-the-art in the pattern recognition of time-sequenced data, obtaining a significant advantage at crop classification on the remote sensing images. One of the most used approaches in the RNN model is the Long Short-Term Memory (LSTM) model and its improvements, such as Bidirectional LSTM (Bi-LSTM). Bi-LSTM models are more effective as their output depends on the previous and the next segment, in contrast to the unidirectional LSTM models. The present research aims to map rice crops from Sentinel-1 time series (band C) using LSTM and Bi-LSTM models in West Rio Grande do Sul (Brazil). We compared the results with traditional Machine Learning techniques: Support Vector Machines (SVM), Random Forest (RF), k-Nearest Neighbors (k-NN), and Normal Bayes (NB). The developed methodology can be subdivided into the following steps: (a) acquisition of the Sentinel time series over two years; (b) data pre-processing and minimizing noise from 3D spatial-temporal filters and smoothing with Savitzky-Golay filter; (c) time series classification procedures; (d) accuracy analysis and comparison among the methods. The results show high overall accuracy and Kappa (>97% for all methods and metrics). Bi-LSTM was the best model, presenting statistical differences in the McNemar test with a significance of 0.05. However, LSTM and Traditional Machine Learning models also achieved high accuracy values. The study establishes an adequate methodology for mapping the rice crops in West Rio Grande do Sul.","authors":["Hugo Crisóstomo de Castro Filho","Osmar Abilio de Carvalho Júnior","Osmar Luiz Ferreira de Carvalho","Pablo Pozzobon de Bem"],"meta":["August 2020Remote Sensing 12(16):2655","DOI:10.3390/rs12162655"],"references":["341512810_Mapping_Paddy_Fields_in_Japan_by_Using_a_Sentinel-1_SAR_Time_Series_Supplemented_by_Sentinel-2_Images_on_Google_Earth_Engine","339402943_A_computationally_efficient_BiLSTM_based_approach_for_the_binary_sentiment_classification","336934637_Deep_Learning_for_Generic_Object_Detection_A_Survey","335001157_remote_sensing_Mapping_Irrigated_Areas_Using_Sentinel-1_Time_Series_in_Catalonia_Spain","334439496_Evaluation_and_Comparison_of_Random_Forest_and_A-LSTM_Networks_for_Large-scale_Winter_Wheat_Identification","334380572_Long_Time_Series_Land_Cover_Classification_in_China_from_1982_to_2015_Based_on_Bi-LSTM_Deep_Learning","333695202_Sentinel-1_GRD_Preprocessing_Workflow","332935091_Geo-Information_Monitoring_and_Mapping_of_Rice_Cropping_Pattern_in_Flooding_Area_in_the_Vietnamese_Mekong_Delta_Using_Sentinel-1A_Data_A_Case_of_An_Giang_Province","332718482_Deep_learning_in_remote_sensing_applications_A_meta-analysis_and_review","334022864_Long-short-term-memory-based_crop_classification_using_high-resolution_optical_images_and_multi-temporal_SAR_data"]}