{"id":"343760121_Interdisciplinary_Doctoral_Training_in_Technology-Enhanced_Learning_in_Europe","abstract":"Technology enhanced learning (TEL) research connects Learning Sciences, Educational Psychology, and Computer Science, in order to investigate interventions based on digital technologies in education and training settings. In this paper, we argue that doctoral training activity for TEL needs to be situated at the intersection of disciplines in order to facilitate innovation. For this, we first review the state of disciplinarity in TEL, reviewing existing meta-studies of the field. Then, we survey 35 doctoral education programs in Europe in which doctoral students working on TEL topics are enrolled. Findings indicate that most doctoral schools are associated with a single discipline and offer methodological rather than content-specific modules. TEL-specific content is provided only in exceptional cases, creating a potentially isolating gap between master-level education and scientific conferences. On this background, we argue that cross-institutional doctoral training is important to progress TEL as a field. In this article, we study and share the approach of an international doctoral summer school organized by the European society EA-TEL over the past 15 years. The summer school provides foundational methodological knowledge from multiple disciplines, content-specific topical knowledge in TEL, access to cutting edge scientific discourse, and discussion of horizontal issues to doctoral students. We further provide an analysis of shifting program topics over time. Our analysis of both, institutional as well as cross-institutional doctoral training in TEL, constitutes this paper's core contribution in that it highlights that further integration of perspectives and knowledge is to be done in TEL; together with codification and explication of knowledge in the intersection of disciplines.","authors":["Viktoria Pammer","Fridolin Wild","Mikhail Fominykh","Tobias Ley"],"meta":["August 2020Frontiers in Education 5:150","DOI:10.3389/feduc.2020.00150","Project: Doctoral Education for Technology-Enhanced Learning - DE-TEL"],"references":["338237169_How_working_memory_capacity_limits_success_in_self-directed_learning_a_cognitive_model_of_search_and_concept_formation","336969692_Real-Time_Auditory_Biofeedback_System_for_Learning_a_Novel_Arm_Trajectory_A_Usability_Study","335698860_WEKITOne_A_Sensor-Based_Augmented_Reality_System_for_Experience_Capture_and_Re-enactment","335027338_A_Knowledge_Appropriation_Model_to_Connect_Scaffolded_Learning_and_Knowledge_Maturation_in_Workplace_Learning_Settings","320678663_Gaining_insight_into_interdisciplinary_research_and_education_programmes_A_framework_for_evaluation","336969599_Introduction_to_Wearable_Enhanced_Learning_WELL_Trends_Opportunities_and_Challenges","325249988_The_implied_PhD_student_of_interdisciplinary_research_projects_within_monodisciplinary_structures","324937048_The_Structure_of_Scientific_Revolutions","319424148_Epistemic_Fluency_and_Professional_Education","317953505_Situated_learning_Legitimate_peripheral_participation"]}