{"id":"343798751_Acoustics_of_the_Lascaux_cave_and_its_facsimile_Lascaux_IV","abstract":"Access to the original Lascaux cave, a UNESCO World Heritage site famous for its 18 000 year old paintings, has been restricted since 1963. In 2016, an accurate facsimile, Lascaux IV, was designed and built. In the original cave, Lascaux I, classical contemporary room acoustics measurement systems could not be used. However, it has been possible to perform simplified measurements in a few minutes. Similar measurements were made in Lascaux IV once completed. The data provide a unique insight of the acoustic behavior of the Lascaux cave: it shows that the two caves, the original and the copy, have similar acoustical characteristics. In both cases, in the famed Hall of Bulls, the impulse response is smooth, reverberation time is relatively long, and speech intelligibility is fair; this environment is suitable for the ceremonies that presumably took place there. Because of the precision of the copy, Lascaux IV could be used as a 1/1 scale-model of Lascaux I. Therefore, sophisticated acoustical tests could be undertaken in Lascaux IV to help specialists in their archeological investigations. For example, resonances could be precisely documented to explore the potential relationship between parietal painting positions and echoes or sound effects that may have been used in ritual ceremonies.","authors":["Daniel Commins","Yves Coppens","Takayuki Hidaka"],"meta":["August 2020The Journal of the Acoustical Society of America 148(2):918-924","DOI:10.1121/10.0001724"],"references":["329934317_On_the_sound_dimension_of_paleolithic_painted_caves","329659557_Archaeoacoustics_Re-Sounding_Material_Culture","319059448_Cave_acoustics_in_prehistory_Exploring_the_association_of_Palaeolithic_visual_motifs_and_acoustic_response","240983602_La_dimension_sonore_des_grottes_ornees","220414470_Extra-personal_awareness_through_the_media-rich_environment","290830228_Sound_reflection_as_an_explanation_for_the_content_and_context_of_rock_art","275987490_Four_Hundred_Centuries_of_Cave_Art","247231861_Prehistoric_Painting_Lascaux_or_the_Birth_of_Art","243350802_A_simple_impulse_sound_source_for_measurements_in_room_acoustics"]}