{"id":"343700261_A_new_hybrid_approach_based_on_discrete_differential_evolution_algorithm_to_enhancement_solutions_of_quadratic_assignment_problem","abstract":"The Combinatorial Optimization Problem (COPs) is one of the branches of applied mathematics and computer sciences, which is accompanied by many problems such as Facility Layout Problem (FLP), Vehicle Routing Problem (VRP), etc. Even though the use of several mathematical formulations is employed for FLP, Quadratic Assignment Problem (QAP) is one of the most commonly used. One of the major problems of the Combinatorial NP-hard Optimization problem is QAP mathematical model. Consequently, many approaches have been introduced to solve this problem, and these approaches are classified as Approximate and Exact methods. With\nQAP, each facility is allocated to just one location, thereby reducing cost in terms of aggregate distances weighted by flow values. The primary aim of this study is to propose a hybrid approach that combines the Discrete Differential Evolution (DDE) algorithm and Tabu Search (TS) algorithm to enhance solutions of the QAP model, to reduce the distances between the locations by finding the best distribution of N facilities to N locations, and implementing a hybrid approach based on discrete differential evolution (HDDETS) on many instances of QAP from the benchmark. The performance of the proposed approach has been tested on several sets of instances from the data set of QAP and the results obtained have shown the effective performance of the proposed algorithm in improving several solutions of QAP in a reasonable time.\nAfterward, the proposed approach is compared with other recent methods in the literature review. Based on the computation results, the proposed hybrid approach outperforms the other\nmethods.","authors":["Asaad Shakir Hameed","Mohd Aboobaider Burhanuddin","Modhi Lafta Mutar","Hea Choon Ngo"],"meta":["January 2020International Journal of Industrial Engineering Computations","DOI:10.5267/j.ijiec.2019.6.005"],"references":["331512605_Firefly_algorithm_based_upon_slicing_structure_encoding_for_unequal_facility_layout_problem","325874990_A_comprehensive_review_of_quadratic_assignment_problem_variants_hybrids_and_applications","325222004_Development_of_modified_discrete_particle_swarm_optimization_algorithm_for_quadratic_assignment_problems","322275354_A_hybrid_algorithm_combining_lexisearch_and_genetic_algorithms_for_the_quadratic_assignment_problem","314302358_Incorporating_a_modified_uniform_crossover_and_2-exchange_neighborhood_mechanism_in_a_discrete_bat_algorithm_to_solve_the_quadratic_assignment_problem","327607697_Integrating_the_whale_algorithm_with_Tabu_search_for_quadratic_assignment_problem_A_new_approach_for_locating_hospital_departments","325216588_Bi-objective_dependent_location_quadratic_assignment_problem_Formulation_and_solution_using_a_modified_artificial_bee_colony_algorithm","323993964_Facility_layout_problem_with_QAP_formulation_under_scenario-based_uncertainty","322728587_Performance_Analysis_of_ACO_on_the_Quadratic_Assignment_Problem","318356051_Elite_opposition-flower_pollination_algorithm_for_quadratic_assignment_problem"]}