{"id":"343780113_Education_and_Digital_Transformation_The_Riconnessioni_Project","abstract":"Schools, universities, and other educational entities are increasingly aware of the untapped potential of digital transformation, an essential process for increasing efficiency and collaboration, and reducing costs and errors in the management of at-scale training systems. In this context, the “Riconnessioni” project was promoted by the Compagnia di San Paolo in agreement with the Ministry of Education but planned, started and developed by the Foundation for the School. The digital transformation started with a defined strategy that leveraged opportunities presented by new technology while meeting the objectives of system stakeholders. Through several steps, that strategy was developed for education connecting everything to support tomorrow’s digital world and creating strong strategic partnerships able to build an ecosystem connecting people, processes, and things into a powerful, secure, and smart communications network. This paper reports on the three-year Riconnessioni project, which is combining the energies of teachers, managers, administrative staff, students, among others, and experimenting with new learning models, taking advantage of opportunities that emerged from perceptions stemming from concerns and systemic issues. To date, more than 150 schools in Italy have been included in the project, together with 550 teachers selected to scale up the instructional process. Using a methodology called “cascade training”, the 550 selected teachers were able to spread the knowledge to more than 2,600 colleagues. The monitoring and evaluation activity performed in Riconnessioni aims at processing information on implementation and results, following three lines. First, it regularly evaluates project activities from a reporting standpoint. Second, it verifies the plan consistency against implementation achievements. Third, it identifies changes produced and focuses on teachers’ and students’ skills to evaluate the effects of the project. The assessment framework is also discussed in this work, reporting on results regarding feedback, follow-up, and effects gathered from the field. The evaluation highlighted that labs were indeed able to improve teachers' competence and underlined the added value of cascade training which spread digital domain knowledge and awareness into the group of involved schools.","authors":["Claudio Demartini","Lorenzo Benussi","Valentina Gatteschi","Flavio Renga"],"meta":["August 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3018189"],"references":["335633343_Immersive_Virtual_Reality-Based_Interfaces_for_Character_Animation","322089442_Linked_Data_in_Education_A_Survey_and_a_Synthesis_of_Actual_Research_and_Future_Challenges","330720293_Do_we_really_need_computational_thinking","330631977_The_Future_of_Teaching_-_What_are_Students_Expectations","328992724_Teachers_Training_Micro-Learning_Innovative_Model_Opportunities_and_Challenges","328608127_Design_of_Innovative_Experiment_Platform_for_Network_Courses_of_Modern_Educational_Technology_Based_on_Virtual_Reality","323715916_Future_Classroom_Design_of_Teaching_from_the_Perspective_of_Educational_Technology","320665067_Computer_science_teacher_training","320592188_Governing_Education_in_a_Complex_World","318690312_Integration_of_the_future_technologies_to_high_schools_and_colleges","315933594_A_Holistic_Approach_to_Transforming_Undergraduate_Electrical_Engineering_Education","312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","316899954_Advances_in_Learning_Technologies","313450346_Life-Cycle_Efficacy_for_Educational_Technology_Best-Practices_for_Leading_Schools","311620751_Point_Cloud-Based_Automatic_Assessment_of_3D_Computer_Animation_Courseworks"]}