{"id":"343784275_Spatial_and_temporal_regularization_to_estimate_COVID-19_reproduction_number_Rt_Promoting_piecewise_smoothness_via_convex_optimization","abstract":"Among the different indicators that quantify the spread of an epidemic such as the on-going COVID-19, stands first the reproduction number which measures how many people can be contaminated by an infected person. In order to permit the monitoring of the evolution of this number, a new estimation procedure is proposed here, assuming a well-accepted model for current incidence data, based on past observations. The novelty of the proposed approach is twofold: 1) the estimation of the reproduction number is achieved by convex optimization within a proximal-based inverse problem formulation, with constraints aimed at promoting piecewise smoothness; 2) the approach is developed in a multivariate setting, allowing for the simultaneous handling of multiple time series attached to different geographical regions, together with a spatial (graph-based) regularization of their evolutions in time. The effectiveness of the approach is first supported by simulations, and two main applications to real COVID-19 data are then discussed. The first one refers to the comparative evolution of the reproduction number for a number of countries, while the second one focuses on French departments and their joint analysis, leading to dynamic maps revealing the temporal co-evolution of their reproduction numbers.","authors":["Patrice Abry","Nelly Pustelnik","Stéphane Roux","Pablo Jensen"],"meta":["August 2020PLoS ONE 15(8):e0237901","DOI:10.1371/journal.pone.0237901"],"references":["351971240_Automated_Data-Driven_Selection_of_the_Hyperparameters_for_Total-Variation-Based_Texture_Segmentation","343307408_Impact_of_lockdown_on_COVID-19_epidemic_in_Ile-de-France_and_possible_exit_strategies","341366767_Estimating_the_burden_of_SARS-CoV-2_in_France","335417721_Improved_inference_of_time-varying_reproduction_numbers_during_infectious_disease_outbreaks","329113150_Measurability_of_the_epidemic_reproduction_number_in_data-driven_contact_networks","343142833_Pooling_Data_from_Individual_Clinical_Trials_in_the_COVID-19_Era","340804251_Factors_determining_the_diffusion_of_COVID-19_and_suggested_strategy_to_prevent_future_accelerated_viral_infectivity_similar_to_COVID","336431434_Mathematical_Models_in_Epidemiology","335488264_Nonlinear_denoising_for_characterization_of_solid_friction_under_low_confinement_pressure","329575937_Equivalence_of_the_Erlang-Distributed_SEIR_Epidemic_Model_and_the_Renewal_Equation"]}