{"id":"343740650_Machine_learning_enables_completely_automatic_tuning_of_a_quantum_device_faster_than_human_experts","abstract":"Variability is a problem for the scalability of semiconductor quantum devices. The parameter space is large, and the operating range is small. Our statistical tuning algorithm searches for specific electron transport features in gate-defined quantum dot devices with a gate voltage space of up to eight dimensions. Starting from the full range of each gate voltage, our machine learning algorithm can tune each device to optimal performance in a median time of under 70 minutes. This performance surpassed our best human benchmark (although both human and machine performance can be improved). The algorithm is approximately 180 times faster than an automated random search of the parameter space, and is suitable for different material systems and device architectures. Our results yield a quantitative measurement of device variability, from one device to another and after thermal cycling. Our machine learning algorithm can be extended to higher dimensions and other technologies. To optimize operating conditions of large scale semiconductor quantum devices, a large parameter space has to be explored. Here, the authors report a machine learning algorithm to navigate the entire parameter space of gate-defined quantum dot devices, showing about 180 times faster than a pure random search.","authors":["Hyungil Moon","Dominic Lennon","J. Kirkpatrick","Nina van Esbroeck"],"meta":["August 2020Nature Communications 11(1):4161","DOI:10.1038/s41467-020-17835-9"],"references":["337116767_Efficiently_measuring_a_quantum_device_using_machine_learning","332583404_Loading_a_quantum-dot_based_Qubyte_register","326434706_Automated_tuning_of_inter-dot_tunnel_coupling_in_double_quantum_dots","324167327_Spectroscopy_of_Quantum-Dot_Orbitals_with_In-Plane_Magnetic_Fields","341259889_Automated_Tuning_of_Double_Quantum_Dots_into_Specific_Charge_States_Using_Neural_Networks","341145359_Autonomous_Tuning_and_Charge-State_Detection_of_Gate-Defined_Quantum_Dots","340329710_Autotuning_of_Double-Dot_Devices_In_Situ_with_Machine_Learning","335711051_Computer-automated_tuning_procedures_for_semiconductor_quantum_dot_arrays","332163896_A_machine_learning_approach_for_automated_fine-tuning_of_semiconductor_spin_qubits","329650090_Gaussian_Processes_for_Machine_Learning"]}