{"id":"343718462_Research_and_Application_of_Knowledge_Graph_in_Teaching_Take_the_database_course_as_an_example","abstract":"With the rapid development of technologies such as artificial intelligence and deep learning, education informatization has entered the 2.0 era with artificial intelligence as the main feature. As an important part of artificial intelligence technology, knowledge graph provides possibilities for smart education and promotes the innovation and development of smart education. At this stage, the core concepts and knowledge systems of some computer science disciplines need further clarification and improvement. Using a large amount of course-related information to construct an educational knowledge graph, processing and analyzing the knowledge points in the course, extracting the knowledge entities and effectively integrating them, can greatly help to clarify the knowledge system of the subject. The improvement of the teaching quality of this subject is of great significance. Therefore, this paper selects the construction of educational knowledge graph as research content, and uses database courses as examples of graph construction for research. The BIO tagging method is used to construct the database subject dataset, at the same time, it builds knowledge card based on educational knowledge graph to achieve database teaching wisdom, systematic teaching content, integration of knowledge fragments and improve the quality of learning.","authors":["Yuehua Qin","Han Cao","Leyi Xue"],"meta":["August 2020Journal of Physics Conference Series 1607(1):012127","DOI:10.1088/1742-6596/1607/1/012127"],"references":["325532104_Clinical_Named_Entity_Recognition_Using_Deep_Learning_Models","355300787_Research_on_Knowledge_Graph_Data_Management_A_Survey","352389769_QAM_Question_Answering_System_Based_on_Knowledge_Graph_in_the_Military","332718066_The_State_of_the_Art_and_Future_Tendency_of_Smart_Education","318741130_Semi-supervised_sequence_tagging_with_bidirectional_language_models","316617797_Semi-supervised_sequence_tagging_with_bidirectional_language_models","313073822_DBpedia_A_large-scale_multilingual_knowledge_base_extracted_from_wikipedia","285270985_Named_entity_recognition_with_bidirectional_LSTM-SNNs","280081029_Wikidata_A_Free_Collaborative_Knowledgebase","268526207_Applications_of_Mobile_Social_Media_WeChat_Among_Academic_Libraries_in_China"]}