{"id":"3437480_Humans_in_the_loop_Human-computer_interaction_and_security","abstract":"The security field suffers from an endemic problem: despite our best efforts, the current infrastructure is continually full of security vulnerabilities. The systems that comprise this infrastructure also are full of boundaries and interfaces where humans and systems must interact: most secure systems exist to serve human users and carry out human-oriented processes, and are designed and built by humans. From the perspective of the human-computer interaction (HCO community), many of these interfaces do not reflect good thinking on how to make them easy to use in a manner that results in security. From the perspective of the security community, many widespread security problems arguably might stem from bad interaction between humans and systems. I recently attended a workshop (ACM/CHI 2003 Workshop on Human-Computer Interaction and Security Systems) that tried to bring together these communities to trigger further inquiry into this area. In this article, I want to discuss the workshop and how the thinking there applies to the secure systems topic this department addresses.","authors":["Sean Smith"],"meta":["June 2003IEEE Security and Privacy Magazine 1(3):75 - 79","DOI:10.1109/MSECP.2003.1203228","SourceIEEE Xplore"],"references":["238731788_Users_are_not_the_enemy_Why_users_compromise_security_mechanisms_and_how_to_take_remedial_measures","220427273_Users_Are_Not_the_Enemy","270819200_The_Design_of_Everyday_Things","247958271_The_psychology_of_everyday_things_Basic_Books_Inc","221521440_Digital_Signatures_and_Electronic_Documents_A_Cautionary_Tale","221260504_Trusted_Paths_for_Browsers","220689870_Network_Security_Private_Communication_in_A_Public_World","2994185_The_Protection_of_Information_in_Computer_Systems","2911828_Keyjacking_Risks_of_the_Current_Client-side_Infrastructure","2870036_User_Interaction_Design_for_Secure_Systems","2591499_Why_Johnny_Can't_Encrypt_A_Usability_Evaluation_of_PGP_50"]}