{"id":"343705931_Building_Information_Modelling_BIM_and_the_Internet-of-Things_IoT_A_Systematic_Mapping_Study","abstract":"Of recent, Building Information Modelling (BIM) has become an influential paradigm for the development of better project delivery practices to improve construction and operational efficiencies. In the last 6 years, a significant number of studies have been published on the integration of BIM in Internet of Things (IoT). This paper aims to examine the general research productivity, demographics, and trends shaping the research domain. Hence, the paper will also help to identify, categorize, and synthesize important studies in the research domain. In doing so, we adopt an evidence-based systematic mapping methodology to ensure the coverage of key studies through a systematic and unbiased selection and evaluation process which results in the final selection of 55 relevant studies. The results of the mapping study show that the research on the integration of BIM in IoT is gaining more attention in last 6 years with stable and consistent publication output. Prominent application domains, validation methods, contribution facets, research types, and simulation tools in the field of study were identified and presented. Five research types were also identified, i.e. solution proposal, experience paper, evaluation research, validation research, and opinion paper, with solution proposals getting more research attention. In general, the overall demographics of the research domain were presented and discussed.","authors":["Baydaa Hashim","Nurhizam Safie Mohd Satar","Hasimi Sallehudin"],"meta":["August 2020IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2020.3016919"],"references":["337430026_Application_of_Integrated_Building_Information_Modeling_IoT_and_Blockchain_Technologies_in_System_Design_of_a_Smart_Building","335551080_Intelligent_manufacturing_model_of_construction_industry_based_on_Internet_of_Things_technology","335370804_Matching_Real-World_Facilities_to_Building_Information_Modeling_Data_Using_Natural_Language_Processing","341297762_BIM_and_Semantic_Web-Based_Maintenance_Information_for_Existing_Buildings","339677787_Exploring_Adoption_of_Integrated_Building_Information_Modelling_and_Virtual_Reality","339380804_Developing_a_building_information_modeling-based_performance_management_system_for_public-private_partnerships","339145535_Integrating_and_managing_BIM_in_3D_web-based_GIS_for_hydraulic_and_hydropower_engineering_projects","338240232_A_scan_to_as-built_building_information_modeling_workflow_a_case_study_in_Malaysia","337926514_BIM_assisted_Building_Automation_System_information_exchange_using_BACnet_and_IFC","333886327_Evaluating_critical_success_factors_for_implementing_smart_devices_in_the_construction_industry_An_empirical_study_in_the_Dominican_Republic"]}