{"id":"343726571_Digital_contact_tracing_technologies_in_epidemics_a_rapid_review","abstract":"Background: \nReducing the transmission of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is a global priority. Contact tracing identifies people who were recently in contact with an infected individual, in order to isolate them and reduce further transmission. Digital technology could be implemented to augment and accelerate manual contact tracing. Digital tools for contact tracing may be grouped into three areas: 1) outbreak response; 2) proximity tracing; and 3) symptom tracking. We conducted a rapid review on the effectiveness of digital solutions to contact tracing during infectious disease outbreaks.\n\nObjectives: \nTo assess the benefits, harms, and acceptability of personal digital contact tracing solutions for identifying contacts of an identified positive case of an infectious disease.\n\nSearch methods: \nAn information specialist searched the literature from 1 January 2000 to 5 May 2020 in CENTRAL, MEDLINE, and Embase. Additionally, we screened the Cochrane COVID-19 Study Register.\n\nSelection criteria: \nWe included randomised controlled trials (RCTs), cluster-RCTs, quasi-RCTs, cohort studies, cross-sectional studies and modelling studies, in general populations. We preferentially included studies of contact tracing during infectious disease outbreaks (including COVID-19, Ebola, tuberculosis, severe acute respiratory syndrome virus, and Middle East respiratory syndrome) as direct evidence, but considered comparative studies of contact tracing outside an outbreak as indirect evidence. The digital solutions varied but typically included software (or firmware) for users to install on their devices or to be uploaded to devices provided by governments or third parties. Control measures included traditional or manual contact tracing, self-reported diaries and surveys, interviews, other standard methods for determining close contacts, and other technologies compared to digital solutions (e.g. electronic medical records).\n\nData collection and analysis: \nTwo review authors independently screened records and all potentially relevant full-text publications. One review author extracted data for 50% of the included studies, another extracted data for the remaining 50%; the second review author checked all the extracted data. One review author assessed quality of included studies and a second checked the assessments. Our outcomes were identification of secondary cases and close contacts, time to complete contact tracing, acceptability and accessibility issues, privacy and safety concerns, and any other ethical issue identified. Though modelling studies will predict estimates of the effects of different contact tracing solutions on outcomes of interest, cohort studies provide empirically measured estimates of the effects of different contact tracing solutions on outcomes of interest. We used GRADE-CERQual to describe certainty of evidence from qualitative data and GRADE for modelling and cohort studies.\n\nMain results: \nWe identified six cohort studies reporting quantitative data and six modelling studies reporting simulations of digital solutions for contact tracing. Two cohort studies also provided qualitative data. Three cohort studies looked at contact tracing during an outbreak, whilst three emulated an outbreak in non-outbreak settings (schools). Of the six modelling studies, four evaluated digital solutions for contact tracing in simulated COVID-19 scenarios, while two simulated close contacts in non-specific outbreak settings. Modelling studies Two modelling studies provided low-certainty evidence of a reduction in secondary cases using digital contact tracing (measured as average number of secondary cases per index case - effective reproductive number (R eff)). One study estimated an 18% reduction in R eff with digital contact tracing compared to self-isolation alone, and a 35% reduction with manual contact-tracing. Another found a reduction in R eff for digital contact tracing compared to self-isolation alone (26% reduction) and a reduction in R eff for manual contact tracing compared to self-isolation alone (53% reduction). However, the certainty of evidence was reduced by unclear specifications of their models, and assumptions about the effectiveness of manual contact tracing (assumed 95% to 100% of contacts traced), and the proportion of the population who would have the app (53%). Cohort studies Two cohort studies provided very low-certainty evidence of a benefit of digital over manual contact tracing. During an Ebola outbreak, contact tracers using an app found twice as many close contacts per case on average than those using paper forms. Similarly, after a pertussis outbreak in a US hospital, researchers found that radio-frequency identification identified 45 close contacts but searches of electronic medical records found 13. The certainty of evidence was reduced by concerns about imprecision, and serious risk of bias due to the inability of contact tracing study designs to identify the true number of close contacts. One cohort study provided very low-certainty evidence that an app could reduce the time to complete a set of close contacts. The certainty of evidence for this outcome was affected by imprecision and serious risk of bias. Contact tracing teams reported that digital data entry and management systems were faster to use than paper systems and possibly less prone to data loss. Two studies from lower- or middle-income countries, reported that contact tracing teams found digital systems simpler to use and generally preferred them over paper systems; they saved personnel time, reportedly improved accuracy with large data sets, and were easier to transport compared with paper forms. However, personnel faced increased costs and internet access problems with digital compared to paper systems. Devices in the cohort studies appeared to have privacy from contacts regarding the exposed or diagnosed users. However, there were risks of privacy breaches from snoopers if linkage attacks occurred, particularly for wearable devices.\n\nAuthors' conclusions: \nThe effectiveness of digital solutions is largely unproven as there are very few published data in real-world outbreak settings. Modelling studies provide low-certainty evidence of a reduction in secondary cases if digital contact tracing is used together with other public health measures such as self-isolation. Cohort studies provide very low-certainty evidence that digital contact tracing may produce more reliable counts of contacts and reduce time to complete contact tracing. Digital solutions may have equity implications for at-risk populations with poor internet access and poor access to digital technology. Stronger primary research on the effectiveness of contact tracing technologies is needed, including research into use of digital solutions in conjunction with manual systems, as digital solutions are unlikely to be used alone in real-world settings. Future studies should consider access to and acceptability of digital solutions, and the resultant impact on equity. Studies should also make acceptability and uptake a primary research question, as privacy concerns can prevent uptake and effectiveness of these technologies.","authors":["Andrew Anglemyer","Theresa HM Moore","Lisa Parker","Timothy Chambers"],"meta":["August 2020Cohrane Database of Systematic Reviews 2020(8)","DOI:10.1002/14651858.cd013699"],"references":["354221563_A_mathematical_assessment_of_the_efficiency_of_quarantining_and_contact_tracing_in_curbing_the_COVID-19_epidemic","343753054_Automated_and_partly_automated_contact_tracing_a_systematic_review_to_inform_the_control_of_COVID-19","343204808_Acceptability_of_app-based_contact_tracing_for_COVID-19_Cross-country_survey_evidence_Preprint","342413953_Efficacy_of_contact_tracing_for_the_containment_of_the_2019_novel_coronavirus_COVID-19","342225608_Effectiveness_of_isolation_testing_contact_tracing_and_physical_distancing_on_reducing_transmission_of_SARS-CoV-2_in_different_settings_a_mathematical_modelling_study","341064884_Containing_COVID-19_among_627386_Persons_Contacting_with_Diamond_Princess_Cruise_Ship_Passengers_Disembarked_in_Taiwan_Big_Data_Analytics_Preprint","340370519_Peer-to-Peer_Contact_Tracing_Development_of_a_Privacy-Preserving_Smartphone_App","340316786_Quantifying_SARS-CoV-2_transmission_suggests_epidemic_control_with_digital_contact_tracing","338862102_Digital_Health_Global_Goods_Maturity_Assessment_of_the_Surveillance_Outbreak_Response_Management_Analysis_System_SORMAS_Preprint","338635885_Synthesis_without_meta-analysis_SWiM_in_systematic_reviews_Reporting_guideline","335899136_Use_of_a_mobile_application_for_Ebola_contact_tracing_and_monitoring_in_northern_Sierra_Leone_A_proof-of-concept_study","328871247_Synthesising_quantitative_and_qualitative_evidence_to_inform_guidelines_on_complex_interventions_Clarifying_the_purposes_designs_and_outlining_some_methods","327270609_User_Evaluation_Indicates_High_Quality_of_the_Surveillance_Outbreak_Response_Management_and_Analysis_System_SORMAS_After_Field_Deployment_in_Nigeria_in_2015_and_2018","322708708_Applying_GRADE-CERQual_to_qualitative_evidence_synthesis_findings_Introduction_to_the_series","320098547_Contact_tracing_with_a_real-time_location_system_A_case_study_of_increasing_relative_effectiveness_in_an_emergency_department","309098187_ROBINS-I_A_tool_for_assessing_risk_of_bias_in_non-randomised_studies_of_interventions","301903388_Searching_for_qualitative_research_for_inclusion_in_systematic_reviews_A_structured_methodological_review","301562798_Estimates_of_Social_Contact_in_a_Middle_School_Based_on_Self-Report_and_Wireless_Sensor_Data","301330603_Epidemic_risk_from_friendship_network_data_An_equivalence_with_a_non-uniform_sampling_of_contact_networks","286208053_Preferred_Reporting_Items_for_Systematic_Reviews_and_Meta-Analyses_The_PRISMA_Statement","283783695_Introduction_of_Mobile_Health_Tools_to_Support_Ebola_Surveillance_and_Contact_Tracing_in_Guinea","283294286_Using_Qualitative_Evidence_in_Decision_Making_for_Health_and_Social_Interventions_An_Approach_to_Assess_Confidence_in_Findings_from_Qualitative_Evidence_Syntheses_GRADE-CERQual","278048090_Contact_Patterns_in_a_High_School_A_Comparison_between_Data_Collected_Using_Wearable_Sensors_Contact_Diaries_and_Friendship_Surveys","271536253_Chains_of_transmission_and_control_of_Ebola_virus_disease_in_Conakry_Guinea_in_2014_An_observational_study","262023914_Epidemic_Contact_Tracing_via_Communication_Traces","260681273_How_should_social_mixing_be_measured_Comparing_web-based_survey_and_sensor-based_methods","230879199_Dynamic_transmission_modeling_a_report_of_the_ISPOR-SMDM_Modeling_Good_Research_Practices_Task_Force_Working_Group-5","10580837_Measuring_Inconsistency_in_Meta-Analyses","354948973_GRADE_Guidelines_30_The_GRADE_Approach_to_Assessing_the_Certainty_of_Modelled_Evidence_-_an_Overview_in_the_Context_of_Health_Decision-making","349560372_Automated_contact_tracing_A_game_of_big_numbers_in_the_time_of_COVID-19","344374024_GRADE_Guidelines_30_The_GRADE_Approach_to_Assessing_the_Certainty_of_Modelled_Evidence_-_an_Overview_in_the_Context_of_Health_Decision-making","344372564_Quarantine_alone_or_in_combination_with_other_public_health_measures_to_control_COVID-19_a_rapid_review","343888779_Contact_Transmission_of_COVID-19_in_South_Korea_Novel_Investigation_Techniques_for_Tracing_Contacts","342063754_Acceptability_of_App-Based_Contact_Tracing_for_COVID-19_Cross-Country_Survey_Evidence","341644656_Belgium_-_concerns_about_coronavirus_contact-tracing_apps","341330850_Contact_Tracing_A_Game_of_Big_Numbers_in_the_Time_of_COVID-19","340705244_COVID-19_exacerbating_inequalities_in_the_US","340520263_Quarantine_alone_or_in_combination_with_other_public_health_measures_to_control_COVID-19_a_rapid_review","340143293_Effectiveness_of_Isolation_and_Contact_Tracing_for_Containment_and_Slowing_Down_a_COVID-19_Epidemic_A_Modelling_Study","335846164_Commercialization_of_User_Data_by_Developers_of_Medicines-Related_Apps_a_Content_Analysis","331931958_Data_sharing_practices_of_medicines_related_apps_and_the_mobile_ecosystem_Traffic_content_and_network_analysis","328978376_Feasibility_Acceptability_and_Adoption_of_Digital_Fingerprinting_During_Contact_Investigation_for_Tuberculosis_in_Kampala_Uganda_A_Parallel-Convergent_Mixed-Methods_Analysis","322608280_Using_Cell_Phone_Technology_to_Investigate_a_Deliberate_Bacillus_anthracis_Release_Scenario","309263283_Evaluation_of_a_Mobile_Health_Approach_to_Tuberculosis_Contact_Tracing_in_Botswana","301580764_Active_tuberculosis_case-finding_among_drug_users_and_homeless_persons_After_the_outbreak","271713728_Combining_High-Resolution_Contact_Data_with_Virological_Data_to_Investigate_Influenza_Transmission_in_a_Tertiary_Care_Hospital","255694084_A_mobile_health_approach_to_tuberculosis_contact_tracing_in_resource-limited_settings"]}