{"id":"343752204_Factors_and_Influences_on_High_School_Students'_Career_Choices","abstract":"Women continue to be disproportionately underrepresented in science and engineering fields. A model for career choice is proposed that includes both the direct and indirect effects that socializers can play in determining career choices. A sample of 2213 high school seniors from nine schools in Rhode Island were surveyed about their academic and career choices and the perceived influences on those choices. Parents and teachers were perceived to be influences on career choice more often for students (both men and women) choosing careers in engineering and science than for those not choosing such careers. Pay was a more important factor in career choice for men in general, and genuine interest was a more important factor for women not choosing careers in engineering or science. However, these gender differences do not appear among students with extremely strong mathematics and science coursework backgrounds, even though there remains a marked disparity in the proportion of men to women planning careers in engineering or science. Teachers may play a particularly important role in influencing the career choice of some of these women. Equity of access and encouragement in mathematics and science is certainly a necessary, but insufficient, condition for improving the representation of women in science and engineering.","authors":["Thomas P. Dick","Sharon F. Rallis"],"meta":["July 1991Journal for Research in Mathematics Education 22(4):281-292","DOI:10.5951/jresematheduc.22.4.0281"],"references":["233896803_Gender-Roles_and_Women's_Achievement","232495935_Sex_Differences_in_Math_Achievement_Toward_a_Model_of_Academic_Choice","297147148_Socialization_of_achievement_attitudes_and_beliefs_parental_influences","289963662_The_Psychology_of_Sex_Differences","240109775_Mathematics_and_the_Gender_Gap_A_Met-Analysis_of_Recent_Studies_on_Sex_Differences_in_Mathematical_Tasks","234596607_Math_and_Science_Education_in_High_Schools_A_Question_of_Sex_Equity","234565089_The_Forum_Mathematics--A_Critical_Filter","21016828_Gender_Differences_in_Mathematics_Performance_A_Meta-Analysis"]}