{"id":"343722686_State-of-the-Art_and_Comparative_Review_of_Adaptive_Sampling_Methods_for_Kriging","abstract":"Metamodels aim to approximate characteristics of functions or systems from the knowledge extracted on only a finite number of samples. In recent years kriging has emerged as a widely applied metamodeling technique for resource-intensive com-putational experiments. However its prediction quality is highly dependent on the size and distribution of the given training points. Hence, in order to build proficient kriging models with as few samples as possible adaptive sampling strategies have gained considerable attention. These techniques aim to find pertinent points in an iterative manner based on information extracted from the current metamodel. A review of adaptive schemes for kriging proposed in the literature is presented in this article. The objective is to provide the reader with an overview of the main principles of adaptive techniques, and insight-ful details to pertinently employ available tools depending on the application at hand. In this context commonly applied strategies are compared with regards to their characteristics and approximation capabilities. In light of these experiments, it is found that the success of a scheme depends on the features of a specific problem and the goal of the analysis. In order to facilitate the entry into adaptive sampling a guide is provided. All experiments described herein are replicable using a provided open source toolbox.","authors":["Jan Niklas Fuhg","Amélie Fau","Udo Nackenhorst"],"meta":["August 2020Archives of Computational Methods in Engineering 28(3)","DOI:10.1007/s11831-020-09474-6","Project: Adaptive metamodeling for parametric studies"],"references":["339005787_Extending_classical_surrogate_modelling_to_high_dimensions_through_supervised_dimensionality_reduction_a_data-driven_approach","336084753_Surrogate_model_approach_for_investigating_the_stability_of_a_friction-induced_oscillator_of_Duffing's_type","324713524_A_two-stage_support_vector_regression_assisted_sequential_sampling_approach_for_global_metamodeling","321784724_A_Taylor_Expansion-Based_Adaptive_Design_Strategy_for_Global_Surrogate_Modeling_With_Applications_in_Groundwater_Modeling","321475963_A_Model_Reduction_Technique_in_Space_and_Time_for_Fatigue_Simulation","321168878_A_comparison_of_six_metamodeling_techniques_applied_to_building_performance_simulations","319035484_Gradient-enhanced_kriging_for_high-dimensional_problems","318380861_An_adaptive_sampling_strategy_for_Kriging_metamodel_based_on_Delaunay_triangulation_and_TOPSIS","336409912_A_Model_Reduction_Technique_in_Space_and_Time_for_Fatigue_Simulation","324407775_Statistics_for_Spatial_Data"]}