{"id":"343723397_Conservative_management_of_abnormally_invasive_placenta_complicated_by_local_hyperfibrinolysis_and_beginning_disseminated_intravascular_coagulation","abstract":"IntroductionAbnormally invasive placenta (AIP) is often associated with high maternal morbidity. In surgical treatment, caesarean hysterectomy or partial uterine resection may lead to high perioperative maternal blood loss. A conservative treatment by leaving the placenta in utero after caesarean delivery of the baby is an option to preserve fertility and to reduce peripartum hysterectomy-related morbidity. Nevertheless, due to increased placental coagulation activity as well as consumption of clotting factors, a disseminated intravascular coagulation (DIC)-like state with secondary late postpartum bleeding can occur.PurposeSystematic review after the presentation of a case of conservative management of placenta percreta with secondary partial uterine wall resection due to vaginal bleeding, complicated by local hyperfibrinolysis and consecutive systemic decrease in fibrinogen levels.Methods\nSystematic PubMed database search was done until August 2019 without any restriction of publication date or journalResultsAmong 58 publications, a total of 11 reported on DIC-like symptoms in the conservative management of AIP, in the median on day 59 postpartum. In most cases, emergency hysterectomy was performed, which led to an almost immediate normalization of coagulation status but was accompanied with high maternal blood loss. In two cases, fertility-preserving conservative management could be continued after successful medical therapy.Conclusion\nBased on these results, we suggest routinely monitoring of the coagulation parameters next to signs of infection in the postpartum check-ups during conservative management of AIP. Postpartum tranexamic acid oral dosage should be discussed when fibrinogen levels are decreasing and D-Dimers are increasing.","authors":["C. Biele","Lutz Kaufner","Alexander Schwickert","A. Nonnenmacher"],"meta":["January 2021Archives of Gynecology and Obstetrics 303(Suppl 1)","DOI:10.1007/s00404-020-05721-0"],"references":["328241536_Short-term_and_long-term_effects_of_caesarean_section_on_the_health_of_women_and_children","322122553_Successful_anticoagulant_therapy_for_disseminated_intravascular_coagulation_during_conservative_management_of_placenta_percreta_A_case_report_and_literature_review","317220656_Maternal_outcome_after_conservative_management_of_abnormally_invasive_placenta","331525479_Evidence-based_guidelines_for_the_management_of_abnormally-invasive_placenta_AIP_recommendations_from_the_International_Society_for_AIP","327729411_Conservative_Management_of_Placenta_Accreta_Spectrum","325584441_Abnormally_invasive_placenta_AIP_Pre-cesarean_amnion_drainage_to_facilitate_exteriorization_of_the_gravid_uterus_through_a_transverse_skin_incision","325159484_Delayed_disseminated_intravascular_coagulation_revealed_by_spontaneous_hematomas_after_conservative_treatment_of_placenta_percreta","322971318_FIGO_consensus_guidelines_on_placenta_accreta_spectrum_disorders_Conservative_management","317867914_Disseminated_intravascular_coagulation_syndrome_two_months_after_conservative_management_of_placenta_accreta_About_two_patients","314224538_Disseminated_intravascular_coagulation_in_pregnancy_-_Clinical_phenotypes_and_diagnostic_scores"]}