{"id":"343703186_Jatai_ACM_SIGCSE_Chapter_Um_espaco_de_formacao_na_educacao_em_Computacao","abstract":"p>A Association for Computing Machinery (ACM) é a maior sociedade educacional e científica do mundo, possuindo membros profissionais e estudantes por todo o mundo. Uma das formas de a ACM materializar o seu propósito é por meio dos Grupos de Interesse Especial. O Special Interest Group on Computer Science Education (SIGCSE) é um dos Grupos de Interesse Especial mais antigos da ACM, focado especificamente na Educação em Computação. Ao redor do mundo, os principais objetivos dos capítulos locais do SIGCSE são: (i) promover o desejo de participar dos eventos do SIGCSE em uma determinada região; (ii) compartilhar ideias e problemas com colegas mais de uma vez ao ano; e (iii) ter uma organização local que encoraja boas práticas na Educação em Computação em universidades, escolas, empresas e organizações. Este trabalho apresenta um relato de experiência, no ano de 2018, sobre o Jataí ACM SIGCSE Chapter , o único capítulo da SIGCSE na América Latina. São apresentados o seu histórico, as suas parcerias e os resultados acadêmicos visíveis oriundos, direta ou indiretamente, da existência do capítulo na região. Constata-se que os objetivos supracitados foram satisfatoriamente alcançados no período mencionado.\n\nPalavras-chave: Educação. Computação. Formação.</p","authors":["Criscilla M. C. Rezende","Esdras Lins Bispo Jr."],"meta":["April 2020","DOI:10.47236/2594-7036.2020.v4.i2.139-150p"],"references":["334854048_Comparison_between_Pseudocode_Usage_and_Visual_Programming_with_Scratch_in_Programming_Teaching","332232765_Uso_da_Linguagem_Scratch_no_Ensino_para_Licenciandos_em_Fisica","326047190_Comparison_between_the_use_of_pseudocode_and_visual_programming_in_programming_teaching_An_evaluation_from_scratch_tool","321609171_Ensino_de_Demonstracao_por_Inducao_em_Teoria_dos_Grafos_utilizando_um_Ambiente_Visual_de_Algoritmos","271159062_Instrucao_pelos_colegas_e_ensino_sob_medida_uma_proposta_para_o_engajamento_dos_alunos_no_processo_de_ensino-aprendizagem_de_Fisica","321662444_Impact_of_Pre-University_Factors_on_the_Motivation_and_Performance_of_Undergraduate_Students_in_Software_Engineering","259079299_The_Action_Research_Planner_Doing_Critical_Participatory_Action_Research","259079298_Changing_Practices_Changing_Education","245175324_Action_Research_for_Educational_Change"]}