{"id":"343766279_Case-Based_Reasoning_untuk_Diagnosa_Penyakit_THT_Telinga_Hidung_dan_Tenggorokan","abstract":"AbstrakCase-Based Reasoning (CBR) merupakan sistem penalaran komputer yang menggunakan pengetahuan lama untuk mengatasi masalah baru.CBR memberikan solusi terhadap kasus baru dengan melihat kasus lama yang paling mendekati kasus baru. Hal ini akan sangat bermanfaat karena dapat menghilangkan kebutuhan untuk mengekstrak model seperti yang dibutuhkan oleh sistem berbasis aturan. Penelitian ini mencoba untuk membangun suatu sistem Penalaran Berbasis Kasus untuk melakukan diagnosa penyakit THT (Telinga, Hidung dan Tenggorokan). Proses diagnosa dilakukan dengan cara memasukkan kasus baru (target case) yang berisi gejala-gejala ang akan didiagnosa ke dalam sistem, kemudian sistem akan melakukan proses indexing dengan metode backpropagation untuk memperoleh indeks dari kasus baru tersebut. Setelah memperoleh indeks, sistem selanjutnya melakukan proses perhitungan nilai similarity antara kasus baru dengan basis kasus yang memiliki indeks yang sama menggunakan metode cosine coefficient. Kasus yang diambil adalah kasus dengan nilai similarity paling tinggi. Jika suatu kasus tidak berhasil didiagnosa, maka akan dilakukan revisi kasus oleh pakar. Kasus yang berhasil direvisi akan disimpan ke dalam sistem untuk dijadikan pengetahuan baru bagi sistem. Hasil penelitian menunjukkan sistem penalaran berbasis kasus untuk mendiagnosa penyakit THT ini membantu paramedis dalam melakukan diagnosa. Hasil uji coba sistem terhadap 111 data kasus uji, terdapat 9 kasus yang memiliki nilai similarity di bawah 0.8. Kata kunci—case-based reasoning, indexing, similarity, backpropagation, cosine coefficient Abstract Case-Based Reasoning (CBR) is a reasoning system that uses old knowledge to solve new problem. CBR provides solutions to new cases by looking at old case that comes closest to the new case. It will be very useful because it eliminates the need to extract the model as required by the rule-based systems. This studytriestoestablisha system forCBR for diagnosingdiseasesof ENT.Diagnosisprocessis done byinsertinga new casethat containsthe symptoms ofthe disease to bediagnosed, thenthe system willdo theindexingprocess with backpropagation method toobtainan indexofnewcases. Afterthat, the systemdo thecalculation of the valueof similaritybetweenthe newcasebycasebasiswhichhas thesame indexwithnew cases using cosine coefficient method. The casetaken isthe casewiththe highestsimilarityvalue. If acaseis not successfullydiagnosed, thecasewillbe revisedby theexperts and it can be used asnew knowledgefor thesystem. The results showedcase-basedreasoningsystemtodiagnosediseasesof ENTcan helpparamedicsin performingdiagnostics. The test results of 111 data test cases, obtained 9 cases that have similarity values below 0.8. Keywords—case-based reasoning, indexing, similarity, backpropagation, cosine coefficient","authors":["Tedy Rismawan","Sri Hartati"],"meta":["July 2013","DOI:10.22146/ijccs.2154"],"references":[]}