{"id":"343787739_Evolution_Toward_Artificial_Intelligence_of_Things_Under_6G_Ubiquitous-X","abstract":"With the evolution of cellular networks, 6G is a promising technology to provide ubiquity of communications, computing, control, and consciousness (UC⁴) for \"human-machine-thing-genie\" and build a ubiquitous intelligent mobile society. Genie, which can act as the artificial intelligence assistance for 6G users, is the key enabler to realize the unprecedented transformation from mobile Internet to network of intelligence. While Internet of Things (IoT) is the digital nervous system, genie acts like the brain of the overall system. Supported by 6G, IoT will step into the Artificial Intelligence of Things (AIoT) era and the AIoT networks have the abilities of intelligent perception, intelligent analysis, and intelligent control. In this paper, the concept of Ubiquitous-X is introduced, which is considered as the fundamental architecture of 6G network, and the definition and architecture of AIoT under Ubiquitous-X is also presented. Several major technical challenges posed by the service requirements of novel AIoT applications are pinpointed, including massive and intelligent connectivity, efficient computing, security, privacy, authentication, high scalability and efficiency. Potential enabling technologies to support seamless service experiences across terminals to realize AIoT are introduced as well. © 2020, The Editorial Department of Journal of Harbin Institute of Technology. All right reserved.","authors":["P. Zhang","X. Xu","X. Qin","Y. Liu"],"meta":["June 2020Journal of Harbin Institute of Technology (New Series) 27(3):116-135","DOI:10.11916/j.issn.1005-9113.20036"],"references":["334778653_A_Novel_Design_Approach_for_5G_Massive_MIMO_and_NB-IoT_Green_Networks_Using_a_Hybrid_Jaya-Differential_Evolution_Algorithm","333009003_DQN_Inspired_Joint_Computing_and_Caching_Resource_Allocation_Approach_for_Software_Defined_Information-Centric_Internet_of_Things_Network"]}