{"id":"343716998_Distance-two_colourings_of_Barnette_graphs","abstract":"Barnette identified two interesting classes of cubic polyhedral graphs for which he conjectured the existence of a Hamiltonian cycle. We examine these classes from the point of view of distance-two colourings. A distance-two r-colouring of a graph G is an assignment of r colours to the vertices of G so that any two vertices at distance at most two have different colours. A cubic graph obviously needs at least four colours, and the distance-two four-colouring problem for cubic planar graphs is known to be NP-complete. We prove the problem remains NP-complete for tri-connected bipartite cubic planar graphs, which we call type-one Barnette graphs, since they are the first class identified by Barnette. By contrast, we show that the problem is polynomial for cubic plane graphs with face sizes 3,4,5, or 6, which we call type-two Barnette graphs, because of their relation to Barnette’s second conjecture. In fact, the colourable instances that are bipartite can be fully described, and those that are non-bipartite can be characterized by their face sizes. We have similar results for quartic plane graphs: the analogue of type-two Barnette graphs are graphs with face sizes 3 or 4. For this class, the corresponding distance-two five-colouring problem is also polynomial; in fact, we can again fully describe all colourable instances — there are exactly two such graphs. It has recently been proved that every planar subcubic graph can be distance-two coloured with at most seven colours, and conjectured that six colours suffice if the planar subcubic graph can be drawn without faces of size five. We consider a weaker version of the conjecture, stating that six colours suffice for a bipartite cubic planar graph, i.e., a cubic plane graph with all faces even. We prove this conjecture in the case when all faces have sizes divisible by four, and in another more general case, when the faces are coloured in three colours, of which two colours consist of faces with sizes divisible by four.","authors":["Tomás Feder","Pavol Hell","Carlos Subi"],"meta":["August 2020European Journal of Combinatorics 91:103210","DOI:10.1016/j.ejc.2020.103210"],"references":["267666953_The_wonderful_Walecki_construction","220533580_Nonhamiltonian_3-Connected_Cubic_Planar_Graphs","220533100_List-Coloring_Squares_of_Sparse_Subcubic_Graphs","2483943_Partitioning_Graphs_Into_Generalized_Dominating_Sets","319135480_The_square_of_a_planar_cubic_graph_is_7-colorable","265469340_A_computer-assisted_proof_of_a_Barnette's_conjecture_Not_only_fullerene_graphs_are_hamiltonian","256694183_Colorings_of_plane_graphs_A_survey","256392017_The_smallest_non-Hamiltonian_3-connected_cubic_planar_graphs_have_38_vertices","244428355_Graphs_with_Given_Diameter_and_a_Coloring_Problem","232327408_On_generating_planar_graphs","229712764_A_class_of_Hamiltonian_polytopes","226897543_Long_cycles_in_fullerene_graphs","225627910_Hamiltonian_circuits_in_polytopes_with_even_sided_faces","222836916_Choosability_of_the_square_of_planar_subcubic_graphs_with_large_girth","220616338_The_Planar_Hamiltonian_Circuit_Problem_is_NP-Complete","220469092_2-Distance_4-colorability_of_planar_subcubic_graphs_with_girth_at_least_22","220189149_A_note_on_3-connected_cubic_planar_graphs","220138059_On_Barnette's_conjecture"]}