{"id":"343753054_Automated_and_partly_automated_contact_tracing_a_systematic_review_to_inform_the_control_of_COVID-19","abstract":"Evidence for the use of automated or partly automated contact-tracing tools to contain severe acute respiratory syndrome coronavirus 2 is scarce. We did a systematic review of automated or partly automated contact tracing. We searched PubMed, EMBASE, OVID Global Health, EBSCO Medical COVID Information Portal, Cochrane Library, medRxiv, bioRxiv, arXiv, and Google Advanced for articles relevant to COVID-19, severe acute respiratory syndrome, Middle East respiratory syndrome, influenza, or Ebola virus, published from Jan 1, 2000, to April 14, 2020. We also included studies identified through professional networks up to April 30, 2020. We reviewed all full-text manuscripts. Primary outcomes were the number or proportion of contacts (or subsequent cases) identified. Secondary outcomes were indicators of outbreak control, uptake, resource use, cost-effectiveness, and lessons learnt. This study is registered with PROSPERO (CRD42020179822). Of the 4036 studies identified, 110 full-text studies were reviewed and 15 studies were included in the final analysis and quality assessment. No empirical evidence of the effectiveness of automated contact tracing (regarding contacts identified or transmission reduction) was identified. Four of seven included modelling studies that suggested that controlling COVID-19 requires a high population uptake of automated contact-tracing apps (estimates from 56% to 95%), typically alongside other control measures. Studies of partly automated contact tracing generally reported more complete contact identification and follow-up compared with manual systems. Automated contact tracing could potentially reduce transmission with sufficient population uptake. However, concerns regarding privacy and equity should be considered. Well designed prospective studies are needed given gaps in evidence of effectiveness, and to investigate the integration and relative effects of manual and automated systems. Large-scale manual contact tracing is therefore still key in most contexts.","authors":["Isobel Braithwaite","Thomas Callender","Miriam Bullock","Robert W Aldridge"],"meta":["August 2020","DOI:10.1016/S2589-7500(20)30184-9"],"references":["343845858_Ethics_of_digital_contact_tracing_and_COVID-19_who_is_not_free_to_go","342543149_Digital_tools_against_COVID-19_taxonomy_ethical_challenges_and_navigation_aid","342413953_Efficacy_of_contact_tracing_for_the_containment_of_the_2019_novel_coronavirus_COVID-19","342225608_Effectiveness_of_isolation_testing_contact_tracing_and_physical_distancing_on_reducing_transmission_of_SARS-CoV-2_in_different_settings_a_mathematical_modelling_study","341035837_Effectiveness_of_isolation_testing_contact_tracing_and_physical_distancing_on_reducing_transmission_of_SARS-CoV-2_in_different_settings","341034700_Key_predictors_of_attending_hospital_with_COVID19_An_association_study_from_the_COVID_Symptom_Tracker_App_in_2618948_individuals","340954287_Mitigating_the_wider_health_effects_of_covid-19_pandemic_response","341330850_Contact_Tracing_A_Game_of_Big_Numbers_in_the_Time_of_COVID-19","341268175_Ethics_of_Digital_Contact_Tracing_and_COVID-19_Who_Is_Not_Free_to_Go","341066505_Estimating_the_generation_interval_for_coronavirus_disease_COVID-19_based_on_symptom_onset_data_March_2020"]}