{"id":"343713700_Micromechanically-motivated_phase_field_approach_to_ductile_fracture","abstract":"Utilization of the phase-field diffusive crack approach in prediction of crack evolution in materials containing voids is investigated herein. It has been established that the ductile failure occurs predominantly due to nucleation, growth and coalescence of micro-voids and micro-cavities, which lead to initiation and propagation of cracks till final material collapse. This study is an attempt to model the material internal degradation with the Rousselier pressure-dependent plasticity law, assisted with the phase field diffusive crack approach for the first time, in order to account for the post-critical softening regime. Such treatment requires the utilization of a damage evolution law and a crack initiation criterion which triggers the succeeding crack propagation, whereby a modified crack driving force based on the sequence of internal damage is employed. In numerical terms, the proposed model is integrated within a fully-staggered framework for the mechanical and diffusive fields and is implemented via the finite element method. The verification tests on the model is processed by several examples with the focus on both qualitative monitoring of pathological crack patterns and the quantitative analysis on the material response, particularly in the post-critical range, complemented by relevant comparisons with the existing data from literature.","authors":["Erfan Azinpour","J. M. A. Cesar de Sa","Abel Dias","Santos"],"meta":["August 2020International Journal of Damage Mechanics 30(1)","DOI:10.1177/1056789520948933"],"references":["334067853_Length_scale_and_mesh_bias_sensitivity_of_phase-field_models_for_brittle_and_cohesive_fracture","332068144_Localizing_gradient_enhanced_Rousselier_model_for_ductile_fracture","329587793_Phase_field_and_gradient_enhanced_damage_models_for_quasi-brittle_failure_A_numerical_comparative_study","328099015_An_enhanced_void-crack-based_Rousselier_damage_model_for_ductile_fracture_with_the_XFEM","322111546_A_modified_Gurson-type_plasticity_model_at_finite_strains_formulation_numerical_analysis_and_phase-field_coupling","333178127_Phase_field_fracture_in_elasto-plastic_solids_Abaqus_implementation_and_case_studies","322907917_An_efficient_FE-implementation_of_implicit_gradient-enhanced_damage_models_to_simulate_ductile_failure","317340038_Gradient-extended_two-surface_damage-plasticity_Micromorphic_formulation_and_numerical_aspects","315716857_2D_and_3D_Abaqus_implementation_of_a_robust_staggered_phase-field_solution_for_modeling_brittle_fracture","313473044_On_the_numerical_integration_of_a_class_of_pressure-dependent_plasticity_models"]}