{"id":"343717166_Event-Based_Implementation_of_Fractional_Order_IMC_Controllers_for_Simple_FOPDT_Processes","abstract":"Fractional order calculus has been used to generalize various types of controllers, including internal model controllers (IMC). The focus of this manuscript is towards fractional order IMCs for first order plus dead-time (FOPDT) processes, including delay and lag dominant ones. The design is novel at it is based on a new approximation approach, the non-rational transfer function method. This allows for a more accurate approximation of the process dead-time and ensures an improved closed loop response. The main problem with fractional order controllers is concerned with their implementation as higher order transfer functions. In cases where central processing unit CPU, bandwidth allocation, and energy usage are limited, resources need to be efficiently managed. This can be achieved using an event-based implementation. The novelty of this paper resides in such an event-based algorithm for fractional order IMC (FO-IMC) controllers. Numerical results are provided for lag and delay dominant FOPDT processes. For comparison purposes, an integer order PI controller, tuned according to the same performance specifications as the FO-IMC, is also implemented as an event-based control strategy. The numerical results show that the proposed event-based implementation for the FO-IMC controller is suitable and provides for a smaller computational effort, thus being more suitable in various industrial applications.","authors":["Cristina Muresan","Isabela Roxana Birs","Eva Henrietta Dulf"],"meta":["August 2020","DOI:10.3390/math8081378"],"references":["348455106_An_Alternative_Design_Approach_for_Fractional_Order_Internal_Model_Controllers_for_Time_Delay_Systems","345446973_Efficacy_of_the_Post-Exposure_Prophylaxis_and_of_the_HIV_Latent_Reservoir_in_HIV_Infection","342690378_Event-based_fractional_order_control","342081220_Generalization_of_the_FOPDT_Model_for_Identification_and_Control_Purposes","341917692_Robust_Controller_Design_Recent_Emerging_Concepts_for_Control_of_Mechatronic_Systems","340604513_An_Efficient_Numerical_Method_for_Fractional_SIR_Epidemic_Model_of_Infectious_Disease_by_Using_Bernstein_Wavelets","340603020_Fractional-Order_Models_for_Biochemical_Processes","346125455_An_event_based_implementation_of_a_fractional_order_controller_on_a_non-Newtonian_transiting_robot","341296847_Mathematical_modelling_with_experimental_validation_of_viscoelastic_properties_in_non-Newtonian_fluids","339217184_Fractional_Model_for_Type_1_Diabetes"]}