{"id":"343791011_MHealth_app_using_machine_learning_to_increase_physical_activity_in_diabetes_and_depression_Clinical_trial_protocol_for_the_DIAMANTE_Study","abstract":"Introduction\nDepression and diabetes are highly disabling diseases with a high prevalence and high rate of comorbidity, particularly in low-income ethnic minority patients. Though comorbidity increases the risk of adverse outcomes and mortality, most clinical interventions target these diseases separately. Increasing physical activity might be effective to simultaneously lower depressive symptoms and improve glycaemic control. Self-management apps are a cost-effective, scalable and easy access treatment to increase physical activity. However, cutting-edge technological applications often do not reach vulnerable populations and are not tailored to an individual’s behaviour and characteristics. Tailoring of interventions using machine learning methods likely increases the effectiveness of the intervention.\n\nMethods and analysis\nIn a three-arm randomised controlled trial, we will examine the effect of a text-messaging smartphone application to encourage physical activity in low-income ethnic minority patients with comorbid diabetes and depression. The adaptive intervention group receives messages chosen from different messaging banks by a reinforcement learning algorithm. The uniform random intervention group receives the same messages, but chosen from the messaging banks with equal probabilities. The control group receives a weekly mood message. We aim to recruit 276 adults from primary care clinics aged 18–75 years who have been diagnosed with current diabetes and show elevated depressive symptoms (Patient Health Questionnaire depression scale-8 (PHQ-8) >5). We will compare passively collected daily step counts, self-report PHQ-8 and most recent haemoglobin A1c from medical records at baseline and at intervention completion at 6-month follow-up.\n\nEthics and dissemination\nThe Institutional Review Board at the University of California San Francisco approved this study (IRB: 17-22608). We plan to submit manuscripts describing our user-designed methods and testing of the adaptive learning algorithm and will submit the results of the trial for publication in peer-reviewed journals and presentations at (inter)-national scientific meetings.\n\nTrial registration number\nNCT03490253 ; pre-results.","authors":["Adrian Aguilera","Caroline A Figueroa","Rosa Hernandez-Ramos","Urmimala Sarkar"],"meta":["August 2020BMJ Open 10(8):e034723","DOI:10.1136/bmjopen-2019-034723"],"references":["337371636_Personalization_in_Real-Time_Physical_Activity_Coaching_Using_Mobile_Applications_A_Scoping_Review","333366919_Short-_and_Long-term_Effects_of_a_Mobile_Phone_App_in_Conjunction_With_Brief_In-Person_Counseling_on_Physical_Activity_Among_Physically_Inactive_Women_The_mPED_Randomized_Clinical_Trial","332246705_Applications_of_Machine_Learning_in_Real-Life_Digital_Health_Interventions_Review_of_the_Literature","331017529_Diabetes_increases_the_risk_of_depression_A_systematic_review_meta-analysis_and_estimates_of_population_attributable_fractions_based_on_prospective_studies","330632005_How_recommender_systems_could_support_and_enhance_computer-tailored_digital_health_programs_A_scoping_review","327413352_The_Effect_of_Physical_Activity_Interventions_Comprising_Wearables_and_Smartphone_Applications_on_Physical_Activity_a_Systematic_Review_and_Meta-analysis","329618390_Can_Smartphone_Apps_Increase_Physical_Activity_Systematic_Review_and_Meta-Analysis","327560458_Innovative_Implementation_Studies_Conducted_in_US_Safety_Net_Health_Care_Settings_A_Systematic_Review","326910400_Association_between_physical_exercise_and_mental_health_in_12_million_individuals_in_the_USA_between_2011_and_2015_a_cross-sectional_study","326253522_Depression_and_diabetes"]}