{"id":"343859456_Within_the_Lack_of_Chest_COVID-19_X-ray_Dataset_A_Novel_Detection_Model_Based_on_GAN_and_Deep_Transfer_Learning","abstract":"The coronavirus (COVID-19) pandemic is putting healthcare systems across the world under unprecedented and increasing pressure according to the World Health Organization (WHO). With the advances in computer algorithms and especially Artificial Intelligence, the detection of this type of virus in the early stages will help in fast recovery and help in releasing the pressure off healthcare systems. In this paper, a GAN with deep transfer learning for coronavirus detection in chest X-ray images is presented. The lack of datasets for COVID-19 especially in chest X-rays images is the main motivation of this scientific study. The main idea is to collect all the possible images for COVID-19 that exists until the writing of this research and use the GAN network to generate more images to help in the detection of this virus from the available X-rays images with the highest accuracy possible. The dataset used in this research was collected from different sources and it is available for researchers to download and use it. The number of images in the collected dataset is 307 images for four different types of classes. The classes are the COVID-19, normal, pneumonia bacterial, and pneumonia virus. Three deep transfer models are selected in this research for investigation. The models are the Alexnet, Googlenet, and Restnet18. Those models are selected for investigation through this research as it contains a small number of layers on their architectures, this will result in reducing the complexity, the consumed memory and the execution time for the proposed model. Three case scenarios are tested through the paper, the first scenario includes four classes from the dataset, while the second scenario includes 3 classes and the third scenario includes two classes. All the scenarios include the COVID-19 class as it is the main target of this research to be detected. In the first scenario, the Googlenet is selected to be the main deep transfer model as it achieves 80.6% in testing accuracy. In the second scenario, the Alexnet is selected to be the main deep transfer model as it achieves 85.2% in testing accuracy, while in the third scenario which includes two classes (COVID-19, and normal), Googlenet is selected to be the main deep transfer model as it achieves 100% in testing accuracy and 99.9% in the validation accuracy. All the performance measurement strengthens the obtained results through the research.","authors":["Mohamed Loey","Florentin Smarandache","Nour Eldeen Khalifa"],"meta":["April 2020Symmetry 12(4):651","DOI:10.3390/sym12040651"],"references":["340182392_Identifying_SARS-CoV-2_related_coronaviruses_in_Malayan_pangolins","340031319_SARS-CoV-2_and_Coronavirus_Disease_2019_What_We_Know_So_Far","339970952_COVID-19_infection_Origin_transmission_and_characteristics_of_human_coronaviruses","339900041_A_Review_of_Coronavirus_Disease-2019_COVID-19","339806620_Diagnostic_Testing_for_the_Novel_Coronavirus","339403834_Coronavirus_Disease_2019_Coronaviruses_and_Blood_Safety","339316654_Severe_acute_respiratory_syndrome_coronavirus_2_SARS-CoV-2_and_coronavirus_disease-2019_COVID-19_The_epidemic_and_the_challenges","339225217_Novel_coronavirus_takes_flight_from_bats","339163164_The_first_2019_novel_coronavirus_case_in_Nepal","339113807_Game_consumption_and_the_2019_novel_coronavirus"]}