{"id":"343897761_Computational_design_of_transmembrane_pores","abstract":"Transmembrane channels and pores have key roles in fundamental biological processes1 and in biotechnological applications such as DNA nanopore sequencing2–4, resulting in considerable interest in the design of pore-containing proteins. Synthetic amphiphilic peptides have been found to form ion channels5,6, and there have been recent advances in de novo membrane protein design7,8 and in redesigning naturally occurring channel-containing proteins9,10. However, the de novo design of stable, well-defined transmembrane protein pores that are capable of conducting ions selectively or are large enough to enable the passage of small-molecule fluorophores remains an outstanding challenge11,12. Here we report the computational design of protein pores formed by two concentric rings of α-helices that are stable and monodisperse in both their water-soluble and their transmembrane forms. Crystal structures of the water-soluble forms of a 12-helical pore and a 16-helical pore closely match the computational design models. Patch-clamp electrophysiology experiments show that, when expressed in insect cells, the transmembrane form of the 12-helix pore enables the passage of ions across the membrane with high selectivity for potassium over sodium; ion passage is blocked by specific chemical modification at the pore entrance. When incorporated into liposomes using in vitro protein synthesis, the transmembrane form of the 16-helix pore—but not the 12-helix pore—enables the passage of biotinylated Alexa Fluor 488. A cryo-electron microscopy structure of the 16-helix transmembrane pore closely matches the design model. The ability to produce structurally and functionally well-defined transmembrane pores opens the door to the creation of designer channels and pores for a wide variety of applications. An approach for the design of protein pores is demonstrated by the computational design and subsequent experimental expression of both an ion-selective and a large transmembrane pore.","authors":["Chunfu Xu","Peilong Lu","Tamer Gamal El-Din","Xue-yuan Pei"],"meta":["September 2020Nature 585(7823):1-6","DOI:10.1038/s41586-020-2646-5"],"references":["333835753_Programmable_Artificial_Cells_Using_Histamine-Responsive_Synthetic_Riboswitch","332063878_Packing_of_apolar_side_chains_enables_accurate_design_of_highly_stable_membrane_proteins","328147269_Maintaining_and_breaking_symmetry_in_homomeric_coiled-coil_assemblies","327330111_Structures_reveal_opening_of_the_store-operated_calcium_channel_Orai","317697931_Membrane-spanning_a-helical_barrels_as_tractable_protein-design_targets","331141995_Structures_Reveal_Opening_of_the_Store-Operated_Calcium_Channel_ORAI","327479644_Structure_of_the_human_voltage-gated_sodium_channel_Na_v_14_in_complex_with_b1","323498625_Accurate_computational_design_of_multipass_transmembrane_proteins","320358307_An_ace_in_the_hole_for_DNA_sequencing","317696327_Membrane_pores_From_structure_and_assembly_to_medicine_and_technology","317696067_Design_of_self-assembling_transmembrane_helical_bundles_to_elucidate_principles_required_for_membrane_protein_folding_and_ion_transport","310391778_A_monodisperse_transmembrane_a-helical_peptide_barrel","308088452_The_coming_of_age_of_de_novo_protein_design","301934119_De_novo_Design_of_Protein_Homo-Oligomers_with_Modular_Hydrogen-Bond_Network-Mediated_Specificity","291765296_UCSF_Chimera-A_visualization_system_for_exploratory_research_and_analysis"]}