{"id":"343818365_Post-prognostics_decision_making_for_a_two-stacks_fuel_cell_system_based_on_a_load-dependent_deterioration_model","abstract":"Multi-stacks proton exchange membrane fuel cell (PEMFC) system has been applied to combined heat and power system (CHP), and serves as an alternative energy device due to its high efficiency and zero emission. Owing to the limited durability and larger power supply demand, the management of multi-stacks PEMFC system to obtain a longer service time has received recently growing attention. From the prognos-tics and health management (PHM) point of view, a post-prognostics decision making for multi-stacks PEMFC system is addressed in this work. Firstly, a load-dependent stochas-tic deterioration model is proposed for PEMFC. The overall ohmic resistance is chosen as the health indicator of PEMFC. Then the resistance is modeled using a Gamma process whose shape parameter is taken as a function of the current load applied to the stack. Finally, for the post-prognostics decision making phase, a decision probability based load repartition criterion is built to identify the optimal load split between the two stacks. The decision probability is calculated based on the system lifetime results (EoL) in each decision step. The EoL results of the decision phase are further compared with the system EoL that calculated without decision making strategy. The comparison result shows that extended service time can be achieved using the proposed post-prognostics decision making method. Jian Zuo et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 3.0 United States License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.","authors":["Zuo Jian","C Cadet","Zhongliang Li","Christophe Berenguer"],"meta":["August 2020","Conference: 5th European Conference of the Prognostics and Health Management Society 2020At: Turin, Italy","Project: Development of a Fuel Cell Prognosis Approach in the Context of a Local Energy Grid"],"references":["330262835_Adaptive_Prognostic_of_Fuel_Cells_by_Implementing_Ensemble_Echo_State_Networks_in_Time-Varying_Model_Space","318918532_Review_of_cell_performance_in_anion_exchange_membrane_fuel_cells","345629675_Recent_Progresses_in_Membranes_for_Proton_Exchange_Membrane_Fuel_Cell_PEMFC_for_Clean_and_Environmentally_Friendly_Applications","331058460_Degradation_Study_of_MEA_for_PEMFC_under_Low_Humidity_Conditions","326976222_Online_remaining_useful_lifetime_prediction_of_proton_exchange_membrane_fuel_cells_using_a_novel_robust_methodology","325399894_Proton_exchange_membrane_fuel_cell_remaining_useful_life_prognostics_considering_degradation_recovery_phenomena","316040472_Load_profile_based_empirical_model_for_the_lifetime_prediction_of_an_automotive_PEM_fuel_cell","314759095_PHM-oriented_Degradation_Indicators_for_Batteries_and_Fuel_Cells","264006218_A_review_of_multi-stack_and_modular_fuel_cell_systems_Interests_application_areas_and_on-going_research_activities","257225207_Degradation_aspects_of_water_formation_and_transport_in_Proton_Exchange_Membrane_Fuel_Cell_A_review"]}