{"id":"343846800_Bi-LSTM_Model_to_Increase_Accuracy_in_Text_Classification_Combining_Word2vec_CNN_and_Attention_Mechanism","abstract":"There is a need to extract meaningful information from big data, classify it into different categories, and predict end-user behavior or emotions. Large amounts of data are generated from various sources such as social media and websites. Text classification is a representative research topic in the field of natural-language processing that categorizes unstructured text data into meaningful categorical classes. The long short-term memory (LSTM) model and the convolutional neural network for sentence classification produce accurate results and have been recently used in various natural-language processing (NLP) tasks. Convolutional neural network (CNN) models use convolutional layers and maximum pooling or max-overtime pooling layers to extract higher-level features, while LSTM models can capture long-term dependencies between word sequences hence are better used for text classification. However, even with the hybrid approach that leverages the powers of these two deep-learning models, the number of features to remember for classification remains huge, hence hindering the training process. In this study, we propose an attention-based Bi-LSTM+CNN hybrid model that capitalize on the advantages of LSTM and CNN with an additional attention mechanism. We trained the model using the Internet Movie Database (IMDB) movie review data to evaluate the performance of the proposed model, and the test results showed that the proposed hybrid attention Bi-LSTM+CNN model produces more accurate classification results, as well as higher recall and F1 scores, than individual multi-layer perceptron (MLP), CNN or LSTM models as well as the hybrid models.","authors":["Beakcheol Jang","Myeonghwi Kim","Gaspard Harerimana","Sang-ug Kang"],"meta":["August 2020Applied Sciences 10(17):5841","DOI:10.3390/app10175841"],"references":["345355679_Tree-Structured_Regional_CNN-LSTM_Model_for_Dimensional_Sentiment_Analysis","344942612_Text_Classification_of_Cancer_Clinical_Trials_Documents_Using_Deep_Neural_Network_and_Fine_Grained_Document_Clustering","340120989_A_Novel_Hybrid_Deep_Learning_Model_for_Sentiment_Classification","339153412_Teleconsultations_between_Patients_and_Healthcare_Professionals_in_Primary_Care_in_Catalonia_The_Evaluation_of_Text_Classification_Algorithms_Using_Supervised_Machine_Learning","337430206_A_Fusion_Model-Based_Label_Embedding_and_Self-Interaction_Attention_for_Text_Classification","333706654_A_Hybrid_CNN-LSTM_Model_for_Improving_Accuracy_of_Movie_Reviews_Sentiment_Analysis","336628844_Research_on_Text_Classification_Based_on_CNN_and_LSTM","334117998_Hierarchical_Convolutional_Attention_Networks_for_Text_Classification","332679933_Text_Classification_Based_on_Hybrid_CNN-LSTM_Hybrid_Model","332678919_Research_on_Patent_Text_Classification_Based_on_Word2Vec_and_LSTM"]}