{"id":"343813059_Energy_Efficient_MANET_Routing_Protocol_based_on_Ant_Colony_Optimization","abstract":"Route stability and energy capacity of mobile nodes are the main challenging tasks in mobile ad hoc networks (MANETs) due to frequent network topology changes and limited energy resources of nodes in the network. This leads to link failures and excessive redundant traffic across the network which consumes high energy and reduces the performance of routing protocols. Therefore, different techniques are considered to deal with challenges that occur by mobility and energy failures of nodes in MANETs. This paper proposes a new routing algorithm to construct the optimal path by combining the concept of ant colony optimization (ACO) and ad hoc on-demand vector (AODV) routing protocol. The proposed routing algorithm effectively reduces the energy consumption and enhances the performance of conventional AODV protocol under different traffic loads by selecting a more stable and reliable route between source and destination nodes, using pheromone values. Node metrics such as residual energy, drain rate energy, number of hop counts, and speed of a node are considered to calculate pheromone values during the route discovery operations. These metrics play an important role to find a more stable and reliable route in MANET. The optimal path with energy-efficient nodes are selected to maintain the stability, reliability, and improve the network lifetime. The experimental results demonstrate that the proposed routing algorithm significantly outperforms conventional AODV routing protocol in terms of packet delivery ratio, throughput, average end-to-end delay, packet loss ratio, and network lifetime.","authors":["Ako Muhammad Abdullah","Emre Ozen","Husnu Bayramoglu"],"meta":["August 2020Ad Hoc & Sensor Wireless Networks 47(1-4):73-96"],"references":["335984543_Low_Overhead_Localized_Routing_in_Mobile_Ad_Hoc_Networks","333431299_Unmanned_vehicle_path_planning_using_a_novel_ant_colony_algorithm"]}