{"id":"343898542_Forbidden_knowledge_in_machine_learning_reflections_on_the_limits_of_research_and_publication","abstract":"Certain research strands can yield “forbidden knowledge”. This term refers to knowledge that is considered too sensitive, dangerous or taboo to be produced or shared. Discourses about such publication restrictions are already entrenched in scientific fields like IT security, synthetic biology or nuclear physics research. This paper makes the case for transferring this discourse to machine learning research. Some machine learning applications can very easily be misused and unfold harmful consequences, for instance, with regard to generative video or text synthesis, personality analysis, behavior manipulation, software vulnerability detection and the like. Up till now, the machine learning research community embraces the idea of open access. However, this is opposed to precautionary efforts to prevent the malicious use of machine learning applications. Information about or from such applications may, if improperly disclosed, cause harm to people, organizations or whole societies. Hence, the goal of this work is to outline deliberations on how to deal with questions concerning the dissemination of such information. It proposes a tentative ethical framework for the machine learning community on how to deal with forbidden knowledge and dual-use applications.","authors":["Thilo Hagendorff"],"meta":["September 2021AI & SOCIETY 36(3)","DOI:10.1007/s00146-020-01045-4"],"references":["343173783_Privacy_Literacy_What_Is_And_How_It_Can_Be_Measured","334973041_From_privacy_to_anti-discrimination_in_times_of_machine_learning","334618236_Modelling_the_drivers_of_a_widespread_shift_to_sustainable_diets","345765845_Das_Ende_der_Informationskontrolle_Zur_Nutzung_digitaler_Medien_jenseits_von_Privatheit_und_Datenschutz","339562302_FaceForensics_Learning_to_Detect_Manipulated_Facial_Images","337408344_The_Importance_of_Ethics_in_Mathematics","336760801_Can_We_Read_a_Person's_Character_from_Facial_Images_The_discredited_science_of_physiognomy_is_making_an_unfortunate_comeback","334438864_Text-based_editing_of_talking-head_video","334433870_Deferred_neural_rendering_Image_Synthesis_using_Neural_Textures","334407224_Superhuman_AI_for_multiplayer_poker"]}