{"id":"343891508_Dependency_on_Verbal_Versus_Graphic_Representations_among_Second_Language_Learners_When_Reading_Illustrated_Expository_Materials","abstract":"The use of graphic representations is ubiquitous and essential in science-related domains. Research into learners' reading of materials that incorporate verbal and graphic representations (i.e. multi-representational materials) however suggests that graphics receive very little attention compared to text. Such a tendency is not ideal as comprehension of multi-representational materials requires learners to attend to the graphics and integrate information contained in these representations with those in the text. This field of research, however, has focused primarily on native language learners. Since the number of people learning in their non-native language is growing rapidly, it is crucial to understand how they engage and learn with these materials. The present paper is part of a larger study that focuses on the multi-representational reading of 42 Malay ESL undergraduates. Their eye fixations during the reading of a science passage and an accompanying diagram were collected and analyzed. To our knowledge, no such study has been undertaken in the Malaysian context. Hence, the findings will be significant contribution to this field. The results indicate that similar to the reading of multi-representational texts by native speakers in other contexts, the multi-representational reading by the Malay ESL undergraduates was also heavily text-based.","authors":["Nurjanah Mohd Jaafar","Siew Ming Thang"],"meta":["August 2020Universal Journal of Educational Research 8(2):454-459","DOI:10.13189/ujer.2020.080216","Project: project on eye-tracking and reading of scientific diagramss"],"references":["329410852_Young_EFL_learners'_processing_of_multimodal_input_Examining_learners'_eye_movements","301581272_Conditions_for_the_Effectiveness_of_Multiple_Visual_Representations_in_Enhancing_STEM_Learning","281137688_Eye_Movement_Patterns_in_Natural_Reading_A_Comparison_of_Monolingual_and_Bilingual_Reading_of_a_Novel","233454627_Adaptations_and_Continuities_in_the_Use_and_Design_of_Visual_Representations_in_US_Middle_School_Science_Textbooks","316177213_Learning_from_Multimedia_Cognitive_Processes_and_Instructional_Support","315924000_The_Use_of_Eye_Tracking_as_a_Research_and_Instructional_Tool_in_Multimedia_Learning","280875132_Text-Picture_Integration_How_Delayed_Testing_Moderates_Recognition_of_Pictorial_Information_in_Multimedia_Learning","261184537_Learning_from_multiple_representations_An_examination_of_fixation_patterns_in_a_science_simulation","248974837_The_Language_Demands_of_Science_Reading_in_Middle_School","234850910_Do_fourth_graders_integrate_text_and_picture_in_processing_and_learning_from_an_illustrated_science_text_Evidence_from_eye-movement_patterns"]}