{"id":"343898383_Thermodynamic_costs_of_Turing_machines","abstract":"Turing machines (TMs) are the canonical model of computation in computer science and physics. We combine techniques from algorithmic information theory and stochastic thermodynamics to analyze the thermodynamic costs of TMs. We consider two different ways of realizing a given TM with a physical process. The first realization is designed to be thermodynamically reversible when fed with random input bits. The second realization is designed to generate less heat, up to an additive constant, than any realization that is computable (i.e., consistent with the physical Church-Turing thesis). We consider three different thermodynamic costs: The heat generated when the TM is run on each input (which we refer to as the “heat function”), the minimum heat generated when a TM is run with an input that results in some desired output (which we refer to as the “thermodynamic complexity” of the output, in analogy to the Kolmogorov complexity), and the expected heat on the input distribution that minimizes entropy production. For universal TMs, we show for both realizations that the thermodynamic complexity of any desired output is bounded by a constant (unlike the conventional Kolmogorov complexity), while the expected amount of generated heat is infinite. We also show that any computable realization faces a fundamental trade-off among heat generation, the Kolmogorov complexity of its heat function, and the Kolmogorov complexity of its input-output map. We demonstrate this trade-off by analyzing the thermodynamics of erasing a long string.","authors":["Artemy Kolchinsky","David H. Wolpert"],"meta":["August 2020Physical Review Research 2(3)","DOI:10.1103/PhysRevResearch.2.033312"],"references":["343082721_Law_without_law_from_observer_states_to_physics_via_algorithmic_information_theory","340145415_The_thermodynamics_of_computing_with_circuits","332418787_A_space-time_tradeoff_for_implementing_a_function_with_master_equation_dynamics","347412256_Transforming_Metastable_Memories_The_Nonequilibrium_Thermodynamics_of_Computation","347411510_The_Power_of_Being_Explicit_Demystifying_Work_Heat_and_Free_Energy_in_the_Physics_of_Computation","337301984_Free_energy_of_a_general_computation","331214457_The_stochastic_thermodynamics_of_computation","325750215_Beyond_Number_of_Bit_Erasures_New_Complexity_Questions_Raised_by_Recently_Discovered_Thermodynamic_Costs_of_Computation","321936469_Second_law_entropy_production_and_reversibility_in_thermodynamics_of_information","320900669_Theory_of_Reversible_Computing"]}