{"id":"343820239_Ensemble_forecasts_of_Coronavirus_Disease_2019_COVID-19_in_the_US","abstract":"Background\nThe COVID-19 pandemic has driven demand for forecasts to guide policy and planning. Previous research has suggested that combining forecasts from multiple models into a single \"ensemble\" forecast can increase the robustness of forecasts. Here we evaluate the real-time application of an open, collaborative ensemble to forecast deaths attributable to COVID-19 in the U.S.\nMethods\nBeginning on April 13, 2020, we collected and combined one- to four-week ahead forecasts of cumulative deaths for U.S. jurisdictions in standardized, probabilistic formats to generate real-time, publicly available ensemble forecasts. We evaluated the point prediction accuracy and calibration of these forecasts compared to reported deaths.\nResults\nAnalysis of 2,512 ensemble forecasts made April 27 to July 20 with outcomes observed in the weeks ending May 23 through July 25, 2020 revealed precise short-term forecasts, with accuracy deteriorating at longer prediction horizons of up to four weeks. At all prediction horizons, the prediction intervals were well calibrated with 92-96% of observations falling within the rounded 95% prediction intervals.\nConclusions\nThis analysis demonstrates that real-time, publicly available ensemble forecasts issued in April-July 2020 provided robust short-term predictions of reported COVID-19 deaths in the United States. With the ongoing need for forecasts of impacts and resource needs for the COVID-19 response, the results underscore the importance of combining multiple probabilistic models and assessing forecast skill at different prediction horizons. Careful development, assessment, and communication of ensemble forecasts can provide reliable insight to public health decision makers.","authors":["Evan L Ray","Nutcha Wattanachit","Jarad Niemi","Abdul Hannan Kanji"],"meta":["August 2020","DOI:10.1101/2020.08.19.20177493"],"references":["337450270_Accuracy_of_real-time_multi-model_ensemble_forecasts_for_seasonal_influenza_in_the_US","330402944_A_collaborative_multiyear_multimodel_assessment_of_seasonal_influenza_forecasting_in_the_United_States","326286033_Superensemble_forecast_of_respiratory_syncytial_virus_outbreaks_at_national_regional_and_state_levels_in_the_United_States","319308562_The_RAPIDD_Ebola_Forecasting_Challenge_Synthesis_and_Lessons_Learnt","315749506_Prediction_of_infectious_disease_epidemics_via_weighted_density_ensembles","41040444_Optimizing_infectious_disease_interventions_during_an_emerging_epidemic","222683062_Chapter_4_Forecast_Combinations"]}