{"id":"343888727_Committee_machines-a_universal_method_to_deal_with_non-idealities_in_memristor-based_neural_networks","abstract":"Artificial neural networks are notoriously power- and time-consuming when implemented on conventional von Neumann computing systems. Consequently, recent years have seen an emergence of research in machine learning hardware that strives to bring memory and computing closer together. A popular approach is to realise artificial neural networks in hardware by implementing their synaptic weights using memristive devices. However, various device- and system-level non-idealities usually prevent these physical implementations from achieving high inference accuracy. We suggest applying a well-known concept in computer science—committee machines—in the context of memristor-based neural networks. Using simulations and experimental data from three different types of memristive devices, we show that committee machines employing ensemble averaging can successfully increase inference accuracy in physically implemented neural networks that suffer from faulty devices, device-to-device variability, random telegraph noise and line resistance. Importantly, we demonstrate that the accuracy can be improved even without increasing the total number of memristors.","authors":["Dovydas Joksas","Pedro Freitas","Zheng Chai","Wing H Ng"],"meta":["August 2020Nature Communications 11(1)","DOI:10.1038/s41467-020-18098-0"],"references":["335766432_In_situ_training_of_feed-forward_and_recurrent_convolutional_memristor_networks","333735022_Simulation_of_Inference_Accuracy_Using_Realistic_RRAM_Devices","331868199_Reinforcement_learning_with_analogue_memristor_arrays","331223770_Solving_matrix_equations_in_one_step_with_cross-point_resistive_arrays","330203258_Long_short-term_memory_networks_in_memristor_crossbar_arrays","328352112_A_phase-change_memory_model_for_neuromorphic_computing","327484337_Impact_of_RTN_on_Pattern_Recognition_Accuracy_of_RRAM-based_Synaptic_Neural_Network","335778882_Energy_and_Policy_Considerations_for_Deep_Learning_in_NLP","331912455_Memristive_crossbar_arrays_for_brain-inspired_computing","328994904_A_Methodology_to_Improve_Linearity_of_Analog_RRAM_for_Neuromorphic_Computing"]}