{"id":"343816092_Deep_Learning_Identifies_Morphological_Determinants_of_Sex_Differences_in_the_Pre-Adolescent_Brain","abstract":"The application of data-driven deep learning to identify sex differences in developing brain structures of pre-adolescents has heretofore not been accomplished. Here, the approach identifies sex differences by analyzing the minimally processed MRIs of the first 8,144 participants (age 9 and 10 years) recruited by the Adolescent Brain Cognitive Development (ABCD) study. The identified pattern accounted for confounding factors (i.e., head size, age, puberty development, socioeconomic status) and comprised cerebellar (corpus medullare, lobules III, IV/V, and VI) and subcortical (pallidum, amygdala, hippocampus, parahippocampus, insula, putamen) structures. While these have been individually linked to expressing sex differences, a novel discovery was that their grouping accurately predicted the sex in individual pre-adolescents. Another novelty was relating differences specific to the cerebellum to pubertal development. Finally, we found that reducing the pattern to a single score not only accurately predicted sex but also correlated with cognitive behavior linked to working memory. The predictive power of this score and the constellation of identified brain structures provide evidence for sex differences in pre-adolescent neurodevelopment and may augment understanding of sex-specific vulnerability or resilience to psychiatric disorders and presage sex-linked learning disabilities.","authors":["Ehsan Adeli","Qingyu Zhao","Natalie M. Zahr","Aimée Goldstone"],"meta":["August 2020NeuroImage 223(7):117293","DOI:10.1016/j.neuroimage.2020.117293"],"references":["335132166_Image_processing_and_analysis_methods_for_the_Adolescent_Brain_Cognitive_Development_Study","334208862_Inter-individual_differences_in_human_brain_structure_and_morphology_link_to_variation_in_demographics_and_behavior","332755592_Evaluation_of_the_Diagnostic_Stability_of_the_Early_Autism_Spectrum_Disorder_Phenotype_in_the_General_Population_Starting_at_12_Months","332584450_Automatic_CNN-based_detection_of_cardiac_MR_motion_artefacts_using_k-space_data_augmentation_and_curriculum_learning","331616744_Brain_Differences_Between_Men_and_Women_Evidence_From_Deep_Learning","330451149_Brain_Control_of_Sexually_Dimorphic_Liver_Function_and_Disease_The_Endocrine_Connection","338952006_Opioid_Prescribing_Behaviors_-_Prescription_Behavior_Surveillance_System_11_States_2010-2016","335711673_Disturbed_Cerebellar_Growth_Trajectories_in_Adolescents_Who_Initiate_Alcohol_Drinking","333301577_Spherical_U-Net_on_Cortical_Surfaces_Methods_and_Applications","331367153_Logistic_Regression_Confined_by_Cardinality-Constrained_Sample_and_Feature_Selection"]}