{"id":"343923967_Hate_speech_detection_and_racial_bias_mitigation_in_social_media_based_on_BERT_model","abstract":"Disparate biases associated with datasets and trained classifiers in hateful and abusive content identification tasks have raised many concerns recently. Although the problem of biased datasets on abusive language detection has been addressed more frequently, biases arising from trained classifiers have not yet been a matter of concern. In this paper, we first introduce a transfer learning approach for hate speech detection based on an existing pre-trained language model called BERT (Bidirectional Encoder Representations from Transformers) and evaluate the proposed model on two publicly available datasets that have been annotated for racism, sexism, hate or offensive content on Twitter. Next, we introduce a bias alleviation mechanism to mitigate the effect of bias in training set during the fine-tuning of our pre-trained BERT-based model for hate speech detection. Toward that end, we use an existing regularization method to reweight input samples, thereby decreasing the effects of high correlated training set’ s n-grams with class labels, and then fine-tune our pre-trained BERT-based model with the new re-weighted samples. To evaluate our bias alleviation mechanism, we employed a cross-domain approach in which we use the trained classifiers on the aforementioned datasets to predict the labels of two new datasets from Twitter, AAE-aligned and White-aligned groups, which indicate tweets written in African-American English (AAE) and Standard American English (SAE), respectively. The results show the existence of systematic racial bias in trained classifiers, as they tend to assign tweets written in AAE from AAE-aligned group to negative classes such as racism, sexism, hate, and offensive more often than tweets written in SAE from White-aligned group. However, the racial bias in our classifiers reduces significantly after our bias alleviation mechanism is incorporated. This work could institute the first step towards debiasing hate speech and abusive language detection systems.","authors":["Marzieh Mozafari","Reza Farahbakhsh","Noel Crespi"],"meta":["August 2020PLoS ONE 15(8):e0237861","DOI:10.1371/journal.pone.0237861"],"references":["345354339_Detecting_weak_and_strong_Islamophobic_hate_speech_on_social_media","335779647_Racial_Bias_in_Hate_Speech_and_Abusive_Language_Detection_Datasets","335311146_Hate_speech_detection_Challenges_and_solutions","333047932_Stereotypical_Bias_Removal_for_Hate_Speech_Detection_Task_using_Knowledge-based_Generalizations","337955386_A_BERT-Based_Transfer_Learning_Approach_for_Hate_Speech_Detection_in_Online_Social_Media","336871914_Content_Similarity_Analysis_of_Written_Comments_under_Posts_in_Social_Media","336871656_A_BERT-Based_Transfer_Learning_Approach_for_Hate_Speech_Detection_in_Online_Social_Media","335784157_The_Risk_of_Racial_Bias_in_Hate_Speech_Detection","334156207_A_Unified_Deep_Learning_Architecture_for_Abuse_Detection","334116409_Reducing_Gender_Bias_in_Abusive_Language_Detection"]}