{"id":"343979287_Efficient_Sky_Dehazing_by_Atmospheric_Light_Fusion","abstract":"In this article, we present a new method of dehazing based on the Koschmieder model, which aims to restore an image that has been affected by haze. The difficulty is to improve the estimation of the transmission and the atmospheric light that generally suffer from the nonhomogeneity and the random variability of the environment. The keypoint is to enhance the dehazing of very bright regions of the image in order to improve the treatment of the sky that is often overestimated or underestimated compared to the rest of the scene. The approach proposed in this paper is based on two main contributions: 1. an L0 gradient optimization function weighted by a set of Gaussian filters and based on an iterative algorithm for optimization convergence. Unlike the existing methods using a single value of the atmospheric light for the whole image, our method uses a set of values neighboring an initial estimated value. The fusion is then applied based on Laplacian and Gaussian pyramids to combine all the relevant information from the set of images constructed from atmospheric lights and improves the contrast to recover the colors of the sky without any artifacts. Finally, the results are validated by three criteria: an autocorrelation score (ZNCC), a similarity measure (SSIM) and a visual criterion. The experiments carried out on two datasets show that our approach allows a better dehazing of the images with higher SSIM and ZNCC measurements but also with better visual quality.","authors":["Jaouad Hajjami","Thibault Napoléon","Ayman Alfalou"],"meta":["August 2020Sensors 20(17):4893","DOI:10.3390/s20174893"],"references":["330233638_Enhancing_underwater_optical_imaging_by_using_a_low-pass_polarization_filter","261377676_Mixture_contrast_limited_adaptive_histogram_equalization_for_underwater_image_enhancement","333072628_Mammogram_Image_Enhancement_Using_Entropy_and_CLAHE_Based_Intuitionistic_Fuzzy_Method","325514901_Model_Assisted_Multi-band_Fusion_for_Single_Image_Enhancement_and_Applications_to_Robot_Vision","323351986_HazeRD_An_outdoor_scene_dataset_and_benchmark_for_single_image_dehazing","308277412_Single_Image_Dehazing_via_Multi-scale_Convolutional_Neural_Networks","273188249_Dehazing_Using_Color-Lines","262356211_Efficient_Image_Dehazing_with_Boundary_Constraint_and_Contextual_Regularization","258887907_Optics_of_the_Atmosphere_Scattering_by_Molecules_and_Particles","236837518_Single_Image_Dehazing_by_Multi-Scale_Fusion"]}