{"id":"343933988_Impact_of_E-learning_Platforms_on_Students'_Interest_and_Academic_Achievement_in_Data_Structure_Course","abstract":"The study examines the impact of e-learning platforms on students' interest and academic achievement in Data Structure course. A total of 50 Computer Science students that were taking Data Structure course at tertiary institution level participated in the study. The sample was divided into two major groups: experimental group (n-25) and control group (n-25). The Experimental Group (EG) was taught using an e-learning platform, while the Control Group (CG) was taught using the traditional classroom approach. An achievement test on Data Structure was administered as pre-test and post-test to the two groups. While the hypotheses were tested using ANOVA. The post-test result showed a statistically significant difference between the Academic Achievements of the experimental group and the control group, in favour of the experimental group after the treatment. The mean score of the EG was statistically higher than the CG, showing that the EG outperformed the CG after the treatment. Also, the finding showed that the use of e-learning platforms had a statistically significant effects on the learning interests of the EG after the treatment. Thus, we conclude that the use of e-learning platforms should be encouraged, but the transition has to be gradual to enable the actors understand the new learning strategy, and how to maximize its potentials.","authors":["Edeh Michael Onyema","Nwafor Chika Eucheria","Ezeanya Christiana Uchenna","Patricia Nkiruka"],"meta":["July 2020","Project: ALL RESEARCHERS WELCOME GLOBAL PLATFORM"],"references":["348335311_The_role_of_e-learning_advantages_and_disadvantages_of_its_adoption_in_higher_education","340436005_Development_of_a_Mobile-Learning_Platform_for_Entrepreneurship_Education_in_Nigeria","337654925_Online_Discussion_Forum_as_a_Tool_for_Interactive_Learning_and_Communication","337051363_Potentials_of_Mobile_Technologies_in_Enhancing_the_Effectiveness_of_Inquiry-based_Learning_Approach","336278814_Integration_of_Emerging_Technologies_in_Teaching_and_Learning_Process_in_Nigeria_the_challenges","335698140_Opportunities_and_challenges_of_the_use_of_mobile_phone_technology_in_teaching_and_learning_in_Nigeria-_A_Review","313768677_The_impacts_of_ICT_on_the_students'_Performance_A_Review_of_Access_to_Information","312113861_Studying_and_comparing_the_free_e-learning_platforms","275605011_E-Learning_Methodologies_and_Tools","256373476_Improving_student_participation_in_e-learning_activities"]}