{"id":"343980389_Cartographie_sur_internet_Web-Mapping_un_outil_de_partage_de_l'information_geographique_-Cas_du_Haut_commissariat_au_Plan_et_les_Agences_Urbaines-","abstract":"Le travail cartographique revêt d’une importance primordiale dans la vie des individus car il contribue à faciliter les interventions visant à améliorer la qualité de la vie publique grâce au transfert, la présentation et l'analyse de différentes données (géographiques ou autres). L'importance de ces travaux s’est renforcée davantage par le développement de nombreuses technologies (satellites, sciences spatiales, évolution des capacités informatiques, vitesse des réseaux de communication, etc.). Au début des années 90, les cartes dites d’Internet, ont connus une évolution rapide. Elles ont passé du statut des cartes statiques en cartes interactives, qui fournissent des données géospatiales riches et disponibles au plus bas coût.\nCette recherche vise à mettre en évidence les caractéristiques de ce type de cartographie et son rôle dans la participation de l'information géographique à travers l’étude des exemples des cartes internet fournies par certaines institutions nationales (HCP et Agences urbaines), et dans quelle mesure ont-elles contribué au partage des données géographiques avec les différents acteurs ?\n\nMots clés : cartes d’internet – développement technologique – données géographiques – partager – établissements.","authors":["Bilal Bougi","Assioui Mohammed"],"meta":["August 2020"],"references":["283454538_Chacun_sa_carte_Le_nouveau_Google_Maps_Chronique_Internet","250016220_Web_Cartography_in_the_United_States","235443270_Solution_Carto_Web_pour_le_Web_Mapping","235411035_La_participation_a_la_decision_territoriale_dimension_socio-geographique_et_enjeux_informationnels_d'une_question_politique","311340527_Les_Sig_et_la_cartographie_a_l'ere_du_geoweb_Vers_une_nouvelle_generation_de_Sig_participatifs","255658233_Citizens_as_sensors_Web_20_and_the_volunteering_of_geographic_information","47069656_The_World_is_Flat_A_Brief_History_of_the_Twenty-First_Century"]}