{"id":"343904049_A_Framework_for_Quantifying_Controversy_of_Social_Network_Debates_Using_Attributed_Networks_Biased_Random_Walk_BRW","abstract":"All societies, have been much more bipolar over the past few years, particularly after the emergence of online social networks and media. In fact, the gap between the two ends of social spectrum is going to be even deeper after the spread of new media. In this circumstance, social polarization has been a growing concern among socialists and computer science experts because of the detrimental impact which online social networks can have on societies by adding fuel to the fire of extremism. Several types of research were conducted for proposing measures to calculate the controversy level in social networks, afterward, to reduce controversy among contradicting viewpoints, for example, by exposing opinions of one side to other side's members. Most of the attempts for quantifying social networks' controversy have considered the networks in their most primary forms, without any attributes. Although these kinds of researches provide platform-free algorithms to be used in different social networks, they are not able to take into account a great deal of useful information provided by users (node attributes).To surmount this shortcoming, we propose a framework to be utilized in different networks with different attributes. We propelled some Biased Random Walks (BRW) to find their path from start point to an initially unknown endpoint with respect to initial energy of start node and energy loss of nodes on the path. We extracted structural attribute of networks, using node2vec, and compared it with state-of-the-art algorithms, and showed its accuracy. Then, we extracted some content attributes of user and analyze their effects on the results of our algorithm. BRW is compared with another state-of-the-art controversy measuring algorithm. Then, its changes in different level of controversy in Persian Twitter is considered to show how it works in different circumstance.","authors":["Hanif Emamgholizadeh","Milad Noorizadeh","Mir Saman Tajbakhsh","Mahdieh Hashminezhad"],"meta":["December 2020Social Network Analysis and Mining 10(1)","DOI:10.1007/s13278-020-00703-1"],"references":["324941747_Quantifying_Qualitative_Data_for_Understanding_Controversial_Issues","323980520_Echo_Chambers_on_Facebook","345635205_Quantifying_and_Minimizing_Risk_of_Conflict_in_Social_Networks","344125515_Defining_and_evaluating_network_communities_based_on_ground-truth","337014873_Discovering_Polarized_Communities_in_Signed_Networks","332306019_Together_and_Separate_An_Exploratory_Study_of_Political_Polarization_on_Social_Media_During_the_2016_Brazilian_Political_Crisis","332120456_Polarization_and_Fake_News_Early_Warning_of_Potential_Misinformation_Targets","326202255_Reducing_Controversy_by_Connecting_Opposing_Views","321896425_Controversy_Detection_Using_Reactions_on_Social_Media","320785892_Automatic_controversy_detection_in_social_media_A_content-independent_motif-based_approach"]}