{"id":"343968309_The_Meta-analysis_of_Smart_Data_International_Researches","abstract":"Smart data is the raw material for many activities such as automation, intelligent systems, artificial intelligence and for the fourth industrial revolution. The purpose of this study is to systematically analyze all smart data related studies published from 1980 to the end of September 2017. Also, the study of probabilistic patterns is another purpose of this research. Regarding the search model of Winer, Amike and Lee in 2008, the articles of this study were extracted using a systematic search in the Web of Science database and 220 articles were selected as the final population. They were considered to identify authors, objective, population, countries and universities, funders, years, publication terms, citation status, keywords, subject, format, language, and authorship. The main findings show that Sen Soumya has the highest number of articles (63.3%) in this field, while the United States with 33.63 percent, Princeton University with 18.3 percent, and the National Science Foundation of China with 2.72 percent have the largest share in countries, universities, and institutions. The objectives of 72.77% of articles were smart data applications and 84.54 percent of the articles have been made on nonhuman societies. Most research in this area (20.9%) was conducted in 2016. The IEEE Conference on Computer Communications Workshops has published most articles in this field (18.3%). Average citations received is 4.4. The keyword «system” (18.3%) is the most common. 39.44 percent of the published articles relate to computer science. 52/64 percent of the articles were published in the form of a conference. 18.88 percent of articles are written in English. 90.5 percent of the articles are written by single authors and 94 percent of them are written by several writers. The results of the current study indicate the variety and extent of the components studied.","authors":["Omid Alipour","Shima Moradi","saeed Ghaffari"],"meta":["July 2018"],"references":["322372860_Dynamics_of_co-authorship_and_productivity_across_different_fields_of_scientific_research","313816819_Enabling_smart_data_selection_based_on_data_completeness_measures_a_quality-aware_approach","313540863_A_Precision_Medicine_Initiative_for_Alzheimer's_disease_the_road_ahead_to_biomarker-guided_integrative_disease_modeling","309460842_Cost_Efficiency_for_Economical_Mobile_Data_Traffic_Management_from_Users'_Perspective","304144883_Big_data_to_smart_data_in_AD_Real-world_examples_of_advanced_modeling_and_simulation","327549370_From_Big_Data_to_Smart_Data","319135640_The_Promise_of_Evidence-Based_Practices_in_Child_and_Adolescent_Mental_Health","314783002_Customized_Data_Plans_for_Mobile_Users_Feasibility_and_Benefits_of_Data_Trading","312558400_Bayesian_network_aided_grasp_and_grip_efficiency_estimation_using_a_smart_data_glove_for_post-stroke_diagnosis","311211925_Smart_Data_Pricing_The_Value_of_Shared_Data_Plans","303028536_Forecasting_Internal_Temperature_in_a_Home_with_a_Sensor_Network","284136830_The_Role_of_Smart_Data_in_Smart_Home_Health_Monitoring_Case","282254823_Estimating_traffic_delays_and_network_speeds_from_low-_frequency_GPS_taxis_traces_for_urban_transport_modelling","292158567_Expanded_cloud_plumes_hiding_Big_Data_ecosystem","278825767_Big_Smart_Clean_Messy_Data_in_the_Humanities"]}