{"id":"343979248_Finding_Top-k_Nodes_for_Temporal_Closeness_in_Large_Temporal_Graphs","abstract":"The harmonic closeness centrality measure associates, to each node of a graph, the average of the inverse of its distances from all the other nodes (by assuming that unreachable nodes are at infinite distance). This notion has been adapted to temporal graphs (that is, graphs in which edges can appear and disappear during time) and in this paper we address the question of finding the top-k nodes for this metric. Computing the temporal closeness for one node can be done in O(m) time, where m is the number of temporal edges. Therefore computing exactly the closeness for all nodes, in order to find the ones with top closeness, would require O(nm) time, where n is the number of nodes. This time complexity is intractable for large temporal graphs. Instead, we show how this measure can be efficiently approximated by using a “backward” temporal breadth-first search algorithm and a classical sampling technique. Our experimental results show that the approximation is excellent for nodes with high closeness, allowing us to detect them in practice in a fraction of the time needed for computing the exact closeness of all nodes. We validate our approach with an extensive set of experiments.","authors":["Pierluigi Crescenzi","Clémence Magnien","Andrea Marino"],"meta":["August 2020Algorithms 13(9):211","DOI:10.3390/a13090211"],"references":["336422012_Approximating_the_Temporal_Neighbourhood_Function_of_Large_Temporal_Graphs","333644961_Temporal_betweenness_centrality_in_dynamic_graphs","331982905_Time-Varying_Graphs_and_Dynamic_Networks","331929461_International_Journal_of_Parallel_Emergent_and_Distributed_Systems_Time-varying_graphs_and_dynamic_networks_Time-varying_graphs_and_dynamic_networks","328645360_Evolving_Networks_and_Social_Network_Analysis_Methods_and_Techniques","325161554_A_collection_of_public_transport_network_data_sets_for_25_cities","338619988_Efficient_closeness_centrality_computation_in_time-evolving_graphs","336051574_Computing_top-_k_Closeness_Centrality_Faster_in_Unweighted_Graphs","330633676_PageRank_centrality_for_temporal_networks","328857474_Centrality_Metrics_in_Dynamic_Networks_A_Comparison_Study"]}