{"id":"343975676_Professional_development_and_reform_in_science_education_The_role_of_teachers'_practical_knowledge","abstract":"In this article, professional development in the context of the current reforms in science education is discussed from the perspective of developing teachers' practical knowledge. It is argued that reform efforts in the past have often been unsuccessful because they failed to take teachers' existing knowledge, beliefs, and attitudes into account. Teachers' practical knowledge is conceptualized as action‐oriented and person‐bound. As it is constructed by teachers in the context of their work, practical knowledge integrates experiential knowledge, formal knowledge, and personal beliefs. To capture this complex type of knowledge, multimethod designs are necessary. On the basis of a literature review, it is concluded that long‐term professional development programs are needed to achieve lasting changes in teachers' practical knowledge. In particular, the following strategies are potentially powerful: (a) learning in networks, (b) peer coaching, (c) collaborative action research, and (d) the use of cases. In any case, it is recommended that teachers' practical knowledge be investigated at the start of a reform project, and that changes in this knowledge be monitored throughout the project. In that way, the reform project may benefit from teachers' expertise. Moreover, this makes it possible to adjust the reform so as to enhance the chances of a successful implementation. © 2001 John Wiley & Sons, Inc. J Res Sci Teach 38: 137–158, 2001","authors":["Jan H. van Driel","Douwe Beijaard","Nico Verloop"],"meta":["February 2001Journal of Research in Science Teaching 38(2):137-158","DOI:10.1002/1098-2736%28200102%2938%3A2%3C137%3A%3AAID-TEA1001%3E3.0.CO%3B2-U"],"references":["346305168_Struggling_to_promote_deeply_rooted_change_The_filtering_effect_of_teachers'_beliefs_on_understanding_transformational_views_of_teaching_science","343975330_Developing_science_teachers'_pedagogical_content_knowledge","343974883_An_exploratory_study_of_the_knowledge_base_for_science_teaching"]}