{"id":"343918411_Design_and_implementation_of_Sun_Tracking_Solar_Panel_and_Smart_Wiping_Mechanism_using_Tinkercad","abstract":"In today’s times, electricity has become very essential for mankind. Increasing demand for electricity leads to the depletion of the coal and fossil fuel available to humans. As fossil fuels are bound to get exhausted and also not being a clean source of energy is another added disadvantage. In this era of enormous energy demand, wide research and development of renewable sources of energy is mandatory. The use of solar energy can be advantageous to great extent. To make most of the power from photovoltaic cells, development should focus on getting greater efficiencies using Solar panel arrays. Dust on the surface of the panel and varying intensity of the sunlight contributes to a significant amount for reduction in efficiency. In this paper, an integrated solution for both the dust accumulation problem and the sun’s continuous movement has been proposed, which leads to an increase in the efficiency of the panel. The consequences of dust and intensity of sunshine on the efficiencies of the Photo-voltaic panels are highlighted. The paper gives a brief description of the planning and construction of microcontroller-based cleaning and tracking system. The solution proposed is visualized in Tinkercad, which is an online simulator to design CAD models and electronic circuits. The designed model is practically implemented as a hardware prototype for validation.","authors":["Keyur Patel","Sanket Borole","Ketan Ramaneti","Atharv Hejib"],"meta":["August 2020IOP Conference Series Materials Science and Engineering 906(1):012030","DOI:10.1088/1757-899X/906/1/012030"],"references":["316906193_Automatic_solar_tracking_system_using_DELTA_PLC","303647719_Helianthus_-_a_Low_Cost_High_Efficient_Solar_Tracking_System_Using_AVR_Microcontroller","292275071_Power_Loss_Due_to_Soiling_on_Solar_Panel_A_review","268357476_Simplified_solar_tracking_prototype","241633155_Characterization_of_photovoltaic_panels_The_effects_of_dust","337171504_Anti-reflective_and_anti-soiling_properties_of_a_KleanBoost_a_superhydrophobic_nano-textured_coating_for_solar_glass","331617750_An_Analysis_on_Arduino_based_Single_Axis_Solar_Tracker","329508513_Electrostatic_Cleaning_Equipment_for_Dust_Removal_from_Solar_Panels_of_Mega_Solar_Power_Generation_Plants","309305379_Self-cleaning_and_tracking_solar_photovoltaic_panel_for_improving_efficiency","276841743_PLC_Based_Solar_Tracking_Panel_Assembly"]}