{"id":"343975113_Tecnologia_educativa_y_su_papel_en_el_logro_de_los_fines_de_la_educacion","abstract":"Este trabajo está dirigido a develar el papel que tie-ne la tecnología educativa en el logro de los fines de la educación. Para alcanzar esta empresa se aplicó la técnica de análisis de contenidos a diversas obras y publicaciones referidas a la temática del estudio, así como a documentos emitidos por organismos in-ternacionales y nacionales con inherencia en mate-ria educativa. Se determinó que la educación puede lograr sus finalidades más trascendentales mediante el uso sistemático de la tecnología educativa, que emplea diversos medios y recursos para el aprendi-zaje escolar, ya sean los tradicionales (libros, piza-rra, entre otros), o las herramientas que ofrecen las tecnologías de información y comunicación (TIC); concepto que no puede considerarse equivalente al de tecnología educativa. Palabras clave: Educación, tecnología educativa, tecnologías de información y comunicación, Vene-zuela. Tecnología educativa y su papel en el logro de los fines de la educación.\nAbstract This research seeks to unveil the role of Educational Technology in the achievement of educational purposes. In order to do so, the content analysis technique was used to conduct a thematic analysis of the several papers and publications related to this study, as well as documents submitted by national and international organizations related to the educational field. It was determined that education can achieve its most significant purposes though the systematic use of educational technology, which employs various means and resources in the process of school learning, it could refer to traditional resources (books, whiteboard, and others) or the Information and Communication Technology (ICT) tools; concept that cannot be considered equivalent to Educational technology.","authors":["Pablo César Torres Cañizález","John Cobo"],"meta":["March 2017","Project: Formación Inicial de Docentes"],"references":["326466175_Sancho_JM_1994_Para_una_tecnologia_educativa","267362779_Introduccion_a_la_Tecnologia_Educativa","28147596_Replanteando_la_tecnologia_educativa","242453055_ESTUDIO_CRITICO_DE_LA_OBRA_LA_EDUCACION_ENCIERRA_UN_TESORO_Informe_a_la_UNESCO_de_la_Comision_Internacional_sobre_la_Educacion_para_el_Siglo_XXI_presidida_por_Jacques_Delors","232153722_Encyclopedia_of_Educational_Research","49549823_Tecnologia_educacional","49504065_Metodologia_de_la_investigacion_holistica","44516612_Los_retos_del_siglo_XXI_sociedad_del_conocimiento_y_educacion_Antonio_Luis_Cardenas","44453844_Tecnologia_de_la_ensenanza_B_F_Skinner","41207091_Estructura_y_base_conceptual_del_diseno_curricular_del_sistema_educativo_bolivariano","31714789_Tecnologia_educativa_Diseno_y_utilizacion_de_medios_en_la_ensenanza_J_Cabrero_Almenara"]}