{"id":"343951678_Homomorphisms_of_signed_graphs_An_update","abstract":"A signed graph is a graph together with an assignment of signs to the edges. A closed walk in a signed graph is said to be positive (negative) if it has an even (odd) number of negative edges, counting repetition. Recognizing the signs of closed walks as one of the key structural properties of a signed graph, we define a homomorphism of a signed graph (G,σ) to a signed graph (H,π) to be a mapping of vertices and edges of G to (respectively) vertices and edges of H which preserves incidence, adjacency and the signs of closed walks.\nIn this work we first give a characterization of the sets of closed walks in a graph G that correspond to the set of negative closed walks in some signed graph on G. We also give an easy algorithm for the corresponding decision problem.\nAfter verifying the equivalence between this definition and earlier ones, we discuss the relation between homomorphisms of signed graphs and those of 2-edge-colored graphs. Next we provide some basic no-homomorphism lemmas. These lemmas lead to a general method of defining chromatic number which is discussed at length. Finally, we list a few problems that are the driving force behind the study of homomorphisms of signed graphs.","authors":["Reza Naserasr","Eric Sopena","T. Zaslavsky"],"meta":["August 2020European Journal of Combinatorics 91(2):103222","DOI:10.1016/j.ejc.2020.103222"],"references":["284001801_Coloring_signed_graphs_using_DFS","271224179_Walk-powers_and_homomorphism_bound_of_planar_graphs","269876954_The_Chromatic_Number_of_a_Signed_Graph","267436576_Homomorphisms_of_planar_signed_graphs_to_signed_projective_cubes","344147620_On_the_4-color_theorem_for_signed_graphs","338530755_Circular_Chromatic_Number_of_Planar_Graphs_of_Large_Odd_Girth","304027261_Homomorphisms_of_2-Edge-Colored_Triangle-Free_Planar_Graphs_HOMOMORPHISMS_OF_2-EDGE-COLORED_TRIANGLE-FREE_PLANAR_GRAPHS","285899345_On_the_notion_of_balance_of_signed_graph","283043651_The_complexity_of_signed_graph_and_edge-coloured_graph_homomorphisms","281896177_Circular_coloring_of_signed_graphs"]}