{"id":"344055613_A_new_Attributed_Graph_Clustering_by_using_Label_Propagation_in_Complex_Networks","abstract":"The diffusion method is one of the main methods of community detection in complex networks. In this method, the use of the concept that diffusion within the nodes that are members of a community is faster than the diffusion of nodes that are not in the same community. In this way, the dense subgraph will detect the graph in the middle layer. The LPA algorithm, which mimics epidemic contagion by spreading labels, has attracted much attention in recent years as one of the most efficient algorithms in the subcategory of diffusion methods. This algorithm is one of the detection algorithms of most popular communities in recent years because of possessing some advantages including linear time order, the use of local information, and non-dependence on any parameter; however, due to the random behavior in LPA, there are some problems such as unstable and low quality resulting from larger monster communities. This algorithm is easily adaptable to attributed network. In this paper, it is supposed to propose a new version of the LPA algorithm for attributed graphs so that the detected communities solve the problems related to unstable and low quality in addition to possessing structural cohesiveness and attribute homogeneity. For this purpose, a weighted graph of the combination of node attributes and topological structure is produced from an attributed graph for nodes which have edges with each other. Also, the centrality of each node will be calculated equal to the influence of each node using Laplacian centrality, and the steps of selecting the node are being enhanced for updating as well as the mechanism of updating based on the influence of nodes. The proposed method has been compared to other primary and new attributed graph clustering algorithms for real and artificial datasets. In accordance with the results of the experiments on the proposed algorithm without parameter adjusting for different networks of density and entropy criteria, the normalized mutual information indicates that the proposed method is more efficient and precise than other state-of-the-art attributed graph clustering methods.","authors":["Kamal Berahmand","Sogol Haghani","Mehrdad Rostami","Yuefeng Li"],"meta":["September 2020Journal of King Saud University - Computer and Information Sciences","DOI:10.1016/j.jksuci.2020.08.013"],"references":["343206406_Integration_of_multi-objective_PSO_based_feature_selection_and_node_centrality_for_medical_datasets","331232741_Community_detection_in_attributed_networks_considering_both_structural_and_attribute_similarities_two_mathematical_programming_approaches","329526066_Community_Detection_in_Complex_Networks_by_Detecting_and_Expanding_Core_Nodes_Through_Extended_Local_Similarity_of_Nodes","329219593_A_new_local_and_multidimensional_ranking_measure_to_detect_spreaders_in_social_networks","325228380_Efficiently_summarizing_attributed_diffusion_networks","343110745_Community_detection_in_node-attributed_social_networks_A_survey","338603587_Community_Detection_in_Attributed_Social_Networks_A_Unified_Weight-Based_Model_and_Its_Regimes","334527108_Community_detection_with_the_Label_Propagation_Algorithm_A_survey","332388658_SCE_Subspace-based_core_expansion_method_for_community_detection_in_complex_networks","329076312_A_Link-Based_Similarity_for_Improving_Community_Detection_Based_on_Label_Propagation_Algorithm"]}