{"id":"344054538_Acoustic-Decoy_Detection_of_Adversarial_Examples_through_Audio_Modification_on_Speech_Recognition_System","abstract":"Deep neural networks (DNNs) display good performance in the domains of recognition and prediction, such as on tasks of image recognition, speech recognition, video recognition, and pattern analysis. However, adversarial examples, created by inserting a small amount of noise into the original samples, can be a serious threat because they can cause misclassification by the DNN. Adversarial examples have been studied primarily in the context of images, but their effect in the audio context is now drawing considerable interest as well. For example, by adding a small distortion to an original audio sample, imperceptible to humans, an audio adversarial example can be created that humans hear as error-free but that causes misunderstanding by a machine. Therefore, it is necessary to create a method of defense for resisting audio adversarial examples. In this paper, we propose an acoustic-decoy method for detecting audio adversarial examples. Its key feature is that it adds well-formalized distortions using audio modification that are sufficient to change the classification result of an adversarial example but do not affect the classification result of an original sample. Experimental results show that the proposed scheme can detect adversarial examples by reducing the similarity rate for an adversarial example to 6.21%, 1.27%, and 0.66% using low-pass filtering (with 12 dB roll-off), 8-bit reduction, and audio silence removal techniques, respectively. It can detect an audio adversarial example with a success rate of 97% by performing a comparison with the initial audio sample.","authors":["Hyun Kwon","Hyunsoo Yoon","Ki-Woong Park"],"meta":["September 2020Neurocomputing 417","DOI:10.1016/j.neucom.2020.07.101"],"references":["336910632_Robustness_of_Adversarial_Attacks_in_Sound_Event_Classification","303886059_Deep_learning_for_human_part_discovery_in_images","340114229_Temporarily-Aware_Context_Modeling_Using_Generative_Adversarial_Networks_for_Speech_Activity_Detection","338605085_Novel_Defense_Method_against_Audio_Adversarial_Example_for_Speech-to-Text_Transcription_Neural_Networks","337097978_POSTER_Detecting_Audio_Adversarial_Example_through_Audio_Modification","322328868_Audio_Adversarial_Examples_Targeted_Attacks_on_Speech-to-Text","322029802_Spoofing_Detection_in_Automatic_Speaker_Verification_Systems_Using_DNN_Classifiers_and_Dynamic_Acoustic_Features","316899897_An_MFCC-Based_Speaker_Identification_System","308499836_High_accuracy_inertial_stabilization_via_Kalman_filter_based_disturbance_observer","306226844_Towards_Evaluating_the_Robustness_of_Neural_Networks"]}