{"id":"344005111_Stochastic_gradient_descent_for_hybrid_quantum-classical_optimization","abstract":"Within the context of hybrid quantum-classical optimization, gradient descent based optimizers typically require the evaluation of expectation values with respect to the outcome of parameterized quantum circuits. In this work, we explore the consequences of the prior observation that estimation of these quantities on quantum hardware results in a form of s t o c h a s t i c gradient descent optimization. We formalize this notion, which allows us to show that in many relevant cases, including VQE, QAOA and certain quantum classifiers, estimating expectation values with k measurement outcomes results in optimization algorithms whose convergence properties can be rigorously well understood, for any value of k . In fact, even using single measurement outcomes for the estimation of expectation values is sufficient. Moreover, in many settings the required gradients can be expressed as linear combinations of expectation values -- originating, e.g., from a sum over local terms of a Hamiltonian, a parameter shift rule, or a sum over data-set instances -- and we show that in these cases k -shot expectation value estimation can be combined with sampling over terms of the linear combination, to obtain ``doubly stochastic'' gradient descent optimizers. For all algorithms we prove convergence guarantees, providing a framework for the derivation of rigorous optimization results in the context of near-term quantum devices. Additionally, we explore numerically these methods on benchmark VQE, QAOA and quantum-enhanced machine learning tasks and show that treating the stochastic settings as hyper-parameters allows for state-of-the-art results with significantly fewer circuit executions and measurements.","authors":["Ryan Sweke","Frederik Wilde","Johannes Jakob Meyer","Maria Schuld"],"meta":["August 2020Quantum 4:314","DOI:10.22331/q-2020-08-31-314"],"references":["351300489_Robust_implementation_of_generative_modeling_with_parametrized_quantum_circuits","342441483_Quantum_Approximate_Optimization_Algorithm_Performance_Mechanism_and_Implementation_on_Near-Term_Devices","341302450_An_Adaptive_Optimizer_for_Measurement-Frugal_Variational_Algorithms","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336656301_Training_of_quantum_circuits_on_a_hybrid_quantum_computer","336628546_Parameterized_quantum_circuits_as_machine_learning_models","335975475_Tight_Dimension_Independent_Lower_Bound_on_the_Expected_Convergence_Rate_for_Diminishing_Step_Sizes_in_SGD","345598040_Supervised_Learning_with_Quantum_Computers","344648934_Noise-Assisted_Variational_Hybrid_Quantum-Classical_Optimization","337797833_Quantum_Supremacy_for_Simulating_A_Translation-Invariant_Ising_Spin_Model"]}