{"id":"344083251_Computational_Toxicology_Volume_II_Volume_II","abstract":"Rapid advances in computer science, biology, chemistry, and other disciplines are enabling powerful new computational tools and models for toxicology and pharmacology. These computational tools hold tremendous promise for advancing science, from streamlining drug efficacy and safety testing, to increasing the efficiency and effectiveness of risk assessment for environmental chemicals. Computational Toxicology provides biomedical and quantitative scientists with essential background, context, examples, useful tips, and an overview of current developments in the field. Divided into four sections, Volume I covers a wide array of methodologies and topics. Opening with an introduction to the field of computational toxicology and its current and potential applications, the volume continues with ’best practices’ in mathematical and computational modeling, followed by chemoinformatics and the use of computational techniques and databases to predict chemical properties and toxicity, as well as an overview of molecular dynamics. The final section is a compilation of the key elements and main approaches used in pharmacokinetic and pharmacodynamic modeling, including the modeling of absorption, compartment and non-compartmental modeling, physiologically based pharmacokinetic modeling, interspecies extrapolation, and population effects. Written in the successful Methods in Molecular Biology™ series format where possible, chapters include introductions to their respective topics, lists of the materials and software tools used, methods, and notes on troubleshooting.\nAuthoritative and easily accessible, Computational Toxicology will allow motivated readers to participate in this exciting field and undertake a diversity of realistic problems of interest.","authors":["Brad Reisfeld","Arthur N. Mayeno"],"meta":["January 2013Methods in molecular biology (Clifton, N.J.)","DOI:10.1007/978-1-62703-059-5","ISBN: 978-1-62703-058-8"],"references":[]}