{"id":"344072666_Generic_Tasks_for_Algorithms","abstract":"Due to its links to computer science (CS), teaching computational thinking (CT) often involves the handling of algorithms in activities, such as their implementation or analysis. Although there already exists a wide variety of different tasks for various learning environments in the area of computer science, there is less material available for CT. In this article, we propose so-called Generic Tasks for algorithms inspired by common programming tasks from CS education. Generic Tasks can be seen as a family of tasks with a common underlying structure, format, and aim, and can serve as best-practice examples. They thus bring many advantages, such as facilitating the process of creating new content and supporting asynchronous teaching formats. The Generic Tasks that we propose were evaluated by 14 experts in the field of Science, Technology, Engineering, and Mathematics (STEM) education. Apart from a general estimation in regard to the meaningfulness of the proposed tasks, the experts also rated which and how strongly six core CT skills are addressed by the tasks. We conclude that, even though the experts consider the tasks to be meaningful, not all CT-related skills can be specifically addressed. It is thus important to define additional tasks for CT that are detached from algorithms and programming.","authors":["Gregor Milicic","Sina Wetzel","Matthias Ludwig"],"meta":["September 2020Future Internet 12(9):152","DOI:10.3390/fi12090152"],"references":["344283782_Curricular_learning_with_MathCityMap_Creating_Theme-based_Math_Trails","342946063_Gifted_Students'_Use_of_Computational_Thinking_Skills_Approaching_a_Graph_Problem_A_Case_Study","339040166_Fostering_Program_Comprehension_in_Novice_Programmers_-_Learning_Activities_and_Learning_Trajectories","338188953_Not_the_same_a_text_network_analysis_on_computational_thinking_definitions_to_study_its_relationship_with_computer_programming","337963535_The_Missing_Link_to_Computational_Thinking","334780741_Evaluating_the_Effectiveness_of_Parsons_Problems_for_Block-based_Programming","341271469_Computational_Thinking_Test_for_Beginners_Design_and_Content_Validation","339510849_Runestone_A_Platform_for_Free_On-line_and_Interactive_Ebooks","334778735_From_Theory_Bias_to_Theory_Dialogue_Embracing_Cognitive_Situated_and_Critical_Framings_of_Computational_Thinking_in_K-12_CS_Education","326918245_Decomposition_A_K-8_Computational_Thinking_Learning_Trajectory"]}