{"id":"344032991_Transforming_machine_translation_a_deep_learning_system_reaches_news_translation_quality_comparable_to_human_professionals","abstract":"The quality of human translation was long thought to be unattainable for computer translation systems. In this study, we present a deep-learning system, CUBBITT, which challenges this view. In a context-aware blind evaluation by human judges, CUBBITT significantly outperformed professional-agency English-to-Czech news translation in preserving text meaning (translation adequacy). While human translation is still rated as more fluent, CUBBITT is shown to be substantially more fluent than previous state-of-the-art systems. Moreover, most participants of a Translation Turing test struggle to distinguish CUBBITT translations from human translations. This work approaches the quality of human translation and even surpasses it in adequacy in certain circumstances.This suggests that deep learning may have the potential to replace humans in applications where conservation of meaning is the primary aim. The quality of human language translation has been thought to be unattainable by computer translation systems. Here the authors present CUBBITT, a deep learning system that outperforms professional human translators in retaining text meaning in English-to-Czech news translation, and validate the system on English-French and English-Polish language pairs.","authors":["Martin Popel","Markéta Tomková","Jakub Tomek","Łukasz Kaiser"],"meta":["September 2020Nature Communications 11(1):4381","DOI:10.1038/s41467-020-18073-9"],"references":["334117688_Attaining_the_Unattainable_Reassessing_Claims_of_Human_Parity_in_Neural_Machine_Translation","329931912_Has_Machine_Translation_Achieved_Human_Parity_A_Case_for_Document-level_Evaluation","328929083_Findings_of_the_2018_Conference_on_Machine_Translation_WMT18","335781359_Findings_of_the_2019_Conference_on_Machine_Translation_WMT19","334117985_Findings_of_the_2018_Conference_on_Machine_Translation_WMT18","334117761_CUNI_Transformer_Neural_MT_System_for_WMT18","334116544_The_University_of_Edinburgh's_Submissions_to_the_WMT18_News_Translation_Task","334115579_A_Call_for_Clarity_in_Reporting_BLEU_Scores","334115413_Unsupervised_Statistical_Machine_Translation","334114972_Getting_Gender_Right_in_Neural_Machine_Translation"]}