{"id":"344031796_How_do_Lawyers_Engineer_and_Develop_LegalTech_Projects_A_Story_of_Opportunities_Platforms_Creative_Rationalities_and_Strategies","abstract":"Over the last 15 years, the working context of lawyers has undergone many changes. Evolving in an increasingly competitive, deregulated, and globalized market, they are subject to higher tax pressure while being exposed to unbridled technological innovation. Indeed, a growing number of entrepreneurs are using digital solutions to provide online legal services that are supposed to be faster and cheaper. If many of them are nonlawyer legal entrepreneurs, many lawyers are also engineering innovative projects and launching their own start-up companies, known as “LegalTech” or “LawTech.” However, few studies—or none to our limited knowledge—provide an empirically grounded analysis of such projects, leaving some questions unanswered. Who are these entrepreneurial lawyers? How and why do they engineer and develop LegalTech projects? How do they challenge the legal profession? To answer these questions, this article draws on a qualitative study of three contrasted start-ups Belgian lawyers have recently developed. The research methodology combines gray and scientific literature reviews, web-document (hereafter “manifestos”) analysis, and semi-directive interviews led with the start-up’s founders (n = 5), the Bar Association’s representatives (n = 3), and some members of the main Belgian LegalTech network (n = 4).","authors":["Christophe Dubois"],"meta":["September 2020Law Technology and Humans 2(1)","DOI:10.5204/lthj.v3i1.1558"],"references":["338952853_The_Use_of_Technology_by_Gold_Coast_Legal_Practitioners","337578288_Towards_the_Uberisation_of_Legal_Practice","337574874_The_Professions'_Engagements_with_LawTech_Narratives_and_Archetypes_of_Future_Law","326201815_On_Open_Innovation_Platforms_and_Entrepreneurship","339379394_Le_seuil_de_l'action_La_decision_prealable_dans_l'histoire_des_projets","336215657_L'incubateur_du_Barreau_de_Paris_un_dispositif_d'accompagnement_entrepreneurial_dedie_a_l'innovation_juridique","331097271_Shaping_the_Future_of_the_Fourth_Industrial_Revolution","330695774_The_System_of_Professions_An_Essay_on_the_Division_of_Expert_Labor","327408735_Prison_Governors_as_Policymakers_Phronetic_Practices_as_Enacted_Knowledge","326545498_Digitalization_of_Professional_Services_The_Case_of_Value_Creation_in_Virtual_Law_Firms"]}