{"id":"344198148_On_the_impact_of_spatio-temporal_granularity_of_traffic_conditions_on_the_quality_of_pickup_and_delivery_optimal_tours","abstract":"Optimizing the duration of delivery tours is a crucial issue in urban logistics. In most cases, travel times between locations are considered as constant for the whole optimization horizon. Making these travel times time-dependent is particularly relevant in real urban traffic environments as traffic conditions and thus travel speeds vary according to the time of the day. In this paper, we review the literature on time-dependent routing problems, with a specific focus on benchmarks and performance criteria used to experimentally evaluate the interest of exploiting time-dependent data, showing the lack of studies on the impact of spatio-temporal features of the benchmark on solutions. Hence, we introduce a new benchmark produced from a realistic traffic flow micro-simulation of Lyon city, allowing us to consider different levels of spatial granularity (i.e., number of sensors used to measure traffic conditions) and temporal granularity (i.e., frequency of measures). Finally, we experimentally evaluate the impact of the spatio-temporal granularity on the quality of solutions for different classical problems, including the traveling salesman problem, the pickup and delivery problem, and the dial-a-ride problem.","authors":["Omar Rifki","Nicolas Chiabaut","Christine Solnon"],"meta":["October 2020Transportation Research Part E Logistics and Transportation Review 142(20)","DOI:10.1016/j.tre.2020.102085"],"references":["330506923_Dynamic_Discretization_Discovery_for_Solving_the_Time_Dependent_Traveling_Salesman_Problem_with_Time_Windows","341440225_Adaptive_large_neighborhood_search_for_the_time-dependent_profitable_pickup_and_delivery_problem_with_time_windows","329743722_Comparison_of_Traffic_Forecasting_Methods_in_Urban_and_Suburban_Context","328797707_Time-dependent_asymmetric_traveling_salesman_problem_with_time_windows_Properties_and_an_exact_algorithm","326746678_Optimizing_for_total_costs_in_vehicle_routing_in_urban_areas","326419331_Perimeter_Control_as_an_Alternative_to_Dedicated_Bus_Lanes_A_Case_Study","319808966_The_Traveling_Salesman_Problem","318196246_An_Integer_Programming_approach_for_the_Time-Dependent_Traveling_Salesman_Problem_with_Time_Windows","284850805_Fastest_paths_in_time-dependent_networks_for_intelligent_vehicle-highway_systems_application","284145305_Discussion_of_traffic_stream_measurements_and_definitions"]}