{"id":"344188877_Etude_lexicale_et_areale_des_designations_du_pissenlit_en_domaine_gallo-roman_de_France","abstract":"Résumé : Depuis 2015 nous participons au projet ANR « ECLATS ˗ Extraction automatisée des Contenus géoLinguistiques d'ATlas et analyse Spatiale : application à la Dialectologie » (ANR-15-CE-380002). Ce projet a pour objectifs de valoriser les atlas linguistiques anciens, tels que l'Atlas Linguistique de la France (ALF), de faciliter l'exploitation et la diffusion des cartes de l'ALF, de définir des modèles combinant les dimensions linguistiques, spatiales et temporelles pour représen-ter les données géo-linguistiques et enfin de proposer des outils permettant le traitement et la géo-visualisation de ces données. Dans le cadre de ce projet, nous avons effectué le traitement lexical et aréal des désignations du pissenlit à partir de la carte ALF n°1022. Nous proposons ici de présenter les résultats de nos recherches. Abstract: Since 2015 we have participated in the ANR project \"ECLATS ˗ Automated Extraction of Geolinguistic Atlas Content and Spatial Analysis: Application to Dialectology\" (ANR-15-CE-380002). The aim of this project is to enhance the value of ancient linguistic atlases, such as The Linguistic Atlas of France (ALF), to facilitate the exploitation and dissemination of ALF maps, to define models combining linguistic and spatial dimensions to represent geo-linguistic data and finally to propose tools allowing the processing and geo-visualization of these data. As a part of this project, we have carried out the lexical and areal analysis of the dandelion designations in the Gallo-Romance area of France, ALF map n°1022. Here we present the results of our research and the tools used. Chauvin-Payan et al.","authors":["Carole Chauvin-Payan","Maeva Seffar","Philippe Genoud","Clément Chagnaud"],"meta":["October 2020","DOI:10.25364/19.2020.4.4","Project: Projet ANR ECLATS"],"references":["249955410_Magico-Religious_Motivations_in_European_Dialects_A_Contribution_to_Archaeolinguistics","242132209_DIALECTOLOGIE_ANTHROPOLOGIE_CULTURELLE_ARCHEOLOGIE_VERS_UN_NOUVEL_HORIZON_CHRONOLOGIQUE_POUR_LA_FORMATION_DES_DIALECTES_EUROPEENS","321325824_ShinyDialect_a_cartographic_tool_for_spatial_interpolation_of_geolinguistic_data","308323200_Des_dialectes_au_langage_Une_archeologie_du_sens","278746678_Analyse_etymologique_semantique_et_cognitive_des_designations_de_la_flore_sauvage_en_roumain","271015291_Romanisches_Etymologisches_Worterbuch","36907552_Structures_etymologiques_du_lexique_francais"]}