{"id":"344148229_Cartographic_Design_as_Visual_Storytelling_Synthesis_and_Review_of_Map-Based_Narratives_Genres_and_Tropes","abstract":"In this article, I review considerations and techniques for approaching cartographic design as visual storytelling. Stories, like maps, are a method for documenting and explaining, for meaningfully abstracting our experiences, for communicating and sharing, and for asserting a particular worldview. I argue that visual storytelling offers an entry point for hybridization in cartography, uniting technology with praxis, product with process, and design with critique while opening rich new avenues for transdisciplinary research and design. I begin by introducing influences on map-based visual storytelling and review ten recurring themes that make visual storytelling different from traditional perspectives on cartographic design. I then offer three of potentially many ways to articulate and organize the design space for map-based visual storytelling: foundational narrative elements and their adaptation to geographic phenomena and processes, visual storytelling genres delineating different story experiences, and visual storytelling tropes used to advance narratives across text, maps, images, and other multimedia. I conclude with a call for future research on visual storytelling in cartography, including visual design, visual ethics, and visual literacy.","authors":["Robert E. Roth"],"meta":["August 2021Cartographic Journal The 58(1):83-114","DOI:10.1080/00087041.2019.1633103"],"references":["334555644_How_to_Play_with_Maps","327791405_Dynamic_Design_Documents_for_supporting_applied_visualization","348618039_Simians_cyborgs_and_women_The_reinvention_of_nature","345637498_Web_Cartography_Map_Design_for_Interactive_and_Mobile_Devices","340270351_Data_Feminism","337071794_Mapping_Syrian_Refugee_Border_Crossings_A_Feminist_Approach","330975354_Story-telling_maps_generated_from_semantic_representations_of_events","330526673_Maps_with_the_News_The_Development_of_American_Journalistic_Cartography","329459003_Spatiotemporal_Representation","326115711_Connecting_Real_and_Imaginary_Places_through_Geospatial_Technologies_Examples_from_Set-Jetting_and_Art-Oriented_Tourism"]}