{"id":"344146609_What_Science_and_STEM_Teachers_Can_Learn_from_COVID-19_Harnessing_Data_Science_and_Computer_Science_through_the_Convergence_of_Multiple_STEM_Subjects","abstract":"The COVID-19 pandemic is a historic global event that has extended to\nall parts of society and shaken the core of what we know and how we\nlive. During this pandemic, the work of STEM professionals has taken\ncenter stage. Through our close observations of how the events of the\npandemic have been unfolding across the globe, we propose an\ninstructional framework that emerged out of the real-time responses\nof STEM professionals to explain the pandemic and find solutions. This\nframework centers on data science, computer science, and multidisciplinary convergence as tools for engaging K-12 students in complex\nsocietal problems like the pandemic. In this theoretical position statement, we propose our framework that is grounded in three areas: (a)\ndata science and computer science, (b) multidisciplinary convergence,\nand (c) orientation and support for science teachers specifically and\nSTEM teachers broadly to prepare them for fundamentally different\nroles. Using data and computer models, students find phenomena and\nproblems compelling, appreciate the power and potential of STEM\nsubjects, and explain phenomena and design solutions to real-world\nproblems. Then, through multidisciplinary convergence, individuals\nand societies integrate STEM disciplinary knowledge and practices to\nmake informed decisions and take responsible actions. As STEM teachers engage students in explaining phenomena and solving complex\nsocietal problems with data science and computer science through the\nconvergence of multiple STEM subjects, teachers take on roles that are\nfundamentally different from the roles they have traditionally played.","authors":["Okhee Lee","Todd Campbell"],"meta":["September 2020Journal of Science Teacher Education 31(2):1-13","DOI:10.1080/1046560X.2020.1814980","Project: Explaining and Solving Societally Pressing Phenomena and Problems: Data Science, Computer Science, and Convergence"],"references":["341714510_Science_Teacher_Education_in_the_Times_of_the_COVID-19_Pandemic","331981680_Opening_up_curricula_to_redistribute_epistemic_agency_A_framework_for_supporting_science_teaching","282457974_Describing_Science_Practice_in_Learning_Settings","271658874_Sandboxes_for_Model-Based_Inquiry","263351604_Exploring_Shifts_in_Middle_School_Learners'_Modeling_Activity_While_Generating_Drawings_Animations_and_Computational_Simulations_of_Molecular_Diffusion","343413322_What_Does_a_National_Survey_Tell_Us_about_Progress_toward_the_Vision_of_the_NGSS","336075467_Infrastructuring_Teacher_Learning_about_Equitable_Science_Instruction","332286368_Understanding_the_Big_Picture_for_Science_Teacher_Education_The_2018_NSSME","301718410_What_We_Call_Misconceptions_May_Be_Necessary_Stepping-Stones_Toward_Making_Sense_of_the_World","282250792_Educational_Implications_of_Choosing_Practice_to_Describe_Science_in_the_Next_Generation_Science_Standards"]}