{"id":"344166630_Probing_the_universality_of_topological_defect_formation_in_a_quantum_annealer_Kibble-Zurek_mechanism_and_beyond","abstract":"The number of topological defects created in a system driven through a quantum phase transition exhibits a power-law scaling with the driving time. This universal scaling law is the key prediction of the Kibble-Zurek mechanism (KZM), and testing it using a hardware-based quantum simulator is a coveted goal of quantum information science. Here we provide such a test using quantum annealing. Specifically, we report on extensive experimental tests of topological defect formation via the one-dimensional transverse-field Ising model on two different D-Wave quantum annealing devices. We find that the quantum simulator results can indeed be explained by the KZM for open-system quantum dynamics with phase-flip errors, with certain quantitative deviations from the theory likely caused by factors such as random control errors and transient effects. In addition, we probe physics beyond the KZM by identifying signatures of universality in the distribution and cumulants of the number of kinks and their decay, and again find agreement with the quantum simulator results. This implies that the theoretical predictions of the generalized KZM theory, which assumes isolation from the environment, applies beyond its original scope to an open system. We support this result by extensive numerical computations. To check whether an alternative, classical interpretation of these results is possible, we used the spin-vector Monte Carlo model, a candidate classical description of the D-Wave device. We find that the degree of agreement with the experimental data from the D-Wave annealing devices is better for the KZM, a quantum theory, than for the classical spin-vector Monte Carlo model, thus favoring a quantum description of the device. Our work provides an experimental test of quantum critical dynamics in an open quantum system, and paves the way to new directions in quantum simulation experiments.","authors":["Yuki Bando","Yuki Susa","Hiroki Oshiyama","Naokazu Shibata"],"meta":["September 2020Physical Review Research 2(3)","DOI:10.1103/PhysRevResearch.2.033369","Project: Beyond the Kibble-Zurek Mechanism"],"references":["342257821_Full_Counting_Statistics_of_Topological_Defects_after_Crossing_a_Phase_Transition","339744009_Experimentally_testing_quantum_critical_dynamics_beyond_the_Kibble-Zurek_mechanism","337600583_Analog_errors_in_quantum_annealing_doom_and_hope","337357784_Dynamics_of_reverse_annealing_for_the_fully_connected_p_-spin_model","333497058_A_double-slit_proposal_for_quantum_annealing","342113064_Universal_Anti-Kibble-Zurek_Scaling_in_Fully_Connected_Systems","342020442_Limitations_of_error_corrected_quantum_annealing_in_improving_the_performance_of_Boltzmannmachines","340365183_Perspectives_of_quantum_annealing_Methods_and_implementations","339805208_Scaling_and_Diabatic_Effects_in_Quantum_Annealing_with_a_D-Wave_Device","333803534_Quantum_Annealing_of_Pure_and_Random_Ising_Chains_Coupled_to_a_Bosonic_Environment"]}