{"id":"344194737_Software_Engineering_Methodologies_A_Review_of_the_Waterfall_Model_and_Object-_Oriented_Approach","abstract":"This paper discusses two main software engineering methodologies to system development, the waterfall model and the object-oriented approach. A review of literature reveals that waterfall model uses linear approach and is only suitable for sequential or procedural design. In waterfall, errors can only be detected at the end of the whole process and it may be difficult going back to repeat the entire process because the processes are sequential. Also, software based on waterfall approach is difficult to maintain and upgrade due to lack of integration between software components. On the other hand, the Object Oriented approach enables software systems to be developed as integration of software objects that work together to make a holistic and functional system. The software objects are independent of each other, allowing easy upgrading and maintenance of software codes. The paper also highlighted the merits and demerits of each of the approaches. This work concludes with the appropriateness of each approach in relation to the complexity of the problem domain.","authors":["Adetokunbo Adenowo","Basirat A Adenowo"],"meta":["September 2020International Journal of Scientific and Engineering Research 4(7):427-434"],"references":["258959806_A_Comparison_Between_Five_Models_Of_Software_Engineering","237728174_ISSUES_OF_STRUCTURED_VS_OBJECT-ORIENTED_METHODOLOGY_OF_SYSTEMS_ANALYSIS_AND_DESIGN","224611794_About_software_engineering_frameworks_and_methodologies","221179085_Requirements_Elicitation_and_Elicitation_Technique_Selection_A_Model_for_Two_Knowledge-Intensive_Software_Development_Processes","336251012_Software_Engineering_A_Practitioner's_Approach_9th_Edition","234782764_Rapid_Development_Taming_Wild_Software_Schedules","222712640_Applying_UML_and_Patterns_An_Introduction_to_Object-Oriented_Analysis_and_Design_and_Iterative_Development","220694850_Software_engineering_-_theory_and_practice_3_ed","215863714_UML_Distilled_A_brief_Guide_to_the_Standard_Object_Modeling_Language","31736315_An_Introduction_to_Object-Oriented_Systems_Analysis_and_Design_with_UML_and_the_Unified_Process_SR_Schach"]}