{"id":"344269091_SOS_20_an_evolutionary_approach_for_SOS_algorithm","abstract":"With the shortcomings on the solution given for most-recent optimization problems, decision-makers from different fields yearn the existence of tenacious breakthrough. In fact, they all shared the same obligation to optimize work efficiency, whether to minimize cost, consumption or to maximize the profit acquirement. Metaheuristic search is the more-advanced method proven to be useful for difficult optimization tasks. Moreover, development records also signalized rapid development of these algorithms, contributing several notable and powerful optimization algorithms. Among them, Symbiotic Organisms Search (SOS) received noticeable attention due to its simplicity and also its parameter-less nature. Nonetheless, several considerable issues are still challenging for further development. For instance, local optima and premature convergence issues found from any improper and inefficiency computational procedure on higher dimensional problems. Also, exploitation and exploration trade-off is another essential issue involving stability for optimal performance. In that case, this work proposed a new evolutionary approach named SOS 2.0. There are two distinct features associated with the evolution: Self-Parameter-Updating (SPU) technique and chaotic maps sequencing. Both features are integrated for a better balance of exploration and exploitation in which SPU focuses on exploration and chaotic map focuses on exploitation instead. This work also applied benchmarks function tests and engineering design optimization problem in advance for validation purpose of the performance. The experimental results showed that SOS 2.0 delivers not only better performance from its predecessor and also several recent SOS modifications which can be concluded as one successive approach for better SOS algorithm, but also enhances the computation efficiency and capability of searching optimal solution.","authors":["Min-Yuan Cheng","Richard Gosno"],"meta":["December 2021Evolutionary Intelligence 14(4):1-19","DOI:10.1007/s12065-020-00476-8"],"references":["333836855_A_hybridization_of_cuckoo_search_and_particle_swarm_optimization_for_solving_nonlinear_systems","331262839_A_survey_on_particle_swarm_optimization_with_emphasis_on_engineering_and_network_applications","325228533_Survey_on_evolutionary_computation_methods_for_cybersecurity_of_mobile_ad_hoc_networks","324416831_Automatic_estimation_of_differential_evolution_parameters_using_Hidden_Markov_Models","322028898_Chaos_Embedded_Symbiotic_Organisms_Search_Technique_for_Optimal_FACTS_Device_Allocation_for_Voltage_Profile_and_Security_Improvement","318108108_An_orthogonal_parallel_symbiotic_organism_search_algorithm_embodied_with_augmented_Lagrange_multiplier_for_solving_constrained_optimization_problems","345606868_Handbook_of_Metaheuristics","329873153_Risk-based_maintenance_strategy_for_deteriorating_bridges_using_a_hybrid_computational_intelligence_technique_a_case_study","320089659_Energy-aware_discrete_symbiotic_organism_search_optimization_algorithm_for_task_scheduling_in_a_cloud_environment","317393545_Discrete_Symbiotic_Organisms_Search_Algorithm_for_Travelling_Salesman_Problem","316230448_Design_of_planar_concentric_circular_antenna_arrays_with_reduced_side_lobe_level_using_symbiotic_organisms_search","316114594_A_novel_chaos-integrated_symbiotic_organisms_search_algorithm_for_global_optimization","313681193_Symbiotic_organism_search_algorithm_applied_to_load_frequency_control_of_multi-area_power_system","313706874_Adaptation_in_natural_and_artificial_systems","313465431_Multi-objective_Symbiotic_Search_Algorithm_Approaches_for_Electromagnetic_Optimization"]}