{"id":"344238556_Sociotechnical_Agendas_Reviewing_Future_Directions_for_Energy_and_Climate_Research","abstract":"The field of science and technology studies (STS) has introduced and developed a “sociotechnical” perspective that has been taken up by many disciplines and areas of inquiry. The aims and objectives of this study are threefold: to interrogate which sociotechnical concepts or tools from STS are useful at better understanding energy-related social science, to reflect on prominent themes and topics within those approaches, and to identify current research gaps and directions for the future. To do so, the study builds on a companion project, a systematic analysis of 262 articles published from 2009 to mid-2019 that categorized and reviewed sociotechnical perspectives in energy social science. It identifies future research directions by employing the method of “co-creation” based on the reflections of sixteen prominent researchers in the field in late 2019 and early 2020. Drawing from this co-created synthesis, this study first identifies three main areas of sociotechnical perspectives in energy research (sociotechnical systems, policy, and expertise and publics) with 15 topics and 39 subareas. The study then identifies five main themes for the future development of sociotechnical perspectives in energy research: conditions of systematic change; embedded agency; justice, power, identity and politics; imaginaries and discourses; and public engagement and governance. It also points to the recognized need for pluralism and parallax: for research to show greater attention to demographic and geographical diversity; to stronger research designs; to greater theoretical triangulation; and to more transdisciplinary approaches.","authors":["Benjamin Sovacool","David J. Hess","Sulfikar Amir","Frank W. Geels"],"meta":["September 2020Energy Research & Social Science 70:1-35","DOI:10.1016/j.erss.2020.101617"],"references":["342602411_Sociotechnical_matters_Reviewing_and_integrating_science_and_technology_studies_with_energy_social_science","339933635_Towards_impactful_energy_justice_research_Transforming_the_power_of_academic_engagement","339565020_Let's_focus_more_on_negative_trends_A_comment_on_the_transitions_research_agenda","339389289_Sociotechnical_imaginaries_of_low-carbon_waste-energy_futures_UK_techno-market_fixes_displacing_public_accountability","338456134_Expanding_the_scope_and_implications_of_energy_research_A_guide_to_key_themes_and_concepts_from_the_Social_Sciences_and_Humanities","338277478_Empowering_the_Great_Energy_Transition_Policy_for_a_Low-Carbon_Future","344520256_Nuclear_Politics_Energy_and_the_State_in_the_United_States_Sweden_and_France","339606251_Micro-foundations_of_the_multi-level_perspective_on_socio-technical_transitions_Developing_a_multi-dimensional_model_of_agency_through_crossovers_between_social_constructivism_evolutionary_economics_a","338947584_Connected_by_oil_A_framework_to_analyze_the_connected_sustainability_histories_of_the_Niger_and_Rhine_Deltas_1950-2015","337978951_Geographies_of_transition-From_topical_concerns_to_theoretical_engagement_A_commentary_on_the_transitions_research_agenda"]}