{"id":"344280351_On_speeding_up_factoring_with_quantum_SAT_solvers","abstract":"There have been several efforts to apply quantum SAT solving methods to factor large integers. While these methods may provide insight into quantum SAT solving, to date they have not led to a convincing path to integer factorization that is competitive with the best known classical method, the Number Field Sieve. Many of the techniques tried involved directly encoding multiplication to SAT or an equivalent NP-hard problem and looking for satisfying assignments of the variables representing the prime factors. The main challenge in these cases is that, to compete with the Number Field Sieve, the quantum SAT solver would need to be superpolynomially faster than classical SAT solvers. In this paper the use of SAT solvers is restricted to a smaller task related to factoring: finding smooth numbers, which is an essential step of the Number Field Sieve. We present a SAT circuit that can be given to quantum SAT solvers such as annealers in order to perform this step of factoring. If quantum SAT solvers achieve any asymptotic speedup over classical brute-force search for smooth numbers, then our factoring algorithm is faster than the classical NFS.","authors":["Michele Mosca","Joao Marcos Vensi Basso","Sebastian R Verschoor"],"meta":["September 2020Scientific Reports 10(1):15022","DOI:10.1038/s41598-020-71654-y"],"references":["225539588_Factoring_integers_with_the_number_field_sieve","225158770_The_number_field_sieve","221590545_The_Number_Field_Sieve","320944174_Measurement-driven_quantum_computing_Performance_of_a_3-SAT_solver","318145287_A_Low-Resource_Quantum_Factoring_Algorithm","303901008_Learning_Rate_Based_Branching_Heuristic_for_SAT_Solvers","220617297_Strengths_and_Weakness_of_Quantum_Computing","28641142_Factoring_Integers_with_Elliptic_Curves","3084269_Solving_sparse_linear_equations_over_finite_fields","2818380_Polynomial-Time_Algorithms_For_Prime_Factorization_And_Discrete_Logarithms_On_A_Quantum_Computer","2381440_Circuits_for_Integer_Factorization_A_Proposal","2201607_Fast_quantum_mechanical_algorithm_for_database_search"]}