{"id":"344227884_Automated_Assessment_in_Programming_Courses_A_Case_Study_during_the_COVID-19_Era","abstract":"The COVID-19 pandemic imposed in many countries, in the short term, the interruption of face-to-face teaching activities and, in the medium term, the existence of a ‘new normal’, in which teaching methods should be able to switch from face-to-face to remote overnight. However, this flexibility can pose a great difficulty, especially in the assessment of practical courses with a high student–teacher ratio, in which the assessment tools or methods used in face-to-face learning are not ready to be adopted within a fully online environment. This article presents a case study describing the transformation of the assessment method of a programming course in higher education to a fully online format during the COVID-19 pandemic, by means of an automated student-centered assessment tool. To evaluate the new assessment method, we studied students’ interactions with the tool, as well as students’ perceptions, which were measured with two different surveys: one for the programming assignments and one for the final exam. The results show that the students’ perceptions of the assessment tool were highly positive: if using the tool had been optional, the majority of them would have chosen to use it without a doubt, and they would like other courses to involve a tool like the one presented in this article. A discussion about the use of this tool in subsequent years in the same and related courses is also presented, analyzing the sustainability of this new assessment method. View Full-Text","authors":["Enrique Barra","Sonsoles López-Pernas","Alvaro Alonso","Juan Fernando Sánchez-Rada"],"meta":["September 2020Sustainability 12(18):7451","DOI:10.3390/su12187451"],"references":["341398246_La_evaluacion_online_en_la_educacion_superior_en_tiempos_de_la_COVID-19","338105863_AMMIL_A_methodology_for_developing_video-based_learning_courses","336413265_Effect_of_an_Instructor-Centered_Tool_for_Automatic_Assessment_of_Programming_Assignments_on_Students'_Perceptions_and_Performance","325446924_The_effect_of_automatic_assessment_on_novice_programming_Strengths_and_limitations_of_existing_systems","321381327_Designing_Authentic_Learning_Activities_to_Train_Pre-Service_Teachers_About_Teaching_Online","305081685_Towards_a_Systematic_Review_of_Automated_Feedback_Generation_for_Programming_Exercises","357700298_Tools_and_Techniques_for_Teaching_Computer_Programming_A_Review","333954729_Making_the_Most_of_College_Students_Speak_Their_Minds","327563486_Continuous_assessment_in_a_computer_programming_course_supported_by_a_software_tool","305257568_Automatic_Submission_and_Administration_of_Programming_Assignments"]}