{"id":"344266385_Towards_Directing_Convolutional_Neural_Networks_Using_Computational_Geometry_Algorithms_Application_to_Handwritten_Arabic_Character_Recognition","abstract":"Suppose we want to classify a query item Q with a classification model that consists of a large set of predefined classes L and suppose we have a knowledge that indicates to us that the target class of Q belongs to a small subset from L. Naturally, this filtering will improve the accuracy of any classifier, even random guessing. Based on this principle, this paper proposes a new classification approach using convolutional neural networks (CNN) and computational geometry (CG) algorithms. The approach is applied and tested on the recognition of isolated handwritten Arabic characters (IHAC). The main idea of the proposed approach is to direct CNN using a filtering layer, which reduces the set of possible classes for a query item. The rules of the relative neighborhood graph (RNG) and Gabriel's graph (GG) are combined for this purpose. The choice of RNG-GG was based on its great capacity to correctly reduce the list of possible classes. This capacity is measured by a new indicator that we call \"the appearance rate\". In recent years and due to strong data growth, CNNs have performed classification tasks very well. On the contrary, CG algorithms yield limited results in huge datasets and suffer from high computational time, but they generally reach high appearance rates and do not require any training phase. Consequently, the proposed approach uses an optimal architecture to exploit the advantages of the two techniques and overcome the computational time issue. Experiments carried out on the IFHCDB database have shown that the suggested approach outperforms a normal CNN and yield satisfactory results.","authors":["Mohsine Elkhayati","Youssfi Elkettani"],"meta":["September 2020Advances in Science Technology and Engineering Systems Journal 5(5):137-147","DOI:10.25046/aj050519","Project: Arabic handwriting recognition using deep learning algorithms"],"references":["342514780_Arabic_handwriting_recognition_system_using_convolutional_neural_network","334293688_Recognition_of_Urdu_Handwritten_Characters_Using_Convolutional_Neural_Network","323839684_ARABIC_HANDWRITTEN_CHARACTER_RECOGNITION_BASED_ON_DEEP_CONVOLUTIONAL_NEURAL_NETWORKS","321950695_Spatial_and_Textural_Aspects_for_Arabic_Handwritten_Characters_Recognition","319501514_Arabic_Handwritten_Alphanumeric_Character_Recognition_Using_Very_Deep_Neural_Network","313891953_Arabic_Handwritten_Characters_Recognition_using_Convolutional_Neural_Network","311982601_Handwritten_Character_Recognition_Based_on_the_Specificity_and_the_Singularity_of_the_Arabic_Language","321029318_Investigation_on_Deep_Learning_for_Off-line_Handwritten_Arabic_Character_Recognition","314647251_Urdu_Nastaliq_Recognition_using_Convolutional-Recursive_Deep_Learning","308941304_Processing_Hyperspectral_Images"]}