{"id":"344215994_Tendinopathies_of_the_hip_and_pelvis_in_athletes_A_narrative_review","abstract":"Tendon disorders represent some of the most frequent musculoskeletal complaints worldwide. In the athletic population, tendinopathy could affect different anatomical districts. Tendons surrounding hip and pelvis are frequently involved due to overuse and high functional demands in the athletes. These disorders negatively impact on sport performance, since they are a long-lasting clinical condition requiring a multimodal management. Great trochanter pain syndrome, proximal hamstring tendinopathy, insertional adductor tendinopathy and ileopsoas tendinopathy are the most common clinical conditions involving tendon structures of the hip and pelvis. Due to the anatomical complexity of the region, the relationship with pelvic organs, the demographic and anthropometric characteristics of the athletes, the differential diagnosis between these musculoskeletal disorders and other diseases is often difficult to conduct and some therapeutic options are challenging. Modification of risk factors, changes in training protocols, some specific therapeutic exercise programs and rehabilitation procedures have been proposed as an efficient conservative management strategy, guarantying a complete recovery of athletic function. Surgical approaches are required in a specific subset of patients. This narrative literature review aims to summarize current understanding and areas of ongoing research about the clinical features, diagnostic keys and therapeutic options of the main clinical tendinopathies surrounding hip and pelvis.","authors":["Felice Sirico","Stefano Palermi","Bruno Massa","Bruno Corrado"],"meta":["September 2020","DOI:10.14198/jhse.2020.15.Proc3.25","Projects: TendinopathySport injuries rehabilitation & prevention"],"references":["342923269_External_Responsiveness_of_the_SuperOp_TM_Device_to_Assess_Recovery_After_Exercise_A_Pilot_Study","341913854_Uphill_walking_at_iso-efficiency_speeds","341909821_Guidelines_for_Physical_Activity-A_Cross-Sectional_Study_to_Assess_Their_Application_in_the_General_Population_Have_We_Achieved_Our_Goal","341651340_Effectiveness_of_Workplace_Yoga_Interventions_to_Reduce_Perceived_Stress_in_Employees_A_Systematic_Review_and_Meta-Analysis","335041155_Tendinopathy_Pathophysiology_Therapeutic_Options_and_Role_of_Nutraceutics_A_Narrative_Literature_Review","331356230_Proximal_Hamstring_Injuries_Management_of_Tendinopathy_and_Avulsion_Injuries","330907603_Sports_Activities_in_Obese_Teenagers_Improve_Social_Inclusion_and_Health","339686493_Effectiveness_of_Tai_Chi_on_Balance_Improvement_in_Type_2_Diabetes_Patients_A_Systematic_Review_and_Meta-Analysis","331566229_Leucocyte-Rich_Platelet-Rich_Plasma_Treatment_of_Gluteus_Medius_and_Minimus_Tendinopathy_A_Double-Blind_Randomized_Controlled_Trial_With_2-Year_Follow-up","331271622_Expert_opinion_diagnosis_and_treatment_of_proximal_hamstring_tendinopathy"]}