{"id":"344237890_Calidad_en_sitios_web_analisis_de_la_produccion_cientifica","abstract":"Existen diversos métodos y herramientas para la evaluación de la calidad web que se han propuesto durante los últimos años. Son instrumentos que tienen su origen tanto en el contexto académico como profesional. Algunos son de carácter generalista y permiten evaluar cualquier tipo de sitio web, mientras que otros están especializados en sectores específicos. Este trabajo presenta un análisis de la producción científica existente sobre esta materia, con el objetivo de identificar las publicaciones más relevantes, conocer cuáles son los principales autores, así como el ámbito temático de los sitios web en los que focalizan su quehacer. Basándose en una triangulación de métodos de revisión, se examinaron 716 trabajos publicados entre 2000 y 2018 en Scopus, Web of Science y otras bases de datos. Además de la información bibliográfica, se recolectó la cantidad de citas recibidas, para lo cual se utilizó Google Académico. También se categorizó el área del conocimiento al que pertenece cada autor según su afiliación. Entre los principales resultados se constata un creciente interés por la calidad web en una comunidad científica con presencia en más de 70 países. Sus autores provienen de variados dominios, siendo las ciencias de la computación, los negocios y la informática médica las que cuentan con mayor número de publicaciones. Los trabajos más citados corresponden a libros seminales de disciplinas relacionadas como la usabilidad, la arquitectura de información y la experiencia de usuario. En particular, a partir de 2007 aumenta el número de textos con instrumentos de evaluación para sitios de sectores específicos, como el educativo (33%), sanitario (27%) y comercial (21%). Se concluye que la calidad web es un campo de estudio en constante crecimiento, cada vez más especializado, y que ofrece amplias oportunidades de investigación.","authors":["Alejandro Morales Vargas","Rafael Pedraza-Jimenez","Lluís Codina"],"meta":["September 2020El Profesional de la Informacion 29(5):e290508"],"references":["351870034_SEO_Periodismo_y_Comunicacion_Conceptos_herramientas_y_procesos_para_optimizar_la_visibilidad_web_de_los_medios_digitales","271720859_WebQual_An_Instrument_for_Consumer_Evaluation_of_Web_Sites","268145006_A_Usability_Assistant_for_the_Heuristic_Evaluation_of_Interactive_Systems","249701316_Success_Factors_for_Destination_Marketing_Web_Sites_A_Qualitative_Meta-Analysis","236173541_Framework_for_a_global_quality_evaluation_of_a_website","340419433_Looking_for_the_Definition_of_Website_Quality","319449116_Factores_de_la_calidad_en_sitios_web_de_destinos_turisticos_Estado_de_la_cuestion","284981920_Use_the_eight_golden_rules_of_interface_design","240028443_Heuristics_for_User_Interface_Design","229067956_Designing_Web_Usability","226011044_Web_Usability_Principles_and_Evaluation_Methods","220017687_Web_Site_Usability_Design_and_Performance_Metrics","200086019_The_Design_of_Everyday_Things"]}