{"id":"344260891_Randomized_Incremental_Construction_of_Delaunay_Triangulations_of_Nice_Point_Sets","abstract":"Randomized incremental construction (RIC) is one of the most important paradigms for building geometric data structures. Clarkson and Shor developed a general theory that led to numerous algorithms which are both simple and efficient in theory and in practice. Randomized incremental constructions are usually space-optimal and time-optimal in the worst case, as exemplified by the construction of convex hulls, Delaunay triangulations, and arrangements of line segments. However, the worst-case scenario occurs rarely in practice and we would like to understand how RIC behaves when the input is nice in the sense that the associated output is significantly smaller than in the worst case. For example, it is known that the Delaunay triangulation of nicely distributed points in Ed or on polyhedral surfaces in E3 has linear complexity, as opposed to a worst-case complexity of Θ(n⌊d/2⌋) in the first case and quadratic in the second. The standard analysis does not provide accurate bounds on the complexity of such cases and we aim at establishing such bounds in this paper. More precisely, we will show that, in the two cases above and variants of them, the complexity of the usual RIC is O(nlogn), which is optimal. In other words, without any modification, RIC nicely adapts to good cases of practical value. At the heart of our proof is a bound on the complexity of the Delaunay triangulation of random subsets of ε-nets. Along the way, we prove a probabilistic lemma for sampling without replacement, which may be of independent interest.","authors":["Jean-Daniel Boissonnat","Olivier Devillers","Kunal Dutta","Marc Glisse"],"meta":["July 2021Discrete & Computational Geometry 66(4)","DOI:10.1007/s00454-020-00235-7"],"references":["299561781_Delaunay_Triangulations_of_Closed_Euclidean_d-Orbifolds","344484944_Randomized_Algorithms","319770318_Surface_reconstruction_by_Voronoi_filtering","314819071_Incremental_constructions_con_BRIO","314728767_A_fast_algorithm_for_well-spaced_points_and_approximate_delaunay_graphs","307712769_-entropy_and_-capacity_of_sets_in_functional_spaces","305978989_Random_tessellations_in_Rd","285321032_Uber_die_Bewegungsgruppen_der_n-dimensional_en_Euklidischen_Raume_mit_einem_endlichen_Fundamental_bereich","280688576_Smooth_surface_reconstruction_via_natural_neighbour_interpolation_of_distance_functions","266538696_Interface_area_edge_length_and_number_of_vertices_in_crystal_aggregates_with_random_nucleation"]}