{"id":"344276628_GAN-based_Enhanced_Deep_Subspace_Clustering_Networks","abstract":"In this paper, we propose two GAN-based enhanced deep subspace clustering approaches: deep subspace clustering via dual adversarial generative networks (DSC-DAG) and self-supervised deep subspace clustering with adversarial generative networks (S^2 DSC-AG). In DSC-DAG, the distributions of both the inputs and corresponding latent representations are learning via adversarial training simultaneously. Besides, there are two kinds of synthetical representations to facilitate the fine-tuning of the encoder module: the combinations of latent representations with certain random combination coefficients and the representations of real-like inputs derived from noise variables. In \nS^2 DSC-AG, a self-supervised information learning module substitutes for adversarial learning in the latent space, since both of them play the same role in learning discriminative latent representations. We analyze the connections between these methods and demonstrate their equivalences. We conduct extensive experiments on multiple real-world data sets against state-of-the-art subspace clustering methods in terms of accuracy, normalized mutual information and purity. Experimental results demonstrate the effectiveness and superiority of our proposed methods.","authors":["Zhiwen Yu","Zhongfan Zhang","Wenming Cao","Cheng Liu"],"meta":["September 2020IEEE Transactions on Knowledge and Data Engineering PP(99)","DOI:10.1109/TKDE.2020.3025301"],"references":["338506371_Self-Supervised_Convolutional_Subspace_Clustering_Network","319622759_Deep_Subspace_Clustering_Networks","318572189_Spectral_Normalization_for_Generative_Adversarial_Networks","316282839_Subspace_Clustering_by_Mixture_of_Gaussian_Regression","309207591_Structured_Sparse_Subspace_Clustering_A_Joint_Affinity_Learning_and_Subspace_Clustering_Framework","311609394_Scalable_Sparse_Subspace_Clustering_by_Orthogonal_Matching_Pursuit","311478461_Large-margin_metric_learning_for_constrained_partitioning_problems","309082521_Motion_Segmentation_Via_a_Sparsity_Constraint","308278474_ell_0_l_0_-Sparse_Subspace_Clustering","303948511_Reducing_Image_Compression_Artifacts_by_Structural_Sparse_Representation_and_Quantization_Constraint_Prior"]}