{"id":"344249077_Flower_Identification_and_Classification_using_Computer_Vision_and_Machine_Learning_Techniques","abstract":": Computer vision techniques plays an important role in extracting meaningful information from images. A process of extraction, analysis, and understanding of information from images may accomplished by an automated process using computer vision and machine learning techniques. The paper proposed a hybrid methodology using MKL-SVM with multi-label classification that is experimented on a dataset contained 25000 flower images of 102 different spices. Basic and morphology features including color, size, texture, petal type, petal count, disk flower, corona, aestivation of flower and flower class are extracted to increase the classification accuracy. Various classifiers are applied on extracted feature set and their performance are discussed. The result of MKL-SVM with multi-label classification is very promising with 76.92% as an accuracy rate. In brief, this paper attempts to explore a novel morphology for feature extraction and the applicability of symbolic representation schemes along with different classification strategies for effective multi-label classification of flower spices.","authors":["Sanskruti Patel","Isha Patel"],"meta":["September 2019International Journal of Engineering and Advanced Technology 8(6):277-285","DOI:10.35940/ijeat.E7555.088619"],"references":["345644353_Identification_of_jasmine_flower_Jasminum_sp_based_on_the_shape_of_the_flower_using_sobel_edge_and_k_-nearest_neighbour","344249453_Analysis_of_Various_Image_Segmentation_Techniques_for_Flower_Images","344249310_Analysis_of_Various_Image_Preprocessing_Techniques_for_Denoising_of_Flower_Images","329191674_A_Flower_Recognition_System_Based_On_Image_Processing_And_Neural_Networks","324250573_Automated_plant_species_identification-Trends_and_future_directions","329611251_Survey_on_image_segmentation_techniques","317162840_Image_Mining_for_Flower_Classification_by_Genetic_Association_Rule_Mining_Using_GLCM_features","313780267_Image_Restoration_Techniques_A_Survey","311891849_Semi-supervised_Online_Multi-kernel_Similarity_Learning_for_Image_Retrieval","303889608_A_Review_on_Feature_Selection_Methods_For_Classification_Tasks"]}