{"id":"344274488_DrsNet_Dual-resolution_Semantic_Segmentation_with_Rare_Class-Oriented_Superpixel_Prior","abstract":"Rare-class objects in natural scene images that are usually small and less frequent often convey more important information for scene understanding than the common ones. However, they are often overlooked in scene labeling studies due to two main reasons, low occurrence frequency and limited spatial coverage. Many methods have been proposed to enhance overall semantic labeling performance, but only a few consider rare-class objects. In this work, we present a deep semantic labeling framework with special consideration of rare classes via three techniques. First, a novel dual-resolution coarse-to-fine superpixel representation is developed, where fine and coarse superpixels are applied to rare classes and background areas respectively. This unique dual representation allows seamless incorporation of shape features into integrated global and local convolutional neural network (CNN) models. Second, shape information is directly involved during the CNN feature learning for both frequent and rare classes from the re-balanced training data, and also explicitly involved in data inference. Third, the proposed framework incorporates both shape information and the CNN architecture into semantic labeling through a fusion of probabilistic multi-class likelihood. Experimental results demonstrate competitive semantic labeling performance on two standard datasets both qualitatively and quantitatively, especially for rare-class objects.","authors":["Liangjiang Yu","Guoliang Fan"],"meta":["January 2021Multimedia Tools and Applications 80(7):1-20","DOI:10.1007/s11042-020-09691-y"],"references":["333358121_Context-based_conditional_random_fields_as_recurrent_neural_networks_for_image_labeling","326010685_Labeling_of_Partially_Occluded_Regions_via_the_Multi-Layer_CRF","322749812_SegNet_A_Deep_Convolutional_Encoder-Decoder_Architecture_for_Image_Segmentation","347509008_The_Role_of_Context_for_Object_Detection_and_Semantic_Segmentation_in_the_Wild","331591061_Scene_Parsing_Via_Dense_Recurrent_Neural_Networks_With_Attentional_Selection","327604056_Combining_Multilevel_Contexts_of_Superpixel_Using_Convolutional_Neural_Networks_to_Perform_Natural_Scene_Labeling_IC3_2018","323563753_Hierarchical_Parsing_Net_Semantic_Scene_Parsing_From_Global_Scene_to_Objects","322060097_Scene_Parsing_with_Global_Context_Embedding","321090720_Multimodal_Recurrent_Neural_Networks_With_Information_Transfer_Layers_for_Indoor_Scene_Labeling","320968233_RefineNet_Multi-path_Refinement_Networks_for_High-Resolution_Semantic_Segmentation"]}