{"id":"344299584_Improving_the_accessibility_and_transferability_of_machine_learning_algorithms_for_identification_of_animals_in_camera_trap_images_MLWIC2","abstract":"Motion-activated wildlife cameras (or “camera traps”) are frequently used to remotely and noninvasively observe animals. The vast number of images collected from camera trap projects has prompted some biologists to employ machine learning algorithms to automatically recognize species in these images, or at least filter-out images that do not contain animals. These approaches are often limited by model transferability, as a model trained to recognize species from one location might not work as well for the same species in different locations. Furthermore, these methods often require advanced computational skills, making them inaccessible to many biologists. We used 3 million camera trap images from 18 studies in 10 states across the United States of America to train two deep neural networks, one that recognizes 58 species, the “spe- cies model,” and one that determines if an image is empty or if it contains an animal, the “empty-animal model.” Our species model and empty-animal model had accura- cies of 96.8% and 97.3%, respectively. Furthermore, the models performed well on some out-of-sample datasets, as the species model had 91% accuracy on species from Canada (accuracy range 36%–91% across all out-of-sample datasets) and the empty- animal model achieved an accuracy of 91%–94% on out-of-sample datasets from dif- ferent continents. Our software addresses some of the limitations of using machine learning to classify images from camera traps. By including many species from several locations, our species model is potentially applicable to many camera trap studies in North America. We also found that our empty-animal model can facilitate removal of images without animals globally. We provide the trained models in an R package (MLWIC2: Machine Learning for Wildlife Image Classification in R), which contains Shiny Applications that allow scientists with minimal programming experience to use trained models and train new models in six neural network architectures with varying depths.","authors":["Michael Tabak","Mohammad Sadegh Norouzzadeh","David W Wolfson","Erica Newton"],"meta":["September 2020Ecology and Evolution","DOI:10.1002/ece3.6692"],"references":["344703608_A_deep_active_learning_system_for_species_identification_and_counting_in_camera_trap_images","343461339_Context_R-CNN_Long_Term_Temporal_Context_for_Per-Camera_Object_Detection","339773700_Three_critical_factors_affecting_automated_image_species_recognition_performance_for_camera_traps","333515959_Insights_and_approaches_using_deep_learning_to_classify_wildlife","329210510_Machine_learning_to_classify_animal_species_in_camera_trap_images_Applications_in_ecology","328202727_MLWIC_Machine_Learning_for_Wildlife_Image_Classification_in_R","339301297_Quantifying_imperfect_camera-trap_detection_probabilities_implications_for_density_modelling","337800287_Thinking_like_a_naturalist_Enhancing_computer_vision_of_citizen_science_images_by_harnessing_contextual_data","336999177_Zilong_A_tool_to_identify_empty_images_in_camera-trap_data","332032622_Recognition_in_Terra_Incognita"]}