{"id":"344203914_Neuroadaptive_modelling_for_generating_images_matching_perceptual_categories","abstract":"Brain-computer interfaces enable active communication and execution of a pre-defined set of commands, such as typing a letter or moving a cursor. However, they have thus far not been able to infer more complex intentions or adapt more complex output based on brain signals. Here, we present neuroadaptive generative modelling, which uses a participant's brain signals as feedback to adapt a boundless generative model and generate new information matching the participant's intentions. We report an experiment validating the paradigm in generating images of human faces. In the experiment, participants were asked to specifically focus on perceptual categories, such as old or young people, while being presented with computer-generated, photorealistic faces with varying visual features. Their EEG signals associated with the images were then used as a feedback signal to update a model of the user's intentions, from which new images were generated using a generative adversarial network. A double-blind follow-up with the participant evaluating the output shows that neuroadaptive modelling can be utilised to produce images matching the perceptual category features. The approach demonstrates brain-based creative augmentation between computers and humans for producing new information matching the human operator's perceptual categories.","authors":["Lauri Kangassalo","Michiel M Spapé","Tuukka Ruotsalo"],"meta":["September 2020Scientific Reports 10(1):14719","DOI:10.1038/s41598-020-71287-1"],"references":["341187800_Information_gain_modulates_brain_activity_evoked_by_reading","334579358_Why_do_Users_Issue_Good_Queries_Neural_Correlates_of_Term_Specificity","328375100_ThoughtViz_Visualizing_Human_Thoughts_Using_Generative_Adversarial_Network","320225998_Passive_BCI-Based_Neuroadaptive_Systems","328685474_CariGANs_Unpaired_Photo-to-Caricature_Translation","320968363_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","320968038_Deep_Learning_Human_Mind_for_Automated_Visual_Classification","320707565_Progressive_Growing_of_GANs_for_Improved_Quality_Stability_and_Variation","320543550_To_Create_What_You_Tell_Generating_Videos_from_Captions","319770355_Generative_Adversarial_Nets"]}