{"id":"344287602_Network_science_characteristics_of_brain-derived_neuronal_cultures_deciphered_from_quantitative_phase_imaging_data","abstract":"Understanding the mechanisms by which neurons create or suppress connections to enable communication in brain-derived neuronal cultures can inform how learning, cognition and creative behavior emerge. While prior studies have shown that neuronal cultures possess self-organizing criticality properties, we further demonstrate that in vitro brain-derived neuronal cultures exhibit a self-optimization phenomenon. More precisely, we analyze the multiscale neural growth data obtained from label-free quantitative microscopic imaging experiments and reconstruct the in vitro neuronal culture networks (microscale) and neuronal culture cluster networks (mesoscale). We investigate the structure and evolution of neuronal culture networks and neuronal culture cluster networks by estimating the importance of each network node and their information flow. By analyzing the degree-, closeness-, and betweenness-centrality, the node-to-node degree distribution (informing on neuronal interconnection phenomena), the clustering coefficient/transitivity (assessing the \"small-world\" properties), and the multifractal spectrum, we demonstrate that murine neurons exhibit self-optimizing behavior over time with topological characteristics distinct from existing complex network models. The time-evolving interconnection among murine neurons optimizes the network information flow, network robustness, and self-organization degree. These findings have complex implications for modeling neuronal cultures and potentially on how to design biological inspired artificial intelligence.","authors":["Chenzhong Yin","Xiongye Xiao","Valeriu Balaban","Mikhail Eugene Kandel"],"meta":["September 2020Scientific Reports 10(1):15078","DOI:10.1038/s41598-020-72013-7","Project: Automated Characterization of Adherent Cells"],"references":["340180522_Controlling_the_Multifractal_Generating_Measures_of_Complex_Networks","336590863_Epi-illumination_gradient_light_interference_microscopy_for_imaging_opaque_structures","324918153_Efficient_Coding_and_Energy_Efficiency_Are_Promoted_by_Balanced_Excitatory_and_Inhibitory_Synaptic_Currents_in_Neuronal_Network","322695216_Navigation_of_brain_networks","322532532_Real-time_halo_correction_in_phase_contrast_imaging","336758793_The_neural_code_of_intelligence_From_correlation_to_causation","326817423_Neuronal_Spatial_Arrangement_Shapes_Effective_Connectivity_Traits_of_in_vitro_Cortical_Networks","324427800_The_Fractal_Geometry_of_Nature","322158762_From_Complex_to_Spatial_Networks","321804736_Communication_dynamics_in_complex_brain_networks"]}