{"id":"344374643_Pandaesim_An_Epidemic_Spreading_Stochastic_Simulator","abstract":"Many methods have been used to model epidemic spreading. They include ordinary differential equation systems for globally homogeneous environments and partial differential equation systems to take into account spatial localisation and inhomogeneity. Stochastic differential equations systems have been used to model the inherent stochasticity of epidemic spreading processes. In our case study, we wanted to model the numbers of individuals in different states of the disease, and their locations in the country. Among the many existing methods we used our own variant of the well known Gillespie stochastic algorithm, along with the sub-volumes method to take into account the spatial localisation. Our algorithm allows us to easily switch from stochastic discrete simulation to continuous deterministic resolution using mean values. We applied our approaches on the study of the Covid-19 epidemic in France. The stochastic discrete version of Pandæsim showed very good correlations between the simulation results and the statistics gathered from hospitals, both on day by day and on global numbers, including the effects of the lockdown. Moreover, we have highlighted interesting differences in behaviour between the continuous and discrete methods that may arise in some particular conditions.","authors":["Patrick Amar"],"meta":["September 2020Biology 9(9)","DOI:10.3390/biology9090299"],"references":["342910145_A_Study_on_Herd_Immunity_of_COVID-19_in_South_Korea_Using_a_Stochastic_Economic-Epidemiological_Model","341366767_Estimating_the_burden_of_SARS-CoV-2_in_France","340640824_Projecting_the_transmission_dynamics_of_SARS-CoV-2_through_the_postpandemic_period","340328356_An_investigation_of_transmission_control_measures_during_the_first_50_days_of_the_COVID-19_epidemic_in_China","340291890_Estimates_of_the_severity_of_coronavirus_disease_2019_a_model-based_analysis","340215221_Estimating_the_infection_and_case_fatality_ratio_for_coronavirus_disease_COVID-19_using_age-adjusted_data_from_the_outbreak_on_the_Diamond_Princess_cruise_ship_February_2020","340180593_The_effect_of_human_mobility_and_control_measures_on_the_COVID-19_epidemic_in_China","340176969_The_effect_of_control_strategies_to_reduce_social_mixing_on_outcomes_of_the_COVID-19_epidemic_in_Wuhan_China_a_modelling_study","340049937_Serial_Interval_of_COVID-19_among_Publicly_Reported_Confirmed_Cases","341690585_Cluster_of_COVID-19_in_Northern_France_A_Retrospective_Closed_Cohort_Study"]}