{"id":"344329740_How_Cultural_Messages_Through_Experiences_Influence_Occupational_Pur-_suit_of_Muslim_Female_Computer_Science_Students_Work_in_Progress_How_cultural_messages_through_experiences_influence_occupational_","abstract":"Women are underrepresented in the field of computer science in the United States. However, this is not a new problem as female participation in computer science (CS) has been experiencing a steady decline over the last three decades. Current reporting on women's participation in this field has been published as steadying around 13-17%, depending on the data source. Although, there are varying levels of participation in other countries, particularly in Muslim majority countries. For example, women in Bahrain, Morocco, Palestine, Oman, Saudi Arabia, Iran, and Tunisia earned more than half of the total number of science degrees in their respective nations. This stark contrast between the United States and these other countries has prompted an exploration into the factors that contribute to women's participation in computer science. This study focuses on understanding how cultural environment can affect the participation of women in CS, specifically with respect to individual, household, community, country, and global influences on occupational pursuit. The research question guiding this study is: what cultural factors influence Muslim women's occupational pursuit of computer science? This qualitative study explores, through semi-structured interviews, the experiences and influences of Muslim female students currently pursuing graduate degrees in CS. Leveraging snowball sampling, this research study seeks to better understand Muslim women's pathways to and through computer science. This study will also provide further insight as to how and why certain experiences or cultural influences impact women's choice of computer science. Through thematic analysis leveraging NVivo12, the preliminary findings suggest that micro-and macro-cultural environmental factors are different for Muslim women students across different cultural groups as well as the influence these variables have on their participation and achievement in CS. Our findings suggest that cultural background may influence women in different ways. Understanding the pathways of Muslim women, given their high representation in computer science in their home nations, might provide insight into different ways to engage more women (Muslim or otherwise) in CS in the United States. This study provides a counter-narrative to underrepresentation of women in this field by presenting the pathways of those achieving or exceeding parity in science, technology, engineering, and mathematics (STEM) fields outside of the United States.","authors":["Maral Kargarmoakhar"],"meta":["June 2019","DOI:10.18260/1-2--32892","Conference: 2019 ASEE Annual Conference & ExpositionAt: Tampa, Florida, USA"],"references":["233287016_Why_so_few_women_enroll_in_computing_Gender_and_ethnic_differences_in_students'_perception","344813008_Assessing_Engineering_Disciplines_with_Expected_Success_for_Females_in_Saudi_Arabia","334761558_Preliminary_Findings_of_a_Phenomenological_Study_of_Middle_Eastern_Women's_Experiences_Studying_Engineering_in_Ireland","314433929_Women_in_Saudi_Arabia_Today","275855760_Saudi_Arabia_Enters_the_Twenty-First_Century_The_Political_Foreign_Policy_Economic_and_Energy_Dimensions","263503496_The_Social_Relations_Model_in_Family_Studies_A_Systematic_Review","254997224_Gender_and_the_Career_Choice_Process_The_Role_of_Biased_Self-Assessments","250183853_An_Introduction_to_the_Sociology_of_Learning","235293344_Muslim_Women_in_the_Workplace","233820393_Social_Foundations_of_Thought_Action_A_Social_Cognitive_Theory"]}