{"id":"344301569_Array_programming_with_NumPy","abstract":"Array programming provides a powerful, compact and expressive syntax for accessing, manipulating and operating on data in vectors, matrices and higher-dimensional arrays. NumPy is the primary array programming library for the Python language. It has an essential role in research analysis pipelines in fields as diverse as physics, chemistry, astronomy, geoscience, biology, psychology, materials science, engineering, finance and economics. For example, in astronomy, NumPy was an important part of the software stack used in the discovery of gravitational waves1 and in the first imaging of a black hole2. Here we review how a few fundamental array concepts lead to a simple and powerful programming paradigm for organizing, exploring and analysing scientific data. NumPy is the foundation upon which the scientific Python ecosystem is constructed. It is so pervasive that several projects, targeting audiences with specialized needs, have developed their own NumPy-like interfaces and array objects. Owing to its central position in the ecosystem, NumPy increasingly acts as an interoperability layer between such array computation libraries and, together with its application programming interface (API), provides a flexible framework to support the next decade of scientific and industrial analysis.","authors":["Charles R Harris","K Jarrod Millman","Stéfan J van der Walt","Ralf Gommers"],"meta":["September 2020Nature 585(7825):357-362","DOI:10.1038/s41586-020-2649-2"],"references":["339008987_SciPy_10_fundamental_algorithms_for_scientific_computing_in_Python","328428302_Teaching_Computational_Reproducibility_for_Neuroimaging","327195675_The_Astropy_Project_Building_an_Open-science_Project_and_Status_of_the_v20_Core_Package","322355094_The_Astropy_Project_Building_an_inclusive_open-science_project_and_status_of_the_v20_software","315950787_xarray_N-D_labeled_Arrays_and_Datasets_in_Python","303657108_TensorFlow_A_system_for_large-scale_machine_learning","340177686_Data_Structures_for_Statistical_Computing_in_Python","326243281_LSST_data_management_software_development_practices_and_tools","316235514_Jupyter_Notebooks_-_a_publishing_format_for_reproducible_computational_workflows","312661486_Model-driven_level_3_BLAS_performance_optimization_on_Loongson_3A_processor"]}