{"id":"344353926_COVID-19_image_classification_using_deep_features_and_fractional-order_marine_predators_algorithm","abstract":"Currently, we witness the severe spread of the pandemic of the new Corona virus, COVID-19, which causes dangerous symptoms to humans and animals, its complications may lead to death. Although convolutional neural networks (CNNs) is considered the current state-of-the-art image classification technique, it needs massive computational cost for deployment and training. In this paper, we propose an improved hybrid classification approach for COVID-19 images by combining the strengths of CNNs (using a powerful architecture called Inception) to extract features and a swarm-based feature selection algorithm (Marine Predators Algorithm) to select the most relevant features. A combination of fractional-order and marine predators algorithm (FO-MPA) is considered an integration among a robust tool in mathematics named fractional-order calculus (FO). The proposed approach was evaluated on two public COVID-19 X-ray datasets which achieves both high performance and reduction of computational complexity. The two datasets consist of X-ray COVID-19 images by international Cardiothoracic radiologist, researchers and others published on Kaggle. The proposed approach selected successfully 130 and 86 out of 51 K features extracted by inception from dataset 1 and dataset 2, while improving classification accuracy at the same time. The results are the best achieved on these datasets when compared to a set of recent feature selection algorithms. By achieving 98.7%, 98.2% and 99.6%, 99% of classification accuracy and F-Score for dataset 1 and dataset 2, respectively, the proposed approach outperforms several CNNs and all recent works on COVID-19 images.","authors":["Ahmed Talaat","Dalia Yousri","Ahmed Abd ElGhany Ewees","Mohammed A. A. Al-qaness"],"meta":["September 2020Scientific Reports 10(1):15364","DOI:10.1038/s41598-020-71294-2","Projects: Covid-19 (Research, Data, Solutions, Certifications)Interaction between fractional calculus and different metaheuristics optimization algorithmsMarine Predators Algorithm (MPA): Theories, Variants, and Applications"],"references":["349461667_JCS_An_Explainable_COVID-19_Diagnosis_System_by_Joint_Classification_and_Segmentation","344156851_Classification_of_COVID-19_in_chest_X-ray_images_using_DeTraC_deep_convolutional_neural_network","343094700_Can_AI_help_in_screening_Viral_and_COVID-19_pneumonia","340779618_Fractional-order_cuckoo_search_algorithm_for_parameter_identification_of_the_fractional-order_chaotic_chaotic_with_noise_and_hyper-chaotic_financial_systems","340431861_Slime_mould_algorithm_A_new_method_for_stochastic_optimization","340332332_Classification_of_COVID-19_in_chest_X-ray_images_using_DeTraC_deep_convolutional_neural_network","340326770_The_diagnostic_evaluation_of_Convolutional_Neural_Network_CNN_for_the_assessment_of_chest_X-ray_of_patients_infected_with_COVID-19","341082370_Feature_Selection_Based_on_Gaussian_Mixture_Model_Clustering_for_the_Classification_of_Pulmonary_Nodules_Based_on_Computed_Tomography","340935440_Automated_Detection_of_COVID-19_Cases_Using_Deep_Neural_Networks_with_X-ray_Images","340279344_Covid-19_Automatic_detection_from_X-Ray_images_utilizing_Transfer_Learning_with_Convolutional_Neural_Networks"]}