{"id":"344393758_Mobile_ad-hoc_network_routing_protocols_of_time-critical_events_for_search_and_rescue_missions","abstract":"The most important experiences we discovered from several disasters are that cellular networks were vulnerable, and the loss of the communication system may have a catastrophic consequence. Mobile ad-hoc networks (MANETs) play a significant role in the construction of campus, resident, battlefield and search/rescue region. MANET is an appropriate network for supporting a communication where is no permanent infrastructure. MANET is an effective network that uses to establishing urgent communication between rescue members in critical situations like, disaster or natural calamities. The sending and receiving data in MANET is depending on the routing protocols to adapt the dynamic topology and maintain the routing information. Consequently, This paper evaluates the performance of three routing protocols in MANET: ad-hoc on-demand distance vector (AODV), destination sequenced distance vector (DSDV), and ad-hoc on-demand multipath distance vector (AOMDV). These protocols are inherent from different types of routing protocols: single-path, multi-path, reactive and proactive mechanisms. The NS2 simulator is utilized to evaluate the quality of these protocols. Several metrics are used to assess the performance of these protocols such: packet delivery ratio (PDR), packet loss ratios (PLR), throughput (TP), and end-to-end delay (E2E delay). The outcomes reveal the AOMDV is the most suitable protocol for time-critical events of search and rescue missions. Keywords: AODV AOMDV DSDV MANET Search and rescue missions Time-critical events This is an open access article under the CC BY-SA license.","authors":["Mustafa Hamid Hassan","Mohammed Ahmed Jubair","Salama Mostafa","Aida Mustapha"],"meta":["February 2021Bulletin of Electrical Engineering and Informatics 10(1):192-199","DOI:10.11591/eei.v10i1.2506","Project: Mobile Ad-hoc Network"],"references":["338338233_Social_Networking_Mobile_Apps_Framework_for_Organizing_and_Facilitating_Charitable_and_Voluntary_Activities_in_Malaysia","337303091_Bat_Optimized_Link_State_Routing_Protocol_for_Energy-Aware_Mobile_Ad-Hoc_Networks","335681627_A_Simulation_Study_of_Syn_Flood_Attack_In_Cloud_Computing_Environment","334290561_Integrating_African_Buffalo_Optimization_Algorithm_in_AODV_Routing_Protocol_for_improving_the_QoS_of_MANET","333784650_Assessing_the_Location_of_Search_and_Rescue_Stations_on_the_Portuguese_Coast","332495117_Comprehensive_Review_of_Artificial_Intelligence_and_Statistical_Approaches_in_Distributed_Denial_of_Service_Attack_and_Defense_Methods","340100299_Comparative_performance_evaluation_of_routing_algorithm_and_topology_size_for_wireless_network-on-chip","333857241_A_novel_bio-inspired_routing_algorithm_based_on_ACO_for_WSNs","333134270_Wavelet_energy_moment_and_neural_networks_based_particle_swarm_optimisation_for_transmission_line_protection","331211823_Wireless_sensor_Network_based_Industrial_Automation_using_Internet_of_Things_IoT"]}