{"id":"344372269_Mapping_the_technology_evolution_path_a_novel_model_for_dynamic_topic_detection_and_tracking","abstract":"Identifying the evolution path of a research field is essential to scientific and technological innovation. There have been many attempts to identify the technology evolution path based on the topic model or social networks analysis, but many of them had deficiencies in methodology. First, many studies have only considered a single type of information (text or citation information) in scientific literature, which may lead to incomplete technology path mapping. Second, the number of topics in each period cannot be determined automatically, making dynamic topic tracking difficult. Third, data mining methods fail to be effectively combined with visual analysis, which will affect the efficiency and flexibility of mapping. In this study, we developed a method for mapping the technology evolution path using a novel non-parametric topic model, the citation involved Hierarchical Dirichlet Process (CIHDP), to achieve better topic detection and tracking of scientific literature. To better present and analyze the path, D3.js is used to visualize the splitting and fusion of the evolutionary path. We used this novel model to mapping the artificial intelligence research domain, through a successful mapping of the evolution path, the proposed method’s validity and merits are shown. After incorporating the citation information, we found that the CIHDP can be mapping a complete path evolution process and had better performance than the Hierarchical Dirichlet Process and LDA. This method can be helpful for understanding and analyzing the development of technical topics. Moreover, it can be well used to map the science or technology of the innovation ecosystem. It may also arouse the interest of technology evolution path researchers or policymakers.","authors":["Huailan Liu","Zhiwang Chen","Jie Tang","Yuan Zhou"],"meta":["September 2020Scientometrics 125(2):1-48","DOI:10.1007/s11192-020-03700-5"],"references":["342025509_Mapping_an_innovation_ecosystem_using_network_clustering_and_community_identification_a_multi-layered_framework","339000733_Forecasting_emerging_technologies_using_data_augmentation_and_deep_learning","339000665_Forecasting_emerging_technologies_using_data_augmentation_and_deep_learning","338871124_Exploring_Technology_Evolution_Pathways_to_Facilitate_Technology_Management_From_a_Technology_Life_Cycle_Perspective","338126013_A_novel_topic_model_for_documents_by_incorporating_semantic_relations_between_words","333356027_A_novel_method_to_identify_emerging_technologies_using_a_semi-supervised_topic_clustering_model_a_case_of_3D_printing_industry","339780500_Tracing_the_Evolution_of_3D_Printing_Technology_in_China_Using_LDA-Based_Patent_Abstract_Mining","339112314_Identifying_technology_evolution_pathways_using_topic_variation_detection_based_on_patent_data_A_case_study_of_3D_printing","339069734_Topic-linked_innovation_paths_in_science_and_technology","334142851_Unfolding_the_convergence_process_of_scientific_knowledge_for_the_early_identification_of_emerging_technologies"]}