{"id":"344386588_Exploring_Interdisciplinary_Relationships_Among_King_Abdulaziz_University_Departments_via_ResearchGate_Network_Analysis_and_Visualizations","abstract":"Because all disciplines are connected, interdisciplinary studies are one of the most significant discussions in the education sector. It involves the merging of two or more academic disciplines into one activity. The aim of this research paper is to explore the relationship of interdisciplinary research and network among all departments at King Abdulaziz University (KAU) in ResearchGate (RG) by using the statistical network analysis of undirected social networks. In our academic network, the departments of the university represent the vertices and their academic relationships. We will detect the communities between the departments in RG network by using statistical analysis of the network for each community. Finally, we will compare the academic social network at KAU to some random graph models, and investigate some random graph characteristics, such as power-law, small-world, and scale-free models. In our research, we found that the Department of Chemistry has the highest degree for the academic social network at KAU in RG, and the highest eigenvector centrality as well. In terms of vertex centrality, the Department of Electrical and Computer Engineering has the highest value in closeness and betweenness centrality. Also, we found that the most two connected departments are the Department of Computer Science and Department of Physics through the edge weight equals 248. By using community detection, we found there are seven communities. We conclude that the degree distribution of the academic social network of KAU in RG is different from the degree distribution of random graph models, but it is slightly close to small world model. This study , in turn, can participate to achieve one of the goals of Vision 2030 by shedding some light into how to improve research networks in the education sector and research among Saudi universities.","authors":["Hanan Baaqeel","Sara F Aloufi","Tariq Elyas"],"meta":["September 2020Journal of Management and Strategy 11(3):55-66","DOI:10.5430/jms.v11n3p55"],"references":["278681729_Important_Author_Analysis_in_Research_Professionals'_Relationship_Network_Based_on_Social_Network_Analysis_Metrics","221611895_Measurement_and_Analysis_of_Online_Social_Networks","319972139_The_use_of_nodes_attributes_in_social_network_analysis_with_an_application_to_an_international_trade_network","316820983_Measuring_Social_Media_Activity_of_Scientific_Literature_An_Exhaustive_Comparison_of_Scopus_and_Novel_Altmetrics_Big_Data","316790740_Discovering_the_Interdisciplinary_Nature_of_Big_Data_Research_Through_Social_Network_Analysis_and_Visualization","281424179_The_Use_of_Academic_Social_Networks_Among_Arab_Researchers_A_Survey","269310355_Social_Network_Analysis_Hardly_easy","228857467_Statistical_Analysis_of_Network_Data_III"]}