{"id":"344309762_Load-Aware_and_Mobility-Aware_Flow_Rules_Management_in_Software_Defined_Vehicular_Access_Networks","abstract":"To ensure high performance for vehicular access networks, Software Defined Networking (SDN) technology is an efficient solution offering programmability, flexibility and a centralized view of the network. Nevertheless, to guarantee an efficient mobility management, some improvements are needed. In particular, a limitation on the number of exchanges between SDN controller and network devices and a better flow tables' management are required. To achieve that, the ideas of flow rules' pre-deployment and mobility-aware management of flow rules' lifetime have been proposed. However, existing approaches have two major limitations: accuracy and adaptability. Indeed, network load (accuracy) and network devices' feedbacks (adaptability) are not considered, two factors impacting flow rules management. That is why, in this paper, we define a state-based approach using connection/disconnection information reported by network devices to improve adaptability. Moreover, we propose a mobility-aware and load-aware flow rules management to improve accuracy. Finally, we specify a new flow rules' pre-deployment policy based on flow tables occupancy rate, vehicles mobility and SDN control channel load. The evaluations carried out confirm the benefits of the approach, compared to existing solutions, both in terms of recovery delay, control overhead, hard timeout calculation and flow table occupancy.","authors":["Léo Mendiboure","Mohamed Aymen Chalouf","Francine Krief"],"meta":["September 2020IEEE Access 8:167411 - 167424","DOI:10.1109/ACCESS.2020.3023500"],"references":["337210925_A_SDN-Based_PubSub_Middleware_for_Geographic_Content_Dissemination_in_Internet_of_Vehicles","335674187_Dynamic_Mobility_Load_Balancing_for_5G_Small_Cell_Networks_Based_on_Utility_Functions","334487011_A_Temporal-Information-Based_Adaptive_Routing_Algorithm_for_Software_Defined_Vehicular_Networks","333238992_SD-IoV_SDN_enabled_routing_for_internet_of_vehicles_in_road-aware_approach","328400150_5G_URLLC_Design_Challenges_and_System_Concepts","327459161_Mobi-Flow_Mobility-Aware_Adaptive_Flow-Rule_Placement_in_Software-Defined_Access_Network","338199998_End-to-End_Delay_Minimization-based_Joint_Rule_Caching_and_Flow_Forwarding_Algorithm_for_SDN","337522419_Dynamic_Hard_Timeout_based_Flow_Table_Management_in_Openflow_enabled_SDN","327122822_An_In-Switch_Rule_Caching_and_Replacement_Algorithm_in_Software_Defined_Networks","325859824_Balancing_flow_table_occupancy_and_link_utilization_in_software-defined_networks"]}