{"id":"344382451_So_what_exactly_is_a_qualitative_calculus","abstract":"The paradigm of algebraic constraint-based reasoning, embodied in the notion of a qualitative calculus, is studied within two alternative frameworks. One framework defines a qualitative calculus as “a non-associative relation algebra (NA) with a qualitative representation”, the other as “an algebra generated by jointly exhaustive and pairwise disjoint (JEPD) relations”. These frameworks provide complementary perspectives: the first is intensional (axiom-based), whereas the second one is extensional (based on semantic structures). However, each definition admits calculi that lie beyond the scope of the other. Thus, a qualitatively representable NA may be incomplete or non-atomic, whereas an algebra generated by JEPD relations may have non-involutive converse and no identity element. The divergence of definitions creates a confusion around the notion of a qualitative calculus and makes the “what” question posed by Ligozat and Renz actual once again. Here we define the relation-type qualitative calculus unifying the intensional and extensional approaches. By introducing the notions of weak identity, inference completeness and Q-homomorphism, we give equivalent definitions of qualitative calculi both intensionally and extensionally. We show that “algebras generated by JEPD relations” and “qualitatively representable NAs” are embedded into the class of relation-type qualitative algebras.","authors":["Armen Inants","Jérôme Euzenat"],"meta":["December 2020Artificial Intelligence 289","DOI:10.1016/j.artint.2020.103385"],"references":["304590233_Algebraic_foundations_for_qualitative_calculi_and_networks","281472549_An_Algebra_of_Qualitative_Taxonomical_Relations_for_Ontology_Alignments","247590685_Some_Varieties_Containing_Relation_Algebras","336939781_On_the_Scope_of_Qualitative_Constraint_Calculi","321497762_Graduate_Texts_in_Mathematics","313066157_Algebraic_Calculi_for_Weighted_Ontology_Alignments","303750072_A_Survey_of_Qualitative_Spatial_and_Temporal_Calculi_--_Algebraic_and_Computational_Properties","283925025_Maintaining_Knowledge_about_Temporal_Intervals","277281464_Lattice_Theory","264957230_Lattice_theory_Third_new_ed","239744851_A_Categorical_Perspective_on_Qualitative_Constraint_Calculi","236985222_Algebraic_Properties_of_Qualitative_Spatio-Temporal_Calculi","243779915_Boolean_Algebras_with_Operators_Part_I","222657759_Composing_Cardinal_Direction_Relations","222501574_Atom_structures_of_cylindric_algebras_and_relation_algebras"]}