{"id":"344324195_Load_flow_and_contingency_analysis_for_transmission_line_outage","abstract":"In recent years, power systems have been pushed to operate above their limits due to the increase in the demand for energy supply and its usage. This increase is accompanied by various kinds of obstructions in power transmission systems. A power system is said to be secured when it is free from danger or risk. Power systems security deals with the ability of the system to withstand any contingencies without any consequences. Contingencies are potentially harmful disturbances which occur during the steady state operation of a power system. Load flow constitutes the most important study in a power system for planning, operation, and expansion. Contingency selection is performed by calculating two kinds of performance indices; an active performance index (PIP) and reactive power performance index (PIV) for a single transmission line outage. In this paper, with the help of the Newton Raphson method, the PIP and PIV were calculated with DIgSILENT Power Factory simulation software and contingency ranking was performed. Based on the load flow results and performance indexes, the Ethiopian Electric Power (EEP) NorthWest region network is recommended for an upgrade or the reactive power or series compensators should be constructed on the riskiest lines and substations.","authors":["Dessalegn Bitew Aeggegn","Ayodeji Salau","Yalew Gebru"],"meta":["September 2020Archives of Electrical Engineering 69(3):581-594","DOI:10.24425/aee.2020.133919"],"references":["338699240_Reactive_power_based_fair_calculation_approach_for_multiobjective_load_dispatch_problem","329122440_Contingency_Selection_and_Ranking_for_Composite_Power_System_Reliability_Evaluation","260330850_Power_System_Contingency_Analysis_to_detect_Network_Weaknesses","258207126_Improved_Transmission_Line_Contingency_Analysis_in_Power_System_using_Fast_Decoupled_Load_Flow","318328770_Contingency_selection_for_power_system_stability_analysis","317415393_Power_generation_operation_and_control","313804993_Contingency_analysis_of_power_system_by_using_voltage_and_active_power_performance_index","273300692_Power_system_security_analysis_under_transmission_line_outage_condition","224137874_Assessment_of_transmission_line_common_mode_station_originated_and_fault_types_forced_outage_rates","23969058_Why_Investments_Do_Not_Prevent_Blackouts"]}