{"id":"344334884_Experimental_Review_of_Neural-Based_Approaches_for_Network_Intrusion_Management","abstract":"The use of Machine Learning (ML) techniques in Intrusion Detection Systems (IDS) has taken a prominent role in the network security management field, due to the substantial number of sophisticated attacks that often pass undetected through classic IDSs. These are typically aimed at recognising attacks based on a specific signature, or at detecting anomalous events. However, deterministic, rule-based methods often fail to differentiate particular (rarer) network conditions (as in peak traffic during specific network situations) from actual cyber attacks. In this paper we provide an experimental-based review of neural-based methods applied to intrusion detection issues. Specifically, we i) offer a complete view of the most prominent neural-based techniques relevant to intrusion detection, including deep-based approaches or weightless neural networks, which feature surprising outcomes; ii) evaluate novel datasets (updated w.r.t. the obsolete KDD99 set) through a designed-from-scratch Python-based routine; iii) perform experimental analyses including time complexity and performance (accuracy and F-measure), considering both single-class and multi-class problems, and identifying trade-offs between resource consumption and performance. Our evaluation quantifies the value of neural networks, particularly when state-of-the-art datasets are used to train the models. This leads to interesting guidelines for security managers and computer network practitioners who are looking at the incorporation of neural-based ML into IDS.","authors":["Mario Di Mauro","Giovanni Galatro","Antonio Liotta"],"meta":["September 2020IEEE Transactions on Network and Service Management PP(99)","DOI:10.1109/TNSM.2020.3024225"],"references":["336453108_Analysis_of_Multi-Types_of_Flow_Features_Based_on_Hybrid_Neural_Network_for_Improving_Network_Anomaly_Detection","336260131_An_Improved_Convolutional_Neural_Network_Model_for_Intrusion_Detection_in_Networks","339172049_Embedded_Intrusion_Detection_System_for_Detecting_Attacks_over_CAN-BUS","338945226_Improved_Network_Traffic_Classification_Using_Ensemble_Learning","338619941_IoT-KEEPER_Detecting_Malicious_IoT_Network_Activity_using_Online_Traffic_Analysis_at_the_Edge","337200608_Cyber_Threat_Detection_Based_on_Artificial_Neural_Networks_Using_Event_Profiles","336595499_Deep_learning_approaches_for_anomaly-based_intrusion_detection_systems_A_survey_taxonomy_and_open_issues","335500675_Framework_for_Detection_of_Malicious_Activities_in_IoT_Networks_using_Keras_Deep_Learning_Library","335344587_A_Hybrid_Intrusion_Detection_Method_Based_on_Improved_Fuzzy_C-Means_and_Support_Vector_Machine","334849691_Fuzzy_Kernel_Robust_Clustering_for_Anomaly_based_Intrusion_Detection"]}