{"id":"344361627_Gender-Specific_Risk_Factors_and_Comorbidities_of_Bothersome_Tinnitus","abstract":"Objective: \nThis study aims to identify gender-specific risk factors associated with the presence of bothersome tinnitus (compared with non-bothersome tinnitus), including sociodemographic and lifestyle factors, tinnitus-associated phenomena (hearing loss, traumatic experiences, sleep disturbances), and physical as well as mental comorbidities.\n\nMethods: \nWe conducted a cross-sectional study using survey data from the Swedish LifeGene cohort containing information on self-reported tinnitus (N = 7615). We (1) analyzed risk factor and comorbidity frequencies, (2) computed multivariate logistic regression models to identify predictors of bothersome tinnitus within both genders, and (3) moderated logistic regression models to compare effects between genders.\n\nResults: \n(1) The majority of factors that differed in frequencies between bothersome and non-bothersome tinnitus were equal for both genders. Women with bothersome tinnitus specifically reported higher rates of cardiovascular disease, thyroid disease, epilepsy, fibromyalgia, and burnout, and men with bothersome tinnitus reported higher rates of alcohol consumption, Ménière's disease, anxiety syndrome, and panic (compared with non-bothersome tinnitus, respectively). (2) Across both genders, multivariate logistic regression analyses revealed significant associations between bothersome tinnitus and age, reduced hearing ability, hearing-related difficulties in social situations, and reduced sleep quality. In women, bothersome tinnitus was specifically associated with cardiovascular disease and epilepsy; in men, with lower education levels and anxiety syndrome. (3) Moderated logistic regression analyses revealed that the effects of low education and anxiety syndrome were present in men, but not in women, whereas the effects of age, reduced hearing ability and related difficulties, cardiovascular disease, epilepsy, and burnout were not gender specific.\n\nConclusion: \nIrrespective of gender, bothersome tinnitus is associated with higher age, reduced hearing ability, hearing-related difficulties, cardiovascular disease, epilepsy, and burnout. Gender-specific effects comprise low levels of education and the presence of anxiety syndrome for men. These findings need to be interpreted with caution, yet they suggest the presence of gender-specific biopsychosocial influences in the emergence or maintenance of bothersome tinnitus. Future studies ought to investigate the underlying mechanisms of the observed relationships.","authors":["Laura Basso","Benjamin Boecking","Petra Brüggemann","Nancy L. Pedersen"],"meta":["September 2020Frontiers in Neuroscience 14(706)","DOI:10.3389/fnins.2020.00706","Project: TIGER - Tinnitus Genetic and Environmental Risks"],"references":["336066435_The_Influence_of_Education_Level_on_Tinnitus_and_Quality_of_Life_in_Korean_Adults","332820149_Sex-Specific_Association_of_Tinnitus_With_Suicide_Attempts","332442904_Profiling_intermittent_tinnitus_a_retrospective_review","331903317_Tinnitus_in_Canada","330055664_Cortical_stimulation_for_treatment_of_neurological_disorders_of_hyperexcitability_A_role_of_homeostatic_plasticity","324844030_Bothersome_tinnitus_Cognitive_behavioral_perspectives","332814916_Sexual_Dimorphism_in_Vestibular_Function_and_Dysfunction","326638382_Cochlear_Function_in_Adults_with_Epilepsy_and_Treated_with_Carbamazepine","322187259_Drinking_Motives_and_Alcohol_Use_The_SERVe_Study_of_US_Current_and_Former_Service_Members","322167522_Drinking_Motives_and_Alcohol_Use_The_SERVe_Study_of_US_Current_and_Former_Service_Members"]}