{"id":"344470267_Systematic_Approach_to_Cyber_Resilience_Operationalization_in_SMEs","abstract":"The constantly evolving cyber threat landscape is a latent problem for today's companies. This is especially true for the Small and Medium-sized Enterprises (SMEs) because they have limited resources to face the threats but, as a group, represent an extensive payload for cybercriminals to exploit. Moreover, the traditional cybersecurity approach of protecting against known threats cannot withstand the rapidly evolving technologies and threats used by cybercriminals. This study claims that cyber resilience, a more holistic approach to cybersecurity, could help SMEs anticipate, detect, withstand, recover from and evolve after cyber incidents. However, to operationalize cyber resilience is not an easy task, and thus, the study presents a framework with a corresponding implementation order for SMEs that could help them implement cyber resilience practices. The framework is the result of using a variation of Design Science Research in which Grounded Theory was used to induce the most important actions required to implement cyber resilience and an iterative evaluation from experts to validate the actions and put them in a logical order. Therefore, this study proposes that the framework could benefit SME managers to understand cyber resilience, as well as help them start implementing it with concrete actions and an order dictated by the experience of experts. This could potentially ease cyber resilience implementation for SMEs by making them aware of what cyber resilience implies, which dimensions it includes and what actions can be implemented to increase their cyber resilience.","authors":["Juan Francisco Carías","Marcos Borges","Leire Labaka","Saioa Arrizabalaga"],"meta":["September 2020IEEE Access 8:174200-174221","DOI:10.1109/ACCESS.2020.3026063"],"references":["330115584_Defining_a_Cyber_Resilience_Investment_Strategy_in_an_Industrial_Internet_of_Things_Context","327588326_Review_of_cybersecurity_frameworks_context_and_shared_concepts","326309769_Defining_Cybersecurity","314431038_Centralized_IT_Decision_Making_and_Cybersecurity_Breaches_Evidence_from_US_Higher_Education_Institutions","308851158_Studying_resilient_cyber_incident_management_from_large-scale_cyber_security_training","336307796_EVOLUTION_OF_AMERICAN_CYBER_SECURITY_POLICIES","329997949_Machine_Learning_to_Automate_Network_Segregation_for_Enhanced_Security_in_Industry_40_9th_International_EAI_Conference_Broadnets_2018_Faro_Portugal_September_19-20_2018_Proceedings","319122784_Grounded_Theory_Methodology_in_Information_Systems_Research","309443624_From_Cybersecurity_to_Collaborative_Resiliency","303032072_Quantifying_and_measuring_cyber_resiliency"]}