{"id":"344494485_A_Decision_Tree_for_Building_IT_Applications","abstract":"Blockchain technology has gained an increasing attention from research and industry over the recent years. It allows to implement in its environment the smart-contracts technology which is used to automate and execute agreements between users. The blockchain is proposed today as a new technical infrastructure for several types of IT applications. This interest is mainly due to its core property that allows two users to perform transactions without going through a TTP, while offering a transparent and fully protected data storage. However, a blockchain comes along a number of other intrinsic properties, which may not be suitable or beneficial in all the envisaged application cases. Consequently, we propose in this paper to design a new tool which is \"a decision tree\" that allows to identify when a blockchain may be the appropriate technical infrastructure for a given IT application, and when another classical system (centralized or distributed peer-to-peer) is more adapted. The proposed decision tree allows also to identify whether it is necessary to use the smart-contracts technology or not.","authors":["Nour El Madhoun","Julien Hatin","Emmanuel Bertin"],"meta":["September 2020annals of telecommunications - annales des télécommunications"],"references":["341953331_Going_Beyond_the_Blockchain_Hype_In_Which_Cases_are_Blockchains_Useful_for_IT_Applications","334434726_A_Vademecum_on_Blockchain_Technologies_When_Which_and_How","319249505_A_Survey_on_the_Security_of_Blockchain_Systems","337381748_La_mise_en_oeuvre_de_la_blockchain_et_des_smart_contracts_par_les_industries_culturelles","336581417_Dynamic_Adaptive_Streaming_over_HTTP_DASH_within_P2P_systems_a_survey","329683614_A_survey_of_blockchain_security_issues_and_challenges","326948399_KEVM_A_Complete_Formal_Semantics_of_the_Ethereum_Virtual_Machine","326709754_Comparative_analysis_of_blockchain_consensus_algorithms","324021549_A_Survey_on_Anonymity_and_Privacy_in_Bitcoin-Like_Digital_Cash_Systems","321398613_A_review_on_consensus_algorithm_of_blockchain"]}