{"id":"344477959_Reinforcement_Learning_in_Dynamic_Task_Scheduling_A_Review","abstract":"Scheduling is assigning shared resources over time to efficiently complete the tasks over a given period of time. The term is applied separately for tasks and resources correspondingly in task scheduling and resource allocation. Scheduling is a popular topic in operational management and computer science. Effective schedules ensure system efficiency, effective decision making , minimize resource wastage and cost, and enhance overall productivity. It is generally a tedious task to choose the most accurate resources in performing work items and schedules in both computing and business process execution. Especially in real-world dynamic systems where multiple agents involve in scheduling various dynamic tasks is a challenging issue. Reinforcement Learning is an emergent technology which has been able to solve the problem of the optimal task and resource scheduling dynamically. This review paper is about a research study that focused on Reinforcement Learning techniques that have been used for dynamic task scheduling. The paper addresses the results of the study by means of the state-of-the-art on Reinforcement learning techniques used in dynamic task scheduling and a comparative review of those techniques.","authors":["Chathurangi Shyalika","· Thushari Silva","Asoka Karunananda"],"meta":["November 2020SN Computer Science 1(6):306","DOI:10.1007/s42979-020-00326-5"],"references":["340639690_Actor-Critic_Deep_Reinforcement_Learning_for_Solving_Job_Shop_Scheduling_Problems","335030823_Multi-Agent_Reinforcement_Learning_Based_Resource_Allocation_for_UAV_Networks","334235663_A_trust-aware_task_allocation_method_using_deep_q-learning_for_uncertain_mobile_crowdsourcing","333946807_Review_on_flexible_job_shop_scheduling","350339263_Static_vs_Dynamic_List-Scheduling_Performance_Comparison","339745456_Dynamic_scheduling_for_flexible_job_shop_with_new_job_insertions_by_deep_reinforcement_learning","339479015_Multi-task_Deep_Reinforcement_Learning_for_Scalable_Parallel_Task_Scheduling","334118052_Discriminative_Deep_Dyna-Q_Robust_Planning_for_Dialogue_Policy_Learning","334117784_Deep_Dyna-Q_Integrating_Planning_for_Task-Completion_Dialogue_Policy_Learning","333919752_Fast_task_allocation_for_heterogeneous_unmanned_aerial_vehicles_through_reinforcement_learning"]}