{"id":"344433910_Take_space_make_space_how_students_use_computer_science_to_disrupt_and_resist_marginalization_in_schools_Take_space_make_space_how_students_use_computer_science_to_disrupt_and_resist_marginalization_i","abstract":"Background and Context\nOverlaying Computer Science (CS) courses on top of inequitable schooling systems will not move us toward “CS for All.” This paper prioritizes the perspectives of minoritized students enrolled in high school CS classrooms across a large, urban school district in the Western United States, to help inform how CS can truly be for all.\n\nObjective\nThis paper explores what student agency looks like while answering the research question “From the perspective of minoritized students historically underrepresented in computing, what makes a critical difference in their sense of agency in introductory CS high school classes?”\n\nMethod\nOur research-practice partnership used qualitative data (including classroom observations, interviews, student artifacts, and video/photos) and surveys to surface the perspectives and visions of minoritized youth.\n\nFindings\nThe research describes what student agency looks like as youth – who have had no prior CS learning experiences – use CS as a tool to resist marginalization and dehumanizing school contexts, while declaring their own “rightful presence” in CS classrooms.\n\nImplications\nFindings demonstrate the importance for CS curricula and pedagogy to center the lives of students in ways that are consequential for minoritized youth. This would support deeper engagement with content learning and student agency with computing.","authors":["Jean Ryoo","Tiera Tanksley","Cynthia Estrada","Jane Margolis"],"meta":["September 2020Computer Science Education 30(3)","DOI:10.1080/08993408.2020.1805284","Project: Broadening Participation in STEM - Center X's Exploring Computer Science Project"],"references":["356337021_Researching_Race_in_Mathematics_Education","332223768_Designing_for_Rightful_Presence_in_STEM_The_Role_of_Making_Present_Practices_Designing_for_Rightful_Presence_in_STEM_The_Role_of_Making_Present_Practices","329887415_Toward_what_ends_A_critical_analy_sis_of_militarism_equity_and_STEM_education","344806644_Critical_Literacy_and_Urban_Youth_Pedagogies_of_Access_Dissent_and_Liberation","344655466_Race_After_Technology_Abolitionist_Tools_for_the_New_Jim_Code","336791156_Dissecting_racial_bias_in_an_algorithm_used_to_manage_the_health_of_populations","334505252_Pedagogy_that_Supports_Computer_Science_for_All","331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","329671937_Computer_science_for_all_A_school_reform_framework_for_broadening_participation_in_computing","329648187_Who's_Asking_Native_Science_Western_Science_and_Science_Education"]}