{"id":"344423208_A-Situ_a_computational_framework_for_affective_labeling_from_psychological_behaviors_in_real-life_situations","abstract":"This paper presents a computational framework for providing affective labels to real-life situations, called A-Situ. We first define an affective situation, as a specific arrangement of affective entities relevant to emotion elicitation in a situation. Then, the affective situation is represented as a set of labels in the valence-arousal emotion space. Based on psychological behaviors in response to a situation, the proposed framework quantifies the expected emotion evoked by the interaction with a stimulus event. The accumulated result in a spatiotemporal situation is represented as a polynomial curve called the affective curve, which bridges the semantic gap between cognitive and affective perception in real-world situations. We show the efficacy of the curve for reliable emotion labeling in real-world experiments, respectively concerning (1) a comparison between the results from our system and existing explicit assessments for measuring emotion, (2) physiological distinctiveness in emotional states, and (3) physiological characteristics correlated to continuous labels. The efficiency of affective curves to discriminate emotional states is evaluated through subject-dependent classification performance using bicoherence features to represent discrete affective states in the valence-arousal space. Furthermore, electroencephalography-based statistical analysis revealed the physiological correlates of the affective curves.","authors":["Byung Hyung Kim","Sungho Jo","Sunghee Choi"],"meta":["September 2020Scientific Reports 10(1):15916","DOI:10.1038/s41598-020-72829-3"],"references":["322319782_Deep_Physiological_Affect_Network_for_the_Recognition_of_Human_Emotions","321056862_Continuous_Real-Time_Emotion_Annotation_A_Novel_Joystick-Based_Analysis_Framework","311106390_Predicting_Human_Eye_Fixations_via_an_LSTM-based_Saliency_Attentive_Model","310573403_Discriminative_Ocular_Artifact_Correction_for_Feature_Learning_in_EEG_Analysis","308468934_A_systems_approach_to_appraisal_mechanisms_in_emotion","316926791_Emotions_Recognition_Using_EEG_Signals_A_Survey","309714707_ASCERTAIN_Emotion_and_Personality_Recognition_using_Commercial_Sensors","309347561_Real-time_self-report_of_momentary_states_in_the_natural_environment_Computerized_ecological_momentary_assessment","292547642_Brain-Computer_Interfaces_Principles_and_Practice","284969016_Emotional_memory_A_dimensional_analysis"]}