{"id":"344407700_Community_detection_with_node_attributes_in_multilayer_networks","abstract":"Community detection in networks is commonly performed using information about interactions between nodes. Recent advances have been made to incorporate multiple types of interactions, thus generalizing standard methods to multilayer networks. Often, though, one can access additional information regarding individual nodes, attributes, or covariates. A relevant question is thus how to properly incorporate this extra information in such frameworks. Here we develop a method that incorporates both the topology of interactions and node attributes to extract communities in multilayer networks. We propose a principled probabilistic method that does not assume any a priori correlation structure between attributes and communities but rather infers this from data. This leads to an efficient algorithmic implementation that exploits the sparsity of the dataset and can be used to perform several inference tasks; we provide an open-source implementation of the code online. We demonstrate our method on both synthetic and real-world data and compare performance with methods that do not use any attribute information. We find that including node information helps in predicting missing links or attributes. It also leads to more interpretable community structures and allows the quantification of the impact of the node attributes given in input.","authors":["Martina Contisciani","Eleanor A Power","Caterina De Bacco"],"meta":["September 2020Scientific Reports 10(1):15736","DOI:10.1038/s41598-020-72626-y"],"references":["336852935_Model-based_clustering_for_populations_of_networks","323627472_Stochastic_Block_Models_with_Multiple_Continuous_Attributes","320050159_Super-Resolution_Community_Detection_for_Layer-Aggregated_Multilayer_Networks","338909171_OrthoNet_Multilayer_Network_Data_Clustering","334976371_Map_equation_with_metadata_Varying_the_role_of_attributes_in_community_detection","334468293_Cooperation_beyond_consanguinity_Post-marital_residence_delineations_of_kin_and_social_support_among_South_Indian_Tamils","324629609_Community_detection_in_Attributed_Network","321240500_Dynamic_Cluster_Formation_Game_for_Attributed_Graph_Clustering","317565362_Estimating_the_effects_of_network_covariates_on_subgroup_insularity_with_a_hierarchical_mixed_membership_stochastic_blockmodel","314244573_Social_support_networks_and_religiosity_in_rural_South_India"]}