{"id":"344441772_Modeling_robot_co-representation_state-of-the-art_open_issues_and_predictive_learning_as_a_possible_framework","abstract":"Robots are getting increasingly more present in many spheres of human life, making the need for robots that can successfully engage in natural social interactions with humans paramount. Successful human-robot interaction could be achieved more effectively if robots could act predictably and could predict the humans' actions. If robots could represent human partners and generate behaviors that are in line with the partners' expectations based on human's mental models of interdependent action, human agents would be able to apply predictive and adaptive mechanisms acquired in human interactions to interact with robots effectively. How could robots be predictable and be capable of predicting human behavior? We propose that this could be achieved by having an internal representation of both oneself and the other agent, that is by equipping the robot with the ability to co-represent. Here, co-representation refers to the representation of the partner's actions alongside one's own actions. Although co-representation constitutes an essential process for successful human social interaction , as it supports understanding of others' actions, to date co-representation processes have only scarcely been integrated into robotic platforms. We highlight the state-of-the-art findings on co-representation in social robotics, discuss current research limitations and open issues for creating computational models of co-representation in robots, and put forward the idea that predictive learning might constitute a particularly promising framework to build models of co-representing robots. Overall, in this article, we offer an integrated view of the state-of-the-art findings in robotics literature on co-representation and outline directions for future research, with the aim to boost success in building robots equipped with co-representation models fit for smooth social interactions.","authors":["Murat Kirtay","Olga Wudarczyk","Doris Pischedda","Anna Katharina Kuhlen"],"meta":["December 2020","DOI:10.1109/ICDL-EpiRob48136.2020.9278031","Conference: IEEE ICDL-EpiRob 2020At: Valparaiso, Chile","Project: Multimodal Interaction and Communication"],"references":["339411547_Prerequisites_for_an_Artificial_Self","338610678_Robot_selfother_distinction_active_inference_meets_neural_networks_learning_in_a_mirror","337229263_A_review_on_neural_network_models_of_schizophrenia_and_autism_spectrum_disorder","331960972_Predictive_learning_its_key_role_in_early_cognitive_development","324251093_Predictive_coding-based_deep_dynamic_neural_network_for_visuomotor_learning","322388451_Simulation-Based_Internal_Models_for_Safer_Robots","339773407_A_Three-Site_Reproduction_of_the_Joint_Simon_Effect_with_the_NAO_Robot","335992783_The_sense_of_agency_in_human-human_vs_human-robot_joint_action","334482692_A_Deep_Convolutional_Neural_Network_Model_for_Sense_of_Agency_and_Object_Permanence_in_Robots","330058506_Action_co-representation_and_the_sense_of_agency_during_a_joint_Simon_task_Comparing_human_and_machine_co-agents"]}