{"id":"344464279_A_novel_method_of_constrained_feature_selection_by_the_measurement_of_pairwise_constraints_uncertainty","abstract":"Abstract In the past decades, the rapid growth of computer and database technologies has led to the rapid growth of large-scale datasets. On the other hand, data mining applications with high dimensional datasets that require high speed and accuracy are rapidly increasing. Semi-supervised learning is a class of machine learning in which unlabeled data and labeled data are used simultaneously to improve feature selection. The goal of feature selection over partially labeled data (semi-supervised feature selection) is to choose a subset of available features with the lowest redundancy with each other and the highest relevancy to the target class, which is the same objective as the feature selection over entirely labeled data. This method actually used the classification to reduce ambiguity in the range of values. First, the similarity values of each pair are collected, and then these values are divided into intervals, and the average of each interval is determined. In the next step, for each interval, the number of pairs in this range is counted. Finally, by using the strength and similarity matrices, a new constraint feature selection ranking is proposed. The performance of the presented method was compared to the performance of the state-of-the-art, and well-known semi-supervised feature selection approaches on eight datasets. The results indicate that the proposed approach improves previous related approaches with respect to the accuracy of the constrained score. In particular, the numerical results showed that the presented approach improved the classification accuracy by about 3% and reduced the number of selected features by 1%. Consequently, it can be said that the proposed method has reduced the computational complexity of the machine learning algorithm despite increasing the classification accuracy.","authors":["Mehrdad Rostami","Kamal Berahmand","Saman Forouzandeh"],"meta":["October 2020Journal of Big Data 7(1)","DOI:10.1186/s40537-020-00352-3"],"references":["343206406_Integration_of_multi-objective_PSO_based_feature_selection_and_node_centrality_for_medical_datasets","346692304_Feature_Selection_for_Classification","345613447_Understanding_the_Data_Science_behind_Business_Analytics","342795371_Semi-supervised_neighborhood_discrimination_index_for_feature_selection","341064078_A_Robust_Graph-based_Semi-Supervised_Sparse_Feature_Selection_Method","339503490_Local_Preserving_Logistic_I-Relief_for_Semi-supervised_Feature_Selection","337309121_Community_detection_algorithm_based_on_nonnegative_matrix_factorization_and_pairwise_constraints","336397395_Multi-view_Adaptive_Semi-supervised_Feature_Selection_with_the_self-paced_learning","335922315_Automated_cortical_thickness_and_skewness_feature_selection_in_bipolar_disorder_using_a_semi-supervised_learning_method","335193827_Binary_Differential_Evolution_with_Self-learning_for_Multi-objective_Feature_Selection"]}