{"id":"344464335_Applications_and_Limitations_of_Machine_Learning_in_Radiation_Oncology","abstract":"Machine learning approaches to problem-solving are growing rapidly within healthcare, and radiation oncology is no exception. With the burgeoning interest in machine learning comes the significant risk of misaligned expectations as to what it can and cannot accomplish. This paper evaluates the roles of machine learning research and the problems they solve within the context of current clinical challenges in radiation oncology. The role of learning algorithms within the workflow for external beam radiation therapy are surveyed, considering simulation imaging, multi modal fusion, image segmentation, treatment planning, quality assurance, and treatment delivery and adaptation. For each aspect, the clinical challenges faced, the learning algorithms proposed, and the successes and limitations of various approaches are analysed. It is observed that machine learning has largely thrived on reproducibly mimicking conventional human-driven solutions with more efficiency and consistency. On the other hand, since algorithms are generally trained using expert opinion as ground truth, machine learning is of limited utility where problems or ground truths are not well-defined, or if suitable measures of correctness are not available. As a result, machines may excel at replicating, automating and standardising human behaviour on manual chores, meanwhile the conceptual clinical challenges relating to definition, evaluation, and judgement remain in the realm of human intelligence and insight.","authors":["Daniel Jarrett","Eleanor Stride","Katherine Vallis","Mark John Gooding"],"meta":["May 2019The British journal of radiology 92(3458)","DOI:10.1259/bjr.20190001"],"references":["330765732_A_feasibility_study_for_predicting_optimal_radiation_therapy_dose_distributions_of_prostate_cancer_patients_from_patient_anatomy_using_deep_learning","328623134_The_evolution_of_image_reconstruction_for_CT-from_filtered_back_projection_to_artificial_intelligence","327679189_Adversarial_Image_Registration_with_Application_for_MR_and_TRUS_Image_Fusion","326993804_Dose_evaluation_of_fast_synthetic-CT_generation_using_a_generative_adversarial_network_for_general_pelvis_MR-only_radiotherapy","326745660_Dosimetric_analysis_of_Tomotherapy-based_intracranial_stereotactic_radiosurgery_of_brain_metastasis","326654171_The_Role_of_Machine_Learning_in_Knowledge-Based_Response-Adapted_Radiotherapy","327748409_Comparative_evaluation_of_auto-contouring_in_clinical_practice_a_practical_method_using_the_Turing_Test","327115344_OA127_Cone-beam_CT_intensity_correction_for_adaptive_radiotherapy_of_the_prostate_using_deep_learning","327048435_An_unsupervised_convolutional_neural_network-based_algorithm_for_deformable_image_registration","325729957_Artificial_intelligence_in_radiation_oncology_A_specialty-wide_disruptive_transformation"]}