{"id":"344427448_Performance_Analysis_of_Optical-CDMA_for_Uplink_Transmission_in_Medical_Extra-WBANs","abstract":"This paper considers the use of infrared wireless communications for uplink transmission in extra wireless body-area networks. We focus on a multiuser medical application, where the collected medical data of several patients inside a hospital room is transmitted to one or several access points (APs). For this uplink transmission, we investigate the performance of optical code-division multiple access in asynchronous mode, while taking into account the effect of random transmitter orientation. For this purpose and to consider realistic scenarios, we implement an orientation-based random waypoint mobility model to consider the mobility of patients inside a hospital ward. Performance evaluation is done in terms of the link average bit-error-rate and outage probability. We further investigate the performance improvement by using several APs, compared with the case of a single AP. INDEX TERMS Wireless body area networks, medical WBAN, telemedicine, wireless optical communications , infrared data transmission, optical code-division multiple access, random waypoint model, binary pulse-position modulation.","authors":["Jahid Hasan","Mohammad-Ali Khalighi","Jorge García-Márquez","Bastien Béchadergue"],"meta":["September 2020IEEE Access 8:171672","DOI:10.1109/ACCESS.2020.3025005","Projects: Marie Skłodowska-Curie Multi Initial Training Network (ITN-VISION) on Visible light based Interoperability and NetworkingMarie Skłodowska-Curie Multi Initial Training Network (ITN) on Visible light based Interoperability and Networking"],"references":["341812357_Channel_Characterization_and_Modeling_for_Optical_Wireless_Body-Area_Networks","335585463_Optical_Wireless_Network_Design_for_Off-Body-Sensor_Based_Monitoring","332054901_Random_Waypoint_Mobility_Model_in_Space_Modulation_Systems","331677136_Real-Time_Healthcare_Data_Transmission_for_Remote_Patient_Monitoring_in_Patch-Based_Hybrid_OCCBLE_Networks","346857140_Experimental_Implementation_of_Optical-CDMA_for_Medical_Extra-WBAN_Links","345478752_Infrared-Based_Multiple-Patient_Monitoring_in_Indoor_Optical_Wireless_Healthcare_Systems","341657336_Quaternions_and_Rotation_Sequences_A_Primer_with_Applications_to_Orbits_Aerospace_and_Virtual_Reality","338960652_Channel_characterization_for_optical_extra-WBAN_links_considering_local_and_global_user_mobility","335240602_Enabling_Communication_Technologies_for_Medical_Wireless_Body-Area_Networks","334349023_Optical_Wireless_Communications_System_and_Channel_Modelling_with_MATLABR"]}