{"id":"344458547_Taking_Authorial_Stance_in_Arabic_Research_Articles_Introductions","abstract":"This study examines the linguistic resources employed by Arab academic researchers to realize the interpersonal values when introducing their research topics. It also investigates how the linguistic resources interact with the rhetorical move functions to formulate the features of effective authorial stance. Specifically, the study focuses on how the interplay of engagement resources and rhetorical move functions persuasively serves the overall argumentative writing expected in academic context. To this end, the study draws on the engagement system by Martin and White (2005) and the move structure in the CARS model by Swales (1990). The data consisted of 20 Arabic RA introductions drawn from two established journals in the field of education. The results showed an evident relation between the meanings conceived in rhetorical moves and authorial stances. The authorial stances were highly interpersonal and dialogic as most of propositions displayed linguistic features pertaining to heterogloss. Furthermore, writers tended to take assertive stance when reporting previous research findings by drawing heavily on Proclaim options, but when creating research gaps, they relied on Disclaim options. When theorizing for their studies, they, however, seemed to claim sharing views with readers through notable employment of Attribute resources. These results may raise writers' awareness of the relationship between authorial stance-taking and rhetorical move purposes, and how that is crucial for the formulation of persuasive argument endeavored in academic writing.","authors":["Hmoud S. Alotaibi","Hamid Arabi"],"meta":["January 2020","DOI:10.33806/ijaes2000.20.2.2"],"references":["344402615_The_research_gap_in_the_introductions_of_Arabic_research_articles","286102062_Evaluation_in_Chinese_university_EFL_students'_English_argumentative_writing_An_APPRAISAL_study","284063038_A_contrastive_rhetoric_study_of_Arabic_and_English_research_article_introductions","277596428_Reworking_the_appraisal_framework_in_ESL_research_refining_attitude_resources","308352751_Stance-taking_as_negotiating_academic_conflict_in_applied_linguistics_research_article_discussion_sections","303239248_Direct_or_indirect_Critical_or_uncritical_Evaluation_in_Chinese_English-major_MA_thesis_literature_reviews","299534502_The_Language_of_Evaluation_Appraisal_in_English","294423019_Evaluative_language_in_discussion_sections_of_doctoral_theses_Similarities_and_differences_between_L1_Chinese_and_L1_English_writers","282795376_Expressing_an_evaluative_stance_in_English_and_Malay_research_article_conclusions_International_publications_versus_local_publications","271112082_Speech_Genres_Other_Late_Essays"]}