{"id":"344428957_Digital_Twin_and_Internet_of_Things-Current_Standards_Landscape","abstract":"Industry 4.0 is revolutionizing industrial production by bridging the physical and the virtual worlds and further improving digitalization. Two essential building blocks in industry 4.0 are digital twins (DT) and the internet of things (IoT). While IoT is about connecting resources and collecting data about the physical world, DTs are the virtual representations of resources organizing and managing information and being tightly integrated with artificial intelligence, machine learning and cognitive services to further optimize and automate production. The concepts of DTs and IoT are overlapping when it comes to describing, discovering and accessing resources. Currently, there are multiple DT and IoT standards covering these overlapping aspects created by different organizations with different backgrounds and perspectives. With regard to interoperability, which is presumably the most important aspect of industry 4.0, this barrier needs to be overcome by consolidation of standards. The objective of this paper is to investigate current DT and IoT standards and provide insights to stimulate this consolidation. Overlapping aspects are identified and a classification scheme is created and applied to the standards. The results are compared, aspects with high similarity or divergence are identified and a proposal for stimulating consolidation is presented. Consensus between standards are found regarding the elements a resource should consist of and which serialization format(s) and network protocols to use. Controversial topics include which query language to use for discovery as well as if geo-spatial, temporal and historical data should be explicitly supported.","authors":["Michael Jacoby","Thomas Usländer"],"meta":["September 2020Applied Sciences 10(Digital Twins in Industry):6519","DOI:10.3390/app10186519"],"references":["339781418_Shifting_value_stream_patterns_along_the_product_lifecycle_with_digital_twin","339460951_Digital_Twins_for_Industrial_Applications_Definition_Business_Values_Design_Aspects_Standards_and_Use_Cases","339121645_A_Review_of_Interoperability_Standards_for_Industry_40","328180835_Agile_Service_Engineering_in_the_Industrial_Internet_of_Things","342334174_The_contribution_of_systems_science_to_Industry_40","342287143_Digital_Twin_in_the_IoT_Context_A_Survey_on_Technical_Features_Scenarios_and_Architectural_Models","316179453_Industry_40_A_Survey_on_Technologies_Applications_and_Open_Research_Issues","312447704_Linked_data_-_design","300409325_Design_Principles_for_Industrie_40_Scenarios","245965452_DNS-Based_Service_Discovery"]}