{"id":"344538864_On_Confinement_and_Quarantine_Concerns_on_an_SEIAR_Epidemic_Model_with_Simulated_Parameterizations_for_the_COVID-19_Pandemic","abstract":"This paper firstly studies an SIR (susceptible-infectious-recovered) epidemic model without demography and with no disease mortality under both total and under partial quarantine of the susceptible subpopulation or of both the susceptible and the infectious ones in order to satisfy the hospital availability requirements on bed disposal and other necessary treatment means for the seriously infectious subpopulations. The seriously infectious individuals are assumed to be a part of the total infectious being described by a time-varying proportional function. A time-varying upper-bound of those seriously infected individuals has to be satisfied as objective by either a total confinement or partial quarantine intervention of the susceptible subpopulation. Afterwards, a new extended SEIR (susceptible-exposed-infectious-recovered) epidemic model, which is referred to as an SEIAR (susceptible-exposed-symptomatic infectious-asymptomatic infectious-recovered) epidemic model with demography and disease mortality is given and focused on so as to extend the above developed ideas on the SIR model. A proportionally gain in the model parameterization is assumed to distribute the transition from the exposed to the infectious into the two infectious individuals (namely, symptomatic and asymptomatic individuals). Such a model is evaluated under total or partial quarantines of all or of some of the subpopulations which have the effect of decreasing the number of contagions. Simulated numerical examples are also discussed related to model parameterizations of usefulness related to the current COVID-19 pandemic outbreaks.","authors":["Manuel De la Sen","Asier Ibeas","Ravi Agarwal"],"meta":["October 2020Symmetry 2020(16)","DOI:10.3390/sym12101646"],"references":["342777669_Possible_effects_of_mixed_prevention_strategy_for_COVID-19_epidemic_massive_testing_quarantine_and_social_distancing","341907880_A_nonlinear_epidemiological_model_considering_asymptotic_and_quarantine_classes_for_SARS_CoV-2_virus","341678894_COVID-19_Development_of_a_robust_mathematical_model_and_simulation_package_with_consideration_for_ageing_population_and_time_delay_for_control_action_and_resusceptibility","341414205_A_Systematic_Review_of_Asymptomatic_Infections_with_COVID-19","341306427_On_the_Use_of_Entropy_Issues_to_Evaluate_and_Control_the_Transients_in_Some_Epidemic_Models","341303334_Positive_explicit_and_implicit_computational_techniques_for_reaction-diffusion_epidemic_model_of_dengue_disease_dynamics","351594377_On_a_new_SEIRDE_o_I_o_epidemic_model_eventually_initiated_from_outside_with_delayed_re-susceptibility_and_vaccination_and_treatment_feedback_controls","341583848_An_efficient_algorithm_for_solving_the_fractional_optimal_control_of_SIRV_epidemic_model_with_a_combination_of_vaccination_and_treatment","341365682_Death_Toll_Estimation_for_COVID-19_Is_the_Curve_Flattened_Yet","341323554_The_Prediction_of_COVID-19_Pandemic_for_top-15_Affected_Countries_using_advance_ARIMA_model"]}