{"id":"344519188_Roles_of_Continuous_Assessment_Scores_in_Determining_the_Academic_Performance_of_Computer_Science_Students_In_Federal_College_Of_Wildlife_Management","abstract":"This research studied the relationship between continuous assessment and final examination scores of computer science students in Federal College of Wildlife Management, New Bussa, Niger state. The study specifically sought to find out the different assessment strategies, frequency of continuous assessment and their contribution to students' academic performance. Continuous assessment scores and the final grades obtained in some ND1 and ND2 courses offered by current ND2 students of 2013/2014 sets of National Diploma students of computer science department in the college were collected for the study and correlational analysis was performed on the data collected. The results of the study showed that the students' scores obtained in the final examination was a function of the scores obtained in the C.A. Hence, it was concluded that if the disadvantages of continuous assessments (which include teacher subjectivity, the existence of different standards, high implications on time in terms of record keeping etc.) were well taken care of, effective continuous assessments will improve the whole performance of the students during a given period of schooling. Furthermore, it was recommended that lecturers should focus their efforts on making C.A tests more efficient because there is an appreciable effect on students' examination score. Assessment: a process through which the quality of astudents' performance is measured and judged, Continuous assessment: is therefore the assessment of students' progress based on work they do or tests they take throughout the term or year, rather than on a single examination, Academic: relating to education, educational studies, an educational institution, or the educational system, Performance: the way in which somebody does a job, judged by its effectiveness,Academic performance: is the scholastic standing of a student at a given moment. It refers to how an individual is able to demonstrate his or her intellectual abilities.","authors":["John Onihunwa","Joseph Olusegun Adigun","Irunokhai Eric Aghiomesi","Yusuf Sada"],"meta":["January 2018American Journal of Engineering Research 7(5):7-20"],"references":["344519158_Effect_of_Gender_on_Students'_Academic_Performance_in_Computer_Studies_in_Secondary_Schools_in_New_Bussa_Borgu_Local_Government_of_Niger_State","271319399_Continuous_Assessment_Mock_Results_and_Gender_as_Predictors_of_Academic_Performance_of_Chemistry_Students_in_WASSCE_and_NECO_Examinations_in_Ekiti_State","239958728_Educational_Assessment_of_Students"]}