{"id":"344515888_A_Bucket_Graph_Based_Labeling_Algorithm_with_Application_to_Vehicle_Routing","abstract":"We consider the Shortest Path Problem with Resource Constraints (SPPRC) arising as a subproblem in state-of-the-art Branch-Cut-and-Price algorithms for vehicle routing problems. We propose a variant of the bi-directional label correcting algorithm in which the labels are stored and extended according to the so-called bucket graph. Such organization of labels helps to decrease significantly the number of dominance checks and the running time of the algorithm. We also show how the forward/backward route symmetry can be exploited and how to eliminate arcs from the bucket graph using reduced costs. The proposed algorithm can be especially beneficial for vehicle routing instances with large vehicle capacity and/or with time window constraints. Computational experiments were performed on instances from the distance constrained vehicle routing problem, including multi-depot and site-dependent variants, on the vehicle routing problem with time windows, and on the \"nightmare\" instances of the heterogeneous fleet vehicle routing problem. Significant improvements over the best algorithms in the literature were achieved and many instances could be solved for the first time.","authors":["Ruslan Sadykov","Eduardo Uchoa","Artur Pessoa"],"meta":["October 2020Transportation Science 55(1)","DOI:10.1287/trsc.2020.0985"],"references":["355928331_BaPCod_-_a_generic_branch-and-price_code","320959900_A_hybrid_heuristic_for_a_broad_class_of_vehicle_routing_problems_with_heterogeneous_fleet","269696464_Automation_and_Combination_of_Linear-Programming_Based_Stabilization_Techniques_in_Column_Generation","318828253_New_Enhancements_for_the_Exact_Solution_of_the_Vehicle_Routing_Problem_with_Time_Windows","314855965_Asymmetry_matters_Dynamic_Half-Way_Points_in_Bidirectional_Labeling_for_Solving_Shortest_Path_Problems_with_Resource_Constraints_Faster","314030231_Limited_memory_Rank-1_Cuts_for_Vehicle_Routing_Problems","303739411_Improved_branch-cut-and-price_for_capacitated_vehicle_routing","285833922_Chapter_3_New_Exact_Algorithms_for_the_Capacitated_Vehicle_Routing_Problem","275623890_Dynamic_ng-Path_Relaxation_for_the_Delivery_Man_Problem","264994054_Improved_Branch-Cut-and-Price_for_Capacitated_Vehicle_Routing"]}