{"id":"344579687_The_COVID-19_Pandemic_When_E-Learning_Becomes_Mandatory_Not_Complementary","abstract":"The novel coronavirus, SARS Coronavirus-2 (SARS-COV-2), is a new strain of coronavirus that causes COVID-19. SARS-COV-2 was first identified in China and spread rapidly across the world. Many countries have implemented extraordinary measures in response to the COVID-19 outbreak, including closing schools and universities and moving to remote teaching. E-learning is an important education method and many e-learning systems were developed to provide fast delivery, effective learning, and better and easier communication. E-learning was previously a complementary methodology or a luxury but the COVID-19 outbreak has made e-learning mandatory. It is the only way to continue schools and universities educational programs. Assessing the value of e-learning is more important than ever. Students are the focal point of the educational process; continuous and conscious monitoring of their satisfaction is crucial for the feasibility of e-learning. This paper aims to study the impact of the sudden move to remote teaching (e-learning educational process) on students at four universities in two countries (the Kingdom of Saudi Arabia and the Hashemite Kingdom of Jordan). Participating students were surveyed to measure their perceptions in terms of current e-learning processes and systems, and their experience with the e-learning educational process. The hypotheses are accepted and rejected based on statistical analysis of student responses. Overall, students had a negative attitude towards e-learning, which was expected as the move to e-learning occurred quickly and without proper planning.","authors":["Mohammed Akour","Mamdouh Alenezi","Hiba Alsghaier","Yazan Alshboul"],"meta":["January 2021International Journal of Technology Enhanced Learning 1(1)","DOI:10.1504/IJTEL.2020.10034006"],"references":["342127177_COVID-19_Threat_or_Opportunity_for_Online_Education","341776919_The_Impact_of_Covid-19_to_Indonesian_Education_and_Its_Relation_to_the_Philosophy_of_Merdeka_Belajar","339993967_Suspending_Classes_Without_Stopping_Learning_China's_Education_Emergency_Management_Policy_in_the_COVID-19_Outbreak","339378330_Risk_Management_of_COVID-19_by_Universities_in_China","330659043_The_Study_of_User_Acceptance_Toward_E-Learning_System_in_Higher_Education","327042825_Factors_affecting_the_E-learning_acceptance_A_case_study_from_UAE","283503814_E-learning_Opens_Door_to_the_Global_Community_Novice_Users'_Experiences_of_E-learning_in_a_Somali_University","321533014_E-learning_success_determinants_Brazilian_empirical_study","316203784_Examining_the_students'_behavioral_intention_to_use_e-learning_in_Azerbaijan_The_General_Extended_Technology_Acceptance_Model_for_E-learning_approach","304011024_Cultural_impacts_on_e-learning_systems'_success"]}