{"id":"344587555_Improving_the_Efficiency_of_Deep_Learning_Methods_in_Remote_Sensing_Data_Analysis_Geosystem_Approach","abstract":"The article proposes a solution for the problem of high-resolution remote sensing data classification by applying deep learning methods and algorithms in conditions of labeled data scarcity. The problem can be solved within the geosystem approach, through the analysis of the genetic uniformity of spatially adjacent entities of different scale and hierarchical level. Advantages of the proposed GeoSystemNet model rest on a large number of freedom degrees, admitting flexible configuration of the model contingent upon the task at hand. Testing GeoSystemNet for classification of EuroSAT dataset, algorithmically augmented after the geosystem approach, demonstrated the possibility to improve the classification precision in conditions of labeled data accuracy by 9% and to obtain the classification precision with a larger volume of training data (by 2%) which is slightly inferior in comparison with other deep models. The article also shows that synthesis of the geosystem approach with deep learning capabilities allows us to optimize the diagnostics of exogeodynamic processes, owing to the calculation of landscape differentiation regularities. Application of the presented approach enabled us to improve the accuracy in detecting landslides at the testing site ''Mordovia'' by 5% in comparison with the classical approach of using deep models for remote sensing data analysis. The authors advocate that application of the geosystem approach to improve the efficiency of remote sensing data classification through methods, proposed in the article, requires an individual project-based approach to source data augmentation. INDEX TERMS Convolutional neural networks, deep learning, geospatial analysis, geosystems, image classification, machine learning.","authors":["Stanislav Yamashkin","Anatoliy Yamashkin","Victor V Zanozin","Milan Radovanovic"],"meta":["October 2020IEEE Access 8:179516 - 179529","DOI:10.1109/ACCESS.2020.3028030","Project: Spatial Data Infrastuctures and Spatial Data Analysis"],"references":["330261233_Overcoming_data_scarcity_in_flood_hazard_assessment_using_remote_sensing_and_artificial_neural_network","319463676_EuroSAT_A_Novel_Dataset_and_Deep_Learning_Benchmark_for_Land_Use_and_Land_Cover_Classification","333226219_DenseU-Net-Based_Semantic_Segmentation_of_Small_Objects_in_Urban_Remote_Sensing_Images","331542840_Deep_Learning-Based_Classification_Methods_for_Remote_Sensing_Images_in_Urban_Built-Up_Areas","322278874_Deep_Learning_in_Remote_Sensing_A_Comprehensive_Review_and_List_of_Resources","322191274_A_deep_learning_approach_for_detecting_traffic_accidents_from_social_media_data","320968382_Xception_Deep_Learning_with_Depthwise_Separable_Convolutions","319495524_Hyperspectral_anomaly_detection_based_on_stacked_denoising_autoencoders","316572572_Deep_Recurrent_Neural_Networks_for_Hyperspectral_Image_Classification","316098191_Land_Cover_Classification_via_Multi-temporal_Spatial_Data_by_Recurrent_Neural_Networks"]}