{"id":"344529498_Machine_Learning_Model_for_Identifying_Antioxidant_Proteins_Using_Features_Calculated_from_Primary_Sequences","abstract":"Antioxidant proteins are involved importantly in many aspects of cellular life activities. They protect the cell and DNA from oxidative substances (such as peroxide, nitric oxide, oxygen-free radicals, etc.) which are known as reactive oxygen species (ROS). Free radical generation and antioxidant defenses are opposing factors in the human body and the balance between them is necessary to maintain a healthy body. An unhealthy routine or the degeneration of age can break the balance, leading to more ROS than antioxidants, causing damage to health. In general, the antioxidant mechanism is the combination of antioxidant molecules and ROS in a one-electron reaction. Creating computational models to promptly identify antioxidant candidates is essential in supporting antioxidant detection experiments in the laboratory. In this study, we proposed a machine learning-based model for this prediction purpose from a benchmark set of sequencing data. The experiments were conducted by using 10-fold cross-validation on the training process and validated by three different independent datasets. Different machine learning and deep learning algorithms have been evaluated on an optimal set of sequence features. Among them, Random Forest has been identified as the best model to identify antioxidant proteins with the highest performance. Our optimal model achieved high accuracy of 84.6%, as well as a balance in sensitivity (81.5%) and specificity (85.1%) for antioxidant protein identification on the training dataset. The performance results from different independent datasets also showed the significance in our model compared to previously published works on antioxidant protein identification.","authors":["Luu Ho Thanh Lam","Ngoc Hoang Le","Le Van Tuan","Ho Tran Ban"],"meta":["October 2020Biology 9(10):325","DOI:10.3390/biology9100325"],"references":["344282867_XGBoost_Improves_Classification_of_MGMT_Promoter_Methylation_Status_in_IDH1_Wildtype_Glioblastoma","343184279_Identifying_Antioxidant_Proteins_by_Combining_Multiple_Methods","342664308_Using_deep_neural_networks_and_biological_subwords_to_detect_protein_S-sulfenylation_sites","335888922_AOPs-SVM_A_Sequence-Based_Classifier_of_Antioxidant_Proteins_Using_a_Support_Vector_Machine","332668817_WekaDeeplearning4j_A_deep_learning_package_for_Weka_based_on_Deeplearning4j","331702618_iLearn_an_integrated_platform_and_meta-learner_for_feature_engineering_machine_learning_analysis_and_modeling_of_DNA_RNA_and_protein_sequence_data","325802746_SeqSVM_A_Sequence-Based_Support_Vector_Machine_Method_for_Identifying_Antioxidant_Proteins","323549941_iFeature_A_Python_package_and_web_server_for_features_extraction_and_selection_from_protein_and_peptide_sequences","332516231_Prediction_of_Antioxidant_proteins_by_incorporating_statistical_moments_based_features_into_Chou's_PseAAC","319184382_Endogenous_non-enzymatic_antioxidants_in_the_human_body"]}