{"id":"344667545_Intelligent_Detection_of_IoT_Botnets_Using_Machine_Learning_and_Deep_Learning","abstract":"As the number of Internet of Things (IoT) devices connected to the network rapidly increases, network attacks such as flooding and Denial of Service (DoS) are also increasing. These attacks cause network disruption and denial of service to IoT devices. However, a large number of heterogenous devices deployed in the IoT environment make it difficult to detect IoT attacks using traditional rule-based security solutions. It is challenging to develop optimal security models for each type of the device. Machine learning (ML) is an alternative technique that allows one to develop optimal security models based on empirical data from each device. We employ the ML technique for IoT attack detection. We focus on botnet attacks targeting various IoT devices and develop ML-based models for each type of device. We use the N-BaIoT dataset generated by injecting botnet attacks (Bashlite and Mirai) into various types of IoT devices, including a Doorbell, Baby Monitor, Security Camera, and Webcam. We develop a botnet detection model for each device using numerous ML models, including deep learning (DL) models. We then analyze the effective models with a high detection F1-score by carrying out multiclass classification, as well as binary classification, for each model.","authors":["Jiyeon Kim","Yulim Shin"],"meta":["October 2020Applied Sciences","DOI:10.3390/app10197009"],"references":["345121649_Wormhole_Attack_a_Major_Security_Concern_in_Internet_of_Things_Iot","334449850_Unsupervised_intelligent_system_based_on_one_class_support_vector_machine_and_Grey_Wolf_optimization_for_IoT_botnet_detection","332277406_Demystifying_IoT_Security_An_Exhaustive_Survey_on_IoT_Vulnerabilities_and_a_First_Empirical_Look_on_Internet-Scale_IoT_Exploitations","331150862_INTERNET_OF_THINGS_AND_THE_MAN-IN-THE-MIDDLE_ATTACKS_-_SECURITY_AND_ECONOMIC_RISKS","329936193_Ransomware_Auto-Detection_In_IoT_Devices_Using_Machine_Learning","328782359_Deep_Learning_for_Detection_of_Routing_Attacks_in_the_Internet_of_Things","340813643_A_Survey_of_Machine_and_Deep_Learning_Methods_for_Internet_of_Things_IoT_Security","338948867_Identifying_and_Characterizing_Bashlite_and_Mirai_CC_Servers","331542942_An_Adaptive_Resource_Allocation_Model_With_Anti-Jamming_in_IoT_Network","329064099_The_Evolution_of_Bashlite_and_Mirai_IoT_Botnets"]}