{"id":"344641524_OPEN_SOURCE_ARCHIVES_OF_COMPUTER_SCIENCE_STUDENT_PROJECTS","abstract":"Get the best guidance in final year computer science student's projects for semester and use it in the project research and development of academic projects. We help students to develop ideas such projects for final year preparations. Get professionally designed projects based self-learning kits for your research as well as needs. We design the best quality self-learning projects based on documentation for last year graduation guidelines to suit requirements for computer science college. Get a highly interactive project kit as a part of computer science projects. And according to the conditions required by the university of computer science and are useful for novice students to take the experience and for students applying for their evidence in the preparation of graduation search and discussions and choose the appropriate group .it contains a plate containing several icons of the first archive containing previous projects a description of each project with the language used icon panel discussion in order to continue registered there is also an icon for ads about competent in this area courses there icon frequently asked questions that are specific sites for the correct spell and graphics are generally very useful for students and teachers The aim The aim of this project is to develop website that improve the ability of students, supervisors, administrator to create the projects, Our site useful for novice students to take the experience and for students applying for their evidence in the preparation of graduation search and discussions and choose the appropriate group., get professionally designed projects based self-learning kits for student's research as well as needs. It allow student, supervisor and administrator can retrieve all projects from the database. The project seeks to facilitate the whole process of creating the project. To pursue creative research and new technologies in computer science to contribute to make a knowledge-based site in the areas of computer science and information technology in abha Problems definition","authors":["M.K.Jayanthi Kannan","Bushra Alamri","Amal Mushabab","Somayh Mushabab"],"meta":["October 2020","Project: Open Source Archives of Computer Science Students Projects"],"references":[]}