{"id":"344624095_Assessing_the_Attitude_Towards_Artificial_Intelligence_Introduction_of_a_Short_Measure_in_German_Chinese_and_English_Language","abstract":"In the context of (digital) human-machine interaction, people are increasingly dealing with artificial intelligence in everyday life. Through this, we observe humans who embrace technological advances with a positive attitude. Others, however, are particularly sceptical and claim to foresee substantial problems arising from such uses of technology. The aim of the present study was to introduce a short measure to assess the Attitude Towards Artificial Intelligence (ATAI scale) in the German, Chinese, and English languages. Participants from Germany (N = 461; 345 females), China (N = 413; 145 females), and the UK (N = 84; 65 females) completed the ATAI scale, for which the factorial structure was tested and compared between the samples. Participants from Germany and China were additionally asked about their willingness to interact with/use self-driving cars, Siri, Alexa, the social robot Pepper, and the humanoid robot Erica, which are representatives of popular artificial intelligence products. The results showed that the five-item ATAI scale comprises two negatively associated factors assessing (1) acceptance and (2) fear of artificial intelligence. The factor structure was found to be similar across the Ger-man, Chinese, and UK samples. Additionally, the ATAI scale was validated, as the items on the willingness to use specific artificial intelligence products were positively associated with the ATAI Acceptance scale and negatively with the ATAI Fear scale, in both the German and Chinese samples. In conclusion we introduce a short, reliable, and valid measure on the attitude towards artificial intelligence in German, Chinese, and English language.","authors":["Cornelia Sindermann","· Peng","Min Zhou","Jennifer Wernicke"],"meta":["October 2020KI - Ku_nstliche Intelligenz","DOI:10.1007/s1321"],"references":["334975915_Psychological_reactions_to_human_versus_robotic_job_replacement","312199357_Artificial_Intelligence_in_Medicine","307565352_ERICA_The_ERATO_Intelligent_Conversational_Android","328053421_Cross-cultural_research_projects_as_an_effective_solution_for_the_replication_crisis_in_psychology_and_psychiatry","318772396_The_jobs_that_artificial_intelligence_will_create","318393770_R_A_Language_and_Environment_for_Statistical_Computing","312854551_Fragen_Sie_Alexa_Die_Entmundigung_des_Individuums_durch_die_Vermessung_der_Welt","309897772_Gender_and_attitudes_toward_technology_use_A_meta-analysis","291161776_Hmisc_Harrell_Miscellaneous","290916042_Google_and_ITE_the_road_ahead_for_self-driving_cars"]}