{"id":"344651257_Multi-Source_Neural_Machine_Translation_With_Missing_Data","abstract":"Machine translation is rife with ambiguities in word ordering and word choice, and even with the advent of machine-learning methods that learn to resolve this ambiguity based on statistics from large corpora, mistakes are frequent. Multi-source translation is an approach that attempts to resolve these ambiguities by exploiting multiple inputs (e.g. sentences in three different languages) to increase translation accuracy. These methods are trained on multilingual corpora, which include the multiple source languages and the target language, and then at test time uses information from both source languages while generating the target. While there are many of these multilingual corpora, such as multilingual translations of TED talks or European parliament proceedings, in practice, many multilingual corpora are not complete due to the difficulty to provide translations in all of the relevant languages. Existing studies on multi-source translation did not explicitly handle such situations, and thus are only applicable to complete corpora that have all of the languages of interest, severely limiting their practical applicability. In this article, we examine approaches for multi-source neural machine translation (NMT) that can learn from and translate such incomplete corpora. Specifically, we propose methods to deal with incomplete corpora at both training time and test time. For training time, we examine two methods: (1) a simple method that simply replaces missing source translations with a special NULL symbol, and (2) a data augmentation approach that fills in incomplete parts with source translations created from multi-source NMT. For test-time, we examine methods that use multi-source translation even when only a single source is provided by first translating into an additional auxiliary language using standard NMT, then using multi-source translation on the original source and this generated auxiliary language sentence. Extensive experiments demonstrate that the proposed training-time and test-time methods both significantly improve translation performance.","authors":["Yuta Nishimura","Katsuhito Sudoh","Graham Neubig","Satoshi Nakamura"],"meta":["January 2020IEEE/ACM Transactions on Audio, Speech, and Language Processing 28:569-580","DOI:10.1109/TASLP.2019.2959224"],"references":["311990379_Zero-Resource_Translation_with_Multi-Lingual_Neural_Machine_Translation","310329043_Toward_Multilingual_Neural_Machine_Translation_with_Universal_Encoder_and_Decoder","305341989_Multi-Way_Multilingual_Neural_Machine_Translation_with_a_Shared_Attention_Mechanism","303486119_The_United_Nations_Parallel_Corpus_v10","301404440_Multi-Task_Learning_for_Multiple_Language_Translation","301404410_Multi-Target_Machine_Translation_with_Multi-Synchronous_Context-free_Grammars","265252627_Neural_Machine_Translation_by_Jointly_Learning_to_Align_and_Translate","2588204_BLEU_a_Method_for_Automatic_Evaluation_of_Machine_Translation","2400445_Statistical_Multi-Source_Translation","334117664_Multi-Source_Neural_Machine_Translation_with_Missing_Data","334116961_Enhancement_of_Encoder_and_Attention_Using_Target_Monolingual_Corpora_in_Neural_Machine_Translation","334115933_SwitchOut_an_Efficient_Data_Augmentation_Algorithm_for_Neural_Machine_Translation","334115773_Subword_Regularization_Improving_Neural_Network_Translation_Models_with_Multiple_Subword_Candidates","334115672_NTT's_Neural_Machine_Translation_Systems_for_WMT_2018","334115579_A_Call_for_Clarity_in_Reporting_BLEU_Scores","312417327_Sequence-Level_Knowledge_Distillation","310235569_Google's_Multilingual_Neural_Machine_Translation_System_Enabling_Zero-Shot_Translation","306092988_Improving_Neural_Machine_Translation_Models_with_Monolingual_Data","305334460_Multi-Source_Neural_Translation","281145060_Effective_Approaches_to_Attention-based_Neural_Machine_Translation","270878382_News_from_OPUS-A_Collection_of_Multilingual_Parallel_Corpora_with_Tools_and_Interfaces","269935079_Adam_A_Method_for_Stochastic_Optimization","228379274_EuroParl_A_parallel_corpus_for_statistical_machine_translation","227022836_Pivot_language_approach_for_phrase-based_statistical_machine_translation"]}