{"id":"344673148_Text_Preprocessing_for_Text_Mining_in_Organizational_Research_Review_and_Recommendations_In-press_at_Organizational_Research_Methods","abstract":"Recent advances in text mining have provided new methods for capitalizing on the voluminous natural language text data created by organizations, their employees, and their customers. While often overlooked, decisions made during text preprocessing affect whether the content and/or style of language are captured, the statistical power of subsequent analyses, and the validity of insights derived from text mining. Past methodological papers have described the general process of obtaining and analyzing text data, but recommendations for preprocessing text data were inconsistent. Further, primary studies use and report different preprocessing techniques. To address this, we conduct two complementary reviews of computational linguistics and organizational text mining research to provide empirically grounded text preprocessing decision-making recommendations that account for the type of text mining conducted (i.e., open or closed vocabulary), the research question under investigation, and the dataset’s characteristics (i.e., corpus size and average document length). Notably, deviations from these recommendations will be appropriate and, at times, necessary due to the unique characteristics of one’s text data. We also provide recommendations for reporting text mining to promote transparency and reproducibility.","authors":["Louis Hickman","Stuti Thapa","Louis Tay","Mengyang Cao"],"meta":["October 2020Organizational Research Methods in press(2)","DOI:10.1177/1094428120971683"],"references":["339982951_The_Role_of_Pre-processing_in_Twitter_Sentiment_Analysis","337987684_Social_media-predicted_personality_traits_and_values_can_help_match_people_to_their_ideal_jobs","337055919_Big_Data_in_Industrial-Organizational_Psychology_and_Human_Resource_Management_Forward_Progress_for_Organizational_Research_and_Practice","333678066_Preprocessing_Role_in_Analyzing_Tweets_Towards_Requirement_Engineering","335778946_Probing_Neural_Network_Comprehension_of_Natural_Language_Arguments","335679671_We_Ask_Men_to_Win_and_Women_Not_to_Lose_Closing_the_Gender_Gap_in_Startup_Funding","335640903_A_Comparison_of_Stemming_Techniques_in_Tracing","334115898_A_La_Carte_Embedding_Cheap_but_Effective_Induction_of_Semantic_Feature_Vectors","334115738_Word_Sense_Induction_with_Neural_biLM_and_Symmetric_Patterns","333342577_An_Experimental_Study_of_Text_Preprocessing_Techniques_for_Automatic_Short_Answer_Grading_in_Indonesian"]}