{"id":"344640924_Parking_recommender_system_privacy_preservation_through_anonymization_and_differential_privacy","abstract":"Recent advancements in the Internet of Things (IoT) have enabled the development of smart parking systems that use services of third‐party parking recommender system to provide recommendations of personalized parking spot to users based on their past experience. However, the indiscriminate sharing of users' data with an untrusted (or semitrusted) parking recommender system may breach the privacy because users' behavior and mobility patterns could be inferred by analyzing their past history. Therefore, in this article, we present two solutions that preserve privacy of users in parking recommender systems while analyzing the past parking history using k‐anonymity (anonymization) and differential privacy (perturbation) techniques. Specifically, given an original parking database containing users' parking information, the k‐anonymity mechanism constructs an anonymized database, while differential privacy perturbs the query response using the Laplace mechanism, making the users indistinguishable in both approaches, hence preserving the privacy. Experimental results on a data set constructed from real parking measurements evaluate the trade‐off between privacy and utility, therefore enabling users to receive parking spots recommendations while preserving their privacy.","authors":["Yasir Saleem","Mubashir Husain Rehmani","Noel Crespi","Roberto Minerva"],"meta":["February 2021Engineering Reports 3(7)","DOI:10.1002/eng2.12297"],"references":["338409197_A_Comparative_Analysis_of_MachineDeep_Learning_Models_for_Parking_Space_Availability_Prediction","334449006_Sanitizing_and_measuring_privacy_of_large_sparse_datasets_for_recommender_systems","328985631_Smart_City_Services_Over_a_Global_Interoperable_Internet-of-Things_SystemThe_Smart_Parking_Case","328236316_SecSPS_A_Secure_and_Privacy-Preserving_Framework_for_Smart_Parking_Systems","345427320_Parking_Management_A_Blockchain-Based_Privacy-Preserving_System","339874471_Privacy_preserving_internet_of_things_recommender_systems_for_smart_cities","336202695_Differential_Privacy_Techniques_for_Cyber_Physical_Systems_A_Survey","336040121_Privacy_preserving_classification_on_local_differential_privacy_in_data_centers","332063022_An_Edge_Intelligence_Empowered_Recommender_System_Enabling_Cultural_Heritage_Applications","330078320_Cyber_Security_Framework_for_Vehicular_Network_Based_on_a_Hierarchical_Game"]}