{"id":"344617098_If_You_Can_Program_You_Can_Write_Learning_Introductory_Programming_Across_Literacy_Levels","abstract":"Aim/Purpose: This paper presents findings on a curricular intervention aimed at integrating computer programming with reading and writing in early elementary school. The purpose of this research was to explore the relation between students’ varying literacy levels and their level of success in mastering an introductory programming language. Methodology: This curricular intervention study was implemented in a single school district in southeastern Virginia. Of the district’s 33 elementary schools, eight schools received an external grant from the U.S. Department of Defense to introduce computer science in early elementary education. Standardized literacy test scores were correlated with internally developed, and age appropriate programming assessment scores from N = 132 second grade students. Contribution: This study is the first of its kind to look at how students at varying literacy levels succeed in mastering an introductory programming language when introduced through a literacy lens. Findings: The findings indicated that there was strong evidence for a weak, positive correlation between students’ literacy levels, as determined by the PALS assessment, and their programming mastery, as determined by the curricular programming assessments. The positive correlation suggests that there may indeed be underlying constructs that overlap between literacy and programming. Recommendations for Practitioners: Consider integrating computer programming as a foundational component of the literacy curriculum, especially in the early grades, where the two skill sets can mutually support one another. Recommendation for Researchers: Additional research is necessary, using a variety of literacy and programming measures, to continue to understand the relationship between emerging literacy and emerging computer programming skills. Impact on Society: Reimagining computer programming as a language has significant implications for how we teach programming in schools and how students then use programming out in the workforce. Future Research: Future work will repeat this curricular intervention with younger students: the district’s first grade and kindergarten classrooms. Introducing programming through the Coding as Literacy (CAL) approach even earlier in students’ literacy trajectories, we believe, will allow the positive impact of programming knowledge to influence students’ literacy development. In this next phase of our research agenda, we will collect pre and post literacy scores, both standardized and internally developed, to see the myriad ways that programming knowledge impacts literacy.","authors":["Ziva R Hassenfeld","Madhu Govind","Laura E. De Ruiter","Marina Umashi Bers"],"meta":["January 2020Journal of Information Technology Education:Research 19:065-085","DOI:10.28945/4509"],"references":["345127548_The_Impact_of_Teacher_Gender_on_Girls'_Performance_on_Programming_Tasks_in_Early_Elementary_School","333481200_The_Language_of_Programming_A_Cognitive_Perspective","319142998_In_Defense_of_the_Social_Studies_Social_Studies_Programs_in_STEM_Education","344472399_The_acquisition_of_a_child_by_a_learning_disability","339058053_Debugging_the_Writing_Process_Lessons_From_a_Comparison_of_Students'_Coding_and_Writing_Practices","331256954_The_Cambridge_Handbook_of_Computing_Education_Research","330329481_Coding_Literacy_How_Computer_Programming_Is_Changing_Writing","328527684_The_Cognitive_Benefits_of_Learning_Computer_Programming_A_Meta-Analysis_of_Transfer_Effects","326840767_Coding_as_a_Playground_Programming_and_Computational_Thinking_in_the_Early_Childhood_Classroom","318600661_Changing_a_Generation's_Way_of_Thinking_Teaching_Computational_Thinking_Through_Programming"]}