{"id":"344656694_Understanding_design-based_learning_context_and_the_associated_emotional_experience","abstract":"Educational settings are emotional places where students experience diverse emotions in relation to academic activities and their outcomes. Emotions, in turn, greatly influence students’ learning process and engagement. Research on emotions in Design-Based Learning (DBL) has so far been coarse-grained examining how students evaluate their overall feelings towards the DBL project. As yet, little is known regarding how specific DBL activities influence students’ emotional experience. Therefore, we report a three-month field study of a DBL project involving 30 middle school students (aged 13–14) addressing dual research purposes: (1) to faithfully reconstruct the manner and sequence of activities during DBL from a fine-grained perspective; and (2) to examine the relationship between these activities and students’ emotional experience. This study used a mixed research method and collected multiple data sources, including experience sampling surveys, classroom observations, and interviews. The research outcomes in this study are multiple. First, this paper reveals detailed inspection regarding the types of task students performed, the strategies of shifting, and executing tasks during the process student experienced. Second, this paper identifies specific types of activities that have a significant positive or negative relationship with students’ emotional experiences. Derived from reported empirical evidence in the present study, this paper furtherly proposes an Activity-and-Affect model of DBL. This model provides a fine-grained description of DBL activity as continuous along three dimensions: task (design thinking process, project management, social interaction) task strategy (single-tasking vs. multitasking), and collaboration strategy (individual or group). Our analysis highlights the variability in how different DBL activities can be associated with different emotions.","authors":["Feiran Zhang","Panos Markopoulos","Tilde Bekker","María del Puerto Paule Ruíz"],"meta":["October 2020International Journal of Technology and Design Education","DOI:10.1007/s10798-020-09630-w","Project: Design Based Learning in Schools"],"references":["356457575_Understanding_learning_and_emotions_in_Design-Based_Learning_what_and_why_crucial_to_be_considered","344048933_Characterizing_Engineering_Student_Design_Processes_An_Illustration_Of_Iteration","342748998_TE_design_based_learning_assessing_student_critical_thinking_and_problem_solving_abilities","341190691_Children's_Emotions_in_Design-Based_Learning_a_Systematic_Review","337060360_Coaching_in_design-based_learning_a_grounded_theory_approach_to_create_a_theoretical_model_and_practical_propositions_accepted_for_publication","336736479_Measuring_Fun_with_Adolescents_Introducing_the_Spanish_and_Dutch_Adaptation_of_the_FunQ","334047100_EmoForm_Capturing_Children's_Emotions_during_Design_Based_Learning","331557504_Finding_the_connection_between_research_and_design_the_knowledge_development_of_STEM_teachers_in_a_professional_learning_community","329323356_Motivational_factors_in_makerspaces_a_mixed_methods_study_of_elementary_school_students'_situational_interest_self-efficacy_and_achievement_emotions","344838307_The_Impact_of_a_Problem-based_Learning_Launcher_Unit_on_Eighth_Grade_Students'_Motivation_and_Interest_in_Science"]}