{"id":"344640606_An_ILM-cosine_transform-based_improved_approach_to_image_encryption","abstract":"The chaos-based cryptography techniques are used widely to protect digital information from intruders. The chaotic systems have some of special features that make them suitable for the purpose of encryption. These systems are highly unpredictable and are highly sensitive or responsive to the initial conditions, also known as butterfly effect. This sensitive dependence on initial conditions make these systems to exhibit an intricate dynamical behaviour. However, this dynamical behaviour is not much complex in simple one-dimensional chaotic maps. Hence, it becomes easy for an intruder to predict the contents of the message being sent. The proposed work in this paper introduces an improved method for encrypting images, which uses cosine transformation of 3-D Intertwining Logistic Map (ILM). The proposed approach has been split into three major parts. In the first part, Secure Hash Function-256 (SHA-256) is used with cosine transformed ILM (CT-ILM) to generate the chaotic sequence. This chaotic sequence is used by high-efficiency scrambling to reduce the correlations between the adjacent pixels of the image. In the second part, the image is rotated to move all the pixels away from their original position. In the third part, random order substitution is applied to change the value of image pixels. The effectiveness of the proposed method has been tested on a number of standard parameters such as correlation coefficient, Entropy and Unified average change in intensity. The proposed approach has also been tested for decryption parameters like mean square error and peak signal to noise ratio. It can easily be observed from the obtained results that the proposed method of image encryption is more secure and time efficient than some earlier proposed techniques. The approach works for both color and grey scale images.","authors":["Mohit Dua","Arun Suthar","Arpit Garg","Vaibhav Garg"],"meta":["October 2020Complex & Intelligent Systems 7(2)","DOI:10.1007/s40747-020-00201-z"],"references":["337382114_Differential_evolution_optimization_of_intertwining_logistic_map-DNA_based_image_encryption_technique","329876077_Cosine-Transform-Based_Chaotic_System_for_Image_Encryption","329742479_An_Image_Encryption_Algorithm_Based_on_Time-Delay_and_Random_Insertion","328060640_A_novel_approach_to_encrypt_multiple_images_using_multiple_chaotic_maps_and_chaotic_discrete_fractional_random_transform","342860218_An_Image_Encryption_using_Intertwining_Logistic_map_and_Enhanced_Logistic_Map","337301078_Color_Image_Encryption_using_Synchronous_CML-DNA_and_Weighted_Bi-objective_Genetic_Algorithm","335498640_A_Review_of_Chaos_based_Image_Encryption","331532289_A_Color_Image_Encryption_Technique_Based_on_Bit-Level_Permutation_and_Alternate_Logistic_Maps","330184571_A_Color_Image_Encryption_Using_Four_Dimensional_Differential_Equations_and_Arnold_Chaotic_Map","330184508_Symmetric_Multiple_Image_Encryption_Using_Multiple_New_One-Dimensional_Chaotic_Functions_and_Two-Dimensional_Cat_Map"]}