{"id":"344616528_On_critical_points_of_quadratic_low-rank_matrix_optimization_problems","abstract":"The absence of spurious local minima in certain nonconvex low-rank matrix recovery problems has been of recent interest in computer science, machine learning and compressed sensing since it explains the convergence of some low-rank optimization methods to global optima. One such example is low-rank matrix sensing under restricted isometry properties (RIPs). It can be formulated as a minimization problem for a quadratic function on the Riemannian manifold of low-rank matrices, with a positive semidefinite Riemannian Hessian that acts almost like an identity on low-rank matrices. In this work new estimates for singular values of local minima for such problems are given, which lead to improved bounds on RIP constants to ensure absence of nonoptimal local minima and sufficiently negative curvature at all other critical points. A geometric viewpoint is taken, which is inspired by the fact that the Euclidean distance function to a rank-$k$ matrix possesses no critical points on the corresponding embedded submanifold of rank-$k$ matrices except for the single global minimum.","authors":["André Uschmajew","Bart Vandereycken"],"meta":["March 2020IMA Journal of Numerical Analysis 40(4)","DOI:10.1093/imanum/drz061"],"references":["335375373_Nonconvex_Optimization_Meets_Low-Rank_Matrix_Factorization_An_Overview","331193526_The_non-convex_geometry_of_low-rank_matrix_optimization","315796191_Geometry_of_Factored_Nuclear_Norm_Regularization","308026340_Non-square_matrix_sensing_without_spurious_local_minima_via_the_Burer-Monteiro_approach","304017872_The_non-convex_Burer-Monteiro_approach_works_on_smooth_semidefinite_programs","325071570_Global_Optimality_in_Low-Rank_Matrix_Optimization","324328848_Deterministic_Guarantees_for_Burer-Monteiro_Factorizations_of_Smooth_Semidefinite_Programs","315764942_No_Spurious_Local_Minima_in_Nonconvex_Low_Rank_Problems_A_Unified_Geometric_Analysis","305890965_Computational_Methods_for_Linear_Matrix_Equations","303488476_Global_Optimality_of_Local_Search_for_Low_Rank_Matrix_Recovery"]}