{"id":"344631048_Impacts_of_the_COVID-19_Pandemic_on_Life_of_Higher_Education_Students_A_Global_Perspective","abstract":"The paper presents the most comprehensive and large-scale study to date on how students perceive the impacts of the first wave of COVID-19 crisis in early 2020 on various aspects of their lives on a global level. With a sample of 30,383 students from 62 countries, the study reveals that amid the worldwide lockdown and transition to online learning students were most satisfied with the support provided by teaching staff and their universities' public relations. Still, deficient computer skills and the perception of a higher workload prevented them from perceiving their own improved performance in the new teaching environment. Students were mainly concerned about issues to do with their future professional career and studies, and experienced boredom, anxiety, and frustration. The pandemic has led to the adoption of particular hygienic behaviours (e.g., wearing masks, washing hands) and discouraged certain daily practices (e.g., leaving home, shaking hands). Students were also more satisfied with the role played by hospitals and universities during the epidemic compared to the governments and banks. The findings also show that students with certain socio-demographic characteristics (male, part-time, first-level, applied sciences, a lower living standard, from Africa or Asia) were significantly less satisfied with their academic work/life during the crisis, whereas female, full-time, first-level students and students faced with financial problems were generally affected more by the pandemic in terms of their emotional life and personal circumstances. Key factors influencing students' satisfaction with the role of their university are also identified. Policymakers and higher education institutions around the world may benefit from these findings while formulating policy recommendations and strategies to support students during this and any future pandemics.","authors":["Aleksander Aristovnik","Damijana Keržič","Dejan Ravšelj","Lan Umek"],"meta":["October 2020Sustainability 12(20):8438","DOI:10.3390/su12208438","Project: A GLOBAL STUDENT SURVEY ON \"IMPACTS OF THE COVID-19 PANDEMIC ON LIFE OF HIGHER EDUCATION STUDENTS\""],"references":["346055428_Influence_of_COVID-19_confinement_on_students'_performance_in_higher_education","343648002_New_Zealand's_COVID_-19_elimination_strategy","343395006_Impact_of_Covid-19_on_Pharmacy_Students_in_India","343174467_Students_under_lockdown_Comparisons_of_students'_social_networks_and_mental_health_before_and_during_the_COVID-19_crisis_in_Switzerland","343137568_Digital_readiness_and_its_effects_on_higher_education_student_socio-emotional_experiences_in_the_context_of_COVID-19_pandemic","343131911_Studying_During_the_COVID-19_Pandemic_A_Qualitative_Inductive_Content_Analysis_of_Nursing_Students'_Perceptions_and_Experiences","343051730_Barriers_to_online_learning_in_the_time_of_COVID-19_A_national_survey_of_medical_students_in_the_Philippines","342726939_Is_Romania_Prepared_for_eLearning_during_the_COVID-19_Pandemic","350361865_The_Ivory_Tower_Lost_How_College_Students_Respond_Differently_than_the_General_Public_to_the_COVID-19_Pandemic","343010500_Child_Care_in_the_Time_of_COVID-19_A_Period_of_Challenge_and_Opportunity","342713735_Impact_of_COVID-19_on_Education_in_Sub-Saharan_Africa","342530791_TOWARDS_AN_UNDERSTANDING_OF_UNIVERSITY_STUDENTS'_RESPONSE_IN_TIMES_OF_PANDEMIC_CRISIS_COVID-19","342475852_THE_IMPACT_OF_COVID-19_ON_LEARNING_-_THE_PERSPECTIVE_OF_THE_GHANAIAN_STUDENT","342463647_Validation_of_the_Fear_of_COVID-19_Scale_in_a_US_College_Sample","342389628_Impact_of_lockdown_on_learning_status_of_undergraduate_and_postgraduate_students_during_COVID-19_pandemic_in_West_Bengal_India"]}