{"id":"344676888_A_mechanistic_integrative_computational_model_of_macrophage_polarization_Implications_in_human_pathophysiology","abstract":"Macrophages respond to signals in the microenvironment by changing their functional phenotypes, a process known as polarization. Depending on the context, they acquire different patterns of transcriptional activation, cytokine expression and cellular metabolism which collectively constitute a continuous spectrum of phenotypes, of which the two extremes are denoted as classical (M1) and alternative (M2) activation. To quantitatively decode the underlying principles governing macrophage phenotypic polarization and thereby harness its therapeutic potential in human diseases, a systems-level approach is needed given the multitude of signaling pathways and intracellular regulation involved. Here we develop the first mechanism-based, multi-pathway computational model that describes the integrated signal transduction and macrophage programming under M1 (IFN-γ), M2 (IL-4) and cell stress (hypoxia) stimulation. Our model was calibrated extensively against experimental data, and we mechanistically elucidated several signature feedbacks behind the M1-M2 antagonism and investigated the dynamical shaping of macrophage phenotypes within the M1-M2 spectrum. Model sensitivity analysis also revealed key molecular nodes and interactions as targets with potential therapeutic values for the pathophysiology of peripheral arterial disease and cancer. Through simulations that dynamically capture the signal integration and phenotypic marker expression in the differential macrophage polarization responses, our model provides an important computational basis toward a more quantitative and network-centric understanding of the complex physiology and versatile functions of macrophages in human diseases.","authors":["Chen Zhao Id","Adam C Mirando","Richard J. Sové","Thalyta Medeiros"],"meta":["November 2019PLoS Computational Biology 15(11)","DOI:10.1371/journal.pcbi.1007468","Project: Macrophage polarization in the context of Peripheral Arterial Disease"],"references":["331224919_IL-1b_and_TNFa_Differentially_Influence_NF-kB_Activity_and_FasL-Induced_Apoptosis_in_Primary_Murine_Hepatocytes_During_LPS-Induced_Inflammation","330536422_Mechanistic_Computational_Models_of_MicroRNA-Mediated_Signaling_Networks_in_Human_Diseases","329496407_Transcriptional_profiling_identifies_novel_regulators_of_macrophage_polarization","329257913_Efficient_Parameter_Estimation_Enables_the_Prediction_of_Drug_Response_Using_a_Mechanistic_Pan-Cancer_Pathway_Model","329222141_Gene_Regulatory_Network_Modeling_of_Macrophage_Differentiation_Corroborates_the_Continuum_Hypothesis_of_Polarization_States","325585861_Epigenetic_and_transcriptional_regulation_of_IL4-induced_CCL17_production_in_human_monocytes_and_murine_macrophages","336085042_Akt-mTORC1_signaling_regulates_Acly_to_integrate_metabolic_input_to_control_of_macrophage_activation","330765760_Itaconate_the_poster_child_of_metabolic_reprogramming_in_macrophage_function","330223263_Antiangiogenic_VEGF_165_b_Regulates_Macrophage_Polarization_via_S100A8S100A9_in_Peripheral_Artery_Disease","326382370_PPARg_is_a_nexus_controlling_alternative_activation_of_macrophages_via_glutamine_metabolism"]}