{"id":"344699026_Computer_Science_Education_in_Early_Childhood_The_Case_of_ScratchJr","abstract":"Aim/Purpose: This paper aims to explore whether having state Computer Science standards in place will increase young children’s exposure to coding and powerful ideas from computer science in the early years. Background: Computer science education in the K-2 educational segment is receiving a growing amount of attention as national and state educational frameworks are emerging. By focusing on the app ScratchJr, the most popular free introductory block-based programming language for early childhood, this paper explores if there is a relationship between the presence of state frameworks and ScratchJr’s frequency of use. Methodology: This paper analyzes quantitative non-identifying data from Google Analytics on users of the ScratchJr programming app. Google Analytics is a free tool that allows access to user activity as it happens in real time on the app, as well as audience demographics and behavior. An analysis of trends by state, time of year, type of in-app activities completed, and more are analyzed with a specific focus on comparing states with K-12 Computer Science in place versus those without. Contribution: Results demonstrate the importance of having state standards in place to increase young children’s exposure to coding and powerful ideas from computer science in the early years. Moreover, we see preliminary evidence that states with Computer Science standards in place support skills like perseverance and debugging through ScratchJr. Findings: Findings show that in the case of ScratchJr, app usage decreases during the summer months and on weekends, which may indicate that coding with ScratchJr is more often happening in school than at home. Results also show that states with Computer Science standards have more ScratchJr users on average and have more total sessions with the app on average. Results also show preliminary evidence that states with Computer Science standards in place have longer average session duration as well as a higher average number of users returning to edit an existing project. Recommendations for Practitioners: Successful early childhood computer science education programs must teach powerful ideas from the discipline of computer science in a developmentally appropriate way, provide means for self-expression, prompt debugging and problem solving, and offer a low-floor/high-ceiling interface for both novices and experts. Practitioners should be aware in drops in computer science learning during the summer months when school is not in session. Recommendation for Researchers: Researchers should consider the impact of state and national frameworks on computer science learning and skills mastered during the early childhood years. Researchers should look for ways to continue engaging students in computer science education during times when school is not in session. Impact on Society: Results demonstrate the importance of having state CS standards in place to increase young children’s exposure to coding and powerful ideas from computer science in the early years. Moreover, we see preliminary evidence that states with Computer Science standards in place support skills like perseverance and debugging through ScratchJr. Future Research: Future research should continue collecting Google Analytics from the ScratchJr app and track changes in usage. Future research should also collect analytics from a wide range of programming applications for young children to see if the trends identified here are consistent across different apps.","authors":["Amanda Sullivan","Marina Umashi Bers"],"meta":["January 2019Journal of Information Technology Education: Innovations in Practice 18:113-138","DOI:10.28945/4437"],"references":["328846614_Investigating_the_use_of_robotics_to_increase_girls'_interest_in_engineering_during_early_elementary_school","327489971_Coding_and_Computational_Thinking_in_Early_Childhood_The_Impact_of_ScratchJr_in_Europe","327126810_What_they_learn_when_they_learn_coding_investigating_cognitive_domains_and_computer_programming_knowledge_in_young_children","321332296_Comparing_loops_misconceptions_in_block-based_and_text-based_programming_languages_at_the_K-12_level","331256954_The_Cambridge_Handbook_of_Computing_Education_Research","326840767_Coding_as_a_Playground_Programming_and_Computational_Thinking_in_the_Early_Childhood_Classroom","326164947_How_to_learn_and_how_to_teach_computational_thinking_Suggestions_based_on_a_review_of_the_literature","324843220_Developing_Computational_Thinking_with_Educational_Technologies_for_Young_Learners","324311847_Constructionist_visions_Hard_fun_with_serious_games","317325266_An_examination_of_seven_years_of_technology_integration_in_Florida_schools_Through_the_lens_of_the_Levels_of_Digital_Divide_in_Schools"]}