{"id":"344785151_A_smart_contract_logic_to_reduce_hoax_propagation_across_social_media","abstract":"One of the main concerns of cybersecurity is the detection of hoaxes across social media. Hoaxers propagate such messages to mislead users and to promote violence. Several approaches exist in literature to address this issue. They are mainly limited to detect hoax activities by characterizing the message nature and detecting provenance of messages. However, unless hoaxes are detected, they continue to propagate across social media nodes. This work aims at reducing the dissemination of hoaxes across group of users. Relying on social graph structure, this research develops a mechanism based on smart contract logics to prevent a group to consume a fake post. To achieve this objective, we used a smart contract to exploit a trust index computed based on message characteristics and group features such as graph density, group status, group degree, group acceptability. Based on the value of trust index, the message is forwarded or blocked. Experiments realized on groups of different characteristics revealed that the proposed smart contract is even able to reactively block a fake post of the same nature than the group type. Results indicate that the proportion of targeted groups could be reduced even if their interests match with the message subject. This research is an important step forward to anti-promote hoaxes with the novelty of exploiting smart contract approach to contain their propagation.","authors":["Franklin Tchakounte","Calvin AMADOU Koudanbe","Ado Adamou Abba Ari","Fotsa Mbogne David Jaures"],"meta":["October 2020Journal of King Saud University - Computer and Information Sciences","DOI:10.1016/j.jksuci.2020.09.001"],"references":["342579856_Fighting_COVID-19_Misinformation_on_Social_Media_Experimental_Evidence_for_a_Scalable_Accuracy-Nudge_Intervention","342173635_A_Reliable_Weighting_Scheme_for_the_Aggregation_of_Crowd_Intelligence_to_Detect_Fake_News","337455558_Enabling_Privacy_and_Security_in_Cloud_of_Things_architecture_applications_security_privacy_challenges","334115756_Belittling_the_Source_Trustworthiness_Indicators_to_Obfuscate_Fake_News_on_the_Web","333566571_Key_Legal_Issues_Surrounding_Smart_Contract_Applications","340496375_Transmission_Range_Changing_Effects_on_Location_Privacy-Preserving_Schemes_in_the_Internet_of_Vehicles","340241969_Fake_News_Disinformation_and_Deepfakes_Leveraging_Distributed_Ledger_Technologies_and_Blockchain_to_Combat_Digital_Deception_and_Counterfeit_Reality","338365889_Hoax_Web_Detection_For_News_in_Bahasa_Using_Support_Vector_Machine","335572502_Cluster_Head_Recovery_Algorithm_for_Wireless_Sensor_Networks","332434399_Combating_Fake_News_A_Survey_on_Identification_and_Mitigation_Techniques"]}