{"id":"344774273_Immediate_Data-Driven_Positive_Feedback_Increases_Engagement_on_Programming_Homework_for_Novices","abstract":"Learning theories and psychological research show that positive feedback during practice can increase learners' motivation , and correlates with their learning. In our prior work, we built a system that provides immediate positive feedback using expert-authored features, and found a promising impact on students' performance and engagement with the system. However, scaling this expert-feedback system to new programming tasks requires extensive human effort. In this paper, we present a system that provides automated, data-driven, immediate positive feedback (DD-IPF) to students while programming. This system uses a data-driven feature detector that automatically detects feature completion in the current student's code based on features learned from historical student data. To explore the impact of DD-IPF on students' programming behavior, we performed a quasi-experimental study across two semesters in a block-based programming class. Our results showed that students with DD-IPF were more engaged, as measured by time spent on the programming task, and also showed marginal improvement in their grades, compared to students in a prior semester solving the same task without feedback. This suggests that positive feedback based on data-driven feature detection can provide benefits in student engagement and performance. We conclude with design recommendations for data-driven programming feedback systems.","authors":["Samiha Marwan","Thomas W. Price","Min Chi","Tiffany Michelle Barnes"],"meta":["October 2020","Conference: 4th CSEDM workshop at EDM 2020"],"references":["343517875_Adaptive_Immediate_Feedback_Can_Improve_Novice_Programming_Engagement_and_Intention_to_Persist_in_Computer_Science","339510447_Crescendo_Engaging_Students_to_Self-Paced_Programming_Practices","331299792_Defining_Tinkering_Behavior_in_Open-ended_Block-based_Programming_Assignments","323780727_Factors_Influencing_Students'_Help-Seeking_Behavior_while_Programming_with_Human_and_Computer_Tutors","316947290_iSnap_Towards_Intelligent_Tutoring_in_Novice_Programming_Environments","308343816_Effective_compiler_error_message_enhancement_for_novice_programming_students","283468835_Data-Driven_Hint_Generation_in_Vast_Solution_Spaces_a_Self-Improving_Python_Programming_Tutor","332567216_Reducing_the_State_Space_of_Programming_Problems_through_Data-Driven_Feature_Detection","311489141_ITCH_Individual_Testing_of_Computer_Homework_for_Scratch_Assignments","262293480_The_Behavior_of_Tutoring_Systems"]}