{"id":"344781289_A_story_of_diameter_radius_and_almost_Helly_property","abstract":"We present new algorithmic results for the class of Helly graphs, that is, for the discrete analogues of hyperconvex metric spaces. Specifically, an undirected unweighted graph is Helly if every family of pairwise intersecting balls has a nonempty common intersection. It is known that every graph isometrically embeds into a Helly graph that makes of the latter an important class of graphs in metric graph theory. We study diameter and radius computations within the Helly graphs, and related graph classes. This is in part motivated by a conjecture on the fine‐grained complexity of these two distance problems within the graph classes of bounded fractional Helly number—that contain as particular cases the proper minor‐closed graph classes and the bounded clique‐width graphs. Note that under plausible complexity assumptions, neither the diameter nor the radius can be computed in truly subquadratic time on general graphs. In contrast to these negative results, we first present algorithms which given an n‐vertex m‐edge Helly graph G as input, compute with high probability (w.h.p.) its radius and its diameter in time (i.e., subquadratic in n + m). Our algorithms are based on the Helly property and on the unimodality of the eccentricity function in Helly graphs: every vertex of locally minimum eccentricity is a central vertex. Then, we improve our results for the C4‐free Helly graphs, that are exactly the Helly graphs whose balls are convex. For this subclass, we present linear‐time algorithms for computing the eccentricity of all vertices. Doing so, we generalize previous results on strongly chordal graphs to a much larger subclass, that includes, among others, all the bridged Helly graphs and the hereditary Helly graphs. Lastly, we derive approximate versions of our results for the class of chordal graphs: with the latter satisfying an almost‐Helly‐type property, and a stronger (induced‐path) convexity property than the C4‐free Helly graphs. For the chordal graphs, we can compute in quasi linear time the eccentricity of all vertices with an additive one‐sided error of at most one, which is best possible under the strong exponential‐time hypothesis. This answers an open question of Dragan. In fact, we obtain this last result as a byproduct from a more general reduction: from diameter computation on chordal graphs to the Disjoint Sets problem. Roughly, it implies that the split graphs are the only hard instances for diameter computation on chordal graphs. We also get from our reduction that on any subclass of chordal graphs with constant VC‐dimension (and so, for undirected path graphs), the diameter can be computed in truly subquadratic time.","authors":["Guillaume Ducoffe","Feodor F. Dragan"],"meta":["October 2020Networks 77(3)","DOI:10.1002/net.21998"],"references":["339935331_Multivariate_Analysis_of_Orthogonal_Range_Searching_and_Graph_Distances","338326530_Diameter_computation_on_H_-minor_free_graphs_and_graphs_of_bounded_distance_VC-dimension","333753383_Fast_approximation_of_eccentricities_and_distances_in_hyperbolic_graphs","318489374_Fully_Polynomial_FPT_Algorithms_for_Some_Classes_of_Bounded_Clique-width_Graphs","337785214_Fast_Diameter_Computation_Within_Split_Graphs","336784324_An_eccentricity_2-approximating_spanning_tree_of_a_chordal_graph_is_computable_in_linear_time","329497963_Subquadratic_Algorithms_for_the_Diameter_and_the_Sum_of_Pairwise_Distances_in_Planar_Graphs","327250151_Tree-structured_graphs","322218174_Voronoi_Diagrams_on_Planar_Graphs_and_Computing_the_Diameter_in_Deterministic_O_n_53_Time","314092594_Subquadratic_Algorithms_for_the_Diameter_and_the_Sum_of_Pairwise_Distances_in_Planar_Graphs"]}