{"id":"344754473_The_History_of_Medical_Informatics_Development_-an_Overview","abstract":"Background: Medical informatics is regarded as a scientific discipline dealing with theory and practice of information processes in medicine, comprising data communication by information and communication technologies (ICT), with computers as an especially important ICT. It means Medical informatics history can be stated connected with the beginnings of computer usage in medicine. Objective: The aim of this review was to describe most important facts about historical backgrounds of development of Health/Medical/Biomedical informatics based on facts searched through systematic scientific literature. Methods: Author used descriptive method for explanation history of medical informatics based on published facts in the scientific literature deposited in online databases. Results and discussion: The development of medical informatics began in the 1950’s of 20th century, when the earliest reference to applications of electronic digital computers in medicine appeared. Historical facts in this article reflect on the development of the discipline of Medical that is now part of all medical disciplines of all health professionals. Applications of computer and information technologies in all segments of society and knowledge of information technology is now part of general literacy (1). The classical way to present a “history” is to list major events in chronological order, with more or less detailed comments about the persons, ideas or events. A distinction between periods brings a systematization flavor, easing the comments. Conclusion: During last 70 years Biomedical informatics became one of the most prominent biomedical disciplines included in almost all other academic and scientific medical disciplines. \nKeywords: Medical informatics, Biomedical informatics, IMIA, EFMI.","authors":["Izet Masic"],"meta":["October 2020","DOI:10.5455/ijbh.2020.8.37-52"],"references":["324840913_Medical_Informatics_Education-Past_Today_and_Future","260951332_History_of_Medical_Informatics_in_Europe_-_a_Short_Review_by_Different_Approach","260419901_Unobtrusive_Sensing_and_Wearable_Devices_for_Health_Informatics","257918906_History_Of_Medical_Informatics_In_Bosnia_And_Herzegovina","257366608_Medical_Informatics_Education_in_Bosnia_and_Herzegovina","321619225_Public_Health_Informatics_and_Information_Systems","321507248_Organizational_Aspects_of_Health_Informatics","272830063_Health_informatics_a_socio-technical_perspective","270277858_Medical_informatics_board_certification_history_current_status_and_predicted_impact_on_the_medical_informatics_workforce","262375936_Public_Health_Informatics_and_Information_Systems"]}