{"id":"344740015_Industry_40_Revolution_or_Evolution","abstract":"Industry 4.0\" term is devoted to the fourth industrial revolution. Over time and by developing different technologies, this term is coming with the new paradigm and technologies, which help to connect the machines, products, and methods as an interconnected system. This paper aims to introduce an analysis and a reflection around the concepts industry 4.0 and their impacts in the actual industrial world. The effects of this digitalization will be investigated on supply chain systems, decision-making processes, and business models. The classic supply chain is evolving into a Network Supply System (NSS) that is an interconnected supply chain with more focus on product and customer expectations. The global value chain process tends to be product oriented. Smart data make the decisions more dynamic, flexible, and precise. Therefore, every industrial sector has to be adapted to this digital transformation in all aspects. However, the environmental aspects, global warming , and human healthcare issues are the challenge facing industries and human life, which can be like a brake to make efforts to improve digital life and machine technicity. This paper tries to produce a critical analysis of the concept \"industry 4.0 revolution\" based on different guidelines to show that it is an evolution of the industry coming through the development of several technologies.","authors":["Elnaz Asadollahiyazdi","Paulin Couzon","Nhan Quy Nguyen","Yassine Ouazene"],"meta":["January 2020American Journal of Operations Research 10(6):241-268","DOI:10.4236/ajor.2020.106014"],"references":["326584283_Literature_review_of_Industry_40_and_related_technologies","323946321_The_recognition_of_resource_use_through_industrial_development_from_a_social_perspective","323922072_Electrical_Vehicle_Charging_Coordination_Algorithms_Framework","319640255_Development_of_an_Assessment_Model_for_Industry_40_Industry_40-MM","319061746_A_Design_Process_Approach_to_Strategic_Production_Planning_for_Industry_40","317505970_The_Application_of_the_Maturity_Model_SIMMI_40_in_Selected_Enterprises","337692788_Joint_optimization_of_dynamic_pricing_and_lot-sizing_decisions_with_nonlinear_demands_Theoretical_and_computational_analysis","334831831_Multi-objective_optimization_approach_in_design_for_additive_manufacturing_for_fused_deposition_modeling","323327366_The_Effort_Paradox_Effort_Is_Both_Costly_and_Valued","322848903_Improved_algorithms_to_minimize_workload_balancing_criteria_on_identical_parallel_machines"]}