{"id":"344781801_Secure_Socket_Layer_SSL_in_the_Network_and_Web_Security","abstract":"In order to electronically exchange information between network users in the web of data, different software such as outlook is presented. So, the traffic of users on a site or even the floors of a building can be decreased as a result of applying a secure and reliable data sharing software. It is essential to provide a fast, secure and reliable network system in the data sharing webs to create an advanced communication systems in the users of network. In the present research work, different encoding methods and algorithms in data sharing systems is studied in order to increase security of data sharing systems by preventing the access of hackers to the transferred data. To increase security in the networks, the possibility of textual conversation between customers of a local network is studied. Application of the encryption and decryption algorithms is studied in order to increase security in networks by preventing hackers from infiltrating. As a result, a reliable and secure communication system between members of a network can be provided by preventing additional traffic in the website environment in order to increase speed, accuracy and security in the network and web systems of data sharing.","authors":["Roza Dastres","Mohsen Soori"],"meta":["October 2020International Journal of Computer and Information Sciences 14(1):330-333"],"references":["284358294_Secure_Communication_Using_DNA_Cryptography_with_Secure_Socket_Layer_SSL_Protocol_in_Wireless_Sensor_Networks","260428142_On_the_security_of_SSLTLS-enabled_applications","327969775_Why_Johnny_Can't_Develop_a_Secure_Application_A_Usability_Analysis_of_Java_Secure_Socket_Extension_API","257489190_A_combined_approach_to_ensure_data_security_in_cloud_computing","256438348_Secure_socket_layer_certificate_verification_A_learning_automata_approach","245318901_Design_and_implementation_of_a_high_performance_network_security_processor","220540335_A_Gbps_IPSec_SSL_security_processor_design_and_implementation_in_an_FPGA_prototyping_platform","220205197_The_most_recent_SSL_security_attacks_Origins_implementation_evaluation_and_suggested_countermeasures"]}