{"id":"344703608_A_deep_active_learning_system_for_species_identification_and_counting_in_camera_trap_images","abstract":"1. A typical camera trap survey may produce millions of images that require slow, expensive manual review. Consequently, critical conservation questions may be answered too slowly to support decision‐making. Recent studies demonstrated the potential for computer vision to dramatically increase efficiency in image‐based biodiversity surveys; however, the literature has focused on projects with a large set of labeled training images, and hence many projects with a smaller set of labeled images cannot benefit from existing machine learning techniques. Furthermore, even sizable projects have struggled to adopt computer vision methods because classification models overfit to specific image backgrounds (i.e., camera locations). 2. In this paper, we combine the power of machine intelligence and human intelligence via a novel active learning system to minimize the manual work required to train a computer vision model. Furthermore, we utilize object detection models and transfer learning to prevent overfitting to camera locations. To our knowledge, this is the first work to apply an active learning approach to camera trap images. 3. Our proposed scheme can match state‐of‐the‐art accuracy on a 3.2 million image dataset with as few as 14,100 manual labels, which means decreasing manual labeling effort by over 99.5%. Our trained models are also less dependent on background pixels, since they operate only on cropped regions around animals. 4. The proposed active deep learning scheme can significantly reduce the manual labor required to extract information from camera trap images. Automation of information extraction will not only benefit existing camera trap projects, but can also catalyze the deployment of larger camera trap arrays.","authors":["Mohammad Sadegh Norouzzadeh","Dan Morris","Sara Beery","Neel Joshi"],"meta":["October 2020Methods in Ecology and Evolution 12(3)","DOI:10.1111/2041-210X.13504"],"references":["333515959_Insights_and_approaches_using_deep_learning_to_classify_wildlife","329750896_Deep_Learning_Object_Detection_Methods_for_Ecological_Camera_Trap_Data","329210510_Machine_learning_to_classify_animal_species_in_camera_trap_images_Applications_in_ecology","332032622_Recognition_in_Terra_Incognita","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","318868259_A_Geometric_Approach_to_Active_Learning_for_Convolutional_Neural_Networks","316022422_Using_joint_species_distribution_models_for_evaluating_how_species-to-species_associations_depend_on_the_environmental_context"]}