{"id":"344770694_Term_position_based_language_model_for_information_retrieval","abstract":"Term position feature is widely and successfully used in IR and Web search engines, to enhance the retrieval effectiveness. This feature is essentially used for two purposes: to capture query terms proximity or to boost the weight of terms appearing in some parts of a document. In this paper, we are interested in this second category. We propose two novel query‐independent techniques based on absolute term positions in a document, whose goal is to boost the weight of terms appearing in the beginning of a document. The first one considers only the earliest occurrence of a term in a document. The second one takes into account all term positions in a document. We formalize each of these two techniques as a document model based on term position, and then we incorporate it into a basic language model (LM). Two smoothing techniques, Dirichlet and Jelinek‐Mercer, are considered in the basic LM. Experiments conducted on three TREC test collections show that our model, especially the version based on all term positions, achieves significant improvements over the baseline LMs, and it also often performs better than two state‐of‐the‐art baseline models, the chronological term rank model and the Markov random field model.","authors":["Hammache Arezki","Mohand Boughanem"],"meta":["October 2020Journal of the Association for Information Science and Technology 72(9)","DOI:10.1002/asi.24431"],"references":["335766438_YAKE_Keyword_Extraction_from_Single_Documents_using_Multiple_Local_Features","331206792_Webis_at_TREC_2018_Common_Core_Track","315843235_Emphasizing_Temporal-based_User_Profile_Modeling_in_the_Context_of_Session_Search","273836348_Improving_relevance_feedback-based_query_expansion_by_the_use_of_a_weighted_word_pairs_approach","323452318_A_Neural_Passage_Model_for_Ad-hoc_Document_Retrieval","322965499_Neural_Ranking_Models_with_Multiple_Document_Fields","320891275_IRGAN_A_minimax_game_for_unifying_generative_and_discriminative_information_retrieval_models","317240990_IRGAN_A_Minimax_Game_for_Unifying_Generative_and_Discriminative_Information_Retrieval_Models","308161218_Introduction_to_information_retrieval_chapt","303132310_A_study_of_smoothing_methods_for_language_models_applied_to_ad_hoc_information_retrieval"]}