{"id":"344733489_Core-periphery_structure_in_directed_networks","abstract":"Empirical networks often exhibit different meso-scale structures, such as community and core–periphery structures. Core–periphery structure typically consists of a well-connected core and a periphery that is well connected to the core but sparsely connected internally. Most core–periphery studies focus on undirected networks. We propose a generalization of core–periphery structure to directed networks. Our approach yields a family of core–periphery block model formulations in which, contrary to many existing approaches, core and periphery sets are edge-direction dependent. We focus on a particular structure consisting of two core sets and two periphery sets, which we motivate empirically. We propose two measures to assess the statistical significance and quality of our novel structure in empirical data, where one often has no ground truth. To detect core–periphery structure in directed networks, we propose three methods adapted from two approaches in the literature, each with a different trade-off between computational complexity and accuracy. We assess the methods on benchmark networks where our methods match or outperform standard methods from the literature, with a likelihood approach achieving the highest accuracy. Applying our methods to three empirical networks—faculty hiring, a world trade dataset and political blogs—illustrates that our proposed structure provides novel insights in empirical networks.","authors":["Andrew Elliott","Angus Chiu","Marya Bazzi","Gesine Reinert"],"meta":["September 2020Proceedings of The Royal Society A Mathematical Physical and Engineering Sciences 476(2241):20190783","DOI:10.1098/rspa.2019.0783"],"references":["340389833_Core-periphery_structure_in_sectoral_international_trade_networks_A_new_approach_to_an_old_theory","332358967_A_Nonlinear_Spectral_Method_for_Core--Periphery_Detection_in_Networks","320516953_Core-periphery_structure_requires_something_else_in_the_network","313893409_Finding_multiple_core-periphery_pairs_in_networks","336627136_Recent_advance_on_detecting_core-periphery_structure_a_survey","332591933_Detecting_core-periphery_structures_by_surprise","319480730_Network_partition_via_a_bound_of_the_spectral_radius","309547665_Co-clustering_directed_graphs_to_discover_asymmetries_and_directional_communities","308713086_The_graph-tool_python_library","308086460_Using_eigenvectors_of_perturbed_and_collapsed_adjacency_matrices_to_explore_bowtie_structures_in_directed_networks"]}