{"id":"344827515_Die_Einbildungskraft_und_der_innere_Sinn_Kants_Kritik_der_Urteilskraft_aus_der_Sicht_der_Aisthetik","abstract":"Seit den 80er Jahren des vorigen Jahrhunderts erfährt Ästhetik auf Grund ihrer etymologischen Wurzel eine aisthetische Wende. Das Konzept der Ästhetik als Aisthetik veranlasste uns zu einer neuen Interpretation der modernen Ästhetik, vor allem der Ästhetik Baumgartens, der Ästhetik als eine Disziplin gründete, und brachte die Baumgarten-Renaissance mit sich. Im Vergleich dazu hat es nur einen geringen Beitrag zur Neuinterpretation der Kant'schen KU von 1790 geleistet, die seit langem als ein Grundstein der modernen Ästhetik galt. In diesem Aufsatz geht es darum, welche Bedeutung der erste Teil der KU für das Konzept der Ästhetik als Aisthetik haben kann. Das im ersten Teil der KU thematisierte ästhetische Urteil bezieht die Vorstellung nicht durch einen bestimmten Begriff des Verstandes \"auf das Objekt zum Erkenntnisse\", sondern lediglich \"durch die Einbildungskraft … auf … das Gefühl der Lust oder Unlust\" (V, 203 f.). In der KU wird das Adjektiv \"ästhetisch\"-wenn es dem Nomen \"Urteil\" beigefügt wird-im Sinne von \"gefühlsmäßig\" verwendet und hat, anders als bei Baumgarten, mit der \"sinnlichen Erkenntnis (cognitio sensitiva)\" nichts zu tun, denn für Kant, der behauptet, aus der Sinnlichkeit allein könne keine Erkenntnis entstehen, ist der Begriff \"sinnliche Erkenntnis\" widersprüchlich. Für den Versuch, Ästhetik als Aisthetik neu aufzufassen und hiermit die Erkenntnistheorie über die Wissenschaftstheorie hinaus anthropologisch zu erweitern, scheint Kants Auffassung vom Ästhetischen zu eng zu sein. Wir behandeln also zunächst, uns vorerst vom Adjektiv \"ästhetisch\" distanzierend, die \"Einbildungskraft\" in der KU. Der KU zufolge wird sie als \"Vermögen der Anschauungen\" (V, 190, 287, 292) oder \"Sinnlichkeit unseres Vermögens\" (V, 354) definiert, und die \"Anschauung\" wird der \"Vorstellung der Einbildungskraft\" gleichgesetzt (V, 314). Die Einbildungskraft befindet sich also im Zentrum der Sinnlichkeit. Im Folgenden betrachten wir Kants Theorie der Einbildungskraft in der KrV (1781/1787), um zu zeigen, inwiefern Kant in der KU seine Theorie der Einbildungskraft erneuert. Anschließend kehren wir zum Adjektiv \"ästhetisch\" zurück, um zu untersuchen, was Kant im § 9 der KU mit dem Ausdruck \"ästhetisch bewusst werden\" in Hinblick auf das Verhältnis zwischen Apperzeption und innerem Sinn meint.","authors":["Tanehisa Otabe"],"meta":["January 2018"],"references":[]}