{"id":"344854848_Error_correction_and_assembly_complexity_of_single_molecule_sequencing_reads","abstract":"Third generation single molecule sequencing technology is poised to revolutionize genomics by enabling the sequencing of long, individual molecules of DNA and RNA. These technologies now routinely produce reads exceeding 5,000 basepairs, and can achieve reads as long as 50,000 basepairs. Here we evaluate the limits of single molecule sequencing by assessing the impact of long read sequencing in the assembly of the human genome and 25 other important genomes across the tree of life. From this, we develop a new data-driven model using support vector regression that can accurately predict assembly performance. We also present a novel hybrid error correction algorithm for long PacBio sequencing reads that uses pre-assembled Illumina sequences for the error correction. We apply it several prokaryotic and eukaryotic genomes, and show it can achieve near-perfect assemblies of small genomes (< 100Mbp) and substantially improved assemblies of larger ones. All source code and the assembly model are available open-source.","authors":["Hayan Lee","James Gurtowski","Shinjae Yoo","Shoshana Marcus"],"meta":["June 2014","DOI:10.1101/006395"],"references":["322104170_The_genome_sequence_of_the_colonial_chordate_Botryllus_schlosseri","260374647_Whole-genome_haplotyping_using_long_reads_and_statistical_methods","258252382_Chromosome-scale_scaffolding_of_de_novo_genome_assemblies_based_on_chromatin_interactions","257598804_Erratum_A_single-molecule_long-read_survey_of_the_human_transcriptome","256609238_Reducing_Assembly_Complexity_of_Microbial_Genomes_with_Single-Molecule_Sequencing","245027215_The_advantages_of_SMRT_sequencing","236967013_Characterizing_and_measuring_bias_in_sequence_data","236932291_The_Norway_spruce_genome_sequence_and_conifer_genome_evolution_Nature","307881957_LIBSVM_A_library_for_support_vector_machines","258854866_High-throughput_Genome_Scaffolding_from_in_vivo_DNA_Interaction_Frequency"]}