{"id":"344868714_Well_modelling_methods_in_thermal_reservoir_simulation","abstract":"Reservoir simulation is of interdisciplinary research, including petroleum engineering, mathematics, and computer sciences. It studies multi-phase (water, oil and gas) flow in porous media and well modelling. The latter describes well behavior using physical and mathematical methods. In real world applications, there are many types of wells, such as injection wells, production wells and heaters, and their various operations, such as pressure control, rate control and energy control. This paper presents commonly used well types, well operations, and their mathematical models, such as bottom hole pressure, water rate, oil rate, liquid rate, subcool, and steam control. These are the most widely applied models in thermal reservoir simulations, and some of them can even be applied to the black oil and compositional models. The purpose of this paper is to review these well modelling methods and their mathematical models, which explain how the well operations are defined and computed. We believe a detailed introduction is important to other reseachers and simulator developers. They have been implemented in our in-house parallel thermal simulator. Numerical experiments have been carried out to validate the model implementations and demonstrate the scalability of the parallel thermal simulator.","authors":["Hui Liu","Zhangxin Chen","Lihua Shen","Xiaohu Guo"],"meta":["January 2020Oil & Gas Science and Technology - Revue de l IFP 75(1)","DOI:10.2516/ogst/2020058"],"references":["314790882_Application_of_a_Multisegment_Well_Model_to_Simulate_Flow_in_Advanced_Wells","314742135_A_Massively_Parallel_Reservoir_Simulator_for_Large_Scale_Reservoir_Simulation","283940826_A_family_of_constrained_pressure_residual_preconditioners_for_parallel_reservoir_simulations","274271844_Interpretation_of_Well-Block_Pressures_in_Numerical_Reservoir_Simulation_With_Nonsquare_Grid_Blocks_and_Anisotropic_Permeability","270165347_A_Numerical_Simulation_Model_for_Thermal_Recovery_Processes","269612022_Representation_Of_A_Horizontal_Well_In_Numerical_Reservoir_Simulation","269612016_Probability_Model_for_Estimating_Three-Phase_Relative_Permeability","269611326_Interpretation_of_Well-Block_Pressures_in_Numerical_Reservoir_Simulationincludes_associated_paper_6988","267147232_Computational_Methods_for_Multiphase_Flows_in_Porous_Media","267020587_Reservoir_Simulation_Mathematical_Techniques_in_Oil_Recovery"]}