{"id":"344852602_Performance_vs_competence_in_human-machine_comparisons","abstract":"Does the human mind resemble the machines that can behave like it? Biologically inspired machine-learning systems approach “human-level” accuracy in an astounding variety of domains, and even predict human brain activity—raising the exciting possibility that such systems represent the world like we do. However, even seemingly intelligent machines fail in strange and “unhumanlike” ways, threatening their status as models of our minds. How can we know when human–machine behavioral differences reflect deep disparities in their underlying capacities, vs. when such failures are only superficial or peripheral? This article draws on a foundational insight from cognitive science—the distinction between performance and competence —to encourage “species-fair” comparisons between humans and machines. The performance/competence distinction urges us to consider whether the failure of a system to behave as ideally hypothesized, or the failure of one creature to behave like another, arises not because the system lacks the relevant knowledge or internal capacities (“competence”), but instead because of superficial constraints on demonstrating that knowledge (“performance”). I argue that this distinction has been neglected by research comparing human and machine behavior, and that it should be essential to any such comparison. Focusing on the domain of image classification, I identify three factors contributing to the species-fairness of human–machine comparisons, extracted from recent work that equates such constraints. Species-fair comparisons level the playing field between natural and artificial intelligence, so that we can separate more superficial differences from those that may be deep and enduring.","authors":["Chaz Firestone"],"meta":["October 2020Proceedings of the National Academy of Sciences 117(43)","DOI:10.1073/pnas.1905334117"],"references":["344089644_What_do_adversarial_images_tell_us_about_human_vision","342255445_Simulating_a_Primary_Visual_Cortex_at_the_Front_of_CNNs_Improves_Robustness_to_Image_Perturbations","341268229_Diverse_deep_neural_networks_all_predict_human_IT_well_after_training_and_fitting","338511734_Strike_With_a_Pose_Neural_Networks_Are_Easily_Fooled_by_Strange_Poses_of_Familiar_Objects","343466815_High-Frequency_Component_Helps_Explain_the_Generalization_of_Convolutional_Neural_Networks","343461298_Modeling_Biological_Immunity_to_Adversarial_Examples","339399540_Deep_Neural_Networks_Carve_the_Brain_at_its_Joints","339083231_Convolutional_Neural_Networks_as_a_Model_of_the_Visual_System_Past_Present_and_Future","335956611_Exploring_perceptual_illusions_in_deep_neural_networks","335594570_Leveling_the_playing_field_fairness_in_AI_versus_human_game_benchmarks"]}