{"id":"344890302_Alunos_ingressantes_e_as_relacoes_de_genero_na_universidade","abstract":"Resumo A escola é um espaço social e, como tal, é atravessado por representações de gênero. Apesar dos avanços em diversas áreas e profissões, a ciência moderna, ainda, é caracterizada como androgênica e excludente pela manutenção de redutos masculinos. A análise do artigo baseia-se nos percentuais da participação feminina em relação ao número de alunos ingressantes nos cursos de Engenharias, Ciência da Computação e Licenciatura em Química. Depreende-se do trabalho desenvolvido que apesar da evolução, ainda, está fortemente arraigada a masculinização de algumas profissões, em detrimento de outras consideradas femininas. Abstract The school is a social space that has representations of gender. Despite the advancement of women in various fields and professions, modern science is still characterized as androcentric and excluding by the maintenance of male recluses. In the research, was analyzed the percentage of female participation in relation to the number of students entering the courses of Engineering, Computer Science and Degree in Chemistry. It emerged from the work developed that despite the evolution, still, the masculinization of some professions is strongly ingrained, to the detriment of others considered feminine. It was concluded, through the work developed, that despite the evolution, still, the masculinization of some professions is strongly ingrained, to the detriment of others considered feminine.","authors":["Edevania Trevizan","Magela Reny","Fonticiella Gómez"],"meta":["October 2020"],"references":["250045749_Globalizacao_e_divisao_sexual_do_trabalho","237330753_Novas_configuracoes_da_divisao_sexual_do_trabalho","44843634_A_construcao_da_agenda_de_genero_no_sistema_educacional_brasileiro_1996-2007","26366589_Educacao_formal_mulher_e_genero_no_Brasil_contemporaneo","285273800_A_engenharia_brasileira_contemporanea_e_a_contribuicao_das_mulheres_nas_mudancas_recentes_do_campo_profissional"]}