{"id":"344805593_Selfhood_triumvirate_From_phenomenology_to_brain_activity_and_back_again","abstract":"Recently, a three-dimensional construct model for complex experiential Selfhood has been proposed (Fingelkurts, Fingelkurts, & Kallio-Tamminen, 2016b,c). According to this model, three specific subnets (or modules) of the brain self-referential network (SRN) are responsible for the manifestation of three aspects/features of the subjective sense of Selfhood. Follow up multiple studies established a tight relation between alterations in the functional integrity of the triad of SRN modules and related to them three aspects/features of the sense of self; however, the causality of this relation is yet to be shown. In this article we approached the question of causality by exploring functional integrity within the three SRN modules that are thought to underlie the three\nphenomenal components of Selfhood while these components were manipulated mentally by experienced meditators in a controlled and independent manner. Participants were requested, in a block-randomised manner, to mentally induce states representing either increased (up-regulation) or decreased (down-regulation) sense of (a) witnessing agency (“Self”), or (b) body representational-emotional agency (“Me”), or (c) reflective/narrative agency (“I”), while their brain activity was recorded by an electroencephalogram (EEG). This EEG-data was complemented by first-person phenomenological reports and standardised questionnaires which focused on subjective contents of three aspects of Selfhood. The results of the study strengthen the case for a\ndirect causative relationship between three phenomenological aspects of Selfhood and related to them three modules of the brain SRN. Furthermore, the putative integrative model of the dynamic interrelations among three modules of the SRN has been proposed.\n\nhttps://authors.elsevier.com/c/1bxrJ3lcz3wy3r","authors":["Alexander & Andrew Fingelkurts","Tarja Kallio-Tamminen"],"meta":["October 2020Consciousness and Cognition 86","DOI:10.1016/j.concog.2020.103031","Project: Controlled disentangling of self-components: a neurophenomenological QEEG study of advanced meditators"],"references":["344617453_Minimal_phenomenal_experience_Meditation_tonic_alertness_and_the_phenomenology_of_pure_consciousness","340146760_The_varieties_of_selflessness","340146602_Dissolving_the_self","338698039_Neuroimaging_the_Consciousness_of_Self_Review_and_Conceptual-Methodological_Framework","337185492_Being_for_no-one_Psychedelic_experience_and_minimal_subjectivity","336266436_Hemodynamic_Correlates_of_Electrophysiological_Activity_in_the_Default_Mode_Network","331042384_Individualized_goal_directed_dance_rehabilitation_in_chronic_state_of_severe_traumatic_brain_injury_A_case_study","325142277_Answering_Schrodinger's_question_A_free-energy_formulation","346624706_Self_and_Other_Exploring_Subjectivity_Empathy_and_Shame","346561423_On_Becoming_Aware_A_pragmatics_of_experiencing"]}