{"id":"344812739_Requiem_for_the_Rate-Determining_Step_in_Complex_Heterogeneous_Catalytic_Reactions","abstract":"The concept of the rate determining step, i.e., the step having the strongest influence on the reaction rate or even being the only one present in the rate equation, is often used in heterogeneous catalytic reactions. The utilization of this concept mainly stems from a need to reduce complexity in deriving explicit rate equations or searching for a better catalyst based on the theoretical insight. When the aim is to derive a rate equation with eventual kinetic modelling for single-route mechanisms with linear sequences, the analytical rate expressions can be obtained based on the theory of complex reactions. For such mechanisms, a single rate limiting step might not be present at all and the common practice of introducing such steps is due mainly to the convenience of using simpler expressions. For mechanisms with a combination of linear and nonlinear steps or those just comprising non-linear steps, the reaction rates are influenced by several steps depending on reaction conditions, thus a reduction in complexity to a single rate limiting step can lead to misinterpretations. More widespread utilization of a microkinetic approach when the reaction rate constants can be computed with reasonable accuracy based on the theoretical insight, and availability of software for kinetic modelling, when a system of differential equations for reactants and products will be solved together with differential equations for catalytic species and the algebraic conservation equation for the latter, will eventually make the concept of the rate limiting step obsolete.","authors":["Dmitry Murzin"],"meta":["September 2020","DOI:10.3390/reactions1010004"],"references":["343704569_Kinetic_Analysis_of_Domino_Catalysis_A_Case_Study_on_Gold-Catalyzed_Arylation","343357053_Oxidative_Dehydrogenation_of_Ethanol_on_Gold_Combination_of_Kinetic_Experiments_and_Computation_Approach_to_Unravel_the_Reaction_Mechanism","341360465_Revisiting_the_mechanism_of_the_Fujiwara-Moritani_reaction","340482021_Degree_of_rate_control_and_De_Donder_relations_-_An_interpretation_based_on_transition_state_theory","339639405_Kinetic_Isotope_Effects_Interpretation_and_Prediction_Using_Degrees_of_Rate_Control","337472289_The_degree_of_rate_control_of_catalyst-bound_intermediates_in_catalytic_reaction_mechanisms_Relationship_to_site_coverage","336328259_Chemical_Reaction_Engineering_and_Reactor_Technology","335441566_Apparent_Activation_Energies_in_Complex_Reaction_Mechanisms_A_Simple_Relationship_via_Degrees_of_Rate_Control","333269021_Kinetic_Analysis_of_Catalytic_Organic_Reactions_Using_a_Temperature_Scanning_Protocol","324463813_Microkinetic_Analysis_and_Scaling_Relations_for_Catalyst_Design"]}