{"id":"344806319_Gathering_Intelligence_on_Student_Information_Behavior_Using_Data_Mining","abstract":"In this paper, we present a novel machine-learning approach that analyzes student assessment scores across a teaching period to predict their final exam performance. One challenge for many universities around the world is identifying the students who are at risk of failing a subject sufficiently early enough to provide proactive interventions that aim to minimize the risk of failure due to several reasons such as the volume of (big) data. We propose a data-driven strategy using machine learning, an application of artificial intelligence that has become popular for extracting knowledge from data by combining strategies and processes from statistics and computer science. By being able to predict what a student's exam performance is ahead of time, interventions can occur, and students can be provided with extra support from their teachers to aid them in achieving the best result possible. In this research, we collected data from a popular information-technology subject at an Australian university and applied a machine-learning algorithm to the data to predict a few hundred students' exam scores. We also developed a framework of learningsupport activities that would be of most benefit to at-risk students to achieve maximum impact before their exam would be conducted. We discovered through our approach that we can accurately predict the bottom 20–30 percent of students at risk, enabling a large cohort of students to be helped through our intervention framework, which we believe can have a positive impact on their future results.","authors":["Lei Pan","Nicholas Patterson","Sophie Mckenzie","Surtharshan Rajasegarar"],"meta":["October 2020Library Trends 68(4):636-658","DOI:10.1353/lib.2020.0015","Project: Digital Education"],"references":["319918857_Learning_analytics_in_higher_education_an_analysis_of_case_studies","319709271_Classroom_assignments_as_measures_of_teaching_quality","318187079_Educational_data_mining_applications_and_tasks_A_survey_of_the_last_10_years","312512177_Predicting_Students'_Academic_Performances_-_A_Learning_Analytics_Approach_using_Multiple_Linear_Regression","312372750_Homework_and_academic_achievement_A_meta-analytic_review_of_research","312012892_Visual_representation_of_penetration_testing_actions_and_skills_in_a_technical_tree_model","332670067_Grade_9_Technology_Teachers'_Explication_of_Critical_Thinking_and_its_Enactment_in_the_Classroom","330475392_A_Quantitative_Approach_to_Design_Special_Purpose_Systems_to_Measure_Hacking_Skills","322815971_Learning_analytics_A_glance_of_evolution_status_and_trends_according_to_a_proposed_taxonomy","320637939_Delphi_Panels_Research_Design_Procedures_Advantages_and_Challenges"]}