{"id":"344952899_DeepLoco_Fast_3D_Localization_Microscopy_Using_Neural_Networks","abstract":"Single-molecule localization super-resolution microscopy (SMLM) techniques like STORM and PALM have transformed cellular microscopy by substantially increasing spatial resolution. In this paper we introduce a new algorithm for a critical part of the SMLM process: estimating the number and locations of the fluorophores in a single frame. Our algorithm can analyze a 20000-frame experimental 3D SMLM dataset in about one second — substantially faster than real-time and existing algorithms. Our approach is straightforward but very different from existing algorithms: we train a neural network to minimize the Bayes’ risk under a generative model for single SMLM frames. The neural network maps a frame directly to a collection of fluorophore locations, which we compare to the ground truth using a novel loss function. While training the neural network takes several hours, it only has to be done once for a given experimental setup. After training, localizing fluorophores in new images is extremely fast — orders of magnitude faster than existing algorithms. Faster recovery opens the door to real-time calibration and accelerated acquisition, and future work could tackle more complicated optical systems and more realistic simulators.","authors":["Nicholas Boyd","Eric Jonas","Hazen Babcock","Benjamin Recht"],"meta":["February 2018","DOI:10.1101/267096"],"references":["329192630_Content-aware_image_restoration_pushing_the_limits_of_fluorescence_microscopy","317723934_High_density_molecule_localization_for_super-resolution_microscopy_using_CEL0_based_sparse_approximation","316029296_Learning_Deep_CNN_Denoiser_Prior_for_Image_Restoration","315922058_Analyzing_Single_Molecule_Localization_Microscopy_Data_Using_Cubic_Splines","313267835_Three-Dimensional_Localization_of_Single_Molecules_for_Super-Resolution_Imaging_and_Single-Particle_Tracking","322380081_Using_Deep_Neural_Networks_for_Inverse_Problems_in_Imaging_Beyond_Analytical_Methods","319504676_Fluorescence_nanoscopy_in_cell_biology","315078325_A_Method_to_Solve_Fredholm_Integral_Equations_of_the_First_Kind_by_Using_a_Neural_Network","313290127_Turning_single-molecule_localization_microscopy_into_a_quantitative_bioanalytical_tool","311610731_Accurate_Image_Super-Resolution_Using_Very_Deep_Convolutional_Networks"]}