{"id":"344960238_Surrogate-assisted_particle_swarm_optimization_algorithm_with_Pareto_active_learning_for_expensive_multi-objective_optimization","abstract":"For multi-objective optimization problems, particle swarm optimization (PSO) algorithm generally needs a large number of fitness evaluations to obtain the Pareto optimal solutions. However, it will become substantially time-consuming when handling computationally expensive fitness functions. In order to save the computational cost, a surrogate-assisted PSO with Pareto active learning is proposed. In real physical space (the objective functions are computationally expensive), PSO is used as an optimizer, and its optimization results are used to construct the surrogate models. In virtual space, objective functions are replaced by the cheaper surrogate models, PSO is viewed as a sampler to produce the candidate solutions. To enhance the quality of candidate solutions, a hybrid mutation sampling method based on the simulated evolution is proposed, which combines the advantage of fast convergence of PSO and implements mutation to increase diversity. Furthermore, ε-Pareto active learning (ε-PAL) method is employed to pre-select candidate solutions to guide PSO in the real physical space. However, little work has considered the method of determining parameter ε. Therefore, a greedy search method is presented to determine the value of ε where the number of active sampling is employed as the evaluation criteria of classification cost. Experimental studies involving application on a number of benchmark test problems and parameter determination for multi-input multi-output least squares support vector machines (MLSSVM) are given, in which the results demonstrate promising performance of the proposed algorithm compared with other representative multi-objective particle swarm optimization (MOPSO) algorithms.","authors":["Zhiming Lv","Wang Linqing","Zhongyang Han","Jun Zhao"],"meta":["May 2019IEEE/CAA Journal of Automatica Sinica 6(3):838-849","DOI:10.1109/JAS.2019.1911450"],"references":[]}