{"id":"344989180_Correlation_Detection_with_and_without_the_Theories_of_Conditionals_A_model_update_of_Hattori_Oaksford_2007","abstract":"We view observational causal induction as a statistical independence test under rarity assumption. This paper complements the two-stage theory of causal induction proposed by Hattori and Oaksford (2007) with a computational analysis. We show that their dual-factor heuristic (DFH) model has a rational account as the square root of the index of (non-)independence under extreme rarity assumption, contrary to the criticism that the DFH model is non-normative (e.g., Lu et al., 2008). We introduce a model that considers the proportion of assumed-to-be rare instances (pARIs), which is the probability of biconditionals (according to several theories of compound conditionals) and can be seen as a simplified version of the DFH model. While being a single conditional probability, pARIs approximates the non-independence measure, the square of DFH. In reproducing the meta-analysis in Hattori and Oaksford (2007), we confirm that pARIs and DFH have the same level of descriptive adequacy, and that the two models have the highest fit among more than 40 models. Then, we critically examine the computer simulations which were central to the rational analysis in Hattori and Oaksford (2007). We point out two problems in their simluations: samples in some of the simulations being restricted to generative ones, and in-definite values of models because of the small samples. In the light of especially the latter problem of definability, pARIs shows higher applicability.","authors":["Tatsuji Takahashi","Kuratomo Oyo","Akihiro Tamatsukuri","Kohki Higuchi"],"meta":["November 2019","DOI:10.1101/247742"],"references":["320556477_Probabilistic_inferences_from_conjoined_to_iterated_conditionals","239656691_An_Algorithm_for_Fast_Recovery_of_Sparse_Causal_Graphs","288429887_Causal_Models_How_People_Think_about_the_World_and_Its_Alternatives","275697437_Causality_Models_Reasoning_and_Inference","246295443_General_Propositions_and_Causality","242442798_Principles_of_Categorization"]}