{"id":"344919620_A_Deep_Learning-Based_Hybrid_Framework_for_Object_Detection_and_Recognition_in_Autonomous_Driving","abstract":"As a key technology of intelligent transportation system, the intelligent vehicle is the carrier of comprehensive integration of many technologies. Although vision-based autonomous driving has shown excellent prospects, there is still a problem of how to analyze the complicated traffic situation by the collected data. Recently, autonomous driving has been formulated as many tasks separately by using different models, such as object detection task and intention recognition task. In this study, a vision-based system was developed to detect and identity various objects and predict the intention of pedestrians in the traffic scene. The main contributions of this research are (1) an optimized model was presented to detect 10 kinds of objects based on the structure of YOLOv4; (2) a fine-tuned Part Affinity Fields approach was proposed to estimate the pose of pedestrians; (3) Explainable Artificial Intelligence (XAI) technology is added to explain and assist the estimation results in the risk assessment phase; (4) an elaborate self-driving dataset that includes several different subsets for each corresponding task was introduced; and (5) an end-to-end system containing multiple models with high accuracy was developed. Experimental results proved that the total parameters of optimized YOLOv4 are reduced by 74%, which satisfies the real-time capability. In addition, the detection precision of the optimized YOLOv4 achieved an improvement of 2.6% compared to the state-of-the-art.","authors":["Yanfen Li","Hanxiang Wang","L. Minh Dang","Dongil Han"],"meta":["October 2020IEEE Access 8","DOI:10.1109/ACCESS.2020.3033289"],"references":["343591113_Smartphone-based_bulky_waste_classification_using_convolutional_neural_networks","343059928_Wasserstein_Loss_based_Deep_Object_Detection","342308234_Distance-IoU_Loss_Faster_and_Better_Learning_for_Bounding_Box_Regression","343454448_BDD100K_A_Diverse_Driving_Dataset_for_Heterogeneous_Multitask_Learning","343149466_Sensor-based_and_vision-based_human_activity_recognition_A_comprehensive_survey","338571796_A_novel_data-driven_nonlinear_solver_for_solid_mechanics_using_time_series_forecasting","336659458_Intention_Recognition_of_Pedestrians_and_Cyclists_by_2D_Pose_Estimation","335499334_An_Attention-based_Recurrent_Convolutional_Network_for_Vehicle_Taillight_Recognition","334129343_Appearance_based_pedestrians'_head_pose_and_body_orientation_estimation_using_deep_learning","326615982_Traffic_Light_Recognition_With_High_Dynamic_Range_Imaging_and_Deep_Learning"]}