{"id":"344907441_Understanding_Ecosystem_Complexity_via_Application_of_a_Process-Based_State_Space_rather_than_a_Potential_Surface","abstract":"Ecosystems are complex objects, simultaneously combining biotic, abiotic, and human components and processes. Ecologists still struggle to understand ecosystems, and one main method for achieving an understanding consists in computing potential surfaces based on physical dynamical systems. We argue in this conceptual paper that the foundations of this analogy between physical and ecological systems are inappropriate and aim to propose a new method that better reflects the properties of ecosystems, especially complex, historical nonergodic systems, to which physical concepts are not well suited. As an alternative proposition, we have developed rigorous possibilistic, process-based models inspired by the discrete-event systems found in computer science and produced a panel of outputs and tools to analyze the system dynamics under examination. The state space computed by these kinds of discrete ecosystem models provides a relevant concept for a holistic understanding of the dynamics of an ecosystem and its abovementioned properties. Taking as a specific example an ecosystem simplified to its process interaction network, we show here how to proceed and why a state space is more appropriate than a corresponding potential surface.","authors":["Cédric Gaucherel","F. Pommereau","Christelle Hély"],"meta":["October 2020Complexity 2020","DOI:10.1155/2020/7163920"],"references":["347703093_Critical_Transitions_in_Nature_and_Society","344073649_Self-Organization_in_Complex_Ecosystems_MPB-42","338816729_The_language_of_nature_When_nature_writes_to_itself","336324194_Population_Dynamics_of_Leaf-Cutting_Ants_A_Brief_Review","334081348_Physical_concepts_and_ecosystem_ecology_a_revival","333830501_Using_discrete_systems_to_exhaustively_characterize_the_dynamics_of_an_integrated_ecosystem","332692384_Studies_on_Semantics_in_Generative_Grammar","317509805_Understand_ecosystem_regime_shifts_by_modelling_ecosystem_development_using_Boolean_networks","315049054_Potential_analysis_reveals_changing_number_of_climate_states_during_the_last_60_kyr","312412437_Slow_Recovery_from_Perturbations_as_a_Generic_Indicator_of_a_Nearby_Catastrophic_Shift"]}