{"id":"344927445_The_Expertise_Reversal_Effect","abstract":"Cognitive studies of expertise that were reviewed in Chapter I indicated that prior knowledge is the most important 1earner characteristic that influences learning processes. Recently, it has been established that learning procedures and techniques that are beneficial for learners with low levels of prior knowledge may become relatively inefficient for more knowledgeable learners due to cognitive activities that consume additional working memory resources. This expertise reversal effect could be related to aptitude-treatment interactions (interactions between learning outcomes of different instructional treatments and student aptitudes) that were actively investigated in 1960-70s. The learner level of prior knowledge or level of expertise is the aptitude of interest in this case. The effect is explained by the cognitive overload that more knowledgeable learners may experience due to processing redundant for these learners instructional components (as compared to information without redundancy). As a consequence, instructional outcomes of different multimedia learning formats and procedures are always relative to levels of learner task-specific expertise. This chapter describes cognitive processes that cause expertise reversal effect and major instructional implications of this effect. The chapter provides a review of empirical evidence obtained in the original longitudinal studies of the effect, the expertise reversal for methods of enhancing essential cognitive load, and expertise reversal phenomena when learning from textual and hypertextual materials. The chapter also describes relations between the expertise reversal effect and studies of Aptitude-Treatment Interactions. Additional empirical evidence for the effect in other areas will be described in the following chapters in Section 2 of the book.","authors":["Slava Kalyuga"],"meta":["January 2009","DOI:10.4018/978-1-60566-048-6.ch003","In book: Managing Cognitive Load in Adaptive Multimedia Learning (pp.58-80)"],"references":[]}