{"id":"344956712_Gender_gaps_in_research_productivity_and_recognition_among_elite_scientists_in_the_US_Canada_and_South_Africa","abstract":"This study builds upon the literature documenting gender disparities in science by investigating research productivity and recognition among elite scientists in three countries. This analysis departs from both the general comparison of researchers across organizational settings and academic appointments on one hand, and the definition of \"elite\" by the research outcome variables on the other, which are common in previous studies. Instead, this paper's approach considers the stratification of scientific careers by carefully constructing matched samples of men and women holding research chairs in Canada, the United States and South Africa, along with a control group of departmental peers. The analysis is based on a unique, hand-curated dataset including 943 researchers, which allows for a systematic comparison of successful scientists vetted through similar selection mechanisms. Our results show that even among elite scientists a pattern of stratified productivity and recognition by gender remains, with more prominent gaps in recognition. Our results point to the need for gender equity initiatives in science policy to critically examine assessment criteria and evaluation mechanisms to emphasize multiple expressions of research excellence.","authors":["Creso Sá","Summer Cowley","Magdalena Martinez","Nadiia Kachynska"],"meta":["October 2020PLoS ONE","DOI:10.1371/journal.pone.0240903"],"references":["339344596_Historical_comparison_of_gender_inequality_in_scientific_careers_across_countries_and_disciplines","335484120_Large_publishing_consortia_produce_higher_citation_impact_research_but_co-author_contributions_are_hard_to_evaluate","333720237_Unravelling_the_gender_productivity_gap_in_science_A_meta-analytical_review","333488945_Measuring_Inequality_-Creating_an_indicator_to_assess_gender_bias_in_universities","331044208_Research_excellence_indicators_Time_to_reimagine_the_'making_of'","327801187_Changing_European_Academics_A_Comparative_Study_of_Social_Stratification_Work_Patterns_and_Research_Productivity","345172316_State-Funded_Eminent_Scholars_Programs_University_Faculty_Recruitment_as_an_Emerging_Policy_Instrument","341438513_Why_So_Slow_The_Advancement_of_Women","333026320_Laboratory_Life_The_Construction_of_Scientific_Facts","330406417_Women_who_win_prizes_get_less_money_and_prestige"]}