{"id":"344989194_Aesthetics_and_Entropy_III_Aesthetic_Measures","abstract":"We examined a series of real-world, pictorial photographs with varying characteristics, along with their modification by noise addition and unsharp masking. As response metrics we used three different versions of the aesthetic measure originally proposed by Birkhoff. The first aesthetic measure, which has been used in other studies, and which we used in our previous work as well, showed a preference for the least complex of the images. It provided no justification for noise addition, but did reveal enhancement on unsharp masking. Optimum level of unsharp masking varied with the image, but was predictable from the individual image’s GIF compressibility. We expect this result to be useful for guiding the processing of pictorial photographic imagery. The second aesthetic measure, that of informational aesthetics based on entropy alone failed to provide useful discrimination among the images or the conditions of their modification. A third measure, derived from the concepts of entropy maximization, as well as the hypothesized preference of observers for “simpler”, i.e., more compressible, images, yielded qualitatively the same results as the more traditional version of the measure. Differences among the photographs and the conditions of their modification were more clearly defined with this metric, however.","authors":["M. R. V. Sahyun"],"meta":["January 2018","DOI:10.20944/preprints201801.0098.v1"],"references":["258813756_Aesthetics_and_Entropy_II_A_critical_examination","258712463_Aesthetics_and_entropy_Optimization_of_the_brightness_distribution","17083076_Theory_of_Edge_Detection","313383823_A_preference_for_some_types_of_complexity_comment_on_perceived_beauty_of_random_texture_patterns_A_preference_for_complexity","312353440_Einfuhrung_in_die_informationstheoretische_Asthetik","290495187_Entropy_and_optimality_in_abstract_art_An_empirical_test_of_visual_aesthetics","262231741_Relationship_of_Just_Noticeable_Difference_JND_in_Black_Level_and_White_Level_With_Image_Content","51879020_Retinal_implants","50410877_Light_and_Dark_Adaptation","9518071_Complexity_and_incongruity_variables_as_determinants_of_exploratory_choice_and_evaluative_ratings"]}