{"id":"344969209_Multiorder_Laplacian_for_synchronization_in_higher-order_networks","abstract":"The emergence of synchronization in systems of coupled agents is a pivotal phenomenon in physics, biology, computer science, and neuroscience. Traditionally, interaction systems have been described as networks, where links encode information only on the pairwise influences among the nodes. Yet, in many systems, interactions among the units take place in larger groups. Recent work has shown that the presence of higher-order interactions between oscillators can significantly affect the emerging dynamics. However, these early studies have mostly considered interactions up to four oscillators at time, and analytical treatments are limited to the all-to-all setting. Here, we propose a general framework that allows us to effectively study populations of oscillators where higher-order interactions of all possible orders are considered, for any complex topology described by arbitrary hypergraphs, and for general coupling functions. To this end, we introduce a multiorder Laplacian whose spectrum determines the stability of the synchronized solution. Our framework is validated on three structures of interactions of increasing complexity. First, we study a population with all-to-all interactions at all orders, for which we can derive in a full analytical manner the Lyapunov exponents of the system, and for which we investigate the effect of including attractive and repulsive interactions. Second, we apply the multiorder Laplacian framework to synchronization on a synthetic model with heterogeneous higher-order interactions. Finally, we compare the dynamics of coupled oscillators with higher-order and pairwise couplings only, for a real dataset describing the macaque brain connectome, highlighting the importance of faithfully representing the complexity of interactions in real-world systems. Taken together, our multiorder Laplacian allows us to obtain a complete analytical characterization of the stability of synchrony in arbitrary higher-order networks, paving the way toward a general treatment of dynamical processes beyond pairwise interactions.","authors":["Maxime Lucas","Giulia Cencetti","Federico Battiston"],"meta":["September 2020Physical Review Research 2(3)","DOI:10.1103/PhysRevResearch.2.033410"],"references":["342155505_Networks_beyond_pairwise_interactions_Structure_and_dynamics","341739192_Simplicial_complexes_higher-order_spectral_dimension_and_dynamics","339341513_Random_walks_on_hypergraphs","338596245_Impact_of_the_distribution_of_recovery_rates_on_disease_spreading_in_complex_networks","338185755_Low-dimensional_dynamics_for_higher-order_harmonic_globally_coupled_phase-oscillator_ensembles","333642405_Simplicial_models_of_social_contagion","341715907_Explosive_Higher-Order_Kuramoto_Dynamics_on_Simplicial_Complexes","341200466_Random_Walks_on_Simplicial_Complexes_and_the_Normalized_Hodge_1-Laplacian","334578651_Phase_reduction_beyond_the_first_order_The_case_of_the_mean-field_complex_Ginzburg-Landau_equation","333883865_Abrupt_Desynchronization_and_Extensive_Multistability_in_Globally_Coupled_Oscillator_Simplexes"]}