{"id":"345099697_Active_learning_for_screening_prioritization_in_systematic_reviews_-_A_simulation_study","abstract":"Background\nConducting a systematic review requires great screening effort. Various tools have been proposed to speed up the process of screening thousands of titles and abstracts by engaging in active learning. In such tools, the reviewer interacts with machine learning software to identify relevant publications as early as possible. To gain a comprehensive understanding of active learning models for reducing workload in systematic reviews, the current study provides a methodical overview of such models. Active learning models were evaluated across four different classification techniques (naive Bayes, logistic regression, support vector machines, and random forest) and two different feature extraction strategies (TF-IDF and doc2vec). Moreover, models were evaluated across six systematic review datasets from various research areas to assess generalizability of active learning models across different research contexts. Methods\nPerformance of the models were assessed by conducting simulations on six systematic review datasets. We defined desirable model performance as maximizing recall while minimizing the number of publications needed to screen. Model performance was evaluated by recall curves, WSS@95, RRF@10, and ATD. ResultsWithin all datasets, the model performance exceeded screening at random order to a great degree.The models reduced the number of publications needed to screen by 91.7% to 63.9%. Conclusions\nActive learning models for screening prioritization show great potential in reducing the workload in systematic reviews. Overall, the Naive Bayes + TF-IDF model performed the best.","authors":["Gerbrich Ferdinands","Raoul Schram","Jonathan de Bruin","Ayoub Bagheri"],"meta":["September 2020","DOI:10.31219/osf.io/w6qbg"],"references":["343443719_Prediction_models_for_diagnosis_and_prognosis_of_covid-19_systematic_review_and_critical_appraisal","338567493_Software_tools_to_support_title_and_abstract_screening_for_systematic_reviews_in_healthcare_An_evaluation","336231968_Nudging_healthcare_professionals_towards_evidence-based_medicine_A_systematic_scoping_review","331667172_Editorial_Systematic_review_automation_thematic_series","328950049_FAST2_an_Intelligent_Assistant_for_Finding_Relevant_Papers","323611795_Finding_better_active_learners_for_faster_literature_reviews","322788009_Improving_Active_Learning_in_Systematic_Reviews","338627055_Semi-Automated_Evidence_Synthesis_in_Health_Psychology_Current_Methods_and_Future_Prospects","333837023_Comparative_effectiveness_of_common_therapies_for_Wilson_disease_A_Systematic_review_and_meta-analysis_of_controlled_studies","318393770_R_A_Language_and_Environment_for_Statistical_Computing"]}