{"id":"345002397_Multimedia_Data_Mining_Concept","abstract":"The development of information technology is particularly noticeable in the methods and techniques of data acquisition, high-performance computing, and bandwidth frequency. According to a newly observed phenomenon, called a storage low (Fayyad & Uthurusamy, 2002), the capacity of digital data storage is doubled every 9 months with respect to the price. Data can be stored in many forms of digital media, for example, still images taken by a digital camera, MP3 songs, or MPEG videos from desktops, cell phones, or video cameras. Such data exceeds the total cumulative handwriting and printing during all of recorded human history (Fayyad, 2001). According to current analysis carried out by IBM Almaden Research (Swierzowicz, 2002), data volumes are growing at different speeds. The fastest one is Internet-resource growth: It will achieve the digital online threshold of exabytes within a few years (Liautaud, 2001). In these fast-growing volumes of data environments, restrictions are connected with a human’s low data-complexity and dimensionality analysis. Investigations on combining different media data, multimedia, into one application have begun as early as the 1960s, when text and images were combined in a document. During the research and development process, audio, video, and animation were synchronized using a time line to specify when they should be played (Rowe & Jain, 2004). Since the middle 1990s, the problems of multimedia data capture, storage, transmission, and presentation have extensively been investigated. Over the past few years, research on multimedia standards (e.g., MPEG-4, X3D, MPEG-7) has continued to grow. These standards are adapted to represent very complex multimedia data sets; can transparently handle sound, images, videos, and 3-D (three-dimensional) objects combined with events, synchronization, and scripting languages; and can describe the content of any multimedia object. Different algorithms need to be used in multimedia distribution and multimedia database applications. An example is an image database that stores pictures of birds and a sound database that stores recordings of birds (Kossmann, 2000). The distributed query that asks for “top ten different kinds of birds that have black feathers and a high voice” is described there by Kossmann (2000, p.436).","authors":["John Wang","Janusz Swierzowicz"],"meta":["January 2008","DOI:10.4018/978-1-59904-951-9.ch225","In book: Data Warehousing and Mining (pp.3611-3620)"],"references":[]}