{"id":"345005323_A_survey_of_density_based_clustering_algorithms","abstract":"Density based clustering algorithms (DBCLAs) rely on the notion of density to identify clusters of arbitrary shapes, sizes with varying densities. Existing surveys on DBCLAs cover only a selected set of algorithms. These surveys fail to provide an extensive information about a variety of DBCLAs proposed till date including a taxonomy of the algorithms. In this paper we present a comprehensive survey of various DBCLAs over last two decades along with their classification. We group the DBCLAs in each of the four categories: density definition, parameter sensitivity, execution mode and nature of data and further divide them into various classes under each of these categories. In addition, we compare the DBCLAs through their common features and variations in citation and conceptual dependencies. We identify various application areas of DBCLAs in domains such as astronomy, earth sciences, molecular biology, geography, multimedia. Our survey also identifies probable future directions of DBCLAs where involvement of density based methods may lead to favorable results.","authors":["Panthadeep Bhattacharjee","Pinaki Mitra"],"meta":["September 2020Frontiers of Computer Science (electronic) 15(1):151308","DOI:10.1007/s11704-019-9059-3"],"references":["308367804_Overcoming_Key_Weaknesses_of_Distance-based_Neighbourhood_Methods_using_a_Data_Dependent_Dissimilarity_Measure","303373827_Density-Based_Clustering_with_Geographical_Background_Constraints_Using_a_Semantic_Expression_Model","301716164_DSets-DBSCAN_A_Parameter-Free_Clustering_Algorithm","279155818_Cludoop_An_Efficient_Distributed_Density-Based_Clustering_for_Big_Data_Using_Hadoop","324410153_Density_Estimation_for_Statistics_and_Data_Analysis","321068378_DBSTexC_Density-Based_Spatio-Textual_Clustering_on_Twitter","316848635_Dynamic_Density_Based_Clustering","312388900_STING_A_statistical_information_grid_approach_to_spatial_data_mining","309802530_Clustering_Spatial_Data_by_the_Neighbors_Intersection_and_the_Density_Difference","305397619_Data_Clustering_A_Review"]}