{"id":"345171203_Descriptive_predictive_and_explanatory_personality_research_Different_goals_different_approaches_but_a_shared_need_to_move_beyond_the_Big_Few_traits","abstract":"We argue that it is useful to distinguish between three key goals of personality science – description, prediction and explanation – and that attaining them often requires different priorities and methodological approaches. We put forward specific recommendations such as publishing findings with minimum a priori aggregation and exploring the limits of predictive models without being constrained by parsimony and intuitiveness but instead maximising out-of-sample predictive accuracy. We argue that naturally-occurring variance in many decontextualized and multi-determined constructs that interest personality scientists may not have individual causes, at least as this term is generally understood and in ways that are human-interpretable, never mind intervenable. If so, useful explanations are narratives that summarize many pieces of descriptive findings rather than models that target individual cause-effect associations. By meticulously studying specific and contextualized behaviours, thoughts, feelings and goals, however, individual causes of variance may ultimately be identifiable, although such causal explanations will likely be far more complex, phenomenon-specific and person-specific than anticipated thus far. Progress in all three areas – description, prediction, and explanation – requires higher-dimensional models than the currently-dominant “Big Few” and supplementing subjective trait-ratings with alternative sources of information such as informant-reports and behavioural measurements. Developing a new generation of psychometric tools thus provides many immediate research opportunities.","authors":["René Mõttus","Dustin Wood","David M Condon","Mitja D Back"],"meta":["November 2020European Journal of Personality 2020","DOI:10.31234/osf.io/hvk5p","Project: Adaptationist and socioecological frameworks for personality science"],"references":["344483274_A_More_Behavioral_Science_of_Personality_in_the_Age_of_Multi-Modal_Sensing_Big_Data_Machine_Learning_and_Artificial_Intelligence_Special_Issue_Editorial","344437203_Who_Knows_Best_What_the_Next_Year_Will_Hold_for_You_The_Validity_of_Direct_and_Personality-based_Predictions_of_Future_Life_Experiences_Across_Different_Perceivers","343505366_An_Adaptationist_Framework_for_Personality_Science","343289725_Personality_in_Action_Assessing_Personality_to_Identify_an_'Ideal'_Conscientious_Response_Type_with_Two_Different_Behavioural_Tasks","343125946_Indicators_of_Affect_Dynamics_Structure_Reliability_and_Personality_Correlates","348905962_Lifespan_trait_development_Toward_an_adequate_theory_of_personality","348905709_Using_functional_fields_to_represent_accounts_of_the_psychological_processes_that_produce_actions","348627803_That_Takes_the_BISCUIT_Predictive_Accuracy_and_Parsimony_of_Four_Statistical_Learning_Techniques_in_Personality_Data_With_Data_Missingness_Conditions","346563352_Correlations_between_person-descriptive_items_are_predictable_from_the_product_of_their_mid-point-centered_social_desirability_values","343066263_Intraindividual_Variability_in_Narrative_Identity_Complexities_Garden_Paths_and_Untapped_Research_Potential"]}