{"id":"345126098_Can_Online_Courts_Promote_Access_to_Justice_A_Case_Study_of_the_Internet_Courts_in_China","abstract":"The right to access the courts is a basic human right in civilised societies, but the current legal system is unfriendly and often unaffordable for the victims of e-commerce disputes and copyright infringements seeking access to justice. Therefore, how to design a judicial system that is more accessible for the aforementioned victims has become a critical legal point of contention in the digital economy era. In particular, it is not easy to provide solid evidence of consumer disputes or copyright infringements on the Internet because the electronic evidence stored on the current centralised database has data security and trust problems. In response to this challenge, China established three Internet Courts in 2017 to move dispute resolution for e-commerce disputes and copyright infringements from the physical courts to the Internet. All the proceedings in these Internet Courts are conducted on the Internet, so the time and expenses of the litigants can be largely reduced. Most notably, these Internet Courts accept the use of blockchain as a method of securing evidence, to overcome the risks that evidence stored on the Internet can be hacked or falsified. The notion of an Internet Court, which substantially enhances popular access to justice, is a significant judicial innovation. It is of special significance for those lawsuits with small value claims and online evidence, and in which the parties are separated by long distances. However, these Internet Courts leave much to reflect on, including whether due process can be guaranteed, whether public trial can be fully implemented, and whether blockchain-based evidence is absolutely admissible. Even so, this article argues that true justice is not only to pursue absolute correctness of judgements, but that true justice should also strike a balance between the correctness and efficiency of trials. For this reason, Internet Courts may yet establish a new judicial paradigm to pursue a balance between correctness, time, and cost.","authors":["Huang-Chih Frank Sung"],"meta":["November 2020Computer Law & Security Review 39:105461","DOI:10.1016/j.clsr.2020.105461"],"references":[]}