{"id":"345175885_Methods_to_Classify_Bainite_in_Wire_Rod_Steel","abstract":"The microstructural description in bainitic steel is commonly ambiguous, and the interpretations of results that originate from applied methods are usually user dependent. In consequence, a manifold description of bainite makes it difficult to reveal structure–property relationships. This is why a novel classification and quantification routine for bainitic microstructures in wire rod steel is presented. The classification is based on electron probe microanalysis (EPMA), electron backscatter diffraction (EBSD), and nanohardness of the same local area. Microstructural constituents with different characteristics (carbon concentration, misorientation, and nanohardness) are classified into low‐, intermediate‐, and high‐temperature morphologies. After the classification, quantification is conducted by combining scanning electron microscopy (SEM) analysis, dilatometry, and X‐ray diffraction (XRD). The bainite quantification reveals a homogeneous microstructure for cooling along the lower bainite regime. Increasing the manganese content causes a lower sensitivity to change in the cooling parameters. Combining nanohardness and EBSD is suitable to describe microscopic microstructural properties, whereas the quantification of bainite is eligible to explain differences in the microscopic microstructural properties. The used approach avoids overcomplexity and manifold terminologies of bainitic microstructures that are commonly found in the literature. The classification of bainite in microstructures is commonly ambiguous, often complex and depends on the expertise of the user. Herein, different experimental approaches are assessed for their suitability to classify bainite in wire rod steel with different manganese content and cooling regimes. The proposed classification system simplifies the differentiation of different types of bainite by using three classes.","authors":["Marc Ackermann","Bernard Resiak","Pascal Buessler","Bertrand Michaut"],"meta":["October 2020Steel Research International 92(1)","DOI:10.1002/srin.202000454"],"references":["321648896_Observation_of_deformation_twinning_and_martensitic_transformation_during_nanoindentation_of_a_transformation-induced_plasticity_steel","312607045_Tensile_Ductility_of_Nanostructured_Bainitic_Steels_Influence_of_Retained_Austenite_Stability","301241560_Morphology_change_of_retained_austenite_during_austempering_of_carbide-free_bainitic_steel","294106466_An_Approach_to_Heat_Transfer_Analysis_of_Wire_Loops_Over_the_Stelmor_Conveyor_to_Predict_the_Microstructural_and_Mechanical_Attributes_of_Steel_Rods","318638117_Modelling_of_size_distribution_of_blocky_retained_austenite_in_Si-containing_bainitic_steels","305170537_Model_for_transition_from_upper_to_lower_bainite","283433305_Development_of_Formable_High_Strength_Low_Alloy_TRIP_Steels_with_Annealed_Martensite_Matrix","274516427_Structu_re-property_relationships_in_commercial_low-alloy_bainitic-austenitic_steel_with_high_strength_ductility_and_toughness","272946099_Structural_characterization_of_carbide-free_bainite_in_a_Fe-02C-15Si-25Mn_steel","259517296_Low-temperature_bainite_in_low-carbon_steel"]}