{"id":"345171104_A_blueprint_for_securing_Brazil's_marine_biodiversity_and_supporting_the_achievement_of_global_conservation_goals","abstract":"Aim\nAs a step towards providing support for an ecological approach to strengthening marine protected areas (MPAs) and meeting international commitments, this study combines cumulative impact assessment and conservation planning approach to undertake a large‐scale spatial prioritization.\n\nLocation\nExclusive Economic Zone (EEZ) of Brazil, Southwest Atlantic Ocean.\n\nMethods\nWe developed a prioritization approach to protecting different habitat types, threatened species ranges and ecological connectivity, while also mitigating the impacts of multiple threats on biodiversity. When identifying priorities for conservation, we accounted for the co‐occurrence of 24 human threats and the distribution of 161 marine habitats and 143 threatened species, as well as their associated vulnerabilities. Additionally, we compared our conservation priorities with MPAs proposed by local stakeholders.\n\nResults\nWe show that impacts to habitats and species are widespread and identify hot spots of cumulative impacts on inshore and offshore areas. Industrial fisheries, climate change and land‐based activities were the most severe threats to biodiversity. The highest priorities were mostly found towards the coast due to the high cumulative impacts found in nearshore areas. As expected, our systematic approach showed a better performance on selecting priority sites when compared to the MPAs proposed by local stakeholders without a typical conservation planning exercise, increasing the existing coverage of MPAs by only 7.9%. However, we found that proposed MPAs still provide some opportunities to protect areas facing high levels of threats.\n\nMain conclusions\nThe study presents a blueprint of how to embrace a comprehensive ecological approach when identifying strategic priorities for conservation. We advocate protecting these crucial areas from degradation in emerging conservation efforts is key to maintain their biodiversity value.","authors":["Rafael Almeida Magris","Micheli Duarte de Paula Costa","C. E. L. Ferreira","Ciro Vilar"],"meta":["February 2021Diversity and Distributions 27(4):1-18","DOI:10.1111/ddi.13183","Projects: Rede de Monitoramento dos Habitas Bentônicos - REBENTOSRede de Monitoramento dos Habitas Bentônicos - REBENTOSIdentifying marine priorities for biodiversity conservation: a case study along Brazil’s marine ecoregions"],"references":["341308739_Cumulative_impact_assessment_for_ecosystem-based_marine_spatial_planning","340290830_Heat_Waves_Are_a_Major_Threat_to_Turbid_Coral_Reefs_in_Brazil","339420853_Area_Requirements_to_Safeguard_Earth's_Marine_Species","339204673_Operationalizing_ecological_connectivity_in_spatial_conservation_planning_with_Marxan_Connect","338919768_Strengthening_the_synergies_among_global_biodiversity_targets_to_reconcile_conservation_and_socio-economic_demands","337602089_Integrating_climate_adaptation_and_biodiversity_conservation_in_the_global_ocean","337262626_A_Roadmap_for_Using_the_UN_Decade_of_Ocean_Science_for_Sustainable_Development_in_Support_of_Science_Policy_and_Action","340250442_Incorporating_climate_change_adaptation_into_marine_protected_area_planning","339290599_Mysterious_oil_spill_in_the_Atlantic_Ocean_threatens_marine_biodiversity_and_local_people_in_Brazil","337919965_Decadal_losses_of_canopy-forming_algae_along_the_warm_temperate_coastline_of_Brazil","336719122_Marine_and_coastal_protected_and_conserved_areas_strategy_in_Brazil_Context_lessons_challenges_finance_participation_new_management_models_and_first_results","335125553_Recent_pace_of_change_in_human_impact_on_the_world's_ocean","333400505_Quantifying_biases_in_marine-protected-area_placement_relative_to_abatable_threats","335746486_Climate-Driven_Shifts_in_Marine_Species_Ranges_Scaling_from_Organisms_to_Communities","333649492_Climate_resilience_in_marine_protected_areas_and_the_'Protection_Paradox'"]}