{"id":"345175727_A_phase_field_modeling_approach_of_cyclic_fatigue_crack_growth","abstract":"Phase field modeling of fracture has been in the focus of research for over a decade now. The field has gained attention properly due to its benefiting features for the numerical simulations even for complex crack problems. The framework was so far applied to quasi static and dynamic fracture for brittle as well as for ductile materials with isotropic and also with anisotropic fracture resistance. However, fracture due to cyclic mechanical fatigue, which is a very important phenomenon regarding a safe, durable and also economical design of structures, is considered only recently in terms of phase field modeling. While in first phase field models the material’s fracture toughness becomes degraded to simulate fatigue crack growth, we present an alternative method within this work, where the driving force for the fatigue mechanism increases due to cyclic loading. This new contribution is governed by the evolution of fatigue damage, which can be approximated by a linear law, namely the Miner’s rule, for damage accumulation. The proposed model is able to predict nucleation as well as growth of a fatigue crack. Furthermore, by an assessment of crack growth rates obtained from several numerical simulations by a conventional approach for the description of fatigue crack growth, it is shown that the presented model is able to predict realistic behavior.","authors":["Christoph Schreiber","Charlotte Kuhn","Ralf Müller","T. I. Zohdi"],"meta":["September 2020International Journal of Fracture 225(1)","DOI:10.1007/s10704-020-00468-w"],"references":["329719909_A_numerically_efficient_phase-field_model_for_fatigue_fracture_-_1D_analysis","321752497_A_phenomenological_approach_to_fatigue_with_a_variational_phase-field_model_The_one-dimensional_case","330102579_Mechanical_behavior_of_materials_engineering_methods_for_deformation_fracture_and_fatigue","329722510_Phase_field_modeling_of_brittle_fracture_in_materials_with_anisotropic_fracture_resistance","321621347_Fatigue_of_Structures_and_Materials","321620100_Betriebsfestigkeit_Verfahren_und_Daten_zur_Bauteilberechnung","321619525_Fatigue_of_Structures_and_Materials","318563667_Phase_field_modeling_of_fracture_in_anisotropic_brittle_solids","316255334_A_Course_on_Damage_Mechanics","313068777_A_Course_on_Damage_Mechanics"]}