{"id":"345127548_The_Impact_of_Teacher_Gender_on_Girls'_Performance_on_Programming_Tasks_in_Early_Elementary_School","abstract":"Aim/Purpose: The goal of this paper is to examine whether having female robotics teachers positively impacts girls’ performance on programming and robotics tasks Background: Women continue to be underrepresented in the technical STEM fields such as engineering and computer science. New programs and initiatives are needed to engage girls in STEM beginning in early childhood. The goal of this work is to explore the impact of teacher gender on young children’s mastery of programming concepts after completing an introductory robotics program. Methodology: A sample of N=105 children from six classrooms (2 Kindergarten, 2 first grade, and 2 second grade classes) from a public school in Somerville, Massachusetts, participated in this research. Children were taught the same robotics curriculum by either an all-male or all-female teaching team. Upon completion of the curriculum, they completed programming knowledge assessments called Solve-Its. Comparisons between the performance of boys and girls in each of the teaching groups were made. Findings: This paper provides preliminary evidence that having a female instructor may positively impact girls’ performance on certain programming tasks and reduce the number of gender differences between boys and girls in their mastery of programming concepts. Recommendations for Practitioners: Practitioners should expose children to STEM role-models from a variety of backgrounds, genders, ethnicities, and experiences. Future Research: Researchers should conduct future studies with larger samples of teachers in order to replicate the findings here. Additionally, future research should focus on collecting data from teachers in the form of interviews and surveys in order to find out more about gender-based differences in teaching style and mentorship and the impact of this on girls' interest and performance in STEM.","authors":["Amanda Sullivan","Marina Umashi Bers"],"meta":["January 2018Journal of Information Technology Education: Innovations in Practice 17:153-162","DOI:10.28945/4082"],"references":["304169165_Solving_the_Equation_The_Variables_for_Women's_Success_in_Engineering_and_Computing","279634087_I_want_my_robot_to_look_for_food_Comparing_Kindergartner's_programming_comprehension_using_tangible_graphic_and_hybrid_user_interfaces","262153265_TUI_GUI_HUI_Is_a_bimodal_interface_truly_worth_the_sum_of_its_parts","261546877_Gender_Differences_in_Elements_of_the_Undergraduate_Experience_that_Influence_Satisfaction_with_the_Engineering_Major_and_the_Intent_to_Pursue_Engineering_as_a_Career","258189281_My_Fair_Physicist_Feminine_Math_and_Science_Role_Models_Demotivate_Young_Girls","311473376_Unlocking_the_clubhouse_women_in_computing","275900249_Pilot_summer_camps_in_computing_for_middle_school_girls","257109617_Developmental_Differences_in_Children's_Gender_Schemata_About_Others_A_Meta-Analytic_Review","244301037_Stereotype_Threat_and_Women's_Math_Performance","232999983_When_Do_Female_Role_Models_Benefit_Women_The_Importance_of_Differentiating_Recruitment_From_Retention_in_STEM"]}