{"id":"345124568_Bioinformatics_and_Phylogenetics_Seminal_Contributions_of_Bernard_Moret_Seminal_Contributions_of_Bernard_Moret","abstract":"This volume presents a compelling collection of state-of-the-art work in algorithmic computational biology, honoring the legacy of Professor Bernard M.E. Moret in this field. Reflecting the wide-ranging influences of Prof. Moret’s research, the coverage encompasses such areas as phylogenetic tree and network estimation, genome rearrangements, cancer phylogeny, species trees, divide-and-conquer strategies, and integer linear programming. Each self-contained chapter provides an introduction to a cutting-edge problem of particular computational and mathematical interest.\nTopics and features:\n\n• Addresses the challenges in developing accurate and efficient software for the NP-hard maximum likelihood phylogeny estimation problem\n• Describes the inference of species trees, covering strategies to scale phylogeny estimation methods to large datasets, and the construction of taxonomic supertrees\n• Discusses the inference of ultrametric distances from additive distance matrices, and the inference of ancestral genomes under genome rearrangement events\n• Reviews different techniques for inferring evolutionary histories in cancer, from the use of chromosomal rearrangements to tumor phylogenetics approaches\n• Examines problems in phylogenetic networks, including questions relating to discrete mathematics, and issues of statistical estimation\n• Highlights how evolution can provide a framework within which to understand comparative and functional genomics\n• Provides an introduction to Integer Linear Programming and its use in computational biology, including its use for solving the Traveling Salesman Problem\n\nOffering an invaluable source of insights for computer scientists, applied mathematicians, and statisticians, this illuminating volume will also prove useful for graduate courses on computational biology and bioinformatics.\n\nDr. Tandy Warnow is the Founder Professor of Computer Science at the University of Illinois at Urbana-Champaign, where she is also an affiliate in the departments of Mathematics, Statistics, Bioengineering, Electrical and Computer Engineering, Animal Biology, Entomology, and Plant Biology.","authors":["Tandy Warnow"],"meta":["January 2019","DOI:10.1007/978-3-030-10837-3","ISBN: 978-3-030-10836-6"],"references":[]}