{"id":"345163941_In_situ_neutron_diffraction_investigation_of_texture-dependent_Shape_Memory_Effect_in_a_near_equiatomic_NiTi_alloy","abstract":"To explore the possibility of customising the functional behaviour of NiTi shape memory alloy via controlling texture, binary Ni55Ti45 (wt.%) alloys were manufactured in as cast and hot swaged conditions, presenting contrasting initial texture and macroscopic performance. In situ time-of-flight neutron diffraction technique was employed to study the texture effect on the microstructural evolution during Shape Memory Effect (SME), and a range of properties were evaluated. It was found that (i) hot swaging process leads to change in grain morphology and increase in microstrain; (ii) thermal expansion coefficients of martensite and austenite variants were weakly affected by the texture and phase transformation constraint; (iii) significant texture effect on the elastic properties at both macro-and micro-scale was quantified by Elasto-Plastic Self-Consistent (EPSC) modelling approach, while the anisotropic elastic moduli lie within the range for single crystal state and twinned structure; (iv) texture evolution during SME is weakly related to the initial microstructure; (v) grains reoriented so that the <010> axis became aligned parallel to the loading direction, and retained this orientation upon unloading, revealing the underlying correlation between texture evolution and detwinning. Based on the experimental results, a multi-variant model was proposed to quantify the lattice strain evolution during SME. Validity of the conceptually simple and parametrically parsimonious model was confirmed by validation against experimental data.","authors":["Zifan Wang","Jingwei Chen","Cyril Besnard","Lenka Kuncicka"],"meta":["November 2020Acta Materialia 202","DOI:10.1016/j.actamat.2020.10.049"],"references":["344318996_Microstructure_evolution_in_a_severely_cold-worked_NiTi_wire_during_ageing_treatment_An_in_situ_neutron_diffraction_study","343561121_Ovine_Bone_Morphology_and_Deformation_Analysis_Using_Synchrotron_X-ray_Imaging_and_Scattering","340052174_Effect_of_Temperature_on_Shape_Memory_Materials","338446963_Neutron_strain_scanning_for_experimental_validation_of_the_artificial_intelligence_based_eigenstrain_contour_method","337296053_Evolution_of_thermal_and_mechanical_properties_of_Nitinol_wire_as_a_function_of_ageing_treatment_conditions","336821674_Polar_transformation_of_2D_X-ray_diffraction_patterns_and_the_experimental_validation_of_the_hDIC_technique","325714695_Deformation_behaviour_of_Cu-Al_clad_composites_produced_by_rotary_swaging","312300252_Effect_of_temperature_and_texture_on_the_reorientation_of_martensite_variants_in_NiTi_shape_memory_alloys","328339885_Characterization_of_innovative_rotary_swaged_Cu-Al_clad_composite_wire_conductors","315719707_Deformation_physics_of_shape_memory_alloys_-_Fundamentals_at_atomistic_frontier"]}