{"id":"345100912_Visual_object_tracking_based_on_residual_network_and_cascaded_correlation_filters","abstract":"Significant progress is made in the field of object tracking recently. Especially, trackers based on deep learning and correlation filters both have achieved excellent performance. However, object tracking still faces some challenging problems such as deformation and illumination. In such kinds of situations, the accuracy and precision of tracking algorithms plunge as a result. It is imminent to find a solution to this situation. In this paper, we propose a tracking algorithm based on features extracted by residual network called Resnet features and cascaded correlation filters to improve precision and accuracy. Firstly, features extracted by a deep residual network trained on other image processing datasets, are robust enough and retain higher resolution, therefore, we exploit Resnet-101 pretrained offline to obtain features extracted by middle and high layers for target appearance model representation. Resnet-101 is deeper compared with other deep neural networks which means it contains more semantic information. Then, the method we propose to combine our correlation filters is superior. We propose cascaded correlation filters generated by handcraft, middle-level and high-level features from residual network to gain better competence. Handcraft features localize target precisely because they contain more spatial details while Resnet features are robust to the target appearance change because they retain more semantic information. Finally, we conduct extensive experiments on OTB2013 and OTB2015 benchmark. The experimental results show that our tracker achieves high performance under all kinds of challenges and performs favorably against other state-of-the-art trackers.","authors":["Jianming Zhang","Juan Sun","Jin Wang","Xiao-Guang Yue"],"meta":["August 2021Journal of Ambient Intelligence and Humanized Computing 12(12):1-14","DOI:10.1007/s12652-020-02572-0"],"references":["339424914_Training_Convolutional_Neural_Networks_with_Multi-Size_Images_and_Triplet_Loss_for_Remote_Sensing_Scene_Classification","339114610_A_Cascaded_R-CNN_With_Multiscale_Attention_and_Imbalanced_Samples_for_Traffic_Sign_Detection","338695491_Optimal_Coverage_Multi-Path_Scheduling_Scheme_with_Multiple_Mobile_Sinks_for_WSNs","334819523_Lightweight_deep_network_for_traffic_sign_classification","334061806_Spatially_Attentive_Visual_Tracking_Using_Multi-Model_Adaptive_Response_Fusion","338514391_LaSOT_A_High-Quality_Benchmark_for_Large-Scale_Single_Object_Tracking","338511872_Fast_Online_Object_Tracking_and_Segmentation_A_Unifying_Approach","338511563_Siamese_Cascaded_Region_Proposal_Networks_for_Real-Time_Visual_Tracking","338161312_News_Text_Topic_Clustering_Optimized_Method_Based_on_TF-IDF_Algorithm_on_Spark","337848605_Edge-enabled_Disaster_Rescue_A_Case_Study_of_Searching_for_Missing_People","332134523_Dual_Model_Learning_Combined_With_Multiple_Feature_Selection_for_Accurate_Visual_Tracking","330229400_The_visual_object_tracking_algorithm_research_based_on_adaptive_combination_kernel","331615657_An_Asynchronous_Clustering_and_Mobile_Data_Gathering_Schema_Based_on_Timer_Mechanism_in_Wireless_Sensor_Networks","329740279_Learning_Spatial-Temporal_Regularized_Correlation_Filters_for_Visual_Tracking","328139590_A_PSO_based_energy_efficient_coverage_control_algorithm_for_wireless_sensor_networks"]}