{"id":"345257105_Sign_Language_Linguistics","abstract":"Sign language linguistics is one of the younger areas of linguistic research, having been a field in its own right only since the 1960s, when the first research investigating sign languages from a linguistic perspective was published. Since sign language was historically considered not to be language at all, but merely a gesture-based aid for basic communication, early research was focused on demonstrating the linguistic status of sign languages—that they are indeed languages in their own right, equivalent to spoken languages. The earliest research used traditional linguistic tools to investigate the phonological structure of sign language (specifically American Sign Language [ASL]), and to demonstrate that sign languages had duality of patterning, but the field soon expanded in all directions. Within the following decades, more in-depth analyses of the phonological and grammatical structure of sign languages were published, as well as investigations on the acquisition and use of sign language. With time, existing theoretical models for spoken language were applied to sign languages as well, and a number of new models for representing the syntax and phonology of sign languages were introduced. Cross-linguistic research on different sign languages, as well as on different social environments (e.g., urban versus village sign languages), has become more and more popular, as have cross-modal comparisons with spoken languages. In applied fields of linguistics, education and interpreting have become two of the main areas of investigation, as has the study of sign language in artistic use (e.g., poetry), often in close connection to the field of deaf studies. The interface between sign language and gesture has become a hot topic, especially within the domains of language emergence and foundations of human cognition. Finally, neurolinguistics has also expanded to include sign language within the scope of research.","authors":["Carl Börstell","Wendy Sandler","Mark Aronoff"],"meta":["April 2014","DOI:10.1093/obo/9780199772810-0038","In book: Linguistics"],"references":[]}