{"id":"345239489_Computer_Scientists_Why_Numerical_Instead_of_Analytical_Mathematics","abstract":"Computer scientists deal with computer science. They have strong mathematical components such as automata theory, computational complexity, numerical mathematics, and symbolic mathematics. The single most important skill for a computer scientist is problem solving. Problem solving means the ability to formulate problems, think creatively about solutions, and express a solution clearly and accurately. This article seeks to answer the question as to why should computer scientists deal with numerical mathematics, which give estimates and cause errors, instead of analytical mathematics which give exact answers. Numerical mathematics is a very broad field. In this paper we focus on aspects of numerical mathematics which are related to computer science. Generally, numerical methods require a series of iterations until you come to an estimate close enough to the answer. Computer programs are very efficient in making iterations quickly and correctly. Therefore, computer scientists learn numerical methods so that they can enable people in other fields find solutions to mathematical problems. Computer scientists can use computers to generate the estimates, they can perform 1000, or 10000 iterations in a split of a second and hence get a result of high accuracy. The procedures can be coded easily and hence are well suited for computers. Authors present four basic numerical methods for equation solving: bisection method, Newton-Raphson method, regula falsi and Secant method. Results show that Many practical problems are beyond the scope of analytical mathematics.","authors":["Herbert Peter Wanga","Stephano Sanga","Shangweli Vyosena Kituma","Thobius Joseph"],"meta":["October 2020","DOI:10.47760/ijcsmc.2020.v09i10.014"],"references":["298194344_125_Herceg_D_Herceg_Dj_Numerical_Mathematics_with_GeoGebra_in_High_School_Teaching_Mathematics_and_Computer_Science_622008_363-378","256838918_The_Reasonable_Ineffectiveness_of_Mathematics_Point_of_View","322944680_What_to_do_Till_the_Computer_Scientist_Comes","250890657_The_Interplay_of_Numerical_and_Analytical_Solutions_of_Singular_Integral_Equations","233135625_Use_of_microcomputers_in_teaching_numerical_mathematics"]}