{"id":"345263328_Integrasi_Kromosom_Buatan_Dinamis_untuk_Memecahkan_Masalah_Konvergensi_Prematur_pada_Algoritma_Genetika_untuk_Traveling_Salesman_Problem","abstract":"Algoritma genetika (Genetic Algorithm (GA)) adalah metode adaptif yang digunakan untuk memecahkan masalah pencarian dan optimasi. Travelling Salesman Problem (TSP) merupakan salah satu persoalan optimasi yang dipecahkan dengan GA, di mana rute terpendek merupakan solusi yang paling optimal. GA juga salah satu metode optimisasi global yang bekerja dengan baik dan efisien pada fungsi tujuan yang kompleks dalam hal nonlinear, tetapi GA mempunyai masalah yaitu konvergensi prematur. Konvergensi prematur merupakan suatu kondisi yang terjadi ketika populasi algoritma genetika mencapai keadaan suboptimal di mana operator genetika tidak dapat lagi menghasilkan keturunan dengan kinerja yang lebih baik dari parents. Untuk mengatasi masalah konvergensi prematur, maka pada penelitian ini diusulkan dynamic artificial chromosomes yang diintegrasikan ke dalam genetic algorithm yang disebut GA-DAC. Dynamic Artificial Chromosomes (DAC) digunakan untuk mengkontrol keragaman populasi dan juga seleksi kromosom terbaik untuk memilih individu atau kromosom terbaik. Beberapa eksperimen dilakukan dengan GA-DAC, dimana threshold terbaik adalah 0,5, kemudian juga mendapatkan hasil perbaikan pada jarak terpendek yang dibandingkan dengan GA standar. Hasil pengujian untuk dataset KroA100 sebesar 12,60%, KroA150 sebesar 13,92% dan KroA200 sebesar 12,92%. Untuk keragaman populasi mendapatkan hasil pada KroA100 sebesar 24,97%, KroA150 sebesar 50,84% dan KroA200 sebesar 49,08%. Maka dapat disimpulkan bahwa GA-DAC bisa mendapatkan hasil lebih baik dibandingkan dengan GA standar, sehingga membuat GA dapat keluar dari konvergensi prematur.","authors":["Muhammad Rikzam Kamal","Romi Satria","Wahono Dan","Abdul Syukur"],"meta":["December 2015"],"references":["273901288_TSP_Race_Minimizing_completion_time_in_time-sensitive_applications","271225044_The_Steiner_Traveling_Salesman_Problem_with_online_edge_blockages","264811984_A_Comparative_Review_of_Approaches_to_Prevent_Premature_Convergence_in_GA","260043680_The_Hybrid_Genetic_Algorithm_with_two_Local_Optimization_Strategies_for_Traveling_Salesman_Problem","258241372_A_New_Genetic_Algorithm_for_Solving_Optimization_Problem","257636083_Convergence_of_nomadic_genetic_algorithm_on_benchmark_mathematical_functions","251403850_A_Real-coded_Genetic_Algorithm_using_the_Unimodal_Normal_Distribution_Crossover","224142973_Genetic_Algorithms_With_Guided_and_Local_Search_Strategies_for_University_Course_Timetabling","223847056_Study_of_genetic_algorithm_with_reinforcement_learning_to_solve_the_TSP","223831065_Adopting_co-evolution_and_constraint-satisfaction_concept_on_genetic_algorithms_to_solve_supply_chain_network_design_problems"]}