{"id":"345388147_Ein_Blick_auf_aktuelle_Entwicklungen_bei_Blockchains_und_deren_Auswirkungen_auf_den_Energieverbrauch","abstract":"Zusammenfassung\nDer enorme Stromverbrauch von Bitcoin hat dazu geführt, dass in Wissenschaft und Praxis oft eher undifferenziert Diskussionen über die Nachhaltigkeit von Blockchain- bzw. Distributed-Ledger-Technologie allgemein geführt werden. Allerdings ist die Blockchain-Technologie bereits heute alles andere als homogen – nicht nur hinsichtlich ihrer Anwendungen, die mittlerweile weit über Kryptowährungen hinaus in Wirtschaft und öffentlichen Sektor reichen, sondern auch bezüglich ihrer technischen Charakteristika und insbesondere ihres Stromverbrauchs. Dieser Beitrag fasst den Status quo des Stromverbrauchs verschiedener Implementierungen von Blockchain-Technologie zusammen und geht dabei besonders auf das kürzlich erfolgte Bitcoin Halving sowie sogenannte ZK-Rollups ein. Wir argumentieren, dass Bitcoin und andere Proof-of-Work-Blockchains zwar in der Tat sehr viel Strom verbrauchen, aber bereits heute alternative Blockchain-Lösungen mit deutlich geringerem Stromverbrauch verfügbar sind und weitere vielversprechende Konzepte erprobt werden, die gerade den Stromverbrauch von großen Blockchain-Netzwerken in naher Zukunft noch einmal deutlich senken könnten. Daraus schließen wir, dass die Kritik am Stromverbrauch von Bitcoin zwar legitim ist, jedoch daraus nicht eine Energieproblematik von Blockchain-Technologie generell abgeleitet werden darf. In vielen Fällen, in denen mithilfe von energieeffizienteren Blockchain-Varianten Prozesse digitalisiert oder verbessert werden können, darf sogar per Saldo durchaus mit Energieeinsparungen gerechnet werden.","authors":["Johannes Sedlmeir","Gilbert Fridgen","Robert Keller","Hans Ulrich Buhl"],"meta":["December 2020Informatik Spektrum 43(11)","DOI:10.1007/s00287-020-01321-z","Project: Energy Consumption of IT"],"references":["342313238_The_Energy_Consumption_of_Blockchain_Technology_Beyond_Myth","337797310_Building_a_Blockchain_Application_that_Complies_with_the_EU_General_Data_Protection_Regulation","335457532_Could_Bitcoin_Emissions_Push_Global_Warming_Above_2_C","343438117_Energy_Consumption_of_Cryptocurrencies_Beyond_Bitcoin","339564167_Recalibrating_global_data_center_energy-use_estimates","335170713_When_does_it_pay_off_to_integrate_sustainability_in_the_business_model_-_A_game-theoretic_analysis","335074449_Scalable_Zero_Knowledge_with_No_Trusted_Setup","335062214_Theorizing_the_digital_object","334891622_PartChain_A_Decentralized_Traceability_Application_for_Multi-Tier_Supply_Chain_Networks_in_the_Automotive_Industry","333733035_The_Carbon_Footprint_of_Bitcoin"]}