{"id":"345397502_PELATIHAN_PENGENALAN_DATA_SCIENCE_UNTUK_MENINGKATKAN_KEMAMPUAN_DALAM_PENGOLAHAN_DATA","abstract":"Abstrak Data science merupakan gabungan ilmu komputer, statistika, dan pengetahuan domain bisnis untuk ekstraksi tumpukan data yang besar menjadi pengetahuan sehingga mendapatkan pattern atau pola-pola yang dapat memudahkan pengambil keputusan. Adapun orang menggeluti bidang data science disebut data scientist. Profesi data scientist akhir-akhir ini menjadi profesi yang sangat seksi di abad 21. Sumber daya manusia yang berprofesi sebagai data scientist di Indonesia sangat sedikit bila dibandingkan ketersedian lapangan kerja dibidang data science. Dengan kata lain, ketersediaan lapangan kerja data science berbanding terbalik dengan ketersediaan SDM yang berprofesi sebagai data scientist, dimana jumlah SDM data scientist sangat sedikit dibandingkan dengan jumlah lapangan kerja yang berlimpah. Salah satu solusi yang ditawarkan adalah mengadakan pelatihan dan workshop untuk pengenalan data science untuk meningkatkan SDM bidang data science khususnya di Universitas Bumigora. Metode pelaksanaan yang digunakan adalah penyampaian materi tentang data science dan simulasi penggunaan metode data science dalam kasus real menggunakan Google Colab. Berdasarkan hasil pelatihan dan workshop yang telah dilaksanakan, dapat meningkatkan pemahaman dan kemampuan para peserta untuk menggunakan metode-metode yang ada pada data science untuk mengolah data menjadi sebuah pengetahuan. Abstract Data science is a combination of computer science, statistics, and business domain knowledge for extracting large heaps of data into knowledge so as to obtain patterns that can facilitate decision makers.","authors":["Hairani Hairani","Ahmad Zuli Amrullah"],"meta":["August 2020","DOI:10.31004/abdidas.v1i3.31"],"references":["325602264_Aplikasi_Pemetaan_Kualitas_Pendidikan_di_Indonesia_Menggunakan_Metode_K-Means","338759179_Implementation_Of_Data_Mining_For_Determining_Majors_Using_K-Means_Algorithm_In_Students_Of_SMA_Negeri_1_Pangkalan_Kerinci"]}