{"id":"345391861_Digital_Learning_Games_for_Mathematics_and_Computer_Science_Education_The_Need_for_Preregistered_RCTs_Standardized_Methodology_and_Advanced_Technology","abstract":"In today’s digital information society, mathematical and computational skills are becoming increasingly important. With the demand for mathematical and computational literacy rising, the question of how these skills can be effectively taught in schools is among the top priorities in education. Game-based learning promises to diversify education, increase students’ interest and motivation, and offer positive and effective learning experiences. Especially digital game-based learning (DGBL) is considered an effective educational tool for improving education in classrooms of the future. Yet, learning is a complex psychological phenomenon and the effectiveness of digital games for learning cannot be taken for granted. This is partly due to a diversity of methodological approaches in the literature and partly due to theoretical and practical considerations. We present core elements of psychological theories of learning and derive arguments for and against DGBL and non-DGBL. We discuss previous literature on DGBL in mathematics education from a methodological point of view and infer the need for randomized controlled trials for effectiveness evaluations. To increase comparability of empirical results, we propose methodological standards for future educational research. The value of multidisciplinary research projects to advance the field of DGBL is discussed and a synergy of Affective Computing and Optimal Experimental Design (OED) techniques is proposed for the implementation of adaptive technologies in digital learning games. Finally, we make suggestions for game content, which would be suitable for preparing students for university-level mathematics and computer science education, and discuss the potential limitations of DGBL in the classroom.","authors":["Lara Bertram"],"meta":["October 2020Frontiers in Psychology 11:2127","DOI:10.3389/fpsyg.2020.02127"],"references":["348945231_Masterminding_in_Education_Bringing_cognition_emotion_and_motivation_together_in_a_unified_mathematical_framework_CogSci_2019_3410","341880871_Emotion_entropy_evaluations_and_subjective_uncertainty","337067276_The_effect_of_game-based_learning_on_academic_achievement_motivation_of_elementary_school_students","334223188_ADOpy_A_Python_Package_for_Adaptive_Design_Optimization","332940258_Embodied_Cognition","332282346_A_NOVEL_APPROACH_AND_SOFTWARE_COMPONENT_FOR_SUPPORTING_COMPETENCE-BASED_LEARNING_WITH_SERIOUS_GAMES","332089384_Being_There_Putting_Brain_Body_and_World_Together_Again","331980968_Memory_enhancements_from_active_control_of_learning_emerge_across_development","331960611_The_Relation_Between_Mathematics_Anxiety_and_Mathematics_Performance_Among_School-Aged_Students_A_Meta-Analysis","331460666_Adapting_Software_with_Affective_Computing_A_Systematic_Review"]}