{"id":"345352442_K-Means-based_isolation_forest","abstract":"The task of anomaly detection in data is one of the main challenges in data science because of the wide plethora of applications and despite a spectrum of available methods. Unfortunately, many of anomaly detection schemes are still imperfect i.e., they are not effective enough or act in a non-intuitive way or they are focused on a specific type of data. In this study, the classical method of Isolation Forest is thoroughly analyzed and augmented by bringing an innovative approach. This is k-Means-Based Isolation Forest that allows to build a search tree based on many branches in contrast to the only two considered in the original method. k-Means clustering is used to predict the number of divisions on each decision tree node. As supported through experimental studies, the proposed method works effectively for data coming from various application areas including intermodal transport and geographical, spatio-temporal data. In addition, it enables a user to intuitively determine the anomaly score for an individual record of the analyzed dataset. The advantage of the proposed method is that it is able to fit the data at the step of decision tree building. Moreover, it returns more intuitively appealing anomaly score values.","authors":["Paweł Karczmarek","Adam Kiersztyn","Witold Pedrycz","Ebru Al"],"meta":["May 2020Knowledge-Based Systems 195(3):105659","DOI:10.1016/j.knosys.2020.105659"],"references":["332238832_DBSCAN-like_clustering_method_for_various_data_densities","329792334_DeepAnT_A_Deep_Learning_Approach_for_Unsupervised_Anomaly_Detection_in_Time_Series","327538806_Real-time_big_data_processing_for_anomaly_detection_A_Survey","326861200_An_Intelligent_System_for_Spam_Detection_and_Identification_of_the_most_Relevant_Features_based_on_Evolutionary_Random_Weight_Networks_Information_Fusion_Impact_Factor_12975","334779656_Fuzzy_clustering_of_mixed_data","321120561_A_hybrid_semi-supervised_approach_for_financial_fraud_detection","320678676_DeepLog_Anomaly_Detection_and_Diagnosis_from_System_Logs_through_Deep_Learning","320393574_Adaptive_Kernel_Density-based_Anomaly_Detection_for_Nonlinear_Systems","318916953_Anomaly_Detection_with_Robust_Deep_Autoencoders","316438656_Detecting_anomalies_in_time_series_data_via_a_deep_learning_algorithm_combining_wavelets_neural_networks_and_Hilbert_transform"]}