{"id":"345379748_The_Power_of_Modal_Separation_Logics","abstract":"We introduce a modal separation logic MSL whose models are memory states from separation logic and the logical connectives include modal operators as well as separating conjunction and implication from separation logic. With such a combination of operators, some fragments of MSL can be seen as genuine modal logics whereas some others capture standard separation logics, leading to an original language to speak about memory states. We analyse the decidability status and the computational complexity of several fragments of MSL, obtaining surprising results by design of proof methods that take into account the modal and separation features of MSL. For example, the satisfiability problem for the fragment of MSL with $\\Diamond $, the difference modality $\\langle \\neq \\rangle $ and separating conjunction $\\ast $ is shown Tower-complete whereas the restriction either to $\\Diamond $ and $\\ast $ or to $\\langle \\neq \\rangle $ and $\\ast $ is only NP-complete. We establish that the full logic MSL admits an undecidable satisfiability problem. Furthermore, we investigate variants of MSL with alternative semantics and we build bridges with interval temporal logics and with logics equipped with sabotage operators.","authors":["Stephane Demri","Raul Fervari"],"meta":["December 2019Journal of Logic and Computation 29(8):1139-1184","DOI:10.1093/logcom/exz019"],"references":["340695149_An_Auxiliary_Logic_on_Trees_on_the_Tower-Hardness_of_Logics_Featuring_Reachability_and_Submodel_Reasoning","332883201_Axiomatising_Logics_with_Separating_Conjunction_and_Modalities","329758999_Satisfiability_for_relation-changing_logics","325299198_Why_Separation_Logic_Works","324518990_The_Effects_of_Adding_Reachability_Predicates_in_Propositional_Separation_Logic","344486660_Modal_Logic","334998155_Why_Propositional_Quantification_Makes_Modal_Logics_on_Trees_Robustly_Hard","332425855_A_public_announcement_separation_logic","328780101_On_the_Almighty_Wand","328780100_Reasoning_about_sequences_of_memory_states"]}