{"id":"345382619_Research_on_Urban_Land_Price_Assessment_Based_on_Artificial_Neural_Network_Model","abstract":"At present, there are many problems to be solved in the study of residential land price evaluation, such as the imbalance of residential land price data categories, the small sample of residential land price data sets, the possibility of the evaluation model falling into the local optimal value, and the large error of feature quantification. This paper introduces the problems in the process of residential land price evaluation from three aspects: land price data, evaluation model and feature quantification. In this paper, an extraction method for land price features based on transfer learning is proposed in connection with defects such as the small total amount of residential land price data and unbalanced class distribution, and different land price assessment models are used to carry out a precision evaluation and explore the models and methods suitable for land price assessment. In this paper, the extraction method for residential land price features is improved. The experimental results show that the extraction algorithm for land price features based on transfer learning has better classification accuracy than the commonly used principal component analysis and extraction method and linear normalization method, with a mean average precision 10.9% and 4.73% higher, respectively. The optimal feature set classification accuracy reached 90.28%; therefore, the algorithm for residential land price assessment proposed in this paper is able to satisfy the precision requirement of actual land price assessment.","authors":["Cai Shousong","Gu Xiaomin","Wang Xiaoguang","Chen Ying"],"meta":["January 2019IEEE Access 7:180738-180748","DOI:10.1109/ACCESS.2019.2958978"],"references":["329023197_Evaluation_of_the_Spatial_Pattern_of_Logistics_Facilities_using_Urban_Logistics_Land-use_and_Traffic_Simulator","326130904_Housing_Diversity_and_Affordability_The_Effects_of_35_Years_of_Exclusionary_Land_Use_Regulations_on_Housing_Affordability_in_Adelaide_South_Australia","325927327_Urban_Land_Revenue_and_Sustainable_Urbanization_in_China_Issues_and_Challenges","323496015_Housing_price_and_fundamentals_in_a_transition_economy_The_case_of_the_beijing_market","340436576_The_taxation_of_land_value_as_the_means_towards_optimal_urban_development_and_the_extirpation_of_excessive_economic_inequality","335764946_Multimodal_Representation_Learning_for_Recommendation_in_Internet_of_Things","332216232_Improved_Kalman_filter_based_differentially_private_streaming_data_release_in_cognitive_computing","331570013_Effects_of_greenbelt_cancellation_on_land_value_The_case_of_Wirye_New_Town_South_Korea","325431657_How_artificial_intelligence_is_changing_drug_discovery","325031088_Artificial_Intelligence_Rationality_and_the_World_Wide_Web"]}