{"id":"345369752_Image_Encryption_and_decryption_using_CAST-128_with_proposed_adaptive_key_L_Enas_Tariq_DrEkhlas_Falih_Computer_Sciences_Department_University_of_TechnologyBaghdad_Iraq","abstract":"Encryption of an Image is an interesting region in the security of an information field. Encryption of an image is various form text because of its features. it is difficult for dealing with encryption of an image by employing conventional methods of encryption. The suggested methodology had been employed images. CAST - 128 algorithm is a procedure that is designing for symmetric algorithm for encryption which has Feistel classical network containing 16 rounds and can operate on 64-bits blocks of plain text to introduce 64- bit blocks of cipher-text. A key is size varies from 40 bits to 128 bits in 8-bit increments. The proposed adaptive 128-bits key can be extracted from the main diagonal of the original image before encryption and apply MD5 hash function to increase the key security. The experimental results explained that the time consuming for both encryption and decryption when using proposed adaptive key is less than static key. \nKeywords :- Cryptography, CAST-128 Algorithm, Image encryption, Feistel classical network, image decryption.","authors":["Enas Tariq Khudir"],"meta":["November 2020","Projects: Proposal of Two Enhanced Paillier CryptosystemsImage Encryption and decryption using CAST-128 with proposed adaptive key       L. Enas Tariq                          Dr.Ekhlas Falih                                               Computer Sciences Department / University of Technology/Baghdad/ Iraq"],"references":["328236410_A_Re-Examine_on_Assorted_Digital_Image_Encryption_Algorithm's_Techniques","266971408_A_comparative_survey_of_Symmetric_and_Asymmetric_Key_Cryptography","41085826_Encryption_Quality_Analysis_and_Security_Evaluation_of_CAST-128_Algorithm_and_its_Modified_Version_using_Digital_Images","314194999_Improved_Differential_Cryptanalysis_of_CAST-128_and_CAST-256","295611877_A_Secure_Visual_Secret_Share_VSS_Creation_Scheme_in_Visual_Cryptography_using_Elliptic_Curve_Cryptography_with_Optimization_Technique","286494234_Encrypting_and_decrypting_image_using_computer_visualization_techniques"]}