{"id":"345396609_FRIPON_a_worldwide_network_to_track_incoming_meteoroids","abstract":"Context. Until recently, camera networks designed for monitoring fireballs worldwide were not fully automated, implying that in case of a meteorite fall, the recovery campaign was rarely immediate. This was an important limiting factor as the most fragile – hence precious – meteorites must be recovered rapidly to avoid their alteration.\nAims. The Fireball Recovery and InterPlanetary Observation Network (FRIPON) scientific project was designed to overcome this limitation. This network comprises a fully automated camera and radio network deployed over a significant fraction of western Europe and a small fraction of Canada. As of today, it consists of 150 cameras and 25 European radio receivers and covers an area of about 1.5 × 10 ⁶ km ² .\nMethods. The FRIPON network, fully operational since 2018, has been monitoring meteoroid entries since 2016, thereby allowing the characterization of their dynamical and physical properties. In addition, the level of automation of the network makes it possible to trigger a meteorite recovery campaign only a few hours after it reaches the surface of the Earth. Recovery campaigns are only organized for meteorites with final masses estimated of at least 500 g, which is about one event per year in France. No recovery campaign is organized in the case of smaller final masses on the order of 50 to 100 g, which happens about three times a year; instead, the information is delivered to the local media so that it can reach the inhabitants living in the vicinity of the fall.\nResults. Nearly 4000 meteoroids have been detected so far and characterized by FRIPON. The distribution of their orbits appears to be bimodal, with a cometary population and a main belt population. Sporadic meteors amount to about 55% of all meteors. A first estimate of the absolute meteoroid flux (mag < –5; meteoroid size ≥~1 cm) amounts to 1250/yr/10 ⁶ km ² . This value is compatible with previous estimates. Finally, the first meteorite was recovered in Italy (Cavezzo, January 2020) thanks to the PRISMA network, a component of the FRIPON science project.","authors":["Francois Colas","B. Zanda","Sylvain Bouley","S. Jeanne"],"meta":["October 2020Astronomy and Astrophysics 644","DOI:10.1051/0004-6361/202038649","Project: Small body of the solar system"],"references":["339345899_A_case_study_of_the_May_30_2017_Italian_fireball","338170921_Characterization_of_the_matrix_and_fusion_crust_of_the_recent_meteorite_fall_Ozerki_L6","336414225_Determining_fireball_fates_using_the_a-b_criterion","335120697_The_Hamburg_meteorite_fall_Fireball_trajectory_orbit_and_dynamics","346851057_Cavezzo_the_first_Italian_meteorite_recovered_by_the_PRISMA_fireball_network_Orbit_trajectory_and_strewn-field","345994233_Murrili_meteorite's_fall_and_recovery_from_Kati_Thanda","343161545_A_Global_Fireball_Observatory","339795478_Orbit_and_origin_of_the_LL_7_chondrite_Dishchii'bikoh_Arizona","339141990_The_Zdar_nad_Sazavou_meteorite_fall_Fireball_trajectory_photometry_dynamics_fragmentation_orbit_and_meteorite_recovery","337346075_NASA's_Meteoroid_Engineering_Model_3_and_Its_Ability_to_Replicate_Spacecraft_Impact_Rates"]}