{"id":"345355673_Kinetic_Euclidean_Distance_Matrices","abstract":"Euclidean distance matrices (EDMs) are a major tool for localization from distances, with applications ranging from protein structure determination to global positioning and manifold learning. They are, however, static objects which serve to localize points from a snapshot of distances. If the objects move, one expects to do better by modeling the motion. In this paper, we introduce Kinetic Euclidean Distance Matrices (KEDMs)-a new kind of time-dependent distance matrices that incorporate motion. The entries of KEDMs become functions of time, the squared time-varying distances. We study two smooth trajectory models-polynomial and bandlimited trajectories-and show that these trajectories can be reconstructed from incomplete, noisy distance observations, scattered over multiple time instants. Our main contribution is a semidefinite relaxation, inspired by similar strategies for static EDMs. Similarly to the static case, the relaxation is followed by a spectral factorization step; however, because spectral factorization of polynomial matrices is more challenging than for constant matrices, we propose a new factorization method that uses anchor measurements. Extensive numerical experiments show that KEDMs and the new semidefinite relaxation accurately reconstruct trajectories from noisy, incomplete distance data and that, in fact, motion improves rather than degrades localization if properly modeled. This makes KEDMs a promising tool for problems in geometry of dynamic points sets.","authors":["Puoya Tabaghi","Ivan Dokmanic","Martin Vetterli"],"meta":["January 2020IEEE Transactions on Signal Processing 68:452-465","DOI:10.1109/TSP.2019.2959260"],"references":["326573766_An_application-based_characterization_of_dynamical_distance_geometry_problems","312873211_A_swarm_of_autonomous_miniature_underwater_robot_drifters_for_exploring_submesoscale_ocean_dynamics","308807814_Open_research_areas_in_distance_geometry","330634312_On_the_Algorithmization_of_Janashia-Lagvilava_Matrix_Spectral_Factorization_Method","329576508_Signals_of_Opportunity_Aided_Inertial_Navigation","329411391_Open_Research_Areas_in_Distance_Geometry","320589319_An_Approach_to_Dynamical_Distance_Geometry","320543521_3D_CNNs_on_Distance_Matrices_for_Human_Action_Recognition","319736225_A_Rewriting_System_for_Convex_Optimization_Problems","312835652_Distributed_Range-Based_Relative_Localization_of_Robot_Swarms"]}