{"id":"345326104_Limitations_to_Building_Institutional_Trustworthiness_through_E-Government_A_Comparative_Study_of_Two_E-Services_in_Chile","abstract":"There is much interest in the application of new information and communication technologies (ICTs) to improve the quality, performance, and responsiveness of public sector Institutions thereby potentially Improving trust. However, there is little empirical evidence about the interaction of ICT Implementations on institutional trust of the public sector. This article extends our understanding of the interplay of ICTs in the public sector and Institutional trust through an in-depth comparative case-study of two successful Chilean e-servlces. The article begins by developing a relational conception of institutional trust of which Institutional trustworthiness is a component of that relationship. It then analyses the two cases separately with respect to three dimensions of institutional trustworthiness: good performance, aligned incentives, and the values of fairness and distributive justice. Following this, a comparative analysis of the two cases shows that while the implementation of technology may bring anticipated efficiency, effectiveness, and transparency gains, there are fundamental limitations to improving institutional trustworthiness through technological interventions. In particular, where points of discretion and ambiguity remain, or power asymmetries are exacerbated, trustworthiness is challenged. Furthermore, drawing on the cases and the relational conception of institutional trust, the article argues that enhancing trustworthiness is a constrained optimisation problem in an environment of competing and often conflicting values.","authors":["Matthew Longshore Smith"],"meta":["March 2011Journal of Information Technology 26(1):78-93","DOI:10.1057/jlt.2010.17"],"references":["346680538_Realist_Social_Theory_The_Morphogenetic_Approach","346671043_Trust_and_its_surrogates_psychological_foundations_of_political_process","344472639_Democratic_theory_and_trust","344072211_Theories_of_the_Information_Society","344037586_How_can_we_trust_our_fellow_citizens","333018699_TWO_The_Public_Trust","324315023_Exit_Voice_and_Loyalty_Responses_to_Decline_in_Firms_Organizations_and_States","318899897_Trust_and_democratic_governance","318587513_Trust_and_trustworthiness","317623581_The_Logic_and_Limits_of_Trust"]}