{"id":"345480824_Differential_gene_co-expression_network_using_BicMix","abstract":"Alzheimer’s is a dangerous disease that causes dementia. Malfunctioned gene in the brain caused by Alzheimer Disease (AD) make some problem in the brain (e.g memory). Recovering network of the gene in the AD from Alzheimer’s gene expression data is essential to understand the information about AD. In this research, we want to find groups of genes that co-expressed in some condition, called biclusters, and find the network of those genes based on that group. The problem to find the accurate network/information is the unknown external factor that affects the measurement. Here we use probability-based biclustering to cover the uncertainty. We use BicMix, a new probabilistic-based biclustering method to find biclusters of gene and the gene expression network. This method use a Bayesian framework and models the data as a result of the multiplication of two sparse matrices. The value of these matrices represents whether or not a gene or a condition included in a bicluster. Three-Parameter Beta (TPB) distribution and variational expectation maximization (VEM) is respectively used to induce the sparsity of these matrices and to estimate the parameters. Once we get the biclusters, the result can be used to build the gene co-expression network.","authors":["N. A. Wibawa","Alhadi Bustamam","Titin Siswantining"],"meta":["March 2019AIP Conference Proceedings 2084(1):020006","DOI:10.1063/1.5094270","Conference: PROCEEDINGS OF THE SYMPOSIUM ON BIOMATHEMATICS (SYMOMATH) 2018"],"references":["320688251_Implementation_of_plaid_model_biclustering_method_on_microarray_of_carcinoma_and_adenoma_tumor_gene_expression_data","310457795_World_Alzheimer_Report_2016_Improving_healthcare_for_people_with_dementia_Coverage_quality_and_costs_now_and_in_the_future","305711713_Context_Specific_and_Differential_Gene_Co-expression_Networks_via_Bayesian_Biclustering","268226636_Bayesian_group_latent_factor_analysis_with_structured_sparse_priors","264196969_Differential_Network_Analyses_of_Alzheimer's_Disease_Identify_Early_Events_in_Alzheimer's_Disease_Pathology","224868889_Reordering_based_integrative_expression_profiling_for_microarray_classification","224352748_Bayesian_biclustering_with_the_plaid_model","221699358_Exploring_matrix_factorization_techniques_for_significant_genes_identification_of_Alzheimer's_disease_microarray_gene_expression_data","318590555_Spike_and_Slab_Biclustering","51187045_Robust_biclustering_by_sparse_singular_value_decomposition_incorporating_stability_selection"]}