{"id":"345400317_Vague_Graph_Structure_with_Application_in_Medical_Diagnosis","abstract":"Fuzzy graph models enjoy the ubiquity of being in natural and human-made structures, namely dynamic process in physical, biological and social systems. As a result of inconsistent and indeterminate information inherent in real-life problems which are often uncertain, it is highly difficult for an expert to model those problems based on a fuzzy graph (FG). Vague graph structure (VGS) can deal with the uncertainty associated with the inconsistent and indeterminate information of any real-world problem, where fuzzy graphs may fail to reveal satisfactory results. Likewise, VGSs are very useful tools for the study of different domains of computer science such as networking, capturing the image, clustering, and also other issues like bioscience, medical science, and traffic plan. The limitations of past definitions in fuzzy graphs have led us to present new definitions in VGSs. Operations are conveniently used in many combinatorial applications. In various situations, they present a suitable construction means; therefore, in this research, three new operations on VGSs, namely, maximal product, rejection, residue product were presented, and some results concerning their degrees and total degrees were introduced. Irregularity definitions have been of high significance in the network heterogeneity study, which have implications in networks found across biology, ecology and economy; so special concepts of irregular VGSs with several key properties were explained. Today one of the most important applications of decision making is in medical science for diagnosing the patient’s disease. Hence, we recommend an application of VGS in medical diagnosis.","authors":["Saeed Kosari","Yongsheng Rao","Huiqin Jiang","Xinyue Liu"],"meta":["September 2020Symmetry 12(10):1582","DOI:10.3390/sym12101582"],"references":["343309796_New_Concepts_in_Intuitionistic_Fuzzy_Graph_with_Application_in_Water_Supplier_Systems","339739774_Pythagorean_Fuzzy_Matroids_with_Application","339128662_Generalization_of_Maximizing_Deviation_and_TOPSIS_Method_for_MADM_in_Simplified_Neutrosophic_Hesitant_Fuzzy_Environment","330291953_Certain_fuzzy_graph_structures","330287762_Fuzzy_Graph_Structures_with_Application","321888290_Certain_Concepts_in_Intuitionistic_Neutrosophic_Graph_Structures","301851029_Irregular_Bipolar_Fuzzy_Graphs","306331684_Product_of_intuitionistic_fuzzy_graphs_and_degree","300047379_Vague_graphs_with_application","292143739_Product_of_bipolar_fuzzy_graphs_and_their_degree"]}