{"id":"345435447_NL_ARMS_Netherlands_Annual_Review_of_Military_Studies_2019_Educating_Officers_The_Thinking_Soldier_-_The_NLDA_and_the_Bologna_Declaration_Educating_Officers_The_Thinking_Soldier_-_The_NLDA_and_the_Bol","abstract":"This book has as its subject matter the academic education of officers and builds on the signing of the Bologna Declaration in 1999 by twenty-nine European ministers for Education and Science, who thereby agreed to coordinate higher education across Europe, by, for instance, the implementation of the Bachelor's and Master's system. \n\nIn the meantime, military academies have also introduced the BaMa system into their programs for officers’ education, which marks a transition from the old days, when officers’ education took place within a national military system, under military command, and was firmly grounded in principles, traditions and needs, as professed by the Ministries of Defence and the armed forces in particular. So the Bologna Declaration can be seen as crucial leverage for the development of in-house academic degree programs as a fundamental part of officers’ education.\n\nWith this volume, the editors of NL ARMS 2019 strive to offer a platform to both academics and military and civilian practitioners, as well as to combinations of these, to reflect and share their thoughts on officers’ education `before and after' Bologna, both in The Netherlands and abroad. \n\nTo this end, controversies and challenges, affecting various aspects and systems of officers’ education, have been grouped into five themes. Respectively, the first four themes comprise institutional settings and change; educational philosophy; educational challenges and reflective practices; and didactical solutions. The fifth theme, international perspectives, provides insights into the strategic environments and challenges faced by sister-academies, as well as ways to further officers' education across Europe, such as offered by Erasmus programs. \n\nAll the editors of this year's volume are affiliated with the Faculty of Military Sciences of the Netherlands Defence Academy in Breda, The Netherlands.","authors":["Wim Klinkert","Myriame T.I.B Bollen","Marenne Jansen","Henk de Jong"],"meta":["January 2019","DOI:10.1007/978-94-6265-315-3","ISBN: 978-94-6265-314-6"],"references":[]}