{"id":"345491328_Unfolding_quantum_computer_readout_noise","abstract":"In the current era of noisy intermediate-scale quantum computers, noisy qubits can result in biased results for early quantum algorithm applications. This is a significant challenge for interpreting results from quantum computer simulations for quantum chemistry, nuclear physics, high energy physics (HEP), and other emerging scientific applications. An important class of qubit errors are readout errors. The most basic method to correct readout errors is matrix inversion, using a response matrix built from simple operations to probe the rate of transitions from known initial quantum states to readout outcomes. One challenge with inverting matrices with large off-diagonal components is that the results are sensitive to statistical fluctuations. This challenge is familiar to HEP, where prior-independent regularized matrix inversion techniques (“unfolding”) have been developed for years to correct for acceptance and detector effects, when performing differential cross section measurements. We study one such method, known as iterative Bayesian unfolding, as a potential tool for correcting readout errors from universal gate-based quantum computers. This method is shown to avoid pathologies from commonly used matrix inversion and least squares methods.","authors":["Benjamin Nachman","Miroslav Urbanek","Wibe A de Jong","Christian W. Bauer"],"meta":["September 2020npj Quantum Information 6(1):84","DOI:10.1038/s41534-020-00309-7"],"references":["340911808_Mitigation_of_readout_noise_in_near-term_quantum_devices_by_classical_post-processing_based_on_detector_tomography","337580185_Unfolding_measurement_distributions_via_quantum_annealing","337282873_Quantum_chemistry_as_a_benchmark_for_near-term_quantum_computers","332051551_Error_mitigation_extends_the_computational_reach_of_a_noisy_quantum_processor","344009591_Error_detection_on_quantum_computers_improving_the_accuracy_of_chemical_calculations","343025946_Minimally_entangled_state_preparation_of_localized_wave_functions_on_quantum_computers","338618032_XACC_a_system-level_software_infrastructure_for_heterogeneous_quantum-classical_computing","337236965_Detector_tomography_on_IBM_quantum_computers_and_mitigation_of_an_imperfect_measurement","336454047_Mitigating_Measurement_Errors_in_Quantum_Computers_by_Exploiting_State-Dependent_Bias","333330038_Digitization_of_scalar_fields_for_quantum_computing"]}