{"id":"345424806_Unsupervised_Domain_Adaptation_Using_Generative_Adversarial_Networks_for_Semantic_Segmentation_of_Aerial_Images","abstract":"Segmenting aerial images is of great potential in surveillance and scene understanding of urban areas. It provides a mean for automatic reporting of the different events that happen in inhabited areas. This remarkably promotes public safety and traffic management applications. After the wide adoption of convolutional neural networks methods, the accuracy of semantic segmentation algorithms could easily surpass 80% if a robust dataset is provided. Despite this success, the deployment of a pretrained segmentation model to survey a new city that is not included in the training set significantly decreases accuracy. This is due to the domain shift between the source dataset on which the model is trained and the new target domain of the new city images. In this paper, we address this issue and consider the challenge of domain adaptation in semantic segmentation of aerial images. We designed an algorithm that reduces the domain shift impact using generative adversarial networks (GANs). In the experiments, we tested the proposed methodology on the International Society for Photogrammetry and Remote Sensing (ISPRS) semantic segmentation dataset and found that our method improves overall accuracy from 35% to 52% when passing from the Potsdam domain (considered as source domain) to the Vaihingen domain (considered as target domain). In addition, the method allows efficiently recovering the inverted classes due to sensor variation. In particular, it improves the average segmentation accuracy of the inverted classes due to sensor variation from 14% to 61%.","authors":["Bilel Benjdira","Yakoub Bazi","Anis Koubaa","Kais Ouni"],"meta":["June 2019Remote Sensing 11(11):1369","DOI:10.3390/rs11111369"],"references":["323416175_Siamese-GAN_Learning_Invariant_Representations_for_Aerial_Vehicle_Image_Categorization","322060135_Unpaired_Image-to-Image_Translation_Using_Cycle-Consistent_Adversarial_Networks","331004941_Survey_on_Semantic_Segmentation_using_Deep_Learning_Techniques","329748675_ROAD_Reality_Oriented_Adaptation_for_Semantic_Segmentation_of_Urban_Scenes","329746099_Learning_to_Adapt_Structured_Output_Space_for_Semantic_Segmentation","329741669_Fully_Convolutional_Adaptation_Networks_for_Semantic_Segmentation","328156757_BiSeNet_Bilateral_Segmentation_Network_for_Real-Time_Semantic_Segmentation_15th_European_Conference_Munich_Germany_September_8-14_2018_Proceedings_Part_XIII","328108412_Encoder-Decoder_with_Atrous_Separable_Convolution_for_Semantic_Image_Segmentation_15th_European_Conference_Munich_Germany_September_8-14_2018_Proceedings_Part_VII","324997638_Synthetic_to_Real_Adaptation_with_Generative_Correlation_Alignment_Networks","323027025_Encoder-Decoder_with_Atrous_Separable_Convolution_for_Semantic_Image_Segmentation"]}