{"id":"345682132_Exploring_the_relationship_between_altmetrics_and_traditional_measures_of_dissemination_in_health_professions_education","abstract":"Researchers, funders, and institutions are interested in understanding and quantifying research dissemination and impact, particularly related to communicating with the public. Traditionally, citations have been a primary impact measure; however, citations can be slow to accrue and focus on academic use. Recently altmetrics, which track alternate dissemination forms (e.g., social media) have been suggested as a complement to citation-based metrics. This study examines the relationship between altmetrics and traditional measures: journal article citations and access counts.\nThe researchers queried Web of Science and Altmetric Explorer for articles published in HPE journals between 2013-2015. They identified 2,486 articles with altmetrics. Data were analyzed using negative binomial and linear regression models.\nBlogging was associated with the greatest increase in citations (13% increase), whereas Tweets (1.2%) and Mendeley (1%) were associated with smaller increases. Journal impact factor (JIF) was associated with a 21% increase in citations. Publicly accessible articles were associated with a 19% decrease, but the interactive effect between accessible articles and JIF was associated with a 12% increase. When examining access counts, publicly accessible articles had an increase of 170 access counts whereas blogging was associated with a decrease of 87 accesses.\nThis study suggests that several altmetrics outlets are positively associated with citations, and that public accessibility, holding all other independent variables constant, is positively related to article access. Given the scientific community’s evolving focus on dissemination—including to the public—these findings have implications for stakeholders, providing insight into the factors that may improve citations and access of articles.","authors":["Lauren A Maggio","Todd C. Leroux","Holly Meyer","Anthony R Artino"],"meta":["February 2018","DOI:10.1101/260059"],"references":["338893392_THE_STATE_OF_OA_A_LARGE-SCALE_ANALYSIS_OF_THE_PREVALENCE_AND_IMPACT_OF_OPEN_ACCESS_ARTICLES","310658433_Qualitative_study_of_physicians'_varied_uses_of_biomedical_research_in_the_USA","309962068_Twitter_Predicts_Citation_Rates_of_Ecological_Research","286021836_Correction_Can_Tweets_Predict_Citations_Metrics_of_Social_Impact_Based_on_Twitter_and_Correlation_with_Traditional_Metrics_of_Scientific_Impact","319145902_Beyond_Citation_Rates_A_Real-Time_Impact_Analysis_of_Health_Professions_Education_Research_Using_Altmetrics","319133357_More_Than_Likes_and_Tweets_Creating_Social_Media_Portfolios_for_Academic_Promotion_and_Tenure","318999572_Tracking_the_Scholarly_Conversation_in_Health_Professions_Education_An_Introduction_to_Altmetrics","318513814_Comparing_alternative_and_traditional_dissemination_metrics_in_medical_education","318393770_R_A_Language_and_Environment_for_Statistical_Computing","292251983_Understanding_Medical_Education_Evidence_Theory_and_Practice"]}