{"id":"345635464_Melanoma_Lesion_Detection_and_Segmentation_Using_YOLOv4-DarkNet_and_Active_Contour","abstract":"Melanoma is the skin cancer caused by the ultraviolet radiation from the Sun and has only 15-20% of survival rate. Late diagnosis of melanoma leads to the severe malignancy of disease, and metastasis expands to the other body organs i.e. liver, lungs and brain. The dermatologists analyze the pigmented lesions over the skin to discriminate melanoma from other skin diseases. However, the imprecise analysis results in the form of a series of biopsies and it complicates the treatment. Meanwhile, the process of melanoma detection can be expedited through computer vision methods by analyzing the dermoscopic images automatically. However, the visual similarity between the normal and infected skin regions, and artifacts like gel bubbles, hair and clinical marks indicate low accuracy rates for these approaches. To overcome these challenges, in this article, a melanoma detection and segmentation approach is presented that brings significant improvement in terms of accuracy against state-of-the-art approaches. As a first step, the artifacts like hairs, gel bubbles, and clinical marks are removed from the dermoscopic images by applying the morphological operations, and image regions are sharpen. Afterwards, for infected region detection, we used YOLOv4 object detector by tuning it for melanoma detection to discriminate the highly correlated infected and non-infected regions. Once the bounding boxes against the melanoma regions are obtained, the infected melanoma regions are extracted by applying the active contour segmentation approach. For performance evaluation, the proposed approach is evaluated on ISIC2018 and ISIC2016 datasets and results are compared against state-of-the-art melanoma detection, and segmentation techniques. Our proposed approach achieves average dice score as 1 and Jaccard coefficient as 0.989. The segmentation result validates the practical bearing of our method in development of clinical decision support system for melanoma diagnosis in contrast to state-of-the-art methods. The YOLOv4 detector is capable to detect multiple skin diseases of same patient and multiple diseases of various patients.","authors":["Saleh Albahli","Nudrat Nida","Aun Irtaza","Muhammad Haroon Yousaf"],"meta":["November 2020IEEE Access","DOI:10.1109/ACCESS.2020.3035345"],"references":["325254980_Skin_Lesion_Segmentation_in_Dermoscopy_Images_via_Deep_Full_Resolution_Convolutional_Networks","323890801_A_Hybrid_Neural_Network_-_World_Cup_Optimization_Algorithm_for_Melanoma_Detection","330495192_Melanoma_lesion_detection_and_segmentation_using_deep_region_based_convolutional_neural_network_and_fuzzy_C-means_clustering","324387691_YOLOv3_An_Incremental_Improvement","321127987_Otsu's_Multi-Thresholding_and_Active_Contour_Snake_Model_to_Segment_Dermoscopy_Images","320968206_Pyramid_Scene_Parsing_Network","320967941_YOLO9000_Better_Faster_Stronger","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317723710_Skin_melanoma_segmentation_using_recurrent_and_convolutional_neural_networks"]}