{"id":"345681488_I_DATE_OF_PUBLICATION_XXXX_00_0000_DATE_OF_CURRENT_VERSION_XXXX_00_0000_Improved_Threshold_Based_and_Trainable_Fully_Automated_Segmentation_for_Breast_Cancer_Boundary_and_Pectoral_Muscle_in_Mammogram_","abstract":"Segmentation of the breast region and pectoral muscle are fundamental subsequent steps in the process of Computer-Aided Diagnosis (CAD) systems. Segmenting the breast region and pectoral muscle are considered a difficult task, particularly in mammogram images because of artefacts, homogeneity among the region of the breast and pectoral muscle, and low contrast along the region of breast boundary, the similarity between the texture of the Region of Interest (ROI), and the unwanted region and irregular ROI. This study aims to propose an improved threshold-based and trainable segmentation model to derive ROI. A hybrid segmentation approach for the boundary of the breast region and pectoral muscle in mammogram images was established based on thresholding and Machine Learning (ML) techniques. For breast boundary estimation, the region of the breast was highlighted by eliminating bands of the wavelet transform. The initial breast boundary was determined through a new thresholding technique. Morphological operations and masking were employed to correct the overestimated boundary by deleting small objects. In the medical imaging field, significant progress to develop effective and accurate ML methods for the segmentation process. In the literature, the imperative role of ML methods in enabling effective and more accurate segmentation method has been highlighted. In this study, an ML technique was built based on the Histogram of Oriented Gradient (HOG) feature with neural network classifiers to determine the region of pectoral muscle and ROI. The proposed segmentation approach was tested by utilizing 322, 200, 100 mammogram images from mammographic image analysis society (mini-MIAS), INbreast, Breast Cancer Digital Repository (BCDR) databases, respectively. The experimental results were compared with manual segmentation based on different texture features. Moreover, evaluation and comparison for the boundary of the breast region and pectoral muscle segmentation have been done separately. The experimental results showed that the boundary of the breast region and the pectoral muscle segmentation approach obtained an accuracy of 98.13% and 98.41% (mini-MIAS), 100%, and 98.01% (INbreast), and 99.8% and 99.5% (BCDR), respectively. On average, the proposed study achieved 99.31% accuracy for the boundary of breast region segmentation and 98.64% accuracy for pectoral muscle segmentation. The overall ROI performance of the proposed method showed improving accuracy after improving the threshold technique for background segmentation and building an ML technique for pectoral muscle segmentation. More so, this paper also included the ground-truth as an evaluation of comprehensive similarity. In the clinic, this analysis may be provided as a valuable support for breast cancer identification. INDEX TERMS Breast cancer, Digital mammogram, Threshold technique, ML technique, Breast segmentation, Pectoral muscle segmentation. This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ This article has been accepted for publication in a future issue of this journal, but has not been fully edited. Content may change prior to final publication.","authors":["Dilovan Zebari","Diyar Zeebaree","Adnan Mohsin Abdulazeez","Habibollah Haron"],"meta":["November 2020IEEE Access 8:1","DOI:10.1109/ACCESS.2020.3036072"],"references":["346406951_Pectoral_Muscle_Segmentation_in_Mammograms","339547111_Enhancing_breast_pectoral_muscle_segmentation_performance_by_using_skip_connections_in_fully_convolutional_network","333911460_Breast_Pectoral_Muscle_Segmentation_in_Mammograms_using_a_Modified_Holistically-nested_Edge_Detection_Network","333500985_Trainable_Model_Based_on_New_Uniform_LBP_Feature_to_Identify_the_Risk_of_the_Breast_Cancer","330691350_Identifying_the_reasons_for_delayed_presentation_of_Pakistani_breast_cancer_patients_at_a_tertiary_care_hospital","329591648_Evaluating_the_Performance_of_Machine_Learning_Techniques_in_the_Classification_of_Wisconsin_Breast_Cancer","329389588_Gene_Selection_and_Classification_of_Microarray_Data_Using_Convolutional_Neural_Network","341926593_Evaluation_of_Deep_Learning_Detection_and_Classification_towards_Computer-aided_Diagnosis_of_Breast_Lesions_in_Digital_X-ray_Mammograms","333501135_Machine_learning_and_Region_Growing_for_Breast_Cancer_Segmentation","329061200_The_Analysis_of_Digital_Mammograms_Using_HOG_and_GLCM_Features"]}