{"id":"345698528_The_State_of_OA_A_large-scale_analysis_of_the_prevalence_and_impact_of_Open_Access_articles","abstract":"Despite growing interest in Open Access (OA) to scholarly literature, there is an unmet need for large-scale, up-to-date, and reproducible studies assessing the prevalence and characteristics of OA. We address this need using oaDOI, an open online service that determines OA status for 67 million articles.\nWe use three samples, each of 100,000 articles, to investigate OA in three populations: 1) all journal articles assigned a Crossref DOI, 2) recent journal articles indexed in Web of Science, and 3) articles viewed by users of Unpaywall, an open-source browser extension that lets users find OA articles using oaDOI.\nWe estimate that at least 28% of the scholarly literature is OA (19M in total) and that this proportion is growing, driven particularly by growth in Gold and Hybrid. The most recent year analyzed (2015) also has the highest percentage of OA (45%). Because of this growth, and the fact that readers disproportionately access newer articles, we find that Unpaywall users encounter OA quite frequently: 47% of articles they view are OA. Notably, the most common mechanism for OA is not Gold, Green, or Hybrid OA, but rather an under-discussed category we dub Bronze: articles made free-to-read on the publisher website, without an explicit Open license.\nWe also examine the citation impact of OA articles, corroborating the so-called open-access citation advantage: accounting for age and discipline, OA articles receive 18% more citations than average, an effect driven primarily by Green and Hybrid OA. We encourage further research using the free oaDOI service, as a way to inform OA policy and practice.","authors":["Heather Piwowar","Jason Priem","Vincent Larivière","Juan Pablo Alperin"],"meta":["August 2017","DOI:10.7287/peerj.preprints.3119v1"],"references":["344989909_Sci-Hub_provides_access_to_nearly_all_scholarly_literature","327346984_The_academic_economic_and_societal_impacts_of_Open_Access_an_evidence-based_review","324100034_Leveraging_the_growth_of_open_access_in_library_collection_decision_making","319366014_Knowledge_sharing_in_global_health_research_-_the_impact_uptake_and_cost_of_open_access_to_scholarly_literature","318773689_The_accessimpact_problem_and_the_green_and_gold_roads_to_open_access_An_update","316346360_Looking_into_Pandora's_Box_The_Content_of_Sci-Hub_and_its_Usage","308092486_Hybrid_open_access-A_longitudinal_study","313606361_Copyright_compliance_and_infringement_in_ResearchGate_full-text_journal_articles","313454017_Gold_green_and_black_open_access","312052166_Availability_of_digital_object_identifiers_in_publications_archived_by_PubMed"]}