{"id":"345629230_Black_Box_to_Conversational_Machine_Learning_Ondansetron_Reduces_Risk_of_Hospital-Acquired_Venous_Thromboembolism","abstract":"Machine learning, combined with a proliferation of electronic healthcare records (EHR), has the potential to transform medicine by identifying previously unknown interventions that reduce the risk of adverse outcomes. To realize this potential, machine learning must leave the conceptual 'black box' in complex domains to overcome several pitfalls, like the presence of confounding variables. These variables predict outcomes but are not causal, often yielding uninformative models. In this work, we envision a 'conversational' approach to design machine learning models, which couple modeling decisions to domain expertise. We demonstrate this approach via a retrospective cohort study to identify factors which affect the risk of hospital-acquired venous thromboembolism (HA-VTE). Using logistic regression for modeling, we have identified drugs that reduce the risk of HA-VTE. Our analysis reveals that ondansetron, an anti-nausea and anti-emetic medication, commonly used in treating side-effects of chemotherapy and post-general anesthesia period, substantially reduces the risk of HA-VTE when compared to aspirin (11% vs. 15% relative risk reduction or RRR, respectively). The low cost and low morbidity of ondansetron may justify further inquiry into its use as a preventative agent for HA-VTE. This case study highlights the importance of engaging domain expertise while applying machine learning in complex domains.","authors":["Argho Datta","Matthew Matlock","Na Le Dang","Thiago Moulin; Keith F. Woeltje; Elizabeth L. Yanik"],"meta":["October 2020IEEE Journal of Biomedical and Health Informatics PP(99)","DOI:10.1109/JBHI.2020.3033405"],"references":["336161960_Deep_learning_long-range_information_in_undirected_graphs_with_wave_networks","336032611_Multi-Objective_Optimization_for_Personalized_Prediction_of_Venous_Thromboembolism_in_Ovarian_Cancer_Patients"]}