{"id":"345607745_Comparison_of_manual_and_machine_learning_image_processing_approaches_to_determine_fungiform_papillae_on_the_tongue","abstract":"Human taste perception is associated with the papillae on the tongue as they contain a large proportion of chemoreceptors for basic tastes and other chemosensation. Especially the density of fungiform papillae (FP) is considered as an index for responsiveness to oral chemosensory stimuli. The standard procedure for FP counting involves visual identification and manual counting of specific parts of the tongue by trained operators. This is a tedious task and automated image analysis methods\nare desirable. In this paper a machine learning image processing method based on a convolutional neural network is presented. This automated method was compared with three standard manual FP counting procedures using tongue pictures from 132 subjects. Automated FP counts, within the selected areas and the whole tongue, significantly correlated with the manual counting methods (all ρs ≥ 0.76). When comparing the images for gender and PROP status, the density of FP predicted from automated analysis was in good agreement with data from the manual counting methods, especially in the case of gender. Moreover, the present results reinforce the idea that caution should be applied in\nconsidering the relationship between FP density and PROP responsiveness since this relationship can be an oversimplification of the complexity of phenomena arising at the central and peripherical levels. Indeed, no significant correlations were found between FP and PROP bitterness ratings using the automated method for selected areas or the whole tongue. Besides providing estimates of the number of FP, the machine learning approach used a tongue coordinate system that normalizes the size and shape of an individual tongue and generated a heat map of the FP position and normalized area they cover. The present study demonstrated that the machine learning approach could provide similar\nestimates of FP on the tongue as compared to manual counting methods and provide estimates of more difficult-to-measure parameters, such as the papillae’s areas and shape.","authors":["Camilla Cattaneo","Jing Liu","Chenhao Wang","Ella Pagliarini"],"meta":["October 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-75678-2","Project: Texture preferences of drinking yogurt among Asian and Caucasian consumers"],"references":["331535750_New_insights_into_the_relationship_between_taste_perception_and_oral_microbiota_composition","327603425_Individual_Variation_in_PROP_Status_Fungiform_Papillae_Density_and_Responsiveness_to_Taste_Stimuli_in_a_Large_Population_Sample","323486921_Associations_between_human_fungiform_papillae_and_responsiveness_to_oral_stimuli_Effects_of_individual_variability_population_characteristics_and_methods_for_papillae_quantification","321663335_An_automated_method_to_detect_and_quantify_fungiform_papillae_in_the_human_tongue_Validation_and_relationship_to_phenotypical_differences_in_taste_perception","321283063_A_review_of_semantic_segmentation_using_deep_neural_networks","350892937_State-of-the-art_review_on_deep_learning_in_medical_imaging","336034366_Cross-cultural_differences_in_lingual_tactile_acuity_taste_sensitivity_phenotypical_markers_and_preferred_oral_processing_behaviors","333882947_Individual_variation_in_fungiform_papillae_density_with_different_sizes_and_relevant_associations_with_responsiveness_to_oral_stimuli","331474603_The_Present_and_Future_of_Deep_Learning_in_Radiology","323248574_Associations_between_food_neophobia_and_responsiveness_to_warning_chemosensory_sensations_in_food_products_in_a_large_population_sample","310459636_Contributory_Role_of_Sex_Differences_in_the_Variations_of_Gustatory_Function","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317335291_Comparing_Manual_Counting_to_Automated_Image_Analysis_for_the_Assessment_of_Fungiform_Papillae_Density_on_Human_Tongue","305112783_Automatic_counting_of_fungiform_papillae_by_shape_using_cross-correlation"]}