{"id":"345601747_Protecting_the_application_layer_in_the_public_domain_with_machine_learning_methods","abstract":"Currently, we can observe that vulnerable web pages are a common element in many high-profile cyberattacks. On the other hand, web applications (as well as web services) have become an inherent element of many supply chains. In order to protect the web services against some of the cyberattacks, one can adapt web application firewalls (WAF) solutions. However, quite often a challenge for typical WAF software is the fact that HTTP can be used as transport by other protocols or as a mix of other various encoding techniques. Therefore, in this paper, we propose a flexible schema for automated application layer request structure identification. Our experiments show that this technique allows us to further improve the effectiveness of known detection methods used in this research domain. In this paper, we show the possible practical application of the proposed cybersecurity solution in the public domain, namely public administration web-based systems and healthcare sectors. From the scientific point of view, we presented the results of various classifiers and pattern extraction techniques. We have also addressed the possible deployment of the proposed solution in Big Data-enabled environments.","authors":["Rafał Kozik","Michał Choraś"],"meta":["March 2019Logic Journal of IGPL 27(2):149-159","DOI:10.1093/jigpal/jzy029"],"references":["277718046_Advanced_services_for_critical_infrastructures_protection","262290024_N-Gram_against_the_Machine_On_the_Feasibility_of_the_N-Gram_Network_Analysis_for_Binary_Protocols","222425405_Learning_DFA_representations_of_HTTP_for_protecting_web_applications","221427475_Anagram_A_Content_Anomaly_Detector_Resistant_to_Mimicry_Attack","221247853_POSEIDON_A_2-tier_anomaly-based_network_intrusion_detection_system","313074409_The_HTTP_Content_Segmentation_Method_Combined_with_AdaBoost_Classifier_for_Web-Layer_Anomaly_Detection_System","283380791_Network_Event_Correlation_and_Semantic_Reasoning_for_Federated_Networks_Protection_System","278402806_Network_Traffic_Prediction_and_Anomaly_Detection_Based_on_ARFIMA_Model","226332280_Network_Events_Correlation_for_Federated_Networks_Protection_System","222535607_McPAD_A_Multiple_Classifier_System_for_Accurate_Payload-based_Anomaly_Detection","2911830_Anomaly_Detection_of_Web-based_Attacks"]}