{"id":"345784952_A_survey_of_accepted_authors_in_computer_systems_conferences","abstract":"Computer Science researchers rely on peer-reviewed conferences to publish their work and to receive feedback. The impact of these peer-reviewed papers on researchers’ careers can hardly be overstated. Yet conference organizers can make inconsistent choices for their review process, even in the same subfield. These choices are rarely reviewed critically, and when they are, the emphasis centers on the effects on the technical program, not the authors. In particular, the effects of conference policies on author experience and diversity are still not well understood. To help address this knowledge gap, this paper presents a cross-sectional study of 56 conferences from one large subfield of computer science, namely computer systems. We introduce a large author survey ( n = 918), representing 809 unique papers. The goal of this paper is to expose this data and present an initial analysis of its findings. We primarily focus on quantitative comparisons between different survey questions and comparisons to external information we collected on author demographics, conference policies, and paper statistics. Another focal point of this study is author diversity. We found poor balance in the gender and geographical distributions of authors, but a more balanced spread across sector, experience, and English proficiency. For the most part, women and nonnative English speakers exhibit no differences in their experience of the peer-review process, suggesting no specific evidence of bias against these accepted authors. We also found strong support for author rebuttal to reviewers’ comments, especially among students and less experienced researchers.","authors":["Eitan Frachtenberg","Noah Koster"],"meta":["September 2020PeerJ Computer Science 6(1):e299","DOI:10.7717/peerj-cs.299"],"references":["339344596_Historical_comparison_of_gender_inequality_in_scientific_careers_across_countries_and_disciplines","336010566_Signaling_the_trustworthiness_of_science","321072817_Reviewer_bias_in_single-_versus_double-blind_peer_review","319415927_Design_and_Analysis_of_the_NIPS_2016_Review_Process","349697299_Gender_trends_in_computer_science_authorship","341122769_A_bibliometric_approach_for_detecting_the_gender_gap_in_computer_science","301839762_Inferring_Gender_from_Names_on_the_Web_A_Comparative_Evaluation_of_Gender_Detection_Methods","280329512_Arbitrariness_of_peer_review_A_Bayesian_analysis_of_the_NIPS_experiment","265909098_Learning_the_practice_of_scholarly_publication_in_English_-_A_Romanian_perspective","264677414_Attitudes_of_Journal_Editors_to_Nonnative_Speaker_Contributions"]}