{"id":"345741835_Detection_and_characterization_of_low_and_high_genome_coverage_regions_using_an_efficient_running_median_and_a_double_threshold_approach","abstract":"Motivation\nNext Generation Sequencing (NGS) provides researchers with powerful tools to investigate both prokaryotic and eukaryotic genetics. An accurate assessment of reads mapped to a specific genome consists of inspecting the genome coverage as number of reads mapped to a specific genome location. Most current methods use the average of the genome coverage ( sequencing depth ) to summarize the overall coverage. This metric quickly assess the sequencing quality but ignores valuable biological information like the presence of repetitive regions or deleted genes. The detection of such information may be challenging due to a wide spectrum of heterogeneous coverage regions, a mixture of underlying models or the presence of a non-constant trend along the genome. Using robust statistics to systematically identify genomic regions with unusual coverage is needed to characterize these regions more precisely.\n\nResults\nWe implemented an efficient running median algorithm to estimate the genome coverage trend. The distribution of the normalized genome coverage is then estimated using a Gaussian mixture model. A z -score statistics is then assigned to each base position and used to separate the central distribution from the regions of interest (ROI) (i.e., under and over-covered regions). Finally, a double threshold mechanism is used to cluster the genomic ROIs. HTML reports provide a summary with interactive visual representations of the genomic ROIs.\n\nAvailability\nAn implementation of the genome coverage characterization is available within the Sequana project. The standalone application is called sequana_coverage . The source code is available on GitHub ( http://github.com/sequana/sequana ), and documentation on ReadTheDocs ( http://sequana.readtheodcs.org ). An example of HTML report is provided on http://sequana.github.io .\n\nContact\ndimitri.desvillechabrol@pasteur.fr , thomas.cokelaer@pasteur.fr","authors":["Dimitri Desvillechabrol","Christiane Bouchier","Sean Kennedy","Thomas Cokelaer"],"meta":["December 2016","DOI:10.1101/092478"],"references":["305076472_A_Landscape_of_Pharmacogenomic_Interactions_in_Cancer","278331932_De_novo_meta-assembly_of_ultra-deep_sequencing_data","269466400_Genome_sequencing_defines_phylogeny_and_spread_of_methicillin-resistant_Staphylococcus_aureus_in_a_high_transmission_setting","259770222_Sequencing_depth_and_coverage_Key_considerations_in_genomic_analyses","257071063_BioServices_a_Common_Python_Package_to_Access_Biological_Web_Services_Programmatically","325200984_Snakemake-a_scalable_bioinformatics_workflow_engine","303296106_Coming_of_age_Ten_years_of_next-generation_sequencing_technologies","301299613_Evaluation_of_the_evenness_score_in_next-generation_sequencing","285468883_Real-Time_DNA_Sequencing_from_Single_Polymerase_Molecules","236186224_Analyzing_Genome_Coverage_Profiles_with_Applications_to_Quality_Control_in_Metagenomics"]}