{"id":"345747303_Educational_games_for_miss-concentration_students_ADHD_students","abstract":"Increasing a kid’s concentration is a major problem for both teachers and parents, but the presence of educational games solves almost 70% of this problem and the other percentage relies on teacher and parent roles to increase the kid’s concentration using different methods and this is the main role of our game here. Our game’s name is Cube Invasion and we derived its name out from its context because it is a 3D game with cubes which surround the kid’s player and he try to hit most of the boxes to get the highest score in a less time and tries not to lose to the time or not get the least amount of score to pass the level. We can achieve our goal of the game (increasing the kid’s concentration level) by making the game’s surroundings a lot harder in the intercourse of the game; so we have here four kinds of surroundings for the kid to interact with—green box: this is the main box for the kid to hit; yellow box: this is a box with a negative attitude that the kid should be aware of; white box: this is a box for increasing time if he runs out of time; red box: this is a rare box and it appears and disappears in a second and requires a high concentration level to hit it. We used Unity game engine for gaming control and programming because it is the most famous game engine right now and it provides a lot of helpful things for the kid to interact with. We use the after effects for the game design and development of both introduction video, game components and animation of the game. Our game storyline talks about a peaceful planet called Pill-earth where everyone loves each other. We have our hero and his lover (girlfriend) sitting in the park and all of a sudden an invasion of cubes comes to the planet to occupy it and spread hatred among the planet’s inhabitants. They abduct the hero’s girlfriend and he gets angry and tries to restore her and free the planet from this disastrous occupation. At last, he succeeds in killing the leader and restoring his lover and freeing the planet. This story makes the child interact more with the game. Keywords: ADHD treatment, educational games, FPS games.","authors":["Mohamed Elsayed","Ramiz Salama"],"meta":["June 2020International Journal of Innovative Research in Education 7(1)","DOI:10.18844/ijire.v7i1.4762"],"references":[]}