{"id":"345780843_Contemporary_and_Systematic_Review_of_Smartphone_Apps_for_Tinnitus_Management_and_Treatment","abstract":"Tinnitus is a complex and heterogeneous psycho-physiological disorder responsible for causing a phantom ringing or buzzing sound albeit the absence of an external sound source. It has a direct influence on affecting the quality of life of its sufferers. Despite being around for a while, there hasn’t been a cure for tinnitus, and the usual course of action for its treatment involves use of tinnitus retaining and sound therapy, or Cognitive Behavioral Therapy (CBT). One positive aspect about these therapies is that they can be administered face-to-face as well as delivered via internet or smartphone. Smartphones are especially helpful as they are highly personalized devices, and offer a well-established ecosystem of apps, accessible via respective marketplaces of differing mobile platforms. Note that current therapeutic treatments such as CBT have shown to be effective in suppressing the tinnitus symptoms when administered face-to-face, their effectiveness when being delivered using smartphones is not known so far. A quick search on the prominent market places of popular mobile platforms (Android and iOS) yielded roughly 250 smartphone apps offering tinnitus-related therapies and tinnitus management. As this number is expected to steadily increase due to high interest in smartphone app development, a contemporary review of such apps is crucial. In this paper, we aim to review scientific studies validating the smartphone apps, particularly to test their effectiveness in tinnitus management and treatment. We use the PRISMA guidelines for systematic identification of studies on major scientific literature sources and delineate the outcomes of identified studies.","authors":["Muntazir Mehdi","Albi Dode","Rüdiger Pryss","Winfried Schlee"],"meta":["September 2020","DOI:10.20944/preprints202009.0620.v1"],"references":["341542571_Design_and_testing_of_a_mobile_health_application_rating_tool","303905096_Development_and_Validation_of_the_User_Version_of_the_Mobile_Application_Rating_Scale_uMARS","319548710_Progressive_Tinnitus_Management_Level_3_Skills_Education_A_5-Year_Clinical_Retrospective"]}