{"id":"345759309_Digital_Revolution_for_Hajj_Crowd_Management_A_Technology_Survey","abstract":"Hajj, the annual pilgrimage to Makkah, is one of the most massive gathering events in the world. It is a mandatory religious activity, once in a lifetime for every sane well-off Muslim. Every year around 3 million Muslims across the globe visit Makkah to perform this spatiotemporally constrained set of religious activities, like circumambulation around the Kaaba and the encampment at Mina, Arafat, and Muzdalifah. The key ritual at Rami-al-Jamarat (the stoning-of-the-pillars) is a place seen particularly crowded. The diversified nature of the crowd in terms of race, age, language, and culture brings several administrative challenges for local organizers whose responsibility is to ensure the smooth organization of the event. The advent of digital technologies has helped researchers to explore and propose modern methods for better crowd management and devise control strategies to organize such a mass gathering. In this paper, we present a taxonomy that summarizes our survey on the utilization of technology areas for providing needful services and improving crowd management during the Hajj season. These technologies are Wireless, Computer Vision, Spatial Computing, Data Analytics, Mobile Applications, Immersive Technologies, and Crowd Modelling and Simulation. We have also included the current research work and its implementation plan for Hajj 2020. One dimension of the taxonomy is to understand different possible technologies for Crowd management. Another dimension is to understand the impact of technologies to handle such a massive crowd. The discussion section covers a comparison of technologies with multiple aspects that may help researchers to contribute more towards dealing with future mass gathering events.","authors":["Emad Felemban","Faizan Ur Rehman","Sardar Asad Ali Biabani","Akhlaq Ahmad"],"meta":["November 2020IEEE Access 8","DOI:10.1109/ACCESS.2020.3037396","Projects: Perform Hajj & UmrahNetwork Science. Modelling the Hajj Crowd as a networkSafeCrowd"],"references":["341152820_A_Model_for_Tracking_People_and_Property_in_Crowds","340687869_IoT_Based_Crowd_Congestion_and_Stampede_Avoidance_in_Hajj_Using_Wemos_D1_with_Machine_Learning_Approach","338874911_Internet_of_Things_IoT_For_Next-Generation_Smart_Systems_A_Review_of_Current_Challenges_Future_Trends_and_Prospects_for_Emerging_5G-IoT_Scenarios","342313862_A_Survey_on_Hajj_Mobile_Applications","341940261_I_am_not_satisfied_with_my_body_so_I_like_augmented_reality_AR_Consumer_responses_to_AR-based_product_presentations","339977661_A_Preference-Based_Interactive_Tool_for_Safe_Rescheduling_of_Groups_for_Hajj","339478302_Towards_Building_Evacuation_Planning_Platform_using_Multimodal_Transportation_for_a_Large_Crowd","339475350_An_Optimized_Scheduling_Process_for_a_Large_Crowd_to_Perform_Spatio-temporal_Movements_Safely_during_Pilgrimage","337230498_A_Smart_Arabic_Signboard_Image_Reader_for_Mobile_Devices","336184251_Congestion_detection_in_pedestrian_crowds_using_oscillation_in_motion_trajectories"]}