{"id":"345762269_Towards_Using_Graph_Analytics_for_Tracking_Covid-19","abstract":"Graph analytics are now considered the state-of-the-art in many applications of communities detection. The combination between the graph's definition in mathematics and the graphs in computer science as an abstract data structure is the key behind the success of graph-based approaches in machine learning. Based on graphs, several approaches have been developed such as shortest path first (SPF) algorithms, subgraphs extraction, social media analytics, transportation networks, bioinformatic algorithms, etc. While SPF algorithms are widely used in optimization problems, Spectral clustering (SC) algorithms have overcome the limits of the most state-of-art approaches in communities detection. The purpose of this paper is to introduce a graph-based approach of communities detection in the novel coronavirus Covid-19 countries' datasets. The motivation behind this work is to overcome the limitations of multiclass classification, as SC is an unsupervised clustering algorithm, there is no need to predefine the output clusters as a preprocessing step. Our proposed approach is based on a previous contribution on an automatic estimation of the k number of the output clusters. Based on dynamic statistical data for more than 200 countries, each cluster is supposed to group countries having similar behaviors of Covid-19 propagation.","authors":["Zakariyaa Ait El Mouden","Rachida Moulay Taj","Abdeslam Jakimi","Moha Hajar"],"meta":["November 2020Procedia Computer Science 177(C):204-211","DOI:10.1016/j.procs.2020.10.029","Project: Knowledge extraction from data modelled by graphs"],"references":["346521704_COVID-Net_a_tailored_deep_convolutional_neural_network_design_for_detection_of_COVID-19_cases_from_chest_X-ray_images","341355853_Using_X-ray_Images_and_Deep_Learning_for_Automated_Detection_of_Coronavirus_Disease","340655576_Clinical_Characteristics_of_COVID-19_Patients_With_Digestive_Symptoms_in_Hubei_China_A_Descriptive_Cross-Sectional_Multicenter_Study","340072277_COVID-19_Challenges_to_GIS_with_Big_Data","339889682_Prevalence_of_comorbidities_and_its_effects_in_patients_infected_with_SARS-CoV-2_a_systematic_review_and_meta-analysis","339757623_The_effect_of_travel_restrictions_on_the_spread_of_the_2019_novel_coronavirus_COVID-19_outbreak","340852024_GIS-based_spatial_modeling_of_COVID-19_incidence_rate_in_the_continental_United_States","340007463_Graph_Laplacian_for_Spectral_Clustering_and_Seeded_Image_Segmentation","339516973_World_Health_Organization_declares_Global_Emergency_A_review_of_the_2019_Novel_Coronavirus_COVID-19","339515532_The_epidemiology_and_pathogenesis_of_coronavirus_disease_COVID-19_outbreak"]}