{"id":"345727900_Is_Church's_Thesis_Still_Relevant","abstract":"The article analyses the role of Church’s Thesis (hereinafter CT) in the context of the development of hypercomputation research. The text begins by presenting various views on the essence of computer science and the limitations of its methods. Then CT and its importance in determining the limits of methods used by computer science is presented. Basing on the above explanations, the work goes on to characterize various proposals of hypercomputation showing their relative power in relation to the arithmetic hierarchy.\n\nThe general theme of the article is the analysis of mutual relations between the content of CT and the theories of hypercomputation. In the main part of the paper the arguments for abolition of CT caused by the introduction of hypercomputable methods in computer science are presented and critique of these views is presented. The role of the efficiency condition contained in the formulation of CT is stressed. The discussion ends with a summary defending the current status of Church’s thesis within the framework of philosophy and computer science as an important point of reference for determining what the notion of effective calculability really is. The considerations included in this article seem to be quite up-to-date relative to the current state of affairs in computer science","authors":["Adam Jerzy Olszewski","Jerzy Mycka"],"meta":["November 2020Studies in Logic 63(1):31-51","DOI:10.2478/slgr-2020-0026"],"references":["243784599_The_Myth_of_Hypercomputation","303420530_A_computable_universe_Understanding_and_exploring_nature_as_computation","272961552_Super-Recursive_Algorithms","267441102_What_is_Computation_Actor_Model_versus_Turing's_Model","239666225_Classical_Recursion_Theory_II","227007023_Physical_Hypercomputation_and_the_Church-Turing_Thesis","226840320_Physical_Computation_How_General_are_Gandy's_Principles_for_Mechanisms","222436526_The_case_for_hypercomputation","222425587_Super-Tasks_Accelerating_Turing_Machines_and_Uncomputability","222300005_The_many_forms_of_hypercomputation","220564713_Why_there_is_no_such_discipline_as_hypercomputation","2601940_Nondeterminism_Fairness_and_a_Fundamental_Analogy","220915910_The_Omega_Number_Irreducible_Complexity_in_Pure_Math","220154144_Natural_computation_and_non-Turing_models_of_computation","200110976_Irreducible_Complexity_in_Pure_Mathematics"]}