{"id":"345729199_Predicting_Dropout_Student_An_Application_of_Data_Mining_Methods_in_an_Online_Education_Program","abstract":"This study examined the prediction of dropouts through data mining approaches in an online program. The subject of the study was selected from a total of 189 students who registered to the online Information Technologies Certificate Program in 2007-2009. The data was collected through online questionnaires (Demographic Survey, Online Technologies Self-Efficacy Scale, Readiness for Online Learning Questionnaire, Locus of Control Scale, and Prior Knowledge Questionnaire). The collected data included 10 variables, which were gender, age, educational level, previous online experience, occupation, self efficacy, readiness, prior knowledge, locus of control, and the dropout status as the class label (dropout/not). In order to classify dropout students, four data mining approaches were applied based on k-Nearest Neighbour (k-NN), Decision Tree (DT), Naive Bayes (NB) and Neural Network (NN). These methods were trained and tested using 10-fold cross validation. The detection sensitivities of 3-NN, DT, NN and NB classifiers were 87%, 79.7%, 76.8% and 73.9% respectively. Also, using Genetic Algorithm (GA) based feature selection method, online technologies self-efficacy, online learning readiness, and previous online experience were found as the most important factors in predicting the dropouts.","authors":["Erman Yukselturk","Serhat Ozekes","Yalın Kılıç Türel"],"meta":["July 2014European Journal of Open, Distance and E-Learning 17(1):118-133","DOI:10.2478/eurodl-2014-0008"],"references":["331900496_FACTORS_THAT_INFLUENCE_STUDENTS'_DECISION_TO_DROPOUT_OF_ONLINE_COURSES","316628053_Educational_data_mining_and_learning_analytics","262495504_Analyzing_E-Learning_Systems_Using_Educational_Data_Mining_Techniques","313658140_Generalized_Expectancies_for_Internal_versus_External_Control_of_Reinforcement","299256534_Learning_portfolio_analysis_and_mining_for_SCORM_compliant_environment","289768729_Examining_the_factors_affecting_student_dropout_in_an_online_certificate_program","285852296_Data_mining_for_education","265544297_Supervised_Machine_Learning_A_Review_of_Classification_Techniques","262163175_From_data_mining_to_knowledge_discovery_an_overview","255567359_Do_Entry_Characteristics_of_Online_Learners_Affect_Their_Satisfaction"]}