{"id":"345810265_Capturing_human_categorization_of_natural_images_by_combining_deep_networks_and_cognitive_models","abstract":"Human categorization is one of the most important and successful targets of cognitive modeling, with decades of model development and assessment using simple, low-dimensional artificial stimuli. However, it remains unclear how these findings relate to categorization in more natural settings, involving complex, high-dimensional stimuli. Here, we take a step towards addressing this question by modeling human categorization over a large behavioral dataset, comprising more than 500,000 judgments over 10,000 natural images from ten object categories. We apply a range of machine learning methods to generate candidate representations for these images, and show that combining rich image representations with flexible cognitive models captures human decisions best. We also find that in the high-dimensional representational spaces these methods generate, simple prototype models can perform comparably to the more complex memory-based exemplar models dominant in laboratory settings. Theories of human categorization have traditionally been evaluated in the context of simple, low-dimensional stimuli. In this work, the authors use a large dataset of human behavior over 10,000 natural images to re-evaluate these theories, revealing interesting differences from previous results.","authors":["Ruairidh McLennan Battleday","Joshua C. Peterson","Thomas L. Griffiths"],"meta":["October 2020Nature Communications 11(1):5418","DOI:10.1038/s41467-020-18946-z"],"references":["335243909_Human_Uncertainty_Makes_Classification_More_Robust","327419856_Evaluating_and_Improving_the_Correspondence_Between_Deep_Neural_Networks_and_Human_Representations","319770123_Densely_Connected_Convolutional_Networks","306885833_Densely_Connected_Convolutional_Networks","305648390_Sketch-a-Net_A_Deep_Neural_Network_that_Beats_Humans","303755744_Adversarially_Learned_Inference","351624256_Configurational_Information_in_Face_Perception","310672230_On_Learning_Natural-Science_Categories_That_Violate_the_Family-Resemblance_Principle","306218037_Learning_multiple_layers_of_features_from_tiny_images","284399661_Information_Theory_and_an_Extension_of_the_Maximum_Likelihood_Principle"]}