{"id":"345897175_Quantifying_machine_influence_over_human_forecasters","abstract":"Crowdsourcing human forecasts and machine learning models each show promise in predicting future geopolitical outcomes. Crowdsourcing increases accuracy by pooling knowledge, which mitigates individual errors. On the other hand, advances in machine learning have led to machine models that increase accuracy due to their ability to parameterize and adapt to changing environments. To capitalize on the unique advantages of each method, recent efforts have shown improvements by “hybridizing” forecasts—pairing human forecasters with machine models. This study analyzes the effectiveness of such a hybrid system. In a perfect world, independent reasoning by the forecasters combined with the analytic capabilities of the machine models should complement each other to arrive at an ultimately more accurate forecast. However, well-documented biases describe how humans often mistrust and under-utilize such models in their forecasts. In this work, we present a model that can be used to estimate the trust that humans assign to a machine. We use forecasts made in the absence of machine models as prior beliefs to quantify the weights placed on the models. Our model can be used to uncover other aspects of forecasters’ decision-making processes. We find that forecasters trust the model rarely, in a pattern that suggests they treat machine models similarly to expert advisors, but only the best forecasters trust the models when they can be expected to perform well. We also find that forecasters tend to choose models that conform to their prior beliefs as opposed to anchoring on the model forecast. Our results suggest machine models can improve the judgment of a human pool but highlight the importance of accounting for trust and cognitive biases involved in the human judgment process.","authors":["Andres Abeliuk","Daniel M Benjamin","Fred Morstatter","Aram Galstyan"],"meta":["September 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-72690-4"],"references":["336246694_Predictinghypothesizing_the_findings_of_the_M4_Competition","334844579_SAGE_A_Hybrid_Geopolitical_Event_Forecasting_System","329245022_Why_Does_Advice_Discounting_Occur_The_Combined_Roles_of_Confidence_and_Trust","325901666_The_M4_Competition_Results_findings_conclusion_and_way_forward","324597789_Overcoming_Algorithm_Aversion_People_Will_Use_Imperfect_Algorithms_If_They_Can_Even_Slightly_Modify_Them","345720287_Expert_Political_Judgment_How_Good_Is_It_How_Can_We_Know","331106294_Making_sense_of_recommendations","326202532_Dynamically_Forming_a_Group_of_Human_Forecasters_and_Machine_Forecaster_for_Forecasting_Economic_Indicators","324258821_Human_Decisions_and_Machine_Predictions","323974391_Theory_of_Machine_When_Do_People_Rely_on_Algorithms"]}