{"id":"345807826_COVID-19_classification_by_CCSHNet_with_deep_fusion_using_transfer_learning_and_discriminant_correlation_analysis","abstract":"Aim\n: COVID-19 is a disease caused by a new strain of coronavirus. Up to 18th October 2020, worldwide there have been 39.6 million confirmed cases resulting in more than 1.1 million deaths. To improve diagnosis, we aimed to design and develop a novel advanced AI system for COVID-19 classification based on chest CT (CCT) images.\n\nMethods\n: Our dataset from local hospitals consisted of 284 COVID-19 images, 281 community-acquired pneumonia images, 293 secondary pulmonary tuberculosis images; and 306 healthy control images. We first used pretrained models (PTMs) to learn features, and proposed a novel (L, 2) transfer feature learning algorithm to extract features, with a hyperparameter of number of layers to be removed (NLR, symbolized as L). Second, we proposed a selection algorithm of pretrained network for fusion to determine the best two models characterized by PTM and NLR. Third, deep CCT fusion by discriminant correlation analysis was proposed to help fuse the two features from the two models. Micro-averaged (MA) F1 score was used as the measuring indicator. The final determined model was named CCSHNet.\n\nResults\n: On the test set, CCSHNet achieved sensitivities of four classes of 95.61%, 96.25%, 98.30%, and 97.86%, respectively. The precision values of four classes were 97.32%, 96.42%, 96.99%, and 97.38%, respectively. The F1 scores of four classes were 96.46%, 96.33%, 97.64%, and 97.62%, respectively. The MA F1 score was 97.04%. In addition, CCSHNet outperformed 12 state-of-the-art COVID-19 detection methods.\n\nConclusions\n: CCSHNet is effective in detecting COVID-19 and other lung infectious diseases using first-line clinical imaging and can therefore assist radiologists in making accurate diagnoses based on CCTs.","authors":["Shuihua Wang","Deepak Ranjan Nayak","David S Guttery","Xin Zhang"],"meta":["November 2021Information Fusion 68:131-148","DOI:10.1016/j.inffus.2020.11.005"],"references":["348937862_INTELLIGENT_MAPPING_OF_IRRIGATED_AREAS_FROM_LANDSAT_8_IMAGES_USING_TRANSFER_LEARNING","347762837_COVIDGR_Dataset_and_COVID-SDNet_Methodology_for_Predicting_COVID-19_Based_on_Chest_X-Ray_Images","344470582_Covid-19_Classification_by_FGCNet_with_Deep_Feature_Fusion_from_Graph_Convolutional_Network_and_Convolutional_Neural_Network","344432769_A_seven-layer_convolutional_neural_network_for_chest_CT_based_COVID-19_diagnosis_using_stochastic_pooling","344432371_Diagnosis_of_COVID-19_by_Wavelet_Renyi_Entropy_and_Three-Segment_Biogeography-Based_Optimization","343859456_Within_the_Lack_of_Chest_COVID-19_X-ray_Dataset_A_Novel_Detection_Model_Based_on_GAN_and_Deep_Transfer_Learning","343803697_Fractured_aluminum_nasopharyngeal_swab_during_drive-through_testing_for_COVID-19_radiographic_detection_of_a_retained_foreign_body","343289385_Predicting_COVID-19_Pneumonia_Severity_on_Chest_X-ray_With_Deep_Learning","343119558_Consolidation_in_a_crisis_Patterns_of_international_collaboration_in_early_COVID-19_research","343596137_Good_Robot_Efficient_Reinforcement_Learning_for_Multi-Step_Visual_Tasks_with_Sim_to_Real_Transfer"]}