{"id":"345853442_1D_Convolutional_Neural_Networks_and_Applications_A_Survey","abstract":"During the last decade, Convolutional Neural Networks (CNNs) have become the de facto standard for various Computer Vision and Machine Learning operations. CNNs are feed-forward Artificial Neural Networks (ANNs) with alternating convolutional and subsampling layers. Deep 2D CNNs with many hidden layers and millions of parameters have the ability to learn complex objects and patterns providing that they can be trained on a massive size visual database with ground-truth labels. With a proper training, this unique ability makes them the primary tool for various engineering applications for 2D signals such as images and video frames. Yet, this may not be a viable option in numerous applications over 1D signals especially when the training data is scarce or application specific. To address this issue, 1D CNNs have recently been proposed and immediately achieved the state-of-the-art performance levels in several applications such as personalized biomedical data classification and early diagnosis, structural health monitoring, anomaly detection and identification in power electronics and electrical motor fault detection. Another major advantage is that a real-time and low-cost hardware implementation is feasible due to the simple and compact configuration of 1D CNNs that perform only 1D convolutions (scalar multiplications and additions). This paper presents a comprehensive review of the general architecture and principals of 1D CNNs along with their major engineering applications, especially focused on the recent progress in this field. Their state-of-the-art performance is highlighted concluding with their unique properties. The benchmark datasets and the principal 1D CNN software used in those applications are also publicly shared in a dedicated website. While there has not been a paper on the review of 1D CNNs and its applications in the literature, this paper fulfills this gap.","authors":["Serkan Kiranyaz","Onur Avci","Osama Abdeljaber","Turker Ince"],"meta":["April 2021Mechanical Systems and Signal Processing 151(2021)","DOI:10.1016/j.ymssp.2020.107398","Projects: Structural Health Monitoring, Structural Damage Detection, Localization and QuantificationArtificial Intelligence, Machine Learning and Deep Learning use in Structural Health Monitoring, Structural Damage Detection and Structural ControlWe are now working on machine learning and pattern recognition for big media data analytics."],"references":["350170628_Self-organized_Operational_Neural_Networks_with_Generative_Neurons","348211079_Exploiting_heterogeneity_in_operational_neural_networks_by_synaptic_plasticity","342656225_A_review_of_vibration-based_damage_detection_in_civil_structures_From_traditional_methods_to_Machine_Learning_and_Deep_Learning_applications","339767429_Operational_neural_networks","333527471_Heterogeneous_Multilayer_Generalized_Operational_Perceptron","330842103_Real-time_structural_damage_detection_by_convolutional_neural_networks","336993340_Progressive_Operational_Perceptrons_with_Memory","333846386_Arrhythmia_Detection_Using_Convolutional_Neural_Models","333691201_PyGOP_A_Python_library_for_Generalized_Operational_Perceptron_algorithms","333321755_Convolutional_Neural_Networks_for_Real-Time_and_Wireless_Damage_Detection"]}