{"id":"345807769_Assessing_the_Agreement_in_the_Bebras_Tasks_Categorisation","abstract":"The participants of the Bebras competitions solve tasks that involve informatics concepts and require computational thinking (CT) skills for general problem solving. The recent popularity of Bebras is closely related to the increasing interest in development of the CT skills among the school students of all ages. Despite the increase in interest, we still lack a consensual, unambiguous definition and/or categorization of CT skills. In this paper, we provide an empirical evidence for the ambiguity of the current categorization of CT skills by assessing the agreement among experts when annotating five tasks of the Slovene Bebras competition in 2019. The empirical data include the annotations of the selected tasks by six experts, where each of them was required to annotate a given task with one to three categories of CT skills required to solve it. The categorization of the CT skills used in the experiment include the five categories of the well-known categorization Dagiené, Sentance and Stupuriene: algorithmic thinking, decomposition, generalization, evaluation and abstract thinking. To narrow down the broad scope of the first category of algorithmic thinking, we introduced a new, sixth category of modelling and simulation. Despite this specialization of the categorization scheme, the measurement of the Fleiss' Kappa statistics on the empirical data, shows a weak agreement among the experts, especially for the general category of abstract thinking. This result confirms the lack of consensus among experts about the delineation between different categories of CT skills. A possible explanation of this results is that reaching a consensus about the definition and categorization of the CT skills within the heterogeneous group of experts involving teachers, programmers and computer scientists, is a challenging task. The result also calls for further effort in reaching such a consensus that would lead to deeper understanding and better teaching of the CT skills.","authors":["Žan Ternik","Ljupco Todorovski","Irena Nančovska Šerbec"],"meta":["November 2020Lecture Notes in Computer Science 12518(ISSEP 2020):30-41","DOI:10.1007/978-3-030-63212-0_3","Project: GLAT - Games for Learning Algorithmic Thinking"],"references":["317013386_Exploring_Bebras_Tasks_Content_and_Performance_A_Multinational_Study","315831218_Developing_a_Two-Dimensional_Categorization_System_for_Educational_Tasks_in_Informatics","305084487_Programming_in_Slovak_Primary_Schools","274309848_Computational_Thinking","345392952_Computational_Thinking","328206032_The_Bebras_Contest_in_Austria_-_Do_Personality_Self-concept_and_General_Interests_Play_an_Influential_Role_11th_International_Conference_on_Informatics_in_Schools_Situation_Evolution_and_Perspectives_","328206031_Differences_Between_9-10_Years_Old_Pupils'_Results_from_Slovak_and_Czech_Bebras_Contest_11th_International_Conference_on_Informatics_in_Schools_Situation_Evolution_and_Perspectives_ISSEP_2018_St_Peter","321148318_Bebras_Task_Analysis_in_Category_Little_Beavers_in_Slovakia","309061291_What_Makes_Situational_Informatics_Tasks_Difficult","290947050_Concepts_in_K-9_Computer_Science_Education"]}