{"id":"345870927_Small_Object_Detection_in_Remote_Sensing_Images_Based_on_Super-Resolution_with_Auxiliary_Generative_Adversarial_Networks","abstract":"This article tackles the problem of detecting small objects in satellite or aerial remote sensing images by relying on super-resolution to increase image spatial resolution, thus the size and details of objects to be detected. We show how to improve the super-resolution framework starting from the learning of a generative adversarial network (GAN) based on residual blocks and then its integration into a cycle model. Furthermore, by adding to the framework an auxiliary network tailored for object detection, we considerably improve the learning and the quality of our final super-resolution architecture, and more importantly increase the object detection performance. Besides the improvement dedicated to the network architecture, we also focus on the training of super-resolution on target objects, leading to an object-focused approach. Furthermore, the proposed strategies do not depend on the choice of a baseline super-resolution framework, hence could be adopted for current and future state-of-the-art models. Our experimental study on small vehicle detection in remote sensing data conducted on both aerial and satellite images (i.e., ISPRS Potsdam and xView datasets) confirms the effectiveness of the improved super-resolution methods to assist with the small object detection tasks.","authors":["Luc Courtrai","Minh-Tan Pham","Sébastien Lefèvre"],"meta":["September 2020Remote Sensing 12(19):3152","DOI:10.3390/rs12193152"],"references":["343459192_YOLO-Fine_One-Stage_Detector_of_Small_Objects_Under_Various_Backgrounds_in_Remote_Sensing_Images","341109918_Small-Object_Detection_in_Remote_Sensing_Images_with_End-to-End_Edge-Enhanced_GAN_and_Object_Detector_Network","340708049_UAV-YOLO_Small_Object_Detection_on_Unmanned_Aerial_Vehicle_Perspective","334904435_An_Improved_Faster_R-CNN_for_Small_Object_Detection","349434576_Vehicle_Detection_and_Counting_from_VHR_Satellite_Images_Efforts_and_Open_Issues","343456623_EfficientDet_Scalable_and_Efficient_Object_Detection","340552563_The_Effects_of_Super-Resolution_on_Object_Detection_Performance_in_Satellite_Imagery","340111033_Recent_advances_in_small_object_detection_based_on_deep_learning_A_review","338509753_Second-Order_Attention_Network_for_Single_Image_Super-Resolution","338285740_Coupled_Adversarial_Training_for_Remote_Sensing_Image_Super-Resolution"]}