{"id":"345822943_Konkurrenz_oder_Kooperation_Zur_Entwicklung_des_Verhaltnisses_von_Medienbildung_und_informatischer_Bildung","abstract":"Mit der gegenwärtigen Diskussion um Mediatisierung und Digitalisierung ist die Forderung verbunden, der Medienbildung und/oder der informatischen Bildung ein größeres Gewicht in der schulischen Bildung zu verschaffen. Dies legt die Frage nahe, wie ein produktives Verhältnis zwischen beiden gestaltet werden sollte und wie beide am besten zu einer zeitgemäßen Bildung beitragen können. Bei entsprechenden Überlegungen spielen unter anderem Entwicklungen eine Rolle, die sich seit frühen Forderungen nach einer Computerbildung im Verhältnis zur damaligen Medienerziehung herausgebildet haben. In dem vorliegenden Beitrag werden solche Entwicklungen skizziert und Schlussfolgerungen für die gegenwärtige Diskussion formuliert. Dabei kommen unterschiedliche Auffassungen zur bildungsbezogenen Auseinandersetzung mit Medien sowie mit Informations- und Kommunikationstechnologien in den Blick. Für das Verhältnis von Medienbildung und informatischer Bildung ergibt sich als zentrale Schlussfolgerung, dass sowohl eine Integration der informatischen Bildung in die Medienbildung als auch eine umgekehrte Lösung unangemessen erscheint, wiewohl beide Bereiche auf Anteile aus dem jeweils anderen Bereich angewiesen sind. Danach werden für eine Medienbildung mit informatischen Anteilen ein geeigneter Medienbegriff und eine tragfähige Bildungsauffassung sowie ein Ansatz zu einem inhaltlich-thematischen Kompetenzrahmen beschrieben. Überlegungen zur schulischen Umsetzung schließen den Beitrag ab.","authors":["Gerhard Tulodziecki"],"meta":["October 2016MedienPädagogik Zeitschrift für Theorie und Praxis der Medienbildung 25(Computer Science Education):7-25","DOI:10.21240/mpaed/25/2016.10.25.X"],"references":["345835215_Vorwort_zu_Medienbildung_und_Medienkompetenz","282860020_DIGCOMP_a_Framework_for_Developing_and_Understanding_Digital_Competence_in_Europe","302398030_Zur_Neubestimmung_des_Bildungsbegriffs","299639040_Warum_sich_Medienpadagogik_mit_BigData_befassen_sollte","270585319_Begrundung_Implementation_und_Wirkung_von_Bildungsstandards_Aktuelle_Diskussionslinien_und_empirische_Befunde_Einfuhrung_in_den_Thementeil_Paralleltitel_Justification_implementation_and_effects_of_edu","269335803_Grenzsicherung_oder_Wandel_durch_Annaherung_Zum_Spannungsverhaltnis_zwischen_Bildungstheorie_und_empirischer_Bildungsforschung","265092564_Technologie_Imagination_und_Lernen_Grundlagen_fur_Bildungsprozesse_mit_Digitalen_Medien","265092428_Strukturale_Medienbildung","265092364_Von_der_Medienkompetenz_zur_Medienbildung","243784087_Neue_Studien_zur_Bildungstheorie_und_Didaktik"]}