{"id":"345809161_Analyzing_inter-reader_variability_affecting_deep_ensemble_learning_for_COVID-19_detection_in_chest_radiographs","abstract":"Data-driven deep learning (DL) methods using convolutional neural networks (CNNs) demonstrate promising performance in natural image computer vision tasks. However, their use in medical computer vision tasks faces several limitations, viz., (i) adapting to visual characteristics that are unlike natural images; (ii) modeling random noise during training due to sto-chastic optimization and backpropagation-based learning strategy; (iii) challenges in explaining DL black-box behavior to support clinical decision-making; and (iv) inter-reader variability in the ground truth (GT) annotations affecting learning and evaluation. This study proposes a systematic approach to address these limitations through application to the pandemic caused need for Coronavirus disease 2019 (COVID-19) detection using chest X-rays (CXRs). Specifically, our contribution highlights significant benefits obtained through (i) pre-training specific to CXRs in transferring and fine-tuning the learned knowledge toward improving COVID-19 detection performance; (ii) using ensembles of the fine-tuned models to further improve performance over individual constituent models; (iii) performing statistical analyses at various learning stages for validating results; (iv) interpreting learned individual and ensemble model behavior through class-selective relevance mapping (CRM)-based region of interest (ROI) localization; and, (v) analyzing inter-reader variability and ensemble localization performance using Simultaneous Truth and Performance Level Estimation (STAPLE) methods. We find that ensemble approaches markedly improved classification and localization performance, and that inter-reader variability and performance level assessment helps guide algorithm design and parameter optimization. To the best of our knowledge, this is the first study to construct ensembles, perform ensemble-based disease ROI localization, and analyze inter-reader variability and algorithm performance for COVID-19 detection in CXRs.","authors":["Sivaramakrishnan Rajaraman","Sudhir Sornapudi","Sameer K Antani","Les Folio"],"meta":["November 2020PLoS ONE 15(11)","DOI:10.1371/journal.pone.0242301","Project: Computer-Aided COVID-19+ Population Screening Using Chest X-Rays"],"references":["342320311_Iteratively_Pruned_Deep_Learning_Ensembles_for_COVID-19_Detection_in_Chest_X-rays","341763488_Weakly_Labeled_Data_Augmentation_for_Deep_Learning_A_Study_on_COVID-19_Detection_in_Chest_X-Rays","341348057_High-Resolution_CT_Features_of_the_COVID-19_Infection_in_Nanchong_City_Initial_and_Follow-up_Changes_among_Different_Clinical_Types","340485184_The_Role_of_Chest_Imaging_in_Patient_Management_During_the_COVID-19_Pandemic_A_Multinational_Consensus_Statement_From_the_Fleischner_Society","340060889_Artificial_Intelligence_Distinguishes_COVID-19_from_Community_Acquired_Pneumonia_on_Chest_CT","339839348_Performance_of_radiologists_in_differentiating_COVID-19_from_viral_pneumonia_on_chest_CT","339012438_Modality-Specific_Deep_Learning_Model_Ensembles_Toward_Improving_TB_Detection_in_Chest_Radiographs","336906206_Grad-CAM_Visual_Explanations_from_Deep_Networks_via_Gradient-Based_Localization","348673179_DeepCOVIDExplainer_Explainable_COVID-19_Diagnosis_from_Chest_X-ray_Images","336703841_The_VIA_Annotation_Software_for_Images_Audio_and_Video"]}