{"id":"345888452_Forensics_and_Digital_Criminal_Investigation_Challenges_in_Cloud_Computing_and_Virtualization","abstract":"models and their relationship with the responsibility of the users are developed. The fundamentals of digital criminal \ninvestigation applied to Cloud Computing are discussed, and the most significant challenges are presented to criminal \ninvestigation and forensic sciences in this type and digital environment. The implications of Virtualization used in Cloud \nComputing in Criminal Investigation and Forensic Science are discussed. The paradigm case of Nested Virtualization \ntechnology is presented as an obstacle to Criminal investigation and forensic investigation. In cases of criminal investigations \nin traditional environments, it is common practice for computer expertise to turn off the equipment and make a copy of the \ndisks that will be analysed later in the laboratory. This is unfeasible in a cloud computing environment, due to the large storage \ncapacity, legal issues, geographic distribution and data control, which may vary depending on the model of service contracted. \nIn addition, lack of physical access to data collection and lack of control over the system make information acquisition a \nchallenging task for cloud expertise. Therefore, forensic computing has been restructured, bringing new techniques, solutions \nand research methods, giving rise to cloud forensics or expertise in the cloud. Thus, the so-called Forensic as a Service (FaaS) \nis dedicated to solving the security challenges inherent in the cloud environment. In this paper we will analyse some of these \nchallenges.","authors":["Pedro Ramos Brandao","Pedro Ramos"],"meta":["July 2019American Journal of Networks and Communications 8(1)","DOI:10.11648/j.ajnc.20190801.13"],"references":["330734073_Computer_Forensics_in_Cloud_Computing_Systems","327546112_Cloud_Computing_Fundamentals","318198289_Challenges_in_Digital_Forensics","224133275_Research_on_the_Key_Technology_of_Secure_Computer_Forensics","221548598_Investigating_the_Implications_of_Virtual_Machine_Introspection_for_Digital_Forensics","220542516_Computer_Forensic_Analysis_in_a_Virtual_Environment","2961643_New_Approach_to_Virtualization_Is_a_Lightweight"]}