{"id":"345982849_An_overview_of_teacher_training_programs_in_educational_robotics_characteristics_best_practices_and_recommendations","abstract":"The emergence of Educational Robotics (ER) and its rapid spread across all levels of education in recent years has drawn attention to the need for further training in this discipline. In this study we discuss the panorama of teacher training research in ER and make recommendations for institutions that intend to implement ER teacher training programs. We explore three databases that include publications in ER teacher training and select 38 publications for analysis. We discuss these publications with special emphasis on requirements, durations, trainer and trainee profiles, pedagogical approaches and best practices. Our main findings are the lack of uniformity regarding the duration and requirements of training programs and the fact that information on trainer and trainee profiles is not always documented. ER teacher training programs are often not founded on theory. When they are based on pedagogical principles, however, these are usually constructivism/constructionism, inquiry-based learning or project-based learning. The most prominent best practices for ER teacher training fall into five categories: collaboration, materials, pedagogy, practice and feedback/support. Our recommendations will help to improve the content, structure and implementation of future ER teacher training programs and the reliability and generalizability of research results and design.","authors":["Despoina Schina","Vanessa Esteve-González","Mireia Usart"],"meta":["May 2021Education and Information Technologies 26(2)","DOI:10.1007/s10639-020-10377-z","Project: European Union’s Horizon 2020 research and innovation programme under the Marie Skłodowska-Curie grant agreement No. 713679"],"references":["328701986_Pre-Service_Teachers'_Experiences_in_Learning_Robotics_Design_and_Programming","325077305_Board_115_EEGRC_Poster_Improving_Pre-service_Elementary_Teachers'_Nature_of_Engineering_Views_with_the_Use_of_EV3_Robotics","324994620_Robotics_in_K-12_Formal_and_Informal_Learning_Environments_A_Review_of_Literature","324730311_Implementation_and_Assessment_Methodologies_of_Teachers'_Training_Courses_for_STEM_Activities","324163629_Teacher_Training_in_Educational_Robotics_The_ROBOESL_Project_Paradigm","324050367_Design_and_Impact_of_a_Teacher_Training_Course_and_Attitude_Change_Concerning_Educational_Robotics","321356063_Development_of_computational_thinking_and_collaborative_learning_in_kindergarten_using_programmable_educational_robots_a_teacher_training_experience","344250850_The_Impact_of_Educational_Robotics_on_Student_STEM_Learning_Attitudes_and_Workplace_Skills","335023712_The_Effect_of_Commercially_Available_Educational_Robotics_A_Systematic_Review","327028108_Preparing_Pre-service_Teachers_to_Promote_Computational_Thinking_in_School_Classrooms_Foundations_and_Research_Highlights"]}