{"id":"345998165_Structural_Brain_Imaging_Phenotypes_of_Mild_Cognitive_Impairment_MCI_and_Alzheimer's_Disease_AD_Found_by_Hierarchical_Clustering","abstract":"A hierarchical clustering algorithm was applied to magnetic resonance images (MRI) of a cohort of 751 subjects having a mild cognitive impairment (MCI), 282 subjects having received Alzheimer's disease (AD) diagnosis, and 428 normal controls (NC). MRIs were preprocessed to gray matter density maps and registered to a stereotactic space. By first rendering the gray matter density maps comparable by regressing out age, gender, and years of education, and then performing the hierarchical clustering, we found clusters displaying structural features of typical AD, cortically-driven atypical AD, limbic-predominant AD, and early-onset AD (EOAD). Among these clusters, EOAD subjects displayed marked cortical gray matter atrophy and atrophy of the precuneus. Furthermore, EOAD subjects had the highest progression rates as measured with ADAS slopes during the longitudinal follow-up of 36 months. Striking heterogeneities in brain atrophy patterns were observed with MCI subjects. We found clusters of stable MCI, clusters of diffuse brain atrophy with fast progression, and MCI subjects displaying similar atrophy patterns as the typical or atypical AD subjects. Bidirectional differences in structural phenotypes were found with MCI subjects involving the anterior cerebellum and the frontal cortex. The diversity of the MCI subjects suggests that the structural phenotypes of MCI subjects would deserve a more detailed investigation with a significantly larger cohort. Our results demonstrate that the hierarchical agglomerative clustering method is an efficient tool in dividing a cohort of subjects with gray matter atrophy into coherent clusters manifesting different structural phenotypes.","authors":["Mikko Kärkkäinen","Mithilesh Prakash","Marzieh Zare","Jussi Tohka"],"meta":["November 2020International Journal of Alzheimer's Disease 2020(2142854):13","DOI:10.1155/2020/2142854","Project: Predictive brain image analysis"],"references":["334131850_Purkinje_Cells_Pathology_in_Alzheimer's_Disease","318753943_Identification_of_clusters_of_rapid_and_slow_decliners_among_subjects_at_risk_for_Alzheimer's_disease","316987459_Longitudinal_Grey_and_White_Matter_Changes_in_Frontotemporal_Dementia_and_Alzheimer's_Disease","316214476_Distinct_subtypes_of_Alzheimer's_disease_based_on_patterns_of_brain_atrophy_Longitudinal_trajectories_and_clinical_applications","315507371_The_cerebellum_shrinks_faster_than_normal_ageing_in_Alzheimer's_disease_but_not_in_mild_cognitive_impairment","303321790_Genes_associated_with_Alzheimer's_disease_An_overview_and_current_status","322842867_Heterogeneous_patterns_of_brain_atrophy_in_Alzheimer's_disease","321074820_Patterns_of_progressive_atrophy_vary_with_age_in_Alzheimer's_disease_patients","320646939_Alzheimer_disease_brain_atrophy_subtypes_are_associated_with_cognition_and_rate_of_decline","311859685_Heterogeneity_of_neuroanatomical_patterns_in_prodromal_Alzheimer's_disease_links_to_cognition_progression_and_biomarkers"]}