{"id":"345997025_Linguistic-Based_Detection_of_Fake_News_in_Social_Media","abstract":"The tremendous growth and impact of fake news as a hot research field gained the public’s attention and threatened their safety in recent years. However, there is a wide range of developed fashions to detect fake contents, either those human-based approaches or machine-based approaches; both have shown inadequacy and limitations, especially those fully automatic approaches. The purpose of this analytic study of media news language is to investigate and identify the linguistic features and their contribution in analyzing data to detect, filter, and differentiate between fake and authentic news texts. This study outlines promising uses of linguistic indicators and adds a rather unconventional outlook to prior literature. It utilizes qualitative and quantitative data analysis as an analytic method to identify systematic nuances between fake and factual news in terms of detecting and comparing 16 attributes under three main linguistic features categories (lexical, grammatical, and syntactic features) assigned manually to news texts. The obtained datasets consist of publicly available right documents on the Politi-fact website and the raw (test) data set collected randomly from news posts on Facebook pages. The results show that linguistic features, especially grammatical features, help determine untrustworthy texts and demonstrate that most of the test news tends to be unreliable articles.","authors":["Mohammad Mahyoob","Jeehaan Algaraady","Musaad Alrahaili"],"meta":["November 2020International Journal of English Linguistics Vol. 11(No. 1 (2021)):99","DOI:10.5539/ijel.v11n1p99","Project: Fake News Detection in Social Media"],"references":["334719491_Fake_News_Research_Theories_Detection_Strategies_and_Open_Problems","328432132_Beyond_News_Content_The_Role_of_Social_Context_for_Fake_News_Detection","325212005_Fake_News_vs_Satire_A_Dataset_and_Analysis","318981549_Fake_News_Detection_on_Social_Media_A_Data_Mining_Perspective","312635157_The_Language_of_Deceivers_Linguistic_Features_of_Crowdfunding_Scams","301841797_Hoaxy_A_Platform_for_Tracking_Online_Misinformation","342124799_Fake_News_Early_Detection_A_Theory-driven_Model","320885186_CSI_A_Hybrid_Deep_Model_for_Fake_News_Detection","316712634_Social_Media_and_Fake_News_in_the_2016_Election","307907069_Automatic_deception_detection_Methods_for_finding_fake_news"]}