{"id":"345973095_Evolutionary_training_and_abstraction_yields_algorithmic_generalization_of_neural_computers","abstract":"A key feature of intelligent behaviour is the ability to learn abstract strategies that scale and transfer to unfamiliar problems. An abstract strategy solves every sample from a problem class, no matter its representation or complexity—similar to algorithms in computer science. Neural networks are powerful models for processing sensory data, discovering hidden patterns and learning complex functions, but they struggle to learn such iterative, sequential or hierarchical algorithmic strategies. Extending neural networks with external memories has increased their capacities to learn such strategies, but they are still prone to data variations, struggle to learn scalable and transferable solutions, and require massive training data. We present the neural Harvard computer, a memory-augmented network-based architecture that employs abstraction by decoupling algorithmic operations from data manipulations, realized by splitting the information flow and separated modules. This abstraction mechanism and evolutionary training enable the learning of robust and scalable algorithmic solutions. On a diverse set of 11 algorithms with varying complexities, we show that the neural Harvard computer reliably learns algorithmic solutions with strong generalization and abstraction, achieves perfect generalization and scaling to arbitrary task configurations and complexities far beyond seen during training, and independence of the data representation and the task domain.","authors":["Daniel Tanneberg","Elmar Rueckert","Jan Peters"],"meta":["December 2020Nature Machine Intelligence 2(12):1-11","DOI:10.1038/s42256-020-00255-1"],"references":["339340138_Neural_Stored-program_Memory","336934637_Deep_Learning_for_Generic_Object_Detection_A_Survey","332466679_Reinforcement_Learning_Fast_and_Slow","331474581_Deep_learning_for_time_series_classification_a_review","330263531_On_The_Necessity_of_Abstraction","328820980_Neuroevolution_of_a_Modular_Memory-Augmented_Neural_Network_for_Deep_Memory_Problems","324078360_Unsupervised_Predictive_Memory_in_a_Goal-Directed_Agent","323335071_Continual_Lifelong_Learning_with_Neural_Networks_A_Review","321902735_Improving_Exploration_in_Evolution_Strategies_for_Deep_Reinforcement_Learning_via_a_Population_of_Novelty-Seeking_Agents","323619828_HyperNTM_Evolving_Scalable_Neural_Turing_Machines_Through_HyperNEAT","319770419_Learning_Simple_Algorithms_from_Examples","319770248_Neural_Programmer_Inducing_Latent_Programs_with_Gradient_Descent","319770246_Neural_Programmer-Interpreters","319769995_End-To-End_Memory_Networks","316428704_Making_Neural_Programming_Architectures_Generalize_via_Recursion"]}