{"id":"345981382_A_Memetic_Decomposition-Based_Multi-Objective_Evolutionary_Algorithm_Applied_to_a_Constrained_Menu_Planning_Problem","abstract":"Encouraging healthy and balanced diet plans is one of the most important action points for governments around the world. Generating healthy, balanced and inexpensive menu plans that fulfil all the recommendations given by nutritionists is a complex and time-consuming task; because of this, computer science has an important role in this area. This paper deals with a novel constrained multi-objective formulation of the menu planning problem specially designed for school canteens that considers the minimisation of the cost and the minimisation of the level of repetition of the specific courses and food groups contained in the plans. Particularly, this paper proposes a multi-objective memetic approach based on the well-known multi-objective evolutionary algorithm based on decomposition (MOEA/D). A crossover operator specifically designed for this problem is included in the approach. Moreover, an ad-hoc iterated local search (ILS) is considered for the improvement phase. As a result, our proposal is referred to as ILS-MOEA/D. A wide experimental comparison against a recently proposed single-objective memetic scheme, which includes explicit mechanisms to promote diversity in the decision variable space, is provided. The experimental assessment shows that, even though the single-objective approach yields menu plans with lower costs, our multi-objective proposal offers menu plans with a significantly lower level of repetition of courses and food groups, with only a minor increase in cost. Furthermore, our studies demonstrate that the application of multi-objective optimisers can be used to implicitly promote diversity not only in the objective function space, but also in the decision variable space. Consequently, in contrast to the single-objective optimiser, there was no need to include an explicit strategy to manage the diversity in the decision space in the case of the multi-objective approach.","authors":["Alejandro Marrero","Eduardo Segredo","Coromoto Leon","Carlos Segura"],"meta":["November 2020","DOI:10.3390/math8111960","Project: Combinaci贸n de computaci贸n evolutiva y aprendizaje automatizado en la resoluci贸n de problemas de optimizaci贸n"],"references":["342249688_SCHOOLTHY_Automatic_Menu_Planner_for_Healthy_and_Balanced_School_Meals","333728873_On_the_automatic_planning_of_healthy_and_balanced_menus","327822613_Mathematical_Optimization_to_Explore_Tomorrow's_Sustainable_Diets_A_Narrative_Review","322513791_Bacterial_Foraging_Optimization_Algorithm_for_Menu_Planning","322069813_Added_sugars_and_ultra-processed_foods_in_Spanish_households_1990-2010","336587000_An_Evaluation_of_a_Meal_Planning_System_Ease_of_Use_and_Perceived_Usefulness","335063267_A_Novel_Memetic_Algorithm_with_Explicit_Control_of_Diversity_for_the_Menu_Planning_Problem","328893888_An_Evolutionary_Mono-Objective_Approach_for_Solving_the_Menu_Planning_Problem","323619311_CardNutri_A_Software_of_Weekly_Menus_Nutritional_Elaboration_for_Scholar_Feeding_Applying_Evolutionary_Computation","318376440_The_menu_planning_problem_a_multiobjective_approach_for_Brazilian_schools_context"]}