{"id":"345907524_Fluid-solid_Floquet_stability_analysis_of_self-propelled_heaving_foils","abstract":"We investigate the role of linear mechanisms in the emergence of nonlinear horizontal self-propelled states of a heaving foil in a quiescent fluid. Two states are analyzed: a periodic state of unidirectional motion and a quasi-periodic state of slow back & forth motion around a mean horizontal position. The states emergence is explained through a fluid-solid Floquet stability analysis of the non-propulsive symmetric base solution. Unlike a purely-hydrodynamic analysis, our analysis accurately determine the locomotion states onset. An unstable synchronous mode is found when the unidirectional propulsive solution is observed. The obtained mode has a propulsive character, featuring a mean horizontal velocity and an asymmetric flow that generates a horizontal force accelerating the foil. An unstable asynchronous mode, also featuring flow asymmetry and a non-zero velocity, is found when the back & forth state is observed. Its associated complex multiplier introduces a slow modulation of the flapping period, agreeing with the quasi-periodic nature of the back & forth regime. The temporal evolution of this perturbation shows how the horizontal force exerted by the flow is alternatively propulsive or resistive over a slow period. For both modes, an analysis of the velocity and force perturbation time-averaged over the flapping period is used to establish physical instability criteria. The behaviour for large solid-to-fluid density ratio of the modes is thus analyzed. The asynchronous fluid-solid mode converges towards the purely-hydrodynamic one, whereas the synchronous mode becomes marginally unstable in our analysis not converging to the purely-hydrodynamic analysis where it is never destabilised.","authors":["Luis Benetti Ramos","Olivier Marquet","Michel Bergmann","Angelo Iollo"],"meta":["November 2020Journal of Fluid Mechanics","DOI:10.1017/jfm.2020.1021","Project: AEROFLEX - Aeroelastic instabilities and control of FLEXible structures"],"references":["341958455_Fluid-structure_stability_analyses_and_nonlinear_dynamics_of_flexible_splitter_plates_interacting_with_a_circular_cylinder_flow","331167790_A_Practical_Review_on_Linear_and_Nonlinear_Global_Approaches_to_Flow_Instabilities","320098187_Global_modes_and_nonlinear_analysis_of_inverted-flag_flapping","317732641_Linear_and_nonlinear_perturbation_analysis_of_the_symmetry_breaking_in_time-periodic_propulsive_wakes","325099019_Two_modes_resonant_combined_motion_for_insect_wings_kinematics_reproduction_and_lift_generation","323208616_Horizontal_locomotion_of_a_vertically_flapping_oblate_spheroid","321608073_A_modern_course_in_aeroelasticity","315370767_Coherent_structures_in_interacting_vortex_rings","308134883_Instabilities_of_interacting_vortex_rings_generated_by_an_oscillating_disk","301238955_Lock-in_in_vortex-induced_vibration"]}