{"id":"346074502_A_light_CNN_for_detecting_COVID-19_from_CT_scans_of_the_chest","abstract":"Computer Tomography (CT) imaging of the chest is a valid diagnosis tool to detect COVID-19 promptly and to control the spread of the disease. In this work we propose a light Convolutional Neural Network (CNN) design, based on the model of the SqueezeNet, for the efficient discrimination of COVID-19 CT images with respect to other community-acquired pneumonia and/or healthy CT images. The architecture allows to an accuracy of 85.03% with an improvement of about 3.2% in the first dataset arrangement and of about 2.1% in the second dataset arrangement. The obtained gain, though of low entity, can be really important in medical diagnosis and, in particular, for Covid-19 scenario. Also the average classification time on a high-end workstation, 1.25 s, is very competitive with respect to that of more complex CNN designs, 13.41 s, witch require pre-processing. The proposed CNN can be executed on medium-end laptop without GPU acceleration in 7.81 s: this is impossible for methods requiring GPU acceleration. The performance of the method can be further improved with efficient pre-processing strategies for witch GPU acceleration is not necessary.","authors":["Matteo Polsinelli","Luigi Cinque","Giuseppe Placidi"],"meta":["December 2020Pattern Recognition Letters 140:95-100","DOI:10.1016/j.patrec.2020.10.001"],"references":["349577188_A_deep_learning_algorithm_using_CT_images_to_screen_for_Corona_virus_disease_COVID-19","330605863_Efficient_Multiple_Organ_Localization_in_CT_Image_Using_3D_Region_Proposal_Network","328509150_Benchmark_Analysis_of_Representative_Deep_Neural_Network_Architectures","340766948_Early_CT_features_and_temporal_lung_changes_in_COVID-19_pneumonia_in_Wuhan_China","340181970_The_role_of_CT_in_case_ascertainment_and_management_of_COVID-19_pneumonia_in_the_UK_insights_from_high-incidence_regions","339707234_Coronavirus_disease_2019_COVID-19_Role_of_chest_CT_in_diagnosis_and_management","339367360_Sensitivity_of_Chest_CT_for_COVID-19_Comparison_to_RT-PCR","319770006_Learning_Deep_Features_for_Discriminative_Localization"]}