{"id":"346093652_Toward_an_Axiomatization_of_Strongly_Possible_Functional_Dependencies","abstract":"In general, there are two main approaches to handle the missing data values problem in SQL tables. One is to ignore or remove any record with some missing data values. The other approach is to fill or impute the missing data with new values [A. Farhangfar, L. A. Kurgan and W. Pedrycz, A novel framework for imputation of missing values in databases, IEEE Trans. Syst. Man Cybern. A, Syst. Hum. 37(5) (2007) 692–709]. In this paper, the second method is considered. Possible worlds, possible and certain keys, and weak and strong functional dependencies were introduced in Refs. 4 and 2 [H. Köhler, U. Leck, S. Link and X. Zhou, Possible and certain keys for SQL, VLDB J. 25(4) (2016) 571–596; M. Levene and G. Loizou, Axiomatisation of functional dependencies in incomplete relations, Theor. Comput. Sci. 206(1) (1998) 283–300]. We introduced the intermediate concept of strongly possible worlds in a preceding paper, which are obtained by filling missing data values with values already existing in the table. Using strongly possible worlds, strongly possible keys and strongly possible functional dependencies (spFDs) were introduced in Refs. 5 and 1 [M. Alattar and A. Sali, Keys in relational databases with nulls and bounded domains, in ADBIS 2019: Advances in Databases and Information Systems, Lecture Notes in Computer Science, Vol. 11695 (Springer, Cham, 2019), pp. 33–50; Functional dependencies in incomplete databases with limited domains, in FoiKS 2020: Foundations of Information and Knowledge Systems, Lecture Notes in Computer Science, Vol. 12012 (Springer, Cham, 2020), pp. 1–21]. In this paper, some axioms and rules for strongly possible functional dependencies are provided, These axioms and rules form the basis for a possible axiomatization of spFDs. For that, we analyze which weak/strong functional dependency and certain functional dependency axioms remain sound for strongly possible functional dependencies, and for the axioms that are not sound, we give appropriate modifications for soundness.","authors":["Munqath Alattar","Attila Sali"],"meta":["October 2020Vietnam Journal of Computer Science 08(2):1-19","DOI:10.1142/S2196888821500056"],"references":["337331813_Functional_and_inclusion_dependencies_and_their_implication_problems","303848496_Possible_and_certain_keys_for_SQL","256623908_On_a_general_class_of_data_dependencies_in_the_relational_model_and_its_implication_problems","250806217_Experimental_analysis_of_methods_for_imputation_of_missing_values_in_databases","338992717_Functional_Dependencies_in_Incomplete_Databases_with_Limited_Domains","335435092_Keys_in_Relational_Databases_with_Nulls_and_Bounded_Domains","324512144_SQL_Schema_Design_Foundations_Normal_Forms_and_Normalization","311388021_FUNCTIONAL_DEPENDENCIES_AND_INCOMPLETE_INFORMATION","305263241_Incomplete_information_and_dependencies_in_relational_databases","261041289_Comparison_of_missing_data_imputation_methods_for_traffic_flow"]}