{"id":"346022785_Blockchain_Technology_-_Integration_in_Supply_Chain_Processes","abstract":"Purpose: Supply chain networks face an increasing demand to integrate globally distributed customers and suppliers. As supply chain processes are deemed to lack sufficient transparency and security, blockchain solutions are piloted to offer an IT infrastructure covering these needs. This paper aims to bring current projects one step further and evolves a model for integrating blockchain solutions into supply chain processes. Methodology: In order to get an overview of existing models for technology integration , an exploratory research study is conducted. In addition, requirements for the specific integration of blockchain solutions are gathered and categorized in a systematic content analysis. Based on these requirements, the models are evaluated, compared and utilized for the development of a new model. Findings: Since none of the presented models fully meet the specific blockchain-based requirements, the existing models must be further developed. Specifically, increases in the number of supply chain partners and external stakeholders involved in blockchain-based systems are not supported by current models, and need to be integrated systematically. Originality: In this paper, an integration model is developed that is particularly suitable for blockchain integration into supply chain processes. In order to give starting points for a validation of the model, a case study is conducted in the field of blockchain-based payment gateway solutions.","authors":["Tan Guerpinar","Sophie Harre","Michael Henke","Farah Saleh"],"meta":["November 2020","DOI:10.15480/882.3117","Conference: Hamburg International Conference of LogisticsAt: Hamburg, GermanyVolume: New Ways of Creating Value in Supply Chains and Logistics"],"references":["338467246_Blockchain_Implementations_and_Use_Cases_for_Supply_Chains_-_A_Survey","337112004_Disruptive_Technologies_-_Integration_in_Existing_Supply_Chain_Processes","336885205_Blockchain-Technologie_im_interdisziplinaren_Umfeld","331845594_Application_of_Rank-Weight_Methods_to_Blockchain_Cybersecurity_Vulnerability_Assessment_Framework","329838580_An_integrated_framework_of_enterprise_information_systems_in_smart_manufacturing_system_via_business_process_reengineering","329136952_A_systematic_literature_review_of_blockchain-based_applications_Current_status_classification_and_open_issues","326868072_Blockchain_and_IoT_Integration_A_Systematic_Survey","325354230_On_blockchain_and_its_integration_with_IoT_Challenges_and_opportunities","344428274_Vorstudie_zur_Entwicklung_einer_bedarfs-und_nutzergerechten_Unterstutzung_von_KMU_bei_der_Einfuhrung_und_Anwendung_von_Industrie_40_Forschungsbeirat_Plattform_Industrie_40","328345129_Blockchain_technology_and_its_relationships_to_sustainable_supply_chain_management"]}