{"id":"346028333_Perceptual_bias_and_technical_metapictures_critical_machine_vision_as_a_humanities_challenge","abstract":"In many critical investigations of machine vision, the focus lies almost exclusively on dataset bias and on fixing datasets by introducing more and more diverse sets of images. We propose that machine vision systems are inherently biased not only because they rely on biased datasets but also because their perceptual topology, their specific way of representing the visual world, gives rise to a new class of bias that we call perceptual bias. Concretely, we define perceptual topology as the set of those inductive biases in machine vision systems that determine its capability to represent the visual world. Perceptual bias, then, describes the difference between the assumed “ways of seeing” of a machine vision system, our reasonable expectations regarding its way of representing the visual world, and its actual perceptual topology. We show how perceptual bias affects the interpretability of machine vision systems in particular, by means of a close reading of a visualization technique called “feature visualization”. We conclude that dataset bias and perceptual bias both need to be considered in the critical analysis of machine vision systems and propose to understand critical machine vision as an important transdisciplinary challenge, situated at the interface of computer science and visual studies/Bildwissenschaft.","authors":["Fabian Offert","Peter Bell"],"meta":["December 2021AI & SOCIETY 36(8):1-12","DOI:10.1007/s00146-020-01058-z"],"references":["352224617_Excavating_AI_the_politics_of_images_in_machine_learning_training_sets","346535483_The_Nooscope_manifested_AI_as_instrument_of_knowledge_extractivism","330264946_Fairness_and_Abstraction_in_Sociotechnical_Systems","328734051_Explaining_Explanations_in_AI","349930913_Depth_in_Deep_Learning_Knowledgeable_Layered_Impenetrable","344655466_Race_After_Technology_Abolitionist_Tools_for_the_New_Jim_Code","335076177_A_Discussion_of_'Adversarial_Examples_Are_Not_Bugs_They_Are_Features'","330880261_Explaining_Explanations_An_Overview_of_Interpretability_of_Machine_Learning","330695389_Images_of_Image_Machines_Visual_Interpretability_in_Computer_Vision_for_Art_Subvolume_B","330266000_A_comparative_study_of_fairness-enhancing_interventions_in_machine_learning"]}