{"id":"346053262_A_Review_on_Cementitious_Self-Healing_and_the_Potential_of_Phase-Field_Methods_for_Modeling_Crack-Closing_and_Fracture_Recovery","abstract":"Improving the durability and sustainability of concrete structures has been driving the enormous number of research papers on self-healing mechanisms that have been published in the past decades. The vast developments of computer science significantly contributed to this and enhanced the various possibilities numerical simulations can offer to predict the entire service life, with emphasis on crack development and cementitious self-healing. The aim of this paper is to review the currently available literature on numerical methods for cementitious self-healing and fracture development using Phase-Field (PF) methods. The PF method is a computational method that has been frequently used for modeling and predicting the evolution of meso-and microstructural morphology of cementitious materials. It uses a set of conservative and non-conservative field variables to describe the phase evolutions. Unlike traditional sharp interface models, these field variables are continuous in the interfacial region, which is typical for PF methods. The present study first summarizes the various principles of self-healing mechanisms for cementitious materials, followed by the application of PF methods for simulating microscopic phase transformations. Then, a review on the various PF approaches for precipitation reaction and fracture mechanisms is reported, where the final section addresses potential key issues that may be considered in future developments of self-healing models. This also includes unified, combined and coupled multi-field models, which allow a comprehensive simulation of self-healing processes in cementitious materials.","authors":["Sha Yang","Fadi Aldakheel","Antonio Caggiano","Peter Wriggers"],"meta":["November 2020Materials 13(22):5265","DOI:10.3390/ma13225265"],"references":["345175727_A_phase_field_modeling_approach_of_cyclic_fatigue_crack_growth","344167572_Curvilinear_virtual_elements_for_contact_mechanics","343713700_Micromechanically-motivated_phase_field_approach_to_ductile_fracture","343701822_A_global-local_approach_for_hydraulic_phase-field_fracture_in_poroelastic_media","342934129_A_Bayesian_estimation_method_for_variational_phase-field_fracture_problems","342749526_Finite_deformation_cohesive_zone_phase_field_model_for_crack_propagation_in_multi-phase_microstructures","346634730_A_Ternary_Cahn-Hilliard_Navier-Stokes_Model_for_two_Phase_Flow_with_Precipitation_and_Dissolution","345355772_An_efficient_phase-field_model_for_fatigue_fracture_in_ductile_materials","344595740_A_single_Gauss_point_continuum_finite_element_formulation_for_gradient-extended_damage_at_large_deformations","342479769_A_gradient-extended_two-surface_damage-plasticity_model_for_large_deformations"]}