{"id":"346057630_A_comprehensive_quality_assessment_framework_for_scientific_events","abstract":"Systematic assessment of scientific events has become increasingly important for research communities. A range of metrics (e.g., citations, h-index) have been developed by different research communities to make such assessments effectual. However, most of the metrics for assessing the quality of less formal publication venues and events have not yet deeply investigated. It is also rather challenging to develop respective metrics because each research community has its own formal and informal rules of communication and quality standards. In this article, we develop a comprehensive framework of assessment metrics for evaluating scientific events and involved stakeholders. The resulting quality metrics are determined with respect to three general categories—events, persons, and bibliometrics. Our assessment methodology is empirically applied to several series of computer science events, such as conferences and workshops, using publicly available data for determining quality metrics. We show that the metrics’ values coincide with the intuitive agreement of the community on its “top conferences”. Our results demonstrate that highly-ranked events share similar profiles, including the provision of outstanding reviews, visiting diverse locations, having reputed people involved, and renowned sponsors.","authors":["Sahar Vahdati","Said Fathalla","Christoph Lange","Andreas Behrend"],"meta":["November 2020Scientometrics 126(1):1-42","DOI:10.1007/s11192-020-03758-1"],"references":["339569193_Scholarly_event_characteristics_in_four_fields_of_science_a_metrics-based_analysis","336594094_SEO_A_Scientific_Events_Data_Model","333366804_EVENTSKG_A_5-Star_Dataset_of_Top-Ranked_Events_in_Eight_Computer_Science_Communities","328369990_SemSur_A_Core_Ontology_for_the_Semantic_Representation_of_Research_Findings","327428154_Metadata_Analysis_of_Scholarly_Events_of_Computer_Science_Physics_Engineering_and_Mathematics","326890754_EVENTSKG_A_Knowledge_Graph_Representation_for_Top-Prestigious_Computer_Science_Events_Metadata_10th_International_Conference_ICCCI_2018_Bristol_UK_September_5-7_2018_Proceedings_Part_I","320171394_Research_Articles_in_Simplified_HTML_A_Web-first_format_for_HTML-based_scholarly_articles","319420278_Analysing_Scholarly_Communication_Metadata_of_Computer_Science_Events","326340402_FaBIO_and_CiTO_Ontologies_for_Describing_Bibliographic_Resources_and_Citations","321247963_Disruption_of_Perceptual_Learning_by_a_Brief_Practice_Break"]}