{"id":"346108844_A_Machine_Learning-Based_Recommender_System_for_Improving_Students_Learning_Experiences","abstract":"Outcome-based education (OBE) is a well-proven teaching strategy based upon a predefined set of expected outcomes. The components of OBE are Program Educational Objectives (PEOs), Program Outcomes (POs), and Course Outcomes (COs). These latter are assessed at the end of each course and several recommended actions can be proposed by faculty members’ to enhance the quality of courses and therefore the overall educational program. Considering a large number of courses and the faculty members’ devotion, bad actions could be recommended and therefore undesirable and inappropriate decisions may occur. In this paper, a recommender system, using different machine learning algorithms, is proposed for predicting suitable actions based on course specifications, academic records, and course learning outcomes’ assessments. We formulated the problem as a multi-label multi-class binary classification problem and the dataset was translated into different problem transformation and adaptive methods such as one-vs.-all, binary relevance, label powerset, classifier chain, and ML-KNN adaptive classifier. As a case study, the proposed recommender system is applied to the college of Computer and Information Sciences, Jouf University, Kingdom of Saudi Arabia (KSA) for helping academic staff improving the quality of teaching strategies. The obtained results showed that the proposed recommender system presents more recommended actions for improving students’ learning experiences","authors":["Nacim Yanes"],"meta":["November 2020IEEE Access VOLUME 8:201218-201235","DOI:10.1109/ACCESS.2020.3036336"],"references":["342219617_Impact_assessment_of_outcome_based_approach_in_engineering_education_in_India","339605699_Classification_on_grade_price_and_region_with_multi-label_and_multi-target_methods_in_wineinformatics","339087979_Comparison_of_base_classifiers_for_multi-label_learning","338673848_Factors_Affecting_Academic_Integrity_in_E-Learning_of_Saudi_Arabian_Universities_An_Investigation_Using_Delphi_and_AHP","338453477_Outcome-based_Education_An_Outline","338161906_A_Survey_on_Multi-Label_Data_Stream_Classification","340811299_A_hybrid_scheme-based_one-vs-all_decision_trees_for_multi-class_classification_tasks","340001507_One-class_support_vector_classifiers_A_survey","339825481_A_novel_random_forest_approach_for_imbalance_problem_in_crime_linkage","339262689_Power_Plant_Data_Filtering_Based_on_Gaussian_Naive_Bayesian_Classification_and_Prediction_Error_Method"]}