{"id":"346164951_Anatomy_of_Complex_System_Research","abstract":"Complex systems play important roles in science and economy and have become one of the major intellectual and scientific challenges of the twenty-first century. However, the way complex system research connects to other academic fields is much less well understood, with only anecdotal evidence. In this work, we present an anatomy of complex system research by leveraging a large-scale dataset that contains more than 100 million digitalized publications. First, we find that complex system research shows a steady growth relative to the whole science in the last 60 years, with a sudden burst after 2000, which might be related to the development of computational technologies. Although early complex system study shows strong referencing behaviors to mathematics and physics, it couples significantly with computer science in the twenty-first century and affects engineering strongly. Moreover, we find empirical evidence that complex system research tends to have multidisciplinary nature, as it is often inspired by or affects a diverse set of disciplines. Finally, we find significant positive correlations between fields’ reference broadness and future scientific impacts. Overall, our findings are consistent with several characteristics of complex system research, i.e., its multidisciplinary, quantitative, and computational nature, and may have broad policy implications for supporting and nurturing multidisciplinary research.","authors":["Yang Wang","Xinyue Wang"],"meta":["October 2020Complexity 2020:1-11","DOI:10.1155/2020/5208356"],"references":["343105466_The_evolution_of_knowledge_within_and_across_fields_in_modern_physics","342103936_Mentorship_and_protege_success_in_STEM_fields","337708121_A_Review_of_Microsoft_Academic_Services_for_Science_of_Science_Studies","334806091_Increasing_trend_of_scientists_to_switch_between_topics","334314759_Emergence_of_scaling_in_complex_substitutive_systems","331026686_The_evolution_of_citation_graphs_in_artificial_intelligence_research","330223204_Taking_census_of_physics","327781787_Toward_a_more_scientific_science","323502497_Science_of_science","337065773_Nature's_reach_narrow_work_has_broad_impact"]}