{"id":"346239075_Smart_Technologies_of_the_Smart_City","abstract":"The article discusses the intellectualization of modern technologies and their application in the concept of “smart city”. The aim of the work was to clarify the notion of a smart city and identify the key technologies underlying it. Today, the categorical apparatus, which fully reflects the essence and content of the concept of “smart city”, is in the process of formation, while individual approaches both complement and contradict each other. Smart practices were analyzed and six categories of “smart” technologies were identified. Further analysis showed the limited use of smart technologies in energy, water and gas supply, buildings. The reasons for this are the technical and technological stagnation of urban infrastructures, the impossibility of their simultaneous improvement, which is a deterrent to the development of smart cities in Russia and in other developed and developing countries of the world. At the same time, the identification of the smart city primarily with the service to the authors does not seem quite true, since for the development of agglomerations it is also necessary to provide a stable economic basis in the form of the development of the material base - industry and the agro-industrial sector. Therefore, there is a need for parallel development and combination of the concepts of “Smart City” and “Industry 4.0” and, based on the technologies of the fourth industrial revolution, to ensure the inclusion of industrial facilities in a “smart” urban environment. The creation of smart cities is associated with significant costs, so one of the main tasks is the formation of an investment strategy, the definition of promising areas of investment. The analysis showed that, with a high degree of probability, implementing universal approaches to strategic management, smart cities will develop components that are already characterized by high efficiency.","authors":["Pavel M. Gureev","Helena N. Dunenkova","Svetlana I. Onishchenko"],"meta":["January 2021","DOI:10.1007/978-3-030-59126-7_116","In book: \"Smart Technologies\" for Society, State and Economy (pp.1052-1062)"],"references":["271129911_The_Practice_of_Management"]}