{"id":"346225047_TechTeach-An_Innovative_Method_to_Increase_the_Students_Engagement_at_Classrooms","abstract":"Higher education is changing, and a new normal is coming. Students are even more demanding, and professors need to follow the evolution of technology and try to increase student engagement in the classrooms (presential or virtual). Higher education students recognise that the introduction of new tools and learning methods can improve the teaching quality and increase the motivation to learn. Regarding a question about which type of classes students preferred, ninety-one point ninety-nine per cent (91.99%) of the students wanted interactive classes over traditional. Having this concern in mind over the past years, a professor explored a set of methods, strategies and tools and designed a new and innovative paradigm using gamification. This approach is denominated TechTeach and explores a set of trending concepts and interactive tools to teach computer science subjects. It was designed to run in a B-learning environment. The paradigm uses flipped classrooms, bring your own device (BYOD), gamification, training of soft-skills and quizzes and surveys to increase the student’s engagement and provide the best learning environment to students. Currently, COVID-19 is bringing about new challenges, and TechTeach was improved in order to be more suitable for this new way of teaching (from 0% to 100% online classes). This article details this method and shows how it can be applied in a real environment. A case study was used to prove the functionality and relevance of this approach, and the achieved results are motivating. During the semester, more than a hundred students experienced this new way of teaching and assessment. In the end, more than eighty-one per cent (81%) of the students gave a positive grade to the approach, and more than ninety-five per cent (95.65%) of the students approved the use of the concept of BYOD in the classroom. With TechTeach, the classroom is not a boring place anymore; it is a place to learn and enjoy regardless of being physical or not.","authors":["Filipe Portela"],"meta":["October 2020Information (Switzerland) 11(10):483","DOI:10.3390/info11100483"],"references":["338600269_Active_and_Emerging_Methodologies_for_Ubiquitous_Education_Potentials_of_Flipped_Learning_and_Gamification","330935647_What_Do_We_Mean_by_Blended_Learning","329603581_Soft_Skill_Assessment_in_Higher_Education","323200713_Blended_learning_the_new_normal_and_emerging_technologies","321762526_A_critical_review_of_13_years_of_mobile_game-based_learning","341449418_PWA_and_Pervasive_Information_System_-_A_New_Era","338943272_The_effect_of_using_Kahoot_for_learning_-_A_literature_review","331384369_Slack_It_to_Me_Complementing_LMS_With_Student-Centric_Communications_for_the_MillennialPost-Millennial_Student","328245955_Web_Intelligence_in_Higher_Education_A_Study_on_the_Usage_of_Business_Intelligence_Techniques_in_Education","324178698_Flipped_Classroom_and_Problem-Based-Learning_in_Higher_Education"]}