{"id":"346201381_A_Fresh_View_of_Linear_Logic_as_a_Logical_Framework","abstract":"One of the most fundamental properties of a proof system is analyticity, expressing the fact that a proof of a given formula F only uses subformulas of F. In sequent calculus, this property is usually proved by showing that the cut rule is admissible, i.e., the introduction of the auxiliary lemma A in the reasoning “if A follows from B and C follows from A, then C follows from B” can be eliminated. Mathematically, this means that we can inline the intermediate step A to have a direct proof of C from the hypothesis B. More importantly, the proof of cut-elimination shows that the proof of C follows directly from the axiomatic theory and B (and no external lemmas are needed). The proof of cut-elimination is usually a tedious process through several proof transformations, thus requiring the assistance of (semi-)automatic procedures to avoid mistakes. In a previous work by Miller and Pimentel, linear logic (LL) was used as a logical framework for establishing sufficient conditions for cut-elimination of object logics (OL). The OL's inference rules were encoded as an LL theory and an easy-to-verify criterion sufficed to establish the cut-elimination theorem for the OL at hand. Using such procedure, analyticity of logical systems such as LK (classical logic), LJ (intuitionistic logic) and substructural logics such as MALL (multiplicative additive LL) was proved within the framework. However, there are many logical systems that cannot be adequately encoded in LL, the most symptomatic cases being sequent systems for modal logics. In this paper we use a linear-nested sequent (LNS) presentation of SLL (a variant of linear logic with subexponentials) and show that it is possible to establish a cut-elimination criterion for a larger class of logical systems, including LNS proof systems for K, 4, KT, KD, S4 and the multi-conclusion LNS system for intuitionistic logic (mLJ). Impressively enough, the sufficient conditions for cut-elimination presented here remain as simple as the one proposed by Miller and Pimentel. The key ingredient in our developments is the use of the right formalism: we adopt LNS based OL systems, instead of sequent ones. This not only provides a neat encoding procedure of OLs into SLL, but it also allows for the use of the meta-theory of SLL to establish fundamental meta-properties of the encoded OLs. We thus contribute with procedures for checking cut-elimination of several logical systems that are widely used in philosophy, mathematics and computer science.","authors":["Carlos Olarte","Elaine Pimentel","Bruno Xavier"],"meta":["September 2020Electronic Notes in Theoretical Computer Science 351:143-165","DOI:10.1016/j.entcs.2020.08.008"],"references":["328617764_Mechanizing_Focused_Linear_Logic_in_Coq","319662377_Subexponentials_in_non-commutative_linear_logic","314092817_Modularisation_of_Sequent_Calculi_for_Normal_and_Non-normal_Modalities","283445618_Proof_Search_in_Nested_Sequent_Calculi","280561781_Linear_Nested_Sequents_2-Sequents_and_Hypersequents","335335182_Sequentialising_Nested_Systems","325989751_A_Semantical_View_of_Proof_Systems","317772133_On_subexponentials_focusing_and_modalities_in_concurrent_systems","317265831_A_uniform_framework_for_substructural_logics_with_modalities","299650703_A_proof_theoretic_view_of_spatial_and_temporal_dependencies_in_biochemical_systems"]}