{"id":"346263493_Untact_Customer's_Acceptance_Intention_toward_Robot_Barista_in_Coffee_Shop","abstract":"Restaurants have been using robots to meet the increasing consumer demand for food customization and safety and contactless service operations. This study identified the antecedent factors influencing a customer’s attitude and acceptance intention toward a robot barista. To this end, we conducted a questionnaire survey from 10 to 24 January 2020, on a sample of 317 Korean consumers who purchased coffee prepared by a robot barista. We based the analysis on the following determinant factors of the extension of the technology acceptance model (ETAM): perceived enjoyment, perceived usefulness, need for interaction, perceived risk, and perceived innovativeness. The results showed that perceived usefulness had the highest impact on acceptance intention, followed by perceived enjoyment and the need for interaction. Perceived usefulness and innovativeness positively influenced acceptance intention. These results confirmed the significance of the determinant factors in inducing customers’ attitude and acceptance intention toward a robot barista. This study extends the research on the application of artificial intelligence and the fourth industrial revolution technologies in the food service industry, and hence contributes toward the preparations for the post-Covid-19 period. It also offers practical implications for sustainable coffee shop management.","authors":["Hye Jin Sung","Hyeon Mo Jeon"],"meta":["October 2020Sustainability 12(20):8598","DOI:10.3390/su12208598"],"references":["341377328_Serving_Robots_Management_and_Applications_for_Restaurant_Business_Sustainability","333613010_Determinants_of_Continuous_Intention_on_Food_Delivery_Apps_Extending_UTAUT2_with_Information_Quality","331836586_Continuous_Intention_on_Accommodation_Apps_Integrated_Value-Based_Adoption_and_Expectation-Confirmation_Model_Analysis","326623268_Brave_New_World_Service_Robots_in_the_Frontline","337197711_Antecedents_of_customers'_acceptance_of_artificially_intelligent_robotic_device_use_in_hospitality_services","334838433_Perceived_innovativeness_of_drone_food_delivery_services_and_its_impacts_on_attitude_and_behavioral_intentions_The_moderating_role_of_gender_and_age","326831183_Understanding_online_business_simulation_games_the_role_of_flow_experience_perceived_enjoyment_and_personal_innovativeness","314244832_Enabling_internet_banking_adoption_An_empirical_examination_with_an_augmented_technology_acceptance_model_TAM","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","311573689_A_Primer_on_Partial_Least_Squares_Structural_Equation_Modeling_PLS-SEM"]}