{"id":"346247624_Self-attention_for_raw_optical_Satellite_Time_Series_Classification","abstract":"The amount of available Earth observation data has increased dramatically in recent years. Efficiently making use of the entire body of information is a current challenge in remote sensing; it demands lightweight problem-agnostic models that do not require region- or problem-specific expert knowledge. End-to-end trained deep learning models can make use of raw sensory data by learning feature extraction and classification in one step, solely from data. Still, many methods proposed in remote sensing research require implicit feature extraction through data preprocessing or explicit design of features.\nIn this work, we compare recent deep learning models on crop type classification on raw and preprocessed Sentinel 2 data. We concentrate on the common neural network architectures for time series, i.e., 1D-convolutions, recurrence, and the novel self-attention architecture. Our central findings are that data preprocessing still increased the overall classification performance for all models while the choice of model was less crucial. Self-attention and recurrent neural networks, by their architecture, outperformed convolutional neural networks on raw satellite time series. We explore this by a feature importance analysis based on gradient backpropagation that exploits the differentiable nature of deep learning models. Further, we qualitatively show how self-attention scores focus selectively on a few classification-relevant observations.","authors":["Marc Rußwurm","Marco Körner"],"meta":["November 2020ISPRS Journal of Photogrammetry and Remote Sensing 169(12):421-435","DOI:10.1016/j.isprsjprs.2020.06.006"],"references":["344263335_InceptionTime_Finding_AlexNet_for_time_series_classification","337513586_Time-Space_Tradeoff_in_Deep_Learning_Models_for_Crop_Classification_on_Satellite_Multi-Spectral_Image_Time_Series","337473722_Remote_Sensing_of_Environment_Current_status_of_Landsat_program_science_and_applications","332151578_A_new_fully_convolutional_neural_network_for_semantic_segmentation_of_polarimetric_SAR_imagery_in_complex_land_cover_ecosystem","332130701_Current_status_of_Landsat_program_science_and_applications","331525817_Temporal_Convolutional_Neural_Network_for_the_Classification_of_Satellite_Image_Time_Series","331474581_Deep_learning_for_time_series_classification_a_review","339440322_Hyperopt_A_Python_Library_for_Optimizing_the_Hyperparameters_of_Machine_Learning_Algorithms","333893412_Hyperparameter_tuning_and_performance_assessment_of_statistical_and_machine-learning_algorithms_using_spatial_data","331444947_DuPLO_A_DUal_view_Point_deep_Learning_architecture_for_time_series_classificatiOn"]}