{"id":"346236558_IT_education_as_a_factor_to_influence_gender_imbalances_in_computing_Comparing_Russian_and_American_experience","abstract":"Introduction. The problem of the relatively small number of women professionally employed in computing (computer science and information technology) is relevant throughout the world. Despite the fact that IT professionals are widely in demand, women in many countries, including theUSA andRussia, make up no more than a quarter of their total number, which requires explanation. One of the major reasons for this phenomenon, according to the authors, lies in the education system.\nThe aim of this article was to analyse the factors affecting gender imbalance in IT professions, by comparing two countries in which information technology has historically played an important role, and which are very different from each other in many ways – economic, political, educational system and others.\nResearch methodology. The present research is based on the comparison of data on IT education in schools and universities, and the degree of involvement of girls and women in computing in theUSA andRussia.\nResults. Both in theUSA and inRussia, gender imbalances in IT professions are formed largely in the field of education. Cultural stereotypes about computing as a male-dominated profession are produced by the media. Such stereotypes can discourage some girls and young women from studying computer science and also result in imbalance formation. The education system needs to increase the confidence of girls and young women in the possibilities of realising their abilities in the field of computer science and information technologies. Educational institutions should help to eliminate the negative attitude towards girls’ choice of IT professions.\nScientific novelty. For the first time, general factors in the field of education were identified that affect gender imbalances among IT professionals inRussia and theUSA – the countries with significantly different traditions and educational systems.\nPractical significance of the present work is to justify the conditions for improving school and university education to solve the problem of gender inequality in IT industry.","authors":["Evgeniy Khenner","C. Frieze","O. Zane"],"meta":["October 2020The Education and science journal 22(8):189-206","DOI:10.17853/1994-5639-2021-8-189-206"],"references":["334665084_The_Value_Orientations_System_of_Generation_Z_Social_Cultural_and_Demographic_Determinants","327869615_STEM_as_girls'_professional_choice_achievements_self-esteem_and_hidden_curriculum","340270184_Growth_of_Creative_Capital_and_Human_Perspectives_under_the_Conditions_of_Globalisation","336419737_How_the_Perception_of_Young_Malaysians_toward_Science_and_Mathematics_Influences_Their_Decision_to_Study_Computer_Science","334779116_Problematic_Internet_use_among_elementary_school_students_prevalence_and_risk_factors","332650191_Countering_the_negative_image_of_women_in_computing","331723968_INFORMATICS_IN_PRIMARY_SCHOOL_COMPARISON_OF_THE_RUSSIAN_EXPERIENCE_WITH_THE_MATERIALS_OF_THE_INTERNATIONAL_CHALLENGE_BEBRAS","330372764_Bimbos_and_Rambos_The_Cognitive_Basis_of_Gender_Stereotypes","329309109_Philosophical_analysis_of_information_and_communication_environment","323325166_RaceEthnic_Differences_in_Nonresident_Fathers'_Involvement_After_a_Nonmarital_Birth_Nonresident_Fathers'_Involvement_by_Race","319956582_Are_the_Fathers_Alright_A_Systematic_and_Critical_Review_of_Studies_on_Gay_and_Bisexual_Fatherhood","323151484_Paternal_incarceration_and_the_family_Fifteen_years_in_review","320090314_Longitudinal_Associations_Between_Mothers'_Perceptions_of_Nonresidential_Fathers'_Investment_of_Resources_and_Influence_in_Decision-Making","317250897_Life_satisfaction_A_key_to_managing_internet_social_media_addiction","315086280_Classical_Education_in_the_United_States"]}