{"id":"346283842_Analysis_of_Learning_Behavior_in_an_Automated_Programming_Assessment_Environment_A_Code_Quality_Perspective","abstract":"Automated programming assessment systems are useful tools to track the learning progress of students automatically and thereby reduce the workload of educators. They can also be used to gain insights into how students learn, making it easier to formulate strategies aimed at enhancing learning performance. Rather than functional code which is always inspected, code quality remains an essential aspect to which not many educators consider when designing an automated programming assessment system. In this study, we applied data mining techniques to analyze the results of an automated assessment system to reveal unexpressed patterns in code quality improvement that are predictive of final achievements in the course. Cluster analysis is first utilized to categorize students according to their learning behavior and outcomes. Cluster profile analysis is then leveraged to highlight actionable factors that could affect their final grades. Finally, the same factors are employed to construct a classification model by which to make early predictions of the students' final results. Our empirical results demonstrate the efficacy of the proposed scheme in providing valuable insights into the learning behaviors of students in novice programming courses, especially in code quality assurance, which could be used to enhance programming performance at the university level.","authors":["Hsi-Min Chen","Bao An Nguyen","Yi-Xiang Yan","Chyi-Ren Dow"],"meta":["January 2020IEEE Access 8:167341-167354","DOI:10.1109/ACCESS.2020.3024102"],"references":["327672729_An_automated_assessment_system_for_analysis_of_coding_convention_violations_in_Java_programming_assignments","341138185_The_Impact_of_Iterative_Assessment_System_on_Programming_Learning_Behavior","334583951_Predicting_learning_status_in_MOOCs_using_LSTM","327809322_Semi-automating_the_Marking_of_a_Java_Programming_Portfolio_Assessment_A_Case_Study_from_a_UK_Undergraduate_Programme_A_Manual_of_Practical_Approaches","327369997_Automatic_assessment_of_Java_code","326103860_The_Learning_Effectiveness_Analysis_of_JAVA_Programming_with_Automatic_Grading_System","325353157_Recursive_clustering_technique_for_students'_performance_evaluation_in_programming_courses","320088009_A_survey_on_educational_process_mining","319393380_Pro_Git","319132929_Investigating_Static_Analysis_Errors_in_Student_Java_Programs"]}