{"id":"346344310_Preprocessing_Improves_CNN_and_LSTM_in_Aspect-Based_Sentiment_Analysis_for_Vietnamese","abstract":"The deep learning method has achieved particularly good results in many application fields, such as computer vision, image processing, voice recognition, and signal processing. Recently, this method has also been used in the field of natural language processing and has achieved impressive results. In this field, the problem of categorizing subjective opinions which is an individual’s thinking or judgment of a product or an event or a cultural and social issue. Subjective opinions have received attention from many producers and businesses who are interested in exploiting the opinions of the community and scientists. This paper experiments with the deep learning model convolution neural network (CNN), long short-term memory (LSTM), and the boxed model of CNN and LSTM. Training data sets comprise reviews of cars in Vietnamese. Cars are objects with a significant number of specifications that are provided in user reviews. The Vietnamese opinion set is preprocessed according to the method of aspect analysis based on an ontology of semantic and sentimental approaches. A Vietnamese corpus experiment with CNN, LSTM, and CNN + LSTM models are used to evaluate the effectiveness of the data preprocessing method that was used in this paper. To assess the validity of the test models with the Vietnamese opinion set, the paper also tests the sentiment classification with the English Sentence Collection Stanford Sentiment Treebank (SST).","authors":["Duy Ngoc Nguyen","Tuoi Phan Thi","Phuc Do"],"meta":["January 2021","DOI:10.1007/978-981-15-5856-6_17","In book: Proceedings of Fifth International Congress on Information and Communication Technology (pp.175-185)"],"references":["332152884_A_Data_Preprocessing_Method_to_Classify_and_Summarize_Aspect-Based_Opinions_Using_Deep_Learning","321259272_Multi-channel_LSTM-CNN_model_for_Vietnamese_sentiment_analysis","317240996_The_Importance_of_Automatic_Syntactic_Features_in_Vietnamese_Named_Entity_Recognition","322694910_Deep_Learning_for_Sentiment_Analysis_A_Survey","304143054_Mining_Opinion_Summarizations_Using_Convolutional_Neural_Networks_in_Chinese_Microblogging_Systems","303354063_Aspect-based_Sentiment_Summarization_with_Deep_Neural_Networks","284039049_Recursive_deep_models_for_semantic_compositionality_over_a_sentiment_treebank","278744214_Opinion_Mining_and_Information_Fusion_A_Survey","265052545_Convolutional_Neural_Networks_for_Sentence_Classification","261475541_A_Convolutional_Neural_Network_for_Modelling_Sentences"]}