{"id":"346380789_COVID-CheXNet_hybrid_deep_learning_framework_for_identifying_COVID-19_virus_in_chest_X-rays_images","abstract":"The outbreaks of Coronavirus (COVID-19) epidemic have increased the pressure on healthcare and medical systems worldwide. The timely diagnosis of infected patients is a critical step to limit the spread of the COVID-19 epidemic. The chest radiography imaging has shown to be an effective screening technique in diagnosing the COVID-19 epidemic. To reduce the pressure on radiologists and control of the epidemic, fast and accurate a hybrid deep learning framework for diagnosing COVID-19 virus in chest X-ray images is developed and termed as the COVID-CheXNet system. First, the contrast of the X-ray image was enhanced and the noise level was reduced using the contrast-limited adaptive histogram equalization and Butterworth bandpass filter, respectively. This was followed by fusing the results obtained from two different pre-trained deep learning models based on the incorporation of a ResNet34 and high-resolution network model trained using a large-scale dataset. Herein, the parallel architecture was considered, which provides radiologists with a high degree of confidence to discriminate between the healthy and COVID-19 infected people. The proposed COVID-CheXNet system has managed to correctly and accurately diagnose the COVID-19 patients with a detection accuracy rate of 99.99%, sensitivity of 99.98%, specificity of 100%, precision of 100%, F1-score of 99.99%, MSE of 0.011%, and RMSE of 0.012% using the weighted sum rule at the score-level. The efficiency and usefulness of the proposed COVID-CheXNet system are established along with the possibility of using it in real clinical centers for fast diagnosis and treatment supplement, with less than 2 s per image to get the prediction result.","authors":["Alaa S. Al-Waisy","Shumoos Al-Fahdawi","Mazin Abed Mohammed","Karrar Hameed Abdulkareem"],"meta":["November 2020Soft Computing","DOI:10.1007/s00500-020-05424-3","Projects: Covid-19 (Research, Data, Solutions, Certifications)Improving COVID-19 Detection in the Chest Radiography Images using Deep Learning Approaches"],"references":["351445526_Automatic_detection_of_coronavirus_disease_COVID-19_using_X-ray_images_and_deep_convolutional_neural_networks","346521704_COVID-Net_a_tailored_deep_convolutional_neural_network_design_for_detection_of_COVID-19_cases_from_chest_X-ray_images","343953140_Early_diagnosis_of_COVID-19-affected_patients_based_on_X-ray_and_computed_tomography_images_using_deep_learning_algorithm","341504617_Benchmarking_Methodology_for_Selection_of_Optimal_COVID-19_Diagnostic_Model_Based_on_Entropy_and_TOPSIS_Methods","340883347_Detection_of_coronavirus_Disease_COVID-19_based_on_Deep_Features_and_Support_Vector_Machine","343843916_Forecasting_of_COVID-19_Time_Series_for_Countries_in_the_World_based_on_a_Hybrid_Approach_Combining_the_Fractal_Dimension_and_Fuzzy_Logic","343466302_HigherHRNet_Scale-Aware_Representation_Learning_for_Bottom-Up_Human_Pose_Estimation","341557346_Analysis_of_Spatial_Spread_Relationships_of_Coronavirus_COVID-19_Pandemic_in_the_World_using_Self_Organizing_Maps","340935440_Automated_Detection_of_COVID-19_Cases_Using_Deep_Neural_Networks_with_X-ray_Images","340371326_Deep_High-Resolution_Representation_Learning_for_Visual_Recognition"]}