{"id":"346343554_MOBILE_LEARNING_IN_HIGHER_EDUCATION","abstract":"Mobile learning (m-learning) environments provides a wide range of new and exciting learning opportunities supported by the wireless technology. This paper discuss the role of m-learning in the new educational setting which creates student-centered learning and educational practice, offering new more flexible learning methods for higher education. In the digital 21st century learning and educational processes are integrated with new information and communication technologies (ICTs) in the education system. This new m-learning technology has fascinated the interest of researchers, educators and companies developing learning system and instructional materials. M- Learning facilitates a new mechanism of teaching and learning process in order to enhance the learning and education experience of the students. The use of mobile devices and wireless technology in the new learning environments allows students to achieve more in their educational process. The students will be enthusiastic about the new learning options provided by the mobile technologies. The m- learning environment will provide new study opportunities for the students which strengthen the flexibility of being able to study at any time and any place.","authors":["Ligi B","William Dharma Raja B."],"meta":["April 2017International Journal of Research - GRANTHAALAYAH 5(4(SE)):1-6","DOI:10.29121/granthaalayah.v5.i4(SE).2017.1942"],"references":["288966917_Evaluation_of_Handheld_Devices_for_Mobile_Learning","228341065_The_media_generation_Maximise_learning_by_getting_mobile","26468174_The_Growth_of_m-Learning_and_the_Growth_of_Mobile_Computing_Parallel_developments","242527363_Online_communities_designing_usability_and_supporting_sociability","228796353_Integrating_a_multi-agent_recommendation_system_into_a_Mobile_Learning_Management_System","227603662_M-Learning_An_experiment_in_using_SMS_to_support_learning_new_English_language_words","223929280_Using_RSS_to_support_mobile_learning_based_on_media_richness_theory","31595877_Workers_on_the_Move_New_Opportunities_through_Mobile_Commerce"]}