{"id":"346470543_On_Three_Constructions_of_Nanotori","abstract":"There are three different approaches for constructing nanotori in the literature: one with three parameters suggested by Altshuler, another with four parameters used mostly in chemistry and physics after the discovery of fullerene molecules, and one with three parameters used in interconnecting networks of computer science known under the name generalized honeycomb tori. Altshuler showed that his method gives all non-isomorphic nanotori, but this was not known for the other two constructions. Here, we show that these three approaches are equivalent and give explicit formulas that convert parameters of one construction into the parameters of the other two constructions. As a consequence, we obtain that the other two approaches also construct all nanotori. The four parameters construction is mainly used in chemistry and physics to describe carbon nanotori molecules. Some properties of the nanotori can be predicted from these four parameters. We characterize when two different quadruples define isomorphic nanotori. Even more, we give an explicit form of all isomorphic nanotori (defined with four parameters). As a consequence, infinitely many 4-tuples correspond to each nanotorus; this is due to redundancy of having an “extra” parameter, which is not a case with the other two constructions. This result significantly narrows the realm of search of the molecule with desired properties. The equivalence of these three constructions can be used for evaluating different graph measures as topological indices, etc.","authors":["Vesna Andova","Pavel Dimovski","Martin Knor","Riste Škrekovski"],"meta":["November 2020","DOI:10.3390/math8112036"],"references":["333636133_A_Review_of_Geometry_Construction_and_Modelling_for_Carbon_Nanotori","325929207_Distance_based_indices_in_nanotubical_graphs_part_2","325324525_Distance_based_indices_in_nanotubical_graphs_part_1","302964596_Distances_on_nanotubical_structures","271661110_Curved_carbon_nanotubes_From_unique_geometries_to_novel_properties_and_peculiar_applications","266995242_Embedded_systems_handbook_Embedded_systems_design_and_verification_2nd_ed","260908552_Symmetries_of_Equivelar_4-Toroids","253949610_Electronic_properties_of_carbon_toroids","248831601_Construction_and_enumeration_of_regular_maps_on_the_torus","242789382_Hamiltonian_circuits_in_some_maps_on_the_torus"]}