{"id":"346450528_Generic_Body_Expression_Recognition_Based_on_Synthesis_of_Realistic_Neutral_Motion","abstract":"Most automatic expression analysis systems attempt to recognize a conventional set of expressions such as happiness, sadness, anger, surprise and fear, etc. Although this set of expressions is the most typical of the face, it is not the most representative/relevant for what the body expressions tell us. This paper presents a novel and generic approach for the recognition of body expressions using human postures. Our method is based on the notion of neutral motion generated from a given expressive one. In a second time, we estimate a residue function, as the difference between the two associated motions, namely the expressive and the neutral motion. More precisely, this function that is inspired by studies from psychology domain, gives a “neutrality” score of a motion. Using this “neutrality score”, we propose a cost function which enables to synthesis the neutral motion from any input expressive motion. The synthesis of neutral motion process is based on two nested Principal Component Analysis providing a space where moving and selecting realistic human animations become possible. Proposed approach is evaluated on four databases with heterogeneous movements and body expressions and it achieved recognition results for body expression recognition that exceed state of the art.","authors":["Arthur Crenn","Alexandre Meyer","Hubert Konik","Rizwan Ahmed Khan"],"meta":["January 2020IEEE Access 8","DOI:10.1109/ACCESS.2020.3038473"],"references":["345473175_Survey_on_AI-Based_Multimodal_Methods_for_Emotion_Detection","342541468_STEP_Spatial_Temporal_Graph_Convolutional_Networks_for_Emotion_Perception_from_Gaits","339411137_Emotion_Recognition_Using_Feature-level_Fusion_of_Facial_Expressions_and_Body_Gestures","337154714_A_Review_of_Accelerometer_Sensor_and_Gyroscope_Sensor_in_IMU_Sensors_on_Motion_Capture","334640513_Fusing_Body_Posture_With_Facial_Expressions_for_Joint_Recognition_of_Affect_in_Child-Robot_Interaction","332547158_A_novel_database_of_children's_spontaneous_facial_expressions_LIRIS-CSE","335873729_EVA_Generating_Emotional_Behavior_of_Virtual_Agents_using_Expressive_Features_of_Gait_and_Gaze","335764933_Hierarchical_Posture_Representation_for_Robust_Action_Recognition","334526467_OpenPose_Realtime_Multi-Person_2D_Pose_Estimation_Using_Part_Affinity_Fields","333973458_A_Comparative_Review_of_Recent_Kinect-Based_Action_Recognition_Algorithms"]}