{"id":"346491984_Ideological_and_Political_Teaching_Reform_of_Computer_Network_Course_Based_on_Thinking_Innovation","abstract":"With the continuous development of computer technology, in the teaching of computer network courses, colleges and universities must constantly change the way of thinking, actively use scientific thinking and innovative ways, update the teaching content of computer network courses, continuously improve the relevant teaching system and break through the traditional Teaching restrictions. The purpose of this article is to study the reform direction and research direction of ideological and political teaching of computer network courses under innovative ideas. This article takes computer science students from the Polytechnic University as the research object, and conducts investigation and research on the basis of relevant practical ideological and political teaching background and theory. The reform method and strategy of ideological and political teaching in computer network courses, on this basis, put forward the reform path and development direction of ideological and political teaching in network courses. The experimental results show that in the era of \"mass entrepreneurship and large-scale innovation\", it is necessary to reform the teaching content and methods of computer network courses on the basis of cultivating students’ innovative practical ability, in order to achieve a seamless connection between the two and integrate ideology and politics Under the computer network teaching model.","authors":["Jia Zhou"],"meta":["October 2020Journal of Physics Conference Series 1648(4):042112","DOI:10.1088/1742-6596/1648/4/042112"],"references":["338213112_Social_Media_among_the_Wireless_Technology_Generation","335891104_Using_scaffold_innovation-thinking_frameworks_to_integrate_food_science_and_technology_into_the_transdisciplinary_engineering_design_classroom","333556336_Implementation_competency_based_learning_model_of_learning_computer_network_courses_at_vocational_education","327065586_On_the_Efficiency_of_Online_Social_Learning_Networks","326453662_A_semantic_network_model_for_measuring_engagement_and_performance_in_online_learning_platforms","325653628_Predicting_Student_Academic_Performance_in_Computer_Science_Courses_A_Comparison_of_Neural_Network_Models","325580511_Using_Bayesian_networks_for_learning_analytics_in_engineering_education_A_case_study_on_computer_science_dropout_at_UCLM","324270812_Matthew_L_Jones_Reckoning_with_Matter_Calculating_Machines_Innovation_and_Thinking_about_Thinking_from_Pascal_to_Babbage","269358757_Teaching_Reform_of_Microcomputer_Principle_and_Interface_Technology"]}