{"id":"346485924_CCAligned_A_Massive_Collection_of_Cross-Lingual_Web-Document_Pairs","abstract":"Cross-lingual document alignment aims to identify pairs of documents in two distinct languages that are of comparable content or translations of each other. In this paper, we exploit the signals embedded in URLs to label web documents at scale with an average precision of 94.5% across different language pairs. We mine sixty-eight snapshots of the Common Crawl corpus and identify web document pairs that are translations of each other. We release a new web dataset consisting of over 392 million URL pairs from Common Crawl covering documents in 8144 language pairs of which 137 pairs include English. In addition to curating this massive dataset, we introduce baseline methods that leverage cross-lingual representations to identify aligned documents based on their textual content. Finally, we demonstrate the value of this parallel documents dataset through a downstream task of mining parallel sentences and measuring the quality of machine translations from models trained on this mined data. Our objective in releasing this dataset is to foster new research in cross-lingual NLP across a variety of low, medium, and high-resource languages.","authors":["Ahmed El-Kishky","Vishrav Chaudhary","Francisco Javier Guzman","Philipp Koehn"],"meta":["November 2020","DOI:10.18653/v1/2020.emnlp-main.480","Conference: Empirical Methods in Natural Language Processing"],"references":["335764474_Massively_Multilingual_Sentence_Embeddings_for_Zero-Shot_Cross-Lingual_Transfer_and_Beyond","336997923_The_FLORES_Evaluation_Datasets_for_Low-Resource_Machine_Translation_Nepali-English_and_Sinhala-English","335779742_Findings_of_the_WMT_2019_Shared_Task_on_Parallel_Corpus_Filtering_for_Low-Resource_Conditions","335779728_Low-Resource_Corpus_Filtering_Using_Multilingual_Sentence_Embeddings","335778699_Hierarchical_Document_Encoder_for_Parallel_Corpus_Mining","334600392_fairseq_A_Fast_Extensible_Toolkit_for_Sequence_Modeling","334118956_SentencePiece_A_simple_and_language_independent_subword_tokenizer_and_detokenizer_for_Neural_Text_Processing","334118181_Findings_of_the_WMT_2018_Shared_Task_on_Parallel_Corpus_Filtering","334116134_Filtering_and_Mining_Parallel_Data_in_a_Joint_Multilingual_Space","325445846_When_and_Why_Are_Pre-Trained_Word_Embeddings_Useful_for_Neural_Machine_Translation"]}