{"id":"346454975_Compassionate_Flexibility_and_Self-Discipline_Student_Adaptation_to_Emergency_Remote_Teaching_in_an_Integrated_Engineering_Energy_Course_during_COVID-19","abstract":"The global pandemic of COVID-19 brought about the transition to Emergency Remote Teaching (ERT) at higher education institutions across the United States, prompting both students and the faculty to rapidly adjust to a different modality of teaching and learning. Other crises have induced disruptions to academic continuity (e.g., earthquakes, hurricanes), but not to the same extent as COVID-19, which has affected universities on a global scale. In this paper, we describe a qualitative case study where we interviewed 11 second-year Integrated Engineering students during the Spring 2020 semester to explore how they adapted to the transition to remote learning. Our results revealed several student challenges, how they used self-discipline strategies to overcome them, and how the faculty supported students in the classroom through a compassionate and flexible pedagogy. Faculty members showed compassion and flexibility by adjusting the curriculum and assessment and effectively communicating with students. This was especially important for the women participants in this study, who more frequently expressed utilizing pass/fail grading and the personal and gendered challenges they faced due to the pandemic. During this unprecedented crisis, we found that a key element for supporting students’ well-being and success is the faculty members communicating care and incorporating flexibility into their courses.","authors":["Laura A. Gelles","Susan M Lord","Gordon Hoople","Diana Ann Chen"],"meta":["October 2020Education Sciences 10(11):304","DOI:10.3390/educsci10110304"],"references":["346641383_An_Integrated_Approach_to_Energy_Education_in_Engineering","343553453_Reimagining_higher_education_during_and_post-COVID-19_Challenges_and_opportunities","341978272_The_phenomenon_of_learning_at_a_distance_through_emergency_remote_teaching_amidst_the_pandemic_crisis","341841885_US_Faculty_and_Administrators'_Experiences_and_Approaches_in_the_Early_Weeks_of_the_COVID-19_Pandemic","341043562_Emergency_remote_teaching_in_a_time_of_global_crisis_due_to_CoronaVirus_pandemic","347372983_Investigating_using_a_Social_Impact_Audit_Tool_to_support_students'_decision-making_in_a_Materials_Science_Course","346394184_Broadening_the_Engineering_Canon","344697968_Developing_Changemaking_Engineers_-_Year_Five","344697382_The_Final_Straw_Incorporating_Accessibility_and_Sustainability_Considerations_into_Material_Selection_Decisions","341574831_Drones_for_Good_How_to_Bring_Sociotechnical_Thinking_into_the_Classroom"]}