{"id":"346461730_How_the_forest_interacts_with_the_trees_Multiscale_shape_integration_explains_global_and_local_processing","abstract":"Hierarchical stimuli have been widely used to study global and local processing. Two classic phenomena have been observed using these stimuli: the global advantage effect (we identify the global shape faster) and an interference effect (we identify shape slower when the global and local shapes are different). Because these phenomena have been observed during shape categorization tasks, it is unclear whether they reflect the categorical judgment or the underlying shape representation. Understanding the underlying shape representation is also critical because both global and local processing are modulated by stimulus properties. We performed two experiments to investigate these issues. In Experiment 1, we show that these phenomena can be observed in a same-different task, and that participants show systematic variation in response times across image pairs. We show that the response times to any pair of images can be accurately predicted using two factors: their dissimilarity and their distinctiveness relative to other images. In Experiment 2, we show that these phenomena can also be observed in a visual search task where participant did not have to make any categorical shape judgments. Here too, participants showed highly systematic variations in response time that could be explained as a linear sum of shape comparisons across global and local scales. Finally, the dissimilarity and distinctiveness factors estimated from the same-different task were systematically related to the search dissimilarities observed during visual search. In sum, our results show that global and local processing phenomena are properties of a systematic shape representation governed by simple rules.","authors":["Georgin Jacob","Sp Arun"],"meta":["October 2020Journal of Vision 20(10):20","DOI:10.1167/jov.20.10.20"],"references":["333177863_Behavioral_oscillation_in_globallocal_processing_Global_alpha_oscillations_mediate_global_precedence_effect","323894113_Global_precedence_effects_account_for_individual_differences_in_both_face_and_object_recognition_performance","322367576_Navon's_classical_paradigm_concerning_local_and_global_processing_relates_systematically_to_visual_object_classification_performance","321690033_Symmetric_Objects_Become_Special_in_Perception_Because_of_Generic_Computations_in_Neurons","321636801_A_different_vision_of_dyslexia_Local_precedence_on_global_perception","311449616_Look_before_you_seek_Preview_adds_a_fixed_benefit_to_all_searches","297891174_Object_attributes_combine_additively_in_visual_search","281887778_Fitdistrplus_An_R_Package_for_Fitting_Distributions","308300968_Modern_Applied_Statistics_with_S","281345608_Ggplot2_Elegant_Graphics_for_Data_Analysis"]}