{"id":"346430409_Cyberbullying_severity_detection_A_machine_learning_approach","abstract":"With widespread usage of online social networks and its popularity, social networking platforms have given us incalculable opportunities than ever before, and its benefits are undeniable. Despite benefits, people may be humiliated, insulted, bullied, and harassed by anonymous users, strangers, or peers. In this study, we have proposed a cyberbullying detection framework to generate features from Twitter content by leveraging a pointwise mutual information technique. Based on these features, we developed a supervised machine learning solution for cyberbullying detection and multi-class categorization of its severity in Twitter. In the study we applied Embedding, Sentiment, and Lexicon features along with PMI-semantic orientation. Extracted features were applied with Naïve Bayes, KNN, Decision Tree, Random Forest, and Support Vector Machine algorithms. Results from experiments with our proposed framework in a multi-class setting are promising both with respect to Kappa, classifier accuracy and f-measure metrics, as well as in a binary setting. These results indicate that our proposed framework provides a feasible solution to detect cyberbullying behavior and its severity in online social networks. Finally, we compared the results of proposed and baseline features with other machine learning algorithms. Findings of the comparison indicate the significance of the proposed features in cyberbullying detection.","authors":["Bandeh Ali","Declan O’Sullivan"],"meta":["October 2020PLoS ONE 15(10):e0240924","DOI:10.1371/journal.pone.0240924"],"references":["333878190_AffectiveTweets_a_Weka_Package_for_Analyzing_Affect_in_Tweets","333301050_Predicting_Cyberbullying_on_Social_Media_in_the_Big_Data_Era_Using_Machine_Learning_Algorithms_Review_of_Literature_and_Open_Challenges","332463886_Text_Classification_Algorithms_A_Survey","332214459_Cyberbullying_Across_the_Lifespan_of_Education_Issues_and_Interventions_from_School_to_University","328150935_Automatic_Detection_of_Cyberbullying_in_Social_Media_Text","350890513_Generative_Deep_Learning_-_Teaching_Machines_to_Paint_Write_Compose_and_Play","345626486_Emerging_Technologies_in_Data_Mining_and_Information_Security_Proceedings_of_IEMIS_2018_Volume_3_Proceedings_of_IEMIS_2018_Volume_3","331416323_Classifying_Biomedical_Figures_by_Modality_via_Multi-Label_Learning","329602287_Automatic_cyberbullying_detection_A_systematic_review","325516717_Novel_Approach_to_Predict_Hospital_Readmissions_Using_Feature_Selection_from_Unstructured_Data_with_Class_Imbalance"]}