{"id":"346400477_Multi-year_ocean_thermal_variability","abstract":"Numerous indicators show that multi-annual and longer oceanic baroclinic variability retains a complicated spatial structure out to decades and longer. With time-averaging, the sub-basin scales connected to abyssal topography and meteorological structures emerge in the fields. Here, using 26-years of an oceanic state estimate (ECCO), an attempt is made to extract simpler patterns from the vertical average (whole water column) annual mean temperature anomalies and, separately, the vertical structures at each horizontal position. Singular vectors (SVs)/empirical orthogonal functions (EOFs) successfully simplify vertical and horizontal fields, but principal observation patterns (POPs) do not do so. About 3 horizontal spatial patterns account for more than 95% of the interannual and longer variances. A breakdown of the purely vertical structure at each grid point leads in contrast to an intricate variability with depth. Results have implications both for future sampling strategies, and for estimates, e.g. of the accuracy of any mean oceanic scalar.","authors":["Carl Wunsch"],"meta":["January 2020Tellus 72(1):1-15","DOI:10.1080/16000870.2020.1824485"],"references":["337657880_Measuring_Global_Ocean_Heat_Content_to_Estimate_Earth's_Energy_Imbalance","335335776_Measuring_Global_Ocean_Heat_Content_to_Estimate_the_Earth_Energy_Imbalance","334817896_The_Thermohaline_Modes_of_the_Global_Ocean","334527012_Correcting_datasets_leads_to_more_homogeneous_early-twentieth-century_sea_surface_warming","331725082_Unsupervised_Learning_Reveals_Geography_of_Global_Ocean_Dynamical_Regions","330216870_Global_reconstruction_of_historical_ocean_heat_storage_and_transport","325573200_Towards_determining_uncertainties_in_global_oceanic_mean_values_of_heat_salt_and_surface_elevation","331714169_Ocean_Circulation_in_Three_Dimensions","331707224_Ocean_Circulation_in_Three_Dimensions","330139107_The_Little_Ice_Age_and_20th-century_deep_Pacific_cooling"]}