{"id":"346439243_Missing_links_as_a_source_of_seemingly_variable_constants_in_complex_reaction_networks","abstract":"A major challenge in network science is to determine parameters governing complex network dynamics from experimental observations and theoretical models. In complex chemical reaction networks, for example, such as those describing processes in internal combustion engines and power generators, rate constant estimates vary significantly across studies despite substantial experimental efforts. Here, we examine the possibility that variability in measured constants can be largely attributed to the impact of missing network information on parameter estimation. Through the numerical simulation of measurements in incomplete chemical reaction networks, we show that unaccountability of network links presumed unimportant (with local sensitivity amounting to less than two percent of that of a measured link) can create apparent rate constant variations as large as one order of magnitude even if no experimental errors are present in the data. Furthermore, the correlation coefficient between the logarithmic deviation of the rate constant estimate and the cumulative relative sensitivity of the neglected reactions was less than 0.5 in all cases. Thus, for dynamical processes on complex networks, iteratively expanding a model by determining new parameters from data collected under specific conditions is unlikely to produce reliable results.","authors":["Zachary G. Nicolaou","Adilson E Motter"],"meta":["October 2020Physical Review Research 2(4)","DOI:10.1103/PhysRevResearch.2.043135"],"references":["328325494_Reconstructing_Networks_with_Unknown_and_Heterogeneous_Errors","327917472_Identifying_critical_edges_in_complex_networks","324166942_Link_prediction_via_linear_optimization","321783656_Model-free_inference_of_direct_network_interactions_from_nonlinear_collective_dynamics","318336988_Transition_to_Reconstructibility_in_Weakly_Coupled_Networks","308043637_Network_Structure_Metadata_and_the_Prediction_of_Missing_Nodes_and_Annotations","344140124_Stacking_models_for_nearly_optimal_link_prediction_in_complex_networks","321914599_Using_Modern_Methods_for_Missing_Data_Analysis_with_the_Social_Relations_Model_A_Bridge_to_Social_Network_Analysis","313467123_Ignition_in_an_Atomistic_Model_of_Hydrogen_Oxidation","304804035_Detailed_kinetic_mechanism_of_gas-phase_reactions_of_volatiles_released_from_biomass_pyrolysis"]}