{"id":"346416340_From_Affect_to_Action_Choices_in_Attending_to_Disconcertment_in_Interdisciplinary_Collaborations","abstract":"Reports from integrative researchers who have followed calls for socio- technical integration emphasize that the potential of interdisciplinary col- laboration to inflect the social shaping of technoscience is often constrained by their liminal position. Integrative researchers tend to be positioned as either adversarial outsiders or co-opted insiders. In an attempt to navigate these dynamics, we show that attending to affective disturbances can open up possibilities for productive engagements across disciplinary divides. Drawing on the work of Helen Verran, we analyze “disconcertment” in three sociotechnical integration research studies. We develop a heuristic that weaves together disconcertment, affective labor, and responsivity to analyze the role of the body in interdisciplinary collaborations. We draw out how bodies do affective labor when generating responsivity between collaborators in moments of disconcertment. Responsive bodies can function as sensors, sources, and processors of disconcerting experiences of difference. We further show how attending to disconcertment can stimulate methodological choices to recognize, amplify, or minimize the difference between collaborators. Although these choices are context- dependent, each one examined generates responsivity that supports col- laborators to readjust the technical in terms of the social. This analysis contributes to science and technology studies scholarship on the role of affect in successes and failures of interdisciplinary collaboration.","authors":["Mareike Smolka","Erik Fisher","Alexandra Hausstein"],"meta":["November 2020Science, Technology & Human Values 46(1)","DOI:10.1177/0162243920974088"],"references":["341405173_Affect_and_Effect_in_Interdisciplinary_Research_Collaboration","340392768_Emotions_values_and_technology_illuminating_the_blind_spots","338923145_Generative_Critique_in_Interdisciplinary_Collaborations_From_Critique_in_and_of_the_Neurosciences_to_Socio-Technical_Integration_Research_as_a_Practice_of_Critique_in_RRI","332675560_Ethics_as_a_rare_bird_a_challenge_for_situated_studies_of_ethics_in_the_engineering_lab","351966197_Forced_to_Care_Coercion_and_Caregiving_in_America","351532663_Meeting_the_Universe_Halfway_Quantum_Physics_and_the_Entanglement_of_Matter_and_Meaning","346485115_The_Feeling_Body_Affective_Science_Meets_the_Enactive_Mind","345963560_Rendering_Life_Molecular_Models_Modelers_and_Excitable_Matter","343510420_The_Intimate_Economies_of_Bangkok_Tomboys_Tycoons_and_Avon_Ladies_in_the_Global_City","336859013_Questioning_Interdisciplinarity_What_Roles_for_Laboratory_Based_Social_Science"]}