{"id":"346418917_Coronavirus_contact_tracing_evaluating_the_potential_of_using_bluetooth_received_signal_strength_for_proximity_detection","abstract":"Many countries are deploying Covid-19 contact tracing apps that use Bluetooth Low Energy (LE) to detect proximity within 2m for 15 minutes. However, Bluetooth LE is an unproven technology for this application, raising concerns about the efficacy of these apps. Indeed, measurements indicate that the Bluetooth LE received signal strength can be strongly affected by factors including (i) the model of handset used, (ii) the relative orientation of handsets, (iii) absorption by human bodies, bags etc. and (iv) radio wave reflection from walls, floors, furniture. The impact on received signal strength is comparable with that caused by moving 2m, and so has the potential to seriously affect the reliability of proximity detection. These effects are due the physics of radio propagation and suggest that the development of accurate methods for proximity detection based on Bluetooth LE received signal strength is likely to be challenging. We call for action in three areas. Firstly, measurements are needed that allow the added value of deployed apps within the overall contact tracing system to be evaluated, e.g. data on how many of the people notified by the app would not have been found by manual contact tracing and what fraction of people notified by an app actually test positive for Covid-19. Secondly, the 2m/15 minute proximity limit is only a rough guideline. The real requirement is to use handset sensing to evaluate infection risk and this requires a campaign to collect measurements of both handset sensor data and infection outcomes. Thirdly, a concerted effort is needed to collect controlled Bluetooth LE measurements in a wide range of real-world environments, the data reported here being only a first step in that direction.","authors":["Douglas J. Leith","Stephen Farrell"],"meta":["October 2020ACM SIGCOMM Computer Communication Review 50(4):66-74","DOI:10.1145/3431832.3431840"],"references":["313530032_A_Study_of_Bluetooth_Low_Energy_Performance_for_Human_Proximity_Detection_in_the_Workplace","260800796_Face-to-Face_Proximity_EstimationUsing_Bluetooth_On_Smartphones","339909187_Quantifying_dynamics_of_SARS-CoV-2_transmission_suggests_that_epidemic_control_and_avoidance_is_feasible_through_instantaneous_digital_contact_tracing","336766070_Finding_Dory_in_the_Crowd_Detecting_Social_Interactions_using_Multi-Modal_Mobile_Sensing","330644662_A_Smartphone_Magnetometer-Based_Diagnostic_Test_for_Automatic_Contact_Tracing_in_Infectious_Disease_Epidemics","321231997_Locating_and_Tracking_BLE_Beacons_with_Smartphones","254007063_FluPhone_study_virtual_disease_spread_using_haggle"]}