{"id":"346537616_On-the-fly_closed-loop_materials_discovery_via_Bayesian_active_learning","abstract":"Active learning—the field of machine learning (ML) dedicated to optimal experiment design—has played a part in science as far back as the 18th century when Laplace used it to guide his discovery of celestial mechanics. In this work, we focus a closed-loop, active learning-driven autonomous system on another major challenge, the discovery of advanced materials against the exceedingly complex synthesis-processes-structure-property landscape. We demonstrate an autonomous materials discovery methodology for functional inorganic compounds which allow scientists to fail smarter, learn faster, and spend less resources in their studies, while simultaneously improving trust in scientific results and machine learning tools. This robot science enables science-over-the-network, reducing the economic impact of scientists being physically separated from their labs. The real-time closed-loop, autonomous system for materials exploration and optimization (CAMEO) is implemented at the synchrotron beamline to accelerate the interconnected tasks of phase mapping and property optimization, with each cycle taking seconds to minutes. We also demonstrate an embodiment of human-machine interaction, where human-in-the-loop is called to play a contributing role within each cycle. This work has resulted in the discovery of a novel epitaxial nanocomposite phase-change memory material.","authors":["A. Gilad Kusne","Heshan Yu","Changming Wu","Huairuo Zhang"],"meta":["November 2020Nature Communications 11(1)","DOI:10.1038/s41467-020-19597-w"],"references":["342790679_A_mobile_robotic_chemist","341363092_Accelerated_discovery_of_CO2_electrocatalysts_using_active_machine_learning","341361505_Self-driving_laboratory_for_accelerated_discovery_of_thin-film_materials","339369285_Closed-loop_optimization_of_fast-charging_protocols_for_batteries_with_machine_learning","339219329_Beyond_Ternary_OPV_High-Throughput_Experimentation_and_Self-Driving_Laboratories_Optimize_Multicomponent_Systems","335954194_Progress_and_prospects_for_accelerating_materials_science_with_automated_and_autonomous_workflows","342955097_Chapter_18_Autonomous_Science_Big_Data_Tools_for_Small_Data_Problems_in_Chemistry","341920545_Robot-Accelerated_Perovskite_Investigation_and_Discovery","340113574_Human-Centered_Artificial_Intelligence_Reliable_Safe_Trustworthy","336066964_Autonomous_Discovery_in_the_Chemical_Sciences_Part_I_Progress"]}