{"id":"346534711_Accuracy_and_efficiency_of_germline_variant_calling_pipelines_for_human_genome_data","abstract":"Advances in next-generation sequencing technology have enabled whole genome sequencing (WGS) to be widely used for identification of causal variants in a spectrum of genetic-related disorders, and provided new insight into how genetic polymorphisms affect disease phenotypes. The development of different bioinformatics pipelines has continuously improved the variant analysis of WGS data. However, there is a necessity for a systematic performance comparison of these pipelines to provide guidance on the application of WGS-based scientific and clinical genomics. In this study, we evaluated the performance of three variant calling pipelines (GATK, DRAGEN and DeepVariant) using the Genome in a Bottle Consortium, “synthetic-diploid” and simulated WGS datasets. DRAGEN and DeepVariant show better accuracy in SNP and indel calling, with no significant differences in their F1-score. DRAGEN platform offers accuracy, flexibility and a highly-efficient execution speed, and therefore superior performance in the analysis of WGS data on a large scale. The combination of DRAGEN and DeepVariant also suggests a good balance of accuracy and efficiency as an alternative solution for germline variant detection in further applications. Our results facilitate the standardization of benchmarking analysis of bioinformatics pipelines for reliable variant detection, which is critical in genetics-based medical research and clinical applications.","authors":["Sen Zhao","Oleg Agafonov","Abdulrahman Alaa Azab","Tomasz Stokowy"],"meta":["November 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-77218-4"],"references":["336218718_An_open_resource_for_accurately_benchmarking_small_variant_and_reference_calls","334075679_Systematic_comparison_of_germline_variant_calling_pipelines_cross_multiple_next-generation_sequencers","333242100_Benchmarking_workflows_to_assess_performance_and_suitability_of_germline_variant_calling_pipelines_in_clinical_diagnostic_assays","332049803_Systematic_benchmarking_of_omics_computational_tools","331660468_Best_practices_for_benchmarking_germline_small-variant_calls_in_human_genomes","331452076_Comparative_analysis_of_whole-genome_sequencing_pipelines_to_minimize_false_negative_findings","331029542_Empirical_evaluation_of_variant_calling_accuracy_using_ultra-deep_whole-genome_sequencing_data","329533078_Comparison_of_three_variant_callers_for_human_whole_genome_sequencing","327851139_A_universal_SNP_and_small-indel_variant_caller_using_deep_neural_networks","326424651_A_synthetic-diploid_benchmark_for_accurate_variant-calling_evaluation"]}