{"id":"346575024_Cohort_profile_CROSS-TRACKS_a_population-based_open_cohort_across_healthcare_sectors_in_Denmark","abstract":"Purpose\nThis paper describes the open cohort CROSS-TRACKS, which comprises population-based data from primary care, secondary care and national registries to study patient pathways and transitions across sectors while adjusting for sociodemographic characteristics.\n\nParticipants\nA total of 221 283 individuals resided in the four Danish municipalities that constituted the catchment area of Horsens Regional Hospital in 2012–2018. A total of 96% of the population used primary care, 35% received at least one transfer payment and 66% was in contact with a hospital at least once in the period. Additional clinical information is available for hospital contacts (eg, alcohol intake, smoking status, body mass index and blood pressure). A total of 23% (n=8191) of individuals aged ≥65 years had at least one potentially preventable hospital admission, and 73% (n=5941) of these individuals had more than one.\n\nFindings to date\nThe cohort is currently used for research projects in epidemiology and artificial intelligence. These projects comprise a prediction model for potentially preventable hospital admissions, a clinical decision support system based on artificial intelligence, prevention of medication errors in the transition between sectors, health behaviour and sociodemographic characteristics of men and women prior to fertility treatment, and a recently published study applying machine learning methods for early detection of sepsis.\n\nFuture plans\nThe CROSS-TRACKS cohort will be expanded to comprise the entire Central Denmark Region consisting of 1.3 million residents. The cohort can provide new knowledge on how to best organise interventions across healthcare sectors and prevent potentially preventable hospital admissions. Such knowledge would benefit both the individual citizen and society as a whole.","authors":["Anders Hammerich Riis","Pia Kjær Kristensen","Matilde Grøndahl Petersen","Ninna Hinchely Ebdrup"],"meta":["October 2020BMJ Open 10(10):e039996","DOI:10.1136/bmjopen-2020-039996"],"references":["343343982_Explainable_artificial_intelligence_model_to_predict_acute_critical_illness_from_electronic_health_records","339356108_Early_detection_of_sepsis_utilizing_deep_learning_on_electronic_health_record_event_sequences","337018472_The_Danish_prehospital_emergency_healthcare_system_and_research_possibilities","334421419_The_Danish_health_care_system_and_epidemiological_research_From_health_care_contacts_to_database_records","332051672_Frequency_of_health_care_utilization_in_the_year_prior_to_completed_suicide_A_Danish_nationwide_matched_comparative_study","326757287_Cohort_Profile_The_Predictors_of_Breast_Cancer_Recurrence_ProBe_CaRE_Premenopausal_Breast_Cancer_Cohort_Study_in_Denmark","324297348_Danish_Centre_for_Strategic_Research_in_Type_2_Diabetes_DD2_project_cohort_of_newly_diagnosed_patients_with_type_2_diabetes_A_cohort_profile","298915235_The_World_Report_on_Ageing_and_Health","331206532_Validating_registry_data_on_statins_prescriptions_by_blood_measurements","306014987_Interventions_to_Reduce_30-Day_Rehospitalization_A_Systematic_Review"]}