{"id":"346532774_DeepLMS_a_deep_learning_predictive_model_for_supporting_online_learning_in_the_Covid-19_era","abstract":"Coronavirus (Covid-19) pandemic has imposed a complete shut-down of face-to-face teaching to universities and schools, forcing a crash course for online learning plans and technology for students and faculty. In the midst of this unprecedented crisis, video conferencing platforms (e.g., Zoom, WebEx, MS Teams) and learning management systems (LMSs), like Moodle, Blackboard and Google Classroom, are being adopted and heavily used as online learning environments (OLEs). However, as such media solely provide the platform for e-interaction, effective methods that can be used to predict the learner’s behavior in the OLEs, which should be available as supportive tools to educators and metacognitive triggers to learners. Here we show, for the first time, that Deep Learning techniques can be used to handle LMS users’ interaction data and form a novel predictive model, namely DeepLMS, that can forecast the quality of interaction (QoI) with LMS. Using Long Short-Term Memory (LSTM) networks, DeepLMS results in average testing Root Mean Square Error (RMSE) $$<0.009$$ < 0.009 , and average correlation coefficient between ground truth and predicted QoI values $$r\\ge 0.97$$ r ≥ 0.97 $$(p<0.05)$$ ( p < 0.05 ) , when tested on QoI data from one database pre- and two ones during-Covid-19 pandemic. DeepLMS personalized QoI forecasting scaffolds user’s online learning engagement and provides educators with an evaluation path, additionally to the content-related assessment, enriching the overall view on the learners’ motivation and participation in the learning process.","authors":["Sofia Balula Dias","Sofia Hadjileontiadou","José A Diniz","Leontios Hadjileontiadis"],"meta":["November 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-76740-9"],"references":["338071307_Predicting_At-Risk_Students_Using_Clickstream_Data_in_the_Virtual_Learning_Environment","337716362_Predictive_analytics_in_education_a_comparison_of_deep_learning_frameworks","334381622_Uncovering_and_Mitigating_Algorithmic_Bias_through_Learned_Latent_Structure","350797934_FuzzyQoI-Based_Estimation_of_the_Quality_of_Interaction_in_Online_Learning_Amid_Covid-19_A_Greek_Case-Study","340954190_Coronavirus_pushes_education_online","339917440_Supporting_actionable_intelligence_reframing_the_analysis_of_observed_study_strategies","339268117_Applying_Deep_Learning_and_Wearable_Devices_for_Educational_Data_Analytics","338549773_The_scalable_implementation_of_predictive_learning_analytics_at_a_distance_learning_university_Insights_from_a_longitudinal_case_study","334583951_Predicting_learning_status_in_MOOCs_using_LSTM","334559537_Improving_Predictive_Modeling_for_At-Risk_Student_Identification_A_Multistage_Approach"]}