{"id":"346516379_Artificial_learning_companionusing_machine_learning_and_natural_language_processing","abstract":"Artificial Intelligence, also referred to as AI, is one of the most rapidly evolving branches of Computer Science. The two branches of AI which empowers it to understand and interact with humans are Machine Learning (ML) and Natural Language Processing (NLP). Together, these three forms the bases of Artificial Learning Companion-which can be described as a system which can be used to aid the Learning process of the humans. While ML allows the computer program to learn on its own with minimal human intervention, NLP empowers the system to understand the user’s natural communication language through pre-coded programs. When these two aspects of Human Computer Interaction are combined, it enables the AI to take intelligent decisions with sufficient, relevant information. These decisions made by the system can be conveyed to the user using a static GUI, a voice assistant or a chatbot. In this paper, we have chosen to go with a chatbot because it is easy to use and is more relevant to the real-world implementation. The probability for each word is calculated and it provides P (A very close game | Sports) has obtained the highest probability","authors":["Dr. Pugalenthi Ramamurthy","A. Prabhu Chakkaravarthy","J Ramya","Samyuktha Babu"],"meta":["September 2021International Journal of Speech Technology 24(2):1-8","DOI:10.1007/s10772-020-09773-0"],"references":["338026312_A_deep_learning_approach_for_speaker_recognition","331613006_Multistage_classification_scheme_to_enhance_speech_emotion_recognition","324067294_An_ACO-ANN_based_feature_selection_algorithm_for_big_data","262217649_Online_discussions_Improving_education_in_CS","232615802_An_investigation_of_the_differences_between_robot_and_virtual_learning_companions_influences_on_students_engagement","333382290_Students'_performance_analysis_system_using_cumulative_predictor_algorithm","239581448_The_artificial_life_route_to_artificial_intelligence_building_embodied","222460028_Artificial_Intelligence_--_A_Personal_View","30873428_Principles_of_Artificial_Intelligence"]}