{"id":"346557282_Bifibrations_of_Polycategories_and_Classical_Linear_Logic","abstract":"The main goal of this article is to expose and relate different ways of interpreting the multiplicative fragment of classical linear logic in polycategories. Polycategories are known to give rise to models of classical linear logic in so-called representable polycategories with duals, which ask for the existence of various polymaps satisfying the different universal properties needed to define tensor, par, and negation. We begin by explaining how these different universal properties can all be seen as instances of a single notion of universality of a polymap parameterised by an input or output object, which also generalises the classical notion of universal multimap in a multicategory. We then proceed to introduce a definition of in-cartesian and out-cartesian polymaps relative to a refinement system (= strict functor) of polycategories, in such a way that universal polymaps can be understood as a special case. In particular, we obtain that a polycategory is a representable polycategory with duals if and only if it is bifibred over the terminal polycategory 1. Finally, we present a Grothendieck correspondence between bifibrations of polycategories and pseudofunctors into MAdj, the (weak) 2-polycategory of multivariable adjunctions. When restricted to bifibrations over 1 we get back the correspondence between *-autonomous categories and Frobenius pseudomonoids in MAdj that was recently observed by Shulman.","authors":["Nicolas Blanco","Noam Zeilberger"],"meta":["October 2020Electronic Notes in Theoretical Computer Science 352","DOI:10.1016/j.entcs.2020.09.003"],"references":["267248425_Dialogue_Categories_and_Chiralities","246180896_Fibrations_for_abstract_multicategories","242383678_Polarized_category_theory_modules_and_game_semantics","323707969_The_Mathematics_of_Sentence_Structure","319052572_A_categorical_semantics_for_causal_structure","311262657_Functors_are_Type_Refinement_Systems","310821028_A_bifibrational_reconstruction_of_Lawvere's_presheaf_hyperdoctrine","275974555_Fibered_Multiderivators_and_cohomological_descent","246531115_Introduction_to_Tensor_Products_of_Banach_spaces","234060085_Compact_Closed_Bicategories"]}