{"id":"346598117_A_Game-Based_Rehabilitation_Therapy_for_Post-Stroke_Patients_An_Approach_for_Improving_Patient_Motivation_and_Engagement","abstract":"A brain stroke could result in the loss of neuromotor and cognitive functions. Poststroke rehabilitation therapy is used to enable patients to regain some of their lost functionalities. However, traditional rehabilitation faces problems related to the availability of physiotherapists and specific equipment. In home therapy is more convenient for poststroke patients, but their motivation and adherence to their medical regime must be addressed properly. This article presents a game-based in-home rehabilitation system based on two different design approaches. The first design approach (A1) consists of selecting games or ludic activities and adapting them to meet the treatment object ives, the second design approach (A2) consists of selecting and virtualizing the physiotherapy exercises being used at the hospital. The results of the usability study showed that the system is usable. The game difficulty levels were similar for both approaches. The perception of fun was greater for A1 than for A2. Additionally, both approaches were considered motivating for the subjects. The usability study showed that the rehabilitation games reported in this research are usable and motivating. In future research, these games will be integrated into a neuromotor rehabilitation program for poststroke patients.","authors":["Paul Tamayo-Serrano","Samir Garbaya","Saida Bouakaz","Pierre Blazevic"],"meta":["October 2020IEEE Systems Man and Cybernetics Magazine 6(4)","DOI:10.1109/MSMC.2020.3002519"],"references":["324036323_Gamified_In-Home_Rehabilitation_for_Stroke_Survivors_Analytical_Review","319394819_SUS_--_a_quick_and_dirty_usability_scale","298797849_What_Do_Stroke_Patients_Look_for_in_Game-Based_Rehabilitation_A_Survey_Study","339100559_Proposed_Conceptual_Design_Model_of_Persuasive_Game_for_Upper_limb_for_Stroke_Rehabilitation","338635259_CreativeBioMan_A_Brain-_and_Body-Wearable_Computing-Based_Creative_Gaming_System","333399717_Exergaming-Based_Dexterity_Training_in_Persons_With_Parkinson_Disease_A_Pilot_Feasibility_Study","323877523_Virtual_Rehabilitation_-_Benefits_and_Challenges","320359236_Toward_EEG-Based_Biometric_Systems_The_Great_Potential_of_Brain-Wave-Based_Biometrics","313557438_User-centered_design","299650645_Home_Exercise_Programs_for_Adults_With_Neurological_Injuries_A_Survey"]}