{"id":"346539847_Training_confounder-free_deep_learning_models_for_medical_applications","abstract":"The presence of confounding effects (or biases) is one of the most critical challenges in using deep learning to advance discovery in medical imaging studies. Confounders affect the relationship between input data (e.g., brain MRIs) and output variables (e.g., diagnosis). Improper modeling of those relationships often results in spurious and biased associations. Traditional machine learning and statistical models minimize the impact of confounders by, for example, matching data sets, stratifying data, or residualizing imaging measurements. Alternative strategies are needed for state-of-the-art deep learning models that use end-to-end training to automatically extract informative features from large set of images. In this article, we introduce an end-to-end approach for deriving features invariant to confounding factors while accounting for intrinsic correlations between the confounder(s) and prediction outcome. The method does so by exploiting concepts from traditional statistical methods and recent fair machine learning schemes. We evaluate the method on predicting the diagnosis of HIV solely from Magnetic Resonance Images (MRIs), identifying morphological sex differences in adolescence from those of the National Consortium on Alcohol and Neurodevelopment in Adolescence (NCANDA), and determining the bone age from X-ray images of children. The results show that our method can accurately predict while reducing biases associated with confounders. The code is available at https://github.com/qingyuzhao/br-net.","authors":["Qingyu Zhao","Ehsan Adeli","Kilian Pohl"],"meta":["November 2020Nature Communications 11(1)","DOI:10.1038/s41467-020-19784-9"],"references":["345424806_Unsupervised_Domain_Adaptation_Using_Generative_Adversarial_Networks_for_Semantic_Segmentation_of_Aerial_Images","343816092_Deep_Learning_Identifies_Morphological_Determinants_of_Sex_Differences_in_the_Pre-Adolescent_Brain","339058548_A_deep_learning_system_accurately_classifies_primary_and_metastatic_cancers_using_passenger_mutation_patterns","333861305_Interventional_Fairness_Causal_Database_Repair_for_Algorithmic_Fairness","352385985_Representation_Learning_with_Statistical_Independence_to_Mitigate_Bias","341074466_Adversarial_Invariant_Feature_Learning_with_Accuracy_Constraint_for_Domain_Generalization","338511491_Mitigating_Information_Leakage_in_Image_Representations_A_Maximum_Entropy_Approach","338509448_REPAIR_Removing_Representation_Bias_by_Dataset_Resampling","336487096_Harmonization_and_Targeted_Feature_Dropout_for_Generalized_Segmentation_Application_to_Multi-site_Traumatic_Brain_Injury_Images","336391230_Confounder-Aware_Visualization_of_ConvNets"]}