{"id":"346527382_Efficient_solution_of_Boolean_satisfiability_problems_with_digital_memcomputing","abstract":"Boolean satisfiability is a propositional logic problem of interest in multiple fields, e.g., physics, mathematics, and computer science. Beyond a field of research, instances of the SAT problem, as it is known, require efficient solution methods in a variety of applications. It is the decision problem of determining whether a Boolean formula has a satisfying assignment, believed to require exponentially growing time for an algorithm to solve for the worst-case instances. Yet, the efficient solution of many classes of Boolean formulae eludes even the most successful algorithms, not only for the worst-case scenarios, but also for typical-case instances. Here, we introduce a memory-assisted physical system (a digital memcomputing machine) that, when its non-linear ordinary differential equations are integrated numerically, shows evidence for polynomially-bounded scalability while solving “hard” planted-solution instances of SAT, known to require exponential time to solve in the typical case for both complete and incomplete algorithms. Furthermore, we analytically demonstrate that the physical system can efficiently solve the SAT problem in continuous time, without the need to introduce chaos or an exponentially growing energy. The efficiency of the simulations is related to the collective dynamical properties of the original physical system that persist in the numerical integration to robustly guide the solution search even in the presence of numerical errors. We anticipate our results to broaden research directions in physics-inspired computing paradigms ranging from theory to application, from simulation to hardware implementation.","authors":["Sean Rhett-Burke Bearden","Yan Ru Pei","Massimiliano Di Ventra"],"meta":["November 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-76666-2"],"references":["335045172_Digital_memcomputing_From_logic_to_dynamics_to_topology","323302525_Memcomputing_Leveraging_memory_and_physics_to_compute_efficiently","320312900_Absence_of_periodic_orbits_in_digital_memcomputing_machines_with_solutions","319391831_Instantons_in_Self-Organizing_Logic_Gates","342556173_Accelerating_a_continuous-time_analog_SAT_solver_using_GPUs","338081760_Streamlining_variational_inference_for_constraint_satisfaction_problems","337409577_Taming_a_nonconvex_landscape_with_dynamical_long-range_order_Memcomputing_Ising_benchmarks","335774030_Critical_branching_processes_in_digital_memcomputing_machines","314361055_Absence_of_chaos_in_Digital_Memcomputing_Machines_with_solutions","313726720_Polynomial-time_solution_of_prime_factorization_and_NP-complete_problems_with_digital_memcomputing_machines"]}