{"id":"346574940_Monitoring_and_Support_for_Elderly_People_Using_LoRa_Communication_Technologies_IoT_Concepts_and_Applications","abstract":"The pandemic declared by the World Health Organization due to the SARS-CoV-2 virus (COVID-19) awakened us to a reality that most of us were previously unaware of-isolation, confinement and the massive use of information and communication technologies, as well as increased knowledge of the difficulties and limitations of their use. This article focuses on the rapid implementation of low-cost technologies, which allow us to answer a fundamental question: how can near real-time monitoring and follow-up of the elderly and their health conditions, as well as their homes, especially for those living in isolated and remote areas, be provided within their care and protect them from risky events? The system proposed here as a proof of concept uses low-cost devices for communication and data processing, supported by Long-Range (LoRa) technology and connection to The Things Network, incorporating various sensors, both personal and in the residence, allowing family members, neighbors and authorized entities, including security forces, to have access to the health condition of system users and the habitability of their homes, as well as their urgent needs, thus evidencing that it is possible, using low-cost systems, to implement sensor networks for monitoring the elderly using the LoRa gateway and other support infrastructures.","authors":["José P. Lousado","Sandra Maria Gouveia Antunes"],"meta":["December 2020Future Internet 12(11)","DOI:10.3390/fi12110206"],"references":["343313275_Saude_urbana_e_territorio_dos_desafios_pre_e_durante_a_pandemia_as_respostas_pos-pandemia","341953416_Surveillance_of_SigFox_technology_integrated_with_environmental_monitoring","340242079_LoRa-Based_Medical_IoT_System_Architecture_and_Testbed","338619238_Long-Range_Wireless_Radio_Technologies_A_Survey","335027384_Performance_optimization_of_LoRa_nodes_for_the_future_smart_cityindustry","332485316_Wireless_Mesh_Networking_An_IoT-Oriented_Perspective_Survey_on_Relevant_Technologies","331854626_IoT_Based_Remote_Health_Monitoring_System_for_Patients_and_Elderly_People","346574771_e-Health_Monitoring_System_for_Senior_Citizens_based_on_LoRa_Technology","341557674_Mental_Health_and_Psychosocial_Challenges_in_the_COVID-19_Pandemic_Food_for_Thought_for_Cardiovascular_Health_Care_Professionals","339812208_Structure_Function_and_Antigenicity_of_the_SARS-CoV-2_Spike_Glycoprotein"]}