{"id":"346532376_Non-monotone_submodular_function_maximization_under_k-system_constraint","abstract":"The problems of maximizing constrained monotone submodular functions have many practical applications, most recently in the context of combinatorial optimization, operations research, economics and especially machine learning, with constant approximation algorithms known under a variety of constraints. Unfortunately, non-monotone submodular functions maximization is less well studied; the first approximation algorithm for the non-monotone case was studied by Feige et al. (Proceedings of the 48th IEEE symposium on foundations of computer science (FOCS’07), 2007) about unconstrained non-monotone submodular maximization in 2007. In this paper, we extend the work of Lee et al. (Proceedings of the 41st ACM-SIAM symposium on theory of computing (STOC’09), pp 323–332, 2009) for maximizing a non-monotone submodular function under k-matroid constraint to k-system constraint. We first propose a Modified-Greedy algorithm that works no worse than that of Gupta et al. (Proceedings of the 6th international workshop on internet and network economics (WINE’10), vol 6484, pp 246–257, 2010). Based on this, then we provide the NMSFMk algorithm for maximizing a non-monotone submodular function subject to k-system constraint (which generalizes the k-matroid constraint), using Modified-Greedy algorithm combined with USFM algorithm (USFM algorithm is the random linear time 1/2-approximation algorithm proposed by Buchbinder et al. (Proceedings of the 53rd IEEE symposium on foundations of computer science (FOCS’12), pp 649–658, 2012) for unconstrained non-monotone submodular function maximization problem.) iteratively. Finally, we show that NMSFMk algorithm achieves a \\(\\frac{1}{2k+3+1/k}\\)-approximation ratio with running time of O(nmk) (where m is the size of largest set returned by the NMSFMk algorithm), which beats the existing algorithms in many aspects.","authors":["Shi Majun","Zishen Yang","Donghyun Kim","Wei Wang"],"meta":["January 2021Journal of Combinatorial Optimization 41(6):1-15","DOI:10.1007/s10878-020-00672-3"],"references":["315807103_Greed_is_Good_Near-Optimal_Submodular_Maximization_via_Greedy_Optimization","265480108_Monotone_Submodular_Maximization_over_a_Matroid_via_Non-Oblivious_Local_Search","242914003_An_Analysis_of_Approximations_for_Maximizing_Submodular_Set_Functions-I","325833174_Deterministic_Algorithms_for_Submodular_Maximization_Problems","284504706_Submodular_Maximization_with_Cardinality_Constraints","280912053_Deterministic_Algorithms_for_Submodular_Maximization_Problems","280538107_A_Deterministic_Algorithm_for_Maximizing_Submodular_Functions","261211772_A_Tight_Linear_Time_12-Approximation_For_Unconstrained_Submodular_Maximization","242444923_Submodular_Functions_and_Optimization","225246148_An_analysis_of_approximations_for_maximizing_submodular_set_functions-II","220779818_Maximizing_Submodular_Set_Functions_Subject_to_Multiple_Linear_Constraints","221591306_Optimal_approximation_for_the_Submodular_Welfare_Problem_in_the_value_oracle_model","221590427_Non-monotone_submodular_maximization_under_matroid_and_knapsack_constraints","221498436_A_Unified_Continuous_Greedy_Algorithm_for_Submodular_Maximization","221317013_Maximizing_a_Submodular_Set_Function_Subject_to_a_Matroid_Constraint_Extended_Abstract"]}