{"id":"346542596_Network_extraction_by_routing_optimization","abstract":"Routing optimization is a relevant problem in many contexts. Solving directly this type of optimization problem is often computationally intractable. Recent studies suggest that one can instead turn this problem into one of solving a dynamical system of equations, which can instead be solved efficiently using numerical methods. This results in enabling the acquisition of optimal network topologies from a variety of routing problems. However, the actual extraction of the solution in terms of a final network topology relies on numerical details which can prevent an accurate investigation of their topological properties. In fact, in this context, theoretical results are fully accessible only to an expert audience and ready-to-use implementations for non-experts are rarely available or insufficiently documented. In particular, in this framework, final graph acquisition is a challenging problem in-and-of-itself. Here we introduce a method to extract network topologies from dynamical equations related to routing optimization under various parameters’ settings. Our method is made of three steps: first, it extracts an optimal trajectory by solving a dynamical system, then it pre-extracts a network, and finally, it filters out potential redundancies. Remarkably, we propose a principled model to address the filtering in the last step, and give a quantitative interpretation in terms of a transport-related cost function. This principled filtering can be applied to more general problems such as network extraction from images, thus going beyond the scenarios envisioned in the first step. Overall, this novel algorithm allows practitioners to easily extract optimal network topologies by combining basic tools from numerical methods, optimization and network theory. Thus, we provide an alternative to manual graph extraction which allows a grounded extraction from a large variety of optimal topologies. The analysis of these may open up the possibility to gain new insights into the structure and function of optimal networks. We provide an open source implementation of the code online.","authors":["Diego Baptista Theuerkauf","Daniela Leite","Enrico Facca","Mario Putti"],"meta":["November 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-77064-4"],"references":["344287602_Network_science_characteristics_of_brain-derived_neuronal_cultures_deciphered_from_quantitative_phase_imaging_data","335586925_Author_Correction_Community_Detection_on_Networks_with_Ricci_Flow","334259268_Ollivier-Ricci_Curvature-Based_Method_to_Community_Detection_in_Complex_Networks","330260382_Occurrence_of_the_potent_mutagens_2-_nitrobenzanthrone_and_3-nitrobenzanthrone_in_fine_airborne_particles","325702420_River_landscapes_and_optimal_channel_networks","319952803_Numerical_Solution_of_Monge-Kantorovich_Equations_via_a_Dynamic_Formulation","354568196_Branching_structures_emerging_from_a_continuous_optimal_transport_model","329007288_Optimal_Noise-Canceling_Networks","321936825_The_cavity_approach_for_Steiner_trees_Packing_problems","319501540_A_fractal_shape_optimization_problem_in_branched_transport"]}