{"id":"346528922_About_Rule-Based_Systems_Single_Database_Queries_for_Decision_Making","abstract":"One of the developmental directions of Future Internet technologies is the implementation of artificial intelligence systems for manipulating data and the surrounding world in a more complex way. Rule-based systems, very accessible for people’s decision-making, play an important role in the family of computational intelligence methods. The use of decision-making rules along with decision trees are one of the simplest forms of presenting complex decision-making processes. Decision support systems, according to the cross-industry standard process for data mining (CRISP-DM) framework, require final embedding of the learned model in a given computer infrastructure, integrated circuits, etc. In this work, we deal with the topic concerning placing the learned rule-based model of decision support in the database environment-exactly in the SQL database tables. Our main goal is to place the previously trained model in the database and apply it by means of single queries. In our work we assume that the decision-making rules applied are mutually consistent and additionally the Minimal Description Length (MDL) rule is introduced. We propose a universal solution for any IF THEN rule induction algorithm.","authors":["Piotr Artiemjew","Lada Rudikova","Oleg Myslivets"],"meta":["November 2020Future Internet 12(12)","DOI:10.3390/fi12120212"],"references":["326007738_Active_Database_System_Approach_and_Rule_Based_in_the_Development_of_Academic_Information_System","274735924_Granular_Computing_in_Decision_Approximation_-_An_Application_of_Rough_Mereology","261613512_Classification_rule_with_simple_select_SQL_statement","321606258_Intelligent_Decision_Support_Handbook_of_Applications_and_Advances_of_the_Rough_Sets_Theory","311980256_On_Apriori-Based_Rule_Generation_in_SQL_-_A_Case_of_the_Deterministic_Information_System","303517387_The_CRISP-DM_model_the_new_blueprint_for_data_mining","257025969_Time-evolving_rule-based_knowledge_bases","256212231_Rough_set","247049069_On_the_two_local_inductive_algorithms_PRISM_and_LEM2","243686015_LERS-A_System_for_Learning_from_Examples_Based_on_Rough_Sets"]}