{"id":"346668141_Composition_and_Decomposition_of_Multiparty_Sessions","abstract":"Multiparty sessions are systems of concurrent processes, which allow several participants to communicate by sending and receiving messages. Their overall behaviour can be described by means of global types. Typable multiparty sessions enjoy lock-freedom.\nWe look at multiparty sessions as open systems by allowing one to compose multiparty sessions by transforming two of their participants into a pair of coupled gateways, forwarding messages between the two sessions. Gateways need to be compatible. We show that the session resulting from the composition can be typed, and its type can be computed from the global types of the starting sessions. As a consequence, lock-freedom is preserved by composition. Compatibility between global types is necessary, since systems obtained by composing sessions with incompatible global types have locks (or they are not sessions). We also define direct composition, which allows one to connect two global types without using gateways. Finally, we propose a decomposition operator, to split a global type into two, which is the left inverse of direct composition. Direct composition and decomposition on global types prepare the ground for a novel framework allowing for the modular design and implementation of distributed systems.","authors":["Franco Barbanera","Mariangiola Dezani-ciancaglini","Ivan Lanese","Emilio Tuosto"],"meta":["February 2021Journal of Logical and Algebraic Methods in Programming 119:100620","DOI:10.1016/j.jlamp.2020.100620"],"references":["345091151_A_type_language_for_message_passing_component-based_systems","335776838_Open_Multiparty_Sessions","331459541_Reversible_sessions_with_flexible_choices","328079369_Global_Types_for_Open_Systems","337482197_Guess_Who's_Coming_Runtime_Inclusion_of_Participants_in_Choreographies","336765896_Observational_Equivalence_for_Multiparty_Sessions_Dedicated_to_Pawel_Urzyczyn_on_the_occasion_of_his_65th_birthday","335672501_Connecting_Open_Systems_of_Communicating_Finite_State_Machines","334220557_Data-Driven_Choreographies_a_la_Klaim","329986215_Precise_subtyping_for_synchronous_multiparty_sessions","322695106_Choreographies_for_Reactive_Programming"]}