{"id":"346680288_Deep_Learning_Based_Real-Time_Body_Condition_Score_Classification_System","abstract":"The number of animals worldwide is increasing day by day to meet the increasing animal protein needs. Depending on the increase in animal production, yield amount which can be obtained from per unit area can be increased by increasing the number of animals. In dairy cattle farms, it is necessary to group the animals according to their body condition score (BCS) and to care and feed the animals at certain times. Under normal conditions, these processes should be conducted by animal caregivers or experts coming to the enterprise. BCS ratings conducted by experts on farms based on visual examination may give unreliable results and may include misinterpretations. Therefore, technology-supported systems are required. In this study, the prediction of BCS, which is the most important indicator of proper feeding of dairy cattle, is aimed. In addition, by adapting the designed system to simple, fast and user-friendly mobile software, it will be possible to provide tests in enterprise environments in a shorter time. In the design of the system, deep learning models, which have been used frequently in recent years in computer science, have been used. The CNN model, which was trained with a 94.69% success rate through these data, has been converted into a mobile-friendly format for real-time tests. It is aimed to make real-time tests and provide easy access for dairy producers with the help of the designed mobile software. In order to increase the success of the CNN architecture, pre-trained networks have been utilized. In the study, VGG19 pre-trained network, whose success rate has been proved in the previous studies conducted in the literature, was used in model design. The 78.0% performance results obtained from the study indicate that pre-trained CNN architectures based on deep learning are successful for the real-time BCS classification problem.","authors":["Kerim Kürşat Çevik"],"meta":["November 2020IEEE Access 8:213950-213957","DOI:10.1109/ACCESS.2020.3040805"],"references":["340554560_Melanoma_Thickness_Prediction_Based_on_Convolutional_Neural_Network_With_VGG-19_Model_Transfer_Learning","338282215_Body_Condition_Score_BCS_Segmentation_and_Classification_in_Dairy_Cows_using_R-CNN_Deep_Learning_Architecture_R-CNN","336444842_Gender_Prediction_From_Social_Media_Comments_With_Artificial_Intelligence","335202487_Automatic_estimation_of_body_weight_and_body_condition_score_in_dairy_cows_using_3D_imaging_technique","334652627_An_Improved_Single_Shot_Multibox_Detector_Method_Applied_in_Body_Condition_Score_for_Dairy_Cows","331160847_Estimating_Body_Condition_Score_in_Dairy_Cows_From_Depth_Images_Using_Convolutional_Neural_Networks_Transfer_Learning_and_Model_Ensembling_Techniques","339099566_Cow_Body_Condition_Score_Estimation_with_Convolutional_Neural_Networks","336990015_Modeling_flood_susceptibility_using_data-driven_approaches_of_naive_Bayes_tree_alternating_decision_tree_and_random_forest_methods","329745708_Learning_Transferable_Architectures_for_Scalable_Image_Recognition","328102307_Body_condition_estimation_on_cows_from_depth_images_using_Convolutional_Neural_Networks"]}