{"id":"346631855_Des_griefs_de_l'echec_de_l'enseignement_de_l'informatique_dans_des_universites_de_la_RDC_Enjeux_socio-didactiques_de_la_crise","abstract":"L'enseignement constitue le facteur d'émergence des plusieurs pays. Ainsi, c'est le secteur le plus délicat qui permet à un Etat de produire des cadres dignes, performants et compétents pouvant assurer la continuité de la société. On le voit, dans beaucoup de pays, les domaines surtout technologiques et scientifiques ont permis leur développement. Par contre, en RDC, c'est le secteur le plus négligé. Bien que le nombre d'étudiants accroisse du jour au lendemain, celui des professeurs habilités en informatique par exemple ne s'améliore pas. Et, le peu de professeurs informaticiens oeuvrant dans des Universités congolaises passent plus de temps dans des auditoires que dans des laboratoires de recherche car ce sont les mêmes qui sillonnent dans toute l'étendue de la RDC du début à la fin de l'année académique. Par conséquent, ces scientifiques ne trouvent pas de temps pour des recherches et ne se rendent pas compte de l'obsolescence du programme national des sciences informatiques élaboré depuis 2004. En plus, il se constate un laxisme de la part du gouvernement congolais sur le plan des projets de structuration du programme national surtout de l'informatique. La preuve en est que la disproportion entre le nombre des professeurs et des étudiants en sciences informatiques ne constitue pas une sonnette d'alarme. Et, même le manque d'innovation de la part et des enseignants et des étudiants est devenu une vocation pour la nation congolaise. Il y a bien que ceci comme facteurs conduisant à l'échec de l'enseignement d'informatique au Congo : le commercialisme scientifique, le manque de volonté du gouvernement dans l'implication du secteur éducatif, etc. Ce qui constitue un grand échec dans l'enseignement de l'informatique en RDC.","authors":["Héritier Nsenge"],"meta":["August 2020"],"references":["36379282_Une_analyse_critique_de_l'initiation_a_l'informatique_quelsapprentissages_et_quels_transferts","36379872_Epistemologie_et_technologie_de_l'informatique","36379368_Vers_une_Didactique_de_l'Informatique"]}