{"id":"346661603_A_Dynamic_Approach_for_Detecting_the_Fake_News_Using_Random_Forest_Classifier_and_NLP","abstract":"Social media’s presence can have big and very negative impacts on the individuals and on society too. The widespread of intentionally hoax news could mislead the reader. These are all false story with an intention to fool people, so this fake news analysis built, detection and intervention on social media platforms have become one of the hot topics to research that is grasping very huge attention of the truth seekers. The survey properly reviews fake or false news research. The survey finds different ways in which the random forest algorithm and NLP can be used for detecting a fake or false piece of news. Our model is emanated from counting vector which is used for word tallies. It also uses the technique repetition inverse document also called as RID matrix which tallies the words which inform that continuity of words copied from various reports of paper in the given volume of data. These do not consider tasks which are similar to arranging the word and context. There can be many possibilities where two or more articles which are having similarity in word count can be totally different in their meaning or understanding. There are fewer possibilities which could predict either “Real “or “Fake” piece of information presented in the news as it is harder to spot any hoax/fake news. Our suggested task on gathering the dataset of which contains both rumour and true news and employing Random Forest Algorithm and NLP to design or develop a model which can classify an article and tell whether it is untrustworthy information or real news based on the words, phrases or sentences. Our goal is to achieve the trustworthiness of the readers.","authors":["J. Antony Vijay","Anwar Basha Haffishthullah","J. Arun Nehru"],"meta":["January 2021","DOI:10.1007/978-981-15-7907-3_25","In book: Computational Methods and Data Engineering (pp.331-341)"],"references":["334167597_A_Tool_for_Fake_News_Detection","325722738_Media-Rich_Fake_News_Detection_A_Survey","265394968_Optimal_Network_Modularity_for_Information_Diffusion","265340947_The_Changing_Role_of_the_Local_News_Media_in_Enabling_Citizens_to_Engage_in_Local_Democracies","50397939_Small_But_Slow_World_How_Network_Topology_and_Burstiness_Slow_Down_Spreading","332952191_Supervised_Learning_for_Fake_News_Detection","328604364_Fake_News_Detection_Enhancement_with_Data_Imputation","323532315_Evaluating_machine_learning_algorithms_for_fake_news_detection","321356960_Fake_news_detection_using_naive_Bayes_classifier","24104450_Media_Bias_and_Reputation"]}