{"id":"346663561_Optimization_of_the_Energy_Consumption_of_Electric_Motors_through_Metaheuristics_and_PID_Controllers","abstract":"The synthesis of electric motor control systems, seeking optimal performance, is a well-known and studied field of automation to date. However, the solutions often use very elaborate mathematical foundations and sometimes require considerable algorithmic complexity. Another approach to the same problem, which offers very interesting results, is the use of artificial intelligence methods to generate controllers. Intelligent methods allow the use of bio-inspired approaches to solve complex problems. This article presents a method to adjust the parameters of a controller for DC motors based on two components in the objective function: High productivity and efficiency. This can be achieved using well-known and low algorithmic complexity PID controllers, and metaheuristic artificial intelligence techniques to adjust a controller to obtain optimal behavior. To validate the benefits of the methodological proposal, a simulator of a DC motor has been rigorously constructed, respecting fundamental physical principles. The adjustment system based on metaheuristics (genetics algorithms) has been designed to work on the simulator and constitutes the central contribution of the paper. This system has been designed to establish the parameters of a PID controller, optimizing its behavior in relation to two variables of interest, such as performance and energy efficiency (a non-trivial problem). The results obtained confirm the benefits of the approach.","authors":["Francisco Serradilla","Norberto Canas","J.E. Naranjo"],"meta":["November 2020Electronics 9(11):1842","DOI:10.3390/electronics9111842"],"references":["341143907_Multi-objective_meta-heuristic_optimization_in_intelligent_control_A_survey_on_the_controller_tuning_problem","340238713_Speed_Control_Optimization_for_Autonomous_Vehicles_with_Metaheuristics","336932323_Triangular_Gaussian_mutation_to_differential_evolution","333992936_A_Survey_of_Automatic_Parameter_Tuning_Methods_for_Metaheuristics","345140472_Modeling_and_Control_of_Engineering_Systems","336971631_Feedback_Systems_An_Introduction_for_Scientists_and_Engineers","331139863_Optimization_Tools_Based_on_Metaheuristics_for_Performance_Enhancement_in_a_Gaussian_Adaptive_PID_Controller","317415439_Modern_control_engineering","314156034_The_Mathematical_Theory_of_Optimal_Processes","309761532_Parameters_Optimization_of_PID_Controllers_using_Metaheuristics_with_Physical_Implementation"]}