{"id":"346644739_Some_topological_indices_in_fuzzy_graphs","abstract":"A fuzzy graph is one of the versatile application tools in the field of mathematics, which allows the user to easily describe the fuzzy relation between any objects. The nature of fuzziness is favorable for any environment, which supports to predict the problem and solving it. Fuzzy graphs are beneficial to give more precision and flexibility to the system as compared to the classical model (i.e.,) crisp theory. A topological index is a numerical quantity for the structural graph of the molecule and it can be represented through Graph theory. Moreover, its application not only in the field of chemistry can also be applied in areas including computer science, networking, etc. A lot of topological indices are available in chemical-graph theory and H. Wiener proposed the first index to estimate the boiling point of alkanes called ‘Wiener index’. Many topological indices exist only in the crisp but it’s new to the fuzzy graph environment. The main aim of this paper is to define the topological indices in fuzzy graphs. Here, indices defined in fuzzy graphs are Modified Wiener index, Hyper Wiener index, Schultz index, Gutman index, Zagreb indices, Harmonic index, and Randić index with illustrations. Bounds for some of the indices are proved. The algorithms for distance matrix and MWI are shown. Finally, the application of these indices is discussed.","authors":["Shriram Kalathian","Sujatha Ramalingam","R. Sundareswaran","Narasimman Srinivasan"],"meta":["December 2020Journal of Intelligent and Fuzzy Systems 39(5):6033-6046","DOI:10.3233/JIFS-189077"],"references":["330919391_On_some_bounds_of_the_topological_indices_of_generalized_Sierpinski_and_extended_Sierpinski_graphs","316305987_Topological_indices_of_the_m_k_-graph","314259623_Computation_of_some_topological_indices_of_certain_networks","286652728_The_Harmonic_Index_of_Some_Graphs","277341070_Strong_sum_distance_in_fuzzy_graphs","275605693_New_concepts_of_fuzzy_planar_graph","273176661_Fuzzy_Planar_Graphs","344236189_FUZZY_COMBINATORIAL_DUAL_GRAPH","323840108_On_distance-based_topological_indices_used_in_architectural_research","299633771_Fuzzy_Graphs"]}