{"id":"346704161_Methodology_for_Efficient_CNN_Architectures_in_Profiling_Attacks","abstract":"The side-channel community recently investigated a new approach, based on deep learning, to significantly improve profiled attacks against embedded systems. Previous works have shown the benefit of using convolutional neural networks (CNN) to limit the effect of some countermeasures such as desynchronization. Compared with template attacks, deep learning techniques can deal with trace misalignment and the high dimensionality of the data. Pre-processing is no longer mandatory. However, the performance of attacks depends to a great extent on the choice of each hyperparameter used to configure a CNN architecture. Hence, we cannot perfectly harness the potential of deep neural networks without a clear understanding of the network’s inner-workings. To reduce this gap, we propose to clearly explain the role of each hyperparameters during the feature selection phase using some specific visualization techniques including Weight Visualization, Gradient Visualization and Heatmaps. By highlighting which features are retained by filters, heatmaps come in handy when a security evaluator tries to interpret and understand the efficiency of CNN. We propose a methodology for building efficient CNN architectures in terms of attack efficiency and network complexity, even in the presence of desynchronization. We evaluate our methodology using public datasets with and without desynchronization. In each case, our methodology outperforms the previous state-of-the-art CNN models while significantly reducing network complexity. Our networks are up to 25 times more efficient than previous state-of-the-art while their complexity is up to 31810 times smaller. Our results show that CNN networks do not need to be very complex to perform well in the side-channel context.","authors":["Gabriel Zaid","Lilian Bossuet","Amaury Habrard","Alexandre Venelli"],"meta":["November 2019","DOI:10.46586/tches.v2020.i1.1-36"],"references":["338526410_A_Comprehensive_Study_of_Deep_Learning_for_Side-Channel_Analysis","337702208_Deep_learning_for_side-channel_analysis_and_introduction_to_ASCAD_database","329265439_The_Curse_of_Class_Imbalance_and_Conflicting_Metrics_with_Machine_Learning_for_Side-channel_Evaluations","319769813_Fast_and_Accurate_Deep_Network_Learning_by_Exponential_Linear_Units_ELUs","324055141_A_disciplined_approach_to_neural_network_hyper-parameters_Part_1_--_learning_rate_batch_size_momentum_and_weight_decay","323118469_Efficient_Neural_Architecture_Search_via_Parameters_Sharing","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770006_Learning_Deep_Features_for_Discriminative_Localization","319256075_Super-Convergence_Very_Fast_Training_of_Residual_Networks_Using_Large_Learning_Rates","316946026_Cyclical_Learning_Rates_for_Training_Neural_Networks"]}