{"id":"346783516_How_distance_education_students_perceive_the_impact_of_teaching_videos_on_their_learning","abstract":"Videos, made by teachers to meet specific learning outcomes, are afeature of the technological enhanced learning revolution that is sweeping through higher education. Pedagogical research into teaching videos has been broadly positive and focussed on their benefits for students’ experience as well as how specific features of films can enhance learning and attainment. Although these studies are useful, few consider the perceptions of the students who watch the films and the teachers who make them. This article focuses on astudy conducted with distance learning students and teachers from one university in England to discover their attitudes to teaching videos. The exploratory study found that although amajority of distance students like and watch the videos, asignificant proportion give good reasons for not doing so. The main finding from the research is it is the quality of the teacher, as opposed to the affordances that technology offers, that is perceived to have the most impact on student learning. The findings are significant as the development of teaching videos can be expensive and they will help higher education teachers make wiser pedagogical decisions about when to use videos, and of what type.","authors":["Tom Harrison"],"meta":["September 2020Open Learning 35(3):260-276","DOI:10.1080/02680513.2019.1702518"],"references":["323378852_Evaluation_of_Online_Video_Usage_and_Learning_Satisfaction_An_Extension_of_the_Technology_Acceptance_Model","323378838_A_Taxonomy_of_Asynchronous_Instructional_Video_Styles","321374484_A_review_of_ten_years_of_implementation_and_research_in_aligning_learning_design_with_learning_analytics_at_the_Open_University_UK","320014215_Design_of_Technology-Enhanced_Learning_-_Integrating_Research_and_Practice","344478334_E-Learning_in_the_21st_Century_A_Framework_for_Research_and_Practice","337324695_Disruptive_Technology_Enhanced_Learning_The_Use_and_Misuse_of_Digital_Technologies_in_Higher_Education","324944728_Mood-affect_congruency_Exploring_the_relation_between_learners'_mood_and_the_affective_charge_of_educational_videos","314927640_Video_and_Online_Learning_Critical_Reflections_and_Findings_from_the_Field","314120034_Disruptive_Technology_Enhanced_Learning","313813647_Defining_the_role_adjustment_profile_of_learners_and_instructors_online"]}