{"id":"346783629_Systematic_prioritisation_of_SDGs_Machine_learning_approach","abstract":"The Sustainable Development Goals (SDGs) framework is recognised throughout the world as a significant global agreement that has been adopted by all UN members. These goals represent a solution to sustainability problems dealing with nations’ economies, the natural environment and societies. However, making progress towards achieving these goals has not been as effective as originally intended. One of the major concerns is whether the SDGs will be achieved globally by 2030. Given the current damage wrought internationally by the COVID-19 pandemic, what is required is a coordinated global effort to achieve the SDGs. In this uncertain time, an era of corona virus outbreaks, when countries’ resources are finite and the deadline is fast approaching, prioritisation is necessary to allocate resources effectively. Several attempts have been made to prioritise SDGs by quantifying synergies. However, systematic methods to identify the magnitude of how to enhance the SDG index by improving individual SDGs is lacking. The objective of this paper is to identify synergetic SDGs using Boosted Regression Trees model which is a machine learning and data mining technique. In this study, contributions of all SDGs to form the SDG index are identified and a “what-if” analysis is conducted to understand the significance of goal scores. Findings show that SDG3, “Good health and well-being”, SDG4, “Quality education”, and SDG7, “Affordable and clean energy”, are the most synergetic goals, when their scores are >60%. The findings of this research will help decision-makers implement effective strategies and allocate resources by prioritising synergetic goals.","authors":["Atie Asadikia","Abbas Rajabifard","Mohsen Kalantari"],"meta":["November 2020World Development 140(2):105269","DOI:10.1016/j.worlddev.2020.105269"],"references":["338168502_Correction_Jaramillo_F_et_al_Priorities_and_Interactions_of_Sustainable_Development_Goals_SDGs_with_Focus_on_Wetlands_Water_2019_11_619","336959868_Classifying_Sustainable_Development_Goal_trajectories_A_country-level_methodology_for_identifying_which_issues_and_people_are_getting_left_behind","335312458_Government_spending_and_sustainable_economic_growth_Based_on_first-_and_second-level_COFOG_data","334468147_Multicollinearity_and_misleading_statistical_results","332465417_Translating_Sustainable_Development_Goal_SDG_Interdependencies_into_Policy_Advice","337660050_The_triple_nexus_A_potential_approach_to_supporting_the_achievement_of_the_Sustainable_Development_Goals","336182643_Sustainable_development_goal_indicators_Analyzing_trade-offs_and_complementarities","335405891_Six_Transformations_to_achieve_the_Sustainable_Development_Goals","334172851_Tracking_the_SDGs_in_an_'integrated'_manner_A_proposal_for_a_new_index_to_capture_synergies_and_trade-offs_between_and_within_goals","332568049_Translating_Sustainable_Development_Goal_SDG_interdependencies_into_policy_advice"]}