{"id":"346713536_Using_phidelta_diagrams_to_discover_relevant_patterns_in_multilayer_perceptrons","abstract":"Understanding the inner behaviour of multilayer perceptrons during and after training is a goal of paramount importance for many researchers worldwide. This article experimentally shows that relevant patterns emerge upon training, which are typically related to the underlying problem difficulty. The occurrence of these patterns is highlighted by means of ⟨φ,δ⟩\\documentclass[12pt]{minimal} \\usepackage{amsmath} \\usepackage{wasysym} \\usepackage{amsfonts} \\usepackage{amssymb} \\usepackage{amsbsy} \\usepackage{mathrsfs} \\usepackage{upgreek} \\setlength{\\oddsidemargin}{-69pt} \\begin{document}$$\\langle \\varphi ,\\delta \\rangle$$\\end{document} diagrams, a 2D graphical tool originally devised to support the work of researchers on classifier performance evaluation and on feature assessment. The underlying assumption being that multilayer perceptrons are powerful engines for feature encoding, hidden layers have been inspected as they were in fact hosting new input features. Interestingly, there are problems that appear difficult if dealt with using a single hidden layer, whereas they turn out to be easier upon the addition of further layers. The experimental findings reported in this article give further support to the standpoint according to which implementing neural architectures with multiple layers may help to boost their generalisation ability. A generic training strategy inspired by some relevant recommendations of deep learning has also been devised. A basic implementation of this strategy has been thoroughly used during the experiments aimed at identifying relevant patterns inside multilayer perceptrons. Further experiments performed in a comparative setting have shown that it could be adopted as viable alternative to the classical backpropagation algorithm.","authors":["Giuliano Armano"],"meta":["December 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-76517-0"],"references":["337143575_On_Kernel_Method-Based_Connectionist_Models_and_Supervised_Deep_Learning_Without_Backpropagation","332180999_Deep-Learning_Domain_Adaptation_Techniques_for_Credit_Cards_Fraud_Detection","324167625_Understanding_Autoencoders_with_Information_Theoretic_Concepts","343248033_Enhancing_Explainability_of_Neural_Networks_Through_Architecture_Constraints","338039379_XAI-Explainable_artificial_intelligence","328868381_Emergence_of_invariance_and_disentanglement_in_deep_representations","328520627_Emergence_of_Invariance_and_Disentanglement_in_Deep_Representations","325898276_A_two-tiered_2D_Visual_Tool_for_Assessing_Classifier_Performance","320619613_A_Survey_of_Model_Compression_and_Acceleration_for_Deep_Neural_Networks","319770387_Deep_Sparse_Rectifier_Neural_Networks"]}