{"id":"346710020_Engagement_Taxonomy_for_Introductory_Programming_Tools_Failing_to_Tackle_the_Problems_of_Comprehension","abstract":"A large number of introductory programming environments for K-12 education have become widely used across the world. One of the main ideas behind these environments is introducing basic programming concepts more effectively by incorporating different visualization strategies. There have been attempts to classify introductory programming tools, however, certain critical aspects have not yet been discussed within the existing classifications, especially those related to user engagement in the programming environment. In this paper we introduce an engagement taxonomy for introductory programming tools (ETIP) built on a concept of engagement taxonomy for software visualization and previous classifications of programming learning tools. The new taxonomy is then used to inclusively review introductory programming environments for secondary education used today with a focus on user engagement in a learning environment. Our review illustrates how majority of introductory programming tools do not fully explore the ways visualizations could help with tackling the problems of beginner programming comprehension. There is still a lack of knowledge about the importance of the level of engagement in visual introductory programming tools and the suggested taxonomy could be used for future research of computer science education.","authors":["Tomas Šiaulys"],"meta":["November 2020","DOI:10.1007/978-3-030-63212-0_8","In book: Informatics in Schools. Engaging Learners in Computational Thinking (pp.94-106)"],"references":["337018628_Heuristic_Evaluation_on_Usability_of_Educational_Games_A_Systematic_Review","334431513_A_Cross-analysis_of_Block-based_and_Visual_Programming_Apps_with_Computer_Science_Student-Teachers","330380587_Block-based_versus_text-based_programming_environments_on_novice_student_learning_outcomes_a_meta-analysis_study","329544316_Introductory_Programming_A_Systematic_Literature_Review","324588165_Computational_Thinking_in_Primary_School_An_Examination_of_Abstraction_and_Decomposition_in_Different_Age_Groups","321332296_Comparing_loops_misconceptions_in_block-based_and_text-based_programming_languages_at_the_K-12_level","320679287_Students'_Misconceptions_and_Other_Difficulties_in_Introductory_Programming_A_Literature_Review","314296105_Measuring_Student_Learning_in_Introductory_Block-Based_Programming_Examining_Misconceptions_of_Loops_Variables_and_Boolean_Logic","335045104_Transitioning_from_introductory_block-based_and_text-based_environments_to_professional_programming_languages_in_high_school_computer_science_classrooms","322412581_Program_learning_for_beginners_Survey_and_taxonomy_of_programming_learning_tools"]}