{"id":"346771532_Host_Behavior_in_Computer_Network_One-Year_Study","abstract":"An analysis of a host behavior is an essential key for modern network management and security. A robust behavior profile enables the network managers to detect anomalies with high accuracy, predict the host behavior, or group host to clusters for better management. Hence, host profiling methods attract the interest of many researchers, and novel methods for host profiling are being introduced. However, these methods are frequently developed on preprocessed and small datasets. Therefore, they do not reflect the real-world artifacts of the host profiling, such as missing observations, temporal patterns, or variability in the profile characteristics in time. To provide the needed insight into the artifacts of host profiling in real-world settings, we present a study of the host behavior in a network conducted on a one-year-long real-world network dataset. In the study, we inspect the availability of the data for host profiling, identify the temporal patterns in host behavior, introduce a method for stable labeling of the hosts, and assess the variability of the host characteristics in the course of the year using the coefficient of variance. Moreover, we make the one-year dataset containing nine characteristics used for host behavior analysis available for public use and further research, including selected use cases representing host profiling caveats. We also share the record of analyses presented in the paper.","authors":["Tomas Jirsik","Petr Velan"],"meta":["November 2020IEEE Transactions on Network and Service Management PP(99):1-1","DOI:10.1109/TNSM.2020.3036528"],"references":["325705729_Role_classification_with_netflow_data_in_intranet","312572407_Behavioral_clustering_of_non-stationary_IP_flow_record_data","273397148_Flow_Monitoring_Explained_From_Packet_Capture_to_Data_Analysis_With_NetFlow_and_IPFIX","333069266_Deep_Learning_for_Encrypted_Traffic_Classification_An_Overview","304816760_Network_traffic_characterisation_using_flow-based_statistics","299425306_Traffic_Profiling_Evaluating_Stability_in_Multi-device_User_Environments","280915679_A_survey_of_methods_for_encrypted_traffic_classification_and_analysis","279295635_Profiling_IP_Hosts_Based_on_Traffic_Behavior","276074190_Digital_signature_to_help_network_management_using_flow_analysis_Network_Management_Using_Flow_Analysis","273621228_Specification_of_the_IP_Flow_Information_Export_IPFIX_Protocol_for_the_Exchange_of_Flow_Information","273359461_Clustering_and_Profiling_IP_Hosts_Based_on_Traffic_Behavior","262284697_A_supervised_machine_learning_approach_to_classify_host_roles_on_line_using_sFlow","261210498_Traffic_Classification_Issues_and_Challenges","260707921_Synoptic_Graphlet_Bridging_the_Gap_Between_Supervised_and_Unsupervised_Profiling_of_Host-Level_Network_Traffic","243787961_Discriminators_for_Use_in_Flow-Based_Classification"]}