{"id":"346718828_Remote_Knowledge_Acquisition_and_Assessment_During_the_COVID-19_Pandemic","abstract":"On 16 March 2020, as a result of the unprecedented global health crisis linked to the emergence of a new form of coronavirus (COVID-19), the 74 universities of France closed their doors, forcing nearly 1.6 million students, as well as their teachers, to find solutions and initiatives that could ensure continuity in teaching. In the reliance on videoconferencing tools, chat, the sharing of doc-uments/tutorials/videos/podcasts, and the use of social networks, many ideas have emerged, but no consensus has developed nor has a common way of doing things been adopted by a majority of teachers. Some software tools, such as Zoom, have also been questioned over data security issues or excessive intrusion into the student learning process. Nevertheless, in these uncertain times, much had to be done so that students can acquire the requisite knowledge, develop skills, and build on what they have learned. How can we ensure that the learning process is as smooth as possible for everyone involved? How can we evaluate knowledge and skills learned at a distance, and their relevance? Four groups of electronic and electrical engineering students in France were monitored during the containment period in order to provide answers to these questions. Lectures, tutorials, practical work, and projects were carried out using the Microsoft Teams and Zoom video conferencing and chat tools to complement activities made available through the digital work environment. In order to ensure equity among all students, especially in view of the digital divide, open access tools/software/ap-plications have been promoted. In the various surveys completed, the engineering students asserted their complete satisfaction with the learning process, the use of distance tools, and the level of mastery of these tools by their teachers. The results of the various knowledge tests show that, for the same course, distance learning does not reduce the performance of the engineering students. Indeed, they obtained local grades similar to those expected in face-to-face teaching. The results presented in this article are not intended to highlight the virtues of distance education , but rather to open up a debate and reflect more widely on the sustainability of this transformation of education in universities.","authors":["Sebastien Jacques","A. Ouahabi","Thierry Lequeu"],"meta":["December 2020","DOI:10.3991/ijep.v10i6.16205","Project: Face Recognition and its Applications"],"references":["343161762_Past_Present_and_Future_of_Face_Recognition_A_Review","342133023_Empirical_Research_on_the_Application_of_Online_Teaching_in_Chinese_Colleges_and_Universities_Under_the_Situation_of_Novel_Coronavirus_Pneumonia_Prevention_and_Control","341804686_Folk_Pedagogies_for_Teacher_Educator_Transitions_Approaches_to_Synchronous_Online_Learning_in_the_Wake_of_COVID-19","341529408_Toward_Sustainable_Learning_during_School_Suspension_Socioeconomic_Occupational_Aspirations_and_Learning_Behavior_of_Vietnamese_Students_during_COVID-19","341433948_Online_Learning_to_Prevent_the_Spread_of_Pandemic_Corona_Virus_in_Indonesia","341208076_Campus_traffic_and_e-Learning_during_COVID-19_pandemic","341157715_Discourse_Analysis_in_E-Learning-Based_Course_Using_Moodle_Platform_An_Experimental_Design","346043476_Virtual_Learning_and_Educational_Environment_New_Opportunities_and_Challenges_under_the_COVID-19_Pandemic","341318810_Cloud_and_Serverless_Computing_for_Scientists_A_Primer","341163752_The_Attractiveness_of_Reversing_Teaching_Forms_-_Feedback_on_an_Electrical_Engineering_Course"]}