{"id":"346894724_Sharp_Bounds_of_Local_Fractional_Metric_Dimensions_of_Connected_Networks","abstract":"Metric dimension is a distance based parameter which is used to determine the locations of machines (or robots) with respect to minimum consumption of time, shortest distance among the destinations and lesser number of the utilized nodes as places of the objects. It is also used to characterize the chemical compounds in the molecular networks in the form of their unique presentations. These are problems worth investigating in different strata of computer science and chemistry such as navigation, combinatorial optimization, pattern recognition, image processing, integer programming, network theory and drugs discovery. In this paper, a general computational criteria is established to compute the local fractional metric dimension (LFMD) of connected networks in the form of sharp lower and upper bounds. A complete characterization of the connected networks whose LFMDs attain the exactly lower bound is obtained and some particular classes of networks (complete networks, generalized windmill and h-level windmill) whose LFMDs attain the exactly upper bound are also addressed. In the consequence of the main obtained criteria, LFMDs of wheel-related networks (anti-web gear, m-level wheel, prism, helm and flower) are computed and their boundedness (or un-boundedness) is also illustrated with the help of 2D and 3D graphical presentations.","authors":["Muhammad Javaid","Mohsin Raza","Poom Kumam","Jia-Bao Liu"],"meta":["January 2020IEEE Access 8:172329-172342","DOI:10.1109/ACCESS.2020.3025018"],"references":["332301859_On_the_local_fractional_metric_dimension_of_corona_product_graphs","330490436_Fractional_Metric_Dimension_of_Generalized_Jahangir_Graph","323517407_On_fractional_metric_dimension_of_comb_product_graphs","272175075_On_Fractional_Metric_Dimension_of_Graphs","265889329_The_metric_dimension_and_metric_independence_of_a_graph","264553359_On_the_metric_dimension_of_Jahangir_graph","341093777_Local_Fractional_Metric_Dimensions_of_Rotationally_Symmetric_and_Planar_Networks","272372827_The_fractional_metric_dimension_of_permutation_graphs","264960330_On_the_metric_dimension_of_a_graph","256694065_The_fractional_metric_dimension_of_graphs"]}