{"id":"346815056_Genetic_Algorithms_A_30-Year_Perspective","abstract":"I continue to be surprised and pleased by the dramatic growth of interest in and applications of genetic algorithms (GAs) in recent years. This growth, in turn, has placed a certain amount of healthy \"stress\" on the field as current understanding and traditional approaches are stretched to the limit by challenging new problems and new areas of application. At the same time, other forms of evolutionary computation such as evolution strategies [50] and evolutionary programming [22], continue to mature and provide alternative views on how the process of evolution might be captured in an efficient and useful computational framework. I don't think there can be much disagreement about the fact that Holland's initial ideas for adaptive system design have played a fundamental role in the progress we have made in the past thirty years [23, 46]. So, an occasion like this is an opportunity to reflect on where the field is now, how it got there, and where it is headed. In the following sections, I will attempt to summarize the progress that has been made, and to identify critical issues that need to be addressed for continued progress in the field. The widespread availability of inexpensive digital computers in the 1960s gave rise to their increased use as a modeling and simulation tool by the scientific community. Several groups around the world including Rechenberg and Schwefel at the Technical University of Berlin [49], Fogel et al. at the University of California at Los Angeles [22], and Holland at the University of Michigan in Ann Arbor [35] were captivated by the potential of taking early simulation models of evolution a step further and harnessing these evolutionary processes in computational forms that could be used for complex computer-based problem solving. In Holland's case, the motivation was the design and implementation of robust adaptive systems, capable of dealing with an uncertain and changing environment. His view emphasized the need for systems which self-adapt over time as a function of feedback obtained from interacting with the environment in which they operate. This led to an initial family of \"reproductive plans\" which formed the basis for what we call \"simple genetic algorithms\" today, as outlined in figure 1.","authors":["Kenneth De Jong"],"meta":["March 2005","DOI:10.1093/oso/9780195162929.003.0006","In book: Perspectives on Adaptation in Natural and Artificial Systems"],"references":[]}