{"id":"346893215_Rubric_for_Measuring_and_Visualizing_the_Effects_of_Learning_Computer_Programming_for_Elementary_School_Students","abstract":"Aim/Purpose: Although many computer science measures have been proposed, visualizing individual students’ capabilities is difficult, as those measures often rely on specific tools and methods or are not graded. To solve these problems, we propose a rubric for measuring and visualizing the effects of learning computer programming for elementary school students enrolled in computer science education (CSE), which is independent of the programming language being used. Background: In this research, we proposed a rubric based on existing CSE standards and criteria having a programming education-learning goal. We then applied this rubric to actual lessons to visualize the educational effects. Methodology: The proposed new rubric for teaching computer programming, based on existing standards and criteria, was applied to fourth- and sixth-grade students in Japan. We assessed which skills were cultivated through quizzes before and after the teaching. Contribution: This paper contributes on how to make and utilize a rubric for programming education in computer science. We evaluated and visualized the proposed rubric’s learning effects on children and found that our proposed rubrics are independent of any particular method or tool. Findings: The results of this survey are twofold: (1) we proposed a rubric of programming education in computer science, independent of the programming tools used and (2) we succeeded in visualizing students’ learning stages by applying the proposed rubric to programming education conducted in a Japanese elementary school. Recommendations for Practitioners: Evaluating educational effects in CSE is important. In particular, graded assessments of learner abilities can reveal individual characteristics. This research is useful for assessing CSE because it focuses specifically on programming education. Recommendation for Researchers: The rubric’s suggestions and quality improvements in CSE help learners assess their learning progress and will clarify the cultivated computer science skills. Impact on Society: This research evaluates CSE based on a rubric in the programming education field. Future Research: Future work is needed to improve the proposed rubric’s quality and relevance. Also, this rubric should be applied to many classes to increase the number of evaluations and analyses.","authors":["Daisuke Saito","Shota Kaieda","Hironori Washizaki","Yoshiaki Fukazawa"],"meta":["January 2020Journal of Information Technology Education: Innovations in Practice 19:203-227","DOI:10.28945/4666"],"references":["345038297_Effective_Evaluation_of_the_Non-Technical_Skills_in_the_Computing_Discipline","323330826_What_We_Can_Learn_About_Student_Learning_From_Open-Ended_Programming_Projects_in_Middle_School_Computer_Science","307569213_A_Study_of_Code_Design_Skills_in_Novice_Programmers_using_the_SOLO_taxonomy","305081810_Developing_a_Rubric_for_a_Creative_CS_Principles_Lab","339510696_A_Large-scale_Evaluation_of_a_Rubric_for_the_Automatic_Assessment_of_Algorithms_and_Programming_Concepts","331302141_Using_Rubrics_Integrating_Design_and_Coding_to_Assess_Middle_School_Students'_Open-ended_Block-based_Programming_Projects","331299756_Rubric_to_Evaluate_Programming_Learning_of_Elementary_School_Students","311506600_RubricVis_enriching_rubric-based_formative_assessment_with_visual_learning_analytics","310791089_Designing_a_rubric_for_feedback_on_code_quality_in_programming_courses","301463453_Relationships_computational_thinking_pedagogy_of_programming_and_Bloom's_Taxonomy"]}