{"id":"346848625_Berlin_Remix_-_A_Computationally_Generative_City_Film_Artwork","abstract":"Berlin Remix is a computationally generative artwork that creates and presents a series of short films re-edited and re-mixed from the archetypal “City Film” documentary Berlin: Symphony of a Great City (Ruttman 1927). The “City Film” is an historical documentary genre. These City films thrived in the late 20s and 30s, and continue to this day. Each of them documented the daily life of an individual city. The central film in the development of this genre is Ruttman’s Berlin. Berlin Remix is a generative artwork that re-mixes the individual shots of the original film into a series of shorter films. Each of these shorter films differs from the others in specific content, cinematic style, or both. Each of the derived films shows a single facet or theme contained within the larger film. The final form of the artwork will run completely autonomously, generating the series of shorter films in real time. The artwork as exhibited at CSDH/SCHN 2019 required a moderate amount of human intervention to join the system’s output segments into short films. Résumé Le 'Berlin Remix' est une oeuvre d’art informatiquement générative qui crée et présente une série de films courts remodifiés et remixés venant du documentaire de l’archétype « film de ville » ('City Film') qui s’appelle 'Berlin : Symphony of a Great City' (Ruttman 1927). Le « film de ville » est un genre documentaire historique. Ces films de ville s’épanouissaient pendant la fin des années 1920 et 1930, et aujourd’hui encore. Le film central du développement de ce genre est celui de Ruttman, nommé Berlin. Le 'Berlin Remix' est une oeuvre d’art générative qui remixe les images individuelles du film original en série de films plus courts. Chacun de ces films plus courts varie l’un des autres selon le contexte spécifique, selon le style cinématographique, ou selon les deux à la fois. Chacun des films dérivés montre une facette ou un thème unique, confiné dans le film entier. La forme finale de cette oeuvre d’art fonctionnera de façon autonome, générant la série de films plus courts en temps réel. L’oeuvre d’art, comme exposé à 'CSDH/SCHN 2019', a exigé une quantité modérée d’intervention humaine afin de transformer la production de séquences du système en films courts. Mots clés: art vidéo; art générative; esthétics; cinématographique, film documentaire; média numérique","authors":["Jim Bizzocchi"],"meta":["November 2020Digital Studies/Le champ numérique 10(1)","DOI:10.16995/dscn.376"],"references":["308626169_Generative_Visual_Renku_Poetic_Multimedia_Semantics_with_the_GRIOT_System"]}