{"id":"346823565_Chemical_Dynamics_in_Condensed_Phases_Relaxation_Transfer_and_Reactions_in_Condensed_Molecular_SystemsRelaxation_Transfer_and_Reactions_in_Condensed_Molecular_Systems","abstract":"This text provides a uniform and consistent approach to diversified problems encountered in the study of dynamical processes in condensed phase molecular systems. Given the broad interdisciplinary aspect of this subject, the book focuses on three themes: coverage of needed background material, in-depth introduction of methodologies, and analysis of several key applications. The uniform approach and common language used in all discussions help to develop general understanding and insight on condensed phases chemical dynamics. The applications discussed are among the most fundamental processes that underlie physical, chemical and biological phenomena in complex systems. The first part of the book starts with a general review of basic mathematical and physical methods (Chapter 1) and a few introductory chapters on quantum dynamics (Chapter 2), interaction of radiation and matter (Chapter 3) and basic properties of solids (chapter 4) and liquids (Chapter 5). In the second part the text embarks on a broad coverage of the main methodological approaches. The central role of classical and quantum time correlation functions is emphasized in Chapter 6. The presentation of dynamical phenomena in complex systems as stochastic processes is discussed in Chapters 7 and 8. The basic theory of quantum relaxation phenomena is developed in Chapter 9, and carried on in Chapter 10 which introduces the density operator, its quantum evolution in Liouville space, and the concept of reduced equation of motions. The methodological part concludes with a discussion of linear response theory in Chapter 11, and of the spin-boson model in chapter 12. The third part of the book applies the methodologies introduced earlier to several fundamental processes that underlie much of the dynamical behaviour of condensed phase molecular systems. Vibrational relaxation and vibrational energy transfer (Chapter 13), Barrier crossing and diffusion controlled reactions (Chapter 14), solvation dynamics (Chapter 15), electron transfer in bulk solvents (Chapter 16) and at electrodes/electrolyte and metal/molecule/metal junctions (Chapter 17), and several processes pertaining to molecular spectroscopy in condensed phases (Chapter 18) are the main subjects discussed in this part.","authors":["Abraham Nitzan"],"meta":["April 2006","DOI:10.1093/oso/9780198529798.001.0001","ISBN: 9780198529798"],"references":[]}