{"id":"346807873_Introduction_Near_Abroads","abstract":"On my third evening in Russia, the world changed. I was in Stavropol, a city founded by Prince Gregory Potemkin at the time of the American Revolution as one of ten fortresses to defend the borders of the expanding Russian Empire. To the south were the Caucasus, formidable mountains and myriad peoples. Stavropol grew as an administrative center of tsarist and later Soviet power. It briefly fell to the Wehrmacht in 1942 as the invading army drove unsuccessfully toward the oilfields of Baku. Later, a popular young party secretary from the area got noticed in Moscow, joined the Politburo, and in 1985 became general secretary of the Communist Party of the Soviet Union. Mikhail Gorbachev’s reforms would inadvertently lead to a geopolitical earthquake, the end of the Cold War in Europe, and the unthinkable—the collapse of the Communist empire built by Lenin and Stalin. That evening the provost of Stavropol State University toasted the health of the international academics attending the conference starting the next morning. Many other benevolent toasts were exchanged, and a singularly somber one. A researcher with the Memorial Human Rights Center reminded us that a war raged nearby in Chechnya, an “inner abroad” of Russia. Here Russia’s new president had approved the indiscriminate shelling of a Russian city and a dirty war against citizens redefined as “terrorists.” Returning to our hotel that evening in a bus under armed guard, a Croatian friend and I were chatting when told to turn on the television. Russian television was broadcasting footage of airplanes crashing into skyscrapers in lower Manhattan on what seemed like a continuous loop. The full magnitude of what had happened was only apparent the next day. Like many, the Twin Towers were entwined with personal memories—first seeing them in rural Ireland on a pennant my uncle brought back from his vacation to New York, and later visiting the observation deck with my parents and friends. Furthermore, the attack on the Pentagon was only two miles from my home, a few more from where I worked, and all too close to some former students who worked in the building.","authors":["Gerard Toal"],"meta":["March 2017","DOI:10.1093/oso/9780190253301.003.0006","In book: Near Abroad"],"references":[]}