{"id":"346831691_Intelligent_Machinery_1948","abstract":"By the beginning of 1947 much effort had gone into writing programmes or ‘instruction tables’ for the ACE. In ‘Proposed Electronic Calculator’, Turing had said that work on instruction tables should start immediately, since the ‘earlier stages of the making of instruction tables will have serious repercussions on the design [of the machine]’; moreover, the programming work should ‘go on whilst the machine is being built, in order to avoid some of the delay between the delivery of the machine and the production of results’. However, little progress had been made on the physical construction of the ACE. The actual engineering work was being carried out not at the National Physical Laboratory but at the Post Office Research Station, under the supervision of Turing’s wartime associate Flowers (see the introductions to Chapters 4 and 9). Flowers was asked by the NPL early in 1946 to assist with the engineering design of, and to build, the ACE. Ominously, the letter of agreement from Flowers’s superior to Turing’s superior spoke of ‘very considerable arrears of work’ and warned that ‘the manpower position is difficult’. Initial progress was nevertheless promising, with some early successes in the experimental work on the delay line memory units. According to an NPL document dated March 1946, ‘Mr. Flowers states that they can have ready for N.P.L. a minimal ACE by August or September.’ Unfortunately it proved impossible to keep to Flowers’s timetable. Dollis Hill was occupied with a backlog of urgent work on the national telephone system (at that time managed by the Post Office). Flowers’s Section was ‘too busy to do other people’s work’ (he said in 1998). Only two men could be spared to work on the ACE, Chandler and Coombs (both of whom had played leading roles in the wartime Colossus project). Sir Charles Darwin, the Director of the NPL, noted in August 1946 that the Post Office was ‘not in a position to plunge very deep’, and by November was expressing concern to Post Office staff about the slow rate of progress on the ACE. The fault was not all with the Post Office, however.","authors":["Alan Turing"],"meta":["September 2004","DOI:10.1093/oso/9780198250791.003.0016","In book: The Essential Turing"],"references":[]}