{"id":"346886735_Harnessing_the_Power_of_the_Second_Quantum_Revolution","abstract":"The second quantum revolution has been built on a foundation of fundamental research at the intersection of physics and information science, giving rise to the discipline we now call quantum information science (QIS). The quest for new knowledge and understanding drove the development of new experimental tools and rigorous theory, which defined the road map for second-wave quantum technologies, including quantum computers, quantum-enhanced sensors, and communication systems. As technology has matured, the race to develop and commercialize near-term applications has accelerated. In the current regime of Noisy Intermediate Scale Quantum (NISQ) devices [J. Preskill, Quantum 2, 79 (2018)], the continued necessity of basic research is manifest. Under what conditions can we truly harness quantum complexity and what are its implications for potential useful applications? These questions remain largely unanswered and as the QIS industry ramps up, a continuous feedback between basic science and technology is essential. In this Perspective, I review how curiosity-driven research has led to radical new technologies and why the quest for basic understanding is essential for further progress.","authors":["Ivan Deutsch"],"meta":["November 2020","DOI:10.1103/PRXQuantum.1.020101"],"references":["350569322_Simulating_noisy_quantum_circuits_with_matrix_product_density_operators","347120295_What_Limits_the_Simulation_of_Quantum_Computers","344446932_Efficient_classical_simulation_of_noisy_random_quantum_circuits_in_one_dimension","343750626_Quantum_error_correction_of_a_qubit_encoded_in_grid_states_of_an_oscillator","342722490_Quantum_advantage_with_noisy_shallow_circuits","337600583_Analog_errors_in_quantum_annealing_doom_and_hope","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","349051165_Blueprint_for_a_Scalable_Photonic_Fault-Tolerant_Quantum_Computer","345470753_Quantum_Information_Meets_Quantum_Matter_From_Quantum_Entanglement_to_Topological_Phases_of_Many-Body_Systems","342074693_Small_Highly_Accurate_Quantum_Processor_for_Intermediate-Depth_Quantum_Simulations"]}