{"id":"346860503_Robust_position_sensing_with_wave_fingerprints_in_dynamic_complex_propagation_environments","abstract":"Irregular propagation environments with complex scattering effects challenge traditional ray-tracing-based localization. However, the environment's complexity enables solutions based on wave fingerprints (WFPs). WFPs leverage the complexity to naturally multiplex scene information across a diverse set of measurement modes, yielding a unique measurement vector for each object position. Often a single detector suffices by making use of the spectral or configurational diversity that is offered by the medium's natural frequency diversity or reconfigurable intelligent surfaces, respectively. Yet, since WFPs rely on the extreme sensitivity of the chaotic wave field to geometrical details, it is not clear how viable WFP techniques may be in a realistic dynamically evolving environment. Here, we reveal that environmental perturbations reduce both the diversity of the WFP dictionary and the effective signal-to-noise ratio (SNR), such that the amount of information that can be obtained per measurement is reduced. This unfavorable effect can, however, be fully compensated by taking more measurements. We show in simulations and experiments with a low-cost software-defined radio that WFP localization of noncooperative objects is possible even when the scattering strength of the environmental perturbation significantly exceeds that of the object to be localized. Our results underline that diversity is only one important ingredient to achieve high sensing accuracy in compressed sensing, the other two being SNR and the choice of decoding method. We find that sacrificing diversity for SNR may be worthwhile and observe that simple artificial neural networks outperform traditional decoding methods in terms of the achieved sensing accuracy, especially at low SNR. Our results on robust position sensing have direct technological relevance in wireless communication, ambient-assisted living, human-machine interaction, retail analytics, and security applications.","authors":["Philipp del Hougne"],"meta":["November 2020Physical Review Research 2(4)","DOI:10.1103/PhysRevResearch.2.043224"],"references":["343517366_Far-Field_Subwavelength_Acoustic_Imaging_by_Deep_Learning","340562961_Intelligent_Electromagnetic_Sensing_with_Learnable_Data_Acquisition_and_Processing","337799775_Learned_Integrated_Sensing_Pipeline_Reconfigurable_Metasurface_Transceivers_as_Trainable_Physical_Layer_in_an_Artificial_Neural_Network","335401279_A_Belief_Propagation_Algorithm_for_Multipath-Based_SLAM","333883988_Massive_MIMO-Based_Localization_and_Mapping_Exploiting_Phase_Information_of_Multipath_Components","346066397_Implementation_and_Characterization_of_a_Two-Dimensional_Printed_Circuit_Dynamic_Metasurface_Aperture_for_Computational_Microwave_Imaging","343352053_Implementing_nonuniversal_features_with_a_random_matrix_theory_approach_Application_to_space-to-configuration_multiplexing","343117287_Small-brain_neural_networks_rapidly_solve_inverseproblems_with_vortex_Fourier_encoders","340905495_Optimal_Multiplexing_of_Spatially_Encoded_Information_across_Custom-Tailored_Configurations_of_a_Metasurface-Tunable_Chaotic_Cavity","335197682_Enabling_Situational_Awareness_in_Millimeter_Wave_Massive_MIMO_Systems"]}