{"id":"346999408_An_efficient_mixture_of_deep_and_machine_learning_models_for_COVID-19_diagnosis_in_chest_X-ray_images","abstract":"A newly emerged coronavirus (COVID-19) seriously threatens human life and health worldwide. In coping and fighting against COVID-19, the most critical step is to effectively screen and diagnose infected patients. Among them, chest X-ray imaging technology is a valuable imaging diagnosis method. The use of computer-aided diagnosis to screen X-ray images of COVID-19 cases can provide experts with auxiliary diagnosis suggestions, which can reduce the burden of experts to a certain extent. In this study, we first used conventional transfer learning methods, using five pre-trained deep learning models, which the Xception model showed a relatively ideal effect, and the diagnostic accuracy reached 96.75%. In order to further improve the diagnostic accuracy, we propose an efficient diagnostic method that uses a combination of deep features and machine learning classification. It implements an end-to-end diagnostic model. The proposed method was tested on two datasets and performed exceptionally well on both of them. We first evaluated the model on 1102 chest X-ray images. The experimental results show that the diagnostic accuracy of Xception + SVM is as high as 99.33%. Compared with the baseline Xception model, the diagnostic accuracy is improved by 2.58%. The sensitivity, specificity and AUC of this model reached 99.27%, 99.38% and 99.32%, respectively. To further illustrate the robustness of our method, we also tested our proposed model on another dataset. Finally also achieved good results. Compared with related research, our proposed method has higher classification accuracy and efficient diagnostic performance. Overall, the proposed method substantially advances the current radiology based methodology, it can be very helpful tool for clinical practitioners and radiologists to aid them in diagnosis and follow-up of COVID-19 cases.","authors":["Dingding Wang","Jiaqing Mo","Gang Zhou","Liang Xu"],"meta":["November 2020PLoS ONE 15(11):e0242535","DOI:10.1371/journal.pone.0242535"],"references":["351445526_Automatic_detection_of_coronavirus_disease_COVID-19_using_X-ray_images_and_deep_convolutional_neural_networks","346521704_COVID-Net_a_tailored_deep_convolutional_neural_network_design_for_detection_of_COVID-19_cases_from_chest_X-ray_images","339984160_Clinical_and_CT_Imaging_Features_of_the_COVID-19_Pneumonia_Focus_on_Pregnant_Women_and_Children","341957528_CoroNet_A_Deep_Neural_Network_for_Detection_and_Diagnosis_of_COVID-19_from_Chest_X-ray_Images","341704575_Application_of_deep_learning_for_fast_detection_of_COVID-19_in_X-Rays_using_nCOVnet","340935440_Automated_Detection_of_COVID-19_Cases_Using_Deep_Neural_Networks_with_X-ray_Images","340279344_Covid-19_Automatic_detection_from_X-Ray_images_utilizing_Transfer_Learning_with_Convolutional_Neural_Networks","339516973_World_Health_Organization_declares_Global_Emergency_A_review_of_the_2019_Novel_Coronavirus_COVID-19","339332106_A_deep_learning_algorithm_using_CT_images_to_screen_for_Corona_Virus_Disease_COVID-19","339246360_Imaging_Profile_of_the_COVID-19_Infection_Radiologic_Findings_and_Literature_Review"]}