{"id":"346917470_CRIC_Computing_Resource_Information_Catalogue_as_a_unified_topology_system_for_a_large_scale_heterogeneous_and_dynamic_computing_infrastructure","abstract":"CRIC is a high-level information system which provides flexible, reliable and complete topology and configuration description for a large scale distributed heterogeneous computing infrastructure. CRIC aims to facilitate distributed computing operations for the LHC experiments and consolidate WLCG topology information. It aggregates information coming from various low-level information sources and complements topology description with experimentspecific data structures and settings required by the LHC VOs in order to exploit computing resources.\nBeing an experiment-oriented but still experiment-independent information middleware, CRIC offers a generic solution, in the form of a suitable framework with appropriate interfaces implemented, which can be successfully applied on the global WLCG level or at the level of a particular LHC experiment. For example there are CRIC instances for CMS[11] and ATLAS[10]. CRIC can even be used for a special task. For example, a dedicated CRIC instance has been built to support transfer tests performed by DOMA Third Party Copy working group. Moreover, extensibility and flexibility of the system allow CRIC to follow technology evolution and easily implement concepts required to describe new types of computing and storage resources.\nThe contribution describes the overall CRIC architecture, the plug-in based implementation of the CRIC components as well as recent developments and future plans.","authors":["Alexey Anisenkov","Julia Andreeva","Alessandro Di Girolamo","Panos Paparrigopoulos"],"meta":["January 2020The European Physical Journal Conferences 245:03032","DOI:10.1051/epjconf/202024503032"],"references":["335864360_WLCG_space_accounting_in_the_SRM-less_world","321246771_AGIS_Integration_of_new_technologies_used_in_ATLAS_Distributed_Computing","228774916_Overview_of_ATLAS_PanDA_Workload_Management","30421198_GOCDB_a_Topology_Repository_for_a_Worldwide_Grid_Infrastructure","4054242_The_Nordugrid_production_grid_infrastructure_status_and_plans","234146547_Computing_for_the_Large_Hadron_Collider"]}