{"id":"346986408_Development_of_Program_Comprehension_Skills_by_Novice_Programmers_-_Longitudinal_Eye_Tracking_Studies","abstract":"The article discusses the findings of longitudinal studies (three stages spanning 6 months) which were to investigate the process of acquiring the ability to comprehension program code by the computer science students having started to learn to program. The studies were conducted with the use of a knowledge measurement test, the diagnostic survey, and eye tracking technology that enabled the recording of movement of the subjects’ eyes and an analysis of the patterns of information processing during solving programming problems. The obtained results have shown that the students solved the tasks most effectively in the last stage of the research during which they obtained the highest indicator of correct answers in the significantly shortest time. In the last stage of the research the dominant form of the algorithmic problem analysis was code, in two previous it was flowchart. The eye tracking data have shown that regardless of the research stage the code analysis was definitely connected with a greater number of fixations, with very near values of time devoted to solving those two forms of the algorithm. The participants who increased their competences in a scope of the program code analysis had a significantly greater saccade amplitude average (SAA) and a significantly shorter fixation duration average (FDA) in the last stage of the research comparing to previous ones. The results suggest that the FDA and SAA are parameters sensitive to the development of program comprehension skills.","authors":["Magdalena Andrzejewska","Paweł Kotoniak"],"meta":["December 2020Informatics in Education 19(4):521-541","DOI:10.15388/infedu.2020.23"],"references":["341907683_A_Fine-grained_Assessment_on_Novice_Programmers'_Gaze_Patterns_on_Pseudocode_Problems","322375999_A_Survey_on_the_Usage_of_Eye-Tracking_in_Computer_Programming","293652017_The_impact_of_syntax_colouring_on_program_comprehension","259930876_Learning_to_program_learning_to_teach_programming_A_closer_look","257560017_The_impact_of_identifier_style_on_effort_and_comprehension","335780448_Visually_Analyzing_Students'_Gaze_on_C_Code_Snippets","301476421_Eye_Movements_in_Code_Reading_Relaxing_the_Linear_Order","290454188_Syntax_highlighting_as_an_influencing_factor_when_reading_and_comprehending_source_code","282401858_Eye-tracking_verification_of_the_strategy_used_to_analyse_algorithms_expressed_in_a_flowchart_and_pseudocode","259165122_A_review_of_using_eye-tracking_technology_in_exploring_learning_from_2000_to_2012"]}