{"id":"346991017_Analisis_de_la_Calidad_de_Objetos_de_Aprendizaje_en_Contextos_Universitarios_Quality_Analysis_of_Learning_Objects_in_Academic_Contexts_ARTICLE_HISTORY","abstract":"The quality levels of educational institutions are influenced by the quality of learning objects used in their teaching processes. Considering that there are two disciplines involved in the definition, design and development of these objects, Computer Sciences on the one hand, and Educational Sciences in the other, both realities must be taken into account when analysing the quality of a learning object. Although there are recommendations and standards that propose models to evaluate the quality of software, they were thought and developed with the aim of being adapted to different artifacts at their different stages (design, development process, use, etc.). Therefore, it is necessary to review the proposals and to adapt them specifically to the learning objects inserted in an academic context. This implies considering not only technical but also its pedagogical aspects as well. In this work, a review is made of different existing proposals, both those related to software and those related to learning objects. As a result, a set of general criteria specially selected to evaluate the quality of learning objects managed by learning management systems in academic contexts, is presented. This is the first step to the development of a quality analysis model of learning objects.","authors":["Valeria Bertossi","Karina Viviana Martinez","Lucila Romero","María De los Milagros Gutiérrez"],"meta":["June 2020","Project: Framework based on ontology network to support portfolio management as a means of assessing the learning process in e-learning environments"],"references":["281242142_EODAR_Herramienta_para_la_Evaluacion_de_Objetos_Didacticos_de_Aprendizaje_Reutilizables","267388791_La_Determinacion_de_la_Calidad_de_Objetos_de_Aprendizaje","228626602_Calidad_en_objetos_de_aprendizaje","39202451_Reusabilidad_y_reutilizacion_de_objetos_didacticos_Mitos_realidades_y_posibilidades","26473555_La_calidad_de_los_contenidos_educativos_reutilizables_diseno_usabilidad_y_practicas_de_uso","354010595_Objetos_de_Aprendizaje_cuatro_anos_despues","291971737_Analisis_de_criterios_de_evaluacion_para_la_calidad_de_los_materiales_didacticos_digitales","279605485_A_Framework_for_Evaluating_the_Quality_of_Multimedia_Learning_Resources","268263798_Evaluacion_de_Objetos_de_Aprendizaje_a_traves_del_Aseguramiento_de_Competencias_Educativas","31637026_Calidad_productividad_y_competitividad_la_salida_de_la_crisis_WE_Deming"]}