{"id":"346903770_ATLAS_Data_Carousel","abstract":"The ATLAS experiment at CERN’s LHC stores detector and simulation data in raw and derived data formats across more than 150 Grid sites world-wide, currently in total about 200PB on disk and 250PB on tape. Data have different access characteristics due to various computational workflows, and can be accessed from different media, such as remote I/O, disk cache on hard disk drives or SSDs. Also, larger data centers provide the majority of offline storage capability via tape systems. For the HighLuminosity LHC (HL-LHC), the estimated data storage requirements are several factors bigger than the present forecast of available resources, based on a flat budget assumption. On the computing side, ATLAS Distributed Computing was very successful in the last years with high performance and high throughput computing integration and in using opportunistic computing resources for the Monte Carlo simulation. On the other hand, equivalent opportunistic storage does not exist. ATLAS started the Data Carousel project to increase the usage of less expensive storage, i.e. tapes or even commercial storage, so it is not limited to tape technologies exclusively. Data Carousel orchestrates data processing between workload management, data management, and storage services with the bulk data resident on offline storage. The processing is executed by staging and promptly processing a sliding window of inputs onto faster buffer storage, such that only a small percentage of input data are available at any one time. With this project, we aim to demonstrate that this is the natural way to dramatically reduce our storage cost. The first phase of the project was started in the fall of 2018 and was related to I/O tests of the sites archiving systems. Phase II now requires a tight integration of the workload and data management systems. Additionally, the Data Carousel studies the feasibility to run multiple computing workflows from tape. The project is progressing very well and the results presented in this document will be used before the LHC Run 3.","authors":["Martin Barisits","Mikhail Borodin","Alessandro Di Girolamo","Johannes Elmsheuser"],"meta":["January 2020The European Physical Journal Conferences 245:04035","DOI:10.1051/epjconf/202024504035"],"references":["335081057_Rucio_Scientific_Data_Management","321233296_The_ATLAS_Production_System_Evolution_New_Data_Processing_and_Analysis_Paradigm_for_the_LHC_Run2_and_High-Luminosity","263050392_FTS3_New_data_movement_service_for_WLCG","2532886_Storage_Resource_Managers_Middleware_Components_for_Grid_Storage","258309263_LHC_machine","231002727_Tape_Storage_Optimization_at_BNL"]}