{"id":"346993824_A_Study_on_Domination_in_Vague_Incidence_Graph_and_Its_Application_in_Medical_Sciences","abstract":"Fuzzy graphs (FGs), broadly known as fuzzy incidence graphs (FIGs), have been acknowledged as being an applicable and well-organized tool to epitomize and solve many multifarious real-world problems in which vague data and information are essential. Owing to unpredictable and unspecified information being an integral component in real-life problems that are often uncertain, it is highly challenging for an expert to illustrate those problems through a fuzzy graph. Therefore, resolving the uncertainty accompanying the unpredictable and unspecified information of any real-world problem can be done by applying a vague incidence graph (VIG), based on which the FGs may not engender satisfactory results. Similarly, VIGs are outstandingly practical tools for analyzing different computer science domains such as networking, clustering, and also other issues such as medical sciences, and traffic planning. Dominating sets (DSs) enjoy practical interest in several areas. In wireless networking, DSs are being used to find efficient routes with ad-hoc mobile networks. They have also been employed in document summarization, and in secure systems designs for electrical grids; consequently, in this paper, we extend the concept of the FIG to the VIG, and show some of its important properties. In particular, we discuss the well-known problems of vague incidence dominating set, valid degree, isolated vertex, vague incidence irredundant set and their cardinalities related to the dominating, etc. Finally, a DS application for VIG to properly manage the COVID-19 testing facility is introduced.","authors":["Yongsheng Rao","Saeed Kosari","Zehui Shao","Ruiqi Cai"],"meta":["November 2020Symmetry 12(11):1885","DOI:10.3390/sym12111885"],"references":["345710088_Certain_Concepts_of_Vague_Graphs_With_Applications_to_Medical_Diagnosis","345484775_Certain_Properties_of_Vague_Graphs_with_a_Novel_Application","345400317_Vague_Graph_Structure_with_Application_in_Medical_Diagnosis","343309796_New_Concepts_in_Intuitionistic_Fuzzy_Graph_with_Application_in_Water_Supplier_Systems","339128662_Generalization_of_Maximizing_Deviation_and_TOPSIS_Method_for_MADM_in_Simplified_Neutrosophic_Hesitant_Fuzzy_Environment","326965390_Energy_of_Pythagorean_Fuzzy_Graphs_with_Applications","321888290_Certain_Concepts_in_Intuitionistic_Neutrosophic_Graph_Structures","336250068_New_concepts_of_domination_sets_in_vague_graphs_with_applications","323758592_Vulnerability_and_Government_Response_to_Human_Trafficking_Vague_Fuzzy_Incidence_Graphs","320243443_Human_Trafficking_Source_Transit_Destination_Designations"]}