{"id":"346955574_Volumen_16_2020","abstract":"In the work, a system of didactic procedures is proposed to perfect the investigative skills of Computer Science students. It was prepared as part of a doctoral thesis, using the Functional Structural Systemic Method. It has been applied at the Universidad de Oriente (UO) for five courses, with results that have confirmed that the system provides sufficient evidence about its possibilities of improving the investigative skills of the aforementioned students, by contributing to the development of computational investigative thinking in them.\nEn el trabajo se propone un sistema de procedimientos didácticos para perfeccionar las habilidades investigativas de los estudiantes de Ciencia de la Computación. El mismo fue elaborado como parte de una tesis doctoral, empleando el Método Sistémico Estructural Funcional. Ha sido aplicado en la Universidad de Oriente (UO) por cinco cursos, con resultados que han confirmado que el sistema brinda suficientes evidencias sobre sus posibilidades de perfeccionar las habilidades investigativas de los citados estudiantes, al contribuir al desarrollo de un pensamiento investigativo computacional en estos.","authors":["Ekaterine M Fergusson Ramirez","Alonso Berenguer Isabel","Alexander Gorina Sánchez","Yoan I. Viamonte Garrido"],"meta":["December 2020","Project: Formación investigativa en carreras de las ciencias computacionales"],"references":["327872016_Perfeccionando_los_procedimientos_didacticos_para_la_formacion_investigativa_de_estudiantes_de_Ciencia_de_la_ComputacionImproving_didactic_procedures_for_research_training_of_Computer_Science_students","312892538_Estudio_Exploratorio_sobre_la_Formacion_Investigativa_de_los_Estudiantes_de_Licenciatura_en_Ciencia_de_la_Computacion","312891180_CONSIDERACIONES_EPISTEMOLOGICAS_SOBRE_LA_FORMACION_INVESTIGATIVA_DEL_LICENCIADO_EN_CIENCIA_DE_LA_COMPUTACION","262460589_FORMACION_DE_HABILIDADES_PARA_LA_INVESTIGACION_DESDE_EL_PREGRADO","320430770_SISTEMA_DE_PROCEDIMIENTOS_DIDACTICOS_PARA_LA_FORMACION_INVESTIGATIVA_EN_CIENCIA_DE_LA_COMPUTACION","227431202_LA_CULTURA_INFORMATICA_DEL_PROFESOR_DE_COMPUTACION_EN_CUBA"]}