{"id":"347000441_A_Wavelet_Transform-Assisted_Convolutional_Neural_Network_Multi-Model_Framework_for_Monitoring_Large-Scale_Fluorochemical_Engineering_Processes","abstract":"The barely satisfactory monitoring situation of the hypertoxic fluorochemical engineering processes requires the application of advanced strategies. In order to deal with the non-linear mechanism of the processes and the highly complicated correlation among variables, a wavelet transform-assisted convolutional neural network (CNN) based multi-model dynamic monitoring method was proposed. A preliminary CNN model was first trained to detect faults and to diagnose part of them with minimum computational burden and time delay. Then, a wavelet assisted secondary CNN model was trained to diagnose the remaining faults with the highest possible accuracy. In this step, benefitting from the scale decomposition capabilities of the wavelet transform function, the inherent noise and redundant information could be filtered out and the useful signal was transformed into a higher compact space. In this space, a well-designed secondary CNN model was trained to further improve the fault diagnosis performance. The application on a refrigerant-producing process located in East China showed that not only regular faults but also hard to diagnose faults were successfully detected and diagnosed. More importantly, the unique online queue assembly updating strategy proposed remarkably reduced the inherent time delay of the deep-learning methods. Additionally, the application of it on the widely used Tennessee Eastman process benchmark strongly proved the superiority of it in fault detection and diagnosis over other deep-learning methods.","authors":["Xintong Li","Kun Zhou","Feng Xue","Zhibing Chen"],"meta":["November 2020Processes 8(11):1480","DOI:10.3390/pr8111480"],"references":["345446801_Multi-Level_Wavelet_Convolutional_Neural_Networks","337663638_A_slow_independent_component_analysis_algorithm_for_time_series_feature_extraction_with_the_concurrent_consideration_of_high-order_statistic_and_slowness","337539812_Understanding_and_Learning_Discriminant_Features_based_on_Multi-Attention_1DCNN_for_Wheelset_Bearing_Fault_Diagnosis","336471079_Fault_diagnosis_of_nonlinear_systems_using_recurrent_neural_networks","332718288_Stable_Principal_Component_Pursuit_via_Convex_Analysis","331338680_Multi-Speaker_DOA_Estimation_Using_Deep_Convolutional_Networks_Trained_With_Noise_Signals","330314013_Fault_diagnosis_for_distillation_process_based_on_CNN-DAE","325773948_Fast_Multiway_Partial_Least_Squares_Regression","324445648_Deep_convolutional_neural_network_model_based_chemical_process_fault_diagnosis","323843966_Rolling_Element_Bearing_Fault_Diagnosis_using_Convolutional_Neural_Network_and_Vibration_Image"]}