{"id":"347082429_Cognitive_Association_in_Interactive_Evolutionary_Design_Process_for_Product_Styling_and_Application_to_SUV_Design","abstract":"In recent years, intelligent design technology that is based on interactive evolutionary algorithms, namely interactive evolutionary design (IED) systems, has received extensive attention in the computer science, design, and other related literature. However, due to the complexity of design problems and the limitation of human cognitive ability, IED faces several challenges in actual design applications. With the aim to address these problems in the IED, this paper deconstructs the IED of the product styling from the perspective of the cognitive association of the users, and proposes a corresponding cognitive intervention method that is based on the association of information. We built databases of the perceptual evaluation results of typical cases and coded profiles of the typical cases, combined with the corresponding interaction process, to improve the efficiency of creating associations between dissimilar information in the early stages of evolution. Besides, in order to simplify the process of creating associations between similar information, this paper proposes a clustering model of similar information based on explicit and implicit distances. The proposed method is then applied to the evolutionary design of an SUV. The experimental results show that the proposed method reduces the initial and total evaluation time. Therefore, the proposed method improves users’ ability to understand the complex design tasks of IED for product styling, optimizing the interactive evaluation process by guiding designers to efficiently create the cognitive association of information, and increases the effectiveness of adopting IED to solve actual design problems about product styling.","authors":["Dong Zeng","Mao-en He","Xing-zhi Tang","Fa-guang Wang"],"meta":["November 2020Electronics 9(11):1960","DOI:10.3390/electronics9111960"],"references":["343598065_Subjective_Product_Evaluation_System_Based_on_Kansei_Engineering_and_Analytic_Hierarchy_Process","341588950_Solution_to_Resolve_Cognitive_Ambiguity_in_Interactive_Customization_of_Product_Shape","340597321_Effects_of_spatial_distance_on_the_effectiveness_of_mental_and_physical_integration_strategies_in_learning_from_split-attention_examples","338992862_Experiential_characterization_of_materials_in_product_design_A_literature_review","344437093_Exploring_the_use_of_AR_technology_for_co-creative_product_and_packaging_design","340270537_Understanding_emotions_in_SNS_images_from_posters'_perspectives","339765192_A_method_to_reduce_the_computational_cost_of_Modified_Hausdorff_Distance_in_Face_Recognition","339606869_A_method_for_product_form_design_of_integrating_interactive_genetic_algorithm_with_the_interval_hesitation_time_and_user_satisfaction","339581922_Interactive_Genetic_Algorithm_to_Collect_User_Perceptions_Application_to_the_Design_of_Stemmed_Glasses","338779567_Generating_Kranok_patterns_with_an_interactive_evolutionary_algorithm"]}