{"id":"347052919_A_Paradigm-Shifting_From_Domain-Driven_Data_Mining_Frameworks_to_Process-Based_Domain-Driven_Data_Mining-Actionable_Knowledge_Discovery_Framework","abstract":"The success of data mining learned rules highly depends on its actionability: how useful it is to perform suitable actions in any real business environment. To improve rule actionability, different researchers have initially presented various Data Mining (DM) frameworks by focusing on different factors only from the business domain \ndataset \n. Afterward, different Domain-Driven Data Mining (D3M) frameworks were introduced by focusing \non domain knowledge \nfactors from the context of the overall business environment. Despite considering these several \ndataset \nfactors and \ndomain knowledge \nfactors in different phases of their frameworks, the learned rules still lacked actionability. The objective of our research is to improve the learned rules’ actionability. For this purpose, we have analyzed: (1) what overall actions or tasks are being performed in the overall business process, (2) in which sequence different tasks are being performed, (3) under what certain conditions these tasks are being performed, (4) by whom the tasks are being performed (5) what data is provided and produced in performing these tasks. We observed that the inclusion of rule learning factors only from \ndataset \nor from \ndomain knowledge \nis not sufficient. Our Process-based Domain-Driven Data Mining-Actionable Knowledge Discovery (PD3M-AKD) framework explains its different phases to consider and include additional factors from \nfive perspectives \nof the business process. This PD3M-AKD framework is also in line with the existing phases of current DM and D3M frameworks for considering and including \ndataset \nand \ndomain knowledge \naccordingly. Finally, we evaluated and validated our case study results from different real-life scenarios from education, engineering, and business process domains at the end.","authors":["Fakeeha Fatima","Ramzan Talib","Muhammad Kashif","Muhammad Awais"],"meta":["January 2020IEEE Access 8:210763-210774","DOI:10.1109/ACCESS.2020.3039111"],"references":["338052900_Educational_Data_Mining_and_Learning_Analytics_An_Updated_Survey","337980314_Actionable_Knowledge_Discovery_for_Increasing_Enterprise_Profit_Using_Domain_Driven-Data_Mining","331723990_DMME_Data_mining_methodology_for_engineering_applications_-_a_holistic_extension_to_the_CRISP-DM_model","327062697_Designing_Digital_Workplace_Environments","320714689_Context-sensitive_constraints_for_access_control_of_business_processes","348574983_Business_Process_Management","338199090_CRISP-DM_Twenty_Years_Later_From_Data_Mining_Processes_to_Data_Science_Trajectories","333196773_A_practical_iterative_framework_for_secondary_data_analysis_in_educational_research","324453295_Exploring_the_relationship_between_students'_learning_styles_and_learning_outcome_in_engineering_laboratory_education","321175992_Using_Constraint_Satisfaction_Problem_Solving_to_Enable_Workflow_Flexibility_by_Deviation_Best_Technical_Paper"]}