{"id":"347176108_Unreliable_Users_Detection_in_Social_Media_Deep_Learning_Techniques_for_Automatic_Detection","abstract":"Since the harmful consequences of the online publication of fake news have emerged clearly, many research groups worldwide have started to work on the design and creation of systems able to detect fake news and entities that share it consciously. Therefore, manifold automatic, manual, and hybrid solutions have been proposed by industry and academia. In this article, we describe a deep investigation of the features that both from an automatic and a human point of view, are more predictive for the identification of social network profiles accountable for spreading fake news in the online environment. To achieve this goal, the features of the monitored users were extracted from \nTwitter \n, such as social and personal information as well as interaction with content and other users. Subsequently, we performed \n(i) \nan offline analysis realized through the use of deep learning techniques and \n(ii) \nan online analysis that involved real users in the classification of reliable/unreliable user profiles. The experimental results, validated from a statistical point of view, show which information best enables machines and humans to detect malicious users. We hope that our research work will provide useful insights for realizing ever more effective tools to counter misinformation and those who spread it intentionally.","authors":["Giuseppe Sansonetti","Fabio Gasparetti","Giuseppe D'Aniello","Alessandro Micarelli"],"meta":["January 2020IEEE Access 8:213154-213167","DOI:10.1109/ACCESS.2020.3040604"],"references":["342762209_A_Survey_of_Fake_News_Fundamental_Theories_Detection_Methods_and_Opportunities","342254766_Mining_Disinformation_and_Fake_News_Concepts_Methods_and_Recent_Advancements","337586319_Network-based_Fake_News_Detection_A_Pattern-driven_Approach","354518019_Continual_Learning_for_Fake_News_Detection_from_Social_Media","350727886_Graph_neural_networks_A_review_of_methods_and_applications","343300543_GCAN_Graph-aware_Co-Attention_Networks_for_Explainable_Fake_News_Detection_on_Social_Media","341907285_Rumor_Detection_on_Social_Media_with_Bi-Directional_Graph_Convolutional_Networks","340145429_A_Comprehensive_Survey_on_Graph_Neural_Networks","338613466_Semi-supervised_learning_and_graph_neural_networks_for_fake_news_detection","336200793_Multi-depth_Graph_Convolutional_Networks_for_Fake_News_Detection"]}