{"id":"347238427_How_general_is_cognitive_ability_in_non-human_animals_A_meta-analytical_and_multi-level_reanalysis_approach","abstract":"General intelligence has been a topic of high interest for over a century. Traditionally, research on general intelligence was based on principal component analyses and other dimensionality reduction approaches. The advent of high-speed computing has provided alternative statistical tools that have been used to test predictions of human general intelligence. In comparison, research on general intelligence in non-human animals is in its infancy and still relies mostly on factor-analytical procedures. Here, we argue that dimensionality reduction, when incorrectly applied, can lead to spurious results and limit our understanding of ecological and evolutionary causes of variation in animal cognition. Using a meta-analytical approach, we show, based on 555 bivariate correlations, that the average correlation among cognitive abilities is low (r = 0.185; 95% CI: 0.087–0.287), suggesting relatively weak support for general intelligence in animals. We then use a case study with relatedness (genetic) data to demonstrate how analysing traits using mixed models, without dimensionality reduction, provides new insights into the structure of phenotypic variance among cognitive traits, and uncovers genetic associations that would be hidden otherwise. We hope this article will stimulate the use of alternative tools in the study of cognition and its evolution in animals.","authors":["Marc-Antoine Poirier","Dovid Kozlovsky","Julie Morand-Ferron","Vincent Careau"],"meta":["December 2020Proceedings of the Royal Society B: Biological Sciences 287(1940):20201853","DOI:10.1098/rspb.2020.1853"],"references":["345667721_Planned_missing_data_design_stronger_inferences_increased_research_efficiency_and_improved_animal_welfare_in_ecology_and_evolution","344074104_Heritability_and_correlations_among_learning_and_inhibitory_control_traits","333321108_The_Heritability_of_Behavior_A_Meta-analysis","331220404_Data_reduction_analyses_of_animal_behaviour_avoiding_Kaiser's_criterion_and_adopting_more_robust_automated_methods","328367981_On_the_usage_of_single_measurements_in_behavioural_ecology_research_on_individual_differences","326997183_The_impact_of_environmental_interventions_among_mouse_siblings_on_the_heritability_and_malleability_of_general_cognitive_ability","326996396_Measuring_and_understanding_individual_differences_in_cognition","326825902_The_repeatability_of_cognitive_performance_A_meta-analysis","335317104_Be_careful_with_your_principal_components","326997419_Heritabilities_and_co-variation_among_cognitive_traits_in_red_junglefowl"]}