{"id":"347261394_Pattern_Separation_Network_Based_on_the_Hippocampus_Activity_for_Handwritten_Recognition","abstract":"Reaching high accuracy in handwritten character recognition is an essential challenge since it is widely used in many fields such as signature analysis and forgery detection. Recently, deep learning has demonstrated efficiency in this field. The problem with deep learning is that it uses a vast number of parameters that require a large dataset for training. To overcome this problem, an intelligent network is proposed in this study, based on the computational function of the dentate gyrus of the brain’s hippocampus. The ability to separate patterns with high overlapping is a task that is referred to as the dentate gyrus. Handwritten character images have high overlapping due to various writers’ styles, or even one writer’s style under different conditions. Therefore, proposing a network based on the dentate gyrus’ functional computation can be useful in this field. One of the prominent features of the proposed network is employing two excitation steps and two inhibition steps, augmenting the accuracy of recognizing handwritten characters. The proposed network was evaluated with six datasets of digits and characters from five languages. Experiments on all of the used datasets showed promising results. Moreover, a comparative and detailed analysis of the proposed network with other SOM-based and deep learning methods is provided. Experimental results show a significant boost in accuracy. While the character error rate (CER) was smaller than 1.85% for all the experiments, the smallest CER of 0.6% was achieved by the MNIST dataset. Moreover, in recognizing patterns with high noise, the proposed network showed satisfactory results.","authors":["Nazal Modhej","Azam Bastanfard","Mohammad Teshnehlab","Somayeh Raiesdana"],"meta":["January 2020IEEE Access 8:212803-212817","DOI:10.1109/ACCESS.2020.3040298","Project: Pattern separation"],"references":["343762421_Optical_character_recognition_with_neural_networks_and_post-correction_with_finite_state_methods","343265561_Analysis_and_comparison_of_machine_learning_classifiers_and_deep_neural_networks_techniques_for_recognition_of_Farsi_handwritten_digits","341362148_Comparative_Study_on_Deep_Convolution_Neural_Networks_DCNN-Based_Offline_Arabic_Handwriting_Recognition","341159181_Multi-View_Deep_Network_A_Deep_Model_Based_on_Learning_Features_From_Heterogeneous_Neural_Networks_for_Sentiment_Analysis","337779375_User_Power_Interaction_Behavior_Clustering_Analysis_That_is_Based_on_the_Self-Organizing-Center_K-Means_Algorithm","337690261_DIGI-Net_a_deep_convolutional_neural_network_for_multi-format_digit_recognition","339558647_Scaling_and_Benchmarking_Self-Supervised_Visual_Representation_Learning","334861616_Contributions_of_adult_neurogenesis_to_dentate_gyrus_network_activity_and_computations","334235051_A_Study_on_the_Effect_of_CNN-Based_Transfer_Learning_on_Handwritten_Indic_and_Mixed_Numeral_Recognition","333997942_An_Advanced_Particle_Swarm_Optimization_Based_Feature_Selection_Method_for_Tri-script_Handwritten_Digit_Recognition"]}