{"id":"347265974_A_Robust_Method_for_Wheatear_Detection_Using_UAV_in_Natural_Scenes","abstract":"In recent years, deep learning has greatly improved the ability of wheatear detection. However, there are still three main problems in wheatear detection based on unmanned aerial vehicle (UAV) platforms. First, dense wheat plants often overlap, and the wind direction will blur the pictures, which obviously interferes with the detection of wheatears; second, due to the different maturity, color, genotype, and head orientation, the appearance will also be different; third, UAV needs to take images in the field and conduct real-time detection, which requires the embedded module to detect wheatears quickly and accurately. Given the above problems, we studied and improved YoloV4, and proposed a robust method for wheatear detection using UAV in natural scenes. For the first problem, we modified the network structure, deleted the feature map with a size of 19×19, and used k-means algorithm to re-cluster the anchors, and we proposed a method of prediction box fusion. For the second problem, we used the pseudo-labeling method and data augmentation methods to improve the generalization ability of the model. For the third problem, we simplified the network structure, replaced the original network convolution with the improved depthwise separable convolution, and proposed an adaptive ReLU activation function to reduce the amount of calculation and speed up the calculation. The experimental results showed that our method can effectively mark the bounding of wheatears. In test sets, our method achieves 96.71% in f1-score, which is 9.61% higher than the state of the art method, and the detection speed is 23% faster than the original method. It can be concluded that our method can effectively solve the problems of wheatear detection based on the UAV platform in natural scenes.","authors":["Ming-Xiang He","Peng Hao","You-Zhi Xin"],"meta":["January 2020IEEE Access 8:189043-189053","DOI:10.1109/ACCESS.2020.3031896"],"references":["343777487_Global_Wheat_Head_Detection_GWHD_Dataset_A_Large_and_Diverse_Dataset_of_High-Resolution_RGB-Labelled_Images_to_Develop_and_Benchmark_Wheat_Head_Detection_Methods","343270535_CSPNet_A_New_Backbone_that_can_Enhance_Learning_Capability_of_CNN","342112744_Evaluation_of_Efficacy_of_Fungicides_for_Control_of_Wheat_Fusarium_Head_Blight_Based_on_Digital_Imaging","337879025_Combined_Use_of_FCN_and_Harris_Corner_Detection_for_Counting_Wheat_Ears_in_Field_Conditions","343456623_EfficientDet_Scalable_and_Efficient_Object_Detection","342574754_Vision_Based_Crop_Row_Detection_for_Low_Cost_UAV_Imagery_in_Organic_Agriculture","341165990_Automatic_wheat_ear_counting_using_machine_learning_based_on_RGB_UAV_imagery","339561777_CutMix_Regularization_Strategy_to_Train_Strong_Classifiers_With_Localizable_Features","338509409_Field_Wheat_Ears_Count_Based_on_YOLOv3","338325370_Segmenting_ears_of_winter_wheat_at_flowering_stage_using_digital_images_and_deep_learning"]}