{"id":"347256715_Model_for_training_of_masters_in_pedagogical_education_for_activity_in_virtual_social_and_educational_environment_based_on_development_of_digital_competences","abstract":"Problem and objective. The article provides theoretical basis for model for forming of readiness of future teachers to activity in virtual social and educational environment based on development of their digital competences. Analysis of types of activities of a future teaches listed in the Federal State Educational Standards (3++) for Higher Education and areas for application of their digital competences reveals their interconnection and provides opportunities for development of digital competences of a future teacher in the framework of suggested masters program build up based on the analysis of approximate profile of teachers digital competences. Methodology. The research is based on the analysis of digital competences of a teacher and the logic for build-up of subject training of future teaches at masters level for their successful and effective professional activity in the conditions of virtual social and educational environment based on development of their digital competences. Results. The research analyzes the content of basic digital competences of a teacher; suggests a model for development of professional readiness of a future teacher to activity in a virtual social and educational environment based on development of digital competences; formulates basic content for masters program Digital Technologies and Network Interaction in Education, Pedagogical Education, Professional Education, Additional Education based on development of digital competences of a future teacher in the framework of his professional training in an institution of higher education; formulates basic content of training in the framework of suggested disciplines of masters program. Conclusion. It is shown that for the improvement of effectiveness of teachers activity in the contemporary conditions of society digitalization and development of virtual social and educational environment it is necessary to include subject disciplines aimed at development of their digital competences on a special level into the process of their professional training.","authors":["Natalya Yu. Koroleva"],"meta":["December 2020RUDN Journal of Informatization in Education 17(3):237-253","DOI:10.22363/2312-8631-2020-17-3-237-253"],"references":["337282258_Information_and_Education_Systems_in_the_Context_of_Digitalization_of_Education","290004639_The_main_systems_and_types_of_forming_of_future_teacher-trainers'_professional_competence","276595762_Teachers'_subject_competence_in_digital_times"]}