{"id":"347214465_Systematic_Literature_Review_on_IoT-Based_Botnet_Attack","abstract":"The adoption of the Internet of Things (IoT) technology is expanding exponentially because of its capability to provide a better service. This technology has been successfully implemented on various devices. The growth of IoT devices is massive at present. However, security is becoming a major challenge with this growth. Attacks, such as IoT-based botnet attacks, are becoming frequent and have become popular amongst attackers.IoT has a resource constraint and heterogeneous environments, such as low computational power and memory. Hence, these constraints create problems in implementing a security solution in IoT devices. Therefore, various kind of attacks are possible due to this vulnerability, with IoT-based botnet attack being one of the most popular.In this study, we conducted a comprehensive systematic literature review on IoT-based botnet attacks. Existing state of the art in the area of study was presented and discussed in detail. A systematic methodology was adopted to ensure the coverage of all important studies. This methodology was detailed and repeatable. The review outlined the existing proposed contributions, datasets utilised, network forensic methods utilised and research focus of the primary selected studies. The demographic characteristics of primary studies were also outlined.The result of this review revealed that research in this domain is gaining momentum, particularly in the last 3 years (2018-2020). Nine key contributions were also identified, with Evaluation, System, and Model being the most conducted.","authors":["Abdelmuttlib Ibrahim Abdalla Ahmed"],"meta":["December 2020IEEE Access 8","DOI:10.1109/ACCESS.2020.3039985"],"references":["343856883_Disposable_botnets_examining_the_anatomy_of_IoT_botnet_infrastructure","343705931_Building_Information_Modelling_BIM_and_the_Internet-of-Things_IoT_A_Systematic_Mapping_Study","341746033_IoT_Botnet_Forensics_A_Comprehensive_Digital_Forensic_Case_Study_on_Mirai_Botnet_Servers","337021625_A_Comprehensive_Survey_on_Attacks_Security_Issues_and_Blockchain_Solutions_for_IoT_and_IIoT","336759151_A_novel_graph-based_approach_for_IoT_botnet_detection","336538417_Detecting_and_confronting_flash_attacks_from_IoT_botnets","334449850_Unsupervised_intelligent_system_based_on_one_class_support_vector_machine_and_Grey_Wolf_optimization_for_IoT_botnet_detection","336829373_IoT_Botnet_The_Largest_Threat_to_the_IoT_Network","335769607_ConnSpoiler_Disrupting_CC_Communication_of_IoT-Based_Botnet_Through_Fast_Detection_of_Anomalous_Domain_Queries","335362939_Collaborative_Agent-based_Detection_of_DDoS_IoT_Botnets"]}