{"id":"347374975_Unraveling_US_National_COVID-19_RacialEthnic_Disparities_using_County_Level_Data_Among_328_Million_Americans","abstract":"Identifying areas with high COVID-19 burden and their characteristics can help improve vaccine distribution and uptake, reduce burdens on health care systems, and allow for better allocation of public health intervention resources. Synthesizing data from various government and nonprofit institutions of 3,142 United States (US) counties as of 12/21/2020, we studied county-level characteristics that are associated with cumulative case and death rates using regression analyses. Our results showed counties that are more rural, counties with more White/non-White segregation, and counties with higher percentages of people of color, in poverty, with no high school diploma, and with medical comorbidities such as diabetes and hypertension are associated with higher cumulative COVID-19 case and death rates. We identify the hardest hit counties in US using model-estimated case and death rates, which provide more reliable estimates of cumulative COVID-19 burdens than those using raw observed county-specific rates. Identification of counties with high disease burdens and understanding the characteristics of these counties can help inform policies to improve vaccine distribution, deployment and uptake, prevent overwhelming health care systems, and enhance testing access, personal protection equipment access, and other resource allocation efforts, all of which can help save more lives for vulnerable communities.\n\nSignificance statement\nWe found counties that are more rural, counties with more White/non-White segregation, and counties with higher percentages of people of color, in poverty, with no high school diploma, and with medical comorbidities such as diabetes and hypertension are associated with higher cumulative COVID-19 case and death rates. We also identified individual counties with high cumulative COVID-19 burden. Identification of counties with high disease burdens and understanding the characteristics of these counties can help inform policies to improve vaccine distribution, deployment and uptake, prevent overwhelming health care systems, and enhance testing access, personal protection equipment access, and other resource allocation efforts, all of which can help save more lives for vulnerable communities.","authors":["Daniel Li","Sheila M. Gaynor","Corbin Quick","Jarvis T. Chen"],"meta":["December 2020","DOI:10.1101/2020.12.02.20234989"],"references":["340753910_The_COVID-19_Pandemic_a_Call_to_Action_to_Identify_and_Address_Racial_and_Ethnic_Disparities","340518069_Hospitalization_Rates_and_Characteristics_of_Patients_Hospitalized_with_Laboratory-Confirmed_Coronavirus_Disease_2019_-_COVID-NET_14_States_March_1-30_2020","343439097_Racial_and_Ethnic_Disparities_in_Population-Level_Covid-19_Mortality"]}