{"id":"347316482_Exposure_to_news_grows_less_fragmented_with_an_increase_in_mobile_access","abstract":"The abundance of media options is a central feature of today’s information environment. Many accounts, often based on analysis of desktop-only news use, suggest that this increased choice leads to audience fragmentation, ideological segregation, and echo chambers with no cross-cutting exposure. Contrary to many of those claims, this paper uses observational multiplatform data capturing both desktop and mobile use to demonstrate that coexposure to diverse news is on the rise, and that ideological self-selection does not explain most of that coexposure. We show that mainstream media outlets offer the common ground where ideologically diverse audiences converge online, though our analysis also reveals that more than half of the US online population consumes no online news, underlining the risk of increased information inequality driven by self-selection along lines of interest. For this study, we use an unprecedented combination of observed data from the United States comprising a 5-y time window and involving tens of thousands of panelists. Our dataset traces news consumption across different devices and unveils important differences in news diets when multiplatform or desktop-only access is used. We discuss the implications of our findings for how we think about the current communication environment, exposure to news, and ongoing attempts to limit the effects of misinformation.","authors":["Tian Yang","Sílvia Majó-Vázquez","Rasmus K. Nielsen","Sandra González-Bailón"],"meta":["November 2020Proceedings of the National Academy of Sciences 117(46):28678-28683","DOI:10.1073/pnas.2006089117"],"references":["340432016_Evaluating_the_fake_news_problem_at_the_scale_of_the_information_ecosystem","338862406_How_social_network_sites_and_other_online_intermediaries_increase_exposure_to_news","354106938_Partisan_Enclaves_and_Information_Bazaars_Mapping_Selective_Exposure_to_Online_News","349479455_Almost_Everything_in_Moderation_New_Evidence_on_Americans'_Online_Media_Diets","340753459_Exposure_to_News_Grows_Less_Fragmented_with_Increase_in_Mobile_Access","338207366_Evaluating_the_Fake_News_Problem_at_the_Scale_of_the_Information_Ecosystem","337996872_Studying_human_attention_on_the_Internet","337606251_Partisan_selective_exposure_in_online_news_consumption_evidence_from_the_2016_presidential_campaign","332610751_Echo-chambers_in_online_news_consumption_Evidence_from_survey_and_navigation_data_in_Spain","329690336_The_Backbone_Structure_of_Audience_Networks_A_New_Approach_to_Comparing_Online_News_Consumption_Across_Countries"]}