{"id":"347476643_Blockchain_and_Supply_Chain_Management_A_New_Paradigm_for_Supply_Chain_Integration_and_Collaboration","abstract":"Despite there are some arguments about blockchain, it has been highlighted as an important distributed secure technology in the 21st century. It is an incorruptible digital ledger of economic transactions that can be programmed to record not just financial transactions but virtually everything of value. Dobrovnik et al. (2018) suggest that blockchain is a revolutionising technology that would change industries at an international level, add values to firms and supply chain networks, improve commerce, and drive economy. Although blockchain has attracted attentions, very few blockchain studies have been focussed on supply chain integration and collaboration areas. This study illustrates the possibilities of applying blockchain technology in the coordination of activities for effective and efficient supply chain management. The study takes a closer look at the use of blockchain in supply chains beyond cryptocurrency, payment, and finance via the use of smart contract and consensus algorithm (i.e., imposing constraints). The key attributes of blockchain are discussed and potential questions were identified in New Zealand. The expected outcome of this study will advance the understanding of the blockchain and supply chain literature, besides inspire both researchers and practitioners to consider the use of blockchain in different context-aware future studies. © 2021 Operations and Supply Chain Management Forum. All rights reserved.","authors":["Michael Wang","Yong Wu","Bruce Chen","Melissa Evans"],"meta":["December 2020Operations and Supply Chain Management An International Journal 14(1):111-122","DOI:10.31387/oscm0440290"],"references":["340214661_When_Blockchain_Meets_Supply_Chain_A_Systematic_Literature_Review_on_Current_Development_and_Potential_Applications","339171777_Logistics_innovation_capability_and_its_impacts_on_the_supply_chain_risks_in_the_Industry_40_era","338241579_A_Review_of_Blockchain-Based_Systems_in_Transportation","333876291_Managing_supply_chain_uncertainty_and_risk_in_the_pharmaceutical_industry","333511632_A_Blockchain-based_Value_Added_Tax_VAT_System_Saudi_Arabia_as_a_Use-Case","340506086_A_Framework_for_Exploring_Blockchain_Technology_in_Supply_Chain_Management","338429442_A_supply_chain_transparency_and_sustainability_technology_appraisal_model_for_blockchain_technology","335529180_Blockchain-based_platforms_Decentralized_infrastructures_and_its_boundary_conditions","334314206_Research_on_logistics_supply_chain_of_iron_and_steel_enterprises_based_on_block_chain_technology","333595112_Smartsupply_Smart_Contract_Based_Validation_for_Supply_Chain_Blockchain"]}