{"id":"347422048_Une_classification_des_phrases_a_complements_figes_en_grec_moderne_Etude_morphosyntaxique_des_phrases_figees","abstract":"Notre travail sur la classification et l'analyse syntaxique des phrases figées s'inscrit dans la perspective de l'élaboration d'un lexique-grammaire du grec moderne, en d'autres termes un dictionnaire syntaxique de cette langue, dans lequel, mot et grammaire du mot étant indissociables, l'unité de base est la phrase élémentaire. Le cadre théorique de cette étude est celui de la grammaire transformationnelle de Z.S. Harris et de M. Gross.Les phrases figées se définissent par le fait qu'un ou plusieurs de leurs actants sont lexicalement invariables par rapport au verbe, et que le sens des mots ne permet pas d'interpréter leur combinaison. Ces deux définitions des expressions figées ou verbes composés constituent la base essentielle de notre recensement de ces phrases. Cependant, à l'encontre de certaines traditions grammaticales qui voient dans les phrases figées un système syntactico-sémantique à part, c'est-à-dire un ensemble de phrases qui ne suivent pas les règles habituelles de la grammaire, nous avons constaté que certaines acceptent des transformations, comme la forme médiopassive et la pronominalisation, sans pour autant perdre leur caractère figé. Nous montrerons que cette possibilité n'est pas accidentelle.La classification des phrases a été effectuée à partir de leur structure syntaxique. Autrement dit, nous analysons les phrases figées comme les phrases libres, en sujet, verbe et éventuels compléments, en choisissant toujours la structure la plus étendue. Ainsi, cette classification est basée sur le fait que le nombre et la position des parties libres et figées sont variables.Une étude de ce genre, où prédomine le souci d'exhaustivité des données, exige une présentation particulière. Les données ont été notées au moyen de matrices binaires, des tableaux de signes \"+\" et \"-\". Chaque table correspond à une classe de structures. Sur chaque ligne de ces tableaux figure une phrase découpée en zones : le verbe, les compléments, les déterminants et les prépositions. Chaque colonne représente une structure. Le signe \"+\" à l'intersection d'une ligne et d'une colonne indique que la combinaison figée possède cette structure, le signe \"-\" qu'elle ne l'a pas. Ainsi, à partir de la classification d'un grand nombre de phrases à compléments figés, nous mettrons en évidence des phénomènes concernant non seulement les phrases figées, qui constituent une partie considérable du lexique, mais l'ensemble du lexique.","authors":["Angeliki/Aggeliki Fotopoulou"],"meta":["February 1993"],"references":[]}