{"id":"347437308_Methodes_informatiques_pour_l'etude_des_gravures_rupestres_les_exemples_du_Valcamonica_Italie_et_du_mont_Bego_France","abstract":"Le Valcamonica (100 000 gravures estimées) et le mont Bego (36 000 gravures) sont les deux principales concentrations d’art rupestre pour la Méditerranée occidentale au cours de la Préhistoire récente. Bien que des recherches y aient été menées depuis de nombreuses années : au Valcamonica par E. Anati (1960, 2008) et au mont Bego par H. de Lumley et al. (1976, 2011), les interprétations proposées restent peu convaincantes et largement débattues. Les modèles théoriques et les outils pratiques employés par ces auteurs sont par ailleurs critiqués. Ainsi, Richard Bradley qualifiait la recherche au Valcamonica et au mont Bego de : « curiously introverted kind of research, which seems quite out of contact with the main currents in modern archaeology » (Bradley, 1997 p. 8). Deux thèses doctorales ont récemment introduit l’analyse systématique et statistique de bases de données spatiales : pour les gravures du Valcamonica (Alexander, 2011) et du mont Bego (Huet, 2012). Les méthodes informatiques (SIG, tests d’hypothèses, analyses multifactorielles, etc.) permettent : (1) d’étudier conjointement les distributions iconographiques et spatiales des gravures, (2) d’identifier parmi celles-ci des sous-ensembles consistants, (3) de construire un cadre théorique explicite pour envisager les significations symboliques. Avec ces méthodes, la « découverte » archéologique n’est plus guidée par les gravures exceptionnelles (l’exception), mais par les tendances générales au sein du corpus. Ces tendances correspondent plus certainement aux phénomènes que l’archéologie entend expliquer lorsqu’elle se propose d’étudier ces sites. Nous présenterons l’historique de la recherche sur les gravures du Valcamonica et du mont Bego, et le renouvellement méthodologique que représente l’introduction des méthodes informatiques pour leur étude. A travers quelques exemples, nous montrerons comment ces méthodes peuvent fournir des indices — plus objectifs que ceux établis sur quelques gravures sélectionnées — pour comparer les systèmes symboliques de ces deux sites.","authors":["Thomas Huet","Craig Alexander"],"meta":["December 2020","Project: Ancient Iconography"],"references":["31819938_LA_CIVILISATION_DU_VAL_CAMONICA_EMMANUEL_ANATI"]}