{"id":"347409666_Exploring_the_Relation_Between_Co-changes_and_Architectural_Smells","abstract":"The interplay between Maintainability and Reliability can be particularly complex and different kinds of trade-offs may arise when developers try to optimise for either one of these two qualities. To further understand how Maintainability and Reliability influence each other, we perform an empirical study using architectural smells and source code file co-changes as proxies for these two qualities, respectively. The study is designed using an exploratory multiple-case case study following well-know guidelines and using fourteen open source Java projects. Three different research questions are identified and investigated through statistical analysis. Co-changes are detected by using both a state-of-the-art algorithm and a novel approach. The three architectural smells selected are among the most important from the literature and are detected using open source tools. The results show that 50% of co-changes eventually end up taking part in an architectural smell. Moreover, statistical tests indicate that in 50% of the projects, files and packages taking part in smells are more likely to co-change than non-smelly files. Finally, co-changes were also found to appear before smells 90% of the times a smell and a co-change appear in the same file pair. Our findings show that Reliability is indirectly affected by low levels of Maintainability even at the architectural level. This is because low-quality components require more frequent changes by the developers, increasing chances to eventually introduce faults.","authors":["Darius Sas","Paris Avgeriou","Ronald Kruizinga","Ruben Scheedler"],"meta":["February 2021SN Computer Science 2(1)","DOI:10.1007/s42979-020-00407-5"],"references":["337753257_Quality_attribute_trade-offs_in_the_embedded_systems_industry_an_exploratory_case_study","337732176_The_SDK4ED_Approach_to_Software_Quality_Optimization_and_Interplay_Calculation","335784606_Finding_Needles_in_a_Haystack_Leveraging_Co-change_Dependencies_to_Recommend_Refactorings","325176682_Architectural_Technical_Debt_Identification_the_Research_Landscape","337795970_Investigating_Instability_Architectural_Smells_Evolution_An_Exploratory_Case_Study","326565526_An_Empirical_Study_of_Architectural_Decay_in_Open-Source_Software","325531384_Interrelations_between_Software_Quality_Metrics_Performance_and_Energy_Consumption_in_Embedded_Applications","317919636_Arcan_A_Tool_for_Architectural_Smells_Detection","315002598_A_Method_for_Assessing_Class_Change_Proneness","312485573_Automatic_Detection_of_Instability_Architectural_Smells"]}