{"id":"347454843_Quantum_implementation_of_an_artificial_feed-forward_neural_network","abstract":"Artificial intelligence algorithms largely build on multi-layered neural networks. Coping with their increasing complexity and memory requirements calls for a paradigmatic change in the way these powerful algorithms are run. Quantum computing promises to solve certain tasks much more efficiently than any classical computing machine, and actual quantum processors are now becoming available through cloud access to perform experiments and testing also outside of research labs. Here we show in practice an experimental realization of an artificial feed-forward neural network implemented on a state-of-art superconducting quantum processor using up to 7 active qubits. The network is made of quantum artificial neurons, which individually display a potential advantage in storage capacity with respect to their classical counterpart, and it is able to carry out an elementary classification task which would be impossible to achieve with a single node. We demonstrate that this network can be equivalently operated either via classical control or in a completely coherent fashion, thus opening the way to hybrid as well as fully quantum solutions for artificial intelligence to be run on near-term intermediate-scale quantum hardware.","authors":["Francesco Tacchino","Panagiotis Kl. Barkoutsos","Chiara Macchiavello","Ivano Tavernelli"],"meta":["October 2020Quantum Science and Technology 5(4):044010","DOI:10.1088/2058-9565/abb8e4"],"references":["343666356_Quantum_computing_model_of_an_artificial_neuron_with_continuously_valued_input_data","341761601_Quantum_machine_learning_and_quantum_biomimetics_A_perspective","339144342_Training_deep_quantum_neural_networks","338561090_Variational_quantum_unsampling_on_a_quantum_photonic_processor","337846240_An_initialization_strategy_for_addressing_barren_plateaus_in_parametrized_quantum_circuits","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","335412116_Quantum_convolutional_neural_networks","332078371_An_artificial_neuron_implemented_on_an_actual_quantum_processor","347176197_Variational_learning_for_quantum_artificial_neural_networks","333763237_Toward_large-scale_fault-tolerant_universal_photonic_quantum_computing"]}