{"id":"347468975_Hierarchical_Pooling_Strategy_Optimization_for_Accelerating_Asymptomatic_COVID-19_Screening","abstract":"Testing has been a major factor that limits our response to the COVID-19 pandemic. The method of sample pooling and group test has recently been introduced and adopted. However, it is still not clearly known how to determine the appropriate group size. In this paper, we treat asymptomatic COVID-19 screening acceleration as an optimization problem, and solve the problem using an analytical approach and an algorithmic procedure. We develop a two-level hierarchical pooling strategy for accelerating asymptomatic COVID-19 screening. In the first level, a population is divided into groups, which results in inter-group acceleration. In the second level, a group is divided into subgroups, which results in intra-group and inter-subgroup acceleration. By using our analytical methods and numerical algorithms, we determine the optimal group size and the optimal subgroup size, which minimize the total number of tests, maximize the speedup of the hierarchical pooling strategy, and minimize both time and cost of testing. It is discovered that the optimal group size and the optimal subgroup size are determined by the fraction of infected people. Furthermore, the optimal group size, the optimal subgroup size, and the achieved speedup grow sublinearly with the reciprocal of the fraction of infected people. Our research has important social implications and financial impacts. For example, if the fraction of infected people is 0.01, by using group size of 25 and subgroup size of 5, we can achieve speedup of at least 11, which means that months of testing time can be reduced to days, and over 91% of the testing cost can be saved. Such results have not been available in the known literature. The paper makes significant progress and great advance in pooling strategy optimization for accelerating asymptomatic COVID-19 screening, and represents the contribution of computer science to the global pandemic.","authors":["Keqin Li"],"meta":["January 2020","DOI:10.1109/OJCS.2020.3036581"],"references":["341975733_FAST_a_Feasible_Accurate_and_Speedy_Test_Strategy_for_COVID-19","340494306_Efficient_and_Practical_Sample_Pooling_High-Throughput_PCR_Diagnosis_of_COVID-19","340494141_A_statistical_method_of_batch_screening_entrying_population_from_abroad_by_stages_and_groups_in_COVID-19_nucleic_acid_testing","340992308_Pooling_of_samples_for_testing_for_SARS-CoV-2_in_asymptomatic_people","324332462_Numerical_Analysis"]}