{"id":"347477510_Features_of_development_and_implementation_of_courses_of_the_educational_field_Mathematics_in_distance_education_system","abstract":"Effective application of distance technologies, even at the level of individual courses in most universities is faced with a number of organizational, methodological problems. The final design of the regulatory framework the problem of implementation of these technologies in the field of theoretical research and experimental work in the practical implementation of the plane. The authors consider a wide range of problems arising from the mass introduction of e-learning in educational practice, their classification on various grounds. When the authors of the work are based on practical experience in the development of the course Mathematical Foundations of Computer Science for students training areas Teacher Education profiles Informatics and Computer Science and Foreign Language on the basis of a learning management system Moodle. Also studied a number of aspects related to the characteristics of the studied subject area (in Mathematics example of educational area). We formulate the necessary conditions for effective use of e-learning technologies. These conditions, from the point of view of the authors, speakers, among others participated in the implementation of the university administration, the formation of a uniform by the level of the basic mathematical training a group of students, the formation of a thesaurus (semantic web) course in the classroom working with students, as well as a phased approach to solving complex text assignments, requiring the construction of a formal mathematical model in the subject area. We offer some simple criteria for evaluating the effectiveness of (increased performance and students' motivation, optimization of time working teachers, reducing the number of chronic debtors in the discipline).","authors":["Elena Leonidovna Makarova","Olga Isaakovna Pugach"],"meta":["June 2016","DOI:10.17816/snv20162307"],"references":[]}