{"id":"347443328_Surpassing_the_classical_limit_in_magic_square_game_with_distant_quantum_dots_coupled_to_optical_cavities","abstract":"The emergence of quantum technologies is heating up the debate on quantum supremacy, usually focusing on the feasibility of looking good on paper algorithms in realistic settings, due to the vulnerability of quantum systems to myriad sources of noise. In this vein, an interesting example of quantum pseudo-telepathy games that quantum mechanical resources can theoretically outperform classical resources is the Magic Square game (MSG), in which two players play against a referee. Due to noise, however, the unit winning probability of the players can drop well below the classical limit. Here, we propose a timely and unprecedented experimental setup for quantum computation with quantum dots inside optical cavities, along with ancillary photons for realizing interactions between distant dots to implement the MSG. Considering various physical imperfections of our setup, we first show that the MSG can be implemented with the current technology, outperforming the classical resources under realistic conditions. Next, we show that our work gives rise to a new version of the game. That is, if the referee has information on the physical realization and strategy of the players, he can bias the game through filtered randomness, and increase his winning probability. We believe our work contributes to not only quantum game theory, but also quantum computing with quantum dots.","authors":["Sinan Bugu","Fatih Ozaydin","Tetsuo Kodera"],"meta":["December 2020Scientific Reports 10(1)","DOI:10.1038/s41598-020-79295-x"],"references":["343289599_On-chip_deterministic_operation_of_quantum_dots_in_dual-mode_waveguides_for_a_plug-and-play_single-photon_source","342769180_Circuit_Depth_Reduction_for_Gate-Model_Quantum_Computers","339857182_Quantum_State_Optimization_and_Computational_Pathway_Evaluation_for_Gate-Model_Quantum_Computers","339507778_Preparing_Multipartite_Entangled_Spin_Qubits_via_Pauli_Spin_Blockade","339176976_Coherent_spin_control_of_s-_p-_d-_and_f-electrons_in_a_silicon_quantum_dot","338507141_Optimizing_High-Efficiency_Quantum_Memory_with_Quantum_Machine_Learning_for_Near-Term_Quantum_Devices","336992603_Work_and_heat_value_of_bound_entanglement","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","336699873_A_gated_quantum_dot_strongly_coupled_to_an_optical_microcavity","349717593_RF_reflectometry_for_readout_of_charge_transition_in_a_physically_defined_p-channel_MOS_silicon_quantum_dot"]}