{"id":"347593229_How_to_Evaluate_Solutions_in_Pareto-based_Search-Based_Software_Engineering_A_Critical_Review_and_Methodological_Guidance","abstract":"With modern requirements, there is an increasing tendency of considering multiple objectives/criteria simultaneously in many Software Engineering (SE) scenarios. Such a multi-objective optimization scenario comes with an important issue - how to evaluate the outcome of optimization algorithms, which typically is a set of incomparable solutions (i.e., being Pareto nondominated to each other). This issue can be challenging for the SE community, particularly for practitioners of Search-Based SE (SBSE). On one hand, multi-objective optimization could still be relatively new to SE/SBSE researchers, who may not be able to identify the right evaluation methods for their problems. On the other hand, simply following the evaluation methods for general multi-objective optimization problems may not be appropriate for specific SBSE problems, especially when the problem nature or decision maker's preferences are explicitly/implicitly known. This has been well echoed in the literature by various inappropriate/inadequate selection and inaccurate/misleading use of evaluation methods. In this paper, we first carry out a systematic and critical review of quality evaluation for multi-objective optimization in SBSE. We survey 717 papers published between 2009 and 2019 from 36 venues in seven repositories, and select 95 prominent studies, through which we identify five important but overlooked issues in the area. We then conduct an in-depth analysis of quality evaluation indicators/methods and general situations in SBSE, which, together with the identified issues, enables us to codify a methodological guidance for selecting and using evaluation methods in different SBSE scenarios.","authors":["Miqing Li","Tao Chen","Xin Yao"],"meta":["November 2020IEEE Transactions on Software Engineering PP(99):1-1","DOI:10.1109/TSE.2020.3036108"],"references":["333699933_A_Review_of_Ten_Years_of_the_Symposium_on_Search-Based_Software_Engineering","333127200_Improving_web_service_interfaces_modularity_using_multi-objective_optimization","331853549_Quality_Evaluation_of_Solution_Sets_in_Multiobjective_Optimisation_A_Survey","345448732_Standing_on_the_shoulders_of_giants_Seeding_search-based_multi-objective_optimization_with_prior_knowledge_for_software_service_composition","339705965_Quality_Indicators_in_Search-based_Software_Engineering_An_Empirical_Evaluation","336004457_Run-time_Evaluation_of_Architectures_A_Case_Study_of_Diversification_in_IoT","335892261_Many-Objective_Test_Suite_Generation_for_Software_Product_Lines","334212087_Stability_analysis_for_safety_of_automotive_multi-product_lines_a_search-based_approach","333673765_Enhancing_Decomposition-Based_Algorithms_by_Estimation_of_Distribution_for_Constrained_Optimal_Software_Product_Selection","331782034_An_Empirical_Study_on_Pareto_based_Multi-objective_Feature_Selection_for_Software_Defect_Prediction"]}