{"id":"347513842_ACTIVE_STUDENT_ENGAGEMENT_IN_ONLINE_STEM_CLASSES_APPROACHES_AND_RECOMMENDATIONS","abstract":"This paper examines methods of actively engaging students in online university-level STEM courses. It describes a variety of synchronous and asynchronous engagement strategies, cites research supporting their effectiveness, and offers suggestions for maximizing the effectiveness of active engagement regardless of which strategies are adopted to achieve it. Recommended engagement practices include: (1) Take steps to establish and maintain teaching presence (set up mechanisms for regular interactions between you and your students) and social presence (regularly assign tasks that involve synchronous and asynchronous interactions among the students); (2) Make your policies, assignments, and expectations regarding active student engagement and the reasoning behind them explicit and clear to the students; (3) Carry out extensive formative assessment (e.g., synchronous in-class activities, low-stakes online quizzes, discussion boards, minute papers, and midcourse evaluations) and use the results to make continual adjustments in the design and implementation of engagement activities; (4) Anticipate some student resistance to active engagement and take steps to minimize or eliminate it; (5) Take a gradual approach to adopting new engagement strategies rather than attempting to implement every new strategy you hear about in the next course you teach.","authors":["Michael Prince","Richard M. Felder","Rebecca Brent"],"meta":["December 2020Advances in Engineering Education 8(4)"],"references":["351828688_Advances_in_Engineering_Education_Opinion_Course_Design_in_the_Time_of_Coronavirus_Put_on_your_Designer's_CAP","341734618_Evaluation_of_the_Cost-Effectiveness_of_Virtual_and_Traditional_Education_Models_in_Higher_Education_A_Systematic_Review","340535196_The_Difference_Between_Emergency_Remote_Teaching_and_Online_Learning","328312212_A_Systematic_Review_of_Social_Presence_Definition_Antecedents_and_Implications","346945365_Essentials_of_Online_Course_Design_A_Standards-Based_Guide","345032551_Teaching_Online_A_Practical_Guide","339143032_How_Theory_Research_and_Instruction_Come_Together_in_Active_Learning","336266088_Hybrid-Flexible_Course_Design_Implementing_student-directed_hybrid_classes","328861421_Reducing_Student_Resistance_to_Active_Learning_Strategies_for_Instructors","326048374_Translating_the_ICAP_Theory_of_Cognitive_Engagement_Into_Practice"]}