{"id":"347538168_Issue_1_wwwjetirorg_ISSN-2349-5162","abstract":"Automated breast density measurement is one of the interests growing area of research as it is having strong association with the risk of breast cancer. As per clinical BI-RADS assessment \"heterogeneous\" dense breast requires supplementary screening with ultrasound or sometimes MRI. Dense breast involves higher risk of masking cancer and also reduces sensitivity of mammograms. This will increase the false positive rate and cost of treatments. Although there are many methods available for automatic mammographic and volumetric breast density measurement but still there are issues of accuracy and reproducibility. Hence there is demand for developing new accurate and automatic breast density measurement technique which is strongly associated with risk of breast cancer and can be easily suitable in clinical screening. The proposed new algorithm is an attempt to increase the accuracy and reproducibility of automatic breast density measurement using digital mammograms which will produce new knowledge in discipline of radiology and computer science. 1.0 Objectives of the proposed work To satisfy the undertaken research goal, following are the specific research objectives which will be satisfy during the period of research. Study and Analysis of Existing pre-processing, segmentation and classification Algorithms for Mammographic breast Density Measurement. To propose algorithm for pre-processing and segmentation of mammograms for breast density measurement. To propose an Algorithm for classification of breast density towards Breast Cancer Risk Prediction. Comparison of proposed method with other existing techniques. 2.0 Proposed methodology for achievement of the objectives In order to satisfy above objectives, our proposed methodology consist five major blocks which are described with figure-1.","authors":["Kamal Kumar Sharma","Shivaji Pawar Singh","Dr-Manwinder Singh Goraya"],"meta":["January 2019"],"references":["328784445_BRAIN_TUMOR_DETECTION_USING_OBJECT_LABELING_ALGORITHM_SVM","264622958_BRAIN_LESION_SEGMENTATION_FROM_DIFFUSION_WEIGHTED_MRI_BASED_ON_ADAPTIVE_THRESHOLDING_AND_GRAY_LEVEL_CO-OCCURRENCE_MATRIX","228083822_Seeded_Region_Growing"]}