{"id":"347571703_Modeling_Temporal_Patterns_of_Cyberbullying_Detection_with_Hierarchical_Attention_Networks","abstract":"Cyberbullying is rapidly becoming one of the most serious online risks for adolescents. This has motivated work on machine learning methods to automate the process of cyberbullying detection, which have so far mostly viewed cyberbullying as one-off incidents that occur at a single point in time. Comparatively less is known about how cyberbullying behavior occurs and evolves over time. This oversight highlights a crucial open challenge for cyberbullying-related research, given that cyberbullying is typically defined as intentional acts of aggression via electronic communication that occur \\textit{repeatedly} and \\textit{persistently}. In this article, we center our discussion on the challenge of modeling temporal patterns of cyberbullying behavior. Specifically, we investigate how temporal information within a social media session, which has an inherently hierarchical structure (e.g., words form a comment and comments form a session), can be leveraged to facilitate cyberbullying detection. Recent findings from interdisciplinary research suggest that the temporal characteristics of bullying sessions differ from those of non-bullying sessions and that the temporal information from users' comments can improve cyberbullying detection. The proposed framework consists of three distinctive features: (1) a hierarchical structure that reflects how a social media session is formed in a bottom-up manner; (2) attention mechanisms applied at the word- and comment-level to differentiate the contributions of words and comments to the representation of a social media session; and (3) the incorporation of temporal features in modeling cyberbullying behavior at the comment-level. Quantitative and qualitative evaluations are conducted on a real-world dataset collected from Instagram, the social networking site with the highest percentage of users reporting cyberbullying experiences. Results from empirical evaluations show the significance of the proposed methods, which are tailored to capture temporal patterns of cyberbullying detection.","authors":["Lu Cheng","Ruocheng Guo","Yasin N Silva","Deborah Hall"],"meta":["January 2020ACM/IMS Transactions on Data Science 2(2)","DOI:10.1145/3441141","Project: Cyberbullying"],"references":["345339034_A_Survey_of_Learning_Causality_with_Data_Problems_and_Methods","344754725_Session-based_Cyberbullying_Detection_Problems_and_Challenges","334843946_PI-Bully_Personalized_Cyberbullying_Detection_with_Peer_Influence","333060469_Robust_Cyberbullying_Detection_with_Causal_Interpretation","320573810_Using_deep_learning_for_short_text_understanding","341126501_Temporal_Properties_of_Cyberbullying_on_Instagram","335398578_Semantic_Sentence_Matching_with_Densely-Connected_Recurrent_and_Co-Attentive_Information","334155264_Minority_Report_Cyberbullying_Prediction_on_Instagram","320318420_Approaches_to_Automated_Detection_of_Cyberbullying_A_Survey","318764077_Deep_Learning_for_Extreme_Multi-label_Text_Classification"]}