{"id":"347511774_Simbionte_-Etica_da_computacao_Symbiont_-Ethics_of_computing_Simbionte_-Etica_de_la_computacion","abstract":"Resumo Neste trabalho se encontra uma conexão entre a educação matemática e a arquitetura do conhecimento da computação, na noção de sistema formal. O que contamos aqui é a história do fracasso do bloqueio da simbiose de sistemas de pensamento heterogêneos. Essa é a história da computação, como momento talvez culminante de um projeto de unificação dos sistemas de pensamento. Partimos da transição observável entre a produção de autoevidência, convenção da matemática escolar clássica, e a realização da máquina de calcular. Num segundo momento caminhamos na direção da construção do conhecimento teoremático, que se prolonga na noção de máquina configurável. Essa é a experiência comum dos sistemas computacionais. O trabalho então se debruça sobre a terceira etapa, que corresponde à conexão possível entre o ideal de formalização matemática e o conceito de linguagem computacional, que está na origem do conhecimento da ciência da computação, e que desemboca no último estágio do percurso: o campo problemático dos sistemas autorreferentes, em que a tentativa de consubstanciar a recusa à simbiose dos sistemas de pensamento heterogêneos entra em uma deriva que a fará fracassar. O desenvolvimento conceitual assim engendrado acaba funcionando como conexão com o exterior do pensamento. Um exterior que impõe a consideração de que, à semelhança da psicanálise, o que resta do fracasso da computação como disciplina é uma ética. Palavras-chave: Experiência computacional; Filosofia da computação; Ciência situada.","authors":["André Souza Lemos","Welisson Marques"],"meta":["December 2020Research Society and Development 9(11):e100191111273","DOI:10.33448/rsd-v9i11.11273","Project: A Ciência da Computação no Contexto da Educação Tecnológica"],"references":["320181892_Cinema_tome_2_L'Image-temps","269880662_A_New_Kind_of_Science","242646656_On_Non-Computable_Functions","224892364_Reassembling_the_Social","220695197_On_the_Origin_of_Objects","26462816_Post-scriptum_sobre_las_sociedades_de_control"]}