{"id":"347592280_A_New_Trend_of_Quantum_Image_Representations","abstract":"Quantum image processing will be an important issue in the age of quantum computers. Quantum image processing generally includes quantum image representations, quantum image processing algorithms, and quantum image measurement. Among them, quantum image representation is a very important part of quantum image processing. Therefore, it is of great significance for quantum image processing to study the representation of quantum images. First, we elaborate on the main quantum image representations and analyze, compare and summarize them. This paper focuses on the definition of these quantum image representations the preparation of quantum images and the number of quantum bits required as well as the computational complexity. Then, this paper analyzes, compares and summarizes the similarities and differences between these quantum image representations. Finally, the challenges and future development in the field of quantum image processing are summarized and forecasted. This work will help researchers to understand the advances related to quantum image representations in the field of quantum image processing and is therefore of some reference value.","authors":["Jie Su","Xuchao Guo","Chengqi Liu","Lin Li"],"meta":["January 2020IEEE Access 8:214520-214537","DOI:10.1109/ACCESS.2020.3039996"],"references":["340282397_Quantum_image_processing_the_pros_and_cons_of_the_techniques_for_the_internal_representation_of_the_image_A_reply_to_A_comment_on_Quantum_image_processing","340132222_Detection_of_steganography_in_quantum_grayscale_images","340083455_New_look_on_quantum_representation_of_images_Fourier_transform_representation","338344332_Quantum_implementation_of_classical_Marr-Hildreth_edge_detection","338000573_Double_quantum_color_images_encryption_scheme_based_on_DQRCI","349208383_Image_processing_why_quantum","348119455_Examining_Quantum_Algorithms_for_Quantum_Image_Processing","341996081_Efficient_quantum_arithmetic_operation_circuits_for_quantum_image_processing","341192324_Quantum_image_sharpness_estimation_based_on_the_Laplacian_operator","340468426_Quantum_image_processing_algorithm_using_edge_extraction_based_on_Kirsch_operator"]}