{"id":"347598929_The_birth_of_a_science","abstract":"Physics, biology, chemistry, for example, do not already only study programs in many universities but are at the forefront of the development of science, and that is science itself. The development of the basic foundation becomes the mother of science, such as mathematics, as a suspicion of the birth of new sciences. The interests related to the life and welfare of humans always invites the possibility of the birth of science in concepts, but mathematics confirms it. In certain cases, as an application, or it gives birth to answers in technology form, which is distorted according to the social demands of society. Every science has its methodology, which is based on the logic that helps to reason. A natural model is an approach to generating methods, as well as the principles that develop in artificial intelligence based on mathematics. This principle not only changes the way of perceiving data, but it also establishes new definitions of data, and changes statistics, optimization, and other fields. Each science also has implications for other sciences but also has applications that are also related to other sciences. Every science supports technology to improve social welfare. Historically, century by century, many new scientific fields were born, and it has evidence from the publication of scientific works to books as scientific standards. Then, the teaching curricula supported its initial dissemination and its development through research with evidence of scientific publications either through papers in proceedings of scientific meetings or articles in the journals. A study program about science in the related faculty is mandatory, and it is as the spearhead in further scientific and technological development. So everything starts and ends at one point, namely the birth of new science, as the birth of data science. This paper describes the birth of science by involving historical traces. The reflection of scientific development is starting from the foundation to become a scientific field, namely data science. It also illustrates the roadmap of a scientific indirectly.","authors":["Mahyuddin K. M. Nasution"],"meta":["December 2020History of Science and Technology 10(2):315-338","DOI:10.32703/2415-7422-2020-10-2-315-338"],"references":["346151320_An_Empirical_Revision_of_the_Definition_of_Science_Fiction_It_Is_All_in_the_Techne","344202128_Basic_Beliefs_and_Argument-Based_Beliefs_in_Awareness_Epistemic_Logic_with_Structured_Arguments","356218062_Diversity_of_understorey_at_Singkil_Swamp_Wildlife_Reserve","347268932_Efficient_Temporal_Logic_Verification_by_Incremental_Abstraction","347243097_Mathematical_Philosophy","346997754_Finding_US_health_data_and_statistics_A_guide_for_social_science_researchers","346330504_On_the_Methodology_of_Social_Science","345123807_The_Conduct_of_Inquiry_Methodology_for_Behavioral_Science","343519851_Data_Science_Education_Curriculum_and_pedagogy","343510463_Imagination"]}