{"id":"347533144_Including_Learning_Analytics_in_the_Loop_of_Self-Paced_Online_Course_Learning_Design","abstract":"Online education is growing because of its benefits and advantages that students enjoy. Educational technologies (e.g., learning analytics, student modelling, and intelligent tutoring systems) bring great potential to online education. Many online courses, particularly in self-paced online learning (SPOL), face some inherent barriers such as learning awareness and academic intervention. These barriers can affect the academic performance of online learners. Recently, learning analytics has been shown to have great potential in removing these barriers. However, it is challenging to achieve the full potential of learning analytics with the traditional online course learning design model. Thus, focusing on SPOL, this study proposes that learning analytics should be included in the course learning design loop to ensure data collection and pedagogical connection. We propose a novel learning design-analytics model in which course learning design and learning analytics can support each other to increase learning success. Based on the proposed model, a set of online course design strategies are recommended for online educators who wish to use learning analytics to mitigate the learning barriers in SPOL. These strategies and technologies are inspired by Jim Greer’s work on student modelling. By following these recommended design strategies, a computer science course is used as an example to show our initial practices of including learning analytics in the course learning design loop. Finally, future work on how to develop and evaluate learning analytics enabled learning systems is outlined.","authors":["Hongxin Yan","Fuhua Lin","Kinshuk"],"meta":["December 2020International Journal of Artificial Intelligence in Education 31(5)","DOI:10.1007/s40593-020-00225-z"],"references":["327753925_Exploring_the_benefits_and_challenges_of_learning_analytics_in_higher_education_institutions_A_systematic_literature_review","327406391_Learning_Analytics_for_Learning_Design_A_Systematic_Literature_Review_of_Analytics-Driven_Design_to_Enhance_Learning","324930121_The_development_of_student_feedback_literacy_enabling_uptake_of_feedback","344154633_Using_Design_Patterns_to_Support_E-Learning_Design","337007068_The_journey_of_learning","336171352_Learning_analytics_and_AI_Politics_pedagogy_and_practices","333320858_A_review_of_learning_analytics_intervention_in_higher_education_2011-2018","330253603_Learner_modelling_systematic_review_of_the_literature_from_the_last_5_years","327000064_A_Review_of_Multimodal_Learning_Analytics_Architectures","325864288_OARS_exploring_instructor_analytics_for_online_learning"]}