{"id":"347525987_Using_Screencasts_in_Computer_Science_Classes_at_a_Technical_University","abstract":"The information technologies applications in various fields of human activity are developing exponentially now. The article considers possibility of using screencasting in a computer science course at a technical university. Screencast is a video that contains a record of actions performed on a computer with the author’s comments. The advantages and disadvantages of this technology in the learning process are considered. It is noted that the technology of on-screen video is distinguished by information richness and strong emotional effect on the student. The application of screencasting in computer science classes at the Tomsk Polytechnic University using the mathematical package MathCad, which has the means to solve all kinds of problems associated with symbolic operations, is presented. The motivation for this study is to increase the student learning process effectiveness. Therefore, the objectives of the study are: to study the possibility of screencasting in the student learning process organization, to study the possibility of using this technology during studying a computer science course, to find out how effectively this method allows to master knowledge in the relevant discipline. The results of study using this technology and the traditional method are analyzed. It is shown that the use of screencasting allows to improve the test results in comparison with the group trained by the traditional method.","authors":["Irina G. Ustinova","Olga V. Rozhkova","Natalia S. Nikolaeva"],"meta":["January 2020ITM Web of Conferences 35(1):03018","DOI:10.1051/itmconf/20203503018"],"references":["272440212_Teaching_Mathematics_with_Mathematical_Software","263572125_Do_screencasts_help_to_revise_prerequisite_mathematics_An_investigation_of_student_performance_and_perception","260072729_How_Instructor-Developed_Screencasts_Benefit_College_Students'_Learning_of_Maths_Insights_from_an_Irish_Case_Study","326715164_IMPROVEMENT_IN_THE_ACADEMIC_DEVELOPMENT_OF_STUDENTS_OF_TOXICOLOGY_THROUGH_THE_USE_OF_AN_APPLICATION_OF_SCREENCASTING","323897240_INVESTIGATING_APPLICATION_OF_VISUAL_THINKING_STRATEGIES_IN_DEVELOPING_AUDIO_AND_VISUAL_ONLINE_MATERIALS_BY_NON-NATIVE_EFL_TEACHERS_INTEGRATING_ART_ASSISTED_LANGUAGE_LEARNING_AALL_AND_ARTS_MARKETING","321760295_INNOVATIVE_TECHNOLOGIES_IN_APPLIED_MATHEMATICAL_SCIENCES_AS_A_FACTOR_OF_QUALITY_IMPROVEMENT_OF_ENGINEERS'_TRAINING","318703670_SCREENCASTING_EXPERIENCES_TO_ENGAGE_BLENDED_LEARNING","315352852_ASSESSMENT_AS_LEARNING_USING_PEER_REVIEWED_SCREENCASTING","261424920_Creation_and_use_of_screencasts_in_higher_education","224361050_Work_in_progress_-_using_screencasts_to_enhance_student_learning_in_a_large_lecture_Material_Science_and_Engineering_course"]}