{"id":"347681499_Toward_to_Better_Structure_and_Constraint_to_Mine_Negative_Sequential_Patterns","abstract":"Nonoccurring behavior (NOB) studies have attracted the growing attention of scholars as a crucial part of behavioral science. As an effective method to discover both NOB and occurring behaviors (OB), negative sequential pattern (NSP) mining is successfully used in analyzing medical treatment and abnormal behavior patterns. At this time, NSP mining is still an active and challenging research domain. Most of the algorithms are inefficient in practice. Briefly, the key weaknesses of NSP mining are: 1) an inefficient positive sequential pattern (PSP) mining process, 2) a strict constraint of negative containment, and 3) the lack of an effective Negative Sequential Candidate (NSC) generation method. To address these weaknesses, we propose a highly efficient algorithm with improved techniques, named sc-NSP, to mine NSP efficiently. We first propose an improved PrefixSpan algorithm in the PSP mining process, which connects to a bitmap storage structure instead of the original structure. Second, sc-NSP loosens the frequency constraint and exploits the NSC generation method of positive and negative sequential patterns mining (PNSP) (a classic NSP mining method). Furthermore, a novel pruning strategy is designed to reduce the computational complexity of sc-NSP. Finally, sc-NSP obtains the support of NSC by using the most efficient bitwise-based calculation operation. Theoretical analyses show that sc-NSP performs particularly well on data sets with a large number of elements and items in sequence. Comparison and extensive experiments along with case studies on health data show that sc-NSP is 10 times more efficient than other state-of-the-art methods, and the number of NSPs obtained is 5 times greater than other methods.","authors":["Xinming Gao","Yongshun Gong","Tiantian Xu","Jinhu Lu"],"meta":["December 2020IEEE Transactions on Neural Networks and Learning Systems PP(99):1-15","DOI:10.1109/TNNLS.2020.3041732"],"references":["328110471_e-RNSP_An_Efficient_Method_for_Mining_Repetition_Negative_Sequential_Patterns","349539293_Interactive_Sequential_Basket_Recommendation_by_Learning_Basket_Couplings_and_PositiveNegative_Feedback","342025686_Spatio-Temporal_Point_Process_for_Multiple_Object_Tracking","338311572_Health_and_medical_behavior_informatics","334714511_Modeling_and_Applications_for_Temporal_Point_Processes","330597631_Learning_Time_Series_Associated_Event_Sequences_With_Recurrent_Point_Process_Networks","330296199_Mining_Top-k_Useful_Negative_Sequential_Patterns_via_Learning","329481013_Fast_Generation_of_Clinical_Pathways_including_Time_Intervals_in_Sequential_Pattern_Mining_on_Electronic_Medical_Record_Systems","327600365_Campus_Data_Analysis_Based_on_Positive_and_Negative_Sequential_Patterns","326022003_F-NSP_A_Fast_Negative_Sequential_Patterns_Mining_Method_with_Self-adaptive_Data_Storage","326006430_Integrating_Metacognitive_Judgments_and_Eye_Movements_Using_Sequential_Pattern_Mining_to_Understand_Processes_Underlying_Multimedia_Learning","324709953_Efficient_High_Utility_Negative_Sequential_Patterns_Mining_in_Smart_Campus","323378307_Personalized_prediction_of_drug_efficacy_for_diabetes_treatment_via_patient-level_sequential_modeling_with_neural_networks","321990323_NegI-NSP_Negative_sequential_pattern_mining_based_on_loose_constraints","319393506_Mining_Sequential_Patterns_Generalizations_and_Performance_Improvements"]}