{"id":"347648096_Is_GPA_Enough_A_Platform_for_Promoting_Computer_Science_Undergraduates'_Pursuit_of_Career_Related_Extracurricular_Activities","abstract":"Despite the perceived value of extracurricular experience, higher education relies heavily on grade point average (GPA) as a measure of undergraduates’ academic success. When used as a singular standard assessment, GPA, which is based on student progress and completion of coursework, may inadvertently steer undergraduates away from valuable out-of-class experiences that might enhance their employability after graduation. With this premise in mind, the current study proposes to supplement GPA scores in an undergraduate Computer Science program with a wholistic assessment known as an Innovation, Competency, and Experience (ICE) score. The ICE score is a point system for documenting and rewarding students’ extracurricular activities, in addition to their GPA scores. We designed and developed a web-based technology platform called RadGrad to implement ICE scores and promote student engagement and participation in extracurricular activities. Preliminary data shows that over 36% of students started to use RadGrad, even though its use was completely voluntary. More than half of those students planned and participated in various extracurricular activities, ultimately earning ICE points. Importantly, the ICE score deployed through RadGrad demonstrates the potential value of a supplemental assessment to GPA, which can promote extracurricular experiences relevant to students’ future careers beyond coursework.","authors":["Seungoh Paek","Peter W K Leong","Philip Johnson","Carleton Moore"],"meta":["December 2020International Journal of Technology in Education and Science 5(1):1-16","DOI:10.46328/ijtes.146"],"references":["275059704_Is_it_all_a_game_Understanding_the_principles_of_gamification","271722877_Using_Undergraduate_Grade_Point_Average_as_a_Selection_Tool_A_Synthesis_of_the_Literature","266749993_An_Innovative_Near-Peer_Mentoring_Model_for_Undergraduate_and_Secondary_Students_STEM_Focus","345474748_Supporting_Personalized_Learning_through_Individualized_Learning_Plans","283262551_An_Introduction_to_Gamification_Adding_Game_Elements_for_Engagement","281102066_The_Effect_of_College_Activities_and_Grades_on_Job_Placement_Potential","278003614_Student_Assessment_Center_Performance_in_the_Prediction_of_Early_Career_Success","263327283_Graduate_Employability_A_Review_of_Conceptual_and_Empirical_Themes","258144291_The_Nature_and_Use_of_Individualized_Learning_Plans_as_a_Promising_Career_Intervention_Strategy","242693463_IS_A_HIGH_GPA_STILL_THE_MOST_IMPORTANT_FACTOR_FOR_JOB_OPPORTUNITY_-_AN_EMPIRICAL_INVESTIGATION"]}