{"id":"347609010_Nombre_de_cas_confirmes_de_syphilis_chez_les_femmes_enceintes_au_Bresil_entre_2009_et_2013","abstract":"La syphilis est une maladie bactérienne transmise sexuellement des femmes enceintes atteintes de syphilis au fœtus. Le diagnostic de syphilis chez les femmes enceintes est confirmé par l’examen VDRL. L’objectif de ces travaux est de montrer le nombre de cas confirmés de syphilis chez les femmes enceintes au Brésil, comme une année de diagnostic, groupe d’âge, régions du Brésil, zone résidentielle, type de test, classification et évolution entre 2009 et 2013. Des données secondaires ont été utilisées par le département informatique de SUS – DATASUS (http://datasus.saude.gov.br). Le plus grand nombre de tests permet un meilleur traitement et une réduction du nombre de cas. Cependant, l’absence de soins préventifs pendant la relation sexuelle induit une augmentation des cas, en particulier chez les femmes en âge de procréer. Les régions où la population est plus importante ont un plus grand nombre de cas. La forte variation des partenaires dans ces domaines entraîne une contamination accrue. Le type de test influence les nombres. Des tests moins spécifiques et plus généraux trouvent des anticorps spécifiques et non spécifiques pour la bactérie. Cela peut modifier les nombres réels. Les soins de santé féminins font à la fois le diagnostic tôt, facilitant le traitement. La syphilis n’est pas directement responsable du nombre plus élevé de décès chez les femmes enceintes.","authors":["Yara Lorrane Souza de Barros","Amanda Alves Fecury","Euzébio de Oliveira","Carla Viana Dendasck"],"meta":["December 2020","DOI:10.32749/nucleodoconhecimento.com.br/sante/femmes-enceintes"],"references":["341198409_Number_of_congenital_syphilis_cases_in_Brazil_between_2009_and_2013","326909413_ASSISTENCIA_PRE-NATAL_A_GESTANTE_COM_DIAGNOSTICO_DE_SIFILIS","317129292_Disseminacao_e_uso_dos_resultados_de_pesquisas_financiadas_pela_Secretaria_de_Ciencia_Tecnologia_e_Insumos_Estrategicos_do_Ministerio_da_Saude_Brasil_2004_a_2007","270017924_Sifilis_congenita_no_Rio_Grande_do_Norte_estudo_descritivo_do_periodo_2007-2010","245832784_Abordagem_nas_doencas_sexualmente_transmissiveis","245832364_Sifilis_diagnostico_tratamento_e_controle","314384794_Analise_dos_CAsos_de_sifilis_CongenitA_em_sobrAl_CeAra_Contribuicoes_pArA_AssistenCiA_pre-nAtAl","309885103_Sifilis_Aspectos_Clinicos_Transmissao_Manifestacoes_Orais_Diagnostico_e_Tratamento"]}