{"id":"347635021_Cyberattacks_Detection_in_IoT-Based_Smart_City_Applications_Using_Machine_Learning_Techniques","abstract":"In recent years, the widespread deployment of the Internet of Things (IoT) applications has contributed to the development of smart cities. A smart city utilizes IoT-enabled technologies, communications and applications to maximize operational efficiency and enhance both the service providers’ quality of services and people’s wellbeing and quality of life. With the growth of smart city networks, however, comes the increased risk of cybersecurity threats and attacks. IoT devices within a smart city network are connected to sensors linked to large cloud servers and are exposed to malicious attacks and threats. Thus, it is important to devise approaches to prevent such attacks and protect IoT devices from failure. In this paper, we explore an attack and anomaly detection technique based on machine learning algorithms (LR, SVM, DT, RF, ANN and KNN) to defend against and mitigate IoT cybersecurity threats in a smart city. Contrary to existing works that have focused on single classifiers, we also explore ensemble methods such as bagging, boosting and stacking to enhance the performance of the detection system. Additionally, we consider an integration of feature selection, cross-validation and multi-class classification for the discussed domain, which has not been well considered in the existing literature. Experimental results with the recent attack dataset demonstrate that the proposed technique can effectively identify cyberattacks and the stacking ensemble model outperforms comparable models in terms of accuracy, precision, recall and F1-Score, implying the promise of stacking in this domain.","authors":["Md Mamunur Rashid","Joarder Kamruzzaman","Mohammad Mehedi Hassan","Tasadduq Imam"],"meta":["December 2020International Journal of Environmental Research and Public Health 17(24):9347","DOI:10.3390/ijerph17249347"],"references":["344930422_The_Sustainability_of_Artificial_Intelligence_An_Urbanistic_Viewpoint_from_the_Lens_of_Smart_and_Sustainable_Cities","344297054_Toward_a_Sustainable_Cybersecurity_Ecosystem","343311249_Urban_Artificial_Intelligence_From_Automation_to_Autonomy_in_the_Smart_City","343123843_Security_Privacy_and_Risks_Within_Smart_Cities_Literature_Review_and_Development_of_a_Smart_City_Interaction_Framework","340378089_Building_an_Efficient_Intrusion_Detection_System_Based_on_Feature_Selection_and_Ensemble_Classifier","337848941_Robust_Malware_Defense_in_Industrial_IoT_Applications_using_Machine_Learning_with_Selective_Adversarial_Samples","337073016_HealthFog_An_ensemble_deep_learning_based_Smart_Healthcare_System_for_Automatic_Diagnosis_of_Heart_Diseases_in_integrated_IoT_and_fog_computing_environments","345335307_Machine_Learning_With_Python","343205016_Trustworthy_and_Sustainable_Smart_City_Services_at_the_Edge","341808383_Enabling_Technologies_and_Sustainable_Smart_Cities"]}