{"id":"347697049_A_Study_on_the_Active_Methodologies_Applied_to_Teaching_and_Learning_Process_in_the_Computing_Area","abstract":"Active Methodologies allow an active process in teaching and learning contents, promote responsible student involvement and bring satisfaction and enrichment to educational practices and active learning. Generally, students have learning difficulties in Computer Science courses, as they need to develop computational skills and thinking. The goals of this article is to characterize and analyze the types of Active Methodologies that are being applied in teaching and learning activities in Computer Science. Thus, this investigation was carried out through a Systematic Mapping Study, focusing on the use of the types of methodologies in view of the results achieved. It presents students’ perceptions, benefits, and difficulties in adopting these methodologies in the classroom. The results show 6 types of different Active Methodologies used in 35 publications selected, different types of techniques or studies that were used, the publications trend per year, the courses that were worked in analyzed publications, and some benefits and difficulty related to the adoption of Active Methodologies. Regarding to students’ perception, we identified different type feelings. Thus, the contributions of this study consist in a research focused on the use of Active Methodologies in a very broad sense, including the perceptions of teachers and students regarding the use of different teaching and learning methodologies. In addition, it shows the specific benefits and possible difficulties experienced in the use of Active Methodologies as teaching strategies. Consequently, some findings from this study may have the potential to support or direct choices of these methodologies in different Computer Science courses.","authors":["Maria Ivanilse Calderon Ribeiro","Odette Mestrinho Passos"],"meta":["January 2020IEEE Access 8:219083-219097","DOI:10.1109/ACCESS.2020.3036976"],"references":["336376061_Do_MOOCs_contribute_to_student_equity_and_social_inclusion_A_systematic_review_2014-18","320234774_GAMIFICATION_IN_EDUCATION","335732189_Designing_Developing_and_Evaluating_Gamification_An_Overview_and_Conceptual_Approach","335645265_Learning_and_instruction_in_the_hybrid_virtual_classroom_An_investigation_of_students'_engagement_and_the_effect_of_quizzes","335622021_The_effects_of_two_digital_educational_games_on_cognitive_and_non-cognitive_math_and_reading_outcomes","335278815_On_the_role_of_interaction_mode_and_story_structure_in_virtual_reality_serious_games","335176154_All_the_same_or_different_Revisiting_measures_of_teachers'_technology_acceptance","335150663_Accessibility_and_emotionality_of_online_assessment_feedback_Using_emoticons_to_enhance_student_perceptions_of_marker_competence_and_warmth","332605383_Active_learning_methodologies_A_brief_review","328744246_Gamification_a_methodology_to_motivate_engagement_and_participation_in_a_higher_education_environment"]}