{"id":"347631917_Simulating_the_Shastry-Sutherland_Ising_Model_Using_Quantum_Annealing","abstract":"A core concept in condensed matter physics is geometric frustration that leads to emergent spin phases in magnetic materials. These distinct phases, which depart from the conventional ferromagnet or the antiferromagnet, require unique computational techniques to decipher. In this study, we use the canonical Ising Shastry-Sutherland lattice to demonstrate new techniques for solving frustrated Hamiltonians using a quantum annealer of programmable superconducting qubits. This Hamiltonian can be tuned to produce a variety of intriguing ground states ranging from short- and long-range orders and fractional order parameters. We show that a large-scale finite-field quantum annealing experiment is possible on 468 logical spins of this model embedded into the quantum hardware. We determine microscopic spin configurations using an iterative quantum annealing protocol and develop mean-field boundary conditions to attenuate finite-size effects and defects. We not only recover all phases of the Shastry-Sutherland Ising model—including the well-known fractional magnetization plateau in a longitudinal field—but also predict the spin behavior at the critical points with significant ground-state degeneracy and in the presence of defects. The results lead us to establish the connection to the diffuse neutron scattering experiments by calculation of the static structure factors.","authors":["Paul Kairys","Andrew D. King","Isil Ozfidan","Kelly Boothby"],"meta":["December 2020","DOI:10.1103/PRXQuantum.1.020320"],"references":["339889588_Realization_of_the_kagome_spin_ice_state_in_a_frustrated_intermetallic_compound","328470717_Degeneracy_of_the_1_8_Plateau_and_Antiferromagnetic_Phases_in_the_Shastry-Sutherland_Magnet_TmB_4","323597968_Observation_of_topological_phenomena_in_a_programmable_lattice_of_1800_qubits","280221097_Fast_clique_minor_generation_in_Chimera_qubit_connectivity_graphs","273705025_Searching_for_quantum_speedup_in_quasistatic_quantum_annealers","272844813_Strong_Interplay_between_Stripe_Spin_Fluctuations_Nematicity_and_Superconductivity_in_FeSe","259844763_Architectural_Considerations_in_the_Design_of_a_Superconducting_Quantum_Annealing_Processor","338652674_Quantum_spin_liquids","326399373_Phase_transitions_in_a_programmable_quantum_spin_glass_simulator","311900780_Field_Induced_Magnetic_States_in_Holmium_Tetraboride"]}