{"id":"347753956_Decentralized_Identity_Systems_Architecture_Challenges_Solutions_and_Future_Directions","abstract":"Due to the exponential rise of the Internet in the last two decades, the digital presence has seen an enormous increase. Today, billions of people, devices and objects are digitally connected making the interactions much easier than before. To securely establish this connectivity in the digital era, proving digital identities has become crucial. Due to this, a growing number of organizations are building solutions that establish, verify and manage digital identities. Yet, a solution whereby digital identities and their associated data are efficiently managed is still far from being achieved. To fully understand the reason behind this lack, this paper provides a detailed state of the art related to identity management systems. It overviews traditional systems, analyses their strengths and limitations. This work highly focuses on the novel decentralized identity systems based on blockchain; a complete study describing their architecture, components, lifecycle and workflow is detailed. Additionally, solutions enabling decentralized identity are discussed, analysed and compared according to the ten principles of self-sovereign identity. Lastly, the challenges hindering the shift toward the fully decentralized identity paradigm are discussed.","authors":["Omar Dib","Khalifa Toumi"],"meta":["December 2020Annals of Emerging Technologies in Computing 4(5):19-40","DOI:10.33166/AETiC.2020.05.002"],"references":["347266514_Distributed-Ledger-based_Authentication_with_Decentralized_Identifiers_and_Verifiable_Credentials","347266283_A_Survey_on_Blockchain-based_Identity_Management_and_Decentralized_Privacy_for_Personal_Data","344340136_Analysis_of_uPort_Open_an_Identity_Management_Blockchain-Based_Solution","343204804_Function-Level_Bottleneck_Analysis_of_Private_Proof-of-Authority_Ethereum_Blockchain","343201004_An_Information-Centric_Networking_Based_Registry_for_Decentralized_Identifiers_and_Verifiable_Credentials","342638863_Analysis_of_uPort_Open_an_identity_management_blockchain-based_solution","346699899_Research_on_the_evolution_of_global_internet_network_interconnection_relationship_in_21_years","343514291_An_Overview_of_Limitations_and_Approaches_in_Identity_Management","343038531_Decentralized_Cloud_Storage_Using_Blockchain","342640465_Authentication_and_Authorization"]}