{"id":"347787080_Unsupervised_Haze_Removal_for_High-Resolution_Optical_Remote-Sensing_Images_Based_on_Improved_Generative_Adversarial_Networks","abstract":"One major limitation of remote-sensing images is bad weather conditions, such as haze. Haze significantly reduces the accuracy of satellite image interpretation. To solve this problem, this paper proposes a novel unsupervised method to remove haze from high-resolution optical remote-sensing images. The proposed method, based on cycle generative adversarial networks, is called the edge-sharpening cycle-consistent adversarial network (ES-CCGAN). Most importantly, unlike existing methods, this approach does not require prior information; the training data are unsupervised, which mitigates the pressure of preparing the training data set. To enhance the ability to extract ground-object information, the generative network replaces a residual neural network (ResNet) with a dense convolutional network (DenseNet). The edge-sharpening loss function of the deep-learning model is designed to recover clear ground-object edges and obtain more detailed information from hazy images. In the high-frequency information extraction model, this study re-trained the Visual Geometry Group (VGG) network using remote-sensing images. Experimental results reveal that the proposed method can recover different kinds of scenes from hazy images successfully and obtain excellent color consistency. Moreover, the ability of the proposed method to obtain clear edges and rich texture feature information makes it superior to the existing methods.","authors":["Anna Hu","Zhong Xie","Yongyang Xu","Mingyu Xie"],"meta":["December 2020Remote Sensing 12(24):4162","DOI:10.3390/rs12244162"],"references":["336962036_Blind_cloud_and_cloud_shadow_removal_of_multitemporal_images_based_on_total_variation_regularized_low-rank_sparsity_decomposition","336207951_Efficiently_utilizing_complex-valued_PolSAR_image_data_via_a_multi-task_deep_learning_framework","336119502_Combining_Sentinel-1_and_Sentinel-2_Satellite_Image_Time_Series_for_land_cover_mapping_via_a_multi-source_deep_learning_architecture","334840641_A_cloud_detection_algorithm_for_satellite_imagery_based_on_deep_learning","333447393_A_deep_learning_approach_to_detecting_volcano_deformation_from_satellite_imagery_using_synthetic_datasets","343429529_Measuring_the_similarity_between_multipolygons_using_convex_hulls_and_position_graphs","339088086_Discovering_the_joint_influence_of_urban_facilities_on_crime_occurrence_using_spatial_co-location_pattern_mining","337663481_Multi-modal_deep_learning_for_landform_recognition","337646130_RTSRGAN_Real-Time_Super-Resolution_Generative_Adversarial_Networks","334143650_Thin_cloud_removal_with_residual_symmetrical_concatenation_network"]}