{"id":"347760484_How_to_Optimize_an_Academic_Team_When_the_Outlier_Member_is_Leaving","abstract":"An academic team is a highly-cohesive collaboration group of scholars, which has been recognized as an effective way to improve scientific output in terms of both quality and quantity. However, the high staff turnover brings about a series of problems that may have negative influence on team performance. To address this challenge, we first detect the tendency of the member who may potentially leave. Here the outlierness is defined with respect to familiarity, which is quantified by using collaboration intensity. It is assumed that if a team member has a higher familiarity with scholars outside the team, then this member might probably leave the team. To minimize the influence caused by the leaving of such an outlier member, we propose an optimization solution to find a proper candidate who can replace the outlier member. Based on random walk with graph kernel, our solution involves familiarity matching, skill matching, as well as structure matching. The proposed approach proves to be effective and outperforms existing methods when applied to computer science academic teams.","authors":["Shuo Yu","Jiaying Liu","Feng Xia","Haoran Wei"],"meta":["December 2020Intelligent Systems, IEEE PP(99):1-1","DOI:10.1109/MIS.2020.3042871"],"references":["343375395_Multivariate_Relations_Aggregation_Learning_in_Social_Networks","333761043_Academic_Team_Formulation_Based_on_Liebig's_Barrel_Discovery_of_Anticask_Effect","326272532_Normative_foundations_of_human_cooperation","324177481_Team_Recognition_in_Big_Scholarly_Data_Exploring_Collaboration_Intensity","311165414_Enhancing_Team_Composition_in_Professional_Networks_Problem_Definitions_and_Fast_Solutions","304552145_Replacing_the_Irreplaceable_Fast_Algorithms_for_Team_Member_Recommendation","299365515_Network_Science_Web_Science_and_Internet_Science","278031193_Network_motif_discovery_A_GPU_approach","324045000_Social_Connection_Aware_Team_Formation_for_Participatory_Tasks","299545107_USTF_A_Unified_System_for_Team_Formation"]}