{"id":"347752321_Addressing_Sinkhole_Attacks_In_Wireless_Sensor_Networks_-A_Review","abstract":"Wireless Sensor Networks is a cooperative network of number of sensor devices that communicate in a short range to share the sensed information. The sensor networks have got a great attention due to low cost and ad-hoc deployment structure. Thus, wireless sensor networks have become an important interest of research and many researchers have been working on different aspects of wireless sensor networks i.e. routing mechanism, energy efficiency and security etc. Wireless sensor networks are characterized with low resources i.e. low processing power, low communication resources, low memory and are powered by a battery. To utilize these scarce resources well different trade-offs are their when designing the protocols for wireless sensor networks. Security is most crucial issue in wireless sensor networks due to their nature. The low processing and low memory constraints prohibit the deployment of a protocol with security mechanisms in it. Wireless Sensor networks are deployed in vulnerable environment and are open to sinkhole attacks, wormhole attacks, Greyhole attacks etc. Sinkhole attacks are one of the most dangerous attacks where some fake node advertises fake routing update i.e. shortest path to sink node to malfunction network traffic. In this paper, a systematic literature review is conducted to highlight up to date sinkhole attacks along with their prevention techniques in wireless networks. The analysis is based on various parameters of proposed solutions. The paper also discusses the challenges in detecting the sinkhole attacks.","authors":["Mubashir Ali","Muhammad Nadeem","Ayesha Siddique","Shahbaz Ahmad"],"meta":["September 2020International Journal of Scientific & Technology Research 9(8):406-411"],"references":["332948570_Distributed_Wormhole_Attack_Mitigation_Technique_in_WSNs","329040072_Research_on_the_intrusion_detection_model_based_on_improved_cumulative_summation_and_evidence_theory_for_wireless_sensor_network","324898667_MLAMAN_a_novel_multi-level_authentication_model_and_protocol_for_preventing_wormhole_attack_in_mobile_ad_hoc_network","324822328_A_Game_Theory_Based_Multi_Layered_Intrusion_Detection_Framework_for_Wireless_Sensor_Networks","323436804_Wireless_ad_hoc_network_Detection_of_malicious_node_by_using_neighbour-based_authentication_approach","323277720_Effectively_suppress_the_attack_of_sinkhole_in_wireless_sensor_network_using_enhanced_particle_swarm_optimization_technique","319543736_A_Survey_of_Potential_Security_Issues_in_Existing_Wireless_Sensor_Network_Protocols","331899657_A_Lightweight_Algorithm_against_Replica_Node_Attack_in_Mobile_Wireless_Sensor_Networks_using_Learning_Agents","324265879_A_Novel_Node_Collusion_Method_for_Isolating_Sinkhole_Nodes_in_Mobile_Ad_Hoc_Cloud","323197148_A_survey_on_various_detection_techniques_of_sinkhole_attacks_in_WSN"]}