{"id":"347796069_Number_Formats_Error_Mitigation_and_Scope_for_16-Bit_Arithmetics_in_Weather_and_Climate_Modeling_Analyzed_With_a_Shallow_Water_Model","abstract":"The need for high-precision calculations with 64-bit or 32-bit floating-point arithmetic for weather and climate models is questioned. Lower-precision numbers can accelerate simulations and are increasingly supported by modern computing hardware. This paper investigates the potential of 16-bit arithmetic when applied within a shallow water model that serves as a medium complexity weather or climate application. There are several 16-bit number formats that can potentially be used (IEEE half precision, BFloat16, posits, integer, and fixed-point). It is evident that a simple change to 16-bit arithmetic will not be possible for complex weather and climate applications as it will degrade model results by intolerable rounding errors that cause a stalling of model dynamics or model instabilities. However, if the posit number format is used as an alternative to the standard floating-point numbers, the model degradation can be significantly reduced. Furthermore, mitigation methods, such as rescaling, reordering, and mixed precision, are available to make model simulations resilient against a precision reduction. If mitigation methods are applied, 16-bit floating-point arithmetic can be used successfully within the shallow water model. The results show the potential of 16-bit formats for at least parts of complex weather and climate models where rounding errors would be entirely masked by initial condition, model, or discretization error.","authors":["Milan Klöwer","Peter D. Düben","T. N. Palmer"],"meta":["October 2020Journal of Advances in Modeling Earth Systems 12(10)","DOI:10.1029/2020MS002246"],"references":["340183766_Single-Precision_in_the_Tangent-Linear_and_Adjoint_Models_of_Incremental_4D-Var","338926606_Reduced-precision_parametrization_lessons_from_an_intermediate-complexity_atmospheric_model","334662244_How_to_use_mixed_precision_in_ocean_models_exploring_a_potential_reduction_of_numerical_precision_in_NEMO_40_and_ROMS_36","332920275_Posits_as_an_alternative_to_floats_for_weather_and_climate_models","343409002_Efficient_arbitrarily_high_precision_hardware_logarithmic_arithmetic_for_linear_algebra","339921309_Design_of_Power_Efficient_Posit_Multiplier","338649509_Using_DCT-based_Approximate_Communication_to_Improve_MPI_Performance_in_Parallel_Clusters","336712445_Bfloat16_Processing_for_Neural_Networks","332920989_An_Accelerator_for_Posit_Arithmetic_Targeting_Posit_Level_1_BLAS_Routines_and_Pair-HMM","331755767_Exascale_Deep_Learning_for_Climate_Analytics"]}