{"id":"347821746_On_the_impact_of_smart_sensor_approximations_on_the_accuracy_of_machine_learning_tasks","abstract":"Smart sensors present in ubiquitous Internet of Things (IoT) devices often obtain high energy efficiency by carefully tuning how the sensing, the analog to digital (A/D) conversion and the digital serial transmission are implemented. Such tuning involves approximations, i.e. alterations of the sensed signals that can positively affect energy consumption in various ways. However, for many IoT applications, approximations may have an impact on the quality of the produced output, for example on the classification accuracy of a Machine Learning (ML) model. While the impact of approximations on ML algorithms is widely studied, previous works have focused mostly on processing approximations.\nIn this work, in contrast, we analyze how the signal alterations imposed by smart sensors impact the accuracy of ML classifiers. We focus in particular on data alterations introduced in the serial transmission from a smart sensor to a processor, although our considerations can also be extended to other sources of approximation, such as A/D conversion. Results on several types of models and on two different datasets show that ML algorithms are quite resilient to the alterations produced by smart sensors, and that the serial transmission energy can be reduced by up to 70% without a significant impact on classification accuracy. Moreover, we also show that, contrarily to expectations, the two generic approximation families identified in our work yield similar accuracy losses.","authors":["Daniele Jahier Pagliari","Massimo Poncino"],"meta":["December 2020Heliyon 6(12):e05750","DOI:10.1016/j.heliyon.2020.e05750"],"references":["335088340_Practical_Considerations_for_Accuracy_Evaluation_in_Sensor-Based_Machine_Learning_and_Deep_Learning","334489669_Deep_Learning_With_Edge_Computing_A_Review","331218270_Dynamic_Bit-width_Reconfiguration_for_Energy-Efficient_Deep_Learning_Hardware","329111400_A_Noise-Resilient_Online_Learning_Algorithm_for_Scene_Classification","326487822_XNOR_Neural_Engine_a_Hardware_Accelerator_IP_for_216_fJop_Binary_Neural_Network_Inference","345124624_AXSERBUS_A_quality-configurable_approximate_serial_bus_for_energy-efficient_sensing","340404013_Approximate_Hardware_Techniques_for_Energy-Quality_Scaling_Across_the_System","339504616_Error-Efficient_Computing_Systems","338664237_Warp_A_Hardware_Platform_for_Efficient_Multimodal_Sensing_With_Adaptive_Approximation","328777246_AxBA_an_approximate_bus_architecture_framework"]}