{"id":"347859810_The_spatial_distribution_of_retail_outlets_in_Urumqi_The_application_of_points_of_interest","abstract":"Studies on the distribution of retail outlets are crucial for optimizing urban resource allocation, and their rationalized layout plays an important role in developing urban economies and meeting consumer demand. However, the literature on the subject has been limited by data collection. In the era of big data, there has been an emergence of geo-referenced data that are more accurate and convenient and thus more able to be applied in the retail analysis. This study addresses this lacuna by exploring the spatial distribution of various retail outlets with the application of points of interest. Our study demonstrates that (1) the retail outlets in Urumqi are concentrated in the inner city. The inner-city area has a higher density distribution of retail outlets, and the development of the retail function is more mature. (2) Various categories of retail outlets display dissimilar agglomeration characteristics and hot spots. Specialty stores, clothing and footwear stores, convenience stores, and home-building material markets have lower average nearest-neighbor distances. (3) The retail outlets in the subject area are directionally distributed in the northwest–southeast direction, which is the result of both the topographical condition and government intervention in Urumqi. (4) Various categories of retail outlets tend to agglomerate at different scales. These results are conducive to the exploration of the location rules and layout preferences of retail locations, and they provide a reference for guiding the adjustment and optimization of retail layouts.","authors":["Zhao Yannan","Zhang Lu","Zhang Xinhuan"],"meta":["November 2020Open Geosciences 12(1):1541-1556","DOI:10.1515/geo-2020-0149"],"references":["334967496_Using_Nighttime_Light_Data_and_POI_Big_Data_to_Detect_the_Urban_Centers_of_Hangzhou","331500129_Measuring_the_Spatial_Allocation_Rationality_of_Service_Facilities_of_Residential_Areas_Based_on_Internet_Map_and_Location-Based_Service_Data","318249284_Using_multi-source_geospatial_big_data_to_identify_the_structure_of_polycentric_cities","347103473_Spatial_distribution_pattern_of_the_customer_count_and_satisfaction_of_commercial_facilities_based_on_social_network_review_data_in_Beijing_China","343179405_Temporal_and_spatial_evolution_of_top_grade_hotel_industry_and_its_influencing_factors_in_central_district_of_Urumqi","329052672_Defining_and_Estimating_a_Trading_Area","328665472_The_location_of_retail_stores_and_street_centrality_in_Guangzhou_China","324413015_Valuing_Spatial_Access_to_Types_of_Retail_and_Effects_on_the_Housing_Price_in_Seoul_Korea","319641737_Predicting_Commercial_Activeness_over_Urban_Big_Data","317150716_A_Study_of_Retail_Format_Strategy_Deployed_by_Southeast_Asia_Regional_Retailers_Focusing_on_Cases_in_Vietnam"]}