{"id":"347860111_Examining_User_Perception_and_Usage_of_Voice_Search","abstract":"With the development of mobile technologies, voice search is becoming increasingly important in our daily lives. By investigating the general usage of voice search and user perception about voice search systems, this research aims to understand users’ voice search behavior. We are particularly interested in how users perform voice search, their topics of interest, and their preference toward voice search. We elicit users’ opinions by asking them to fill out an online survey. Results indicated that participants liked voice search because it was convenient. However, voice search was used much less frequently than keyboard search. The success rate of voice search was low, and the participants usually gave up voice search or switched to keyboard search. They tended to perform voice search when they were driving or walking. Moreover, the participants mainly used voice search for simple tasks on mobile devices. The main reasons why participants disliked voice search are attributed to the system mistakes and the fact that they were unable to modify the queries.","authors":["Ning Sa","Xiao-Jun Yuan"],"meta":["December 2020Data and Information Management 5(1):40-47","DOI:10.2478/dim-2020-0046"],"references":["220794468_Spoken_Dialog_Challenge_2010_Comparison_of_Live_and_Control_Test_Results","220029402_Spoken_Dialog_Challenge_2010_Comparison_of_Live_and_Control_Test_Results","283890740_Factors_Affecting_User_Perception_of_a_Spoken_Language_vs_Textual_Search_Interface_A_Content_Analysis","278657454_Your_Word_is_my_Command_Google_Search_by_Voice_A_Case_Study","266658478_Mobile_query_reformulations","249946027_Task_as_a_Context_of_Information_Seeking_An_Investigation_of_Daily_Life_Tasks_on_the_Web","238687187_The_Beauty_of_Errors_Patterns_of_Error_Correction_in_Desktop_Speech_Systems","220435115_Written_versus_spoken_queries_A_qualitative_and_quantitative_comparative_analysis","3703267_Error_resolution_during_multimodal_human-computer_interaction","2961929_Deciphering_Trends_in_Mobile_Search"]}