{"id":"347845074_An_interpretable_classifier_for_high-resolution_breast_cancer_screening_images_utilizing_weakly_supervised_localization","abstract":"Medical images differ from natural images in significantly higher resolutions and smaller regions of interest. Because of these differences, neural network architectures that work well for natural images might not be applicable to medical image analysis. In this work, we propose a novel neural network model to address these unique properties of medical images. This model first uses a low-capacity, yet memory-efficient, network on the whole image to identify the most informative regions. It then applies another higher-capacity network to collect details from chosen regions. Finally, it employs a fusion module that aggregates global and local information to make a prediction. While existing methods often require lesion segmentation during training, our model is trained with only image-level labels and can generate pixel-level saliency maps indicating possible malignant findings. We apply the model to screening mammography interpretation: predicting the presence or absence of benign and malignant lesions. On the NYU Breast Cancer Screening Dataset, our model outperforms (AUC = 0.93) ResNet-34 and Faster R-CNN in classifying breasts with malignant findings. On the CBIS-DDSM dataset, our model achieves performance (AUC = 0.858) on par with state-of-the-art approaches. Compared to ResNet-34, our model is 4.1x faster for inference while using 78.4% less GPU memory. Furthermore, we demonstrate, in a reader study, that our model surpasses radiologist-level AUC by a margin of 0.11.","authors":["Yiqiu Shen","Nan Wu","Jason Phang","Jungkyu Park"],"meta":["December 2020Medical Image Analysis 68(Feb):101908","DOI:10.1016/j.media.2020.101908"],"references":["338332372_International_evaluation_of_an_AI_system_for_breast_cancer_screening","337832074_Align_Attend_and_Locate_Chest_X-Ray_Diagnosis_via_Contrast_Induced_Attention_Network_With_Limited_Supervision","336635705_Prediction_of_BAP1_Expression_in_Uveal_Melanoma_Using_Densely-Connected_Deep_Classification_Networks","343461402_Evaluating_Weakly_Supervised_Object_Localization_Methods_Right","340170194_Checklist_for_Artificial_Intelligence_in_Medical_Imaging_CLAIM_A_Guide_for_Authors_and_Reviewers","339556516_Joint_Learning_of_Saliency_Detection_and_Weakly_Supervised_Semantic_Segmentation","338736336_Deep_Neural_Networks_With_Region-Based_Pooling_Structures_for_Mammographic_Image_Classification","338506820_Learning_Instance_Activation_Maps_for_Weakly_Supervised_Instance_Segmentation","338460716_Cancer_statistics_2020","337701975_Thorax_Disease_Classification_with_Attention_Guided_Convolutional_Neural_Network"]}