{"id":"347869642_Big_issues_for_big_data_challenges_for_critical_spatial_data_analytics","abstract":"In this paper we consider some of the issues of working with big data and big spatial data and highlight the need for an open and critical framework. We focus on a set of challenges underlying the collection and analysis of big data. In particular, we consider 1) inference when working with usually biased big data, challenging the assumed inferential superiority of data with observations, n, approaching N, the population n -> N. We also emphasise 2) the need for analyses that answer questions of practical significance or with greater emphasis on the size of the effect, rather than the truth or falsehood of a statistical statement; 3) the need to accept messiness in your data and to document all operations undertaken on the data because of this, in support of openness and reproducibility paradigms; and 4) the need to explicitly seek to understand the causes of bias, messiness etc in the data and the inferential consequences of using such data in analyses, by adopting critical approaches to spatial data science. In particular we consider the need to place individual data science studies in a wider social and economic contexts, along with the role of inferential theory in the presence of big data, and issues relating to messiness and complexity in big data.","authors":["Chris Brunsdon","Alexis Comber"],"meta":["December 2020Journal of Spatial Information Science","DOI:10.5311/JOSIS.2020.21.625"],"references":["343214877_Opening_practice_Supporting_Reproducibility_and_Critical_Spatial_Data_Science","332239392_Geographic_Data_Science","325731576_Integrating_Data_Rescue_into_the_Classroom","309269597_Critical_data_studies_An_introduction","304189713_Critical_Data_Studies_A_dialog_on_data_and_space","346838114_Integrating_Geographic_Information_Systems_and_Agent-Based_Modeling_Techniques_for_Understanding_Social_and_Ecological_Processes","326669478_Statistical_paradises_and_paradoxes_in_big_data_I_Law_of_large_populations_big_data_paradox_and_the_2016_US_presidential_election","320117204_Data_Organization_in_Spreadsheets","312393019_A_250_year_drought_catalogue_for_the_island_of_Ireland_1765-2015","298171090_The_rise_of_big_data"]}