{"id":"347975675_Influencia_del_aula_invertida_en_el_rendimiento_academico_Una_revision_sistematica","abstract":"El método flipped classroom o en su traducción, aula invertida, se alza como una de las metodologías docentes con gran proyección para su implementación en la etapa de educación superior. Este método basado en las Tecnologías de la Información y Comunicación permite el aprendizaje activo del estudiantado. Ante su auge, cabe cuestionarnos que tipo de influencia presenta en el aprendizaje de los estudiantes. Por lo que en este trabajo se propuso como objetivo analizar la producción científica sobre aula invertida para comprobar su efecto en el rendimiento académico. Así pues, se ha empleado una metodología de revisión sistemática de la literatura. Se determinaron siete variables de análisis con influencia en el constructo principal rendimiento académico, entre ellas: tamaño muestral, materia de estudio, país, diseño metodológico, instrumento de recogida de datos, duración de los estudios y resultados de las investigaciones. Entre los resultados obtenidos destaca la variabilidad de ámbitos de conocimiento, el empleo del diseño cuasiexperimental con grupo control y experimental y medidas pretest y postest y el test como instrumento de recogida de datos. Además, la mayor parte de los estudios indican un aumento del rendimiento académico en los grupos donde se implementa el aula invertida frente a los que siguen un método tradicional. finalmente, el trabajo presenta un marco optimista para la implementación del aula invertida, ya que se verifican distintos beneficios en el aprendizaje de los estudiantes.","authors":["Francisco Javier Hinojo-Lucena","Inmaculada Aznar Díaz","José-María Romero-Rodríguez","José Antonio Marín Marín"],"meta":["March 2019"],"references":["324766957_Incidence_of_the_Flipped_Classroom_in_the_Physical_Education_Students'_Academic_Performance_in_University_Contexts","323831539_Aula_Invertida_y_Pedagogia_Conceptual_en_la_ensenanza_y_aprendizaje_de_la_Estadistica_en_Educacion_Superior_El_caso_de_la_estimacion_y_la_prueba_de_hipotesis_Inverted_Classroom_and_Conceptual_Pedagogy","323463480_Propuesta_de_modelo_tecnologico_para_Flipped_Classroom_T-FliC_en_educacion_superior","323372128_Aula_invertida_mediada_por_el_uso_de_plataformas_virtuales_un_estudio_de_caso_en_la_formacion_de_profesores_de_fisica","323154060_Practica_de_Laboratorio_de_Granos_de_Almidon_en_un_Curso_de_Universitario_de_Botanica_General_una_Experiencia_de_Clase_Invertida","321809718_Information_Literacy_and_the_Flipped_Classroom_Examining_the_Impact_of_a_One-Shot_Flipped_Class_on_Student_Learning_and_Perceptions","321477203_The_Effect_of_Structure_in_Flipped_Classroom_Designs_For_Deep_and_Surface_Learning_Approaches","321159686_El_modelo_Flipped_Classroom","333350744_Flipped_Classroom_Un_modelo_pedagogico_eficaz_en_el_aprendizaje_de_Science","332663105_El_aula_invertida_como_estrategia_para_la_mejora_del_rendimiento_academico"]}