{"id":"347903094_A_Binomial_Crossover_Based_Artificial_Bee_Colony_Algorithm_for_Cryptanalysis_of_Polyalphabetic_Cipher","abstract":"Cryptography is one of the common approaches to secure private data and cryptanalysis involves breaking down a coded cipher text without having the key. Cryptanalysis by brute force cannot be accepted as an effective approach and hence, metaheuristic algorithms performing systematic search can be applied to derive the optimal key. In this study, our aim is to examine the overall suitability of Artificial Bee Colony algorithm in the cryptanalysis of polyalphabetic cipher. For this purpose, using a number of different key lengths in both English and Turkish languages, basic Artificial Bee Colony algorithm (ABC) is applied in the cryptanalysis of Vigenere cipher. In order to improve the ABC algorithm's convergence speed, a modified binomial crossover based Artificial Bee Colony algorithm (BCABC) is proposed by introducing a binomial crossoverbased phase after employed bee phase for a precise search of global optimal solution. Different keys in various sizes, various cipher texts in both English and Turkish languages are used in the experiments. It is shown that optimal cryptanalysis keys produced by BCABC are notably competitive and better than those produced by basic ABC for Vigenere cipher analysis.","authors":["Arkan Sabonchi","Bahriye Akay"],"meta":["December 2020","DOI:10.17559/TV-20190422225110"],"references":["335611771_Cryptanalysis_using_Artificial_Bee_Colony_Algorithm_Guided_by_Frequency_based_Fitness_Value","335603478_Cryptanalytic_of_Substitution_Ciphers_by_Artificial_Bee_Colony_Algorithm_Guided_by_Statistics_based_Fitness_Function","316752665_An_Enhanced_Artificial_Bee_Colony_Algorithm_with_Adaptive_Differential_Operators","316158667_Hybrid_Artificial_Bee_Colony_Algorithm_with_Differential_Evolution","290095065_Contiguous_Binomial_Crossover_in_Differential_Evolution","283221702_Cryptanalysis_of_Transposition_Cipher_Using_Evolutionary_Algorithms","283221276_Genetic_Transformation_Techniques_in_Cryptanalysis","273789338_A_survey_on_the_applications_of_artificial_bee_colony_in_signal_image_and_video_processing","271646245_Crossover-based_artificial_bee_colony_algorithm_for_constrained_optimization_problems","271418845_Genetic_Algorithm_with_elitism_for_cryptanalysis_of_Vigenere_cipher"]}