{"id":"347980356_A_Framework_to_Generate_and_Label_Datasets_for_Non-Intrusive_Load_Monitoring","abstract":"In order to reduce the electricity consumption in our homes, a first step is to make the user aware of it. Raising such awareness, however, demands to pinpoint users of specific appliances that unnecessarily consume electricity. A retrofittable and scalable way to provide appliance-specific consumption is provided by Non-Intrusive Load Monitoring methods. These methods use a single electricity meter to record the aggregated consumption of all appliances and disaggregate it into the consumption of each individual appliance using advanced algorithms usually utilizing machine-learning approaches. Since these approaches are often supervised, labelled ground-truth data need to be collected in advance. Labeling on-phases of devices is already a tedious process, but, if further information about internal device states is required (e.g., intensity of an HVAC), manual post-processing quickly becomes infeasible. We propose a novel data collection and labeling framework for Non-Intrusive Load Monitoring. The framework is comprised of the hardware and software required to record and (semi-automatically) label the data. The hardware setup includes a smart-meter device to record aggregated consumption data and multiple socket meters to record appliance level data. Labeling is performed in a semi-automatic post-processing step guided by a graphical user interface, which reduced the labeling effort by 1. % compared to a manual approach. We evaluated our framework and present the FIRED dataset. The dataset features uninterrupted, time synced aggregated, and individual device voltage and current waveforms with distinct state transition labels for a total of 101 days.","authors":["Benjamin Völker","Marc Pfeifer","Philipp Scholl","Bernd Becker"],"meta":["December 2020Energies 14(1):75","DOI:10.3390/en14010075"],"references":["325773104_Developing_and_evaluating_a_probabilistic_event_detector_for_non-intrusive_load_monitoring","324046116_BLOND_a_building-level_office_environment_dataset_of_typical_electrical_appliances","316985682_RAE_The_Rainforest_Automation_Energy_Dataset_for_Smart_Grid_Meter_Data_Analysis","313783018_Assessing_Human_Activity_in_Elderly_People_Using_Non-Intrusive_Load_Monitoring","273668698_Semi-Automatic_Labeling_for_Public_Non-Intrusive_Load_Monitoring_Datasets","347158652_Annoticity_A_Smart_Annotation_Tool_and_Data_Browser_for_Electricity_Datasets","335707168_A_Multi-media_Exchange_Format_for_Time-Series_Dataset_Curation","333772020_Semi-Automatic_Generation_and_Labeling_of_Training_Data_for_Non-intrusive_Load_Monitoring","325374976_Towards_the_Fusion_of_Intrusive_and_Non-intrusive_Load_Monitoring_A_Hybrid_Approach","302931149_Advanced_metering_initiatives_and_residential_feedback_programs_a_meta-review_for_household_electricity-saving_opportunities"]}