{"id":"347950697_BlockNet_White_Paper_-_Exploring_the_Blockchain_Skills_Concept_and_Best_Practice_Use_Cases","abstract":"Part 1:\nIn order to explore the practical potential and needs of interdisciplinary knowledge and competence requirements of Blockchain technology, the project activity \"Development of Interdisciplinary Blockchain Skills Concept\" starts with the literature review identifying the state of the art of Blockchain in Supply Chain Management and Logistics, Business and Finance, as well as Computer Science and IT-Security. and the project activity further explores the academic and industry landscape of existing initiatives in education which offer Blockchain courses (learning programs, modules, courses, vocational trainings etc.). Moreover, job descriptions and adverts are analyzed in order to specify today's competence requirements from enterprises. To discuss and define the future required competence, expert workshops are organized to validate the findings by academic experts. Based on the research outcome and validation, an interdisciplinary approach for Blockchain competence is developed. \n\nPart2:\nThis part focuses on the development of the Blockchain Best Practices activity while conducting qualitative empirical research based on case studies with industry representatives. Therefore, company interviews, based on the literature review and theoretical basis of Output 1, explore existing Blockchain use cases in different sectors. Required skills and knowledge will emerge. Due to the interdisciplinary importance of Blockchain technology, these skills will be defined by different perspectives of Blockchain from across multiple disciplines such as Supply Chain Management and Logistics, Business, Economics and Finance, and Computer Science. The use cases and companies for the interviews will be selected based on various sampling criteria (e.g., industry, IT maturity and Blockchain experience, future adoption and the transformative capabilities) to gain results valid for a broad scale. The analysis of the various use cases will be conducted and defined in a standardized format to identify the key drivers and competence requirements for Blockchain technology applications and their adoption. On the one hand, this approach ensures comparability, on the other hand, it facilitates the development of a structured and systematic framework.","authors":["Boris Düdder","Vladislav V. Fomin","Tan Guerpinar","Michael Henke"],"meta":["December 2019","Projects: BlockNetBlockNet: Blockchain Network Online Education for interdisciplinary European Competence Transfer"],"references":["345717368_Potentials_of_Blockchain_Technology_for_Construction_Management","336885205_Blockchain-Technologie_im_interdisziplinaren_Umfeld","329230172_Security_in_networks_of_unmanned_aerial_vehicles_for_surveillance_with_an_agent-based_approach_inspired_by_the_principles_of_blockchain","329199239_Decentralizing_the_Stock_Exchange_using_Blockchain_An_Ethereum-based_implementation_of_the_Bucharest_Stock_Exchange","328785057_BeeKeeper_20_Confidential_Blockchain-Enabled_IoT_System_with_Fully_Homomorphic_Computation","345175042_Business_Modeling_and_Software_Design_8th_International_Symposium_BMSD_2018_Vienna_Austria_July_2-4_2018_Proceedings_8th_International_Symposium_BMSD_2018_Vienna_Austria_July_2-4_2018_Proceedings","329928087_Blockchain_adoption_A_value_driver_perspective","328970267_BlockSee_Blockchain_for_IoT_Video_Surveillance_in_Smart_Cities","328941046_The_Blockchain_in_IoT_The_Road_to_Digitization","328820555_Do_you_Need_a_Blockchain","328750708_A_Study_on_the_Transparent_Price_Tracing_System_in_Supply_Chain_Management_Based_on_Blockchain","328476292_A_Blockchain_Aided_Metric_for_Predictive_Delivery_Performance_in_Supply_Chain_Management","328468453_Smart_Contract-Based_Review_System_for_an_IoT_Data_Marketplace","328519761_Blockchain_technology_for_enhancing_supply_chain_resilience","328460623_Ensuring_performance_measurement_integrity_in_logistics_using_blockchain"]}