{"id":"347910057_A_novel_decentralized_platform_for_peer-to-peer_energy_trading_market_with_blockchain_technology","abstract":"Peer-to-Peer (P2P) energy trading, which allows energy consumers/producers to directly trade with each other, is one of the new paradigms driven by the decarbonization, decentralization, and digitalization of the energy supply chain. Additionally, the rise of blockchain technology suggests unprecedented socio-economic benefits for energy systems, especially when coupled with P2P energy trading. Despite such future prospects in energy systems, three key challenges might hinder the full integration of P2P energy trading and blockchain. First, it is quite complicated to design a decentralized P2P market that keeps a fair balance between economic efficiency and information privacy. Secondly, with the proliferation of storage devices, new P2P market designs are needed to account for their inter-temporal dependencies. Thirdly, a practical implementation of blockchain technology for P2P trading is required, which can facilitate efficient trading in a secured and fraud-resilient way, while eliminating any intermediaries’ costs. In this paper, we develop a new decentralized P2P energy trading platform to address all the aforementioned challenges. Our platform consists of two key layers: market and blockchain. The market layer features a parallel and short-term pool-structured auction and is cleared using a novel decentralized Ant-Colony Optimization method. This market arrangement guarantees a near-optimally efficient market solution, preserves players’ privacy, and allows inter-temporal market products trading. The blockchain layer offers a high level of automation, security, and fast real-time settlements through smart contract implementation. Finally, using real-world data, we simulate the functionality of the platform regarding energy trading, market clearing, smart contract operations, and blockchain-based settlements.","authors":["Ayman Esmat","Martijn de Vos","Yashar Ghiassi-Farrokhfal","Peter Palensky"],"meta":["January 2021Applied Energy 282(22):116123","DOI:10.1016/j.apenergy.2020.116123"],"references":["341739209_User_behavior_in_a_real-world_peer-to-peer_electricity_market","339472503_An_integrated_blockchain-based_energy_management_platform_with_bilateral_trading_for_microgrid_communities","339271709_Investigating_the_Impact_of_P2P_Trading_on_Power_Losses_in_Grid-connected_Networks_with_Prosumers","337297053_Hybrid_Trading_Scheme_for_Peer-to-Peer_Energy_Trading_in_Transactive_Energy_Markets","341718014_Electricity_trading_pricing_among_prosumers_with_game_theory-based_model_in_energy_blockchain_environment","340039786_Smart_contract_architecture_for_decentralized_energy_trading_and_management_based_on_blockchains","339332739_A_Time-Series_Distribution_Test_System_Based_on_Real_Utility_Data","338973748_A_distributed_Peer-to-Peer_energy_transaction_method_for_diversified_prosumers_in_Urban_Community_Microgrid_System","338439913_A_Coalition_Formation_Game_Framework_for_Peer-to-Peer_Energy_Trading","334819185_Riding_the_Blockchain_Mania_Public_Firms'_Speculative_8-K_Disclosures"]}