{"id":"347961720_Using_very-high-resolution_satellite_imagery_and_deep_learning_to_detect_and_count_African_elephants_in_heterogeneous_landscapes","abstract":"Satellites allow large‐scale surveys to be conducted in short time periods with repeat surveys possible at intervals of <24 h. Very‐high‐resolution satellite imagery has been successfully used to detect and count a number of wildlife species in open, homogeneous landscapes and seascapes where target animals have a strong contrast with their environment. However, no research to date has detected animals in complex heterogeneous environments or detected elephants from space using very‐high‐resolution satellite imagery and deep learning. In this study, we apply a Convolution Neural Network (CNN) model to automatically detect and count African elephants in a woodland savanna ecosystem in South Africa. We use WorldView‐3 and 4 satellite data –the highest resolution satellite imagery commercially available. We train and test the model on 11 images from 2014 to 2019. We compare the performance accuracy of the CNN against human accuracy. Additionally, we apply the model on a coarser resolution satellite image (GeoEye‐1) captured in Kenya, without any additional training data, to test if the algorithm can generalize to an elephant population outside of the training area. Our results show that the CNN performs with high accuracy, comparable to human detection capabilities. The detection accuracy (i.e., F2 score) of the CNN models was 0.78 in heterogeneous areas and 0.73 in homogenous areas. This compares with the detection accuracy of the human labels with an averaged F2 score 0.77 in heterogeneous areas and 0.80 in homogenous areas. The CNN model can generalize to detect elephants in a different geographical location and from a lower resolution satellite. Our study demonstrates the feasibility of applying state‐of‐the‐art satellite remote sensing and deep learning technologies for detecting and counting African elephants in heterogeneous landscapes. The study showcases the feasibility of using high resolution satellite imagery as a promising new wildlife surveying technique. Through creation of a customized training dataset and application of a Convolutional Neural Network, we have automated the detection of elephants in satellite imagery with accuracy as high as human detection capabilities. The success of the model to detect elephants outside of the training data site demonstrates the generalizability of the technique. In this study, we apply a Convolution Neural Network (CNN) model to automatically detect and count African elephants in a woodland savanna ecosystem in South Africa. We use WorldView‐3 and 4 satellite data – the highest resolution satellite imagery commercially available. We compare the performance accuracy of the CNN against human accuracy generating high comparable detection performance.","authors":["Isla Duporge","Olga Isupova","Steven Reece","David W. Macdonald"],"meta":["December 2020Remote Sensing in Ecology and Conservation 7(21)","DOI:10.1002/rse2.195"],"references":["342673917_Deep_learning-based_methods_for_individual_recognition_in_small_birds","342427292_Using_Deep_Learning_to_Count_Albatrosses_from_Space_Assessing_Results_in_Light_of_Ground_Truth_Uncertainty","339773700_Three_critical_factors_affecting_automated_image_species_recognition_performance_for_camera_traps","336928105_Multispectral_Image-Based_Estimation_of_Drought_Patterns_and_Intensity_around_Lake_Chad_Africa","336232042_Whale_counting_in_satellite_and_aerial_images_with_deep_learning","336201153_Aerial-trained_deep_learning_networks_for_surveying_cetaceans_from_satellite_imagery","345478601_mathcalR2_-CNN_Fast_Tiny_Object_Detection_in_Large-Scale_Remote_Sensing_Images","339606358_SealNet_A_fully-automated_pack-ice_seal_detection_pipeline_for_sub-meter_satellite_imagery","338182683_Autonomous_Tracking_of_Sea_Turtles_based_on_Multibeam_Imaging_Sonar_Toward_Robotic_Observation_of_Marine_Life","336703841_The_VIA_Annotation_Software_for_Images_Audio_and_Video"]}