{"id":"348032498_Authorship_Identification_of_a_Russian-Language_Text_Using_Support_Vector_Machine_and_Deep_Neural_Networks","abstract":"The article explores approaches to determining the author of a natural language text and the advantages and disadvantages of these approaches. The importance of the considered problem is due to the active digitalization of society and reassignment of most parts of the life activities online. Text authorship methods are particularly useful for information security and forensics. For example, such methods can be used to identify authors of suicide notes, and other texts are subjected to forensic examinations. Another area of application is plagiarism detection. Plagiarism detection is a relevant issue both for the field of intellectual property protection in the digital space and for the educational process. The article describes identifying the author of the Russian-language text using support vector machine (SVM) and deep neural network architectures (long short-term memory (LSTM), convolutional neural networks (CNN) with attention, Transformer). The results show that all the considered algorithms are suitable for solving the authorship identification problem, but SVM shows the best accuracy. The average accuracy of SVM reaches 96%. This is due to thoroughly chosen parameters and feature space, which includes statistical and semantic features (including those extracted as a result of an aspect analysis). Deep neural networks are inferior to SVM in accuracy and reach only 93%. The study also includes an evaluation of the impact of attacks on the method on models’ accuracy. Experiments show that the SVM-based methods are unstable to deliberate text anonymization. In comparison, the loss in accuracy of deep neural networks does not exceed 20%. Transformer architecture is the most effective for anonymized texts and allows 81% accuracy to be achieved.","authors":["Aleksandr Romanov","Anna Kurtukova","Alexander Shelupanov","Anastasia Fedotova"],"meta":["December 2020Future Internet 13(1):3","DOI:10.3390/fi13010003"],"references":["347810326_Determining_the_Age_of_the_Author_of_the_Text_Based_on_Deep_Neural_Network_Models","347584966_Source_Code_Authorship_Identification_Using_Deep_Neural_Networks","344610100_Automatic_text-independent_speaker_verification_using_convolutional_deep_belief_network_in_Russian","340095276_Using_Ontology_for_Revealing_Authorship_Attribution_of_Arabic_Text","339482353_Explainable_Authorship_Verification_in_Social_Media_via_Attention-based_Similarity_Learning","329407260_An_Empirical_Study_on_Forensic_Analysis_of_Urdu_Text_Using_LDA-Based_Authorship_Attribution","343777621_Taming_Pretrained_Transformers_for_Extreme_Multi-label_Text_Classification","339907073_Author_Profiling_Prediction_of_Gender_and_Language_Variety_from_Document","334118059_Syntax_Encoding_with_Application_in_Authorship_Attribution","333822220_Identification_Author_of_Source_Code_by_Machine_Learning_MethodsIdentifikacia_avtora_ishodnogo_koda_metodami_masinnogo_obucenia"]}