{"id":"348012495_Formalization_of_the_Equivalence_among_Completeness_Theorems_of_Real_Number_in_Coq","abstract":"The formalization of mathematics based on theorem prover becomes increasingly important in mathematics and computer science, and, particularly, formalizing fundamental mathematical theories becomes especially essential. In this paper, we describe the formalization in Coq of eight very representative completeness theorems of real numbers. These theorems include the Dedekind fundamental theorem, Supremum theorem, Monotone convergence theorem, Nested interval theorem, Finite cover theorem, Accumulation point theorem, Sequential compactness theorem, and Cauchy completeness theorem. We formalize the real number theory strictly following Landau’s Foundations of Analysis where the Dedekind fundamental theorem can be proved. We extend this system and complete the related notions and properties for finiteness and sequence. We prove these theorems in turn from Dedekind fundamental theorem, and finally prove the Dedekind fundamental theorem by the Cauchy completeness theorem. The full details of formal proof are checked by the proof assistant Coq, which embodies the characteristics of reliability and interactivity. This work can lay the foundation for many applications, especially in calculus and topology.","authors":["Yaoshun Fu","Wensheng yu"],"meta":["December 2020","DOI:10.3390/math9010038"],"references":["338985575_A_Formal_System_of_Axiomatic_Set_Theory_in_Coq","328565448_Formally_Verifying_the_Solution_to_the_Boolean_Pythagorean_Triples_Problem","311647401_Implementation_of_Bourbaki's_Elements_of_Mathematics_in_Coq_Part_Two_From_Natural_Numbers_to_Real_Numbers","297047486_Mixing_Computations_and_Proofs","342755945_A_Formalization_of_Properties_of_Continuous_Functions_on_Closed_Intervals","324367116_Introduction_to_Calculus_and_Analysis","322944063_Who_Gave_You_the_Epsilon_Cauchy_and_the_Origins_of_Rigorous_Calculus","312244145_The_next_700_syntactical_models_of_type_theory","290271966_Checking_Landau's_Grundlagen_in_the_Automath_System","284688895_Formal_proof_-_The_four-color_theorem"]}