{"id":"348018889_Cryptocurrency_adoption_in_travel_and_tourism_-_an_exploratory_study_of_Asia_Pacific_travellers","abstract":"Blockchain technologies are predicted to substantially transform the tourism industry. At present, cryptocurrencies are the most advanced application of public blockchains that promise benefits such as a universal means of payment and minimal fees through the removal of intermediaries. In the tourism industry, though many tourism vendors have been accepting cryptocurrencies and the potential of using cryptocurrencies in travel-related consumption has been intensively documented, existing knowledge about travellers' intention to use cryptocurrencies for payment purposes is limited. Traditional models do not account for the idiosyncrasies of cryptocurrencies and are therefore less appropriate to foster the understanding of travellers' adoption of travel-related payments. To fill this knowledge gap, an exploratory study was conducted with 161 travellers from the Asia-Pacific region who have previously consumed travel-related services with cryptocurrencies. Their previous usage experiences are analysed and reported. Through harnessing the correspondence analysis, several technological contingency factors were identified, as well as positive and negative perceptual antecedents. Additionally, their levels of satisfaction and intention to re-use the technology in future trips were investigated. Based on these findings, several propositions are suggested for guiding future research on travellers' cryptocurrency adoption in the travel and tourism contexts. ARTICLE HISTORY","authors":["Horst Treiblmaier","Daniel Leung","Andrei O. J. Kwok","Aaron Tham Min-En"],"meta":["December 2020Current Issues in Tourism","DOI:10.1080/13683500.2020.1863928","Project: Implications of Blockchain"],"references":["343881714_How_Smart_Tourism_Embrace_Blockchains_and_Smart_Contracts","342573102_A_critical_reflection_on_the_adoption_of_blockchain_in_tourism","342179655_Blockchain_and_Tourism","350877918_The_Application_of_Blockchain_in_Tourism_Use_Cases_in_the_Tourism_Value_System","350649459_Correspondence_Analysis_in_Practice","344414789_Blockchain_Is_it_the_future_for_the_tourism_and_hospitality_industry","343482862_The_Asian_Paradigm_in_Hospitality_and_Tourism","342748565_Innovation_diffusion_in_tourism_how_information_about_blockchain_is_exchanged_and_characterized_on_twitter","342091385_Do_consumers_really_trust_cryptocurrencies","340990119_Blockchain_technology_framework_Current_and_future_perspectives_for_the_tourism_industry"]}