{"id":"348088883_Trust_in_Trust-free_Digital_Networks_How_Inter-firm_Algorithmic_Relationships_Embed_the_Cardinal_Principles_of_Value_Co-creation","abstract":"In this exploratory research, I develop new knowledge on trust in inter-firm cooperation that leverages recent technologies such as blockchain and the Internet of things in a digital platform ecosystem. In a digital network, advanced algorithms govern and shape inter-firm business processes. While such algorithms introduce efficiency in inter-firm business processes, their limitations, especially their apparent lack of transparency, may affect the key trust dimensions (i.e., reliability, fairness, and goodwill) in the relationships among the participating firms. I introduce algorithmic relationship, a label that embeds the concepts of smart contracts in inter-firm cooperation. Algorithmic relationships involve autonomous and semi-autonomous implementations of smart contracts in all lifecycle stages of inter-firm cooperation. By analyzing extant literature on trust, inter-firm cooperation, business model innovation, and digital platforms, I demonstrate how various factors influence whether firms adopt smart contracts: perceptions about other participants’ trustworthiness, participants’ own propensity to trust, participants’ shared goals and resource embeddedness in the network, perceived risks in inter-firm interactions, and complexity and time criticality of inter-firm interactions. Taking a temporal perspective, I also recognize the present lacunae with smart contracts from various perspectives (algorithm development, algorithm implementation, algorithm governance, and the availability of appropriate legal resources in the event that disputes occur) and demonstrate how these drawbacks impede shared value creation.\nKeywords: Algorithmic Relationships, Blockchain, Internet of Things, Inter-firm Cooperation, Smart Contracts, Trust.","authors":["Arindam Das"],"meta":["December 2020","DOI:10.17705/1thci.00137"],"references":["341913793_The_Truth_About_Blockchain","336967927_Management_Governance_and_Value_Creation_in_a_Blockchain_Consortium","336569445_Blockchain_Research_in_Information_Systems_Current_Trends_and_an_Inclusive_Future_Research_Agenda","334444222_The_evolution_of_platform_business_models_Exploring_competitive_battles_in_the_world_of_platforms","333545589_A_Ten-Step_Decision_Path_to_Determine_When_to_Use_Blockchain_Technologies","333256033_Internalization_theory_for_the_digital_economy","344959048_Blockchain_research_practice_and_policy_Applications_benefits_limitations_emerging_research_themes_and_research_agenda","338970817_A_framework_for_analysing_blockchain_technology_adoption_Integrating_institutional_market_and_technical_factors","338875933_A_2020_perspective_on_The_limits_of_trust-free_systems_A_literature_review_on_blockchain_technology_and_trust_in_the_sharing_economy","336569031_Business_on_Chain_A_Comparative_Case_Study_of_Five_Blockchain-Inspired_Business_Models"]}