{"id":"348041219_Students'_preferences_in_selection_of_computer_science_and_informatics_studies_A_comprehensive_empirical_case_study","abstract":"A selection of Computer Science, Informatics or similar study programs for academic studies evidently becomes an emerging choice of a vast number of students in recent years. To address some of the open questions, we performed an 25 empirical study based on a survey, with a goal to find out the main motivating fac tors directing students to select computer science, informatics or similar programs for studying in a much greater extent. The survey was conducted on a sample of 1517 students from five well established, and most traditional faculties of computer science and informatics at three largest university cities in Serbia: Belgrade, Novi Sad, and Nis?. The created sample is representative enough to illustrate the current situation and trends common for many similar societies. Our first analyses show that the main motivating factor to select computer science or informatics study program at all faculties is a students? motivation to study just that topic, while at management faculty it is significantly less important. However, we also noticed that significant number of students wished to study something else but chose computer science and informatics due to possibility of finding jobs easier and of earning higher salaries in industry. The most important influential factors to choose a computer science or informatics major come from family members, and close relatives. The perceived brand and reputation of a faculty also plays a significant role. Students being examined prevalently tend to be satisfied with the faculty they have chosen. However, many of them see themselves leaving the country in a near or far future.","authors":["Milos Savic","Mirjana Ivanovic","Ivan Luković","Boris Delibašić"],"meta":["January 2020Computer Science and Information Systems 18(00):54-54","DOI:10.2298/CSIS200901054S"],"references":["323338966_Choosing_STEM_College_Majors_Exploring_the_Role_of_Pre-College_Engineering_Courses","241739256_Influences_on_Students'_Choice_of_College_Major","222513527_How_Do_Young_People_Choose_College_Majors","343221955_Design_and_development_of_the_online_career_counselling_a_tool_for_better_career_decision-making","230202999_Pipeline_Persistence_Examining_the_Association_of_Educational_Experiences_With_Earned_Degrees_in_STEM_Among_US_Students"]}