{"id":"348136976_Problem_characterization_for_visual_analytics_in_MOOC_learner's_support_monitoring_A_case_of_Malaysian_MOOC","abstract":"Malaysia and many other developing countries progressively adopting massively open online course (MOOC) in their national higher education approach. We have observed an increasing need for facilitating MOOC monitoring that is associated with the rising adoption of MOOCs. Our observation suggests that recent adoption cases led analyst and instructors to focus on monitoring enrolment and learning activities. Visual analytics in MOOC support education analysts in analyzing MOOC data via interactive visualization. Existing literature on MOOC visualization focuses on enabling visual analysis on MOOC data from forum and course material. We found limited studies that investigate and characterize domain problems or design requirements of visual analytics for MOOC. This paper aims to present the empirical problem characterization and abstraction for visual analytics in MOOC learner's support monitoring. Detailed characterization and abstraction of the domain problem help visualization designer to derive design requirements in generating appropriate visualization solution. We examined the literature and conducted a case study to elicit a problem abstraction based on data, users, and tasks. We interviewed five Malaysian MOOC experts from three higher education institutes using semi-structured questions. Our case study reveals the priority of enabling MOOC analysis on learner's progression and course completion. There is an association between design and analysis priority with the pedagogical type of implemented MOOC and users. The characterized domain problems and requirements offer a design foundation for visual analytics in MOOC monitoring analysis.","authors":["Mohammad Fadhli Asli","Muzaffar Hamzah","Ag Asri Ag Ibrahim","Enna Ayub"],"meta":["December 2020Heliyon 6(12):e05733","DOI:10.1016/j.heliyon.2020.e05733"],"references":["328077627_ViSeq_Visual_Analytics_of_Learning_Sequence_in_Massive_Open_Online_Courses","328011098_An_Exploratory_Study_of_a_Framework_for_Designing_and_Developing_a_Massive_Online_Course_as_Smart_Future_Classroom_in_VLE","324443586_MessageLens_A_Visual_Analytics_System_to_Support_Multifaceted_Exploration_of_MOOC_Forum_Discussions","335869349_MOOC_instructor_designs_and_challenges_what_can_be_learned_from_existing_MOOCs_in_Indonesia_and_Malaysia","327132166_RetainVis_Visual_Analytics_with_Interpretable_and_Interactive_Recurrent_Neural_Networks_on_Electronic_Medical_Records","326309045_CFGExplorer_Designing_a_Visual_Control_Flow_Analytics_System_around_Basic_Program_Analysis_Operations","324133835_Visual_learning_analytics_of_educational_data_A_systematic_literature_review_and_research_agenda","319133069_Review_of_Research_on_Student-Facing_Learning_Analytics_Dashboards_and_Educational_Recommender_Systems","315908074_Anomaly_Detection_for_Road_Traffic_A_Visual_Analytics_Framework","308546724_VisMOOC_Visualizing_video_clickstream_data_from_Massive_Open_Online_Courses"]}