{"id":"348137582_COVID-ResNet_A_Deep_Learning_Framework_for_Screening_of_COVID19_from_Radiographs","abstract":"In the last few months, the novel COVID-19\npandemic has spread all over the world. Due to its easy\ntransmission, developing techniques to accurately and easily\nidentify the presence of COVID-19 and distinguish it from other\nforms of flus and pneumonia is crucial. Recent research has\nshown that the chest X-rays of patients suffering from COVID19 depicts certain abnormalities in the radiography. However,\nthose approaches are closed source and not made available to\nthe research community for re-producibility and gaining a\ndeeper insight. The goal of this work is to build open source and\nopen access datasets and present an accurate Convolutional\nNeural Network framework for differentiating COVID-19 cases\nfrom other pneumonia cases. Our work utilizes state of the art\ntraining techniques including progressive resizing, cyclical\nlearning rate finding and discriminative learning rates to\ntraining fast and accurate residual neural networks. Using\nthese techniques, we showed state of the art results on the open\naccess COVID-19 dataset. This work presents a 3-step\ntechnique to fine-tune a pre-trained ResNet-50 architecture to\nimprove model performance and reduce training time – we call\nit COVID-ResNet. This is achieved through progressively resizing of input images to 128x128x3, 224x224x3, and\n229x229x3 pixels and fine-tuning the network at each stage.\nThis approach along with the automatic learning rate selection\nenabled us to achieve state of the accuracy of 96.23% (on all\nthe classes) on the COVIDx dataset with only 41 epochs. This\nwork presented a computationally efficient and highly accurate\nmodel for multi-class classification of three different infection\ntypes from along with Normal individuals. This model can help\nin early screening of COVID-19 cases and help reduce burden\non healthcare systems.","authors":["Abdul Hafeez"],"meta":["March 2020","Project: Accelerated covid-19 disease detection from Chest X-rays"],"references":[]}