{"id":"348111870_Interdisciplinarity_of_Information_Science_Research_Introduction","abstract":"Purpose/Thesis: The article aims to present and discuss some introductory reflections on the nature of interdisciplinarity of research conducted in the field of information science and its effect on the reorganization of the institutional setting of the discipline.Approach/Methods: This is a conceptual review article based on theoretical considerations and critical analysis of the concept of interdisciplinarity and the features of interdisciplinary approaches employed in information science research and its effect on the position of information science in university structure.Results and Conclusions: The concept of interdisciplinarity is discussed with reference to two aspects of the development of science: specialization and integration. The article presents selected typologies of interdisciplinarity and discusses the changes in the perception of the concept of discipline. Interdisciplinarity has been discussed as an inherent feature of information science. The types of interdisciplinarity that best correspond to the specificity of the interdisciplinary approach used in information science research has been indicated. Referring to previous studies, the article sketches the most characteristic interdisciplinary connections of information science. In general, the review shows that apart from the permanent relationship with social sciences, in particular with library science and computer science, the relationships between information science and other disciplines are variable and quite loose. Stronger relationships are most often generated through practical activity in related disciplines, in which specialized information services are the most developed and widely used.Originality/Value: The view that information science is by its very nature an interdisciplinary field of research is common among information researchers and information professionals. Much research has been done on the interdisciplinary connections of the discipline, however, by the best author’s knowledge, few of them analyzed the specificity of interdisciplinarity of this field of research. This article attempts to initiate an in-depth discussion on this issue.","authors":["Barbara Sosińska-Kalata"],"meta":["November 2020Zagadnienia Informacji Naukowej - Studia Informacyjne 58(1A(115A)):9-23","DOI:10.36702/zin.721"],"references":["338800924_Analysis_of_the_Thematic_Overlap_Between_Library_and_Information_Science_and_Other_Subdisciplines_of_the_Social_Communication_and_Media_Sciences_in_Poland","311751207_Interdisciplinarity_and_the_21st_century_research-intensive_university","262877206_Modes_of_Growth_of_Subjects","349860890_Interdisciplinarity","348111873_Digital_Libraries_and_the_Breakthrough_in_Linguistic_Chronologization_Application_of_Digitization_in_Linguistics","326005677_Examining_interdisciplinarity_of_library_and_information_science_LIS_based_on_LIS_articles_contributed_by_non-LIS_authors","317545747_Liberating_Interdisciplinarity_From_Myth_An_Exploration_of_the_Discursive_Construction_of_Identities_in_Information_Studies","314939796_The_Needs_of_Interdisciplinary_Research","296784803_The_invisible_substrate_of_information_science","280895340_Visualizing_a_discipline_An_author_co-citation_analysis_of_information_science_1972-1995","233541026_Turning_weakness_into_strength_Strategies_for_future_LIS","242485464_Prolegomena_to_Library_Classification","235291777_Information_Science_An_Interdisciplinary_Effort","229797155_Information_Science_What_Is_It","227733078_A_bibliometric_chronicling_of_Library_and_Information_Science's_first_hundred_years"]}