{"id":"348136699_A_Fundamental_Study_for_Gamification_Design_Exploring_Learning_Tendencies'_Effects","abstract":"In this paper, we present the fundamental concepts, design, and preliminary findings of a personalized gamification project in the educational context. The project aims to create a balanced, gamified learning environment in which all learners are equally engaged and interested. However, finding the balance between heterogenic learners’ traits and the variety of gamification design elements is a challenging, multistep process. Therefore, this paper presents the first steps towards the design of a balanced gamified environment, in which we a) proposed the Personalized Gamification Design Model (PeGaM) to assist gamification designers in applying a learner-center approach to gamification; b) explored learners’ learning tendencies as personalization criteria and applied PeGaM in the e-learning course, and c) conducted the exploratory study with 124 students to investigate behavioral differences in and between students in the control and treatment group. The study revealed a positive influence of badges, leaderboards, and experience points on learners with reflective, global, visual, and intuitive learning tendencies, and negative on students with sensing learning tendencies. Hence, this study supported the idea of introducing learning tendencies in the gamification design process and indicates the need for further research in this direction.","authors":["Nadja Zaric","Vlatko Lukarov","Ulrik Schroeder"],"meta":["December 2020International Journal of Serious Games 7(4):3-25","DOI:10.17083/ijsg.v7i4.356"],"references":["334480974_ILSA_-_AN_INTEGRATED_LEARNING_STYLES_ANALYTICS_SYSTEM","334480768_A_Taxonomy_of_Game_Elements_for_Gamification_in_Educational_Contexts_Proposal_and_Evaluation","331107754_Exploring_Factors_and_Indicators_for_Measuring_Students'_Sustainable_Engagement_in_e-Learning","322288130_A_Design_Framework_for_Adaptive_Gamification_Applications","319472798_Identifying_Game_Elements_Suitable_for_MOOCs","311317334_LEGA_A_LEarner-centered_GAmification_Design_Framework","311760890_Stop_propagating_the_learning_styles_myth","311093965_Individualising_gamification_An_investigation_of_the_impact_of_learning_styles_and_personality_traits_on_the_efficacy_of_gamification_using_a_prediction_market","301232345_Teaching_and_Learning_STEM_A_Practical_Guide","301212086_A_RECIPE_for_Meaningful_Gamification"]}