{"id":"348297507_SOCIAL_NETWORKS_FOR_THE_DISSEMINATION_OF_RESEARCH_PROJECTS_THE_CASE_OF_KIDS_MEDIA_LAB_2","abstract":"The Kids Media Lab 2 (KML2) project: Laboratory of Technologies and Learning Programming for Preschool and Primary School (https://www.nonio.uminho.pt/kml2/sobre/), which is being developed since 2018, always with new future perspectives thanks to its sustainability as a research, which is foreseen until the end of 2021, with possible extension due to the interest of its participants and followers. We have explored social networks to support the dissemination of our research projects and the creation of communities of practice. Thanks to the information we have conveyed on the various social networks we use, it is possible to understand that they are an important support for maintaining the presence of our activities and disseminating our research results frequently. The KML2 project is the continuation of the Kids Media Lab project (https://www.kidsmedialab.pt), which was developed between 2015-2019. Despite using various social networks in our KML 2 project we decided to focus on the interactions that have been generated on Facebook (https://www.facebook.com/KML2PrePri). We use the social network Facebook with short news of our work and this same news is spread in the social networks of the project, adapted to its different formats, such as, full news in the blog, short news in twitter and videos in YouTube. Our interest as researchers is to take advantage of the best of these applications according to the research projects we develop, with the main objective of disseminating and generating impact on the scientific community.","authors":["Maribel Santos Miranda Pinto","Pilar Ibáñez-Cubillas","António José Osório"],"meta":["November 2020","DOI:10.21125/iceri.2020.1242","Conference: ICERI2020 ProceedingsAt: Sevilha-Spain","Project: KML II - Laboratório de Tecnologias e Aprendizagem de Programação para o Pré-Escolar e 1.º Ciclo de Ensino Básico em Portugal"],"references":["341983923_Influenciadores_digitais_conceitos_e_praticas_em_discussao","339601915_Chatbots_for_learning_A_review_of_educational_chatbots_for_the_Facebook_Messenger","334772589_Una_exploracion_del_e-liderazgo_en_comunidades_virtuales_de_practica","282039612_The_Laugh_Model_Reframing_and_Rebranding_Public_Health_Through_Social_Media","270120772_The_Net_on_Teaching_Processes_at_the_University","339342232_El_impacto_de_las_redes_sociales_en_la_administracion_de_las_empresas","256490757_Exploring_the_Use_of_a_Facebook_Page_in_Anatomy_Education","24114032_What_Is_Web_20_Design_Patterns_And_Business_Models_For_The_Next_Generation_Of_Software"]}