{"id":"348292193_Measuring_Diversity_in_Heterogeneous_Information_Networks","abstract":"Diversity is a concept relevant to numerous domains of research varying from ecology, to information theory, and to economics, to cite a few. It is a notion that is steadily gaining attention in the information retrieval, network analysis, and artificial neural networks communities. While the use of diversity measures in network-structured data counts a growing number of applications, no clear and comprehensive description is available for the different ways in which diversities can be measured. In this article, we develop a formal framework for the application of a large family of diversity measures to heterogeneous information networks (HINs), a flexible, widely-used network data formalism. This extends the application of diversity measures, from systems of classifications and apportionments, to more complex relations that can be better modeled by networks. In doing so, we not only provide an effective organization of multiple practices from different domains, but also unearth new observables in systems modeled by heterogeneous information networks. We illustrate the pertinence of our approach by developing different applications related to various domains concerned by both diversity and networks. In particular, we illustrate the usefulness of these new proposed observables in the domains of recommender systems and social media studies, among other fields.","authors":["Pedro Ramaciotti Morales","Robin Lamarche-Perrin","Raphaël Fournier-S'niehotta","Rémy Poulain"],"meta":["January 2021Theoretical Computer Science 859(6783)","DOI:10.1016/j.tcs.2021.01.013"],"references":["349050712_Exploring_author_gender_in_book_rating_and_recommendation","328705415_The_geographic_embedding_of_online_echo_chambers_Evidence_from_the_Brexit_campaign","327761579_Reconstruction_of_the_socio-semantic_dynamics_of_political_activist_Twitter_networks-Method_and_application_to_the_2017_French_presidential_election","326312847_Ecological_Diversity_Measuring_the_Unmeasurable","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","339603530_Investigating_the_lack_of_diversity_in_user_behavior_The_case_of_musical_content_on_online_platforms","335874507_Role_of_the_Website_Structure_in_the_Diversity_of_Browsing_Behaviors","333239462_User_preference_modeling_based_on_meta_paths_and_diversity_regularization_in_heterogeneous_information_networks","331658071_SHNE_Representation_Learning_for_Semantic-Associated_Heterogeneous_Networks","329977634_Heterogeneous_Networks_and_Their_Applications_Scientometrics_Name_Disambiguation_and_Topic_Modeling"]}