{"id":"348202414_Applying_Artificial_Intelligence_in_Physical_Education_and_Future_Perspectives","abstract":"Artificial intelligence (AI) is gradually influencing every aspect of everyday life, including education. AI can also provide special support to learners through academic sustainability or discontinuation predictions. While AI research remains in its early stages, we must examine how it evolves and exerts its potential over time. By utilizing AI in physical education (PE), we can increase its potential use in sports applications, and enact changes upon the nature of PE, its visualization, and repeatability. Based on the concept of AI and related research areas, this study explores its principles and use in PE, and presents a focused, in-depth analysis of the areas of PE technology where AI could be applied—customized PE classes, knowledge provision, learner evaluation, and learner counseling methods. Our findings highlight the expertise required for future PE teachers in applying AI. Regarding practice implications, this study addresses the topic of AI innovations affecting all life domains, including PE; it highlights AI applications’ relevance to PE technology, based on existing research; it proposes that the implications of AI for PE may apply to other educational domains; and finally, it contributes to existing literature and also shares future research prospects regarding AI applications in education and sports.","authors":["Hyun Suk Lee","Junga Lee"],"meta":["January 2021Sustainability 13(1):351","DOI:10.3390/su13010351"],"references":["342987506_The_Effect_of_T-Ball_Class_on_Physical_Self-Efficacy_of_Elementary_School_Students_Using_Virtual_Reality_TechnologyVR","342110807_Implementation_of_New_Ways_of_Artificial_Intelligence_in_Sports","335575740_Analysis_of_Artificial_Intelligence_AI_Application_in_Sports","332704741_Artificial_Intelligence_in_Education_Current_Insights_and_Future_Perspectives","340433595_Natural_Language_Processing","326483025_Artificial_Intelligence_Psychotherapy_in_Buddhist_Perspective","325110058_The_Roles_Of_Artificial_Intelligence_In_Education_Current_Progress_And_Future_Prospects","324296513_Principles_of_Artificial_Intelligence","324183016_Customized_Curriculum_Operation_for_Student_Sports_Players_of_School_Athletic_Clubs","322823756_A_Study_on_Development_Deep_Learning_Based_Learning_System_for_Enhancing_the_Data_Analytical_Thinking"]}