{"id":"348202506_Adaptive_Network_Automata_Modelling_of_Complex_Networks","abstract":"Many complex networks have a connectivity that might be only partially detected or that tends to grow over time, hence the prediction of non-observed links is a fundamental problem in network science. The aim of topological link prediction is to forecast these non-observed links by only exploiting features intrinsic to the network topology. It has a wide range of real applications, like suggesting friendships in social networks or predicting interactions in biological networks.The Cannistraci-Hebb theory is a recent achievement in network science that includes a theoretical framework to understand local-based link prediction on paths of length n. In this study we introduce two innovations: theory of modelling (science) and theory of realization (engineering). For the theory of modelling we first recall a definition of network automata as a general framework for modelling the growth of connectivity in complex networks. We then show that several deterministic models previously developed fall within this framework and we introduce novel network automata following the Cannistraci-Hebb rule. For the theory of realization, we present how to build adaptive network automata for link prediction, which incorporate multiple deterministic models of self-organization and automatically choose the rule that better explains the patterns of connectivity in the network under investigation. We compare Cannistraci-Hebb adaptive (CHA) network automaton against state-of-the-art link prediction methods such as structural perturbation method (SPM), stochastic block models (SBM) and artificial intelligence algorithms for graph embedding. CHA displays an overall higher link prediction performance across different evaluation frameworks on 1386 networks. Finally, we highlight that CHA offers the key advantage to explicitly explain the mechanistic rule of self-organization which leads to the link prediction performance, whereas SPM and graph embedding not. In comparison to CHA, SBM unfortunately shows irrelevant and unsatisfactory performance demonstrating that SBM modelling is not adequate for link prediction in real networks.","authors":["Alessandro Muscoloni","Umberto Michieli","Carlo Vittorio Cannistraci"],"meta":["December 2020","DOI:10.20944/preprints202012.0808.v1"],"references":["334844418_ProNE_Fast_and_Scalable_Network_Representation_Learning","331881488_Network-based_prediction_of_protein_interactions","328514617_Modelling_Self-Organization_in_Complex_Networks_Via_a_Brain-Inspired_Network_Automata_Theory_Improves_Link_Reliability_in_Protein_Interactomes","319385925_Can_local-community-paradigm_and_epitopological_learning_enhance_our_understanding_of_how_local_brain_connectivity_is_able_to_process_learn_and_memorize_chronic_pain","315695269_Mutual_information_model_for_link_prediction_in_heterogeneous_complex_networks","347308455_Experimental_analyses_on_2-hop-based_and_3-hop-based_link_prediction_algorithms","333060540_NetSMF_Large-Scale_Network_Embedding_as_Sparse_Matrix_Factorization","323880501_Network-based_prediction_of_protein_interactions","317087784_On_the_consistency_between_model_selection_and_link_prediction_in_networks","316595706_Pioneering_topological_methods_for_network-based_drug-target_prediction_by_exploiting_a_brain-network_self-organization_theory"]}