{"id":"348240643_Towards_Global_Stability_Analysis_of_Flexible_Aircraft_in_Edge-of-the-Envelope_Flow","abstract":"Shock buffet on wings is a phenomenon caused by strong shock-wave/boundary-layer interaction resulting first in self-sustained flow unsteadiness and eventually in a detrimental structural response called buffeting. While it is an important aspect of aircraft design and certification, particularly for modern transonic air transport, not all of the underlying multidisciplinary physics are thoroughly understood - yet very little work has been done in that direction on practical aircraft cases. This work builds upon the triglobal shock-buffet stability study by Timme (2020) while aiming to investigate the impact of a flexible wing structure in these extreme flow conditions. The implementation of the coupled Jacobian matrix in an industrial solver enables the first triglobal stability analysis of a fluid-structure coupled system, utilising the implicitly restarted Arnoldi method with a sparse iterative Krylov solver and novel preconditioner. The chosen test case is the NASA Common Research Model for which both fluid modes on the rigid (yet statically deformed) wing and modes describing the dynamic aeroelastic behaviour (computed from a standard flutter analysis) guide the process. First, geometric asymmetry resulting from a static aeroelastic simulation based on a finite-element model of the wind-tunnel geometry modifies the global modes of the previous fluid-only symmetric full-span analysis. Second, flutter stability analysis at wind-tunnel flow conditions below shock-buffet onset finds no instability in the structural degrees of freedom, whereas in shock-buffet flow with globally unstable fluid modes additional marginally unstable structural (and fluid) modes are identified. Third, the coupled triglobal stability tool is indeed instrumental in identifying those physically dominant modes where a standard pk-type analysis fails. Together with our companion paper (Belesiotis-Kataras & Timme 2021) we contribute to the question on how the presence of the flexible wing structure impacts on the otherwise pure aerodynamic three-dimensional shock-buffet dynamics.","authors":["Jelle Houtman","Sebastian Timme"],"meta":["January 2021","DOI:10.2514/6.2021-0610","Conference: AIAA Scitech 2021 Forum"],"references":["342017047_Resolvent_Analysis_of_Shock_Buffet_on_Infinite_Wings","338445786_Global_instability_of_wing_shock-buffet_onset","336784514_Global_instability_in_the_onset_of_transonic-wing_buffet","336699650_Transonic_buffet_instability_From_two-dimensional_airfoils_to_three-dimensional_swept_wings","333995308_Fluid-mode_flutter_in_plane_transonic_flows","348244532_Aeroelastic_Coupling_Effects_in_Globally_Unstable_Transonic_Wing_Flow","338398914_Triglobal_Shock_Buffet_Instability_Study_on_Infinite_Wings","337716817_Analysis_of_a_civil_aircraft_wing_transonic_shock_buffet_experiment","336105214_Towards_Higher-Precision_Maneuver_and_Gust_Loads_Computations_of_Aircraft_Status_of_Related_Features_in_the_CFD-Based_Multidisciplinary_Simulation_Environment_FlowSimulator","331032558_Flexible_aircraft_gust_encounter_simulation_using_subspace_projection_model_reduction"]}