{"id":"348289948_Decision_Support_for_Potato_Growers_using_a_Pest_Monitoring_Network","abstract":"Pest monitoring networks form the foundation of many integrated pest management programs in agroecosystems throughout the world. These monitoring networks tend to focus on widely dispersed and highly variable insect pest populations that can cause significant crop loss without intervention. By assessing the distribution and abundance of insects over growing seasons, pest monitoring networks help growers anticipate problems and use proactive rather than reactive management tactics; this promotes timely decision making that usually leads to more effective and cost-efficient pest management. There are several key considerations for developing and operating a successful pest monitoring network: (1) they can be costly and require a regular funding source; (2) the monitoring methods must be appropriate for the pest and adequately distributed (spatially and temporally) to locate infestations; (3) the monitoring data must be provided through timely communications that can be easily accessed by growers or other decision makers; (4) monitoring results should be explained so they can be easily interpreted; and (5) communications should include recommendations for next steps, such as guidance in identifying and scouting for the pest, cultural management approaches, and appropriate use of chemical controls. In this paper, we relate our experiences operating an insect pest monitoring network in potato crops grown in the Columbia Basin of Washington in the United States. We discuss our efforts to fund the program, operate more effectively, and continually improve the content of our communications.","authors":["Carrie H. Wohleb","Timothy D. Waters","David W. Crowder"],"meta":["January 2021American Journal of Potato Research 98(3)","DOI:10.1007/s12230-020-09813-0"],"references":["330976354_The_Weed_Link_in_Zebra_Chip_Epidemiology_Suitability_of_Non-crop_Solanaceae_and_Convolvulaceae_to_Potato_Psyllid_and_Candidatus_Liberibacter_Solanacearum","320505294_Phenology_of_the_Potato_Psyllid_Bactericera_cockerelli_Hemiptera_Triozidae_and_Candidatus_Liberibacter_solanacearum_in_Commercial_Potato_Fields_in_Idaho","258629944_First_Report_of_Zebra_Chip_Disease_and_Candidatus_Liberibacter_solanacearum_on_Potatoes_in_Oregon_and_Washington_State","322648441_Economic_Impacts_of_Zebra_Chip_in_Idaho_Oregon_and_Washington","316143898_Association_of_Potato_Psyllid_Bactericera_cockerelli_Hemiptera_Triozidae_with_Lycium_spp_Solanaceae_in_Potato_Growing_Regions_of_Washington_Idaho_and_Oregon","303832281_Seasonal_Population_Dynamics_of_Three_Potato_Pests_in_Washington_State","287851594_Aphid_alert_How_it_came_to_be_what_it_achieved_and_why_it_proved_unsustainable","270779286_First_Report_of_Zebra_Chip_Disease_and_Candidatus_Liberibacter_solanacearum_on_Potatoes_in_Idaho","267236680_General_Introduction_to_Areawide_Pest_Management","257776664_Zebra_Chip_Disease_of_Potato_Biology_Epidemiology_and_Management"]}