{"id":"348210671_The_Social_and_Psychological_Changes_of_the_First_Months_of_COVID-19","abstract":"The initial wave of the COVID-19 pandemic disrupted the lives of people across the globe. The current research sought to understand how the pandemic affected people’s social and psychological states during the first three months after the first U.S. death was reported. How did people’s emotions, thought patterns, and social lives change as the pandemic unfolded? The Reddit language of 200,000+ people across 18 cities in the U.S. was analyzed along with surveys from 11,000+ people in the U.S. and Canada. Overall, large psychological shifts were found that reflected three distinct phases. As the first COVID warnings emerged but prior to the shelter-in-place directives, people’s attentional focus switched to the impending threat. Anxiety levels surged, and positive emotion and anger dropped. In parallel, people’s thinking became more immediate and intuitive rather than analytic. When cities began lockdowns, anxiety levels spiked and sadness increased, and language shifted in ways that revealed people’s attempts to make sense of the situation. Six weeks after the onset, people’s psychological states stabilized but the COVID-produced changes had not abated. Converging evidence from survey responses and natural language analysis indicated that people’s ties with family strengthened but that social ties to broader groups (friends, city, and country) weakened. The psychological shifts were amplified on days when the country’s and cities’ COVID infection growth rates were higher, marking the link between the pandemic and the observed psychological patterns. Together, the study underscores the large psychological impacts across the country during the first three months of the crisis.","authors":["Ashwini Ashokkumar","James W. Pennebaker"],"meta":["January 2021","DOI:10.31234/osf.io/a34qp"],"references":["345221437_Partisan_differences_in_physical_distancing_are_linked_to_health_outcomes_during_the_COVID-19_pandemic","342761793_Tracking_Mental_Health_and_Symptom_Mentions_on_Twitter_During_COVID-19","341050215_Using_social_and_behavioural_science_to_support_COVID-19_pandemic_response","340162894_Using_social_and_behavioural_science_to_support_COVID-19_pandemic_response","334685423_This_is_not_a_drill_Anxiety_on_Twitter_following_the_2018_Hawaii_false_missile_alert","331722204_Collective_Emotions_and_Social_Resilience_in_the_Digital_Traces_After_a_Terrorist_Attack","329435414_Early_Linguistic_Markers_of_Trauma-Specific_Processing_Predict_Post-trauma_Adjustment","341376928_Catastrophe_Compassion_Understanding_and_Extending_Prosociality_Under_Crisis","339751506_Trump_claims_public_health_warnings_on_covid-19_are_a_conspiracy_against_him","331025340_Examining_long-term_trends_in_politics_and_culture_through_language_of_political_leaders_and_cultural_institutions"]}