{"id":"348285631_Risk_mapping_for_COVID-19_outbreaks_in_Australia_using_mobility_data","abstract":"COVID-19 is highly transmissible and containing outbreaks requires a rapid and effective response. Because infection may be spread by people who are pre-symptomatic or asymptomatic, substantial undetected transmission is likely to occur before clinical cases are diagnosed. Thus, when outbreaks occur there is a need to anticipate which populations and locations are at heightened risk of exposure. In this work, we evaluate the utility of aggregate human mobility data for estimating the geographical distribution of transmission risk. We present a simple procedure for producing spatial transmission risk assessments from near-real-time population mobility data. We validate our estimates against three well-documented COVID-19 outbreaks in Australia. Two of these were well-defined transmission clusters and one was a community transmission scenario. Our results indicate that mobility data can be a good predictor of geographical patterns of exposure risk from transmission centres, particularly in outbreaks involving workplaces or other environments associated with habitual travel patterns. For community transmission scenarios, our results demonstrate that mobility data add the most value to risk predictions when case counts are low and spatially clustered. Our method could assist health systems in the allocation of testing resources, and potentially guide the implementation of geographically targeted restrictions on movement and social interaction.","authors":["Cameron Zachreson","Lewis Mitchell","Michael J. Lydeamore","Nicolas Rebuli"],"meta":["January 2021Journal of The Royal Society Interface 18(174):20200657","DOI:10.1098/rsif.2020.0657"],"references":["346521549_Modelling_transmission_and_control_of_the_COVID-19_pandemic_in_Australia","342776487_COVID-19_outbreak_response_a_dataset_to_assess_mobility_changes_in_Italy_following_national_lockdown","342291826_Economic_and_social_consequences_of_human_mobility_restrictions_under_COVID-19","342137233_Interregional_SARS-CoV-2_spread_from_a_single_introduction_outbreak_in_a_meat-packing_plant_in_northeast_Iowa","341662436_Social_Distancing_as_a_Health_Behavior_County-level_Movement_in_the_United_States_During_the_COVID-19_Pandemic_is_Associated_with_Conventional_Health_Behaviors","341270215_Infection_fatality_rate_of_SARS-CoV-2_infection_in_a_German_community_with_a_super-spreading_event","341699522_Interdependence_and_the_Cost_of_Uncoordinated_Responses_to_COVID-19","341689297_Association_of_Stay-at-Home_Orders_with_COVID-19_Hospitalizations_in_4_States","341438813_Job_Loss_and_Behavioral_Change_The_Unprecedented_Effects_of_the_India_Lockdown_in_Delhi","341332171_High_SARS-CoV-2_Attack_Rate_Following_Exposure_at_a_Choir_Practice_-_Skagit_County_Washington_March_2020"]}