{"id":"348390142_Denny-Brown_and_Pennybacker_80_years_after_their_pioneering_article_on_electromyography_fibrillation_and_fasciculation","abstract":"We present a historical review, highlighting the role of Professor Derek Denny-Brown and doctor Joseph Buford Pennybacker in the development of current electromyography (EMG), of the 80 years since the publication of his original report in 1938 on fasciculation and fibrillation potentials and the subsequent studies describing most of the electrical changes necessary to perform and interpret the EMG. RESUMO Os autores apresentam uma revisão histórica destacando o papel do Professor Derek Denny-Brown e do doutor Joseph Buford Pennybacker no desenvolvimento da eletromiografia atual, ao longo dos oitenta anos de seu artigo original em 1938, sobre potenciais de fasciculação e fibrilação, e os estudos subsequentes que descreveram a maioria das mudanças elétricas necessárias para realizar e interpretar EMG. Palavras-chave: Eletromiografia; Doenças Neuromusculares. Denny-Brown and Pennybacker: 80 years after their pioneering article on electromyography, fibrillation and fasciculation Denny-Brown e Pennybacker: 80 anos da publicação de seu artigo pioneiro sobre eletromiografia, fibrilação e fasciculação Centuries of research and development of concepts of mathematics, physics, electricity, physiology, among other sciences, were needed to allow neurologists to understand and establish some important concepts of electromyography (EMG). One of the most important was recognizing fibril-lation and fasciculation potentials, which were described in the pioneering article published by Denny-Brown and Pennybacker 1. On the 80 th anniversary of their original publication , in the era of computer science and communication, these concepts are still useful in EMG analysis. In 1938, a pioneering study performed the electromyo-graphic record of involuntary muscle potentials, named fas-ciculation and fibrillation 1. This study was published in Brain 1 , describing most of the electrical changes necessary to perform and interpret these potentials in the EMG. In the following years, Denny-Brown published other studies that also helped interpret these potentials. However, he did not advocate EMG as a separate entity and considered it part of the neurological examination. The development of EMG into a diagnostic clinical subspecialty occurred over the years following the extensive studies of many patients by a number of investigators.","authors":["Otto Jesus Hernandez Fustes","Cláudia Suemi Kamoi Kay","Paulo J Lorenzoni","Renata Dal Pra Ducci"],"meta":["January 2021Arquivos de Neuro-psiquiatria 79(1):1-3","DOI:10.1590/0004-282X20200113","Project: History of Neurology"],"references":["317642229_History_of_electromyography_and_nerve_conduction_studies_A_tribute_to_the_founding_fathers","247575564_Fibrillation_and_fasciculation_in_voluntary_muscle","18878814_Spontaneous_and_voluntary_electrical_activity_in_neuromuscular_disorders","16436158_Spontaneous_electrical_activity_An_overview","11811601_The_motor_unit_and_electromyography_-_The_legacy_of_Derek_Denny-Brown","10641894_Derek_Ernest_Denny-Brown_19011981","10462168_Clinical_problems_in_neuromuscular_physiology","6800571_The_Discharge_of_Impulses_in_Motor_Nerve_Fibers_Part_II_The_Frequency_of_Discharge_in_Reflex_and_Voluntary_Contractions"]}