{"id":"348326544_A_classification_of_community_detection_methods_in_social_networks_A_survey","abstract":"The detection of community structures is a crucial research area. The problem of community detection has received considerable attention from a large portion of the scientific community and a very large number of papers has already been published in the literature. Even more important is the fact that, this large number of articles is in fact spread across a large number of different disciplines, from computer science, to statistics, and social sciences. These facts necessitate some type of classification and organization of these works. In this work, our basic classification approach divides the community detection schemes into three basic approaches: (a) the bottom-up approaches that use the local structures and try to expand them to form communities, (b) the top-down approaches, which start from the graph representing the entire network and try to divide it into communities, and (c) the data structure based approaches, which try to convert social networks to existing data structures, in order to facilitate processing. The first category includes the majority of algorithms, so further classification is possible. Such a classification is included in this work. For the other two categories, we make no further categorizations but we simply focus our discussion on the metrics or the data structures being used. Finally, a few possible directions for future research are also suggested.","authors":["Stavros Souravlas","Angelo Sifaleras","M Tsintogianni","Stefanos Katsavounis"],"meta":["January 2021International Journal of General Systems 50(1):63-91","DOI:10.1080/03081079.2020.1863394"],"references":["340066635_Hybrid_CPU-GPU_community_detection_in_weighted_networks","330938409_A_Parallel_Algorithm_for_Community_Detection_in_Social_Networks_Based_on_Path_Analysis_and_Threaded_Binary_Trees","330632411_Application_Areas_of_Community_Detection_A_Review","328846951_A_Novel_Interdisciplinary_Approach_for_Community_Detection_Based_on_Remote_File_Requests","327333221_Research_Review_on_Algorithms_of_Community_Detection_in_Complex_Networks","343925136_Community_structure_extraction_in_directed_network_using_triads","333115533_A_Comparative_Analysis_of_Community_Detection_Algorithms_on_Artificial_Networks","333072538_Community_Detection_through_Likelihood_Optimization_In_Search_of_a_Sound_Model","329076312_A_Link-Based_Similarity_for_Improving_Community_Detection_Based_on_Label_Propagation_Algorithm","325480303_Optimized_Label_Propagation_Community_Detection_on_Big_Data_Networks"]}