{"id":"348348102_Open_science_and_artificial_intelligence_supporting_blue_growth","abstract":"The long-term EU strategy to support the sustainable growth of the marine and maritime sectors (Blue Growth) involves economic and ecological topics that call for new computer science systems to produce new knowledge after processing large amounts of data (Big Data), collected both at academic and industrial levels. Today, Artificial Intelligence (AI) can satisfy the Blue Growth strategy requirements by managing Big Data, but requires effective multidisciplinary interaction between scientists. In this context, new Science paradigms, like Open Science, are born to promote the creation of computational systems to process Big Data while supporting collaborative experimentation, multi-disciplinarity, and the re-use, repetition, and reproduction of experiments and results. AI can use Open Science systems by making domain and data experts cooperate both between them and with AI modellers. In this paper, we present examples of combined AI and Open Science-oriented applications in marine science. We explain the direct benefits these bring to the Blue Growth strategy and the indirect advantages deriving from their re-use in other applications than their originally intended ones.","authors":["Gianpaolo Coro"],"meta":["October 2020Environmental Engineering and Management Journal 19(10):1719-1729"],"references":["337947230_Quantifying_Coral_Reef_Composition_of_Recreational_Diving_Sites_A_Structure_from_Motion_Approach_at_Seascape_Scale","334462934_A_new_narrative_for_the_Blue_Economy_and_Blue_Carbon","333503072_Enacting_open_science_by_D4Science","328619320_The_gCube_system_Delivering_Virtual_Research_Environments_as-a-Service","327762671_A_multiscale_statistical_method_to_identify_potential_areas_of_hyporheic_exchange_for_river_restoration_planning","327063517_Stirring_the_strategic_direction_of_scuba_diving_marine_Citizen_Science_A_survey_of_active_and_potential_participants","326317729_A_new_approach_for_estimating_stock_status_from_length_frequency_data","325776045_A_VR_game_to_teach_underwater_sustainability_while_diving","324794402_Status_and_rebuilding_of_European_fisheries","325581523_Digital_Open_Annotation_with_Hypothesis_Supplying_the_Missing_Capability_of_the_Web"]}