{"id":"348315789_A_Clustering_Approach_Towards_Cross-Project_Technical_Debt_Forecasting","abstract":"Technical debt (TD) describes quality compromises that can yield short-term benefits but may negatively affect the quality of software products in the long run. A wide range of tools and techniques have been introduced over the years in order for the developers to be able to determine and manage TD. However, being able to also predict its future evolution is of equal importance to avoid its accumulation, and, in turn, the unlikely event of making the project unmaintainable. Although recent research endeavors have showcased the feasibility of building accurate project-specific TD forecasting models, there is a gap in the field regarding cross-project TD forecasting. Cross-project TD forecasting is of practical importance, since it would enable the application of pre-existing forecasting models on previously unknown software projects, especially new projects that do not exhibit sufficient commit history to enable the construction of project-specific models. To this end, in the present paper, we focus on cross-project TD forecasting, and we examine whether the consideration of similarities between software projects could be the key for more accurate forecasting. More specifically, we propose an approach based on data clustering. In fact, a relatively large repository of software projects is divided into clusters of similar projects with respect to their TD aspects, and specific TD forecasting models are built for each cluster, using regression algorithms. According to our approach, previously unknown software projects are assigned to one of the defined clusters and the cluster-specific TD forecasting model is applied to predict future TD values. The approach was evaluated through several experiments based on real-world applications. The results of the analysis suggest that the proposed approach comprises a promising solution for accurate cross-project TD forecasting.","authors":["Dimitrios Tsoukalas","Maria Mathioudaki","Miltiadis Siavvas","Dionysios Kehagias"],"meta":["February 2021SN Computer Science 2(1)","DOI:10.1007/s42979-020-00408-4"],"references":["344374374_Technical_debt_as_an_indicator_of_software_security_risk_a_machine_learning_approach_for_software_development_enterprises_Technical_debt_as_an_indicator_of_software_security_risk_a_machine_learning_ap","336741194_On_the_Applicability_of_Time_Series_Models_for_Technical_Debt_Forecasting","334611807_The_Technical_Debt_Dataset","345781587_Cross-Project_Vulnerability_Prediction_Based_on_Software_Metrics_and_Deep_Learning","343535388_Technical_debt_forecasting_An_empirical_study_on_open-source_repositories","338639411_Sharing_Energy_for_Optimal_Edge_Performance","337795970_Investigating_Instability_Architectural_Smells_Evolution_An_Exploratory_Case_Study","336258977_Optimum_Interval_for_Application-level_Checkpoints","334259316_Optimum_Checkpoints_for_Programs_with_Loops","334167577_On_the_Application_of_Cross-Project_Validation_for_Predicting_Maintainability_of_Open_Source_Software_using_Machine_Learning_Techniques","333158846_Performance_Optimization_With_Energy_Packets","332984338_Methods_and_Tools_for_TD_Estimation_and_Forecasting_A_State-of-the-art_Survey","331055292_In-the-Field_Mitigation_of_Process_Variability_for_Improved_FPGA_Performance","331412547_Monitoring_Technical_Debt_in_an_Industrial_Setting","329208812_JCaliper_Search-Based_Technical_Debt_Management"]}