{"id":"348385022_Construction_and_integration_of_three_de_novo_Japanese_human_genome_assemblies_toward_a_population-specific_reference","abstract":"The complete human genome sequence is used as a reference for next-generation sequencing analyses. However, some ethnic ancestries are under-represented in the reference genome (e.g., GRCh37) due to its bias toward European and African ancestries. Here, we perform de novo assembly of three Japanese male genomes using > 100× Pacific Biosciences long reads and Bionano Genomics optical maps per sample. We integrate the genomes using the major allele for consensus and anchor the scaffolds using genetic and radiation hybrid maps to reconstruct each chromosome. The resulting genome sequence, JG1, is contiguous, accurate, and carries the Japanese major allele at most loci. We adopt JG1 as the reference for confirmatory exome re-analyses of seven rare-disease Japanese families and find that re-analysis using JG1 reduces total candidate variant calls versus GRCh37 while retaining disease-causing variants. These results suggest that integrating multiple genomes from a single population can aid genome analyses of that population. Human reference genomes are typically constructed from few individuals, and are biased towards European and African genomes. Here, the authors assemble three Japanese genomes to create a population-specific reference genome. They then demonstrate improved variant calling from exome sequencing with this reference genome.","authors":["Jun Takayama","Shu Tadaka","Kenji Yano","Fumiki Katsuoka"],"meta":["January 2021Nature Communications 12(1):226","DOI:10.1038/s41467-020-20146-8"],"references":["344677565_De_novo_assembly_of_a_Tibetan_genome_and_identification_of_novel_structural_variants_associated_with_high-altitude_adaptation","336854755_RaGOO_Fast_and_accurate_reference-guided_scaffolding_of_draft_genomes","334902338_Graph-based_genome_alignment_and_genotyping_with_HISAT2_and_HISAT-genotype","333847025_35KJPNv2_an_allele_frequency_panel_of_3552_Japanese_individuals_including_the_X_chromosome","331844282_Construction_of_JRG_Japanese_Reference_Genome_with_Single_Molecule_Real-Time_Sequencing","330368017_Fast_and_accurate_genomic_analyses_using_genome_graphs","329042446_Assembly_of_a_pan-genome_from_deep_sequencing_of_910_humans_of_African_descent","328539608_GENCODE_reference_annotation_for_the_human_and_mouse_genomes","328183958_De_Novo_Assembly_of_Two_Swedish_Genomes_Reveals_Missing_Segments_from_the_Human_GRCh38_Reference_and_Improves_Variant_Calling_of_Population-Scale_Sequencing_Data","330463747_Characterizing_the_Major_Structural_Variant_Alleles_of_the_Human_Genome"]}