{"id":"348384092_Automatic_Lung_Segmentation_on_Chest_X-rays_Using_Self-Attention_Deep_Neural_Network","abstract":"Accurate identification of the boundaries of organs or abnormal objects (e.g., tumors) in medical images is important in surgical planning and in the diagnosis and prognosis of diseases. In this study, we propose a deep learning-based method to segment lung areas in chest X-rays. The novel aspect of the proposed method is the self-attention module, where the outputs of the channel and spatial attention modules are combined to generate attention maps, with each highlighting those regions of feature maps that correspond to “what” and “where” to attend in the learning process, respectively. Thereafter, the attention maps are multiplied element-wise with the input feature map, and the intermediate results are added to the input feature map again for residual learning. Using X-ray images collected from public datasets for training and evaluation, we applied the proposed attention modules to U-Net for segmentation of lung areas and conducted experiments while changing the locations of the attention modules in the baseline network. The experimental results showed that our method achieved comparable or better performance than the existing medical image segmentation networks in terms of Dice score when the proposed attention modules were placed in lower layers of both the contracting and expanding paths of U-Net.","authors":["Minki Kim","Byoung-Dai Lee"],"meta":["January 2021Sensors 21(2):369","DOI:10.3390/s21020369"],"references":["338332372_International_evaluation_of_an_AI_system_for_breast_cancer_screening","324472010_Attention_U-Net_Learning_Where_to_Look_for_the_Pancreas","343466088_ECA-Net_Efficient_Channel_Attention_for_Deep_Convolutional_Neural_Networks","339559337_CCNet_Criss-Cross_Attention_for_Semantic_Segmentation","338512016_Dual_Attention_Network_for_Scene_Segmentation","332062855_Automatic_Cardiothoracic_Ratio_Calculation_With_Deep_Learning","329747450_Recurrent_Saliency_Transformation_Network_Incorporating_Multi-stage_Visual_Cues_for_Small_Organ_Segmentation","329740202_Squeeze-and-Excitation_Networks","328457997_Chest_X-Ray_Analysis_of_Tuberculosis_by_Deep_Learning_with_Segmentation_and_Augmentation","322059369_Focal_Loss_for_Dense_Object_Detection"]}