{"id":"348385316_New_Tools_for_the_Optimized_Follow-Up_of_Imminent_Impactors","abstract":"The solar system is populated with, other than planets, a wide variety of minor bodies, the majority of which are represented by asteroids. Most of their orbits are comprised of those between Mars and Jupiter, thus forming a population named Main Belt. However, some asteroids can run on trajectories that come close to, or even intersect, the orbit of the Earth. These objects are known as Near Earth Asteroids (NEAs) or Near Earth Objects (NEOs) and may entail a risk of collision with our planet. Predicting the occurrence of such collisions as early as possible is the task of Impact Monitoring (IM). Dedicated algorithms are in charge of orbit determination and risk assessment for any detected NEO, but their efficiency is limited in cases in which the object has been observed for a short period of time, as is the case with newly discovered asteroids and, more worryingly, imminent impactors: objects due to hit the Earth, detected only a few days or hours in advance of impacts. This timespan might be too short to take any effective safety countermeasure. For this reason, a necessary improvement of current observation capabilities is underway through the construction of dedicated telescopes, e.g., the NEO Survey Telescope (NEOSTEL), also known as “Fly-Eye”. Thanks to these developments, the number of discovered NEOs and, consequently, imminent impactors detected per year, is expected to increase, thus requiring an improvement of the methods and algorithms used to handle such cases. In this paper we present two new tools, based on the Admissible Region (AR) concept, dedicated to the observers, aiming to facilitate the planning of follow-up observations of NEOs by rapidly assessing the possibility of them being imminent impactors and the remaining visibility time from any given station.","authors":["Maddalena Mochi","Giacomo Tommei"],"meta":["January 2021Universe 7(1):10","DOI:10.3390/universe7010010"],"references":["345181973_The_Manifold_Of_Variations_hazard_assessment_of_short-term_impactors","340589701_Use_of_the_semilinear_method_to_predict_the_impact_corridor_on_ground","331894194_Simulation_of_Sky_Surveys_with_the_Flyeye_Telescope","322498210_Short_arc_orbit_determination_and_imminent_impactors_in_the_Gaia_era","331207061_The_Fly-Eye_Telescope_Development_and_First_Factory_Tests_Results","325068721_Monitoring_near-Earth-object_discoveries_for_imminent_impactors","315062283_The_impact_trajectory_of_asteroid_2008_TC_3","296628131_Impact_hazard_monitoring_Theory_and_implementation","274403396_Systematic_ranging_and_late_warning_asteroid_impacts","252845550_Orbit_determination_with_very_short_arcs_II_Identification"]}