{"id":"348311173_Psychanalyse_musique_et_informatique_un_essai_differentiel_sur_l'interpretation","abstract":"La première partie restitue le texte tel qu'il a été prononcé lors de la soirée \"Notre pratique de l'interprétation\", le 28 mai 2020, dans le cadre du séminaire École de l'EPFCL \"Actualité de la névrose\". La deuxième partie présente les travaux préparatoires, d'abord sur l'interprétation en musique, puis sur l'interprétation en informatique. Interprétation musicale, méthodes formelles et interprétation psychanalytique.\n\nDans notre champ, Lacan n'a pas retenu l'interprétation parmi les quatre concepts fondamentaux de la psychanalyse ; l'interprétation n'y reste pas moins une notion-clé et même un devoir. Il y a d'autres champs où l'interprétation est une pratique essentielle et, parmi ces champs, il se trouve que deux disciplines que j'ai fréquentées lui réservent une place de choix : la musique, avec la question cruciale de l'interprétation musicale ; et l'informatique théorique, avec la branche des méthodes formelles, qui s'affrontent à l'interprétation rigoureuse des programmes et des langages. \n\nPour ma première intervention au séminaire École, je nous propose donc un petit amusement en forme d'étude différentielle, pour essayer d'isoler les spécificités de la pratique de l'interprétation qui est la nôtre.","authors":["Karim Barkati"],"meta":["October 2020"],"references":["347588123_Seminaire_sur_La_Lettre_volee_extrait","318734383_An_Axiomatic_Basis_for_Computer_Programming","292796147_Le_seminaire_livre_vi_Le_desir_et_son_interpretation_1958-1959","285469544_Conference_a_Geneve_sur_le_symptome","272643364_Le_compositeur_et_son_double_Essais_sur_l'interpretation_musicale","269541116_La_semantique_cognitive_Elements_d'histoire_et_d'epistemologie","242441745_Denotationalsemantics_the_scott-strachey_approach_to_programming_language_semantics","220566692_Programming_Language_Semantics","220426816_ELIZA_-_A_Computer_Program_For_the_Study_of_Natural_Language_Communication_Between_Man_And_Machine_Reprint"]}