{"id":"348369331_A_revista_Diadorim_utiliza_uma_Licenca_Creative_Commons_-Atribuicao-NaoComercial_40_Internacional_CC-BY-NC_BLOGS_INNOVATIVE_POSSIBILITY_FOR_TEACHING_PORTUGUESE_1_BLOGS_POSSIBILIDADE_INOVADORA_PARA_O_E","abstract":"This paper aims to problematize the use of a blog as a tool for the teaching Portuguese. Blog, a web page that is supposed to be updated very frequently through the placement of messages or \"posts\" consisting of images and / or texts, was created as a popular option for online texts publication, considering the fact that it does not require advanced knowledge in computer science. The study to be presented here is a descriptive research with a qualitative approach. The analysis was based on Miller and Sheppard (2004) excerpts from the concepts of Sociodiscursive Interactionism (ISD) of Bronckart's framework of analysis procedures (, 2008) and Bronckart and Machado (2009). The results indicated that the style of the blog studied emphasizes the personal and professional experience of its creator, because the content uploaded in the blog seems to represent the freedom of selection and presentation of the blogger. The blog is seen by the user as an attempt to follow the digital advances, through a technological determinism, without the use of the resource in all its potential for the teaching Portuguese RESUMO Este artigo visa a problematizar a utilização de um blog como ferramenta para o ensino do português como língua materna. O blog, uma página na Web que se pressupõe ser atualizada com grande frequência, por meio da colocação de mensagens ou \"posts\" constituídos por imagens e/ou textos, foi criado como uma opção popular para a publicação de textos online, que dispensa conhecimentos avançados em informática. O estudo constitui-se como uma pesquisa descritiva, de abordagem qualitativa. A análise baseou-se nos apontamentos feitos por Miller e Sheppard (2004) e de recortes feitos dos conceitos do Interacionismo Sociodiscursivo (ISD) do quadro de procedimentos de análise de Bronckart (e Bronckart e Machado (2009). Os resultados indicam que o estilo do blog estudado enfatiza a experiência pessoal e profissional da sua criadora, que o conteúdo representa a liberdade de seleção e apresentação da blogueira. Reconhece-se o blog como uma tentativa de acompanhar os avanços, por meio de um determinismo tecnológico, sem a utilização do recurso em toda a sua potencialidade, para o ensino de língua portuguesa. PALAVRAS-CHAVE: Blog; Ensino de Língua Portuguesa; Interacionismo Sociodiscursivo.","authors":["Edmilson Francisco","Ilsa do Carmo Vieira Goulart","Patrícia Vasconcelos Almeida"],"meta":["December 2020Revista Diadorim 22(3):120-141","DOI:10.35520/diadorim.2020.v22n3a36391"],"references":["277850251_Novas_Formas_de_Producao_de_Conhecimento_utilizacao_de_ferramentas_da_WEB_20_como_recurso_pedagogico","242228183_Blogs_um_recurso_e_uma_estrategia_pedagogica","261834017_As_tecnologias_da_inteligencia_o_futuro_do_pensamento_na_era_da_informatica","240273373_Teaching_by_Principles_An_Interactive_Approach_to_Language_Pedagogy"]}