{"id":"348394815_Adaptive_behavioural_coping_strategies_as_reaction_to_COVID-19_social_distancing_in_Italy","abstract":"Objective: \nSocial distancing, as experienced by the Italian population during the COVID-19 outbreak, generated the long-term activation of stress-response in individuals. This has been a crucial opportunity to study the coping strategies that people put in place to adapt their lives and habits to such a unique condition. For this reason, we have investigated both emotion-focused and problem-oriented coping strategies among the Italian population by relating them to other structural factors, such as social, economic and cultural conditions.\n\nMaterials and methods: \nMore than 140,000 online interviews were collected in Italy from March 22 to April 2, 2020. This large dataset was used to carry out multivariate statistical data analysis with the aim of creating behavioral profiles, starting from coping parameters and other information. This technique has produced an association, showing a good level of statistical significance, between coping strategies and reactions to social distancing, due to the health emergency, during the data collection phase.\n\nResults: \nTwo coping indicators - problem-oriented and focused on positive emotions coping strategies - were selected as objective variables in a \"decision tree\" modelling. The results have shown a link between individual factors (i.e., atmosphere at home) and educational and social factors (i.e., compliance with restrictions during the health emergency).\n\nConclusions: \nThe reduction of social interaction had quite a significant impact on people's behavior; furthermore, coping strategies have played a crucial role in facing this stressor. For both the selected coping indicators, the best predictor was the atmosphere perceived at home. Moreover, the respondents' previous experiences have played a relevant role in the acceptance of new rules imposed by the government. This information can be useful in planning future social policies, both at national and international level, during such peculiar times.","authors":["Antonio Tintori","Loredana Cerbara","Giulia Ciancimino","Massimo Crescimbene"],"meta":["October 2020","DOI:10.26355/eurrev_202010_23449"],"references":["341393201_The_psychological_distress_and_coping_styles_in_the_early_stages_of_the_2019_coronavirus_disease_COVID-19_epidemic_in_the_general_mainland_Chinese_population_A_web-based_survey","232485259_Dynamics_of_a_Stressful_Encounter_Cognitive_Appraisal_Coping_and_Encounter_Outcomes","271728934_Cognitive_Performance_in_the_Aftermath_of_a_Natural_Disaster_The_Role_of_Coping_Strategies_Theory_of_Mind_and_Peer_Social_Support","227504040_Flexible_coping_responses_to_severe_acute_respiratory_syndrome-related_and_daily_life_stressful_events","47728329_Intimate_Partner_Violence_and_PTSD_The_Moderating_Role_of_Emotion-Focused_Coping","20176558_If_It_Changes_It_Must_Be_a_Process_A_Study_of_Emotion_and_Coping_During_Three_Stages_of_a_College_Examination","19133051_The_relative_efficacy_of_avoidant_and_nonavoidant_coping_strategies_A_meta-analysis","12727124_The_role_of_Neuroticism_in_daily_stress_and_coping","5879260_A_Developmental-Contextual_Model_of_Couples_Coping_With_Chronic_Illness_Across_the_Adult_Life_Span"]}