{"id":"348411789_Unsupervised_neural_network_models_of_the_ventral_visual_stream","abstract":"Deep neural networks currently provide the best quantitative models of the response patterns of neurons throughout the primate ventral visual stream. However, such networks have remained implausible as a model of the development of the ventral stream, in part because they are trained with supervised methods requiring many more labels than are accessible to infants during development. Here, we report that recent rapid progress in unsupervised learning has largely closed this gap. We find that neural network models learned with deep unsupervised contrastive embedding methods achieve neural prediction accuracy in multiple ventral visual cortical areas that equals or exceeds that of models derived using today’s best supervised methods and that the mapping of these neural network models’ hidden layers is neuroanatomically consistent across the ventral stream. Strikingly, we find that these methods produce brain-like representations even when trained solely with real human child developmental data collected from head-mounted cameras, despite the fact that these datasets are noisy and limited. We also find that semisupervised deep contrastive embeddings can leverage small numbers of labeled examples to produce representations with substantially improved error-pattern consistency to human behavior. Taken together, these results illustrate a use of unsupervised learning to provide a quantitative model of a multiarea cortical brain system and present a strong candidate for a biologically plausible computational theory of primate sensory learning.","authors":["Chengxu Zhuang","Siming Yan","Aran Nayebi","Martin Schrimpf"],"meta":["January 2021Proceedings of the National Academy of Sciences 118(3):e2014196118","DOI:10.1073/pnas.2014196118"],"references":["346367195_Controversial_stimuli_Pitting_neural_networks_against_each_other_as_models_of_human_cognition","340799333_A_neural_network_trained_for_prediction_mimics_diverse_features_of_biological_neurons_and_perception","350116794_Variability_and_Consistency_in_Early_Language_Learning_The_Wordbank_Project","347190945_Contrastive_Multiview_Coding","343463848_Unsupervised_Learning_From_Video_With_Deep_Neural_Embeddings","343456678_Momentum_Contrast_for_Unsupervised_Visual_Representation_Learning","339555805_Local_Aggregation_for_Unsupervised_Learning_of_Visual_Embeddings","338586262_SAYCam_A_large_longitudinal_audiovisual_dataset_recorded_from_the_infant's_perspective","338510089_Do_Better_ImageNet_Models_Transfer_Better","336860572_A_deep_learning_framework_for_neuroscience"]}