{"id":"348470021_An_Empirical_Review_of_Automated_Machine_Learning","abstract":"In recent years, Automated Machine Learning (AutoML) has become increasingly important in Computer Science due to the valuable potential it offers. This is testified by the high number of works published in the academic field and the significant efforts made in the industrial sector. However, some problems still need to be resolved. In this paper, we review some Machine Learning (ML) models and methods proposed in the literature to analyze their strengths and weaknesses. Then, we propose their use—alone or in combination with other approaches—to provide possible valid AutoML solutions. We analyze those solutions from a theoretical point of view and evaluate them empirically on three Atari games from the Arcade Learning Environment. Our goal is to identify what, we believe, could be some promising ways to create truly effective AutoML frameworks, therefore able to replace the human expert as much as possible, thereby making easier the process of applying ML approaches to typical problems of specific domains. We hope that the findings of our study will provide useful insights for future research work in AutoML.","authors":["Lorenzo Vaccaro","Giuseppe Sansonetti","Alessandro Micarelli"],"meta":["January 2021Computers 10(1):11","DOI:10.3390/computers10010011"],"references":["353530790_Automated_Machine_Learning-A_Brief_Review_at_the_End_of_the_Early_Years","351819201_A_Comprehensive_Survey_of_Neural_Architecture_Search_Challenges_and_Solutions","348871447_Benchmark_and_Survey_of_Automated_Machine_Learning_Frameworks","345495571_Enhancing_cultural_recommendations_through_social_and_linked_open_data","344334884_Experimental_Review_of_Neural-Based_Approaches_for_Network_Intrusion_Management","339417976_Automated_Machine_Learning_Review_of_the_State-of-the-Art_and_Opportunities_for_Healthcare","348560847_Techniques_for_Automated_Machine_Learning","347624256_AutoML_A_survey_of_the_state-of-the-art","342619428_An_Automated_Machine_Learning_AutoML_Method_of_Risk_Prediction_for_Decision-Making_of_Autonomous_Vehicles","339751174_Attention_Routing_Between_Capsules"]}