{"id":"348455106_An_Alternative_Design_Approach_for_Fractional_Order_Internal_Model_Controllers_for_Time_Delay_Systems","abstract":"Introdu ction: Fractional Order Internal Model Control (FO-IMC) extends the capabilities of the classical IMC approach into the generalized domain of fractional calculus. When dealing with processes that exhibit time delays, implementation of such controllers in a classical feedback loop requires the approximation of the fractional order terms, as well as of the corresponding time delays.\n\nObjectives\nThe present study proposes an alternative design procedure of FO-IMC controllers based on a novel approximation method of the process time delay, proving the efficiency of the proposed method and its suitability for time delay systems.\n\nMethods\nThe generalized IMC control laws are obtained analytically, based on a novel approximation of time delay, the Non-Rational Transfer Function approach.\n\nResults\nSeveral numerical examples are chosen to illustrate the efficiency of the proposed approach. In addition, a vertical take-off and landing unit exhibiting second order plus time delay dynamics is chosen to experimentally validate the proposed control strategy. The obtained results are used to compare the proposed tuning strategy with a popular FO-IMC tuning approach, based on the Taylor series approximation of the time delay.\n\nConclusion\nAll the chosen examples, both numerical and experimental ones, validate the proposed method. The overall closed loop results obtained with the proposed approach demonstrate an improved performance compared to the existing method. Ultimately, the purpose of the paper to provide an alternative design strategy that extends the existing FO-IMC control field is reached.","authors":["C.I. Muresan","Isabela Roxana Birs","Robain De Keyser"],"meta":["January 2021Journal of Advanced Research 31(1)","DOI:10.1016/j.jare.2021.01.004"],"references":["342081220_Generalization_of_the_FOPDT_Model_for_Identification_and_Control_Purposes","339278626_Multi-Loop_Model_Reference_Proportional_Integral_Derivative_Controls_Design_and_Performance_Evaluations","335548682_Approximation_Methods_for_FO-IMC_Controllers_for_Time_Delay_Systems","331528390_A_Survey_of_Recent_Advances_in_Fractional_Order_Control_for_Time_Delay_Systems","330267133_Experimental_results_of_fractional_order_PI_controller_designed_for_second_order_plus_dead_time_SOPDT_processes","326855683_Tuning_of_fractional_order_proportional_integralproportional_derivative_controllers_based_on_existence_conditions","339480092_Alternative_Approximation_Method_for_Time_Delays_in_an_IMC_Scheme","330705001_Fractional_order_IMC_controller_via_order_reduction_and_CRONE_principle_for_Load_frequency_control","329948516_Time-domain_Identification_of_One_Non-Integer_Order_Plus_Time_Delay_Models_from_Step_Response_Measurements","325829414_IMC_based_Fractional_Order_Controller_Design_for_Specific_Non-Minimum_Phase_Systems"]}