{"id":"348409445_MDPRP_A_Q-learning_Approach_for_the_Joint_Control_of_Beaconing_Rate_and_Transmission_Power_in_VANETs","abstract":"Vehicular ad-hoc communications rely on periodic broadcast beacons as the basis for most of their safety applications, allowing vehicles to be aware of their surroundings. However, an excessive beaconing load might compromise the proper operation of these crucial applications, especially regarding the exchange of emergency messages. Therefore, congestion control can play an important role. In this paper, we propose joint beaconing rate and transmission power control based on policy evaluation. To this end, a Markov Decision Process (MDP) is modeled by making a set of reasonable simplifying assumptions which are resolved using Q-learning techniques. This MDP characterization, denoted as MDPRP (indicating Rate and Power), leverages the trade-off between beaconing rate and transmission power allocation. Moreover, MDPRP operates in a non-cooperative and distributed fashion, without requiring additional information from neighbors, which makes it suitable for use in infrastructureless (ad-hoc) networks. The results obtained reveal that MDPRP not only balances the channel load successfully but also provides positive outcomes in terms of packet delivery ratio. Finally, the robustness of the solution is shown since the algorithm works well even in those cases where none of the assumptions made to derive the MDP model apply.","authors":["Juan Aznar-Poveda","Antonio-Javier Garcia-Sanchez"],"meta":["January 2021IEEE Access PP(99)","DOI:10.1109/ACCESS.2021.3050625"],"references":["345175959_Research_on_adaptive_beacon_message_transmission_power_in_VANETs","344301569_Array_programming_with_NumPy","341918496_Balancing_Power_and_Rate_Control_for_Improved_Congestion_Control_in_Cellular_V2X_Communication_Environments","340625421_Channel-Aware_Congestion_Control_in_Vehicular_Cyber-Physical_Systems","340254968_Context_aware_autonomous_resource_selection_and_Q-learning_based_power_control_strategy_for_enhanced_cooperative_awareness_in_LTE-V2V_communication","337578671_Congestion_Avoidance_in_Vehicular_Networks_A_Contemporary_Survey","336762496_Time-to-Collision-Based_Awareness_and_Congestion_Control_for_Vehicular_Communications","343487560_Safety-Aware_and_Distributed_Beacon_Congestion_Control","343026143_A_Distributed_Power_Control_Algorithm_for_Energy_Efficiency_Maximization_in_Wireless_Cellular_Networks","337132165_Reliable_Congestion_Control_Mechanism_for_Safety_Applications_in_Urban_VANETs"]}