{"id":"348451477_Classification_of_the_likelihood_of_Indonesian_Facebook_users_in_spreading_hoaxes_using_Support_Vector_Machine_SVM","abstract":"Social media is the most commonly accessed internet content by Indonesian netizens; 97.4 % Indonesians access social media while using the internet. In 2016, Facebook was the most commonly used social media format for Indonesian internet users. While many are benefited by the features offered by Facebook, many also use Facebook for things that they are not supposed to, such as sharing hoaxes, either intentionally or unintentionally. This clearly puts Facebook users at a disadvantage, considering the increasing trend of hoax-sharing nowadays. Therefore, this research aims to prevent the spread of hoax through Facebook by analyzing the pattern of how people use Facebook. This pattern is obtained from a survey on 200 samples that use Facebook, chosen by purposive sampling. Using the Support Vector Machine method, an application of the collaboration between mathematics and computer science, the acquired data is used to predict whether or not someone has the potential of spreading hoaxes. Simulation results show that the average of the prediction accuracy of this binary classification problem is 86 percent. Hence, it is hoped that Facebook could prevent the sharing of hoaxes by making use of the results from this research.","authors":["T V Rampisela","H T Andarlia","Zuherman Rustam"],"meta":["January 2021Journal of Physics Conference Series 1725(1):012019","DOI:10.1088/1742-6596/1725/1/012019"],"references":["333801079_Kebijakan_Pemerintah_Menangkal_Penyebaran_Berita_Palsu_atau_'Hoax'","330282199_Less_than_you_think_Prevalence_and_predictors_of_fake_news_dissemination_on_Facebook","316029838_Scikit-learn_Machine_Learning_Without_Learning_the_Machinery","283594389_The_Internet_and_Indonesian_Women_Entrepreneurs_Examining_the_Impact_of_Social_Media_on_Women_Empowerment","283042129_Using_Social_Networks_Facebook_Usage_at_the_Riau_College_Students","283009320_Fact-checking_Effect_on_Viral_Hoaxes_A_Model_of_Misinformation_Spread_in_Social_Networks","323334141_Challenges_for_the_next_level_of_digital_divide_in_rural_Indonesian_communities","316712634_Social_Media_and_Fake_News_in_the_2016_Election","286824883_Algorithms"]}