{"id":"348443180_Acciones_para_desarrollar_el_pensamiento_matematico_desde_la_asignatura_Matematica_I_en_la_carrera_ICI_Actions_to_develop_mathematical_thinking_from_the_subject_Mathematics_I_in_the_ICI_career","abstract":"Resumen Se presenta el resultado de un trabajo de investigación de carácter cualitativo, que tiene como objetivo delinear acciones para desarrollar el pensamiento matemático desde la asignatura Matemática I, del nuevo Plan de Estudio E de la carrera de Ingeniería en Ciencias Informáticas, en la Universidad de las Ciencias Informáticas. La metodología utilizada se apoya en la indagación sobre dos fuentes predominantes: la que se origina en la práctica de la enseñanza de la matemática a estudiantes de ingeniería por varias décadas y la proveniente de un estudio de la literatura sobre el pensamiento matemático. Tomando como referencia los contenidos del Tema 1 de la asignatura, se delinean acciones y se presentan ejemplos, dirigidos a aportar a la motivación de los alumnos por la presencia de la matemática en su curriculum docente y al desarrollo del pensamiento matemático que deben ir fortaleciendo a lo largo de su carrera. Palabras clave: enseñanza de la matemática, pensamiento matemático, ingeniería, ciencias informáticas, investigación cualitativa Abstract The result of a qualitative research work is presented, which aims to outline actions to develop mathematical thinking from Mathematics I, of the new Career E Study Plan of the Computer Science Engineering degree, at the University of Informatic Sciences. The methodology used is based on the investigation of two predominant sources: the one that originates in the practice of teaching mathematics to engineering students for some decades and the other one that comes from a study of the literature on mathematical thinking. Taking as a reference the contents of Topic 1 of the subject, actions are outlined and examples are presented, aimed at contributing to the motivation of students by the presence of mathematics in their teaching curriculum and to the development of mathematical thinking that should gradually strengthen students throughout his career.\nKeywords: mathematics education, mathematical thinking, engineering, computer science, qualitative research","authors":["Díaz Tito","Hilario Quintana Álvarez","Gusbey Pérez Carrazana","Abel Velázquez Pratts"],"meta":["December 2020","Project: Teaching mathematics in computer and related engineering"],"references":["334469677_ACCIONES_DESDE_EL_DISENO_DE_LAS_CLASES_DE_MATEMATICA_I_DIRIGIDAS_A_CUMPLIR_CON_LOS_OBJETIVOS_Y_RESARCIR_A_LA_VEZ_LA_FALTA_DE_CONOCIMIENTOS_DE_LA_MATEMATICA_PRECEDENTE","331501146_Complejidad_y_Pensamiento_Complejo_para_innovar_los_procesos_formativos_en_ingenieria","329880631_El_debate_sobre_el_pensamiento_computacional_en_educacion","322300195_Pensamiento_computacional_Una_tercera_competencia_clave","317954027_Vinculacion_de_las_matematicas_con_la_realidad_Implicaciones_en_la_conformacion_del_pensamiento_del_profesor","317937065_Fundamentos_de_la_investigacion_y_la_innovacion_educativa","276880277_Logica_y_abstraccion_en_la_formacion_de_ingenieros_una_relacion_necesaria","335787931_Les_mathematiques_dans_la_formation_des_ingenieurs_et_sur_leur_lieu_de_travail_etudes_et_propositions_cas_de_la_France","44471034_Calculo_de_varias_variables_trascendentes_tempranas_James_Stewart","31658912_Calculo_de_una_variable_trascendentes_tempranas_J_Stewart_tr_por_Virgilio_Gonzalez_Pozo","28291746_Tres_esferas_de_accion_del_pensamiento_critico_en_ingenieria"]}