{"id":"348462814_Simultaneous_lesion_and_brain_segmentation_in_multiple_sclerosis_using_deep_neural_networks","abstract":"Segmentation of white matter lesions and deep grey matter structures is an important task in the quantification of magnetic resonance imaging in multiple sclerosis. In this paper we explore segmentation solutions based on convolutional neural networks (CNNs) for providing fast, reliable segmentations of lesions and grey-matter structures in multi-modal MR imaging, and the performance of these methods when applied to out-of-centre data. We trained two state-of-the-art fully convolutional CNN architectures on the 2016 MSSEG training dataset, which was annotated by seven independent human raters: a reference implementation of a 3D Unet, and a more recently proposed 3D-to-2D architecture (DeepSCAN). We then retrained those methods on a larger dataset from a single centre, with and without labels for other brain structures. We quantified changes in performance owing to dataset shift, and changes in performance by adding the additional brain-structure labels. We also compared performance with freely available reference methods. Both fully-convolutional CNN methods substantially outperform other approaches in the literature when trained and evaluated in cross-validation on the MSSEG dataset, showing agreement with human raters in the range of human inter-rater variability. Both architectures showed drops in performance when trained on single-centre data and tested on the MSSEG dataset. When trained with the addition of weak anatomical labels derived from Freesurfer, the performance of the 3D Unet degraded, while the performance of the DeepSCAN net improved. Overall, the DeepSCAN network predicting both lesion and anatomical labels was the best-performing network examined.","authors":["Richard McKinley","Rik Wepfer","Fabian J Aschwanden","Lorenz Grunder"],"meta":["January 2021Scientific Reports 11(1)","DOI:10.1038/s41598-020-79925-4"],"references":["347977308_A_contrast-adaptive_method_for_simultaneous_whole-brain_and_lesion_segmentation_in_multiple_sclerosis","342560943_Multiple_sclerosis_cortical_and_WM_lesion_segmentation_at_3T_MRI_a_deep_learning_method_based_on_FLAIR_and_MP2RAGE","337853248_Automatic_detection_of_lesion_load_change_in_Multiple_Sclerosis_using_convolutional_neural_networks_with_segmentation_confidence","329552979_One-shot_domain_adaptation_in_multiple_sclerosis_lesion_segmentation_using_convolutional_neural_networks","329269682_Geostatistical_analysis_of_white_matter_lesions_in_MS_identifies_gender_differences_in_lesion_evolution","328751501_Predicting_conversion_from_clinically_isolated_syndrome_to_multiple_sclerosis-An_imaging-based_machine_learning_approach","327812991_Repeatability_and_reproducibility_of_FreeSurfer_FSL-SIENAX_and_SPM_brain_volumetric_measurements_and_the_effect_of_lesion_filling_in_multiple_sclerosis","327603771_Objective_Evaluation_of_Multiple_Sclerosis_Lesion_Segmentation_using_a_Data_Management_and_Processing_Infrastructure","331530972_Automated_Detection_and_Segmentation_of_Multiple_Sclerosis_Lesions_Using_Ultra-High-Field_MP2RAGE","330645575_Ensembles_of_Densely-Connected_CNNs_with_Label-Uncertainty_for_Brain_Tumor_Segmentation_4th_International_Workshop_BrainLes_2018_Held_in_Conjunction_with_MICCAI_2018_Granada_Spain_September_16_2018_Re"]}