{"id":"348458032_The_Future_of_Local_Self-Government_European_Trends_in_Autonomy_Innovations_and_Central-Local_Relations_European_Trends_in_Autonomy_Innovations_and_Central-Local_Relations","abstract":"This book presents new research results on the challenges of local politics in different European countries, including Germany, the Netherlands, the Nordic countries and Switzerland, together with theoretical considerations on the further development and strengthening of local self-government. It focuses on analyses of the most recent developments in local democracy and administration.\n“Most ‘local government’ books are written by believers. This book is different for its realistic visions of futures of local government. It shows how autonomy, digitalization, marketization, and amalgamation could be functional or dysfunctional, and also how this is affected by links to politics, and impacted by intergovernmental relations. This is a must read for all believers in local government.”\n—Geert Bouckaert, KU Leuven Public Governance Institute, Belguim\n\n“The twenty chapters of this book provide a timely and thought-provoking addition to our understanding of local self-governance in eight countries in Northern and Central Europe. This book was completed shortly before the Corona-crisis crashed in. But the lessons to be learned from this volume will doubtlessly prove important in fully exploiting local government’s potential in facing the challenges of the difficult times ahead.”\n—Bas Denters, Professor of Public Administration, University of Twente, Netherlands\n\n“Very inspiring book that covers the most important aspects of local self-government within a comparative framework. As we might have expected, there is no general trend, no single best model but a variety of functionally equivalent settings and patterns. The book gives insight into the diversity and richness of local government, its very essence, actual challenges and transformations, and puts subnational policy making in a multi-level perspective of governance.”\n—Andreas Ladner, Professor for Political Institutions and Public Administration at the IDHEAP, University of Lausanne, Switzerland\n\n“Covering eight countries, this ambitious volume compares developments in local governments across Europe. Local governments are on the front-line when it comes to responding to wicked issues like climate change and migration, yet face major challenges in terms of financial and human resources. Using rich empirical evidence, the volume presents a nuanced analysis of trends. No one direction emerges for Europe’s local governments, but a rich seam of innovation is revealed covering political participation and public administration alike. Local governments have the potential to engage citizens in meaningful ways and deliver effective and responsive services, but this requires clear local leadership and support rather direction from the centre.”\n—Vivien Lowndes, Professor of Public Policy, University of Birmingham, UK\nTomas Bergström is Associate Professor in the Department of Political Science at Lund University, Sweden.\n\nJochen Franzke is Professor of Administrative Science at the University of Potsdam, Germany.\n\nSabine Kuhlmann is Professor of Political Sciences, Administration and Organization at the University of Potsdam in Germany. She also is the Vice-Chair of the German National Regulatory Control Council at the German Federal Chancellery and she serves as the Vice-President for Western Europe of the IIAS and the Vice-President of EGPA. \n\nEllen Wayenberg is Professor at the Faculty of Economics and Business Administration, Ghent University, Belgium.","authors":["Tomas Bergström","Franzke Jochen","Sabine Kuhlmann","Ellen Wayenberg"],"meta":["January 2021","DOI:10.1007/978-3-030-56059-1","ISBN: 978-3-030-56058-4"],"references":["337691697_Correction_to_Patterns_of_Local_Autonomy_in_Europe","334028741_Defining_digital_transformation_Results_from_expert_interviews","331092224_The_public_value_of_E-Government_-_A_literature_review","346526895_Rescaling_the_European_State_The_Making_of_Territory_and_the_Rise_of_the_Meso","346423607_Kommuner_som_forskningspolitiska_aktorer_En_jamforelse_mellan_Norrkoping_och_Orebro","346423428_What_shapes_research_policy_at_the_local_government_level_The_establishment_of_a_research_fund_in_a_Swedish_municipality","346423313_Constructing_an_innovation_policy_agency_The_case_of_the_Swedish_Governmental_Agency_for_Innovation_Systems","346422333_The_role_of_municipalities_in_the_bottom-up_formation_of_a_meta-region_in_Sweden","337466432_Digitalisierung_von_Verwaltungsleistungen_in_Burgeramtern","331398502_Do_municipal_autonomy_and_institutional_fragmentation_stand_in_the_way_of_antisprawl_policies_A_qualitative_comparative_analysis_of_Swiss_cantons","329275758_ESPON_COMPASS_-_Comparative_Analysis_of_Territorial_Governance_and_Spatial_Planning_Systems_in_Europe_Applied_Research_2016-2018_-_Final_Report","328756233_Territorial_reforms_in_Europe_effects_on_administrative_performance_and_democratic_participation","330913337_Reform_as_routine_Organizational_change_and_stability_in_the_modern_world","328110021_The_Routledge_Handbook_of_International_Local_Government","328095910_When_old_and_new_regionalism_collide_Deinstitutionalization_of_regions_and_resistance_identity_in_municipality_amalgamations"]}