{"id":"348503038_DGIRM_Discontinuous_Galerkin_based_Isogeometric_Residual_Minimization_for_the_Stokes_problem","abstract":"In this paper, we introduce a stable isogeometric analysis discretization of the Stokes system of equations. We use this standard constrained problem to demonstrate the flexibility and robustness of the residual minimization method on dual stable norms [16], which unlocks the extraordinary approximation power of isogeometric analysis [44]. That is, we introduce an isogeometric residual minimization method (IRM) for the Stokes equations, which minimizes the residual in a dual discontinuous Galerkin norm; thus we use the acronym DGiRM. Following Calo et al. [16], we start from an inf-sup stable discontinuous Galerkin (DG) formulation to approximate in a highly continuous trial space that minimizes the dual norm of the residual in a discontinuous test space. We demonstrate the performance and robustness of the methodology considering a manufactured solution and the well-known lid-driven cavity flow problem. First, we use a multi-frontal direct solver, and, using the Pareto front, compare the resulting numerical accuracy and the computational cost expressed by the number of floating-point operations performed by the direct solver algorithm. Second, we use an iterative solver. We measure the number of iterations required when increasing the mesh size and how the configuration of spaces affect the resulting accuracy. This paper is an extension of the paper A Stable Discontinuous Galerkin Based Isogeometric Residual Minimization for the Stokes Problem by M. Loś, et al. (2020) published in Lecture Notes in Computer Science. In this extended version, we deepen in the mathematical aspects of the DGiRM, include the iterative solver algorithm and implementation, and discuss the influence of different discretization spaces on the iterative solver's convergence.","authors":["Marcin Łoś","Sergio Rojas","Maciej Paszynski","Ignacio Muga"],"meta":["January 2021Journal of Computational Science 50(23)","DOI:10.1016/j.jocs.2021.101306","Project: isogeometric Residual Minimization Method (iGRM)"],"references":["346012612_Isogeometric_Residual_Minimization_iGRM_for_Non-Stationary_Stokes_and_Navier-Stokes_Problems","342296149_A_Stable_Discontinuous_Galerkin_Based_Isogeometric_Residual_Minimization_for_the_Stokes_Problem","333811277_Isogeometric_Residual_Minimization_Method_iGRM_with_Direction_Splitting_for_Non-Stationary_Advection-Diffusion_Problems","303445887_Energy_Exchange_Analysis_in_Droplet_Dynamics_via_the_Navier-Stokes-Cahn-Hilliard_Model","282790180_On_the_stability_of_DPG_formulations_of_transport_equations","278627876_Stabilized_finite_element_methods_I_application_to_the_advective-diffusive_model","341082877_An_adaptive_stabilized_conforming_finite_element_method_via_residual_minimization_on_dual_discontinuous_Galerkin_norms","317124799_Hydroacylation_of_Activated_Ketones_Catalyzed_by_N-Heterocyclic_Carbenes","301872944_PetIGA-MF_A_multi-field_high-performance_toolbox_for_structure-preserving_B-splines_spaces","290872795_A_new_finite_element_formulation_for_computational_fluid_dynamics_VII_The_stokes_problem_with_various_well-posed_boundary_conditions_Symmetric_formulations_that_converge_for_all_velocitypressure_space"]}