{"id":"348593942_MRI_texture_feature_repeatability_and_image_acquisition_factor_robustness_a_phantom_study_and_in_silico_study","abstract":"Purpose\nTo evaluate robustness and repeatability of magnetic resonance imaging (MRI) texture features in water and tissue phantom test-retest study.\n\nMaterials and methods\nSeparate water and tissue phantoms were imaged twice with the same protocol in a test-retest experiment using a 1.5-T scanner. Protocols were acquired to favour signal-to-noise ratio and resolution. Forty-six features including first order statistics and second-order texture features were extracted, and repeatability was assessed by calculating the concordance correlation coefficient. Separately, base image noise and resolution were manipulated in an in silico experiment, and robustness of features was calculated by assessing percentage coefficient of variation and linear correlation of features with noise and resolution. These simulation data were compared with the acquired data. Features were classified by their degree (high, intermediate, or low) of robustness and repeatability.\n\nResults\nEighty percent of the MRI features were repeatable (concordance correlation coefficient > 0.9) in the phantom test-retest experiment. The majority (approximately 90%) demonstrated a strong or intermediate correlation with image acquisition parameter, and 19/46 (41%) and 13/46 (28%) of features were highly robust to noise and resolution, respectively (coefficient of variation < 5%). Agreement between the acquired and simulation data varied, with the range of agreement within feature classes between 11 and 92%.\n\nConclusion\nMost MRI features were repeatable in a phantom test-retest study. This phantom data may serve as a lower limit of feature MRI repeatability. Robustness of features varies with acquisition parameter, and appropriate features can be selected for clinical validation studies.","authors":["Joshua Shur","Matthew Blackledge","James d'Arcy","David J Collins"],"meta":["December 2021","DOI:10.1186/s41747-020-00199-6"],"references":["339835844_The_Image_Biomarker_Standardization_Initiative_Standardized_Quantitative_Radiomics_for_High-Throughput_Image-based_Phenotyping","334150534_Repeatability_of_Multiparametric_Prostate_MRI_Radiomics_Features","328157303_A_New_Challenge_for_Radiologists_Radiomics_in_Breast_Cancer","325587184_Repeatability_and_Reproducibility_of_Radiomic_Features_A_Systematic_Review","344359398_How_can_we_combat_multicenter_variability_in_MR_radiomics_Validation_of_a_correction_procedure","333336873_Texture_Analysis_in_Cerebral_Gliomas_A_Review_of_the_Literature","328970540_Robustness_and_Reproducibility_of_Radiomics_in_Magnetic_Resonance_Imaging_A_Phantom_Study","324738960_Radiomics_of_CT_Features_May_Be_Nonreproducible_and_Redundant_Influence_of_CT_Acquisition_Parameters","324668439_Agreement_Analysis_What_He_Said_She_Said_Versus_You_Said","320452763_Radiomic_subtyping_improves_disease_stratification_beyond_key_molecular_clinical_and_standard_imaging_characteristics_in_patients_with_glioblastoma"]}