{"id":"348560214_The_Effect_of_the_Time_Management_Skills_of_Students_Taking_a_Financial_Accounting_Course_on_their_Course_Grades_and_Grade_Point_Averages","abstract":"Time is a vital resource everyone possesses equally but fails to utilize at the same level due to a variety of reasons. All the material and human resources possessed by organizations can be enhanced in the course of time or be transformed as time goes on; yet the only asset that cannot be changed or purchased or stored is \"time\" itself. Driven by this fact, particular emphasis has been paid in the modern education system to time management issues by evaluating students' attitudes and behaviors related to time and its management. Based on the necessity of effective time management required from students majoring in financial accounting during their academic and professional life, field research has been conducted in the present paper towards the aim of designating their position with respect to effective time management and determining the effect of their time management skills on their GPA and course achievement. It has been concluded in this research that students from Karadeniz Technical University hold \"moderate level\" time management scores. When the research findings are analyzed with respect to the gender variable, it is revealed that in all sub-dimensions of the questionnaire, female students obtained higher average scores than male students. In a different research finding it has been demonstrated that there exists a positive significant relation between students' grade point averages and the time attitudes sub-dimension and between financial accounting grades and the long-range planning sub-dimension. It has also been demonstrated by regression analysis that students' time management skills affect their GPA-course achievement and these skills are one of the predictors of grade point averages and financial accounting grade points.","authors":["Abdülkadir Pehlivan"],"meta":["May 2013"],"references":["265849545_Effects_of_learning_styles_and_time_management_on_academic_achievement","232573913_Effects_of_Time-Management_Practices_on_College_Grades","209836182_College_Students'_Time_Management_Correlations_With_Academic_Performance_and_Stress","299020955_Time_Management_Skills_of_Pamukkale_University_Students_and_their_Effects_on_Academic_Achievement","232606618_Time_management_practices_in_an_African_culture_Correlates_with_College_Academic_Grades","6129331_A_Study_of_Time_Management_The_Correlation_between_Video_Game_Usage_and_Academic_Performance_Markers"]}