{"id":"348641280_Supervised_Learning_Breast_Cancer_Data_Set_Analysis_in_MATLAB_Using_Novel_SVM_Classifier","abstract":"Chest carcinoma is the increasing problem, particularly among women. In this paper, we developed a breast cancer data set containing the biomolecules concentration in breast cancer cells measured using mass spectrometry. Based on the concentrations of these biomolecules, the tumor in the breast can be classified into benign and malignant which is specified in the data set. The biomolecules in different signal transduction pathways like PKB (protein kinase B), MAPK (mitogen-activated protein kinase), MTOR (mammalian target of rapamycin), Fas ligand (Type-II transmembrane protein), notch (single-pass transmembrane receptor), SHH (Sonic Hedgehog), Tnf (tumor necrosis factor), Wnt (wingless/integrated) are taken into account. In this work, a framework research program for the categorization of cancer and tumor is built using supervised machine learning. When selecting a function, we extract the bases set throughout the kernel capacity and then expand the edge-construct function discretion program. We are starting to traverse a variety of characteristic collection and filtration approaches as well as incorporate the optimum feature subcategories with multiple learning categorization methods, such as KNN (K-nearest neighbor), PNN (probalistic neural network), and SVM (support vector machine) classifiers. The highest categorization efficiency for diagnosis of chest carcinoma is achieved at 99.17% connecting diameter and durable attributes using the SVM sorter.","authors":["Prasanna Priya Golagani","Tummala Sita Mahalakshmi","Khasim Beebi Shaik"],"meta":["January 2021","DOI:10.1007/978-981-15-9516-5_22","In book: Machine Intelligence and Soft Computing (pp.255-263)"],"references":["320046589_Comparative_Study_of_Machine_Learning_Algorithms_for_Breast_Cancer_Detection_and_Diagnosis","318726342_Breast_Cancer_Diagnosis_Using_Genetic_Algorithm_for_Training_Feed_Forward_Back_Propagation","310589496_Comparative_Study_of_Machine_Learning_Algorithms_for_Breast_Cancer_Detection_and_Diagnosis","303232034_Mathematical_Model_Development_to_Detect_Breast_Cancer_Using_Multigene_Genetic_Programming","257435716_A_genetic_algorithm-based_multi-objective_optimization_of_an_artificial_neural_network_classifier_for_breast_cancer_diagnosis","252628102_Performance_analysis_of_support_vector_machines_classifiers_in_breast_cancer_mammography_recognition","252627710_Probabilistic_neural_network_for_breast_cancer_classification"]}