{"id":"348685752_Enhancing_EJsS_with_Extension_Plugins","abstract":"Easy JavaScript Simulations (EJsS) is an open-source tool that allows teachers with limited programming experience to straightforwardly bundle an interactive computer science or engineer simulation in an HTML+ JavaScript webpage. Its prominent place in Physics (where it has won several prizes) should not hinder its application in other fields (such as building the front-end of remote laboratories or learning analytics) after having adapted part of the functionality of EJsS to them. To facilitate the future inclusion of new functionalities in EJsS, this paper presents a new version of this tool that allows the enhancement of EJsS, letting it incorporate new tools and change its graphical user interface, by means of extension plugins (special software libraries). To illustrate the benefits of this distributable self-contained non-intrusive strategy, the paper (a) discusses the new methodological possibilities that the Plugins bring to EJsS developers and users, and (b) presents three plugins: one to support the plugin management and the others to easily set up a streamlined remote laboratory. Moreover, the paper also presents the main characteristics of that remote lab to allow readers take advantage of EJsS and the three plugins to set up new online experiments for their students quickly.","authors":["J. Chacón","Eva Besada","Gonzalo Carazo-Barbero","Jose Antonio Lopez-Orozco"],"meta":["January 2021Electronics 10(3):242","DOI:10.3390/electronics10030242"],"references":["335253289_Design_simulation_and_testing_of_a_cloud_platform_for_sharing_digital_fabrication_resources_for_education","322728730_A_remote_laboratory_for_optical_levitation_of_charged_droplets","322106253_2D_and_3D_virtual_interactive_laboratories_of_physics_on_Unity_platform","321821033_Implementation_of_cloud-based_smart_adaptive_remote_laboratories_for_education","312092059_Easy_Handling_of_Sensors_and_Actuators_over_TCPIP_Networks_by_Open_Source_HardwareSoftware","343450971_Desarrollo_e_implementacion_de_un_sistema_de_control_en_una_planta_piloto_hibrida","334677903_DEVELOPMENT_OF_HYBRID_LABORATORIES_OF_INDUSTRIAL_SYSTEMS_FOR_INTERACTIVE_LEARNING_OF_AUTOMATION_AND_CONTROL","329853356_A_Fully_Integrated_Open_Solution_for_the_Remote_Operation_of_Pilot_Plants","318176600_A_virtual_engine_laboratory_for_teaching_powertrain_engineering","315369870_Designing_an_ultrafast_laser_virtual_laboratory_using_MATLAB_GUIDE"]}