{"id":"348635912_One-time-pad_cipher_algorithm_based_on_confusion_mapping_and_DNA_storage_technology","abstract":"In order to solve the problems of low computational security in the encoding mapping and difficulty in practical operation of biological experiments in DNA-based one-time-pad cryptography, we proposed a one-time-pad cipher algorithm based on confusion mapping and DNA storage technology. In our constructed algorithm, the confusion mapping methods such as chaos map, encoding mapping, confusion encoding table and simulating biological operation process are used to increase the key space. Among them, the encoding mapping and the confusion encoding table provide the realization conditions for the transition of data and biological information. By selecting security parameters and confounding parameters, the algorithm realizes a more random dynamic encryption and decryption process than similar algorithms. In addition, the use of DNA storage technologies including DNA synthesis and high-throughput sequencing ensures a viable biological encryption process. Theoretical analysis and simulation experiments show that the algorithm provides both mathematical and biological security, which not only has the difficult advantage of cracking DNA biological experiments, but also provides relatively high computational security.","authors":["Weiping Peng","Shuang Cui","Cheng Song"],"meta":["January 2021PLoS ONE 16(1):e0245506","DOI:10.1371/journal.pone.0245506"],"references":["337639760_Reading_and_writing_digital_data_in_DNA","335990932_Fast_and_compact_DNA_logic_circuits_based_on_single-stranded_gates_using_strand-displacing_polymerase","328774909_One-time-pad_cryptography_scheme_based_on_a_three-dimensional_DNA_self-assembly_pyramid_structure","321232758_Enhanced_DNA_and_ElGamal_cryptosystem_for_secure_data_storage_and_retrieval_in_cloud","275721118_A_Novel_DNA_Computing_Based_Encryption_and_Decryption_Algorithm","347400090_Fractal_sorting_matrix_and_its_application_on_chaotic_image_encryption","342340354_Image_encryption_algorithm_based_on_the_matrix_semi-tensor_product_with_a_compound_secret_key_produced_by_a_Boolean_network","335212164_Image_encryption_algorithm_for_synchronously_updating_Boolean_networks_based_on_matrix_semi-tensor_product_theory","314195927_DNA_Fountain_enables_a_robust_and_efficient_storage_architecture","275672459_A_novel_chaotic_image_encryption_scheme_using_DNA_sequence_operations"]}