{"id":"348694120_Impulsive_noise_modeling_and_robust_receiver_design","abstract":"Interference is an important limitation in many communication systems. It has been shown in many situations that the popular Gaussian approximation is not adequate and interference exhibits an impulsive behavior. This paper surveys the different statistical models proposed for such an interference, that can generally be unified using the class of sub-exponential family of distributions, and its impact on the receiver design. Visualizing the optimal decision boundaries allows one to show the non linear effect induced by impulsive noise models, which explains the significant loss in receiver performance designed under the standard Gaussian approximation. This motivates the need to develop new receivers. We propose a framework to design receivers robust to a variety of interference types, both Gaussian and non-Gaussian. We explore three ways of thinking about such receiver designs: a linear approach; by approximating the noise plus interference distribution; and by mimicking the decision rule distribution directly. Except for the linear approach, the other designs are capable of replicating the non-trivial optimal decision regions to different extents. The new detection algorithms are evaluated via Monte Carlo simulations. We focus on four efficient architectures, including the parameter estimations: Myriad, Normal Inverse Gaussian, p-norm and a direct estimation of the likelihood ratio function. They exhibit good performance, close to the optimal, in a large range of situations demonstrating they may be considered as robust decision rules in the presence of heavy tailed or impulsive interference environments.","authors":["Laurent Clavier","Gareth Peters","François Septier","Ido Nevat"],"meta":["January 2021EURASIP Journal on Wireless Communications and Networking 2021(1)","DOI:10.1186/s13638-020-01868-1"],"references":["334487125_Copula-Based_Interference_Models_for_IoT_Wireless_Networks","327290837_Dynamic_Interference_for_Uplink_SCMA_in_Large-Scale_Wireless_Networks_without_Coordination","320212274_On_the_performance_of_the_energy_detector_subject_to_impulsive_noise_in_k_-_m_a_-_m_and_e_-_m_fading_channels","335495433_Non-Orthogonal_Contention-Based_Access_for_URLLC_Devices_with_Frequency_Diversity","331998612_Robust_and_Simple_Log-Likelihood_Approximation_for_Receiver_Design","330272454_Blind_Estimation_of_an_Approximated_Likelihood_Ratio_in_Impulsive_Environment","325053114_Blind_Digital_Modulation_Identification_for_MIMO_Systems_in_Railway_Environments_With_High-Speed_Channels_and_Impulsive_Noise","322514978_Wireless_Communication_in_Dynamic_Interference","318810630_An_impulsive_noise_resistant_physical_layer_for_smart_grid_communications","318810501_Performance_analysis_of_convolutional_codes_over_the_Bernoulli-Gaussian_impulsive_noise_channel"]}