{"id":"348696614_Onshore_flow_characteristics_of_the_1755_CE_Lisbon_tsunami_Linking_forward_and_inverse_numerical_modeling","abstract":"The 1755 CE Lisbon earthquake triggered the largest historical tsunami ever impacting the Atlantic coasts of Europe. Despite recent efforts to better understand this event, there are still unanswered questions about the location of its epicenter and whether physical and historical evidences are in agreement.\nInverse modeling using tsunami sediments can be applied to quantify onshore flow characteristics. Forward numerical modeling is also a powerful tool capable of simulating tsunami hydrodynamics and the induced sediment transport. This work presents novel results from a combination of inverse and forward modeling to assess tsunami characteristics onshore. The study site is located on the Portuguese southern coast, at the Salgados lowland where inverse modeling was performed using TsuSedMod (Jaffe and Gelfenbaum, 2007) based on data retrieved from sediment samples. Forward modeling, including tsunami generation and propagation, was performed using the FLOW module of Delft3D suite model. Onshore topography was corrected for the 1755 CE scenario based on extensive tsunami sedimentary deposit thickness data. The tsunami source was chosen based on recent results from the authors that pointed to a good correlation between modeled and field tsunami data for the Marques de Pombal Fault (MPF), Horseshoe Fault (HSF) and a hypothetical scenario represented by a simple combination between Gorringe Bank and Horseshoe Fault (Scenario 1 - SC1).\nResults from inverse model show tsunami onshore average speed varying from 7.3 up to 9.3 m/s and shear velocities from 0.52 up to 0.66 m/s. Forward modeling results show a wide variation according to the seismic source and tsunami onshore velocities can range from around 7 m/s when considering MPF to even an absence of inundation (SC1). The good agreement between both modeling approaches estimating tsunami velocity confirms the potential of numerical modeling coupled with geological records to improve the understanding of historical events.","authors":["Ivana Bosnic","Pedro Costa","Francisco Dourado","SeanPaul La Selle"],"meta":["January 2021Marine Geology 434(11):106432","DOI:10.1016/j.margeo.2021.106432"],"references":["341875287_Maximal_Heights_of_Nearshore_Storm_Waves_and_Resultant_Onshore_Flow_Velocities","338807822_Can_the_tsunami_geological_record_contribute_to_constrain_the_tectonic_source_of_the_1755_AD_earthquake","334081042_Numerical_simulations_of_the_2004_Indian_Ocean_tsunami_deposits'_thicknesses_and_emplacements","326959399_Development_and_application_of_a_tsunami_fragility_curve_of_the_2015_tsunami_in_Coquimbo_Chile","316262911_High_resolution_geochemical_and_grain-size_analysis_of_the_AD_1755_tsunami_deposit_Insights_on_the_inland_extent_and_inundation_phases","280590146_A_model_for_tsunami_flow_inversion_from_deposits_TSUFLIND","276089082_On_the_Need_for_Larger_Manning's_Roughness_Coefficients_in_Depth-Integrated_Tsunami_Inundation_Models","320473967_Inverse_tsunami_flow_modeling_including_non-equilibrium_sediment_transport_with_application_to_deposits_from_the_2011_Tohoku-Oki_Tsunami_Inverse_Calculation_from_Tsunami_Deposit","304024324_How_did_the_AD_1755_tsunami_impact_on_sand_barriers_across_the_southern_coast_of_Portugal","300754470_EXPLORING_HYBRID_MODELING_OF_TSUNAMI_FLOW_AND_DEPOSIT_CHARACTERISTICS"]}