{"id":"348637244_Diskussionsbeitrag_Handreichung_zur_Rezension_von_Forschungssoftware_in_der_Archaologie_und_den_Altertumswissenschaften","abstract":"Motivated by numerous discussions around the increasing use of research software in the field of archaeology, this article outlines the aspects for its review. The evaluation of software is a complex topic, since its field of application and development context has a\nconsiderable influence. In addition, there are many very different use cases, ranging from students wanting a quick solution for an exercise\nto project developers, which have to integrate a software package into an existing infrastructure for continuous operation. Although this first\nversion of an impulse is based on equal contributions from archaeology and applied computer science, the focus is on evaluation criteria of\nsoftware in the field of archaeology. A major goal of this impulse is to sensitize future reviewers to the complexity of software evaluation. A\nsoftware review should enable the archaeological professional audience to make a quick, critical and – also towards the developers – fair\nassessment of software. Priority recommendations include a description of the context in which the review was written and the requirements for specific use cases. In addition, a short tabular overview should enable a quick assessment of the technical, financial and legal\naspects. The need for future adaptations of this guideline was already identified during its development since both software development\nand its evaluation in the digital age are expected to remain very dynamic.","authors":["Timo Homburg","anne klammt","Hubert Mara","clemens schmid"],"meta":["May 2021","DOI:10.11588/ai.2020.1.81422","Projects: Semantic Modelling @ Scientific ITResearch Squirrel Engineers"],"references":["340956758_An_environment_for_sustainable_research_software_in_Germany_and_beyond_current_state_open_challenges_and_call_for_action","338866375_Tool-Driven_Revolutions_in_Archaeological_Science","337239404_Towards_FAIR_principles_for_research_software","324451280_Open_Science_Training_Handbook","311704760_Software_vs_data_in_the_context_of_citation","298345883_The_FAIR_Guiding_Principles_for_scientific_data_management_and_stewardship"]}