{"id":"348605584_A_Study_on_Classification_Techniques_based_on_Opinions","abstract":"Sentiment analysis or opinion mining is one of the considerable undertakings of Natural Language Processing. Sentiment analysis is a quick-growing investigation area in computer science. It includes a way of improvement for the collection and assessment of comments or opinions about legislation, laws, and opinions of products, and so forth, which are posted on the internet. Opinion mining analyzes the opinions given by people. In sentiment analysis, the customer feedback, review, shopping site review, online purchase reviews, politics opinions are considered for the analysis. Sentiment analysis is about detecting the emotions i.e. sad, happy, angry, excited, etc. The main objective of opinion mining is characterizing what the public think and comment. This review paper features certain discussions concerning the opinion-based classification and used approaches for the extraction of feeling assessment and opinion mining. Paper presents a comparison between different classification techniques. Applications and challenges of opinion mining are also discussed in this paper.","authors":["Bhukal Pooja","Jaswinder Singh"],"meta":["January 2021IOP Conference Series Materials Science and Engineering 1022(1):012091","DOI:10.1088/1757-899X/1022/1/012091"],"references":["343385414_A_Primer_on_Opinion_Mining_The_Growing_Research_Area","330337380_Sentiment_Analysis_of_Polarity_in_Product_Reviews_In_Social_Media","325984199_Sentiment_analysis_of_smart_phone_product_review_using_SVM_classification_technique","321135694_Aspect_Based_Sentiment_Analysis_Using_R_Programming","320651682_Opinion_mining_and_sentiment_classification_A_review","336789523_Sentiment_Analysis_of_Product_Reviews_using_Naive_Bayes_Algorithm_A_Case_Study","334994615_Product_Quality_Assessment_using_Opinion_Mining_in_Persian_Online_Shopping","333152142_Sentiment_Analysis_of_Customer_Reviews_Using_Ensemble_Method","322876021_Aspects_based_opinion_mining_from_online_reviews_for_product_recommendation","320252311_Mining_Target_Opinions_from_Online_Reviews_Using_Semi-supervised_Word_Alignment_Model"]}