{"id":"348682292_Stacked_Autoencoders_Driven_by_Semi-Supervised_Learning_for_Building_Extraction_from_near_Infrared_Remote_Sensing_Imagery","abstract":"In this paper, we propose a Stack Auto-encoder (SAE)-Driven and Semi-Supervised (SSL)-Based Deep Neural Network (DNN) to extract buildings from relatively low-cost satellite near infrared images. The novelty of our scheme is that we employ only an extremely small portion of labeled data for training the deep model which constitutes less than 0.08% of the total data. This way, we significantly reduce the manual effort needed to complete an annotation process, and thus the time required for creating a reliable labeled dataset. On the contrary, we apply novel semi-supervised techniques to estimate soft labels (targets) of the vast amount of existing unlabeled data and then we utilize these soft estimates to improve model training. Overall, four SSL schemes are employed, the Anchor Graph, the Safe Semi-Supervised Regression (SAFER), the Squared-loss Mutual Information Regularization (SMIR), and an equal importance Weighted Average of them (WeiAve). To retain only the most meaning information of the input data, labeled and unlabeled ones, we also employ a Stack Autoencoder (SAE) trained under an unsupervised manner. This way, we handle noise in the input signals, attributed to dimensionality redundancy, without sacrificing meaningful information. Experimental results on the benchmarked dataset of Vaihingen city in Germany indicate that our approach outperforms all state-of-the-art methods in the field using the same type of color orthoimages, though the fact that a limited dataset is utilized (10 times less data or better, compared to other approaches), while our performance is close to the one achieved by high expensive and much more precise input information like the one derived from Light Detection and Ranging (LiDAR) sensors. In addition, the proposed approach can be easily expanded to handle any number of classes, including buildings, vegetation, and ground.","authors":["Eftychios Protopapadakis","Anastasios Doulamis","Nikolaos Doulamis","Evangelos Maltezos"],"meta":["January 2021Remote Sensing 13(3):371","DOI:10.3390/rs13030371"],"references":["336765598_Individual_Vacant_House_Detection_in_Very-High-Resolution_Remote_Sensing_Images","335874404_Unsupervised_Automatic_Building_Extraction_Using_Active_Contour_Model_on_Unregistered_Optical_Imagery_and_Airborne_LiDAR_Data","333655361_BUILDING_DETECTION_FROM_LiDAR_DATA_USING_ENTROPY_AND_THE_K-MEANS_CONCEPT","332604459_A_Building_Detection_Method_Based_on_Semi-suppressed_Fuzzy_C-means_and_Restricted_Region_Growing_Using_Airborne_LiDAR","332555396_Automatic_building_extraction_from_high-resolution_aerial_images_and_LiDAR_data_using_gated_residual_refinement_network","328833342_Building_Extraction_in_Very_High_Resolution_Imagery_by_Dense-Attention_Networks","327804991_Tensor-Based_Nonlinear_Classifier_for_High-Order_Data_Analysis","337521462_Domain_Adaptation_for_Semantic_Segmentation_Using_Convolutional_Neural_Networks","335531017_Power_Quality_Disturbances_Recognition_Using_Modified_S_Transform_and_Parallel_Stack_Sparse_Auto-encoder","327720772_Understanding_Historical_Cityscapes_from_Aerial_Imagery_through_Machine_Learning"]}