{"id":"348615080_Forecast_of_Freight_Volume_in_Xi'an_Based_on_Gray_GM_1_1_Model_and_Markov_Forecasting_Model","abstract":"Due to the continuous improvement of productivity, the transportation demand of freight volume is also increasing. It is difficult to organize freight transportation efficiently when the freight volume is quite large. Therefore, predicting the total amount of goods transported is essential in order to ensure efficient and orderly transportation. Aiming at optimizing the forecast of freight volume, this paper predicts the freight volume in Xi’an based on the Gray GM (1, 1) model and Markov forecasting model. Firstly, the Gray GM (1, 1) model is established based on related freight volume data of Xi’an from 2000 to 2008. Then, the corresponding time sequence and expression of restore value of Xi’an freight volume can be attained by determining parameters, so as to obtain the gray forecast values of Xi’an’s freight volume from 2009 to 2013. In combination with the Markov chain process, the random sequence state is divided into three categories. By determining the state transition probability matrix, the probability value of the sequence in each state and the predicted median value corresponding to each state can be obtained. Finally, the revised predicted values of the freight volume based on the Gray–Markov forecasting model in Xi’an from 2009 to 2013 are calculated. It is proved in theory and practice that the Gray–Markov forecasting model has high accuracy and can provide relevant policy bases for the traffic management department of Xi’an.","authors":["Fan Yang","Xiaoying Tang","Yingxin Gan","Xindan Zhang"],"meta":["January 2021Journal of Mathematics 2021(1):1-6","DOI:10.1155/2021/6686786"],"references":["344877912_A_Computing_Model_for_Quantifying_the_Value_of_Structural_Health_Monitoring_Information_in_Bridge_Engineering","344627097_Evolutionary_Game_Simulation_on_Government_Incentive_Strategies_of_Prefabricated_Construction_A_System_Dynamics_Approach","344372467_A_Comprehensive_Assessment_Approach_for_Water-Soil_Environmental_Risk_during_Railway_Construction_in_Ecological_Fragile_Region_Based_on_AHP_and_MEA","333793485_Metro_Passenger_Flow_Forecast_with_a_Novel_Markov-Grey_Model","329133306_Forecasting_Short-Term_Passenger_Flow_An_Empirical_Study_on_Shenzhen_Metro","324822083_Railway_freight_traffic_volume_using_an_ensemble_model_with_optimized_deep_belief_network","322868964_Prediction_model_for_railway_freight_volume_with_GCA-genetic_algorithm-generalized_neural_network_empirical_analysis_of_China","314256005_A_new_belief_Markov_chain_model_and_its_application_in_inventory_prediction","320845661_Prediction_Method_of_Railway_Freight_Volume_Based_on_Genetic_Algorithm_Improved_General_Regression_Neural_Network","318665382_Revenue_Management_Under_the_Markov_Chain_Choice_Model"]}