{"id":"348654152_A_deep_learning_based_framework_for_the_registration_of_three_dimensional_multi-modal_medical_images_of_the_head","abstract":"Image registration is a fundamental task in image analysis in which the transform that moves the coordinate system of one image to another is calculated. Registration of multi-modal medical images has important implications for clinical diagnosis, treatment planning, and image-guided surgery as it provides the means of bringing together complimentary information obtained from different image modalities. However, since different image modalities have different properties due to their different acquisition methods, it remains a challenging task to find a fast and accurate match between multi-modal images. Furthermore, due to reasons such as ethical issues and need for human expert intervention, it is difficult to collect a large database of labelled multi-modal medical images. In addition, manual input is required to determine the fixed and moving images as input to registration algorithms. In this paper, we address these issues and introduce a registration framework that (1) creates synthetic data to augment existing datasets, (2) generates ground truth data to be used in the training and testing of algorithms, (3) registers (using a combination of deep learning and conventional machine learning methods) multi-modal images in an accurate and fast manner, and (4) automatically classifies the image modality so that the process of registration can be fully automated. We validate the performance of the proposed framework on CT and MRI images of the head obtained from a publicly available registration database.","authors":["Kh Tohidul Islam","Sudanthi Wijewickrema","Stephen O'Leary"],"meta":["January 2021Scientific Reports 11(1):1860","DOI:10.1038/s41598-021-81044-7"],"references":["345338285_Data_Augmentation_Method_by_Applying_Color_Perturbation_of_Inverse_PSNR_and_Geometric_Transformations_for_Object_Recognition_Based_on_Deep_Learning","342016768_Learning-Based_Affine_Registration_of_Histological_Images","341138772_Parkinson's_Disease_EMG_Data_Augmentation_and_Simulation_with_DCGANs_and_Style_Transfer","338898059_Deep_learning_in_medical_image_registration_a_survey","343277942_Medical_image_registration_using_deep_neural_networks_A_comprehensive_review","342333414_Data_Augmentation_Method_for_Improving_the_Accuracy_of_Human_Pose_Estimation_with_Cropped_Images","341826341_3DSymm_Robust_and_Accurate_3D_Reflection_Symmetry_Detection","341083949_ROIMIX_Proposal-Fusion_Among_Multiple_Images_for_Underwater_Object_Detection","337382888_Training_Data_Independent_Image_Registration_Using_Generative_Adversarial_Networks_And_Domain_Adaptation","337203072_Ischemic_stroke_segmentation_in_multi-sequence_MRI_by_symmetry_determined_superpixel_based_hierarchical_clustering"]}