{"id":"348693167_Automatic_verification_of_concurrent_stochastic_systems","abstract":"Automated verification techniques for stochastic games allow formal reasoning about systems that feature competitive or collaborative behaviour among rational agents in uncertain or probabilistic settings. Existing tools and techniques focus on turn-based games, where each state of the game is controlled by a single player, and on zero-sum properties, where two players or coalitions have directly opposing objectives. In this paper, we present automated verification techniques for concurrent stochastic games (CSGs), which provide a more natural model of concurrent decision making and interaction. We also consider (social welfare) Nash equilibria, to formally identify scenarios where two players or coalitions with distinct goals can collaborate to optimise their joint performance. We propose an extension of the temporal logic rPATL for specifying quantitative properties in this setting and present corresponding algorithms for verification and strategy synthesis for a variant of stopping games. For finite-horizon properties the computation is exact, while for infinite-horizon it is approximate using value iteration. For zero-sum properties it requires solving matrix games via linear programming, and for equilibria-based properties we find social welfare or social cost Nash equilibria of bimatrix games via the method of labelled polytopes through an SMT encoding. We implement this approach in PRISM-games, which required extending the tool’s modelling language for CSGs, and apply it to case studies from domains including robotics, computer security and computer networks, explicitly demonstrating the benefits of both CSGs and equilibria-based properties.","authors":["Marta Kwiatkowska","Gethin Norman","David Parker","Gabriel Santos"],"meta":["January 2021Formal Methods in System Design","DOI:10.1007/s10703-020-00356-y"],"references":["342970163_PRISM-games_30_Stochastic_Game_Verification_with_Concurrency_Equilibria_and_Time","341650538_Approximating_Values_of_Generalized-Reachability_Stochastic_Games","327970322_EVE_A_Tool_for_Temporal_Equilibrium_Analysis_16th_International_Symposium_ATVA_2018_Los_Angeles_CA_USA_October_7-10_2018_Proceedings","326581635_Rational_quantum_secret_sharing","326188789_Evolution_of_cooperation_in_stochastic_games","324536195_Value_Iteration_for_Simple_Stochastic_Games_Stopping_Criterion_and_Learning_Algorithm","346022098_Multi-player_Equilibria_Verification_for_Concurrent_Stochastic_Games","342486377_Automated_temporal_equilibrium_analysis_Verification_and_synthesis_of_multi-player_games","335984312_Equilibria-Based_Probabilistic_Model_Checking_for_Concurrent_Stochastic_Games","327031461_Automated_Verification_of_Concurrent_Stochastic_Games_15th_International_Conference_QEST_2018_Beijing_China_September_4-7_2018_Proceedings"]}