{"id":"348676360_Investigating_efficient_CNN_architecture_for_multiple_sclerosis_lesion_segmentation","abstract":"Purpose: The automatic segmentation of multiple sclerosis lesions in magnetic resonance imaging has the potential to reduce radiologists' efforts on a daily time-consuming task and to bring more reproducibility. Almost all new segmentation techniques make use of convolutional neural networks with their own different architecture. Architectural choices are rarely explained. We aimed at presenting the relevance of a U-net-like architecture for our specific task and at building an efficient and simple model. Approach: An experimental study was performed by observing the impact of applying different mutations and deletions to a simple U-net-like architecture. Results: The power of the U-net architecture is explained by the joint benefits of using an encoder-decoder architecture and by linking them with long skip connections. Augmenting the number of convolutional layers and decreasing the number of feature maps allowed us to build an exceptionally light and competitive architecture, the minimally parameterized U-net (MPU-net), with only \n\n∼\n30,000\n\nparameters. Conclusion: The empirical study of the U-net has led to a better understanding of its architecture. It has guided the building of the MPU-net, a model far less parameterized than others (at least by a factor of seven). This neural network achieves a human-level segmentation of multiple sclerosis lesions on fluid-attenuated inversion recovery images only. It shows that this segmentation task does not necessitate overly complicated models to be achieved. This gives the opportunity to build more explainable models that can help such methods to be adopted in a clinical environment.","authors":["Alexandre Fenneteau","Pascal Bourdon","David Helbert","Christine Fernandez-Maloigne"],"meta":["February 2021Journal of Medical Imaging 8(01)","DOI:10.1117/1.JMI.8.1.014504"],"references":["348462814_Simultaneous_lesion_and_brain_segmentation_in_multiple_sclerosis_using_deep_neural_networks","335667303_Uncovering_convolutional_neural_network_decisions_for_diagnosing_multiple_sclerosis_on_conventional_MRI_using_layer-wise_relevance_propagation","332175623_Multi-branch_convolutional_neural_network_for_multiple_sclerosis_lesion_segmentation","330538333_Global_regional_and_national_burden_of_multiple_sclerosis_1990-2016_a_systematic_analysis_for_the_Global_Burden_of_Disease_Study_2016","329552979_One-shot_domain_adaptation_in_multiple_sclerosis_lesion_segmentation_using_convolutional_neural_networks","327709435_Peeking_Inside_the_Black-Box_A_Survey_on_Explainable_Artificial_Intelligence_XAI","339094860_Cross_Attention_Densely_Connected_Networks_for_Multiple_Sclerosis_Lesion_Segmentation","335708892_Towards_Explainable_Artificial_Intelligence","330475106_MS-GAN_GAN-Based_Semantic_Segmentation_of_Multiple_Sclerosis_Lesions_in_Brain_Magnetic_Resonance_Imaging","328114822_Survey_of_automated_multiple_sclerosis_lesion_segmentation_techniques_on_magnetic_resonance_imaging"]}