{"id":"348771602_Developing_a_Digital_Twin_and_Digital_Thread_Framework_for_an_'Industry_40'_Shipyard","abstract":"This paper provides an overview of the current state-of-the-art digital twin and digital thread technology in industrial operations. Both are transformational technologies that have the advantage of improving the efficiency of current design and manufacturing. Digital twin is an important element of the Industry 4.0 digitalization process; however, the huge amount of data that are generated and collected by a digital twin offer challenges in handling, processing and storage. The paper aims to report on the development of a new framework that combines the digital twin and digital thread for better data management in order to drive innovation, improve the production process and performance and ensure continuity and traceability of information. The digital twin/thread framework incorporates behavior simulation and physical control components, in which these two components rely on the connectivity between the twin and thread for information flow and exchange to drive innovation. The twin/thread framework encompasses specifications that include organizational architecture layout, security, user access, databases and hardware and software requirements. It is envisaged that the framework will be applicable to enhancing the optimization of operational processes and traceability of information in the physical world, especially in an Industry Shipyard 4.0.","authors":["Toh Yen Pang","Juan D. Pelaez Restrepo","Chi-Tsun Cheng","Alim Yasin"],"meta":["January 2021Applied Sciences 11(3):1097","DOI:10.3390/app11031097"],"references":["341542060_A_digital_supply_chain_twin_for_managing_the_disruption_risks_and_resilience_in_the_era_of_Industry_40","341133360_Digital_twin-based_sustainable_intelligent_manufacturing_a_review","340797607_Digital_twin_current_scenario_and_a_case_study_on_a_manufacturing_process","340455863_Digital_Twin_Models_in_Industrial_Operations_A_Systematic_Literature_Review","340234659_Towards_a_semantic_Construction_Digital_Twin_Directions_for_future_research","339802823_Characterising_the_Digital_Twin_A_systematic_literature_review","337876828_Shipbuilding_40_Index_Approaching_Supply_Chain","345078627_Digital_Twin_in_Industry_State-of-the-Art","339555625_A_Novel_Approach_to_Product_Lifecycle_Management_and_Engineering_Using_Behavioural_Models_for_the_Conceptual_Design_Phase","339553798_Practical_Implementation_of_Industry_40_Based_on_Open_Access_Tools_and_Technologies"]}