{"id":"348758575_Layerwise_learning_for_quantum_neural_networks","abstract":"With the increased focus on quantum circuit learning for near-term applications on quantum devices, in conjunction with unique challenges presented by cost function landscapes of parametrized quantum circuits, strategies for effective training are becoming increasingly important. In order to ameliorate some of these challenges, we investigate a layerwise learning strategy for parametrized quantum circuits. The circuit depth is incrementally grown during optimization, and only subsets of parameters are updated in each training step. We show that when considering sampling noise, this strategy can help avoid the problem of barren plateaus of the error surface due to the low depth of circuits, low number of parameters trained in one step, and larger magnitude of gradients compared to training the full circuit. These properties make our algorithm preferable for execution on noisy intermediate-scale quantum devices. We demonstrate our approach on an image-classification task on handwritten digits, and show that layerwise learning attains an 8% lower generalization error on average in comparison to standard learning schemes for training quantum circuits of the same size. Additionally, the percentage of runs that reach lower test errors is up to 40% larger compared to training the full circuit, which is susceptible to creeping onto a plateau during training.","authors":["Andrea Skolik","Jarrod R. Mcclean","M. Mohseni","Patrick van der Smagt"],"meta":["June 2021Quantum Machine Intelligence 3(1)","DOI:10.1007/s42484-020-00036-4"],"references":["346515701_Sequential_minimal_optimization_for_quantum-classical_hybrid_algorithms","338949946_Decoding_quantum_errors_with_subspace_expansions","338561090_Variational_quantum_unsampling_on_a_quantum_photonic_processor","337846240_An_initialization_strategy_for_addressing_barren_plateaus_in_parametrized_quantum_circuits","336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","335412116_Quantum_convolutional_neural_networks","332088465_Adversarial_quantum_circuit_learning_for_pure_state_approximation","345090550_Accelerated_variational_algorithms_for_digital_quantum_simulation_of_many-body_ground_states","340851681_Training_the_quantum_approximate_optimization_algorithm_without_access_to_a_quantum_processing_unit","331947994_Evaluating_analytic_gradients_on_quantum_hardware"]}