{"id":"348799269_Deep_Learning_for_Person_Re-identification_A_Survey_and_Outlook","abstract":"Person re-identification (Re-ID) aims at retrieving a person of interest across multiple non-overlapping cameras. With the advancement of deep neural networks and increasing demand of intelligent video surveillance, it has gained significantly increased interest in the computer vision community. By dissecting the involved components in developing a person Re-ID system, we categorize it into the closed-world and open-world settings. We first conduct a comprehensive overview with in-depth analysis for closed-world person Re-ID from three different perspectives, including deep feature representation learning, deep metric learning and ranking optimization. With the performance saturation under closed-world setting, the research focus for person Re-ID has recently shifted to the open-world setting, facing more challenging issues. This setting is closer to practical applications under specific scenarios. We summarize the open-world Re-ID in terms of five different aspects. By analyzing the advantages of existing methods, we design a powerful AGW baseline, achieving state-of-the-art or at least comparable performance on twelve datasets for four different Re-ID tasks. Meanwhile, we introduce a new evaluation metric (mINP) for person Re-ID, indicating the cost for finding all the correct matches, which provides an additional criterion to evaluate the Re-ID system. Finally, some important yet under-investigated open issues are discussed.","authors":["Mang Ye","Jianbing Shen","Gaojie Lin","Tao Xiang"],"meta":["January 2021IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99):1-1","DOI:10.1109/TPAMI.2021.3054775"],"references":["351480696_Learning_Person_Re-Identification_Models_From_Videos_With_Weak_Supervision","347544690_Exploiting_Global_Camera_Network_Constraints_for_Unsupervised_Video_Person_Re-Identification","347189021_Interpretable_and_Generalizable_Person_Re-identification_with_Query-Adaptive_Convolution_and_Temporal_Lifting","347032849_Dynamic_Dual-Attentive_Aggregation_Learning_for_Visible-Infrared_Person_Re-identification","346765289_Multiple_Expert_Brainstorming_for_Domain_Adaptive_Person_Re-Identification","346201030_Surpassing_Real-World_Source_Training_Data_Random_3D_Characters_for_Generalizable_Person_Re-Identification","343461560_Hierarchical_Clustering_With_Hard-Batch_Triplet_Loss_for_Person_Re-Identification","343456885_Hi-CMD_Hierarchical_Cross-Modality_Disentanglement_for_Visible-Infrared_Person_Re-Identification","343456678_Momentum_Contrast_for_Unsupervised_Visual_Representation_Learning","343454357_Style_Normalization_and_Restitution_for_Generalizable_Person_Re-Identification"]}