{"id":"348769147_Activity_Recognition_for_Ambient_Assisted_Living_with_Videos_Inertial_Units_and_Ambient_Sensors","abstract":"Worldwide demographic projections point to a progressively older population. This fact has fostered research on Ambient Assisted Living, which includes developments on smart homes and social robots. To endow such environments with truly autonomous behaviours, algorithms must extract semantically meaningful information from whichever sensor data is available. Human activity recognition is one of the most active fields of research within this context. Proposed approaches vary according to the input modality and the environments considered. Different from others, this paper addresses the problem of recognising heterogeneous activities of daily living centred in home environments considering simultaneously data from videos, wearable IMUs and ambient sensors. For this, two contributions are presented. The first is the creation of the Heriot-Watt University/University of Sao Paulo (HWU-USP) activities dataset, which was recorded at the Robotic Assisted Living Testbed at Heriot-Watt University. This dataset differs from other multimodal datasets due to the fact that it consists of daily living activities with either periodical patterns or long-term dependencies, which are captured in a very rich and heterogeneous sensing environment. In particular, this dataset combines data from a humanoid robot’s RGBD (RGB + depth) camera, with inertial sensors from wearable devices, and ambient sensors from a smart home. The second contribution is the proposal of a Deep Learning (DL) framework, which provides multimodal activity recognition based on videos, inertial sensors and ambient sensors from the smart home, on their own or fused to each other. The classification DL framework has also validated on our dataset and on the University of Texas at Dallas Multimodal Human Activities Dataset (UTD-MHAD), a widely used benchmark for activity recognition based on videos and inertial sensors, providing a comparative analysis between the results on the two datasets considered. Results demonstrate that the introduction of data from ambient sensors expressively improved the accuracy results.","authors":["Caetano Mazzoni Ranieri","Scott MacLeod","Mauro Dragone","Patricia Amancio Vargas"],"meta":["January 2021Sensors 21(3):768","DOI:10.3390/s21030768"],"references":["341522028_C-MHAD_Continuous_Multimodal_Human_Action_Dataset_of_Simultaneous_Video_and_Inertial_Sensing","340156998_Using_Rough_Sets_to_Improve_Activity_Recognition_Based_on_Sensor_Data","339755127_Recognition_of_Daily_Activities_of_Two_Residents_in_a_Smart_Home_Based_on_Time_Clustering","338402619_Human_Actions_Tracking_and_Recognition_Based_on_Body_Parts_Detection_via_Artificial_Neural_Network","338402536_XXX-X-XXXX-XXXX-XXXXX00_C20XX_IEEE_Wearable_Sensors_for_Activity_Analysis_using_SMO-_based_Random_Forest_over_Smart_home_and_Sports_Datasets","337921090_Wearable_sensors_based_human_behavioral_pattern_recognition_using_statistical_features_and_reweighted_genetic_algorithm","347019617_Uncovering_Human_Multimodal_Activity_Recognition_with_a_Deep_Learning_Approach","340888770_New_Efficiency_Introducing_Social_Assistive_Robots_in_Social_Eldercare_Organizations","339657190_Temporal_Approaches_for_Human_Activity_Recognition_Using_Inertial_Sensors","338552605_A_multimodal_approach_for_human_activity_recognition_based_on_skeleton_and_RGB_data"]}