{"id":"348772033_Myocardial_Function_Imaging_in_Echocardiography_Using_Deep_Learning","abstract":"Deformation imaging in echocardiography has been shown to have better diagnostic and prognostic value than conventional anatomical measures such as ejection fraction. However, despite clinical availability and demonstrated efficacy, everyday clinical use remains limited at many hospitals. The reasons are complex, but practical robustness has been questioned, and a large inter-vendor variability has been demonstrated. In this work, we propose a novel deep learning based framework for motion estimation in echocardiography, and use this to fully automate myocardial function imaging. A motion estimator was developed based on a PWC-Net architecture, which achieved an average end point error of (0.06±0.04) mm per frame using simulated data from an open access database, on par or better compared to previously reported state of the art. We further demonstrate unique adaptability to image artifacts such as signal dropouts, made possible using trained models that incorporate relevant image augmentations. Further, a fully automatic pipeline consisting of cardiac view classification, event detection, myocardial segmentation and motion estimation was developed and used to estimate left ventricular longitudinal strain in vivo. The method showed promise by achieving a mean deviation of (-0.7 ± 1.6)% compared to a semi-automatic commercial solution for N = 30 patients with relevant disease, within the expected limits of agreement. We thus believe that learning-based motion estimation can facilitate extended use of strain imaging in clinical practice.","authors":["Andreas Ostvik","Ivar Mjåland Salte","Erik Smistad","Thuy Mi Nguyen"],"meta":["January 2021IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2021.3054566"],"references":["340115724_MaskFlownet_Asymmetric_Feature_Matching_With_Learnable_Occlusion_Mask","339978891_Real-Time_Automatic_Ejection_Fraction_and_Foreshortening_Detection_Using_Deep_Learning","337935810_Machine_Learning_Approaches_for_Myocardial_Motion_and_Deformation_Analysis","332058264_Myocardial_strain_imaging_Review_of_general_principles_validation_and_sources_of_discrepancies","339542853_A_pilot_study_on_convolutional_neural_networks_for_motion_estimation_from_ultrasound_images","338506761_Iterative_Residual_Refinement_for_Joint_Optical_Flow_and_Occlusion_Estimation","336579626_Segmentation_of_apical_long_axis_four-and_two-chamber_views_using_deep_neural_networks","331847577_Detection_of_Cardiac_Events_in_Echocardiography_Using_3D_Convolutional_Recurrent_Neural_Networks","331292301_Deep_Learning_for_Segmentation_Using_an_Open_Large-Scale_Dataset_in_2D_Echocardiography","330561284_Models_Matter_So_Does_Training_An_Empirical_Study_of_CNNs_for_Optical_Flow_Estimation"]}