{"id":"348746102_Hypomimia_in_Parkinson's_Disease_What_Is_It_Telling_Us","abstract":"Introduction: Amimia is one of the most typical features of Parkinson's disease (PD). However, its significance and correlation with motor and nonmotor symptoms is unknown. The aim of this study is to evaluate the association between amimia and motor and nonmotor symptoms, including cognitive status, depression, and quality of life in PD patients. We also tested the blink rate as a potential tool for objectively measuring upper facial bradykinesia.\nMethods: We prospectively studied amimia in PD patients. Clinical evaluation was performed using the Unified Parkinson's Disease Rating Scale (UPDRS) and timed tests. Cognitive status, depression, and quality of life were assessed using the Parkinson's Disease Cognitive Rating Scale (PD-CRS), the 16-Item Quick Inventory of Depressive Symptomatology (QIDS-SR16), and the PDQ-39, respectively. Amimia was clinically evaluated according to item 19 of UPDRS III. Finally, we studied upper facial amimia by measuring resting blink frequency and blink rate during spontaneous conversation.\nResults: We included 75 patients. Amimia (item 19 UPDRS III) correlated with motor and total UPDRS (r: 0.529 and 0.551 Spearman), and its rigidity, distal bradykinesia, and motor axial subscores (r: 0.472; r: 0.252, and r: 0.508, respectively); Hoehn and Yahr scale (r: 0.392), timed tests, gait freezing, cognitive status (r: 0.29), and quality of life (r: 0.268) correlated with amimia. Blinking frequency correlated with amimia (measured with item 19 UPDRS), motor and total UPDRS.\nConclusion: Amimia correlates with motor (especially axial symptoms) and cognitive situations in PD. Amimia could be a useful global marker of overall disease severity, including cognitive decline.","authors":["Teresa Maycas-Cepeda","Pedro López-Ruiz","Cici Feliz Feliz","Lidia Gómez-Vicente"],"meta":["January 2021Frontiers in Neurology 11:603582","DOI:10.3389/fneur.2020.603582","Project: Unusual Movement Disorders"],"references":["343169850_Hypomimia_in_Parkinson's_disease_an_axial_sign_responsive_to_levodopa","332806848_Axial_symptoms_predict_mortality_in_patients_with_Parkinson_disease_and_subthalamic_stimulation","323370024_Facial_emotion_recognition_in_Parkinson's_disease_A_review_and_new_hypotheses","312182572_Facial_Emotion_Recognition_and_Expression_in_Parkinson's_Disease_An_Emotional_Mirror_Mechanism","304705908_A_prospective_study_of_freezing_of_gait_with_early_Parkinson_disease_in_Chinese_patients","265255771_Psychometric_properties_of_the_self-report_version_of_the_Quick_Inventory_of_Depressive_Symptoms_QIDS-SR","341383102_Association_Between_Hypomimia_and_Mild_Cognitive_Impairment_in_De_Novo_Parkinson's_Disease_Patients","333293300_Evolution_of_prodromal_Parkinson's_disease_and_dementia_with_Lewy_bodies_A_prospective_study","321148308_Predicting_the_onset_of_freezing_of_gait_A_longitudinal_study_Anxiety_is_a_Predictor_of_Fog_Onset","288604661_Accuracy_of_clinical_diagnosis_of_idiopathic_Parkinson's_disease_A_clinico-pathological_study_of_100_cases"]}