{"id":"348736244_Generating_geologically_realistic_3D_reservoir_facies_models_using_deep_learning_of_sedimentary_architecture_with_generative_adversarial_networks","abstract":"This paper proposes a novel approach for generating 3-dimensional complex geological facies models based on deep genera-tive models. It can reproduce a wide range of conceptual geological models while possessing the flexibility necessary to honor constraints such as well data. Compared with existing geostatistics-based modeling methods, our approach produces realistic subsurface facies architecture in 3D using a state-of-the-art deep learning method called generative adversarial networks (GANs). GANs couple a generator with a discriminator, and each uses a deep convolutional neural network. The networks are trained in an adversarial manner until the generator can create \"fake\" images that the discriminator cannot distinguish from \"real\" images. We extend the original GAN approach to 3D geological modeling at the reservoir scale. The GANs are trained using a library of 3D facies models. Once the GANs have been trained, they can generate a variety of geologically realistic facies models constrained by well data interpretations. This geomodelling approach using GANs has been tested on models of both complex fluvial depositional systems and carbonate reservoirs that exhibit progradational and aggrada-tional trends. The results demonstrate that this deep learning-driven modeling approach can capture more realistic facies architectures and associations than existing geostatistical modeling methods, which often fail to reproduce heterogeneous nonstationary sedimentary facies with apparent depositional trend.","authors":["Tuanfeng Zhang","Peter Tilke","Emilien Dupont","Lingchen Zhu"],"meta":["June 2019Petroleum Science 16(3):541-549","DOI:10.1007/s12182-019-0328-4","Projects: petroleum geology and geophysics、petroleum engineering and mechanics、petrochemistry and chemical engineering、petroleum economics and managementGenerating Realistic Geology Conditioned on Physical Measurements with Generative Adversarial Networks"],"references":["323118679_Generating_Realistic_Geology_Conditioned_on_Physical_Measurements_with_Generative_Adversarial_Networks","321994404_Context-Aware_Semantic_Inpainting","316029770_Reconstruction_of_three-dimensional_porous_media_using_generative_adversarial_neural_networks","305654682_Semantic_Image_Inpainting_with_Perceptual_and_Contextual_Losses","322357133_Training-Image-Based_Geostatistical_Inversion_Using_a_Spatial_Generative_Adversarial_Neural_Network","319770355_Generative_Adversarial_Nets","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","318981527_Parametrization_and_Generation_of_Geological_Models_with_Generative_Adversarial_Networks","311611060_Context_Encoders_Feature_Learning_by_Inpainting","301816789_Context_Encoders_Feature_Learning_by_Inpainting"]}