{"id":"348851156_Mapping_the_space_of_chemical_reactions_using_attention-based_neural_networks","abstract":"Organic reactions are usually assigned to classes containing reactions with similar reagents and mechanisms. Reaction classes facilitate the communication of complex concepts and efficient navigation through chemical reaction space. However, the classification process is a tedious task. It requires identification of the corresponding reaction class template via annotation of the number of molecules in the reactions, the reaction centre and the distinction between reactants and reagents. Here, we show that transformer-based models can infer reaction classes from non-annotated, simple text-based representations of chemical reactions. Our best model reaches a classification accuracy of 98.2%. We also show that the learned representations can be used as reaction fingerprints that capture fine-grained differences between reaction classes better than traditional reaction fingerprints. The insights into chemical reaction space enabled by our learned fingerprints are illustrated by an interactive reaction atlas providing visual clustering and similarity searching. Organic chemical reactions can be divided into classes that allow chemists to use the knowledge they have about optimal conditions for specific reactions in the context of other reactions of similar type. Schwaller et al. present here an efficient method based on transformer neural networks that learns a chemical space in which reactions of a similar class are grouped together.","authors":["Philippe Schwaller","Daniel Probst","Alain C. Vaucher","Vishnu H. Nair"],"meta":["February 2021Nature Machine Intelligence 3(2):1-9","DOI:10.1038/s42256-020-00284-w"],"references":["355901813_Unsupervised_Attention-Guided_Atom-Mapping","346418507_Machine_learning_meets_mechanistic_modelling_for_accurate_prediction_of_experimental_activation_energies","343025654_Automated_extraction_of_chemical_synthesis_actions_from_experimental_procedures","342132582_One_molecular_fingerprint_to_rule_them_all_Drugs_biomolecules_and_the_metabolome","339673653_Predicting_Retrosynthetic_Pathways_using_Transformer-Based_Models_and_a_Hyper-Graph_Exploration_Strategy","339221633_Visualization_of_very_large_high-dimensional_data_sets_as_minimum_spanning_trees","337034210_Datasets_and_their_influence_on_the_development_of_computer_assisted_synthesis_planning_tools_in_the_pharmaceutical_domain","336172941_Neural_Network_Acceptability_Judgments","335884361_Development_and_Application_of_a_Data-Driven_Reaction_Classification_Model_Comparison_of_an_ELN_and_the_Medicinal_Chemistry_Literature","339992483_A_Structure-Based_Platform_for_Predicting_Chemical_Reactivity"]}