{"id":"348805412_Is_Theory_Really_Different_from_Practice_A_Reflection_Further_Explored_Based_on_Expert_Opinion","abstract":"This reflection on \"is theory really different from practice?\" has been explored by taking this question to academicians/theorists, practitioners and students to know what is their stance on it. To complete the study senior level academicians, at least of the rank of Assistant Professor/Senior Lecturer, from four (04) different domains of study, natural science, management science, social science, computer science, students and practitioners from the same domains have been individually inquired through email. Main premise of the reflection was that there was no difference between theory and practice. Main argument to support the premise was that both were same because both feed each other, that theories are actually the captures of practices to be guidance for further practices. A close analysis of all the responses showed that experts have principally supported the premise of the reflection. The study is based on primary data collected through email survey, the thoughts, analysis and findings presented in the paper are original. Analysis is based on the responses of fourteen respondents which limit the generalizability. This offers opportunity to design a future research to get broad based survey. The study has initiated an important debate on the issue of similarity or difference between theory and practice. This emphasizes that practitioners can really benefit from theories in solving their problems.","authors":["Rizwan Sandhu"],"meta":["January 2021"],"references":["275714295_Building_Theory_About_Theory_Building_What_Constitutes_a_Theoretical_Contribution","228145517_What_Makes_Entrepreneurs_Entrepreneurial","324937048_The_Structure_of_Scientific_Revolutions","309311435_What_constitutes_a_theoretical_contribution","276010615_Comments_on_What_Theory_is_Not","265086487_Field_Theory_in_Social_Science_Selected_Theoretical_Papers","248695549_What_Theory_is_Not_Theorizing_Is","240218229_Research_Methods_for_Business_Students"]}