{"id":"348882187_Snapshot_Safari_A_large-scale_collaborative_to_monitor_Africa's_remarkable_biodiversity","abstract":"Nature is experiencing degradation and extinction rates never recorded before in the history of Earth.1,2 Consequently,\ncontinuous large-scale monitoring programmes are critical, not only to provide insights into population trends but\nalso to aid in understanding factors associated with altering population dynamics at various temporal and spatial\nscales.3 Continuous monitoring is important not only for tracking rare or threatened species but also to detect the\nincrease of potentially invasive species4, and the trends in the populations of common species, which in some\nregions are declining even more rapidly than are rare species2.\nThe combination of citizen science and cutting-edge technologies has improved monitoring programmes.5 In\nthis regard, camera traps have become a popular tool to engage with society while obtaining accurate scientific\ndata.3 The importance of advances in technological monitoring has even been highlighted by the United Nations\nEnvironment Programme (UNEP) through the proposed ‘Digital Ecosystem framework’, a complex distributed\nnetwork or interconnected socio-technological system.6\nMonitoring species and ecosystems is critical to Africa – a highly biodiverse continent with numerous mammal\nspecies threatened by human activities such as poaching, overhunting, and climate and land-use change.7 Over half\nthe terrestrial mammals in Africa have experienced range contractions of as much as 80% on average, including\npredator species such as lions (Panthera leo) and large ungulates.2 In sub-Saharan Africa, human impacts are\nprojected to increase, and trigger an increased extinction risk.7 However, information on the conservation status\nof many species is limited, and many areas in Africa lack the baseline biodiversity data necessary to assess the\noutcomes of existing conservation programmes.5 Further, the lack of standardised methods to assess biodiversity\npatterns limits our ability to detect and respond to changes in mammal populations caused by environmental and\nanthropogenic factors.8\nIn attempting to address some of the above challenges, we have formed the Snapshot Safari Network (www.\nsnapshotsafari.org) – a large-scale international camera trap network to study and monitor the diversity and\necological dynamics of southern and eastern African mammals. Snapshot Safari (hereafter Snapshot) is one of the\nlargest camera trap networks in the world. It began in 2010 with a single camera trap grid in Serengeti National Park,\nTanzania9, and the model and protocols have since been expanded in Tanzania as well as into five other countries:\nBotswana, Kenya, Mozambique, South Africa, and Zimbabwe (Figure 1). Participating locations represent a wide\nvariety of habitats, wildlife communities, management types and protected area sizes. Here, we introduce this\nmultidisciplinary initiative which combines citizen science and advanced machine learning techniques for the\nanalysis of millions of animal photographs. We also introduce a set of high priority research questions emanating\nfrom expert consultation in 2019.","authors":["Lain E. Pardo Vargas","Sara Bombaci","Sarah Huebner","Michael J. Somers"],"meta":["January 2021South African Journal of Science 117(1/2)","DOI:10.17159/sajs.2021/8134","Project: Snapshot Safari - South Africa"],"references":["337933460_Pervasive_human-driven_decline_of_life_on_Earth_points_to_the_need_for_transformative_change","337674616_Using_by-catch_data_from_wildlife_surveys_to_quantify_climatic_parameters_and_the_timing_of_phenology_for_plants_and_animals_using_camera_traps","336080706_Wildlife_Insights_A_Platform_to_Maximize_the_Potential_of_Camera_Trap_and_Other_Passive_Sensor_Wildlife_Data_for_the_Planet","331928653_The_Case_for_a_Digital_Ecosystem_for_the_Environment_Bringing_together_data_algorithms_and_insights_for_sustainable_development","330470069_Everyone_counts_Design_considerations_in_online_citizen_science","325771200_Identifying_Drivers_of_Spatial_Variation_in_Occupancy_with_Limited_Replication_Camera_Trap_Data","323240255_Giraffe_bed_and_breakfast_Camera_traps_reveal_Tanzanian_yellow-billed_oxpeckers_roosting_on_their_large_mammalian_hosts","322745706_No_respect_for_apex_carnivores_Distribution_and_activity_patterns_of_honey_badgers_in_the_Serengeti","328128212_Identifying_Animal_Species_in_Camera_Trap_Images_using_Deep_Learning_and_Citizen_Science","319670534_A_'dynamic'_landscape_of_fear_prey_responses_to_spatiotemporal_variations_in_predation_risk_across_the_lunar_cycle"]}