{"id":"348836778_Economic_Games_An_Introduction_and_Guide_for_Research","abstract":"Prosocial behaviors constitute vital ingredients for all types of social interactions and relationships as well as for society at large. Corresponding to this significance, the study of prosocial behaviors has received considerable attention across scientific disciplines. A striking feature of this research is that most disciplines rely on economic games to measure actual prosocial behavior in controlled experimental settings. However, empirical research often fails to fully exploit the richness of this class of paradigms. The current work aims to overcome this issue by providing a theory-driven overview of and introduction to the variety of economic games for researchers in psychology and beyond. Specifically, we introduce prominent theories of games (Game Theory and Interdependence Theory) and show how the concepts from these theories can be integrated in a unifying theoretical framework considering games as providing specific situational affordances for behavior. Additionally, we describe several games in detail, including their structural features, the affordances they involve, the social motives that may guide behavior, the flexibility they entail to manipulate specific situational aspects and, thus, affordances, and typical research findings. We conclude that tailored selection and combination of games and game variants allows to obtain a unique understanding of the underlying psychological processes involved in prosocial behavior. As a practical tool for researchers, we also provide standardized game instructions and guidelines for the implementation of games in future research. Ultimately, the review can foster optimal use of economic games in future work and thereby set the stage for high-class, replicable, and innovative research on human prosociality.","authors":["Isabel Thielmann","Robert Böhm","Marion Ott","Benjamin E Hilbig"],"meta":["May 2021Collabra Psychology 7(1):19004","DOI:10.1525/collabra.19004"],"references":["341943388_Playing_a_different_game_Situation_perception_mediates_framing_effects_on_cooperative_behaviour","337833524_Situational_Affordances_for_Prosocial_Behaviour_On_the_Interaction_Between_Honesty-Humility_and_Perceived_Interdependence","336716710_Personality_and_prosocial_behavior_A_theoretical_framework_and_meta-analysis","332532728_Medical_prescribing_and_antibiotic_resistance_A_game-theoretic_analysis_of_a_potentially_catastrophic_social_dilemma","331647422_Optimising_antibiotic_prescribing_Collective_approaches_to_managing_a_common-pool_resource","331275459_Parochial_vs_universal_cooperation_Introducing_a_novel_economic_game_of_within-_and_between-group_interaction","345671432_Experimental_Games_and_Social_Decision_Making","335129174_Power_Influences_the_Expression_of_Honesty-Humility_The_Power-Exploitation_Affordances_Hypothesis","331442855_Children_use_rules_to_coordinate_in_a_social_dilemma","331203170_On_the_Lack_of_Real_Consequences_in_Consumer_Choice_Research_And_Its_Consequences"]}