{"id":"348888499_General-Purpose_Machine_Learning_Potentials_Capturing_Nonlocal_Charge_Transfer","abstract":"ConspectusThe development of first-principles-quality machine learning potentials (MLP) has seen tremendous progress, now enabling computer simulations of complex systems for which sufficiently accurate interatomic potentials have not been available. These advances and the increasing use of MLPs for more and more diverse systems gave rise to new questions regarding their applicability and limitations, which has constantly driven new developments. The resulting MLPs can be classified into several generations depending on the types of systems they are able to describe. First-generation MLPs, as introduced 25 years ago, have been applicable to low-dimensional systems such as small molecules. MLPs became a practical tool for complex systems in chemistry and materials science with the introduction of high-dimensional neural network potentials (HDNNP) in 2007, which represented the first MLP of the second generation. Second-generation MLPs are based on the concept of locality and express the total energy as a sum of environment-dependent atomic energies, which allows applications to very large systems containing thousands of atoms with linearly scaling computational costs. Since second-generation MLPs do not consider interactions beyond the local chemical environments, a natural extension has been the inclusion of long-range interactions without truncation, mainly electrostatics, employing environment-dependent charges establishing the third MLP generation. A variety of second- and, to some extent, also third-generation MLPs are currently the standard methods in ML-based atomistic simulations.In spite of countless successful applications, in recent years it has been recognized that the accuracy of MLPs relying on local atomic energies and charges is still insufficient for systems with long-ranged dependencies in the electronic structure. These can, for instance, result from nonlocal charge transfer or ionization and are omnipresent in many important types of systems and chemical processes such as the protonation and deprotonation of organic and biomolecules, redox reactions, and defects and doping in materials. In all of these situations, small local modifications can change the system globally, resulting in different equilibrium structures, charge distributions, and reactivity. These phenomena cannot be captured by second- and third-generation MLPs. Consequently, the inclusion of nonlocal phenomena has been identified as a next key step in the development of a new fourth generation of MLPs. While a first fourth-generation MLP, the charge equilibration neural network technique (CENT), was introduced in 2015, only very recently have a range of new general-purpose methods applicable to a broad range of physical scenarios emerged. In this Account, we show how fourth-generation HDNNPs can be obtained by combining the concepts of CENT and second-generation HDNNPs. These new MLPs allow for a highly accurate description of systems where nonlocal charge transfer is important.","authors":["Ko Tsz Wai","Jonas A. Finkler","Stefan Goedecker","Jörg Behler"],"meta":["January 2021Accounts of Chemical Research 54(4)","DOI:10.1021/acs.accounts.0c00689"],"references":["349497715_Fingerprint-Based_Detection_of_Non-Local_Effects_in_the_Electronic_Structure_of_a_Simple_Single_Component_Covalent_System","348518091_A_fourth-generation_high-dimensional_neural_network_potential_with_accurate_electrostatics_including_non-local_charge_transfer","347915508_Multi-scale_approach_for_the_prediction_of_atomic_scale_properties","335087846_Accurate_and_transferable_multitask_prediction_of_chemical_properties_with_an_atoms-in-molecules_neural_network","334490792_An_electrostatic_spectral_neighbor_analysis_potential_for_lithium_nitride","332811531_PhysNet_A_Neural_Network_for_Predicting_Energies_Forces_Dipole_Moments_and_Partial_Charges","347685569_Electron-Passing_Neural_Networks_for_Atomic_Charge_Prediction_in_Systems_with_Arbitrary_Molecular_Charge","341953119_Incorporating_Electronic_Information_into_Machine_Learning_Potential_Energy_Surfaces_via_Approaching_the_Ground-State_Electronic_Energy_as_a_Function_of_Atom-Based_Electronic_Populations","341842570_FLAME_A_library_of_atomistic_modeling_environments","337559472_Incorporating_long-range_physics_in_atomic-scale_machine_learning"]}