{"id":"348953857_As_Tecnologias_Digitais_de_Informacao_e_Comunicacao_para_o_ensino_e_a_aprendizagem_de_Ciencias_da_Natureza_e_Matematica_na_perspectiva_da_BNCC","abstract":"Esta pesquisa tem por objetivo analisar o papel das Tecnologias Digitais de Informação e Comunicação (TDIC) para o processo de ensino e de aprendizagem de Ciências da Natureza e Matemática e suas Tecnologias, apresentadas na Base Nacional Comum Curricular (BNCC). Para alcançar o objetivo proposto este estudo adota uma abordagem metodológica de caráter qualitativo, do tipo documental, quanto ao seu delineamento, na qual foi realizada uma análise da BNCC - etapa do Ensino Médio. Como resultados, este trabalho traz uma análise e a discussão sobre as competências e habilidades a serem desenvolvidas a partir do uso das tecnologias digitais para as áreas de Ciências da Natureza e Matemática e suas Tecnologias. Verificamos que a área das Ciências da Natureza possui três competências específicas e 26 habilidades, sendo que as TDIC são abordadas em uma competência com 10 habilidades relacionadas, enquanto a área da Matemática possui cinco competências específicas e 43 habilidades das quais quatro competências e 19 habilidades sugerem o uso das TDIC. Com esses resultados pode-se concluir que as TDIC são importantes para o processo de ensino e aprendizagem, pois corroboram para o desenvolvimento das competências e habilidades nas áreas de Ciências da Natureza e Matemática e suas Tecnologias.","authors":["Paola Aquino","Anderson da Silva Rosa","Ana Marli Bulegon"],"meta":["January 2021Research Society and Development 10(1):e59510112157","DOI:10.33448/rsd-v10i1.12157"],"references":["342592433_Aplicativos_moveis_algumas_possibilidades_para_o_ensino_de_Quimica","338731355_Semiformacao_e_inteligencia_artificial_no_ensino","327924688_Metodologias_Ativas_de_Aprendizagem_Uma_Breve_Revisao","291015236_Tecnologias_Digitais_como_instrumentos_mediadores_da_aprendizagem_dos_nativos_digitais","343707593_O_ensino_de_Quimica_e_as_TDIC_uma_revisao_sistematica_de_literatura_e_uma_proposta_de_webquest_para_o_ensino_de_Ligacoes_Quimicas","335391586_Mobile-learning_aprendizagem_matematica_por_meio_de_realidade_aumentada","332587431_Aplicacoes_Moveis_com_Realidade_Aumentada_para_Potencializar_Livros","324784766_O_uso_do_tablet_para_a_representacao_de_conceitos_de_genetica_proposta_e_analise_com_base_na_Teoria_da_Atividade","308057415_Metodos_e_tecnicas_de_pesquisa_social"]}