{"id":"348909057_Automatic_Expansion_of_Domain-Specific_Affective_Models_for_Web_Intelligence_Applications","abstract":"Sentic computing relies on well-defined affective models of different complexity—polarity to distinguish positive and negative sentiment, for example, or more nuanced models to capture expressions of human emotions. When used to measure communication success, even the most granular affective model combined with sophisticated machine learning approaches may not fully capture an organisation’s strategic positioning goals. Such goals often deviate from the assumptions of standardised affective models. While certain emotions such as Joy and Trust typically represent desirable brand associations, specific communication goals formulated by marketing professionals often go beyond such standard dimensions. For instance, the brand manager of a television show may consider fear or sadness to be desired emotions for its audience. This article introduces expansion techniques for affective models, combining common and commonsense knowledge available in knowledge graphs with language models and affective reasoning, improving coverage and consistency as well as supporting domain-specific interpretations of emotions. An extensive evaluation compares the performance of different expansion techniques: (i) a quantitative evaluation based on the revisited Hourglass of Emotions model to assess performance on complex models that cover multiple affective categories, using manually compiled gold standard data, and (ii) a qualitative evaluation of a domain-specific affective model for television programme brands. The results of these evaluations demonstrate that the introduced techniques support a variety of embeddings and pre-trained models. The paper concludes with a discussion on applying this approach to other scenarios where affective model resources are scarce.","authors":["Albert Weichselbraun","Jakob Steixner","Adrian M.P. Brasoveanu","Arno Scharl"],"meta":["January 2022Cognitive Computation 14(1)","DOI:10.1007/s12559-021-09839-4"],"references":["343664461_New_trends_and_applications_in_social_media_analytics","343296595_Finding_Universal_Grammatical_Relations_in_Multilingual_BERT","347448071_The_Hourglass_Model_Revisited","346274631_SenticNet_6_Ensemble_Application_of_Symbolic_and_Subsymbolic_AI_for_Sentiment_Analysis","344722113_SemEval-2019_Task_3_EmoContext_Contextual_Emotion_Detection_in_Text","343302777_Sentiment_and_Emotion_help_Sarcasm_A_Multi-task_Learning_Framework_for_Multi-Modal_Sarcasm_Sentiment_and_Emotion_Analysis","343302486_A_Tale_of_a_Probe_and_a_Parser","343302038_Adversarial_and_Domain-Aware_BERT_for_Cross-Domain_Sentiment_Analysis","343296639_KinGDOM_Knowledge-Guided_DOMain_Adaptation_for_Sentiment_Analysis","342203531_K-BERT_Enabling_Language_Representation_with_Knowledge_Graph"]}