{"id":"348959718_COVID-DeepNet_Hybrid_Multimodal_Deep_Learning_System_for_Improving_COVID-19_Pneumonia_Detection_in_Chest_X-ray_Images","abstract":"Coronavirus (COVID-19) epidemic outbreak has devastating effects on daily lives and healthcare systems worldwide. This newly recognized virus is highly transmissible, and no clinically approved vaccine or antiviral medicine is currently available. Early diagnosis of infected patients through effective screening is needed to control the rapid spread of this virus. Chest radiography imaging is an effective diagnosis tool for COVID-19 virus and follow-up. Here, a novel hybrid multimodal deep learning system for identifying COVID-19 virus in chest X-ray (CX-R) images is developed and termed as the COVID-DeepNet system to aid expert radiologists in rapid and accurate image interpretation. First, Contrast-Limited Adaptive Histogram Equalization (CLAHE) and Butterworth bandpass filter were applied to enhance the contrast and eliminate the noise in CX-R images, respectively. Results from two different deep learning approaches based on the incorporation of a deep belief network and a convolutional deep belief network trained from scratch using a large-scale dataset were then fused. Parallel architecture, which provides radiologists a high degree of confidence to distinguish healthy and COVID-19 infected people, was considered. The proposed COVID-DeepNet system can correctly and accurately diagnose patients with COVID-19 with a detection accuracy rate of 99.93%, sensitivity of 99.90%, specificity of 100%, precision of 100%, F1-score of 99.93%, MSE of 0.021%, and RMSE of 0.016% in a large-scale dataset. This system shows efficiency and accuracy and can be used in a real clinical center for the early diagnosis of COVID-19 virus and treatment follow-up with less than 3 s per image to make the final decision.","authors":["Alaa S. Al-Waisy","Mazin Abed Mohammed","Shumoos Al-Fahdawi","Mashael Maashi"],"meta":["February 2021Computers, Materials and Continua 67(2):2409–2429","DOI:10.32604/cmc.2021.012955","Project: Covid-19 (Research, Data, Solutions, Certifications)"],"references":["351445526_Automatic_detection_of_coronavirus_disease_COVID-19_using_X-ray_images_and_deep_convolutional_neural_networks","350995969_Towards_an_effective_and_efficient_deep_learning_model_for_COVID-19_patterns_detection_in_X-ray_images","348162567_IoT_enabled_depthwise_separable_convolution_neural_network_with_deep_support_vector_machine_for_COVID-19_diagnosis_and_classification","347894768_COVIDNet-CT_A_Tailored_Deep_Convolutional_Neural_Network_Design_for_Detection_of_COVID-19_Cases_From_Chest_CT_Images","346716334_Detecting_Lumbar_Implant_and_Diagnosing_Scoliosis_from_Vietnamese_X-Ray_Imaging_Using_the_Pre-Trained_API_Models_and_Transfer_Learning","346504343_Deep_learning-based_model_for_detecting_2019_novel_coronavirus_pneumonia_on_high-resolution_computed_tomography","344158836_Global_Forecasting_Confirmed_and_Fatal_Cases_of_COVID-19_Outbreak_Using_Autoregressive_Integrated_Moving_Average_Model","341504617_Benchmarking_Methodology_for_Selection_of_Optimal_COVID-19_Diagnostic_Model_Based_on_Entropy_and_TOPSIS_Methods","352161852_Automatic_Detection_of_Coronavirus_Disease_COVID-19_in_X-ray_and_CT_Images_A_Machine_Learning_Based_Approach","344946202_Global_Forecasting_Confirmed_and_Fatal_Cases_of_COVID-19_Outbreak_Using_Autoregressive_Integrated_Moving_Average_Model"]}