{"id":"348945934_An_open_source_machine_learning_framework_for_efficient_and_transparent_systematic_reviews","abstract":"To help researchers conduct a systematic review or meta-analysis as efficiently and transparently as possible, we designed a tool to accelerate the step of screening titles and abstracts. For many tasks—including but not limited to systematic reviews and meta-analyses—the scientific literature needs to be checked systematically. Scholars and practitioners currently screen thousands of studies by hand to determine which studies to include in their review or meta-analysis. This is error prone and inefficient because of extremely imbalanced data: only a fraction of the screened studies is relevant. The future of systematic reviewing will be an interaction with machine learning algorithms to deal with the enormous increase of available text. We therefore developed an open source machine learning-aided pipeline applying active learning: ASReview. We demonstrate by means of simulation studies that active learning can yield far more efficient reviewing than manual reviewing while providing high quality. Furthermore, we describe the options of the free and open source research software and present the results from user experience tests. We invite the community to contribute to open source projects such as our own that provide measurable and reproducible improvements over current practice. It is a challenging task for any research field to screen the literature and determine what needs to be included in a systematic review in a transparent way. A new open source machine learning framework called ASReview, which employs active learning and offers a range of machine learning models, can check the literature efficiently and systemically.","authors":["Rens van de Schoot","Jonathan de Bruin","Raoul Schram","Parisa Zahedi"],"meta":["February 2021Nature Machine Intelligence 3(2):1-9","DOI:10.1038/s42256-020-00287-7"],"references":["345099697_Active_learning_for_screening_prioritization_in_systematic_reviews_-_A_simulation_study","343443719_Prediction_models_for_diagnosis_and_prognosis_of_covid-19_systematic_review_and_critical_appraisal","342049621_CORD-19_The_Covid-19_Open_Research_Dataset","338648266_Virus_Metagenomics_in_Farm_Animals_A_Systematic_Review","338587282_Error_rates_of_human_reviewers_during_abstract_screening_in_systematic_reviews","338567493_Software_tools_to_support_title_and_abstract_screening_for_systematic_reviews_in_healthcare_An_evaluation","336586189_Which_Academic_Search_Systems_are_Suitable_for_Systematic_Reviews_or_Meta-Analyses_Evaluating_Retrieval_Qualities_of_Google_Scholar_PubMed_and_26_other_Resources_OPEN_ACCESS","336209946_Cochrane_Handbook_for_Systematic_Reviews_of_Interventions","334476066_Snorkel_rapid_training_data_creation_with_weak_supervision","336996965_Sentence-BERT_Sentence_Embeddings_using_Siamese_BERT-Networks"]}