{"id":"348968927_Personalized_Book_Recommendation_System_using_Machine_Learning_Algorithm","abstract":"As the amounts of online books are exponentially increasing due to COVID-19 pandemic, finding relevant books from a vast e-book space becomes a tremendous challenge for online users. Personal recommendation systems have been emerged to conduct effective search which mine related books based on user rating and interest. Most of these existing systems are user-based ratings where content-based and collaborativebased learning methods are used. These systems' irrationality is their rating technique, which counts the users who have already been unsubscribed from the services and no longer rate books. This paper proposed an effective system for recommending books for online users that rated a book using the clustering method and then found a similarity of that book to suggest a new book. The proposed system used the K-means Cosine Distance function to measure distance and Cosine Similarity function to find Similarity between the book clusters. Sensitivity, Specificity, and F Score were calculated for ten different datasets. The average Specificity was higher than sensitivity, which means that the classifier could re-move boring books from the reader's list. Besides, a receiver operating characteristic curve was plotted to find a graphical view of the classifiers' accuracy. Most of the datasets were close to the ideal diagonal classifier line and far from the worst classifier line. The result concludes that recommendations, based on a particular book, are more accurately effective than a user-based recommendation system. © 2021, International Journal of Advanced Computer Science and Applications. All Rights Recerved.","authors":["Dhiman Sarma","Tanni Mittra","Mohammad Shahadat"],"meta":["January 2021International Journal of Advanced Computer Science and Applications 12(1)","DOI:10.14569/IJACSA.2021.0120126"],"references":["344300032_Democratizing_the_Development_of_Recommender_Systems_by_means_of_Low-code_Platforms","343043518_A_Rule-Based_Expert_System_to_Assess_Coronary_Artery_Disease_Under_Uncertainty","342055859_A_Combined_Belief_Rule_based_Expert_System_to_Predict_Coronary_Artery_Disease","345442173_Power_of_the_Few_Analyzing_the_Impact_of_Influential_Users_in_Collaborative_Recommender_Systems","344729328_Phishing_Attacks_Detection_using_Deep_Learning_Approach","344729080_Phishing_Attacks_Detection_using_Machine_Learning_Approach","344461149_Machine_Learning-Based_Phishing_Attack_Detection","343751822_Machine_Learning_based_Efficient_Recommendation_System_for_Book_Selection_using_User_based_Collaborative_Filtering_Algorithm","341314986_Development_of_an_Open_Source_Automated_Library_System_with_Book_Recommedation_System_for_Small_Libraries","340431123_Improving_Multi-class_Co-Clustering-Based_Collaborative_Recommendation_Using_Item_Tags","340058714_A_Belief_Rule_Based_Expert_System_to_Predict_Student_Performance_under_Uncertainty","338373249_Significant_spatial_patterns_from_the_GCM_seasonal_forecasts_of_global_precipitation","336926980_Context-aware_rule_learning_from_smartphone_data_survey_challenges_and_future_directions","335988033_A_new_Similarity_Measure_for_Collaborative_Filtering_based_Recommender_Systems","339293583_Small_Clues_Tell_a_Collaborative_Expansion_Approach_for_Effective_Content-Based_Recommendations"]}