{"id":"348941378_A_limited-size_ensemble_of_homogeneous_CNNLSTMs_for_high-performance_word_classification","abstract":"The strength of long short-term memory neural networks (LSTMs) that have been applied is more located in handling sequences of variable length than in handling geometric variability of the image patterns. In this paper, an end-to-end convolutional LSTM neural network is used to handle both geometric variation and sequence variability. The best results for LSTMs are often based on large-scale training of an ensemble of network instances. We show that high performances can be reached on a common benchmark set by using proper data augmentation for just five such networks using a proper coding scheme and a proper voting scheme. The networks have similar architectures (convolutional neural network (CNN): five layers, bidirectional LSTM (BiLSTM): three layers followed by a connectionist temporal classification (CTC) processing step). The approach assumes differently scaled input images and different feature map sizes. Three datasets are used: the standard benchmark RIMES dataset (French); a historical handwritten dataset KdK (Dutch); the standard benchmark George Washington (GW) dataset (English). Final performance obtained for the word-recognition test of RIMES was 96.6%, a clear improvement over other state-of-the-art approaches which did not use a pre-trained network. On the KdK and GW datasets, our approach also shows good results. The proposed approach is deployed in the Monk search engine for historical-handwriting collections.","authors":["Mahya Ameryan","Lambert Schomaker"],"meta":["July 2021Neural Computing and Applications 33(8)","DOI:10.1007/s00521-020-05612-0"],"references":["342799923_Handwriting_recognition_using_cohort_of_LSTM_and_lexicon_verification_with_extremely_large_lexicon","325920702_Data_augmentation_for_improving_deep_learning_in_image_classification_problem","325573647_An_analysis_of_rotation_matrix_and_colour_constancy_data_augmentation_in_classifying_images_of_animals","350652354_The_Psycho-Biology_Of_Language","349277064_Bidirectional_LSTM_Networks_for_Improved_Phoneme_Classification_and_Recognition","339025247_No_Padding_Please_Efficient_Neural_Handwriting_Recognition","330822296_Supervised_OCR_Error_Detection_and_Correction_Using_Statistical_and_Neural_Machine_Translation_Methods","329840417_Word_Beam_Search_A_Connectionist_Temporal_Classification_Decoding_Algorithm","329726402_Intelligent_Character_Recognition_using_Fully_Convolutional_Neural_Networks","329561904_Improving_CNN-RNN_Hybrid_Networks_for_Handwriting_Recognition"]}