{"id":"348908075_Conceptual_Temporal_Modeling_Applied_to_Databases","abstract":"We present a different approach to developing a concept of time for specifying temporality in the conceptual modeling of software and database systems. In the database field, various proposals and products address temporal data. The difficulty with most of the current approaches to modeling temporality is that they represent and record time as just another type of data (e.g., values of a bank balance or amounts of money), instead of appreciating that time and its values are unique, in comparison to typical data attributes. Time is an engulfing phenomenon that lifts a system's entire model from staticity to dynamism and beyond. In this paper, we propose a conceptualization of temporality involving the construction of a multilevel modeling method that progresses from static representation to system compositions that form regions of dynamism. Then, a chronology of events is used to define the system's behavior. Lastly, the events are viewed as data sources with which to build a temporal model. A case-study model of a temporal banking-management system database that extends UML and the object-constraint language is re-modeled using thinging machine (TM) modeling. The resultant TM diagrammatic specification delivers a new approach to temporality that can be extended to be a holistic monitoring system for historic data and events.","authors":["Sabah Al-Fedaghi"],"meta":["January 2021International Journal of Advanced Computer Science and Applications 12(1):524 -534","DOI:10.14569/IJACSA.2021.0120161"],"references":["347437701_Conceptual_Software_Engineering_Applied_to_Movie_Scripts_and_Stories","342924816_Modeling_the_Semantics_of_States_and_State_Machines","342097875_How_to_Document_Computer_Networks","341804532_Thinging-Oriented_Modeling_of_Unmanned_Aerial_Vehicles","340279370_Modeling_Network_Security_Case_Study_of_Email_System","328751889_Tracking_Systems_as_Thinging_Machine_A_Case_Study_of_a_Service_Company","340784904_Thinging-Based_Conceptual_Modeling_Case_Study_of_a_Tendering_System","335904577_A_lightweight_and_efficient_temporal_database_management_system_in_TDSQL","319284372_It's_About_Time_Applying_Temporality_to_Software_Development_Teams","316646255_Temporal_Conceptual_Models"]}