{"id":"348987475_Revisitando_ontologia_e_metadados_a_luz_dos_ambientes_informacionais_digitais","abstract":"RESUMO O cenário contemporâneo marcado pela explosão informacional torna-se imprescindível que os ambientes informacionais altamente distribuídos, como a Web, compartilhem e colaborem com dados e informações organizadas e estruturadas. Tal realidade tem desafiado profissionais de diversas áreas do conhecimento, sobretudo, os da área da Ciência da Informação a buscar soluções para o tratamento informacional de tais ambientes, a fim de garantir mecanismos para a busca e a recuperação de recursos informacionais eficientes. Elucida-se que o tratamento dado ao recurso informacional requer uma descrição de forma e de conteúdo legível por máquinas, com resultados compreensíveis aos humanos, e, que ainda, atenda aos requisitos de interoperabilidade entre os ambientes informacionais. Objetiva-se verificar a dimensão relacional entre os instrumentos para a representação de dados e informações, tais como a ontologia e os metadados, considerados como pilares para a modelagem, a estruturação de catálogos e sistemas bibliográficos. Por meio de uma metodologia exploratória e descritiva interdisciplinar nas áreas da Ciência da Informação e da Ciência da Computação identificam-se elementos conceituais, a fim de apontar a necessidade da construção de ambientes informacionais digitais estruturados e padronizados. A utilização da ontologia e dos metadados de forma sinérgica apresenta importância capital para a representação e a descrição de recursos bibliográficos nos ambientes informacionais digitais atualmente, proporcionando a modelagem dos catálogos bibliográficos e a interoperabilidade semântica entre diferentes sistemas e plataformas.","authors":["Fabiano Ferreira de Castro","Ana Carolina Simionato Arakaki"],"meta":["December 2020Perspectivas em Ciência da Informação 25(4):3-23","DOI:10.1590/1981-5344/3329"],"references":["239562368_A_Web_Semantica_e_suas_contribuicoes_para_a_ciencia_da_informacao","319911660_The_Metadata_Manual_A_practical_workbook","319394161_Resource_Description_Framework_RDF_Model_and_Syntax_Specification","314824867_Ontologies","303756787_Methodologies_for_the_creation_of_semantic_data","272645584_Metadata_and_Authority_Control","258152714_Ontologies","248525069_Metadata_Cataloging_by_Any_Other_Name","228671537_The_Role_of_ontologies_in_data_integration","227994602_Ontologies_and_the_Semantic_Web","26350002_El_concepto_de_metadato_Algo_mas_que_descripcion_de_recursos_electronicos","227984353_Metadata_A_Fundamental_Component_of_the_Semantic_Web","215500471_Linked_Data_Evolving_the_Web_into_a_Global_Data_Space","31514800_OS_METADADOS_COMO_INSTRUMENTOS_TECNOLOGICOS_NA_PADRONIZACAO_E_POTENCIALIZACAO_DOS_RECURSOS_INFORMACIONAIS_NO_AMBITO_DAS_BIBLIOTECAS_DIGITAIS_NA_ERA_DA_WEB_SEMANTICA"]}