{"id":"349013723_Generating_conjectures_on_fundamental_constants_with_the_Ramanujan_Machine","abstract":"Fundamental mathematical constants such as e and π are ubiquitous in diverse fields of science, from abstract mathematics and geometry to physics, biology and chemistry1,2. Nevertheless, for centuries new mathematical formulas relating fundamental constants have been scarce and usually discovered sporadically3–6. Such discoveries are often considered an act of mathematical ingenuity or profound intuition by great mathematicians such as Gauss and Ramanujan⁷. Here we propose a systematic approach that leverages algorithms to discover mathematical formulas for fundamental constants and helps to reveal the underlying structure of the constants. We call this approach ‘the Ramanujan Machine’. Our algorithms find dozens of well known formulas as well as previously unknown ones, such as continued fraction representations of π, e, Catalan’s constant, and values of the Riemann zeta function. Several conjectures found by our algorithms were (in retrospect) simple to prove, whereas others remain as yet unproved. We present two algorithms that proved useful in finding conjectures: a variant of the meet-in-the-middle algorithm and a gradient descent optimization algorithm tailored to the recurrent structure of continued fractions. Both algorithms are based on matching numerical values; consequently, they conjecture formulas without providing proofs or requiring prior knowledge of the underlying mathematical structure, making this methodology complementary to automated theorem proving8–13. Our approach is especially attractive when applied to discover formulas for fundamental constants for which no mathematical structure is known, because it reverses the conventional usage of sequential logic in formal proofs. Instead, our work supports a different conceptual framework for research: computer algorithms use numerical data to unveil mathematical structures, thus trying to replace the mathematical intuition of great mathematicians and providing leads to further mathematical research.","authors":["Gal Raayoni","Shahar Gottlieb","Yahel Manor","George Pisha"],"meta":["February 2021Nature 590(7844):67-73","DOI:10.1038/s41586-021-03229-4"],"references":["349571392_Automatic_conjecturing_and_proving_of_exact_values_of_some_infinite_families_of_infinite_continued_fractions","340669110_AI_Feynman_A_physics-inspired_method_for_symbolic_regression","338463447_Discovering_Physical_Concepts_with_Neural_Networks","338118180_The_irrationality_measure_of_p_is_at_most_7103205334137","334209824_Unsupervised_word_embeddings_capture_latent_knowledge_from_materials_science_literature","322818777_One_of_the_odd_zeta_values_from_zeta5_to_zeta25_is_irrational_By_elementary_means","345677469_A_B","335941512_Toward_an_artificial_intelligence_physicist_for_unsupervised_learning","322904965_Ramanujan_Modular_Equations_and_Approximations_to_Pi_or_How_to_Compute_One_Billion_Digits_of_Pi","321619355_Handbook_of_Continued_Fractions_for_Special_Functions","317543449_Deep-Learning_the_Landscape","314434469_Modular_forms_of_half_integral_weight","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","303496543_Rational_functions_certify_combinatorial_identities","303090573_On_Catalan'S_constant"]}