{"id":"349017865_A_mathematical_model_for_calculation_of_the_influence_of_ferromagnetic_components_in_Vertical_Displacement_Events_and_stability_simulations_of_tokamak_plasmas","abstract":"Iron core transformer tokamaks have a distinct element, namely the iron core which can affect the plasma stability of the plasma. As a consequence of the high non-linear dependence of the magneto-hydrodynamic solutions on the iron permeability μ Fe in JET tokamak for example, Vertical Displacement Events (VDEs), equilibrium and stability calculations are more complicated and more time consuming than in air core transformer tokamaks. By considering the ferromagnetic components as a linear, isotropic and homogeneous media on subdomains, it is known that these media can be replaced by a homogeneous one (vacuum) and a surface-current density distribution i F e ( l ) on the separation surfaces between subdomains, with l the curve taken along the curve separating two different magnetic media. For the case of geometry with rotational symmetry, this surface-current density distribution along a curve, in a meridian plane, is given by a Fredholm integral equation of second kind. Practically, the advantage of this method is more obvious for the inverse formulation of the VDEs and stability problems by moving the non-linear term (due to the iron permeability μ Fe ) from the differential operator to the r.h.s. of the equations. In this paper, we are presenting how the influence of ferromagnetic components in the equations of the surface currents developed in the vessel structures during Wall Touching Kink Modes (WTKMs) can be taken into account and are reviewing the equations to be solved in order to simulate the influence of the ferromagnetic components in VDEs and equilibrium stability calculations. The numerical results of these simulations for a real JET tokamak structure and plasma parameters will be reported in a future paper.","authors":["Calin Vlad Atanasiu","Leonid E. Zakharov","Matthias Hoelzl","Sergei Gerasimov"],"meta":["January 2021Journal of Physics Conference Series 1730(1):012115","DOI:10.1088/1742-6596/1730/1/012115"],"references":["329836657_Simulation_of_the_electromagnetic_wall_response_during_Vertical_Displacement_Events_VDE_in_ITER_tokamak","288039064_Electromagnetic_thin-wall_model_for_simulations_of_plasma_wall-touching_kink_and_vertical_modes","231151097_Numerical_computation_of_axisymmetric_MHD-equilibria_without_conducting_shell","231150506_Description_of_the_magnetohydrodynamic_equilibrium_in_iron_core_transformer_tokamaks","312038111_Simulation_of_surface_currents_excited_by_plasma_Wall-Touching_Kink_and_vertical_modes_in_tokamak","253881879_Plasma_Physics_and_the_Problem_of_Controlled_Thermonuclear_Reactions_Volume_4","238804378_Integral_equations_method_in_equilibrium_and_stability_computation_for_iron-core_transformer_tokamaks","230961604_Hydromagnetic_stability_of_tokamaks","229597012_Prediction_of_the_growth_rates_of_VDEs_in_JET","222732845_Numerical_determination_of_axisymmetric_toroidal_magnetohydrodynamic_equilibria"]}