{"id":"349048071_Addressing_limited_weight_resolution_in_a_fully_optical_neuromorphic_reservoir_computing_readout","abstract":"Using optical hardware for neuromorphic computing has become more and more popular recently, due to its efficient high-speed data processing capabilities and low power consumption. However, there are still some remaining obstacles to realizing the vision of a completely optical neuromorphic computer. One of them is that, depending on the technology used, optical weighting elements may not share the same resolution as in the electrical domain. Moreover, noise of the weighting elements are important considerations as well. In this article, we investigate a new method for improving the performance of optical weighting components, even in the presence of noise and in the case of very low resolution. Our method utilizes an iterative training procedure and is able to select weight connections that are more robust to quantization and noise. As a result, even with only 8 to 32 levels of resolution, in noisy weighting environments, the method can outperform both nearest rounding low-resolution weighting and random rounding weighting by up to several orders of magnitude in terms of bit error rate and can deliver performance very close to full-resolution weighting elements.","authors":["Chonghuai Ma","Floris Laporte","J. Dambre","Peter Bienstman"],"meta":["February 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-82720-4"],"references":["328161137_Training_Passive_Photonic_Reservoirs_With_Integrated_Optical_Readout","324745055_All-Optical_Machine_Learning_Using_Diffractive_Deep_Neural_Networks","323861000_Numerical_demonstration_of_neuromorphic_computing_with_photonic_crystal_cavities","317419072_ShiftCNN_Generalized_Low-Precision_Architecture_for_Inference_of_Convolutional_Neural_Networks","316553553_A_Multiple-Input_Strategy_to_Efficient_Integrated_Photonic_Reservoir_Computing","331602913_Machine_Learning_With_Neuromorphic_Photonics","329740169_Quantization_and_Training_of_Neural_Networks_for_Efficient_Integer-Arithmetic-Only_Inference","329346231_Open-Access_Silicon_Photonics_Current_Status_and_Emerging_Initiatives","324255030_Neuromorphic_computing_based_on_silicon_photonics_and_reservoir_computing","319574923_Reservoir_computing_with_signal-mixing_cavities"]}