{"id":"349051468_UML_Modeling_to_TM_Modeling_and_Back","abstract":"Certainly, the success of the Unified Modeling Language (UML) as the de facto standard for modeling software systems does not imply closing the door on scientific exploration or experimentation with modeling in the field. Continuing studies in this area can produce theoretical results that strengthen UML as the leading modeling language. Recently, a new modeling technique has been proposed called thinging machine (TM) modeling. This paper utilizes TM to further understand UML, with two objectives: (a) Fine issues in UML are studied, including theoretical notions such as events, objects, actions, activities, etc. Specifically, TM can be used to solve problems related to internal cross-diagram integration. (b) TM applies a different method of conceptualization, including building a model on one-category ontology in contrast to the object-oriented paradigm. The long-term objective of this study is to explore the possibility of TM complementing certain aspects in the UML methodology to develop and design software systems. Accordingly, we alternate between UML and TM modeling. A sample UML model is redesigned in TM, and then UML diagrams are extracted from TM. The results clarify many notions in both models. Particularly, the TM behavioral specification seems to be applicable in UML.","authors":["Sabah Al-Fedaghi"],"meta":["January 2021"],"references":["342097875_How_to_Document_Computer_Networks","341804532_Thinging-Oriented_Modeling_of_Unmanned_Aerial_Vehicles","340819801_Modeling_Network_Architecture_A_Cloud_Case_Study","335199252_Mistakes_in_UML_Diagrams_Analysis_of_Student_Projects_in_a_Software_Engineering_Course","220921181_A_Semiotic_Approach_to_UML_models","337679125_Modeling_Advanced_Persistent_Threats_A_Case_Study_of_APT38","330956349_Conceptual_Modeling_of_an_IP_Phone_Communication_System_A_Case_Study","320146053_Model-based_systems_engineering_with_OPM_and_SysML","283248951_Experience_in_Teaching_OOAD_to_Various_Students","253950571_DESIGN_OF_FORMAL_AIR_TRAFFIC_CONTROL_SYSTEM_THROUGH_UML"]}