{"id":"349086758_A_Unifying_Review_of_Deep_and_Shallow_Anomaly_Detection","abstract":"Deep learning approaches to anomaly detection (AD) have recently improved the state of the art in detection performance on complex data sets, such as large collections of images or text. These results have sparked a renewed interest in the AD problem and led to the introduction of a great variety of new methods. With the emergence of numerous such methods, including approaches based on generative models, one-class classification, and reconstruction, there is a growing need to bring methods of this field into a systematic and unified perspective. In this review, we aim to identify the common underlying principles and the assumptions that are often made implicitly by various methods. In particular, we draw connections between classic \"shallow\" and novel deep approaches and show how this relation might cross-fertilize or extend both directions. We further provide an empirical assessment of major existing methods that are enriched by the use of recent explainability techniques and present specific worked-through examples together with practical advice. Finally, we outline critical open challenges and identify specific paths for future research in AD.","authors":["Lukas Ruff","Jacob R. Kauffmann","Robert A. Vandermeulen","Gregoire Montavon"],"meta":["February 2021Proceedings of the IEEE PP(99):1-40","DOI:10.1109/JPROC.2021.3052449"],"references":["353120221_Rethinking_Assumptions_in_Deep_Anomaly_Detection","349636428_Explainable_Deep_One-Class_Classification","348974002_Interpreting_rate-distortion_of_variational_autoencoder_and_using_model_uncertainty_for_anomaly_detection","355882122_Natural_Adversarial_Examples","350445074_Generating_Artificial_Outliers_in_the_Absence_of_Genuine_Ones_-_A_Survey","349912113_Deep_Learning_for_Anomaly_Detection_A_Review","349209909_Self-Attentive_Classification-Based_Anomaly_Detection_in_Unstructured_Logs","348090737_Attribute_Restoration_Framework_for_Anomaly_Detection","347452526_Hybrid_Models_for_Open_Set_Recognition","347448200_Fixing_Bias_in_Reconstruction-Based_Anomaly_Detection_with_Lipschitz_Discriminators"]}