{"id":"349047462_GNSS_total_variometric_approach_first_demonstration_of_a_tool_for_real-time_tsunami_genesis_estimation","abstract":"Global Navigation Satellite System (GNSS) is used in seismology to study the ground displacements as well as to monitor the ionospheric total electron content (TEC) perturbations following seismic events. The aim of this work is to combine these two observations in one real-time method based on the Total Variometric Approach (TVA) to include the GNSS real-time data stream in future warning systems and tsunami genesis estimation observing both, ground motion and TEC. Our TVA couples together the Variometric Approach for Displacement Analysis Stand-alone Engine (VADASE) with the Variometric Approach for Real-Time Ionosphere Observation (VARION) algorithms. We apply the TVA to the Mw 8.3 Illapel earthquake, that occurred in Chile on September 16, 2015, and we demonstrate the coherence of the earthquake ground shaking and the TEC perturbation by using the same GNSS data stream in a real-time scenario. Nominally, we also highlight a stronger kinetic energy released in the north of the epicenter and visible in both, the ground motion and the TEC perturbation detect at 30 s and around 9.5 min after the rupture respectively. The high spatial resolution of ionospheric TEC measurement seems to match with the extent of the seismic source. The GNSS data stream by TVA of both the ground and ionospheric measurement opens today new perspectives to real-time warning systems for tsunami genesis estimation.","authors":["Michela Ravanelli","Giovanni Occhipinti","Giorgio Savastano","Attila Komjathy"],"meta":["February 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-82532-6"],"references":["342709885_Rapid_identification_of_tsunamigenic_earthquakes_using_GNSS_ionospheric_sounding","334636584_Advantages_of_Geostationary_Satellites_for_Ionospheric_Anomaly_Studies_Ionospheric_Plasma_Depletion_Following_a_Rocket_Launch","330744338_Earthquake_Early_Warning_Advances_Scientific_Challenges_and_Societal_Needs","330539041_Ionospheric_Detection_of_Explosive_Events","326718799_VADASE_Reliability_and_Accuracy_of_Real-Time_Displacement_Estimation_Application_to_the_Central_Italy_2016_Earthquakes","324545224_Real-time_tsunami_inundation_forecast_system_for_tsunami_disaster_prevention_and_mitigation","322995989_G-FAST_Earthquake_Early_Warning_Potential_for_Great_Earthquakes_in_Chile","322684852_Surface_waves_magnitude_estimation_from_ionospheric_signature_of_Rayleigh_waves_measured_by_Doppler_sounder_and_OTH_radar","337930768_Real-Time_Monitoring_of_Ionospheric_Irregularities_and_TEC_Perturbations","325513529_Role_of_Real-Time_GNSS_in_Near-Field_Tsunami_Forecasting"]}