{"id":"349010387_Machine_Learning_the_Warm_Rain_Process","abstract":"Abstract Clouds are critical for weather and climate prediction. The multiple scales of cloud processes make simulation difficult. Often models and measurements are used to develop empirical relationships for large‐scale models to be computationally efficient. Machine learning provides another potential tool to improve our empirical parameterizations of clouds. To explore these opportunities, we replace the warm rain formation process in a General Circulation Model (GCM) with a detailed treatment from a bin microphysical model that causes a 400% slowdown in the GCM. We analyze the changes in climate that result from the use of the bin microphysical calculation and find improvements in the rain onset and frequency of light rain compared to high resolution process models and observations. We also find a resulting change in the cloud feedback response of the model to warming, which will significantly impact the climate sensitivity. We then replace the bin microphysical model with several neural networks designed to emulate the autoconversion and accretion rates produced by the bin microphysical model. The neural networks are organized into two stages: the first stage identifies where tendencies will be nonzero (and the sign of the tendency), and the second stage predicts the magnitude of the autoconversion and accretion rates. We describe the risks of overfitting, extrapolation, and linearization by using perfect model experiments with and without the emulator. We can recover the solutions with the emulators in almost all respects, and get simulations that perform as the detailed model, but with the computational cost of the control simulation.","authors":["A. Gettelman","D. J. Gagne","C.‐C. Chen","Matt Christensen"],"meta":["February 2021Journal of Advances in Modeling Earth Systems 13(2)","DOI:10.1029/2020MS002268"],"references":["347216590_Simulating_Observations_of_Southern_Ocean_Clouds_and_Implications_for_Climate","343527586_A_Moist_Physics_Parameterization_Based_on_Deep_Learning","342667723_Stable_machine-learning_parameterization_of_subgrid_processes_for_climate_modeling_at_a_range_of_resolutions","338777770_Exploring_Impacts_of_Size-Dependent_Evaporation_and_Entrainment_in_a_Global_Model","338647324_The_Community_Earth_System_Model_version_2_CESM2","336721889_Bounding_Global_Aerosol_Radiative_Forcing_of_Climate_Change","334750250_Spatially_Extended_Tests_of_a_Neural_Network_Parametrization_Trained_by_Coarse-Graining","334503512_High_Climate_Sensitivity_in_the_Community_Earth_System_Model_version_2_CESM2","333170543_Strong_Dependence_of_Atmospheric_Feedbacks_on_Mixed-Phase_Microphysics_and_Aerosol-Cloud_Interactions_in_HadGEM3","336321129_Sensitivity_of_Climate_Simulations_to_the_Parameterization_of_Cumulus_Convection_in_the_Canadian_Climate_Centre_General_Circulation_Model"]}