{"id":"349049136_The_evolution_of_humanitarian_mapping_within_the_OpenStreetMap_community","abstract":"In the past 10 years, the collaborative maps of OpenStreetMap (OSM) have been used to support humanitarian efforts around the world as well as to fill important data gaps for implementing major development frameworks such as the Sustainable Development Goals. This paper provides a comprehensive assessment of the evolution of humanitarian mapping within the OSM community, seeking to understand the spatial and temporal footprint of these large-scale mapping efforts. The spatio-temporal statistical analysis of OSM’s full history since 2008 showed that humanitarian mapping efforts added 60.5 million buildings and 4.5 million roads to the map. Overall, mapping in OSM was strongly biased towards regions with very high Human Development Index. However, humanitarian mapping efforts had a different footprint, predominantly focused on regions with medium and low human development. Despite these efforts, regions with low and medium human development only accounted for 28% of the buildings and 16% of the roads mapped in OSM although they were home to 46% of the global population. Our results highlight the formidable impact of humanitarian mapping efforts such as post-disaster mapping campaigns to improve the spatial coverage of existing open geographic data and maps, but they also reveal the need to address the remaining stark data inequalities, which vary significantly across countries. We conclude with three recommendations directed at the humanitarian mapping community: (1) Improve methods to monitor mapping activity and identify where mapping is needed. (2) Rethink the design of projects which include humanitarian data generation to avoid non-sustainable outcomes. (3) Remove structural barriers to empower local communities and develop capacity.","authors":["Benjamin Herfort","Sven Lautenbach","Joao Porto De Albuquerque","Jennings Anderson"],"meta":["February 2021Scientific Reports 11(1)","DOI:10.1038/s41598-021-82404-z"],"references":["344226722_The_Evolution_of_National_Spatial_Data_Infrastructure_in_Pakistan-_Implementation_Challenges_and_the_Way_Forward","342918706_Modes_of_engagement_Reframing_sensing_and_data_generation_in_citizen_science_for_empowering_relationships","334812794_Mapping_Human_Settlements_with_Higher_Accuracy_and_Less_Volunteer_Efforts_by_Combining_Crowdsourcing_and_Deep_Learning","333232575_Corporate_Editors_in_the_Evolving_Landscape_of_OpenStreetMap","332269412_OSHDB_a_framework_for_spatio-temporal_analysis_of_OpenStreetMap_history_data","331693334_The_Subnational_Human_Development_Database","330733157_Advancing_Sustainability_Together_Citizen-Generated_Data_and_the_Sustainable_Development_Goals","328655434_The_Good_the_Bad_and_the_Uncertain_Contributions_of_Volunteered_Geographic_Information_to_Community_Disaster_Resilience","341992631_Exploration_of_OpenStreetMap_Missing_Built-up_Areas_using_Twitter_Hierarchical_Clustering_and_Deep_Learning_in_Mozambique","328073985_Simple_Features_for_R_Standardized_Support_for_Spatial_Vector_Data"]}