{"id":"349063984_Bloom's_Taxonomy_to_Improve_Teaching-Learning_in_Introduction_to_Programming","abstract":"Students in computer science courses entering higher education begin with computer thinking and programming languages in a curricular unit (CU) that can be referred to in various ways, like CS1 or programming fundamentals. This CU is very important for the academic and professional path of those students. Teachers and those responsible for those courses must carefully define the learning objectives, the learning strategies and the assessment of this teaching-learning. Bloom's taxonomy, in its different variations, is a powerful tool that helps in these tasks and that gives clear indications on the language that is to be used-which is useful for perceiving both the level of colleagues and the level of accreditations and assessments of courses. This article provides a detailed description of Bloom's taxonomy and its changes over the years. Studies carried out in the context of teaching fundamentals of programming and using Bloom's taxonomy are listed and analyzed. In the end, the conclusions and the definition of future works are made. Index Terms-Bloom's taxonomy, CSE, CS1, introduction to programming.","authors":["Sonia Rolland Sobral"],"meta":["March 2021International Journal of Information and Education Technology 11(3):148-153","DOI:10.18178/ijiet.2021.11.3.1504"],"references":["323331341_A_Systematic_Review_of_the_Use_of_Bloom's_Taxonomy_in_Computer_Science_Education","303809631_Bloom's_taxonomy_for_CS_assessment","250984421_Taxonomia_de_Bloom_revisao_teorica_e_apresentacao_das_adequacoes_do_instrumento_para_definicao_de_objetivos_instrucionais","314721314_Introductory_programming_criterion-referencing_and_bloom","311475095_Learning_strategies_sessions_within_the_classroom_in_computing_science_university_courses","280496864_Bloom's_taxonomy_of_cognitive_learning_objectives","271790064_Identifying_Course_Goals_Domains_and_Levels_of_Learning","269667479_Les_strategies_d'apprentissage_un_cadre_de_reference_simplifie","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives","239926276_A_Categorization_of_Novice_Programmers_A_Cluster_Analysis_Study"]}