{"id":"349016850_Sparse_Pose_Graph_Optimization_in_Cycle_Space","abstract":"The state-of-the-art modern pose-graph optimization (PGO) systems are vertex based. In this context, the number of variables might be high, albeit the number of cycles in the graph (loop closures) is relatively low. For sparse problems particularly, the cycle space has a significantly smaller dimension than the number of vertices. By exploiting this observation, in this article, we propose an alternative solution to PGO that directly exploits the cycle space. We characterize the topology of the graph as a cycle matrix, and reparameterize the problem using relative poses, which are further constrained by a cycle basis of the graph. We show that by using a minimum cycle basis, the cycle-based approach has superior convergence properties against its vertex-based counterpart, in terms of convergence speed and convergence to the global minimum. For sparse graphs, our cycle-based approach is also more time efficient than the vertex-based. As an additional contribution of this work, we present an effective algorithm to compute the minimum cycle basis. Albeit known in computer science, we believe that this algorithm is not familiar to the robotics community. All the claims are validated by experiments on both standard benchmarks and simulated datasets. To foster the reproduction of the results, we provide a complete open-source C++ implementation1 of our approach.","authors":["Fang Bai","Teresa Vidal-Calleja","Giorgio Grisetti"],"meta":["February 2021IEEE Transactions on Robotics PP(99):1-20","DOI:10.1109/TRO.2021.3050328"],"references":["323597481_Invariant_Smoothing_on_Lie_Groups","321953519_Invariant_Kalman_Filtering","314164153_SLAM_-A_highly_efficient_and_temporally_scalable_incremental_SLAM_framework","330800948_Linear_SLAM_Linearising_the_SLAM_problems_using_submap_joining","330743282_Direct_Relative_Edge_Optimization_A_Robust_Alternative_for_Pose_Graph_Optimization","325767351_State_estimation_for_robotics","322566613_Robust_Incremental_SLAM_Under_Constrained_Optimization_Formulation","319700412_ProSLAM_Graph_SLAM_from_a_Programmer's_Perspective","319132170_Factor_Graphs_for_Robot_Perception","318036030_Cartan-Sync_Fast_and_Global_SEd-Synchronization"]}