{"id":"349050712_Exploring_author_gender_in_book_rating_and_recommendation","abstract":"Collaborative filtering algorithms find useful patterns in rating and consumption data and exploit these patterns to guide users to good items. Many of these patterns reflect important real-world phenomena driving interactions between the various users and items; other patterns may be irrelevant or reflect undesired discrimination, such as discrimination in publishing or purchasing against authors who are women or ethnic minorities. In this work, we examine the response of collaborative filtering recommender algorithms to the distribution of their input data with respect to one dimension of social concern, namely content creator gender. Using publicly available book ratings data, we measure the distribution of the genders of the authors of books in user rating profiles and recommendation lists produced from this data. We find that common collaborative filtering algorithms tend to propagate at least some of each user’s tendency to rate or read male or female authors into their resulting recommendations, although they differ in both the strength of this propagation and the variance in the gender balance of the recommendation lists they produce. The data, experimental design, and statistical methods are designed to be reusable for studying potentially discriminatory social dimensions of recommendations in other domains and settings as well.","authors":["Michael D. Ekstrand","Daniel Kluver"],"meta":["July 2021User Modeling and User-Adapted Interaction 31(6)","DOI:10.1007/s11257-020-09284-2"],"references":["344301569_Array_programming_with_NumPy","339008987_SciPy_10_fundamental_algorithms_for_scientific_computing_in_Python","347582581_Roles_for_computing_in_social_change","346275813_Evaluating_Stochastic_Rankings_with_Expected_Exposure","346270750_LensKit_for_Python_Next-Generation_Software_for_Recommender_Systems_Experiments","345658303_Bayesian_Data_Analysis","340177686_Data_Structures_for_Statistical_Computing_in_Python","337135215_Discrimination_through_Optimization_How_Facebook's_Ad_Delivery_Can_Lead_to_Biased_Outcomes","334719341_Fairness_in_Recommendation_Ranking_through_Pairwise_Comparisons","333071753_Quantifying_the_Impact_of_User_Attentionon_Fair_Group_Representation_in_Ranked_Lists","330087630_Gender_homophily_in_online_book_networks","328439354_Towards_a_Fair_Marketplace_Counterfactual_Evaluation_of_the_trade-off_between_Relevance_Fairness_Satisfaction_in_Recommendation_Systems","327949770_Calibrated_recommendations","327948540_Item_recommendation_on_monotonic_behavior_chains","327464765_Debiasing_Desire_Addressing_Bias_Discrimination_on_Intimate_Platforms"]}