{"id":"349097304_Data_objects_for_knowing","abstract":"Although true in some aspects, the suggested characterization of today’s science as a dichotomy between traditional science and data-driven science misses some of the nuance, complexity, and possibility that exists between the two positions. Part of the problem is the claim that Data Science works without theories. There are many theories behind the data that are used in science. However, for data science, the only theories that matter are those in mathematics, statistics, and computer science. In this conceptual paper, we add two other philosophy of science tenets, experiments and data, to the discussion to create a more nuanced view of how data science uses theories. Following Ihde’s concept of technoscience and the incessant quest for more precision, magnification, and resolution, we argue that technology-driven science created a need for more technology-driven science, culminating in data science. Further, we adapt Hacking and Galison’s views on physics to argue that data science is also an experimental science, which uses data objects in experiments. Drawing from Heelan (The Journal of Philosophy 85:515–524, 1988), we called these objects “data-objects-for-knowing”. Finally, we conclude that data science is a science to study artificially created phenomena—a science to study the data manipulated by the equations and operations of AI. It disregards the connections between data and the real world that were carefully built by the theories from other sciences. In the experiments of data science, data are the world itself. The knowledge created by data science is purposely disconnected from any theory from other sciences; it is a knowledge for the sake of itself.","authors":["Fred Fonseca"],"meta":["February 2021AI & SOCIETY","DOI:10.1007/s00146-021-01150-y"],"references":["339349320_Prospecting_in_the_data_sciences","333343048_The_logic_of_domains","346440996_Consolations_for_the_Specialist","344100186_Data_Instruments_and_Theory_A_Dialectical_Approach_to_Understanding_Science","329648337_The_Stuff_of_Bits_An_Essay_on_the_Materialities_of_Information","329517239_Cyber-human_systems_of_thought_and_understanding","324937048_The_Structure_of_Scientific_Revolutions","324392591_Space_Perception_and_the_Philosophy_of_Science","319393294_Logic_of_Scientific_Discovery","318384082_The_scientists'_apprentice","308573686_Big_Data_epistemology_and_causality_Knowledge_in_and_knowledge_out_in_EXPOsOMICS","318383594_AI_people_and_society","318382945_The_cyberscientist","318071894_Data_Science_A_Comprehensive_Overview","317164996_Husserl's_missing_technologies"]}