{"id":"349097182_Teaching_Mathematics_to_Computer_Scientists_Reflections_and_a_Case_Study","abstract":"Mathematics, despite being the foundation of computer science, is nowadays often considered a totally separate subject. The fact that many jobs in computer science do not explicitly require any specific mathematical knowledge posed questions about the importance of mathematics within computer science undergraduate curricula. In many educational systems, a prior high school knowledge of mathematics is often not a mandatory requirement to be enrolled into a degree of computer science. On the other hand, several studies report that mathematics is important to computer scientists since it provides essential analytical and critical skills and since many professional and research tasks in computer science require an in-depth understanding of mathematical concepts. From this assumption, this article proposes an analysis of the cohort of computer science’ students, with a specific reference to British Universities, and identifies some challenges that lecturers of mathematical subjects normally face. On the basis of this analysis this article proposes two teaching techniques to promote effective learning. The proposed techniques aim at addressing the diversity of cohorts in terms of mathematical background and skepticism from part of the cohort of students to consider mathematics as an essential element of their education. Numerical results indicate the validity and effectiveness of the proposed teaching techniques.","authors":["Ferrante Neri"],"meta":["April 2021SN Computer Science 2(2)","DOI:10.1007/s42979-021-00461-7"],"references":["344035493_Breast_Cancer_Prediction_A_Comparative_Study_Using_Machine_Learning_Techniques","340852807_Tangible_Tools_in_Mathematics_for_Engineering_Students_Experimental_Activity_at_Politecnico_di_Torino","340562183_An_Approach_for_Efficient_and_Secure_Data_Encryption_Scheme_for_Spatial_Data","335680931_Theoretical_and_Computational_Analysis_of_the_Falling_Ladder_Problem","334113365_Data_Science_for_Genomic_Data_Management_Challenges_Resources_Experiences","333817006_Theories-based_Inclusive_Education_Practices","346702559_Covariance_Local_Search_for_Memetic_Frameworks_A_Fitness_Landscape_Analysis_Approach","340534890_A_Local_Search_for_Numerical_Optimisation_Based_on_Covariance_Matrix_Diagonalisation","339979274_Foundation_Mathematics_for_Computer_Science_A_Visual_Approach","334713108_Linear_Algebra_for_Computational_Sciences_and_Engineering"]}