{"id":"349132027_Experimental_demonstration_of_quantum_advantage_for_NP_verification_with_limited_information","abstract":"In recent years, many computational tasks have been proposed as candidates for showing a quantum computational advantage, that is an advantage in the time needed to perform the task using a quantum instead of a classical machine. Nevertheless, practical demonstrations of such an advantage remain particularly challenging because of the difficulty in bringing together all necessary theoretical and experimental ingredients. Here, we show an experimental demonstration of a quantum computational advantage in a prover-verifier interactive setting, where the computational task consists in the verification of an NP-complete problem by a verifier who only gets limited information about the proof sent by an untrusted prover in the form of a series of unentangled quantum states. We provide a simple linear optical implementation that can perform this verification task efficiently (within a few seconds), while we also provide strong evidence that, fixing the size of the proof, a classical computer would take much longer time (assuming only that it takes exponential time to solve an NP-complete problem). While our computational advantage concerns a specific task in a scenario of mostly theoretical interest, it brings us a step closer to potential useful applications, such as server-client quantum computing.","authors":["Federico Centrone","Niraj Kumar","Eleni Diamanti","Iordanis Kerenidis"],"meta":["February 2021Nature Communications 12(1)","DOI:10.1038/s41467-021-21119-1"],"references":["336744162_Quantum_supremacy_using_a_programmable_superconducting_processor","335797598_Practically_Feasible_Robust_Quantum_Money_with_Classical_Verification","335766671_Experimental_demonstration_of_quantum_advantage_for_one-way_communication_complexity_surpassing_best-known_classical_protocol","334810041_A_survey_on_zero_knowledge_range_proofs_and_applications","320920177_Quantum_superiority_for_verifying_NP-complete_problems_with_linear_optics","320177251_Classical_boson_sampling_algorithms_with_superior_performance_to_near-term_experiments","350112004_3-Local_Hamiltonian_is_QMA-complete","337797833_Quantum_Supremacy_for_Simulating_A_Translation-Invariant_Ising_Spin_Model","333911289_Faster_k_-SAT_algorithms_using_biased-PPSZ","332159886_Experimental_Gaussian_Boson_Sampling"]}