{"id":"349116296_Optimizing_Ontology_Alignment_through_Linkage_Learning_on_Entity_Correspondences","abstract":"Data heterogeneity is the obstacle for the resource sharing on Semantic Web (SW), and ontology is regarded as a solution to this problem. However, since different ontologies are constructed and maintained independently, there also exists the heterogeneity problem between ontologies. Ontology matching is able to identify the semantic correspondences of entities in different ontologies, which is an effective method to address the ontology heterogeneity problem. Due to huge memory consumption and long runtime, the performance of the existing ontology matching techniques requires further improvement. In this work, an extended compact genetic algorithm-based ontology entity matching technique (ECGA-OEM) is proposed, which uses both the compact encoding mechanism and linkage learning approach to match the ontologies efficiently. Compact encoding mechanism does not need to store and maintain the whole population in the memory during the evolving process, and the utilization of linkage learning protects the chromosome's building blocks, which is able to reduce the algorithm's running time and ensure the alignment's quality. In the experiment, ECGA-OEM is compared with the participants of ontology alignment evaluation initiative (OAEI) and the state-of-the-art ontology matching techniques, and the experimental results show that ECGA-OEM is both effective and efficient.","authors":["Xingsi Xue","Chaofan Yang","Chao Jiang","Pei-Wei Tsai"],"meta":["February 2021Complexity 2021(4):1-12","DOI:10.1155/2021/5574732"],"references":["340482189_Optimizing_Sensor_Ontology_Alignment_through_Compact_co-Firefly_Algorithm","339669607_Improved_Compact_Cuckoo_Search_Algorithm_Applied_to_Location_of_Drone_Logistics_Hub","339129280_A_compact_firefly_algorithm_for_matching_biomedical_ontologies","338733024_A_Compact_Pigeon-Inspired_Optimization_for_Maximum_Short-Term_Generation_Mode_in_Cascade_Hydroelectric_Power_Station","337008772_An_Ontology_Alignment_Approach_Combining_Word_Embedding_and_the_Radius_Measure","335129405_Context-aware_instance_matching_through_graph_embedding_in_lexical_semantic_space","342879148_Optimizing_Hydrography_Ontology_Alignment_Through_Compact_Particle_Swarm_Optimization_Algorithm","339409942_A_Compact_co-Firefly_Algorithm_for_Matching_Ontologies","339276364_Optimizing_biomedical_ontology_alignment_in_lexical_vector_space","331737557_Using_Compact_Evolutionary_Tabu_Search_algorithm_for_matching_sensor_ontologies"]}